Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, hu, pt_pt, ru

source: By the way, I use the word *attribute* for any name following a dot --- for example, in the expression ``z.real``, ``real`` is an attribute of the object ``z``. Strictly speaking, references to names in modules are attribute references: in the expression ``modname.funcname``, ``modname`` is a module object and ``funcname`` is an attribute of it. In this case there happens to be a straightforward mapping between the module's attributes and the global names defined in the module: they share the same namespace! [#]_
fa: به‌هرحال، من واژهٔ *ویژگی* «*attribute*» را برای هر نامی که بعد از یک نقطه بیاید به کار می‌برم — برای مثال، در عبارت ``z.real``, ``real`` یک ویژگیِ شیءِ ``z`` است. از نظر دقیق‌تر، ارجاع به نام‌ها در ماژول‌ها نیز نوعی ارجاع به ویژگی محسوب می‌شود: در عبارت ``modname.funcname``, ``modname`` یک شیءِ ماژول است و ``funcname`` یکی از ویژگی‌های آن است. در این حالت، نگاشتی ساده و مستقیم بین ویژگی‌های ماژول و نام‌های سراسری تعریف‌شده در آن وجود دارد: هر دو یک فضای نام (namespace) را به اشتراک می‌گذارند! [#]_
hu: Egyébként a *jellemző* szót használom bármilyen névre, ami pontot követ jellemzője. Szigorúan véve egy modulbeli névre való hivatkozás egy jellemző-hivatkozás: a ``modulnev.fuggvenynev`` kifejezésben a ``modulnev`` egy modul objektum és a ``fuggvenynev`` annak egy jellemzője. Ebben az esetben közvetlen hozzárendelés történik a modul jellemzői és a modulban definiált globális nevek között: ezek ugyanazon a névtéren osztoznak. [#]_
pt_pt: A propósito, uso a palavra *atributo* para qualquer nome que siga um ponto — por exemplo, na expressão ``z.real``, ``real`` é um atributo do objeto ``z``. Falando estritamente, as referências a nomes em módulos são referências de atributos: na expressão ``modname.funcname``, ``modname`` é um objeto de módulo e ``funcname`` é um atributo desse objeto. Neste caso, existe um mapeamento direto entre os atributos do módulo e os nomes globais definidos no módulo: partilham o mesmo espaço de nomes!
ru: Кстати, я использую слово *атрибут* для любого имени, следующего после точки — например, в выражении ``z.real``, ``real`` — это атрибут объекта ``z``. Строго говоря, обращения к именам в модулях являются обращением к атрибутам: в выражении ``modname.funcname``, ``modname`` является объектом модуля, и ``funcname`` является его атрибутом. В этом случае есть прямое соответствие между атрибутами модуля и глобальными именами, объявленными в модуле: они используют одно и то же пространство имён! [#]_

source: Attributes may be read-only or writable. In the latter case, assignment to attributes is possible. Module attributes are writable: you can write ``modname.the_answer = 42``. Writable attributes may also be deleted with the :keyword:`del` statement. For example, ``del modname.the_answer`` will remove the attribute :attr:`!the_answer` from the object named by ``modname``.
fa: ویژگی ها ممکن است فقط خواندنی یا قابل نوشتن باشند. در حالت دوم، اختصاص دادن به ویژگی ها ممکن است. ویژگی های ماژول قابل نوشتن هستند: می توانید ``modname.the_answer = 42`` را بنویسید. ویژگی های قابل نوشتن را می توان با دستور :keyword:`del` نیز حذف کرد. به عنوان مثال، ``del modname.the_answer`` ویژگی :attr:`!the_answer` را از شیئی که توسط ``modname`` نامگذاری شده است حذف خواهد کرد.
pt_pt: Os atributos podem ser apenas de leitura ou graváveis. Neste último caso, a atribuição a atributos é possível. Os atributos de módulo são graváveis: pode escrever ``modname.the_answer = 42``. Os atributos graváveis também podem ser eliminados com a instrução :keyword:`del`. Por exemplo, ``del modname.the_answer`` removerá o atributo :attr:`!the_answer` do objeto nomeado por ``modname``.
ru: Атрибуты могут быть доступными только для чтения или изменяемыми. В последнем случае возможно присваивание атрибутам. Атрибуты модуля изменяемы: вы можете записать ``modname.the_answer = 42``. Изменяемые атрибуты также могут быть удалены с помощью инструкции :keyword:`del`. Например, ``del modname.the_answer`` удалит атрибут :attr:`!the_answer` у объекта, названного ``modname``.

source: Namespaces are created at different moments and have different lifetimes. The namespace containing the built-in names is created when the Python interpreter starts up, and is never deleted. The global namespace for a module is created when the module definition is read in; normally, module namespaces also last until the interpreter quits. The statements executed by the top-level invocation of the interpreter, either read from a script file or interactively, are considered part of a module called :mod:`__main__`, so they have their own global namespace. (The built-in names actually also live in a module; this is called :mod:`builtins`.)
fa: فضاهای نام در لحظات مختلف ایجاد می شوند و دارای طول عمرهای متفاوتی هستند. فضای نام که شامل نام های داخلی است، زمانی که مفسر پایتون شروع به کار می کند ایجاد می شود و هرگز حذف نمی شود. فضای نام عمومی برای یک ماژول زمانی که تعریف ماژول خوانده می شود ایجاد می گردد؛ به طور معمول، فضاهای نام ماژول نیز تا زمانی که مفسر پایان یابد باقی می مانند. دستوراتی که توسط اجرای سطح بالای مفسر، یا از فایل اسکریپت خوانده شده یا به طور تعاملی اجرا می شوند، به عنوان بخشی از ماژولی به نام :mod:`__main__` در نظر گرفته می شوند، بنابراین آن ها فضای نام عمومی خود را دارند. (نام‌های درون‌ساخت نیز در واقع در یک ماژول قرار دارند؛ این ماژول :mod:`builtins` نامیده می شود.)
hu: A névterek különböző időpontokban születnek, és élettartamuk is változó. Az a névtér, amely a Python értelmező beépített neveit tartalmazza, a Python-értelmező indulásakor jön létre, és nem törölhető. A modulok globális névtere a moduldefiníció olvasásakor jön létre; általános esetben a modul névterek az értelmezőből való kilépésig megmaradnak. Az utasításokat, amelyet az értelmező felső szintje futtat le, vagy egy szkriptfájlból kiolvasva, vagy interaktív módon, azokat :mod:`__main__` modul részének tekinti a Python, ezért saját névtérrel rendelkeznek. (A beépített nevek szintén egy modulban léteznek, :mod:`builtins` név alatt.)
pt_pt: Os espaços de nomes são criados em momentos diferentes e têm tempos de vida distintos. O espaço de nomes que contém os nomes incorporados é criado quando o interpretador Python é iniciado e nunca é eliminado. O espaço de nomes global para um módulo é criado quando a definição do módulo é lida; normalmente, os espaços de nomes dos módulos também duram até que o interpretador termine. As instruções executadas pela invocação de nível superior do interpretador, lidas a partir de um ficheiro de script ou interativamente, são consideradas parte de um módulo chamado :mod:`__main__`, pelo que têm o seu próprio espaço de nomes global. (Os nomes incorporados residem, de facto, num módulo; este é chamado :mod:`builtins`.)
ru: Пространства имён создаются в разное время и имеют разные времена жизни. Пространство имён, содержащее встроенные имена, создаётся при запуске интерпретатора Python и никогда не удаляется. Глобальное пространство имён модуля создаётся при чтении определения модуля; обычно оно существует до завершения работы интерпретатора. Инструкции, исполняемые на верхнем уровне работы интерпретатора, считываемые из файла скрипта или интерактивно, считаются частью модуля :mod:`__main__`, поэтому относятся к собственному глобальному пространству имён. (Встроенные имена также существуют в модуле; он называется :mod:`builtins`.)

source: The local namespace for a function is created when the function is called, and deleted when the function returns or raises an exception that is not handled within the function. (Actually, forgetting would be a better way to describe what actually happens.) Of course, recursive invocations each have their own local namespace.
fa: فضای نام محلی برای یک تابع زمانی ایجاد می‌شود که تابع فراخوانی شود و زمانی که تابع بازمی‌گردد یا استثنایی پرتاب می‌کند که در درون تابع مدیریت نمی‌شود، حذف می‌گردد. (در واقع، «فراموش شدن» توصیف بهتری برای چیزی است که واقعاً اتفاق می‌افتد.) البته، هر فراخوانی بازگشتی، فضای نام محلی خودش را دارد.
hu: A függvények helyi névtere a függvény hívásakor keletkezik, és a függvény lefutásakor, vagy a függvényben le nem kezelt kivételek létrejöttekor szűnnek meg. (Talán a felejtés szó pontosabb kifejezés lenne arra, ami történik.) Természetesen a rekurzív hívások mindegyike saját, helyi névtérrel rendelkezik.
pt_pt: O espaço de nomes local para uma função é criado quando a função é chamada e eliminado quando a função retorna ou levanta uma exceção que não é tratada dentro da função. (Na verdade, esquecer seria uma melhor forma de descrever o que realmente acontece.) Claro, invocações recursivas têm cada uma o seu próprio espaço de nomes local.
ru: Локальное пространство имён функции создаётся в момент вызова функции и удаляется, когда функция возвращает значение или выбрасывает не обрабатываемое внутри неё исключение. (На самом деле, забывание было бы лучшим способом описать то, что происходит.) Разумеется, каждый рекурсивный вызов имеет своё собственное пространство имён.

source: A *scope* is a textual region of a Python program where a namespace is directly accessible. "Directly accessible" here means that an unqualified reference to a name attempts to find the name in the namespace.
fa: یک *دامنه* «*scope*» یک ناحیه متنی از یک برنامه پایتون است که در آن یک فضای نام «namespace» به طور مستقیم قابل دستیابی است. "به طور مستقیم قابل دستیابی" در اینجا به این معنی است که یک ارجاع بدون صلاحیت به یک نام تلاش می کند تا نام «name» را در فضای نام «namespace» پیدا کند.
hu: A *hatókör* (angolul scope) a Python kód azon szöveges része ahol a névtér közvetlenül elérhető. A közvetlen elérhetőség itt azt jelenti, hogy a név a teljes elérési útjának kifejtése nélkül elérhető a névtérben. (például a ``z.real``-ben a . jelzi, hogy a ``z`` objektumhoz tartozó jellemzőről van szó, ez itt most teljesen kifejtett.)
pt_pt: Um *âmbito* é uma região textual de um programa Python onde um espaço de nomes é diretamente acessível. "Diretamente acessível" significa aqui que uma referência não qualificada a um nome tenta encontrar o nome no espaço de nomes.
ru: *Область видимости* — это текстовая область программы Python, в которой пространство имён доступно напрямую. "Доступно напрямую" здесь означает, что обращение к имени без префикса пытается найти его в этом пространстве имён.

source: Although scopes are determined statically, they are used dynamically. At any time during execution, there are 3 or 4 nested scopes whose namespaces are directly accessible:
fa: اگرچه حوزه ها به صورت ایستا تعیین می شوند، اما به صورت پویا مورد استفاده قرار می گیرند. در هر لحظه ای از اجرای برنامه، ۳ یا ۴ حوزه ی تودرتو وجود دارند که فضای نام های آنها به طور مستقیم قابل دسترسی است:
pt_pt: Embora os âmbitos sejam determinados estaticamente, são usados dinamicamente. Em qualquer momento durante a execução, existem 3 ou 4 âmbitos aninhados cujos espaços de nomes são diretamente acessíveis:
ru: Хотя области видимости определяются статически, но используются они динамически. В любой момент исполнения программы у неё есть 3 или 4 вложенные области видимости, чьи пространства имён доступны напрямую:

source: the innermost scope, which is searched first, contains the local names
fa: درونی ترین حوزه، که ابتدا جستجو می شود، شامل نام های محلی است
hu: a legbelső hatókör, amelyben először keresünk, a helyi neveket tartalmazza
pt_pt: o âmbito mais interno, que é pesquisado primeiro, contém os nomes locais
ru: самая внутренняя область видимости, которая просматривается в первую очередь, содержит локальные имена

source: the scopes of any enclosing functions, which are searched starting with the nearest enclosing scope, contain non-local, but also non-global names
fa: حوزه های هر تابع محاطی که جستجو از نزدیک ترین حوزه محاطی شروع می شود، شامل نام هایی است که نه محلی هستند و نه سراسری.
pt_pt: os âmbitos de quaisquer funções envolventes, que são pesquisados começando com o âmbito envolvente mais próximo, contêm nomes não-locais, mas também não-globais
ru: области видимости любых внешних функций, которые просматриваются, начиная с ближайшей, содержат не локальные, но и не глобальные имена

source: the next-to-last scope contains the current module's global names
fa: حوزه قبل از آخر شامل نام های عمومی ماژول جاری است.
hu: at utolsó előttiként vizsgált hatáskör az aktuális modul globális neveit tartalmazza
pt_pt: o penúltimo âmbito contém os nomes globais do módulo atual
ru: предпоследняя область видимости включает глобальные имена текущего модуля

source: the outermost scope (searched last) is the namespace containing built-in names
fa: بیرونی ترین حوزه (که در نهایت جستجو می شود) نام فضایی است که شامل نام های پیش ساخته است.
hu: a legkülső (utolsónak vizsgált) hatókör a beépített neveket tartalmazó névtér
pt_pt: o âmbito mais externo (pesquisado por último) é o espaço de nomes que contém os nomes incorporados
ru: самая внешняя областью видимости (просматривается последней) является пространством имён, содержащим встроенные имена

source: If a name is declared global, then all references and assignments go directly to the next-to-last scope containing the module's global names. To rebind variables found outside of the innermost scope, the :keyword:`nonlocal` statement can be used; if not declared nonlocal, those variables are read-only (an attempt to write to such a variable will simply create a *new* local variable in the innermost scope, leaving the identically named outer variable unchanged).
fa: اگر یک نام به صورت global اعلام شود، تمام ارجاعات و تخصیص ها مستقیماً به آخرین حوزه ماقبل، که شامل نام های سراسری ماژول است، می روند. برای انتساب مجدد متغیرهایی که خارج از داخلی ترین حوزه یافت می شوند، می توان از عبارت :keyword:`nonlocal` استفاده کرد؛ اگر به صورت nonlocal اعلام نشده باشند، آن متغیرها فقط قابل خواندن خواهند بود (تلاش برای نوشتن به چنین متغیری به سادگی یک متغیر محلی *new* را در داخلی ترین حوزه ایجاد می کند و متغیر هم نام بیرونی را بدون تغییر باقی می گذارد).
pt_pt: Se um nome for declarado global, então todas as referências e atribuições vão diretamente para o penúltimo âmbito que contém os nomes globais do módulo. Para reatribuir variáveis encontradas fora do âmbito mais interno, pode ser usada a instrução :keyword:`nonlocal`; se não forem declaradas como nonlocal, essas variáveis são apenas de leitura (uma tentativa de escrita numa dessas variáveis criará simplesmente uma *nova* variável local no âmbito mais interno, deixando a variável externa com o mesmo nome inalterada).
ru: Если имя объявлено глобальным, то все обращения и присваивания к нему передаются непосредственно в предпоследнюю область видимости, содержащую глобальные имена модуля. Для переназначения переменных из внешних областей видимости, можно использовать инструкцию :keyword:`nonlocal`. Без такого объявления, эти переменные доступны только для чтения (попытка записи в такую ​​переменную просто создаст *новую* локальную переменную во внутренней области видимости, оставив внешнюю переменную с таким же именем неизменной).

source: Usually, the local scope references the local names of the (textually) current function. Outside functions, the local scope references the same namespace as the global scope: the module's namespace. Class definitions place yet another namespace in the local scope.
fa: معمولاً، حوزه محلی به نام های محلی تابع (متنی) جاری اشاره می کند. خارج از توابع، حوزه محلی به همان فضای نامی که حوزه سراسری را تشکیل می دهد اشاره می کند: فضای نام ماژول. تعریف های کلاس، فضای نام دیگری را در حوزه محلی قرار می دهند.
hu: Rendszerint a helyi hatókör a szövegkörnyezetben található helyi változókra hivatkozik az aktuális függvényben. A függvényeken kívül a helyi hatókör megegyezik a globális hatókörrel: a modul névtere. Az osztálydefiníciók pedig még egy újabb névtereket helyeznek el a helyi hatókörben.
pt_pt: Normalmente, o âmbito local refere-se aos nomes locais da função (textualmente) atual. Fora das funções, o âmbito local refere-se ao mesmo espaço de nomes que o âmbito global: o espaço de nomes do módulo. As definições de classe colocam ainda outro espaço de nomes no âmbito local.
ru: Как правило, локальная область видимости ссылается на локальные имена (буквально) текущей функции. За пределами функции локальная область видимости ссылается на то же пространство имён, что и глобальная область видимости: пространство имён модуля. Определение класса помещает ещё одно пространство имён в локальную область видимости.

source: It is important to realize that scopes are determined textually: the global scope of a function defined in a module is that module's namespace, no matter from where or by what alias the function is called. On the other hand, the actual search for names is done dynamically, at run time --- however, the language definition is evolving towards static name resolution, at "compile" time, so don't rely on dynamic name resolution! (In fact, local variables are already determined statically.)
fa: مهم است که متوجه شویم حوزه ها به صورت متنی تعیین می شوند: حوزه ی سراسری یک تابع که در یک ماژول تعریف شده است، فضای نام آن ماژول است، بدون توجه به اینکه از کجا یا با چه نام مستعاری آن تابع فراخوانی می شود. از طرف دیگر، جستجوی واقعی برای نام ها به صورت پویا و در زمان اجرا انجام می شود --- با این حال، تعریف زبان در حال حرکت به سمت حل نام ها به صورت ایستا، در زمان "کامپایل" است، بنابراین به حل نام به صورت پویا اتکا نکنید! (در واقع، متغیرهای محلی از قبل به صورت ایستا تعیین می شوند.)
hu: Fontos tudatosítani, hogy a hatókörök szövegkörnyezet által meghatározottak: a modulban definiált függvény globális hatóköre a modul névtere, nem számít, hogy hol és milyen fedőnévvel hívjuk meg a függvényt. Másrészről az aktuális nevek keresése dinamikusan, futásidőben történik, -- a nyelvi definíció akármennyire is törekszik a fordításkori, statikus névfeloldásra, szóval hosszútávon ne számíts a dinamikus névfeloldásra! (Igazság szerint a helyi változók mindig statikusan meghatározottak.)
pt_pt: É importante perceber que os âmbitos são determinados textualmente: o âmbito global de uma função definida num módulo é o espaço de nomes desse módulo, independentemente de onde ou por que alias a função é chamada. Por outro lado, a pesquisa real de nomes é feita dinamicamente, em tempo de execução — no entanto, a definição da linguagem está a evoluir para a resolução estática de nomes, em tempo de "compilação", pelo que não deve confiar na resolução dinâmica de nomes! (De facto, as variáveis locais já são determinadas estaticamente.)
ru: Важно понимать, что области видимости определяются буквально: глобальная область видимости функции определяется модулем, в котором эта функция определена, независимо от того, откуда или под каким именем она вызывается. С другой стороны, фактический поиск имён выполняется динамически, во время выполнения кода. Однако язык постепенно движется в сторону статического разрешения имён на «этапе компиляции», поэтому не стоит полагаться на динамическое разрешение! (На самом деле локальные переменные уже определяются статически.)

source: A special quirk of Python is that -- if no :keyword:`global` or :keyword:`nonlocal` statement is in effect -- assignments to names always go into the innermost scope. Assignments do not copy data --- they just bind names to objects. The same is true for deletions: the statement ``del x`` removes the binding of ``x`` from the namespace referenced by the local scope. In fact, all operations that introduce new names use the local scope: in particular, :keyword:`import` statements and function definitions bind the module or function name in the local scope.
fa: یکی از ویژگی های خاص پایتون این است که اگر هیچ بیانیه :keyword:`global` یا :keyword:`nonlocal` در حال اجرا نباشد، اختصاص نام ها همیشه در حیطه داخلی ترین صورت می گیرد. اختصاص نام ها داده ها را کپی نمی کند، بلکه فقط نام ها را به اشیاء متصل می کند. این موضوع در مورد حذف نیز صدق می کند: بیانیه ``del x`` اتصال ``x`` را از فضای نام ارجاع شده توسط حیطه محلی حذف می کند. در واقع، تمام عملیات هایی که نام های جدیدی معرفی می کنند از حیطه محلی استفاده می کنند: به خصوص، بیانیه های :keyword:`import` و تعریف تابع نام ماژول یا تابع را در حیطه محلی متصل می کنند.
pt_pt: Uma particularidade especial do Python é que — se nenhuma instrução :keyword:`global` ou :keyword:`nonlocal` estiver em vigor — as atribuições a nomes vão sempre para o âmbito mais interno. As atribuições não copiam dados — apenas associam nomes a objetos. O mesmo é verdade para as eliminações: a instrução ``del x`` remove a associação de ``x`` do espaço de nomes referenciado pelo âmbito local. De facto, todas as operações que introduzem novos nomes usam o âmbito local: em particular, as instruções :keyword:`import` e as definições de funções associam o nome do módulo ou da função no âmbito local.
ru: Особой причудой Python является то, что если не задействованы инструкции :keyword:`global` или :keyword:`nonlocal`, то присваивание имён направлены в самую глубокую область видимости. Присваивание не копирует данные — оно лишь связывает имена с объектами. То же верно и для удаления: инструкция ``del x`` удаляет привязку ``x`` из пространства имён локальной области видимости. Фактически, все операции, которые вводят новые имена, используют локальную область видимости: в частности, инструкция :keyword:`import` и определение функций связывают имя модуля или функции в локальной области видимости.

source: The :keyword:`global` statement can be used to indicate that particular variables live in the global scope and should be rebound there; the :keyword:`nonlocal` statement indicates that particular variables live in an enclosing scope and should be rebound there.
fa: بیانیه :keyword:`global` می تواند برای نشان دادن اینکه متغیرهای خاصی در حوزه جهانی هستند و باید در آنجا بازبسته شوند، استفاده شود؛ بیانیه :keyword:`nonlocal` نشان می دهد که متغیرهای خاصی در یک حوزه محاط کننده قرار دارند و باید در آنجا بازبسته شوند.
hu: A :keyword:`global` kulcsszóval jelezheted hogy bizonyos változók a globális névtérben léteznek és ott újra kell csatolni, a :keyword:`nonlocal` kulcsszó azt jelzi, hogy a szóban forgó változó a helyi hatókörhöz tartozik, és ott kell újracsatolni.
pt_pt: A instrução :keyword:`global` pode ser usada para indicar que certas variáveis vivem no âmbito global e devem ser reatribuídas lá; a instrução :keyword:`nonlocal` indica que certas variáveis vivem num âmbito envolvente e devem ser reatribuídas lá.
ru: Инструкция :keyword:`global` указывает, что конкретные переменные находятся в глобальной области видимости и должны переназначаться там. Аналогично, инструкция :keyword:`nonlocal` объявляет, что конкретные переменные находятся во внешней области видимости и должны переназначаться в ней.

source: Scopes and Namespaces Example
fa: مثال محدوده ها و فضاهای نام
hu: Hatókör és névtér példa
pt_pt: Exemplo de âmbitos e espaços de nomes
ru: Пример областей видимости и пространств имён

source: This is an example demonstrating how to reference the different scopes and namespaces, and how :keyword:`global` and :keyword:`nonlocal` affect variable binding::
fa: این یک مثال است که نشان می دهد چگونه به حوزه ها و نام فضاهای مختلف ارجاع دهید، و چگونه :keyword:`global` و :keyword:`nonlocal` بر بایندینگ متغیر تأثیر می گذارند::
hu: Itt van egy példa, amely bemutatja, hogyan lehet hivatkozni a különböző hatókörökre és névterekre, és hogyan hat a :keyword:`global` és :keyword:`nonlocal` a változócsatolásokra::
pt_pt: Este é um exemplo que demonstra como referenciar os diferentes âmbitos e espaços de nomes, e como :keyword:`global` e :keyword:`nonlocal` afetam a ligação de variáveis:
ru: Вот демонстрация того, как обращаться к разным областям видимости и пространствам имён, и как :keyword:`global` и :keyword:`nonlocal` влияют на привязку переменных::
