Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, hu, pt_pt, ru

source: def scope_test(): def do_local(): spam = "local spam" def do_nonlocal(): nonlocal spam spam = "nonlocal spam" def do_global(): global spam spam = "global spam" spam = "test spam" do_local() print("After local assignment:", spam) do_nonlocal() print("After nonlocal assignment:", spam) do_global() print("After global assignment:", spam) scope_test() print("In global scope:", spam)
pt_pt: def teste_ambito(): def fazer_local(): spam = "spam local" def fazer_nonlocal(): nonlocal spam spam = "spam nonlocal" def fazer_global(): global spam spam = "spam global" spam = "spam de teste" fazer_local() print("Após atribuição local:", spam) fazer_nonlocal() print("Após atribuição nonlocal:", spam) fazer_global() print("Após atribuição global:", spam) teste_ambito() print("No âmbito global:", spam)
ru: def scope_test(): def do_local(): spam = "локальный спам" def do_nonlocal(): nonlocal spam spam = "нелокальный спам" def do_global(): global spam spam = "глобальный спам" spam = "тестовый спам" do_local() print("После локального присваивания:", spam) do_nonlocal() print("После нелокального присваивания:", spam) do_global() print("После глобального присваивания:", spam) scope_test() print("В глобальной области видимости:", spam)

source: The output of the example code is:
fa: خروجی کد مثال به صورت زیر است:
hu: A példakód kimenete::
pt_pt: A saída do código de exemplo é:
ru: При выполнении кода будет выведено следующее:

source: After local assignment: test spam After nonlocal assignment: nonlocal spam After global assignment: nonlocal spam In global scope: global spam
fa: بعد از تخصیص محلی: test spam بعد از تخصیص nonlocal: nonlocal spam بعد از تخصیص global: nonlocal spam در فضای سراسری: global spam
pt_pt: Após atribuição local: spam de teste Após atribuição nonlocal: spam nonlocal Após atribuição global: spam nonlocal No âmbito global: spam global
ru: После локального присваивания: тестовый спам После нелокального присваивания: нелокальный спам После глобального присваивания: нелокальный спам В глобальной области видимости: глобальный спам

source: Note how the *local* assignment (which is default) didn't change *scope_test*\'s binding of *spam*. The :keyword:`nonlocal` assignment changed *scope_test*\'s binding of *spam*, and the :keyword:`global` assignment changed the module-level binding.
fa: توجه کنید که انتساب *local* (که به صورت پیش فرض است) تغییر در ارتباط *scope_test* با *spam* ایجاد نکرد. انتساب :keyword:`nonlocal` ارتباط *scope_test* با *spam* را تغییر داد و انتساب :keyword:`global` ارتباط در سطح ماژول را تغییر داد.
hu: Jegyezd meg, hogy a *helyi* értékadás (amely az alapértelmezett) nem változtatja meg a *scope_test* függvény *spam* csatolását. A :keyword:`nonlocal` értékadás a *scope_test* *spam* nevének csatolását változtatja meg, a :keyword:`global` értékadás pedig a modulszintű csatolást.
pt_pt: Note como a atribuição *local* (que é a predefinida) não alterou a ligação de *spam* em *teste_ambito*. A atribuição :keyword:`nonlocal` alterou a ligação de *spam* em *teste_ambito*, e a atribuição :keyword:`global` alterou a ligação ao nível do módulo.
ru: Заметьте, как *локальное* присваивание (используемое по умолчанию) не изменяет значение переменной *spam* в *scope_test*. С другой стороны, присваивание с использованием ключевого слова :keyword:`nonlocal` изменило значение *spam* в *scope test*, и присваивание с использованием :keyword:`global` изменяет переменные на уровне модуля.

source: You can also see that there was no previous binding for *spam* before the :keyword:`global` assignment.
fa: همچنین می توانید ببینید که هیچ اتصال قبلی برای *spam* قبل از انتساب :keyword:`global` وجود نداشت.
hu: Azt is érdemes észrevenni, hogy nem csatoltunk értéket a *spam*-hez a :keyword:`global` értékadás előtt.
pt_pt: Também pode ver que não havia nenhuma ligação anterior para *spam* antes da atribuição :keyword:`global`.
ru: Также можно увидеть, что до присваивания *spam* с использованием :keyword:`global` не существовало привязки этого имени в области видимости модуля.

source: A First Look at Classes
fa: در نگاه اول به کلاس ها
hu: Első találkozás az osztályokkal
pt_pt: Uma primeira olhadela às classes
ru: Первый взгляд на классы

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
fa: کلاس ها اندکی سینتکس جدید، سه نوع شئ جدید و برخی مفاهیم معنایی جدید معرفی می کنند.
hu: Az osztályok használatához szükségünk van új szintaxisra: három új objektumtípusra, és némi új szemantikára.
pt_pt: As classes introduzem um pouco de nova sintaxe, três novos tipos de objetos e alguma nova semântica.
ru: Классы привносят немного нового синтаксиса, три новых типа объектов и новую семантику.

source: Class Definition Syntax
fa: قواعد تعریف کلاس
hu: Az osztálydefiníció szinaxisa
pt_pt: Sintaxe de definição de classe
ru: Синтаксис определения класса

source: The simplest form of class definition looks like this::
fa: ساده ترین شکل تعریف کلاس به این صورت است:
hu: A legegyszerűbb osztálydefiníció így néz ki::
pt_pt: A forma mais simples de definição de classe parece com isto:
ru: Самая простая форма определения класса выглядит так::

source: class ClassName: <statement-1> . . . <statement-N>
fa: class ClassName: 1 . . . 2 . . . <statement-N>
pt_pt: class NomeDaClasse: <instrução-1> . . . <instrução-N>

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
fa: تعاریف کلاس، مانند تعاریف تابع (:keyword:`def` statements)، باید قبل از اینکه تأثیری داشته باشند اجرا شوند. (می توانید تعریف یک کلاس را به طور قابل تصوری در یکی از شاخه های یک :keyword:`if` statement یا داخل یک تابع قرار دهید.)
hu: Az osztálydefiníciók hasonlítanak a függvények definíciójára (:keyword:`def` statements) abból a szempontból, hogy az osztály deklarációjának meg kell előznie az első használatot. (Osztálydefiníciót elhelyzehetsz egy :keyword:`if` utasítás valamely ágában is, vagy egy függvénybe beágyazva.)
pt_pt: As definições de classe, tal como as definições de funções (instruções :keyword:`def`), devem ser executadas antes de terem qualquer efeito. (Poderia concebivelmente colocar uma definição de classe num ramo de uma instrução :keyword:`if`, ou dentro de uma função.)
ru: Определение класса, как и определение функции (инструкция :keyword:`def`), должно быть выполнено перед тем, как оно будет иметь эффект. (Можно поместить определение класса в ветку инструкции :keyword:`if` или внутри функции.)

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
fa: در عمل، دستورات داخل تعریف یک کلاس معمولاً شامل تعریف توابع خواهد بود، اما استفاده از دستورات دیگر مجاز است و گاهی اوقات مفید است — بعدها به این موضوع باز خواهیم گشت. تعریف توابع داخل یک کلاس معمولاً شکل خاصی از لیست آرگومان ها دارد که توسط قراردادهای فراخوانی برای متدها تعیین می شود — باز هم، این موضوع بعداً توضیح داده خواهد شد.
hu: A gyakorlatban az osztályokon belüli utasítások többsége általában függvénydefiníció, de bármilyen más utasítás is megengedett, és néha hasznos is -- erre még később visszatérünk. Az osztályon belüli függvényeknek normál esetben egyedi argumentumlistájuk (és hívási módjuk) van az osztály metódusainak hívására vontakozó megállapodás szerint -- ezt szintén később fogjuk megvizsgálni.
pt_pt: Na prática, as instruções dentro de uma definição de classe serão normalmente definições de funções, mas outras instruções são permitidas e, por vezes, úteis — voltaremos a isto mais tarde. As definições de funções dentro de uma classe têm normalmente uma forma peculiar de lista de argumentos, ditada pelas convenções de chamada para métodos — novamente, isto é explicado mais tarde.
ru: На практике, чаще всего, инструкции внутри определения класса — это определения функций, но другие инструкции там тоже возможны и бывают полезны — мы вернёмся к этому позже. Определения функций внутри класса имеют своеобразную форму списка аргументов, продиктованную соглашениями о вызовах методов — опять же, это будет объяснено позже.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
fa: هنگامی که یک تعریف کلاس وارد می شود، یک فضای نام جدید ایجاد می شود و به عنوان محدوده محلی استفاده می شود --- بنابراین، تمامی انتساب ها به متغیر های محلی وارد این فضای نام جدید می شوند. به طور خاص، تعاریف تابع، نام تابع جدید را در اینجا متصل می کنند.
hu: Egy osztálydefinícióba való belépéskor új névtér jön létre és válik a helyi hatókörré -- ebből kifolyólag minden helyi változóra történő hivatkozás ebbe az új névtérbe kerül. A gyakorlatban általában az új függvények csatolásai kerülnek ide.
pt_pt: Quando uma definição de classe é introduzida, é criado um novo espaço de nomes e usado como âmbito local — assim, todas as atribuições a variáveis locais vão para este novo espaço de nomes. Em particular, as definições de funções associam o nome da nova função aqui.
ru: При входе в определение класса создаётся новое пространство имён, и оно используется в качестве локальной области видимости. Поэтому все операции присваивания к локальным переменнам будут направлены в это новое пространство имён. В частности, определения функций привяжут функции к их именам именно в этом пространстве имён.

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`!ClassName` in the example).
fa: هنگامی که تعریف یک کلاس به صورت طبیعی (از طریق پایان) به پایان می رسد، یک *class object* ایجاد می شود. این در واقع یک پوشش است بر محتوای فضای نامی که توسط تعریف کلاس ایجاد شده است؛ در بخش بعدی بیشتر درباره اشیاء کلاس یاد خواهیم گرفت. حوزه محلی اولیه (همان که قبل از ورود به تعریف کلاس وجود داشت) دوباره فعال می شود و شیء کلاس به نامی که در سربرگ تعریف کلاس داده شده است (:class:`!ClassName` در مثال) متصل می شود.
pt_pt: Quando uma definição de classe é deixada normalmente (através do fim), é criado um *objeto de classe*. Isto é basicamente um invólucro em torno do conteúdo do espaço de nomes criado pela definição de classe; aprenderemos mais sobre objetos de classe na próxima secção. O âmbito local original (aquele que estava em vigor imediatamente antes da definição de classe ser introduzida) é restabelecido, e o objeto de classe é aqui associado ao nome da classe dado no cabeçalho da definição de classe (:class:`!NomeDaClasse` no exemplo).
ru: Когда определение класса заканчивается (обычным завершением блока), создается *объект класса*. По сути, это обёртка вокруг содержимого пространства имён, созданного определением класса. Мы узнаем больше об объектах классов в следующем разделе. Исходная локальная область видимости (которая действовала непосредственно перед входом в определение класса) восстанавливается, и объект класса привязывается здесь к имени, указанному в заголовке определения класса (:class:`!ClassName` в примере).

source: Class Objects
fa: اشیاء کلاس
hu: Osztályobjektumok
pt_pt: Objetos de classe
ru: Объекты классов

source: Class objects support two kinds of operations: attribute references and instantiation.
fa: شیءهای کلاس از دو نوع عملیات پشتیبانی می کنند: ارجاع به ویژگی ها و نمونه سازی.
hu: Az osztályobjektumok a műveletek kétféle típusát támogatják: a jellemzőhivatkozást és a példányosítás.
pt_pt: Os objetos de classe suportam dois tipos de operações: referências de atributos e instanciação.
ru: Объекты классов поддерживают два вида операций: обращение к атрибутам и создание экземпляров.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
fa: برای استفاده از *Attribute references* از نحو استانداردی استفاده کنید که برای تمامی مرجع های ویژگی در پایتون به کار می رود: ``obj.name``. نام های ویژگی معتبر شامل تمامی نام هایی هستند که در فضای نام کلاس در هنگام ایجاد شیء کلاس بودند. بنابراین، اگر تعریف کلاس به این صورت باشد:
hu: A *jellemzőhivatkozások* az általánosan használt Python jelölésmódot használják: ``objektum.jellemzőnév``. Az összes név érvényes jellemzőnév ami az osztály névterében volt az osztályobjektum létrehozásakor. Ha egy osztály definíció valahogy így néz ki::
pt_pt: As *referências de atributos* usam a sintaxe padrão usada para todas as referências de atributos em Python: ``obj.name``. Os nomes de atributos válidos são todos os nomes que estavam no espaço de nomes da classe quando o objeto de classe foi criado. Assim, se a definição de classe fosse assim:
ru: *Обращение к атрибуту* использует стандартный в Python синтаксис для получения доступа к любым атрибутам: ``obj.name``. Допустимыми именами атрибутов считаются те имена, которые находились в пространстве имён класса во время его создания. Таким образом, если определение класса выглядит так::

source: class MyClass: """A simple example class""" i = 12345 def f(self): return 'hello world'
pt_pt: class MinhaClasse: """Uma classe de exemplo simples""" i = 12345 def f(self): return 'olá mundo'

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`~type.__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
fa: سپس ``MyClass.i`` و ``MyClass.f`` به عنوان ارجاعات معتبر به ویژگی قابل استفاده هستند که به ترتیب یک عدد صحیح و یک شیء تابع را ارائه می دهند. ویژگی های کلاس نیز می توانند مقداردهی شوند، بنابراین می توانید مقدار ``MyClass.i`` را با تخصیص تغییر دهید. :attr:`~type.__doc__` نیز یک ویژگی معتبر است که داک استرینگ مربوط به کلاس را برمی گرداند: ``"A simple example class"``.
pt_pt: então ``MinhaClasse.i`` e ``MinhaClasse.f`` são referências de atributos válidas, devolvendo um inteiro e um objeto de função, respetivamente. Os atributos de classe também podem ser atribuídos, por isso pode alterar o valor de ``MinhaClasse.i`` por atribuição. :attr:`~type.__doc__` também é um atributo válido, devolvendo a string de documentação pertencente à classe: ``"Uma classe de exemplo simples"``.
ru: то ``MyClass.i`` и ``MyClass.f`` являются корректными обращениями к атрибутам, возвращающими соответственно целое число и объект функции. Атрибутам класса также можно присваивать, поэтому вы можете изменить значение ``MyClass.i``. Также существует атрибут :attr:`~type.__doc__`, возвращающий строку документации, принадлежащую классу: ``"A simple example class"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
fa: کلاس *instantiation* از نماد تابعی استفاده می کند. فقط فرض کنید که شیء کلاس یک تابع بدون پارامتر است که نمونه جدیدی از کلاس را برمی گرداند. برای مثال (با فرض وجود کلاس فوق):
hu: Egy osztály *példányosítása* a függvények jelölésmódját használja. Egyszerűen úgy kell tenni, mintha az osztályobjektum egy argumentum nélküli függvény lenne, amit meghívva az osztály egy új példányát kapjuk visszatérési értékként. Például (a fenti osztályt alapul véve)::
pt_pt: A *instanciação* de classe usa notação de função. Basta fingir que o objeto de classe é uma função sem parâmetros que devolve uma nova instância da classe. Por exemplo (assumindo a classe acima):
ru: *Создание экземпляра* класса использует синтаксис вызова функции. Достаточно представить, что объект класса — это функция без параметров, которая возвращает новый экземпляр этого класса. Например (используя определённый выше класс)::

source: x = MyClass()
pt_pt: x = MinhaClasse()

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
fa: شیء جدیدی از کلاس *instance* ایجاد کرده و این شیء را به متغیر محلی ``x`` اختصاص می دهد.
hu: létrehoz egy új *példányt* az osztályból, és hozzárendeli a visszatérési értékként kapott objektumot az ``x`` helyi változóhoz.
pt_pt: cria uma nova *instância* da classe e atribui este objeto à variável local ``x``.
ru: создаёт новый *экземпляр* класса и сохраняет этот объект в локальную переменную ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`~object.__init__`, like this::
fa: عملیات نمونه سازی (برای مثال "صدا زدن" یک شیء کلاس) یک شیء خالی ایجاد می کند. بسیاری از کلاس ها تمایل دارند اشیائی با نمونه های شخصی سازی شده به یک حالت اولیه خاص ایجاد کنند. به همین دلیل یک کلاس ممکن است یک متد ویژه به نام :meth:`~object.__init__` تعریف کند، مانند این:
pt_pt: A operação de instanciação ("chamar" um objeto de classe) cria um objeto vazio. Muitas classes gostam de criar objetos com instâncias personalizadas para um estado inicial específico. Portanto, uma classe pode definir um método especial chamado :meth:`~object.__init__`, assim:
ru: Операция создания экземпляра («вызов» объекта класса) создаёт пустой объект. Многим классам нравится создавать объекты, инициализированные определённым начальным состоянием. Поэтому класс может определить специальный метод с именем :meth:`~object.__init__`, например:

source: def __init__(self): self.data = []
pt_pt: def __init__(self): self.dados = []

source: When a class defines an :meth:`~object.__init__` method, class instantiation automatically invokes :meth:`!__init__` for the newly created class instance. So in this example, a new, initialized instance can be obtained by::
fa: وقتی یک کلاس متدی با نام :meth:`~object.__init__` را تعریف می کند، ایجاد یک نمونه از کلاس به صورت خودکار :meth:`!__init__` را برای نمونه تازه ساخته شده فراخوانی می کند. بنابراین، در این مثال، یک نمونه جدید و مقداردهی اولیه شده را می توان به این صورت به دست آورد:
pt_pt: Quando uma classe define um método :meth:`~object.__init__`, a instanciação da classe invoca automaticamente :meth:`!__init__` para a instância recém-criada. Assim, neste exemplo, uma nova instância inicializada pode ser obtida por:
ru: Когда класс определяет метод :meth:`~object.__init__`, создание экземпляра класса автоматически вызывает :meth:`!__init__` для вновь созданного экземпляра класса. Итак, в этом примере новый инициализированный экземпляр можно получить следующим образом:

source: Of course, the :meth:`~object.__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`!__init__`. For example, ::
fa: البته، متد :meth:`~object.__init__` می تواند برای انعطاف پذیری بیشتر دارای آرگومان باشد. در این صورت، آرگومان هایی که به عملگر ایجاد کلاس داده می شوند به :meth:`!__init__` منتقل می شوند. برای مثال: :
pt_pt: Claro, o método :meth:`~object.__init__` pode ter argumentos para maior flexibilidade. Nesse caso, os argumentos dados ao operador de instanciação de classe são passados para :meth:`!__init__`. Por exemplo:
ru: Конечно, метод :meth:`~object.__init__` может иметь аргументы для большей гибкости. В этом случае аргументы, переданные оператору создания экземпляра класса, передаются в :meth:`!__init__`. Например, ::

source: >>> class Complex: ... def __init__(self, realpart, imagpart): ... self.r = realpart ... self.i = imagpart ... >>> x = Complex(3.0, -4.5) >>> x.r, x.i (3.0, -4.5)
pt_pt: >>> class Complexo: ... def __init__(self, parte_real, parte_imaginaria): ... self.r = parte_real ... self.i = parte_imaginaria ... >>> x = Complexo(3.0, -4.5) >>> x.r, x.i (3.0, -4.5)

source: Instance Objects
fa: شیء های نمونه
hu: A létrehozott egyedek
pt_pt: Objetos de instância
ru: Объекты экземпляров

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
fa: اکنون با اشیاء نمونه چه کاری می توانیم انجام دهیم؟ تنها عملیاتی که توسط اشیاء نمونه قابل درک است، ارجاع به ویژگی ها است. دو نوع نام ویژگی معتبر وجود دارد: ویژگی های داده و متدها.
pt_pt: O que podemos fazer com objetos de instância? As únicas operações compreendidas pelos objetos de instância são referências de atributos. Existem dois tipos de nomes de atributos válidos: atributos de dados e métodos.
ru: Что мы можем делать с объектами-экземплярами? Единственная операция, которую понимают экземпляры — обращение к атрибутам. Есть два вида допустимых имён атрибутов: данные и методы.

source: x.counter = 1 while x.counter < 10: x.counter = x.counter * 2 print(x.counter) del x.counter
pt_pt: x.contador = 1 while x.contador < 10: x.contador = x.contador * 2 print(x.contador) del x.contador

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object.
fa: نوع دیگر ارجاع به ویژگی نمونه، *method* است. یک متد، تابعی است که "متعلق به" یک آبجکت است.
pt_pt: O outro tipo de referência de atributo de instância é um *método*. Um método é uma função que "pertence" a um objeto.
ru: Другой вид атрибута экземпляра — *метод*. Метод — это функция, которая «принадлежит» объекту.
