Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, hu, pt_pt, ru

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
fa: این سبک دسترسی واضح، مختصر و راحت است. استفاده از پیمانه ها در سراسر Python گسترده و یگانه است. در پشت صحنه، عبارت :keyword:`for` تابع :func:`iter` را بر روی شیء ظرف فراخوانی می کند. این تابع شیء پیمانه ای را برمی گرداند که متد :meth:`~iterator.__next__` را تعریف می کند که عناصر را در ظرف یکی یکی دسترسی می دهد. زمانی که دیگر هیچ عنصری باقی نیست، :meth:`~iterator.__next__` یک استثنای :exc:`StopIteration` را برمی انگیزد که به حلقه ی :keyword:`!for` می گوید که متوقف شود. شما می توانید متد :meth:`~iterator.__next__` را با استفاده از تابع داخلی :func:`next` فراخوانی کنید؛ این مثال نشان می دهد که همه این کارها چگونه انجام می شود:
pt_pt: Este estilo de acesso é claro, conciso e conveniente. O uso de iteradores permeia e unifica o Python. Por trás dos panos, a instrução :keyword:`for` chama :func:`iter` no objeto contentor. A função devolve um objeto iterador que define o método :meth:`~iterator.__next__`, que acede aos elementos no contentor um de cada vez. Quando não há mais elementos, :meth:`~iterator.__next__` levanta uma exceção :exc:`StopIteration`, que diz ao ciclo :keyword:`!for` para terminar. Pode chamar o método :meth:`~iterator.__next__` usando a função incorporada :func:`next`; este exemplo mostra como tudo funciona:
ru: Этот стиль доступа ясен, краток и удобен. Использование итераторов пронизывает и унифицирует Python. За кулисами инструкция :keyword:`for` вызывает :func:`iter` для объекта-контейнера. Функция возвращает объект итератора, который определяет метод :meth:`~iterator.__next__`, получающий элементы контейнера по одному за раз. Когда элементов больше нет, :meth:`~iterator.__next__` вызывает исключение :exc:`StopIteration`, которое сообщает циклу :keyword:`!for` завершить выполнение. Вы можете вызвать метод :meth:`~iterator.__next__`, используя встроенную функцию :func:`next`. Этот пример показывает, как всё это работает::

source: >>> s = 'abc' >>> it = iter(s) >>> it <str_iterator object at 0x10c90e650> >>> next(it) 'a' >>> next(it) 'b' >>> next(it) 'c' >>> next(it) Traceback (most recent call last): File "<stdin>", line 1, in <module> next(it) StopIteration
pt_pt: >>> s = 'abc' >>> it = iter(s) >>> it <objeto str_iterator em 0x10c90e650> >>> next(it) 'a' >>> next(it) 'b' >>> next(it) 'c' >>> next(it) Traceback (most recent call last): File "<stdin>", line 1, in <module> next(it) StopIteration
ru: >>> s = 'абв' >>> it = iter(s) >>> it <str_iterator object at 0x10c90e650> >>> next(it) 'а' >>> next(it) 'б' >>> next(it) 'в' >>> next(it) Traceback (most recent call last): File "<stdin>", line 1, in <module> next(it) StopIteration

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`~container.__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`!__next__`, then :meth:`!__iter__` can just return ``self``::
fa: با مشاهده مکانیزم های پشت پروتکل تکرارگر، افزودن رفتار تکرارگر به کلاس هایتان آسان است. یک متد :meth:`~container.__iter__` تعریف کنید که یک شیء با متد :meth:`~iterator.__next__` را بازگشت دهد. اگر کلاس :meth:`!__next__` را تعریف کند، آنگاه :meth:`!__iter__` می تواند فقط ``self`` را بازگرداند::
pt_pt: Tendo visto a mecânica por trás do protocolo de iterador, é fácil adicionar comportamento de iterador às suas classes. Defina um método :meth:`~container.__iter__` que devolve um objeto com um método :meth:`~iterator.__next__`. Se a classe definir :meth:`!__next__`, então :meth:`!__iter__` pode simplesmente devolver ``self``:
ru: Познакомившись с механизмом протокола итерации, легко добавить поведение итератора в свои классы. Определите метод :meth:`~container.__iter__`, который возвращает объект с методом :meth:`~iterator.__next__`. Если класс определяет :meth:`!__next__`, то :meth:`!__iter__` может просто вернуть ``self``::

source: class Reverse: """Iterator for looping over a sequence backwards.""" def __init__(self, data): self.data = data self.index = len(data) def __iter__(self): return self def __next__(self): if self.index == 0: raise StopIteration self.index = self.index - 1 return self.data[self.index]
pt_pt: class Inverso: """Iterador para percorrer uma sequência ao contrário.""" def __init__(self, dados): self.dados = dados self.indice = len(dados) def __iter__(self): return self def __next__(self): if self.indice == 0: raise StopIteration self.indice = self.indice - 1 return self.dados[self.indice]
ru: class Reverse: """Итератор для прохода по последовательности в обратном порядке.""" def __init__(self, data): self.data = data self.index = len(data) def __iter__(self): return self def __next__(self): if self.index == 0: raise StopIteration self.index = self.index - 1 return self.data[self.index]

source: >>> rev = Reverse('spam') >>> iter(rev) <__main__.Reverse object at 0x00A1DB50> >>> for char in rev: ... print(char) ... m a p s
pt_pt: >>> rev = Inverso('spam') >>> iter(rev) <objeto __main__.Inverso em 0x00A1DB50> >>> for char in rev: ... print(char) ... m a p s
ru: >>> rev = Reverse('спам') >>> iter(rev) <__main__.Reverse object at 0x00A1DB50> >>> for char in rev: ... print(char) ... м а п с

source: Generators
fa: تولیدکننده ها
hu: Generátorok
pt_pt: Geradores
ru: Генераторы

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
fa: :term:`Generators <generator>` یک ابزار ساده و قدرتمند برای ایجاد اینتراتورها هستند. آنها مانند توابع عادی نوشته می شوند اما هر زمان که می خواهند داده ای را بازگردانند از دستور :keyword:`yield` استفاده می کنند. هر بار که :func:`next` بر روی آن فراخوانی می شود، مولد از جایی که متوقف شده ادامه می یابد (تمام مقادیر داده ها و اینکه آخرین دستور اجرا شده چه بوده را به خاطر می آورد). یک مثال نشان می دهد که ایجاد مولدها می تواند به طرز باورنکردنی ساده باشد::
pt_pt: Os :term:`geradores <generator>` são uma ferramenta simples e poderosa para criar iteradores. São escritos como funções normais, mas usam a instrução :keyword:`yield` sempre que querem devolver dados. Cada vez que :func:`next` é chamado, o gerador retoma onde parou (lembra-se de todos os valores de dados e qual a instrução executada por último). Um exemplo mostra que os geradores podem ser trivialmente fáceis de criar:
ru: :term:`Генераторы <generator>` — это простой и мощный инструмент для создания итераторов. Они пишутся как обычные функции, но используют инструкцию :keyword:`yield` всякий раз, когда хотят вернуть данные. Каждый раз, когда на нём вызывается :func:`next`, генератор возобновляет работу с того места, где остановился (он запоминает все значения данных и последнюю выполненную инструкцию). Пример показывает, что генераторы можно создать очень легко:

source: def reverse(data): for index in range(len(data)-1, -1, -1): yield data[index]
pt_pt: def inverso(dados): for indice in range(len(dados)-1, -1, -1): yield dados[indice]

source: >>> for char in reverse('golf'): ... print(char) ... f l o g
pt_pt: >>> for char in inverso('golfe'): ... print(char) ... e f l o g
ru: >>> for char in reverse('гольф'): ... print(char) ... ф ь л о г

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`~iterator.__iter__` and :meth:`~generator.__next__` methods are created automatically.
fa: هر چیزی که با تولیدکننده ها (generators) قابل انجام است، می تواند با استفاده از تکرارگرهای مبتنی بر کلاس نیز انجام شود، همانطور که در بخش قبلی توضیح داده شد. آنچه تولیدکننده ها را فشرده می کند، این است که روش های :meth:`~iterator.__iter__` و :meth:`~generator.__next__` به طور خودکار ایجاد می شوند.
pt_pt: Tudo o que pode ser feito com geradores também pode ser feito com iteradores baseados em classes, como descrito na secção anterior. O que torna os geradores tão compactos é que os métodos :meth:`~iterator.__iter__` e :meth:`~generator.__next__` são criados automaticamente.
ru: Всё, что можно сделать с помощью генераторов, можно сделать и с помощью итераторов на основе классов, как описано в предыдущем разделе. Что делает генераторы такими компактными, так это то, что методы :meth:`~iterator.__iter__` и :meth:`~generator.__next__` создаются автоматически.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
fa: یکی دیگر از ویژگی های کلیدی این است که متغیرهای محلی و وضعیت اجرا به طور خودکار بین فراخوانی ها ذخیره می شوند. این امر نوشتن تابع را آسان تر و خیلی واضح تر از رویکردی که از متغیرهای نمونه ای مانند ``self.index`` و ``self.data`` استفاده می کند، کرده است.
hu: Egy másik fontos lehetőség hogy a helyi változók, és a végrehajtás állapota automatikusan tárolódik a generátor két futása között.
pt_pt: Outra característica-chave é que as variáveis locais e o estado de execução são automaticamente guardados entre chamadas. Isto tornou a função mais fácil de escrever e muito mais clara do que uma abordagem que usa variáveis de instância como ``self.indice`` e ``self.dados``.
ru: Ещё одной ключевой особенностью является то, что локальные переменные и состояние выполнения автоматически сохраняются между вызовами. Это сделало функцию более простой в написании и более понятной, чем подход с использованием переменных экземпляра, таких как ``self.index`` и ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
fa: علاوه بر ایجاد خودکار متدها و ذخیره سازی وضعیت برنامه، زمانی که جنراتورها خاتمه می یابند، به طور خودکار :exc:`StopIteration` را ایجاد می کنند. این ویژگی ها به صورت ترکیبی، ساختن تکرارگرها را به همان سادگی نوشتن یک تابع عادی امکان پذیر می سازند.
hu: Az automatikus metóduslétrehozáson és programállapot-mentésen felül, amikor a generátor futása megszakad, ez az esemény automatikusan :exc:`StopIteration` kivételt vált ki. Egymással kombinálva ezek a nyelvi szolgáltatások egyszerűvé teszik az iterátorok készítését néhány függvény megírásának megfelelő -- viszonylag kis erőfeszítéssel.
pt_pt: Além da criação automática de métodos e da preservação do estado do programa, quando os geradores terminam, levantam automaticamente :exc:`StopIteration`. Em combinação, estas características tornam fácil criar iteradores sem mais esforço do que escrever uma função regular.
ru: В дополнение к автоматическому созданию методов и сохранению состояния программы, когда генераторы завершают работу, они автоматически выбрасывают :exc:`StopIteration`. В совокупности эти возможности позволяют легко создавать итераторы, не прилагая больше усилий, чем при написании обычной функции.

source: Generator Expressions
fa: Generator Expressions تعبیرات مولد شبیه به لیست comprehensions هستند ولی به جای تولید یک لیست کامل، یک مولد ایجاد می کنند که مقادیر را به تدریج تولید می کند. این می تواند باعث بهینه سازی حافظه شود و برای پردازش داده های بزرگ مفید باشد. تعبیرات مولد به کمک پرانتز دور نتیجه نوشته می شوند، در حالی که لیست comprehensions از براکت ها استفاده می کنند.
hu: Generátorkifejezések
pt_pt: Expressões de geradores
ru: Генераторные выражения

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
fa: برخی از مولدهای ساده را می توان به صورت مختصر به عنوان عباراتی با استفاده از یک نحو مشابه با درک لیست ها اما با پرانتز به جای کروشه کد کرد. این عبارات برای موقعیت هایی طراحی شده اند که در آن مولد بلافاصله توسط یک تابع فراگیر استفاده می شود. عبارات مولد فشرده تر اما کمتر انعطاف پذیر از تعاریف کامل مولد هستند و به طور معمول نسبت به درک لیست های معادل، حافظه بیشتری را صرفه جویی می کنند.
pt_pt: Alguns geradores simples podem ser codificados de forma sucinta como expressões, usando uma sintaxe semelhante às compreensões de listas, mas com parênteses em vez de colchetes. Estas expressões são concebidas para situações em que o gerador é usado imediatamente por uma função envolvente. As expressões de geradores são mais compactas, mas menos versáteis do que as definições completas de geradores, e tendem a ser mais amigas da memória do que as compreensões de listas equivalentes.
ru: Некоторые простые генераторы можно лаконично закодировать как выражения, используя синтаксис, аналогичный списковым включениям, но с круглыми скобками вместо квадратных. Эти выражения предназначены для ситуаций, когда генератор сразу же используется внешней функцией. Выражения-генераторы более компактны, но менее универсальны, чем полноценные определения генераторов, и, как правило, расходуют память более экономно, чем эквивалентные списковые включения.

source: Examples::
fa: مثال ها::
hu: Példák::
pt_pt: Exemplos:
ru: Примеры::

source: >>> sum(i*i for i in range(10)) # sum of squares 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # dot product 260 >>> unique_words = set(word for line in page for word in line.split()) >>> valedictorian = max((student.gpa, student.name) for student in graduates) >>> data = 'golf' >>> list(data[i] for i in range(len(data)-1, -1, -1)) ['f', 'l', 'o', 'g']
pt_pt: >>> sum(i*i for i in range(10)) # soma dos quadrados 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # produto escalar 260 >>> palavras_unicas = set(palavra for linha in pagina for palavra in linha.split()) >>> melhor_aluno = max((aluno.media, aluno.nome) for aluno in formandos) >>> dados = 'golfe' >>> list(dados[i] for i in range(len(dados)-1, -1, -1)) ['e', 'f', 'l', 'o', 'g']
ru: >>> sum(i*i for i in range(10)) # сумма квадратов 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # скалярное произведение 260 >>> unique_words = set(word for line in page for word in line.split()) >>> valedictorian = max((student.gpa, student.name) for student in graduates) >>> data = 'гольф' >>> list(data[i] for i in range(len(data)-1, -1, -1)) ['ф', 'ь', 'л', 'о', 'г']

source: Footnotes
fa: پاورقی ها
hu: Lábjegyzet
pt_pt: Notas de rodapé
ru: Примечания

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name ``__dict__`` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
fa: با یک استثنا. اشیای ماژول دارای یک ویژگی مخفی و فقط خواندنی به نام :attr:`~object.__dict__` هستند که دیکشنری مورد استفاده برای پیاده سازی فضای نام ماژول را برمی گرداند؛ نام ``__dict__`` یک ویژگی است اما یک نام جهانی نیست. بدیهی است که استفاده از این ویژگی نقض انتزاع پیاده سازی فضای نام است و باید محدود به مواردی مانند دیباگرهای پس از مرگ برنامه باشد.
pt_pt: Exceto por uma coisa. Os objetos de módulo têm um atributo secreto apenas de leitura chamado :attr:`~object.__dict__`, que devolve o dicionário usado para implementar o espaço de nomes do módulo; o nome ``__dict__`` é um atributo, mas não um nome global. Obviamente, usar isto viola a abstração da implementação do espaço de nomes e deve ser restrito a coisas como depuradores post-mortem.
ru: За исключением одного момента. Объекты модуля имеют секретный атрибут только для чтения, называемый :attr:`~object.__dict__`, который возвращает словарь, используемый для реализации пространства имён модуля; имя ``__dict__`` является атрибутом, а не глобальным именем. Очевидно, что использование этого нарушает абстракцию реализации пространства имён и должно ограничиваться такими случаями, как отладка после сбоя программы.

source: object
fa: شیء
pt_pt: objeto
ru: объект

source: method
fa: متد
pt_pt: método
ru: метод

source: name
fa: نام
pt_pt: nome
ru: имя

source: Classes
fa: کلاس ها
hu: Osztályok
ru: Классы

source: *Data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`!MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
ru: *Атрибуты-данные* соответствуют «переменным экземпляра» в Smalltalk и «членам данных» в C++. Атрибуты данных не нужно объявлять; как и локальные переменные, они возникают, когда им впервые присваиваются значения. Например, если ``x`` является экземпляром :class:`!MyClass`, созданным выше, следующий фрагмент кода напечатает значение ``16``, не оставив после себя никаких следов::

source: If ``x = MyClass()``, as above, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
ru: Если ``x = MyClass()``, как указано выше, этот вызов вернёт строку ``'hello world'``. Однако вызывать метод сразу необязательно: ``x.f`` — это объект-метод, его можно сохранить и вызвать позже. Например::

source: mangling
fa: مخفی سازی نام
ru: искажение

source: In the :class:`!MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
fa: در مثال :class:`!MyClass` این رشته را برمی گرداند ``'hello world'``. با این حال، لازم نیست که بلافاصله یک متد را فراخوانی کنید: ``x.f`` یک شیء متد است و می تواند ذخیره شود و در زمان دیگری فراخوانی شود. به عنوان مثال::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
hu: A másik fajta jellemző a metódus (más néven tagfüggvény). A metódus egy objektumhoz ,,tartozó'' függvényt jelöl. (A Pythonban a metódus kifejezés nem kizárólag egy osztály példányának metódusát jelenti -- más objektum típusok is rendelkezhetnek metódusokkal. Például a listaobjektumoknak vannak saját metódusai: append, insert, remove, sort, és így tovább. Az alábbi sorokban a metódus kifejezést kizárólag egy osztály metódusaira értjük, hacsak nincs külön kihangsúlyozva, hogy most egy másik objektum metódusáról van szó.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see https://www.python.org/download/releases/2.3/mro/.
hu: Ezekből gondolom már látszik, hogy az átgondolatlanul használt többszörös öröklődés a program karbantartását rémálommá teheti -- a névütközések elkerülése végett pedig a Python csak a konvenciókra támaszkodhat. A többszörös öröklés egyik jól ismert problémája ha a gyermekosztály két szülőosztályának egy közös nagyszülő osztálya van. Ugyan egyszerű kitalálni hogy mi történik ebben az esetben (a nagyszülő adat jellemzőinek egypéldányos változatát használja a gyermek) -- az még nem tisztázott, hogy ez a nyelvi kifejezésmód minden esetben használható-e. További részletekért lásd https://www.python.org/download/releases/2.3/mro/.
