Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, hu, pt_pt, ru

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
fa: در واقع، این کمی پیچیده تر از آن است؛ ترتیب حل روش به صورت دینامیکی تغییر می کند تا از فراخوانی های تعاونی برای :func:`super` پشتیبانی کند. این رویکرد در برخی زبان های چند-ارث بری دیگر به عنوان call-next-method شناخته می شود و قدرتمندتر از فراخوانی super که در زبان های ارث بری منفرد یافت می شود، است.
hu: Néhányan első pillanatban arra gondolnak, hogy a :class:`Szulo2`-ben és a :class:`Szulo3`-ban kellene előbb keresni, a :class:`Szulo1` előtt --- mondván hogy ez természetesebb lenne. Ez az elgondolás viszont igényli annak ismeretét, hogy mely jellemzőt definiáltak a :class:`Szulo1`-ben vagy annak egyik szülőosztályában, és csak ezután tudod elkerülni a :class:`Szulo2`-ben lévő névütközéseket. A mélyebb először szabály nem tesz különbséget a helyben definiált és öröklött változók között.
pt_pt: Na verdade, é um pouco mais complexo do que isso; a ordem de resolução de métodos muda dinamicamente para suportar chamadas cooperativas a :func:`super`. Esta abordagem é conhecida noutras linguagens de herança múltipla como *call-next-method* e é mais poderosa do que a chamada *super* encontrada em linguagens de herança única.
ru: На самом деле всё немного сложнее; порядок разрешения методов изменяется динамически для поддержки совместных вызовов :func:`super`. Этот подход известен в некоторых других языках с множественным наследованием как вызов следующего метода и является более мощным, чем вызов метода базового класса, встречающийся в языках с одиночным наследованием.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see :ref:`python_2.3_mro`.
fa: ترتیب دهی پویا لازم است زیرا در تمامی موارد وراثت چندگانه، یک یا چند رابطه الماسی وجود دارد (که در آن حداقل یکی از کلاس های والد می تواند از طریق مسیرهای مختلف از کلاس پایینی دسترسی پیدا کند). برای مثال، همه کلاس ها از :class:`object` مشتق می شوند، بنابراین هر مورد از وراثت چندگانه مسیرهای متعددی برای رسیدن به :class:`object` ارائه می دهد. برای جلوگیری از دسترسی به کلاس های پایه بیش از یک بار، الگوریتم پویا ترتیب جستجو را به شکل خطی درآورده که ترتیب چپ به راست مشخص شده در هر کلاس را حفظ می کند، هر والد را فقط یک بار فراخوانی می کند، و یکنواخت است (به این معنا که یک کلاس می تواند زیرکلاس شود، بدون اینکه ترتیب اولویت والدین آن تحت تأثیر قرار گیرد). این ویژگی ها به طور کلی امکان طراحی کلاس های قابل اعتماد و قابل توسعه با وراثت چندگانه را فراهم می کند. برای جزئیات بیشتر، به :ref:`python_2.3_mro` مراجعه کنید.
pt_pt: A ordenação dinâmica é necessária porque todos os casos de herança múltipla exibem uma ou mais relações em diamante (onde pelo menos uma das classes pai pode ser acessada através de múltiplos caminhos a partir da classe mais derivada). Por exemplo, todas as classes herdam de :class:`object`, pelo que qualquer caso de herança múltipla fornece mais do que um caminho para atingir :class:`object`. Para evitar que as classes base sejam acessadas mais do que uma vez, o algoritmo dinâmico lineariza a ordem de pesquisa de forma a preservar a ordem esquerda-direita especificada em cada classe, que chama cada pai apenas uma vez, e que é monótona (significando que uma classe pode ser subclassificada sem afetar a ordem de precedência dos seus pais). Em conjunto, estas propriedades tornam possível conceber classes fiáveis e extensíveis com herança múltipla. Para mais detalhes, consulte :ref:`python_2.3_mro`.
ru: Динамическое упорядочивание необходимо, поскольку во всех случаях множественного наследования присутствует одно или несколько ромбовидных отношений (где хотя бы к одному из родительских классов можно получить доступ через несколько путей из самого нижнего класса). Например, все классы наследуются от :class:`object`, поэтому в любом случае множественного наследования существует более одного пути для достижения :class:`object`. Чтобы предотвратить многократное обращение к базовым классам, динамический алгоритм линеаризует порядок поиска таким образом, чтобы сохранить порядок слева направо, указанный в каждом классе, посетить каждого родителя только один раз и обеспечить монотонность (это означает, что класс может быть подклассом, не затрагивая порядок обхода его родителей). В совокупности эти свойства позволяют проектировать надежные и расширяемые классы с множественным наследованием. Более подробную информацию см. в :ref:`python_2.3_mro`.

source: Private Variables
fa: متغیرهای خصوصی
hu: Privát változók
pt_pt: Variáveis privadas
ru: Закрытые переменные

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
fa: متغیرهای نمونه "خصوصی" که نمی توان به جز از داخل یک شیء به آن ها دسترسی داشت در پایتون وجود ندارند. با این حال، یک قرارداد وجود دارد که توسط بیشتر کدهای پایتون رعایت می شود: یک نام که با یک آندرلاین پیشوند شده است (برای مثال ``_spam``) باید به عنوان بخشی غیرعمومی از API در نظر گرفته شود (چه کاربرد یک تابع، یک روش یا یک عضو داده باشد). باید به عنوان یک جزئیات پیاده سازی تلقی شود و ممکن است بدون هشدار قبلی تغییر کند.
hu: Egyedi azonosítók létrehozását az osztályokhoz a Python korlátozottan támogatja. Bármely azonosító, amely így néz ki: ``__spam`` (legalább két bevezető alsóvonás, amit legfeljebb egy alsóvonás követhet) szövegesen kicserélődik a ``_classname__spam`` formára, ahol a ``classname`` az aktuális osztály neve egy alsóvonással bevezetve. Ez a csere végrehajtódik az azonosító pozíciójára való tekintet nélkül, úgyhogy használható osztály-egyedi példányok, osztályváltozók, metódusok definiálására --- még akkor is, ha más osztályok példányait saját privát változói közé veszi fel (???Ford: ellenőrizni!)
pt_pt: Variáveis de instância "privadas" que não podem ser acessadas exceto a partir do interior de um objeto não existem em Python. No entanto, existe uma convenção seguida pela maioria do código Python: um nome prefixado com um sublinhado (por exemplo, ``_spam``) deve ser tratado como uma parte não pública da API (seja uma função, um método ou um membro de dados). Deve ser considerado um detalhe de implementação e sujeito a alteração sem aviso prévio.
ru: В Python не существует «закрытых» переменные экземпляра, доступ к которым был бы возможен только изнутри объекта. Однако существует соглашение, которому следует большая часть кода Python: начинающееся с подчеркивания имя (например, ``_spam``) должно рассматриваться как непубличная часть API (будь то функция, метод или элемент данных). Такое имя следует рассматривать как деталь реализации, которая может измениться без уведомления.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
fa: از آنجا که استفاده موجه ای برای اعضای خصوصی کلاس وجود دارد (یعنی به منظور جلوگیری از تداخل نام ها با نام هایی که توسط زیرکلاس ها تعریف شده اند)، پشتیبانی محدودی برای چنین مکانیزمی به نام :dfn:`تغییر نام` وجود دارد. هر شناسه ای به فرم ``__spam`` (حداقل با دو زیرخط ابتدایی و حداکثر یک زیرخط انتهایی) به صورت متنی با ``_classname__spam`` جایگزین می شود، که در آن ``classname`` نام کلاس جاری است با حذف زیرخط های اولیه. این تغییر نام بدون توجه به موقعیت نحوی شناسه انجام می شود، تا زمانی که در تعریف یک کلاس رخ دهد.
hu: Ha a cserélt név hosszabb mint 255 karakter, az értelmező csonkíthatja az új nevet. Külső osztályoknál, vagy ahol az osztálynév következetesen alsóvonásokból áll??? nem történik csonkítás. A névcsonkítás célja az, hogy az osztályoknak egyszerű megoldást biztosítson a "private" változók és metódusok definiálására --- anélkül, hogy aggódnunk kellene a származtatott osztályokban megjelenő privát változók miatt, vagy esetleg a származtatott osztályban már meglévő változó privát változóval való felülírása miatt. Fontos tudni, hogy a névcsonkítási szabályok elsősorban a problémák elkerülését célozzák meg --- így még mindig leheséges annak, aki nagyon akarja, hogy elérje vagy módosítsa a privátnak tartott változókat.
pt_pt: Como existe um caso de uso válido para membros privados de classe (nomeadamente para evitar conflitos de nomes com nomes definidos por subclasses), existe um suporte limitado para tal mecanismo, chamado :dfn:`name mangling`. Qualquer identificador da forma ``__spam`` (pelo menos dois sublinhados iniciais, no máximo um sublinhado final) é textualmente substituído por ``_nomeclasse__spam``, onde ``nomeclasse`` é o nome atual da classe com os sublinhados iniciais removidos. Este *mangling* é feito independentemente da posição sintática do identificador, desde que ocorra dentro da definição de uma classe.
ru: Поскольку существует допустимый вариант использования закрытых членов класса (а именно, чтобы избежать конфликтов имён с именами, определенными подклассами), существует ограниченная поддержка такого механизма, называемого :dfn:`искажением имён`. Любой идентификатор вида ``__spam`` (как минимум два ведущих подчёркивания и не более одного завершающего) заменяется на уровне исходного текста на ``_classname__spam``, где ``classname``— это имя текущего класса без ведущих подчёркиваний. Это искажение выполняется без учета синтаксической позиции идентификатора, если только он встречается внутри определения класса.

source: The :ref:`private name mangling specifications <private-name-mangling>` for details and special cases.
fa: :ref:`private name mangling specifications <private-name-mangling>` برای جزئیات و موارد خاص.
pt_pt: As :ref:`especificações de name mangling privado <private-name-mangling>` para detalhes e casos especiais.
ru: :ref:`Спецификации искажения закрытых имён <private-name-mangling>` для получения подробной информации и особых случаев.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
fa: نام گذاری مخفی برای اجازه دادن به زیربخش ها برای نادیده گرفتن روش ها بدون شکستن فراخوانی های روش درون کلاسی مفید است. به عنوان مثال:
pt_pt: O *name mangling* é útil para permitir que subclasses substituam métodos sem quebrar chamadas de métodos intraclasse. Por exemplo:
ru: Изменение имён полезно для того, чтобы позволить подклассам переопределять методы, не нарушая вызовы методов внутри самого класса. Например::

source: class Mapping: def __init__(self, iterable): self.items_list = [] self.__update(iterable) def update(self, iterable): for item in iterable: self.items_list.append(item) __update = update # private copy of original update() method class MappingSubclass(Mapping): def update(self, keys, values): # provides new signature for update() # but does not break __init__() for item in zip(keys, values): self.items_list.append(item)
pt_pt: class Mapeamento: def __init__(self, iteravel): self.lista_itens = [] self.__atualizar(iteravel) def atualizar(self, iteravel): for item in iteravel: self.lista_itens.append(item) __atualizar = atualizar # cópia privada do método original atualizar() class SubclasseMapeamento(Mapeamento): def atualizar(self, chaves, valores): # fornece nova assinatura para atualizar() # mas não quebra __init__() for item in zip(chaves, valores): self.lista_itens.append(item)
ru: class Mapping: def __init__(self, iterable): self.items_list = [] self.__update(iterable) def update(self, iterable): for item in iterable: self.items_list.append(item) __update = update # закрытая копия исходного метода update() class MappingSubclass(Mapping): def update(self, keys, values): # новая сигнатура метода update() # но __init__() при этом остаётся работоспособным for item in zip(keys, values): self.items_list.append(item)

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
fa: مثال بالا حتی اگر ``MappingSubclass`` یک شناسه ``__update`` معرفی کند نیز کار خواهد کرد زیرا در کلاس ``Mapping`` با ``_Mapping__update`` و در کلاس ``MappingSubclass`` با ``_MappingSubclass__update`` جایگزین می شود.
pt_pt: O exemplo acima funcionaria mesmo que ``SubclasseMapeamento`` introduzisse um identificador ``__atualizar``, já que seria substituído por ``_Mapeamento__atualizar`` na classe ``Mapeamento`` e por ``_SubclasseMapeamento__atualizar`` na classe ``SubclasseMapeamento``, respetivamente.
ru: Приведённый выше пример будет работать, даже если ``MappingSubclass`` введёт идентификатор ``__update``, поскольку он заменяется на ``_Mapping__update`` в классе ``Mapping`` и на ``_MappingSubclass__update`` в классе ``MappingSubclass`` соответственно.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
fa: توجه داشته باشید که قوانین مبهم سازی عمدتاً برای جلوگیری از تصادفات طراحی شده اند؛ همچنان ممکن است به یک متغیر که خصوصی محسوب می شود دسترسی پیدا کرده یا آن را تغییر دهید. این امر حتی می تواند در شرایط خاص، مانند درون دیباگر مفید باشد.
pt_pt: Note que as regras de *mangling* são concebidas principalmente para evitar acidentes; ainda assim, é possível aceder ou modificar uma variável considerada privada. Isto pode até ser útil em circunstâncias especiais, como no depurador.
ru: Обратите внимание, что правила искажения имён созданы главным образом для предотвращения случайных ошибок. При желании всё ещё можно получить доступ к переменной, которая считается закрытой, или изменить её. Это может быть даже полезно в особых случаях, например, при отладке.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
fa: توجه داشته باشید که کدی که به ``exec()`` یا ``eval()`` ارسال می شود، classname کلاس فراخوانی شده را به عنوان کلاس فعلی در نظر نمی گیرد؛ این مشابه تأثیر جمله ``global`` است که اثر آن نیز به کدی محدود می شود که با هم byte-compiled شده اند. همین محدودیت برای ``getattr()``، ``setattr()`` و ``delattr()`` نیز اعمال می شود، همچنین زمانی که به طور مستقیم به ``__dict__`` ارجاع داده می شود.
hu: Fontos, hogy a ``exec``, ``eval()`` vagy ``evalfile()`` által végrehajtott kód nem veszi figyelembe a hívó osztály nevét az aktuális osztály esetében --- ez hasonló a ``global`` változók működéséhez, előre lefordított byte-kód esetében. Hasonló korlátozások léteznek a ``getattr()``, ``setattr()`` és ``delattr()`` esetében, ha közvetlenül hívják meg a ``__dict__`` utasítást.
pt_pt: Note que o código passado a ``exec()`` ou ``eval()`` não considera o nome da classe da classe invocadora como sendo a classe atual; isto é semelhante ao efeito da instrução ``global``, cujo efeito é igualmente restrito ao código que é compilado em conjunto. A mesma restrição aplica-se a ``getattr()``, ``setattr()`` e ``delattr()``, bem como ao referenciar ``__dict__`` diretamente.
ru: Обратите внимание, что код, переданный в ``exec()`` или ``eval()``, не считает имя класса вызывающего кода текущим классом. Это похоже на эффект инструкции ``global``, действие которой также ограничено кодом, скомпилированным вместе. Такое же ограничение применяется к функциям ``getattr()``, ``setattr()`` и ``delattr()``, а также при прямом обращении к ``__dict__``.

source: Odds and Ends
hu: Egyebek...
pt_pt: Vários
ru: Разное и полезное

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. The idiomatic approach is to use :mod:`dataclasses` for this purpose::
fa: گاهی اوقات داشتن یک نوع داده مشابه به "record" در زبان Pascal یا "struct" در زبان C، که چند آیتم داده ای با نام های مشخص را با هم جمع می کند، مفید است. روش ایدیوماتیک برای این منظور استفاده از :mod:`dataclasses` است::
pt_pt: Às vezes é útil ter um tipo de dados semelhante ao "registro" do Pascal ou "struct" do C, agrupando alguns itens de dados nomeados. A abordagem idiomática é usar :mod:`dataclasses` para este propósito:
ru: Иногда бывает полезно иметь тип данных, похожий на «запись» в Pascal или «структуру» в C, объединяющий несколько именованных элементов данных. Идиоматический подход заключается в использовании для этой цели :mod:`dataclasses`::

source: from dataclasses import dataclass @dataclass class Employee: name: str dept: str salary: int
pt_pt: from dataclasses import dataclass @dataclass class Empregado: nome: str departamento: str salario: int

source: >>> john = Employee('john', 'computer lab', 1000) >>> john.dept 'computer lab' >>> john.salary 1000
pt_pt: >>> joao = Empregado('joao', 'laboratório de informática', 1000) >>> joao.departamento 'laboratório de informática' >>> joao.salario 1000
ru: >>> john = Employee('Джон', 'компьютерная лаборатория', 1000) >>> john.dept 'компьютерная лаборатория' >>> john.salary 1000

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` that get the data from a string buffer instead, and pass it as an argument.
fa: وقتی که یک قطعه کد Python نیاز به یک نوع داده انتزاعی خاص دارد، اغلب می توان بجای آن یک کلاسی که روش های آن نوع داده را شبیه سازی می کند، پاس کرد. به عنوان مثال، اگر تابعی دارید که داده هایی را از یک شیء فایل فرمت می کند، می توانید کلاسی با روش های :meth:`~io.TextIOBase.read` و :meth:`~io.TextIOBase.readline` تعریف کنید که داده ها را از یک بافر رشته ای دریافت کند و آن را به عنوان یک آرگومان پاس کنید.
pt_pt: Um pedaço de código Python que espera um tipo de dados abstrato particular pode frequentemente ser passado uma classe que emula os métodos desse tipo de dados em vez disso. Por exemplo, se tiver uma função que formata alguns dados de um objeto de ficheiro, pode definir uma classe com métodos :meth:`~io.TextIOBase.read` e :meth:`~io.TextIOBase.readline` que obtêm os dados de um buffer de string em vez disso, e passá-lo como um argumento.
ru: Фрагмент кода Python, который ожидает определённый абстрактный тип данных, часто может вместо этого принимать класс, который эмулирует методы этого типа данных. Например, если у вас есть функция, которая форматирует некоторые данные из файлового объекта, вы можете определить класс с методами :meth:`~io.TextIOBase.read` и :meth:`~io.TextIOBase.readline`, которые получают вместо этого данные из строкового буфера и передать его в качестве аргумента.

source: :ref:`Instance method objects <instance-methods>` have attributes, too: :attr:`m.__self__ <method.__self__>` is the instance object with the method :meth:`!m`, and :attr:`m.__func__ <method.__func__>` is the :ref:`function object <user-defined-funcs>` corresponding to the method.
fa: :ref:`Instance method objects <instance-methods>` نیز ویژگی هایی دارند: :attr:`m.__self__ <method.__self__>` شیء نمونه با متد :meth:`!m` است و :attr:`m.__func__ <method.__func__>` همان :ref:`function object <user-defined-funcs>` مربوط به متد است.
pt_pt: :ref:`Objetos de método de instância <instance-methods>` também têm atributos: :attr:`m.__self__ <method.__self__>` é o objeto de instância com o método :meth:`!m`, e :attr:`m.__func__ <method.__func__>` é o :ref:`objeto de função <user-defined-funcs>` correspondente ao método.
ru: :ref:`Объекты метода экземпляра <instance-methods>` также имеют атрибуты: :attr:`m.__self__ <method.__self__>` — это объект экземпляра с методом :meth:`!m`, а :attr: `m.__func__ <method.__func__>` — это :ref:`объект функции <user-defined-funcs>`, соответствующий методу.

source: Iterators
fa: ترتیب دهنده ها
hu: Iterátorok
pt_pt: Iteradores
ru: Итераторы

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
fa: احتمالاً تا حالا متوجه شده اید که اکثر اشیاء ظرفی می توانند با استفاده از یک عبارت :keyword:`for` حلقه زده شوند::
hu: Valószínűleg már észrevetted, hogy a legtöbb tárolóobjektum bejárható a :keyword:`for` ciklusutasítás használatával::
pt_pt: Até agora, provavelmente já notou que a maioria dos objetos contentor podem ser percorridos usando uma instrução :keyword:`for`:
ru: К этому моменту вы, вероятно, заметили, что большинство объектов-контейнеров можно перебрать с помощью инструкции :keyword:`for`::

source: for element in [1, 2, 3]: print(element) for element in (1, 2, 3): print(element) for key in {'one':1, 'two':2}: print(key) for char in "123": print(char) for line in open("myfile.txt"): print(line, end='')
pt_pt: for elemento in [1, 2, 3]: print(elemento) for elemento in (1, 2, 3): print(elemento) for chave in {'um':1, 'dois':2}: print(chave) for caractere in "123": print(caractere) for linha in open("meuficheiro.txt"): print(linha, end='')
ru: for element in [1, 2, 3]: print(element) for element in (1, 2, 3): print(element) for key in {'один':1, 'два':2}: print(key) for char in "123": print(char) for line in open("myfile.txt"): print(line, end='')
