Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, hu, pt_pt, ru

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
fa: نام های معتبر برای متدهای یک شیء نمونه به کلاس آن بستگی دارد. به طور تعریف شده، تمام ویژگی های یک کلاس که اشیاء تابع باشند، متدهای متناظر نمونه های آن کلاس را تعریف می کنند. بنابراین در مثال ما، ``x.f`` یک مرجع متد معتبر است، چون ``MyClass.f`` یک تابع است، اما ``x.i`` نیست، چون ``MyClass.i`` نیست. با این حال، ``x.f`` معادل ``MyClass.f`` نیست --- این یک *method object* است، نه یک شیء تابع.
hu: A létrehozott objektum metódusainak neve az osztályától függ. Meghatározás szerint minden felhasználó által definiált metódust az adott (létező) példány nevével kell hívni. Például ``x.f`` egy érvényes függvényhivatkozás, ha az ``Osztalyom.f`` függvény létezik (``x`` objektum az ``Osztalyom`` példánya), de ``x.i`` nem érvényes ha ``Osztalyom.i`` változót nem hoztuk létre az osztály definiálásakor. Fontos, hogy ``x.f`` nem ugyanaz, mint ``Osztalyom.f`` --- ez egy *metódusobjektum*, nem egy függvényobjektum.
pt_pt: Os nomes de métodos válidos de um objeto de instância dependem da sua classe. Por definição, todos os atributos de uma classe que são objetos de função definem métodos correspondentes das suas instâncias. Assim, no nosso exemplo, ``x.f`` é uma referência de método válida, já que ``MyClass.f`` é uma função, mas ``x.i`` não é, já que ``MyClass.i`` não é. Mas ``x.f`` não é a mesma coisa que ``MyClass.f`` — é um *objeto de método*, não um objeto de função.
ru: Методы, доступные у объекту-экземпляру, зависят от его класса. По определению, все атрибуты класса, которые являются функциями, создают соответствующие методы у его экземпляров. В нашем примере ``x.f`` — ссылка на метод, потому что ``MyClass.f`` — это функция; в отличие от ``x.i``, потому что ``MyClass.i`` не является функцией. Но ``x.f`` — не то же самое, что ``MyClass.f`` — это *объект метода*, а не объект функции.

source: Method Objects
fa: اشیای متد
hu: Az metódusobjektumok
pt_pt: Objetos de método
ru: Объекта методов

source: Usually, a method is called right after it is bound::
fa: معمولاً یک متد بلافاصله بعد از اینکه مرتبط شد فراخوانی می شود::
hu: Többnyire a metódusokat rögtön meghívjuk::
pt_pt: Normalmente, um método é chamado logo após ser ligado:
ru: Обычно метод вызывается сразу после обращения к нему::

source: will continue to print ``hello world`` until the end of time.
fa: تا پایان زمان به چاپ ``hello world`` ادامه خواهد داد.
hu: Ez a kód az örökkévalóságig a ``hello világ`` üzenetet írja ki.
pt_pt: continuará a imprimir ``olá mundo`` até ao fim dos tempos.
ru: будет продолжать печатать ``hello world`` до конца времён.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`!f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
fa: دقیقاً چه اتفاقی می افتد وقتی که یک متد فراخوانی می شود؟ شاید متوجه شده باشید که ``x.f()`` بدون آرگومان فراخوانی شد، حتی با این که تعریف تابع برای :meth:`!f` یک آرگومان مشخص کرده است. چه بر سر آرگومان آمد؟ به احتمال زیاد پایتون یک استثناء مطرح می کند وقتی که تابعی که نیازمند یک آرگومان است، بدون هیچ آرگومانی فراخوانی شود --- حتی اگر آرگومان به طور واقعی مورد استفاده قرار نگیرد...
pt_pt: O que acontece exatamente quando um método é chamado? Pode ter notado que ``x.f()`` foi chamado sem argumento acima, embora a definição da função para :meth:`!f` especificasse um argumento. O que aconteceu ao argumento? Certamente o Python levanta uma exceção quando uma função que requer um argumento é chamada sem nenhum — mesmo que o argumento não seja realmente usado...
ru: Что же именно происходит при вызове метода? Вы могли заметить, что ``x.f()`` был вызван без аргумента, хотя в определении функции :meth:`!f` указан аргумент. Куда же он подевался? Разумеется, Python должен выбросить исключение, если вызвать функцию, которой нужен аргумент, без него — даже если аргумент на самом деле не используется…

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
fa: در واقع، شاید پاسخ را حدس زده باشید: ویژگی خاص متدها این است که شیء نمونه به عنوان اولین آرگومان به تابع ارسال می شود. در مثال ما، فراخوانی ``x.f()`` دقیقا معادل ``MyClass.f(x)`` است. به طور کلی، فراخوانی یک متد با لیستی از آرگومان ها *n* معادل فراخوانی تابع متناظر با یک لیست آرگومان است که با وارد کردن شیء نمونه متد قبل از اولین آرگومان ایجاد می شود.
hu: Lehet hogy már kitaláltad a választ: az a különleges a metódusokban, hogy hívásukkor az őket tartalmazó osztálypéldányt megkapják az első változóban. A példánkban ``x.f()`` hívása pontosan ugyanaz, mintha ``Osztalyom.f(x)`` metódust hívnánk. Általában metódusok hívása *n* argumentummal ugyanaz, mintha az osztálydefiníció függvényét hívnánk meg úgy, hogy a legelső argumentum elé az aktuális példány nevét beillesztjük.
pt_pt: Na verdade, pode ter adivinhado a resposta: a particularidade dos métodos é que o objeto de instância é passado como o primeiro argumento da função. No nosso exemplo, a chamada ``x.f()`` é exatamente equivalente a ``MyClass.f(x)``. Em geral, chamar um método com uma lista de *n* argumentos é equivalente a chamar a função correspondente com uma lista de argumentos que é criada inserindo o objeto de instância do método antes do primeiro argumento.
ru: На самом деле, вы, вероятно, уже догадались: особенность методов в том, что объект-экземпляр передаётся в функцию как первый аргумент. В нашем примере вызов ``x.f()`` полностью совпадает с ``MyClass.f(x)``. Вообще, вызов метода со списком из *n* аргументов эквивалентен вызову соответствующей функции со списком аргументов, полученным вставкой объекта-экземпляра метода перед первым аргументом.

source: In general, methods work as follows. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, references to both the instance object and the function object are packed into a method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
fa: به طور کلی، متدها به صورت زیر عمل می کنند. وقتی یک ویژگی غیر داده ای از یک نمونه ارجاع داده می شود، کلاس نمونه جستجو می شود. اگر نام نشان دهنده یک ویژگی معتبر کلاس باشد که یک شیء تابع است، ارجاعات به هر دو شیء نمونه و شیء تابع در یک شیء متد بسته بندی می شوند. هنگامی که شیء متد با یک فهرست آرگومان فراخوانی می شود، یک فهرست آرگومان جدید از شیء نمونه و فهرست آرگومان ساخته می شود، و شیء تابع با این فهرست آرگومان جدید فراخوانی می شود.
pt_pt: Em geral, os métodos funcionam da seguinte forma. Quando um atributo não de dados de uma instância é referenciado, a classe da instância é pesquisada. Se o nome denota um atributo de classe válido que é um objeto de função, as referências tanto ao objeto de instância como ao objeto de função são empacotadas num objeto de método. Quando o objeto de método é chamado com uma lista de argumentos, uma nova lista de argumentos é construída a partir do objeto de instância e da lista de argumentos, e o objeto de função é chamado com esta nova lista de argumentos.
ru: В целом методы работают следующим образом. Когда у экземпляра запрашивается атрибут, который не является данными, происходит поиск в классе экземпляра. Если найденный атрибут является функцией, то ссылка на объект-экземпляр и функция упаковываются в объект-метод. Когда объект-метод вызывается с некоторым списком аргументов, создаётся новый список из объекта-экземпляра и этих аргументов, и затем функция вызывается с этим новым списком аргументов.

source: Class and Instance Variables
fa: کلاس و متغیرهای نمونه
pt_pt: Variáveis de classe e de instância
ru: Переменные класса и экземпляра

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
fa: به طور کلی، متغیر های نمونه برای داده های منحصر به فرد هر نمونه و متغیر های کلاسی برای خصوصیات و روش هایی استفاده می شوند که توسط تمام نمونه های کلاس به اشتراک گذاشته می شوند::
pt_pt: Em geral, as variáveis de instância são para dados únicos de cada instância e as variáveis de classe são para atributos e métodos partilhados por todas as instâncias da classe:
ru: Вообще говоря, переменные экземпляра предназначены для данных, уникальных для каждого экземпляра, а переменные класса — для атрибутов и методов, общих для всех экземпляров класса::

source: class Dog: kind = 'canine' # class variable shared by all instances def __init__(self, name): self.name = name # instance variable unique to each instance >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.kind # shared by all dogs 'canine' >>> e.kind # shared by all dogs 'canine' >>> d.name # unique to d 'Fido' >>> e.name # unique to e 'Buddy'
pt_pt: class Cachorro: especie = 'canino' # variável de classe partilhada por todas as instâncias def __init__(self, nome): self.nome = nome # variável de instância única para cada instância >>> d = Cachorro('Fido') >>> e = Cachorro('Buddy') >>> d.especie # partilhado por todos os cachorros 'canino' >>> e.especie # partilhado por todos os cachorros 'canino' >>> d.nome # único para d 'Fido' >>> e.nome # único para e 'Buddy'
ru: class Dog: kind = 'собачий' # переменная класса, общая для всех экземпляров def __init__(self, name): self.name = name # переменная экземпляра, уникальная для каждого объекта >>> d = Dog('Фидо') >>> e = Dog('Бадди') >>> d.kind # общее для всех собак 'собачий' >>> e.kind # общее для всех собак 'собачий' >>> d.name # уникально для d 'Фидо' >>> e.name # уникально для e 'Бадди'

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
fa: همانطور که در :ref:`tut-object` بحث شد، داده های مشترک می توانند تأثیرات شگفت آوری در گیر کردن اشیاء :term:`mutable` مانند لیست ها و دیکشنری ها داشته باشند. به عنوان مثال، لیست *tricks* در کد زیر نباید به عنوان یک متغیر کلاس استفاده شود زیرا تنها یک لیست توسط تمام نمونه های *Dog* به اشتراک گذاشته می شود::
pt_pt: Como discutido em :ref:`tut-object`, dados partilhados podem ter efeitos possivelmente surpreendentes envolvendo objetos :term:`mutáveis` como listas e dicionários. Por exemplo, a lista *trucos* no seguinte código não deve ser usada como uma variável de classe porque apenas uma única lista seria partilhada por todas as instâncias de *Cachorro*:
ru: Как обсуждалось в :ref:`tut-object`, разделяемые данные могут привести к неожиданным последствиям, если они являются :term:`изменяемыми` объектами, как списки и словари. Например, список *tricks* в следующем коде не следует использовать как переменную класса, так как в противном случае один и тот же список будет разделяться всеми экземплярами *Dog*::

source: class Dog: tricks = [] # mistaken use of a class variable def __init__(self, name): self.name = name def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks # unexpectedly shared by all dogs ['roll over', 'play dead']
pt_pt: class Cachorro: trucos = [] # uso errado de uma variável de classe def __init__(self, nome): self.nome = nome def adicionar_truco(self, truco): self.trucos.append(truco) >>> d = Cachorro('Fido') >>> e = Cachorro('Buddy') >>> d.adicionar_truco('rolar') >>> e.adicionar_truco('fazer-se de morto') >>> d.trucos # inesperadamente partilhado por todos os cachorros ['rolar', 'fazer-se de morto']
ru: class Dog: tricks = [] # ошибочное использование переменной класса def __init__(self, name): self.name = name def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Фидо') >>> e = Dog('Бадди') >>> d.add_trick('сделать переворот') >>> e.add_trick('прикинуться мёртвым') >>> d.tricks # неожиданно общие данные для всех собак ['сделать переворот', 'прикинуться мёртвым']

source: Correct design of the class should use an instance variable instead::
fa: طراحی صحیح کلاس باید به جای آن از یک متغیر نمونه استفاده کند::
pt_pt: O desenho correto da classe deve usar uma variável de instância em vez disso:
ru: Правильно спроектированный класс должен использовать вместо этого переменную экземпляра::

source: class Dog: def __init__(self, name): self.name = name self.tricks = [] # creates a new empty list for each dog def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks ['roll over'] >>> e.tricks ['play dead']
pt_pt: class Cachorro: def __init__(self, nome): self.nome = nome self.trucos = [] # cria uma nova lista vazia para cada cachorro def adicionar_truco(self, truco): self.trucos.append(truco) >>> d = Cachorro('Fido') >>> e = Cachorro('Buddy') >>> d.adicionar_truco('rolar') >>> e.adicionar_truco('fazer-se de morto') >>> d.trucos ['rolar'] >>> e.trucos ['fazer-se de morto']
ru: class Dog: def __init__(self, name): self.name = name self.tricks = [] # создаётся новый пустой список для каждой собаки def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Фидо') >>> e = Dog('Бадди') >>> d.add_trick('сделать переворот') >>> e.add_trick('прикинуться мёртвым') >>> d.tricks ['сделать переворот'] >>> e.tricks ['прикинуться мёртвым']

source: Random Remarks
fa: نکات تصادفی
hu: Pár megjegyzés
pt_pt: Comentários aleatórios
ru: Полезные замечания

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
fa: اگر یک نام ویژگی هم در یک نمونه و هم در یک کلاس وجود داشته باشد، جستجوی ویژگی به نمونه اولویت می دهد::
pt_pt: Se o mesmo nome de atributo ocorrer tanto numa instância como numa classe, então a pesquisa de atributos prioriza a instância:
ru: Если в классе и в экземпляре встречаются атрибуты с одинаковыми именем, используется атрибут экземпляра::

source: >>> class Warehouse: ... purpose = 'storage' ... region = 'west' ... >>> w1 = Warehouse() >>> print(w1.purpose, w1.region) storage west >>> w2 = Warehouse() >>> w2.region = 'east' >>> print(w2.purpose, w2.region) storage east
fa: >>> class Warehouse: ... purpose = 'انبار داری' ... region = 'غرب' ... >>> w1 = Warehouse() >>> print(w1.purpose, w1.region) storage west >>> w2 = Warehouse() >>> w2.region = 'شرق' >>> print(w2.purpose, w2.region) storage east
pt_pt: >>> class Armazem: ... finalidade = 'armazenamento' ... regiao = 'oeste' ... >>> w1 = Armazem() >>> print(w1.finalidade, w1.regiao) armazenamento oeste >>> w2 = Armazem() >>> w2.regiao = 'este' >>> print(w2.finalidade, w2.regiao) armazenamento este
ru: >>> class Warehouse: ... purpose = 'хранение' ... region = 'запад' ... >>> w1 = Warehouse() >>> print(w1.purpose, w1.region) хранение запад >>> w2 = Warehouse() >>> w2.region = 'восток' >>> print(w2.purpose, w2.region) хранение восток

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
fa: ویژگی های داده ها ممکن است هم توسط متدها و هم توسط کاربران عادی ("مشتریان") یک شیء مورد استفاده قرار گیرند. به عبارت دیگر، کلاس ها برای پیاده سازی انواع داده های انتزاعی ناب قابل استفاده نیستند. در واقع، هیچ چیزی در پایتون امکان پنهان سازی داده ها را به طور کامل فراهم نمی کند --- همه چیز بر اساس قرارداد انجام می شود. (از طرف دیگر، پیاده سازی پایتون که به زبان C نوشته شده است، می تواند جزئیات پیاده سازی را به طور کامل پنهان کند و در صورت نیاز دسترسی به یک شیء را کنترل نماید؛ این قابلیت می تواند توسط افزونه های نوشته شده به زبان C برای پایتون استفاده شود.)
hu: Az adatjellemzőkre a metódusok is hivatkozhatnak, éppúgy mint az objektum hagyományos felhasználói. Más szavakkal az osztályok nem használhatók csupasz absztrakt adattípusok megvalósítására. Valójában a Pythonban jelenleg semmi sincs, ami az adatrejtés elvét biztosítani tudná -- minden az elnevezési konvenciókra épül. Másrészről az eredeti C alapú Python képes teljesen elrejteni a megvalósítási részleteket és ellenőrizni az objektum elérését, ha szükséges; ehhez egy C nyelven írt kiegészítést kell használni.
pt_pt: Os atributos de dados podem ser referenciados tanto por métodos como por utilizadores comuns ("clientes") de um objeto. Em outras palavras, as classes não são utilizáveis para implementar tipos de dados abstratos puros. Na verdade, nada em Python torna possível impor o ocultamento de dados — tudo é baseado em convenção. (Por outro lado, a implementação do Python, escrita em C, pode ocultar completamente detalhes de implementação e controlar o acesso a um objeto, se necessário; isto pode ser usado por extensões ao Python escritas em C.)
ru: К атрибутам данных можно обращаться как через методы, так и через обычных пользователей ("клиентов") объекта. Другими словами, классы не позволяют реализовать чисто абстрактные типы данных. На практике, ничего в Python не позволяет полностью скрыть данные — всё основано на соглашениях. (С другой стороны, реализация Python на C может полностью скрыть детали реализации и контролировать доступ к объекту, если это необходимо; это может использоваться расширениями на C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
fa: مشتریان باید با دقت از ویژگی های داده استفاده کنند --- ممکن است مشتریان با تداخل در ویژگی های داده خود، ناپایداری هایی که توسط متدها حفظ می شود را به هم بزنند. توجه داشته باشید که مشتریان ممکن است ویژگی های داده خود را بدون تأثیر بر اعتبار متدها به یک شیء مثال اضافه کنند، به شرط اینکه از تداخل نام ها جلوگیری شود --- مجدد، یک کنوانسیون نام گذاری می تواند بسیاری از مشکلات را در اینجا حل کند.
hu: A kliensek az adatjellemzőket csak óvatosan használhatják, mert elronthatják azokat a variánsokat, amelyeket olyan eljárások tartanak karban, amelyek időpontbélyeggel dolgoznak. Az objektum felhasználói saját adatjellemzőiket bármiféle ellenőrzés nélkül hozzáadhatják az objektumokhoz amíg ezzel nem okoznak névütközést -- az elnevezési konvenciók használatával elég sok fejfájástól megszabadulhatunk!
pt_pt: Os clientes devem usar atributos de dados com cuidado — os clientes podem estragar invariantes mantidos pelos métodos ao alterar os seus atributos de dados. Note que os clientes podem adicionar os seus próprios atributos de dados a um objeto de instância sem afetar a validade dos métodos, desde que sejam evitados conflitos de nomes — novamente, uma convenção de nomeação pode poupar muitas dores de cabeça aqui.
ru: Клиенты должны использовать атрибуты данных осторожно — они могут нарушить инварианты, поддерживаемые методами, изменяя их напрямую. Обратите внимание, что клиенты могут добавлять свои собственные атрибуты к экземпляру объекта, не нарушая работу методов, если избегают конфликтов имён — опять же, соглашения об именах могут уберечь от множества проблем.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
fa: هیچ روش کوتاهی برای ارجاع به ویژگی های داده (یا روش های دیگر!) از درون متدها وجود ندارد. من معتقدم که این در واقع خوانایی متدها را افزایش می دهد: هیچ احتمالی برای اشتباه گرفتن متغیرهای محلی و متغیرهای نمونه در هنگام مرور سریع یک متد وجود ندارد.
hu: A metódusokban nem használhatunk rövidítést az adatjellemzőkre (vagy más metódusokra). Én úgy látom, hogy ez növeli a metódusok olvashatóságát, és nem hagy esélyt a helyi és a példányosított változók összekeverésére, mikor a metódus forráskódját olvassuk.
pt_pt: Não existe um atalho para referenciar atributos de dados (ou outros métodos!) a partir de dentro de métodos. Acho que isto aumenta na verdade a legibilidade dos métodos: não há possibilidade de confundir variáveis locais e variáveis de instância ao percorrer um método.
ru: Внутри методов нет никакой сокращённой формы для обращения к атрибутам данных (или другим методам!). На самом деле, это повышает читаемость кода: нет риска перепутать локальные переменные и переменные экземпляра при беглом просмотре метода.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
fa: اغلباً، اولین آرگومان یک متد ``self`` نامیده می شود. این تنها یک قرارداد است: نام ``self`` هیچ معنای خاصی برای پایتون ندارد. اما توجه داشته باشید که با رعایت نکردن این قرارداد، امکان دارد کد شما برای دیگر برنامه نویسان پایتون کمتر قابل خواندن باشد و همچنین ممکن است یک برنامه *class browser* نوشته شود که به چنین قراردادی وابسته باشد.
hu: A hagyományokhoz hűen a metódusok első argumentumának neve rendszerint ``self``. Ez valóban csak egy szokás: a ``self`` névnek semmilyen speciális jelentése nincs a Pythonban. Azért vegyük figyelembe, hogy ha eltérünk a hagyományoktól, akkor a program nehezebben olvashatóvá válik, és a *osztályböngésző* is a tradicionális változónevet használja.
pt_pt: Muitas vezes, o primeiro argumento de um método é chamado ``self``. Isto não é mais do que uma convenção: o nome ``self`` não tem qualquer significado especial para o Python. Note, no entanto, que ao não seguir a convenção, o seu código pode ser menos legível para outros programadores Python, e também é concebível que um programa *navegador de classes* possa ser escrito que dependa de tal convenção.
ru: Первый аргумент метода часто называют ``self``. Это всего лишь общепринятая договорённость: имя ``self`` не имеет никакого особого значения в Python. Однако если не придерживаться этой практики, ваш код может стать менее читабельным для других программистов, а некоторые инструменты анализа кода, вроде *обозревателей классов*, могут полагаться на такое соглашение.
