Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, hu, pt_pt, ru

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
fa: هر شیء تابع ای که یک ویژگی کلاس باشد، یک متد برای نمونه های آن کلاس تعریف می کند. ضروری نیست که تعریف تابع به طور متنی در تعریف کلاس قرار بگیرد: تخصیص یک شیء تابع به یک متغیر محلی در کلاس نیز قابل قبول است. برای مثال:
hu: Az osztály definíciójában megadott függvények az osztály példányai számára hoznak létre metódusokat (a példányhoz tartozó függvényeket). Nem szükségszerű azonban hogy egy függvénydefiníció kódja az osztálydefiníció része legyen: egy definíción kívüli függvény helyi változóhoz való rendelése is megfelel a célnak. Például::
pt_pt: Qualquer objeto de função que seja um atributo de classe define um método para instâncias dessa classe. Não é necessário que a definição da função esteja textualmente incluída na definição da classe: atribuir um objeto de função a uma variável local na classe também é aceitável. Por exemplo:
ru: Любой объект функции, являющийся атрибутом класса, определяет метод для экземпляров этого класса. Не обязательно, чтобы определение функции явно находилось внутри определения класса: можно присвоить объект функции локальной переменной в классе. Например::

source: # Function defined outside the class def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'hello world' h = g
pt_pt: # Função definida fora da classe def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'olá mundo' h = g
ru: # Функция определена вне класса def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'привет мир' h = g

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`!C` that refer to function objects, and consequently they are all methods of instances of :class:`!C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
fa: اکنون ``f``، ``g`` و ``h`` همگی خصوصیاتی از کلاس :class:`!C` هستند که به اشیاء تابع اشاره دارند و به تبع آن، همگی متدهای نمونه های :class:`!C` هستند --- ``h`` دقیقاً معادل ``g`` است. توجه داشته باشید که این رویکرد معمولاً تنها باعث سردرگمی خواننده یک برنامه می شود.
pt_pt: Agoras ``f``, ``g`` e ``h`` são todos atributos da classe :class:`!C` que referenciam objetos de função, e consequentemente são todos métodos de instâncias de :class:`!C` — ``h`` sendo exatamente equivalente a ``g``. Note que esta prática geralmente só serve para confundir o leitor de um programa.
ru: Теперь ``f``, ``g`` и ``h`` являются атрибутами класса :class:`!C`, которые ссылаются на объекты функций, и, следовательно, все они являются методами экземпляров класса :class:`!C` — ``h`` в точности эквивалентен ``g``. Обратите внимание, что такая практика обычно только сбивает с толку читателя программы.

source: Methods may call other methods by using method attributes of the ``self`` argument::
fa: متدها می توانند با استفاده از ویژگی های متد آرگومان ``self``، متدهای دیگر را فراخوانی کنند:
hu: Az osztályon belüli metódusok egymást is hívhatják a ``self`` argumentum használatával::
pt_pt: Os métodos podem chamar outros métodos usando atributos de método do argumento ``self``:
ru: Методы могут вызывать другие методы с помощью аргумента ``self``::

source: class Bag: def __init__(self): self.data = [] def add(self, x): self.data.append(x) def addtwice(self, x): self.add(x) self.add(x)
pt_pt: class Sacola: def __init__(self): self.dados = [] def adicionar(self, x): self.dados.append(x) def adicionar_dois(self, x): self.adicionar(x) self.adicionar(x)

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
fa: متدها می توانند به همان شکلی که توابع عادی به نام های عمومی ارجاع می دهند، به نام های عمومی دسترسی داشته باشند. دامنه عمومی مرتبط با یک متد، ماژولی است که تعریف آن را در بر می گیرد. (یک کلاس هرگز به عنوان یک دامنه عمومی استفاده نمی شود.) در حالی که به ندرت دلایل خوبی برای استفاده از داده های عمومی در یک متد دیده می شود، استفاده زیادی از دامنه عمومی وجود دارد: برای مثال، توابع و ماژول هایی که به دامنه عمومی وارد شده اند، می توانند توسط متدها و همچنین توابع و کلاس هایی که در آن تعریف شده اند، استفاده شوند. به طور معمول، کلاسی که حاوی متد است، به خودی خود در این دامنه عمومی تعریف می شود و در بخش بعدی به دلایل خوبی خواهیم پرداخت که چرا یک متد ممکن است بخواهد به کلاس خودش ارجاع دهد.
hu: A metódusok a globális névtérben lévő függvényekre is hasonlóképp hivatkozhatnak. (Maguk az osztálydefiníciók soha nem részei a globális névtérnek!) Míg egy kivételes esetben a globális névtér változóinak használata jól jöhet, több esetben is jól jöhet a globális névtér elérése: a globális névtérbe importált függvényeket és modulokat az adott osztálymetódusból is használhatjuk, mintha az adott függvényben vagy osztályban definiálták volna azokat. Rendszerint az osztály az önmaga által definiált metódust a globális névtérben tartja, és a következő részben meglátjuk majd, miért jó ha a metódusok a saját osztályukra hivatkozhatnak!
pt_pt: Os métodos podem referenciar nomes globais da mesma forma que as funções comuns. O âmbito global associado a um método é o módulo que contém a sua definição. (Uma classe nunca é usada como um âmbito global.) Embora raramente se encontre uma boa razão para usar dados globais num método, existem muitos usos legítimos do âmbito global: por exemplo, funções e módulos importados para o âmbito global podem ser usados por métodos, bem como funções e classes definidas nele. Normalmente, a classe que contém o método é ela própria definida neste âmbito global, e na próxima secção encontraremos algumas boas razões pelas quais um método pode querer referenciar a sua própria classe.
ru: Методы могут ссылаться на глобальные имена так же, как обычные функции. Глобальная область видимости метода — это модуль, в котором он определён. (Класс никогда не используется как глобальная область видимости.) Хотя поводы использовать глобальные данные внутри метода встречаются редко, сама глобальная область видимости нередко бывает полезна. Например, методы могут обращаться к функциям и модулям, импортированным на уровне модуля, а также к функциям и классам, определённым в нём. Обычно класс, содержащий метод, сам определяется в глобальной области видимости, и в следующем разделе мы рассмотрим причины, по которым метод может захотеть ссылаться на свой класс.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
fa: هر مقدار یک شیء است، و بنابراین دارای *class* (که همچنین به عنوان *type* نامیده می شود) است. این به صورت ``object.__class__`` ذخیره می شود.
pt_pt: Cada valor é um objeto e, portanto, tem uma *classe* (também chamada de *tipo*). Está armazenado como ``object.__class__``.
ru: Любое значение в Python --- это объект, а значит относится к какому-то *классу* (который также называется его *типом*). Он хранится как ``object.__class__``.

source: Inheritance
fa: وراثت
hu: Öröklés
pt_pt: Herança
ru: Наследование

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
fa: البته، یک ویژگی زبانی بدون پشتیبانی از ارث بری شایسته ی نام "کلاس" نخواهد بود. نحو تعریف یک کلاس مشتق به این شکل است::
hu: Természetesen az öröklés támogatása nélkül nem sok értelme lenne az osztályok használatának. A származtatott osztályok definíciója a következőképpen néz ki::
pt_pt: Claro, uma funcionalidade de linguagem não seria digna do nome "classe" sem suportar herança. A sintaxe para uma definição de classe derivada é assim:
ru: Разумеется, механизм языка программирования не достоин называться «классами», без поддержки наследования. Синтаксис определения производного класса выглядит так:

source: class DerivedClassName(BaseClassName): <statement-1> . . . <statement-N>
fa: کلاس DerivedClassName(BaseClassName): <statement-1> . . . <statement-N>
pt_pt: class NomeClasseDerivada(NomeClasseBase): <instrução-1> . . . <instrução-N>

source: The name :class:`!BaseClassName` must be defined in a namespace accessible from the scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
fa: نام :class:`!BaseClassName` باید در یک فضای نام که از حوزه ای که تعریف کلاس مشتق شده است قابل دسترسی باشد، تعریف شود. به جای نام یک کلاس پایه، تعابیر دلخواه دیگر نیز مجاز هستند. این ویژگی می تواند برای مثال، زمانی که کلاس پایه در یک ماژول دیگر تعریف شده است، مفید باشد:
pt_pt: O nome :class:`!NomeClasseBase` deve ser definido num espaço de nomes acessível a partir do âmbito que contém a definição da classe derivada. Em vez de um nome de classe base, também são permitidas outras expressões arbitrárias. Isto pode ser útil, por exemplo, quando a classe base é definida noutro módulo:
ru: Имя :class:`!BaseClassName` должно быть определено в пространстве имён, доступном из области, содержащей определение производного класса. Вместо имени базового класса допускаются также другие произвольные выражения. Это может быть полезно, например, когда базовый класс определён в другом модуле:

source: class DerivedClassName(modname.BaseClassName):
fa: کلاس DerivedClassName(modname.BaseClassName):
pt_pt: class NomeClasseDerivada(modname.NomeClasseBase):

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
fa: اجرای تعریف یک کلاس مشتق شده به همان صورتی که برای یک کلاس پایه انجام می شود، پیش می رود. وقتی شیء کلاس ساخته می شود، کلاس پایه به خاطر سپرده می شود. این برای حل مرجع های ویژگی استفاده می شود: اگر یک ویژگی درخواست شده در کلاس پیدا نشود، جستجو به کلاس پایه ادامه می یابد. این قاعده به صورت بازگشتی اعمال می شود اگر کلاس پایه خود از کلاس دیگری مشتق شده باشد.
hu: A származtatott osztály definíciójának feldolgozása hasonló a szülőosztályokéhoz. Az osztályobjektum a létrehozásakor megjegyzi a szülőosztályt. Ezt használjuk arra, hogy feloldjuk a jellemzőkre történő hivatkozásokat: ha a keresett jellemző nincs jelen az osztályban, a keresés a szülőosztályban folytatódik. Ez a szabályt alkalmazza a Python rekurzívan, hogyha a szülőosztály maga is származtatott osztálya egy másik osztálynak.
pt_pt: A execução de uma definição de classe derivada processa-se da mesma forma que para uma classe base. Quando o objeto de classe é construído, a classe base é lembrada. Isto é usado para resolver referências de atributos: se um atributo solicitado não for encontrado na classe, a pesquisa prossegue para procurar na classe base. Esta regra é aplicada recursivamente se a classe base for ela própria derivada de alguma outra classe.
ru: Определение дочернего класса выполняется так же, как и определение класса без родителей. Когда объект класса создаётся, он запоминает своего родителя. Это будет использоваться для разрешения ссылок на атрибуты: если запрашиваемый атрибут не найден в классе, его поиск продолжится у родителя. Это правило применяется рекурсивно, если базовый класс сам является производным.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
fa: چیزی خاصی درباره ایجاد نمونه از کلاس های مشتق شده وجود ندارد: ``DerivedClassName()`` یک نمونه جدید از کلاس را ایجاد می کند. به روش های ارجاع به این صورت پرداخته می شود: ویژگی کلاس متناظر جستجو می شود، و در صورت لزوم به سمت پایین زنجیره کلاس های پایه حرکت کرده و اگر این جستجو یک شیء تابع را برگرداند، ارجاع به روش معتبر است.
hu: A származtatott osztályok példányosításában nincs semmi különleges: ``SzarmaztatottOsztalyNeve()`` létrehozza az osztály új példányát. A metódus-hivatkozások feloldása a következőképpen történik: a megfelelő osztály jellemzőjét keresi meg, ha szükséges végigkutatva a szülőosztályok láncát, és ha a talált jellemző egy függvény, akkor a metódus-hivatkozás érvényes.
pt_pt: Não há nada de especial na instanciação de classes derivadas: ``NomeClasseDerivada()`` cria uma nova instância da classe. As referências de métodos são resolvidas da seguinte forma: o atributo de classe correspondente é pesquisado, descendo pela cadeia de classes base se necessário, e a referência do método é válida se isto produzir um objeto de função.
ru: В создании экземпляров производных классов нет ничего особенного: ``DerivedClassName()`` создаёт новый экземпляр класса. Ссылки на методы разрешаются следующим образом: выполняется поиск соответствующего атрибута класса, при необходимости спускаясь вниз по цепочке базовых классов. Ссылка считается корректной, если найденный атрибут оказывается функцией.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
fa: کلاس های مشتق شده ممکن است متدهای کلاس های پایه خود را بازنویسی کنند. از آنجایی که متدها هنگام فراخوانی سایر متدهای همان شیء هیچ امتیاز ویژه ای ندارند، یک متد از کلاس پایه که متد دیگری را که در همان کلاس پایه تعریف شده فراخوانی می کند ممکن است در نهایت متدی از یک کلاس مشتق شده را که آن را بازنویسی کرده است، فراخوانی کند. (برای برنامه نویسان C++: تمام متدها در پایتون به طور مؤثر ``virtual`` هستند.)
hu: A származtatott osztályok felülírhatják a szülőosztályok metódusait. Mivel a metódusoknak nincsenek különleges előjogaik, amikor ugyanannak az objektumnak más metódusát hívják, ezért a szülőosztályban definiált egyik metódus, amely egy szintén a szülőosztályban definiált másik metódust hívná eredetileg, lehet, hogy a származtatott osztály által felülírt metódust fogja meghívni. (C++ programozóknak: a Pythonban lényegében minden metódus ``virtual``.)
pt_pt: As classes derivadas podem substituir métodos das suas classes base. Como os métodos não têm privilégios especiais ao chamar outros métodos do mesmo objeto, um método de uma classe base que chama outro método definido na mesma classe base pode acabar por chamar um método de uma classe derivada que o substitui. (Para programadores de C++: todos os métodos em Python são efetivamente ``virtuais``.)
ru: Производные классы могут переопределять методы своих базовых классов. Поскольку методы не имеют специальных привилегий при вызове других методов того же объекта, метод базового класса, который вызывает другой метод, определённый в том же базовом классе, может в конечном итоге вызвать метод производного класса, который переопределяет его. (Для программистов C++: все методы Python фактически являются ``virtual``.)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
fa: در یک کلاس مشتق شده، یک متد جایگزین می تواند بخواهد به جای اینکه صرفاً متد کلاس پایه با همان نام را جایگزین کند، آن را گسترش دهد. یک راه ساده برای فراخوانی مستقیم متد کلاس پایه وجود دارد: فقط ``BaseClassName.methodname(self, arguments)`` را فراخوانی کنید. این روش گاهی برای کاربران نیز مفید است. (توجه داشته باشید که این تنها زمانی کار می کند که کلاس پایه به عنوان ``BaseClassName`` در حوزهٔ جهانی در دسترس باشد.)
hu: A származtatott osztály metódusa, amely felülírja a szülőosztály egy metódusát, valójában inkább kiterjeszti az eredeti metódust, és nem egyszerűen csak kicseréli. A szülőosztály metódusára így hivatkozhatunk: ``SzuloOsztalyNev.metodusnev(self, argumentumok)``. Ez néha jól jöhet. (Fontos, hogy ez csak akkor működik, ha a szülőosztály a globális névtérben lett létrehozva, vagy közvetlenül beimportálva.)
pt_pt: Um método de substituição numa classe derivada pode, de facto, querer estender em vez de simplesmente substituir o método da classe base com o mesmo nome. Existe uma forma simples de chamar diretamente o método da classe base: basta chamar ``NomeClasseBase.nome_método(self, argumentos)``. Isto é ocasionalmente útil para clientes também. (Note que isto só funciona se a classe base for acessível como ``NomeClasseBase`` no âmbito global.)
ru: На самом деле переопределённый метод в производном классе может расширять, а не просто заменять одноименный метод базового класса. Есть простой способ вызвать метод базового класса напрямую: просто вызовите ``BaseClassName.methodname(self, arguments)``. Иногда это бывает полезно и для клиентов. (Обратите внимание, что это работает только в том случае, если базовый класс доступен как ``BaseClassName`` в глобальной области видимости.)

source: Python has two built-in functions that work with inheritance:
fa: پایتون دو تابع داخلی دارد که با ارث بری کار می کنند:
pt_pt: O Python tem duas funções incorporadas que funcionam com herança:
ru: Python имеет две встроенные функции, которые работают с наследованием:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
fa: از :func:`isinstance` برای بررسی نوع یک نمونه استفاده کنید: ``isinstance(obj, int)`` فقط زمانی ``True`` خواهد بود که ``obj.__class__`` برابر با :class:`int` یا کلاسی که از :class:`int` مشتق شده است باشد.
pt_pt: Use :func:`isinstance` para verificar o tipo de uma instância: ``isinstance(obj, int)`` será ``True`` apenas se ``obj.__class__`` for :class:`int` ou alguma classe derivada de :class:`int`.
ru: Используйте :func:`isinstance` для проверки типа экземпляра: ``isinstance(obj, int)`` будет ``True``, только если ``obj.__class__`` имеет значение :class:`int` или какой-либо производный от :class:`int` класс.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
fa: از :func:`issubclass` برای بررسی وراثت کلاس ها استفاده کنید: ``issubclass(bool, int)`` از ``True`` است چونکه :class:`bool` یک زیرکلاس از :class:`int` است. با این حال، ``issubclass(float, int)`` از ``False`` نیست چونکه :class:`float` یک زیرکلاس از :class:`int` نیست.
pt_pt: Use :func:`issubclass` para verificar a herança de classe: ``issubclass(bool, int)`` é ``True`` já que :class:`bool` é uma subclasse de :class:`int`. No entanto, ``issubclass(float, int)`` é ``False`` já que :class:`float` não é uma subclasse de :class:`int`.
ru: Используйте :func:`issubclass` для проверки наследования классов: ``issubclass(bool, int)`` имеет значение ``True``, поскольку :class:`bool` является подклассом :class:`int`. Однако ``issubclass(float, int)`` имеет значение ``False``, поскольку :class:`float` не является подклассом :class:`int`.

source: Multiple Inheritance
fa: وراثت چندگانه
hu: Többszörös öröklés
pt_pt: Herança múltipla
ru: Множественное наследование

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
fa: پایتون از نوعی از وراثت چندگانه نیز پشتیبانی می کند. تعریف یک کلاس با چندین کلاس پایه به این شکل است::
hu: A Python támogatja a többszörös öröklést egy formáját is. Egy több szülőosztályból származtatott osztály definíciója a következőképp néz ki::
pt_pt: O Python também suporta uma forma de herança múltipla. Uma definição de classe com múltiplas classes base é assim:
ru: Python также поддерживает форму множественного наследования. Определение класса с несколькими базовыми классами выглядит следующим образом:

source: class DerivedClassName(Base1, Base2, Base3): <statement-1> . . . <statement-N>
fa: کلاس DerivedClassName(Base1, Base2, Base3): <statement-1> . . . <statement-N>
pt_pt: class NomeClasseDerivada(Base1, Base2, Base3): <instrução-1> . . . <instrução-N>

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`!DerivedClassName`, it is searched for in :class:`!Base1`, then (recursively) in the base classes of :class:`!Base1`, and if it was not found there, it was searched for in :class:`!Base2`, and so on.
fa: برای بیشتر مقاصد، در ساده ترین موارد، می توانید جستجوی ویژگی های به ارث برده شده از یک کلاس والد را به صورت عمق اول، از چپ به راست در نظر بگیرید، به طوری که در جایی که در سلسله مراتب هم پوشانی وجود دارد، در یک کلاس دوبار جستجو نشود. بنابراین، اگر یک ویژگی در :class:`!DerivedClassName` پیدا نشد، در :class:`!Base1` جستجو می شود، سپس (به صورت بازگشتی) در کلاس های پایه :class:`!Base1` جستجو می شود، و اگر در آنجا یافت نشد، در :class:`!Base2` جستجو می شود، و به همین ترتیب ادامه دارد.
pt_pt: Para a maioria dos propósitos, nos casos mais simples, pode pensar na pesquisa de atributos herdados de uma classe pai como sendo em profundidade, da esquerda para a direita, não pesquisando duas vezes na mesma classe onde há uma sobreposição na hierarquia. Assim, se um atributo não for encontrado em :class:`!NomeClasseDerivada`, ele é pesquisado em :class:`!Base1`, depois (recursivamente) nas classes base de :class:`!Base1`, e se não for encontrado lá, é pesquisado em :class:`!Base2`, e assim por diante.
ru: В большинстве случаев, в простых примерах, можно считать, что поиск атрибутов, унаследованных от родительских классов, выполняется в глубину слева направо, при этом один и тот же класс не проверяется дважды, если есть перекрытие в иерархии. Таким образом, если атрибут не найден в :class:`!DerivedClassName`, он ищется в :class:`!Base1`, затем (рекурсивно) в базовых классах :class:`!Base1`, и если он там не был найден, поиск продолжается в :class:`!Base2` и так далее.
