Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, hu, pt_pt, ru

source: Classes provide a means of bundling data and functionality together. Creating a new class creates a new *type* of object, allowing new *instances* of that type to be made. Each class instance can have attributes attached to it for maintaining its state. Class instances can also have methods (defined by its class) for modifying its state.
fa: کلاس ها وسیله ای را برای بسته بندی کردن داده و عملکرد با هم فراهم می کنند. ایجاد یک کلاس جدید، نوع جدیدی ایجاد می کند که اجازه می دهد موارد جدیدی از آن نوع ساخته شود. هر نمونه از کلاس می تواند صفاتی داشته باشد که به آن متصل شده اند تا وضعیت آن را حفظ کنند. نمونه های کلاس می توانند همچنین متدهایی (که توسط کلاس تعریف شده اند) داشته باشند تا وضعیت آن را تغییر دهند.
pt_pt: As classes fornecem uma forma de agrupar dados e funcionalidade. Criar uma nova classe cria um novo *tipo* de objeto, permitindo a criação de novas *instâncias* desse tipo. Cada instância de classe pode ter atributos associados para manter o seu estado. As instâncias de classe também podem ter métodos (definidos pela sua classe) para modificar o seu estado.
ru: Классы предоставляют средства для объединения данных с функциональностью. При создании нового класса создается новый *тип* объекта, что позволяет создавать новые *экземпляры* этого типа. Каждый экземпляр класса может иметь связанные с ним атрибуты, сохраняющие его состояние. Экземпляры класса также могут иметь методы (объявленные в классе), изменяющие его состояние.

source: Compared with other programming languages, Python's class mechanism adds classes with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. Python classes provide all the standard features of Object Oriented Programming: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain arbitrary amounts and kinds of data. As is true for modules, classes partake of the dynamic nature of Python: they are created at runtime, and can be modified further after creation.
fa: در مقایسه با دیگر زبان های برنامه نویسی، مکانیزم کلاس در پایتون کلاس ها را با حداقل قواعد و معناشناسی جدید اضافه می کند. این مکانیزم ترکیبی از مکانیزم های کلاسی است که در C++ و Modula-3 یافت می شود. کلاس های پایتون تمام ویژگی های استاندارد برنامه نویسی شی گرا را فراهم می کنند: مکانیزم ارث بری کلاس ها اجازه می دهد کلاس های پایه متعددی داشته باشید، یک کلاس مشتق می تواند هر یک از متدهای کلاس های پایه خود را بازنویسی کند و یک متد می تواند متدی از کلاس پایه با همان نام را فراخوانی کند. اشیاء می توانند حاوی مقادیر و انواع داده ای دلخواه باشند. همان طور که برای ماژول ها صادق است، کلاس ها نیز از طبیعت پویا در پایتون برخوردارند: آن ها در زمان اجرا ایجاد می شوند و می توانند پس از ایجاد بیشتر تغییر داده شوند.
hu: Más nyelvekhez viszonyítva a Python osztálymechanizmusa a nyelvhez a lehető legkevesebb új szintaxissal és szemantikával ad hozzá osztályokat. A Python osztályok a C++--ban és a Modula-3--ban található osztálymechanizmusok keveréke. A Python osztályok rendelkeznek az objektumorientáltság minden jellemzőjével: az öröklődési mechanizmus lehetővé teszi a több őstől való származtatást; a származtatott osztályok a szülők bármely metódusát felül tudják írni; a metódusok ugyanazon a néven érhetik el a szülőosztály metódusait. Az objektumok tetszőleges számú és típusú adatot tartalmazhatnak. Ahogy a modulok, úgy az osztályok is részt vesznek a Python dinamikus természetében: futás közben létrehozhatóak, és tovább módosíthatóak létrehozásuk után.
pt_pt: Comparando com outras linguagens de programação, o mecanismo de classes do Python adiciona classes com um mínimo de nova sintaxe e semântica. É uma mistura dos mecanismos de classes encontrados em C++ e Modula-3. As classes Python fornecem todas as funcionalidades padrão da Programação Orientada a Objetos: o mecanismo de herança de classes permite múltiplas classes base, uma classe derivada pode substituir quaisquer métodos da sua classe base, e um método pode chamar o método de uma classe base com o mesmo nome. Os objetos podem conter quantidades e tipos arbitrários de dados. Tal como acontece com os módulos, as classes partilham da natureza dinâmica do Python: são criadas em tempo de execução e podem ser modificadas posteriormente.
ru: По сравнению с другими языками программирования, механизм классов в Python добавляет классы с минимумом нового синтаксиса и семантики. Это смесь механизмов классов из C++ и Modula-3. Классы в Python предоставляют полный набор стандартных возможностей Объектно-Ориентированного Программирования: механизм наследования поддерживает множественные базовые классы, производные классы могут переопределять любые методы своего базового класса или классов, и методы могут вызывать методы базовых классов с такими же именами. Объекты могут содержать данные произвольного объема и вида. Как и модули, классы обладают динамической природой Python: они создаются во время выполнения и могут быть изменены позже после создания.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
fa: در اصطلاحات C++، معمولاً اعضای کلاس (از جمله اعضای داده) *public* هستند (به جز موردی که در پایین :ref:`tut-private` ذکر شده است)، و تمامی توابع عضو مجازی هستند. همان طور که در Modula-3، هیچ میانبرهایی برای ارجاع به اعضای شیء از متدهای آن وجود ندارد: تابع متد با یک آرگومان اول صریح که نمایانگر شیء است، اعلام می شود که این آرگومان به صورت ضمنی توسط فراخوانی فراهم می شود. همان طور که در Smalltalk، خود کلاس ها اشیاء هستند. این ویژگی معناشناسی برای وارد کردن و تغییر نام را فراهم می آورد. برخلاف C++ و Modula-3، نوع های داخلی می توانند به عنوان کلاس های پایه برای توسعه توسط کاربر استفاده شوند. همچنین، مانند C++، بیشتر عملگرهای داخلی با نحوی خاص (عملگرهای ریاضی، زیرنویسی و غیره) می توانند برای نمونه های کلاس بازتعریف شوند.
hu: C++ szóhasználattal élve az osztály minden eleme (beleértve az adattagokat is) *publikus* (a kívételt lásd lejjebb :ref:`tut-private`), és minden tagfüggvény *virtuális*. A Modula-3--hoz hasonlóan nincsen rövidített hivatkozás az objektum alkotóelemeire annak metódusaiból: az objektum függvényeinek deklarálásakor első argumentumként az objektumot jelképező változót adjuk meg, mely híváskor automatikusan átadásra kerül. A Smalltalk-hoz hasonlóan az osztályok önmaguk is objektumok. Ez teremt szemantikát az importáláshoz és átnevezéshez. A C++--tól és a Modula-3-tól eltérően a beépített típusok szülőosztályokként felhasználhatók. S végül a C++-hoz hasonlóan legtöbb, egyéni szintaktikával bíró beépített operátor (aritmetikai műveletek, indexelés stb.) újradefiniálhatók az osztály példányaiban.
pt_pt: Em terminologia C++, os membros de classe (incluindo os membros de dados) são normalmente *públicos* (exceto conforme descrito em :ref:`tut-private`), e todas as funções membro são *virtuais*. Tal como em Modula-3, não existem atalhos para referenciar os membros do objeto a partir dos seus métodos: a função do método é declarada com um primeiro argumento explícito que representa o objeto, fornecido implicitamente pela chamada. Tal como em Smalltalk, as classes em si são objetos. Isto fornece semântica para importação e renomeação. Ao contrário de C++ e Modula-3, os tipos incorporados podem ser usados como classes base para extensão pelo utilizador. Além disso, tal como em C++, a maioria dos operadores incorporados com sintaxe especial (operadores aritméticos, indexação, etc.) podem ser redefinidos para instâncias de classe.
ru: В терминологии C++, обычно члены класса (включая данные) являются *публичными* (об исключениях читайте ниже :ref:`tut-private`), а все функции-члены — *виртуальными*. Как и в Modula-3, здесь нет сокращений для доступа к элементам объекта из его методов: функция-метод объявляется с явным первым аргументом, представляющим объект, который неявно подставляется при вызове. Как и в Smalltalk, сами классы являются объектами. Это обеспечивает семантику импорта и переименования. В отличие от C++ и Modula-3, встроенные типы могут использоваться как базовые классы для расширения пользователем. Так же, как и в C++, большинство встроенных операторов со специальным синтаксисом (арифметические операторы, индексирование и т. д.) могут быть переопределены для экземпляров класса.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
fa: (با نبود اصطلاحات پذیرفته شده جهانی برای صحبت درباره کلاس‌ها، گاهی از اصطلاحات Smalltalk و C++ استفاده خواهم کرد. من از اصطلاحات Modula-3 استفاده می‌کردم، چون معنای شیءگرای آن به پایتون نزدیک‌تر از C++ است، اما انتظار دارم که تعداد کمی از خوانندگان با آن آشنا باشند.)
hu: (Nem lévén általánosan elfogadott szóhasználat az osztályok témakörére, alkalmanként Smalltalk és C++ kifejezéseket fogok használni. (Szerettem volna Modula-3 kifejezéseket alkalmazni, mert annak jobban hasonlít az objektum-orientáció-szemlélete a Pythonhoz, mint a C++-é, de sejtésem szerint kevés olvasó hallott erről a nyelvről.)
pt_pt: (Faltando uma terminologia universalmente aceite para falar sobre classes, farei uso ocasional de termos de Smalltalk e C++. Usaria termos de Modula-3, já que a sua semântica orientada a objetos é mais próxima da do Python do que a do C++, mas espero que poucos leitores tenham ouvido falar dela.)
ru: (Не имея общепринятой терминологии, чтобы говорить о классах, я буду время от времени использовать термины Smalltalk и C++. Я бы использовал терминологию Modula-3, поскольку его объектно-ориентированная семантика ближе к Python, чем C++, но я думаю, что мало читателей знакомы с этим языком.)

source: A Word About Names and Objects
fa: سخنی درباره نام‌ها و اشیاء
hu: Pár szó a nevekről és objektumokról
pt_pt: Uma palavra sobre nomes e objetos
ru: Несколько слов об именах и объектах

source: Objects have individuality, and multiple names (in multiple scopes) can be bound to the same object. This is known as aliasing in other languages. This is usually not appreciated on a first glance at Python, and can be safely ignored when dealing with immutable basic types (numbers, strings, tuples). However, aliasing has a possibly surprising effect on the semantics of Python code involving mutable objects such as lists, dictionaries, and most other types. This is usually used to the benefit of the program, since aliases behave like pointers in some respects. For example, passing an object is cheap since only a pointer is passed by the implementation; and if a function modifies an object passed as an argument, the caller will see the change --- this eliminates the need for two different argument passing mechanisms as in Pascal.
fa: شیء‌ها هویت دارند و چندین نام (در چندین حوزه دید) می‌توانند به یک شیء واحد متصل شوند. این در زبان‌های دیگر به «تخصیص نام مستعار» «aliasing» معروف است. این موضوع معمولاً در اولین نگاه به پایتون قابل درک نیست و هنگام کار با انواع پایه غیرقابل تغییر (مثل اعداد، رشته‌ها، تاپل‌ها) می‌توان آن را نادیده گرفت. اما تخصیص نام مستعار می‌تواند تأثیر قابل توجهی روی معنای کد پایتون داشته باشد، به ویژه وقتی با اشیاء قابل تغییر مثل لیست‌ها، دیکشنری‌ها و بیشتر انواع دیگر سر و کار داریم. این ویژگی معمولاً به نفع برنامه است، زیرا نام‌های مستعار در برخی موارد مانند اشاره‌گرها رفتار می‌کنند. برای مثال، ارسال یک شیء کم‌هزینه است چون فقط یک اشاره‌گر توسط پیاده‌سازی ارسال می‌شود؛ و اگر تابعی شیء ارسال‌شده را تغییر دهد، فراخواننده این تغییر را خواهد دید — این ویژگی باعث می‌شود نیازی به دو مکانیزم مختلف برای ارسال آرگومان همانند پاسکال نباشد.
hu: Az objektumoknak egyéni jellege van, és több nevet lehet kapcsolni ugyanahhoz az objektumhoz (akár különböző névterekben). Ez a lehetőség fedőnévhasználatként (aliasing) ismert más nyelvekben. Ezt a lehetőséget a nyelvvel való első találkozáskor rendszerint nem becsülik meg, és nyugodtan mellőzhető megváltoztathatatlan típusok használatakor (például számok, karakterláncok, tuple-ok esetében). Valójában a fedőnév használata valószínűleg meglepő módon viselkedik megváltoztatható típusok esetében, mint például a listák, szótárak, és a legtöbb más típus esetén. A fedőnevek általában a program hasznára válnak, mivel a mutatókhoz hasonlítanak néhány vonatkozásban. Például egy objektum átadása kevés erőforrásfelhasználással jár, mivel ilyenkor csak egy mutató fog mutatni az objektumra. Ha a meghívott függvény módosítja a neki átadott objektumot, a hívó látja a változást -- ez szükségtelenné teszi két különböző argumentumátadási módszer használatát, mint amilyen a Pascalnál van.
pt_pt: Os objetos têm individualidade, e vários nomes (em vários âmbitos) podem estar associados ao mesmo objeto. Isto é conhecido como *alias* noutras linguagens. Isto geralmente não é apreciado à primeira vista no Python, e pode ser ignorado com segurança ao lidar com tipos básicos imutáveis (números, strings, tuplos). No entanto, o *alias* tem um efeito possivelmente surpreendente na semântica do código Python que envolve objetos mutáveis, como listas, dicionários e a maioria dos outros tipos. Isto é geralmente usado em benefício do programa, já que os *aliases* comportam-se como ponteiros em alguns aspetos. Por exemplo, passar um objeto é económico, pois apenas um ponteiro é passado pela implementação; e se uma função modificar um objeto passado como argumento, o chamador verá a alteração — isto elimina a necessidade de dois mecanismos diferentes de passagem de argumentos, como em Pascal.
ru: Объекты имеют индивидуальность, и множество имен (в разных областях видимости) могут быть связаны с одним объектом. В других языках это называется псевдонимами. Обычно это не принимается во внимание при первом знакомстве с Python, и это можно спокойно игнорировать при работе с неизменяемыми основными типами (числами, строками, кортежами). Однако псевдонимы могут иметь неожиданный эффект на семантику кода Python, включающего изменяемые объекты, такие как списки, словари и большинство других типов. Обычно это используется на пользу программы, поскольку псевдонимы в некоторых отношениях ведут себя как указатели. Например, передача объекта в функцию дешёвая, поскольку реализация передаёт только указатель на него. Если функция изменяет объект, переданный ей в качестве аргумента, вызывающий код увидит это изменение — это устраняет необходимость в двух различных механизмах передачи аргументов, как в Pascal.

source: Python Scopes and Namespaces
fa: محدوده ها و فضای نام ها در پایتون
hu: Hatókörök és névterek a Pythonban
pt_pt: Âmbitos e espaços de nomes do Python
ru: Области видимости и пространства имён в Python

source: Before introducing classes, I first have to tell you something about Python's scope rules. Class definitions play some neat tricks with namespaces, and you need to know how scopes and namespaces work to fully understand what's going on. Incidentally, knowledge about this subject is useful for any advanced Python programmer.
fa: قبل از معرفی کلاس ها، ابتدا باید چیزی درباره قوانین حوزه در پایتون به شما بگویم. تعریف کلاس ها چند ترفند جالب با فضاهای نام انجام می دهد و برای اینکه به طور کامل متوجه شوید چه می گذرد، باید بدانید که حوزه ها و فضاهای نام چگونه کار می کنند. ضمناً، آگاهی از این موضوع برای هر برنامه نویس پیشرفته پایتون مفید است.
hu: Mielőtt megismerkednénk az osztályokkal, beszélnünk kell a hatókörök Pythonbeli szabályairól. Az osztálydefiníciók néhány ügyesen trükköznek a névterekkel, és ismerned kell a névterek és hatókörök működését ahhoz, hogy teljesen átlásd, mi is történik. Egyébként ennek a témakörnek az ismerete minden haladó Python programozónak a hasznára válik.
pt_pt: Antes de introduzir classes, tenho primeiro de explicar algo sobre as regras de âmbito do Python. As definições de classe usam alguns truques interessantes com espaços de nomes, e é necessário saber como funcionam os âmbitos e os espaços de nomes para compreender plenamente o que se passa. Aliás, o conhecimento sobre este assunto é útil para qualquer programador avançado de Python.
ru: Прежде чем представить классы, я должен сначала рассказать кое-что о правилах области видимости в Python. Определения классов проделывают некоторые хитрые трюки с пространством имён, и вы должны знать, как работают области видимости и пространства имён, чтобы полностью понимать, что происходит. Кстати, эти знания полезны для любого продвинутого программиста на Python.

source: Let's begin with some definitions.
fa: بیایید با چند تعریف شروع کنیم.
hu: Kezdetnek nézzünk meg néhány definíciót.
pt_pt: Vamos começar com algumas definições.
ru: Давайте начнём с некоторых определений.

source: A *namespace* is a mapping from names to objects. Most namespaces are currently implemented as Python dictionaries, but that's normally not noticeable in any way (except for performance), and it may change in the future. Examples of namespaces are: the set of built-in names (containing functions such as :func:`abs`, and built-in exception names); the global names in a module; and the local names in a function invocation. In a sense the set of attributes of an object also form a namespace. The important thing to know about namespaces is that there is absolutely no relation between names in different namespaces; for instance, two different modules may both define a function ``maximize`` without confusion --- users of the modules must prefix it with the module name.
fa: «فضای نام» *namespace* نگاشتی است از نام‌ها به اشیا. بیشتر فضای نام‌ها در حال حاضر به‌صورت دیکشنری‌های پایتون پیاده‌سازی شده‌اند، اما معمولاً این موضوع (به جز در بازدهی «performance» ) قابل مشاهده نیست و ممکن است در آینده تغییر کند. مثال‌هایی از فضای نام عبارت‌اند از: مجموعه نام‌های داخلی (که شامل توابعی مثل :func:`abs` و نام‌های استثنائات داخلی است)؛ نام‌های سراسری در یک ماژول؛ و نام‌های محلی در یک فراخوانی تابع. به نوعی، مجموعه صفات «attributes» یک شی نیز یک فضای نام را تشکیل می‌دهد. نکته مهم درباره فضای نام‌ها این است که هیچ ارتباطی بین نام‌ها در فضای نام‌های مختلف وجود ندارد؛ برای مثال، دو ماژول مختلف می‌توانند هر دو تابعی با نام ``maximize`` تعریف کنند بدون اینکه ابهامی پیش بیاید — استفاده‌کنندگان از ماژول‌ها باید نام ماژول را به عنوان پیشوند بیاورند.
hu: A *névtér* a nevekhez objektumokat rendel. A legtöbb névtér jelenleg Python szótárakként van megvalósítva, de ez (a teljesítmény kivételével) normális esetben nem észlelhető, és ez a jövőben változhat. Példák a névterekre: a beápített nevek listája (például az :func:`abs` függvény, vagy a beépített kivételek nevei); a modulokban jelenlévő globális nevek; vagy a helyi nevek függvényhívások során. Bizonyos értelemben egy objektum jellemzői is külön névteret alkotnak. Fontos tudni, hogy különböző névterekben lévő két név között semmilyen kapcsolat nem létezik. Például ha két különböző modul egyaránt definiálhat egy "maximumalizal" nevű függvényt bármilyen keveredés nélkül, mert a modulok használóinak a függvénynév előtagjában a modul nevével egyértelműen jelezniük kell, hogy pontosan melyik függvényt fogják használni.
pt_pt: Um *espaço de nomes* é um mapeamento de nomes para objetos. A maioria dos espaços de nomes são atualmente implementados como dicionários Python, mas isso normalmente não é notável de qualquer forma (exceto em termos de desempenho), e pode mudar no futuro. Exemplos de espaços de nomes são: o conjunto de nomes incorporados (contendo funções como :func:`abs`, e nomes de exceções incorporadas); os nomes globais num módulo; e os nomes locais numa invocação de função. Num certo sentido, o conjunto de atributos de um objeto também forma um espaço de nomes. A coisa importante a saber sobre espaços de nomes é que não existe qualquer relação entre nomes em diferentes espaços de nomes; por exemplo, dois módulos diferentes podem ambos definir uma função ``maximize`` sem confusão — os utilizadores dos módulos devem prefixá-la com o nome do módulo.
ru: *Пространство имен* — это отображение имён на объекты. Большинство пространств имён в настоящее время реализованы как словари Python, но обычно это незаметно (за исключением производительности) и может измениться в будущем. Примерами пространств имён являются: набор встроенных имён (включая функции, такие как :func:`abs`, и встроенные имена исключений); глобальные имена в модуле; локальные имена в вызове функции. В некотором смысле, набор атрибутов объекта тоже образует пространство имён. Важная деталь, которую нужно знать о пространствах имён — это то, что нет совершенно никакой связи между именами из разных пространств имён; например, в двух разных модулях может быть определена функция ``maximize`` без какой-либо путаницы — пользователи модуля должны использовать имя модуля в качестве префикса при вызове функции.
