Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/inputoutput.po
Languages: fa, pt_pt

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
fa: متد :meth:`str.rjust` در اشیاء رشته ای، یک رشته را در یک فیلد با عرض مشخص با افزودن فاصله در سمت چپ، به راست جا به جا می کند. متدهای مشابه :meth:`str.ljust` و :meth:`str.center` نیز وجود دارند. این متدها چیزی نخواهند نوشت و فقط یک رشته جدید برمی گردانند. اگر رشته ورودی بیش از حد طولانی باشد، آن را کوتاه نمی کنند و به صورت تغییر نیافته برمی گردانند؛ این ممکن است چینش ستون های شما را به هم بریزد، اما این اغلب بهتر از جایگزینی غلط است که می تواند باعث اشتباه در یک مقدار شود. (اگر به راستی به کوتاه کردن نیاز دارید, می توانید همیشه یک عملیات برش اضافه کنید, مانند ``x.ljust(n)[:n]``.)
pt_pt: O método :meth:`str.rjust` de objetos string alinha uma string à direita num campo de uma largura específica, preenchendo com espaços à esquerda. Existem métodos semelhantes :meth:`str.ljust` e :meth:`str.center`. Estes métodos não escrevem nada, apenas devolvem uma nova string. Se a string de entrada for demasiado longa, não a truncam, mas devolvem-na inalterada; isto pode desalinhar o layout da coluna, mas é geralmente melhor do que a alternativa, que seria mentir sobre um valor. (Se realmente quiser truncar, pode sempre adicionar uma operação de corte, como em ``x.ljust(n)[:n]``.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
fa: روش دیگری وجود دارد به نام :meth:`str.zfill` که یک رشته عددی را از سمت چپ با صفرها پر می کند. این روش علامت های مثبت و منفی را می فهمد::
pt_pt: Existe outro método, :meth:`str.zfill`, que preenche uma string numérica à esquerda com zeros. Este método reconhece sinais de mais e menos:

source: Old string formatting
fa: قالب بندی رشته ای قدیمی
pt_pt: Formatação antiga de strings

source: The % operator (modulo) can also be used for string formatting. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. This operation is commonly known as string interpolation. For example::
fa: عملگر % (باقی مانده) می تواند برای قالب بندی رشته ها نیز استفاده شود. با فرض یک رشته ``format % values``، مشخصات تبدیل ``%`` در *format* با یک یا چند عنصر از *values* جایگزین می شوند. این عمل به طور معمول به عنوان درج رشته شناخته می شود. به عنوان مثال::
pt_pt: O operador % (módulo) também pode ser usado para formatação de strings. Dada a expressão ``formato % valores`` (onde *formato* é uma string), as especificações de conversão ``%`` em *formato* são substituídas por zero ou mais elementos de *valores*. Esta operação é comumente conhecida como interpolação de strings. Por exemplo:

source: >>> import math >>> print('The value of pi is approximately %5.3f.' % math.pi) The value of pi is approximately 3.142.
fa: >>> import math >>> print('The value of pi is approximately %5.3f.' % math.pi) مقدار pi تقریباً برابر با 3.142 است.
pt_pt: >>> import math >>> print('O valor de pi é aproximadamente %5.3f.' % math.pi) O valor de pi é aproximadamente 3,142.

source: More information can be found in the :ref:`old-string-formatting` section.
fa: اطلاعات بیشتر را می توانید در بخش :ref:`old-string-formatting` پیدا کنید.
pt_pt: Mais informações podem ser encontradas na secção :ref:`old-string-formatting`.

source: Reading and Writing Files
fa: خواندن و نوشتن فایل ها
pt_pt: Ler e escrever ficheiros

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
fa: :func:`open` یک :term:`file object` برمی گرداند و معمولاً با دو آرگومان مکانی و یک آرگومان کلیدی استفاده می شود: ``open(filename, mode, encoding=None)``
pt_pt: A função :func:`open` devolve um :term:`objeto de ficheiro` e é mais comumente usada com dois argumentos posicionais e um argumento nomeado: ``open(nome_ficheiro, modo, codificação=None)``

source: >>> f = open('workfile', 'w', encoding="utf-8")
pt_pt: >>> f = open('ficheiro_trabalho', 'w', encoding="utf-8")

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
fa: اولین آرگومان یک رشته است که نام فایل را در بر دارد. آرگومان دوم رشته دیگری است که شامل چند کاراکتر است که نحوه استفاده از فایل را توصیف می کند. *mode* زمانی می تواند ``'r'`` باشد که فایل فقط خوانده شود، ``'w'`` برای نوشتن تنها (فایل موجود با همان نام پاک خواهد شد) و ``'a'`` فایل را برای اضافه کردن باز می کند؛ هر داده ای که به فایل نوشته شود به صورت خودکار به انتهای آن اضافه می شود. ``'r+'`` فایل را برای خواندن و نوشتن همزمان باز می کند. آرگومان *mode* اختیاری است؛ اگر حذف شود، ``'r'`` در نظر گرفته خواهد شد.
pt_pt: O primeiro argumento é uma string contendo o nome do ficheiro. O segundo argumento é outra string contendo alguns caracteres que descrevem a forma como o ficheiro será usado. *modo* pode ser ``'r'`` quando o ficheiro será apenas lido, ``'w'`` apenas para escrita (um ficheiro existente com o mesmo nome será apagado), e ``'a'`` abre o ficheiro para anexar; quaisquer dados escritos no ficheiro são automaticamente adicionados ao final. ``'r+'`` abre o ficheiro para leitura e escrita. O argumento *modo* é opcional; ``'r'`` será assumido se for omitido.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
fa: به طور معمول، فایل ها در :dfn:`حالت متنی` باز می شوند، به این معنا که شما رشته ها را از فایل می خوانید و به فایل می نویسید، که با یک *encoding* خاص کدگذاری می شوند. اگر *encoding* مشخص نشده باشد، مقدار پیش فرض وابسته به پلتفرم است (به :func:`open` مراجعه کنید). از آنجایی که UTF-8 استاندارد مدرن و رایج است، ``encoding="utf-8"`` توصیه می شود مگر اینکه بدانید که به یک کدگذاری متفاوت نیاز دارید. افزودن یک ``'b'`` به حالت، فایل را در :dfn:`حالت باینری` باز می کند. داده های حالت باینری به صورت اشیاء :class:`bytes` خوانده و نوشته می شوند. نمی توانید *encoding* را هنگام باز کردن فایل در حالت باینری مشخص کنید.
pt_pt: Normalmente, os ficheiros são abertos em :dfn:`modo de texto`, o que significa que lê e escreve strings para e do ficheiro, que são codificadas numa codificação específica. Se *codificação* não for especificada, a predefinição depende da plataforma (consulte :func:`open`). Como o UTF-8 é o padrão moderno de facto, ``encoding="utf-8"`` é recomendado, a menos que saiba que precisa de usar uma codificação diferente. Adicionar um ``'b'`` ao modo abre o ficheiro em :dfn:`modo binário`. Os dados em modo binário são lidos e escritos como objetos :class:`bytes`. Não pode especificar *codificação* ao abrir um ficheiro em modo binário.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
fa: در حالت متنی، به صورت پیش فرض هنگام خواندن، انتهای خطوط مختص به پلتفرم (``\n`` در یونیکس, ``\r\n`` در ویندوز) به سادگی به ``\n`` تبدیل می شود. هنگام نوشتن در حالت متنی، پیش فرض این است که وقوعات ``\n`` به انتهای خطوط مختص به پلتفرم تبدیل شوند. این تغییرات پشت صحنه در داده های فایل برای فایل های متنی مناسب است، اما داده های باینری مانند آنچه در فایل های :file:`JPEG` یا :file:`EXE` است را خراب می کند. دقت کنید که هنگام خواندن و نوشتن چنین فایل هایی از حالت باینری استفاده کنید.
pt_pt: Em modo de texto, a predefinição ao ler é converter terminações de linha específicas da plataforma (``\n`` no Unix, ``\r\n`` no Windows) para apenas ``\n``. Ao escrever em modo de texto, a predefinição é converter ocorrências de ``\n`` de volta para terminações de linha específicas da plataforma. Esta modificação nos bastidores dos dados do ficheiro é adequada para ficheiros de texto, mas corromperá dados binários como os de ficheiros :file:`JPEG` ou :file:`EXE`. Tenha muito cuidado para usar o modo binário ao ler e escrever tais ficheiros.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
fa: استفاده از کلیدواژه :keyword:`with` زمانی که با اشیاء فایل کار می کنید، یک روش خوب است. مزیت این کار این است که فایل بعد از تمام شدن دنباله عملیات به درستی بسته می شود، حتی اگر در جایی یک استثنا رخ دهد. استفاده از :keyword:`!with` نیز بسیار کوتاه تر از نوشتن :keyword:`try` - :keyword:`finally` بلوک های معادل است::
pt_pt: É uma boa prática usar a palavra-chave :keyword:`with` ao lidar com objetos de ficheiro. A vantagem é que o ficheiro é devidamente fechado após a conclusão do seu bloco, mesmo que seja levantada uma exceção em algum ponto. Usar :keyword:`!with` também é muito mais curto do que escrever blocos equivalentes :keyword:`try`\ -\ :keyword:`finally`:

source: >>> with open('workfile', encoding="utf-8") as f: ... read_data = f.read() >>> # We can check that the file has been automatically closed. >>> f.closed True
pt_pt: >>> with open('ficheiro_trabalho', encoding="utf-8") as f: ... dados_lidos = f.read() >>> # Podemos verificar que o ficheiro foi fechado automaticamente. >>> f.closed True

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
fa: اگر شما از کلیدواژه :keyword:`with` استفاده نمی کنید، در این صورت باید ``f.close()`` را برای بستن فایل و آزادسازی فوری هرگونه منابع سیستم مورد استفاده آن فراخوانی کنید.
pt_pt: Se não estiver a usar a palavra-chave :keyword:`with`, então deve chamar ``f.close()`` para fechar o ficheiro e libertar imediatamente quaisquer recursos do sistema usados por ele.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
fa: فراخوانی ``f.write()`` بدون استفاده از کلیدواژه :keyword:`!with` یا فراخوانی ``f.close()`` **might** منجر به این می شود که آرگومان های ``f.write()`` به طور کامل روی دیسک نوشته نشوند، حتی اگر برنامه با موفقیت خارج شود.
pt_pt: Chamar ``f.write()`` sem usar a palavra-chave :keyword:`!with` ou chamar ``f.close()`` **pode** resultar nos argumentos de ``f.write()`` não serem completamente escritos no disco, mesmo que o programa termine com sucesso.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
fa: پس از بسته شدن یک شیء فایل، چه با یک دستور :keyword:`with` و چه با فراخوانی ``f.close()``، تلاش برای استفاده از شیء فایل به طور خودکار شکست می خورد. ::
pt_pt: Depois de um objeto de ficheiro ser fechado, seja por uma instrução :keyword:`with` ou chamando ``f.close()``, as tentativas de usar o objeto de ficheiro falharão automaticamente:

source: >>> f.close() >>> f.read() Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: I/O operation on closed file.
fa: >>> f.close() >>> f.read() ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> ValueError: عملیات I/O روی فایل بسته.
pt_pt: >>> f.close() >>> f.read() Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: Operação de E/S em ficheiro fechado.

source: Methods of File Objects
fa: روش های اشیاء فایل
pt_pt: Métodos de objetos de ficheiro

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
fa: بقیه مثال های این بخش فرض می کنند که یک شی فایل با نام ``f`` از قبل ایجاد شده است.
pt_pt: Os restantes exemplos nesta secção assumirão que um objeto de ficheiro chamado ``f`` já foi criado.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
fa: برای خواندن محتوای یک فایل، ``f.read(size)`` را فراخوانی کنید، که میزانی از داده را خوانده و آن را به صورت یک رشته (در حالت متنی) یا شئ بایت (در حالت باینری) برمی گرداند. *size* یک آرگومان عددی اختیاری است. هنگامی که *size* حذف شود یا منفی باشد، تمام محتوای فایل خوانده و برگردانده می شود؛ اگر فایل دو برابر حافظه ماشین شما بزرگتر باشد، این مشکل شماست. در غیر این صورت، حداکثر *size* کاراکتر (در حالت متنی) یا *size* بایت (در حالت باینری) خوانده و برگردانده می شوند. اگر انتهای فایل رسیده باشد، ``f.read()`` یک رشته خالی (``''``) برمی گرداند. ::
pt_pt: Para ler o conteúdo de um ficheiro, chame ``f.read(tamanho)``, que lê uma certa quantidade de dados e devolve-os como uma string (em modo de texto) ou um objeto bytes (em modo binário). *tamanho* é um argumento numérico opcional. Quando *tamanho* é omitido ou negativo, todo o conteúdo do ficheiro será lido e devolvido; é problema seu se o ficheiro for duas vezes maior do que a memória da sua máquina. Caso contrário, no máximo *tamanho* caracteres (em modo de texto) ou *tamanho* bytes (em modo binário) são lidos e devolvidos. Se o final do ficheiro tiver sido atingido, ``f.read()`` devolverá uma string vazia (``''``):

source: >>> f.read() 'This is the entire file.\n' >>> f.read() ''
pt_pt: >>> f.read() 'Este é o ficheiro completo.\n' >>> f.read() ''

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
fa: ``f.readline()`` یک خط از فایل می خواند؛ یک کاراکتر خط جدید (``\n``) در انتهای رشته باقی می ماند و فقط در آخرین خط فایل نادیده گرفته می شود اگر فایل با یک خط جدید خاتمه نیافته باشد. این رفتار باعث می شود که مقدار بازگشتی مبهم نباشد؛ اگر ``f.readline()`` یک رشته خالی برگرداند، به انتهای فایل رسیده ایم، در حالی که یک خط خالی با ``'\n'`` نمایش داده می شود، رشته ای که فقط یک خط جدید دارد. ::
pt_pt: ``f.readline()`` lê uma única linha do ficheiro; um carácter de nova linha (``\n``) é deixado no final da string e só é omitido na última linha do ficheiro se o ficheiro não terminar com uma nova linha. Isto torna o valor de retorno inequívoco; se ``f.readline()`` devolver uma string vazia, o final do ficheiro foi atingido, enquanto uma linha em branco é representada por ``'\n'``, uma string contendo apenas uma nova linha:

source: >>> f.readline() 'This is the first line of the file.\n' >>> f.readline() 'Second line of the file\n' >>> f.readline() ''
pt_pt: >>> f.readline() 'Esta é a primeira linha do ficheiro.\n' >>> f.readline() 'Segunda linha do ficheiro\n' >>> f.readline() ''

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
fa: برای خواندن خطوط از یک فایل، می توانید روی شیء فایل حلقه بزنید. این روش از نظر حافظه بهینه، سریع و منجر به کد ساده می شود::
pt_pt: Para ler linhas de um ficheiro, pode iterar sobre o objeto de ficheiro. Isto é eficiente em termos de memória, rápido e resulta em código simples:

source: >>> for line in f: ... print(line, end='') ... This is the first line of the file. Second line of the file
fa: >>> for line in f: ... print(line, end='') ... این اولین خط فایل است. خط دوم فایل
pt_pt: >>> for linha in f: ... print(linha, end='') ... Esta é a primeira linha do ficheiro. Segunda linha do ficheiro

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
fa: اگر می خواهید تمام خطوط یک فایل را به صورت یک لیست بخوانید، می توانید از ``list(f)`` یا ``f.readlines()`` استفاده کنید.
pt_pt: Se quiser ler todas as linhas de um ficheiro numa lista, também pode usar ``list(f)`` ou ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
fa: ``f.write(string)`` محتوای *string* را به فایل می نویسد و تعداد کاراکترهای نوشته شده را برمی گرداند. ::
pt_pt: ``f.write(string)`` escreve o conteúdo de *string* para o ficheiro, devolvendo o número de caracteres escritos:

source: >>> f.write('This is a test\n') 15
pt_pt: >>> f.write('Isto é um teste\n') 15

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
fa: انواع دیگر اشیاء باید قبل از نوشتن -- به یک رشته متنی (در حالت متنی) یا یک شیء بایت (در حالت باینری) -- تبدیل شوند::
pt_pt: Outros tipos de objetos precisam de ser convertidos — ou para uma string (em modo de texto) ou para um objeto bytes (em modo binário) — antes de os escrever:

source: >>> value = ('the answer', 42) >>> s = str(value) # convert the tuple to string >>> f.write(s) 18
pt_pt: >>> valor = ('a resposta', 42) >>> s = str(valor) # converter o tuplo para string >>> f.write(s) 18

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
fa: ``f.tell()`` یک عدد صحیح را برمی گرداند که موقعیت فعلی شیء فایل را در فایل نشان می دهد که به صورت تعداد بایت ها از ابتدای فایل در حالت دودویی و یک عدد نامشخص در حالت متنی ارائه می شود.
pt_pt: ``f.tell()`` devolve um inteiro que indica a posição atual do objeto de ficheiro no ficheiro, representada como número de bytes a partir do início do ficheiro em modo binário e um número opaco em modo de texto.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
fa: برای تغییر موقعیت شیء فایل از ``f.seek(offset, whence)`` استفاده کنید. موقعیت از طریق اضافه کردن *offset* به یک نقطه مرجع محاسبه می شود؛ نقطه مرجع با آرگومان *whence* انتخاب می شود. مقدار *whence* برابر 0 از ابتدای فایل، 1 استفاده از موقعیت کنونی فایل، و 2 استفاده از انتهای فایل به عنوان نقطه مرجع اندازه گیری می کند. *whence* می تواند حذف شود و به طور پیش فرض 0 است که از ابتدای فایل به عنوان نقطه مرجع استفاده می کند. ::
pt_pt: Para alterar a posição do objeto de ficheiro, use ``f.seek(deslocamento, origem)``. A posição é calculada adicionando *deslocamento* a um ponto de referência; o ponto de referência é selecionado pelo argumento *origem*. Um valor *origem* de 0 mede a partir do início do ficheiro, 1 usa a posição atual do ficheiro, e 2 usa o final do ficheiro como ponto de referência. *origem* pode ser omitido e, por predefinição, é 0, usando o início do ficheiro como ponto de referência:

source: >>> f = open('workfile', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Go to the 6th byte in the file 5 >>> f.read(1) b'5' >>> f.seek(-3, 2) # Go to the 3rd byte before the end 13 >>> f.read(1) b'd'
pt_pt: >>> f = open('ficheiro_trabalho', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Ir para o 6.º byte no ficheiro 5 >>> f.read(1) b'5' >>> f.seek(-3, 2) # Ir para o 3.º byte antes do final 13 >>> f.read(1) b'd'

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
fa: در فایل های متنی (آنهایی که بدون ``b`` در رشته حالت باز می شوند), فقط جابه جایی های نسبی نسبت به ابتدای فایل مجاز هستند (استثنا جابه جایی به انتهای فایل با ``seek(0, 2)`` است) و تنها مقادیر معتبر *offset* آنهایی هستند که از ``f.tell()`` برگشت داده می شوند، یا صفر. هر مقدار *offset* دیگر رفتار نامشخصی تولید می کند.
pt_pt: Em ficheiros de texto (aqueles abertos sem um ``b`` na string de modo), apenas são permitidas pesquisas relativas ao início do ficheiro (a exceção é procurar o final do ficheiro com ``seek(0, 2)``) e os únicos valores de *deslocamento* válidos são aqueles devolvidos por ``f.tell()`` ou zero. Qualquer outro valor de *deslocamento* produz comportamento indefinido.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
fa: کائنات فایل برخی متدهای اضافی دارند، مانند :meth:`~io.IOBase.isatty` و :meth:`~io.IOBase.truncate` که کمتر مورد استفاده قرار می گیرند؛ برای گرفتن راهنمای کامل در مورد کائنات فایل به مرجع کتابخانه مراجعه کنید.
pt_pt: Os objetos de ficheiro têm alguns métodos adicionais, como :meth:`~io.IOBase.isatty` e :meth:`~io.IOBase.truncate`, que são menos frequentemente usados; consulte a Referência da Biblioteca para um guia completo sobre objetos de ficheiro.

source: Saving structured data with :mod:`json`
fa: ذخیره داده های ساختاریافته با :mod:`json`
pt_pt: Guardar dados estruturados com :mod:`json`
