Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/inputoutput.po
Languages: fa, pt_pt

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
fa: رشته ها به راحتی می توانند به فایل نوشته و از آن خوانده شوند. اعداد نیاز به تلاش بیشتری دارند، زیرا روش :meth:`~io.TextIOBase.read` تنها رشته ها را برمی گرداند، که باید به یک تابع مانند :func:`int` که یک رشته مانند ``'123'`` را می گیرد و مقدار عددی 123 را برمی گرداند، منتقل شوند. زمانی که می خواهید انواع داده ای پیچیده تر مانند فهرست های تو در تو و دیکشنری ها را ذخیره کنید، تجزیه و تحلیل و سریال سازی به صورت دستی پیچیده می شود.
pt_pt: Strings podem ser facilmente escritas e lidas de um ficheiro. Números requerem um pouco mais de esforço, uma vez que o método :meth:`~io.TextIOBase.read` apenas devolve strings, que terão de ser passadas para uma função como :func:`int`, que recebe uma string como ``'123'`` e devolve o seu valor numérico 123. Quando quer guardar tipos de dados mais complexos, como listas e dicionários aninhados, a análise e serialização manual torna-se complicada.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
fa: به جای آنکه کاربران به طور مداوم کد نویسی و رفع اشکال کنند تا انواع داده های پیچیده را در فایل ها ذخیره کنند، پایتون به شما اجازه می دهد تا از قالب تبادل داده های محبوبی به نام `JSON (JavaScript Object Notation) <https://json.org>`_ استفاده کنید. ماژول استانداردی به نام :mod:`json` می تواند سلسله مراتب داده های پایتون را گرفته و آنها را به نمایش های رشته ای تبدیل کند؛ این فرآیند :dfn:`سریال سازی` نامیده می شود. بازسازی داده ها از نمایش رشته ای :dfn:`دی سریال سازی` نامیده می شود. در بین سریال سازی و دی سریال سازی، ممکن است رشته نمایانگر شیء در یک فایل یا داده ذخیره شده باشد، یا از طریق اتصال شبکه به دستگاهی دور ارسال شده باشد.
pt_pt: Em vez de os utilizadores estarem constantemente a escrever e a depurar código para guardar tipos de dados complexos em ficheiros, o Python permite usar o popular formato de intercâmbio de dados chamado `JSON (JavaScript Object Notation) <https://json.org>`_. O módulo padrão chamado :mod:`json` pode converter hierarquias de dados Python em representações de strings; este processo é chamado de :dfn:`serialização`. Reconstruir os dados a partir da representação de string é chamado de :dfn:`desserialização`. Entre a serialização e a desserialização, a string que representa o objeto pode ter sido guardada num ficheiro ou dados, ou enviada através de uma ligação de rede para alguma máquina distante.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
fa: فرمت JSON به طور گسترده توسط برنامه های مدرن برای تبادل داده استفاده می شود. بسیاری از برنامه نویسان با آن آشنا هستند، که آن را به یک انتخاب مناسب برای همکاری بین سیستم ها تبدیل می کند.
pt_pt: O formato JSON é comumente usado por aplicações modernas para permitir a troca de dados. Muitos programadores já estão familiarizados com ele, o que o torna uma boa escolha para interoperabilidade.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
fa: اگر شیء ``x`` را داشته باشید، می توانید نمایش رشته ای JSON آن را با یک خط کد ساده مشاهده کنید::
pt_pt: Se tiver um objeto ``x``, pode ver a sua representação em string JSON com uma linha de código simples:

source: >>> import json >>> x = [1, 'simple', 'list'] >>> json.dumps(x) '[1, "simple", "list"]'
pt_pt: >>> import json >>> x = [1, 'simples', 'lista'] >>> json.dumps(x) '[1, "simples", "lista"]'

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
fa: یکی دیگر از انواع تابع :func:`~json.dumps`، به نام :func:`~json.dump`، به سادگی شیء را به یک :term:`text file` سریالیزه می کند. بنابراین اگر ``f`` یک شیء :term:`text file` باشد که برای نوشتن باز شده است، می توانیم این کار را انجام دهیم::
pt_pt: Outra variante da função :func:`~json.dumps`, chamada :func:`~json.dump`, serializa simplesmente o objeto para um :term:`ficheiro de texto`. Assim, se ``f`` for um objeto :term:`ficheiro de texto` aberto para escrita, podemos fazer isto:

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
fa: برای رمزگشایی مجدد شیء، اگر ``f`` یک شیء از نوع :term:`binary file` یا :term:`text file` است که برای خواندن باز شده است::
pt_pt: Para descodificar o objeto novamente, se ``f`` for um objeto :term:`ficheiro binário` ou :term:`ficheiro de texto` que foi aberto para leitura:

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
fa: فایل های JSON باید به صورت UTF-8 کدگذاری شوند. از ``encoding="utf-8"`` هنگام باز کردن فایل JSON به عنوان :term:`text file` برای هر دو عملیات خواندن و نوشتن استفاده کنید.
pt_pt: Os ficheiros JSON devem ser codificados em UTF-8. Use ``encoding="utf-8"`` ao abrir um ficheiro JSON como um :term:`ficheiro de texto` para leitura e escrita.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
fa: این تکنیک سریال سازی ساده می تواند لیست ها و دیکشنری ها را مدیریت کند، اما سریال سازی نمونه های دلخواه کلاس در JSON نیاز به کمی تلاش اضافی دارد. مرجع ماژول :mod:`json` شامل توضیحی در مورد این موضوع است.
pt_pt: Esta técnica de serialização simples pode lidar com listas e dicionários, mas a serialização de instâncias de classes arbitrárias em JSON requer um pouco mais de esforço. A referência para o módulo :mod:`json` contém uma explicação sobre isto.

source: :mod:`pickle` - the pickle module
fa: :mod:`pickle` - ماژول pickle
pt_pt: :mod:`pickle` — o módulo pickle

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
fa: برخلاف :ref:`JSON <tut-json>`، *pickle* یک پروتکل است که امکان سریال سازی اشیای پیچیده ی پایتون را فراهم می کند. بنابراین، این پروتکل مخصوص پایتون است و نمی توان از آن برای ارتباط با برنامه هایی که به زبان های دیگر نوشته شده اند استفاده کرد. همچنین به صورت پیش فرض ناامن است: غیر سریال سازی داده های ``pickle`` که از یک منبع غیرقابل اعتماد می آیند می تواند کد دلخواه را اجرا کند، اگر داده ها توسط یک مهاجم ماهر ساخته شده باشند.
pt_pt: Ao contrário do :ref:`JSON <tut-json>`, o *pickle* é um protocolo que permite a serialização de objetos Python arbitrariamente complexos. Como tal, é específico do Python e não pode ser usado para comunicar com aplicações escritas noutras linguagens. Também é inseguro por predefinição: desserializar dados pickle provenientes de uma fonte não confiável pode executar código arbitrário, se os dados forem criados por um atacante experiente.

source: formatted string literal
fa: رشته قالب بندی شده
pt_pt: literal de string formatada

source: interpolated string literal
fa: رشته متنی درونیابی شده
pt_pt: literal de string interpolada

source: formatted literal
fa: رشته قالب بندی شده
pt_pt: literal formatada

source: interpolated literal
fa: رشته های متفاوت pítonیزه (interpolated literal)
pt_pt: literal interpolada

source: built-in function
fa: تابع داخلی
pt_pt: função incorporada

source: open
fa: باز کردن
pt_pt: abrir

source: object
fa: شیء
pt_pt: objeto

source: file
fa: فایل
pt_pt: ficheiro

source: module
fa: ماژول
pt_pt: módulo

source: >>> for x in range(1, 11): ... print('{0:2d} {1:3d} {2:4d}'.format(x, x*x, x*x*x)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
fa: >>> برای x در محدوده (1, 11): ... print('{0:2d} {1:3d} {2:4d}'.format(x, x*x, x*x*x)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: string
fa: رشته

source: f-string
fa: رشته های f یا `f-string` در نسخه ی 3.6 پایتون معرفی شدند و روشی ساده و خوانا برای قالب بندی رشته ها ارائه می دهند. وقتی به استفاده ی مکرر از اتصال رشته ها نیاز دارید یا وقتی داده ها را در یک قالب خاص نمایش می دهید، رشته های f اغلب بهترین انتخاب هستند. برای استفاده از رشته های f، تنها کافیست حرف `f` یا `F` را قبل از رشته اضافه کنید و از جفت آکولاد «{}» برای قرار دادن کدهای پایتون درون آن استفاده کنید. این کار منجر به تولید یک `str` جدید می شود که حاوی نمایش محاسبه شده ی عبارت هاست.

source: fstring
fa: رشته های قالب بندی شده (fstring) در پایتون به شما این امکان را می دهند که تعابیر را به آسانی درون رشته ها قرار دهید. این امر با پیشوند قرار دادن حرف `f` یا `F` قبل از رشته و استفاده از آکولاد های `{}` برای قرار دادن تعابیر امکان پذیر است. تعابیر داخل آکولاد ها ارزیابی شده، تبدیل به رشته می شوند، و در جای خود قرار می گیرند. مثال:: name = "Ali" age = 25 greeting = f"Hello, my name is {name} and I am {age} years old." print(greeting) در این کد، مقدار `name` و `age` به صورت مستقیم در رشته ای که به متغیر `greeting` اختصاص داده شده است، تزریق می شوند.

source: json
fa: جیسون یا «جاوا اسکریپت آبجکت نوتیشن» یک فرمت انتقال داده است که به سادگی خوانده و نوشته می شود. اصولا برای ارسال داده ها در وب استفاده می شود. جیسون ساختاری شبیه به یک دیکشنری در پایتون دارد و می تواند توسط اکثر زبان های برنامه نویسی قابل درک باشد. برای تحلیل و استفاده از داده های جیسون در پایتون از کتابخانه ی داخلی `json` استفاده می شود. این کتابخانه به شما امکان می دهد داده های جیسون را بارگذاری (`load`) و ذخیره (`dump`) کنید. مثالی ساده از نحوه استفاده از کتابخانه `json` در پایتون:: import json # نمونه ای از داده های جیسون data = '{"name": "Ali", "age": 30, "city": "Tehran"}' # تبدیل جیسون به دیکشنری پایتون parsed_data = json.loads(data) print(parsed_data['name']) print(parsed_data['age']) print(parsed_data['city']) در این مثال، ما ابتدا داده های جیسون را به صورت یک رشته ذخیره کردیم و سپس آن را به یک دیکشنری پایتون تبدیل کردیم تا بتوانیم به راحتی به مقادیر مختلف دسترسی داشته باشیم.
