Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/inputoutput.po
Languages: fa, pt_pt

source: Input and Output
pt_pt: Entrada e saída

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
fa: راه های متعددی برای نمایش خروجی یک برنامه وجود دارد؛ اطلاعات می تواند به صورت قابل خواندن برای انسان چاپ شود یا برای استفاده های آتی در فایل نوشته شود. این فصل به برخی از این امکانات خواهد پرداخت.
pt_pt: Existem várias formas de apresentar a saída de um programa; os dados podem ser impressos num formato legível ou escritos num ficheiro para uso futuro. Este capítulo discutirá algumas das possibilidades.

source: Fancier Output Formatting
fa: قالب بندی خروجی جذاب تر
pt_pt: Formatação de saída mais elaborada

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`~io.TextIOBase.write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
fa: تا کنون با دو روش برای نوشتن مقادیر آشنا شده ایم: *expression statements* و تابع :func:`print`. (روش سوم استفاده از متد :meth:`~io.TextIOBase.write` برای آبجکت های فایل است؛ فایل خروجی استاندارد می تواند به عنوان ``sys.stdout`` اشاره شود. برای اطلاعات بیشتر به مراجعه کنید به Library Reference.)
pt_pt: Até agora, encontrámos duas formas de escrever valores: *instruções de expressão* e a função :func:`print`. (Uma terceira forma é usar o método :meth:`~io.TextIOBase.write` de objetos de ficheiro; o ficheiro de saída padrão pode ser referenciado como ``sys.stdout``. Consulte a Referência da Biblioteca para mais informações.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
fa: اغلب اوقات شما می خواهید کنترل بیشتری بر روی فرمت بندی خروجی خود نسبت به صرفاً چاپ مقادیر با فاصله های جداکننده داشته باشید. راه های مختلفی برای فرمت کردن خروجی وجود دارد.
pt_pt: Muitas vezes, vai querer ter mais controlo sobre a formatação da sua saída do que simplesmente imprimir valores separados por espaços. Existem várias formas de formatar a saída.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
fa: برای استفاده از :ref:`formatted string literals <tut-f-strings>`، یک رشته را با ``f`` یا ``F`` قبل از علامت نقل قول یا نقل قول سه گانه آغاز کنید. درون این رشته، می توانید یک عبارت پایتون را بین کاراکترهای ``{`` و ``}`` بنویسید که می تواند به متغیرها یا مقادیر صریح اشاره کند.
pt_pt: Para usar :ref:`literais de string formatadas <tut-f-strings>`, comece uma string com ``f`` ou ``F`` antes da aspa ou aspas triplas de abertura. Dentro desta string, pode escrever uma expressão Python entre os caracteres ``{`` e ``}`` que pode referir variáveis ou valores literais.

source: >>> year = 2016 >>> event = 'Referendum' >>> f'Results of the {year} {event}' 'Results of the 2016 Referendum'
pt_pt: >>> ano = 2016 >>> evento = 'Referendo' >>> f'Resultados do {ano} {evento}' 'Resultados do 2016 Referendo'

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted. In the following code block there are two examples of how to format variables:
fa: روش :meth:`str.format` در رشته ها نیاز به تلاش دستی بیشتری دارد. شما همچنان از ``{`` و ``}`` استفاده خواهید کرد تا مشخص کنید که یک متغیر کجا جایگزین خواهد شد و می توانید دستورات قالب بندی دقیقی ارائه دهید، اما همچنین لازم است اطلاعاتی که باید قالب بندی شوند، را فراهم کنید. در بلوک کد زیر دو مثال از چگونگی قالب بندی متغیرها وجود دارد:
pt_pt: O método :meth:`str.format` de strings requer mais esforço manual. Ainda usará ``{`` e ``}`` para marcar onde uma variável será substituída e pode fornecer diretivas de formatação detalhadas, mas também precisará de fornecer a informação a ser formatada. No seguinte bloco de código, existem dois exemplos de como formatar variáveis:

source: >>> yes_votes = 42_572_654 >>> total_votes = 85_705_149 >>> percentage = yes_votes / total_votes >>> '{:-9} YES votes {:2.2%}'.format(yes_votes, percentage) ' 42572654 YES votes 49.67%'
pt_pt: >>> votos_sim = 42_572_654 >>> votos_totais = 85_705_149 >>> percentagem = votos_sim / votos_totais >>> '{:-9} votos SIM {:2.2%}'.format(votos_sim, percentagem) ' 42572654 votos SIM 49,67%'

source: Notice how the ``yes_votes`` are padded with spaces and a negative sign only for negative numbers. The example also prints ``percentage`` multiplied by 100, with 2 decimal places and followed by a percent sign (see :ref:`formatspec` for details).
fa: توجه کنید که ``yes_votes`` با فاصله ها و یک علامت منفی فقط برای اعداد منفی پر می شوند. این مثال همچنین ``percentage`` را که در 100 ضرب شده است چاپ می کند، با 2 رقم اعشار و به دنبال آن علامت درصد (جزئیات را در :ref:`formatspec` ببینید).
pt_pt: Repare como os ``votos_sim`` são preenchidos com espaços e um sinal negativo apenas para números negativos. O exemplo também imprime a ``percentagem`` multiplicada por 100, com 2 casas decimais e seguida de um sinal de percentagem (consulte :ref:`formatspec` para mais detalhes).

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
fa: در نهایت، شما می توانید با استفاده از عملیات برش زدن و الحاق رشته ، مدیریت رشته ها را به طور کامل خودتان انجام دهید تا هر چیدمانی که تصور می کنید ایجاد کنید. نوع داده ی رشته دارای روش هایی است که عملیات مفیدی برای پر کردن رشته ها به عرض یک ستون مشخص انجام می دهند.
pt_pt: Finalmente, pode manipular strings manualmente usando operações de corte e concatenação para criar qualquer layout que imaginar. O tipo string tem alguns métodos que realizam operações úteis para preencher strings até uma largura de coluna específica.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
fa: هنگامی که به خروجی فانتزی نیاز ندارید اما فقط می خواهید یک نمایش سریع از برخی متغیرها برای اهداف اشکال زدایی داشته باشید، می توانید هر مقداری را با توابع :func:`repr` یا :func:`str` به رشته ای تبدیل کنید.
pt_pt: Quando não precisa de saída elaborada, mas apenas de uma visualização rápida de algumas variáveis para fins de depuração, pode converter qualquer valor para uma string usando as funções :func:`repr` ou :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
fa: تابع :func:`str` قرار است که نمایش هایی از مقادیر را برگرداند که برای انسان قابل فهم باشند، در حالی که :func:`repr` هدف دارد نمایش هایی تولید کند که توسط مفسر خوانده شوند (یا اگر هیچ سینتکس معادلی وجود نداشته باشد, یک :exc:`SyntaxError` را اجباری می کند). برای اشیایی که نمایش خاصی برای مصرف انسانی ندارند، :func:`str` همان مقداری که :func:`repr` برمی گرداند را برمی گرداند. بسیاری از مقادیر، مانند اعداد یا ساختارهایی مانند لیست ها و دیکشنری ها، با استفاده از هر دو تابع نمایش یکسانی دارند. به ویژه، رشته ها دو نمایش متمایز دارند.
pt_pt: A função :func:`str` destina-se a devolver representações de valores que sejam legíveis, enquanto :func:`repr` destina-se a gerar representações que possam ser lidas pelo interpretador (ou forçar um :exc:`SyntaxError` se não existir sintaxe equivalente). Para objetos que não têm uma representação específica para consumo humano, :func:`str` devolverá o mesmo valor que :func:`repr`. Muitos valores, como números ou estruturas como listas e dicionários, têm a mesma representação usando qualquer uma das funções. As strings, em particular, têm duas representações distintas.

source: Some examples::
fa: چند مثال::
pt_pt: Alguns exemplos::

source: >>> s = 'Hello, world.' >>> str(s) 'Hello, world.' >>> repr(s) "'Hello, world.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'The value of x is ' + repr(x) + ', and y is ' + repr(y) + '...' >>> print(s) The value of x is 32.5, and y is 40000... >>> # The repr() of a string adds string quotes and backslashes: >>> hello = 'hello, world\n' >>> hellos = repr(hello) >>> print(hellos) 'hello, world\n' >>> # The argument to repr() may be any Python object: >>> repr((x, y, ('spam', 'eggs'))) "(32.5, 40000, ('spam', 'eggs'))"
fa: >>> s = 'سلام, دنیا.' >>> str(s) 'سلام، دنیا.' >>> repr(s) "'سلام، دنیا.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'مقدار x برابر است با ' + repr(x) + ', و y برابر است با ' + repr(y) + '...' >>> print(s) مقدار x برابر است با 32.5، و y برابر است با 40000... >>> # تابع repr() در رشته ها, نقل قول ها و بک اسلش ها را اضافه می کند: >>> hello = 'سلام, دنیا\n' >>> hellos = repr(hello) >>> print(hellos) 'سلام، دنیا\n' >>> # آرگومان تابع repr() می تواند هر شیء پایتونی باشد: >>> repr((x, y, ('spam', 'eggs'))) "(32.5, 40000, ('spam', 'eggs'))"
pt_pt: >>> s = 'Olá, mundo.' >>> str(s) 'Olá, mundo.' >>> repr(s) "'Olá, mundo.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'O valor de x é ' + repr(x) + ', e y é ' + repr(y) + '...' >>> print(s) O valor de x é 32.5, e y é 40000... >>> # A função repr() de uma string adiciona aspas e barras invertidas: >>> hello = 'olá, mundo\n' >>> hellos = repr(hello) >>> print(hellos) 'olá, mundo\n' >>> # O argumento para repr() pode ser qualquer objeto Python: >>> repr((x, y, ('presunto', 'ovos'))) "(32.5, 40000, ('presunto', 'ovos'))"

source: Formatted String Literals
fa: رشته های قالب بندی شده (Formatted String Literals)
pt_pt: Literais de string formatadas

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
fa: رشته های :ref:`Formatted string literals <f-strings>` (که به اختصار به عنوان f-strings شناخته می شوند) به شما این امکان را می دهند که مقدار عبارات پایتون را درون یک رشته قرار دهید. این کار را با اضافه کردن پیشوند ``f`` یا ``F`` به رشته و نوشتن عبارات به صورت ``{expression}`` انجام می دهید.
pt_pt: Os :ref:`literais de string formatadas <f-strings>` (também chamados de f-strings) permitem incluir o valor de expressões Python dentro de uma string, prefixando a string com ``f`` ou ``F`` e escrevendo expressões como ``{expressão}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
fa: یک مشخص کنندهٔ قالب اختیاری می تواند پس از عبارت بیاید. این کار کنترل بیشتری بر روی نحوه ی قالب بندی مقدار فراهم می کند. مثال زیر عدد پی را به سه رقم اعشار گرد می کند::
pt_pt: Um especificador de formato opcional pode seguir a expressão. Isto permite um maior controlo sobre como o valor é formatado. O exemplo seguinte arredonda pi a três casas decimais:

source: >>> import math >>> print(f'The value of pi is approximately {math.pi:.3f}.') The value of pi is approximately 3.142.
fa: >>> import math >>> print(f'The value of pi is approximately {math.pi:.3f}.') مقدار pi تقریباً 3.142 است.
pt_pt: >>> import math >>> print(f'O valor de pi é aproximadamente {math.pi:.3f}.') O valor de pi é aproximadamente 3,142.

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
fa: قراردادن یک عدد صحیح بعد از ``':'`` باعث می شود که آن فیلد حداقل تعداد مشخصی کاراکتر داشته باشد. این قابلیت برای هم تراز کردن ستون ها مفید است. ::
pt_pt: Passar um inteiro após ``':'`` fará com que esse campo tenha uma largura mínima de caracteres. Isto é útil para alinhar colunas.

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for name, phone in table.items(): ... print(f'{name:10} ==> {phone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678
pt_pt: >>> tabela = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for nome, telefone in tabela.items(): ... print(f'{nome:10} ==> {telefone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
fa: تغییر دهنده های دیگر می توانند برای تبدیل مقدار قبل از فرمت بندی استفاده شوند. ``'!a'`` تابع :func:`ascii` را اعمال می کند، ``'!s'`` تابع :func:`str` را اعمال می کند، و ``'!r'`` تابع :func:`repr` را اعمال می کند::
pt_pt: Outros modificadores podem ser usados para converter o valor antes de ser formatado. ``'!a'`` aplica :func:`ascii`, ``'!s'`` aplica :func:`str`, e ``'!r'`` aplica :func:`repr`:

source: >>> animals = 'eels' >>> print(f'My hovercraft is full of {animals}.') My hovercraft is full of eels. >>> print(f'My hovercraft is full of {animals!r}.') My hovercraft is full of 'eels'.
fa: >>> animals = 'eels' >>> print(f'My hovercraft is full of {animals}.') هاورکرافت من پر از eels است. >>> print(f'My hovercraft is full of {animals!r}.') هاورکرافت من پر از 'eels' است.
pt_pt: >>> animais = 'enguias' >>> print(f'O meu aerodeslizador está cheio de {animais}.') O meu aerodeslizador está cheio de enguias. >>> print(f'O meu aerodeslizador está cheio de {animais!r}.') O meu aerodeslizador está cheio de 'enguias'.

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression:
fa: مشخص کننده ``=`` می تواند برای بسط یک عبارت به متن عبارت، علامت مساوی و سپس نمایش عبارت ارزیابی شده استفاده شود:
pt_pt: O especificador ``=`` pode ser usado para expandir uma expressão para o texto da expressão, um sinal de igual, seguido da representação da expressão avaliada:

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
fa: برای کسب اطلاعات بیشتر در مورد ``=`` به :ref:`self-documenting expressions <bpo-36817-whatsnew>` مراجعه کنید. برای مرجعی در مورد این مشخصات فرمت، به راهنمای مرجع :ref:`formatspec` مراجعه کنید.
pt_pt: Consulte :ref:`expressões auto-documentadas <bpo-36817-whatsnew>` para mais informações sobre o especificador ``=``. Para uma referência sobre estas especificações de formato, consulte o guia de referência :ref:`formatspec`.

source: The String format() Method
fa: متد String `format()`
pt_pt: O método format() de strings

source: Basic usage of the :meth:`str.format` method looks like this::
fa: استفاده ی پایه از روش :meth:`str.format` به این صورت است::
pt_pt: O uso básico do método :meth:`str.format` é o seguinte:

source: >>> print('We are the {} who say "{}!"'.format('knights', 'Ni')) We are the knights who say "Ni!"
fa: >>> print('ما {} هستيم كه مي گويند "{}!"'.format('knights', 'Ni')) We are the knights who say "Ni!"
pt_pt: >>> print('Nós somos os {} que dizem "{}!"'.format('cavaleiros', 'Ni')) Nós somos os cavaleiros que dizem "Ni!"

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
fa: کروشه ها و کاراکترهای درون آن ها (که به آن ها فیلدهای قالب گذاری گفته می شود) با اشیای پاس داده شده به متد :meth:`str.format` جایگزین می شوند. یک عدد در کروشه ها می تواند برای اشاره به موقعیت شیء پاس داده شده به متد :meth:`str.format` استفاده شود. ::
pt_pt: As chavetas e os caracteres dentro delas (chamados campos de formato) são substituídos pelos objetos passados para o método :meth:`str.format`. Um número dentro das chavetas pode ser usado para referir a posição do objeto passado para o método :meth:`str.format`:

source: >>> print('{0} and {1}'.format('spam', 'eggs')) spam and eggs >>> print('{1} and {0}'.format('spam', 'eggs')) eggs and spam
pt_pt: >>> print('{0} e {1}'.format('presunto', 'ovos')) presunto e ovos >>> print('{1} e {0}'.format('presunto', 'ovos')) ovos e presunto

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
fa: اگر از آرگومان های کلیدی در متد :meth:`str.format` استفاده شود، مقادیر آن ها با استفاده از نام آرگومان ارجاع داده می شوند. ::
pt_pt: Se argumentos nomeados forem usados no método :meth:`str.format`, os seus valores são referidos usando o nome do argumento:

source: >>> print('This {food} is {adjective}.'.format( ... food='spam', adjective='absolutely horrible')) This spam is absolutely horrible.
fa: >>> print('این {food} کاملاً {adjective} است.'.format( ... food='spam', adjective='وحشتناک')) This spam is absolutely horrible.
pt_pt: >>> print('Este {comida} é {adjetivo}.'.format( ... comida='presunto', adjetivo='absolutamente horrível')) Este presunto é absolutamente horrível.

source: Positional and keyword arguments can be arbitrarily combined::
fa: آرگومان های مکانی و کلیدی می توانند به صورت دلخواه ترکیب شوند::
pt_pt: Argumentos posicionais e nomeados podem ser combinados arbitrariamente:

source: >>> print('The story of {0}, {1}, and {other}.'.format('Bill', 'Manfred', ... other='Georg')) The story of Bill, Manfred, and Georg.
fa: >>> print('داستان {0}, {1} و {other}.'.format('Bill', 'Manfred', ... other='Georg')) داستان Bill, Manfred و Georg.
pt_pt: >>> print('A história de {0}, {1}, e {outro}.'.format('Bill', 'Manfred', ... outro='Georg')) A história de Bill, Manfred, e Georg.

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
fa: اگر شما دارای یک رشته فرمت بسیار طولانی هستید که نمی خواهید آن را تقسیم کنید، بهتر است که متغیرهایی که قرار است فرمت شوند را به جای موقعیت، با نام فراخوانی کنید. این کار به سادگی با ارسال `dict` و استفاده از کروشه ها برای دسترسی به کلیدها انجام می شود. ::
pt_pt: Se tiver uma string de formato muito longa que não queira dividir, seria útil se pudesse referenciar as variáveis a formatar por nome em vez de por posição. Isto pode ser feito passando simplesmente o dicionário e usando colchetes ``'[]'`` para aceder às chaves:

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
pt_pt: >>> tabela = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(tabela)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
fa: این کار همچنین می تواند با ارسال دیکشنری ``table`` به عنوان آرگومان های کلمه کلیدی با نوتیشن ``**`` انجام شود. ::
pt_pt: Isto também pode ser feito passando o dicionário ``tabela`` como argumentos nomeados com a notação ``**``:

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
pt_pt: >>> tabela = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**tabela)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables::
fa: این به ویژه در ترکیب با تابع داخلی :func:`vars` مفید است که یک دیکشنری حاوی تمام متغیرهای محلی را برمی گرداند::
pt_pt: Isto é particularmente útil em combinação com a função incorporada :func:`vars`, que devolve um dicionário contendo todas as variáveis locais:

source: >>> table = {k: str(v) for k, v in vars().items()} >>> message = " ".join([f'{k}: ' + '{' + k +'};' for k in table.keys()]) >>> print(message.format(**table)) __name__: __main__; __doc__: None; __package__: None; __loader__: ...
pt_pt: >>> tabela = {k: str(v) for k, v in vars().items()} >>> mensagem = " ".join([f'{k}: ' + '{' + k +'};' for k in tabela.keys()]) >>> print(mensagem.format(**tabela)) __name__: __main__; __doc__: None; __package__: None; __loader__: ...

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
fa: به عنوان یک مثال، خطوط زیر مجموعه ای به خوبی مرتب شده از ستون ها را تولید می کنند که عددهای صحیح و توان دوم و سوم آن ها را نشان می دهد::
pt_pt: Como exemplo, as seguintes linhas produzem um conjunto de colunas alinhadas que mostram inteiros e os seus quadrados e cubos:

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
fa: برای دید کلی از قالب بندی رشته با :meth:`str.format`، به :ref:`formatstrings` مراجعه کنید.
pt_pt: Para uma visão geral completa da formatação de strings com :meth:`str.format`, consulte :ref:`formatstrings`.

source: Manual String Formatting
fa: فرمت بندی رشته به صورت دستی
pt_pt: Formatação manual de strings

source: Here's the same table of squares and cubes, formatted manually::
fa: در اینجا همان جدول مربعات و مکعب ها قرار دارد که به صورت دستی قالب بندی شده است::
pt_pt: Aqui está a mesma tabela de quadrados e cubos, formatada manualmente:

source: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note use of 'end' on previous line ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
fa: >>> برای x در بازه ی range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note use of 'end' on previous line ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
pt_pt: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note o uso de 'end' na linha anterior ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
fa: (توجه داشته باشید که یک فاصله بین هر ستون توسط :func:`print` اضافه شده است: این همیشه بین آرگومان هایش فاصله ایجاد می کند.)
pt_pt: (Note que o espaço entre cada coluna foi adicionado pela forma como :func:`print` funciona: sempre adiciona espaços entre os seus argumentos.)
