Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/tutorial/whatnow.po
Languages: fa, pl, pt_pt

source: What Now?
fa: حال چه کنیم؟
pl: Co dalej?
pt_pt: E agora?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
fa: خواندن این آموزش احتمالاً علاقه شما به استفاده از پایتون را تقویت کرده است --- شما باید مشتاق باشید که پایتون را برای حل مسائل واقعی تان به کار بگیرید. برای یادگیری بیشتر کجا باید بروید؟
pl: Przeczytanie tego samouczka prawdopodobnie zwiększyło twoje zainteresowanie używaniem Pythona --- powinieneś chcieć zastosować Pythona do rozwiązywania swoich rzeczywistych problemów. Gdzie powinieneś się udać, aby dowiedzieć się więcej?
pt_pt: A leitura deste tutorial provavelmente reforçou o seu interesse em usar Python --- você deve estar ansioso para aplicar Python na resolução dos seus problemas do mundo real. Onde você deve ir para aprender mais?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
fa: این آموزش بخشی از مجموعه مستندات پایتون است. برخی از سایر اسناد در این مجموعه عبارتند از:
pl: Ten tutorial jest częścią zbioru dokumentacji Pythona. Inne dokumenty zawarte w tym zbiorze to:
pt_pt: Este tutorial faz parte do conjunto de documentação do Python. Outros documentos do conjunto são:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
fa: شما باید این راهنما را مرور کنید که مواد مرجع کامل (هرچند مختصر) درباره انواع، توابع و ماژول های موجود در کتابخانه استاندارد ارائه می دهد. توزیع استاندارد پایتون شامل یک *lot* از کد اضافی است. ماژول هایی برای خواندن صندوق های پستی یونیکس، بازیابی اسناد از طریق HTTP، تولید اعداد تصادفی، تجزیه گزینه های خط فرمان، فشرده سازی داده ها و بسیاری از وظایف دیگر وجود دارد. مرور اجمالی از مرجع کتابخانه به شما ایده ای از آنچه موجود است خواهد داد.
pt_pt: Você deve folhear este manual, que fornece material de referência completo (embora conciso) sobre tipos, funções e os módulos da biblioteca padrão. A distribuição padrão do Python inclui *muito* código adicional. Existem módulos para ler caixas de correio Unix, recuperar documentos via HTTP, gerar números aleatórios, analisar opções de linha de comando, comprimir dados e muitas outras tarefas. Folhear a Referência da Biblioteca lhe dará uma ideia do que está disponível.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
fa: :ref:`installing-index` توضیح می دهد چگونه ماژول های اضافی نوشته شده توسط کاربران دیگر پایتون را نصب کنیم.
pl: :ref:`installing-index` tłumaczy w jaki sposób instalować dodatkowe moduły napisane przez innych użytkowników Pythona.
pt_pt: :ref:`installing-index` explica como instalar módulos adicionais escritos por outros utilizadores Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
fa: :ref:`reference-index`: یک توضیح دقیق از نحو و معناشناسی زبان پایتون. این متن سنگین است، اما به عنوان یک راهنمای کامل برای خود زبان مفید می باشد.
pl: :ref:`reference-index`: Szegółowe wyjaśnienie składni i semantyki Pythona. To ciężka lektura, ale bardzo przydatna jako kompletny przewodnik po samym języku.
pt_pt: :ref:`reference-index`: Uma explicação detalhada da sintaxe e semântica do Python. É uma leitura pesada, mas é útil como um guia completo da própria linguagem.

source: More Python resources:
fa: منابع بیشتر برای پایتون:
pl: Więcej zasobów Pythona:
pt_pt: Mais recursos Python:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
fa: https://www.python.org: وب سایت اصلی پایتون. این وب سایت شامل کد، مستندات، و پیوندهایی به صفحات مرتبط با پایتون در سراسر وب می باشد.
pl: https://www.python.org: Główna strona internetowa poświęcona językowi Python. Zawiera kod, dokumentację oraz odnośniki do innych stron związanych z Python-em.
pt_pt: https://www.python.org: O principal site sobre Python. Contém código, documentação e links para páginas relacionadas ao Python na web.

source: https://docs.python.org: Fast access to Python's documentation.
fa: https://docs.python.org: دسترسی سریع به مستندات پایتون.
pl: https://docs.python.org/pl: Szybki dostęp do dokumentacji Pythona.
pt_pt: https://docs.python.org: Acesso rápido à documentação do Python.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
fa: https://pypi.org: شاخص بسته های پایتون، که قبلاً به نام فروشگاه پنیر نیز شناخته می شد [#]_، شاخصی از ماژول های پایتون ایجاد شده توسط کاربران است که برای دانلود در دسترس هستند. زمانی که شروع به عرضه کدهای خود کنید، می توانید آنها را اینجا ثبت کنید تا دیگران بتوانند آن را پیدا کنند.
pl: https://pypi.org: Indeks pakietów Pythona (Python Package Index), wcześniej nazywany także Sklep z Serem (Cheese Shop) [#]_, to indeks utworzonych przez użytkowników modułów Pythona, które można pobrać. Gdy zaczniesz udostępniać kod, możesz go tutaj zarejestrować, aby inni mogli go znaleźć.
pt_pt: https://pypi.org: O Python Package Index, anteriormente também conhecido como Cheese Shop [#]_, é um índice de módulos Python criados por utilizadores que estão disponíveis para download. Assim que começar a lançar código, pode registá-lo aqui para que outros possam encontrá-lo.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
fa: https://code.activestate.com/recipes/langs/python/: کتابخانه Python Cookbook مجموعه بزرگی از مثال های کد، ماژول های بزرگ تر و اسکریپت های مفید است. مشارکت های به ویژه قابل توجه در کتابی با عنوان Python Cookbook (انتشارات O'Reilly & Associates, ISBN 0-596-00797-3) گردآوری شده اند.
pl: https://code.activestate.com/recipes/langs/python/: The Python Cookbook to pokaźny zbiór przykładów kodu, większych modułów i przydatnych skryptów po angielsku. Szczególnie godne uwagi fragmenty zostały zebrane i przetłumaczone w książce zatytułowanej „Python. Receptury” (Wydawnicto Helion/O'Reilly, ISBN: 978-83-246-8180-8).
pt_pt: https://code.activestate.com/recipes/langs/python/: The Python Cookbook é uma coleção considerável de exemplos de código, módulos maiores e scripts úteis. Contribuições particularmente notáveis estão reunidas num livro também intitulado Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
fa: https://pyvideo.org لینک هایی به ویدیوهای مربوط به پایتون از کنفرانس ها و جلسات گروه های کاربری جمع آوری می کند.
pl: https://pyvideo.org zbiera linki do filmów związanych z Pythonem z konferencji oraz spotkań grup użytkowników.
pt_pt: https://pyvideo.org reúne links para vídeos relacionados com Python, provenientes de conferências e reuniões de grupos de utilizadores.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
fa: پروژه Scientific Python در https://scipy.org شامل ماژول هایی برای محاسبات و دستکاری آرایه ها به صورت سریع به همراه مجموعه ای از بسته ها برای مواردی مانند جبر خطی، تبدیل های فوریه، حل کننده های غیرخطی، توزیع اعداد تصادفی، تحلیل آماری و موارد مشابه است.
pl: https://scipy.org: Projekt "Scientific Python" zawiera moduły do szybkich obliczeń oraz modyfikacji tablicowych oraz wiele pakietów do takich rzeczy jak algebra liniowa, transformata Fouriera, rozwiązania nieliniowe, rozkłady liczb losowych, analiza statystyczna i tym podobne.
pt_pt: https://scipy.org: O projeto Scientific Python inclui módulos para cálculos e manipulações rápidas de matrizes, além de uma série de pacotes para coisas como álgebra linear, transformadas de Fourier, solucionadores não lineares, distribuições de números aleatórios, análise estatística e similares.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
fa: برای پرسش ها و گزارش مشکلات مرتبط با پایتون، می توانید در گروه خبری :newsgroup:`comp.lang.python` پست بگذارید، یا آنها را به لیست پستی در python-list@python.org ارسال کنید. گروه خبری و لیست پستی به یکدیگر متصل هستند، بنابراین پیام هایی که به یکی ارسال می شوند، به صورت خودکار به دیگری نیز فرستاده می شوند. روزانه صدها پست ارسال می شود که در آنها به طرح پرسش ها (و پاسخ به آنها), پیشنهاد ویژگی های جدید، و اعلام ماژول های جدید پرداخته می شود. آرشیوهای لیست پستی در https://mail.python.org/pipermail/ در دسترس هستند.
pl: Pytania związane z Pythonem i raporty o problemach można przesyłać na grupę dyskusyjną :newsgroup:`comp.lang.python` lub na listę mailingową python-list@python.org. Grupa dyskusyjna i lista mailingowa są połączone, więc wiadomości wysłane na jedną z nich będą automatycznie przekazywane na drugą. Codziennie pojawiają się tam setki postów z pytaniami (i odpowiedziami), sugestiami nowych funkcji i zapowiedziami nowych modułów. Archiwa list mailingowych są dostępne pod adresem https://mail.python.org/pipermail/.
pt_pt: Para perguntas relacionadas ao Python e relatórios de problemas, você pode postar no newsgroup :newsgroup:`comp.lang.python` ou enviá-los para a lista de discussão em python-list@python.org. O newsgroup e a lista de correio são interligados, pelo que as mensagens publicadas num serão automaticamente encaminhadas para o outro. Há centenas de publicações por dia, com perguntas (e respostas), sugestões de novas funcionalidades e anúncios de novos módulos. Os arquivos da lista de correio estão disponíveis em https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
fa: قبل از ارسال، حتماً لیست :ref:`Frequently Asked Questions <faq-index>` (که به عنوان FAQ نیز شناخته می شود) را بررسی کنید. FAQ به بسیاری از سوالاتی که بارها و بارها مطرح می شوند پاسخ می دهد و ممکن است قبلاً راه حل مشکل شما را در بر داشته باشد.
pl: Przed wysłaniem zapytania, warto sprawdzić listę :ref:`Często zadawanych pytań <faq-index>` (zwaną również FAQ). FAQ odpowiada na wiele często pojawiających się pytań i może już zawierać rozwiązanie twojego problemu.
pt_pt: Antes de publicar, certifique-se de verificar a lista de :ref:`Perguntas frequentes <faq-index>` (também chamada de FAQ). A FAQ responde a muitas das perguntas que surgem repetidamente e pode já conter a solução para o seu problema.

source: Footnotes
fa: پاورقی ها
pl: Przypisy
pt_pt: Notas de rodapé

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
fa: "فروشگاه پنیر" یک نمایش نامه از مانتی پایتون است: مردی به فروشگاه پنیر وارد می شود، اما هر پنیری که درخواست می کند، فروشنده می گوید که موجود نیست.
pl: "Sklep z Serami" (Cheese Shop) to skecz Monty Pythona: klient wchodzi do sklepu z serami, ale bez względu na to, o jaki ser prosi, sprzedawca mówi, że go nie ma.
pt_pt: «Cheese Shop» é um sketch dos Monty Python: um cliente entra numa loja de queijos, mas, independentemente do queijo que pede, o funcionário diz que não tem.

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, write CGI programs, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
pl: Powinieneś przejrzeć ten podręcznik, który zawiera kompletny (choć zwięzły) materiał referencyjny na temat typów, funkcji i modułów w standardowej bibliotece. Standardowa dystrybucja Pythona zawiera *dużo* dodatkowego kodu. Istnieją moduły do ​​czytania skrzynek pocztowych Unix, pobierania dokumentów przez HTTP, generowania liczb losowych, analizowania opcji wiersza poleceń, pisania programów CGI, kompresji danych i wielu innych zadań. Przejrzenie informacji o bibliotece da ci wyobrażenie o tym, co jest dostępne.
