Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/instrumentation.po
Languages: es_es

source: Instrumenting CPython with DTrace and SystemTap
es_es: Instrumentación de CPython con DTrace y SystemTap

source: author
es_es: autor

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
es_es: DTrace y SystemTap son herramientas de monitorización que permiten inspeccionar lo que hacen los procesos de un sistema informático. Ambas utilizan lenguajes específicos de dominio que permiten al usuario escribir scripts que:

source: filter which processes are to be observed
es_es: filtrar los procesos que deben observarse

source: gather data from the processes of interest
es_es: recopilar datos de los procesos de interés

source: generate reports on the data
es_es: generar informes sobre los datos

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
es_es: A partir de Python 3.6, CPython puede construirse con "marcadores" incrustados, también conocidos como "sondas", que pueden ser observados por un script DTrace o SystemTap, haciendo más fácil monitorizar lo que están haciendo los procesos CPython en un sistema.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
es_es: Los marcadores DTrace son detalles de implementación del intérprete CPython. No se garantiza la compatibilidad de sondas entre versiones de CPython. Los scripts DTrace pueden dejar de funcionar o funcionar incorrectamente sin previo aviso al cambiar de versión de CPython.

source: Enabling the static markers
es_es: Activar los marcadores estáticos

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
es_es: macOS viene con soporte integrado para DTrace. En Linux, para construir CPython con los marcadores integrados para SystemTap, se deben instalar las herramientas de desarrollo de SystemTap.

source: On a Linux machine, this can be done via::
es_es: En una máquina Linux, esto se puede hacer a través de::

source: or::
es_es: o::

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
es_es: CPython debe entonces ser :option:`configured with the --with-dtrace option <--with-dtrace>`:

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
es_es: En macOS, puedes listar las sondas DTrace disponibles ejecutando un proceso Python en segundo plano y listando todas las sondas puestas a disposición por el proveedor Python::

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
es_es: En Linux, puedes verificar si los marcadores estáticos SystemTap están presentes en el binario construido viendo si contiene una sección ".note.stapsdt".

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
es_es: Si has compilado Python como biblioteca compartida (con la opción de configuración :option:`--enable-shared`), tendrás que buscar en la biblioteca compartida. Por ejemplo::

source: Sufficiently modern readelf can print the metadata::
es_es: Un readelf suficientemente moderno puede imprimir los metadatos::

source: The above metadata contains information for SystemTap describing how it can patch strategically placed machine code instructions to enable the tracing hooks used by a SystemTap script.
es_es: Los metadatos anteriores contienen información para SystemTap que describe cómo puede parchear instrucciones de código máquina colocadas estratégicamente para habilitar los ganchos de rastreo utilizados por un script SystemTap.

source: Static DTrace probes
es_es: Sondas estáticas DTrace

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
es_es: El siguiente ejemplo de script DTrace se puede usar para mostrar la jerarquía llamada/retorno de un script Python, sólo rastreando dentro de la invocación de una función llamada "start". En otras palabras, las invocaciones a funciones en tiempo de importación no se listarán:

source: It can be invoked like this::
es_es: Se puede llamar así::

source: The output looks like this:
es_es: El resultado es el siguiente:

source: Static SystemTap markers
es_es: Marcadores estáticos SystemTap

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
es_es: La forma más sencilla de utilizar la integración de SystemTap es utilizar directamente los marcadores estáticos. Para ello es necesario indicar explícitamente el archivo binario que los contiene.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
es_es: Por ejemplo, este script de SystemTap se puede usar para mostrar la jerarquía call/return de un script Python:

source: where the columns are:
es_es: donde están las columnas:

source: time in microseconds since start of script
es_es: tiempo en microsegundos desde el inicio del script

source: name of executable
es_es: nombre del ejecutable

source: PID of process
es_es: PID del proceso

source: and the remainder indicates the call/return hierarchy as the script executes.
es_es: y el resto indica la jerarquía call/return a medida que se ejecuta el script.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
es_es: Para una compilación :option:`--enable-shared` de CPython, los marcadores están contenidos dentro de la biblioteca compartida libpython, y la ruta punteada de la sonda necesita reflejar esto. Por ejemplo, esta línea del ejemplo anterior:

source: should instead read:
es_es: debería decir:

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
es_es: (suponiendo una :ref:`debug build <debug-build>` de CPython 3.6)

source: Available static markers
es_es: Marcadores estáticos disponibles

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
es_es: Este marcador indica que ha comenzado la ejecución de una función Python. Sólo se activa para funciones puramente Python (bytecode).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
es_es: El nombre del archivo, el nombre de la función y el número de línea se devuelven al script de rastreo como argumentos posicionales, a los que se debe acceder mediante ``$arg1``, ``$arg2``, ``$arg3``:

source: ``$arg1`` : ``(const char *)`` filename, accessible using ``user_string($arg1)``
es_es: ``$arg1``: ``(const char *)`` nombre de archivo, accesible mediante ``user_string($arg1)``

source: ``$arg2`` : ``(const char *)`` function name, accessible using ``user_string($arg2)``
es_es: ``$arg2``: ``(const char *)`` nombre de la función, accesible mediante ``user_string($arg2)``

source: ``$arg3`` : ``int`` line number
es_es: ``$arg3``: ``int`` número de línea

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
es_es: Este marcador indica que una línea de Python está a punto de ejecutarse. Es el equivalente al rastreo línea a línea con un perfilador de Python. No se activa dentro de funciones C.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
es_es: Se dispara cuando el intérprete de Python termina un ciclo de recolección de basura. ``arg0`` es el número de objetos recolectados.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
es_es: Se activa antes de que :mod:`importlib` intente encontrar y cargar el módulo. ``arg0`` es el nombre del módulo.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
es_es: Se activa después de llamar a la función find_and_load de :mod:`importlib`. ``arg0`` es el nombre del módulo, ``arg1`` indica si el módulo se ha cargado correctamente.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
es_es: Se dispara cuando se llama a :func:`sys.audit` o :c:func:`PySys_Audit`. ``arg0`` es el nombre del evento como cadena C, ``arg1`` es un :c:type:`PyObject` puntero a un objeto tupla.

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
es_es: La forma de nivel superior de utilizar la integración de SystemTap es utilizar un "tapset": el equivalente de SystemTap a una biblioteca, que oculta algunos de los detalles de bajo nivel de los marcadores estáticos.

source: Here is a tapset file, based on a non-shared build of CPython:
es_es: Aquí hay un archivo tapset, basado en una compilación no compartida de CPython:

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
es_es: Si este archivo está instalado en el directorio tapset de SystemTap (por ejemplo, ``/usr/share/systemtap/tapset``), estarán disponibles estos puntos de sonda adicionales:

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
es_es: Este punto de sondeo indica que ha comenzado la ejecución de una función Python. Sólo se activa para funciones puramente Python (bytecode).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
es_es: Este punto de sondeo es el inverso de ``python.function.return``, e indica que la ejecución de una función Python ha finalizado (ya sea a través de ``return``, o a través de una excepción). Sólo se activa para funciones puramente Python (bytecode).

source: Examples
es_es: Ejemplos

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
es_es: Este script SystemTap utiliza el tapset anterior para implementar de forma más limpia el ejemplo anterior de rastreo de la jerarquía de llamadas a funciones de Python, sin necesidad de nombrar directamente los marcadores estáticos:

source: The following script uses the tapset above to provide a top-like view of all running CPython code, showing the top 20 most frequently entered bytecode frames, each second, across the whole system:
es_es: El siguiente script utiliza el tapset anterior para proporcionar una vista superior de todo el código CPython en ejecución, mostrando las 20 tramas de bytecode introducidas con más frecuencia, cada segundo, en todo el sistema:
