Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/isolating-extensions.po
Languages: es_es, pt_pt, ru

source: Isolating Extension Modules
es_es: Aislar módulos de ampliación
pt_pt: Isolar Módulos de Extensão
ru: Изолирующие модули расширения

source: Abstract
es_es: Resumen
pt_pt: Resumo
ru: Абстракция

source: Traditionally, state belonging to Python extension modules was kept in C ``static`` variables, which have process-wide scope. This document describes problems of such per-process state and shows a safer way: per-module state.
es_es: Tradicionalmente, el estado perteneciente a los módulos de extensión de Python se guardaba en las variables de C ``static``, que tienen alcance para todo el proceso. Este documento describe los problemas de dicho estado por proceso y muestra una forma más segura: el estado por módulo.
pt_pt: Tradicionalmente, o estado pertencente aos módulos de extensão Python era mantido em variáveis C ``static``, que têm um âmbito em todo o processo. Este documento descreve os problemas desse estado por processo e apresenta uma abordagem mais segura: o estado por módulo.
ru: Традиционно состояние, принадлежащее модулям расширения Python, сохранялось в статических переменных C, которые имеют область действия на уровне всего процесса. В этом документе описываются проблемы такого состояния каждого процесса и показан более безопасный способ: состояние каждого модуля.

source: The document also describes how to switch to per-module state where possible. This transition involves allocating space for that state, potentially switching from static types to heap types, and—perhaps most importantly—accessing per-module state from code.
es_es: El documento también describe cómo cambiar al estado por módulo cuando sea posible. Esta transición implica asignar espacio para ese estado, cambiar potencialmente de tipos estáticos a tipos de montón y, quizás lo más importante, acceder al estado por módulo desde el código.
pt_pt: O documento também descreve como mudar para o estado por módulo, sempre que possível. Esta transição envolve alocar espaço para esse estado, potencialmente mudar de tipos estáticos para tipos de heap, e — talvez o mais importante — aceder ao estado por módulo a partir do código.
ru: В документе также описывается, как переключиться в состояние каждого модуля, где это возможно. Этот переход включает в себя выделение места для этого состояния, потенциальное переключение со статических типов на типы кучи и — возможно, самое главное — доступ к состоянию каждого модуля из кода.

source: Who should read this
es_es: Quién debe leerlo
pt_pt: Para quem é este documento
ru: Кому следует это прочитать

source: This guide is written for maintainers of :ref:`C-API <c-api-index>` extensions who would like to make that extension safer to use in applications where Python itself is used as a library.
es_es: Esta guía está escrita para los mantenedores de extensiones :ref:`C-API <c-api-index>` que quieran hacer que esa extensión sea más segura de usar en aplicaciones donde el propio Python se usa como librería.
pt_pt: Este guia é dirigido a mantenedores de extensões da :ref:`C-API <c-api-index>` que pretendem tornar essas extensões mais seguras para uso em aplicações onde o Python é utilizado como uma biblioteca.
ru: Это руководство написано для сопровождающих расширений :ref:`C-API <c-api-index>`, которые хотели бы сделать это расширение более безопасным для использования в приложениях, где сам Python используется в качестве библиотеки.

source: Background
es_es: Fondo
pt_pt: Contexto
ru: Фон

source: An *interpreter* is the context in which Python code runs. It contains configuration (e.g. the import path) and runtime state (e.g. the set of imported modules).
es_es: Un *interprete* es el contexto en el que se ejecuta el código Python. Contiene la configuración (por ejemplo, la ruta de importación) y el estado de ejecución (por ejemplo, el conjunto de módulos importados).
pt_pt: Um *interpretador* é o contexto no qual o código Python é executado. Contém configuração (por exemplo, o caminho de importação) e estado de execução (por exemplo, o conjunto de módulos importados).
ru: *Интерпретатор* — это контекст, в котором выполняется код Python. Он содержит конфигурацию (например, путь импорта) и состояние времени выполнения (например, набор импортированных модулей).

source: Python supports running multiple interpreters in one process. There are two cases to think about—users may run interpreters:
es_es: Python soporta la ejecución de múltiples intérpretes en un proceso. Hay dos casos en los que los usuarios pueden ejecutar intérpretes:
pt_pt: O Python suporta a execução de vários interpretadores num único processo. Existem dois casos a considerar — os utilizadores podem executar interpretadores:
ru: Python поддерживает запуск нескольких интерпретаторов в одном процессе. Есть два случая, о которых следует подумать: пользователи могут запускать интерпретаторы:

source: in sequence, with several :c:func:`Py_InitializeEx`/:c:func:`Py_FinalizeEx` cycles, and
es_es: en secuencia, con varios ciclos :c:func:`Py_InitializeEx`/:c:func:`Py_FinalizeEx`, y
pt_pt: em sequência, com vários ciclos de :c:func:`Py_InitializeEx`/:c:func:`Py_FinalizeEx`, e
ru: последовательно, с несколькими циклами :c:func:`Py_InitializeEx`/:c:func:`Py_FinalizeEx`, и

source: in parallel, managing "sub-interpreters" using :c:func:`Py_NewInterpreter`/:c:func:`Py_EndInterpreter`.
es_es: en paralelo, gestionando "subinterpretadores" mediante :c:func:`Py_NewInterpreter`/:c:func:`Py_EndInterpreter`.
pt_pt: em paralelo, gerindo "sub-interpretadores" usando :c:func:`Py_NewInterpreter`/:c:func:`Py_EndInterpreter`.
ru: параллельно управление «субинтерпретаторами» с помощью :c:func:`Py_NewInterpreter`/:c:func:`Py_EndInterpreter`.

source: Both cases (and combinations of them) would be most useful when embedding Python within a library. Libraries generally shouldn't make assumptions about the application that uses them, which include assuming a process-wide "main Python interpreter".
es_es: Ambos casos (y combinaciones de ellos) serían más útiles al incrustar Python dentro de una biblioteca. Por lo general, las bibliotecas no deberían hacer suposiciones sobre la aplicación que las utiliza, lo que incluye suponer un "intérprete principal de Python" en todo el proceso.
pt_pt: Ambos os casos (e combinações dos mesmos) seriam mais úteis ao incorporar o Python dentro de uma biblioteca. As bibliotecas geralmente não devem fazer suposições sobre a aplicação que as utiliza, o que inclui assumir um interpretador Python "principal" em todo o processo.
ru: Оба случая (и их комбинации) будут наиболее полезны при встраивании Python в библиотеку. Библиотеки, как правило, не должны делать предположений о приложении, которое их использует, в том числе предполагать наличие «основного интерпретатора Python» в масштабе всего процесса.

source: Historically, Python extension modules don't handle this use case well. Many extension modules (and even some stdlib modules) use *per-process* global state, because C ``static`` variables are extremely easy to use. Thus, data that should be specific to an interpreter ends up being shared between interpreters. Unless the extension developer is careful, it is very easy to introduce edge cases that lead to crashes when a module is loaded in more than one interpreter in the same process.
es_es: Históricamente, los módulos de extensión de Python no manejan bien este caso de uso. Muchos módulos de extensión (e incluso algunos módulos stdlib) usan estado global *por-proceso*, porque las variables C ``static`` son extremadamente fáciles de usar. Así, los datos que deberían ser específicos de un intérprete acaban siendo compartidos entre intérpretes. A menos que el desarrollador de extensiones sea cuidadoso, es muy fácil introducir casos extremos que lleven a fallos cuando un módulo se carga en más de un intérprete en el mismo proceso.
pt_pt: Historicamente, os módulos de extensão Python não lidam bem com este caso de uso. Muitos módulos de extensão (e até alguns módulos da biblioteca padrão) usam estado *global por processo*, porque as variáveis C ``static`` são extremamente fáceis de usar. Assim, dados que deveriam ser específicos de um interpretador acabam por ser partilhados entre interpretadores. A menos que o desenvolvedor da extensão seja cuidadoso, é muito fácil introduzir casos limite que levam a falhas quando um módulo é carregado em mais do que um interpretador no mesmo processo.
ru: Исторически сложилось так, что модули расширения Python плохо справляются с этим вариантом использования. Многие модули расширения (и даже некоторые модули stdlib) используют глобальное состояние каждого процесса, поскольку статические переменные C чрезвычайно просты в использовании. Таким образом, данные, которые должны быть специфичны для интерпретатора, в конечном итоге распределяются между интерпретаторами. Если разработчик расширения не будет осторожен, очень легко ввести пограничные случаи, которые приведут к сбоям, когда модуль загружается более чем в один интерпретатор в одном и том же процессе.

source: Unfortunately, *per-interpreter* state is not easy to achieve. Extension authors tend to not keep multiple interpreters in mind when developing, and it is currently cumbersome to test the behavior.
es_es: Por desgracia, el estado *por intérprete* no es fácil de conseguir. Los autores de extensiones tienden a no tener en cuenta múltiples intérpretes cuando desarrollan, y actualmente es engorroso probar el comportamiento.
pt_pt: Infelizmente, o estado *por interpretador* não é fácil de alcançar. Os autores de extensões tendem a não ter vários interpretadores em mente durante o desenvolvimento, e atualmente é trabalhoso testar esse comportamento.
ru: К сожалению, достичь состояния *для каждого интерпретатора* непросто. Авторы расширений, как правило, не учитывают наличие нескольких интерпретаторов при разработке, и в настоящее время тестировать такое поведение затруднительно.

source: Enter Per-Module State
es_es: Introducir estado por módulo
pt_pt: Estado por Módulo
ru: Введите состояние каждого модуля

source: Instead of focusing on per-interpreter state, Python's C API is evolving to better support the more granular *per-module* state. This means that C-level data should be attached to a *module object*. Each interpreter creates its own module object, keeping the data separate. For testing the isolation, multiple module objects corresponding to a single extension can even be loaded in a single interpreter.
es_es: En lugar de centrarse en el estado por intérprete, la API C de Python está evolucionando para soportar mejor el estado más granular *por módulo*. Esto significa que los datos a nivel de C deben adjuntarse a un *objeto de módulo*. Cada intérprete crea su propio objeto módulo, manteniendo los datos separados. Para probar el aislamiento, incluso se pueden cargar varios objetos módulo correspondientes a una misma extensión en un único intérprete.

source: Per-module state provides an easy way to think about lifetime and resource ownership: the extension module will initialize when a module object is created, and clean up when it's freed. In this regard, a module is just like any other :c:expr:`PyObject *`; there are no "on interpreter shutdown" hooks to think—or forget—about.
es_es: El estado por módulo proporciona una forma sencilla de pensar sobre el tiempo de vida y la propiedad de los recursos: el módulo de extensión se inicializará cuando se cree un objeto de módulo, y se limpiará cuando se libere. En este sentido, un módulo es como cualquier otro :c:expr:`PyObject *`; no hay ganchos "al apagar el intérprete" en los que pensar -u olvidar-.
pt_pt: O estado por módulo fornece uma forma fácil de pensar sobre o ciclo de vida e a posse de recursos: o módulo de extensão será inicializado quando um objeto de módulo for criado, e será limpo quando for libertado. Neste aspeto, um módulo é apenas como qualquer outro :c:expr:`PyObject *`; não há "ganchos" de "desligar o interpretador" para pensar — ou esquecer.
ru: Состояние каждого модуля позволяет легко учитывать время жизни и владение ресурсами: модуль расширения инициализируется при создании объекта модуля и очищается при его освобождении. В этом отношении модуль ничем не отличается от любого другого :c:expr:`PyObject *`; нет никаких ловушек «при выключении интерпретатора», о которых нужно подумать или забыть.

source: Note that there are use cases for different kinds of "globals": per-process, per-interpreter, per-thread or per-task state. With per-module state as the default, these are still possible, but you should treat them as exceptional cases: if you need them, you should give them additional care and testing. (Note that this guide does not cover them.)
es_es: Ten en cuenta que existen casos de uso para diferentes tipos de "globales": por proceso, por intérprete, por hilo o por tarea. Con el estado por-módulo por defecto, éstos son todavía posibles, pero deberías tratarlos como casos excepcionales: si los necesitas, deberías darles un cuidado adicional y probarlos. (Tener en cuenta que esta guía no los cubre).
pt_pt: Note que existem casos de uso para diferentes tipos de "globais": por processo, por interpretador, por thread ou por tarefa. Com o estado por módulo como padrão, estes ainda são possíveis, mas devem ser tratados como casos excecionais: se precisar deles, deve dedicar-lhes cuidados e testes adicionais. (Note que este guia não os aborda.)
ru: Обратите внимание, что существуют варианты использования различных типов «глобальных переменных»: состояние каждого процесса, каждого интерпретатора, каждого потока или состояния каждой задачи. Если состояние каждого модуля установлено по умолчанию, это все еще возможно, но к ним следует относиться как к исключительным случаям: если они вам нужны, вам следует уделить им дополнительный уход и тестирование. (Обратите внимание, что в этом руководстве они не рассматриваются.)

source: Isolated Module Objects
es_es: Módulos aislados
pt_pt: Objetos de Módulo Isolados
ru: Изолированные объекты модуля

source: The key point to keep in mind when developing an extension module is that several module objects can be created from a single shared library. For example:
es_es: El punto clave a tener en cuenta cuando se desarrolla un módulo de ampliación es que se pueden crear varios objetos de módulo a partir de una única biblioteca compartida. Por ejemplo:
pt_pt: O ponto-chave a ter em mente ao desenvolver um módulo de extensão é que vários objetos de módulo podem ser criados a partir de uma única biblioteca partilhada. Por exemplo:
ru: Ключевым моментом, который следует учитывать при разработке модуля расширения, является то, что несколько объектов модуля могут быть созданы из одной общей библиотеки. Например:

source: As a rule of thumb, the two modules should be completely independent. All objects and state specific to the module should be encapsulated within the module object, not shared with other module objects, and cleaned up when the module object is deallocated. Since this just is a rule of thumb, exceptions are possible (see `Managing Global State`_), but they will need more thought and attention to edge cases.
es_es: Como regla general, los dos módulos deben ser completamente independientes. Todos los objetos y estados específicos del módulo deben estar encapsulados dentro del objeto del módulo, no compartidos con otros objetos del módulo, y limpiados cuando el objeto del módulo es desasignado. Dado que esto es sólo una regla general, las excepciones son posibles (véase `Managing Global State`_), pero necesitarán más reflexión y atención a los casos extremos.
pt_pt: Como regra geral, os dois módulos devem ser completamente independentes. Todos os objetos e o estado específico do módulo devem estar encapsulados dentro do objeto de módulo, não partilhados com outros objetos de módulo, e limpos quando o objeto de módulo for desalocado. Como isto é apenas uma regra geral, exceções são possíveis (ver `Gerir Estado Global`_), mas exigirão mais reflexão e atenção aos casos limite.
ru: Как правило, два модуля должны быть полностью независимыми. Все объекты и состояние, специфичные для модуля, должны быть инкапсулированы внутри объекта модуля, не использоваться совместно с другими объектами модуля и очищаться при освобождении объекта модуля. Поскольку это всего лишь эмпирическое правило, возможны исключения (см. «Управление глобальным состоянием»), но для крайних случаев потребуется больше внимания и внимания.

source: While some modules could do with less stringent restrictions, isolated modules make it easier to set clear expectations and guidelines that work across a variety of use cases.
es_es: Aunque algunos módulos podrían tener restricciones menos estrictas, los módulos aislados facilitan el establecimiento de expectativas y directrices claras que funcionen en diversos casos de uso.
pt_pt: Embora alguns módulos possam funcionar com restrições menos rigorosas, os módulos isolados facilitam o estabelecimento de expectativas e diretrizes claras que funcionam em diversos casos de uso.
ru: Хотя для некоторых модулей можно было бы использовать менее строгие ограничения, изолированные модули упрощают установление четких ожиданий и рекомендаций, которые подходят для различных вариантов использования.

source: Surprising Edge Cases
es_es: Casos sorprendentes
pt_pt: Casos Limite Surpreendentes
ru: Неожиданные крайние случаи

source: Note that isolated modules do create some surprising edge cases. Most notably, each module object will typically not share its classes and exceptions with other similar modules. Continuing from the `example above <Isolated Module Objects_>`__, note that ``old_binascii.Error`` and ``binascii.Error`` are separate objects. In the following code, the exception is *not* caught:
es_es: Tenga en cuenta que los módulos aislados crean algunos casos sorprendentes. En particular, cada objeto de módulo no compartirá sus clases y excepciones con otros módulos similares. Continuando con el `ejemplo anterior <Isolated Module Objects_>`__, observe que ``old_binascii.Error`` y ``binascii.Error`` son objetos separados. En el siguiente código, la excepción *no* es capturada:
pt_pt: Note que os módulos isolados criam alguns casos limite surpreendentes. Mais notavelmente, cada objeto de módulo normalmente não partilha as suas classes e exceções com outros módulos semelhantes. Continuando a partir do `exemplo acima <Isolated Module Objects_>`__, note que ``old_binascii.Error`` e ``binascii.Error`` são objetos separados. No código seguinte, a exceção *não* é capturada:
ru: Обратите внимание, что изолированные модули создают некоторые неожиданные крайние случаи. В частности, каждый объект модуля обычно не разделяет свои классы и исключения с другими аналогичными модулями. Продолжая приведенный выше пример <Изолированные объекты модуля_>`__, обратите внимание, что ``old_binascii.Error`` и ``binascii.Error`` являются отдельными объектами. В следующем коде исключение *не* перехватывается:

source: >>> old_binascii.Error == binascii.Error False >>> try: ... old_binascii.unhexlify(b'qwertyuiop') ... except binascii.Error: ... print('boo') ... Traceback (most recent call last): File "<stdin>", line 2, in <module> binascii.Error: Non-hexadecimal digit found
es_es: >>> old_binascii.Error == binascii.Error False >>> try: ... old_binascii.unhexlify(b'qwertyuiop') ... except binascii.Error: ... print('boo') ... Traceback (última llamada más reciente): File "<stdin>", line 2, in <module> binascii.Error: Se ha encontrado un dígito no hexadecimal

source: This is expected. Notice that pure-Python modules behave the same way: it is a part of how Python works.
es_es: Esto es lo esperado. Tenga en cuenta que los módulos puramente Python se comportan de la misma manera: es parte de cómo funciona Python.
pt_pt: Isto é esperado. Note que os módulos em Python puro se comportam da mesma forma: faz parte de como o Python funciona.
ru: Это ожидаемо. Обратите внимание, что модули на чистом Python ведут себя одинаково: это часть того, как работает Python.

source: The goal is to make extension modules safe at the C level, not to make hacks behave intuitively. Mutating ``sys.modules`` "manually" counts as a hack.
es_es: El objetivo es hacer que los módulos de extensión sean seguros en el nivel C, no hacer que los hacks se comporten intuitivamente. Mutar ``sys.modules`` "manualmente" cuenta como un hack.
pt_pt: O objetivo é tornar os módulos de extensão seguros ao nível de C, não fazer com que soluções alternativas se comportem de forma intuitiva. Modificar ``sys.modules`` "manualmente" conta como uma solução alternativa.
ru: Цель состоит в том, чтобы сделать модули расширения безопасными на уровне C, а не заставлять хаки вести себя интуитивно. Изменение ``sys.modules`` «вручную» считается взломом.

source: Making Modules Safe with Multiple Interpreters
es_es: Módulos seguros con varios intérpretes
pt_pt: Tornar Módulos Seguros com Múltiplos Interpretadores
ru: Обеспечение безопасности модулей с помощью нескольких интерпретаторов

source: Managing Global State
es_es: Gestión del Estado Global
pt_pt: Gerir Estado Global
ru: Управление глобальным состоянием

source: Sometimes, the state associated with a Python module is not specific to that module, but to the entire process (or something else "more global" than a module). For example:
es_es: A veces, el estado asociado a un módulo de Python no es específico de ese módulo, sino de todo el proceso (o de algo "más global" que un módulo). Por ejemplo:
pt_pt: Por vezes, o estado associado a um módulo Python não é específico desse módulo, mas sim de todo o processo (ou algo mais "global" do que um módulo). Por exemplo:
ru: Иногда состояние, связанное с модулем Python, относится не к этому модулю, а ко всему процессу (или к чему-то еще, «более глобальному», чем модуль). Например:

source: The ``readline`` module manages *the* terminal.
es_es: El módulo ``readline`` gestiona *el* terminal.
pt_pt: O módulo ``readline`` gere *o* terminal.
ru: Модуль ``readline`` управляет *терминалом*.

source: A module running on a circuit board wants to control *the* on-board LED.
es_es: Un módulo que se ejecuta en una placa de circuito quiere controlar *el* LED de a bordo.
pt_pt: Um módulo a executar numa placa de circuito quer controlar *o* LED da placa.
ru: Модуль, работающий на плате, хочет управлять встроенным светодиодом.

source: In these cases, the Python module should provide *access* to the global state, rather than *own* it. If possible, write the module so that multiple copies of it can access the state independently (along with other libraries, whether for Python or other languages). If that is not possible, consider explicit locking.
es_es: En estos casos, el módulo Python debería proporcionar *acceso* al estado global, en lugar de *poseerlo*. Si es posible, escribe el módulo de forma que múltiples copias de él puedan acceder al estado de forma independiente (junto con otras librerías, ya sean para Python u otros lenguajes). Si eso no es posible, considera el bloqueo explícito.
pt_pt: Nestes casos, o módulo Python deve fornecer *acesso* ao estado global, em vez de *ser dono* dele. Se possível, escreva o módulo de forma a que várias cópias possam aceder ao estado independentemente (juntamente com outras bibliotecas, quer para Python quer para outras linguagens). Se isso não for possível, considere o bloqueio explícito.
ru: В этих случаях модуль Python должен предоставлять *доступ* к глобальному состоянию, а не *владеть* им. Если возможно, напишите модуль так, чтобы несколько его копий могли независимо обращаться к состоянию (вместе с другими библиотеками, будь то для Python или других языков). Если это невозможно, рассмотрите возможность явной блокировки.
