Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/isolating-extensions.po
Languages: es_es, pt_pt, ru

source: Garbage-Collection Protocol
es_es: Protocolo de recogida de basura
pt_pt: Protocolo de Recolha de Lixo
ru: Протокол сбора мусора

source: Instances of heap types hold a reference to their type. This ensures that the type isn't destroyed before all its instances are, but may result in reference cycles that need to be broken by the garbage collector.
es_es: Las instancias de los tipos del montón mantienen una referencia a su tipo. Esto garantiza que el tipo no se destruya antes que todas sus instancias, pero puede dar lugar a ciclos de referencia que el recolector de basura debe romper.
pt_pt: As instâncias de tipos de heap mantêm uma referência ao seu tipo. Isto garante que o tipo não é destruído antes de todas as suas instâncias, mas pode resultar em ciclos de referência que precisam de ser quebrados pelo recolhedor de lixo.
ru: Экземпляры типов кучи содержат ссылку на свой тип. Это гарантирует, что тип не будет уничтожен до того, как будут уничтожены все его экземпляры, но может привести к ссылочным циклам, которые придется прерывать сборщику мусора.

source: To avoid memory leaks, instances of heap types must implement the garbage collection protocol. That is, heap types should:
es_es: Para evitar fugas de memoria, las instancias de tipos heap deben implementar el protocolo de recolección de basura. Es decir, los tipos heap deben:
pt_pt: Para evitar fugas de memória, as instâncias de tipos de heap devem implementar o protocolo de recolha de lixo. Ou seja, os tipos de heap devem:
ru: Чтобы избежать утечек памяти, экземпляры типов кучи должны реализовывать протокол сборки мусора. То есть типы кучи должны:

source: Have the :c:macro:`Py_TPFLAGS_HAVE_GC` flag.
es_es: Tener la bandera :c:macro:`Py_TPFLAGS_HAVE_GC`.
pt_pt: Ter a flag :c:macro:`Py_TPFLAGS_HAVE_GC`.
ru: Имейте флаг :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Define a traverse function using ``Py_tp_traverse``, which visits the type (e.g. using ``Py_VISIT(Py_TYPE(self))``).
es_es: Definir una función transversal utilizando ``Py_tp_traverse``, que visita el tipo (por ejemplo, utilizando ``Py_VISIT(Py_TYPE(self))``).
ru: Определите функцию обхода, используя Py_tp_traverse, которая посещает тип (например, используя Py_VISIT(Py_TYPE(self))).

source: Please refer to the documentation of :c:macro:`Py_TPFLAGS_HAVE_GC` and :c:member:`~PyTypeObject.tp_traverse` for additional considerations.
es_es: Por favor, ver la documentación de :c:macro:`Py_TPFLAGS_HAVE_GC` y :c:member:`~PyTypeObject.tp_traverse` para consideraciones adicionales.

source: The API for defining heap types grew organically, leaving it somewhat awkward to use in its current state. The following sections will guide you through common issues.
es_es: La API para definir tipos de montón ha crecido orgánicamente, por lo que su uso resulta algo complicado en su estado actual. Las siguientes secciones te guiarán a través de los problemas más comunes.
pt_pt: A API para definir tipos de heap cresceu organicamente, tornando-a um pouco desajeitada de usar no seu estado atual. As secções seguintes guiá-lo-ão através de problemas comuns.
ru: API для определения типов кучи развился органично, поэтому в его текущем состоянии его использовать несколько неудобно. Следующие разделы помогут вам разобраться с распространенными проблемами.

source: ``tp_traverse`` in Python 3.8 and lower
es_es: ``tp_traverse`` en Python 3.8 e inferiores
pt_pt: ``tp_traverse`` no Python 3.8 e versões anteriores
ru: ``tp_traverse`` в Python 3.8 и ниже

source: The requirement to visit the type from ``tp_traverse`` was added in Python 3.9. If you support Python 3.8 and lower, the traverse function must *not* visit the type, so it must be more complicated::
es_es: El requisito de visitar el tipo desde ``tp_traverse`` se añadió en Python 3.9. Si soporta Python 3.8 e inferiores, la función traverse debe *no* visitar el tipo, por lo que debe ser más complicada::
pt_pt: O requisito para visitar o tipo a partir de ``tp_traverse`` foi adicionado no Python 3.9. Se suportar o Python 3.8 e versões anteriores, a função de travessia *não* deve visitar o tipo, pelo que deve ser mais complicada::
ru: Требование посещения типа из tp_traverse было добавлено в Python 3.9. Если вы поддерживаете Python 3.8 и ниже, функция перемещения *не* должна обращаться к типу, поэтому она должна быть более сложной:

source: Unfortunately, :c:data:`Py_Version` was only added in Python 3.11. As a replacement, use:
es_es: Desafortunadamente, :c:data:`Py_Version` sólo se añadió en Python 3.11. Como reemplazo, usar:
pt_pt: Infelizmente, :c:data:`Py_Version` só foi adicionado no Python 3.11. Como substituto, use:
ru: К сожалению, :c:data:`Py_Version` был добавлен только в Python 3.11. В качестве замены используйте:

source: :c:macro:`PY_VERSION_HEX`, if not using the stable ABI, or
es_es: :c:macro:`PY_VERSION_HEX`, si no se utiliza la ABI estable, o
pt_pt: :c:macro:`PY_VERSION_HEX`, se não estiver a usar a ABI estável, ou
ru: :c:macro:`PY_VERSION_HEX`, если не используется стабильный ABI, или

source: :py:data:`sys.version_info` (via :c:func:`PySys_GetObject` and :c:func:`PyArg_ParseTuple`).
es_es: :py:data:`sys.version_info` (vía :c:func:`PySys_GetObject` y :c:func:`PyArg_ParseTuple`).
pt_pt: :py:data:`sys.version_info` (através de :c:func:`PySys_GetObject` e :c:func:`PyArg_ParseTuple`).

source: Delegating ``tp_traverse``
es_es: Delegar ``tp_traverse``
pt_pt: Delegar ``tp_traverse``
ru: Делегирование ``tp_traverse``

source: If your traverse function delegates to the :c:member:`~PyTypeObject.tp_traverse` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only heap type are expected to visit the type in ``tp_traverse``.
es_es: Si su función traverse delega en :c:member:`~PyTypeObject.tp_traverse` de su clase base (u otro tipo), asegúrese de que ``Py_TYPE(self)`` se visita sólo una vez. Tenga en cuenta que sólo se espera que los tipos del montón visiten el tipo en ``tp_traverse``.
pt_pt: Se a sua função de travessia delegar para o :c:member:`~PyTypeObject.tp_traverse` da sua classe base (ou outro tipo), certifique-se de que ``Py_TYPE(self)`` é visitado apenas uma vez. Note que apenas os tipos de heap são esperados visitar o tipo em ``tp_traverse``.
ru: Если ваша функция перемещения делегирует :c:member:`~PyTypeObject.tp_traverse` своего базового класса (или другого типа), убедитесь, что ``Py_TYPE(self)`` посещается только один раз. Обратите внимание, что только тип кучи должен посещать тип в tp_traverse.

source: For example, if your traverse function includes::
es_es: Por ejemplo, si la función traverse incluye::
pt_pt: Por exemplo, se a sua função de travessia incluir::
ru: Например, если ваша функция перемещения включает в себя::

source: ...and ``base`` may be a static type, then it should also include::
es_es: ...y ``base`` puede ser un tipo estático, entonces también debería incluir::
pt_pt: ...e se ``base`` for um tipo estático, então também deve incluir::
ru: ...и ``base`` может быть статическим типом, тогда он также должен включать::

source: It is not necessary to handle the type's reference count in :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_clear`.
es_es: No es necesario manejar el recuento de referencias del tipo en :c:member:`~PyTypeObject.tp_new` y :c:member:`~PyTypeObject.tp_clear`.
pt_pt: Não é necessário lidar com a contagem de referências do tipo em :c:member:`~PyTypeObject.tp_new` e :c:member:`~PyTypeObject.tp_clear`.
ru: Нет необходимости обрабатывать счетчик ссылок типа в :c:member:`~PyTypeObject.tp_new` и :c:member:`~PyTypeObject.tp_clear`.

source: Defining ``tp_dealloc``
es_es: Definición de ``tp_dealloc``
pt_pt: Definir ``tp_dealloc``
ru: Определение ``tp_dealloc``

source: If your type has a custom :c:member:`~PyTypeObject.tp_dealloc` function, it needs to:
es_es: Si su tipo tiene una función personalizada :c:member:`~PyTypeObject.tp_dealloc`, es necesario:
pt_pt: Se o seu tipo tiver uma função :c:member:`~PyTypeObject.tp_dealloc` personalizada, esta precisa de:
ru: Если у вашего типа есть пользовательская функция :c:member:`~PyTypeObject.tp_dealloc`, ему необходимо:

source: call :c:func:`PyObject_GC_UnTrack` before any fields are invalidated, and
es_es: llamar a :c:func:`PyObject_GC_UnTrack` antes de que se invalide ningún campo, y
pt_pt: chamar :c:func:`PyObject_GC_UnTrack` antes que quaisquer campos sejam invalidados, e
ru: вызовите :c:func:`PyObject_GC_UnTrack` перед тем, как какие-либо поля станут недействительными, и

source: decrement the reference count of the type.
es_es: disminuye la cuenta de referencia del tipo.
pt_pt: decrementar a contagem de referências do tipo.
ru: уменьшить счетчик ссылок типа.

source: To keep the type valid while ``tp_free`` is called, the type's refcount needs to be decremented *after* the instance is deallocated. For example::
es_es: Para mantener el tipo válido mientras se llama a ``tp_free``, el refcount del tipo necesita ser decrementado *después* de que la instancia sea desasignada. Por ejemplo::
pt_pt: Para manter o tipo válido enquanto ``tp_free`` é chamado, a contagem de referências do tipo precisa de ser decrementada *depois* de a instância ser desalocada. Por exemplo::
ru: Чтобы тип оставался действительным во время вызова ``tp_free``, счетчик ссылок типа должен быть уменьшен *после* освобождения экземпляра. Например::

source: The default ``tp_dealloc`` function does this, so if your type does *not* override ``tp_dealloc`` you don't need to add it.
es_es: La función por defecto ``tp_dealloc`` hace esto, así que si tu tipo *no* anula ``tp_dealloc`` no necesitas añadirla.
pt_pt: A função ``tp_dealloc`` padrão faz isto, por isso, se o seu tipo *não* substituir ``tp_dealloc`` não precisa de a adicionar.
ru: Это делает функция по умолчанию ``tp_dealloc``, поэтому, если ваш тип *не* переопределяет ``tp_dealloc``, вам не нужно ее добавлять.

source: Not overriding ``tp_free``
es_es: No anular ``tp_free``
pt_pt: Não substituir ``tp_free``
ru: Не переопределять ``tp_free``

source: The :c:member:`~PyTypeObject.tp_free` slot of a heap type must be set to :c:func:`PyObject_GC_Del`. This is the default; do not override it.
es_es: La ranura :c:member:`~PyTypeObject.tp_free` de un tipo de montón debe establecerse en :c:func:`PyObject_GC_Del`. Este es el valor predeterminado; no lo anule.
pt_pt: O slot :c:member:`~PyTypeObject.tp_free` de um tipo de heap deve ser definido para :c:func:`PyObject_GC_Del`. Este é o valor padrão; não o substitua.
ru: Слот :c:member:`~PyTypeObject.tp_free` типа кучи должен быть установлен в :c:func:`PyObject_GC_Del`. Это значение по умолчанию; не переопределяйте его.

source: Avoiding ``PyObject_New``
es_es: Evitar ``PyObject_New``
pt_pt: Evitar ``PyObject_New``
ru: Избегание ``PyObject_New``

source: GC-tracked objects need to be allocated using GC-aware functions.
es_es: Los objetos rastreados por GC deben asignarse utilizando funciones que tengan en cuenta la GC.
pt_pt: Objetos rastreados pelo GC precisam de ser alocados usando funções conscientes do GC.
ru: Объекты, отслеживаемые GC, необходимо выделять с помощью функций, поддерживающих GC.

source: If you use use :c:func:`PyObject_New` or :c:func:`PyObject_NewVar`:
es_es: Si utiliza :c:func:`PyObject_New` o :c:func:`PyObject_NewVar`:
ru: Если вы используете, используйте :c:func:`PyObject_New` или :c:func:`PyObject_NewVar`:

source: Get and call type's :c:member:`~PyTypeObject.tp_alloc` slot, if possible. That is, replace ``TYPE *o = PyObject_New(TYPE, typeobj)`` with::
es_es: Obtenga y llame a la ranura :c:member:`~PyTypeObject.tp_alloc` del tipo, si es posible. Es decir, sustituir ``TYPE *o = PyObject_New(TYPE, typeobj)`` por::
pt_pt: Obtenha e chame o slot :c:member:`~PyTypeObject.tp_alloc` do tipo, se possível. Ou seja, substitua ``TYPE *o = PyObject_New(TYPE, typeobj)`` por::
ru: Получите и вызовите слот типа :c:member:`~PyTypeObject.tp_alloc`, если это возможно. То есть замените ``TYPE *o = PyObject_New(TYPE, typeobj)`` на::

source: Replace ``o = PyObject_NewVar(TYPE, typeobj, size)`` with the same, but use size instead of the 0.
es_es: Sustituya ``o = PyObject_NewVar(TYPE, typeobj, size)`` por lo mismo, pero utilice el tamaño en lugar del 0.
pt_pt: Substitua ``o = PyObject_NewVar(TYPE, typeobj, size)`` pelo mesmo, mas use size em vez de 0.
ru: Замените ``o = PyObject_NewVar(TYPE, typeobj, size)`` на то же самое, но используйте размер вместо 0.

source: If the above is not possible (e.g. inside a custom ``tp_alloc``), call :c:func:`PyObject_GC_New` or :c:func:`PyObject_GC_NewVar`::
es_es: Si lo anterior no es posible (por ejemplo, dentro de un ``tp_alloc`` personalizado), llame a :c:func:`PyObject_GC_New` o :c:func:`PyObject_GC_NewVar`::
pt_pt: Se o acima não for possível (por exemplo, dentro de um ``tp_alloc`` personalizado), chame :c:func:`PyObject_GC_New` ou :c:func:`PyObject_GC_NewVar`::
ru: Если вышеуказанное невозможно (например, внутри пользовательского ``tp_alloc``), вызовите :c:func:`PyObject_GC_New` или :c:func:`PyObject_GC_NewVar`::

source: Module State Access from Classes
es_es: Acceso al estado de los módulos desde las clases
pt_pt: Acesso ao Estado do Módulo a partir de Classes
ru: Доступ к состоянию модуля из классов

source: If you have a type object defined with :c:func:`PyType_FromModuleAndSpec`, you can call :c:func:`PyType_GetModule` to get the associated module, and then :c:func:`PyModule_GetState` to get the module's state.
es_es: Si tiene un objeto de tipo definido con :c:func:`PyType_FromModuleAndSpec`, puede llamar a :c:func:`PyType_GetModule` para obtener el módulo asociado, y luego a :c:func:`PyModule_GetState` para obtener el estado del módulo.
pt_pt: Se tiver um objeto de tipo definido com :c:func:`PyType_FromModuleAndSpec`, pode chamar :c:func:`PyType_GetModule` para obter o módulo associado, e depois :c:func:`PyModule_GetState` para obter o estado do módulo.
ru: Если у вас есть объект типа, определенный с помощью :c:func:`PyType_FromModuleAndSpec`, вы можете вызвать :c:func:`PyType_GetModule`, чтобы получить связанный модуль, а затем :c:func:`PyModule_GetState`, чтобы получить состояние модуля.

source: To save a some tedious error-handling boilerplate code, you can combine these two steps with :c:func:`PyType_GetModuleState`, resulting in::
es_es: Para ahorrar un poco de tedioso código repetitivo de gestión de errores, puede combinar estos dos pasos con :c:func:`PyType_GetModuleState`, lo que resulta en::
pt_pt: Para poupar algum código repetitivo de tratamento de erros, pode combinar estes dois passos com :c:func:`PyType_GetModuleState`, resultando em::
ru: Чтобы сэкономить утомительный шаблонный код обработки ошибок, вы можете объединить эти два шага с :c:func:`PyType_GetModuleState`, в результате чего:

source: Module State Access from Regular Methods
es_es: Acceso al estado del módulo desde métodos regulares
pt_pt: Acesso ao Estado do Módulo a partir de Métodos Regulares
ru: Доступ к состоянию модуля из обычных методов

source: Accessing the module-level state from methods of a class is somewhat more complicated, but is possible thanks to API introduced in Python 3.9. To get the state, you need to first get the *defining class*, and then get the module state from it.
es_es: Acceder al estado a nivel de módulo desde los métodos de una clase es algo más complicado, pero es posible gracias a la API introducida en Python 3.9. Para obtener el estado, primero hay que obtener la *clase definidora*, y luego obtener de ella el estado del módulo.
pt_pt: Aceder ao estado ao nível do módulo a partir de métodos de uma classe é um pouco mais complicado, mas é possível graças à API introduzida no Python 3.9. Para obter o estado, precisa primeiro obter a *classe de definição*, e depois obter o estado do módulo a partir dela.
ru: Доступ к состоянию уровня модуля из методов класса несколько сложнее, но возможен благодаря API, представленному в Python 3.9. Чтобы получить состояние, вам нужно сначала получить *определяющий класс*, а затем получить из него состояние модуля.

source: The largest roadblock is getting *the class a method was defined in*, or that method's "defining class" for short. The defining class can have a reference to the module it is part of.
es_es: El mayor obstáculo es obtener *la clase en la que se definió un método*, o la "clase definidora" de ese método para abreviar. La clase definidora puede tener una referencia al módulo del que forma parte.
pt_pt: O maior obstáculo é obter *a classe em que um método foi definido*, ou a "classe de definição" do método, em resumo. A classe de definição pode ter uma referência ao módulo do qual faz parte.
ru: Самым большим препятствием является получение *класса, в котором был определен метод*, или, для краткости, «определяющего класса» этого метода. Определяющий класс может иметь ссылку на модуль, частью которого он является.

source: Do not confuse the defining class with ``Py_TYPE(self)``. If the method is called on a *subclass* of your type, ``Py_TYPE(self)`` will refer to that subclass, which may be defined in different module than yours.
es_es: No confunda la clase definidora con ``Py_TYPE(self)``. Si el método se llama en una *subclase* de su tipo, ``Py_TYPE(self)`` se referirá a esa subclase, que puede estar definida en un módulo diferente al suyo.
pt_pt: Não confunda a classe de definição com ``Py_TYPE(self)``. Se o método for chamado numa *subclasse* do seu tipo, ``Py_TYPE(self)`` referir-se-á a essa subclasse, que pode estar definida num módulo diferente do seu.
ru: Не путайте определяющий класс с Py_TYPE(self)``. Если метод вызывается для *подкласса* вашего типа, ``Py_TYPE(self)`` будет ссылаться на этот подкласс, который может быть определен в другом модуле, отличном от вашего.

source: The following Python code can illustrate the concept. ``Base.get_defining_class`` returns ``Base`` even if ``type(self) == Sub``:
es_es: El siguiente código Python puede ilustrar el concepto. ``Base.get_defining_class`` devuelve ``Base`` aunque ``type(self) == Sub``:
pt_pt: O seguinte código Python pode ilustrar o conceito. ``Base.get_defining_class`` retorna ``Base`` mesmo que ``type(self) == Sub``:
ru: Следующий код Python может проиллюстрировать эту концепцию. ``Base.get_defining_class`` возвращает ``Base``, даже если ``type(self) == Sub``:

source: For a method to get its "defining class", it must use the :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>` :c:type:`calling convention <PyMethodDef>` and the corresponding :c:type:`PyCMethod` signature::
es_es: Para que un método obtenga su "clase definitoria", debe utilizar la :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>` :c:type:`calling convention <PyMethodDef>` y la correspondiente firma :c:type:`PyCMethod`::
pt_pt: Para um método obter a sua "classe de definição", deve usar a :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>` :c:type:`convenção de chamada <PyMethodDef>` e a assinatura :c:type:`PyCMethod` correspondente::
ru: Чтобы метод получил свой «определяющий класс», он должен использовать :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>` :c:type:`соглашение о вызовах <PyMethodDef>` и соответствующая сигнатура :c:type:`PyCMethod`::

source: PyObject *PyCMethod( PyObject *self, // object the method was called on PyTypeObject *defining_class, // defining class PyObject *const *args, // C array of arguments Py_ssize_t nargs, // length of "args" PyObject *kwnames) // NULL, or dict of keyword arguments
es_es: PyObject *PyCMethod( PyObject *self, // objeto sobre el que se ha llamado al método PyTypeObject *defining_class, // clase definidora PyObject *const *args, // matriz C de argumentos Py_ssize_t nargs, // longitud de "args PyObject *kwnames) // NULL, o dict de argumentos de palabras clave

source: Once you have the defining class, call :c:func:`PyType_GetModuleState` to get the state of its associated module.
es_es: Una vez que tengas la clase definidora, llama a :c:func:`PyType_GetModuleState` para obtener el estado de su módulo asociado.
pt_pt: Uma vez que tenha a classe de definição, chame :c:func:`PyType_GetModuleState` para obter o estado do módulo associado.
ru: Получив определяющий класс, вызовите :c:func:`PyType_GetModuleState`, чтобы получить состояние связанного с ним модуля.

source: For example::
es_es: Por ejemplo::
pt_pt: Por exemplo::
ru: Например::

source: Module State Access from Slot Methods, Getters and Setters
es_es: Acceso al estado del módulo desde métodos de ranura, Getters y Setters
pt_pt: Acesso ao Estado do Módulo a partir de Métodos de Slot, Getters e Setters
ru: Доступ к состоянию модуля из методов слота, геттеров и сеттеров

source: This is new in Python 3.11.
es_es: Esto es nuevo en Python 3.11.
pt_pt: Isto é novo no Python 3.11.
ru: Это новое в Python 3.11.

source: Slot methods—the fast C equivalents for special methods, such as :c:member:`~PyNumberMethods.nb_add` for :py:attr:`~object.__add__` or :c:member:`~PyTypeObject.tp_new` for initialization—have a very simple API that doesn't allow passing in the defining class, unlike with :c:type:`PyCMethod`. The same goes for getters and setters defined with :c:type:`PyGetSetDef`.
es_es: Los métodos de ranura -los equivalentes en C rápido de los métodos especiales, como :c:member:`~PyNumberMethods.nb_add` para :py:attr:`~object.__add__` o :c:member:`~PyTypeObject.tp_new` para la inicialización- tienen una API muy sencilla que no permite pasar la clase definidora, a diferencia de :c:type:`PyCMethod`. Lo mismo ocurre con los getters y setters definidos con :c:type:`PyGetSetDef`.
pt_pt: Métodos de slot — os equivalentes rápidos em C para métodos especiais, como :c:member:`~PyNumberMethods.nb_add` para :py:attr:`~object.__add__` ou :c:member:`~PyTypeObject.tp_new` para inicialização — têm uma API muito simples que não permite passar a classe de definição, ao contrário do que acontece com :c:type:`PyCMethod`. O mesmo se aplica a getters e setters definidos com :c:type:`PyGetSetDef`.
ru: Методы слота — быстрые эквиваленты C для специальных методов, таких как :c:member:`~PyNumberMethods.nb_add` для :py:attr:`~object.__add__` или :c:member:`~PyTypeObject.tp_new` для инициализации. — иметь очень простой API, который не позволяет передавать определяющий класс, в отличие от :c:type:`PyCMethod`. То же самое касается геттеров и сеттеров, определенных с помощью :c:type:`PyGetSetDef`.

source: To access the module state in these cases, use the :c:func:`PyType_GetModuleByDef` function, and pass in the module definition. Once you have the module, call :c:func:`PyModule_GetState` to get the state::
es_es: Para acceder al estado del módulo en estos casos, utilice la función :c:func:`PyType_GetModuleByDef`, y pase la definición del módulo. Una vez que tengas el módulo, llama a :c:func:`PyModule_GetState` para obtener el estado::
pt_pt: Para aceder ao estado do módulo nestes casos, use a função :c:func:`PyType_GetModuleByDef` e passe a definição do módulo. Uma vez que tenha o módulo, chame :c:func:`PyModule_GetState` para obter o estado::
ru: Чтобы получить доступ к состоянию модуля в этих случаях, используйте функцию :c:func:`PyType_GetModuleByDef` и передайте определение модуля. Получив модуль, вызовите :c:func:`PyModule_GetState`, чтобы получить состояние::
