Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/isolating-extensions.po
Languages: es_es, pt_pt, ru

source: :c:func:`!PyType_GetModuleByDef` works by searching the :term:`method resolution order` (i.e. all superclasses) for the first superclass that has a corresponding module.
es_es: :c:func:`!PyType_GetModuleByDef` funciona buscando en :term:`method resolution order` (es decir, en todas las superclases) la primera superclase que tenga un módulo correspondiente.
pt_pt: :c:func:`!PyType_GetModuleByDef` funciona pesquisando a :term:`ordem de resolução de métodos` (ou seja, todas as superclasses) pela primeira superclasse que tenha um módulo correspondente.
ru: :c:func:`!PyType_GetModuleByDef` работает путем поиска в :term:`порядке разрешения методов` (т.е. во всех суперклассах) первого суперкласса, имеющего соответствующий модуль.

source: In very exotic cases (inheritance chains spanning multiple modules created from the same definition), :c:func:`!PyType_GetModuleByDef` might not return the module of the true defining class. However, it will always return a module with the same definition, ensuring a compatible C memory layout.
es_es: En casos muy exóticos (cadenas de herencia que abarcan múltiples módulos creados a partir de la misma definición), :c:func:`!PyType_GetModuleByDef` podría no devolver el módulo de la verdadera clase definidora. Sin embargo, siempre devolverá un módulo con la misma definición, asegurando una disposición de memoria C compatible.
pt_pt: Em casos muito exóticos (cadeias de herança que abrangem vários módulos criados a partir da mesma definição), :c:func:`!PyType_GetModuleByDef` pode não retornar o módulo da verdadeira classe de definição. No entanto, sempre retornará um módulo com a mesma definição, garantindo um layout de memória C compatível.
ru: В очень экзотических случаях (цепочки наследования, охватывающие несколько модулей, созданных на основе одного и того же определения), :c:func:`!PyType_GetModuleByDef` может не вернуть модуль истинного определяющего класса. Однако он всегда будет возвращать модуль с тем же определением, обеспечивая совместимую структуру памяти C.

source: Lifetime of the Module State
es_es: Vida útil del módulo Estado
pt_pt: Tempo de Vida do Estado do Módulo
ru: Время жизни состояния модуля

source: When a module object is garbage-collected, its module state is freed. For each pointer to (a part of) the module state, you must hold a reference to the module object.
es_es: Cuando se recoge basura de un objeto de módulo, se libera su estado de módulo. Para cada puntero a (una parte de) el estado del módulo, debe mantener una referencia al objeto de módulo.
pt_pt: Quando um objeto de módulo é recolhido pelo garbage collector, o seu estado é libertado. Para cada ponteiro para (uma parte do) estado do módulo, deve manter uma referência ao objeto do módulo.
ru: Когда объект модуля подвергается сборке мусора, его состояние модуля освобождается. Для каждого указателя на состояние модуля (части) вы должны содержать ссылку на объект модуля.

source: Usually this is not an issue, because types created with :c:func:`PyType_FromModuleAndSpec`, and their instances, hold a reference to the module. However, you must be careful in reference counting when you reference module state from other places, such as callbacks for external libraries.
es_es: Normalmente esto no es un problema, porque los tipos creados con :c:func:`PyType_FromModuleAndSpec`, y sus instancias, mantienen una referencia al módulo. Sin embargo, debes ser cuidadoso en el conteo de referencias cuando hagas referencia al estado del módulo desde otros lugares, como callbacks para librerías externas.
pt_pt: Normalmente, isto não é um problema, porque os tipos criados com :c:func:`PyType_FromModuleAndSpec`, e as suas instâncias, mantêm uma referência ao módulo. No entanto, deve ter cuidado com a contagem de referências quando referenciar o estado do módulo a partir de outros locais, como callbacks para bibliotecas externas.
ru: Обычно это не проблема, поскольку типы, созданные с помощью :c:func:`PyType_FromModuleAndSpec`, и их экземпляры содержат ссылку на модуль. Однако вы должны быть осторожны при подсчете ссылок, когда вы ссылаетесь на состояние модуля из других мест, например, из обратных вызовов для внешних библиотек.

source: Open Issues
es_es: Cuestiones pendientes
pt_pt: Questões em Aberto
ru: Открытые вопросы

source: Several issues around per-module state and heap types are still open.
es_es: Siguen abiertas varias cuestiones sobre el estado por módulo y los tipos de montón.
pt_pt: Várias questões sobre o estado por módulo e tipos de heap ainda estão em aberto.
ru: Несколько вопросов, касающихся состояния каждого модуля и типов кучи, все еще остаются открытыми.

source: Discussions about improving the situation are best held on the `capi-sig mailing list <https://mail.python.org/mailman3/lists/capi-sig.python.org/>`__.
es_es: La mejor forma de mejorar la situación es debatirlo en la lista de correo `capi-sig <https://mail.python.org/mailman3/lists/capi-sig.python.org/>`__.
ru: Обсуждения улучшения ситуации лучше всего вести в списке рассылки capi-sig <https://mail.python.org/mailman3/lists/capi-sig.python.org/>`__.

source: Per-Class Scope
es_es: Ámbito por clase
pt_pt: Âmbito por Classe
ru: Область действия для каждого класса

source: It is currently (as of Python 3.11) not possible to attach state to individual *types* without relying on CPython implementation details (which may change in the future—perhaps, ironically, to allow a proper solution for per-class scope).
es_es: Actualmente (a partir de Python 3.11) no es posible adjuntar estado a *tipos* individuales sin depender de los detalles de implementación de CPython (que pueden cambiar en el futuro-quizás, irónicamente, para permitir una solución adecuada para el ámbito por clase).
pt_pt: Atualmente (a partir do Python 3.11), não é possível associar estado a *tipos* individuais sem depender de detalhes de implementação do CPython (que podem mudar no futuro — possivelmente, ironicamente, para permitir uma solução adequada para o âmbito por classe).
ru: В настоящее время (начиная с Python 3.11) невозможно прикрепить состояние к отдельным *типам*, не полагаясь на детали реализации CPython (которые могут измениться в будущем — возможно, по иронии судьбы, чтобы обеспечить правильное решение для области видимости каждого класса).

source: Lossless Conversion to Heap Types
es_es: Conversión sin pérdidas a tipos de montón
pt_pt: Conversão sem Perdas para Tipos de Heap
ru: Преобразование без потерь в типы кучи

source: The heap type API was not designed for "lossless" conversion from static types; that is, creating a type that works exactly like a given static type.
es_es: La API de tipos de montón no se diseñó para la conversión "sin pérdidas" a partir de tipos estáticos; es decir, para crear un tipo que funcione exactamente igual que un tipo estático dado.
pt_pt: A API de tipo de heap não foi concebida para uma conversão "sem perdas" a partir de tipos estáticos; ou seja, criar um tipo que funcione exatamente como um tipo estático dado.
ru: API типов кучи не был разработан для преобразования статических типов «без потерь»; то есть создание типа, который работает точно так же, как заданный статический тип.
