Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/isolating-extensions.po
Languages: es_es, pt_pt, ru

source: If it is necessary to use process-global state, the simplest way to avoid issues with multiple interpreters is to explicitly prevent a module from being loaded more than once per process—see `Opt-Out: Limiting to One Module Object per Process`_.
es_es: Si es necesario utilizar el estado global del proceso, la forma más sencilla de evitar problemas con múltiples intérpretes es evitar explícitamente que un módulo se cargue más de una vez por proceso-ver `Opt-Out: Limitación a un objeto módulo por proceso`_.
ru: Если необходимо использовать глобальное состояние процесса, самый простой способ избежать проблем с несколькими интерпретаторами — это явно запретить загрузку модуля более одного раза для каждого процесса — см. «Отказ от участия: ограничение одним объектом модуля на процесс». .

source: Managing Per-Module State
es_es: Gestión del estado por módulo
pt_pt: Gerir Estado por Módulo
ru: Управление состоянием каждого модуля

source: To use per-module state, use :ref:`multi-phase extension module initialization <multi-phase-initialization>`. This signals that your module supports multiple interpreters correctly.
es_es: Para utilizar el estado por módulo, utilice :ref:`multi-phase extension module initialization <multi-phase-initialization>`. Esto indica que su módulo soporta múltiples intérpretes correctamente.
pt_pt: Para usar o estado por módulo, utilize a :ref:`inicialização de módulo de extensão em várias fases <multi-phase-initialization>`. Isto sinaliza que o seu módulo suporta corretamente vários interpretadores.
ru: Чтобы использовать состояние каждого модуля, используйте :ref:`многофазную инициализацию модуля расширения <multi-phase-initialization>`. Это сигнализирует о том, что ваш модуль правильно поддерживает несколько интерпретаторов.

source: Set ``PyModuleDef.m_size`` to a positive number to request that many bytes of storage local to the module. Usually, this will be set to the size of some module-specific ``struct``, which can store all of the module's C-level state. In particular, it is where you should put pointers to classes (including exceptions, but excluding static types) and settings (e.g. ``csv``'s :py:data:`~csv.field_size_limit`) which the C code needs to function.
es_es: Establezca ``PyModuleDef.m_size`` en un número positivo para solicitar esa cantidad de bytes de almacenamiento local para el módulo. Por lo general, esto se establecerá en el tamaño de algún módulo específico ``struct``, que puede almacenar todo el estado de nivel C del módulo. En particular, es donde debe poner los punteros a clases (incluyendo excepciones, pero excluyendo tipos estáticos) y configuraciones (por ejemplo ``csv``'s :py:data:`~csv.field_size_limit`) que el código C necesita para funcionar.
pt_pt: Defina ``PyModuleDef.m_size`` para um número positivo para solicitar esse número de bytes de armazenamento local ao módulo. Normalmente, isto será definido para o tamanho de uma ``struct`` específica do módulo, que pode armazenar todo o estado do módulo ao nível de C. Em particular, é onde deve colocar ponteiros para classes (incluindo exceções, mas excluindo tipos estáticos) e definições (por exemplo, ``csv``'s :py:data:`~csv.field_size_limit`) que o código C precisa para funcionar.
ru: Установите для ``PyModuleDef.m_size`` положительное число, чтобы запросить такое количество байтов локального хранилища для модуля. Обычно для этого параметра устанавливается размер некоторой специфичной для модуля ``структуры``, которая может хранить все состояние модуля C-уровня. В частности, именно здесь вы должны поместить указатели на классы (включая исключения, но исключая статические типы) и настройки (например, :py:data:`~csv.field_size_limit````csv``), которые необходимы коду C. функция.

source: Another option is to store state in the module's ``__dict__``, but you must avoid crashing when users modify ``__dict__`` from Python code. This usually means error- and type-checking at the C level, which is easy to get wrong and hard to test sufficiently.
es_es: Otra opción es almacenar el estado en el módulo ``__dict__``, pero hay que evitar que se bloquee cuando los usuarios modifican ``__dict__`` desde código Python. Esto suele implicar la comprobación de errores y tipos a nivel de C, lo que es fácil de hacer mal y difícil de probar suficientemente.
pt_pt: Outra opção é armazenar o estado no ``__dict__`` do módulo, mas deve evitar falhas quando os utilizadores modificam ``__dict__`` a partir do código Python. Isto geralmente significa verificação de erros e tipos ao nível de C, o que é fácil de errar e difícil de testar suficientemente.
ru: Другой вариант — сохранить состояние в ``__dict__`` модуля, но вы должны избегать сбоев, когда пользователи изменяют ``__dict__`` из кода Python. Обычно это означает проверку ошибок и типов на уровне C, где легко ошибиться и сложно достаточно протестировать.

source: However, if module state is not needed in C code, storing it in ``__dict__`` only is a good idea.
es_es: Sin embargo, si el estado del módulo no es necesario en código C, almacenarlo sólo en ``__dict__`` es una buena idea.
pt_pt: No entanto, se o estado do módulo não for necessário no código C, armazená-lo apenas em ``__dict__`` é uma boa ideia.
ru: Однако, если состояние модуля не требуется в коде C, хорошей идеей будет хранить его только в ``__dict__``.

source: If the module state includes ``PyObject`` pointers, the module object must hold references to those objects and implement the module-level hooks ``m_traverse``, ``m_clear`` and ``m_free``. These work like ``tp_traverse``, ``tp_clear`` and ``tp_free`` of a class. Adding them will require some work and make the code longer; this is the price for modules which can be unloaded cleanly.
es_es: Si el estado del módulo incluye punteros ``PyObject``, el objeto del módulo debe mantener referencias a esos objetos e implementar los ganchos a nivel de módulo ``m_traverse``, ``m_clear`` y ``m_free``. Funcionan como ``tp_traverse``, ``tp_clear`` y ``tp_free`` de una clase. Añadirlos requerirá algo de trabajo y hará que el código sea más largo; este es el precio de los módulos que pueden descargarse limpiamente.
pt_pt: Se o estado do módulo incluir ponteiros ``PyObject``, o objeto do módulo deve manter referências a esses objetos e implementar os hooks ao nível do módulo ``m_traverse``, ``m_clear`` e ``m_free``. Estes funcionam como ``tp_traverse``, ``tp_clear`` e ``tp_free`` de uma classe. Adicioná-los exigirá algum trabalho e tornará o código mais longo; este é o preço para módulos que podem ser descarregados corretamente.
ru: Если состояние модуля включает указатели PyObject, объект модуля должен содержать ссылки на эти объекты и реализовывать перехватчики уровня модуля m_traverse, m_clear и m_free. Они работают как ``tp_traverse``, ``tp_clear`` и ``tp_free`` класса. Их добавление потребует некоторой работы и сделает код длиннее; это цена модулей, которые можно аккуратно выгрузить.

source: An example of a module with per-module state is currently available as `xxlimited <https://github.com/python/cpython/blob/master/Modules/xxlimited.c>`__; example module initialization shown at the bottom of the file.
es_es: Un ejemplo de módulo con estado por módulo está disponible actualmente como `xxlimited <https://github.com/python/cpython/blob/master/Modules/xxlimited.c>`__; ejemplo de inicialización de módulo que se muestra al final del archivo.
pt_pt: Um exemplo de um módulo com estado por módulo está atualmente disponível como `xxlimited <https://github.com/python/cpython/blob/master/Modules/xxlimited.c>`__; a inicialização do módulo de exemplo é mostrada no final do ficheiro.
ru: Пример модуля с состоянием для каждого модуля в настоящее время доступен как `xxlimited <https://github.com/python/cpython/blob/master/Modules/xxlimited.c>`__; пример инициализации модуля показан внизу файла.

source: Opt-Out: Limiting to One Module Object per Process
es_es: Opt-Out: Limitación a un objeto de módulo por proceso
pt_pt: Exclusão Voluntária: Limitar a Um Objeto de Módulo por Processo
ru: Отказ: ограничение одним объектом модуля на процесс

source: A non-negative ``PyModuleDef.m_size`` signals that a module supports multiple interpreters correctly. If this is not yet the case for your module, you can explicitly make your module loadable only once per process. For example::
es_es: Un ``PyModuleDef.m_size`` no negativo indica que un módulo admite varios intérpretes correctamente. Si éste no es todavía el caso de su módulo, puede hacer explícitamente que su módulo sólo se pueda cargar una vez por proceso. Por ejemplo::
pt_pt: Um ``PyModuleDef.m_size`` não negativo sinaliza que um módulo suporta corretamente vários interpretadores. Se este ainda não for o caso do seu módulo, pode tornar explicitamente o seu módulo carregável apenas uma vez por processo. Por exemplo::
ru: Неотрицательное значение PyModuleDef.m_size сигнализирует о том, что модуль правильно поддерживает несколько интерпретаторов. Если для вашего модуля это еще не так, вы можете явно сделать модуль загружаемым только один раз для каждого процесса. Например::

source: static int loaded = 0; static int exec_module(PyObject* module) { if (loaded) { PyErr_SetString(PyExc_ImportError, "cannot load module more than once per process"); return -1; } loaded = 1; // ... rest of initialization }
es_es: static int loaded = 0; static int exec_module(PyObject* module) { if (loaded) { PyErr_SetString(PyExc_ImportError, "no se puede cargar el módulo más de una vez por proceso"); return -1; } loaded = 1; // ... rest of initialization }

source: Module State Access from Functions
es_es: Acceso al estado del módulo desde las funciones
pt_pt: Acesso ao Estado do Módulo a partir de Funções
ru: Доступ к состоянию модуля из функций

source: Accessing the state from module-level functions is straightforward. Functions get the module object as their first argument; for extracting the state, you can use ``PyModule_GetState``::
es_es: Acceder al estado desde funciones a nivel de módulo es sencillo. Las funciones obtienen el objeto módulo como primer argumento; para extraer el estado, puede utilizar ``PyModule_GetState``::
pt_pt: Aceder ao estado a partir de funções ao nível do módulo é simples. As funções recebem o objeto do módulo como primeiro argumento; para extrair o estado, pode usar ``PyModule_GetState``::
ru: Доступ к состоянию из функций уровня модуля прост. Функции получают объект модуля в качестве первого аргумента; для извлечения состояния вы можете использовать PyModule_GetState::

source: ``PyModule_GetState`` may return ``NULL`` without setting an exception if there is no module state, i.e. ``PyModuleDef.m_size`` was zero. In your own module, you're in control of ``m_size``, so this is easy to prevent.
es_es: ``PyModule_GetState`` puede devolver ``NULL`` sin establecer una excepción si no hay estado del módulo, es decir, si ``PyModuleDef.m_size`` era cero. En tu propio módulo, tienes el control de ``m_size``, así que esto es fácil de prevenir.
pt_pt: ``PyModule_GetState`` pode retornar ``NULL`` sem definir uma exceção se não houver estado do módulo, ou seja, se ``PyModuleDef.m_size`` for zero. No seu próprio módulo, controla ``m_size``, por isso é fácil evitar isto.
ru: ``PyModule_GetState`` может возвращать ``NULL`` без установки исключения, если состояние модуля отсутствует, т.е. ``PyModuleDef.m_size`` было нулевым. В вашем собственном модуле вы управляете m_size, поэтому это легко предотвратить.

source: Heap Types
es_es: Tipos de montón
pt_pt: Tipos de Heap
ru: Типы кучи

source: Traditionally, types defined in C code are *static*; that is, ``static PyTypeObject`` structures defined directly in code and initialized using ``PyType_Ready()``.
es_es: Tradicionalmente, los tipos definidos en código C son *estáticos*; es decir, estructuras ``static PyTypeObject`` definidas directamente en el código e inicializadas mediante ``PyType_Ready()``.
pt_pt: Tradicionalmente, os tipos definidos em código C são *estáticos*; ou seja, estruturas ``static PyTypeObject`` definidas diretamente no código e inicializadas usando ``PyType_Ready()``.
ru: Традиционно типы, определенные в коде C, являются *статическими*; то есть статические структуры PyTypeObject, определенные непосредственно в коде и инициализируемые с помощью PyType_Ready().

source: Such types are necessarily shared across the process. Sharing them between module objects requires paying attention to any state they own or access. To limit the possible issues, static types are immutable at the Python level: for example, you can't set ``str.myattribute = 123``.
es_es: Tales tipos se comparten necesariamente a través del proceso. Compartirlos entre objetos del módulo requiere prestar atención a cualquier estado que posean o al que accedan. Para limitar los posibles problemas, los tipos estáticos son inmutables a nivel de Python: por ejemplo, no se puede establecer ``str.myattribute = 123``.
pt_pt: Tais tipos são necessariamente partilhados em todo o processo. Partilhá-los entre objetos de módulo requer atenção a qualquer estado que possuam ou acedam. Para limitar os possíveis problemas, os tipos estáticos são imutáveis ao nível do Python: por exemplo, não pode definir ``str.myattribute = 123``.
ru: Такие типы обязательно используются во всем процессе. Совместное использование их между объектами модуля требует внимания к любому состоянию, которым они владеют или к которому они имеют доступ. Чтобы ограничить возможные проблемы, статические типы являются неизменяемыми на уровне Python: например, вы не можете установить ``str.myattribute = 123``.

source: Sharing truly immutable objects between interpreters is fine, as long as they don't provide access to mutable objects. However, in CPython, every Python object has a mutable implementation detail: the reference count. Changes to the refcount are guarded by the GIL. Thus, code that shares any Python objects across interpreters implicitly depends on CPython's current, process-wide GIL.
es_es: Compartir objetos realmente inmutables entre intérpretes está bien, siempre y cuando no proporcionen acceso a objetos mutables. Sin embargo, en CPython, cada objeto Python tiene un detalle de implementación mutable: la cuenta de referencias. Los cambios en el refcount están protegidos por el GIL. Así, el código que comparte cualquier objeto Python a través de intérpretes depende implícitamente del GIL actual de CPython.
pt_pt: Partilhar objetos verdadeiramente imutáveis entre interpretadores é aceitável, desde que não forneçam acesso a objetos mutáveis. No entanto, no CPython, todos os objetos Python têm um detalhe de implementação mutável: a contagem de referências. As alterações à contagem de referências são protegidas pelo GIL. Assim, o código que partilha quaisquer objetos Python entre interpretadores depende implicitamente do GIL atual do CPython, em todo o processo.
ru: Совместное использование действительно неизменяемых объектов между интерпретаторами — это нормально, если они не предоставляют доступ к изменяемым объектам. Однако в CPython каждый объект Python имеет изменяемую деталь реализации: счетчик ссылок. Изменения в счетчике ссылок защищены GIL. Таким образом, код, который совместно использует любые объекты Python в разных интерпретаторах, неявно зависит от текущего общепроцессного GIL CPython.

source: Because they are immutable and process-global, static types cannot access "their" module state. If any method of such a type requires access to module state, the type must be converted to a *heap-allocated type*, or *heap type* for short. These correspond more closely to classes created by Python's ``class`` statement.
es_es: Debido a que son inmutables y globales al proceso, los tipos estáticos no pueden acceder a "su" estado de módulo. Si cualquier método de un tipo de este tipo requiere acceso al estado del módulo, el tipo se debe convertir a un *tipo asignado a la pila*, o *tipo de pila* para abreviar. Éstos se corresponden más estrechamente con las clases creadas por la sentencia ``class`` de Python.
pt_pt: Por serem imutáveis e globais ao processo, os tipos estáticos não podem aceder ao estado do "seu" módulo. Se algum método de tal tipo necessitar de aceder ao estado do módulo, o tipo deve ser convertido para um *tipo alocado em heap*, ou *tipo de heap* em resumo. Estes correspondem mais de perto às classes criadas pela instrução ``class`` do Python.
ru: Поскольку статические типы являются неизменяемыми и глобальными для процесса, они не могут получить доступ к «своему» состоянию модуля. Если какой-либо метод такого типа требует доступа к состоянию модуля, этот тип должен быть преобразован в *тип, выделяемый в куче*, или для краткости *тип в куче*. Они более близко соответствуют классам, созданным оператором Python ``class``.

source: For new modules, using heap types by default is a good rule of thumb.
es_es: Para los nuevos módulos, el uso de tipos heap por defecto es una buena regla general.
pt_pt: Para novos módulos, usar tipos de heap por defeito é uma boa regra geral.
ru: Для новых модулей хорошим практическим правилом является использование типов кучи по умолчанию.

source: Changing Static Types to Heap Types
es_es: Cambio de tipos estáticos a tipos de montón
pt_pt: Mudar Tipos Estáticos para Tipos de Heap
ru: Изменение статических типов на типы кучи

source: Static types can be converted to heap types, but note that the heap type API was not designed for "lossless" conversion from static types—that is, creating a type that works exactly like a given static type. So, when rewriting the class definition in a new API, you are likely to unintentionally change a few details (e.g. pickleability or inherited slots). Always test the details that are important to you.
es_es: Los tipos estáticos pueden convertirse a tipos de montón, pero tenga en cuenta que la API de tipos de montón no se diseñó para la conversión "sin pérdidas" de tipos estáticos, es decir, para crear un tipo que funcione exactamente igual que un tipo estático dado. Por lo tanto, al reescribir la definición de la clase en una nueva API, es probable que cambie involuntariamente algunos detalles (p. ej., pickleability o ranuras heredadas). Pruebe siempre los detalles que consideres importantes.
pt_pt: Os tipos estáticos podem ser convertidos em tipos de heap, mas note que a API de tipo de heap não foi concebida para uma conversão "sem perdas" a partir de tipos estáticos — ou seja, criar um tipo que funcione exatamente como um tipo estático dado. Assim, ao reescrever a definição da classe numa nova API, é provável que altere involuntariamente alguns detalhes (por exemplo, a capacidade de serialização ou slots herdados). Teste sempre os detalhes que são importantes para si.
ru: Статические типы можно преобразовать в типы кучи, но учтите, что API типов кучи не был разработан для преобразования статических типов «без потерь», то есть создания типа, который работает точно так же, как заданный статический тип. Таким образом, при переписывании определения класса в новом API вы, скорее всего, непреднамеренно измените некоторые детали (например, возможность выбора или унаследованные слоты). Всегда проверяйте детали, которые важны для вас.

source: Watch out for the following two points in particular (but note that this is not a comprehensive list):
es_es: Prestar atención especial a los dos puntos siguientes (pero teniendo en cuenta que no se trata de una lista exhaustiva):
pt_pt: Atente especialmente aos seguintes dois pontos (mas note que esta não é uma lista exaustiva):
ru: Обратите особое внимание на следующие два пункта (но обратите внимание, что это не полный список):

source: Unlike static types, heap type objects are mutable by default. Use the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag to prevent mutability.
es_es: A diferencia de los tipos estáticos, los objetos de tipo heap son mutables por defecto. Utilizar la bandera :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` para evitar la mutabilidad.
pt_pt: Ao contrário dos tipos estáticos, os objetos de tipo de heap são mutáveis por defeito. Use a flag :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` para evitar a mutabilidade.
ru: В отличие от статических типов, объекты типа кучи по умолчанию изменяемы. Используйте флаг :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`, чтобы предотвратить изменчивость.

source: Heap types inherit :c:member:`~PyTypeObject.tp_new` by default, so it may become possible to instantiate them from Python code. You can prevent this with the :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flag.
es_es: Los tipos Heap heredan :c:member:`~PyTypeObject.tp_new` por defecto, por lo que puede llegar a ser posible instanciarlos desde código Python. Puedes evitarlo con la bandera :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`.
pt_pt: Os tipos de heap herdam :c:member:`~PyTypeObject.tp_new` por defeito, pelo que pode tornar-se possível instanciá-los a partir de código Python. Pode evitar isto com a flag :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`.
ru: Типы кучи по умолчанию наследуют :c:member:`~PyTypeObject.tp_new`, поэтому может стать возможным создать их экземпляры из кода Python. Вы можете предотвратить это с помощью флага :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`.

source: Defining Heap Types
es_es: Definición de tipos de montón
pt_pt: Definir Tipos de Heap
ru: Определение типов кучи

source: Heap types can be created by filling a :c:struct:`PyType_Spec` structure, a description or "blueprint" of a class, and calling :c:func:`PyType_FromModuleAndSpec` to construct a new class object.
es_es: Los tipos Heap pueden crearse rellenando una estructura :c:struct:`PyType_Spec`, una descripción o "plano" de una clase, y llamando a :c:func:`PyType_FromModuleAndSpec` para construir un nuevo objeto de clase.
pt_pt: Os tipos de heap podem ser criados preenchendo uma estrutura :c:struct:`PyType_Spec`, uma descrição ou "plano" de uma classe, e chamando :c:func:`PyType_FromModuleAndSpec` para construir um novo objeto de classe.
ru: Типы кучи могут быть созданы путем заполнения структуры :c:struct:`PyType_Spec`, описания или «чертежа» класса и вызова :c:func:`PyType_FromModuleAndSpec` для создания нового объекта класса.

source: Other functions, like :c:func:`PyType_FromSpec`, can also create heap types, but :c:func:`PyType_FromModuleAndSpec` associates the module with the class, allowing access to the module state from methods.
es_es: Otras funciones, como :c:func:`PyType_FromSpec`, también pueden crear tipos de montón, pero :c:func:`PyType_FromModuleAndSpec` asocia el módulo con la clase, permitiendo el acceso al estado del módulo desde los métodos.
pt_pt: Outras funções, como :c:func:`PyType_FromSpec`, também podem criar tipos de heap, mas :c:func:`PyType_FromModuleAndSpec` associa o módulo à classe, permitindo o acesso ao estado do módulo a partir de métodos.
ru: Другие функции, такие как :c:func:`PyType_FromSpec`, также могут создавать типы кучи, но :c:func:`PyType_FromModuleAndSpec` связывает модуль с классом, позволяя получить доступ к состоянию модуля из методов.

source: The class should generally be stored in *both* the module state (for safe access from C) and the module's ``__dict__`` (for access from Python code).
es_es: Por lo general, la clase debe almacenarse en *ambos* el estado del módulo (para un acceso seguro desde C) y el ``__dict__`` del módulo (para el acceso desde código Python).
pt_pt: A classe deve geralmente ser armazenada *tanto* no estado do módulo (para acesso seguro a partir de C) como no ``__dict__`` do módulo (para acesso a partir de código Python).
ru: Класс обычно должен храниться как в *состоянии* модуля (для безопасного доступа из C), так и в ``__dict__`` модуля (для доступа из кода Python).
