Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: pt_pt, ru

source: Backreferences in a pattern allow you to specify that the contents of an earlier capturing group must also be found at the current location in the string. For example, ``\1`` will succeed if the exact contents of group 1 can be found at the current position, and fails otherwise. Remember that Python's string literals also use a backslash followed by numbers to allow including arbitrary characters in a string, so be sure to use a raw string when incorporating backreferences in a RE.
pt_pt: As referências retroativas num padrão permitem-lhe especificar que o conteúdo de um grupo de captura anterior também deve ser encontrado na posição atual na cadeia de caracteres. Por exemplo, ``\1`` terá sucesso se o conteúdo exato do grupo 1 puder ser encontrado na posição atual, e falhará caso contrário. Lembre-se de que os literais de cadeias de caracteres do Python também usam uma barra invertida seguida de números para permitir a inclusão de caracteres arbitrários numa cadeia de caracteres, pelo que deve certificar-se de usar uma cadeia de caracteres bruta ao incorporar referências retroativas numa RE.
ru: Обратные ссылки в шаблоне позволяют указать, что содержимое более ранней группы захвата также должно быть найдено в текущем месте строки. Например, ``\1`` завершится успешно, если точное содержимое группы 1 можно найти в текущей позиции, и завершится неудачей в противном случае. Помните, что строковые литералы Python также используют обратную косую черту, за которой следуют цифры, чтобы разрешить включение произвольных символов в строку, поэтому обязательно используйте необработанную строку при включении обратных ссылок в RE.

source: For example, the following RE detects doubled words in a string. ::
pt_pt: Por exemplo, a seguinte RE deteta palavras duplicadas numa cadeia de caracteres. ::
ru: Например, следующий RE обнаруживает удвоенные слова в строке. ::

source: Backreferences like this aren't often useful for just searching through a string --- there are few text formats which repeat data in this way --- but you'll soon find out that they're *very* useful when performing string substitutions.
pt_pt: Referências retroativas como esta não são frequentemente úteis apenas para procurar numa cadeia de caracteres — existem poucos formatos de texto que repetem dados desta forma — mas descobrirá rapidamente que são *muito* úteis ao realizar substituições de cadeias de caracteres.
ru: Обратные ссылки, подобные этой, не часто полезны для простого поиска по строке --- существует несколько текстовых форматов, которые повторяют данные таким образом --- но вы скоро обнаружите, что они *очень* полезны при выполнении строковых замен. .

source: Non-capturing and Named Groups
pt_pt: Grupos Não Capturantes e Nomeados
ru: Незахватывающие и именованные группы

source: Elaborate REs may use many groups, both to capture substrings of interest, and to group and structure the RE itself. In complex REs, it becomes difficult to keep track of the group numbers. There are two features which help with this problem. Both of them use a common syntax for regular expression extensions, so we'll look at that first.
pt_pt: REs elaboradas podem usar muitos grupos, tanto para capturar subcadeias de caracteres de interesse, como para agrupar e estruturar a própria RE. Em REs complexas, torna-se difícil acompanhar os números dos grupos. Existem duas funcionalidades que ajudam com este problema. Ambas usam uma sintaxe comum para extensões de expressões regulares, pelo que vamos analisar isso primeiro.
ru: Сложные RE могут использовать множество групп как для захвата интересующих подстрок, так и для группировки и структурирования самого RE. В сложных RE становится сложно отслеживать номера групп. Есть две функции, которые помогают решить эту проблему. Оба они используют общий синтаксис для расширений регулярных выражений, поэтому сначала мы рассмотрим его.

source: Perl 5 is well known for its powerful additions to standard regular expressions. For these new features the Perl developers couldn't choose new single-keystroke metacharacters or new special sequences beginning with ``\`` without making Perl's regular expressions confusingly different from standard REs. If they chose ``&`` as a new metacharacter, for example, old expressions would be assuming that ``&`` was a regular character and wouldn't have escaped it by writing ``\&`` or ``[&]``.
pt_pt: O Perl 5 é bem conhecido pelas suas poderosas adições às expressões regulares padrão. Para estas novas funcionalidades, os desenvolvedores do Perl não podiam escolher novos metacaracteres de tecla única ou novas sequências especiais que começassem com ``\`` sem tornar as expressões regulares do Perl confusamente diferentes das REs padrão. Se tivessem escolhido ``&`` como um novo metacaractere, por exemplo, expressões antigas assumiriam que ``&`` era um caractere regular e não o teriam escapado escrevendo ``\&`` ou ``[&]``.
ru: Perl 5 хорошо известен своими мощными дополнениями к стандартным регулярным выражениям. Для этих новых функций разработчики Perl не могли выбирать новые метасимволы, нажимаемые одной клавишей, или новые специальные последовательности, начинающиеся с ``\``, не делая регулярные выражения Perl неотличимыми от стандартных RE. Например, если бы они выбрали ``&`` в качестве нового метасимвола, старые выражения предполагали бы, что ``&`` был обычным символом и не экранировал бы его, написав ``\&`` или ``[ &]``.

source: The solution chosen by the Perl developers was to use ``(?...)`` as the extension syntax. ``?`` immediately after a parenthesis was a syntax error because the ``?`` would have nothing to repeat, so this didn't introduce any compatibility problems. The characters immediately after the ``?`` indicate what extension is being used, so ``(?=foo)`` is one thing (a positive lookahead assertion) and ``(?:foo)`` is something else (a non-capturing group containing the subexpression ``foo``).
pt_pt: A solução escolhida pelos programadores Perl foi usar ``(?...)`` como sintaxe de extensão. ``?`` imediatamente após um parêntese era um erro de sintaxe porque o ``?`` não teria nada para repetir, portanto isso não introduziu nenhum problema de compatibilidade. Os caracteres imediatamente após o ``?`` indicam qual extensão está a ser usada, então ``(?=foo)`` é uma coisa (uma afirmação positiva de lookahead) e ``(?:foo)`` é outra coisa (um grupo não capturador contendo a subexpressão ``foo``).
ru: Решением, выбранным разработчиками Perl, было использование ``(?...)`` в качестве синтаксиса расширения. ``?`` сразу после скобки было синтаксической ошибкой, поскольку ``?`` нечего было бы повторять, поэтому это не создавало никаких проблем совместимости. Символы сразу после ``?`` указывают, какое расширение используется, поэтому ``(?=foo)`` — это одно (утверждение положительного просмотра вперед), а ``(?:foo)`` — это что-то другое ( группа без захвата, содержащая подвыражение ``foo``).

source: Python supports several of Perl's extensions and adds an extension syntax to Perl's extension syntax. If the first character after the question mark is a ``P``, you know that it's an extension that's specific to Python.
pt_pt: O Python suporta várias das extensões do Perl e adiciona uma sintaxe de extensão à sintaxe de extensão do Perl. Se o primeiro caractere após o ponto de interrogação for um ``P``, sabe que é uma extensão específica do Python.
ru: Python поддерживает несколько расширений Perl и добавляет синтаксис расширений к синтаксису расширений Perl. Если первым символом после вопросительного знака является ``P``, вы знаете, что это расширение, специфичное для Python.

source: Now that we've looked at the general extension syntax, we can return to the features that simplify working with groups in complex REs.
pt_pt: Agora que analisámos a sintaxe geral de extensão, podemos voltar às funcionalidades que simplificam o trabalho com grupos em REs complexas.
ru: Теперь, когда мы рассмотрели общий синтаксис расширений, мы можем вернуться к функциям, упрощающим работу с группами в сложных RE.

source: Sometimes you'll want to use a group to denote a part of a regular expression, but aren't interested in retrieving the group's contents. You can make this fact explicit by using a non-capturing group: ``(?:...)``, where you can replace the ``...`` with any other regular expression. ::
pt_pt: Às vezes, vai querer usar um grupo para denotar uma parte de uma expressão regular, mas não está interessado em recuperar o conteúdo do grupo. Pode tornar este facto explícito usando um grupo não capturante: ``(?:...)``, onde pode substituir o ``...`` por qualquer outra expressão regular. ::
ru: Иногда вам нужно использовать группу для обозначения части регулярного выражения, но вы не заинтересованы в получении содержимого группы. Вы можете сделать этот факт явным, используя группу без захвата: ``(?:...)``, где вы можете заменить ``...`` любым другим регулярным выражением. ::

source: Except for the fact that you can't retrieve the contents of what the group matched, a non-capturing group behaves exactly the same as a capturing group; you can put anything inside it, repeat it with a repetition metacharacter such as ``*``, and nest it within other groups (capturing or non-capturing). ``(?:...)`` is particularly useful when modifying an existing pattern, since you can add new groups without changing how all the other groups are numbered. It should be mentioned that there's no performance difference in searching between capturing and non-capturing groups; neither form is any faster than the other.
pt_pt: À exceção do facto de não poder recuperar o conteúdo do que o grupo correspondeu, um grupo não capturante comporta-se exatamente da mesma forma que um grupo capturante; pode colocar qualquer coisa dentro dele, repetir com um metacaractere de repetição como ``*``, e aninhá-lo dentro de outros grupos (capturantes ou não capturantes). ``(?:...)`` é particularmente útil ao modificar um padrão existente, uma vez que pode adicionar novos grupos sem alterar a forma como todos os outros grupos são numerados. Deve ser mencionado que não há diferença de desempenho na pesquisa entre grupos capturantes e não capturantes; nenhuma das formas é mais rápida do que a outra.
ru: За исключением того факта, что вы не можете получить содержимое того, что соответствует группе, группа без захвата ведет себя точно так же, как группа захвата; вы можете поместить внутрь него что угодно, повторить это с помощью метасимвола повторения, такого как ``*``, и вложить это в другие группы (с захватом или без захвата). ``(?:...)`` особенно полезен при изменении существующего шаблона, поскольку вы можете добавлять новые группы, не меняя нумерацию всех остальных групп. Следует отметить, что нет никакой разницы в производительности при поиске между захватывающими и не захватывающими группами; ни одна из форм не быстрее другой.

source: A more significant feature is named groups: instead of referring to them by numbers, groups can be referenced by a name.
pt_pt: Uma funcionalidade mais significativa são os grupos nomeados: em vez de se referir a eles por números, os grupos podem ser referenciados por um nome.
ru: Более важной особенностью являются именованные группы: вместо обращения к ним по номерам на группы можно ссылаться по имени.

source: The syntax for a named group is one of the Python-specific extensions: ``(?P<name>...)``. *name* is, obviously, the name of the group. Named groups behave exactly like capturing groups, and additionally associate a name with a group. The :ref:`match object <match-objects>` methods that deal with capturing groups all accept either integers that refer to the group by number or strings that contain the desired group's name. Named groups are still given numbers, so you can retrieve information about a group in two ways::
pt_pt: A sintaxe para um grupo nomeado é uma das extensões específicas do Python: ``(?P<name>...)``. *name* é, obviamente, o nome do grupo. Os grupos nomeados comportam-se exatamente como grupos capturantes e, adicionalmente, associam um nome a um grupo. Os métodos do :ref:`objeto de correspondência <match-objects>` que lidam com grupos capturantes aceitam inteiros que se referem ao grupo por número ou cadeias de caracteres que contêm o nome desejado do grupo. Os grupos nomeados ainda recebem números, pelo que pode recuperar informações sobre um grupo de duas formas::
ru: Синтаксис именованной группы — это одно из специфичных для Python расширений: ``(?P<name>...)``. *name* — это, очевидно, название группы. Именованные группы ведут себя точно так же, как группы записи, и дополнительно связывают имя с группой. Все методы :ref:`match object <match-objects>`, которые занимаются захватом групп, принимают либо целые числа, ссылающиеся на группу по номеру, либо строки, содержащие имя нужной группы. Именованным группам по-прежнему присваиваются номера, поэтому информацию о группе можно получить двумя способами:

source: Additionally, you can retrieve named groups as a dictionary with :meth:`~re.Match.groupdict`::
pt_pt: Adicionalmente, pode recuperar grupos nomeados como um dicionário com :meth:`~re.Match.groupdict`::
ru: Кроме того, вы можете получить именованные группы в виде словаря с помощью :meth:`~re.Match.groupdict`::

source: Named groups are handy because they let you use easily remembered names, instead of having to remember numbers. Here's an example RE from the :mod:`imaplib` module::
pt_pt: Os grupos nomeados são úteis porque permitem usar nomes facilmente memorizáveis, em vez de ter de recordar números. Aqui está um exemplo de RE do módulo :mod:`imaplib`::
ru: Именованные группы удобны, поскольку позволяют использовать легко запоминающиеся имена вместо необходимости запоминать числа. Вот пример RE из модуля :mod:`imaplib`::

source: It's obviously much easier to retrieve ``m.group('zonem')``, instead of having to remember to retrieve group 9.
pt_pt: É obviamente muito mais fácil recuperar ``m.group('zonem')``, em vez de ter de lembrar de recuperar o grupo 9.
ru: Очевидно, гораздо проще получить ``m.group('zonem')`` вместо того, чтобы помнить о получении группы 9.

source: The syntax for backreferences in an expression such as ``(...)\1`` refers to the number of the group. There's naturally a variant that uses the group name instead of the number. This is another Python extension: ``(?P=name)`` indicates that the contents of the group called *name* should again be matched at the current point. The regular expression for finding doubled words, ``\b(\w+)\s+\1\b`` can also be written as ``\b(?P<word>\w+)\s+(?P=word)\b``::
pt_pt: A sintaxe para referências retroativas numa expressão como ``(...)\1`` refere-se ao número do grupo. Existe naturalmente uma variante que usa o nome do grupo em vez do número. Esta é outra extensão do Python: ``(?P=name)`` indica que o conteúdo do grupo chamado *name* deve ser novamente correspondido no ponto atual. A expressão regular para encontrar palavras duplicadas, ``\b(\w+)\s+\1\b`` também pode ser escrita como ``\b(?P<word>\w+)\s+(?P=word)\b``::
ru: Синтаксис обратных ссылок в таких выражениях, как ``(...)\1``, относится к номеру группы. Естественно, существует вариант, в котором вместо номера используется имя группы. Это еще одно расширение Python: ``(?P=name)`` указывает, что содержимое группы с именем *name* должно снова сопоставляться в текущей точке. Регулярное выражение для поиска удвоенных слов ``\b(\w+)\s+\1\b`` также можно записать как ``\b(?P<word>\w+)\s+(?P=word) \b``::

source: Lookahead Assertions
pt_pt: Asserções de Antevisão
ru: Предварительные утверждения

source: Another zero-width assertion is the lookahead assertion. Lookahead assertions are available in both positive and negative form, and look like this:
pt_pt: Outra asserção de largura zero é a asserção de antevisão. As asserções de antevisão estão disponíveis tanto na forma positiva como negativa e têm este aspeto:
ru: Еще одно утверждение нулевой ширины — это утверждение просмотра вперед. Утверждения опережающего просмотра доступны как в положительной, так и в отрицательной форме и выглядят следующим образом:

source: Positive lookahead assertion. This succeeds if the contained regular expression, represented here by ``...``, successfully matches at the current location, and fails otherwise. But, once the contained expression has been tried, the matching engine doesn't advance at all; the rest of the pattern is tried right where the assertion started.
pt_pt: Asserção de antevisão positiva. Isto tem sucesso se a expressão regular contida, representada aqui por ``...``, corresponder com sucesso à localização atual, e falha caso contrário. No entanto, uma vez que a expressão contida foi tentada, o motor de correspondência não avança; o resto do padrão é tentado exatamente onde a asserção começou.
ru: Позитивное прогнозное утверждение. Это завершается успешно, если содержащееся в нем регулярное выражение, представленное здесь ``...``, успешно соответствует текущему местоположению, а в противном случае терпит неудачу. Но как только содержащееся выражение было опробовано, механизм сопоставления вообще не продвигается вперед; остальная часть шаблона проверяется прямо с того места, где началось утверждение.

source: Negative lookahead assertion. This is the opposite of the positive assertion; it succeeds if the contained expression *doesn't* match at the current position in the string.
pt_pt: Asserção de antevisão negativa. Isto é o oposto da asserção positiva; tem sucesso se a expressão contida *não* corresponder à posição atual na cadeia de caracteres.
ru: Утверждение отрицательного прогнозирования. Это противоположность положительному утверждению; он успешен, если содержащееся выражение *не* соответствует текущей позиции в строке.

source: To make this concrete, let's look at a case where a lookahead is useful. Consider a simple pattern to match a filename and split it apart into a base name and an extension, separated by a ``.``. For example, in ``news.rc``, ``news`` is the base name, and ``rc`` is the filename's extension.
pt_pt: Para tornar isto concreto, vamos analisar um caso em que uma antevisão é útil. Considere um padrão simples para corresponder a um nome de ficheiro e dividi-lo num nome base e numa extensão, separados por um ``.``. Por exemplo, em ``news.rc``, ``news`` é o nome base e ``rc`` é a extensão do nome do ficheiro.
ru: Чтобы прояснить это, давайте рассмотрим случай, когда просмотр вперед полезен. Рассмотрим простой шаблон для сопоставления имени файла и разделения его на базовое имя и расширение, разделенные символом ``.``. Например, в файле news.rc, news — это базовое имя, а rc — расширение имени файла.

source: The pattern to match this is quite simple:
pt_pt: O padrão para corresponder a isto é bastante simples:
ru: Шаблон, соответствующий этому, довольно прост:

source: Notice that the ``.`` needs to be treated specially because it's a metacharacter, so it's inside a character class to only match that specific character. Also notice the trailing ``$``; this is added to ensure that all the rest of the string must be included in the extension. This regular expression matches ``foo.bar`` and ``autoexec.bat`` and ``sendmail.cf`` and ``printers.conf``.
pt_pt: Note que o ``.`` precisa de ser tratado de forma especial porque é um metacaractere, pelo que está dentro de uma classe de caracteres para corresponder apenas a esse caractere específico. Note também o ``$`` final; isto é adicionado para garantir que todo o resto da cadeia de caracteres deve ser incluído na extensão. Esta expressão regular corresponde a ``foo.bar``, ``autoexec.bat``, ``sendmail.cf`` e ``printers.conf``.
ru: Обратите внимание, что ``.`` требует особого обращения, поскольку это метасимвол, поэтому он находится внутри класса символов и соответствует только этому конкретному символу. Также обратите внимание на завершающий ``$``; это добавляется для того, чтобы гарантировать, что вся остальная часть строки должна быть включена в расширение. Это регулярное выражение соответствует ``foo.bar``, ``autoexec.bat``, ``sendmail.cf`` и ``printers.conf``.

source: Now, consider complicating the problem a bit; what if you want to match filenames where the extension is not ``bat``? Some incorrect attempts:
pt_pt: Agora, considere complicar um pouco o problema; e se quiser corresponder a nomes de ficheiros em que a extensão não é ``bat``? Algumas tentativas incorretas:
ru: Теперь давайте немного усложним задачу; что, если вы хотите сопоставить имена файлов с расширением, отличным от «bat»? Некоторые неправильные попытки:

source: ``.*[.][^b].*$`` The first attempt above tries to exclude ``bat`` by requiring that the first character of the extension is not a ``b``. This is wrong, because the pattern also doesn't match ``foo.bar``.
ru: ``.*[.][^b].*$`` Первая попытка выше пытается исключить ``bat``, требуя, чтобы первый символ расширения не был ``b``. Это неправильно, потому что шаблон также не соответствует ``foo.bar``.

source: The expression gets messier when you try to patch up the first solution by requiring one of the following cases to match: the first character of the extension isn't ``b``; the second character isn't ``a``; or the third character isn't ``t``. This accepts ``foo.bar`` and rejects ``autoexec.bat``, but it requires a three-letter extension and won't accept a filename with a two-letter extension such as ``sendmail.cf``. We'll complicate the pattern again in an effort to fix it.
pt_pt: A expressão torna-se mais confusa quando tenta corrigir a primeira solução exigindo que um dos seguintes casos corresponda: o primeiro caractere da extensão não é ``b``; o segundo caractere não é ``a``; ou o terceiro caractere não é ``t``. Isto aceita ``foo.bar`` e rejeita ``autoexec.bat``, mas exige uma extensão de três letras e não aceitará um nome de ficheiro com uma extensão de duas letras como ``sendmail.cf``. Vamos complicar o padrão novamente num esforço para o corrigir.
ru: Выражение становится более запутанным, когда вы пытаетесь исправить первое решение, требуя совпадения одного из следующих случаев: первый символ расширения не ``b``; второй символ не ``а``; или третий символ не ``t``. Он принимает ``foo.bar`` и отклоняет ``autoexec.bat``, но требует трехбуквенного расширения и не принимает имя файла с двухбуквенным расширением, например ``sendmail.cf``. Мы снова усложним узор, пытаясь его исправить.

source: In the third attempt, the second and third letters are all made optional in order to allow matching extensions shorter than three characters, such as ``sendmail.cf``.
pt_pt: Na terceira tentativa, as segunda e terceira letras são todas tornadas opcionais para permitir a correspondência de extensões mais curtas do que três caracteres, como ``sendmail.cf``.
ru: В третьей попытке вторая и третья буквы становятся необязательными, чтобы обеспечить соответствие расширениям короче трех символов, например sendmail.cf.

source: The pattern's getting really complicated now, which makes it hard to read and understand. Worse, if the problem changes and you want to exclude both ``bat`` and ``exe`` as extensions, the pattern would get even more complicated and confusing.
pt_pt: O padrão está a ficar realmente complicado agora, o que torna difícil a sua leitura e compreensão. Pior ainda, se o problema mudar e quiser excluir tanto ``bat`` como ``exe`` como extensões, o padrão ficaria ainda mais complicado e confuso.
ru: Теперь узор становится очень сложным, что затрудняет его чтение и понимание. Хуже того, если проблема изменится и вы захотите исключить как расширения «bat», так и «exe», шаблон станет еще более сложным и запутанным.

source: A negative lookahead cuts through all this confusion:
pt_pt: Uma antevisão negativa corta com toda esta confusão:
ru: Отрицательный прогноз устраняет всю эту путаницу:
