Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: pt_pt, ru

source: Repetitions such as ``*`` are :dfn:`greedy`; when repeating a RE, the matching engine will try to repeat it as many times as possible. If later portions of the pattern don't match, the matching engine will then back up and try again with fewer repetitions.
pt_pt: Repetições como ``*`` são :dfn:`gananciosas`; ao repetir uma RE, o motor de correspondência tentará repeti-la o maior número de vezes possível. Se partes posteriores do padrão não corresponderem, o motor de correspondência retrocederá e tentará novamente com menos repetições.
ru: Повторения типа ``*`` являются :dfn:`жадными`; при повторении RE механизм сопоставления попытается повторить его столько раз, сколько возможно. Если последующие части шаблона не совпадают, механизм сопоставления выполнит резервное копирование и повторит попытку с меньшим количеством повторений.

source: A step-by-step example will make this more obvious. Let's consider the expression ``a[bcd]*b``. This matches the letter ``'a'``, zero or more letters from the class ``[bcd]``, and finally ends with a ``'b'``. Now imagine matching this RE against the string ``'abcbd'``.
pt_pt: Um exemplo passo a passo tornará isto mais óbvio. Vamos considerar a expressão ``a[bcd]*b``. Isto corresponde à letra ``'a'``, zero ou mais letras da classe ``[bcd]``, e termina finalmente com um ``'b'``. Agora imagine corresponder esta RE à cadeia de caracteres ``'abcbd'``.
ru: Пошаговый пример сделает это более очевидным. Давайте рассмотрим выражение ``a[bcd]*b``. Это соответствует букве ``'a'``, нулю или более букв из класса ``[bcd]`` и, наконец, заканчивается на ``'b'``. Теперь представьте, что это значение соответствует строке ``'abcbd'``.

source: Step
pt_pt: Passo
ru: Шаг

source: Matched
pt_pt: Correspondido
ru: Сопоставление

source: Explanation
pt_pt: Explicação
ru: Пояснение

source: The ``a`` in the RE matches.
pt_pt: O ``a`` na RE corresponde.
ru: Буква ``а`` в ответе совпадает.

source: The engine matches ``[bcd]*``, going as far as it can, which is to the end of the string.
pt_pt: O motor corresponde a ``[bcd]*``, avançando o máximo possível, que é até ao final da cadeia de caracteres.
ru: Движок сопоставляет `[bcd]*`, заходя так далеко, как только может, то есть до конца строки.

source: *Failure*
pt_pt: *Falha*
ru: *Неудача*

source: The engine tries to match ``b``, but the current position is at the end of the string, so it fails.
pt_pt: O motor tenta corresponder a ``b``, mas a posição atual está no final da cadeia de caracteres, pelo que falha.
ru: Движок пытается найти соответствие `b`, но текущая позиция находится в конце строки, поэтому он терпит неудачу.

source: Back up, so that ``[bcd]*`` matches one less character.
pt_pt: Retrocede, de forma a que ``[bcd]*`` corresponda a um caractere a menos.
ru: Сделайте резервную копию, чтобы ``[bcd]*`` соответствовало на один символ меньше.

source: Try ``b`` again, but the current position is at the last character, which is a ``'d'``.
pt_pt: Tenta ``b`` novamente, mas a posição atual está no último caractere, que é um ``'d'``.
ru: Попробуйте ``b`` еще раз, но текущая позиция находится на последнем символе, то есть ``'d'``.

source: Back up again, so that ``[bcd]*`` is only matching ``bc``.
pt_pt: Retrocede novamente, de forma a que ``[bcd]*`` corresponda apenas a ``bc``.
ru: Создайте резервную копию еще раз, чтобы ``[bcd]*`` соответствовал только ``bc``.

source: Try ``b`` again. This time the character at the current position is ``'b'``, so it succeeds.
pt_pt: Tenta ``b`` novamente. Desta vez, o caractere na posição atual é ``'b'``, pelo que tem sucesso.
ru: Попробуйте ``b`` еще раз. На этот раз символом в текущей позиции является ``'b'``, так что это удалось.

source: The end of the RE has now been reached, and it has matched ``'abcb'``. This demonstrates how the matching engine goes as far as it can at first, and if no match is found it will then progressively back up and retry the rest of the RE again and again. It will back up until it has tried zero matches for ``[bcd]*``, and if that subsequently fails, the engine will conclude that the string doesn't match the RE at all.
pt_pt: O final da RE foi agora atingido, e correspondeu a ``'abcb'``. Isto demonstra como o motor de correspondência avança o máximo possível inicialmente, e se nenhuma correspondência for encontrada, retrocederá progressivamente e tentará novamente o resto da RE repetidamente. Retrocederá até ter tentado zero correspondências para ``[bcd]*``, e se isso falhar posteriormente, o motor concluirá que a cadeia de caracteres não corresponde à RE.
ru: Достигнут конец RE, и он соответствует ``'abcb'``. Это демонстрирует, как механизм сопоставления сначала работает настолько далеко, насколько это возможно, и, если совпадение не найдено, он затем постепенно выполняет резервное копирование и повторяет остальную часть RE снова и снова. Он будет выполнять резервное копирование до тех пор, пока не будет проверено нулевое совпадение для ``[bcd]*``, и если впоследствии это не удастся, механизм придет к выводу, что строка вообще не соответствует RE.

source: Another repeating metacharacter is ``+``, which matches one or more times. Pay careful attention to the difference between ``*`` and ``+``; ``*`` matches *zero* or more times, so whatever's being repeated may not be present at all, while ``+`` requires at least *one* occurrence. To use a similar example, ``ca+t`` will match ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), but won't match ``'ct'``.
pt_pt: Outro metacaractere de repetição é ``+``, que corresponde uma ou mais vezes. Preste atenção à diferença entre ``*`` e ``+``; ``*`` corresponde *zero* ou mais vezes, pelo que o que está a ser repetido pode não estar presente, enquanto ``+`` requer pelo menos *uma* ocorrência. Usando um exemplo semelhante, ``ca+t`` corresponderá a ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``), mas não corresponderá a ``'ct'``.
ru: Другой повторяющийся метасимвол — ``+``, который соответствует один или несколько раз. Обратите особое внимание на разницу между ``*`` и ``+``; ``*`` соответствует *нолю* или более раз, поэтому все, что повторяется, может отсутствовать вообще, тогда как ``+`` требует хотя бы *одного* вхождения. Если использовать аналогичный пример, ``ca+t`` будет соответствовать ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), но не будет соответствовать ``'ct'``.

source: There are two more repeating operators or quantifiers. The question mark character, ``?``, matches either once or zero times; you can think of it as marking something as being optional. For example, ``home-?brew`` matches either ``'homebrew'`` or ``'home-brew'``.
pt_pt: Existem mais dois operadores ou quantificadores de repetição. O caractere de interrogação, ``?``, corresponde uma vez ou zero vezes; pode pensar nisto como algo opcional. Por exemplo, ``home-?brew`` corresponde a ``'homebrew'`` ou ``'home-brew'``.
ru: Есть еще два повторяющихся оператора или квантора. Символ вопросительного знака ``?`` соответствует либо один раз, либо ноль раз; вы можете думать об этом как о пометке чего-то как необязательного. Например, ``home-?brew`` соответствует либо ``homebrew'``, либо ``'home-brew'``.

source: The most complicated quantifier is ``{m,n}``, where *m* and *n* are decimal integers. This quantifier means there must be at least *m* repetitions, and at most *n*. For example, ``a/{1,3}b`` will match ``'a/b'``, ``'a//b'``, and ``'a///b'``. It won't match ``'ab'``, which has no slashes, or ``'a////b'``, which has four.
pt_pt: O quantificador mais complicado é ``{m,n}``, onde *m* e *n* são inteiros decimais. Este quantificador significa que deve haver pelo menos *m* repetições, e no máximo *n*. Por exemplo, ``a/{1,3}b`` corresponderá a ``'a/b'``, ``'a//b'`` e ``'a///b'``. Não corresponderá a ``'ab'``, que não tem barras, ou ``'a////b'``, que tem quatro.
ru: Самый сложный квантификатор — это ``{m,n}``, где *m* и *n* — десятичные целые числа. Этот квантификатор означает, что должно быть не менее *m* повторений и не более *n*. Например, ``a/{1,3}b`` будет соответствовать ``'a/b'``, ``'a//b'`` и ``'a///b'`` . Он не будет соответствовать ``'ab'``, у которого нет косых черт, или ``'a////b'``, у которого их четыре.

source: You can omit either *m* or *n*; in that case, a reasonable value is assumed for the missing value. Omitting *m* is interpreted as a lower limit of 0, while omitting *n* results in an upper bound of infinity.
pt_pt: Pode omitir *m* ou *n*; nesse caso, um valor razoável é assumido para o valor em falta. Omitir *m* é interpretado como um limite inferior de 0, enquanto omitir *n* resulta num limite superior de infinito.
ru: Вы можете опустить либо *m*, либо *n*; в этом случае для отсутствующего значения предполагается разумное значение. Пропуск *m* интерпретируется как нижний предел, равный 0, а пропуск *n* приводит к верхней границе бесконечности.

source: The simplest case ``{m}`` matches the preceding item exactly *m* times. For example, ``a/{2}b`` will only match ``'a//b'``.
pt_pt: O caso mais simples ``{m}`` corresponde ao item precedente exatamente *m* vezes. Por exemplo, ``a/{2}b`` corresponderá apenas a ``'a//b'``.
ru: Самый простой случай ``{m}`` соответствует предыдущему элементу ровно *m* раз. Например, ``a/{2}b`` будет соответствовать только ``'a//b'``.

source: Readers of a reductionist bent may notice that the three other quantifiers can all be expressed using this notation. ``{0,}`` is the same as ``*``, ``{1,}`` is equivalent to ``+``, and ``{0,1}`` is the same as ``?``. It's better to use ``*``, ``+``, or ``?`` when you can, simply because they're shorter and easier to read.
pt_pt: Leitores com uma tendência reducionista podem notar que os outros três quantificadores podem ser expressos usando esta notação. ``{0,}`` é o mesmo que ``*``, ``{1,}`` é equivalente a ``+``, e ``{0,1}`` é o mesmo que ``?``. É melhor usar ``*``, ``+`` ou ``?`` quando possível, simplesmente porque são mais curtos e mais fáceis de ler.
ru: Читатели, придерживающиеся редукционистских взглядов, могут заметить, что все три других квантора могут быть выражены с использованием этой записи. ``{0,}`` совпадает с ``*``, ``{1,}`` эквивалентен ``+``, а ``{0,1}`` аналогичен `` `?``. Лучше использовать ``*``, ``+`` или ``?``, когда это возможно, просто потому, что они короче и их легче читать.

source: Using Regular Expressions
pt_pt: A Utilizar Expressões Regulares
ru: Использование регулярных выражений

source: Now that we've looked at some simple regular expressions, how do we actually use them in Python? The :mod:`re` module provides an interface to the regular expression engine, allowing you to compile REs into objects and then perform matches with them.
pt_pt: Agora que analisámos algumas expressões regulares simples, como as utilizamos realmente em Python? O módulo :mod:`re` fornece uma interface para o motor de expressões regulares, permitindo compilar REs em objetos e, depois, realizar correspondências com eles.
ru: Теперь, когда мы рассмотрели некоторые простые регулярные выражения, как нам на самом деле использовать их в Python? Модуль :mod:`re` предоставляет интерфейс для механизма регулярных выражений, позволяя вам компилировать RE в объекты и затем выполнять с ними сопоставления.

source: Compiling Regular Expressions
pt_pt: Compilação de Expressões Regulares
ru: Компиляция регулярных выражений

source: Regular expressions are compiled into pattern objects, which have methods for various operations such as searching for pattern matches or performing string substitutions. ::
pt_pt: As expressões regulares são compiladas em objetos de padrão, que possuem métodos para várias operações, como procurar correspondências de padrões ou realizar substituições de cadeias de caracteres. ::
ru: Регулярные выражения компилируются в объекты шаблонов, которые имеют методы для различных операций, таких как поиск совпадений с шаблоном или выполнение подстановки строк. ::

source: :func:`re.compile` also accepts an optional *flags* argument, used to enable various special features and syntax variations. We'll go over the available settings later, but for now a single example will do::
pt_pt: A função :func:`re.compile` também aceita um argumento opcional *flags*, usado para ativar várias funcionalidades especiais e variações de sintaxe. Analisaremos as definições disponíveis mais tarde, mas por agora um único exemplo será suficiente::
ru: :func:`re.compile` также принимает необязательный аргумент *flags*, используемый для включения различных специальных функций и вариантов синтаксиса. Доступные настройки мы рассмотрим позже, а пока достаточно одного примера:

source: The RE is passed to :func:`re.compile` as a string. REs are handled as strings because regular expressions aren't part of the core Python language, and no special syntax was created for expressing them. (There are applications that don't need REs at all, so there's no need to bloat the language specification by including them.) Instead, the :mod:`re` module is simply a C extension module included with Python, just like the :mod:`socket` or :mod:`zlib` modules.
pt_pt: A RE é passada para :func:`re.compile` como uma cadeia de caracteres. As REs são tratadas como cadeias de caracteres porque as expressões regulares não fazem parte do núcleo da linguagem Python, e nenhuma sintaxe especial foi criada para as expressar. (Existem aplicações que não necessitam de REs, pelo que não há necessidade de sobrecarregar a especificação da linguagem incluindo-as.) Em vez disso, o módulo :mod:`re` é simplesmente um módulo de extensão em C incluído com o Python, tal como os módulos :mod:`socket` ou :mod:`zlib`.
ru: RE передается в :func:`re.compile` как строка. RE обрабатываются как строки, поскольку регулярные выражения не являются частью основного языка Python, и для их выражения не было создано специального синтаксиса. (Есть приложения, которым вообще не нужны RE, поэтому нет необходимости раздувать спецификацию языка, включая их.) Вместо этого модуль :mod:`re` — это просто модуль расширения C, включенный в Python, точно так же, как модуль Модули :mod:`socket` или :mod:`zlib`.

source: Putting REs in strings keeps the Python language simpler, but has one disadvantage which is the topic of the next section.
pt_pt: Colocar REs em cadeias de caracteres mantém a linguagem Python mais simples, mas tem uma desvantagem que será abordada na próxima secção.
ru: Размещение RE в строках упрощает язык Python, но имеет один недостаток, который является темой следующего раздела.

source: The Backslash Plague
pt_pt: A Praga da Barra Invertida
ru: Эпидемия обратного слэша

source: As stated earlier, regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This conflicts with Python's usage of the same character for the same purpose in string literals.
pt_pt: Como mencionado anteriormente, as expressões regulares utilizam o caractere de barra invertida (``'\'``) para indicar formas especiais ou para permitir que caracteres especiais sejam usados sem invocar o seu significado especial. Isto conflitua com a utilização do mesmo caractere pelo Python para o mesmo propósito em literais de cadeias de caracteres.
ru: Как говорилось ранее, регулярные выражения используют символ обратной косой черты (``'\'``) для обозначения специальных форм или для разрешения использования специальных символов без обращения к их особому значению. Это противоречит использованию Python того же символа для той же цели в строковых литералах.

source: Let's say you want to write a RE that matches the string ``\section``, which might be found in a LaTeX file. To figure out what to write in the program code, start with the desired string to be matched. Next, you must escape any backslashes and other metacharacters by preceding them with a backslash, resulting in the string ``\\section``. The resulting string that must be passed to :func:`re.compile` must be ``\\section``. However, to express this as a Python string literal, both backslashes must be escaped *again*.
pt_pt: Digamos que você quer escrever uma RE que corresponda à string ``\section``, que pode ser encontrada num ficheiro LaTeX. Para descobrir o que escrever no código do programa, comece com a string desejada a ser correspondida. Em seguida, deve escapar quaisquer barras invertidas e outros metacaracteres, precedendo-os com uma barra invertida, resultando na string ``\\section``. A string resultante que deve ser passada para :func:`re.compile` deve ser ``\\section``. No entanto, para expressar isto como uma string literal Python, ambas as barras invertidas devem ser escapadas *novamente*.
ru: Допустим, вы хотите написать RE, соответствующий строке ``\section``, которую можно найти в файле LaTeX. Чтобы разобраться, что писать в коде программы, начните с нужной строки, которую нужно сопоставить. Затем вы должны избежать любых обратных косых черт и других метасимволов, поставив перед ними обратную косую черту, в результате чего получится строка ``\\section``. Результирующая строка, которая должна быть передана в :func:`re.compile`, должна быть ``\\section``. Однако, чтобы выразить это как строковый литерал Python, обе обратные косые черты должны быть *снова* экранированы.

source: Characters
pt_pt: Caracteres
ru: Символы

source: Stage
pt_pt: Fase
ru: Этап

source: Text string to be matched
ru: Текстовая строка для сопоставления

source: Escaped backslash for :func:`re.compile`
ru: Экранированная обратная косая черта для :func:`re.compile`

source: Escaped backslashes for a string literal
ru: Экранированные обратные косые черты для строкового литерала

source: In short, to match a literal backslash, one has to write ``'\\\\'`` as the RE string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. In REs that feature backslashes repeatedly, this leads to lots of repeated backslashes and makes the resulting strings difficult to understand.
pt_pt: Em resumo, para corresponder a uma barra invertida literal, é necessário escrever ``'\\\\'`` como a cadeia de caracteres da RE, porque a expressão regular deve ser ``\\``, e cada barra invertida deve ser expressa como ``\\`` dentro de um literal de cadeia de caracteres Python normal. Em REs que apresentam barras invertidas repetidamente, isto leva a muitas barras invertidas repetidas e torna as cadeias de caracteres resultantes difíceis de compreender.
ru: Короче говоря, чтобы сопоставить буквальную обратную косую черту, нужно написать ``'\\\\'`` в качестве строки RE, потому что регулярное выражение должно быть ``\\``, а каждая обратная косая черта должна быть выражена как `` \\`` внутри обычного строкового литерала Python. В RE, в которых обратная косая черта используется неоднократно, это приводит к множеству повторяющихся обратных косых черт и затрудняет понимание полученных строк.

source: The solution is to use Python's raw string notation for regular expressions; backslashes are not handled in any special way in a string literal prefixed with ``'r'``, so ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Regular expressions will often be written in Python code using this raw string notation.
pt_pt: A solução é utilizar a notação de cadeias de caracteres brutas do Python para expressões regulares; as barras invertidas não são tratadas de forma especial num literal de cadeia de caracteres prefixado com ``'r'``, pelo que ``r"\n"`` é uma cadeia de caracteres de dois caracteres contendo ``'\'`` e ``'n'``, enquanto ``"\n"`` é uma cadeia de caracteres de um caractere contendo uma nova linha. As expressões regulares serão frequentemente escritas em código Python utilizando esta notação de cadeias de caracteres brutas.
ru: Решение состоит в том, чтобы использовать для регулярных выражений необработанную строковую нотацию Python; обратная косая черта не обрабатывается каким-либо особым образом в строковом литерале с префиксом ``'r'``, поэтому ``r"\n"`` представляет собой двухсимвольную строку, содержащую ``'\'`` и ``' n'``, а ``"\n"`` представляет собой односимвольную строку, содержащую перевод строки. Регулярные выражения часто пишутся в коде Python с использованием этой необработанной строковой нотации.

source: In addition, special escape sequences that are valid in regular expressions, but not valid as Python string literals, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`, which means the sequences will be invalid if raw string notation or escaping the backslashes isn't used.
pt_pt: Além disso, sequências de escape especiais que são válidas em expressões regulares, mas não são válidas como literais de cadeias de caracteres em Python, resultam agora num :exc:`DeprecationWarning` e eventualmente tornar-se-ão num :exc:`SyntaxError`, o que significa que as sequências serão inválidas se a notação de cadeias de caracteres brutas ou o escape das barras invertidas não for utilizado.
ru: Кроме того, специальные escape-последовательности, которые допустимы в регулярных выражениях, но недопустимы в качестве строковых литералов Python, теперь приводят к :exc:`DeprecationWarning` и в конечном итоге становятся :exc:`SyntaxError`, что означает, что последовательности будут недействительными. если не используется необработанная строковая запись или экранирование обратной косой черты.

source: Regular String
pt_pt: Cadeia de Caracteres Normal
ru: Обычная строка

source: Raw string
pt_pt: Cadeia de Caracteres Bruta
ru: Необработанная строка

source: Performing Matches
pt_pt: Realização de Correspondências
ru: Проведение матчей

source: Once you have an object representing a compiled regular expression, what do you do with it? Pattern objects have several methods and attributes. Only the most significant ones will be covered here; consult the :mod:`re` docs for a complete listing.
pt_pt: Depois de ter um objeto que representa uma expressão regular compilada, o que fazer com ele? Os objetos de padrão possuem vários métodos e atributos. Apenas os mais significativos serão abordados aqui; consulte a documentação do módulo :mod:`re` para uma listagem completa.
ru: Если у вас есть объект, представляющий скомпилированное регулярное выражение, что вы с ним делаете? Объекты шаблонов имеют несколько методов и атрибутов. Здесь будут рассмотрены только наиболее важные из них; полный список см. в документации :mod:`re`.

source: Method/Attribute
pt_pt: Método/Atributo
ru: Метод/Атрибут

source: Purpose
pt_pt: Finalidade
ru: Предназначение

source: Determine if the RE matches at the beginning of the string.
pt_pt: Determina se a RE corresponde no início da cadeia de caracteres.
ru: Определите, соответствует ли RE началу строки.

source: Scan through a string, looking for any location where this RE matches.
pt_pt: Percorre uma cadeia de caracteres, procurando qualquer local onde esta RE corresponda.
ru: Просканируйте строку в поисках любого места, которому соответствует этот RE.

source: Find all substrings where the RE matches, and returns them as a list.
pt_pt: Encontra todas as subcadeias de caracteres onde a RE corresponde e devolve-as como uma lista.
ru: Найдите все подстроки, которым соответствует RE, и вернет их в виде списка.

source: Find all substrings where the RE matches, and returns them as an :term:`iterator`.
pt_pt: Encontra todas as subcadeias de caracteres onde a RE corresponde e devolve-as como um :term:`iterador`.
ru: Находит все подстроки, которым соответствует RE, и возвращает их в виде :term:`итератора`.
