Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: pt_pt, ru

source: ``.*[.](?!bat$)[^.]*$`` The negative lookahead means: if the expression ``bat`` doesn't match at this point, try the rest of the pattern; if ``bat$`` does match, the whole pattern will fail. The trailing ``$`` is required to ensure that something like ``sample.batch``, where the extension only starts with ``bat``, will be allowed. The ``[^.]*`` makes sure that the pattern works when there are multiple dots in the filename.
ru: ``.*[.](?!bat$)[^.]*$`` Отрицательный просмотр вперед означает: если выражение ``bat`` не соответствует в этот момент, попробуйте остальную часть шаблона; если ``bat$`` соответствует, весь шаблон потерпит неудачу. Завершающий ``$`` необходим для того, чтобы гарантировать, что будет разрешено что-то вроде ``sample.batch``, где расширение начинается только с ``bat``. ``[^.]*`` гарантирует, что шаблон работает, когда в имени файла есть несколько точек.

source: Excluding another filename extension is now easy; simply add it as an alternative inside the assertion. The following pattern excludes filenames that end in either ``bat`` or ``exe``:
pt_pt: Excluir outra extensão de nome de ficheiro é agora fácil; basta adicioná-la como uma alternativa dentro da asserção. O padrão seguinte exclui nomes de ficheiros que terminam em ``bat`` ou ``exe``:
ru: Исключить другое расширение имени файла теперь легко; просто добавьте его в качестве альтернативы внутри утверждения. Следующий шаблон исключает имена файлов, оканчивающиеся на ``bat`` или ``exe``:

source: Modifying Strings
pt_pt: Modificação de Cadeias de Caracteres
ru: Изменение строк

source: Up to this point, we've simply performed searches against a static string. Regular expressions are also commonly used to modify strings in various ways, using the following pattern methods:
pt_pt: Até este ponto, simplesmente realizámos pesquisas numa cadeia de caracteres estática. As expressões regulares também são comumente usadas para modificar cadeias de caracteres de várias formas, usando os seguintes métodos de padrão:
ru: До этого момента мы просто выполняли поиск по статической строке. Регулярные выражения также часто используются для изменения строк различными способами с использованием следующих методов шаблона:

source: Split the string into a list, splitting it wherever the RE matches
pt_pt: Divide a cadeia de caracteres numa lista, dividindo-a onde a RE corresponda
ru: Разделите строку на список, разделив его там, где соответствует RE.

source: Find all substrings where the RE matches, and replace them with a different string
pt_pt: Encontra todas as subcadeias de caracteres onde a RE corresponde e substitui-as por uma cadeia de caracteres diferente
ru: Найдите все подстроки, которым соответствует RE, и замените их другой строкой.

source: Does the same thing as :meth:`!sub`, but returns the new string and the number of replacements
pt_pt: Faz a mesma coisa que :meth:`!sub`, mas devolve a nova cadeia de caracteres e o número de substituições
ru: Делает то же самое, что и :meth:`!sub`, но возвращает новую строку и количество замен.

source: Splitting Strings
pt_pt: Divisão de Cadeias de Caracteres
ru: Разделение строк

source: The :meth:`~re.Pattern.split` method of a pattern splits a string apart wherever the RE matches, returning a list of the pieces. It's similar to the :meth:`~str.split` method of strings but provides much more generality in the delimiters that you can split by; string :meth:`!split` only supports splitting by whitespace or by a fixed string. As you'd expect, there's a module-level :func:`re.split` function, too.
pt_pt: O método :meth:`~re.Pattern.split` de um padrão divide uma cadeia de caracteres sempre que a RE corresponde, devolvendo uma lista das partes. É semelhante ao método :meth:`~str.split` de cadeias de caracteres, mas fornece muito mais generalidade nos delimitadores pelos quais pode dividir; o :meth:`!split` de cadeias de caracteres apenas suporta a divisão por espaços em branco ou por uma cadeia de caracteres fixa. Como seria de esperar, também existe uma função :func:`re.split` a nível de módulo.
ru: Метод шаблона :meth:`~re.Pattern.split` разбивает строку на части там, где RE соответствует, возвращая список частей. Он похож на метод строк :meth:`~str.split`, но обеспечивает гораздо большую универсальность в разделителях, по которым можно разделить; string :meth:`!split` поддерживает разделение только по пробелам или по фиксированной строке. Как и следовало ожидать, на уровне модуля также имеется функция :func:`re.split`.

source: Split *string* by the matches of the regular expression. If capturing parentheses are used in the RE, then their contents will also be returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits are performed.
pt_pt: Divide a *cadeia de caracteres* pelas correspondências da expressão regular. Se parênteses capturantes forem usados na RE, então o seu conteúdo também será devolvido como parte da lista resultante. Se *maxsplit* não for zero, no máximo *maxsplit* divisões são realizadas.
ru: Разделить *строку* по совпадениям с регулярным выражением. Если в RE используются захватывающие круглые скобки, то их содержимое также будет возвращено как часть результирующего списка. Если *maxsplit* не равно нулю, выполняется не более *maxsplit* разделения.

source: You can limit the number of splits made, by passing a value for *maxsplit*. When *maxsplit* is nonzero, at most *maxsplit* splits will be made, and the remainder of the string is returned as the final element of the list. In the following example, the delimiter is any sequence of non-alphanumeric characters. ::
pt_pt: Pode limitar o número de divisões feitas, passando um valor para *maxsplit*. Quando *maxsplit* não é zero, no máximo *maxsplit* divisões serão feitas, e o resto da cadeia de caracteres é devolvido como o último elemento da lista. No exemplo seguinte, o delimitador é qualquer sequência de caracteres não alfanuméricos. ::
ru: Вы можете ограничить количество разделений, передав значение *maxsplit*. Если *maxsplit* не равно нулю, будет выполнено не более *maxsplit* разбиений, а оставшаяся часть строки будет возвращена как последний элемент списка. В следующем примере разделителем является любая последовательность небуквенно-цифровых символов. ::

source: Sometimes you're not only interested in what the text between delimiters is, but also need to know what the delimiter was. If capturing parentheses are used in the RE, then their values are also returned as part of the list. Compare the following calls::
pt_pt: Às vezes, não está apenas interessado no texto entre delimitadores, mas também precisa de saber qual era o delimitador. Se parênteses capturantes forem usados na RE, então os seus valores também são devolvidos como parte da lista. Compare as seguintes chamadas::
ru: Иногда вас не только интересует текст между разделителями, но и нужно знать, что это был за разделитель. Если в RE используются захватывающие круглые скобки, то их значения также возвращаются как часть списка. Сравните следующие вызовы::

source: The module-level function :func:`re.split` adds the RE to be used as the first argument, but is otherwise the same. ::
pt_pt: A função a nível de módulo :func:`re.split` adiciona a RE a ser usada como o primeiro argumento, mas é de resto a mesma. ::
ru: Функция уровня модуля :func:`re.split` добавляет RE, который будет использоваться в качестве первого аргумента, но в остальном остается тем же. ::

source: Search and Replace
pt_pt: Pesquisa e Substituição
ru: Поиск и замена

source: Another common task is to find all the matches for a pattern, and replace them with a different string. The :meth:`~re.Pattern.sub` method takes a replacement value, which can be either a string or a function, and the string to be processed.
pt_pt: Outra tarefa comum é encontrar todas as correspondências para um padrão e substituí-las por uma cadeia de caracteres diferente. O método :meth:`~re.Pattern.sub` recebe um valor de substituição, que pode ser uma cadeia de caracteres ou uma função, e a cadeia de caracteres a ser processada.
ru: Другая распространенная задача — найти все совпадения с шаблоном и заменить их другой строкой. Метод :meth:`~re.Pattern.sub` принимает замещающее значение, которое может быть строкой или функцией, а также строку, подлежащую обработке.

source: Returns the string obtained by replacing the leftmost non-overlapping occurrences of the RE in *string* by the replacement *replacement*. If the pattern isn't found, *string* is returned unchanged.
pt_pt: Devolve a cadeia de caracteres obtida substituindo as ocorrências não sobrepostas mais à esquerda da RE em *cadeia de caracteres* pela substituição *substituição*. Se o padrão não for encontrado, *cadeia de caracteres* é devolvida inalterada.
ru: Возвращает строку, полученную путем замены крайних левых непересекающихся вхождений RE в *string* заменой *replacement*. Если шаблон не найден, *строка* возвращается без изменений.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. The default value of 0 means to replace all occurrences.
pt_pt: O argumento opcional *contagem* é o número máximo de ocorrências do padrão a serem substituídas; *contagem* deve ser um inteiro não negativo. O valor predefinido de 0 significa substituir todas as ocorrências.
ru: Необязательный аргумент *count* — это максимальное количество вхождений шаблона, которые необходимо заменить; *count* должно быть неотрицательным целым числом. Значение по умолчанию 0 означает замену всех вхождений.

source: Here's a simple example of using the :meth:`~re.Pattern.sub` method. It replaces colour names with the word ``colour``::
pt_pt: Aqui está um exemplo simples de utilização do método :meth:`~re.Pattern.sub`. Substitui nomes de cores pela palavra ``colour``::
ru: Вот простой пример использования метода :meth:`~re.Pattern.sub`. Он заменяет названия цветов словом ``color``::

source: The :meth:`~re.Pattern.subn` method does the same work, but returns a 2-tuple containing the new string value and the number of replacements that were performed::
pt_pt: O método :meth:`~re.Pattern.subn` faz o mesmo trabalho, mas devolve um tuplo de 2 elementos contendo o novo valor da cadeia de caracteres e o número de substituições que foram realizadas::
ru: Метод :meth:`~re.Pattern.subn` выполняет ту же работу, но возвращает кортеж из двух элементов, содержащий новое строковое значение и количество выполненных замен:

source: Empty matches are replaced only when they're not adjacent to a previous empty match. ::
pt_pt: As correspondências vazias são substituídas apenas quando não são adjacentes a uma correspondência vazia anterior. ::
ru: Пустые совпадения заменяются только в том случае, если они не соседствуют с предыдущим пустым совпадением. ::

source: If *replacement* is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by the corresponding group in the RE. This lets you incorporate portions of the original text in the resulting replacement string.
pt_pt: Se *substituição* for uma cadeia de caracteres, quaisquer escapes de barra invertida nela são processados. Isto é, ``\n`` é convertido num único caractere de nova linha, ``\r`` é convertido num retorno de carro, e assim por diante. Escapes desconhecidos como ``\&`` são deixados como estão. Referências retroativas, como ``\6``, são substituídas pela subcadeia de caracteres correspondida pelo grupo correspondente na RE. Isto permite-lhe incorporar porções do texto original na cadeia de caracteres de substituição resultante.
ru: Если *replacement* является строкой, любые символы обратной косой черты в ней обрабатываются. То есть ``\n`` преобразуется в один символ новой строки, ``\r`` преобразуется в возврат каретки и так далее. Неизвестные escape-символы, такие как ``\&``, остаются в покое. Обратные ссылки, такие как ``\6``, заменяются подстрокой, соответствующей соответствующей группе в RE. Это позволяет включать части исходного текста в результирующую строку замены.

source: This example matches the word ``section`` followed by a string enclosed in ``{``, ``}``, and changes ``section`` to ``subsection``::
pt_pt: Este exemplo corresponde à palavra ``section`` seguida de uma cadeia de caracteres delimitada por ``{``, ``}``, e altera ``section`` para ``subsection``::
ru: Этот пример соответствует слову ``section``, за которым следует строка, заключенная в ``{``, ``}``, и заменяет ``section`` на ``subsection``::

source: There's also a syntax for referring to named groups as defined by the ``(?P<name>...)`` syntax. ``\g<name>`` will use the substring matched by the group named ``name``, and ``\g<number>`` uses the corresponding group number. ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement string such as ``\g<2>0``. (``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``.) The following substitutions are all equivalent, but use all three variations of the replacement string. ::
pt_pt: Também existe uma sintaxe para referenciar grupos nomeados como definidos pela sintaxe ``(?P<name>...)``. ``\g<name>`` usará a subcadeia de caracteres correspondida pelo grupo nomeado ``name``, e ``\g<number>`` usa o número do grupo correspondente. ``\g<2>`` é, portanto, equivalente a ``\2``, mas não é ambíguo numa cadeia de caracteres de substituição como ``\g<2>0``. (``\20`` seria interpretado como uma referência ao grupo 20, não como uma referência ao grupo 2 seguida do caractere literal ``'0'``.) As seguintes substituições são todas equivalentes, mas usam as três variações da cadeia de caracteres de substituição. ::
ru: Существует также синтаксис для ссылки на именованные группы, определенный синтаксисом ``(?P<name>...)``. ``\g<name>`` будет использовать подстроку, соответствующую группе с именем ``name``, а ``\g<number>`` использует соответствующий номер группы. Таким образом, ``\g<2>`` эквивалентен ``\2``, но не является двусмысленным в строке замены, такой как ``\g<2>0``. (``\20`` будет интерпретироваться как ссылка на группу 20, а не как ссылка на группу 2, за которой следует буквальный символ ``'0'``.) Все следующие замены эквивалентны, но используют все три варианта строка замены. ::

source: *replacement* can also be a function, which gives you even more control. If *replacement* is a function, the function is called for every non-overlapping occurrence of *pattern*. On each call, the function is passed a :ref:`match object <match-objects>` argument for the match and can use this information to compute the desired replacement string and return it.
ru: *замена* также может быть функцией, которая дает вам еще больше контроля. Если *replacement* является функцией, она вызывается для каждого непересекающегося вхождения *pattern*. При каждом вызове функции передается аргумент :ref:`match object <match-objects>` для соответствия, и она может использовать эту информацию для вычисления желаемой строки замены и ее возврата.

source: In the following example, the replacement function translates decimals into hexadecimal::
pt_pt: No exemplo seguinte, a função de substituição traduz decimais para hexadecimal::
ru: В следующем примере функция замены переводит десятичные числа в шестнадцатеричные:

source: When using the module-level :func:`re.sub` function, the pattern is passed as the first argument. The pattern may be provided as an object or as a string; if you need to specify regular expression flags, you must either use a pattern object as the first parameter, or use embedded modifiers in the pattern string, e.g. ``sub("(?i)b+", "x", "bbbb BBBB")`` returns ``'x x'``.
pt_pt: Ao usar a função a nível de módulo :func:`re.sub`, o padrão é passado como o primeiro argumento. O padrão pode ser fornecido como um objeto ou como uma cadeia de caracteres; se precisar de especificar *flags* de expressão regular, deve usar um objeto de padrão como o primeiro parâmetro ou usar modificadores incorporados na cadeia de caracteres do padrão, por exemplo, ``sub("(?i)b+", "x", "bbbb BBBB")`` devolve ``'x x'``.
ru: При использовании функции :func:`re.sub` на уровне модуля шаблон передается в качестве первого аргумента. Шаблон может быть предоставлен как объект или как строка; если вам нужно указать флаги регулярного выражения, вы должны либо использовать объект шаблона в качестве первого параметра, либо использовать встроенные модификаторы в строку шаблона, например, ``sub("(?i)b+", "x", "bbbb BBBB ")`` возвращает ``'x x'``.

source: Common Problems
pt_pt: Problemas Comuns
ru: Общие проблемы

source: Regular expressions are a powerful tool for some applications, but in some ways their behaviour isn't intuitive and at times they don't behave the way you may expect them to. This section will point out some of the most common pitfalls.
pt_pt: As expressões regulares são uma ferramenta poderosa para algumas aplicações, mas, de certa forma, o seu comportamento não é intuitivo e, por vezes, não se comportam da maneira que pode esperar. Esta secção irá apontar alguns dos problemas mais comuns.
ru: Регулярные выражения являются мощным инструментом для некоторых приложений, но в некотором смысле их поведение не интуитивно понятно, а иногда они ведут себя не так, как вы от них ожидаете. В этом разделе будут указаны некоторые из наиболее распространенных ошибок.

source: Use String Methods
pt_pt: Utilizar Métodos de Cadeias de Caracteres
ru: Используйте строковые методы

source: Sometimes using the :mod:`re` module is a mistake. If you're matching a fixed string, or a single character class, and you're not using any :mod:`re` features such as the :const:`~re.IGNORECASE` flag, then the full power of regular expressions may not be required. Strings have several methods for performing operations with fixed strings and they're usually much faster, because the implementation is a single small C loop that's been optimized for the purpose, instead of the large, more generalized regular expression engine.
pt_pt: Às vezes, usar o módulo :mod:`re` é um erro. Se estiver a corresponder a uma cadeia de caracteres fixa ou a uma única classe de caracteres, e não estiver a usar quaisquer funcionalidades do :mod:`re`, como a *flag* :const:`~re.IGNORECASE`, então todo o poder das expressões regulares pode não ser necessário. As cadeias de caracteres têm vários métodos para realizar operações com cadeias de caracteres fixas e são geralmente muito mais rápidas, porque a implementação é um pequeno ciclo em C que foi otimizado para esse fim, em vez do grande motor de expressões regulares mais generalizado.
ru: Иногда использование модуля :mod:`re` является ошибкой. Если вы сопоставляете фиксированную строку или один класс символов и не используете какие-либо функции :mod:`re`, такие как флаг :const:`~re.IGNORECASE`, тогда вся мощь регулярных выражений может не потребоваться. Строки имеют несколько методов для выполнения операций с фиксированными строками, и обычно они намного быстрее, поскольку реализация представляет собой один небольшой цикл C, оптимизированный для этой цели, а не большой, более обобщенный механизм регулярных выражений.

source: One example might be replacing a single fixed string with another one; for example, you might replace ``word`` with ``deed``. :func:`re.sub` seems like the function to use for this, but consider the :meth:`~str.replace` method. Note that :meth:`!replace` will also replace ``word`` inside words, turning ``swordfish`` into ``sdeedfish``, but the naive RE ``word`` would have done that, too. (To avoid performing the substitution on parts of words, the pattern would have to be ``\bword\b``, in order to require that ``word`` have a word boundary on either side. This takes the job beyond :meth:`!replace`'s abilities.)
pt_pt: Um exemplo pode ser substituir uma única cadeia de caracteres fixa por outra; por exemplo, pode substituir ``word`` por ``deed``. A função :func:`re.sub` parece ser a função a usar para isto, mas considere o método :meth:`~str.replace`. Note que :meth:`!replace` também substituirá ``word`` dentro de palavras, transformando ``swordfish`` em ``sdeedfish``, mas a RE ingénua ``word`` também o faria. (Para evitar realizar a substituição em partes de palavras, o padrão teria de ser ``\bword\b``, para exigir que ``word`` tenha um limite de palavra em ambos os lados. Isto vai além das capacidades do :meth:`!replace`.)
ru: Одним из примеров может быть замена одной фиксированной строки другой; например, вы можете заменить слово на слово дело. :func:`re.sub` кажется функцией, которую можно использовать для этого, но рассмотрим метод :meth:`~str.replace`. Обратите внимание, что :meth:`!replace` также заменит ``word`` внутри слов, превратив ``swordfish`` в ``sdeedfish``, но наивный RE ``word`` тоже сделал бы это. (Чтобы избежать выполнения замены частей слов, шаблон должен быть ``\bword\b``, чтобы требовать, чтобы ``word`` имел границу слова с обеих сторон. Это выходит за рамки: meth:`!replace`.)

source: Another common task is deleting every occurrence of a single character from a string or replacing it with another single character. You might do this with something like ``re.sub('\n', ' ', S)``, but :meth:`~str.translate` is capable of doing both tasks and will be faster than any regular expression operation can be.
pt_pt: Outra tarefa comum é apagar todas as ocorrências de um único caractere de uma cadeia de caracteres ou substituí-lo por outro caractere único. Pode fazer isto com algo como ``re.sub('\n', ' ', S)``, mas :meth:`~str.translate` é capaz de realizar ambas as tarefas e será mais rápido do que qualquer operação de expressão regular.
ru: Другая распространенная задача — удаление каждого вхождения одного символа из строки или замена его другим одиночным символом. Вы можете сделать это с помощью чего-то вроде ``re.sub('\n', ' ', S)``, но :meth:`~str.translate` способен выполнять обе задачи и будет быстрее, чем любое регулярное выражение. операция может быть.

source: In short, before turning to the :mod:`re` module, consider whether your problem can be solved with a faster and simpler string method.
pt_pt: Em resumo, antes de recorrer ao módulo :mod:`re`, considere se o seu problema pode ser resolvido com um método de cadeias de caracteres mais rápido e simples.
ru: Короче говоря, прежде чем обращаться к модулю :mod:`re`, подумайте, можно ли решить вашу проблему более быстрым и простым строковым методом.

source: match() versus search()
ru: match() против search()
