Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: pt_pt, ru

source: Regular Expression HOWTO
pt_pt: Guia Prático de Expressões Regulares
ru: Руководство по использованию регулярных выражений

source: Author
pt_pt: Autor
ru: Автор

source: Abstract
pt_pt: Resumo
ru: Абстракция

source: This document is an introductory tutorial to using regular expressions in Python with the :mod:`re` module. It provides a gentler introduction than the corresponding section in the Library Reference.
pt_pt: Este documento é um tutorial introdutório sobre a utilização de expressões regulares em Python com o módulo :mod:`re`. Oferece uma introdução mais suave do que a secção correspondente na Referência da Biblioteca.
ru: Этот документ представляет собой вводное руководство по использованию регулярных выражений в Python с модулем :mod:`re`. Он представляет собой более мягкое введение, чем соответствующий раздел в Библиотечном справочнике.

source: Introduction
pt_pt: Introdução
ru: Введение

source: Regular expressions (called REs, or regexes, or regex patterns) are essentially a tiny, highly specialized programming language embedded inside Python and made available through the :mod:`re` module. Using this little language, you specify the rules for the set of possible strings that you want to match; this set might contain English sentences, or e-mail addresses, or TeX commands, or anything you like. You can then ask questions such as "Does this string match the pattern?", or "Is there a match for the pattern anywhere in this string?". You can also use REs to modify a string or to split it apart in various ways.
pt_pt: As expressões regulares (também designadas por REs, *regexes* ou padrões *regex*) são, essencialmente, uma pequena linguagem de programação altamente especializada incorporada no Python e disponibilizada através do módulo :mod:`re`. Com esta linguagem, pode especificar as regras para o conjunto de cadeias de caracteres que deseja corresponder; este conjunto pode conter frases em inglês, endereços de *e-mail*, comandos TeX ou qualquer outra coisa. Pode, depois, colocar questões como "Esta cadeia de caracteres corresponde ao padrão?" ou "Existe alguma correspondência para o padrão nesta cadeia de caracteres?". Também pode usar REs para modificar uma cadeia de caracteres ou para a dividir de várias formas.
ru: Регулярные выражения (называемые RE, или регулярные выражения, или шаблоны регулярных выражений) — это, по сути, крошечный узкоспециализированный язык программирования, встроенный в Python и доступный через модуль :mod:`re`. Используя этот небольшой язык, вы указываете правила для набора возможных строк, которые вы хотите сопоставить; этот набор может содержать английские предложения, адреса электронной почты, команды TeX или все, что вам нравится. Затем вы можете задать такие вопросы, как «Соответствует ли эта строка шаблону?» или «Есть ли совпадение с шаблоном где-нибудь в этой строке?». Вы также можете использовать RE для изменения строки или ее разделения различными способами.

source: Regular expression patterns are compiled into a series of bytecodes which are then executed by a matching engine written in C. For advanced use, it may be necessary to pay careful attention to how the engine will execute a given RE, and write the RE in a certain way in order to produce bytecode that runs faster. Optimization isn't covered in this document, because it requires that you have a good understanding of the matching engine's internals.
pt_pt: Os padrões de expressões regulares são compilados numa série de *bytecodes* que são, depois, executados por um motor de correspondência escrito em C. Para uso avançado, pode ser necessário prestar atenção cuidadosa à forma como o motor executará uma determinada RE e escrever a RE de uma certa forma para produzir *bytecode* que execute mais rapidamente. A otimização não é abordada neste documento, porque requer um bom entendimento dos internos do motor de correspondência.
ru: Шаблоны регулярных выражений компилируются в серию байт-кодов, которые затем выполняются механизмом сопоставления, написанным на C. Для расширенного использования может потребоваться обратить пристальное внимание на то, как механизм будет выполнять данный RE, и записать RE в определенным образом, чтобы создать байт-код, который работает быстрее. Оптимизация не рассматривается в этом документе, поскольку она требует хорошего понимания внутреннего устройства соответствующего механизма.

source: The regular expression language is relatively small and restricted, so not all possible string processing tasks can be done using regular expressions. There are also tasks that *can* be done with regular expressions, but the expressions turn out to be very complicated. In these cases, you may be better off writing Python code to do the processing; while Python code will be slower than an elaborate regular expression, it will also probably be more understandable.
pt_pt: A linguagem de expressões regulares é relativamente pequena e restrita, pelo que nem todas as tarefas possíveis de processamento de cadeias de caracteres podem ser feitas usando expressões regulares. Também existem tarefas que *podem* ser feitas com expressões regulares, mas as expressões tornam-se muito complicadas. Nestes casos, pode ser melhor escrever código Python para fazer o processamento; embora o código Python seja mais lento do que uma expressão regular elaborada, provavelmente será mais compreensível.
ru: Язык регулярных выражений относительно небольшой и ограниченный, поэтому не все возможные задачи обработки строк можно выполнить с помощью регулярных выражений. Есть также задачи, которые *можно* решить с помощью регулярных выражений, но выражения оказываются очень сложными. В этих случаях вам может быть лучше написать код Python для выполнения обработки; хотя код Python будет медленнее, чем сложное регулярное выражение, он также, вероятно, будет более понятным.

source: Simple Patterns
pt_pt: Padrões Simples
ru: Простые шаблоны

source: We'll start by learning about the simplest possible regular expressions. Since regular expressions are used to operate on strings, we'll begin with the most common task: matching characters.
pt_pt: Vamos começar por aprender sobre as expressões regulares mais simples possíveis. Como as expressões regulares são usadas para operar em cadeias de caracteres, vamos começar com a tarefa mais comum: corresponder caracteres.
ru: Мы начнем с изучения простейших регулярных выражений. Поскольку регулярные выражения используются для работы со строками, мы начнем с самой распространенной задачи: сопоставления символов.

source: For a detailed explanation of the computer science underlying regular expressions (deterministic and non-deterministic finite automata), you can refer to almost any textbook on writing compilers.
pt_pt: Para uma explicação detalhada da ciência da computação subjacente às expressões regulares (autómatos finitos determinísticos e não determinísticos), pode consultar quase qualquer livro sobre a escrita de compiladores.
ru: Для подробного объяснения информатики, лежащей в основе регулярных выражений (детерминированных и недетерминированных конечных автоматов), вы можете обратиться практически к любому учебнику по написанию компиляторов.

source: Matching Characters
pt_pt: Correspondência de Caracteres
ru: Совпадающие символы

source: Most letters and characters will simply match themselves. For example, the regular expression ``test`` will match the string ``test`` exactly. (You can enable a case-insensitive mode that would let this RE match ``Test`` or ``TEST`` as well; more about this later.)
pt_pt: A maioria das letras e caracteres correspondem simplesmente a si mesmos. Por exemplo, a expressão regular ``test`` corresponderá exatamente à cadeia de caracteres ``test``. (Pode ativar um modo *case-insensitive* que permite que esta RE corresponda também a ``Test`` ou ``TEST``; mais sobre isto mais tarde.)
ru: Большинство букв и символов просто совпадают. Например, регулярное выражение ``test`` будет точно соответствовать строке ``test``. (Вы можете включить режим без учета регистра, который позволит этому RE также соответствовать ``Test`` или ``TEST``; подробнее об этом позже.)

source: There are exceptions to this rule; some characters are special :dfn:`metacharacters`, and don't match themselves. Instead, they signal that some out-of-the-ordinary thing should be matched, or they affect other portions of the RE by repeating them or changing their meaning. Much of this document is devoted to discussing various metacharacters and what they do.
pt_pt: Existem exceções a esta regra; alguns caracteres são :dfn:`metacaracteres` especiais e não correspondem a si mesmos. Em vez disso, sinalizam que algo fora do comum deve ser correspondido, ou afetam outras partes da RE, repetindo-as ou alterando o seu significado. Grande parte deste documento é dedicada a discutir vários metacaracteres e o que fazem.
ru: Из этого правила есть исключения; некоторые символы являются специальными :dfn:`метасимволами` и не совпадают сами с собой. Вместо этого они сигнализируют о том, что следует сопоставить какую-то необычную вещь, или влияют на другие части RE, повторяя их или изменяя их значение. Большая часть этого документа посвящена обсуждению различных метасимволов и того, что они делают.

source: Here's a complete list of the metacharacters; their meanings will be discussed in the rest of this HOWTO.
pt_pt: Aqui está uma lista completa dos metacaracteres; os seus significados serão discutidos no resto deste guia.
ru: Вот полный список метасимволов; их значения будут обсуждаться в оставшейся части этого HOWTO.

source: The first metacharacters we'll look at are ``[`` and ``]``. They're used for specifying a character class, which is a set of characters that you wish to match. Characters can be listed individually, or a range of characters can be indicated by giving two characters and separating them by a ``'-'``. For example, ``[abc]`` will match any of the characters ``a``, ``b``, or ``c``; this is the same as ``[a-c]``, which uses a range to express the same set of characters. If you wanted to match only lowercase letters, your RE would be ``[a-z]``.
pt_pt: Os primeiros metacaracteres que vamos analisar são ``[`` e ``]``. São usados para especificar uma classe de caracteres, que é um conjunto de caracteres que deseja corresponder. Os caracteres podem ser listados individualmente, ou um intervalo de caracteres pode ser indicado dando dois caracteres e separando-os por um ``'-'``. Por exemplo, ``[abc]`` corresponderá a qualquer um dos caracteres ``a``, ``b`` ou ``c``; isto é o mesmo que ``[a-c]``, que usa um intervalo para expressar o mesmo conjunto de caracteres. Se quisesse corresponder apenas a letras minúsculas, a sua RE seria ``[a-z]``.
ru: Первые метасимволы, которые мы рассмотрим, — это ``[`` и ``]``. Они используются для указания класса символов, который представляет собой набор символов, которые вы хотите сопоставить. Символы могут быть перечислены индивидуально или можно указать диапазон символов, указав два символа и разделив их знаком ``'-'``. Например, ``[abc]`` будет соответствовать любому из символов ``a``, ``b`` или ``c``; это то же самое, что ``[ac]``, который использует диапазон для выражения того же набора символов. Если вы хотите сопоставить только строчные буквы, ваш RE будет ``[az]``.

source: Metacharacters (except ``\``) are not active inside classes. For example, ``[akm$]`` will match any of the characters ``'a'``, ``'k'``, ``'m'``, or ``'$'``; ``'$'`` is usually a metacharacter, but inside a character class it's stripped of its special nature.
pt_pt: Os metacaracteres (exceto ``\``) não estão ativos dentro de classes. Por exemplo, ``[akm$]`` corresponderá a qualquer um dos caracteres ``'a'``, ``'k'``, ``'m'`` ou ``'$'``; ``'$'`` é normalmente um metacaractere, mas dentro de uma classe de caracteres perde a sua natureza especial.
ru: Метасимволы (кроме ``\``) неактивны внутри классов. Например, ``[akm$]`` будет соответствовать любому из символов ``'a'``, ``'k'``, ``'m'`` или ``'$'``; ``'$'`` обычно является метасимволом, но внутри класса символов он лишен своей особой природы.

source: You can match the characters not listed within the class by :dfn:`complementing` the set. This is indicated by including a ``'^'`` as the first character of the class. For example, ``[^5]`` will match any character except ``'5'``. If the caret appears elsewhere in a character class, it does not have special meaning. For example: ``[5^]`` will match either a ``'5'`` or a ``'^'``.
pt_pt: Pode corresponder aos caracteres não listados dentro da classe :dfn:`complementando` o conjunto. Isto é indicado incluindo um ``'^'`` como o primeiro caractere da classe. Por exemplo, ``[^5]`` corresponderá a qualquer caractere exceto ``'5'``. Se o acento circunflexo aparecer noutro local dentro de uma classe de caracteres, não tem significado especial. Por exemplo: ``[5^]`` corresponderá a um ``'5'`` ou a um ``'^'``.
ru: Вы можете сопоставить символы, не перечисленные в классе, :dfn:`дополняя` набор. На это указывает включение ``'^'`` в качестве первого символа класса. Например, ``[^5]`` будет соответствовать любому символу, кроме ``'5'``. Если курсор появляется в другом месте класса символов, он не имеет особого значения. Например: ``[5^]`` будет соответствовать либо ``'5'``, либо ``'^'``.

source: Perhaps the most important metacharacter is the backslash, ``\``. As in Python string literals, the backslash can be followed by various characters to signal various special sequences. It's also used to escape all the metacharacters so you can still match them in patterns; for example, if you need to match a ``[`` or ``\``, you can precede them with a backslash to remove their special meaning: ``\[`` or ``\\``.
pt_pt: Talvez o metacaractere mais importante seja a barra invertida, ``\``. Tal como nas literais de cadeias de caracteres do Python, a barra invertida pode ser seguida por vários caracteres para sinalizar várias sequências especiais. Também é usada para escapar todos os metacaracteres para que ainda possa correspondê-los em padrões; por exemplo, se precisar de corresponder a um ``[`` ou ``\``, pode precedê-los com uma barra invertida para remover o seu significado especial: ``\[`` ou ``\\``.
ru: Возможно, самым важным метасимволом является обратная косая черта ``\``. Как и в строковых литералах Python, за обратной косой чертой могут следовать различные символы, обозначающие различные специальные последовательности. Он также используется для экранирования всех метасимволов, чтобы вы могли сопоставлять их с шаблонами; например, если вам нужно сопоставить ``[`` или ``\``, вы можете поставить перед ними обратную косую черту, чтобы удалить их особое значение: ``\[`` или ``\\``.

source: Some of the special sequences beginning with ``'\'`` represent predefined sets of characters that are often useful, such as the set of digits, the set of letters, or the set of anything that isn't whitespace.
pt_pt: Algumas das sequências especiais que começam com ``'\'`` representam conjuntos predefinidos de caracteres que são frequentemente úteis, como o conjunto de dígitos, o conjunto de letras ou o conjunto de qualquer coisa que não seja espaço em branco.
ru: Некоторые специальные последовательности, начинающиеся с ``'\'``, представляют собой заранее определенные наборы символов, которые часто бывают полезны, например, набор цифр, набор букв или набор всего, что не является пробелами.

source: Let's take an example: ``\w`` matches any alphanumeric character. If the regex pattern is expressed in bytes, this is equivalent to the class ``[a-zA-Z0-9_]``. If the regex pattern is a string, ``\w`` will match all the characters marked as letters in the Unicode database provided by the :mod:`unicodedata` module. You can use the more restricted definition of ``\w`` in a string pattern by supplying the :const:`re.ASCII` flag when compiling the regular expression.
pt_pt: Vejamos um exemplo: ``\w`` corresponde a qualquer caractere alfanumérico. Se o padrão da expressão regular for expresso em *bytes*, isto é equivalente à classe ``[a-zA-Z0-9_]``. Se o padrão da expressão regular for uma cadeia de caracteres, ``\w`` corresponderá a todos os caracteres marcados como letras na base de dados Unicode fornecida pelo módulo :mod:`unicodedata`. Pode usar a definição mais restrita de ``\w`` num padrão de cadeia de caracteres fornecendo a *flag* :const:`re.ASCII` ao compilar a expressão regular.
ru: Давайте рассмотрим пример: ``\w`` соответствует любому буквенно-цифровому символу. Если шаблон регулярного выражения выражается в байтах, это эквивалентно классу ``[a-zA-Z0-9_]``. Если шаблон регулярного выражения представляет собой строку, ``\w`` будет соответствовать всем символам, помеченным как буквы в базе данных Unicode, предоставленной модулем :mod:`unicodedata`. Вы можете использовать более ограниченное определение ``\w`` в строковом шаблоне, указав флаг :const:`re.ASCII` при компиляции регулярного выражения.

source: The following list of special sequences isn't complete. For a complete list of sequences and expanded class definitions for Unicode string patterns, see the last part of :ref:`Regular Expression Syntax <re-syntax>` in the Standard Library reference. In general, the Unicode versions match any character that's in the appropriate category in the Unicode database.
pt_pt: A lista seguinte de sequências especiais não está completa. Para uma lista completa de sequências e definições de classes expandidas para padrões de cadeias de caracteres Unicode, consulte a última parte de :ref:`Sintaxe de Expressões Regulares <re-syntax>` na referência da Biblioteca Padrão. Em geral, as versões Unicode correspondem a qualquer caractere que esteja na categoria apropriada na base de dados Unicode.
ru: Следующий список специальных последовательностей не является полным. Полный список последовательностей и расширенные определения классов для строковых шаблонов Юникода см. в последней части :ref:`Синтаксиса регулярных выражений <re-syntax>` в справочнике по стандартной библиотеке. Как правило, версии Юникода соответствуют любому символу, находящемуся в соответствующей категории в базе данных Юникода.

source: Matches any decimal digit; this is equivalent to the class ``[0-9]``.
pt_pt: Corresponde a qualquer dígito decimal; isto é equivalente à classe ``[0-9]``.
ru: Соответствует любой десятичной цифре; это эквивалентно классу ``[0-9]``.

source: Matches any non-digit character; this is equivalent to the class ``[^0-9]``.
pt_pt: Corresponde a qualquer caractere não dígito; isto é equivalente à classe ``[^0-9]``.
ru: Соответствует любому нецифровому символу; это эквивалентно классу ``[^0-9]``.

source: Matches any whitespace character; this is equivalent to the class ``[ \t\n\r\f\v]``.
pt_pt: Corresponde a qualquer caractere de espaço em branco; isto é equivalente à classe ``[ \t\n\r\f\v]``.
ru: Соответствует любому символу пробела; это эквивалентно классу ``[ \t\n\r\f\v]``.

source: Matches any non-whitespace character; this is equivalent to the class ``[^ \t\n\r\f\v]``.
pt_pt: Corresponde a qualquer caractere não espaço em branco; isto é equivalente à classe ``[^ \t\n\r\f\v]``.
ru: Соответствует любому символу без пробелов; это эквивалентно классу ``[^ \t\n\r\f\v]``.

source: Matches any alphanumeric character; this is equivalent to the class ``[a-zA-Z0-9_]``.
pt_pt: Corresponde a qualquer caractere alfanumérico; isto é equivalente à classe ``[a-zA-Z0-9_]``.
ru: Соответствует любому буквенно-цифровому символу; это эквивалентно классу ``[a-zA-Z0-9_]``.

source: Matches any non-alphanumeric character; this is equivalent to the class ``[^a-zA-Z0-9_]``.
pt_pt: Corresponde a qualquer caractere não alfanumérico; isto é equivalente à classe ``[^a-zA-Z0-9_]``.
ru: Соответствует любому небуквенно-цифровому символу; это эквивалентно классу ``[^a-zA-Z0-9_]``.

source: These sequences can be included inside a character class. For example, ``[\s,.]`` is a character class that will match any whitespace character, or ``','`` or ``'.'``.
pt_pt: Estas sequências podem ser incluídas dentro de uma classe de caracteres. Por exemplo, ``[\s,.]`` é uma classe de caracteres que corresponderá a qualquer caractere de espaço em branco, ou ``','`` ou ``'.'``.
ru: Эти последовательности могут быть включены в класс символов. Например, ``[\s,.]`` — это класс символов, который будет соответствовать любому символу пробела или ``','`` или ``'.'``.

source: The final metacharacter in this section is ``.``. It matches anything except a newline character, and there's an alternate mode (:const:`re.DOTALL`) where it will match even a newline. ``.`` is often used where you want to match "any character".
pt_pt: O último metacaractere nesta secção é ``.``. Corresponde a qualquer coisa exceto um caractere de nova linha, e existe um modo alternativo (:const:`re.DOTALL`) onde corresponderá até a uma nova linha. ``.`` é frequentemente usado quando se deseja corresponder a "qualquer caractere".
ru: Последний метасимвол в этом разделе — ``.``. Он соответствует всему, кроме символа новой строки, и существует альтернативный режим (:const:`re.DOTALL`), в котором он будет соответствовать даже символу новой строки. ``.`` часто используется там, где вы хотите сопоставить «любой символ».

source: Repeating Things
pt_pt: Repetição de Elementos
ru: Повторяющиеся вещи

source: Being able to match varying sets of characters is the first thing regular expressions can do that isn't already possible with the methods available on strings. However, if that was the only additional capability of regexes, they wouldn't be much of an advance. Another capability is that you can specify that portions of the RE must be repeated a certain number of times.
pt_pt: Poder corresponder a conjuntos variáveis de caracteres é a primeira coisa que as expressões regulares podem fazer que não é já possível com os métodos disponíveis para cadeias de caracteres. No entanto, se esta fosse a única capacidade adicional das expressões regulares, não seriam um grande avanço. Outra capacidade é que pode especificar que partes da RE devem ser repetidas um certo número de vezes.
ru: Возможность сопоставлять различные наборы символов — это первое, что могут делать регулярные выражения, что пока невозможно с помощью методов, доступных для строк. Однако, если бы это была единственная дополнительная возможность регулярных выражений, они не были бы большим достижением. Другая возможность заключается в том, что вы можете указать, что части RE должны повторяться определенное количество раз.

source: The first metacharacter for repeating things that we'll look at is ``*``. ``*`` doesn't match the literal character ``'*'``; instead, it specifies that the previous character can be matched zero or more times, instead of exactly once.
pt_pt: O primeiro metacaractere para repetição que vamos analisar é ``*``. ``*`` não corresponde ao caractere literal ``'*'``; em vez disso, especifica que o caractere anterior pode ser correspondido zero ou mais vezes, em vez de exatamente uma vez.
ru: Первый метасимвол для повторения вещей, который мы рассмотрим, — это ``*``. ``*`` не соответствует буквальному символу ``'*'``; вместо этого он указывает, что предыдущий символ может быть сопоставлен ноль или более раз, а не ровно один раз.

source: For example, ``ca*t`` will match ``'ct'`` (0 ``'a'`` characters), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` characters), and so forth.
pt_pt: Por exemplo, ``ca*t`` corresponderá a ``'ct'`` (0 caracteres ``'a'``), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 caracteres ``'a'``), e assim por diante.
ru: Например, ``ca*t`` будет соответствовать ``'ct'`` (0 символов ``'a'``), ``'cat'`` (1 ``'a'``), ``' `'caaat'`` (3 символа ``'a'``) и т.д.
