Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: pt_pt, ru

source: :meth:`~re.Pattern.match` and :meth:`~re.Pattern.search` return ``None`` if no match can be found. If they're successful, a :ref:`match object <match-objects>` instance is returned, containing information about the match: where it starts and ends, the substring it matched, and more.
pt_pt: Os métodos :meth:`~re.Pattern.match` e :meth:`~re.Pattern.search` devolvem ``None`` se nenhuma correspondência for encontrada. Se forem bem-sucedidos, é devolvida uma instância de :ref:`objeto de correspondência <match-objects>`, contendo informações sobre a correspondência: onde começa e termina, a subcadeia de caracteres correspondida, e mais.
ru: :meth:`~re.Pattern.match` и :meth:`~re.Pattern.search` возвращают ``None``, если совпадение не найдено. Если они успешны, возвращается экземпляр :ref:`match object <match-objects>`, содержащий информацию о совпадении: где оно начинается и заканчивается, совпадающую подстроку и многое другое.

source: This HOWTO uses the standard Python interpreter for its examples. First, run the Python interpreter, import the :mod:`re` module, and compile a RE::
pt_pt: Este guia utiliza o interpretador Python padrão para os seus exemplos. Primeiro, execute o interpretador Python, importe o módulo :mod:`re` e compile uma RE::
ru: В этом HOWTO для примеров используется стандартный интерпретатор Python. Сначала запустите интерпретатор Python, импортируйте модуль :mod:`re` и скомпилируйте RE::

source: Now, you can try matching various strings against the RE ``[a-z]+``. An empty string shouldn't match at all, since ``+`` means 'one or more repetitions'. :meth:`~re.Pattern.match` should return ``None`` in this case, which will cause the interpreter to print no output. You can explicitly print the result of :meth:`!match` to make this clear. ::
pt_pt: Agora, pode tentar corresponder várias cadeias de caracteres à RE ``[a-z]+``. Uma cadeia de caracteres vazia não deve corresponder, uma vez que ``+`` significa 'uma ou mais repetições'. O método :meth:`~re.Pattern.match` deve devolver ``None`` neste caso, o que fará com que o interpretador não produza saída. Pode imprimir explicitamente o resultado de :meth:`!match` para tornar isto claro. ::
ru: Теперь вы можете попробовать сопоставить различные строки с RE ``[az]+``. Пустая строка вообще не должна совпадать, поскольку ``+`` означает "одно или несколько повторений". :meth:`~re.Pattern.match` в этом случае должен возвращать ``None``, что приведет к тому, что интерпретатор не выведет никаких результатов. Вы можете явно вывести результат :meth:`!match`, чтобы прояснить это. ::

source: Now, let's try it on a string that it should match, such as ``tempo``. In this case, :meth:`~re.Pattern.match` will return a :ref:`match object <match-objects>`, so you should store the result in a variable for later use. ::
pt_pt: Agora, vamos experimentar numa cadeia de caracteres que deve corresponder, como ``tempo``. Neste caso, :meth:`~re.Pattern.match` devolverá um :ref:`objeto de correspondência <match-objects>`, pelo que deve guardar o resultado numa variável para uso posterior. ::
ru: Теперь давайте попробуем это сделать со строкой, которой она должна соответствовать, например, «tempo». В этом случае :meth:`~re.Pattern.match` вернет объект :ref:`match <match-objects>`, поэтому вам следует сохранить результат в переменной для дальнейшего использования. ::

source: Now you can query the :ref:`match object <match-objects>` for information about the matching string. Match object instances also have several methods and attributes; the most important ones are:
pt_pt: Agora pode consultar o :ref:`objeto de correspondência <match-objects>` para obter informações sobre a cadeia de caracteres correspondida. As instâncias de objetos de correspondência também possuem vários métodos e atributos; os mais importantes são:
ru: Теперь вы можете запросить :ref:`match object <match-objects>` для получения информации о соответствующей строке. Экземпляры объекта соответствия также имеют несколько методов и атрибутов; наиболее важные из них:

source: Return the string matched by the RE
pt_pt: Devolve a cadeia de caracteres correspondida pela RE
ru: Вернуть строку, соответствующую RE

source: Return the starting position of the match
pt_pt: Devolve a posição inicial da correspondência
ru: Вернуть исходную позицию матча

source: Return the ending position of the match
pt_pt: Devolve a posição final da correspondência
ru: Вернуть конечную позицию матча

source: Return a tuple containing the (start, end) positions of the match
pt_pt: Devolve um tuplo contendo as posições (início, fim) da correspondência
ru: Возвращает кортеж, содержащий позиции (начало и конец) совпадения.

source: Trying these methods will soon clarify their meaning::
pt_pt: Experimentar estes métodos esclarecerá rapidamente o seu significado::
ru: Попробовав эти методы, вы вскоре проясните их значение:

source: :meth:`~re.Match.group` returns the substring that was matched by the RE. :meth:`~re.Match.start` and :meth:`~re.Match.end` return the starting and ending index of the match. :meth:`~re.Match.span` returns both start and end indexes in a single tuple. Since the :meth:`~re.Pattern.match` method only checks if the RE matches at the start of a string, :meth:`!start` will always be zero. However, the :meth:`~re.Pattern.search` method of patterns scans through the string, so the match may not start at zero in that case. ::
pt_pt: O método :meth:`~re.Match.group` devolve a subcadeia de caracteres que foi correspondida pela RE. Os métodos :meth:`~re.Match.start` e :meth:`~re.Match.end` devolvem os índices de início e fim da correspondência. O método :meth:`~re.Match.span` devolve ambos os índices de início e fim num único tuplo. Uma vez que o método :meth:`~re.Pattern.match` apenas verifica se a RE corresponde no início de uma cadeia de caracteres, :meth:`!start` será sempre zero. No entanto, o método :meth:`~re.Pattern.search` de padrões percorre a cadeia de caracteres, pelo que a correspondência pode não começar em zero nesse caso. ::
ru: :meth:`~re.Match.group` возвращает подстроку, совпадающую с RE. :meth:`~re.Match.start` и :meth:`~re.Match.end` возвращают начальный и конечный индекс совпадения. :meth:`~re.Match.span` возвращает начальный и конечный индексы в одном кортеже. Поскольку метод :meth:`~re.Pattern.match` проверяет только совпадение RE в начале строки, :meth:`!start` всегда будет нулевым. Однако метод шаблонов :meth:`~re.Pattern.search` сканирует строку, поэтому в этом случае совпадение может не начинаться с нуля. ::

source: In actual programs, the most common style is to store the :ref:`match object <match-objects>` in a variable, and then check if it was ``None``. This usually looks like::
pt_pt: Em programas reais, o estilo mais comum é guardar o :ref:`objeto de correspondência <match-objects>` numa variável e, depois, verificar se era ``None``. Isto geralmente parece-se com::
ru: В реальных программах наиболее распространенным стилем является сохранение :ref:`match object <match-objects>` в переменной, а затем проверка, является ли он ``None``. Обычно это выглядит так::

source: Two pattern methods return all of the matches for a pattern. :meth:`~re.Pattern.findall` returns a list of matching strings::
pt_pt: Dois métodos de padrão devolvem todas as correspondências para um padrão. O método :meth:`~re.Pattern.findall` devolve uma lista de cadeias de caracteres correspondidas::
ru: Два метода шаблона возвращают все совпадения шаблона. :meth:`~re.Pattern.findall` возвращает список совпадающих строк::

source: The ``r`` prefix, making the literal a raw string literal, is needed in this example because escape sequences in a normal "cooked" string literal that are not recognized by Python, as opposed to regular expressions, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`. See :ref:`the-backslash-plague`.
pt_pt: O prefixo ``r``, que torna o literal numa cadeia de caracteres bruta literal, é necessário neste exemplo porque as sequências de escape numa literal de cadeia de caracteres "cozinhada" normal que não são reconhecidas pelo Python, ao contrário das expressões regulares, resultam agora num :exc:`DeprecationWarning` e eventualmente tornar-se-ão num :exc:`SyntaxError`. Consulte :ref:`the-backslash-plague`.
ru: Префикс ``r``, делающий литерал необработанным строковым литералом, необходим в этом примере, поскольку escape-последовательности в обычном «приготовленном» строковом литерале, которые не распознаются Python, в отличие от регулярных выражений, теперь приводят к : exc:`DeprecationWarning` и в конечном итоге станет :exc:`SyntaxError`. См. :ref:`the-backslash-plague`.

source: :meth:`~re.Pattern.findall` has to create the entire list before it can be returned as the result. The :meth:`~re.Pattern.finditer` method returns a sequence of :ref:`match object <match-objects>` instances as an :term:`iterator`::
pt_pt: O método :meth:`~re.Pattern.findall` tem de criar a lista completa antes de poder ser devolvida como resultado. O método :meth:`~re.Pattern.finditer` devolve uma sequência de instâncias de :ref:`objetos de correspondência <match-objects>` como um :term:`iterador`::
ru: :meth:`~re.Pattern.findall` должен создать весь список, прежде чем его можно будет вернуть в качестве результата. Метод :meth:`~re.Pattern.finditer` возвращает последовательность экземпляров :ref:`match object <match-objects>` в виде :term:`iterator`::

source: Module-Level Functions
pt_pt: Funções a Nível de Módulo
ru: Функции на уровне модуля

source: You don't have to create a pattern object and call its methods; the :mod:`re` module also provides top-level functions called :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, and so forth. These functions take the same arguments as the corresponding pattern method with the RE string added as the first argument, and still return either ``None`` or a :ref:`match object <match-objects>` instance. ::
pt_pt: Não é necessário criar um objeto de padrão e chamar os seus métodos; o módulo :mod:`re` também fornece funções de nível superior chamadas :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, e assim por diante. Estas funções aceitam os mesmos argumentos que o método de padrão correspondente com a cadeia de caracteres RE adicionada como o primeiro argumento, e ainda devolvem ``None`` ou uma instância de :ref:`objeto de correspondência <match-objects>`. ::
ru: Вам не нужно создавать объект шаблона и вызывать его методы; Модуль :mod:`re` также предоставляет функции верхнего уровня, называемые :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~ re.sub` и так далее. Эти функции принимают те же аргументы, что и соответствующий метод шаблона, со строкой RE, добавленной в качестве первого аргумента, и по-прежнему возвращают либо ``None``, либо экземпляр :ref:`match object <match-objects>`. ::

source: Under the hood, these functions simply create a pattern object for you and call the appropriate method on it. They also store the compiled object in a cache, so future calls using the same RE won't need to parse the pattern again and again.
pt_pt: Por baixo do capot, estas funções simplesmente criam um objeto de padrão para si e chamam o método apropriado nele. Também guardam o objeto compilado numa cache, pelo que chamadas futuras utilizando a mesma RE não precisarão de analisar o padrão repetidamente.
ru: По сути, эти функции просто создают для вас объект шаблона и вызывают для него соответствующий метод. Они также сохраняют скомпилированный объект в кеше, поэтому будущим вызовам, использующим тот же RE, не придется снова и снова анализировать шаблон.

source: Should you use these module-level functions, or should you get the pattern and call its methods yourself? If you're accessing a regex within a loop, pre-compiling it will save a few function calls. Outside of loops, there's not much difference thanks to the internal cache.
pt_pt: Deve utilizar estas funções a nível de módulo ou deve obter o padrão e chamar os seus métodos diretamente? Se estiver a aceder a uma expressão regular dentro de um ciclo, pré-compilá-la poupará algumas chamadas de função. Fora de ciclos, não há muita diferença graças à cache interna.
ru: Стоит ли вам использовать эти функции уровня модуля или вам следует получить шаблон и самостоятельно вызывать его методы? Если вы получаете доступ к регулярному выражению внутри цикла, его предварительная компиляция позволит сэкономить несколько вызовов функций. За пределами циклов особой разницы нет благодаря внутреннему кешу.

source: Compilation Flags
pt_pt: Flags de Compilação
ru: Флаги компиляции

source: Compilation flags let you modify some aspects of how regular expressions work. Flags are available in the :mod:`re` module under two names, a long name such as :const:`IGNORECASE` and a short, one-letter form such as :const:`I`. (If you're familiar with Perl's pattern modifiers, the one-letter forms use the same letters; the short form of :const:`re.VERBOSE` is :const:`re.X`, for example.) Multiple flags can be specified by bitwise OR-ing them; ``re.I | re.M`` sets both the :const:`I` and :const:`M` flags, for example.
pt_pt: As *flags* de compilação permitem modificar alguns aspetos de como as expressões regulares funcionam. As *flags* estão disponíveis no módulo :mod:`re` sob dois nomes, um nome longo como :const:`IGNORECASE` e uma forma curta de uma letra como :const:`I`. (Se estiver familiarizado com os modificadores de padrão do Perl, as formas de uma letra utilizam as mesmas letras; a forma curta de :const:`re.VERBOSE` é :const:`re.X`, por exemplo.) Várias *flags* podem ser especificadas utilizando OR bit a bit; ``re.I | re.M`` define ambas as *flags* :const:`I` e :const:`M`, por exemplo.
ru: Флаги компиляции позволяют изменять некоторые аспекты работы регулярных выражений. Флаги доступны в модуле :mod:`re` под двумя именами: длинным, например :const:`IGNORECASE`, и коротким, состоящим из одной буквы, например :const:`I`. (Если вы знакомы с модификаторами шаблонов Perl, то в однобуквенных формах используются одни и те же буквы; например, краткая форма :const:`re.VERBOSE` — :const:`re.X`.) Можно использовать несколько флагов. быть заданы посредством побитового ИЛИ; ``ре.Я | Например, re.M`` устанавливает оба флага :const:`I` и :const:`M`.

source: Here's a table of the available flags, followed by a more detailed explanation of each one.
pt_pt: Aqui está uma tabela das *flags* disponíveis, seguida de uma explicação mais detalhada de cada uma.
ru: Ниже представлена ​​таблица доступных флагов с более подробным объяснением каждого из них.

source: Flag
ru: Флаг

source: Meaning
pt_pt: Significado
ru: Значение

source: Makes several escapes like ``\w``, ``\b``, ``\s`` and ``\d`` match only on ASCII characters with the respective property.
pt_pt: Faz com que várias sequências de escape como ``\w``, ``\b``, ``\s`` e ``\d`` correspondam apenas a caracteres ASCII com a propriedade respetiva.
ru: Делает несколько управляющих символов, таких как ``\w``, ``\b``, ``\s`` и ``\d``, соответствующими только символам ASCII с соответствующим свойством.

source: Make ``.`` match any character, including newlines.
pt_pt: Faz com que ``.`` corresponda a qualquer caractere, incluindo novas linhas.
ru: Сделайте так, чтобы ``.`` соответствовал любому символу, включая символы новой строки.

source: Do case-insensitive matches.
pt_pt: Realiza correspondências sem distinção de maiúsculas/minúsculas.
ru: Делайте совпадения без учета регистра.

source: Do a locale-aware match.
pt_pt: Realiza uma correspondência com consciência de localização.
ru: Выполните сопоставление с учетом локали.

source: Multi-line matching, affecting ``^`` and ``$``.
pt_pt: Correspondência multi-linha, afetando ``^`` e ``$``.
ru: многострочное сопоставление, затрагивающее ``^`` и ``$``.

source: :const:`VERBOSE`, :const:`X` (for 'extended')
pt_pt: :const:`VERBOSE`, :const:`X` (para 'estendido')
ru: :const:`VERBOSE`, :const:`X` (для 'extended')

source: Enable verbose REs, which can be organized more cleanly and understandably.
pt_pt: Ativa REs verbosas, que podem ser organizadas de forma mais clara e compreensível.
ru: Включите подробные RE, которые можно организовать более четко и понятно.

source: Perform case-insensitive matching; character class and literal strings will match letters by ignoring case. For example, ``[A-Z]`` will match lowercase letters, too. Full Unicode matching also works unless the :const:`ASCII` flag is used to disable non-ASCII matches. When the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). ``Spam`` will match ``'Spam'``, ``'spam'``, ``'spAM'``, or ``'ſpam'`` (the latter is matched only in Unicode mode). This lowercasing doesn't take the current locale into account; it will if you also set the :const:`LOCALE` flag.
pt_pt: Realiza correspondências sem distinção de maiúsculas/minúsculas; classes de caracteres e cadeias de caracteres literais corresponderão a letras ignorando maiúsculas/minúsculas. Por exemplo, ``[A-Z]`` também corresponderá a letras minúsculas. A correspondência Unicode completa também funciona a menos que a *flag* :const:`ASCII` seja utilizada para desativar correspondências não-ASCII. Quando os padrões Unicode ``[a-z]`` ou ``[A-Z]`` são utilizados em combinação com a *flag* :const:`IGNORECASE`, corresponderão às 52 letras ASCII e 4 letras não-ASCII adicionais: 'İ' (U+0130, letra maiúscula latina I com ponto acima), 'ı' (U+0131, letra minúscula latina i sem ponto), 'ſ' (U+017F, letra minúscula latina s longo) e 'K' (U+212A, símbolo Kelvin). ``Spam`` corresponderá a ``'Spam'``, ``'spam'``, ``'spAM'`` ou ``'ſpam'`` (este último apenas em modo Unicode). Esta conversão para minúsculas não tem em conta a localização atual; terá em conta se também definir a *flag* :const:`LOCALE`.
ru: Выполнить сопоставление без учета регистра; класс символов и литеральные строки будут соответствовать буквам, игнорируя регистр. Например, ``[AZ]`` также будет соответствовать строчным буквам. Полное соответствие Юникода также работает, если не используется флаг :const:`ASCII` для отключения совпадений, отличных от ASCII. Когда шаблоны Юникода ``[az]`` или ``[AZ]`` используются в сочетании с флагом :const:`IGNORECASE`, они будут соответствовать 52 буквам ASCII и 4 дополнительным буквам, отличным от ASCII: 'İ ' (U+0130, латинская заглавная буква I с точкой вверху), 'ı' (U+0131, латинская строчная буква без точки i), 'ſ' (U+017F, длинная латинская строчная буква s) и 'K' (U +212А, знак Кельвина). ``Spam`` будет соответствовать ``'Spam'``, ``'spam'``, ``'spAM'`` или ``'Spam'`` (последний сопоставляется только в режиме Unicode). При этом нижнем регистре не учитывается текущая локаль; так и будет, если вы также установите флаг :const:`LOCALE`.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale instead of the Unicode database.
pt_pt: Faz com que ``\w``, ``\W``, ``\b``, ``\B`` e a correspondência sem distinção de maiúsculas/minúsculas dependam da localização atual em vez da base de dados Unicode.
ru: Сделайте ``\w``, ``\W``, ``\b``, ``\B`` и сопоставление без учета регистра зависящим от текущей локали, а не от базы данных Unicode.

source: Locales are a feature of the C library intended to help in writing programs that take account of language differences. For example, if you're processing encoded French text, you'd want to be able to write ``\w+`` to match words, but ``\w`` only matches the character class ``[A-Za-z]`` in bytes patterns; it won't match bytes corresponding to ``é`` or ``ç``. If your system is configured properly and a French locale is selected, certain C functions will tell the program that the byte corresponding to ``é`` should also be considered a letter. Setting the :const:`LOCALE` flag when compiling a regular expression will cause the resulting compiled object to use these C functions for ``\w``; this is slower, but also enables ``\w+`` to match French words as you'd expect. The use of this flag is discouraged in Python 3 as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages.
pt_pt: As localizações são uma funcionalidade da biblioteca C destinada a ajudar na escrita de programas que têm em conta as diferenças linguísticas. Por exemplo, se estiver a processar texto francês codificado, gostaria de poder escrever ``\w+`` para corresponder a palavras, mas ``\w`` apenas corresponde à classe de caracteres ``[A-Za-z]`` em padrões de *bytes*; não corresponderá a *bytes* correspondentes a ``é`` ou ``ç``. Se o seu sistema estiver configurado corretamente e uma localização francesa estiver selecionada, certas funções C dirão ao programa que o *byte* correspondente a ``é`` também deve ser considerado uma letra. Definir a *flag* :const:`LOCALE` ao compilar uma expressão regular fará com que o objeto compilado resultante utilize estas funções C para ``\w``; isto é mais lento, mas também permite que ``\w+`` corresponda a palavras francesas como esperado. O uso desta *flag* é desencorajado em Python 3, uma vez que o mecanismo de localização é muito pouco fiável, apenas lida com uma "cultura" de cada vez e apenas funciona com localizações de 8 bits. A correspondência Unicode já está ativada por defeito em Python 3 para padrões Unicode (str), e é capaz de lidar com diferentes localizações/idiomas.
ru: Локали — это функция библиотеки C, предназначенная для помощи в написании программ, учитывающих языковые различия. Например, если вы обрабатываете закодированный текст на французском языке, вы хотели бы иметь возможность писать ``\w+`` для сопоставления слов, но ``\w`` соответствует только классу символов ``[A-Za- z]`` в шаблонах байтов; он не будет соответствовать байтам, соответствующим ``é`` или ``ç``. Если ваша система настроена правильно и выбрана французская локаль, некоторые функции C сообщат программе, что байт, соответствующий ``é``, также следует считать буквой. Установка флага :const:`LOCALE` при компиляции регулярного выражения приведет к тому, что результирующий скомпилированный объект будет использовать эти функции C для ``\w``; это медленнее, но также позволяет ``\w+`` соответствовать французским словам, как и следовало ожидать. Использование этого флага не рекомендуется в Python 3, поскольку механизм локали очень ненадежен, он обрабатывает только одну «культуру» за раз и работает только с 8-битными локалями. Сопоставление Юникода уже включено по умолчанию в Python 3 для шаблонов Юникода (str) и может обрабатывать различные локали/языки.

source: (``^`` and ``$`` haven't been explained yet; they'll be introduced in section :ref:`more-metacharacters`.)
pt_pt: (``^`` e ``$`` ainda não foram explicados; serão introduzidos na secção :ref:`more-metacharacters`.)
ru: (``^`` и ``$`` еще не объяснены; они будут представлены в разделе :ref:`more-metacharacters`.)
