Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: pt_pt, ru

source: The :func:`~re.match` function only checks if the RE matches at the beginning of the string while :func:`~re.search` will scan forward through the string for a match. It's important to keep this distinction in mind. Remember, :func:`!match` will only report a successful match which will start at 0; if the match wouldn't start at zero, :func:`!match` will *not* report it. ::
pt_pt: A função :func:`~re.match` verifica apenas se a RE corresponde no início da cadeia de caracteres, enquanto :func:`~re.search` percorrerá a cadeia de caracteres em busca de uma correspondência. É importante manter esta distinção em mente. Lembre-se, :func:`!match` apenas reportará uma correspondência bem-sucedida que começará em 0; se a correspondência não começar em zero, :func:`!match` *não* a reportará. ::
ru: Функция :func:`~re.match` проверяет только совпадение RE в начале строки, тогда как :func:`~re.search` будет сканировать строку вперед в поисках совпадений. Важно помнить об этом различии. Помните, :func:`!match` сообщит только об успешном совпадении, которое начинается с 0; если совпадение не начнется с нуля, :func:`!match` *не* сообщит об этом. ::

source: On the other hand, :func:`~re.search` will scan forward through the string, reporting the first match it finds. ::
pt_pt: Por outro lado, :func:`~re.search` percorrerá a cadeia de caracteres, reportando a primeira correspondência que encontrar. ::
ru: С другой стороны, :func:`~re.search` будет сканировать строку вперед, сообщая о первом найденном совпадении. ::

source: Sometimes you'll be tempted to keep using :func:`re.match`, and just add ``.*`` to the front of your RE. Resist this temptation and use :func:`re.search` instead. The regular expression compiler does some analysis of REs in order to speed up the process of looking for a match. One such analysis figures out what the first character of a match must be; for example, a pattern starting with ``Crow`` must match starting with a ``'C'``. The analysis lets the engine quickly scan through the string looking for the starting character, only trying the full match if a ``'C'`` is found.
pt_pt: Às vezes, será tentado a continuar a usar :func:`re.match` e simplesmente adicionar ``.*`` ao início da sua RE. Resista a esta tentação e use :func:`re.search` em vez disso. O compilador de expressões regulares faz alguma análise das REs para acelerar o processo de procura de uma correspondência. Uma dessas análises descobre qual deve ser o primeiro caractere de uma correspondência; por exemplo, um padrão que comece com ``Crow`` deve corresponder começando com um ``'C'``. A análise permite que o motor percorra rapidamente a cadeia de caracteres à procura do caractere de início, tentando a correspondência completa apenas se um ``'C'`` for encontrado.
ru: Иногда у вас может возникнуть соблазн продолжать использовать :func:`re.match` и просто добавлять ``.*`` в начало вашего RE. Не поддавайтесь этому искушению и вместо этого используйте :func:`re.search`. Компилятор регулярных выражений выполняет некоторый анализ RE, чтобы ускорить процесс поиска соответствия. Один из таких анализов позволяет выяснить, каким должен быть первый символ совпадения; например, шаблон, начинающийся с «Crow», должен соответствовать букве, начинающейся с «C». Анализ позволяет движку быстро сканировать строку в поисках начального символа, пробуя полное совпадение только в том случае, если найден ``'C'``.

source: Adding ``.*`` defeats this optimization, requiring scanning to the end of the string and then backtracking to find a match for the rest of the RE. Use :func:`re.search` instead.
pt_pt: Adicionar ``.*`` anula esta otimização, exigindo a varredura até ao final da cadeia de caracteres e, em seguida, retrocesso para encontrar uma correspondência para o resto da RE. Use :func:`re.search` em vez disso.
ru: Добавление ``.*`` отменяет эту оптимизацию, требуя сканирования до конца строки, а затем возврата, чтобы найти совпадение для остальной части RE. Вместо этого используйте :func:`re.search`.

source: Greedy versus Non-Greedy
pt_pt: Ganancioso versus Não-Ganancioso
ru: Жадный против нежадного

source: When repeating a regular expression, as in ``a*``, the resulting action is to consume as much of the pattern as possible. This fact often bites you when you're trying to match a pair of balanced delimiters, such as the angle brackets surrounding an HTML tag. The naive pattern for matching a single HTML tag doesn't work because of the greedy nature of ``.*``. ::
pt_pt: Ao repetir uma expressão regular, como em ``a*``, a ação resultante é consumir o máximo possível do padrão. Este facto muitas vezes causa problemas quando está a tentar corresponder a um par de delimitadores equilibrados, como as chavetas que rodeiam uma etiqueta HTML. O padrão ingénuo para corresponder a uma única etiqueta HTML não funciona devido à natureza gananciosa de ``.*``. ::
ru: При повторении регулярного выражения, например ``a*``, результатом является использование как можно большей части шаблона. Этот факт часто бросается в глаза, когда вы пытаетесь сопоставить пару сбалансированных разделителей, таких как угловые скобки, окружающие тег HTML. Наивный шаблон для сопоставления одного тега HTML не работает из-за жадной природы ``.*``. ::

source: The RE matches the ``'<'`` in ``'<html>'``, and the ``.*`` consumes the rest of the string. There's still more left in the RE, though, and the ``>`` can't match at the end of the string, so the regular expression engine has to backtrack character by character until it finds a match for the ``>``. The final match extends from the ``'<'`` in ``'<html>'`` to the ``'>'`` in ``'</title>'``, which isn't what you want.
pt_pt: A RE corresponde ao ``'<'`` em ``'<html>'``, e o ``.*`` consome o resto da cadeia de caracteres. No entanto, ainda há mais na RE, e o ``>`` não pode corresponder ao final da cadeia de caracteres, pelo que o motor de expressões regulares tem de retroceder caractere a caractere até encontrar uma correspondência para o ``>``. A correspondência final estende-se do ``'<'`` em ``'<html>'`` ao ``'>'`` em ``'</title>'``, o que não é o que pretende.
ru: RE соответствует ``'<'`` в ``'<html>'``, а ``.*`` поглощает остальную часть строки. Однако в RE еще осталось еще больше, и ``>`` не может соответствовать концу строки, поэтому механизму регулярных выражений приходится возвращаться посимвольно, пока не найдет совпадение для ``>` `. Окончательное совпадение простирается от ``'<'`` в ``'<html>'`` до ``'>'`` в ``'</title>'``, а это не то, что вы хотеть.

source: In this case, the solution is to use the non-greedy quantifiers ``*?``, ``+?``, ``??``, or ``{m,n}?``, which match as *little* text as possible. In the above example, the ``'>'`` is tried immediately after the first ``'<'`` matches, and when it fails, the engine advances a character at a time, retrying the ``'>'`` at every step. This produces just the right result::
pt_pt: Neste caso, a solução é usar os quantificadores não gananciosos ``*?``, ``+?``, ``??``, ou ``{m,n}?``, que correspondem ao *menor* texto possível. No exemplo acima, o ``'>'`` é tentado imediatamente após a primeira correspondência de ``'<'``, e quando falha, o motor avança um caractere de cada vez, tentando novamente o ``'>'`` em cada passo. Isto produz exatamente o resultado pretendido::
ru: В этом случае решением является использование нежадных кванторов ``*?``, ``+?``, ``??`` или ``{m,n}?``, которые соответствуют как *немного* текста, насколько это возможно. В приведенном выше примере ``'>'`` пробуется сразу после первого совпадения ``'<'``, и в случае неудачи движок продвигает вперед символ за раз, повторяя ``'>'` ` на каждом шагу. Это дает правильный результат::

source: (Note that parsing HTML or XML with regular expressions is painful. Quick-and-dirty patterns will handle common cases, but HTML and XML have special cases that will break the obvious regular expression; by the time you've written a regular expression that handles all of the possible cases, the patterns will be *very* complicated. Use an HTML or XML parser module for such tasks.)
ru: (Обратите внимание, что анализ HTML или XML с помощью регулярных выражений является болезненным занятием. Шаблоны на скорую руку справляются с обычными случаями, но HTML и XML имеют особые случаи, которые нарушают очевидное регулярное выражение; к тому времени, как вы напишете регулярное выражение, обрабатывает все возможные случаи, шаблоны будут *очень* сложными. Для таких задач используйте модуль анализатора HTML или XML.)

source: Using re.VERBOSE
pt_pt: A Utilizar re.VERBOSE
ru: Использование re.VERBOSE

source: By now you've probably noticed that regular expressions are a very compact notation, but they're not terribly readable. REs of moderate complexity can become lengthy collections of backslashes, parentheses, and metacharacters, making them difficult to read and understand.
pt_pt: Até agora, provavelmente já notou que as expressões regulares são uma notação muito compacta, mas não são particularmente legíveis. REs de complexidade moderada podem tornar-se longas coleções de barras invertidas, parênteses e metacaracteres, tornando-as difíceis de ler e compreender.
ru: Вы, наверное, уже заметили, что регулярные выражения — это очень компактная запись, но она не очень читабельна. RE средней сложности могут представлять собой длинные наборы обратных косых черт, круглых скобок и метасимволов, что затрудняет их чтение и понимание.

source: For such REs, specifying the :const:`re.VERBOSE` flag when compiling the regular expression can be helpful, because it allows you to format the regular expression more clearly.
pt_pt: Para tais REs, especificar a *flag* :const:`re.VERBOSE` ao compilar a expressão regular pode ser útil, porque permite formatar a expressão regular de forma mais clara.
ru: Для таких RE указание флага :const:`re.VERBOSE` при компиляции регулярного выражения может быть полезным, поскольку это позволяет более четко форматировать регулярное выражение.

source: The ``re.VERBOSE`` flag has several effects. Whitespace in the regular expression that *isn't* inside a character class is ignored. This means that an expression such as ``dog | cat`` is equivalent to the less readable ``dog|cat``, but ``[a b]`` will still match the characters ``'a'``, ``'b'``, or a space. In addition, you can also put comments inside a RE; comments extend from a ``#`` character to the next newline. When used with triple-quoted strings, this enables REs to be formatted more neatly::
pt_pt: Aflag ``re.VERBOSE`` tem vários efeitos. Os espaços em branco na expressão regular que *não* estão dentro de uma classe de caracteres são ignorados. Isto significa que uma expressão como ``dog | cat`` é equivalente à menos legível ``dog|cat``, mas ``[a b]`` ainda corresponderá aos caracteres ``'a'``, ``'b'`` ou um espaço. Além disso, também é possível colocar comentários dentro de uma RE; os comentários se estendem do carácter ``#`` até a próxima nova linha. Quando utilizado com strings entre aspas triplas, isto permite que as REs sejam formatadas de maneira mais organizada::
ru: Флаг ``re.VERBOSE`` имеет несколько эффектов. Пробелы в регулярном выражении, *не* находящиеся внутри класса символов, игнорируются. Это означает, что такое выражение, как ``собака | cat`` эквивалентен менее читаемому ``dog|cat``, но ``[ab]`` по-прежнему будет соответствовать символам ``'a'``, ``'b'`` или пробелу. Кроме того, вы также можете размещать комментарии внутри RE; комментарии простираются от символа ``#`` до следующей новой строки. При использовании со строками в тройных кавычках это позволяет более аккуратно форматировать RE:

source: This is far more readable than::
pt_pt: Isto é muito mais legível do que::
ru: Это гораздо более читабельно, чем::

source: Feedback
ru: Обратная связь

source: Regular expressions are a complicated topic. Did this document help you understand them? Were there parts that were unclear, or Problems you encountered that weren't covered here? If so, please send suggestions for improvements to the author.
pt_pt: As expressões regulares são um tópico complicado. Este documento ajudou-o a compreendê-las? Houve partes que não estavam claras ou problemas que encontrou que não foram abordados aqui? Se sim, por favor envie sugestões de melhorias para o autor.
ru: Регулярные выражения — сложная тема. Помог ли этот документ вам их понять? Были ли какие-то моменты непонятны или возникли проблемы, которые здесь не описаны? Если да, пожалуйста, пришлите предложения по улучшению автору.

source: The most complete book on regular expressions is almost certainly Jeffrey Friedl's Mastering Regular Expressions, published by O'Reilly. Unfortunately, it exclusively concentrates on Perl and Java's flavours of regular expressions, and doesn't contain any Python material at all, so it won't be useful as a reference for programming in Python. (The first edition covered Python's now-removed :mod:`!regex` module, which won't help you much.) Consider checking it out from your library.
pt_pt: O livro mais completo sobre expressões regulares é quase certamente Mastering Regular Expressions de Jeffrey Friedl, publicado pela O'Reilly. Infelizmente, concentra-se exclusivamente nas variantes de expressões regulares do Perl e do Java, e não contém qualquer material sobre Python, pelo que não será útil como referência para programação em Python. (A primeira edição cobria o módulo :mod:`!regex` do Python, agora removido, que não o ajudará muito.) Considere requisitá-lo na sua biblioteca.
ru: Наиболее полной книгой по регулярным выражениям почти наверняка является книга Джеффри Фридла «Освоение регулярных выражений», опубликованная О'Рейли. К сожалению, он сосредоточен исключительно на вариантах регулярных выражений Perl и Java и вообще не содержит материалов по Python, поэтому он не будет полезен в качестве справочника по программированию на Python. (В первом издании речь шла об уже удаленном из Python модуле :mod:`!regex`, который вам мало чем поможет.) Попробуйте проверить его в своей библиотеке.

source: You can learn about this by interactively experimenting with the :mod:`re` module.
pt_pt: Pode aprender sobre isto experimentando interativamente com o módulo :mod:`re`.

source: p = re.compile( ... ) m = p.match( 'string goes here' ) if m: print('Match found: ', m.group()) else: print('No match')
pt_pt: p = re.compile( ... ) m = p.match( 'a cadeia de caracteres vai aqui' ) if m: print('Correspondência encontrada: ', m.group()) else: print('Sem correspondência')

source: >>> p = re.compile(r'\d+') >>> p.findall('12 drummers drumming, 11 pipers piping, 10 lords a-leaping') ['12', '11', '10']
pt_pt: >>> p = re.compile(r'\d+') >>> p.findall('12 tamborileiros a tamborilar, 11 gaitistas a tocar, 10 senhores a saltar') ['12', '11', '10']

source: >>> iterator = p.finditer('12 drummers drumming, 11 ... 10 ...') >>> iterator <callable_iterator object at 0x...> >>> for match in iterator: ... print(match.span()) ... (0, 2) (22, 24) (29, 31)
pt_pt: >>> iterator = p.finditer('12 tamborileiros a tamborilar, 11 ... 10 ...') >>> iterator <callable_iterator object at 0x...> >>> for match in iterator: ... print(match.span()) ... (0, 2) (22, 24) (29, 31)

source: >>> print(re.match(r'From\s+', 'Fromage amk')) None >>> re.match(r'From\s+', 'From amk Thu May 14 19:12:10 1998') <re.Match object; span=(0, 5), match='From '>
pt_pt: >>> print(re.match(r'From\s+', 'Fromage amk')) None >>> re.match(r'From\s+', 'From amk Qui Mai 14 19:12:10 1998') <re.Match object; span=(0, 5), match='From '>

source: charref = re.compile(r""" &[#] # Start of a numeric entity reference ( 0[0-7]+ # Octal form | [0-9]+ # Decimal form | x[0-9a-fA-F]+ # Hexadecimal form ) ; # Trailing semicolon """, re.VERBOSE)
pt_pt: charref = re.compile(r""" &[#] # Início de uma referência de entidade numérica ( 0[0-7]+ # Forma octal | [0-9]+ # Forma decimal | x[0-9a-fA-F]+ # Forma hexadecimal ) ; # Ponto e vírgula final """, re.VERBOSE)
