Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: pt_pt, ru

source: Usually ``^`` matches only at the beginning of the string, and ``$`` matches only at the end of the string and immediately before the newline (if any) at the end of the string. When this flag is specified, ``^`` matches at the beginning of the string and at the beginning of each line within the string, immediately following each newline. Similarly, the ``$`` metacharacter matches either at the end of the string and at the end of each line (immediately preceding each newline).
pt_pt: Normalmente, ``^`` corresponde apenas no início da cadeia de caracteres, e ``$`` corresponde apenas no final da cadeia de caracteres e imediatamente antes da nova linha (se existir) no final da cadeia de caracteres. Quando esta *flag* é especificada, ``^`` corresponde no início da cadeia de caracteres e no início de cada linha dentro da cadeia de caracteres, imediatamente após cada nova linha. Da mesma forma, o metacaractere ``$`` corresponde no final da cadeia de caracteres e no final de cada linha (imediatamente antes de cada nova linha).
ru: Обычно ``^`` соответствует только началу строки, а ``$`` соответствует только концу строки и непосредственно перед символом новой строки (если таковой имеется) в конце строки. Если указан этот флаг, ``^`` соответствует началу строки и началу каждой строки внутри строки, сразу после каждой новой строки. Аналогично, метасимвол ``$`` соответствует либо в конце строки, либо в конце каждой строки (непосредственно перед каждой новой строкой).

source: Makes the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline.
pt_pt: Faz com que o caractere especial ``'.'`` corresponda a qualquer caractere, incluindo uma nova linha; sem esta *flag*, ``'.'`` corresponderá a qualquer coisa *exceto* uma nova linha.
ru: Делает специальный символ ``'.'`` соответствующим любому символу, включая новую строку; без этого флага ``'.'`` будет соответствовать всему, *кроме* новой строки.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns.
pt_pt: Faz com que ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` e ``\S`` realizem correspondência apenas ASCII em vez de correspondência Unicode completa. Isto é apenas significativo para padrões Unicode e é ignorado para padrões de *bytes*.
ru: Заставить ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` и ``\S`` выполнять сопоставление только в формате ASCII вместо полного Соответствие Юникода. Это имеет смысл только для шаблонов Юникода и игнорируется для байтовых шаблонов.

source: This flag allows you to write regular expressions that are more readable by granting you more flexibility in how you can format them. When this flag has been specified, whitespace within the RE string is ignored, except when the whitespace is in a character class or preceded by an unescaped backslash; this lets you organize and indent the RE more clearly. This flag also lets you put comments within a RE that will be ignored by the engine; comments are marked by a ``'#'`` that's neither in a character class or preceded by an unescaped backslash.
pt_pt: Esta *flag* permite escrever expressões regulares mais legíveis, concedendo mais flexibilidade na forma como as pode formatar. Quando esta *flag* é especificada, os espaços em branco dentro da cadeia de caracteres RE são ignorados, exceto quando os espaços em branco estão numa classe de caracteres ou são precedidos por uma barra invertida não escapada; isto permite organizar e indentar a RE de forma mais clara. Esta *flag* também permite colocar comentários dentro de uma RE que serão ignorados pelo motor; os comentários são marcados por um ``'#'`` que não está numa classe de caracteres ou é precedido por uma barra invertida não escapada.
ru: Этот флаг позволяет вам писать регулярные выражения, которые более читабельны, предоставляя вам большую гибкость в их форматировании. Если указан этот флаг, пробелы в строке RE игнорируются, за исключением случаев, когда пробелы находятся в классе символов или им предшествует неэкранированная обратная косая черта; это позволяет более четко организовать и отступить от RE. Этот флаг также позволяет вам помещать комментарии в RE, которые будут игнорироваться движком; комментарии помечаются символом ``'#'``, который не принадлежит классу символов и которому не предшествует неэкранированная обратная косая черта.

source: For example, here's a RE that uses :const:`re.VERBOSE`; see how much easier it is to read? ::
pt_pt: Por exemplo, aqui está uma RE que utiliza :const:`re.VERBOSE`; veja como é mais fácil de ler? ::
ru: Например, вот RE, который использует :const:`re.VERBOSE`; видите, насколько легче читать? ::

source: Without the verbose setting, the RE would look like this::
pt_pt: Sem a definição verbosa, a RE seria assim::
ru: Без подробной настройки RE выглядело бы так:

source: In the above example, Python's automatic concatenation of string literals has been used to break up the RE into smaller pieces, but it's still more difficult to understand than the version using :const:`re.VERBOSE`.
pt_pt: No exemplo acima, a concatenação automática de literais de cadeias de caracteres do Python foi utilizada para dividir a RE em partes mais pequenas, mas ainda é mais difícil de compreender do que a versão que utiliza :const:`re.VERBOSE`.
ru: В приведенном выше примере для разбиения RE на более мелкие части использовалась автоматическая конкатенация строковых литералов Python, но ее все равно сложнее понять, чем версию, использующую :const:`re.VERBOSE`.

source: More Pattern Power
pt_pt: Mais Poder de Padrões
ru: Больше силы паттерна

source: So far we've only covered a part of the features of regular expressions. In this section, we'll cover some new metacharacters, and how to use groups to retrieve portions of the text that was matched.
pt_pt: Até agora, apenas cobrimos uma parte das funcionalidades das expressões regulares. Nesta secção, abordaremos alguns novos metacaracteres e como utilizar grupos para recuperar porções do texto que foi correspondido.
ru: До сих пор мы рассмотрели лишь часть возможностей регулярных выражений. В этом разделе мы рассмотрим некоторые новые метасимволы и способы использования групп для извлечения частей совпавшего текста.

source: More Metacharacters
pt_pt: Mais Metacaracteres
ru: Больше метасимволов

source: There are some metacharacters that we haven't covered yet. Most of them will be covered in this section.
pt_pt: Existem alguns metacaracteres que ainda não abordámos. A maioria deles será abordada nesta secção.
ru: Есть некоторые метасимволы, которые мы еще не рассмотрели. Большинство из них будут рассмотрены в этом разделе.

source: Some of the remaining metacharacters to be discussed are :dfn:`zero-width assertions`. They don't cause the engine to advance through the string; instead, they consume no characters at all, and simply succeed or fail. For example, ``\b`` is an assertion that the current position is located at a word boundary; the position isn't changed by the ``\b`` at all. This means that zero-width assertions should never be repeated, because if they match once at a given location, they can obviously be matched an infinite number of times.
pt_pt: Alguns dos metacaracteres restantes a serem discutidos são :dfn:`asserções de largura zero`. Eles não fazem com que o motor avance através da cadeia de caracteres; em vez disso, não consomem quaisquer caracteres e simplesmente têm sucesso ou falham. Por exemplo, ``\b`` é uma asserção de que a posição atual está localizada num limite de palavra; a posição não é alterada pelo ``\b``. Isto significa que as asserções de largura zero nunca devem ser repetidas, porque se corresponderem uma vez numa determinada localização, podem obviamente ser correspondidas um número infinito de vezes.
ru: Некоторые из оставшихся метасимволов, которые предстоит обсудить, — это :dfn:`утверждения нулевой ширины`. Они не заставляют двигатель продвигаться по струне; вместо этого они вообще не используют символы и просто добиваются успеха или терпят неудачу. Например, ``\b`` — это утверждение, что текущая позиция находится на границе слова; позиция вообще не меняется с помощью ``\b``. Это означает, что утверждения нулевой ширины никогда не должны повторяться, потому что, если они совпадают один раз в заданном месте, очевидно, что они могут быть сопоставлены бесконечное количество раз.

source: Alternation, or the "or" operator. If *A* and *B* are regular expressions, ``A|B`` will match any string that matches either *A* or *B*. ``|`` has very low precedence in order to make it work reasonably when you're alternating multi-character strings. ``Crow|Servo`` will match either ``'Crow'`` or ``'Servo'``, not ``'Cro'``, a ``'w'`` or an ``'S'``, and ``'ervo'``.
pt_pt: Alternância, ou o operador "ou". Se *A* e *B* são expressões regulares, ``A|B`` corresponderá a qualquer cadeia de caracteres que corresponda a *A* ou *B*. ``|`` tem uma precedência muito baixa para funcionar de forma razoável quando está a alternar cadeias de caracteres com vários caracteres. ``Crow|Servo`` corresponderá a ``'Crow'`` ou ``'Servo'``, não a ``'Cro'``, um ``'w'`` ou um ``'S'``, e ``'ervo'``.
ru: Чередование, или оператор «или». Если *A* и *B* являются регулярными выражениями, ``A|B`` будет соответствовать любой строке, соответствующей либо *A*, либо *B*. ``|`` имеет очень низкий приоритет, чтобы обеспечить его разумную работу при чередовании многосимвольных строк. ``Crow|Servo`` будет соответствовать либо ``'Crow'``, либо ``'Servo'``, но не ``'Cro'``, ``'w'`` или ``'S'. `` и ``'эрво'``.

source: To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
pt_pt: Para corresponder a um ``'|'`` literal, use ``\|``, ou inclua-o dentro de uma classe de caracteres, como em ``[|]``.
ru: Чтобы сопоставить литерал ``'|'``, используйте ``\|`` или заключите его в класс символов, как в ``[|]``.

source: Matches at the beginning of lines. Unless the :const:`MULTILINE` flag has been set, this will only match at the beginning of the string. In :const:`MULTILINE` mode, this also matches immediately after each newline within the string.
pt_pt: Corresponde ao início das linhas. A menos que a *flag* :const:`MULTILINE` esteja definida, isto corresponderá apenas ao início da cadeia de caracteres. Em modo :const:`MULTILINE`, isto também corresponde imediatamente após cada nova linha dentro da cadeia de caracteres.
ru: Совпадения в начале строк. Если не установлен флаг :const:`MULTILINE`, он будет соответствовать только началу строки. В режиме :const:`MULTILINE` это также соответствует сразу после каждой новой строки в строке.

source: For example, if you wish to match the word ``From`` only at the beginning of a line, the RE to use is ``^From``. ::
pt_pt: Por exemplo, se pretender corresponder à palavra ``From`` apenas no início de uma linha, a RE a utilizar é ``^From``. ::
ru: Например, если вы хотите, чтобы слово «From» соответствовало только началу строки, используйте RE — «^From». ::

source: To match a literal ``'^'``, use ``\^``.
pt_pt: Para corresponder a um ``'^'`` literal, use ``\^``.
ru: Чтобы сопоставить литерал ``'^'``, используйте ``\^``.

source: Matches at the end of a line, which is defined as either the end of the string, or any location followed by a newline character. ::
pt_pt: Corresponde ao final de uma linha, que é definido como o final da cadeia de caracteres ou qualquer localização seguida de um caractere de nova linha. ::
ru: Соответствует концу строки, которая определяется как конец строки или любое место, за которым следует символ новой строки. ::

source: To match a literal ``'$'``, use ``\$`` or enclose it inside a character class, as in ``[$]``.
pt_pt: Para corresponder a um ``'$'`` literal, use ``\$`` ou inclua-o dentro de uma classe de caracteres, como em ``[$]``.
ru: Чтобы сопоставить литерал ``'$'``, используйте ``\$`` или заключите его в класс символов, как в ``[$]``.

source: Matches only at the start of the string. When not in :const:`MULTILINE` mode, ``\A`` and ``^`` are effectively the same. In :const:`MULTILINE` mode, they're different: ``\A`` still matches only at the beginning of the string, but ``^`` may match at any location inside the string that follows a newline character.
pt_pt: Corresponde apenas ao início da cadeia de caracteres. Quando não está em modo :const:`MULTILINE`, ``\A`` e ``^`` são efetivamente iguais. Em modo :const:`MULTILINE`, são diferentes: ``\A`` ainda corresponde apenas ao início da cadeia de caracteres, mas ``^`` pode corresponder a qualquer localização dentro da cadeia de caracteres que segue um caractere de nova linha.
ru: Соответствует только началу строки. Если режим не :const:`MULTILINE`, ``\A`` и ``^`` фактически одинаковы. В режиме :const:`MULTILINE` они отличаются: ``\A`` по-прежнему соответствует только началу строки, но ``^`` может соответствовать любому месту внутри строки, следующему за символом новой строки.

source: Matches only at the end of the string.
pt_pt: Corresponde apenas ao final da cadeia de caracteres.
ru: Соответствует только концу строки.

source: Word boundary. This is a zero-width assertion that matches only at the beginning or end of a word. A word is defined as a sequence of alphanumeric characters, so the end of a word is indicated by whitespace or a non-alphanumeric character.
pt_pt: Limite da palavra. Trata-se de uma afirmação de largura zero que corresponde apenas ao início ou ao fim de uma palavra. Uma palavra é definida como uma sequência de caracteres alfanuméricos, portanto, o fim de uma palavra é indicado por um espaço em branco ou por um carácter não alfanumérico.
ru: Граница слова. Это утверждение нулевой ширины, которое соответствует только началу или концу слова. Слово определяется как последовательность буквенно-цифровых символов, поэтому конец слова обозначается пробелом или небуквенно-цифровым символом.

source: The following example matches ``class`` only when it's a complete word; it won't match when it's contained inside another word. ::
pt_pt: O exemplo seguinte corresponde a ``class`` apenas quando é uma palavra completa; não corresponderá quando está contida dentro de outra palavra. ::
ru: Следующий пример соответствует ``class`` только тогда, когда это полное слово; оно не будет совпадать, если оно содержится внутри другого слова. ::

source: There are two subtleties you should remember when using this special sequence. First, this is the worst collision between Python's string literals and regular expression sequences. In Python's string literals, ``\b`` is the backspace character, ASCII value 8. If you're not using raw strings, then Python will convert the ``\b`` to a backspace, and your RE won't match as you expect it to. The following example looks the same as our previous RE, but omits the ``'r'`` in front of the RE string. ::
pt_pt: Existem duas subtilezas que deve recordar ao utilizar esta sequência especial. Primeiro, esta é a pior colisão entre os literais de cadeias de caracteres do Python e as sequências de expressões regulares. Nos literais de cadeias de caracteres do Python, ``\b`` é o caractere de retrocesso, valor ASCII 8. Se não estiver a utilizar cadeias de caracteres brutas, então o Python converterá o ``\b`` num retrocesso, e a sua RE não corresponderá como espera. O exemplo seguinte parece igual à nossa RE anterior, mas omite o ``'r'`` antes da cadeia de caracteres RE. ::
ru: При использовании этой специальной последовательности следует помнить две тонкости. Во-первых, это худшее противоречие между строковыми литералами Python и последовательностями регулярных выражений. В строковых литералах Python ``\b`` — это символ возврата, значение ASCII 8. Если вы не используете необработанные строки, Python преобразует ``\b`` в обратный пробел, и ваш RE не будет соответствует вашим ожиданиям. Следующий пример выглядит так же, как наш предыдущий RE, но в нем отсутствует ``'r'`` перед строкой RE. ::

source: Second, inside a character class, where there's no use for this assertion, ``\b`` represents the backspace character, for compatibility with Python's string literals.
pt_pt: Segundo, dentro de uma classe de caracteres, onde não há uso para esta asserção, ``\b`` representa o caractere de retrocesso, para compatibilidade com os literais de cadeias de caracteres do Python.
ru: Во-вторых, внутри класса символов, где это утверждение бесполезно, ``\b`` представляет собой символ обратного пространства для совместимости со строковыми литералами Python.

source: Another zero-width assertion, this is the opposite of ``\b``, only matching when the current position is not at a word boundary.
pt_pt: Outra asserção de largura zero, esta é o oposto de ``\b``, correspondendo apenas quando a posição atual não está num limite de palavra.
ru: Другое утверждение нулевой ширины, противоположное ``\b``, совпадает только тогда, когда текущая позиция не находится на границе слова.

source: Grouping
pt_pt: Agrupamento
ru: Группировка

source: Frequently you need to obtain more information than just whether the RE matched or not. Regular expressions are often used to dissect strings by writing a RE divided into several subgroups which match different components of interest. For example, an RFC-822 header line is divided into a header name and a value, separated by a ``':'``, like this:
pt_pt: Frequentemente, precisa de obter mais informações do que apenas se a RE correspondeu ou não. As expressões regulares são frequentemente usadas para dissecar cadeias de caracteres, escrevendo uma RE dividida em vários subgrupos que correspondem a diferentes componentes de interesse. Por exemplo, uma linha de cabeçalho RFC-822 é dividida num nome de cabeçalho e num valor, separados por um ``':'``, como isto:
ru: Часто вам нужно получить больше информации, чем просто о том, совпадают данные или нет. Регулярные выражения часто используются для разделения строк путем записи данных, разделенных на несколько подгрупп, которые соответствуют различным интересующим компонентам. Например, строка заголовка RFC-822 разделена на имя заголовка и значение, разделенные символом ``':'``, вот так:

source: This can be handled by writing a regular expression which matches an entire header line, and has one group which matches the header name, and another group which matches the header's value.
ru: Это можно решить, написав регулярное выражение, которое соответствует всей строке заголовка и содержит одну группу, соответствующую имени заголовка, и другую группу, соответствующую значению заголовка.

source: Groups are marked by the ``'('``, ``')'`` metacharacters. ``'('`` and ``')'`` have much the same meaning as they do in mathematical expressions; they group together the expressions contained inside them, and you can repeat the contents of a group with a quantifier, such as ``*``, ``+``, ``?``, or ``{m,n}``. For example, ``(ab)*`` will match zero or more repetitions of ``ab``. ::
pt_pt: Os grupos são marcados pelos metacaracteres ``'('``, ``')'``. ``'('`` e ``')'`` têm muito o mesmo significado que têm nas expressões matemáticas; agrupam as expressões contidas dentro deles, e pode repetir o conteúdo de um grupo com um quantificador, como ``*``, ``+``, ``?``, ou ``{m,n}``. Por exemplo, ``(ab)*`` corresponderá a zero ou mais repetições de ``ab``. ::
ru: Группы отмечаются метасимволами ``'('``, ``')'``. ``'('`` и ``')'`` имеют почти то же значение, что и в математических выражениях; они группируют содержащиеся внутри них выражения, и вы можете повторять содержимое группы с помощью квантора, например ``*``, ``+``, ``?`` или ``{m,n} ``. Например, ``(ab)*`` будет соответствовать нулю или более повторений ``ab``. ::

source: Groups indicated with ``'('``, ``')'`` also capture the starting and ending index of the text that they match; this can be retrieved by passing an argument to :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, and :meth:`~re.Match.span`. Groups are numbered starting with 0. Group 0 is always present; it's the whole RE, so :ref:`match object <match-objects>` methods all have group 0 as their default argument. Later we'll see how to express groups that don't capture the span of text that they match. ::
pt_pt: Os grupos indicados com ``'('``, ``')'`` também capturam o índice inicial e final do texto que correspondem; isto pode ser recuperado passando um argumento a :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, e :meth:`~re.Match.span`. Os grupos são numerados a partir de 0. O grupo 0 está sempre presente; é a RE completa, pelo que os métodos do :ref:`objeto de correspondência <match-objects>` têm todos o grupo 0 como argumento predefinido. Mais tarde veremos como expressar grupos que não capturam a extensão do texto que correspondem. ::
ru: Группы, обозначенные ``'('``, ``')'``, также фиксируют начальный и конечный индекс текста, которому они соответствуют; его можно получить, передав аргумент :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end` и :meth:` ~re.Match.span`. Группы нумеруются начиная с 0. Группа 0 присутствует всегда; это весь RE, поэтому все методы match object <match-objects> имеют группу 0 в качестве аргумента по умолчанию. Позже мы увидим, как выражать группы, которые не охватывают тот фрагмент текста, которому они соответствуют. ::

source: Subgroups are numbered from left to right, from 1 upward. Groups can be nested; to determine the number, just count the opening parenthesis characters, going from left to right. ::
pt_pt: Os subgrupos são numerados da esquerda para a direita, a partir de 1. Os grupos podem ser aninhados; para determinar o número, basta contar os caracteres de parênteses de abertura, da esquerda para a direita. ::
ru: Подгруппы нумеруются слева направо, от 1 вверх. Группы могут быть вложенными; Чтобы определить число, просто посчитайте символы открывающих круглых скобок слева направо. ::

source: :meth:`~re.Match.group` can be passed multiple group numbers at a time, in which case it will return a tuple containing the corresponding values for those groups. ::
pt_pt: O método :meth:`~re.Match.group` pode receber vários números de grupo de uma vez, caso em que devolverá um tuplo contendo os valores correspondentes para esses grupos. ::
ru: :meth:`~re.Match.group` может передавать несколько номеров групп одновременно, и в этом случае он вернет кортеж, содержащий соответствующие значения для этих групп. ::

source: The :meth:`~re.Match.groups` method returns a tuple containing the strings for all the subgroups, from 1 up to however many there are. ::
pt_pt: O método :meth:`~re.Match.groups` devolve um tuplo contendo as cadeias de caracteres para todos os subgrupos, de 1 até ao número que existir. ::
ru: Метод :meth:`~re.Match.groups` возвращает кортеж, содержащий строки для всех подгрупп, от 1 до любого их количества. ::
