Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/sockets.po
Languages: es_es

source: In these days of 64-bit machines, the ASCII representation of binary data is frequently smaller than the binary representation. That's because a surprising amount of the time, most integers have the value 0, or maybe 1. The string ``"0"`` would be two bytes, while a full 64-bit integer would be 8. Of course, this doesn't fit well with fixed-length messages. Decisions, decisions.
es_es: En estos tiempos de máquinas de 64 bits, la representación ASCII de los datos binarios suele ser más pequeña que la representación binaria. Esto se debe a que, sorprendentemente, la mayoría de los números enteros tienen el valor 0, o quizás 1. La cadena ``"0"`` tendría dos bytes, mientras que un entero completo de 64 bits tendría 8. Por supuesto, esto no encaja bien con los mensajes de longitud fija. Decisiones, decisiones.

source: Disconnecting
es_es: Desconectando

source: Strictly speaking, you're supposed to use ``shutdown`` on a socket before you ``close`` it. The ``shutdown`` is an advisory to the socket at the other end. Depending on the argument you pass it, it can mean "I'm not going to send anymore, but I'll still listen", or "I'm not listening, good riddance!". Most socket libraries, however, are so used to programmers neglecting to use this piece of etiquette that normally a ``close`` is the same as ``shutdown(); close()``. So in most situations, an explicit ``shutdown`` is not needed.
es_es: Estrictamente hablando, se supone que debes usar ``shutdown`` en un socket antes de ``close``. El ``shutdown`` es un aviso al socket en el otro extremo. Dependiendo del argumento que le pases, puede significar "no voy a enviar más, pero seguiré escuchando", o "no estoy escuchando, ¡buen viaje!". La mayoría de las librerías de sockets, sin embargo, están tan acostumbradas a que los programadores descuiden el uso de esta pieza de etiqueta que normalmente un ``close`` es lo mismo que ``shutdown(); close()``. Así que en la mayoría de las situaciones, un ``shutdown`` explícito no es necesario.

source: One way to use ``shutdown`` effectively is in an HTTP-like exchange. The client sends a request and then does a ``shutdown(1)``. This tells the server "This client is done sending, but can still receive." The server can detect "EOF" by a receive of 0 bytes. It can assume it has the complete request. The server sends a reply. If the ``send`` completes successfully then, indeed, the client was still receiving.
es_es: Una forma de utilizar ``shutdown`` eficazmente es en un intercambio tipo HTTP. El cliente envía una petición y luego hace un ``shutdown(1)``. Esto le dice al servidor "Este cliente ha terminado de enviar, pero aún puede recibir". El servidor puede detectar "EOF" por una recepción de 0 bytes. Puede asumir que tiene la petición completa. El servidor envía una respuesta. Si la ``send`` se completa con éxito entonces, efectivamente, el cliente todavía estaba recibiendo.

source: Python takes the automatic shutdown a step further, and says that when a socket is garbage collected, it will automatically do a ``close`` if it's needed. But relying on this is a very bad habit. If your socket just disappears without doing a ``close``, the socket at the other end may hang indefinitely, thinking you're just being slow. *Please* ``close`` your sockets when you're done.
es_es: Python lleva el apagado automático un paso más allá, y dice que cuando un socket es recolectado de basura, hará automáticamente un ``close`` si es necesario. Pero confiar en esto es un muy mal hábito. Si tu socket simplemente desaparece sin hacer un ``close``, el socket en el otro extremo puede colgarse indefinidamente, pensando que sólo estás siendo lento. *Por favor* ``close`` tus sockets cuando termines.

source: When Sockets Die
es_es: Cuando mueren los sockets

source: Probably the worst thing about using blocking sockets is what happens when the other side comes down hard (without doing a ``close``). Your socket is likely to hang. TCP is a reliable protocol, and it will wait a long, long time before giving up on a connection. If you're using threads, the entire thread is essentially dead. There's not much you can do about it. As long as you aren't doing something dumb, like holding a lock while doing a blocking read, the thread isn't really consuming much in the way of resources. Do *not* try to kill the thread - part of the reason that threads are more efficient than processes is that they avoid the overhead associated with the automatic recycling of resources. In other words, if you do manage to kill the thread, your whole process is likely to be screwed up.
es_es: Probablemente, lo peor de utilizar zócalos de bloqueo es lo que ocurre cuando el otro lado baja con fuerza (sin hacer un ``close``). Es probable que tu socket se cuelgue. TCP es un protocolo fiable, y esperará mucho, mucho tiempo antes de abandonar una conexión. Si estás usando hilos, el hilo entero está esencialmente muerto. No hay mucho que puedas hacer al respecto. Mientras no estés haciendo algo estúpido, como mantener un bloqueo mientras haces una lectura bloqueante, el hilo no está consumiendo muchos recursos. No *intente* matar el hilo - parte de la razón por la que los hilos son más eficientes que los procesos es que evitan la sobrecarga asociada con el reciclaje automático de recursos. En otras palabras, si consigues matar el hilo, es probable que todo tu proceso se fastidie.

source: Non-blocking Sockets
es_es: Sockets no bloqueantes

source: If you've understood the preceding, you already know most of what you need to know about the mechanics of using sockets. You'll still use the same calls, in much the same ways. It's just that, if you do it right, your app will be almost inside-out.
es_es: Si has entendido lo anterior, ya sabes la mayor parte de lo que necesitas saber sobre la mecánica del uso de sockets. Seguirás usando las mismas llamadas, de la misma manera. Sólo que, si lo haces bien, tu aplicación estará casi dentro-fuera.

source: In Python, you use ``socket.setblocking(False)`` to make it non-blocking. In C, it's more complex, (for one thing, you'll need to choose between the BSD flavor ``O_NONBLOCK`` and the almost indistinguishable POSIX flavor ``O_NDELAY``, which is completely different from ``TCP_NODELAY``), but it's the exact same idea. You do this after creating the socket, but before using it. (Actually, if you're nuts, you can switch back and forth.)
es_es: En Python, se utiliza ``socket.setblocking(False)`` para hacerlo no bloqueante. En C, es más complejo, (por un lado, tendrás que elegir entre el sabor BSD ``O_NONBLOCK`` y el casi indistinguible sabor POSIX ``O_NDELAY``, que es completamente diferente de ``TCP_NODELAY``), pero es exactamente la misma idea. Esto se hace después de crear el socket, pero antes de usarlo. (En realidad, si estás loco, puedes cambiar de un lado a otro).

source: The major mechanical difference is that ``send``, ``recv``, ``connect`` and ``accept`` can return without having done anything. You have (of course) a number of choices. You can check return code and error codes and generally drive yourself crazy. If you don't believe me, try it sometime. Your app will grow large, buggy and suck CPU. So let's skip the brain-dead solutions and do it right.
es_es: La principal diferencia mecánica es que ``send``, ``recv``, ``connect`` y ``accept`` pueden volver sin haber hecho nada. Tienes (por supuesto) varias opciones. Puedes comprobar el código de retorno y los códigos de error y, en general, volverte loco. Si no me crees, pruébalo alguna vez. Tu aplicación crecerá, tendrá errores y chupará CPU. Así que dejémonos de soluciones descerebradas y hagámoslo bien.

source: Use ``select``.
es_es: Utilice ``select``.

source: In C, coding ``select`` is fairly complex. In Python, it's a piece of cake, but it's close enough to the C version that if you understand ``select`` in Python, you'll have little trouble with it in C::
es_es: En C, codificar ``select`` es bastante complejo. En Python, es pan comido, pero se parece lo suficiente a la versión en C como para que, si entiendes ``select`` en Python, no te cueste mucho hacerlo en C::

source: You pass ``select`` three lists: the first contains all sockets that you might want to try reading; the second all the sockets you might want to try writing to, and the last (normally left empty) those that you want to check for errors. You should note that a socket can go into more than one list. The ``select`` call is blocking, but you can give it a timeout. This is generally a sensible thing to do - give it a nice long timeout (say a minute) unless you have good reason to do otherwise.
es_es: A ``select`` se le pasan tres listas: la primera contiene todos los sockets que se quiere intentar leer; la segunda todos los sockets a los que se quiere intentar escribir, y la última (que normalmente se deja vacía) los que se quiere comprobar si hay errores. Ten en cuenta que un socket puede ir en más de una lista. La llamada a ``select`` es bloqueante, pero puedes darle un tiempo de espera. Esto es generalmente lo más sensato - dale un tiempo de espera largo (digamos un minuto) a menos que tengas una buena razón para hacer lo contrario.

source: In return, you will get three lists. They contain the sockets that are actually readable, writable and in error. Each of these lists is a subset (possibly empty) of the corresponding list you passed in.
es_es: A cambio, obtendrás tres listas. Contienen los sockets que son realmente legibles, escribibles y en error. Cada una de estas listas es un subconjunto (posiblemente vacío) de la lista correspondiente que le pasaste.

source: If a socket is in the output readable list, you can be as-close-to-certain-as-we-ever-get-in-this-business that a ``recv`` on that socket will return *something*. Same idea for the writable list. You'll be able to send *something*. Maybe not all you want to, but *something* is better than nothing. (Actually, any reasonably healthy socket will return as writable - it just means outbound network buffer space is available.)
es_es: Si un socket está en la lista de salida legible, puedes estar tan cerca de estar seguro de que un ``recv`` en ese socket devolverá *algo*. La misma idea para la lista de escritura. Podrás enviar *algo*. Tal vez no todo lo que quieras, pero *algo* es mejor que nada. (En realidad, cualquier socket razonablemente sano devolverá como escribible - sólo significa que el espacio de búfer de red saliente está disponible).

source: If you have a "server" socket, put it in the potential_readers list. If it comes out in the readable list, your ``accept`` will (almost certainly) work. If you have created a new socket to ``connect`` to someone else, put it in the potential_writers list. If it shows up in the writable list, you have a decent chance that it has connected.
es_es: Si tienes un socket "servidor", ponlo en la lista potential_readers. Si sale en la lista de legibles, tu ``accept`` funcionará (casi seguro). Si has creado un nuevo socket para ``connect`` a otra persona, ponlo en la lista potential_writers. Si sale en la lista de escribibles, tienes bastantes posibilidades de que se haya conectado.

source: Actually, ``select`` can be handy even with blocking sockets. It's one way of determining whether you will block - the socket returns as readable when there's something in the buffers. However, this still doesn't help with the problem of determining whether the other end is done, or just busy with something else.
es_es: En realidad, ``select`` puede ser útil incluso con sockets bloqueantes. Es una forma de determinar si se va a bloquear - el socket retorna como legible cuando hay algo en los buffers. Sin embargo, esto todavía no ayuda con el problema de determinar si el otro extremo ha terminado, o simplemente está ocupado con otra cosa.

source: **Portability alert**: On Unix, ``select`` works both with the sockets and files. Don't try this on Windows. On Windows, ``select`` works with sockets only. Also note that in C, many of the more advanced socket options are done differently on Windows. In fact, on Windows I usually use threads (which work very, very well) with my sockets.
es_es: **Alerta de portabilidad**: En Unix, ``select`` funciona tanto con los sockets como con los ficheros. No lo intentes en Windows. En Windows, ``select`` funciona sólo con sockets. También ten en cuenta que en C, muchas de las opciones más avanzadas de sockets se hacen de forma diferente en Windows. De hecho, en Windows suelo usar hilos (que funcionan muy, muy bien) con mis sockets.
