Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/sockets.po
Languages: es_es

source: Socket Programming HOWTO
es_es: CÓMO de programación de sockets

source: Author
es_es: Autor

source: Abstract
es_es: Resumen

source: Sockets are used nearly everywhere, but are one of the most severely misunderstood technologies around. This is a 10,000 foot overview of sockets. It's not really a tutorial - you'll still have work to do in getting things operational. It doesn't cover the fine points (and there are a lot of them), but I hope it will give you enough background to begin using them decently.
es_es: Los zócalos se utilizan en casi todas partes, pero son una de las tecnologías más incomprendidas. Esta es una visión general de los sockets -10.000 pies-. No es realmente un tutorial - todavía tendrás trabajo que hacer para conseguir que las cosas funcionen. No cubre los puntos finos (y hay un montón de ellos), pero espero que le dará suficiente fondo para empezar a usarlos decentemente.

source: I'm only going to talk about INET (i.e. IPv4) sockets, but they account for at least 99% of the sockets in use. And I'll only talk about STREAM (i.e. TCP) sockets - unless you really know what you're doing (in which case this HOWTO isn't for you!), you'll get better behavior and performance from a STREAM socket than anything else. I will try to clear up the mystery of what a socket is, as well as some hints on how to work with blocking and non-blocking sockets. But I'll start by talking about blocking sockets. You'll need to know how they work before dealing with non-blocking sockets.
es_es: Sólo voy a hablar de sockets INET (es decir, IPv4), pero representan al menos el 99% de los sockets en uso. Y sólo hablaré de sockets STREAM (es decir, TCP) - a menos que realmente sepas lo que estás haciendo (¡en cuyo caso este CÓMO no es para ti!), obtendrás mejor comportamiento y rendimiento de un socket STREAM que de cualquier otra cosa. Intentaré aclarar el misterio de lo que es un socket, así como algunas pistas sobre cómo trabajar con sockets bloqueantes y no bloqueantes. Pero empezaré hablando de los sockets bloqueantes. Necesitarás saber cómo funcionan antes de tratar con los sockets no bloqueantes.

source: Part of the trouble with understanding these things is that "socket" can mean a number of subtly different things, depending on context. So first, let's make a distinction between a "client" socket - an endpoint of a conversation, and a "server" socket, which is more like a switchboard operator. The client application (your browser, for example) uses "client" sockets exclusively; the web server it's talking to uses both "server" sockets and "client" sockets.
es_es: Parte del problema para entender estas cosas es que "socket" puede significar una serie de cosas sutilmente diferentes, dependiendo del contexto. Así que, en primer lugar, vamos a distinguir entre un socket "cliente" - un punto final de una conversación, y un socket "servidor", que es más como un operador de centralita. La aplicación cliente (tu navegador, por ejemplo) utiliza exclusivamente sockets "cliente"; el servidor web con el que habla utiliza tanto sockets "servidor" como sockets "cliente".

source: History
es_es: Historia

source: Of the various forms of :abbr:`IPC (Inter Process Communication)`, sockets are by far the most popular. On any given platform, there are likely to be other forms of IPC that are faster, but for cross-platform communication, sockets are about the only game in town.
es_es: De las diversas formas de :abbr:`IPC (Inter Process Communication)`, los sockets son, con diferencia, las más populares. En cualquier plataforma, es probable que haya otras formas de IPC que sean más rápidas, pero para la comunicación entre plataformas, los sockets son el único juego en la ciudad.

source: They were invented in Berkeley as part of the BSD flavor of Unix. They spread like wildfire with the internet. With good reason --- the combination of sockets with INET makes talking to arbitrary machines around the world unbelievably easy (at least compared to other schemes).
es_es: Se inventaron en Berkeley como parte de la versión BSD de Unix. Se extendieron como la pólvora con Internet. Y con razón: la combinación de sockets con INET hace que hablar con máquinas arbitrarias de todo el mundo sea increíblemente fácil (al menos comparado con otros sistemas).

source: Creating a Socket
es_es: Creación de un zócalo

source: Roughly speaking, when you clicked on the link that brought you to this page, your browser did something like the following::
es_es: A grandes rasgos, cuando ha hecho clic en el enlace que le ha llevado a esta página, su navegador ha hecho algo parecido a lo siguiente::

source: # create an INET, STREAMing socket s = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # now connect to the web server on port 80 - the normal http port s.connect(("www.python.org", 80))
es_es: # crear un socket INET, STREAMing s = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # ahora conéctate al servidor web en el puerto 80 - el puerto http normal s.connect(("www.python.org", 80))

source: When the ``connect`` completes, the socket ``s`` can be used to send in a request for the text of the page. The same socket will read the reply, and then be destroyed. That's right, destroyed. Client sockets are normally only used for one exchange (or a small set of sequential exchanges).
es_es: Cuando ``connect`` finaliza, el socket ``s`` puede utilizarse para enviar una solicitud del texto de la página. El mismo socket leerá la respuesta, y luego será destruido. Así es, destruido. Normalmente, los sockets cliente sólo se utilizan para un intercambio (o un pequeño conjunto de intercambios secuenciales).

source: What happens in the web server is a bit more complex. First, the web server creates a "server socket"::
es_es: Lo que ocurre en el servidor web es un poco más complejo. En primer lugar, el servidor web crea un "socket de servidor"::

source: # create an INET, STREAMing socket serversocket = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # bind the socket to a public host, and a well-known port serversocket.bind((socket.gethostname(), 80)) # become a server socket serversocket.listen(5)
es_es: # crear un socket INET, STREAMing serversocket = socket.socket(socket.AF_INET, socket.SOCK_STREAM) # enlaza el socket a un host público y a un puerto conocido serversocket.bind((socket.gethostname(), 80)) # conviértete en un socket servidor serversocket.listen(5)

source: A couple things to notice: we used ``socket.gethostname()`` so that the socket would be visible to the outside world. If we had used ``s.bind(('localhost', 80))`` or ``s.bind(('127.0.0.1', 80))`` we would still have a "server" socket, but one that was only visible within the same machine. ``s.bind(('', 80))`` specifies that the socket is reachable by any address the machine happens to have.
es_es: Un par de cosas a tener en cuenta: usamos ``socket.gethostname()`` para que el socket fuera visible al mundo exterior. Si hubiésemos usado ``s.bind(('localhost', 80))`` o ``s.bind(('127.0.0.1', 80))`` aún tendríamos un socket "servidor", pero sólo visible dentro de la misma máquina. ``s.bind(('', 80))`` especifica que el socket es accesible por cualquier dirección que tenga la máquina.

source: A second thing to note: low number ports are usually reserved for "well known" services (HTTP, SNMP etc). If you're playing around, use a nice high number (4 digits).
es_es: Una segunda cosa a tener en cuenta: los puertos con números bajos suelen estar reservados para servicios "bien conocidos" (HTTP, SNMP, etc.). Si estás jugando, utiliza un buen número alto (4 dígitos).

source: Finally, the argument to ``listen`` tells the socket library that we want it to queue up as many as 5 connect requests (the normal max) before refusing outside connections. If the rest of the code is written properly, that should be plenty.
es_es: Por último, el argumento a ``listen`` indica a la biblioteca de sockets que queremos que ponga en cola hasta 5 peticiones de conexión (el máximo normal) antes de rechazar conexiones externas. Si el resto del código está bien escrito, debería ser suficiente.

source: Now that we have a "server" socket, listening on port 80, we can enter the mainloop of the web server::
es_es: Ahora que tenemos un socket "servidor", escuchando en el puerto 80, podemos entrar en el mainloop del servidor web::

source: while True: # accept connections from outside (clientsocket, address) = serversocket.accept() # now do something with the clientsocket # in this case, we'll pretend this is a threaded server ct = client_thread(clientsocket) ct.run()
es_es: while True: # aceptar conexiones desde el exterior (clientsocket, address) = serversocket.accept() # ahora haz algo con el clientsocket # en este caso, fingiremos que se trata de un servidor enhebrado ct = client_thread(clientsocket) ct.run()

source: There's actually 3 general ways in which this loop could work - dispatching a thread to handle ``clientsocket``, create a new process to handle ``clientsocket``, or restructure this app to use non-blocking sockets, and multiplex between our "server" socket and any active ``clientsocket``\ s using ``select``. More about that later. The important thing to understand now is this: this is *all* a "server" socket does. It doesn't send any data. It doesn't receive any data. It just produces "client" sockets. Each ``clientsocket`` is created in response to some *other* "client" socket doing a ``connect()`` to the host and port we're bound to. As soon as we've created that ``clientsocket``, we go back to listening for more connections. The two "clients" are free to chat it up - they are using some dynamically allocated port which will be recycled when the conversation ends.
es_es: En realidad hay 3 maneras generales en las que este bucle podría funcionar - despachar un hilo para manejar ``clientsocket``, crear un nuevo proceso para manejar ``clientsocket``, o reestructurar esta aplicación para utilizar sockets no bloqueantes, y multiplexar entre nuestro socket "servidor" y cualquier ``clientsocket``\ s activo utilizando ``select``. Más adelante hablaremos de ello. Lo importante ahora es entender esto: esto es *todo* lo que hace un socket "servidor". No envía ningún dato. No recibe datos. Sólo produce sockets "cliente". Cada ``clientsocket`` se crea en respuesta a algún *otro* socket "cliente" que hace un ``connect()`` al host y puerto al que estamos vinculados. Tan pronto como hemos creado ese ``clientsocket``, volvemos a escuchar más conexiones. Los dos "clientes" son libres de charlar - están usando algún puerto asignado dinámicamente que será reciclado cuando la conversación termine.

source: If you need fast IPC between two processes on one machine, you should look into pipes or shared memory. If you do decide to use AF_INET sockets, bind the "server" socket to ``'localhost'``. On most platforms, this will take a shortcut around a couple of layers of network code and be quite a bit faster.
es_es: Si necesita un IPC rápido entre dos procesos en una máquina, debería buscar tuberías o memoria compartida. Si decide utilizar sockets AF_INET, vincule el socket "servidor" a ``'localhost'``. En la mayoría de las plataformas, esto tomará un atajo alrededor de un par de capas de código de red y será bastante más rápido.

source: The :mod:`multiprocessing` integrates cross-platform IPC into a higher-level API.
es_es: :mod:`multiprocessing` integra IPC multiplataforma en una API de nivel superior.

source: Using a Socket
es_es: Utilización de un socket

source: The first thing to note, is that the web browser's "client" socket and the web server's "client" socket are identical beasts. That is, this is a "peer to peer" conversation. Or to put it another way, *as the designer, you will have to decide what the rules of etiquette are for a conversation*. Normally, the ``connect``\ ing socket starts the conversation, by sending in a request, or perhaps a signon. But that's a design decision - it's not a rule of sockets.
es_es: Lo primero que hay que tener en cuenta es que el socket "cliente" del navegador web y el socket "cliente" del servidor web son bestias idénticas. Es decir, se trata de una conversación "peer to peer". O dicho de otro modo, *como diseñador, tendrás que decidir cuáles son las reglas de etiqueta de una conversación*. Normalmente, el ``connect``\ ing socket inicia la conversación, mediante el envío de una solicitud, o tal vez un signon. Pero eso es una decisión de diseño, no una regla de los sockets.

source: Now there are two sets of verbs to use for communication. You can use ``send`` and ``recv``, or you can transform your client socket into a file-like beast and use ``read`` and ``write``. The latter is the way Java presents its sockets. I'm not going to talk about it here, except to warn you that you need to use ``flush`` on sockets. These are buffered "files", and a common mistake is to ``write`` something, and then ``read`` for a reply. Without a ``flush`` in there, you may wait forever for the reply, because the request may still be in your output buffer.
es_es: Ahora hay dos conjuntos de verbos para usar en la comunicación. Puedes usar ``send`` y ``recv``, o puedes transformar tu socket cliente en una cosa parecida a un archivo y usar ``read`` y ``write``. Esta última es la forma en que Java presenta sus sockets. No voy a hablar de ello aquí, excepto para advertirte de que necesitas usar ``flush`` en los sockets. Estos son "archivos" con buffer, y un error común es ``write`` algo, y luego ``read`` para una respuesta. Sin un ``flush`` ahí, puedes esperar una eternidad por la respuesta, porque la petición puede estar todavía en tu buffer de salida.

source: Now we come to the major stumbling block of sockets - ``send`` and ``recv`` operate on the network buffers. They do not necessarily handle all the bytes you hand them (or expect from them), because their major focus is handling the network buffers. In general, they return when the associated network buffers have been filled (``send``) or emptied (``recv``). They then tell you how many bytes they handled. It is *your* responsibility to call them again until your message has been completely dealt with.
es_es: Ahora llegamos al mayor escollo de los sockets - ``send`` y ``recv`` operan en los buffers de red. No necesariamente manejan todos los bytes que les pasas (o esperas de ellos), porque su principal objetivo es manejar los buffers de red. En general, regresan cuando los buffers de red asociados se han llenado (``send``) o vaciado (``recv``). Entonces te dicen cuántos bytes han manejado. Es *su* responsabilidad llamarlos de nuevo hasta que su mensaje haya sido tratado completamente.

source: When a ``recv`` returns 0 bytes, it means the other side has closed (or is in the process of closing) the connection. You will not receive any more data on this connection. Ever. You may be able to send data successfully; I'll talk more about this later.
es_es: Cuando un ``recv`` devuelve 0 bytes, significa que el otro lado ha cerrado (o está en proceso de cerrar) la conexión. No recibirás más datos en esta conexión. Sin duda. Es posible que puedas enviar datos con éxito; hablaré más sobre esto más adelante.

source: A protocol like HTTP uses a socket for only one transfer. The client sends a request, then reads a reply. That's it. The socket is discarded. This means that a client can detect the end of the reply by receiving 0 bytes.
es_es: Un protocolo como HTTP utiliza un socket para una sola transferencia. El cliente envía una solicitud, luego lee una respuesta. Y ya está. El socket se descarta. Esto significa que un cliente puede detectar el final de la respuesta recibiendo 0 bytes.

source: But if you plan to reuse your socket for further transfers, you need to realize that *there is no* :abbr:`EOT (End of Transfer)` *on a socket.* I repeat: if a socket ``send`` or ``recv`` returns after handling 0 bytes, the connection has been broken. If the connection has *not* been broken, you may wait on a ``recv`` forever, because the socket will *not* tell you that there's nothing more to read (for now). Now if you think about that a bit, you'll come to realize a fundamental truth of sockets: *messages must either be fixed length* (yuck), *or be delimited* (shrug), *or indicate how long they are* (much better), *or end by shutting down the connection*. The choice is entirely yours, (but some ways are righter than others).
es_es: Pero si planeas reutilizar tu socket para más transferencias, necesitas darte cuenta de que *no hay* :abbr:`EOT (End of Transfer)` * *en un socket.* Repito: si un socket ``send`` o ``recv`` vuelve después de manejar 0 bytes, la conexión se ha roto. Si la conexión *no* se ha roto, puedes esperar en un ``recv`` para siempre, porque el socket *no* te dirá que no hay nada más que leer (por ahora). Ahora, si piensas un poco sobre esto, te darás cuenta de una verdad fundamental de los sockets: *los mensajes deben tener una longitud fija* (puaj), *o delimitarse* (encogerse de hombros), *o indicar su longitud* (mucho mejor), *o terminar cerrando la conexión*. La elección es enteramente tuya, (pero algunas formas son más correctas que otras).

source: Assuming you don't want to end the connection, the simplest solution is a fixed length message::
es_es: Suponiendo que no desee finalizar la conexión, la solución más sencilla es un mensaje de longitud fija::

source: The sending code here is usable for almost any messaging scheme - in Python you send strings, and you can use ``len()`` to determine its length (even if it has embedded ``\0`` characters). It's mostly the receiving code that gets more complex. (And in C, it's not much worse, except you can't use ``strlen`` if the message has embedded ``\0``\ s.)
es_es: El código de envío aquí es utilizable para casi cualquier esquema de mensajería - en Python envías cadenas, y puedes usar ``len()`` para determinar su longitud (incluso si tiene caracteres ``\0`` incrustados). Lo más complejo es el código de recepción. (Y en C, no es mucho peor, excepto que no puedes usar ``strlen`` si el mensaje tiene ``\0``\ s incrustados).

source: The easiest enhancement is to make the first character of the message an indicator of message type, and have the type determine the length. Now you have two ``recv``\ s - the first to get (at least) that first character so you can look up the length, and the second in a loop to get the rest. If you decide to go the delimited route, you'll be receiving in some arbitrary chunk size, (4096 or 8192 is frequently a good match for network buffer sizes), and scanning what you've received for a delimiter.
es_es: La mejora más sencilla es hacer que el primer carácter del mensaje sea un indicador del tipo de mensaje, y que el tipo determine la longitud. Ahora tiene dos ``recv``- el primero para obtener (al menos) el primer carácter para que pueda buscar la longitud, y el segundo en un bucle para obtener el resto. Si decides ir por la ruta delimitada, estarás recibiendo en algún tamaño de trozo arbitrario, (4096 o 8192 es frecuentemente una buena coincidencia para tamaños de búfer de red), y escaneando lo que has recibido para un delimitador.

source: One complication to be aware of: if your conversational protocol allows multiple messages to be sent back to back (without some kind of reply), and you pass ``recv`` an arbitrary chunk size, you may end up reading the start of a following message. You'll need to put that aside and hold onto it, until it's needed.
es_es: Una complicación a tener en cuenta: si tu protocolo de conversación permite enviar varios mensajes seguidos (sin ningún tipo de respuesta), y pasas a ``recv`` un tamaño de trozo arbitrario, puede que acabes leyendo el principio de un mensaje siguiente. Tendrás que dejarlo a un lado y guardarlo hasta que sea necesario.

source: Prefixing the message with its length (say, as 5 numeric characters) gets more complex, because (believe it or not), you may not get all 5 characters in one ``recv``. In playing around, you'll get away with it; but in high network loads, your code will very quickly break unless you use two ``recv`` loops - the first to determine the length, the second to get the data part of the message. Nasty. This is also when you'll discover that ``send`` does not always manage to get rid of everything in one pass. And despite having read this, you will eventually get bit by it!
es_es: Prefijar el mensaje con su longitud (digamos, como 5 caracteres numéricos) se vuelve más complejo, porque (lo creas o no), puede que no obtengas los 5 caracteres en un ``recv``. Jugando, te saldrás con la tuya; pero con cargas de red altas, tu código se romperá muy rápidamente a menos que utilices dos bucles ``recv`` - el primero para determinar la longitud, el segundo para obtener la parte de datos del mensaje. Asqueroso. Aquí es también cuando descubrirás que ``send`` no siempre consigue deshacerse de todo en una sola pasada. Y a pesar de haber leído esto, ¡al final te picará!

source: In the interests of space, building your character, (and preserving my competitive position), these enhancements are left as an exercise for the reader. Lets move on to cleaning up.
es_es: En interés del espacio, la construcción de su carácter, (y preservar mi posición competitiva), estas mejoras se dejan como un ejercicio para el lector. Pasemos a la limpieza.

source: Binary Data
es_es: Datos binarios

source: It is perfectly possible to send binary data over a socket. The major problem is that not all machines use the same formats for binary data. For example, `network byte order <https://en.wikipedia.org/wiki/Endianness#Networking>`_ is big-endian, with the most significant byte first, so a 16 bit integer with the value ``1`` would be the two hex bytes ``00 01``. However, most common processors (x86/AMD64, ARM, RISC-V), are little-endian, with the least significant byte first - that same ``1`` would be ``01 00``.
es_es: Es perfectamente posible enviar datos binarios a través de un socket. El mayor problema es que no todas las máquinas utilizan los mismos formatos para los datos binarios. Por ejemplo, `el orden de bytes de red <https://en.wikipedia.org/wiki/Endianness#Networking>`_ es big-endian, con el byte más significativo primero, por lo que un entero de 16 bits con el valor ``1`` serían los dos bytes hexadecimales ``00 01``. Sin embargo, los procesadores más comunes (x86/AMD64, ARM, RISC-V), son little-endian, con el byte menos significativo primero - ese mismo ``1`` sería ``01 00``.

source: Socket libraries have calls for converting 16 and 32 bit integers - ``ntohl, htonl, ntohs, htons`` where "n" means *network* and "h" means *host*, "s" means *short* and "l" means *long*. Where network order is host order, these do nothing, but where the machine is byte-reversed, these swap the bytes around appropriately.
es_es: Las bibliotecas de sockets tienen llamadas para convertir enteros de 16 y 32 bits - ``ntohl, htonl, ntohs, htons`` donde "n" significa *red* y "h" significa *host*, "s" significa *corto* y "l" significa *largo*. Si el orden de la red es el mismo que el del host, no hacen nada, pero si la máquina está invertida en bytes, intercambian los bytes adecuadamente.
