Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/sorting.po
Languages: pt_pt

source: Author
pt_pt: Autor

source: Andrew Dalke and Raymond Hettinger
pt_pt: Andrew Dalke e Raymond Hettinger

source: Release
pt_pt: Versão

source: Python lists have a built-in :meth:`list.sort` method that modifies the list in-place. There is also a :func:`sorted` built-in function that builds a new sorted list from an iterable.
pt_pt: As listas em Python têm um método integrado :meth:`list.sort` que modifica a lista no local. Também existe a função integrada :func:`sorted`, que cria uma nova lista ordenada a partir de um iterável.

source: In this document, we explore the various techniques for sorting data using Python.
pt_pt: Neste documento, exploramos as várias técnicas para ordenar dados usando Python.

source: Sorting Basics
pt_pt: Noções Básicas de Ordenação

source: A simple ascending sort is very easy: just call the :func:`sorted` function. It returns a new sorted list:
pt_pt: Uma ordenação ascendente simples é muito fácil: basta chamar a função :func:`sorted`. Esta devolve uma nova lista ordenada:

source: You can also use the :meth:`list.sort` method. It modifies the list in-place (and returns ``None`` to avoid confusion). Usually it's less convenient than :func:`sorted` - but if you don't need the original list, it's slightly more efficient.
pt_pt: Também pode usar o método :meth:`list.sort`. Este modifica a lista no local (e devolve ``None`` para evitar confusão). Normalmente é menos conveniente do que :func:`sorted`, mas se não precisar da lista original, é ligeiramente mais eficiente.

source: Another difference is that the :meth:`list.sort` method is only defined for lists. In contrast, the :func:`sorted` function accepts any iterable.
pt_pt: Outra diferença é que o método :meth:`list.sort` só está definido para listas. Em contraste, a função :func:`sorted` aceita qualquer iterável.

source: Key Functions
pt_pt: Funções de Chave

source: The value of the *key* parameter should be a function (or other callable) that takes a single argument and returns a key to use for sorting purposes. This technique is fast because the key function is called exactly once for each input record.
pt_pt: O valor do parâmetro *key* deve ser uma função (ou outro objeto chamável) que recebe um único argumento e devolve uma chave a usar para fins de ordenação. Esta técnica é rápida porque a função de chave é chamada exatamente uma vez para cada registo de entrada.

source: A common pattern is to sort complex objects using some of the object's indices as keys. For example:
pt_pt: Um padrão comum é ordenar objetos complexos usando alguns dos índices do objeto como chaves. Por exemplo:

source: The same technique works for objects with named attributes. For example:
pt_pt: A mesma técnica funciona para objetos com atributos nomeados. Por exemplo:

source: Using those functions, the above examples become simpler and faster:
pt_pt: Usando essas funções, os exemplos acima tornam-se mais simples e rápidos:

source: The operator module functions allow multiple levels of sorting. For example, to sort by *grade* then by *age*:
pt_pt: As funções do módulo operator permitem vários níveis de ordenação. Por exemplo, para ordenar por *grade* e depois por *age*:

source: Ascending and Descending
pt_pt: Ordem Ascendente e Descendente

source: Both :meth:`list.sort` and :func:`sorted` accept a *reverse* parameter with a boolean value. This is used to flag descending sorts. For example, to get the student data in reverse *age* order:
pt_pt: Tanto o :meth:`list.sort` como a :func:`sorted` aceitam um parâmetro *reverse* com um valor booleano. Este é usado para indicar ordenações descendentes. Por exemplo, para obter os dados dos estudantes por ordem inversa de *age*:

source: Sort Stability and Complex Sorts
pt_pt: Estabilidade de Ordenação e Ordenações Complexas

source: Sorts are guaranteed to be `stable <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_\. That means that when multiple records have the same key, their original order is preserved.
pt_pt: A ordenação é garantidamente `estável <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_. Isto significa que, quando vários registos têm a mesma chave, a sua ordem original é preservada.

source: Notice how the two records for *blue* retain their original order so that ``('blue', 1)`` is guaranteed to precede ``('blue', 2)``.
pt_pt: Repare como os dois registos para *blue* mantêm a sua ordem original, de modo que ``('blue', 1)`` é garantidamente anterior a ``('blue', 2)``.

source: This wonderful property lets you build complex sorts in a series of sorting steps. For example, to sort the student data by descending *grade* and then ascending *age*, do the *age* sort first and then sort again using *grade*:
pt_pt: Esta propriedade maravilhosa permite construir ordenações complexas numa série de passos de ordenação. Por exemplo, para ordenar os dados dos estudantes por *grade* descendente e depois por *age* ascendente, faça primeiro a ordenação por *age* e depois ordene novamente usando *grade*:

source: This can be abstracted out into a wrapper function that can take a list and tuples of field and order to sort them on multiple passes.
pt_pt: Isto pode ser abstraído para uma função invólucro que pode receber uma lista e tuplos de campos e ordem para os ordenar em vários passos.

source: The `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ algorithm used in Python does multiple sorts efficiently because it can take advantage of any ordering already present in a dataset.
pt_pt: O algoritmo `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ usado em Python realiza múltiplas ordenações de forma eficiente porque pode tirar partido de qualquer ordenação já presente num conjunto de dados.

source: Decorate-Sort-Undecorate
pt_pt: Decorar-Ordenar-Remover Decoração

source: This idiom is called Decorate-Sort-Undecorate after its three steps:
pt_pt: Este idioma é chamado Decorar-Ordenar-Remover Decoração devido aos seus três passos:

source: First, the initial list is decorated with new values that control the sort order.
pt_pt: Primeiro, a lista inicial é decorada com novos valores que controlam a ordem de ordenação.

source: Second, the decorated list is sorted.
pt_pt: Segundo, a lista decorada é ordenada.

source: Finally, the decorations are removed, creating a list that contains only the initial values in the new order.
pt_pt: Por fim, as decorações são removidas, criando uma lista que contém apenas os valores iniciais na nova ordem.

source: For example, to sort the student data by *grade* using the DSU approach:
pt_pt: Por exemplo, para ordenar os dados dos estudantes por *grade* usando a abordagem DSU:

source: This idiom works because tuples are compared lexicographically; the first items are compared; if they are the same then the second items are compared, and so on.
pt_pt: Este idioma funciona porque os tuplos são comparados lexicograficamente; os primeiros itens são comparados; se forem iguais, os segundos itens são comparados, e assim sucessivamente.

source: It is not strictly necessary in all cases to include the index *i* in the decorated list, but including it gives two benefits:
pt_pt: Não é estritamente necessário incluir o índice *i* na lista decorada em todos os casos, mas incluí-lo traz duas vantagens:

source: The sort is stable -- if two items have the same key, their order will be preserved in the sorted list.
pt_pt: A ordenação é estável — se dois itens tiverem a mesma chave, a sua ordem será preservada na lista ordenada.

source: The original items do not have to be comparable because the ordering of the decorated tuples will be determined by at most the first two items. So for example the original list could contain complex numbers which cannot be sorted directly.
pt_pt: Os itens originais não precisam de ser comparáveis porque a ordenação dos tuplos decorados será determinada, no máximo, pelos dois primeiros itens. Assim, por exemplo, a lista original poderia conter números complexos que não podem ser ordenados diretamente.

source: Another name for this idiom is `Schwartzian transform <https://en.wikipedia.org/wiki/Schwartzian_transform>`_\, after Randal L. Schwartz, who popularized it among Perl programmers.
pt_pt: Outro nome para este idioma é `transformação de Schwartz <https://en.wikipedia.org/wiki/Schwartzian_transform>`_, em homenagem a Randal L. Schwartz, que o popularizou entre programadores Perl.

source: Now that Python sorting provides key-functions, this technique is not often needed.
pt_pt: Agora que a ordenação em Python disponibiliza funções de chave, esta técnica já não é frequentemente necessária.

source: Comparison Functions
pt_pt: Funções de Comparação

source: Unlike key functions that return an absolute value for sorting, a comparison function computes the relative ordering for two inputs.
pt_pt: Ao contrário das funções de chave, que devolvem um valor absoluto para ordenação, uma função de comparação calcula a ordenação relativa para duas entradas.

source: For example, a `balance scale <https://upload.wikimedia.org/wikipedia/commons/1/17/Balance_à_tabac_1850.JPG>`_ compares two samples giving a relative ordering: lighter, equal, or heavier. Likewise, a comparison function such as ``cmp(a, b)`` will return a negative value for less-than, zero if the inputs are equal, or a positive value for greater-than.
pt_pt: Por exemplo, uma `balança <https://upload.wikimedia.org/wikipedia/commons/1/17/Balance_à_tabac_1850.JPG>`_ compara duas amostras, dando uma ordenação relativa: mais leve, igual ou mais pesada. Da mesma forma, uma função de comparação como ``cmp(a, b)`` devolve um valor negativo para menor-que, zero se as entradas forem iguais, ou um valor positivo para maior-que.

source: It is common to encounter comparison functions when translating algorithms from other languages. Also, some libraries provide comparison functions as part of their API. For example, :func:`locale.strcoll` is a comparison function.
pt_pt: É comum encontrar funções de comparação ao traduzir algoritmos de outras linguagens. Além disso, algumas bibliotecas disponibilizam funções de comparação como parte da sua API. Por exemplo, :func:`locale.strcoll` é uma função de comparação.

source: To accommodate those situations, Python provides :class:`functools.cmp_to_key` to wrap the comparison function to make it usable as a key function::
pt_pt: Para acomodar essas situações, o Python disponibiliza :class:`functools.cmp_to_key` para encapsular a função de comparação e torná-la utilizável como uma função de chave:

source: Odds and Ends
pt_pt: Vários

source: For locale aware sorting, use :func:`locale.strxfrm` for a key function or :func:`locale.strcoll` for a comparison function. This is necessary because "alphabetical" sort orderings can vary across cultures even if the underlying alphabet is the same.
pt_pt: Para ordenação sensível à localidade, use :func:`locale.strxfrm` como função de chave ou :func:`locale.strcoll` como função de comparação. Isto é necessário porque as ordenações "alfabéticas" podem variar entre culturas, mesmo que o alfabeto subjacente seja o mesmo.

source: The *reverse* parameter still maintains sort stability (so that records with equal keys retain the original order). Interestingly, that effect can be simulated without the parameter by using the builtin :func:`reversed` function twice:
pt_pt: O parâmetro *reverse* ainda mantém a estabilidade da ordenação (de modo que registos com chaves iguais mantenham a ordem original). Curiosamente, esse efeito pode ser simulado sem o parâmetro, usando a função integrada :func:`reversed` duas vezes:

source: The sort routines use ``<`` when making comparisons between two objects. So, it is easy to add a standard sort order to a class by defining an :meth:`~object.__lt__` method:
pt_pt: As rotinas de ordenação usam ``<`` ao fazer comparações entre dois objetos. Assim, é fácil adicionar uma ordem de ordenação padrão a uma classe, definindo um método :meth:`~object.__lt__`:

source: Key functions need not depend directly on the objects being sorted. A key function can also access external resources. For instance, if the student grades are stored in a dictionary, they can be used to sort a separate list of student names:
pt_pt: As funções de chave não precisam de depender diretamente dos objetos a ser ordenados. Uma função de chave também pode aceder a recursos externos. Por exemplo, se as notas dos estudantes estiverem armazenadas num dicionário, podem ser usadas para ordenar uma lista separada de nomes de estudantes:
