Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/urllib2.po
Languages: es_es, ru

source: :attr:`http.server.BaseHTTPRequestHandler.responses` is a useful dictionary of response codes in that shows all the response codes used by :rfc:`2616`. The dictionary is reproduced here for convenience ::
es_es: :attr:`http.server.BaseHTTPRequestHandler.responses` es un útil diccionario de códigos de respuesta que muestra todos los códigos de respuesta utilizados por :rfc:`2616`. El diccionario se reproduce aquí por conveniencia ::
ru: :attr:`http.server.BaseHTTPRequestHandler.responses` — это полезный словарь кодов ответов, в котором показаны все коды ответов, используемые :rfc:`2616`. Словарь воспроизведен здесь для удобства::

source: When an error is raised the server responds by returning an HTTP error code *and* an error page. You can use the :exc:`~urllib.error.HTTPError` instance as a response on the page returned. This means that as well as the code attribute, it also has read, geturl, and info, methods as returned by the ``urllib.response`` module::
es_es: Cuando se produce un error, el servidor responde devolviendo un código de error HTTP *and* una página de error. Puede utilizar la instancia :exc:`~urllib.error.HTTPError` como respuesta en la página devuelta. Esto significa que además del atributo code, también tiene los métodos read, geturl, e info, tal y como devuelve el módulo ``urllib.response``::
ru: При возникновении ошибки сервер отвечает, возвращая код ошибки HTTP *и* страницу с ошибкой. Вы можете использовать экземпляр :exc:`~urllib.error.HTTPError` в качестве ответа на возвращаемой странице. Это означает, что помимо атрибута code он также имеет методы read, geturl и info, возвращаемые модулем urllib.response:

source: Wrapping it Up
es_es: Para terminar
ru: Подведем итоги

source: So if you want to be prepared for :exc:`~urllib.error.HTTPError` *or* :exc:`~urllib.error.URLError` there are two basic approaches. I prefer the second approach.
es_es: Así que si quieres estar preparado para :exc:`~urllib.error.HTTPError` *o* :exc:`~urllib.error.URLError` hay dos enfoques básicos. Yo prefiero el segundo.
ru: Итак, если вы хотите быть готовыми к :exc:`~urllib.error.HTTPError` *или* :exc:`~urllib.error.URLError`, есть два основных подхода. Я предпочитаю второй подход.

source: Number 1
es_es: Número 1
ru: Номер 1

source: The ``except HTTPError`` *must* come first, otherwise ``except URLError`` will *also* catch an :exc:`~urllib.error.HTTPError`.
es_es: El ``except HTTPError`` *debe* ir primero, de lo contrario ``except URLError`` *también* cogerá un :exc:`~urllib.error.HTTPError`.
ru: ``кроме HTTPError`` *должен* идти первым, иначе ``кроме URLError`` *также* перехватит :exc:`~urllib.error.HTTPError`.

source: Number 2
es_es: Número 2
ru: Номер 2

source: info and geturl
es_es: info y geturl
ru: информация и geturl

source: The response returned by urlopen (or the :exc:`~urllib.error.HTTPError` instance) has two useful methods :meth:`!info` and :meth:`!geturl` and is defined in the module :mod:`urllib.response`.
es_es: La respuesta devuelta por urlopen (o la instancia :exc:`~urllib.error.HTTPError` ) tiene dos métodos útiles :meth:`!info` y :meth:`!geturl` y está definida en el módulo :mod:`urllib.response`.
ru: Ответ, возвращаемый urlopen (или экземпляром :exc:`~urllib.error.HTTPError`), имеет два полезных метода :meth:`!info` и :meth:`!geturl` и определен в модуле :mod:` urllib.response`.

source: **geturl** - this returns the real URL of the page fetched. This is useful because ``urlopen`` (or the opener object used) may have followed a redirect. The URL of the page fetched may not be the same as the URL requested.
es_es: **geturl** - devuelve la URL real de la página obtenida. Esto es útil porque ``urlopen`` (o el objeto abridor utilizado) puede haber seguido una redirección. La URL de la página obtenida puede no ser la misma que la URL solicitada.
ru: **geturl** — возвращает реальный URL полученной страницы. Это полезно, поскольку urlopen (или используемый объект открытия) мог следовать за перенаправлением. URL-адрес полученной страницы может не совпадать с запрошенным URL-адресом.

source: **info** - this returns a dictionary-like object that describes the page fetched, particularly the headers sent by the server. It is currently an :class:`http.client.HTTPMessage` instance.
es_es: **info** - devuelve un objeto de tipo diccionario que describe la página obtenida, en particular las cabeceras enviadas por el servidor. Actualmente es una instancia de :class:`http.client.HTTPMessage`.
ru: **info** — возвращает объект, похожий на словарь, который описывает полученную страницу, в частности заголовки, отправленные сервером. В настоящее время это экземпляр :class:`http.client.HTTPMessage`.

source: Typical headers include 'Content-length', 'Content-type', and so on. See the `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ for a useful listing of HTTP headers with brief explanations of their meaning and use.
es_es: Las cabeceras típicas incluyen 'Content-length', 'Content-type', etc. Consultar la `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ para obtener una lista útil de las cabeceras HTTP con breves explicaciones sobre su significado y uso.
ru: Типичные заголовки включают «Длина контента», «Тип контента» и т. д. См. `Краткий справочник по заголовкам HTTP <https://jkorpela.fi/http.html>`_ для получения полезного списка заголовков HTTP с краткими объяснениями их значения и использования.

source: Openers and Handlers
es_es: Abridores y manipuladores
ru: Открыватели и манипуляторы

source: When you fetch a URL you use an opener (an instance of the perhaps confusingly named :class:`urllib.request.OpenerDirector`). Normally we have been using the default opener - via ``urlopen`` - but you can create custom openers. Openers use handlers. All the "heavy lifting" is done by the handlers. Each handler knows how to open URLs for a particular URL scheme (http, ftp, etc.), or how to handle an aspect of URL opening, for example HTTP redirections or HTTP cookies.
es_es: Cuando obtienes una URL utilizas un abridor (una instancia del quizás confusamente llamado :class:`urllib.request.OpenerDirector`). Normalmente usamos el abridor por defecto - vía ``urlopen`` - pero se pueden crear abridores personalizados. Los abridores utilizan manejadores. Todo el "trabajo pesado" lo hacen los manejadores. Cada manejador sabe cómo abrir URLs para un esquema de URL particular (http, ftp, etc.), o cómo manejar un aspecto de la apertura de URLs, por ejemplo redirecciones HTTP o cookies HTTP.
ru: Когда вы получаете URL-адрес, вы используете открывающее устройство (экземпляр, возможно, с запутанным названием :class:`urllib.request.OpenerDirector`). Обычно мы используем открыватель по умолчанию — через urlopen — но вы можете создавать собственные открыватели. Открыватели используют обработчики. Всю «тяжелую работу» выполняют проводники. Каждый обработчик знает, как открывать URL-адреса для определенной схемы URL-адресов (http, ftp и т. д.) или как обрабатывать какой-либо аспект открытия URL-адреса, например перенаправление HTTP или файлы cookie HTTP.

source: You will want to create openers if you want to fetch URLs with specific handlers installed, for example to get an opener that handles cookies, or to get an opener that does not handle redirections.
es_es: Usted querrá crear abridores si quiere obtener URLs con manejadores específicos instalados, por ejemplo para obtener un abridor que maneje cookies, o para obtener un abridor que no maneje redirecciones.
ru: Вам понадобится создать средства открытия, если вы хотите получать URL-адреса с установленными определенными обработчиками, например, чтобы получить средство открытия, которое обрабатывает файлы cookie, или получить средство открытия, которое не обрабатывает перенаправления.

source: To create an opener, instantiate an ``OpenerDirector``, and then call ``.add_handler(some_handler_instance)`` repeatedly.
es_es: Para crear un abridor, instancie un ``OpenerDirector``, y luego llame a ``.add_handler(some_handler_instance)`` repetidamente.
ru: Чтобы создать открывающее средство, создайте экземпляр OpenerDirector, а затем несколько раз вызовите .add_handler(some_handler_instance).

source: Alternatively, you can use ``build_opener``, which is a convenience function for creating opener objects with a single function call. ``build_opener`` adds several handlers by default, but provides a quick way to add more and/or override the default handlers.
es_es: Alternativamente, puede utilizar ``build_opener``, que es una función de conveniencia para crear objetos abridores con una sola llamada a la función. ``build_opener`` añade varios manejadores por defecto, pero proporciona una forma rápida de añadir más y/o anular los manejadores por defecto.
ru: В качестве альтернативы вы можете использовать build_opener, удобную функцию для создания объектов открытия с помощью одного вызова функции. ``build_opener`` добавляет несколько обработчиков по умолчанию, но обеспечивает быстрый способ добавить больше и/или переопределить обработчики по умолчанию.

source: Other sorts of handlers you might want to can handle proxies, authentication, and other common but slightly specialised situations.
es_es: Otros tipos de manejadores que se podrían querer pueden manejar proxies, autenticación y otras situaciones comunes pero ligeramente especializadas.
ru: Другие типы обработчиков, которые вам могут понадобиться, могут обрабатывать прокси, аутентификацию и другие распространенные, но немного специализированные ситуации.

source: ``install_opener`` can be used to make an ``opener`` object the (global) default opener. This means that calls to ``urlopen`` will use the opener you have installed.
es_es: ``install_opener`` se puede utilizar para hacer que un objeto ``opener`` sea el abridor (global) por defecto. Esto significa que las llamadas a ``urlopen`` utilizarán el abridor que se tenga instalado.
ru: ``install_opener`` можно использовать, чтобы сделать объект ``opener`` (глобальным) открывателем по умолчанию. Это означает, что вызовы urlopen будут использовать установленный вами открыватель.

source: Opener objects have an ``open`` method, which can be called directly to fetch urls in the same way as the ``urlopen`` function: there's no need to call ``install_opener``, except as a convenience.
es_es: Los objetos abridores tienen un método ``open``, al que se puede llamar directamente para obtener urls del mismo modo que a la función ``urlopen``: no es necesario llamar a ``install_opener``, salvo por comodidad.
ru: Объекты Opener имеют метод open, который можно вызывать напрямую для получения URL-адресов так же, как и функцию urlopen: нет необходимости вызывать install_opener, кроме как для удобства.

source: Basic Authentication
es_es: Autenticación básica
ru: Базовая аутентификация

source: To illustrate creating and installing a handler we will use the ``HTTPBasicAuthHandler``. For a more detailed discussion of this subject -- including an explanation of how Basic Authentication works - see the `Basic Authentication Tutorial <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.
es_es: Para ilustrar la creación e instalación de un manejador utilizaremos la página ``HTTPBasicAuthHandler``. Para una discusión más detallada de este tema - incluyendo una explicación de cómo funciona la Autenticación Básica - ver el `Tutorial de Autenticación Básica <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.
ru: Чтобы проиллюстрировать создание и установку обработчика, мы будем использовать HTTPBasicAuthHandler. Более подробное обсуждение этой темы, включая объяснение того, как работает базовая аутентификация, см. в «Руководстве по базовой аутентификации» <https://web.archive.org/web/20201215133350/http://www.voidspace.org. uk/python/articles/authentication.shtml>`__.

source: When authentication is required, the server sends a header (as well as the 401 error code) requesting authentication. This specifies the authentication scheme and a 'realm'. The header looks like: ``WWW-Authenticate: SCHEME realm="REALM"``.
es_es: Cuando se requiere autenticación, el servidor envía una cabecera (además del código de error 401) solicitando autenticación. En ella se especifica el esquema de autenticación y un "dominio". La cabecera tiene el siguiente aspecto: ``WWW-Authenticate: SCHEME realm="REALM"``.
ru: Когда требуется аутентификация, сервер отправляет заголовок (а также код ошибки 401) с запросом аутентификации. Это определяет схему аутентификации и «область». Заголовок выглядит так: ``WWW-Authenticate: SCHEMErealm="REALM"``.

source: e.g.
es_es: Por ejemplo
ru: напр.

source: The client should then retry the request with the appropriate name and password for the realm included as a header in the request. This is 'basic authentication'. In order to simplify this process we can create an instance of ``HTTPBasicAuthHandler`` and an opener to use this handler.
es_es: A continuación, el cliente debe reintentar la solicitud con el nombre y la contraseña adecuados para el dominio incluidos como encabezado en la solicitud. Esto es "autenticación básica". Para simplificar este proceso podemos crear una instancia de ``HTTPBasicAuthHandler`` y un abridor para utilizar este manejador.
ru: Затем клиент должен повторить запрос с соответствующим именем и паролем для области, включенными в заголовок запроса. Это «базовая аутентификация». Чтобы упростить этот процесс, мы можем создать экземпляр HTTPBasicAuthHandler и средство открытия для использования этого обработчика.

source: The ``HTTPBasicAuthHandler`` uses an object called a password manager to handle the mapping of URLs and realms to passwords and usernames. If you know what the realm is (from the authentication header sent by the server), then you can use a ``HTTPPasswordMgr``. Frequently one doesn't care what the realm is. In that case, it is convenient to use ``HTTPPasswordMgrWithDefaultRealm``. This allows you to specify a default username and password for a URL. This will be supplied in the absence of you providing an alternative combination for a specific realm. We indicate this by providing ``None`` as the realm argument to the ``add_password`` method.
es_es: ``HTTPBasicAuthHandler`` utiliza un objeto llamado gestor de contraseñas para gestionar la asignación de URLs y dominios a contraseñas y nombres de usuario. Si se sabe cuál es el dominio (a partir de la cabecera de autenticación enviada por el servidor), entonces se puede utilizar un ``HTTPPasswordMgr``. Frecuentemente a uno no le importa cuál es el dominio. En ese caso, es conveniente utilizar ``HTTPPasswordMgrWithDefaultRealm``. Esto permite especificar un nombre de usuario y una contraseña por defecto para una URL. Se le proporcionará en caso de que no proporcione una combinación alternativa para un dominio específico. Esto se indica proporcionando ``None`` como argumento de dominio para el método ``add_password``.
ru: HTTPBasicAuthHandler использует объект, называемый менеджером паролей, для обработки сопоставления URL-адресов и областей с паролями и именами пользователей. Если вы знаете, что такое область (из заголовка аутентификации, отправленного сервером), вы можете использовать HTTPPasswordMgr. Часто человека не волнует, что это за царство. В этом случае удобно использовать HTTPPasswordMgrWithDefaultRealm. Это позволяет вам указать имя пользователя и пароль по умолчанию для URL-адреса. Это будет предоставлено, если вы не предоставите альтернативную комбинацию для конкретной области. Мы указываем это, предоставляя None в качестве аргумента области для метода add_password.

source: The top-level URL is the first URL that requires authentication. URLs "deeper" than the URL you pass to .add_password() will also match. ::
es_es: La URL de nivel superior es la primera URL que requiere autenticación. Las URL "más profundas" que la URL que pases a .add_password() también coincidirán. ::
ru: URL-адрес верхнего уровня — это первый URL-адрес, требующий аутентификации. URL-адреса «глубже», чем URL-адрес, который вы передаете в .add_password(), также будут совпадать. ::

source: In the above example we only supplied our ``HTTPBasicAuthHandler`` to ``build_opener``. By default openers have the handlers for normal situations -- ``ProxyHandler`` (if a proxy setting such as an :envvar:`!http_proxy` environment variable is set), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.
es_es: En el ejemplo anterior sólo suministramos nuestro ``HTTPBasicAuthHandler`` a ``build_opener``. Por defecto, los abridores tienen los manejadores para situaciones normales -- ``ProxyHandler`` (si se establece una configuración de proxy como una variable de entorno :envvar:`!http_proxy` ), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.
ru: В приведенном выше примере мы предоставили только наш HTTPBasicAuthHandler для build_opener. По умолчанию открывающие программы имеют обработчики для нормальных ситуаций — ``ProxyHandler`` (если установлены такие настройки прокси, как переменная среды :envvar:`!http_proxy`), ``UnknownHandler``, ``HTTPHandler``, `` `HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.

source: ``top_level_url`` is in fact *either* a full URL (including the 'http:' scheme component and the hostname and optionally the port number) e.g. ``"http://example.com/"`` *or* an "authority" (i.e. the hostname, optionally including the port number) e.g. ``"example.com"`` or ``"example.com:8080"`` (the latter example includes a port number). The authority, if present, must NOT contain the "userinfo" component - for example ``"joe:password@example.com"`` is not correct.
es_es: ``top_level_url`` es de hecho *o* una URL completa (incluyendo el componente de esquema 'http:' y el nombre de host y opcionalmente el número de puerto) por ejemplo ``"http://example.com/"`` *o* una "autoridad" (es decir, el nombre de host, incluyendo opcionalmente el número de puerto) por ejemplo ``"example.com"`` o ``"example.com:8080"`` (el último ejemplo incluye un número de puerto). La autoridad, si está presente, NO debe contener el componente "userinfo" - por ejemplo ``"joe:password@example.com"`` no es correcto.
ru: ``top_level_url`` на самом деле *либо* полный URL-адрес (включая компонент схемы 'http:', имя хоста и, возможно, номер порта), например ``"http://example.com/"`` *или* «авторитет» (т. е. имя хоста, необязательно включая номер порта), например «example.com» или «example.com:8080» (последний пример включает номер порта). Полномочия, если они присутствуют, НЕ должны содержать компонент «userinfo» — например, ``"joe:password@example.com"`` неверен.

source: Proxies
es_es: Apoderados
ru: Прокси-серверы

source: **urllib** will auto-detect your proxy settings and use those. This is through the ``ProxyHandler``, which is part of the normal handler chain when a proxy setting is detected. Normally that's a good thing, but there are occasions when it may not be helpful [#]_. One way to do this is to setup our own ``ProxyHandler``, with no proxies defined. This is done using similar steps to setting up a `Basic Authentication`_ handler: ::
es_es: **urllib** detectará automáticamente tu configuración de proxy y la utilizará. Esto se hace a través de ``ProxyHandler``, que forma parte de la cadena normal de controladores cuando se detecta una configuración de proxy. Normalmente esto es bueno, pero hay ocasiones en las que puede no ser útil [#]_. Una forma de hacerlo es configurar nuestro propio ``ProxyHandler``, sin proxies definidos. Esto se hace siguiendo pasos similares a la configuración de un manejador `Basic Authentication`_: ::
ru: **urllib** автоматически определит настройки вашего прокси-сервера и будет использовать их. Это осуществляется через ProxyHandler, который является частью обычной цепочки обработчиков при обнаружении настройки прокси. Обычно это хорошо, но бывают случаи, когда это может оказаться бесполезным. [#]_ . Один из способов сделать это — настроить наш собственный ProxyHandler без определения прокси. Это делается с помощью шагов, аналогичных настройке обработчика `Basic Authentication`_:::

source: Currently ``urllib.request`` *does not* support fetching of ``https`` locations through a proxy. However, this can be enabled by extending urllib.request as shown in the recipe [#]_.
es_es: Actualmente ``urllib.request`` *no* soporta la obtención de ubicaciones ``https`` a través de un proxy. Sin embargo, esto puede habilitarse ampliando urllib.request como se muestra en la receta [#]_.
ru: В настоящее время urllib.request *не* поддерживает получение местоположений https через прокси. Однако это можно включить, расширив urllib.request, как показано в рецепте. [#]_ .

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
es_es: ``HTTP_PROXY`` se ignorará si se establece una variable ``REQUEST_METHOD``; consultar la documentación sobre :func:`~urllib.request.getproxies`.
ru: ``HTTP_PROXY`` будет игнорироваться, если установлена ​​переменная ``REQUEST_METHOD``; см. документацию по :func:`~urllib.request.getproxies`.

source: Sockets and Layers
es_es: Sockets y capas
ru: Сокеты и слои

source: The Python support for fetching resources from the web is layered. urllib uses the :mod:`http.client` library, which in turn uses the socket library.
es_es: El soporte de Python para la obtención de recursos de la web está estratificado. urllib utiliza la biblioteca :mod:`http.client`, que a su vez utiliza la biblioteca socket.
ru: Поддержка Python для получения ресурсов из Интернета является многоуровневой. urllib использует библиотеку :mod:`http.client`, которая, в свою очередь, использует библиотеку сокетов.

source: As of Python 2.3 you can specify how long a socket should wait for a response before timing out. This can be useful in applications which have to fetch web pages. By default the socket module has *no timeout* and can hang. Currently, the socket timeout is not exposed at the http.client or urllib.request levels. However, you can set the default timeout globally for all sockets using ::
es_es: A partir de Python 2.3 se puede especificar cuánto tiempo debe esperar un socket una respuesta antes de que se agote el tiempo de espera. Esto puede ser útil en aplicaciones que tienen que obtener páginas web. Por defecto, el módulo socket no tiene *tiempo de espera* y puede colgarse. Actualmente, el tiempo de espera del socket no está expuesto en los niveles http.client o urllib.request. Sin embargo, puede establecer el tiempo de espera por defecto globalmente para todos los sockets usando ::
ru: Начиная с Python 2.3, вы можете указать, как долго сокет должен ждать ответа, прежде чем истечет время ожидания. Это может быть полезно в приложениях, которым необходимо получать веб-страницы. По умолчанию модуль сокета не имеет тайм-аута и может зависать. В настоящее время тайм-аут сокета не отображается на уровнях http.client или urllib.request. Однако вы можете установить тайм-аут по умолчанию глобально для всех сокетов, используя ::

source: Footnotes
es_es: Notas a pie de página
ru: Сноски

source: This document was reviewed and revised by John Lee.
es_es: Este documento ha sido revisado y corregido por John Lee.
ru: Этот документ был рассмотрен и исправлен Джоном Ли.

source: Google for example.
es_es: Google, por ejemplo.
ru: Например, Google.
