Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/urllib2.po
Languages: es_es, ru

source: HOWTO Fetch Internet Resources Using The urllib Package
es_es: CÓMO Obtener recursos de Internet con el paquete urllib
ru: КАК получить интернет-ресурсы с помощью пакета urllib

source: Author
es_es: Autor
ru: Автор

source: `Michael Foord <https://agileabstractions.com/>`_
ru: `Майкл Фурд <https://agileabstractions.com/>`_

source: Introduction
es_es: Introducción
ru: Введение

source: You may also find useful the following article on fetching web resources with Python:
es_es: También puede resultarle útil el siguiente artículo sobre la obtención de recursos web con Python:
ru: Вам также может оказаться полезной следующая статья о получении веб-ресурсов с помощью Python:

source: `Basic Authentication <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`_
es_es: Autenticación básica <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`_
ru: `Базовая аутентификация <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`_

source: A tutorial on *Basic Authentication*, with examples in Python.
es_es: Un tutorial sobre *Autenticación Básica*, con ejemplos en Python.
ru: Учебник по *Базовой аутентификации* с примерами на Python.

source: **urllib.request** is a Python module for fetching URLs (Uniform Resource Locators). It offers a very simple interface, in the form of the *urlopen* function. This is capable of fetching URLs using a variety of different protocols. It also offers a slightly more complex interface for handling common situations - like basic authentication, cookies, proxies and so on. These are provided by objects called handlers and openers.
es_es: **urllib.request** es un módulo de Python para obtener URLs (Localizadores Uniformes de Recursos). Ofrece una interfaz muy sencilla, en forma de la función *urlopen*. Esto es capaz de obtener URLs usando una variedad de protocolos diferentes. También ofrece una interfaz un poco más compleja para manejar situaciones comunes, como autenticación básica, cookies, proxies, etcétera. Estos son proporcionados por objetos llamados handlers y openers.
ru: **urllib.request** — это модуль Python для получения URL-адресов (унифицированных локаторов ресурсов). Он предлагает очень простой интерфейс в виде функции *urlopen*. Он способен получать URL-адреса с использованием различных протоколов. Он также предлагает немного более сложный интерфейс для обработки распространенных ситуаций, таких как базовая аутентификация, файлы cookie, прокси и т. д. Они предоставляются объектами, называемыми обработчиками и открывателями.

source: urllib.request supports fetching URLs for many "URL schemes" (identified by the string before the ``":"`` in URL - for example ``"ftp"`` is the URL scheme of ``"ftp://python.org/"``) using their associated network protocols (e.g. FTP, HTTP). This tutorial focuses on the most common case, HTTP.
es_es: urllib.request soporta la obtención de URLs para muchos "esquemas URL" (identificados por la cadena antes de ``":"`` en URL - por ejemplo ``"ftp"`` es el esquema URL de ``"ftp://python.org/"``) usando sus protocolos de red asociados (por ejemplo FTP, HTTP). Este tutorial se centra en el caso más común, HTTP.
ru: urllib.request поддерживает получение URL-адресов для многих "схем URL-адресов" (определяемых строкой перед ``":"`` в URL-адресе - например, ``"ftp"`` — это URL-схема ``"ftp:// python.org/"``), используя связанные с ними сетевые протоколы (например, FTP, HTTP). В этом руководстве рассматривается наиболее распространенный случай — HTTP.

source: For straightforward situations *urlopen* is very easy to use. But as soon as you encounter errors or non-trivial cases when opening HTTP URLs, you will need some understanding of the HyperText Transfer Protocol. The most comprehensive and authoritative reference to HTTP is :rfc:`2616`. This is a technical document and not intended to be easy to read. This HOWTO aims to illustrate using *urllib*, with enough detail about HTTP to help you through. It is not intended to replace the :mod:`urllib.request` docs, but is supplementary to them.
es_es: Para situaciones sencillas *urlopen* es muy fácil de usar. Pero en cuanto encuentre errores o casos no triviales al abrir URLs HTTP, necesitará algún conocimiento del Protocolo de Transferencia de Hipertexto. La referencia más completa y autorizada sobre HTTP es :rfc:`2616`. Se trata de un documento técnico y no pretende ser fácil de leer. Este COMO pretende ilustrar el uso de *urllib*, con suficiente detalle sobre HTTP para ayudarle. No pretende reemplazar los documentos de :mod:`urllib.request`, sino complementarlos.
ru: В простых ситуациях *urlopen* очень легко использовать. Но как только вы столкнетесь с ошибками или нетривиальными случаями при открытии HTTP-ссылок, вам понадобится некоторое понимание протокола передачи гипертекста. Наиболее полная и авторитетная ссылка на HTTP — :rfc:`2616`. Это технический документ, который не предназначен для легкого чтения. Этот HOWTO призван проиллюстрировать использование *urllib* с достаточным количеством подробностей о HTTP, чтобы помочь вам в этом. Он не предназначен для замены документации :mod:`urllib.request`, а является дополнением к ней.

source: Fetching URLs
ru: Получение URL-адресов

source: The simplest way to use urllib.request is as follows::
es_es: La forma más sencilla de utilizar urllib.request es la siguiente::
ru: Самый простой способ использования urllib.request выглядит следующим образом:

source: If you wish to retrieve a resource via URL and store it in a temporary location, you can do so via the :func:`shutil.copyfileobj` and :func:`tempfile.NamedTemporaryFile` functions::
es_es: Si desea recuperar un recurso a través de una URL y almacenarlo en una ubicación temporal, puede hacerlo mediante las funciones :func:`shutil.copyfileobj` y :func:`tempfile.NamedTemporaryFile`::
ru: Если вы хотите получить ресурс по URL-адресу и сохранить его во временном расположении, вы можете сделать это с помощью функций :func:`shutil.copyfileobj` и :func:`tempfile.NamedTemporaryFile`::

source: Many uses of urllib will be that simple (note that instead of an 'http:' URL we could have used a URL starting with 'ftp:', 'file:', etc.). However, it's the purpose of this tutorial to explain the more complicated cases, concentrating on HTTP.
es_es: Muchos usos de urllib serán así de sencillos (nótese que en lugar de una URL 'http:' podríamos haber usado una URL que empezara por 'ftp:', 'file:', etc.). Sin embargo, el propósito de este tutorial es explicar los casos más complicados, concentrándonos en HTTP.
ru: Многие варианты использования urllib будут настолько простыми (обратите внимание, что вместо URL-адреса «http:» мы могли бы использовать URL-адрес, начинающийся с «ftp:», «file:» и т. д.). Однако цель этого руководства — объяснить более сложные случаи, сосредоточив внимание на HTTP.

source: HTTP is based on requests and responses - the client makes requests and servers send responses. urllib.request mirrors this with a ``Request`` object which represents the HTTP request you are making. In its simplest form you create a Request object that specifies the URL you want to fetch. Calling ``urlopen`` with this Request object returns a response object for the URL requested. This response is a file-like object, which means you can for example call ``.read()`` on the response::
es_es: HTTP se basa en peticiones y respuestas - el cliente hace peticiones y los servidores envían respuestas. urllib.request refleja esto con un objeto ``Request`` que representa la petición HTTP que estás haciendo. En su forma más simple, se crea un objeto Request que especifica la URL que se desea obtener. Al llamar a ``urlopen`` con este objeto Request, se obtiene un objeto de respuesta para la URL solicitada. Esta respuesta es un objeto similar a un archivo, lo que significa que puede, por ejemplo, llamar a ``.read()`` con la respuesta::
ru: HTTP основан на запросах и ответах: клиент отправляет запросы, а серверы отправляют ответы. urllib.request отражает это с помощью объекта Request, который представляет HTTP-запрос, который вы делаете. В своей простейшей форме вы создаете объект Request, который указывает URL-адрес, который вы хотите получить. Вызов urlopen с этим объектом Request возвращает объект ответа для запрошенного URL. Этот ответ представляет собой файлоподобный объект, что означает, что вы можете, например, вызвать ``.read()`` для ответа:

source: Note that urllib.request makes use of the same Request interface to handle all URL schemes. For example, you can make an FTP request like so::
es_es: Tenga en cuenta que urllib.request hace uso de la misma interfaz Request para manejar todos los esquemas de URL. Por ejemplo, puedes hacer una petición FTP como::
ru: Обратите внимание, что urllib.request использует один и тот же интерфейс запроса для обработки всех схем URL-адресов. Например, вы можете сделать FTP-запрос следующим образом:

source: In the case of HTTP, there are two extra things that Request objects allow you to do: First, you can pass data to be sent to the server. Second, you can pass extra information ("metadata") *about* the data or about the request itself, to the server - this information is sent as HTTP "headers". Let's look at each of these in turn.
es_es: En el caso de HTTP, hay dos cosas adicionales que los objetos Request permiten hacer: Primero, puedes pasar datos para que sean enviados al servidor. En segundo lugar, puedes pasar información extra ("metadatos") *sobre* los datos o sobre la propia petición, al servidor - esta información se envía como "cabeceras" HTTP. Veamos cada una de ellas por separado.
ru: В случае HTTP есть две дополнительные вещи, которые объекты Request позволяют вам делать: во-первых, вы можете передавать данные для отправки на сервер. Во-вторых, вы можете передать дополнительную информацию («метаданные») *о* данных или о самом запросе на сервер — эта информация отправляется в виде «заголовков» HTTP. Давайте рассмотрим каждый из них по очереди.

source: Data
es_es: Datos
ru: Данные

source: Sometimes you want to send data to a URL (often the URL will refer to a CGI (Common Gateway Interface) script or other web application). With HTTP, this is often done using what's known as a **POST** request. This is often what your browser does when you submit a HTML form that you filled in on the web. Not all POSTs have to come from forms: you can use a POST to transmit arbitrary data to your own application. In the common case of HTML forms, the data needs to be encoded in a standard way, and then passed to the Request object as the ``data`` argument. The encoding is done using a function from the :mod:`urllib.parse` library. ::
es_es: A veces quieres enviar datos a una URL (a menudo la URL se referirá a un script CGI (Common Gateway Interface) u otra aplicación web). Con HTTP, esto se hace a menudo usando lo que se conoce como una petición **POST**. Esto es lo que suele hacer tu navegador cuando envías un formulario HTML que has rellenado en la web. No todos los POSTs tienen que venir de formularios: puedes usar un POST para transmitir datos arbitrarios a tu propia aplicación. En el caso común de los formularios HTML, los datos necesitan ser codificados de una manera estándar, y luego pasados al objeto Request como el argumento ``data``. La codificación se realiza utilizando una función de la biblioteca :mod:`urllib.parse`. ::
ru: Иногда вам нужно отправить данные на URL-адрес (часто URL-адрес будет относиться к сценарию CGI (Common Gateway Interface) или другому веб-приложению). В HTTP это часто делается с помощью так называемого запроса **POST**. Часто именно это делает ваш браузер, когда вы отправляете HTML-форму, которую заполнили в Интернете. Не все POST-запросы должны поступать из форм: вы можете использовать POST для передачи произвольных данных в ваше собственное приложение. В обычном случае HTML-форм данные необходимо закодировать стандартным способом, а затем передать объекту Request в качестве аргумента data. Кодирование осуществляется с помощью функции из библиотеки :mod:`urllib.parse`. ::

source: Note that other encodings are sometimes required (e.g. for file upload from HTML forms - see `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ for more details).
es_es: Tener en cuenta que a veces se requieren otras codificaciones (por ejemplo, para la carga de archivos desde formularios HTML; ver `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ para obtener más detalles).
ru: Обратите внимание, что иногда требуются другие кодировки (например, для загрузки файлов из HTML-форм — см. `Спецификация HTML, Отправка формы <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>). `_ для более подробной информации).

source: If you do not pass the ``data`` argument, urllib uses a **GET** request. One way in which GET and POST requests differ is that POST requests often have "side-effects": they change the state of the system in some way (for example by placing an order with the website for a hundredweight of tinned spam to be delivered to your door). Though the HTTP standard makes it clear that POSTs are intended to *always* cause side-effects, and GET requests *never* to cause side-effects, nothing prevents a GET request from having side-effects, nor a POST requests from having no side-effects. Data can also be passed in an HTTP GET request by encoding it in the URL itself.
es_es: Si no se pasa el argumento ``data``, urllib utiliza una petición **GET**. Una forma en la que las peticiones GET y POST difieren es que las peticiones POST a menudo tienen "efectos secundarios": cambian el estado del sistema de alguna manera (por ejemplo, haciendo un pedido al sitio web para que le entreguen a su puerta un quintal de spam en lata). Aunque el estándar HTTP deja claro que las peticiones POST deben causar *siempre* efectos secundarios, y las peticiones GET *nunca* efectos secundarios, nada impide que una petición GET tenga efectos secundarios, ni que una petición POST no los tenga. También se pueden pasar datos en una petición HTTP GET codificándolos en la propia URL.
ru: Если вы не передадите аргумент ``data``, urllib использует запрос **GET**. Одно из отличий запросов GET и POST заключается в том, что запросы POST часто имеют «побочные эффекты»: они каким-то образом меняют состояние системы (например, размещая на веб-сайте заказ на доставку центнера консервированного спама). до вашей двери). Хотя стандарт HTTP ясно дает понять, что запросы POST *всегда* вызывают побочные эффекты, а запросы GET *никогда* не вызывают побочных эффектов, ничто не препятствует тому, чтобы запрос GET имел побочные эффекты, а запросы POST не имели побочных эффектов. побочные эффекты. Данные также можно передавать в запросе HTTP GET, закодировав их в самом URL-адресе.

source: This is done as follows::
es_es: Esto se hace de la siguiente manera::
ru: Это делается следующим образом:

source: Notice that the full URL is created by adding a ``?`` to the URL, followed by the encoded values.
es_es: Observe que la URL completa se crea añadiendo un ``?`` a la URL, seguido de los valores codificados.
ru: Обратите внимание, что полный URL-адрес создается путем добавления к URL-адресу символа ``?``, за которым следуют закодированные значения.

source: Headers
es_es: Cabeceras
ru: Заголовки

source: We'll discuss here one particular HTTP header, to illustrate how to add headers to your HTTP request.
es_es: Vamos a discutir aquí una cabecera HTTP en particular, para ilustrar cómo añadir cabeceras a su petición HTTP.
ru: Мы обсудим здесь один конкретный HTTP-заголовок, чтобы проиллюстрировать, как добавлять заголовки в ваш HTTP-запрос.

source: Some websites [#]_ dislike being browsed by programs, or send different versions to different browsers [#]_. By default urllib identifies itself as ``Python-urllib/x.y`` (where ``x`` and ``y`` are the major and minor version numbers of the Python release, e.g. ``Python-urllib/2.5``), which may confuse the site, or just plain not work. The way a browser identifies itself is through the ``User-Agent`` header [#]_. When you create a Request object you can pass a dictionary of headers in. The following example makes the same request as above, but identifies itself as a version of Internet Explorer [#]_. ::
es_es: A algunos sitios web [#]_ no les gusta ser navegados por programas, o envían diferentes versiones a diferentes navegadores [#]_. Por defecto urllib se identifica como ``Python-urllib/x.y`` (donde ``x`` y ``y`` son los números de versión mayor y menor de la versión de Python, por ejemplo ``Python-urllib/2.5``), lo que puede confundir al sitio, o simplemente no funcionar. La forma en que un navegador se identifica es a través de la cabecera ``User-Agent`` [#]_ . Cuando creas un objeto Request puedes pasarle un diccionario de cabeceras. El siguiente ejemplo hace la misma petición que el anterior, pero se identifica como una versión de Internet Explorer [#]_. ::
ru: Некоторые веб-сайты [#]_ не нравится, когда их просматривают программы, или отправляют разные версии в разные браузеры [#]_ . По умолчанию urllib идентифицирует себя как ``Python-urllib/xy`` (где ``x`` и ``y`` — это старший и дополнительный номера версий версии Python, например ``Python-urllib/2.5`` ), что может запутать сайт или просто не работать. Браузер идентифицирует себя через заголовок User-Agent. [#]_ . При создании объекта Request вы можете передать словарь заголовков. В следующем примере выполняется тот же запрос, что и выше, но он идентифицируется как версия Internet Explorer. [#]_ . ::

source: The response also has two useful methods. See the section on `info and geturl`_ which comes after we have a look at what happens when things go wrong.
es_es: La respuesta también tiene dos métodos útiles. Ver la sección sobre `info y geturl`_ que viene después de que echemos un vistazo a lo que ocurre cuando las cosas van mal.
ru: Ответ также имеет два полезных метода. См. раздел `info и geturl`_, который появится после того, как мы рассмотрим, что происходит, когда что-то идет не так.

source: Handling Exceptions
es_es: Gestión de excepciones
ru: Обработка исключений

source: *urlopen* raises :exc:`~urllib.error.URLError` when it cannot handle a response (though as usual with Python APIs, built-in exceptions such as :exc:`ValueError`, :exc:`TypeError` etc. may also be raised).
es_es: *urlopen* lanza :exc:`~urllib.error.URLError` cuando no puede manejar una respuesta (aunque como es habitual con las APIs de Python, también se pueden lanzar excepciones incorporadas como :exc:`ValueError`, :exc:`TypeError` etc.).
ru: *urlopen* вызывает :exc:`~urllib.error.URLError`, когда он не может обработать ответ (хотя, как обычно в API Python, встроенные исключения, такие как :exc:`ValueError`, :exc:`TypeError` и т. д. тоже может быть повышено).

source: :exc:`~urllib.error.HTTPError` is the subclass of :exc:`~urllib.error.URLError` raised in the specific case of HTTP URLs.
es_es: :exc:`~urllib.error.HTTPError` es la subclase de :exc:`~urllib.error.URLError` planteada en el caso específico de las URL HTTP.
ru: :exc:`~urllib.error.HTTPError` является подклассом :exc:`~urllib.error.URLError`, возникающим в конкретном случае HTTP-URL.

source: The exception classes are exported from the :mod:`urllib.error` module.
es_es: Las clases de excepción se exportan desde el módulo :mod:`urllib.error`.
ru: Классы исключений экспортируются из модуля :mod:`urllib.error`.

source: Often, URLError is raised because there is no network connection (no route to the specified server), or the specified server doesn't exist. In this case, the exception raised will have a 'reason' attribute, which is a tuple containing an error code and a text error message.
es_es: A menudo, URLError se lanza porque no hay conexión de red (no hay ruta al servidor especificado), o el servidor especificado no existe. En este caso, la excepción lanzada tendrá un atributo 'reason', que es una tupla que contiene un código de error y un mensaje de error de texto.
ru: Часто ошибка URLError возникает из-за отсутствия сетевого подключения (нет маршрута к указанному серверу) или указанного сервера не существует. В этом случае возникшее исключение будет иметь атрибут «причина», который представляет собой кортеж, содержащий код ошибки и текстовое сообщение об ошибке.

source: e.g. ::
ru: напр. ::

source: Every HTTP response from the server contains a numeric "status code". Sometimes the status code indicates that the server is unable to fulfil the request. The default handlers will handle some of these responses for you (for example, if the response is a "redirection" that requests the client fetch the document from a different URL, urllib will handle that for you). For those it can't handle, urlopen will raise an :exc:`~urllib.error.HTTPError`. Typical errors include '404' (page not found), '403' (request forbidden), and '401' (authentication required).
es_es: Cada respuesta HTTP del servidor contiene un "código de estado" numérico. A veces, el código de estado indica que el servidor no puede satisfacer la petición. Los gestores predeterminados gestionarán algunas de estas respuestas por ti (por ejemplo, si la respuesta es una "redirección" que solicita al cliente que obtenga el documento de una URL diferente, urllib lo hará por ti). Para aquellas que no pueda manejar, urlopen lanzará un mensaje :exc:`~urllib.error.HTTPError`. Los errores típicos incluyen '404' (página no encontrada), '403' (petición prohibida) y '401' (autenticación requerida).
ru: Каждый HTTP-ответ от сервера содержит числовой «код состояния». Иногда код состояния указывает на то, что сервер не может выполнить запрос. Обработчики по умолчанию будут обрабатывать некоторые из этих ответов за вас (например, если ответ представляет собой «перенаправление», которое запрашивает у клиента получение документа с другого URL-адреса, urllib обработает это за вас). Для тех, с которыми он не может справиться, urlopen выдаст :exc:`~urllib.error.HTTPError`. Типичные ошибки включают «404» (страница не найдена), «403» (запрос запрещен) и «401» (требуется проверка подлинности).

source: See section 10 of :rfc:`2616` for a reference on all the HTTP error codes.
es_es: Consultar la sección 10 de :rfc:`2616` para obtener una referencia sobre todos los códigos de error HTTP.
ru: См. раздел 10 документа :rfc:`2616` для получения информации обо всех кодах ошибок HTTP.

source: The :exc:`~urllib.error.HTTPError` instance raised will have an integer 'code' attribute, which corresponds to the error sent by the server.
es_es: La instancia :exc:`~urllib.error.HTTPError` levantada tendrá un atributo entero 'code', que corresponde al error enviado por el servidor.
ru: Созданный экземпляр :exc:`~urllib.error.HTTPError` будет иметь целочисленный атрибут code, который соответствует ошибке, отправленной сервером.

source: Error Codes
es_es: Códigos de error
ru: Коды ошибок

source: Because the default handlers handle redirects (codes in the 300 range), and codes in the 100--299 range indicate success, you will usually only see error codes in the 400--599 range.
es_es: Dado que los gestores por defecto gestionan las redirecciones (códigos en el rango 300), y los códigos en el rango 100--299 indican éxito, normalmente sólo verá códigos de error en el rango 400--599.
ru: Поскольку обработчики по умолчанию обрабатывают перенаправления (коды в диапазоне 300), а коды в диапазоне 100–299 указывают на успех, вы обычно увидите только коды ошибок в диапазоне 400–599.
