Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/howto/urllib2.po
Languages: es_es, ru

source: Browser sniffing is a very bad practice for website design - building sites using web standards is much more sensible. Unfortunately a lot of sites still send different versions to different browsers.
es_es: El rastreo de navegadores es una práctica muy poco recomendable en el diseño de sitios web; es mucho más sensato crear sitios que utilicen estándares web. Por desgracia, muchos sitios siguen enviando versiones distintas a navegadores diferentes.
ru: Сниффинг браузера — очень плохая практика для дизайна веб-сайтов: создание сайтов с использованием веб-стандартов гораздо разумнее. К сожалению, многие сайты по-прежнему отправляют разные версии в разные браузеры.

source: The user agent for MSIE 6 is *'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*
es_es: El agente de usuario para MSIE 6 es *'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*.
ru: Пользовательским агентом для MSIE 6 является *'Mozilla/4.0 (совместимый; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*

source: For details of more HTTP request headers, see `Quick Reference to HTTP Headers`_.
es_es: Para más detalles sobre las cabeceras HTTP, ver `Quick Reference to HTTP Headers`_.
ru: Дополнительные сведения о заголовках HTTP-запросов см. в разделе «Краткий справочник по заголовкам HTTP».

source: In my case I have to use a proxy to access the internet at work. If you attempt to fetch *localhost* URLs through this proxy it blocks them. IE is set to use the proxy, which urllib picks up on. In order to test scripts with a localhost server, I have to prevent urllib from using the proxy.
es_es: En mi caso tengo que usar un proxy para acceder a Internet en el trabajo. Si intenta obtener URL *localhost* a través de este proxy, las bloquea. IE está configurado para usar el proxy, que urllib capta. Para probar scripts con un servidor localhost, tengo que evitar que urllib use el proxy.
ru: В моем случае мне приходится использовать прокси для доступа в Интернет на работе. Если вы попытаетесь получить URL-адреса *localhost* через этот прокси, он их заблокирует. IE настроен на использование прокси, который подхватывает urllib. Чтобы протестировать сценарии на локальном сервере, мне нужно запретить urllib использовать прокси.
