Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.1.po
Languages: pt_pt, ru, sv

source: The :mod:`ftplib` module now defaults to retrieving files in passive mode, because passive mode is more likely to work from behind a firewall. This request came from the Debian bug tracking system, since other Debian packages use :mod:`ftplib` to retrieve files and then don't work from behind a firewall. It's deemed unlikely that this will cause problems for anyone, because Netscape defaults to passive mode and few people complain, but if passive mode is unsuitable for your application or network setup, call ``set_pasv(0)`` on FTP objects to disable passive mode.
pt_pt: O módulo :mod:`ftplib` agora usa por predefinição o modo passivo para recuperar ficheiros, pois o modo passivo é mais provável de funcionar a partir de trás de uma *firewall*. Este pedido veio do sistema de acompanhamento de *bugs* do Debian, uma vez que outros pacotes Debian usam o :mod:`ftplib` para recuperar ficheiros e depois não funcionam a partir de trás de uma *firewall*. Considera-se improvável que isto cause problemas a alguém, pois o Netscape usa o modo passivo por predefinição e poucas pessoas se queixam, mas se o modo passivo não for adequado para a sua aplicação ou configuração de rede, chame ``set_pasv(0)`` em objetos FTP para desativar o modo passivo.
ru: Модуль :mod:`ftplib` теперь по умолчанию извлекает файлы в пассивном режиме, поскольку пассивный режим с большей вероятностью будет работать из-за брандмауэра. Этот запрос поступил от системы отслеживания ошибок Debian, поскольку другие пакеты Debian используют :mod:`ftplib` для получения файлов, а затем не работают из-за брандмауэра. Маловероятно, что это вызовет проблемы у кого-либо, поскольку Netscape по умолчанию использует пассивный режим, и мало кто жалуется, но если пассивный режим не подходит для вашего приложения или настройки сети, вызовите ``set_pasv(0)`` на объектах FTP, чтобы отключить пассивный режим. режим.
sv: Modulen :mod:`ftplib` har nu som standard att hämta filer i passivt läge, eftersom det är mer sannolikt att passivt läge fungerar bakom en brandvägg. Denna begäran kom från Debians buggspårningssystem, eftersom andra Debian-paket använder :mod:`ftplib` för att hämta filer och sedan inte fungerar bakom en brandvägg. Det anses osannolikt att detta kommer att orsaka problem för någon, eftersom Netscape använder passivt läge som standard och få människor klagar, men om passivt läge inte passar för din applikation eller nätverksinställning, anropa ``set_pasv(0)`` på FTP-objekt för att inaktivera passivt läge.

source: Support for raw socket access has been added to the :mod:`socket` module, contributed by Grant Edwards.
pt_pt: Foi adicionado suporte para acesso a *sockets* em modo bruto ao módulo :mod:`socket`, contribuído por Grant Edwards.
ru: Поддержка доступа к необработанным сокетам была добавлена ​​в модуль :mod:`socket`, предоставленный Грантом Эдвардсом.
sv: Stöd för rå socket-åtkomst har lagts till i modulen :mod:`socket`, med bidrag från Grant Edwards.

source: The :mod:`pstats` module now contains a simple interactive statistics browser for displaying timing profiles for Python programs, invoked when the module is run as a script. Contributed by Eric S. Raymond.
pt_pt: O módulo :mod:`pstats` agora contém um navegador interativo simples de estatísticas para apresentar perfis de temporização de programas Python, invocado quando o módulo é executado como um script. Contribuído por Eric S. Raymond.
ru: Модуль :mod:`pstats` теперь содержит простой интерактивный браузер статистики для отображения временных профилей для программ Python, вызываемый при запуске модуля как скрипта. Предоставлено Эриком С. Рэймондом.
sv: Modulen :mod:`pstats` innehåller nu en enkel interaktiv statistikbläddrare för visning av tidsprofiler för Python-program, som startas när modulen körs som ett skript. Bidrag från Eric S. Raymond.

source: A new implementation-dependent function, ``sys._getframe([depth])``, has been added to return a given frame object from the current call stack. :func:`sys._getframe` returns the frame at the top of the call stack; if the optional integer argument *depth* is supplied, the function returns the frame that is *depth* calls below the top of the stack. For example, ``sys._getframe(1)`` returns the caller's frame object.
pt_pt: Foi adicionada uma nova função dependente da implementação, ``sys._getframe([depth])``, para devolver um objeto *frame* específico da pilha de chamadas atual. :func:`sys._getframe` devolve o *frame* no topo da pilha de chamadas; se o argumento inteiro opcional *depth* for fornecido, a função devolve o *frame* que está *depth* chamadas abaixo do topo da pilha. Por exemplo, ``sys._getframe(1)`` devolve o objeto *frame* do chamador.
ru: Была добавлена ​​новая функция, зависящая от реализации, ``sys._getframe([глубина])`` для возврата заданного объекта кадра из текущего стека вызовов. :func:`sys._getframe` возвращает кадр наверху стека вызовов; если указан необязательный целочисленный аргумент *глубина*, функция возвращает кадр, который вызывает *глубина*, ниже вершины стека. Например, ``sys._getframe(1)`` возвращает объект фрейма вызывающего объекта.
sv: En ny implementationsberoende funktion, ``sys._getframe([depth])``, har lagts till för att returnera ett givet ramobjekt från den aktuella anropsstacken. :func:`sys._getframe` returnerar ramen högst upp i anropsstacken; om det valfria heltalsargumentet *depth* anges, returnerar funktionen den ram som ligger *depth* anrop under toppen av stacken. Exempel: ``sys._getframe(1)`` returnerar anroparens ramobjekt.

source: This function is only present in CPython, not in Jython or the .NET implementation. Use it for debugging, and resist the temptation to put it into production code.
pt_pt: Esta função só está presente no CPython, não no Jython ou na implementação .NET. Use-a para depuração e resista à tentação de a colocar em código de produção.
ru: Эта функция присутствует только в CPython, но не в Jython или реализации .NET. Используйте его для отладки и не поддавайтесь искушению внедрить его в рабочий код.
sv: Den här funktionen finns bara i CPython, inte i Jython eller .NET-implementeringen. Använd den för felsökning och motstå frestelsen att lägga in den i produktionskoden.

source: Other Changes and Fixes
pt_pt: Outras Alterações e Correções
ru: Другие изменения и исправления
sv: Övriga ändringar och korrigeringar

source: There were relatively few smaller changes made in Python 2.1 due to the shorter release cycle. A search through the CVS change logs turns up 117 patches applied, and 136 bugs fixed; both figures are likely to be underestimates. Some of the more notable changes are:
pt_pt: Devido ao ciclo de lançamento mais curto, foram feitas relativamente poucas alterações menores no Python 2.1. Uma pesquisa nos registos de alterações do CVS revela 117 *patches* aplicados e 136 *bugs* corrigidos; ambos os números são provavelmente subestimados. Algumas das alterações mais notáveis são:
ru: В Python 2.1 было внесено относительно немного мелких изменений из-за более короткого цикла выпуска. Поиск в журналах изменений CVS выявил 117 примененных исправлений и 136 исправленных ошибок; обе цифры, вероятно, занижены. Некоторые из наиболее заметных изменений:
sv: Det gjordes relativt få mindre ändringar i Python 2.1 på grund av den kortare utgivningscykeln. En sökning genom CVS-ändringsloggarna visar 117 tillämpade korrigeringar och 136 åtgärdade buggar; båda siffrorna är sannolikt underskattningar. Några av de mer anmärkningsvärda ändringarna är:

source: A specialized object allocator is now optionally available, that should be faster than the system :c:func:`malloc` and have less memory overhead. The allocator uses C's :c:func:`!malloc` function to get large pools of memory, and then fulfills smaller memory requests from these pools. It can be enabled by providing the :option:`!--with-pymalloc` option to the :program:`configure` script; see :file:`Objects/obmalloc.c` for the implementation details.
pt_pt: Um alocador de objetos especializado está agora opcionalmente disponível, que deve ser mais rápido do que o :c:func:`malloc` do sistema e ter menos sobrecarga de memória. O alocador usa a função :c:func:`!malloc` de C para obter grandes *pools* de memória e depois satisfaz pedidos de memória mais pequenos a partir destes *pools*. Pode ser ativado fornecendo a opção :option:`!--with-pymalloc` ao script :program:`configure`; consulte :file:`Objects/obmalloc.c` para detalhes de implementação.

source: Authors of C extension modules should test their code with the object allocator enabled, because some incorrect code may break, causing core dumps at runtime. There are a bunch of memory allocation functions in Python's C API that have previously been just aliases for the C library's :c:func:`malloc` and :c:func:`free`, meaning that if you accidentally called mismatched functions, the error wouldn't be noticeable. When the object allocator is enabled, these functions aren't aliases of :c:func:`!malloc` and :c:func:`!free` any more, and calling the wrong function to free memory will get you a core dump. For example, if memory was allocated using :c:macro:`PyMem_New`, it has to be freed using :c:func:`PyMem_Del`, not :c:func:`!free`. A few modules included with Python fell afoul of this and had to be fixed; doubtless there are more third-party modules that will have the same problem.
pt_pt: Os autores de módulos de extensão em C devem testar o seu código com o alocador de objetos ativado, pois algum código incorreto pode falhar, causando *core dumps* em tempo de execução. Existem várias funções de alocação de memória na API em C do Python que anteriormente eram apenas *aliases* para :c:func:`malloc` e :c:func:`free` da biblioteca C, o que significava que, se chamasse acidentalmente funções incompatíveis, o erro não seria notado. Quando o alocador de objetos está ativado, estas funções já não são *aliases* de :c:func:`!malloc` e :c:func:`!free`, e chamar a função errada para libertar memória resultará num *core dump*. Por exemplo, se a memória foi alocada usando :c:macro:`PyMem_New`, tem de ser libertada usando :c:func:`PyMem_Del`, não :c:func:`!free`. Alguns módulos incluídos com o Python tiveram problemas com isto e tiveram de ser corrigidos; sem dúvida, haverá mais módulos de terceiros com o mesmo problema.

source: The object allocator was contributed by Vladimir Marangozov.
pt_pt: O alocador de objetos foi contribuído por Vladimir Marangozov.
ru: Распределитель объектов был предоставлен Владимиром Марангозовым.
sv: Objektfördelaren har utvecklats av Vladimir Marangozov.

source: The speed of line-oriented file I/O has been improved because people often complain about its lack of speed, and because it's often been used as a naïve benchmark. The :meth:`readline` method of file objects has therefore been rewritten to be much faster. The exact amount of the speedup will vary from platform to platform depending on how slow the C library's :c:func:`!getc` was, but is around 66%, and potentially much faster on some particular operating systems. Tim Peters did much of the benchmarking and coding for this change, motivated by a discussion in comp.lang.python.
pt_pt: A velocidade de I/O de ficheiros orientada a linhas foi melhorada, pois as pessoas frequentemente se queixam da sua falta de velocidade e porque é muitas vezes usada como um *benchmark* ingénuo. O método :meth:`readline` dos objetos de ficheiro foi, portanto, reescrito para ser muito mais rápido. O aumento exato de velocidade variará de plataforma para plataforma, dependendo da lentidão da função :c:func:`!getc` da biblioteca C, mas é de cerca de 66%, e potencialmente muito mais rápido em alguns sistemas operativos específicos. Tim Peters realizou grande parte do *benchmarking* e da programação para esta alteração, motivado por uma discussão em comp.lang.python.

source: A new module and method for file objects was also added, contributed by Jeff Epler. The new method, :meth:`!xreadlines`, is similar to the existing :func:`!xrange` built-in. :func:`!xreadlines` returns an opaque sequence object that only supports being iterated over, reading a line on every iteration but not reading the entire file into memory as the existing :meth:`!readlines` method does. You'd use it like this::
pt_pt: Foi também adicionado um novo módulo e método para objetos de ficheiro, contribuído por Jeff Epler. O novo método, :meth:`!xreadlines`, é semelhante ao :func:`!xrange` integrado. :func:`!xreadlines` devolve um objeto de sequência opaco que só suporta iteração, lendo uma linha em cada iteração, mas não lendo o ficheiro inteiro para a memória, como faz o método :meth:`!readlines` existente. Usá-lo-ia assim::

source: for line in sys.stdin.xreadlines(): # ... do something for each line ... ...
pt_pt: for line in sys.stdin.xreadlines(): # ... fazer algo para cada linha ... ...

source: For a fuller discussion of the line I/O changes, see the python-dev summary for January 1--15, 2001 at https://mail.python.org/pipermail/python-dev/2001-January/.
pt_pt: Para uma discussão mais completa sobre as alterações de I/O de linhas, consulte o resumo do python-dev para 1 a 15 de janeiro de 2001 em https://mail.python.org/pipermail/python-dev/2001-January/.
ru: Более подробное обсуждение изменений линейного ввода-вывода см. в сводке python-dev за 1–15 января 2001 г. по адресу https://mail.python.org/pipermail/python-dev/2001-January/.
sv: För en mer utförlig diskussion om ändringarna av linje-I/O, se python-dev-sammandraget för 1--15 januari 2001 på https://mail.python.org/pipermail/python-dev/2001-January/.

source: A new method, :meth:`~dict.popitem`, was added to dictionaries to enable destructively iterating through the contents of a dictionary; this can be faster for large dictionaries because there's no need to construct a list containing all the keys or values. ``D.popitem()`` removes a random ``(key, value)`` pair from the dictionary ``D`` and returns it as a 2-tuple. This was implemented mostly by Tim Peters and Guido van Rossum, after a suggestion and preliminary patch by Moshe Zadka.
pt_pt: Foi adicionado um novo método, :meth:`~dict.popitem`, aos dicionários para permitir iterar de forma destrutiva pelos conteúdos de um dicionário; isto pode ser mais rápido para dicionários grandes, pois não é necessário construir uma lista com todas as chaves ou valores. ``D.popitem()`` remove um par ``(key, value)`` aleatório do dicionário ``D`` e devolve-o como um tuplo de 2 elementos. Isto foi implementado principalmente por Tim Peters e Guido van Rossum, após uma sugestão e um *patch* preliminar de Moshe Zadka.

source: Modules can now control which names are imported when ``from module import *`` is used, by defining an ``__all__`` attribute containing a list of names that will be imported. One common complaint is that if the module imports other modules such as :mod:`sys` or :mod:`string`, ``from module import *`` will add them to the importing module's namespace. To fix this, simply list the public names in ``__all__``::
pt_pt: Os módulos podem agora controlar quais os nomes importados quando é usado ``from module import *``, definindo um atributo ``__all__`` que contém uma lista de nomes a importar. Uma queixa comum é que, se o módulo importar outros módulos como :mod:`sys` ou :mod:`string`, ``from module import *`` adicionará esses módulos ao *namespace* do módulo importador. Para resolver isto, basta listar os nomes públicos em ``__all__``::
ru: Модули теперь могут контролировать, какие имена импортируются при использовании ``from Module import *``, путем определения атрибута ``__all__``, содержащего список имен, которые будут импортированы. Одна из распространенных жалоб заключается в том, что если модуль импортирует другие модули, такие как :mod:`sys` или :mod:`string`, ``from Module import *`` добавит их в пространство имен импортирующего модуля. Чтобы это исправить, просто перечислите общедоступные имена в ``__all__``::
sv: Moduler kan nu kontrollera vilka namn som importeras när ``from module import *`` används, genom att definiera ett ``__all__``-attribut som innehåller en lista med namn som ska importeras. Ett vanligt klagomål är att om modulen importerar andra moduler som :mod:`sys` eller :mod:`string`, kommer ``from module import *`` att lägga till dem i den importerande modulens namnrymd. För att åtgärda detta listar du helt enkelt de offentliga namnen i ``__all__``::

source: # List public names __all__ = ['Database', 'open']
pt_pt: # Lista de nomes públicos __all__ = ['Database', 'open']

source: A stricter version of this patch was first suggested and implemented by Ben Wolfson, but after some python-dev discussion, a weaker final version was checked in.
pt_pt: Uma versão mais restritiva deste *patch* foi inicialmente sugerida e implementada por Ben Wolfson, mas após alguma discussão na lista python-dev, uma versão final mais flexível foi integrada.
ru: Более строгая версия этого патча была впервые предложена и реализована Беном Вольфсоном, но после некоторого обсуждения с Python-разработчиками была проверена более слабая окончательная версия.
sv: En strängare version av denna patch föreslogs och implementerades först av Ben Wolfson, men efter en del diskussioner på Python-dev checkades en svagare slutlig version in.

source: Applying :func:`repr` to strings previously used octal escapes for non-printable characters; for example, a newline was ``'\012'``. This was a vestigial trace of Python's C ancestry, but today octal is of very little practical use. Ka-Ping Yee suggested using hex escapes instead of octal ones, and using the ``\n``, ``\t``, ``\r`` escapes for the appropriate characters, and implemented this new formatting.
pt_pt: A aplicação de :func:`repr` a strings usava anteriormente escapes octais para caracteres não imprimíveis; por exemplo, uma nova linha era ``'\012'``. Isto era um vestígio da ancestralidade em C do Python, mas hoje o octal tem muito pouca utilidade prática. Ka-Ping Yee sugeriu o uso de escapes hexadecimais em vez de octais, e o uso dos escapes ``\n``, ``\t``, ``\r`` para os caracteres apropriados, e implementou esta nova formatação.
ru: Применение :func:`repr` к строкам, ранее использовавшим восьмеричные escape-символы для непечатаемых символов; например, новая строка была ``'\012'``. Это был рудиментарный след предков Python C, но сегодня восьмеричная форма имеет очень мало практического применения. Ка-Пинг Йи предложил использовать шестнадцатеричные escape-последовательности вместо восьмеричных, а также использовать escape-последовательности ``\n``, ``\t``, ``\r`` для соответствующих символов и реализовал это новое форматирование.
sv: När :func:`repr` applicerades på strängar användes tidigare oktala escapes för icke-tryckbara tecken; till exempel var en ny rad ``'\012'``. Detta var en kvarleva från Pythons C-förfäder, men idag har oktal mycket liten praktisk användning. Ka-Ping Yee föreslog att man skulle använda hex-escapes i stället för oktal-escapes och använda escapen ``\n``, ``t``, ``r`` för lämpliga tecken, och implementerade denna nya formatering.

source: Syntax errors detected at compile-time can now raise exceptions containing the filename and line number of the error, a pleasant side effect of the compiler reorganization done by Jeremy Hylton.
pt_pt: Erros de sintaxe detetados em tempo de compilação podem agora gerar exceções que contêm o nome do ficheiro e o número da linha do erro, um efeito secundário agradável da reorganização do compilador feita por Jeremy Hylton.
ru: Синтаксические ошибки, обнаруженные во время компиляции, теперь могут вызывать исключения, содержащие имя файла и номер строки ошибки, что является приятным побочным эффектом реорганизации компилятора, проведенной Джереми Хилтоном.
sv: Syntaxfel som upptäcks vid kompilering kan nu ge upphov till undantag som innehåller filnamnet och radnumret för felet, en trevlig bieffekt av den omorganisation av kompilatorn som Jeremy Hylton har gjort.

source: C extensions which import other modules have been changed to use :c:func:`PyImport_ImportModule`, which means that they will use any import hooks that have been installed. This is also encouraged for third-party extensions that need to import some other module from C code.
pt_pt: As extensões em C que importam outros módulos foram alteradas para usar :c:func:`PyImport_ImportModule`, o que significa que usarão quaisquer *hooks* de importação que tenham sido instalados. Isto é também encorajado para extensões de terceiros que precisam de importar outros módulos a partir de código C.

source: The size of the Unicode character database was shrunk by another 340K thanks to Fredrik Lundh.
pt_pt: O tamanho da base de dados de caracteres Unicode foi reduzido em mais 340K graças a Fredrik Lundh.
ru: Размер базы данных символов Юникода был уменьшен еще на 340 КБ благодаря Фредрику Лунду.
sv: Storleken på Unicodes teckendatabas krympte med ytterligare 340K tack vare Fredrik Lundh.

source: Some new ports were contributed: MacOS X (by Steven Majewski), Cygwin (by Jason Tishler); RISCOS (by Dietmar Schwertberger); Unixware 7 (by Billy G. Allie).
pt_pt: Foram contribuídas algumas novas portagens: MacOS X (por Steven Majewski), Cygwin (por Jason Tishler), RISCOS (por Dietmar Schwertberger) e Unixware 7 (por Billy G. Allie).
ru: Были внесены некоторые новые порты: MacOS X (Стивен Маевски), Cygwin (Джейсон Тишлер); RISCOS (Дитмар Швертбергер); Unixware 7 (Билли Дж. Элли).
sv: Några nya portar har bidragit: MacOS X (av Steven Majewski), Cygwin (av Jason Tishler); RISCOS (av Dietmar Schwertberger); Unixware 7 (av Billy G. Allie).

source: And there's the usual list of minor bugfixes, minor memory leaks, docstring edits, and other tweaks, too lengthy to be worth itemizing; see the CVS logs for the full details if you want them.
pt_pt: E há a habitual lista de pequenas correções de *bugs*, pequenas fugas de memória, edições de *docstrings* e outros ajustes, demasiado longa para ser detalhada; consulte os registos do CVS para obter todos os detalhes, se os desejar.
ru: И есть обычный список мелких исправлений ошибок, незначительных утечек памяти, правок документации и других настроек, слишком длинный, чтобы его стоило перечислять; если хотите, посмотрите журналы CVS для получения полной информации.
sv: Dessutom finns den vanliga listan med mindre buggfixar, mindre minnesläckor, redigeringar av dokumentsträngar och andra justeringar, som är för långa för att vara värda att specificera; se CVS-loggarna för fullständiga detaljer om du vill ha dem.

source: Acknowledgements
pt_pt: Agradecimentos
ru: Подтверждение
sv: Tack till

source: The author would like to thank the following people for offering suggestions on various drafts of this article: Graeme Cross, David Goodger, Jay Graves, Michael Hudson, Marc-André Lemburg, Fredrik Lundh, Neil Schemenauer, Thomas Wouters.
pt_pt: O autor gostaria de agradecer às seguintes pessoas por terem oferecido sugestões sobre vários rascunhos deste artigo: Graeme Cross, David Goodger, Jay Graves, Michael Hudson, Marc-André Lemburg, Fredrik Lundh, Neil Schemenauer e Thomas Wouters.
ru: Автор хотел бы поблагодарить следующих людей за предложения по различным вариантам этой статьи: Грэма Кросса, Дэвида Гуджера, Джея Грейвса, Майкла Хадсона, Марка-Андре Лембурга, Фредрика Лунда, Нила Шеменауэра, Томаса Воутерса.
sv: Författaren vill tacka följande personer för att ha kommit med förslag på olika utkast till denna artikel: Graeme Cross, David Goodger, Jay Graves, Michael Hudson, Marc-André Lemburg, Fredrik Lundh, Neil Schemenauer, Thomas Wouters.
