Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.1.po
Languages: pt_pt, ru, sv

source: Extension types can now set the type flag ``Py_TPFLAGS_CHECKTYPES`` in their ``PyTypeObject`` structure to indicate that they support the new coercion model. In such extension types, the numeric slot functions can no longer assume that they'll be passed two arguments of the same type; instead they may be passed two arguments of differing types, and can then perform their own internal coercion. If the slot function is passed a type it can't handle, it can indicate the failure by returning a reference to the ``Py_NotImplemented`` singleton value. The numeric functions of the other type will then be tried, and perhaps they can handle the operation; if the other type also returns ``Py_NotImplemented``, then a :exc:`TypeError` will be raised. Numeric methods written in Python can also return ``Py_NotImplemented``, causing the interpreter to act as if the method did not exist (perhaps raising a :exc:`TypeError`, perhaps trying another object's numeric methods).
pt_pt: Os tipos de extensão podem agora definir a *flag* de tipo ``Py_TPFLAGS_CHECKTYPES`` na sua estrutura ``PyTypeObject`` para indicar que suportam o novo modelo de coerção. Nestes tipos de extensão, as funções de *slot* numéricas já não podem assumir que receberão dois argumentos do mesmo tipo; em vez disso, podem receber dois argumentos de tipos diferentes e podem então realizar a sua própria coerção interna. Se a função de *slot* receber um tipo que não consiga tratar, pode indicar a falha ao devolver uma referência ao valor *singleton* ``Py_NotImplemented``. As funções numéricas do outro tipo serão então tentadas, e talvez consigam tratar a operação; se o outro tipo também devolver ``Py_NotImplemented``, será gerada uma exceção :exc:`TypeError`. Métodos numéricos escritos em Python também podem devolver ``Py_NotImplemented``, fazendo com que o interpretador aja como se o método não existisse (talvez gerando uma exceção :exc:`TypeError`, ou tentando os métodos numéricos de outro objeto).
ru: Типы расширений теперь могут устанавливать флаг типа Py_TPFLAGS_CHECKTYPES в своей структуре PyTypeObject, чтобы указать, что они поддерживают новую модель приведения. В таких типах расширения функции числовых слотов больше не могут предполагать, что им будут переданы два аргумента одного и того же типа; вместо этого им могут быть переданы два аргумента разных типов, а затем они могут выполнить собственное внутреннее приведение. Если функции slot передается тип, который она не может обработать, она может указать на ошибку, вернув ссылку на одноэлементное значение ``Py_NotImplemented``. Затем будут опробованы числовые функции другого типа, и, возможно, они смогут справиться с операцией; если другой тип также возвращает Py_NotImplemented, то будет выдано :exc:`TypeError`. Числовые методы, написанные на Python, также могут возвращать Py_NotImplemented, заставляя интерпретатор действовать так, как будто метод не существует (возможно, вызывая :exc:`TypeError`, возможно, пробуя числовые методы другого объекта).
sv: Tilläggstyper kan nu ställa in typflaggan ``Py_TPFLAGS_CHECKTYPES`` i sin ``PyTypeObject``-struktur för att ange att de stöder den nya coercion-modellen. I sådana tilläggstyper kan de numeriska slotfunktionerna inte längre anta att de kommer att få två argument av samma typ; istället kan de få två argument av olika typer och kan då utföra sin egen interna kooperation. Om slot-funktionen får en typ som den inte kan hantera kan den ange att den misslyckats genom att returnera en referens till singleton-värdet ``Py_NotImplemented``. De numeriska funktionerna för den andra typen kommer då att provas, och kanske kan de hantera operationen; om den andra typen också returnerar ``Py_NotImplemented``, kommer ett :exc:`TypeError` att uppstå. Numeriska metoder skrivna i Python kan också returnera ``Py_NotImplemented``, vilket gör att tolken agerar som om metoden inte existerade (kanske ger ett :exc:`TypeError`, kanske provar ett annat objekts numeriska metoder).

source: :pep:`208` - Reworking the Coercion Model
pt_pt: :pep:`208` - Reformulação do Modelo de Coerção
ru: :pep:`208` - Переработка модели принуждения
sv: :pep:`208` - Omarbetning av tvångsmodellen

source: Written and implemented by Neil Schemenauer, heavily based upon earlier work by Marc-André Lemburg. Read this to understand the fine points of how numeric operations will now be processed at the C level.
pt_pt: Escrito e implementado por Neil Schemenauer, baseado em trabalho anterior de Marc-André Lemburg. Leia isto para compreender os pormenores de como as operações numéricas serão agora processadas ao nível de C.
ru: Написано и реализовано Нилом Шеменауэром на основе более ранних работ Марка-Андре Лембурга. Прочтите это, чтобы понять тонкости того, как числовые операции теперь будут обрабатываться на уровне C.
sv: Skriven och implementerad av Neil Schemenauer, starkt baserad på tidigare arbete av Marc-André Lemburg. Läs detta för att förstå detaljerna i hur numeriska operationer nu kommer att behandlas på C-nivå.

source: PEP 241: Metadata in Python Packages
pt_pt: PEP 241: Metadados em Pacotes Python
ru: PEP 241: Метаданные в пакетах Python
sv: PEP 241: Metadata i Python-paket

source: A common complaint from Python users is that there's no single catalog of all the Python modules in existence. T. Middleton's Vaults of Parnassus at ``www.vex.net/parnassus/`` (retired in February 2009, `available in the Internet Archive Wayback Machine <https://web.archive.org/web/20090130140102/http://www.vex.net/parnassus/>`_) was the largest catalog of Python modules, but registering software at the Vaults is optional, and many people did not bother.
pt_pt: Uma queixa comum dos utilizadores do Python é a inexistência de um catálogo único de todos os módulos Python existentes. O *Vaults of Parnassus* de T. Middleton em ``www.vex.net/parnassus/`` (descontinuado em fevereiro de 2009, `disponível no `Internet Archive Wayback Machine <https://web.archive.org/web/20090130140102/http://www.vex.net/parnassus/>`_)era o maior catálogo de módulos Python, mas o registo de software nos *Vaults* era opcional, e muitas pessoas não se davam ao trabalho.
ru: Пользователи Python часто жалуются на то, что не существует единого каталога всех существующих модулей Python. Хранилища Парнаса Т. Миддлтона на сайте ``www.vex.net/parnassus/`` (выход из эксплуатации в феврале 2009 г., `доступен в Интернет-архиве Wayback Machine <https://web.archive.org/web/20090130140102/http: //www.vex.net/parnassus/>`_) был крупнейшим каталогом модулей Python, но регистрация программного обеспечения в Хранилищах необязательна, и многие люди не заморачивались.
sv: Ett vanligt klagomål från Python-användare är att det inte finns någon enda katalog över alla Python-moduler som finns. T. Middletons Vaults of Parnassus på ``www.vex.net/parnassus/`` (pensionerad i februari 2009, `available in the Internet Archive Wayback Machine <https://web.archive.org/web/20090130140102/http://www.vex.net/parnassus/>`_) var den största katalogen över Python-moduler, men det är frivilligt att registrera programvara på Vaults och många brydde sig inte om det.

source: As a first small step toward fixing the problem, Python software packaged using the Distutils :command:`sdist` command will include a file named :file:`PKG-INFO` containing information about the package such as its name, version, and author (metadata, in cataloguing terminology). :pep:`241` contains the full list of fields that can be present in the :file:`PKG-INFO` file. As people began to package their software using Python 2.1, more and more packages will include metadata, making it possible to build automated cataloguing systems and experiment with them. With the result experience, perhaps it'll be possible to design a really good catalog and then build support for it into Python 2.2. For example, the Distutils :command:`sdist` and :command:`bdist_\*` commands could support an ``upload`` option that would automatically upload your package to a catalog server.
pt_pt: Como primeiro pequeno passo para resolver o problema, o software Python empacotado usando o comando Distutils :command:`sdist` incluirá um ficheiro chamado :file:`PKG-INFO` contendo informações sobre o pacote, como o seu nome, versão e autor (metadados, em terminologia de catalogação). O :pep:`241` contém a lista completa de campos que podem estar presentes no ficheiro :file:`PKG-INFO`. À medida que as pessoas começarem a empacotar o seu software usando o Python 2.1, mais pacotes incluirão metadados, tornando possível construir sistemas de catalogação automatizados e experimentá-los. Com a experiência resultante, talvez seja possível projetar um catálogo realmente bom e depois construir suporte para ele no Python 2.2. Por exemplo, os comandos Distutils :command:`sdist` e :command:`bdist_\*` poderiam suportar uma opção ``upload`` que enviaria automaticamente o seu pacote para um servidor de catálogo.
ru: В качестве первого небольшого шага к решению проблемы программное обеспечение Python, упакованное с помощью команды Distutils :command:`sdist`, будет включать файл с именем :file:`PKG-INFO`, содержащий информацию о пакете, такую ​​как его имя, версия и автор. (метаданные, в терминологии каталогизации). :pep:`241` содержит полный список полей, которые могут присутствовать в файле :file:`PKG-INFO`. Когда люди начали упаковывать свое программное обеспечение с использованием Python 2.1, все больше и больше пакетов будут включать метаданные, что позволит создавать автоматизированные системы каталогизации и экспериментировать с ними. Благодаря полученному опыту, возможно, появится возможность разработать действительно хороший каталог, а затем включить его поддержку в Python 2.2. Например, команды Distutils :command:`sdist` и :command:`bdist_\*` могут поддерживать опцию ``upload``, которая автоматически загружает ваш пакет на сервер каталога.
sv: Som ett första litet steg mot att lösa problemet kommer Python-programvara som paketeras med Distutils :command:`sdist`-kommando att inkludera en fil med namnet :file:`PKG-INFO` som innehåller information om paketet, till exempel dess namn, version och författare (metadata, i katalogiseringsterminologi). :pep:`241` innehåller den fullständiga listan över fält som kan finnas i :file:`PKG-INFO`-filen. När människor börjar paketera sin programvara med Python 2.1 kommer fler och fler paket att innehålla metadata, vilket gör det möjligt att bygga automatiserade katalogiseringssystem och experimentera med dem. Med erfarenhet av resultatet kanske det blir möjligt att utforma en riktigt bra katalog och sedan bygga in stöd för den i Python 2.2. Till exempel skulle Distutils :command:`sdist` och :command:`bdist_\*` kunna stödja ett ``upload``-alternativ som automatiskt laddar upp ditt paket till en katalogserver.

source: You can start creating packages containing :file:`PKG-INFO` even if you're not using Python 2.1, since a new release of the Distutils will be made for users of earlier Python versions. Version 1.0.2 of the Distutils includes the changes described in :pep:`241`, as well as various bugfixes and enhancements. It will be available from the Distutils SIG at https://www.python.org/community/sigs/current/distutils-sig/.
pt_pt: Pode começar a criar pacotes contendo :file:`PKG-INFO` mesmo que não esteja a usar o Python 2.1, pois uma nova versão do Distutils será lançada para utilizadores de versões anteriores do Python. A versão 1.0.2 do Distutils inclui as alterações descritas no :pep:`241`, bem como várias correções de *bugs* e melhorias. Estará disponível no grupo de interesse especial (SIG) do Distutils em https://www.python.org/community/sigs/current/distutils-sig/.
ru: Вы можете начать создавать пакеты, содержащие :file:`PKG-INFO`, даже если вы не используете Python 2.1, поскольку новый выпуск Distutils будет создан для пользователей более ранних версий Python. Версия 1.0.2 Distutils включает изменения, описанные в :pep:`241`, а также различные исправления и улучшения. Он будет доступен на Distutils SIG по адресу https://www.python.org/community/sigs/current/distutils-sig/.
sv: Du kan börja skapa paket som innehåller :file:`PKG-INFO` även om du inte använder Python 2.1, eftersom en ny version av Distutils kommer att göras för användare av tidigare Python-versioner. Version 1.0.2 av Distutils innehåller de ändringar som beskrivs i :pep:`241`, samt diverse buggfixar och förbättringar. Den kommer att finnas tillgänglig från Distutils SIG på https://www.python.org/community/sigs/current/distutils-sig/.

source: :pep:`241` - Metadata for Python Software Packages
pt_pt: :pep:`241` - Metadados para Pacotes de Software Python
ru: :pep:`241` — Метаданные для пакетов программного обеспечения Python
sv: :pep:`241` - Metadata för Python-programvarupaket

source: :pep:`243` - Module Repository Upload Mechanism
pt_pt: :pep:`243` - Mecanismo de Envio de Módulos para Repositório
ru: :pep:`243` - Механизм загрузки репозитория модулей
sv: :pep:`243` - Uppladdningsmekanism för modulförvar

source: Written by Sean Reifschneider, this draft PEP describes a proposed mechanism for uploading Python packages to a central server.
pt_pt: Escrito por Sean Reifschneider, este rascunho de PEP descreve um mecanismo proposto para enviar pacotes Python para um servidor central.
ru: Этот проект PEP, написанный Шоном Рейфшнайдером, описывает предлагаемый механизм загрузки пакетов Python на центральный сервер.
sv: Detta utkast till PEP är skrivet av Sean Reifschneider och beskriver en föreslagen mekanism för att ladda upp Python-paket till en central server.

source: New and Improved Modules
pt_pt: Módulos Novos e Melhorados
ru: Новые и улучшенные модули
sv: Nya och förbättrade moduler

source: Ka-Ping Yee contributed two new modules: :mod:`!inspect.py`, a module for getting information about live Python code, and :mod:`!pydoc.py`, a module for interactively converting docstrings to HTML or text. As a bonus, :file:`Tools/scripts/pydoc`, which is now automatically installed, uses :mod:`!pydoc.py` to display documentation given a Python module, package, or class name. For example, ``pydoc xml.dom`` displays the following::
pt_pt: Ka-Ping Yee contribuiu com dois novos módulos: :mod:`!inspect.py`, um módulo para obter informações sobre código Python em execução, e :mod:`!pydoc.py`, um módulo para converter interativamente *docstrings* em HTML ou texto. Como bónus, o :file:`Tools/scripts/pydoc`, que agora é instalado automaticamente, usa o :mod:`!pydoc.py` para apresentar a documentação de um módulo, pacote ou nome de classe Python. Por exemplo, ``pydoc xml.dom`` apresenta o seguinte::

source: Python Library Documentation: package xml.dom in xml NAME xml.dom - W3C Document Object Model implementation for Python. FILE /usr/local/lib/python2.1/xml/dom/__init__.pyc DESCRIPTION The Python mapping of the Document Object Model is documented in the Python Library Reference in the section on the xml.dom package. This package contains the following modules: ...
pt_pt: Documentação da Biblioteca Python: pacote xml.dom em xml NOME xml.dom - Implementação do Modelo de Objeto de Documento (DOM) W3C para Python. FICHEIRO /usr/local/lib/python2.1/xml/dom/__init__.pyc DESCRIÇÃO O mapeamento Python do Modelo de Objeto de Documento está documentado na Referência da Biblioteca Python, na secção sobre o pacote xml.dom. Este pacote contém os seguintes módulos: ...

source: :file:`pydoc` also includes a Tk-based interactive help browser. :file:`pydoc` quickly becomes addictive; try it out!
pt_pt: O :file:`pydoc` também inclui um navegador de ajuda interativo baseado em Tk. O :file:`pydoc` torna-se rapidamente viciante; experimente!
ru: :file:`pydoc` также включает браузер интерактивной справки на основе Tk. :file:`pydoc` быстро вызывает привыкание; попробуйте!
sv: :file:`pydoc` innehåller också en Tk-baserad interaktiv hjälpbläddrare. :file:`pydoc` blir snabbt beroendeframkallande; prova det!

source: Two different modules for unit testing were added to the standard library. The :mod:`doctest` module, contributed by Tim Peters, provides a testing framework based on running embedded examples in docstrings and comparing the results against the expected output. PyUnit, contributed by Steve Purcell, is a unit testing framework inspired by JUnit, which was in turn an adaptation of Kent Beck's Smalltalk testing framework. See https://pyunit.sourceforge.net/ for more information about PyUnit.
pt_pt: Dois módulos diferentes para testes unitários foram adicionados à biblioteca padrão. O módulo :mod:`doctest`, contribuído por Tim Peters, fornece um *framework* de teste baseado na execução de exemplos incorporados em *docstrings* e na comparação dos resultados com a saída esperada. O PyUnit, contribuído por Steve Purcell, é um *framework* de testes unitários inspirado no JUnit, que por sua vez foi uma adaptação do *framework* de testes Smalltalk de Kent Beck. Consulte https://pyunit.sourceforge.net/ para mais informações sobre o PyUnit.

source: The :mod:`difflib` module contains a class, :class:`~difflib.SequenceMatcher`, which compares two sequences and computes the changes required to transform one sequence into the other. For example, this module can be used to write a tool similar to the Unix :program:`diff` program, and in fact the sample program :file:`Tools/scripts/ndiff.py` demonstrates how to write such a script.
pt_pt: O módulo :mod:`difflib` contém uma classe, :class:`~difflib.SequenceMatcher`, que compara duas sequências e calcula as alterações necessárias para transformar uma sequência noutra. Por exemplo, este módulo pode ser usado para escrever uma ferramenta semelhante ao programa Unix :program:`diff`, e de facto o programa de exemplo :file:`Tools/scripts/ndiff.py` demonstra como escrever um script desses.

source: :mod:`curses.panel`, a wrapper for the panel library, part of ncurses and of SYSV curses, was contributed by Thomas Gellekum. The panel library provides windows with the additional feature of depth. Windows can be moved higher or lower in the depth ordering, and the panel library figures out where panels overlap and which sections are visible.
pt_pt: O módulo :mod:`curses.panel`, um *wrapper* para a biblioteca *panel*, parte do ncurses e do SYSV curses, foi contribuído por Thomas Gellekum. A biblioteca *panel* fornece janelas com a funcionalidade adicional de profundidade. As janelas podem ser movidas para cima ou para baixo na ordenação de profundidade, e a biblioteca *panel* determina onde os painéis se sobrepõem e quais as secções visíveis.
ru: :mod:`curses.panel`, оболочка для библиотеки панелей, входящая в состав ncurses и SYSV Curses, была предоставлена ​​Томасом Геллекумом. Библиотека панелей предоставляет окнам дополнительную функцию глубины. Окна можно перемещать выше или ниже по глубине, а библиотека панелей определяет, где панели перекрываются и какие разделы видны.
sv: :mod:`curses.panel`, en omslagslösning för panelbiblioteket, en del av ncurses och av SYSV curses, har skrivits av Thomas Gellekum. Panelbiblioteket ger fönster den extra egenskapen att de är djupa. Fönster kan flyttas högre eller lägre i djupordningen, och panelbiblioteket räknar ut var paneler överlappar varandra och vilka sektioner som är synliga.

source: The PyXML package has gone through a few releases since Python 2.0, and Python 2.1 includes an updated version of the :mod:`xml` package. Some of the noteworthy changes include support for Expat 1.2 and later versions, the ability for Expat parsers to handle files in any encoding supported by Python, and various bugfixes for SAX, DOM, and the :mod:`!minidom` module.
pt_pt: O pacote PyXML passou por algumas versões desde o Python 2.0, e o Python 2.1 inclui uma versão atualizada do pacote :mod:`xml`. Algumas das alterações notáveis incluem suporte para o Expat 1.2 e versões posteriores, a capacidade dos analisadores Expat lidarem com ficheiros em qualquer codificação suportada pelo Python, e várias correções de *bugs* para SAX, DOM e o módulo :mod:`!minidom`.

source: Ping also contributed another hook for handling uncaught exceptions. :func:`sys.excepthook` can be set to a callable object. When an exception isn't caught by any :keyword:`try`...\ :keyword:`except` blocks, the exception will be passed to :func:`sys.excepthook`, which can then do whatever it likes. At the Ninth Python Conference, Ping demonstrated an application for this hook: printing an extended traceback that not only lists the stack frames, but also lists the function arguments and the local variables for each frame.
pt_pt: Ping também contribuiu com outro *hook* para lidar com exceções não capturadas. :func:`sys.excepthook` pode ser definido como um objeto chamável. Quando uma exceção não é capturada por nenhum bloco :keyword:`try`... :keyword:`except`, a exceção será passada para :func:`sys.excepthook`, que pode então fazer o que entender. Na Nona Conferência Python, Ping demonstrou uma aplicação para este *hook*: imprimir um *traceback* estendido que não só lista os *frames* da pilha, como também lista os argumentos da função e as variáveis locais para cada *frame*.
ru: Ping также добавил еще один инструмент для обработки неперехваченных исключений. :func:`sys.excepthook` может быть установлен для вызываемого объекта. Если исключение не перехватывается ни одним из блоков :keyword:`try`...\ :keyword:`кроме`, исключение будет передано в :func:`sys.excepthook`, который затем сможет делать все, что пожелает. На Девятой конференции Python Ping продемонстрировал применение этого крючка: печать расширенной обратной трассировки, в которой не только перечисляются кадры стека, но также перечисляются аргументы функции и локальные переменные для каждого кадра.
sv: Ping bidrog också med en annan krok för att hantera undantag som inte fångats upp. :func:`sys.excepthook` kan sättas till ett anropbart objekt. När ett undantag inte fångas upp av något :keyword:`try`...\ :keyword:`except` block, kommer undantaget att skickas till :func:`sys.excepthook`, som sedan kan göra vad den vill. På Ninth Python Conference demonstrerade Ping en tillämpning av denna krok: att skriva ut en utökad traceback som inte bara listar stackrutorna utan även funktionsargumenten och de lokala variablerna för varje ruta.

source: Various functions in the :mod:`time` module, such as :func:`~time.asctime` and :func:`~time.localtime`, require a floating-point argument containing the time in seconds since the epoch. The most common use of these functions is to work with the current time, so the floating-point argument has been made optional; when a value isn't provided, the current time will be used. For example, log file entries usually need a string containing the current time; in Python 2.1, ``time.asctime()`` can be used, instead of the lengthier ``time.asctime(time.localtime(time.time()))`` that was previously required.
pt_pt: Várias funções no módulo :mod:`time`, como :func:`~time.asctime` e :func:`~time.localtime`, requerem um argumento de ponto flutuante contendo o tempo em segundos desde a época. O uso mais comum destas funções é trabalhar com a hora atual, pelo que o argumento de ponto flutuante foi tornado opcional; quando um valor não é fornecido, a hora atual será usada. Por exemplo, as entradas em ficheiros de registo (*log*) geralmente precisam de uma string contendo a hora atual; no Python 2.1, pode ser usado ``time.asctime()``, em vez do mais longo ``time.asctime(time.localtime(time.time()))`` que era anteriormente necessário.

source: This change was proposed and implemented by Thomas Wouters.
pt_pt: Esta alteração foi proposta e implementada por Thomas Wouters.
ru: Это изменение было предложено и реализовано Томасом Воутерсом.
sv: Denna ändring föreslogs och genomfördes av Thomas Wouters.
