Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.1.po
Languages: pt_pt, ru, sv

source: Instead of having to edit the :file:`Modules/Setup` file in order to enable modules, a :file:`setup.py` script in the top directory of the Python source distribution is run at build time, and attempts to discover which modules can be enabled by examining the modules and header files on the system. If a module is configured in :file:`Modules/Setup`, the :file:`setup.py` script won't attempt to compile that module and will defer to the :file:`Modules/Setup` file's contents. This provides a way to specific any strange command-line flags or libraries that are required for a specific platform.
pt_pt: Em vez de ter de editar o ficheiro :file:`Modules/Setup` para ativar módulos, um script :file:`setup.py` no diretório principal da distribuição do código-fonte do Python é executado em tempo de compilação e tenta descobrir quais os módulos que podem ser ativados, examinando os módulos e ficheiros de cabeçalho no sistema. Se um módulo estiver configurado em :file:`Modules/Setup`, o script :file:`setup.py` não tentará compilar esse módulo e deferirá para o conteúdo do ficheiro :file:`Modules/Setup`. Isto permite especificar quaisquer *flags* estranhas de linha de comandos ou bibliotecas necessárias para uma plataforma específica.
ru: Вместо редактирования файла :file:`Modules/Setup` для включения модулей, скрипт :file:`setup.py` в верхнем каталоге дистрибутива исходного кода Python запускается во время сборки и пытается обнаружить какие модули можно включить, проверив модули и заголовочные файлы в системе. Если модуль настроен в :file:`Modules/Setup`, скрипт :file:`setup.py` не будет пытаться скомпилировать этот модуль и будет полагаться на содержимое файла :file:`Modules/Setup`. Это дает возможность указать любые странные флаги командной строки или библиотеки, необходимые для конкретной платформы.
sv: Istället för att behöva redigera filen :file:`Modules/Setup` för att aktivera moduler, körs skriptet :file:`setup.py` i den översta katalogen i Python-källdistributionen vid byggtiden och försöker upptäcka vilka moduler som kan aktiveras genom att undersöka modulerna och header-filerna på systemet. Om en modul är konfigurerad i :file:`Modules/Setup`, kommer skriptet :file:`setup.py` inte att försöka kompilera den modulen utan kommer att hänvisa till innehållet i :file:`Modules/Setup`. Detta ger ett sätt att specificera eventuella konstiga kommandoradsflaggor eller bibliotek som krävs för en viss plattform.

source: In another far-reaching change to the build mechanism, Neil Schemenauer restructured things so Python now uses a single makefile that isn't recursive, instead of makefiles in the top directory and in each of the :file:`Python/`, :file:`Parser/`, :file:`Objects/`, and :file:`Modules/` subdirectories. This makes building Python faster and also makes hacking the Makefiles clearer and simpler.
pt_pt: Noutra alteração abrangente ao mecanismo de compilação, Neil Schemenauer reestruturou as coisas para que o Python passe a usar um único ficheiro *makefile* não recursivo, em vez de *makefiles* no diretório principal e em cada um dos subdiretórios :file:`Python/`, :file:`Parser/`, :file:`Objects/` e :file:`Modules/`. Isto torna a compilação do Python mais rápida e também torna a edição dos *Makefiles* mais clara e simples.
ru: Еще одно далеко идущее изменение в механизме сборки: Нил Шеменауэр реструктурировал все, так что Python теперь использует один нерекурсивный make-файл вместо make-файлов в верхнем каталоге и в каждом из :file:`Python/`, :file. Подкаталоги :`Parser/`, :file:`Objects/` и :file:`Modules/`. Это ускоряет сборку Python, а также делает взлом Makefiles более понятным и простым.
sv: I en annan långtgående förändring av byggmekanismen har Neil Schemenauer omstrukturerat saker så att Python nu använder en enda makefile som inte är rekursiv, istället för makefiles i toppkatalogen och i var och en av underkatalogerna :file:`Python/`, :file:`Parser/`, :file:`Objects/` och :file:`Modules/`. Detta gör det snabbare att bygga Python och gör det också tydligare och enklare att hacka Makefiles.

source: :pep:`229` - Using Distutils to Build Python
pt_pt: :pep:`229` - Utilização do Distutils para Compilar o Python
ru: :pep:`229` - Использование Distutils для сборки Python
sv: :pep:`229` - Använda Distutils för att bygga Python

source: Written and implemented by A.M. Kuchling.
pt_pt: Escrito e implementado por A.M. Kuchling.
ru: Написано и реализовано А. М. Кучлингом.
sv: Skriven och implementerad av A.M. Kuchling.

source: PEP 205: Weak References
pt_pt: PEP 205: Referências Fracas
ru: PEP 205: Слабые ссылки
sv: PEP 205: Svaga referenser

source: Weak references, available through the :mod:`weakref` module, are a minor but useful new data type in the Python programmer's toolbox.
pt_pt: As referências fracas, disponíveis através do módulo :mod:`weakref`, são um novo tipo de dados menor, mas útil, na caixa de ferramentas do programador Python.
ru: Слабые ссылки, доступные через модуль :mod:`weakref`, представляют собой второстепенный, но полезный новый тип данных в наборе инструментов программиста Python.
sv: Svaga referenser, som är tillgängliga via modulen :mod:`weakref`, är en mindre men användbar ny datatyp i Python-programmerarens verktygslåda.

source: Storing a reference to an object (say, in a dictionary or a list) has the side effect of keeping that object alive forever. There are a few specific cases where this behaviour is undesirable, object caches being the most common one, and another being circular references in data structures such as trees.
pt_pt: Armazenar uma referência a um objeto (por exemplo, num dicionário ou numa lista) tem o efeito colateral de manter esse objeto vivo para sempre. Existem alguns casos específicos em que este comportamento é indesejável, sendo as caches de objetos o caso mais comum, e outro são as referências circulares em estruturas de dados como árvores.
ru: Сохранение ссылки на объект (скажем, в словаре или списке) имеет побочный эффект, заключающийся в сохранении жизни этого объекта навсегда. Есть несколько конкретных случаев, когда такое поведение нежелательно: наиболее распространенным из них являются кэши объектов, а другим — циклические ссылки в структурах данных, таких как деревья.
sv: Att lagra en referens till ett objekt (t.ex. i en ordbok eller en lista) har som bieffekt att objektet hålls vid liv för alltid. Det finns några specifika fall där detta beteende inte är önskvärt, objektcacher är det vanligaste, och ett annat är cirkulära referenser i datastrukturer som träd.

source: For example, consider a memoizing function that caches the results of another function ``f(x)`` by storing the function's argument and its result in a dictionary::
pt_pt: Por exemplo, considere uma função de memorização que guarda em cache os resultados de outra função ``f(x)`` armazenando o argumento da função e o seu resultado num dicionário::
ru: Например, рассмотрим функцию запоминания, которая кэширует результаты другой функции ``f(x)``, сохраняя аргумент функции и ее результат в словаре:
sv: Tänk till exempel på en memoiseringsfunktion som cachelagrar resultaten av en annan funktion ``f(x)`` genom att lagra funktionens argument och dess resultat i en ordbok::

source: _cache = {} def memoize(x): if _cache.has_key(x): return _cache[x] retval = f(x) # Cache the returned object _cache[x] = retval return retval
pt_pt: _cache = {} def memoize(x): if x in _cache: return _cache[x] retval = f(x) # Guarda o objeto devolvido em cache _cache[x] = retval return retval

source: This version works for simple things such as integers, but it has a side effect; the ``_cache`` dictionary holds a reference to the return values, so they'll never be deallocated until the Python process exits and cleans up. This isn't very noticeable for integers, but if :func:`!f` returns an object, or a data structure that takes up a lot of memory, this can be a problem.
pt_pt: Esta versão funciona para coisas simples como inteiros, mas tem um efeito colateral; o dicionário ``_cache`` mantém uma referência aos valores devolvidos, pelo que estes nunca serão libertados até que o processo Python termine e limpe a memória. Isto não é muito notório para inteiros, mas se :func:`!f` devolver um objeto, ou uma estrutura de dados que ocupe muita memória, isto pode tornar-se um problema.

source: Weak references provide a way to implement a cache that won't keep objects alive beyond their time. If an object is only accessible through weak references, the object will be deallocated and the weak references will now indicate that the object it referred to no longer exists. A weak reference to an object *obj* is created by calling ``wr = weakref.ref(obj)``. The object being referred to is returned by calling the weak reference as if it were a function: ``wr()``. It will return the referenced object, or ``None`` if the object no longer exists.
pt_pt: As referências fracas fornecem uma forma de implementar uma cache que não mantém objetos vivos além do seu tempo. Se um objeto só for acessível através de referências fracas, o objeto será libertado e as referências fracas indicarão que o objeto ao qual se referiam já não existe. Uma referência fraca a um objeto *obj* é criada chamando ``wr = weakref.ref(obj)``. O objeto referenciado é devolvido chamando a referência fraca como se fosse uma função: ``wr()``. Devolverá o objeto referenciado, ou ``None`` se o objeto já não existir.
ru: Слабые ссылки позволяют реализовать кеш, который не будет сохранять объекты живыми после истечения их срока действия. Если объект доступен только через слабые ссылки, объект будет освобожден, и слабые ссылки теперь будут указывать, что объект, на который он ссылался, больше не существует. Слабая ссылка на объект *obj* создается путем вызова ``wr =weakref.ref(obj)``. Объект, на который делается ссылка, возвращается путем вызова слабой ссылки, как если бы это была функция: ``wr()``. Он вернет указанный объект или None, если объект больше не существует.
sv: Svaga referenser är ett sätt att implementera en cache som inte håller objekt vid liv längre än vad som är nödvändigt. Om ett objekt endast är tillgängligt via svaga referenser kommer objektet att avallokeras och de svaga referenserna kommer nu att indikera att objektet som det hänvisade till inte längre existerar. En svag referens till ett objekt *obj* skapas genom att anropa ``wr = weakref.ref(obj)``. Objektet som refereras till returneras genom att anropa den svaga referensen som om den vore en funktion: ``wr()``. Den returnerar det refererade objektet, eller ``None`` om objektet inte längre existerar.

source: This makes it possible to write a :func:`!memoize` function whose cache doesn't keep objects alive, by storing weak references in the cache. ::
pt_pt: Isto torna possível escrever uma função :func:`!memoize` cuja cache não mantém objetos vivos, armazenando referências fracas na cache. ::

source: _cache = {} def memoize(x): if _cache.has_key(x): obj = _cache[x]() # If weak reference object still exists, # return it if obj is not None: return obj retval = f(x) # Cache a weak reference _cache[x] = weakref.ref(retval) return retval
pt_pt: _cache = {} def memoize(x): if x in _cache: obj = _cache[x]() # Se o objeto da referência fraca ainda existir, # devolve-o if obj is not None: return obj retval = f(x) # Guarda uma referência fraca em cache _cache[x] = weakref.ref(retval) return retval

source: The :mod:`weakref` module also allows creating proxy objects which behave like weak references --- an object referenced only by proxy objects is deallocated -- but instead of requiring an explicit call to retrieve the object, the proxy transparently forwards all operations to the object as long as the object still exists. If the object is deallocated, attempting to use a proxy will cause a :exc:`!weakref.ReferenceError` exception to be raised. ::
pt_pt: O módulo :mod:`weakref` também permite criar objetos *proxy* que se comportam como referências fracas — um objeto referenciado apenas por objetos *proxy* é libertado — mas, em vez de exigir uma chamada explícita para recuperar o objeto, o *proxy* encaminha transparentemente todas as operações para o objeto enquanto este existir. Se o objeto for libertado, tentar usar um *proxy* irá gerar uma exceção :exc:`!weakref.ReferenceError`. ::

source: proxy = weakref.proxy(obj) proxy.attr # Equivalent to obj.attr proxy.meth() # Equivalent to obj.meth() del obj proxy.attr # raises weakref.ReferenceError
pt_pt: proxy = weakref.proxy(obj) proxy.attr # Equivalente a obj.attr proxy.meth() # Equivalente a obj.meth() del obj proxy.attr # gera weakref.ReferenceError

source: :pep:`205` - Weak References
pt_pt: :pep:`205` - Referências Fracas
ru: :pep:`205` - Слабые ссылки
sv: :pep:`205` - Svaga referenser

source: Written and implemented by Fred L. Drake, Jr.
pt_pt: Escrito e implementado por Fred L. Drake, Jr.
ru: Написано и реализовано Фредом Л. Дрейком-младшим.
sv: Skriven och implementerad av Fred L. Drake, Jr.

source: PEP 232: Function Attributes
pt_pt: PEP 232: Atributos de Funções
ru: PEP 232: Атрибуты функций
sv: PEP 232: Funktionsattribut

source: In Python 2.1, functions can now have arbitrary information attached to them. People were often using docstrings to hold information about functions and methods, because the :attr:`~function.__doc__` attribute was the only way of attaching any information to a function. For example, in the Zope web application server, functions are marked as safe for public access by having a docstring, and in John Aycock's SPARK parsing framework, docstrings hold parts of the BNF grammar to be parsed. This overloading is unfortunate, since docstrings are really intended to hold a function's documentation; for example, it means you can't properly document functions intended for private use in Zope.
pt_pt: No Python 2.1, as funções podem agora ter informações arbitrárias associadas. As pessoas usavam frequentemente *docstrings* para armazenar informações sobre funções e métodos, pois o atributo :attr:`~function.__doc__` era a única forma de associar qualquer informação a uma função. Por exemplo, no servidor de aplicações web Zope, as funções são marcadas como seguras para acesso público ao terem uma *docstring*, e no *framework* de parsing SPARK de John Aycock, as *docstrings* contêm partes da gramática BNF a ser analisada. Esta sobrecarga é infeliz, pois as *docstrings* são realmente destinadas a conter a documentação de uma função; por exemplo, significa que não é possível documentar adequadamente funções destinadas a uso privado no Zope.

source: Arbitrary attributes can now be set and retrieved on functions using the regular Python syntax::
pt_pt: Atributos arbitrários podem agora ser definidos e recuperados em funções usando a sintaxe Python normal::
ru: Произвольные атрибуты теперь можно устанавливать и получать в функциях, используя обычный синтаксис Python:
sv: Godtyckliga attribut kan nu ställas in och hämtas på funktioner med hjälp av den vanliga Python-syntaxen::

source: The dictionary containing attributes can be accessed as the function's :attr:`~function.__dict__`. Unlike the :attr:`~type.__dict__` attribute of class instances, in functions you can actually assign a new dictionary to :attr:`~function.__dict__`, though the new value is restricted to a regular Python dictionary; you *can't* be tricky and set it to a :class:`!UserDict` instance, or any other random object that behaves like a mapping.
pt_pt: O dicionário que contém os atributos pode ser acedido através do atributo :attr:`~function.__dict__` da função. Ao contrário do atributo :attr:`~type.__dict__` das instâncias de classe, nas funções é possível atribuir um novo dicionário a :attr:`~function.__dict__`, embora o novo valor esteja limitado a um dicionário Python normal; não é possível definir um objeto aleatório que se comporte como um mapeamento, como uma instância de :class:`!UserDict`.

source: :pep:`232` - Function Attributes
pt_pt: :pep:`232` - Atributos de Funções
ru: :pep:`232` - Атрибуты функций
sv: :pep:`232` - Funktionsattribut

source: Written and implemented by Barry Warsaw.
pt_pt: Escrito e implementado por Barry Warsaw.
ru: Написано и реализовано Барри Варшавой.
sv: Skriven och implementerad av Barry Warsaw.

source: PEP 235: Importing Modules on Case-Insensitive Platforms
pt_pt: PEP 235: Importação de Módulos em Plataformas *Case-Insensitive*
ru: PEP 235: Импорт модулей на платформах, нечувствительных к регистру
sv: PEP 235: Importera moduler på plattformar som är okänsliga för versaler

source: Some operating systems have filesystems that are case-insensitive, MacOS and Windows being the primary examples; on these systems, it's impossible to distinguish the filenames ``FILE.PY`` and ``file.py``, even though they do store the file's name in its original case (they're case-preserving, too).
pt_pt: Alguns sistemas operativos têm sistemas de ficheiros *case-insensitive*, sendo os principais exemplos o MacOS e o Windows; nestes sistemas, é impossível distinguir os nomes de ficheiros ``FILE.PY`` e ``file.py``, embora armazenem o nome do ficheiro na sua forma original (também preservam a capitalização).
ru: Некоторые операционные системы имеют файловые системы, нечувствительные к регистру, основными примерами являются MacOS и Windows; в этих системах невозможно различить имена файлов ``FILE.PY`` и ``file.py``, хотя они сохраняют имя файла в исходном регистре (они также сохраняют регистр).
sv: Vissa operativsystem har filsystem som är skiftlägesokänsliga, MacOS och Windows är de främsta exemplen; på dessa system är det omöjligt att skilja på filnamnen ``FILE.PY`` och ``file.py``, även om de lagrar filnamnet i dess ursprungliga skiftlägesform (de bevarar också skiftlägesformen).

source: In Python 2.1, the :keyword:`import` statement will work to simulate case-sensitivity on case-insensitive platforms. Python will now search for the first case-sensitive match by default, raising an :exc:`ImportError` if no such file is found, so ``import file`` will not import a module named ``FILE.PY``. Case-insensitive matching can be requested by setting the :envvar:`PYTHONCASEOK` environment variable before starting the Python interpreter.
pt_pt: No Python 2.1, a instrução :keyword:`import` irá simular sensibilidade a maiúsculas em plataformas *case-insensitive*. O Python irá agora procurar, por predefinição, a primeira correspondência *case-sensitive*, gerando um :exc:`ImportError` se nenhum ficheiro for encontrado, pelo que ``import file`` não importará um módulo chamado ``FILE.PY``. A correspondência *case-insensitive* pode ser solicitada definindo a variável de ambiente :envvar:`PYTHONCASEOK` antes de iniciar o interpretador Python.
ru: В Python 2.1 оператор :keyword:`import` будет работать для имитации чувствительности к регистру на нечувствительных к регистру платформах. Python теперь по умолчанию будет искать первое совпадение с учетом регистра, вызывая :exc:`ImportError`, если такой файл не найден, поэтому ``import file`` не будет импортировать модуль с именем ``FILE.PY``. Сопоставление без учета регистра можно запросить, установив переменную среды :envvar:`PYTHONCASEOK` перед запуском интерпретатора Python.
sv: I Python 2.1 kommer :keyword:`import` att fungera för att simulera skiftlägeskänslighet på plattformar som inte är skiftlägeskänsliga. Python kommer nu att söka efter den första skiftlägeskänsliga matchningen som standard och ge upphov till ett :exc:`ImportError` om ingen sådan fil hittas, så ``import file`` kommer inte att importera en modul med namnet ``FILE.PY``. Matchning utan skiftlägeskänslighet kan begäras genom att ställa in miljövariabeln :envvar:`PYTHONCASEOK` innan Python-tolken startas.

source: PEP 217: Interactive Display Hook
pt_pt: PEP 217: *Hook* de Apresentação Interativa
ru: PEP 217: Интерактивный дисплей
sv: PEP 217: Krok för interaktiv display

source: When using the Python interpreter interactively, the output of commands is displayed using the built-in :func:`repr` function. In Python 2.1, the variable :func:`sys.displayhook` can be set to a callable object which will be called instead of :func:`repr`. For example, you can set it to a special pretty-printing function::
pt_pt: Ao usar o interpretador Python interativamente, a saída dos comandos é apresentada usando a função integrada :func:`repr`. No Python 2.1, a variável :func:`sys.displayhook` pode ser definida como um objeto chamável que será invocado em vez de :func:`repr`. Por exemplo, pode defini-la como uma função de impressão bonita especial::
ru: При интерактивном использовании интерпретатора Python вывод команд отображается с помощью встроенной функции :func:`repr`. В Python 2.1 переменной :func:`sys.displayhook` можно присвоить вызываемый объект, который будет вызываться вместо :func:`repr`. Например, вы можете установить для него специальную функцию красивой печати:
sv: Vid interaktiv användning av Python-tolken visas kommandon med hjälp av den inbyggda funktionen :func:`repr`. I Python 2.1 kan variabeln :func:`sys.displayhook` ställas in på ett anropsbart objekt som kommer att anropas istället för :func:`repr`. Du kan till exempel ställa in den på en speciell funktion för snygga utskrifter::

source: >>> # Create a recursive data structure ... L = [1,2,3] >>> L.append(L) >>> L # Show Python's default output [1, 2, 3, [...]] >>> # Use pprint.pprint() as the display function ... import sys, pprint >>> sys.displayhook = pprint.pprint >>> L [1, 2, 3, <Recursion on list with id=135143996>] >>>
pt_pt: >>> # Criar uma estrutura de dados recursiva ... L = [1,2,3] >>> L.append(L) >>> L # Mostrar a saída predefinida do Python [1, 2, 3, [...]] >>> # Usar pprint.pprint() como função de apresentação ... import sys, pprint >>> sys.displayhook = pprint.pprint >>> L [1, 2, 3, <Recursão na lista com id=135143996>] >>>

source: :pep:`217` - Display Hook for Interactive Use
pt_pt: :pep:`217` - *Hook* de Apresentação para Uso Interativo
ru: :pep:`217` - Крючок для интерактивного использования
sv: :pep:`217` - Displaykrok för interaktiv användning

source: Written and implemented by Moshe Zadka.
pt_pt: Escrito e implementado por Moshe Zadka.
ru: Написано и реализовано Моше Задкой.
sv: Skrivet och implementerat av Moshe Zadka.

source: PEP 208: New Coercion Model
pt_pt: PEP 208: Novo Modelo de Coerção
ru: PEP 208: Новая модель принуждения
sv: PEP 208: Ny modell för tvångsmedel

source: How numeric coercion is done at the C level was significantly modified. This will only affect the authors of C extensions to Python, allowing them more flexibility in writing extension types that support numeric operations.
pt_pt: A forma como a coerção numérica é realizada ao nível de C foi significativamente modificada. Isto só afetará os autores de extensões em C para Python, permitindo-lhes mais flexibilidade na escrita de tipos de extensão que suportam operações numéricas.
ru: То, как осуществляется числовое приведение на уровне C, было значительно изменено. Это повлияет только на авторов расширений C для Python, предоставляя им большую гибкость при написании типов расширений, поддерживающих числовые операции.
sv: Hur numerisk coercion görs på C-nivå ändrades avsevärt. Detta kommer endast att påverka författarna av C-tillägg till Python, vilket ger dem mer flexibilitet när det gäller att skriva tilläggstyper som stöder numeriska operationer.
