Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.1.po
Languages: pt_pt, ru, sv

source: What's New in Python 2.1
pt_pt: Novidades do Python 2.1
ru: Что нового в Python 2.1
sv: Vad är nytt i Python 2.1

source: Author
pt_pt: Autor
ru: Автор
sv: Författare

source: Introduction
pt_pt: Introdução
ru: Введение
sv: Introduktion

source: This article explains the new features in Python 2.1. While there aren't as many changes in 2.1 as there were in Python 2.0, there are still some pleasant surprises in store. 2.1 is the first release to be steered through the use of Python Enhancement Proposals, or PEPs, so most of the sizable changes have accompanying PEPs that provide more complete documentation and a design rationale for the change. This article doesn't attempt to document the new features completely, but simply provides an overview of the new features for Python programmers. Refer to the Python 2.1 documentation, or to the specific PEP, for more details about any new feature that particularly interests you.
pt_pt: Este artigo explica as novas funcionalidades do Python 2.1. Embora não existam tantas alterações como no Python 2.0, ainda há algumas surpresas agradáveis. O Python 2.1 é a primeira versão desenvolvida com base em *Python Enhancement Proposals* (PEPs), pelo que a maioria das alterações significativas tem um PEP associado que fornece documentação completa e justificação de projeto. Este artigo não tenta documentar todas as novas funcionalidades, mas oferece uma visão geral para programadores Python. Para mais detalhes, consulte a documentação do Python 2.1 ou o PEP específico da funcionalidade que lhe interessa.
ru: В этой статье объясняются новые возможности Python 2.1. Хотя в версии 2.1 не так много изменений, как в Python 2.0, все же есть несколько приятных сюрпризов. 2.1 — это первый выпуск, в котором используются предложения по улучшению Python, или PEP, поэтому к большинству значительных изменений прилагаются PEP, которые предоставляют более полную документацию и обоснование изменений. В этой статье не делается попытка полностью документировать новые возможности, а просто представлен обзор новых возможностей для программистов Python. Обратитесь к документации Python 2.1 или к конкретному PEP для получения более подробной информации о любой новой функции, которая вас особенно интересует.
sv: Den här artikeln förklarar de nya funktionerna i Python 2.1. Även om det inte finns så många förändringar i 2.1 som det fanns i Python 2.0, finns det fortfarande några trevliga överraskningar i butiken. 2.1 är den första utgåvan som styrs genom användning av Python Enhancement Proposals, eller PEPs, så de flesta av de stora förändringarna har medföljande PEPs som ger mer fullständig dokumentation och en designgrund för förändringen. Den här artikeln försöker inte dokumentera de nya funktionerna fullständigt, utan ger helt enkelt en översikt över de nya funktionerna för Python-programmerare. Se dokumentationen för Python 2.1, eller den specifika PEP:en, för mer information om någon ny funktion som intresserar dig särskilt.

source: One recent goal of the Python development team has been to accelerate the pace of new releases, with a new release coming every 6 to 9 months. 2.1 is the first release to come out at this faster pace, with the first alpha appearing in January, 3 months after the final version of 2.0 was released.
pt_pt: Um objetivo recente da equipa de desenvolvimento do Python tem sido acelerar o ritmo de lançamento de novas versões, com uma nova versão a cada 6 a 9 meses. O Python 2.1 é a primeira versão a seguir este ritmo mais rápido, com a primeira *alpha* lançada em janeiro, 3 meses após o lançamento da versão final do 2.0.
ru: Одной из недавних целей команды разработчиков Python было ускорить темпы выпуска новых выпусков: новый выпуск выходит каждые 6–9 месяцев. 2.1 — первая версия, вышедшая столь быстрыми темпами: первая альфа-версия появилась в январе, через 3 месяца после выхода финальной версии 2.0.
sv: Ett av Python-utvecklingsteamets senaste mål har varit att påskynda takten för nya utgåvor, med en ny utgåva var 6:e till 9:e månad. 2.1 är den första utgåvan som kommer ut i denna snabbare takt, med den första alfan som kom ut i januari, 3 månader efter att den slutliga versionen av 2.0 släpptes.

source: The final release of Python 2.1 was made on April 17, 2001.
pt_pt: A versão final do Python 2.1 foi lançada a 17 de abril de 2001.
ru: Последний выпуск Python 2.1 вышел 17 апреля 2001 года.
sv: Den slutliga versionen av Python 2.1 släpptes den 17 april 2001.

source: PEP 227: Nested Scopes
pt_pt: PEP 227: Âmbitos Aninhados
ru: PEP 227: Вложенные области видимости
sv: PEP 227: Nästlade scopes

source: The largest change in Python 2.1 is to Python's scoping rules. In Python 2.0, at any given time there are at most three namespaces used to look up variable names: local, module-level, and the built-in namespace. This often surprised people because it didn't match their intuitive expectations. For example, a nested recursive function definition doesn't work::
pt_pt: A maior alteração no Python 2.1 é nas regras de âmbito. No Python 2.0, em qualquer momento, existiam no máximo três *namespaces* para procurar nomes de variáveis: local, ao nível do módulo e o *namespace* integrado. Isto surpreendia muitas pessoas, pois não correspondia às suas expetativas intuitivas. Por exemplo, uma definição de função recursiva aninhada não funcionava::
ru: Самое большое изменение в Python 2.1 касается правил области действия Python. В Python 2.0 в любой момент времени для поиска имен переменных используется не более трех пространств имен: локальное, на уровне модуля и встроенное пространство имен. Это часто удивляло людей, поскольку не соответствовало их интуитивным ожиданиям. Например, определение вложенной рекурсивной функции не работает::
sv: Den största förändringen i Python 2.1 är Pythons scoping-regler. I Python 2.0 finns det vid varje given tidpunkt högst tre namnrymder som används för att leta upp variabelnamn: lokalt, modulnivå och det inbyggda namnrymden. Detta förvånade ofta människor eftersom det inte stämde överens med deras intuitiva förväntningar. Till exempel fungerar inte en nästlad rekursiv funktionsdefinition::

source: def f(): ... def g(value): ... return g(value-1) + 1 ...
pt_pt: def f(): ... def g(valor): ... return g(valor-1) + 1 ...

source: The function :func:`!g` will always raise a :exc:`NameError` exception, because the binding of the name ``g`` isn't in either its local namespace or in the module-level namespace. This isn't much of a problem in practice (how often do you recursively define interior functions like this?), but this also made using the :keyword:`lambda` expression clumsier, and this was a problem in practice. In code which uses :keyword:`lambda` you can often find local variables being copied by passing them as the default values of arguments. ::
pt_pt: A função :func:`!g` irá sempre gerar uma exceção :exc:`NameError`, porque a ligação do nome ``g`` não está no seu *namespace* local nem ao nível do módulo. Isto não é um grande problema na prática (com que frequência define funções interiores recursivas assim?), mas tornava o uso da expressão :keyword:`lambda` mais complicado, o que era um problema real. Em código que usa :keyword:`lambda`, é comum encontrar variáveis locais copiadas ao passá-las como valores predefinidos de argumentos::

source: def find(self, name): "Return list of any entries equal to 'name'" L = filter(lambda x, name=name: x == name, self.list_attribute) return L
pt_pt: def find(self, nome): "Devolve uma lista de entradas iguais a 'nome'" L = filter(lambda x, nome=nome: x == nome, self.list_attribute) return L

source: The readability of Python code written in a strongly functional style suffers greatly as a result.
pt_pt: A legibilidade do código Python escrito num estilo fortemente funcional fica muito comprometida.
ru: В результате читаемость кода Python, написанного в строго функциональном стиле, сильно страдает.
sv: Läsbarheten hos Python-kod skriven i en starkt funktionell stil blir därför mycket lidande.

source: The most significant change to Python 2.1 is that static scoping has been added to the language to fix this problem. As a first effect, the ``name=name`` default argument is now unnecessary in the above example. Put simply, when a given variable name is not assigned a value within a function (by an assignment, or the :keyword:`def`, :keyword:`class`, or :keyword:`import` statements), references to the variable will be looked up in the local namespace of the enclosing scope. A more detailed explanation of the rules, and a dissection of the implementation, can be found in the PEP.
pt_pt: A alteração mais significativa no Python 2.1 é a adição de âmbitos estáticos à linguagem para resolver este problema. Como primeiro efeito, o argumento predefinido ``name=name`` já não é necessário no exemplo acima. Em resumo, quando um nome de variável não recebe um valor dentro de uma função (por atribuição, ou através das instruções :keyword:`def`, :keyword:`class`, ou :keyword:`import`), as referências a essa variável serão procuradas no *namespace* local do âmbito que a contém. Uma explicação mais detalhada das regras e uma análise da implementação podem ser encontradas no PEP.
ru: Самым значительным изменением в Python 2.1 является то, что для решения этой проблемы в язык добавлена ​​статическая область видимости. Во-первых, аргумент по умолчанию ``name=name`` в приведенном выше примере теперь не нужен. Проще говоря, когда данному имени переменной не присвоено значение внутри функции (присвоением или операторами :keyword:`def`, :keyword:`class` или :keyword:`import`), ссылки на переменная будет искаться в локальном пространстве имен охватывающей области. Более подробное объяснение правил и анализ реализации можно найти в PEP.
sv: Den mest betydande förändringen i Python 2.1 är att statisk scoping har lagts till i språket för att lösa detta problem. Som en första effekt är standardargumentet ``namn=namn`` nu onödigt i exemplet ovan. Enkelt uttryckt, när ett givet variabelnamn inte tilldelas ett värde inom en funktion (genom en tilldelning, eller genom :keyword:`def`, :keyword:`class`, eller :keyword:`import`), kommer referenser till variabeln att sökas i det lokala namnområdet i det omslutande scopet. En mer detaljerad förklaring av reglerna, och en dissektion av implementationen, finns i PEP.

source: This change may cause some compatibility problems for code where the same variable name is used both at the module level and as a local variable within a function that contains further function definitions. This seems rather unlikely though, since such code would have been pretty confusing to read in the first place.
pt_pt: Esta alteração pode causar alguns problemas de compatibilidade em código onde o mesmo nome de variável é usado ao nível do módulo e como variável local dentro de uma função que contém outras definições de funções. No entanto, isto parece pouco provável, pois esse tipo de código já seria confuso de ler.
ru: Это изменение может вызвать некоторые проблемы совместимости для кода, в котором одно и то же имя переменной используется как на уровне модуля, так и в качестве локальной переменной внутри функции, содержащей дальнейшие определения функций. Однако это кажется маловероятным, поскольку такой код изначально было бы довольно сложно читать.
sv: Denna ändring kan orsaka vissa kompatibilitetsproblem för kod där samma variabelnamn används både på modulnivå och som en lokal variabel inom en funktion som innehåller ytterligare funktionsdefinitioner. Detta verkar dock ganska osannolikt, eftersom sådan kod skulle ha varit ganska förvirrande att läsa från början.

source: One side effect of the change is that the ``from module import *`` and ``exec`` statements have been made illegal inside a function scope under certain conditions. The Python reference manual has said all along that ``from module import *`` is only legal at the top level of a module, but the CPython interpreter has never enforced this before. As part of the implementation of nested scopes, the compiler which turns Python source into bytecodes has to generate different code to access variables in a containing scope. ``from module import *`` and ``exec`` make it impossible for the compiler to figure this out, because they add names to the local namespace that are unknowable at compile time. Therefore, if a function contains function definitions or :keyword:`lambda` expressions with free variables, the compiler will flag this by raising a :exc:`SyntaxError` exception.
pt_pt: Um efeito secundário desta alteração é que as instruções ``from module import *`` e ``exec`` foram tornadas ilegais dentro de um âmbito de função em certas condições. O manual de referência do Python sempre afirmou que ``from module import *`` só é legal ao nível superior de um módulo, mas o interpretador CPython nunca impôs esta regra. Como parte da implementação dos âmbitos aninhados, o compilador que converte o código-fonte Python em *bytecodes* tem de gerar código diferente para aceder a variáveis num âmbito contido. As instruções ``from module import *`` e ``exec`` tornam impossível para o compilador determinar isto, pois adicionam nomes ao *namespace* local que são desconhecidos em tempo de compilação. Portanto, se uma função contiver definições de funções ou expressões :keyword:`lambda` com variáveis livres, o compilador irá sinalizar isto ao gerar uma exceção :exc:`SyntaxError`.
ru: Одним из побочных эффектов изменения является то, что операторы from Module import * и exec стали недопустимыми внутри области функции при определенных условиях. В справочном руководстве Python всегда говорилось, что ``from Module import *`` допустимо только на верхнем уровне модуля, но интерпретатор CPython никогда раньше не применял это. В рамках реализации вложенных областей компилятор, который преобразует исходный код Python в байт-коды, должен генерировать другой код для доступа к переменным в содержащей области. ``from Module import *`` и ``exec`` не позволяют компилятору это выяснить, поскольку они добавляют в локальное пространство имен имена, которые неизвестны во время компиляции. Следовательно, если функция содержит определения функций или выражения :keyword:`lambda` со свободными переменными, компилятор пометит это, вызвав исключение :exc:`SyntaxError`.
sv: En sidoeffekt av förändringen är att ``from module import *`` och ``exec``-satserna har gjorts olagliga inom ett funktionsomfång under vissa förhållanden. Pythons referensmanual har hela tiden sagt att ``from module import *`` bara är lagligt på den översta nivån i en modul, men CPython-tolken har aldrig verkställt detta tidigare. Som en del av implementeringen av nästlade scope måste kompilatorn som förvandlar Python-källkod till bytecodes generera annan kod för att komma åt variabler i ett innehållande scope. ``from module import *`` och ``exec`` gör det omöjligt för kompilatorn att räkna ut detta, eftersom de lägger till namn i det lokala namnområdet som är okända vid kompileringstillfället. Därför, om en funktion innehåller funktionsdefinitioner eller :keyword:`lambda` uttryck med fria variabler, kommer kompilatorn att flagga detta genom att skapa ett :exc:`SyntaxError` undantag.

source: To make the preceding explanation a bit clearer, here's an example::
pt_pt: Para tornar a explicação anterior mais clara, aqui está um exemplo::
ru: Чтобы сделать предыдущее объяснение более понятным, приведем пример:
sv: För att göra den föregående förklaringen lite tydligare, här är ett exempel::

source: x = 1 def f(): # The next line is a syntax error exec 'x=2' def g(): return x
pt_pt: x = 1 def f(): # A linha seguinte é um erro de sintaxe exec 'x=2' def g(): return x

source: Line 4 containing the ``exec`` statement is a syntax error, since ``exec`` would define a new local variable named ``x`` whose value should be accessed by :func:`!g`.
pt_pt: A linha 4 que contém a instrução ``exec`` é um erro de sintaxe, pois ``exec`` definiria uma nova variável local chamada ``x`` cujo valor seria acedido por :func:`!g`.

source: This shouldn't be much of a limitation, since ``exec`` is rarely used in most Python code (and when it is used, it's often a sign of a poor design anyway).
pt_pt: Isto não deve ser uma grande limitação, pois ``exec`` é raramente usado na maior parte do código Python (e quando é usado, é muitas vezes sinal de um mau projeto).
ru: Это не должно быть большим ограничением, поскольку ``exec`` редко используется в большинстве кодов Python (и когда оно используется, это в любом случае часто является признаком плохого дизайна).
sv: Detta borde inte vara någon större begränsning, eftersom ``exec`` sällan används i den mesta Python-koden (och när det används är det ofta ett tecken på dålig design).

source: Compatibility concerns have led to nested scopes being introduced gradually; in Python 2.1, they aren't enabled by default, but can be turned on within a module by using a future statement as described in :pep:`236`. (See the following section for further discussion of :pep:`236`.) In Python 2.2, nested scopes will become the default and there will be no way to turn them off, but users will have had all of 2.1's lifetime to fix any breakage resulting from their introduction.
pt_pt: Preocupações de compatibilidade levaram à introdução gradual dos âmbitos aninhados; no Python 2.1, não estão ativados por predefinição, mas podem ser ativados num módulo usando uma instrução *future*, como descrito no :pep:`236`. (Consulte a secção seguinte para mais discussão sobre o :pep:`236`.) No Python 2.2, os âmbitos aninhados tornar-se-ão a predefinição e não haverá forma de os desativar, mas os utilizadores terão todo o ciclo de vida do 2.1 para corrigir quaisquer problemas resultantes da sua introdução.
ru: Проблемы совместимости привели к постепенному введению вложенных областей; в Python 2.1 они не включены по умолчанию, но их можно включить внутри модуля с помощью оператора Future, как описано в :pep:`236`. (Дальнейшее обсуждение :pep:`236` см. в следующем разделе.) В Python 2.2 вложенные области видимости станут значениями по умолчанию, и отключить их будет невозможно, но у пользователей будет все время существования версии 2.1, чтобы устранить любые поломки, возникшие в результате их внедрения.
sv: Kompatibilitetsproblem har lett till att nästlade scopes införs gradvis; i Python 2.1 är de inte aktiverade som standard, men kan slås på inom en modul genom att använda en future-sats som beskrivs i :pep:`236`. (Se följande avsnitt för ytterligare diskussion om :pep:`236`.) I Python 2.2 kommer nästlade scopes att bli standard och det kommer inte att finnas något sätt att stänga av dem, men användare kommer att ha haft hela 2.1:s livstid för att åtgärda eventuella fel som uppstår till följd av deras införande.

source: :pep:`227` - Statically Nested Scopes
pt_pt: :pep:`227` - Âmbitos Aninhados Estáticos
ru: :pep:`227` - Статически вложенные области видимости
sv: :pep:`227` - Statiskt nästlade scopes

source: Written and implemented by Jeremy Hylton.
pt_pt: Escrito e implementado por Jeremy Hylton.
ru: Написано и реализовано Джереми Хилтоном.
sv: Skriven och implementerad av Jeremy Hylton.

source: PEP 236: __future__ Directives
pt_pt: PEP 236: Diretivas __future__
ru: PEP 236: Директивы __future__
sv: PEP 236: __framtida__ direktiv

source: The reaction to nested scopes was widespread concern about the dangers of breaking code with the 2.1 release, and it was strong enough to make the Pythoneers take a more conservative approach. This approach consists of introducing a convention for enabling optional functionality in release N that will become compulsory in release N+1.
pt_pt: A reação aos âmbitos aninhados foi uma preocupação generalizada com o risco de quebrar código na versão 2.1, o que levou os *Pythoneers* a adotar uma abordagem mais conservadora. Esta abordagem consiste em introduzir uma convenção para ativar funcionalidades opcionais na versão N, que se tornarão obrigatórias na versão N+1.
ru: Реакцией на вложенные области видимости стала широко распространенная обеспокоенность по поводу опасности взлома кода в версии 2.1, и она была достаточно сильной, чтобы заставить питонистов принять более консервативный подход. Этот подход заключается во введении соглашения о включении дополнительных функций в версии N, которые станут обязательными в версии N+1.
sv: Reaktionen på nested scopes var en utbredd oro för farorna med att bryta kod med 2.1-versionen, och den var tillräckligt stark för att få Pythoneers att ta ett mer konservativt tillvägagångssätt. Detta tillvägagångssätt består i att införa en konvention för att aktivera valfri funktionalitet i version N som kommer att bli obligatorisk i version N+1.

source: The syntax uses a ``from...import`` statement using the reserved module name :mod:`__future__`. Nested scopes can be enabled by the following statement::
pt_pt: A sintaxe usa uma instrução ``from...import`` com o nome de módulo reservado :mod:`__future__`. Os âmbitos aninhados podem ser ativados com a seguinte instrução::
ru: Синтаксис использует оператор ``from...import`` с зарезервированным именем модуля :mod:`__future__`. Вложенные области можно включить с помощью следующего оператора::
sv: Syntaxen använder en ``from...import``-sats med det reserverade modulnamnet :mod:`__future__`. Nested scopes kan aktiveras genom följande uttalande::

source: While it looks like a normal :keyword:`import` statement, it's not; there are strict rules on where such a future statement can be put. They can only be at the top of a module, and must precede any Python code or regular :keyword:`!import` statements. This is because such statements can affect how the Python bytecode compiler parses code and generates bytecode, so they must precede any statement that will result in bytecodes being produced.
pt_pt: Embora pareça uma instrução :keyword:`import` normal, não é; existem regras estritas sobre onde uma instrução *future* pode ser colocada. Só podem estar no topo de um módulo e devem preceder qualquer código Python ou instruções :keyword:`!import` normais. Isto deve-se ao facto de tais instruções afetarem a forma como o compilador de *bytecode* do Python analisa o código e gera *bytecode*, pelo que devem preceder qualquer instrução que resulte na produção de *bytecodes*.
ru: Хотя это выглядит как обычный оператор :keyword:`import`, на самом деле это не так; существуют строгие правила относительно того, где можно разместить такое заявление о будущем. Они могут находиться только в верхней части модуля и должны предшествовать любому коду Python или обычным операторам :keyword:`!import`. Это связано с тем, что такие инструкции могут повлиять на то, как компилятор байт-кода Python анализирует код и генерирует байт-код, поэтому они должны предшествовать любому оператору, который приведет к созданию байт-кодов.
sv: Även om det ser ut som en vanlig :keyword:`import`-sats är det inte det; det finns strikta regler för var en sådan framtida sats kan placeras. De kan bara vara högst upp i en modul, och måste föregå all Python-kod eller vanliga :keyword:`!import`-satser. Detta beror på att sådana uttalanden kan påverka hur Pythons bytecode-kompilator analyserar kod och genererar bytecode, så de måste föregå alla uttalanden som kommer att resultera i att bytecodes produceras.

source: :pep:`236` - Back to the :mod:`__future__`
pt_pt: :pep:`236` - Regresso ao :mod:`__future__`
ru: :pep:`236` - Назад в :mod:`__future__`
sv: :pep:`236` - Tillbaka till :mod:`__framtiden__`

source: Written by Tim Peters, and primarily implemented by Jeremy Hylton.
pt_pt: Escrito por Tim Peters e implementado principalmente por Jeremy Hylton.
ru: Написан Тимом Питерсом и реализован Джереми Хилтоном.
sv: Skriven av Tim Peters och huvudsakligen implementerad av Jeremy Hylton.
