Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.1.po
Languages: pt_pt, ru, sv

source: PEP 207: Rich Comparisons
pt_pt: PEP 207: Comparações Ricas
ru: PEP 207: Богатые сравнения
sv: PEP 207: Rika jämförelser

source: In earlier versions, Python's support for implementing comparisons on user-defined classes and extension types was quite simple. Classes could implement a :meth:`!__cmp__` method that was given two instances of a class, and could only return 0 if they were equal or +1 or -1 if they weren't; the method couldn't raise an exception or return anything other than a Boolean value. Users of Numeric Python often found this model too weak and restrictive, because in the number-crunching programs that numeric Python is used for, it would be more useful to be able to perform elementwise comparisons of two matrices, returning a matrix containing the results of a given comparison for each element. If the two matrices are of different sizes, then the compare has to be able to raise an exception to signal the error.
pt_pt: Em versões anteriores, o suporte do Python para implementar comparações em classes definidas pelo utilizador e tipos de extensão era bastante simples. As classes podiam implementar um método :meth:`!__cmp__` que recebia duas instâncias de uma classe e só podia devolver 0 se fossem iguais, ou +1 ou -1 se não fossem; o método não podia gerar uma exceção nem devolver algo que não fosse um valor booleano. Os utilizadores do Numeric Python muitas vezes consideravam este modelo demasiado fraco e restritivo, pois nos programas de cálculo numérico para os quais o Numeric Python é usado, seria mais útil poder realizar comparações elemento a elemento de duas matrizes, devolvendo uma matriz com os resultados de uma comparação específica para cada elemento. Se as duas matrizes tiverem tamanhos diferentes, a comparação tem de poder gerar uma exceção para sinalizar o erro.

source: In Python 2.1, rich comparisons were added in order to support this need. Python classes can now individually overload each of the ``<``, ``<=``, ``>``, ``>=``, ``==``, and ``!=`` operations. The new magic method names are:
pt_pt: No Python 2.1, foram adicionadas comparações ricas para suportar esta necessidade. As classes Python podem agora sobrecarregar individualmente cada uma das operações ``<``, ``<=``, ``>``, ``>=``, ``==`` e ``!=``. Os novos nomes dos métodos mágicos são:
ru: В Python 2.1 для удовлетворения этой потребности были добавлены расширенные сравнения. Классы Python теперь могут индивидуально перегружать каждую из операций ``<``, ``<=``, ``>``, ``>=``, ``==`` и ``!=``. . Имена новых магических методов:
sv: I Python 2.1 lades rika jämförelser till för att stödja detta behov. Python-klasser kan nu individuellt överbelasta var och en av operationerna ``<``, ``<=``, ``>``, ``>=``, ``==`` och ``!=``. De nya magiska metodnamnen är:

source: Operation
pt_pt: Operação
ru: Операция

source: Method name
pt_pt: Nome do método
ru: Название метода
sv: Metodnamn

source: (The magic methods are named after the corresponding Fortran operators ``.LT.``. ``.LE.``, &c. Numeric programmers are almost certainly quite familiar with these names and will find them easy to remember.)
pt_pt: (O nome dos métodos mágicos é inspirado nos operadores Fortran ``.LT.``, ``.LE.``, etc. Os programadores numéricos estão quase certamente familiarizados com estes nomes e achá-los-ão fáceis de memorizar.)
ru: (Магические методы названы в честь соответствующих операторов Фортрана ``.LT.``, ``.LE.`` и т. д. Числовые программисты почти наверняка хорошо знакомы с этими именами, и им будет легко их запомнить.)
sv: (De magiska metoderna är uppkallade efter motsvarande Fortran-operatorer ``.LT.``. ``.LE.``, &c. Numeriska programmerare är nästan säkert ganska bekanta med dessa namn och kommer att tycka att de är lätta att komma ihåg)

source: Each of these magic methods is of the form ``method(self, other)``, where ``self`` will be the object on the left-hand side of the operator, while ``other`` will be the object on the right-hand side. For example, the expression ``A < B`` will cause ``A.__lt__(B)`` to be called.
pt_pt: Cada um destes métodos mágicos tem a forma ``method(self, other)``, onde ``self`` será o objeto do lado esquerdo do operador, enquanto ``other`` será o objeto do lado direito. Por exemplo, a expressão ``A < B`` irá chamar ``A.__lt__(B)``.
ru: Каждый из этих магических методов имеет форму ``method(self,other)``, где ``self`` будет объектом в левой части оператора, а ``other`` будет объектом. на правой стороне. Например, выражение ``A < B`` приведет к вызову ``A.__lt__(B)``.
sv: Var och en av dessa magiska metoder är av formen ``method(self, other)``, där ``self`` är objektet på vänster sida av operatorn, medan ``other`` är objektet på höger sida. Till exempel kommer uttrycket ``A < B`` att leda till att ``A.__lt__(B)`` anropas.

source: Each of these magic methods can return anything at all: a Boolean, a matrix, a list, or any other Python object. Alternatively they can raise an exception if the comparison is impossible, inconsistent, or otherwise meaningless.
pt_pt: Cada um destes métodos mágicos pode devolver qualquer coisa: um booleano, uma matriz, uma lista ou qualquer outro objeto Python. Alternativamente, podem gerar uma exceção se a comparação for impossível, inconsistente ou sem significado.
ru: Каждый из этих волшебных методов может возвращать что угодно: логическое значение, матрицу, список или любой другой объект Python. В качестве альтернативы они могут вызвать исключение, если сравнение невозможно, противоречиво или бессмысленно по другим причинам.
sv: Var och en av dessa magiska metoder kan returnera vad som helst: en boolesk, en matris, en lista eller något annat Python-objekt. Alternativt kan de ge upphov till ett undantag om jämförelsen är omöjlig, inkonsekvent eller på annat sätt meningslös.

source: The built-in ``cmp(A,B)`` function can use the rich comparison machinery, and now accepts an optional argument specifying which comparison operation to use; this is given as one of the strings ``"<"``, ``"<="``, ``">"``, ``">="``, ``"=="``, or ``"!="``. If called without the optional third argument, :func:`!cmp` will only return -1, 0, or +1 as in previous versions of Python; otherwise it will call the appropriate method and can return any Python object.
pt_pt: A função integrada ``cmp(A,B)`` pode usar o mecanismo de comparações ricas e agora aceita um argumento opcional que especifica qual a operação de comparação a usar; este argumento é uma das seguintes strings: ``"<"``, ``"<="``, ``">"``, ``">="``, ``"=="`` ou ``"!="``. Se chamada sem o terceiro argumento opcional, :func:`!cmp` só devolverá -1, 0 ou +1, como nas versões anteriores do Python; caso contrário, chamará o método apropriado e poderá devolver qualquer objeto Python.

source: There are also corresponding changes of interest to C programmers; there's a new slot ``tp_richcmp`` in type objects and an API for performing a given rich comparison. I won't cover the C API here, but will refer you to :pep:`207`, or to 2.1's C API documentation, for the full list of related functions.
pt_pt: Existem também alterações correspondentes de interesse para programadores em C; há um novo *slot* ``tp_richcmp`` nos objetos de tipo e uma API para realizar uma comparações ricas. Não vou abordar a API em C aqui, mas remeto-o para o :pep:`207`, ou para a documentação da API em C do Python 2.1, para a lista completa de funções relacionadas.
ru: Есть также соответствующие изменения, представляющие интерес для программистов на языке C; в объектах типов появился новый слот tp_richcmp и API для выполнения расширенного сравнения. Я не буду здесь описывать C API, но отсылаю вас к :pep:`207` или к документации по C API версии 2.1, где вы найдете полный список связанных функций.
sv: Det finns också motsvarande förändringar av intresse för C-programmerare; det finns en ny plats ``tp_richcmp`` i typobjekt och ett API för att utföra en given rik jämförelse. Jag kommer inte att täcka C API här, men hänvisar dig till :pep:`207`, eller till 2.1:s C API-dokumentation, för den fullständiga listan över relaterade funktioner.

source: :pep:`207` - Rich Comparisons
pt_pt: :pep:`207` - Comparações Ricas
ru: :pep:`207` - Богатые сравнения
sv: :pep:`207` - Jämförelser av rikedomar

source: Written by Guido van Rossum, heavily based on earlier work by David Ascher, and implemented by Guido van Rossum.
pt_pt: Escrito por Guido van Rossum, baseado em trabalho anterior de David Ascher, e implementado por Guido van Rossum.
ru: Написано Гвидо ван Россумом, во многом основано на более ранних работах Дэвида Ашера и реализовано Гвидо ван Россумом.
sv: Skrivet av Guido van Rossum, starkt baserat på tidigare arbete av David Ascher, och implementerat av Guido van Rossum.

source: PEP 230: Warning Framework
pt_pt: PEP 230: Estrutura de Avisos
ru: PEP 230: Система предупреждений
sv: PEP 230: Ramverk för varning

source: Over its 10 years of existence, Python has accumulated a certain number of obsolete modules and features along the way. It's difficult to know when a feature is safe to remove, since there's no way of knowing how much code uses it --- perhaps no programs depend on the feature, or perhaps many do. To enable removing old features in a more structured way, a warning framework was added. When the Python developers want to get rid of a feature, it will first trigger a warning in the next version of Python. The following Python version can then drop the feature, and users will have had a full release cycle to remove uses of the old feature.
pt_pt: Ao longo dos seus 10 anos de existência, o Python acumulou um certo número de módulos e funcionalidades obsoletas. É difícil saber quando uma funcionalidade pode ser removida com segurança, pois não há forma de saber quantos códigos a utilizam — talvez nenhum programa dependa dela, ou talvez muitos dependam. Para permitir a remoção de funcionalidades antigas de forma mais estruturada, foi adicionada uma estrutura de avisos. Quando os desenvolvedores do Python pretendem remover uma funcionalidade, esta irá primeiro gerar um aviso na próxima versão do Python. A versão seguinte poderá então remover a funcionalidade, e os utilizadores terão tido um ciclo de lançamento completo para remover o uso da funcionalidade antiga.
ru: За 10 лет своего существования Python накопил определенное количество устаревших модулей и возможностей. Трудно определить, когда функцию можно безопасно удалить, поскольку невозможно узнать, сколько кода ее использует — возможно, ни одна программа не зависит от этой функции, а возможно, многие из них зависят. Чтобы обеспечить более структурированное удаление старых функций, была добавлена ​​система предупреждений. Когда разработчики Python захотят избавиться от какой-либо функции, это сначала вызовет предупреждение в следующей версии Python. В следующей версии Python эта функция может быть удалена, и у пользователей будет полный цикл выпуска, чтобы удалить использование старой функции.
sv: Under sina 10 år har Python samlat på sig ett visst antal föråldrade moduler och funktioner längs vägen. Det är svårt att veta när en funktion är säker att ta bort, eftersom det inte finns något sätt att veta hur mycket kod som använder den --- kanske inga program är beroende av funktionen, eller kanske många gör det. För att göra det möjligt att ta bort gamla funktioner på ett mer strukturerat sätt lades ett varningsramverk till. När Python-utvecklarna vill bli av med en funktion utlöses först en varning i nästa version av Python. Den följande Python-versionen kan sedan ta bort funktionen, och användarna har haft en hel versionscykel på sig att ta bort användningen av den gamla funktionen.

source: Python 2.1 adds the warning framework to be used in this scheme. It adds a :mod:`warnings` module that provide functions to issue warnings, and to filter out warnings that you don't want to be displayed. Third-party modules can also use this framework to deprecate old features that they no longer wish to support.
pt_pt: O Python 2.1 adiciona a estrutura de avisos para ser usada neste esquema. Adiciona um módulo :mod:`warnings` que fornece funções para emitir avisos e filtrar avisos que não deseja que sejam apresentados. Módulos de terceiros também podem usar esta estrutura para descontinuar funcionalidades antigas que já não pretendem suportar.
ru: Python 2.1 добавляет структуру предупреждений, которая будет использоваться в этой схеме. Он добавляет модуль :mod:`warnings`, который предоставляет функции для выдачи предупреждений и фильтрации предупреждений, которые вы не хотите отображать. Сторонние модули также могут использовать эту платформу для прекращения поддержки старых функций, которые они больше не хотят поддерживать.
sv: Python 2.1 lägger till ett ramverk för varningar som kan användas i detta system. Det lägger till en :mod:`warnings`-modul som tillhandahåller funktioner för att utfärda varningar och för att filtrera bort varningar som du inte vill ska visas. Tredjepartsmoduler kan också använda det här ramverket för att avskriva gamla funktioner som de inte längre vill stödja.

source: For example, in Python 2.1 the :mod:`!regex` module is deprecated, so importing it causes a warning to be printed::
pt_pt: Por exemplo, no Python 2.1, o módulo :mod:`!regex` está descontinuado, pelo que a sua importação gera um aviso::

source: >>> import regex __main__:1: DeprecationWarning: the regex module is deprecated; please use the re module >>>
pt_pt: >>> import regex __main__:1: DeprecationWarning: o módulo regex está descontinuado; utilize o módulo re >>>

source: Warnings can be issued by calling the :func:`warnings.warn` function::
pt_pt: Os avisos podem ser emitidos chamando a função :func:`warnings.warn`::
ru: Предупреждения можно выдать, вызвав функцию :func:`warnings.warn`::
sv: Varningar kan utfärdas genom att anropa funktionen :func:`warnings.warn`::

source: warnings.warn("feature X no longer supported")
pt_pt: warnings.warn("a funcionalidade X já não é suportada")

source: The first parameter is the warning message; an additional optional parameters can be used to specify a particular warning category.
pt_pt: O primeiro parâmetro é a mensagem de aviso; parâmetros opcionais adicionais podem ser usados para especificar uma categoria de aviso específica.
ru: Первый параметр — это предупреждающее сообщение; дополнительные необязательные параметры могут использоваться для указания конкретной категории предупреждения.
sv: Den första parametern är varningsmeddelandet; ytterligare valfria parametrar kan användas för att ange en viss varningskategori.

source: Filters can be added to disable certain warnings; a regular expression pattern can be applied to the message or to the module name in order to suppress a warning. For example, you may have a program that uses the :mod:`!regex` module and not want to spare the time to convert it to use the :mod:`re` module right now. The warning can be suppressed by calling ::
pt_pt: Podem ser adicionados filtros para desativar certos avisos; um padrão de expressão regular pode ser aplicado à mensagem ou ao nome do módulo para suprimir um aviso. Por exemplo, pode ter um programa que usa o módulo :mod:`!regex` e não querer perder tempo a convertê-lo para usar o módulo :mod:`re` neste momento. O aviso pode ser suprimido chamando::

source: import warnings warnings.filterwarnings(action = 'ignore', message='.*regex module is deprecated', category=DeprecationWarning, module = '__main__')
pt_pt: import warnings warnings.filterwarnings(action = 'ignore', message='.*módulo regex está descontinuado', category=DeprecationWarning, module = '__main__')

source: This adds a filter that will apply only to warnings of the class :class:`DeprecationWarning` triggered in the :mod:`__main__` module, and applies a regular expression to only match the message about the :mod:`!regex` module being deprecated, and will cause such warnings to be ignored. Warnings can also be printed only once, printed every time the offending code is executed, or turned into exceptions that will cause the program to stop (unless the exceptions are caught in the usual way, of course).
pt_pt: Isto adiciona um filtro que se aplica apenas a avisos da classe :class:`DeprecationWarning` gerados no módulo :mod:`__main__`, e aplica uma expressão regular para corresponder apenas à mensagem sobre o módulo :mod:`!regex` estar descontinuado, fazendo com que tais avisos sejam ignorados. Os avisos também podem ser impressos apenas uma vez, impressos sempre que o código problemático é executado, ou convertidos em exceções que farão parar o programa (a menos que as exceções sejam capturadas da forma habitual, claro).

source: Functions were also added to Python's C API for issuing warnings; refer to PEP 230 or to Python's API documentation for the details.
pt_pt: Foram também adicionadas funções à API em C do Python para emitir avisos; consulte o PEP 230 ou a documentação da API do Python para mais detalhes.
ru: В API Python C были также добавлены функции для выдачи предупреждений; подробности см. в PEP 230 или документации API Python.
sv: Funktioner har också lagts till i Pythons C API för att utfärda varningar; se PEP 230 eller Pythons API-dokumentation för mer information.

source: :pep:`5` - Guidelines for Language Evolution
pt_pt: :pep:`5` - Diretrizes para a Evolução da Linguagem
ru: :pep:`5` - Рекомендации по эволюции языка
sv: :pep:`5` - Riktlinjer för språkutveckling

source: Written by Paul Prescod, to specify procedures to be followed when removing old features from Python. The policy described in this PEP hasn't been officially adopted, but the eventual policy probably won't be too different from Prescod's proposal.
pt_pt: Escrito por Paul Prescod, para especificar procedimentos a seguir ao remover funcionalidades antigas do Python. A política descrita neste PEP ainda não foi oficialmente adotada, mas a política final provavelmente não será muito diferente da proposta de Prescod.
ru: Написано Полом Прескодом, чтобы указать процедуры, которым необходимо следовать при удалении старых функций из Python. Политика, описанная в этом PEP, не была официально принята, но возможная политика, вероятно, не будет сильно отличаться от предложения Прескода.
sv: Skriven av Paul Prescod, för att specificera procedurer som ska följas när man tar bort gamla funktioner från Python. Policyn som beskrivs i denna PEP har inte officiellt antagits, men den slutliga policyn kommer förmodligen inte att skilja sig alltför mycket från Prescods förslag.

source: :pep:`230` - Warning Framework
pt_pt: :pep:`230` - Estrutura de Avisos
ru: :pep:`230` - Система предупреждений
sv: :pep:`230` - Varning för ramverk

source: Written and implemented by Guido van Rossum.
pt_pt: Escrito e implementado por Guido van Rossum.
ru: Написано и реализовано Гвидо ван Россумом.
sv: Skriven och implementerad av Guido van Rossum.

source: PEP 229: New Build System
pt_pt: PEP 229: Novo Sistema de Compilação
ru: PEP 229: Новая система сборки
sv: PEP 229: Nybyggt system

source: When compiling Python, the user had to go in and edit the :file:`Modules/Setup` file in order to enable various additional modules; the default set is relatively small and limited to modules that compile on most Unix platforms. This means that on Unix platforms with many more features, most notably Linux, Python installations often don't contain all useful modules they could.
pt_pt: Ao compilar o Python, o utilizador tinha de editar o ficheiro :file:`Modules/Setup` para ativar vários módulos adicionais; o conjunto predefinido é relativamente pequeno e limitado a módulos que compilam na maioria das plataformas Unix. Isto significa que, em plataformas Unix com muitas mais funcionalidades, como o Linux, as instalações do Python muitas vezes não incluem todos os módulos úteis que poderiam conter.
ru: При компиляции Python пользователю приходилось заходить и редактировать файл :file:`Modules/Setup`, чтобы включить различные дополнительные модули; набор по умолчанию относительно невелик и ограничен модулями, которые компилируются на большинстве платформ Unix. Это означает, что на платформах Unix с множеством дополнительных функций, особенно на Linux, установки Python часто не содержат всех полезных модулей, которые могли бы.
sv: När Python kompilerades var användaren tvungen att gå in och redigera filen :file:`Modules/Setup` för att aktivera olika tilläggsmoduler; standarduppsättningen är relativt liten och begränsad till moduler som kompileras på de flesta Unix-plattformar. Detta innebär att på Unix-plattformar med många fler funktioner, framför allt Linux, innehåller Python-installationer ofta inte alla användbara moduler som de skulle kunna innehålla.

source: Python 2.0 added the Distutils, a set of modules for distributing and installing extensions. In Python 2.1, the Distutils are used to compile much of the standard library of extension modules, autodetecting which ones are supported on the current machine. It's hoped that this will make Python installations easier and more featureful.
pt_pt: O Python 2.0 adicionou o Distutils, um conjunto de módulos para distribuir e instalar extensões. No Python 2.1, o Distutils é usado para compilar grande parte da biblioteca padrão de módulos de extensão, detetando automaticamente quais são suportados na máquina atual. Espera-se que isto torne as instalações do Python mais fáceis e ricas em funcionalidades.
ru: В Python 2.0 добавлен Distutils — набор модулей для распространения и установки расширений. В Python 2.1 Distutils используются для компиляции большей части стандартной библиотеки модулей расширения, автоматически определяя, какие из них поддерживаются на текущем компьютере. Надеемся, что это сделает установку Python более простой и функциональной.
sv: I Python 2.0 tillkom Distutils, en uppsättning moduler för distribution och installation av tillägg. I Python 2.1 används Distutils för att kompilera en stor del av standardbiblioteket med tilläggsmoduler och automatiskt upptäcka vilka som stöds på den aktuella maskinen. Förhoppningen är att detta ska göra Python-installationer enklare och mer funktionsrika.
