Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.2.po
Languages: pt_pt, ru

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the :keyword:`yield` statement, the generator outputs the value of ``i``, similar to a :keyword:`return` statement. The big difference between :keyword:`!yield` and a :keyword:`!return` statement is that on reaching a :keyword:`!yield` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's ``next()`` method, the function will resume executing immediately after the :keyword:`!yield` statement. (For complicated reasons, the :keyword:`!yield` statement isn't allowed inside the :keyword:`!try` block of a :keyword:`try`...\ :keyword:`finally` statement; read :pep:`255` for a full explanation of the interaction between :keyword:`!yield` and exceptions.)
pt_pt: Quando chama uma função geradora, esta não devolve um único valor; em vez disso, devolve um objeto gerador que suporta o protocolo de iterador. Ao executar a instrução :keyword:`yield`, o gerador produz o valor de ``i``, semelhante a uma instrução :keyword:`return`. A grande diferença entre :keyword:`!yield` e uma instrução :keyword:`!return` é que, ao atingir um :keyword:`!yield`, o estado de execução do gerador é suspenso e as variáveis locais são preservadas. Na próxima chamada ao método ``next()`` do gerador, a função retomará a execução imediatamente após a instrução :keyword:`!yield`. (Por razões complicadas, a instrução :keyword:`!yield` não é permitida dentro do bloco :keyword:`!try` de uma instrução :keyword:`try`... :keyword:`finally`; leia o :pep:`255` para uma explicação completa da interação entre :keyword:`!yield` e exceções.)
ru: Когда вы вызываете функцию-генератор, она не возвращает ни одного значения; вместо этого он возвращает объект-генератор, поддерживающий протокол итератора. При выполнении оператора :keyword:`yield` генератор выводит значение ``i``, аналогично оператору :keyword:`return`. Большая разница между оператором :keyword:`!yield` и оператором :keyword:`!return` заключается в том, что при достижении :keyword:`!yield` состояние выполнения генератора приостанавливается и локальные переменные сохраняются. При следующем вызове метода генератора ``next()`` функция возобновит выполнение сразу после оператора :keyword:`!yield`. (По сложным причинам оператор :keyword:`!yield` не допускается внутри блока :keyword:`!try` оператора :keyword:`try`...\ :keyword:`finally`; читайте: pep:`255` для полного объяснения взаимодействия между :keyword:`!yield` и исключениями.)

source: Here's a sample usage of the :func:`!generate_ints` generator::
pt_pt: Aqui está um exemplo de uso do gerador :func:`!generate_ints`::
ru: Вот пример использования генератора :func:`!generate_ints`::

source: >>> gen = generate_ints(3) >>> gen <generator object at 0x8117f90> >>> gen.next() 0 >>> gen.next() 1 >>> gen.next() 2 >>> gen.next() Traceback (most recent call last): File "<stdin>", line 1, in ? File "<stdin>", line 2, in generate_ints StopIteration
pt_pt: >>> gen = generate_ints(3) >>> gen <objeto gerador em 0x8117f90> >>> gen.next() 0 >>> gen.next() 1 >>> gen.next() 2 >>> gen.next() Traceback (most recent call last): File "<stdin>", line 1, in ? File "<stdin>", line 2, in generate_ints StopIteration

source: You could equally write ``for i in generate_ints(5)``, or ``a,b,c = generate_ints(3)``.
pt_pt: Poderia igualmente escrever ``for i in generate_ints(5)``, ou ``a,b,c = generate_ints(3)``.
ru: Вы также можете написать ``for i ingener_ints(5)`` или ``a,b,c =generate_ints(3)``.

source: Inside a generator function, the :keyword:`return` statement can only be used without a value, and signals the end of the procession of values; afterwards the generator cannot return any further values. :keyword:`!return` with a value, such as ``return 5``, is a syntax error inside a generator function. The end of the generator's results can also be indicated by raising :exc:`StopIteration` manually, or by just letting the flow of execution fall off the bottom of the function.
pt_pt: Dentro de uma função geradora, a instrução :keyword:`return` só pode ser usada sem um valor, e sinaliza o fim da sequência de valores; depois disso, o gerador não pode devolver mais valores. :keyword:`!return` com um valor, como ``return 5``, é um erro de sintaxe dentro de uma função geradora. O fim dos resultados do gerador também pode ser indicado ao gerar manualmente uma :exc:`StopIteration`, ou simplesmente deixando o fluxo de execução chegar ao fim da função.
ru: Внутри функции-генератора оператор :keyword:`return` может использоваться только без значения и сигнализирует об окончании обработки значений; после этого генератор не может возвращать дальнейшие значения. :keyword:`!return` со значением, например ``return 5``, является синтаксической ошибкой внутри функции-генератора. Окончание результатов генератора также можно указать, подняв :exc:`StopIteration` вручную или просто позволив потоку выполнения выпасть из нижней части функции.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`next` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class would be much messier. :file:`Lib/test/test_generators.py` contains a number of more interesting examples. The simplest one implements an in-order traversal of a tree using generators recursively. ::
pt_pt: Poderia alcançar o efeito dos geradores manualmente ao escrever a sua própria classe e armazenar todas as variáveis locais do gerador como variáveis de instância. Por exemplo, devolver uma lista de inteiros poderia ser feito ao definir ``self.count`` para 0, e tendo o método :meth:`next` a incrementar ``self.count`` e devolvê-lo. No entanto, para um gerador moderadamente complicado, escrever uma classe correspondente seria muito mais confuso. O ficheiro :file:`Lib/test/test_generators.py` contém vários exemplos mais interessantes. O mais simples implementa uma travessia em ordem de uma árvore usando geradores de forma recursiva. ::
ru: Эффекта генераторов можно добиться вручную, написав собственный класс и сохранив все локальные переменные генератора как переменные экземпляра. Например, возврат списка целых чисел можно выполнить, установив для ``self.count`` значение 0, а метод :meth:`next` увеличит ``self.count`` и вернет его. Однако для генератора средней сложности написание соответствующего класса было бы гораздо сложнее. :file:`Lib/test/test_generators.py` содержит ряд более интересных примеров. Самый простой реализует обход дерева по порядку с использованием рекурсивных генераторов. ::

source: # A recursive generator that generates Tree leaves in in-order. def inorder(t): if t: for x in inorder(t.left): yield x yield t.label for x in inorder(t.right): yield x
pt_pt: # Um gerador recursivo que gera folhas de Árvore em ordem. def inorder(t): if t: for x in inorder(t.left): yield x yield t.label for x in inorder(t.right): yield x

source: Two other examples in :file:`Lib/test/test_generators.py` produce solutions for the N-Queens problem (placing $N$ queens on an $NxN$ chess board so that no queen threatens another) and the Knight's Tour (a route that takes a knight to every square of an $NxN$ chessboard without visiting any square twice).
pt_pt: Outros dois exemplos em :file:`Lib/test/test_generators.py` produzem soluções para o problema das $N$-Rainhas (colocar $N$ rainhas num tabuleiro de xadrez $NxN$ de modo a que nenhuma rainha ameace outra) e o Passeio do Cavalo (uma rota que leva um cavalo a todas as casas de um tabuleiro de xadrez $NxN$ sem visitar nenhuma casa duas vezes).
ru: Два других примера в :file:`Lib/test/test_generators.py` дают решения проблемы N-ферзей (размещение $N$ ферзей на шахматной доске $NxN$ так, чтобы ни один ферзь не угрожал другому) и конского тура ( маршрут, который доставляет коня на каждую клетку шахматной доски $NxN$, не посещая ни одну клетку дважды).

source: The idea of generators comes from other programming languages, especially Icon (https://www2.cs.arizona.edu/icon/), where the idea of generators is central. In Icon, every expression and function call behaves like a generator. One example from "An Overview of the Icon Programming Language" at https://www2.cs.arizona.edu/icon/docs/ipd266.htm gives an idea of what this looks like::
pt_pt: A ideia de geradores vem de outras linguagens de programação, especialmente do Icon (https://www2.cs.arizona.edu/icon/), onde a ideia de geradores é central. No Icon, todas as expressões e chamadas de função comportam-se como geradores. Um exemplo de "Uma Visão Geral da Linguagem de Programação Icon" em https://www2.cs.arizona.edu/icon/docs/ipd266.htm dá uma ideia de como isto parece::
ru: Идея генераторов пришла из других языков программирования, особенно из Icon (https://www2.cs.arizona.edu/icon/), где идея генераторов занимает центральное место. В Icon каждое выражение и вызов функции ведет себя как генератор. Один пример из «Обзора языка программирования значков» по ​​адресу https://www2.cs.arizona.edu/icon/docs/ipd266.htm дает представление о том, как это выглядит:

source: In Icon the :func:`!find` function returns the indexes at which the substring "or" is found: 3, 23, 33. In the :keyword:`if` statement, ``i`` is first assigned a value of 3, but 3 is less than 5, so the comparison fails, and Icon retries it with the second value of 23. 23 is greater than 5, so the comparison now succeeds, and the code prints the value 23 to the screen.
pt_pt: No Icon, a função :func:`!find` devolve os índices nos quais a substring "or" é encontrada: 3, 23, 33. Na instrução :keyword:`if`, ``i`` é primeiro atribuído com o valor 3, mas 3 é menor que 5, pelo que a comparação falha, e o Icon tenta novamente com o segundo valor, 23. 23 é maior que 5, pelo que a comparação agora tem sucesso, e o código imprime o valor 23 no ecrã.
ru: В Icon функция :func:`!find` возвращает индексы, по которым найдена подстрока "или": 3, 23, 33. В операторе :keyword:`if` ``i`` сначала присваивается значение 3, но 3 меньше 5, поэтому сравнение не удается, и Icon повторяет его со вторым значением 23. 23 больше 5, поэтому сравнение теперь завершается успешно, и код выводит значение 23 на экран.

source: Python doesn't go nearly as far as Icon in adopting generators as a central concept. Generators are considered a new part of the core Python language, but learning or using them isn't compulsory; if they don't solve any problems that you have, feel free to ignore them. One novel feature of Python's interface as compared to Icon's is that a generator's state is represented as a concrete object (the iterator) that can be passed around to other functions or stored in a data structure.
pt_pt: O Python não vai tão longe como o Icon na adoção de geradores como um conceito central. Os geradores são considerados uma nova parte da linguagem central do Python, mas aprender ou usá-los não é obrigatório; se não resolverem nenhum problema que tenha, sinta-se à vontade para os ignorar. Uma funcionalidade nova da interface do Python em comparação com a do Icon é que o estado de um gerador é representado como um objeto concreto (o iterador) que pode ser passado para outras funções ou armazenado numa estrutura de dados.
ru: Python не заходит так далеко, как Icon, в принятии генераторов в качестве центральной концепции. Генераторы считаются новой частью основного языка Python, но их изучение или использование не является обязательным; если они не решают ваших проблем, не стесняйтесь их игнорировать. Одной из новых особенностей интерфейса Python по сравнению с интерфейсом Icon является то, что состояние генератора представлено в виде конкретного объекта (итератора), который можно передавать другим функциям или сохранять в структуре данных.

source: :pep:`255` - Simple Generators
pt_pt: :pep:`255` - Geradores Simples
ru: :pep:`255` - Простые генераторы

source: Written by Neil Schemenauer, Tim Peters, Magnus Lie Hetland. Implemented mostly by Neil Schemenauer and Tim Peters, with other fixes from the Python Labs crew.
pt_pt: Escrito por Neil Schemenauer, Tim Peters e Magnus Lie Hetland. Implementado maioritariamente por Neil Schemenauer e Tim Peters, com outras correções da equipa Python Labs.
ru: Сценарист: Нил Шеменауэр, Тим Питерс, Магнус Ли Хетланд. Реализовано в основном Нилом Шеменауэром и Тимом Питерсом, а другие исправления внесены командой Python Labs.

source: PEP 237: Unifying Long Integers and Integers
pt_pt: PEP 237: Unificação de Inteiros Longos e Inteiros
ru: PEP 237: объединение длинных и целых чисел

source: In recent versions, the distinction between regular integers, which are 32-bit values on most machines, and long integers, which can be of arbitrary size, was becoming an annoyance. For example, on platforms that support files larger than ``2**32`` bytes, the :meth:`!tell` method of file objects has to return a long integer. However, there were various bits of Python that expected plain integers and would raise an error if a long integer was provided instead. For example, in Python 1.5, only regular integers could be used as a slice index, and ``'abc'[1L:]`` would raise a :exc:`TypeError` exception with the message 'slice index must be int'.
pt_pt: Nas versões recentes, a distinção entre inteiros normais, que são valores de 32 bits na maioria das máquinas, e inteiros longos, que podem ser de tamanho arbitrário, estava a tornar-se um incómodo. Por exemplo, em plataformas que suportam ficheiros maiores que ``2**32`` bytes, o método :meth:`!tell` de objetos de ficheiro tem de devolver um inteiro longo. No entanto, existiam várias partes do Python que esperavam inteiros normais e geravam um erro se um inteiro longo fosse fornecido em vez disso. Por exemplo, no Python 1.5, apenas inteiros normais podiam ser usados como índice de *slice*, e ``'abc'[1L:]`` gerava uma exceção :exc:`TypeError` com a mensagem 'slice index must be int'.
ru: В последних версиях различие между обычными целыми числами, которые на большинстве машин представляют собой 32-битные значения, и длинными целыми числами, которые могут иметь произвольный размер, становилось раздражающим. Например, на платформах, которые поддерживают файлы размером более ``2**32`` байт, метод файловых объектов :meth:`!tell` должен возвращать длинное целое число. Однако были различные части Python, которые ожидали простые целые числа и вызывали ошибку, если вместо них было указано длинное целое число. Например, в Python 1.5 в качестве индекса среза можно было использовать только обычные целые числа, а ``'abc'[1L:]`` вызывало исключение :exc:`TypeError` с сообщением "индекс среза должен быть int". .

source: Python 2.2 will shift values from short to long integers as required. The 'L' suffix is no longer needed to indicate a long integer literal, as now the compiler will choose the appropriate type. (Using the 'L' suffix will be discouraged in future 2.x versions of Python, triggering a warning in Python 2.4, and probably dropped in Python 3.0.) Many operations that used to raise an :exc:`OverflowError` will now return a long integer as their result. For example::
pt_pt: O Python 2.2 irá converter valores de inteiros curtos para inteiros longos conforme necessário. O sufixo 'L' já não é necessário para indicar um literal de inteiro longo, pois agora o compilador escolherá o tipo apropriado. (O uso do sufixo 'L' será desencorajado em futuras versões 2.x do Python, gerando um aviso no Python 2.4, e provavelmente removido no Python 3.0.) Muitas operações que costumavam gerar um :exc:`OverflowError` agora devolverão um inteiro longo como resultado. Por exemplo::
ru: Python 2.2 будет перемещать значения от коротких к длинным целым числам по мере необходимости. Суффикс «L» больше не нужен для обозначения длинного целочисленного литерала, поскольку теперь компилятор сам выберет соответствующий тип. (Использование суффикса «L» не рекомендуется в будущих версиях Python 2.x, вызывая предупреждение в Python 2.4 и, вероятно, исключено в Python 3.0.) Многие операции, которые раньше вызывали :exc:`OverflowError`, теперь будут возвращать длинное целое число в качестве результата. Например::

source: In most cases, integers and long integers will now be treated identically. You can still distinguish them with the :func:`type` built-in function, but that's rarely needed.
pt_pt: Na maioria dos casos, inteiros e inteiros longos serão agora tratados de forma idêntica. Ainda pode distinguir entre eles com a função integrada :func:`type`, mas isso é raramente necessário.
ru: В большинстве случаев целые и длинные целые числа теперь будут обрабатываться одинаково. Вы по-прежнему можете различать их с помощью встроенной функции :func:`type`, но это требуется редко.

source: :pep:`237` - Unifying Long Integers and Integers
pt_pt: :pep:`237` - Unificação de Inteiros Longos e Inteiros
ru: :pep:`237` - Объединение длинных и целых чисел

source: Written by Moshe Zadka and Guido van Rossum. Implemented mostly by Guido van Rossum.
pt_pt: Escrito por Moshe Zadka e Guido van Rossum. Implementado maioritariamente por Guido van Rossum.
ru: Авторы сценария Моше Задка и Гвидо ван Россум. В основном реализовано Гвидо ван Россумом.

source: PEP 238: Changing the Division Operator
pt_pt: PEP 238: Alteração do Operador de Divisão
ru: PEP 238: Изменение оператора подразделения

source: The most controversial change in Python 2.2 heralds the start of an effort to fix an old design flaw that's been in Python from the beginning. Currently Python's division operator, ``/``, behaves like C's division operator when presented with two integer arguments: it returns an integer result that's truncated down when there would be a fractional part. For example, ``3/2`` is 1, not 1.5, and ``(-1)/2`` is -1, not -0.5. This means that the results of division can vary unexpectedly depending on the type of the two operands and because Python is dynamically typed, it can be difficult to determine the possible types of the operands.
pt_pt: A alteração mais controversa no Python 2.2 marca o início de um esforço para corrigir uma antiga falha de projeto que existe no Python desde o início. Atualmente, o operador de divisão do Python, ``/``, comporta-se como o operador de divisão do C quando apresentado com dois argumentos inteiros: devolve um resultado inteiro que é truncado quando há uma parte fracionária. Por exemplo, ``3/2`` é 1, não 1.5, e ``(-1)/2`` é -1, não -0.5. Isto significa que os resultados da divisão podem variar inesperadamente dependendo do tipo dos dois operandos e, como o Python é dinamicamente tipado, pode ser difícil determinar os possíveis tipos dos operandos.
ru: Самое противоречивое изменение в Python 2.2 знаменует начало попыток исправить старый недостаток дизайна, который был в Python с самого начала. В настоящее время оператор деления Python ``/`` ведет себя как оператор деления C, когда ему представлены два целочисленных аргумента: он возвращает целочисленный результат, который усекается, если есть дробная часть. Например, «3/2» равно 1, а не 1,5, а «(-1)/2» равно -1, а не -0,5. Это означает, что результаты деления могут неожиданно различаться в зависимости от типа двух операндов, а поскольку Python является динамически типизированным, может быть сложно определить возможные типы операндов.

source: (The controversy is over whether this is *really* a design flaw, and whether it's worth breaking existing code to fix this. It's caused endless discussions on python-dev, and in July 2001 erupted into a storm of acidly sarcastic postings on :newsgroup:`comp.lang.python`. I won't argue for either side here and will stick to describing what's implemented in 2.2. Read :pep:`238` for a summary of arguments and counter-arguments.)
pt_pt: (A controvérsia é sobre se isto é *realmente* uma falha de projeto, e se vale a pena quebrar código existente para corrigi-la. Isto causou discussões intermináveis na python-dev, e em julho de 2001 explodiu numa tempestade de publicações acidamente sarcásticas no :newsgroup:`comp.lang.python`. Não vou argumentar a favor de nenhum dos lados aqui e vou limitar-me a descrever o que está implementado no 2.2. Leia o :pep:`238` para um resumo dos argumentos e contra-argumentos.)
ru: (Спор идет о том, является ли это *действительно* ошибкой дизайна, и стоит ли ломать существующий код, чтобы это исправить. Это вызвало бесконечные дискуссии на python-dev, а в июле 2001 года вылилось в шквал язвительно-саркастических сообщений на :newsgroup :`comp.lang.python` Я не буду здесь спорить ни за одну из сторон и остановлюсь на описании того, что реализовано в версии 2.2. Прочтите :pep:`238`, чтобы увидеть сводку аргументов и контраргументов.)

source: Because this change might break code, it's being introduced very gradually. Python 2.2 begins the transition, but the switch won't be complete until Python 3.0.
pt_pt: Como esta alteração pode quebrar código, está a ser introduzida de forma muito gradual. O Python 2.2 inicia a transição, mas a mudança não estará completa até ao Python 3.0.
ru: Поскольку это изменение может привести к поломке кода, оно вводится очень постепенно. Python 2.2 начинает переход, но переход не будет полным до Python 3.0.

source: First, I'll borrow some terminology from :pep:`238`. "True division" is the division that most non-programmers are familiar with: 3/2 is 1.5, 1/4 is 0.25, and so forth. "Floor division" is what Python's ``/`` operator currently does when given integer operands; the result is the floor of the value returned by true division. "Classic division" is the current mixed behaviour of ``/``; it returns the result of floor division when the operands are integers, and returns the result of true division when one of the operands is a floating-point number.
pt_pt: Primeiro, vou usar alguma terminologia do :pep:`238`. "Divisão verdadeira" é a divisão com que a maioria dos não-programadores está familiarizada: 3/2 é 1.5, 1/4 é 0.25, e assim por diante. "Divisão por defeito" é o que o operador ``/`` do Python faz atualmente quando recebe operandos inteiros; o resultado é o valor por defeito do valor devolvido pela divisão verdadeira. "Divisão clássica" é o comportamento misto atual de ``/``; devolve o resultado da divisão por defeito quando os operandos são inteiros, e devolve o resultado da divisão verdadeira quando um dos operandos é um número de vírgula flutuante.
ru: Во-первых, я позаимствую некоторую терминологию у :pep:`238`. «Истинное деление» — это деление, с которым знакомо большинство непрограммистов: 3/2 — это 1,5, 1/4 — это 0,25 и так далее. «Деление этажа» — это то, что в настоящее время делает оператор Python ``/``, когда заданы целочисленные операнды; результатом является минимальное значение, возвращаемое истинным делением. «Классическое деление» — это текущее смешанное поведение ``/``; он возвращает результат нижнего деления, когда операнды являются целыми числами, и возвращает результат истинного деления, когда один из операндов является числом с плавающей запятой.

source: Here are the changes 2.2 introduces:
pt_pt: Aqui estão as alterações introduzidas no 2.2:
ru: Вот изменения, которые вносит версия 2.2:
