Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.2.po
Languages: pt_pt, ru

source: This section has just been a quick overview of the new features, giving enough of an explanation to start you programming, but many details have been simplified or ignored. Where should you go to get a more complete picture?
pt_pt: Esta secção foi apenas uma visão geral rápida das novas funcionalidades, fornecendo explicação suficiente para começar a programar, mas muitos detalhes foram simplificados ou ignorados. Onde deve ir para obter uma imagem mais completa?
ru: Этот раздел представляет собой краткий обзор новых функций и дает достаточно объяснений, чтобы начать программирование, но многие детали упрощены или проигнорированы. Куда следует обратиться, чтобы получить более полную картину?

source: The :ref:`descriptorhowto` is a lengthy tutorial introduction to the descriptor features, written by Guido van Rossum. If my description has whetted your appetite, go read this tutorial next, because it goes into much more detail about the new features while still remaining quite easy to read.
pt_pt: O :ref:`descriptorhowto` é uma longa introdução tutorial às funcionalidades de descritores, escrita por Guido van Rossum. Se a minha descrição despertou o seu interesse, leia este tutorial a seguir, porque entra em muito mais detalhe sobre as novas funcionalidades, mantendo-se ainda bastante fácil de ler.
ru: :ref:`descriptorhowto` — это подробное введение в функции дескриптора, написанное Гвидо ван Россумом. Если мое описание разожгло ваш аппетит, прочитайте следующее руководство, потому что оно содержит гораздо больше подробностей о новых функциях, но при этом остается довольно простым для чтения.

source: Next, there are two relevant PEPs, :pep:`252` and :pep:`253`. :pep:`252` is titled "Making Types Look More Like Classes", and covers the descriptor API. :pep:`253` is titled "Subtyping Built-in Types", and describes the changes to type objects that make it possible to subtype built-in objects. :pep:`253` is the more complicated PEP of the two, and at a few points the necessary explanations of types and meta-types may cause your head to explode. Both PEPs were written and implemented by Guido van Rossum, with substantial assistance from the rest of the Zope Corp. team.
pt_pt: Em seguida, existem dois PEPs relevantes, :pep:`252` e :pep:`253`. O :pep:`252` tem o título "Tornar os Tipos Mais Semelhantes a Classes", e aborda a API de descritores. O :pep:`253` tem o título "Subtipagem de Tipos Integrados", e descreve as alterações aos objetos de tipo que tornam possível a subtipagem de objetos integrados. O :pep:`253` é o PEP mais complicado dos dois, e em alguns pontos as explicações necessárias sobre tipos e meta-tipos podem fazer a sua cabeça explodir. Ambos os PEPs foram escritos e implementados por Guido van Rossum, com assistência substancial do resto da equipa da Zope Corp.
ru: Далее идут два соответствующих PEP: :pep:`252` и :pep:`253`. :pep:`252` называется «Сделать типы более похожими на классы» и описывает API дескрипторов. :pep:`253` называется «Подтипирование встроенных типов» и описывает изменения в объектах типов, которые позволяют создавать подтипы встроенных объектов. :pep:`253` — это более сложный PEP из двух, и в некоторых моментах необходимые объяснения типов и метатипов могут взорвать вашу голову. Оба PEP были написаны и реализованы Гвидо ван Россумом при существенной помощи остальной команды Zope Corp.

source: Finally, there's the ultimate authority: the source code. Most of the machinery for the type handling is in :file:`Objects/typeobject.c`, but you should only resort to it after all other avenues have been exhausted, including posting a question to python-list or python-dev.
pt_pt: Finalmente, há a autoridade máxima: o código-fonte. A maioria da maquinaria para o tratamento de tipos está em :file:`Objects/typeobject.c`, mas só deve recorrer a ela depois de esgotadas todas as outras vias, incluindo a publicação de uma pergunta na python-list ou python-dev.
ru: Наконец, есть высший авторитет: исходный код. Большая часть механизмов обработки типов находится в :file:`Objects/typeobject.c`, но прибегать к ним следует только после того, как все другие возможности исчерпаны, включая публикацию вопроса в python-list или python-dev.

source: PEP 234: Iterators
pt_pt: PEP 234: Iteradores
ru: PEP 234: Итераторы

source: Another significant addition to 2.2 is an iteration interface at both the C and Python levels. Objects can define how they can be looped over by callers.
pt_pt: Outra adição significativa ao Python 2.2 é uma interface de iteração tanto ao nível de C como de Python. Os objetos podem definir como podem ser percorridos por quem os chama.
ru: Еще одним важным дополнением к версии 2.2 является интерфейс итерации как на уровне C, так и на уровне Python. Объекты могут определять, как они могут быть зациклены вызывающими объектами.

source: In Python versions up to 2.1, the usual way to make ``for item in obj`` work is to define a :meth:`~object.__getitem__` method that looks something like this::
pt_pt: Nas versões do Python até à 2.1, a forma habitual de fazer ``for item in obj`` funcionar era definir um método :meth:`~object.__getitem__` que se assemelhava a isto::
ru: В версиях Python до 2.1 обычный способ заставить работать элемент for item in obj — определить метод :meth:`~object.__getitem__`, который выглядит примерно так:

source: def __getitem__(self, index): return <next item>
pt_pt: def __getitem__(self, index): return <próximo item>

source: :meth:`~object.__getitem__` is more properly used to define an indexing operation on an object so that you can write ``obj[5]`` to retrieve the sixth element. It's a bit misleading when you're using this only to support :keyword:`for` loops. Consider some file-like object that wants to be looped over; the *index* parameter is essentially meaningless, as the class probably assumes that a series of :meth:`~object.__getitem__` calls will be made with *index* incrementing by one each time. In other words, the presence of the :meth:`~object.__getitem__` method doesn't mean that using ``file[5]`` to randomly access the sixth element will work, though it really should.
pt_pt: :meth:`~object.__getitem__` é mais propriamente usado para definir uma operação de indexação num objeto, de modo a que possa escrever ``obj[5]`` para recuperar o sexto elemento. É um pouco enganador quando o usa apenas para suportar ciclos :keyword:`for`. Considere algum objeto semelhante a um ficheiro que pretende ser percorrido; o parâmetro *index* é essencialmente sem significado, pois a classe provavelmente assume que uma série de chamadas :meth:`~object.__getitem__` será feita com *index* a incrementar de um em cada chamada. Em outras palavras, a presença do método :meth:`~object.__getitem__` não significa que usar ``file[5]`` para aceder aleatoriamente ao sexto elemento irá funcionar, embora realmente devesse.
ru: :meth:`~object.__getitem__` более правильно используется для определения операции индексации объекта, так что вы можете написать ``obj[5]`` для получения шестого элемента. Это немного вводит в заблуждение, когда вы используете это только для поддержки циклов :keyword:`for`. Рассмотрим некоторый объект, похожий на файл, который необходимо обработать в цикле; параметр *index* по сути бессмысленен, поскольку класс, вероятно, предполагает, что будет выполняться серия вызовов :meth:`~object.__getitem__` с увеличением *index* на единицу каждый раз. Другими словами, наличие метода :meth:`~object.__getitem__` не означает, что использование ``file[5]`` для случайного доступа к шестому элементу будет работать, хотя на самом деле так и должно быть.

source: In Python 2.2, iteration can be implemented separately, and :meth:`~object.__getitem__` methods can be limited to classes that really do support random access. The basic idea of iterators is simple. A new built-in function, ``iter(obj)`` or ``iter(C, sentinel)``, is used to get an iterator. ``iter(obj)`` returns an iterator for the object *obj*, while ``iter(C, sentinel)`` returns an iterator that will invoke the callable object *C* until it returns *sentinel* to signal that the iterator is done.
pt_pt: No Python 2.2, a iteração pode ser implementada separadamente, e os métodos :meth:`~object.__getitem__` podem ser limitados a classes que realmente suportam acesso aleatório. A ideia básica dos iteradores é simples. Uma nova função integrada, ``iter(obj)`` ou ``iter(C, sentinel)``, é usada para obter um iterador. ``iter(obj)`` devolve um iterador para o objeto *obj*, enquanto ``iter(C, sentinel)`` devolve um iterador que invocará o objeto chamável *C* até que este devolva *sentinel* para sinalizar que o iterador terminou.
ru: В Python 2.2 итерация может быть реализована отдельно, а методы :meth:`~object.__getitem__` могут быть ограничены классами, которые действительно поддерживают произвольный доступ. Основная идея итераторов проста. Новая встроенная функция iter(obj) или iter(C, Sentinel) используется для получения итератора. ``iter(obj)`` возвращает итератор для объекта *obj*, а ``iter(C, Sentinel)`` возвращает итератор, который будет вызывать вызываемый объект *C* до тех пор, пока он не вернет *sentinel*, сигнализируя, что итератор готов.

source: Python classes can define an :meth:`!__iter__` method, which should create and return a new iterator for the object; if the object is its own iterator, this method can just return ``self``. In particular, iterators will usually be their own iterators. Extension types implemented in C can implement a :c:member:`~PyTypeObject.tp_iter` function in order to return an iterator, and extension types that want to behave as iterators can define a :c:member:`~PyTypeObject.tp_iternext` function.
pt_pt: As classes Python podem definir um método :meth:`!__iter__`, que deve criar e devolver um novo iterador para o objeto; se o objeto for o seu próprio iterador, este método pode simplesmente devolver ``self``. Em particular, os iteradores serão normalmente os seus próprios iteradores. Tipos de extensão implementados em C podem implementar uma função :c:member:`~PyTypeObject.tp_iter` para devolver um iterador, e tipos de extensão que pretendam comportar-se como iteradores podem definir uma função :c:member:`~PyTypeObject.tp_iternext`.
ru: Классы Python могут определять метод :meth:`!__iter__`, который должен создавать и возвращать новый итератор для объекта; если объект является собственным итератором, этот метод может просто вернуть ``self``. В частности, итераторы обычно являются собственными итераторами. Типы расширений, реализованные в C, могут реализовать функцию :c:member:`~PyTypeObject.tp_iter` для возврата итератора, а типы расширений, которые хотят вести себя как итераторы, могут определить :c:member:`~PyTypeObject.tp_iternext` функция.

source: So, after all this, what do iterators actually do? They have one required method, :meth:`next`, which takes no arguments and returns the next value. When there are no more values to be returned, calling :meth:`next` should raise the :exc:`StopIteration` exception. ::
pt_pt: Então, depois de tudo isto, o que é que os iteradores fazem realmente? Têm um método obrigatório, :meth:`next`, que não recebe argumentos e devolve o próximo valor. Quando não houver mais valores a devolver, chamar :meth:`next` deve gerar a exceção :exc:`StopIteration`. ::
ru: Итак, что же на самом деле делают итераторы после всего этого? У них есть один обязательный метод :meth:`next`, который не принимает аргументов и возвращает следующее значение. Когда больше нет возвращаемых значений, вызов :meth:`next` должен вызвать исключение :exc:`StopIteration`. ::

source: >>> L = [1,2,3] >>> i = iter(L) >>> print i <iterator object at 0x8116870> >>> i.next() 1 >>> i.next() 2 >>> i.next() 3 >>> i.next() Traceback (most recent call last): File "<stdin>", line 1, in ? StopIteration >>>
pt_pt: >>> L = [1,2,3] >>> i = iter(L) >>> print i <objeto iterador em 0x8116870> >>> i.next() 1 >>> i.next() 2 >>> i.next() 3 >>> i.next() Traceback (most recent call last): File "<stdin>", line 1, in ? StopIteration >>>

source: In 2.2, Python's :keyword:`for` statement no longer expects a sequence; it expects something for which :func:`iter` will return an iterator. For backward compatibility and convenience, an iterator is automatically constructed for sequences that don't implement :meth:`!__iter__` or a :c:member:`~PyTypeObject.tp_iter` slot, so ``for i in [1,2,3]`` will still work. Wherever the Python interpreter loops over a sequence, it's been changed to use the iterator protocol. This means you can do things like this::
pt_pt: No Python 2.2, a instrução :keyword:`for` já não espera uma sequência; espera algo para o qual :func:`iter` devolverá um iterador. Por compatibilidade retroativa e conveniência, um iterador é automaticamente construído para sequências que não implementam :meth:`!__iter__` ou um *slot* :c:member:`~PyTypeObject.tp_iter`, pelo que ``for i in [1,2,3]`` continuará a funcionar. Sempre que o interpretador Python percorre uma sequência, foi alterado para usar o protocolo de iterador. Isto significa que pode fazer coisas como isto::
ru: В версии 2.2 оператор Python :keyword:`for` больше не ожидает последовательности; он ожидает чего-то, для чего :func:`iter` вернет итератор. Для обратной совместимости и удобства итератор автоматически создается для последовательностей, которые не реализуют слот :meth:`!__iter__` или слот :c:member:`~PyTypeObject.tp_iter`, поэтому ``for i в [1,2] ,3]`` все равно будет работать. Везде, где интерпретатор Python обрабатывает последовательность, он был изменен для использования протокола итератора. Это означает, что вы можете делать такие вещи::

source: Iterator support has been added to some of Python's basic types. Calling :func:`iter` on a dictionary will return an iterator which loops over its keys::
pt_pt: O suporte para iteradores foi adicionado a alguns dos tipos básicos do Python. Chamar :func:`iter` num dicionário devolverá um iterador que percorre as suas chaves::
ru: Поддержка итераторов была добавлена ​​в некоторые базовые типы Python. Вызов :func:`iter` для словаря вернет итератор, который циклически перебирает его ключи::

source: That's just the default behaviour. If you want to iterate over keys, values, or key/value pairs, you can explicitly call the :meth:`!iterkeys`, :meth:`!itervalues`, or :meth:`!iteritems` methods to get an appropriate iterator. In a minor related change, the :keyword:`in` operator now works on dictionaries, so ``key in dict`` is now equivalent to ``dict.has_key(key)``.
pt_pt: Isto é apenas o comportamento predefinido. Se pretender iterar sobre chaves, valores ou pares chave/valor, pode chamar explicitamente os métodos :meth:`!iterkeys`, :meth:`!itervalues` ou :meth:`!iteritems` para obter um iterador apropriado. Numa alteração relacionada menor, o operador :keyword:`in` agora funciona em dicionários, pelo que ``key in dict`` é agora equivalente a ``dict.has_key(key)``.
ru: Это просто поведение по умолчанию. Если вы хотите перебрать ключи, значения или пары ключ/значение, вы можете явно вызвать методы :meth:`!iterkeys`, :meth:`!itervalues` или :meth:`!iteritems`, чтобы получить соответствующий итератор. Незначительное изменение: оператор :keyword:`in` теперь работает со словарями, поэтому ``key in dict`` теперь эквивалентен ``dict.has_key(key)``.

source: Files also provide an iterator, which calls the :meth:`readline` method until there are no more lines in the file. This means you can now read each line of a file using code like this::
pt_pt: Os ficheiros também fornecem um iterador, que chama o método :meth:`readline` até não haver mais linhas no ficheiro. Isto significa que agora pode ler cada linha de um ficheiro usando código como este::
ru: Файлы также предоставляют итератор, который вызывает метод :meth:`readline` до тех пор, пока в файле не останется строк. Это означает, что теперь вы можете прочитать каждую строку файла, используя такой код:

source: for line in file: # do something for each line ...
pt_pt: for line in file: # fazer algo para cada linha ...

source: Note that you can only go forward in an iterator; there's no way to get the previous element, reset the iterator, or make a copy of it. An iterator object could provide such additional capabilities, but the iterator protocol only requires a :meth:`next` method.
pt_pt: Note que só pode avançar num iterador; não há forma de obter o elemento anterior, reiniciar o iterador ou fazer uma cópia dele. Um objeto iterador poderia fornecer tais capacidades adicionais, mas o protocolo de iterador só requer um método :meth:`next`.
ru: Обратите внимание, что вы можете двигаться вперед только в итераторе; нет возможности получить предыдущий элемент, сбросить итератор или сделать его копию. Объект-итератор может предоставлять такие дополнительные возможности, но для протокола итератора требуется только метод :meth:`next`.

source: :pep:`234` - Iterators
pt_pt: :pep:`234` - Iteradores
ru: :pep:`234` - Итераторы

source: Written by Ka-Ping Yee and GvR; implemented by the Python Labs crew, mostly by GvR and Tim Peters.
pt_pt: Escrito por Ka-Ping Yee e GvR; implementado pela equipa Python Labs, maioritariamente por GvR e Tim Peters.
ru: Авторы сценария Ка-Пинг Йи и GvR; реализован командой Python Labs, в основном GvR и Тимом Питерсом.

source: PEP 255: Simple Generators
pt_pt: PEP 255: Geradores Simples
ru: PEP 255: Простые генераторы

source: Generators are another new feature, one that interacts with the introduction of iterators.
pt_pt: Os geradores são outra funcionalidade nova, que interage com a introdução de iteradores.
ru: Генераторы — еще одна новая функция, связанная с появлением итераторов.

source: You're doubtless familiar with how function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a :keyword:`return` statement, the local variables are destroyed and the resulting value is returned to the caller. A later call to the same function will get a fresh new set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
pt_pt: Sem dúvida que está familiarizado com o funcionamento das chamadas de função em Python ou C. Quando chama uma função, esta obtém um *namespace* privado onde as suas variáveis locais são criadas. Quando a função atinge uma instrução :keyword:`return`, as variáveis locais são destruídas e o valor resultante é devolvido ao chamador. Uma chamada posterior à mesma função obterá um novo conjunto de variáveis locais. Mas, e se as variáveis locais não fossem descartadas ao sair de uma função? E se pudesse retomar a função onde parou? Isto é o que os geradores fornecem; podem ser pensados como funções retomáveis.
ru: Вы, несомненно, знакомы с тем, как работают вызовы функций в Python или C. Когда вы вызываете функцию, она получает частное пространство имен, в котором создаются ее локальные переменные. Когда функция достигает оператора :keyword:`return`, локальные переменные уничтожаются, а полученное значение возвращается вызывающей стороне. Более поздний вызов той же функции получит новый набор локальных переменных. Но что, если бы локальные переменные не удалялись при выходе из функции? Что, если бы вы могли позже возобновить выполнение функции с того места, где она остановилась? Это то, что обеспечивают генераторы; их можно рассматривать как возобновляемые функции.

source: Here's the simplest example of a generator function::
pt_pt: Aqui está o exemplo mais simples de uma função geradora::
ru: Вот простейший пример функции-генератора:

source: A new keyword, :keyword:`yield`, was introduced for generators. Any function containing a :keyword:`!yield` statement is a generator function; this is detected by Python's bytecode compiler which compiles the function specially as a result. Because a new keyword was introduced, generators must be explicitly enabled in a module by including a ``from __future__ import generators`` statement near the top of the module's source code. In Python 2.3 this statement will become unnecessary.
pt_pt: Uma nova palavra-chave, :keyword:`yield`, foi introduzida para os geradores. Qualquer função que contenha uma instrução :keyword:`!yield` é uma função geradora; isto é detetado pelo compilador de *bytecode* do Python, que compila a função de forma especial como resultado. Como uma nova palavra-chave foi introduzida, os geradores devem ser explicitamente ativados num módulo através da inclusão de uma instrução ``from __future__ import generators`` perto do topo do código-fonte do módulo. No Python 2.3, esta instrução tornar-se-á desnecessária.
ru: Для генераторов было введено новое ключевое слово :keyword:`yield`. Любая функция, содержащая оператор :keyword:`!yield`, является функцией-генератором; это обнаруживается компилятором байт-кода Python, который в результате специально компилирует функцию. Поскольку было введено новое ключевое слово, генераторы необходимо явно включить в модуле, включив оператор ``from __future__ importgenerators`` в верхней части исходного кода модуля. В Python 2.3 этот оператор станет ненужным.
