Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.2.po
Languages: pt_pt, ru

source: A new operator, ``//``, is the floor division operator. (Yes, we know it looks like C++'s comment symbol.) ``//`` *always* performs floor division no matter what the types of its operands are, so ``1 // 2`` is 0 and ``1.0 // 2.0`` is also 0.0.
pt_pt: Um novo operador, ``//``, é o operador de divisão por defeito. (Sim, sabemos que parece o símbolo de comentário do C++.) ``//`` *sempre* executa divisão por defeito independentemente dos tipos dos seus operandos, pelo que ``1 // 2`` é 0 e ``1.0 // 2.0`` é também 0.0.
ru: Новый оператор ``//`` является оператором разделения этажей. (Да, мы знаем, что это похоже на символ комментария C++.) ``//`` *всегда* выполняет деление по этажам независимо от типов своих операндов, поэтому ``1 // 2`` равен 0 и ``1.0 // 2.0`` тоже 0.0.

source: ``//`` is always available in Python 2.2; you don't need to enable it using a ``__future__`` statement.
pt_pt: ``//`` está sempre disponível no Python 2.2; não precisa de o ativar usando uma instrução ``__future__``.
ru: ``//`` всегда доступен в Python 2.2; вам не нужно включать его с помощью оператора ``__future__``.

source: By including a ``from __future__ import division`` in a module, the ``/`` operator will be changed to return the result of true division, so ``1/2`` is 0.5. Without the ``__future__`` statement, ``/`` still means classic division. The default meaning of ``/`` will not change until Python 3.0.
pt_pt: Ao incluir ``from __future__ import division`` num módulo, o operador ``/`` será alterado para devolver o resultado da divisão verdadeira, pelo que ``1/2`` é 0.5. Sem a instrução ``__future__``, ``/`` ainda significa divisão clássica. O significado predefinido de ``/`` não mudará até ao Python 3.0.
ru: При включении в модуль деления импорта from __future__ оператор ``/`` будет изменен и будет возвращать результат истинного деления, поэтому ``1/2`` будет равен 0,5. Без оператора ``__future__`` ``/`` по-прежнему означает классическое деление. Значение ``/`` по умолчанию не изменится до версии Python 3.0.

source: Classes can define methods called :meth:`~object.__truediv__` and :meth:`~object.__floordiv__` to overload the two division operators. At the C level, there are also slots in the :c:type:`PyNumberMethods` structure so extension types can define the two operators.
pt_pt: As classes podem definir métodos chamados :meth:`~object.__truediv__` e :meth:`~object.__floordiv__` para sobrecarregar os dois operadores de divisão. Ao nível de C, também existem *slots* na estrutura :c:type:`PyNumberMethods` para que os tipos de extensão possam definir os dois operadores.
ru: Классы могут определять методы :meth:`~object.__truediv__` и :meth:`~object.__floordiv__` для перегрузки двух операторов деления. На уровне C в структуре :c:type:`PyNumberMethods` также есть слоты, поэтому типы расширений могут определять два оператора.

source: Python 2.2 supports some command-line arguments for testing whether code will work with the changed division semantics. Running python with :option:`!-Q warn` will cause a warning to be issued whenever division is applied to two integers. You can use this to find code that's affected by the change and fix it. By default, Python 2.2 will simply perform classic division without a warning; the warning will be turned on by default in Python 2.3.
pt_pt: O Python 2.2 suporta alguns argumentos de linha de comandos para testar se o código funcionará com a semântica de divisão alterada. Executar o Python com :option:`!-Q warn` fará com que seja emitido um aviso sempre que a divisão for aplicada a dois inteiros. Pode usar isto para encontrar código afetado pela alteração e corrigi-lo. Por predefinição, o Python 2.2 executará simplesmente a divisão clássica sem aviso; o aviso será ativado por predefinição no Python 2.3.
ru: Python 2.2 поддерживает некоторые аргументы командной строки для проверки того, будет ли код работать с измененной семантикой деления. Запуск Python с :option:`!-Q alert` приведет к выдаче предупреждения всякий раз, когда деление применяется к двум целым числам. Вы можете использовать это, чтобы найти код, на который повлияло изменение, и исправить его. По умолчанию Python 2.2 просто выполняет классическое деление без предупреждения; предупреждение будет включено по умолчанию в Python 2.3.

source: :pep:`238` - Changing the Division Operator
pt_pt: :pep:`238` - Alteração do Operador de Divisão
ru: :pep:`238` - Смена оператора отдела

source: Written by Moshe Zadka and Guido van Rossum. Implemented by Guido van Rossum..
pt_pt: Escrito por Moshe Zadka e Guido van Rossum. Implementado por Guido van Rossum.
ru: Авторы сценария Моше Задка и Гвидо ван Россум. Реализован Гвидо ван Россум.

source: Unicode Changes
pt_pt: Alterações ao Unicode
ru: Изменения в Юникоде

source: Python's Unicode support has been enhanced a bit in 2.2. Unicode strings are usually stored as UCS-2, as 16-bit unsigned integers. Python 2.2 can also be compiled to use UCS-4, 32-bit unsigned integers, as its internal encoding by supplying :option:`!--enable-unicode=ucs4` to the configure script. (It's also possible to specify :option:`!--disable-unicode` to completely disable Unicode support.)
pt_pt: O suporte a Unicode do Python foi melhorado um pouco no 2.2. As strings Unicode são normalmente armazenadas como UCS-2, como inteiros sem sinal de 16 bits. O Python 2.2 também pode ser compilado para usar UCS-4, inteiros sem sinal de 32 bits, como codificação interna, fornecendo a opção :option:`!--enable-unicode=ucs4` ao script de configuração. (Também é possível especificar :option:`!--disable-unicode` para desativar completamente o suporte a Unicode.)
ru: Поддержка Unicode в Python была немного улучшена в версии 2.2. Строки Юникода обычно хранятся в формате UCS-2, как 16-битные целые числа без знака. Python 2.2 также можно скомпилировать для использования 32-битных беззнаковых целых чисел UCS-4 в качестве внутренней кодировки, указав :option:`!--enable-unicode=ucs4` в скрипте configure. (Также можно указать :option:`!--disable-unicode`, чтобы полностью отключить поддержку Unicode.)

source: When built to use UCS-4 (a "wide Python"), the interpreter can natively handle Unicode characters from U+000000 to U+110000, so the range of legal values for the :func:`!unichr` function is expanded accordingly. Using an interpreter compiled to use UCS-2 (a "narrow Python"), values greater than 65535 will still cause :func:`!unichr` to raise a :exc:`ValueError` exception. This is all described in :pep:`261`, "Support for 'wide' Unicode characters"; consult it for further details.
pt_pt: Quando compilado para usar UCS-4 (um "Python largo"), o interpretador pode lidar nativamente com caracteres Unicode de U+000000 a U+110000, pelo que a gama de valores legais para a função :func:`!unichr` é expandida de acordo. Ao usar um interpretador compilado para usar UCS-2 (um "Python estreito"), valores maiores que 65535 ainda farão com que :func:`!unichr` gere uma exceção :exc:`ValueError`. Isto está tudo descrito no :pep:`261`, "Suporte para caracteres Unicode 'largos'"; consulte-o para mais detalhes.
ru: Если интерпретатор создан для использования UCS-4 («широкий Python»), он может обрабатывать символы Юникода от U+000000 до U+110000, поэтому диапазон допустимых значений для функции :func:`!unichr` соответственно расширяется. . При использовании интерпретатора, скомпилированного для использования UCS-2 («узкий Python»), значения, превышающие 65535, все равно приведут к тому, что :func:`!unichr` вызовет исключение :exc:`ValueError`. Все это описано в :pep:`261`, «Поддержка «широких» символов Юникода»; проконсультируйтесь с ним для получения более подробной информации.

source: Another change is simpler to explain. Since their introduction, Unicode strings have supported an :meth:`!encode` method to convert the string to a selected encoding such as UTF-8 or Latin-1. A symmetric ``decode([*encoding*])`` method has been added to 8-bit strings (though not to Unicode strings) in 2.2. :meth:`!decode` assumes that the string is in the specified encoding and decodes it, returning whatever is returned by the codec.
pt_pt: Outra alteração é mais simples de explicar. Desde a sua introdução, as strings Unicode suportam um método :meth:`!encode` para converter a string numa codificação selecionada, como UTF-8 ou Latin-1. Um método simétrico ``decode([*encoding*])`` foi adicionado às strings de 8 bits (embora não às strings Unicode) no 2.2. :meth:`!decode` assume que a string está na codificação especificada e descodifica-a, devolvendo o que for devolvido pelo *codec*.
ru: Еще одно изменение объяснить проще. С момента своего появления строки Unicode поддерживали метод :meth:`!encode` для преобразования строки в выбранную кодировку, например UTF-8 или Latin-1. Симметричный метод ``decode([*encoding*])`` был добавлен к 8-битным строкам (но не к строкам Unicode) в версии 2.2. :meth:`!decode` предполагает, что строка имеет указанную кодировку, и декодирует ее, возвращая все, что возвращает кодек.

source: Using this new feature, codecs have been added for tasks not directly related to Unicode. For example, codecs have been added for uu-encoding, MIME's base64 encoding, and compression with the :mod:`zlib` module::
pt_pt: Usando esta nova funcionalidade, *codecs* foram adicionados para tarefas não diretamente relacionadas com Unicode. Por exemplo, *codecs* foram adicionados para codificação uu, codificação base64 do MIME e compressão com o módulo :mod:`zlib`::
ru: Благодаря этой новой функции были добавлены кодеки для задач, не связанных напрямую с Unicode. Например, были добавлены кодеки для кодирования uu, кодирования MIME base64 и сжатия с помощью модуля :mod:`zlib`::

source: >>> s = """Here is a lengthy piece of redundant, overly verbose, ... and repetitive text. ... """ >>> data = s.encode('zlib') >>> data 'x\x9c\r\xc9\xc1\r\x80 \x10\x04\xc0?Ul...' >>> data.decode('zlib') 'Here is a lengthy piece of redundant, overly verbose,\nand repetitive text.\n' >>> print s.encode('uu') begin 666 <data> M2&5R92!I<R!A(&QE;F=T:'D@<&EE8V4@;V8@<F5D=6YD86YT+"!O=F5R;'D@ >=F5R8F]S92P*86YD(')E<&5T:71I=F4@=&5X="X* end >>> "sheesh".encode('rot-13') 'furrfu'
pt_pt: >>> s = """Aqui está um longo texto redundante, excessivamente prolixo, ... e repetitivo. ... """ >>> data = s.encode('zlib') >>> data 'x\x9c\r\xc9\xc1\r\x80 \x10\x04\xc0?Ul...' >>> data.decode('zlib') 'Aqui está um longo texto redundante, excessivamente prolixo,\ne repetitivo.\n' >>> print s.encode('uu') begin 666 <data> M2&5R92!I<R!A(&QE;F=T:'D@<&EE8V4@;V8@<F5D=6YD86YT+"!O=F5R;'D@ >=F5R8F]S92P*86YD(')E<&5T:71I=F4@=&5X="X* end >>> "caramba".encode('rot-13') 'penzno'

source: To convert a class instance to Unicode, a :meth:`!__unicode__` method can be defined by a class, analogous to :meth:`!__str__`.
pt_pt: Para converter uma instância de classe para Unicode, um método :meth:`!__unicode__` pode ser definido por uma classe, de forma análoga a :meth:`!__str__`.
ru: Чтобы преобразовать экземпляр класса в Юникод, в классе может быть определен метод :meth:`!__unicode__`, аналогичный :meth:`!__str__`.

source: :meth:`!encode`, :meth:`!decode`, and :meth:`!__unicode__` were implemented by Marc-André Lemburg. The changes to support using UCS-4 internally were implemented by Fredrik Lundh and Martin von Löwis.
pt_pt: :meth:`!encode`, :meth:`!decode` e :meth:`!__unicode__` foram implementados por Marc-André Lemburg. As alterações para suportar o uso interno de UCS-4 foram implementadas por Fredrik Lundh e Martin von Löwis.
ru: :meth:`!encode`, :meth:`!decode` и :meth:`!__unicode__` были реализованы Марком-Андре Лембургом. Изменения для внутренней поддержки использования UCS-4 были реализованы Фредриком Лундом и Мартином фон Лёвисом.

source: :pep:`261` - Support for 'wide' Unicode characters
pt_pt: :pep:`261` - Suporte para caracteres Unicode 'largos'
ru: :pep:`261` - Поддержка «широких» символов Юникода.

source: Written by Paul Prescod.
pt_pt: Escrito por Paul Prescod.
ru: Автор сценария Пол Прескод.

source: PEP 227: Nested Scopes
pt_pt: PEP 227: Âmbitos Aninhados
ru: PEP 227: Вложенные области видимости

source: In Python 2.1, statically nested scopes were added as an optional feature, to be enabled by a ``from __future__ import nested_scopes`` directive. In 2.2 nested scopes no longer need to be specially enabled, and are now always present. The rest of this section is a copy of the description of nested scopes from my "What's New in Python 2.1" document; if you read it when 2.1 came out, you can skip the rest of this section.
pt_pt: No Python 2.1, os âmbitos aninhados estáticos foram adicionados como uma funcionalidade opcional, para ser ativada por uma diretiva ``from __future__ import nested_scopes``. No Python 2.2, os âmbitos aninhados já não precisam de ser ativados especialmente e estão agora sempre presentes. O resto desta secção é uma cópia da descrição dos âmbitos aninhados do meu documento "Novidades do Python 2.1"; se o leu quando o 2.1 foi lançado, pode saltar o resto desta secção.
ru: В Python 2.1 статически вложенные области были добавлены в качестве дополнительной функции, которая включается директивой from __future__ importnested_scopes. В версии 2.2 вложенные области больше не требуют специального включения, и теперь они присутствуют всегда. Оставшаяся часть этого раздела представляет собой копию описания вложенных областей видимости из моего документа «Что нового в Python 2.1»; если вы прочитали его, когда вышла версия 2.1, вы можете пропустить остальную часть этого раздела.

source: The largest change introduced in Python 2.1, and made complete in 2.2, is to Python's scoping rules. In Python 2.0, at any given time there are at most three namespaces used to look up variable names: local, module-level, and the built-in namespace. This often surprised people because it didn't match their intuitive expectations. For example, a nested recursive function definition doesn't work::
pt_pt: A maior alteração introduzida no Python 2.1, e completada no 2.2, é às regras de âmbito do Python. No Python 2.0, em qualquer momento, existiam no máximo três *namespaces* para procurar nomes de variáveis: local, ao nível do módulo e o *namespace* integrado. Isto muitas vezes surpreendia as pessoas porque não correspondia às suas expetativas intuitivas. Por exemplo, uma definição de função recursiva aninhada não funcionava::
ru: Самое большое изменение, представленное в Python 2.1 и завершенное в версии 2.2, касается правил области действия Python. В Python 2.0 в любой момент времени для поиска имен переменных используется не более трех пространств имен: локальное, на уровне модуля и встроенное пространство имен. Это часто удивляло людей, поскольку не соответствовало их интуитивным ожиданиям. Например, определение вложенной рекурсивной функции не работает::

source: def f(): ... def g(value): ... return g(value-1) + 1 ...
pt_pt: def f(): ... def g(valor): ... return g(valor-1) + 1 ...

source: The function :func:`!g` will always raise a :exc:`NameError` exception, because the binding of the name ``g`` isn't in either its local namespace or in the module-level namespace. This isn't much of a problem in practice (how often do you recursively define interior functions like this?), but this also made using the :keyword:`lambda` expression clumsier, and this was a problem in practice. In code which uses :keyword:`!lambda` you can often find local variables being copied by passing them as the default values of arguments. ::
pt_pt: A função :func:`!g` irá sempre gerar uma exceção :exc:`NameError`, porque a ligação do nome ``g`` não está no seu *namespace* local nem no *namespace* ao nível do módulo. Isto não é um grande problema na prática (com que frequência define funções interiores recursivas assim?), mas isto também tornava o uso da expressão :keyword:`lambda` mais complicado, o que era um problema real. Em código que usa :keyword:`!lambda`, é comum encontrar variáveis locais copiadas ao passá-las como valores predefinidos de argumentos. ::
ru: Функция :func:`!g` всегда будет вызывать исключение :exc:`NameError`, поскольку привязка имени ``g`` не находится ни в ее локальном пространстве имен, ни в пространстве имен уровня модуля. На практике это не такая уж большая проблема (как часто вы рекурсивно определяете такие внутренние функции?), но это также делало использование выражения :keyword:`lambda` более неуклюжим, и это было проблемой на практике. В коде, который использует :keyword:`!lambda`, вы часто можете обнаружить, что локальные переменные копируются, передавая их в качестве значений аргументов по умолчанию. ::

source: def find(self, name): "Return list of any entries equal to 'name'" L = filter(lambda x, name=name: x == name, self.list_attribute) return L
pt_pt: def find(self, nome): "Devolve uma lista de entradas iguais a 'nome'" L = filter(lambda x, nome=nome: x == nome, self.list_attribute) return L

source: The readability of Python code written in a strongly functional style suffers greatly as a result.
pt_pt: A legibilidade do código Python escrito num estilo fortemente funcional fica muito comprometida.
ru: В результате читаемость кода Python, написанного в строго функциональном стиле, сильно страдает.

source: The most significant change to Python 2.2 is that static scoping has been added to the language to fix this problem. As a first effect, the ``name=name`` default argument is now unnecessary in the above example. Put simply, when a given variable name is not assigned a value within a function (by an assignment, or the :keyword:`def`, :keyword:`class`, or :keyword:`import` statements), references to the variable will be looked up in the local namespace of the enclosing scope. A more detailed explanation of the rules, and a dissection of the implementation, can be found in the PEP.
pt_pt: A alteração mais significativa no Python 2.2 é a adição de âmbitos estáticos à linguagem para resolver este problema. Como primeiro efeito, o argumento predefinido ``name=name`` já não é necessário no exemplo acima. Em resumo, quando um nome de variável não recebe um valor dentro de uma função (por atribuição, ou através das instruções :keyword:`def`, :keyword:`class`, ou :keyword:`import`), as referências à variável serão procuradas no *namespace* local do âmbito que a contém. Uma explicação mais detalhada das regras e uma análise da implementação podem ser encontradas no PEP.
ru: Самым значительным изменением в Python 2.2 является то, что для решения этой проблемы в язык добавлена ​​статическая область видимости. Во-первых, аргумент по умолчанию ``name=name`` в приведенном выше примере теперь не нужен. Проще говоря, когда данному имени переменной не присвоено значение внутри функции (присвоением или операторами :keyword:`def`, :keyword:`class` или :keyword:`import`), ссылки на переменная будет искаться в локальном пространстве имен охватывающей области. Более подробное объяснение правил и анализ реализации можно найти в PEP.

source: This change may cause some compatibility problems for code where the same variable name is used both at the module level and as a local variable within a function that contains further function definitions. This seems rather unlikely though, since such code would have been pretty confusing to read in the first place.
pt_pt: Esta alteração pode causar alguns problemas de compatibilidade em código onde o mesmo nome de variável é usado ao nível do módulo e como variável local dentro de uma função que contém outras definições de funções. No entanto, isto parece pouco provável, pois esse tipo de código já seria confuso de ler.
ru: Это изменение может вызвать некоторые проблемы совместимости для кода, в котором одно и то же имя переменной используется как на уровне модуля, так и в качестве локальной переменной внутри функции, содержащей дальнейшие определения функций. Однако это кажется маловероятным, поскольку такой код изначально было бы довольно сложно читать.

source: One side effect of the change is that the ``from module import *`` and ``exec`` statements have been made illegal inside a function scope under certain conditions. The Python reference manual has said all along that ``from module import *`` is only legal at the top level of a module, but the CPython interpreter has never enforced this before. As part of the implementation of nested scopes, the compiler which turns Python source into bytecodes has to generate different code to access variables in a containing scope. ``from module import *`` and ``exec`` make it impossible for the compiler to figure this out, because they add names to the local namespace that are unknowable at compile time. Therefore, if a function contains function definitions or :keyword:`lambda` expressions with free variables, the compiler will flag this by raising a :exc:`SyntaxError` exception.
pt_pt: Um efeito secundário desta alteração é que as instruções ``from module import *`` e ``exec`` foram tornadas ilegais dentro de um âmbito de função em certas condições. O manual de referência do Python sempre afirmou que ``from module import *`` só é legal ao nível superior de um módulo, mas o interpretador CPython nunca impôs esta regra. Como parte da implementação dos âmbitos aninhados, o compilador que converte o código-fonte Python em *bytecodes* tem de gerar código diferente para aceder a variáveis num âmbito contido. As instruções ``from module import *`` e ``exec`` tornam impossível para o compilador determinar isto, pois adicionam nomes ao *namespace* local que são desconhecidos em tempo de compilação. Portanto, se uma função contiver definições de funções ou expressões :keyword:`lambda` com variáveis livres, o compilador irá sinalizar isto ao gerar uma exceção :exc:`SyntaxError`.
ru: Одним из побочных эффектов изменения является то, что операторы from Module import * и exec стали недопустимыми внутри области функции при определенных условиях. В справочном руководстве Python всегда говорилось, что ``from Module import *`` допустимо только на верхнем уровне модуля, но интерпретатор CPython никогда раньше не применял это. В рамках реализации вложенных областей компилятор, который преобразует исходный код Python в байт-коды, должен генерировать другой код для доступа к переменным в содержащей области. ``from Module import *`` и ``exec`` не позволяют компилятору это выяснить, поскольку они добавляют в локальное пространство имен имена, которые неизвестны во время компиляции. Следовательно, если функция содержит определения функций или выражения :keyword:`lambda` со свободными переменными, компилятор пометит это, вызвав исключение :exc:`SyntaxError`.

source: To make the preceding explanation a bit clearer, here's an example::
pt_pt: Para tornar a explicação anterior mais clara, aqui está um exemplo::
ru: Чтобы сделать предыдущее объяснение более понятным, приведем пример:

source: x = 1 def f(): # The next line is a syntax error exec 'x=2' def g(): return x
pt_pt: x = 1 def f(): # A linha seguinte é um erro de sintaxe exec 'x=2' def g(): return x

source: Line 4 containing the ``exec`` statement is a syntax error, since ``exec`` would define a new local variable named ``x`` whose value should be accessed by :func:`!g`.
pt_pt: A linha 4 que contém a instrução ``exec`` é um erro de sintaxe, pois ``exec`` definiria uma nova variável local chamada ``x`` cujo valor seria acedido por :func:`!g`.
ru: Строка 4, содержащая оператор ``exec``, является синтаксической ошибкой, поскольку ``exec`` определит новую локальную переменную с именем ``x``, к значению которой должен обращаться :func:`!g`.
