Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.2.po
Languages: pt_pt, ru

source: What's New in Python 2.2
pt_pt: Novidades do Python 2.2
ru: Что нового в Python 2.2

source: Author
pt_pt: Autor
ru: Автор

source: Introduction
pt_pt: Introdução
ru: Введение

source: This article explains the new features in Python 2.2.2, released on October 14, 2002. Python 2.2.2 is a bugfix release of Python 2.2, originally released on December 21, 2001.
pt_pt: Este artigo explica as novas funcionalidades do Python 2.2.2, lançado a 14 de outubro de 2002. O Python 2.2.2 é uma versão de correção de *bugs* do Python 2.2, originalmente lançado a 21 de dezembro de 2001.
ru: В этой статье описываются новые функции Python 2.2.2, выпущенного 14 октября 2002 г. Python 2.2.2 — это версия Python 2.2 с исправлением ошибок, первоначально выпущенная 21 декабря 2001 г.

source: Python 2.2 can be thought of as the "cleanup release". There are some features such as generators and iterators that are completely new, but most of the changes, significant and far-reaching though they may be, are aimed at cleaning up irregularities and dark corners of the language design.
pt_pt: O Python 2.2 pode ser considerado como a versão de "limpeza". Existem algumas funcionalidades, como geradores e iteradores, que são completamente novas, mas a maioria das alterações, embora significativas e abrangentes, visam limpar irregularidades e aspectos obscuros do projeto da linguagem.
ru: Python 2.2 можно рассматривать как «очистку». Некоторые функции, такие как генераторы и итераторы, являются совершенно новыми, но большинство изменений, какими бы значительными и далеко идущими они ни были, направлены на устранение неровностей и темных уголков конструкции языка.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.2, such as the `Python Library Reference <https://docs.python.org/2.2/lib/lib.html>`_ and the `Python Reference Manual <https://docs.python.org/2.2/ref/ref.html>`_. If you want to understand the complete implementation and design rationale for a change, refer to the PEP for a particular new feature.
pt_pt: Este artigo não tenta fornecer uma especificação completa das novas funcionalidades, mas oferece uma visão geral conveniente. Para detalhes completos, deve consultar a documentação do Python 2.2, como a `Referência da Biblioteca Python <https://docs.python.org/2.2/lib/lib.html>`_ e o `Manual de Referência do Python <https://docs.python.org/2.2/ref/ref.html>`_. Se pretender compreender a implementação completa e a justificação de projeto de uma alteração, consulte o PEP da funcionalidade em questão.
ru: В этой статье не делается попытка предоставить полную спецификацию новых функций, а вместо этого представлен удобный обзор. Для получения полной информации обратитесь к документации по Python 2.2, например, «Справочник по библиотеке Python <https://docs.python.org/2.2/lib/lib.html>» и «Справочное руководство по Python <https». ://docs.python.org/2.2/ref/ref.html>`_. Если вы хотите понять полную реализацию и обоснование изменения, обратитесь к PEP за конкретной новой функцией.

source: PEPs 252 and 253: Type and Class Changes
pt_pt: PEPs 252 e 253: Alterações a Tipos e Classes
ru: Политические деятели 252 и 253: изменения типа и класса

source: The largest and most far-reaching changes in Python 2.2 are to Python's model of objects and classes. The changes should be backward compatible, so it's likely that your code will continue to run unchanged, but the changes provide some amazing new capabilities. Before beginning this, the longest and most complicated section of this article, I'll provide an overview of the changes and offer some comments.
pt_pt: As maiores e mais abrangentes alterações no Python 2.2 são ao modelo de objetos e classes. As alterações devem ser retrocompatíveis, pelo que é provável que o seu código continue a funcionar sem alterações, mas as alterações fornecem algumas capacidades novas incríveis. Antes de começar esta secção, a mais longa e complexa deste artigo, vou fornecer uma visão geral das alterações e fazer alguns comentários.
ru: Самые большие и далеко идущие изменения в Python 2.2 касаются модели объектов и классов Python. Изменения должны быть обратно совместимыми, поэтому вполне вероятно, что ваш код продолжит работать без изменений, но эти изменения открывают некоторые удивительные новые возможности. Прежде чем приступить к самому длинному и сложному разделу этой статьи, я представлю обзор изменений и дам несколько комментариев.

source: A long time ago I wrote a web page listing flaws in Python's design. One of the most significant flaws was that it's impossible to subclass Python types implemented in C. In particular, it's not possible to subclass built-in types, so you can't just subclass, say, lists in order to add a single useful method to them. The :mod:`!UserList` module provides a class that supports all of the methods of lists and that can be subclassed further, but there's lots of C code that expects a regular Python list and won't accept a :class:`~collections.UserList` instance.
pt_pt: Há muito tempo, escrevi uma página web que listava falhas no projeto do Python. Uma das falhas mais significativas era a impossibilidade de criar subclasses de tipos Python implementados em C. Em particular, não era possível criar subclasses de tipos integrados, pelo que não era possível, por exemplo, criar subclasses de listas para adicionar um único método útil. O módulo :mod:`!UserList` fornece uma classe que suporta todos os métodos de listas e que pode ser subclassificada, mas existe muito código em C que espera uma lista Python normal e não aceita uma instância de :class:`~collections.UserList`.
ru: Давным-давно я написал веб-страницу со списком недостатков дизайна Python. Одним из наиболее существенных недостатков было то, что невозможно создать подклассы типов Python, реализованных в C. В частности, невозможно создать подклассы для встроенных типов, поэтому вы не можете просто подклассифицировать, скажем, списки, чтобы добавить один полезный метод. им. Модуль :mod:`!UserList` предоставляет класс, который поддерживает все методы списков и может быть подклассифицирован далее, но существует много кода C, который ожидает обычный список Python и не принимает :class:`~ экземпляр коллекции.UserList`.

source: Python 2.2 fixes this, and in the process adds some exciting new capabilities. A brief summary:
pt_pt: O Python 2.2 resolve isto e, no processo, adiciona algumas capacidades novas e empolgantes. Um breve resumo:
ru: Python 2.2 исправляет это и попутно добавляет несколько интересных новых возможностей. Краткое содержание:

source: You can subclass built-in types such as lists and even integers, and your subclasses should work in every place that requires the original type.
pt_pt: Pode criar subclasses de tipos integrados, como listas e até inteiros, e as suas subclasses devem funcionar em todos os locais que requerem o tipo original.
ru: Вы можете подклассифицировать встроенные типы, такие как списки и даже целые числа, и ваши подклассы должны работать везде, где требуется исходный тип.

source: It's now possible to define static and class methods, in addition to the instance methods available in previous versions of Python.
pt_pt: Agora é possível definir métodos estáticos e de classe, além dos métodos de instância disponíveis em versões anteriores do Python.
ru: Теперь можно определять статические методы и методы класса в дополнение к методам экземпляра, доступным в предыдущих версиях Python.

source: It's also possible to automatically call methods on accessing or setting an instance attribute by using a new mechanism called :dfn:`properties`. Many uses of :meth:`~object.__getattr__` can be rewritten to use properties instead, making the resulting code simpler and faster. As a small side benefit, attributes can now have docstrings, too.
pt_pt: Também é possível chamar automaticamente métodos ao aceder ou definir um atributo de instância usando um novo mecanismo chamado :dfn:`propriedades`. Muitos usos de :meth:`~object.__getattr__` podem ser reescritos para usar propriedades, tornando o código resultante mais simples e rápido. Como benefício adicional, os atributos também podem ter *docstrings*.
ru: Также возможно автоматически вызывать методы при доступе или установке атрибута экземпляра, используя новый механизм под названием :dfn:`properties`. Многие варианты использования :meth:`~object.__getattr__` можно переписать, чтобы вместо этого использовать свойства, что делает результирующий код проще и быстрее. В качестве небольшого дополнительного преимущества теперь атрибуты также могут иметь строки документации.

source: The list of legal attributes for an instance can be limited to a particular set using :dfn:`slots`, making it possible to safeguard against typos and perhaps make more optimizations possible in future versions of Python.
pt_pt: A lista de atributos legais para uma instância pode ser limitada a um conjunto específico usando :dfn:`slots`, tornando possível proteger contra erros de digitação e possibilitar mais otimizações em versões futuras do Python.
ru: Список допустимых атрибутов для экземпляра может быть ограничен определенным набором с помощью :dfn:`slots`, что позволяет защититься от опечаток и, возможно, сделать возможным дополнительную оптимизацию в будущих версиях Python.

source: Some users have voiced concern about all these changes. Sure, they say, the new features are neat and lend themselves to all sorts of tricks that weren't possible in previous versions of Python, but they also make the language more complicated. Some people have said that they've always recommended Python for its simplicity, and feel that its simplicity is being lost.
pt_pt: Alguns utilizadores expressaram preocupação com todas estas alterações. Claro, dizem eles, as novas funcionalidades são interessantes e permitem todo o tipo de truques que não eram possíveis em versões anteriores do Python, mas também tornam a linguagem mais complexa. Algumas pessoas disseram que sempre recomendaram o Python pela sua simplicidade e sentem que essa simplicidade está a ser perdida.
ru: Некоторые пользователи выразили обеспокоенность по поводу всех этих изменений. Конечно, говорят они, новые функции удобны и позволяют использовать всевозможные трюки, которые были невозможны в предыдущих версиях Python, но они также усложняют язык. Некоторые люди говорят, что они всегда рекомендовали Python из-за его простоты, и чувствуют, что его простота теряется.

source: Personally, I think there's no need to worry. Many of the new features are quite esoteric, and you can write a lot of Python code without ever needed to be aware of them. Writing a simple class is no more difficult than it ever was, so you don't need to bother learning or teaching them unless they're actually needed. Some very complicated tasks that were previously only possible from C will now be possible in pure Python, and to my mind that's all for the better.
pt_pt: Pessoalmente, acho que não há motivo para preocupação. Muitas das novas funcionalidades são bastante esotéricas, e pode escrever muito código Python sem nunca precisar de as conhecer. Escrever uma classe simples não é mais difícil do que sempre foi, pelo que não precisa de se preocupar em aprender ou ensinar estas funcionalidades a menos que sejam realmente necessárias. Algumas tarefas muito complexas que antes só eram possíveis em C agora são possíveis em Python puro, e, na minha opinião, isso é tudo para melhor.
ru: Лично я считаю, что беспокоиться не стоит. Многие из новых функций довольно эзотеричны, и вы можете написать много кода Python, даже не зная о них. Написать простой класс не сложнее, чем когда-либо, поэтому вам не нужно беспокоиться об их изучении или преподавании, если они действительно не нужны. Некоторые очень сложные задачи, которые раньше были возможны только на C, теперь будут возможны на чистом Python, и, на мой взгляд, это все к лучшему.

source: I'm not going to attempt to cover every single corner case and small change that were required to make the new features work. Instead this section will paint only the broad strokes. See section :ref:`sect-rellinks`, "Related Links", for further sources of information about Python 2.2's new object model.
pt_pt: Não vou tentar abordar todos os casos específicos e pequenas alterações que foram necessárias para fazer as novas funcionalidades funcionarem. Em vez disso, esta secção apresentará apenas os traços gerais. Consulte a secção :ref:`sect-rellinks`, "Ligações Relacionadas", para mais fontes de informação sobre o novo modelo de objetos do Python 2.2.
ru: Я не собираюсь описывать каждый отдельный случай и небольшие изменения, необходимые для работы новых функций. Вместо этого в этом разделе будут описаны только общие мазки. Дополнительные источники информации о новой объектной модели Python 2.2 см. в разделе :ref:`sect-rellinks`, «Ссылки по теме».

source: Old and New Classes
pt_pt: Classes Antigas e Novas
ru: Старые и новые классы

source: First, you should know that Python 2.2 really has two kinds of classes: classic or old-style classes, and new-style classes. The old-style class model is exactly the same as the class model in earlier versions of Python. All the new features described in this section apply only to new-style classes. This divergence isn't intended to last forever; eventually old-style classes will be dropped, possibly in Python 3.0.
pt_pt: Primeiro, deve saber que o Python 2.2 tem realmente dois tipos de classes: classes clássicas ou do estilo antigo, e classes do novo estilo. O modelo de classes do estilo antigo é exatamente o mesmo que o modelo de classes em versões anteriores do Python. Todas as novas funcionalidades descritas nesta secção aplicam-se apenas a classes do novo estilo. Esta divergência não é destinada a durar para sempre; eventualmente, as classes do estilo antigo serão removidas, possivelmente no Python 3.0.
ru: Во-первых, вы должны знать, что в Python 2.2 действительно есть два типа классов: классические классы, или классы старого стиля, и классы нового стиля. Модель классов старого стиля точно такая же, как модель классов в более ранних версиях Python. Все новые возможности, описанные в этом разделе, применимы только к классам нового стиля. Это расхождение не должно длиться вечно; со временем классы старого стиля будут удалены, возможно, в Python 3.0.

source: So how do you define a new-style class? You do it by subclassing an existing new-style class. Most of Python's built-in types, such as integers, lists, dictionaries, and even files, are new-style classes now. A new-style class named :class:`object`, the base class for all built-in types, has also been added so if no built-in type is suitable, you can just subclass :class:`object`::
pt_pt: Como definir uma classe do novo estilo? Faz-se isso ao criar uma subclasse de uma classe do novo estilo existente. A maioria dos tipos integrados do Python, como inteiros, listas, dicionários e até ficheiros, são agora classes do novo estilo. Foi também adicionada uma classe do novo estilo chamada :class:`object`, a classe base para todos os tipos integrados, pelo que, se nenhum tipo integrado for adequado, pode simplesmente criar uma subclasse de :class:`object`::
ru: Так как же определить класс нового стиля? Вы делаете это путем создания подкласса существующего класса нового стиля. Большинство встроенных типов Python, таких как целые числа, списки, словари и даже файлы, теперь являются классами нового стиля. Также был добавлен класс нового стиля с именем :class:`object`, базовый класс для всех встроенных типов, поэтому, если ни один встроенный тип не подходит, вы можете просто создать подкласс :class:`object`::

source: This means that :keyword:`class` statements that don't have any base classes are always classic classes in Python 2.2. (Actually you can also change this by setting a module-level variable named :attr:`!__metaclass__` --- see :pep:`253` for the details --- but it's easier to just subclass :class:`object`.)
pt_pt: Isto significa que as instruções :keyword:`class` que não têm classes base são sempre classes clássicas no Python 2.2. (Na verdade, também pode alterar isto ao definir uma variável ao nível do módulo chamada :attr:`!__metaclass__` — consulte o :pep:`253` para mais detalhes — mas é mais fácil simplesmente criar uma subclasse de :class:`object`.)
ru: Это означает, что операторы :keyword:`class`, не имеющие базовых классов, всегда являются классическими классами Python 2.2. (На самом деле вы также можете изменить это, установив переменную уровня модуля с именем :attr:`!__metaclass__` --- подробности см. в :pep:`253` --- но проще создать подкласс :class:`object` .)

source: The type objects for the built-in types are available as built-ins, named using a clever trick. Python has always had built-in functions named :func:`int`, :func:`float`, and :func:`str`. In 2.2, they aren't functions any more, but type objects that behave as factories when called. ::
pt_pt: Os objetos de tipo para os tipos integrados estão disponíveis como integrados, usando um truque engenhoso. O Python sempre teve funções integradas chamadas :func:`int`, :func:`float` e :func:`str`. No Python 2.2, já não são funções, mas objetos de tipo que se comportam como fábricas quando chamados. ::
ru: Объекты типов для встроенных типов доступны как встроенные, им присвоены хитрые имена. В Python всегда были встроенные функции с именами :func:`int`, :func:`float` и :func:`str`. В версии 2.2 они больше не являются функциями, а являются объектами типов, которые при вызове ведут себя как фабрики. ::

source: To make the set of types complete, new type objects such as :func:`dict` and :func:`!file` have been added. Here's a more interesting example, adding a :meth:`!lock` method to file objects::
pt_pt: Para completar o conjunto de tipos, foram adicionados novos objetos de tipo, como :func:`dict` e :func:`!file`. Aqui está um exemplo mais interessante, adicionando um método :meth:`!lock` a objetos de ficheiro::
ru: Чтобы сделать набор типов полным, были добавлены новые объекты типов, такие как :func:`dict` и :func:`!file`. Вот более интересный пример добавления метода :meth:`!lock` к файловым объектам::

source: The now-obsolete :mod:`!posixfile` module contained a class that emulated all of a file object's methods and also added a :meth:`!lock` method, but this class couldn't be passed to internal functions that expected a built-in file, something which is possible with our new :class:`!LockableFile`.
pt_pt: O módulo :mod:`!posixfile`, agora obsoleto, continha uma classe que emulava todos os métodos de um objeto de ficheiro e também adicionava um método :meth:`!lock`, mas esta classe não podia ser passada a funções internas que esperavam um ficheiro integrado, algo que é possível com o nosso novo :class:`!LockableFile`.
ru: Устаревший модуль :mod:`!posixfile` содержал класс, который эмулировал все методы файлового объекта, а также добавлял метод :meth:`!lock`, но этот класс нельзя было передать внутренним функциям, которые ожидали встроенный файл, что возможно с нашим новым :class:`!LockableFile`.

source: Descriptors
pt_pt: Descritores
ru: Дескрипторы

source: In previous versions of Python, there was no consistent way to discover what attributes and methods were supported by an object. There were some informal conventions, such as defining :attr:`!__members__` and :attr:`!__methods__` attributes that were lists of names, but often the author of an extension type or a class wouldn't bother to define them. You could fall back on inspecting the :attr:`~object.__dict__` of an object, but when class inheritance or an arbitrary :meth:`!__getattr__` hook were in use this could still be inaccurate.
pt_pt: Em versões anteriores do Python, não havia uma forma consistente de descobrir quais atributos e métodos eram suportados por um objeto. Existiam algumas convenções informais, como definir atributos :attr:`!__members__` e :attr:`!__methods__` que eram listas de nomes, mas muitas vezes o autor de um tipo de extensão ou de uma classe não se dava ao trabalho de os definir. Podia recorrer à inspeção do :attr:`~object.__dict__` de um objeto, mas quando a herança de classes ou um *hook* arbitrário :meth:`!__getattr__` estavam em uso, isto ainda podia ser impreciso.
ru: В предыдущих версиях Python не было единого способа узнать, какие атрибуты и методы поддерживаются объектом. Существовали некоторые неофициальные соглашения, такие как определение атрибутов :attr:`!__members__` и :attr:`!__methods__`, которые представляли собой списки имен, но часто автор типа расширения или класса не утруждал себя их определением. Вы могли бы вернуться к проверке :attr:`~object.__dict__` объекта, но когда использовалось наследование класса или произвольный :meth:`!__getattr__`, это все равно могло быть неточным.

source: The one big idea underlying the new class model is that an API for describing the attributes of an object using :dfn:`descriptors` has been formalized. Descriptors specify the value of an attribute, stating whether it's a method or a field. With the descriptor API, static methods and class methods become possible, as well as more exotic constructs.
pt_pt: A grande ideia subjacente ao novo modelo de classes é que uma API para descrever os atributos de um objeto usando :dfn:`descritores` foi formalizada. Os descritores especificam o valor de um atributo, indicando se é um método ou um campo. Com a API de descritores, métodos estáticos e de classe tornam-se possíveis, bem como construções mais exóticas.
ru: Основная идея, лежащая в основе новой модели классов, заключается в том, что был формализован API для описания атрибутов объекта с помощью :dfn:`дескрипторов`. Дескрипторы определяют значение атрибута, указывая, является ли это методом или полем. Благодаря дескрипторному API становятся возможными статические методы и методы классов, а также более экзотические конструкции.

source: Attribute descriptors are objects that live inside class objects, and have a few attributes of their own:
pt_pt: Os descritores de atributos são objetos que residem dentro de objetos de classe e têm alguns atributos próprios:
ru: Дескрипторы атрибутов — это объекты, которые живут внутри объектов классов и имеют несколько собственных атрибутов:

source: :attr:`~definition.__name__` is the attribute's name.
pt_pt: :attr:`~definition.__name__` é o nome do atributo.
ru: :attr:`~definition.__name__` — имя атрибута.

source: :attr:`~definition.__doc__` is the attribute's docstring.
pt_pt: :attr:`~definition.__doc__` é a *docstring* do atributo.

source: ``__get__(object)`` is a method that retrieves the attribute value from *object*.
pt_pt: ``__get__(object)`` é um método que recupera o valor do atributo de *object*.
ru: ``__get__(object)`` — это метод, который извлекает значение атрибута из *object*.

source: ``__set__(object, value)`` sets the attribute on *object* to *value*.
pt_pt: ``__set__(object, value)`` define o atributo em *object* para *value*.
ru: ``__set__(object, value)`` устанавливает атрибут *object* в *value*.

source: ``__delete__(object, value)`` deletes the *value* attribute of *object*.
pt_pt: ``__delete__(object, value)`` elimina o atributo *value* de *object*.
ru: ``__delete__(object, value)`` удаляет атрибут *value* объекта *object*.

source: For example, when you write ``obj.x``, the steps that Python actually performs are::
pt_pt: Por exemplo, quando escreve ``obj.x``, os passos que o Python executa são::
ru: Например, когда вы пишете ``obj.x``, Python фактически выполняет следующие шаги:
