Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.2.po
Languages: pt_pt, ru

source: For methods, :meth:`descriptor.__get__ <object.__get__>` returns a temporary object that's callable, and wraps up the instance and the method to be called on it. This is also why static methods and class methods are now possible; they have descriptors that wrap up just the method, or the method and the class. As a brief explanation of these new kinds of methods, static methods aren't passed the instance, and therefore resemble regular functions. Class methods are passed the class of the object, but not the object itself. Static and class methods are defined like this::
pt_pt: Para métodos, :meth:`descriptor.__get__ <object.__get__>` devolve um objeto temporário que é chamável e encapsula a instância e o método a ser chamado nela. Isto também explica por que métodos estáticos e de classe são agora possíveis; eles têm descritores que encapsulam apenas o método, ou o método e a classe. Como breve explicação destes novos tipos de métodos, métodos estáticos não recebem a instância e, portanto, assemelham-se a funções normais. Métodos de classe recebem a classe do objeto, mas não o objeto em si. Métodos estáticos e de classe são definidos assim::

source: The :func:`staticmethod` function takes the function :func:`!f`, and returns it wrapped up in a descriptor so it can be stored in the class object. You might expect there to be special syntax for creating such methods (``def static f``, ``defstatic f()``, or something like that) but no such syntax has been defined yet; that's been left for future versions of Python.
pt_pt: A função :func:`staticmethod` recebe a função :func:`!f` e devolve-a encapsulada num descritor para que possa ser armazenada no objeto de classe. Pode esperar que exista uma sintaxe especial para criar tais métodos (``def static f``, ``defstatic f()``, ou algo semelhante), mas nenhuma sintaxe desse tipo foi ainda definida; isso foi deixado para versões futuras do Python.
ru: Функция :func:`staticmethod` принимает функцию :func:`!f` и возвращает ее в дескрипторе, чтобы ее можно было сохранить в объекте класса. Вы могли бы ожидать, что для создания таких методов будет специальный синтаксис («def static f», «defstatic f()» или что-то в этом роде), но такой синтаксис еще не определен; это оставлено для будущих версий Python.

source: More new features, such as slots and properties, are also implemented as new kinds of descriptors, and it's not difficult to write a descriptor class that does something novel. For example, it would be possible to write a descriptor class that made it possible to write Eiffel-style preconditions and postconditions for a method. A class that used this feature might be defined like this::
pt_pt: Mais funcionalidades novas, como *slots* e propriedades, também são implementadas como novos tipos de descritores, e não é difícil escrever uma classe de descritor que faça algo inovador. Por exemplo, seria possível escrever uma classe de descritor que permitisse escrever pré-condições e pós-condições no estilo Eiffel para um método. Uma classe que usasse esta funcionalidade poderia ser definida assim::
ru: Более новые функции, такие как слоты и свойства, также реализованы как новые виды дескрипторов, и нетрудно написать класс дескриптора, который делает что-то новое. Например, можно было бы написать класс дескриптора, который позволял бы писать предварительные и постусловия в стиле Эйфеля для метода. Класс, использующий эту функцию, может быть определен следующим образом:

source: from eiffel import eiffelmethod class C(object): def f(self, arg1, arg2): # The actual function ... def pre_f(self): # Check preconditions ... def post_f(self): # Check postconditions ... f = eiffelmethod(f, pre_f, post_f)
pt_pt: from eiffel import eiffelmethod class C(object): def f(self, arg1, arg2): # A função real ... def pre_f(self): # Verificar pré-condições ... def post_f(self): # Verificar pós-condições ... f = eiffelmethod(f, pre_f, post_f)

source: Note that a person using the new :func:`!eiffelmethod` doesn't have to understand anything about descriptors. This is why I think the new features don't increase the basic complexity of the language. There will be a few wizards who need to know about it in order to write :func:`!eiffelmethod` or the ZODB or whatever, but most users will just write code on top of the resulting libraries and ignore the implementation details.
pt_pt: Note que uma pessoa que usa a nova :func:`!eiffelmethod` não precisa de perceber nada sobre descritores. É por isso que acho que as novas funcionalidades não aumentam a complexidade básica da linguagem. Haverá alguns especialistas que precisam de saber sobre isto para escrever :func:`!eiffelmethod` ou o ZODB ou o que for, mas a maioria dos utilizadores simplesmente escreverá código por cima das bibliotecas resultantes e ignorará os detalhes de implementação.
ru: Обратите внимание, что человеку, использующему новый :func:`!eiffelmethod`, не обязательно ничего понимать в дескрипторах. Вот почему я думаю, что новые возможности не увеличивают базовую сложность языка. Будет несколько мастеров, которым необходимо знать об этом, чтобы написать :func:`!eiffelmethod`, ZODB или что-то еще, но большинство пользователей просто напишут код поверх полученных библиотек и проигнорируют детали реализации.

source: Multiple Inheritance: The Diamond Rule
pt_pt: Herança Múltipla: A Regra do Diamante
ru: Множественное наследование: правило ромба

source: Multiple inheritance has also been made more useful through changing the rules under which names are resolved. Consider this set of classes (diagram taken from :pep:`253` by Guido van Rossum)::
pt_pt: A herança múltipla também foi tornada mais útil através da alteração das regras pelas quais os nomes são resolvidos. Considere este conjunto de classes (diagrama retirado do :pep:`253` de Guido van Rossum)::
ru: Множественное наследование также стало более полезным благодаря изменению правил разрешения имен. Рассмотрим этот набор классов (диаграмма взята из :pep:`253` Гвидо ван Россума):

source: The lookup rule for classic classes is simple but not very smart; the base classes are searched depth-first, going from left to right. A reference to :meth:`!D.save` will search the classes :class:`!D`, :class:`!B`, and then :class:`!A`, where :meth:`!save` would be found and returned. :meth:`!C.save` would never be found at all. This is bad, because if :class:`!C`'s :meth:`!save` method is saving some internal state specific to :class:`!C`, not calling it will result in that state never getting saved.
pt_pt: A regra de pesquisa para classes clássicas é simples, mas não muito inteligente; as classes base são pesquisadas em profundidade, da esquerda para a direita. Uma referência a :meth:`!D.save` pesquisará as classes :class:`!D`, :class:`!B` e depois :class:`!A`, onde :meth:`!save` seria encontrado e devolvido. :meth:`!C.save` nunca seria encontrado. Isto é mau, porque se o método :meth:`!save` de :class:`!C` estiver a guardar algum estado interno específico de :class:`!C`, não chamá-lo resultará nesse estado nunca ser guardado.
ru: Правило поиска для классических классов простое, но не очень умное; базовые классы просматриваются в глубину слева направо. Ссылка на :meth:`!D.save` будет искать классы :class:`!D`, :class:`!B`, а затем :class:`!A`, где :meth:`!save` будет найден и возвращен. :meth:`!C.save` вообще никогда не будет найден. Это плохо, потому что если метод :meth:`!save` :class:`!C` сохраняет какое-то внутреннее состояние, специфичное для :class:`!C`, отказ от его вызова приведет к тому, что это состояние никогда не будет сохранено.

source: New-style classes follow a different algorithm that's a bit more complicated to explain, but does the right thing in this situation. (Note that Python 2.3 changes this algorithm to one that produces the same results in most cases, but produces more useful results for really complicated inheritance graphs.)
pt_pt: As classes do novo estilo seguem um algoritmo diferente que é um pouco mais complicado de explicar, mas faz a coisa certa nesta situação. (Note que o Python 2.3 altera este algoritmo para um que produz os mesmos resultados na maioria dos casos, mas produz resultados mais úteis para gráficos de herança realmente complicados.)
ru: Классы нового стиля следуют другому алгоритму, который немного сложнее объяснить, но который в данной ситуации работает правильно. (Обратите внимание, что Python 2.3 изменил этот алгоритм на тот, который в большинстве случаев дает те же результаты, но дает более полезные результаты для действительно сложных графов наследования.)

source: List all the base classes, following the classic lookup rule and include a class multiple times if it's visited repeatedly. In the above example, the list of visited classes is [:class:`!D`, :class:`!B`, :class:`!A`, :class:`!C`, :class:`!A`].
pt_pt: Liste todas as classes base, seguindo a regra de pesquisa clássica e inclua uma classe várias vezes se for visitada repetidamente. No exemplo acima, a lista de classes visitadas é [:class:`!D`, :class:`!B`, :class:`!A`, :class:`!C`, :class:`!A`].
ru: Перечислите все базовые классы, следуя классическому правилу поиска, и включите класс несколько раз, если он посещается неоднократно. В приведенном выше примере список посещенных классов: [:class:`!D`, :class:`!B`, :class:`!A`, :class:`!C`, :class:`!A. `].

source: Scan the list for duplicated classes. If any are found, remove all but one occurrence, leaving the *last* one in the list. In the above example, the list becomes [:class:`!D`, :class:`!B`, :class:`!C`, :class:`!A`] after dropping duplicates.
pt_pt: Percorra a lista à procura de classes duplicadas. Se forem encontradas, remova todas as ocorrências exceto uma, deixando a *última* na lista. No exemplo acima, a lista torna-se [:class:`!D`, :class:`!B`, :class:`!C`, :class:`!A`] após a remoção de duplicados.
ru: Просканируйте список на наличие повторяющихся классов. Если таковые имеются, удалите все, кроме одного, оставив *последнее* в списке. В приведенном выше примере список становится [:class:`!D`, :class:`!B`, :class:`!C`, :class:`!A`] после удаления дубликатов.

source: Following this rule, referring to :meth:`!D.save` will return :meth:`!C.save`, which is the behaviour we're after. This lookup rule is the same as the one followed by Common Lisp. A new built-in function, :func:`super`, provides a way to get at a class's superclasses without having to reimplement Python's algorithm. The most commonly used form will be ``super(class, obj)``, which returns a bound superclass object (not the actual class object). This form will be used in methods to call a method in the superclass; for example, :class:`!D`'s :meth:`!save` method would look like this::
pt_pt: Seguindo esta regra, referir :meth:`!D.save` devolverá :meth:`!C.save`, que é o comportamento que procuramos. Esta regra de pesquisa é a mesma seguida pelo Common Lisp. Uma nova função integrada, :func:`super`, fornece uma forma de aceder às superclasses de uma classe sem ter de reimplementar o algoritmo do Python. A forma mais comumente usada será ``super(class, obj)``, que devolve um objeto de superclasse ligado (não o objeto de classe real). Esta forma será usada em métodos para chamar um método na superclasse; por exemplo, o método :meth:`!save` de :class:`!D` seria assim::
ru: Следуя этому правилу, обращение к :meth:`!D.save` вернет :meth:`!C.save`, что и является искомым поведением. Это правило поиска такое же, как и в Common Lisp. Новая встроенная функция :func:`super` позволяет получить доступ к суперклассам класса без необходимости переопределять алгоритм Python. Наиболее часто используемой формой будет ``super(class, obj)``, которая возвращает связанный объект суперкласса (а не фактический объект класса). Эта форма будет использоваться в методах для вызова метода суперкласса; например, метод :meth:`!save` :class:`!D` будет выглядеть так::

source: class D (B,C): def save (self): # Call superclass .save() super(D, self).save() # Save D's private information here ...
pt_pt: class D (B,C): def save (self): # Chamar o .save() da superclasse super(D, self).save() # Guardar aqui a informação privada de D ...

source: :func:`super` can also return unbound superclass objects when called as ``super(class)`` or ``super(class1, class2)``, but this probably won't often be useful.
pt_pt: :func:`super` também pode devolver objetos de superclasse não ligados quando chamada como ``super(class)`` ou ``super(class1, class2)``, mas isto provavelmente não será muito útil.
ru: :func:`super` также может возвращать несвязанные объекты суперкласса, когда он вызывается как ``super(class)`` или ``super(class1, class2)``, но это, вероятно, не часто будет полезно.

source: Attribute Access
pt_pt: Acesso a Atributos
ru: Доступ к атрибутам

source: A fair number of sophisticated Python classes define hooks for attribute access using :meth:`~object.__getattr__`; most commonly this is done for convenience, to make code more readable by automatically mapping an attribute access such as ``obj.parent`` into a method call such as ``obj.get_parent``. Python 2.2 adds some new ways of controlling attribute access.
pt_pt: Um número considerável de classes Python sofisticadas define *hooks* para acesso a atributos usando :meth:`~object.__getattr__`; mais comumente, isto é feito por conveniência, para tornar o código mais legível ao mapear automaticamente um acesso a atributo, como ``obj.parent``, numa chamada de método, como ``obj.get_parent``. O Python 2.2 adiciona algumas formas novas de controlar o acesso a atributos.
ru: Значительное количество сложных классов Python определяют перехватчики для доступа к атрибутам, используя :meth:`~object.__getattr__`; чаще всего это делается для удобства, чтобы сделать код более читабельным путем автоматического сопоставления доступа к атрибуту, например obj.parent, с вызовом метода, например obj.get_parent. Python 2.2 добавляет несколько новых способов управления доступом к атрибутам.

source: First, ``__getattr__(attr_name)`` is still supported by new-style classes, and nothing about it has changed. As before, it will be called when an attempt is made to access ``obj.foo`` and no attribute named ``foo`` is found in the instance's dictionary.
pt_pt: Primeiro, ``__getattr__(attr_name)`` ainda é suportado por classes do novo estilo, e nada mudou. Como antes, será chamado quando for feita uma tentativa de aceder a ``obj.foo`` e nenhum atributo chamado ``foo`` for encontrado no dicionário da instância.
ru: Во-первых, ``__getattr__(attr_name)`` по-прежнему поддерживается классами нового стиля, и в нем ничего не изменилось. Как и раньше, он будет вызываться, когда будет предпринята попытка доступа к obj.foo и в словаре экземпляра не будет найден атрибут с именем foo.

source: New-style classes also support a new method, ``__getattribute__(attr_name)``. The difference between the two methods is that :meth:`~object.__getattribute__` is *always* called whenever any attribute is accessed, while the old :meth:`~object.__getattr__` is only called if ``foo`` isn't found in the instance's dictionary.
pt_pt: As classes do novo estilo também suportam um novo método, ``__getattribute__(attr_name)``. A diferença entre os dois métodos é que :meth:`~object.__getattribute__` é *sempre* chamado sempre que qualquer atributo é acedido, enquanto o antigo :meth:`~object.__getattr__` só é chamado se ``foo`` não for encontrado no dicionário da instância.
ru: Классы нового стиля также поддерживают новый метод ``__getattribute__(attr_name)``. Разница между этими двумя методами заключается в том, что :meth:`~object.__getattribute__` вызывается *всегда* всякий раз, когда осуществляется доступ к любому атрибуту, в то время как старый :meth:`~object.__getattr__` вызывается только в том случае, если ``foo`` не задан. не найден в словаре экземпляра.

source: However, Python 2.2's support for :dfn:`properties` will often be a simpler way to trap attribute references. Writing a :meth:`!__getattr__` method is complicated because to avoid recursion you can't use regular attribute accesses inside them, and instead have to mess around with the contents of :attr:`~object.__dict__`. :meth:`~object.__getattr__` methods also end up being called by Python when it checks for other methods such as :meth:`~object.__repr__` or :meth:`!__coerce__`, and so have to be written with this in mind. Finally, calling a function on every attribute access results in a sizable performance loss.
pt_pt: No entanto, o suporte do Python 2.2 para :dfn:`propriedades` será muitas vezes uma forma mais simples de interceptar referências a atributos. Escrever um método :meth:`!__getattr__` é complicado porque, para evitar recursão, não pode usar acessos normais a atributos dentro deles, e em vez disso tem de manipular o conteúdo de :attr:`~object.__dict__`. Os métodos :meth:`~object.__getattr__` também acabam por ser chamados pelo Python quando verifica outros métodos, como :meth:`~object.__repr__` ou :meth:`!__coerce__`, e por isso têm de ser escritos com isto em mente. Finalmente, chamar uma função em cada acesso a atributo resulta numa perda significativa de desempenho.
ru: Однако поддержка :dfn:`properties` в Python 2.2 часто оказывается более простым способом перехвата ссылок на атрибуты. Написание метода :meth:`!__getattr__` сложно, поскольку во избежание рекурсии вы не можете использовать обычный доступ к атрибутам внутри них, и вместо этого вам придется возиться с содержимым :attr:`~object.__dict__`. Методы :meth:`~object.__getattr__` также вызываются Python, когда он проверяет наличие других методов, таких как :meth:`~object.__repr__` или :meth:`!__coerce__`, поэтому их нужно писать с помощью это в виду. Наконец, вызов функции при каждом доступе к атрибуту приводит к значительной потере производительности.

source: :class:`property` is a new built-in type that packages up three functions that get, set, or delete an attribute, and a docstring. For example, if you want to define a :attr:`!size` attribute that's computed, but also settable, you could write::
pt_pt: :class:`property` é um novo tipo integrado que encapsula três funções que obtêm, definem ou eliminam um atributo, e uma *docstring*. Por exemplo, se pretender definir um atributo :attr:`!size` que é calculado, mas também configurável, pode escrever::
ru: :class:`property` — это новый встроенный тип, объединяющий три функции, которые получают, устанавливают или удаляют атрибут, а также строку документации. Например, если вы хотите определить атрибут :attr:`!size`, который вычисляется, но также может быть установлен, вы можете написать::

source: class C(object): def get_size (self): result = ... computation ... return result def set_size (self, size): ... compute something based on the size and set internal state appropriately ... # Define a property. The 'delete this attribute' # method is defined as None, so the attribute # can't be deleted. size = property(get_size, set_size, None, "Storage size of this instance")
pt_pt: class C(object): def get_size (self): result = ... cálculo ... return result def set_size (self, size): ... calcular algo com base no tamanho e definir o estado interno apropriadamente ... # Definir uma propriedade. O método 'eliminar este atributo' # é definido como None, pelo que o atributo # não pode ser eliminado. size = property(get_size, set_size, None, "Tamanho de armazenamento desta instância")

source: That is certainly clearer and easier to write than a pair of :meth:`!__getattr__`/:meth:`!__setattr__` methods that check for the :attr:`!size` attribute and handle it specially while retrieving all other attributes from the instance's :attr:`~object.__dict__`. Accesses to :attr:`!size` are also the only ones which have to perform the work of calling a function, so references to other attributes run at their usual speed.
pt_pt: Isto é certamente mais claro e fácil de escrever do que um par de métodos :meth:`!__getattr__`/:meth:`!__setattr__` que verificam o atributo :attr:`!size` e o tratam especialmente, enquanto recuperam todos os outros atributos do :attr:`~object.__dict__` da instância. Os acessos a :attr:`!size` são também os únicos que têm de executar o trabalho de chamar uma função, pelo que as referências a outros atributos funcionam à velocidade habitual.
ru: Это, безусловно, понятнее и проще написать, чем пара методов :meth:`!__getattr__`/:meth:`!__setattr__`, которые проверяют наличие атрибута :attr:`!size` и специально обрабатывают его, извлекая все остальные атрибуты из :attr:`~object.__dict__` экземпляра. Доступ к :attr:`!size` также является единственным, который должен выполнять работу по вызову функции, поэтому ссылки на другие атрибуты выполняются с обычной скоростью.

source: Finally, it's possible to constrain the list of attributes that can be referenced on an object using the new :attr:`~object.__slots__` class attribute. Python objects are usually very dynamic; at any time it's possible to define a new attribute on an instance by just doing ``obj.new_attr=1``. A new-style class can define a class attribute named :attr:`~object.__slots__` to limit the legal attributes to a particular set of names. An example will make this clear::
pt_pt: Finalmente, é possível restringir a lista de atributos que podem ser referenciados num objeto usando o novo atributo de classe :attr:`~object.__slots__`. Os objetos Python são normalmente muito dinâmicos; a qualquer momento é possível definir um novo atributo numa instância simplesmente fazendo ``obj.new_attr=1``. Uma classe do novo estilo pode definir um atributo de classe chamado :attr:`~object.__slots__` para limitar os atributos legais a um conjunto específico de nomes. Um exemplo tornará isto claro::
ru: Наконец, можно ограничить список атрибутов, на которые можно ссылаться в объекте, используя новый атрибут класса :attr:`~object.__slots__`. Объекты Python обычно очень динамичны; в любой момент можно определить новый атрибут экземпляра, просто выполнив ``obj.new_attr=1``. Класс нового стиля может определить атрибут класса с именем :attr:`~object.__slots__`, чтобы ограничить допустимые атрибуты определенным набором имен. Пример прояснит это:

source: >>> class C(object): ... __slots__ = ('template', 'name') ... >>> obj = C() >>> print obj.template None >>> obj.template = 'Test' >>> print obj.template Test >>> obj.newattr = None Traceback (most recent call last): File "<stdin>", line 1, in ? AttributeError: 'C' object has no attribute 'newattr'
pt_pt: >>> class C(object): ... __slots__ = ('template', 'name') ... >>> obj = C() >>> print obj.template None >>> obj.template = 'Test' >>> print obj.template Test >>> obj.newattr = None Traceback (most recent call last): File "<stdin>", line 1, in ? AttributeError: o objeto 'C' não tem o atributo 'newattr'

source: Note how you get an :exc:`AttributeError` on the attempt to assign to an attribute not listed in :attr:`~object.__slots__`.
pt_pt: Note como obtém um :exc:`AttributeError` ao tentar atribuir a um atributo não listado em :attr:`~object.__slots__`.
ru: Обратите внимание, как вы получаете ошибку :exc:`AttributeError` при попытке назначить атрибут, не указанный в :attr:`~object.__slots__`.

source: Related Links
pt_pt: Ligações Relacionadas
ru: Ссылки по теме
