Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: The :mod:`locale` modules lets Python software select various conversions and display conventions that are localized to a particular country or language. However, the module was careful to not change the numeric locale because various functions in Python's implementation required that the numeric locale remain set to the ``'C'`` locale. Often this was because the code was using the C library's :c:func:`atof` function.
pt_pt: O módulo :mod:`locale` permite que o *software* Python selecione várias conversões e convenções de exibição que são localizadas para um país ou linguagem específicos. No entanto, o módulo teve o cuidado de não alterar a localização numérica porque várias funções na implementação do Python exigiam que a localização numérica permanecesse definida para a localização ``'C'``. Muitas vezes, isto acontecia porque o código estava a usar a função :c:func:`atof` da biblioteca C.
ru: Модули :mod:`locale` позволяют программному обеспечению Python выбирать различные преобразования и правила отображения, локализованные для определенной страны или языка. Однако модуль старался не менять числовой локаль, поскольку различные функции в реализации Python требовали, чтобы числовая локаль оставалась установленной на локаль ``'C'``. Часто это происходило потому, что код использовал функцию :c:func:`atof` библиотеки C.

source: Not setting the numeric locale caused trouble for extensions that used third-party C libraries, however, because they wouldn't have the correct locale set. The motivating example was GTK+, whose user interface widgets weren't displaying numbers in the current locale.
pt_pt: Não definir a localização numérica causava problemas para extensões que usavam bibliotecas C de terceiros, no entanto, porque não teriam a localização correta definida. O exemplo motivador foi o GTK+, cujos *widgets* de interface de utilizador não exibiam números na localização atual.
ru: Однако отсутствие числового языкового стандарта вызывало проблемы для расширений, которые использовали сторонние библиотеки C, поскольку для них не был установлен правильный языковой стандарт. Мотивирующим примером был GTK+, виджеты пользовательского интерфейса которого не отображали числа в текущей локали.

source: The solution described in the PEP is to add three new functions to the Python API that perform ASCII-only conversions, ignoring the locale setting:
pt_pt: A solução descrita na PEP é adicionar três novas funções à API do Python que realizam conversões apenas ASCII, ignorando a definição de localização:
ru: Решение, описанное в PEP, заключается в добавлении в API Python трех новых функций, которые выполняют преобразования только ASCII, игнорируя настройку локали:

source: ``PyOS_ascii_strtod(str, ptr)`` and ``PyOS_ascii_atof(str, ptr)`` both convert a string to a C :c:expr:`double`.
pt_pt: ``PyOS_ascii_strtod(str, ptr)`` e ``PyOS_ascii_atof(str, ptr)`` convertem ambas uma string para um :c:expr:`double` do C.
ru: ``PyOS_ascii_strtod(str, ptr)`` и ``PyOS_ascii_atof(str, ptr)`` преобразуют строку в C :c:expr:`double`.

source: ``PyOS_ascii_formatd(buffer, buf_len, format, d)`` converts a :c:expr:`double` to an ASCII string.
pt_pt: ``PyOS_ascii_formatd(buffer, buf_len, format, d)`` converte um :c:expr:`double` para uma string ASCII.
ru: ``PyOS_ascii_formatd(buffer, buf_len, format, d)`` преобразует :c:expr:`double` в строку ASCII.

source: The code for these functions came from the GLib library (`https://developer-old.gnome.org/glib/2.26/ <http://web.archive.org/web/20210306104320/https://developer.gnome.org/glib/2.26/>`__), whose developers kindly relicensed the relevant functions and donated them to the Python Software Foundation. The :mod:`locale` module can now change the numeric locale, letting extensions such as GTK+ produce the correct results.
pt_pt: O código para estas funções veio da biblioteca GLib (`https://developer-old.gnome.org/glib/2.26/ <http://web.archive.org/web/20210306104320/https://developer.gnome.org/glib/2.26/>`__), cujos desenvolvedores gentilmente relicenciaram as funções relevantes e doaram-nas à Python Software Foundation. O módulo :mod:`locale` pode agora alterar a localização numérica, permitindo que extensões como o GTK+ produzam os resultados corretos.
ru: Код для этих функций взят из библиотеки GLib (https://developer-old.gnome.org/glib/2.26/ <http://web.archive.org/web/20210306104320/https://developer.gnome .org/glib/2.26/>`__), разработчики которого любезно лицензировали соответствующие функции и передали их Python Software Foundation. Модуль :mod:`locale` теперь может изменять числовой локаль, позволяя таким расширениям, как GTK+, выдавать правильные результаты.

source: :pep:`331` - Locale-Independent Float/String Conversions
pt_pt: :pep:`331` - Conversões de Float/String Independentes da Localização
ru: :pep:`331` - Независимые от локали преобразования чисел с плавающей запятой/строки

source: Written by Christian R. Reis, and implemented by Gustavo Carneiro.
pt_pt: Escrito por Christian R. Reis e implementado por Gustavo Carneiro.
ru: Написано Кристианом Р. Рейсом и реализовано Густаво Карнейро.

source: Other Language Changes
pt_pt: Outras Alterações à Linguagem
ru: Другие языковые изменения

source: Here are all of the changes that Python 2.4 makes to the core Python language.
pt_pt: Aqui estão todas as alterações que o Python 2.4 faz à linguagem principal do Python.
ru: Вот все изменения, которые Python 2.4 вносит в основной язык Python.

source: Decorators for functions and methods were added (:pep:`318`).
pt_pt: Foram adicionados decoradores para funções e métodos (:pep:`318`).
ru: Добавлены декораторы для функций и методов (:pep:`318`).

source: Built-in :func:`set` and :func:`frozenset` types were added (:pep:`218`). Other new built-ins include the ``reversed(seq)`` function (:pep:`322`).
pt_pt: Foram adicionados os tipos integrados :func:`set` e :func:`frozenset` (:pep:`218`). Outros novos integrados incluem a função ``reversed(seq)`` (:pep:`322`).
ru: Добавлены встроенные типы :func:`set` и :func:`frozenset` (:pep:`218`). Другие новые встроенные функции включают функцию reversed(seq) (:pep:`322`).

source: Generator expressions were added (:pep:`289`).
pt_pt: Foram adicionadas expressões geradoras (:pep:`289`).
ru: Добавлены выражения-генераторы (:pep:`289`).

source: Certain numeric expressions no longer return values restricted to 32 or 64 bits (:pep:`237`).
pt_pt: Certas expressões numéricas já não devolvem valores restritos a 32 ou 64 bits (:pep:`237`).
ru: Некоторые числовые выражения больше не возвращают значения, ограниченные 32 или 64 битами (:pep:`237`).

source: You can now put parentheses around the list of names in a ``from module import names`` statement (:pep:`328`).
pt_pt: Agora pode colocar parênteses à volta da lista de nomes numa instrução ``from module import names`` (:pep:`328`).
ru: Теперь вы можете заключать список имен в круглые скобки в операторе ``from Module Import Names'' (:pep:`328`).

source: The :meth:`dict.update` method now accepts the same argument forms as the :class:`dict` constructor. This includes any mapping, any iterable of key/value pairs, and keyword arguments. (Contributed by Raymond Hettinger.)
pt_pt: O método :meth:`dict.update` agora aceita as mesmas formas de argumento que o construtor :class:`dict`. Isto inclui qualquer mapeamento, qualquer iterável de pares chave/valor e argumentos nomeados. (Contribuído por Raymond Hettinger.)
ru: Метод :meth:`dict.update` теперь принимает те же формы аргументов, что и конструктор :class:`dict`. Сюда входят любые сопоставления, любые итерации пар ключ/значение и аргументы ключевых слов. (Предоставлено Раймондом Хеттингером.)

source: The string methods :meth:`ljust`, :meth:`rjust`, and :meth:`center` now take an optional argument for specifying a fill character other than a space. (Contributed by Raymond Hettinger.)
pt_pt: Os métodos de string :meth:`ljust`, :meth:`rjust` e :meth:`center` agora aceitam um argumento opcional para especificar um carácter de preenchimento diferente de um espaço. (Contribuído por Raymond Hettinger.)
ru: Строковые методы :meth:`ljust`, :meth:`rjust` и :meth:`center` теперь принимают необязательный аргумент для указания символа заполнения, отличного от пробела. (Предоставлено Раймондом Хеттингером.)

source: Strings also gained an :meth:`rsplit` method that works like the :meth:`split` method but splits from the end of the string. (Contributed by Sean Reifschneider.) ::
pt_pt: As strings também ganharam um método :meth:`rsplit` que funciona como o método :meth:`split`, mas divide a partir do final da string. (Contribuído por Sean Reifschneider.) ::
ru: В строках также появился метод :meth:`rsplit`, который работает аналогично методу :meth:`split`, но разбивается с конца строки. (Предоставлено Шоном Рейфшнайдером.) ::

source: Three keyword parameters, *cmp*, *key*, and *reverse*, were added to the :meth:`sort` method of lists. These parameters make some common usages of :meth:`sort` simpler. All of these parameters are optional.
pt_pt: Três parâmetros nomeados, *cmp*, *key* e *reverse*, foram adicionados ao método :meth:`sort` das listas. Estes parâmetros tornam alguns usos comuns de :meth:`sort` mais simples. Todos estes parâmetros são opcionais.
ru: В метод списков :meth:`sort` были добавлены три ключевых параметра: *cmp*, *key* и *reverse*. Эти параметры упрощают некоторые распространенные способы использования :meth:`sort`. Все эти параметры являются необязательными.

source: For the *cmp* parameter, the value should be a comparison function that takes two parameters and returns -1, 0, or +1 depending on how the parameters compare. This function will then be used to sort the list. Previously this was the only parameter that could be provided to :meth:`sort`.
pt_pt: Para o parâmetro *cmp*, o valor deve ser uma função de comparação que recebe dois parâmetros e devolve -1, 0 ou +1, dependendo de como os parâmetros se comparam. Esta função será então usada para ordenar a lista. Anteriormente, este era o único parâmetro que podia ser fornecido a :meth:`sort`.
ru: Для параметра *cmp* значение должно быть функцией сравнения, которая принимает два параметра и возвращает -1, 0 или +1 в зависимости от того, как сравниваются параметры. Эта функция затем будет использоваться для сортировки списка. Раньше это был единственный параметр, который можно было передать в :meth:`sort`.

source: *key* should be a single-parameter function that takes a list element and returns a comparison key for the element. The list is then sorted using the comparison keys. The following example sorts a list case-insensitively::
pt_pt: *key* deve ser uma função de um único parâmetro que recebe um elemento da lista e devolve uma chave de comparação para o elemento. A lista é então ordenada usando as chaves de comparação. O exemplo seguinte ordena uma lista sem distinção de maiúsculas/minúsculas::
ru: *key* должна быть функцией с одним параметром, которая принимает элемент списка и возвращает ключ сравнения для этого элемента. Затем список сортируется с использованием ключей сравнения. В следующем примере список сортируется без учета регистра:

source: >>> L = ['A', 'b', 'c', 'D'] >>> L.sort() # Case-sensitive sort >>> L ['A', 'D', 'b', 'c'] >>> # Using 'key' parameter to sort list >>> L.sort(key=lambda x: x.lower()) >>> L ['A', 'b', 'c', 'D'] >>> # Old-fashioned way >>> L.sort(cmp=lambda x,y: cmp(x.lower(), y.lower())) >>> L ['A', 'b', 'c', 'D']
pt_pt: >>> L = ['A', 'b', 'c', 'D'] >>> L.sort() # Ordenação sensível a maiúsculas >>> L ['A', 'D', 'b', 'c'] >>> # Usando o parâmetro 'key' para ordenar a lista >>> L.sort(key=lambda x: x.lower()) >>> L ['A', 'b', 'c', 'D'] >>> # Forma antiga >>> L.sort(cmp=lambda x,y: cmp(x.lower(), y.lower())) >>> L ['A', 'b', 'c', 'D']

source: The last example, which uses the *cmp* parameter, is the old way to perform a case-insensitive sort. It works but is slower than using a *key* parameter. Using *key* calls :meth:`lower` method once for each element in the list while using *cmp* will call it twice for each comparison, so using *key* saves on invocations of the :meth:`lower` method.
pt_pt: O último exemplo, que usa o parâmetro *cmp*, é a forma antiga de realizar uma ordenação sem distinção de maiúsculas/minúsculas. Funciona, mas é mais lento do que usar um parâmetro *key*. Usar *key* chama o método :meth:`lower` uma vez para cada elemento na lista, enquanto usar *cmp* chamá-lo-á duas vezes para cada comparação, pelo que usar *key* poupa invocações do método :meth:`lower`.
ru: Последний пример, в котором используется параметр *cmp*, представляет собой старый способ выполнения сортировки без учета регистра. Это работает, но медленнее, чем использование параметра *key*. Использование *key* вызывает метод :meth:`lower` один раз для каждого элемента в списке, а использование *cmp* вызывает его дважды для каждого сравнения, поэтому использование *key* экономит на вызовах метода :meth:`lower`.

source: For simple key functions and comparison functions, it is often possible to avoid a :keyword:`lambda` expression by using an unbound method instead. For example, the above case-insensitive sort is best written as::
pt_pt: Para funções de chave e funções de comparação simples, é muitas vezes possível evitar uma expressão :keyword:`lambda` usando um método não ligado em vez disso. Por exemplo, a ordenação sem distinção de maiúsculas/minúsculas acima é melhor escrita como::
ru: Для простых ключевых функций и функций сравнения часто можно избежать выражения :keyword:`lambda`, используя вместо него несвязанный метод. Например, приведенную выше сортировку без учета регистра лучше всего записать так:

source: Finally, the *reverse* parameter takes a Boolean value. If the value is true, the list will be sorted into reverse order. Instead of ``L.sort(); L.reverse()``, you can now write ``L.sort(reverse=True)``.
pt_pt: Finalmente, o parâmetro *reverse* recebe um valor booleano. Se o valor for verdadeiro, a lista será ordenada por ordem inversa. Em vez de ``L.sort(); L.reverse()``, pode agora escrever ``L.sort(reverse=True)``.
ru: Наконец, параметр *reverse* принимает логическое значение. Если значение истинно, список будет отсортирован в обратном порядке. Вместо ``L.sort(); L.reverse()``, теперь вы можете написать ``L.sort(reverse=True)``.

source: The results of sorting are now guaranteed to be stable. This means that two entries with equal keys will be returned in the same order as they were input. For example, you can sort a list of people by name, and then sort the list by age, resulting in a list sorted by age where people with the same age are in name-sorted order.
pt_pt: Os resultados da ordenação são agora garantidamente estáveis. Isto significa que duas entradas com chaves iguais serão devolvidas na mesma ordem em que foram inseridas. Por exemplo, pode ordenar uma lista de pessoas por nome e, em seguida, ordenar a lista por idade, resultando numa lista ordenada por idade, onde pessoas com a mesma idade estão por ordem de nome.
ru: Результаты сортировки теперь гарантированно стабильны. Это означает, что две записи с одинаковыми ключами будут возвращены в том же порядке, в котором они были введены. Например, вы можете отсортировать список людей по имени, а затем отсортировать его по возрасту, в результате чего получится список, отсортированный по возрасту, в котором люди одного возраста будут отсортированы по имени.

source: (All changes to :meth:`sort` contributed by Raymond Hettinger.)
pt_pt: (Todas as alterações a :meth:`sort` contribuídas por Raymond Hettinger.)
ru: (Все изменения в :meth:`sort` внесены Рэймондом Хеттингером.)

source: There is a new built-in function ``sorted(iterable)`` that works like the in-place :meth:`list.sort` method but can be used in expressions. The differences are:
pt_pt: Existe uma nova função integrada ``sorted(iterable)`` que funciona como o método :meth:`list.sort` *in-place*, mas pode ser usada em expressões. As diferenças são:
ru: Появилась новая встроенная функция sorted(iterable), которая работает как локальный метод :meth:list.sort, но может использоваться в выражениях. Отличия заключаются в следующем:

source: the input may be any iterable;
pt_pt: a entrada pode ser qualquer iterável;
ru: входные данные могут быть любыми итерируемыми;

source: a newly formed copy is sorted, leaving the original intact; and
pt_pt: uma nova cópia formada é ordenada, deixando a original intacta; e
ru: вновь сформированная копия сортируется, оставляя оригинал нетронутым; и

source: the expression returns the new sorted copy
pt_pt: a expressão devolve a nova cópia ordenada
ru: выражение возвращает новую отсортированную копию

source: >>> L = [9,7,8,3,2,4,1,6,5] >>> [10+i for i in sorted(L)] # usable in a list comprehension [11, 12, 13, 14, 15, 16, 17, 18, 19] >>> L # original is left unchanged [9,7,8,3,2,4,1,6,5] >>> sorted('Monty Python') # any iterable may be an input [' ', 'M', 'P', 'h', 'n', 'n', 'o', 'o', 't', 't', 'y', 'y'] >>> # List the contents of a dict sorted by key values >>> colormap = dict(red=1, blue=2, green=3, black=4, yellow=5) >>> for k, v in sorted(colormap.iteritems()): ... print k, v ... black 4 blue 2 green 3 red 1 yellow 5
pt_pt: >>> L = [9,7,8,3,2,4,1,6,5] >>> [10+i for i in sorted(L)] # utilizável numa list comprehension [11, 12, 13, 14, 15, 16, 17, 18, 19] >>> L # original permanece inalterado [9,7,8,3,2,4,1,6,5] >>> sorted('Monty Python') # qualquer iterável pode ser uma entrada [' ', 'M', 'P', 'h', 'n', 'n', 'o', 'o', 't', 't', 'y', 'y'] >>> # Listar o conteúdo de um dicionário ordenado por valores de chave >>> colormap = dict(red=1, blue=2, green=3, black=4, yellow=5) >>> for k, v in sorted(colormap.iteritems()): ... print k, v ... black 4 blue 2 green 3 red 1 yellow 5

source: (Contributed by Raymond Hettinger.)
pt_pt: (Contribuído por Raymond Hettinger.)
ru: (Предоставлено Раймондом Хеттингером.)

source: Integer operations will no longer trigger an :exc:`OverflowWarning`. The :exc:`OverflowWarning` warning will disappear in Python 2.5.
pt_pt: As operações com inteiros já não irão gerar um :exc:`OverflowWarning`. O aviso :exc:`OverflowWarning` desaparecerá no Python 2.5.
ru: Целочисленные операции больше не будут вызывать :exc:`OverflowWarning`. Предупреждение :exc:`OverflowWarning` исчезнет в Python 2.5.

source: The interpreter gained a new switch, :option:`-m`, that takes a name, searches for the corresponding module on ``sys.path``, and runs the module as a script. For example, you can now run the Python profiler with ``python -m profile``. (Contributed by Nick Coghlan.)
pt_pt: O interpretador ganhou uma nova opção, :option:`-m`, que recebe um nome, procura pelo módulo correspondente em ``sys.path`` e executa o módulo como um *script*. Por exemplo, pode agora executar o *profiler* do Python com ``python -m profile``. (Contribuído por Nick Coghlan.)
ru: Интерпретатор получил новый ключ :option:`-m`, который принимает имя, ищет соответствующий модуль в ``sys.path`` и запускает модуль как скрипт. Например, теперь вы можете запустить профилировщик Python с помощью ``python -m Profile``. (Предоставлено Ником Когланом.)

source: The ``eval(expr, globals, locals)`` and ``execfile(filename, globals, locals)`` functions and the ``exec`` statement now accept any mapping type for the *locals* parameter. Previously this had to be a regular Python dictionary. (Contributed by Raymond Hettinger.)
pt_pt: As funções ``eval(expr, globals, locals)`` e ``execfile(filename, globals, locals)`` e a instrução ``exec`` agora aceitam qualquer tipo de mapeamento para o parâmetro *locals*. Anteriormente, isto tinha de ser um dicionário Python normal. (Contribuído por Raymond Hettinger.)
ru: Функции ``eval(expr, globals, locals)`` и ``execfile(filename, globals, locals)`` и оператор ``exec`` теперь принимают любой тип сопоставления для параметра *locals*. Раньше это должен был быть обычный словарь Python. (Предоставлено Раймондом Хеттингером.)

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list if called with no arguments. Previously they raised a :exc:`TypeError` exception. This makes them more suitable for use with variable length argument lists::
pt_pt: A função integrada :func:`zip` e :func:`itertools.izip` agora devolvem uma lista vazia se chamadas sem argumentos. Anteriormente, geravam uma exceção :exc:`TypeError`. Isto torna-as mais adequadas para uso com listas de argumentos de comprimento variável::
ru: Встроенная функция :func:`zip` и :func:`itertools.izip` теперь возвращают пустой список, если они вызваны без аргументов. Ранее они вызвали исключение :exc:`TypeError`. Это делает их более подходящими для использования со списками аргументов переменной длины:

source: Encountering a failure while importing a module no longer leaves a partially initialized module object in ``sys.modules``. The incomplete module object left behind would fool further imports of the same module into succeeding, leading to confusing errors. (Fixed by Tim Peters.)
pt_pt: Encontrar uma falha ao importar um módulo já não deixa um objeto de módulo parcialmente inicializado em ``sys.modules``. O objeto de módulo incompleto deixado para trás enganaria importações adicionais do mesmo módulo, fazendo-as ter sucesso, o que levaria a erros confusos. (Corrigido por Tim Peters.)
ru: В случае сбоя при импорте модуля в ``sys.modules`` больше не остается частично инициализированный объект модуля. Оставленный неполный объект модуля может обмануть дальнейший импорт того же модуля, что приведет к запутанным ошибкам. (Исправлено Тимом Питерсом.)

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error. (Contributed by Raymond Hettinger.)
pt_pt: :const:`None` é agora uma constante; código que atribui um novo valor ao nome ``None`` é agora um erro de sintaxe. (Contribuído por Raymond Hettinger.)
ru: :const:`None` теперь является константой; код, который связывает новое значение с именем None, теперь является синтаксической ошибкой. (Предоставлено Раймондом Хеттингером.)

source: Optimizations
pt_pt: Otimizações
ru: Оптимизации

source: The inner loops for list and tuple slicing were optimized and now run about one-third faster. The inner loops for dictionaries were also optimized, resulting in performance boosts for :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues`, and :meth:`iteritems`. (Contributed by Raymond Hettinger.)
pt_pt: Os ciclos internos para fatiamento de listas e tuplos foram otimizados e agora executam cerca de um terço mais rápido. Os ciclos internos para dicionários também foram otimizados, resultando em melhorias de desempenho para :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues` e :meth:`iteritems`. (Contribuído por Raymond Hettinger.)
ru: Внутренние циклы нарезки списков и кортежей были оптимизированы и теперь работают примерно на треть быстрее. Внутренние циклы для словарей также были оптимизированы, что привело к повышению производительности для :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`iterkeys`, :meth:`itervalues` и :meth:`iteritems`. (Предоставлено Раймондом Хеттингером.)
