Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: :func:`groupby` is typically used with sorted input. The logic for :func:`groupby` is similar to the Unix ``uniq`` filter which makes it handy for eliminating, counting, or identifying duplicate elements::
pt_pt: :func:`groupby` é tipicamente usado com entrada ordenada. A lógica para :func:`groupby` é semelhante ao filtro ``uniq`` do Unix, o que o torna útil para eliminar, contar ou identificar elementos duplicados::
ru: :func:`groupby` обычно используется с отсортированным вводом. Логика :func:`groupby` аналогична фильтру ``uniq`` в Unix, что делает его удобным для исключения, подсчета или идентификации повторяющихся элементов:

source: >>> word = 'abracadabra' >>> letters = sorted(word) # Turn string into a sorted list of letters >>> letters ['a', 'a', 'a', 'a', 'a', 'b', 'b', 'c', 'd', 'r', 'r'] >>> for k, g in itertools.groupby(letters): ... print k, list(g) ... a ['a', 'a', 'a', 'a', 'a'] b ['b', 'b'] c ['c'] d ['d'] r ['r', 'r'] >>> # List unique letters >>> [k for k, g in groupby(letters)] ['a', 'b', 'c', 'd', 'r'] >>> # Count letter occurrences >>> [(k, len(list(g))) for k, g in groupby(letters)] [('a', 5), ('b', 2), ('c', 1), ('d', 1), ('r', 2)]
pt_pt: >>> word = 'abracadabra' >>> letters = sorted(word) # Transformar string numa lista ordenada de letras >>> letters ['a', 'a', 'a', 'a', 'a', 'b', 'b', 'c', 'd', 'r', 'r'] >>> for k, g in itertools.groupby(letters): ... print k, list(g) ... a ['a', 'a', 'a', 'a', 'a'] b ['b', 'b'] c ['c'] d ['d'] r ['r', 'r'] >>> # Listar letras únicas >>> [k for k, g in groupby(letters)] ['a', 'b', 'c', 'd', 'r'] >>> # Contar ocorrências de letras >>> [(k, len(list(g))) for k, g in groupby(letters)] [('a', 5), ('b', 2), ('c', 1), ('d', 1), ('r', 2)]

source: (Contributed by Hye-Shik Chang.)
pt_pt: (Contribuído por Hye-Shik Chang.)
ru: (Предоставлено Хе-Шик Чангом.)

source: :mod:`itertools` also gained a function named ``tee(iterator, N)`` that returns *N* independent iterators that replicate *iterator*. If *N* is omitted, the default is 2. ::
pt_pt: O módulo :mod:`itertools` também ganhou uma função chamada ``tee(iterator, N)`` que devolve *N* iteradores independentes que replicam *iterador*. Se *N* for omitido, o predefinido é 2. ::
ru: :mod:`itertools` также получил функцию с именем ``tee(iterator, N)``, которая возвращает *N* независимых итераторов, копирующих *iterator*. Если *N* опущено, значение по умолчанию — 2. ::

source: >>> L = [1,2,3] >>> i1, i2 = itertools.tee(L) >>> i1,i2 (<itertools.tee object at 0x402c2080>, <itertools.tee object at 0x402c2090>) >>> list(i1) # Run the first iterator to exhaustion [1, 2, 3] >>> list(i2) # Run the second iterator to exhaustion [1, 2, 3]
pt_pt: >>> L = [1,2,3] >>> i1, i2 = itertools.tee(L) >>> i1,i2 (<itertools.tee object at 0x402c2080>, <itertools.tee object at 0x402c2090>) >>> list(i1) # Executar o primeiro iterador até ao fim [1, 2, 3] >>> list(i2) # Executar o segundo iterador até ao fim [1, 2, 3]

source: Note that :func:`tee` has to keep copies of the values returned by the iterator; in the worst case, it may need to keep all of them. This should therefore be used carefully if the leading iterator can run far ahead of the trailing iterator in a long stream of inputs. If the separation is large, then you might as well use :func:`list` instead. When the iterators track closely with one another, :func:`tee` is ideal. Possible applications include bookmarking, windowing, or lookahead iterators. (Contributed by Raymond Hettinger.)
pt_pt: Note que :func:`tee` tem de guardar cópias dos valores devolvidos pelo iterador; no pior caso, pode precisar de guardar todos eles. Isto deve, portanto, ser usado com cuidado se o iterador principal puder avançar muito à frente do iterador seguinte numa longa sequência de entradas. Se a separação for grande, então pode muito bem usar :func:`list` em vez disso. Quando os iteradores acompanham de perto um ao outro, :func:`tee` é ideal. Possíveis aplicações incluem marcação, janelamento ou iteradores de antevisão. (Contribuído por Raymond Hettinger.)
ru: Обратите внимание, что :func:`tee` должен хранить копии значений, возвращаемых итератором; в худшем случае может потребоваться сохранить их все. Поэтому его следует использовать с осторожностью, если ведущий итератор может опережать конечный итератор в длинном потоке входных данных. Если разделение велико, вы можете вместо этого использовать :func:`list`. Когда итераторы тесно связаны друг с другом, :func:`tee` идеален. Возможные приложения включают создание закладок, управление окнами или итераторы просмотра вперед. (Предоставлено Раймондом Хеттингером.)

source: A number of functions were added to the :mod:`locale` module, such as :func:`bind_textdomain_codeset` to specify a particular encoding and a family of :func:`!l\*gettext` functions that return messages in the chosen encoding. (Contributed by Gustavo Niemeyer.)
pt_pt: Várias funções foram adicionadas ao módulo :mod:`locale`, como :func:`bind_textdomain_codeset` para especificar uma codificação particular e uma família de funções :func:`!l\*gettext` que devolvem mensagens na codificação escolhida. (Contribuído por Gustavo Niemeyer.)
ru: В модуль :mod:`locale` был добавлен ряд функций, таких как :func:`bind_textdomain_codeset` для указания конкретной кодировки и семейство :func:`!l\*gettext` функций, которые возвращают сообщения в выбранном формате. кодировка. (Предоставлено Густаво Нимейером.)

source: Some keyword arguments were added to the :mod:`logging` package's :func:`basicConfig` function to simplify log configuration. The default behavior is to log messages to standard error, but various keyword arguments can be specified to log to a particular file, change the logging format, or set the logging level. For example::
pt_pt: Foram adicionados alguns argumentos nomeados à função :func:`basicConfig` do pacote :mod:`logging` para simplificar a configuração do registo. O comportamento predefinido é registar mensagens no erro padrão, mas vários argumentos nomeados podem ser especificados para registar num ficheiro específico, alterar o formato do registo ou definir o nível de registo. Por exemplo::
ru: Некоторые аргументы ключевых слов были добавлены в функцию :func:`basicConfig` пакета :mod:`logging` для упрощения настройки журнала. По умолчанию сообщения регистрируются в виде стандартных ошибок, но можно указать различные аргументы ключевых слов для регистрации в определенном файле, изменения формата регистрации или установки уровня регистрации. Например::

source: import logging logging.basicConfig(filename='/var/log/application.log', level=0, # Log all messages format='%(levelname):%(process):%(thread):%(message)')
pt_pt: import logging logging.basicConfig(filename='/var/log/application.log', level=0, # Registar todas as mensagens format='%(levelname):%(process):%(thread):%(message)')

source: Other additions to the :mod:`logging` package include a ``log(level, msg)`` convenience method, as well as a :class:`TimedRotatingFileHandler` class that rotates its log files at a timed interval. The module already had :class:`RotatingFileHandler`, which rotated logs once the file exceeded a certain size. Both classes derive from a new :class:`BaseRotatingHandler` class that can be used to implement other rotating handlers.
pt_pt: Outras adições ao pacote :mod:`logging` incluem um método de conveniência ``log(level, msg)``, bem como uma classe :class:`TimedRotatingFileHandler` que rota os seus ficheiros de registo em intervalos de tempo. O módulo já tinha :class:`RotatingFileHandler`, que rotava os registos quando o ficheiro excedia um certo tamanho. Ambas as classes derivam de uma nova classe :class:`BaseRotatingHandler` que pode ser usada para implementar outros manipuladores de rotação.
ru: Другие дополнения к пакету :mod:`logging` включают удобный метод ``log(level, msg)``, а также класс :class:`TimedRotatingFileHandler`, который меняет файлы журналов через определенный интервал времени. В модуле уже был :class:`RotatingFileHandler`, который выполнял ротацию журналов, когда файл превышал определенный размер. Оба класса являются производными от нового класса :class:`BaseRotatingHandler`, который можно использовать для реализации других обработчиков вращения.

source: (Changes implemented by Vinay Sajip.)
pt_pt: (Alterações implementadas por Vinay Sajip.)
ru: (Изменения внесены Винаем Саджипом.)

source: The :mod:`marshal` module now shares interned strings on unpacking a data structure. This may shrink the size of certain pickle strings, but the primary effect is to make :file:`.pyc` files significantly smaller. (Contributed by Martin von Löwis.)
pt_pt: O módulo :mod:`marshal` agora partilha strings internadas ao desempacotar uma estrutura de dados. Isto pode reduzir o tamanho de certas strings *pickle*, mas o efeito principal é tornar os ficheiros :file:`.pyc` significativamente mais pequenos. (Contribuído por Martin von Löwis.)
ru: Модуль :mod:`marshal` теперь использует встроенные строки при распаковке структуры данных. Это может уменьшить размер некоторых строк рассола, но основной эффект заключается в значительном уменьшении файлов :file:`.pyc`. (Предоставлено Мартином фон Лёвисом.)

source: The :mod:`!nntplib` module's :class:`NNTP` class gained :meth:`description` and :meth:`descriptions` methods to retrieve newsgroup descriptions for a single group or for a range of groups. (Contributed by Jürgen A. Erhard.)
pt_pt: A classe :class:`NNTP` do módulo :mod:`!nntplib` ganhou métodos :meth:`description` e :meth:`descriptions` para recuperar descrições de grupos de notícias para um grupo único ou para uma gama de grupos. (Contribuído por Jürgen A. Erhard.)

source: Two new functions were added to the :mod:`operator` module, ``attrgetter(attr)`` and ``itemgetter(index)``. Both functions return callables that take a single argument and return the corresponding attribute or item; these callables make excellent data extractors when used with :func:`map` or :func:`sorted`. For example::
pt_pt: Foram adicionadas duas novas funções ao módulo :mod:`operator`, ``attrgetter(attr)`` e ``itemgetter(index)``. Ambas as funções devolvem objetos chamáveis que recebem um único argumento e devolvem o atributo ou item correspondente; estes objetos chamáveis são excelentes extratores de dados quando usados com :func:`map` ou :func:`sorted`. Por exemplo::
ru: В модуль :mod:`operator` были добавлены две новые функции: ``attrgetter(attr)`` и ``itemgetter(index)``. Обе функции возвращают вызываемые объекты, которые принимают один аргумент и возвращают соответствующий атрибут или элемент; эти вызываемые объекты являются отличными экстракторами данных при использовании с :func:`map` или :func:`sorted`. Например::

source: >>> L = [('c', 2), ('d', 1), ('a', 4), ('b', 3)] >>> map(operator.itemgetter(0), L) ['c', 'd', 'a', 'b'] >>> map(operator.itemgetter(1), L) [2, 1, 4, 3] >>> sorted(L, key=operator.itemgetter(1)) # Sort list by second tuple item [('d', 1), ('c', 2), ('b', 3), ('a', 4)]
pt_pt: >>> L = [('c', 2), ('d', 1), ('a', 4), ('b', 3)] >>> map(operator.itemgetter(0), L) ['c', 'd', 'a', 'b'] >>> map(operator.itemgetter(1), L) [2, 1, 4, 3] >>> sorted(L, key=operator.itemgetter(1)) # Ordenar lista pelo segundo item do tuplo [('d', 1), ('c', 2), ('b', 3), ('a', 4)]

source: The :mod:`optparse` module was updated in various ways. The module now passes its messages through :func:`gettext.gettext`, making it possible to internationalize Optik's help and error messages. Help messages for options can now include the string ``'%default'``, which will be replaced by the option's default value. (Contributed by Greg Ward.)
pt_pt: O módulo :mod:`optparse` foi atualizado de várias formas. O módulo agora passa as suas mensagens por :func:`gettext.gettext`, tornando possível internacionalizar as mensagens de ajuda e erro do Optik. As mensagens de ajuda para opções podem agora incluir a string ``'%default'``, que será substituída pelo valor predefinido da opção. (Contribuído por Greg Ward.)
ru: Модуль :mod:`optparse` был обновлен различными способами. Теперь модуль передает свои сообщения через :func:`gettext.gettext`, что позволяет интернационализировать справку и сообщения об ошибках Optik. Справочные сообщения для опций теперь могут включать строку ``' %д efault'``, который будет заменен значением параметра по умолчанию. (Предоставлено Грегом Уордом.)

source: The long-term plan is to deprecate the :mod:`!rfc822` module in some future Python release in favor of the :mod:`email` package. To this end, the :func:`email.Utils.formatdate <email.utils.formatdate>` function has been changed to make it usable as a replacement for :func:`!rfc822.formatdate`. You may want to write new e-mail processing code with this in mind. (Change implemented by Anthony Baxter.)
pt_pt: O plano a longo prazo é descontinuar o módulo :mod:`!rfc822` numa futura versão do Python em favor do pacote :mod:`email`. Para este fim, a função :func:`email.Utils.formatdate <email.utils.formatdate>` foi alterada para a tornar utilizável como substituta de :func:`!rfc822.formatdate`. Pode querer escrever novo código de processamento de e-mail tendo isto em mente. (Alteração implementada por Anthony Baxter.)
ru: Долгосрочный план состоит в том, чтобы отказаться от модуля :mod:`!rfc822` в какой-либо будущей версии Python в пользу пакета :mod:`email`. С этой целью функция :func:`email.Utils.formatdate <email.utils.formatdate>` была изменена, чтобы ее можно было использовать в качестве замены :func:`!rfc822.formatdate`. Возможно, вы захотите написать новый код обработки электронной почты с учетом этого. (Изменение внесено Энтони Бакстером.)

source: A new ``urandom(n)`` function was added to the :mod:`os` module, returning a string containing *n* bytes of random data. This function provides access to platform-specific sources of randomness such as :file:`/dev/urandom` on Linux or the Windows CryptoAPI. (Contributed by Trevor Perrin.)
pt_pt: Foi adicionada uma nova função ``urandom(n)`` ao módulo :mod:`os`, que devolve uma string contendo *n* bytes de dados aleatórios. Esta função fornece acesso a fontes específicas da plataforma de aleatoriedade, como :file:`/dev/urandom` no Linux ou a Windows CryptoAPI. (Contribuído por Trevor Perrin.)
ru: В модуль :mod:`os` была добавлена ​​новая функция urandom(n)``, возвращающая строку, содержащую *n* байт случайных данных. Эта функция обеспечивает доступ к специфичным для платформы источникам случайности, таким как :file:`/dev/urandom` в Linux или Windows CryptoAPI. (Предоставлено Тревором Перрином.)

source: Another new function: ``os.path.lexists(path)`` returns true if the file specified by *path* exists, whether or not it's a symbolic link. This differs from the existing ``os.path.exists(path)`` function, which returns false if *path* is a symlink that points to a destination that doesn't exist. (Contributed by Beni Cherniavsky.)
pt_pt: Outra nova função: ``os.path.lexists(path)`` devolve verdadeiro se o ficheiro especificado por *path* existir, independentemente de ser ou não uma ligação simbólica. Isto difere da função existente ``os.path.exists(path)``, que devolve falso se *path* for uma ligação simbólica que aponta para um destino que não existe. (Contribuído por Beni Cherniavsky.)
ru: Еще одна новая функция: ``os.path.lexists(path)`` возвращает true, если файл, указанный *path*, существует, независимо от того, является ли он символической ссылкой или нет. Это отличается от существующей функции os.path.exists(path)``, которая возвращает false, если *path* является символической ссылкой, указывающей на несуществующий пункт назначения. (Предоставлено Бени Чернявским.)

source: A new :func:`getsid` function was added to the :mod:`posix` module that underlies the :mod:`os` module. (Contributed by J. Raynor.)
pt_pt: Foi adicionada uma nova função :func:`getsid` ao módulo :mod:`posix`, que está na base do módulo :mod:`os`. (Contribuído por J. Raynor.)
ru: В модуль :mod:`posix`, лежащий в основе модуля :mod:`os`, была добавлена ​​новая функция :func:`getsid`. (Предоставлено Дж. Рейнором.)

source: The :mod:`poplib` module now supports POP over SSL. (Contributed by Hector Urtubia.)
pt_pt: O módulo :mod:`poplib` agora suporta POP sobre SSL. (Contribuído por Hector Urtubia.)
ru: Модуль :mod:`poplib` теперь поддерживает POP через SSL. (Предоставлено Гектором Уртубией.)

source: The :mod:`profile` module can now profile C extension functions. (Contributed by Nick Bastin.)
pt_pt: O módulo :mod:`profile` pode agora fazer *profile* de funções de extensão C. (Contribuído por Nick Bastin.)
ru: Модуль :mod:`profile` теперь может профилировать функции расширения C. (Предоставлено Ником Бастином.)

source: The :mod:`random` module has a new method called ``getrandbits(N)`` that returns a long integer *N* bits in length. The existing :meth:`randrange` method now uses :meth:`getrandbits` where appropriate, making generation of arbitrarily large random numbers more efficient. (Contributed by Raymond Hettinger.)
pt_pt: O módulo :mod:`random` tem um novo método chamado ``getrandbits(N)`` que devolve um inteiro longo com *N* bits de comprimento. O método existente :meth:`randrange` agora usa :meth:`getrandbits` onde apropriado, tornando a geração de números aleatórios arbitrariamente grandes mais eficiente. (Contribuído por Raymond Hettinger.)
ru: Модуль :mod:`random` имеет новый метод под названием ``getrandbits(N)``, который возвращает длинное целое число длиной *N* бит. Существующий метод :meth:`randrange` теперь использует :meth:`getrandbits` там, где это необходимо, что делает генерацию произвольно больших случайных чисел более эффективной. (Предоставлено Раймондом Хеттингером.)

source: The regular expression language accepted by the :mod:`re` module was extended with simple conditional expressions, written as ``(?(group)A|B)``. *group* is either a numeric group ID or a group name defined with ``(?P<group>...)`` earlier in the expression. If the specified group matched, the regular expression pattern *A* will be tested against the string; if the group didn't match, the pattern *B* will be used instead. (Contributed by Gustavo Niemeyer.)
pt_pt: A linguagem de expressões regulares aceite pelo módulo :mod:`re` foi estendida com expressões condicionais simples, escritas como ``(?(group)A|B)``. *group* é um ID de grupo numérico ou um nome de grupo definido com ``(?P<group>...)`` mais cedo na expressão. Se o grupo especificado corresponder, o padrão de expressão regular *A* será testado contra a string; se o grupo não corresponder, o padrão *B* será usado em vez disso. (Contribuído por Gustavo Niemeyer.)
ru: Язык регулярных выражений, принятый модулем :mod:`re`, был расширен простыми условными выражениями, записанными как ``(?(group)A|B)``. *group* — это либо числовой идентификатор группы, либо имя группы, определенное с помощью ``(?P<group>...)`` ранее в выражении. Если указанная группа соответствует, шаблон регулярного выражения *A* будет проверен на соответствие строке; если группа не совпала, вместо нее будет использоваться шаблон *B*. (Предоставлено Густаво Нимейером.)

source: The :mod:`re` module is also no longer recursive, thanks to a massive amount of work by Gustavo Niemeyer. In a recursive regular expression engine, certain patterns result in a large amount of C stack space being consumed, and it was possible to overflow the stack. For example, if you matched a 30000-byte string of ``a`` characters against the expression ``(a|b)+``, one stack frame was consumed per character. Python 2.3 tried to check for stack overflow and raise a :exc:`RuntimeError` exception, but certain patterns could sidestep the checking and if you were unlucky Python could segfault. Python 2.4's regular expression engine can match this pattern without problems.
pt_pt: O módulo :mod:`re` também já não é recursivo, graças a uma enorme quantidade de trabalho de Gustavo Niemeyer. Num motor de expressões regulares recursivo, certos padrões resultam numa grande quantidade de espaço de *stack* C a ser consumido, e era possível transbordar a *stack*. Por exemplo, se correspondesse uma string de 30000 bytes de caracteres ``a`` à expressão ``(a|b)+``, um quadro de *stack* era consumido por caractere. O Python 2.3 tentou verificar o transbordo da *stack* e gerar uma exceção :exc:`RuntimeError`, mas certos padrões podiam contornar a verificação e, se tivesse azar, o Python podia causar um *segfault*. O motor de expressões regulares do Python 2.4 pode corresponder a este padrão sem problemas.
ru: Модуль :mod:`re` также больше не является рекурсивным благодаря огромной работе Густаво Нимейера. В рекурсивном механизме регулярных выражений некоторые шаблоны приводят к использованию большого объема стека C, и стек может переполниться. Например, если вы сопоставили 30000-байтовую строку символов ``a`` с выражением ``(a|b)+``, на каждый символ был использован один кадр стека. Python 2.3 пытался проверить переполнение стека и вызвать исключение :exc:`RuntimeError`, но некоторые шаблоны могли обойти проверку, и если вам не повезет, Python мог совершить ошибку segfault. Механизм регулярных выражений Python 2.4 без проблем может сопоставить этот шаблон.

source: The :mod:`signal` module now performs tighter error-checking on the parameters to the :func:`signal.signal` function. For example, you can't set a handler on the :const:`SIGKILL` signal; previous versions of Python would quietly accept this, but 2.4 will raise a :exc:`RuntimeError` exception.
pt_pt: O módulo :mod:`signal` agora realiza uma verificação de erros mais rigorosa nos parâmetros da função :func:`signal.signal`. Por exemplo, não pode definir um manipulador no sinal :const:`SIGKILL`; versões anteriores do Python aceitavam isto silenciosamente, mas o 2.4 irá gerar uma exceção :exc:`RuntimeError`.
ru: Модуль :mod:`signal` теперь выполняет более тщательную проверку ошибок в параметрах функции :func:`signal.signal`. Например, вы не можете установить обработчик сигнала :const:`SIGKILL`; предыдущие версии Python спокойно это принимали, но версия 2.4 вызовет исключение :exc:`RuntimeError`.

source: Two new functions were added to the :mod:`socket` module. :func:`socketpair` returns a pair of connected sockets and ``getservbyport(port)`` looks up the service name for a given port number. (Contributed by Dave Cole and Barry Warsaw.)
pt_pt: Foram adicionadas duas novas funções ao módulo :mod:`socket`. :func:`socketpair` devolve um par de *sockets* conectados e ``getservbyport(port)`` pesquisa o nome do serviço para um número de porta dado. (Contribuído por Dave Cole e Barry Warsaw.)
ru: В модуль :mod:`socket` были добавлены две новые функции. :func:`socketpair` возвращает пару подключенных сокетов, а ``getservbyport(port)`` ищет имя службы для заданного номера порта. (Сообщили Дэйв Коул и Барри Варшава.)

source: The :func:`sys.exitfunc` function has been deprecated. Code should be using the existing :mod:`atexit` module, which correctly handles calling multiple exit functions. Eventually :func:`sys.exitfunc` will become a purely internal interface, accessed only by :mod:`atexit`.
pt_pt: A função :func:`sys.exitfunc` foi descontinuada. O código deve usar o módulo :mod:`atexit` existente, que trata corretamente da chamada de múltiplas funções de saída. Eventualmente, :func:`sys.exitfunc` tornar-se-á uma interface puramente interna, acedida apenas por :mod:`atexit`.
ru: Функция :func:`sys.exitfunc` устарела. Код должен использовать существующий модуль :mod:`atexit`, который правильно обрабатывает вызов нескольких функций выхода. Со временем :func:`sys.exitfunc` станет чисто внутренним интерфейсом, доступ к которому будет иметь только :mod:`atexit`.
