Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: The new feature is called "function decorators". The name comes from the idea that :func:`classmethod`, :func:`staticmethod`, and friends are storing additional information on a function object; they're *decorating* functions with more details.
pt_pt: A nova funcionalidade chama-se "decoradores de funções". O nome vem da ideia de que :func:`classmethod`, :func:`staticmethod` e similares estão a armazenar informação adicional num objeto de função; estão a *decorar* funções com mais detalhes.
ru: Новая функция называется «декораторы функций». Название происходит от идеи, что :func:`classmethod`, :func:`staticmethod` и другие хранят дополнительную информацию о функциональном объекте; они *украшают* функции более подробной информацией.

source: The notation borrows from Java and uses the ``'@'`` character as an indicator. Using the new syntax, the example above would be written::
pt_pt: A notação é emprestada do Java e usa o carácter ``'@'`` como indicador. Usando a nova sintaxe, o exemplo acima seria escrito::
ru: Обозначение заимствовано из Java и в качестве индикатора используется символ ``'@'``. Используя новый синтаксис, приведенный выше пример будет выглядеть так:

source: The ``@classmethod`` is shorthand for the ``meth=classmethod(meth)`` assignment. More generally, if you have the following::
pt_pt: O ``@classmethod`` é uma abreviatura para a atribuição ``meth=classmethod(meth)``. Mais genericamente, se tiver o seguinte::
ru: ``@classmethod`` является сокращением для ``meth=classmethod(meth)``. В более общем плане, если у вас есть следующее:

source: It's equivalent to the following pre-decorator code::
pt_pt: É equivalente ao seguinte código pré-decorador::
ru: Это эквивалентно следующему коду предварительного декоратора::

source: Decorators must come on the line before a function definition, one decorator per line, and can't be on the same line as the def statement, meaning that ``@A def f(): ...`` is illegal. You can only decorate function definitions, either at the module level or inside a class; you can't decorate class definitions.
pt_pt: Os decoradores têm de vir na linha antes da definição de uma função, um decorador por linha, e não podem estar na mesma linha que a instrução def, o que significa que ``@A def f(): ...`` é ilegal. Só pode decorar definições de funções, quer ao nível do módulo, quer dentro de uma classe; não pode decorar definições de classe.
ru: Декораторы должны располагаться в строке перед определением функции, по одному декоратору в каждой строке, и не могут находиться в той же строке, что и оператор def, а это означает, что ``@A def f(): ...`` недопустим. Вы можете декорировать определения функций только на уровне модуля или внутри класса; вы не можете украшать определения классов.

source: A decorator is just a function that takes the function to be decorated as an argument and returns either the same function or some new object. The return value of the decorator need not be callable (though it typically is), unless further decorators will be applied to the result. It's easy to write your own decorators. The following simple example just sets an attribute on the function object::
pt_pt: Um decorador é apenas uma função que recebe a função a ser decorada como argumento e devolve a mesma função ou algum novo objeto. O valor de retorno do decorador não precisa de ser chamável (embora normalmente seja), a menos que outros decoradores sejam aplicados ao resultado. É fácil escrever os seus próprios decoradores. O exemplo simples seguinte define apenas um atributo no objeto de função::
ru: Декоратор — это просто функция, которая принимает декорируемую функцию в качестве аргумента и возвращает либо ту же функцию, либо какой-то новый объект. Возвращаемое значение декоратора не обязательно должно быть вызываемым (хотя обычно это так), если к результату не будут применены дополнительные декораторы. Легко написать свои собственные декораторы. Следующий простой пример просто устанавливает атрибут объекта функции:

source: >>> def deco(func): ... func.attr = 'decorated' ... return func ... >>> @deco ... def f(): pass ... >>> f <function f at 0x402ef0d4> >>> f.attr 'decorated' >>>
pt_pt: >>> def deco(func): ... func.attr = 'decorado' ... return func ... >>> @deco ... def f(): pass ... >>> f <function f at 0x402ef0d4> >>> f.attr 'decorado' >>>

source: As a slightly more realistic example, the following decorator checks that the supplied argument is an integer::
pt_pt: Como um exemplo um pouco mais realista, o seguinte decorador verifica se o argumento fornecido é um inteiro::
ru: В качестве более реалистичного примера следующий декоратор проверяет, является ли предоставленный аргумент целым числом:

source: An example in :pep:`318` contains a fancier version of this idea that lets you both specify the required type and check the returned type.
pt_pt: Um exemplo na :pep:`318` contém uma versão mais elaborada desta ideia que permite especificar o tipo necessário e verificar o tipo devolvido.
ru: Пример в :pep:`318` содержит более интересную версию этой идеи, которая позволяет вам указать требуемый тип и проверить возвращаемый тип.

source: Decorator functions can take arguments. If arguments are supplied, your decorator function is called with only those arguments and must return a new decorator function; this function must take a single function and return a function, as previously described. In other words, ``@A @B @C(args)`` becomes::
pt_pt: As funções decoradoras podem receber argumentos. Se forem fornecidos argumentos, a sua função decoradora é chamada apenas com esses argumentos e deve devolver uma nova função decoradora; esta função deve receber uma única função e devolver uma função, como descrito anteriormente. Em outras palavras, ``@A @B @C(args)`` torna-se::
ru: Функции-декораторы могут принимать аргументы. Если аргументы указаны, ваша функция-декоратор вызывается только с этими аргументами и должна возвращать новую функцию-декоратор; эта функция должна принимать одну функцию и возвращать функцию, как описано ранее. Другими словами, ``@A @B @C(args)`` становится::

source: Getting this right can be slightly brain-bending, but it's not too difficult.
pt_pt: Acertar nisto pode ser um pouco confuso, mas não é demasiado difícil.
ru: Сделать это правильно может быть немного сложно, но это не так уж сложно.

source: A small related change makes the :attr:`func_name <function.__name__>` attribute of functions writable. This attribute is used to display function names in tracebacks, so decorators should change the name of any new function that's constructed and returned.
pt_pt: Uma pequena alteração relacionada torna o atributo :attr:`func_name <function.__name__>` das funções gravável. Este atributo é usado para mostrar nomes de funções em *tracebacks*, pelo que os decoradores devem alterar o nome de qualquer nova função que seja construída e devolvida.
ru: Небольшое связанное с этим изменение делает атрибут :attr:`func_name <function.__name__>` функций доступным для записи. Этот атрибут используется для отображения имен функций в обратных трассировках, поэтому декораторы должны изменять имя любой новой функции, которая создается и возвращается.

source: :pep:`318` - Decorators for Functions, Methods and Classes
pt_pt: :pep:`318` - Decoradores para Funções, Métodos e Classes
ru: :pep:`318` - Декораторы для функций, методов и классов

source: Written by Kevin D. Smith, Jim Jewett, and Skip Montanaro. Several people wrote patches implementing function decorators, but the one that was actually checked in was patch #979728, written by Mark Russell.
pt_pt: Escrito por Kevin D. Smith, Jim Jewett e Skip Montanaro. Várias pessoas escreveram correções que implementavam decoradores de funções, mas a que foi efetivamente verificada foi a correção #979728, escrita por Mark Russell.
ru: Авторы сценария Кевин Д. Смит, Джим Джуэтт и Скип Монтанаро. Несколько человек написали патчи, реализующие декораторы функций, но на самом деле был проверен патч № 979728, написанный Марком Расселом.

source: This Wiki page contains several examples of decorators.
pt_pt: Esta página Wiki contém vários exemplos de decoradores.
ru: Эта Wiki-страница содержит несколько примеров декораторов.

source: PEP 322: Reverse Iteration
pt_pt: PEP 322: Iteração Inversa
ru: PEP 322: Обратная итерация

source: A new built-in function, ``reversed(seq)``, takes a sequence and returns an iterator that loops over the elements of the sequence in reverse order. ::
pt_pt: Uma nova função integrada, ``reversed(seq)``, recebe uma sequência e devolve um iterador que percorre os elementos da sequência por ordem inversa. ::
ru: Новая встроенная функция reversed(seq) принимает последовательность и возвращает итератор, который перебирает элементы последовательности в обратном порядке. ::

source: Compared to extended slicing, such as ``range(1,4)[::-1]``, :func:`reversed` is easier to read, runs faster, and uses substantially less memory.
pt_pt: Comparado com o fatiamento estendido, como ``range(1,4)[::-1]``, :func:`reversed` é mais fácil de ler, executa mais rápido e usa substancialmente menos memória.
ru: По сравнению с расширенным срезом, таким как ``range(1,4)[::-1]``, :func:`reversed` легче читается, работает быстрее и использует существенно меньше памяти.

source: Note that :func:`reversed` only accepts sequences, not arbitrary iterators. If you want to reverse an iterator, first convert it to a list with :func:`list`. ::
pt_pt: Note que :func:`reversed` só aceita sequências, não iteradores arbitrários. Se pretender inverter um iterador, primeiro converta-o para uma lista com :func:`list`. ::
ru: Обратите внимание, что :func:`reversed` принимает только последовательности, а не произвольные итераторы. Если вы хотите перевернуть итератор, сначала преобразуйте его в список с помощью :func:`list`. ::

source: >>> input = open('/etc/passwd', 'r') >>> for line in reversed(list(input)): ... print line ... root:*:0:0:System Administrator:/var/root:/bin/tcsh ...
pt_pt: >>> input = open('/etc/passwd', 'r') >>> for line in reversed(list(input)): ... print line ... root:*:0:0:Administrador do Sistema:/var/root:/bin/tcsh ...

source: :pep:`322` - Reverse Iteration
pt_pt: :pep:`322` - Iteração Inversa
ru: :pep:`322` - Обратная итерация

source: Written and implemented by Raymond Hettinger.
pt_pt: Escrito e implementado por Raymond Hettinger.
ru: Написано и реализовано Раймондом Хеттингером.

source: PEP 324: New subprocess Module
pt_pt: PEP 324: Novo Módulo subprocess
ru: PEP 324: Новый модуль подпроцесса

source: The standard library provides a number of ways to execute a subprocess, offering different features and different levels of complexity. ``os.system(command)`` is easy to use, but slow (it runs a shell process which executes the command) and dangerous (you have to be careful about escaping the shell's metacharacters). The :mod:`!popen2` module offers classes that can capture standard output and standard error from the subprocess, but the naming is confusing. The :mod:`subprocess` module cleans this up, providing a unified interface that offers all the features you might need.
pt_pt: A biblioteca padrão fornece várias formas de executar um subprocesso, oferecendo diferentes funcionalidades e diferentes níveis de complexidade. ``os.system(command)`` é fácil de usar, mas lento (executa um processo de shell que executa o comando) e perigoso (tem de ter cuidado ao escapar os metacaracteres do shell). O módulo :mod:`!popen2` oferece classes que podem capturar a saída padrão e o erro padrão do subprocesso, mas a nomenclatura é confusa. O módulo :mod:`subprocess` simplifica isto, fornecendo uma interface unificada que oferece todas as funcionalidades de que possa precisar.
ru: Стандартная библиотека предоставляет несколько способов выполнения подпроцесса, предлагая различные функции и разные уровни сложности. ``os.system(command)`` прост в использовании, но медленный (он запускает процесс оболочки, который выполняет команду) и опасный (вы должны быть осторожны с экранированием метасимволов оболочки). Модуль :mod:`!popen2` предлагает классы, которые могут захватывать стандартный вывод и стандартные ошибки из подпроцесса, но их имена сбивают с толку. Модуль :mod:`subprocess` исправляет это, предоставляя унифицированный интерфейс, предлагающий все функции, которые могут вам понадобиться.

source: Instead of :mod:`!popen2`'s collection of classes, :mod:`subprocess` contains a single class called :class:`subprocess.Popen` whose constructor supports a number of different keyword arguments. ::
pt_pt: Em vez da coleção de classes do :mod:`!popen2`, o :mod:`subprocess` contém uma única classe chamada :class:`subprocess.Popen`, cujo construtor suporta vários argumentos nomeados diferentes. ::
ru: Вместо коллекции классов :mod:`!popen2`, :mod:`subprocess` содержит один класс с именем :class:`subprocess.Popen`, конструктор которого поддерживает ряд различных ключевых аргументов. ::

source: *args* is commonly a sequence of strings that will be the arguments to the program executed as the subprocess. (If the *shell* argument is true, *args* can be a string which will then be passed on to the shell for interpretation, just as :func:`os.system` does.)
pt_pt: *args* é normalmente uma sequência de strings que serão os argumentos para o programa executado como subprocesso. (Se o argumento *shell* for verdadeiro, *args* pode ser uma string que será então passada para o shell para interpretação, tal como :func:`os.system` faz.)
ru: *args* обычно представляет собой последовательность строк, которые будут аргументами программы, выполняемой как подпроцесс. (Если аргумент *shell* имеет значение true, *args* может быть строкой, которая затем будет передана оболочке для интерпретации, как это делает :func:`os.system`.)

source: *stdin*, *stdout*, and *stderr* specify what the subprocess's input, output, and error streams will be. You can provide a file object or a file descriptor, or you can use the constant ``subprocess.PIPE`` to create a pipe between the subprocess and the parent.
pt_pt: *stdin*, *stdout* e *stderr* especificam o que serão os fluxos de entrada, saída e erro do subprocesso. Pode fornecer um objeto de ficheiro ou um descritor de ficheiro, ou pode usar a constante ``subprocess.PIPE`` para criar um *pipe* entre o subprocesso e o processo pai.
ru: *stdin*, *stdout* и *stderr* определяют, какими будут потоки ввода, вывода и ошибок подпроцесса. Вы можете предоставить файловый объект или файловый дескриптор или использовать константу subprocess.PIPE для создания канала между подпроцессом и родительским процессом.

source: The constructor has a number of handy options:
pt_pt: O construtor tem várias opções úteis:
ru: Конструктор имеет ряд удобных опций:

source: *close_fds* requests that all file descriptors be closed before running the subprocess.
pt_pt: *close_fds* solicita que todos os descritores de ficheiro sejam fechados antes de executar o subprocesso.
ru: *close_fds* запрашивает закрытие всех файловых дескрипторов перед запуском подпроцесса.

source: *cwd* specifies the working directory in which the subprocess will be executed (defaulting to whatever the parent's working directory is).
pt_pt: *cwd* especifica o diretório de trabalho no qual o subprocesso será executado (por predefinição, o diretório de trabalho do processo pai).
ru: *cwd* указывает рабочий каталог, в котором будет выполняться подпроцесс (по умолчанию используется рабочий каталог родительского процесса).

source: *env* is a dictionary specifying environment variables.
pt_pt: *env* é um dicionário que especifica variáveis de ambiente.
ru: *env* — словарь, определяющий переменные среды.

source: *preexec_fn* is a function that gets called before the child is started.
pt_pt: *preexec_fn* é uma função que é chamada antes de o processo filho ser iniciado.
ru: *preexec_fn* — это функция, которая вызывается перед запуском дочернего элемента.

source: *universal_newlines* opens the child's input and output using Python's :term:`universal newlines` feature.
pt_pt: *universal_newlines* abre a entrada e saída do processo filho usando a funcionalidade :term:`universal newlines` do Python.
ru: *universal_newlines* открывает ввод и вывод дочернего элемента с помощью функции Python :term:`universal newlines`.

source: Once you've created the :class:`Popen` instance, you can call its :meth:`wait` method to pause until the subprocess has exited, :meth:`poll` to check if it's exited without pausing, or ``communicate(data)`` to send the string *data* to the subprocess's standard input. ``communicate(data)`` then reads any data that the subprocess has sent to its standard output or standard error, returning a tuple ``(stdout_data, stderr_data)``.
pt_pt: Depois de criar a instância :class:`Popen`, pode chamar o seu método :meth:`wait` para pausar até que o subprocesso tenha terminado, :meth:`poll` para verificar se terminou sem pausar, ou ``communicate(data)`` para enviar a string *data* para a entrada padrão do subprocesso. ``communicate(data)`` lê então quaisquer dados que o subprocesso tenha enviado para a sua saída padrão ou erro padrão, devolvendo um tuplo ``(stdout_data, stderr_data)``.
ru: После того, как вы создали экземпляр :class:`Popen`, вы можете вызвать его метод :meth:`wait` для приостановки до завершения подпроцесса, :meth:`poll`, чтобы проверить, завершился ли он без паузы, или `` communication(data)`` для отправки строки *data* на стандартный ввод подпроцесса. ``communicate(data)`` затем считывает любые данные, которые подпроцесс отправил на свой стандартный вывод или стандартную ошибку, возвращая кортеж ``(stdout_data, stderr_data)``.

source: :func:`call` is a shortcut that passes its arguments along to the :class:`Popen` constructor, waits for the command to complete, and returns the status code of the subprocess. It can serve as a safer analog to :func:`os.system`::
pt_pt: :func:`call` é um atalho que passa os seus argumentos para o construtor :class:`Popen`, espera que o comando seja concluído e devolve o código de estado do subprocesso. Pode servir como um análogo mais seguro a :func:`os.system`::
ru: :func:`call` — это ярлык, который передает свои аргументы конструктору :class:`Popen`, ожидает завершения команды и возвращает код состояния подпроцесса. Он может служить более безопасным аналогом :func:`os.system`::

source: sts = subprocess.call(['dpkg', '-i', '/tmp/new-package.deb']) if sts == 0: # Success ... else: # dpkg returned an error ...
pt_pt: sts = subprocess.call(['dpkg', '-i', '/tmp/new-package.deb']) if sts == 0: # Sucesso ... else: # dpkg devolveu um erro ...

source: The command is invoked without use of the shell. If you really do want to use the shell, you can add ``shell=True`` as a keyword argument and provide a string instead of a sequence::
pt_pt: O comando é invocado sem usar o shell. Se realmente pretender usar o shell, pode adicionar ``shell=True`` como argumento nomeado e fornecer uma string em vez de uma sequência::
ru: Команда вызывается без использования оболочки. Если вы действительно хотите использовать оболочку, вы можете добавить ``shell=True`` в качестве аргумента ключевого слова и предоставить строку вместо последовательности::

source: The PEP takes various examples of shell and Python code and shows how they'd be translated into Python code that uses :mod:`subprocess`. Reading this section of the PEP is highly recommended.
pt_pt: A PEP apresenta vários exemplos de código shell e Python e mostra como seriam traduzidos para código Python que usa :mod:`subprocess`. A leitura desta secção da PEP é altamente recomendada.
ru: PEP берет различные примеры кода оболочки и Python и показывает, как их можно перевести в код Python, использующий :mod:`subprocess`. Настоятельно рекомендуется прочитать этот раздел PEP.

source: :pep:`324` - subprocess - New process module
pt_pt: :pep:`324` - subprocess - Novo módulo de processo
ru: :pep:`324` - подпроцесс - Новый модуль процесса

source: Written and implemented by Peter Åstrand, with assistance from Fredrik Lundh and others.
pt_pt: Escrito e implementado por Peter Åstrand, com assistência de Fredrik Lundh e outros.
ru: Написано и реализовано Питером Острандом при содействии Фредрика Лунда и других.

source: PEP 327: Decimal Data Type
pt_pt: PEP 327: Tipo de Dados Decimal
ru: PEP 327: Десятичный тип данных

source: Python has always supported floating-point (FP) numbers, based on the underlying C :c:expr:`double` type, as a data type. However, while most programming languages provide a floating-point type, many people (even programmers) are unaware that floating-point numbers don't represent certain decimal fractions accurately. The new :class:`Decimal` type can represent these fractions accurately, up to a user-specified precision limit.
pt_pt: O Python sempre suportou números de vírgula flutuante (FP), baseados no tipo C :c:expr:`double`, como um tipo de dados. No entanto, embora a maioria das linguagens de programação forneça um tipo de vírgula flutuante, muitas pessoas (até programadores) não estão cientes de que os números de vírgula flutuante não representam certas frações decimais com precisão. O novo tipo :class:`Decimal` pode representar estas frações com precisão, até um limite de precisão especificado pelo utilizador.
ru: Python всегда поддерживал числа с плавающей запятой (FP), основанные на базовом типе C :c:expr:`double`, в качестве типа данных. Однако, хотя большинство языков программирования предоставляют тип с плавающей запятой, многие люди (даже программисты) не знают, что числа с плавающей запятой неточно представляют определенные десятичные дроби. Новый тип :class:`Decimal` может точно представлять эти дроби, вплоть до заданного пользователем предела точности.

source: Why is Decimal needed?
pt_pt: Porque é que o Decimal é necessário?
ru: Зачем нужна десятичная дробь?

source: The limitations arise from the representation used for floating-point numbers. FP numbers are made up of three components:
pt_pt: As limitações surgem da representação usada para números de vírgula flutuante. Os números FP são compostos por três componentes:
ru: Ограничения возникают из-за представления, используемого для чисел с плавающей запятой. Числа FP состоят из трех компонентов:

source: The sign, which is positive or negative.
pt_pt: O sinal, que é positivo ou negativo.
ru: Знак, который является положительным или отрицательным.

source: The mantissa, which is a single-digit binary number followed by a fractional part. For example, ``1.01`` in base-2 notation is ``1 + 0/2 + 1/4``, or 1.25 in decimal notation.
pt_pt: A mantissa, que é um número binário de um único dígito seguido por uma parte fracionária. Por exemplo, ``1.01`` em notação base-2 é ``1 + 0/2 + 1/4``, ou 1.25 em notação decimal.
ru: Мантисса — однозначное двоичное число, за которым следует дробная часть. Например, «1,01» в системе счисления с основанием 2 — это «1 + 0/2 + 1/4» или 1,25 в десятичной системе счисления.

source: The exponent, which tells where the decimal point is located in the number represented.
pt_pt: O expoente, que indica onde está localizado o ponto decimal no número representado.
ru: Показатель степени, указывающий, где находится десятичная точка в представленном числе.
