Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: The machinery for growing and shrinking lists was optimized for speed and for space efficiency. Appending and popping from lists now runs faster due to more efficient code paths and less frequent use of the underlying system :c:func:`realloc`. List comprehensions also benefit. :meth:`list.extend` was also optimized and no longer converts its argument into a temporary list before extending the base list. (Contributed by Raymond Hettinger.)
pt_pt: A maquinaria para aumentar e diminuir listas foi otimizada para velocidade e eficiência de espaço. A adição e remoção de listas agora executam mais rapidamente devido a caminhos de código mais eficientes e uso menos frequente da função de sistema subjacente :c:func:`realloc`. As *list comprehensions* também beneficiam. O método :meth:`list.extend` também foi otimizado e já não converte o seu argumento numa lista temporária antes de estender a lista base. (Contribuído por Raymond Hettinger.)
ru: Механизм увеличения и сокращения списков был оптимизирован с точки зрения скорости и эффективности использования пространства. Добавление и извлечение списков теперь выполняется быстрее благодаря более эффективным путям кода и менее частому использованию базовой системы :c:func:`realloc`. Понимание списков также приносит пользу. :meth:`list.extend` также был оптимизирован и больше не преобразует свой аргумент во временный список перед расширением базового списка. (Предоставлено Раймондом Хеттингером.)

source: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter`, and :func:`zip` now run several times faster with non-sequence arguments that supply a :meth:`__len__` method. (Contributed by Raymond Hettinger.)
pt_pt: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter` e :func:`zip` agora executam várias vezes mais rápido com argumentos não-sequência que fornecem um método :meth:`__len__`. (Contribuído por Raymond Hettinger.)
ru: :func:`list`, :func:`tuple`, :func:`map`, :func:`filter` и :func:`zip` теперь выполняются в несколько раз быстрее с аргументами, не являющимися последовательностями, которые предоставляют :meth :`__len__` метод. (Предоставлено Раймондом Хеттингером.)

source: The methods :meth:`list.__getitem__`, :meth:`dict.__getitem__`, and :meth:`dict.__contains__` are now implemented as :class:`method_descriptor` objects rather than :class:`wrapper_descriptor` objects. This form of access doubles their performance and makes them more suitable for use as arguments to functionals: ``map(mydict.__getitem__, keylist)``. (Contributed by Raymond Hettinger.)
pt_pt: Os métodos :meth:`list.__getitem__`, :meth:`dict.__getitem__` e :meth:`dict.__contains__` são agora implementados como objetos :class:`method_descriptor` em vez de objetos :class:`wrapper_descriptor`. Esta forma de acesso duplica o seu desempenho e torna-os mais adequados para uso como argumentos para funcionais: ``map(mydict.__getitem__, keylist)``. (Contribuído por Raymond Hettinger.)
ru: Методы :meth:`list.__getitem__`, :meth:`dict.__getitem__` и :meth:`dict.__contains__` теперь реализованы как объекты :class:`method_descriptor`, а не как объекты :class:`wrapper_descriptor`. Такая форма доступа удваивает их производительность и делает их более подходящими для использования в качестве аргументов функционалов: ``map(mydict.__getitem__, keylist)``. (Предоставлено Раймондом Хеттингером.)

source: Added a new opcode, ``LIST_APPEND``, that simplifies the generated bytecode for list comprehensions and speeds them up by about a third. (Contributed by Raymond Hettinger.)
pt_pt: Foi adicionado um novo *opcode*, ``LIST_APPEND``, que simplifica o *bytecode* gerado para *list comprehensions* e acelera-as cerca de um terço. (Contribuído por Raymond Hettinger.)
ru: Добавлен новый код операции LIST_APPEND, который упрощает сгенерированный байт-код для понимания списков и ускоряет их примерно на треть. (Предоставлено Раймондом Хеттингером.)

source: The peephole bytecode optimizer has been improved to produce shorter, faster bytecode; remarkably, the resulting bytecode is more readable. (Enhanced by Raymond Hettinger.)
pt_pt: O otimizador de *bytecode* *peephole* foi melhorado para produzir *bytecode* mais curto e rápido; notavelmente, o *bytecode* resultante é mais legível. (Melhorado por Raymond Hettinger.)
ru: Оптимизатор байт-кода «глазок» был улучшен для создания более короткого и быстрого байт-кода; примечательно, что полученный байт-код становится более читабельным. (Улучшено Раймондом Хеттингером.)

source: String concatenations in statements of the form ``s = s + "abc"`` and ``s += "abc"`` are now performed more efficiently in certain circumstances. This optimization won't be present in other Python implementations such as Jython, so you shouldn't rely on it; using the :meth:`join` method of strings is still recommended when you want to efficiently glue a large number of strings together. (Contributed by Armin Rigo.)
pt_pt: A concatenação de strings em instruções da forma ``s = s + "abc"`` e ``s += "abc"`` é agora realizada de forma mais eficiente em certas circunstâncias. Esta otimização não estará presente em outras implementações do Python, como o Jython, pelo que não deve depender dela; o uso do método :meth:`join` das strings ainda é recomendado quando pretende colar eficientemente um grande número de strings. (Contribuído por Armin Rigo.)
ru: Конкатенация строк в операторах вида ``s = s + "abc"`` и ``s += "abc"`` теперь выполняется более эффективно при определенных обстоятельствах. Эта оптимизация не будет присутствовать в других реализациях Python, таких как Jython, поэтому вам не следует на нее полагаться; использование метода строк :meth:`join` по-прежнему рекомендуется, если вы хотите эффективно склеить большое количество строк вместе. (Предоставлено Армином Риго.)

source: The net result of the 2.4 optimizations is that Python 2.4 runs the pystone benchmark around 5% faster than Python 2.3 and 35% faster than Python 2.2. (pystone is not a particularly good benchmark, but it's the most commonly used measurement of Python's performance. Your own applications may show greater or smaller benefits from Python 2.4.)
pt_pt: O resultado líquido das otimizações do 2.4 é que o Python 2.4 executa o *benchmark* pystone cerca de 5% mais rápido do que o Python 2.3 e 35% mais rápido do que o Python 2.2. (pystone não é um *benchmark* particularmente bom, mas é a medição mais comumente usada do desempenho do Python. As suas próprias aplicações podem mostrar benefícios maiores ou menores do Python 2.4.)
ru: Конечным результатом оптимизации 2.4 является то, что Python 2.4 выполняет тест pystone примерно на 5 % быстрее, чем Python 2.3, и на 35 % быстрее, чем Python 2.2. (pystone не является особенно хорошим тестом, но это наиболее часто используемый метод измерения производительности Python. Ваши собственные приложения могут показать большую или меньшую выгоду от Python 2.4.)

source: New, Improved, and Deprecated Modules
pt_pt: Módulos Novos, Melhorados e Descontinuados
ru: Новые, улучшенные и устаревшие модули

source: As usual, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the CVS logs for all the details.
pt_pt: Como habitual, a biblioteca padrão do Python recebeu várias melhorias e correções de *bugs*. Aqui está uma lista parcial das alterações mais notáveis, ordenadas alfabéticamente por nome de módulo. Consulte o ficheiro :file:`Misc/NEWS` na árvore de origem para uma lista mais completa de alterações, ou consulte os registos do CVS para todos os detalhes.
ru: Как обычно, стандартная библиотека Python получила ряд улучшений и исправлений ошибок. Вот неполный список наиболее заметных изменений, отсортированный в алфавитном порядке по названию модуля. Обратитесь к файлу :file:`Misc/NEWS` в дереве исходного кода для получения более полного списка изменений или просмотрите журналы CVS для получения всех подробностей.

source: The :mod:`!asyncore` module's :func:`!loop` function now has a *count* parameter that lets you perform a limited number of passes through the polling loop. The default is still to loop forever.
pt_pt: A função :func:`!loop` do módulo :mod:`!asyncore` agora tem um parâmetro *count* que permite realizar um número limitado de passagens pelo ciclo de sondagem. A predefinição continua a ser um ciclo infinito.
ru: Функция :func:`!loop` модуля :mod:`!asyncore` теперь имеет параметр *count*, который позволяет выполнять ограниченное количество проходов через цикл опроса. По умолчанию по-прежнему используется бесконечный цикл.

source: The :mod:`base64` module now has more complete :rfc:`3548` support for Base64, Base32, and Base16 encoding and decoding, including optional case folding and optional alternative alphabets. (Contributed by Barry Warsaw.)
pt_pt: O módulo :mod:`base64` agora tem suporte mais completo para :rfc:`3548` de codificação e descodificação Base64, Base32 e Base16, incluindo *case folding* opcional e alfabetos alternativos opcionais. (Contribuído por Barry Warsaw.)
ru: Модуль :mod:`base64` теперь имеет более полную поддержку :rfc:`3548` для кодирования и декодирования Base64, Base32 и Base16, включая необязательное свертывание регистра и дополнительные альтернативные алфавиты. (Предоставлено Барри Варшавой.)

source: The :mod:`bisect` module now has an underlying C implementation for improved performance. (Contributed by Dmitry Vasiliev.)
pt_pt: O módulo :mod:`bisect` agora tem uma implementação subjacente em C para melhorar o desempenho. (Contribuído por Dmitry Vasiliev.)
ru: Модуль :mod:`bisect` теперь имеет базовую реализацию на языке C для повышения производительности. (Сообщил Дмитрий Васильев.)

source: The CJKCodecs collections of East Asian codecs, maintained by Hye-Shik Chang, was integrated into 2.4. The new encodings are:
pt_pt: A coleção CJKCodecs de *codecs* do Leste Asiático, mantida por Hye-Shik Chang, foi integrada no 2.4. As novas codificações são:
ru: Коллекция восточноазиатских кодеков CJKCodecs, поддерживаемая Хе-Шик Чангом, была интегрирована в версию 2.4. Новые кодировки:

source: Chinese (PRC): gb2312, gbk, gb18030, big5hkscs, hz
pt_pt: Chinês (RPC): gb2312, gbk, gb18030, big5hkscs, hz
ru: Китайский (КНР): gb2312, gbk, gb18030, big5hkscs, hz

source: Chinese (ROC): big5, cp950
pt_pt: Chinês (ROC): big5, cp950
ru: Китайский (РПЦ): big5, cp950

source: Japanese: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,
pt_pt: Japonês: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,
ru: Японский: cp932, euc-jis-2004, euc-jp, euc-jisx0213, iso-2022-jp,

source: Korean: cp949, euc-kr, johab, iso-2022-kr
pt_pt: Coreano: cp949, euc-kr, johab, iso-2022-kr
ru: Корейский: cp949, euc-kr, johab, iso-2022-kr.

source: Some other new encodings were added: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154, and TIS-620.
pt_pt: Foram adicionadas algumas outras novas codificações: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154 e TIS-620.
ru: Были добавлены некоторые другие новые кодировки: HP Roman8, ISO_8859-11, ISO_8859-16, PCTP-154 и TIS-620.

source: The UTF-8 and UTF-16 codecs now cope better with receiving partial input. Previously the :class:`StreamReader` class would try to read more data, making it impossible to resume decoding from the stream. The :meth:`read` method will now return as much data as it can and future calls will resume decoding where previous ones left off. (Implemented by Walter Dörwald.)
pt_pt: Os *codecs* UTF-8 e UTF-16 agora lidam melhor com a receção de entrada parcial. Anteriormente, a classe :class:`StreamReader` tentaria ler mais dados, tornando impossível retomar a descodificação a partir do fluxo. O método :meth:`read` agora devolverá tantos dados quanto possível, e chamadas futuras retomarão a descodificação onde as anteriores pararam. (Implementado por Walter Dörwald.)
ru: Кодеки UTF-8 и UTF-16 теперь лучше справляются с получением частичного ввода. Раньше класс :class:`StreamReader` пытался прочитать больше данных, что делало невозможным возобновление декодирования из потока. Метод :meth:`read` теперь будет возвращать столько данных, сколько сможет, и будущие вызовы возобновят декодирование с того места, где остановились предыдущие. (Реализован Вальтером Дорвальдом.)

source: There is a new :mod:`collections` module for various specialized collection datatypes. Currently it contains just one type, :class:`deque`, a double-ended queue that supports efficiently adding and removing elements from either end::
pt_pt: Existe um novo módulo :mod:`collections` para vários tipos de dados de coleção especializados. Atualmente, contém apenas um tipo, :class:`deque`, uma fila de duas extremidades que suporta a adição e remoção eficiente de elementos de qualquer extremidade::
ru: Появился новый модуль :mod:`collections` для различных специализированных типов данных коллекций. В настоящее время он содержит только один тип: :class:`deque`, двустороннюю очередь, которая поддерживает эффективное добавление и удаление элементов с любого конца::

source: >>> from collections import deque >>> d = deque('ghi') # make a new deque with three items >>> d.append('j') # add a new entry to the right side >>> d.appendleft('f') # add a new entry to the left side >>> d # show the representation of the deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # return and remove the rightmost item 'j' >>> d.popleft() # return and remove the leftmost item 'f' >>> list(d) # list the contents of the deque ['g', 'h', 'i'] >>> 'h' in d # search the deque True
pt_pt: >>> from collections import deque >>> d = deque('ghi') # criar uma nova deque com três itens >>> d.append('j') # adicionar uma nova entrada no lado direito >>> d.appendleft('f') # adicionar uma nova entrada no lado esquerdo >>> d # mostrar a representação da deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # devolver e remover o item mais à direita 'j' >>> d.popleft() # devolver e remover o item mais à esquerda 'f' >>> list(d) # listar o conteúdo da deque ['g', 'h', 'i'] >>> 'h' in d # pesquisar na deque True

source: Several modules, such as the :mod:`Queue` and :mod:`threading` modules, now take advantage of :class:`collections.deque` for improved performance. (Contributed by Raymond Hettinger.)
pt_pt: Vários módulos, como os módulos :mod:`Queue` e :mod:`threading`, agora tiram partido de :class:`collections.deque` para melhorar o desempenho. (Contribuído por Raymond Hettinger.)
ru: Некоторые модули, такие как модули :mod:`Queue` и :mod:`threading`, теперь используют преимущества :class:`collections.deque` для повышения производительности. (Предоставлено Раймондом Хеттингером.)

source: The :mod:`ConfigParser <configparser>` classes have been enhanced slightly. The :meth:`~configparser.ConfigParser.read` method now returns a list of the files that were successfully parsed, and the :meth:`~configparser.ConfigParser.set` method raises :exc:`TypeError` if passed a *value* argument that isn't a string. (Contributed by John Belmonte and David Goodger.)
pt_pt: As classes :mod:`ConfigParser <configparser>` foram ligeiramente melhoradas. O método :meth:`~configparser.ConfigParser.read` agora devolve uma lista dos ficheiros que foram analisados com sucesso, e o método :meth:`~configparser.ConfigParser.set` gera uma exceção :exc:`TypeError` se for passado um argumento *value* que não seja uma string. (Contribuído por John Belmonte e David Goodger.)
ru: Классы :mod:`ConfigParser <configparser>` были немного улучшены. Метод :meth:`~configparser.ConfigParser.read` теперь возвращает список файлов, которые были успешно проанализированы, а метод :meth:`~configparser.ConfigParser.set` вызывает :exc:`TypeError`, если ему передан * значение* аргумент, который не является строкой. (Предоставлено Джоном Бельмонте и Дэвидом Гуджером.)

source: The :mod:`curses` module now supports the ncurses extension :func:`use_default_colors`. On platforms where the terminal supports transparency, this makes it possible to use a transparent background. (Contributed by Jörg Lehmann.)
pt_pt: O módulo :mod:`curses` agora suporta a extensão ncurses :func:`use_default_colors`. Em plataformas onde o terminal suporta transparência, isto torna possível usar um fundo transparente. (Contribuído por Jörg Lehmann.)
ru: Модуль :mod:`curses` теперь поддерживает расширение ncurses :func:`use_default_colors`. На платформах, где терминал поддерживает прозрачность, это дает возможность использовать прозрачный фон. (Предоставлено Йоргом Леманном.)

source: The :mod:`difflib` module now includes an :class:`HtmlDiff` class that creates an HTML table showing a side by side comparison of two versions of a text. (Contributed by Dan Gass.)
pt_pt: O módulo :mod:`difflib` agora inclui uma classe :class:`HtmlDiff` que cria uma tabela HTML mostrando uma comparação lado a lado de duas versões de um texto. (Contribuído por Dan Gass.)
ru: Модуль :mod:`difflib` теперь включает класс :class:`HtmlDiff`, который создает HTML-таблицу, показывающую параллельное сравнение двух версий текста. (Предоставлено Дэном Гассом.)

source: The :mod:`email` package was updated to version 3.0, which dropped various deprecated APIs and removes support for Python versions earlier than 2.3. The 3.0 version of the package uses a new incremental parser for MIME messages, available in the :mod:`email.FeedParser` module. The new parser doesn't require reading the entire message into memory, and doesn't raise exceptions if a message is malformed; instead it records any problems in the :attr:`defect` attribute of the message. (Developed by Anthony Baxter, Barry Warsaw, Thomas Wouters, and others.)
pt_pt: O pacote :mod:`email` foi atualizado para a versão 3.0, que removeu várias APIs descontinuadas e elimina o suporte para versões do Python anteriores à 2.3. A versão 3.0 do pacote usa um novo analisador incremental para mensagens MIME, disponível no módulo :mod:`email.FeedParser`. O novo analisador não requer a leitura de toda a mensagem para a memória e não gera exceções se uma mensagem estiver malformada; em vez disso, regista quaisquer problemas no atributo :attr:`defect` da mensagem. (Desenvolvido por Anthony Baxter, Barry Warsaw, Thomas Wouters e outros.)
ru: Пакет :mod:`email` был обновлен до версии 3.0, в которой удалены различные устаревшие API и удалена поддержка версий Python до 2.3. Версия пакета 3.0 использует новый инкрементный анализатор сообщений MIME, доступный в модуле :mod:`email.FeedParser`. Новый синтаксический анализатор не требует чтения всего сообщения в память и не вызывает исключений, если сообщение имеет неверный формат; вместо этого он записывает любые проблемы в атрибут :attr:`defect` сообщения. (Разработано Энтони Бакстером, Барри Варшавой, Томасом Воутерсом и другими.)

source: The :mod:`heapq` module has been converted to C. The resulting tenfold improvement in speed makes the module suitable for handling high volumes of data. In addition, the module has two new functions :func:`nlargest` and :func:`nsmallest` that use heaps to find the N largest or smallest values in a dataset without the expense of a full sort. (Contributed by Raymond Hettinger.)
pt_pt: O módulo :mod:`heapq` foi convertido para C. A melhoria de dez vezes na velocidade resultante torna o módulo adequado para lidar com grandes volumes de dados. Além disso, o módulo tem duas novas funções, :func:`nlargest` e :func:`nsmallest`, que usam *heaps* para encontrar os N maiores ou menores valores num conjunto de dados sem o custo de uma ordenação completa. (Contribuído por Raymond Hettinger.)
ru: Модуль :mod:`heapq` был преобразован в C. В результате десятикратное увеличение скорости делает модуль пригодным для обработки больших объемов данных. Кроме того, в модуле есть две новые функции :func:`nlargest` и :func:`nsmallest`, которые используют кучу для поиска N наибольших или наименьших значений в наборе данных без затрат на полную сортировку. (Предоставлено Раймондом Хеттингером.)

source: The :mod:`httplib <http>` module now contains constants for HTTP status codes defined in various HTTP-related RFC documents. Constants have names such as :const:`OK`, :const:`CREATED`, :const:`CONTINUE`, and :const:`MOVED_PERMANENTLY`; use pydoc to get a full list. (Contributed by Andrew Eland.)
pt_pt: O módulo :mod:`httplib <http>` agora contém constantes para códigos de estado HTTP definidos em vários documentos RFC relacionados com HTTP. As constantes têm nomes como :const:`OK`, :const:`CREATED`, :const:`CONTINUE` e :const:`MOVED_PERMANENTLY`; use pydoc para obter uma lista completa. (Contribuído por Andrew Eland.)
ru: Модуль :mod:`httplib <http>` теперь содержит константы для кодов состояния HTTP, определенных в различных документах RFC, связанных с HTTP. Константы имеют такие имена, как :const:`OK`, :const:`CREATED`, :const:`CONTINUE` и :const:`MOVED_PERMANENTLY`; используйте pydoc, чтобы получить полный список. (Предоставлено Эндрю Эландом.)

source: The :mod:`imaplib` module now supports IMAP's THREAD command (contributed by Yves Dionne) and new :meth:`deleteacl` and :meth:`myrights` methods (contributed by Arnaud Mazin).
pt_pt: O módulo :mod:`imaplib` agora suporta o comando THREAD do IMAP (contribuído por Yves Dionne) e novos métodos :meth:`deleteacl` e :meth:`myrights` (contribuídos por Arnaud Mazin).
ru: Модуль :mod:`imaplib` теперь поддерживает команду IMAP THREAD (предоставлена ​​Ивом Дионном) и новые методы :meth:`deleteacl` и :meth:`myrights` (предоставлены Арно Мазином).

source: The :mod:`itertools` module gained a ``groupby(iterable[, *func*])`` function. *iterable* is something that can be iterated over to return a stream of elements, and the optional *func* parameter is a function that takes an element and returns a key value; if omitted, the key is simply the element itself. :func:`groupby` then groups the elements into subsequences which have matching values of the key, and returns a series of 2-tuples containing the key value and an iterator over the subsequence.
pt_pt: O módulo :mod:`itertools` ganhou uma função ``groupby(iterable[, *func*])``. *iterável* é algo que pode ser iterado para devolver um fluxo de elementos, e o parâmetro opcional *func* é uma função que recebe um elemento e devolve um valor de chave; se omitido, a chave é simplesmente o elemento em si. :func:`groupby` agrupa então os elementos em subsequências que têm valores de chave correspondentes e devolve uma série de 2-tuplos contendo o valor da chave e um iterador sobre a subsequência.
ru: Модуль :mod:`itertools` получил функцию ``groupby(iterable[, *func*])``. *iterable* — это то, что можно перебирать, чтобы вернуть поток элементов, а необязательный параметр *func* — это функция, которая принимает элемент и возвращает ключевое значение; если он опущен, ключом является сам элемент. :func:`groupby` затем группирует элементы в подпоследовательности, имеющие совпадающие значения ключа, и возвращает серию из двух кортежей, содержащих значение ключа и итератор для подпоследовательности.

source: Here's an example to make this clearer. The *key* function simply returns whether a number is even or odd, so the result of :func:`groupby` is to return consecutive runs of odd or even numbers. ::
pt_pt: Aqui está um exemplo para tornar isto mais claro. A função *key* simplesmente devolve se um número é par ou ímpar, pelo que o resultado de :func:`groupby` é devolver execuções consecutivas de números ímpares ou pares. ::
ru: Вот пример, чтобы сделать это яснее. Функция *key* просто определяет, является ли число четным или нечетным, поэтому результатом :func:`groupby` является возврат последовательных серий нечетных или четных чисел. ::
