Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: The :mod:`tarfile` module now generates GNU-format tar files by default. (Contributed by Lars Gustäbel.)
pt_pt: O módulo :mod:`tarfile` agora gera ficheiros tar no formato GNU por predefinição. (Contribuído por Lars Gustäbel.)
ru: Модуль :mod:`tarfile` теперь по умолчанию генерирует tar-файлы в формате GNU. (Предоставлено Ларсом Густебелем.)

source: The :mod:`threading` module now has an elegantly simple way to support thread-local data. The module contains a :class:`local` class whose attribute values are local to different threads. ::
pt_pt: O módulo :mod:`threading` agora tem uma forma elegantemente simples de suportar dados locais à *thread*. O módulo contém uma classe :class:`local` cujos valores de atributo são locais a diferentes *threads*. ::
ru: Модуль :mod:`threading` теперь имеет элегантно простой способ поддержки локальных данных потока. Модуль содержит класс :class:`local`, значения атрибутов которого являются локальными для разных потоков. ::

source: Other threads can assign and retrieve their own values for the :attr:`number` and :attr:`url` attributes. You can subclass :class:`local` to initialize attributes or to add methods. (Contributed by Jim Fulton.)
pt_pt: Outras *threads* podem atribuir e recuperar os seus próprios valores para os atributos :attr:`number` e :attr:`url`. Pode criar subclasses de :class:`local` para inicializar atributos ou adicionar métodos. (Contribuído por Jim Fulton.)
ru: Другие потоки могут назначать и получать свои собственные значения для атрибутов :attr:`number` и :attr:`url`. Вы можете создать подкласс :class:`local` для инициализации атрибутов или добавления методов. (Предоставлено Джимом Фултоном.)

source: The :mod:`timeit` module now automatically disables periodic garbage collection during the timing loop. This change makes consecutive timings more comparable. (Contributed by Raymond Hettinger.)
pt_pt: O módulo :mod:`timeit` agora desativa automaticamente a recolha periódica de lixo durante o ciclo de medição de tempo. Esta alteração torna as medições consecutivas mais comparáveis. (Contribuído por Raymond Hettinger.)
ru: Модуль :mod:`timeit` теперь автоматически отключает периодическую сборку мусора во время цикла синхронизации. Это изменение делает последовательные тайминги более сопоставимыми. (Предоставлено Раймондом Хеттингером.)

source: The :mod:`weakref` module now supports a wider variety of objects including Python functions, class instances, sets, frozensets, deques, arrays, files, sockets, and regular expression pattern objects. (Contributed by Raymond Hettinger.)
pt_pt: O módulo :mod:`weakref` agora suporta uma maior variedade de objetos, incluindo funções Python, instâncias de classes, conjuntos, *frozensets*, *deques*, *arrays*, ficheiros, *sockets* e objetos de padrão de expressões regulares. (Contribuído por Raymond Hettinger.)
ru: Модуль :mod:`weakref` теперь поддерживает более широкий спектр объектов, включая функции Python, экземпляры классов, наборы, замороженные наборы, деки, массивы, файлы, сокеты и объекты шаблонов регулярных выражений. (Предоставлено Раймондом Хеттингером.)

source: The :mod:`xmlrpclib <xmlrpc.client>` module now supports a multi-call extension for transmitting multiple XML-RPC calls in a single HTTP operation. (Contributed by Brian Quinlan.)
pt_pt: O módulo :mod:`xmlrpclib <xmlrpc.client>` agora suporta uma extensão de multi-chamada para transmitir várias chamadas XML-RPC numa única operação HTTP. (Contribuído por Brian Quinlan.)
ru: Модуль :mod:`xmlrpclib <xmlrpc.client>` теперь поддерживает расширение нескольких вызовов для передачи нескольких вызовов XML-RPC в одной операции HTTP. (Предоставлено Брайаном Куинланом.)

source: The :mod:`mpz`, :mod:`rotor`, and :mod:`xreadlines` modules have been removed.
pt_pt: Os módulos :mod:`mpz`, :mod:`rotor` e :mod:`xreadlines` foram removidos.
ru: Модули :mod:`mpz`, :mod:`rotor` и :mod:`xreadlines` были удалены.

source: The :mod:`cookielib <http.cookiejar>` library supports client-side handling for HTTP cookies, mirroring the :mod:`Cookie <http.cookies>` module's server-side cookie support. Cookies are stored in cookie jars; the library transparently stores cookies offered by the web server in the cookie jar, and fetches the cookie from the jar when connecting to the server. As in web browsers, policy objects control whether cookies are accepted or not.
pt_pt: A biblioteca :mod:`cookielib <http.cookiejar>` suporta o tratamento do lado do cliente para cookies HTTP, espelhando o suporte de cookies do lado do servidor do módulo :mod:`Cookie <http.cookies>`. Os cookies são armazenados em *cookie jars*; a biblioteca armazena transparente os cookies oferecidos pelo servidor web no *cookie jar* e busca o cookie do *jar* ao conectar-se ao servidor. Como nos navegadores web, os objetos de política controlam se os cookies são aceites ou não.
ru: Библиотека :mod:`cookielib <http.cookiejar>` поддерживает обработку файлов cookie HTTP на стороне клиента, отражая поддержку файлов cookie на стороне сервера модуля :mod:`Cookie <http.cookies>`. Файлы cookie хранятся в банках для печенья; библиотека прозрачно сохраняет файлы cookie, предлагаемые веб-сервером, в банке файлов cookie и извлекает файлы cookie из банки при подключении к серверу. Как и в веб-браузерах, объекты политики контролируют, принимаются файлы cookie или нет.

source: In order to store cookies across sessions, two implementations of cookie jars are provided: one that stores cookies in the Netscape format so applications can use the Mozilla or Lynx cookie files, and one that stores cookies in the same format as the Perl libwww library.
pt_pt: Para armazenar cookies entre sessões, são fornecidas duas implementações de *cookie jars*: uma que armazena cookies no formato Netscape, para que as aplicações possam usar os ficheiros de cookies do Mozilla ou Lynx, e outra que armazena cookies no mesmo formato que a biblioteca Perl libwww.
ru: Для хранения файлов cookie между сеансами предусмотрены две реализации файлов cookie: одна хранит файлы cookie в формате Netscape, чтобы приложения могли использовать файлы cookie Mozilla или Lynx, а другая хранит файлы cookie в том же формате, что и библиотека Perl libwww.

source: :mod:`urllib2 <urllib.request>` has been changed to interact with :mod:`cookielib <http.cookiejar>`: :class:`HTTPCookieProcessor` manages a cookie jar that is used when accessing URLs.
pt_pt: :mod:`urllib2 <urllib.request>` foi alterado para interagir com :mod:`cookielib <http.cookiejar>`: :class:`HTTPCookieProcessor` gere um *cookie jar* que é usado ao aceder a URLs.
ru: :mod:`urllib2 <urllib.request>` был изменен для взаимодействия с :mod:`cookielib <http.cookiejar>`: :class:`HTTPCookieProcessor` управляет файлом cookie, который используется при доступе к URL-адресам.

source: This module was contributed by John J. Lee.
pt_pt: Este módulo foi contribuído por John J. Lee.
ru: Этот модуль был предоставлен Джоном Дж. Ли.

source: The :mod:`doctest` module underwent considerable refactoring thanks to Edward Loper and Tim Peters. Testing can still be as simple as running :func:`doctest.testmod`, but the refactorings allow customizing the module's operation in various ways
pt_pt: O módulo :mod:`doctest` sofreu uma refatoração considerável graças a Edward Loper e Tim Peters. Os testes ainda podem ser tão simples como executar :func:`doctest.testmod`, mas as refatorações permitem personalizar a operação do módulo de várias formas.
ru: Модуль :mod:`doctest` подвергся значительному рефакторингу благодаря Эдварду Лоперу и Тиму Питерсу. Тестирование по-прежнему может быть таким же простым, как запуск :func:`doctest.testmod`, но рефакторинг позволяет настраивать работу модуля различными способами.

source: The new :class:`DocTestFinder` class extracts the tests from a given object's docstrings::
pt_pt: A nova classe :class:`DocTestFinder` extrai os testes das *docstrings* de um objeto dado::
ru: Новый класс :class:`DocTestFinder` извлекает тесты из строк документации данного объекта::

source: def f (x, y): """>>> f(2,2) 4 >>> f(3,2) 6 """ return x*y finder = doctest.DocTestFinder() # Get list of DocTest instances tests = finder.find(f)
pt_pt: def f (x, y): """>>> f(2,2) 4 >>> f(3,2) 6 """ return x*y finder = doctest.DocTestFinder() # Obter lista de instâncias DocTest tests = finder.find(f)

source: The new :class:`DocTestRunner` class then runs individual tests and can produce a summary of the results::
pt_pt: A nova classe :class:`DocTestRunner` executa então testes individuais e pode produzir um resumo dos resultados::
ru: Новый класс :class:`DocTestRunner` затем запускает отдельные тесты и может выдать сводку результатов:

source: The above example produces the following output::
pt_pt: O exemplo acima produz a seguinte saída::
ru: Приведенный выше пример дает следующий результат:

source: 1 items passed all tests: 2 tests in f 2 tests in 1 items. 2 passed and 0 failed. Test passed.
pt_pt: 1 item passou todos os testes: 2 testes em f 2 testes em 1 item. 2 passaram e 0 falharam. Teste passou.

source: :class:`DocTestRunner` uses an instance of the :class:`OutputChecker` class to compare the expected output with the actual output. This class takes a number of different flags that customize its behaviour; ambitious users can also write a completely new subclass of :class:`OutputChecker`.
pt_pt: :class:`DocTestRunner` usa uma instância da classe :class:`OutputChecker` para comparar a saída esperada com a saída real. Esta classe recebe vários *flags* diferentes que personalizam o seu comportamento; utilizadores ambiciosos também podem escrever uma subclasse completamente nova de :class:`OutputChecker`.
ru: :class:`DocTestRunner` использует экземпляр класса :class:`OutputChecker` для сравнения ожидаемого результата с фактическим результатом. Этот класс принимает ряд различных флагов, настраивающих его поведение; амбициозные пользователи также могут написать совершенно новый подкласс :class:`OutputChecker`.

source: The default output checker provides a number of handy features. For example, with the :const:`doctest.ELLIPSIS` option flag, an ellipsis (``...``) in the expected output matches any substring, making it easier to accommodate outputs that vary in minor ways::
pt_pt: O verificador de saída predefinido fornece várias funcionalidades úteis. Por exemplo, com a *flag* de opção :const:`doctest.ELLIPSIS`, uma reticência (``...``) na saída esperada corresponde a qualquer substring, tornando mais fácil acomodar saídas que variam de formas menores::
ru: Средство проверки вывода по умолчанию предоставляет ряд удобных функций. Например, с помощью флага опции :const:`doctest.ELLIPSIS` многоточие (``...``) в ожидаемом выводе соответствует любой подстроке, что упрощает обработку результатов, которые незначительно различаются:

source: Another special string, ``<BLANKLINE>``, matches a blank line::
pt_pt: Outra string especial, ``<BLANKLINE>``, corresponde a uma linha em branco::
ru: Другая специальная строка, ``<BLANKLINE>``, соответствует пустой строке:

source: Another new capability is producing a diff-style display of the output by specifying the :const:`doctest.REPORT_UDIFF` (unified diffs), :const:`doctest.REPORT_CDIFF` (context diffs), or :const:`doctest.REPORT_NDIFF` (delta-style) option flags. For example::
pt_pt: Outra nova capacidade é produzir uma exibição no estilo *diff* da saída, especificando as *flags* de opção :const:`doctest.REPORT_UDIFF` (*diffs* unificados), :const:`doctest.REPORT_CDIFF` (*diffs* de contexto) ou :const:`doctest.REPORT_NDIFF` (estilo delta). Por exemplo::
ru: Еще одна новая возможность — создание отображения выходных данных в стиле различий путем указания :const:`doctest.REPORT_UDIFF` (унифицированные различия), :const:`doctest.REPORT_CDIFF` (контекстные различия) или :const:`doctest.REPORT_NDIFF. ` (дельта-стиль) флаги опций. Например::

source: Running the above function's tests with :const:`doctest.REPORT_UDIFF` specified, you get the following output:
pt_pt: Ao executar os testes da função acima com :const:`doctest.REPORT_UDIFF` especificado, obtém a seguinte saída:
ru: Запустив тесты вышеуказанной функции с указанным :const:`doctest.REPORT_UDIFF`, вы получите следующий результат:

source: ********************************************************************** File "t.py", line 15, in g Failed example: g(4) Differences (unified diff with -expected +actual): @@ -2,3 +2,3 @@ is a -lengthy +rather **********************************************************************
pt_pt: ********************************************************************** Ficheiro "t.py", linha 15, em g Exemplo falhado: g(4) Diferenças (diff unificado com -esperado +real): @@ -2,3 +2,3 @@ is a -lengthy +rather **********************************************************************

source: Build and C API Changes
pt_pt: Alterações na Compilação e na API C
ru: Изменения API сборки и C

source: Some of the changes to Python's build process and to the C API are:
pt_pt: Algumas das alterações no processo de compilação do Python e na API C são:
ru: Некоторые изменения в процессе сборки Python и C API:

source: Three new convenience macros were added for common return values from extension functions: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE`, and :c:macro:`Py_RETURN_FALSE`. (Contributed by Brett Cannon.)
pt_pt: Foram adicionadas três novas macros de conveniência para valores de retorno comuns de funções de extensão: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE` e :c:macro:`Py_RETURN_FALSE`. (Contribuído por Brett Cannon.)
ru: Были добавлены три новых удобных макроса для общих возвращаемых значений из функций расширения: :c:macro:`Py_RETURN_NONE`, :c:macro:`Py_RETURN_TRUE` и :c:macro:`Py_RETURN_FALSE`. (Предоставлено Бреттом Кэнноном.)

source: Another new macro, :c:macro:`Py_CLEAR`, decreases the reference count of *obj* and sets *obj* to the null pointer. (Contributed by Jim Fulton.)
pt_pt: Outra nova macro, :c:macro:`Py_CLEAR`, diminui a contagem de referências de *obj* e define *obj* para o ponteiro nulo. (Contribuído por Jim Fulton.)
ru: Другой новый макрос, :c:macro:`Py_CLEAR`, уменьшает счетчик ссылок *obj* и устанавливает для *obj* нулевой указатель. (Предоставлено Джимом Фултоном.)

source: A new function, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, constructs tuples from a variable length argument list of Python objects. (Contributed by Raymond Hettinger.)
pt_pt: Uma nova função, ``PyTuple_Pack(N, obj1, obj2, ..., objN)``, constrói tuplos a partir de uma lista de argumentos de comprimento variável de objetos Python. (Contribuído por Raymond Hettinger.)
ru: Новая функция PyTuple_Pack(N, obj1, obj2, ..., objN) создает кортежи из списка аргументов переменной длины объектов Python. (Предоставлено Раймондом Хеттингером.)

source: A new function, ``PyDict_Contains(d, k)``, implements fast dictionary lookups without masking exceptions raised during the look-up process. (Contributed by Raymond Hettinger.)
pt_pt: Uma nova função, ``PyDict_Contains(d, k)``, implementa pesquisas rápidas em dicionários sem mascarar exceções geradas durante o processo de pesquisa. (Contribuído por Raymond Hettinger.)
ru: Новая функция PyDict_Contains(d, k) реализует быстрый поиск по словарю без маскировки исключений, возникающих в процессе поиска. (Предоставлено Раймондом Хеттингером.)

source: The :c:expr:`Py_IS_NAN(X)` macro returns 1 if its float or double argument *X* is a NaN. (Contributed by Tim Peters.)
pt_pt: A macro :c:expr:`Py_IS_NAN(X)` devolve 1 se o seu argumento *float* ou *double* *X* for um NaN. (Contribuído por Tim Peters.)
ru: Макрос :c:expr:`Py_IS_NAN(X)` возвращает 1, если его аргумент с плавающей точкой или двойным аргументом *X* имеет значение NaN. (Предоставлено Тимом Питерсом.)

source: C code can avoid unnecessary locking by using the new :c:func:`!PyEval_ThreadsInitialized` function to tell if any thread operations have been performed. If this function returns false, no lock operations are needed. (Contributed by Nick Coghlan.)
pt_pt: O código C pode evitar bloqueios desnecessários usando a nova função :c:func:`!PyEval_ThreadsInitialized` para saber se alguma operação de *thread* foi realizada. Se esta função devolver falso, não são necessárias operações de bloqueio. (Contribuído por Nick Coghlan.)
ru: Код C может избежать ненужной блокировки, используя новую функцию :c:func:`!PyEval_ThreadsInitialized`, чтобы узнать, были ли выполнены какие-либо операции с потоками. Если эта функция возвращает false, никаких операций блокировки не требуется. (Предоставлено Ником Когланом.)

source: A new function, :c:func:`PyArg_VaParseTupleAndKeywords`, is the same as :c:func:`PyArg_ParseTupleAndKeywords` but takes a :c:type:`va_list` instead of a number of arguments. (Contributed by Greg Chapman.)
pt_pt: Uma nova função, :c:func:`PyArg_VaParseTupleAndKeywords`, é a mesma que :c:func:`PyArg_ParseTupleAndKeywords`, mas recebe um :c:type:`va_list` em vez de um número de argumentos. (Contribuído por Greg Chapman.)
ru: Новая функция :c:func:`PyArg_VaParseTupleAndKeywords` аналогична :c:func:`PyArg_ParseTupleAndKeywords`, но вместо ряда аргументов принимает :c:type:`va_list`. (Предоставлено Грегом Чепменом.)

source: A new method flag, :c:macro:`METH_COEXIST`, allows a function defined in slots to co-exist with a :c:type:`PyCFunction` having the same name. This can halve the access time for a method such as :meth:`set.__contains__`. (Contributed by Raymond Hettinger.)
pt_pt: Uma nova *flag* de método, :c:macro:`METH_COEXIST`, permite que uma função definida em *slots* coexista com uma :c:type:`PyCFunction` com o mesmo nome. Isto pode reduzir para metade o tempo de acesso a um método como :meth:`set.__contains__`. (Contribuído por Raymond Hettinger.)
ru: Новый флаг метода :c:macro:`METH_COEXIST` позволяет функции, определенной в слотах, сосуществовать с функцией :c:type:`PyCFunction`, имеющей то же имя. Это может вдвое сократить время доступа для такого метода, как :meth:`set.__contains__`. (Предоставлено Раймондом Хеттингером.)

source: Python can now be built with additional profiling for the interpreter itself, intended as an aid to people developing the Python core. Providing :option:`!--enable-profiling` to the :program:`configure` script will let you profile the interpreter with :program:`gprof`, and providing the :option:`!--with-tsc` switch enables profiling using the Pentium's Time-Stamp-Counter register. Note that the :option:`!--with-tsc` switch is slightly misnamed, because the profiling feature also works on the PowerPC platform, though that processor architecture doesn't call that register "the TSC register". (Contributed by Jeremy Hylton.)
pt_pt: O Python pode agora ser compilado com perfilagem adicional para o próprio interpretador, destinada a ajudar as pessoas que desenvolvem o núcleo do Python. Fornecer :option:`!--enable-profiling` ao script :program:`configure` permitirá perfilar o interpretador com :program:`gprof`, e fornecer a opção :option:`!--with-tsc` ativa a perfilagem usando o registo Time-Stamp-Counter do Pentium. Note que a opção :option:`!--with-tsc` está ligeiramente mal nomeada, porque a funcionalidade de perfilagem também funciona na plataforma PowerPC, embora essa arquitetura de processador não chame a esse registo "o registo TSC". (Contribuído por Jeremy Hylton.)
ru: Python теперь можно создавать с дополнительным профилированием самого интерпретатора, предназначенным в помощь людям, разрабатывающим ядро ​​Python. Предоставление :option:`!--enable-profiling` в скрипте :program:`configure` позволит вам профилировать интерпретатор с помощью :program:`gprof` и предоставление переключателя :option:`!--with-tsc` позволяет профилировать с использованием регистра счетчика меток времени Pentium. Обратите внимание, что переключатель :option:`!--with-tsc` назван немного неправильно, поскольку функция профилирования также работает на платформе PowerPC, хотя в этой архитектуре процессора этот регистр не называется "регистром TSC". (Предоставлено Джереми Хилтоном.)

source: The :c:type:`!tracebackobject` type has been renamed to :c:type:`PyTracebackObject`.
pt_pt: O tipo :c:type:`!tracebackobject` foi renomeado para :c:type:`PyTracebackObject`.
ru: Тип :c:type:`!tracebackobject` был переименован в :c:type:`PyTracebackObject`.

source: Port-Specific Changes
pt_pt: Alterações Específicas da Plataforma
ru: Изменения для конкретного порта

source: The Windows port now builds under MSVC++ 7.1 as well as version 6. (Contributed by Martin von Löwis.)
pt_pt: A porta para Windows agora compila com MSVC++ 7.1, bem como com a versão 6. (Contribuído por Martin von Löwis.)
ru: Порт для Windows теперь работает как под MSVC++ 7.1, так и под версией 6. (Сообщил Мартин фон Лёвис.)

source: Porting to Python 2.4
pt_pt: Portar para Python 2.4
ru: Портирование на Python 2.4

source: This section lists previously described changes that may require changes to your code:
pt_pt: Esta secção lista alterações previamente descritas que podem exigir alterações ao seu código:
ru: В этом разделе перечислены ранее описанные изменения, которые могут потребовать внесения изменений в ваш код:

source: Left shifts and hexadecimal/octal constants that are too large no longer trigger a :exc:`FutureWarning` and return a value limited to 32 or 64 bits; instead they return a long integer.
pt_pt: Deslocamentos à esquerda e constantes hexadecimais/octais demasiado grandes já não geram um :exc:`FutureWarning` e devolvem um valor limitado a 32 ou 64 bits; em vez disso, devolvem um inteiro longo.
ru: Сдвиг влево и слишком большие шестнадцатеричные/восьмеричные константы больше не вызывают :exc:`FutureWarning` и возвращают значение, ограниченное 32 или 64 битами; вместо этого они возвращают длинное целое число.

source: The :func:`zip` built-in function and :func:`itertools.izip` now return an empty list instead of raising a :exc:`TypeError` exception if called with no arguments.
pt_pt: A função integrada :func:`zip` e :func:`itertools.izip` agora devolvem uma lista vazia em vez de gerar uma exceção :exc:`TypeError` se chamadas sem argumentos.
ru: Встроенная функция :func:`zip` и :func:`itertools.izip` теперь возвращают пустой список вместо того, чтобы вызывать исключение :exc:`TypeError`, если они вызваны без аргументов.

source: You can no longer compare the :class:`date` and :class:`~datetime.datetime` instances provided by the :mod:`datetime` module. Two instances of different classes will now always be unequal, and relative comparisons (``<``, ``>``) will raise a :exc:`TypeError`.
pt_pt: Já não pode comparar as instâncias :class:`date` e :class:`~datetime.datetime` fornecidas pelo módulo :mod:`datetime`. Duas instâncias de classes diferentes serão agora sempre desiguais, e comparações relativas (``<``, ``>``) gerarão uma exceção :exc:`TypeError`.
ru: Вы больше не можете сравнивать экземпляры :class:`date` и :class:`~datetime.datetime`, предоставляемые модулем :mod:`datetime`. Два экземпляра разных классов теперь всегда будут неравными, а относительные сравнения (``<``, ``>``) будут вызывать ошибку :exc:`TypeError`.

source: :func:`!dircache.listdir` now passes exceptions to the caller instead of returning empty lists.
pt_pt: :func:`!dircache.listdir` agora passa exceções ao chamador em vez de devolver listas vazias.
ru: :func:`!dircache.listdir` теперь передает исключения вызывающей стороне вместо возврата пустых списков.
