Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: :func:`LexicalHandler.startDTD` used to receive the public and system IDs in the wrong order. This has been corrected; applications relying on the wrong order need to be fixed.
pt_pt: :func:`LexicalHandler.startDTD` costumava receber os IDs público e de sistema pela ordem errada. Isto foi corrigido; aplicações que dependem da ordem errada precisam de ser corrigidas.
ru: :func:`LexicalHandler.startDTD` используется для получения общедоступных и системных идентификаторов в неправильном порядке. Это было исправлено; приложения, использующие неправильный порядок, необходимо исправить.

source: :func:`fcntl.ioctl` now warns if the *mutate* argument is omitted and relevant.
pt_pt: :func:`fcntl.ioctl` agora avisa se o argumento *mutate* for omitido e relevante.
ru: :func:`fcntl.ioctl` теперь предупреждает, если аргумент *mutate* опущен и имеет значение.

source: The :mod:`tarfile` module now generates GNU-format tar files by default.
pt_pt: O módulo :mod:`tarfile` agora gera ficheiros tar no formato GNU por predefinição.
ru: Модуль :mod:`tarfile` теперь по умолчанию генерирует tar-файлы в формате GNU.

source: Encountering a failure while importing a module no longer leaves a partially initialized module object in ``sys.modules``.
pt_pt: Encontrar uma falha ao importar um módulo já não deixa um objeto de módulo parcialmente inicializado em ``sys.modules``.
ru: В случае сбоя при импорте модуля в ``sys.modules`` больше не остается частично инициализированный объект модуля.

source: :const:`None` is now a constant; code that binds a new value to the name ``None`` is now a syntax error.
pt_pt: :const:`None` é agora uma constante; código que atribui um novo valor ao nome ``None`` é agora um erro de sintaxe.
ru: :const:`None` теперь является константой; код, который связывает новое значение с именем None, теперь является синтаксической ошибкой.

source: The :func:`signals.signal` function now raises a :exc:`RuntimeError` exception for certain illegal values; previously these errors would pass silently. For example, you can no longer set a handler on the :const:`SIGKILL` signal.
pt_pt: A função :func:`signals.signal` agora gera uma exceção :exc:`RuntimeError` para certos valores ilegais; anteriormente, estes erros passavam silenciosamente. Por exemplo, já não pode definir um manipulador no sinal :const:`SIGKILL`.
ru: Функция :func:`signals.signal` теперь вызывает исключение :exc:`RuntimeError` для некоторых недопустимых значений; раньше эти ошибки проходили молча. Например, вы больше не можете установить обработчик сигнала :const:`SIGKILL`.

source: Acknowledgements
pt_pt: Agradecimentos
ru: Подтверждение

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Koray Can, Hye-Shik Chang, Michael Dyck, Raymond Hettinger, Brian Hurt, Hamish Lawson, Fredrik Lundh, Sean Reifschneider, Sadruddin Rejeb.
pt_pt: O autor gostaria de agradecer às seguintes pessoas por oferecerem sugestões, correções e assistência em vários rascunhos deste artigo: Koray Can, Hye-Shik Chang, Michael Dyck, Raymond Hettinger, Brian Hurt, Hamish Lawson, Fredrik Lundh, Sean Reifschneider, Sadruddin Rejeb.
ru: Автор хотел бы поблагодарить следующих людей за предложения, исправления и помощь в различных черновиках этой статьи: Корай Джан, Хе-Шик Чанг, Майкл Дайк, Рэймонд Хеттингер, Брайан Хёрт, Хэмиш Лоусон, Фредрик Лунд, Шон Рейфшнайдер, Садруддин. Реджеб.

source: universal newlines
pt_pt: novas linhas universais
ru: универсальные переводы строк

source: What's new
pt_pt: Novidades
ru: Что нового

source: The :mod:`nntplib` module's :class:`NNTP` class gained :meth:`description` and :meth:`descriptions` methods to retrieve newsgroup descriptions for a single group or for a range of groups. (Contributed by Jürgen A. Erhard.)
ru: Класс :class:`NNTP` модуля :mod:`nntplib` получил методы :meth:`description` и :meth:`descriptions` для получения описаний групп новостей для одной группы или для диапазона групп. (Предоставлено Юргеном А. Эрхардом.)
