Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: For example, the number 1.25 has positive sign, a mantissa value of 1.01 (in binary), and an exponent of 0 (the decimal point doesn't need to be shifted). The number 5 has the same sign and mantissa, but the exponent is 2 because the mantissa is multiplied by 4 (2 to the power of the exponent 2); 1.25 \* 4 equals 5.
pt_pt: Por exemplo, o número 1.25 tem sinal positivo, um valor de mantissa de 1.01 (em binário) e um expoente de 0 (o ponto decimal não precisa de ser deslocado). O número 5 tem o mesmo sinal e mantissa, mas o expoente é 2 porque a mantissa é multiplicada por 4 (2 elevado ao expoente 2); 1.25 * 4 é igual a 5.
ru: Например, число 1,25 имеет положительный знак, значение мантиссы 1,01 (в двоичном формате) и показатель степени 0 (десятичную точку сдвигать не нужно). Число 5 имеет тот же знак и мантиссу, но показатель степени равен 2, поскольку мантисса умножается на 4 (2 в степени показателя степени 2); 1,25 \* 4 равно 5.

source: Modern systems usually provide floating-point support that conforms to a standard called IEEE 754. C's :c:expr:`double` type is usually implemented as a 64-bit IEEE 754 number, which uses 52 bits of space for the mantissa. This means that numbers can only be specified to 52 bits of precision. If you're trying to represent numbers whose expansion repeats endlessly, the expansion is cut off after 52 bits. Unfortunately, most software needs to produce output in base 10, and common fractions in base 10 are often repeating decimals in binary. For example, 1.1 decimal is binary ``1.0001100110011 ...``; .1 = 1/16 + 1/32 + 1/256 plus an infinite number of additional terms. IEEE 754 has to chop off that infinitely repeated decimal after 52 digits, so the representation is slightly inaccurate.
pt_pt: Os sistemas modernos geralmente fornecem suporte para vírgula flutuante que cumpre um padrão chamado IEEE 754. O tipo :c:expr:`double` do C é normalmente implementado como um número IEEE 754 de 64 bits, que usa 52 bits de espaço para a mantissa. Isto significa que os números só podem ser especificados com 52 bits de precisão. Se estiver a tentar representar números cuja expansão se repete infinitamente, a expansão é cortada após 52 bits. Infelizmente, a maioria do *software* precisa de produzir saída em base 10, e frações comuns em base 10 são frequentemente decimais repetidos em binário. Por exemplo, 1.1 decimal é binário ``1.0001100110011 ...``; 0.1 = 1/16 + 1/32 + 1/256 mais um número infinito de termos adicionais. O IEEE 754 tem de cortar esse decimal infinitamente repetido após 52 dígitos, pelo que a representação é ligeiramente imprecisa.
ru: Современные системы обычно обеспечивают поддержку чисел с плавающей запятой, соответствующую стандарту IEEE 754. Тип :c:expr:`double` языка C обычно реализуется как 64-битное число IEEE 754, которое использует 52 бита пространства для мантиссы. Это означает, что числа могут быть указаны только с точностью до 52 бит. Если вы пытаетесь представить числа, расширение которых повторяется бесконечно, расширение обрезается после 52 бит. К сожалению, большинству программ необходимо выводить результаты в десятичной системе счисления, а обычные дроби в десятичной системе часто повторяют десятичные дроби в двоичном формате. Например, десятичное число 1,1 — это двоичное ``1.0001100110011 ...``; .1 = 1/16 + 1/32 + 1/256 плюс бесконечное количество дополнительных членов. IEEE 754 должен отсекать бесконечно повторяющуюся десятичную дробь после 52 цифр, поэтому представление немного неточное.

source: Sometimes you can see this inaccuracy when the number is printed::
pt_pt: Às vezes pode ver esta imprecisão quando o número é impresso::
ru: Иногда можно увидеть такую ​​неточность при печати числа:

source: The inaccuracy isn't always visible when you print the number because the FP-to-decimal-string conversion is provided by the C library, and most C libraries try to produce sensible output. Even if it's not displayed, however, the inaccuracy is still there and subsequent operations can magnify the error.
pt_pt: A imprecisão nem sempre é visível quando imprime o número porque a conversão de FP para string decimal é fornecida pela biblioteca C, e a maioria das bibliotecas C tenta produzir saída sensata. Mesmo que não seja exibida, no entanto, a imprecisão ainda está presente e operações subsequentes podem ampliar o erro.
ru: Неточность не всегда заметна при печати числа, поскольку преобразование FP в десятичную строку обеспечивается библиотекой C, а большинство библиотек C пытаются выдать разумный результат. Однако даже если она не отображается, неточность все равно сохраняется, и последующие операции могут увеличить ошибку.

source: For many applications this doesn't matter. If I'm plotting points and displaying them on my monitor, the difference between 1.1 and 1.1000000000000001 is too small to be visible. Reports often limit output to a certain number of decimal places, and if you round the number to two or three or even eight decimal places, the error is never apparent. However, for applications where it does matter, it's a lot of work to implement your own custom arithmetic routines.
pt_pt: Para muitas aplicações, isto não importa. Se estiver a traçar pontos e a exibi-los no meu monitor, a diferença entre 1.1 e 1.1000000000000001 é demasiado pequena para ser visível. Os relatórios muitas vezes limitam a saída a um certo número de casas decimais, e se arredondar o número para duas, três ou mesmo oito casas decimais, o erro nunca é aparente. No entanto, para aplicações onde isto importa, é muito trabalho implementar as suas próprias rotinas aritméticas personalizadas.
ru: Для многих приложений это не имеет значения. Если я рисую точки и показываю их на мониторе, разница между 1,1 и 1,1000000000000001 слишком мала, чтобы ее можно было увидеть. Отчеты часто ограничивают вывод определенным количеством десятичных знаков, и если вы округлите число до двух, трех или даже восьми десятичных знаков, ошибка никогда не будет очевидна. Однако для приложений, где это имеет значение, реализация собственных арифметических процедур требует больших усилий.

source: Hence, the :class:`Decimal` type was created.
pt_pt: Daí, o tipo :class:`Decimal` foi criado.
ru: Таким образом, был создан тип :class:`Decimal`.

source: The :class:`Decimal` type
pt_pt: O tipo :class:`Decimal`
ru: Тип :class:`Decimal`

source: A new module, :mod:`decimal`, was added to Python's standard library. It contains two classes, :class:`Decimal` and :class:`Context`. :class:`Decimal` instances represent numbers, and :class:`Context` instances are used to wrap up various settings such as the precision and default rounding mode.
pt_pt: Um novo módulo, :mod:`decimal`, foi adicionado à biblioteca padrão do Python. Contém duas classes, :class:`Decimal` e :class:`Context`. As instâncias de :class:`Decimal` representam números, e as instâncias de :class:`Context` são usadas para agrupar várias definições, como a precisão e o modo de arredondamento predefinido.
ru: В стандартную библиотеку Python был добавлен новый модуль :mod:`decimal`. Он содержит два класса: :class:`Decimal` и :class:`Context`. Экземпляры :class:`Decimal` представляют числа, а экземпляры :class:`Context` используются для реализации различных настроек, таких как точность и режим округления по умолчанию.

source: :class:`Decimal` instances are immutable, like regular Python integers and FP numbers; once it's been created, you can't change the value an instance represents. :class:`Decimal` instances can be created from integers or strings::
pt_pt: As instâncias de :class:`Decimal` são imutáveis, como os inteiros e números FP normais do Python; uma vez criadas, não pode alterar o valor que uma instância representa. As instâncias de :class:`Decimal` podem ser criadas a partir de inteiros ou strings::
ru: Экземпляры :class:`Decimal` неизменяемы, как обычные целые числа Python и числа FP; после создания вы не сможете изменить значение, которое представляет экземпляр. Экземпляры :class:`Decimal` могут быть созданы из целых чисел или строк::

source: You can also provide tuples containing the sign, the mantissa represented as a tuple of decimal digits, and the exponent::
pt_pt: Também pode fornecer tuplos contendo o sinal, a mantissa representada como um tuplo de dígitos decimais, e o expoente::
ru: Вы также можете предоставить кортежи, содержащие знак, мантиссу, представленную в виде кортежа десятичных цифр, и показатель степени::

source: Cautionary note: the sign bit is a Boolean value, so 0 is positive and 1 is negative.
pt_pt: Nota de precaução: o bit de sinal é um valor booleano, pelo que 0 é positivo e 1 é negativo.
ru: Предупреждение: знаковый бит представляет собой логическое значение, поэтому 0 является положительным, а 1 — отрицательным.

source: Converting from floating-point numbers poses a bit of a problem: should the FP number representing 1.1 turn into the decimal number for exactly 1.1, or for 1.1 plus whatever inaccuracies are introduced? The decision was to dodge the issue and leave such a conversion out of the API. Instead, you should convert the floating-point number into a string using the desired precision and pass the string to the :class:`Decimal` constructor::
pt_pt: A conversão a partir de números de vírgula flutuante coloca um problema: o número FP que representa 1.1 deve tornar-se o número decimal para exatamente 1.1, ou para 1.1 mais quaisquer imprecisões introduzidas? A decisão foi evitar o problema e deixar tal conversão fora da API. Em vez disso, deve converter o número de vírgula flutuante numa string usando a precisão desejada e passar a string ao construtor :class:`Decimal`::
ru: Преобразование чисел с плавающей запятой создает некоторую проблему: должно ли число FP, представляющее 1,1, превратиться в десятичное число ровно для 1,1 или для 1,1 плюс все внесенные неточности? Было принято решение обойти эту проблему и исключить такое преобразование из API. Вместо этого вам следует преобразовать число с плавающей запятой в строку с желаемой точностью и передать строку конструктору :class:`Decimal`::

source: Once you have :class:`Decimal` instances, you can perform the usual mathematical operations on them. One limitation: exponentiation requires an integer exponent::
pt_pt: Uma vez que tenha instâncias de :class:`Decimal`, pode realizar as operações matemáticas habituais nelas. Uma limitação: a exponenciação requer um expoente inteiro::
ru: Если у вас есть экземпляры :class:`Decimal`, вы можете выполнять с ними обычные математические операции. Одно ограничение: для возведения в степень требуется целочисленный показатель::

source: >>> a = decimal.Decimal('35.72') >>> b = decimal.Decimal('1.73') >>> a+b Decimal("37.45") >>> a-b Decimal("33.99") >>> a*b Decimal("61.7956") >>> a/b Decimal("20.64739884393063583815028902") >>> a ** 2 Decimal("1275.9184") >>> a**b Traceback (most recent call last): ... decimal.InvalidOperation: x ** (non-integer)
pt_pt: >>> a = decimal.Decimal('35.72') >>> b = decimal.Decimal('1.73') >>> a+b Decimal("37.45") >>> a-b Decimal("33.99") >>> a*b Decimal("61.7956") >>> a/b Decimal("20.64739884393063583815028902") >>> a ** 2 Decimal("1275.9184") >>> a**b Traceback (most recent call last): ... decimal.InvalidOperation: x ** (não inteiro)

source: You can combine :class:`Decimal` instances with integers, but not with floating-point numbers::
pt_pt: Pode combinar instâncias de :class:`Decimal` com inteiros, mas não com números de vírgula flutuante::
ru: Вы можете комбинировать экземпляры :class:`Decimal` с целыми числами, но не с числами с плавающей запятой::

source: >>> a + 4 Decimal("39.72") >>> a + 4.5 Traceback (most recent call last): ... TypeError: You can interact Decimal only with int, long or Decimal data types. >>>
pt_pt: >>> a + 4 Decimal("39.72") >>> a + 4.5 Traceback (most recent call last): ... TypeError: Só pode interagir com Decimal usando tipos de dados int, long ou Decimal. >>>

source: :class:`Decimal` numbers can be used with the :mod:`math` and :mod:`cmath` modules, but note that they'll be immediately converted to floating-point numbers before the operation is performed, resulting in a possible loss of precision and accuracy. You'll also get back a regular floating-point number and not a :class:`Decimal`. ::
pt_pt: Os números :class:`Decimal` podem ser usados com os módulos :mod:`math` e :mod:`cmath`, mas note que serão imediatamente convertidos para números de vírgula flutuante antes de a operação ser realizada, resultando numa possível perda de precisão e exatidão. Também obterá de volta um número de vírgula flutuante normal e não um :class:`Decimal`. ::
ru: Числа :class:`Decimal` можно использовать с модулями :mod:`math` и :mod:`cmath`, но учтите, что они будут немедленно преобразованы в числа с плавающей запятой перед выполнением операции, что приведет к возможна потеря точности и аккуратности. Вы также получите обычное число с плавающей запятой, а не :class:`Decimal`. ::

source: :class:`Decimal` instances have a :meth:`sqrt` method that returns a :class:`Decimal`, but if you need other things such as trigonometric functions you'll have to implement them. ::
pt_pt: As instâncias de :class:`Decimal` têm um método :meth:`sqrt` que devolve um :class:`Decimal`, mas se precisar de outras coisas, como funções trigonométricas, terá de as implementar. ::
ru: Экземпляры :class:`Decimal` имеют метод :meth:`sqrt`, который возвращает :class:`Decimal`, но если вам нужны другие вещи, например, тригонометрические функции, вам придется их реализовать. ::

source: The :class:`Context` type
pt_pt: O tipo :class:`Context`
ru: Тип :class:`Context`

source: Instances of the :class:`Context` class encapsulate several settings for decimal operations:
pt_pt: As instâncias da classe :class:`Context` encapsulam várias definições para operações decimais:
ru: Экземпляры класса :class:`Context` инкапсулируют несколько настроек для десятичных операций:

source: :attr:`prec` is the precision, the number of decimal places.
pt_pt: :attr:`prec` é a precisão, o número de casas decimais.
ru: :attr:`prec` — точность, количество десятичных знаков.

source: :attr:`rounding` specifies the rounding mode. The :mod:`decimal` module has constants for the various possibilities: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN`, and various others.
pt_pt: :attr:`rounding` especifica o modo de arredondamento. O módulo :mod:`decimal` tem constantes para as várias possibilidades: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN`, e várias outras.
ru: :attr:`rounding` определяет режим округления. Модуль :mod:`decimal` имеет константы для различных возможностей: :const:`ROUND_DOWN`, :const:`ROUND_CEILING`, :const:`ROUND_HALF_EVEN` и других.

source: :attr:`traps` is a dictionary specifying what happens on encountering certain error conditions: either an exception is raised or a value is returned. Some examples of error conditions are division by zero, loss of precision, and overflow.
pt_pt: :attr:`traps` é um dicionário que especifica o que acontece ao encontrar certas condições de erro: ou uma exceção é gerada ou um valor é devolvido. Alguns exemplos de condições de erro são divisão por zero, perda de precisão e *overflow*.
ru: :attr:`traps` — это словарь, определяющий, что происходит при возникновении определенных условий ошибки: либо возникает исключение, либо возвращается значение. Некоторыми примерами ошибок являются деление на ноль, потеря точности и переполнение.

source: There's a thread-local default context available by calling :func:`getcontext`; you can change the properties of this context to alter the default precision, rounding, or trap handling. The following example shows the effect of changing the precision of the default context::
pt_pt: Existe um contexto predefinido local à *thread* disponível chamando :func:`getcontext`; pode alterar as propriedades deste contexto para modificar a precisão predefinida, o arredondamento ou o tratamento de *traps*. O exemplo seguinte mostra o efeito de alterar a precisão do contexto predefinido::
ru: Локальный контекст потока по умолчанию доступен при вызове :func:`getcontext`; вы можете изменить свойства этого контекста, чтобы изменить точность, округление или обработку ловушек по умолчанию. В следующем примере показан эффект изменения точности контекста по умолчанию:

source: The default action for error conditions is selectable; the module can either return a special value such as infinity or not-a-number, or exceptions can be raised::
pt_pt: A ação predefinida para condições de erro é selecionável; o módulo pode devolver um valor especial, como infinito ou não-número, ou podem ser geradas exceções::
ru: Можно выбрать действие по умолчанию для условий ошибки; модуль может либо возвращать специальное значение, например бесконечность или не-число, либо могут быть вызваны исключения::

source: The :class:`Context` instance also has various methods for formatting numbers such as :meth:`to_eng_string` and :meth:`to_sci_string`.
pt_pt: A instância de :class:`Context` também tem vários métodos para formatar números, como :meth:`to_eng_string` e :meth:`to_sci_string`.
ru: Экземпляр :class:`Context` также имеет различные методы форматирования чисел, такие как :meth:`to_eng_string` и :meth:`to_sci_string`.

source: For more information, see the documentation for the :mod:`decimal` module, which includes a quick-start tutorial and a reference.
pt_pt: Para mais informações, consulte a documentação do módulo :mod:`decimal`, que inclui um tutorial de início rápido e uma referência.
ru: Для получения дополнительной информации см. документацию к модулю :mod:`decimal`, которая включает в себя краткое руководство и справку.

source: :pep:`327` - Decimal Data Type
pt_pt: :pep:`327` - Tipo de Dados Decimal
ru: :pep:`327` - Десятичный тип данных

source: Written by Facundo Batista and implemented by Facundo Batista, Eric Price, Raymond Hettinger, Aahz, and Tim Peters.
pt_pt: Escrito por Facundo Batista e implementado por Facundo Batista, Eric Price, Raymond Hettinger, Aahz e Tim Peters.
ru: Написано Факундо Батистой и реализовано Факундо Батистой, Эриком Прайсом, Рэймондом Хеттингером, Аазом и Тимом Питерсом.

source: The article uses Fortran code to illustrate many of the problems that floating-point inaccuracy can cause.
pt_pt: O artigo usa código Fortran para ilustrar muitos dos problemas que a imprecisão de vírgula flutuante pode causar.
ru: В статье используется код Фортрана для иллюстрации многих проблем, которые может вызвать неточность чисел с плавающей запятой.

source: A description of a decimal-based representation. This representation is being proposed as a standard, and underlies the new Python decimal type. Much of this material was written by Mike Cowlishaw, designer of the Rexx language.
pt_pt: Uma descrição de uma representação baseada em decimais. Esta representação está a ser proposta como um padrão e está na base do novo tipo decimal do Python. Grande parte deste material foi escrito por Mike Cowlishaw, designer da linguagem Rexx.
ru: Описание десятичного представления. Это представление предлагается в качестве стандарта и лежит в основе нового десятичного типа Python. Большая часть этого материала была написана Майком Коулишоу, разработчиком языка Rexx.

source: PEP 328: Multi-line Imports
pt_pt: PEP 328: Importações Multi-linha
ru: PEP 328: многострочный импорт

source: One language change is a small syntactic tweak aimed at making it easier to import many names from a module. In a ``from module import names`` statement, *names* is a sequence of names separated by commas. If the sequence is very long, you can either write multiple imports from the same module, or you can use backslashes to escape the line endings like this::
pt_pt: Uma alteração na linguagem é um pequeno ajuste sintático com o objetivo de facilitar a importação de muitos nomes de um módulo. Numa instrução ``from module import names``, *names* é uma sequência de nomes separados por vírgulas. Se a sequência for muito longa, pode escrever várias importações do mesmo módulo ou pode usar barras invertidas para escapar as terminações de linha, como isto::
ru: Одно языковое изменение — это небольшая синтаксическая настройка, призванная упростить импорт многих имен из модуля. В операторе импорта имен из модуля *names* представляет собой последовательность имен, разделенных запятыми. Если последовательность очень длинная, вы можете либо записать несколько импортов из одного и того же модуля, либо использовать обратную косую черту, чтобы экранировать окончания строк, например:

source: The syntactic change in Python 2.4 simply allows putting the names within parentheses. Python ignores newlines within a parenthesized expression, so the backslashes are no longer needed::
pt_pt: A alteração sintática no Python 2.4 permite simplesmente colocar os nomes dentro de parênteses. O Python ignora novas linhas dentro de uma expressão entre parênteses, pelo que as barras invertidas já não são necessárias::
ru: Синтаксическое изменение в Python 2.4 позволяет просто заключать имена в круглые скобки. Python игнорирует символы новой строки в выражении, заключенном в круглые скобки, поэтому обратная косая черта больше не нужна::

source: The PEP also proposes that all :keyword:`import` statements be absolute imports, with a leading ``.`` character to indicate a relative import. This part of the PEP was not implemented for Python 2.4, but was completed for Python 2.5.
pt_pt: A PEP também propõe que todas as instruções :keyword:`import` sejam importações absolutas, com um caractere ``.`` inicial para indicar uma importação relativa. Esta parte da PEP não foi implementada para o Python 2.4, mas foi concluída para o Python 2.5.
ru: PEP также предлагает, чтобы все операторы :keyword:`import` были абсолютными импортами с ведущим символом ``.`` для обозначения относительного импорта. Эта часть PEP не была реализована для Python 2.4, но была завершена для Python 2.5.

source: :pep:`328` - Imports: Multi-Line and Absolute/Relative
pt_pt: :pep:`328` - Importações: Multi-linha e Absolutas/Relativas
ru: :pep:`328` - Импорт: многострочный и абсолютный/относительный

source: Written by Aahz. Multi-line imports were implemented by Dima Dorfman.
pt_pt: Escrito por Aahz. As importações multi-linha foram implementadas por Dima Dorfman.
ru: Написал Ааз. Многострочный импорт реализовал Дима Дорфман.

source: PEP 331: Locale-Independent Float/String Conversions
pt_pt: PEP 331: Conversões de Float/String Independentes da Localização
ru: PEP 331: независимые от локали преобразования чисел с плавающей запятой/строки
