Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.4.po
Languages: pt_pt, ru

source: What's New in Python 2.4
pt_pt: Novidades no Python 2.4
ru: Что нового в Python 2.4

source: Author
pt_pt: Autor
ru: Автор

source: This article explains the new features in Python 2.4.1, released on March 30, 2005.
pt_pt: Este artigo explica as novas funcionalidades do Python 2.4.1, lançado a 30 de março de 2005.
ru: В этой статье объясняются новые возможности Python 2.4.1, выпущенного 30 марта 2005 г.

source: Python 2.4 is a medium-sized release. It doesn't introduce as many changes as the radical Python 2.2, but introduces more features than the conservative 2.3 release. The most significant new language features are function decorators and generator expressions; most other changes are to the standard library.
pt_pt: O Python 2.4 é uma versão de dimensão média. Não introduz tantas alterações como o radical Python 2.2, mas apresenta mais funcionalidades do que a conservadora versão 2.3. As novas funcionalidades mais significativas da linguagem são os decoradores de funções e as expressões geradoras; a maioria das outras alterações são na biblioteca padrão.
ru: Python 2.4 — это версия среднего размера. В нем не так много изменений, как в радикальной версии Python 2.2, но реализовано больше возможностей, чем в консервативной версии 2.3. Наиболее важными новыми возможностями языка являются декораторы функций и выражения-генераторы; большинство других изменений относятся к стандартной библиотеке.

source: According to the CVS change logs, there were 481 patches applied and 502 bugs fixed between Python 2.3 and 2.4. Both figures are likely to be underestimates.
pt_pt: De acordo com os registos de alterações do CVS, foram aplicadas 481 correções e corrigidos 502 *bugs* entre o Python 2.3 e o 2.4. Ambos os números são provavelmente subestimados.
ru: Согласно журналам изменений CVS, между Python 2.3 и 2.4 было применено 481 исправление и исправлено 502 ошибки. Обе цифры, скорее всего, занижены.

source: This article doesn't attempt to provide a complete specification of every single new feature, but instead provides a brief introduction to each feature. For full details, you should refer to the documentation for Python 2.4, such as the Python Library Reference and the Python Reference Manual. Often you will be referred to the PEP for a particular new feature for explanations of the implementation and design rationale.
pt_pt: Este artigo não tenta fornecer uma especificação completa de cada nova funcionalidade, mas sim uma breve introdução a cada uma. Para detalhes completos, deve consultar a documentação do Python 2.4, como a Referência da Biblioteca Python e o Manual de Referência do Python. Muitas vezes será remetido para a PEP de uma funcionalidade específica para explicações sobre a implementação e a racionalidade do design.
ru: В этой статье не делается попытка предоставить полную спецификацию каждой новой функции, а вместо этого представлено краткое введение в каждую функцию. Для получения более подробной информации вам следует обратиться к документации по Python 2.4, такой как Справочник по библиотеке Python и Справочное руководство по Python. Часто вас направят к PEP за конкретной новой функцией для объяснения реализации и обоснования дизайна.

source: PEP 218: Built-In Set Objects
pt_pt: PEP 218: Objetos de Conjunto Integrados
ru: PEP 218: встроенные объекты множества

source: Python 2.3 introduced the :mod:`sets` module. C implementations of set data types have now been added to the Python core as two new built-in types, ``set(iterable)`` and ``frozenset(iterable)``. They provide high speed operations for membership testing, for eliminating duplicates from sequences, and for mathematical operations like unions, intersections, differences, and symmetric differences. ::
pt_pt: O Python 2.3 introduziu o módulo :mod:`sets`. Implementações em C de tipos de dados de conjunto foram agora adicionadas ao núcleo do Python como dois novos tipos integrados, ``set(iterable)`` e ``frozenset(iterable)``. Estes fornecem operações de alta velocidade para teste de pertença, para eliminar duplicados de sequências, e para operações matemáticas como uniões, intersecções, diferenças e diferenças simétricas. ::
ru: В Python 2.3 появился модуль :mod:`sets`. Реализации C наборов типов данных теперь добавлены в ядро ​​Python в виде двух новых встроенных типов: ``set(iterable)`` и ``frozenset(iterable)``. Они обеспечивают высокоскоростные операции проверки принадлежности, исключения дубликатов из последовательностей и математических операций, таких как объединения, пересечения, различия и симметричные различия. ::

source: >>> a = set('abracadabra') # form a set from a string >>> 'z' in a # fast membership testing False >>> a # unique letters in a set(['a', 'r', 'b', 'c', 'd']) >>> ''.join(a) # convert back into a string 'arbcd' >>> b = set('alacazam') # form a second set >>> a - b # letters in a but not in b set(['r', 'd', 'b']) >>> a | b # letters in either a or b set(['a', 'c', 'r', 'd', 'b', 'm', 'z', 'l']) >>> a & b # letters in both a and b set(['a', 'c']) >>> a ^ b # letters in a or b but not both set(['r', 'd', 'b', 'm', 'z', 'l']) >>> a.add('z') # add a new element >>> a.update('wxy') # add multiple new elements >>> a set(['a', 'c', 'b', 'd', 'r', 'w', 'y', 'x', 'z']) >>> a.remove('x') # take one element out >>> a set(['a', 'c', 'b', 'd', 'r', 'w', 'y', 'z'])
pt_pt: >>> a = set('abracadabra') # criar um conjunto a partir de uma string >>> 'z' in a # teste rápido de pertença False >>> a # letras únicas em a set(['a', 'r', 'b', 'c', 'd']) >>> ''.join(a) # converter de volta para uma string 'arbcd' >>> b = set('alacazam') # criar um segundo conjunto >>> a - b # letras em a mas não em b set(['r', 'd', 'b']) >>> a | b # letras em a ou b set(['a', 'c', 'r', 'd', 'b', 'm', 'z', 'l']) >>> a & b # letras em a e b set(['a', 'c']) >>> a ^ b # letras em a ou b mas não em ambos set(['r', 'd', 'b', 'm', 'z', 'l']) >>> a.add('z') # adicionar um novo elemento >>> a.update('wxy') # adicionar vários novos elementos >>> a set(['a', 'c', 'b', 'd', 'r', 'w', 'y', 'x', 'z']) >>> a.remove('x') # remover um elemento >>> a set(['a', 'c', 'b', 'd', 'r', 'w', 'y', 'z'])

source: The :func:`frozenset` type is an immutable version of :func:`set`. Since it is immutable and hashable, it may be used as a dictionary key or as a member of another set.
pt_pt: O tipo :func:`frozenset` é uma versão imutável de :func:`set`. Como é imutável e *hashável*, pode ser usado como chave de dicionário ou como membro de outro conjunto.
ru: Тип :func:`frozenset` является неизменяемой версией :func:`set`. Поскольку он неизменяем и хешируется, его можно использовать как ключ словаря или как член другого набора.

source: The :mod:`sets` module remains in the standard library, and may be useful if you wish to subclass the :class:`Set` or :class:`ImmutableSet` classes. There are currently no plans to deprecate the module.
pt_pt: O módulo :mod:`sets` permanece na biblioteca padrão e pode ser útil se pretender criar subclasses das classes :class:`Set` ou :class:`ImmutableSet`. Atualmente, não há planos para descontinuar o módulo.
ru: Модуль :mod:`sets` остаётся в стандартной библиотеке и может быть полезен, если вы хотите создать подкласс классов :class:`Set` или :class:`ImmutableSet`. В настоящее время нет планов по прекращению поддержки модуля.

source: :pep:`218` - Adding a Built-In Set Object Type
pt_pt: :pep:`218` - Adição de um Tipo de Objeto de Conjunto Integrado
ru: :pep:`218` - Добавление встроенного набора типов объектов

source: Originally proposed by Greg Wilson and ultimately implemented by Raymond Hettinger.
pt_pt: Originalmente proposto por Greg Wilson e implementado por Raymond Hettinger.
ru: Первоначально предложено Грегом Уилсоном и в конечном итоге реализовано Рэймондом Хеттингером.

source: PEP 237: Unifying Long Integers and Integers
pt_pt: PEP 237: Unificação de Inteiros Longos e Inteiros
ru: PEP 237: объединение длинных и целых чисел

source: The lengthy transition process for this PEP, begun in Python 2.2, takes another step forward in Python 2.4. In 2.3, certain integer operations that would behave differently after int/long unification triggered :exc:`FutureWarning` warnings and returned values limited to 32 or 64 bits (depending on your platform). In 2.4, these expressions no longer produce a warning and instead produce a different result that's usually a long integer.
pt_pt: O longo processo de transição para esta PEP, iniciado no Python 2.2, dá mais um passo no Python 2.4. No 2.3, certas operações com inteiros que se comportariam de forma diferente após a unificação de inteiros/longos geravam avisos :exc:`FutureWarning` e devolviam valores limitados a 32 ou 64 bits (dependendo da plataforma). No 2.4, estas expressões já não produzem um aviso e, em vez disso, produzem um resultado diferente que é normalmente um inteiro longo.
ru: Длительный процесс перехода для этого PEP, начавшийся в Python 2.2, делает еще один шаг вперед в Python 2.4. В версии 2.3 некоторые целочисленные операции, которые вели себя по-другому после унификации int/long, вызывали предупреждения :exc:`FutureWarning` и возвращали значения, ограниченные 32 или 64 битами (в зависимости от вашей платформы). В версии 2.4 эти выражения больше не выдают предупреждение, а вместо этого выдают другой результат, который обычно представляет собой длинное целое число.

source: The problematic expressions are primarily left shifts and lengthy hexadecimal and octal constants. For example, ``2 << 32`` results in a warning in 2.3, evaluating to 0 on 32-bit platforms. In Python 2.4, this expression now returns the correct answer, 8589934592.
pt_pt: As expressões problemáticas são principalmente deslocamentos à esquerda e constantes hexadecimais e octais longas. Por exemplo, ``2 << 32`` resulta num aviso no 2.3, avaliando para 0 em plataformas de 32 bits. No Python 2.4, esta expressão agora devolve a resposta correta, 8589934592.
ru: Проблемными выражениями являются в первую очередь сдвиги влево и длинные шестнадцатеричные и восьмеричные константы. Например, ``2 << 32`` приводит к предупреждению в версии 2.3, которое оценивается как 0 на 32-битных платформах. В Python 2.4 это выражение теперь возвращает правильный ответ: 8589934592.

source: :pep:`237` - Unifying Long Integers and Integers
pt_pt: :pep:`237` - Unificação de Inteiros Longos e Inteiros
ru: :pep:`237` - Объединение длинных и целых чисел

source: Original PEP written by Moshe Zadka and GvR. The changes for 2.4 were implemented by Kalle Svensson.
pt_pt: PEP original escrita por Moshe Zadka e GvR. As alterações para o 2.4 foram implementadas por Kalle Svensson.
ru: Оригинальный PEP, написанный Моше Задкой и GvR. Изменения в версии 2.4 внес Калле Свенссон.

source: PEP 289: Generator Expressions
pt_pt: PEP 289: Expressões Geradoras
ru: PEP 289: Генераторные выражения

source: The iterator feature introduced in Python 2.2 and the :mod:`itertools` module make it easier to write programs that loop through large data sets without having the entire data set in memory at one time. List comprehensions don't fit into this picture very well because they produce a Python list object containing all of the items. This unavoidably pulls all of the objects into memory, which can be a problem if your data set is very large. When trying to write a functionally styled program, it would be natural to write something like::
pt_pt: A funcionalidade de iterador introduzida no Python 2.2 e o módulo :mod:`itertools` tornam mais fácil escrever programas que percorrem grandes conjuntos de dados sem ter todo o conjunto de dados na memória de uma só vez. As *list comprehensions* não se encaixam bem neste cenário porque produzem um objeto de lista Python contendo todos os itens. Isto inevitavelmente coloca todos os objetos na memória, o que pode ser um problema se o seu conjunto de dados for muito grande. Ao tentar escrever um programa no estilo funcional, seria natural escrever algo como::
ru: Функция итератора, представленная в Python 2.2, и модуль :mod:`itertools` упрощают написание программ, которые обрабатывают большие наборы данных без одновременного хранения всего набора данных в памяти. Понимания списков не очень хорошо вписываются в эту картину, поскольку они создают объект списка Python, содержащий все элементы. Это неизбежно затянет все объекты в память, что может стать проблемой, если ваш набор данных очень велик. При попытке написать программу в функциональном стиле было бы естественно написать что-то вроде::

source: instead of ::
pt_pt: em vez de ::
ru: вместо ::

source: The first form is more concise and perhaps more readable, but if you're dealing with a large number of link objects you'd have to write the second form to avoid having all link objects in memory at the same time.
pt_pt: A primeira forma é mais concisa e talvez mais legível, mas se estiver a lidar com um grande número de objetos de ligação, teria de escrever a segunda forma para evitar ter todos os objetos de ligação na memória ao mesmo tempo.
ru: Первая форма более краткая и, возможно, более удобочитаемая, но если вы имеете дело с большим количеством объектов ссылок, вам придется написать вторую форму, чтобы избежать одновременного размещения всех объектов ссылок в памяти.

source: Generator expressions work similarly to list comprehensions but don't materialize the entire list; instead they create a generator that will return elements one by one. The above example could be written as::
pt_pt: As expressões geradoras funcionam de forma semelhante às *list comprehensions*, mas não materializam a lista inteira; em vez disso, criam um gerador que devolverá os elementos um a um. O exemplo acima poderia ser escrito como::
ru: Выражения-генераторы работают аналогично пониманию списков, но не материализуют весь список; вместо этого они создают генератор, который будет возвращать элементы один за другим. Приведенный выше пример можно записать как::

source: Generator expressions always have to be written inside parentheses, as in the above example. The parentheses signalling a function call also count, so if you want to create an iterator that will be immediately passed to a function you could write::
pt_pt: As expressões geradoras têm sempre de ser escritas dentro de parênteses, como no exemplo acima. Os parênteses que sinalizam uma chamada de função também contam, pelo que, se pretender criar um iterador que será imediatamente passado a uma função, pode escrever::
ru: Выражения-генераторы всегда нужно писать в круглых скобках, как в приведенном выше примере. Круглые скобки, сигнализирующие о вызове функции, также учитываются, поэтому, если вы хотите создать итератор, который будет немедленно передан функции, вы можете написать::

source: Generator expressions differ from list comprehensions in various small ways. Most notably, the loop variable (*obj* in the above example) is not accessible outside of the generator expression. List comprehensions leave the variable assigned to its last value; future versions of Python will change this, making list comprehensions match generator expressions in this respect.
pt_pt: As expressões geradoras diferem das *list comprehensions* de várias formas subtis. Mais notavelmente, a variável de ciclo (*obj* no exemplo acima) não é acessível fora da expressão geradora. As *list comprehensions* deixam a variável atribuída ao seu último valor; versões futuras do Python irão alterar isto, fazendo com que as *list comprehensions* correspondam às expressões geradoras neste aspeto.
ru: Выражения-генераторы отличаются от понимания списков во многих мелких отношениях. В частности, переменная цикла (*obj* в приведенном выше примере) недоступна вне выражения генератора. При использовании списков переменной присваивается ее последнее значение; будущие версии Python изменят это, заставив в этом отношении выражения списков соответствовать выражениям генератора.

source: :pep:`289` - Generator Expressions
pt_pt: :pep:`289` - Expressões Geradoras
ru: :pep:`289` - Генератор выражений

source: Proposed by Raymond Hettinger and implemented by Jiwon Seo with early efforts steered by Hye-Shik Chang.
pt_pt: Proposto por Raymond Hettinger e implementado por Jiwon Seo, com esforços iniciais orientados por Hye-Shik Chang.
ru: Предложено Раймондом Хеттингером и реализовано Дживоном Со, первые усилия проводились под руководством Хе-Шик Чанга.

source: PEP 292: Simpler String Substitutions
pt_pt: PEP 292: Substituições de Strings Mais Simples
ru: PEP 292: более простые замены строк

source: Some new classes in the standard library provide an alternative mechanism for substituting variables into strings; this style of substitution may be better for applications where untrained users need to edit templates.
pt_pt: Algumas novas classes na biblioteca padrão fornecem um mecanismo alternativo para substituir variáveis em strings; este estilo de substituição pode ser melhor para aplicações onde utilizadores não treinados precisam de editar modelos.
ru: Некоторые новые классы стандартной библиотеки предоставляют альтернативный механизм замены переменных в строки; этот стиль замены может быть лучше для приложений, в которых неподготовленным пользователям необходимо редактировать шаблоны.

source: The usual way of substituting variables by name is the ``%`` operator::
pt_pt: A forma habitual de substituir variáveis por nome é o operador ``%``::
ru: Обычным способом замены переменных по имени является оператор ``%``::

source: >>> '%(page)i: %(title)s' % {'page':2, 'title': 'The Best of Times'} '2: The Best of Times'
pt_pt: >>> '%(page)i: %(title)s' % {'page':2, 'title': 'Os Melhores Tempos'} '2: Os Melhores Tempos'

source: When writing the template string, it can be easy to forget the ``i`` or ``s`` after the closing parenthesis. This isn't a big problem if the template is in a Python module, because you run the code, get an "Unsupported format character" :exc:`ValueError`, and fix the problem. However, consider an application such as Mailman where template strings or translations are being edited by users who aren't aware of the Python language. The format string's syntax is complicated to explain to such users, and if they make a mistake, it's difficult to provide helpful feedback to them.
pt_pt: Ao escrever a string de modelo, pode ser fácil esquecer o ``i`` ou ``s`` após o parêntese de fecho. Isto não é um grande problema se o modelo estiver num módulo Python, porque executa o código, obtém um erro :exc:`ValueError` de "caractere de formato não suportado" e corrige o problema. No entanto, considere uma aplicação como o Mailman, onde strings de modelo ou traduções estão a ser editadas por utilizadores que não estão familiarizados com a linguagem Python. A sintaxe da string de formato é complicada de explicar a tais utilizadores e, se cometerem um erro, é difícil fornecer-lhes feedback útil.
ru: При написании строки шаблона можно легко забыть ``i`` или ``s`` после закрывающей скобки. Это не является большой проблемой, если шаблон находится в модуле Python, поскольку вы запускаете код, получаете «Символ неподдерживаемого формата» :exc:`ValueError` и устраняете проблему. Однако рассмотрим такое приложение, как Mailman, в котором строки шаблонов или переводы редактируются пользователями, не знающими языка Python. Синтаксис строки формата сложно объяснить таким пользователям, и если они допустят ошибку, им будет сложно предоставить полезную обратную связь.

source: PEP 292 adds a :class:`Template` class to the :mod:`string` module that uses ``$`` to indicate a substitution::
pt_pt: A PEP 292 adiciona uma classe :class:`Template` ao módulo :mod:`string` que usa ``$`` para indicar uma substituição::
ru: PEP 292 добавляет класс :class:`Template` к модулю :mod:`string`, который использует ``$`` для обозначения замены::

source: If a key is missing from the dictionary, the :meth:`substitute` method will raise a :exc:`KeyError`. There's also a :meth:`safe_substitute` method that ignores missing keys::
pt_pt: Se uma chave estiver em falta no dicionário, o método :meth:`substitute` irá gerar um :exc:`KeyError`. Também existe um método :meth:`safe_substitute` que ignora chaves em falta::
ru: Если ключ отсутствует в словаре, метод :meth:`substitute` выдаст :exc:`KeyError`. Также существует метод :meth:`safe_substitute`, который игнорирует отсутствующие ключи::

source: :pep:`292` - Simpler String Substitutions
pt_pt: :pep:`292` - Substituições de Strings Mais Simples
ru: :pep:`292` - Простые замены строк

source: Written and implemented by Barry Warsaw.
pt_pt: Escrito e implementado por Barry Warsaw.
ru: Написано и реализовано Барри Варшавой.

source: PEP 318: Decorators for Functions and Methods
pt_pt: PEP 318: Decoradores para Funções e Métodos
ru: PEP 318: Декораторы для функций и методов

source: Python 2.2 extended Python's object model by adding static methods and class methods, but it didn't extend Python's syntax to provide any new way of defining static or class methods. Instead, you had to write a :keyword:`def` statement in the usual way, and pass the resulting method to a :func:`staticmethod` or :func:`classmethod` function that would wrap up the function as a method of the new type. Your code would look like this::
pt_pt: O Python 2.2 estendeu o modelo de objetos do Python ao adicionar métodos estáticos e de classe, mas não estendeu a sintaxe do Python para fornecer qualquer nova forma de definir métodos estáticos ou de classe. Em vez disso, tinha de escrever uma instrução :keyword:`def` da forma habitual e passar o método resultante a uma função :func:`staticmethod` ou :func:`classmethod` que envolveria a função como um método do novo tipo. O seu código ficaria assim::
ru: Python 2.2 расширил объектную модель Python, добавив статические методы и методы класса, но не расширил синтаксис Python, чтобы предоставить какой-либо новый способ определения статических методов или методов класса. Вместо этого вам нужно было написать оператор :keyword:`def` обычным способом и передать полученный метод функции :func:`staticmethod` или :func:`classmethod`, которая обернула бы функцию как метод новый тип. Ваш код будет выглядеть так::

source: class C: def meth (cls): ... meth = classmethod(meth) # Rebind name to wrapped-up class method
pt_pt: class C: def meth (cls): ... meth = classmethod(meth) # Reatribuir nome ao método de classe envolvido

source: If the method was very long, it would be easy to miss or forget the :func:`classmethod` invocation after the function body.
pt_pt: Se o método fosse muito longo, seria fácil perder ou esquecer a invocação :func:`classmethod` após o corpo da função.
ru: Если бы метод был очень длинным, было бы легко пропустить или забыть вызов :func:`classmethod` после тела функции.

source: The intention was always to add some syntax to make such definitions more readable, but at the time of 2.2's release a good syntax was not obvious. Today a good syntax *still* isn't obvious but users are asking for easier access to the feature; a new syntactic feature has been added to meet this need.
pt_pt: A intenção era sempre adicionar alguma sintaxe para tornar tais definições mais legíveis, mas na altura do lançamento do 2.2, uma boa sintaxe não era óbvia. Hoje, uma boa sintaxe *ainda* não é óbvia, mas os utilizadores estão a pedir um acesso mais fácil a esta funcionalidade; uma nova funcionalidade sintática foi adicionada para satisfazer esta necessidade.
ru: Намерением всегда было добавить некоторый синтаксис, чтобы сделать такие определения более читабельными, но на момент выпуска 2.2 хороший синтаксис не был очевиден. Сегодня хороший синтаксис *по-прежнему* не очевиден, но пользователи просят облегчить доступ к этой функции; Для удовлетворения этой потребности была добавлена ​​новая синтаксическая функция.
