Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: The :mod:`struct` is now faster because it compiles format strings into :class:`Struct` objects with :meth:`pack` and :meth:`unpack` methods. This is similar to how the :mod:`re` module lets you create compiled regular expression objects. You can still use the module-level :func:`pack` and :func:`unpack` functions; they'll create :class:`Struct` objects and cache them. Or you can use :class:`Struct` instances directly::
pt_pt: O módulo :mod:`struct` é agora mais rápido porque compila *strings* de formato em objetos :class:`Struct` com métodos :meth:`pack` e :meth:`unpack`. Isto é semelhante à forma como o módulo :mod:`re` permite criar objetos de expressão regular compilados. Ainda pode usar as funções de nível de módulo :func:`pack` e :func:`unpack`; elas criarão objetos :class:`Struct` e guardá-los-ão em cache. Ou pode usar instâncias :class:`Struct` diretamente::
ru: :mod:`struct` теперь работает быстрее, поскольку он компилирует строки формата в объекты :class:`Struct` с помощью методов :meth:`pack` и :meth:`unpack`. Это похоже на то, как модуль :mod:`re` позволяет создавать скомпилированные объекты регулярных выражений. Вы по-прежнему можете использовать функции :func:`pack` и :func:`unpack` на уровне модуля; они будут создавать объекты :class:`Struct` и кэшировать их. Или вы можете использовать экземпляры :class:`Struct` напрямую::

source: You can also pack and unpack data to and from buffer objects directly using the ``pack_into(buffer, offset, v1, v2, ...)`` and ``unpack_from(buffer, offset)`` methods. This lets you store data directly into an array or a memory-mapped file.
pt_pt: Também pode empacotar e desempacotar dados para e de objetos de buffer diretamente usando os métodos ``pack_into(buffer, offset, v1, v2, ...)`` e ``unpack_from(buffer, offset)``. Isto permite armazenar dados diretamente num array ou num ficheiro mapeado em memória.
ru: Вы также можете упаковывать и распаковывать данные в объекты буфера и из них напрямую, используя методы ``pack_into(buffer, offset, v1, v2, ...)`` и ``unpack_from(buffer, offset)``. Это позволяет хранить данные непосредственно в массиве или файле, отображаемом в памяти.

source: (:class:`Struct` objects were implemented by Bob Ippolito at the NeedForSpeed sprint. Support for buffer objects was added by Martin Blais, also at the NeedForSpeed sprint.)
pt_pt: (Os objetos :class:`Struct` foram implementados por Bob Ippolito no *sprint* NeedForSpeed. O suporte para objetos de buffer foi adicionado por Martin Blais, também no *sprint* NeedForSpeed.)
ru: (Объекты:class:`Struct` были реализованы Бобом Ипполито во время спринта NeedForSpeed. Поддержка буферных объектов была добавлена ​​Мартином Блейсом, также во время спринта NeedForSpeed.)

source: The Python developers switched from CVS to Subversion during the 2.5 development process. Information about the exact build version is available as the ``sys.subversion`` variable, a 3-tuple of ``(interpreter-name, branch-name, revision-range)``. For example, at the time of writing my copy of 2.5 was reporting ``('CPython', 'trunk', '45313:45315')``.
pt_pt: Os programadores Python mudaram de CVS para Subversion durante o processo de desenvolvimento do 2.5. Informações sobre a versão exata da compilação estão disponíveis na variável ``sys.subversion``, um 3-tuplo de ``(interpreter-name, branch-name, revision-range)``. Por exemplo, na altura da escrita, a minha cópia do 2.5 reportava ``('CPython', 'trunk', '45313:45315')``.
ru: Разработчики Python перешли с CVS на Subversion в процессе разработки версии 2.5. Информация о точной версии сборки доступна в виде переменной ``sys.subversion``, состоящей из трех частей ``(имя-интерпретатора, имя-ветви, диапазон ревизий)``. Например, на момент написания моя копия 2.5 сообщала ``('CPython', 'trunk', '45313:45315')``.

source: This information is also available to C extensions via the :c:func:`Py_GetBuildInfo` function that returns a string of build information like this: ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contributed by Barry Warsaw.)
pt_pt: Esta informação também está disponível para extensões C através da função :c:func:`Py_GetBuildInfo`, que devolve uma *string* de informação de compilação como esta: ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contribuído por Barry Warsaw.)
ru: Эта информация также доступна расширениям C через функцию :c:func:`Py_GetBuildInfo`, которая возвращает строку информации о сборке, подобную этой: ``"trunk:45355:45356M, 13 апреля 2006 г., 07:42:19"`` . (Предоставлено Барри Варшавой.)

source: Another new function, :func:`sys._current_frames`, returns the current stack frames for all running threads as a dictionary mapping thread identifiers to the topmost stack frame currently active in that thread at the time the function is called. (Contributed by Tim Peters.)
pt_pt: Outra nova função, :func:`sys._current_frames`, devolve os quadros de pilha atuais para todas as *threads* em execução como um dicionário que mapeia identificadores de *threads* para o quadro de pilha mais alto atualmente ativo nessa *thread* no momento em que a função é chamada. (Contribuído por Tim Peters.)
ru: Другая новая функция, :func:`sys._current_frames`, возвращает текущие кадры стека для всех запущенных потоков в виде словаря, сопоставляющего идентификаторы потоков с самым верхним кадром стека, активным в данный момент в этом потоке на момент вызова функции. (Предоставлено Тимом Питерсом.)

source: The :class:`TarFile` class in the :mod:`tarfile` module now has an :meth:`extractall` method that extracts all members from the archive into the current working directory. It's also possible to set a different directory as the extraction target, and to unpack only a subset of the archive's members.
pt_pt: A classe :class:`TarFile` no módulo :mod:`tarfile` tem agora um método :meth:`extractall` que extrai todos os membros do arquivo para o diretório de trabalho atual. Também é possível definir um diretório diferente como alvo de extração e descompactar apenas um subconjunto dos membros do arquivo.
ru: Класс :class:`TarFile` в модуле :mod:`tarfile` теперь имеет метод :meth:`extractall`, который извлекает все элементы из архива в текущий рабочий каталог. Также можно установить другой каталог в качестве цели извлечения и распаковывать только часть элементов архива.

source: The compression used for a tarfile opened in stream mode can now be autodetected using the mode ``'r|*'``. (Contributed by Lars Gustäbel.)
pt_pt: A compressão usada para um arquivo tar aberto em modo de *stream* pode agora ser detetada automaticamente usando o modo ``'r|*'``. (Contribuído por Lars Gustäbel.)
ru: Сжатие, используемое для tar-файла, открытого в потоковом режиме, теперь можно автоматически определить с помощью режима ``'r|*'``. (Предоставлено Ларсом Густебелем.)

source: The :mod:`threading` module now lets you set the stack size used when new threads are created. The ``stack_size([*size*])`` function returns the currently configured stack size, and supplying the optional *size* parameter sets a new value. Not all platforms support changing the stack size, but Windows, POSIX threading, and OS/2 all do. (Contributed by Andrew MacIntyre.)
pt_pt: O módulo :mod:`threading` agora permite definir o tamanho da pilha usado quando novas *threads* são criadas. A função ``stack_size([*size*])`` devolve o tamanho da pilha atualmente configurado, e fornecer o parâmetro opcional *size* define um novo valor. Nem todas as plataformas suportam a alteração do tamanho da pilha, mas Windows, POSIX threading e OS/2 suportam. (Contribuído por Andrew MacIntyre.)
ru: Модуль :mod:`threading` теперь позволяет вам установить размер стека, используемый при создании новых потоков. Функция stack_size([*size*])`` возвращает текущий настроенный размер стека, а указание необязательного параметра *size* устанавливает новое значение. Не все платформы поддерживают изменение размера стека, но все Windows, многопоточность POSIX и OS/2 поддерживают. (Предоставлено Эндрю Макинтайром.)

source: The :mod:`unicodedata` module has been updated to use version 4.1.0 of the Unicode character database. Version 3.2.0 is required by some specifications, so it's still available as :data:`unicodedata.ucd_3_2_0`.
pt_pt: O módulo :mod:`unicodedata` foi atualizado para usar a versão 4.1.0 da base de dados de caracteres Unicode. A versão 3.2.0 é necessária por algumas especificações, pelo que ainda está disponível como :data:`unicodedata.ucd_3_2_0`.
ru: Модуль :mod:`unicodedata` был обновлен для использования версии 4.1.0 базы данных символов Юникода. Версия 3.2.0 требуется для некоторых спецификаций, поэтому она по-прежнему доступна как :data:`unicodedata.ucd_3_2_0`.

source: New module: the :mod:`uuid` module generates universally unique identifiers (UUIDs) according to :rfc:`4122`. The RFC defines several different UUID versions that are generated from a starting string, from system properties, or purely randomly. This module contains a :class:`UUID` class and functions named :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, and :func:`uuid5` to generate different versions of UUID. (Version 2 UUIDs are not specified in :rfc:`4122` and are not supported by this module.) ::
pt_pt: Novo módulo: o módulo :mod:`uuid` gera identificadores universalmente únicos (UUIDs) de acordo com a :rfc:`4122`. A RFC define várias versões diferentes de UUIDs que são geradas a partir de uma *string* inicial, de propriedades do sistema, ou puramente de forma aleatória. Este módulo contém uma classe :class:`UUID` e funções denominadas :func:`uuid1`, :func:`uuid3`, :func:`uuid4` e :func:`uuid5` para gerar diferentes versões de UUIDs. (Os UUIDs da versão 2 não estão especificados na :rfc:`4122` e não são suportados por este módulo.) ::
ru: Новый модуль: модуль :mod:`uuid` генерирует универсально уникальные идентификаторы (UUID) в соответствии с :rfc:`4122`. RFC определяет несколько различных версий UUID, которые генерируются из начальной строки, из свойств системы или чисто случайным образом. Этот модуль содержит класс :class:`UUID` и функции с именами :func:`uuid1`, :func:`uuid3`, :func:`uuid4` и :func:`uuid5` для генерации различных версий UUID. (UUID версии 2 не указаны в :rfc:`4122` и не поддерживаются этим модулем.) ::

source: >>> import uuid >>> # make a UUID based on the host ID and current time >>> uuid.uuid1() UUID('a8098c1a-f86e-11da-bd1a-00112444be1e') >>> # make a UUID using an MD5 hash of a namespace UUID and a name >>> uuid.uuid3(uuid.NAMESPACE_DNS, 'python.org') UUID('6fa459ea-ee8a-3ca4-894e-db77e160355e') >>> # make a random UUID >>> uuid.uuid4() UUID('16fd2706-8baf-433b-82eb-8c7fada847da') >>> # make a UUID using a SHA-1 hash of a namespace UUID and a name >>> uuid.uuid5(uuid.NAMESPACE_DNS, 'python.org') UUID('886313e1-3b8a-5372-9b90-0c9aee199e5d')
pt_pt: >>> import uuid >>> # criar um UUID com base no ID do *host* e na hora atual >>> uuid.uuid1() UUID('a8098c1a-f86e-11da-bd1a-00112444be1e') >>> # criar um UUID usando um *hash* MD5 de um UUID de *namespace* e um nome >>> uuid.uuid3(uuid.NAMESPACE_DNS, 'python.org') UUID('6fa459ea-ee8a-3ca4-894e-db77e160355e') >>> # criar um UUID aleatório >>> uuid.uuid4() UUID('16fd2706-8baf-433b-82eb-8c7fada847da') >>> # criar um UUID usando um *hash* SHA-1 de um UUID de *namespace* e um nome >>> uuid.uuid5(uuid.NAMESPACE_DNS, 'python.org') UUID('886313e1-3b8a-5372-9b90-0c9aee199e5d')

source: (Contributed by Ka-Ping Yee.)
pt_pt: (Contribuído por Ka-Ping Yee.)
ru: (Предоставлено Ка-Пин Йи.)

source: The :mod:`weakref` module's :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` types gained new methods for iterating over the weak references contained in the dictionary. :meth:`iterkeyrefs` and :meth:`keyrefs` methods were added to :class:`WeakKeyDictionary`, and :meth:`itervaluerefs` and :meth:`valuerefs` were added to :class:`WeakValueDictionary`. (Contributed by Fred L. Drake, Jr.)
pt_pt: Os tipos :class:`WeakKeyDictionary` e :class:`WeakValueDictionary` do módulo :mod:`weakref` ganharam novos métodos para iterar sobre as referências fracas contidas no dicionário. Os métodos :meth:`iterkeyrefs` e :meth:`keyrefs` foram adicionados a :class:`WeakKeyDictionary`, e :meth:`itervaluerefs` e :meth:`valuerefs` foram adicionados a :class:`WeakValueDictionary`. (Contribuído por Fred L. Drake, Jr.)
ru: Типы :class:`WeakKeyDictionary` и :class:`WeakValueDictionary` модуля :mod:`weakref` получили новые методы для перебора слабых ссылок, содержащихся в словаре. Методы :meth:`iterkeyrefs` и :meth:`keyrefs` были добавлены в :class:`WeakKeyDictionary`, а :meth:`itervaluerefs` и :meth:`valuerefs` были добавлены в :class:`WeakValueDictionary`. (Предоставлено Фредом Л. Дрейком-младшим)

source: The :mod:`webbrowser` module received a number of enhancements. It's now usable as a script with ``python -m webbrowser``, taking a URL as the argument; there are a number of switches to control the behaviour (:option:`!-n` for a new browser window, :option:`!-t` for a new tab). New module-level functions, :func:`open_new` and :func:`open_new_tab`, were added to support this. The module's :func:`open` function supports an additional feature, an *autoraise* parameter that signals whether to raise the open window when possible. A number of additional browsers were added to the supported list such as Firefox, Opera, Konqueror, and elinks. (Contributed by Oleg Broytmann and Georg Brandl.)
pt_pt: O módulo :mod:`webbrowser` recebeu várias melhorias. Agora pode ser usado como um *script* com ``python -m webbrowser``, tomando uma URL como argumento; existem várias opções para controlar o comportamento (:option:`!-n` para uma nova janela do navegador, :option:`!-t` para um novo separador). Novas funções de nível de módulo, :func:`open_new` e :func:`open_new_tab`, foram adicionadas para suportar isto. A função :func:`open` do módulo suporta uma funcionalidade adicional, um parâmetro *autoraise* que sinaliza se deve elevar a janela aberta quando possível. Vários navegadores adicionais foram adicionados à lista suportada, como Firefox, Opera, Konqueror e elinks. (Contribuído por Oleg Broytmann e Georg Brandl.)
ru: Модуль :mod:`webbrowser` получил ряд улучшений. Теперь его можно использовать как скрипт с ``python -m webbrowser``, принимая URL-адрес в качестве аргумента; существует ряд переключателей для управления поведением (:option:`!-n` для нового окна браузера, :option:`!-t` для новой вкладки). Для поддержки этого были добавлены новые функции уровня модуля: :func:`open_new` и :func:`open_new_tab`. Функция :func:`open` модуля поддерживает дополнительную функцию — параметр *autoraise*, который сигнализирует, следует ли поднимать открытое окно, когда это возможно. В список поддерживаемых был добавлен ряд дополнительных браузеров, таких как Firefox, Opera, Konqueror и elinks. (Сообщили Олег Бройтманн и Георг Брандл.)

source: The :mod:`xmlrpclib <xmlrpc.client>` module now supports returning :class:`~datetime.datetime` objects for the XML-RPC date type. Supply ``use_datetime=True`` to the :func:`~xmlrpc.client.loads` function or the :class:`!Unmarshaller` class to enable this feature. (Contributed by Skip Montanaro.)
pt_pt: O módulo :mod:`xmlrpclib <xmlrpc.client>` agora suporta a devolução de objetos :class:`~datetime.datetime` para o tipo de data XML-RPC. Forneça ``use_datetime=True`` à função :func:`~xmlrpc.client.loads` ou à classe :class:`!Unmarshaller` para ativar esta funcionalidade. (Contribuído por Skip Montanaro.)
ru: Модуль :mod:`xmlrpclib <xmlrpc.client>` теперь поддерживает возврат объектов :class:`~datetime.datetime` для типа даты XML-RPC. Чтобы включить эту функцию, укажите ``use_datetime=True`` в функции :func:`~xmlrpc.client.loads` или в классе :class:`!Unmarshaller`. (Предоставлено Скипом Монтанаро.)

source: The :mod:`zipfile` module now supports the ZIP64 version of the format, meaning that a .zip archive can now be larger than 4 GiB and can contain individual files larger than 4 GiB. (Contributed by Ronald Oussoren.)
pt_pt: O módulo :mod:`zipfile` agora suporta a versão ZIP64 do formato, o que significa que um arquivo .zip pode agora ser maior do que 4 GiB e pode conter ficheiros individuais maiores do que 4 GiB. (Contribuído por Ronald Oussoren.)
ru: Модуль :mod:`zipfile` теперь поддерживает версию формата ZIP64, а это означает, что архив .zip теперь может иметь размер более 4 ГиБ и может содержать отдельные файлы размером более 4 ГиБ. (Предоставлено Рональдом Уссореном.)

source: The :mod:`zlib` module's :class:`Compress` and :class:`Decompress` objects now support a :meth:`copy` method that makes a copy of the object's internal state and returns a new :class:`Compress` or :class:`Decompress` object. (Contributed by Chris AtLee.)
pt_pt: Os objetos :class:`Compress` e :class:`Decompress` do módulo :mod:`zlib` agora suportam um método :meth:`copy` que faz uma cópia do estado interno do objeto e devolve um novo objeto :class:`Compress` ou :class:`Decompress`. (Contribuído por Chris AtLee.)
ru: Объекты :class:`Compress` и :class:`Decompress` модуля :mod:`zlib` теперь поддерживают метод :meth:`copy`, который создает копию внутреннего состояния объекта и возвращает новый :class:`Compress ` или :class:`Распаковать` объект. (Предоставлено Крисом ЭтЛи.)

source: The ctypes package
pt_pt: O pacote ctypes
ru: Пакет ctypes

source: The :mod:`ctypes` package, written by Thomas Heller, has been added to the standard library. :mod:`ctypes` lets you call arbitrary functions in shared libraries or DLLs. Long-time users may remember the :mod:`!dl` module, which provides functions for loading shared libraries and calling functions in them. The :mod:`ctypes` package is much fancier.
pt_pt: O pacote :mod:`ctypes`, escrito por Thomas Heller, foi adicionado à biblioteca padrão. :mod:`ctypes` permite chamar funções arbitrárias em bibliotecas partilhadas ou DLLs. Utilizadores de longa data podem lembrar-se do módulo :mod:`!dl`, que fornece funções para carregar bibliotecas partilhadas e chamar funções nelas. O pacote :mod:`ctypes` é muito mais sofisticado.
ru: Пакет :mod:`ctypes`, написанный Томасом Хеллером, был добавлен в стандартную библиотеку. :mod:`ctypes` позволяет вызывать произвольные функции в общих библиотеках или DLL. Опытные пользователи могут помнить модуль :mod:`!dl`, который предоставляет функции для загрузки общих библиотек и вызова функций в них. Пакет :mod:`ctypes` гораздо интереснее.

source: To load a shared library or DLL, you must create an instance of the :class:`CDLL` class and provide the name or path of the shared library or DLL. Once that's done, you can call arbitrary functions by accessing them as attributes of the :class:`CDLL` object. ::
pt_pt: Para carregar uma biblioteca partilhada ou DLL, deve criar uma instância da classe :class:`CDLL` e fornecer o nome ou caminho da biblioteca partilhada ou DLL. Uma vez feito isso, pode chamar funções arbitrárias acedendo-as como atributos do objeto :class:`CDLL`. ::
ru: Чтобы загрузить общую библиотеку или DLL, вы должны создать экземпляр класса :class:`CDLL` и указать имя или путь к общей библиотеке или DLL. Как только это будет сделано, вы сможете вызывать произвольные функции, обращаясь к ним как к атрибутам объекта :class:`CDLL`. ::

source: import ctypes libc = ctypes.CDLL('libc.so.6') result = libc.printf("Line of output\n")
pt_pt: import ctypes libc = ctypes.CDLL('libc.so.6') result = libc.printf("Linha de saída\n")

source: Type constructors for the various C types are provided: :func:`c_int`, :func:`c_float`, :func:`c_double`, :func:`c_char_p` (equivalent to :c:expr:`char \*`), and so forth. Unlike Python's types, the C versions are all mutable; you can assign to their :attr:`value` attribute to change the wrapped value. Python integers and strings will be automatically converted to the corresponding C types, but for other types you must call the correct type constructor. (And I mean *must*; getting it wrong will often result in the interpreter crashing with a segmentation fault.)
pt_pt: São fornecidos construtores de tipo para os vários tipos C: :func:`c_int`, :func:`c_float`, :func:`c_double`, :func:`c_char_p` (equivalente a :c:expr:`char \*`), e assim por diante. Ao contrário dos tipos Python, as versões C são todas mutáveis; pode atribuir ao seu atributo :attr:`value` para alterar o valor encapsulado. Inteiros e *strings* Python serão automaticamente convertidos para os tipos C correspondentes, mas para outros tipos deve chamar o construtor de tipo correto. (E quero dizer *deve*; errar frequentemente resultará no interpretador falhar com um erro de segmentação.)
ru: Предоставляются конструкторы типов для различных типов C: :func:`c_int`, :func:`c_float`, :func:`c_double`, :func:`c_char_p` (эквивалентно :c:expr:`char \*` ) и так далее. В отличие от типов Python, все версии C изменяемы; вы можете назначить их атрибуту :attr:`value`, чтобы изменить завернутое значение. Целые числа и строки Python будут автоматически преобразованы в соответствующие типы C, но для других типов необходимо вызвать правильный конструктор типов. (И я имею в виду *должен*; ошибка часто приводит к сбою интерпретатора из-за ошибки сегментации.)

source: You shouldn't use :func:`c_char_p` with a Python string when the C function will be modifying the memory area, because Python strings are supposed to be immutable; breaking this rule will cause puzzling bugs. When you need a modifiable memory area, use :func:`create_string_buffer`::
pt_pt: Não deve usar :func:`c_char_p` com uma *string* Python quando a função C irá modificar a área de memória, porque as *strings* Python são supostas ser imutáveis; violar esta regra causará *bugs* confusos. Quando precisar de uma área de memória modificável, use :func:`create_string_buffer`::
ru: Не следует использовать :func:`c_char_p` со строкой Python, когда функция C будет изменять область памяти, поскольку строки Python должны быть неизменяемыми; нарушение этого правила приведет к загадочным ошибкам. Если вам нужна изменяемая область памяти, используйте :func:`create_string_buffer`::

source: s = "this is a string" buf = ctypes.create_string_buffer(s) libc.strfry(buf)
pt_pt: s = "esta é uma string" buf = ctypes.create_string_buffer(s) libc.strfry(buf)

source: C functions are assumed to return integers, but you can set the :attr:`restype` attribute of the function object to change this::
pt_pt: As funções C são assumidas como devolvendo inteiros, mas pode definir o atributo :attr:`restype` do objeto função para alterar isto::
ru: Предполагается, что функции C возвращают целые числа, но вы можете установить атрибут :attr:`restype` объекта функции, чтобы изменить это:

source: :mod:`ctypes` also provides a wrapper for Python's C API as the ``ctypes.pythonapi`` object. This object does *not* release the global interpreter lock before calling a function, because the lock must be held when calling into the interpreter's code. There's a :class:`~ctypes.py_object` type constructor that will create a :c:expr:`PyObject *` pointer. A simple usage::
pt_pt: :mod:`ctypes` também fornece um *wrapper* para a API C do Python como o objeto ``ctypes.pythonapi``. Este objeto *não* libera o bloqueio global do interpretador antes de chamar uma função, porque o bloqueio deve ser mantido ao chamar o código do interpretador. Existe um construtor de tipo :class:`~ctypes.py_object` que criará um ponteiro :c:expr:`PyObject *`. Um uso simples::

source: import ctypes d = {} ctypes.pythonapi.PyObject_SetItem(ctypes.py_object(d), ctypes.py_object("abc"), ctypes.py_object(1)) # d is now {'abc', 1}.
pt_pt: import ctypes d = {} ctypes.pythonapi.PyObject_SetItem(ctypes.py_object(d), ctypes.py_object("abc"), ctypes.py_object(1)) # d é agora {'abc': 1}.
