Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: Some simple dependency support was added to Distutils. The :func:`setup` function now has ``requires``, ``provides``, and ``obsoletes`` keyword parameters. When you build a source distribution using the ``sdist`` command, the dependency information will be recorded in the :file:`PKG-INFO` file.
pt_pt: Foi adicionado um suporte simples de dependências ao Distutils. A função :func:`setup` tem agora os parâmetros nomeados ``requires``, ``provides`` e ``obsoletes``. Quando constrói uma distribuição de origem usando o comando ``sdist``, a informação de dependência será registada no ficheiro :file:`PKG-INFO`.
ru: В Distutils была добавлена ​​​​некоторая простая поддержка зависимостей. Функция :func:`setup` теперь имеет ключевые параметры ``requires``, ``provides`` и ``obsoletes``. Когда вы собираете исходный дистрибутив с помощью команды sdist, информация о зависимостях будет записана в файле :file:`PKG-INFO`.

source: Another new keyword parameter is ``download_url``, which should be set to a URL for the package's source code. This means it's now possible to look up an entry in the package index, determine the dependencies for a package, and download the required packages. ::
pt_pt: Outro novo parâmetro nomeado é ``download_url``, que deve ser definido para um URL para o código-fonte do pacote. Isto significa que é agora possível procurar uma entrada no índice de pacotes, determinar as dependências de um pacote e descarregar os pacotes necessários. ::
ru: Еще один новый параметр ключевого слова — «download_url», для которого должен быть установлен URL-адрес исходного кода пакета. Это означает, что теперь можно найти запись в индексе пакета, определить зависимости пакета и загрузить необходимые пакеты. ::

source: Another new enhancement to the Python package index at https://pypi.org is storing source and binary archives for a package. The new :command:`upload` Distutils command will upload a package to the repository.
pt_pt: Outra nova melhoria no índice de pacotes Python em https://pypi.org é o armazenamento de arquivos de origem e binários para um pacote. O novo comando :command:`upload` do Distutils enviará um pacote para o repositório.
ru: Еще одно новое усовершенствование индекса пакетов Python на https://pypi.org — сохранение исходных и двоичных архивов пакета. Новая команда Distutils :command:`upload` загрузит пакет в репозиторий.

source: Before a package can be uploaded, you must be able to build a distribution using the :command:`sdist` Distutils command. Once that works, you can run ``python setup.py upload`` to add your package to the PyPI archive. Optionally you can GPG-sign the package by supplying the :option:`!--sign` and :option:`!--identity` options.
pt_pt: Antes de um pacote poder ser enviado, deve ser capaz de construir uma distribuição usando o comando :command:`sdist` do Distutils. Assim que isso funcionar, pode executar ``python setup.py upload`` para adicionar o seu pacote ao arquivo PyPI. Opcionalmente, pode assinar o pacote com GPG fornecendo as opções :option:`!--sign` e :option:`!--identity`.
ru: Прежде чем пакет можно будет загрузить, вы должны иметь возможность собрать дистрибутив с помощью команды :command:`sdist` Distutils. Как только это сработает, вы можете запустить ``python setup.py upload``, чтобы добавить свой пакет в архив PyPI. При желании вы можете подписать пакет GPG, указав параметры :option:`!--sign` и :option:`!--identity`.

source: Package uploading was implemented by Martin von Löwis and Richard Jones.
pt_pt: O envio de pacotes foi implementado por Martin von Löwis e Richard Jones.
ru: Загрузку пакетов осуществили Мартин фон Лёвис и Ричард Джонс.

source: :pep:`314` - Metadata for Python Software Packages v1.1
pt_pt: :pep:`314` - Metadados para Pacotes de Software Python v1.1
ru: :pep:`314` - Метаданные для пакетов программного обеспечения Python v1.1

source: PEP proposed and written by A.M. Kuchling, Richard Jones, and Fred Drake; implemented by Richard Jones and Fred Drake.
pt_pt: PEP proposta e escrita por A.M. Kuchling, Richard Jones e Fred Drake; implementada por Richard Jones e Fred Drake.
ru: PEP предложен и написан А. М. Кучлингом, Ричардом Джонсом и Фредом Дрейком; реализован Ричардом Джонсом и Фредом Дрейком.

source: PEP 328: Absolute and Relative Imports
pt_pt: PEP 328: Importações Absolutas e Relativas
ru: PEP 328: Абсолютный и относительный импорт

source: The simpler part of :pep:`328` was implemented in Python 2.4: parentheses could now be used to enclose the names imported from a module using the ``from ... import ...`` statement, making it easier to import many different names.
pt_pt: A parte mais simples da :pep:`328` foi implementada no Python 2.4: parênteses podiam agora ser usados para envolver os nomes importados de um módulo usando a instrução ``from ... import ...``, tornando mais fácil importar muitos nomes diferentes.
ru: Более простая часть :pep:`328` была реализована в Python 2.4: круглые скобки теперь можно было использовать для заключения имён, импортированных из модуля, с помощью оператора ``from ... import ...``, что упростило импорт. много разных названий.

source: The more complicated part has been implemented in Python 2.5: importing a module can be specified to use absolute or package-relative imports. The plan is to move toward making absolute imports the default in future versions of Python.
pt_pt: A parte mais complicada foi implementada no Python 2.5: a importação de um módulo pode ser especificada para usar importações absolutas ou relativas ao pacote. O plano é avançar para tornar as importações absolutas o padrão em futuras versões do Python.
ru: Более сложная часть была реализована в Python 2.5: при импорте модуля можно указать использование абсолютного или относительного импорта. План состоит в том, чтобы сделать абсолютный импорт по умолчанию в будущих версиях Python.

source: Let's say you have a package directory like this::
pt_pt: Suponha que tem um diretório de pacote como este::
ru: Допустим, у вас есть такой каталог пакета:

source: This defines a package named :mod:`pkg` containing the :mod:`pkg.main` and :mod:`pkg.string` submodules.
pt_pt: Isto define um pacote chamado :mod:`pkg` contendo os submódulos :mod:`pkg.main` e :mod:`pkg.string`.
ru: Здесь определяется пакет с именем :mod:`pkg`, содержащий подмодули :mod:`pkg.main` и :mod:`pkg.string`.

source: Consider the code in the :file:`main.py` module. What happens if it executes the statement ``import string``? In Python 2.4 and earlier, it will first look in the package's directory to perform a relative import, finds :file:`pkg/string.py`, imports the contents of that file as the :mod:`pkg.string` module, and that module is bound to the name ``string`` in the :mod:`pkg.main` module's namespace.
pt_pt: Considere o código no módulo :file:`main.py`. O que acontece se executar a instrução ``import string``? No Python 2.4 e anteriores, ele procurará primeiro no diretório do pacote para realizar uma importação relativa, encontrará :file:`pkg/string.py`, importará o conteúdo desse ficheiro como o módulo :mod:`pkg.string`, e esse módulo será ligado ao nome ``string`` no espaço de nomes do módulo :mod:`pkg.main`.
ru: Рассмотрим код в модуле :file:`main.py`. Что произойдет, если он выполнит оператор ``import string``? В Python 2.4 и более ранних версиях он сначала просматривает каталог пакета для выполнения относительного импорта, находит :file:`pkg/string.py`, импортирует содержимое этого файла как модуль :mod:`pkg.string`, и этот модуль привязан к имени ``string`` в пространстве имен модуля :mod:`pkg.main`.

source: That's fine if :mod:`pkg.string` was what you wanted. But what if you wanted Python's standard :mod:`string` module? There's no clean way to ignore :mod:`pkg.string` and look for the standard module; generally you had to look at the contents of ``sys.modules``, which is slightly unclean. Holger Krekel's :mod:`py.std` package provides a tidier way to perform imports from the standard library, ``import py; py.std.string.join()``, but that package isn't available on all Python installations.
pt_pt: Isso está bem se :mod:`pkg.string` era o que queria. Mas e se quisesse o módulo :mod:`string` padrão do Python? Não há uma forma limpa de ignorar :mod:`pkg.string` e procurar o módulo padrão; geralmente tinha de ver o conteúdo de ``sys.modules``, o que é ligeiramente deselegante. O pacote :mod:`py.std` de Holger Krekel fornece uma forma mais organizada de realizar importações da biblioteca padrão, ``import py; py.std.string.join()``, mas esse pacote não está disponível em todas as instalações do Python.
ru: Это нормально, если вам нужен :mod:`pkg.string`. Но что, если вам нужен стандартный модуль Python :mod:`string`? Не существует чистого способа игнорировать :mod:`pkg.string` и искать стандартный модуль; обычно вам приходилось смотреть содержимое ``sys.modules``, которое немного нечисто. Пакет :mod:`py.std` Хольгера Крекеля предоставляет более удобный способ импорта из стандартной библиотеки ``import py; py.std.string.join()``, но этот пакет доступен не во всех установках Python.

source: Reading code which relies on relative imports is also less clear, because a reader may be confused about which module, :mod:`string` or :mod:`pkg.string`, is intended to be used. Python users soon learned not to duplicate the names of standard library modules in the names of their packages' submodules, but you can't protect against having your submodule's name being used for a new module added in a future version of Python.
pt_pt: A leitura de código que depende de importações relativas também é menos clara, porque um leitor pode ficar confuso sobre qual módulo, :mod:`string` ou :mod:`pkg.string`, é pretendido ser usado. Os utilizadores do Python aprenderam rapidamente a não duplicar os nomes dos módulos da biblioteca padrão nos nomes dos submódulos dos seus pacotes, mas não pode proteger-se contra o nome do seu submódulo ser usado para um novo módulo adicionado numa futura versão do Python.
ru: Чтение кода, основанного на относительном импорте, также менее понятно, поскольку читатель может запутаться в том, какой модуль, :mod:`string` или :mod:`pkg.string`, предназначен для использования. Пользователи Python вскоре научились не дублировать имена модулей стандартной библиотеки в именах подмодулей своих пакетов, но вы не можете защититься от использования имени вашего подмодуля для нового модуля, добавленного в будущей версии Python.

source: In Python 2.5, you can switch :keyword:`import`'s behaviour to absolute imports using a ``from __future__ import absolute_import`` directive. This absolute-import behaviour will become the default in a future version (probably Python 2.7). Once absolute imports are the default, ``import string`` will always find the standard library's version. It's suggested that users should begin using absolute imports as much as possible, so it's preferable to begin writing ``from pkg import string`` in your code.
pt_pt: No Python 2.5, pode alterar o comportamento de :keyword:`import` para importações absolutas usando uma diretiva ``from __future__ import absolute_import``. Este comportamento de importação absoluta tornar-se-á o predefinido numa futura versão (provavelmente Python 2.7). Assim que as importações absolutas forem o predefinido, ``import string`` encontrará sempre a versão da biblioteca padrão. É sugerido que os utilizadores comecem a usar importações absolutas tanto quanto possível, pelo que é preferível começar a escrever ``from pkg import string`` no seu código.
ru: В Python 2.5 вы можете переключить поведение :keyword:`import` на абсолютный импорт, используя директиву ``from __future__ import Absolute_import``. Такое поведение абсолютного импорта станет поведением по умолчанию в будущей версии (вероятно, Python 2.7). Как только абсолютный импорт станет значением по умолчанию, ``строка импорта`` всегда будет находить версию стандартной библиотеки. Предполагается, что пользователям следует как можно чаще использовать абсолютный импорт, поэтому предпочтительнее начать писать в коде ``из строки импорта pkg``.

source: Relative imports are still possible by adding a leading period to the module name when using the ``from ... import`` form::
pt_pt: As importações relativas ainda são possíveis adicionando um ponto inicial ao nome do módulo quando se usa a forma ``from ... import``::
ru: Относительный импорт по-прежнему возможен путем добавления точки к имени модуля при использовании формы ``from ... import``::

source: # Import names from pkg.string from .string import name1, name2 # Import pkg.string from . import string
pt_pt: # Importar nomes de pkg.string from .string import name1, name2 # Importar pkg.string from . import string

source: This imports the :mod:`string` module relative to the current package, so in :mod:`pkg.main` this will import *name1* and *name2* from :mod:`pkg.string`. Additional leading periods perform the relative import starting from the parent of the current package. For example, code in the :mod:`A.B.C` module can do::
pt_pt: Isto importa o módulo :mod:`string` relativo ao pacote atual, pelo que em :mod:`pkg.main` isto importará *name1* e *name2* de :mod:`pkg.string`. Pontos iniciais adicionais realizam a importação relativa a partir do pai do pacote atual. Por exemplo, o código no módulo :mod:`A.B.C` pode fazer::
ru: При этом модуль :mod:`string` импортируется относительно текущего пакета, поэтому в :mod:`pkg.main` будут импортированы *name1* и *name2* из :mod:`pkg.string`. Дополнительные ведущие периоды выполняют относительный импорт, начиная с родительского элемента текущего пакета. Например, код в модуле :mod:`ABC` может выполнять::

source: from . import D # Imports A.B.D from .. import E # Imports A.E from ..F import G # Imports A.F.G
pt_pt: from . import D # Importa A.B.D from .. import E # Importa A.E from ..F import G # Importa A.F.G

source: Leading periods cannot be used with the ``import modname`` form of the import statement, only the ``from ... import`` form.
pt_pt: Pontos iniciais não podem ser usados com a forma ``import modname`` da instrução de importação, apenas com a forma ``from ... import``.
ru: Начальные точки не могут использоваться с формой ``import modname`` оператора импорта, только с формой ``from ... import``.

source: :pep:`328` - Imports: Multi-Line and Absolute/Relative
pt_pt: :pep:`328` - Importações: Multi-linha e Absolutas/Relativas
ru: :pep:`328` - Импорт: многострочный и абсолютный/относительный

source: PEP written by Aahz; implemented by Thomas Wouters.
pt_pt: PEP escrita por Aahz; implementada por Thomas Wouters.
ru: PEP, написанный Аазом; реализован Томасом Воутерсом.

source: The py library by Holger Krekel, which contains the :mod:`py.std` package.
pt_pt: A biblioteca py de Holger Krekel, que contém o pacote :mod:`py.std`.
ru: Библиотека py от Хольгера Крекеля, содержащая пакет :mod:`py.std`.

source: PEP 338: Executing Modules as Scripts
pt_pt: PEP 338: Execução de Módulos como *Scripts*
ru: PEP 338: выполнение модулей как сценариев

source: The :option:`-m` switch added in Python 2.4 to execute a module as a script gained a few more abilities. Instead of being implemented in C code inside the Python interpreter, the switch now uses an implementation in a new module, :mod:`runpy`.
pt_pt: A opção :option:`-m` adicionada no Python 2.4 para executar um módulo como um *script* ganhou algumas capacidades adicionais. Em vez de ser implementada em código C dentro do interpretador Python, a opção agora usa uma implementação num novo módulo, :mod:`runpy`.
ru: Переключатель :option:`-m`, добавленный в Python 2.4 для выполнения модуля как скрипта, получил еще несколько возможностей. Вместо того, чтобы быть реализованным в коде C внутри интерпретатора Python, переключатель теперь использует реализацию в новом модуле :mod:`runpy`.

source: The :mod:`runpy` module implements a more sophisticated import mechanism so that it's now possible to run modules in a package such as :mod:`pychecker.checker`. The module also supports alternative import mechanisms such as the :mod:`zipimport` module. This means you can add a .zip archive's path to ``sys.path`` and then use the :option:`-m` switch to execute code from the archive.
pt_pt: O módulo :mod:`runpy` implementa um mecanismo de importação mais sofisticado, pelo que é agora possível executar módulos num pacote como :mod:`pychecker.checker`. O módulo também suporta mecanismos de importação alternativos, como o módulo :mod:`zipimport`. Isto significa que pode adicionar o caminho de um arquivo .zip a ``sys.path`` e depois usar a opção :option:`-m` para executar código do arquivo.
ru: Модуль :mod:`runpy` реализует более сложный механизм импорта, так что теперь можно запускать модули в пакете, например :mod:`pychecker.checker`. Модуль также поддерживает альтернативные механизмы импорта, такие как модуль :mod:`zipimport`. Это означает, что вы можете добавить путь к .zip-архиву в ``sys.path``, а затем использовать ключ :option:`-m` для выполнения кода из архива.

source: :pep:`338` - Executing modules as scripts
pt_pt: :pep:`338` - Execução de módulos como *scripts*
ru: :pep:`338` - Выполнение модулей как скриптов

source: PEP written and implemented by Nick Coghlan.
pt_pt: PEP escrita e implementada por Nick Coghlan.
ru: PEP написан и реализован Ником Когланом.

source: PEP 341: Unified try/except/finally
pt_pt: PEP 341: *try/except/finally* Unificado
ru: PEP 341: унифицированная попытка/исключение/наконец

source: Until Python 2.5, the :keyword:`try` statement came in two flavours. You could use a :keyword:`finally` block to ensure that code is always executed, or one or more :keyword:`except` blocks to catch specific exceptions. You couldn't combine both :keyword:`!except` blocks and a :keyword:`!finally` block, because generating the right bytecode for the combined version was complicated and it wasn't clear what the semantics of the combined statement should be.
pt_pt: Até ao Python 2.5, a instrução :keyword:`try` vinha em duas variantes. Podia usar um bloco :keyword:`finally` para garantir que o código era sempre executado, ou um ou mais blocos :keyword:`except` para capturar exceções específicas. Não podia combinar blocos :keyword:`!except` e um bloco :keyword:`!finally`, porque gerar o *bytecode* correto para a versão combinada era complicado e não estava claro qual deveria ser a semântica da instrução combinada.
ru: До Python 2.5 оператор :keyword:`try` существовал в двух вариантах. Вы можете использовать блок :keyword:`finally`, чтобы гарантировать, что код всегда выполняется, или один или несколько блоков :keyword:`Exception`, чтобы перехватывать определенные исключения. Вы не могли объединить оба блока :keyword:`!кроме` и блок :keyword:`!finally`, потому что генерация правильного байт-кода для объединенной версии была сложной, и было неясно, какова должна быть семантика объединенного оператора. быть.

source: Guido van Rossum spent some time working with Java, which does support the equivalent of combining :keyword:`except` blocks and a :keyword:`finally` block, and this clarified what the statement should mean. In Python 2.5, you can now write::
pt_pt: Guido van Rossum passou algum tempo a trabalhar com Java, que suporta o equivalente a combinar blocos :keyword:`except` e um bloco :keyword:`finally`, e isto esclareceu o que a instrução deveria significar. No Python 2.5, pode agora escrever::
ru: Гвидо ван Россум некоторое время работал с Java, которая поддерживает эквивалент объединения блоков :keyword:`кроме` и блока :keyword:`finally`, и это прояснило, что должно означать это утверждение. В Python 2.5 теперь можно писать::

source: The code in *block-1* is executed. If the code raises an exception, the various :keyword:`except` blocks are tested: if the exception is of class :class:`Exception1`, *handler-1* is executed; otherwise if it's of class :class:`Exception2`, *handler-2* is executed, and so forth. If no exception is raised, the *else-block* is executed.
pt_pt: O código em *block-1* é executado. Se o código gerar uma exceção, os vários blocos :keyword:`except` são testados: se a exceção for da classe :class:`Exception1`, *handler-1* é executado; caso contrário, se for da classe :class:`Exception2`, *handler-2* é executado, e assim por diante. Se nenhuma exceção for gerada, o *else-block* é executado.
ru: Код в *блоке-1* выполняется. Если код вызывает исключение, проверяются различные блоки :keyword:`Exception`: если исключение относится к классу :class:`Exception1`, выполняется *handler-1*; в противном случае, если он принадлежит к классу :class:`Exception2`, выполняется *handler-2* и так далее. Если исключение не возникает, выполняется *else-block*.

source: No matter what happened previously, the *final-block* is executed once the code block is complete and any raised exceptions handled. Even if there's an error in an exception handler or the *else-block* and a new exception is raised, the code in the *final-block* is still run.
pt_pt: Independentemente do que tenha acontecido anteriormente, o *final-block* é executado assim que o bloco de código estiver completo e quaisquer exceções geradas forem tratadas. Mesmo que haja um erro num manipulador de exceções ou no *else-block* e uma nova exceção seja gerada, o código no *final-block* ainda é executado.
ru: Независимо от того, что произошло ранее, *final-block* выполняется после завершения блока кода и обработки всех возникших исключений. Даже если в обработчике исключений или *else-блоке* возникла ошибка и возникло новое исключение, код в *final-block* все равно выполняется.

source: :pep:`341` - Unifying try-except and try-finally
pt_pt: :pep:`341` - Unificação de *try-except* e *try-finally*
ru: :pep:`341` - Объединение try-кроме и try-finally

source: PEP written by Georg Brandl; implementation by Thomas Lee.
pt_pt: PEP escrita por Georg Brandl; implementação por Thomas Lee.
ru: PEP, написанный Георгом Брандлом; реализация Томаса Ли.

source: PEP 342: New Generator Features
pt_pt: PEP 342: Novas Funcionalidades de Geradores
ru: PEP 342: Новые возможности генератора
