Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: What's New in Python 2.5
pt_pt: Novidades no Python 2.5
ru: Что нового в Python 2.5

source: Author
pt_pt: Autor
ru: Автор

source: This article explains the new features in Python 2.5. The final release of Python 2.5 is scheduled for August 2006; :pep:`356` describes the planned release schedule. Python 2.5 was released on September 19, 2006.
pt_pt: Este artigo explica as novas funcionalidades do Python 2.5. A versão final do Python 2.5 estava prevista para agosto de 2006; a :pep:`356` descreve o cronograma de lançamento planeado. O Python 2.5 foi lançado a 19 de setembro de 2006.
ru: В этой статье объясняются новые возможности Python 2.5. Окончательный выпуск Python 2.5 запланирован на август 2006 г.; :pep:`356` описывает запланированный график выпуска. Python 2.5 был выпущен 19 сентября 2006 года.

source: The changes in Python 2.5 are an interesting mix of language and library improvements. The library enhancements will be more important to Python's user community, I think, because several widely useful packages were added. New modules include ElementTree for XML processing (:mod:`xml.etree`), the SQLite database module (:mod:`sqlite`), and the :mod:`ctypes` module for calling C functions.
pt_pt: As alterações no Python 2.5 são uma mistura interessante de melhorias na linguagem e na biblioteca. Acho que as melhorias na biblioteca serão mais importantes para a comunidade de utilizadores do Python, porque vários pacotes amplamente úteis foram adicionados. Novos módulos incluem o ElementTree para processamento de XML (:mod:`xml.etree`), o módulo de base de dados SQLite (:mod:`sqlite`), e o módulo :mod:`ctypes` para chamar funções C.
ru: Изменения в Python 2.5 представляют собой интересное сочетание улучшений языка и библиотек. Я думаю, что улучшения библиотеки будут более важны для сообщества пользователей Python, поскольку было добавлено несколько очень полезных пакетов. Новые модули включают ElementTree для обработки XML (:mod:`xml.etree`), модуль базы данных SQLite (:mod:`sqlite`) и модуль :mod:`ctypes` для вызова функций C.

source: The language changes are of middling significance. Some pleasant new features were added, but most of them aren't features that you'll use every day. Conditional expressions were finally added to the language using a novel syntax; see section :ref:`pep-308`. The new ':keyword:`with`' statement will make writing cleanup code easier (section :ref:`pep-343`). Values can now be passed into generators (section :ref:`pep-342`). Imports are now visible as either absolute or relative (section :ref:`pep-328`). Some corner cases of exception handling are handled better (section :ref:`pep-341`). All these improvements are worthwhile, but they're improvements to one specific language feature or another; none of them are broad modifications to Python's semantics.
pt_pt: As alterações na linguagem são de importância média. Algumas novas funcionalidades agradáveis foram adicionadas, mas a maioria não são funcionalidades que usará todos os dias. Expressões condicionais foram finalmente adicionadas à linguagem usando uma sintaxe nova; veja a secção :ref:`pep-308`. A nova instrução ':keyword:`with`' tornará mais fácil a escrita de código de limpeza (secção :ref:`pep-343`). Valores podem agora ser passados para geradores (secção :ref:`pep-342`). As importações são agora visíveis como absolutas ou relativas (secção :ref:`pep-328`). Alguns casos especiais de tratamento de exceções são agora melhor tratados (secção :ref:`pep-341`). Todas estas melhorias são valiosas, mas são melhorias em funcionalidades específicas da linguagem; nenhuma delas são modificações amplas na semântica do Python.
ru: Языковые изменения имеют среднее значение. Было добавлено несколько приятных новых функций, но большинство из них не являются функциями, которыми вы будете пользоваться каждый день. Условные выражения были наконец добавлены в язык с использованием нового синтаксиса; см. раздел :ref:`pep-308`. Новый оператор ':keyword:`with`' упростит написание кода очистки (раздел :ref:`pep-343`). Значения теперь можно передавать в генераторы (раздел :ref:`pep-342`). Импорт теперь отображается как абсолютный или относительный (раздел :ref:`pep-328`). Некоторые крайние случаи обработки исключений обрабатываются лучше (раздел :ref:`pep-341`). Все эти улучшения заслуживают внимания, но они представляют собой улучшения той или иной конкретной функции языка; ни один из них не является широкой модификацией семантики Python.

source: As well as the language and library additions, other improvements and bugfixes were made throughout the source tree. A search through the SVN change logs finds there were 353 patches applied and 458 bugs fixed between Python 2.4 and 2.5. (Both figures are likely to be underestimates.)
pt_pt: Além das adições à linguagem e à biblioteca, outras melhorias e correções de *bugs* foram feitas em toda a árvore de origem. Uma pesquisa nos registos de alterações do SVN mostra que foram aplicadas 353 correções e corrigidos 458 *bugs* entre o Python 2.4 e o 2.5. (Ambos os números são provavelmente subestimados.)
ru: Помимо дополнений к языку и библиотекам, во всем дереве исходного кода были внесены другие улучшения и исправления. Поиск в журналах изменений SVN обнаружил, что между Python 2.4 и 2.5 было применено 353 исправления и исправлено 458 ошибок. (Обе цифры, вероятно, занижены.)

source: This article doesn't try to be a complete specification of the new features; instead changes are briefly introduced using helpful examples. For full details, you should always refer to the documentation for Python 2.5 at https://docs.python.org. If you want to understand the complete implementation and design rationale, refer to the PEP for a particular new feature.
pt_pt: Este artigo não tenta ser uma especificação completa das novas funcionalidades; em vez disso, as alterações são brevemente introduzidas usando exemplos úteis. Para detalhes completos, deve sempre consultar a documentação do Python 2.5 em https://docs.python.org. Se quiser entender a implementação completa e a racionalidade do design, consulte a PEP de uma funcionalidade nova específica.
ru: Эта статья не претендует на полное описание новых функций; вместо этого изменения кратко представлены с использованием полезных примеров. Для получения полной информации всегда обращайтесь к документации Python 2.5 по адресу https://docs.python.org. Если вы хотите понять полное обоснование реализации и дизайна, обратитесь к PEP за конкретной новой функцией.

source: Comments, suggestions, and error reports for this document are welcome; please e-mail them to the author or open a bug in the Python bug tracker.
pt_pt: Comentários, sugestões e relatórios de erros para este documento são bem-vindos; por favor envie-os por e-mail ao autor ou abra um *bug* no *bug tracker* do Python.
ru: Комментарии, предложения и отчеты об ошибках к этому документу приветствуются; пожалуйста, отправьте их по электронной почте автору или откройте ошибку в системе отслеживания ошибок Python.

source: PEP 308: Conditional Expressions
pt_pt: PEP 308: Expressões Condicionais
ru: PEP 308: Условные выражения

source: For a long time, people have been requesting a way to write conditional expressions, which are expressions that return value A or value B depending on whether a Boolean value is true or false. A conditional expression lets you write a single assignment statement that has the same effect as the following::
pt_pt: Há muito tempo que as pessoas têm vindo a pedir uma forma de escrever expressões condicionais, que são expressões que devolvem o valor A ou o valor B dependendo se um valor booleano é verdadeiro ou falso. Uma expressão condicional permite-lhe escrever uma única instrução de atribuição que tem o mesmo efeito que o seguinte::
ru: В течение долгого времени люди искали способ написания условных выражений, которые возвращают значение A или значение B в зависимости от того, является ли логическое значение истинным или ложным. Условное выражение позволяет вам написать один оператор присваивания, который имеет тот же эффект, что и следующий:

source: There have been endless tedious discussions of syntax on both python-dev and comp.lang.python. A vote was even held that found the majority of voters wanted conditional expressions in some form, but there was no syntax that was preferred by a clear majority. Candidates included C's ``cond ? true_v : false_v``, ``if cond then true_v else false_v``, and 16 other variations.
pt_pt: Houve discussões intermináveis e tediosas sobre sintaxe tanto no python-dev como no comp.lang.python. Foi até realizada uma votação que descobriu que a maioria dos votantes queria expressões condicionais de alguma forma, mas não havia uma sintaxe preferida por uma maioria clara. Os candidatos incluíam o ``cond ? true_v : false_v`` do C, ``if cond then true_v else false_v``, e 16 outras variações.
ru: Были бесконечные утомительные дискуссии о синтаксисе как на python-dev, так и на comp.lang.python. Было даже проведено голосование, которое показало, что большинство избирателей хотели бы использовать условные выражения в той или иной форме, но не было синтаксиса, который предпочитал бы явное большинство. Кандидаты включали `` cond ? true_v : false_v``, ``if cond then true_v else false_v`` и 16 других вариантов.

source: Guido van Rossum eventually chose a surprising syntax::
pt_pt: Guido van Rossum acabou por escolher uma sintaxe surpreendente::
ru: Гвидо ван Россум в итоге выбрал удивительный синтаксис:

source: Evaluation is still lazy as in existing Boolean expressions, so the order of evaluation jumps around a bit. The *condition* expression in the middle is evaluated first, and the *true_value* expression is evaluated only if the condition was true. Similarly, the *false_value* expression is only evaluated when the condition is false.
pt_pt: A avaliação continua a ser preguiçosa como nas expressões booleanas existentes, pelo que a ordem de avaliação muda um pouco. A expressão *condition* no meio é avaliada primeiro, e a expressão *true_value* é avaliada apenas se a condição for verdadeira. Da mesma forma, a expressão *false_value* é avaliada apenas quando a condição é falsa.
ru: Вычисление по-прежнему ленивое, как и в существующих логических выражениях, поэтому порядок вычислений немного меняется. Выражение *condition* в середине вычисляется первым, а выражение *true_value* оценивается только в том случае, если условие было истинным. Аналогично, выражение *false_value* оценивается только тогда, когда условие ложно.

source: This syntax may seem strange and backwards; why does the condition go in the *middle* of the expression, and not in the front as in C's ``c ? x : y``? The decision was checked by applying the new syntax to the modules in the standard library and seeing how the resulting code read. In many cases where a conditional expression is used, one value seems to be the 'common case' and one value is an 'exceptional case', used only on rarer occasions when the condition isn't met. The conditional syntax makes this pattern a bit more obvious::
pt_pt: Esta sintaxe pode parecer estranha e invertida; porque é que a condição vai no *meio* da expressão, e não na frente como no ``c ? x : y`` do C? A decisão foi verificada aplicando a nova sintaxe aos módulos da biblioteca padrão e vendo como o código resultante se lia. Em muitos casos onde uma expressão condicional é usada, um valor parece ser o 'caso comum' e outro valor é um 'caso excepcional', usado apenas em ocasiões mais raras quando a condição não é cumprida. A sintaxe condicional torna este padrão um pouco mais óbvio::
ru: Этот синтаксис может показаться странным и устаревшим; почему условие находится в *середине* выражения, а не в начале, как в C ``c ? х: у``? Решение было проверено путем применения нового синтаксиса к модулям стандартной библиотеки и просмотра того, как читается полученный код. Во многих случаях, когда используется условное выражение, одно значение кажется «общим случаем», а другое значение — «исключительным случаем», используемым только в более редких случаях, когда условие не выполняется. Условный синтаксис делает этот шаблон более очевидным:

source: I read the above statement as meaning "here *contents* is usually assigned a value of ``doc+'\n'``; sometimes *doc* is empty, in which special case an empty string is returned." I doubt I will use conditional expressions very often where there isn't a clear common and uncommon case.
pt_pt: Eu leio a instrução acima como significando "aqui *contents* é normalmente atribuído um valor de ``doc+'\n'``; às vezes *doc* está vazio, nesse caso especial uma string vazia é devolvida." Duvido que usarei expressões condicionais com muita frequência onde não haja um caso comum e um caso incomum claros.
ru: Я прочитал приведенное выше утверждение как означающее: «здесь *contents* обычно присваивается значение ``doc+'\n'``; иногда *doc* пусто, и в этом особом случае возвращается пустая строка». Сомневаюсь, что буду часто использовать условные выражения там, где нет четкого определения общего и необычного случая.

source: There was some discussion of whether the language should require surrounding conditional expressions with parentheses. The decision was made to *not* require parentheses in the Python language's grammar, but as a matter of style I think you should always use them. Consider these two statements::
pt_pt: Houve alguma discussão sobre se a linguagem deveria exigir que as expressões condicionais fossem rodeadas por parênteses. A decisão foi não exigir parênteses na gramática da linguagem Python, mas como questão de estilo, acho que deve sempre usá-los. Considere estas duas instruções::
ru: Была некоторая дискуссия о том, должен ли язык требовать заключения условных выражений в круглые скобки. Было принято решение *не* требовать скобок в грамматике языка Python, но из соображений стиля, я думаю, вам следует всегда их использовать. Рассмотрим эти два утверждения:

source: # First version -- no parens level = 1 if logging else 0 # Second version -- with parens level = (1 if logging else 0)
pt_pt: # Primeira versão -- sem parênteses level = 1 if logging else 0 # Segunda versão -- com parênteses level = (1 if logging else 0)

source: In the first version, I think a reader's eye might group the statement into 'level = 1', 'if logging', 'else 0', and think that the condition decides whether the assignment to *level* is performed. The second version reads better, in my opinion, because it makes it clear that the assignment is always performed and the choice is being made between two values.
pt_pt: Na primeira versão, acho que o olho do leitor pode agrupar a instrução em 'level = 1', 'if logging', 'else 0', e pensar que a condição decide se a atribuição a *level* é realizada. A segunda versão lê-se melhor, na minha opinião, porque torna claro que a atribuição é sempre realizada e que a escolha está a ser feita entre dois valores.
ru: Я думаю, что в первой версии читатель может сгруппировать операторы в «уровень = 1», «если ведение журнала», «иначе 0» и подумать, что условие определяет, будет ли выполняться присвоение *уровню*. Вторая версия, на мой взгляд, читается лучше, поскольку ясно дает понять, что присваивание всегда выполняется и выбор осуществляется между двумя значениями.

source: Another reason for including the brackets: a few odd combinations of list comprehensions and lambdas could look like incorrect conditional expressions. See :pep:`308` for some examples. If you put parentheses around your conditional expressions, you won't run into this case.
pt_pt: Outra razão para incluir os parênteses: algumas combinações estranhas de *list comprehensions* e *lambdas* podem parecer expressões condicionais incorretas. Veja a :pep:`308` para alguns exemplos. Se colocar parênteses à volta das suas expressões condicionais, não encontrará este caso.
ru: Еще одна причина включения скобок: несколько странных комбинаций списков и лямбда-выражений могут выглядеть как неправильные условные выражения. См. некоторые примеры в :pep:`308`. Если вы заключите условные выражения в круглые скобки, вы не столкнетесь с этим случаем.

source: :pep:`308` - Conditional Expressions
pt_pt: :pep:`308` - Expressões Condicionais
ru: :pep:`308` - Условные выражения

source: PEP written by Guido van Rossum and Raymond D. Hettinger; implemented by Thomas Wouters.
pt_pt: PEP escrita por Guido van Rossum e Raymond D. Hettinger; implementada por Thomas Wouters.
ru: PEP, написанный Гвидо ван Россумом и Раймондом Д. Хеттингером; реализован Томасом Воутерсом.

source: PEP 309: Partial Function Application
pt_pt: PEP 309: Aplicação Parcial de Funções
ru: PEP 309: Приложение частичной функции

source: The :mod:`functools` module is intended to contain tools for functional-style programming.
pt_pt: O módulo :mod:`functools` destina-se a conter ferramentas para programação no estilo funcional.
ru: Модуль :mod:`functools` предназначен для хранения инструментов для функционального программирования.

source: One useful tool in this module is the :func:`partial` function. For programs written in a functional style, you'll sometimes want to construct variants of existing functions that have some of the parameters filled in. Consider a Python function ``f(a, b, c)``; you could create a new function ``g(b, c)`` that was equivalent to ``f(1, b, c)``. This is called "partial function application".
pt_pt: Uma ferramenta útil neste módulo é a função :func:`partial`. Para programas escritos num estilo funcional, por vezes irá querer construir variantes de funções existentes que têm alguns dos parâmetros preenchidos. Considere uma função Python ``f(a, b, c)``; pode criar uma nova função ``g(b, c)`` que seja equivalente a ``f(1, b, c)``. Isto chama-se "aplicação parcial de funções".
ru: Одним из полезных инструментов в этом модуле является функция :func:`partial`. Для программ, написанных в функциональном стиле, иногда вам потребуется создать варианты существующих функций, в которых некоторые параметры будут заполнены. Рассмотрим функцию Python ``f(a, b, c)``; вы можете создать новую функцию ``g(b, c)``, эквивалентную ``f(1, b, c)``. Это называется «приложение частичной функции».

source: :func:`partial` takes the arguments ``(function, arg1, arg2, ... kwarg1=value1, kwarg2=value2)``. The resulting object is callable, so you can just call it to invoke *function* with the filled-in arguments.
pt_pt: :func:`partial` recebe os argumentos ``(function, arg1, arg2, ... kwarg1=value1, kwarg2=value2)``. O objeto resultante é chamável, pelo que pode simplesmente chamá-lo para invocar *function* com os argumentos preenchidos.
ru: :func:`partial` принимает аргументы ``(function, arg1, arg2, ... kwarg1=value1, kwarg2=value2)``. Полученный объект является вызываемым, поэтому вы можете просто вызвать его для вызова *функции* с заполненными аргументами.

source: Here's a small but realistic example::
pt_pt: Aqui está um exemplo pequeno mas realista::
ru: Вот небольшой, но реалистичный пример:

source: import functools def log (message, subsystem): "Write the contents of 'message' to the specified subsystem." print '%s: %s' % (subsystem, message) ... server_log = functools.partial(log, subsystem='server') server_log('Unable to open socket')
pt_pt: import functools def log (message, subsystem): "Escreve o conteúdo de 'message' no subsistema especificado." print '%s: %s' % (subsystem, message) ... server_log = functools.partial(log, subsystem='server') server_log('Não foi possível abrir o socket')

source: Here's another example, from a program that uses PyGTK. Here a context-sensitive pop-up menu is being constructed dynamically. The callback provided for the menu option is a partially applied version of the :meth:`open_item` method, where the first argument has been provided. ::
pt_pt: Aqui está outro exemplo, de um programa que usa PyGTK. Aqui, um menu pop-up sensível ao contexto está a ser construído dinamicamente. A função de retorno fornecida para a opção do menu é uma versão parcialmente aplicada do método :meth:`open_item`, onde o primeiro argumento foi fornecido. ::
ru: Вот еще один пример из программы, использующей PyGTK. Здесь контекстно-зависимое всплывающее меню создается динамически. Обратный вызов, предусмотренный для пункта меню, представляет собой частично примененную версию метода :meth:`open_item`, где указан первый аргумент. ::

source: ... class Application: def open_item(self, path): ... def init (self): open_func = functools.partial(self.open_item, item_path) popup_menu.append( ("Open", open_func, 1) )
pt_pt: ... class Application: def open_item(self, path): ... def init (self): open_func = functools.partial(self.open_item, item_path) popup_menu.append( ("Abrir", open_func, 1) )

source: Another function in the :mod:`functools` module is the ``update_wrapper(wrapper, wrapped)`` function that helps you write well-behaved decorators. :func:`update_wrapper` copies the name, module, and docstring attribute to a wrapper function so that tracebacks inside the wrapped function are easier to understand. For example, you might write::
pt_pt: Outra função no módulo :mod:`functools` é a função ``update_wrapper(wrapper, wrapped)`` que o ajuda a escrever decoradores bem comportados. :func:`update_wrapper` copia o nome, módulo e atributo docstring para uma função wrapper para que os *tracebacks* dentro da função envolvida sejam mais fáceis de entender. Por exemplo, pode escrever::
ru: Еще одна функция в модуле :mod:`functools` — это функция ``update_wrapper(wrapper, Wrapper)``, которая помогает вам писать корректные декораторы. :func:`update_wrapper` копирует имя, модуль и атрибут строки документации в функцию-оболочку, чтобы было легче понять обратные трассировки внутри обернутой функции. Например, вы можете написать::

source: def my_decorator(f): def wrapper(*args, **kwds): print 'Calling decorated function' return f(*args, **kwds) functools.update_wrapper(wrapper, f) return wrapper
pt_pt: def my_decorator(f): def wrapper(*args, **kwds): print 'A chamar função decorada' return f(*args, **kwds) functools.update_wrapper(wrapper, f) return wrapper

source: :func:`wraps` is a decorator that can be used inside your own decorators to copy the wrapped function's information. An alternate version of the previous example would be::
pt_pt: :func:`wraps` é um decorador que pode ser usado dentro dos seus próprios decoradores para copiar a informação da função envolvida. Uma versão alternativa do exemplo anterior seria::
ru: :func:`wraps` — это декоратор, который можно использовать внутри ваших собственных декораторов для копирования информации о завернутой функции. Альтернативная версия предыдущего примера:

source: def my_decorator(f): @functools.wraps(f) def wrapper(*args, **kwds): print 'Calling decorated function' return f(*args, **kwds) return wrapper
pt_pt: def my_decorator(f): @functools.wraps(f) def wrapper(*args, **kwds): print 'A chamar função decorada' return f(*args, **kwds) return wrapper

source: :pep:`309` - Partial Function Application
pt_pt: :pep:`309` - Aplicação Parcial de Funções
ru: :pep:`309` - Приложение с частичной функцией

source: PEP proposed and written by Peter Harris; implemented by Hye-Shik Chang and Nick Coghlan, with adaptations by Raymond Hettinger.
pt_pt: PEP proposta e escrita por Peter Harris; implementada por Hye-Shik Chang e Nick Coghlan, com adaptações de Raymond Hettinger.
ru: PEP предложен и написан Питером Харрисом; реализован Хе-Шиком Чангом и Ником Когланом, с адаптацией Рэймонда Хеттингера.

source: PEP 314: Metadata for Python Software Packages v1.1
pt_pt: PEP 314: Metadados para Pacotes de Software Python v1.1
ru: PEP 314: Метаданные для пакетов программного обеспечения Python v1.1
