Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: MacOS X (10.3 and higher): dynamic loading of modules now uses the :c:func:`dlopen` function instead of MacOS-specific functions.
pt_pt: MacOS X (10.3 e superior): o carregamento dinâmico de módulos usa agora a função :c:func:`dlopen` em vez de funções específicas do MacOS.
ru: MacOS X (10.3 и выше): динамическая загрузка модулей теперь использует функцию :c:func:`dlopen` вместо функций, специфичных для MacOS.

source: MacOS X: an :option:`!--enable-universalsdk` switch was added to the :program:`configure` script that compiles the interpreter as a universal binary able to run on both PowerPC and Intel processors. (Contributed by Ronald Oussoren; :issue:`2573`.)
pt_pt: MacOS X: uma opção :option:`!--enable-universalsdk` foi adicionada ao *script* :program:`configure` que compila o interpretador como um binário universal capaz de executar em processadores PowerPC e Intel. (Contribuído por Ronald Oussoren; :issue:`2573`.)
ru: MacOS X: в сценарий :program:`configure` был добавлен переключатель :option:`!--enable-universalsdk`, который компилирует интерпретатор как универсальный двоичный файл, способный работать как на процессорах PowerPC, так и на процессорах Intel. (Предоставлено Рональдом Уссореном; :issue:`2573`.)

source: Windows: :file:`.dll` is no longer supported as a filename extension for extension modules. :file:`.pyd` is now the only filename extension that will be searched for.
pt_pt: Windows: :file:`.dll` já não é suportado como extensão de nome de ficheiro para módulos de extensão. :file:`.pyd` é agora a única extensão de nome de ficheiro que será procurada.
ru: Windows: :file:`.dll` больше не поддерживается в качестве расширения имени файла для модулей расширения. :file:`.pyd` теперь является единственным расширением имени файла, по которому будет выполняться поиск.

source: Porting to Python 2.5
pt_pt: Portar para o Python 2.5
ru: Портирование на Python 2.5

source: This section lists previously described changes that may require changes to your code:
pt_pt: Esta secção lista alterações previamente descritas que podem exigir alterações ao seu código:
ru: В этом разделе перечислены ранее описанные изменения, которые могут потребовать внесения изменений в ваш код:

source: ASCII is now the default encoding for modules. It's now a syntax error if a module contains string literals with 8-bit characters but doesn't have an encoding declaration. In Python 2.4 this triggered a warning, not a syntax error.
pt_pt: ASCII é agora a codificação predefinida para módulos. É agora um erro de sintaxe se um módulo contiver literais de *string* com caracteres de 8 bits, mas não tiver uma declaração de codificação. No Python 2.4, isto gerava um aviso, não um erro de sintaxe.
ru: ASCII теперь является кодировкой по умолчанию для модулей. Теперь синтаксическая ошибка возникает, если модуль содержит строковые литералы с 8-битными символами, но не имеет объявления кодировки. В Python 2.4 это вызывало предупреждение, а не синтаксическую ошибку.

source: Previously, the :attr:`gi_frame` attribute of a generator was always a frame object. Because of the :pep:`342` changes described in section :ref:`pep-342`, it's now possible for :attr:`gi_frame` to be ``None``.
pt_pt: Anteriormente, o atributo :attr:`gi_frame` de um gerador era sempre um objeto de quadro. Devido às alterações da :pep:`342` descritas na secção :ref:`pep-342`, é agora possível que :attr:`gi_frame` seja ``None``.
ru: Раньше атрибут генератора :attr:`gi_frame` всегда был объектом фрейма. Из-за изменений :pep:`342`, описанных в разделе :ref:`pep-342`, теперь для :attr:`gi_frame` может быть установлено значение ``None``.

source: A new warning, :class:`UnicodeWarning`, is triggered when you attempt to compare a Unicode string and an 8-bit string that can't be converted to Unicode using the default ASCII encoding. Previously such comparisons would raise a :class:`UnicodeDecodeError` exception.
pt_pt: Um novo aviso, :class:`UnicodeWarning`, é gerado quando tenta comparar uma *string* Unicode e uma *string* de 8 bits que não pode ser convertida para Unicode usando a codificação ASCII predefinida. Anteriormente, tais comparações geravam uma exceção :class:`UnicodeDecodeError`.
ru: Новое предупреждение :class:`UnicodeWarning` выдается при попытке сравнить строку Unicode и 8-битную строку, которую невозможно преобразовать в Unicode с использованием кодировки ASCII по умолчанию. Раньше такие сравнения вызывали исключение :class:`UnicodeDecodeError`.

source: Library: the :mod:`csv` module is now stricter about multi-line quoted fields. If your files contain newlines embedded within fields, the input should be split into lines in a manner which preserves the newline characters.
pt_pt: Biblioteca: o módulo :mod:`csv` é agora mais rigoroso em relação a campos citados de várias linhas. Se os seus ficheiros contiverem novas linhas incorporadas dentro de campos, a entrada deve ser dividida em linhas de uma forma que preserve os caracteres de nova linha.
ru: Библиотека: модуль :mod:`csv` теперь более строг в отношении полей, состоящих из нескольких строк. Если ваши файлы содержат символы новой строки, встроенные в поля, ввод следует разделить на строки таким образом, чтобы сохранить символы новой строки.

source: Library: the :mod:`locale` module's :func:`format` function's would previously accept any string as long as no more than one %char specifier appeared. In Python 2.5, the argument must be exactly one %char specifier with no surrounding text.
pt_pt: Biblioteca: a função :func:`format` do módulo :mod:`locale` aceitava anteriormente qualquer *string* desde que não aparecesse mais do que um especificador %char. No Python 2.5, o argumento deve ser exatamente um especificador %char sem texto circundante.
ru: Библиотека: функция :func:`format` модуля :mod:`locale` ранее принимала любую строку длиной не более одной. %с появился спецификатор har. В Python 2.5 аргумент должен быть ровно один. %с Спецификатор har без окружающего текста.

source: Library: The :mod:`pickle` and :mod:`!cPickle` modules no longer accept a return value of ``None`` from the :meth:`~object.__reduce__` method; the method must return a tuple of arguments instead. The modules also no longer accept the deprecated *bin* keyword parameter.
pt_pt: Biblioteca: Os módulos :mod:`pickle` e :mod:`!cPickle` já não aceitam um valor de retorno ``None`` do método :meth:`~object.__reduce__`; o método deve devolver um tuplo de argumentos em vez disso. Os módulos também já não aceitam o parâmetro nomeado *bin* obsoleto.
ru: Библиотека: модули :mod:`pickle` и :mod:`!cPickle` больше не принимают возвращаемое значение ``None`` из метода :meth:`~object.__reduce__`; Вместо этого метод должен возвращать кортеж аргументов. Модули также больше не принимают устаревший параметр ключевого слова *bin*.

source: Library: The :mod:`SimpleXMLRPCServer <xmlrpc.server>` and :mod:`DocXMLRPCServer <xmlrpc.server>` classes now have a :attr:`rpc_paths` attribute that constrains XML-RPC operations to a limited set of URL paths; the default is to allow only ``'/'`` and ``'/RPC2'``. Setting :attr:`rpc_paths` to ``None`` or an empty tuple disables this path checking.
pt_pt: Biblioteca: As classes :mod:`SimpleXMLRPCServer <xmlrpc.server>` e :mod:`DocXMLRPCServer <xmlrpc.server>` têm agora um atributo :attr:`rpc_paths` que restringe as operações XML-RPC a um conjunto limitado de caminhos de URL; o predefinido é permitir apenas ``'/'`` e ``'/RPC2'``. Definir :attr:`rpc_paths` para ``None`` ou um tuplo vazio desativa esta verificação de caminho.
ru: Библиотека: классы :mod:`SimpleXMLRPCServer <xmlrpc.server>` и :mod:`DocXMLRPCServer <xmlrpc.server>` теперь имеют атрибут :attr:`rpc_paths`, который ограничивает операции XML-RPC ограниченным набором URL-путей. ; по умолчанию разрешены только ``'/'`` и ``'/RPC2'``. Установка :attr:`rpc_paths` в ``None`` или пустой кортеж отключает эту проверку пути.

source: C API: Many functions now use :c:type:`Py_ssize_t` instead of :c:expr:`int` to allow processing more data on 64-bit machines. Extension code may need to make the same change to avoid warnings and to support 64-bit machines. See the earlier section :ref:`pep-353` for a discussion of this change.
pt_pt: API C: Muitas funções usam agora :c:type:`Py_ssize_t` em vez de :c:expr:`int` para permitir processar mais dados em máquinas de 64 bits. O código de extensão pode precisar de fazer a mesma alteração para evitar avisos e para suportar máquinas de 64 bits. Veja a secção anterior :ref:`pep-353` para uma discussão sobre esta alteração.
ru: C API: многие функции теперь используют :c:type:`Py_ssize_t` вместо :c:expr:`int`, чтобы позволить обрабатывать больше данных на 64-битных машинах. В код расширения может потребоваться внести такие же изменения, чтобы избежать предупреждений и обеспечить поддержку 64-разрядных компьютеров. См. предыдущий раздел :ref:`pep-353` для обсуждения этого изменения.

source: C API: The obmalloc changes mean that you must be careful to not mix usage of the ``PyMem_*`` and ``PyObject_*`` families of functions. Memory allocated with one family's ``*_Malloc`` must be freed with the corresponding family's ``*_Free`` function.
pt_pt: API C: As alterações ao obmalloc significam que deve ter cuidado para não misturar o uso das famílias de funções ``PyMem_*`` e ``PyObject_*``. A memória alocada com ``*_Malloc`` de uma família deve ser libertada com a função ``*_Free`` da família correspondente.
ru: C API: Изменения obmalloc означают, что вы должны быть осторожны, чтобы не смешивать использование семейств функций ``PyMem_*`` и `` PyObj ect_*``. Память, выделенная с помощью ``*_Malloc`` одного семейства, должна быть освобождена с помощью функции ``*_Free`` соответствующего семейства.

source: Acknowledgements
pt_pt: Agradecimentos
ru: Подтверждение

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Georg Brandl, Nick Coghlan, Phillip J. Eby, Lars Gustäbel, Raymond Hettinger, Ralf W. Grosse-Kunstleve, Kent Johnson, Iain Lowe, Martin von Löwis, Fredrik Lundh, Andrew McNamara, Skip Montanaro, Gustavo Niemeyer, Paul Prescod, James Pryor, Mike Rovner, Scott Weikart, Barry Warsaw, Thomas Wouters.
pt_pt: O autor gostaria de agradecer às seguintes pessoas por oferecerem sugestões, correções e assistência com vários rascunhos deste artigo: Georg Brandl, Nick Coghlan, Phillip J. Eby, Lars Gustäbel, Raymond Hettinger, Ralf W. Grosse-Kunstleve, Kent Johnson, Iain Lowe, Martin von Löwis, Fredrik Lundh, Andrew McNamara, Skip Montanaro, Gustavo Niemeyer, Paul Prescod, James Pryor, Mike Rovner, Scott Weikart, Barry Warsaw, Thomas Wouters.
ru: Автор хотел бы поблагодарить следующих людей за предложения, исправления и помощь в различных черновиках этой статьи: Георга Брандла, Ника Коглана, Филиппа Дж. Эби, Ларса Густебеля, Раймонда Хеттингера, Ральфа В. Гросс-Кунстлеве, Кента Джонсона, Иэн Лоу, Мартин фон Лёвис, Фредрик Лунд, Эндрю Макнамара, Скип Монтанаро, Густаво Нимейер, Пол Прескод, Джеймс Прайор, Майк Ровнер, Скотт Вейкарт, Барри Варшава, Томас Воутерс.

source: universal newlines
pt_pt: novas linhas universais
ru: универсальные переводы строк

source: What's new
pt_pt: Novidades
ru: Что нового

source: The :mod:`audioop` module now supports the a-LAW encoding, and the code for u-LAW encoding has been improved. (Contributed by Lars Immisch.)
ru: Модуль :mod:`audioop` теперь поддерживает кодировку a-LAW, а код кодирования u-LAW был улучшен. (Предоставлено Ларсом Иммишем.)

source: New module: the :mod:`msilib` module allows creating Microsoft Installer :file:`.msi` files and CAB files. Some support for reading the :file:`.msi` database is also included. (Contributed by Martin von Löwis.)
ru: Новый модуль: модуль :mod:`msilib` позволяет создавать файлы Microsoft Installer :file:`.msi` и CAB-файлы. Также включена некоторая поддержка чтения базы данных :file:`.msi`. (Предоставлено Мартином фон Лёвисом.)

source: The :mod:`nis` module now supports accessing domains other than the system default domain by supplying a *domain* argument to the :func:`nis.match` and :func:`nis.maps` functions. (Contributed by Ben Bell.)
ru: Модуль :mod:`nis` теперь поддерживает доступ к доменам, отличным от системного домена по умолчанию, путем предоставления аргумента *domain* функциям :func:`nis.match` и :func:`nis.maps`. (Предоставлено Беном Беллом.)

source: New module: the :mod:`spwd` module provides functions for accessing the shadow password database on systems that support shadow passwords.
ru: Новый модуль: модуль :mod:`spwd` предоставляет функции для доступа к базе данных теневых паролей в системах, поддерживающих теневые пароли.
