Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: The :mod:`!audioop` module now supports the a-LAW encoding, and the code for u-LAW encoding has been improved. (Contributed by Lars Immisch.)
pt_pt: O módulo :mod:`!audioop` agora suporta a codificação a-LAW, e o código para a codificação u-LAW foi melhorado. (Contribuído por Lars Immisch.)

source: The :mod:`codecs` module gained support for incremental codecs. The :func:`codec.lookup` function now returns a :class:`CodecInfo` instance instead of a tuple. :class:`CodecInfo` instances behave like a 4-tuple to preserve backward compatibility but also have the attributes :attr:`encode`, :attr:`decode`, :attr:`incrementalencoder`, :attr:`incrementaldecoder`, :attr:`streamwriter`, and :attr:`streamreader`. Incremental codecs can receive input and produce output in multiple chunks; the output is the same as if the entire input was fed to the non-incremental codec. See the :mod:`codecs` module documentation for details. (Designed and implemented by Walter Dörwald.)
pt_pt: O módulo :mod:`codecs` ganhou suporte para *codecs* incrementais. A função :func:`codec.lookup` agora devolve uma instância :class:`CodecInfo` em vez de um tuplo. As instâncias :class:`CodecInfo` comportam-se como um 4-tuplo para preservar a compatibilidade retroativa, mas também têm os atributos :attr:`encode`, :attr:`decode`, :attr:`incrementalencoder`, :attr:`incrementaldecoder`, :attr:`streamwriter` e :attr:`streamreader`. Os *codecs* incrementais podem receber entrada e produzir saída em vários blocos; a saída é a mesma que se toda a entrada fosse fornecida ao *codec* não incremental. Consulte a documentação do módulo :mod:`codecs` para mais detalhes. (Desenhado e implementado por Walter Dörwald.)
ru: Модуль :mod:`codecs` получил поддержку инкрементных кодеков. Функция :func:`codec.lookup` теперь возвращает экземпляр :class:`CodecInfo` вместо кортежа. Экземпляры :class:`CodecInfo` ведут себя как четырехкортеж для сохранения обратной совместимости, но также имеют атрибуты :attr:`encode`, :attr:`decode`, :attr:`incrementalencoder`, :attr:`incrementaldecoder`, :attr:`streamwriter` и :attr:`streamreader`. Инкрементные кодеки могут принимать входные данные и выдавать выходные данные в виде нескольких фрагментов; вывод такой же, как если бы весь ввод был подан в неинкрементальный кодек. Подробности смотрите в документации модуля :mod:`codecs`. (Разработано и реализовано Вальтером Дорвальдом.)

source: The :mod:`collections` module gained a new type, :class:`defaultdict`, that subclasses the standard :class:`dict` type. The new type mostly behaves like a dictionary but constructs a default value when a key isn't present, automatically adding it to the dictionary for the requested key value.
pt_pt: O módulo :mod:`collections` ganhou um novo tipo, :class:`defaultdict`, que é uma subclasse do tipo :class:`dict` padrão. O novo tipo comporta-se maioritariamente como um dicionário, mas constrói um valor predefinido quando uma chave não está presente, adicionando-a automaticamente ao dicionário para o valor da chave solicitada.
ru: Модуль :mod:`collections` получил новый тип :class:`defaultdict`, который является подклассом стандартного типа :class:`dict`. Новый тип в основном ведет себя как словарь, но создает значение по умолчанию, когда ключ отсутствует, автоматически добавляя его в словарь для запрошенного значения ключа.

source: The first argument to :class:`defaultdict`'s constructor is a factory function that gets called whenever a key is requested but not found. This factory function receives no arguments, so you can use built-in type constructors such as :func:`list` or :func:`int`. For example, you can make an index of words based on their initial letter like this::
pt_pt: O primeiro argumento do construtor de :class:`defaultdict` é uma função fábrica que é chamada sempre que uma chave é solicitada mas não é encontrada. Esta função fábrica não recebe argumentos, pelo que pode usar construtores de tipos integrados como :func:`list` ou :func:`int`. Por exemplo, pode criar um índice de palavras com base na sua letra inicial, como neste exemplo::
ru: Первый аргумент конструктора :class:`defaultdict` — это фабричная функция, которая вызывается всякий раз, когда ключ запрошен, но не найден. Эта фабричная функция не получает аргументов, поэтому вы можете использовать встроенные конструкторы типов, такие как :func:`list` или :func:`int`. Например, вы можете составить указатель слов по их начальной букве следующим образом:

source: words = """Nel mezzo del cammin di nostra vita mi ritrovai per una selva oscura che la diritta via era smarrita""".lower().split() index = defaultdict(list) for w in words: init_letter = w[0] index[init_letter].append(w)
pt_pt: words = """No meio do caminho da nossa vida encontrei-me numa selva escura porque a via reta estava perdida""".lower().split() index = defaultdict(list) for w in words: init_letter = w[0] index[init_letter].append(w)

source: Printing ``index`` results in the following output::
pt_pt: Imprimir ``index`` resulta na seguinte saída::
ru: Печать ``index`` приводит к следующему выводу:

source: (Contributed by Guido van Rossum.)
pt_pt: (Contribuído por Guido van Rossum.)
ru: (Предоставлено Гвидо ван Россумом.)

source: The :class:`deque` double-ended queue type supplied by the :mod:`collections` module now has a ``remove(value)`` method that removes the first occurrence of *value* in the queue, raising :exc:`ValueError` if the value isn't found. (Contributed by Raymond Hettinger.)
pt_pt: O tipo de fila de duas extremidades :class:`deque`, fornecido pelo módulo :mod:`collections`, tem agora um método ``remove(value)`` que remove a primeira ocorrência de *value* na fila, gerando :exc:`ValueError` se o valor não for encontrado. (Contribuído por Raymond Hettinger.)
ru: Тип двусторонней очереди :class:`deque`, предоставляемый модулем :mod:`collections`, теперь имеет метод ``remove(value)``, который удаляет первое вхождение *value* в очереди, поднимая :exc :`ValueError`, если значение не найдено. (Предоставлено Раймондом Хеттингером.)

source: New module: The :mod:`contextlib` module contains helper functions for use with the new ':keyword:`with`' statement. See section :ref:`contextlibmod` for more about this module.
pt_pt: Novo módulo: O módulo :mod:`contextlib` contém funções auxiliares para uso com a nova instrução ':keyword:`with`'. Veja a secção :ref:`contextlibmod` para mais informações sobre este módulo.
ru: Новый модуль: Модуль :mod:`contextlib` содержит вспомогательные функции для использования с новым оператором ':keyword:`with`'. Дополнительную информацию об этом модуле см. в разделе :ref:`contextlibmod`.

source: New module: The :mod:`cProfile` module is a C implementation of the existing :mod:`profile` module that has much lower overhead. The module's interface is the same as :mod:`profile`: you run ``cProfile.run('main()')`` to profile a function, can save profile data to a file, etc. It's not yet known if the Hotshot profiler, which is also written in C but doesn't match the :mod:`profile` module's interface, will continue to be maintained in future versions of Python. (Contributed by Armin Rigo.)
pt_pt: Novo módulo: O módulo :mod:`cProfile` é uma implementação em C do módulo existente :mod:`profile`, com muito menos sobrecarga. A interface do módulo é a mesma que a do :mod:`profile`: pode executar ``cProfile.run('main()')`` para perfilar uma função, pode guardar dados de perfil num ficheiro, etc. Ainda não se sabe se o perfilador Hotshot, que também está escrito em C mas não corresponde à interface do módulo :mod:`profile`, continuará a ser mantido em futuras versões do Python. (Contribuído por Armin Rigo.)
ru: Новый модуль: Модуль :mod:`cProfile` представляет собой реализацию C существующего модуля :mod:`profile`, который имеет гораздо меньшие накладные расходы. Интерфейс модуля такой же, как у :mod:`profile`: вы запускаете ``cProfile.run('main()')`` для профилирования функции, можете сохранить данные профиля в файл и т. д. Пока неизвестно, будет ли профилировщик Hotshot, который также написан на C, но не соответствует интерфейсу модуля :mod:`profile`, будет по-прежнему поддерживаться в будущих версиях Python. (Предоставлено Армином Риго.)

source: Also, the :mod:`pstats` module for analyzing the data measured by the profiler now supports directing the output to any file object by supplying a *stream* argument to the :class:`Stats` constructor. (Contributed by Skip Montanaro.)
pt_pt: Além disso, o módulo :mod:`pstats`, para analisar os dados medidos pelo perfilador, agora suporta direcionar a saída para qualquer objeto de ficheiro, fornecendo um argumento *stream* ao construtor :class:`Stats`. (Contribuído por Skip Montanaro.)
ru: Кроме того, модуль :mod:`pstats` для анализа данных, измеренных профилировщиком, теперь поддерживает направление вывода в любой файловый объект, передавая аргумент *stream* конструктору :class:`Stats`. (Предоставлено Скипом Монтанаро.)

source: The :mod:`csv` module, which parses files in comma-separated value format, received several enhancements and a number of bugfixes. You can now set the maximum size in bytes of a field by calling the ``csv.field_size_limit(new_limit)`` function; omitting the *new_limit* argument will return the currently set limit. The :class:`reader` class now has a :attr:`line_num` attribute that counts the number of physical lines read from the source; records can span multiple physical lines, so :attr:`line_num` is not the same as the number of records read.
pt_pt: O módulo :mod:`csv`, que analisa ficheiros em formato de valores separados por vírgulas, recebeu várias melhorias e um número de correções de *bugs*. Pode agora definir o tamanho máximo em bytes de um campo chamando a função ``csv.field_size_limit(new_limit)``; omitir o argumento *new_limit* devolverá o limite atualmente definido. A classe :class:`reader` tem agora um atributo :attr:`line_num` que conta o número de linhas físicas lidas da origem; os registos podem abranger várias linhas físicas, pelo que :attr:`line_num` não é o mesmo que o número de registos lidos.
ru: Модуль :mod:`csv`, который анализирует файлы в формате значений, разделенных запятыми, получил несколько улучшений и ряд исправлений. Теперь вы можете установить максимальный размер поля в байтах, вызвав функцию ``csv.field_size_limit(new_limit)``; опущение аргумента *new_limit* вернет текущий установленный предел. Класс :class:`reader` теперь имеет атрибут :attr:`line_num`, который подсчитывает количество физических строк, прочитанных из источника; записи могут занимать несколько физических строк, поэтому :attr:`line_num` не совпадает с количеством прочитанных записей.

source: The CSV parser is now stricter about multi-line quoted fields. Previously, if a line ended within a quoted field without a terminating newline character, a newline would be inserted into the returned field. This behavior caused problems when reading files that contained carriage return characters within fields, so the code was changed to return the field without inserting newlines. As a consequence, if newlines embedded within fields are important, the input should be split into lines in a manner that preserves the newline characters.
pt_pt: O analisador CSV é agora mais rigoroso em relação a campos citados de várias linhas. Anteriormente, se uma linha terminasse dentro de um campo citado sem um caractere de nova linha de terminação, uma nova linha seria inserida no campo devolvido. Este comportamento causava problemas ao ler ficheiros que continham caracteres de retorno de carro dentro de campos, pelo que o código foi alterado para devolver o campo sem inserir novas linhas. Como consequência, se as novas linhas incorporadas dentro de campos forem importantes, a entrada deve ser dividida em linhas de uma forma que preserve os caracteres de nova linha.
ru: Анализатор CSV теперь более строг в отношении полей с многострочными кавычками. Раньше, если строка заканчивалась внутри поля в кавычках без завершающего символа новой строки, в возвращаемое поле вставлялась новая строка. Такое поведение вызывало проблемы при чтении файлов, содержащих символы возврата каретки в полях, поэтому код был изменен, чтобы возвращать поле без вставки символов новой строки. Как следствие, если важны символы новой строки, встроенные в поля, входные данные следует разделить на строки таким образом, чтобы сохранить символы новой строки.

source: (Contributed by Skip Montanaro and Andrew McNamara.)
pt_pt: (Contribuído por Skip Montanaro e Andrew McNamara.)
ru: (Сообщили Скип Монтанаро и Эндрю Макнамара.)

source: The :class:`~datetime.datetime` class in the :mod:`datetime` module now has a ``strptime(string, format)`` method for parsing date strings, contributed by Josh Spoerri. It uses the same format characters as :func:`time.strptime` and :func:`time.strftime`::
pt_pt: A classe :class:`~datetime.datetime` no módulo :mod:`datetime` tem agora um método ``strptime(string, format)`` para analisar *strings* de data, contribuído por Josh Spoerri. Usa os mesmos caracteres de formato que :func:`time.strptime` e :func:`time.strftime`::
ru: Класс :class:`~datetime.datetime` в модуле :mod:`datetime` теперь имеет метод ``strptime(string, format)`` для анализа строк даты, предоставленный Джошем Сперри. Он использует те же символы формата, что и :func:`time.strptime` и :func:`time.strftime`::

source: The :meth:`SequenceMatcher.get_matching_blocks` method in the :mod:`difflib` module now guarantees to return a minimal list of blocks describing matching subsequences. Previously, the algorithm would occasionally break a block of matching elements into two list entries. (Enhancement by Tim Peters.)
pt_pt: O método :meth:`SequenceMatcher.get_matching_blocks` no módulo :mod:`difflib` garante agora devolver uma lista mínima de blocos que descrevem subsequências correspondentes. Anteriormente, o algoritmo ocasionalmente dividia um bloco de elementos correspondentes em duas entradas de lista. (Melhoria por Tim Peters.)
ru: Метод :meth:`SequenceMatcher.get_matching_blocks` в модуле :mod:`difflib` теперь гарантирует возврат минимального списка блоков, описывающих совпадающие подпоследовательности. Раньше алгоритм иногда разбивал блок совпадающих элементов на две записи списка. (Улучшение Тима Питерса.)

source: The :mod:`doctest` module gained a ``SKIP`` option that keeps an example from being executed at all. This is intended for code snippets that are usage examples intended for the reader and aren't actually test cases.
pt_pt: O módulo :mod:`doctest` ganhou uma opção ``SKIP`` que impede que um exemplo seja executado. Isto é destinado a trechos de código que são exemplos de uso destinados ao leitor e não são realmente casos de teste.
ru: Модуль :mod:`doctest` получил опцию SKIP, которая вообще предотвращает выполнение примера. Это предназначено для фрагментов кода, которые представляют собой примеры использования, предназначенные для читателя, а не тестовые примеры.

source: An *encoding* parameter was added to the :func:`testfile` function and the :class:`DocFileSuite` class to specify the file's encoding. This makes it easier to use non-ASCII characters in tests contained within a docstring. (Contributed by Bjorn Tillenius.)
pt_pt: Um parâmetro *encoding* foi adicionado à função :func:`testfile` e à classe :class:`DocFileSuite` para especificar a codificação do ficheiro. Isto facilita o uso de caracteres não-ASCII em testes contidos numa *docstring*. (Contribuído por Bjorn Tillenius.)
ru: Параметр *encoding* был добавлен в функцию :func:`testfile` и класс :class:`DocFileSuite` для указания кодировки файла. Это упрощает использование символов, отличных от ASCII, в тестах, содержащихся в строке документации. (Предоставлено Бьёрном Тиллениусом.)

source: The :mod:`email` package has been updated to version 4.0. (Contributed by Barry Warsaw.)
pt_pt: O pacote :mod:`email` foi atualizado para a versão 4.0. (Contribuído por Barry Warsaw.)
ru: Пакет :mod:`email` обновлен до версии 4.0. (Предоставлено Барри Варшавой.)

source: The :mod:`fileinput` module was made more flexible. Unicode filenames are now supported, and a *mode* parameter that defaults to ``"r"`` was added to the :func:`input` function to allow opening files in binary or :term:`universal newlines` mode. Another new parameter, *openhook*, lets you use a function other than :func:`open` to open the input files. Once you're iterating over the set of files, the :class:`FileInput` object's new :meth:`~fileinput.fileno` returns the file descriptor for the currently opened file. (Contributed by Georg Brandl.)
pt_pt: O módulo :mod:`fileinput` foi tornado mais flexível. Nomes de ficheiros Unicode são agora suportados, e um parâmetro *mode* que por predefinição é ``"r"`` foi adicionado à função :func:`input` para permitir abrir ficheiros em modo binário ou :term:`novas linhas universais`. Outro novo parâmetro, *openhook*, permite usar uma função diferente de :func:`open` para abrir os ficheiros de entrada. Uma vez que está a iterar sobre o conjunto de ficheiros, o novo método :meth:`~fileinput.fileno` do objeto :class:`FileInput` devolve o descritor de ficheiro para o ficheiro atualmente aberto. (Contribuído por Georg Brandl.)
ru: Модуль :mod:`fileinput` стал более гибким. Теперь поддерживаются имена файлов в Юникоде, а в функцию :func:`input` был добавлен параметр *mode*, который по умолчанию имеет значение ``"r"``, чтобы разрешить открытие файлов в двоичном режиме или в режиме :term:`универсальной новой строки`. Еще один новый параметр, *openhook*, позволяет использовать функцию, отличную от :func:`open`, для открытия входных файлов. После того, как вы перебираете набор файлов, новый :meth:`~fileinput.fileno` объекта :class:`FileInput` возвращает файловый дескриптор для текущего открытого файла. (Предоставлено Георгом Брандлом.)

source: In the :mod:`gc` module, the new :func:`get_count` function returns a 3-tuple containing the current collection counts for the three GC generations. This is accounting information for the garbage collector; when these counts reach a specified threshold, a garbage collection sweep will be made. The existing :func:`gc.collect` function now takes an optional *generation* argument of 0, 1, or 2 to specify which generation to collect. (Contributed by Barry Warsaw.)
pt_pt: No módulo :mod:`gc`, a nova função :func:`get_count` devolve um 3-tuplo contendo as contagens atuais de coleção para as três gerações do GC. Esta é informação contabilística para o recolhedor de lixo; quando estas contagens atingem um limiar especificado, uma varredura de coleção de lixo será feita. A função existente :func:`gc.collect` agora aceita um argumento opcional *generation* de 0, 1 ou 2 para especificar qual geração recolher. (Contribuído por Barry Warsaw.)
ru: В модуле :mod:`gc` новая функция :func:`get_count` возвращает кортеж из трех элементов, содержащий текущие счетчики коллекций для трех поколений GC. Это учетная информация для сборщика мусора; когда эти значения достигнут определенного порога, будет произведена очистка мусора. Существующая функция :func:`gc.collect` теперь принимает необязательный аргумент *генерация*, равный 0, 1 или 2, чтобы указать, какое поколение собирать. (Предоставлено Барри Варшавой.)

source: The :func:`nsmallest` and :func:`nlargest` functions in the :mod:`heapq` module now support a ``key`` keyword parameter similar to the one provided by the :func:`min`/:func:`max` functions and the :meth:`sort` methods. For example::
pt_pt: As funções :func:`nsmallest` e :func:`nlargest` no módulo :mod:`heapq` agora suportam um parâmetro nomeado ``key`` semelhante ao fornecido pelas funções :func:`min`/:func:`max` e pelos métodos :meth:`sort`. Por exemplo::
ru: Функции :func:`nsmallest` и :func:`nlargest` в модуле :mod:`heapq` теперь поддерживают ключевой параметр ``key``, аналогичный тому, который предоставляется :func:`min`/:func функции :`max` и методы :meth:`sort`. Например::

source: >>> import heapq >>> L = ["short", 'medium', 'longest', 'longer still'] >>> heapq.nsmallest(2, L) # Return two lowest elements, lexicographically ['longer still', 'longest'] >>> heapq.nsmallest(2, L, key=len) # Return two shortest elements ['short', 'medium']
pt_pt: >>> import heapq >>> L = ["curto", 'médio', 'mais longo', 'ainda mais longo'] >>> heapq.nsmallest(2, L) # Devolve os dois elementos mais baixos, lexicograficamente ['ainda mais longo', 'mais longo'] >>> heapq.nsmallest(2, L, key=len) # Devolve os dois elementos mais curtos ['curto', 'médio']

source: (Contributed by Raymond Hettinger.)
pt_pt: (Contribuído por Raymond Hettinger.)
ru: (Предоставлено Раймондом Хеттингером.)

source: The :func:`itertools.islice` function now accepts ``None`` for the start and step arguments. This makes it more compatible with the attributes of slice objects, so that you can now write the following::
pt_pt: A função :func:`itertools.islice` agora aceita ``None`` para os argumentos de início e passo. Isto torna-a mais compatível com os atributos de objetos de fatia, para que possa agora escrever o seguinte::
ru: Функция :func:`itertools.islice` теперь принимает значение None в качестве аргументов начала и шага. Это делает его более совместимым с атрибутами объектов срезов, так что теперь вы можете написать следующее:

source: s = slice(5) # Create slice object itertools.islice(iterable, s.start, s.stop, s.step)
pt_pt: s = slice(5) # Criar objeto de fatia itertools.islice(iterable, s.start, s.stop, s.step)

source: The :func:`format` function in the :mod:`locale` module has been modified and two new functions were added, :func:`format_string` and :func:`currency`.
pt_pt: A função :func:`format` no módulo :mod:`locale` foi modificada e duas novas funções foram adicionadas, :func:`format_string` e :func:`currency`.
ru: Функция :func:`format` в модуле :mod:`locale` была изменена и добавлены две новые функции: :func:`format_string` и :func:`currency`.

source: The :func:`format` function's *val* parameter could previously be a string as long as no more than one %char specifier appeared; now the parameter must be exactly one %char specifier with no surrounding text. An optional *monetary* parameter was also added which, if ``True``, will use the locale's rules for formatting currency in placing a separator between groups of three digits.
pt_pt: O parâmetro *val* da função :func:`format` poderia anteriormente ser uma *string* desde que não aparecesse mais do que um especificador %char; agora o parâmetro deve ser exatamente um especificador %char sem texto circundante. Um parâmetro opcional *monetary* também foi adicionado, que, se ``True``, usará as regras da localidade para formatar moeda ao colocar um separador entre grupos de três dígitos.
ru: Параметр *val* функции :func:`format` ранее мог быть строкой длиной не более одной %с появился спецификатор har; теперь параметр должен быть ровно один %с Спецификатор har без окружающего текста. Также был добавлен необязательный параметр *monetary*, который, если он имеет значение True, будет использовать правила локали для форматирования валюты при размещении разделителя между группами из трех цифр.

source: To format strings with multiple %char specifiers, use the new :func:`format_string` function that works like :func:`format` but also supports mixing %char specifiers with arbitrary text.
pt_pt: Para formatar *strings* com vários especificadores %char, use a nova função :func:`format_string` que funciona como :func:`format`, mas também suporta a mistura de especificadores %char com texto arbitrário.
ru: Чтобы отформатировать строки с несколькими %с спецификаторы har, используйте новую функцию :func:`format_string`, которая работает как :func:`format`, но также поддерживает смешивание %с Спецификаторы har с произвольным текстом.
