Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: The lock is acquired before the block is executed and always released once the block is complete.
pt_pt: O bloqueio é adquirido antes de o bloco ser executado e é sempre libertado assim que o bloco estiver completo.
ru: Блокировка устанавливается до выполнения блока и всегда снимается после завершения блока.

source: The new :func:`localcontext` function in the :mod:`decimal` module makes it easy to save and restore the current decimal context, which encapsulates the desired precision and rounding characteristics for computations::
pt_pt: A nova função :func:`localcontext` no módulo :mod:`decimal` facilita guardar e restaurar o contexto decimal atual, que encapsula a precisão desejada e as características de arredondamento para cálculos::
ru: Новая функция :func:`localcontext` в модуле :mod:`decimal` позволяет легко сохранять и восстанавливать текущий десятичный контекст, который инкапсулирует желаемую точность и характеристики округления для вычислений::

source: from decimal import Decimal, Context, localcontext # Displays with default precision of 28 digits v = Decimal('578') print v.sqrt() with localcontext(Context(prec=16)): # All code in this block uses a precision of 16 digits. # The original context is restored on exiting the block. print v.sqrt()
pt_pt: from decimal import Decimal, Context, localcontext # Mostra com a precisão predefinida de 28 dígitos v = Decimal('578') print v.sqrt() with localcontext(Context(prec=16)): # Todo o código neste bloco usa uma precisão de 16 dígitos. # O contexto original é restaurado ao sair do bloco. print v.sqrt()

source: Writing Context Managers
pt_pt: Escrever Gestores de Contexto
ru: Написание контекстных менеджеров

source: Under the hood, the ':keyword:`with`' statement is fairly complicated. Most people will only use ':keyword:`!with`' in company with existing objects and don't need to know these details, so you can skip the rest of this section if you like. Authors of new objects will need to understand the details of the underlying implementation and should keep reading.
pt_pt: Por baixo do capot, a instrução ':keyword:`with`' é bastante complicada. A maioria das pessoas usará ':keyword:`!with`' apenas com objetos existentes e não precisa de conhecer estes detalhes, pelo que pode saltar o resto desta secção se quiser. Os autores de novos objetos precisarão de entender os detalhes da implementação subjacente e devem continuar a ler.
ru: На самом деле оператор ':keyword:`with`' довольно сложен. Большинство людей будут использовать ':keyword:`!with`' только вместе с существующими объектами, и им не нужно знать эти детали, поэтому вы можете пропустить остальную часть этого раздела, если хотите. Авторам новых объектов необходимо будет понимать детали базовой реализации, и им следует продолжать чтение.

source: A high-level explanation of the context management protocol is:
pt_pt: Uma explicação de alto nível do protocolo de gestão de contexto é:
ru: Подробное объяснение протокола управления контекстом:

source: The expression is evaluated and should result in an object called a "context manager". The context manager must have :meth:`~object.__enter__` and :meth:`~object.__exit__` methods.
pt_pt: A expressão é avaliada e deve resultar num objeto chamado "gestor de contexto". O gestor de contexto deve ter os métodos :meth:`~object.__enter__` e :meth:`~object.__exit__`.
ru: Выражение оценивается и должно привести к созданию объекта, называемого «контекстным менеджером». Менеджер контекста должен иметь методы :meth:`~object.__enter__` и :meth:`~object.__exit__`.

source: The context manager's :meth:`~object.__enter__` method is called. The value returned is assigned to *VAR*. If no ``'as VAR'`` clause is present, the value is simply discarded.
pt_pt: O método :meth:`~object.__enter__` do gestor de contexto é chamado. O valor devolvido é atribuído a *VAR*. Se não estiver presente nenhuma cláusula ``'as VAR'``, o valor é simplesmente descartado.
ru: Вызывается метод :meth:`~object.__enter__` контекстного менеджера. Возвращаемое значение присваивается *VAR*. Если предложение ``'as VAR'`` отсутствует, значение просто отбрасывается.

source: The code in *BLOCK* is executed.
pt_pt: O código em *BLOCO* é executado.
ru: Код в *BLOCK* выполняется.

source: If *BLOCK* raises an exception, the ``__exit__(type, value, traceback)`` is called with the exception details, the same values returned by :func:`sys.exc_info`. The method's return value controls whether the exception is re-raised: any false value re-raises the exception, and ``True`` will result in suppressing it. You'll only rarely want to suppress the exception, because if you do the author of the code containing the ':keyword:`with`' statement will never realize anything went wrong.
pt_pt: Se *BLOCO* gerar uma exceção, ``__exit__(type, value, traceback)`` é chamado com os detalhes da exceção, os mesmos valores devolvidos por :func:`sys.exc_info`. O valor de retorno do método controla se a exceção é gerada novamente: qualquer valor falso gera novamente a exceção, e ``True`` resultará na sua supressão. Só raramente irá querer suprimir a exceção, porque se o fizer, o autor do código que contém a instrução ':keyword:`with`' nunca saberá que algo correu mal.
ru: Если *BLOCK* вызывает исключение, вызывается ``__exit__(type, value, Traceback)`` с подробностями исключения, теми же значениями, которые возвращает :func:`sys.exc_info`. Возвращаемое значение метода определяет, будет ли исключение возникать повторно: любое ложное значение повторно вызывает исключение, а значение True приведет к его подавлению. Вы будете редко захотеть подавить исключение, потому что если вы это сделаете, автор кода, содержащего оператор ':keyword:`with`', никогда не поймет, что что-то пошло не так.

source: If *BLOCK* didn't raise an exception, the :meth:`~object.__exit__` method is still called, but *type*, *value*, and *traceback* are all ``None``.
pt_pt: Se *BLOCO* não gerou uma exceção, o método :meth:`~object.__exit__` ainda é chamado, mas *type*, *value* e *traceback* são todos ``None``.
ru: Если *BLOCK* не вызвал исключение, метод :meth:`~object.__exit__` все равно вызывается, но все *type*, *value* и *traceback* имеют значение ``None``.

source: Let's think through an example. I won't present detailed code but will only sketch the methods necessary for a database that supports transactions.
pt_pt: Vamos pensar num exemplo. Não vou apresentar código detalhado, mas apenas esboçar os métodos necessários para uma base de dados que suporta transações.
ru: Давайте подумаем на примере. Я не буду приводить подробный код, а лишь набросаю методы, необходимые для базы данных, поддерживающей транзакции.

source: (For people unfamiliar with database terminology: a set of changes to the database are grouped into a transaction. Transactions can be either committed, meaning that all the changes are written into the database, or rolled back, meaning that the changes are all discarded and the database is unchanged. See any database textbook for more information.)
pt_pt: (Para pessoas não familiarizadas com a terminologia de bases de dados: um conjunto de alterações à base de dados é agrupado numa transação. As transações podem ser confirmadas, o que significa que todas as alterações são escritas na base de dados, ou revertidas, o que significa que as alterações são todas descartadas e a base de dados permanece inalterada. Consulte qualquer livro sobre bases de dados para mais informações.)
ru: (Для людей, незнакомых с терминологией базы данных: набор изменений в базе данных группируется в транзакцию. Транзакции могут быть либо зафиксированы, что означает, что все изменения записываются в базу данных, или откатиться, что означает, что все изменения отбрасываются и база данных не изменилась. Дополнительную информацию см. в любом учебнике по базам данных.)

source: Let's assume there's an object representing a database connection. Our goal will be to let the user write code like this::
pt_pt: Vamos assumir que existe um objeto que representa uma ligação a uma base de dados. O nosso objetivo será permitir que o utilizador escreva código como este::
ru: Предположим, существует объект, представляющий соединение с базой данных. Нашей целью будет позволить пользователю писать такой код:

source: db_connection = DatabaseConnection() with db_connection as cursor: cursor.execute('insert into ...') cursor.execute('delete from ...') # ... more operations ...
pt_pt: db_connection = DatabaseConnection() with db_connection as cursor: cursor.execute('insert into ...') cursor.execute('delete from ...') # ... mais operações ...

source: The transaction should be committed if the code in the block runs flawlessly or rolled back if there's an exception. Here's the basic interface for :class:`DatabaseConnection` that I'll assume::
pt_pt: A transação deve ser confirmada se o código no bloco for executado sem problemas ou revertida se houver uma exceção. Aqui está a interface básica para :class:`DatabaseConnection` que vou assumir::
ru: Транзакция должна быть зафиксирована, если код в блоке выполняется безупречно, или откатиться, если есть исключение. Вот базовый интерфейс для :class:`DatabaseConnection`, который я предполагаю::

source: class DatabaseConnection: # Database interface def cursor (self): "Returns a cursor object and starts a new transaction" def commit (self): "Commits current transaction" def rollback (self): "Rolls back current transaction"
pt_pt: class DatabaseConnection: # Interface da base de dados def cursor (self): "Devolve um objeto cursor e inicia uma nova transação" def commit (self): "Confirma a transação atual" def rollback (self): "Reverte a transação atual"

source: The :meth:`~object.__enter__` method is pretty easy, having only to start a new transaction. For this application the resulting cursor object would be a useful result, so the method will return it. The user can then add ``as cursor`` to their ':keyword:`with`' statement to bind the cursor to a variable name. ::
pt_pt: O método :meth:`~object.__enter__` é bastante simples, tendo apenas de iniciar uma nova transação. Para esta aplicação, o objeto cursor resultante seria um resultado útil, pelo que o método o devolverá. O utilizador pode então adicionar ``as cursor`` à sua instrução ':keyword:`with`' para ligar o cursor a um nome de variável. ::
ru: Метод :meth:`~object.__enter__` довольно прост, достаточно лишь начать новую транзакцию. Для этого приложения полученный объект курсора будет полезным результатом, поэтому метод вернет его. Затем пользователь может добавить ``as курсор`` в свой оператор ':keyword:`with`', чтобы привязать курсор к имени переменной. ::

source: class DatabaseConnection: ... def __enter__ (self): # Code to start a new transaction cursor = self.cursor() return cursor
pt_pt: class DatabaseConnection: ... def __enter__ (self): # Código para iniciar uma nova transação cursor = self.cursor() return cursor

source: The :meth:`~object.__exit__` method is the most complicated because it's where most of the work has to be done. The method has to check if an exception occurred. If there was no exception, the transaction is committed. The transaction is rolled back if there was an exception.
pt_pt: O método :meth:`~object.__exit__` é o mais complicado porque é onde a maior parte do trabalho tem de ser feito. O método tem de verificar se ocorreu uma exceção. Se não houve exceção, a transação é confirmada. A transação é revertida se houve uma exceção.
ru: Метод :meth:`~object.__exit__` является самым сложным, поскольку именно здесь приходится выполнять большую часть работы. Метод должен проверить, произошло ли исключение. Если исключений не было, транзакция фиксируется. Транзакция откатывается, если возникло исключение.

source: In the code below, execution will just fall off the end of the function, returning the default value of ``None``. ``None`` is false, so the exception will be re-raised automatically. If you wished, you could be more explicit and add a :keyword:`return` statement at the marked location. ::
pt_pt: No código abaixo, a execução simplesmente chegará ao fim da função, devolvendo o valor predefinido ``None``. ``None`` é falso, pelo que a exceção será gerada novamente automaticamente. Se quisesse, poderia ser mais explícito e adicionar uma instrução :keyword:`return` na localização marcada. ::
ru: В приведенном ниже коде выполнение просто прекращается с конца функции, возвращая значение по умолчанию None. ``None`` имеет значение false, поэтому исключение будет повторно вызвано автоматически. Если хотите, вы можете быть более явным и добавить оператор :keyword:`return` в отмеченном месте. ::

source: class DatabaseConnection: ... def __exit__ (self, type, value, tb): if tb is None: # No exception, so commit self.commit() else: # Exception occurred, so rollback. self.rollback() # return False
pt_pt: class DatabaseConnection: ... def __exit__ (self, type, value, tb): if tb is None: # Sem exceção, confirmar self.commit() else: # Ocorreu uma exceção, reverter. self.rollback() # return False

source: The contextlib module
pt_pt: O módulo contextlib
ru: Модуль contextlib

source: The new :mod:`contextlib` module provides some functions and a decorator that are useful for writing objects for use with the ':keyword:`with`' statement.
pt_pt: O novo módulo :mod:`contextlib` fornece algumas funções e um decorador que são úteis para escrever objetos para uso com a instrução ':keyword:`with`'.
ru: Новый модуль :mod:`contextlib` предоставляет некоторые функции и декоратор, которые полезны для написания объектов для использования с оператором ':keyword:`with`'.

source: The decorator is called :func:`contextmanager`, and lets you write a single generator function instead of defining a new class. The generator should yield exactly one value. The code up to the :keyword:`yield` will be executed as the :meth:`~object.__enter__` method, and the value yielded will be the method's return value that will get bound to the variable in the ':keyword:`with`' statement's :keyword:`!as` clause, if any. The code after the :keyword:`yield` will be executed in the :meth:`~object.__exit__` method. Any exception raised in the block will be raised by the :keyword:`!yield` statement.
pt_pt: O decorador chama-se :func:`contextmanager` e permite-lhe escrever uma única função geradora em vez de definir uma nova classe. O gerador deve produzir exatamente um valor. O código até ao :keyword:`yield` será executado como o método :meth:`~object.__enter__`, e o valor produzido será o valor de retorno do método, que será ligado à variável na cláusula :keyword:`!as` da instrução ':keyword:`with`', se existir. O código após o :keyword:`yield` será executado no método :meth:`~object.__exit__`. Qualquer exceção gerada no bloco será gerada pela instrução :keyword:`!yield`.
ru: Декоратор называется :func:`contextmanager` и позволяет вам написать одну функцию-генератор вместо определения нового класса. Генератор должен выдавать ровно одно значение. Код до :keyword:`yield` будет выполнен как метод :meth:`~object.__enter__`, а полученное значение будет возвращаемым значением метода, которое будет привязано к переменной в ':keyword: Предложение :keyword:`!as` оператора `with`', если таковое имеется. Код после :keyword:`yield` будет выполнен в методе :meth:`~object.__exit__`. Любое исключение, возникшее в блоке, будет вызвано оператором :keyword:`!yield`.

source: Our database example from the previous section could be written using this decorator as::
pt_pt: O exemplo da base de dados da secção anterior poderia ser escrito usando este decorador da seguinte forma::
ru: Наш пример базы данных из предыдущего раздела можно записать с использованием этого декоратора как:

source: The :mod:`contextlib` module also has a ``nested(mgr1, mgr2, ...)`` function that combines a number of context managers so you don't need to write nested ':keyword:`with`' statements. In this example, the single ':keyword:`!with`' statement both starts a database transaction and acquires a thread lock::
pt_pt: O módulo :mod:`contextlib` também tem uma função ``nested(mgr1, mgr2, ...)`` que combina vários gestores de contexto, para que não precise de escrever instruções ':keyword:`with`' aninhadas. Neste exemplo, a única instrução ':keyword:`!with`' inicia uma transação de base de dados e adquire um bloqueio de *thread*::
ru: Модуль :mod:`contextlib` также имеет функцию ``nested(mgr1, mgr2, ...)``, которая объединяет несколько менеджеров контекста, поэтому вам не нужно писать вложенный ':keyword:`with`' заявления. В этом примере один оператор ':keyword:`!with`' одновременно запускает транзакцию базы данных и получает блокировку потока::

source: Finally, the ``closing(object)`` function returns *object* so that it can be bound to a variable, and calls ``object.close`` at the end of the block. ::
pt_pt: Finalmente, a função ``closing(object)`` devolve *object* para que possa ser ligado a uma variável e chama ``object.close`` no final do bloco. ::
ru: Наконец, функция Closing(object) возвращает *object*, чтобы его можно было привязать к переменной, и вызывает object.close в конце блока. ::

source: :pep:`343` - The "with" statement
pt_pt: :pep:`343` - A instrução 'with'
ru: :pep:`343` - Оператор "with"

source: PEP written by Guido van Rossum and Nick Coghlan; implemented by Mike Bland, Guido van Rossum, and Neal Norwitz. The PEP shows the code generated for a ':keyword:`with`' statement, which can be helpful in learning how the statement works.
pt_pt: PEP escrita por Guido van Rossum e Nick Coghlan; implementada por Mike Bland, Guido van Rossum e Neal Norwitz. A PEP mostra o código gerado para uma instrução ':keyword:`with`', o que pode ser útil para aprender como a instrução funciona.
ru: PEP, написанный Гвидо ван Россумом и Ником Когланом; реализован Майком Блэндом, Гвидо ван Россумом и Нилом Норвицем. PEP показывает код, сгенерированный для оператора ':keyword:`with`', который может быть полезен при изучении того, как этот оператор работает.

source: The documentation for the :mod:`contextlib` module.
pt_pt: A documentação para o módulo :mod:`contextlib`.
ru: Документация для модуля :mod:`contextlib`.

source: PEP 352: Exceptions as New-Style Classes
pt_pt: PEP 352: Exceções como Classes de Novo Estilo
ru: PEP 352: Исключения как классы нового стиля

source: Exception classes can now be new-style classes, not just classic classes, and the built-in :exc:`Exception` class and all the standard built-in exceptions (:exc:`NameError`, :exc:`ValueError`, etc.) are now new-style classes.
pt_pt: As classes de exceção podem agora ser classes de novo estilo, não apenas classes clássicas, e a classe integrada :exc:`Exception` e todas as exceções integradas padrão (:exc:`NameError`, :exc:`ValueError`, etc.) são agora classes de novo estilo.
ru: Классы исключений теперь могут быть классами нового стиля, а не только классическими классами, встроенным классом :exc:`Exception` и всеми стандартными встроенными исключениями (:exc:`NameError`, :exc:`ValueError`, и т. д.) теперь являются классами нового стиля.

source: The inheritance hierarchy for exceptions has been rearranged a bit. In 2.5, the inheritance relationships are::
pt_pt: A hierarquia de herança para exceções foi um pouco reorganizada. No 2.5, as relações de herança são::
ru: Иерархия наследования исключений была немного изменена. В версии 2.5 отношения наследования следующие:

source: BaseException # New in Python 2.5 |- KeyboardInterrupt |- SystemExit |- Exception |- (all other current built-in exceptions)
pt_pt: BaseException # Novo no Python 2.5 |- KeyboardInterrupt |- SystemExit |- Exception |- (todas as outras exceções integradas atuais)

source: This rearrangement was done because people often want to catch all exceptions that indicate program errors. :exc:`KeyboardInterrupt` and :exc:`SystemExit` aren't errors, though, and usually represent an explicit action such as the user hitting :kbd:`Control-C` or code calling :func:`sys.exit`. A bare ``except:`` will catch all exceptions, so you commonly need to list :exc:`KeyboardInterrupt` and :exc:`SystemExit` in order to re-raise them. The usual pattern is::
pt_pt: Esta reorganização foi feita porque as pessoas frequentemente querem capturar todas as exceções que indicam erros de programa. :exc:`KeyboardInterrupt` e :exc:`SystemExit` não são erros, no entanto, e geralmente representam uma ação explícita, como o utilizador premir :kbd:`Control-C` ou o código chamar :func:`sys.exit`. Um ``except:`` simples capturará todas as exceções, pelo que normalmente precisa de listar :exc:`KeyboardInterrupt` e :exc:`SystemExit` para as gerar novamente. O padrão habitual é::
ru: Эта перестановка была сделана потому, что люди часто хотят перехватить все исключения, указывающие на ошибки программы. :exc:`KeyboardInterrupt` и :exc:`SystemExit`, однако, не являются ошибками и обычно представляют собой явное действие, такое как нажатие пользователем :kbd:`Control-C` или вызов кода :func:`sys.exit` . Простое ``Exception:`` перехватывает все исключения, поэтому вам обычно нужно перечислить :exc:`KeyboardInterrupt` и :exc:`SystemExit`, чтобы их повторно вызвать. Обычная схема:

source: try: ... except (KeyboardInterrupt, SystemExit): raise except: # Log error... # Continue running program...
pt_pt: try: ... except (KeyboardInterrupt, SystemExit): raise except: # Registar erro... # Continuar a executar o programa...

source: In Python 2.5, you can now write ``except Exception`` to achieve the same result, catching all the exceptions that usually indicate errors but leaving :exc:`KeyboardInterrupt` and :exc:`SystemExit` alone. As in previous versions, a bare ``except:`` still catches all exceptions.
pt_pt: No Python 2.5, pode agora escrever ``except Exception`` para obter o mesmo resultado, capturando todas as exceções que normalmente indicam erros, mas deixando :exc:`KeyboardInterrupt` e :exc:`SystemExit` de lado. Como nas versões anteriores, um ``except:`` simples ainda captura todas as exceções.
ru: В Python 2.5 вы теперь можете написать ``кроме исключений`` для достижения того же результата, перехватывая все исключения, которые обычно указывают на ошибки, но оставляя :exc:`KeyboardInterrupt` и :exc:`SystemExit` в покое. Как и в предыдущих версиях, пустое ``кроме:`` по-прежнему перехватывает все исключения.

source: The goal for Python 3.0 is to require any class raised as an exception to derive from :exc:`BaseException` or some descendant of :exc:`BaseException`, and future releases in the Python 2.x series may begin to enforce this constraint. Therefore, I suggest you begin making all your exception classes derive from :exc:`Exception` now. It's been suggested that the bare ``except:`` form should be removed in Python 3.0, but Guido van Rossum hasn't decided whether to do this or not.
pt_pt: O objetivo para o Python 3.0 é exigir que qualquer classe gerada como uma exceção derive de :exc:`BaseException` ou de algum descendente de :exc:`BaseException`, e futuras versões da série Python 2.x podem começar a impor esta restrição. Portanto, sugiro que comece a fazer com que todas as suas classes de exceção derivem de :exc:`Exception` agora. Foi sugerido que a forma ``except:`` simples deveria ser removida no Python 3.0, mas Guido van Rossum ainda não decidiu se o fará ou não.
ru: Целью Python 3.0 является требование, чтобы любой класс, созданный как исключение, производился от :exc:`BaseException` или какого-либо потомка :exc:`BaseException`, и будущие выпуски серии Python 2.x могут начать применять это ограничение. . Поэтому я предлагаю вам начать делать все ваши классы исключений производными от :exc:`Exception` прямо сейчас. Было предложено удалить пустую форму «кроме:» в Python 3.0, но Гвидо ван Россум еще не решил, делать это или нет.
