Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: A new :func:`currency` function was also added that formats a number according to the current locale's settings.
pt_pt: Foi também adicionada uma nova função :func:`currency` que formata um número de acordo com as definições da localidade atual.
ru: Также была добавлена ​​новая функция :func:`currency`, которая форматирует число в соответствии с настройками текущей локали.

source: (Contributed by Georg Brandl.)
pt_pt: (Contribuído por Georg Brandl.)
ru: (Предоставлено Георгом Брандлом.)

source: The :mod:`mailbox` module underwent a massive rewrite to add the capability to modify mailboxes in addition to reading them. A new set of classes that include :class:`mbox`, :class:`MH`, and :class:`Maildir` are used to read mailboxes, and have an ``add(message)`` method to add messages, ``remove(key)`` to remove messages, and :meth:`lock`/:meth:`unlock` to lock/unlock the mailbox. The following example converts a maildir-format mailbox into an mbox-format one::
pt_pt: O módulo :mod:`mailbox` sofreu uma reescrita massiva para adicionar a capacidade de modificar caixas de correio além de as ler. Um novo conjunto de classes que inclui :class:`mbox`, :class:`MH` e :class:`Maildir` é usado para ler caixas de correio, e tem um método ``add(message)`` para adicionar mensagens, ``remove(key)`` para remover mensagens, e :meth:`lock`/:meth:`unlock` para bloquear/desbloquear a caixa de correio. O exemplo seguinte converte uma caixa de correio no formato maildir para uma no formato mbox::
ru: Модуль :mod:`mailbox` был сильно переписан, чтобы добавить возможность изменять почтовые ящики в дополнение к их чтению. Новый набор классов, включающий :class:`mbox`, :class:`MH` и :class:`Maildir`, используется для чтения почтовых ящиков и имеет метод ``add(message)`` для добавления сообщений. ``remove(key)`` для удаления сообщений и :meth:`lock`/:meth:`unlock` для блокировки/разблокировки почтового ящика. В следующем примере почтовый ящик формата maildir преобразуется в ящик формата mbox:

source: import mailbox # 'factory=None' uses email.Message.Message as the class representing # individual messages. src = mailbox.Maildir('maildir', factory=None) dest = mailbox.mbox('/tmp/mbox') for msg in src: dest.add(msg)
pt_pt: import mailbox # 'factory=None' usa email.Message.Message como a classe que representa # mensagens individuais. src = mailbox.Maildir('maildir', factory=None) dest = mailbox.mbox('/tmp/mbox') for msg in src: dest.add(msg)

source: (Contributed by Gregory K. Johnson. Funding was provided by Google's 2005 Summer of Code.)
pt_pt: (Contribuído por Gregory K. Johnson. O financiamento foi fornecido pelo Google's 2005 Summer of Code.)
ru: (Предоставлено Грегори К. Джонсоном. Финансирование было предоставлено Google Summer of Code 2005.)

source: New module: the :mod:`!msilib` module allows creating Microsoft Installer :file:`.msi` files and CAB files. Some support for reading the :file:`.msi` database is also included. (Contributed by Martin von Löwis.)
pt_pt: Novo módulo: o módulo :mod:`!msilib` permite criar ficheiros Microsoft Installer :file:`.msi` e ficheiros CAB. Algum suporte para ler a base de dados :file:`.msi` também está incluído. (Contribuído por Martin von Löwis.)

source: The :mod:`!nis` module now supports accessing domains other than the system default domain by supplying a *domain* argument to the :func:`!nis.match` and :func:`!nis.maps` functions. (Contributed by Ben Bell.)
pt_pt: O módulo :mod:`!nis` agora suporta o acesso a domínios diferentes do domínio predefinido do sistema, fornecendo um argumento *domain* às funções :func:`!nis.match` e :func:`!nis.maps`. (Contribuído por Ben Bell.)

source: The :mod:`operator` module's :func:`itemgetter` and :func:`attrgetter` functions now support multiple fields. A call such as ``operator.attrgetter('a', 'b')`` will return a function that retrieves the :attr:`a` and :attr:`b` attributes. Combining this new feature with the :meth:`sort` method's ``key`` parameter lets you easily sort lists using multiple fields. (Contributed by Raymond Hettinger.)
pt_pt: As funções :func:`itemgetter` e :func:`attrgetter` do módulo :mod:`operator` agora suportam múltiplos campos. Uma chamada como ``operator.attrgetter('a', 'b')`` devolverá uma função que recupera os atributos :attr:`a` e :attr:`b`. Combinar esta nova funcionalidade com o parâmetro ``key`` do método :meth:`sort` permite ordenar facilmente listas usando múltiplos campos. (Contribuído por Raymond Hettinger.)
ru: Функции :func:`itemgetter` и :func:`attrgetter` модуля :mod:`operator` теперь поддерживают несколько полей. Такой вызов, как ``operator.attrgetter('a', 'b')``, вернет функцию, которая извлекает атрибуты :attr:`a` и :attr:`b`. Сочетание этой новой функции с параметром ``key`` метода :meth:`sort` позволяет легко сортировать списки, используя несколько полей. (Предоставлено Раймондом Хеттингером.)

source: The :mod:`optparse` module was updated to version 1.5.1 of the Optik library. The :class:`OptionParser` class gained an :attr:`epilog` attribute, a string that will be printed after the help message, and a :meth:`destroy` method to break reference cycles created by the object. (Contributed by Greg Ward.)
pt_pt: O módulo :mod:`optparse` foi atualizado para a versão 1.5.1 da biblioteca Optik. A classe :class:`OptionParser` ganhou um atributo :attr:`epilog`, uma *string* que será impressa após a mensagem de ajuda, e um método :meth:`destroy` para quebrar ciclos de referência criados pelo objeto. (Contribuído por Greg Ward.)
ru: Модуль :mod:`optparse` обновлен до версии 1.5.1 библиотеки Optik. Класс :class:`OptionParser` получил атрибут :attr:`epilog`, строку, которая будет напечатана после справочного сообщения, и метод :meth:`destroy` для разрыва циклов ссылок, созданных объектом. (Предоставлено Грегом Уордом.)

source: The :mod:`os` module underwent several changes. The :attr:`stat_float_times` variable now defaults to true, meaning that :func:`os.stat` will now return time values as floats. (This doesn't necessarily mean that :func:`os.stat` will return times that are precise to fractions of a second; not all systems support such precision.)
pt_pt: O módulo :mod:`os` sofreu várias alterações. A variável :attr:`stat_float_times` agora tem o valor predefinido verdadeiro, o que significa que :func:`os.stat` devolverá agora valores de tempo como floats. (Isto não significa necessariamente que :func:`os.stat` devolverá tempos precisos a frações de segundo; nem todos os sistemas suportam tal precisão.)
ru: Модуль :mod:`os` претерпел несколько изменений. Переменная :attr:`stat_float_times` теперь по умолчанию имеет значение true, а это означает, что :func:`os.stat` теперь будет возвращать значения времени в виде чисел с плавающей запятой. (Это не обязательно означает, что :func:`os.stat` будет возвращать время с точностью до долей секунды; не все системы поддерживают такую ​​точность.)

source: Constants named :const:`os.SEEK_SET`, :const:`os.SEEK_CUR`, and :const:`os.SEEK_END` have been added; these are the parameters to the :func:`os.lseek` function. Two new constants for locking are :const:`os.O_SHLOCK` and :const:`os.O_EXLOCK`.
pt_pt: Foram adicionadas constantes denominadas :const:`os.SEEK_SET`, :const:`os.SEEK_CUR` e :const:`os.SEEK_END`; estas são os parâmetros para a função :func:`os.lseek`. Duas novas constantes para bloqueio são :const:`os.O_SHLOCK` e :const:`os.O_EXLOCK`.
ru: Добавлены константы с именами :const:`os.SEEK_SET`, :const:`os.SEEK_CUR` и :const:`os.SEEK_END`; это параметры функции :func:`os.lseek`. Две новые константы для блокировки: const:`os.O_SHLOCK` и :const:`os.O_EXLOCK`.

source: Two new functions, :func:`wait3` and :func:`wait4`, were added. They're similar the :func:`waitpid` function which waits for a child process to exit and returns a tuple of the process ID and its exit status, but :func:`wait3` and :func:`wait4` return additional information. :func:`wait3` doesn't take a process ID as input, so it waits for any child process to exit and returns a 3-tuple of *process-id*, *exit-status*, *resource-usage* as returned from the :func:`resource.getrusage` function. ``wait4(pid)`` does take a process ID. (Contributed by Chad J. Schroeder.)
pt_pt: Duas novas funções, :func:`wait3` e :func:`wait4`, foram adicionadas. Elas são semelhantes à função :func:`waitpid`, que espera que um processo filho termine e devolve um tuplo do ID do processo e do seu estado de saída, mas :func:`wait3` e :func:`wait4` devolvem informações adicionais. :func:`wait3` não recebe um ID de processo como entrada, por isso espera que qualquer processo filho termine e devolve um 3-tuplo de *process-id*, *exit-status*, *resource-usage* como devolvido pela função :func:`resource.getrusage`. ``wait4(pid)`` recebe um ID de processo. (Contribuído por Chad J. Schroeder.)
ru: Были добавлены две новые функции: :func:`wait3` и :func:`wait4`. Они похожи на функцию :func:`waitpid`, которая ожидает завершения дочернего процесса и возвращает кортеж с идентификатором процесса и его статусом завершения, но :func:`wait3` и :func:`wait4` возвращают дополнительную информацию. . :func:`wait3` не принимает идентификатор процесса в качестве входных данных, поэтому он ожидает завершения любого дочернего процесса и возвращает тройной кортеж *process-id*, *exit-status*, *resource-usage* как возвращается из функции :func:`resource.getrusage`. ``wait4(pid)`` принимает идентификатор процесса. (Предоставлено Чадом Дж. Шредером.)

source: On FreeBSD, the :func:`os.stat` function now returns times with nanosecond resolution, and the returned object now has :attr:`st_gen` and :attr:`st_birthtime`. The :attr:`st_flags` attribute is also available, if the platform supports it. (Contributed by Antti Louko and Diego Pettenò.)
pt_pt: No FreeBSD, a função :func:`os.stat` agora devolve tempos com resolução de nanosegundos, e o objeto devolvido agora tem :attr:`st_gen` e :attr:`st_birthtime`. O atributo :attr:`st_flags` também está disponível, se a plataforma o suportar. (Contribuído por Antti Louko e Diego Pettenò.)
ru: Во FreeBSD функция :func:`os.stat` теперь возвращает время с наносекундным разрешением, а возвращаемый объект теперь имеет :attr:`st_gen` и :attr:`st_birthtime`. Атрибут :attr:`st_flags` также доступен, если платформа его поддерживает. (Сообщили Антти Луко и Диего Петтено.)

source: The Python debugger provided by the :mod:`pdb` module can now store lists of commands to execute when a breakpoint is reached and execution stops. Once breakpoint #1 has been created, enter ``commands 1`` and enter a series of commands to be executed, finishing the list with ``end``. The command list can include commands that resume execution, such as ``continue`` or ``next``. (Contributed by Grégoire Dooms.)
pt_pt: O depurador Python fornecido pelo módulo :mod:`pdb` pode agora armazenar listas de comandos para executar quando um ponto de interrupção é atingido e a execução para. Depois de criado o ponto de interrupção #1, introduza ``commands 1`` e introduza uma série de comandos a serem executados, terminando a lista com ``end``. A lista de comandos pode incluir comandos que retomam a execução, como ``continue`` ou ``next``. (Contribuído por Grégoire Dooms.)
ru: Отладчик Python, предоставляемый модулем :mod:`pdb`, теперь может хранить списки команд, которые необходимо выполнить при достижении точки останова и остановке выполнения. После создания точки останова №1 введите ``команды 1`` и введите серию команд, которые необходимо выполнить, завершив список словом ``end``. Список команд может включать команды, которые возобновляют выполнение, например «продолжить» или «следующий». (Предоставлено Грегуаром Думсом.)

source: The :mod:`pickle` and :mod:`!cPickle` modules no longer accept a return value of ``None`` from the :meth:`~object.__reduce__` method; the method must return a tuple of arguments instead. The ability to return ``None`` was deprecated in Python 2.4, so this completes the removal of the feature.
pt_pt: Os módulos :mod:`pickle` e :mod:`!cPickle` já não aceitam um valor de retorno ``None`` do método :meth:`~object.__reduce__`; o método deve devolver um tuplo de argumentos em vez disso. A capacidade de devolver ``None`` estava obsoleta no Python 2.4, pelo que isto completa a remoção da funcionalidade.
ru: Модули :mod:`pickle` и :mod:`!cPickle` больше не принимают возвращаемое значение ``None`` из метода :meth:`~object.__reduce__`; Вместо этого метод должен возвращать кортеж аргументов. Возможность возвращать None устарела в Python 2.4, поэтому на этом удаление этой функции завершено.

source: The :mod:`pkgutil` module, containing various utility functions for finding packages, was enhanced to support :pep:`302`'s import hooks and now also works for packages stored in ZIP-format archives. (Contributed by Phillip J. Eby.)
pt_pt: O módulo :mod:`pkgutil`, que contém várias funções utilitárias para encontrar pacotes, foi melhorado para suportar os *hooks* de importação da :pep:`302` e agora também funciona para pacotes armazenados em arquivos ZIP. (Contribuído por Phillip J. Eby.)
ru: Модуль :mod:`pkgutil`, содержащий различные служебные функции для поиска пакетов, был расширен для поддержки перехватчиков импорта :pep:`302` и теперь также работает для пакетов, хранящихся в архивах формата ZIP. (Предоставлено Филипом Дж. Эби.)

source: The pybench benchmark suite by Marc-André Lemburg is now included in the :file:`Tools/pybench` directory. The pybench suite is an improvement on the commonly used :file:`pystone.py` program because pybench provides a more detailed measurement of the interpreter's speed. It times particular operations such as function calls, tuple slicing, method lookups, and numeric operations, instead of performing many different operations and reducing the result to a single number as :file:`pystone.py` does.
pt_pt: A suíte de benchmark pybench de Marc-André Lemburg está agora incluída no diretório :file:`Tools/pybench`. A suíte pybench é uma melhoria em relação ao programa comumente usado :file:`pystone.py` porque o pybench fornece uma medição mais detalhada da velocidade do interpretador. Ele mede operações particulares como chamadas de função, fatiamento de tuplos, pesquisas de métodos e operações numéricas, em vez de realizar muitas operações diferentes e reduzir o resultado a um único número como faz o :file:`pystone.py`.
ru: Пакет тестов pybench от Марка-Андре Лембурга теперь включен в каталог :file:`Tools/pybench`. Пакет pybench является усовершенствованием широко используемой программы :file:`pystone.py`, поскольку pybench обеспечивает более детальное измерение скорости интерпретатора. Он учитывает время отдельных операций, таких как вызовы функций, нарезка кортежей, поиск методов и числовые операции, вместо того, чтобы выполнять множество различных операций и сводить результат к одному числу, как это делает :file:`pystone.py`.

source: The :mod:`pyexpat` module now uses version 2.0 of the Expat parser. (Contributed by Trent Mick.)
pt_pt: O módulo :mod:`pyexpat` agora usa a versão 2.0 do analisador Expat. (Contribuído por Trent Mick.)
ru: Модуль :mod:`pyexpat` теперь использует парсер Expat версии 2.0. (Предоставлено Трентом Миком.)

source: The :class:`~queue.Queue` class provided by the :mod:`Queue` module gained two new methods. :meth:`join` blocks until all items in the queue have been retrieved and all processing work on the items have been completed. Worker threads call the other new method, :meth:`task_done`, to signal that processing for an item has been completed. (Contributed by Raymond Hettinger.)
pt_pt: A classe :class:`~queue.Queue` fornecida pelo módulo :mod:`Queue` ganhou dois novos métodos. :meth:`join` bloqueia até que todos os itens na fila tenham sido recuperados e todo o trabalho de processamento nos itens tenha sido concluído. As *threads* de trabalho chamam o outro novo método, :meth:`task_done`, para sinalizar que o processamento de um item foi concluído. (Contribuído por Raymond Hettinger.)
ru: Класс :class:`~queue.Queue`, предоставляемый модулем :mod:`Queue`, получил два новых метода. :meth:`join` блокируется до тех пор, пока все элементы в очереди не будут извлечены и вся работа по обработке элементов не будет завершена. Рабочие потоки вызывают другой новый метод, :meth:`task_done`, чтобы сигнализировать о завершении обработки элемента. (Предоставлено Раймондом Хеттингером.)

source: The old :mod:`regex` and :mod:`regsub` modules, which have been deprecated ever since Python 2.0, have finally been deleted. Other deleted modules: :mod:`statcache`, :mod:`tzparse`, :mod:`whrandom`.
pt_pt: Os antigos módulos :mod:`regex` e :mod:`regsub`, que estão obsoletos desde o Python 2.0, foram finalmente eliminados. Outros módulos eliminados: :mod:`statcache`, :mod:`tzparse`, :mod:`whrandom`.
ru: Старые модули :mod:`regex` и :mod:`regsub`, которые устарели со времен Python 2.0, наконец-то были удалены. Другие удаленные модули: :mod:`statcache`, :mod:`tzparse`, :mod:`whrandom`.

source: Also deleted: the :file:`lib-old` directory, which includes ancient modules such as :mod:`dircmp` and :mod:`ni`, was removed. :file:`lib-old` wasn't on the default ``sys.path``, so unless your programs explicitly added the directory to ``sys.path``, this removal shouldn't affect your code.
pt_pt: Também eliminado: o diretório :file:`lib-old`, que incluía módulos antigos como :mod:`dircmp` e :mod:`ni`, foi removido. :file:`lib-old` não estava no ``sys.path`` predefinido, pelo que, a menos que os seus programas adicionassem explicitamente o diretório ao ``sys.path``, esta remoção não deve afetar o seu código.
ru: Также удалено: удален каталог :file:`lib-old`, который включает древние модули, такие как :mod:`dircmp` и :mod:`ni`. :file:`lib-old` не находился в ``sys.path`` по умолчанию, поэтому, если ваши программы явно не добавили каталог в ``sys.path``, это удаление не должно повлиять на ваш код.

source: The :mod:`rlcompleter` module is no longer dependent on importing the :mod:`readline` module and therefore now works on non-Unix platforms. (Patch from Robert Kiendl.)
pt_pt: O módulo :mod:`rlcompleter` já não depende da importação do módulo :mod:`readline` e, portanto, agora funciona em plataformas não-Unix. (Patch de Robert Kiendl.)
ru: Модуль :mod:`rlcompleter` больше не зависит от импорта модуля :mod:`readline` и поэтому теперь работает на платформах, отличных от Unix. (Патч от Роберта Киндла.)

source: The :mod:`SimpleXMLRPCServer <xmlrpc.server>` and :mod:`DocXMLRPCServer <xmlrpc.server>` classes now have a :attr:`rpc_paths` attribute that constrains XML-RPC operations to a limited set of URL paths; the default is to allow only ``'/'`` and ``'/RPC2'``. Setting :attr:`rpc_paths` to ``None`` or an empty tuple disables this path checking.
pt_pt: As classes :mod:`SimpleXMLRPCServer <xmlrpc.server>` e :mod:`DocXMLRPCServer <xmlrpc.server>` têm agora um atributo :attr:`rpc_paths` que restringe as operações XML-RPC a um conjunto limitado de caminhos de URL; o predefinido é permitir apenas ``'/'`` e ``'/RPC2'``. Definir :attr:`rpc_paths` para ``None`` ou um tuplo vazio desativa esta verificação de caminho.
ru: Классы :mod:`SimpleXMLRPCServer <xmlrpc.server>` и :mod:`DocXMLRPCServer <xmlrpc.server>` теперь имеют атрибут :attr:`rpc_paths`, который ограничивает операции XML-RPC ограниченным набором URL-путей; по умолчанию разрешены только ``'/'`` и ``'/RPC2'``. Установка :attr:`rpc_paths` в ``None`` или пустой кортеж отключает эту проверку пути.

source: The :mod:`socket` module now supports :const:`AF_NETLINK` sockets on Linux, thanks to a patch from Philippe Biondi. Netlink sockets are a Linux-specific mechanism for communications between a user-space process and kernel code; an introductory article about them is at https://www.linuxjournal.com/article/7356. In Python code, netlink addresses are represented as a tuple of 2 integers, ``(pid, group_mask)``.
pt_pt: O módulo :mod:`socket` agora suporta sockets :const:`AF_NETLINK` no Linux, graças a um patch de Philippe Biondi. Os sockets Netlink são um mecanismo específico do Linux para comunicações entre um processo no espaço do utilizador e código do kernel; um artigo introdutório sobre eles está em https://www.linuxjournal.com/article/7356. No código Python, os endereços netlink são representados como um tuplo de 2 inteiros, ``(pid, group_mask)``.
ru: Модуль :mod:`socket` теперь поддерживает сокеты :const:`AF_NETLINK` в Linux благодаря патчу от Филиппа Бионди. Сокеты Netlink — это специфичный для Linux механизм связи между процессом пользовательского пространства и кодом ядра; вводную статью о них можно найти по адресу https://www.linuxjournal.com/article/7356. В коде Python адреса сетевых ссылок представлены как кортеж из двух целых чисел ``(pid, group_mask)``.

source: Two new methods on socket objects, ``recv_into(buffer)`` and ``recvfrom_into(buffer)``, store the received data in an object that supports the buffer protocol instead of returning the data as a string. This means you can put the data directly into an array or a memory-mapped file.
pt_pt: Dois novos métodos em objetos de socket, ``recv_into(buffer)`` e ``recvfrom_into(buffer)``, armazenam os dados recebidos num objeto que suporta o protocolo de buffer em vez de devolver os dados como uma *string*. Isto significa que pode colocar os dados diretamente num array ou num ficheiro mapeado em memória.
ru: Два новых метода для объектов сокета, «recv_into(buffer)» и «recvfrom_into(buffer)», сохраняют полученные данные в объекте, который поддерживает протокол буфера, вместо того, чтобы возвращать данные в виде строки. Это означает, что вы можете поместить данные непосредственно в массив или файл, отображаемый в памяти.

source: Socket objects also gained :meth:`getfamily`, :meth:`gettype`, and :meth:`getproto` accessor methods to retrieve the family, type, and protocol values for the socket.
pt_pt: Os objetos de socket também ganharam métodos de acesso :meth:`getfamily`, :meth:`gettype` e :meth:`getproto` para recuperar os valores de família, tipo e protocolo do socket.
ru: Объекты сокетов также получили методы доступа :meth:`getfamily`, :meth:`gettype` и :meth:`getproto` для получения значений семейства, типа и протокола для сокета.

source: New module: the :mod:`!spwd` module provides functions for accessing the shadow password database on systems that support shadow passwords.
pt_pt: Novo módulo: o módulo :mod:`!spwd` fornece funções para aceder à base de dados de palavras-passe shadow em sistemas que suportam palavras-passe shadow.
