Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: Don't forget to use :func:`~ctypes.py_object`; if it's omitted you end up with a segmentation fault.
pt_pt: Não se esqueça de usar :func:`~ctypes.py_object`; se for omitido, acabará com um erro de segmentação.

source: :mod:`ctypes` has been around for a while, but people still write and distribution hand-coded extension modules because you can't rely on :mod:`ctypes` being present. Perhaps developers will begin to write Python wrappers atop a library accessed through :mod:`ctypes` instead of extension modules, now that :mod:`ctypes` is included with core Python.
pt_pt: :mod:`ctypes` existe há algum tempo, mas as pessoas ainda escrevem e distribuem módulos de extensão codificados manualmente porque não se pode confiar que :mod:`ctypes` esteja presente. Talvez os programadores comecem a escrever *wrappers* Python sobre uma biblioteca acedida através de :mod:`ctypes` em vez de módulos de extensão, agora que :mod:`ctypes` está incluído no Python principal.
ru: :mod:`ctypes` существует уже некоторое время, но люди до сих пор пишут и распространяют модули расширения, написанные вручную, потому что нельзя полагаться на присутствие :mod:`ctypes`. Возможно, разработчики начнут писать оболочки Python поверх библиотеки, доступ к которой осуществляется через :mod:`ctypes` вместо модулей расширения, теперь, когда :mod:`ctypes` включен в ядро ​​Python.

source: The pre-stdlib ctypes web page, with a tutorial, reference, and FAQ.
pt_pt: A página web do ctypes pré-biblioteca padrão, com um tutorial, referência e FAQ.
ru: Веб-страница ctypes до stdlib с руководством, справкой и часто задаваемыми вопросами.

source: The documentation for the :mod:`ctypes` module.
pt_pt: A documentação para o módulo :mod:`ctypes`.
ru: Документация для модуля :mod:`ctypes`.

source: The ElementTree package
pt_pt: O pacote ElementTree
ru: Пакет ElementTree

source: A subset of Fredrik Lundh's ElementTree library for processing XML has been added to the standard library as :mod:`xml.etree`. The available modules are :mod:`ElementTree`, :mod:`ElementPath`, and :mod:`ElementInclude` from ElementTree 1.2.6. The :mod:`cElementTree` accelerator module is also included.
pt_pt: Um subconjunto da biblioteca ElementTree de Fredrik Lundh para processamento de XML foi adicionado à biblioteca padrão como :mod:`xml.etree`. Os módulos disponíveis são :mod:`ElementTree`, :mod:`ElementPath` e :mod:`ElementInclude` do ElementTree 1.2.6. O módulo acelerador :mod:`cElementTree` também está incluído.
ru: Подмножество библиотеки ElementTree Фредрика Лунда для обработки XML было добавлено в стандартную библиотеку как :mod:`xml.etree`. Доступные модули: :mod:`ElementTree`, :mod:`ElementPath` и :mod:`ElementInclude` из ElementTree 1.2.6. Также включен модуль ускорителя :mod:`cElementTree`.

source: The rest of this section will provide a brief overview of using ElementTree. Full documentation for ElementTree is available at https://web.archive.org/web/20201124024954/http://effbot.org/zone/element-index.htm.
pt_pt: O resto desta secção fornecerá uma breve visão geral do uso do ElementTree. A documentação completa para o ElementTree está disponível em https://web.archive.org/web/20201124024954/http://effbot.org/zone/element-index.htm.
ru: В оставшейся части этого раздела будет представлен краткий обзор использования ElementTree. Полная документация по ElementTree доступна по адресу https://web.archive.org/web/20201124024954/http://effbot.org/zone/element-index.htm.

source: ElementTree represents an XML document as a tree of element nodes. The text content of the document is stored as the :attr:`text` and :attr:`tail` attributes of (This is one of the major differences between ElementTree and the Document Object Model; in the DOM there are many different types of node, including :class:`TextNode`.)
pt_pt: O ElementTree representa um documento XML como uma árvore de nós de elementos. O conteúdo de texto do documento é armazenado como os atributos :attr:`text` e :attr:`tail` (Esta é uma das principais diferenças entre o ElementTree e o Modelo de Objeto de Documento; no DOM, existem muitos tipos diferentes de nós, incluindo :class:`TextNode`.)
ru: ElementTree представляет XML-документ как дерево узлов элементов. Текстовое содержимое документа хранится в виде атрибутов :attr:`text` и :attr:`tail` (это одно из основных отличий между ElementTree и объектной моделью документа; в DOM существует множество различных типов узел, включая :class:`TextNode`.)

source: The most commonly used parsing function is :func:`parse`, that takes either a string (assumed to contain a filename) or a file-like object and returns an :class:`ElementTree` instance::
pt_pt: A função de análise mais comumente usada é :func:`parse`, que aceita uma *string* (assumida como contendo um nome de ficheiro) ou um objeto tipo ficheiro e devolve uma instância :class:`ElementTree`::
ru: Наиболее часто используемой функцией синтаксического анализа является :func:`parse`, которая принимает либо строку (предположительно содержащую имя файла), либо объект, подобный файлу, и возвращает экземпляр :class:`ElementTree`::

source: Once you have an :class:`ElementTree` instance, you can call its :meth:`getroot` method to get the root :class:`Element` node.
pt_pt: Uma vez que tenha uma instância :class:`ElementTree`, pode chamar o seu método :meth:`getroot` para obter o nó raiz :class:`Element`.
ru: Если у вас есть экземпляр :class:`ElementTree`, вы можете вызвать его метод :meth:`getroot`, чтобы получить корневой узел :class:`Element`.

source: There's also an :func:`XML` function that takes a string literal and returns an :class:`Element` node (not an :class:`ElementTree`). This function provides a tidy way to incorporate XML fragments, approaching the convenience of an XML literal::
pt_pt: Também existe uma função :func:`XML` que recebe um literal de *string* e devolve um nó :class:`Element` (não um :class:`ElementTree`). Esta função fornece uma forma organizada de incorporar fragmentos XML, aproximando-se da conveniência de um literal XML::
ru: Существует также функция :func:`XML`, которая принимает строковый литерал и возвращает узел :class:`Element` (а не :class:`ElementTree`). Эта функция обеспечивает удобный способ включения фрагментов XML, по удобству приближающийся к литералу XML:

source: Each XML element supports some dictionary-like and some list-like access methods. Dictionary-like operations are used to access attribute values, and list-like operations are used to access child nodes.
pt_pt: Cada elemento XML suporta alguns métodos de acesso semelhantes a dicionários e alguns semelhantes a listas. Operações semelhantes a dicionários são usadas para aceder a valores de atributos, e operações semelhantes a listas são usadas para aceder a nós filhos.
ru: Каждый элемент XML поддерживает некоторые методы доступа, подобные словарю, и некоторые методы доступа, подобные спискам. Операции, подобные словарю, используются для доступа к значениям атрибутов, а операции, подобные спискам, используются для доступа к дочерним узлам.

source: Operation
pt_pt: Operação
ru: Операция

source: Result
pt_pt: Resultado
ru: Результат

source: Returns n'th child element.
pt_pt: Devolve o n-ésimo elemento filho.
ru: Возвращает n-й дочерний элемент.

source: Returns list of m'th through n'th child elements.
pt_pt: Devolve uma lista dos elementos filhos do m-ésimo ao n-ésimo.
ru: Возвращает список дочерних элементов от m до n.

source: Returns number of child elements.
pt_pt: Devolve o número de elementos filhos.
ru: Возвращает количество дочерних элементов.

source: Returns list of child elements.
pt_pt: Devolve uma lista de elementos filhos.
ru: Возвращает список дочерних элементов.

source: Adds *elem2* as a child.
pt_pt: Adiciona *elem2* como filho.
ru: Добавляет *elem2* в качестве дочернего элемента.

source: Inserts *elem2* at the specified location.
pt_pt: Insere *elem2* na localização especificada.
ru: Вставляет *elem2* в указанное место.

source: Deletes n'th child element.
pt_pt: Elimina o n-ésimo elemento filho.
ru: Удаляет n-й дочерний элемент.

source: Returns list of attribute names.
pt_pt: Devolve uma lista de nomes de atributos.
ru: Возвращает список имен атрибутов.

source: Returns value of attribute *name*.
pt_pt: Devolve o valor do atributo *name*.
ru: Возвращает значение атрибута *имя*.

source: Sets new value for attribute *name*.
pt_pt: Define um novo valor para o atributo *name*.
ru: Устанавливает новое значение атрибута *имя*.

source: Retrieves the dictionary containing attributes.
pt_pt: Recupera o dicionário que contém os atributos.
ru: Извлекает словарь, содержащий атрибуты.

source: Deletes attribute *name*.
pt_pt: Elimina o atributo *name*.
ru: Удаляет атрибут *имя*.

source: Comments and processing instructions are also represented as :class:`Element` nodes. To check if a node is a comment or processing instructions::
pt_pt: Comentários e instruções de processamento também são representados como nós :class:`Element`. Para verificar se um nó é um comentário ou instruções de processamento::
ru: Комментарии и инструкции обработки также представлены как узлы :class:`Element`. Чтобы проверить, является ли узел комментарием или инструкциями по обработке:

source: To generate XML output, you should call the :meth:`ElementTree.write` method. Like :func:`parse`, it can take either a string or a file-like object::
pt_pt: Para gerar saída XML, deve chamar o método :meth:`ElementTree.write`. Tal como :func:`parse`, pode aceitar uma *string* ou um objeto tipo ficheiro::
ru: Чтобы сгенерировать вывод XML, вам следует вызвать метод :meth:`ElementTree.write`. Как и :func:`parse`, он может принимать либо строку, либо файловый объект::

source: # Encoding is US-ASCII tree.write('output.xml') # Encoding is UTF-8 f = open('output.xml', 'w') tree.write(f, encoding='utf-8')
pt_pt: # Codificação é US-ASCII tree.write('output.xml') # Codificação é UTF-8 f = open('output.xml', 'w') tree.write(f, encoding='utf-8')

source: (Caution: the default encoding used for output is ASCII. For general XML work, where an element's name may contain arbitrary Unicode characters, ASCII isn't a very useful encoding because it will raise an exception if an element's name contains any characters with values greater than 127. Therefore, it's best to specify a different encoding such as UTF-8 that can handle any Unicode character.)
pt_pt: (Atenção: a codificação predefinida usada para saída é ASCII. Para trabalho XML geral, onde o nome de um elemento pode conter caracteres Unicode arbitrários, ASCII não é uma codificação muito útil porque gerará uma exceção se o nome de um elemento contiver quaisquer caracteres com valores superiores a 127. Portanto, é melhor especificar uma codificação diferente, como UTF-8, que pode lidar com qualquer caractere Unicode.)
ru: (Внимание: для вывода по умолчанию используется кодировка ASCII. Для общей работы с XML, где имя элемента может содержать произвольные символы Юникода, ASCII не очень полезна, поскольку она вызовет исключение, если имя элемента содержит какие-либо символы со значениями. больше 127. Поэтому лучше указать другую кодировку, например UTF-8, которая может обрабатывать любые символы Юникода.)

source: This section is only a partial description of the ElementTree interfaces. Please read the package's official documentation for more details.
pt_pt: Esta secção é apenas uma descrição parcial das interfaces do ElementTree. Consulte a documentação oficial do pacote para mais detalhes.
ru: Этот раздел представляет собой лишь частичное описание интерфейсов ElementTree. Пожалуйста, прочитайте официальную документацию пакета для получения более подробной информации.

source: Official documentation for ElementTree.
pt_pt: Documentação oficial para o ElementTree.
ru: Официальная документация ElementTree.

source: The hashlib package
pt_pt: O pacote hashlib
ru: Пакет hashlib

source: A new :mod:`hashlib` module, written by Gregory P. Smith, has been added to replace the :mod:`!md5` and :mod:`!sha` modules. :mod:`hashlib` adds support for additional secure hashes (SHA-224, SHA-256, SHA-384, and SHA-512). When available, the module uses OpenSSL for fast platform optimized implementations of algorithms.
pt_pt: Um novo módulo :mod:`hashlib`, escrito por Gregory P. Smith, foi adicionado para substituir os módulos :mod:`!md5` e :mod:`!sha`. :mod:`hashlib` adiciona suporte para *hashes* de segurança adicionais (SHA-224, SHA-256, SHA-384 e SHA-512). Quando disponível, o módulo usa OpenSSL para implementações otimizadas de algoritmos rápidos para a plataforma.
ru: Новый модуль :mod:`hashlib`, написанный Грегори П. Смитом, был добавлен для замены модулей :mod:`!md5` и :mod:`!sha`. :mod:`hashlib` добавляет поддержку дополнительных безопасных хешей (SHA-224, SHA-256, SHA-384 и SHA-512). Если модуль доступен, он использует OpenSSL для быстрой реализации алгоритмов, оптимизированных для платформы.

source: The old :mod:`!md5` and :mod:`!sha` modules still exist as wrappers around hashlib to preserve backwards compatibility. The new module's interface is very close to that of the old modules, but not identical. The most significant difference is that the constructor functions for creating new hashing objects are named differently. ::
pt_pt: Os antigos módulos :mod:`!md5` e :mod:`!sha` ainda existem como *wrappers* em torno do hashlib para preservar a compatibilidade retroativa. A interface do novo módulo é muito próxima da dos antigos módulos, mas não idêntica. A diferença mais significativa é que as funções construtoras para criar novos objetos de *hash* têm nomes diferentes. ::
ru: Старые модули :mod:`!md5` и :mod:`!sha` до сих пор существуют как обертки вокруг hashlib для сохранения обратной совместимости. Интерфейс нового модуля очень близок к интерфейсу старых модулей, но не идентичен. Наиболее существенное отличие состоит в том, что функции-конструкторы для создания новых объектов хеширования называются по-другому. ::

source: # Old versions h = md5.md5() h = md5.new() # New version h = hashlib.md5() # Old versions h = sha.sha() h = sha.new() # New version h = hashlib.sha1() # Hash that weren't previously available h = hashlib.sha224() h = hashlib.sha256() h = hashlib.sha384() h = hashlib.sha512() # Alternative form h = hashlib.new('md5') # Provide algorithm as a string
pt_pt: # Versões antigas h = md5.md5() h = md5.new() # Nova versão h = hashlib.md5() # Versões antigas h = sha.sha() h = sha.new() # Nova versão h = hashlib.sha1() # *Hashes* que não estavam anteriormente disponíveis h = hashlib.sha224() h = hashlib.sha256() h = hashlib.sha384() h = hashlib.sha512() # Forma alternativa h = hashlib.new('md5') # Fornecer algoritmo como uma *string*

source: Once a hash object has been created, its methods are the same as before: ``update(string)`` hashes the specified string into the current digest state, :meth:`digest` and :meth:`hexdigest` return the digest value as a binary string or a string of hex digits, and :meth:`copy` returns a new hashing object with the same digest state.
pt_pt: Uma vez criado um objeto de *hash*, os seus métodos são os mesmos de antes: ``update(string)`` faz o *hash* da *string* especificada no estado atual do resumo, :meth:`digest` e :meth:`hexdigest` devolvem o valor do resumo como uma *string* binária ou uma *string* de dígitos hexadecimais, e :meth:`copy` devolve um novo objeto de *hash* com o mesmo estado de resumo.
ru: После создания хеш-объекта его методы такие же, как и раньше: ``update(string)`` хеширует указанную строку в текущее состояние дайджеста, :meth:`digest` и :meth:`hexdigest` возвращают дайджест. значение в виде двоичной строки или строки шестнадцатеричных цифр, а :meth:`copy` возвращает новый хеш-объект с тем же состоянием дайджеста.

source: The documentation for the :mod:`hashlib` module.
pt_pt: A documentação para o módulo :mod:`hashlib`.
ru: Документация для модуля :mod:`hashlib`.

source: The sqlite3 package
pt_pt: O pacote sqlite3
ru: Пакет sqlite3

source: The pysqlite module (https://www.pysqlite.org), a wrapper for the SQLite embedded database, has been added to the standard library under the package name :mod:`sqlite3`.
pt_pt: O módulo pysqlite (https://www.pysqlite.org), um *wrapper* para a base de dados embutida SQLite, foi adicionado à biblioteca padrão com o nome de pacote :mod:`sqlite3`.
ru: Модуль pysqlite (https://www.pysqlite.org), оболочка для встроенной базы данных SQLite, был добавлен в стандартную библиотеку под именем пакета :mod:`sqlite3`.

source: SQLite is a C library that provides a lightweight disk-based database that doesn't require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It's also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.
pt_pt: SQLite é uma biblioteca C que fornece uma base de dados baseada em disco leve que não requer um processo de servidor separado e permite aceder à base de dados usando uma variante não padrão da linguagem de consulta SQL. Algumas aplicações podem usar SQLite para armazenamento interno de dados. Também é possível prototipar uma aplicação usando SQLite e depois portar o código para uma base de dados maior, como PostgreSQL ou Oracle.
ru: SQLite - это библиотека на языке C, предоставляющая легкую дисковую базу данных, не требующую отдельного серверного процесса и позволяющую обращаться к базе данных с помощью нестандартного варианта языка запросов SQL. Некоторые приложения могут использовать SQLite для внутреннего хранения данных. Также можно создать прототип приложения с использованием SQLite, а затем перенести код на более крупную базу данных, такую как PostgreSQL или Oracle.

source: pysqlite was written by Gerhard Häring and provides a SQL interface compliant with the DB-API 2.0 specification described by :pep:`249`.
pt_pt: O pysqlite foi escrito por Gerhard Häring e fornece uma interface SQL compatível com a especificação DB-API 2.0 descrita na :pep:`249`.
ru: pysqlite был написан Герхардом Херингом и предоставляет интерфейс SQL, совместимый со спецификацией DB-API 2.0, описанной :pep:`249`.

source: If you're compiling the Python source yourself, note that the source tree doesn't include the SQLite code, only the wrapper module. You'll need to have the SQLite libraries and headers installed before compiling Python, and the build process will compile the module when the necessary headers are available.
pt_pt: Se estiver a compilar o código-fonte do Python, note que a árvore de origem não inclui o código SQLite, apenas o módulo *wrapper*. Precisará de ter as bibliotecas e cabeçalhos do SQLite instalados antes de compilar o Python, e o processo de compilação compilará o módulo quando os cabeçalhos necessários estiverem disponíveis.
ru: Если вы компилируете исходный код Python самостоятельно, обратите внимание, что дерево исходного кода не включает код SQLite, а только модуль-оболочку. Перед компиляцией Python вам необходимо установить библиотеки и заголовки SQLite, а процесс сборки скомпилирует модуль, когда будут доступны необходимые заголовки.

source: To use the module, you must first create a :class:`Connection` object that represents the database. Here the data will be stored in the :file:`/tmp/example` file::
pt_pt: Para usar o módulo, deve primeiro criar um objeto :class:`Connection` que representa a base de dados. Aqui, os dados serão armazenados no ficheiro :file:`/tmp/example`::
ru: Чтобы использовать модуль, вы должны сначала создать объект :class:`Connection`, который представляет базу данных. Здесь данные будут храниться в файле :file:`/tmp/example`::

source: You can also supply the special name ``:memory:`` to create a database in RAM.
pt_pt: Também pode fornecer o nome especial ``:memory:`` para criar uma base de dados em RAM.
ru: Вы также можете указать специальное имя ``:memory:`` для создания базы данных в оперативной памяти.

source: Once you have a :class:`Connection`, you can create a :class:`Cursor` object and call its :meth:`execute` method to perform SQL commands::
pt_pt: Uma vez que tenha uma :class:`Connection`, pode criar um objeto :class:`Cursor` e chamar o seu método :meth:`execute` para executar comandos SQL::
ru: Если у вас есть :class:`Connection`, вы можете создать объект :class:`Cursor` и вызвать его метод :meth:`execute` для выполнения команд SQL::

source: c = conn.cursor() # Create table c.execute('''create table stocks (date text, trans text, symbol text, qty real, price real)''') # Insert a row of data c.execute("""insert into stocks values ('2006-01-05','BUY','RHAT',100,35.14)""")
pt_pt: c = conn.cursor() # Criar tabela c.execute('''create table stocks (date text, trans text, symbol text, qty real, price real)''') # Inserir uma linha de dados c.execute("""insert into stocks values ('2006-01-05','COMPRA','RHAT',100,35.14)""")

source: Usually your SQL operations will need to use values from Python variables. You shouldn't assemble your query using Python's string operations because doing so is insecure; it makes your program vulnerable to an SQL injection attack.
pt_pt: Normalmente, as suas operações SQL precisarão de usar valores de variáveis Python. Não deve montar a sua consulta usando operações de *string* do Python porque fazer isso é inseguro; torna o seu programa vulnerável a um ataque de injeção SQL.
ru: Обычно ваши операции SQL должны использовать значения переменных Python. Не следует собирать запрос с использованием строковых операций Python, поскольку это небезопасно; это делает вашу программу уязвимой для атаки SQL-инъекцией.

source: Instead, use the DB-API's parameter substitution. Put ``?`` as a placeholder wherever you want to use a value, and then provide a tuple of values as the second argument to the cursor's :meth:`execute` method. (Other database modules may use a different placeholder, such as ``%s`` or ``:1``.) For example::
pt_pt: Em vez disso, use a substituição de parâmetros da DB-API. Coloque ``?`` como um espaço reservado onde quiser usar um valor, e depois forneça um tuplo de valores como segundo argumento para o método :meth:`execute` do cursor. (Outros módulos de base de dados podem usar um espaço reservado diferente, como ``%s`` ou ``:1``.) Por exemplo::
ru: Вместо этого используйте подстановку параметров DB-API. Поместите ``?`` в качестве заполнителя везде, где вы хотите использовать значение, а затем укажите кортеж значений в качестве второго аргумента для метода :meth:`execute` курсора. (Другие модули базы данных могут использовать другой заполнитель, например `` %s `` или ``:1``.) Например::

source: # Never do this -- insecure! symbol = 'IBM' c.execute("... where symbol = '%s'" % symbol) # Do this instead t = (symbol,) c.execute('select * from stocks where symbol=?', t) # Larger example for t in (('2006-03-28', 'BUY', 'IBM', 1000, 45.00), ('2006-04-05', 'BUY', 'MSOFT', 1000, 72.00), ('2006-04-06', 'SELL', 'IBM', 500, 53.00), ): c.execute('insert into stocks values (?,?,?,?,?)', t)
pt_pt: # Nunca faça isto -- inseguro! symbol = 'IBM' c.execute("... where symbol = '%s'" % symbol) # Faça isto em vez disso t = (symbol,) c.execute('select * from stocks where symbol=?', t) # Exemplo maior for t in (('2006-03-28', 'COMPRA', 'IBM', 1000, 45.00), ('2006-04-05', 'COMPRA', 'MSOFT', 1000, 72.00), ('2006-04-06', 'VENDA', 'IBM', 500, 53.00), ): c.execute('insert into stocks values (?,?,?,?,?)', t)
