Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: Python 2.5 adds a simple way to pass values *into* a generator. As introduced in Python 2.3, generators only produce output; once a generator's code was invoked to create an iterator, there was no way to pass any new information into the function when its execution is resumed. Sometimes the ability to pass in some information would be useful. Hackish solutions to this include making the generator's code look at a global variable and then changing the global variable's value, or passing in some mutable object that callers then modify.
pt_pt: O Python 2.5 adiciona uma forma simples de passar valores *para* um gerador. Como introduzido no Python 2.3, os geradores apenas produzem saída; uma vez que o código de um gerador era invocado para criar um iterador, não havia forma de passar qualquer nova informação para a função quando a sua execução era retomada. Às vezes, a capacidade de passar alguma informação seria útil. Soluções *hackish* para isto incluem fazer com que o código do gerador olhe para uma variável global e depois alterar o valor da variável global, ou passar algum objeto mutável que os chamadores depois modificam.
ru: В Python 2.5 добавлен простой способ передачи значений *в* генератор. Как было представлено в Python 2.3, генераторы производят только выходные данные; как только код генератора был вызван для создания итератора, не было возможности передать какую-либо новую информацию в функцию при возобновлении ее выполнения. Иногда возможность передавать некоторую информацию может оказаться полезной. Хакерские решения этой проблемы включают в себя заставить код генератора просматривать глобальную переменную, а затем изменять значение глобальной переменной или передавать некоторый изменяемый объект, который затем модифицируют вызывающие программы.

source: To refresh your memory of basic generators, here's a simple example::
pt_pt: Para refrescar a sua memória sobre geradores básicos, aqui está um exemplo simples::
ru: Чтобы освежить вашу память об основных генераторах, вот простой пример:

source: When you call ``counter(10)``, the result is an iterator that returns the values from 0 up to 9. On encountering the :keyword:`yield` statement, the iterator returns the provided value and suspends the function's execution, preserving the local variables. Execution resumes on the following call to the iterator's :meth:`next` method, picking up after the :keyword:`!yield` statement.
pt_pt: Quando chama ``counter(10)``, o resultado é um iterador que devolve os valores de 0 a 9. Ao encontrar a instrução :keyword:`yield`, o iterador devolve o valor fornecido e suspende a execução da função, preservando as variáveis locais. A execução retoma na chamada seguinte ao método :meth:`next` do iterador, continuando após a instrução :keyword:`!yield`.
ru: Когда вы вызываете ``counter(10)``, результатом является итератор, который возвращает значения от 0 до 9. При обнаружении оператора :keyword:`yield` итератор возвращает предоставленное значение и приостанавливает выполнение функции. сохранение локальных переменных. Выполнение возобновляется после следующего вызова метода итератора :meth:`next`, который начинается после оператора :keyword:`!yield`.

source: In Python 2.3, :keyword:`yield` was a statement; it didn't return any value. In 2.5, :keyword:`!yield` is now an expression, returning a value that can be assigned to a variable or otherwise operated on::
pt_pt: No Python 2.3, :keyword:`yield` era uma instrução; não devolvia nenhum valor. No 2.5, :keyword:`!yield` é agora uma expressão, devolvendo um valor que pode ser atribuído a uma variável ou operado de outra forma::
ru: В Python 2.3 :keyword:`yield` был оператором; он не вернул никакого значения. В версии 2.5 :keyword:`!yield` теперь является выражением, возвращающим значение, которое можно присвоить переменной или иным образом обработать::

source: I recommend that you always put parentheses around a :keyword:`yield` expression when you're doing something with the returned value, as in the above example. The parentheses aren't always necessary, but it's easier to always add them instead of having to remember when they're needed.
pt_pt: Recomendo que coloque sempre parênteses à volta de uma expressão :keyword:`yield` quando estiver a fazer algo com o valor devolvido, como no exemplo acima. Os parênteses nem sempre são necessários, mas é mais fácil adicioná-los sempre em vez de ter de se lembrar quando são necessários.
ru: Я рекомендую вам всегда заключать выражение :keyword:`yield` в круглые скобки, когда вы что-то делаете с возвращаемым значением, как в приведенном выше примере. Круглые скобки не всегда необходимы, но их легче всегда добавлять, чем запоминать, когда они потребуются.

source: (:pep:`342` explains the exact rules, which are that a :keyword:`yield`\ -expression must always be parenthesized except when it occurs at the top-level expression on the right-hand side of an assignment. This means you can write ``val = yield i`` but have to use parentheses when there's an operation, as in ``val = (yield i) + 12``.)
pt_pt: (A :pep:`342` explica as regras exatas, que são que uma expressão :keyword:`yield` deve sempre ser colocada entre parênteses, exceto quando ocorre como expressão de nível superior no lado direito de uma atribuição. Isto significa que pode escrever ``val = yield i``, mas tem de usar parênteses quando há uma operação, como em ``val = (yield i) + 12``.)
ru: (:pep:`342` объясняет точные правила, которые заключаются в том, что :keyword:`yield`\ -выражение всегда должно быть заключено в круглые скобки, за исключением случаев, когда оно встречается в выражении верхнего уровня в правой части присваивания. Это означает, что вы можете написать ``val = yield i``, но при выполнении операции вам придется использовать круглые скобки, как в ``val = (yield i) + 12``.)

source: Values are sent into a generator by calling its ``send(value)`` method. The generator's code is then resumed and the :keyword:`yield` expression returns the specified *value*. If the regular :meth:`next` method is called, the :keyword:`!yield` returns :const:`None`.
pt_pt: Os valores são enviados para um gerador chamando o seu método ``send(value)``. O código do gerador é então retomado e a expressão :keyword:`yield` devolve o *valor* especificado. Se o método :meth:`next` normal for chamado, o :keyword:`!yield` devolve :const:`None`.
ru: Значения отправляются в генератор путем вызова его метода send(value). Затем работа генератора возобновляется, и выражение :keyword:`yield` возвращает указанное *значение*. Если вызывается обычный метод :meth:`next`, :keyword:`!yield` возвращает :const:`None`.

source: Here's the previous example, modified to allow changing the value of the internal counter. ::
pt_pt: Aqui está o exemplo anterior, modificado para permitir alterar o valor do contador interno. ::
ru: Вот предыдущий пример, измененный, чтобы можно было изменять значение внутреннего счетчика. ::

source: def counter (maximum): i = 0 while i < maximum: val = (yield i) # If value provided, change counter if val is not None: i = val else: i += 1
pt_pt: def counter (maximum): i = 0 while i < maximum: val = (yield i) # Se valor fornecido, alterar contador if val is not None: i = val else: i += 1

source: And here's an example of changing the counter::
pt_pt: E aqui está um exemplo de alteração do contador::
ru: А вот пример изменения счетчика::

source: :keyword:`yield` will usually return :const:`None`, so you should always check for this case. Don't just use its value in expressions unless you're sure that the :meth:`send` method will be the only method used to resume your generator function.
pt_pt: :keyword:`yield` normalmente devolverá :const:`None`, pelo que deve sempre verificar este caso. Não use simplesmente o seu valor em expressões a menos que tenha a certeza de que o método :meth:`send` será o único método usado para retomar a sua função geradora.
ru: :keyword:`yield` обычно возвращает :const:`None`, поэтому вам всегда следует проверять этот случай. Не используйте его значение в выражениях, если вы не уверены, что метод :meth:`send` будет единственным методом, используемым для возобновления функции генератора.

source: In addition to :meth:`send`, there are two other new methods on generators:
pt_pt: Além de :meth:`send`, há dois outros novos métodos em geradores:
ru: Помимо :meth:`send`, в генераторах есть еще два новых метода:

source: ``throw(type, value=None, traceback=None)`` is used to raise an exception inside the generator; the exception is raised by the :keyword:`yield` expression where the generator's execution is paused.
pt_pt: ``throw(type, value=None, traceback=None)`` é usado para gerar uma exceção dentro do gerador; a exceção é gerada pela expressão :keyword:`yield` onde a execução do gerador está pausada.
ru: ``throw(type, value=None, Traceback=None)`` используется для вызова исключения внутри генератора; исключение вызывается выражением :keyword:`yield`, где выполнение генератора приостанавливается.

source: :meth:`close` raises a new :exc:`GeneratorExit` exception inside the generator to terminate the iteration. On receiving this exception, the generator's code must either raise :exc:`GeneratorExit` or :exc:`StopIteration`. Catching the :exc:`GeneratorExit` exception and returning a value is illegal and will trigger a :exc:`RuntimeError`; if the function raises some other exception, that exception is propagated to the caller. :meth:`close` will also be called by Python's garbage collector when the generator is garbage-collected.
pt_pt: :meth:`close` gera uma nova exceção :exc:`GeneratorExit` dentro do gerador para terminar a iteração. Ao receber esta exceção, o código do gerador deve gerar :exc:`GeneratorExit` ou :exc:`StopIteration`. Capturar a exceção :exc:`GeneratorExit` e devolver um valor é ilegal e irá gerar um :exc:`RuntimeError`; se a função gerar outra exceção, essa exceção é propagada para o chamador. :meth:`close` também será chamado pelo recolhedor de lixo do Python quando o gerador for recolhido.
ru: :meth:`close` вызывает новое исключение :exc:`GeneratorExit` внутри генератора для завершения итерации. При получении этого исключения код генератора должен либо вызвать :exc:`GeneratorExit`, либо :exc:`StopIteration`. Перехват исключения :exc:`GeneratorExit` и возврат значения незаконны и вызовут ошибку :exc:`RuntimeError`; если функция вызывает какое-либо другое исключение, это исключение передается вызывающей стороне. :meth:`close` также будет вызываться сборщиком мусора Python, когда генератор выполняет сбор мусора.

source: If you need to run cleanup code when a :exc:`GeneratorExit` occurs, I suggest using a ``try: ... finally:`` suite instead of catching :exc:`GeneratorExit`.
pt_pt: Se precisar de executar código de limpeza quando ocorrer um :exc:`GeneratorExit`, sugiro usar um bloco ``try: ... finally:`` em vez de capturar :exc:`GeneratorExit`.
ru: Если вам нужно запустить код очистки при возникновении :exc:`GeneratorExit`, я предлагаю использовать ``try: ...finally:`` вместо перехвата :exc:`GeneratorExit`.

source: The cumulative effect of these changes is to turn generators from one-way producers of information into both producers and consumers.
pt_pt: O efeito cumulativo destas alterações é transformar os geradores de produtores unidirecionais de informação em produtores e consumidores.
ru: Совокупный эффект этих изменений состоит в том, чтобы превратить генераторов из односторонних производителей информации в производителей и потребителей.

source: Generators also become *coroutines*, a more generalized form of subroutines. Subroutines are entered at one point and exited at another point (the top of the function, and a :keyword:`return` statement), but coroutines can be entered, exited, and resumed at many different points (the :keyword:`yield` statements). We'll have to figure out patterns for using coroutines effectively in Python.
pt_pt: Os geradores também se tornam *corrotinas*, uma forma mais generalizada de sub-rotinas. As sub-rotinas são iniciadas num ponto e terminadas noutro (o topo da função e uma instrução :keyword:`return`), mas as corrotinas podem ser iniciadas, terminadas e retomadas em muitos pontos diferentes (as instruções :keyword:`yield`). Teremos de descobrir padrões para usar corrotinas de forma eficaz em Python.
ru: Генераторы также становятся сопрограммами, более обобщенной формой подпрограмм. Вход в подпрограммы осуществляется в одной точке, а выход из них — в другой (верхняя часть функции и оператор :keyword:`return`), но вход в сопрограммы, выход из них и возобновление могут осуществляться во многих разных точках (метод :keyword:`yield `заявления). Нам придется выяснить шаблоны эффективного использования сопрограмм в Python.

source: The addition of the :meth:`close` method has one side effect that isn't obvious. :meth:`close` is called when a generator is garbage-collected, so this means the generator's code gets one last chance to run before the generator is destroyed. This last chance means that ``try...finally`` statements in generators can now be guaranteed to work; the :keyword:`finally` clause will now always get a chance to run. The syntactic restriction that you couldn't mix :keyword:`yield` statements with a ``try...finally`` suite has therefore been removed. This seems like a minor bit of language trivia, but using generators and ``try...finally`` is actually necessary in order to implement the :keyword:`with` statement described by :pep:`343`. I'll look at this new statement in the following section.
pt_pt: A adição do método :meth:`close` tem um efeito secundário que não é óbvio. :meth:`close` é chamado quando um gerador é recolhido pelo *garbage collector*, o que significa que o código do gerador tem uma última oportunidade de ser executado antes de o gerador ser destruído. Esta última oportunidade significa que as instruções ``try...finally`` em geradores podem agora ser garantidas como funcionais; a cláusula :keyword:`finally` terá agora sempre a oportunidade de ser executada. A restrição sintática que impedia a mistura de instruções :keyword:`yield` com um bloco ``try...finally`` foi, portanto, removida. Isto pode parecer um detalhe menor da linguagem, mas o uso de geradores e ``try...finally`` é na verdade necessário para implementar a instrução :keyword:`with` descrita na :pep:`343`. Vou analisar esta nova instrução na secção seguinte.
ru: Добавление метода :meth:`close` имеет один неочевидный побочный эффект. :meth:`close` вызывается, когда генератор очищается от мусора, поэтому это означает, что код генератора получает последний шанс запуститься, прежде чем генератор будет уничтожен. Этот последний шанс означает, что операторы ``try...finally`` в генераторах теперь могут гарантированно работать; предложение :keyword:`finally` теперь всегда будет иметь возможность выполниться. Таким образом, синтаксическое ограничение, заключающееся в том, что нельзя смешивать операторы :keyword:`yield` с набором ``try...finally``, было удалено. Это кажется незначительной языковой мелочью, но использование генераторов и ``try...finally`` на самом деле необходимо для реализации оператора :keyword:`with`, описанного :pep:`343`. Я рассмотрю это новое утверждение в следующем разделе.

source: Another even more esoteric effect of this change: previously, the :attr:`gi_frame` attribute of a generator was always a frame object. It's now possible for :attr:`gi_frame` to be ``None`` once the generator has been exhausted.
pt_pt: Outro efeito ainda mais esotérico desta alteração: anteriormente, o atributo :attr:`gi_frame` de um gerador era sempre um objeto de quadro/*frame*. Agora é possível que :attr:`gi_frame` seja ``None`` assim que o gerador estiver esgotado.
ru: Еще один, еще более эзотерический эффект этого изменения: раньше атрибут генератора :attr:`gi_frame` всегда был объектом фрейма. Теперь возможно, что :attr:`gi_frame` будет иметь значение ``None`` после того, как генератор исчерпан.

source: :pep:`342` - Coroutines via Enhanced Generators
pt_pt: :pep:`342` - Corrotinas através de Geradores Melhorados
ru: Предложение по добавлению генераторов и оператора :keyword:`yield` в Python.

source: PEP written by Guido van Rossum and Phillip J. Eby; implemented by Phillip J. Eby. Includes examples of some fancier uses of generators as coroutines.
pt_pt: PEP escrita por Guido van Rossum e Phillip J. Eby; implementada por Phillip J. Eby. Inclui exemplos de alguns usos mais elaborados de geradores como corrotinas.
ru: PEP, написанный Гвидо ван Россумом и Филиппом Дж. Эби; реализован Филиппом Дж. Эби. Включает примеры более необычного использования генераторов в качестве сопрограмм.

source: Earlier versions of these features were proposed in :pep:`288` by Raymond Hettinger and :pep:`325` by Samuele Pedroni.
pt_pt: Versões anteriores destas funcionalidades foram propostas na :pep:`288` por Raymond Hettinger e na :pep:`325` por Samuele Pedroni.
ru: Более ранние версии этих функций были предложены в :pep:`288` Рэймондом Хеттингером и :pep:`325` Сэмюэлем Педрони.

source: The Wikipedia entry for coroutines.
pt_pt: A entrada da Wikipédia sobre corrotinas.
ru: Статья в Википедии о сопрограммах.

source: An explanation of coroutines from a Perl point of view, written by Dan Sugalski.
pt_pt: Uma explicação sobre corrotinas do ponto de vista do Perl, escrita por Dan Sugalski.
ru: Объяснение сопрограмм с точки зрения Perl, написанное Дэном Сугальски.

source: PEP 343: The 'with' statement
pt_pt: PEP 343: A instrução 'with'
ru: PEP 343: оператор «with»

source: The ':keyword:`with`' statement clarifies code that previously would use ``try...finally`` blocks to ensure that clean-up code is executed. In this section, I'll discuss the statement as it will commonly be used. In the next section, I'll examine the implementation details and show how to write objects for use with this statement.
pt_pt: A instrução ':keyword:`with`' clarifica o código que anteriormente usaria blocos ``try...finally`` para garantir que o código de limpeza é executado. Nesta secção, vou discutir a instrução como será comumente usada. Na secção seguinte, vou examinar os detalhes de implementação e mostrar como escrever objetos para uso com esta instrução.
ru: Оператор ':keyword:`with`' поясняет код, который ранее использовал блоки ``try...finally`` для обеспечения выполнения кода очистки. В этом разделе я рассмотрю это утверждение в том виде, в каком оно будет обычно использоваться. В следующем разделе я рассмотрю детали реализации и покажу, как писать объекты для использования с этим оператором.

source: The ':keyword:`with`' statement is a new control-flow structure whose basic structure is::
pt_pt: A instrução ':keyword:`with`' é uma nova estrutura de controlo de fluxo cuja estrutura básica é::
ru: Оператор ':keyword:`with`' представляет собой новую структуру потока управления, базовая структура которой следующая:

source: with expression [as variable]: with-block
pt_pt: with expressão [as variável]: bloco-with

source: The expression is evaluated, and it should result in an object that supports the context management protocol (that is, has :meth:`~object.__enter__` and :meth:`~object.__exit__` methods.
pt_pt: A expressão é avaliada e deve resultar num objeto que suporta o protocolo de gestão de contexto (ou seja, tem os métodos :meth:`~object.__enter__` e :meth:`~object.__exit__`.
ru: Выражение оценивается, и в результате должен получиться объект, поддерживающий протокол управления контекстом (то есть имеющий методы :meth:`~object.__enter__` и :meth:`~object.__exit__`.

source: The object's :meth:`~object.__enter__` is called before *with-block* is executed and therefore can run set-up code. It also may return a value that is bound to the name *variable*, if given. (Note carefully that *variable* is *not* assigned the result of *expression*.)
pt_pt: O método :meth:`~object.__enter__` do objeto é chamado antes de *bloco-with* ser executado e, portanto, pode executar código de configuração. Também pode devolver um valor que é ligado ao nome *variável*, se fornecido. (Note cuidadosamente que *variável* *não* é atribuída ao resultado de *expressão*.)
ru: :meth:`~object.__enter__` объекта вызывается перед выполнением *with-block* и, следовательно, может запускать код настройки. Он также может возвращать значение, привязанное к имени *переменная*, если оно задано. (Обратите внимание, что *переменной* *не* присваивается результат *выражения*.)

source: After execution of the *with-block* is finished, the object's :meth:`~object.__exit__` method is called, even if the block raised an exception, and can therefore run clean-up code.
pt_pt: Após a execução do *bloco-with* estar terminada, o método :meth:`~object.__exit__` do objeto é chamado, mesmo que o bloco tenha gerado uma exceção, e pode, portanto, executar código de limpeza.
ru: После завершения выполнения *with-block* вызывается метод объекта :meth:`~object.__exit__`, даже если блок вызвал исключение, и поэтому можно запустить код очистки.

source: To enable the statement in Python 2.5, you need to add the following directive to your module::
pt_pt: Para ativar a instrução no Python 2.5, precisa de adicionar a seguinte diretiva ao seu módulo::
ru: Чтобы включить оператор в Python 2.5, вам необходимо добавить в свой модуль следующую директиву:

source: The statement will always be enabled in Python 2.6.
pt_pt: A instrução estará sempre ativada no Python 2.6.
ru: Этот оператор всегда будет включен в Python 2.6.

source: Some standard Python objects now support the context management protocol and can be used with the ':keyword:`with`' statement. File objects are one example::
pt_pt: Alguns objetos Python padrão agora suportam o protocolo de gestão de contexto e podem ser usados com a instrução ':keyword:`with`'. Os objetos de ficheiro são um exemplo::
ru: Некоторые стандартные объекты Python теперь поддерживают протокол управления контекстом и могут использоваться с оператором ':keyword:`with`'. Файловые объекты являются одним из примеров::

source: with open('/etc/passwd', 'r') as f: for line in f: print line ... more processing code ...
pt_pt: with open('/etc/passwd', 'r') as f: for line in f: print line ... mais código de processamento ...

source: After this statement has executed, the file object in *f* will have been automatically closed, even if the :keyword:`for` loop raised an exception part-way through the block.
pt_pt: Após esta instrução ter sido executada, o objeto de ficheiro em *f* terá sido fechado automaticamente, mesmo que o ciclo :keyword:`for` tenha gerado uma exceção a meio do bloco.
ru: После выполнения этого оператора объект файла в *f* будет автоматически закрыт, даже если цикл :keyword:`for` вызвал исключение в середине блока.

source: In this case, *f* is the same object created by :func:`open`, because :meth:`~object.__enter__` returns *self*.
pt_pt: Neste caso, *f* é o mesmo objeto criado por :func:`open`, porque :meth:`~object.__enter__` devolve *self*.
ru: В данном случае *f* — это тот же объект, созданный :func:`open`, поскольку :meth:`~object.__enter__` возвращает *self*.

source: The :mod:`threading` module's locks and condition variables also support the ':keyword:`with`' statement::
pt_pt: Os bloqueios e variáveis de condição do módulo :mod:`threading` também suportam a instrução ':keyword:`with`'::
ru: Блокировки и переменные условия модуля :mod:`threading` также поддерживают оператор ':keyword:`with`'::

source: lock = threading.Lock() with lock: # Critical section of code ...
pt_pt: lock = threading.Lock() with lock: # Secção crítica de código ...
