Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: Raising of strings as exceptions, as in the statement ``raise "Error occurred"``, is deprecated in Python 2.5 and will trigger a warning. The aim is to be able to remove the string-exception feature in a few releases.
pt_pt: Gerar *strings* como exceções, como na instrução ``raise "Error occurred"``, está obsoleto no Python 2.5 e irá gerar um aviso. O objetivo é poder remover a funcionalidade de exceção de *string* em algumas versões.
ru: Вызов строк в качестве исключений, как в операторе «raise «Произошла ошибка»», не рекомендуется в Python 2.5 и вызывает предупреждение. Цель состоит в том, чтобы иметь возможность удалить функцию исключения строк в нескольких выпусках.

source: :pep:`352` - Required Superclass for Exceptions
pt_pt: :pep:`352` - Superclasse Obrigatória para Exceções
ru: :pep:`352` - Обязательный суперкласс для исключений

source: PEP written by Brett Cannon and Guido van Rossum; implemented by Brett Cannon.
pt_pt: PEP escrita por Brett Cannon e Guido van Rossum; implementada por Brett Cannon.
ru: PEP, написанный Бреттом Кэнноном и Гвидо ван Россумом; реализован Бреттом Кэнноном.

source: PEP 353: Using ssize_t as the index type
pt_pt: PEP 353: Usar ssize_t como tipo de índice
ru: PEP 353: использование ssize_t в качестве типа индекса

source: A wide-ranging change to Python's C API, using a new :c:type:`Py_ssize_t` type definition instead of :c:expr:`int`, will permit the interpreter to handle more data on 64-bit platforms. This change doesn't affect Python's capacity on 32-bit platforms.
pt_pt: Uma alteração abrangente à API C do Python, usando uma nova definição de tipo :c:type:`Py_ssize_t` em vez de :c:expr:`int`, permitirá que o interpretador trate mais dados em plataformas de 64 bits. Esta alteração não afeta a capacidade do Python em plataformas de 32 bits.
ru: Широкомасштабное изменение API C Python с использованием нового определения типа :c:type:`Py_ssize_t` вместо :c:expr:`int` позволит интерпретатору обрабатывать больше данных на 64-битных платформах. Это изменение не влияет на возможности Python на 32-битных платформах.

source: Various pieces of the Python interpreter used C's :c:expr:`int` type to store sizes or counts; for example, the number of items in a list or tuple were stored in an :c:expr:`int`. The C compilers for most 64-bit platforms still define :c:expr:`int` as a 32-bit type, so that meant that lists could only hold up to ``2**31 - 1`` = 2147483647 items. (There are actually a few different programming models that 64-bit C compilers can use -- see https://unix.org/version2/whatsnew/lp64_wp.html for a discussion -- but the most commonly available model leaves :c:expr:`int` as 32 bits.)
pt_pt: Várias partes do interpretador Python usavam o tipo :c:expr:`int` do C para armazenar tamanhos ou contagens; por exemplo, o número de itens numa lista ou tuplo era armazenado num :c:expr:`int`. Os compiladores C para a maioria das plataformas de 64 bits ainda definem :c:expr:`int` como um tipo de 32 bits, pelo que isso significava que as listas só podiam conter até ``2**31 - 1`` = 2147483647 itens. (Existem, na verdade, alguns modelos de programação diferentes que os compiladores C de 64 bits podem usar -- veja https://unix.org/version2/whatsnew/lp64_wp.html para uma discussão -- mas o modelo mais comumente disponível deixa :c:expr:`int` como 32 bits.)
ru: Различные части интерпретатора Python использовали тип C :c:expr:`int` для хранения размеров или счетчиков; например, количество элементов в списке или кортеже хранилось в :c:expr:`int`. Компиляторы C для большинства 64-битных платформ по-прежнему определяют :c:expr:`int` как 32-битный тип, а это означает, что списки могут содержать только до ``2**31 - 1`` = 2147483647 элементов. (На самом деле существует несколько различных моделей программирования, которые могут использовать 64-битные компиляторы C — обсуждение см. на https://unix.org/version2/whatsnew/lp64_wp.html — но наиболее распространенная модель оставляет :c: expr:`int` как 32 бита.)

source: A limit of 2147483647 items doesn't really matter on a 32-bit platform because you'll run out of memory before hitting the length limit. Each list item requires space for a pointer, which is 4 bytes, plus space for a :c:type:`PyObject` representing the item. 2147483647\*4 is already more bytes than a 32-bit address space can contain.
pt_pt: Um limite de 2147483647 itens não é realmente relevante numa plataforma de 32 bits porque ficará sem memória antes de atingir o limite de comprimento. Cada item da lista requer espaço para um ponteiro, que são 4 bytes, além de espaço para um :c:type:`PyObject` que representa o item. 2147483647\*4 já são mais bytes do que um espaço de endereçamento de 32 bits pode conter.
ru: Ограничение в 2147483647 элементов не имеет особого значения на 32-битной платформе, поскольку у вас закончится память до того, как будет достигнут предел длины. Каждый элемент списка требует места для указателя, размер которого составляет 4 байта, плюс место для :c:type:` PyObject` , представляющего этот элемент. 2147483647\*4 — это уже больше байт, чем может содержать 32-битное адресное пространство.

source: It's possible to address that much memory on a 64-bit platform, however. The pointers for a list that size would only require 16 GiB of space, so it's not unreasonable that Python programmers might construct lists that large. Therefore, the Python interpreter had to be changed to use some type other than :c:expr:`int`, and this will be a 64-bit type on 64-bit platforms. The change will cause incompatibilities on 64-bit machines, so it was deemed worth making the transition now, while the number of 64-bit users is still relatively small. (In 5 or 10 years, we may *all* be on 64-bit machines, and the transition would be more painful then.)
pt_pt: É possível endereçar essa quantidade de memória numa plataforma de 64 bits. Os ponteiros para uma lista desse tamanho só requereriam 16 GiB de espaço, pelo que não é irrazoável que programadores Python possam construir listas desse tamanho. Portanto, o interpretador Python teve de ser alterado para usar um tipo diferente de :c:expr:`int`, e este será um tipo de 64 bits em plataformas de 64 bits. A alteração causará incompatibilidades em máquinas de 64 bits, pelo que foi considerado valer a pena fazer a transição agora, enquanto o número de utilizadores de 64 bits ainda é relativamente pequeno. (Daqui a 5 ou 10 anos, todos podemos estar em máquinas de 64 bits, e a transição seria mais dolorosa.)
ru: Однако можно адресовать такой объем памяти на 64-битной платформе. Указатели на список такого размера потребуют всего 16 ГиБ пространства, поэтому вполне разумно, что программисты Python могут создавать списки такого размера. Поэтому интерпретатор Python пришлось изменить, чтобы использовать какой-либо тип, отличный от :c:expr:`int`, и на 64-битных платформах это будет 64-битный тип. Это изменение приведет к несовместимости на 64-битных машинах, поэтому было сочтено целесообразным осуществить переход сейчас, пока число 64-битных пользователей все еще относительно невелико. (Через 5 или 10 лет мы, возможно, *все* будем использовать 64-битные машины, и тогда переход будет более болезненным.)

source: This change most strongly affects authors of C extension modules. Python strings and container types such as lists and tuples now use :c:type:`Py_ssize_t` to store their size. Functions such as :c:func:`PyList_Size` now return :c:type:`Py_ssize_t`. Code in extension modules may therefore need to have some variables changed to :c:type:`Py_ssize_t`.
pt_pt: Esta alteração afeta principalmente os autores de módulos de extensão em C. As strings Python e os tipos de contentores, como listas e tuplos, usam agora :c:type:`Py_ssize_t` para armazenar o seu tamanho. Funções como :c:func:`PyList_Size` devolvem agora :c:type:`Py_ssize_t`. O código nos módulos de extensão pode, portanto, precisar de ter algumas variáveis alteradas para :c:type:`Py_ssize_t`.
ru: Это изменение сильнее всего затрагивает авторов модулей расширения C. Строки Python и типы контейнеров, такие как списки и кортежи, теперь используют :c:type:`Py_ssize_t` для хранения своего размера. Такие функции, как :c:func:`PyList_Size`, теперь возвращают :c:type:`Py_ssize_t`. Поэтому в коде модулей расширения может потребоваться изменить некоторые переменные на :c:type:`Py_ssize_t`.

source: The :c:func:`PyArg_ParseTuple` and :c:func:`Py_BuildValue` functions have a new conversion code, ``n``, for :c:type:`Py_ssize_t`. :c:func:`PyArg_ParseTuple`'s ``s#`` and ``t#`` still output :c:expr:`int` by default, but you can define the macro :c:macro:`PY_SSIZE_T_CLEAN` before including :file:`Python.h` to make them return :c:type:`Py_ssize_t`.
pt_pt: As funções :c:func:`PyArg_ParseTuple` e :c:func:`Py_BuildValue` têm um novo código de conversão, ``n``, para :c:type:`Py_ssize_t`. Os ``s#`` e ``t#`` de :c:func:`PyArg_ParseTuple` ainda produzem :c:expr:`int` por predefinição, mas pode definir a macro :c:macro:`PY_SSIZE_T_CLEAN` antes de incluir :file:`Python.h` para fazê-los devolver :c:type:`Py_ssize_t`.
ru: Функции :c:func:`PyArg_ParseTuple` и :c:func:`Py_BuildValue` имеют новый код преобразования ``n`` для :c:type:`Py_ssize_t`. :c:func:```s#`` и ``t#`` PyArg_ParseTuple`` по-прежнему выводятся :c:expr:`int` по умолчанию, но вы можете определить макрос :c:macro:`PY_SSIZE_T_CLEAN` перед включением :file:`Python.h`, чтобы они вернули :c:type:`Py_ssize_t`.

source: :pep:`353` has a section on conversion guidelines that extension authors should read to learn about supporting 64-bit platforms.
pt_pt: A :pep:`353` tem uma secção sobre diretrizes de conversão que os autores de extensões devem ler para aprender sobre o suporte a plataformas de 64 bits.
ru: В :pep:`353` есть раздел с рекомендациями по преобразованию, который авторам расширений следует прочитать, чтобы узнать о поддержке 64-битных платформ.

source: :pep:`353` - Using ssize_t as the index type
pt_pt: :pep:`353` - Usar ssize_t como tipo de índice
ru: :pep:`353` - Использование ssize_t в качестве типа индекса

source: PEP written and implemented by Martin von Löwis.
pt_pt: PEP escrita e implementada por Martin von Löwis.
ru: PEP написан и реализован Мартином фон Лёвисом.

source: PEP 357: The '__index__' method
pt_pt: PEP 357: O método '__index__'
ru: PEP 357: метод «__index__»

source: The NumPy developers had a problem that could only be solved by adding a new special method, :meth:`__index__`. When using slice notation, as in ``[start:stop:step]``, the values of the *start*, *stop*, and *step* indexes must all be either integers or long integers. NumPy defines a variety of specialized integer types corresponding to unsigned and signed integers of 8, 16, 32, and 64 bits, but there was no way to signal that these types could be used as slice indexes.
pt_pt: Os programadores do NumPy tinham um problema que só poderia ser resolvido adicionando um novo método especial, :meth:`__index__`. Ao usar a notação de fatia, como em ``[start:stop:step]``, os valores dos índices *start*, *stop* e *step* devem ser todos inteiros ou inteiros longos. O NumPy define uma variedade de tipos inteiros especializados correspondentes a inteiros com e sem sinal de 8, 16, 32 e 64 bits, mas não havia forma de sinalizar que esses tipos poderiam ser usados como índices de fatia.
ru: У разработчиков NumPy возникла проблема, которую можно было решить только добавлением нового специального метода :meth:`__index__`. При использовании нотации среза, как в ``[start:stop:step]``, все значения индексов *start*, *stop* и *step* должны быть либо целыми, либо длинными целыми числами. NumPy определяет множество специализированных целочисленных типов, соответствующих целым числам без знака и знака длиной 8, 16, 32 и 64 бита, но не было способа указать, что эти типы можно использовать в качестве индексов срезов.

source: Slicing can't just use the existing :meth:`__int__` method because that method is also used to implement coercion to integers. If slicing used :meth:`__int__`, floating-point numbers would also become legal slice indexes and that's clearly an undesirable behaviour.
pt_pt: A fatiagem não pode simplesmente usar o método :meth:`__int__` existente porque esse método também é usado para implementar a coerção para inteiros. Se a fatiagem usasse :meth:`__int__`, os números de ponto flutuante também se tornariam índices de fatia legais, e isso é claramente um comportamento indesejável.
ru: Для нарезки нельзя просто использовать существующий метод :meth:`__int__`, поскольку этот метод также используется для реализации приведения к целым числам. Если бы для среза использовалось :meth:`__int__`, числа с плавающей запятой также стали бы допустимыми индексами среза, и это явно нежелательное поведение.

source: Instead, a new special method called :meth:`__index__` was added. It takes no arguments and returns an integer giving the slice index to use. For example::
pt_pt: Em vez disso, foi adicionado um novo método especial chamado :meth:`__index__`. Ele não recebe argumentos e devolve um inteiro que dá o índice de fatia a usar. Por exemplo::
ru: Вместо этого был добавлен новый специальный метод :meth:`__index__`. Он не принимает аргументов и возвращает целое число, указывающее индекс среза, который нужно использовать. Например::

source: The return value must be either a Python integer or long integer. The interpreter will check that the type returned is correct, and raises a :exc:`TypeError` if this requirement isn't met.
pt_pt: O valor de retorno deve ser um inteiro Python ou um inteiro longo. O interpretador verificará se o tipo devolvido está correto e gera um :exc:`TypeError` se este requisito não for cumprido.
ru: Возвращаемое значение должно быть либо целым числом Python, либо длинным целым числом. Интерпретатор проверит правильность возвращаемого типа и выдаст ошибку :exc:`TypeError`, если это требование не выполнено.

source: A corresponding :c:member:`~PyNumberMethods.nb_index` slot was added to the C-level :c:type:`PyNumberMethods` structure to let C extensions implement this protocol. ``PyNumber_Index(obj)`` can be used in extension code to call the :meth:`__index__` function and retrieve its result.
pt_pt: Um *slot* correspondente :c:member:`~PyNumberMethods.nb_index` foi adicionado à estrutura :c:type:`PyNumberMethods` ao nível de C para permitir que as extensões C implementem este protocolo. ``PyNumber_Index(obj)`` pode ser usado no código de extensão para chamar a função :meth:`__index__` e obter o seu resultado.
ru: Соответствующий слот :c:member:`~PyNumberMethods.nb_index` был добавлен в структуру :c:type:`PyNumberMethods` уровня C, чтобы расширения C могли реализовать этот протокол. ``PyNumber_Index(obj)`` можно использовать в коде расширения для вызова функции :meth:`__index__` и получения ее результата.

source: :pep:`357` - Allowing Any Object to be Used for Slicing
pt_pt: :pep:`357` - Permitir que Qualquer Objeto seja Usado para Fatiagem
ru: :pep:`357` - Разрешение использования любого объекта для нарезки

source: PEP written and implemented by Travis Oliphant.
pt_pt: PEP escrita e implementada por Travis Oliphant.
ru: PEP написан и реализован Трэвисом Олифантом.

source: Other Language Changes
pt_pt: Outras Alterações na Linguagem
ru: Другие языковые изменения

source: Here are all of the changes that Python 2.5 makes to the core Python language.
pt_pt: Aqui estão todas as alterações que o Python 2.5 faz à linguagem principal do Python.
ru: Вот все изменения, которые Python 2.5 вносит в основной язык Python.

source: The :class:`dict` type has a new hook for letting subclasses provide a default value when a key isn't contained in the dictionary. When a key isn't found, the dictionary's ``__missing__(key)`` method will be called. This hook is used to implement the new :class:`defaultdict` class in the :mod:`collections` module. The following example defines a dictionary that returns zero for any missing key::
pt_pt: O tipo :class:`dict` tem um novo gancho para permitir que subclasses forneçam um valor predefinido quando uma chave não está contida no dicionário. Quando uma chave não é encontrada, o método ``__missing__(key)`` do dicionário será chamado. Este gancho é usado para implementar a nova classe :class:`defaultdict` no módulo :mod:`collections`. O exemplo seguinte define um dicionário que devolve zero para qualquer chave em falta::
ru: Тип :class:`dict` имеет новую возможность, позволяющую подклассам предоставлять значение по умолчанию, когда ключ не содержится в словаре. Если ключ не найден, будет вызван метод словаря ``__missing__(key)``. Этот хук используется для реализации нового класса :class:`defaultdict` в модуле :mod:`collections`. В следующем примере определяется словарь, который возвращает ноль для любого отсутствующего ключа::

source: class zerodict (dict): def __missing__ (self, key): return 0 d = zerodict({1:1, 2:2}) print d[1], d[2] # Prints 1, 2 print d[3], d[4] # Prints 0, 0
pt_pt: class zerodict(dict): def __missing__(self, key): return 0 d = zerodict({1:1, 2:2}) print d[1], d[2] # Imprime 1, 2 print d[3], d[4] # Imprime 0, 0

source: Both 8-bit and Unicode strings have new ``partition(sep)`` and ``rpartition(sep)`` methods that simplify a common use case.
pt_pt: Tanto as *strings* de 8 bits como as Unicode têm novos métodos ``partition(sep)`` e ``rpartition(sep)`` que simplificam um caso de uso comum.
ru: И 8-битные строки, и строки Unicode имеют новые методы partition(sep) и rpartition(sep), которые упрощают общий вариант использования.

source: The ``find(S)`` method is often used to get an index which is then used to slice the string and obtain the pieces that are before and after the separator. ``partition(sep)`` condenses this pattern into a single method call that returns a 3-tuple containing the substring before the separator, the separator itself, and the substring after the separator. If the separator isn't found, the first element of the tuple is the entire string and the other two elements are empty. ``rpartition(sep)`` also returns a 3-tuple but starts searching from the end of the string; the ``r`` stands for 'reverse'.
pt_pt: O método ``find(S)`` é frequentemente usado para obter um índice que é depois usado para fatiar a *string* e obter as partes que estão antes e depois do separador. ``partition(sep)`` condensa este padrão numa única chamada de método que devolve um 3-tuplo contendo a substring antes do separador, o separador em si, e a substring depois do separador. Se o separador não for encontrado, o primeiro elemento do tuplo é a *string* inteira e os outros dois elementos estão vazios. ``rpartition(sep)`` também devolve um 3-tuplo, mas começa a procurar a partir do final da *string*; o ``r`` significa 'reverso'.
ru: Метод find(S) часто используется для получения индекса, который затем используется для разрезания строки и получения частей, которые находятся до и после разделителя. ``partition(sep)`` объединяет этот шаблон в один вызов метода, который возвращает кортеж из трех элементов, содержащий подстроку перед разделителем, сам разделитель и подстроку после разделителя. Если разделитель не найден, первым элементом кортежа является вся строка, а два других элемента пусты. ``rpartition(sep)`` также возвращает тройку, но начинает поиск с конца строки; ``r`` означает «обратный».

source: Some examples::
pt_pt: Alguns exemplos::
ru: Несколько примеров::

source: >>> ('http://www.python.org').partition('://') ('http', '://', 'www.python.org') >>> ('file:/usr/share/doc/index.html').partition('://') ('file:/usr/share/doc/index.html', '', '') >>> (u'Subject: a quick question').partition(':') (u'Subject', u':', u' a quick question') >>> 'www.python.org'.rpartition('.') ('www.python', '.', 'org') >>> 'www.python.org'.rpartition(':') ('', '', 'www.python.org')
pt_pt: >>> ('http://www.python.org').partition('://') ('http', '://', 'www.python.org') >>> ('file:/usr/share/doc/index.html').partition('://') ('file:/usr/share/doc/index.html', '', '') >>> (u'Assunto: uma pergunta rápida').partition(':') (u'Assunto', u':', u' uma pergunta rápida') >>> 'www.python.org'.rpartition('.') ('www.python', '.', 'org') >>> 'www.python.org'.rpartition(':') ('', '', 'www.python.org')

source: (Implemented by Fredrik Lundh following a suggestion by Raymond Hettinger.)
pt_pt: (Implementado por Fredrik Lundh seguindo uma sugestão de Raymond Hettinger.)
ru: (Реализовано Фредриком Лундом по предложению Раймонда Хеттингера.)

source: The :meth:`startswith` and :meth:`endswith` methods of string types now accept tuples of strings to check for. ::
pt_pt: Os métodos :meth:`startswith` e :meth:`endswith` dos tipos de *string* agora aceitam tuplos de *strings* para verificar. ::
ru: Методы :meth:`startswith` и :meth:`endswith` для строковых типов теперь принимают кортежи строк для проверки. ::

source: (Implemented by Georg Brandl following a suggestion by Tom Lynn.)
pt_pt: (Implementado por Georg Brandl seguindo uma sugestão de Tom Lynn.)
ru: (Реализовано Георгом Брандлом по предложению Тома Линна.)

source: The :func:`min` and :func:`max` built-in functions gained a ``key`` keyword parameter analogous to the ``key`` argument for :meth:`sort`. This parameter supplies a function that takes a single argument and is called for every value in the list; :func:`min`/:func:`max` will return the element with the smallest/largest return value from this function. For example, to find the longest string in a list, you can do::
pt_pt: As funções integradas :func:`min` e :func:`max` ganharam um parâmetro nomeado ``key`` análogo ao argumento ``key`` para :meth:`sort`. Este parâmetro fornece uma função que recebe um único argumento e é chamada para cada valor na lista; :func:`min`/:func:`max` devolverá o elemento com o menor/maior valor de retorno desta função. Por exemplo, para encontrar a *string* mais longa numa lista, pode fazer::
ru: Встроенные функции :func:`min` и :func:`max` получили ключевой параметр ``key``, аналогичный аргументу ``key`` для :meth:`sort`. Этот параметр предоставляет функцию, которая принимает один аргумент и вызывается для каждого значения в списке; :func:`min`/:func:`max` вернет элемент с наименьшим/самым большим возвращаемым значением из этой функции. Например, чтобы найти самую длинную строку в списке, вы можете сделать:

source: L = ['medium', 'longest', 'short'] # Prints 'longest' print max(L, key=len) # Prints 'short', because lexicographically 'short' has the largest value print max(L)
pt_pt: L = ['médio', 'mais longo', 'curto'] # Imprime 'mais longo' print max(L, key=len) # Imprime 'curto', porque lexicograficamente 'curto' tem o maior valor print max(L)

source: (Contributed by Steven Bethard and Raymond Hettinger.)
pt_pt: (Contribuído por Steven Bethard e Raymond Hettinger.)
ru: (Сообщили Стивен Бетард и Рэймонд Хеттингер.)
