Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: To retrieve data after executing a SELECT statement, you can either treat the cursor as an iterator, call the cursor's :meth:`fetchone` method to retrieve a single matching row, or call :meth:`fetchall` to get a list of the matching rows.
pt_pt: Para recuperar dados após executar uma instrução SELECT, pode tratar o cursor como um iterador, chamar o método :meth:`fetchone` do cursor para recuperar uma linha correspondente única, ou chamar :meth:`fetchall` para obter uma lista das linhas correspondentes.
ru: Чтобы получить данные после выполнения оператора SELECT, вы можете либо рассматривать курсор как итератор, вызвать метод курсора :meth:`fetchone` для получения одной соответствующей строки, либо вызвать :meth:`fetchall` для получения списка совпадающие строки.

source: This example uses the iterator form::
pt_pt: Este exemplo usa a forma de iterador::
ru: В этом примере используется форма итератора::

source: >>> c = conn.cursor() >>> c.execute('select * from stocks order by price') >>> for row in c: ... print row ... (u'2006-01-05', u'BUY', u'RHAT', 100, 35.140000000000001) (u'2006-03-28', u'BUY', u'IBM', 1000, 45.0) (u'2006-04-06', u'SELL', u'IBM', 500, 53.0) (u'2006-04-05', u'BUY', u'MSOFT', 1000, 72.0) >>>
pt_pt: >>> c = conn.cursor() >>> c.execute('select * from stocks order by price') >>> for row in c: ... print row ... (u'2006-01-05', u'COMPRA', u'RHAT', 100, 35.140000000000001) (u'2006-03-28', u'COMPRA', u'IBM', 1000, 45.0) (u'2006-04-06', u'VENDA', u'IBM', 500, 53.0) (u'2006-04-05', u'COMPRA', u'MSOFT', 1000, 72.0) >>>

source: For more information about the SQL dialect supported by SQLite, see https://www.sqlite.org.
pt_pt: Para mais informações sobre o dialeto SQL suportado pelo SQLite, consulte https://www.sqlite.org.
ru: Дополнительные сведения о диалекте SQL, поддерживаемом SQLite, см. на странице https://www.sqlite.org.

source: The pysqlite web page.
pt_pt: A página web do pysqlite.
ru: Веб-страница pysqlite.

source: The SQLite web page; the documentation describes the syntax and the available data types for the supported SQL dialect.
pt_pt: A página web do SQLite; a documentação descreve a sintaxe e os tipos de dados disponíveis para o dialeto SQL suportado.
ru: Веб-страница SQLite; документация описывает синтаксис и доступные типы данных для поддерживаемого диалекта SQL.

source: The documentation for the :mod:`sqlite3` module.
pt_pt: A documentação para o módulo :mod:`sqlite3`.
ru: Документация для модуля :mod:`sqlite3`.

source: :pep:`249` - Database API Specification 2.0
pt_pt: :pep:`249` - Especificação da API de Base de Dados 2.0

source: PEP written by Marc-André Lemburg.
pt_pt: PEP escrita por Marc-André Lemburg.
ru: PEP написан Марком-Андре Лембургом.

source: The wsgiref package
pt_pt: O pacote wsgiref
ru: Пакет wsgiref

source: The Web Server Gateway Interface (WSGI) v1.0 defines a standard interface between web servers and Python web applications and is described in :pep:`333`. The :mod:`wsgiref` package is a reference implementation of the WSGI specification.
pt_pt: A Interface de Gateway de Servidor Web (WSGI) v1.0 define uma interface padrão entre servidores web e aplicações web Python e está descrita na :pep:`333`. O pacote :mod:`wsgiref` é uma implementação de referência da especificação WSGI.
ru: Интерфейс шлюза веб-сервера (WSGI) v1.0 определяет стандартный интерфейс между веб-серверами и веб-приложениями Python и описан в :pep:`333`. Пакет :mod:`wsgiref` представляет собой эталонную реализацию спецификации WSGI.

source: The package includes a basic HTTP server that will run a WSGI application; this server is useful for debugging but isn't intended for production use. Setting up a server takes only a few lines of code::
pt_pt: O pacote inclui um servidor HTTP básico que executará uma aplicação WSGI; este servidor é útil para depuração, mas não é destinado a uso em produção. Configurar um servidor requer apenas algumas linhas de código::
ru: В пакет входит базовый HTTP-сервер, на котором будет выполняться приложение WSGI; этот сервер полезен для отладки, но не предназначен для производственного использования. Настройка сервера занимает всего несколько строк кода:

source: A central web site for WSGI-related resources.
pt_pt: Um site web central para recursos relacionados com WSGI.
ru: Центральный веб-сайт ресурсов, связанных с WSGI.

source: :pep:`333` - Python Web Server Gateway Interface v1.0
pt_pt: :pep:`333` - Interface de Gateway de Servidor Web Python v1.0
ru: :pep:`333` - Интерфейс шлюза веб-сервера Python v1.0

source: PEP written by Phillip J. Eby.
pt_pt: PEP escrita por Phillip J. Eby.
ru: PEP, написанный Филипом Дж. Эби.

source: Build and C API Changes
pt_pt: Alterações na Compilação e na API C
ru: Изменения API сборки и C

source: Changes to Python's build process and to the C API include:
pt_pt: As alterações no processo de compilação do Python e na API C incluem:
ru: Изменения в процессе сборки Python и C API включают в себя:

source: The Python source tree was converted from CVS to Subversion, in a complex migration procedure that was supervised and flawlessly carried out by Martin von Löwis. The procedure was developed as :pep:`347`.
pt_pt: A árvore de origem do Python foi convertida de CVS para Subversion, num procedimento complexo de migração que foi supervisionado e executado sem falhas por Martin von Löwis. O procedimento foi desenvolvido como :pep:`347`.
ru: Дерево исходного кода Python было преобразовано из CVS в Subversion в ходе сложной процедуры миграции, которую контролировал и безупречно выполнил Мартин фон Лёвис. Процедура была разработана как :pep:`347`.

source: Coverity, a company that markets a source code analysis tool called Prevent, provided the results of their examination of the Python source code. The analysis found about 60 bugs that were quickly fixed. Many of the bugs were refcounting problems, often occurring in error-handling code. See https://scan.coverity.com for the statistics.
pt_pt: A Coverity, uma empresa que comercializa uma ferramenta de análise de código-fonte chamada Prevent, forneceu os resultados da sua análise do código-fonte do Python. A análise encontrou cerca de 60 *bugs* que foram rapidamente corrigidos. Muitos dos *bugs* eram problemas de contagem de referências, frequentemente ocorrendo em código de tratamento de erros. Veja https://scan.coverity.com para as estatísticas.
ru: Компания Coverity, которая продает инструмент анализа исходного кода под названием Prevent, предоставила результаты исследования исходного кода Python. В ходе анализа было обнаружено около 60 ошибок, которые были оперативно исправлены. Многие из ошибок были связаны с проблемами пересчета, часто возникавшими в коде обработки ошибок. Статистику можно найти на https://scan.coverity.com.

source: The largest change to the C API came from :pep:`353`, which modifies the interpreter to use a :c:type:`Py_ssize_t` type definition instead of :c:expr:`int`. See the earlier section :ref:`pep-353` for a discussion of this change.
pt_pt: A maior alteração à API C veio da :pep:`353`, que modifica o interpretador para usar uma definição de tipo :c:type:`Py_ssize_t` em vez de :c:expr:`int`. Veja a secção anterior :ref:`pep-353` para uma discussão sobre esta alteração.
ru: Самое большое изменение в C API произошло благодаря :pep:`353`, который модифицирует интерпретатор, чтобы использовать определение типа :c:type:`Py_ssize_t` вместо :c:expr:`int`. См. предыдущий раздел :ref:`pep-353` для обсуждения этого изменения.

source: The design of the bytecode compiler has changed a great deal, no longer generating bytecode by traversing the parse tree. Instead the parse tree is converted to an abstract syntax tree (or AST), and it is the abstract syntax tree that's traversed to produce the bytecode.
pt_pt: O desenho do compilador de *bytecode* mudou muito, já não gerando *bytecode* ao percorrer a árvore de análise. Em vez disso, a árvore de análise é convertida numa árvore de sintaxe abstrata (ou AST), e é a árvore de sintaxe abstrata que é percorrida para produzir o *bytecode*.
ru: Конструкция компилятора байт-кода сильно изменилась: байт-код больше не генерируется путем обхода дерева разбора. Вместо этого дерево синтаксического анализа преобразуется в абстрактное синтаксическое дерево (или AST), и именно абстрактное синтаксическое дерево обрабатывается для создания байт-кода.

source: It's possible for Python code to obtain AST objects by using the :func:`compile` built-in and specifying ``_ast.PyCF_ONLY_AST`` as the value of the *flags* parameter::
pt_pt: É possível que o código Python obtenha objetos AST usando a função integrada :func:`compile` e especificando ``_ast.PyCF_ONLY_AST`` como o valor do parâmetro *flags*::
ru: Код Python может получать объекты AST, используя встроенную функцию :func:`compile` и указав ``_ast.PyCF_ONLY_AST`` в качестве значения параметра *flags*::

source: No official documentation has been written for the AST code yet, but :pep:`339` discusses the design. To start learning about the code, read the definition of the various AST nodes in :file:`Parser/Python.asdl`. A Python script reads this file and generates a set of C structure definitions in :file:`Include/Python-ast.h`. The :c:func:`PyParser_ASTFromString` and :c:func:`!PyParser_ASTFromFile`, defined in :file:`Include/pythonrun.h`, take Python source as input and return the root of an AST representing the contents. This AST can then be turned into a code object by :c:func:`!PyAST_Compile`. For more information, read the source code, and then ask questions on python-dev.
pt_pt: Ainda não foi escrita documentação oficial para o código AST, mas a :pep:`339` discute o desenho. Para começar a aprender sobre o código, leia a definição dos vários nós AST em :file:`Parser/Python.asdl`. Um *script* Python lê este ficheiro e gera um conjunto de definições de estruturas C em :file:`Include/Python-ast.h`. As funções :c:func:`PyParser_ASTFromString` e :c:func:`!PyParser_ASTFromFile`, definidas em :file:`Include/pythonrun.h`, recebem código-fonte Python como entrada e devolvem a raiz de uma AST que representa o conteúdo. Esta AST pode então ser transformada num objeto de código por :c:func:`!PyAST_Compile`. Para mais informações, leia o código-fonte e depois faça perguntas em python-dev.
ru: Для кода AST пока не написано официальной документации, но :pep:`339` обсуждает его дизайн. Чтобы начать изучение кода, прочитайте определения различных узлов AST в файле Parser/Python.asdl. Сценарий Python читает этот файл и генерирует набор определений структур C в :file:`Include/Python-ast.h`. :c:func:`PyParser_ASTFromString` и :c:func:`!PyParser_ASTFromFile`, определенные в :file:`Include/pythonrun.h`, принимают исходный код Python в качестве входных данных и возвращают корень AST, представляющий содержимое. Затем этот AST можно превратить в объект кода с помощью :c:func:`!PyAST_Compile`. Для получения дополнительной информации прочитайте исходный код, а затем задайте вопросы по python-dev.

source: The AST code was developed under Jeremy Hylton's management, and implemented by (in alphabetical order) Brett Cannon, Nick Coghlan, Grant Edwards, John Ehresman, Kurt Kaiser, Neal Norwitz, Tim Peters, Armin Rigo, and Neil Schemenauer, plus the participants in a number of AST sprints at conferences such as PyCon.
pt_pt: O código AST foi desenvolvido sob a gestão de Jeremy Hylton e implementado por (por ordem alfabética) Brett Cannon, Nick Coghlan, Grant Edwards, John Ehresman, Kurt Kaiser, Neal Norwitz, Tim Peters, Armin Rigo e Neil Schemenauer, além dos participantes em vários *sprints* de AST em conferências como a PyCon.
ru: Код AST был разработан под руководством Джереми Хилтона и реализован (в алфавитном порядке) Бреттом Кэнноном, Ником Когланом, Грантом Эдвардсом, Джоном Эресманом, Куртом Кайзером, Нилом Норвицем, Тимом Питерсом, Армином Риго и Нилом Шеменауэром, а также участниками ряд спринтов AST на таких конференциях, как PyCon.

source: Evan Jones's patch to obmalloc, first described in a talk at PyCon DC 2005, was applied. Python 2.4 allocated small objects in 256K-sized arenas, but never freed arenas. With this patch, Python will free arenas when they're empty. The net effect is that on some platforms, when you allocate many objects, Python's memory usage may actually drop when you delete them and the memory may be returned to the operating system. (Implemented by Evan Jones, and reworked by Tim Peters.)
pt_pt: O *patch* de Evan Jones para o obmalloc, descrito pela primeira vez numa palestra na PyCon DC 2005, foi aplicado. O Python 2.4 alocava objetos pequenos em arenas de 256K, mas nunca libertava arenas. Com este *patch*, o Python libertará arenas quando estiverem vazias. O efeito líquido é que, em algumas plataformas, quando aloca muitos objetos, o uso de memória do Python pode realmente diminuir quando os elimina e a memória pode ser devolvida ao sistema operativo. (Implementado por Evan Jones e refeito por Tim Peters.)
ru: Был применен патч Эвана Джонса для obmalloc, впервые описанный в докладе на PyCon DC 2005. Python 2.4 размещал небольшие объекты на аренах размером 256 КБ, но никогда не освобождал арены. С этим патчем Python будет освобождать арены, когда они пустуют. Конечным результатом является то, что на некоторых платформах, когда вы выделяете много объектов, использование памяти Python может фактически снизиться при их удалении, и память может быть возвращена операционной системе. (Реализовано Эваном Джонсом и переработано Тимом Питерсом.)

source: Note that this change means extension modules must be more careful when allocating memory. Python's API has many different functions for allocating memory that are grouped into families. For example, :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc`, and :c:func:`PyMem_Free` are one family that allocates raw memory, while :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc`, and :c:func:`PyObject_Free` are another family that's supposed to be used for creating Python objects.
pt_pt: Note que esta alteração significa que os módulos de extensão devem ser mais cuidadosos ao alocar memória. A API do Python tem muitas funções diferentes para alocar memória que são agrupadas em famílias. Por exemplo, :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` e :c:func:`PyMem_Free` são uma família que aloca memória bruta, enquanto :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` e :c:func:`PyObject_Free` são outra família que deve ser usada para criar objetos Python.
ru: Обратите внимание, что это изменение означает, что модули расширения должны быть более осторожными при выделении памяти. API Python имеет множество различных функций для распределения памяти, которые сгруппированы в семейства. Например, :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` и :c:func:`PyMem_Free` — это одно семейство, которое выделяет необработанную память, а :c:func:` PyObj ect_Malloc`, : c:func:` PyObj ect_Realloc` и :c:func:` PyObj ect_Free` — еще одно семейство, которое предполагается использовать для создания объектов Python.

source: Previously these different families all reduced to the platform's :c:func:`malloc` and :c:func:`free` functions. This meant it didn't matter if you got things wrong and allocated memory with the ``PyMem`` function but freed it with the ``PyObject`` function. With 2.5's changes to obmalloc, these families now do different things and mismatches will probably result in a segfault. You should carefully test your C extension modules with Python 2.5.
pt_pt: Anteriormente, estas diferentes famílias reduziam-se todas às funções :c:func:`malloc` e :c:func:`free` da plataforma. Isto significava que não importava se errava e alocava memória com a função ``PyMem``, mas a libertava com a função ``PyObject``. Com as alterações do Python 2.5 ao obmalloc, estas famílias agora fazem coisas diferentes e incompatibilidades provavelmente resultarão num erro de segmentação. Deve testar cuidadosamente os seus módulos de extensão C com o Python 2.5.
ru: Раньше все эти семейства сводились к платформенным функциям :c:func:`malloc` и :c:func:`free`. Это означало, что не имело значения, если вы ошиблись и выделили память с помощью функции PyMem, но освободили ее с помощью функции PyObject . Благодаря изменениям obmalloc в версии 2.5 эти семейства теперь выполняют разные действия, и несоответствия, вероятно, приведут к сбою сегмента. Вам следует тщательно протестировать свои модули расширения C с помощью Python 2.5.

source: The built-in set types now have an official C API. Call :c:func:`PySet_New` and :c:func:`PyFrozenSet_New` to create a new set, :c:func:`PySet_Add` and :c:func:`PySet_Discard` to add and remove elements, and :c:func:`PySet_Contains` and :c:func:`PySet_Size` to examine the set's state. (Contributed by Raymond Hettinger.)
pt_pt: Os tipos de conjunto integrados agora têm uma API C oficial. Chame :c:func:`PySet_New` e :c:func:`PyFrozenSet_New` para criar um novo conjunto, :c:func:`PySet_Add` e :c:func:`PySet_Discard` para adicionar e remover elementos, e :c:func:`PySet_Contains` e :c:func:`PySet_Size` para examinar o estado do conjunto. (Contribuído por Raymond Hettinger.)
ru: Встроенные типы наборов теперь имеют официальный API C. Вызовите :c:func:`PySet_New` и :c:func:`PyFrozenSet_New` для создания нового набора, :c:func:`PySet_Add` и :c:func:`PySet_Discard` для добавления и удаления элементов и :c :func:`PySet_Contains` и :c:func:`PySet_Size` для проверки состояния набора. (Предоставлено Раймондом Хеттингером.)

source: C code can now obtain information about the exact revision of the Python interpreter by calling the :c:func:`Py_GetBuildInfo` function that returns a string of build information like this: ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contributed by Barry Warsaw.)
pt_pt: O código C pode agora obter informações sobre a revisão exata do interpretador Python chamando a função :c:func:`Py_GetBuildInfo`, que devolve uma *string* de informação de compilação como esta: ``"trunk:45355:45356M, Apr 13 2006, 07:42:19"``. (Contribuído por Barry Warsaw.)
ru: Код C теперь может получить информацию о точной версии интерпретатора Python, вызвав функцию :c:func:`Py_GetBuildInfo`, которая возвращает строку с информацией о сборке, подобную этой: ``"trunk:45355:45356M, 13 апреля 2006 г., 07 г. :42:19"``. (Предоставлено Барри Варшавой.)

source: Two new macros can be used to indicate C functions that are local to the current file so that a faster calling convention can be used. ``Py_LOCAL(type)`` declares the function as returning a value of the specified *type* and uses a fast-calling qualifier. ``Py_LOCAL_INLINE(type)`` does the same thing and also requests the function be inlined. If macro :c:macro:`!PY_LOCAL_AGGRESSIVE` is defined before :file:`python.h` is included, a set of more aggressive optimizations are enabled for the module; you should benchmark the results to find out if these optimizations actually make the code faster. (Contributed by Fredrik Lundh at the NeedForSpeed sprint.)
pt_pt: Dois novos macros podem ser usados para indicar funções C que são locais ao ficheiro atual, de modo que uma convenção de chamada mais rápida possa ser usada. ``Py_LOCAL(type)`` declara a função como devolvendo um valor do tipo especificado e usa um qualificador de chamada rápida. ``Py_LOCAL_INLINE(type)`` faz a mesma coisa e também solicita que a função seja embutida. Se o macro :c:macro:`!PY_LOCAL_AGGRESSIVE` for definido antes de :file:`python.h` ser incluído, um conjunto de otimizações mais agressivas é ativado para o módulo; deve medir o desempenho dos resultados para descobrir se estas otimizações realmente tornam o código mais rápido. (Contribuído por Fredrik Lundh no *sprint* NeedForSpeed.)
ru: Два новых макроса можно использовать для указания функций C, локальных по отношению к текущему файлу, что позволяет использовать более быстрое соглашение о вызовах. ``Py_LOCAL(type)`` объявляет функцию как возвращающую значение указанного *типа* и использует квалификатор быстрого вызова. ``Py_LOCAL_INLINE(type)`` делает то же самое, а также запрашивает встраивание функции. Если макрос :c:macro:`!PY_LOCAL_AGGRESSIVE` определен до включения :file:`python.h`, для модуля включается набор более агрессивных оптимизаций; вам следует сравнить результаты, чтобы выяснить, действительно ли эти оптимизации делают код быстрее. (Предоставлено Фредриком Лундом во время спринта NeedForSpeed.)

source: ``PyErr_NewException(name, base, dict)`` can now accept a tuple of base classes as its *base* argument. (Contributed by Georg Brandl.)
pt_pt: ``PyErr_NewException(name, base, dict)`` pode agora aceitar um tuplo de classes base como argumento *base*. (Contribuído por Georg Brandl.)
ru: ``PyErr_NewException(name, base, dict)`` теперь может принимать кортеж базовых классов в качестве аргумента *base*. (Предоставлено Георгом Брандлом.)

source: The :c:func:`!PyErr_Warn` function for issuing warnings is now deprecated in favour of ``PyErr_WarnEx(category, message, stacklevel)`` which lets you specify the number of stack frames separating this function and the caller. A *stacklevel* of 1 is the function calling :c:func:`PyErr_WarnEx`, 2 is the function above that, and so forth. (Added by Neal Norwitz.)
pt_pt: A função :c:func:`!PyErr_Warn` para emitir avisos está agora obsoleta em favor de ``PyErr_WarnEx(category, message, stacklevel)``, que permite especificar o número de quadros de pilha que separa esta função e o chamador. Um *stacklevel* de 1 é a função que chama :c:func:`PyErr_WarnEx`, 2 é a função acima dessa, e assim por diante. (Adicionado por Neal Norwitz.)
ru: Функция :c:func:`!PyErr_Warn` для выдачи предупреждений теперь устарела в пользу функции ``PyErr_WarnEx(category, message, stacklevel)``, которая позволяет указать количество кадров стека, разделяющих эту функцию и вызывающую функцию. *уровень стека*, равный 1, — это функция, вызывающая :c:func:`PyErr_WarnEx`, 2 — функция, расположенная над ней, и так далее. (Добавлено Нилом Норвицем.)

source: The CPython interpreter is still written in C, but the code can now be compiled with a C++ compiler without errors. (Implemented by Anthony Baxter, Martin von Löwis, Skip Montanaro.)
pt_pt: O interpretador CPython ainda é escrito em C, mas o código pode agora ser compilado com um compilador C++ sem erros. (Implementado por Anthony Baxter, Martin von Löwis, Skip Montanaro.)
ru: Интерпретатор CPython по-прежнему написан на C, но теперь код можно без ошибок скомпилировать с помощью компилятора C++. (Реализованы Энтони Бакстером, Мартином фон Лёвисом, Скипом Монтанаро.)

source: The :c:func:`!PyRange_New` function was removed. It was never documented, never used in the core code, and had dangerously lax error checking. In the unlikely case that your extensions were using it, you can replace it by something like the following::
pt_pt: A função :c:func:`!PyRange_New` foi removida. Nunca foi documentada, nunca foi usada no código principal e tinha verificação de erros perigosamente frouxa. No improvável caso de as suas extensões a estarem a usar, pode substituí-la por algo como o seguinte::
ru: Функция :c:func:`!PyRange_New` была удалена. Он никогда не документировался, никогда не использовался в основном коде и имел опасно слабую проверку ошибок. В том маловероятном случае, что ваши расширения использовали его, вы можете заменить его чем-то вроде следующего:

source: Port-Specific Changes
pt_pt: Alterações Específicas da Plataforma
ru: Изменения для конкретного порта
