Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.5.po
Languages: pt_pt, ru

source: Two new built-in functions, :func:`any` and :func:`all`, evaluate whether an iterator contains any true or false values. :func:`any` returns :const:`True` if any value returned by the iterator is true; otherwise it will return :const:`False`. :func:`all` returns :const:`True` only if all of the values returned by the iterator evaluate as true. (Suggested by Guido van Rossum, and implemented by Raymond Hettinger.)
pt_pt: Duas novas funções integradas, :func:`any` e :func:`all`, avaliam se um iterador contém valores verdadeiros ou falsos. :func:`any` devolve :const:`True` se algum valor devolvido pelo iterador for verdadeiro; caso contrário, devolverá :const:`False`. :func:`all` devolve :const:`True` apenas se todos os valores devolvidos pelo iterador forem avaliados como verdadeiros. (Sugerido por Guido van Rossum e implementado por Raymond Hettinger.)
ru: Две новые встроенные функции, :func:`any` и :func:`all`, оценивают, содержит ли итератор какие-либо значения true или false. :func:`any` возвращает :const:`True`, если какое-либо значение, возвращаемое итератором, истинно; в противном случае он вернет :const:`False`. :func:`all` возвращает :const:`True` только в том случае, если все значения, возвращаемые итератором, оцениваются как true. (Предложено Гвидо ван Россумом и реализовано Раймондом Хеттингером.)

source: The result of a class's :meth:`__hash__` method can now be either a long integer or a regular integer. If a long integer is returned, the hash of that value is taken. In earlier versions the hash value was required to be a regular integer, but in 2.5 the :func:`id` built-in was changed to always return non-negative numbers, and users often seem to use ``id(self)`` in :meth:`__hash__` methods (though this is discouraged).
pt_pt: O resultado do método :meth:`__hash__` de uma classe pode agora ser um inteiro longo ou um inteiro regular. Se um inteiro longo for devolvido, o *hash* desse valor é obtido. Em versões anteriores, o valor de *hash* tinha de ser um inteiro regular, mas no 2.5, a função integrada :func:`id` foi alterada para devolver sempre números não negativos, e os utilizadores frequentemente parecem usar ``id(self)`` em métodos :meth:`__hash__` (embora isto seja desencorajado).
ru: Результатом метода :meth:`__hash__` класса теперь может быть либо длинное целое число, либо обычное целое число. Если возвращается длинное целое число, берется хэш этого значения. В более ранних версиях хэш-значение должно было быть обычным целым числом, но в версии 2.5 встроенная функция :func:`id` была изменена, чтобы всегда возвращать неотрицательные числа, и пользователи часто используют ``id(self)` ` в методах :meth:`__hash__` (хотя это не рекомендуется).

source: ASCII is now the default encoding for modules. It's now a syntax error if a module contains string literals with 8-bit characters but doesn't have an encoding declaration. In Python 2.4 this triggered a warning, not a syntax error. See :pep:`263` for how to declare a module's encoding; for example, you might add a line like this near the top of the source file::
pt_pt: ASCII é agora a codificação predefinida para módulos. É agora um erro de sintaxe se um módulo contiver literais de *string* com caracteres de 8 bits, mas não tiver uma declaração de codificação. No Python 2.4, isto gerava um aviso, não um erro de sintaxe. Veja a :pep:`263` para saber como declarar a codificação de um módulo; por exemplo, pode adicionar uma linha como esta perto do topo do ficheiro de origem::
ru: ASCII теперь является кодировкой по умолчанию для модулей. Теперь синтаксическая ошибка возникает, если модуль содержит строковые литералы с 8-битными символами, но не имеет объявления кодировки. В Python 2.4 это вызывало предупреждение, а не синтаксическую ошибку. См. :pep:`263`, чтобы узнать, как объявить кодировку модуля; например, вы можете добавить такую ​​строку в начало исходного файла::

source: A new warning, :class:`UnicodeWarning`, is triggered when you attempt to compare a Unicode string and an 8-bit string that can't be converted to Unicode using the default ASCII encoding. The result of the comparison is false::
pt_pt: Um novo aviso, :class:`UnicodeWarning`, é gerado quando tenta comparar uma *string* Unicode e uma *string* de 8 bits que não pode ser convertida para Unicode usando a codificação ASCII predefinida. O resultado da comparação é falso::
ru: Новое предупреждение :class:`UnicodeWarning` выдается при попытке сравнить строку Unicode и 8-битную строку, которую невозможно преобразовать в Unicode с использованием кодировки ASCII по умолчанию. Результат сравнения ложный::

source: >>> chr(128) == unichr(128) # Can't convert chr(128) to Unicode __main__:1: UnicodeWarning: Unicode equal comparison failed to convert both arguments to Unicode - interpreting them as being unequal False >>> chr(127) == unichr(127) # chr(127) can be converted True
pt_pt: >>> chr(128) == unichr(128) # Não é possível converter chr(128) para Unicode __main__:1: UnicodeWarning: Falhou a comparação igual de Unicode ao converter ambos os argumentos para Unicode - interpretando-os como sendo desiguais False >>> chr(127) == unichr(127) # chr(127) pode ser convertido True

source: Previously this would raise a :class:`UnicodeDecodeError` exception, but in 2.5 this could result in puzzling problems when accessing a dictionary. If you looked up ``unichr(128)`` and ``chr(128)`` was being used as a key, you'd get a :class:`UnicodeDecodeError` exception. Other changes in 2.5 resulted in this exception being raised instead of suppressed by the code in :file:`dictobject.c` that implements dictionaries.
pt_pt: Anteriormente, isto geraria uma exceção :class:`UnicodeDecodeError`, mas no 2.5 isto poderia resultar em problemas confusos ao aceder a um dicionário. Se procurasse ``unichr(128)`` e ``chr(128)`` estivesse a ser usado como chave, obteria uma exceção :class:`UnicodeDecodeError`. Outras alterações no 2.5 resultaram nesta exceção ser gerada em vez de ser suprimida pelo código em :file:`dictobject.c` que implementa dicionários.
ru: Раньше это вызывало исключение :class:`UnicodeDecodeError`, но в версии 2.5 это могло привести к загадочным проблемам при доступе к словарю. Если вы посмотрите ``unichr(128)`` и ``chr(128)`` используется в качестве ключа, вы получите исключение :class:`UnicodeDecodeError`. Другие изменения в версии 2.5 привели к тому, что это исключение возникло, а не подавлялось кодом в :file:`dictobject.c`, который реализует словари.

source: Raising an exception for such a comparison is strictly correct, but the change might have broken code, so instead :class:`UnicodeWarning` was introduced.
pt_pt: Gerar uma exceção para uma comparação deste tipo é estritamente correto, mas a alteração poderia ter quebrado código, pelo que, em vez disso, foi introduzido o :class:`UnicodeWarning`.
ru: Вызов исключения для такого сравнения абсолютно корректен, но это изменение могло привести к поломке кода, поэтому вместо этого было введено :class:`UnicodeWarning`.

source: (Implemented by Marc-André Lemburg.)
pt_pt: (Implementado por Marc-André Lemburg.)
ru: (Реализован Марком-Андре Лембургом.)

source: One error that Python programmers sometimes make is forgetting to include an :file:`__init__.py` module in a package directory. Debugging this mistake can be confusing, and usually requires running Python with the :option:`-v` switch to log all the paths searched. In Python 2.5, a new :exc:`ImportWarning` warning is triggered when an import would have picked up a directory as a package but no :file:`__init__.py` was found. This warning is silently ignored by default; provide the :option:`-Wd <-W>` option when running the Python executable to display the warning message. (Implemented by Thomas Wouters.)
pt_pt: Um erro que os programadores Python às vezes cometem é esquecer-se de incluir um módulo :file:`__init__.py` num diretório de pacote. Depurar este erro pode ser confuso e geralmente requer executar o Python com a opção :option:`-v` para registar todos os caminhos procurados. No Python 2.5, um novo aviso :exc:`ImportWarning` é gerado quando uma importação teria selecionado um diretório como um pacote, mas nenhum :file:`__init__.py` foi encontrado. Este aviso é ignorado silenciosamente por predefinição; forneça a opção :option:`-Wd <-W>` ao executar o executável Python para exibir a mensagem de aviso. (Implementado por Thomas Wouters.)
ru: Одна из ошибок, которую иногда допускают программисты Python, — это забывание включить модуль :file:`__init__.py` в каталог пакета. Отладка этой ошибки может сбить с толку и обычно требует запуска Python с ключом :option:`-v` для регистрации всех найденных путей. В Python 2.5 новое предупреждение :exc:`ImportWarning` срабатывает, когда при импорте каталог был бы выбран как пакет, но :file:`__init__.py` не найден. По умолчанию это предупреждение игнорируется; укажите параметр :option:`-Wd <-W>` при запуске исполняемого файла Python для отображения предупреждающего сообщения. (Реализовано Томасом Воутерсом.)

source: The list of base classes in a class definition can now be empty. As an example, this is now legal::
pt_pt: A lista de classes base numa definição de classe pode agora estar vazia. Como exemplo, isto é agora legal::
ru: Список базовых классов в определении класса теперь может быть пустым. Например, теперь это законно:

source: (Implemented by Brett Cannon.)
pt_pt: (Implementado por Brett Cannon.)
ru: (Реализован Бреттом Кэнноном.)

source: Interactive Interpreter Changes
pt_pt: Alterações no Interpretador Interativo
ru: Изменения в интерактивном интерпретаторе

source: In the interactive interpreter, ``quit`` and ``exit`` have long been strings so that new users get a somewhat helpful message when they try to quit::
pt_pt: No interpretador interativo, ``quit`` e ``exit`` têm sido há muito tempo *strings* para que novos utilizadores obtenham uma mensagem algo útil quando tentam sair::
ru: В интерактивном интерпретаторе ``quit`` и ``exit`` уже давно являются строками, поэтому новые пользователи получают полезное сообщение при попытке выйти:

source: >>> quit 'Use Ctrl-D (i.e. EOF) to exit.'
pt_pt: >>> quit 'Use Ctrl-D (ou seja, EOF) para sair.'

source: In Python 2.5, ``quit`` and ``exit`` are now objects that still produce string representations of themselves, but are also callable. Newbies who try ``quit()`` or ``exit()`` will now exit the interpreter as they expect. (Implemented by Georg Brandl.)
pt_pt: No Python 2.5, ``quit`` e ``exit`` são agora objetos que ainda produzem representações de *string* de si mesmos, mas também são chamáveis. Novatos que tentam ``quit()`` ou ``exit()`` sairão agora do interpretador como esperam. (Implementado por Georg Brandl.)
ru: В Python 2.5 «quit» и «exit» теперь являются объектами, которые по-прежнему создают строковые представления самих себя, но также могут быть вызваны. Новички, которые попробуют ``quit()`` или ``exit()``, теперь будут выходить из интерпретатора, как они ожидают. (Реализован Георгом Брандлом.)

source: The Python executable now accepts the standard long options :option:`--help` and :option:`--version`; on Windows, it also accepts the :option:`/? <-?>` option for displaying a help message. (Implemented by Georg Brandl.)
pt_pt: O executável Python agora aceita as opções longas padrão :option:`--help` e :option:`--version`; no Windows, também aceita a opção :option:`/? <-?>` para exibir uma mensagem de ajuda. (Implementado por Georg Brandl.)
ru: Исполняемый файл Python теперь принимает стандартные длинные параметры :option:`--help` и :option:`--version`; в Windows он также принимает :option:`/? <-?>` опция для отображения справочного сообщения. (Реализован Георгом Брандлом.)

source: Optimizations
pt_pt: Otimizações
ru: Оптимизации

source: Several of the optimizations were developed at the NeedForSpeed sprint, an event held in Reykjavik, Iceland, from May 21--28 2006. The sprint focused on speed enhancements to the CPython implementation and was funded by EWT LLC with local support from CCP Games. Those optimizations added at this sprint are specially marked in the following list.
pt_pt: Várias das otimizações foram desenvolvidas no *sprint* NeedForSpeed, um evento realizado em Reykjavik, Islândia, de 21 a 28 de maio de 2006. O *sprint* focou-se em melhorias de velocidade para a implementação CPython e foi financiado pela EWT LLC com suporte local da CCP Games. As otimizações adicionadas neste *sprint* estão especialmente marcadas na lista seguinte.
ru: Несколько оптимизаций были разработаны в ходе спринта NeedForSpeed, мероприятия, проходившего в Рейкьявике, Исландия, с 21 по 28 мая 2006 года. Спринт был сосредоточен на повышении скорости реализации CPython и финансировался EWT LLC при местной поддержке CCP Games. Оптимизации, добавленные в этом спринте, специально отмечены в следующем списке.

source: When they were introduced in Python 2.4, the built-in :class:`set` and :class:`frozenset` types were built on top of Python's dictionary type. In 2.5 the internal data structure has been customized for implementing sets, and as a result sets will use a third less memory and are somewhat faster. (Implemented by Raymond Hettinger.)
pt_pt: Quando foram introduzidos no Python 2.4, os tipos integrados :class:`set` e :class:`frozenset` foram construídos sobre o tipo de dicionário do Python. No 2.5, a estrutura de dados interna foi personalizada para implementar conjuntos, e, como resultado, os conjuntos usarão um terço a menos de memória e são algo mais rápidos. (Implementado por Raymond Hettinger.)
ru: Когда они были представлены в Python 2.4, встроенные типы :class:`set` и :class:`frozenset` были построены поверх словарного типа Python. В версии 2.5 внутренняя структура данных была настроена для реализации наборов, в результате наборы будут использовать на треть меньше памяти и работать несколько быстрее. (Реализовано Раймондом Хеттингером.)

source: The speed of some Unicode operations, such as finding substrings, string splitting, and character map encoding and decoding, has been improved. (Substring search and splitting improvements were added by Fredrik Lundh and Andrew Dalke at the NeedForSpeed sprint. Character maps were improved by Walter Dörwald and Martin von Löwis.)
pt_pt: A velocidade de algumas operações Unicode, como encontrar substrings, divisão de *strings* e codificação/descodificação de mapas de caracteres, foi melhorada. (As melhorias na pesquisa e divisão de substrings foram adicionadas por Fredrik Lundh e Andrew Dalke no *sprint* NeedForSpeed. Os mapas de caracteres foram melhorados por Walter Dörwald e Martin von Löwis.)
ru: Была улучшена скорость некоторых операций Unicode, таких как поиск подстрок, разделение строк, а также кодирование и декодирование карты символов. (Усовершенствования поиска подстрок и разделения были добавлены Фредриком Лундом и Эндрю Далком во время спринта NeedForSpeed. Карты символов были улучшены Вальтером Дорвальдом и Мартином фон Лёвисом.)

source: The ``long(str, base)`` function is now faster on long digit strings because fewer intermediate results are calculated. The peak is for strings of around 800--1000 digits where the function is 6 times faster. (Contributed by Alan McIntyre and committed at the NeedForSpeed sprint.)
pt_pt: A função ``long(str, base)`` é agora mais rápida em *strings* de dígitos longos porque são calculados menos resultados intermédios. O pico é para *strings* de cerca de 800--1000 dígitos, onde a função é 6 vezes mais rápida. (Contribuído por Alan McIntyre e confirmado no *sprint* NeedForSpeed.)
ru: Функция long(str, base) теперь работает быстрее с длинными строками цифр, поскольку вычисляется меньше промежуточных результатов. Пик приходится на строки длиной около 800–1000 цифр, где функция работает в 6 раз быстрее. (Предоставлено Аланом Макинтайром и выполнено во время спринта NeedForSpeed.)

source: It's now illegal to mix iterating over a file with ``for line in file`` and calling the file object's :meth:`read`/:meth:`readline`/:meth:`readlines` methods. Iteration uses an internal buffer and the :meth:`!read\*` methods don't use that buffer. Instead they would return the data following the buffer, causing the data to appear out of order. Mixing iteration and these methods will now trigger a :exc:`ValueError` from the :meth:`!read\*` method. (Implemented by Thomas Wouters.)
pt_pt: É agora ilegal misturar a iteração sobre um ficheiro com ``for line in file`` e chamar os métodos :meth:`read`/:meth:`readline`/:meth:`readlines` do objeto de ficheiro. A iteração usa um buffer interno e os métodos :meth:`!read\*` não usam esse buffer. Em vez disso, devolveriam os dados seguintes ao buffer, fazendo com que os dados apareçam fora de ordem. Misturar iteração e estes métodos irá agora gerar um :exc:`ValueError` do método :meth:`!read\*`. (Implementado por Thomas Wouters.)
ru: Теперь запрещено совмещать итерацию по файлу с ``for line in file`` и вызовом методов :meth:`read`/:meth:`readline`/:meth:`readlines` объекта файла. Итерация использует внутренний буфер, а методы :meth:`!read\*` не используют этот буфер. Вместо этого они возвращали данные, следующие за буфером, в результате чего данные оказывались не в порядке. Смешивание итерации и этих методов теперь будет вызывать :exc:`ValueError` из метода :meth:`!read\*`. (Реализовано Томасом Воутерсом.)

source: The :mod:`struct` module now compiles structure format strings into an internal representation and caches this representation, yielding a 20% speedup. (Contributed by Bob Ippolito at the NeedForSpeed sprint.)
pt_pt: O módulo :mod:`struct` agora compila *strings* de formato de estrutura numa representação interna e guarda em cache esta representação, resultando num aumento de velocidade de 20%. (Contribuído por Bob Ippolito no *sprint* NeedForSpeed.)
ru: Модуль :mod:`struct` теперь компилирует строки формата структуры во внутреннее представление и кэширует это представление, что дает ускорение на 20%. (Предоставлено Бобом Ипполито во время спринта NeedForSpeed.)

source: The :mod:`re` module got a 1 or 2% speedup by switching to Python's allocator functions instead of the system's :c:func:`malloc` and :c:func:`free`. (Contributed by Jack Diederich at the NeedForSpeed sprint.)
pt_pt: O módulo :mod:`re` obteve um aumento de velocidade de 1 ou 2% ao mudar para as funções de alocação do Python em vez das funções do sistema :c:func:`malloc` e :c:func:`free`. (Contribuído por Jack Diederich no *sprint* NeedForSpeed.)
ru: Модуль :mod:`re` получил ускорение на 1 или 2% за счет переключения на функции распределения Python вместо системных :c:func:`malloc` и :c:func:`free`. (Предоставлено Джеком Дидерихом во время спринта NeedForSpeed.)

source: The code generator's peephole optimizer now performs simple constant folding in expressions. If you write something like ``a = 2+3``, the code generator will do the arithmetic and produce code corresponding to ``a = 5``. (Proposed and implemented by Raymond Hettinger.)
pt_pt: O otimizador de *peephole* do gerador de código agora realiza a dobragem de constantes simples em expressões. Se escrever algo como ``a = 2+3``, o gerador de código fará a aritmética e produzirá código correspondente a ``a = 5``. (Proposto e implementado por Raymond Hettinger.)
ru: Оптимизатор «глазок» генератора кода теперь выполняет простое свертывание констант в выражениях. Если вы напишете что-то вроде «a = 2+3», генератор кода выполнит арифметические действия и выдаст код, соответствующий «a = 5». (Предложено и реализовано Раймондом Хеттингером.)

source: Function calls are now faster because code objects now keep the most recently finished frame (a "zombie frame") in an internal field of the code object, reusing it the next time the code object is invoked. (Original patch by Michael Hudson, modified by Armin Rigo and Richard Jones; committed at the NeedForSpeed sprint.) Frame objects are also slightly smaller, which may improve cache locality and reduce memory usage a bit. (Contributed by Neal Norwitz.)
pt_pt: As chamadas de função são agora mais rápidas porque os objetos de código agora mantêm o quadro mais recentemente terminado (um "quadro zumbi") num campo interno do objeto de código, reutilizando-o na próxima vez que o objeto de código é invocado. (Patch original de Michael Hudson, modificado por Armin Rigo e Richard Jones; confirmado no *sprint* NeedForSpeed.) Os objetos de quadro também são ligeiramente menores, o que pode melhorar a localidade da cache e reduzir um pouco o uso de memória. (Contribuído por Neal Norwitz.)
ru: Вызовы функций теперь выполняются быстрее, поскольку объекты кода теперь сохраняют последний завершенный кадр («фрейм-зомби») во внутреннем поле объекта кода, повторно используя его при следующем вызове объекта кода. (Оригинальный патч Майкла Хадсона, измененный Армином Риго и Ричардом Джонсом; зафиксирован во время спринта NeedForSpeed.) Объекты фреймов также немного меньше, что может улучшить локальность кэша и немного уменьшить использование памяти. (Предоставлено Нилом Норвицем.)

source: Python's built-in exceptions are now new-style classes, a change that speeds up instantiation considerably. Exception handling in Python 2.5 is therefore about 30% faster than in 2.4. (Contributed by Richard Jones, Georg Brandl and Sean Reifschneider at the NeedForSpeed sprint.)
pt_pt: As exceções integradas do Python são agora classes de novo estilo, uma alteração que acelera consideravelmente a instanciação. O tratamento de exceções no Python 2.5 é, portanto, cerca de 30% mais rápido do que no 2.4. (Contribuído por Richard Jones, Georg Brandl e Sean Reifschneider no *sprint* NeedForSpeed.)
ru: Встроенные исключения Python теперь представляют собой классы нового стиля, и это изменение значительно ускоряет создание экземпляров. Таким образом, обработка исключений в Python 2.5 происходит примерно на 30% быстрее, чем в версии 2.4. (Предоставлено Ричардом Джонсом, Георгом Брандлом и Шоном Райфшнайдером во время спринта NeedForSpeed.)

source: Importing now caches the paths tried, recording whether they exist or not so that the interpreter makes fewer :c:func:`open` and :c:func:`stat` calls on startup. (Contributed by Martin von Löwis and Georg Brandl.)
pt_pt: A importação agora guarda em cache os caminhos tentados, registando se existem ou não, para que o interpretador faça menos chamadas :c:func:`open` e :c:func:`stat` no arranque. (Contribuído por Martin von Löwis e Georg Brandl.)
ru: При импорте теперь кэшируются проверенные пути, фиксируя, существуют они или нет, чтобы интерпретатор делал меньше вызовов :c:func:`open` и :c:func:`stat` при запуске. (Сообщили Мартин фон Лёвис и Георг Брандл.)

source: New, Improved, and Removed Modules
pt_pt: Módulos Novos, Melhorados e Removidos
ru: Новые, улучшенные и удаленные модули

source: The standard library received many enhancements and bug fixes in Python 2.5. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the SVN logs for all the details.
pt_pt: A biblioteca padrão recebeu muitas melhorias e correções de *bugs* no Python 2.5. Aqui está uma lista parcial das alterações mais notáveis, ordenadas alfabeticamente por nome de módulo. Consulte o ficheiro :file:`Misc/NEWS` na árvore de origem para uma lista mais completa de alterações, ou consulte os registos SVN para todos os detalhes.
ru: Стандартная библиотека получила множество улучшений и исправлений ошибок в Python 2.5. Вот неполный список наиболее заметных изменений, отсортированный в алфавитном порядке по названию модуля. Обратитесь к файлу :file:`Misc/NEWS` в дереве исходного кода для получения более полного списка изменений или просмотрите журналы SVN для получения всех подробностей.
