Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.7.po
Languages: ru

source: New function: :c:func:`PySys_SetArgvEx` sets the value of ``sys.argv`` and can optionally update ``sys.path`` to include the directory containing the script named by ``sys.argv[0]`` depending on the value of an *updatepath* parameter.
ru: Новая функция: :c:func:`PySys_SetArgvEx` устанавливает значение ``sys.argv`` и может дополнительно обновить ``sys.path``, включив в него каталог, содержащий скрипт, названный ``sys.argv[0] `` в зависимости от значения параметра *updatepath*.

source: This function was added to close a security hole for applications that embed Python. The old function, :c:func:`PySys_SetArgv`, would always update ``sys.path``, and sometimes it would add the current directory. This meant that, if you ran an application embedding Python in a directory controlled by someone else, attackers could put a Trojan-horse module in the directory (say, a file named :file:`os.py`) that your application would then import and run.
ru: Эта функция была добавлена, чтобы закрыть дыру в безопасности для приложений, встраивающих Python. Старая функция :c:func:`PySys_SetArgv` всегда обновляла ``sys.path``, а иногда добавляла текущий каталог. Это означало, что если вы запустили приложение, встраивающее Python, в каталог, контролируемый кем-то другим, злоумышленники могли поместить в каталог модуль «троянского коня» (скажем, файл с именем :file:`os.py`), который затем будет использовать ваше приложение. импортируйте и запустите.

source: If you maintain a C/C++ application that embeds Python, check whether you're calling :c:func:`PySys_SetArgv` and carefully consider whether the application should be using :c:func:`PySys_SetArgvEx` with *updatepath* set to false.
ru: Если вы поддерживаете приложение C/C++ со встроенным Python, проверьте, вызываете ли вы :c:func:`PySys_SetArgv`, и внимательно подумайте, должно ли приложение использовать :c:func:`PySys_SetArgvEx` с параметром *updatepath*, установленным в false. .

source: New macros: the Python header files now define the following macros: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, :c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER`, and :c:macro:`Py_TOUPPER`. All of these functions are analogous to the C standard macros for classifying characters, but ignore the current locale setting, because in several places Python needs to analyze characters in a locale-independent way. (Added by Eric Smith; :issue:`5793`.)
ru: Новые макросы: файлы заголовков Python теперь определяют следующие макросы: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, : c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER` и :c:macro:`Py_TOUPPER`. Все эти функции аналогичны стандартным макросам C для классификации символов, но игнорируют текущие настройки локали, поскольку в некоторых местах Python необходимо анализировать символы независимым от локали способом. (Добавлено Эриком Смитом; :issue:`5793`.)

source: The complicated interaction between threads and process forking has been changed. Previously, the child process created by :func:`os.fork` might fail because the child is created with only a single thread running, the thread performing the :func:`os.fork`. If other threads were holding a lock, such as Python's import lock, when the fork was performed, the lock would still be marked as "held" in the new process. But in the child process nothing would ever release the lock, since the other threads weren't replicated, and the child process would no longer be able to perform imports.
ru: Изменено сложное взаимодействие между потоками и разветвлением процессов. Раньше дочерний процесс, созданный :func:`os.fork`, мог завершиться неудачей, поскольку дочерний процесс создавался только с одним работающим потоком, исполняющим :func:`os.fork`. Если бы другие потоки удерживали блокировку, например блокировку импорта Python, при выполнении вилки блокировка все равно была бы помечена как «удерживаемая» в новом процессе. Но в дочернем процессе ничто никогда не сможет снять блокировку, поскольку другие потоки не реплицируются, и дочерний процесс больше не сможет выполнять импорт.

source: Python 2.7 acquires the import lock before performing an :func:`os.fork`, and will also clean up any locks created using the :mod:`threading` module. C extension modules that have internal locks, or that call :c:func:`fork()` themselves, will not benefit from this clean-up.
ru: Python 2.7 получает блокировку импорта перед выполнением :func:`os.fork`, а также очищает все блокировки, созданные с помощью модуля :mod:`threading`. Модули расширения C, имеющие внутренние блокировки или сами вызывающие :c:func:`fork()`, не выиграют от этой очистки.

source: (Fixed by Thomas Wouters; :issue:`1590864`.)
ru: (Исправлено Томасом Воутерсом; :issue:`1590864`.)

source: Global symbols defined by the :mod:`ctypes` module are now prefixed with ``Py``, or with ``_ctypes``. (Implemented by Thomas Heller; :issue:`3102`.)
ru: Глобальные символы, определенные модулем :mod:`ctypes`, теперь имеют префикс ``Py`` или ``_ctypes``. (Реализовано Томасом Хеллером; :issue:`3102`.)

source: New configure option: the :option:`!--with-valgrind` option will now disable the pymalloc allocator, which is difficult for the Valgrind memory-error detector to analyze correctly. Valgrind will therefore be better at detecting memory leaks and overruns. (Contributed by James Henstridge; :issue:`2422`.)
ru: Новая опция конфигурации: опция :option:`!--with-valgrind` теперь отключает распределитель pymalloc, который трудно правильно проанализировать детектору ошибок памяти Valgrind. Таким образом, Valgrind будет лучше обнаруживать утечки и перерасходы памяти. (Предоставлено Джеймсом Хенстриджем; :issue:`2422`.)

source: New configure option: you can now supply an empty string to :option:`!--with-dbmliborder=` in order to disable all of the various DBM modules. (Added by Arfrever Frehtes Taifersar Arahesis; :issue:`6491`.)
ru: Новая опция конфигурации: теперь вы можете указать пустую строку в :option:`!--with-dbmliborder=`, чтобы отключить все различные модули DBM. (Добавил Арфревер Фрехтес Тайферсар Арахесис; :issue:`6491`.)

source: The :program:`configure` script now checks for floating-point rounding bugs on certain 32-bit Intel chips and defines a :c:macro:`X87_DOUBLE_ROUNDING` preprocessor definition. No code currently uses this definition, but it's available if anyone wishes to use it. (Added by Mark Dickinson; :issue:`2937`.)
ru: Скрипт :program:`configure` теперь проверяет наличие ошибок округления с плавающей запятой на некоторых 32-битных чипах Intel и определяет определение препроцессора :c:macro:`X87_DOUBLE_ROUNDING`. Ни один код в настоящее время не использует это определение, но оно доступно, если кто-то захочет его использовать. (Добавлено Марком Дикинсоном; :issue:`2937`.)

source: :program:`configure` also now sets a :envvar:`LDCXXSHARED` Makefile variable for supporting C++ linking. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`1222585`.)
ru: :program:`configure` также теперь устанавливает переменную Makefile :envvar:`LDCXXSHARED` для поддержки компоновки C++. (Предоставлено Арфревером Фрехтесом Тайферсаром Арахесисом; :issue:`1222585`.)

source: The build process now creates the necessary files for pkg-config support. (Contributed by Clinton Roy; :issue:`3585`.)
ru: Теперь в процессе сборки создаются необходимые файлы для поддержки pkg-config. (Предоставлено Клинтоном Роем; :issue:`3585`.)

source: The build process now supports Subversion 1.7. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`6094`.)
ru: Процесс сборки теперь поддерживает Subversion 1.7. (Предоставлено Арфревером Фрехтесом Тайферсаром Арахесисом; :issue:`6094`.)

source: Capsules
ru: Оболочки

source: Python 3.1 adds a new C datatype, :c:type:`PyCapsule`, for providing a C API to an extension module. A capsule is essentially the holder of a C ``void *`` pointer, and is made available as a module attribute; for example, the :mod:`socket` module's API is exposed as ``socket.CAPI``, and :mod:`unicodedata` exposes ``ucnhash_CAPI``. Other extensions can import the module, access its dictionary to get the capsule object, and then get the ``void *`` pointer, which will usually point to an array of pointers to the module's various API functions.
ru: В Python 3.1 добавлен новый тип данных C, :c:type:`PyCapsule`, для предоставления C API модулю расширения. Капсула по существу является держателем указателя C ``void *`` и доступна как атрибут модуля; например, API модуля :mod:`socket` представлен как ``socket.CAPI``, а :mod:`unicodedata` предоставляет ``ucnhash_CAPI``. Другие расширения могут импортировать модуль, получить доступ к его словарю для получения объекта капсулы, а затем получить указатель ``void *``, который обычно указывает на массив указателей на различные функции API модуля.

source: You are assured that ``vtable`` points to whatever you're expecting. If a different capsule was passed in, :c:func:`PyCapsule_IsValid` would detect the mismatched name and return false. Refer to :ref:`using-capsules` for more information on using these objects.
ru: Вы можете быть уверены, что ``vtable`` указывает на то, что вы ожидаете. Если была передана другая капсула, :c:func:`PyCapsule_IsValid` обнаружит несовпадающее имя и вернет false. Обратитесь к :ref:`using-capsules` для получения дополнительной информации об использовании этих объектов.

source: Implemented in Python 3.1 and backported to 2.7 by Larry Hastings; discussed in :issue:`5630`.
ru: Реализовано в Python 3.1 и перенесено в версию 2.7 Ларри Гастингсом; обсуждалось в :issue:`5630`.

source: Port-Specific Changes: Windows
ru: Изменения для конкретного порта: Windows

source: The :func:`os.listdir` function now correctly fails for an empty path. (Fixed by Hirokazu Yamamoto; :issue:`5913`.)
ru: Функция :func:`os.listdir` теперь корректно завершается с ошибкой при пустом пути. (Исправлено Хирокадзу Ямамото; :issue:`5913`.)

source: Port-Specific Changes: Mac OS X
ru: Изменения, специфичные для порта: Mac OS X

source: The path ``/Library/Python/2.7/site-packages`` is now appended to ``sys.path``, in order to share added packages between the system installation and a user-installed copy of the same version. (Changed by Ronald Oussoren; :issue:`4865`.)
ru: Путь ``/Library/Python/2.7/site-packages`` теперь добавлен к ``sys.path``, чтобы совместно использовать добавленные пакеты между установкой системы и установленной пользователем копией той же версии. (Изменено Рональдом Уссореном; :issue:`4865`.)

source: As of 2.7.13, this change was removed. ``/Library/Python/2.7/site-packages``, the site-packages directory used by the Apple-supplied system Python 2.7 is no longer appended to ``sys.path`` for user-installed Pythons such as from the python.org installers. As of macOS 10.12, Apple changed how the system site-packages directory is configured, which could cause installation of pip components, like setuptools, to fail. Packages installed for the system Python will no longer be shared with user-installed Pythons. (:issue:`28440`)
ru: Начиная с версии 2.7.13 это изменение было удалено. ``/Library/Python/2.7/site-packages``, каталог site-packages, используемый системой Python 2.7, поставляемой Apple, больше не добавляется к ``sys.path`` для установленных пользователем Python, например из установщики python.org. Начиная с macOS 10.12, Apple изменила настройку системного каталога site-packages, что могло привести к сбою установки компонентов pip, таких как setuptools. Пакеты, установленные для системного Python, больше не будут доступны для Python, установленных пользователем. (:issue:`28440`)

source: Port-Specific Changes: FreeBSD
ru: Изменения для конкретного порта: FreeBSD

source: Other Changes and Fixes
ru: Другие изменения и исправления

source: Two benchmark scripts, :file:`iobench` and :file:`ccbench`, were added to the :file:`Tools` directory. :file:`iobench` measures the speed of the built-in file I/O objects returned by :func:`open` while performing various operations, and :file:`ccbench` is a concurrency benchmark that tries to measure computing throughput, thread switching latency, and IO processing bandwidth when performing several tasks using a varying number of threads.
ru: Два сценария тестирования, :file:`iobench` и :file:`ccbench`, были добавлены в каталог :file:`Tools`. :file:`iobench` измеряет скорость встроенных файловых объектов ввода-вывода, возвращаемых :func:`open` при выполнении различных операций, а :file:`ccbench` — это тест параллелизма, который пытается измерить пропускную способность вычислений. задержка переключения потоков и пропускная способность обработки ввода-вывода при выполнении нескольких задач с использованием различного количества потоков.

source: The :file:`Tools/i18n/msgfmt.py` script now understands plural forms in :file:`.po` files. (Fixed by Martin von Löwis; :issue:`5464`.)
ru: Скрипт :file:`Tools/i18n/msgfmt.py` теперь понимает формы множественного числа в файлах :file:`.po`. (Исправлено Мартином фон Лёвисом; :issue:`5464`.)

source: The :file:`regrtest.py` script now takes a :option:`!--randseed=` switch that takes an integer that will be used as the random seed for the :option:`!-r` option that executes tests in random order. The :option:`!-r` option also reports the seed that was used (Added by Collin Winter.)
ru: Скрипт :file:`regrtest.py` теперь использует переключатель :option:`!--randseed=`, который принимает целое число, которое будет использоваться в качестве случайного начального числа для опции :option:`!-r`, выполняющей тесты. в случайном порядке. Параметр :option:`!-r` также сообщает об использованном семени (добавлено Коллином Уинтером).

source: Another :file:`regrtest.py` switch is :option:`!-j`, which takes an integer specifying how many tests run in parallel. This allows reducing the total runtime on multi-core machines. This option is compatible with several other options, including the :option:`!-R` switch which is known to produce long runtimes. (Added by Antoine Pitrou, :issue:`6152`.) This can also be used with a new :option:`!-F` switch that runs selected tests in a loop until they fail. (Added by Antoine Pitrou; :issue:`7312`.)
ru: Другой ключ :file:`regrtest.py` — :option:`!-j`, который принимает целое число, указывающее, сколько тестов выполняется параллельно. Это позволяет сократить общее время работы на многоядерных машинах. Эта опция совместима с несколькими другими опциями, включая переключатель :option:`!-R`, который, как известно, приводит к длительному времени работы. (Добавлено Антуаном Питру, :issue:`6152`.) Это также можно использовать с новым переключателем :option:`!-F`, который запускает выбранные тесты в цикле до тех пор, пока они не завершатся неудачей. (Добавлено Антуаном Питру; :issue:`7312`.)

source: When executed as a script, the :file:`py_compile.py` module now accepts ``'-'`` as an argument, which will read standard input for the list of filenames to be compiled. (Contributed by Piotr Ożarowski; :issue:`8233`.)
ru: При выполнении как скрипт модуль :file:`py_compile.py` теперь принимает ``'-'`` в качестве аргумента, который будет считывать стандартный ввод для получения списка имен файлов, подлежащих компиляции. (Предоставлено Петром Ожаровским; :issue:`8233`.)

source: Porting to Python 2.7
ru: Портирование на Python 2.7

source: This section lists previously described changes and other bugfixes that may require changes to your code:
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код:

source: The string :meth:`format` method changed the default precision used for floating-point and complex numbers from 6 decimal places to 12, which matches the precision used by :func:`str`. (Changed by Eric Smith; :issue:`5920`.)
ru: Строковый метод :meth:`format` изменил точность по умолчанию, используемую для чисел с плавающей запятой и комплексных чисел, с 6 десятичных знаков на 12, что соответствует точности, используемой :func:`str`. (Изменено Эриком Смитом; :issue:`5920`.)

source: In the standard library:
ru: В стандартной библиотеке:

source: Operations with :class:`~datetime.datetime` instances that resulted in a year falling outside the supported range didn't always raise :exc:`OverflowError`. Such errors are now checked more carefully and will now raise the exception. (Reported by Mark Leander, patch by Anand B. Pillai and Alexander Belopolsky; :issue:`7150`.)
ru: Операции с экземплярами :class:`~datetime.datetime`, в результате которых год выходит за пределы поддерживаемого диапазона, не всегда вызывали :exc:`OverflowError`. Такие ошибки теперь проверяются более тщательно и вызывают исключение. (Сообщил Марк Леандер, патч Ананда Б. Пиллая и Александра Белопольского; :issue:`7150`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which might change the output of your programs. (Changed by Mark Dickinson; :issue:`6857`.)
ru: При использовании экземпляров :class:`~decimal.Decimal` с методом строки :meth:`format` выравнивание по умолчанию ранее было выравниванием по левому краю. Это было изменено на выравнивание по правому краю, что может изменить вывод ваших программ. (Изменено Марком Дикинсоном; :issue:`6857`.)

source: Comparisons involving a signaling NaN value (or ``sNAN``) now signal :const:`~decimal.InvalidOperation` instead of silently returning a true or false value depending on the comparison operator. Quiet NaN values (or ``NaN``) are now hashable. (Fixed by Mark Dickinson; :issue:`7279`.)
ru: Сравнения, включающие сигнальное значение NaN (или sNAN), теперь сигнализируют :const:`~decimal.InvalidOperation` вместо того, чтобы молча возвращать истинное или ложное значение в зависимости от оператора сравнения. Тихие значения NaN (или NaN) теперь можно хешировать. (Исправлено Марком Дикинсоном; :issue:`7279`.)

source: For C extensions:
ru: Для расширений на языке C:

source: C extensions that use integer format codes with the ``PyArg_Parse*`` family of functions will now raise a :exc:`TypeError` exception instead of triggering a :exc:`DeprecationWarning` (:issue:`5080`).
ru: Расширения C, использующие коды целочисленного формата с семейством функций ``PyArg_Parse*``, теперь будут вызывать исключение :exc:`TypeError` вместо запуска :exc:`DeprecationWarning` (:issue:`5080`).

source: For applications that embed Python:
ru: Для приложений, встраивающих Python:

source: The :c:func:`PySys_SetArgvEx` function was added, letting applications close a security hole when the existing :c:func:`PySys_SetArgv` function was used. Check whether you're calling :c:func:`PySys_SetArgv` and carefully consider whether the application should be using :c:func:`PySys_SetArgvEx` with *updatepath* set to false.
ru: Была добавлена ​​функция :c:func:`PySys_SetArgvEx`, позволяющая приложениям закрывать дыры в безопасности при использовании существующей функции :c:func:`PySys_SetArgv`. Проверьте, вызываете ли вы :c:func:`PySys_SetArgv`, и внимательно подумайте, должно ли приложение использовать :c:func:`PySys_SetArgvEx` с параметром *updatepath*, установленным в значение false.

source: New Features Added to Python 2.7 Maintenance Releases
ru: Новые функции, добавленные в выпуски обслуживания Python 2.7

source: New features may be added to Python 2.7 maintenance releases when the situation genuinely calls for it. Any such additions must go through the Python Enhancement Proposal process, and make a compelling case for why they can't be adequately addressed by either adding the new feature solely to Python 3, or else by publishing it on the Python Package Index.
ru: Новые функции могут быть добавлены в поддерживающие выпуски Python 2.7, когда ситуация действительно этого требует. Любые такие дополнения должны пройти процедуру предложения по расширению Python и привести убедительные аргументы в пользу того, почему их нельзя адекватно решить, добавив новую функцию исключительно в Python 3 или опубликовав ее в указателе пакетов Python.

source: In addition to the specific proposals listed below, there is a general exemption allowing new ``-3`` warnings to be added in any Python 2.7 maintenance release.
ru: В дополнение к конкретным предложениям, перечисленным ниже, существует общее исключение, позволяющее добавлять новые предупреждения ``-3`` в любую версию обслуживания Python 2.7.

source: Two new environment variables for debug mode
ru: Две новые переменные среды для режима отладки.

source: PEP 434: IDLE Enhancement Exception for All Branches
ru: PEP 434: Исключение расширения IDLE для всех ветвей

source: :pep:`434` describes a general exemption for changes made to the IDLE development environment shipped along with Python. This exemption makes it possible for the IDLE developers to provide a more consistent user experience across all supported versions of Python 2 and 3.
ru: :pep:`434` описывает общее исключение для изменений, внесенных в среду разработки IDLE, поставляемую вместе с Python. Это исключение позволяет разработчикам IDLE обеспечить более единообразный пользовательский интерфейс во всех поддерживаемых версиях Python 2 и 3.

source: For details of any IDLE changes, refer to the NEWS file for the specific release.
ru: Подробную информацию обо всех изменениях IDLE см. в файле NEWS для конкретной версии.

source: PEP 466: Network Security Enhancements for Python 2.7
ru: PEP 466: Улучшения сетевой безопасности для Python 2.7

source: :pep:`466` describes a number of network security enhancement proposals that have been approved for inclusion in Python 2.7 maintenance releases, with the first of those changes appearing in the Python 2.7.7 release.
ru: :pep:`466` описывает ряд предложений по улучшению сетевой безопасности, которые были одобрены для включения в выпуски обслуживания Python 2.7, причем первые из этих изменений появились в выпуске Python 2.7.7.

source: :pep:`466` related features added in Python 2.7.7:
ru: :pep:`466` связанные функции, добавленные в Python 2.7.7:

source: :func:`hmac.compare_digest` was backported from Python 3 to make a timing attack resistant comparison operation available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21306`.)
ru: :func:`hmac.compare_digest` был перенесен из Python 3, чтобы сделать операцию сравнения, устойчивую к временным атакам, доступной для приложений Python 2. (Предоставлено Алексом Гейнором; :issue:`21306`.)

source: OpenSSL 1.0.1g was upgraded in the official Windows installers published on python.org. (Contributed by Zachary Ware; :issue:`21462`.)
ru: OpenSSL 1.0.1g был обновлен в официальных установщиках Windows, опубликованных на python.org. (Предоставлено Закари Уэром; :issue:`21462`.)

source: :pep:`466` related features added in Python 2.7.8:
ru: :pep:`466` связанные функции, добавленные в Python 2.7.8:

source: :func:`hashlib.pbkdf2_hmac` was backported from Python 3 to make a hashing algorithm suitable for secure password storage broadly available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21304`.)
ru: :func:`hashlib.pbkdf2_hmac` был перенесен из Python 3, чтобы сделать алгоритм хеширования, пригодный для безопасного хранения паролей, широко доступным для приложений Python 2. (Предоставлено Алексом Гейнором; :issue:`21304`.)

source: :pep:`466` related features added in Python 2.7.9:
ru: :pep:`466` связанные функции, добавленные в Python 2.7.9:
