Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.7.po
Languages: ru

source: Tcl/Tk 8.5 includes a set of themed widgets that re-implement basic Tk widgets but have a more customizable appearance and can therefore more closely resemble the native platform's widgets. This widget set was originally called Tile, but was renamed to Ttk (for "themed Tk") on being added to Tcl/Tck release 8.5.
ru: Tcl/Tk 8.5 включает набор тематических виджетов, которые повторяют базовые виджеты Tk, но имеют более настраиваемый внешний вид и, следовательно, могут больше напоминать виджеты собственной платформы. Этот набор виджетов изначально назывался Tile, но был переименован в Ttk (что означает «тематический Tk») при добавлении в Tcl/Tck версии 8.5.

source: Updated module: unittest
ru: Обновленный модуль: unittest

source: When used from the command line, the module can automatically discover tests. It's not as fancy as `py.test <https://pytest.org>`__ or `nose <https://nose.readthedocs.io/>`__, but provides a simple way to run tests kept within a set of package directories. For example, the following command will search the :file:`test/` subdirectory for any importable test files named ``test*.py``::
ru: При использовании из командной строки модуль может автоматически обнаруживать тесты. Это не так красиво, как `py.test <https://pytest.org>`__ или `nose <https://nose.readthedocs.io/>`__, но обеспечивает простой способ запуска тестов, хранящихся в наборе. каталогов пакетов. Например, следующая команда будет искать в подкаталоге :file:`test/` любые импортируемые тестовые файлы с именем ``test*.py``::

source: Consult the :mod:`unittest` module documentation for more details. (Developed in :issue:`6001`.)
ru: Для получения более подробной информации обратитесь к документации модуля :mod:`unittest`. (Разработано в :issue:`6001`.)

source: The :func:`~unittest.main` function supports some other new options:
ru: Функция :func:`~unittest.main` поддерживает некоторые другие новые опции:

source: :option:`-b <unittest -b>` or :option:`!--buffer` will buffer the standard output and standard error streams during each test. If the test passes, any resulting output will be discarded; on failure, the buffered output will be displayed.
ru: :option:`-b <unittest -b>` или :option:`!--buffer` будет буферизовать потоки стандартного вывода и стандартных ошибок во время каждого теста. Если тест пройден успешно, любые результирующие выходные данные будут отброшены; в случае неудачи будет отображен буферизованный вывод.

source: :option:`-c <unittest -c>` or :option:`!--catch` will cause the control-C interrupt to be handled more gracefully. Instead of interrupting the test process immediately, the currently running test will be completed and then the partial results up to the interruption will be reported. If you're impatient, a second press of control-C will cause an immediate interruption.
ru: :option:`-c <unittest -c>` или :option:`!--catch` приведет к более корректной обработке прерывания control-C. Вместо немедленного прерывания процесса тестирования будет завершен текущий тест, а затем будут сообщены частичные результаты до прерывания. Если вы нетерпеливы, второе нажатие Control-C приведет к немедленному прерыванию игры.

source: This control-C handler tries to avoid causing problems when the code being tested or the tests being run have defined a signal handler of their own, by noticing that a signal handler was already set and calling it. If this doesn't work for you, there's a :func:`~unittest.removeHandler` decorator that can be used to mark tests that should have the control-C handling disabled.
ru: Этот обработчик control-C пытается избежать возникновения проблем, когда тестируемый код или выполняемые тесты определили собственный обработчик сигнала, замечая, что обработчик сигнала уже установлен, и вызывая его. Если это вам не помогло, есть декоратор :func:`~unittest.removeHandler`, который можно использовать для пометки тестов, в которых обработка control-C должна быть отключена.

source: :option:`-f <unittest -f>` or :option:`!--failfast` makes test execution stop immediately when a test fails instead of continuing to execute further tests. (Suggested by Cliff Dyer and implemented by Michael Foord; :issue:`8074`.)
ru: :option:`-f <unittest -f>` или :option:`!--failfast` заставляет выполнение теста немедленно останавливаться в случае сбоя теста вместо продолжения выполнения дальнейших тестов. (Предложено Клиффом Дайером и реализовано Майклом Фурдом; :issue:`8074`.)

source: The progress messages now show 'x' for expected failures and 'u' for unexpected successes when run in verbose mode. (Contributed by Benjamin Peterson.)
ru: В сообщениях о ходе выполнения теперь отображается «x» для ожидаемых сбоев и «u» для неожиданных успехов при запуске в подробном режиме. (Предоставлено Бенджамином Петерсоном.)

source: Test cases can raise the :exc:`~unittest.SkipTest` exception to skip a test (:issue:`1034053`).
ru: Тестовые случаи могут вызвать исключение :exc:`~unittest.SkipTest` для пропуска теста (:issue:`1034053`).

source: The error messages for :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue`, and :meth:`~unittest.TestCase.assertFalse` failures now provide more information. If you set the :attr:`~unittest.TestCase.longMessage` attribute of your :class:`~unittest.TestCase` classes to true, both the standard error message and any additional message you provide will be printed for failures. (Added by Michael Foord; :issue:`5663`.)
ru: Сообщения об ошибках для сбоев :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue` и :meth:`~unittest.TestCase.assertFalse` теперь предоставляют дополнительную информацию. Если вы установите для атрибута :attr:`~unittest.TestCase.longMessage` ваших классов :class:`~unittest.TestCase` значение true, в случае сбоя будет напечатано как стандартное сообщение об ошибке, так и любое предоставленное вами дополнительное сообщение. (Добавлено Майклом Фурдом; :issue:`5663`.)

source: The :meth:`~unittest.TestCase.assertRaises` method now returns a context handler when called without providing a callable object to run. For example, you can write this::
ru: Метод :meth:`~unittest.TestCase.assertRaises` теперь возвращает обработчик контекста при вызове, не предоставляя вызываемый объект для запуска. Например, вы можете написать это::

source: (Implemented by Antoine Pitrou; :issue:`4444`.)
ru: (Реализовано Антуаном Питру; :issue:`4444`.)

source: Module- and class-level setup and teardown fixtures are now supported. Modules can contain :func:`~unittest.setUpModule` and :func:`~unittest.tearDownModule` functions. Classes can have :meth:`~unittest.TestCase.setUpClass` and :meth:`~unittest.TestCase.tearDownClass` methods that must be defined as class methods (using ``@classmethod`` or equivalent). These functions and methods are invoked when the test runner switches to a test case in a different module or class.
ru: Теперь поддерживаются приспособления для настройки и демонтажа на уровне модуля и класса. Модули могут содержать функции :func:`~unittest.setUpModule` и :func:`~unittest.tearDownModule`. Классы могут иметь методы :meth:`~unittest.TestCase.setUpClass` и :meth:`~unittest.TestCase.tearDownClass`, которые должны быть определены как методы класса (с использованием ``@classmethod`` или его эквивалента). Эти функции и методы вызываются, когда исполнитель тестов переключается на тестовый пример в другом модуле или классе.

source: The methods :meth:`~unittest.TestCase.addCleanup` and :meth:`~unittest.TestCase.doCleanups` were added. :meth:`~unittest.TestCase.addCleanup` lets you add cleanup functions that will be called unconditionally (after :meth:`~unittest.TestCase.setUp` if :meth:`~unittest.TestCase.setUp` fails, otherwise after :meth:`~unittest.TestCase.tearDown`). This allows for much simpler resource allocation and deallocation during tests (:issue:`5679`).
ru: Были добавлены методы :meth:`~unittest.TestCase.addCleanup` и :meth:`~unittest.TestCase.doCleanups`. :meth:`~unittest.TestCase.addCleanup` позволяет добавлять функции очистки, которые будут вызываться безоговорочно (после :meth:`~unittest.TestCase.setUp`, если :meth:`~unittest.TestCase.setUp` завершится неудачно, в противном случае после :meth:`~unittest.TestCase.tearDown`). Это позволяет значительно упростить выделение и освобождение ресурсов во время тестов (:issue:`5679`).

source: A number of new methods were added that provide more specialized tests. Many of these methods were written by Google engineers for use in their test suites; Gregory P. Smith, Michael Foord, and GvR worked on merging them into Python's version of :mod:`unittest`.
ru: Был добавлен ряд новых методов, обеспечивающих более специализированные тесты. Многие из этих методов были написаны инженерами Google для использования в их наборах тестов; Грегори П. Смит, Майкл Фурд и GvR работали над объединением их в версию :mod:`unittest` для Python.

source: :meth:`~unittest.TestCase.assertIsNone` and :meth:`~unittest.TestCase.assertIsNotNone` take one expression and verify that the result is or is not ``None``.
ru: :meth:`~unittest.TestCase.assertIsNone` и :meth:`~unittest.TestCase.assertIsNotNone` принимают одно выражение и проверяют, является ли результатом значение ``None`` или нет.

source: :meth:`~unittest.TestCase.assertIs` and :meth:`~unittest.TestCase.assertIsNot` take two values and check whether the two values evaluate to the same object or not. (Added by Michael Foord; :issue:`2578`.)
ru: :meth:`~unittest.TestCase.assertIs` и :meth:`~unittest.TestCase.assertIsNot` принимают два значения и проверяют, относятся ли эти два значения к одному и тому же объекту или нет. (Добавлено Майклом Фурдом; :issue:`2578`.)

source: :meth:`~unittest.TestCase.assertIsInstance` and :meth:`~unittest.TestCase.assertNotIsInstance` check whether the resulting object is an instance of a particular class, or of one of a tuple of classes. (Added by Georg Brandl; :issue:`7031`.)
ru: :meth:`~unittest.TestCase.assertIsInstance` и :meth:`~unittest.TestCase.assertNotIsInstance` проверяют, является ли полученный объект экземпляром определенного класса или одним из кортежа классов. (Добавлено Георгом Брандлом; :issue:`7031`.)

source: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess`, and :meth:`~unittest.TestCase.assertLessEqual` compare two quantities.
ru: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess` и :meth:`~unittest.TestCase.assertLessEqual` сравнивают два количества.

source: :meth:`~unittest.TestCase.assertMultiLineEqual` compares two strings, and if they're not equal, displays a helpful comparison that highlights the differences in the two strings. This comparison is now used by default when Unicode strings are compared with :meth:`~unittest.TestCase.assertEqual`.
ru: :meth:`~unittest.TestCase.assertMultiLineEqual` сравнивает две строки и, если они не равны, отображает полезное сравнение, которое подчеркивает различия в двух строках. Это сравнение теперь используется по умолчанию при сравнении строк Юникода с :meth:`~unittest.TestCase.assertEqual`.

source: :meth:`~unittest.TestCase.assertIn` and :meth:`~unittest.TestCase.assertNotIn` tests whether *first* is or is not in *second*.
ru: :meth:`~unittest.TestCase.assertIn` и :meth:`~unittest.TestCase.assertNotIn` проверяют, находится ли *first* в *втором* или нет.

source: :meth:`~unittest.TestCase.assertSetEqual` compares whether two sets are equal, and only reports the differences between the sets in case of error.
ru: :meth:`~unittest.TestCase.assertSetEqual` сравнивает, равны ли два набора, и сообщает о различиях между наборами только в случае ошибки.

source: Similarly, :meth:`~unittest.TestCase.assertListEqual` and :meth:`~unittest.TestCase.assertTupleEqual` compare the specified types and explain any differences without necessarily printing their full values; these methods are now used by default when comparing lists and tuples using :meth:`~unittest.TestCase.assertEqual`. More generally, :meth:`~unittest.TestCase.assertSequenceEqual` compares two sequences and can optionally check whether both sequences are of a particular type.
ru: Аналогично, :meth:`~unittest.TestCase.assertListEqual` и :meth:`~unittest.TestCase.assertTupleEqual` сравнивают указанные типы и объясняют любые различия, не обязательно выводя их полные значения; эти методы теперь используются по умолчанию при сравнении списков и кортежей с помощью :meth:`~unittest.TestCase.assertEqual`. В более общем смысле :meth:`~unittest.TestCase.assertSequenceEqual` сравнивает две последовательности и может дополнительно проверить, относятся ли обе последовательности к определенному типу.

source: :meth:`~unittest.TestCase.assertAlmostEqual` and :meth:`~unittest.TestCase.assertNotAlmostEqual` test whether *first* and *second* are approximately equal. This method can either round their difference to an optionally specified number of *places* (the default is 7) and compare it to zero, or require the difference to be smaller than a supplied *delta* value.
ru: :meth:`~unittest.TestCase.assertAlmostEqual` и :meth:`~unittest.TestCase.assertNotAlmostEqual` проверяют, примерно ли равны *первый* и *секундный*. Этот метод может либо округлить разницу до необязательно указанного количества *мест* (по умолчанию — 7) и сравнить ее с нулем, либо потребовать, чтобы разница была меньше, чем предоставленное значение *дельта*.

source: :meth:`~unittest.TestLoader.loadTestsFromName` properly honors the :attr:`~unittest.TestLoader.suiteClass` attribute of the :class:`~unittest.TestLoader`. (Fixed by Mark Roddy; :issue:`6866`.)
ru: :meth:`~unittest.TestLoader.loadTestsFromName` правильно учитывает атрибут :attr:`~unittest.TestLoader.suiteClass` :class:`~unittest.TestLoader`. (Исправлено Марком Родди; :issue:`6866`.)

source: A new hook lets you extend the :meth:`~unittest.TestCase.assertEqual` method to handle new data types. The :meth:`~unittest.TestCase.addTypeEqualityFunc` method takes a type object and a function. The function will be used when both of the objects being compared are of the specified type. This function should compare the two objects and raise an exception if they don't match; it's a good idea for the function to provide additional information about why the two objects aren't matching, much as the new sequence comparison methods do.
ru: Новый хук позволяет расширить метод :meth:`~unittest.TestCase.assertEqual` для обработки новых типов данных. Метод :meth:`~unittest.TestCase.addTypeEqualityFunc` принимает объект типа и функцию. Функция будет использоваться, когда оба сравниваемых объекта относятся к указанному типу. Эта функция должна сравнить два объекта и вызвать исключение, если они не совпадают; Было бы неплохо, если бы функция предоставила дополнительную информацию о том, почему два объекта не совпадают, подобно тому, как это делают новые методы сравнения последовательностей.

source: :func:`unittest.main` now takes an optional ``exit`` argument. If false, :func:`~unittest.main` doesn't call :func:`sys.exit`, allowing :func:`~unittest.main` to be used from the interactive interpreter. (Contributed by J. Pablo Fernández; :issue:`3379`.)
ru: :func:`unittest.main` теперь принимает необязательный аргумент ``exit``. Если false, :func:`~unittest.main` не вызывает :func:`sys.exit`, что позволяет использовать :func:`~unittest.main` из интерактивного интерпретатора. (Предоставлено Х. Пабло Фернандесом; :issue:`3379`.)

source: :class:`~unittest.TestResult` has new :meth:`~unittest.TestResult.startTestRun` and :meth:`~unittest.TestResult.stopTestRun` methods that are called immediately before and after a test run. (Contributed by Robert Collins; :issue:`5728`.)
ru: :class:`~unittest.TestResult` имеет новые методы :meth:`~unittest.TestResult.startTestRun` и :meth:`~unittest.TestResult.stopTestRun`, которые вызываются непосредственно до и после запуска теста. (Предоставлено Робертом Коллинзом; :issue:`5728`.)

source: With all these changes, the :file:`unittest.py` was becoming awkwardly large, so the module was turned into a package and the code split into several files (by Benjamin Peterson). This doesn't affect how the module is imported or used.
ru: Со всеми этими изменениями файл :file:`unittest.py` становился неуклюже большим, поэтому модуль был превращен в пакет, а код разделен на несколько файлов (Бенджамин Петерсон). Это не влияет на то, как модуль импортируется или используется.

source: Describes the new features, how to use them, and the rationale for various design decisions. (By Michael Foord.)
ru: Описывает новые функции, способы их использования и обоснование различных дизайнерских решений. (Майкл Фурд.)

source: Updated module: ElementTree 1.3
ru: Обновлен модуль: ElementTree 1.3.

source: The version of the ElementTree library included with Python was updated to version 1.3. Some of the new features are:
ru: Версия библиотеки ElementTree, входящая в состав Python, была обновлена ​​до версии 1.3. Некоторые из новых функций:

source: The various parsing functions now take a *parser* keyword argument giving an :class:`~xml.etree.ElementTree.XMLParser` instance that will be used. This makes it possible to override the file's internal encoding::
ru: Различные функции синтаксического анализа теперь принимают аргумент ключевого слова *parser*, дающий экземпляр :class:`~xml.etree.ElementTree.XMLParser`, который будет использоваться. Это позволяет переопределить внутреннюю кодировку файла::

source: Namespace handling has also been improved. All ``xmlns:<whatever>`` declarations are now output on the root element, not scattered throughout the resulting XML. You can set the default namespace for a tree by setting the :attr:`default_namespace` attribute and can register new prefixes with :meth:`~xml.etree.ElementTree.register_namespace`. In XML mode, you can use the true/false *xml_declaration* parameter to suppress the XML declaration.
ru: Обработка пространства имен также была улучшена. Все объявления ``xmlns:<whatever>`` теперь выводятся в корневом элементе, а не разбросаны по всему результирующему XML. Вы можете установить пространство имен по умолчанию для дерева, установив атрибут :attr:`default_namespace`, и зарегистрировать новые префиксы с помощью :meth:`~xml.etree.ElementTree.register_namespace`. В режиме XML вы можете использовать параметр true/false *xml_declaration* для подавления объявления XML.

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.extend` appends the items from a sequence to the element's children. Elements themselves behave like sequences, so it's easy to move children from one element to another::
ru: Новый метод :class:`~xml.etree.ElementTree.Element`: :meth:`~xml.etree.ElementTree.Element.extend` добавляет элементы из последовательности к дочерним элементам. Сами элементы ведут себя как последовательности, поэтому дочерние элементы легко перемещать от одного элемента к другому:

source: Deprecated: using an element as a Boolean (i.e., ``if elem:``) would return true if the element had any children, or false if there were no children. This behaviour is confusing -- ``None`` is false, but so is a childless element? -- so it will now trigger a :exc:`FutureWarning`. In your code, you should be explicit: write ``len(elem) != 0`` if you're interested in the number of children, or ``elem is not None``.
ru: Устарело: использование элемента в качестве логического значения (т. е. ``if elem:``) вернет true, если у элемента есть дочерние элементы, или false, если дочерних элементов нет. Такое поведение сбивает с толку: ``None`` является ложным, но также и бездетный элемент? -- поэтому теперь он вызовет :exc:`FutureWarning`. В вашем коде вы должны указать явно: напишите ``len(elem) != 0``, если вас интересует количество дочерних элементов, или ``elem is not None``.

source: Fredrik Lundh develops ElementTree and produced the 1.3 version; you can read his article describing 1.3 at https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Florent Xicluna updated the version included with Python, after discussions on python-dev and in :issue:`6472`.)
ru: Фредрик Лунд разработал ElementTree и выпустил версию 1.3; вы можете прочитать его статью, описывающую 1.3, по адресу https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Флоран Ксиклюна обновил версию, входящую в состав Python, после обсуждений на python-dev и в :issue:`6472`.)

source: Build and C API Changes
ru: Изменения API сборки и C

source: Changes to Python's build process and to the C API include:
ru: Изменения в процессе сборки Python и C API включают в себя:

source: If you use the :file:`.gdbinit` file provided with Python, the "pyo" macro in the 2.7 version now works correctly when the thread being debugged doesn't hold the GIL; the macro now acquires it before printing. (Contributed by Victor Stinner; :issue:`3632`.)
ru: Если вы используете файл :file:`.gdbinit`, поставляемый с Python, макрос «pyo» в версии 2.7 теперь работает правильно, когда отлаживаемый поток не содержит GIL; макрос теперь получает его перед печатью. (Предоставлено Виктором Стиннером; :issue:`3632`.)

source: :c:func:`Py_AddPendingCall` is now thread-safe, letting any worker thread submit notifications to the main Python thread. This is particularly useful for asynchronous IO operations. (Contributed by Kristján Valur Jónsson; :issue:`4293`.)
ru: :c:func:`Py_AddPendingCall` теперь является потокобезопасным, позволяя любому рабочему потоку отправлять уведомления в основной поток Python. Это особенно полезно для асинхронных операций ввода-вывода. (Предоставлено Кристьяном Валюром Йонссоном; :issue:`4293`.)

source: New function: :c:func:`PyErr_NewExceptionWithDoc` creates a new exception class, just as the existing :c:func:`PyErr_NewException` does, but takes an extra ``char *`` argument containing the docstring for the new exception class. (Added by 'lekma' on the Python bug tracker; :issue:`7033`.)
ru: Новая функция: :c:func:`PyErr_NewExceptionWithDoc` создает новый класс исключений, как и существующая :c:func:`PyErr_NewException`, но принимает дополнительный аргумент ``char *``, содержащий строку документации для нового класса исключений. . (Добавлено пользователем «lekma» в систему отслеживания ошибок Python; :issue:`7033`.)

source: New function: :c:func:`PyFrame_GetLineNumber` takes a frame object and returns the line number that the frame is currently executing. Previously code would need to get the index of the bytecode instruction currently executing, and then look up the line number corresponding to that address. (Added by Jeffrey Yasskin.)
ru: Новая функция: :c:func:`PyFrame_GetLineNumber` принимает объект кадра и возвращает номер строки, которую кадр выполняет в данный момент. Раньше коду нужно было получить индекс исполняемой в данный момент инструкции байт-кода, а затем найти номер строки, соответствующий этому адресу. (Добавлено Джеффри Яскином.)

source: New functions: :c:func:`PyLong_AsLongAndOverflow` and :c:func:`PyLong_AsLongLongAndOverflow` approximates a Python long integer as a C :c:expr:`long` or :c:expr:`long long`. If the number is too large to fit into the output type, an *overflow* flag is set and returned to the caller. (Contributed by Case Van Horsen; :issue:`7528` and :issue:`7767`.)
ru: Новые функции: :c:func:`PyLong_AsLongAndOverflow` и :c:func:`PyLong_AsLongLongAndOverflow` аппроксимируют длинное целое число Python как C :c:expr:`long` или :c:expr:`long long`. Если число слишком велико, чтобы соответствовать типу вывода, устанавливается флаг *overflow*, который возвращается вызывающей стороне. (Предоставлено Кейсом Ван Хорсеном; :issue:`7528` и :issue:`7767`.)
