Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.7.po
Languages: ru

source: :mod:`argparse` has much fancier validation than :mod:`optparse`; you can specify an exact number of arguments as an integer, 0 or more arguments by passing ``'*'``, 1 or more by passing ``'+'``, or an optional argument with ``'?'``. A top-level parser can contain sub-parsers to define subcommands that have different sets of switches, as in ``svn commit``, ``svn checkout``, etc. You can specify an argument's type as :class:`~argparse.FileType`, which will automatically open files for you and understands that ``'-'`` means standard input or output.
ru: :mod:`argparse` имеет гораздо более сложную проверку, чем :mod:`optparse`; вы можете указать точное количество аргументов в виде целого числа, 0 или более аргументов, передав ``'*'``, 1 или более, передав ``'+'``, или необязательный аргумент с помощью ``'?'` `. Парсер верхнего уровня может содержать поданализаторы для определения подкоманд с разными наборами переключателей, например, ``svn commit``, ``svn checkout`` и т. д. Вы можете указать тип аргумента как :class:`~ argparse.FileType`, который автоматически открывает для вас файлы и понимает, что ``'-'`` означает стандартный ввод или вывод.

source: :mod:`argparse` documentation
ru: Документация :mod:`argparse`

source: The documentation page of the argparse module.
ru: Страница документации модуля argparse.

source: Part of the Python documentation, describing how to convert code that uses :mod:`optparse`.
ru: Часть документации Python, описывающая, как преобразовать код, использующий :mod:`optparse`.

source: :pep:`389` - argparse - New Command Line Parsing Module
ru: :pep:`389` - argparse - Новый модуль анализа командной строки

source: PEP written and implemented by Steven Bethard.
ru: PEP написан и реализован Стивеном Бетхардом.

source: PEP 391: Dictionary-Based Configuration For Logging
ru: PEP 391: конфигурация для ведения журнала на основе словаря

source: The :mod:`logging` module is very flexible; applications can define a tree of logging subsystems, and each logger in this tree can filter out certain messages, format them differently, and direct messages to a varying number of handlers.
ru: Модуль :mod:`logging` очень гибок; приложения могут определять дерево подсистем журналирования, и каждый регистратор в этом дереве может фильтровать определенные сообщения, форматировать их по-разному и направлять сообщения различному количеству обработчиков.

source: The following example configures two loggers, the root logger and a logger named "network". Messages sent to the root logger will be sent to the system log using the syslog protocol, and messages to the "network" logger will be written to a :file:`network.log` file that will be rotated once the log reaches 1MB.
ru: В следующем примере настраиваются два средства ведения журнала: корневой регистратор и регистратор с именем «сеть». Сообщения, отправленные в корневой регистратор, будут отправляться в системный журнал с использованием протокола системного журнала, а сообщения в «сетевой» регистратор будут записываться в файл :file:`network.log`, который будет ротироваться, как только размер журнала достигнет 1 МБ.

source: Three smaller enhancements to the :mod:`logging` module, all implemented by Vinay Sajip, are:
ru: Три небольших улучшения модуля :mod:`logging`, реализованные Винаем Саджипом:

source: The :class:`~logging.handlers.SysLogHandler` class now supports syslogging over TCP. The constructor has a *socktype* parameter giving the type of socket to use, either :const:`socket.SOCK_DGRAM` for UDP or :const:`socket.SOCK_STREAM` for TCP. The default protocol remains UDP.
ru: Класс :class:`~logging.handlers.SysLogHandler` теперь поддерживает системную регистрацию через TCP. Конструктор имеет параметр *socktype*, задающий тип используемого сокета: const:`socket.SOCK_DGRAM` для UDP или :const:`socket.SOCK_STREAM` для TCP. Протоколом по умолчанию остается UDP.

source: :class:`~logging.Logger` instances gained a :meth:`~logging.Logger.getChild` method that retrieves a descendant logger using a relative path. For example, once you retrieve a logger by doing ``log = getLogger('app')``, calling ``log.getChild('network.listen')`` is equivalent to ``getLogger('app.network.listen')``.
ru: Экземпляры :class:`~logging.Logger` получили метод :meth:`~logging.Logger.getChild`, который извлекает дочерний регистратор, используя относительный путь. Например, как только вы получаете средство ведения журнала, выполнив ``log = getLogger('app')``, вызов ``log.getChild('network.listen')`` эквивалентен ``getLogger('app.network. слушай')``.

source: :pep:`391` - Dictionary-Based Configuration For Logging
ru: :pep:`391` — конфигурация для ведения журнала на основе словаря

source: PEP written and implemented by Vinay Sajip.
ru: PEP написан и реализован Винаем Саджипом.

source: PEP 3106: Dictionary Views
ru: PEP 3106: Просмотры словаря

source: The dictionary methods :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` are different in Python 3.x. They return an object called a :dfn:`view` instead of a fully materialized list.
ru: Словарные методы :meth:`~dict.keys`, :meth:`~dict.values` и :meth:`~dict.items` в Python 3.x отличаются. Они возвращают объект под названием :dfn:`view` вместо полностью материализованного списка.

source: Views can be iterated over, but the key and item views also behave like sets. The ``&`` operator performs intersection, and ``|`` performs a union::
ru: Представления можно перебирать, но представления ключей и элементов также ведут себя как множества. Оператор ``&`` выполняет пересечение, а ``|`` выполняет объединение::

source: The view keeps track of the dictionary and its contents change as the dictionary is modified::
ru: Представление отслеживает словарь, и его содержимое изменяется по мере изменения словаря::

source: However, note that you can't add or remove keys while you're iterating over the view::
ru: Однако обратите внимание, что вы не можете добавлять или удалять ключи во время итерации по представлению::

source: You can use the view methods in Python 2.x code, and the 2to3 converter will change them to the standard :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` methods.
ru: Вы можете использовать методы представления в коде Python 2.x, а преобразователь 2to3 изменит их на стандартные :meth:`~dict.keys`, :meth:`~dict.values` и :meth:`~dict .items` методы.

source: :pep:`3106` - Revamping dict.keys(), .values() and .items()
ru: :pep:`3106` - Обновление dict.keys(), .values() и .items().

source: PEP written by Guido van Rossum. Backported to 2.7 by Alexandre Vassalotti; :issue:`1967`.
ru: PEP, написанный Гвидо ван Россумом. Перенесено в версию 2.7 Александром Вассалотти; :выпуск:`1967`.

source: PEP 3137: The memoryview Object
ru: PEP 3137: объект MemoryView

source: The :class:`memoryview` object provides a view of another object's memory content that matches the :class:`bytes` type's interface.
ru: Объект :class:`memoryview` предоставляет представление содержимого памяти другого объекта, которое соответствует интерфейсу типа :class:`bytes`.

source: The content of the view can be converted to a string of bytes or a list of integers:
ru: Содержимое представления можно преобразовать в строку байтов или список целых чисел:

source: :class:`memoryview` objects allow modifying the underlying object if it's a mutable object.
ru: Объекты :class:`memoryview` позволяют изменять базовый объект, если это изменяемый объект.

source: :pep:`3137` - Immutable Bytes and Mutable Buffer
ru: :pep:`3137` - Неизменяемые байты и изменяемый буфер

source: PEP written by Guido van Rossum. Implemented by Travis Oliphant, Antoine Pitrou and others. Backported to 2.7 by Antoine Pitrou; :issue:`2396`.
ru: PEP, написанный Гвидо ван Россумом. Реализовано Трэвисом Олифантом, Антуаном Питру и другими. Перенесено в версию 2.7 Антуаном Питру; :issue:`2396`.

source: Other Language Changes
ru: Другие языковые изменения

source: Some smaller changes made to the core Python language are:
ru: Некоторые небольшие изменения, внесенные в основной язык Python:

source: The syntax for set literals has been backported from Python 3.x. Curly brackets are used to surround the contents of the resulting mutable set; set literals are distinguished from dictionaries by not containing colons and values. ``{}`` continues to represent an empty dictionary; use ``set()`` for an empty set.
ru: Синтаксис для литералов множества был перенесен из Python 3.x. Фигурные скобки используются для заключения содержимого результирующего изменяемого набора; литералы множества отличаются от словарей тем, что не содержат двоеточий и значений. ``{}`` продолжает представлять пустой словарь; используйте ``set()`` для пустого набора.

source: Backported by Alexandre Vassalotti; :issue:`2335`.
ru: Поддерживается Александром Вассалотти; :issue:`2335`.

source: Dictionary and set comprehensions are another feature backported from 3.x, generalizing list/generator comprehensions to use the literal syntax for sets and dictionaries.
ru: Понимание словарей и множеств — это еще одна функция, перенесенная из 3.x, которая обобщает понимание списков/генераторов для использования буквального синтаксиса для множеств и словарей.

source: Backported by Alexandre Vassalotti; :issue:`2333`.
ru: Поддерживается Александром Вассалотти; :issue:`2333`.

source: The :keyword:`with` statement can now use multiple context managers in one statement. Context managers are processed from left to right and each one is treated as beginning a new :keyword:`!with` statement. This means that::
ru: Оператор :keyword:`with` теперь может использовать несколько менеджеров контекста в одном операторе. Менеджеры контекста обрабатываются слева направо, и каждый из них рассматривается как начало нового оператора :keyword:`!with`. Это означает, что::

source: is equivalent to::
ru: эквивалентно::

source: (Proposed in https://codereview.appspot.com/53094; implemented by Georg Brandl.)
ru: (Предложено в https://codereview.appspot.com/53094; реализовано Георгом Брандлом.)

source: Conversions between floating-point numbers and strings are now correctly rounded on most platforms. These conversions occur in many different places: :func:`str` on floats and complex numbers; the :class:`float` and :class:`complex` constructors; numeric formatting; serializing and deserializing floats and complex numbers using the :mod:`marshal`, :mod:`pickle` and :mod:`json` modules; parsing of float and imaginary literals in Python code; and :class:`~decimal.Decimal`-to-float conversion.
ru: Преобразования между числами с плавающей запятой и строками теперь правильно округляются на большинстве платформ. Эти преобразования происходят в разных местах: :func:`str` для чисел с плавающей запятой и комплексных чисел; конструкторы :class:`float` и :class:`complex`; числовое форматирование; сериализация и десериализация чисел с плавающей запятой и комплексных чисел с использованием модулей :mod:`marshal`, :mod:`pickle` и :mod:`json`; синтаксический анализ float и мнимых литералов в коде Python; и преобразование :class:`~decimal.Decimal` в числа с плавающей запятой.

source: Related to this, the :func:`repr` of a floating-point number *x* now returns a result based on the shortest decimal string that's guaranteed to round back to *x* under correct rounding (with round-half-to-even rounding mode). Previously it gave a string based on rounding x to 17 decimal digits.
ru: В связи с этим функция :func:`repr` числа с плавающей запятой *x* теперь возвращает результат, основанный на самой короткой десятичной строке, которая гарантированно округляется до *x* при правильном округлении (с округлением от половины до даже режим округления). Ранее он давал строку, основанную на округлении x до 17 десятичных цифр.

source: The rounding library responsible for this improvement works on Windows and on Unix platforms using the gcc, icc, or suncc compilers. There may be a small number of platforms where correct operation of this code cannot be guaranteed, so the code is not used on such systems. You can find out which code is being used by checking :data:`sys.float_repr_style`, which will be ``short`` if the new code is in use and ``legacy`` if it isn't.
ru: Библиотека округления, ответственная за это улучшение, работает на платформах Windows и Unix с использованием компиляторов gcc, icc или suncc. Может существовать небольшое количество платформ, на которых правильная работа этого кода не может быть гарантирована, поэтому код не используется в таких системах. Вы можете узнать, какой код используется, проверив :data:`sys.float_repr_style`, который будет ``short``, если используется новый код, и ``устаревшим``, если нет.

source: Implemented by Eric Smith and Mark Dickinson, using David Gay's :file:`dtoa.c` library; :issue:`7117`.
ru: Реализовано Эриком Смитом и Марком Дикинсоном с использованием библиотеки :file:`dtoa.c` Дэвида Гэя; :issue:`7117`.

source: Conversions from long integers and regular integers to floating point now round differently, returning the floating-point number closest to the number. This doesn't matter for small integers that can be converted exactly, but for large numbers that will unavoidably lose precision, Python 2.7 now approximates more closely. For example, Python 2.6 computed the following::
ru: Преобразования длинных целых чисел и обычных целых чисел в числа с плавающей запятой теперь округляются по-другому, возвращая число с плавающей запятой, ближайшее к числу. Это не имеет значения для небольших целых чисел, которые можно точно преобразовать, но для больших чисел, которые неизбежно потеряют точность, Python 2.7 теперь приближается более точно. Например, Python 2.6 вычислил следующее:

source: Python 2.7's floating-point result is larger, but much closer to the true value::
ru: Результат с плавающей запятой в Python 2.7 больше, но гораздо ближе к истинному значению:

source: (Implemented by Mark Dickinson; :issue:`3166`.)
ru: (Реализовано Марком Дикинсоном; :issue:`3166`.)

source: Integer division is also more accurate in its rounding behaviours. (Also implemented by Mark Dickinson; :issue:`1811`.)
ru: Целочисленное деление также более точно обеспечивает округление. (Также реализовано Марком Дикинсоном; :issue:`1811`.)

source: The :meth:`str.format` method now supports automatic numbering of the replacement fields. This makes using :meth:`str.format` more closely resemble using ``%s`` formatting::
ru: Метод :meth:`str.format` теперь поддерживает автоматическую нумерацию полей замены. Это делает использование :meth:`str.format` более похожим на использование `` %s `` форматирование::

source: The auto-numbering takes the fields from left to right, so the first ``{...}`` specifier will use the first argument to :meth:`str.format`, the next specifier will use the next argument, and so on. You can't mix auto-numbering and explicit numbering -- either number all of your specifier fields or none of them -- but you can mix auto-numbering and named fields, as in the second example above. (Contributed by Eric Smith; :issue:`5237`.)
ru: При автоматической нумерации поля располагаются слева направо, поэтому первый спецификатор ``{...}`` будет использовать первый аргумент :meth:`str.format`, следующий спецификатор будет использовать следующий аргумент, а скоро. Вы не можете совмещать автоматическую и явную нумерацию — либо пронумеруйте все поля спецификатора, либо ни одно из них — но вы можете смешивать автоматическую нумерацию и именованные поля, как во втором примере выше. (Предоставлено Эриком Смитом; :issue:`5237`.)

source: Complex numbers now correctly support usage with :func:`format`, and default to being right-aligned. Specifying a precision or comma-separation applies to both the real and imaginary parts of the number, but a specified field width and alignment is applied to the whole of the resulting ``1.5+3j`` output. (Contributed by Eric Smith; :issue:`1588` and :issue:`7988`.)
ru: Комплексные числа теперь корректно поддерживают использование с :func:`format` и по умолчанию выравниваются по правому краю. Указание точности или разделения запятыми применяется как к действительной, так и к мнимой части числа, но указанная ширина поля и выравнивание применяются ко всему результирующему выводу ``1.5+3j``. (Предоставлено Эриком Смитом; :issue:`1588` и :issue:`7988`.)

source: The 'F' format code now always formats its output using uppercase characters, so it will now produce 'INF' and 'NAN'. (Contributed by Eric Smith; :issue:`3382`.)
ru: Код формата «F» теперь всегда форматирует вывод с использованием символов верхнего регистра, поэтому теперь он будет выдавать «INF» и «NAN». (Предоставлено Эриком Смитом; :issue:`3382`.)

source: (Contributed by Fredrik Johansson and Victor Stinner; :issue:`3439`.)
ru: (Предоставлено Фредриком Йоханссоном и Виктором Стиннером; :issue:`3439`.)

source: The :keyword:`import` statement will no longer try an absolute import if a relative import (e.g. ``from .os import sep``) fails. This fixes a bug, but could possibly break certain :keyword:`!import` statements that were only working by accident. (Fixed by Meador Inge; :issue:`7902`.)
ru: Оператор :keyword:`import` больше не будет пытаться выполнить абсолютный импорт, если относительный импорт (например, ``from .os import sep``) не удался. Это исправляет ошибку, но может привести к поломке некоторых операторов :keyword:`!import`, которые работали только случайно. (Исправлено Мидором Инге; :issue:`7902`.)

source: The :class:`bytearray` type's :meth:`~bytearray.translate` method now accepts ``None`` as its first argument. (Fixed by Georg Brandl; :issue:`4759`.)
ru: Метод :meth:`~bytearray.translate` типа :class:`bytearray` теперь принимает ``None`` в качестве первого аргумента. (Исправлено Георгом Брандлом; :issue:`4759`.)

source: When a restricted set of attributes were set using ``__slots__``, deleting an unset attribute would not raise :exc:`AttributeError` as you would expect. Fixed by Benjamin Peterson; :issue:`7604`.)
ru: Когда с помощью ``__slots__`` был установлен ограниченный набор атрибутов, удаление неустановленного атрибута не вызовет ошибку :exc:`AttributeError`, как можно было бы ожидать. Исправлено Бенджамином Петерсоном; :issue:`7604`.)

source: Two new encodings are now supported: "cp720", used primarily for Arabic text; and "cp858", a variant of CP 850 that adds the euro symbol. (CP720 contributed by Alexander Belchenko and Amaury Forgeot d'Arc in :issue:`1616979`; CP858 contributed by Tim Hatch in :issue:`8016`.)
ru: Теперь поддерживаются две новые кодировки: «cp720», используемая в основном для арабского текста; и «cp858», вариант CP 850, в который добавлен символ евро. (CP720 предоставлен Александром Бельченко и Амори Форжо д'Арк в :issue:`1616979`; CP858 предоставлен Тимом Хэтчем в :issue:`8016`.)

source: The Python tokenizer now translates line endings itself, so the :func:`compile` built-in function now accepts code using any line-ending convention. Additionally, it no longer requires that the code end in a newline.
ru: Токенизатор Python теперь сам транслирует окончания строк, поэтому встроенная функция :func:`compile` теперь принимает код, использующий любое соглашение об окончании строк. Кроме того, больше не требуется, чтобы код заканчивался новой строкой.

source: Extra parentheses in function definitions are illegal in Python 3.x, meaning that you get a syntax error from ``def f((x)): pass``. In Python3-warning mode, Python 2.7 will now warn about this odd usage. (Noted by James Lingard; :issue:`7362`.)
ru: Дополнительные круглые скобки в определениях функций недопустимы в Python 3.x, а это означает, что вы получите синтаксическую ошибку из ``def f((x)): pass``. В режиме предупреждения Python3 Python 2.7 теперь будет предупреждать об этом странном использовании. (Примечание Джеймса Лингарда; :issue:`7362`.)

source: It's now possible to create weak references to old-style class objects. New-style classes were always weak-referenceable. (Fixed by Antoine Pitrou; :issue:`8268`.)
ru: Теперь можно создавать слабые ссылки на объекты классов старого стиля. Классы нового стиля всегда были слабыми. (Исправлено Антуаном Питру; :issue:`8268`.)

source: When a module object is garbage-collected, the module's dictionary is now only cleared if no one else is holding a reference to the dictionary (:issue:`7140`).
ru: Когда объект модуля подвергается сборке мусора, словарь модуля теперь очищается только в том случае, если никто больше не хранит ссылку на словарь (:issue:`7140`).

source: Interpreter Changes
ru: Изменения интерпретатора

source: A new environment variable, :envvar:`PYTHONWARNINGS`, allows controlling warnings. It should be set to a string containing warning settings, equivalent to those used with the :option:`-W` switch, separated by commas. (Contributed by Brian Curtin; :issue:`7301`.)
ru: Новая переменная среды :envvar:`PYTHONWARNINGS` позволяет управлять предупреждениями. Должна быть установлена ​​строка, содержащая настройки предупреждений, эквивалентные тем, которые используются с переключателем :option:`-W`, разделенные запятыми. (Предоставлено Брайаном Кертином; :issue:`7301`.)

source: Optimizations
ru: Оптимизации

source: Several performance enhancements have been added:
ru: Добавлено несколько улучшений производительности:

source: The garbage collector now performs better for one common usage pattern: when many objects are being allocated without deallocating any of them. This would previously take quadratic time for garbage collection, but now the number of full garbage collections is reduced as the number of objects on the heap grows. The new logic only performs a full garbage collection pass when the middle generation has been collected 10 times and when the number of survivor objects from the middle generation exceeds 10% of the number of objects in the oldest generation. (Suggested by Martin von Löwis and implemented by Antoine Pitrou; :issue:`4074`.)
ru: Сборщик мусора теперь работает лучше для одного распространенного шаблона использования: когда выделяется много объектов без освобождения ни одного из них. Раньше на сбор мусора требовалось квадратичное время, но теперь количество полных сборок мусора уменьшается по мере роста количества объектов в куче. Новая логика выполняет полный проход сборки мусора только в том случае, если среднее поколение было собрано 10 раз и когда количество выживших объектов среднего поколения превышает 10% от количества объектов в самом старом поколении. (Предложено Мартином фон Лёвисом и реализовано Антуаном Питру; :issue:`4074`.)

source: The garbage collector tries to avoid tracking simple containers which can't be part of a cycle. In Python 2.7, this is now true for tuples and dicts containing atomic types (such as ints, strings, etc.). Transitively, a dict containing tuples of atomic types won't be tracked either. This helps reduce the cost of each garbage collection by decreasing the number of objects to be considered and traversed by the collector. (Contributed by Antoine Pitrou; :issue:`4688`.)
ru: Сборщик мусора пытается избежать отслеживания простых контейнеров, которые не могут быть частью цикла. В Python 2.7 это теперь справедливо для кортежей и диктовок, содержащих атомарные типы (такие как целые числа, строки и т. д.). Транзитивно, словарь, содержащий кортежи атомарных типов, также не будет отслеживаться. Это помогает снизить стоимость каждой сборки мусора за счет уменьшения количества объектов, которые необходимо учитывать и обходить сборщику. (Предоставлено Антуаном Питру; :issue:`4688`.)
