Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.7.po
Languages: ru

source: Most of Python 3.4's :mod:`ssl` module was backported. This means :mod:`ssl` now supports Server Name Indication, TLS1.x settings, access to the platform certificate store, the :class:`~ssl.SSLContext` class, and other features. (Contributed by Alex Gaynor and David Reid; :issue:`21308`.)
ru: Большая часть модуля :mod:`ssl` Python 3.4 была перенесена обратно. Это означает, что :mod:`ssl` теперь поддерживает указание имени сервера, настройки TLS1.x, доступ к хранилищу сертификатов платформы, класс :class:`~ssl.SSLContext` и другие функции. (Предоставлено Алексом Гейнором и Дэвидом Ридом; :issue:`21308`.)

source: Refer to the "Version added: 2.7.9" notes in the module documentation for specific details.
ru: Подробности см. в примечаниях «Добавлена ​​версия: 2.7.9» в документации модуля.

source: :func:`os.urandom` was changed to cache a file descriptor to ``/dev/urandom`` instead of reopening ``/dev/urandom`` on every call. (Contributed by Alex Gaynor; :issue:`21305`.)
ru: :func:`os.urandom` был изменен для кэширования дескриптора файла в ``/dev/urandom`` вместо повторного открытия ``/dev/urandom`` при каждом вызове. (Предоставлено Алексом Гейнором; :issue:`21305`.)

source: :data:`hashlib.algorithms_guaranteed` and :data:`hashlib.algorithms_available` were backported from Python 3 to make it easier for Python 2 applications to select the strongest available hash algorithm. (Contributed by Alex Gaynor in :issue:`21307`)
ru: :data:`hashlib.algorithms_guaranteed` и :data:`hashlib.algorithms_available` были перенесены из Python 3, чтобы приложениям Python 2 было проще выбирать самый сильный доступный алгоритм хеширования. (Предоставлено Алексом Гейнором в :issue:`21307`)

source: PEP 477: Backport ensurepip (PEP 453) to Python 2.7
ru: PEP 477: бэкпорт обеспечения pip (PEP 453) в Python 2.7.

source: :pep:`477` approves the inclusion of the :pep:`453` ensurepip module and the improved documentation that was enabled by it in the Python 2.7 maintenance releases, appearing first in the Python 2.7.9 release.
ru: :pep:`477` одобряет включение модуля :pep:`453` обеспечения pip и улучшенной документации, которая была включена с его помощью, в выпуски обслуживания Python 2.7, впервые появившиеся в выпуске Python 2.7.9.

source: Bootstrapping pip By Default
ru: Начальная загрузка по умолчанию

source: The new :mod:`ensurepip` module (defined in :pep:`453`) provides a standard cross-platform mechanism to bootstrap the pip installer into Python installations. The version of ``pip`` included with Python 2.7.9 is ``pip`` 1.5.6, and future 2.7.x maintenance releases will update the bundled version to the latest version of ``pip`` that is available at the time of creating the release candidate.
ru: Новый модуль :mod:`ensurepip` (определенный в :pep:`453`) предоставляет стандартный кросс-платформенный механизм для загрузки установщика pip в установки Python. Версия pip, включенная в Python 2.7.9, — это pip 1.5.6, а в будущих выпусках обслуживания 2.7.x включенная в комплект версия будет обновлена ​​до последней версии pip, доступной по адресу время создания релиз-кандидата.

source: By default, the commands ``pip``, ``pipX`` and ``pipX.Y`` will be installed on all platforms (where X.Y stands for the version of the Python installation), along with the ``pip`` Python package and its dependencies.
ru: По умолчанию команды pip, pipX и pipX.Y будут установлены на всех платформах (где XY означает версию установки Python) вместе с pip. ` Пакет Python и его зависимости.

source: For CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, the ``make install`` and ``make altinstall`` commands do not bootstrap ``pip`` by default. This behaviour can be controlled through configure options, and overridden through Makefile options.
ru: Для CPython :ref:`source, построенного на системах POSIX <building-python-on-unix>`, команды ``make install`` и ``make altinstall`` по умолчанию не загружают ``pip``. Этим поведением можно управлять с помощью параметров конфигурации и переопределить с помощью параметров Makefile.

source: On Windows and Mac OS X, the CPython installers now default to installing ``pip`` along with CPython itself (users may opt out of installing it during the installation process). Window users will need to opt in to the automatic ``PATH`` modifications to have ``pip`` available from the command line by default, otherwise it can still be accessed through the Python launcher for Windows as ``py -m pip``.
ru: В Windows и Mac OS X установщики CPython теперь по умолчанию устанавливают pip вместе с самим CPython (пользователи могут отказаться от его установки в процессе установки). Пользователям Windows необходимо будет согласиться на автоматические изменения PATH, чтобы pip был доступен из командной строки по умолчанию, в противном случае к нему все равно можно будет получить доступ через панель запуска Python для Windows как py -m pip. ``.

source: Documentation Changes
ru: Изменения в документации

source: As part of this change, the :ref:`installing-index` and :ref:`distributing-index` sections of the documentation have been completely redesigned as short getting started and FAQ documents. Most packaging documentation has now been moved out to the Python Packaging Authority maintained `Python Packaging User Guide <https://packaging.python.org>`__ and the documentation of the individual projects.
ru: В рамках этого изменения разделы документации :ref:`installing-index` и :ref:`distributing-index` были полностью переработаны и теперь представляют собой краткие инструкции по началу работы и документы с часто задаваемыми вопросами. Большая часть документации по упаковке теперь перенесена в Управление по упаковке Python, где хранится «Руководство пользователя по упаковке Python <https://packaging.python.org>»__ и документация по отдельным проектам.

source: :pep:`453` -- Explicit bootstrapping of pip in Python installations
ru: :pep:`453` -- Явная загрузка pip в установках Python

source: PEP written by Donald Stufft and Nick Coghlan, implemented by Donald Stufft, Nick Coghlan, Martin von Löwis and Ned Deily.
ru: PEP написан Дональдом Стаффтом и Ником Когланом и реализован Дональдом Стаффтом, Ником Когланом, Мартином фон Лёвисом и Недом Дейли.

source: PEP 476: Enabling certificate verification by default for stdlib http clients
ru: PEP 476: включение проверки сертификата по умолчанию для http-клиентов stdlib

source: For applications which require the old previous behavior, they can pass an alternate context::
ru: Для приложений, которым требуется старое предыдущее поведение, они могут передавать альтернативный контекст:

source: PEP 493: HTTPS verification migration tools for Python 2.7
ru: PEP 493: инструменты миграции проверки HTTPS для Python 2.7

source: :pep:`493` provides additional migration tools to support a more incremental infrastructure upgrade process for environments containing applications and services relying on the historically permissive processing of server certificates when establishing client HTTPS connections. These additions were made in the Python 2.7.12 release.
ru: :pep:`493` предоставляет дополнительные инструменты миграции для поддержки более поэтапного процесса обновления инфраструктуры для сред, содержащих приложения и службы, основанных на исторически разрешенной обработке сертификатов сервера при установлении клиентских HTTPS-соединений. Эти дополнения были сделаны в версии Python 2.7.12.

source: These tools are intended for use in cases where affected applications and services can't be modified to explicitly pass a more permissive SSL context when establishing the connection.
ru: Эти инструменты предназначены для использования в случаях, когда затронутые приложения и службы не могут быть изменены для явной передачи более разрешающего контекста SSL при установке соединения.

source: For applications and services which can't be modified at all, the new ``PYTHONHTTPSVERIFY`` environment variable may be set to ``0`` to revert an entire Python process back to the default permissive behaviour of Python 2.7.8 and earlier.
ru: Для приложений и служб, которые вообще невозможно изменить, новая переменная среды PYTHONHTTPSVERIFY может быть установлена ​​в значение 0, чтобы вернуть весь процесс Python обратно к разрешенному по умолчанию поведению Python 2.7.8 и более ранних версий. .

source: New ``make regen-all`` build target
ru: Новая цель сборки make regen-all

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
ru: Чтобы упростить кросс-компиляцию и гарантировать, что CPython может быть надежно скомпилирован без необходимости наличия существующей версии Python, система сборки на основе autotools больше не пытается неявно перекомпилировать сгенерированные файлы на основе времени их изменения.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
ru: Вместо этого была добавлена ​​новая команда make regen-all для принудительной регенерации этих файлов при необходимости (например, после того, как начальная версия Python уже была собрана на основе предварительно сгенерированных версий).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
ru: Также определены более выборочные цели регенерации — подробности см. в :source:`Makefile.pre.in`.

source: (Contributed by Victor Stinner in :issue:`23404`.)
ru: (Предоставлено Виктором Стиннером в :issue:`23404`.)

source: Removal of ``make touch`` build target
ru: Удаление цели сборки ``make touch``.

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
ru: Цель сборки make touch, ранее использовавшаяся для запроса неявной регенерации сгенерированных файлов путем обновления времени их модификации, была удалена.

source: It has been replaced by the new ``make regen-all`` target.
ru: Он был заменен новой целью make regen-all.

source: Acknowledgements
ru: Подтверждение

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Nick Coghlan, Philip Jenvey, Ryan Lovett, R. David Murray, Hugh Secker-Walker.
ru: Автор хотел бы поблагодарить следующих людей за предложения, исправления и помощь в различных черновиках этой статьи: Ника Коглана, Филипа Дженви, Райана Ловетта, Р. Дэвида Мюррея, Хью Секер-Уокера.
