Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.7.po
Languages: ru

source: To support the new :class:`collections.OrderedDict` type, :func:`json.load` now has an optional *object_pairs_hook* parameter that will be called with any object literal that decodes to a list of pairs. (Contributed by Raymond Hettinger; :issue:`5381`.)
ru: Для поддержки нового типа :class:`collections.OrderedDict` :func:`json.load` теперь имеет необязательный параметр *object_pairs_hook*, который будет вызываться с любым литералом объекта, который декодирует в список пар. (Предоставлено Рэймондом Хеттингером; :issue:`5381`.)

source: The :mod:`mailbox` module's :class:`~mailbox.Maildir` class now records the timestamp on the directories it reads, and only re-reads them if the modification time has subsequently changed. This improves performance by avoiding unneeded directory scans. (Fixed by A.M. Kuchling and Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)
ru: Класс :class:`~mailbox.Maildir` модуля :mod:`mailbox` теперь записывает метку времени в читаемых каталогах и перечитывает их только в том случае, если время модификации впоследствии изменилось. Это повышает производительность за счет предотвращения ненужного сканирования каталогов. (Исправлено AM Kuchling и Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)

source: New functions: the :mod:`math` module gained :func:`~math.erf` and :func:`~math.erfc` for the error function and the complementary error function, :func:`~math.expm1` which computes ``e**x - 1`` with more precision than using :func:`~math.exp` and subtracting 1, :func:`~math.gamma` for the Gamma function, and :func:`~math.lgamma` for the natural log of the Gamma function. (Contributed by Mark Dickinson and nirinA raseliarison; :issue:`3366`.)
ru: Новые функции: модуль :mod:`math` получил :func:`~math.erf` и :func:`~math.erfc` для функции ошибки и дополнительной функции ошибки :func:`~math.expm1` который вычисляет ``e**x - 1`` с большей точностью, чем использование :func:`~math.exp` и вычитание 1, :func:`~math.gamma` для функции Gamma и :func:`~ math.lgamma` для натурального логарифма гамма-функции. (Предоставлено Марком Дикинсоном и nirinA raseliarison; :issue:`3366`.)

source: The :mod:`nntplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1664`.)
ru: Модуль :mod:`nntplib` теперь поддерживает адреса IPv6. (Предоставлено Дереком Морром; :issue:`1664`.)

source: New functions: the :mod:`os` module wraps the following POSIX system calls: :func:`~os.getresgid` and :func:`~os.getresuid`, which return the real, effective, and saved GIDs and UIDs; :func:`~os.setresgid` and :func:`~os.setresuid`, which set real, effective, and saved GIDs and UIDs to new values; :func:`~os.initgroups`, which initialize the group access list for the current process. (GID/UID functions contributed by Travis H.; :issue:`6508`. Support for initgroups added by Jean-Paul Calderone; :issue:`7333`.)
ru: Новые функции: модуль :mod:`os` содержит следующие системные вызовы POSIX: :func:`~os.getresgid` и :func:`~os.getresuid`, которые возвращают реальные, действующие и сохраненные GID и UID. ; :func:`~os.setresgid` и :func:`~os.setresuid`, которые устанавливают новые значения реальных, эффективных и сохраненных GID и UID; :func:`~os.initgroups`, которые инициализируют список группового доступа для текущего процесса. (Функции GID/UID предоставлены Трэвисом Х.; :issue:`6508`. Поддержка групп инициализации добавлена ​​Жаном-Полем Кальдероном; :issue:`7333`.)

source: The :func:`os.fork` function now re-initializes the import lock in the child process; this fixes problems on Solaris when :func:`~os.fork` is called from a thread. (Fixed by Zsolt Cserna; :issue:`7242`.)
ru: Функция :func:`os.fork` теперь повторно инициализирует блокировку импорта в дочернем процессе; это устраняет проблемы в Solaris, когда :func:`~os.fork` вызывается из потока. (Исправлено Жолтом Черной; :issue:`7242`.)

source: In the :mod:`os.path` module, the :func:`~os.path.normpath` and :func:`~os.path.abspath` functions now preserve Unicode; if their input path is a Unicode string, the return value is also a Unicode string. (:meth:`~os.path.normpath` fixed by Matt Giuca in :issue:`5827`; :meth:`~os.path.abspath` fixed by Ezio Melotti in :issue:`3426`.)
ru: В модуле :mod:`os.path` функции :func:`~os.path.normpath` и :func:`~os.path.abspath` теперь сохраняют Unicode; если их входной путь представляет собой строку Юникода, возвращаемое значение также является строкой Юникода. (:meth:`~os.path.normpath` исправлено Мэттом Джукой в ​​:issue:`5827`; :meth:`~os.path.abspath` исправлено Эцио Мелотти в :issue:`3426`.)

source: The :mod:`pydoc` module now has help for the various symbols that Python uses. You can now do ``help('<<')`` or ``help('@')``, for example. (Contributed by David Laban; :issue:`4739`.)
ru: Модуль :mod:`pydoc` теперь содержит справку по различным символам, которые использует Python. Теперь вы можете, например, выполнить ``help('<<')`` или ``help('@')``. (Предоставлено Дэвидом Лабаном; :issue:`4739`.)

source: The :mod:`re` module's :func:`~re.split`, :func:`~re.sub`, and :func:`~re.subn` now accept an optional *flags* argument, for consistency with the other functions in the module. (Added by Gregory P. Smith.)
ru: Модули :mod:`re` :func:`~re.split`, :func:`~re.sub` и :func:`~re.subn` теперь принимают необязательный аргумент *flags* для согласованности с остальные функции модуля. (Добавлено Грегори П. Смитом.)

source: New function: :func:`~runpy.run_path` in the :mod:`runpy` module will execute the code at a provided *path* argument. *path* can be the path of a Python source file (:file:`example.py`), a compiled bytecode file (:file:`example.pyc`), a directory (:file:`./package/`), or a zip archive (:file:`example.zip`). If a directory or zip path is provided, it will be added to the front of ``sys.path`` and the module :mod:`__main__` will be imported. It's expected that the directory or zip contains a :file:`__main__.py`; if it doesn't, some other :file:`__main__.py` might be imported from a location later in ``sys.path``. This makes more of the machinery of :mod:`runpy` available to scripts that want to mimic the way Python's command line processes an explicit path name. (Added by Nick Coghlan; :issue:`6816`.)
ru: Новая функция: :func:`~runpy.run_path` в модуле :mod:`runpy` выполнит код по указанному аргументу *path*. *path* может быть путем к исходному файлу Python (:file:`example.py`), скомпилированному файлу байт-кода (:file:`example.pyc`), каталогу (:file:`./package/` ) или zip-архив (:file:`example.zip`). Если указан каталог или путь к почтовому индексу, он будет добавлен в начало ``sys.path`` и будет импортирован модуль :mod:`__main__`. Ожидается, что каталог или zip-файл содержит :file:`__main__.py`; если это не так, какой-то другой :file:`__main__.py` может быть импортирован из другого места в ``sys.path``. Это делает больше возможностей :mod:`runpy` доступными для сценариев, которые хотят имитировать способ, которым командная строка Python обрабатывает явное имя пути. (Добавлено Ником Когланом; :issue:`6816`.)

source: New function: in the :mod:`shutil` module, :func:`~shutil.make_archive` takes a filename, archive type (zip or tar-format), and a directory path, and creates an archive containing the directory's contents. (Added by Tarek Ziadé.)
ru: Новая функция: в модуле :mod:`shutil` :func:`~shutil.make_archive` принимает имя файла, тип архива (формат zip или tar) и путь к каталогу и создает архив, содержащий содержимое каталога. (Добавлено Тарек Зиаде.)

source: :mod:`shutil`'s :func:`~shutil.copyfile` and :func:`~shutil.copytree` functions now raise a :exc:`~shutil.SpecialFileError` exception when asked to copy a named pipe. Previously the code would treat named pipes like a regular file by opening them for reading, and this would block indefinitely. (Fixed by Antoine Pitrou; :issue:`3002`.)
ru: Функции :mod:`shutil` :func:`~shutil.copyfile` и :func:`~shutil.copytree` теперь вызывают исключение :exc:`~shutil.SpecialFileError` при запросе на копирование именованного канала. Раньше код обрабатывал именованные каналы как обычные файлы, открывая их для чтения, и это блокировалось на неопределенный срок. (Исправлено Антуаном Питру; :issue:`3002`.)

source: The :mod:`signal` module no longer re-installs the signal handler unless this is truly necessary, which fixes a bug that could make it impossible to catch the EINTR signal robustly. (Fixed by Charles-Francois Natali; :issue:`8354`.)
ru: Модуль :mod:`signal` больше не переустанавливает обработчик сигнала, если в этом нет действительной необходимости. Это исправляет ошибку, которая могла сделать невозможным надежный перехват сигнала EINTR. (Исправлено Шарлем-Франсуа Натали; :issue:`8354`.)

source: The :mod:`site` module now reports exceptions occurring when the :mod:`sitecustomize` module is imported, and will no longer catch and swallow the :exc:`KeyboardInterrupt` exception. (Fixed by Victor Stinner; :issue:`3137`.)
ru: Модуль :mod:`site` теперь сообщает об исключениях, возникающих при импорте модуля :mod:`sitecustomize`, и больше не будет перехватывать и поглощать исключение :exc:`KeyboardInterrupt`. (Исправлено Виктором Стиннером; :issue:`3137`.)

source: The :func:`~socket.create_connection` function gained a *source_address* parameter, a ``(host, port)`` 2-tuple giving the source address that will be used for the connection. (Contributed by Eldon Ziegler; :issue:`3972`.)
ru: Функция :func:`~socket.create_connection` получила параметр *source_address*, двухкортеж ``(host, port)``, задающий адрес источника, который будет использоваться для соединения. (Предоставлено Элдоном Зиглером; :issue:`3972`.)

source: The :meth:`~socket.socket.recv_into` and :meth:`~socket.socket.recvfrom_into` methods will now write into objects that support the buffer API, most usefully the :class:`bytearray` and :class:`memoryview` objects. (Implemented by Antoine Pitrou; :issue:`8104`.)
ru: Методы :meth:`~socket.socket.recv_into` и :meth:`~socket.socket.recvfrom_into` теперь будут записывать данные в объекты, поддерживающие API буфера, наиболее полезными являются :class:`bytearray` и :class:` MemoryView` объекты. (Реализовано Антуаном Питру; :issue:`8104`.)

source: Updated module: the :mod:`sqlite3` module has been updated to version 2.6.0 of the `pysqlite package <https://github.com/ghaering/pysqlite>`__. Version 2.6.0 includes a number of bugfixes, and adds the ability to load SQLite extensions from shared libraries. Call the ``enable_load_extension(True)`` method to enable extensions, and then call :meth:`~sqlite3.Connection.load_extension` to load a particular shared library. (Updated by Gerhard Häring.)
ru: Обновленный модуль: модуль :mod:`sqlite3` обновлен до версии 2.6.0 пакета `pysqlite <https://github.com/ghhaering/pysqlite>`__. Версия 2.6.0 включает ряд исправлений и добавляет возможность загружать расширения SQLite из общих библиотек. Вызовите метод ``enable_load_extension(True)``, чтобы включить расширения, а затем вызовите :meth:`~sqlite3.Connection.load_extension`, чтобы загрузить определенную общую библиотеку. (Обновлено Герхардом Херингом.)

source: Another change makes the extension load all of OpenSSL's ciphers and digest algorithms so that they're all available. Some SSL certificates couldn't be verified, reporting an "unknown algorithm" error. (Reported by Beda Kosata, and fixed by Antoine Pitrou; :issue:`8484`.)
ru: Еще одно изменение заставляет расширение загружать все шифры и алгоритмы дайджеста OpenSSL, чтобы они все были доступны. Некоторые сертификаты SSL не удалось проверить, что привело к ошибке «неизвестного алгоритма». (Сообщил Беда Косата и исправил Антуан Питру; :issue:`8484`.)

source: New function: the :mod:`subprocess` module's :func:`~subprocess.check_output` runs a command with a specified set of arguments and returns the command's output as a string when the command runs without error, or raises a :exc:`~subprocess.CalledProcessError` exception otherwise.
ru: Новая функция: модуль :mod:`subprocess` :func:`~subprocess.check_output` запускает команду с указанным набором аргументов и возвращает выходные данные команды в виде строки, когда команда выполняется без ошибок, или вызывает :exc: В противном случае исключение `~subprocess.CalledProcessError`.

source: (Contributed by Gregory P. Smith.)
ru: (Предоставлено Грегори П. Смитом.)

source: New function: :func:`~symtable.Symbol.is_declared_global` in the :mod:`symtable` module returns true for variables that are explicitly declared to be global, false for ones that are implicitly global. (Contributed by Jeremy Hylton.)
ru: Новая функция: :func:`~symtable.Symbol.is_declared_global` в модуле :mod:`symtable` возвращает true для переменных, которые явно объявлены глобальными, и false для переменных, которые неявно являются глобальными. (Предоставлено Джереми Хилтоном.)

source: The :mod:`syslog` module will now use the value of ``sys.argv[0]`` as the identifier instead of the previous default value of ``'python'``. (Changed by Sean Reifschneider; :issue:`8451`.)
ru: Модуль :mod:`syslog` теперь будет использовать значение ``sys.argv[0]`` в качестве идентификатора вместо предыдущего значения по умолчанию ``'python'``. (Изменено Шоном Рейфшнайдером; :issue:`8451`.)

source: The :mod:`tarfile` module's default error handling has changed, to no longer suppress fatal errors. The default error level was previously 0, which meant that errors would only result in a message being written to the debug log, but because the debug log is not activated by default, these errors go unnoticed. The default error level is now 1, which raises an exception if there's an error. (Changed by Lars Gustäbel; :issue:`7357`.)
ru: Изменена обработка ошибок по умолчанию в модуле :mod:`tarfile`, чтобы больше не подавлять фатальные ошибки. Раньше уровень ошибок по умолчанию был равен 0, что означало, что ошибки приводили только к записи сообщения в журнал отладки, но поскольку журнал отладки по умолчанию не активирован, эти ошибки остаются незамеченными. Уровень ошибки по умолчанию теперь равен 1, что вызывает исключение в случае ошибки. (Изменено Ларсом Густебелем; :issue:`7357`.)

source: :mod:`tarfile` now supports filtering the :class:`~tarfile.TarInfo` objects being added to a tar file. When you call :meth:`~tarfile.TarFile.add`, you may supply an optional *filter* argument that's a callable. The *filter* callable will be passed the :class:`~tarfile.TarInfo` for every file being added, and can modify and return it. If the callable returns ``None``, the file will be excluded from the resulting archive. This is more powerful than the existing *exclude* argument, which has therefore been deprecated. (Added by Lars Gustäbel; :issue:`6856`.) The :class:`~tarfile.TarFile` class also now supports the context management protocol. (Added by Lars Gustäbel; :issue:`7232`.)
ru: :mod:`tarfile` теперь поддерживает фильтрацию объектов :class:`~tarfile.TarInfo`, добавляемых в tar-файл. Когда вы вызываете :meth:`~tarfile.TarFile.add`, вы можете указать необязательный аргумент *filter*, который является вызываемым. Вызываемому объекту *filter* будет передан :class:`~tarfile.TarInfo` для каждого добавляемого файла, и он сможет изменить и вернуть его. Если вызываемый объект возвращает None, файл будет исключен из результирующего архива. Это более мощный аргумент, чем существующий аргумент *exclude*, который поэтому устарел. (Добавлено Ларсом Густабелем; :issue:`6856`.) Класс :class:`~tarfile.TarFile` теперь также поддерживает протокол управления контекстом. (Добавлено Ларсом Густебелем; :issue:`7232`.)

source: The :meth:`~threading.Event.wait` method of the :class:`threading.Event` class now returns the internal flag on exit. This means the method will usually return true because :meth:`~threading.Event.wait` is supposed to block until the internal flag becomes true. The return value will only be false if a timeout was provided and the operation timed out. (Contributed by Tim Lesher; :issue:`1674032`.)
ru: Метод :meth:`~threading.Event.wait` класса :class:`threading.Event` теперь возвращает внутренний флаг при выходе. Это означает, что метод обычно возвращает true, поскольку :meth:`~threading.Event.wait` должен блокироваться до тех пор, пока внутренний флаг не станет истинным. Возвращаемое значение будет ложным только в том случае, если был предоставлен тайм-аут и время ожидания операции истекло. (Предоставлено Тимом Лешером; :issue:`1674032`.)

source: The Unicode database provided by the :mod:`unicodedata` module is now used internally to determine which characters are numeric, whitespace, or represent line breaks. The database also includes information from the :file:`Unihan.txt` data file (patch by Anders Chrigström and Amaury Forgeot d'Arc; :issue:`1571184`) and has been updated to version 5.2.0 (updated by Florent Xicluna; :issue:`8024`).
ru: База данных Unicode, предоставляемая модулем :mod:`unicodedata`, теперь используется внутри системы для определения того, какие символы являются цифрами, пробелами или представляют собой разрывы строк. База данных также включает информацию из файла данных :file:`Unihan.txt` (исправление Андерса Крисгстрема и Амори Форжо д'Арк; :issue:`1571184`) и обновлена ​​до версии 5.2.0 (обновлена ​​Флораном Ксиклюной). :issue:`8024`).

source: Python 2.7 (and Python 2.6.5) will return:
ru: Python 2.7 (и Python 2.6.5) вернет:

source: (Python 2.7 actually produces slightly different output, since it returns a named tuple instead of a standard tuple.)
ru: (Python 2.7 на самом деле выдает немного другой результат, поскольку возвращает именованный кортеж вместо стандартного кортежа.)

source: New class: the :class:`~weakref.WeakSet` class in the :mod:`weakref` module is a set that only holds weak references to its elements; elements will be removed once there are no references pointing to them. (Originally implemented in Python 3.x by Raymond Hettinger, and backported to 2.7 by Michael Foord.)
ru: Новый класс: класс :class:`~weakref.WeakSet` в модуле :mod:`weakref` представляет собой набор, который содержит только слабые ссылки на свои элементы; элементы будут удалены, как только на них не будет ссылок. (Первоначально реализовано в Python 3.x Рэймондом Хеттингером и перенесено в версию 2.7 Майклом Фурдом.)

source: The :mod:`zipfile` module's :class:`~zipfile.ZipFile` now supports the context management protocol, so you can write ``with zipfile.ZipFile(...) as f:``. (Contributed by Brian Curtin; :issue:`5511`.)
ru: Модуль :mod:`zipfile` :class:`~zipfile.ZipFile` теперь поддерживает протокол управления контекстом, поэтому вы можете написать ``with zipfile.ZipFile(...) как f:``. (Предоставлено Брайаном Кертином; :issue:`5511`.)

source: The :func:`~zipfile.is_zipfile` function now accepts a file object, in addition to the path names accepted in earlier versions. (Contributed by Gabriel Genellina; :issue:`4756`.)
ru: Функция :func:`~zipfile.is_zipfile` теперь принимает файловый объект в дополнение к именам путей, принятым в более ранних версиях. (Предоставлено Габриэлем Дженеллиной; :issue:`4756`.)

source: The :meth:`~zipfile.ZipFile.writestr` method now has an optional *compress_type* parameter that lets you override the default compression method specified in the :class:`~zipfile.ZipFile` constructor. (Contributed by Ronald Oussoren; :issue:`6003`.)
ru: Метод :meth:`~zipfile.ZipFile.writestr` теперь имеет дополнительный параметр *compress_type*, который позволяет переопределить метод сжатия по умолчанию, указанный в конструкторе :class:`~zipfile.ZipFile`. (Предоставлено Рональдом Уссореном; :issue:`6003`.)

source: New module: importlib
ru: Новый модуль: importlib

source: ``import_module(name, package=None)`` imports a module. *name* is a string containing the module or package's name. It's possible to do relative imports by providing a string that begins with a ``.`` character, such as ``..utils.errors``. For relative imports, the *package* argument must be provided and is the name of the package that will be used as the anchor for the relative import. :func:`~importlib.import_module` both inserts the imported module into ``sys.modules`` and returns the module object.
ru: ``import_module(name, package=None)`` импортирует модуль. *name* — строка, содержащая имя модуля или пакета. Относительный импорт можно выполнить, предоставив строку, начинающуюся с символа ``.``, например ``..utils.errors``. Для относительного импорта необходимо указать аргумент *package*, который является именем пакета, который будет использоваться в качестве привязки для относительного импорта. :func:`~importlib.import_module` вставляет импортированный модуль в ``sys.modules`` и возвращает объект модуля.

source: Here are some examples::
ru: Вот несколько примеров:

source: :mod:`importlib` was implemented by Brett Cannon and introduced in Python 3.1.
ru: :mod:`importlib` был реализован Бреттом Кэнноном и представлен в Python 3.1.

source: New module: sysconfig
ru: Новый модуль: sysconfig

source: The :mod:`sysconfig` module has been pulled out of the Distutils package, becoming a new top-level module in its own right. :mod:`sysconfig` provides functions for getting information about Python's build process: compiler switches, installation paths, the platform name, and whether Python is running from its source directory.
ru: Модуль :mod:`sysconfig` был исключен из пакета Distutils, став самостоятельным новым модулем верхнего уровня. :mod:`sysconfig` предоставляет функции для получения информации о процессе сборки Python: переключатели компилятора, пути установки, имя платформы и то, запущен ли Python из исходного каталога.

source: Some of the functions in the module are:
ru: Некоторые функции модуля:

source: :func:`~sysconfig.get_config_var` returns variables from Python's Makefile and the :file:`pyconfig.h` file.
ru: :func:`~sysconfig.get_config_var` возвращает переменные из Makefile Python и файла :file:`pyconfig.h`.

source: :func:`~sysconfig.get_config_vars` returns a dictionary containing all of the configuration variables.
ru: :func:`~sysconfig.get_config_vars` возвращает словарь, содержащий все переменные конфигурации.

source: :func:`~sysconfig.get_path` returns the configured path for a particular type of module: the standard library, site-specific modules, platform-specific modules, etc.
ru: :func:`~sysconfig.get_path` возвращает настроенный путь для определенного типа модуля: стандартная библиотека, модули для конкретного сайта, модули для конкретной платформы и т. д.

source: :func:`~sysconfig.is_python_build` returns true if you're running a binary from a Python source tree, and false otherwise.
ru: :func:`~sysconfig.is_python_build` возвращает true, если вы запускаете двоичный файл из дерева исходного кода Python, и false в противном случае.

source: Consult the :mod:`sysconfig` documentation for more details and for a complete list of functions.
ru: Обратитесь к документации :mod:`sysconfig` для получения более подробной информации и полного списка функций.

source: The Distutils package and :mod:`sysconfig` are now maintained by Tarek Ziadé, who has also started a Distutils2 package (source repository at https://hg.python.org/distutils2/) for developing a next-generation version of Distutils.
ru: Пакет Distutils и :mod:`sysconfig` теперь поддерживаются Тареком Зиаде, который также запустил пакет Distutils2 (исходный репозиторий https://hg.python.org/distutils2/) для разработки версии Distutils следующего поколения. .

source: ttk: Themed Widgets for Tk
ru: ttk: Тематические виджеты для Tk
