Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.7.po
Languages: ru

source: Long integers are now stored internally either in base ``2**15`` or in base ``2**30``, the base being determined at build time. Previously, they were always stored in base ``2**15``. Using base ``2**30`` gives significant performance improvements on 64-bit machines, but benchmark results on 32-bit machines have been mixed. Therefore, the default is to use base ``2**30`` on 64-bit machines and base ``2**15`` on 32-bit machines; on Unix, there's a new configure option :option:`!--enable-big-digits` that can be used to override this default.
ru: Длинные целые числа теперь хранятся внутри либо в базе ``2**15``, либо в базе ``2**30``, причем база определяется во время сборки. Раньше они всегда хранились в базе ``2**15``. Использование базы «2**30» дает значительный прирост производительности на 64-битных машинах, но результаты тестов на 32-битных машинах неоднозначны. Поэтому по умолчанию используется база «2**30» на 64-битных машинах и база «2**15» на 32-битных машинах; в Unix появилась новая опция конфигурации :option:`!--enable-big-digits`, которую можно использовать для переопределения этого значения по умолчанию.

source: (Contributed by Mark Dickinson; :issue:`4258`.)
ru: (Предоставлено Марком Дикинсоном; :issue:`4258`.)

source: Another set of changes made long objects a few bytes smaller: 2 bytes smaller on 32-bit systems and 6 bytes on 64-bit. (Contributed by Mark Dickinson; :issue:`5260`.)
ru: Другой набор изменений уменьшил длинные объекты на несколько байт: на 2 байта меньше в 32-битных системах и на 6 байтов в 64-битных. (Предоставлено Марком Дикинсоном; :issue:`5260`.)

source: The division algorithm for long integers has been made faster by tightening the inner loop, doing shifts instead of multiplications, and fixing an unnecessary extra iteration. Various benchmarks show speedups of between 50% and 150% for long integer divisions and modulo operations. (Contributed by Mark Dickinson; :issue:`5512`.) Bitwise operations are also significantly faster (initial patch by Gregory Smith; :issue:`1087418`).
ru: Алгоритм деления длинных целых чисел стал быстрее за счет сокращения внутреннего цикла, выполнения сдвигов вместо умножения и исправления ненужной дополнительной итерации. Различные тесты показывают ускорение от 50% до 150% для деления длинных целых чисел и операций по модулю. (Разработано Марком Дикинсоном; :issue:`5512`.) Побитовые операции также выполняются значительно быстрее (первоначальный патч Грегори Смита; :issue:`1087418`).

source: The implementation of ``%`` checks for the left-side operand being a Python string and special-cases it; this results in a 1--3% performance increase for applications that frequently use ``%`` with strings, such as templating libraries. (Implemented by Collin Winter; :issue:`5176`.)
ru: Реализация ``%`` проверяет, является ли левый операнд строкой Python, и обрабатывает его в особых случаях; это приводит к увеличению производительности на 1–3 % для приложений, которые часто используют ``%`` со строками, таких как библиотеки шаблонов. (Реализован Коллином Уинтером; :issue:`5176`.)

source: List comprehensions with an ``if`` condition are compiled into faster bytecode. (Patch by Antoine Pitrou, back-ported to 2.7 by Jeffrey Yasskin; :issue:`4715`.)
ru: Понимания списков с условием if компилируются в более быстрый байт-код. (Патч Антуана Питру, перенесенный на версию 2.7 Джеффри Ясскиным; :issue:`4715`.)

source: Converting an integer or long integer to a decimal string was made faster by special-casing base 10 instead of using a generalized conversion function that supports arbitrary bases. (Patch by Gawain Bolton; :issue:`6713`.)
ru: Преобразование целого или длинного целого числа в десятичную строку стало быстрее благодаря использованию специального основания 10 вместо использования обобщенной функции преобразования, поддерживающей произвольные основания. (Патч от Гавейна Болтона; :issue:`6713`.)

source: New and Improved Modules
ru: Новые и улучшенные модули

source: As in every release, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the Subversion logs for all the details.
ru: Как и в каждом выпуске, стандартная библиотека Python получила ряд улучшений и исправлений ошибок. Вот неполный список наиболее заметных изменений, отсортированный в алфавитном порядке по названию модуля. Обратитесь к файлу :file:`Misc/NEWS` в дереве исходного кода для получения более полного списка изменений или просмотрите журналы Subversion для получения всех подробностей.

source: The :mod:`bdb` module's base debugging class :class:`~bdb.Bdb` gained a feature for skipping modules. The constructor now takes an iterable containing glob-style patterns such as ``django.*``; the debugger will not step into stack frames from a module that matches one of these patterns. (Contributed by Maru Newby after a suggestion by Senthil Kumaran; :issue:`5142`.)
ru: Базовый класс отладки модуля :mod:`bdb` :class:`~bdb.Bdb` получил возможность пропуска модулей. Конструктор теперь принимает итерацию, содержащую шаблоны в стиле glob, такие как ``django.*``; отладчик не будет входить в кадры стека из модуля, который соответствует одному из этих шаблонов. (Предоставлено Мару Ньюби по предложению Сентила Кумарана; :issue:`5142`.)

source: The :mod:`binascii` module now supports the buffer API, so it can be used with :class:`memoryview` instances and other similar buffer objects. (Backported from 3.x by Florent Xicluna; :issue:`7703`.)
ru: Модуль :mod:`binascii` теперь поддерживает API буфера, поэтому его можно использовать с экземплярами :class:`memoryview` и другими подобными буферными объектами. (Бэкпортировано из версии 3.x Флораном Ксиклюной; :issue:`7703`.)

source: The :mod:`bz2` module's :class:`~bz2.BZ2File` now supports the context management protocol, so you can write ``with bz2.BZ2File(...) as f:``. (Contributed by Hagen Fürstenau; :issue:`3860`.)
ru: :class:`~bz2.BZ2File` модуля :mod:`bz2` теперь поддерживает протокол управления контекстом, поэтому вы можете написать ``with bz2.BZ2File(...) как f:``. (Предоставлено Хагеном Фюрстенау; :issue:`3860`.)

source: New class: the :class:`~collections.Counter` class in the :mod:`collections` module is useful for tallying data. :class:`~collections.Counter` instances behave mostly like dictionaries but return zero for missing keys instead of raising a :exc:`KeyError`:
ru: Новый класс: класс :class:`~collections.Counter` в модуле :mod:`collections` полезен для подсчета данных. Экземпляры :class:`~collections.Counter` ведут себя в основном как словари, но возвращают ноль в случае отсутствующих ключей вместо выдачи :exc:`KeyError`:

source: There are three additional :class:`~collections.Counter` methods. :meth:`~collections.Counter.most_common` returns the N most common elements and their counts. :meth:`~collections.Counter.elements` returns an iterator over the contained elements, repeating each element as many times as its count. :meth:`~collections.Counter.subtract` takes an iterable and subtracts one for each element instead of adding; if the argument is a dictionary or another :class:`Counter`, the counts are subtracted. ::
ru: Есть три дополнительных метода :class:`~collections.Counter`. :meth:`~collections.Counter.most_common` возвращает N наиболее распространенных элементов и их количество. :meth:`~collections.Counter.elements` возвращает итератор по содержащимся элементам, повторяя каждый элемент столько раз, сколько его счетчик. :meth:`~collections.Counter.subtract` принимает итерируемое значение и вычитает его для каждого элемента вместо сложения; если аргументом является словарь или другой :class:`Counter`, счетчики вычитаются. ::

source: Contributed by Raymond Hettinger; :issue:`1696199`.
ru: Предоставлено Раймондом Хеттингером; :issue:`1696199`.

source: New class: :class:`~collections.OrderedDict` is described in the earlier section :ref:`pep-0372`.
ru: Новый класс: :class:`~collections.OrderedDict` описан в предыдущем разделе :ref:`pep-0372`.

source: New method: The :class:`~collections.deque` data type now has a :meth:`~collections.deque.count` method that returns the number of contained elements equal to the supplied argument *x*, and a :meth:`~collections.deque.reverse` method that reverses the elements of the deque in-place. :class:`~collections.deque` also exposes its maximum length as the read-only :attr:`~collections.deque.maxlen` attribute. (Both features added by Raymond Hettinger.)
ru: Новый метод: тип данных :class:`~collections.deque` теперь имеет метод :meth:`~collections.deque.count`, который возвращает количество содержащихся элементов, равное предоставленному аргументу *x*, и метод :meth. :`~collections.deque.reverse` метод, который меняет местами элементы дека. :class:`~collections.deque` также предоставляет свою максимальную длину как атрибут :attr:`~collections.deque.maxlen`, доступный только для чтения. (Обе функции добавлены Раймондом Хеттингером.)

source: The :class:`~collections.namedtuple` class now has an optional *rename* parameter. If *rename* is true, field names that are invalid because they've been repeated or aren't legal Python identifiers will be renamed to legal names that are derived from the field's position within the list of fields:
ru: Класс :class:`~collections.namedtuple` теперь имеет необязательный параметр *rename*. Если *rename* имеет значение true, имена полей, которые являются недопустимыми, поскольку они повторяются или не являются допустимыми идентификаторами Python, будут переименованы в допустимые имена, полученные из позиции поля в списке полей:

source: (Added by Raymond Hettinger; :issue:`1818`.)
ru: (Добавлено Рэймондом Хеттингером; :issue:`1818`.)

source: (Contributed by Mats Kindahl; :issue:`7005`.)
ru: (Предоставлено Матсом Киндалем; :issue:`7005`.)

source: The :mod:`copy` module's :func:`~copy.deepcopy` function will now correctly copy bound instance methods. (Implemented by Robert Collins; :issue:`1515`.)
ru: Функция :func:`~copy.deepcopy` модуля :mod:`copy` теперь правильно копирует связанные методы экземпляра. (Реализовано Робертом Коллинзом; :issue:`1515`.)

source: The :mod:`ctypes` module now always converts ``None`` to a C ``NULL`` pointer for arguments declared as pointers. (Changed by Thomas Heller; :issue:`4606`.) The underlying `libffi library <https://sourceware.org/libffi/>`__ has been updated to version 3.0.9, containing various fixes for different platforms. (Updated by Matthias Klose; :issue:`8142`.)
ru: Модуль :mod:`ctypes` теперь всегда преобразует ``None`` в указатель C ``NULL`` для аргументов, объявленных как указатели. (Изменено Томасом Хеллером; :issue:`4606`.) Базовая `libffi библиотека <https://sourceware.org/libffi/>`__ была обновлена ​​до версии 3.0.9, содержащей различные исправления для разных платформ. (Обновлено Маттиасом Клозе; :issue:`8142`.)

source: New method: the :mod:`datetime` module's :class:`~datetime.timedelta` class gained a :meth:`~datetime.timedelta.total_seconds` method that returns the number of seconds in the duration. (Contributed by Brian Quinlan; :issue:`5788`.)
ru: Новый метод: класс :class:`~datetime.timedelta` модуля :mod:`datetime` получил метод :meth:`~datetime.timedelta.total_секунды`, который возвращает количество секунд в продолжительности. (Предоставлено Брайаном Куинланом; :issue:`5788`.)

source: The constructor for :class:`~decimal.Decimal` now accepts floating-point numbers (added by Raymond Hettinger; :issue:`8257`) and non-European Unicode characters such as Arabic-Indic digits (contributed by Mark Dickinson; :issue:`6595`).
ru: Конструктор :class:`~decimal.Decimal` теперь принимает числа с плавающей запятой (добавленные Рэймондом Хеттингером; :issue:`8257`) и неевропейские символы Юникода, такие как арабско-индийские цифры (предоставлены Марком Дикинсоном; : выпуск:`6595`).

source: Most of the methods of the :class:`~decimal.Context` class now accept integers as well as :class:`~decimal.Decimal` instances; the only exceptions are the :meth:`~decimal.Context.canonical` and :meth:`~decimal.Context.is_canonical` methods. (Patch by Juan José Conti; :issue:`7633`.)
ru: Большинство методов класса :class:`~decimal.Context` теперь принимают целые числа, а также экземпляры :class:`~decimal.Decimal`; единственными исключениями являются методы :meth:`~decimal.Context.canonical` и :meth:`~decimal.Context.is_canonical`. (Патч Хуана Хосе Конти; :issue:`7633`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`~str.format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which is more sensible for numeric types. (Changed by Mark Dickinson; :issue:`6857`.)
ru: При использовании экземпляров :class:`~decimal.Decimal` с методом строки :meth:`~str.format` выравнивание по умолчанию ранее было выравниванием по левому краю. Это было изменено на выравнивание по правому краю, что более разумно для числовых типов. (Изменено Марком Дикинсоном; :issue:`6857`.)

source: The :mod:`difflib` module now produces output that is more compatible with modern :command:`diff`/:command:`patch` tools through one small change, using a tab character instead of spaces as a separator in the header giving the filename. (Fixed by Anatoly Techtonik; :issue:`7585`.)
ru: Модуль :mod:`difflib` теперь выдаёт выходные данные, более совместимые с современными инструментами :command:`diff`/:command:`patch`, за счёт одного небольшого изменения: в качестве разделителя в заголовке используется символ табуляции вместо пробелов. имя файла. (Исправлено Анатолием Техтоником; :issue:`7585`.)

source: The Distutils ``sdist`` command now always regenerates the :file:`MANIFEST` file, since even if the :file:`MANIFEST.in` or :file:`setup.py` files haven't been modified, the user might have created some new files that should be included. (Fixed by Tarek Ziadé; :issue:`8688`.)
ru: Команда Distutils ``sdist`` теперь всегда заново создает файл :file:`MANIFEST`, поскольку даже если файлы :file:`MANIFEST.in` или :file:`setup.py` не были изменены, пользователь возможно, были созданы новые файлы, которые следует включить. (Исправлено Тареком Зиаде; :issue:`8688`.)

source: The :class:`~fractions.Fraction` class now accepts a single float or :class:`~decimal.Decimal` instance, or two rational numbers, as arguments to its constructor. (Implemented by Mark Dickinson; rationals added in :issue:`5812`, and float/decimal in :issue:`8294`.)
ru: Класс :class:`~fractions.Fraction` теперь принимает один экземпляр :class:`~decimal.Decimal` или два рациональных числа в качестве аргументов своего конструктора. (Реализовано Марком Дикинсоном; рациональные числа добавлены в :issue:`5812`, а числа с плавающей запятой/десятичным числом в :issue:`8294`.)

source: Ordering comparisons (``<``, ``<=``, ``>``, ``>=``) between fractions and complex numbers now raise a :exc:`TypeError`. This fixes an oversight, making the :class:`~fractions.Fraction` match the other numeric types.
ru: Сравнения по порядку (``<``, ``<=``, ``>``, ``>=``) между дробями и комплексными числами теперь вызывают ошибку :exc:`TypeError`. Это исправляет оплошность, благодаря чему :class:`~fractions.Fraction` соответствует другим числовым типам.

source: New class: :class:`~ftplib.FTP_TLS` in the :mod:`ftplib` module provides secure FTP connections using TLS encapsulation of authentication as well as subsequent control and data transfers. (Contributed by Giampaolo Rodola; :issue:`2054`.)
ru: Новый класс: :class:`~ftplib.FTP_TLS` в модуле :mod:`ftplib` обеспечивает безопасные FTP-соединения с использованием TLS-инкапсуляции аутентификации, а также последующего управления и передачи данных. (Предоставлено Джампаоло Родолой; :issue:`2054`.)

source: The :meth:`~ftplib.FTP.storbinary` method for binary uploads can now restart uploads thanks to an added *rest* parameter (patch by Pablo Mouzo; :issue:`6845`.)
ru: Метод :meth:`~ftplib.FTP.storbinary` для двоичной загрузки теперь может перезапускать загрузку благодаря добавленному параметру *rest* (исправление Пабло Моузо; :issue:`6845`.)

source: New function: :func:`~functools.cmp_to_key` will take an old-style comparison function that expects two arguments and return a new callable that can be used as the *key* parameter to functions such as :func:`sorted`, :func:`min` and :func:`max`, etc. The primary intended use is to help with making code compatible with Python 3.x. (Added by Raymond Hettinger.)
ru: Новая функция: :func:`~functools.cmp_to_key` примет функцию сравнения старого стиля, которая ожидает два аргумента, и вернет новый вызываемый объект, который можно использовать в качестве параметра *key* для таких функций, как :func:`sorted`, :func:`min` и :func:`max` и т. д. Основное назначение — помочь сделать код совместимым с Python 3.x. (Добавлено Рэймондом Хеттингером.)

source: New function: the :mod:`gc` module's :func:`~gc.is_tracked` returns true if a given instance is tracked by the garbage collector, false otherwise. (Contributed by Antoine Pitrou; :issue:`4688`.)
ru: Новая функция: :func:`~gc.is_tracked` модуля :mod:`gc` возвращает true, если данный экземпляр отслеживается сборщиком мусора, и false в противном случае. (Предоставлено Антуаном Питру; :issue:`4688`.)

source: The :mod:`gzip` module's :class:`~gzip.GzipFile` now supports the context management protocol, so you can write ``with gzip.GzipFile(...) as f:`` (contributed by Hagen Fürstenau; :issue:`3860`), and it now implements the :class:`io.BufferedIOBase` ABC, so you can wrap it with :class:`io.BufferedReader` for faster processing (contributed by Nir Aides; :issue:`7471`). It's also now possible to override the modification time recorded in a gzipped file by providing an optional timestamp to the constructor. (Contributed by Jacques Frechet; :issue:`4272`.)
ru: Модуль :mod:`gzip` :class:`~gzip.GzipFile` теперь поддерживает протокол управления контекстом, поэтому вы можете писать ``с gzip.GzipFile(...) как f:`` (предоставлен Хагеном Фюрстенау; :issue:`3860`), и теперь он реализует :class:`io.BufferedIOBase` ABC, так что вы можете обернуть его :class:`io.BufferedReader` для более быстрой обработки (предоставлен Ниром Эйдесом; :issue:` 7471`). Также теперь можно переопределить время модификации, записанное в сжатом файле, предоставив конструктору дополнительную метку времени. (Предоставлено Жаком Фреше; :issue:`4272`.)

source: Files in gzip format can be padded with trailing zero bytes; the :mod:`gzip` module will now consume these trailing bytes. (Fixed by Tadek Pietraszek and Brian Curtin; :issue:`2846`.)
ru: Файлы в формате gzip могут быть дополнены конечными нулевыми байтами; модуль :mod:`gzip` теперь будет использовать эти конечные байты. (Исправлено Тадеком Петрашеком и Брайаном Кертином; :issue:`2846`.)

source: The :mod:`imaplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1655`.)
ru: Модуль :mod:`imaplib` теперь поддерживает адреса IPv6. (Предоставлено Дереком Морром; :issue:`1655`.)

source: New function: the :mod:`inspect` module's :func:`~inspect.getcallargs` takes a callable and its positional and keyword arguments, and figures out which of the callable's parameters will receive each argument, returning a dictionary mapping argument names to their values. For example::
ru: Новая функция: модуль :mod:`inspect` :func:`~inspect.getcallargs` принимает вызываемый объект, его позиционные и ключевые аргументы и определяет, какой из параметров вызываемого объекта получит каждый аргумент, возвращая имена аргументов сопоставления словаря. их ценности. Например::

source: Contributed by George Sakkis; :issue:`3135`.
ru: Предоставлено Джорджем Саккисом; :issue:`3135`.

source: The :class:`io.FileIO` class now raises an :exc:`OSError` when passed an invalid file descriptor. (Implemented by Benjamin Peterson; :issue:`4991`.) The :meth:`~io.IOBase.truncate` method now preserves the file position; previously it would change the file position to the end of the new file. (Fixed by Pascal Chambon; :issue:`6939`.)
ru: Класс :class:`io.FileIO` теперь вызывает ошибку :exc:`OSError` при передаче недопустимого дескриптора файла. (Реализовано Бенджамином Петерсоном; :issue:`4991`.) Метод :meth:`~io.IOBase.truncate` теперь сохраняет позицию файла; ранее он менял позицию файла на конец нового файла. (Исправлено Паскалем Шамбоном; :issue:`6939`.)

source: New function: ``itertools.compress(data, selectors)`` takes two iterators. Elements of *data* are returned if the corresponding value in *selectors* is true::
ru: Новая функция: ``itertools.compress(data, selectors)`` принимает два итератора. Элементы *data* возвращаются, если соответствующее значение в *selectors* истинно::

source: New function: ``itertools.combinations_with_replacement(iter, r)`` returns all the possible *r*-length combinations of elements from the iterable *iter*. Unlike :func:`~itertools.combinations`, individual elements can be repeated in the generated combinations::
ru: Новая функция: ``itertools.combinations_with_replacement(iter, r)`` возвращает все возможные комбинации элементов длины *r* из итерируемого *iter*. В отличие от :func:`~itertools.combinations`, отдельные элементы могут повторяться в сгенерированных комбинациях::

source: Note that elements are treated as unique depending on their position in the input, not their actual values.
ru: Обратите внимание, что элементы считаются уникальными в зависимости от их положения во входных данных, а не от их фактических значений.

source: The :func:`itertools.count` function now has a *step* argument that allows incrementing by values other than 1. :func:`~itertools.count` also now allows keyword arguments, and using non-integer values such as floats or :class:`~decimal.Decimal` instances. (Implemented by Raymond Hettinger; :issue:`5032`.)
ru: Функция :func:`itertools.count` теперь имеет аргумент *step*, который позволяет увеличивать значения, отличные от 1. :func:`~itertools.count` также теперь допускает аргументы с ключевыми словами и использование нецелочисленных значений, таких как числа с плавающей запятой. или экземпляры :class:`~decimal.Decimal`. (Реализовано Рэймондом Хеттингером; :issue:`5032`.)

source: :func:`itertools.combinations` and :func:`itertools.product` previously raised :exc:`ValueError` for values of *r* larger than the input iterable. This was deemed a specification error, so they now return an empty iterator. (Fixed by Raymond Hettinger; :issue:`4816`.)
ru: :func:`itertools.combinations` и :func:`itertools.product` ранее вызывали :exc:`ValueError` для значений *r*, больших, чем входная итерация. Это было сочтено ошибкой спецификации, поэтому теперь они возвращают пустой итератор. (Исправлено Рэймондом Хеттингером; :issue:`4816`.)

source: Updated module: The :mod:`json` module was upgraded to version 2.0.9 of the simplejson package, which includes a C extension that makes encoding and decoding faster. (Contributed by Bob Ippolito; :issue:`4136`.)
ru: Обновленный модуль: Модуль :mod:`json` был обновлен до версии 2.0.9 пакета simplejson, который включает расширение C, ускоряющее кодирование и декодирование. (Предоставлено Бобом Ипполито; :issue:`4136`.)
