Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/2.7.po
Languages: ru

source: What's New in Python 2.7
ru: Что нового в Python 2.7

source: Author
ru: Автор

source: A.M. Kuchling (amk at amk.ca)
ru: А. М. Кучлинг (amk на amk.ca)

source: This article explains the new features in Python 2.7. Python 2.7 was released on July 3, 2010.
ru: В этой статье объясняются новые возможности Python 2.7. Python 2.7 был выпущен 3 июля 2010 года.

source: Numeric handling has been improved in many ways, for both floating-point numbers and for the :class:`~decimal.Decimal` class. There are some useful additions to the standard library, such as a greatly enhanced :mod:`unittest` module, the :mod:`argparse` module for parsing command-line options, convenient :class:`~collections.OrderedDict` and :class:`~collections.Counter` classes in the :mod:`collections` module, and many other improvements.
ru: Обработка чисел была улучшена во многих отношениях, как для чисел с плавающей запятой, так и для класса :class:`~decimal.Decimal`. К стандартной библиотеке есть несколько полезных дополнений, таких как значительно улучшенный модуль :mod:`unittest`, модуль :mod:`argparse` для анализа параметров командной строки, удобные :class:`~collections.OrderedDict` и : class:`~collections.Counter` в модуле :mod:`collections` и многие другие улучшения.

source: Python 2.7 is planned to be the last of the 2.x releases, so we worked on making it a good release for the long term. To help with porting to Python 3, several new features from the Python 3.x series have been included in 2.7.
ru: Планируется, что Python 2.7 станет последним из выпусков 2.x, поэтому мы работали над тем, чтобы сделать его хорошим выпуском в долгосрочной перспективе. Чтобы облегчить портирование на Python 3, в версию 2.7 было включено несколько новых функций из серии Python 3.x.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.7 at https://docs.python.org. If you want to understand the rationale for the design and implementation, refer to the PEP for a particular new feature or the issue on https://bugs.python.org in which a change was discussed. Whenever possible, "What's New in Python" links to the bug/patch item for each change.
ru: В этой статье не делается попытка предоставить полную спецификацию новых функций, а вместо этого представлен удобный обзор. Для получения полной информации обратитесь к документации Python 2.7 по адресу https://docs.python.org. Если вы хотите понять обоснование проектирования и реализации, обратитесь к PEP для конкретной новой функции или проблемы на https://bugs.python.org, в которой обсуждалось изменение. По возможности, «Что нового в Python» содержит ссылку на ошибку/исправление для каждого изменения.

source: The Future for Python 2.x
ru: Будущее Python 2.x

source: Python 2.7 is the last major release in the 2.x series, as the Python maintainers have shifted the focus of their new feature development efforts to the Python 3.x series. This means that while Python 2 continues to receive bug fixes, and to be updated to build correctly on new hardware and versions of supported operated systems, there will be no new full feature releases for the language or standard library.
ru: Python 2.7 — последняя крупная версия серии 2.x, поскольку разработчики Python сместили фокус своих усилий по разработке новых функций на серию Python 3.x. Это означает, что, хотя Python 2 продолжает получать исправления ошибок и обновляться для правильной сборки на новом оборудовании и версиях поддерживаемых операционных систем, новых полнофункциональных выпусков для языка или стандартной библиотеки не будет.

source: However, while there is a large common subset between Python 2.7 and Python 3, and many of the changes involved in migrating to that common subset, or directly to Python 3, can be safely automated, some other changes (notably those associated with Unicode handling) may require careful consideration, and preferably robust automated regression test suites, to migrate effectively.
ru: Однако, хотя между Python 2.7 и Python 3 существует большое общее подмножество, и многие изменения, связанные с переходом к этому общему подмножеству или непосредственно к Python 3, могут быть безопасно автоматизированы, некоторые другие изменения (особенно те, которые связаны с обработкой Unicode) ) может потребовать тщательного рассмотрения и, желательно, надежных наборов автоматических регрессионных тестов для эффективной миграции.

source: This means that Python 2.7 will remain in place for a long time, providing a stable and supported base platform for production systems that have not yet been ported to Python 3. The full expected lifecycle of the Python 2.7 series is detailed in :pep:`373`.
ru: Это означает, что Python 2.7 останется на месте в течение длительного времени, обеспечивая стабильную и поддерживаемую базовую платформу для производственных систем, которые еще не были портированы на Python 3. Полный ожидаемый жизненный цикл серии Python 2.7 подробно описан в :pep:` 373`.

source: Some key consequences of the long-term significance of 2.7 are:
ru: Некоторые ключевые последствия долгосрочного значения 2.7:

source: As noted above, the 2.7 release has a much longer period of maintenance when compared to earlier 2.x versions. Python 2.7 is currently expected to remain supported by the core development team (receiving security updates and other bug fixes) until at least 2020 (10 years after its initial release, compared to the more typical support period of 18--24 months).
ru: Как отмечалось выше, период обслуживания версии 2.7 гораздо дольше по сравнению с более ранними версиями 2.x. В настоящее время ожидается, что Python 2.7 будет поддерживаться основной командой разработчиков (получая обновления безопасности и другие исправления ошибок) как минимум до 2020 года (через 10 лет после его первоначального выпуска по сравнению с более типичным периодом поддержки в 18–24 месяца).

source: As the Python 2.7 standard library ages, making effective use of the Python Package Index (either directly or via a redistributor) becomes more important for Python 2 users. In addition to a wide variety of third party packages for various tasks, the available packages include backports of new modules and features from the Python 3 standard library that are compatible with Python 2, as well as various tools and libraries that can make it easier to migrate to Python 3. The `Python Packaging User Guide <https://packaging.python.org>`__ provides guidance on downloading and installing software from the Python Package Index.
ru: По мере старения стандартной библиотеки Python 2.7 эффективное использование индекса пакетов Python (напрямую или через распространителя) становится все более важным для пользователей Python 2. В дополнение к широкому спектру сторонних пакетов для различных задач, доступные пакеты включают резервные копии новых модулей и функций из стандартной библиотеки Python 3, совместимых с Python 2, а также различные инструменты и библиотеки, которые могут упростить перейдите на Python 3. `Руководство пользователя упаковки Python <https://packaging.python.org>`__ содержит рекомендации по загрузке и установке программного обеспечения из указателя пакетов Python.

source: While the preferred approach to enhancing Python 2 is now the publication of new packages on the Python Package Index, this approach doesn't necessarily work in all cases, especially those related to network security. In exceptional cases that cannot be handled adequately by publishing new or updated packages on PyPI, the Python Enhancement Proposal process may be used to make the case for adding new features directly to the Python 2 standard library. Any such additions, and the maintenance releases where they were added, will be noted in the :ref:`py27-maintenance-enhancements` section below.
ru: Хотя сейчас предпочтительным подходом к улучшению Python 2 является публикация новых пакетов в Индексе пакетов Python, этот подход не обязательно работает во всех случаях, особенно в тех, которые связаны с сетевой безопасностью. В исключительных случаях, которые невозможно адекватно обработать путем публикации новых или обновленных пакетов в PyPI, можно использовать процесс предложения по расширению Python, чтобы обосновать добавление новых функций непосредственно в стандартную библиотеку Python 2. Любые такие дополнения, а также версии обслуживания, в которые они были добавлены, будут указаны в разделе :ref:`py27-maintenance-enhancements` ниже.

source: For projects wishing to migrate from Python 2 to Python 3, or for library and framework developers wishing to support users on both Python 2 and Python 3, there are a variety of tools and guides available to help decide on a suitable approach and manage some of the technical details involved. The recommended starting point is the :ref:`pyporting-howto` HOWTO guide.
ru: Для проектов, желающих перейти с Python 2 на Python 3, или для разработчиков библиотек и платформ, желающих поддерживать пользователей как на Python 2, так и на Python 3, существует множество инструментов и руководств, которые помогут выбрать подходящий подход и управлять некоторыми из них. технические детали. Рекомендуемой отправной точкой является руководство :ref:`pyporting-howto` HOWTO.

source: Changes to the Handling of Deprecation Warnings
ru: Изменения в обработке предупреждений об устаревании

source: For Python 2.7, a policy decision was made to silence warnings only of interest to developers by default. :exc:`DeprecationWarning` and its descendants are now ignored unless otherwise requested, preventing users from seeing warnings triggered by an application. This change was also made in the branch that became Python 3.2. (Discussed on stdlib-sig and carried out in :issue:`7319`.)
ru: В Python 2.7 было принято политическое решение по умолчанию отключить предупреждения, представляющие интерес только для разработчиков. :exc:`DeprecationWarning` и его потомки теперь игнорируются, если не запрошено иное, что не позволяет пользователям видеть предупреждения, вызванные приложением. Это изменение также было сделано в ветке, которая стала Python 3.2. (Обсуждается в stdlib-sig и выполняется в :issue:`7319`.)

source: In previous releases, :exc:`DeprecationWarning` messages were enabled by default, providing Python developers with a clear indication of where their code may break in a future major version of Python.
ru: В предыдущих выпусках сообщения :exc:`DeprecationWarning` были включены по умолчанию, предоставляя разработчикам Python четкое указание о том, где их код может сломаться в будущей основной версии Python.

source: However, there are increasingly many users of Python-based applications who are not directly involved in the development of those applications. :exc:`DeprecationWarning` messages are irrelevant to such users, making them worry about an application that's actually working correctly and burdening application developers with responding to these concerns.
ru: Однако становится все больше пользователей приложений на основе Python, которые не участвуют непосредственно в разработке этих приложений. Сообщения :exc:`DeprecationWarning` не имеют значения для таких пользователей, заставляя их беспокоиться о том, что приложение на самом деле работает правильно, и обременяя разработчиков приложений реагированием на эти проблемы.

source: You can re-enable display of :exc:`DeprecationWarning` messages by running Python with the :option:`-Wdefault <-W>` (short form: :option:`-Wd <-W>`) switch, or by setting the :envvar:`PYTHONWARNINGS` environment variable to ``"default"`` (or ``"d"``) before running Python. Python code can also re-enable them by calling ``warnings.simplefilter('default')``.
ru: Вы можете повторно включить отображение сообщений :exc:`DeprecationWarning`, запустив Python с переключателем :option:`-Wdefault <-W>` (краткая форма: :option:`-Wd <-W>`) или установка переменной среды :envvar:`PYTHONWARNINGS` в значение ``"default"`` (или ``"d"``) перед запуском Python. Код Python также может повторно включить их, вызвав alerts.simplefilter('default')``.

source: The ``unittest`` module also automatically reenables deprecation warnings when running tests.
ru: Модуль unittest также автоматически включает предупреждения об устаревании при запуске тестов.

source: Python 3.1 Features
ru: Особенности Python 3.1

source: Much as Python 2.6 incorporated features from Python 3.0, version 2.7 incorporates some of the new features in Python 3.1. The 2.x series continues to provide tools for migrating to the 3.x series.
ru: Подобно тому, как Python 2.6 включает в себя функции Python 3.0, версия 2.7 включает в себя некоторые новые функции Python 3.1. Серия 2.x продолжает предоставлять инструменты для перехода на серию 3.x.

source: A partial list of 3.1 features that were backported to 2.7:
ru: Неполный список функций версии 3.1, которые были перенесены в версию 2.7:

source: The syntax for set literals (``{1,2,3}`` is a mutable set).
ru: Синтаксис для литералов множества (``{1,2,3}`` — изменяемый набор).

source: Dictionary and set comprehensions (``{i: i*2 for i in range(3)}``).
ru: Словарь и понимание множеств (``{i: i*2 for i in range(3)}``).

source: Multiple context managers in a single :keyword:`with` statement.
ru: Несколько менеджеров контекста в одном операторе :keyword:`with`.

source: A new version of the :mod:`io` library, rewritten in C for performance.
ru: Новая версия библиотеки :mod:`io`, переписанная на C для повышения производительности.

source: The ordered-dictionary type described in :ref:`pep-0372`.
ru: Тип упорядоченного словаря, описанный в :ref:`pep-0372`.

source: The new ``","`` format specifier described in :ref:`pep-0378`.
ru: Новый спецификатор формата ``","`` описан в :ref:`pep-0378`.

source: The :class:`memoryview` object.
ru: Объект :class:`memoryview`.

source: A small subset of the :mod:`importlib` module, `described below <#importlib-section>`__.
ru: Небольшое подмножество модуля :mod:`importlib`, `описанное ниже <#importlib-section>`__.

source: The :func:`repr` of a float ``x`` is shorter in many cases: it's now based on the shortest decimal string that's guaranteed to round back to ``x``. As in previous versions of Python, it's guaranteed that ``float(repr(x))`` recovers ``x``.
ru: :func:`repr` числа с плавающей запятой ``x`` во многих случаях короче: теперь оно основано на самой короткой десятичной строке, которая гарантированно округляется до ``x``. Как и в предыдущих версиях Python, гарантированно, что float(repr(x)) восстанавливает x.

source: Float-to-string and string-to-float conversions are correctly rounded. The :func:`round` function is also now correctly rounded.
ru: Преобразования чисел с плавающей запятой в строку и строку в число с плавающей запятой округляются правильно. Функция :func:`round` теперь также правильно округляется.

source: The :c:type:`PyCapsule` type, used to provide a C API for extension modules.
ru: Тип :c:type:`PyCapsule`, используемый для предоставления C API для модулей расширения.

source: The :c:func:`PyLong_AsLongAndOverflow` C API function.
ru: Функция C API :c:func:`PyLong_AsLongAndOverflow`.

source: Other new Python3-mode warnings include:
ru: Другие новые предупреждения режима Python3 включают в себя:

source: The :option:`!-3` switch now automatically enables the :option:`!-Qwarn` switch that causes warnings about using classic division with integers and long integers.
ru: Переключатель :option:`!-3` теперь автоматически включает переключатель :option:`!-Qwarn`, который вызывает предупреждения об использовании классического деления целых и длинных целых чисел.

source: PEP 372: Adding an Ordered Dictionary to collections
ru: PEP 372: добавление упорядоченного словаря в коллекции

source: Regular Python dictionaries iterate over key/value pairs in arbitrary order. Over the years, a number of authors have written alternative implementations that remember the order that the keys were originally inserted. Based on the experiences from those implementations, 2.7 introduces a new :class:`~collections.OrderedDict` class in the :mod:`collections` module.
ru: Обычные словари Python перебирают пары ключ/значение в произвольном порядке. За прошедшие годы ряд авторов написали альтернативные реализации, запоминающие порядок первоначальной вставки ключей. Основываясь на опыте этих реализаций, в версии 2.7 представлен новый класс :class:`~collections.OrderedDict` в модуле :mod:`collections`.

source: The :class:`~collections.OrderedDict` API provides the same interface as regular dictionaries but iterates over keys and values in a guaranteed order depending on when a key was first inserted::
ru: API :class:`~collections.OrderedDict` предоставляет тот же интерфейс, что и обычные словари, но выполняет итерацию по ключам и значениям в гарантированном порядке в зависимости от того, когда ключ был впервые вставлен::

source: If a new entry overwrites an existing entry, the original insertion position is left unchanged::
ru: Если новая запись перезаписывает существующую, исходная позиция вставки остается неизменной::

source: Deleting an entry and reinserting it will move it to the end::
ru: Удаление записи и повторная вставка переместит ее в конец::

source: The :meth:`~collections.OrderedDict.popitem` method has an optional *last* argument that defaults to ``True``. If *last* is true, the most recently added key is returned and removed; if it's false, the oldest key is selected::
ru: Метод :meth:`~collections.OrderedDict.popitem` имеет необязательный аргумент *last*, который по умолчанию имеет значение ``True``. Если *last* имеет значение true, возвращается и удаляется последний добавленный ключ; если оно ложно, выбирается самый старый ключ::

source: Comparing two ordered dictionaries checks both the keys and values, and requires that the insertion order was the same::
ru: При сравнении двух упорядоченных словарей проверяются как ключи, так и значения, а также требуется, чтобы порядок вставки был одинаковым:

source: Comparing an :class:`~collections.OrderedDict` with a regular dictionary ignores the insertion order and just compares the keys and values.
ru: Сравнение :class:`~collections.OrderedDict` с обычным словарем игнорирует порядок вставки и просто сравнивает ключи и значения.

source: The standard library now supports use of ordered dictionaries in several modules.
ru: Стандартная библиотека теперь поддерживает использование упорядоченных словарей в нескольких модулях.

source: The :mod:`json` module's :class:`~json.JSONDecoder` class constructor was extended with an *object_pairs_hook* parameter to allow :class:`OrderedDict` instances to be built by the decoder. Support was also added for third-party tools like `PyYAML <https://pyyaml.org/>`_.
ru: Конструктор класса :class:`~json.JSONDecoder` модуля :mod:`json` был расширен с помощью параметра *object_pairs_hook*, позволяющего создавать экземпляры :class:`OrderedDict` декодером. Также была добавлена ​​поддержка сторонних инструментов, таких как `PyYAML <https://pyyaml.org/>`_.

source: :pep:`372` - Adding an ordered dictionary to collections
ru: :pep:`372` - Добавление упорядоченного словаря в коллекции

source: PEP written by Armin Ronacher and Raymond Hettinger; implemented by Raymond Hettinger.
ru: PEP, написанный Армином Ронахером и Раймондом Хеттингером; реализован Раймондом Хеттингером.

source: PEP 378: Format Specifier for Thousands Separator
ru: PEP 378: спецификатор формата для разделителя тысяч

source: To make program output more readable, it can be useful to add separators to large numbers, rendering them as 18,446,744,073,709,551,616 instead of 18446744073709551616.
ru: Чтобы сделать вывод программы более читаемым, может быть полезно добавлять разделители к большим числам, отображая их как 18 446 744 073 709 551 616 вместо 18446744073709551616.

source: The fully general solution for doing this is the :mod:`locale` module, which can use different separators ("," in North America, "." in Europe) and different grouping sizes, but :mod:`locale` is complicated to use and unsuitable for multi-threaded applications where different threads are producing output for different locales.
ru: Полностью общим решением для этого является модуль :mod:`locale`, который может использовать разные разделители ("," в Северной Америке, "." в Европе) и разные размеры группировки, но :mod:`locale` усложняется. использовать и непригоден для многопоточных приложений, где разные потоки создают выходные данные для разных локалей.

source: Therefore, a simple comma-grouping mechanism has been added to the mini-language used by the :meth:`str.format` method. When formatting a floating-point number, simply include a comma between the width and the precision::
ru: Поэтому в мини-язык, используемый методом :meth:`str.format`, был добавлен простой механизм группировки запятых. При форматировании числа с плавающей запятой просто поставьте запятую между шириной и точностью:

source: When formatting an integer, include the comma after the width:
ru: При форматировании целого числа поставьте запятую после ширины:

source: This mechanism is not adaptable at all; commas are always used as the separator and the grouping is always into three-digit groups. The comma-formatting mechanism isn't as general as the :mod:`locale` module, but it's easier to use.
ru: Этот механизм вообще не поддается адаптации; в качестве разделителя всегда используются запятые, а группировка всегда осуществляется по группам из трех цифр. Механизм форматирования запятых не такой общий, как модуль :mod:`locale`, но его проще использовать.

source: :pep:`378` - Format Specifier for Thousands Separator
ru: :pep:`378` - Описатель формата для разделителя тысяч

source: PEP written by Raymond Hettinger; implemented by Eric Smith.
ru: PEP, написанный Раймондом Хеттингером; реализован Эриком Смитом.

source: PEP 389: The argparse Module for Parsing Command Lines
ru: PEP 389: модуль argparse для анализа командных строк

source: The :mod:`argparse` module for parsing command-line arguments was added as a more powerful replacement for the :mod:`optparse` module.
ru: Модуль :mod:`argparse` для анализа аргументов командной строки был добавлен как более мощная замена модуля :mod:`optparse`.

source: In short, if you're writing a new script and don't need to worry about compatibility with earlier versions of Python, use :mod:`argparse` instead of :mod:`optparse`.
ru: Короче говоря, если вы пишете новый скрипт и вам не нужно беспокоиться о совместимости с более ранними версиями Python, используйте :mod:`argparse` вместо :mod:`optparse`.

source: Here's an example::
ru: Вот пример::

source: Unless you override it, :option:`!-h` and :option:`!--help` switches are automatically added, and produce neatly formatted output::
ru: Если вы не переопределите его, переключатели :option:`!-h` и :option:`!--help` добавляются автоматически и выдают аккуратно отформатированный вывод::

source: As with :mod:`optparse`, the command-line switches and arguments are returned as an object with attributes named by the *dest* parameters::
ru: Как и в случае с :mod:`optparse`, ключи и аргументы командной строки возвращаются как объект с атрибутами, указанными в параметрах *dest*::
