Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.10.po
Languages: ru

source: Add a new :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` type flag for creating immutable type objects: type attributes cannot be set nor deleted. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
ru: Добавьте новый флаг типа :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` для создания объектов неизменяемого типа: атрибуты типа не могут быть установлены или удалены. (Предоставлено Виктором Стиннером и Эрлендом Э. Осландом в :issue:`43908`.)

source: The ``PY_SSIZE_T_CLEAN`` macro must now be defined to use :c:func:`PyArg_ParseTuple` and :c:func:`Py_BuildValue` formats which use ``#``: ``es#``, ``et#``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` and ``Z#``. See :ref:`arg-parsing` and :pep:`353`. (Contributed by Victor Stinner in :issue:`40943`.)
ru: Макрос ``PY_SSIZE_T_CLEAN`` теперь должен быть определен для использования форматов :c:func:`PyArg_ParseTuple` и :c:func:`Py_BuildValue`, которые используют ``#``: ``es#``, ``et# ``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` и ``Z#``. См. :ref:`arg-parsing` и :pep:`353`. (Предоставлено Виктором Стиннером в :issue:`40943`.)

source: Since :c:func:`Py_REFCNT()` is changed to the inline static function, ``Py_REFCNT(obj) = new_refcnt`` must be replaced with ``Py_SET_REFCNT(obj, new_refcnt)``: see :c:func:`Py_SET_REFCNT()` (available since Python 3.9). For backward compatibility, this macro can be used::
ru: Поскольку :c:func:`Py_REFCNT()` заменяется на встроенную статическую функцию, ``Py_REFCNT(obj) = new_refcnt`` необходимо заменить на ``Py_SET_REFCNT(obj, new_refcnt)``: см. :c:func: `Py_SET_REFCNT()` (доступно начиная с Python 3.9). Для обратной совместимости можно использовать этот макрос::

source: (Contributed by Victor Stinner in :issue:`39573`.)
ru: (Предоставлено Виктором Стиннером в :issue:`39573`.)

source: Calling :c:func:`PyDict_GetItem` without :term:`GIL` held had been allowed for historical reason. It is no longer allowed. (Contributed by Victor Stinner in :issue:`40839`.)
ru: Вызов :c:func:`PyDict_GetItem` без удержания :term:`GIL` был разрешен по историческим причинам. Это больше не разрешено. (Предоставлено Виктором Стиннером в :issue:`40839`.)

source: ``PyUnicode_FromUnicode(NULL, size)`` and ``PyUnicode_FromStringAndSize(NULL, size)`` raise ``DeprecationWarning`` now. Use :c:func:`PyUnicode_New` to allocate Unicode object without initial data. (Contributed by Inada Naoki in :issue:`36346`.)
ru: ``PyUnicode_FromUnicode(NULL, size)`` и ``PyUnicode_FromStringAndSize(NULL, size)`` теперь вызывают ``DeprecationWarning``. Используйте :c:func:`PyUnicode_New` для выделения объекта Unicode без исходных данных. (Предоставлено Инадой Наоки в :issue:`36346`.)

source: The private ``_PyUnicode_Name_CAPI`` structure of the PyCapsule API ``unicodedata.ucnhash_CAPI`` has been moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
ru: Частная структура ``_PyUnicode_Name_CAPI`` API PyCapsule ``unicodedata.ucnhash_CAPI`` была перенесена во внутренний C API. (Предоставлено Виктором Стиннером в :issue:`42157`.)

source: :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` and :c:func:`Py_GetProgramName` functions now return ``NULL`` if called before :c:func:`Py_Initialize` (before Python is initialized). Use the new :ref:`init-config` API to get the :ref:`init-path-config`. (Contributed by Victor Stinner in :issue:`42260`.)
ru: :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` и :c:func: Функции ``Py_GetProgramName`` теперь возвращают ``NULL``, если они были вызваны до :c:func:`Py_Initialize` (до инициализации Python). Используйте новый API :ref:`init-config`, чтобы получить :ref:`init-path-config`. (Предоставлено Виктором Стиннером в :issue:`42260`.)

source: :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` and :c:func:`PyCell_SET` macros can no longer be used as l-value or r-value. For example, ``x = PyList_SET_ITEM(a, b, c)`` and ``PyList_SET_ITEM(a, b, c) = x`` now fail with a compiler error. It prevents bugs like ``if (PyList_SET_ITEM (a, b, c) < 0) ...`` test. (Contributed by Zackery Spytz and Victor Stinner in :issue:`30459`.)
ru: Макросы :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` и :c:func:`PyCell_SET` больше нельзя использовать в качестве l-значения или r-значения. Например, ``x = PyList_SET_ITEM(a, b, c)`` и ``PyList_SET_ITEM(a, b, c) = x`` теперь завершаются ошибкой компилятора. Это предотвращает такие ошибки, как ``if (PyList_SET_ITEM (a, b, c) < 0) ...`` test. (Предоставлено Закери Шпитцем и Виктором Стиннером в :issue:`30459`.)

source: The non-limited API files ``odictobject.h``, ``parser_interface.h``, ``picklebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug.h``, ``pyfpe.h``, and ``pytime.h`` have been moved to the ``Include/cpython`` directory. These files must not be included directly, as they are already included in ``Python.h``; see :ref:`api-includes`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Nicholas Sim in :issue:`35134`.)
ru: Неограниченные файлы API ``odictobject.h``, ``parser_interface.h``, ``picklebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug. h``, ``pyfpe.h`` и ``pytime.h`` были перемещены в каталог ``Include/cpython``. Эти файлы не следует включать напрямую, поскольку они уже включены в ``Python.h``; см. :ref:`api-includes`. Если они были включены напрямую, рассмотрите возможность включения вместо них Python.h. (Предоставлено Николасом Симом в :issue:`35134`.)

source: Use the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` type flag to create immutable type objects. Do not rely on :c:macro:`Py_TPFLAGS_HEAPTYPE` to decide if a type object is mutable or not; check if :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` is set instead. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
ru: Используйте флаг типа :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` для создания объектов неизменяемого типа. Не полагайтесь на :c:macro:`Py_TPFLAGS_HEAPTYPE`, чтобы решить, является ли объект типа изменяемым или нет; проверьте, установлен ли вместо этого :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`. (Предоставлено Виктором Стиннером и Эрлендом Э. Осландом в :issue:`43908`.)

source: The undocumented function ``Py_FrozenMain`` has been removed from the limited API. The function is mainly useful for custom builds of Python. (Contributed by Petr Viktorin in :issue:`26241`.)
ru: Недокументированная функция Py_FrozenMain была удалена из ограниченного API. Эта функция в основном полезна для пользовательских сборок Python. (Предоставлено Петром Викториным в :issue:`26241`.)

source: The ``PyUnicode_InternImmortal()`` function is now deprecated and will be removed in Python 3.12: use :c:func:`PyUnicode_InternInPlace` instead. (Contributed by Victor Stinner in :issue:`41692`.)
ru: Функция ``PyUnicode_InternImmortal()`` устарела и будет удалена в Python 3.12: вместо нее используйте :c:func:`PyUnicode_InternInPlace`. (Предоставлено Виктором Стиннером в :issue:`41692`.)

source: Removed ``Py_UNICODE_str*`` functions manipulating ``Py_UNICODE*`` strings. (Contributed by Inada Naoki in :issue:`41123`.)
ru: Удалены функции Py_UNICODE_str*, управляющие строками Py_UNICODE*. (Предоставлено Инадой Наоки в :issue:`41123`.)

source: ``Py_UNICODE_strlen``: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
ru: ``Py_UNICODE_strlen``: используйте :c:func:`PyUnicode_GetLength` или :c:macro:`PyUnicode_GET_LENGTH`

source: ``Py_UNICODE_strcat``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
ru: ``Py_UNICODE_strcat``: используйте :c:func:`PyUnicode_CopyCharacters` или :c:func:`PyUnicode_FromFormat`

source: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
ru: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: используйте :c:func:`PyUnicode_CopyCharacters` или :c:func:`PyUnicode_Substring`

source: ``Py_UNICODE_strcmp``: use :c:func:`PyUnicode_Compare`
ru: ``Py_UNICODE_strcmp``: используйте :c:func:`PyUnicode_Compare`

source: ``Py_UNICODE_strncmp``: use :c:func:`PyUnicode_Tailmatch`
ru: ``Py_UNICODE_strncmp``: используйте :c:func:`PyUnicode_Tailmatch`

source: ``Py_UNICODE_strchr``, ``Py_UNICODE_strrchr``: use :c:func:`PyUnicode_FindChar`
ru: ``Py_UNICODE_strchr``, ``Py_UNICODE_strrchr``: используйте :c:func:`PyUnicode_FindChar`

source: Removed ``PyUnicode_GetMax()``. Please migrate to new (:pep:`393`) APIs. (Contributed by Inada Naoki in :issue:`41103`.)
ru: Удален ``PyUnicode_GetMax()``. Пожалуйста, перейдите на новые (:pep:`393`) API. (Предоставлено Инадой Наоки в :issue:`41103`.)

source: Removed ``PyLong_FromUnicode()``. Please migrate to :c:func:`PyLong_FromUnicodeObject`. (Contributed by Inada Naoki in :issue:`41103`.)
ru: Удален ``PyLong_FromUnicode()``. Пожалуйста, перейдите на :c:func:`PyLong_FromUnicodeObject`. (Предоставлено Инадой Наоки в :issue:`41103`.)

source: Removed ``PyUnicode_AsUnicodeCopy()``. Please use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString` (Contributed by Inada Naoki in :issue:`41103`.)
ru: Удален ``PyUnicode_AsUnicodeCopy()``. Используйте :c:func:`PyUnicode_AsUCS4Copy` или :c:func:`PyUnicode_AsWideCharString` (предоставлено Инадой Наоки в :issue:`41103`.)

source: Removed ``_Py_CheckRecursionLimit`` variable: it has been replaced by ``ceval.recursion_limit`` of the :c:type:`PyInterpreterState` structure. (Contributed by Victor Stinner in :issue:`41834`.)
ru: Удалена переменная ``_Py_CheckRecursionLimit``: она заменена на ``ceval.recursion_limit`` структуры :c:type:`PyInterpreterState`. (Предоставлено Виктором Стиннером в :issue:`41834`.)

source: Removed undocumented macros ``Py_ALLOW_RECURSION`` and ``Py_END_ALLOW_RECURSION`` and the ``recursion_critical`` field of the :c:type:`PyInterpreterState` structure. (Contributed by Serhiy Storchaka in :issue:`41936`.)
ru: Удалены недокументированные макросы ``Py_ALLOW_RECURSION`` и ``Py_END_ALLOW_RECURSION``, а также поле ``recursion_critical`` из структуры :c:type:`PyInterpreterState`. (Предоставлено Сергеем Сторчакой в ​​:issue:`41936`.)

source: Removed the undocumented ``PyOS_InitInterrupts()`` function. Initializing Python already implicitly installs signal handlers: see :c:member:`PyConfig.install_signal_handlers`. (Contributed by Victor Stinner in :issue:`41713`.)
ru: Удалена недокументированная функция PyOS_InitInterrupts(). Инициализация Python уже неявно устанавливает обработчики сигналов: см. :c:member:`PyConfig.install_signal_handlers`. (Предоставлено Виктором Стиннером в :issue:`41713`.)

source: Remove the ``PyAST_Validate()`` function. It is no longer possible to build a AST object (``mod_ty`` type) with the public C API. The function was already excluded from the limited C API (:pep:`384`). (Contributed by Victor Stinner in :issue:`43244`.)
ru: Удалите функцию PyAST_Validate(). Больше невозможно создать объект AST (тип mod_ty) с помощью общедоступного API C. Эта функция уже была исключена из ограниченного C API (:pep:`384`). (Предоставлено Виктором Стиннером в :issue:`43244`.)

source: Remove the ``symtable.h`` header file and the undocumented functions:
ru: Удалите заголовочный файл ``symtable.h`` и недокументированные функции:

source: The ``Py_SymtableString()`` function was part the stable ABI by mistake but it could not be used, because the ``symtable.h`` header file was excluded from the limited C API.
ru: Функция Py_SymtableString() по ошибке была частью стабильного ABI, но ее нельзя было использовать, поскольку заголовочный файл symtable.h был исключен из ограниченного C API.

source: Use Python :mod:`symtable` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
ru: Вместо этого используйте модуль Python :mod:`symtable`. (Предоставлено Виктором Стиннером в :issue:`43244`.)

source: Remove :c:func:`PyOS_ReadlineFunctionPointer` from the limited C API headers and from ``python3.dll``, the library that provides the stable ABI on Windows. Since the function takes a ``FILE*`` argument, its ABI stability cannot be guaranteed. (Contributed by Petr Viktorin in :issue:`43868`.)
ru: Удалите :c:func:`PyOS_ReadlineFunctionPointer` из ограниченных заголовков C API и из ``python3.dll``, библиотеки, которая обеспечивает стабильный ABI в Windows. Поскольку функция принимает аргумент ``FILE*``, ее стабильность ABI не может быть гарантирована. (Предоставлено Петром Викториным в :issue:`43868`.)

source: Remove ``ast.h``, ``asdl.h``, and ``Python-ast.h`` header files. These functions were undocumented and excluded from the limited C API. Most names defined by these header files were not prefixed by ``Py`` and so could create names conflicts. For example, ``Python-ast.h`` defined a ``Yield`` macro which was conflict with the ``Yield`` name used by the Windows ``<winbase.h>`` header. Use the Python :mod:`ast` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
ru: Удалите заголовочные файлы ``asd.h``, ``asdl.h`` и ``Python-ast.h``. Эти функции были недокументированы и исключены из ограниченного API C. Большинство имен, определенных в этих файлах заголовков, не имели префикса ``Py`` и поэтому могли создавать конфликты имен. Например, Python-ast.h определил макрос Yield, который конфликтовал с именем Yield, используемым в заголовке Windows <winbase.h>. Вместо этого используйте модуль Python :mod:`ast`. (Предоставлено Виктором Стиннером в :issue:`43244`.)

source: Remove the compiler and parser functions using ``struct _mod`` type, because the public AST C API was removed:
ru: Удалите функции компилятора и парсера, используя тип struct _mod, поскольку общедоступный API AST C был удален:

source: These functions were undocumented and excluded from the limited C API. (Contributed by Victor Stinner in :issue:`43244`.)
ru: Эти функции были недокументированы и исключены из ограниченного API C. (Предоставлено Виктором Стиннером в :issue:`43244`.)

source: Remove the ``pyarena.h`` header file with functions:
ru: Удалите заголовочный файл ``pyarena.h`` с помощью функций:

source: These functions were undocumented, excluded from the limited C API, and were only used internally by the compiler. (Contributed by Victor Stinner in :issue:`43244`.)
ru: Эти функции были недокументированы, исключены из ограниченного API C и использовались компилятором только внутри. (Предоставлено Виктором Стиннером в :issue:`43244`.)

source: The ``PyThreadState.use_tracing`` member has been removed to optimize Python. (Contributed by Mark Shannon in :issue:`43760`.)
ru: Член PyThreadState.use_tracing был удален для оптимизации Python. (Предоставлено Марком Шенноном в :issue:`43760`.)

source: Notable security feature in 3.10.7
ru: Заметная функция безопасности в версии 3.10.7.

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
ru: Преобразование между :class:`int` и :class:`str` в системах счисления, отличных от 2 (двоичная), 4, 8 (восьмеричная), 16 (шестнадцатеричная) или 32, например, 10 (десятичная), теперь вызывает :exc :`ValueError`, если количество цифр в строковой форме превышает ограничение, чтобы избежать потенциальных атак типа «отказ в обслуживании» из-за сложности алгоритма. Это смягчение последствий :cve:`2020-10735`. Это ограничение можно настроить или отключить с помощью переменной среды, флага командной строки или API :mod:`sys`. См. документацию по ограничению длины преобразования целочисленной строки <int_max_str_digits>`. Ограничение по умолчанию — 4300 цифр в строковой форме.

source: Notable security feature in 3.10.8
ru: Заметная функция безопасности в версии 3.10.8.

source: The deprecated :mod:`!mailcap` module now refuses to inject unsafe text (filenames, MIME types, parameters) into shell commands. Instead of using such text, it will warn and act as if a match was not found (or for test commands, as if the test failed). (Contributed by Petr Viktorin in :gh:`98966`.)
ru: Устаревший модуль :mod:`!mailcap` теперь отказывается вставлять небезопасный текст (имена файлов, типы MIME, параметры) в команды оболочки. Вместо использования такого текста он будет предупреждать и действовать так, как будто совпадение не найдено (или для тестовых команд, как если бы тест не прошёл). (Предоставлено Петром Викториным в :gh:`98966`.)

source: Notable changes in 3.10.12
ru: Заметные изменения в 3.10.12

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
ru: Методы извлечения в :mod:`tarfile` и :func:`shutil.unpack_archive` имеют новый аргумент *filter*, который позволяет ограничить возможности tar, которые могут быть неожиданными или опасными, например создание файлов вне каталога назначения. Подробности смотрите в :ref:`tarfile-extraction-filter`. В Python 3.12 использование без аргумента *filter* приведет к появлению :exc:`DeprecationWarning`. В Python 3.14 значение по умолчанию переключится на ``'data'``. (Предоставлено Петром Викториным в :pep:`706`.)
