Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.10.po
Languages: ru

source: Deprecation warning is now emitted when compiling previously valid syntax if the numeric literal is immediately followed by a keyword (like in ``0in x``). In future releases it will be changed to syntax warning, and finally to a syntax error. To get rid of the warning and make the code compatible with future releases just add a space between the numeric literal and the following keyword. (Contributed by Serhiy Storchaka in :issue:`43833`.)
ru: Предупреждение об устаревании теперь выдается при компиляции ранее допустимого синтаксиса, если за числовым литералом сразу следует ключевое слово (например, в ``0in x``). В будущих выпусках оно будет изменено на синтаксическое предупреждение и, наконец, на синтаксическую ошибку. Чтобы избавиться от предупреждения и сделать код совместимым с будущими выпусками, просто добавьте пробел между числовым литералом и следующим ключевым словом. (Предоставлено Сергеем Сторчакой в ​​:issue:`43833`.)

source: Changes in the Python API
ru: Изменения в API Python

source: The *etype* parameters of the :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions in the :mod:`traceback` module have been renamed to *exc*. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
ru: Параметры *etype* функций :func:`~traceback.format_Exception`, :func:`~traceback.format_Exception_only` и :func:`~traceback.print_Exception` в модуле :mod:`traceback` были переименованы. до *отлично*. (Предоставлено Закери Шпитцем и Маттиасом Бюссонье в :issue:`26389`.)

source: :mod:`atexit`: At Python exit, if a callback registered with :func:`atexit.register` fails, its exception is now logged. Previously, only some exceptions were logged, and the last exception was always silently ignored. (Contributed by Victor Stinner in :issue:`42639`.)
ru: :mod:`atexit`: При выходе Python, если обратный вызов, зарегистрированный с помощью :func:`atexit.register`, завершается неудачно, его исключение теперь регистрируется. Раньше регистрировались только некоторые исключения, а последнее исключение всегда молча игнорировалось. (Предоставлено Виктором Стиннером в :issue:`42639`.)

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. Furthermore, :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
ru: :class:`collections.abc.Callable` универсальный теперь выравнивает параметры типа, аналогично тому, что сейчас делает :data:`typing.Callable`. Это означает, что ``collections.abc.Callable[[int, str], str]`` будет иметь ``__args__`` из ``(int, str, str)``; раньше это было ``([int, str], str)``. Код, который обращается к аргументам через :func:`typing.get_args` или ``__args__``, должен учитывать это изменение. Более того, :exc:`TypeError` может быть вызвано для недопустимых форм параметризации :class:`collections.abc.Callable`, которые в Python 3.9 могли передаваться автоматически. (Предоставлено Кеном Джином в :issue:`42195`.)

source: :meth:`socket.htons` and :meth:`socket.ntohs` now raise :exc:`OverflowError` instead of :exc:`DeprecationWarning` if the given parameter will not fit in a 16-bit unsigned integer. (Contributed by Erlend E. Aasland in :issue:`42393`.)
ru: :meth:`socket.htons` и :meth:`socket.ntohs` теперь вызывают :exc:`OverflowError` вместо :exc:`DeprecationWarning`, если данный параметр не помещается в 16-битное целое число без знака. (Предоставлено Эрлендом Э. Осландом в :issue:`42393`.)

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8.
ru: Параметр ``loop`` был удален из большей части :doc:`высокоуровневого API <../library/asyncio-api-index>` :mod:`asyncio`\ после его устаревания в Python 3.8.

source: A coroutine that currently looks like this::
ru: Сопрограмма, которая на данный момент выглядит так::

source: Should be replaced with this::
ru: Следует заменить на это:

source: If ``foo()`` was specifically designed *not* to run in the current thread's running event loop (e.g. running in another thread's event loop), consider using :func:`asyncio.run_coroutine_threadsafe` instead.
ru: Если ``foo()`` был специально разработан *не* для запуска в цикле событий текущего потока (например, в цикле событий другого потока), рассмотрите возможность использования вместо этого :func:`asyncio.run_coroutine_threadsafe`.

source: The :data:`types.FunctionType` constructor now inherits the current builtins if the *globals* dictionary has no ``"__builtins__"`` key, rather than using ``{"None": None}`` as builtins: same behavior as :func:`eval` and :func:`exec` functions. Defining a function with ``def function(...): ...`` in Python is not affected, globals cannot be overridden with this syntax: it also inherits the current builtins. (Contributed by Victor Stinner in :issue:`42990`.)
ru: Конструктор :data:`types.FunctionType` теперь наследует текущие встроенные функции, если в словаре *globals* нет ключа ``"__builtins__"``, вместо использования ``{"None": None}`` в качестве встроенных команд: то же самое. поведение как функции :func:`eval` и :func:`exec`. Определение функции с помощью ``def function(...): ...`` в Python не затрагивается, глобальные переменные не могут быть переопределены с помощью этого синтаксиса: он также наследует текущие встроенные функции. (Предоставлено Виктором Стиннером в :issue:`42990`.)

source: Changes in the C API
ru: Изменения в C API

source: The C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags``, ``PyNode_Compile`` and the type used by these functions, ``struct _node``, were removed due to the switch to the new PEG parser.
ru: Функции C API PyParser_SimpleParseStringFlags, PyParser_SimpleParseStringFlagsFilename, PyParser_SimpleParseFileFlags, PyNode_Compile и тип, используемый этими функциями, struct _node, были удалены из-за перехода на новый парсер PEG.

source: Source should be now be compiled directly to a code object using, for example, :c:func:`Py_CompileString`. The resulting code object can then be evaluated using, for example, :c:func:`PyEval_EvalCode`.
ru: Исходный код теперь должен быть скомпилирован непосредственно в объект кода, например, с помощью :c:func:`Py_CompileString`. Полученный объект кода затем можно оценить, используя, например, :c:func:`PyEval_EvalCode`.

source: Specifically:
ru: Конкретно:

source: A call to ``PyParser_SimpleParseStringFlags`` followed by ``PyNode_Compile`` can be replaced by calling :c:func:`Py_CompileString`.
ru: Вызов PyParser_SimpleParseStringFlags, за которым следует PyNode_Compile, можно заменить вызовом :c:func:`Py_CompileString`.

source: There is no direct replacement for ``PyParser_SimpleParseFileFlags``. To compile code from a ``FILE *`` argument, you will need to read the file in C and pass the resulting buffer to :c:func:`Py_CompileString`.
ru: Не существует прямой замены PyParser_SimpleParseFileFlags. Чтобы скомпилировать код из аргумента ``FILE *``, вам нужно будет прочитать файл на языке C и передать полученный буфер в :c:func:`Py_CompileString`.

source: To compile a file given a ``char *`` filename, explicitly open the file, read it and compile the result. One way to do this is using the :py:mod:`io` module with :c:func:`PyImport_ImportModule`, :c:func:`PyObject_CallMethod`, :c:func:`PyBytes_AsString` and :c:func:`Py_CompileString`, as sketched below. (Declarations and error handling are omitted.) ::
ru: Чтобы скомпилировать файл с именем ``char *``, явно откройте файл, прочитайте его и скомпилируйте результат. Один из способов сделать это — использовать модуль :py:mod:`io` с :c:func:`PyImport_ImportModule`, :c:func:` PyObj ect_CallMethod`, :c:func:`PyBytes_AsString` и :c:func. :`Py_CompileString`, как показано ниже. (Объявления и обработка ошибок опущены.) ::

source: io_module = Import_ImportModule("io"); fileobject = PyObject_CallMethod(io_module, "open", "ss", filename, "rb"); source_bytes_object = PyObject_CallMethod(fileobject, "read", ""); result = PyObject_CallMethod(fileobject, "close", ""); source_buf = PyBytes_AsString(source_bytes_object); code = Py_CompileString(source_buf, filename, Py_file_input);
ru: io_module = Import_ImportModule("io"); fileobject = PyObj ect_CallMethod(io_module, «open», «ss», имя файла, «rb»); source_bytes_object = PyObj ect_CallMethod(fileobject, "read", ""); результат = PyObj ect_CallMethod(fileobject, «закрыть», «»); source_buf = PyBytes_AsString (source_bytes_object); код = Py_CompileString(source_buf, имя_файла, Py_file_input);

source: For ``FrameObject`` objects, the :attr:`~frame.f_lasti` member now represents a wordcode offset instead of a simple offset into the bytecode string. This means that this number needs to be multiplied by 2 to be used with APIs that expect a byte offset instead (like :c:func:`PyCode_Addr2Line` for example). Notice as well that the :attr:`!f_lasti` member of ``FrameObject`` objects is not considered stable: please use :c:func:`PyFrame_GetLineNumber` instead.
ru: Для объектов FrameObject член :attr:~frame.f_lasti теперь представляет смещение словесного кода вместо простого смещения в строке байт-кода. Это означает, что это число необходимо умножить на 2, чтобы использовать его с API, которые вместо этого ожидают смещения в байтах (например, :c:func:`PyCode_Addr2Line`). Также обратите внимание, что член :attr:`!f_lasti` объектов ``FrameObject`` не считается стабильным: вместо него используйте :c:func:`PyFrame_GetLineNumber`.

source: CPython bytecode changes
ru: Изменения в байт-коде CPython

source: The ``MAKE_FUNCTION`` instruction now accepts either a dict or a tuple of strings as the function's annotations. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`.)
ru: Инструкция ``MAKE_FUNCTION`` теперь принимает в качестве аннотации функции либо словарь, либо кортеж строк. (Предоставлено Юрием Карабасом и Инадой Наоки в :issue:`42202`.)

source: Build Changes
ru: Изменения сборки

source: :pep:`644`: Python now requires OpenSSL 1.1.1 or newer. OpenSSL 1.0.2 is no longer supported. (Contributed by Christian Heimes in :issue:`43669`.)
ru: :pep:`644`: Python теперь требует OpenSSL 1.1.1 или новее. OpenSSL 1.0.2 больше не поддерживается. (Предоставлено Кристианом Хаймсом в :issue:`43669`.)

source: The C99 functions :c:func:`snprintf` and :c:func:`vsnprintf` are now required to build Python. (Contributed by Victor Stinner in :issue:`36020`.)
ru: Функции C99 :c:func:`snprintf` и :c:func:`vsnprintf` теперь необходимы для сборки Python. (Предоставлено Виктором Стиннером в :issue:`36020`.)

source: :mod:`sqlite3` requires SQLite 3.7.15 or higher. (Contributed by Sergey Fedoseev and Erlend E. Aasland in :issue:`40744` and :issue:`40810`.)
ru: :mod:`sqlite3` требует SQLite 3.7.15 или выше. (Предоставлено Сергеем Федосеевым и Эрлендом Э. Осландом в :issue:`40744` и :issue:`40810`.)

source: The :mod:`atexit` module must now always be built as a built-in module. (Contributed by Victor Stinner in :issue:`42639`.)
ru: Модуль :mod:`atexit` теперь всегда должен создаваться как встроенный модуль. (Предоставлено Виктором Стиннером в :issue:`42639`.)

source: Add :option:`--disable-test-modules` option to the ``configure`` script: don't build nor install test modules. (Contributed by Xavier de Gaye, Thomas Petazzoni and Peixing Xin in :issue:`27640`.)
ru: Добавьте опцию :option:`--disable-test-modules` в скрипт ``configure``: не создавать и не устанавливать тестовые модули. (Предоставлено Ксавье де Гаем, Томасом Петаццони и Пейсин Синь в :issue:`27640`.)

source: Add :option:`--with-wheel-pkg-dir=PATH option <--with-wheel-pkg-dir>` to the ``./configure`` script. If specified, the :mod:`ensurepip` module looks for ``setuptools`` and ``pip`` wheel packages in this directory: if both are present, these wheel packages are used instead of ensurepip bundled wheel packages.
ru: Добавьте параметр :option:`--with-wheel-pkg-dir=PATH <--with-wheel-pkg-dir>` в скрипт ``./configure``. Если указано, модуль :mod:`ensurepip` ищет пакеты колес ``setuptools`` и ``pip`` в этом каталоге: если оба присутствуют, эти пакеты колес используются вместо пакетов колес, входящих в комплект обеспечения.

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the ``ensurepip._bundled`` package.
ru: Некоторые политики упаковки дистрибутива Linux не рекомендуют объединять зависимости. Например, Fedora устанавливает пакеты Wheel в каталог ``/usr/share/python-wheels/`` и не устанавливает пакет ``ensurepip._bundled``.

source: (Contributed by Victor Stinner in :issue:`42856`.)
ru: (Предоставлено Виктором Стиннером в :issue:`42856`.)

source: Add a new :option:`configure --without-static-libpython option <--without-static-libpython>` to not build the ``libpythonMAJOR.MINOR.a`` static library and not install the ``python.o`` object file.
ru: Добавьте новую опцию :option:`configure --without-static-libpython <--without-static-libpython>`, чтобы не собирать статическую библиотеку ``libpythonMAJOR.MINOR.a`` и не устанавливать ``python.o `` объектный файл.

source: (Contributed by Victor Stinner in :issue:`43103`.)
ru: (Предоставлено Виктором Стиннером в :issue:`43103`.)

source: The ``configure`` script now uses the ``pkg-config`` utility, if available, to detect the location of Tcl/Tk headers and libraries. As before, those locations can be explicitly specified with the ``--with-tcltk-includes`` and ``--with-tcltk-libs`` configuration options. (Contributed by Manolis Stamatogiannakis in :issue:`42603`.)
ru: Сценарий ``configure`` теперь использует утилиту ``pkg-config``, если она доступна, для определения местоположения заголовков и библиотек Tcl/Tk. Как и прежде, эти местоположения могут быть явно указаны с помощью параметров конфигурации ``--with-tcltk-includes`` и ``--with-tcltk-libs``. (Предоставлено Манолисом Стаматояннакисом в :issue:`42603`.)

source: Add :option:`--with-openssl-rpath` option to ``configure`` script. The option simplifies building Python with a custom OpenSSL installation, e.g. ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Contributed by Christian Heimes in :issue:`43466`.)
ru: Добавьте опцию :option:`--with-openssl-rpath` в скрипт ``configure``. Эта опция упрощает сборку Python с помощью специальной установки OpenSSL, например ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Предоставлено Кристианом Хаймсом в :issue:`43466`.)

source: C API Changes
ru: Изменения в C API

source: PEP 652: Maintaining the Stable ABI
ru: PEP 652: Поддержание стабильного ABI

source: The Stable ABI (Application Binary Interface) for extension modules or embedding Python is now explicitly defined. :ref:`stable` describes C API and ABI stability guarantees along with best practices for using the Stable ABI.
ru: Стабильный ABI (двоичный интерфейс приложения) для модулей расширения или внедрения Python теперь явно определен. :ref:`stable` описывает гарантии стабильности C API и ABI, а также лучшие практики использования Stable ABI.

source: (Contributed by Petr Viktorin in :pep:`652` and :issue:`43795`.)
ru: (Внесено Петром Викториным в :pep:`652` и :issue:`43795`.)

source: The result of :c:func:`PyNumber_Index` now always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``. (Contributed by Serhiy Storchaka in :issue:`40792`.)
ru: Результат :c:func:`PyNumber_Index` теперь всегда имеет точный тип :class:`int`. Раньше результатом мог быть экземпляр подкласса int. (Размещено Сергеем Сторчакой в ​​:issue:`40792`.)

source: Add a new :c:member:`~PyConfig.orig_argv` member to the :c:type:`PyConfig` structure: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
ru: Добавьте новый член :c:member:`~PyConfig.orig_argv` в структуру :c:type:`PyConfig`: список исходных аргументов командной строки, передаваемых в исполняемый файл Python. (Предоставлено Виктором Стиннером в :issue:`23427`.)

source: The :c:func:`PyDateTime_DATE_GET_TZINFO` and :c:func:`PyDateTime_TIME_GET_TZINFO` macros have been added for accessing the ``tzinfo`` attributes of :class:`datetime.datetime` and :class:`datetime.time` objects. (Contributed by Zackery Spytz in :issue:`30155`.)
ru: Макросы :c:func:`PyDateTime_DATE_GET_TZINFO` и :c:func:`PyDateTime_TIME_GET_TZINFO` были добавлены для доступа к атрибутам ``tzinfo`` объектов :class:`datetime.datetime` и :class:`datetime.time` . (Предоставлено Закери Шпитцем в :issue:`30155`.)

source: Add a :c:func:`PyCodec_Unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
ru: Добавьте функцию :c:func:`PyCodec_Unregister` для отмены регистрации функции поиска кодеков. (Предоставлено Хай Ши в :issue:`41842`.)

source: The :c:func:`PyIter_Send` function was added to allow sending value into iterator without raising ``StopIteration`` exception. (Contributed by Vladimir Matveev in :issue:`41756`.)
ru: Была добавлена ​​функция :c:func:`PyIter_Send`, позволяющая отправлять значение в итератор без возникновения исключения ``StopIteration``. (Добавлен Владимиром Матвеевым в :issue:`41756`.)

source: Add :c:func:`PyUnicode_AsUTF8AndSize` to the limited C API. (Contributed by Alex Gaynor in :issue:`41784`.)
ru: Добавьте :c:func:`PyUnicode_AsUTF8AndSize` в ограниченный C API. (Предоставлено Алексом Гейнором в :issue:`41784`.)

source: Add :c:func:`PyModule_AddObjectRef` function: similar to :c:func:`PyModule_AddObject` but don't steal a reference to the value on success. (Contributed by Victor Stinner in :issue:`1635741`.)
ru: Добавьте функцию :c:func:`PyModule_AddObjectRef`: аналогично :c:func:`PyModule_AddObject`, но не крадите ссылку на значение в случае успеха. (Предоставлено Виктором Стиннером в :issue:`1635741`.)

source: Add :c:func:`Py_NewRef` and :c:func:`Py_XNewRef` functions to increment the reference count of an object and return the object. (Contributed by Victor Stinner in :issue:`42262`.)
ru: Добавьте функции :c:func:`Py_NewRef` и :c:func:`Py_XNewRef` для увеличения счетчика ссылок объекта и возврата объекта. (Предоставлено Виктором Стиннером в :issue:`42262`.)

source: The :c:func:`PyType_FromSpecWithBases` and :c:func:`PyType_FromModuleAndSpec` functions now accept a single class as the *bases* argument. (Contributed by Serhiy Storchaka in :issue:`42423`.)
ru: Функции :c:func:`PyType_FromSpecWithBases` и :c:func:`PyType_FromModuleAndSpec` теперь принимают один класс в качестве аргумента *bases*. (Предоставлено Сергеем Сторчакой в ​​:issue:`42423`.)

source: The :c:func:`PyType_FromModuleAndSpec` function now accepts NULL ``tp_doc`` slot. (Contributed by Hai Shi in :issue:`41832`.)
ru: Функция :c:func:`PyType_FromModuleAndSpec` теперь принимает NULL слот ``tp_doc``. (Предоставлено Хай Ши в :issue:`41832`.)

source: The :c:func:`PyType_GetSlot` function can accept :ref:`static types <static-types>`. (Contributed by Hai Shi and Petr Viktorin in :issue:`41073`.)
ru: Функция :c:func:`PyType_GetSlot` может принимать :ref:`статические типы <static-types>`. (Предоставлено Хай Ши и Петром Викторином в :issue:`41073`.)

source: Add a new :c:func:`PySet_CheckExact` function to the C-API to check if an object is an instance of :class:`set` but not an instance of a subtype. (Contributed by Pablo Galindo in :issue:`43277`.)
ru: Добавьте новую функцию :c:func:`PySet_CheckExact` в C-API, чтобы проверить, является ли объект экземпляром :class:`set`, но не экземпляром подтипа. (Предоставлено Пабло Галиндо в :issue:`43277`.)

source: Add :c:func:`PyErr_SetInterruptEx` which allows passing a signal number to simulate. (Contributed by Antoine Pitrou in :issue:`43356`.)
ru: Добавьте :c:func:`PyErr_SetInterruptEx`, который позволяет передавать номер сигнала для моделирования. (Предоставлено Антуаном Питру в :issue:`43356`.)

source: The limited C API is now supported if :ref:`Python is built in debug mode <debug-build>` (if the ``Py_DEBUG`` macro is defined). In the limited C API, the :c:func:`Py_INCREF` and :c:func:`Py_DECREF` functions are now implemented as opaque function calls, rather than accessing directly the :c:member:`PyObject.ob_refcnt` member, if Python is built in debug mode and the ``Py_LIMITED_API`` macro targets Python 3.10 or newer. It became possible to support the limited C API in debug mode because the :c:type:`PyObject` structure is the same in release and debug mode since Python 3.8 (see :issue:`36465`).
ru: Ограниченный API C теперь поддерживается, если Python собран в режиме отладки <debug-build> (если определен макрос Py_DEBUG). В ограниченном C API функции :c:func:`Py_INCREF` и :c:func:`Py_DECREF` теперь реализованы как непрозрачные вызовы функций, а не прямой доступ к элементу :c:member:` PyObj ect.ob_refcnt`. , если Python построен в режиме отладки и макрос Py_LIMITED_API предназначен для Python 3.10 или новее. Стало возможным поддерживать ограниченный API C в режиме отладки, поскольку структура :c:type:` PyObject` одинакова в режиме выпуска и отладки, начиная с Python 3.8 (см. :issue:`36465`).

source: The limited C API is still not supported in the :option:`--with-trace-refs` special build (``Py_TRACE_REFS`` macro). (Contributed by Victor Stinner in :issue:`43688`.)
ru: Ограниченный C API по-прежнему не поддерживается в специальной сборке :option:`--with-trace-refs` (макрос ``Py_TRACE_REFS``). (Предоставлено Виктором Стиннером в :issue:`43688`.)

source: Add the :c:func:`Py_Is(x, y) <Py_Is>` function to test if the *x* object is the *y* object, the same as ``x is y`` in Python. Add also the :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse` functions to test if an object is, respectively, the ``None`` singleton, the ``True`` singleton or the ``False`` singleton. (Contributed by Victor Stinner in :issue:`43753`.)
ru: Добавьте функцию :c:func:`Py_Is(x, y) <Py_Is>`, чтобы проверить, является ли объект *x* объектом *y*, так же, как ``x is y`` в Python. Добавьте также функции :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse` для проверки того, является ли объект, соответственно, одноэлементным ``None``, `` True`` синглтон или ``False`` синглтон. (Предоставлено Виктором Стиннером в :issue:`43753`.)

source: Add new functions to control the garbage collector from C code: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. These functions allow to activate, deactivate and query the state of the garbage collector from C code without having to import the :mod:`gc` module.
ru: Добавьте новые функции для управления сборщиком мусора из кода C: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. Эти функции позволяют активировать, деактивировать и запрашивать состояние сборщика мусора из кода C без необходимости импортировать модуль :mod:`gc`.

source: Add a new :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` type flag to disallow creating type instances. (Contributed by Victor Stinner in :issue:`43916`.)
ru: Добавьте новый флаг типа :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`, чтобы запретить создание экземпляров типа. (Предоставлено Виктором Стиннером в :issue:`43916`.)
