Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.10.po
Languages: ru

source: What's New In Python 3.10
ru: Что нового в Python 3.10

source: Editor
ru: Редактор

source: This article explains the new features in Python 3.10, compared to 3.9. Python 3.10 was released on October 4, 2021. For full details, see the :ref:`changelog <changelog>`.
ru: В этой статье объясняются новые возможности Python 3.10 по сравнению с версией 3.9. Python 3.10 был выпущен 4 октября 2021 г. Подробную информацию см. в журнале изменений <changelog>`.

source: Summary -- Release highlights
ru: Краткое описание - Основные моменты релиза

source: New syntax features:
ru: Новые возможности синтаксиса:

source: :pep:`634`, Structural Pattern Matching: Specification
ru: :pep:`634`, Соответствие структурному шаблону: Спецификация

source: :pep:`635`, Structural Pattern Matching: Motivation and Rationale
ru: :pep:`635`, Сопоставление структурных шаблонов: мотивация и обоснование

source: :pep:`636`, Structural Pattern Matching: Tutorial
ru: :pep:`636`, Сопоставление структурных шаблонов: Учебное пособие

source: :issue:`12782`, Parenthesized context managers are now officially allowed.
ru: :issue:`12782`, Контекстные менеджеры в скобках теперь официально разрешены.

source: New features in the standard library:
ru: Новые возможности стандартной библиотеки:

source: :pep:`618`, Add Optional Length-Checking To zip.
ru: :pep:`618`, добавьте дополнительную проверку длины в zip.

source: Interpreter improvements:
ru: Улучшения интерпретатора:

source: :pep:`626`, Precise line numbers for debugging and other tools.
ru: :pep:`626`, точные номера строк для отладки и других инструментов.

source: New typing features:
ru: Новые возможности набора текста:

source: :pep:`604`, Allow writing union types as X | Y
ru: :pep:`604`, Разрешить запись типов объединения как X | Да

source: :pep:`612`, Parameter Specification Variables
ru: :pep:`612`, Переменные спецификации параметров

source: :pep:`613`, Explicit Type Aliases
ru: :pep:`613`, Явные псевдонимы типов

source: :pep:`647`, User-Defined Type Guards
ru: :pep:`647`, Защита типов, определяемая пользователем

source: Important deprecations, removals or restrictions:
ru: Важные устаревания, удаления или ограничения:

source: :pep:`644`, Require OpenSSL 1.1.1 or newer
ru: :pep:`644`, требуется OpenSSL 1.1.1 или новее.

source: :pep:`632`, Deprecate distutils module.
ru: :pep:`632`, Модуль distutils устарел.

source: :pep:`623`, Deprecate and prepare for the removal of the wstr member in PyUnicodeObject.
ru: :pep:`623`, объявите устаревшим и подготовьтесь к удалению члена wstr из PyUnicodeObject.

source: :pep:`624`, Remove Py_UNICODE encoder APIs
ru: :pep:`624`, Удалите API-интерфейсы кодировщика Py_UNICODE.

source: :pep:`597`, Add optional EncodingWarning
ru: :pep:`597`, добавьте необязательное EncodingWarning

source: New Features
ru: Новые особенности

source: Parenthesized context managers
ru: Контекстные менеджеры в скобках

source: Using enclosing parentheses for continuation across multiple lines in context managers is now supported. This allows formatting a long collection of context managers in multiple lines in a similar way as it was previously possible with import statements. For instance, all these examples are now valid:
ru: Теперь поддерживается использование закрывающих круглых скобок для продолжения нескольких строк в контекстных менеджерах. Это позволяет форматировать длинную коллекцию контекстных менеджеров в несколько строк так же, как это было возможно ранее с операторами импорта. Например, все эти примеры теперь действительны:

source: it is also possible to use a trailing comma at the end of the enclosed group:
ru: также можно использовать завершающую запятую в конце заключенной группы:

source: This new syntax uses the non LL(1) capacities of the new parser. Check :pep:`617` for more details.
ru: Этот новый синтаксис использует возможности нового синтаксического анализатора, отличные от LL(1). Проверьте :pep:`617` для более подробной информации.

source: (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`12782` and :issue:`40334`.)
ru: (Предоставлено Гвидо ван Россумом, Пабло Галиндо и Лисандросом Николау в :issue:`12782` и :issue:`40334`.)

source: Better error messages
ru: Улучшенные сообщения об ошибках

source: When parsing code that contains unclosed parentheses or brackets the interpreter now includes the location of the unclosed bracket of parentheses instead of displaying *SyntaxError: unexpected EOF while parsing* or pointing to some incorrect location. For instance, consider the following code (notice the unclosed '{'):
ru: При синтаксическом анализе кода, содержащего незакрывающиеся скобки или квадратные скобки, интерпретатор теперь включает местоположение незакрытой скобки вместо отображения *SyntaxError: неожиданный EOF при синтаксическом анализе* или указания на какое-то неправильное местоположение. Например, рассмотрим следующий код (обратите внимание на незамкнутый '{'):

source: Previous versions of the interpreter reported confusing places as the location of the syntax error:
ru: Предыдущие версии интерпретатора сообщали о запутанных местах в качестве места синтаксической ошибки:

source: but in Python 3.10 a more informative error is emitted:
ru: но в Python 3.10 выдается более информативная ошибка:

source: In a similar way, errors involving unclosed string literals (single and triple quoted) now point to the start of the string instead of reporting EOF/EOL.
ru: Аналогичным образом ошибки, связанные с незакрытыми строковыми литералами (одинарными и тройными кавычками), теперь указывают на начало строки, а не сообщают об EOF/EOL.

source: These improvements are inspired by previous work in the PyPy interpreter.
ru: Эти улучшения основаны на предыдущей работе над интерпретатором PyPy.

source: (Contributed by Pablo Galindo in :issue:`42864` and Batuhan Taskaya in :issue:`40176`.)
ru: (Предоставлено Пабло Галиндо в :issue:`42864` и Батуханом Таской в ​​:issue:`40176`.)

source: :exc:`SyntaxError` exceptions raised by the interpreter will now highlight the full error range of the expression that constitutes the syntax error itself, instead of just where the problem is detected. In this way, instead of displaying (before Python 3.10):
ru: Исключения :exc:`SyntaxError`, вызываемые интерпретатором, теперь будут выделять весь диапазон ошибок выражения, которое представляет собой саму синтаксическую ошибку, а не только то место, где обнаружена проблема. Таким образом, вместо отображения (до Python 3.10):

source: now Python 3.10 will display the exception as:
ru: теперь Python 3.10 будет отображать исключение как:

source: This improvement was contributed by Pablo Galindo in :issue:`43914`.
ru: Это улучшение было внесено Пабло Галиндо в :issue:`43914`.

source: A considerable amount of new specialized messages for :exc:`SyntaxError` exceptions have been incorporated. Some of the most notable ones are as follows:
ru: Добавлено значительное количество новых специализированных сообщений для исключений :exc:`SyntaxError`. Некоторые из наиболее примечательных из них следующие:

source: Missing ``:`` before blocks:
ru: Отсутствует ``:`` перед блоками:

source: (Contributed by Pablo Galindo in :issue:`42997`.)
ru: (Предоставлено Пабло Галиндо в :issue:`42997`.)

source: Unparenthesised tuples in comprehensions targets:
ru: Кортежи без скобок в целях понимания:

source: (Contributed by Pablo Galindo in :issue:`43017`.)
ru: (Предоставлено Пабло Галиндо в :issue:`43017`.)

source: Missing commas in collection literals and between expressions:
ru: Отсутствуют запятые в литералах коллекции и между выражениями:

source: (Contributed by Pablo Galindo in :issue:`43822`.)
ru: (Предоставлено Пабло Галиндо в :issue:`43822`.)

source: Multiple Exception types without parentheses:
ru: Несколько типов исключений без круглых скобок:

source: (Contributed by Pablo Galindo in :issue:`43149`.)
ru: (Предоставлено Пабло Галиндо в :issue:`43149`.)

source: Missing ``:`` and values in dictionary literals:
ru: Отсутствуют ``:`` и значения в словарных литералах:

source: (Contributed by Pablo Galindo in :issue:`43823`.)
ru: (Предоставлено Пабло Галиндо в :issue:`43823`.)

source: ``try`` blocks without ``except`` or ``finally`` blocks:
ru: Блоки ``try`` без блоков ``кроме`` или ``finally``:

source: (Contributed by Pablo Galindo in :issue:`44305`.)
ru: (Предоставлено Пабло Галиндо в :issue:`44305`.)

source: Usage of ``=`` instead of ``==`` in comparisons:
ru: Использование ``=`` вместо ``==`` в сравнениях:

source: (Contributed by Pablo Galindo in :issue:`43797`.)
ru: (Предоставлено Пабло Галиндо в :issue:`43797`.)

source: Usage of ``*`` in f-strings:
ru: Использование ``*`` в f-строках:

source: (Contributed by Pablo Galindo in :issue:`41064`.)
ru: (Предоставлено Пабло Галиндо в :issue:`41064`.)

source: Many :exc:`IndentationError` exceptions now have more context regarding what kind of block was expecting an indentation, including the location of the statement:
ru: Многие исключения :exc:`IndentationError` теперь имеют больше контекста относительно того, какой тип блока ожидает отступ, включая расположение оператора:

source: When printing :exc:`AttributeError`, :c:func:`!PyErr_Display` will offer suggestions of similar attribute names in the object that the exception was raised from:
ru: При печати :exc:`AttributeError`, :c:func:`!PyErr_Display` предложит похожие имена атрибутов в объекте, из которого было вызвано исключение:

source: (Contributed by Pablo Galindo in :issue:`38530`.)
ru: (Предоставлено Пабло Галиндо в :issue:`38530`.)

source: Notice this won't work if :c:func:`!PyErr_Display` is not called to display the error which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
ru: Обратите внимание, что это не будет работать, если :c:func:`!PyErr_Display` не вызывается для отображения ошибки, что может произойти, если используется какая-либо другая пользовательская функция отображения ошибок. Это распространенный сценарий в некоторых REPL, таких как IPython.

source: When printing :exc:`NameError` raised by the interpreter, :c:func:`!PyErr_Display` will offer suggestions of similar variable names in the function that the exception was raised from:
ru: При печати :exc:`NameError`, вызванного интерпретатором, :c:func:`!PyErr_Display` предложит похожие имена переменных в функции, из-за которой было вызвано исключение:

source: Notice this won't work if :c:func:`!PyErr_Display` is not called to display the error, which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
ru: Обратите внимание, что это не будет работать, если :c:func:`!PyErr_Display` не вызывается для отображения ошибки, что может произойти, если используется какая-либо другая пользовательская функция отображения ошибок. Это распространенный сценарий в некоторых REPL, таких как IPython.

source: PEP 626: Precise line numbers for debugging and other tools
ru: PEP 626: точные номера строк для отладки и других инструментов.

source: PEP 626 brings more precise and reliable line numbers for debugging, profiling and coverage tools. Tracing events, with the correct line number, are generated for all lines of code executed and only for lines of code that are executed.
ru: PEP 626 обеспечивает более точные и надежные номера строк для инструментов отладки, профилирования и покрытия. События трассировки с правильным номером строки генерируются для всех исполняемых строк кода и только для исполняемых строк кода.

source: The :attr:`~frame.f_lineno` attribute of frame objects will always contain the expected line number.
ru: Атрибут :attr:`~frame.f_lineno` объектов фрейма всегда будет содержать ожидаемый номер строки.

source: The :attr:`~codeobject.co_lnotab` attribute of :ref:`code objects <code-objects>` is deprecated and will be removed in 3.12. Code that needs to convert from offset to line number should use the new :meth:`~codeobject.co_lines` method instead.
ru: Атрибут :attr:`~codeobject.co_lnotab` для :ref:`code object <code-objects>` устарел и будет удален в версии 3.12. Код, который необходимо преобразовать из смещения в номер строки, должен вместо этого использовать новый метод :meth:`~codeobject.co_lines`.

source: PEP 634: Structural Pattern Matching
ru: PEP 634: Сопоставление структурных шаблонов

source: Structural pattern matching has been added in the form of a *match statement* and *case statements* of patterns with associated actions. Patterns consist of sequences, mappings, primitive data types as well as class instances. Pattern matching enables programs to extract information from complex data types, branch on the structure of data, and apply specific actions based on different forms of data.
ru: Структурное сопоставление шаблонов было добавлено в форме *операторов сопоставления* и *операторов случая* шаблонов со связанными действиями. Шаблоны состоят из последовательностей, отображений, примитивных типов данных, а также экземпляров классов. Сопоставление с образцом позволяет программам извлекать информацию из сложных типов данных, разветвляться по структуре данных и применять определенные действия на основе различных форм данных.

source: Syntax and operations
ru: Синтаксис и операции

source: The generic syntax of pattern matching is::
ru: Общий синтаксис сопоставления с образцом:

source: A match statement takes an expression and compares its value to successive patterns given as one or more case blocks. Specifically, pattern matching operates by:
ru: Оператор сопоставления принимает выражение и сравнивает его значение с последовательными шаблонами, заданными в виде одного или нескольких блоков Case. В частности, сопоставление с образцом осуществляется следующим образом:

source: using data with type and shape (the ``subject``)
ru: использование данных с типом и формой («субъект»)

source: evaluating the ``subject`` in the ``match`` statement
ru: оценка ``subject`` в операторе ``match``

source: comparing the subject with each pattern in a ``case`` statement from top to bottom until a match is confirmed.
ru: сравнение субъекта с каждым шаблоном в операторе ``case`` сверху вниз до тех пор, пока совпадение не будет подтверждено.

source: executing the action associated with the pattern of the confirmed match
ru: выполнение действия, связанного с шаблоном подтвержденного совпадения

source: If an exact match is not confirmed, the last case, a wildcard ``_``, if provided, will be used as the matching case. If an exact match is not confirmed and a wildcard case does not exist, the entire match block is a no-op.
ru: Если точное совпадение не подтверждено, в качестве случая совпадения будет использоваться последний вариант, подстановочный знак ``_``, если он предусмотрен. Если точное совпадение не подтверждено и не существует подстановочного знака, весь блок совпадений не используется.

source: Declarative approach
ru: Декларативный подход

source: Readers may be aware of pattern matching through the simple example of matching a subject (data object) to a literal (pattern) with the switch statement found in C, Java or JavaScript (and many other languages). Often the switch statement is used for comparison of an object/expression with case statements containing literals.
ru: Читатели могут познакомиться с сопоставлением шаблонов на простом примере сопоставления субъекта (объекта данных) с литералом (шаблоном) с помощью оператора переключения, который можно найти в C, Java или JavaScript (и многих других языках). Часто оператор переключения используется для сравнения объекта/выражения с операторами case, содержащими литералы.

source: More powerful examples of pattern matching can be found in languages such as Scala and Elixir. With structural pattern matching, the approach is "declarative" and explicitly states the conditions (the patterns) for data to match.
ru: Более мощные примеры сопоставления с образцом можно найти в таких языках, как Scala и Elixir. При сопоставлении структурных шаблонов этот подход является «декларативным» и явно устанавливает условия (шаблоны) для сопоставления данных.

source: While an "imperative" series of instructions using nested "if" statements could be used to accomplish something similar to structural pattern matching, it is less clear than the "declarative" approach. Instead the "declarative" approach states the conditions to meet for a match and is more readable through its explicit patterns. While structural pattern matching can be used in its simplest form comparing a variable to a literal in a case statement, its true value for Python lies in its handling of the subject's type and shape.
ru: Хотя «императивная» серия инструкций с использованием вложенных операторов «if» может использоваться для выполнения чего-то похожего на сопоставление структурных шаблонов, она менее очевидна, чем «декларативный» подход. Вместо этого «декларативный» подход устанавливает условия, которым необходимо соответствовать, и более читабелен благодаря своим явным шаблонам. Хотя сопоставление структурных шаблонов можно использовать в своей простейшей форме, сравнивая переменную с литералом в операторе case, его истинная ценность для Python заключается в обработке типа и формы субъекта.

source: Simple pattern: match to a literal
ru: Простой шаблон: сопоставление с литералом

source: Let's look at this example as pattern matching in its simplest form: a value, the subject, being matched to several literals, the patterns. In the example below, ``status`` is the subject of the match statement. The patterns are each of the case statements, where literals represent request status codes. The associated action to the case is executed after a match::
ru: Давайте посмотрим на этот пример как на сопоставление шаблонов в его простейшей форме: значение, субъект, сопоставляемое с несколькими литералами, шаблонами. В приведенном ниже примере ``status`` является предметом оператора сопоставления. Шаблоны представляют собой каждый из операторов случая, где литералы представляют собой коды состояния запроса. Соответствующее действие к делу выполняется после совпадения:

source: If the above function is passed a ``status`` of 418, "I'm a teapot" is returned. If the above function is passed a ``status`` of 500, the case statement with ``_`` will match as a wildcard, and "Something's wrong with the internet" is returned. Note the last block: the variable name, ``_``, acts as a *wildcard* and insures the subject will always match. The use of ``_`` is optional.
ru: Если вышеуказанной функции передается статус 418, возвращается «Я чайник». Если вышеуказанной функции передается ``статус``, равный 500, оператор case с ``_`` будет соответствовать подстановочному знаку, и будет возвращено сообщение "Что-то не так с Интернетом". Обратите внимание на последний блок: имя переменной ``_`` действует как *подстановочный знак* и гарантирует, что субъект всегда будет совпадать. Использование ``_`` не является обязательным.

source: You can combine several literals in a single pattern using ``|`` ("or")::
ru: Вы можете объединить несколько литералов в один шаблон, используя ``|`` ("или")::

source: Behavior without the wildcard
ru: Поведение без подстановочного знака

source: If we modify the above example by removing the last case block, the example becomes::
ru: Если мы изменим приведенный выше пример, удалив последний блок case, пример станет следующим:

source: Without the use of ``_`` in a case statement, a match may not exist. If no match exists, the behavior is a no-op. For example, if ``status`` of 500 is passed, a no-op occurs.
ru: Без использования ``_`` в операторе case совпадение может не существовать. Если совпадений не существует, поведение является неактивным. Например, если передается ``status`` 500, происходит отсутствие операции.

source: Patterns with a literal and variable
ru: Шаблоны с литералом и переменной

source: Patterns can look like unpacking assignments, and a pattern may be used to bind variables. In this example, a data point can be unpacked to its x-coordinate and y-coordinate::
ru: Шаблоны могут выглядеть как распаковка присваиваний, а шаблон может использоваться для привязки переменных. В этом примере точку данных можно распаковать по ее координатам x и y::

source: The first pattern has two literals, ``(0, 0)``, and may be thought of as an extension of the literal pattern shown above. The next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
ru: Первый шаблон имеет два литерала, ``(0, 0)``, и его можно рассматривать как расширение шаблона литералов, показанного выше. Следующие два шаблона объединяют литерал и переменную, а переменная *связывает* значение из субъекта («точки»). Четвертый шаблон захватывает два значения, что делает его концептуально похожим на присваивание распаковки ``(x, y) = point``.

source: Patterns and classes
ru: Шаблоны и классы

source: If you are using classes to structure your data, you can use as a pattern the class name followed by an argument list resembling a constructor. This pattern has the ability to capture class attributes into variables::
ru: Если вы используете классы для структурирования данных, вы можете использовать в качестве шаблона имя класса, за которым следует список аргументов, напоминающий конструктор. Этот шаблон имеет возможность захватывать атрибуты класса в переменные:

source: Patterns with positional parameters
ru: Паттерны с позиционными параметрами

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
ru: Вы можете использовать позиционные параметры с некоторыми встроенными классами, которые обеспечивают порядок их атрибутов (например, классов данных). Вы также можете определить определенное положение атрибутов в шаблонах, установив в своих классах специальный атрибут ``__match_args__``. Если для него установлено значение («x», «y»), все следующие шаблоны эквивалентны (и все они привязывают атрибут ``y`` к переменной ``var``):

source: Nested patterns
ru: Вложенные шаблоны

source: Patterns can be arbitrarily nested. For example, if our data is a short list of points, it could be matched like this::
ru: Шаблоны могут быть произвольно вложены. Например, если наши данные представляют собой короткий список точек, их можно сопоставить следующим образом:

source: Complex patterns and the wildcard
ru: Сложные шаблоны и подстановочный знак

source: To this point, the examples have used ``_`` alone in the last case statement. A wildcard can be used in more complex patterns, such as ``('error', code, _)``. For example::
ru: До сих пор в примерах использовался только ``_`` в последнем операторе case. Подстановочный знак можно использовать в более сложных шаблонах, таких как ``('error', code, _)``. Например::

source: In the above case, ``test_variable`` will match for ('error', code, 100) and ('error', code, 800).
ru: В приведенном выше случае ``test_variable`` будет соответствовать ('error', код, 100) и ('error', код, 800).
