Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.10.po
Languages: ru

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
ru: Мы можем добавить в шаблон предложение if, известное как «защита». Если защита ложна, ``match`` переходит к следующему блоку case. Обратите внимание, что захват значения происходит до оценки защиты::

source: Other Key Features
ru: Другие ключевые особенности

source: Several other key features:
ru: Несколько других ключевых особенностей:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. Technically, the subject must be a sequence. Therefore, an important exception is that patterns don't match iterators. Also, to prevent a common mistake, sequence patterns don't match strings.
ru: Подобно распаковке присваиваний, шаблоны кортежей и списков имеют одно и то же значение и фактически соответствуют произвольным последовательностям. Технически, предметом должна быть последовательность. Поэтому важным исключением является то, что шаблоны не соответствуют итераторам. Кроме того, во избежание распространенной ошибки шаблоны последовательностей не соответствуют строкам.

source: Sequence patterns support wildcards: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to wildcards in unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
ru: Шаблоны последовательностей поддерживают подстановочные знаки: ``[x, y, *rest]`` и ``(x, y, *rest)`` работают аналогично подстановочным знакам при распаковке назначений. Имя после ``*`` также может быть ``_``, поэтому ``(x, y, *_)`` соответствует последовательности, состоящей как минимум из двух элементов, без привязки остальных элементов.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dict. Unlike sequence patterns, extra keys are ignored. A wildcard ``**rest`` is also supported. (But ``**_`` would be redundant, so is not allowed.)
ru: Шаблоны сопоставления: ``{"bandwidth": b, "latency": l}`` захватывает значения ``"bandwidth"`` и ``"latency"`` из словаря. В отличие от шаблонов последовательности, дополнительные ключи игнорируются. Также поддерживается подстановочный знак ``**rest``. (Но ``**_`` будет избыточным, поэтому не допускается.)

source: Subpatterns may be captured using the ``as`` keyword::
ru: Подшаблоны могут быть записаны с использованием ключевого слова as::

source: This binds x1, y1, x2, y2 like you would expect without the ``as`` clause, and p2 to the entire second item of the subject.
ru: Это привязывает x1, y1, x2, y2, как и следовало ожидать без предложения as, и p2 ко всему второму элементу субъекта.

source: Most literals are compared by equality. However, the singletons ``True``, ``False`` and ``None`` are compared by identity.
ru: Большинство литералов сравниваются по принципу равенства. Однако одиночные элементы ``True``, ``False`` и ``None`` сравниваются по идентичности.

source: Named constants may be used in patterns. These named constants must be dotted names to prevent the constant from being interpreted as a capture variable::
ru: Именованные константы можно использовать в шаблонах. Имена этих именованных констант должны быть разделены точками, чтобы константу нельзя было интерпретировать как переменную захвата:

source: For the full specification see :pep:`634`. Motivation and rationale are in :pep:`635`, and a longer tutorial is in :pep:`636`.
ru: Полную спецификацию см. в :pep:`634`. Мотивация и обоснование находятся в :pep:`635`, а более подробное руководство находится в :pep:`636`.

source: Optional ``EncodingWarning`` and ``encoding="locale"`` option
ru: Дополнительная опция EncodingWarning и encoding="locale"

source: The default encoding of :class:`~io.TextIOWrapper` and :func:`open` is platform and locale dependent. Since UTF-8 is used on most Unix platforms, omitting ``encoding`` option when opening UTF-8 files (e.g. JSON, YAML, TOML, Markdown) is a very common bug. For example::
ru: Кодировка по умолчанию для :class:`~io.TextIOWrapper` и :func:`open` зависит от платформы и локали. Поскольку UTF-8 используется на большинстве платформ Unix, отсутствие параметра «кодировка» при открытии файлов UTF-8 (например, JSON, YAML, TOML, Markdown) является очень распространенной ошибкой. Например::

source: To find this type of bug, an optional ``EncodingWarning`` is added. It is emitted when :data:`sys.flags.warn_default_encoding <sys.flags>` is true and locale-specific default encoding is used.
ru: Чтобы найти этот тип ошибки, добавляется необязательное EncodingWarning. Он генерируется, когда :data:`sys.flags.warn_default_encoding <sys.flags>` имеет значение true и используется кодировка по умолчанию, специфичная для локали.

source: ``-X warn_default_encoding`` option and :envvar:`PYTHONWARNDEFAULTENCODING` are added to enable the warning.
ru: Опция ``-X alert_default_encoding`` и :envvar:`PYTHONWARNDEFAULTENCODING` добавляются для включения предупреждения.

source: See :ref:`io-text-encoding` for more information.
ru: См. :ref:`io-text-encoding` для получения дополнительной информации.

source: New Features Related to Type Hints
ru: Новые функции, связанные с подсказками типов

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
ru: В этом разделе описаны основные изменения, затрагивающие подсказки типов :pep:`484` и модуль :mod:`typing`.

source: PEP 604: New Type Union Operator
ru: PEP 604: Оператор объединения нового типа

source: A new type union operator was introduced which enables the syntax ``X | Y``. This provides a cleaner way of expressing 'either type X or type Y' instead of using :data:`typing.Union`, especially in type hints.
ru: Был введен новый оператор объединения типов, который позволяет использовать синтаксис ``X | Й``. Это обеспечивает более чистый способ выражения типа «либо тип X, либо тип Y» вместо использования :data:`typing.Union`, особенно в подсказках типов.

source: In previous versions of Python, to apply a type hint for functions accepting arguments of multiple types, :data:`typing.Union` was used::
ru: В предыдущих версиях Python для применения подсказки типа к функциям, принимающим аргументы нескольких типов, использовался :data:`typing.Union`::

source: Type hints can now be written in a more succinct manner::
ru: Подсказки типов теперь можно писать более лаконично:

source: This new syntax is also accepted as the second argument to :func:`isinstance` and :func:`issubclass`::
ru: Этот новый синтаксис также принимается в качестве второго аргумента :func:`isinstance` и :func:`issubclass`::

source: See :ref:`types-union` and :pep:`604` for more details.
ru: Дополнительную информацию смотрите в :ref:`types-union` и :pep:`604`.

source: (Contributed by Maggie Moss and Philippe Prados in :issue:`41428`, with additions by Yurii Karabas and Serhiy Storchaka in :issue:`44490`.)
ru: (Внесено Мэгги Мосс и Филиппом Прадосом в :issue:`41428`, с дополнениями Юрия Карабаса и Сергея Сторчаки в :issue:`44490`.)

source: PEP 612: Parameter Specification Variables
ru: PEP 612: Переменные спецификации параметров

source: Two new options to improve the information provided to static type checkers for :pep:`484`\ 's ``Callable`` have been added to the :mod:`typing` module.
ru: В модуль :mod:`typing` были добавлены две новые опции для улучшения информации, предоставляемой средствам проверки статического типа для :pep:`484`\ ``Callable``.

source: The first is the parameter specification variable. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. Examples of usage can be found in :class:`typing.ParamSpec`. Previously, there was no easy way to type annotate dependency of parameter types in such a precise manner.
ru: Первая — это переменная спецификации параметра. Они используются для пересылки типов параметров одного вызываемого объекта в другой вызываемый объект — шаблон, обычно встречающийся в функциях и декораторах более высокого порядка. Примеры использования можно найти в :class:`typing.ParamSpec`. Раньше не существовало простого способа столь точного ввода аннотирующих зависимостей типов параметров.

source: The second option is the new ``Concatenate`` operator. It's used in conjunction with parameter specification variables to type annotate a higher order callable which adds or removes parameters of another callable. Examples of usage can be found in :class:`typing.Concatenate`.
ru: Второй вариант — новый оператор «Объединить». Он используется в сочетании с переменными спецификации параметра для ввода аннотации вызываемого объекта более высокого порядка, который добавляет или удаляет параметры другого вызываемого объекта. Примеры использования можно найти в :class:`typing.Concatenate`.

source: See :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs`, and :pep:`612` for more details.
ru: См. :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs` и :pep: `612` для более подробной информации.

source: (Contributed by Ken Jin in :issue:`41559`, with minor enhancements by Jelle Zijlstra in :issue:`43783`. PEP written by Mark Mendoza.)
ru: (Внесено Кеном Джином в :issue:`41559`, с небольшими улучшениями Джелле Зийлстрой в :issue:`43783`. PEP написан Марком Мендосой.)

source: :pep:`484` introduced the concept of type aliases, only requiring them to be top-level unannotated assignments. This simplicity sometimes made it difficult for type checkers to distinguish between type aliases and ordinary assignments, especially when forward references or invalid types were involved. Compare::
ru: :pep:`484` представил концепцию псевдонимов типов, требуя, чтобы они были только неаннотированными назначениями верхнего уровня. Из-за этой простоты иногда специалистам по проверке типов было трудно отличить псевдонимы типов от обычных присвоений, особенно когда использовались прямые ссылки или недопустимые типы. Сравнивать::

source: Now the :mod:`typing` module has a special value :data:`~typing.TypeAlias` which lets you declare type aliases more explicitly::
ru: Теперь модуль :mod:`typing` имеет специальное значение :data:`~typing.TypeAlias`, которое позволяет более явно объявлять псевдонимы типов::

source: See :pep:`613` for more details.
ru: См. :pep:`613` для более подробной информации.

source: PEP 647: User-Defined Type Guards
ru: PEP 647: защита типа, определяемая пользователем

source: :data:`~typing.TypeGuard` has been added to the :mod:`typing` module to annotate type guard functions and improve information provided to static type checkers during type narrowing. For more information, please see :data:`~typing.TypeGuard`\ 's documentation, and :pep:`647`.
ru: :data:`~typing.TypeGuard` был добавлен в модуль :mod:`typing` для аннотирования функций защиты типов и улучшения информации, предоставляемой средствам проверки статического типа во время сужения типа. Для получения дополнительной информации см. документацию :data:`~typing.TypeGuard`\ и :pep:`647`.

source: (Contributed by Ken Jin and Guido van Rossum in :issue:`43766`. PEP written by Eric Traut.)
ru: (Внесено Кеном Джином и Гвидо ван Россумом в :issue:`43766`. PEP написан Эриком Траутом.)

source: Other Language Changes
ru: Другие языковые изменения

source: The :class:`int` type has a new method :meth:`int.bit_count`, returning the number of ones in the binary expansion of a given integer, also known as the population count. (Contributed by Niklas Fiekas in :issue:`29882`.)
ru: Тип :class:`int` имеет новый метод :meth:`int.bit_count`, возвращающий количество единиц в двоичном представлении данного целого числа, также известное как подсчет населения. (Предоставлено Никласом Фиекасом в :issue:`29882`.)

source: The views returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` now all have a ``mapping`` attribute that gives a :class:`types.MappingProxyType` object wrapping the original dictionary. (Contributed by Dennis Sweeney in :issue:`40890`.)
ru: Представления, возвращаемые :meth:`dict.keys`, :meth:`dict.values` и :meth:`dict.items`, теперь имеют атрибут ``mapping``, который дает :class:`types.MappingProxyType `объект, обертывающий исходный словарь. (Предоставлено Деннисом Суини в :issue:`40890`.)

source: :pep:`618`: The :func:`zip` function now has an optional ``strict`` flag, used to require that all the iterables have an equal length.
ru: :pep:`618`: Функция :func:`zip` теперь имеет дополнительный флаг ``strict``, используемый для требования, чтобы все итерируемые объекты имели одинаковую длину.

source: Builtin and extension functions that take integer arguments no longer accept :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). (Contributed by Serhiy Storchaka in :issue:`37999`.)
ru: Встроенные функции и функции расширения, которые принимают целочисленные аргументы, больше не принимают :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s и другие объекты, которые можно преобразовать в целые числа только с потерей (например, иметь метод :meth:`~object.__int__`, но не иметь метода :meth:`~object.__index__`). (Предоставлено Сергеем Сторчакой в ​​:issue:`37999`.)

source: If :func:`object.__ipow__` returns :data:`NotImplemented`, the operator will correctly fall back to :func:`object.__pow__` and :func:`object.__rpow__` as expected. (Contributed by Alex Shkop in :issue:`38302`.)
ru: Если :func:`object.__ipow__` возвращает :data:`NotImplemented`, оператор корректно вернется к :func:`object.__pow__` и :func:`object.__rpow__`, как и ожидалось. (Предоставлено Алексом Шкопом в :issue:`38302`.)

source: Assignment expressions can now be used unparenthesized within set literals and set comprehensions, as well as in sequence indexes (but not slices).
ru: Выражения присваивания теперь можно использовать без круглых скобок в литералах множества и пониманиях множества, а также в индексах последовательностей (но не в срезах).

source: Functions have a new ``__builtins__`` attribute which is used to look for builtin symbols when a function is executed, instead of looking into ``__globals__['__builtins__']``. The attribute is initialized from ``__globals__["__builtins__"]`` if it exists, else from the current builtins. (Contributed by Mark Shannon in :issue:`42990`.)
ru: Функции имеют новый атрибут ``__builtins__``, который используется для поиска встроенных символов при выполнении функции вместо поиска в ``__globals__['__builtins__']``. Атрибут инициализируется из ``__globals__["__builtins__"]``, если он существует, иначе из текущих встроенных функций. (Предоставлено Марком Шенноном в :issue:`42990`.)

source: Two new builtin functions -- :func:`aiter` and :func:`anext` have been added to provide asynchronous counterparts to :func:`iter` and :func:`next`, respectively. (Contributed by Joshua Bronson, Daniel Pope, and Justin Wang in :issue:`31861`.)
ru: Две новые встроенные функции — :func:`aiter` и :func:`anext` были добавлены для обеспечения асинхронных аналогов :func:`iter` и :func:`next` соответственно. (Предоставлено Джошуа Бронсоном, Дэниелом Поупом и Джастином Вангом в :issue:`31861`.)

source: Static methods (:func:`@staticmethod <staticmethod>`) and class methods (:func:`@classmethod <classmethod>`) now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__``, ``__annotations__``) and have a new ``__wrapped__`` attribute. Moreover, static methods are now callable as regular functions. (Contributed by Victor Stinner in :issue:`43682`.)
ru: Статические методы (:func:`@staticmethod <staticmethod>`) и методы класса (:func:`@classmethod <classmethod>`) теперь наследуют атрибуты метода (``__module__``, ``__name__``, ``__qualname__ ``, ``__doc__``, ``__annotations__``) и иметь новый атрибут ``__wrapped__``. Более того, статические методы теперь можно вызывать как обычные функции. (Предоставлено Виктором Стиннером в :issue:`43682`.)

source: Annotations for complex targets (everything beside ``simple name`` targets defined by :pep:`526`) no longer cause any runtime effects with ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42737`.)
ru: Аннотации для сложных целей (все, кроме целей ``simple name``, определенных :pep:`526`) больше не вызывают никаких эффектов во время выполнения с ``from __future__ import annotations``. (Предоставлено Батуханом Таской в ​​:issue:`42737`.)

source: Class and module objects now lazy-create empty annotations dicts on demand. The annotations dicts are stored in the object’s ``__dict__`` for backwards compatibility. This improves the best practices for working with ``__annotations__``; for more information, please see :ref:`annotations-howto`. (Contributed by Larry Hastings in :issue:`43901`.)
ru: Объекты классов и модулей теперь лениво создают пустые аннотации по требованию. Слова аннотаций хранятся в ``__dict__`` объекта для обеспечения обратной совместимости. Это улучшает лучшие практики работы с ``__annotations__``; для получения дополнительной информации см. :ref:`annotations-howto`. (Предоставлено Ларри Гастингсом в :issue:`43901`.)

source: Annotations consist of ``yield``, ``yield from``, ``await`` or named expressions are now forbidden under ``from __future__ import annotations`` due to their side effects. (Contributed by Batuhan Taskaya in :issue:`42725`.)
ru: Аннотации состоят из ``yield``, ``yield from``, ``await``, а именованные выражения теперь запрещены в ``from __future__ import annotations`` из-за их побочных эффектов. (Предоставлено Батуханом Таской в ​​:issue:`42725`.)

source: Usage of unbound variables, ``super()`` and other expressions that might alter the processing of symbol table as annotations are now rendered effectless under ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42725`.)
ru: Использование несвязанных переменных, ``super()`` и других выражений, которые могут изменить обработку таблицы символов в качестве аннотаций, теперь недействительны в ``from __future__ import annotations``. (Предоставлено Батуханом Таской в ​​:issue:`42725`.)

source: Hashes of NaN values of both :class:`float` type and :class:`decimal.Decimal` type now depend on object identity. Formerly, they always hashed to ``0`` even though NaN values are not equal to one another. This caused potentially quadratic runtime behavior due to excessive hash collisions when creating dictionaries and sets containing multiple NaNs. (Contributed by Raymond Hettinger in :issue:`43475`.)
ru: Хэши значений NaN как типа :class:`float`, так и :class:`decimal.Decimal` теперь зависят от идентификации объекта. Раньше они всегда хешировались до «0», даже если значения NaN не равны друг другу. Это вызывало потенциально квадратичное поведение во время выполнения из-за чрезмерных коллизий хэшей при создании словарей и наборов, содержащих несколько NaN. (Предоставлено Рэймондом Хеттингером в :issue:`43475`.)

source: A :exc:`SyntaxError` (instead of a :exc:`NameError`) will be raised when deleting the :const:`__debug__` constant. (Contributed by Donghee Na in :issue:`45000`.)
ru: При удалении константы :const:`__debug__` будет возникать ошибка :exc:`SyntaxError` (вместо :exc:`NameError`). (Предоставлено Донхи На в :issue:`45000`.)

source: :exc:`SyntaxError` exceptions now have ``end_lineno`` and ``end_offset`` attributes. They will be ``None`` if not determined. (Contributed by Pablo Galindo in :issue:`43914`.)
ru: Исключения :exc:`SyntaxError` теперь имеют атрибуты ``end_lineno`` и ``end_offset``. Если они не определены, они будут иметь значение «Нет». (Предоставлено Пабло Галиндо в :issue:`43914`.)

source: New Modules
ru: Новые модули

source: Improved Modules
ru: Улучшенные модули

source: Add missing :meth:`~asyncio.events.AbstractEventLoop.connect_accepted_socket` method. (Contributed by Alex Grönholm in :issue:`41332`.)
ru: Добавьте отсутствующий метод :meth:`~asyncio.events.AbstractEventLoop.connect_accepted_socket`. (Предоставлено Алексом Грёнхольмом в :issue:`41332`.)

source: Misleading phrase "optional arguments" was replaced with "options" in argparse help. Some tests might require adaptation if they rely on exact output match. (Contributed by Raymond Hettinger in :issue:`9694`.)
ru: Вводящая в заблуждение фраза «необязательные аргументы» была заменена на «опции» в справке по argparse. Некоторые тесты могут потребовать адаптации, если они полагаются на точное соответствие выходных данных. (Предоставлено Рэймондом Хеттингером в :issue:`9694`.)

source: The :meth:`~array.array.index` method of :class:`array.array` now has optional *start* and *stop* parameters. (Contributed by Anders Lorentsen and Zackery Spytz in :issue:`31956`.)
ru: Метод :meth:`~array.array.index` класса :class:`array.array` теперь имеет дополнительные параметры *start* и *stop*. (Предоставлено Андерсом Лоренценом и Закери Шпитцем в :issue:`31956`.)

source: These modules have been marked as deprecated in their module documentation since Python 3.6. An import-time :class:`DeprecationWarning` has now been added to all three of these modules.
ru: Эти модули помечены как устаревшие в документации модулей, начиная с Python 3.6. Во все три модуля теперь добавлено предупреждение времени импорта.

source: Add :func:`base64.b32hexencode` and :func:`base64.b32hexdecode` to support the Base32 Encoding with Extended Hex Alphabet.
ru: Добавьте :func:`base64.b32hexencode` и :func:`base64.b32hexdecode` для поддержки кодировки Base32 с расширенным шестнадцатеричным алфавитом.

source: Add :meth:`~bdb.Breakpoint.clearBreakpoints` to reset all set breakpoints. (Contributed by Irit Katriel in :issue:`24160`.)
ru: Добавьте :meth:`~bdb.Breakpoint.clearBreakpoints` для сброса всех установленных точек останова. (Предоставлено Ирит Катриэль в :issue:`24160`.)

source: bisect
ru: разделить пополам

source: Added the possibility of providing a *key* function to the APIs in the :mod:`bisect` module. (Contributed by Raymond Hettinger in :issue:`4356`.)
ru: Добавлена ​​возможность предоставления функции *key* для API в модуле :mod:`bisect`. (Предоставлено Рэймондом Хеттингером в :issue:`4356`.)

source: codecs
ru: кодеки

source: Add a :func:`codecs.unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
ru: Добавьте функцию :func:`codecs.unregister` для отмены регистрации функции поиска кодеков. (Предоставлено Хай Ши в :issue:`41842`.)
