Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.10.po
Languages: ru

source: Add :func:`platform.freedesktop_os_release` to retrieve operation system identification from `freedesktop.org os-release <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ standard file. (Contributed by Christian Heimes in :issue:`28468`.)
ru: Добавьте :func:`platform.freedesktop_os_release` для получения идентификации операционной системы из стандартного файла `freedesktop.org os-release <https://www.freedesktop.org/software/systemd/man/os-release.html>`_. (Предоставлено Кристианом Хаймсом в :issue:`28468`.)

source: :func:`pprint.pprint` now accepts a new ``underscore_numbers`` keyword argument. (Contributed by sblondon in :issue:`42914`.)
ru: :func:`pprint.pprint` теперь принимает новый аргумент ключевого слова ``underscore_numbers``. (Предоставлено sblondon в :issue:`42914`.)

source: :mod:`pprint` can now pretty-print :class:`dataclasses.dataclass` instances. (Contributed by Lewis Gaul in :issue:`43080`.)
ru: :mod:`pprint` теперь может красиво печатать экземпляры :class:`dataclasses.dataclass`. (Предоставлено Льюисом Галом в :issue:`43080`.)

source: Add ``--quiet`` option to command-line interface of :mod:`py_compile`. (Contributed by Gregory Schevchenko in :issue:`38731`.)
ru: Добавьте опцию ``--quiet`` в интерфейс командной строки :mod:`py_compile`. (Предоставлено Григорием Шевченко в :issue:`38731`.)

source: Add an ``end_lineno`` attribute to the ``Function`` and ``Class`` objects in the tree returned by :func:`pyclbr.readmodule` and :func:`pyclbr.readmodule_ex`. It matches the existing (start) ``lineno``. (Contributed by Aviral Srivastava in :issue:`38307`.)
ru: Добавьте атрибут end_lineno к объектам Function и Class. Он соответствует существующему (началу) ``белью``. (Предоставлено Авиралом Шриваставой в :issue:`38307`.)

source: shelve
ru: полка

source: The :mod:`shelve` module now uses :const:`pickle.DEFAULT_PROTOCOL` by default instead of :mod:`pickle` protocol ``3`` when creating shelves. (Contributed by Zackery Spytz in :issue:`34204`.)
ru: Модуль :mod:`shelve` теперь использует :const:`pickle.DEFAULT_PROTOCOL` по умолчанию вместо :mod:`pickle` протокола ``3`` при создании полок. (Предоставлено Закери Шпитцем в :issue:`34204`.)

source: statistics
ru: статистика

source: Add :func:`~statistics.covariance`, Pearson's :func:`~statistics.correlation`, and simple :func:`~statistics.linear_regression` functions. (Contributed by Tymoteusz Wołodźko in :issue:`38490`.)
ru: Добавьте :func:`~statistics.covariance`, :func:`~statistics.correlation` Пирсона и простые функции :func:`~statistics.linear_reгрессия`. (Предоставлено Тимотеушем Володько в :issue:`38490`.)

source: site
ru: сайт

source: socket
ru: сокет

source: The exception :exc:`socket.timeout` is now an alias of :exc:`TimeoutError`. (Contributed by Christian Heimes in :issue:`42413`.)
ru: Исключение :exc:`socket.timeout` теперь является псевдонимом :exc:`TimeoutError`. (Предоставлено Кристианом Хаймсом в :issue:`42413`.)

source: Add option to create MPTCP sockets with ``IPPROTO_MPTCP`` (Contributed by Rui Cunha in :issue:`43571`.)
ru: Добавьте опцию для создания сокетов MPTCP с помощью ``IPPROTO_MPTCP`` (предоставлен Руи Кунья в:issue:`43571`.)

source: Add ``IP_RECVTOS`` option to receive the type of service (ToS) or DSCP/ECN fields (Contributed by Georg Sauthoff in :issue:`44077`.)
ru: Добавьте опцию ``IP_RECVTOS`` для получения полей типа услуги (ToS) или DSCP/ECN (предоставлено Георгом Заутхоффом в:issue:`44077`.)

source: The ssl module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
ru: Для модуля SSL требуется OpenSSL 1.1.1 или новее. (Предоставлено Кристианом Хаймсом в :pep:`644` и :issue:`43669`.)

source: The ssl module has preliminary support for OpenSSL 3.0.0 and new option :const:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Contributed by Christian Heimes in :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue:`43789`, and :issue:`43811`.)
ru: Модуль SSL имеет предварительную поддержку OpenSSL 3.0.0 и новую опцию :const:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Внесено Кристианом Хаймсом в :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue :`43789` и :issue:`43811`.)

source: Deprecated function and use of deprecated constants now result in a :exc:`DeprecationWarning`. :attr:`ssl.SSLContext.options` has :data:`~ssl.OP_NO_SSLv2` and :data:`~ssl.OP_NO_SSLv3` set by default and therefore cannot warn about setting the flag again. The :ref:`deprecation section <whatsnew310-deprecated>` has a list of deprecated features. (Contributed by Christian Heimes in :issue:`43880`.)
ru: Устаревшая функция и использование устаревших констант теперь приводят к появлению :exc:`DeprecationWarning`. :attr:`ssl.SSLContext.options` имеет :data:`~ssl.OP_NO_SSLv2` и :data:`~ssl.OP_NO_SSLv3`, установленные по умолчанию, и поэтому не может предупреждать о повторной установке флага. Раздел устаревших функций <whatsnew310-deprecated> содержит список устаревших функций. (Предоставлено Кристианом Хаймсом в :issue:`43880`.)

source: The ssl module now has more secure default settings. Ciphers without forward secrecy or SHA-1 MAC are disabled by default. Security level 2 prohibits weak RSA, DH, and ECC keys with less than 112 bits of security. :class:`~ssl.SSLContext` defaults to minimum protocol version TLS 1.2. Settings are based on Hynek Schlawack's research. (Contributed by Christian Heimes in :issue:`43998`.)
ru: Модуль SSL теперь имеет более безопасные настройки по умолчанию. Шифры без прямой секретности или SHA-1 MAC отключены по умолчанию. Уровень безопасности 2 запрещает слабые ключи RSA, DH и ECC с длиной защиты менее 112 бит. :class:`~ssl.SSLContext` по умолчанию использует минимальную версию протокола TLS 1.2. Настройки основаны на исследованиях Хайнека Шлавака. (Предоставлено Кристианом Хаймсом в :issue:`43998`.)

source: The deprecated protocols SSL 3.0, TLS 1.0, and TLS 1.1 are no longer officially supported. Python does not block them actively. However OpenSSL build options, distro configurations, vendor patches, and cipher suites may prevent a successful handshake.
ru: Устаревшие протоколы SSL 3.0, TLS 1.0 и TLS 1.1 больше официально не поддерживаются. Python не блокирует их активно. Однако параметры сборки OpenSSL, конфигурации дистрибутива, исправления поставщиков и наборы шифров могут помешать успешному установлению связи.

source: Add a *timeout* parameter to the :func:`ssl.get_server_certificate` function. (Contributed by Zackery Spytz in :issue:`31870`.)
ru: Добавьте параметр *timeout* в функцию :func:`ssl.get_server_certificate`. (Предоставлено Закери Шпитцем в :issue:`31870`.)

source: The ssl module uses heap-types and multi-phase initialization. (Contributed by Christian Heimes in :issue:`42333`.)
ru: Модуль SSL использует типы кучи и многофазную инициализацию. (Предоставлено Кристианом Хаймсом в :issue:`42333`.)

source: A new verify flag :const:`~ssl.VERIFY_X509_PARTIAL_CHAIN` has been added. (Contributed by l0x in :issue:`40849`.)
ru: Был добавлен новый флаг проверки :const:`~ssl.VERIFY_X509_PARTIAL_CHAIN`. (Внесено l0x в :issue:`40849`.)

source: Add audit events for :func:`~sqlite3.connect/handle`, :meth:`~sqlite3.Connection.enable_load_extension`, and :meth:`~sqlite3.Connection.load_extension`. (Contributed by Erlend E. Aasland in :issue:`43762`.)
ru: Добавьте события аудита для :func:`~sqlite3.connect/handle`, :meth:`~sqlite3.Connection.enable_load_extension` и :meth:`~sqlite3.Connection.load_extension`. (Предоставлено Эрлендом Э. Осландом в :issue:`43762`.)

source: Add :data:`sys.orig_argv` attribute: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
ru: Добавьте атрибут :data:`sys.orig_argv`: список исходных аргументов командной строки, передаваемых в исполняемый файл Python. (Предоставлено Виктором Стиннером в :issue:`23427`.)

source: Add :data:`sys.stdlib_module_names`, containing the list of the standard library module names. (Contributed by Victor Stinner in :issue:`42955`.)
ru: Добавьте :data:`sys.stdlib_module_names`, содержащий список имен модулей стандартной библиотеки. (Предоставлено Виктором Стиннером в :issue:`42955`.)

source: :func:`_thread.interrupt_main` now takes an optional signal number to simulate (the default is still :const:`signal.SIGINT`). (Contributed by Antoine Pitrou in :issue:`43356`.)
ru: :func:`_thread.interrupt_main` теперь принимает необязательный номер сигнала для симуляции (по-прежнему используется значение по умолчанию :const:`signal.SIGINT`). (Предоставлено Антуаном Питру в :issue:`43356`.)

source: Add :func:`threading.gettrace` and :func:`threading.getprofile` to retrieve the functions set by :func:`threading.settrace` and :func:`threading.setprofile` respectively. (Contributed by Mario Corchero in :issue:`42251`.)
ru: Добавьте :func:`threading.gettrace` и :func:`threading.getprofile` для получения функций, установленных :func:`threading.settrace` и :func:`threading.setprofile` соответственно. (Предоставлено Марио Корчеро в :issue:`42251`.)

source: Add :data:`threading.__excepthook__` to allow retrieving the original value of :func:`threading.excepthook` in case it is set to a broken or a different value. (Contributed by Mario Corchero in :issue:`42308`.)
ru: Добавьте :data:`threading.__Exceptionhook__`, чтобы разрешить получение исходного значения :func:`threading.excepthook` в случае, если для него установлено неверное или другое значение. (Предоставлено Марио Корчеро в :issue:`42308`.)

source: traceback
ru: трассировка

source: The :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions can now take an exception object as a positional-only argument. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
ru: Функции :func:`~traceback.format_Exception`, :func:`~traceback.format_Exception_only` и :func:`~traceback.print_Exception` теперь могут принимать объект исключения в качестве позиционного аргумента. (Предоставлено Закери Шпитцем и Маттиасом Бюссонье в :issue:`26389`.)

source: types
ru: типы

source: Reintroduce the :data:`types.EllipsisType`, :data:`types.NoneType` and :data:`types.NotImplementedType` classes, providing a new set of types readily interpretable by type checkers. (Contributed by Bas van Beek in :issue:`41810`.)
ru: Вновь представить классы :data:`types.EllipsisType`, :data:`types.NoneType` и :data:`types.NotImplementedType`, предоставляя новый набор типов, легко интерпретируемых средствами проверки типов. (Предоставлено Басом ван Беком в :issue:`41810`.)

source: typing
ru: печатание

source: For major changes, see :ref:`new-feat-related-type-hints`.
ru: Чтобы узнать об основных изменениях, см. :ref:`new-feat-related-type-hints`.

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
ru: Поведение :class:`typing.Literal` было изменено, чтобы соответствовать :pep:`586` и поведению средств проверки статических типов, указанных в PEP.

source: ``Literal`` now de-duplicates parameters.
ru: ``Literal`` теперь устраняет дубликаты параметров.

source: Equality comparisons between ``Literal`` objects are now order independent.
ru: Сравнения на равенство между объектами Literal теперь не зависят от порядка.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
ru: ``Литеральные`` сравнения теперь учитывают типы. Например, ``Literal[0] == Literal[False]`` ранее оценивалось как ``True``. Теперь это ``Ложь``. Чтобы поддержать это изменение, внутренний кэш типов теперь поддерживает дифференцирующие типы.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with unhashable parameters will not throw an error::
ru: ``Литеральные`` объекты теперь будут вызывать исключение :exc:`TypeError` во время сравнения на равенство, если какой-либо из их параметров не является :term:`hashable`. Обратите внимание, что объявление ``Literal`` с нехэшируемыми параметрами не приведет к ошибке::

source: (Contributed by Yurii Karabas in :issue:`42345`.)
ru: (Предоставлено Юрием Карабасом в :issue:`42345`.)

source: Add new function :func:`typing.is_typeddict` to introspect if an annotation is a :class:`typing.TypedDict`. (Contributed by Patrick Reader in :issue:`41792`.)
ru: Добавьте новую функцию :func:`typing.is_typeddict` для проверки того, является ли аннотация :class:`typing.TypedDict`. (Предоставлено Патриком Ридером в :issue:`41792`.)

source: Subclasses of ``typing.Protocol`` which only have data variables declared will now raise a ``TypeError`` when checked with ``isinstance`` unless they are decorated with :func:`~typing.runtime_checkable`. Previously, these checks passed silently. Users should decorate their subclasses with the :func:`!runtime_checkable` decorator if they want runtime protocols. (Contributed by Yurii Karabas in :issue:`38908`.)
ru: Подклассы Typing.Protocol, в которых объявлены только переменные данных, теперь будут выдавать ошибку TypeError при проверке с помощью isinstance, если только они не декорированы :func:`~typing.runtime_checkable`. Раньше эти проверки проходили молча. Пользователи должны украшать свои подклассы декоратором :func:`!runtime_checkable`, если им нужны протоколы времени выполнения. (Добавлен Юрием Карабасом в :issue:`38908`.)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules have been deprecated since Python 3.8 and will be removed in a future version of Python. Anything belonging to those submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`.)
ru: Импорт из подмодулей ``typing.io`` и ``typing.re`` теперь будет выдавать :exc:`DeprecationWarning`. Эти подмодули устарели, начиная с Python 3.8, и будут удалены в будущей версии Python. Вместо этого все, что принадлежит этим подмодулям, должно быть импортировано непосредственно из :mod:`typing`. (Предоставлено Себастьяном Риттау в :issue:`38291`.)

source: Add new method :meth:`~unittest.TestCase.assertNoLogs` to complement the existing :meth:`~unittest.TestCase.assertLogs`. (Contributed by Kit Yan Choi in :issue:`39385`.)
ru: Добавьте новый метод :meth:`~unittest.TestCase.assertNoLogs` в дополнение к существующему :meth:`~unittest.TestCase.assertLogs`. (Предоставлено Китом Ян Чой в :issue:`39385`.)

source: Python versions earlier than Python 3.10 allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
ru: Версии Python, предшествующие Python 3.10, позволяли использовать как ``;``, так и ``&`` в качестве разделителей параметров запроса в :func:`urllib.parse.parse_qs` и :func:`urllib.parse.parse_qsl`. Из соображений безопасности и в соответствии с новыми рекомендациями W3C это было изменено, чтобы разрешить только один ключ-разделитель с ``&`` по умолчанию. Это изменение также затрагивает :func:`cgi.parse` и :func:`cgi.parse_multipart`, поскольку они используют затронутые функции внутри себя. Более подробную информацию можно найти в соответствующей документации. (Предоставлено Адамом Гольдшмидтом, Сентилом Кумараном и Кеном Джином в :issue:`42967`.)

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
ru: Наличие символов новой строки или табуляции в частях URL-адреса допускает некоторые формы атак. В соответствии со спецификацией WHATWG, которая обновляет :rfc:`3986`, символы новой строки ASCII ``\n``, ``\r`` и табуляции ``\t`` удаляются из URL-адреса анализатором в :mod:` urllib.parse` предотвращает такие атаки. Символы удаления управляются новой переменной уровня модуля ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (См. :gh:`88048`)

source: Add a :class:`~xml.sax.handler.LexicalHandler` class to the :mod:`xml.sax.handler` module. (Contributed by Jonathan Gossage and Zackery Spytz in :issue:`35018`.)
ru: Добавьте класс :class:`~xml.sax.handler.LexicalHandler` в модуль :mod:`xml.sax.handler`. (Предоставлено Джонатаном Госсейджем и Закери Спитцем в :issue:`35018`.)

source: Add methods related to :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module`, and :meth:`zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`42131`.)
ru: Добавьте методы, связанные с :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module` и :meth:`zipimport.zipimporter.exec_module`. (Предоставлено Бреттом Кэнноном в :issue:`42131`.)

source: Add :meth:`~zipimport.zipimporter.invalidate_caches` method. (Contributed by Desmond Cheong in :issue:`14678`.)
ru: Добавьте метод :meth:`~zipimport.zipimporter.invalidate_caches`. (Предоставлено Десмондом Чеонгом в :issue:`14678`.)

source: Optimizations
ru: Оптимизации

source: Constructors :func:`str`, :func:`bytes` and :func:`bytearray` are now faster (around 30--40% for small objects). (Contributed by Serhiy Storchaka in :issue:`41334`.)
ru: Конструкторы :func:`str`, :func:`bytes` и :func:`bytearray` теперь работают быстрее (около 30--40% для небольших объектов). (Предоставлено Сергеем Сторчакой в ​​:issue:`41334`.)

source: The :mod:`runpy` module now imports fewer modules. The ``python3 -m module-name`` command startup time is 1.4x faster in average. On Linux, ``python3 -I -m module-name`` imports 69 modules on Python 3.9, whereas it only imports 51 modules (-18) on Python 3.10. (Contributed by Victor Stinner in :issue:`41006` and :issue:`41718`.)
ru: Модуль :mod:`runpy` теперь импортирует меньше модулей. Время запуска команды ``python3 -m имя-модуля`` в среднем в 1,4 раза быстрее. В Linux ``python3 -I -m имя-модуля`` импортирует 69 модулей в Python 3.9, тогда как в Python 3.10 импортируется только 51 модуль (-18). (Внесено Виктором Стиннером в :issue:`41006` и :issue:`41718`.)

source: The ``LOAD_ATTR`` instruction now uses new "per opcode cache" mechanism. It is about 36% faster now for regular attributes and 44% faster for slots. (Contributed by Pablo Galindo and Yury Selivanov in :issue:`42093` and Guido van Rossum in :issue:`42927`, based on ideas implemented originally in PyPy and MicroPython.)
ru: Инструкция ``LOAD_ATTR`` теперь использует новый механизм кэширования каждого кода операции. Теперь это примерно на 36% быстрее для обычных атрибутов и на 44% быстрее для слотов. (Представлено Пабло Галиндо и Юрием Селивановым в :issue:`42093` и Гвидо ван Россумом в :issue:`42927`, на основе идей, изначально реализованных в PyPy и MicroPython.)

source: When building Python with :option:`--enable-optimizations` now ``-fno-semantic-interposition`` is added to both the compile and link line. This speeds builds of the Python interpreter created with :option:`--enable-shared` with ``gcc`` by up to 30%. See `this article <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/>`_ for more details. (Contributed by Victor Stinner and Pablo Galindo in :issue:`38980`.)
ru: При сборке Python с помощью :option:`--enable-optimizations` теперь ``-fno-semantic-interposition`` добавляется как в строку компиляции, так и в строку компоновки. Это ускоряет сборку интерпретатора Python, созданного с помощью :option:`--enable-shared` с ``gcc``, до 30%. См. эту статью <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/> `_ для более подробной информации. (Предоставлено Виктором Стиннером и Пабло Галиндо в :issue:`38980`.)

source: Use a new output buffer management code for :mod:`bz2` / :mod:`lzma` / :mod:`zlib` modules, and add ``.readall()`` function to ``_compression.DecompressReader`` class. bz2 decompression is now 1.09x ~ 1.17x faster, lzma decompression 1.20x ~ 1.32x faster, ``GzipFile.read(-1)`` 1.11x ~ 1.18x faster. (Contributed by Ma Lin, reviewed by Gregory P. Smith, in :issue:`41486`)
ru: Используйте новый код управления выходным буфером для модулей :mod:`bz2` / :mod:`lzma` / :mod:`zlib` и добавьте функцию ``.readall()`` в класс ``_compression.DecompressReader``. . Распаковка bz2 теперь выполняется в 1,09x ~ 1,17x быстрее, распаковка lzma в 1,20x ~ 1,32x быстрее, ``GzipFile.read(-1)`` в 1,11x ~ 1,18x быстрее. (Предоставлено Ма Лин, рецензия Грегори П. Смита, в :issue:`41486`)

source: When using stringized annotations, annotations dicts for functions are no longer created when the function is created. Instead, they are stored as a tuple of strings, and the function object lazily converts this into the annotations dict on demand. This optimization cuts the CPU time needed to define an annotated function by half. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`.)
ru: При использовании строковых аннотаций словари аннотаций для функций больше не создаются при создании функции. Вместо этого они сохраняются в виде кортежа строк, и объект функции лениво преобразует его в аннотации по требованию. Эта оптимизация вдвое сокращает время ЦП, необходимое для определения аннотированной функции. (Предоставлено Юрием Карабасом и Инадой Наоки в :issue:`42202`.)

source: Substring search functions such as ``str1 in str2`` and ``str2.find(str1)`` now sometimes use Crochemore & Perrin's "Two-Way" string searching algorithm to avoid quadratic behavior on long strings. (Contributed by Dennis Sweeney in :issue:`41972`)
ru: Функции поиска подстроки, такие как ``str1 в str2`` и ``str2.find(str1)``, теперь иногда используют "двусторонний" алгоритм поиска строк Crochemore & Perrin, чтобы избежать квадратичного поведения в длинных строках. (Предоставлено Деннисом Суини в :issue:`41972`)

source: Add micro-optimizations to ``_PyType_Lookup()`` to improve type attribute cache lookup performance in the common case of cache hits. This makes the interpreter 1.04 times faster on average. (Contributed by Dino Viehland in :issue:`43452`.)
ru: Добавьте микрооптимизации в ``_PyType_Lookup()``, чтобы улучшить производительность поиска в кэше атрибутов типа в частых случаях попадания в кэш. Это делает интерпретатор в среднем в 1,04 раза быстрее. (Предоставлено Дино Виландом в :issue:`43452`.)
