Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.10.po
Languages: ru

source: The following built-in functions now support the faster :pep:`590` vectorcall calling convention: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` and :func:`float`. (Contributed by Donghee Na and Jeroen Demeyer in :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` and :issue:`41870`.)
ru: Следующие встроенные функции теперь поддерживают более быстрое соглашение о вызовах векторных вызовов :pep:`590`: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` и :func :`плавать`. (Предоставлено Донхи На и Джеруном Демейером в :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` и :issue:`41870`.)

source: :class:`~bz2.BZ2File` performance is improved by removing internal ``RLock``. This makes :class:`!BZ2File` thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been. (Contributed by Inada Naoki in :issue:`43785`.)
ru: :class:`~bz2.BZ2File` Производительность улучшена за счёт удаления внутреннего ``RLock``. Это делает поток :class:`!BZ2File` небезопасным перед лицом нескольких одновременных операций чтения или записи, точно так же, как всегда были его эквивалентные классы в :mod:`gzip` и :mod:`lzma`. (Предоставлено Инадой Наоки в :issue:`43785`.)

source: Deprecated
ru: Устарел

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). Starting in this release, a deprecation warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In future releases it will be changed to syntax warning, and finally to syntax error. (Contributed by Serhiy Storchaka in :issue:`43833`.)
ru: В настоящее время Python принимает числовые литералы, за которыми сразу следуют ключевые слова, например ``0in x``, ``1or x``, ``0if 1else 2``. Это позволяет использовать запутанные и неоднозначные выражения, такие как ``[0x1for x in y]`` (которые можно интерпретировать как ``[0x1 for x in y]`` или ``[0x1f or x in y]``). Начиная с этого выпуска, выдается предупреждение об устаревании, если за числовым литералом сразу следует одно из ключевых слов :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, : ключевое слово:`in`, :keyword:`is` и :keyword:`or`. В будущих выпусках оно будет изменено на синтаксическое предупреждение и, наконец, на синтаксическую ошибку. (Предоставлено Сергеем Сторчакой в ​​:issue:`43833`.)

source: Starting in this release, there will be a concerted effort to begin cleaning up old import semantics that were kept for Python 2.7 compatibility. Specifically, :meth:`!find_loader`/:meth:`!find_module` (superseded by :meth:`~importlib.abc.MetaPathFinder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (superseded by :meth:`~importlib.abc.Loader.exec_module`), :meth:`!module_repr` (which the import system takes care of for you), the ``__package__`` attribute (superseded by ``__spec__.parent``), the ``__loader__`` attribute (superseded by ``__spec__.loader``), and the ``__cached__`` attribute (superseded by ``__spec__.cached``) will slowly be removed (as well as other classes and methods in :mod:`importlib`). :exc:`ImportWarning` and/or :exc:`DeprecationWarning` will be raised as appropriate to help identify code which needs updating during this transition.
ru: Начиная с этого выпуска, будут предприняты согласованные усилия по очистке старой семантики импорта, которая была сохранена для совместимости с Python 2.7. В частности, :meth:`!find_loader`/:meth:`!find_module` (заменён на :meth:`~importlib.abc.MetaPathFinder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (заменён с помощью :meth:`~importlib.abc.Loader.exec_module`), :meth:`!module_repr` (о котором за вас позаботится система импорта), атрибут ``__package__`` (заменён ``__spec__.parent ``), атрибут ``__loader__`` (замененный на ``__spec__.loader``) и атрибут ``__cached__`` (замененный на ``__spec__.cached``) будут медленно удаляться (а также другие классы и методы в :mod:`importlib`). :exc:`ImportWarning` и/или :exc:`DeprecationWarning` будут вызываться по мере необходимости, чтобы помочь определить код, который требует обновления во время этого перехода.

source: The entire ``distutils`` namespace is deprecated, to be removed in Python 3.12. Refer to the :ref:`module changes <distutils-deprecated>` section for more information.
ru: Все пространство имен distutils устарело и будет удалено в Python 3.12. Обратитесь к разделу :ref:`изменения модуля <distutils-deprecated>` для получения дополнительной информации.

source: Non-integer arguments to :func:`random.randrange` are deprecated. The :exc:`ValueError` is deprecated in favor of a :exc:`TypeError`. (Contributed by Serhiy Storchaka and Raymond Hettinger in :issue:`37319`.)
ru: Нецелочисленные аргументы функции :func:`random.randrange` устарели. :exc:`ValueError` устарел в пользу :exc:`TypeError`. (Предоставлено Сергеем Сторчакой и Раймондом Хеттингером в :issue:`37319`.)

source: The various ``load_module()`` methods of :mod:`importlib` have been documented as deprecated since Python 3.6, but will now also trigger a :exc:`DeprecationWarning`. Use :meth:`~importlib.abc.Loader.exec_module` instead. (Contributed by Brett Cannon in :issue:`26131`.)
ru: Различные методы ``load_module()`` :mod:`importlib` были задокументированы как устаревшие, начиная с Python 3.6, но теперь также будут вызывать :exc:`DeprecationWarning`. Вместо этого используйте :meth:`~importlib.abc.Loader.exec_module`. (Предоставлено Бреттом Кэнноном в :issue:`26131`.)

source: :meth:`!zimport.zipimporter.load_module` has been deprecated in preference for :meth:`~zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`26131`.)
ru: :meth:`!zimport.zipimporter.load_module` устарел в пользу :meth:`~zipimport.zipimporter.exec_module`. (Предоставлено Бреттом Кэнноном в :issue:`26131`.)

source: The use of :meth:`~importlib.abc.Loader.load_module` by the import system now triggers an :exc:`ImportWarning` as :meth:`~importlib.abc.Loader.exec_module` is preferred. (Contributed by Brett Cannon in :issue:`26131`.)
ru: Использование :meth:`~importlib.abc.Loader.load_module` системой импорта теперь вызывает :exc:`ImportWarning`, поскольку :meth:`~importlib.abc.Loader.exec_module` является предпочтительным. (Предоставлено Бреттом Кэнноном в :issue:`26131`.)

source: The use of :meth:`!importlib.abc.MetaPathFinder.find_module` and :meth:`!importlib.abc.PathEntryFinder.find_module` by the import system now trigger an :exc:`ImportWarning` as :meth:`importlib.abc.MetaPathFinder.find_spec` and :meth:`importlib.abc.PathEntryFinder.find_spec` are preferred, respectively. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`42134`.)
ru: Использование :meth:`!importlib.abc.MetaPathFinder.find_module` и :meth:`!importlib.abc.PathEntryFinder.find_module` системой импорта теперь вызывает :exc:`ImportWarning` как :meth:`importlib. abc.MetaPathFinder.find_spec` и :meth:`importlib.abc.PathEntryFinder.find_spec` являются предпочтительными соответственно. Вы можете использовать :func:`importlib.util.spec_from_loader` для помощи в портировании. (Предоставлено Бреттом Кэнноном в :issue:`42134`.)

source: The use of :meth:`!importlib.abc.PathEntryFinder.find_loader` by the import system now triggers an :exc:`ImportWarning` as :meth:`importlib.abc.PathEntryFinder.find_spec` is preferred. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`43672`.)
ru: Использование :meth:`!importlib.abc.PathEntryFinder.find_loader` системой импорта теперь вызывает :exc:`ImportWarning`, поскольку :meth:`importlib.abc.PathEntryFinder.find_spec` является предпочтительным. Вы можете использовать :func:`importlib.util.spec_from_loader` для помощи в портировании. (Предоставлено Бреттом Кэнноном в :issue:`43672`.)

source: The various implementations of :meth:`!importlib.abc.MetaPathFinder.find_module` ( :meth:`!importlib.machinery.BuiltinImporter.find_module`, :meth:`!importlib.machinery.FrozenImporter.find_module`, :meth:`!importlib.machinery.WindowsRegistryFinder.find_module`, :meth:`!importlib.machinery.PathFinder.find_module`, :meth:`!importlib.abc.MetaPathFinder.find_module` ), :meth:`!importlib.abc.PathEntryFinder.find_module` ( :meth:`!importlib.machinery.FileFinder.find_module` ), and :meth:`!importlib.abc.PathEntryFinder.find_loader` ( :meth:`!importlib.machinery.FileFinder.find_loader` ) now raise :exc:`DeprecationWarning` and are slated for removal in Python 3.12 (previously they were documented as deprecated in Python 3.4). (Contributed by Brett Cannon in :issue:`42135`.)
ru: Различные реализации :meth:`!importlib.abc.MetaPathFinder.find_module` ( :meth:`!importlib.machinery.BuiltinImporter.find_module`, :meth:`!importlib.machinery.FrozenImporter.find_module`, :meth:` !importlib.machinery.WindowsRegistryFinder.find_module`, :meth:`!importlib.machinery.PathFinder.find_module`, :meth:`!importlib.abc.MetaPathFinder.find_module` ), :meth:`!importlib.abc.PathEntryFinder`, :meth:`!importlib.abc.PathEntryFinder. find_module` ( :meth:`!importlib.machinery.FileFinder.find_module` ) и :meth:`!importlib.abc.PathEntryFinder.find_loader` ( :meth:`!importlib.machinery.FileFinder.find_loader` ) теперь вызывают: exc:`DeprecationWarning` и планируется удалить в Python 3.12 (ранее они были задокументированы как устаревшие в Python 3.4). (Предоставлено Бреттом Кэнноном в :issue:`42135`.)

source: :class:`!importlib.abc.Finder` is deprecated (including its sole method, :meth:`!find_module`). Both :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder` no longer inherit from the class. Users should inherit from one of these two classes as appropriate instead. (Contributed by Brett Cannon in :issue:`42135`.)
ru: :class:`!importlib.abc.Finder` устарел (включая его единственный метод :meth:`!find_module`). Оба :class:`importlib.abc.MetaPathFinder` и :class:`importlib.abc.PathEntryFinder` больше не наследуются от класса. Вместо этого пользователи должны наследовать один из этих двух классов, если это необходимо. (Предоставлено Бреттом Кэнноном в :issue:`42135`.)

source: The deprecations of :mod:`!imp`, :func:`!importlib.find_loader`, :func:`!importlib.util.set_package_wrapper`, :func:`!importlib.util.set_loader_wrapper`, :func:`!importlib.util.module_for_loader`, :class:`!pkgutil.ImpImporter`, and :class:`!pkgutil.ImpLoader` have all been updated to list Python 3.12 as the slated version of removal (they began raising :exc:`DeprecationWarning` in previous versions of Python). (Contributed by Brett Cannon in :issue:`43720`.)
ru: Устаревшие :mod:`!imp`, :func:`!importlib.find_loader`, :func:`!importlib.util.set_package_wrapper`, :func:`!importlib.util.set_loader_wrapper`, :func:`! importlib.util.module_for_loader`, :class:`!pkgutil.ImpImporter` и :class:`!pkgutil.ImpLoader` были обновлены, чтобы указать Python 3.12 в качестве запланированной версии удаления (они начали поднимать :exc:`DeprecationWarning ` в предыдущих версиях Python). (Предоставлено Бреттом Кэнноном в :issue:`43720`.)

source: The import system now uses the ``__spec__`` attribute on modules before falling back on :meth:`!module_repr` for a module's ``__repr__()`` method. Removal of the use of ``module_repr()`` is scheduled for Python 3.12. (Contributed by Brett Cannon in :issue:`42137`.)
ru: Система импорта теперь использует атрибут ``__spec__`` для модулей, прежде чем использовать :meth:`!module_repr` для метода ``__repr__()`` модуля. Удаление использования ``module_repr()`` запланировано в Python 3.12. (Предоставлено Бреттом Кэнноном в :issue:`42137`.)

source: :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.machinery.FrozenLoader.module_repr`, and :meth:`!importlib.machinery.BuiltinLoader.module_repr` are deprecated and slated for removal in Python 3.12. (Contributed by Brett Cannon in :issue:`42136`.)
ru: :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.machinery.FrozenLoader.module_repr` и :meth:`!importlib.machinery.BuiltinLoader.module_repr` устарели и планируется удалить в Python 3.12. (Предоставлено Бреттом Кэнноном в :issue:`42136`.)

source: ``sqlite3.OptimizedUnicode`` has been undocumented and obsolete since Python 3.3, when it was made an alias to :class:`str`. It is now deprecated, scheduled for removal in Python 3.12. (Contributed by Erlend E. Aasland in :issue:`42264`.)
ru: ``sqlite3.OptimizedUnicode`` не документирован и устарел начиная с Python 3.3, когда он стал псевдонимом :class:`str`. Сейчас он устарел, и его планируется удалить в Python 3.12. (Предоставлено Эрлендом Э. Осландом в :issue:`42264`.)

source: The undocumented built-in function ``sqlite3.enable_shared_cache`` is now deprecated, scheduled for removal in Python 3.12. Its use is strongly discouraged by the SQLite3 documentation. See `the SQLite3 docs <https://sqlite.org/c3ref/enable_shared_cache.html>`_ for more details. If a shared cache must be used, open the database in URI mode using the ``cache=shared`` query parameter. (Contributed by Erlend E. Aasland in :issue:`24464`.)
ru: Недокументированная встроенная функция sqlite3.enable_shared_cache объявлена ​​устаревшей, ее удаление запланировано в Python 3.12. Его использование категорически не рекомендуется в документации SQLite3. Дополнительную информацию см. в документации по SQLite3 <https://sqlite.org/c3ref/enable_shared_cache.html>`_. Если необходимо использовать общий кеш, откройте базу данных в режиме URI, используя параметр запроса ``cache=shared``. (Предоставлено Эрлендом Э. Осландом в :issue:`24464`.)

source: The following ``threading`` methods are now deprecated:
ru: Следующие методы потоковой обработки объявлены устаревшими:

source: (Contributed by Jelle Zijlstra in :gh:`87889`.)
ru: (Предоставлено Джелле Зийлстра в :gh:`87889`.)

source: :meth:`!pathlib.Path.link_to` is deprecated and slated for removal in Python 3.12. Use :meth:`pathlib.Path.hardlink_to` instead. (Contributed by Barney Gale in :issue:`39950`.)
ru: :meth:`!pathlib.Path.link_to` устарел и планируется удалить в Python 3.12. Вместо этого используйте :meth:`pathlib.Path.hardlink_to`. (Предоставлено Барни Гейлом в :issue:`39950`.)

source: ``cgi.log()`` is deprecated and slated for removal in Python 3.12. (Contributed by Inada Naoki in :issue:`41139`.)
ru: ``cgi.log()`` устарел и его планируется удалить в Python 3.12. (Предоставлено Инадой Наоки в :issue:`41139`.)

source: The following :mod:`ssl` features have been deprecated since Python 3.6, Python 3.7, or OpenSSL 1.1.0 and will be removed in 3.11:
ru: Следующие функции :mod:`ssl` устарели, начиная с Python 3.6, Python 3.7 или OpenSSL 1.1.0, и будут удалены в версии 3.11:

source: :data:`!OP_NO_SSLv2`, :data:`!OP_NO_SSLv3`, :data:`!OP_NO_TLSv1`, :data:`!OP_NO_TLSv1_1`, :data:`!OP_NO_TLSv1_2`, and :data:`!OP_NO_TLSv1_3` are replaced by :attr:`~ssl.SSLContext.minimum_version` and :attr:`~ssl.SSLContext.maximum_version`.
ru: :data:`!OP_NO_SSLv2`, :data:`!OP_NO_SSLv3`, :data:`!OP_NO_TLSv1`, :data:`!OP_NO_TLSv1_1`, :data:`!OP_NO_TLSv1_2` и :data:`!OP_NO_TLSv1_3` заменены с помощью :attr:`~ssl.SSLContext.minimum_version` и :attr:`~ssl.SSLContext.maximum_version`.

source: :data:`!PROTOCOL_SSLv2`, :data:`!PROTOCOL_SSLv3`, :data:`!PROTOCOL_SSLv23`, :data:`!PROTOCOL_TLSv1`, :data:`!PROTOCOL_TLSv1_1`, :data:`!PROTOCOL_TLSv1_2`, and :const:`!PROTOCOL_TLS` are deprecated in favor of :const:`~ssl.PROTOCOL_TLS_CLIENT` and :const:`~ssl.PROTOCOL_TLS_SERVER`
ru: :data:`!PROTOCOL_SSLv2`, :data:`!PROTOCOL_SSLv3`, :data:`!PROTOCOL_SSLv2`, :data:`!PROTOCOL_TLSv1`, :data:`!PROTOCOL_TLSv1_1`, :data:`!PROTOCOL_TLSv1_2`, и : const:`!PROTOCOL_TLS` устарели в пользу :const:`~ssl.PROTOCOL_TLS_CLIENT` и :const:`~ssl.PROTOCOL_TLS_SERVER`

source: :func:`!wrap_socket` is replaced by :meth:`ssl.SSLContext.wrap_socket`
ru: :func:`!wrap_socket` заменяется на :meth:`ssl.SSLContext.wrap_socket`

source: NPN features like :meth:`ssl.SSLSocket.selected_npn_protocol` and :meth:`ssl.SSLContext.set_npn_protocols` are replaced by ALPN.
ru: Функции NPN, такие как :meth:`ssl.SSLSocket.selected_npn_protocol` и :meth:`ssl.SSLContext.set_npn_protocols`, заменяются ALPN.

source: The threading debug (:envvar:`!PYTHONTHREADDEBUG` environment variable) is deprecated in Python 3.10 and will be removed in Python 3.12. This feature requires a :ref:`debug build of Python <debug-build>`. (Contributed by Victor Stinner in :issue:`44584`.)
ru: Отладка потоков (:envvar:`!PYTHONTHREADDEBUG` переменная среды) устарела в Python 3.10 и будет удалена в Python 3.12. Для этой функции требуется :ref:`отладочная сборка Python <debug-build>`. (Предоставлено Виктором Стиннером в :issue:`44584`.)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules will be removed in a future version of Python. Anything belonging to these submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`.)
ru: Импорт из подмодулей ``typing.io`` и ``typing.re`` теперь будет выдавать :exc:`DeprecationWarning`. Эти подмодули будут удалены в будущей версии Python. Вместо этого все, что принадлежит этим подмодулям, должно быть импортировано непосредственно из :mod:`typing`. (Предоставлено Себастьяном Риттау в :issue:`38291`.)

source: Removed
ru: Удалено

source: Removed special methods ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` and ``__rdivmod__`` of the :class:`complex` class. They always raised a :exc:`TypeError`. (Contributed by Serhiy Storchaka in :issue:`41974`.)
ru: Удалены специальные методы ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` и ``__rdivmod__`` класса :class:`complex`. Они всегда выдавали :exc:`TypeError`. (Предоставлено Сергеем Сторчакой в ​​:issue:`41974`.)

source: The ``ParserBase.error()`` method from the private and undocumented ``_markupbase`` module has been removed. :class:`html.parser.HTMLParser` is the only subclass of ``ParserBase`` and its ``error()`` implementation was already removed in Python 3.5. (Contributed by Berker Peksag in :issue:`31844`.)
ru: Метод ParserBase.error() из закрытого и недокументированного модуля _markupbase был удален. :class:`html.parser.HTMLParser` — единственный подкласс ``ParserBase``, и его реализация ``error()`` уже была удалена в Python 3.5. (Предоставлено Беркером Пексагом в :issue:`31844`.)

source: Removed the ``unicodedata.ucnhash_CAPI`` attribute which was an internal PyCapsule object. The related private ``_PyUnicode_Name_CAPI`` structure was moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
ru: Удален атрибут unicodedata.ucnhash_CAPI, который был внутренним объектом PyCapsule. Соответствующая частная структура ``_PyUnicode_Name_CAPI`` была перенесена во внутренний C API. (Предоставлено Виктором Стиннером в :issue:`42157`.)

source: Removed the ``parser`` module, which was deprecated in 3.9 due to the switch to the new PEG parser, as well as all the C source and header files that were only being used by the old parser, including ``node.h``, ``parser.h``, ``graminit.h`` and ``grammar.h``.
ru: Удален модуль ``parser``, который устарел в версии 3.9 из-за перехода на новый PEG-парсер, а также все исходные файлы C и файлы заголовков, которые использовались только старым парсером, включая ``node.h'. ``, ``parser.h``, ``graminit.h`` и ``grammar.h``.

source: Removed the Public C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags`` and ``PyNode_Compile`` that were deprecated in 3.9 due to the switch to the new PEG parser.
ru: Удалены функции Public C API PyParser_SimpleParseStringFlags, PyParser_SimpleParseStringFlagsFilename, PyParser_SimpleParseFileFlags и PyNode_Compile, которые устарели в версии 3.9 из-за перехода на новый парсер PEG.

source: Removed the ``formatter`` module, which was deprecated in Python 3.4. It is somewhat obsolete, little used, and not tested. It was originally scheduled to be removed in Python 3.6, but such removals were delayed until after Python 2.7 EOL. Existing users should copy whatever classes they use into their code. (Contributed by Donghee Na and Terry J. Reedy in :issue:`42299`.)
ru: Удален модуль форматирования, который устарел в Python 3.4. Он несколько устарел, мало используется и не тестировался. Первоначально его планировалось удалить в Python 3.6, но такое удаление было отложено до окончания выпуска Python 2.7. Существующим пользователям следует скопировать все используемые ими классы в свой код. (Предоставлено Донхи На и Терри Дж. Риди в :issue:`42299`.)

source: Removed the :c:func:`!PyModule_GetWarningsModule` function that was useless now due to the :mod:`!_warnings` module was converted to a builtin module in 2.6. (Contributed by Hai Shi in :issue:`42599`.)
ru: Удалена функция :c:func:`!PyModule_GetWarningsModule`, которая теперь была бесполезна, поскольку модуль :mod:`!_warnings` был преобразован во встроенный модуль в версии 2.6. (Предоставлено Хай Ши в :issue:`42599`.)

source: Remove deprecated aliases to :ref:`collections-abstract-base-classes` from the :mod:`collections` module. (Contributed by Victor Stinner in :issue:`37324`.)
ru: Удалите устаревшие псевдонимы :ref:`collections-abstract-base-classes` из модуля :mod:`collections`. (Предоставлено Виктором Стиннером в :issue:`37324`.)

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8. The motivation behind this change is multifold:
ru: Параметр ``loop`` был удален из большей части :doc:`высокоуровневого API <../library/asyncio-api-index>` :mod:`asyncio`\ после его устаревания в Python 3.8. Мотивация этого изменения множественна:

source: This simplifies the high-level API.
ru: Это упрощает API высокого уровня.

source: The functions in the high-level API have been implicitly getting the current thread's running event loop since Python 3.7. There isn't a need to pass the event loop to the API in most normal use cases.
ru: Функции в API высокого уровня неявно получают цикл событий текущего потока, начиная с Python 3.7. В большинстве обычных случаев использования нет необходимости передавать цикл событий в API.

source: Event loop passing is error-prone especially when dealing with loops running in different threads.
ru: Передача цикла событий подвержена ошибкам, особенно при работе с циклами, выполняемыми в разных потоках.

source: Note that the low-level API will still accept ``loop``. See :ref:`changes-python-api` for examples of how to replace existing code.
ru: Обратите внимание, что низкоуровневый API по-прежнему будет принимать цикл. См. :ref:`changes-python-api` для примеров замены существующего кода.

source: Porting to Python 3.10
ru: Портирование на Python 3.10

source: This section lists previously described changes and other bugfixes that may require changes to your code.
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код.

source: Changes in the Python syntax
ru: Изменения в синтаксисе Python
