Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.10.po
Languages: ru

source: The ``__args__`` of the :ref:`parameterized generic <types-genericalias>` for :class:`collections.abc.Callable` are now consistent with :data:`typing.Callable`. :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Note that a :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
ru: ``__args__`` параметризованного универсального <types-genericalias>` для :class:`collections.abc.Callable` теперь соответствуют :data:`typing.Callable`. :class:`collections.abc.Callable` универсальный теперь выравнивает параметры типа, аналогично тому, что сейчас делает :data:`typing.Callable`. Это означает, что ``collections.abc.Callable[[int, str], str]`` будет иметь ``__args__`` из ``(int, str, str)``; раньше это было ``([int, str], str)``. Чтобы разрешить это изменение, :class:`types.GenericAlias` теперь может быть подклассом, и подкласс будет возвращен при подписке на тип :class:`collections.abc.Callable`. Обратите внимание, что :exc:`TypeError` может быть вызвано для недопустимых форм параметризации :class:`collections.abc.Callable`, которые могли передаваться автоматически в Python 3.9. (Предоставлено Кеном Джином в :issue:`42195`.)

source: Add a :func:`contextlib.aclosing` context manager to safely close async generators and objects representing asynchronously released resources. (Contributed by Joongi Kim and John Belmonte in :issue:`41229`.)
ru: Добавьте контекстный менеджер :func:`contextlib.aclosing` для безопасного закрытия асинхронных генераторов и объектов, представляющих асинхронно выпущенные ресурсы. (Предоставлено Джунги Кимом и Джоном Бельмонте в :issue:`41229`.)

source: Add asynchronous context manager support to :func:`contextlib.nullcontext`. (Contributed by Tom Gringauz in :issue:`41543`.)
ru: Добавьте поддержку асинхронного контекстного менеджера в :func:`contextlib.nullcontext`. (Предоставлено Томом Грингаузом в :issue:`41543`.)

source: Add :class:`~contextlib.AsyncContextDecorator`, for supporting usage of async context managers as decorators.
ru: Добавьте :class:`~contextlib.AsyncContextDecorator` для поддержки использования асинхронных менеджеров контекста в качестве декораторов.

source: The extended color functions added in ncurses 6.1 will be used transparently by :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair`, and :func:`curses.pair_content`. A new function, :func:`curses.has_extended_color_support`, indicates whether extended color support is provided by the underlying ncurses library. (Contributed by Jeffrey Kintscher and Hans Petter Jansson in :issue:`36982`.)
ru: Расширенные функции цвета, добавленные в ncurses 6.1, будут прозрачно использоваться :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair` и :func:`curses.pair_content`. Новая функция :func:`curses.has_extended_color_support` указывает, обеспечивается ли расширенная поддержка цвета базовой библиотекой ncurses. (Предоставлено Джеффри Кинчером и Хансом Петтером Янссоном в :issue:`36982`.)

source: The ``BUTTON5_*`` constants are now exposed in the :mod:`curses` module if they are provided by the underlying curses library. (Contributed by Zackery Spytz in :issue:`39273`.)
ru: Константы ``BUTTON5_*`` теперь доступны в модуле :mod:`curses`, если они предоставляются базовой библиотекой Curses. (Предоставлено Закери Шпитцем в :issue:`39273`.)

source: dataclasses
ru: классы данных

source: Added ``slots`` parameter in :func:`dataclasses.dataclass` decorator. (Contributed by Yurii Karabas in :issue:`42269`)
ru: Добавлен параметр slots в декоратор :func:`dataclasses.dataclass`. (Размещено Юрием Карабасом в :issue:`42269`)

source: Keyword-only fields
ru: Поля только для ключевых слов

source: dataclasses now supports fields that are keyword-only in the generated __init__ method. There are a number of ways of specifying keyword-only fields.
ru: dataclasses теперь поддерживает поля, которые содержат только ключевые слова в сгенерированном методе __init__. Существует несколько способов указания полей, содержащих только ключевые слова.

source: You can say that every field is keyword-only:
ru: Вы можете сказать, что каждое поле содержит только ключевые слова:

source: Both ``name`` and ``birthday`` are keyword-only parameters to the generated __init__ method.
ru: И ``name``, и ``birthday`` являются параметрами, состоящими только из ключевых слов, для сгенерированного метода __init__.

source: You can specify keyword-only on a per-field basis:
ru: Вы можете указать только ключевые слова для каждого поля:

source: Here only ``birthday`` is keyword-only. If you set ``kw_only`` on individual fields, be aware that there are rules about re-ordering fields due to keyword-only fields needing to follow non-keyword-only fields. See the full dataclasses documentation for details.
ru: Здесь только слово «день рождения» содержит только ключевые слова. Если вы устанавливаете kw_only для отдельных полей, имейте в виду, что существуют правила изменения порядка полей, поскольку поля, содержащие только ключевые слова, должны следовать за полями, не содержащими только ключевые слова. Подробности смотрите в полной документации по классам данных.

source: You can also specify that all fields following a KW_ONLY marker are keyword-only. This will probably be the most common usage:
ru: Вы также можете указать, что все поля, следующие за маркером KW_ONLY, предназначены только для ключевых слов. Вероятно, это будет наиболее распространенное использование:

source: Here, ``z`` and ``t`` are keyword-only parameters, while ``x`` and ``y`` are not. (Contributed by Eric V. Smith in :issue:`43532`.)
ru: Здесь ``z`` и ``t`` являются параметрами только с ключевыми словами, а ``x`` и ``y`` — нет. (Предоставлено Эриком В. Смитом в :issue:`43532`.)

source: The entire ``distutils`` package is deprecated, to be removed in Python 3.12. Its functionality for specifying package builds has already been completely replaced by third-party packages ``setuptools`` and ``packaging``, and most other commonly used APIs are available elsewhere in the standard library (such as :mod:`platform`, :mod:`shutil`, :mod:`subprocess` or :mod:`sysconfig`). There are no plans to migrate any other functionality from ``distutils``, and applications that are using other functions should plan to make private copies of the code. Refer to :pep:`632` for discussion.
ru: Весь пакет distutils устарел и будет удален в Python 3.12. Его функциональность по указанию сборок пакетов уже полностью заменена сторонними пакетами ``setuptools`` и ``packaging``, а большинство других часто используемых API доступны в других местах стандартной библиотеки (например, :mod:`platform`). , :mod:`shutil`, :mod:`subprocess` или :mod:`sysconfig`). Планов по переносу каких-либо других функций из distutils нет, и приложения, использующие другие функции, должны планировать создание частных копий кода. Обратитесь к :pep:`632` для обсуждения.

source: The ``bdist_wininst`` command deprecated in Python 3.8 has been removed. The ``bdist_wheel`` command is now recommended to distribute binary packages on Windows. (Contributed by Victor Stinner in :issue:`42802`.)
ru: Команда bdist_wininst, устаревшая в Python 3.8, была удалена. Команда ``bdist_wheel`` теперь рекомендуется для распространения бинарных пакетов в Windows. (Предоставлено Виктором Стиннером в :issue:`42802`.)

source: When a module does not define ``__loader__``, fall back to ``__spec__.loader``. (Contributed by Brett Cannon in :issue:`42133`.)
ru: Если модуль не определяет ``__loader__``, вернитесь к ``__spec__.loader``. (Предоставлено Бреттом Кэнноном в :issue:`42133`.)

source: encodings
ru: кодировки

source: :func:`encodings.normalize_encoding` now ignores non-ASCII characters. (Contributed by Hai Shi in :issue:`39337`.)
ru: :func:`encodings.normalize_encoding` теперь игнорирует символы, отличные от ASCII. (Предоставлено Хай Ши в :issue:`39337`.)

source: :class:`~enum.Enum` :func:`~object.__repr__` now returns ``enum_name.member_name`` and :func:`~object.__str__` now returns ``member_name``. Stdlib enums available as module constants have a :func:`repr` of ``module_name.member_name``. (Contributed by Ethan Furman in :issue:`40066`.)
ru: :class:`~enum.Enum` :func:`~object.__repr__` теперь возвращает ``enum_name.member_name``, а :func:`~object.__str__` теперь возвращает ``member_name``. Перечисления Stdlib, доступные как константы модуля, имеют :func:`repr` ``имя_модуля.имя_члена``. (Предоставлено Итаном Фурманом в :issue:`40066`.)

source: Add :class:`enum.StrEnum` for enums where all members are strings. (Contributed by Ethan Furman in :issue:`41816`.)
ru: Добавьте :class:`enum.StrEnum` для перечислений, все члены которых являются строками. (Предоставлено Итаном Фурманом в :issue:`41816`.)

source: Add *encoding* and *errors* parameters in :func:`fileinput.input` and :class:`fileinput.FileInput`. (Contributed by Inada Naoki in :issue:`43712`.)
ru: Добавьте параметры *encoding* и *errors* в :func:`fileinput.input` и :class:`fileinput.FileInput`. (Предоставлено Инадой Наоки в :issue:`43712`.)

source: :func:`fileinput.hook_compressed` now returns :class:`~io.TextIOWrapper` object when *mode* is "r" and file is compressed, like uncompressed files. (Contributed by Inada Naoki in :issue:`5758`.)
ru: :func:`fileinput.hook_compressed` теперь возвращает объект :class:`~io.TextIOWrapper`, когда *mode* равен "r" и файл сжат, как несжатые файлы. (Предоставлено Инадой Наоки в :issue:`5758`.)

source: The :mod:`faulthandler` module now detects if a fatal error occurs during a garbage collector collection. (Contributed by Victor Stinner in :issue:`44466`.)
ru: Модуль :mod:`faulthandler` теперь определяет, произошла ли фатальная ошибка во время сборки мусора. (Предоставлено Виктором Стиннером в :issue:`44466`.)

source: Add audit hooks for :func:`gc.get_objects`, :func:`gc.get_referrers` and :func:`gc.get_referents`. (Contributed by Pablo Galindo in :issue:`43439`.)
ru: Добавьте перехватчики аудита для :func:`gc.get_objects`, :func:`gc.get_referrers` и :func:`gc.get_referents`. (Предоставлено Пабло Галиндо в :issue:`43439`.)

source: Add the *root_dir* and *dir_fd* parameters in :func:`~glob.glob` and :func:`~glob.iglob` which allow to specify the root directory for searching. (Contributed by Serhiy Storchaka in :issue:`38144`.)
ru: Добавьте параметры *root_dir* и *dir_fd* в :func:`~glob.glob` и :func:`~glob.iglob`, которые позволяют указать корневой каталог для поиска. (Предоставлено Сергеем Сторчакой в ​​:issue:`38144`.)

source: The hashlib module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
ru: Для модуля hashlib требуется OpenSSL 1.1.1 или новее. (Предоставлено Кристианом Хаймсом в :pep:`644` и :issue:`43669`.)

source: The hashlib module has preliminary support for OpenSSL 3.0.0. (Contributed by Christian Heimes in :issue:`38820` and other issues.)
ru: Модуль hashlib имеет предварительную поддержку OpenSSL 3.0.0. (Предоставлено Кристианом Хаймсом в :issue:`38820` и других выпусках.)

source: The pure-Python fallback of :func:`~hashlib.pbkdf2_hmac` is deprecated. In the future PBKDF2-HMAC will only be available when Python has been built with OpenSSL support. (Contributed by Christian Heimes in :issue:`43880`.)
ru: Резервный вариант :func:`~hashlib.pbkdf2_hmac` для чистого Python устарел. В будущем PBKDF2-HMAC будет доступен только в том случае, если Python будет собран с поддержкой OpenSSL. (Предоставлено Кристианом Хаймсом в :issue:`43880`.)

source: The hmac module now uses OpenSSL's HMAC implementation internally. (Contributed by Christian Heimes in :issue:`40645`.)
ru: Модуль hmac теперь использует внутреннюю реализацию HMAC OpenSSL. (Предоставлено Кристианом Хаймсом в :issue:`40645`.)

source: IDLE and idlelib
ru: IDLE и idlelib

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
ru: Заставьте IDLE вызывать :func:`sys.excepthook` (при запуске без '-n'). Пользовательские перехваты ранее игнорировались. (Предоставлено Кеном Хилтоном в :issue:`43008`.)

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
ru: Переупорядочить диалоговое окно настроек. Разделить вкладку «Общие» на вкладки «Windows» и «Shell/Ed». Переместить источники справки, которые расширяют меню «Справка», на вкладку «Расширения». Освободить место для новых параметров и сократить диалоговое окно. Последнее позволяет лучше разместить диалоговое окно на небольших экранах. (Предоставлено Терри Яном Риди в :issue:`40468`.) Переместить настройку отступа с вкладки «Шрифт» на новую вкладку «Windows». (Предоставлено Марком Роземаном и Терри Яном Риди в :issue:`33962`.)

source: The changes above were backported to a 3.9 maintenance release.
ru: Вышеупомянутые изменения были перенесены в поддерживающую версию 3.9.

source: Add a Shell sidebar. Move the primary prompt ('>>>') to the sidebar. Add secondary prompts ('...') to the sidebar. Left click and optional drag selects one or more lines of text, as with the editor line number sidebar. Right click after selecting text lines displays a context menu with 'copy with prompts'. This zips together prompts from the sidebar with lines from the selected text. This option also appears on the context menu for the text. (Contributed by Tal Einat in :issue:`37903`.)
ru: Добавьте боковую панель Shell. Переместите основное приглашение («>>>>) на боковую панель. Добавьте дополнительные подсказки («...») на боковую панель. Щелкните левой кнопкой мыши и при необходимости перетащите одну или несколько строк текста, как в случае с боковой панелью номера строки редактора. Щелкните правой кнопкой мыши после выбора текстовых строк, чтобы открыть контекстное меню с пунктом «Копировать с подсказками». При этом подсказки боковой панели объединяются со строками выделенного текста. Эта опция также появляется в контекстном меню текста. (Предоставлено Талом Эйнатом в :issue:`37903`.)

source: Use spaces instead of tabs to indent interactive code. This makes interactive code entries 'look right'. Making this feasible was a major motivation for adding the shell sidebar. (Contributed by Terry Jan Reedy in :issue:`37892`.)
ru: Используйте пробелы вместо табуляции для отступов интерактивного кода. Благодаря этому записи интерактивного кода выглядят «правильно». Сделать это возможным было основной мотивацией для добавления боковой панели оболочки. (Предоставлено Терри Яном Риди в :issue:`37892`.)

source: Highlight the new :ref:`soft keywords <soft-keywords>` :keyword:`match`, :keyword:`case <match>`, and :keyword:`_ <wildcard-patterns>` in pattern-matching statements. However, this highlighting is not perfect and will be incorrect in some rare cases, including some ``_``-s in ``case`` patterns. (Contributed by Tal Einat in :issue:`44010`.)
ru: Выделите новые :ref:`мягкие ключевые слова <soft-keywords>` :keyword:`match`, :keyword:`case <match>` и :keyword:`_ <wildcard-patterns>` в операторах сопоставления с образцом. Однако такое выделение не идеально и в некоторых редких случаях будет неправильным, включая некоторые ``_``-ы в шаблонах ``case``. (Предоставлено Талом Эйнатом в :issue:`44010`.)

source: New in 3.10 maintenance releases.
ru: Новое в версиях обслуживания 3.10.

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
ru: Примените подсветку синтаксиса к файлам ``.pyi``. (Предоставлено Алексом Вэйгудом и Терри Джен Риди в :issue:`45447`.)

source: Include prompts when saving Shell with inputs and outputs. (Contributed by Terry Jan Reedy in :gh:`95191`.)
ru: Включите подсказки при сохранении Shell с входными и выходными данными. (Предоставлено Терри Яном Риди в :gh:`95191`.)

source: Feature parity with ``importlib_metadata`` 4.6 (`history <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).
ru: Паритет функций с ``importlib_metadata`` 4.6 (`история <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).

source: :ref:`importlib.metadata entry points <entry-points>` now provide a nicer experience for selecting entry points by group and name through a new :ref:`importlib.metadata.EntryPoints <entry-points>` class. See the Compatibility Note in the docs for more info on the deprecation and usage.
ru: :ref:`importlib.metadata точки входа <entry-points>` теперь предоставляют более удобный интерфейс для выбора точек входа по группе и имени с помощью нового :ref:`importlib.metadata.EntryPoints <entry-points>` класса. Дополнительную информацию об устаревании и использовании см. в примечании о совместимости в документации.

source: Added :ref:`importlib.metadata.packages_distributions() <package-distributions>` for resolving top-level Python modules and packages to their :ref:`importlib.metadata.Distribution <distributions>`.
ru: Добавлен :ref:`importlib.metadata.packages_distributions() <package-distributions>` для разрешения модулей и пакетов Python верхнего уровня в их :ref:`importlib.metadata.Distribution <distributions>`.

source: Add :func:`inspect.get_annotations`, which safely computes the annotations defined on an object. It works around the quirks of accessing the annotations on various types of objects, and makes very few assumptions about the object it examines. :func:`inspect.get_annotations` can also correctly un-stringize stringized annotations. :func:`inspect.get_annotations` is now considered best practice for accessing the annotations dict defined on any Python object; for more information on best practices for working with annotations, please see :ref:`annotations-howto`. Relatedly, :func:`inspect.signature`, :func:`inspect.Signature.from_callable`, and :func:`!inspect.Signature.from_function` now call :func:`inspect.get_annotations` to retrieve annotations. This means :func:`inspect.signature` and :func:`inspect.Signature.from_callable` can also now un-stringize stringized annotations. (Contributed by Larry Hastings in :issue:`43817`.)
ru: Добавьте :func:`inspect.get_annotations`, который безопасно вычисляет аннотации, определенные для объекта. Он обходит особенности доступа к аннотациям различных типов объектов и делает очень мало предположений относительно проверяемого объекта. :func:`inspect.get_annotations` также может корректно растягивать строковые аннотации. :func:`inspect.get_annotations` теперь считается лучшей практикой для доступа к аннотациям, определенным для любого объекта Python; Для получения дополнительной информации о лучших методах работы с аннотациями см. :ref:`annotations-howto`. Соответственно, :func:`inspect.signature`, :func:`inspect.Signature.from_callable` и :func:`!inspect.Signature.from_function` теперь вызывают :func:`inspect.get_annotations` для получения аннотаций. Это означает, что :func:`inspect.signature` и :func:`inspect.Signature.from_callable` теперь также могут распаковывать строковые аннотации. (Предоставлено Ларри Гастингсом в :issue:`43817`.)

source: Add :func:`itertools.pairwise`. (Contributed by Raymond Hettinger in :issue:`38200`.)
ru: Добавьте :func: `itertools`. (Предоставлено Рэймондом Хеттингером в :issue:`38200`.)

source: Add :func:`os.cpu_count` support for VxWorks RTOS. (Contributed by Peixing Xin in :issue:`41440`.)
ru: Добавьте поддержку :func:`os.cpu_count` для VxWorks RTOS. (Предоставлено Пейсин Синь в :issue:`41440`.)

source: Add a new function :func:`os.eventfd` and related helpers to wrap the ``eventfd2`` syscall on Linux. (Contributed by Christian Heimes in :issue:`41001`.)
ru: Добавьте новую функцию :func:`os.eventfd` и связанные с ней помощники для обертывания системного вызова ``eventfd2`` в Linux. (Предоставлено Кристианом Хаймсом в :issue:`41001`.)

source: Add :func:`os.splice` that allows to move data between two file descriptors without copying between kernel address space and user address space, where one of the file descriptors must refer to a pipe. (Contributed by Pablo Galindo in :issue:`41625`.)
ru: Добавьте :func:`os.splice`, который позволяет перемещать данные между двумя файловыми дескрипторами без копирования между адресным пространством ядра и адресным пространством пользователя, где один из файловых дескрипторов должен ссылаться на канал. (Предоставлено Пабло Галиндо в :issue:`41625`.)

source: Add :const:`~os.O_EVTONLY`, :const:`~os.O_FSYNC`, :const:`~os.O_SYMLINK` and :const:`~os.O_NOFOLLOW_ANY` for macOS. (Contributed by Donghee Na in :issue:`43106`.)
ru: Добавьте :const:`~os.O_EVTONLY`, :const:`~os.O_FSYNC`, :const:`~os.O_SYMLINK` и :const:`~os.O_NOFOLLOW_ANY` для macOS. (Предоставлено Донхи На в :issue:`43106`.)

source: :func:`os.path.realpath` now accepts a *strict* keyword-only argument. When set to ``True``, :exc:`OSError` is raised if a path doesn't exist or a symlink loop is encountered. (Contributed by Barney Gale in :issue:`43757`.)
ru: :func:`os.path.realpath` теперь принимает аргумент *strict*, содержащий только ключевые слова. Если установлено значение ``True``, :exc:`OSError` вызывается, если путь не существует или встречается цикл символической ссылки. (Предоставлено Барни Гейлом в :issue:`43757`.)

source: Add slice support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Joshua Cannon in :issue:`35498`.)
ru: Добавьте поддержку фрагментов в :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Предоставлено Джошуа Кэнноном в :issue:`35498`.)

source: Add negative indexing support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Yaroslav Pankovych in :issue:`21041`.)
ru: Добавьте поддержку отрицательной индексации в :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Добавлен Ярославом Панковичем в :issue:`21041`.)

source: Add :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>` method that supersedes :meth:`!link_to`. The new method has the same argument order as :meth:`~pathlib.Path.symlink_to`. (Contributed by Barney Gale in :issue:`39950`.)
ru: Добавьте метод :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>`, который заменяет :meth:`!link_to`. Новый метод имеет тот же порядок аргументов, что и :meth:`~pathlib.Path.symlink_to`. (Предоставлено Барни Гейлом в :issue:`39950`.)

source: :meth:`pathlib.Path.stat` and :meth:`~pathlib.Path.chmod` now accept a *follow_symlinks* keyword-only argument for consistency with corresponding functions in the :mod:`os` module. (Contributed by Barney Gale in :issue:`39906`.)
ru: :meth:`pathlib.Path.stat` и :meth:`~pathlib.Path.chmod` теперь принимают аргумент, содержащий только ключевое слово *follow_symlinks*, для согласованности с соответствующими функциями в модуле :mod:`os`. (Предоставлено Барни Гейлом в :issue:`39906`.)

source: platform
ru: платформа
