Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: The :func:`gzip.compress` function is now faster when used with the **mtime=0** argument as it delegates the compression entirely to a single :func:`zlib.compress` operation. There is one side effect of this change: The gzip file header contains an "OS" byte in its header. That was traditionally always set to a value of 255 representing "unknown" by the :mod:`gzip` module. Now, when using :func:`~gzip.compress` with **mtime=0**, it may be set to a different value by the underlying zlib C library Python was linked against. (See :gh:`112346` for details on the side effect.)
sv: Funktionen :func:`gzip.compress` är nu snabbare när den används med argumentet **mtime=0** eftersom den delegerar komprimeringen helt till en enda :func:`zlib.compress`\-operation. Det finns en bieffekt av denna förändring: Filhuvudet för gzip innehåller en "OS"-byte i sitt huvud. Den sattes traditionellt alltid till ett värde av 255 som representerar "unknown" av modulen :mod:`gzip`. Nu, när du använder :func:`~gzip.compress` med **mtime=0**, kan det sättas till ett annat värde av det underliggande zlib C-biblioteket som Python länkades mot. (Se :gh:`112346` för detaljer om bieffekten)

source: :func:`hashlib.blake2b` and :func:`hashlib.blake2s` now prefer `libb2`_ over Python's vendored copy. (Contributed by Christian Heimes in :issue:`47095`.)
sv: :func:`hashlib.blake2b` och :func:`hashlib.blake2s` föredrar nu `libb2`_ framför Pythons vendored copy. (Bidrag från Christian Heimes i :issue:`47095`.)

source: The internal ``_sha3`` module with SHA3 and SHAKE algorithms now uses *tiny_sha3* instead of the *Keccak Code Package* to reduce code and binary size. The :mod:`hashlib` module prefers optimized SHA3 and SHAKE implementations from OpenSSL. The change affects only installations without OpenSSL support. (Contributed by Christian Heimes in :issue:`47098`.)
sv: Den interna modulen ``_sha3`` med SHA3- och SHAKE-algoritmer använder nu *tiny_sha3* i stället för *Keccak Code Package* för att minska storleken på kod och binärfiler. Modulen :mod:`hashlib` föredrar optimerade SHA3- och SHAKE-implementeringar från OpenSSL. Ändringen påverkar endast installationer utan OpenSSL-stöd. (Bidrag från Christian Heimes i :issue:`47098`.)

source: Add :func:`hashlib.file_digest`, a helper function for efficient hashing of files or file-like objects. (Contributed by Christian Heimes in :gh:`89313`.)
sv: Lägg till :func:`hashlib.file_digest`, en hjälpfunktion för effektiv hashing av filer eller filliknande objekt. (Bidrag från Christian Heimes i :gh:`89313`.)

source: IDLE and idlelib
sv: IDLE och idlelib

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
sv: Tillämpa syntaxmarkering på ``.pyi``\-filer. (Bidrag från Alex Waygood och Terry Jan Reedy i :issue:`45447`.)

source: Include prompts when saving Shell with inputs and outputs. (Contributed by Terry Jan Reedy in :gh:`95191`.)
sv: Inkludera uppmaningar när du sparar Shell med in- och utgångar. (Bidrag från Terry Jan Reedy i :gh:`95191`.)

source: inspect
sv: inspektera

source: Add :func:`~inspect.getmembers_static` to return all members without triggering dynamic lookup via the descriptor protocol. (Contributed by Weipeng Hong in :issue:`30533`.)
sv: Lägg till :func:`~inspect.getmembers_static` för att returnera alla medlemmar utan att utlösa dynamisk uppslagning via descriptor-protokollet. (Bidrag från Weipeng Hong i :issue:`30533`.)

source: Add :func:`~inspect.ismethodwrapper` for checking if the type of an object is a :class:`~types.MethodWrapperType`. (Contributed by Hakan Çelik in :issue:`29418`.)
sv: Lägg till :func:`~inspect.ismethodwrapper` för att kontrollera om typen av ett objekt är en :class:`~types.MethodWrapperType`. (Bidrag från Hakan Çelik i :issue:`29418`.)

source: Change the frame-related functions in the :mod:`inspect` module to return new :class:`~inspect.FrameInfo` and :class:`~inspect.Traceback` class instances (backwards compatible with the previous :term:`named tuple`-like interfaces) that includes the extended :pep:`657` position information (end line number, column and end column). The affected functions are:
sv: Ändra de ramrelaterade funktionerna i modulen :mod:`inspect` så att de returnerar nya :class:`~inspect.FrameInfo`\- och :class:`~inspect.Traceback`\-klassinstanser (bakåtkompatibla med de tidigare :term:`named tuple`\-liknande gränssnitten) som innehåller den utökade :pep:`657`\-positionsinformationen (slutradnummer, kolumn och slutkolumn). De funktioner som påverkas är:

source: (Contributed by Pablo Galindo in :gh:`88116`.)
sv: (Bidrag från Pablo Galindo i :gh:`88116`.)

source: locale
sv: lokal

source: Add :func:`locale.getencoding` to get the current locale encoding. It is similar to ``locale.getpreferredencoding(False)`` but ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
sv: Lägg till :func:`locale.getencoding` för att hämta den aktuella locale-kodningen. Det liknar ``locale.getpreferredencoding(False)`` men ignorerar :ref:`Python UTF-8 Mode <utf8-mode>`.

source: logging
sv: loggning

source: Added :func:`~logging.getLevelNamesMapping` to return a mapping from logging level names (e.g. ``'CRITICAL'``) to the values of their corresponding :ref:`levels` (e.g. ``50``, by default). (Contributed by Andrei Kulakovin in :gh:`88024`.)
sv: Lade till :func:`~logging.getLevelNamesMapping` för att returnera en mappning från namn på loggningsnivåer (t.ex. ``'CRITICAL'``) till värdena för motsvarande :ref:`levels` (t.ex. ``50``, som standard). (Bidrag från Andrei Kulakovin i :gh:`88024`.)

source: Added a :meth:`~logging.handlers.SysLogHandler.createSocket` method to :class:`~logging.handlers.SysLogHandler`, to match :meth:`SocketHandler.createSocket() <logging.handlers.SocketHandler.createSocket>`. It is called automatically during handler initialization and when emitting an event, if there is no active socket. (Contributed by Kirill Pinchuk in :gh:`88457`.)
sv: Lagt till en :meth:`~logging.handlers.SysLogHandler.createSocket`\-metod till :class:`~logging.handlers.SysLogHandler` för att matcha :meth:`SocketHandler.createSocket() <logging.handlers.SocketHandler.createSocket>`. Den anropas automatiskt under initialiseringen av handlaren och när en händelse skickas ut, om det inte finns någon aktiv socket. (Bidrag från Kirill Pinchuk i :gh:`88457`.)

source: math
sv: matematik

source: Add :func:`math.exp2`: return 2 raised to the power of x. (Contributed by Gideon Mitchell in :issue:`45917`.)
sv: Lägg till :func:`math.exp2`: returnera 2 upphöjt till x. (Bidrag från Gideon Mitchell i :issue:`45917`.)

source: Add :func:`math.cbrt`: return the cube root of x. (Contributed by Ajith Ramachandran in :issue:`44357`.)
sv: Lägg till :func:`math.cbrt`: returnera kubikroten av x. (Bidrag från Ajith Ramachandran i :issue:`44357`.)

source: The behaviour of two :func:`math.pow` corner cases was changed, for consistency with the IEEE 754 specification. The operations ``math.pow(0.0, -math.inf)`` and ``math.pow(-0.0, -math.inf)`` now return ``inf``. Previously they raised :exc:`ValueError`. (Contributed by Mark Dickinson in :issue:`44339`.)
sv: Beteendet för två :func:`math.pow`\-hörnfall har ändrats för att överensstämma med IEEE 754-specifikationen. Operationerna ``math.pow(0.0, -math.inf)`` och ``math.pow(-0.0, -math.inf)`` returnerar nu ``inf``. Tidigare gav de :exc:`ValueError`. (Bidrag från Mark Dickinson i :issue:`44339`.)

source: The :data:`math.nan` value is now always available. (Contributed by Victor Stinner in :issue:`46917`.)
sv: Värdet :data:`math.nan` är nu alltid tillgängligt. (Bidrag från Victor Stinner i :issue:`46917`.)

source: A new function ``operator.call`` has been added, such that ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)``. (Contributed by Antony Lee in :issue:`44019`.)
sv: En ny funktion ``operator.call`` har lagts till, så att ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)``. (Bidrag från Antony Lee i :issue:`44019`.)

source: On Windows, :func:`os.urandom` now uses ``BCryptGenRandom()``, instead of ``CryptGenRandom()`` which is deprecated. (Contributed by Donghee Na in :issue:`44611`.)
sv: På Windows använder :func:`os.urandom` nu ``BCryptGenRandom()``, istället för ``CryptGenRandom()`` som är föråldrad. (Bidrag från Donghee Na i :issue:`44611`.)

source: pathlib
sv: sökväg

source: :meth:`~pathlib.Path.glob` and :meth:`~pathlib.Path.rglob` return only directories if *pattern* ends with a pathname components separator: :data:`~os.sep` or :data:`~os.altsep`. (Contributed by Eisuke Kawasima in :issue:`22276` and :issue:`33392`.)
sv: :meth:`~pathlib.Path.glob` och :meth:`~pathlib.Path.rglob` returnerar endast kataloger om *mönster* slutar med en komponentavgränsare för sökvägsnamn: :data:`~os.sep` eller :data:`~os.altsep`. (Bidrag från Eisuke Kawasima i :issue:`22276` och :issue:`33392`.)

source: Atomic grouping (``(?>...)``) and possessive quantifiers (``*+``, ``++``, ``?+``, ``{m,n}+``) are now supported in regular expressions. (Contributed by Jeffrey C. Jacobs and Serhiy Storchaka in :issue:`433030`.)
sv: Atomgruppering (``(?>...)``) och possessiva kvantifierare (``*+``, ``++``, ``?+``, ``{m,n}+``) stöds nu i reguljära uttryck. (Bidrag från Jeffrey C. Jacobs och Serhiy Storchaka i :issue:`433030`.)

source: Add optional parameter *dir_fd* in :func:`shutil.rmtree`. (Contributed by Serhiy Storchaka in :issue:`46245`.)
sv: Lägg till valfri parameter *dir_fd* i :func:`shutil.rmtree`. (Bidrag från Serhiy Storchaka i :issue:`46245`.)

source: socket
sv: kortplats

source: Add CAN Socket support for NetBSD. (Contributed by Thomas Klausner in :issue:`30512`.)
sv: Lägg till stöd för CAN Socket för NetBSD. (Bidrag från Thomas Klausner i :issue:`30512`.)

source: :meth:`~socket.create_connection` has an option to raise, in case of failure to connect, an :exc:`ExceptionGroup` containing all errors instead of only raising the last error. (Contributed by Irit Katriel in :issue:`29980`.)
sv: :meth:`~socket.create_connection` har ett alternativ för att, i händelse av misslyckad anslutning, skapa en :exc:`ExceptionGroup` som innehåller alla fel istället för att bara skapa det sista felet. (Bidrag från Irit Katriel i :issue:`29980`.)

source: You can now disable the authorizer by passing :const:`None` to :meth:`~sqlite3.Connection.set_authorizer`. (Contributed by Erlend E. Aasland in :issue:`44491`.)
sv: Du kan nu inaktivera authorizer genom att skicka :const:`None` till :meth:`~sqlite3.Connection.set_authorizer`. (Bidrag från Erlend E. Aasland i :issue:`44491`.)

source: Collation name :meth:`~sqlite3.Connection.create_collation` can now contain any Unicode character. Collation names with invalid characters now raise :exc:`UnicodeEncodeError` instead of :exc:`sqlite3.ProgrammingError`. (Contributed by Erlend E. Aasland in :issue:`44688`.)
sv: Samlingsnamnet :meth:`~sqlite3.Connection.create_collation` kan nu innehålla alla Unicode-tecken. Samlingsnamn med ogiltiga tecken ger nu upphov till :exc:`UnicodeEncodeError` istället för :exc:`sqlite3.ProgrammingError`. (Bidrag från Erlend E. Aasland i :issue:`44688`.)

source: :mod:`sqlite3` exceptions now include the SQLite extended error code as :attr:`~sqlite3.Error.sqlite_errorcode` and the SQLite error name as :attr:`~sqlite3.Error.sqlite_errorname`. (Contributed by Aviv Palivoda, Daniel Shahaf, and Erlend E. Aasland in :issue:`16379` and :issue:`24139`.)
sv: :mod:`sqlite3` undantag inkluderar nu SQLites utökade felkod som :attr:`~sqlite3.Error.sqlite_errorcode` och SQLites felnamn som :attr:`~sqlite3.Error.sqlite_errorname`. (Bidrag från Aviv Palivoda, Daniel Shahaf och Erlend E. Aasland i :issue:`16379` och :issue:`24139`.)

source: Add :meth:`~sqlite3.Connection.setlimit` and :meth:`~sqlite3.Connection.getlimit` to :class:`sqlite3.Connection` for setting and getting SQLite limits by connection basis. (Contributed by Erlend E. Aasland in :issue:`45243`.)
sv: Lägg till :meth:`~sqlite3.Connection.setlimit` och :meth:`~sqlite3.Connection.getlimit` till :class:`sqlite3.Connection` för att ställa in och hämta SQLite-gränser per anslutning. (Bidrag från Erlend E. Aasland i :issue:`45243`.)

source: :mod:`sqlite3` now sets :attr:`sqlite3.threadsafety` based on the default threading mode the underlying SQLite library has been compiled with. (Contributed by Erlend E. Aasland in :issue:`45613`.)
sv: :mod:`sqlite3` ställer nu in :attr:`sqlite3.threadsafety` baserat på det standardiserade trådningsläget som det underliggande SQLite-biblioteket har kompilerats med. (Bidrag från Erlend E. Aasland i :issue:`45613`.)

source: :mod:`sqlite3` C callbacks now use unraisable exceptions if callback tracebacks are enabled. Users can now register an :func:`unraisable hook handler <sys.unraisablehook>` to improve their debug experience. (Contributed by Erlend E. Aasland in :issue:`45828`.)
sv: :mod:`sqlite3` C-anrop använder nu unraisable undantag om callback-tracebacks är aktiverade. Användare kan nu registrera en :func:`unraisable hook handler <sys.unraisablehook>` för att förbättra sin felsökningsupplevelse. (Bidrag från Erlend E. Aasland i :issue:`45828`.)

source: Fetch across rollback no longer raises :exc:`~sqlite3.InterfaceError`. Instead we leave it to the SQLite library to handle these cases. (Contributed by Erlend E. Aasland in :issue:`44092`.)
sv: Fetch across rollback ger inte längre upphov till :exc:`~sqlite3.InterfaceError`. Istället överlåter vi till SQLite-biblioteket att hantera dessa fall. (Bidrag från Erlend E. Aasland i :issue:`44092`.)

source: Add :meth:`~sqlite3.Connection.serialize` and :meth:`~sqlite3.Connection.deserialize` to :class:`sqlite3.Connection` for serializing and deserializing databases. (Contributed by Erlend E. Aasland in :issue:`41930`.)
sv: Lägg till :meth:`~sqlite3.Connection.serialize` och :meth:`~sqlite3.Connection.deserialize` till :class:`sqlite3.Connection` för serialisering och deserialisering av databaser. (Bidrag från Erlend E. Aasland i :issue:`41930`.)

source: Add :meth:`~sqlite3.Connection.create_window_function` to :class:`sqlite3.Connection` for creating aggregate window functions. (Contributed by Erlend E. Aasland in :issue:`34916`.)
sv: Lägg till :meth:`~sqlite3.Connection.create_window_function` till :class:`sqlite3.Connection` för att skapa aggregerade fönsterfunktioner. (Bidrag från Erlend E. Aasland i :issue:`34916`.)

source: Add :meth:`~sqlite3.Connection.blobopen` to :class:`sqlite3.Connection`. :class:`sqlite3.Blob` allows incremental I/O operations on blobs. (Contributed by Aviv Palivoda and Erlend E. Aasland in :issue:`24905`.)
sv: Lägg till :meth:`~sqlite3.Connection.blobopen` till :class:`sqlite3.Connection`. :class:`sqlite3.Blob` tillåter inkrementella I/O-operationer på blobbar. (Bidrag från Aviv Palivoda och Erlend E. Aasland i :issue:`24905`.)

source: string
sv: sträng

source: Add :meth:`~string.Template.get_identifiers` and :meth:`~string.Template.is_valid` to :class:`string.Template`, which respectively return all valid placeholders, and whether any invalid placeholders are present. (Contributed by Ben Kehoe in :gh:`90465`.)
sv: Lägg till :meth:`~string.Template.get_identifiers` och :meth:`~string.Template.is_valid` till :class:`string.Template`, som returnerar alla giltiga platshållare respektive om några ogiltiga platshållare finns. (Bidrag från Ben Kehoe i :gh:`90465`.)

source: sys
sv: system

source: :func:`sys.exc_info` now derives the ``type`` and ``traceback`` fields from the ``value`` (the exception instance), so when an exception is modified while it is being handled, the changes are reflected in the results of subsequent calls to :func:`!exc_info`. (Contributed by Irit Katriel in :issue:`45711`.)
sv: :func:`sys.exc_info` härleder nu fälten ``type`` och ``traceback`` från ``value`` (undantagsinstansen), så när ett undantag ändras medan det hanteras, återspeglas ändringarna i resultaten av efterföljande anrop till :func:`!exc_info`. (Bidrag från Irit Katriel i :issue:`45711`.)

source: Add :func:`sys.exception` which returns the active exception instance (equivalent to ``sys.exc_info()[1]``). (Contributed by Irit Katriel in :issue:`46328`.)
sv: Lägg till :func:`sys.exception` som returnerar den aktiva undantagsinstansen (motsvarande ``sys.exc_info()[1]``). (Bidrag från Irit Katriel i :issue:`46328`.)

source: Add the :data:`sys.flags.safe_path <sys.flags>` flag. (Contributed by Victor Stinner in :gh:`57684`.)
sv: Lägg till flaggan :data:`sys.flags.safe_path <sys.flags>`. (Bidrag från Victor Stinner i :gh:`57684`.)

source: Three new :ref:`installation schemes <installation_paths>` (*posix_venv*, *nt_venv* and *venv*) were added and are used when Python creates new virtual environments or when it is running from a virtual environment. The first two schemes (*posix_venv* and *nt_venv*) are OS-specific for non-Windows and Windows, the *venv* is essentially an alias to one of them according to the OS Python runs on. This is useful for downstream distributors who modify :func:`sysconfig.get_preferred_scheme`. Third party code that creates new virtual environments should use the new *venv* installation scheme to determine the paths, as does :mod:`venv`. (Contributed by Miro Hrončok in :issue:`45413`.)
sv: Tre nya :ref:`installationsscheman <installation_paths>` (*posix_venv*, *nt_venv* och *venv*) har lagts till och används när Python skapar nya virtuella miljöer eller när den körs från en virtuell miljö. De två första schemana (*posix_venv* och *nt_venv*) är OS-specifika för icke-Windows och Windows, *venv* är i huvudsak ett alias till ett av dem beroende på vilket OS Python körs på. Detta är användbart för nedströmsdistributörer som ändrar :func:`sysconfig.get_preferred_scheme`. Tredjepartskod som skapar nya virtuella miljöer bör använda det nya *venv*-installationsschemat för att bestämma sökvägarna, precis som :mod:`venv`. (Bidrag från Miro Hrončok i :issue:`45413`.)

source: tempfile
sv: tempfil

source: :class:`~tempfile.SpooledTemporaryFile` objects now fully implement the methods of :class:`io.BufferedIOBase` or :class:`io.TextIOBase` (depending on file mode). This lets them work correctly with APIs that expect file-like objects, such as compression modules. (Contributed by Carey Metcalfe in :gh:`70363`.)
sv: :class:`~tempfile.SpooledTemporaryFile`\-objekt implementerar nu fullt ut metoderna i :class:`io.BufferedIOBase` eller :class:`io.TextIOBase` (beroende på filläge). Detta gör att de fungerar korrekt med API:er som förväntar sig filliknande objekt, t.ex. komprimeringsmoduler. (Bidrag från Carey Metcalfe i :gh:`70363`.)

source: threading
sv: gängning

source: On Unix, if the ``sem_clockwait()`` function is available in the C library (glibc 2.30 and newer), the :meth:`threading.Lock.acquire` method now uses the monotonic clock (:const:`time.CLOCK_MONOTONIC`) for the timeout, rather than using the system clock (:const:`time.CLOCK_REALTIME`), to not be affected by system clock changes. (Contributed by Victor Stinner in :issue:`41710`.)
sv: På Unix, om funktionen ``sem_clockwait()`` finns tillgänglig i C-biblioteket (glibc 2.30 och senare), använder nu metoden :meth:`threading.Lock.acquire` den monotona klockan (:const:`time.CLOCK_MONOTONIC`) för timeout, istället för att använda systemklockan (:const:`time.CLOCK_REALTIME`), för att inte påverkas av ändringar i systemklockan. (Bidrag från Victor Stinner i :issue:`41710`.)

source: time
sv: tid

source: On Unix, :func:`time.sleep` now uses the ``clock_nanosleep()`` or ``nanosleep()`` function, if available, which has a resolution of 1 nanosecond (10\ :sup:`-9` seconds), rather than using ``select()`` which has a resolution of 1 microsecond (10\ :sup:`-6` seconds). (Contributed by Benjamin Szőke and Victor Stinner in :issue:`21302`.)
sv: På Unix använder :func:`time.sleep` nu funktionen ``clock_nanosleep()`` eller ``nanosleep()``, om den finns tillgänglig, som har en upplösning på 1 nanosekund (10\ :sup:`\-9` sekunder), i stället för att använda ``select()`` som har en upplösning på 1 mikrosekund (10\ :sup:`\-6` sekunder). (Bidrag från Benjamin Szőke och Victor Stinner i :issue:`21302`.)

source: On Windows 8.1 and newer, :func:`time.sleep` now uses a waitable timer based on `high-resolution timers <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ which has a resolution of 100 nanoseconds (10\ :sup:`-7` seconds). Previously, it had a resolution of 1 millisecond (10\ :sup:`-3` seconds). (Contributed by Benjamin Szőke, Donghee Na, Eryk Sun and Victor Stinner in :issue:`21302` and :issue:`45429`.)
sv: I Windows 8.1 och senare använder :func:`time.sleep` nu en väntande timer baserad på `högupplösta timers <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ som har en upplösning på 100 nanosekunder (10\ :sup:`\-7` sekunder). Tidigare hade den en upplösning på 1 millisekund (10\ :sup:`\-3` sekunder). (Bidrag från Benjamin Szőke, Donghee Na, Eryk Sun och Victor Stinner i :issue:`21302` och :issue:`45429`.)

source: Added method ``info_patchlevel()`` which returns the exact version of the Tcl library as a named tuple similar to :data:`sys.version_info`. (Contributed by Serhiy Storchaka in :gh:`91827`.)
sv: Lagt till metoden ``info_patchlevel()`` som returnerar den exakta versionen av Tcl-biblioteket som en namngiven tupel liknande :data:`sys.version_info`. (Bidrag från Serhiy Storchaka i :gh:`91827`.)

source: traceback
sv: spårning

source: Add :func:`traceback.StackSummary.format_frame_summary` to allow users to override which frames appear in the traceback, and how they are formatted. (Contributed by Ammar Askar in :issue:`44569`.)
sv: Lägg till :func:`traceback.StackSummary.format_frame_summary` för att tillåta användare att åsidosätta vilka ramar som visas i traceback, och hur de formateras. (Bidrag från Ammar Askar i :issue:`44569`.)

source: Add :func:`traceback.TracebackException.print`, which prints the formatted :exc:`~traceback.TracebackException` instance to a file. (Contributed by Irit Katriel in :issue:`33809`.)
sv: Lägg till :func:`traceback.TracebackException.print`, som skriver ut den formaterade :exc:`~traceback.TracebackException`\-instansen till en fil. (Bidrag från Irit Katriel i :issue:`33809`.)

source: For major changes, see :ref:`new-feat-related-type-hints-311`.
sv: För större ändringar, se :ref:`new-feat-related-type-hints-311`.

source: Add :func:`typing.assert_never` and :class:`typing.Never`. :func:`typing.assert_never` is useful for asking a type checker to confirm that a line of code is not reachable. At runtime, it raises an :exc:`AssertionError`. (Contributed by Jelle Zijlstra in :gh:`90633`.)
sv: Lägg till :func:`typing.assert_never` och :class:`typing.Never`. :func:`typing.assert_never` är användbart för att be en typkontroll att bekräfta att en kodrad inte är nåbar. Vid körning ger det upphov till ett :exc:`AssertionError`. (Bidrag från Jelle Zijlstra i :gh:`90633`.)

source: Add :func:`typing.reveal_type`. This is useful for asking a type checker what type it has inferred for a given expression. At runtime it prints the type of the received value. (Contributed by Jelle Zijlstra in :gh:`90572`.)
sv: Lägg till :func:`typing.reveal_type`. Detta är användbart för att fråga en typkontrollant vilken typ den har härlett för ett givet uttryck. Vid körning skriver den ut typen för det mottagna värdet. (Bidrag från Jelle Zijlstra i :gh:`90572`.)
