Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: ``tracing``: changed, use :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` (functions added to Python 3.11 by :issue:`43760`).
sv: ``tracing``: ändrat, använd :c:func:`PyThreadState_EnterTracing` och :c:func:`PyThreadState_LeaveTracing` (funktioner tillagda i Python 3.11 av :issue:`43760`).

source: ``recursion_depth``: removed, use ``(tstate->recursion_limit - tstate->recursion_remaining)`` instead.
sv: ``recursion_depth``: borttagen, använd ``(tstate->recursion_limit - tstate->recursion_remaining)`` istället.

source: ``stackcheck_counter``: removed.
sv: ``stackcheck_counter``: borttagen.

source: Code defining ``PyThreadState_GetFrame()`` on Python 3.8 and older::
sv: Kod som definierar ``PyThreadState_GetFrame()`` på Python 3.8 och äldre::

source: Code defining ``PyThreadState_EnterTracing()`` and ``PyThreadState_LeaveTracing()`` on Python 3.10 and older::
sv: Kod som definierar ``PyThreadState_EnterTracing()`` och ``PyThreadState_LeaveTracing()`` på Python 3.10 och äldre::

source: Or use `the pythoncapi-compat project <https://github.com/python/pythoncapi-compat>`__ to get these functions on old Python functions.
sv: Eller använd `the pythoncapi-compat project <https://github.com/python/pythoncapi-compat>`__ för att få dessa funktioner på gamla Python-funktioner.

source: Distributors are encouraged to build Python with the optimized Blake2 library `libb2`_.
sv: Distributörer uppmuntras att bygga Python med det optimerade Blake2-biblioteket `libb2`_.

source: The :c:member:`PyConfig.module_search_paths_set` field must now be set to 1 for initialization to use :c:member:`PyConfig.module_search_paths` to initialize :data:`sys.path`. Otherwise, initialization will recalculate the path and replace any values added to ``module_search_paths``.
sv: Fältet :c:member:`PyConfig.module_search_paths_set` måste nu vara satt till 1 för att initieringen ska använda :c:member:`PyConfig.module_search_paths` för att initiera :data:`sys.path`. Annars kommer initieringen att räkna om sökvägen och ersätta alla värden som lagts till i ``module_search_paths``.

source: :c:func:`PyConfig_Read` no longer calculates the initial search path, and will not fill any values into :c:member:`PyConfig.module_search_paths`. To calculate default paths and then modify them, finish initialization and use :c:func:`PySys_GetObject` to retrieve :data:`sys.path` as a Python list object and modify it directly.
sv: :c:func:`PyConfig_Read` beräknar inte längre den första sökvägen och fyller inte i några värden i :c:member:`PyConfig.module_search_paths`. För att beräkna standardsökvägar och sedan ändra dem, avsluta initialiseringen och använd :c:func:`PySys_GetObject` för att hämta :data:`sys.path` som ett Python-listobjekt och ändra det direkt.

source: Deprecate the following functions to configure the Python initialization:
sv: Avveckla följande funktioner för att konfigurera Python-initialiseringen:

source: Use the new :c:type:`PyConfig` API of the :ref:`Python Initialization Configuration <init-config>` instead (:pep:`587`). (Contributed by Victor Stinner in :gh:`88279`.)
sv: Använd det nya :c:type:`PyConfig` API:et i :ref:`Python Initialization Configuration <init-config>` istället (:pep:`587`). (Bidrag från Victor Stinner i :gh:`88279`.)

source: Deprecate the ``ob_shash`` member of the :c:type:`PyBytesObject`. Use :c:func:`PyObject_Hash` instead. (Contributed by Inada Naoki in :issue:`46864`.)
sv: Avveckla ``ob_shash``\-medlemmen i :c:type:`PyBytesObject`. Använd :c:func:`PyObject_Hash` istället. (Bidrag från Inada Naoki i :issue:`46864`.)

source: The following C APIs have been deprecated in earlier Python releases, and will be removed in Python 3.12.
sv: Följande C API:er har utgått i tidigare Python-utgåvor och kommer att tas bort i Python 3.12.

source: :c:func:`!PyFrame_BlockSetup` and :c:func:`!PyFrame_BlockPop` have been removed. (Contributed by Mark Shannon in :issue:`40222`.)
sv: :c:func:`!PyFrame_BlockSetup` och :c:func:`!PyFrame_BlockPop` har tagits bort. (Bidrag från Mark Shannon i :issue:`40222`.)

source: Remove the following math macros using the ``errno`` variable:
sv: Ta bort följande matematiska makron med hjälp av variabeln ``errno``:

source: (Contributed by Victor Stinner in :issue:`45412`.)
sv: (Bidrag från Victor Stinner i :issue:`45412`.)

source: Remove ``Py_UNICODE_COPY()`` and ``Py_UNICODE_FILL()`` macros, deprecated since Python 3.3. Use ``PyUnicode_CopyCharacters()`` or ``memcpy()`` (``wchar_t*`` string), and ``PyUnicode_Fill()`` functions instead. (Contributed by Victor Stinner in :issue:`41123`.)
sv: Ta bort makron ``Py_UNICODE_COPY()`` och ``Py_UNICODE_FILL()``, föråldrade sedan Python 3.3. Använd ``PyUnicode_CopyCharacters()`` eller ``memcpy()`` (``wchar_t*``\-sträng), och ``PyUnicode_Fill()`` funktioner istället. (Bidrag från Victor Stinner i :issue:`41123`.)

source: Remove the ``pystrhex.h`` header file. It only contains private functions. C extensions should only include the main ``<Python.h>`` header file. (Contributed by Victor Stinner in :issue:`45434`.)
sv: Ta bort huvudfilen ``pystrhex.h``. Den innehåller endast privata funktioner. C-tillägg bör endast inkludera huvudfilen ``<Python.h>``. (Bidrag från Victor Stinner i :issue:`45434`.)

source: Remove the ``Py_FORCE_DOUBLE()`` macro. It was used by the ``Py_IS_INFINITY()`` macro. (Contributed by Victor Stinner in :issue:`45440`.)
sv: Ta bort makrot ``Py_FORCE_DOUBLE()``. Det användes av makrot ``Py_IS_INFINITY()``. (Bidrag från Victor Stinner i :issue:`45440`.)

source: The following items are no longer available when :c:macro:`Py_LIMITED_API` is defined:
sv: Följande objekt är inte längre tillgängliga när :c:macro:`Py_LIMITED_API` är definierat:

source: the ``Py_MARSHAL_VERSION`` macro
sv: makrot ``Py_MARSHAL_VERSION``

source: These are not part of the :ref:`limited API <limited-api-list>`.
sv: Dessa ingår inte i :ref:`begränsat API <limited-api-list>`.

source: (Contributed by Victor Stinner in :issue:`45474`.)
sv: (Bidrag från Victor Stinner i :issue:`45474`.)

source: Exclude :c:func:`PyWeakref_GET_OBJECT` from the limited C API. It never worked since the :c:type:`!PyWeakReference` structure is opaque in the limited C API. (Contributed by Victor Stinner in :issue:`35134`.)
sv: Uteslut :c:func:`PyWeakref_GET_OBJECT` från det begränsade C API:et. Det fungerade aldrig eftersom :c:type:`!PyWeakReference`\-strukturen är ogenomskinlig i det begränsade C API:et. (Bidrag från Victor Stinner i :issue:`35134`.)

source: Remove the ``PyHeapType_GET_MEMBERS()`` macro. It was exposed in the public C API by mistake, it must only be used by Python internally. Use the ``PyTypeObject.tp_members`` member instead. (Contributed by Victor Stinner in :issue:`40170`.)
sv: Ta bort makrot ``PyHeapType_GET_MEMBERS()``. Det exponerades i det offentliga C API:et av misstag, det får endast användas av Python internt. Använd medlemmen ``PyTypeObject.tp_members`` istället. (Bidrag från Victor Stinner i :issue:`40170`.)

source: Remove the ``HAVE_PY_SET_53BIT_PRECISION`` macro (moved to the internal C API). (Contributed by Victor Stinner in :issue:`45412`.)
sv: Ta bort makrot ``HAVE_PY_SET_53BIT_PRECISION`` (flyttat till det interna C API:et). (Bidrag från Victor Stinner i :issue:`45412`.)

source: Remove the :c:type:`Py_UNICODE` encoder APIs, as they have been deprecated since Python 3.3, are little used and are inefficient relative to the recommended alternatives.
sv: Ta bort :c:type:`Py_UNICODE`\-kodar-API:erna, eftersom de har varit föråldrade sedan Python 3.3, används lite och är ineffektiva i förhållande till de rekommenderade alternativen.

source: The removed functions are:
sv: De borttagna funktionerna är:

source: See :pep:`624` for details and :pep:`migration guidance <624#alternative-apis>`. (Contributed by Inada Naoki in :issue:`44029`.)
sv: Se :pep:`624` för detaljer och :pep:`migrationsvägledning <624#alternative-apis>`. (Bidrag från Inada Naoki i :issue:`44029`.)

source: Notable changes in 3.11.4
sv: Viktiga ändringar i 3.11.4

source: tarfile
sv: tarfil

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
sv: Extraktionsmetoderna i :mod:`tarfile` och :func:`shutil.unpack_archive` har ett nytt *filter*-argument som gör det möjligt att begränsa tarfunktioner som kan vara överraskande eller farliga, t.ex. att skapa filer utanför destinationskatalogen. Se :ref:`tarfile-extraction-filter` för detaljer. I Python 3.12 kommer användning utan *filter*-argumentet att visa en :exc:`DeprecationWarning`. I Python 3.14 kommer standardinställningen att ändras till ``'data'``. (Bidrag från Petr Viktorin i :pep:`706`.)

source: Notable changes in 3.11.5
sv: Viktiga ändringar i 3.11.5

source: Windows builds and macOS installers from python.org now use OpenSSL 3.0.
sv: Windows-byggnader och macOS-installationer från python.org använder nu OpenSSL 3.0.
