Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: Add :func:`typing.assert_type`. This is useful for asking a type checker to confirm that the type it has inferred for a given expression matches the given type. At runtime it simply returns the received value. (Contributed by Jelle Zijlstra in :gh:`90638`.)
sv: Lägg till :func:`typing.assert_type`. Detta är användbart för att be en typkontrollör att bekräfta att den typ som den har härlett för ett visst uttryck matchar den angivna typen. Vid körning returnerar den helt enkelt det mottagna värdet. (Bidrag från Jelle Zijlstra i :gh:`90638`.)

source: :data:`typing.TypedDict` types can now be generic. (Contributed by Samodya Abeysiriwardane in :gh:`89026`.)
sv: :data:`typing.TypedDict`\-typer kan nu vara generiska. (Bidrag från Samodya Abeysiriwardane i :gh:`89026`.)

source: :class:`~typing.NamedTuple` types can now be generic. (Contributed by Serhiy Storchaka in :issue:`43923`.)
sv: :class:`~typing.NamedTuple`\-typer kan nu vara generiska. (Bidrag från Serhiy Storchaka i :issue:`43923`.)

source: Allow subclassing of :class:`typing.Any`. This is useful for avoiding type checker errors related to highly dynamic class, such as mocks. (Contributed by Shantanu Jain in :gh:`91154`.)
sv: Tillåt subklassning av :class:`typing.Any`. Detta är användbart för att undvika typkontrollfel relaterade till mycket dynamiska klasser, t.ex. mocks. (Bidrag från Shantanu Jain i :gh:`91154`.)

source: The :func:`typing.final` decorator now sets the ``__final__`` attributed on the decorated object. (Contributed by Jelle Zijlstra in :gh:`90500`.)
sv: Dekoratorn :func:`typing.final` sätter nu attributet ``__final__`` på det dekorerade objektet. (Bidrag från Jelle Zijlstra i :gh:`90500`.)

source: The :func:`typing.get_overloads` function can be used for introspecting the overloads of a function. :func:`typing.clear_overloads` can be used to clear all registered overloads of a function. (Contributed by Jelle Zijlstra in :gh:`89263`.)
sv: Funktionen :func:`typing.get_overloads` kan användas för att introspektera överbelastningar av en funktion. :func:`typing.clear_overloads` kan användas för att rensa alla registrerade överbelastningar av en funktion. (Bidrag från Jelle Zijlstra i :gh:`89263`.)

source: The :meth:`~object.__init__` method of :class:`~typing.Protocol` subclasses is now preserved. (Contributed by Adrian Garcia Badarasco in :gh:`88970`.)
sv: Metoden :meth:`~object.__init__` för :class:`~typing.Protocol`\-underklasser bevaras nu. (Bidrag från Adrian Garcia Badarasco i :gh:`88970`.)

source: The representation of empty tuple types (``Tuple[()]``) is simplified. This affects introspection, e.g. ``get_args(Tuple[()])`` now evaluates to ``()`` instead of ``((),)``. (Contributed by Serhiy Storchaka in :gh:`91137`.)
sv: Representationen av tomma tupeltyper (``Tuple[()]``) har förenklats. Detta påverkar introspektion, t.ex. ``get_args(Tuple[()])`` utvärderas nu till ``()`` istället för ``((),)``. (Bidrag från Serhiy Storchaka i :gh:`91137`.)

source: Loosen runtime requirements for type annotations by removing the callable check in the private ``typing._type_check`` function. (Contributed by Gregory Beauregard in :gh:`90802`.)
sv: Lättar på körtidskraven för typannoteringar genom att ta bort den anropbara kontrollen i den privata funktionen ``typing._type_check``. (Bidrag från Gregory Beauregard i :gh:`90802`.)

source: :func:`typing.get_type_hints` now supports evaluating strings as forward references in :ref:`PEP 585 generic aliases <types-genericalias>`. (Contributed by Niklas Rosenstein in :gh:`85542`.)
sv: :func:`typing.get_type_hints` stöder nu utvärdering av strängar som framåtriktade referenser i :ref:`PEP 585 generiska alias <types-genericalias>`. (Bidrag från Niklas Rosenstein i :gh:`85542`.)

source: :func:`typing.get_type_hints` no longer adds :data:`~typing.Optional` to parameters with ``None`` as a default. (Contributed by Nikita Sobolev in :gh:`90353`.)
sv: :func:`typing.get_type_hints` lägger inte längre till :data:`~typing.Optional` till parametrar med ``None`` som standard. (Bidrag från Nikita Sobolev i :gh:`90353`.)

source: :func:`typing.get_type_hints` now supports evaluating bare stringified :data:`~typing.ClassVar` annotations. (Contributed by Gregory Beauregard in :gh:`90711`.)
sv: :func:`typing.get_type_hints` stöder nu utvärdering av nakna strängade :data:`~typing.ClassVar`\-annoteringar. (Bidrag från Gregory Beauregard i :gh:`90711`.)

source: :func:`typing.no_type_check` no longer modifies external classes and functions. It also now correctly marks classmethods as not to be type checked. (Contributed by Nikita Sobolev in :gh:`90729`.)
sv: :func:`typing.no_type_check` modifierar inte längre externa klasser och funktioner. Den markerar nu också korrekt att klassmetoder inte ska typkontrolleras. (Bidrag från Nikita Sobolev i :gh:`90729`.)

source: The Unicode database has been updated to version 14.0.0. (Contributed by Benjamin Peterson in :issue:`45190`).
sv: Unicode-databasen har uppdaterats till version 14.0.0. (Bidrag från Benjamin Peterson i :issue:`45190`).

source: Added methods :meth:`~unittest.TestCase.enterContext` and :meth:`~unittest.TestCase.enterClassContext` of class :class:`~unittest.TestCase`, method :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` of class :class:`~unittest.IsolatedAsyncioTestCase` and function :func:`unittest.enterModuleContext`. (Contributed by Serhiy Storchaka in :issue:`45046`.)
sv: Lagt till metoderna :meth:`~unittest.TestCase.enterContext` och :meth:`~unittest.TestCase.enterClassContext` för klassen :class:`~unittest.TestCase`, metoden :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` för klassen :class:`~unittest.IsolatedAsyncioTestCase` och funktionen :func:`unittest.enterModuleContext`. (Bidrag från Serhiy Storchaka i :issue:`45046`.)

source: venv
sv: ven

source: When new Python virtual environments are created, the *venv* :ref:`sysconfig installation scheme <installation_paths>` is used to determine the paths inside the environment. When Python runs in a virtual environment, the same installation scheme is the default. That means that downstream distributors can change the default sysconfig install scheme without changing behavior of virtual environments. Third party code that also creates new virtual environments should do the same. (Contributed by Miro Hrončok in :issue:`45413`.)
sv: När nya virtuella Python-miljöer skapas används *venv* :ref:`sysconfig-installationsschemat <installation_paths>` för att bestämma sökvägarna i miljön. När Python körs i en virtuell miljö är samma installationsschema standard. Det innebär att nedströmsdistributörer kan ändra standardinstallationsschemat för sysconfig utan att ändra beteendet i virtuella miljöer. Tredjepartskod som också skapar nya virtuella miljöer bör göra detsamma. (Bidrag från Miro Hrončok i :issue:`45413`.)

source: warnings
sv: varningar

source: :func:`warnings.catch_warnings` now accepts arguments for :func:`warnings.simplefilter`, providing a more concise way to locally ignore warnings or convert them to errors. (Contributed by Zac Hatfield-Dodds in :issue:`47074`.)
sv: :func:`warnings.catch_warnings` accepterar nu argument för :func:`warnings.simplefilter`, vilket ger ett mer koncist sätt att lokalt ignorera varningar eller konvertera dem till fel. (Bidrag från Zac Hatfield-Dodds i :issue:`47074`.)

source: zipfile
sv: zip-fil

source: Added support for specifying member name encoding for reading metadata in a :class:`~zipfile.ZipFile`'s directory and file headers. (Contributed by Stephen J. Turnbull and Serhiy Storchaka in :issue:`28080`.)
sv: Lagt till stöd för att ange kodning av medlemsnamn för läsning av metadata i en :class:`~zipfile.ZipFile` katalog och filhuvuden. (Bidrag från Stephen J. Turnbull och Serhiy Storchaka i :issue:`28080`.)

source: Added :meth:`ZipFile.mkdir() <zipfile.ZipFile.mkdir>` for creating new directories inside ZIP archives. (Contributed by Sam Ezeh in :gh:`49083`.)
sv: Lagt till :meth:`ZipFile.mkdir() <zipfile.ZipFile.mkdir>` för att skapa nya kataloger inuti ZIP-arkiv. (Bidrag från Sam Ezeh i :gh:`49083`.)

source: Added :attr:`~zipfile.Path.stem`, :attr:`~zipfile.Path.suffix` and :attr:`~zipfile.Path.suffixes` to :class:`zipfile.Path`. (Contributed by Miguel Brito in :gh:`88261`.)
sv: Lade till :attr:`~zipfile.Path.stem`, :attr:`~zipfile.Path.suffix` och :attr:`~zipfile.Path.suffixes` till :class:`zipfile.Path`. (Bidrag från Miguel Brito i :gh:`88261`.)

source: Optimizations
sv: Optimeringar

source: This section covers specific optimizations independent of the :ref:`whatsnew311-faster-cpython` project, which is covered in its own section.
sv: Detta avsnitt behandlar specifika optimeringar oberoende av :ref:`whatsnew311-faster-cpython`\-projektet, som behandlas i ett eget avsnitt.

source: The compiler now optimizes simple :ref:`printf-style % formatting <old-string-formatting>` on string literals containing only the format codes ``%s``, ``%r`` and ``%a`` and makes it as fast as a corresponding :term:`f-string` expression. (Contributed by Serhiy Storchaka in :issue:`28307`.)
sv: Kompilatorn optimerar nu enkel :ref:`printf-style % formatting <old-string-formatting>` på strängliteraler som endast innehåller formatkoderna ``%s``, ``%r`` och ``%a`` och gör det lika snabbt som ett motsvarande :term:`f-string` -uttryck. (Bidrag från Serhiy Storchaka i :issue:`28307`.)

source: Integer division (``//``) is better tuned for optimization by compilers. It is now around 20% faster on x86-64 when dividing an :class:`int` by a value smaller than ``2**30``. (Contributed by Gregory P. Smith and Tim Peters in :gh:`90564`.)
sv: Integer division (``//``) är bättre anpassad för optimering av kompilatorer. Det är nu runt 20% faster på x86-64 när man delar en :class:`int` med ett värde som är mindre än ``2**30``. (Bidrag från Gregory P. Smith och Tim Peters i :gh:`90564`.)

source: :func:`sum` is now nearly 30% faster for integers smaller than ``2**30``. (Contributed by Stefan Behnel in :gh:`68264`.)
sv: :func:`sum` är nu nästan 30% faster för heltal mindre än ``2**30``. (Bidrag från Stefan Behnel i :gh:`68264`.)

source: Dictionaries don't store hash values when all keys are Unicode objects, decreasing :class:`dict` size. For example, ``sys.getsizeof(dict.fromkeys("abcdefg"))`` is reduced from 352 bytes to 272 bytes (23% smaller) on 64-bit platforms. (Contributed by Inada Naoki in :issue:`46845`.)
sv: Dictionaries lagrar inte hash-värden när alla nycklar är Unicode-objekt, vilket minskar :class:`dict`\-storleken. Till exempel minskas ``sys.getsizeof(dict.fromkeys("abcdefg"))`` från 352 byte till 272 byte (23% smaller) på 64-bitars plattformar. (Bidrag från Inada Naoki i :issue:`46845`.)

source: Using :class:`asyncio.DatagramProtocol` is now orders of magnitude faster when transferring large files over UDP, with speeds over 100 times higher for a ≈60 MiB file. (Contributed by msoxzw in :gh:`91487`.)
sv: Att använda :class:`asyncio.DatagramProtocol` är nu flera storleksordningar snabbare vid överföring av stora filer över UDP, med hastigheter över 100 gånger högre för en fil på ≈60 MiB. (Bidrag från msoxzw i :gh:`91487`.)

source: :mod:`math` functions :func:`~math.comb` and :func:`~math.perm` are now ≈10 times faster for large arguments (with a larger speedup for larger *k*). (Contributed by Serhiy Storchaka in :issue:`37295`.)
sv: :mod:`math`\-funktionerna :func:`~math.comb` och :func:`~math.perm` är nu ≈10 gånger snabbare för stora argument (med en större ökning för större *k*). (Bidrag från Serhiy Storchaka i :issue:`37295`.)

source: The :mod:`statistics` functions :func:`~statistics.mean`, :func:`~statistics.variance` and :func:`~statistics.stdev` now consume iterators in one pass rather than converting them to a :class:`list` first. This is twice as fast and can save substantial memory. (Contributed by Raymond Hettinger in :gh:`90415`.)
sv: Funktionerna :mod:`statistics` :func:`~statistics.mean`, :func:`~statistics.variance` och :func:`~statistics.stdev` använder nu iteratorer i ett svep i stället för att först konvertera dem till en :class:`list`. Detta är dubbelt så snabbt och kan spara mycket minne. (Bidrag från Raymond Hettinger i :gh:`90415`.)

source: :func:`unicodedata.normalize` now normalizes pure-ASCII strings in constant time. (Contributed by Donghee Na in :issue:`44987`.)
sv: :func:`unicodedata.normalize` normaliserar nu rena ASCII-strängar i konstant tid. (Bidrag från Donghee Na i :issue:`44987`.)

source: Faster CPython
sv: Snabbare CPython

source: CPython 3.11 is an average of `25% faster <https://github.com/faster-cpython/ideas#published-results>`_ than CPython 3.10 as measured with the `pyperformance <https://github.com/python/pyperformance>`_ benchmark suite, when compiled with GCC on Ubuntu Linux. Depending on your workload, the overall speedup could be 10-60%.
sv: CPython 3.11 är i genomsnitt `25% faster <https://github.com/faster-cpython/ideas#published-results>`_ snabbare än CPython 3.10 mätt med `pyperformance <https://github.com/python/pyperformance>`_ benchmark suite, när det kompileras med GCC på Ubuntu Linux. Beroende på din arbetsbelastning kan den totala hastighetsökningen vara 10-60%.

source: This project focuses on two major areas in Python: :ref:`whatsnew311-faster-startup` and :ref:`whatsnew311-faster-runtime`. Optimizations not covered by this project are listed separately under :ref:`whatsnew311-optimizations`.
sv: Det här projektet fokuserar på två stora områden i Python: :ref:`whatsnew311-faster-startup` och :ref:`whatsnew311-faster-runtime`. Optimeringar som inte täcks av detta projekt listas separat under :ref:`whatsnew311-optimizations`.

source: Faster Startup
sv: Snabbare uppstart

source: Frozen imports / Static code objects
sv: Fryst import / Statiska kodobjekt

source: Python caches :term:`bytecode` in the :ref:`__pycache__ <tut-pycache>` directory to speed up module loading.
sv: Python cachelagrar :term:`bytecode` i :ref:`__pycache__ <tut-pycache>` katalogen för att påskynda laddning av moduler.

source: Previously in 3.10, Python module execution looked like this:
sv: Tidigare i 3.10 såg exekveringen av Python-moduler ut så här:

source: Read __pycache__ -> Unmarshal -> Heap allocated code object -> Evaluate
sv: Läs __pycache__ -> Unmarshal -> Heap-allokerat kodobjekt -> Utvärdera

source: In Python 3.11, the core modules essential for Python startup are "frozen". This means that their :ref:`codeobjects` (and bytecode) are statically allocated by the interpreter. This reduces the steps in module execution process to:
sv: I Python 3.11 är de kärnmoduler som är nödvändiga för Python-start "frysta". Detta innebär att deras :ref:`codeobjects` (och bytekoder) allokeras statiskt av tolken. Detta reducerar stegen i modulens exekveringsprocess till:

source: Statically allocated code object -> Evaluate
sv: Statiskt allokerat kodobjekt -> Utvärdera

source: Interpreter startup is now 10-15% faster in Python 3.11. This has a big impact for short-running programs using Python.
sv: Interpreterstart är nu 10-15% faster i Python 3.11. Detta har stor inverkan på kortlivade program som använder Python.

source: (Contributed by Eric Snow, Guido van Rossum and Kumar Aditya in many issues.)
sv: (Bidrag från Eric Snow, Guido van Rossum och Kumar Aditya i många utgåvor)

source: Faster Runtime
sv: Snabbare körtid

source: Cheaper, lazy Python frames
sv: Billigare, latare Python-ramar

source: Python frames, holding execution information, are created whenever Python calls a Python function. The following are new frame optimizations:
sv: Python-ramar, som innehåller exekveringsinformation, skapas varje gång Python anropar en Python-funktion. Följande är nya optimeringar av ramar:

source: Streamlined the frame creation process.
sv: Effektiviserad process för att skapa ramar.

source: Avoided memory allocation by generously re-using frame space on the C stack.
sv: Undviker minnesallokering genom att generöst återanvända ramutrymme på C-stacken.

source: Streamlined the internal frame struct to contain only essential information. Frames previously held extra debugging and memory management information.
sv: Effektiviserat den interna ramstrukturen till att endast innehålla väsentlig information. Frames innehöll tidigare extra felsöknings- och minneshanteringsinformation.

source: Old-style :ref:`frame objects <frame-objects>` are now created only when requested by debuggers or by Python introspection functions such as :func:`sys._getframe` and :func:`inspect.currentframe`. For most user code, no frame objects are created at all. As a result, nearly all Python functions calls have sped up significantly. We measured a 3-7% speedup in pyperformance.
sv: Den gamla stilen :ref:`frame objects <frame-objects>` skapas nu endast på begäran av debuggar eller av Pythons introspektionsfunktioner som :func:`sys._getframe` och :func:`inspect.currentframe`. För de flesta användarkoder skapas inga frame-objekt alls. Som ett resultat av detta har nästan alla anrop av Python-funktioner blivit betydligt snabbare. Vi uppmätte en 3-7% speedup i pyperformance.

source: (Contributed by Mark Shannon in :issue:`44590`.)
sv: (Bidrag från Mark Shannon i :issue:`44590`.)

source: Inlined Python function calls
sv: Anrop av Python-funktioner

source: During a Python function call, Python will call an evaluating C function to interpret that function's code. This effectively limits pure Python recursion to what's safe for the C stack.
sv: Under ett Python-funktionsanrop kommer Python att anropa en utvärderande C-funktion för att tolka den funktionens kod. Detta begränsar effektivt ren Python-rekursion till vad som är säkert för C-stacken.

source: In 3.11, when CPython detects Python code calling another Python function, it sets up a new frame, and "jumps" to the new code inside the new frame. This avoids calling the C interpreting function altogether.
sv: I 3.11, när CPython upptäcker att Python-kod anropar en annan Python-funktion, skapar CPython en ny ram och "hoppar" till den nya koden i den nya ramen. På så sätt undviker man att anropa C-tolkningsfunktionen helt och hållet.

source: Most Python function calls now consume no C stack space, speeding them up. In simple recursive functions like fibonacci or factorial, we observed a 1.7x speedup. This also means recursive functions can recurse significantly deeper (if the user increases the recursion limit with :func:`sys.setrecursionlimit`). We measured a 1-3% improvement in pyperformance.
sv: De flesta Python-funktionsanrop förbrukar nu inget C-stackutrymme, vilket snabbar upp dem. I enkla rekursiva funktioner som fibonacci eller factorial observerade vi en 1,7-faldig hastighet. Detta innebär också att rekursiva funktioner kan rekursera betydligt djupare (om användaren ökar rekursionsgränsen med :func:`sys.setrecursionlimit`). Vi uppmätte en 1-3% im förbättring av pyperformance.

source: (Contributed by Pablo Galindo and Mark Shannon in :issue:`45256`.)
sv: (Bidrag från Pablo Galindo och Mark Shannon i :issue:`45256`.)

source: PEP 659: Specializing Adaptive Interpreter
sv: PEP 659: Specialisering av adaptiv tolk

source: :pep:`659` is one of the key parts of the Faster CPython project. The general idea is that while Python is a dynamic language, most code has regions where objects and types rarely change. This concept is known as *type stability*.
sv: :pep:`659` är en av de viktigaste delarna i Faster CPython-projektet. Den allmänna idén är att även om Python är ett dynamiskt språk, har de flesta koder regioner där objekt och typer sällan ändras. Detta koncept är känt som *typstabilitet*.

source: At runtime, Python will try to look for common patterns and type stability in the executing code. Python will then replace the current operation with a more specialized one. This specialized operation uses fast paths available only to those use cases/types, which generally outperform their generic counterparts. This also brings in another concept called *inline caching*, where Python caches the results of expensive operations directly in the :term:`bytecode`.
sv: Vid körning försöker Python leta efter vanliga mönster och typstabilitet i den exekverande koden. Python ersätter sedan den aktuella operationen med en mer specialiserad. Denna specialiserade operation använder snabba vägar som endast är tillgängliga för dessa användningsfall/typer, som i allmänhet överträffar sina generiska motsvarigheter. Detta medför också ett annat koncept som kallas *inline caching*, där Python cachelagrar resultaten av dyra operationer direkt i :term:`bytecode`.

source: The specializer will also combine certain common instruction pairs into one superinstruction, reducing the overhead during execution.
sv: Specialiseraren kombinerar också vissa vanliga instruktionspar till en superinstruktion, vilket minskar overheaden under exekveringen.

source: Python will only specialize when it sees code that is "hot" (executed multiple times). This prevents Python from wasting time on run-once code. Python can also de-specialize when code is too dynamic or when the use changes. Specialization is attempted periodically, and specialization attempts are not too expensive, allowing specialization to adapt to new circumstances.
sv: Python kommer bara att specialisera sig när det ser kod som är "het" (exekveras flera gånger). Detta förhindrar att Python slösar tid på kod som bara körs en gång. Python kan också avspecialisera när koden är för dynamisk eller när användningen ändras. Specialiseringsförsök görs med jämna mellanrum och specialiseringsförsöken är inte alltför dyra, vilket gör att specialiseringen kan anpassas till nya omständigheter.

source: (PEP written by Mark Shannon, with ideas inspired by Stefan Brunthaler. See :pep:`659` for more information. Implementation by Mark Shannon and Brandt Bucher, with additional help from Irit Katriel and Dennis Sweeney.)
sv: (PEP skriven av Mark Shannon, med idéer inspirerade av Stefan Brunthaler. Se :pep:`659` för mer information. Implementering av Mark Shannon och Brandt Bucher, med ytterligare hjälp från Irit Katriel och Dennis Sweeney)

source: Form
sv: Formulär

source: Specialization
sv: Specialisering

source: Operation speedup (up to)
sv: Snabbare drift (upp till)

source: Contributor(s)
sv: Medverkande(n)

source: Binary operations
sv: Binära operationer

source: Binary add, multiply and subtract for common types such as :class:`int`, :class:`float` and :class:`str` take custom fast paths for their underlying types.
sv: Binär addition, multiplikation och subtraktion för vanliga typer som :class:`int`, :class:`float` och :class:`str` tar anpassade snabba vägar för sina underliggande typer.

source: Subscript
sv: Nedsänkt

source: Subscripting container types such as :class:`list`, :class:`tuple` and :class:`dict` directly index the underlying data structures.
sv: Subscripterande containertyper som :class:`list`, :class:`tuple` och :class:`dict` indexerar direkt de underliggande datastrukturerna.

source: Subscripting custom :meth:`~object.__getitem__` is also inlined similar to :ref:`inline-calls`.
sv: Subscripting custom :meth:`~object.__getitem__` är också inline på liknande sätt som :ref:`inline-calls`.

source: Store subscript
sv: Lagra index

source: Similar to subscripting specialization above.
sv: På samma sätt som för specialisering av subskription ovan.

source: Calls to common builtin (C) functions and types such as :func:`len` and :class:`str` directly call their underlying C version. This avoids going through the internal calling convention.
sv: Anrop till vanliga inbyggda (C) funktioner och typer som :func:`len` och :class:`str` anropar direkt deras underliggande C-version. Detta undviker att gå igenom den interna anropskonventionen.

source: Load global variable
sv: Ladda global variabel
