Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: CPython will now use 30-bit digits by default for the Python :class:`int` implementation. Previously, the default was to use 30-bit digits on platforms with ``SIZEOF_VOID_P >= 8``, and 15-bit digits otherwise. It's still possible to explicitly request use of 15-bit digits via either the :option:`--enable-big-digits` option to the configure script or (for Windows) the ``PYLONG_BITS_IN_DIGIT`` variable in ``PC/pyconfig.h``, but this option may be removed at some point in the future. (Contributed by Mark Dickinson in :issue:`45569`.)
sv: CPython kommer nu att använda 30-bitars siffror som standard för Python :class:`int`\-implementationen. Tidigare var standardinställningen att använda 30-bitars siffror på plattformar med ``SIZEOF_VOID_P >= 8``, och 15-bitars siffror annars. Det är fortfarande möjligt att uttryckligen begära användning av 15-bitars siffror via antingen :option:`\--enable-big-digits`\-alternativet till configure-skriptet eller (för Windows) variabeln ``PYLONG_BITS_IN_DIGIT`` i ``PC/pyconfig.h``, men detta alternativ kan komma att tas bort någon gång i framtiden. (Bidrag från Mark Dickinson i :issue:`45569`.)

source: C API Changes
sv: Ändringar i C API

source: Add a new :c:func:`PyType_GetName` function to get type's short name. (Contributed by Hai Shi in :issue:`42035`.)
sv: Lägg till en ny :c:func:`PyType_GetName`\-funktion för att hämta typens korta namn. (Bidrag från Hai Shi i :issue:`42035`.)

source: Add a new :c:func:`PyType_GetQualName` function to get type's qualified name. (Contributed by Hai Shi in :issue:`42035`.)
sv: Lägg till en ny :c:func:`PyType_GetQualName`\-funktion för att hämta typens kvalificerade namn. (Bidrag från Hai Shi i :issue:`42035`.)

source: Add new :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` functions to the limited C API to suspend and resume tracing and profiling. (Contributed by Victor Stinner in :issue:`43760`.)
sv: Lägg till nya :c:func:`PyThreadState_EnterTracing` och :c:func:`PyThreadState_LeaveTracing` funktioner till det begränsade C API:et för att avbryta och återuppta spårning och profilering. (Bidrag från Victor Stinner i :issue:`43760`.)

source: Added the :c:data:`Py_Version` constant which bears the same value as :c:macro:`PY_VERSION_HEX`. (Contributed by Gabriele N. Tornetta in :issue:`43931`.)
sv: Lagt till :c:data:`Py_Version`\-konstanten som har samma värde som :c:macro:`PY_VERSION_HEX`. (Bidrag från Gabriele N. Tornetta i :issue:`43931`.)

source: :c:type:`Py_buffer` and APIs are now part of the limited API and the stable ABI:
sv: :c:type:`Py_buffer` och API:er är nu en del av det begränsade API:et och det stabila ABI:et:

source: :c:member:`~PyBufferProcs.bf_getbuffer` and :c:member:`~PyBufferProcs.bf_releasebuffer` type slots
sv: :c:member:`~PyBufferProcs.bf_getbuffer` och :c:member:`~PyBufferProcs.bf_releasebuffer` typ slots

source: (Contributed by Christian Heimes in :issue:`45459`.)
sv: (Bidrag från Christian Heimes i :issue:`45459`.)

source: Added the :c:func:`PyType_GetModuleByDef` function, used to get the module in which a method was defined, in cases where this information is not available directly (via :c:type:`PyCMethod`). (Contributed by Petr Viktorin in :issue:`46613`.)
sv: Lade till funktionen :c:func:`PyType_GetModuleByDef`, som används för att hämta modulen i vilken en metod definierades, i de fall då denna information inte är tillgänglig direkt (via :c:type:`PyCMethod`). (Bidrag från Petr Viktorin i :issue:`46613`.)

source: Add new functions to pack and unpack C double (serialize and deserialize): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2`, :c:func:`PyFloat_Unpack4` and :c:func:`PyFloat_Unpack8`. (Contributed by Victor Stinner in :issue:`46906`.)
sv: Lägg till nya funktioner för att packa och packa upp C double (serialize och deserialize): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2`, :c:func:`PyFloat_Unpack4` och :c:func:`PyFloat_Unpack8`. (Bidrag från Victor Stinner i :issue:`46906`.)

source: Add new functions to get frame object attributes: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.
sv: Lägg till nya funktioner för att hämta attribut för ramobjekt: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.

source: Added two new functions to get and set the active exception instance: :c:func:`PyErr_GetHandledException` and :c:func:`PyErr_SetHandledException`. These are alternatives to :c:func:`PyErr_SetExcInfo()` and :c:func:`PyErr_GetExcInfo()` which work with the legacy 3-tuple representation of exceptions. (Contributed by Irit Katriel in :issue:`46343`.)
sv: Lade till två nya funktioner för att hämta och ställa in den aktiva undantagsinstansen: :c:func:`PyErr_GetHandledException` och :c:func:`PyErr_SetHandledException`. Dessa är alternativ till :c:func:`PyErr_SetExcInfo()` och :c:func:`PyErr_GetExcInfo()` som arbetar med den äldre 3-tupel-representationen av undantag. (Bidrag från Irit Katriel i :issue:`46343`.)

source: Added the :c:member:`PyConfig.safe_path` member. (Contributed by Victor Stinner in :gh:`57684`.)
sv: Lagt till :c:member:`PyConfig.safe_path`\-medlemmen. (Bidrag från Victor Stinner i :gh:`57684`.)

source: Some macros have been converted to static inline functions to avoid `macro pitfalls <https://gcc.gnu.org/onlinedocs/cpp/Macro-Pitfalls.html>`_. The change should be mostly transparent to users, as the replacement functions will cast their arguments to the expected types to avoid compiler warnings due to static type checks. However, when the limited C API is set to >=3.11, these casts are not done, and callers will need to cast arguments to their expected types. See :pep:`670` for more details. (Contributed by Victor Stinner and Erlend E. Aasland in :gh:`89653`.)
sv: Vissa makron har konverterats till statiska inline-funktioner för att undvika `makrofällor <https://gcc.gnu.org/onlinedocs/cpp/Macro-Pitfalls.html>`_. Förändringen bör vara mestadels transparent för användarna, eftersom ersättningsfunktionerna kommer att kasta sina argument till de förväntade typerna för att undvika kompilatorvarningar på grund av statiska typkontroller. När det begränsade C API:et är inställt på >=3.11 görs dock inte dessa kast och anropare måste kasta argumenten till deras förväntade typer. Se :pep:`670` för mer information. (Bidrag från Victor Stinner och Erlend E. Aasland i :gh:`89653`.)

source: :c:func:`PyErr_SetExcInfo()` no longer uses the ``type`` and ``traceback`` arguments, the interpreter now derives those values from the exception instance (the ``value`` argument). The function still steals references of all three arguments. (Contributed by Irit Katriel in :issue:`45711`.)
sv: :c:func:`PyErr_SetExcInfo()` använder inte längre argumenten ``type`` och ``traceback``, tolken härleder nu dessa värden från undantagsinstansen (argumentet ``value``). Funktionen stjäl fortfarande referenser till alla tre argumenten. (Bidrag från Irit Katriel i :issue:`45711`.)

source: :c:func:`PyErr_GetExcInfo()` now derives the ``type`` and ``traceback`` fields of the result from the exception instance (the ``value`` field). (Contributed by Irit Katriel in :issue:`45711`.)
sv: :c:func:`PyErr_GetExcInfo()` härleder nu fälten ``type`` och ``traceback`` i resultatet från undantagsinstansen (fältet ``value``). (Bidrag från Irit Katriel i :issue:`45711`.)

source: :c:struct:`_frozen` has a new ``is_package`` field to indicate whether or not the frozen module is a package. Previously, a negative value in the ``size`` field was the indicator. Now only non-negative values be used for ``size``. (Contributed by Kumar Aditya in :issue:`46608`.)
sv: :c:struct:`_frozen` har fått ett nytt fält ``is_package`` som anger om den frysta modulen är ett paket eller inte. Tidigare var ett negativt värde i fältet ``size`` indikatorn. Nu kan endast icke-negativa värden användas för ``size``. (Bidrag från Kumar Aditya i :issue:`46608`.)

source: :c:func:`_PyFrameEvalFunction` now takes ``_PyInterpreterFrame*`` as its second parameter, instead of ``PyFrameObject*``. See :pep:`523` for more details of how to use this function pointer type.
sv: :c:func:`_PyFrameEvalFunction` tar nu ``_PyInterpreterFrame*`` som sin andra parameter, istället för ``PyFrameObject*``. Se :pep:`523` för mer information om hur man använder denna funktionspekartyp.

source: :c:func:`!PyCode_New` and :c:func:`!PyCode_NewWithPosOnlyArgs` now take an additional ``exception_table`` argument. Using these functions should be avoided, if at all possible. To get a custom code object: create a code object using the compiler, then get a modified version with the ``replace`` method.
sv: :c:func:`!PyCode_New` och :c:func:`!PyCode_NewWithPosOnlyArgs` tar nu ett ytterligare ``exception_table`` argument. Användning av dessa funktioner bör undvikas om det är möjligt. För att få ett anpassat kodobjekt: skapa ett kodobjekt med hjälp av kompilatorn och få sedan en modifierad version med metoden ``replace``.

source: :c:type:`PyCodeObject` no longer has the ``co_code``, ``co_varnames``, ``co_cellvars`` and ``co_freevars`` fields. Instead, use :c:func:`PyCode_GetCode`, :c:func:`PyCode_GetVarnames`, :c:func:`PyCode_GetCellvars` and :c:func:`PyCode_GetFreevars` respectively to access them via the C API. (Contributed by Brandt Bucher in :issue:`46841` and Ken Jin in :gh:`92154` and :gh:`94936`.)
sv: :c:type:`PyCodeObject` har inte längre fälten ``co_code``, ``co_varnames``, ``co_cellvars`` och ``co_freevars``. Använd istället :c:func:`PyCode_GetCode`, :c:func:`PyCode_GetVarnames`, :c:func:`PyCode_GetCellvars` respektive :c:func:`PyCode_GetFreevars` för att komma åt dem via C API. (Bidrag från Brandt Bucher i :issue:`46841` och Ken Jin i :gh:`92154` och :gh:`94936`.)

source: The old trashcan macros (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) are now deprecated. They should be replaced by the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``.
sv: De gamla trashcan-makrot (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) är nu föråldrade. De bör ersättas av de nya makrona ``Py_TRASHCAN_BEGIN`` och ``Py_TRASHCAN_END``.

source: A tp_dealloc function that has the old macros, such as::
sv: En tp_dealloc-funktion som har de gamla makron, till exempel::

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }
sv: statiskt void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }

source: should migrate to the new macros as follows::
sv: bör övergå till de nya makron enligt följande::

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, mytype_dealloc) ... Py_TRASHCAN_END }
sv: statiskt void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, mytype_dealloc) ... Py_TRASHCAN_END }

source: Note that ``Py_TRASHCAN_BEGIN`` has a second argument which should be the deallocation function it is in.
sv: Observera att ``Py_TRASHCAN_BEGIN`` har ett andra argument som bör vara den deallokeringsfunktion som den ingår i.

source: To support older Python versions in the same codebase, you can define the following macros and use them throughout the code (credit: these were copied from the ``mypy`` codebase)::
sv: För att stödja äldre Python-versioner i samma kodbas kan du definiera följande makron och använda dem i hela koden (källa: dessa har kopierats från kodbasen ``mypy``)::

source: The :c:func:`PyType_Ready` function now raises an error if a type is defined with the :c:macro:`Py_TPFLAGS_HAVE_GC` flag set but has no traverse function (:c:member:`PyTypeObject.tp_traverse`). (Contributed by Victor Stinner in :issue:`44263`.)
sv: Funktionen :c:func:`PyType_Ready` ger nu upphov till ett fel om en typ definieras med flaggan :c:macro:`Py_TPFLAGS_HAVE_GC` inställd men inte har någon traversefunktion (:c:member:`PyTypeObject.tp_traverse`). (Bidrag från Victor Stinner i :issue:`44263`.)

source: Heap types with the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag can now inherit the :pep:`590` vectorcall protocol. Previously, this was only possible for :ref:`static types <static-types>`. (Contributed by Erlend E. Aasland in :issue:`43908`)
sv: Heap-typer med :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flaggan kan nu ärva :pep:`590` vectorcall protokollet. Tidigare var detta endast möjligt för :ref:`static types <static-types>`. (Bidrag från Erlend E. Aasland i :issue:`43908`)

source: Since :c:func:`Py_TYPE()` is changed to a inline static function, ``Py_TYPE(obj) = new_type`` must be replaced with ``Py_SET_TYPE(obj, new_type)``: see the :c:func:`Py_SET_TYPE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
sv: Eftersom :c:func:`Py_TYPE()` har ändrats till en statisk inline-funktion, måste ``Py_TYPE(obj) = new_type`` ersättas med ``Py_SET_TYPE(obj, new_type)``: se funktionen :c:func:`Py_SET_TYPE()` (tillgänglig sedan Python 3.9). För bakåtkompatibilitet kan detta makro användas::

source: #if PY_VERSION_HEX < 0x030900A4 && !defined(Py_SET_TYPE) static inline void _Py_SET_TYPE(PyObject *ob, PyTypeObject *type) { ob->ob_type = type; } #define Py_SET_TYPE(ob, type) _Py_SET_TYPE((PyObject*)(ob), type) #endif
sv: #if PY_VERSION_HEX < 0x030900A4 && !defined(Py_SET_TYPE) statisk inline void _Py_SET_TYPE(PyObject *ob, PyTypeObject *type) { ob->ob_type = typ; } #define Py_SET_TYPE(ob, type) _Py_SET_TYPE((PyObject*)(ob), type) #endif

source: (Contributed by Victor Stinner in :issue:`39573`.)
sv: (Bidrag från Victor Stinner i :issue:`39573`.)

source: Since :c:func:`Py_SIZE()` is changed to a inline static function, ``Py_SIZE(obj) = new_size`` must be replaced with ``Py_SET_SIZE(obj, new_size)``: see the :c:func:`Py_SET_SIZE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
sv: Eftersom :c:func:`Py_SIZE()` har ändrats till en statisk inline-funktion, måste ``Py_SIZE(obj) = new_size`` ersättas med ``Py_SET_SIZE(obj, new_size)``: se funktionen :c:func:`Py_SET_SIZE()` (tillgänglig sedan Python 3.9). För bakåtkompatibilitet kan detta makro användas::

source: #if PY_VERSION_HEX < 0x030900A4 && !defined(Py_SET_SIZE) static inline void _Py_SET_SIZE(PyVarObject *ob, Py_ssize_t size) { ob->ob_size = size; } #define Py_SET_SIZE(ob, size) _Py_SET_SIZE((PyVarObject*)(ob), size) #endif
sv: #if PY_VERSION_HEX < 0x030900A4 && !defined(Py_SET_SIZE) statisk inline void _Py_SET_SIZE(PyVarObject *ob, Py_ssize_t size) { ob->ob_size = size; } #define Py_SET_SIZE(ob, size) _Py_SET_SIZE((PyVarObject*)(ob), size) #endif

source: ``<Python.h>`` no longer includes the header files ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` and ``<string.h>`` when the ``Py_LIMITED_API`` macro is set to ``0x030b0000`` (Python 3.11) or higher. C extensions should explicitly include the header files after ``#include <Python.h>``. (Contributed by Victor Stinner in :issue:`45434`.)
sv: ``<Python.h>`` inkluderar inte längre huvudfilerna ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` och ``<string.h>`` när makrot ``Py_LIMITED_API`` är inställt på ``0x030b0000`` (Python 3.11) eller högre. C-tillägg bör uttryckligen inkludera huvudfilerna efter ``#include <Python.h>``. (Bidrag från Victor Stinner i :issue:`45434`.)

source: The non-limited API files ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject.h`` and ``longintrepr.h`` have been moved to the ``Include/cpython`` directory. Moreover, the ``eval.h`` header file was removed. These files must not be included directly, as they are already included in ``Python.h``: :ref:`Include Files <api-includes>`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Victor Stinner in :issue:`35134`.)
sv: De icke-begränsade API-filerna ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject.h`` och ``longintrepr.h`` har flyttats till katalogen ``Include/cpython``. Dessutom har huvudfilen ``eval.h`` tagits bort. Dessa filer får inte inkluderas direkt, eftersom de redan finns i ``Python.h``: :ref:`Include Files <api-includes>`. Om de har inkluderats direkt, överväg att inkludera ``Python.h`` istället. (Bidrag från Victor Stinner i :issue:`35134`.)

source: The :c:func:`!PyUnicode_CHECK_INTERNED` macro has been excluded from the limited C API. It was never usable there, because it used internal structures which are not available in the limited C API. (Contributed by Victor Stinner in :issue:`46007`.)
sv: Makrot :c:func:`!PyUnicode_CHECK_INTERNED` har uteslutits från det begränsade C API:et. Det var aldrig användbart där, eftersom det använde interna strukturer som inte är tillgängliga i det begränsade C API:et. (Bidrag från Victor Stinner i :issue:`46007`.)

source: The following frame functions and type are now directly available with ``#include <Python.h>``, it's no longer needed to add ``#include <frameobject.h>``:
sv: Följande ramfunktioner och -typer är nu direkt tillgängliga med ``#include <Python.h>``, det är inte längre nödvändigt att lägga till ``#include <frameobject.h>``:

source: (Contributed by Victor Stinner in :gh:`93937`.)
sv: (Bidrag från Victor Stinner i :gh:`93937`.)

source: The :c:type:`PyFrameObject` structure members have been removed from the public C API.
sv: Strukturmedlemmarna :c:type:`PyFrameObject` har tagits bort från det publika C API:et.

source: While the documentation notes that the :c:type:`PyFrameObject` fields are subject to change at any time, they have been stable for a long time and were used in several popular extensions.
sv: Även om det i dokumentationen anges att fälten :c:type:`PyFrameObject` kan ändras när som helst, har de varit stabila under lång tid och använts i flera populära tillägg.

source: In Python 3.11, the frame struct was reorganized to allow performance optimizations. Some fields were removed entirely, as they were details of the old implementation.
sv: I Python 3.11 omorganiserades ramstrukturen för att möjliggöra prestandaoptimeringar. Vissa fält togs bort helt och hållet, eftersom de var detaljer i den gamla implementeringen.

source: :c:type:`PyFrameObject` fields:
sv: :c:type:`PyFrameObject`\-fält :

source: ``f_back``: use :c:func:`PyFrame_GetBack`.
sv: ``f_back``: använd :c:func:`PyFrame_GetBack`.

source: ``f_blockstack``: removed.
sv: ``f_blockstack``: borttagen.

source: ``f_builtins``: use :c:func:`PyFrame_GetBuiltins`.
sv: ``f_builtins``: använd :c:func:`PyFrame_GetBuiltins`.

source: ``f_code``: use :c:func:`PyFrame_GetCode`.
sv: ``f_code``: använd :c:func:`PyFrame_GetCode`.

source: ``f_gen``: use :c:func:`PyFrame_GetGenerator`.
sv: ``f_gen``: använd :c:func:`PyFrame_GetGenerator`.

source: ``f_globals``: use :c:func:`PyFrame_GetGlobals`.
sv: ``f_globals``: använd :c:func:`PyFrame_GetGlobals`.

source: ``f_iblock``: removed.
sv: ``f_iblock``: borttagen.

source: ``f_lasti``: use :c:func:`PyFrame_GetLasti`. Code using ``f_lasti`` with ``PyCode_Addr2Line()`` should use :c:func:`PyFrame_GetLineNumber` instead; it may be faster.
sv: ``f_lasti``: använd :c:func:`PyFrame_GetLasti`. Kod som använder ``f_lasti`` med ``PyCode_Addr2Line()`` bör använda :c:func:`PyFrame_GetLineNumber` istället; det kan vara snabbare.

source: ``f_lineno``: use :c:func:`PyFrame_GetLineNumber`
sv: ``f_lineno``: använd :c:func:`PyFrame_GetLineNumber`

source: ``f_locals``: use :c:func:`PyFrame_GetLocals`.
sv: ``f_locals``: använd :c:func:`PyFrame_GetLocals`.

source: ``f_stackdepth``: removed.
sv: ``f_stackdepth``: borttagen.

source: ``f_state``: no public API (renamed to ``f_frame.f_state``).
sv: ``f_state``: Inget offentligt API (bytt namn till ``f_frame.f_state``).

source: ``f_trace``: no public API.
sv: ``f_trace``: Inget offentligt API.

source: ``f_trace_lines``: use ``PyObject_GetAttrString((PyObject*)frame, "f_trace_lines")``.
sv: ``f_trace_lines``: använd ``PyObject_GetAttrString((PyObject*)frame, "f_trace_lines")``.

source: ``f_trace_opcodes``: use ``PyObject_GetAttrString((PyObject*)frame, "f_trace_opcodes")``.
sv: ``f_trace_opcodes``: använd ``PyObject_GetAttrString((PyObject*)frame, "f_trace_opcodes")``.

source: ``f_localsplus``: no public API (renamed to ``f_frame.localsplus``).
sv: ``f_localsplus``: Inget offentligt API (bytt namn till ``f_frame.localsplus``).

source: ``f_valuestack``: removed.
sv: ``f_valuestack``: borttagen.

source: The Python frame object is now created lazily. A side effect is that the :attr:`~frame.f_back` member must not be accessed directly, since its value is now also computed lazily. The :c:func:`PyFrame_GetBack` function must be called instead.
sv: Python frame-objektet skapas nu på ett lättsamt sätt. En bieffekt är att medlemmen :attr:`~frame.f_back` inte får nås direkt, eftersom dess värde nu också beräknas på ett slött sätt. Funktionen :c:func:`PyFrame_GetBack` måste anropas istället.

source: Debuggers that accessed the :attr:`~frame.f_locals` directly *must* call :c:func:`PyFrame_GetLocals` instead. They no longer need to call :c:func:`!PyFrame_FastToLocalsWithError` or :c:func:`!PyFrame_LocalsToFast`, in fact they should not call those functions. The necessary updating of the frame is now managed by the virtual machine.
sv: Avläsningsprogram som använde :attr:`~frame.f_locals` direkt *måste* anropa :c:func:`PyFrame_GetLocals` istället. De behöver inte längre anropa :c:func:`!PyFrame_FastToLocalsWithError` eller :c:func:`!PyFrame_LocalsToFast`, i själva verket bör de inte anropa dessa funktioner. Den nödvändiga uppdateringen av ramen hanteras nu av den virtuella maskinen.

source: Code defining ``PyFrame_GetCode()`` on Python 3.8 and older::
sv: Kod som definierar ``PyFrame_GetCode()`` på Python 3.8 och äldre::

source: #if PY_VERSION_HEX < 0x030900B1 static inline PyCodeObject* PyFrame_GetCode(PyFrameObject *frame) { Py_INCREF(frame->f_code); return frame->f_code; } #endif
sv: #if PY_VERSION_HEX < 0x030900B1 static inline PyCodeObject* PyFrame_GetCode(PyFrameObject *frame) { Py_INCREF(frame->f_code); returnera frame->f_code; } #endif

source: Code defining ``PyFrame_GetBack()`` on Python 3.8 and older::
sv: Kod som definierar ``PyFrame_GetBack()`` på Python 3.8 och äldre::

source: #if PY_VERSION_HEX < 0x030900B1 static inline PyFrameObject* PyFrame_GetBack(PyFrameObject *frame) { Py_XINCREF(frame->f_back); return frame->f_back; } #endif
sv: #if PY_VERSION_HEX < 0x030900B1 static inline PyFrameObject* PyFrame_GetBack(PyFrameObject *frame) { Py_XINCREF(ram->f_back); returnera frame->f_back; } #endif

source: Or use the `pythoncapi_compat project <https://github.com/python/pythoncapi-compat>`__ to get these two functions on older Python versions.
sv: Eller använd `pythoncapi_compat-projektet <https://github.com/python/pythoncapi-compat>`__ för att få dessa två funktioner på äldre Python-versioner.

source: Changes of the :c:type:`PyThreadState` structure members:
sv: Ändringar av strukturmedlemmarna i :c:type:`PyThreadState`:

source: ``frame``: removed, use :c:func:`PyThreadState_GetFrame` (function added to Python 3.9 by :issue:`40429`). Warning: the function returns a :term:`strong reference`, need to call :c:func:`Py_XDECREF`.
sv: ``frame``: borttagen, använd :c:func:`PyThreadState_GetFrame` (funktion tillagd till Python 3.9 av :issue:`40429`). Varning: funktionen returnerar en :term:`strong reference`, måste anropa :c:func:`Py_XDECREF`.
