Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: What's New In Python 3.11
sv: Vad är nytt i Python 3.11

source: Editor
sv: Redigerare

source: This article explains the new features in Python 3.11, compared to 3.10. Python 3.11 was released on October 24, 2022. For full details, see the :ref:`changelog <changelog>`.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.11 jämfört med 3.10. Python 3.11 släpptes den 24 oktober 2022. För fullständig information, se :ref:`changelog <changelog>`.

source: Summary -- Release highlights
sv: Sammanfattning -- Release highlights

source: Python 3.11 is between 10-60% faster than Python 3.10. On average, we measured a 1.25x speedup on the standard benchmark suite. See :ref:`whatsnew311-faster-cpython` for details.
sv: Python 3.11 är mellan 10-60% fsnabbare än Python 3.10. I genomsnitt uppmätte vi en 1,25x snabbare hastighet på standard benchmark svit. Se :ref:`whatsnew311-faster-cpython` för detaljer.

source: New syntax features:
sv: Nya syntaxfunktioner:

source: New built-in features:
sv: Nya inbyggda funktioner:

source: New standard library modules:
sv: Nya standardmoduler för bibliotek:

source: :pep:`680`: :mod:`tomllib` — Support for parsing `TOML <https://toml.io/>`_ in the Standard Library
sv: :pep:`680`: :mod:`tomllib` - Stöd för att tolka `TOML <https://toml.io/>`_ i standardbiblioteket

source: Interpreter improvements:
sv: Förbättringar av tolkar:

source: New :option:`-P` command line option and :envvar:`PYTHONSAFEPATH` environment variable to :ref:`disable automatically prepending potentially unsafe paths <whatsnew311-pythonsafepath>` to :data:`sys.path`
sv: Ny kommandoradsoption :option:`\-P` och miljövariabel :envvar:`PYTHONSAFEPATH` för att :ref:`inaktivera automatisk prependling av potentiellt osäkra sökvägar <whatsnew311-pythonsafepath>` till :data:`sys.path`

source: New typing features:
sv: Nya funktioner för skrivning:

source: Important deprecations, removals and restrictions:
sv: Viktiga avskrivningar, borttagningar och begränsningar:

source: :pep:`594`: :ref:`Many legacy standard library modules have been deprecated <whatsnew311-pep594>` and will be removed in Python 3.13
sv: :pep:`594`: :ref:`Många äldre standardbiblioteksmoduler har utrangerats <whatsnew311-pep594>` och kommer att tas bort i Python 3.13

source: :pep:`624`: :ref:`Py_UNICODE encoder APIs have been removed <whatsnew311-pep624>`
sv: :pep:`624`: :ref:`Py_UNICODE-kodarens API:er har tagits bort <whatsnew311-pep624>`

source: :pep:`670`: :ref:`Macros converted to static inline functions <whatsnew311-pep670>`
sv: :pep:`670`: :ref:`Makron konverterade till statiska inline-funktioner <whatsnew311-pep670>`

source: New Features
sv: Nya funktioner

source: PEP 657: Fine-grained error locations in tracebacks
sv: PEP 657: Finkorniga felplaceringar i spårningar

source: When printing tracebacks, the interpreter will now point to the exact expression that caused the error, instead of just the line. For example:
sv: Vid utskrift av spårningar kommer tolken nu att peka på det exakta uttryck som orsakade felet, istället för bara raden. Till exempel

source: Traceback (most recent call last): File "distance.py", line 11, in <module> print(manhattan_distance(p1, p2)) ^^^^^^^^^^^^^^^^^^^^^^^^^^ File "distance.py", line 6, in manhattan_distance return abs(point_1.x - point_2.x) + abs(point_1.y - point_2.y) ^^^^^^^^^ AttributeError: 'NoneType' object has no attribute 'x'
sv: Traceback (senaste anropet senast): Fil "distance.py", rad 11, i <module> print(manhattan_distance(p1, p2)) ^^^^^^^^^^^^^^^^^^^^^^^^^^ Fil "distance.py", rad 6, i manhattan_distance return abs(punkt_1.x - punkt_2.x) + abs(punkt_1.y - punkt_2.y) ^^^^^^^^^ AttributeError: Objektet 'NoneType' har inget attribut 'x'

source: Previous versions of the interpreter would point to just the line, making it ambiguous which object was ``None``. These enhanced errors can also be helpful when dealing with deeply nested :class:`dict` objects and multiple function calls:
sv: Tidigare versioner av tolken pekade bara på raden, vilket gjorde det tvetydigt vilket objekt som var ``None``. Dessa förbättrade fel kan också vara till hjälp när man har att göra med djupt nästlade :class:`dict`\-objekt och flera funktionsanrop:

source: Traceback (most recent call last): File "query.py", line 37, in <module> magic_arithmetic('foo') File "query.py", line 18, in magic_arithmetic return add_counts(x) / 25 ^^^^^^^^^^^^^ File "query.py", line 24, in add_counts return 25 + query_user(user1) + query_user(user2) ^^^^^^^^^^^^^^^^^ File "query.py", line 32, in query_user return 1 + query_count(db, response['a']['b']['c']['user'], retry=True) ~~~~~~~~~~~~~~~~~~^^^^^ TypeError: 'NoneType' object is not subscriptable
sv: Traceback (senaste anropet senast): Fil "query.py", rad 37, i <module> magic_aritmetic('foo') Fil "query.py", rad 18, i magic_arithmetic returnera add_counts(x) / 25 ^^^^^^^^^^^^^ Fil "query.py", rad 24, i add_counts return 25 + query_user(user1) + query_user(user2) ^^^^^^^^^^^^^^^^^ Fil "query.py", rad 32, i query_user return 1 + query_count(db, svar['a']['b']['c']['user'], retry=True) ~~~~~~~~~~~~~~~~~~^^^^^ TypeError: Objektet 'NoneType' är inte subskriberbart

source: As well as complex arithmetic expressions:
sv: Samt komplexa aritmetiska uttryck:

source: Traceback (most recent call last): File "calculation.py", line 54, in <module> result = (x / y / z) * (a / b / c) ~~~~~~^~~ ZeroDivisionError: division by zero
sv: Traceback (senaste anropet senast): Fil "calculation.py", rad 54, i <module> resultat = (x / y / z) * (a / b / c) ~~~~~~^~~ ZeroDivisionError: division med noll

source: Additionally, the information used by the enhanced traceback feature is made available via a general API, that can be used to correlate :term:`bytecode` :ref:`instructions <bytecodes>` with source code location. This information can be retrieved using:
sv: Dessutom görs den information som används av den förbättrade spårningsfunktionen tillgänglig via ett allmänt API, som kan användas för att korrelera :term:`bytecode` :ref:`instructions <bytecodes>` med källkodens plats. Denna information kan hämtas med hjälp av:

source: The :meth:`codeobject.co_positions` method in Python.
sv: Metoden :meth:`codeobject.co_positions` i Python.

source: The :c:func:`PyCode_Addr2Location` function in the C API.
sv: Funktionen :c:func:`PyCode_Addr2Location` i C API.

source: See :pep:`657` for more details. (Contributed by Pablo Galindo, Batuhan Taskaya and Ammar Askar in :issue:`43950`.)
sv: Se :pep:`657` för mer information. (Bidrag från Pablo Galindo, Batuhan Taskaya och Ammar Askar i :issue:`43950`.)

source: This feature requires storing column positions in :ref:`codeobjects`, which may result in a small increase in interpreter memory usage and disk usage for compiled Python files. To avoid storing the extra information and deactivate printing the extra traceback information, use the :option:`-X no_debug_ranges <-X>` command line option or the :envvar:`PYTHONNODEBUGRANGES` environment variable.
sv: Denna funktion kräver lagring av kolumnpositioner i :ref:`codeobjects`, vilket kan resultera i en liten ökning av minnesanvändningen i tolken och diskanvändningen för kompilerade Python-filer. För att undvika att lagra den extra informationen och avaktivera utskrift av extra spårningsinformation, använd kommandoradsalternativet :option:`\-X no_debug_ranges <-X>` eller miljövariabeln :envvar:`PYTHONNODEBUGRANGES`.

source: PEP 654: Exception Groups and ``except*``
sv: PEP 654: Undantagsgrupper och ``except*``

source: :pep:`654` introduces language features that enable a program to raise and handle multiple unrelated exceptions simultaneously. The builtin types :exc:`ExceptionGroup` and :exc:`BaseExceptionGroup` make it possible to group exceptions and raise them together, and the new :keyword:`except* <except_star>` syntax generalizes :keyword:`except` to match subgroups of exception groups.
sv: :pep:`654` introducerar språkfunktioner som gör det möjligt för ett program att skapa och hantera flera orelaterade undantag samtidigt. De inbyggda typerna :exc:`ExceptionGroup` och :exc:`BaseExceptionGroup` gör det möjligt att gruppera undantag och aktivera dem tillsammans, och den nya syntaxen :keyword:`except* <except_star>` generaliserar :keyword:`except` så att den passar undergrupper av undantagsgrupper.

source: See :pep:`654` for more details.
sv: Se :pep:`654` för mer information.

source: (Contributed by Irit Katriel in :issue:`45292`. PEP written by Irit Katriel, Yury Selivanov and Guido van Rossum.)
sv: (Bidrag från Irit Katriel i :issue:`45292`. PEP skriven av Irit Katriel, Yury Selivanov och Guido van Rossum.)

source: PEP 678: Exceptions can be enriched with notes
sv: PEP 678: Undantag kan kompletteras med anteckningar

source: The :meth:`~BaseException.add_note` method is added to :exc:`BaseException`. It can be used to enrich exceptions with context information that is not available at the time when the exception is raised. The added notes appear in the default traceback.
sv: Metoden :meth:`~BaseException.add_note` har lagts till i :exc:`BaseException`. Den kan användas för att berika undantag med kontextinformation som inte är tillgänglig vid den tidpunkt då undantaget uppstår. De tillagda anteckningarna visas i standardspårningen.

source: See :pep:`678` for more details.
sv: Se :pep:`678` för mer information.

source: (Contributed by Irit Katriel in :issue:`45607`. PEP written by Zac Hatfield-Dodds.)
sv: (Bidrag från Irit Katriel i :issue:`45607`. PEP skriven av Zac Hatfield-Dodds.)

source: Windows ``py.exe`` launcher improvements
sv: Förbättringar av startprogrammet ``py.exe`` i Windows

source: The copy of the :ref:`launcher` included with Python 3.11 has been significantly updated. It now supports company/tag syntax as defined in :pep:`514` using the :samp:`-V:{<company>}/{<tag>}` argument instead of the limited :samp:`-{<major>}.{<minor>}`. This allows launching distributions other than ``PythonCore``, the one hosted on `python.org <https://www.python.org>`_.
sv: Den kopia av :ref:`launcher` som ingår i Python 3.11 har uppdaterats avsevärt. Den stöder nu företags-/taggsyntax enligt definitionen i :pep:`514` och använder argumentet :samp:`\-V:{<company>}/{<tag>}` istället för det begränsade :samp:`\-{<major>}.{<minor>}`. Detta gör det möjligt att starta andra distributioner än ``PythonCore``, den som finns på `python.org <https://www.python.org>`_.

source: When using ``-V:`` selectors, either company or tag can be omitted, but all installs will be searched. For example, ``-V:OtherPython/`` will select the "best" tag registered for ``OtherPython``, while ``-V:3.11`` or ``-V:/3.11`` will select the "best" distribution with tag ``3.11``.
sv: När du använder ``\-V:``\-väljare kan antingen företag eller tagg utelämnas, men alla installationer kommer att sökas. Till exempel kommer ``\-V:OtherPython/`` att välja den "bästa" taggen som är registrerad för ``OtherPython``, medan ``\-V:3.11`` eller ``\-V:/3.11`` kommer att välja den "bästa" distributionen med taggen ``3.11``.

source: When using the legacy :samp:`-{<major>}`, :samp:`-{<major>}.{<minor>}`, :samp:`-{<major>}-{<bitness>}` or :samp:`-{<major>}.{<minor>}-{<bitness>}` arguments, all existing behaviour should be preserved from past versions, and only releases from ``PythonCore`` will be selected. However, the ``-64`` suffix now implies "not 32-bit" (not necessarily x86-64), as there are multiple supported 64-bit platforms. 32-bit runtimes are detected by checking the runtime's tag for a ``-32`` suffix. All releases of Python since 3.5 have included this in their 32-bit builds.
sv: När du använder de äldre argumenten :samp:`\-{<major>}`, :samp:`\-{<major>}.{<minor>}`, :samp:`\-{<major>}-{<bitness>}` eller :samp:`\-{<major>}.{<minor>}-{<bitness>}`, bör allt befintligt beteende bevaras från tidigare versioner, och endast utgåvor från ``PythonCore`` kommer att väljas. Suffixet ``\-64`` innebär dock nu "inte 32-bitars" (inte nödvändigtvis x86-64), eftersom det finns flera 64-bitars plattformar som stöds. 32-bitars körtider upptäcks genom att kontrollera om körtidens tagg innehåller suffixet ``\-32``. Alla utgåvor av Python sedan 3.5 har inkluderat detta i sina 32-bitarsbyggen.

source: New Features Related to Type Hints
sv: Nya funktioner relaterade till typtips

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
sv: Detta avsnitt behandlar större ändringar som påverkar :pep:`484` typtips och modulen :mod:`typing`.

source: PEP 646: Variadic generics
sv: PEP 646: Variadisk generik

source: :pep:`484` previously introduced :data:`~typing.TypeVar`, enabling creation of generics parameterised with a single type. :pep:`646` adds :data:`~typing.TypeVarTuple`, enabling parameterisation with an *arbitrary* number of types. In other words, a :data:`~typing.TypeVarTuple` is a *variadic* type variable, enabling *variadic* generics.
sv: :pep:`484` introducerade tidigare :data:`~typing.TypeVar`, vilket möjliggör skapandet av generiska parametrar med en enda typ. :pep:`646` lägger till :data:`~typing.TypeVarTuple`, vilket möjliggör parametrisering med ett *arbiträrt* antal typer. Med andra ord är en :data:`~typing.TypeVarTuple` en *variadisk* typvariabel som möjliggör *variadisk* generik.

source: This enables a wide variety of use cases. In particular, it allows the type of array-like structures in numerical computing libraries such as NumPy and TensorFlow to be parameterised with the array *shape*. Static type checkers will now be able to catch shape-related bugs in code that uses these libraries.
sv: Detta möjliggör en mängd olika användningsfall. Framför allt kan typen av array-liknande strukturer i numeriska beräkningsbibliotek som NumPy och TensorFlow parametriseras med arrayen *shape*. Statiska typkontroller kommer nu att kunna fånga upp formrelaterade buggar i kod som använder dessa bibliotek.

source: See :pep:`646` for more details.
sv: Se :pep:`646` för mer information.

source: (Contributed by Matthew Rahtz in :issue:`43224`, with contributions by Serhiy Storchaka and Jelle Zijlstra. PEP written by Mark Mendoza, Matthew Rahtz, Pradeep Kumar Srinivasan, and Vincent Siles.)
sv: (Bidrag av Matthew Rahtz i :issue:`43224`, med bidrag av Serhiy Storchaka och Jelle Zijlstra. PEP skriven av Mark Mendoza, Matthew Rahtz, Pradeep Kumar Srinivasan och Vincent Siles)

source: PEP 655: Marking individual ``TypedDict`` items as required or not-required
sv: PEP 655: Märkning av enskilda ``TypedDict``\ -objekt som nödvändiga eller inte nödvändiga

source: :data:`~typing.Required` and :data:`~typing.NotRequired` provide a straightforward way to mark whether individual items in a :class:`~typing.TypedDict` must be present. Previously, this was only possible using inheritance.
sv: :data:`~typing.Required` och :data:`~typing.NotRequired` ger ett enkelt sätt att markera om enskilda objekt i en :class:`~typing.TypedDict` måste finnas. Tidigare var detta endast möjligt med hjälp av arv.

source: All fields are still required by default, unless the *total* parameter is set to ``False``, in which case all fields are still not-required by default. For example, the following specifies a :class:`!TypedDict` with one required and one not-required key::
sv: Alla fält är fortfarande obligatoriska som standard, såvida inte parametern *total* är satt till ``False``, i vilket fall alla fält fortfarande är icke obligatoriska som standard. Följande exempel anger en :class:`!TypedDict` med en obligatorisk och en icke obligatorisk nyckel::

source: The following definition is equivalent::
sv: Följande definition är likvärdig::

source: class Movie(TypedDict, total=False): title: Required[str] year: int
sv: class Movie(TypedDict, total=False): titel: Krävs[str] year: int

source: See :pep:`655` for more details.
sv: Se :pep:`655` för mer information.

source: (Contributed by David Foster and Jelle Zijlstra in :issue:`47087`. PEP written by David Foster.)
sv: (Bidrag från David Foster och Jelle Zijlstra i :issue:`47087`. PEP skriven av David Foster.)

source: PEP 673: ``Self`` type
sv: PEP 673: Typ av ``Self``

source: The new :data:`~typing.Self` annotation provides a simple and intuitive way to annotate methods that return an instance of their class. This behaves the same as the :class:`~typing.TypeVar`-based approach :pep:`specified in PEP 484 <484#annotating-instance-and-class-methods>`, but is more concise and easier to follow.
sv: Den nya :data:`~typing.Self`\-annoteringen ger ett enkelt och intuitivt sätt att annotera metoder som returnerar en instans av sin klass. Detta beter sig på samma sätt som det :class:`~typing.TypeVar`\-baserade tillvägagångssättet :pep:` som specificeras i PEP 484 <484#annotating-instance-and-class-methods>`, men är mer koncist och lättare att följa.

source: Common use cases include alternative constructors provided as :func:`classmethod <classmethod>`\s, and :meth:`~object.__enter__` methods that return ``self``::
sv: Vanliga användningsfall inkluderar alternativa konstruktörer som tillhandahålls som :func:`classmethod <classmethod>`\s, och :meth:`~object.__enter__` metoder som returnerar ``self``::

source: :data:`~typing.Self` can also be used to annotate method parameters or attributes of the same type as their enclosing class.
sv: :data:`~typing.Self` kan också användas för att annotera metodparametrar eller attribut av samma typ som den omslutande klassen.

source: See :pep:`673` for more details.
sv: Se :pep:`673` för mer information.

source: (Contributed by James Hilton-Balfe in :issue:`46534`. PEP written by Pradeep Kumar Srinivasan and James Hilton-Balfe.)
sv: (Bidrag från James Hilton-Balfe i :issue:`46534`. PEP skriven av Pradeep Kumar Srinivasan och James Hilton-Balfe.)

source: PEP 675: Arbitrary literal string type
sv: PEP 675: Godtycklig bokstavlig strängtyp

source: The new :data:`~typing.LiteralString` annotation may be used to indicate that a function parameter can be of any literal string type. This allows a function to accept arbitrary literal string types, as well as strings created from other literal strings. Type checkers can then enforce that sensitive functions, such as those that execute SQL statements or shell commands, are called only with static arguments, providing protection against injection attacks.
sv: Den nya :data:`~typing.LiteralString`\-annoteringen kan användas för att ange att en funktionsparameter kan vara av vilken bokstavlig strängtyp som helst. Detta gör att en funktion kan acceptera godtyckliga bokstavliga strängtyper, liksom strängar som skapats från andra bokstavliga strängar. Typkontrollanter kan då se till att känsliga funktioner, t.ex. sådana som exekverar SQL-satser eller shell-kommandon, endast anropas med statiska argument, vilket ger skydd mot injektionsattacker.

source: For example, a SQL query function could be annotated as follows::
sv: En SQL-frågefunktion kan till exempel annoteras på följande sätt::

source: def run_query(sql: LiteralString) -> ... ... def caller( arbitrary_string: str, query_string: LiteralString, table_name: LiteralString, ) -> None: run_query("SELECT * FROM students") # ok run_query(query_string) # ok run_query("SELECT * FROM " + table_name) # ok run_query(arbitrary_string) # type checker error run_query( # type checker error f"SELECT * FROM students WHERE name = {arbitrary_string}" )
sv: def run_query(sql: LiteralString) -> ... ... def uppringare( godtycklig_sträng: str, query_string: LiteralString, table_name: LitteralString, ) -> Ingen: run_query("SELECT * FROM studenter") # ok run_query(query_string) # ok run_query("SELECT * FROM " + table_name) # ok run_query(godtycklig_sträng) # typkontrollfel run_query( # typkontrollfel f"SELECT * FROM studenter WHERE namn = {arbitrary_string}" )

source: See :pep:`675` for more details.
sv: Se :pep:`675` för mer information.

source: (Contributed by Jelle Zijlstra in :issue:`47088`. PEP written by Pradeep Kumar Srinivasan and Graham Bleaney.)
sv: (Bidrag från Jelle Zijlstra i :issue:`47088`. PEP skriven av Pradeep Kumar Srinivasan och Graham Bleaney.)

source: PEP 681: Data class transforms
sv: PEP 681: Transformation av dataklasser

source: :data:`~typing.dataclass_transform` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class, giving it :func:`dataclass <dataclasses.dataclass>`-like behaviors.
sv: :data:`~typing.dataclass_transform` kan användas för att dekorera en klass, metaklass eller en funktion som i sig är en dekorator. Närvaron av ``@dataclass_transform()`` talar om för en statisk typkontrollant att det dekorerade objektet utför "magi" under körning som transformerar en klass, vilket ger den :func:`dataclass <dataclasses.dataclass>`\-liknande beteenden.

source: For example::
sv: Till exempel::

source: See :pep:`681` for more details.
sv: Se :pep:`681` för mer information.

source: (Contributed by Jelle Zijlstra in :gh:`91860`. PEP written by Erik De Bonte and Eric Traut.)
sv: (Bidrag från Jelle Zijlstra i :gh:`91860`. PEP skriven av Erik De Bonte och Eric Traut)

source: PEP 563 may not be the future
sv: PEP 563 kanske inte är framtiden

source: :pep:`563` Postponed Evaluation of Annotations (the ``from __future__ import annotations`` :ref:`future statement <future>`) that was originally planned for release in Python 3.10 has been put on hold indefinitely. See `this message from the Steering Council <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__ for more information.
sv: :pep:`563` Uppskjuten utvärdering av annotationer (``from __future__ import annotations`` :ref:`future statement <future>`) som ursprungligen var planerad att släppas i Python 3.10 har skjutits upp på obestämd tid. Se `detta meddelande från styrgruppen <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__ för mer information.

source: Other Language Changes
sv: Andra språkliga förändringar

source: Starred unpacking expressions can now be used in :keyword:`for` statements. (See :issue:`46725` for more details.)
sv: Stjärnmärkta uppackningsuttryck kan nu användas i :keyword:`for`\-satser. (Se :issue:`46725` för mer information)

source: Asynchronous :ref:`comprehensions <comprehensions>` are now allowed inside comprehensions in :ref:`asynchronous functions <async def>`. Outer comprehensions implicitly become asynchronous in this case. (Contributed by Serhiy Storchaka in :issue:`33346`.)
sv: Asynkrona :ref:`förståelser <comprehensions>` är nu tillåtna inom förståelser i :ref:`asynkrona funktioner <async def>`. Yttre förståelser blir implicit asynkrona i det här fallet. (Bidrag från Serhiy Storchaka i :issue:`33346`.)

source: A :exc:`TypeError` is now raised instead of an :exc:`AttributeError` in :keyword:`with` statements and :meth:`contextlib.ExitStack.enter_context` for objects that do not support the :term:`context manager` protocol, and in :keyword:`async with` statements and :meth:`contextlib.AsyncExitStack.enter_async_context` for objects not supporting the :term:`asynchronous context manager` protocol. (Contributed by Serhiy Storchaka in :issue:`12022` and :issue:`44471`.)
sv: Ett :exc:`TypeError` tas nu upp istället för ett :exc:`AttributeError` i :keyword:`with`\-satser och :meth:`contextlib.ExitStack.enter_context` för objekt som inte stöder protokollet :term:`context manager`, och i :keyword:`async with`\-satser och :meth:`contextlib.AsyncExitStack.enter_async_context` för objekt som inte stöder protokollet :term:`asynchronous context manager`. (Bidrag från Serhiy Storchaka i :issue:`12022` och :issue:`44471`.)
