Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: Added :meth:`object.__getstate__`, which provides the default implementation of the :meth:`!__getstate__` method. :mod:`copy`\ing and :mod:`pickle`\ing instances of subclasses of builtin types :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict`, :class:`collections.deque`, :class:`weakref.WeakSet`, and :class:`datetime.tzinfo` now copies and pickles instance attributes implemented as :term:`slots <__slots__>`. This change has an unintended side effect: It trips up a small minority of existing Python projects not expecting :meth:`object.__getstate__` to exist. See the later comments on :gh:`70766` for discussions of what workarounds such code may need. (Contributed by Serhiy Storchaka in :issue:`26579`.)
sv: Lagt till :meth:`object.__getstate__`, som ger standardimplementeringen av metoden :meth:`!__getstate__`. :mod:`copy`\ing och :mod:`pickle`\ing av instanser av underklasser av inbyggda typer :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict`, :class:`collections.deque`, :class:`weakref.WeakSet`, och :class:`datetime.tzinfo` nu kopior och pickles av instansattribut implementerade som :term:`slots <__slots__>`. Denna ändring har en oavsiktlig bieffekt: Den ställer till det för en liten minoritet av befintliga Python-projekt som inte förväntar sig att :meth:`object.__getstate__` ska existera. Se de senare kommentarerna till :gh:`70766` för diskussioner om vilka lösningar sådan kod kan behöva. (Bidrag från Serhiy Storchaka i :issue:`26579`.)

source: Added a :option:`-P` command line option and a :envvar:`PYTHONSAFEPATH` environment variable, which disable the automatic prepending to :data:`sys.path` of the script's directory when running a script, or the current directory when using :option:`-c` and :option:`-m`. This ensures only stdlib and installed modules are picked up by :keyword:`import`, and avoids unintentionally or maliciously shadowing modules with those in a local (and typically user-writable) directory. (Contributed by Victor Stinner in :gh:`57684`.)
sv: Lade till ett kommandoradsalternativ :option:`\-P` och en miljövariabel :envvar:`PYTHONSAFEPATH`, som inaktiverar det automatiska tillägget till :data:`sys.path` av skriptets katalog när ett skript körs, eller den aktuella katalogen när :option:`\-c` och :option:`\-m` används. Detta säkerställer att endast stdlib och installerade moduler hämtas av :keyword:`import` och undviker oavsiktlig eller illvillig skuggning av moduler med dem i en lokal (och vanligtvis användbar) katalog. (Bidrag från Victor Stinner i :gh:`57684`.)

source: A ``"z"`` option was added to the :ref:`formatspec` that coerces negative to positive zero after rounding to the format precision. See :pep:`682` for more details. (Contributed by John Belmonte in :gh:`90153`.)
sv: Ett ``"z"``\-alternativ lades till i :ref:`formatspec` som omvandlar negativa till positiva nollor efter avrundning till formatets precision. Se :pep:`682` för mer information. (Bidrag från John Belmonte i :gh:`90153`.)

source: Bytes are no longer accepted on :data:`sys.path`. Support broke sometime between Python 3.2 and 3.6, with no one noticing until after Python 3.10.0 was released. In addition, bringing back support would be problematic due to interactions between :option:`-b` and :data:`sys.path_importer_cache` when there is a mixture of :class:`str` and :class:`bytes` keys. (Contributed by Thomas Grainger in :gh:`91181`.)
sv: Bytes accepteras inte längre på :data:`sys.path`. Stödet upphörde någon gång mellan Python 3.2 och 3.6, utan att någon märkte det förrän efter att Python 3.10.0 släpptes. Dessutom skulle det vara problematiskt att återinföra stöd på grund av interaktioner mellan :option:`\-b` och :data:`sys.path_importer_cache` när det finns en blandning av :class:`str` och :class:`bytes` nycklar. (Bidrag från Thomas Grainger i :gh:`91181`.)

source: Other CPython Implementation Changes
sv: Andra ändringar i implementeringen av CPython

source: The special methods :meth:`~object.__complex__` for :class:`complex` and :meth:`~object.__bytes__` for :class:`bytes` are implemented to support the :class:`typing.SupportsComplex` and :class:`typing.SupportsBytes` protocols. (Contributed by Mark Dickinson and Donghee Na in :issue:`24234`.)
sv: Specialmetoderna :meth:`~object.__complex__` för :class:`complex` och :meth:`~object.__bytes__` för :class:`bytes` är implementerade för att stödja protokollen :class:`typing.SupportsComplex` och :class:`typing.SupportsBytes`. (Bidrag från Mark Dickinson och Donghee Na i :issue:`24234`.)

source: ``siphash13`` is added as a new internal hashing algorithm. It has similar security properties as ``siphash24``, but it is slightly faster for long inputs. :class:`str`, :class:`bytes`, and some other types now use it as the default algorithm for :func:`hash`. :pep:`552` :ref:`hash-based .pyc files <pyc-invalidation>` now use ``siphash13`` too. (Contributed by Inada Naoki in :issue:`29410`.)
sv: ``siphash13`` har lagts till som en ny intern hashingalgoritm. Den har liknande säkerhetsegenskaper som ``siphash24``, men den är något snabbare för långa inmatningar. :class:`str`, :class:`bytes`, och några andra typer använder den nu som standardalgoritm för :func:`hash`. :pep:`552` :ref:`hash-baserade .pyc-filer <pyc-invalidation>` använder nu ``siphash13`` också. (Bidrag från Inada Naoki i :issue:`29410`.)

source: When an active exception is re-raised by a :keyword:`raise` statement with no parameters, the traceback attached to this exception is now always ``sys.exc_info()[1].__traceback__``. This means that changes made to the traceback in the current :keyword:`except` clause are reflected in the re-raised exception. (Contributed by Irit Katriel in :issue:`45711`.)
sv: När ett aktivt undantag återaktiveras med en :keyword:`raise`\-sats utan parametrar, är nu spårningen som är kopplad till detta undantag alltid ``sys.exc_info()[1].__traceback__``. Detta innebär att ändringar som görs i spårningen i den aktuella :keyword:`except`\-satsen återspeglas i det återaktiverade undantaget. (Bidrag från Irit Katriel i :issue:`45711`.)

source: The interpreter state's representation of handled exceptions (aka ``exc_info`` or ``_PyErr_StackItem``) now only has the ``exc_value`` field; ``exc_type`` and ``exc_traceback`` have been removed, as they can be derived from ``exc_value``. (Contributed by Irit Katriel in :issue:`45711`.)
sv: Tolkstatens representation av hanterade undantag (aka ``exc_info`` eller ``_PyErr_StackItem``) har nu bara fältet ``exc_value``; ``exc_type`` och ``exc_traceback`` har tagits bort, eftersom de kan härledas från ``exc_value``. (Bidrag från Irit Katriel i :issue:`45711`.)

source: A new :ref:`command line option <install-quiet-option>`, ``AppendPath``, has been added for the Windows installer. It behaves similarly to ``PrependPath``, but appends the install and scripts directories instead of prepending them. (Contributed by Bastian Neuburger in :issue:`44934`.)
sv: Ett nytt :ref:`kommandoradsalternativ <install-quiet-option>`, ``AppendPath``, har lagts till för Windows-installationsprogrammet. Det fungerar på samma sätt som ``PrependPath``, men lägger till install- och skriptkatalogerna istället för att lägga till dem först. (Bidrag från Bastian Neuburger i :issue:`44934`.)

source: The :c:member:`PyConfig.module_search_paths_set` field must now be set to ``1`` for initialization to use :c:member:`PyConfig.module_search_paths` to initialize :data:`sys.path`. Otherwise, initialization will recalculate the path and replace any values added to ``module_search_paths``.
sv: Fältet :c:member:`PyConfig.module_search_paths_set` måste nu vara inställt på ``1`` för att initieringen ska använda :c:member:`PyConfig.module_search_paths` för att initiera :data:`sys.path`. Annars kommer initieringen att räkna om sökvägen och ersätta alla värden som lagts till i ``module_search_paths``.

source: The output of the :option:`--help` option now fits in 50 lines/80 columns. Information about :ref:`Python environment variables <using-on-envvars>` and :option:`-X` options is now available using the respective :option:`--help-env` and :option:`--help-xoptions` flags, and with the new :option:`--help-all`. (Contributed by Éric Araujo in :issue:`46142`.)
sv: Utdata från alternativet :option:`\--help` ryms nu på 50 rader/80 kolumner. Information om :ref:`Python-miljövariabler <using-on-envvars>` och :option:`\-X`\-alternativ finns nu tillgänglig med respektive :option:`\--help-env` och :option:`\--help-xoptions`\-flaggor, och med det nya :option:`\--help-all`. (Bidrag från Éric Araujo i :issue:`46142`.)

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
sv: Konvertering mellan :class:`int` och :class:`str` i andra baser än 2 (binär), 4, 8 (oktal), 16 (hexadecimal) eller 32 såsom bas 10 (decimal) ger nu upphov till ett :exc:`ValueError` om antalet siffror i strängform är över en gräns för att undvika potentiella överbelastningsattacker på grund av den algoritmiska komplexiteten. Detta är en begränsning av :cve:`2020-10735`. Den här gränsen kan konfigureras eller inaktiveras med hjälp av en miljövariabel, kommandoradsflagga eller :mod:`sys` API:er. Se dokumentationen :ref:`Längdsbegränsning för konvertering av heltalssträngar <int_max_str_digits>`. Standardgränsen är 4300 siffror i strängform.

source: New Modules
sv: Nya moduler

source: :mod:`tomllib`: For parsing `TOML <https://toml.io/>`_. See :pep:`680` for more details. (Contributed by Taneli Hukkinen in :issue:`40059`.)
sv: :mod:`tomllib`: För parsning av `TOML <https://toml.io/>`_. Se :pep:`680` för mer information. (Bidrag från Taneli Hukkinen i :issue:`40059`.)

source: :mod:`wsgiref.types`: :pep:`WSGI <3333>`-specific types for static type checking. (Contributed by Sebastian Rittau in :issue:`42012`.)
sv: :mod:`wsgiref.types`: :pep:`WSGI <3333>`\-specifika typer för statisk typkontroll. (Bidrag från Sebastian Rittau i :issue:`42012`.)

source: Improved Modules
sv: Förbättrade moduler

source: Added the :class:`~asyncio.TaskGroup` class, an :ref:`asynchronous context manager <async-context-managers>` holding a group of tasks that will wait for all of them upon exit. For new code this is recommended over using :func:`~asyncio.create_task` and :func:`~asyncio.gather` directly. (Contributed by Yury Selivanov and others in :gh:`90908`.)
sv: Lade till :class:`~asyncio.TaskGroup`\-klassen, en :ref:`asynkron kontexthanterare <async-context-managers>` som håller en grupp uppgifter som väntar på dem alla vid avslut. För ny kod rekommenderas detta framför att använda :func:`~asyncio.create_task` och :func:`~asyncio.gather` direkt. (Bidrag från Yury Selivanov och andra i :gh:`90908`.)

source: Added :func:`~asyncio.timeout`, an asynchronous context manager for setting a timeout on asynchronous operations. For new code this is recommended over using :func:`~asyncio.wait_for` directly. (Contributed by Andrew Svetlov in :gh:`90927`.)
sv: Lagt till :func:`~asyncio.timeout`, en asynkron kontexthanterare för att ställa in en timeout för asynkrona operationer. För ny kod rekommenderas detta framför att använda :func:`~asyncio.wait_for` direkt. (Bidrag från Andrew Svetlov i :gh:`90927`.)

source: Added the :class:`~asyncio.Runner` class, which exposes the machinery used by :func:`~asyncio.run`. (Contributed by Andrew Svetlov in :gh:`91218`.)
sv: Lagt till klassen :class:`~asyncio.Runner`, som exponerar maskineriet som används av :func:`~asyncio.run`. (Bidrag från Andrew Svetlov i :gh:`91218`.)

source: Added the :class:`~asyncio.Barrier` class to the synchronization primitives in the asyncio library, and the related :exc:`~asyncio.BrokenBarrierError` exception. (Contributed by Yves Duprat and Andrew Svetlov in :gh:`87518`.)
sv: Lade till klassen :class:`~asyncio.Barrier` till synkroniseringsprimitiven i asynciobiblioteket, och det relaterade undantaget :exc:`~asyncio.BrokenBarrierError`. (Bidrag från Yves Duprat och Andrew Svetlov i :gh:`87518`.)

source: Added keyword argument *all_errors* to :meth:`asyncio.loop.create_connection` so that multiple connection errors can be raised as an :exc:`ExceptionGroup`.
sv: Lade till nyckelordsargumentet *all_errors* till :meth:`asyncio.loop.create_connection` så att flera anslutningsfel kan tas upp som en :exc:`ExceptionGroup`.

source: Added the :meth:`asyncio.StreamWriter.start_tls` method for upgrading existing stream-based connections to TLS. (Contributed by Ian Good in :issue:`34975`.)
sv: Lagt till :meth:`asyncio.StreamWriter.start_tls`\-metoden för att uppgradera befintliga strömbaserade anslutningar till TLS. (Bidrag från Ian Good i :issue:`34975`.)

source: Added raw datagram socket functions to the event loop: :meth:`~asyncio.loop.sock_sendto`, :meth:`~asyncio.loop.sock_recvfrom` and :meth:`~asyncio.loop.sock_recvfrom_into`. These have implementations in :class:`~asyncio.SelectorEventLoop` and :class:`~asyncio.ProactorEventLoop`. (Contributed by Alex Grönholm in :issue:`46805`.)
sv: Lagt till raw datagram socket funktioner till eventloopen: :meth:`~asyncio.loop.sock_sendto`, :meth:`~asyncio.loop.sock_recvfrom` och :meth:`~asyncio.loop.sock_recvfrom_into`. Dessa har implementeringar i :class:`~asyncio.SelectorEventLoop` och :class:`~asyncio.ProactorEventLoop`. (Bidrag från Alex Grönholm i :issue:`46805`.)

source: Added :meth:`~asyncio.Task.cancelling` and :meth:`~asyncio.Task.uncancel` methods to :class:`~asyncio.Task`. These are primarily intended for internal use, notably by :class:`~asyncio.TaskGroup`.
sv: Lagt till :meth:`~asyncio.Task.cancelling` och :meth:`~asyncio.Task.uncancel` metoder till :class:`~asyncio.Task`. Dessa är främst avsedda för intern användning, särskilt av :class:`~asyncio.TaskGroup`.

source: Added non parallel-safe :func:`~contextlib.chdir` context manager to change the current working directory and then restore it on exit. Simple wrapper around :func:`~os.chdir`. (Contributed by Filipe Laíns in :issue:`25625`)
sv: Lagt till icke parallell-säker :func:`~contextlib.chdir` kontexthanterare för att ändra den aktuella arbetskatalogen och sedan återställa den vid avslutning. Enkelt omslag runt :func:`~os.chdir`. (Bidrag från Filipe Laíns i :issue:`25625`)

source: dataclasses
sv: dataklasser

source: Change field default mutability check, allowing only defaults which are :term:`hashable` instead of any object which is not an instance of :class:`dict`, :class:`list` or :class:`set`. (Contributed by Eric V. Smith in :issue:`44674`.)
sv: Ändra kontrollen av fältets föränderlighet så att endast standardvärden som är :term:`hashable` tillåts istället för alla objekt som inte är en instans av :class:`dict`, :class:`list` eller :class:`set`. (Bidrag från Eric V. Smith i :issue:`44674`.)

source: datetime
sv: datatid

source: Add :const:`datetime.UTC`, a convenience alias for :attr:`datetime.timezone.utc`. (Contributed by Kabir Kwatra in :gh:`91973`.)
sv: Lägg till :const:`datetime.UTC`, ett bekvämt alias för :attr:`datetime.timezone.utc`. (Bidrag från Kabir Kwatra i :gh:`91973`.)

source: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` and :meth:`datetime.datetime.fromisoformat` can now be used to parse most ISO 8601 formats (barring only those that support fractional hours and minutes). (Contributed by Paul Ganssle in :gh:`80010`.)
sv: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` och :meth:`datetime.datetime.fromisoformat` kan nu användas för att tolka de flesta ISO 8601-format (utom de som stöder bråkdelar av timmar och minuter). (Bidrag från Paul Ganssle i :gh:`80010`.)

source: Renamed :class:`!EnumMeta` to :class:`~enum.EnumType` (:class:`!EnumMeta` kept as an alias).
sv: Bytte namn på :class:`!EnumMeta` till :class:`~enum.EnumType` (:class:`!EnumMeta` behölls som ett alias).

source: Added :class:`~enum.StrEnum`, with members that can be used as (and must be) strings.
sv: Lagt till :class:`~enum.StrEnum`, med medlemmar som kan användas som (och måste vara) strängar.

source: Added :class:`~enum.ReprEnum`, which only modifies the :meth:`~object.__repr__` of members while returning their literal values (rather than names) for :meth:`~object.__str__` and :meth:`~object.__format__` (used by :func:`str`, :func:`format` and :term:`f-string`\s).
sv: Lade till :class:`~enum.ReprEnum`, som endast modifierar :meth:`~object.__repr__` av medlemmar medan den returnerar deras bokstavliga värden (snarare än namn) för :meth:`~object.__str__` och :meth:`~object.__format__` (används av :func:`str`, :func:`format` och :term:`f-string`\s).

source: Changed :meth:`Enum.__format__() <enum.Enum.__format__>` (the default for :func:`format`, :meth:`str.format` and :term:`f-string`\s) to always produce the same result as :meth:`Enum.__str__() <enum.Enum.__str__>`: for enums inheriting from :class:`~enum.ReprEnum` it will be the member's value; for all other enums it will be the enum and member name (e.g. ``Color.RED``).
sv: Ändrat :meth:`Enum.__format__() <enum.Enum.__format__>` (standard för :func:`format`, :meth:`str.format` och :term:`f-string`\s) så att det alltid ger samma resultat som :meth:`Enum.__str__() <enum.Enum.__str__>`: för enumer som ärver från :class:`~enum.ReprEnum` kommer det att vara medlemmens värde; för alla andra enumer kommer det att vara enum- och medlemsnamnet (t.ex. ``Color.RED``).

source: Added a new *boundary* class parameter to :class:`~enum.Flag` enums and the :class:`~enum.FlagBoundary` enum with its options, to control how to handle out-of-range flag values.
sv: En ny klass-parameter *boundary* har lagts till i enum :class:`~enum.Flag` och enum :class:`~enum.FlagBoundary` med dess alternativ, för att styra hur flaggvärden utanför intervallet ska hanteras.

source: Added the :func:`~enum.verify` enum decorator and the :class:`~enum.EnumCheck` enum with its options, to check enum classes against several specific constraints.
sv: Lade till :func:`~enum.verify` enum-dekoratorn och :class:`~enum.EnumCheck` enum med dess alternativ, för att kontrollera enumklasser mot flera specifika begränsningar.

source: Added the :func:`~enum.member` and :func:`~enum.nonmember` decorators, to ensure the decorated object is/is not converted to an enum member.
sv: Lade till dekoratorerna :func:`~enum.member` och :func:`~enum.nonmember` för att säkerställa att det dekorerade objektet konverteras/inte konverteras till en enum-medlem.

source: Added the :func:`~enum.property` decorator, which works like :func:`property` except for enums. Use this instead of :func:`types.DynamicClassAttribute`.
sv: Lade till :func:`~enum.property` dekoratorn, som fungerar som :func:`property` förutom för enum. Använd denna istället för :func:`types.DynamicClassAttribute`.

source: Added the :func:`~enum.global_enum` enum decorator, which adjusts :meth:`~object.__repr__` and :meth:`~object.__str__` to show values as members of their module rather than the enum class. For example, ``'re.ASCII'`` for the :const:`~re.ASCII` member of :class:`re.RegexFlag` rather than ``'RegexFlag.ASCII'``.
sv: Lade till enumdekoratorn :func:`~enum.global_enum`, som justerar :meth:`~object.__repr__` och :meth:`~object.__str__` så att värden visas som medlemmar i deras modul i stället för i enumklassen. Till exempel ``'re.ASCII'`` för :const:`~re.ASCII`\-medlemmen i :class:`re.RegexFlag` i stället för ``'RegexFlag.ASCII'``.

source: Enhanced :class:`~enum.Flag` to support :func:`len`, iteration and :keyword:`in`/:keyword:`not in` on its members. For example, the following now works: ``len(AFlag(3)) == 2 and list(AFlag(3)) == (AFlag.ONE, AFlag.TWO)``
sv: Förbättrade :class:`~enum.Flag` för att stödja :func:`len`, iteration och :keyword:`in`/:keyword:`not in` på dess medlemmar. Till exempel fungerar följande nu: ``len(AFlag(3)) == 2 and list(AFlag(3)) == (AFlag.ONE, AFlag.TWO)``

source: Changed :class:`~enum.Enum` and :class:`~enum.Flag` so that members are now defined before :meth:`~object.__init_subclass__` is called; :func:`dir` now includes methods, etc., from mixed-in data types.
sv: Ändrade :class:`~enum.Enum` och :class:`~enum.Flag` så att medlemmar nu definieras innan :meth:`~object.__init_subclass__` anropas; :func:`dir` inkluderar nu metoder etc. från mixade datatyper.

source: Changed :class:`~enum.Flag` to only consider primary values (power of two) canonical while composite values (``3``, ``6``, ``10``, etc.) are considered aliases; inverted flags are coerced to their positive equivalent.
sv: Ändrad :class:`~enum.Flag` för att endast betrakta primära värden (potens av två) som kanoniska medan sammansatta värden (``3``, ``6``, ``10``, etc.) betraktas som alias; inverterade flaggor tvingas till sin positiva motsvarighet.

source: On FreeBSD, the :data:`!F_DUP2FD` and :data:`!F_DUP2FD_CLOEXEC` flags respectively are supported, the former equals to ``dup2`` usage while the latter set the ``FD_CLOEXEC`` flag in addition.
sv: På FreeBSD stöds flaggorna :data:`!F_DUP2FD` respektive :data:`!F_DUP2FD_CLOEXEC`, den förra motsvarar ``dup2``\-användning medan den senare dessutom sätter flaggan ``FD_CLOEXEC``.

source: fractions
sv: fraktioner

source: Support :PEP:`515`-style initialization of :class:`~fractions.Fraction` from string. (Contributed by Sergey B Kirpichev in :issue:`44258`.)
sv: Stödjer :PEP:`515`\-stil initialisering av :class:`~fractions.Fraction` från sträng. (Bidrag från Sergey B Kirpichev i :issue:`44258`.)

source: :class:`~fractions.Fraction` now implements an ``__int__`` method, so that an ``isinstance(some_fraction, typing.SupportsInt)`` check passes. (Contributed by Mark Dickinson in :issue:`44547`.)
sv: :class:`~fractions.Fraction` implementerar nu en ``__int__`` metod, så att en ``isinstance(some_fraction, typing.SupportsInt)`` kontroll godkänns. (Bidrag från Mark Dickinson i :issue:`44547`.)

source: :func:`functools.singledispatch` now supports :class:`types.UnionType` and :class:`typing.Union` as annotations to the dispatch argument.::
sv: :func:`functools.singledispatch` stöder nu :class:`types.UnionType` och :class:`typing.Union` som annotationer till dispatch-argumentet.::

source: (Contributed by Yurii Karabas in :issue:`46014`.)
sv: (Bidrag från Yurii Karabas i :issue:`46014`.)
