Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: :meth:`!unittest.TestProgram.usageExit` is marked deprecated, to be removed in 3.13. (Contributed by Carlos Damázio in :gh:`67048`.)
sv: :meth:`!unittest.TestProgram.usageExit` är markerad som föråldrad och kommer att tas bort i 3.13. (Bidrag från Carlos Damázio i :gh:`67048`.)

source: Pending Removal in Python 3.12
sv: Väntar på borttagning i Python 3.12

source: The following Python APIs have been deprecated in earlier Python releases, and will be removed in Python 3.12.
sv: Följande Python API:er har utgått i tidigare Python-utgåvor och kommer att tas bort i Python 3.12.

source: C APIs pending removal are :ref:`listed separately <whatsnew311-c-api-pending-removal>`.
sv: C API:er som väntar på att tas bort är :ref:`listade separat <whatsnew311-c-api-pending-removal>`.

source: The :mod:`!asynchat` module
sv: Modulen :mod:`!asynchat`

source: The :mod:`!asyncore` module
sv: Modulen :mod:`!asyncore`

source: The :ref:`entire distutils package <distutils-deprecated>`
sv: Paketet :ref:`entire distutils <distutils-deprecated>`

source: The :mod:`!imp` module
sv: Modulen :mod:`!imp`

source: The :class:`typing.io <typing.IO>` namespace
sv: Namnrymden :class:`typing.io <typing.IO>`

source: The :class:`typing.re <typing.Pattern>` namespace
sv: Namnrymden :class:`typing.re <typing.Pattern>`

source: :envvar:`!PYTHONTHREADDEBUG` environment variable
sv: :envvar:`!PYTHONTHREADDEBUG` miljövariabel

source: The following deprecated aliases in :mod:`unittest`:
sv: Följande föråldrade alias i :mod:`unittest`:

source: Deprecated alias
sv: Föråldrat alias

source: Method Name
sv: Metod Namn

source: Deprecated in
sv: Avskrivna i

source: ``failUnlessAlmostEqual``
sv: "misslyckas utan undantag nästan lika

source: Removed
sv: Borttagen

source: This section lists Python APIs that have been removed in Python 3.11.
sv: I detta avsnitt listas Python API:er som har tagits bort i Python 3.11.

source: Removed C APIs are :ref:`listed separately <whatsnew311-c-api-removed>`.
sv: Borttagna C API:er är :ref:`listade separat <whatsnew311-c-api-removed>`.

source: Removed the :func:`!@asyncio.coroutine` :term:`decorator` enabling legacy generator-based coroutines to be compatible with :keyword:`async` / :keyword:`await` code. The function has been deprecated since Python 3.8 and the removal was initially scheduled for Python 3.10. Use :keyword:`async def` instead. (Contributed by Illia Volochii in :issue:`43216`.)
sv: Tog bort :func:`!@asyncio.coroutine` :term:`decorator` som gör det möjligt för äldre generatorbaserade coroutines att vara kompatibla med :keyword:`async` / :keyword:`await`\-kod. Funktionen har varit föråldrad sedan Python 3.8 och borttagningen var ursprungligen planerad till Python 3.10. Använd :keyword:`async def` istället. (Bidrag från Illia Volochii i :issue:`43216`.)

source: Removed :class:`!asyncio.coroutines.CoroWrapper` used for wrapping legacy generator-based coroutine objects in the debug mode. (Contributed by Illia Volochii in :issue:`43216`.)
sv: Tog bort :class:`!asyncio.coroutines.CoroWrapper` som används för att paketera äldre generatorbaserade coroutine-objekt i felsökningsläget. (Bidrag från Illia Volochii i :issue:`43216`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint`, disabled in Python 3.9, is now entirely removed. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. (Contributed by Hugo van Kemenade in :issue:`45129`.)
sv: På grund av betydande säkerhetsproblem är parametern *reuse_address* i :meth:`asyncio.loop.create_datagram_endpoint`, som inaktiverades i Python 3.9, nu helt borttagen. Detta beror på beteendet hos socket-alternativet ``SO_REUSEADDR`` i UDP. (Bidrag från Hugo van Kemenade i :issue:`45129`.)

source: Removed the :mod:`!binhex` module, deprecated in Python 3.9. Also removed the related, similarly-deprecated :mod:`binascii` functions:
sv: Tog bort modulen :mod:`!binhex`, föråldrad i Python 3.9. Tog även bort de relaterade, likaledes föråldrade :mod:`binascii`\-funktionerna:

source: The :func:`binascii.crc_hqx` function remains available.
sv: Funktionen :func:`binascii.crc_hqx` är fortfarande tillgänglig.

source: (Contributed by Victor Stinner in :issue:`45085`.)
sv: (Bidrag från Victor Stinner i :issue:`45085`.)

source: Removed the :mod:`!distutils` ``bdist_msi`` command deprecated in Python 3.9. Use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`45124`.)
sv: Tog bort kommandot :mod:`!distutils` ``bdist_msi`` som är föråldrat i Python 3.9. Använd ``bdist_wheel`` (wheel-paket) istället. (Bidrag från Hugo van Kemenade i :issue:`45124`.)

source: Removed the :meth:`~object.__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput`, deprecated since Python 3.9. (Contributed by Hugo van Kemenade in :issue:`45132`.)
sv: Tog bort :meth:`~object.__getitem__`\-metoderna för :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` och :class:`fileinput.FileInput`, föråldrade sedan Python 3.9. (Bidrag från Hugo van Kemenade i :issue:`45132`.)

source: Removed the deprecated :mod:`gettext` functions :func:`!lgettext`, :func:`!ldgettext`, :func:`!lngettext` and :func:`!ldngettext`. Also removed the :func:`!bind_textdomain_codeset` function, the :meth:`!NullTranslations.output_charset` and :meth:`!NullTranslations.set_output_charset` methods, and the *codeset* parameter of :func:`!translation` and :func:`!install`, since they are only used for the :func:`!l*gettext` functions. (Contributed by Donghee Na and Serhiy Storchaka in :issue:`44235`.)
sv: Tog bort de föråldrade :mod:`gettext`\-funktionerna :func:`!lgettext`, :func:`!ldgettext`, :func:`!lngettext` och :func:`!ldngettext`. Tog även bort funktionen :func:`!bind_textdomain_codeset`, metoderna :meth:`!NullTranslations.output_charset` och :meth:`!NullTranslations.set_output_charset`, samt parametern *codeset* i :func:`!translation` och :func:`!install`, eftersom de endast används för funktionerna :func:`!l*gettext`. (Bidrag från Donghee Na och Serhiy Storchaka i :issue:`44235`.)

source: Removed from the :mod:`inspect` module:
sv: Borttagen från modulen :mod:`inspect`:

source: The :func:`!getargspec` function, deprecated since Python 3.0; use :func:`inspect.signature` or :func:`inspect.getfullargspec` instead.
sv: Funktionen :func:`!getargspec`, föråldrad sedan Python 3.0; använd :func:`inspect.signature` eller :func:`inspect.getfullargspec` istället.

source: The :func:`!formatargspec` function, deprecated since Python 3.5; use the :func:`inspect.signature` function or the :class:`inspect.Signature` object directly.
sv: Funktionen :func:`!formatargspec`, föråldrad sedan Python 3.5; använd funktionen :func:`inspect.signature` eller objektet :class:`inspect.Signature` direkt.

source: The undocumented :meth:`!Signature.from_builtin` and :meth:`!Signature.from_function` methods, deprecated since Python 3.5; use the :meth:`Signature.from_callable() <inspect.Signature.from_callable>` method instead.
sv: De odokumenterade metoderna :meth:`!Signature.from_builtin` och :meth:`!Signature.from_function`, föråldrade sedan Python 3.5; använd istället metoden :meth:`Signature.from_callable() <inspect.Signature.from_callable>`.

source: (Contributed by Hugo van Kemenade in :issue:`45320`.)
sv: (Bidrag från Hugo van Kemenade i :issue:`45320`.)

source: Removed the :meth:`~object.__class_getitem__` method from :class:`pathlib.PurePath`, because it was not used and added by mistake in previous versions. (Contributed by Nikita Sobolev in :issue:`46483`.)
sv: Tog bort metoden :meth:`~object.__class_getitem__` från :class:`pathlib.PurePath`, eftersom den inte användes och lades till av misstag i tidigare versioner. (Bidrag från Nikita Sobolev i :issue:`46483`.)

source: Removed the :class:`!MailmanProxy` class in the :mod:`!smtpd` module, as it is unusable without the external :mod:`!mailman` package. (Contributed by Donghee Na in :issue:`35800`.)
sv: Tog bort klassen :class:`!MailmanProxy` i modulen :mod:`!smtpd`, eftersom den är oanvändbar utan det externa paketet :mod:`!mailman`. (Bidrag från Donghee Na i :issue:`35800`.)

source: Removed the deprecated :meth:`!split` method of :class:`!_tkinter.TkappType`. (Contributed by Erlend E. Aasland in :issue:`38371`.)
sv: Tog bort den föråldrade :meth:`!split`\-metoden i :class:`!_tkinter.TkappType`. (Bidrag från Erlend E. Aasland i :issue:`38371`.)

source: Removed namespace package support from :mod:`unittest` discovery. It was introduced in Python 3.4 but has been broken since Python 3.7. (Contributed by Inada Naoki in :issue:`23882`.)
sv: Tog bort stöd för namnrymdspaket från :mod:`unittest`\-upptäckt. Det introducerades i Python 3.4 men har varit trasigt sedan Python 3.7. (Bidrag från Inada Naoki i :issue:`23882`.)

source: Removed the undocumented private :meth:`!float.__set_format__` method, previously known as :meth:`!float.__setformat__` in Python 3.7. Its docstring said: "You probably don't want to use this function. It exists mainly to be used in Python's test suite." (Contributed by Victor Stinner in :issue:`46852`.)
sv: Tog bort den odokumenterade privata metoden :meth:`!float.__set_format__`, tidigare känd som :meth:`!float.__setformat__` i Python 3.7. Dess docstring sa: "Du vill förmodligen inte använda den här funktionen. Den existerar främst för att användas i Pythons testsvit." (Bidrag från Victor Stinner i :issue:`46852`.)

source: The :option:`!--experimental-isolated-subinterpreters` configure flag (and corresponding :c:macro:`!EXPERIMENTAL_ISOLATED_SUBINTERPRETERS` macro) have been removed.
sv: Konfigurationsflaggan :option:`!--experimental-isolated-subinterpreters` (och motsvarande makro :c:macro:`!EXPERIMENTAL_ISOLATED_SUBINTERPRETERS`) har tagits bort.

source: :pypi:`Pynche` --- The Pythonically Natural Color and Hue Editor --- has been moved out of ``Tools/scripts`` and is `being developed independently <https://gitlab.com/warsaw/pynche/-/tree/main>`_ from the Python source tree.
sv: :pypi:`Pynche` --- The Pythonically Natural Color and Hue Editor --- har flyttats från ``Tools/scripts`` och `utvecklas nu oberoende <https://gitlab.com/warsaw/pynche/-/tree/main>`_ från Pythons källkodsträd.

source: Porting to Python 3.11
sv: Portning till Python 3.11

source: This section lists previously described changes and other bugfixes in the Python API that may require changes to your Python code.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar i Python API som kan kräva ändringar i din Python-kod.

source: Porting notes for the C API are :ref:`listed separately <whatsnew311-c-api-porting>`.
sv: Anteckningar om portning av C API finns :ref:`listade separat <whatsnew311-c-api-porting>`.

source: :func:`open`, :func:`io.open`, :func:`codecs.open` and :class:`fileinput.FileInput` no longer accept ``'U'`` ("universal newline") in the file mode. In Python 3, "universal newline" mode is used by default whenever a file is opened in text mode, and the ``'U'`` flag has been deprecated since Python 3.3. The :ref:`newline parameter <open-newline-parameter>` to these functions controls how universal newlines work. (Contributed by Victor Stinner in :issue:`37330`.)
sv: :func:`open`, :func:`io.open`, :func:`codecs.open` och :class:`fileinput.FileInput` accepterar inte längre ``'U'`` ("universal newline") i filläget. I Python 3 används "universal newline"-läget som standard när en fil öppnas i textläge, och flaggan ``'U'`` har utgått sedan Python 3.3. Parametern :ref:`newline <open-newline-parameter>` till dessa funktioner kontrollerar hur universella nya rader fungerar. (Bidrag från Victor Stinner i :issue:`37330`.)

source: :class:`ast.AST` node positions are now validated when provided to :func:`compile` and other related functions. If invalid positions are detected, a :exc:`ValueError` will be raised. (Contributed by Pablo Galindo in :gh:`93351`)
sv: :class:`ast.AST` nodpositioner valideras nu när de anges till :func:`compile` och andra relaterade funktioner. Om ogiltiga positioner upptäcks kommer ett :exc:`ValueError` att visas. (Bidrag från Pablo Galindo i :gh:`93351`)

source: Prohibited passing non-:class:`concurrent.futures.ThreadPoolExecutor` executors to :meth:`asyncio.loop.set_default_executor` following a deprecation in Python 3.8. (Contributed by Illia Volochii in :issue:`43234`.)
sv: Förbjöd att skicka non-:class:`concurrent.futures.ThreadPoolExecutor`\-exekutorer till :meth:`asyncio.loop.set_default_executor` efter en deprecation i Python 3.8. (Bidrag från Illia Volochii i :issue:`43234`.)

source: :mod:`calendar`: The :class:`calendar.LocaleTextCalendar` and :class:`calendar.LocaleHTMLCalendar` classes now use :func:`locale.getlocale`, instead of using :func:`locale.getdefaultlocale`, if no locale is specified. (Contributed by Victor Stinner in :issue:`46659`.)
sv: :mod:`calendar`: Klasserna :class:`calendar.LocaleTextCalendar` och :class:`calendar.LocaleHTMLCalendar` använder nu :func:`locale.getlocale`, istället för att använda :func:`locale.getdefaultlocale`, om ingen locale är specificerad. (Bidrag från Victor Stinner i :issue:`46659`.)

source: The :mod:`pdb` module now reads the :file:`.pdbrc` configuration file with the ``'UTF-8'`` encoding. (Contributed by Srinivas Reddy Thatiparthy (శ్రీనివాస్ రెడ్డి తాటిపర్తి) in :issue:`41137`.)
sv: Modulen :mod:`pdb` läser nu konfigurationsfilen :file:`.pdbrc` med kodningen ``'UTF-8'``. (Bidrag från Srinivas Reddy Thatiparthy (శ్రీనివాస్ రెడ్డి తాటిపర్తి) i :issue:`41137`.)

source: The *population* parameter of :func:`random.sample` must be a sequence, and automatic conversion of :class:`set`\s to :class:`list`\s is no longer supported. Also, if the sample size is larger than the population size, a :exc:`ValueError` is raised. (Contributed by Raymond Hettinger in :issue:`40465`.)
sv: Parametern *population* i :func:`random.sample` måste vara en sekvens, och automatisk konvertering av :class:`set` till :class:`list` stöds inte längre. Om urvalsstorleken är större än populationsstorleken uppstår dessutom ett :exc:`ValueError`. (Bidrag från Raymond Hettinger i :issue:`40465`.)

source: The *random* optional parameter of :func:`random.shuffle` was removed. It was previously an arbitrary random function to use for the shuffle; now, :func:`random.random` (its previous default) will always be used.
sv: Den valfria parametern *random* i :func:`random.shuffle` togs bort. Tidigare var det en godtycklig slumpfunktion som användes för blandningen; nu kommer :func:`random.random` (dess tidigare standard) alltid att användas.

source: In :mod:`re` :ref:`re-syntax`, global inline flags (e.g. ``(?i)``) can now only be used at the start of regular expressions. Using them elsewhere has been deprecated since Python 3.6. (Contributed by Serhiy Storchaka in :issue:`47066`.)
sv: I :mod:`re` :ref:`re-syntax` kan globala inline-flaggor (t.ex. ``(?i)``) nu bara användas i början av reguljära uttryck. Att använda dem på andra ställen har varit förbjudet sedan Python 3.6. (Bidrag från Serhiy Storchaka i :issue:`47066`.)

source: In the :mod:`re` module, several long-standing bugs where fixed that, in rare cases, could cause capture groups to get the wrong result. Therefore, this could change the captured output in these cases. (Contributed by Ma Lin in :issue:`35859`.)
sv: I modulen :mod:`re` har flera gamla buggar åtgärdats som i sällsynta fall kunde leda till att fångstgrupper fick fel resultat. Därför kan detta ändra den fångade utdata i dessa fall. (Bidrag från Ma Lin i :issue:`35859`.)

source: Build Changes
sv: Förändringar i byggning

source: CPython now has :pep:`11` :pep:`Tier 3 support <11#tier-3>` for cross compiling to the `WebAssembly <https://webassembly.org/>`_ platforms `Emscripten <https://emscripten.org/>`_ (``wasm32-unknown-emscripten``, i.e. Python in the browser) and `WebAssembly System Interface (WASI) <https://wasi.dev/>`_ (``wasm32-unknown-wasi``). The effort is inspired by previous work like `Pyodide <https://pyodide.org/>`_. These platforms provide a limited subset of POSIX APIs; Python standard libraries features and modules related to networking, processes, threading, signals, mmap, and users/groups are not available or don't work. (Emscripten contributed by Christian Heimes and Ethan Smith in :gh:`84461` and WASI contributed by Christian Heimes in :gh:`90473`; platforms promoted in :gh:`95085`)
sv: CPython har nu :pep:`11` :pep:`Tier 3 support <11#tier-3>` för korskompilering till `WebAssembly <https://webassembly.org/>`_ plattformarna `Emscripten <https://emscripten.org/>`_ (``wasm32-unknown-emscripten``, dvs Python i webbläsaren) och `WebAssembly System Interface (WASI) <https://wasi.dev/>`_ (``wasm32-unknown-wasi``). Ansträngningen är inspirerad av tidigare arbete som `Pyodide <https://pyodide.org/>`_. Dessa plattformar tillhandahåller en begränsad delmängd av POSIX API:er; Pythons standardbiblioteksfunktioner och moduler relaterade till nätverk, processer, trådning, signaler, mmap och användare/grupper är inte tillgängliga eller fungerar inte. (Emscripten bidragit med av Christian Heimes och Ethan Smith i :gh:`84461` och WASI bidragit med av Christian Heimes i :gh:`90473`; plattformar marknadsförda i :gh:`95085`)

source: Building CPython now requires:
sv: Att bygga CPython kräver nu:

source: A `C11 <https://en.cppreference.com/w/c/11>`_ compiler and standard library. `Optional C11 features <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ are not required. (Contributed by Victor Stinner in :issue:`46656`, :issue:`45440` and :issue:`46640`.)
sv: En `C11 <https://en.cppreference.com/w/c/11>`_ -kompilator och standardbibliotek. `Valfria C11-egenskaper <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ krävs inte. (Bidrag från Victor Stinner i :issue:`46656`, :issue:`45440` och :issue:`46640`.)

source: Support for `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ floating-point numbers. (Contributed by Victor Stinner in :issue:`46917`.)
sv: Stöd för `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ flyttal. (Bidrag från Victor Stinner i :issue:`46917`.)

source: The :c:macro:`!Py_NO_NAN` macro has been removed. Since CPython now requires IEEE 754 floats, NaN values are always available. (Contributed by Victor Stinner in :issue:`46656`.)
sv: Makrot :c:macro:`!Py_NO_NAN` har tagits bort. Eftersom CPython nu kräver IEEE 754-flottor är NaN-värden alltid tillgängliga. (Bidrag från Victor Stinner i :issue:`46656`.)

source: The :mod:`tkinter` package now requires `Tcl/Tk <https://www.tcl.tk>`_ version 8.5.12 or newer. (Contributed by Serhiy Storchaka in :issue:`46996`.)
sv: Paketet :mod:`tkinter` kräver nu `Tcl/Tk <https://www.tcl.tk>`_ version 8.5.12 eller nyare. (Bidrag från Serhiy Storchaka i :issue:`46996`.)

source: Build dependencies, compiler flags, and linker flags for most stdlib extension modules are now detected by :program:`configure`. libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk, and uuid flags are detected by `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ (when available). :mod:`tkinter` now requires a pkg-config command to detect development settings for `Tcl/Tk`_ headers and libraries. (Contributed by Christian Heimes and Erlend Egeberg Aasland in :issue:`45847`, :issue:`45747`, and :issue:`45763`.)
sv: Byggberoenden, kompilatorflaggor och länkarflaggor för de flesta stdlib-tilläggsmoduler upptäcks nu av :program:`configure`. libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk och uuid-flaggor upptäcks av `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ (när tillgängligt). :mod:`tkinter` kräver nu ett pkg-config-kommando för att upptäcka utvecklingsinställningar för `Tcl/Tk`_-huvuden och bibliotek. (Bidrag från Christian Heimes och Erlend Egeberg Aasland i :issue:`45847`, :issue:`45747`, och :issue:`45763`.)

source: libpython is no longer linked against libcrypt. (Contributed by Mike Gilbert in :issue:`45433`.)
sv: libpython är inte längre länkat mot libcrypt. (Bidrag från Mike Gilbert i :issue:`45433`.)

source: CPython can now be built with the `ThinLTO <https://clang.llvm.org/docs/ThinLTO.html>`_ option via passing ``thin`` to :option:`--with-lto`, i.e. ``--with-lto=thin``. (Contributed by Donghee Na and Brett Holman in :issue:`44340`.)
sv: CPython kan nu byggas med alternativet `ThinLTO <https://clang.llvm.org/docs/ThinLTO.html>`_ genom att skicka ``thin`` till :option:`\--with-lto`, dvs. ``\--with-lto=thin``. (Bidrag från Donghee Na och Brett Holman i :issue:`44340`.)

source: Freelists for object structs can now be disabled. A new :program:`configure` option ``--without-freelists`` can be used to disable all freelists except empty tuple singleton. (Contributed by Christian Heimes in :issue:`45522`.)
sv: Freelists för objektstrukturer kan nu inaktiveras. Ett nytt :program:`configure`\-alternativ ``\--without-freelists`` kan användas för att inaktivera alla frilistor utom tom tuple singleton. (Bidrag från Christian Heimes i :issue:`45522`.)

source: ``Modules/Setup`` and ``Modules/makesetup`` have been improved and tied up. Extension modules can now be built through ``makesetup``. All except some test modules can be linked statically into a main binary or library. (Contributed by Brett Cannon and Christian Heimes in :issue:`45548`, :issue:`45570`, :issue:`45571`, and :issue:`43974`.)
sv: ``Modules/Setup`` och ``Modules/makesetup`` har förbättrats och knutits samman. Tilläggsmoduler kan nu byggas genom ``makesetup``. Alla utom vissa testmoduler kan länkas statiskt till en huvudbinärfil eller ett huvudbibliotek. (Bidrag från Brett Cannon och Christian Heimes i :issue:`45548`, :issue:`45570`, :issue:`45571`, och :issue:`43974`.)

source: Use the environment variables :envvar:`!TCLTK_CFLAGS` and :envvar:`!TCLTK_LIBS` to manually specify the location of Tcl/Tk headers and libraries. The :program:`configure` options :option:`!--with-tcltk-includes` and :option:`!--with-tcltk-libs` have been removed.
sv: Använd miljövariablerna :envvar:`!TCLTK_CFLAGS` och :envvar:`!TCLTK_LIBS` för att manuellt ange platsen för Tcl/Tk-huvuden och -bibliotek. Alternativen :program:`configure` :option:`!--with-tcltk-includes` och :option:`!--with-tcltk-libs` har tagits bort.

source: On RHEL 7 and CentOS 7 the development packages do not provide ``tcl.pc`` and ``tk.pc``; use ``TCLTK_LIBS="-ltk8.5 -ltkstub8.5 -ltcl8.5"``. The directory ``Misc/rhel7`` contains ``.pc`` files and instructions on how to build Python with RHEL 7's and CentOS 7's Tcl/Tk and OpenSSL.
sv: På RHEL 7 och CentOS 7 tillhandahåller inte utvecklingspaketen ``tcl.pc`` och ``tk.pc``; använd ``TCLTK_LIBS="-ltk8.5 -ltkstub8.5 -ltcl8.5"``. Katalogen ``Misc/rhel7`` innehåller ``.pc``\-filer och instruktioner om hur man bygger Python med RHEL 7:s och CentOS 7:s Tcl/Tk och OpenSSL.
