Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.11.po
Languages: sv

source: The object's index in the globals/builtins namespace is cached. Loading globals and builtins require zero namespace lookups.
sv: Objektets index i namnrymdens globals/builtins är cachat. Inläsning av globaler och builtins kräver inga namnrymdsuppslagningar.

source: Load attribute
sv: Ladda attribut

source: Similar to loading global variables. The attribute's index inside the class/object's namespace is cached. In most cases, attribute loading will require zero namespace lookups.
sv: På samma sätt som vid laddning av globala variabler. Attributets index i klassens/objektets namnrymd cachelagras. I de flesta fall kräver attributladdning inga namnrymdsuppslagningar.

source: Load methods for call
sv: Ladda metoder för anrop

source: The actual address of the method is cached. Method loading now has no namespace lookups -- even for classes with long inheritance chains.
sv: Den faktiska adressen till metoden cachelagras. Metodladdning har nu inga namnrymdsuppslagningar - inte ens för klasser med långa arvskedjor.

source: Store attribute
sv: Butikens attribut

source: Similar to load attribute optimization.
sv: Liknar optimering av lastattribut.

source: Unpack Sequence
sv: Sekvens för uppackning

source: Specialized for common containers such as :class:`list` and :class:`tuple`. Avoids internal calling convention.
sv: Specialiserad för vanliga behållare som :class:`list` och :class:`tuple`. Undviker intern anropskonvention.

source: A similar optimization already existed since Python 3.8. 3.11 specializes for more forms and reduces some overhead.
sv: En liknande optimering fanns redan sedan Python 3.8. 3.11 specialiserar sig för fler former och minskar en del overhead.

source: A similar optimization already existed since Python 3.10. 3.11 specializes for more forms. Furthermore, all attribute loads should be sped up by :issue:`45947`.
sv: En liknande optimering fanns redan sedan Python 3.10. 3.11 specialiserar sig för fler former. Dessutom bör alla attributladdningar snabbas upp av :issue:`45947`.

source: Misc
sv: Övrigt

source: Objects now require less memory due to lazily created object namespaces. Their namespace dictionaries now also share keys more freely. (Contributed Mark Shannon in :issue:`45340` and :issue:`40116`.)
sv: Objekt kräver nu mindre minne tack vare att namnrymder för objekt skapas på ett lättsamt sätt. Deras namnrymdsordböcker delar nu också nycklar mer fritt. (Bidrag från Mark Shannon i :issue:`45340` och :issue:`40116`.)

source: "Zero-cost" exceptions are implemented, eliminating the cost of :keyword:`try` statements when no exception is raised. (Contributed by Mark Shannon in :issue:`40222`.)
sv: "Zero-cost"-undantag implementeras, vilket eliminerar kostnaden för :keyword:`try`\-satser när inget undantag uppstår. (Bidrag från Mark Shannon i :issue:`40222`.)

source: A more concise representation of exceptions in the interpreter reduced the time required for catching an exception by about 10%. (Contributed by Irit Katriel in :issue:`45711`.)
sv: En mer kortfattad representation av undantag i tolken minskade den tid som krävs för att fånga ett undantag med cirka 10%. (Bidrag från Irit Katriel i :issue:`45711`.)

source: :mod:`re`'s regular expression matching engine has been partially refactored, and now uses computed gotos (or "threaded code") on supported platforms. As a result, Python 3.11 executes the `pyperformance regular expression benchmarks <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ up to 10% faster than Python 3.10. (Contributed by Brandt Bucher in :gh:`91404`.)
sv: :mod:`re`\:s matchningsmotor för reguljära uttryck har delvis omarbetats och använder nu beräknade gotos (eller "trådad kod") på plattformar som stöds. Som ett resultat exekverar Python 3.11 `pyperformance regular expression benchmarks <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ upp till 10% faster än Python 3.10. (Bidrag från Brandt Bucher i :gh:`91404`.)

source: How should I write my code to utilize these speedups?
sv: Hur ska jag skriva min kod för att utnyttja dessa hastighetsökningar?

source: Write Pythonic code that follows common best practices; you don't have to change your code. The Faster CPython project optimizes for common code patterns we observe.
sv: Skriv Pythonic-kod som följer vanliga bästa praxis; du behöver inte ändra din kod. Faster CPython-projektet optimerar för vanliga kodmönster som vi observerar.

source: Will CPython 3.11 use more memory?
sv: Kommer CPython 3.11 att använda mer minne?

source: Maybe not; we don't expect memory use to exceed 20% higher than 3.10. This is offset by memory optimizations for frame objects and object dictionaries as mentioned above.
sv: Kanske inte; vi förväntar oss inte att minnesanvändningen kommer att överstiga 20% hig mer än 3.10. Detta kompenseras av minnesoptimeringar för ramobjekt och objektordböcker som nämnts ovan.

source: I don't see any speedups in my workload. Why?
sv: Jag ser inte några hastighetsökningar i min arbetsbelastning. Varför inte?

source: Certain code won't have noticeable benefits. If your code spends most of its time on I/O operations, or already does most of its computation in a C extension library like NumPy, there won't be significant speedups. This project currently benefits pure-Python workloads the most.
sv: Viss kod kommer inte att ha märkbara fördelar. Om din kod tillbringar större delen av sin tid på I/O-operationer eller redan gör större delen av sin beräkning i ett C-tilläggsbibliotek som NumPy, kommer det inte att finnas några betydande hastigheter. Detta projekt gynnar för närvarande rena Python-arbetsbelastningar mest.

source: Furthermore, the pyperformance figures are a geometric mean. Even within the pyperformance benchmarks, certain benchmarks have slowed down slightly, while others have sped up by nearly 2x!
sv: Siffrorna för pyperformance är dessutom ett geometriskt medelvärde. Även inom pyperformance-riktmärkena har vissa riktmärken saktat ned något, medan andra har snabbats upp med nästan 2x!

source: Is there a JIT compiler?
sv: Finns det en JIT-kompilator?

source: No. We're still exploring other optimizations.
sv: Nej, vi undersöker fortfarande andra optimeringar.

source: About
sv: Om

source: Faster CPython explores optimizations for :term:`CPython`. The main team is funded by Microsoft to work on this full-time. Pablo Galindo Salgado is also funded by Bloomberg LP to work on the project part-time. Finally, many contributors are volunteers from the community.
sv: Faster CPython utforskar optimeringar för :term:`CPython`. Huvudteamet finansieras av Microsoft för att arbeta med detta på heltid. Pablo Galindo Salgado är också finansierad av Bloomberg LP för att arbeta med projektet på deltid. Slutligen är många bidragsgivare frivilliga från gemenskapen.

source: CPython bytecode changes
sv: CPython bytecode-ändringar

source: The bytecode now contains inline cache entries, which take the form of the newly-added :opcode:`CACHE` instructions. Many opcodes expect to be followed by an exact number of caches, and instruct the interpreter to skip over them at runtime. Populated caches can look like arbitrary instructions, so great care should be taken when reading or modifying raw, adaptive bytecode containing quickened data.
sv: Bytekoden innehåller nu inline-cacheposter i form av de nytillkomna instruktionerna :opcode:`CACHE`. Många opkoder förväntar sig att följas av ett exakt antal cacher och instruerar tolken att hoppa över dem vid körning. Fyllda cacher kan se ut som godtyckliga instruktioner, så stor försiktighet bör iakttas när man läser eller modifierar rå, adaptiv bytecode som innehåller quickened-data.

source: New opcodes
sv: Nya opkoder

source: :opcode:`!ASYNC_GEN_WRAP`, :opcode:`RETURN_GENERATOR` and :opcode:`SEND`, used in generators and co-routines.
sv: :opcode:`!ASYNC_GEN_WRAP`, :opcode:`RETURN_GENERATOR` och :opcode:`SEND`, används i generatorer och co-rutiner.

source: :opcode:`COPY_FREE_VARS`, which avoids needing special caller-side code for closures.
sv: :opcode:`COPY_FREE_VARS`, vilket gör att det inte behövs någon speciell kod på anropssidan för closures.

source: :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, for use in certain loops where handling interrupts is undesirable.
sv: :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, för användning i vissa loopar där hantering av avbrott inte är önskvärt.

source: :opcode:`MAKE_CELL`, to create :ref:`cell-objects`.
sv: :opcode:`MAKE_CELL`, för att skapa :ref:`cell-objects`.

source: :opcode:`CHECK_EG_MATCH` and :opcode:`!PREP_RERAISE_STAR`, to handle the :ref:`new exception groups and except* <whatsnew311-pep654>` added in :pep:`654`.
sv: :opcode:`CHECK_EG_MATCH` och :opcode:`!PREP_RERAISE_STAR`, för att hantera :ref:`nya undantagsgrupper och except* <whatsnew311-pep654>` ` som lagts till i :pep:`654`.

source: :opcode:`PUSH_EXC_INFO`, for use in exception handlers.
sv: :opcode:`PUSH_EXC_INFO`, för användning i undantagshanterare.

source: :opcode:`RESUME`, a no-op, for internal tracing, debugging and optimization checks.
sv: :opcode:`RESUME`, en no-op, för intern spårning, felsökning och optimeringskontroller.

source: Replaced opcodes
sv: Ersatta opkoder

source: Replaced Opcode(s)
sv: Ersatt Opcode(s)

source: New Opcode(s)
sv: Ny(a) operationskod(er)

source: Notes
sv: Anteckningar

source: Replaced all numeric binary/in-place opcodes with a single opcode
sv: Ersatte alla numeriska binära/in-place-operationskoder med en enda operationskod

source: Decouples argument shifting for methods from handling of keyword arguments; allows better specialization of calls
sv: Kopplar bort argumentväxling för metoder från hantering av nyckelordsargument; möjliggör bättre specialisering av anrop

source: Stack manipulation instructions
sv: Instruktioner för manipulering av stapeln

source: Now performs check but doesn't jump
sv: Utför nu kontroll men hoppar inte

source: See [#bytecode-jump]_; ``TRUE``, ``FALSE``, ``NONE`` and ``NOT_NONE`` variants for each direction
sv: Se [#bytecode-jump]_; varianterna ``TRUE``, ``FALSE``, ``NONE`` och ``NOT_NONE`` för varje riktning

source: :keyword:`with` block setup
sv: :keyword:`with` blockuppsättning

source: All jump opcodes are now relative, including the existing :opcode:`!JUMP_IF_TRUE_OR_POP` and :opcode:`!JUMP_IF_FALSE_OR_POP`. The argument is now an offset from the current instruction rather than an absolute location.
sv: Alla opkoder för hopp är nu relativa, inklusive de befintliga :opcode:`!JUMP_IF_TRUE_OR_POP` och :opcode:`!JUMP_IF_FALSE_OR_POP`. Argumentet är nu en offset från den aktuella instruktionen snarare än en absolut plats.

source: Changed/removed opcodes
sv: Ändrade/ borttagna opkoder

source: Changed :opcode:`MATCH_CLASS` and :opcode:`MATCH_KEYS` to no longer push an additional boolean value to indicate success/failure. Instead, ``None`` is pushed on failure in place of the tuple of extracted values.
sv: Ändrad :opcode:`MATCH_CLASS` och :opcode:`MATCH_KEYS` för att inte längre skicka ett ytterligare booleskt värde för att indikera framgång/misslyckande. Istället skickas ``None`` vid misslyckande i stället för tupeln av extraherade värden.

source: Changed opcodes that work with exceptions to reflect them now being represented as one item on the stack instead of three (see :gh:`89874`).
sv: Ändrade opkoder som arbetar med undantag för att återspegla att de nu representeras som ett objekt på stacken istället för tre (se :gh:`89874`).

source: Removed :opcode:`!COPY_DICT_WITHOUT_KEYS`, :opcode:`!GEN_START`, :opcode:`!POP_BLOCK`, :opcode:`!SETUP_FINALLY` and :opcode:`!YIELD_FROM`.
sv: Tog bort :opcode:`!COPY_DICT_WITHOUT_KEYS`, :opcode:`!GEN_START`, :opcode:`!POP_BLOCK`, :opcode:`!SETUP_FINALLY` och :opcode:`!YIELD_FROM`.

source: Deprecated
sv: Föråldrat

source: This section lists Python APIs that have been deprecated in Python 3.11.
sv: I detta avsnitt listas Python API:er som har utgått i Python 3.11.

source: Deprecated C APIs are :ref:`listed separately <whatsnew311-c-api-deprecated>`.
sv: Föråldrade C API:er är :ref:`listade separat <whatsnew311-c-api-deprecated>`.

source: Language/Builtins
sv: Språk/Builtins

source: Chaining :class:`classmethod` descriptors (introduced in :issue:`19072`) is now deprecated. It can no longer be used to wrap other descriptors such as :class:`property`. The core design of this feature was flawed and caused a number of downstream problems. To "pass-through" a :class:`classmethod`, consider using the :attr:`!__wrapped__` attribute that was added in Python 3.10. (Contributed by Raymond Hettinger in :gh:`89519`.)
sv: Chaining :class:`classmethod` descriptors (introducerad i :issue:`19072`) är nu avförd. Den kan inte längre användas för att omsluta andra deskriptorer såsom :class:`property`. Grunddesignen för denna funktion var bristfällig och orsakade ett antal problem i efterhand. För att "pass-through" en :class:`classmethod`, överväg att använda attributet :attr:`!__wrapped__` som lades till i Python 3.10. (Bidrag från Raymond Hettinger i :gh:`89519`.)

source: Octal escapes in string and bytes literals with values larger than ``0o377`` (255 in decimal) now produce a :exc:`DeprecationWarning`. In a future Python version, they will raise a :exc:`SyntaxWarning` and eventually a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :gh:`81548`.)
sv: Oktala escapes i sträng- och byteslitteraler med värden större än ``0o377`` (255 i decimal) ger nu en :exc:`DeprecationWarning`. I en framtida Python-version kommer de att ge upphov till en :exc:`SyntaxWarning` och så småningom en :exc:`SyntaxError`. (Bidrag från Serhiy Storchaka i :gh:`81548`.)

source: The delegation of :func:`int` to :meth:`~object.__trunc__` is now deprecated. Calling ``int(a)`` when ``type(a)`` implements :meth:`!__trunc__` but not :meth:`~object.__int__` or :meth:`~object.__index__` now raises a :exc:`DeprecationWarning`. (Contributed by Zackery Spytz in :issue:`44977`.)
sv: Delegeringen av :func:`int` till :meth:`~object.__trunc__` är nu föråldrad. Anrop av ``int(a)`` när ``type(a)`` implementerar :meth:`!__trunc__` men inte :meth:`~object.__int__` eller :meth:`~object.__index__` ger nu upphov till en :exc:`DeprecationWarning`. (Bidrag från Zackery Spytz i :issue:`44977`.)

source: Modules
sv: Moduler

source: :pep:`594` led to the deprecations of the following modules slated for removal in Python 3.13:
sv: :pep:`594` ledde till att följande moduler togs bort i Python 3.13:

source: (Contributed by Brett Cannon in :issue:`47061` and Victor Stinner in :gh:`68966`.)
sv: (Bidrag från Brett Cannon i :issue:`47061` och Victor Stinner i :gh:`68966`.)

source: The :mod:`!asynchat`, :mod:`!asyncore` and :mod:`!smtpd` modules have been deprecated since at least Python 3.6. Their documentation and deprecation warnings have now been updated to note they will be removed in Python 3.12. (Contributed by Hugo van Kemenade in :issue:`47022`.)
sv: Modulerna :mod:`!asynchat`, :mod:`!asyncore` och :mod:`!smtpd` har varit föråldrade sedan åtminstone Python 3.6. Deras dokumentation och varningar om utfasning har nu uppdaterats för att notera att de kommer att tas bort i Python 3.12. (Bidrag från Hugo van Kemenade i :issue:`47022`.)

source: The :mod:`!lib2to3` package and ``2to3`` tool are now deprecated and may not be able to parse Python 3.10 or newer. See :pep:`617`, introducing the new PEG parser, for details. (Contributed by Victor Stinner in :issue:`40360`.)
sv: Paketet :mod:`!lib2to3` och verktyget ``2to3`` är nu föråldrade och kanske inte kan parsa Python 3.10 eller nyare. Se :pep:`617`, som introducerar den nya PEG-parsern, för mer information. (Bidrag från Victor Stinner i :issue:`40360`.)

source: Undocumented modules :mod:`!sre_compile`, :mod:`!sre_constants` and :mod:`!sre_parse` are now deprecated. (Contributed by Serhiy Storchaka in :issue:`47152`.)
sv: De odokumenterade modulerna :mod:`!sre_compile`, :mod:`!sre_constants` och :mod:`!sre_parse` är nu föråldrade. (Bidrag från Serhiy Storchaka i :issue:`47152`.)

source: Standard Library
sv: Standardbibliotek

source: The following have been deprecated in :mod:`configparser` since Python 3.2. Their deprecation warnings have now been updated to note they will be removed in Python 3.12:
sv: Följande har utgått i :mod:`configparser` sedan Python 3.2. Deras varningar om utfasning har nu uppdaterats för att notera att de kommer att tas bort i Python 3.12:

source: the :class:`!configparser.SafeConfigParser` class
sv: klassen :class:`!configparser.SafeConfigParser`

source: the :attr:`!configparser.ParsingError.filename` property
sv: egenskapen :attr:`!configparser.ParsingError.filename`

source: the :meth:`!configparser.RawConfigParser.readfp` method
sv: :meth:`!configparser.RawConfigParser.readfp`\-metoden

source: (Contributed by Hugo van Kemenade in :issue:`45173`.)
sv: (Bidrag från Hugo van Kemenade i :issue:`45173`.)

source: :class:`!configparser.LegacyInterpolation` has been deprecated in the docstring since Python 3.2, and is not listed in the :mod:`configparser` documentation. It now emits a :exc:`DeprecationWarning` and will be removed in Python 3.13. Use :class:`configparser.BasicInterpolation` or :class:`configparser.ExtendedInterpolation` instead. (Contributed by Hugo van Kemenade in :issue:`46607`.)
sv: :class:`!configparser.LegacyInterpolation` har varit utfasad i dokumentationen sedan Python 3.2, och är inte listad i :mod:`configparser` dokumentationen. Den avger nu en :exc:`DeprecationWarning` och kommer att tas bort i Python 3.13. Använd :class:`configparser.BasicInterpolation` eller :class:`configparser.ExtendedInterpolation` istället. (Bidrag från Hugo van Kemenade i :issue:`46607`.)

source: The older set of :mod:`importlib.resources` functions were deprecated in favor of the replacements added in Python 3.9 and will be removed in a future Python version, due to not supporting resources located within package subdirectories:
sv: Den äldre uppsättningen :mod:`importlib.resources`\-funktioner utrangerades till förmån för de ersättningar som lades till i Python 3.9 och kommer att tas bort i en framtida Python-version, på grund av att de inte stöder resurser som finns i paketunderkataloger:

source: The :func:`locale.getdefaultlocale` function is deprecated and will be removed in Python 3.15. Use :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` and :func:`locale.getlocale` functions instead. (Contributed by Victor Stinner in :gh:`90817`.)
sv: Funktionen :func:`locale.getdefaultlocale` är föråldrad och kommer att tas bort i Python 3.15. Använd istället funktionerna :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` och :func:`locale.getlocale`. (Bidrag från Victor Stinner i :gh:`90817`.)

source: The :func:`!locale.resetlocale` function is deprecated and will be removed in Python 3.13. Use ``locale.setlocale(locale.LC_ALL, "")`` instead. (Contributed by Victor Stinner in :gh:`90817`.)
sv: Funktionen :func:`!locale.resetlocale` är föråldrad och kommer att tas bort i Python 3.13. Använd ``locale.setlocale(locale.LC_ALL, "")`` istället. (Bidrag från Victor Stinner i :gh:`90817`.)

source: Stricter rules will now be applied for numerical group references and group names in :ref:`regular expressions <re-syntax>`. Only sequences of ASCII digits will now be accepted as a numerical reference, and the group name in :class:`bytes` patterns and replacement strings can only contain ASCII letters, digits and underscores. For now, a deprecation warning is raised for syntax violating these rules. (Contributed by Serhiy Storchaka in :gh:`91760`.)
sv: Strängare regler kommer nu att tillämpas för numeriska gruppreferenser och gruppnamn i :ref:`regular expressions <re-syntax>`. Endast sekvenser av ASCII-siffror accepteras nu som en numerisk referens, och gruppnamnet i :class:`bytes`\-mönster och ersättningssträngar får endast innehålla ASCII-bokstäver, siffror och understreck. För närvarande utfärdas en varning för syntax som bryter mot dessa regler. (Bidrag från Serhiy Storchaka i :gh:`91760`.)

source: In the :mod:`re` module, the :func:`!re.template` function and the corresponding :const:`!re.TEMPLATE` and :const:`!re.T` flags are deprecated, as they were undocumented and lacked an obvious purpose. They will be removed in Python 3.13. (Contributed by Serhiy Storchaka and Miro Hrončok in :gh:`92728`.)
sv: I modulen :mod:`re` är funktionen :func:`!re.template` och motsvarande flaggor :const:`!re.TEMPLATE` och :const:`!re.T` avförda, eftersom de var odokumenterade och saknade ett uppenbart syfte. De kommer att tas bort i Python 3.13. (Bidrag från Serhiy Storchaka och Miro Hrončok i :gh:`92728`.)

source: :func:`!turtle.settiltangle` has been deprecated since Python 3.1; it now emits a deprecation warning and will be removed in Python 3.13. Use :func:`turtle.tiltangle` instead (it was earlier incorrectly marked as deprecated, and its docstring is now corrected). (Contributed by Hugo van Kemenade in :issue:`45837`.)
sv: :func:`!turtle.settiltangle` har varit föråldrad sedan Python 3.1; den avger nu en föråldringsvarning och kommer att tas bort i Python 3.13. Använd :func:`turtle.tiltangle` istället (det var tidigare felaktigt markerat som föråldrat, och dess docstring är nu korrigerad). (Bidrag från Hugo van Kemenade i :issue:`45837`.)

source: :class:`typing.Text`, which exists solely to provide compatibility support between Python 2 and Python 3 code, is now deprecated. Its removal is currently unplanned, but users are encouraged to use :class:`str` instead wherever possible. (Contributed by Alex Waygood in :gh:`92332`.)
sv: :class:`typing.Text`, som existerar enbart för att ge kompatibilitetsstöd mellan Python 2 och Python 3-kod, är nu föråldrad. Dess borttagning är för närvarande inte planerad, men användare uppmuntras att använda :class:`str` istället när det är möjligt. (Bidrag från Alex Waygood i :gh:`92332`.)

source: The keyword argument syntax for constructing :data:`typing.TypedDict` types is now deprecated. Support will be removed in Python 3.13. (Contributed by Jingchen Ye in :gh:`90224`.)
sv: Syntaxen för nyckelordsargument för konstruktion av :data:`typing.TypedDict`\-typer är nu föråldrad. Stödet kommer att tas bort i Python 3.13. (Bidrag från Jingchen Ye i :gh:`90224`.)

source: :class:`!webbrowser.MacOSX` is deprecated and will be removed in Python 3.13. It is untested, undocumented, and not used by :mod:`webbrowser` itself. (Contributed by Donghee Na in :issue:`42255`.)
sv: :class:`!webbrowser.MacOSX` är föråldrad och kommer att tas bort i Python 3.13. Den är otestad, odokumenterad och används inte av :mod:`webbrowser` själv. (Bidrag från Donghee Na i :issue:`42255`.)

source: The behavior of returning a value from a :class:`~unittest.TestCase` and :class:`~unittest.IsolatedAsyncioTestCase` test methods (other than the default ``None`` value) is now deprecated.
sv: Beteendet att returnera ett värde från testmetoderna :class:`~unittest.TestCase` och :class:`~unittest.IsolatedAsyncioTestCase` (annat än standardvärdet ``None``) är nu föråldrat.

source: Deprecated the following not-formally-documented :mod:`unittest` functions, scheduled for removal in Python 3.13:
sv: Följande icke-formellt dokumenterade :mod:`unittest`\-funktioner har utgått och kommer att tas bort i Python 3.13:

source: Use :class:`~unittest.TestLoader` methods instead:
sv: Använd istället :class:`~unittest.TestLoader`\-metoder:

source: (Contributed by Erlend E. Aasland in :issue:`5846`.)
sv: (Bidrag från Erlend E. Aasland i :issue:`5846`.)
