Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: New :class:`~email.parser.BytesHeaderParser`, added to the :mod:`~email.parser` module to complement :class:`~email.parser.HeaderParser` and complete the Bytes API.
pt_pt: Novo :class:`~email.parser.BytesHeaderParser`, adicionado ao módulo :mod:`~email.parser` para complementar o :class:`~email.parser.HeaderParser` e completar a API de Bytes.

source: New utility functions:
pt_pt: Novas funções utilitárias:

source: :func:`~email.utils.format_datetime`: given a :class:`~datetime.datetime`, produce a string formatted for use in an email header.
pt_pt: :func:`~email.utils.format_datetime`: dado um :class:`~datetime.datetime`, produz uma string formatada para uso num cabeçalho de e-mail.

source: :func:`~email.utils.parsedate_to_datetime`: given a date string from an email header, convert it into an aware :class:`~datetime.datetime`, or a naive :class:`~datetime.datetime` if the offset is ``-0000``.
pt_pt: :func:`~email.utils.parsedate_to_datetime`: dada uma *string* de data de um cabeçalho de email, converte-a num :class:`~datetime.datetime` consciente do fuso horário, ou num :class:`~datetime.datetime` *naive* se o desvio for ``-0000``.

source: :func:`~email.utils.localtime`: With no argument, returns the current local time as an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`. Given an aware :class:`~datetime.datetime`, converts it into an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`.
pt_pt: :func:`~email.utils.localtime`: Sem argumentos, devolve a hora local atual como um :class:`~datetime.datetime` consciente do fuso horário, usando o :class:`~datetime.timezone` local. Dado um :class:`~datetime.datetime` consciente do fuso horário, converte-o num :class:`~datetime.datetime` consciente do :class:`~datetime.timezone` local.

source: :class:`ftplib.FTP` now accepts a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Giampaolo Rodolà in :issue:`8594`.)
pt_pt: A classe :class:`ftplib.FTP` aceita agora um argumento nomeado ``source_address`` para especificar o ``(host, port)`` a usar como endereço de origem na chamada de ligação ao criar o *socket* de saída. (Contribuído por Giampaolo Rodolà em :issue:`8594`.)

source: The :class:`~ftplib.FTP_TLS` class now provides a new :func:`~ftplib.FTP_TLS.ccc` function to revert control channel back to plaintext. This can be useful to take advantage of firewalls that know how to handle NAT with non-secure FTP without opening fixed ports. (Contributed by Giampaolo Rodolà in :issue:`12139`.)
pt_pt: A classe :class:`~ftplib.FTP_TLS` fornece agora uma nova função :func:`~ftplib.FTP_TLS.ccc` para reverter o canal de controlo para texto simples. Isto pode ser útil para tirar partido de *firewalls* que sabem lidar com NAT em FTP não seguro sem abrir portas fixas. (Contribuído por Giampaolo Rodolà em :issue:`12139`.)

source: Added :meth:`ftplib.FTP.mlsd` method which provides a parsable directory listing format and deprecates :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`. (Contributed by Giampaolo Rodolà in :issue:`11072`.)
pt_pt: Adicionado o método :meth:`ftplib.FTP.mlsd`, que fornece um formato de listagem de diretório analisável e pretere os métodos :meth:`ftplib.FTP.nlst` e :meth:`ftplib.FTP.dir`. (Contribuído por Giampaolo Rodolà em :issue:`11072`.)

source: The :func:`functools.lru_cache` decorator now accepts a ``typed`` keyword argument (that defaults to ``False`` to ensure that it caches values of different types that compare equal in separate cache slots. (Contributed by Raymond Hettinger in :issue:`13227`.)
pt_pt: O decorador :func:`functools.lru_cache` aceita agora um argumento nomeado ``typed`` (que por predefinição é ``False``) para garantir que armazena em cache valores de tipos diferentes que comparam como iguais em *slots* de cache separados. (Contribuído por Raymond Hettinger em :issue:`13227`.)

source: It is now possible to register callbacks invoked by the garbage collector before and after collection using the new :data:`~gc.callbacks` list.
pt_pt: É agora possível registar *callbacks* invocados pelo recolhedor de lixo antes e depois da recolha, usando a nova lista :data:`~gc.callbacks`.

source: A new :func:`~hmac.compare_digest` function has been added to prevent side channel attacks on digests through timing analysis. (Contributed by Nick Coghlan and Christian Heimes in :issue:`15061`.)
pt_pt: Foi adicionada uma nova função :func:`~hmac.compare_digest` para prevenir ataques de canal lateral em *digests* através de análise de tempo. (Contribuído por Nick Coghlan e Christian Heimes em :issue:`15061`.)

source: :class:`http.server.BaseHTTPRequestHandler` now buffers the headers and writes them all at once when :meth:`~http.server.BaseHTTPRequestHandler.end_headers` is called. A new method :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` can be used to directly manage when the accumulated headers are sent. (Contributed by Andrew Schaaf in :issue:`3709`.)
pt_pt: :class:`http.server.BaseHTTPRequestHandler` agora coloca os cabeçalhos em buffer e escreve-os todos de uma vez quando :meth:`~http.server.BaseHTTPRequestHandler.end_headers` é chamado. Um novo método :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` pode ser usado para gerir diretamente quando os cabeçalhos acumulados são enviados. (Contribuído por Andrew Schaaf em :issue:`3709`.)

source: :class:`http.server` now produces valid ``HTML 4.01 strict`` output. (Contributed by Ezio Melotti in :issue:`13295`.)
pt_pt: :class:`http.server` produz agora saída válida ``HTML 4.01 strict``. (Contribuído por Ezio Melotti em :issue:`13295`.)

source: :class:`http.client.HTTPResponse` now has a :meth:`~http.client.HTTPResponse.readinto` method, which means it can be used as an :class:`io.RawIOBase` class. (Contributed by John Kuhn in :issue:`13464`.)
pt_pt: :class:`http.client.HTTPResponse` tem agora um método :meth:`~http.client.HTTPResponse.readinto`, o que significa que pode ser usado como uma classe :class:`io.RawIOBase`. (Contribuído por John Kuhn em :issue:`13464`.)

source: :class:`html.parser.HTMLParser` is now able to parse broken markup without raising errors, therefore the *strict* argument of the constructor and the :exc:`!HTMLParseError` exception are now deprecated. The ability to parse broken markup is the result of a number of bug fixes that are also available on the latest bug fix releases of Python 2.7/3.2. (Contributed by Ezio Melotti in :issue:`15114`, and :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)
pt_pt: :class:`html.parser.HTMLParser` é agora capaz de analisar marcação incorreta sem gerar erros, pelo que o argumento *strict* do construtor e a exceção :exc:`!HTMLParseError` estão agora preteridos. A capacidade de analisar marcação incorreta é o resultado de várias correções de erros que também estão disponíveis nas últimas versões de correção de erros do Python 2.7/3.2. (Contribuído por Ezio Melotti em :issue:`15114`, e :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)

source: A new :data:`~html.entities.html5` dictionary that maps HTML5 named character references to the equivalent Unicode character(s) (e.g. ``html5['gt;'] == '>'``) has been added to the :mod:`html.entities` module. The dictionary is now also used by :class:`~html.parser.HTMLParser`. (Contributed by Ezio Melotti in :issue:`11113` and :issue:`15156`.)
pt_pt: Um novo dicionário :data:`~html.entities.html5`, que mapeia referências de caracteres nomeados HTML5 para o(s) carácter(es) Unicode equivalente(s) (por exemplo, ``html5['gt;'] == '>'``), foi adicionado ao módulo :mod:`html.entities`. O dicionário é agora também usado por :class:`~html.parser.HTMLParser`. (Contribuído por Ezio Melotti em :issue:`11113` e :issue:`15156`.)

source: The :class:`~imaplib.IMAP4_SSL` constructor now accepts an SSLContext parameter to control parameters of the secure channel.
pt_pt: O construtor :class:`~imaplib.IMAP4_SSL` aceita agora um parâmetro SSLContext para controlar os parâmetros do canal seguro.

source: (Contributed by Sijin Joseph in :issue:`8808`.)
pt_pt: (Contribuído por Sijin Joseph em :issue:`8808`.)

source: A new :func:`~inspect.getclosurevars` function has been added. This function reports the current binding of all names referenced from the function body and where those names were resolved, making it easier to verify correct internal state when testing code that relies on stateful closures.
pt_pt: Foi adicionada uma nova função :func:`~inspect.getclosurevars`. Esta função reporta a ligação atual de todos os nomes referenciados a partir do corpo da função e onde esses nomes foram resolvidos, facilitando a verificação do estado interno correto ao testar código que depende de *closures* com estado.

source: (Contributed by Meador Inge and Nick Coghlan in :issue:`13062`.)
pt_pt: (Contribuído por Meador Inge e Nick Coghlan em :issue:`13062`.)

source: A new :func:`~inspect.getgeneratorlocals` function has been added. This function reports the current binding of local variables in the generator's stack frame, making it easier to verify correct internal state when testing generators.
pt_pt: Foi adicionada uma nova função :func:`~inspect.getgeneratorlocals`. Esta função reporta a ligação atual de variáveis locais no *stack frame* do gerador, facilitando a verificação do estado interno correto ao testar geradores.

source: (Contributed by Meador Inge in :issue:`15153`.)
pt_pt: (Contribuído por Meador Inge em :issue:`15153`.)

source: The :func:`~io.open` function has a new ``'x'`` mode that can be used to exclusively create a new file, and raise a :exc:`FileExistsError` if the file already exists. It is based on the C11 'x' mode to fopen().
pt_pt: A função :func:`~io.open` tem um novo modo ``'x'`` que pode ser usado para criar exclusivamente um novo ficheiro e gerar um :exc:`FileExistsError` se o ficheiro já existir. É baseado no modo 'x' do C11 para fopen().

source: (Contributed by David Townshend in :issue:`12760`.)
pt_pt: (Contribuído por David Townshend em :issue:`12760`.)

source: The constructor of the :class:`~io.TextIOWrapper` class has a new *write_through* optional argument. If *write_through* is ``True``, calls to :meth:`!write` are guaranteed not to be buffered: any data written on the :class:`~io.TextIOWrapper` object is immediately handled to its underlying binary buffer.
pt_pt: O construtor da classe :class:`~io.TextIOWrapper` tem um novo argumento opcional *write_through*. Se *write_through* for ``True``, as chamadas para :meth:`!write` são garantidamente não colocadas em *buffer*: quaisquer dados escritos no objeto :class:`~io.TextIOWrapper` são imediatamente processados para o seu *buffer* binário subjacente.

source: :func:`~itertools.accumulate` now takes an optional ``func`` argument for providing a user-supplied binary function.
pt_pt: :func:`~itertools.accumulate` aceita agora um argumento opcional ``func`` para fornecer uma função binária fornecida pelo utilizador.

source: The :func:`~logging.basicConfig` function now supports an optional ``handlers`` argument taking an iterable of handlers to be added to the root logger.
pt_pt: A função :func:`~logging.basicConfig` suporta agora um argumento opcional ``handlers`` que aceita um iterável de manipuladores a serem adicionados ao *logger* raiz.

source: A class level attribute :attr:`!append_nul` has been added to :class:`~logging.handlers.SysLogHandler` to allow control of the appending of the ``NUL`` (``\000``) byte to syslog records, since for some daemons it is required while for others it is passed through to the log.
pt_pt: Foi adicionado um atributo ao nível da classe :attr:`!append_nul` a :class:`~logging.handlers.SysLogHandler` para permitir controlar a adição do *byte* ``NUL`` (``\000``) aos registos syslog, uma vez que para alguns *daemons* é necessário, enquanto para outros é passado para o registo.

source: The :mod:`math` module has a new function, :func:`~math.log2`, which returns the base-2 logarithm of *x*.
pt_pt: O módulo :mod:`math` tem uma nova função, :func:`~math.log2`, que devolve o logaritmo de base 2 de *x*.

source: (Written by Mark Dickinson in :issue:`11888`.)
pt_pt: (Escrito por Mark Dickinson em :issue:`11888`.)

source: The :meth:`~mmap.mmap.read` method is now more compatible with other file-like objects: if the argument is omitted or specified as ``None``, it returns the bytes from the current file position to the end of the mapping. (Contributed by Petri Lehtinen in :issue:`12021`.)
pt_pt: O método :meth:`~mmap.mmap.read` é agora mais compatível com outros objetos semelhantes a ficheiros: se o argumento for omitido ou especificado como ``None``, devolve os *bytes* desde a posição atual do ficheiro até ao final do mapeamento. (Contribuído por Petri Lehtinen em :issue:`12021`.)

source: multiprocessing
pt_pt: multiprocessamento

source: The new :func:`multiprocessing.connection.wait` function allows polling multiple objects (such as connections, sockets and pipes) with a timeout. (Contributed by Richard Oudkerk in :issue:`12328`.)
pt_pt: A nova função :func:`multiprocessing.connection.wait` permite a sondagem de múltiplos objetos (como ligações, *sockets* e *pipes*) com um *timeout*. (Contribuído por Richard Oudkerk em :issue:`12328`.)

source: :class:`multiprocessing.connection.Connection` objects can now be transferred over multiprocessing connections. (Contributed by Richard Oudkerk in :issue:`4892`.)
pt_pt: Os objetos :class:`multiprocessing.connection.Connection` podem agora ser transferidos através de ligações de multiprocessamento. (Contribuído por Richard Oudkerk em :issue:`4892`.)

source: :class:`multiprocessing.Process` now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag from the parent process (:issue:`6064`).
pt_pt: :class:`multiprocessing.Process` aceita agora um argumento nomeado ``daemon`` para substituir o comportamento predefinido de herdar a *flag* ``daemon`` do processo pai (:issue:`6064`).

source: New attribute :data:`multiprocessing.Process.sentinel` allows a program to wait on multiple :class:`~multiprocessing.Process` objects at one time using the appropriate OS primitives (for example, :mod:`select` on posix systems).
pt_pt: O novo atributo :data:`multiprocessing.Process.sentinel` permite que um programa aguarde por múltiplos objetos :class:`~multiprocessing.Process` de uma só vez, usando as primitivas do sistema operativo apropriadas (por exemplo, :mod:`select` em sistemas POSIX).

source: New methods :meth:`multiprocessing.pool.Pool.starmap` and :meth:`~multiprocessing.pool.Pool.starmap_async` provide :func:`itertools.starmap` equivalents to the existing :meth:`multiprocessing.pool.Pool.map` and :meth:`~multiprocessing.pool.Pool.map_async` functions. (Contributed by Hynek Schlawack in :issue:`12708`.)
pt_pt: Os novos métodos :meth:`multiprocessing.pool.Pool.starmap` e :meth:`~multiprocessing.pool.Pool.starmap_async` fornecem equivalentes a :func:`itertools.starmap` para as funções existentes :meth:`multiprocessing.pool.Pool.map` e :meth:`~multiprocessing.pool.Pool.map_async`. (Contribuído por Hynek Schlawack em :issue:`12708`.)

source: The :class:`!nntplib.NNTP` class now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the NNTP connection when done::
pt_pt: A classe :class:`!nntplib.NNTP` suporta agora o protocolo de gestão de contexto para consumir incondicionalmente exceções :exc:`socket.error` e fechar a ligação NNTP quando terminada::

source: >>> from nntplib import NNTP >>> with NNTP('news.gmane.org') as n: ... n.group('gmane.comp.python.committers') ... ('211 1755 1 1755 gmane.comp.python.committers', 1755, 1, 1755, 'gmane.comp.python.committers') >>>
pt_pt: >>> from nntplib import NNTP >>> with NNTP('news.gmane.org') as n: ... n.grupo('gmane.comp.python.committers') ... ('211 1755 1 1755 gmane.comp.python.committers', 1755, 1, 1755, 'gmane.comp.python.committers') >>>

source: (Contributed by Giampaolo Rodolà in :issue:`9795`.)
pt_pt: (Contribuído por Giampaolo Rodolà em :issue:`9795`.)

source: The :mod:`os` module has a new :func:`~os.pipe2` function that makes it possible to create a pipe with :const:`~os.O_CLOEXEC` or :const:`~os.O_NONBLOCK` flags set atomically. This is especially useful to avoid race conditions in multi-threaded programs.
pt_pt: O módulo :mod:`os` tem uma nova função :func:`~os.pipe2` que permite criar um *pipe* com as *flags* :const:`~os.O_CLOEXEC` ou :const:`~os.O_NONBLOCK` definidas atomicamente. Isto é especialmente útil para evitar condições de corrida em programas multi-*thread*.

source: The :mod:`os` module has a new :func:`~os.sendfile` function which provides an efficient "zero-copy" way for copying data from one file (or socket) descriptor to another. The phrase "zero-copy" refers to the fact that all of the copying of data between the two descriptors is done entirely by the kernel, with no copying of data into userspace buffers. :func:`~os.sendfile` can be used to efficiently copy data from a file on disk to a network socket, e.g. for downloading a file.
pt_pt: O módulo :mod:`os` tem uma nova função :func:`~os.sendfile`, que fornece uma forma eficiente de "cópia zero" para copiar dados de um descritor de ficheiro (ou *socket*) para outro. A expressão "cópia zero" refere-se ao facto de toda a cópia de dados entre os dois descritores ser feita inteiramente pelo *kernel*, sem cópia de dados para *buffers* do espaço do utilizador. :func:`~os.sendfile` pode ser usado para copiar eficientemente dados de um ficheiro no disco para um *socket* de rede, por exemplo, para descarregar um ficheiro.

source: (Patch submitted by Ross Lagerwall and Giampaolo Rodolà in :issue:`10882`.)
pt_pt: (Patch submetido por Ross Lagerwall e Giampaolo Rodolà em :issue:`10882`.)

source: To avoid race conditions like symlink attacks and issues with temporary files and directories, it is more reliable (and also faster) to manipulate file descriptors instead of file names. Python 3.3 enhances existing functions and introduces new functions to work on file descriptors (:issue:`4761`, :issue:`10755` and :issue:`14626`).
pt_pt: Para evitar condições de corrida como ataques de *symlink* e problemas com ficheiros e diretórios temporários, é mais fiável (e também mais rápido) manipular descritores de ficheiro em vez de nomes de ficheiro. O Python 3.3 melhora funções existentes e introduz novas funções para trabalhar com descritores de ficheiro (:issue:`4761`, :issue:`10755` e :issue:`14626`).

source: The :mod:`os` module has a new :func:`~os.fwalk` function similar to :func:`~os.walk` except that it also yields file descriptors referring to the directories visited. This is especially useful to avoid symlink races.
pt_pt: O módulo :mod:`os` tem uma nova função :func:`~os.fwalk` semelhante a :func:`~os.walk`, exceto que também devolve descritores de ficheiro que referenciam os diretórios visitados. Isto é especialmente útil para evitar condições de corrida de *symlink*.

source: The following functions get new optional *dir_fd* (:ref:`paths relative to directory descriptors <dir_fd>`) and/or *follow_symlinks* (:ref:`not following symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Platform support for using these parameters can be checked via the sets :data:`os.supports_dir_fd` and :data:`os.supports_follow_symlinks`.
pt_pt: As seguintes funções têm novos argumentos opcionais *dir_fd* (:ref:`caminhos relativos a descritores de diretório <dir_fd>`) e/ou *follow_symlinks* (:ref:`não seguir symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. O suporte da plataforma para usar estes parâmetros pode ser verificado através dos conjuntos :data:`os.supports_dir_fd` e :data:`os.supports_follow_symlinks`.

source: The following functions now support a file descriptor for their path argument: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. Platform support for this can be checked via the :data:`os.supports_fd` set.
pt_pt: As seguintes funções suportam agora um descritor de ficheiro para o seu argumento de caminho: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. O suporte da plataforma para isto pode ser verificado através do conjunto :data:`os.supports_fd`.

source: :func:`~os.access` accepts an ``effective_ids`` keyword argument to turn on using the effective uid/gid rather than the real uid/gid in the access check. Platform support for this can be checked via the :data:`~os.supports_effective_ids` set.
pt_pt: :func:`~os.access` aceita um argumento nomeado ``effective_ids`` para usar o uid/gid efetivo em vez do uid/gid real na verificação de acesso. O suporte da plataforma para isto pode ser verificado através do conjunto :data:`~os.supports_effective_ids`.

source: The :mod:`os` module has two new functions: :func:`~os.getpriority` and :func:`~os.setpriority`. They can be used to get or set process niceness/priority in a fashion similar to :func:`os.nice` but extended to all processes instead of just the current one.
pt_pt: O módulo :mod:`os` tem duas novas funções: :func:`~os.getpriority` e :func:`~os.setpriority`. Podem ser usadas para obter ou definir a prioridade de um processo de forma semelhante a :func:`os.nice`, mas estendida a todos os processos em vez de apenas ao atual.

source: (Patch submitted by Giampaolo Rodolà in :issue:`10784`.)
pt_pt: (Patch submetido por Giampaolo Rodolà em :issue:`10784`.)

source: The new :func:`os.replace` function allows cross-platform renaming of a file with overwriting the destination. With :func:`os.rename`, an existing destination file is overwritten under POSIX, but raises an error under Windows. (Contributed by Antoine Pitrou in :issue:`8828`.)
pt_pt: A nova função :func:`os.replace` permite a renomeação entre plataformas de um ficheiro, substituindo o destino. Com :func:`os.rename`, um ficheiro de destino existente é substituído em POSIX, mas gera um erro no Windows. (Contribuído por Antoine Pitrou em :issue:`8828`.)
