Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: :c:macro:`!Py_UNICODE_strcpy()`, :c:macro:`!Py_UNICODE_strncpy()`, :c:macro:`!Py_UNICODE_COPY()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
pt_pt: :c:macro:`!Py_UNICODE_strcpy()`, :c:macro:`!Py_UNICODE_strncpy()`, :c:macro:`!Py_UNICODE_COPY()`: use :c:func:`PyUnicode_CopyCharacters` ou :c:func:`PyUnicode_Substring`

source: Encoders:
pt_pt: Codificadores:

source: :c:func:`!PyUnicode_EncodeUTF8`: use :c:func:`PyUnicode_AsUTF8` or :c:func:`PyUnicode_AsUTF8String`
pt_pt: :c:func:`!PyUnicode_EncodeUTF8`: use :c:func:`PyUnicode_AsUTF8` ou :c:func:`PyUnicode_AsUTF8String`

source: :c:func:`!PyUnicode_EncodeMBCS`: use :c:func:`PyUnicode_AsMBCSString` or :c:func:`PyUnicode_EncodeCodePage` (with ``CP_ACP`` code_page)
pt_pt: :c:func:`!PyUnicode_EncodeMBCS`: use :c:func:`PyUnicode_AsMBCSString` ou :c:func:`PyUnicode_EncodeCodePage` (com ``CP_ACP`` como página de código)

source: Deprecated features
pt_pt: Funcionalidades obsoletas

source: The :mod:`array` module's ``'u'`` format code is now deprecated and will be removed in Python 4 together with the rest of the (:c:type:`Py_UNICODE`) API.
pt_pt: O código de formato ``'u'`` do módulo :mod:`array` está agora obsoleto e será removido no Python 4 juntamente com o resto da API (:c:type:`Py_UNICODE`).

source: Porting to Python 3.3
pt_pt: Portar para Python 3.3

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_pt: Esta secção lista alterações previamente descritas e outras correções de erros que podem exigir alterações no seu código.

source: Porting Python code
pt_pt: Portar código Python

source: Hash randomization is enabled by default. Set the :envvar:`PYTHONHASHSEED` environment variable to ``0`` to disable hash randomization. See also the :meth:`object.__hash__` method.
pt_pt: A aleatorização de *hash* está ativada por predefinição. Defina a variável de ambiente :envvar:`PYTHONHASHSEED` para ``0`` para desativar a aleatorização de *hash*. Veja também o método :meth:`object.__hash__`.

source: :issue:`12326`: On Linux, sys.platform doesn't contain the major version anymore. It is now always 'linux', instead of 'linux2' or 'linux3' depending on the Linux version used to build Python. Replace sys.platform == 'linux2' with sys.platform.startswith('linux'), or directly sys.platform == 'linux' if you don't need to support older Python versions.
pt_pt: :issue:`12326`: No Linux, sys.platform já não contém a versão principal. É agora sempre 'linux', em vez de 'linux2' ou 'linux3' dependendo da versão do Linux usada para compilar o Python. Substitua sys.platform == 'linux2' por sys.platform.startswith('linux'), ou diretamente sys.platform == 'linux' se não precisar de suportar versões mais antigas do Python.

source: :issue:`13847`, :issue:`14180`: :mod:`time` and :mod:`datetime`: :exc:`OverflowError` is now raised instead of :exc:`ValueError` if a timestamp is out of range. :exc:`OSError` is now raised if C functions :c:func:`gmtime` or :c:func:`localtime` failed.
pt_pt: :issue:`13847`, :issue:`14180`: :mod:`time` e :mod:`datetime`: :exc:`OverflowError` é agora gerado em vez de :exc:`ValueError` se um *timestamp* estiver fora do intervalo. :exc:`OSError` é agora gerado se as funções C :c:func:`gmtime` ou :c:func:`localtime` falharem.

source: The default finders used by import now utilize a cache of what is contained within a specific directory. If you create a Python source file or sourceless bytecode file, make sure to call :func:`importlib.invalidate_caches` to clear out the cache for the finders to notice the new file.
pt_pt: Os *finders* predefinidos usados pela importação utilizam agora uma cache do que está contido dentro de um diretório específico. Se criar um ficheiro de origem Python ou um ficheiro de *bytecode* sem origem, certifique-se de chamar :func:`importlib.invalidate_caches` para limpar a cache para que os *finders* notem o novo ficheiro.

source: :exc:`ImportError` now uses the full name of the module that was attempted to be imported. Doctests that check ImportErrors' message will need to be updated to use the full name of the module instead of just the tail of the name.
pt_pt: :exc:`ImportError` usa agora o nome completo do módulo que foi tentado importar. Os *doctests* que verificam a mensagem de ImportErrors precisam de ser atualizados para usar o nome completo do módulo em vez de apenas o final do nome.

source: The *index* argument to :func:`__import__` now defaults to 0 instead of -1 and no longer support negative values. It was an oversight when :pep:`328` was implemented that the default value remained -1. If you need to continue to perform a relative import followed by an absolute import, then perform the relative import using an index of 1, followed by another import using an index of 0. It is preferred, though, that you use :func:`importlib.import_module` rather than call :func:`__import__` directly.
pt_pt: O argumento *index* para :func:`__import__` tem agora como predefinição 0 em vez de -1 e já não suporta valores negativos. Foi um descuido quando a :pep:`328` foi implementada que o valor predefinido permaneceu -1. Se precisar de continuar a realizar uma importação relativa seguida de uma importação absoluta, realize a importação relativa usando um índice de 1, seguida de outra importação usando um índice de 0. No entanto, é preferível que use :func:`importlib.import_module` em vez de chamar :func:`__import__` diretamente.

source: :func:`__import__` no longer allows one to use an index value other than 0 for top-level modules. E.g. ``__import__('sys', level=1)`` is now an error.
pt_pt: :func:`__import__` já não permite o uso de um valor de índice diferente de 0 para módulos de nível superior. Por exemplo, ``__import__('sys', level=1)`` é agora um erro.

source: Because :data:`sys.meta_path` and :data:`sys.path_hooks` now have finders on them by default, you will most likely want to use :meth:`list.insert` instead of :meth:`list.append` to add to those lists.
pt_pt: Como :data:`sys.meta_path` e :data:`sys.path_hooks` têm agora *finders* por predefinição, provavelmente vai querer usar :meth:`list.insert` em vez de :meth:`list.append` para adicionar a essas listas.

source: Because ``None`` is now inserted into :data:`sys.path_importer_cache`, if you are clearing out entries in the dictionary of paths that do not have a finder, you will need to remove keys paired with values of ``None`` **and** :class:`!imp.NullImporter` to be backwards-compatible. This will lead to extra overhead on older versions of Python that re-insert ``None`` into :data:`sys.path_importer_cache` where it represents the use of implicit finders, but semantically it should not change anything.
pt_pt: Como ``None`` é agora inserido em :data:`sys.path_importer_cache`, se estiver a limpar entradas no dicionário de caminhos que não têm um *finder*, precisará de remover chaves emparelhadas com valores ``None`` **e** :class:`!imp.NullImporter` para ser retrocompatível. Isto levará a um *overhead* extra em versões mais antigas do Python que reinserem ``None`` em :data:`sys.path_importer_cache`, onde representa o uso de *finders* implícitos, mas semanticamente não deve alterar nada.

source: :class:`!importlib.abc.Finder` no longer specifies a ``find_module()`` abstract method that must be implemented. If you were relying on subclasses to implement that method, make sure to check for the method's existence first. You will probably want to check for ``find_loader()`` first, though, in the case of working with :term:`path entry finders <path entry finder>`.
pt_pt: :class:`!importlib.abc.Finder` já não especifica um método abstrato ``find_module()`` que deve ser implementado. Se estava a confiar em subclasses para implementar esse método, certifique-se de verificar primeiro a existência do método. Provavelmente vai querer verificar primeiro ``find_loader()``, no caso de estar a trabalhar com :term:`path entry finders <path entry finder>`.

source: :mod:`pkgutil` has been converted to use :mod:`importlib` internally. This eliminates many edge cases where the old behaviour of the :pep:`302` import emulation failed to match the behaviour of the real import system. The import emulation itself is still present, but is now deprecated. The :func:`pkgutil.iter_importers` and :func:`pkgutil.walk_packages` functions special case the standard import hooks so they are still supported even though they do not provide the non-standard ``iter_modules()`` method.
pt_pt: :mod:`pkgutil` foi convertido para usar :mod:`importlib` internamente. Isto elimina muitos casos limite em que o comportamento antigo da emulação de importação :pep:`302` falhava em corresponder ao comportamento do sistema de importação real. A própria emulação de importação ainda está presente, mas agora está obsoleta. As funções :func:`pkgutil.iter_importers` e :func:`pkgutil.walk_packages` tratam os *hooks* de importação padrão como casos especiais, de modo que ainda são suportados, embora não forneçam o método não padrão ``iter_modules()``.

source: A longstanding RFC-compliance bug (:issue:`1079`) in the parsing done by :func:`email.header.decode_header` has been fixed. Code that uses the standard idiom to convert encoded headers into unicode (``str(make_header(decode_header(h))``) will see no change, but code that looks at the individual tuples returned by decode_header will see that whitespace that precedes or follows ``ASCII`` sections is now included in the ``ASCII`` section. Code that builds headers using ``make_header`` should also continue to work without change, since ``make_header`` continues to add whitespace between ``ASCII`` and non-``ASCII`` sections if it is not already present in the input strings.
pt_pt: Um bug de conformidade com RFC de longa data (:issue:`1079`) na análise feita por :func:`email.header.decode_header` foi corrigido. O código que usa a expressão padrão para converter cabeçalhos codificados em unicode (``str(make_header(decode_header(h))``) não sofrerá alterações, mas o código que analisa as tuplas individuais retornadas por decode_header verá que os espaços em branco que precedem ou seguem as seções ``ASCII`` agora estão incluídos na seção ``ASCII``. O código que constrói cabeçalhos usando ``make_header`` também deve continuar a funcionar sem alterações, uma vez que ``make_header`` continua a adicionar espaços em branco entre as secções ``ASCII`` e não ``ASCII``, se ainda não estiverem presentes nas cadeias de caracteres de entrada.

source: :func:`email.utils.formataddr` now does the correct content transfer encoding when passed non-``ASCII`` display names. Any code that depended on the previous buggy behavior that preserved the non-``ASCII`` unicode in the formatted output string will need to be changed (:issue:`1690608`).
pt_pt: :func:`email.utils.formataddr` faz agora a codificação de transferência de conteúdo correta quando são passados nomes de apresentação não-``ASCII``. Qualquer código que dependesse do comportamento errado anterior, que preservava o Unicode não-``ASCII`` na *string* de saída formatada, precisará de ser alterado (:issue:`1690608`).

source: :meth:`poplib.POP3.quit` may now raise protocol errors like all other ``poplib`` methods. Code that assumes ``quit`` does not raise :exc:`poplib.error_proto` errors may need to be changed if errors on ``quit`` are encountered by a particular application (:issue:`11291`).
pt_pt: :meth:`poplib.POP3.quit` pode agora gerar erros de protocolo como todos os outros métodos ``poplib``. Código que assume que ``quit`` não gera erros :exc:`poplib.error_proto` pode precisar de ser alterado se erros em ``quit`` forem encontrados por uma aplicação específica (:issue:`11291`).

source: The ``strict`` argument to :class:`email.parser.Parser`, deprecated since Python 2.4, has finally been removed.
pt_pt: O argumento ``strict`` para :class:`email.parser.Parser`, obsoleto desde o Python 2.4, foi finalmente removido.

source: The deprecated method ``unittest.TestCase.assertSameElements`` has been removed.
pt_pt: O método obsoleto ``unittest.TestCase.assertSameElements`` foi removido.

source: The deprecated variable ``time.accept2dyear`` has been removed.
pt_pt: A variável obsoleta ``time.accept2dyear`` foi removida.

source: The deprecated ``Context._clamp`` attribute has been removed from the :mod:`decimal` module. It was previously replaced by the public attribute :attr:`~decimal.Context.clamp`. (See :issue:`8540`.)
pt_pt: O atributo obsoleto ``Context._clamp`` foi removido do módulo :mod:`decimal`. Foi anteriormente substituído pelo atributo público :attr:`~decimal.Context.clamp`. (Veja :issue:`8540`.)

source: The undocumented internal helper class ``SSLFakeFile`` has been removed from :mod:`smtplib`, since its functionality has long been provided directly by :meth:`socket.socket.makefile`.
pt_pt: A classe auxiliar interna não documentada ``SSLFakeFile`` foi removida de :mod:`smtplib`, uma vez que a sua funcionalidade tem sido fornecida diretamente por :meth:`socket.socket.makefile`.

source: Passing a negative value to :func:`time.sleep` on Windows now raises an error instead of sleeping forever. It has always raised an error on posix.
pt_pt: Passar um valor negativo para :func:`time.sleep` no Windows gera agora um erro em vez de dormir para sempre. Sempre gerou um erro em POSIX.

source: The ``ast.__version__`` constant has been removed. If you need to make decisions affected by the AST version, use :data:`sys.version_info` to make the decision.
pt_pt: A constante ``ast.__version__`` foi removida. Se precisar de tomar decisões afetadas pela versão da AST, use :data:`sys.version_info` para tomar a decisão.

source: Code that used to work around the fact that the :mod:`threading` module used factory functions by subclassing the private classes will need to change to subclass the now-public classes.
pt_pt: Código que contornava o facto de o módulo :mod:`threading` usar funções de fábrica ao criar subclasses das classes privadas precisará de ser alterado para criar subclasses das classes agora públicas.

source: The undocumented debugging machinery in the threading module has been removed, simplifying the code. This should have no effect on production code, but is mentioned here in case any application debug frameworks were interacting with it (:issue:`13550`).
pt_pt: A maquinaria de depuração não documentada no módulo threading foi removida, simplificando o código. Isto não deve ter qualquer efeito no código de produção, mas é mencionado aqui caso algum *framework* de depuração de aplicação estivesse a interagir com ele (:issue:`13550`).

source: Porting C code
pt_pt: Portar código C

source: In the course of changes to the buffer API the undocumented :c:member:`!smalltable` member of the :c:type:`Py_buffer` structure has been removed and the layout of the :c:type:`!PyMemoryViewObject` has changed.
pt_pt: No decorrer das alterações à API de *buffer*, o membro não documentado :c:member:`!smalltable` da estrutura :c:type:`Py_buffer` foi removido e o layout de :c:type:`!PyMemoryViewObject` foi alterado.

source: All extensions relying on the relevant parts in ``memoryobject.h`` or ``object.h`` must be rebuilt.
pt_pt: Todas as extensões que dependem das partes relevantes em ``memoryobject.h`` ou ``object.h`` devem ser recompiladas.

source: Due to :ref:`PEP 393 <pep-393>`, the :c:type:`Py_UNICODE` type and all functions using this type are deprecated (but will stay available for at least five years). If you were using low-level Unicode APIs to construct and access unicode objects and you want to benefit of the memory footprint reduction provided by :pep:`393`, you have to convert your code to the new :doc:`Unicode API <../c-api/unicode>`.
pt_pt: Devido à :ref:`PEP 393 <pep-393>`, o tipo :c:type:`Py_UNICODE` e todas as funções que usam este tipo estão obsoletas (mas continuarão disponíveis por pelo menos cinco anos). Se estava a usar APIs Unicode de baixo nível para construir e aceder a objetos Unicode e deseja beneficiar da redução da pegada de memória fornecida pela :pep:`393`, terá de converter o seu código para a nova :doc:`API Unicode <../c-api/unicode>`.

source: However, if you only have been using high-level functions such as :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` or :c:func:`PyUnicode_FromFormat()`, your code will automatically take advantage of the new unicode representations.
pt_pt: No entanto, se só tem usado funções de alto nível como :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` ou :c:func:`PyUnicode_FromFormat()`, o seu código tirará automaticamente partido das novas representações Unicode.

source: :c:func:`PyImport_GetMagicNumber` now returns ``-1`` upon failure.
pt_pt: :c:func:`PyImport_GetMagicNumber` devolve agora ``-1`` em caso de falha.

source: As a negative value for the *level* argument to :func:`__import__` is no longer valid, the same now holds for :c:func:`PyImport_ImportModuleLevel`. This also means that the value of *level* used by :c:func:`PyImport_ImportModuleEx` is now ``0`` instead of ``-1``.
pt_pt: Como um valor negativo para o argumento *level* de :func:`__import__` já não é válido, o mesmo aplica-se agora a :c:func:`PyImport_ImportModuleLevel`. Isto também significa que o valor de *level* usado por :c:func:`PyImport_ImportModuleEx` é agora ``0`` em vez de ``-1``.

source: Building C extensions
pt_pt: Compilar extensões C

source: The range of possible file names for C extensions has been narrowed. Very rarely used spellings have been suppressed: under POSIX, files named ``xxxmodule.so``, ``xxxmodule.abi3.so`` and ``xxxmodule.cpython-*.so`` are no longer recognized as implementing the ``xxx`` module. If you had been generating such files, you have to switch to the other spellings (i.e., remove the ``module`` string from the file names).
pt_pt: A gama de nomes de ficheiros possíveis para extensões C foi reduzida. Ortografias muito raramente usadas foram suprimidas: em POSIX, ficheiros chamados ``xxxmodule.so``, ``xxxmodule.abi3.so`` e ``xxxmodule.cpython-*.so`` já não são reconhecidos como implementando o módulo ``xxx``. Se estava a gerar tais ficheiros, terá de mudar para as outras ortografias (ou seja, remover a *string* ``module`` dos nomes dos ficheiros).

source: (implemented in :issue:`14040`.)
pt_pt: (implementado em :issue:`14040`.)

source: Command Line Switch Changes
pt_pt: Alterações nas opções da linha de comandos

source: The -Q command-line flag and related artifacts have been removed. Code checking sys.flags.division_warning will need updating.
pt_pt: A opção -Q da linha de comandos e artefactos relacionados foram removidos. Código que verifica sys.flags.division_warning precisará de ser atualizado.

source: (:issue:`10998`, contributed by Éric Araujo.)
pt_pt: (:issue:`10998`, contribuído por Éric Araujo.)

source: When :program:`python` is started with :option:`-S`, ``import site`` will no longer add site-specific paths to the module search paths. In previous versions, it did.
pt_pt: Quando :program:`python` é iniciado com :option:`-S`, ``import site`` já não adicionará caminhos específicos do *site* aos caminhos de pesquisa de módulos. Nas versões anteriores, fazia-o.

source: (:issue:`11591`, contributed by Carl Meyer with editions by Éric Araujo.)
pt_pt: (:issue:`11591`, contribuído por Carl Meyer com edições de Éric Araujo.)

source: yield from (in What's New)
pt_pt: yield from (em Novidades)
