Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: The stat family of functions (:func:`~os.stat`, :func:`~os.fstat`, and :func:`~os.lstat`) now support reading a file's timestamps with nanosecond precision. Symmetrically, :func:`~os.utime` can now write file timestamps with nanosecond precision. (Contributed by Larry Hastings in :issue:`14127`.)
pt_pt: A família de funções stat (:func:`~os.stat`, :func:`~os.fstat` e :func:`~os.lstat`) suporta agora a leitura dos *timestamps* de um ficheiro com precisão de nanosegundos. Simetricamente, :func:`~os.utime` pode agora escrever *timestamps* de ficheiros com precisão de nanosegundos. (Contribuído por Larry Hastings em :issue:`14127`.)

source: The new :func:`os.get_terminal_size` function queries the size of the terminal attached to a file descriptor. See also :func:`shutil.get_terminal_size`. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
pt_pt: A nova função :func:`os.get_terminal_size` consulta o tamanho do terminal associado a um descritor de ficheiro. Veja também :func:`shutil.get_terminal_size`. (Contribuído por Zbigniew Jędrzejewski-Szmek em :issue:`13609`.)

source: New functions to support Linux extended attributes (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.
pt_pt: Novas funções para suportar atributos estendidos do Linux (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.

source: New interface to the scheduler. These functions control how a process is allocated CPU time by the operating system. New functions: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`,
pt_pt: Nova interface para o escalonador. Estas funções controlam como um processo é alocado tempo de CPU pelo sistema operativo. Novas funções: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`.

source: New functions to control the file system:
pt_pt: Novas funções para controlar o sistema de ficheiros:

source: :func:`~os.posix_fadvise`: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations.
pt_pt: :func:`~os.posix_fadvise`: Anuncia a intenção de aceder a dados num padrão específico, permitindo assim que o *kernel* faça otimizações.

source: :func:`~os.posix_fallocate`: Ensures that enough disk space is allocated for a file.
pt_pt: :func:`~os.posix_fallocate`: Garante que espaço suficiente em disco é alocado para um ficheiro.

source: :func:`~os.sync`: Force write of everything to disk.
pt_pt: :func:`~os.sync`: Força a escrita de tudo para o disco.

source: Additional new posix functions:
pt_pt: Funções POSIX novas adicionais:

source: :func:`~os.lockf`: Apply, test or remove a POSIX lock on an open file descriptor.
pt_pt: :func:`~os.lockf`: Aplica, testa ou remove um bloqueio POSIX num descritor de ficheiro aberto.

source: :func:`~os.pread`: Read from a file descriptor at an offset, the file offset remains unchanged.
pt_pt: :func:`~os.pread`: Lê a partir de um descritor de ficheiro num desvio, o desvio do ficheiro permanece inalterado.

source: :func:`~os.pwrite`: Write to a file descriptor from an offset, leaving the file offset unchanged.
pt_pt: :func:`~os.pwrite`: Escreve num descritor de ficheiro a partir de um desvio, deixando o desvio do ficheiro inalterado.

source: :func:`~os.readv`: Read from a file descriptor into a number of writable buffers.
pt_pt: :func:`~os.readv`: Lê a partir de um descritor de ficheiro para vários *buffers* graváveis.

source: :func:`~os.truncate`: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
pt_pt: :func:`~os.truncate`: Trunca o ficheiro correspondente a *path*, de modo que tenha no máximo *length* *bytes* de tamanho.

source: :func:`~os.waitid`: Wait for the completion of one or more child processes.
pt_pt: :func:`~os.waitid`: Aguarda pela conclusão de um ou mais processos filhos.

source: :func:`~os.writev`: Write the contents of *buffers* to a file descriptor, where *buffers* is an arbitrary sequence of buffers.
pt_pt: :func:`~os.writev`: Escreve o conteúdo de *buffers* para um descritor de ficheiro, onde *buffers* é uma sequência arbitrária de *buffers*.

source: :func:`~os.getgrouplist` (:issue:`9344`): Return list of group ids that specified user belongs to.
pt_pt: :func:`~os.getgrouplist` (:issue:`9344`): Devolve uma lista de IDs de grupo a que pertence o utilizador especificado.

source: :func:`~os.times` and :func:`~os.uname`: Return type changed from a tuple to a tuple-like object with named attributes.
pt_pt: :func:`~os.times` e :func:`~os.uname`: O tipo de retorno foi alterado de um tuplo para um objeto semelhante a um tuplo com atributos nomeados.

source: Some platforms now support additional constants for the :func:`~os.lseek` function, such as ``os.SEEK_HOLE`` and ``os.SEEK_DATA``.
pt_pt: Algumas plataformas suportam agora constantes adicionais para a função :func:`~os.lseek`, como ``os.SEEK_HOLE`` e ``os.SEEK_DATA``.

source: New constants :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE`, :const:`~os.RTLD_NOLOAD`, and :const:`~os.RTLD_DEEPBIND` are available on platforms that support them. These are for use with the :func:`sys.setdlopenflags` function, and supersede the similar constants defined in :mod:`ctypes` and :mod:`!DLFCN`. (Contributed by Victor Stinner in :issue:`13226`.)
pt_pt: Novas constantes :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE`, :const:`~os.RTLD_NOLOAD` e :const:`~os.RTLD_DEEPBIND` estão disponíveis em plataformas que as suportam. Estas são para uso com a função :func:`sys.setdlopenflags` e substituem as constantes semelhantes definidas em :mod:`ctypes` e :mod:`!DLFCN`. (Contribuído por Victor Stinner em :issue:`13226`.)

source: :func:`os.symlink` now accepts (and ignores) the ``target_is_directory`` keyword argument on non-Windows platforms, to ease cross-platform support.
pt_pt: :func:`os.symlink` aceita agora (e ignora) o argumento nomeado ``target_is_directory`` em plataformas não-Windows, para facilitar o suporte entre plataformas.

source: Tab-completion is now available not only for command names, but also their arguments. For example, for the ``break`` command, function and file names are completed.
pt_pt: A conclusão por tabulação está agora disponível não só para nomes de comandos, mas também para os seus argumentos. Por exemplo, para o comando ``break``, os nomes de funções e ficheiros são completados.

source: (Contributed by Georg Brandl in :issue:`14210`)
pt_pt: (Contribuído por Georg Brandl em :issue:`14210`)

source: :class:`pickle.Pickler` objects now have an optional :attr:`~pickle.Pickler.dispatch_table` attribute allowing per-pickler reduction functions to be set.
pt_pt: Os objetos :class:`pickle.Pickler` têm agora um atributo opcional :attr:`~pickle.Pickler.dispatch_table` que permite definir funções de redução por *pickler*.

source: (Contributed by Richard Oudkerk in :issue:`14166`.)
pt_pt: (Contribuído por Richard Oudkerk em :issue:`14166`.)

source: The Tk GUI and the :func:`!serve` function have been removed from the :mod:`pydoc` module: ``pydoc -g`` and :func:`!serve` have been deprecated in Python 3.2.
pt_pt: A interface gráfica Tk e a função :func:`!serve` foram removidas do módulo :mod:`pydoc`: ``pydoc -g`` e :func:`!serve` foram preteridas no Python 3.2.

source: :class:`str` regular expressions now support ``\u`` and ``\U`` escapes.
pt_pt: As expressões regulares :class:`str` suportam agora as sequências de escape ``\u`` e ``\U``.

source: (Contributed by Serhiy Storchaka in :issue:`3665`.)
pt_pt: (Contribuído por Serhiy Storchaka em :issue:`3665`.)

source: :meth:`~sched.scheduler.run` now accepts a *blocking* parameter which when set to false makes the method execute the scheduled events due to expire soonest (if any) and then return immediately. This is useful in case you want to use the :class:`~sched.scheduler` in non-blocking applications. (Contributed by Giampaolo Rodolà in :issue:`13449`.)
pt_pt: :meth:`~sched.scheduler.run` aceita agora um parâmetro *blocking* que, quando definido como falso, faz com que o método execute os eventos agendados para expirar em breve (se houver) e depois retorne imediatamente. Isto é útil se pretender usar o :class:`~sched.scheduler` em aplicações não bloqueantes. (Contribuído por Giampaolo Rodolà em :issue:`13449`.)

source: :class:`~sched.scheduler` class can now be safely used in multi-threaded environments. (Contributed by Josiah Carlson and Giampaolo Rodolà in :issue:`8684`.)
pt_pt: A classe :class:`~sched.scheduler` pode agora ser usada com segurança em ambientes multi-*thread*. (Contribuído por Josiah Carlson e Giampaolo Rodolà em :issue:`8684`.)

source: *timefunc* and *delayfunct* parameters of :class:`~sched.scheduler` class constructor are now optional and defaults to :func:`time.time` and :func:`time.sleep` respectively. (Contributed by Chris Clark in :issue:`13245`.)
pt_pt: Os parâmetros *timefunc* e *delayfunct* do construtor da classe :class:`~sched.scheduler` são agora opcionais e têm como predefinição :func:`time.time` e :func:`time.sleep`, respetivamente. (Contribuído por Chris Clark em :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` *argument* parameter is now optional. (Contributed by Chris Clark in :issue:`13245`.)
pt_pt: O parâmetro *argument* dos métodos :meth:`~sched.scheduler.enter` e :meth:`~sched.scheduler.enterabs` é agora opcional. (Contribuído por Chris Clark em :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` now accept a *kwargs* parameter. (Contributed by Chris Clark in :issue:`13245`.)
pt_pt: Os métodos :meth:`~sched.scheduler.enter` e :meth:`~sched.scheduler.enterabs` aceitam agora um parâmetro *kwargs*. (Contribuído por Chris Clark em :issue:`13245`.)

source: Solaris and derivative platforms have a new class :class:`select.devpoll` for high performance asynchronous sockets via :file:`/dev/poll`. (Contributed by Jesús Cea Avión in :issue:`6397`.)
pt_pt: As plataformas Solaris e derivadas têm uma nova classe :class:`select.devpoll` para *sockets* assíncronos de alto desempenho através de :file:`/dev/poll`. (Contribuído por Jesús Cea Avión em :issue:`6397`.)

source: The previously undocumented helper function ``quote`` from the :mod:`!pipes` modules has been moved to the :mod:`shlex` module and documented. :func:`~shlex.quote` properly escapes all characters in a string that might be otherwise given special meaning by the shell.
pt_pt: A função auxiliar ``quote``, anteriormente não documentada, do módulo :mod:`!pipes`, foi movida para o módulo :mod:`shlex` e documentada. :func:`~shlex.quote` escapa corretamente todos os caracteres numa *string* que possam ter significado especial na *shell*.

source: New functions:
pt_pt: Novas funções:

source: :func:`~shutil.disk_usage`: provides total, used and free disk space statistics. (Contributed by Giampaolo Rodolà in :issue:`12442`.)
pt_pt: :func:`~shutil.disk_usage`: fornece estatísticas de espaço total, usado e livre em disco. (Contribuído por Giampaolo Rodolà em :issue:`12442`.)

source: :func:`~shutil.chown`: allows one to change user and/or group of the given path also specifying the user/group names and not only their numeric ids. (Contributed by Sandro Tosi in :issue:`12191`.)
pt_pt: :func:`~shutil.chown`: permite alterar o utilizador e/ou grupo do caminho dado, especificando também os nomes de utilizador/grupo e não apenas os seus IDs numéricos. (Contribuído por Sandro Tosi em :issue:`12191`.)

source: :func:`shutil.get_terminal_size`: returns the size of the terminal window to which the interpreter is attached. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
pt_pt: :func:`shutil.get_terminal_size`: devolve o tamanho da janela do terminal a que o interpretador está ligado. (Contribuído por Zbigniew Jędrzejewski-Szmek em :issue:`13609`.)

source: :func:`~shutil.copy2` and :func:`~shutil.copystat` now preserve file timestamps with nanosecond precision on platforms that support it. They also preserve file "extended attributes" on Linux. (Contributed by Larry Hastings in :issue:`14127` and :issue:`15238`.)
pt_pt: :func:`~shutil.copy2` e :func:`~shutil.copystat` preservam agora os *timestamps* de ficheiros com precisão de nanosegundos em plataformas que o suportam. Também preservam os "atributos estendidos" de ficheiros no Linux. (Contribuído por Larry Hastings em :issue:`14127` e :issue:`15238`.)

source: Several functions now take an optional ``symlinks`` argument: when that parameter is true, symlinks aren't dereferenced and the operation instead acts on the symlink itself (or creates one, if relevant). (Contributed by Hynek Schlawack in :issue:`12715`.)
pt_pt: Várias funções aceitam agora um argumento opcional ``symlinks``: quando esse parâmetro é verdadeiro, os *symlinks* não são dereferenciados e a operação age em vez disso no próprio *symlink* (ou cria um, se relevante). (Contribuído por Hynek Schlawack em :issue:`12715`.)

source: When copying files to a different file system, :func:`~shutil.move` now handles symlinks the way the posix ``mv`` command does, recreating the symlink rather than copying the target file contents. (Contributed by Jonathan Niehof in :issue:`9993`.) :func:`~shutil.move` now also returns the ``dst`` argument as its result.
pt_pt: Ao copiar ficheiros para um sistema de ficheiros diferente, :func:`~shutil.move` trata agora os *symlinks* da mesma forma que o comando POSIX ``mv``, recriando o *symlink* em vez de copiar o conteúdo do ficheiro de destino. (Contribuído por Jonathan Niehof em :issue:`9993`.) :func:`~shutil.move` devolve agora o argumento ``dst`` como resultado.

source: :func:`~shutil.rmtree` is now resistant to symlink attacks on platforms which support the new ``dir_fd`` parameter in :func:`os.open` and :func:`os.unlink`. (Contributed by Martin von Löwis and Hynek Schlawack in :issue:`4489`.)
pt_pt: :func:`~shutil.rmtree` é agora resistente a ataques de *symlink* em plataformas que suportam o novo parâmetro ``dir_fd`` em :func:`os.open` e :func:`os.unlink`. (Contribuído por Martin von Löwis e Hynek Schlawack em :issue:`4489`.)

source: signal
pt_pt: sinal

source: The :mod:`signal` module has new functions:
pt_pt: O módulo :mod:`signal` tem novas funções:

source: :func:`~signal.pthread_sigmask`: fetch and/or change the signal mask of the calling thread (Contributed by Jean-Paul Calderone in :issue:`8407`);
pt_pt: :func:`~signal.pthread_sigmask`: obtém e/ou altera a máscara de sinais da *thread* de chamada (Contribuído por Jean-Paul Calderone em :issue:`8407`);

source: :func:`~signal.pthread_kill`: send a signal to a thread;
pt_pt: :func:`~signal.pthread_kill`: envia um sinal para uma *thread*;

source: :func:`~signal.sigpending`: examine pending functions;
pt_pt: :func:`~signal.sigpending`: examina funções pendentes;

source: :func:`~signal.sigwait`: wait a signal;
pt_pt: :func:`~signal.sigwait`: aguarda um sinal;

source: :func:`~signal.sigwaitinfo`: wait for a signal, returning detailed information about it;
pt_pt: :func:`~signal.sigwaitinfo`: aguarda por um sinal, devolvendo informações detalhadas sobre ele;

source: :func:`~signal.sigtimedwait`: like :func:`~signal.sigwaitinfo` but with a timeout.
pt_pt: :func:`~signal.sigtimedwait`: semelhante a :func:`~signal.sigwaitinfo`, mas com um *timeout*.

source: The signal handler writes the signal number as a single byte instead of a nul byte into the wakeup file descriptor. So it is possible to wait more than one signal and know which signals were raised.
pt_pt: O manipulador de sinais escreve o número do sinal como um *byte* único em vez de um *byte* nulo no descritor de ficheiro de despertar. Assim, é possível aguardar por mais do que um sinal e saber quais sinais foram gerados.

source: :func:`signal.signal` and :func:`signal.siginterrupt` raise an OSError, instead of a RuntimeError: OSError has an errno attribute.
pt_pt: :func:`signal.signal` e :func:`signal.siginterrupt` geram agora um OSError, em vez de um RuntimeError: OSError tem um atributo errno.

source: The :mod:`!smtpd` module now supports :rfc:`5321` (extended SMTP) and :rfc:`1870` (size extension). Per the standard, these extensions are enabled if and only if the client initiates the session with an ``EHLO`` command.
pt_pt: O módulo :mod:`!smtpd` suporta agora :rfc:`5321` (SMTP estendido) e :rfc:`1870` (extensão de tamanho). De acordo com o padrão, estas extensões estão ativadas se e somente se o cliente iniciar a sessão com um comando ``EHLO``.

source: (Initial ``ELHO`` support by Alberto Trevino. Size extension by Juhana Jauhiainen. Substantial additional work on the patch contributed by Michele Orrù and Dan Boswell. :issue:`8739`)
pt_pt: (Suporte inicial ``ELHO`` por Alberto Trevino. Extensão de tamanho por Juhana Jauhiainen. Trabalho adicional substancial no *patch* contribuído por Michele Orrù e Dan Boswell. :issue:`8739`)

source: The :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL`, and :class:`~smtplib.LMTP` classes now accept a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Paulo Scardine in :issue:`11281`.)
pt_pt: As classes :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL` e :class:`~smtplib.LMTP` agora aceitam um argumento nomeado ``source_address`` para especificar o ``(host, port)`` a ser usado como endereço de origem na chamada bind ao criar o socket de saída. (Contribuição de Paulo Scardine na :issue:`11281`.)

source: :class:`~smtplib.SMTP` now supports the context management protocol, allowing an ``SMTP`` instance to be used in a ``with`` statement. (Contributed by Giampaolo Rodolà in :issue:`11289`.)
pt_pt: :class:`~smtplib.SMTP` agora suporta o protocolo de gestão de contexto, permitindo que uma instância ``SMTP`` seja usada numa instrução ``with``. (Contribuição de Giampaolo Rodolà na :issue:`11289`.)

source: The :class:`~smtplib.SMTP_SSL` constructor and the :meth:`~smtplib.SMTP.starttls` method now accept an SSLContext parameter to control parameters of the secure channel. (Contributed by Kasun Herath in :issue:`8809`.)
pt_pt: O construtor :class:`~smtplib.SMTP_SSL` e o método :meth:`~smtplib.SMTP.starttls` agora aceitam um parâmetro SSLContext para controlar os parâmetros do canal seguro. (Contribuição de Kasun Herath na :issue:`8809`.)

source: The :class:`~socket.socket` class now exposes additional methods to process ancillary data when supported by the underlying platform:
pt_pt: A classe :class:`~socket.socket` agora expõe métodos adicionais para processar dados auxiliares quando suportados pela plataforma subjacente:

source: (Contributed by David Watson in :issue:`6560`, based on an earlier patch by Heiko Wundram)
pt_pt: (Contribuído por David Watson em :issue:`6560`, baseado num *patch* anterior de Heiko Wundram)

source: The :class:`~socket.socket` class now supports the PF_CAN protocol family (https://en.wikipedia.org/wiki/Socketcan), on Linux (https://lwn.net/Articles/253425).
pt_pt: A classe :class:`~socket.socket` suporta agora a família de protocolos PF_CAN (https://en.wikipedia.org/wiki/Socketcan), no Linux (https://lwn.net/Articles/253425).

source: (Contributed by Matthias Fuchs, updated by Tiago Gonçalves in :issue:`10141`.)
pt_pt: (Contribuído por Matthias Fuchs, atualizado por Tiago Gonçalves em :issue:`10141`.)

source: The :class:`~socket.socket` class now supports the PF_RDS protocol family (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets and `https://oss.oracle.com/projects/rds <https://web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).
pt_pt: A classe :class:`~socket.socket` suporta agora a família de protocolos PF_RDS (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets e `https://oss.oracle.com/projects/rds <https://web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).

source: The :class:`~socket.socket` class now supports the ``PF_SYSTEM`` protocol family on OS X. (Contributed by Michael Goderbauer in :issue:`13777`.)
pt_pt: A classe :class:`~socket.socket` suporta agora a família de protocolos ``PF_SYSTEM`` no OS X. (Contribuído por Michael Goderbauer em :issue:`13777`.)

source: New function :func:`~socket.sethostname` allows the hostname to be set on Unix systems if the calling process has sufficient privileges. (Contributed by Ross Lagerwall in :issue:`10866`.)
pt_pt: A nova função :func:`~socket.sethostname` permite definir o nome do anfitrião em sistemas Unix se o processo de chamada tiver privilégios suficientes. (Contribuído por Ross Lagerwall em :issue:`10866`.)

source: :class:`~socketserver.BaseServer` now has an overridable method :meth:`~socketserver.BaseServer.service_actions` that is called by the :meth:`~socketserver.BaseServer.serve_forever` method in the service loop. :class:`~socketserver.ForkingMixIn` now uses this to clean up zombie child processes. (Contributed by Justin Warkentin in :issue:`11109`.)
pt_pt: :class:`~socketserver.BaseServer` tem agora um método substituível :meth:`~socketserver.BaseServer.service_actions` que é chamado pelo método :meth:`~socketserver.BaseServer.serve_forever` no ciclo de serviço. :class:`~socketserver.ForkingMixIn` usa agora isto para limpar processos filhos zombie. (Contribuído por Justin Warkentin em :issue:`11109`.)

source: New :class:`sqlite3.Connection` method :meth:`~sqlite3.Connection.set_trace_callback` can be used to capture a trace of all sql commands processed by sqlite. (Contributed by Torsten Landschoff in :issue:`11688`.)
pt_pt: O novo método :class:`sqlite3.Connection` :meth:`~sqlite3.Connection.set_trace_callback` pode ser usado para capturar um rastro de todos os comandos SQL processados pelo sqlite. (Contribuído por Torsten Landschoff em :issue:`11688`.)

source: The :mod:`ssl` module has two new random generation functions:
pt_pt: O módulo :mod:`ssl` tem duas novas funções de geração aleatória:

source: :func:`~ssl.RAND_bytes`: generate cryptographically strong pseudo-random bytes.
pt_pt: :func:`~ssl.RAND_bytes`: gera *bytes* pseudoaleatórios criptograficamente fortes.

source: :func:`!RAND_pseudo_bytes`: generate pseudo-random bytes.
pt_pt: :func:`!RAND_pseudo_bytes`: gera *bytes* pseudoaleatórios.

source: (Contributed by Victor Stinner in :issue:`12049`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`12049`.)

source: The :mod:`ssl` module now exposes a finer-grained exception hierarchy in order to make it easier to inspect the various kinds of errors. (Contributed by Antoine Pitrou in :issue:`11183`.)
pt_pt: O módulo :mod:`ssl` expõe agora uma hierarquia de exceções mais detalhada para facilitar a inspeção dos vários tipos de erros. (Contribuído por Antoine Pitrou em :issue:`11183`.)
