Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: :meth:`~ssl.SSLContext.load_cert_chain` now accepts a *password* argument to be used if the private key is encrypted. (Contributed by Adam Simpkins in :issue:`12803`.)
pt_pt: :meth:`~ssl.SSLContext.load_cert_chain` aceita agora um argumento *palavra_passe* para ser usado se a chave privada estiver encriptada. (Contribuído por Adam Simpkins em :issue:`12803`.)

source: Diffie-Hellman key exchange, both regular and Elliptic Curve-based, is now supported through the :meth:`~ssl.SSLContext.load_dh_params` and :meth:`~ssl.SSLContext.set_ecdh_curve` methods. (Contributed by Antoine Pitrou in :issue:`13626` and :issue:`13627`.)
pt_pt: A troca de chaves Diffie-Hellman, tanto regular como baseada em Curvas Elípticas, é agora suportada através dos métodos :meth:`~ssl.SSLContext.load_dh_params` e :meth:`~ssl.SSLContext.set_ecdh_curve`. (Contribuído por Antoine Pitrou em :issue:`13626` e :issue:`13627`.)

source: SSL sockets have a new :meth:`~ssl.SSLSocket.get_channel_binding` method allowing the implementation of certain authentication mechanisms such as SCRAM-SHA-1-PLUS. (Contributed by Jacek Konieczny in :issue:`12551`.)
pt_pt: Os *sockets* SSL têm um novo método :meth:`~ssl.SSLSocket.get_channel_binding` que permite a implementação de certos mecanismos de autenticação, como SCRAM-SHA-1-PLUS. (Contribuído por Jacek Konieczny em :issue:`12551`.)

source: You can query the SSL compression algorithm used by an SSL socket, thanks to its new :meth:`~ssl.SSLSocket.compression` method. The new attribute :const:`~ssl.OP_NO_COMPRESSION` can be used to disable compression. (Contributed by Antoine Pitrou in :issue:`13634`.)
pt_pt: Pode consultar o algoritmo de compressão SSL usado por um *socket* SSL, graças ao seu novo método :meth:`~ssl.SSLSocket.compression`. O novo atributo :const:`~ssl.OP_NO_COMPRESSION` pode ser usado para desativar a compressão. (Contribuído por Antoine Pitrou em :issue:`13634`.)

source: Support has been added for the Next Protocol Negotiation extension using the :meth:`ssl.SSLContext.set_npn_protocols` method. (Contributed by Colin Marc in :issue:`14204`.)
pt_pt: Foi adicionado suporte para a extensão Next Protocol Negotiation usando o método :meth:`ssl.SSLContext.set_npn_protocols`. (Contribuído por Colin Marc em :issue:`14204`.)

source: SSL errors can now be introspected more easily thanks to :attr:`~ssl.SSLError.library` and :attr:`~ssl.SSLError.reason` attributes. (Contributed by Antoine Pitrou in :issue:`14837`.)
pt_pt: Os erros SSL podem agora ser inspecionados mais facilmente graças aos atributos :attr:`~ssl.SSLError.library` e :attr:`~ssl.SSLError.reason`. (Contribuído por Antoine Pitrou em :issue:`14837`.)

source: The :func:`~ssl.get_server_certificate` function now supports IPv6. (Contributed by Charles-François Natali in :issue:`11811`.)
pt_pt: A função :func:`~ssl.get_server_certificate` suporta agora IPv6. (Contribuído por Charles-François Natali em :issue:`11811`.)

source: New attribute :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` allows setting SSLv3 server sockets to use the server's cipher ordering preference rather than the client's (:issue:`13635`).
pt_pt: O novo atributo :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` permite definir *sockets* de servidor SSLv3 para usar a preferência de ordenação de cifras do servidor em vez da do cliente (:issue:`13635`).

source: The undocumented tarfile.filemode function has been moved to :func:`stat.filemode`. It can be used to convert a file's mode to a string of the form '-rwxrwxrwx'.
pt_pt: A função não documentada tarfile.filemode foi movida para :func:`stat.filemode`. Pode ser usada para converter o modo de um ficheiro para uma *string* da forma '-rwxrwxrwx'.

source: (Contributed by Giampaolo Rodolà in :issue:`14807`.)
pt_pt: (Contribuído por Giampaolo Rodolà em :issue:`14807`.)

source: The :mod:`struct` module now supports :c:type:`ssize_t` and :c:type:`size_t` via the new codes ``n`` and ``N``, respectively. (Contributed by Antoine Pitrou in :issue:`3163`.)
pt_pt: O módulo :mod:`struct` suporta agora :c:type:`ssize_t` e :c:type:`size_t` através dos novos códigos ``n`` e ``N``, respetivamente. (Contribuído por Antoine Pitrou em :issue:`3163`.)

source: subprocess
pt_pt: subprocesso

source: Command strings can now be bytes objects on posix platforms. (Contributed by Victor Stinner in :issue:`8513`.)
pt_pt: As *strings* de comando podem agora ser objetos *bytes* em plataformas POSIX. (Contribuído por Victor Stinner em :issue:`8513`.)

source: A new constant :const:`~subprocess.DEVNULL` allows suppressing output in a platform-independent fashion. (Contributed by Ross Lagerwall in :issue:`5870`.)
pt_pt: Uma nova constante :const:`~subprocess.DEVNULL` permite suprimir a saída de forma independente da plataforma. (Contribuído por Ross Lagerwall em :issue:`5870`.)

source: The :mod:`sys` module has a new :data:`~sys.thread_info` :term:`named tuple` holding information about the thread implementation (:issue:`11223`).
pt_pt: O módulo :mod:`sys` tem um novo :data:`~sys.thread_info` :term:`tuplo nomeado` que contém informações sobre a implementação de *threads* (:issue:`11223`).

source: :mod:`tarfile` now supports ``lzma`` encoding via the :mod:`lzma` module. (Contributed by Lars Gustäbel in :issue:`5689`.)
pt_pt: :mod:`tarfile` suporta agora codificação ``lzma`` através do módulo :mod:`lzma`. (Contribuído por Lars Gustäbel em :issue:`5689`.)

source: :class:`tempfile.SpooledTemporaryFile`\'s :meth:`!truncate` method now accepts a ``size`` parameter. (Contributed by Ryan Kelly in :issue:`9957`.)
pt_pt: O método :meth:`!truncate` de :class:`tempfile.SpooledTemporaryFile` aceita agora um parâmetro ``size``. (Contribuído por Ryan Kelly em :issue:`9957`.)

source: The :mod:`textwrap` module has a new :func:`~textwrap.indent` that makes it straightforward to add a common prefix to selected lines in a block of text (:issue:`13857`).
pt_pt: O módulo :mod:`textwrap` tem uma nova função :func:`~textwrap.indent` que torna simples adicionar um prefixo comum a linhas selecionadas num bloco de texto (:issue:`13857`).

source: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event`, and :class:`threading.Timer`, all of which used to be factory functions returning a class instance, are now classes and may be subclassed. (Contributed by Éric Araujo in :issue:`10968`.)
pt_pt: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event` e :class:`threading.Timer`, que antes eram funções de fábrica que devolviam uma instância de classe, são agora classes e podem ser subclasses. (Contribuído por Éric Araujo em :issue:`10968`.)

source: The :class:`threading.Thread` constructor now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag value from the parent thread (:issue:`6064`).
pt_pt: O construtor de :class:`threading.Thread` aceita agora um argumento nomeado ``daemon`` para substituir o comportamento predefinido de herdar o valor da *flag* ``daemon`` da *thread* pai (:issue:`6064`).

source: The formerly private function ``_thread.get_ident`` is now available as the public function :func:`threading.get_ident`. This eliminates several cases of direct access to the ``_thread`` module in the stdlib. Third party code that used ``_thread.get_ident`` should likewise be changed to use the new public interface.
pt_pt: A função anteriormente privada ``_thread.get_ident`` está agora disponível como a função pública :func:`threading.get_ident`. Isto elimina vários casos de acesso direto ao módulo ``_thread`` na biblioteca padrão. Código de terceiros que usava ``_thread.get_ident`` deve ser alterado para usar a nova interface pública.

source: The :pep:`418` added new functions to the :mod:`time` module:
pt_pt: A :pep:`418` adicionou novas funções ao módulo :mod:`time`:

source: :func:`~time.get_clock_info`: Get information on a clock.
pt_pt: :func:`~time.get_clock_info`: Obtém informações sobre um relógio.

source: :func:`~time.monotonic`: Monotonic clock (cannot go backward), not affected by system clock updates.
pt_pt: :func:`~time.monotonic`: Relógio monotónico (não pode retroceder), não afetado por atualizações do relógio do sistema.

source: :func:`~time.perf_counter`: Performance counter with the highest available resolution to measure a short duration.
pt_pt: :func:`~time.perf_counter`: Contador de desempenho com a maior resolução disponível para medir uma curta duração.

source: :func:`~time.process_time`: Sum of the system and user CPU time of the current process.
pt_pt: :func:`~time.process_time`: Soma do tempo de CPU do sistema e do utilizador do processo atual.

source: Other new functions:
pt_pt: Outras novas funções:

source: :func:`~time.clock_getres`, :func:`~time.clock_gettime` and :func:`~time.clock_settime` functions with :samp:`CLOCK_{xxx}` constants. (Contributed by Victor Stinner in :issue:`10278`.)
pt_pt: Funções :func:`~time.clock_getres`, :func:`~time.clock_gettime` e :func:`~time.clock_settime` com constantes :samp:`CLOCK_{xxx}`. (Contribuído por Victor Stinner em :issue:`10278`.)

source: To improve cross platform consistency, :func:`~time.sleep` now raises a :exc:`ValueError` when passed a negative sleep value. Previously this was an error on posix, but produced an infinite sleep on Windows.
pt_pt: Para melhorar a consistência entre plataformas, :func:`~time.sleep` gera agora um :exc:`ValueError` quando é passado um valor de sono negativo. Anteriormente, isto era um erro em POSIX, mas produzia um sono infinito no Windows.

source: Add a new :class:`types.MappingProxyType` class: Read-only proxy of a mapping. (:issue:`14386`)
pt_pt: Adicionada uma nova classe :class:`types.MappingProxyType`: *proxy* de somente leitura de um mapeamento. (:issue:`14386`)

source: The new functions :func:`types.new_class` and :func:`types.prepare_class` provide support for :pep:`3115` compliant dynamic type creation. (:issue:`14588`)
pt_pt: As novas funções :func:`types.new_class` e :func:`types.prepare_class` fornecem suporte para a criação dinâmica de tipos compatível com :pep:`3115`. (:issue:`14588`)

source: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns`, and :meth:`.assertWarnsRegex` now accept a keyword argument *msg* when used as context managers. (Contributed by Ezio Melotti and Winston Ewert in :issue:`10775`.)
pt_pt: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns` e :meth:`.assertWarnsRegex` aceitam agora um argumento nomeado *msg* quando usados como gestores de contexto. (Contribuído por Ezio Melotti e Winston Ewert em :issue:`10775`.)

source: :meth:`unittest.TestCase.run` now returns the :class:`~unittest.TestResult` object.
pt_pt: :meth:`unittest.TestCase.run` devolve agora o objeto :class:`~unittest.TestResult`.

source: The :class:`~urllib.request.Request` class, now accepts a *method* argument used by :meth:`~urllib.request.Request.get_method` to determine what HTTP method should be used. For example, this will send a ``'HEAD'`` request::
pt_pt: A classe :class:`~urllib.request.Request` aceita agora um argumento *método* usado por :meth:`~urllib.request.Request.get_method` para determinar qual método HTTP deve ser usado. Por exemplo, isto enviará um pedido ``'HEAD'``::

source: >>> urlopen(Request('https://www.python.org', method='HEAD'))
pt_pt: >>> urlopen(Pedido('https://www.python.org', método='HEAD'))

source: The :mod:`webbrowser` module supports more "browsers": Google Chrome (named :program:`chrome`, :program:`chromium`, :program:`chrome-browser` or :program:`chromium-browser` depending on the version and operating system), and the generic launchers :program:`xdg-open`, from the FreeDesktop.org project, and :program:`gvfs-open`, which is the default URI handler for GNOME 3. (The former contributed by Arnaud Calmettes in :issue:`13620`, the latter by Matthias Klose in :issue:`14493`.)
pt_pt: O módulo :mod:`webbrowser` suporta mais "navegadores": Google Chrome (chamado :program:`chrome`, :program:`chromium`, :program:`chrome-browser` ou :program:`chromium-browser` dependendo da versão e do sistema operativo), e os lançadores genéricos :program:`xdg-open`, do projeto FreeDesktop.org, e :program:`gvfs-open`, que é o manipulador de URI predefinido para o GNOME 3. (O primeiro contribuído por Arnaud Calmettes em :issue:`13620`, o último por Matthias Klose em :issue:`14493`.)

source: The :mod:`xml.etree.ElementTree` module now imports its C accelerator by default; there is no longer a need to explicitly import :mod:`!xml.etree.cElementTree` (this module stays for backwards compatibility, but is now deprecated). In addition, the ``iter`` family of methods of :class:`~xml.etree.ElementTree.Element` has been optimized (rewritten in C). The module's documentation has also been greatly improved with added examples and a more detailed reference.
pt_pt: O módulo :mod:`xml.etree.ElementTree` importa agora o seu acelerador C por predefinição; já não é necessário importar explicitamente :mod:`!xml.etree.cElementTree` (este módulo permanece para compatibilidade retroativa, mas está agora obsoleto). Além disso, a família de métodos ``iter`` de :class:`~xml.etree.ElementTree.Element` foi otimizada (reescrita em C). A documentação do módulo também foi muito melhorada com exemplos adicionados e uma referência mais detalhada.

source: New attribute :attr:`zlib.Decompress.eof` makes it possible to distinguish between a properly formed compressed stream and an incomplete or truncated one. (Contributed by Nadeem Vawda in :issue:`12646`.)
pt_pt: O novo atributo :attr:`zlib.Decompress.eof` torna possível distinguir entre um fluxo comprimido corretamente formado e um incompleto ou truncado. (Contribuído por Nadeem Vawda em :issue:`12646`.)

source: New attribute :const:`zlib.ZLIB_RUNTIME_VERSION` reports the version string of the underlying ``zlib`` library that is loaded at runtime. (Contributed by Torsten Landschoff in :issue:`12306`.)
pt_pt: O novo atributo :const:`zlib.ZLIB_RUNTIME_VERSION` reporta a *string* de versão da biblioteca ``zlib`` subjacente que é carregada em tempo de execução. (Contribuído por Torsten Landschoff em :issue:`12306`.)

source: Optimizations
pt_pt: Otimizações

source: Major performance enhancements have been added:
pt_pt: Foram adicionadas melhorias significativas de desempenho:

source: Thanks to :pep:`393`, some operations on Unicode strings have been optimized:
pt_pt: Graças à :pep:`393`, algumas operações em *strings* Unicode foram otimizadas:

source: the memory footprint is divided by 2 to 4 depending on the text
pt_pt: a pegada de memória é dividida por 2 a 4 dependendo do texto

source: encode an ASCII string to UTF-8 doesn't need to encode characters anymore, the UTF-8 representation is shared with the ASCII representation
pt_pt: codificar uma *string* ASCII para UTF-8 já não necessita de codificar caracteres, a representação UTF-8 é partilhada com a representação ASCII

source: the UTF-8 encoder has been optimized
pt_pt: o codificador UTF-8 foi otimizado

source: repeating a single ASCII letter and getting a substring of an ASCII string is 4 times faster
pt_pt: repetir uma letra ASCII única e obter uma substring de uma *string* ASCII é 4 vezes mais rápido

source: UTF-8 is now 2x to 4x faster. UTF-16 encoding is now up to 10x faster.
pt_pt: UTF-8 é agora 2x a 4x mais rápido. A codificação UTF-16 é agora até 10x mais rápida.

source: (Contributed by Serhiy Storchaka, :issue:`14624`, :issue:`14738` and :issue:`15026`.)
pt_pt: (Contribuído por Serhiy Storchaka, :issue:`14624`, :issue:`14738` e :issue:`15026`.)

source: Build and C API Changes
pt_pt: Alterações na Compilação e na API C

source: Changes to Python's build process and to the C API include:
pt_pt: As alterações no processo de compilação do Python e na API C incluem:

source: New :pep:`3118` related function:
pt_pt: Nova função relacionada com :pep:`3118`:

source: :pep:`393` added new Unicode types, macros and functions:
pt_pt: :pep:`393` adicionou novos tipos Unicode, macros e funções:

source: High-level API:
pt_pt: API de alto nível:

source: Low-level API:
pt_pt: API de baixo nível:

source: :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4` types
pt_pt: tipos :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4`

source: :c:type:`PyASCIIObject` and :c:type:`PyCompactUnicodeObject` structures
pt_pt: estruturas :c:type:`PyASCIIObject` e :c:type:`PyCompactUnicodeObject`

source: :c:macro:`PyUnicode_KIND` with :c:enum:`!PyUnicode_Kind` enum: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`
pt_pt: :c:macro:`PyUnicode_KIND` com enumeração :c:enum:`!PyUnicode_Tipo`: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`

source: :c:macro:`PyArg_ParseTuple` now accepts a :class:`bytearray` for the ``c`` format (:issue:`12380`).
pt_pt: :c:macro:`PyArg_ParseTuple` aceita agora um :class:`bytearray` para o formato ``c`` (:issue:`12380`).

source: Deprecated
pt_pt: Obsoleto

source: Unsupported Operating Systems
pt_pt: Sistemas Operativos Não Suportados

source: OS/2 and VMS are no longer supported due to the lack of a maintainer.
pt_pt: OS/2 e VMS já não são suportados devido à falta de um mantenedor.

source: Windows 2000 and Windows platforms which set ``COMSPEC`` to ``command.com`` are no longer supported due to maintenance burden.
pt_pt: Windows 2000 e plataformas Windows que definem ``COMSPEC`` como ``command.com`` já não são suportadas devido ao encargo de manutenção.

source: OSF support, which was deprecated in 3.2, has been completely removed.
pt_pt: O suporte para OSF, que foi preterido em 3.2, foi completamente removido.

source: Deprecated Python modules, functions and methods
pt_pt: Módulos, funções e métodos Python obsoleto

source: Passing a non-empty string to ``object.__format__()`` is deprecated, and will produce a :exc:`TypeError` in Python 3.4 (:issue:`9856`).
pt_pt: Passar uma *string* não vazia para ``object.__format__()`` está obsoleto e gerará um :exc:`TypeError` no Python 3.4 (:issue:`9856`).

source: The ``unicode_internal`` codec has been deprecated because of the :pep:`393`, use UTF-8, UTF-16 (``utf-16-le`` or ``utf-16-be``), or UTF-32 (``utf-32-le`` or ``utf-32-be``)
pt_pt: O *codec* ``unicode_internal`` foi preterido devido à :pep:`393`; use UTF-8, UTF-16 (``utf-16-le`` ou ``utf-16-be``), ou UTF-32 (``utf-32-le`` ou ``utf-32-be``)

source: :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`: use :meth:`ftplib.FTP.mlsd`
pt_pt: :meth:`ftplib.FTP.nlst` e :meth:`ftplib.FTP.dir`: use :meth:`ftplib.FTP.mlsd`

source: :func:`!platform.popen`: use the :mod:`subprocess` module. Check especially the :ref:`subprocess-replacements` section (:issue:`11377`).
pt_pt: :func:`!platform.popen`: use o módulo :mod:`subprocess`. Consulte especialmente a secção :ref:`subprocess-replacements` (:issue:`11377`).

source: :issue:`13374`: The Windows bytes API has been deprecated in the :mod:`os` module. Use Unicode filenames, instead of bytes filenames, to not depend on the ANSI code page anymore and to support any filename.
pt_pt: :issue:`13374`: A API de *bytes* do Windows foi preterida no módulo :mod:`os`. Use nomes de ficheiros Unicode, em vez de nomes de ficheiros em *bytes*, para não depender da página de código ANSI e para suportar qualquer nome de ficheiro.

source: :issue:`13988`: The :mod:`!xml.etree.cElementTree` module is deprecated. The accelerator is used automatically whenever available.
pt_pt: :issue:`13988`: O módulo :mod:`!xml.etree.cElementTree` está obsoleto. O acelerador é usado automaticamente sempre que disponível.

source: The behaviour of :func:`!time.clock` depends on the platform: use the new :func:`time.perf_counter` or :func:`time.process_time` function instead, depending on your requirements, to have a well defined behaviour.
pt_pt: O comportamento de :func:`!time.clock` depende da plataforma: use em vez disso a nova função :func:`time.perf_counter` ou :func:`time.process_time`, dependendo dos seus requisitos, para ter um comportamento bem definido.

source: The :func:`!os.stat_float_times` function is deprecated.
pt_pt: A função :func:`!os.stat_float_times` está obsoleta.

source: :mod:`abc` module:
pt_pt: Módulo :mod:`abc`:

source: :mod:`importlib` package:
pt_pt: Pacote :mod:`importlib`:

source: :meth:`importlib.abc.SourceLoader.path_mtime` is now deprecated in favour of :meth:`importlib.abc.SourceLoader.path_stats` as bytecode files now store both the modification time and size of the source file the bytecode file was compiled from.
pt_pt: :meth:`importlib.abc.SourceLoader.path_mtime` está agora obsoleto em favor de :meth:`importlib.abc.SourceLoader.path_stats`, uma vez que os ficheiros de *bytecode* armazenam agora tanto o tempo de modificação como o tamanho do ficheiro de origem a partir do qual o ficheiro de *bytecode* foi compilado.

source: Deprecated functions and types of the C API
pt_pt: Funções e tipos obsoletos da API C

source: The :c:type:`Py_UNICODE` has been deprecated by :pep:`393` and will be removed in Python 4. All functions using this type are deprecated:
pt_pt: O tipo :c:type:`Py_UNICODE` foi preterido pela :pep:`393` e será removido no Python 4. Todas as funções que usam este tipo estão obsoletas:

source: Unicode functions and methods using :c:type:`Py_UNICODE` and :c:expr:`Py_UNICODE*` types:
pt_pt: Funções e métodos Unicode que usam os tipos :c:type:`Py_UNICODE` e :c:expr:`Py_UNICODE*`:

source: :c:macro:`!PyUnicode_FromUnicode`: use :c:func:`PyUnicode_FromWideChar` or :c:func:`PyUnicode_FromKindAndData`
pt_pt: :c:macro:`!PyUnicode_FromUnicode`: use :c:func:`PyUnicode_FromWideChar` ou :c:func:`PyUnicode_FromKindAndData`

source: :c:macro:`!PyUnicode_AS_UNICODE`, :c:func:`!PyUnicode_AsUnicode`, :c:func:`!PyUnicode_AsUnicodeAndSize`: use :c:func:`PyUnicode_AsWideCharString`
pt_pt: :c:macro:`!PyUnicode_AS_UNICODE`, :c:func:`!PyUnicode_AsUnicode`, :c:func:`!PyUnicode_AsUnicodeAndSize`: usar :c:func:`PyUnicode_AsWideCharString`

source: :c:macro:`!PyUnicode_AS_DATA`: use :c:macro:`PyUnicode_DATA` with :c:macro:`PyUnicode_READ` and :c:macro:`PyUnicode_WRITE`
pt_pt: :c:macro:`!PyUnicode_AS_DATA`: usar :c:macro:`PyUnicode_DATA` com :c:macro:`PyUnicode_READ` e :c:macro:`PyUnicode_WRITE`

source: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: use :c:macro:`PyUnicode_GET_LENGTH` or :c:func:`PyUnicode_GetLength`
pt_pt: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: usar :c:macro:`PyUnicode_GET_LENGTH` ou :c:func:`PyUnicode_GetLength`

source: :c:macro:`!PyUnicode_GET_DATA_SIZE`: use ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (only work on ready strings)
pt_pt: :c:macro:`!PyUnicode_GET_DATA_SIZE`: use ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (funciona apenas em *strings* prontas)

source: :c:func:`!PyUnicode_AsUnicodeCopy`: use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString`
pt_pt: :c:func:`!PyUnicode_AsUnicodeCopy`: use :c:func:`PyUnicode_AsUCS4Copy` ou :c:func:`PyUnicode_AsWideCharString`

source: Functions and macros manipulating Py_UNICODE* strings:
pt_pt: Funções e macros que manipulam *strings* Py_UNICODE*:

source: :c:macro:`!Py_UNICODE_strlen()`: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
pt_pt: :c:macro:`!Py_UNICODE_strlen()`: use :c:func:`PyUnicode_GetLength` ou :c:macro:`PyUnicode_GET_LENGTH`

source: :c:macro:`!Py_UNICODE_strcat()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
pt_pt: :c:macro:`!Py_UNICODE_strcat()`: use :c:func:`PyUnicode_CopyCharacters` ou :c:func:`PyUnicode_FromFormat`
