Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: Beyond the expanse of what :mod:`importlib` now exposes, there are other visible changes to import. The biggest is that :data:`sys.meta_path` and :data:`sys.path_hooks` now store all of the meta path finders and path entry hooks used by import. Previously the finders were implicit and hidden within the C code of import instead of being directly exposed. This means that one can now easily remove or change the order of the various finders to fit one's needs.
pt_pt: Para além do que o :mod:`importlib` expõe agora, existem outras alterações visíveis na importação. A maior é que :data:`sys.meta_path` e :data:`sys.path_hooks` armazenam agora todos os *meta path finders* e *path entry hooks* usados pela importação. Anteriormente, os *finders* eram implícitos e escondidos no código C da importação em vez de estarem diretamente expostos. Isto significa que agora é possível remover ou alterar facilmente a ordem dos vários *finders* para se adequar às necessidades.

source: Another change is that all modules have a ``__loader__`` attribute, storing the loader used to create the module. :pep:`302` has been updated to make this attribute mandatory for loaders to implement, so in the future once 3rd-party loaders have been updated people will be able to rely on the existence of the attribute. Until such time, though, import is setting the module post-load.
pt_pt: Outra alteração é que todos os módulos têm um atributo ``__loader__``, que armazena o *loader* usado para criar o módulo. A :pep:`302` foi atualizada para tornar este atributo obrigatório para os *loaders* implementarem, pelo que, no futuro, assim que os *loaders* de terceiros forem atualizados, as pessoas poderão confiar na existência do atributo. Até lá, a importação define o atributo após o carregamento do módulo.

source: Loaders are also now expected to set the ``__package__`` attribute from :pep:`366`. Once again, import itself is already setting this on all loaders from :mod:`importlib` and import itself is setting the attribute post-load.
pt_pt: Os *loaders* são agora também esperados para definir o atributo ``__package__`` conforme a :pep:`366`. Mais uma vez, a importação já está a definir isto em todos os *loaders* do :mod:`importlib` e a própria importação define o atributo após o carregamento.

source: ``None`` is now inserted into :data:`sys.path_importer_cache` when no finder can be found on :data:`sys.path_hooks`. Since :class:`!imp.NullImporter` is not directly exposed on :data:`sys.path_hooks` it could no longer be relied upon to always be available to use as a value representing no finder found.
pt_pt: ``None`` é agora inserido em :data:`sys.path_importer_cache` quando nenhum *finder* é encontrado em :data:`sys.path_hooks`. Uma vez que :class:`!imp.NullImporter` não está diretamente exposto em :data:`sys.path_hooks`, já não se pode confiar que esteja sempre disponível para ser usado como um valor que representa nenhum *finder* encontrado.

source: All other changes relate to semantic changes which should be taken into consideration when updating code for Python 3.3, and thus should be read about in the `Porting Python code`_ section of this document.
pt_pt: Todas as outras alterações estão relacionadas com alterações semânticas que devem ser tidas em consideração ao atualizar código para Python 3.3, e devem ser lidas na secção `Porting Python code`_ deste documento.

source: (Implementation by Brett Cannon)
pt_pt: (Implementado por Brett Cannon)

source: Other Language Changes
pt_pt: Outras Alterações à Linguagem

source: Some smaller changes made to the core Python language are:
pt_pt: Algumas alterações menores feitas à linguagem principal do Python são:

source: Added support for Unicode name aliases and named sequences. Both :func:`unicodedata.lookup` and ``'\N{...}'`` now resolve name aliases, and :func:`unicodedata.lookup` resolves named sequences too.
pt_pt: Adicionado suporte para *aliases* de nomes Unicode e sequências nomeadas. Tanto :func:`unicodedata.lookup` como ``'\N{...}'`` resolvem agora *aliases* de nomes, e :func:`unicodedata.lookup` também resolve sequências nomeadas.

source: (Contributed by Ezio Melotti in :issue:`12753`.)
pt_pt: (Contribuído por Ezio Melotti em :issue:`12753`.)

source: Unicode database updated to UCD version 6.1.0
pt_pt: Base de dados Unicode atualizada para a versão UCD 6.1.0

source: Equality comparisons on :func:`range` objects now return a result reflecting the equality of the underlying sequences generated by those range objects. (:issue:`13201`)
pt_pt: As comparações de igualdade em objetos :func:`range` devolvem agora um resultado que reflete a igualdade das sequências subjacentes geradas por esses objetos *range*. (:issue:`13201`)

source: The ``count()``, ``find()``, ``rfind()``, ``index()`` and ``rindex()`` methods of :class:`bytes` and :class:`bytearray` objects now accept an integer between 0 and 255 as their first argument.
pt_pt: Os métodos ``count()``, ``find()``, ``rfind()``, ``index()`` e ``rindex()`` dos objetos :class:`bytes` e :class:`bytearray` aceitam agora um inteiro entre 0 e 255 como primeiro argumento.

source: (Contributed by Petri Lehtinen in :issue:`12170`.)
pt_pt: (Contribuído por Petri Lehtinen em :issue:`12170`.)

source: The ``rjust()``, ``ljust()``, and ``center()`` methods of :class:`bytes` and :class:`bytearray` now accept a :class:`bytearray` for the ``fill`` argument. (Contributed by Petri Lehtinen in :issue:`12380`.)
pt_pt: Os métodos ``rjust()``, ``ljust()`` e ``center()`` de :class:`bytes` e :class:`bytearray` aceitam agora um :class:`bytearray` para o argumento ``fill``. (Contribuído por Petri Lehtinen em :issue:`12380`.)

source: New methods have been added to :class:`list` and :class:`bytearray`: ``copy()`` and ``clear()`` (:issue:`10516`). Consequently, :class:`~collections.abc.MutableSequence` now also defines a :meth:`!clear` method (:issue:`11388`).
pt_pt: Foram adicionados novos métodos a :class:`list` e :class:`bytearray`: ``copy()`` e ``clear()`` (:issue:`10516`). Consequentemente, :class:`~collections.abc.MutableSequence` define agora também um método :meth:`!clear` (:issue:`11388`).

source: Raw bytes literals can now be written ``rb"..."`` as well as ``br"..."``.
pt_pt: Os literais de *bytes* crus podem agora ser escritos como ``rb"..."`` ou ``br"..."``.

source: (Contributed by Antoine Pitrou in :issue:`13748`.)
pt_pt: (Contribuído por Antoine Pitrou em :issue:`13748`.)

source: :meth:`dict.setdefault` now does only one lookup for the given key, making it atomic when used with built-in types.
pt_pt: :meth:`dict.setdefault` faz agora apenas uma pesquisa para a chave dada, tornando-o atómico quando usado com tipos integrados.

source: (Contributed by Filip Gruszczyński in :issue:`13521`.)
pt_pt: (Contribuído por Filip Gruszczyński em :issue:`13521`.)

source: The error messages produced when a function call does not match the function signature have been significantly improved.
pt_pt: As mensagens de erro produzidas quando uma chamada de função não corresponde à assinatura da função foram significativamente melhoradas.

source: (Contributed by Benjamin Peterson.)
pt_pt: (Contribuído por Benjamin Peterson.)

source: A Finer-Grained Import Lock
pt_pt: Uma Bloqueio de Importação Mais Granular

source: Previous versions of CPython have always relied on a global import lock. This led to unexpected annoyances, such as deadlocks when importing a module would trigger code execution in a different thread as a side-effect. Clumsy workarounds were sometimes employed, such as the :c:func:`PyImport_ImportModuleNoBlock` C API function.
pt_pt: Versões anteriores do CPython sempre dependeram de um bloqueio global de importação. Isto levou a aborrecimentos inesperados, como *deadlocks* quando a importação de um módulo desencadeava a execução de código noutro *thread* como efeito secundário. Às vezes eram usadas soluções desajeitadas, como a função da API C :c:func:`PyImport_ImportModuleNoBlock`.

source: In Python 3.3, importing a module takes a per-module lock. This correctly serializes importation of a given module from multiple threads (preventing the exposure of incompletely initialized modules), while eliminating the aforementioned annoyances.
pt_pt: Em Python 3.3, a importação de um módulo usa um bloqueio por módulo. Isto serializa corretamente a importação de um módulo a partir de vários *threads* (evitando a exposição de módulos incompletamente inicializados), ao mesmo tempo que elimina os aborrecimentos mencionados anteriormente.

source: (Contributed by Antoine Pitrou in :issue:`9260`.)
pt_pt: (Contribuído por Antoine Pitrou em :issue:`9260`.)

source: Builtin functions and types
pt_pt: Funções e Tipos Integrados

source: :func:`open` gets a new *opener* parameter: the underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). It can be used to use custom flags like :const:`os.O_CLOEXEC` for example. The ``'x'`` mode was added: open for exclusive creation, failing if the file already exists.
pt_pt: :func:`open` obtém um novo parâmetro *opener*: o descritor de ficheiro subjacente para o objeto de ficheiro é então obtido chamando *opener* com (*file*, *flags*). Pode ser usado para usar sinalizadores personalizados como :const:`os.O_CLOEXEC`, por exemplo. O modo ``'x'`` foi adicionado: abre para criação exclusiva, falhando se o ficheiro já existir.

source: :func:`print`: added the *flush* keyword argument. If the *flush* keyword argument is true, the stream is forcibly flushed.
pt_pt: :func:`print`: adicionado o argumento nomeado *flush*. Se o argumento nomeado *flush* for verdadeiro, o fluxo (*stream*) é forçado a ser descarregado.

source: :func:`hash`: hash randomization is enabled by default, see :meth:`object.__hash__` and :envvar:`PYTHONHASHSEED`.
pt_pt: :func:`hash`: a aleatorização de *hash* está ativada por predefinição; consulte :meth:`object.__hash__` e :envvar:`PYTHONHASHSEED`.

source: The :class:`str` type gets a new :meth:`~str.casefold` method: return a casefolded copy of the string, casefolded strings may be used for caseless matching. For example, ``'ß'.casefold()`` returns ``'ss'``.
pt_pt: O tipo :class:`str` recebe um novo método :meth:`~str.casefold`: devolve uma cópia *casefolded* da *string*; *strings* *casefolded* podem ser usadas para correspondência sem distinção de maiúsculas/minúsculas. Por exemplo, ``'ß'.casefold()`` devolve ``'ss'``.

source: The sequence documentation has been substantially rewritten to better explain the binary/text sequence distinction and to provide specific documentation sections for the individual builtin sequence types (:issue:`4966`).
pt_pt: A documentação das sequências foi substancialmente reescrita para explicar melhor a distinção entre sequências binárias e de texto, e para fornecer secções de documentação específicas para os tipos de sequências integradas individuais (:issue:`4966`).

source: New Modules
pt_pt: Novos Módulos

source: This new debug module :mod:`faulthandler` contains functions to dump Python tracebacks explicitly, on a fault (a crash like a segmentation fault), after a timeout, or on a user signal. Call :func:`faulthandler.enable` to install fault handlers for the :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS`, and :const:`~signal.SIGILL` signals. You can also enable them at startup by setting the :envvar:`PYTHONFAULTHANDLER` environment variable or by using :option:`-X` ``faulthandler`` command line option.
pt_pt: Este novo módulo de depuração :mod:`faulthandler` contém funções para descarregar *tracebacks* do Python explicitamente, em caso de falha (como uma falha de segmentação), após um *timeout*, ou em resposta a um sinal do utilizador. Chame :func:`faulthandler.enable` para instalar manipuladores de falhas para os sinais :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` e :const:`~signal.SIGILL`. Também pode ativá-los no arranque definindo a variável de ambiente :envvar:`PYTHONFAULTHANDLER` ou usando a opção de linha de comandos :option:`-X` ``faulthandler``.

source: Example of a segmentation fault on Linux:
pt_pt: Exemplo de uma falha de segmentação no Linux:

source: $ python -q -X faulthandler >>> import ctypes >>> ctypes.string_at(0) Fatal Python error: Segmentation fault Current thread 0x00007fb899f39700: File "/home/python/cpython/Lib/ctypes/__init__.py", line 486 in string_at File "<stdin>", line 1 in <module> Segmentation fault
pt_pt: $ python -q -X faulthandler >>> import ctypes >>> ctypes.string_at(0) Erro fatal do Python: Falha de segmentação Thread atual 0x00007fb899f39700: Ficheiro "/home/python/cpython/Lib/ctypes/__init__.py", linha 486 em string_at Ficheiro "<stdin>", linha 1 em <module> Falha de segmentação

source: The new :mod:`ipaddress` module provides tools for creating and manipulating objects representing IPv4 and IPv6 addresses, networks and interfaces (i.e. an IP address associated with a specific IP subnet).
pt_pt: O novo módulo :mod:`ipaddress` fornece ferramentas para criar e manipular objetos que representam endereços IPv4 e IPv6, redes e interfaces (ou seja, um endereço IP associado a uma sub-rede IP específica).

source: (Contributed by Google and Peter Moody in :pep:`3144`.)
pt_pt: (Contribuído pela Google e por Peter Moody em :pep:`3144`.)

source: The newly added :mod:`lzma` module provides data compression and decompression using the LZMA algorithm, including support for the ``.xz`` and ``.lzma`` file formats.
pt_pt: O módulo recentemente adicionado :mod:`lzma` fornece compressão e descompressão de dados usando o algoritmo LZMA, incluindo suporte para os formatos de ficheiro ``.xz`` e ``.lzma``.

source: (Contributed by Nadeem Vawda and Per Øyvind Karlsen in :issue:`6715`.)
pt_pt: (Contribuído por Nadeem Vawda e Per Øyvind Karlsen em :issue:`6715`.)

source: Improved Modules
pt_pt: Módulos Melhorados

source: Improved support for abstract base classes containing descriptors composed with abstract methods. The recommended approach to declaring abstract descriptors is now to provide :attr:`!__isabstractmethod__` as a dynamically updated property. The built-in descriptors have been updated accordingly.
pt_pt: Melhorado o suporte para classes base abstratas que contêm descritores compostos com métodos abstratos. A abordagem recomendada para declarar descritores abstratos é agora fornecer :attr:`!__isabstractmethod__` como uma propriedade atualizada dinamicamente. Os descritores integrados foram atualizados em conformidade.

source: :class:`abc.abstractproperty` has been deprecated, use :class:`property` with :func:`abc.abstractmethod` instead.
pt_pt: :class:`abc.abstractproperty` foi preterida; use :class:`property` com :func:`abc.abstractmethod` em vez disso.

source: :class:`abc.abstractclassmethod` has been deprecated, use :class:`classmethod` with :func:`abc.abstractmethod` instead.
pt_pt: :class:`abc.abstractclassmethod` foi preterida; use :class:`classmethod` com :func:`abc.abstractmethod` em vez disso.

source: :class:`abc.abstractstaticmethod` has been deprecated, use :class:`staticmethod` with :func:`abc.abstractmethod` instead.
pt_pt: :class:`abc.abstractstaticmethod` foi preterida; use :class:`staticmethod` com :func:`abc.abstractmethod` em vez disso.

source: (Contributed by Darren Dale in :issue:`11610`.)
pt_pt: (Contribuído por Darren Dale em :issue:`11610`.)

source: :meth:`abc.ABCMeta.register` now returns the registered subclass, which means it can now be used as a class decorator (:issue:`10868`).
pt_pt: :meth:`abc.ABCMeta.register` devolve agora a subclasse registada, o que significa que pode agora ser usada como um decorador de classe (:issue:`10868`).

source: The :mod:`array` module supports the :c:expr:`long long` type using ``q`` and ``Q`` type codes.
pt_pt: O módulo :mod:`array` suporta o tipo :c:expr:`long long` usando os códigos de tipo ``q`` e ``Q``.

source: (Contributed by Oren Tirosh and Hirokazu Yamamoto in :issue:`1172711`.)
pt_pt: (Contribuído por Oren Tirosh e Hirokazu Yamamoto em :issue:`1172711`.)

source: ASCII-only Unicode strings are now accepted by the decoding functions of the :mod:`base64` modern interface. For example, ``base64.b64decode('YWJj')`` returns ``b'abc'``. (Contributed by Catalin Iacob in :issue:`13641`.)
pt_pt: As *strings* Unicode apenas ASCII são agora aceites pelas funções de descodificação da interface moderna :mod:`base64`. Por exemplo, ``base64.b64decode('YWJj')`` devolve ``b'abc'``. (Contribuído por Catalin Iacob em :issue:`13641`.)

source: In addition to the binary objects they normally accept, the ``a2b_`` functions now all also accept ASCII-only strings as input. (Contributed by Antoine Pitrou in :issue:`13637`.)
pt_pt: Para além dos objetos binários que normalmente aceitam, as funções ``a2b_`` aceitam agora também *strings* apenas ASCII como entrada. (Contribuído por Antoine Pitrou em :issue:`13637`.)

source: The :mod:`bz2` module has been rewritten from scratch. In the process, several new features have been added:
pt_pt: O módulo :mod:`bz2` foi reescrito desde o início. Durante o processo, várias novas funcionalidades foram adicionadas:

source: New :func:`bz2.open` function: open a bzip2-compressed file in binary or text mode.
pt_pt: Nova função :func:`bz2.open`: abre um ficheiro comprimido com bzip2 em modo binário ou de texto.

source: :class:`bz2.BZ2File` can now read from and write to arbitrary file-like objects, by means of its constructor's *fileobj* argument.
pt_pt: :class:`bz2.BZ2File` pode agora ler e escrever para objetos semelhantes a ficheiros arbitrários, através do argumento *fileobj* do seu construtor.

source: (Contributed by Nadeem Vawda in :issue:`5863`.)
pt_pt: (Contribuído por Nadeem Vawda em :issue:`5863`.)

source: :class:`bz2.BZ2File` and :func:`bz2.decompress` can now decompress multi-stream inputs (such as those produced by the :program:`pbzip2` tool). :class:`bz2.BZ2File` can now also be used to create this type of file, using the ``'a'`` (append) mode.
pt_pt: :class:`bz2.BZ2File` e :func:`bz2.decompress` podem agora descomprimir entradas multi-*stream* (como as produzidas pela ferramenta :program:`pbzip2`). :class:`bz2.BZ2File` pode agora também ser usado para criar este tipo de ficheiro, usando o modo ``'a'`` (anexar).

source: (Contributed by Nir Aides in :issue:`1625`.)
pt_pt: (Contribuído por Nir Aides em :issue:`1625`.)

source: :class:`bz2.BZ2File` now implements all of the :class:`io.BufferedIOBase` API, except for the :meth:`!detach` and :meth:`!truncate` methods.
pt_pt: :class:`bz2.BZ2File` implementa agora toda a API de :class:`io.BufferedIOBase`, exceto os métodos :meth:`!detach` e :meth:`!truncate`.

source: The :mod:`~encodings.mbcs` codec has been rewritten to handle correctly ``replace`` and ``ignore`` error handlers on all Windows versions. The :mod:`~encodings.mbcs` codec now supports all error handlers, instead of only ``replace`` to encode and ``ignore`` to decode.
pt_pt: O *codec* :mod:`~encodings.mbcs` foi reescrito para lidar corretamente com os manipuladores de erro ``replace`` e ``ignore`` em todas as versões do Windows. O *codec* :mod:`~encodings.mbcs` suporta agora todos os manipuladores de erro, em vez de apenas ``replace`` para codificar e ``ignore`` para descodificar.

source: A new Windows-only codec has been added: ``cp65001`` (:issue:`13216`). It is the Windows code page 65001 (Windows UTF-8, ``CP_UTF8``). For example, it is used by ``sys.stdout`` if the console output code page is set to cp65001 (e.g., using ``chcp 65001`` command).
pt_pt: Foi adicionado um novo *codec* exclusivo para Windows: ``cp65001`` (:issue:`13216`). É a página de código 65001 do Windows (UTF-8 do Windows, ``CP_UTF8``). Por exemplo, é usado por ``sys.stdout`` se a página de código de saída da consola estiver definida para cp65001 (por exemplo, usando o comando ``chcp 65001``).

source: Multibyte CJK decoders now resynchronize faster. They only ignore the first byte of an invalid byte sequence. For example, ``b'\xff\n'.decode('gb2312', 'replace')`` now returns a ``\n`` after the replacement character.
pt_pt: Os descodificadores CJK multibyte sincronizam agora mais rapidamente. Ignoram apenas o primeiro *byte* de uma sequência de *bytes* inválida. Por exemplo, ``b'\xff\n'.decode('gb2312', 'replace')`` devolve agora um ``\n`` depois do carácter de substituição.

source: Incremental CJK codec encoders are no longer reset at each call to their encode() methods. For example::
pt_pt: Os codificadores incrementais de *codec* CJK já não são reiniciados em cada chamada aos seus métodos encode(). Por exemplo::

source: This example gives ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` with older Python versions.
pt_pt: Este exemplo devolve ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` em versões mais antigas do Python.

source: The ``unicode_internal`` codec has been deprecated.
pt_pt: O *codec* ``unicode_internal`` foi preterido.

source: Addition of a new :class:`~collections.ChainMap` class to allow treating a number of mappings as a single unit. (Written by Raymond Hettinger for :issue:`11089`, made public in :issue:`11297`.)
pt_pt: Adição de uma nova classe :class:`~collections.ChainMap` para permitir tratar vários mapeamentos como uma única unidade. (Escrito por Raymond Hettinger para :issue:`11089`, tornado público em :issue:`11297`.)

source: The abstract base classes have been moved in a new :mod:`collections.abc` module, to better differentiate between the abstract and the concrete collections classes. Aliases for ABCs are still present in the :mod:`collections` module to preserve existing imports. (:issue:`11085`)
pt_pt: As classes base abstratas foram movidas para um novo módulo :mod:`collections.abc`, para melhor diferenciar entre as classes abstratas e as classes concretas de coleções. Os *aliases* para as ABCs ainda estão presentes no módulo :mod:`collections` para preservar as importações existentes. (:issue:`11085`)

source: The :class:`~collections.Counter` class now supports the unary ``+`` and ``-`` operators, as well as the in-place operators ``+=``, ``-=``, ``|=``, and ``&=``. (Contributed by Raymond Hettinger in :issue:`13121`.)
pt_pt: A classe :class:`~collections.Counter` suporta agora os operadores unários ``+`` e ``-``, bem como os operadores *in-place* ``+=``, ``-=``, ``|=`` e ``&=``. (Contribuído por Raymond Hettinger em :issue:`13121`.)

source: :class:`~contextlib.ExitStack` now provides a solid foundation for programmatic manipulation of context managers and similar cleanup functionality. Unlike the previous ``contextlib.nested`` API (which was deprecated and removed), the new API is designed to work correctly regardless of whether context managers acquire their resources in their ``__init__`` method (for example, file objects) or in their ``__enter__`` method (for example, synchronisation objects from the :mod:`threading` module).
pt_pt: :class:`~contextlib.ExitStack` fornece agora uma base sólida para a manipulação programática de gestores de contexto e funcionalidades de limpeza semelhantes. Ao contrário da antiga API ``contextlib.nested`` (que foi preterida e removida), a nova API foi concebida para funcionar corretamente, independentemente de os gestores de contexto adquirirem os seus recursos no método ``__init__`` (por exemplo, objetos de ficheiro) ou no método ``__enter__`` (por exemplo, objetos de sincronização do módulo :mod:`threading`).

source: Addition of salt and modular crypt format (hashing method) and the :func:`!mksalt` function to the :mod:`!crypt` module.
pt_pt: Adição de *salt* e formato modular de *crypt* (método de *hashing*) e da função :func:`!mksalt` ao módulo :mod:`!crypt`.
