Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: What's New In Python 3.3
pt_pt: Novidades do Python 3.3

source: This article explains the new features in Python 3.3, compared to 3.2. Python 3.3 was released on September 29, 2012. For full details, see the `changelog <https://docs.python.org/3.3/whatsnew/changelog.html>`_.
pt_pt: Este artigo explica as novas funcionalidades do Python 3.3, em comparação com o 3.2. O Python 3.3 foi lançado a 29 de setembro de 2012. Para detalhes completos, consulte o `registo de alterações <https://docs.python.org/3.3/whatsnew/changelog.html>`_.

source: :pep:`398` - Python 3.3 Release Schedule
pt_pt: :pep:`398` - Calendário de Lançamento do Python 3.3

source: Summary -- Release highlights
pt_pt: Resumo — Destaques da versão

source: New syntax features:
pt_pt: Novas funcionalidades de sintaxe:

source: New ``yield from`` expression for :ref:`generator delegation <pep-380>`.
pt_pt: Nova expressão ``yield from`` para :ref:`delegação de geradores <pep-380>`.

source: The ``u'unicode'`` syntax is accepted again for :class:`str` objects.
pt_pt: A sintaxe ``u'unicode'`` é novamente aceite para objetos :class:`str`.

source: New library modules:
pt_pt: Novos módulos de biblioteca:

source: :mod:`faulthandler` (helps debugging low-level crashes)
pt_pt: :mod:`faulthandler` (ajuda na depuração de falhas de baixo nível)

source: :mod:`ipaddress` (high-level objects representing IP addresses and masks)
pt_pt: :mod:`ipaddress` (objetos de alto nível que representam endereços IP e máscaras)

source: :mod:`lzma` (compress data using the XZ / LZMA algorithm)
pt_pt: :mod:`lzma` (comprime dados utilizando o algoritmo XZ / LZMA)

source: :mod:`unittest.mock` (replace parts of your system under test with mock objects)
pt_pt: :mod:`unittest.mock` (substitui partes do seu sistema em teste por objetos mock)

source: :mod:`venv` (Python :ref:`virtual environments <pep-405>`, as in the popular ``virtualenv`` package)
pt_pt: :mod:`venv` (ambientes :ref:`virtuais <pep-405>` do Python, como no popular pacote ``virtualenv``)

source: New built-in features:
pt_pt: Novas funcionalidades integradas:

source: Reworked :ref:`I/O exception hierarchy <pep-3151>`.
pt_pt: Hierarquia de exceções de :ref:`I/O refeita <pep-3151>`.

source: Implementation improvements:
pt_pt: Melhorias de implementação:

source: Rewritten :ref:`import machinery <importlib>` based on :mod:`importlib`.
pt_pt: Maquinaria de :ref:`importação <importlib>` reescrita com base em :mod:`importlib`.

source: More compact :ref:`unicode strings <pep-393>`.
pt_pt: Strings :ref:`unicode mais compactas <pep-393>`.

source: More compact :ref:`attribute dictionaries <pep-412>`.
pt_pt: Dicionários de :ref:`atributos mais compactos <pep-412>`.

source: Significantly Improved Library Modules:
pt_pt: Módulos de biblioteca significativamente melhorados:

source: C Accelerator for the :ref:`decimal <new-decimal>` module.
pt_pt: Acelerador em C para o módulo :ref:`decimal <new-decimal>`.

source: Better unicode handling in the :ref:`email <new-email>` module (:term:`provisional <provisional package>`).
pt_pt: Melhor tratamento de unicode no módulo :ref:`email <new-email>` (:term:`provisional <provisional package>`).

source: Security improvements:
pt_pt: Melhorias de segurança:

source: Hash randomization is switched on by default.
pt_pt: A randomização de hash está ativada por predefinição.

source: Please read on for a comprehensive list of user-facing changes.
pt_pt: Leia em frente para uma lista abrangente de alterações visíveis para o utilizador.

source: PEP 405: Virtual Environments
pt_pt: PEP 405: Ambientes Virtuais

source: Virtual environments help create separate Python setups while sharing a system-wide base install, for ease of maintenance. Virtual environments have their own set of private site packages (i.e. locally installed libraries), and are optionally segregated from the system-wide site packages. Their concept and implementation are inspired by the popular ``virtualenv`` third-party package, but benefit from tighter integration with the interpreter core.
pt_pt: Os ambientes virtuais ajudam a criar configurações separadas do Python, partilhando uma instalação base em todo o sistema, para facilitar a manutenção. Os ambientes virtuais têm o seu próprio conjunto de pacotes de site privados (ou seja, bibliotecas instaladas localmente) e são opcionalmente segregados dos pacotes de site em todo o sistema. O seu conceito e implementação são inspirados no popular pacote de terceiros ``virtualenv``, mas beneficiam de uma integração mais estreita com o núcleo do interpretador.

source: This PEP adds the :mod:`venv` module for programmatic access, and the ``pyvenv`` script for command-line access and administration. The Python interpreter checks for a ``pyvenv.cfg``, file whose existence signals the base of a virtual environment's directory tree.
pt_pt: Esta PEP adiciona o módulo :mod:`venv` para acesso programático e o script ``pyvenv`` para acesso e administração na linha de comandos. O interpretador Python verifica a existência de um ficheiro ``pyvenv.cfg``, cuja presença sinaliza a base da árvore de diretórios de um ambiente virtual.

source: :pep:`405` - Python Virtual Environments
pt_pt: :pep:`405` - Ambientes Virtuais do Python

source: PEP written by Carl Meyer; implementation by Carl Meyer and Vinay Sajip
pt_pt: PEP escrito por Carl Meyer; implementação por Carl Meyer e Vinay Sajip

source: PEP 420: Implicit Namespace Packages
pt_pt: PEP 420: Pacotes de Espaço de Nomes Implícitos

source: Native support for package directories that don't require ``__init__.py`` marker files and can automatically span multiple path segments (inspired by various third party approaches to namespace packages, as described in :pep:`420`)
pt_pt: Suporte nativo para diretórios de pacotes que não requerem ficheiros marcadores ``__init__.py`` e podem abarcar automaticamente vários segmentos de caminho (inspirado em várias abordagens de terceiros para pacotes de espaço de nomes, como descrito em :pep:`420`)

source: :pep:`420` - Implicit Namespace Packages
pt_pt: :pep:`420` - Pacotes de Espaço de Nomes Implícitos

source: PEP written by Eric V. Smith; implementation by Eric V. Smith and Barry Warsaw
pt_pt: PEP escrito por Eric V. Smith; implementação por Eric V. Smith e Barry Warsaw

source: PEP 3118: New memoryview implementation and buffer protocol documentation
pt_pt: PEP 3118: Nova implementação de memoryview e documentação do protocolo de buffer

source: The implementation of :pep:`3118` has been significantly improved.
pt_pt: A implementação da :pep:`3118` foi significativamente melhorada.

source: The new memoryview implementation comprehensively fixes all ownership and lifetime issues of dynamically allocated fields in the Py_buffer struct that led to multiple crash reports. Additionally, several functions that crashed or returned incorrect results for non-contiguous or multi-dimensional input have been fixed.
pt_pt: A nova implementação de memoryview corrige de forma abrangente todos os problemas de propriedade e tempo de vida dos campos alocados dinamicamente na estrutura Py_buffer que levaram a vários relatórios de falhas. Além disso, várias funções que falhavam ou devolviam resultados incorretos para entradas não contíguas ou multidimensionais foram corrigidas.

source: The memoryview object now has a PEP-3118 compliant getbufferproc() that checks the consumer's request type. Many new features have been added, most of them work in full generality for non-contiguous arrays and arrays with suboffsets.
pt_pt: O objeto memoryview tem agora um getbufferproc() compatível com a PEP-3118 que verifica o tipo de pedido do consumidor. Muitas novas funcionalidades foram adicionadas, a maioria delas funciona em toda a sua generalidade para arrays não contíguos e arrays com subdeslocamentos.

source: The documentation has been updated, clearly spelling out responsibilities for both exporters and consumers. Buffer request flags are grouped into basic and compound flags. The memory layout of non-contiguous and multi-dimensional NumPy-style arrays is explained.
pt_pt: A documentação foi atualizada, esclarecendo claramente as responsabilidades tanto para exportadores como para consumidores. As flags de pedido de buffer são agrupadas em flags básicas e compostas. O layout de memória de arrays não contíguos e multidimensionais no estilo NumPy é explicado.

source: Features
pt_pt: Funcionalidades

source: All native single character format specifiers in struct module syntax (optionally prefixed with '@') are now supported.
pt_pt: Todos os especificadores de formato de carácter único nativos na sintaxe do módulo struct (opcionalmente prefixados com '@') são agora suportados.

source: With some restrictions, the cast() method allows changing of format and shape of C-contiguous arrays.
pt_pt: Com algumas restrições, o método cast() permite alterar o formato e a forma de arrays contíguos em C.

source: Multi-dimensional list representations are supported for any array type.
pt_pt: Representações de listas multidimensionais são suportadas para qualquer tipo de array.

source: Multi-dimensional comparisons are supported for any array type.
pt_pt: Comparações multidimensionais são suportadas para qualquer tipo de array.

source: One-dimensional memoryviews of hashable (read-only) types with formats B, b or c are now hashable. (Contributed by Antoine Pitrou in :issue:`13411`.)
pt_pt: Memoryviews unidimensionais de tipos hashable (apenas leitura) com formatos B, b ou c são agora hashable. (Contribuído por Antoine Pitrou em :issue:`13411`.)

source: Arbitrary slicing of any 1-D arrays type is supported. For example, it is now possible to reverse a memoryview in *O*\ (1) by using a negative step.
pt_pt: O fatiamento arbitrário de qualquer tipo de array 1-D é suportado. Por exemplo, é agora possível inverter uma memoryview em *O*(1) utilizando um passo negativo.

source: API changes
pt_pt: Alterações na API

source: The maximum number of dimensions is officially limited to 64.
pt_pt: O número máximo de dimensões é oficialmente limitado a 64.

source: The representation of empty shape, strides and suboffsets is now an empty tuple instead of ``None``.
pt_pt: A representação de formas, passos e subdeslocamentos vazios é agora um tuplo vazio em vez de ``None``.

source: Accessing a memoryview element with format 'B' (unsigned bytes) now returns an integer (in accordance with the struct module syntax). For returning a bytes object the view must be cast to 'c' first.
pt_pt: O acesso a um elemento de memoryview com formato 'B' (bytes sem sinal) devolve agora um inteiro (de acordo com a sintaxe do módulo struct). Para devolver um objeto bytes, a vista deve ser convertida para 'c' em primeiro lugar.

source: memoryview comparisons now use the logical structure of the operands and compare all array elements by value. All format strings in struct module syntax are supported. Views with unrecognised format strings are still permitted, but will always compare as unequal, regardless of view contents.
pt_pt: As comparações de memoryview utilizam agora a estrutura lógica dos operandos e comparam todos os elementos do array por valor. Todas as strings de formato na sintaxe do módulo struct são suportadas. Vistas com strings de formato não reconhecidas ainda são permitidas, mas serão sempre comparadas como desiguais, independentemente do conteúdo da vista.

source: For further changes see `Build and C API Changes`_ and `Porting C code`_.
pt_pt: Para mais alterações, consulte `Alterações na Compilação e na API C`_ e `Portabilidade de Código C`_.

source: (Contributed by Stefan Krah in :issue:`10181`.)
pt_pt: (Contribuído por Stefan Krah em :issue:`10181`.)

source: :pep:`3118` - Revising the Buffer Protocol
pt_pt: :pep:`3118` - Revisão do Protocolo de Buffer

source: PEP 393: Flexible String Representation
pt_pt: PEP 393: Representação Flexível de Strings

source: The Unicode string type is changed to support multiple internal representations, depending on the character with the largest Unicode ordinal (1, 2, or 4 bytes) in the represented string. This allows a space-efficient representation in common cases, but gives access to full UCS-4 on all systems. For compatibility with existing APIs, several representations may exist in parallel; over time, this compatibility should be phased out.
pt_pt: O tipo de string Unicode foi alterado para suportar várias representações internas, dependendo do caractere com a maior ordenação Unicode (1, 2 ou 4 bytes) na string representada. Isto permite uma representação eficiente em termos de espaço nos casos comuns, mas dá acesso ao UCS-4 completo em todos os sistemas. Para compatibilidade com APIs existentes, várias representações podem existir em paralelo; com o tempo, esta compatibilidade deve ser eliminada gradualmente.

source: On the Python side, there should be no downside to this change.
pt_pt: Do lado do Python, não deve haver desvantagens com esta alteração.

source: On the C API side, :pep:`393` is fully backward compatible. The legacy API should remain available at least five years. Applications using the legacy API will not fully benefit of the memory reduction, or - worse - may use a bit more memory, because Python may have to maintain two versions of each string (in the legacy format and in the new efficient storage).
pt_pt: Do lado da API C, a :pep:`393` é totalmente retrocompatível. A API antiga deve permanecer disponível pelo menos cinco anos. As aplicações que utilizam a API antiga não beneficiarão totalmente da redução de memória, ou — pior — podem utilizar um pouco mais de memória, porque o Python pode ter de manter duas versões de cada string (no formato antigo e no novo armazenamento eficiente).

source: Functionality
pt_pt: Funcionalidade

source: Changes introduced by :pep:`393` are the following:
pt_pt: As alterações introduzidas pela :pep:`393` são as seguintes:

source: Python now always supports the full range of Unicode code points, including non-BMP ones (i.e. from ``U+0000`` to ``U+10FFFF``). The distinction between narrow and wide builds no longer exists and Python now behaves like a wide build, even under Windows.
pt_pt: O Python suporta agora sempre toda a gama de pontos de código Unicode, incluindo os não-BMP (ou seja, de ``U+0000`` a ``U+10FFFF``). A distinção entre compilações estreitas e largas já não existe e o Python comporta-se agora como uma compilação larga, mesmo no Windows.

source: With the death of narrow builds, the problems specific to narrow builds have also been fixed, for example:
pt_pt: Com o fim das compilações estreitas, os problemas específicos das compilações estreitas também foram corrigidos, por exemplo:

source: :func:`len` now always returns 1 for non-BMP characters, so ``len('\U0010FFFF') == 1``;
pt_pt: :func:`len` devolve agora sempre 1 para caracteres não-BMP, pelo que ``len('\U0010FFFF') == 1``;

source: surrogate pairs are not recombined in string literals, so ``'\uDBFF\uDFFF' != '\U0010FFFF'``;
pt_pt: pares substitutos não são recombinados em literais de string, pelo que ``'\uDBFF\uDFFF' != '\U0010FFFF'``;

source: indexing or slicing non-BMP characters returns the expected value, so ``'\U0010FFFF'[0]`` now returns ``'\U0010FFFF'`` and not ``'\uDBFF'``;
pt_pt: a indexação ou fatiamento de caracteres não-BMP devolve o valor esperado, pelo que ``'\U0010FFFF'[0]`` devolve agora ``'\U0010FFFF'`` e não ``'\uDBFF'``;

source: all other functions in the standard library now correctly handle non-BMP code points.
pt_pt: todas as outras funções na biblioteca padrão tratam agora corretamente pontos de código não-BMP.

source: The value of :data:`sys.maxunicode` is now always ``1114111`` (``0x10FFFF`` in hexadecimal). The :c:func:`!PyUnicode_GetMax` function still returns either ``0xFFFF`` or ``0x10FFFF`` for backward compatibility, and it should not be used with the new Unicode API (see :issue:`13054`).
pt_pt: O valor de :data:`sys.maxunicode` é agora sempre ``1114111`` (``0x10FFFF`` em hexadecimal). A função :c:func:`!PyUnicode_GetMax` ainda devolve ``0xFFFF`` ou ``0x10FFFF`` para compatibilidade retroativa, e não deve ser utilizada com a nova API Unicode (consulte :issue:`13054`).

source: The :file:`./configure` flag ``--with-wide-unicode`` has been removed.
pt_pt: A flag :file:`./configure` ``--with-wide-unicode`` foi removida.

source: Performance and resource usage
pt_pt: Desempenho e utilização de recursos

source: The storage of Unicode strings now depends on the highest code point in the string:
pt_pt: O armazenamento de strings Unicode depende agora do ponto de código mais alto na string:

source: pure ASCII and Latin1 strings (``U+0000-U+00FF``) use 1 byte per code point;
pt_pt: strings puras ASCII e Latin1 (``U+0000-U+00FF``) utilizam 1 byte por ponto de código;

source: BMP strings (``U+0000-U+FFFF``) use 2 bytes per code point;
pt_pt: Strings BMP (``U+0000-U+FFFF``) utilizam 2 bytes por ponto de código;

source: non-BMP strings (``U+10000-U+10FFFF``) use 4 bytes per code point.
pt_pt: Strings não-BMP (``U+10000-U+10FFFF``) utilizam 4 bytes por ponto de código.

source: The net effect is that for most applications, memory usage of string storage should decrease significantly - especially compared to former wide unicode builds - as, in many cases, strings will be pure ASCII even in international contexts (because many strings store non-human language data, such as XML fragments, HTTP headers, JSON-encoded data, etc.). We also hope that it will, for the same reasons, increase CPU cache efficiency on non-trivial applications. The memory usage of Python 3.3 is two to three times smaller than Python 3.2, and a little bit better than Python 2.7, on a Django benchmark (see the PEP for details).
pt_pt: O efeito líquido é que, para a maioria das aplicações, a utilização de memória para armazenamento de strings deve diminuir significativamente — especialmente em comparação com as antigas compilações unicode largas — uma vez que, em muitos casos, as strings serão ASCII puras mesmo em contextos internacionais (porque muitas strings armazenam dados não linguísticos, como fragmentos XML, cabeçalhos HTTP, dados codificados em JSON, etc.). Esperamos também que, pelas mesmas razões, a eficiência da cache da CPU aumente em aplicações não triviais. A utilização de memória do Python 3.3 é duas a três vezes menor do que o Python 3.2, e um pouco melhor do que o Python 2.7, num benchmark do Django (consulte a PEP para detalhes).

source: :pep:`393` - Flexible String Representation
pt_pt: :pep:`393` - Representação Flexível de Strings

source: PEP written by Martin von Löwis; implementation by Torsten Becker and Martin von Löwis.
pt_pt: PEP escrito por Martin von Löwis; implementação por Torsten Becker e Martin von Löwis.

source: PEP 397: Python Launcher for Windows
pt_pt: PEP 397: Lançador do Python para Windows

source: The Python 3.3 Windows installer now includes a ``py`` launcher application that can be used to launch Python applications in a version independent fashion.
pt_pt: O instalador do Python 3.3 para Windows inclui agora uma aplicação lançadora ``py`` que pode ser utilizada para lançar aplicações Python de forma independente da versão.

source: This launcher is invoked implicitly when double-clicking ``*.py`` files. If only a single Python version is installed on the system, that version will be used to run the file. If multiple versions are installed, the most recent version is used by default, but this can be overridden by including a Unix-style "shebang line" in the Python script.
pt_pt: Este lançador é invocado implicitamente ao fazer duplo clique em ficheiros ``*.py``. Se apenas uma versão do Python estiver instalada no sistema, essa versão será utilizada para executar o ficheiro. Se várias versões estiverem instaladas, a versão mais recente é utilizada por predefinição, mas isto pode ser substituído incluindo uma linha "shebang" no estilo Unix no script Python.

source: The launcher can also be used explicitly from the command line as the ``py`` application. Running ``py`` follows the same version selection rules as implicitly launching scripts, but a more specific version can be selected by passing appropriate arguments (such as ``-3`` to request Python 3 when Python 2 is also installed, or ``-2.6`` to specifically request an earlier Python version when a more recent version is installed).
pt_pt: O lançador também pode ser utilizado explicitamente a partir da linha de comandos como a aplicação ``py``. A execução de ``py`` segue as mesmas regras de seleção de versão que o lançamento implícito de scripts, mas uma versão mais específica pode ser selecionada passando argumentos apropriados (como ``-3`` para solicitar o Python 3 quando o Python 2 também está instalado, ou ``-2.6`` para solicitar especificamente uma versão anterior do Python quando uma versão mais recente está instalada).

source: In addition to the launcher, the Windows installer now includes an option to add the newly installed Python to the system PATH. (Contributed by Brian Curtin in :issue:`3561`.)
pt_pt: Para além do lançador, o instalador do Windows inclui agora uma opção para adicionar o Python recém-instalado ao PATH do sistema. (Contribuído por Brian Curtin em :issue:`3561`.)

source: :pep:`397` - Python Launcher for Windows
pt_pt: :pep:`397` - Lançador do Python para Windows

source: PEP written by Mark Hammond and Martin v. Löwis; implementation by Vinay Sajip.
pt_pt: PEP escrito por Mark Hammond e Martin v. Löwis; implementação por Vinay Sajip.

source: Launcher documentation: :ref:`launcher`
pt_pt: Documentação do lançador: :ref:`launcher`

source: Installer PATH modification: :ref:`windows-path-mod`
pt_pt: Modificação do PATH do instalador: :ref:`windows-path-mod`

source: PEP 3151: Reworking the OS and IO exception hierarchy
pt_pt: PEP 3151: Reestruturação da hierarquia de exceções de OS e IO

source: The hierarchy of exceptions raised by operating system errors is now both simplified and finer-grained.
pt_pt: A hierarquia de exceções levantadas por erros do sistema operativo é agora mais simples e mais detalhada.

source: You don't have to worry anymore about choosing the appropriate exception type between :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`!mmap.error`, :exc:`socket.error` or :exc:`select.error`. All these exception types are now only one: :exc:`OSError`. The other names are kept as aliases for compatibility reasons.
pt_pt: Já não precisa de se preocupar em escolher o tipo de exceção apropriado entre :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`!mmap.error`, :exc:`socket.error` ou :exc:`select.error`. Todos estes tipos de exceção são agora apenas um: :exc:`OSError`. Os outros nomes são mantidos como alias por razões de compatibilidade.

source: Also, it is now easier to catch a specific error condition. Instead of inspecting the ``errno`` attribute (or ``args[0]``) for a particular constant from the :mod:`errno` module, you can catch the adequate :exc:`OSError` subclass. The available subclasses are the following:
pt_pt: Além disso, é agora mais fácil capturar uma condição de erro específica. Em vez de inspecionar o atributo ``errno`` (ou ``args[0]``) para uma constante específica do módulo :mod:`errno`, pode capturar a subclasse adequada de :exc:`OSError`. As subclasses disponíveis são as seguintes:

source: And the :exc:`ConnectionError` itself has finer-grained subclasses:
pt_pt: E a própria :exc:`ConnectionError` tem subclasses mais detalhadas:
