Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: Thanks to the new exceptions, common usages of the :mod:`errno` can now be avoided. For example, the following code written for Python 3.2::
pt_pt: Graças às novas exceções, os usos comuns do :mod:`errno` podem agora ser evitados. Por exemplo, o seguinte código escrito para o Python 3.2::

source: from errno import ENOENT, EACCES, EPERM try: with open("document.txt") as f: content = f.read() except IOError as err: if err.errno == ENOENT: print("document.txt file is missing") elif err.errno in (EACCES, EPERM): print("You are not allowed to read document.txt") else: raise
pt_pt: from errno import ENOENT, EACCES, EPERM try: with open("document.txt") as f: content = f.read() except IOError as err: if err.errno == ENOENT: print("o ficheiro document.txt está em falta") elif err.errno in (EACCES, EPERM): print("não tem permissão para ler document.txt") else: raise

source: can now be written without the :mod:`errno` import and without manual inspection of exception attributes::
pt_pt: pode agora ser escrito sem a importação de :mod:`errno` e sem inspeção manual dos atributos da exceção::

source: try: with open("document.txt") as f: content = f.read() except FileNotFoundError: print("document.txt file is missing") except PermissionError: print("You are not allowed to read document.txt")
pt_pt: try: with open("document.txt") as f: content = f.read() except FileNotFoundError: print("o ficheiro document.txt está em falta") except PermissionError: print("não tem permissão para ler document.txt")

source: :pep:`3151` - Reworking the OS and IO Exception Hierarchy
pt_pt: :pep:`3151` - Reestruturação da Hierarquia de Exceções de OS e IO

source: PEP written and implemented by Antoine Pitrou
pt_pt: PEP escrito e implementado por Antoine Pitrou

source: PEP 380: Syntax for Delegating to a Subgenerator
pt_pt: PEP 380: Sintaxe para Delegação a um Subgerador

source: PEP 380 adds the ``yield from`` expression, allowing a :term:`generator` to delegate part of its operations to another generator. This allows a section of code containing :keyword:`yield` to be factored out and placed in another generator. Additionally, the subgenerator is allowed to return with a value, and the value is made available to the delegating generator.
pt_pt: A PEP 380 adiciona a expressão ``yield from``, permitindo que um :term:`gerador` delegue parte das suas operações a outro gerador. Isto permite que uma secção de código que contém :keyword:`yield` seja fatorizada e colocada noutro gerador. Além disso, é permitido ao subgerador devolver um valor, e esse valor é disponibilizado ao gerador delegante.

source: While designed primarily for use in delegating to a subgenerator, the ``yield from`` expression actually allows delegation to arbitrary subiterators.
pt_pt: Embora concebida principalmente para uso na delegação a um subgerador, a expressão ``yield from`` permite na verdade a delegação a subiteradores arbitrários.

source: For simple iterators, ``yield from iterable`` is essentially just a shortened form of ``for item in iterable: yield item``::
pt_pt: Para iteradores simples, ``yield from iterable`` é essencialmente apenas uma forma abreviada de ``for item in iterable: yield item``::

source: However, unlike an ordinary loop, ``yield from`` allows subgenerators to receive sent and thrown values directly from the calling scope, and return a final value to the outer generator::
pt_pt: No entanto, ao contrário de um ciclo normal, ``yield from`` permite que os subgeradores recebam valores enviados e lançados diretamente do âmbito de chamada e devolvam um valor final ao gerador externo::

source: >>> def accumulate(): ... tally = 0 ... while 1: ... next = yield ... if next is None: ... return tally ... tally += next ... >>> def gather_tallies(tallies): ... while 1: ... tally = yield from accumulate() ... tallies.append(tally) ... >>> tallies = [] >>> acc = gather_tallies(tallies) >>> next(acc) # Ensure the accumulator is ready to accept values >>> for i in range(4): ... acc.send(i) ... >>> acc.send(None) # Finish the first tally >>> for i in range(5): ... acc.send(i) ... >>> acc.send(None) # Finish the second tally >>> tallies [6, 10]
pt_pt: >>> def accumulate(): ... tally = 0 ... while 1: ... next = yield ... if next is None: ... return tally ... tally += next ... >>> def gather_tallies(tallies): ... while 1: ... tally = yield from accumulate() ... tallies.append(tally) ... >>> tallies = [] >>> acc = gather_tallies(tallies) >>> next(acc) # Garantir que o acumulador está pronto para aceitar valores >>> for i in range(4): ... acc.send(i) ... >>> acc.send(None) # Terminar a primeira contagem >>> for i in range(5): ... acc.send(i) ... >>> acc.send(None) # Terminar a segunda contagem >>> tallies [6, 10]

source: The main principle driving this change is to allow even generators that are designed to be used with the ``send`` and ``throw`` methods to be split into multiple subgenerators as easily as a single large function can be split into multiple subfunctions.
pt_pt: O principal princípio por trás desta alteração é permitir que até geradores concebidos para serem utilizados com os métodos ``send`` e ``throw`` possam ser divididos em vários subgeradores tão facilmente quanto uma única função grande pode ser dividida em várias subfunções.

source: :pep:`380` - Syntax for Delegating to a Subgenerator
pt_pt: :pep:`380` - Sintaxe para Delegação a um Subgerador

source: PEP written by Greg Ewing; implementation by Greg Ewing, integrated into 3.3 by Renaud Blanch, Ryan Kelly and Nick Coghlan; documentation by Zbigniew Jędrzejewski-Szmek and Nick Coghlan
pt_pt: PEP escrito por Greg Ewing; implementação por Greg Ewing, integrado no 3.3 por Renaud Blanch, Ryan Kelly e Nick Coghlan; documentação por Zbigniew Jędrzejewski-Szmek e Nick Coghlan

source: PEP 409: Suppressing exception context
pt_pt: PEP 409: Supressão do contexto de exceção

source: PEP 409 introduces new syntax that allows the display of the chained exception context to be disabled. This allows cleaner error messages in applications that convert between exception types::
pt_pt: A PEP 409 introduz uma nova sintaxe que permite desativar a exibição do contexto de exceção encadeada. Isto permite mensagens de erro mais limpas em aplicações que convertem entre tipos de exceção::

source: Without the ``from None`` suffix to suppress the cause, the original exception would be displayed by default::
pt_pt: Sem o sufixo ``from None`` para suprimir a causa, a exceção original seria exibida por predefinição::

source: >>> class C: ... def __init__(self, extra): ... self._extra_attributes = extra ... def __getattr__(self, attr): ... try: ... return self._extra_attributes[attr] ... except KeyError: ... raise AttributeError(attr) ... >>> C({}).x Traceback (most recent call last): File "<stdin>", line 6, in __getattr__ KeyError: 'x' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 8, in __getattr__ AttributeError: x
pt_pt: >>> class C: ... def __init__(self, extra): ... self._extra_attributes = extra ... def __getattr__(self, attr): ... try: ... return self._extra_attributes[attr] ... except KeyError: ... raise AttributeError(attr) ... >>> C({}).x Traceback (most recent call last): File "<stdin>", line 6, in __getattr__ KeyError: 'x' Durante o tratamento da exceção acima, ocorreu outra exceção: Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 8, in __getattr__ AttributeError: x

source: No debugging capability is lost, as the original exception context remains available if needed (for example, if an intervening library has incorrectly suppressed valuable underlying details)::
pt_pt: Nenhuma capacidade de depuração é perdida, uma vez que o contexto da exceção original permanece disponível se necessário (por exemplo, se uma biblioteca interveniente suprimiu incorretamente detalhes subjacentes valiosos)::

source: :pep:`409` - Suppressing exception context
pt_pt: :pep:`409` - Supressão do contexto de exceção

source: PEP written by Ethan Furman; implemented by Ethan Furman and Nick Coghlan.
pt_pt: PEP escrito por Ethan Furman; implementado por Ethan Furman e Nick Coghlan.

source: PEP 414: Explicit Unicode literals
pt_pt: PEP 414: Literais Unicode Explícitos

source: To ease the transition from Python 2 for Unicode aware Python applications that make heavy use of Unicode literals, Python 3.3 once again supports the "``u``" prefix for string literals. This prefix has no semantic significance in Python 3, it is provided solely to reduce the number of purely mechanical changes in migrating to Python 3, making it easier for developers to focus on the more significant semantic changes (such as the stricter default separation of binary and text data).
pt_pt: Para facilitar a transição do Python 2 para aplicações Python conscientes de Unicode que façam uso intensivo de literais Unicode, o Python 3.3 volta a suportar o prefixo "``u``" para literais de string. Este prefixo não tem significado semântico no Python 3, é fornecido apenas para reduzir o número de alterações puramente mecânicas na migração para o Python 3, tornando mais fácil para os desenvolvedores focarem-se nas alterações semânticas mais significativas (como a separação mais estrita entre dados binários e de texto por predefinição).

source: :pep:`414` - Explicit Unicode literals
pt_pt: :pep:`414` - Literais Unicode Explícitos

source: PEP written by Armin Ronacher.
pt_pt: PEP escrito por Armin Ronacher.

source: PEP 3155: Qualified name for classes and functions
pt_pt: PEP 3155: Nome Qualificado para Classes e Funções

source: Functions and class objects have a new :attr:`~definition.__qualname__` attribute representing the "path" from the module top-level to their definition. For global functions and classes, this is the same as :attr:`~definition.__name__`. For other functions and classes, it provides better information about where they were actually defined, and how they might be accessible from the global scope.
pt_pt: As funções e objetos de classe têm um novo atributo :attr:`~definition.__qualname__` que representa o "caminho" desde o nível superior do módulo até à sua definição. Para funções e classes globais, isto é o mesmo que :attr:`~definition.__name__`. Para outras funções e classes, fornece melhor informação sobre onde foram realmente definidas e como podem ser acedidas a partir do âmbito global.

source: Example with (non-bound) methods::
pt_pt: Exemplo com métodos (não ligados)::

source: Example with nested classes::
pt_pt: Exemplo com classes aninhadas::

source: Example with nested functions::
pt_pt: Exemplo com funções aninhadas::

source: The string representation of those objects is also changed to include the new, more precise information::
pt_pt: A representação de string desses objetos também foi alterada para incluir a nova informação mais precisa::

source: :pep:`3155` - Qualified name for classes and functions
pt_pt: :pep:`3155` - Nome Qualificado para Classes e Funções

source: PEP written and implemented by Antoine Pitrou.
pt_pt: PEP escrito e implementado por Antoine Pitrou.

source: PEP 412: Key-Sharing Dictionary
pt_pt: PEP 412: Dicionário com Partilha de Chaves

source: Dictionaries used for the storage of objects' attributes are now able to share part of their internal storage between each other (namely, the part which stores the keys and their respective hashes). This reduces the memory consumption of programs creating many instances of non-builtin types.
pt_pt: Os dicionários utilizados para o armazenamento de atributos de objetos são agora capazes de partilhar parte do seu armazenamento interno entre si (nomeadamente, a parte que armazena as chaves e os seus respetivos hashes). Isto reduz o consumo de memória de programas que criam muitas instâncias de tipos não integrados.

source: :pep:`412` - Key-Sharing Dictionary
pt_pt: :pep:`412` - Dicionário com Partilha de Chaves

source: PEP written and implemented by Mark Shannon.
pt_pt: PEP escrito e implementado por Mark Shannon.

source: PEP 362: Function Signature Object
pt_pt: PEP 362: Objeto de Assinatura de Função

source: A new function :func:`inspect.signature` makes introspection of python callables easy and straightforward. A broad range of callables is supported: python functions, decorated or not, classes, and :func:`functools.partial` objects. New classes :class:`inspect.Signature`, :class:`inspect.Parameter` and :class:`inspect.BoundArguments` hold information about the call signatures, such as, annotations, default values, parameters kinds, and bound arguments, which considerably simplifies writing decorators and any code that validates or amends calling signatures or arguments.
pt_pt: Uma nova função :func:`inspect.signature` torna a introspeção de objetos chamáveis do Python fácil e direta. Uma ampla gama de objetos chamáveis é suportada: funções Python, decoradas ou não, classes e objetos :func:`functools.partial`. Novas classes :class:`inspect.Signature`, :class:`inspect.Parameter` e :class:`inspect.BoundArguments` contêm informações sobre as assinaturas de chamada, como anotações, valores predefinidos, tipos de parâmetros e argumentos ligados, o que simplifica consideravelmente a escrita de decoradores e qualquer código que valide ou modifique assinaturas de chamada ou argumentos.

source: :pep:`362`: - Function Signature Object
pt_pt: :pep:`362`: - Objeto de Assinatura de Função

source: PEP written by Brett Cannon, Yury Selivanov, Larry Hastings, Jiwon Seo; implemented by Yury Selivanov.
pt_pt: PEP escrito por Brett Cannon, Yury Selivanov, Larry Hastings, Jiwon Seo; implementado por Yury Selivanov.

source: PEP 421: Adding sys.implementation
pt_pt: PEP 421: Adição de sys.implementation

source: A new attribute on the :mod:`sys` module exposes details specific to the implementation of the currently running interpreter. The initial set of attributes on :data:`sys.implementation` are ``name``, ``version``, ``hexversion``, and ``cache_tag``.
pt_pt: Um novo atributo no módulo :mod:`sys` expõe detalhes específicos da implementação do interpretador atualmente em execução. O conjunto inicial de atributos em :data:`sys.implementation` são ``name``, ``version``, ``hexversion`` e ``cache_tag``.

source: The intention of ``sys.implementation`` is to consolidate into one namespace the implementation-specific data used by the standard library. This allows different Python implementations to share a single standard library code base much more easily. In its initial state, ``sys.implementation`` holds only a small portion of the implementation-specific data. Over time that ratio will shift in order to make the standard library more portable.
pt_pt: A intenção de ``sys.implementation`` é consolidar num único espaço de nomes os dados específicos da implementação utilizados pela biblioteca padrão. Isto permite que diferentes implementações do Python partilhem uma única base de código da biblioteca padrão de forma muito mais fácil. No seu estado inicial, ``sys.implementation`` contém apenas uma pequena parte dos dados específicos da implementação. Com o tempo, essa proporção mudará para tornar a biblioteca padrão mais portátil.

source: One example of improved standard library portability is ``cache_tag``. As of Python 3.3, ``sys.implementation.cache_tag`` is used by :mod:`importlib` to support :pep:`3147` compliance. Any Python implementation that uses ``importlib`` for its built-in import system may use ``cache_tag`` to control the caching behavior for modules.
pt_pt: Um exemplo de portabilidade melhorada da biblioteca padrão é ``cache_tag``. A partir do Python 3.3, ``sys.implementation.cache_tag`` é utilizado por :mod:`importlib` para suportar a conformidade com a :pep:`3147`. Qualquer implementação do Python que utilize ``importlib`` para o seu sistema de importação integrado pode utilizar ``cache_tag`` para controlar o comportamento de cache para módulos.

source: The implementation of ``sys.implementation`` also introduces a new type to Python: :class:`types.SimpleNamespace`. In contrast to a mapping-based namespace, like :class:`dict`, ``SimpleNamespace`` is attribute-based, like :class:`object`. However, unlike ``object``, ``SimpleNamespace`` instances are writable. This means that you can add, remove, and modify the namespace through normal attribute access.
pt_pt: A implementação de ``sys.implementation`` também introduz um novo tipo no Python: :class:`types.SimpleNamespace`. Ao contrário de um *namespace* baseado em mapeamento, como :class:`dict`, o ``SimpleNamespace`` é baseado em atributos, como :class:`object`. No entanto, ao contrário do ``object``, as instâncias de ``SimpleNamespace`` são editáveis. Isto significa que pode adicionar, remover e modificar o *namespace* através do acesso normal a atributos.

source: :pep:`421` - Adding sys.implementation
pt_pt: :pep:`421` - Adição de sys.implementation

source: PEP written and implemented by Eric Snow.
pt_pt: PEP escrita e implementada por Eric Snow.

source: Using importlib as the Implementation of Import
pt_pt: Utilização de importlib como Implementação de Importação

source: :issue:`2377` - Replace __import__ w/ importlib.__import__ :issue:`13959` - Re-implement parts of :mod:`!imp` in pure Python :issue:`14605` - Make import machinery explicit :issue:`14646` - Require loaders set __loader__ and __package__
pt_pt: :issue:`2377` - Substituir __import__ por importlib.__import__; :issue:`13959` - Reimplementar partes de :mod:`!imp` em Python puro; :issue:`14605` - Tornar explícita a maquinaria de importação; :issue:`14646` - Exigir que os carregadores definam __loader__ e __package__

source: The :func:`__import__` function is now powered by :func:`importlib.__import__`. This work leads to the completion of "phase 2" of :pep:`302`. There are multiple benefits to this change. First, it has allowed for more of the machinery powering import to be exposed instead of being implicit and hidden within the C code. It also provides a single implementation for all Python VMs supporting Python 3.3 to use, helping to end any VM-specific deviations in import semantics. And finally it eases the maintenance of import, allowing for future growth to occur.
pt_pt: A função :func:`__import__` é agora alimentada por :func:`importlib.__import__`. Este trabalho leva à conclusão da "fase 2" da :pep:`302`. Existem várias vantagens nesta alteração. Primeiro, permite que mais da maquinaria de importação seja exposta em vez de estar implícita e escondida no código C. Também fornece uma implementação única para todas as VMs Python que suportam Python 3.3, ajudando a eliminar quaisquer desvios específicos da VM na semântica de importação. Finalmente, facilita a manutenção da importação, permitindo o crescimento futuro.

source: For the common user, there should be no visible change in semantics. For those whose code currently manipulates import or calls import programmatically, the code changes that might possibly be required are covered in the `Porting Python code`_ section of this document.
pt_pt: Para o utilizador comum, não deve haver alterações visíveis na semântica. Para aqueles cujo código manipula atualmente a importação ou chama a importação programaticamente, as alterações de código que possam ser necessárias estão cobertas na secção `Porting Python code`_ deste documento.

source: New APIs
pt_pt: Novas APIs

source: One of the large benefits of this work is the exposure of what goes into making the import statement work. That means the various importers that were once implicit are now fully exposed as part of the :mod:`importlib` package.
pt_pt: Uma das grandes vantagens deste trabalho é a exposição do que é necessário para que a instrução de importação funcione. Isto significa que os vários importadores que antes eram implícitos estão agora totalmente expostos como parte do pacote :mod:`importlib`.

source: The abstract base classes defined in :mod:`importlib.abc` have been expanded to properly delineate between :term:`meta path finders <meta path finder>` and :term:`path entry finders <path entry finder>` by introducing :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder`, respectively. The old ABC of :class:`!importlib.abc.Finder` is now only provided for backwards-compatibility and does not enforce any method requirements.
pt_pt: As classes base abstratas definidas em :mod:`importlib.abc` foram expandidas para distinguir corretamente entre :term:`meta path finders <meta path finder>` e :term:`path entry finders <path entry finder>`, introduzindo :class:`importlib.abc.MetaPathFinder` e :class:`importlib.abc.PathEntryFinder`, respetivamente. A antiga ABC :class:`!importlib.abc.Finder` é agora fornecida apenas para retrocompatibilidade e não impõe quaisquer requisitos de método.

source: In terms of finders, :class:`importlib.machinery.FileFinder` exposes the mechanism used to search for source and bytecode files of a module. Previously this class was an implicit member of :data:`sys.path_hooks`.
pt_pt: Em termos de *finders*, :class:`importlib.machinery.FileFinder` expõe o mecanismo usado para procurar ficheiros de código-fonte e *bytecode* de um módulo. Anteriormente, esta classe era um membro implícito de :data:`sys.path_hooks`.

source: For loaders, the new abstract base class :class:`importlib.abc.FileLoader` helps write a loader that uses the file system as the storage mechanism for a module's code. The loader for source files (:class:`importlib.machinery.SourceFileLoader`), sourceless bytecode files (:class:`importlib.machinery.SourcelessFileLoader`), and extension modules (:class:`importlib.machinery.ExtensionFileLoader`) are now available for direct use.
pt_pt: Para *loaders*, a nova classe base abstrata :class:`importlib.abc.FileLoader` ajuda a escrever um *loader* que usa o sistema de ficheiros como mecanismo de armazenamento para o código de um módulo. Os *loaders* para ficheiros de código-fonte (:class:`importlib.machinery.SourceFileLoader`), ficheiros de *bytecode* sem código-fonte (:class:`importlib.machinery.SourcelessFileLoader`), e módulos de extensão (:class:`importlib.machinery.ExtensionFileLoader`) estão agora disponíveis para uso direto.

source: :exc:`ImportError` now has ``name`` and ``path`` attributes which are set when there is relevant data to provide. The message for failed imports will also provide the full name of the module now instead of just the tail end of the module's name.
pt_pt: :exc:`ImportError` tem agora os atributos ``name`` e ``path`` que são definidos quando existem dados relevantes para fornecer. A mensagem para importações falhadas irá também fornecer o nome completo do módulo em vez de apenas a parte final do nome do módulo.

source: The :func:`importlib.invalidate_caches` function will now call the method with the same name on all finders cached in :data:`sys.path_importer_cache` to help clean up any stored state as necessary.
pt_pt: A função :func:`importlib.invalidate_caches` irá agora chamar o método com o mesmo nome em todos os *finders* em cache em :data:`sys.path_importer_cache` para ajudar a limpar qualquer estado armazenado, se necessário.

source: Visible Changes
pt_pt: Alterações Visíveis

source: For potential required changes to code, see the `Porting Python code`_ section.
pt_pt: Para possíveis alterações necessárias ao código, consulte a secção `Porting Python code`_.
