Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: pt_pt

source: If the :mod:`curses` module is linked to the ncursesw library, use Unicode functions when Unicode strings or characters are passed (e.g. :c:func:`!waddwstr`), and bytes functions otherwise (e.g. :c:func:`!waddstr`).
pt_pt: Se o módulo :mod:`curses` estiver ligado à biblioteca ncursesw, usa funções Unicode quando são passadas *strings* ou caracteres Unicode (por exemplo, :c:func:`!waddwstr`), e funções de *bytes* caso contrário (por exemplo, :c:func:`!waddstr`).

source: Use the locale encoding instead of ``utf-8`` to encode Unicode strings.
pt_pt: Usa a codificação local em vez de ``utf-8`` para codificar *strings* Unicode.

source: :class:`curses.window` has a new :attr:`curses.window.encoding` attribute.
pt_pt: A classe :class:`curses.window` tem um novo atributo :attr:`curses.window.encoding`.

source: The :class:`curses.window` class has a new :meth:`~curses.window.get_wch` method to get a wide character
pt_pt: A classe :class:`curses.window` tem um novo método :meth:`~curses.window.get_wch` para obter um carácter largo.

source: The :mod:`curses` module has a new :meth:`~curses.unget_wch` function to push a wide character so the next :meth:`~curses.window.get_wch` will return it
pt_pt: O módulo :mod:`curses` tem uma nova função :meth:`~curses.unget_wch` para inserir um carácter largo, de modo a que a próxima chamada a :meth:`~curses.window.get_wch` o devolva.

source: (Contributed by Iñigo Serna in :issue:`6755`.)
pt_pt: (Contribuído por Iñigo Serna em :issue:`6755`.)

source: Equality comparisons between naive and aware :class:`~datetime.datetime` instances now return :const:`False` instead of raising :exc:`TypeError` (:issue:`15006`).
pt_pt: As comparações de igualdade entre instâncias *naive* e *aware* de :class:`~datetime.datetime` devolvem agora :const:`False` em vez de gerar :exc:`TypeError` (:issue:`15006`).

source: New :meth:`datetime.datetime.timestamp` method: Return POSIX timestamp corresponding to the :class:`~datetime.datetime` instance.
pt_pt: Novo método :meth:`datetime.datetime.timestamp`: Devolve o *timestamp* POSIX correspondente à instância :class:`~datetime.datetime`.

source: The :meth:`datetime.datetime.strftime` method supports formatting years older than 1000.
pt_pt: O método :meth:`datetime.datetime.strftime` suporta a formatação de anos anteriores a 1000.

source: The :meth:`datetime.datetime.astimezone` method can now be called without arguments to convert datetime instance to the system timezone.
pt_pt: O método :meth:`datetime.datetime.astimezone` pode agora ser chamado sem argumentos para converter a instância *datetime* para o fuso horário do sistema.

source: :issue:`7652` - integrate fast native decimal arithmetic.
pt_pt: :issue:`7652` - integrar aritmética decimal nativa rápida.

source: C-module and libmpdec written by Stefan Krah.
pt_pt: Módulo C e libmpdec escritos por Stefan Krah.

source: The new C version of the decimal module integrates the high speed libmpdec library for arbitrary precision correctly rounded decimal floating-point arithmetic. libmpdec conforms to IBM's General Decimal Arithmetic Specification.
pt_pt: A nova versão em C do módulo decimal integra a biblioteca libmpdec de alta velocidade para aritmética decimal de ponto flutuante de precisão arbitrária corretamente arredondada. A libmpdec está em conformidade com a Especificação de Aritmética Decimal Geral da IBM.

source: Performance gains range from 10x for database applications to 100x for numerically intensive applications. These numbers are expected gains for standard precisions used in decimal floating-point arithmetic. Since the precision is user configurable, the exact figures may vary. For example, in integer bignum arithmetic the differences can be significantly higher.
pt_pt: Os ganhos de desempenho variam entre 10x para aplicações de base de dados e 100x para aplicações numericamentes intensivas. Estes números são ganhos esperados para precisões padrão usadas em aritmética decimal de ponto flutuante. Como a precisão é configurável pelo utilizador, os valores exatos podem variar. Por exemplo, em aritmética de *bignum* inteiros, as diferenças podem ser significativamente maiores.

source: The following table is meant as an illustration. Benchmarks are available at https://www.bytereef.org/mpdecimal/quickstart.html.
pt_pt: A tabela seguinte destina-se a ilustrar. *Benchmarks* estão disponíveis em https://www.bytereef.org/mpdecimal/quickstart.html.

source: speedup
pt_pt: aceleração

source: telco
pt_pt: telecomunicações

source: The :exc:`~decimal.FloatOperation` signal optionally enables stricter semantics for mixing floats and Decimals.
pt_pt: O sinal :exc:`~decimal.FloatOperation` permite opcionalmente semânticas mais restritas para a mistura de *floats* e Decimais.

source: If Python is compiled without threads, the C version automatically disables the expensive thread local context machinery. In this case, the variable :const:`~decimal.HAVE_THREADS` is set to ``False``.
pt_pt: Se o Python for compilado sem *threads*, a versão C desativa automaticamente a maquinaria dispendiosa de contexto local de *thread*. Neste caso, a variável :const:`~decimal.HAVE_THREADS` é definida como ``False``.

source: The C module has the following context limits, depending on the machine architecture:
pt_pt: O módulo C tem os seguintes limites de contexto, dependendo da arquitetura da máquina:

source: In the context templates (:const:`~decimal.DefaultContext`, :const:`~decimal.BasicContext` and :const:`~decimal.ExtendedContext`) the magnitude of :attr:`~decimal.Context.Emax` and :attr:`~decimal.Context.Emin` has changed to ``999999``.
pt_pt: Nos modelos de contexto (:const:`~decimal.DefaultContext`, :const:`~decimal.BasicContext` e :const:`~decimal.ExtendedContext`), a magnitude de :attr:`~decimal.Context.Emax` e :attr:`~decimal.Context.Emin` foi alterada para ``999999``.

source: The :class:`~decimal.Decimal` constructor in decimal.py does not observe the context limits and converts values with arbitrary exponents or precision exactly. Since the C version has internal limits, the following scheme is used: If possible, values are converted exactly, otherwise :exc:`~decimal.InvalidOperation` is raised and the result is NaN. In the latter case it is always possible to use :meth:`~decimal.Context.create_decimal` in order to obtain a rounded or inexact value.
pt_pt: O construtor :class:`~decimal.Decimal` em decimal.py não observa os limites do contexto e converte valores com expoentes ou precisão arbitrários exatamente. Como a versão C tem limites internos, é usado o seguinte esquema: se possível, os valores são convertidos exatamente; caso contrário, é gerada uma :exc:`~decimal.InvalidOperation` e o resultado é NaN. Neste último caso, é sempre possível usar :meth:`~decimal.Context.create_decimal` para obter um valor arredondado ou inexato.

source: The power function in decimal.py is always correctly rounded. In the C version, it is defined in terms of the correctly rounded :meth:`~decimal.Decimal.exp` and :meth:`~decimal.Decimal.ln` functions, but the final result is only "almost always correctly rounded".
pt_pt: A função de potência em decimal.py está sempre corretamente arredondada. Na versão C, é definida em termos das funções corretamente arredondadas :meth:`~decimal.Decimal.exp` e :meth:`~decimal.Decimal.ln`, mas o resultado final está apenas "quase sempre corretamente arredondado".

source: In the C version, the context dictionary containing the signals is a :class:`~collections.abc.MutableMapping`. For speed reasons, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` always refer to the same :class:`~collections.abc.MutableMapping` that the context was initialized with. If a new signal dictionary is assigned, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` are updated with the new values, but they do not reference the RHS dictionary.
pt_pt: Na versão C, o dicionário de contexto que contém os sinais é um :class:`~collections.abc.MutableMapping`. Por razões de velocidade, :attr:`~decimal.Context.flags` e :attr:`~decimal.Context.traps` referem-se sempre ao mesmo :class:`~collections.abc.MutableMapping` com que o contexto foi inicializado. Se for atribuído um novo dicionário de sinais, :attr:`~decimal.Context.flags` e :attr:`~decimal.Context.traps` são atualizados com os novos valores, mas não referenciam o dicionário do lado direito.

source: Pickling a :class:`~decimal.Context` produces a different output in order to have a common interchange format for the Python and C versions.
pt_pt: A serialização (*pickling*) de um :class:`~decimal.Context` produz uma saída diferente, de modo a ter um formato de intercâmbio comum para as versões Python e C.

source: The order of arguments in the :class:`~decimal.Context` constructor has been changed to match the order displayed by :func:`repr`.
pt_pt: A ordem dos argumentos no construtor :class:`~decimal.Context` foi alterada para corresponder à ordem apresentada por :func:`repr`.

source: The ``watchexp`` parameter in the :meth:`~decimal.Decimal.quantize` method is deprecated.
pt_pt: O parâmetro ``watchexp`` no método :meth:`~decimal.Decimal.quantize` está preterido.

source: Policy Framework
pt_pt: Estrutura de Políticas

source: The email package now has a :mod:`~email.policy` framework. A :class:`~email.policy.Policy` is an object with several methods and properties that control how the email package behaves. The primary policy for Python 3.3 is the :class:`~email.policy.Compat32` policy, which provides backward compatibility with the email package in Python 3.2. A ``policy`` can be specified when an email message is parsed by a :mod:`~email.parser`, or when a :class:`~email.message.Message` object is created, or when an email is serialized using a :mod:`~email.generator`. Unless overridden, a policy passed to a ``parser`` is inherited by all the ``Message`` object and sub-objects created by the ``parser``. By default a ``generator`` will use the policy of the ``Message`` object it is serializing. The default policy is :data:`~email.policy.compat32`.
pt_pt: O pacote email tem agora uma estrutura :mod:`~email.policy`. Uma :class:`~email.policy.Policy` é um objeto com vários métodos e propriedades que controlam o comportamento do pacote email. A política principal para o Python 3.3 é a política :class:`~email.policy.Compat32`, que fornece retrocompatibilidade com o pacote email do Python 3.2. Uma ``policy`` pode ser especificada quando uma mensagem de email é analisada por um :mod:`~email.parser`, ou quando um objeto :class:`~email.message.Message` é criado, ou quando um email é serializado usando um :mod:`~email.generator`. A menos que seja substituída, uma política passada para um ``parser`` é herdada por todos os objetos ``Message`` e sub-objetos criados pelo ``parser``. Por predefinição, um ``generator`` usará a política do objeto ``Message`` que está a serializar. A política predefinida é :data:`~email.policy.compat32`.

source: The minimum set of controls implemented by all ``policy`` objects are:
pt_pt: O conjunto mínimo de controles implementados por todos os objetos ``policy`` são:

source: max_line_length
pt_pt: comprimento_máximo_linha

source: The maximum length, excluding the linesep character(s), individual lines may have when a ``Message`` is serialized. Defaults to 78.
pt_pt: O comprimento máximo, excluindo o(s) carácter(es) de nova linha, que as linhas individuais podem ter quando uma ``Message`` é serializada. O valor predefinido é 78.

source: linesep
pt_pt: separador_linhas

source: The character used to separate individual lines when a ``Message`` is serialized. Defaults to ``\n``.
pt_pt: O carácter usado para separar linhas individuais quando uma ``Message`` é serializada. O valor predefinido é ``\n``.

source: cte_type
pt_pt: tipo_cte

source: ``7bit`` or ``8bit``. ``8bit`` applies only to a ``Bytes`` ``generator``, and means that non-ASCII may be used where allowed by the protocol (or where it exists in the original input).
pt_pt: ``7bit`` ou ``8bit``. ``8bit`` aplica-se apenas a um ``generator`` de ``Bytes``, e significa que caracteres não-ASCII podem ser usados onde permitido pelo protocolo (ou onde existam na entrada original).

source: raise_on_defect
pt_pt: gerar_erro_em_defeito

source: Causes a ``parser`` to raise error when defects are encountered instead of adding them to the ``Message`` object's ``defects`` list.
pt_pt: Faz com que um ``parser`` gere um erro quando são encontrados defeitos, em vez de os adicionar à lista ``defects`` do objeto ``Message``.

source: A new policy instance, with new settings, is created using the :meth:`~email.policy.Policy.clone` method of policy objects. ``clone`` takes any of the above controls as keyword arguments. Any control not specified in the call retains its default value. Thus you can create a policy that uses ``\r\n`` linesep characters like this::
pt_pt: Uma nova instância de política, com novas definições, é criada usando o método :meth:`~email.policy.Policy.clone` dos objetos de política. ``clone`` aceita qualquer um dos controles acima como argumentos nomeados. Qualquer controle não especificado na chamada mantém o seu valor predefinido. Assim, pode criar uma política que usa caracteres ``\r\n`` como separador de linhas, da seguinte forma::

source: mypolicy = compat32.clone(linesep='\r\n')
pt_pt: minha_política = compat32.clone(separador_linhas='\r\n')

source: Policies can be used to make the generation of messages in the format needed by your application simpler. Instead of having to remember to specify ``linesep='\r\n'`` in all the places you call a ``generator``, you can specify it once, when you set the policy used by the ``parser`` or the ``Message``, whichever your program uses to create ``Message`` objects. On the other hand, if you need to generate messages in multiple forms, you can still specify the parameters in the appropriate ``generator`` call. Or you can have custom policy instances for your different cases, and pass those in when you create the ``generator``.
pt_pt: As políticas podem ser usadas para simplificar a geração de mensagens no formato necessário para a sua aplicação. Em vez de ter de se lembrar de especificar ``linesep='\r\n'`` em todos os locais onde chama um ``generator``, pode especificá-lo uma vez, quando define a política usada pelo ``parser`` ou pela ``Message``, conforme o seu programa usa para criar objetos ``Message``. Por outro lado, se precisar de gerar mensagens em múltiplos formatos, ainda pode especificar os parâmetros na chamada apropriada do ``generator``. Ou pode ter instâncias de políticas personalizadas para os seus diferentes casos e passá-las quando cria o ``generator``.

source: Provisional Policy with New Header API
pt_pt: Política Provisória com Nova API de Cabeçalho

source: While the policy framework is worthwhile all by itself, the main motivation for introducing it is to allow the creation of new policies that implement new features for the email package in a way that maintains backward compatibility for those who do not use the new policies. Because the new policies introduce a new API, we are releasing them in Python 3.3 as a :term:`provisional policy <provisional package>`. Backwards incompatible changes (up to and including removal of the code) may occur if deemed necessary by the core developers.
pt_pt: Embora a estrutura de políticas seja valiosa por si só, a principal motivação para a sua introdução é permitir a criação de novas políticas que implementam novas funcionalidades para o pacote email, mantendo a retrocompatibilidade para quem não utiliza as novas políticas. Como as novas políticas introduzem uma nova API, estamos a lançá-las no Python 3.3 como uma :term:`política provisória <pacote provisório>`. Alterações incompatíveis (incluindo a remoção do código) podem ocorrer se forem consideradas necessárias pelos programadores principais.

source: The new policies are instances of :class:`~email.policy.EmailPolicy`, and add the following additional controls:
pt_pt: As novas políticas são instâncias de :class:`~email.policy.EmailPolicy` e adicionam os seguintes controles adicionais:

source: refold_source
pt_pt: reformatar_fonte

source: Controls whether or not headers parsed by a :mod:`~email.parser` are refolded by the :mod:`~email.generator`. It can be ``none``, ``long``, or ``all``. The default is ``long``, which means that source headers with a line longer than ``max_line_length`` get refolded. ``none`` means no line get refolded, and ``all`` means that all lines get refolded.
pt_pt: Controla se os cabeçalhos analisados por um :mod:`~email.parser` são reformatados pelo :mod:`~email.generator`. Pode ser ``none``, ``long`` ou ``all``. O valor predefinido é ``long``, o que significa que os cabeçalhos de origem com uma linha mais longa do que ``max_line_length`` são reformatados. ``none`` significa que nenhuma linha é reformatada, e ``all`` significa que todas as linhas são reformatadas.

source: header_factory
pt_pt: fábrica_cabeçalhos

source: A callable that take a ``name`` and ``value`` and produces a custom header object.
pt_pt: Uma função invocável que recebe um ``name`` e um ``value`` e produz um objeto de cabeçalho personalizado.

source: The ``header_factory`` is the key to the new features provided by the new policies. When one of the new policies is used, any header retrieved from a ``Message`` object is an object produced by the ``header_factory``, and any time you set a header on a ``Message`` it becomes an object produced by ``header_factory``. All such header objects have a ``name`` attribute equal to the header name. Address and Date headers have additional attributes that give you access to the parsed data of the header. This means you can now do things like this::
pt_pt: A ``header_factory`` é a chave para as novas funcionalidades fornecidas pelas novas políticas. Quando uma das novas políticas é usada, qualquer cabeçalho recuperado de um objeto ``Message`` é um objeto produzido pela ``header_factory``, e sempre que definir um cabeçalho em uma ``Message``, este torna-se um objeto produzido pela ``header_factory``. Todos esses objetos de cabeçalho têm um atributo ``name`` igual ao nome do cabeçalho. Os cabeçalhos de Endereço e Data têm atributos adicionais que permitem aceder aos dados analisados do cabeçalho. Isto significa que agora pode fazer coisas como isto::

source: >>> m = Message(policy=SMTP) >>> m['To'] = 'Éric <foo@example.com>' >>> m['to'] 'Éric <foo@example.com>' >>> m['to'].addresses (Address(display_name='Éric', username='foo', domain='example.com'),) >>> m['to'].addresses[0].username 'foo' >>> m['to'].addresses[0].display_name 'Éric' >>> m['Date'] = email.utils.localtime() >>> m['Date'].datetime datetime.datetime(2012, 5, 25, 21, 39, 24, 465484, tzinfo=datetime.timezone(datetime.timedelta(-1, 72000), 'EDT')) >>> m['Date'] 'Fri, 25 May 2012 21:44:27 -0400' >>> print(m) To: =?utf-8?q?=C3=89ric?= <foo@example.com> Date: Fri, 25 May 2012 21:44:27 -0400
pt_pt: >>> m = Message(policy=SMTP) >>> m['Para'] = 'Éric <foo@example.com>' >>> m['para'] 'Éric <foo@example.com>' >>> m['para'].endereços (Endereço(nome_apresentação='Éric', nome_utilizador='foo', domínio='example.com'),) >>> m['para'].endereços[0].nome_utilizador 'foo' >>> m['para'].endereços[0].nome_apresentação 'Éric' >>> m['Data'] = email.utils.localtime() >>> m['Data'].data_hora datetime.datetime(2012, 5, 25, 21, 39, 24, 465484, tzinfo=datetime.timezone(datetime.timedelta(-1, 72000), 'EDT')) >>> m['Data'] 'Sex, 25 Mai 2012 21:44:27 -0400' >>> print(m) Para: =?utf-8?q?=C3=89ric?= <foo@example.com> Data: Sex, 25 Mai 2012 21:44:27 -0400

source: You will note that the unicode display name is automatically encoded as ``utf-8`` when the message is serialized, but that when the header is accessed directly, you get the unicode version. This eliminates any need to deal with the :mod:`email.header` :meth:`~email.header.decode_header` or :meth:`~email.header.make_header` functions.
pt_pt: Repare que o nome de apresentação Unicode é automaticamente codificado como ``utf-8`` quando a mensagem é serializada, mas quando o cabeçalho é acedido diretamente, obtém a versão Unicode. Isto elimina a necessidade de lidar com as funções :mod:`email.header` :meth:`~email.header.decode_header` ou :meth:`~email.header.make_header`.

source: You can also create addresses from parts::
pt_pt: Também pode criar endereços a partir de partes::

source: >>> m['cc'] = [Group('pals', [Address('Bob', 'bob', 'example.com'), ... Address('Sally', 'sally', 'example.com')]), ... Address('Bonzo', addr_spec='bonz@laugh.com')] >>> print(m) To: =?utf-8?q?=C3=89ric?= <foo@example.com> Date: Fri, 25 May 2012 21:44:27 -0400 cc: pals: Bob <bob@example.com>, Sally <sally@example.com>;, Bonzo <bonz@laugh.com>
pt_pt: >>> m['cc'] = [Grupo('amigos', [Endereço('Bob', 'bob', 'example.com'), ... Endereço('Sally', 'sally', 'example.com')]), ... Endereço('Bonzo', espec_endereço='bonz@laugh.com')] >>> print(m) Para: =?utf-8?q?=C3=89ric?= <foo@example.com> Data: Sex, 25 Mai 2012 21:44:27 -0400 cc: amigos: Bob <bob@example.com>, Sally <sally@example.com>;, Bonzo <bonz@laugh.com>

source: Decoding to unicode is done automatically::
pt_pt: A descodificação para Unicode é feita automaticamente::

source: >>> m2 = message_from_string(str(m)) >>> m2['to'] 'Éric <foo@example.com>'
pt_pt: >>> m2 = message_from_string(str(m)) >>> m2['para'] 'Éric <foo@example.com>'

source: When you parse a message, you can use the ``addresses`` and ``groups`` attributes of the header objects to access the groups and individual addresses::
pt_pt: Quando analisa uma mensagem, pode usar os atributos ``addresses`` e ``groups`` dos objetos de cabeçalho para aceder aos grupos e endereços individuais::

source: >>> m2['cc'].addresses (Address(display_name='Bob', username='bob', domain='example.com'), Address(display_name='Sally', username='sally', domain='example.com'), Address(display_name='Bonzo', username='bonz', domain='laugh.com')) >>> m2['cc'].groups (Group(display_name='pals', addresses=(Address(display_name='Bob', username='bob', domain='example.com'), Address(display_name='Sally', username='sally', domain='example.com')), Group(display_name=None, addresses=(Address(display_name='Bonzo', username='bonz', domain='laugh.com'),))
pt_pt: >>> m2['cc'].endereços (Endereço(nome_apresentação='Bob', nome_utilizador='bob', domínio='example.com'), Endereço(nome_apresentação='Sally', nome_utilizador='sally', domínio='example.com'), Endereço(nome_apresentação='Bonzo', nome_utilizador='bonz', domínio='laugh.com')) >>> m2['cc'].grupos (Grupo(nome_apresentação='amigos', endereços=(Endereço(nome_apresentação='Bob', nome_utilizador='bob', domínio='example.com'), Endereço(nome_apresentação='Sally', nome_utilizador='sally', domínio='example.com'))), Grupo(nome_apresentação=None, endereços=(Endereço(nome_apresentação='Bonzo', nome_utilizador='bonz', domínio='laugh.com'),)))

source: In summary, if you use one of the new policies, header manipulation works the way it ought to: your application works with unicode strings, and the email package transparently encodes and decodes the unicode to and from the RFC standard Content Transfer Encodings.
pt_pt: Em resumo, se usar uma das novas políticas, a manipulação de cabeçalhos funciona como deve: a sua aplicação trabalha com *strings* Unicode, e o pacote email codifica e descodifica transparentemente o Unicode para e a partir das codificações de transferência de conteúdo padrão RFC.

source: Other API Changes
pt_pt: Outras Alterações à API
