Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: mmap objects are now :ref:`weakly referenceable <mod-weakref>`. (Contributed by Valerie Lambert in :issue:`4885`.)
pt_pt: Os objetos mmap são agora :ref:`referenciáveis fracamente <mod-weakref>`. (Contribuído por Valerie Lambert em :issue:`4885`.)
ru: Объекты mmap теперь :ref:`слабо доступны для ссылок <mod-weakref>`. (Предоставлено Валери Ламберт в :issue:`4885`.)

source: On Unix two new :ref:`start methods <multiprocessing-start-methods>`, ``spawn`` and ``forkserver``, have been added for starting processes using :mod:`multiprocessing`. These make the mixing of processes with threads more robust, and the ``spawn`` method matches the semantics that multiprocessing has always used on Windows. New function :func:`~multiprocessing.get_all_start_methods` reports all start methods available on the platform, :func:`~multiprocessing.get_start_method` reports the current start method, and :func:`~multiprocessing.set_start_method` sets the start method. (Contributed by Richard Oudkerk in :issue:`8713`.)
pt_pt: No Unix, dois novos :ref:`métodos de início <multiprocessing-start-methods>`, ``spawn`` e ``forkserver``, foram adicionados para iniciar processos usando :mod:`multiprocessing`. Estes tornam a mistura de processos com *threads* mais robusta, e o método ``spawn`` corresponde à semântica que o *multiprocessing* sempre usou no Windows. A nova função :func:`~multiprocessing.get_all_start_methods` reporta todos os métodos de início disponíveis na plataforma, :func:`~multiprocessing.get_start_method` reporta o método de início atual, e :func:`~multiprocessing.set_start_method` define o método de início. (Contribuído por Richard Oudkerk em :issue:`8713`.)
ru: В Unix добавлены два новых метода start <multiprocessing-start-methods>, spawn и forkserver для запуска процессов с использованием multiprocessing. Это делает смешивание процессов с потоками более надежным, а метод spawn соответствует семантике, которую всегда использовала многопроцессорность в Windows. Новая функция :func:`~multiprocessing.get_all_start_methods` сообщает обо всех методах запуска, доступных на платформе, :func:`~multiprocessing.get_start_method` сообщает о текущем методе запуска, а :func:`~multiprocessing.set_start_method` устанавливает метод запуска. (Предоставлено Ричардом Оудкерком в :issue:`8713`.)

source: :mod:`multiprocessing` also now has the concept of a ``context``, which determines how child processes are created. New function :func:`~multiprocessing.get_context` returns a context that uses a specified start method. It has the same API as the :mod:`multiprocessing` module itself, so you can use it to create :class:`~multiprocessing.pool.Pool`\ s and other objects that will operate within that context. This allows a framework and an application or different parts of the same application to use multiprocessing without interfering with each other. (Contributed by Richard Oudkerk in :issue:`18999`.)
pt_pt: O módulo :mod:`multiprocessing` agora também tem o conceito de ``context``, que determina como os processos filhos são criados. A nova função :func:`~multiprocessing.get_context` devolve um contexto que usa um método de início especificado. Tem a mesma API que o módulo :mod:`multiprocessing` em si, pelo que pode usá-la para criar :class:`~multiprocessing.pool.Pool` e outros objetos que operarão dentro desse contexto. Isto permite que uma *framework* e uma aplicação, ou diferentes partes da mesma aplicação, usem *multiprocessing* sem interferir umas com as outras. (Contribuído por Richard Oudkerk em :issue:`18999`.)
ru: :mod:`multiprocessing` также теперь имеет концепцию ``контекста``, которая определяет, как создаются дочерние процессы. Новая функция :func:`~multiprocessing.get_context` возвращает контекст, который использует указанный метод запуска. Он имеет тот же API, что и сам модуль :mod:`multiprocessing`, поэтому вы можете использовать его для создания :class:`~multiprocessing.pool.Pool`\ и других объектов, которые будут работать в этом контексте. Это позволяет платформе и приложению или различным частям одного и того же приложения использовать многопроцессорную обработку, не мешая друг другу. (Предоставлено Ричардом Оудкерком в :issue:`18999`.)

source: Except when using the old *fork* start method, child processes no longer inherit unneeded handles/file descriptors from their parents (part of :issue:`8713`).
pt_pt: Exceto quando se usa o antigo método de início *fork*, os processos filhos já não herdam descritores de ficheiros ou *handles* desnecessários dos seus pais (parte de :issue:`8713`).
ru: За исключением использования старого метода запуска *fork*, дочерние процессы больше не наследуют ненужные дескрипторы/дескрипторы файлов от своих родителей (часть :issue:`8713`).

source: :mod:`multiprocessing` now relies on :mod:`runpy` (which implements the ``-m`` switch) to initialise ``__main__`` appropriately in child processes when using the ``spawn`` or ``forkserver`` start methods. This resolves some edge cases where combining multiprocessing, the ``-m`` command line switch, and explicit relative imports could cause obscure failures in child processes. (Contributed by Nick Coghlan in :issue:`19946`.)
pt_pt: O módulo :mod:`multiprocessing` agora depende de :mod:`runpy` (que implementa a opção ``-m``) para inicializar ``__main__`` adequadamente em processos filhos ao usar os métodos de início ``spawn`` ou ``forkserver``. Isto resolve alguns casos extremos em que a combinação de *multiprocessing*, a opção de linha de comandos ``-m`` e importações relativas explícitas poderia causar falhas obscuras em processos filhos. (Contribuído por Nick Coghlan em :issue:`19946`.)
ru: :mod:`multiprocessing` теперь полагается на :mod:`runpy` (который реализует переключатель ``-m``) для правильной инициализации ``__main__`` в дочерних процессах при использовании ``spawn`` или ``forkserver`` `` методы запуска. Это устраняет некоторые крайние случаи, когда сочетание многопроцессорности, переключателя командной строки ``-m`` и явного относительного импорта могло привести к неявным сбоям в дочерних процессах. (Предоставлено Ником Когланом в :issue:`19946`.)

source: operator
ru: оператор

source: New function :func:`~operator.length_hint` provides an implementation of the specification for how the :meth:`~object.__length_hint__` special method should be used, as part of the :pep:`424` formal specification of this language feature. (Contributed by Armin Ronacher in :issue:`16148`.)
pt_pt: Nova função :func:`~operator.length_hint` fornece uma implementação da especificação de como o método especial :meth:`~object.__length_hint__` deve ser usado, como parte da especificação formal da funcionalidade da linguagem :pep:`424`. (Contribuído por Armin Ronacher em :issue:`16148`.)
ru: Новая функция :func:`~operator.length_hint` обеспечивает реализацию спецификации того, как следует использовать специальный метод :meth:`~object.__length_hint__`, как часть формальной спецификации :pep:`424` этого языка. особенность. (Предоставлено Армином Ронахером в :issue:`16148`.)

source: There is now a pure-python version of the :mod:`operator` module available for reference and for use by alternate implementations of Python. (Contributed by Zachary Ware in :issue:`16694`.)
pt_pt: Agora existe uma versão em Python puro do módulo :mod:`operator` disponível para referência e para uso por implementações alternativas do Python. (Contribuído por Zachary Ware em :issue:`16694`.)
ru: Теперь существует версия модуля :mod:`operator`, написанная на чистом Python, доступная для справки и для использования альтернативными реализациями Python. (Предоставлено Закари Уэром в :issue:`16694`.)

source: There are new functions to get and set the :ref:`inheritable flag <fd_inheritance>` of a file descriptor (:func:`os.get_inheritable`, :func:`os.set_inheritable`) or a Windows handle (:func:`os.get_handle_inheritable`, :func:`os.set_handle_inheritable`).
pt_pt: Existem novas funções para obter e definir a :ref:`flag herdável <fd_inheritance>` de um descritor de ficheiro (:func:`os.get_inheritable`, :func:`os.set_inheritable`) ou de um *handle* do Windows (:func:`os.get_handle_inheritable`, :func:`os.set_handle_inheritable`).
ru: Появились новые функции для получения и установки :ref:`inheritable флага <fd_inheritance>` дескриптора файла (:func:`os.get_inheritable`, :func:`os.set_inheritable`) или дескриптора Windows (:func: `os.get_handle_inheritable`, :func:`os.set_handle_inheritable`).

source: New function :func:`~os.cpu_count` reports the number of CPUs available on the platform on which Python is running (or ``None`` if the count can't be determined). The :func:`multiprocessing.cpu_count` function is now implemented in terms of this function). (Contributed by Trent Nelson, Yogesh Chaudhari, Victor Stinner, and Charles-François Natali in :issue:`17914`.)
pt_pt: Nova função :func:`~os.cpu_count` que reporta o número de CPUs disponíveis na plataforma em que o Python está a ser executado (ou ``None`` se o número não puder ser determinado). A função :func:`multiprocessing.cpu_count` é agora implementada em termos desta função. (Contribuído por Trent Nelson, Yogesh Chaudhari, Victor Stinner e Charles-François Natali em :issue:`17914`.)
ru: Новая функция :func:`~os.cpu_count` сообщает количество процессоров, доступных на платформе, на которой работает Python (или ``Нет``, если число невозможно определить). Функция :func:`multiprocessing.cpu_count` теперь реализована на основе этой функции). (Предоставлено Трентом Нельсоном, Йогешем Чаудхари, Виктором Стиннером и Шарлем-Франсуа Натали в :issue:`17914`.)

source: :func:`os.path.samestat` is now available on the Windows platform (and the :func:`os.path.samefile` implementation is now shared between Unix and Windows). (Contributed by Brian Curtin in :issue:`11939`.)
pt_pt: A função :func:`os.path.samestat` está agora disponível na plataforma Windows (e a implementação da função :func:`os.path.samefile` é agora partilhada entre Unix e Windows). (Contribuído por Brian Curtin em :issue:`11939`.)
ru: :func:`os.path.samestat` теперь доступен на платформе Windows (а реализация :func:`os.path.samefile` теперь используется совместно Unix и Windows). (Предоставлено Брайаном Кертином в :issue:`11939`.)

source: :func:`os.path.ismount` now recognizes volumes mounted below a drive root on Windows. (Contributed by Tim Golden in :issue:`9035`.)
pt_pt: A função :func:`os.path.ismount` agora reconhece volumes montados abaixo da raiz de uma unidade no Windows. (Contribuído por Tim Golden em :issue:`9035`.)
ru: :func:`os.path.ismount` теперь распознает тома, смонтированные ниже корня диска в Windows. (Предоставлено Тимом Голденом в :issue:`9035`.)

source: :func:`os.open` supports two new flags on platforms that provide them, :const:`~os.O_PATH` (un-opened file descriptor), and :const:`~os.O_TMPFILE` (unnamed temporary file; as of 3.4.0 release available only on Linux systems with a kernel version of 3.11 or newer that have uapi headers). (Contributed by Christian Heimes in :issue:`18673` and Benjamin Peterson, respectively.)
pt_pt: A função :func:`os.open` suporta duas novas *flags* em plataformas que as fornecem, :const:`~os.O_PATH` (descritor de ficheiro não aberto) e :const:`~os.O_TMPFILE` (ficheiro temporário sem nome; na versão 3.4.0 disponível apenas em sistemas Linux com uma versão de núcleo de 3.11 ou mais recente que tenham *headers* uapi). (Contribuído por Christian Heimes em :issue:`18673` e Benjamin Peterson, respetivamente.)
ru: :func:`os.open` поддерживает два новых флага на платформах, которые их предоставляют: :const:`~os.O_PATH` (дескриптор неоткрытого файла) и :const:`~os.O_TMPFILE` (безымянный временный файл; начиная с версии 3.4.0, доступной только в системах Linux с версией ядра 3.11 или новее, имеющими заголовки uapi). (Предоставлено Кристианом Хеймсом в :issue:`18673` и Бенджамином Петерсоном соответственно.)

source: :mod:`pdb` has been enhanced to handle generators, :keyword:`yield`, and ``yield from`` in a more useful fashion. This is especially helpful when debugging :mod:`asyncio` based programs. (Contributed by Andrew Svetlov and Xavier de Gaye in :issue:`16596`.)
pt_pt: O módulo :mod:`pdb` foi melhorado para lidar com geradores, :keyword:`yield` e ``yield from`` de forma mais útil. Isto é especialmente útil ao depurar programas baseados em :mod:`asyncio`. (Contribuído por Andrew Svetlov e Xavier de Gaye em :issue:`16596`.)
ru: :mod:`pdb` был улучшен для более удобной обработки генераторов, :keyword:`yield` и ``yield from``. Это особенно полезно при отладке программ на основе :mod:`asyncio`. (Предоставлено Андреем Светловым и Ксавье де Гаем в :issue:`16596`.)

source: The ``print`` command has been removed from :mod:`pdb`, restoring access to the Python :func:`print` function from the pdb command line. Python2's ``pdb`` did not have a ``print`` command; instead, entering ``print`` executed the ``print`` statement. In Python3 ``print`` was mistakenly made an alias for the pdb :pdbcmd:`p` command. ``p``, however, prints the ``repr`` of its argument, not the ``str`` like the Python2 ``print`` command did. Worse, the Python3 ``pdb print`` command shadowed the Python3 ``print`` function, making it inaccessible at the ``pdb`` prompt. (Contributed by Connor Osborn in :issue:`18764`.)
pt_pt: O comando ``print`` foi removido do :mod:`pdb`, restaurando o acesso à função :func:`print` do Python a partir da linha de comandos do pdb. O ``pdb`` do Python 2 não tinha um comando ``print``; em vez disso, ao introduzir ``print`` executava a instrução ``print``. No Python 3, ``print`` foi erradamente tornado um *alias* para o comando :pdbcmd:`p` do pdb. No entanto, ``p`` imprime o ``repr`` do seu argumento, não o ``str`` como o comando ``print`` do Python 2 fazia. Pior ainda, o comando ``pdb print`` do Python 3 ocultava a função ``print`` do Python 3, tornando-a inacessível no *prompt* do ``pdb``. (Contribuído por Connor Osborn em :issue:`18764`.)
ru: Команда ``print`` была удалена из :mod:`pdb`, восстанавливая доступ к функции Python :func:`print` из командной строки pdb. В Python2 «pdb» не имел команды «print»; вместо этого ввод ``print`` запускал оператор ``print``. В Python3 print по ошибке стал псевдонимом для команды pdb :pdbcmd:`p`. Однако ``p`` печатает ``repr`` своего аргумента, а не ``str``, как это сделала команда Python2 ``print``. Хуже того, команда Python3 ``pdb print`` дублировала функцию Python3 ``print``, делая ее недоступной в командной строке ``pdb``. (Предоставлено Коннором Осборном в :issue:`18764`.)

source: :mod:`pickle` now supports (but does not use by default) a new pickle protocol, protocol 4. This new protocol addresses a number of issues that were present in previous protocols, such as the serialization of nested classes, very large strings and containers, and classes whose :meth:`__new__` method takes keyword-only arguments. It also provides some efficiency improvements.
ru: :mod:`pickle` теперь поддерживает (но не использует по умолчанию) новый протокол Pickle, протокол 4. Этот новый протокол решает ряд проблем, которые присутствовали в предыдущих протоколах, таких как сериализация вложенных классов, очень большие строки. и контейнеры, и классы, чей метод :meth:`__new__` принимает аргументы, содержащие только ключевые слова. Это также обеспечивает некоторое повышение эффективности.

source: :pep:`3154` -- Pickle protocol 4
pt_pt: :pep:`3154` -- Protocolo de Pickle 4
ru: :pep:`3154` -- Протокол Pickle 4

source: PEP written by Antoine Pitrou and implemented by Alexandre Vassalotti.
pt_pt: PEP escrito por Antoine Pitrou e implementado por Alexandre Vassalotti.
ru: PEP написан Антуаном Питру и реализован Александром Вассалотти.

source: :mod:`plistlib` now has an API that is similar to the standard pattern for stdlib serialization protocols, with new :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads`, and :func:`~plistlib.dumps` functions. (The older API is now deprecated.) In addition to the already supported XML plist format (:const:`~plistlib.FMT_XML`), it also now supports the binary plist format (:const:`~plistlib.FMT_BINARY`). (Contributed by Ronald Oussoren and others in :issue:`14455`.)
pt_pt: O módulo :mod:`plistlib` agora tem uma API semelhante ao padrão habitual para protocolos de serialização da biblioteca padrão, com as novas funções :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads` e :func:`~plistlib.dumps`. (A API antiga está agora descontinuada.) Além do formato de *plist* XML já suportado (:const:`~plistlib.FMT_XML`), agora também suporta o formato binário de *plist* (:const:`~plistlib.FMT_BINARY`). (Contribuído por Ronald Oussoren e outros em :issue:`14455`.)
ru: :mod:`plistlib` теперь имеет API, аналогичный стандартному шаблону для протоколов сериализации stdlib, с новыми :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib` .loads` и :func:`~plistlib.dumps`. (Старый API устарел.) В дополнение к уже поддерживаемому формату списка XML (:const:`~plistlib.FMT_XML`) он также теперь поддерживает формат двоичного списка (:const:`~plistlib.FMT_BINARY`). (Предоставлено Рональдом Уссореном и другими в :issue:`14455`.)

source: Two new methods have been added to :mod:`poplib`: :meth:`~poplib.POP3.capa`, which returns the list of capabilities advertised by the POP server, and :meth:`~poplib.POP3.stls`, which switches a clear-text POP3 session into an encrypted POP3 session if the POP server supports it. (Contributed by Lorenzo Catucci in :issue:`4473`.)
pt_pt: Dois novos métodos foram adicionados ao :mod:`poplib`: :meth:`~poplib.POP3.capa`, que devolve a lista de capacidades anunciadas pelo servidor POP, e :meth:`~poplib.POP3.stls`, que muda uma sessão POP3 em texto claro para uma sessão POP3 encriptada se o servidor POP a suportar. (Contribuído por Lorenzo Catucci em :issue:`4473`.)
ru: В :mod:`poplib` добавлены два новых метода: :meth:`~poplib.POP3.capa`, который возвращает список возможностей, объявленных POP-сервером, и :meth:`~poplib.POP3.stls` , который переключает сеанс POP3 с открытым текстом на зашифрованный сеанс POP3, если POP-сервер поддерживает это. (Предоставлено Лоренцо Катуччи в :issue:`4473`.)

source: The :mod:`pprint` module's :class:`~pprint.PrettyPrinter` class and its :func:`~pprint.pformat`, and :func:`~pprint.pprint` functions have a new option, *compact*, that controls how the output is formatted. Currently setting *compact* to ``True`` means that sequences will be printed with as many sequence elements as will fit within *width* on each (indented) line. (Contributed by Serhiy Storchaka in :issue:`19132`.)
pt_pt: A classe :class:`~pprint.PrettyPrinter` do módulo :mod:`pprint` e as suas funções :func:`~pprint.pformat` e :func:`~pprint.pprint` têm uma nova opção, *compact*, que controla como a saída é formatada. Atualmente, definir *compact* como ``True`` significa que as sequências serão impressas com tantos elementos de sequência quantos couberem dentro de *width* em cada linha (com recuo). (Contribuído por Serhiy Storchaka em :issue:`19132`.)
ru: Класс :class:`~pprint.PrettyPrinter` модуля :mod:`pprint` и его функции :func:`~pprint.pformat` и :func:`~pprint.pprint` имеют новую опцию *compact*, который контролирует форматирование вывода. В настоящее время установка для *compact* значения ``True`` означает, что последовательности будут печататься с таким количеством элементов последовательности, которое уместится в *ширине* каждой (с отступом) строки. (Предоставлено Сергеем Сторчакой в ​​:issue:`19132`.)

source: Long strings are now wrapped using Python's normal line continuation syntax. (Contributed by Antoine Pitrou in :issue:`17150`.)
pt_pt: As *strings* longas são agora quebradas usando a sintaxe normal de continuação de linha do Python. (Contribuído por Antoine Pitrou em :issue:`17150`.)
ru: Длинные строки теперь переносятся с использованием обычного синтаксиса продолжения строки Python. (Предоставлено Антуаном Питру в :issue:`17150`.)

source: :func:`pty.spawn` now returns the status value from :func:`os.waitpid` on the child process, instead of ``None``. (Contributed by Gregory P. Smith.)
pt_pt: A função :func:`pty.spawn` agora devolve o valor de estado de :func:`os.waitpid` no processo filho, em vez de ``None``. (Contribuído por Gregory P. Smith.)
ru: :func:`pty.spawn` теперь возвращает значение статуса из :func:`os.waitpid` дочернего процесса вместо ``None``. (Предоставлено Грегори П. Смитом.)

source: The :mod:`pydoc` module is now based directly on the :func:`inspect.signature` introspection API, allowing it to provide signature information for a wider variety of callable objects. This change also means that ``__wrapped__`` attributes are now taken into account when displaying help information. (Contributed by Larry Hastings in :issue:`19674`.)
pt_pt: O módulo :mod:`pydoc` é agora baseado diretamente na API de introspeção :func:`inspect.signature`, permitindo-lhe fornecer informações de assinatura para uma variedade mais ampla de objetos chamáveis. Esta alteração também significa que os atributos ``__wrapped__`` são agora tidos em conta ao exibir informações de ajuda. (Contribuído por Larry Hastings em :issue:`19674`.)
ru: Модуль :mod:`pydoc` теперь основан непосредственно на API интроспекции :func:`inspect.signature`, что позволяет ему предоставлять информацию о подписи для более широкого спектра вызываемых объектов. Это изменение также означает, что атрибуты ``__wrapped__`` теперь учитываются при отображении справочной информации. (Предоставлено Ларри Гастингсом в :issue:`19674`.)

source: The :mod:`pydoc` module no longer displays the ``self`` parameter for already bound methods. Instead, it aims to always display the exact current signature of the supplied callable. (Contributed by Larry Hastings in :issue:`20710`.)
pt_pt: O módulo :mod:`pydoc` já não exibe o parâmetro ``self`` para métodos já ligados. Em vez disso, procura sempre exibir a assinatura exata atual do objeto chamável fornecido. (Contribuído por Larry Hastings em :issue:`20710`.)
ru: Модуль :mod:`pydoc` больше не отображает параметр ``self`` для уже связанных методов. Вместо этого он стремится всегда отображать точную текущую подпись предоставленного вызываемого объекта. (Предоставлено Ларри Гастингсом в :issue:`20710`.)

source: In addition to the changes that have been made to :mod:`pydoc` directly, its handling of custom ``__dir__`` methods and various descriptor behaviours has also been improved substantially by the underlying changes in the :mod:`inspect` module.
pt_pt: Além das alterações feitas diretamente ao :mod:`pydoc`, o seu tratamento de métodos ``__dir__`` personalizados e vários comportamentos de descritores também foi melhorado substancialmente pelas alterações subjacentes no módulo :mod:`inspect`.
ru: В дополнение к изменениям, внесенным непосредственно в :mod:`pydoc`, его обработка пользовательских методов ``__dir__`` и различного поведения дескрипторов также была существенно улучшена за счет базовых изменений в модуле :mod:`inspect` .

source: As the :func:`help` builtin is based on :mod:`pydoc`, the above changes also affect the behaviour of :func:`help`.
pt_pt: Como a função integrada :func:`help` é baseada em :mod:`pydoc`, as alterações acima também afetam o comportamento de :func:`help`.
ru: Поскольку встроенная функция :func:`help` основана на :mod:`pydoc`, вышеуказанные изменения также влияют на поведение :func:`help`.
