Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: :func:`functools.update_wrapper` and :func:`functools.wraps` now correctly set the ``__wrapped__`` attribute to the function being wrapped, even if that function also had its ``__wrapped__`` attribute set. This means ``__wrapped__`` attributes now correctly link a stack of decorated functions rather than every ``__wrapped__`` attribute in the chain referring to the innermost function. Introspection libraries that assumed the previous behaviour was intentional can use :func:`inspect.unwrap` to access the first function in the chain that has no ``__wrapped__`` attribute.
pt_pt: As funções :func:`functools.update_wrapper` e :func:`functools.wraps` agora definem corretamente o atributo ``__wrapped__`` para a função que está a ser envolvida, mesmo que essa função também tenha o seu atributo ``__wrapped__`` definido. Isto significa que os atributos ``__wrapped__`` agora ligam corretamente uma pilha de funções decoradas, em vez de cada atributo ``__wrapped__`` na cadeia referir-se à função mais interna. Bibliotecas de introspeção que assumiam que o comportamento anterior era intencional podem usar :func:`inspect.unwrap` para aceder à primeira função na cadeia que não tem um atributo ``__wrapped__``.
ru: :func:`functools.update_wrapper` и :func:`functools.wraps` теперь правильно устанавливают атрибут ``__wrapped__`` для оборачиваемой функции, даже если для этой функции также был установлен атрибут ``__wrapped__``. Это означает, что атрибуты ``__wrapped__`` теперь правильно связывают стек декорированных функций, а не каждый атрибут ``__wrapped__`` в цепочке, ссылающийся на самую внутреннюю функцию. Библиотеки интроспекции, которые предполагали, что предыдущее поведение было преднамеренным, могут использовать :func:`inspect.unwrap` для доступа к первой функции в цепочке, которая не имеет атрибута ``__wrapped__``.

source: :func:`inspect.getfullargspec` has been reimplemented on top of :func:`inspect.signature` and hence handles a much wider variety of callable objects than it did in the past. It is expected that additional builtin and extension module callables will gain signature metadata over the course of the Python 3.4 series. Code that assumes that :func:`inspect.getfullargspec` will fail on non-Python callables may need to be adjusted accordingly.
pt_pt: A função :func:`inspect.getfullargspec` foi reimplementada sobre :func:`inspect.signature` e, portanto, trata de uma variedade muito maior de objetos chamáveis do que no passado. Espera-se que objetos chamáveis adicionais de módulos integrados e de extensão ganhem metadados de assinatura ao longo da série Python 3.4. Código que assume que :func:`inspect.getfullargspec` falhará em objetos chamáveis não-Python pode precisar de ser ajustado em conformidade.
ru: :func:`inspect.getfullargspec` был переопределен поверх :func:`inspect.signature` и, следовательно, обрабатывает гораздо более широкий спектр вызываемых объектов, чем раньше. Ожидается, что дополнительные встроенные и вызываемые модули модулей получат метаданные подписи в ходе серии Python 3.4. Код, который предполагает, что :func:`inspect.getfullargspec` не будет работать при вызовах, отличных от Python, возможно, придется соответствующим образом скорректировать.

source: :class:`importlib.machinery.PathFinder` now passes on the current working directory to objects in :data:`sys.path_hooks` for the empty string. This results in :data:`sys.path_importer_cache` never containing ``''``, thus iterating through :data:`sys.path_importer_cache` based on :data:`sys.path` will not find all keys. A module's ``__file__`` when imported in the current working directory will also now have an absolute path, including when using ``-m`` with the interpreter (except for ``__main__.__file__`` when a script has been executed directly using a relative path) (Contributed by Brett Cannon in :issue:`18416`). is specified on the command-line) (:issue:`18416`).
pt_pt: A classe :class:`importlib.machinery.PathFinder` agora passa o diretório de trabalho atual para objetos em :data:`sys.path_hooks` para a string vazia. Isto resulta em :data:`sys.path_importer_cache` nunca conter ``''``, portanto, iterar através de :data:`sys.path_importer_cache` com base em :data:`sys.path` não encontrará todas as chaves. O ``__file__`` de um módulo, quando importado no diretório de trabalho atual, também terá agora um caminho absoluto, incluindo ao usar ``-m`` com o interpretador (exceto para ``__main__.__file__`` quando um script é executado diretamente usando um caminho relativo) (Contribuído por Brett Cannon em :issue:`18416`). é especificado na linha de comando) (:issue:`18416`).
ru: :class:`importlib.machinery.PathFinder` теперь передает текущий рабочий каталог объектам в :data:`sys.path_hooks` для пустой строки. В результате :data:`sys.path_importer_cache` никогда не содержит ``''``, таким образом, перебор :data:`sys.path_importer_cache` на основе :data:`sys.path` не приведет к поиску всех ключей. ``__file__`` модуля при импорте в текущий рабочий каталог теперь также будет иметь абсолютный путь, в том числе при использовании ``-m`` с интерпретатором (за исключением ``__main__.__file__``, когда скрипт был выполнен. напрямую, используя относительный путь) (предоставлен Бреттом Кэнноном в :issue:`18416`). указывается в командной строке) (:issue:`18416`).

source: The removal of the *strict* argument to :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` changes the meaning of the remaining arguments if you are specifying them positionally rather than by keyword. If you've been paying attention to deprecation warnings your code should already be specifying any additional arguments via keywords.
pt_pt: A remoção do argumento *strict* de :class:`~http.client.HTTPConnection` e :class:`~http.client.HTTPSConnection` altera o significado dos argumentos restantes se os estiver a especificar posicionalmente em vez de por palavra-chave. Se tem prestado atenção aos avisos de obsolescência, o seu código já deve estar a especificar quaisquer argumentos adicionais por palavras-chave.
ru: Удаление аргумента *strict* в :class:`~http.client.HTTPConnection` и :class:`~http.client.HTTPSConnection` меняет значение остальных аргументов, если вы указываете их позиционно, а не по ключевому слову. Если вы обращали внимание на предупреждения об устаревании, в вашем коде уже должны быть указаны дополнительные аргументы с помощью ключевых слов.

source: Strings between ``from __future__ import ...`` statements now *always* raise a :exc:`SyntaxError`. Previously if there was no leading docstring, an interstitial string would sometimes be ignored. This brings CPython into compliance with the language spec; Jython and PyPy already were. (:issue:`17434`).
pt_pt: Strings entre declarações ``from __future__ import ...`` agora *sempre* lançam uma exceção :exc:`SyntaxError`. Anteriormente, se não houvesse uma *docstring* inicial, uma string intersticial era por vezes ignorada. Isto traz o CPython para conformidade com a especificação da linguagem; Jython e PyPy já estavam. (:issue:`17434`).
ru: Строки между операторами ``from __future__ import ...`` теперь *всегда* вызывают :exc:`SyntaxError`. Раньше, если не было ведущей строки документации, промежуточная строка иногда игнорировалась. Это приводит CPython в соответствие со спецификацией языка; Jython и PyPy уже были. (:issue:`17434`).

source: :meth:`ssl.SSLSocket.getpeercert` and :meth:`ssl.SSLSocket.do_handshake` now raise an :exc:`OSError` with ``ENOTCONN`` when the ``SSLSocket`` is not connected, instead of the previous behavior of raising an :exc:`AttributeError`. In addition, :meth:`~ssl.SSLSocket.getpeercert` will raise a :exc:`ValueError` if the handshake has not yet been done.
pt_pt: Os métodos :meth:`ssl.SSLSocket.getpeercert` e :meth:`ssl.SSLSocket.do_handshake` agora lançam uma exceção :exc:`OSError` com ``ENOTCONN`` quando o ``SSLSocket`` não está conectado, em vez do comportamento anterior de lançar uma exceção :exc:`AttributeError`. Além disso, :meth:`~ssl.SSLSocket.getpeercert` lançará uma exceção :exc:`ValueError` se o *handshake* ainda não tiver sido feito.
ru: :meth:`ssl.SSLSocket.getpeercert` и :meth:`ssl.SSLSocket.do_handshake` теперь вызывают :exc:`OSError` с ``ENOTCONN``, когда ``SSLSocket`` не подключен, вместо предыдущее поведение при вызове :exc:`AttributeError`. Кроме того, :meth:`~ssl.SSLSocket.getpeercert` выдаст :exc:`ValueError`, если рукопожатие еще не было выполнено.

source: :func:`base64.b32decode` now raises a :exc:`binascii.Error` when the input string contains non-b32-alphabet characters, instead of a :exc:`TypeError`. This particular :exc:`TypeError` was missed when the other :exc:`TypeError`\ s were converted. (Contributed by Serhiy Storchaka in :issue:`18011`.) Note: this change was also inadvertently applied in Python 3.3.3.
pt_pt: A função :func:`base64.b32decode` agora lança uma exceção :exc:`binascii.Error` quando a string de entrada contém caracteres que não pertencem ao alfabeto b32, em vez de lançar uma exceção :exc:`TypeError`. Este :exc:`TypeError` específico foi esquecido quando os outros :exc:`TypeError` foram convertidos. (Contribuído por Serhiy Storchaka em :issue:`18011`.) Nota: esta alteração também foi aplicada inadvertidamente no Python 3.3.3.
ru: :func:`base64.b32decode` теперь вызывает :exc:`binascii.Error`, когда входная строка содержит символы алфавита, отличные от b32, вместо :exc:`TypeError`. Этот конкретный :exc:`TypeError` был пропущен при преобразовании других :exc:`TypeError`\. (Внесено Сергеем Сторчакой в ​​:issue:`18011`.) Примечание: это изменение также было случайно применено в Python 3.3.3.

source: The :attr:`~cgi.FieldStorage.file` attribute is now automatically closed when the creating :class:`cgi.FieldStorage` instance is garbage collected. If you were pulling the file object out separately from the :class:`cgi.FieldStorage` instance and not keeping the instance alive, then you should either store the entire :class:`cgi.FieldStorage` instance or read the contents of the file before the :class:`cgi.FieldStorage` instance is garbage collected.
ru: Атрибут :attr:`~cgi.FieldStorage.file` теперь автоматически закрывается, когда создаваемый экземпляр :class:`cgi.FieldStorage` подвергается сборке мусора. Если вы извлекали файловый объект отдельно из экземпляра :class:`cgi.FieldStorage` и не поддерживали работу экземпляра, то вам следует либо сохранить весь экземпляр :class:`cgi.FieldStorage`, либо прочитать содержимое файла. до того, как экземпляр :class:`cgi.FieldStorage` будет собран мусором.

source: Calling ``read`` or ``write`` on a closed SSL socket now raises an informative :exc:`ValueError` rather than the previous more mysterious :exc:`AttributeError` (:issue:`9177`).
pt_pt: Chamar ``read`` ou ``write`` num *socket* SSL fechado agora lança uma exceção :exc:`ValueError` informativa, em vez do anterior e mais misterioso :exc:`AttributeError` (:issue:`9177`).
ru: Вызов ``read`` или ``write`` в закрытом сокете SSL теперь вызывает информативный :exc:`ValueError`, а не предыдущий, более загадочный :exc:`AttributeError` (:issue:`9177`).

source: :meth:`slice.indices` no longer produces an :exc:`OverflowError` for huge values. As a consequence of this fix, :meth:`slice.indices` now raises a :exc:`ValueError` if given a negative length; previously it returned nonsense values (:issue:`14794`).
pt_pt: O método :meth:`slice.indices` já não produz uma exceção :exc:`OverflowError` para valores muito grandes. Como consequência desta correção, :meth:`slice.indices` agora lança uma exceção :exc:`ValueError` se for fornecido um comprimento negativo; anteriormente, devolvia valores sem sentido (:issue:`14794`).
ru: :meth:`slice.indices` больше не выдает :exc:`OverflowError` для огромных значений. В результате этого исправления :meth:`slice.indices` теперь вызывает :exc:`ValueError`, если ему присвоена отрицательная длина; ранее он возвращал бессмысленные значения (:issue:`14794`).

source: The :class:`complex` constructor, unlike the :mod:`cmath` functions, was incorrectly accepting :class:`float` values if an object's ``__complex__`` special method returned one. This now raises a :exc:`TypeError`. (:issue:`16290`.)
pt_pt: O construtor :class:`complex`, ao contrário das funções do módulo :mod:`cmath`, estava incorretamente a aceitar valores :class:`float` se o método especial ``__complex__`` de um objeto devolvesse um. Agora lança uma exceção :exc:`TypeError`. (:issue:`16290`.)
ru: Конструктор :class:`complex`, в отличие от функций :mod:`cmath`, неправильно принимал значения :class:`float`, если специальный метод объекта ``__complex__`` возвращал их. Теперь это вызывает :exc:`TypeError`. (:issue:`16290`.)

source: The :class:`int` constructor in 3.2 and 3.3 erroneously accepts :class:`float` values for the *base* parameter. It is unlikely anyone was doing this, but if so, it will now raise a :exc:`TypeError` (:issue:`16772`).
pt_pt: O construtor :class:`int` nas versões 3.2 e 3.3 aceitava incorretamente valores :class:`float` para o parâmetro *base*. É improvável que alguém estivesse a fazer isto, mas, se assim for, agora lançará uma exceção :exc:`TypeError` (:issue:`16772`).
ru: Конструктор :class:`int` в версиях 3.2 и 3.3 ошибочно принимает значения :class:`float` для параметра *base*. Вряд ли кто-то это делал, но если это так, то теперь будет выдано :exc:`TypeError` (:issue:`16772`).

source: Defaults for keyword-only arguments are now evaluated *after* defaults for regular keyword arguments, instead of before. Hopefully no one wrote any code that depends on the previous buggy behavior (:issue:`16967`).
pt_pt: Os valores predefinidos para argumentos apenas por palavra-chave são agora avaliados *depois* dos valores predefinidos para argumentos regulares por palavra-chave, em vez de antes. Espera-se que ninguém tenha escrito código que dependa do comportamento errado anterior (:issue:`16967`).
ru: Значения по умолчанию для аргументов, содержащих только ключевые слова, теперь оцениваются *после* значений по умолчанию для обычных аргументов ключевых слов, а не до. Надеюсь, никто не написал кода, который зависит от предыдущего поведения ошибок (:issue:`16967`).

source: Stale thread states are now cleared after :func:`~os.fork`. This may cause some system resources to be released that previously were incorrectly kept perpetually alive (for example, database connections kept in thread-local storage). (:issue:`17094`.)
pt_pt: Estados de *threads* obsoletos são agora limpos após :func:`~os.fork`. Isto pode fazer com que alguns recursos do sistema sejam libertados que, anteriormente, eram incorretamente mantidos vivos perpetuamente (por exemplo, ligações a bases de dados mantidas em armazenamento local da *thread*). (:issue:`17094`.)
ru: Устаревшие состояния потоков теперь очищаются после :func:`~os.fork`. Это может привести к освобождению некоторых системных ресурсов, которые ранее неправильно поддерживались постоянно активными (например, соединения с базой данных, хранившиеся в локальном хранилище потоков). (:issue:`17094`.)

source: Parameter names in ``__annotations__`` dicts are now mangled properly, similarly to :attr:`~function.__kwdefaults__`. (Contributed by Yury Selivanov in :issue:`20625`.)
pt_pt: Os nomes dos parâmetros em dicionários ``__annotations__`` são agora corretamente mangados, de forma semelhante a :attr:`~function.__kwdefaults__`. (Contribuído por Yury Selivanov em :issue:`20625`.)
ru: Имена параметров в словарях ``__annotations__`` теперь корректно искажаются, аналогично :attr:`~function.__kwdefaults__`. (Добавлен Юрием Селивановым в :issue:`20625`.)

source: :attr:`hashlib.hash.name` now always returns the identifier in lower case. Previously some builtin hashes had uppercase names, but now that it is a formal public interface the naming has been made consistent (:issue:`18532`).
pt_pt: O atributo :attr:`hashlib.hash.name` agora devolve sempre o identificador em minúsculas. Anteriormente, alguns hashes integrados tinham nomes em maiúsculas, mas agora que é uma interface pública formal, a nomenclatura foi tornada consistente (:issue:`18532`).
ru: :attr:`hashlib.hash.name` теперь всегда возвращает идентификатор в нижнем регистре. Раньше некоторые встроенные хеши имели имена в верхнем регистре, но теперь, когда это формальный общедоступный интерфейс, имена стали согласованными (:issue:`18532`).

source: :mod:`unittest` now uses :mod:`argparse` for command line parsing. There are certain invalid command forms that used to work that are no longer allowed; in theory this should not cause backward compatibility issues since the disallowed command forms didn't make any sense and are unlikely to be in use.
pt_pt: O módulo :mod:`unittest` agora usa :mod:`argparse` para análise da linha de comandos. Existem certas formas de comando inválidas que funcionavam antes e que já não são permitidas; em teoria, isto não deve causar problemas de compatibilidade retroativa, uma vez que as formas de comando não permitidas não faziam sentido e é improvável que estejam em uso.
ru: :mod:`unittest` теперь использует :mod:`argparse` для анализа командной строки. Существуют определенные недопустимые формы команд, которые раньше работали, но которые больше не разрешены; теоретически это не должно вызывать проблем с обратной совместимостью, поскольку запрещенные формы команд не имеют никакого смысла и вряд ли будут использоваться.

source: The :func:`re.split`, :func:`re.findall`, and :func:`re.sub` functions, and the :meth:`~re.match.group` and :meth:`~re.match.groups` methods of ``match`` objects now always return a *bytes* object when the string to be matched is a :term:`bytes-like object`. Previously the return type matched the input type, so if your code was depending on the return value being, say, a ``bytearray``, you will need to change your code.
ru: Функции :func:`re.split`, :func:`re.findall` и :func:`re.sub`, а также :meth:`~re.match.group` и :meth:`~re Методы .match.groups объектов match теперь всегда возвращают объект *bytes*, если сопоставляемая строка является объектом, подобным :term:`bytes`. Раньше тип возвращаемого значения соответствовал типу ввода, поэтому, если ваш код зависел от возвращаемого значения, например, ``bytearray``, вам нужно будет изменить свой код.

source: :mod:`audioop` functions now raise an error immediately if passed string input, instead of failing randomly later on (:issue:`16685`).
ru: Функции :mod:`audioop` теперь немедленно выдают ошибку при передаче строкового ввода, а не в случайном порядке позже (:issue:`16685`).

source: The new *convert_charrefs* argument to :class:`~html.parser.HTMLParser` currently defaults to ``False`` for backward compatibility, but will eventually be changed to default to ``True``. It is recommended that you add this keyword, with the appropriate value, to any :class:`~html.parser.HTMLParser` calls in your code (:issue:`13633`).
pt_pt: O novo argumento *convert_charrefs* de :class:`~html.parser.HTMLParser` atualmente tem o valor predefinido ``False`` para compatibilidade retroativa, mas eventualmente será alterado para ter o valor predefinido ``True``. Recomenda-se que adicione esta palavra-chave, com o valor apropriado, a quaisquer chamadas de :class:`~html.parser.HTMLParser` no seu código (:issue:`13633`).
ru: Новый аргумент *convert_charrefs* для :class:`~html.parser.HTMLParser` в настоящее время по умолчанию имеет значение ``False`` для обратной совместимости, но со временем будет изменен на ``True``. Рекомендуется добавлять это ключевое слово с соответствующим значением ко всем вызовам :class:`~html.parser.HTMLParser` в вашем коде (:issue:`13633`).

source: Since the *digestmod* argument to the :func:`hmac.new` function will in the future have no default, all calls to :func:`hmac.new` should be changed to explicitly specify a *digestmod* (:issue:`17276`).
pt_pt: Como o argumento *digestmod* da função :func:`hmac.new` não terá um valor predefinido no futuro, todas as chamadas a :func:`hmac.new` devem ser alteradas para especificar explicitamente um *digestmod* (:issue:`17276`).
ru: Поскольку аргумент *digestmod* функции :func:`hmac.new` в будущем не будет иметь значения по умолчанию, все вызовы :func:`hmac.new` должны быть изменены, чтобы явно указать *digestmod* (:issue: `17276`).

source: Calling :func:`sysconfig.get_config_var` with the ``SO`` key, or looking ``SO`` up in the results of a call to :func:`sysconfig.get_config_vars` is deprecated. This key should be replaced by ``EXT_SUFFIX`` or ``SHLIB_SUFFIX``, depending on the context (:issue:`19555`).
pt_pt: Chamar :func:`sysconfig.get_config_var` com a chave ``SO``, ou procurar por ``SO`` nos resultados de uma chamada a :func:`sysconfig.get_config_vars`, está obsoleto. Esta chave deve ser substituída por ``EXT_SUFFIX`` ou ``SHLIB_SUFFIX``, dependendo do contexto (:issue:`19555`).
ru: Вызов :func:`sysconfig.get_config_var` с ключом ``SO`` или поиск ``SO`` в результатах вызова :func:`sysconfig.get_config_vars` считается устаревшим. Этот ключ следует заменить на EXT_SUFFIX или SHLIB_SUFFIX, в зависимости от контекста (:issue:`19555`).

source: Any calls to ``open`` functions that specify ``U`` should be modified. ``U`` is ineffective in Python3 and will eventually raise an error if used. Depending on the function, the equivalent of its old Python2 behavior can be achieved using either a *newline* argument, or if necessary by wrapping the stream in :mod:`~io.TextIOWrapper` to use its *newline* argument (:issue:`15204`).
pt_pt: Quaisquer chamadas a funções ``open`` que especifiquem ``U`` devem ser modificadas. ``U`` é ineficaz no Python 3 e eventualmente lançará um erro se usado. Dependendo da função, o equivalente do seu antigo comportamento no Python 2 pode ser alcançado usando um argumento *newline*, ou, se necessário, envolvendo o fluxo em :mod:`~io.TextIOWrapper` para usar o seu argumento *newline* (:issue:`15204`).
ru: Любые вызовы функций ``open``, которые указывают ``U``, должны быть изменены. ``U`` неэффективен в Python3 и в конечном итоге вызовет ошибку, если его использовать. В зависимости от функции эквивалент ее старого поведения Python2 может быть достигнут с использованием аргумента *newline* или, если необходимо, обертыванием потока в :mod:`~io.TextIOWrapper` для использования его аргумента *newline* (:issue :`15204`).

source: If you use ``pyvenv`` in a script and desire that pip *not* be installed, you must add ``--without-pip`` to your command invocation.
pt_pt: Se usar ``pyvenv`` num script e não desejar que o pip seja instalado, deve adicionar ``--without-pip`` à invocação do comando.
ru: Если вы используете ``pyvenv`` в скрипте и хотите, чтобы pip *not* был установлен, вы должны добавить ``--without-pip`` к вызову команды.

source: The default behavior of :func:`json.dump` and :func:`json.dumps` when an indent is specified has changed: it no longer produces trailing spaces after the item separating commas at the ends of lines. This will matter only if you have tests that are doing white-space-sensitive comparisons of such output (:issue:`16333`).
pt_pt: O comportamento predefinido de :func:`json.dump` e :func:`json.dumps` quando é especificado um recuo foi alterado: já não produz espaços finais após as vírgulas que separam itens no final das linhas. Isto só será relevante se tiver testes que façam comparações sensíveis a espaços em branco dessa saída (:issue:`16333`).
ru: Поведение по умолчанию :func:`json.dump` и :func:`json.dumps` при указании отступа изменилось: больше не создаются конечные пробелы после элемента, разделяющие запятые на концах строк. Это будет иметь значение только в том случае, если у вас есть тесты, которые выполняют сравнение таких выходных данных с учетом пробелов (:issue:`16333`).
