Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: New :func:`~re.fullmatch` function and :meth:`.regex.fullmatch` method anchor the pattern at both ends of the string to match. This provides a way to be explicit about the goal of the match, which avoids a class of subtle bugs where ``$`` characters get lost during code changes or the addition of alternatives to an existing regular expression. (Contributed by Matthew Barnett in :issue:`16203`.)
ru: Новая функция :func:`~re.fullmatch` и метод :meth:`.regex.fullmatch` закрепляют шаблон на обоих концах совпадающей строки. Это дает возможность явно указать цель сопоставления, что позволяет избежать класса тонких ошибок, когда символы ``$`` теряются во время изменений кода или добавления альтернатив к существующему регулярному выражению. (Предоставлено Мэтью Барнеттом в :issue:`16203`.)

source: The repr of :ref:`regex objects <re-objects>` now includes the pattern and the flags; the repr of :ref:`match objects <match-objects>` now includes the start, end, and the part of the string that matched. (Contributed by Hugo Lopes Tavares and Serhiy Storchaka in :issue:`13592` and :issue:`17087`.)
pt_pt: A representação de :ref:`objetos regex <re-objects>` agora inclui o padrão e as *flags*; a representação de :ref:`objetos de correspondência <match-objects>` agora inclui o início, o fim e a parte da *string* que correspondeu. (Contribuído por Hugo Lopes Tavares e Serhiy Storchaka em :issue:`13592` e :issue:`17087`.)
ru: Воспроизведение :ref:`regex объектов <re-objects>` теперь включает в себя шаблон и флаги; воспроизведение :ref:`matchobjects <match-objects>` теперь включает начало, конец и часть совпавшей строки. (Предоставлено Уго Лопесом Таваресом и Сергеем Сторчакой в ​​:issue:`13592` и :issue:`17087`.)

source: resource
ru: ресурс

source: New :func:`~resource.prlimit` function, available on Linux platforms with a kernel version of 2.6.36 or later and glibc of 2.13 or later, provides the ability to query or set the resource limits for processes other than the one making the call. (Contributed by Christian Heimes in :issue:`16595`.)
pt_pt: Nova função :func:`~resource.prlimit`, disponível em plataformas Linux com uma versão de núcleo de 2.6.36 ou posterior e glibc de 2.13 ou posterior, fornece a capacidade de consultar ou definir os limites de recursos para processos diferentes daquele que faz a chamada. (Contribuído por Christian Heimes em :issue:`16595`.)
ru: Новая функция :func:`~resource.prlimit`, доступная на платформах Linux с версией ядра 2.6.36 или новее и glibc 2.13 или новее, предоставляет возможность запрашивать или устанавливать ограничения ресурсов для процессов, отличных от того, который создает звонок. (Предоставлено Кристианом Хаймсом в :issue:`16595`.)

source: On Linux kernel version 2.6.36 or later, there are also some new Linux specific constants: :const:`~resource.RLIMIT_MSGQUEUE`, :const:`~resource.RLIMIT_NICE`, :const:`~resource.RLIMIT_RTPRIO`, :const:`~resource.RLIMIT_RTTIME`, and :const:`~resource.RLIMIT_SIGPENDING`. (Contributed by Christian Heimes in :issue:`19324`.)
pt_pt: Na versão do núcleo Linux 2.6.36 ou posterior, também existem algumas novas constantes específicas do Linux: :const:`~resource.RLIMIT_MSGQUEUE`, :const:`~resource.RLIMIT_NICE`, :const:`~resource.RLIMIT_RTPRIO`, :const:`~resource.RLIMIT_RTTIME` e :const:`~resource.RLIMIT_SIGPENDING`. (Contribuído por Christian Heimes em :issue:`19324`.)
ru: В ядре Linux версии 2.6.36 или новее также появились некоторые новые константы, специфичные для Linux: :const:`~resource.RLIMIT_MSGQUEUE`, :const:`~resource.RLIMIT_NICE`, :const:`~resource.RLIMIT_RTPRIO`, : const:`~resource.RLIMIT_RTTIME` и :const:`~resource.RLIMIT_SIGPENDING`. (Предоставлено Кристианом Хаймсом в :issue:`19324`.)

source: On FreeBSD version 9 and later, there some new FreeBSD specific constants: :const:`~resource.RLIMIT_SBSIZE`, :const:`~resource.RLIMIT_SWAP`, and :const:`~resource.RLIMIT_NPTS`. (Contributed by Claudiu Popa in :issue:`19343`.)
pt_pt: Na versão 9 ou posterior do FreeBSD, existem algumas novas constantes específicas do FreeBSD: :const:`~resource.RLIMIT_SBSIZE`, :const:`~resource.RLIMIT_SWAP` e :const:`~resource.RLIMIT_NPTS`. (Contribuído por Claudiu Popa em :issue:`19343`.)
ru: В FreeBSD версии 9 и более поздних версиях появилось несколько новых констант, специфичных для FreeBSD: :const:`~resource.RLIMIT_SBSIZE`, :const:`~resource.RLIMIT_SWAP` и :const:`~resource.RLIMIT_NPTS`. (Предоставлено Клаудиу Попа в :issue:`19343`.)

source: :class:`~select.epoll` objects now support the context management protocol. When used in a :keyword:`with` statement, the :meth:`~select.epoll.close` method will be called automatically at the end of the block. (Contributed by Serhiy Storchaka in :issue:`16488`.)
pt_pt: Os objetos :class:`~select.epoll` agora suportam o protocolo de gestão de contexto. Quando usados numa instrução :keyword:`with`, o método :meth:`~select.epoll.close` será chamado automaticamente no final do bloco. (Contribuído por Serhiy Storchaka em :issue:`16488`.)
ru: Объекты :class:`~select.epoll` теперь поддерживают протокол управления контекстом. При использовании в операторе :keyword:`with` метод :meth:`~select.epoll.close` будет вызываться автоматически в конце блока. (Предоставлено Сергеем Сторчакой в ​​:issue:`16488`.)

source: :class:`~select.devpoll` objects now have :meth:`~select.devpoll.fileno` and :meth:`~select.devpoll.close` methods, as well as a new attribute :attr:`~select.devpoll.closed`. (Contributed by Victor Stinner in :issue:`18794`.)
pt_pt: Os objetos :class:`~select.devpoll` agora têm métodos :meth:`~select.devpoll.fileno` e :meth:`~select.devpoll.close`, bem como um novo atributo :attr:`~select.devpoll.closed`. (Contribuído por Victor Stinner em :issue:`18794`.)
ru: Объекты :class:`~select.devpoll` теперь имеют методы :meth:`~select.devpoll.fileno` и :meth:`~select.devpoll.close`, а также новый атрибут :attr:`~select. devpoll.закрытый`. (Предоставлено Виктором Стиннером в :issue:`18794`.)

source: shelve
ru: полка

source: :class:`~shelve.Shelf` instances may now be used in :keyword:`with` statements, and will be automatically closed at the end of the :keyword:`!with` block. (Contributed by Filip Gruszczyński in :issue:`13896`.)
pt_pt: As instâncias de :class:`~shelve.Shelf` agora podem ser usadas em instruções :keyword:`with` e serão automaticamente fechadas no final do bloco :keyword:`!with`. (Contribuído por Filip Gruszczyński em :issue:`13896`.)
ru: Экземпляры :class:`~shelve.Shelf` теперь можно использовать в операторах :keyword:`with` и будут автоматически закрываться в конце блока :keyword:`!with`. (Предоставлено Филипом Грущиньским в :issue:`13896`.)

source: :func:`~shutil.copyfile` now raises a specific :exc:`~shutil.Error` subclass, :exc:`~shutil.SameFileError`, when the source and destination are the same file, which allows an application to take appropriate action on this specific error. (Contributed by Atsuo Ishimoto and Hynek Schlawack in :issue:`1492704`.)
pt_pt: A função :func:`~shutil.copyfile` agora levanta uma subclasse específica de :exc:`~shutil.Error`, :exc:`~shutil.SameFileError`, quando a origem e o destino são o mesmo ficheiro, o que permite que uma aplicação tome a ação apropriada neste erro específico. (Contribuído por Atsuo Ishimoto e Hynek Schlawack em :issue:`1492704`.)
ru: :func:`~shutil.copyfile` теперь вызывает конкретный подкласс :exc:`~shutil.Error`, :exc:`~shutil.SameFileError`, когда источником и местом назначения являются один и тот же файл, что позволяет приложению принимать соответствующие действия в отношении этой конкретной ошибки. (Предоставлено Ацуо Ишимото и Хайнеком Шлаваком в :issue:`1492704`.)

source: :exc:`~smtplib.SMTPException` is now a subclass of :exc:`OSError`, which allows both socket level errors and SMTP protocol level errors to be caught in one try/except statement by code that only cares whether or not an error occurred. (Contributed by Ned Jackson Lovely in :issue:`2118`.)
pt_pt: :exc:`~smtplib.SMTPException` é agora uma subclasse de :exc:`OSError`, o que permite que erros a nível de *socket* e erros a nível do protocolo SMTP sejam capturados numa única instrução try/except por código que só precisa de saber se ocorreu um erro. (Contribuído por Ned Jackson Lovely em :issue:`2118`.)
ru: :exc:`~smtplib.SMTPException` теперь является подклассом :exc:`OSError`, который позволяет перехватывать как ошибки уровня сокета, так и ошибки уровня протокола SMTP в одном операторе try/Exception с помощью кода, который заботится только о том, была ли произошла ошибка. (Предоставлено Недом Джексоном Лавли в :issue:`2118`.)

source: socket
ru: сокет

source: The socket module now supports the :const:`~socket.CAN_BCM` protocol on platforms that support it. (Contributed by Brian Thorne in :issue:`15359`.)
pt_pt: O módulo socket agora suporta o protocolo :const:`~socket.CAN_BCM` em plataformas que o suportam. (Contribuído por Brian Thorne em :issue:`15359`.)
ru: Модуль сокета теперь поддерживает протокол :const:`~socket.CAN_BCM` на платформах, которые его поддерживают. (Предоставлено Брайаном Торном в :issue:`15359`.)

source: Socket objects have new methods to get or set their :ref:`inheritable flag <fd_inheritance>`, :meth:`~socket.socket.get_inheritable` and :meth:`~socket.socket.set_inheritable`.
pt_pt: Os objetos socket têm novos métodos para obter ou definir a sua :ref:`flag de hereditariedade <fd_inheritance>`, :meth:`~socket.socket.get_inheritable` e :meth:`~socket.socket.set_inheritable`.
ru: У объектов сокетов появились новые методы для получения или установки их :ref:`наследуемого флага <fd_inheritance>`, :meth:`~socket.socket.get_inheritable` и :meth:`~socket.socket.set_inheritable`.

source: The ``socket.AF_*`` and ``socket.SOCK_*`` constants are now enumeration values using the new :mod:`enum` module. This allows meaningful names to be printed during debugging, instead of integer "magic numbers".
pt_pt: As constantes ``socket.AF_*`` e ``socket.SOCK_*`` são agora valores de enumeração que usam o novo módulo :mod:`enum`. Isto permite que nomes significativos sejam impressos durante a depuração, em vez de números "mágicos" inteiros.
ru: Константы ``socket.AF_*`` и ``socket.SOCK_*`` теперь являются значениями перечисления с использованием нового модуля :mod:`enum`. Это позволяет печатать осмысленные имена во время отладки вместо целых «магических чисел».

source: The :const:`~socket.AF_LINK` constant is now available on BSD and OSX.
pt_pt: A constante :const:`~socket.AF_LINK` está agora disponível em BSD e OSX.
ru: Константа :const:`~socket.AF_LINK` теперь доступна в BSD и OSX.

source: :func:`~socket.inet_pton` and :func:`~socket.inet_ntop` are now supported on Windows. (Contributed by Atsuo Ishimoto in :issue:`7171`.)
pt_pt: As funções :func:`~socket.inet_pton` e :func:`~socket.inet_ntop` estão agora suportadas no Windows. (Contribuído por Atsuo Ishimoto em :issue:`7171`.)
ru: :func:`~socket.inet_pton` и :func:`~socket.inet_ntop` теперь поддерживаются в Windows. (Предоставлено Ацуо Ишимото в :issue:`7171`.)

source: A new boolean parameter to the :func:`~sqlite3.connect` function, *uri*, can be used to indicate that the *database* parameter is a ``uri`` (see the `SQLite URI documentation <https://www.sqlite.org/uri.html>`_). (Contributed by poq in :issue:`13773`.)
pt_pt: Um novo parâmetro booleano na função :func:`~sqlite3.connect`, *uri*, pode ser usado para indicar que o parâmetro *database* é um ``uri`` (consulte a `documentação de URI do SQLite <https://www.sqlite.org/uri.html>`_). (Contribuído por poq em :issue:`13773`.)
ru: Новый логический параметр функции :func:`~sqlite3.connect`, *uri*, можно использовать для указания того, что параметр *database* является ``uri`` (см. документацию ``SQLite URI'` <https:/ /www.sqlite.org/uri.html>`_). (Внесено пользователем poq в :issue:`13773`.)

source: :data:`~ssl.PROTOCOL_TLSv1_1` and :data:`~ssl.PROTOCOL_TLSv1_2` (TLSv1.1 and TLSv1.2 support) have been added; support for these protocols is only available if Python is linked with OpenSSL 1.0.1 or later. (Contributed by Michele Orrù and Antoine Pitrou in :issue:`16692`.)
pt_pt: Foram adicionados :data:`~ssl.PROTOCOL_TLSv1_1` e :data:`~ssl.PROTOCOL_TLSv1_2` (suporte para TLSv1.1 e TLSv1.2); o suporte para estes protocolos só está disponível se o Python estiver ligado ao OpenSSL 1.0.1 ou posterior. (Contribuído por Michele Orrù e Antoine Pitrou em :issue:`16692`.)
ru: добавлены :data:`~ssl.PROTOCOL_TLSv1_1` и :data:`~ssl.PROTOCOL_TLSv1_2` (поддержка TLSv1.1 и TLSv1.2); поддержка этих протоколов доступна только в том случае, если Python связан с OpenSSL 1.0.1 или более поздней версии. (Предоставлено Мишелем Орру и Антуаном Питру в :issue:`16692`.)

source: New function :func:`~ssl.create_default_context` provides a standard way to obtain an :class:`~ssl.SSLContext` whose settings are intended to be a reasonable balance between compatibility and security. These settings are more stringent than the defaults provided by the :class:`~ssl.SSLContext` constructor, and may be adjusted in the future, without prior deprecation, if best-practice security requirements change. The new recommended best practice for using stdlib libraries that support SSL is to use :func:`~ssl.create_default_context` to obtain an :class:`~ssl.SSLContext` object, modify it if needed, and then pass it as the *context* argument of the appropriate stdlib API. (Contributed by Christian Heimes in :issue:`19689`.)
pt_pt: A nova função :func:`~ssl.create_default_context` fornece uma forma padrão de obter um :class:`~ssl.SSLContext` cujas definições pretendem ser um equilíbrio razoável entre compatibilidade e segurança. Estas definições são mais rigorosas do que as predefinições fornecidas pelo construtor :class:`~ssl.SSLContext`, e podem ser ajustadas no futuro, sem aviso prévio de descontinuação, se os requisitos de segurança de melhores práticas mudarem. A nova prática recomendada para usar bibliotecas stdlib que suportam SSL é usar :func:`~ssl.create_default_context` para obter um objeto :class:`~ssl.SSLContext`, modificá-lo se necessário, e depois passá-lo como argumento *context* da API apropriada da stdlib. (Contribuído por Christian Heimes em :issue:`19689`.)
ru: Новая функция :func:`~ssl.create_default_context` предоставляет стандартный способ получения :class:`~ssl.SSLContext`, настройки которого предназначены для обеспечения разумного баланса между совместимостью и безопасностью. Эти настройки более строгие, чем значения по умолчанию, предоставляемые конструктором :class:`~ssl.SSLContext`, и могут быть скорректированы в будущем без предварительного прекращения поддержки, если изменятся передовые требования безопасности. Новая рекомендуемая лучшая практика использования библиотек stdlib, поддерживающих SSL, — использовать :func:`~ssl.create_default_context` для получения объекта :class:`~ssl.SSLContext`, изменить его при необходимости и затем передать как * аргумент context* соответствующего API stdlib. (Предоставлено Кристианом Хаймсом в :issue:`19689`.)

source: :class:`~ssl.SSLContext` method :meth:`~ssl.SSLContext.load_verify_locations` accepts a new optional argument *cadata*, which can be used to provide PEM or DER encoded certificates directly via strings or bytes, respectively. (Contributed by Christian Heimes in :issue:`18138`.)
pt_pt: O método :meth:`~ssl.SSLContext.load_verify_locations` da classe :class:`~ssl.SSLContext` aceita um novo argumento opcional *cadata*, que pode ser usado para fornecer certificados codificados em PEM ou DER diretamente através de strings ou bytes, respetivamente. (Contribuído por Christian Heimes em :issue:`18138`.)
ru: :class:`~ssl.SSLContext` Метод :meth:`~ssl.SSLContext.load_verify_locations` принимает новый необязательный аргумент *cadata*, который можно использовать для предоставления сертификатов в кодировке PEM или DER напрямую через строки или байты соответственно. (Предоставлено Кристианом Хаймсом в :issue:`18138`.)

source: New function :func:`~ssl.get_default_verify_paths` returns a named tuple of the paths and environment variables that the :meth:`~ssl.SSLContext.set_default_verify_paths` method uses to set OpenSSL's default ``cafile`` and ``capath``. This can be an aid in debugging default verification issues. (Contributed by Christian Heimes in :issue:`18143`.)
pt_pt: A nova função :func:`~ssl.get_default_verify_paths` devolve um *named tuple* com os caminhos e variáveis de ambiente que o método :meth:`~ssl.SSLContext.set_default_verify_paths` usa para definir os ``cafile`` e ``capath`` predefinidos do OpenSSL. Isto pode ser útil na depuração de problemas de verificação predefinida. (Contribuído por Christian Heimes em :issue:`18143`.)
ru: Новая функция :func:`~ssl.get_default_verify_paths` возвращает именованный кортеж путей и переменных среды, которые метод :meth:`~ssl.SSLContext.set_default_verify_paths` использует для установки ``cafile`` и ``capath` OpenSSL по умолчанию. `. Это может помочь в устранении проблем с проверкой по умолчанию. (Предоставлено Кристианом Хаймсом в :issue:`18143`.)

source: :class:`~ssl.SSLContext` has a new method, :meth:`~ssl.SSLContext.cert_store_stats`, that reports the number of loaded ``X.509`` certs, ``X.509 CA`` certs, and certificate revocation lists (``crl``\ s), as well as a :meth:`~ssl.SSLContext.get_ca_certs` method that returns a list of the loaded ``CA`` certificates. (Contributed by Christian Heimes in :issue:`18147`.)
pt_pt: A classe :class:`~ssl.SSLContext` tem um novo método, :meth:`~ssl.SSLContext.cert_store_stats`, que reporta o número de certificados ``X.509`` carregados, certificados ``X.509 CA``, e listas de revogação de certificados (``crl``), bem como um método :meth:`~ssl.SSLContext.get_ca_certs` que devolve uma lista dos certificados ``CA`` carregados. (Contribuído por Christian Heimes em :issue:`18147`.)
ru: :class:`~ssl.SSLContext` имеет новый метод :meth:`~ssl.SSLContext.cert_store_stats`, который сообщает количество загруженных сертификатов ``X.509``, сертификатов ``X.509 CA``. и списки отзыва сертификатов (``crl``\ s), а также метод :meth:`~ssl.SSLContext.get_ca_certs`, который возвращает список загруженных сертификатов ``CA``. (Предоставлено Кристианом Хаймсом в :issue:`18147`.)

source: If OpenSSL 0.9.8 or later is available, :class:`~ssl.SSLContext` has a new attribute :attr:`~ssl.SSLContext.verify_flags` that can be used to control the certificate verification process by setting it to some combination of the new constants :const:`~ssl.VERIFY_DEFAULT`, :const:`~ssl.VERIFY_CRL_CHECK_LEAF`, :const:`~ssl.VERIFY_CRL_CHECK_CHAIN`, or :const:`~ssl.VERIFY_X509_STRICT`. OpenSSL does not do any CRL verification by default. (Contributed by Christien Heimes in :issue:`8813`.)
pt_pt: Se o OpenSSL 0.9.8 ou posterior estiver disponível, a classe :class:`~ssl.SSLContext` tem um novo atributo :attr:`~ssl.SSLContext.verify_flags` que pode ser usado para controlar o processo de verificação de certificados, definindo-o como uma combinação das novas constantes :const:`~ssl.VERIFY_DEFAULT`, :const:`~ssl.VERIFY_CRL_CHECK_LEAF`, :const:`~ssl.VERIFY_CRL_CHECK_CHAIN`, ou :const:`~ssl.VERIFY_X509_STRICT`. O OpenSSL não faz qualquer verificação CRL por predefinição. (Contribuído por Christien Heimes em :issue:`8813`.)
ru: Если доступен OpenSSL 0.9.8 или новее, :class:`~ssl.SSLContext` имеет новый атрибут :attr:`~ssl.SSLContext.verify_flags`, который можно использовать для управления процессом проверки сертификата, установив для него некоторую комбинацию новых констант :const:`~ssl.VERIFY_DEFAULT`, :const:`~ssl.VERIFY_CRL_CHECK_LEAF`, :const:`~ssl.VERIFY_CRL_CHECK_CHAIN` или :const:`~ssl.VERIFY_X509_STRICT`. OpenSSL по умолчанию не выполняет проверку CRL. (Предоставлено Кристианом Хаймсом в :issue:`8813`.)

source: New :class:`~ssl.SSLContext` method :meth:`~ssl.SSLContext.load_default_certs` loads a set of default "certificate authority" (CA) certificates from default locations, which vary according to the platform. It can be used to load both TLS web server authentication certificates (``purpose=``:data:`~ssl.Purpose.SERVER_AUTH`) for a client to use to verify a server, and certificates for a server to use in verifying client certificates (``purpose=``:data:`~ssl.Purpose.CLIENT_AUTH`). (Contributed by Christian Heimes in :issue:`19292`.)
pt_pt: O novo método :meth:`~ssl.SSLContext.load_default_certs` da classe :class:`~ssl.SSLContext` carrega um conjunto de certificados de "autoridade de certificação" (CA) predefinidos a partir de locais predefinidos, que variam consoante a plataforma. Pode ser usado para carregar certificados de autenticação de servidores web TLS (``purpose=``:data:`~ssl.Purpose.SERVER_AUTH`) para um cliente usar na verificação de um servidor, e certificados para um servidor usar na verificação de certificados de clientes (``purpose=``:data:`~ssl.Purpose.CLIENT_AUTH`). (Contribuído por Christian Heimes em :issue:`19292`.)
ru: Новый метод :class:`~ssl.SSLContext` :meth:`~ssl.SSLContext.load_default_certs` загружает набор сертификатов «центра сертификации» (CA) по умолчанию из мест по умолчанию, которые различаются в зависимости от платформы. Его можно использовать для загрузки как сертификатов аутентификации веб-сервера TLS (``member=``:data:`~ssl.Purpose.SERVER_AUTH`), которые клиент будет использовать для проверки сервера, так и сертификатов, которые сервер будет использовать при проверке. клиентские сертификаты (``member=``:data:`~ssl.Purpose.CLIENT_AUTH`). (Предоставлено Кристианом Хаймсом в :issue:`19292`.)

source: Two new windows-only functions, :func:`~ssl.enum_certificates` and :func:`~ssl.enum_crls` provide the ability to retrieve certificates, certificate information, and CRLs from the Windows cert store. (Contributed by Christian Heimes in :issue:`17134`.)
pt_pt: Duas novas funções exclusivas do Windows, :func:`~ssl.enum_certificates` e :func:`~ssl.enum_crls`, permitem recuperar certificados, informações de certificados e CRLs da loja de certificados do Windows. (Contribuído por Christian Heimes em :issue:`17134`.)
ru: Две новые функции только для Windows, :func:`~ssl.enum_certificates` и :func:`~ssl.enum_crls`, предоставляют возможность получать сертификаты, информацию о сертификатах и ​​списки отзыва сертификатов из хранилища сертификатов Windows. (Предоставлено Кристианом Хаймсом в :issue:`17134`.)

source: Support for server-side SNI (Server Name Indication) using the new :meth:`ssl.SSLContext.set_servername_callback` method. (Contributed by Daniel Black in :issue:`8109`.)
pt_pt: Suporte para SNI (Server Name Indication) do lado do servidor usando o novo método :meth:`ssl.SSLContext.set_servername_callback`. (Contribuído por Daniel Black em :issue:`8109`.)
ru: Поддержка SNI на стороне сервера (указание имени сервера) с использованием нового метода :meth:`ssl.SSLContext.set_servername_callback`. (Предоставлено Дэниелом Блэком в :issue:`8109`.)

source: The dictionary returned by :meth:`.SSLSocket.getpeercert` contains additional ``X509v3`` extension items: ``crlDistributionPoints``, ``calIssuers``, and ``OCSP`` URIs. (Contributed by Christian Heimes in :issue:`18379`.)
pt_pt: O dicionário devolvido por :meth:`.SSLSocket.getpeercert` contém itens adicionais da extensão ``X509v3``: ``crlDistributionPoints``, ``calIssuers``, e URIs ``OCSP``. (Contribuído por Christian Heimes em :issue:`18379`.)
ru: Словарь, возвращаемый :meth:`.SSLSocket.getpeercert`, содержит дополнительные элементы расширения ``X509v3``: ``crlDistributionPoints``, ``calIssuers`` и ``OCSP`` URI. (Предоставлено Кристианом Хаймсом в :issue:`18379`.)
