Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: :mod:`doctest` now looks for doctests in extension module ``__doc__`` strings, so if your doctest test discovery includes extension modules that have things that look like doctests in them you may see test failures you've never seen before when running your tests (:issue:`3158`).
pt_pt: O módulo :mod:`doctest` agora procura por *doctests* em strings ``__doc__`` de módulos de extensão, por isso, se a descoberta de testes *doctest* incluir módulos de extensão que tenham elementos que pareçam *doctests*, pode ver falhas de teste que nunca viu antes ao executar os seus testes (:issue:`3158`).
ru: :mod:`doctest` теперь ищет доктесты в строках модуля расширения ``__doc__``, поэтому, если ваше обнаружение теста доктеста включает в себя модули расширения, в которых есть что-то похожее на доктесты, вы можете увидеть сбои тестов, которых вы никогда раньше не видели, когда запуск тестов (:issue:`3158`).

source: The :mod:`collections.abc` module has been slightly refactored as part of the Python startup improvements. As a consequence of this, it is no longer the case that importing :mod:`collections` automatically imports :mod:`collections.abc`. If your program depended on the (undocumented) implicit import, you will need to add an explicit ``import collections.abc`` (:issue:`20784`).
pt_pt: O módulo :mod:`collections.abc` foi ligeiramente refatorado como parte das melhorias de inicialização do Python. Como consequência, já não é verdade que importar :mod:`collections` importa automaticamente :mod:`collections.abc`. Se o seu programa dependia da importação implícita (não documentada), terá de adicionar uma importação explícita ``import collections.abc`` (:issue:`20784`).
ru: Модуль :mod:`collections.abc` был немного переработан в рамках улучшения запуска Python. Как следствие этого, импорт :mod:`collections` больше не приводит к автоматическому импорту :mod:`collections.abc`. Если ваша программа зависит от (недокументированного) неявного импорта, вам нужно будет добавить явный импорт коллекций.abc (:issue:`20784`).

source: Changes in the C API
pt_pt: Alterações na API C
ru: Изменения в C API

source: :c:func:`PyEval_EvalFrameEx`, :c:func:`PyObject_Repr`, and :c:func:`PyObject_Str`, along with some other internal C APIs, now include a debugging assertion that ensures they are not used in situations where they may silently discard a currently active exception. In cases where discarding the active exception is expected and desired (for example, because it has already been saved locally with :c:func:`PyErr_Fetch` or is being deliberately replaced with a different exception), an explicit :c:func:`PyErr_Clear` call will be needed to avoid triggering the assertion when invoking these operations (directly or indirectly) and running against a version of Python that is compiled with assertions enabled.
pt_pt: As funções :c:func:`PyEval_EvalFrameEx`, :c:func:`PyObject_Repr` e :c:func:`PyObject_Str`, juntamente com algumas outras APIs internas em C, agora incluem uma afirmação de depuração que garante que não são usadas em situações em que possam descartar silenciosamente uma exceção ativamente ativa. Em casos em que o descarte da exceção ativa é esperado e desejado (por exemplo, porque já foi guardada localmente com :c:func:`PyErr_Fetch` ou está a ser deliberadamente substituída por uma exceção diferente), será necessária uma chamada explícita a :c:func:`PyErr_Clear` para evitar o disparo da afirmação ao invocar estas operações (direta ou indiretamente) e ao executar contra uma versão do Python compilada com afirmações ativadas.
ru: :c:func:`PyEval_EvalFrameEx`, :c:func:` PyObj ect_Repr` и :c:func:` PyObj ect_Str`, а также некоторые другие внутренние API C теперь включают утверждение отладки, гарантирующее, что они не будут использоваться в ситуации, когда они могут молча отбросить активное в данный момент исключение. В случаях, когда ожидается и желательно отбрасывание активного исключения (например, потому что оно уже было сохранено локально с помощью :c:func:`PyErr_Fetch` или намеренно заменяется другим исключением), явное :c:func:` Вызов PyErr_Clear` понадобится, чтобы избежать срабатывания утверждения при вызове этих операций (прямо или косвенно) и запуске версии Python, скомпилированной с включенными утверждениями.

source: :c:func:`PyErr_SetImportError` now sets :exc:`TypeError` when its **msg** argument is not set. Previously only ``NULL`` was returned with no exception set.
pt_pt: A função :c:func:`PyErr_SetImportError` agora define :exc:`TypeError` quando o seu argumento **msg** não está definido. Anteriormente, apenas ``NULL`` era devolvido sem nenhuma exceção definida.
ru: :c:func:`PyErr_SetImportError` теперь устанавливает :exc:`TypeError`, когда его аргумент **msg** не установлен. Раньше возвращалось только ``NULL`` без каких-либо исключений.

source: The result of the :c:data:`PyOS_ReadlineFunctionPointer` callback must now be a string allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, or ``NULL`` if an error occurred, instead of a string allocated by :c:func:`PyMem_Malloc` or :c:func:`PyMem_Realloc` (:issue:`16742`)
pt_pt: O resultado da função de retorno de chamada :c:data:`PyOS_ReadlineFunctionPointer` deve agora ser uma string alocada por :c:func:`PyMem_RawMalloc` ou :c:func:`PyMem_RawRealloc`, ou ``NULL`` se ocorrer um erro, em vez de uma string alocada por :c:func:`PyMem_Malloc` ou :c:func:`PyMem_Realloc` (:issue:`16742`).
ru: Результатом обратного вызова :c:data:`PyOS_ReadlineFunctionPointer` теперь должна быть строка, выделенная :c:func:`PyMem_RawMalloc` или :c:func:`PyMem_RawRealloc`, или ``NULL``, если произошла ошибка. строки, выделенной :c:func:`PyMem_Malloc` или :c:func:`PyMem_Realloc` (:issue:`16742`)

source: :c:func:`PyThread_set_key_value` now always set the value. In Python 3.3, the function did nothing if the key already exists (if the current value is a non-``NULL`` pointer).
pt_pt: A função :c:func:`PyThread_set_key_value` agora define sempre o valor. No Python 3.3, a função não fazia nada se a chave já existisse (se o valor atual fosse um ponteiro não-``NULL``).
ru: :c:func:`PyThread_set_key_value` теперь всегда устанавливает значение. В Python 3.3 функция ничего не делала, если ключ уже существует (если текущее значение не является указателем NULL).

source: The ``f_tstate`` (thread state) field of the :c:type:`PyFrameObject` structure has been removed to fix a bug: see :issue:`14432` for the rationale.
pt_pt: O campo ``f_tstate`` (estado da *thread*) da estrutura :c:type:`PyFrameObject` foi removido para corrigir um erro; consulte :issue:`14432` para a justificação.
ru: Поле ``f_tstate`` (состояние потока) структуры :c:type:`PyFrameObject` было удалено, чтобы исправить ошибку: обоснование см. в :issue:`14432`.

source: Changed in 3.4.3
pt_pt: Alterado na versão 3.4.3
ru: Изменения в версии 3.4.3

source: PEP 476: Enabling certificate verification by default for stdlib http clients
pt_pt: PEP 476: Ativar a verificação de certificados por predefinição para clientes http da biblioteca padrão
ru: PEP 476: включение проверки сертификата по умолчанию для http-клиентов stdlib

source: :mod:`http.client` and modules which use it, such as :mod:`urllib.request` and :mod:`xmlrpc.client`, will now verify that the server presents a certificate which is signed by a CA in the platform trust store and whose hostname matches the hostname being requested by default, significantly improving security for many applications.
pt_pt: O módulo :mod:`http.client` e os módulos que o utilizam, como :mod:`urllib.request` e :mod:`xmlrpc.client`, agora verificam por predefinição que o servidor apresenta um certificado assinado por uma CA na loja de confiança da plataforma e cujo nome de anfitrião corresponde ao nome de anfitrião que está a ser solicitado, melhorando significativamente a segurança para muitas aplicações.
ru: :mod:`http.client` и модули, которые его используют, такие как :mod:`urllib.request` и :mod:`xmlrpc.client`, теперь будут проверять, предоставляет ли сервер сертификат, подписанный центром сертификации в хранилище доверенных сертификатов платформы и чье имя хоста соответствует имени хоста, запрошенному по умолчанию, что значительно повышает безопасность многих приложений.

source: For applications which require the old previous behavior, they can pass an alternate context::
pt_pt: Para aplicações que requerem o comportamento anterior, podem passar um contexto alternativo::
ru: Для приложений, которым требуется старое предыдущее поведение, они могут передавать альтернативный контекст:

source: multiprocessing
pt_pt: multiprocessamento

source: subprocess
pt_pt: subprocesso

source: :pep:`436` -- The Argument Clinic DSL
pt_pt: :pep:`436` -- A DSL do Argument Clinic
