Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: The internal ``Netrc`` class in the :mod:`ftplib` module has been documented as deprecated in its docstring for quite some time. It now emits a :exc:`DeprecationWarning` and will be removed completely in Python 3.5.
pt_pt: A classe interna ``Netrc`` no módulo :mod:`ftplib` está documentada como obsoleta na sua *docstring* há algum tempo. Agora emite um :exc:`DeprecationWarning` e será removida completamente no Python 3.5.
ru: Внутренний класс ``Netrc`` в модуле :mod:`ftplib` уже довольно давно задокументирован как устаревший в строке документации. Теперь он выдает :exc:`DeprecationWarning` и будет полностью удален в Python 3.5.

source: The undocumented *endtime* argument to :meth:`subprocess.Popen.wait` should not have been exposed and is hopefully not in use; it is deprecated and will mostly likely be removed in Python 3.5.
pt_pt: O argumento não documentado *endtime* em :meth:`subprocess.Popen.wait` não deveria ter sido exposto e, esperançosamente, não está em uso; está obsoleto e provavelmente será removido no Python 3.5.
ru: Недокументированный аргумент *endtime* для :meth:`subprocess.Popen.wait` не должен был быть раскрыт и, надеюсь, не используется; он устарел и, скорее всего, будет удален в Python 3.5.

source: The *strict* argument of :class:`~html.parser.HTMLParser` is deprecated.
pt_pt: O argumento *strict* de :class:`~html.parser.HTMLParser` está obsoleto.
ru: Аргумент *strict* :class:`~html.parser.HTMLParser` устарел.

source: The :mod:`plistlib` :func:`~plistlib.readPlist`, :func:`~plistlib.writePlist`, :func:`~plistlib.readPlistFromBytes`, and :func:`~plistlib.writePlistToBytes` functions are deprecated in favor of the corresponding new functions :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads`, and :func:`~plistlib.dumps`. :func:`~plistlib.Data` is deprecated in favor of just using the :class:`bytes` constructor.
ru: Функции :mod:`plistlib` :func:`~plistlib.readPlist`, :func:`~plistlib.writePlist`, :func:`~plistlib.readPlistFromBytes` и :func:`~plistlib.writePlistToBytes` считаются устаревшими. в пользу соответствующих новых функций :func:`~plistlib.load`, :func:`~plistlib.dump`, :func:`~plistlib.loads` и :func:`~plistlib.dumps`. :func:`~plistlib.Data` устарел в пользу использования только конструктора :class:`bytes`.

source: The :mod:`sysconfig` key ``SO`` is deprecated, it has been replaced by ``EXT_SUFFIX``.
pt_pt: A chave ``SO`` do módulo :mod:`sysconfig` está obsoleta; foi substituída por ``EXT_SUFFIX``.
ru: Ключ :mod:`sysconfig``SO`` устарел, он заменен на ``EXT_SUFFIX``.

source: The ``U`` mode accepted by various ``open`` functions is deprecated. In Python3 it does not do anything useful, and should be replaced by appropriate uses of :class:`io.TextIOWrapper` (if needed) and its *newline* argument.
pt_pt: O modo ``U`` aceito por várias funções ``open`` está obsoleto. No Python 3, não faz nada de útil e deve ser substituído pelo uso apropriado de :class:`io.TextIOWrapper` (se necessário) e pelo seu argumento *newline*.
ru: Режим ``U``, принимаемый различными ``открытыми`` функциями, устарел. В Python3 он не делает ничего полезного и должен быть заменен соответствующим использованием :class:`io.TextIOWrapper` (при необходимости) и его аргумента *newline*.

source: The *parser* argument of :func:`xml.etree.ElementTree.iterparse` has been deprecated, as has the *html* argument of :func:`~xml.etree.ElementTree.XMLParser`. To prepare for the removal of the latter, all arguments to ``XMLParser`` should be passed by keyword.
pt_pt: O argumento *parser* de :func:`xml.etree.ElementTree.iterparse` está obsoleto, assim como o argumento *html* de :func:`~xml.etree.ElementTree.XMLParser`. Para se preparar para a remoção deste último, todos os argumentos para ``XMLParser`` devem ser passados por palavra-chave.
ru: Аргумент *parser* для :func:`xml.etree.ElementTree.iterparse` устарел, как и аргумент *html* для :func:`~xml.etree.ElementTree.XMLParser`. Чтобы подготовиться к удалению последнего, все аргументы XMLParser должны передаваться по ключевому слову.

source: Deprecated Features
pt_pt: Funcionalidades Obsoletas
ru: Устаревшие функции

source: Running :ref:`idle` with the ``-n`` flag (no subprocess) is deprecated. However, the feature will not be removed until :issue:`18823` is resolved.
pt_pt: Executar o :ref:`idle` com a flag ``-n`` (sem subprocesso) está obsoleto. No entanto, a funcionalidade não será removida até que :issue:`18823` seja resolvido.
ru: Запуск :ref:`idle` с флагом ``-n`` (без подпроцесса) считается устаревшим. Однако эта функция не будет удалена до тех пор, пока не будет решена проблема:`18823`.

source: The site module adding a "site-python" directory to sys.path, if it exists, is deprecated (:issue:`19375`).
pt_pt: A adição de um diretório "site-python" ao sys.path pelo módulo site, caso exista, está obsoleta (:issue:`19375`).
ru: Модуль сайта, добавляющий каталог «site-python» в sys.path, если он существует, устарел (:issue:`19375`).

source: Removed
pt_pt: Removido
ru: Удалено

source: Operating Systems No Longer Supported
pt_pt: Sistemas Operativos Já Não Suportados
ru: Операционные системы больше не поддерживаются

source: Support for the following operating systems has been removed from the source and build tools:
pt_pt: O suporte para os seguintes sistemas operativos foi removido do código-fonte e das ferramentas de construção:
ru: Поддержка следующих операционных систем удалена из исходного кода и инструментов сборки:

source: Windows 2000 (changeset e52df05b496a).
pt_pt: Windows 2000 (conjunto de alterações e52df05b496a).
ru: Windows 2000 (набор изменений e52df05b496a).

source: Windows systems where ``COMSPEC`` points to ``command.com`` (:issue:`14470`).
pt_pt: Sistemas Windows onde ``COMSPEC`` aponta para ``command.com`` (:issue:`14470`).
ru: Системы Windows, где COMSPEC указывает на command.com (:issue:`14470`).

source: API and Feature Removals
pt_pt: Remoções de API e Funcionalidades
ru: Удаление API и функций

source: The following obsolete and previously deprecated APIs and features have been removed:
pt_pt: As seguintes APIs e funcionalidades obsoletas e previamente obsoletas foram removidas:
ru: Следующие устаревшие и ранее не рекомендуемые API и функции были удалены:

source: The unmaintained ``Misc/TextMate`` and ``Misc/vim`` directories have been removed (see the `devguide <https://devguide.python.org>`_ for suggestions on what to use instead).
pt_pt: Os diretórios não mantidos ``Misc/TextMate`` e ``Misc/vim`` foram removidos (consulte o `guia de desenvolvimento <https://devguide.python.org>`_ para sugestões sobre o que usar em vez disso).
ru: Неподдерживаемые каталоги «Misc/TextMate» и «Misc/vim» были удалены (предложения о том, что использовать вместо них, см. в «devguide <https://devguide.python.org>»).

source: The ``SO`` makefile macro is removed (it was replaced by the ``SHLIB_SUFFIX`` and ``EXT_SUFFIX`` macros) (:issue:`16754`).
pt_pt: A macro ``SO`` do makefile foi removida (foi substituída pelas macros ``SHLIB_SUFFIX`` e ``EXT_SUFFIX``) (:issue:`16754`).
ru: Макрос makefile ``SO`` удален (он заменен макросами ``SHLIB_SUFFIX`` и ``EXT_SUFFIX``) (:issue:`16754`).

source: The ``PyThreadState.tick_counter`` field has been removed; its value has been meaningless since Python 3.2, when the "new GIL" was introduced (:issue:`19199`).
pt_pt: O campo ``PyThreadState.tick_counter`` foi removido; o seu valor tem sido sem significado desde o Python 3.2, quando o "novo GIL" foi introduzido (:issue:`19199`).
ru: Поле PyThreadState.tick_counter было удалено; его значение стало бессмысленным с момента появления Python 3.2, когда был представлен «новый GIL» (:issue:`19199`).

source: ``PyLoader`` and ``PyPycLoader`` have been removed from :mod:`importlib`. (Contributed by Taras Lyapun in :issue:`15641`.)
pt_pt: ``PyLoader`` e ``PyPycLoader`` foram removidos de :mod:`importlib`. (Contribuído por Taras Lyapun em :issue:`15641`.)
ru: ``PyLoader`` и ``PyPycLoader`` были удалены из :mod:`importlib`. (Добавлен Тарасом Ляпуном в :issue:`15641`.)

source: The *strict* argument to :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` has been removed. HTTP 0.9-style "Simple Responses" are no longer supported.
pt_pt: O argumento *strict* de :class:`~http.client.HTTPConnection` e :class:`~http.client.HTTPSConnection` foi removido. As "Respostas Simples" no estilo HTTP 0.9 já não são suportadas.
ru: Аргумент *strict* для :class:`~http.client.HTTPConnection` и :class:`~http.client.HTTPSConnection` был удален. «Простые ответы» в стиле HTTP 0.9 больше не поддерживаются.

source: The deprecated :mod:`urllib.request.Request` getter and setter methods ``add_data``, ``has_data``, ``get_data``, ``get_type``, ``get_host``, ``get_selector``, ``set_proxy``, ``get_origin_req_host``, and ``is_unverifiable`` have been removed (use direct attribute access instead).
pt_pt: Os métodos *getter* e *setter* obsoletos de :mod:`urllib.request.Request` ``add_data``, ``has_data``, ``get_data``, ``get_type``, ``get_host``, ``get_selector``, ``set_proxy``, ``get_origin_req_host`` e ``is_unverifiable`` foram removidos (use acesso direto aos atributos em vez disso).
ru: Устаревшие методы получения и установки :mod:`urllib.request.Request` ``add_data``, ``has_data``, ``get_data``, ``get_type``, ``get_host``, ``get_selector` `, ``set_proxy``, ``get_origin_req_host`` и ``is_unverifying`` были удалены (вместо этого используйте прямой доступ к атрибутам).

source: Support for loading the deprecated ``TYPE_INT64`` has been removed from :mod:`marshal`. (Contributed by Dan Riti in :issue:`15480`.)
pt_pt: O suporte para carregar o obsoleto ``TYPE_INT64`` foi removido de :mod:`marshal`. (Contribuído por Dan Riti em :issue:`15480`.)
ru: Поддержка загрузки устаревшего ``TYPE_INT64`` была удалена из :mod:`marshal`. (Предоставлено Дэном Рити в :issue:`15480`.)

source: :class:`inspect.Signature`: positional-only parameters are now required to have a valid name.
pt_pt: Na classe :class:`inspect.Signature`, os parâmetros apenas posicionais são agora obrigados a ter um nome válido.
ru: :class:`inspect.Signature`: позиционные параметры теперь должны иметь допустимое имя.

source: :meth:`object.__format__` no longer accepts non-empty format strings, it now raises a :exc:`TypeError` instead. Using a non-empty string has been deprecated since Python 3.2. This change has been made to prevent a situation where previously working (but incorrect) code would start failing if an object gained a __format__ method, which means that your code may now raise a :exc:`TypeError` if you are using an ``'s'`` format code with objects that do not have a __format__ method that handles it. See :issue:`7994` for background.
pt_pt: O método :meth:`object.__format__` já não aceita strings de formato não vazias; agora lança uma exceção :exc:`TypeError`. O uso de uma string não vazia está obsoleto desde o Python 3.2. Esta alteração foi feita para evitar uma situação em que código anteriormente funcional (mas incorreto) poderia começar a falhar se um objeto ganhasse um método __format__, o que significa que o seu código pode agora lançar uma exceção :exc:`TypeError` se estiver a usar um código de formato ``'s'`` com objetos que não tenham um método __format__ que o trate. Consulte :issue:`7994` para mais informações.
ru: :meth:`object.__format__` больше не принимает непустые строки формата, вместо этого он теперь вызывает :exc:`TypeError`. Использование непустой строки устарело начиная с Python 3.2. Это изменение было сделано, чтобы предотвратить ситуацию, когда ранее работающий (но неправильный) код начинал давать сбой, если объект получил метод __format__, что означает, что ваш код теперь может вызвать :exc:`TypeError`, если вы используете `` 's'`` код формата с объектами, у которых нет метода __format__, который его обрабатывает. Дополнительную информацию см. в :issue:`7994`.

source: :meth:`difflib.SequenceMatcher.isbjunk` and :meth:`difflib.SequenceMatcher.isbpopular` were deprecated in 3.2, and have now been removed: use ``x in sm.bjunk`` and ``x in sm.bpopular``, where *sm* is a :class:`~difflib.SequenceMatcher` object (:issue:`13248`).
ru: :meth:`difflib.SequenceMatcher.isbjunk` и :meth:`difflib.SequenceMatcher.isbpopular` устарели в версии 3.2 и теперь удалены: используйте ``x в sm.bjunk`` и ``x в sm.bpopular ``, где *sm* — это объект :class:`~difflib.SequenceMatcher` (:issue:`13248`).

source: Code Cleanups
pt_pt: Limpezas de Código
ru: Очистка кода

source: The unused and undocumented internal ``Scanner`` class has been removed from the :mod:`pydoc` module.
pt_pt: A classe interna não utilizada e não documentada ``Scanner`` foi removida do módulo :mod:`pydoc`.
ru: Неиспользуемый и недокументированный внутренний класс Scanner был удален из модуля :mod:`pydoc`.

source: The private and effectively unused ``_gestalt`` module has been removed, along with the private :mod:`platform` functions ``_mac_ver_lookup``, ``_mac_ver_gstalt``, and ``_bcd2str``, which would only have ever been called on badly broken OSX systems (see :issue:`18393`).
pt_pt: O módulo privado e efetivamente não utilizado ``_gestalt`` foi removido, juntamente com as funções privadas do módulo :mod:`platform`: ``_mac_ver_lookup``, ``_mac_ver_gstalt`` e ``_bcd2str``, que só teriam sido chamadas em sistemas OSX gravementes danificados (consulte :issue:`18393`).
ru: Частный и фактически неиспользуемый модуль _gestalt был удален вместе с частными функциями :mod:`platform` _mac_ver_lookup``, ``_mac_ver_gstalt`` и ``_bcd2str``, которые когда-либо использовались только вызывался на сильно сломанных системах OSX (см.:issue:`18393`).

source: The hardcoded copies of certain :mod:`stat` constants that were included in the :mod:`tarfile` module namespace have been removed.
pt_pt: As cópias codificadas de certas constantes do módulo :mod:`stat` que estavam incluídas no espaço de nomes do módulo :mod:`tarfile` foram removidas.
ru: Жестко закодированные копии некоторых констант :mod:`stat`, которые были включены в пространство имен модуля :mod:`tarfile`, были удалены.

source: Porting to Python 3.4
pt_pt: Portabilidade para Python 3.4
ru: Портирование на Python 3.4

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_pt: Esta secção lista alterações previamente descritas e outras correções de erros que podem exigir alterações no seu código.
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код.

source: Changes in 'python' Command Behavior
pt_pt: Alterações no Comportamento do Comando 'python'
ru: Изменения в поведении команды Python

source: In a posix shell, setting the :envvar:`PATH` environment variable to an empty value is equivalent to not setting it at all. However, setting :envvar:`PYTHONPATH` to an empty value was *not* equivalent to not setting it at all: setting :envvar:`PYTHONPATH` to an empty value was equivalent to setting it to ``.``, which leads to confusion when reasoning by analogy to how :envvar:`PATH` works. The behavior now conforms to the posix convention for :envvar:`PATH`.
pt_pt: Num shell POSIX, definir a variável de ambiente :envvar:`PATH` para um valor vazio é equivalente a não a definir. No entanto, definir :envvar:`PYTHONPATH` para um valor vazio *não* era equivalente a não a definir: definir :envvar:`PYTHONPATH` para um valor vazio era equivalente a defini-lo para ``.``, o que causava confusão ao raciocinar por analogia com o funcionamento de :envvar:`PATH`. O comportamento agora está em conformidade com a convenção POSIX para :envvar:`PATH`.
ru: В оболочке posix установка переменной среды :envvar:`PATH` пустого значения эквивалентна ее полному отсутствию установки. Однако установка :envvar:`PYTHONPATH` в пустое значение *не* эквивалентна его полному отсутствию установки: установка :envvar:`PYTHONPATH` в пустое значение была эквивалентна установке его в ``.``, что приводит к к путанице при рассуждениях по аналогии с тем, как работает :envvar:`PATH`. Поведение теперь соответствует соглашению posix для :envvar:`PATH`.

source: The [X refs, Y blocks] output of a debug (``--with-pydebug``) build of the CPython interpreter is now off by default. It can be re-enabled using the ``-X showrefcount`` option. (Contributed by Ezio Melotti in :issue:`17323`.)
pt_pt: A saída [X refs, Y blocos] de uma construção de depuração (``--with-pydebug``) do interpretador CPython está agora desativada por predefinição. Pode ser reativada usando a opção ``-X showrefcount``. (Contribuído por Ezio Melotti em :issue:`17323`.)
ru: Вывод [X refs, Yblocks] отладочной (``--with-pydebug``) сборки интерпретатора CPython теперь по умолчанию отключен. Его можно повторно включить с помощью опции ``-X showrefcount``. (Предоставлено Эцио Мелотти в :issue:`17323`.)

source: The python command and most stdlib scripts (as well as :mod:`argparse`) now output ``--version`` information to ``stdout`` instead of ``stderr`` (for issue list see :ref:`other-improvements-3.4` above).
pt_pt: O comando python e a maioria dos scripts da biblioteca padrão (assim como :mod:`argparse`) agora escrevem a informação ``--version`` para ``stdout`` em vez de ``stderr`` (para a lista de problemas, consulte :ref:`other-improvements-3.4` acima).
ru: Команда python и большинство сценариев stdlib (а также :mod:`argparse`) теперь выводят информацию ``--version`` в ``stdout`` вместо ``stderr`` (список проблем см. в :ref:` другие-улучшения-3.4` выше).

source: Changes in the Python API
pt_pt: Alterações na API do Python
ru: Изменения в API Python

source: The ABCs defined in :mod:`importlib.abc` now either raise the appropriate exception or return a default value instead of raising :exc:`NotImplementedError` blindly. This will only affect code calling :func:`super` and falling through all the way to the ABCs. For compatibility, catch both :exc:`NotImplementedError` or the appropriate exception as needed.
pt_pt: As ABCs definidas em :mod:`importlib.abc` agora lançam a exceção apropriada ou devolvem um valor predefinido em vez de lançar :exc:`NotImplementedError` indiscriminadamente. Isto só afetará código que chama :func:`super` e passa até às ABCs. Para compatibilidade, capture tanto :exc:`NotImplementedError` como a exceção apropriada, conforme necessário.
ru: ABC, определенные в :mod:`importlib.abc`, теперь либо вызывают соответствующее исключение, либо возвращают значение по умолчанию вместо того, чтобы слепо вызывать :exc:`NotImplementedError`. Это повлияет только на вызов кода :func:`super` и попадание в ABC. Для совместимости перехватите как :exc:`NotImplementedError`, так и соответствующее исключение, если необходимо.

source: Import now resets relevant attributes (e.g. ``__name__``, ``__loader__``, ``__package__``, ``__file__``, ``__cached__``) unconditionally when reloading. Note that this restores a pre-3.3 behavior in that it means a module is re-found when re-loaded (:issue:`19413`).
pt_pt: A importação agora redefine os atributos relevantes (por exemplo, ``__name__``, ``__loader__``, ``__package__``, ``__file__``, ``__cached__``) incondicionalmente ao recarregar. Note que isto restaura um comportamento pré-3.3, no sentido em que significa que um módulo é reencontrado ao ser recarregado (:issue:`19413`).
ru: Импорт теперь сбрасывает соответствующие атрибуты (например, ``__name__``, ``__loader__``, ``__package__``, ``__file__``, ``__cached__``) безоговорочно при перезагрузке. Обратите внимание, что это восстанавливает поведение до версии 3.3, то есть модуль перенаходится при повторной загрузке (:issue:`19413`).

source: Frozen packages no longer set ``__path__`` to a list containing the package name, they now set it to an empty list. The previous behavior could cause the import system to do the wrong thing on submodule imports if there was also a directory with the same name as the frozen package. The correct way to determine if a module is a package or not is to use ``hasattr(module, '__path__')`` (:issue:`18065`).
pt_pt: Os pacotes congelados já não definem ``__path__`` para uma lista contendo o nome do pacote; agora definem-no para uma lista vazia. O comportamento anterior poderia fazer com que o sistema de importação fizesse a coisa errada em importações de submódulos se existisse também um diretório com o mesmo nome do pacote congelado. A forma correta de determinar se um módulo é um pacote ou não é usar ``hasattr(module, '__path__')`` (:issue:`18065`).
ru: Замороженные пакеты больше не устанавливают ``__path__`` в список, содержащий имя пакета, теперь они устанавливают его в пустой список. Предыдущее поведение могло привести к тому, что система импорта выполняла неправильные действия при импорте подмодуля, если существовал каталог с тем же именем, что и у замороженного пакета. Правильный способ определить, является ли модуль пакетом или нет, — использовать hasattr(module, '__path__')`` (:issue:`18065`).

source: :func:`py_compile.compile` now raises :exc:`FileExistsError` if the file path it would write to is a symlink or a non-regular file. This is to act as a warning that import will overwrite those files with a regular file regardless of what type of file path they were originally.
pt_pt: A função :func:`py_compile.compile` agora lança uma exceção :exc:`FileExistsError` se o caminho do ficheiro para o qual escreveria for uma ligação simbólica ou um ficheiro não regular. Isto serve como aviso de que a importação irá sobrescrever esses ficheiros com um ficheiro regular, independentemente do tipo de caminho de ficheiro que eram originalmente.
ru: :func:`py_compile.compile` теперь вызывает :exc:`FileExistsError`, если путь к файлу, в который он будет записывать, является символической ссылкой или нестандартным файлом. Это предупреждение о том, что импорт перезапишет эти файлы обычным файлом независимо от того, какой тип пути к файлу они имели изначально.

source: :meth:`importlib.abc.SourceLoader.get_source` no longer raises :exc:`ImportError` when the source code being loaded triggers a :exc:`SyntaxError` or :exc:`UnicodeDecodeError`. As :exc:`ImportError` is meant to be raised only when source code cannot be found but it should, it was felt to be over-reaching/overloading of that meaning when the source code is found but improperly structured. If you were catching ImportError before and wish to continue to ignore syntax or decoding issues, catch all three exceptions now.
pt_pt: O método :meth:`importlib.abc.SourceLoader.get_source` já não lança :exc:`ImportError` quando o código-fonte a ser carregado desencadeia um :exc:`SyntaxError` ou :exc:`UnicodeDecodeError`. Como :exc:`ImportError` deve ser lançado apenas quando o código-fonte não pode ser encontrado, mas deveria estar disponível, sentiu-se que era um uso excessivo/sobrecarga desse significado quando o código-fonte é encontrado, mas está mal estruturado. Se estava a capturar ImportError antes e deseja continuar a ignorar problemas de sintaxe ou de descodificação, capture agora as três exceções.
ru: :meth:`importlib.abc.SourceLoader.get_source` больше не вызывает :exc:`ImportError`, когда загружаемый исходный код вызывает :exc:`SyntaxError` или :exc:`UnicodeDecodeError`. Поскольку :exc:`ImportError` предназначен для вызова только тогда, когда исходный код не может быть найден, но это должно быть, было сочтено, что это перегружает это значение, когда исходный код найден, но неправильно структурирован. Если вы раньше ловили ImportError и хотите продолжать игнорировать проблемы синтаксиса или декодирования, перехватите все три исключения сейчас.
