Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: :mod:`hmac` now accepts ``bytearray`` as well as ``bytes`` for the *key* argument to the :func:`~hmac.new` function, and the *msg* parameter to both the :func:`~hmac.new` function and the :meth:`~hmac.HMAC.update` method now accepts any type supported by the :mod:`hashlib` module. (Contributed by Jonas Borgström in :issue:`18240`.)
pt_pt: O módulo :mod:`hmac` agora aceita ``bytearray`` bem como ``bytes`` para o argumento *key* da função :func:`~hmac.new`, e o parâmetro *msg* tanto para a função :func:`~hmac.new` como para o método :meth:`~hmac.HMAC.update` agora aceita qualquer tipo suportado pelo módulo :mod:`hashlib`. (Contribuído por Jonas Borgström em :issue:`18240`.)
ru: :mod:`hmac` теперь принимает ``bytearray``, а также ``bytes`` в качестве аргумента *key* для функции :func:`~hmac.new`, а также параметр *msg* для обоих: func:`~hmac.new` и метод :meth:`~hmac.HMAC.update` теперь принимают любой тип, поддерживаемый модулем :mod:`hashlib`. (Предоставлено Йонасом Боргстремом в :issue:`18240`.)

source: The *digestmod* argument to the :func:`hmac.new` function may now be any hash digest name recognized by :mod:`hashlib`. In addition, the current behavior in which the value of *digestmod* defaults to ``MD5`` is deprecated: in a future version of Python there will be no default value. (Contributed by Christian Heimes in :issue:`17276`.)
pt_pt: O argumento *digestmod* da função :func:`hmac.new` pode agora ser qualquer nome de *hash* reconhecido pelo :mod:`hashlib`. Além disso, o comportamento atual em que o valor de *digestmod* é predefinido para ``MD5`` está descontinuado: numa versão futura do Python não haverá valor predefinido. (Contribuído por Christian Heimes em :issue:`17276`.)
ru: Аргументом *digestmod* функции :func:`hmac.new` теперь может быть любое имя хеш-дайджеста, распознаваемое :mod:`hashlib`. Кроме того, текущее поведение, при котором значение *digestmod* по умолчанию равно MD5, устарело: в будущей версии Python не будет значения по умолчанию. (Предоставлено Кристианом Хаймсом в :issue:`17276`.)

source: With the addition of :attr:`~hmac.HMAC.block_size` and :attr:`~hmac.HMAC.name` attributes (and the formal documentation of the :attr:`~hmac.HMAC.digest_size` attribute), the :mod:`hmac` module now conforms fully to the :pep:`247` API. (Contributed by Christian Heimes in :issue:`18775`.)
pt_pt: Com a adição dos atributos :attr:`~hmac.HMAC.block_size` e :attr:`~hmac.HMAC.name` (e a documentação formal do atributo :attr:`~hmac.HMAC.digest_size`), o módulo :mod:`hmac` agora está totalmente conforme com a API da :pep:`247`. (Contribuído por Christian Heimes em :issue:`18775`.)
ru: С добавлением атрибутов :attr:`~hmac.HMAC.block_size` и :attr:`~hmac.HMAC.name` (и официальной документации атрибута :attr:`~hmac.HMAC.digest_size`) Модуль :mod:`hmac` теперь полностью соответствует API :pep:`247`. (Предоставлено Кристианом Хаймсом в :issue:`18775`.)

source: New function :func:`~html.unescape` function converts HTML5 character references to the corresponding Unicode characters. (Contributed by Ezio Melotti in :issue:`2927`.)
pt_pt: Nova função :func:`~html.unescape` que converte referências de caracteres HTML5 para os caracteres Unicode correspondentes. (Contribuído por Ezio Melotti em :issue:`2927`.)
ru: Новая функция :func:`~html.unescape` преобразует ссылки на символы HTML5 в соответствующие символы Юникода. (Предоставлено Эцио Мелотти в :issue:`2927`.)

source: :class:`~html.parser.HTMLParser` accepts a new keyword argument *convert_charrefs* that, when ``True``, automatically converts all character references. For backward-compatibility, its value defaults to ``False``, but it will change to ``True`` in a future version of Python, so you are invited to set it explicitly and update your code to use this new feature. (Contributed by Ezio Melotti in :issue:`13633`.)
pt_pt: O :class:`~html.parser.HTMLParser` agora aceita um novo argumento nomeado *convert_charrefs* que, quando ``True``, converte automaticamente todas as referências de caracteres. Para retrocompatibilidade, o seu valor predefinido é ``False``, mas mudará para ``True`` numa versão futura do Python, pelo que é aconselhado a defini-lo explicitamente e atualizar o seu código para usar esta nova funcionalidade. (Contribuído por Ezio Melotti em :issue:`13633`.)
ru: :class:`~html.parser.HTMLParser` принимает новый аргумент ключевого слова *convert_charrefs*, который, когда ``True``, автоматически преобразует все ссылки на символы. Для обеспечения обратной совместимости его значение по умолчанию равно «False», но в будущей версии Python оно изменится на «True», поэтому вам предлагается установить его явно и обновить свой код для использования этой новой функции. (Предоставлено Эцио Мелотти в :issue:`13633`.)

source: The *strict* argument of :class:`~html.parser.HTMLParser` is now deprecated. (Contributed by Ezio Melotti in :issue:`15114`.)
pt_pt: O argumento *strict* do :class:`~html.parser.HTMLParser` está agora descontinuado. (Contribuído por Ezio Melotti em :issue:`15114`.)
ru: Аргумент *strict* :class:`~html.parser.HTMLParser` устарел. (Предоставлено Эцио Мелотти в :issue:`15114`.)

source: :meth:`~http.server.BaseHTTPRequestHandler.send_error` now accepts an optional additional *explain* parameter which can be used to provide an extended error description, overriding the hardcoded default if there is one. This extended error description will be formatted using the :attr:`~http.server.HTTP.error_message_format` attribute and sent as the body of the error response. (Contributed by Karl Cow in :issue:`12921`.)
ru: :meth:`~http.server.BaseHTTPRequestHandler.send_error` теперь принимает необязательный дополнительный параметр *explain*, который можно использовать для предоставления расширенного описания ошибки, переопределяя жестко запрограммированное значение по умолчанию, если таковое имеется. Это расширенное описание ошибки будет отформатировано с использованием атрибута :attr:`~http.server.HTTP.error_message_format` и отправлено как тело ответа об ошибке. (Предоставлено Карлом Коу в :issue:`12921`.)

source: The :mod:`http.server` :ref:`command line interface <http-server-cli>` now has a ``-b/--bind`` option that causes the server to listen on a specific address. (Contributed by Malte Swart in :issue:`17764`.)
pt_pt: A :ref:`interface de linha de comandos <http-server-cli>` do :mod:`http.server` agora tem uma opção ``-b/--bind`` que faz com que o servidor escute num endereço específico. (Contribuído por Malte Swart em :issue:`17764`.)
ru: Интерфейс командной строки :mod:`http.server` :ref:`<http-server-cli>` теперь имеет опцию ``-b/--bind``, которая заставляет сервер прослушивать определенный адрес. (Предоставлено Мальте Свартом в :issue:`17764`.)

source: idlelib and IDLE
pt_pt: idlelib e IDLE
ru: idlelib и IDLE

source: Since idlelib implements the IDLE shell and editor and is not intended for import by other programs, it gets improvements with every release. See :file:`Lib/idlelib/NEWS.txt` for a cumulative list of changes since 3.3.0, as well as changes made in future 3.4.x releases. This file is also available from the IDLE :menuselection:`Help --> About IDLE` dialog.
pt_pt: Como o idlelib implementa a *shell* e o editor do IDLE e não é destinado a ser importado por outros programas, recebe melhorias em cada lançamento. Consulte o ficheiro :file:`Lib/idlelib/NEWS.txt` para uma lista cumulativa de alterações desde o 3.3.0, bem como alterações feitas em futuras versões 3.4.x. Este ficheiro também está disponível a partir do diálogo :menuselection:`Ajuda --> Sobre o IDLE`.
ru: Поскольку Idlelib реализует оболочку и редактор IDLE и не предназначен для импорта другими программами, он совершенствуется с каждым выпуском. См. :file:`Lib/idlelib/NEWS.txt` для получения совокупного списка изменений, начиная с версии 3.3.0, а также изменений, внесенных в будущие выпуски 3.4.x. Этот файл также доступен в диалоговом окне IDLE :menuselection:`Справка --> О IDLE`.

source: The :class:`~importlib.abc.InspectLoader` ABC defines a new method, :meth:`~importlib.abc.InspectLoader.source_to_code` that accepts source data and a path and returns a code object. The default implementation is equivalent to ``compile(data, path, 'exec', dont_inherit=True)``. (Contributed by Eric Snow and Brett Cannon in :issue:`15627`.)
pt_pt: A ABC :class:`~importlib.abc.InspectLoader` define um novo método, :meth:`~importlib.abc.InspectLoader.source_to_code`, que aceita dados de origem e um caminho, e devolve um objeto de código. A implementação predefinida é equivalente a ``compile(data, path, 'exec', dont_inherit=True)``. (Contribuído por Eric Snow e Brett Cannon em :issue:`15627`.)
ru: :class:`~importlib.abc.InspectLoader` ABC определяет новый метод :meth:`~importlib.abc.InspectLoader.source_to_code`, который принимает исходные данные и путь и возвращает объект кода. Реализация по умолчанию эквивалентна ``compile(data, path, 'exec', dont_inherit=True)``. (Предоставлено Эриком Сноу и Бреттом Кэнноном в :issue:`15627`.)

source: :class:`~importlib.abc.InspectLoader` also now has a default implementation for the :meth:`~importlib.abc.InspectLoader.get_code` method. However, it will normally be desirable to override the default implementation for performance reasons. (Contributed by Brett Cannon in :issue:`18072`.)
pt_pt: A :class:`~importlib.abc.InspectLoader` também tem agora uma implementação predefinida para o método :meth:`~importlib.abc.InspectLoader.get_code`. No entanto, geralmente será desejável substituir a implementação predefinida por razões de desempenho. (Contribuído por Brett Cannon em :issue:`18072`.)
ru: :class:`~importlib.abc.InspectLoader` также теперь имеет реализацию по умолчанию для метода :meth:`~importlib.abc.InspectLoader.get_code`. Однако обычно желательно переопределить реализацию по умолчанию из соображений производительности. (Предоставлено Бреттом Кэнноном в :issue:`18072`.)

source: The :mod:`importlib` bootstrap :class:`.NamespaceLoader` now conforms to the :class:`.InspectLoader` ABC, which means that ``runpy`` and ``python -m`` can now be used with namespace packages. (Contributed by Brett Cannon in :issue:`18058`.)
pt_pt: O *bootstrap* :class:`.NamespaceLoader` do :mod:`importlib` agora está conforme com a ABC :class:`.InspectLoader`, o que significa que ``runpy`` e ``python -m`` podem agora ser usados com pacotes de *namespace*. (Contribuído por Brett Cannon em :issue:`18058`.)
ru: Загрузочный файл :mod:`importlib` :class:`.NamespaceLoader` теперь соответствует :class:`.InspectLoader` ABC, что означает, что ``runpy`` и ``python -m`` теперь можно использовать с пространством имен. пакеты. (Предоставлено Бреттом Кэнноном в :issue:`18058`.)

source: :mod:`importlib.util` has a new function :func:`~importlib.util.decode_source` that decodes source from bytes using universal newline processing. This is useful for implementing :meth:`.InspectLoader.get_source` methods.
pt_pt: O :mod:`importlib.util` tem uma nova função, :func:`~importlib.util.decode_source`, que descodifica o código-fonte de *bytes* usando processamento universal de novas linhas. Isto é útil para implementar métodos :meth:`.InspectLoader.get_source`.
ru: :mod:`importlib.util` имеет новую функцию :func:`~importlib.util.decode_source`, которая декодирует исходный код из байтов, используя универсальную обработку новой строки. Это полезно для реализации методов :meth:`.InspectLoader.get_source`.

source: :class:`importlib.machinery.ExtensionFileLoader` now has a :meth:`~importlib.machinery.ExtensionFileLoader.get_filename` method. This was inadvertently omitted in the original implementation. (Contributed by Eric Snow in :issue:`19152`.)
pt_pt: A classe :class:`importlib.machinery.ExtensionFileLoader` agora tem um método :meth:`~importlib.machinery.ExtensionFileLoader.get_filename`. Isto foi omitido inadvertidamente na implementação original. (Contribuído por Eric Snow em :issue:`19152`.)
ru: :class:`importlib.machinery.ExtensionFileLoader` теперь имеет метод :meth:`~importlib.machinery.ExtensionFileLoader.get_filename`. В исходной реализации это было случайно опущено. (Предоставлено Эриком Сноу в :issue:`19152`.)

source: The :mod:`inspect` module now offers a basic :ref:`command line interface <inspect-module-cli>` to quickly display source code and other information for modules, classes and functions. (Contributed by Claudiu Popa and Nick Coghlan in :issue:`18626`.)
pt_pt: O módulo :mod:`inspect` agora oferece uma :ref:`interface de linha de comandos <inspect-module-cli>` para exibir rapidamente o código-fonte e outras informações para módulos, classes e funções. (Contribuído por Claudiu Popa e Nick Coghlan em :issue:`18626`.)
ru: Модуль :mod:`inspect` теперь предлагает базовый :ref:`интерфейс командной строки <inspect-module-cli>` для быстрого отображения исходного кода и другой информации для модулей, классов и функций. (Предоставлено Клаудиу Попа и Ником Когланом в :issue:`18626`.)

source: :func:`~inspect.unwrap` makes it easy to unravel wrapper function chains created by :func:`functools.wraps` (and any other API that sets the ``__wrapped__`` attribute on a wrapper function). (Contributed by Daniel Urban, Aaron Iles and Nick Coghlan in :issue:`13266`.)
pt_pt: A função :func:`~inspect.unwrap` facilita a desconstrução de cadeias de funções *wrapper* criadas por :func:`functools.wraps` (e qualquer outra API que defina o atributo ``__wrapped__`` numa função *wrapper*). (Contribuído por Daniel Urban, Aaron Iles e Nick Coghlan em :issue:`13266`.)
ru: :func:`~inspect.unwrap` позволяет легко распутывать цепочки функций-оболочек, созданных :func:`functools.wraps` (и любым другим API, который устанавливает атрибут ``__wrapped__`` для функции-обертки). (Предоставлено Дэниелом Урбаном, Аароном Айлсом и Ником Когланом в :issue:`13266`.)

source: As part of the implementation of the new :mod:`enum` module, the :mod:`inspect` module now has substantially better support for custom ``__dir__`` methods and dynamic class attributes provided through metaclasses. (Contributed by Ethan Furman in :issue:`18929` and :issue:`19030`.)
pt_pt: Como parte da implementação do novo módulo :mod:`enum`, o módulo :mod:`inspect` agora tem um suporte substancialmente melhor para métodos ``__dir__`` personalizados e atributos de classe dinâmicos fornecidos através de metaclasses. (Contribuído por Ethan Furman em :issue:`18929` e :issue:`19030`.)
ru: В рамках реализации нового модуля :mod:`enum` модуль :mod:`inspect` теперь имеет существенно лучшую поддержку пользовательских методов ``__dir__`` и атрибутов динамического класса, предоставляемых через метаклассы. (Внесено Итаном Фурманом в :issue:`18929` и :issue:`19030`.)

source: :func:`~inspect.getfullargspec` and :func:`~inspect.getargspec` now use the :func:`~inspect.signature` API. This allows them to support a much broader range of callables, including those with ``__signature__`` attributes, those with metadata provided by argument clinic, :func:`functools.partial` objects and more. Note that, unlike :func:`~inspect.signature`, these functions still ignore ``__wrapped__`` attributes, and report the already bound first argument for bound methods, so it is still necessary to update your code to use :func:`~inspect.signature` directly if those features are desired. (Contributed by Yury Selivanov in :issue:`17481`.)
ru: :func:`~inspect.getfullargspec` и :func:`~inspect.getargspec` теперь используют API :func:`~inspect.signature`. Это позволяет им поддерживать гораздо более широкий спектр вызываемых объектов, включая те, которые имеют атрибуты ``__signature__``, метаданные, предоставленные аргументом клиники, объекты :func:`functools.partial` и многое другое. Обратите внимание, что, в отличие от :func:`~inspect.signature`, эти функции по-прежнему игнорируют атрибуты ``__wrapped__`` и сообщают уже связанный первый аргумент для связанных методов, поэтому все равно необходимо обновить свой код для использования :func: `~inspect.signature` напрямую, если эти функции желательны. (Добавлен Юрием Селивановым в :issue:`17481`.)

source: :func:`~inspect.signature` now supports duck types of CPython functions, which adds support for functions compiled with Cython. (Contributed by Stefan Behnel and Yury Selivanov in :issue:`17159`.)
pt_pt: A função :func:`~inspect.signature` agora suporta *duck types* de funções CPython, o que adiciona suporte para funções compiladas com Cython. (Contribuído por Stefan Behnel e Yury Selivanov em :issue:`17159`.)
ru: :func:`~inspect.signature` теперь поддерживает утиные типы функций CPython, что добавляет поддержку функций, скомпилированных с помощью Cython. (Предоставлено Стефаном Бенелем и Юрием Селивановым в :issue:`17159`.)

source: :mod:`ipaddress` was added to the standard library in Python 3.3 as a :term:`provisional API`. With the release of Python 3.4, this qualification has been removed: :mod:`ipaddress` is now considered a stable API, covered by the normal standard library requirements to maintain backwards compatibility.
pt_pt: O módulo :mod:`ipaddress` foi adicionado à biblioteca padrão no Python 3.3 como uma :term:`API provisória`. Com o lançamento do Python 3.4, esta qualificação foi removida: :mod:`ipaddress` é agora considerado uma API estável, coberta pelos requisitos normais da biblioteca padrão para manter a retrocompatibilidade.
ru: :mod:`ipaddress` был добавлен в стандартную библиотеку Python 3.3 как :term:`предварительный API`. С выпуском Python 3.4 это условие было удалено: :mod:`ipaddress` теперь считается стабильным API, на который распространяются обычные требования стандартной библиотеки для обеспечения обратной совместимости.

source: A new :attr:`~ipaddress.IPv4Address.is_global` property is ``True`` if an address is globally routeable. (Contributed by Peter Moody in :issue:`17400`.)
pt_pt: Uma nova propriedade :attr:`~ipaddress.IPv4Address.is_global` é ``True`` se um endereço for roteável globalmente. (Contribuído por Peter Moody em :issue:`17400`.)
ru: Новое свойство :attr:`~ipaddress.IPv4Address.is_global` имеет значение True, если адрес является глобально маршрутизируемым. (Предоставлено Питером Муди в :issue:`17400`.)

source: logging
ru: логирование

source: The :class:`~logging.handlers.TimedRotatingFileHandler` has a new *atTime* parameter that can be used to specify the time of day when rollover should happen. (Contributed by Ronald Oussoren in :issue:`9556`.)
pt_pt: O :class:`~logging.handlers.TimedRotatingFileHandler` tem um novo parâmetro *atTime* que pode ser usado para especificar a hora do dia em que a rotação deve ocorrer. (Contribuído por Ronald Oussoren em :issue:`9556`.)
ru: :class:`~logging.handlers.TimedRotatingFileHandler` имеет новый параметр *atTime*, который можно использовать для указания времени суток, когда должен произойти ролловер. (Предоставлено Рональдом Уссореном в :issue:`9556`.)

source: :class:`~logging.handlers.SocketHandler` and :class:`~logging.handlers.DatagramHandler` now support Unix domain sockets (by setting *port* to ``None``). (Contributed by Vinay Sajip in commit ce46195b56a9.)
pt_pt: As classes :class:`~logging.handlers.SocketHandler` e :class:`~logging.handlers.DatagramHandler` agora suportam *sockets* de domínio Unix (definindo *port* para ``None``). (Contribuído por Vinay Sajip no *commit* ce46195b56a9.)
ru: :class:`~logging.handlers.SocketHandler` и :class:`~logging.handlers.DatagramHandler` теперь поддерживают сокеты домена Unix (путем установки для *port* значения ``None``). (Внесено Винаем Саджипом в коммит ce46195b56a9.)

source: :func:`~logging.config.fileConfig` now accepts a :class:`configparser.RawConfigParser` subclass instance for the *fname* parameter. This facilitates using a configuration file when logging configuration is just a part of the overall application configuration, or where the application modifies the configuration before passing it to :func:`~logging.config.fileConfig`. (Contributed by Vinay Sajip in :issue:`16110`.)
pt_pt: A função :func:`~logging.config.fileConfig` agora aceita uma instância de subclasse :class:`configparser.RawConfigParser` para o parâmetro *fname*. Isto facilita o uso de um ficheiro de configuração quando a configuração de *logging* é apenas uma parte da configuração geral da aplicação, ou quando a aplicação modifica a configuração antes de a passar para :func:`~logging.config.fileConfig`. (Contribuído por Vinay Sajip em :issue:`16110`.)
ru: :func:`~logging.config.fileConfig` теперь принимает экземпляр подкласса :class:`configparser.RawConfigParser` для параметра *fname*. Это облегчает использование файла конфигурации, когда конфигурация журнала является лишь частью общей конфигурации приложения или когда приложение изменяет конфигурацию перед передачей ее в :func:`~logging.config.fileConfig`. (Предоставлено Винаем Саджипом в :issue:`16110`.)

source: Logging configuration data received from a socket via the :func:`logging.config.listen` function can now be validated before being processed by supplying a verification function as the argument to the new *verify* keyword argument. (Contributed by Vinay Sajip in :issue:`15452`.)
pt_pt: Os dados de configuração de *logging* recebidos de um *socket* através da função :func:`logging.config.listen` podem agora ser validados antes de serem processados, fornecendo uma função de verificação como argumento para o novo argumento nomeado *verify*. (Contribuído por Vinay Sajip em :issue:`15452`.)
ru: Данные конфигурации журнала, полученные из сокета через функцию :func:`logging.config.listen`, теперь можно проверить перед обработкой, указав функцию проверки в качестве аргумента нового аргумента ключевого слова *verify*. (Предоставлено Винаем Саджипом в :issue:`15452`.)

source: The default :mod:`marshal` version has been bumped to 3. The code implementing the new version restores the Python2 behavior of recording only one copy of interned strings and preserving the interning on deserialization, and extends this "one copy" ability to any object type (including handling recursive references). This reduces both the size of ``.pyc`` files and the amount of memory a module occupies in memory when it is loaded from a ``.pyc`` (or ``.pyo``) file. (Contributed by Kristján Valur Jónsson in :issue:`16475`, with additional speedups by Antoine Pitrou in :issue:`19219`.)
pt_pt: A versão predefinida do :mod:`marshal` foi atualizada para 3. O código que implementa a nova versão restaura o comportamento do Python 2 de registar apenas uma cópia de *strings* internadas e preservar a internação na desserialização, e estende esta capacidade de "uma cópia" a qualquer tipo de objeto (incluindo o tratamento de referências recursivas). Isto reduz tanto o tamanho dos ficheiros ``.pyc`` como a quantidade de memória que um módulo ocupa na memória quando é carregado a partir de um ficheiro ``.pyc`` (ou ``.pyo``). (Contribuído por Kristján Valur Jónsson em :issue:`16475`, com melhorias adicionais de velocidade por Antoine Pitrou em :issue:`19219`.)
ru: Версия :mod:`marshal` по умолчанию увеличена до 3. Код, реализующий новую версию, восстанавливает поведение Python2, заключающееся в записи только одной копии интернированных строк и сохранении интернирования при десериализации, а также расширяет эту возможность "одной копии" на любую тип объекта (включая обработку рекурсивных ссылок). Это уменьшает как размер файлов ``.pyc``, так и объем памяти, занимаемый модулем в памяти при его загрузке из файла ``.pyc`` (или ``.pyo``). (Предоставлено Кристьяном Валюром Йонссоном в :issue:`16475`, с дополнительными ускорениями Антуаном Питру в :issue:`19219`.)
