Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: As part of this change, the :ref:`installing-index` and :ref:`distributing-index` sections of the documentation have been completely redesigned as short getting started and FAQ documents. Most packaging documentation has now been moved out to the Python Packaging Authority maintained `Python Packaging User Guide <https://packaging.python.org>`__ and the documentation of the individual projects.
pt_pt: Como parte dessa mudança, as secções :ref:`installing-index` e :ref:`distributing-index` da documentação foram completamente redesenhadas como documentos curtos de introdução e perguntas frequentes. A maior parte da documentação sobre empacotamento foi transferida para o `Python Packaging User Guide <https://packaging.python.org>`__, mantido pela Python Packaging Authority, e para a documentação dos projetos individuais.
ru: В рамках этого изменения разделы документации :ref:`installing-index` и :ref:`distributing-index` были полностью переработаны и теперь представляют собой краткие инструкции по началу работы и документы с часто задаваемыми вопросами. Большая часть документации по упаковке теперь перенесена в Управление по упаковке Python, где хранится «Руководство пользователя по упаковке Python <https://packaging.python.org>»__ и документация по отдельным проектам.

source: :pep:`453` -- Explicit bootstrapping of pip in Python installations
pt_pt: :pep:`453` -- Bootstrap explícito do pip em instalações do Python
ru: :pep:`453` -- Явная загрузка pip в установках Python

source: PEP written by Donald Stufft and Nick Coghlan, implemented by Donald Stufft, Nick Coghlan, Martin von Löwis and Ned Deily.
pt_pt: PEP escrita por Donald Stufft e Nick Coghlan, implementada por Donald Stufft, Nick Coghlan, Martin von Löwis e Ned Deily.
ru: PEP написан Дональдом Стаффтом и Ником Когланом и реализован Дональдом Стаффтом, Ником Когланом, Мартином фон Лёвисом и Недом Дейли.

source: PEP 446: Newly Created File Descriptors Are Non-Inheritable
pt_pt: PEP 446: Novos Descritores de Ficheiros Criados Não São Herdáveis
ru: PEP 446: вновь созданные дескрипторы файлов не наследуются

source: :pep:`446` makes newly created file descriptors :ref:`non-inheritable <fd_inheritance>`. In general, this is the behavior an application will want: when launching a new process, having currently open files also open in the new process can lead to all sorts of hard to find bugs, and potentially to security issues.
pt_pt: A :pep:`446` torna os novos descritores de ficheiros criados :ref:`não herdáveis <fd_inheritance>`. Em geral, este é o comportamento que uma aplicação desejará: ao lançar um novo processo, ter ficheiros atualmente abertos também abertos no novo processo pode levar a todo o tipo de erros difíceis de encontrar e, potencialmente, a problemas de segurança.
ru: :pep:`446` делает вновь созданные файловые дескрипторы :ref:`ненаследуемыми <fd_inheritance>`. В общем, это именно то поведение, которое нужно приложению: при запуске нового процесса наличие открытых в данный момент файлов также открытых в новом процессе может привести ко всем видам труднообнаружимых ошибок и, возможно, к проблемам безопасности.

source: However, there are occasions when inheritance is desired. To support these cases, the following new functions and methods are available:
pt_pt: No entanto, há ocasiões em que a herança é desejada. Para apoiar estes casos, as seguintes novas funções e métodos estão disponíveis:
ru: Однако бывают случаи, когда наследование желательно. Для поддержки этих случаев доступны следующие новые функции и методы:

source: :pep:`446` -- Make newly created file descriptors non-inheritable
pt_pt: :pep:`446` -- Tornar os novos descritores de ficheiros não herdáveis
ru: :pep:`446` -- Делает вновь созданные файловые дескрипторы ненаследуемыми

source: PEP written and implemented by Victor Stinner.
pt_pt: PEP escrito e implementado por Victor Stinner.
ru: PEP написан и реализован Виктором Стиннером.

source: Improvements to Codec Handling
pt_pt: Melhorias no Tratamento de Codecs
ru: Улучшения в обработке кодеков

source: Since it was first introduced, the :mod:`codecs` module has always been intended to operate as a type-neutral dynamic encoding and decoding system. However, its close coupling with the Python text model, especially the type restricted convenience methods on the builtin :class:`str`, :class:`bytes` and :class:`bytearray` types, has historically obscured that fact.
pt_pt: Desde que foi introduzido pela primeira vez, o módulo :mod:`codecs` foi sempre destinado a operar como um sistema dinâmico de codificação e descodificação neutro em relação ao tipo. No entanto, a sua estreita ligação com o modelo de texto do Python, especialmente os métodos de conveniência restritos por tipo nos tipos nativos :class:`str`, :class:`bytes` e :class:`bytearray`, obscureceu historicamente esse facto.
ru: С момента своего первого появления модуль :mod:`codecs` всегда предназначался для работы в качестве нейтральной по типу системы динамического кодирования и декодирования. Однако его тесная связь с текстовой моделью Python, особенно с удобными методами с ограниченным типом во встроенных типах :class:`str`, :class:`bytes` и :class:`bytearray`, исторически скрывала этот факт.

source: As a key step in clarifying the situation, the :meth:`codecs.encode` and :meth:`codecs.decode` convenience functions are now properly documented in Python 2.7, 3.3 and 3.4. These functions have existed in the :mod:`codecs` module (and have been covered by the regression test suite) since Python 2.4, but were previously only discoverable through runtime introspection.
pt_pt: Como um passo chave para clarificar a situação, as funções de conveniência :meth:`codecs.encode` e :meth:`codecs.decode` estão agora devidamente documentadas no Python 2.7, 3.3 e 3.4. Estas funções existem no módulo :mod:`codecs` (e têm sido cobertas pela suíte de testes de regressão) desde o Python 2.4, mas anteriormente só eram descobertas através de introspeção em tempo de execução.
ru: Ключевым шагом в прояснении ситуации стало то, что удобные функции :meth:`codecs.encode` и :meth:`codecs.decode` теперь правильно документированы в Python 2.7, 3.3 и 3.4. Эти функции существовали в модуле :mod:`codecs` (и были включены в набор регрессионных тестов) начиная с Python 2.4, но ранее их можно было обнаружить только посредством самоанализа во время выполнения.

source: Unlike the convenience methods on :class:`str`, :class:`bytes` and :class:`bytearray`, the :mod:`codecs` convenience functions support arbitrary codecs in both Python 2 and Python 3, rather than being limited to Unicode text encodings (in Python 3) or ``basestring`` <-> ``basestring`` conversions (in Python 2).
pt_pt: Ao contrário dos métodos de conveniência em :class:`str`, :class:`bytes` e :class:`bytearray`, as funções de conveniência do :mod:`codecs` suportam codecs arbitrários tanto no Python 2 como no Python 3, em vez de estarem limitadas a codificações de texto Unicode (no Python 3) ou conversões ``basestring`` <-> ``basestring`` (no Python 2).
ru: В отличие от удобных методов :class:`str`, :class:`bytes` и :class:`bytearray`, удобные функции :mod:`codecs` поддерживают произвольные кодеки как в Python 2, так и в Python 3, а не ограничены в текстовые кодировки Unicode (в Python 3) или преобразования ``basestring`` <-> ``basestring`` (в Python 2).

source: In Python 3.4, the interpreter is able to identify the known non-text encodings provided in the standard library and direct users towards these general purpose convenience functions when appropriate::
pt_pt: No Python 3.4, o interpretador é capaz de identificar as codificações não textuais conhecidas fornecidas na biblioteca padrão e direcionar os utilizadores para estas funções de conveniência de uso geral quando apropriado:
ru: В Python 3.4 интерпретатор может идентифицировать известные нетекстовые кодировки, представленные в стандартной библиотеке, и при необходимости направлять пользователей к этим удобным функциям общего назначения:

source: In a related change, whenever it is feasible without breaking backwards compatibility, exceptions raised during encoding and decoding operations are wrapped in a chained exception of the same type that mentions the name of the codec responsible for producing the error::
pt_pt: Numa mudança relacionada, sempre que for viável sem quebrar a compatibilidade retroativa, as exceções levantadas durante operações de codificação e descodificação são envolvidas numa exceção encadeada do mesmo tipo que menciona o nome do codec responsável por produzir o erro:
ru: В соответствующем изменении, если это возможно без нарушения обратной совместимости, исключения, возникающие во время операций кодирования и декодирования, оборачиваются цепочкой исключений того же типа, в которой упоминается имя кодека, ответственного за возникновение ошибки:

source: Finally, as the examples above show, these improvements have permitted the restoration of the convenience aliases for the non-Unicode codecs that were themselves restored in Python 3.2. This means that encoding binary data to and from its hexadecimal representation (for example) can now be written as::
pt_pt: Finalmente, como os exemplos acima mostram, estas melhorias permitiram a restauração dos *aliases* de conveniência para os codecs não Unicode que foram restaurados no Python 3.2. Isto significa que a codificação de dados binários para e a partir da sua representação hexadecimal (por exemplo) pode agora ser escrita como:
ru: Наконец, как показывают приведенные выше примеры, эти улучшения позволили восстановить удобные псевдонимы для кодеков, отличных от Unicode, которые сами были восстановлены в Python 3.2. Это означает, что кодирование двоичных данных в их шестнадцатеричное представление и обратно (например) теперь можно записать как:

source: The binary and text transforms provided in the standard library are detailed in :ref:`binary-transforms` and :ref:`text-transforms`.
pt_pt: As transformações binárias e de texto fornecidas na biblioteca padrão estão detalhadas em :ref:`binary-transforms` e :ref:`text-transforms`.
ru: Бинарные и текстовые преобразования, представленные в стандартной библиотеке, подробно описаны в разделах :ref:`binary-transforms` и :ref:`text-transforms`.

source: (Contributed by Nick Coghlan in :issue:`7475`, :issue:`17827`, :issue:`17828` and :issue:`19619`.)
pt_pt: (Contribuído por Nick Coghlan em :issue:`7475`, :issue:`17827`, :issue:`17828` e :issue:`19619`.)
ru: (Внесено Ником Когланом в :issue:`7475`, :issue:`17827`, :issue:`17828` и :issue:`19619`.)

source: PEP 451: A ModuleSpec Type for the Import System
pt_pt: PEP 451: Um Tipo ModuleSpec para o Sistema de Importação
ru: PEP 451: тип ModuleSpec для системы импорта

source: :pep:`451` provides an encapsulation of the information about a module that the import machinery will use to load it (that is, a module specification). This helps simplify both the import implementation and several import-related APIs. The change is also a stepping stone for `several future import-related improvements`__.
pt_pt: A :pep:`451` fornece uma encapsulação da informação sobre um módulo que a maquinaria de importação usará para carregá-lo (ou seja, uma especificação de módulo). Isto ajuda a simplificar tanto a implementação de importação como várias APIs relacionadas com importação. A mudança é também um passo para `várias melhorias futuras relacionadas com importação`__.
ru: :pep:`451` обеспечивает инкапсуляцию информации о модуле, которую механизм импорта будет использовать для его загрузки (то есть спецификация модуля). Это помогает упростить как реализацию импорта, так и некоторые API, связанные с импортом. Это изменение также является трамплином для «нескольких будущих улучшений, связанных с импортом».

source: The public-facing changes from the PEP are entirely backward-compatible. Furthermore, they should be transparent to everyone but importer authors. Key finder and loader methods have been deprecated, but they will continue working. New importers should use the new methods described in the PEP. Existing importers should be updated to implement the new methods. See the :ref:`deprecated-3.4` section for a list of methods that should be replaced and their replacements.
pt_pt: As alterações visíveis ao público provenientes da PEP são totalmente retrocompatíveis. Além disso, devem ser transparentes para todos, exceto para autores de importadores. Métodos principais de *finder* e *loader* foram descontinuados, mas continuarão a funcionar. Novos importadores devem usar os novos métodos descritos na PEP. Importadores existentes devem ser atualizados para implementar os novos métodos. Consulte a secção :ref:`deprecated-3.4` para uma lista de métodos que devem ser substituídos e as suas substituições.
ru: Публичные изменения PEP полностью обратно совместимы. Более того, они должны быть прозрачными для всех, кроме авторов-импортеров. Методы поиска ключей и загрузчика устарели, но они продолжат работать. Новым импортерам следует использовать новые методы, описанные в PEP. Существующие импортеры должны быть обновлены для внедрения новых методов. См. раздел :ref:`deprecated-3.4` для получения списка методов, которые следует заменить, и их замен.

source: Other Language Changes
pt_pt: Outras Alterações à Linguagem
ru: Другие языковые изменения

source: Some smaller changes made to the core Python language are:
pt_pt: Algumas alterações menores feitas à linguagem principal do Python são:
ru: Некоторые небольшие изменения, внесенные в основной язык Python:

source: Unicode database updated to UCD version 6.3.
pt_pt: Base de dados Unicode atualizada para a versão UCD 6.3.
ru: База данных Unicode обновлена ​​до версии UCD 6.3.

source: :func:`min` and :func:`max` now accept a *default* keyword-only argument that can be used to specify the value they return if the iterable they are evaluating has no elements. (Contributed by Julian Berman in :issue:`18111`.)
pt_pt: As funções :func:`min` e :func:`max` agora aceitam um argumento nomeado *default* que pode ser usado para especificar o valor que retornam se o iterável que estão a avaliar não tiver elementos. (Contribuído por Julian Berman em :issue:`18111`.)
ru: :func:`min` и :func:`max` теперь принимают аргумент *default*, содержащий только ключевые слова, который можно использовать для указания возвращаемого значения, если оцениваемая итерация не имеет элементов. (Предоставлено Джулианом Берманом в :issue:`18111`.)

source: Module objects are now :ref:`weakly referenceable <mod-weakref>`.
pt_pt: Os objetos de módulo são agora :ref:`referenciáveis fracamente <mod-weakref>`.
ru: Объекты модуля теперь :ref:`слабо доступны для ссылок <mod-weakref>`.

source: Module ``__file__`` attributes (and related values) should now always contain absolute paths by default, with the sole exception of ``__main__.__file__`` when a script has been executed directly using a relative path. (Contributed by Brett Cannon in :issue:`18416`.)
pt_pt: Os atributos ``__file__`` dos módulos (e valores relacionados) devem agora conter sempre caminhos absolutos por predefinição, com a única exceção de ``__main__.__file__`` quando um script é executado diretamente usando um caminho relativo. (Contribuído por Brett Cannon em :issue:`18416`.)
ru: Атрибуты модуля ``__file__`` (и связанные значения) теперь по умолчанию всегда должны содержать абсолютные пути, за единственным исключением ``__main__.__file__``, когда скрипт выполнялся напрямую с использованием относительного пути. (Предоставлено Бреттом Кэнноном в :issue:`18416`.)

source: All the UTF-\* codecs (except UTF-7) now reject surrogates during both encoding and decoding unless the ``surrogatepass`` error handler is used, with the exception of the UTF-16 decoder (which accepts valid surrogate pairs) and the UTF-16 encoder (which produces them while encoding non-BMP characters). (Contributed by Victor Stinner, Kang-Hao (Kenny) Lu and Serhiy Storchaka in :issue:`12892`.)
pt_pt: Todos os codecs UTF-* (exceto UTF-7) agora rejeitam *surrogates* durante a codificação e descodificação, a menos que seja usado o manipulador de erros ``surrogatepass``, com a exceção do descodificador UTF-16 (que aceita pares de *surrogates* válidos) e do codificador UTF-16 (que os produz ao codificar caracteres não-BMP). (Contribuído por Victor Stinner, Kang-Hao (Kenny) Lu e Serhiy Storchaka em :issue:`12892`.)
ru: Все кодеки UTF-\* (кроме UTF-7) теперь отклоняют суррогатные пары как во время кодирования, так и декодирования, если не используется обработчик ошибок surrogatepass, за исключением декодера UTF-16 (который принимает действительные суррогатные пары) и кодировщик UTF-16 (который создает их при кодировании символов, отличных от BMP). (Предоставлено Виктором Стиннером, Кан-Хао (Кенни) Лу и Сергеем Сторчакой в ​​:issue:`12892`.)

source: New German EBCDIC :ref:`codec <standard-encodings>` ``cp273``. (Contributed by Michael Bierenfeld and Andrew Kuchling in :issue:`1097797`.)
pt_pt: Novo :ref:`codec <standard-encodings>` EBCDIC alemão ``cp273``. (Contribuído por Michael Bierenfeld e Andrew Kuchling em :issue:`1097797`.)
ru: Новый немецкий EBCDIC :ref:`codec <standard-encodings>` ``cp273``. (Предоставлено Майклом Биренфельдом и Эндрю Кучлингом в :issue:`1097797`.)

source: New Ukrainian :ref:`codec <standard-encodings>` ``cp1125``. (Contributed by Serhiy Storchaka in :issue:`19668`.)
pt_pt: Novo :ref:`codec <standard-encodings>` ucraniano ``cp1125``. (Contribuído por Serhiy Storchaka em :issue:`19668`.)
ru: Новый украинский :ref:`codec <standard-encodings>` ``cp1125``. (Предоставлено Сергеем Сторчакой в ​​:issue:`19668`.)

source: :class:`bytes`.join() and :class:`bytearray`.join() now accept arbitrary buffer objects as arguments. (Contributed by Antoine Pitrou in :issue:`15958`.)
pt_pt: Os métodos :class:`bytes`.join() e :class:`bytearray`.join() agora aceitam objetos de buffer arbitrários como argumentos. (Contribuído por Antoine Pitrou em :issue:`15958`.)
ru: :class:`bytes`.join() и :class:`bytearray`.join() теперь принимают в качестве аргументов произвольные объекты буфера. (Предоставлено Антуаном Питру в :issue:`15958`.)

source: The :class:`int` constructor now accepts any object that has an ``__index__`` method for its *base* argument. (Contributed by Mark Dickinson in :issue:`16772`.)
pt_pt: O construtor :class:`int` agora aceita qualquer objeto que tenha um método ``__index__`` para o seu argumento *base*. (Contribuído por Mark Dickinson em :issue:`16772`.)
ru: Конструктор :class:`int` теперь принимает любой объект, имеющий метод __index__`` в качестве аргумента *base*. (Предоставлено Марком Дикинсоном в :issue:`16772`.)

source: Frame objects now have a :func:`~frame.clear` method that clears all references to local variables from the frame. (Contributed by Antoine Pitrou in :issue:`17934`.)
pt_pt: Os objetos *frame* agora têm um método :func:`~frame.clear` que limpa todas as referências a variáveis locais do *frame*. (Contribuído por Antoine Pitrou em :issue:`17934`.)
ru: Объекты фреймов теперь имеют метод :func:`~frame.clear`, который удаляет из фрейма все ссылки на локальные переменные. (Предоставлено Антуаном Питру в :issue:`17934`.)

source: :class:`memoryview` is now registered as a :class:`Sequence <collections.abc>`, and supports the :func:`reversed` builtin. (Contributed by Nick Coghlan and Claudiu Popa in :issue:`18690` and :issue:`19078`.)
pt_pt: :class:`memoryview` está agora registado como uma :class:`Sequence <collections.abc>`, e suporta a função integrada :func:`reversed`. (Contribuído por Nick Coghlan e Claudiu Popa em :issue:`18690` e :issue:`19078`.)
ru: :class:`memoryview` теперь зарегистрирован как :class:`Sequence <collections.abc>` и поддерживает встроенную функцию :func:`reversed`. (Предоставлено Ником Когланом и Клаудиу Попа в :issue:`18690` и :issue:`19078`.)

source: Signatures reported by :func:`help` have been modified and improved in several cases as a result of the introduction of Argument Clinic and other changes to the :mod:`inspect` and :mod:`pydoc` modules.
pt_pt: As assinaturas reportadas por :func:`help` foram modificadas e melhoradas em vários casos como resultado da introdução do Argument Clinic e de outras alterações aos módulos :mod:`inspect` e :mod:`pydoc`.
ru: Сигнатуры, о которых сообщает :func:`help`, были изменены и улучшены в нескольких случаях в результате внедрения Argument Clinic и других изменений в модулях :mod:`inspect` и :mod:`pydoc`.

source: :meth:`~object.__length_hint__` is now part of the formal language specification (see :pep:`424`). (Contributed by Armin Ronacher in :issue:`16148`.)
pt_pt: :meth:`~object.__length_hint__` faz agora parte da especificação formal da linguagem (ver :pep:`424`). (Contribuído por Armin Ronacher em :issue:`16148`.)
ru: :meth:`~object.__length_hint__` теперь является частью формальной спецификации языка (см. :pep:`424`). (Предоставлено Армином Ронахером в :issue:`16148`.)

source: New Modules
pt_pt: Novos Módulos
ru: Новые модули

source: The new :mod:`asyncio` module (defined in :pep:`3156`) provides a standard pluggable event loop model for Python, providing solid asynchronous IO support in the standard library, and making it easier for other event loop implementations to interoperate with the standard library and each other.
pt_pt: O novo módulo :mod:`asyncio` (definido na :pep:`3156`) fornece um modelo padrão de ciclo de eventos plugável para Python, proporcionando suporte sólido de IO assíncrona na biblioteca padrão, e facilitando a interoperabilidade de outras implementações de ciclo de eventos com a biblioteca padrão e entre si.
ru: Новый модуль :mod:`asyncio` (определенный в :pep:`3156`) предоставляет стандартную подключаемую модель цикла событий для Python, обеспечивая надежную поддержку асинхронного ввода-вывода в стандартной библиотеке и упрощая взаимодействие других реализаций цикла событий. со стандартной библиотекой и друг с другом.

source: For Python 3.4, this module is considered a :term:`provisional API`.
pt_pt: Para o Python 3.4, este módulo é considerado uma :term:`API provisória`.
ru: Для Python 3.4 этот модуль считается :term:`предварительным API`.

source: :pep:`3156` -- Asynchronous IO Support Rebooted: the "asyncio" Module
pt_pt: :pep:`3156` -- Suporte de IO Assíncrona Reiniciado: o Módulo "asyncio"
ru: :pep:`3156` -- Перезагрузка поддержки асинхронного ввода-вывода: модуль "asyncio"

source: PEP written and implementation led by Guido van Rossum.
pt_pt: PEP escrito e implementação liderada por Guido van Rossum.
ru: PEP написан и реализован под руководством Гвидо ван Россума.

source: The new :mod:`ensurepip` module is the primary infrastructure for the :pep:`453` implementation. In the normal course of events end users will not need to interact with this module, but it can be used to manually bootstrap ``pip`` if the automated bootstrapping into an installation or virtual environment was declined.
pt_pt: O novo módulo :mod:`ensurepip` é a infraestrutura principal para a implementação da :pep:`453`. No curso normal dos eventos, os utilizadores finais não precisarão de interagir com este módulo, mas ele pode ser usado para fazer manualmente o *bootstrap* do ``pip`` se o *bootstrap* automático numa instalação ou ambiente virtual tiver sido recusado.
ru: Новый модуль :mod:`ensurepip` является основной инфраструктурой для реализации :pep:`453`. При обычном ходе событий конечным пользователям не нужно будет взаимодействовать с этим модулем, но его можно использовать для ручной загрузки pip, если автоматическая загрузка в установочную или виртуальную среду была отклонена.
