Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: :mod:`ensurepip` includes a bundled copy of ``pip``, up-to-date as of the first release candidate of the release of CPython with which it ships (this applies to both maintenance releases and feature releases). ``ensurepip`` does not access the internet. If the installation has internet access, after ``ensurepip`` is run the bundled ``pip`` can be used to upgrade ``pip`` to a more recent release than the bundled one. (Note that such an upgraded version of ``pip`` is considered to be a separately installed package and will not be removed if Python is uninstalled.)
pt_pt: O módulo :mod:`ensurepip` inclui uma cópia em pacote do ``pip``, atualizada até à primeira versão candidata da versão do CPython com a qual é distribuído (isto aplica-se tanto a versões de manutenção como a versões com novas funcionalidades). O ``ensurepip`` não acede à Internet. Se a instalação tiver acesso à Internet, após a execução do ``ensurepip``, o ``pip`` em pacote pode ser usado para atualizar o ``pip`` para uma versão mais recente do que a versão em pacote. (Note que uma versão atualizada do ``pip`` é considerada um pacote instalado separadamente e não será removida se o Python for desinstalado.)
ru: :mod:`ensurepip` включает в себя связанную копию ``pip``, актуальную на момент первого кандидата на выпуск версии CPython, с которой он поставляется (это относится как к служебным выпускам, так и к выпускам функций). ``ensurepip`` не имеет доступа к Интернету. Если установка имеет доступ к Интернету, после запуска ensurepip входящий в комплект pip можно использовать для обновления pip до более свежей версии, чем входящий в комплект. (Обратите внимание, что такая обновленная версия ``pip`` считается отдельно установленным пакетом и не будет удалена при удалении Python.)

source: The module is named *ensure*\ pip because if called when ``pip`` is already installed, it does nothing. It also has an ``--upgrade`` option that will cause it to install the bundled copy of ``pip`` if the existing installed version of ``pip`` is older than the bundled copy.
pt_pt: O módulo é chamado *ensure*\ pip porque, se chamado quando o ``pip`` já está instalado, não faz nada. Também tem uma opção ``--upgrade`` que fará com que instale a cópia em pacote do ``pip`` se a versão instalada existente do ``pip`` for mais antiga do que a cópia em pacote.
ru: Модуль называется *ensure*\pip, потому что если его вызвать, когда ``pip`` уже установлен, он ничего не делает. У него также есть опция ``--upgrade``, которая заставит его установить связанную копию ``pip``, если существующая установленная версия ``pip`` старше, чем связанная копия.

source: The new :mod:`enum` module (defined in :pep:`435`) provides a standard implementation of enumeration types, allowing other modules (such as :mod:`socket`) to provide more informative error messages and better debugging support by replacing opaque integer constants with backwards compatible enumeration values.
pt_pt: O novo módulo :mod:`enum` (definido na :pep:`435`) fornece uma implementação padrão de tipos de enumeração, permitindo que outros módulos (como o :mod:`socket`) forneçam mensagens de erro mais informativas e melhor suporte de depuração, substituindo constantes inteiras opacas por valores de enumeração retrocompatíveis.
ru: Новый модуль :mod:`enum` (определенный в :pep:`435`) обеспечивает стандартную реализацию типов перечисления, позволяя другим модулям (таким как :mod:`socket`) предоставлять более информативные сообщения об ошибках и лучшую поддержку отладки. путем замены непрозрачных целочисленных констант обратно совместимыми значениями перечисления.

source: :pep:`435` -- Adding an Enum type to the Python standard library
pt_pt: :pep:`435` -- Adição de um Tipo Enum à Biblioteca Padrão do Python
ru: :pep:`435` -- Добавление типа Enum в стандартную библиотеку Python

source: PEP written by Barry Warsaw, Eli Bendersky and Ethan Furman, implemented by Ethan Furman.
pt_pt: PEP escrito por Barry Warsaw, Eli Bendersky e Ethan Furman, implementado por Ethan Furman.
ru: PEP, написанный Барри Варшавой, Эли Бендерски и Итаном Фурманом, реализован Итаном Фурманом.

source: The new :mod:`pathlib` module offers classes representing filesystem paths with semantics appropriate for different operating systems. Path classes are divided between *pure paths*, which provide purely computational operations without I/O, and *concrete paths*, which inherit from pure paths but also provide I/O operations.
pt_pt: O novo módulo :mod:`pathlib` oferece classes que representam caminhos de sistema de ficheiros com semânticas apropriadas para diferentes sistemas operativos. As classes de caminho estão divididas entre *caminhos puros*, que fornecem operações puramente computacionais sem I/O, e *caminhos concretos*, que herdam dos caminhos puros, mas também fornecem operações de I/O.
ru: Новый модуль :mod:`pathlib` предлагает классы, представляющие пути файловой системы с семантикой, подходящей для различных операционных систем. Классы путей делятся на *чистые пути*, которые обеспечивают чисто вычислительные операции без ввода-вывода, и *конкретные пути*, которые наследуются от чистых путей, но также обеспечивают операции ввода-вывода.

source: :pep:`428` -- The pathlib module -- object-oriented filesystem paths
pt_pt: :pep:`428` -- O módulo pathlib -- caminhos de sistema de ficheiros orientados a objetos
ru: :pep:`428` -- Модуль pathlib -- пути к объектно-ориентированной файловой системе

source: PEP written and implemented by Antoine Pitrou.
pt_pt: PEP escrito e implementado por Antoine Pitrou.
ru: PEP написан и реализован Антуаном Питру.

source: selectors
ru: селекторы

source: The new :mod:`selectors` module (created as part of implementing :pep:`3156`) allows high-level and efficient I/O multiplexing, built upon the :mod:`select` module primitives.
pt_pt: O novo módulo :mod:`selectors` (criado como parte da implementação da :pep:`3156`) permite multiplexação de I/O de alto nível e eficiente, construído sobre os primitivos do módulo :mod:`select`.
ru: Новый модуль :mod:`selectors` (созданный как часть реализации :pep:`3156`) обеспечивает высокоуровневое и эффективное мультиплексирование ввода-вывода, основанное на примитивах модуля :mod:`select`.

source: statistics
ru: статистика

source: The new :mod:`statistics` module (defined in :pep:`450`) offers some core statistics functionality directly in the standard library. This module supports calculation of the mean, median, mode, variance and standard deviation of a data series.
pt_pt: O novo módulo :mod:`statistics` (definido na :pep:`450`) oferece algumas funcionalidades estatísticas principais diretamente na biblioteca padrão. Este módulo suporta o cálculo da média, mediana, moda, variância e desvio padrão de uma série de dados.
ru: Новый модуль :mod:`statistics` (определенный в :pep:`450`) предлагает некоторые основные статистические функции непосредственно в стандартной библиотеке. Этот модуль поддерживает расчет среднего значения, медианы, моды, дисперсии и стандартного отклонения ряда данных.

source: :pep:`450` -- Adding A Statistics Module To The Standard Library
pt_pt: :pep:`450` -- Adição de um Módulo de Estatísticas à Biblioteca Padrão
ru: :pep:`450` -- Добавление модуля статистики в стандартную библиотеку

source: PEP written and implemented by Steven D'Aprano
pt_pt: PEP escrito e implementado por Steven D'Aprano
ru: PEP написан и реализован Стивеном Д'Апрано

source: The new :mod:`tracemalloc` module (defined in :pep:`454`) is a debug tool to trace memory blocks allocated by Python. It provides the following information:
pt_pt: O novo módulo :mod:`tracemalloc` (definido na :pep:`454`) é uma ferramenta de depuração para rastrear blocos de memória alocados pelo Python. Fornece as seguintes informações:
ru: Новый модуль :mod:`tracemalloc` (определенный в :pep:`454`) — это инструмент отладки для отслеживания блоков памяти, выделенных Python. Он предоставляет следующую информацию:

source: Trace where an object was allocated
pt_pt: Rastrear onde um objeto foi alocado
ru: Отследить, где был выделен объект

source: Statistics on allocated memory blocks per filename and per line number: total size, number and average size of allocated memory blocks
pt_pt: Estatísticas sobre blocos de memória alocados por nome de ficheiro e número de linha: tamanho total, número e tamanho médio dos blocos de memória alocados
ru: Статистика по выделенным блокам памяти по имени файла и по номеру строки: общий размер, количество и средний размер выделенных блоков памяти.

source: Compute the differences between two snapshots to detect memory leaks
pt_pt: Calcular as diferenças entre dois *snapshots* para detetar fugas de memória
ru: Вычисление различий между двумя снимками для обнаружения утечек памяти.

source: :pep:`454` -- Add a new tracemalloc module to trace Python memory allocations
pt_pt: :pep:`454` -- Adição de um novo módulo tracemalloc para rastrear alocações de memória do Python
ru: :pep:`454` -- Добавьте новый модуль Tracemalloc для отслеживания распределения памяти Python.

source: PEP written and implemented by Victor Stinner
pt_pt: PEP escrito e implementado por Victor Stinner
ru: PEP написан и реализован Виктором Стиннером

source: Improved Modules
pt_pt: Módulos Melhorados
ru: Улучшенные модули

source: New function :func:`abc.get_cache_token` can be used to know when to invalidate caches that are affected by changes in the object graph. (Contributed by Łukasz Langa in :issue:`16832`.)
pt_pt: Nova função :func:`abc.get_cache_token` que pode ser usada para saber quando invalidar caches que são afetadas por alterações no grafo de objetos. (Contribuído por Łukasz Langa em :issue:`16832`.)
ru: Новую функцию :func:`abc.get_cache_token` можно использовать, чтобы узнать, когда делать недействительными кеши, на которые влияют изменения в графе объектов. (Предоставлено Лукашом Лангой в :issue:`16832`.)

source: New class :class:`~abc.ABC` has :class:`~abc.ABCMeta` as its meta class. Using ``ABC`` as a base class has essentially the same effect as specifying ``metaclass=abc.ABCMeta``, but is simpler to type and easier to read. (Contributed by Bruno Dupuis in :issue:`16049`.)
pt_pt: Nova classe :class:`~abc.ABC` que tem :class:`~abc.ABCMeta` como sua metaclasse. Usar ``ABC`` como classe base tem essencialmente o mesmo efeito que especificar ``metaclass=abc.ABCMeta``, mas é mais simples de escrever e mais fácil de ler. (Contribuído por Bruno Dupuis em :issue:`16049`.)
ru: Новый класс :class:`~abc.ABC` имеет :class:`~abc.ABCMeta` в качестве метакласса. Использование ABC в качестве базового класса имеет по существу тот же эффект, что и указание Metaclass=abc.ABCMeta, но его проще набирать и легче читать. (Предоставлено Бруно Дюпюи в :issue:`16049`.)

source: The :meth:`~aifc.aifc.getparams` method now returns a namedtuple rather than a plain tuple. (Contributed by Claudiu Popa in :issue:`17818`.)
ru: Метод :meth:`~aifc.aifc.getparams` теперь возвращает именованный кортеж, а не простой кортеж. (Предоставлено Клаудиу Попа в :issue:`17818`.)

source: :func:`aifc.open` now supports the context management protocol: when used in a :keyword:`with` block, the :meth:`~aifc.aifc.close` method of the returned object will be called automatically at the end of the block. (Contributed by Serhiy Storchacha in :issue:`16486`.)
ru: :func:`aifc.open` теперь поддерживает протокол управления контекстом: при использовании в блоке :keyword:`with` метод :meth:`~aifc.aifc.close` возвращаемого объекта будет вызываться автоматически в конец блока. (Внесено Сергеем Сторчачей в :issue:`16486`.)

source: The :meth:`~aifc.aifc.writeframesraw` and :meth:`~aifc.aifc.writeframes` methods now accept any :term:`bytes-like object`. (Contributed by Serhiy Storchaka in :issue:`8311`.)
ru: Методы :meth:`~aifc.aifc.writeframesraw` и :meth:`~aifc.aifc.writeframes` теперь принимают любой :term:`байтовый объект`. (Предоставлено Сергеем Сторчакой в ​​:issue:`8311`.)

source: The :class:`~argparse.FileType` class now accepts *encoding* and *errors* arguments, which are passed through to :func:`open`. (Contributed by Lucas Maystre in :issue:`11175`.)
pt_pt: A classe :class:`~argparse.FileType` agora aceita argumentos *encoding* e *errors*, que são passados para :func:`open`. (Contribuído por Lucas Maystre em :issue:`11175`.)
ru: Класс :class:`~argparse.FileType` теперь принимает аргументы *encoding* и *errors*, которые передаются в :func:`open`. (Предоставлено Лукасом Майстре в :issue:`11175`.)

source: :mod:`audioop` now supports 24-bit samples. (Contributed by Serhiy Storchaka in :issue:`12866`.)
ru: :mod:`audioop` теперь поддерживает 24-битные сэмплы. (Добавлен Сергеем Сторчакой в ​​:issue:`12866`.)

source: New :func:`~audioop.byteswap` function converts big-endian samples to little-endian and vice versa. (Contributed by Serhiy Storchaka in :issue:`19641`.)
ru: Новая функция :func:`~audioop.byteswap` преобразует сэмплы с прямым порядком байтов в семплы с прямым порядком байтов и наоборот. (Предоставлено Сергеем Сторчакой в ​​:issue:`19641`.)

source: All :mod:`audioop` functions now accept any :term:`bytes-like object`. Strings are not accepted: they didn't work before, now they raise an error right away. (Contributed by Serhiy Storchaka in :issue:`16685`.)
ru: Все функции :mod:`audioop` теперь принимают любой :term:`байтовый объект`. Строки не принимаются: раньше не работали, теперь сразу выдают ошибку. (Добавлен Сергеем Сторчакой в ​​:issue:`16685`.)

source: The encoding and decoding functions in :mod:`base64` now accept any :term:`bytes-like object` in cases where it previously required a :class:`bytes` or :class:`bytearray` instance. (Contributed by Nick Coghlan in :issue:`17839`.)
pt_pt: As funções de codificação e descodificação em :mod:`base64` agora aceitam qualquer :term:`objeto do tipo bytes` nos casos em que anteriormente era necessário um objeto :class:`bytes` ou :class:`bytearray`. (Contribuído por Nick Coghlan em :issue:`17839`.)
ru: Функции кодирования и декодирования в :mod:`base64` теперь принимают любой :term:`bytes-подобный объект` в тех случаях, когда ранее для него требовался экземпляр :class:`bytes` или :class:`bytearray`. (Предоставлено Ником Когланом в :issue:`17839`.)

source: New functions :func:`~base64.a85encode`, :func:`~base64.a85decode`, :func:`~base64.b85encode`, and :func:`~base64.b85decode` provide the ability to encode and decode binary data from and to ``Ascii85`` and the git/mercurial ``Base85`` formats, respectively. The ``a85`` functions have options that can be used to make them compatible with the variants of the ``Ascii85`` encoding, including the Adobe variant. (Contributed by Martin Morrison, the Mercurial project, Serhiy Storchaka, and Antoine Pitrou in :issue:`17618`.)
pt_pt: Novas funções :func:`~base64.a85encode`, :func:`~base64.a85decode`, :func:`~base64.b85encode` e :func:`~base64.b85decode` que fornecem a capacidade de codificar e descodificar dados binários para e a partir de ``Ascii85`` e dos formatos ``Base85`` do git/mercurial, respetivamente. As funções ``a85`` têm opções que podem ser usadas para as tornar compatíveis com as variantes da codificação ``Ascii85``, incluindo a variante Adobe. (Contribuído por Martin Morrison, o projeto Mercurial, Serhiy Storchaka e Antoine Pitrou em :issue:`17618`.)
ru: Новые функции :func:`~base64.a85encode`, :func:`~base64.a85decode`, :func:`~base64.b85encode` и :func:`~base64.b85decode` предоставляют возможность кодировать и декодировать двоичные файлы. данные из и в форматы Ascii85 и git/mercurial Base85 соответственно. Функции ``a85`` имеют параметры, которые можно использовать для обеспечения их совместимости с вариантами кодировки ``Ascii85``, включая вариант Adobe. (Предоставлено Мартином Моррисоном, проект Mercurial, Сергеем Сторчакой и Антуаном Питру в :issue:`17618`.)

source: collections
ru: коллекции

source: The :meth:`.ChainMap.new_child` method now accepts an *m* argument specifying the child map to add to the chain. This allows an existing mapping and/or a custom mapping type to be used for the child. (Contributed by Vinay Sajip in :issue:`16613`.)
pt_pt: O método :meth:`.ChainMap.new_child` agora aceita um argumento *m* que especifica o mapa filho a adicionar à cadeia. Isto permite que um mapeamento existente e/ou um tipo de mapeamento personalizado seja usado para o filho. (Contribuído por Vinay Sajip em :issue:`16613`.)
ru: Метод :meth:`.ChainMap.new_child` теперь принимает аргумент *m*, указывающий дочернюю карту, добавляемую в цепочку. Это позволяет использовать существующее сопоставление и/или пользовательский тип сопоставления для дочернего элемента. (Предоставлено Винаем Саджипом в :issue:`16613`.)

source: The number of digits in the coefficients for the RGB --- YIQ conversions have been expanded so that they match the FCC NTSC versions. The change in results should be less than 1% and may better match results found elsewhere. (Contributed by Brian Landers and Serhiy Storchaka in :issue:`14323`.)
pt_pt: O número de dígitos nos coeficientes para as conversões RGB --- YIQ foi expandido para que correspondam às versões FCC NTSC. A mudança nos resultados deve ser inferior a 1% e pode corresponder melhor a resultados encontrados noutros locais. (Contribuído por Brian Landers e Serhiy Storchaka em :issue:`14323`.)
ru: Количество цифр в коэффициентах для преобразований RGB --- YIQ было расширено, чтобы они соответствовали версиям FCC NTSC. Изменение результатов должно составлять менее 1% и может лучше соответствовать результатам, полученным в других местах. (Предоставлено Брайаном Ландерсом и Сергеем Сторчакой в ​​:issue:`14323`.)

source: The new :class:`contextlib.suppress` context manager helps to clarify the intent of code that deliberately suppresses exceptions from a single statement. (Contributed by Raymond Hettinger in :issue:`15806` and Zero Piraeus in :issue:`19266`.)
pt_pt: O novo gestor de contexto :class:`contextlib.suppress` ajuda a clarificar a intenção do código que deliberadamente suprime exceções de uma única instrução. (Contribuído por Raymond Hettinger em :issue:`15806` e Zero Piraeus em :issue:`19266`.)
ru: Новый контекстный менеджер :class:`contextlib.suppress` помогает прояснить назначение кода, который намеренно подавляет исключения из одного оператора. (Предоставлено Раймондом Хеттингером в :issue:`15806` и Zero Piraeus в :issue:`19266`.)

source: The new :func:`contextlib.redirect_stdout` context manager makes it easier for utility scripts to handle inflexible APIs that write their output to :data:`sys.stdout` and don't provide any options to redirect it. Using the context manager, the :data:`sys.stdout` output can be redirected to any other stream or, in conjunction with :class:`io.StringIO`, to a string. The latter can be especially useful, for example, to capture output from a function that was written to implement a command line interface. It is recommended only for utility scripts because it affects the global state of :data:`sys.stdout`. (Contributed by Raymond Hettinger in :issue:`15805`.)
pt_pt: O novo gestor de contexto :func:`contextlib.redirect_stdout` facilita a manipulação de APIs inflexíveis que escrevem a sua saída para :data:`sys.stdout` e não fornecem opções para redirecioná-la por scripts de utilidade. Usando o gestor de contexto, a saída de :data:`sys.stdout` pode ser redirecionada para qualquer outro fluxo ou, em conjunto com :class:`io.StringIO`, para uma *string*. Esta última opção pode ser especialmente útil, por exemplo, para capturar a saída de uma função escrita para implementar uma interface de linha de comandos. É recomendado apenas para scripts de utilidade, pois afeta o estado global de :data:`sys.stdout`. (Contribuído por Raymond Hettinger em :issue:`15805`.)
ru: Новый контекстный менеджер :func:`contextlib.redirect_stdout` упрощает служебным сценариям обработку негибких API, которые записывают свои выходные данные в :data:`sys.stdout` и не предоставляют никаких возможностей для их перенаправления. С помощью диспетчера контекста вывод :data:`sys.stdout` можно перенаправить в любой другой поток или, в сочетании с :class:`io.StringIO`, в строку. Последнее может быть особенно полезно, например, для захвата вывода функции, написанной для реализации интерфейса командной строки. Рекомендуется только для служебных сценариев, поскольку влияет на глобальное состояние :data:`sys.stdout`. (Предоставлено Рэймондом Хеттингером в :issue:`15805`.)

source: The :mod:`contextlib` documentation has also been updated to include a :ref:`discussion <single-use-reusable-and-reentrant-cms>` of the differences between single use, reusable and reentrant context managers.
pt_pt: A documentação do módulo :mod:`contextlib` foi também atualizada para incluir uma :ref:`discussão <single-use-reusable-and-reentrant-cms>` sobre as diferenças entre gestores de contexto de uso único, reutilizáveis e reentrantes.
ru: Документация :mod:`contextlib` также была обновлена ​​и теперь включает :ref:`обсуждение <single-use-reusable-and-reentrant-cms>` различий между одноразовыми, многоразовыми и реентерабельными контекстными менеджерами.

source: :func:`dbm.open` objects now support the context management protocol. When used in a :keyword:`with` statement, the ``close`` method of the database object will be called automatically at the end of the block. (Contributed by Claudiu Popa and Nick Coghlan in :issue:`19282`.)
pt_pt: Os objetos :func:`dbm.open` agora suportam o protocolo de gestão de contexto. Quando usados numa instrução :keyword:`with`, o método ``close`` do objeto da base de dados será chamado automaticamente no final do bloco. (Contribuído por Claudiu Popa e Nick Coghlan em :issue:`19282`.)
ru: Объекты :func:`dbm.open` теперь поддерживают протокол управления контекстом. При использовании в операторе :keyword:`with` метод close объекта базы данных будет вызываться автоматически в конце блока. (Предоставлено Клаудиу Попа и Ником Когланом в :issue:`19282`.)

source: Functions :func:`~dis.show_code`, :func:`~dis.dis`, :func:`~dis.distb`, and :func:`~dis.disassemble` now accept a keyword-only *file* argument that controls where they write their output.
pt_pt: As funções :func:`~dis.show_code`, :func:`~dis.dis`, :func:`~dis.distb` e :func:`~dis.disassemble` agora aceitam um argumento nomeado *file* que controla onde escrevem a sua saída.
ru: Функции :func:`~dis.show_code`, :func:`~dis.dis`, :func:`~dis.distb` и :func:`~dis.disassemble` теперь принимают файл *file*, содержащий только ключевые слова. аргумент, который контролирует, куда они записывают свои выходные данные.

source: The :mod:`dis` module is now built around an :class:`~dis.Instruction` class that provides object oriented access to the details of each individual bytecode operation.
pt_pt: O módulo :mod:`dis` é agora construído em torno da classe :class:`~dis.Instruction`, que fornece acesso orientado a objetos aos detalhes de cada operação individual de *bytecode*.
ru: Модуль :mod:`dis` теперь построен на основе класса :class:`~dis.Instruction`, который обеспечивает объектно-ориентированный доступ к деталям каждой отдельной операции с байт-кодом.
