Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: :c:func:`PyUnicode_FromFormat` now supports width and precision specifications for ``%s``, ``%A``, ``%U``, ``%V``, ``%S``, and ``%R``. (Contributed by Ysj Ray and Victor Stinner in :issue:`7330`.)
pt_pt: A função :c:func:`PyUnicode_FromFormat` suporta agora especificações de largura e precisão para ``%s``, ``%A``, ``%U``, ``%V``, ``%S``, e ``%R``. (Contribuído por Ysj Ray e Victor Stinner em :issue:`7330`.)
ru: :c:func:`PyUnicode_FromFormat` теперь поддерживает спецификации ширины и точности для `` %s ``, `` %А ``, ``%U``, ``%V``, ``%S`` и ``%R``. (Предоставлено Ysj Ray и Виктором Стиннером в :issue:`7330`.)

source: New function :c:func:`PyStructSequence_InitType2` supplements the existing :c:func:`PyStructSequence_InitType` function. The difference is that it returns ``0`` on success and ``-1`` on failure.
pt_pt: A nova função :c:func:`PyStructSequence_InitType2` complementa a função existente :c:func:`PyStructSequence_InitType`. A diferença é que devolve ``0`` em caso de sucesso e ``-1`` em caso de falha.
ru: Новая функция :c:func:`PyStructSequence_InitType2` дополняет существующую функцию :c:func:`PyStructSequence_InitType`. Разница в том, что он возвращает «0» в случае успеха и «-1» в случае неудачи.

source: The CPython source can now be compiled using the address sanity checking features of recent versions of GCC and clang: the false alarms in the small object allocator have been silenced. (Contributed by Dhiru Kholia in :issue:`18596`.)
pt_pt: O código-fonte do CPython pode agora ser compilado usando as funcionalidades de verificação de sanidade de endereços das versões recentes do GCC e do clang: os falsos alarmes no alocador de objetos pequenos foram silenciados. (Contribuído por Dhiru Kholia em :issue:`18596`.)
ru: Исходный код CPython теперь можно скомпилировать с использованием функций проверки правильности адресов последних версий GCC и clang: ложные тревоги в распределителе небольших объектов отключены. (Предоставлено Дхиру Холией в :issue:`18596`.)

source: The Windows build now uses `Address Space Layout Randomization <https://en.wikipedia.org/wiki/Address_space_layout_randomization>`_ and `Data Execution Prevention <https://en.wikipedia.org/wiki/Data_Execution_Prevention>`_. (Contributed by Christian Heimes in :issue:`16632`.)
pt_pt: A construção para Windows usa agora `Randomização do Layout do Espaço de Endereçamento <https://en.wikipedia.org/wiki/Address_space_layout_randomization>`_ e `Prevenção de Execução de Dados <https://en.wikipedia.org/wiki/Data_Execution_Prevention>`_. (Contribuído por Christian Heimes em :issue:`16632`.)
ru: В сборке Windows теперь используются `Рандомизация макета адресного пространства <https://en.wikipedia.org/wiki/Address_space_layout_randomization>`_ и `Предотвращение выполнения данных <https://en.wikipedia.org/wiki/Data_Execution_Prevention>`_. (Предоставлено Кристианом Хаймсом в :issue:`16632`.)

source: New function :c:func:`PyObject_LengthHint` is the C API equivalent of :func:`operator.length_hint`. (Contributed by Armin Ronacher in :issue:`16148`.)
pt_pt: A nova função :c:func:`PyObject_LengthHint` é o equivalente na API C da função :func:`operator.length_hint`. (Contribuído por Armin Ronacher em :issue:`16148`.)
ru: Новая функция :c:func:` PyObj ect_LengthHint` является эквивалентом C API :func:`operator.length_hint`. (Предоставлено Армином Ронахером в :issue:`16148`.)

source: Other Improvements
pt_pt: Outras Melhorias
ru: Другие улучшения

source: The :ref:`python <using-on-cmdline>` command has a new :ref:`option <using-on-misc-options>`, ``-I``, which causes it to run in "isolated mode", which means that :data:`sys.path` contains neither the script's directory nor the user's ``site-packages`` directory, and all :envvar:`!PYTHON*` environment variables are ignored (it implies both ``-s`` and ``-E``). Other restrictions may also be applied in the future, with the goal being to isolate the execution of a script from the user's environment. This is appropriate, for example, when Python is used to run a system script. On most POSIX systems it can and should be used in the ``#!`` line of system scripts. (Contributed by Christian Heimes in :issue:`16499`.)
pt_pt: O comando :ref:`python <using-on-cmdline>` tem uma nova :ref:`opção <using-on-misc-options>`, ``-I``, que faz com que seja executado em "modo isolado", o que significa que :data:`sys.path` não contém nem o diretório do script nem o diretório ``site-packages`` do utilizador, e todas as variáveis de ambiente :envvar:`!PYTHON*` são ignoradas (implica tanto ``-s`` como ``-E``). Outras restrições podem também ser aplicadas no futuro, com o objetivo de isolar a execução de um script do ambiente do utilizador. Isto é apropriado, por exemplo, quando o Python é usado para executar um script do sistema. Na maioria dos sistemas POSIX, pode e deve ser usado na linha ``#!`` de scripts do sistema. (Contribuído por Christian Heimes em :issue:`16499`.)
ru: Команда :ref:`python <using-on-cmdline>` имеет новую :ref:`option <using-on-misc-options>`, ``-I``, которая заставляет ее работать в «изолированном режиме». ", что означает, что :data:`sys.path` не содержит ни каталога сценария, ни пользовательского каталога ``site-packages``, и все переменные среды :envvar:`!PYTHON*` игнорируются (это подразумевает оба `` -s`` и ``-E``). В будущем могут быть применены и другие ограничения с целью изолировать выполнение сценария от среды пользователя. Это подходит, например, когда Python используется для запуска системного сценария. В большинстве систем POSIX его можно и нужно использовать в строке системных сценариев ``#!``. (Предоставлено Кристианом Хаймсом в :issue:`16499`.)

source: Tab-completion is now enabled by default in the interactive interpreter on systems that support :mod:`readline`. History is also enabled by default, and is written to (and read from) the file :file:`~/.python-history`. (Contributed by Antoine Pitrou and Éric Araujo in :issue:`5845`.)
pt_pt: A conclusão automática por tabulação está agora ativada por predefinição no interpretador interativo em sistemas que suportam :mod:`readline`. O histórico também está ativado por predefinição e é escrito (e lido) no ficheiro :file:`~/.python-history`. (Contribuído por Antoine Pitrou e Éric Araujo em :issue:`5845`.)
ru: Завершение табуляции теперь включено по умолчанию в интерактивном интерпретаторе в системах, поддерживающих :mod:`readline`. История также включена по умолчанию и записывается (и считывается) из файла :file:`~/.python-history`. (Предоставлено Антуаном Питру и Эриком Араужо в :issue:`5845`.)

source: Invoking the Python interpreter with ``--version`` now outputs the version to standard output instead of standard error (:issue:`18338`). Similar changes were made to :mod:`argparse` (:issue:`18920`) and other modules that have script-like invocation capabilities (:issue:`18922`).
pt_pt: A invocação do interpretador Python com ``--version`` agora escreve a versão para a saída padrão em vez de para o erro padrão (:issue:`18338`). Alterações semelhantes foram feitas em :mod:`argparse` (:issue:`18920`) e noutros módulos que têm capacidades de invocação semelhantes a scripts (:issue:`18922`.)
ru: Вызов интерпретатора Python с ``--version`` теперь выводит версию на стандартный вывод вместо стандартной ошибки (:issue:`18338`). Аналогичные изменения были внесены в :mod:`argparse` (:issue:`18920`) и другие модули, имеющие возможности вызова, подобные сценариям (:issue:`18922`).

source: The CPython Windows installer now adds ``.py`` to the :envvar:`PATHEXT` variable when extensions are registered, allowing users to run a python script at the windows command prompt by just typing its name without the ``.py`` extension. (Contributed by Paul Moore in :issue:`18569`.)
pt_pt: O instalador do CPython para Windows adiciona agora ``.py`` à variável :envvar:`PATHEXT` quando as extensões são registadas, permitindo aos utilizadores executar um script Python na linha de comandos do Windows simplesmente digitando o seu nome, sem a extensão ``.py``. (Contribuído por Paul Moore em :issue:`18569`.)
ru: Установщик CPython для Windows теперь добавляет ``.py`` в переменную :envvar:`PATHEXT` при регистрации расширений, что позволяет пользователям запускать скрипт Python в командной строке Windows, просто введя его имя без ``.py` `расширение. (Предоставлено Полом Муром в :issue:`18569`.)

source: ``python -m`` now works with namespace packages.
pt_pt: ``python -m`` funciona agora com pacotes de *namespace*.
ru: ``python -m`` теперь работает с пакетами пространства имен.

source: The :mod:`stat` module is now implemented in C, which means it gets the values for its constants from the C header files, instead of having the values hard-coded in the python module as was previously the case.
pt_pt: O módulo :mod:`stat` é agora implementado em C, o que significa que obtém os valores para as suas constantes a partir dos ficheiros de cabeçalho C, em vez de ter os valores codificados no módulo Python, como era o caso anteriormente.
ru: Модуль :mod:`stat` теперь реализован на C, что означает, что он получает значения своих констант из заголовочных файлов C, вместо того, чтобы значения были жестко запрограммированы в модуле Python, как это было раньше.

source: Loading multiple python modules from a single OS module (``.so``, ``.dll``) now works correctly (previously it silently returned the first python module in the file). (Contributed by Václav Šmilauer in :issue:`16421`.)
pt_pt: O carregamento de vários módulos Python a partir de um único módulo do sistema operativo (``.so``, ``.dll``) funciona agora corretamente (anteriormente, devolvia silenciosamente o primeiro módulo Python no ficheiro). (Contribuído por Václav Šmilauer em :issue:`16421`.)
ru: Загрузка нескольких модулей Python из одного модуля ОС (``.so``, ``.dll``) теперь работает правильно (ранее она автоматически возвращала первый модуль Python в файле). (Предоставлено Вацлавом Шмилауэром в :issue:`16421`.)

source: A new opcode, :opcode:`LOAD_CLASSDEREF`, has been added to fix a bug in the loading of free variables in class bodies that could be triggered by certain uses of :ref:`__prepare__ <prepare>`. (Contributed by Benjamin Peterson in :issue:`17853`.)
ru: Новый код операции :opcode:`LOAD_CLASSDEREF` был добавлен для исправления ошибки при загрузке свободных переменных в телах классов, которая могла быть вызвана определенным использованием :ref:`__prepare__ <prepare>`. (Предоставлено Бенджамином Петерсоном в :issue:`17853`.)

source: A number of MemoryError-related crashes were identified and fixed by Victor Stinner using his :pep:`445`-based ``pyfailmalloc`` tool (:issue:`18408`, :issue:`18520`).
pt_pt: Vários *crashes* relacionados com MemoryError foram identificados e corrigidos por Victor Stinner usando a sua ferramenta ``pyfailmalloc`` baseada na :pep:`445` (:issue:`18408`, :issue:`18520`).
ru: Виктор Стиннер обнаружил и исправил ряд сбоев, связанных с MemoryError, с помощью своего инструмента ``pyfailmalloc``, основанного на :pep:`445` (:issue:`18408`, :issue:`18520`).

source: The ``pyvenv`` command now accepts a ``--copies`` option to use copies rather than symlinks even on systems where symlinks are the default. (Contributed by Vinay Sajip in :issue:`18807`.)
pt_pt: O comando ``pyvenv`` aceita agora uma opção ``--copies`` para usar cópias em vez de ligações simbólicas, mesmo em sistemas onde as ligações simbólicas são a predefinição. (Contribuído por Vinay Sajip em :issue:`18807`.)
ru: Команда ``pyvenv`` теперь принимает опцию ``--copies`` для использования копий вместо символических ссылок даже в системах, где символические ссылки используются по умолчанию. (Предоставлено Винаем Саджипом в :issue:`18807`.)

source: The ``pyvenv`` command also accepts a ``--without-pip`` option to suppress the otherwise-automatic bootstrapping of pip into the virtual environment. (Contributed by Nick Coghlan in :issue:`19552` as part of the :pep:`453` implementation.)
pt_pt: O comando ``pyvenv`` aceita também uma opção ``--without-pip`` para suprimir a inicialização automática do pip no ambiente virtual. (Contribuído por Nick Coghlan em :issue:`19552` como parte da implementação da :pep:`453`.)
ru: Команда pyvenv также принимает опцию --without-pip для подавления автоматической загрузки pip в виртуальную среду. (Внесено Ником Когланом в :issue:`19552` как часть реализации :pep:`453`.)

source: The encoding name is now optional in the value set for the :envvar:`PYTHONIOENCODING` environment variable. This makes it possible to set just the error handler, without changing the default encoding. (Contributed by Serhiy Storchaka in :issue:`18818`.)
pt_pt: O nome da codificação é agora opcional no valor definido para a variável de ambiente :envvar:`PYTHONIOENCODING`. Isto permite definir apenas o gestor de erros, sem alterar a codificação predefinida. (Contribuído por Serhiy Storchaka em :issue:`18818`.)
ru: Имя кодировки теперь является необязательным в значении, установленном для переменной среды :envvar:`PYTHONIOENCODING`. Это позволяет установить только обработчик ошибок, не меняя кодировку по умолчанию. (Предоставлено Сергеем Сторчакой в ​​:issue:`18818`.)

source: The :mod:`bz2`, :mod:`lzma`, and :mod:`gzip` module ``open`` functions now support ``x`` (exclusive creation) mode. (Contributed by Tim Heaney and Vajrasky Kok in :issue:`19201`, :issue:`19222`, and :issue:`19223`.)
pt_pt: As funções ``open`` dos módulos :mod:`bz2`, :mod:`lzma` e :mod:`gzip` suportam agora o modo ``x`` (criação exclusiva). (Contribuído por Tim Heaney e Vajrasky Kok em :issue:`19201`, :issue:`19222` e :issue:`19223`.)
ru: Функции ``open`` модулей :mod:`bz2`, :mod:`lzma` и :mod:`gzip` теперь поддерживают режим ``x`` (эксклюзивное создание). (Внесено Тимом Хини и Ваджраски Коком в :issue:`19201`, :issue:`19222` и :issue:`19223`.)

source: Significant Optimizations
pt_pt: Otimizações Significativas
ru: Значительные оптимизации

source: The UTF-32 decoder is now 3x to 4x faster. (Contributed by Serhiy Storchaka in :issue:`14625`.)
pt_pt: O descodificador UTF-32 é agora 3x a 4x mais rápido. (Contribuído por Serhiy Storchaka em :issue:`14625`.)
ru: Декодер UTF-32 теперь работает в 3–4 раза быстрее. (Добавлен Сергеем Сторчакой в ​​:issue:`14625`.)

source: The cost of hash collisions for sets is now reduced. Each hash table probe now checks a series of consecutive, adjacent key/hash pairs before continuing to make random probes through the hash table. This exploits cache locality to make collision resolution less expensive. The collision resolution scheme can be described as a hybrid of linear probing and open addressing. The number of additional linear probes defaults to nine. This can be changed at compile-time by defining LINEAR_PROBES to be any value. Set LINEAR_PROBES=0 to turn-off linear probing entirely. (Contributed by Raymond Hettinger in :issue:`18771`.)
pt_pt: O custo das colisões de hash para conjuntos foi reduzido. Cada pesquisa na tabela de hash verifica agora uma série de pares chave/hash consecutivos e adjacentes antes de continuar a fazer pesquisas aleatórias na tabela de hash. Isto explora a localidade da cache para tornar a resolução de colisões menos dispendiosa. O esquema de resolução de colisões pode ser descrito como um híbrido de pesquisa linear e endereçamento aberto. O número de pesquisas lineares adicionais é, por predefinição, nove. Isto pode ser alterado em tempo de compilação definindo LINEAR_PROBES para qualquer valor. Defina LINEAR_PROBES=0 para desativar completamente a pesquisa linear. (Contribuído por Raymond Hettinger em :issue:`18771`.)
ru: Стоимость коллизий хэшей для наборов теперь снижена. Каждый зонд хеш-таблицы теперь проверяет серию последовательных соседних пар ключ/хеш, прежде чем продолжить выполнение случайных зондирований по хеш-таблице. При этом используется локальность кэша, чтобы сделать разрешение коллизий менее затратным. Схему разрешения коллизий можно описать как гибрид линейного зондирования и открытой адресации. Количество дополнительных линейных датчиков по умолчанию равно девяти. Это можно изменить во время компиляции, определив для LINEAR_PROBES любое значение. Установите LINEAR_PROBES=0, чтобы полностью отключить линейное зондирование. (Предоставлено Рэймондом Хеттингером в :issue:`18771`.)

source: The interpreter starts about 30% faster. A couple of measures lead to the speedup. The interpreter loads fewer modules on startup, e.g. the :mod:`re`, :mod:`collections` and :mod:`locale` modules and their dependencies are no longer imported by default. The marshal module has been improved to load compiled Python code faster. (Contributed by Antoine Pitrou, Christian Heimes and Victor Stinner in :issue:`19219`, :issue:`19218`, :issue:`19209`, :issue:`19205` and :issue:`9548`.)
pt_pt: O interpretador inicia cerca de 30% mais rápido. Algumas medidas levam a este aumento de velocidade. O interpretador carrega menos módulos no arranque, por exemplo, os módulos :mod:`re`, :mod:`collections` e :mod:`locale` e as suas dependências já não são importados por predefinição. O módulo marshal foi melhorado para carregar código Python compilado mais rapidamente. (Contribuído por Antoine Pitrou, Christian Heimes e Victor Stinner em :issue:`19219`, :issue:`19218`, :issue:`19209`, :issue:`19205` e :issue:`9548`.)
ru: Интерпретатор запускается примерно на 30% быстрее. Несколько мер приводят к ускорению. Интерпретатор загружает меньше модулей при запуске, например, модули :mod:`re`, :mod:`collections` и :mod:`locale`, и их зависимости больше не импортируются по умолчанию. Модуль маршала был улучшен для более быстрой загрузки скомпилированного кода Python. (Внесено Антуаном Питру, Кристианом Хаймсом и Виктором Стиннером в :issue:`19219`, :issue:`19218`, :issue:`19209`, :issue:`19205` и :issue:`9548`.)

source: :class:`bz2.BZ2File` is now as fast or faster than the Python2 version for most cases. :class:`lzma.LZMAFile` has also been optimized. (Contributed by Serhiy Storchaka and Nadeem Vawda in :issue:`16034`.)
pt_pt: A classe :class:`bz2.BZ2File` é agora tão rápida ou mais rápida do que a versão Python2 na maioria dos casos. A classe :class:`lzma.LZMAFile` também foi otimizada. (Contribuído por Serhiy Storchaka e Nadeem Vawda em :issue:`16034`.)
ru: :class:`bz2.BZ2File` в большинстве случаев теперь работает так же быстро или даже быстрее, чем версия Python2. :class:`lzma.LZMAFile` также был оптимизирован. (Предоставлено Сергеем Сторчакой и Надимом Вавдой в :issue:`16034`.)

source: :func:`random.getrandbits` is 20%-40% faster for small integers (the most common use case). (Contributed by Serhiy Storchaka in :issue:`16674`.)
pt_pt: A função :func:`random.getrandbits` é 20%-40% mais rápida para inteiros pequenos (o caso de uso mais comum). (Contribuído por Serhiy Storchaka em :issue:`16674`.)
ru: :func:`random.getrandbits` работает на 20-40% быстрее для маленьких целых чисел (наиболее распространенный вариант использования). (Добавлен Сергеем Сторчакой в ​​:issue:`16674`.)

source: By taking advantage of the new storage format for strings, pickling of strings is now significantly faster. (Contributed by Victor Stinner and Antoine Pitrou in :issue:`15596`.)
pt_pt: Aproveitando o novo formato de armazenamento para strings, a serialização de strings é agora significativamente mais rápida. (Contribuído por Victor Stinner e Antoine Pitrou em :issue:`15596`.)
ru: Благодаря новому формату хранения строк травление строк теперь происходит значительно быстрее. (Предоставлено Виктором Стиннером и Антуаном Питру в :issue:`15596`.)

source: A performance issue in :meth:`io.FileIO.readall` has been solved. This particularly affects Windows, and significantly speeds up the case of piping significant amounts of data through :mod:`subprocess`. (Contributed by Richard Oudkerk in :issue:`15758`.)
ru: Проблема с производительностью в :meth:`io.FileIO.readall` решена. Это особенно влияет на Windows и значительно ускоряет передачу значительных объемов данных через :mod:`subprocess`. (Предоставлено Ричардом Оудкерком в :issue:`15758`.)

source: :func:`html.escape` is now 10x faster. (Contributed by Matt Bryant in :issue:`18020`.)
pt_pt: A função :func:`html.escape` é agora 10x mais rápida. (Contribuído por Matt Bryant em :issue:`18020`.)
ru: :func:`html.escape` теперь работает в 10 раз быстрее. (Предоставлено Мэттом Брайантом в :issue:`18020`.)

source: On Windows, the native ``VirtualAlloc`` is now used instead of the CRT ``malloc`` in ``obmalloc``. Artificial benchmarks show about a 3% memory savings.
pt_pt: No Windows, o ``VirtualAlloc`` nativo é agora usado em vez do ``malloc`` da CRT em ``obmalloc``. *Benchmarks* artificiais mostram uma poupança de cerca de 3% de memória.
ru: В Windows теперь вместо CRT malloc в obmalloc используется собственный VirtualAlloc. Искусственные тесты показывают экономию памяти примерно на 3%.

source: :func:`os.urandom` now uses a lazily opened persistent file descriptor so as to avoid using many file descriptors when run in parallel from multiple threads. (Contributed by Antoine Pitrou in :issue:`18756`.)
pt_pt: A função :func:`os.urandom` usa agora um descritor de ficheiro persistente aberto de forma preguiçosa, de modo a evitar o uso de muitos descritores de ficheiro quando executada em paralelo a partir de múltiplas *threads*. (Contribuído por Antoine Pitrou em :issue:`18756`.)
ru: :func:`os.urandom` теперь использует лениво открываемый постоянный файловый дескриптор, чтобы избежать использования множества файловых дескрипторов при параллельном запуске из нескольких потоков. (Предоставлено Антуаном Питру в :issue:`18756`.)

source: Deprecated
pt_pt: Obsoleto
ru: Устарел

source: This section covers various APIs and other features that have been deprecated in Python 3.4, and will be removed in Python 3.5 or later. In most (but not all) cases, using the deprecated APIs will produce a :exc:`DeprecationWarning` when the interpreter is run with deprecation warnings enabled (for example, by using ``-Wd``).
pt_pt: Esta secção abrange várias APIs e outras funcionalidades que foram depreciadas no Python 3.4 e serão removidas no Python 3.5 ou posterior. Na maioria (mas não em todos) dos casos, o uso das APIs depreciadas produzirá um :exc:`DeprecationWarning` quando o interpretador for executado com avisos de depreciação ativados (por exemplo, usando ``-Wd``).
ru: В этом разделе рассматриваются различные API и другие функции, которые устарели в Python 3.4 и будут удалены в Python 3.5 или более поздних версиях. В большинстве (но не во всех) случаях использование устаревших API приведет к появлению :exc:`DeprecationWarning`, когда интерпретатор запускается с включенными предупреждениями об устаревании (например, с помощью ``-Wd``).

source: Deprecations in the Python API
pt_pt: APIs Depreciadas no Python
ru: Устаревшие API Python

source: The :mod:`formatter` module is pending deprecation and is slated for removal in Python 3.6.
ru: Модуль :mod:`formatter` ожидает прекращения поддержки и планируется удалить в Python 3.6.

source: ``MD5`` as the default *digestmod* for the :func:`hmac.new` function is deprecated. Python 3.6 will require an explicit digest name or constructor as *digestmod* argument.
pt_pt: O uso de ``MD5`` como *digestmod* predefinido para a função :func:`hmac.new` está obsoleto. O Python 3.6 exigirá um nome de digest ou construtor explícito como argumento *digestmod*.
ru: ``MD5`` в качестве *digestmod* по умолчанию для функции :func:`hmac.new` устарел. Python 3.6 потребует явного имени или конструктора дайджеста в качестве аргумента *digestmod*.
