Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: What's New In Python 3.4
pt_pt: Novidades no Python 3.4
ru: Что нового в Python 3.4

source: Author
pt_pt: Autor
ru: Автор

source: R. David Murray <rdmurray@bitdance.com> (Editor)
ru: Р. Дэвид Мюррей <rdmurray@bitdance.com> (редактор)

source: This article explains the new features in Python 3.4, compared to 3.3. Python 3.4 was released on March 16, 2014. For full details, see the `changelog <https://docs.python.org/3.4/whatsnew/changelog.html>`_.
pt_pt: Este artigo explica as novas funcionalidades do Python 3.4, em comparação com o 3.3. O Python 3.4 foi lançado a 16 de março de 2014. Para mais detalhes, consulte o `registo de alterações <https://docs.python.org/3.4/whatsnew/changelog.html>`_.
ru: В этой статье объясняются новые возможности Python 3.4 по сравнению с версией 3.3. Python 3.4 был выпущен 16 марта 2014 г. Подробную информацию см. в журнале изменений <https://docs.python.org/3.4/whatsnew/changelog.html>`_.

source: :pep:`429` -- Python 3.4 Release Schedule
pt_pt: :pep:`429` -- Cronograma de Lançamento do Python 3.4
ru: :pep:`429` -- График выпуска Python 3.4

source: Summary -- Release Highlights
pt_pt: Resumo -- Destaques da Versão
ru: Резюме: основные моменты выпуска

source: New syntax features:
pt_pt: Novas funcionalidades de sintaxe:
ru: Новые возможности синтаксиса:

source: No new syntax features were added in Python 3.4.
pt_pt: Não foram adicionadas novas funcionalidades de sintaxe no Python 3.4.
ru: В Python 3.4 не было добавлено никаких новых синтаксических функций.

source: Other new features:
pt_pt: Outras novas funcionalidades:
ru: Другие новые функции:

source: :ref:`pip should always be available <whatsnew-pep-453>` (:pep:`453`).
pt_pt: :ref:`O pip deve estar sempre disponível <whatsnew-pep-453>` (:pep:`453`).
ru: :ref:`pip всегда должен быть доступен <whatsnew-pep-453>` (:pep:`453`).

source: :ref:`Newly created file descriptors are non-inheritable <whatsnew-pep-446>` (:pep:`446`).
pt_pt: :ref:`Os novos descritores de ficheiros criados não são herdáveis <whatsnew-pep-446>` (:pep:`446`).
ru: :ref:`Вновь созданные файловые дескрипторы не наследуются <whatsnew-pep-446>` (:pep:`446`).

source: command line option for :ref:`isolated mode <whatsnew-isolated-mode>` (:issue:`16499`).
pt_pt: Opção de linha de comandos para :ref:`modo isolado <whatsnew-isolated-mode>` (:issue:`16499`).
ru: опция командной строки для :ref:`изолированного режима <whatsnew-isolated-mode>` (:issue:`16499`).

source: :ref:`improvements in the handling of codecs <codec-handling-improvements>` that are not text encodings (multiple issues).
pt_pt: :ref:`melhorias no tratamento de codecs <codec-handling-improvements>` que não são codificações de texto (várias questões).
ru: :ref:`улучшения в обработке кодеков <codec-handling-improvements>`, которые не являются текстовыми кодировками (множественные проблемы).

source: :ref:`A ModuleSpec Type <whatsnew-pep-451>` for the Import System (:pep:`451`). (Affects importer authors.)
pt_pt: :ref:`Um tipo ModuleSpec <whatsnew-pep-451>` para o Sistema de Importação (:pep:`451`). (Afeta autores de importadores.)
ru: :ref:`Тип ModuleSpec <whatsnew-pep-451>` для системы импорта (:pep:`451`). (Касается авторов-импортеров.)

source: The :mod:`marshal` format has been made :ref:`more compact and efficient <whatsnew-marshal-3>` (:issue:`16475`).
pt_pt: O formato :mod:`marshal` foi tornado :ref:`mais compacto e eficiente <whatsnew-marshal-3>` (:issue:`16475`).
ru: Следующие устаревшие и ранее не рекомендуемые API и функции были удалены:

source: New library modules:
pt_pt: Novos módulos de biblioteca:
ru: Новые библиотечные модули:

source: :mod:`asyncio`: :ref:`New provisional API for asynchronous IO <whatsnew-asyncio>` (:pep:`3156`).
pt_pt: :mod:`asyncio`: :ref:`Nova API provisória para IO assíncrona <whatsnew-asyncio>` (:pep:`3156`).
ru: :mod:`asyncio`: :ref:`Новый временный API для асинхронного ввода-вывода <whatsnew-asyncio>` (:pep:`3156`).

source: :mod:`ensurepip`: :ref:`Bootstrapping the pip installer <whatsnew-ensurepip>` (:pep:`453`).
pt_pt: :mod:`ensurepip`: :ref:`Bootstrap do instalador pip <whatsnew-ensurepip>` (:pep:`453`).
ru: :mod:`ensurepip`: :ref:`Загрузка установщика pip <whatsnew-ensurepip>` (:pep:`453`).

source: :mod:`enum`: :ref:`Support for enumeration types <whatsnew-enum>` (:pep:`435`).
pt_pt: :mod:`enum`: :ref:`Suporte para tipos de enumeração <whatsnew-enum>` (:pep:`435`).
ru: :mod:`enum`: :ref:`Поддержка типов перечисления <whatsnew-enum>` (:pep:`435`).

source: :mod:`pathlib`: :ref:`Object-oriented filesystem paths <whatsnew-pathlib>` (:pep:`428`).
pt_pt: :mod:`pathlib`: :ref:`Caminhos de sistema de ficheiros orientados a objetos <whatsnew-pathlib>` (:pep:`428`).
ru: :mod:`pathlib`: :ref:`Пути к объектно-ориентированной файловой системе <whatsnew-pathlib>` (:pep:`428`).

source: :mod:`selectors`: :ref:`High-level and efficient I/O multiplexing <whatsnew-selectors>`, built upon the :mod:`select` module primitives (part of :pep:`3156`).
pt_pt: :mod:`selectors`: :ref:`Multiplexação de I/O de alto nível e eficiente <whatsnew-selectors>`, construída sobre os primitivos do módulo :mod:`select` (parte de :pep:`3156`).
ru: :mod:`selectors`: :ref:`Высокоуровневое и эффективное мультиплексирование ввода-вывода <whatsnew-selectors>`, построенное на примитивах модуля :mod:`select` (часть :pep:`3156`).

source: :mod:`statistics`: A basic :ref:`numerically stable statistics library <whatsnew-statistics>` (:pep:`450`).
pt_pt: :mod:`statistics`: Uma biblioteca básica de :ref:`estatísticas numericamentes estáveis <whatsnew-statistics>` (:pep:`450`).
ru: :mod:`statistics`: Базовая :ref:`библиотека численно стабильной статистики <whatsnew-statistics>` (:pep:`450`).

source: :mod:`tracemalloc`: :ref:`Trace Python memory allocations <whatsnew-tracemalloc>` (:pep:`454`).
pt_pt: :mod:`tracemalloc`: :ref:`Rastreio de alocações de memória do Python <whatsnew-tracemalloc>` (:pep:`454`).
ru: :mod:`tracemalloc`: :ref:`Отслеживание распределения памяти Python <whatsnew-tracemalloc>` (:pep:`454`).

source: Significantly improved library modules:
pt_pt: Módulos de biblioteca significativamente melhorados:
ru: Значительно улучшены библиотечные модули:

source: :ref:`Single-dispatch generic functions <whatsnew-singledispatch>` in :mod:`functools` (:pep:`443`).
pt_pt: :ref:`Funções genéricas de despacho único <whatsnew-singledispatch>` em :mod:`functools` (:pep:`443`).
ru: :ref:`Общие функции для одиночной диспетчеризации <whatsnew-singledispatch>` в :mod:`functools` (:pep:`443`).

source: New :mod:`pickle` :ref:`protocol 4 <whatsnew-protocol-4>` (:pep:`3154`).
pt_pt: Novo :mod:`pickle` :ref:`protocolo 4 <whatsnew-protocol-4>` (:pep:`3154`).
ru: Новый :mod:`pickle` :ref:`protocol 4 <whatsnew-protocol-4>` (:pep:`3154`).

source: :mod:`multiprocessing` now has :ref:`an option to avoid using os.fork on Unix <whatsnew-multiprocessing-no-fork>` (:issue:`8713`).
pt_pt: :mod:`multiprocessing` tem agora :ref:`uma opção para evitar o uso de os.fork no Unix <whatsnew-multiprocessing-no-fork>` (:issue:`8713`).
ru: :mod:`multiprocessing` теперь имеет :ref:`возможность избежать использования os.fork в Unix <whatsnew-multiprocessing-no-fork>` (:issue:`8713`).

source: :mod:`email` has a new submodule, :mod:`~email.contentmanager`, and a new :mod:`~email.message.Message` subclass (:class:`~email.contentmanager.EmailMessage`) that :ref:`simplify MIME handling <whatsnew_email_contentmanager>` (:issue:`18891`).
ru: :mod:`email` имеет новый подмодуль :mod:`~email.contentmanager` и новый подкласс :mod:`~email.message.Message` (:class:`~email.contentmanager.EmailMessage`), который :ref:`упростить обработку MIME <whatsnew_email_contentmanager>` (:issue:`18891`).

source: The :mod:`inspect` and :mod:`pydoc` modules are now capable of correct introspection of a much wider variety of callable objects, which improves the output of the Python :func:`help` system.
pt_pt: Os módulos :mod:`inspect` e :mod:`pydoc` são agora capazes de introspeção correta de uma variedade muito maior de objetos chamáveis, o que melhora a saída do sistema de :func:`help` do Python.
ru: Модули :mod:`inspect` и :mod:`pydoc` теперь способны корректно анализировать гораздо более широкий спектр вызываемых объектов, что улучшает результаты работы системы Python :func:`help`.

source: The :mod:`ipaddress` module API has been declared stable
pt_pt: A API do módulo :mod:`ipaddress` foi declarada estável.
ru: API модуля :mod:`ipaddress` объявлен стабильным.

source: Security improvements:
pt_pt: Melhorias de segurança:
ru: Улучшения безопасности:

source: :ref:`Secure and interchangeable hash algorithm <whatsnew-pep-456>` (:pep:`456`).
pt_pt: :ref:`Algoritmo de hash seguro e intercambiável <whatsnew-pep-456>` (:pep:`456`).
ru: :ref:`Безопасный и взаимозаменяемый алгоритм хеширования <whatsnew-pep-456>` (:pep:`456`).

source: :ref:`Make newly created file descriptors non-inheritable <whatsnew-pep-446>` (:pep:`446`) to avoid leaking file descriptors to child processes.
pt_pt: :ref:`Tornar os novos descritores de ficheiros não herdáveis <whatsnew-pep-446>` (:pep:`446`) para evitar vazamento de descritores de ficheiros para processos filhos.
ru: :ref:`Сделать вновь созданные файловые дескрипторы ненаследуемыми <whatsnew-pep-446>` (:pep:`446`), чтобы избежать утечки файловых дескрипторов в дочерние процессы.

source: New command line option for :ref:`isolated mode <whatsnew-isolated-mode>`, (:issue:`16499`).
pt_pt: Nova opção de linha de comandos para :ref:`modo isolado <whatsnew-isolated-mode>`, (:issue:`16499`).
ru: Новая опция командной строки для :ref:`изолированного режима <whatsnew-isolated-mode>`, (:issue:`16499`).

source: :mod:`multiprocessing` now has :ref:`an option to avoid using os.fork on Unix <whatsnew-multiprocessing-no-fork>`. *spawn* and *forkserver* are more secure because they avoid sharing data with child processes.
pt_pt: :mod:`multiprocessing` tem agora :ref:`uma opção para evitar o uso de os.fork no Unix <whatsnew-multiprocessing-no-fork>`. *spawn* e *forkserver* são mais seguros porque evitam partilhar dados com processos filhos.
ru: :mod:`multiprocessing` теперь имеет :ref:`возможность избежать использования os.fork в Unix <whatsnew-multiprocessing-no-fork>`. *spawn* и *forkserver* более безопасны, поскольку избегают обмена данными с дочерними процессами.

source: :mod:`multiprocessing` child processes on Windows no longer inherit all of the parent's inheritable handles, only the necessary ones.
pt_pt: Os processos filhos do :mod:`multiprocessing` no Windows já não herdam todos os descritores herdáveis do processo pai, apenas os necessários.
ru: :mod:`multiprocessing` дочерние процессы в Windows больше не наследуют все наследуемые дескрипторы родительского процесса, а только необходимые.

source: A new :func:`hashlib.pbkdf2_hmac` function provides the `PKCS#5 password-based key derivation function 2 <https://en.wikipedia.org/wiki/PBKDF2>`_.
pt_pt: Uma nova função :func:`hashlib.pbkdf2_hmac` fornece a `função de derivação de chave baseada em palavra-passe PKCS#5 2 <https://en.wikipedia.org/wiki/PBKDF2>`_.
ru: Новая функция :func:`hashlib.pbkdf2_hmac` обеспечивает функцию деривации ключей на основе пароля PKCS#5 2 <https://en.wikipedia.org/wiki/PBKDF2>`_.

source: :ref:`TLSv1.1 and TLSv1.2 support <whatsnew-tls-11-12>` for :mod:`ssl`.
pt_pt: :ref:`Suporte para TLSv1.1 e TLSv1.2 <whatsnew-tls-11-12>` para :mod:`ssl`.
ru: :ref:`TLSv1.1 и TLSv1.2 поддерживают <whatsnew-tls-11-12>` для :mod:`ssl`.

source: :ref:`Retrieving certificates from the Windows system cert store support <whatsnew34-win-cert-store>` for :mod:`ssl`.
pt_pt: :ref:`Suporte para recuperação de certificados do armazenamento de certificados do sistema Windows <whatsnew34-win-cert-store>` para :mod:`ssl`.
ru: :ref:`Получение сертификатов из хранилища системных сертификатов Windows поддерживает <whatsnew34-win-cert-store>` для :mod:`ssl`.

source: :ref:`Server-side SNI (Server Name Indication) support <whatsnew34-sni>` for :mod:`ssl`.
pt_pt: :ref:`Suporte para SNI (Server Name Indication) do lado do servidor <whatsnew34-sni>` para :mod:`ssl`.
ru: :ref:`SNI на стороне сервера (индикация имени сервера) поддерживает <whatsnew34-sni>` для :mod:`ssl`.

source: The :class:`ssl.SSLContext` class has a :ref:`lot of improvements <whatsnew34-sslcontext>`.
pt_pt: A classe :class:`ssl.SSLContext` tem :ref:`muitas melhorias <whatsnew34-sslcontext>`.
ru: Класс :class:`ssl.SSLContext` имеет :ref:`множество улучшений <whatsnew34-sslcontext>`.

source: All modules in the standard library that support SSL now support server certificate verification, including hostname matching (:func:`ssl.match_hostname`) and CRLs (Certificate Revocation lists, see :func:`ssl.SSLContext.load_verify_locations`).
ru: Все модули стандартной библиотеки, поддерживающие SSL, теперь поддерживают проверку сертификата сервера, включая сопоставление имен хостов (:func:`ssl.match_hostname`) и CRL (списки отзыва сертификатов, см. :func:`ssl.SSLContext.load_verify_locations`).

source: CPython implementation improvements:
pt_pt: Melhorias na implementação do CPython:
ru: Улучшения в реализации CPython:

source: :ref:`Safe object finalization <whatsnew-pep-442>` (:pep:`442`).
pt_pt: :ref:`Finalização segura de objetos <whatsnew-pep-442>` (:pep:`442`).
ru: :ref:`Безопасная финализация объекта <whatsnew-pep-442>` (:pep:`442`).

source: Leveraging :pep:`442`, in most cases :ref:`module globals are no longer set to None during finalization <whatsnew-pep-442>` (:issue:`18214`).
pt_pt: Aproveitando a :pep:`442`, na maioria dos casos, :ref:`as variáveis globais do módulo já não são definidas como None durante a finalização <whatsnew-pep-442>` (:issue:`18214`).
ru: Используя :pep:`442`, в большинстве случаев :ref:`глобальные переменные модуля больше не устанавливаются в значение None во время финализации <whatsnew-pep-442>` (:issue:`18214`).

source: :ref:`Configurable memory allocators <whatsnew-pep-445>` (:pep:`445`).
pt_pt: :ref:`Alocadores de memória configuráveis <whatsnew-pep-445>` (:pep:`445`).
ru: :ref:`Настраиваемые распределители памяти <whatsnew-pep-445>` (:pep:`445`).

source: :ref:`Argument Clinic <whatsnew-pep-436>` (:pep:`436`).
ru: :ref:`Клиника аргументов <whatsnew-pep-436>` (:pep:`436`).

source: Please read on for a comprehensive list of user-facing changes, including many other smaller improvements, CPython optimizations, deprecations, and potential porting issues.
pt_pt: Por favor, continue a ler para uma lista abrangente de alterações visíveis para o utilizador, incluindo muitas outras melhorias menores, otimizações do CPython, descontinuações e potenciais problemas de portabilidade.
ru: Пожалуйста, прочтите полный список изменений, с которыми сталкиваются пользователи, включая множество других небольших улучшений, оптимизацию CPython, прекращение поддержки и потенциальные проблемы с портированием.

source: New Features
pt_pt: Novas Funcionalidades
ru: Новые особенности

source: PEP 453: Explicit Bootstrapping of PIP in Python Installations
pt_pt: PEP 453: Bootstrap Explícito do PIP em Instalações do Python
ru: PEP 453: Явная загрузка PIP в установках Python

source: Bootstrapping pip By Default
pt_pt: Bootstrap do pip por Predefinição
ru: Начальная загрузка по умолчанию

source: The new :mod:`ensurepip` module (defined in :pep:`453`) provides a standard cross-platform mechanism to bootstrap the pip installer into Python installations and virtual environments. The version of ``pip`` included with Python 3.4.0 is ``pip`` 1.5.4, and future 3.4.x maintenance releases will update the bundled version to the latest version of ``pip`` that is available at the time of creating the release candidate.
pt_pt: O novo módulo :mod:`ensurepip` (definido na :pep:`453`) fornece um mecanismo padrão multiplataforma para fazer o bootstrap do instalador pip em instalações do Python e ambientes virtuais. A versão do ``pip`` incluída com o Python 3.4.0 é a ``pip`` 1.5.4, e futuras versões de manutenção 3.4.x atualizarão a versão incluída para a versão mais recente do ``pip`` disponível no momento da criação da versão candidata.
ru: Новый модуль :mod:`ensurepip` (определенный в :pep:`453`) предоставляет стандартный кросс-платформенный механизм для загрузки установщика pip в установки Python и виртуальные среды. Версия pip, включенная в Python 3.4.0, — это pip 1.5.4, а в будущих выпусках обслуживания 3.4.x включенная в комплект версия будет обновлена ​​до последней версии pip, доступной по адресу время создания релиз-кандидата.

source: By default, the commands ``pipX`` and ``pipX.Y`` will be installed on all platforms (where X.Y stands for the version of the Python installation), along with the ``pip`` Python package and its dependencies. On Windows and in virtual environments on all platforms, the unversioned ``pip`` command will also be installed. On other platforms, the system wide unversioned ``pip`` command typically refers to the separately installed Python 2 version.
pt_pt: Por predefinição, os comandos ``pipX`` e ``pipX.Y`` serão instalados em todas as plataformas (onde X.Y representa a versão da instalação do Python), juntamente com o pacote Python ``pip`` e as suas dependências. No Windows e em ambientes virtuais em todas as plataformas, o comando ``pip`` sem versão também será instalado. Noutras plataformas, o comando ``pip`` sem versão geralmente refere-se à versão do Python 2 instalada separadamente.
ru: По умолчанию команды pipX и pipX.Y будут установлены на всех платформах (где XY означает версию установки Python) вместе с пакетом Python pip и его зависимостями. . В Windows и в виртуальных средах на всех платформах также будет установлена ​​неверсированная команда pip. На других платформах общесистемная неверсированная команда pip обычно относится к отдельно установленной версии Python 2.

source: The ``pyvenv`` command line utility and the :mod:`venv` module make use of the :mod:`ensurepip` module to make ``pip`` readily available in virtual environments. When using the command line utility, ``pip`` is installed by default, while when using the :mod:`venv` module :ref:`venv-api` installation of ``pip`` must be requested explicitly.
pt_pt: A utilidade de linha de comandos ``pyvenv`` e o módulo :mod:`venv` usam o módulo :mod:`ensurepip` para tornar o ``pip`` facilmente disponível em ambientes virtuais. Ao usar a utilidade de linha de comandos, o ``pip`` é instalado por predefinição, enquanto que ao usar o módulo :mod:`venv` :ref:`venv-api`, a instalação do ``pip`` deve ser solicitada explicitamente.
ru: Утилита командной строки ``pyvenv`` и модуль :mod:`venv` используют модуль :mod:`ensurepip`, чтобы сделать ``pip`` легко доступным в виртуальных средах. При использовании утилиты командной строки ``pip`` устанавливается по умолчанию, а при использовании модуля :mod:`venv` установка ``pip`` должна быть запрошена явно.

source: For CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, the ``make install`` and ``make altinstall`` commands bootstrap ``pip`` by default. This behaviour can be controlled through configure options, and overridden through Makefile options.
pt_pt: Para :ref:`compilações a partir do código-fonte do CPython em sistemas POSIX <building-python-on-unix>`, os comandos ``make install`` e ``make altinstall`` fazem o bootstrap do ``pip`` por predefinição. Este comportamento pode ser controlado através de opções de configuração e substituído através de opções do Makefile.
ru: Для CPython :ref:`source, построенного на системах POSIX <building-python-on-unix>`, команды ``make install`` и ``make altinstall`` по умолчанию загружают ``pip``. Этим поведением можно управлять с помощью параметров конфигурации и переопределить с помощью параметров Makefile.

source: On Windows and Mac OS X, the CPython installers now default to installing ``pip`` along with CPython itself (users may opt out of installing it during the installation process). Window users will need to opt in to the automatic ``PATH`` modifications to have ``pip`` available from the command line by default, otherwise it can still be accessed through the Python launcher for Windows as ``py -m pip``.
pt_pt: No Windows e no Mac OS X, os instaladores do CPython agora instalam o ``pip`` junto com o próprio CPython por padrão (os utilizadores podem optar por não instalá-lo durante o processo de instalação). Os utilizadores do Windows precisarão optar pelas modificações automáticas do ``PATH`` para ter o ``pip`` disponível na linha de comando por padrão; caso contrário, ele ainda poderá ser acessado através do iniciador do Python para Windows como ``py -m pip``.
ru: В Windows и Mac OS X установщики CPython теперь по умолчанию устанавливают pip вместе с самим CPython (пользователи могут отказаться от его установки в процессе установки). Пользователям Windows необходимо будет согласиться на автоматические изменения PATH, чтобы pip был доступен из командной строки по умолчанию, в противном случае к нему все равно можно будет получить доступ через панель запуска Python для Windows как py -m pip. ``.

source: To avoid conflicts between parallel Python 2 and Python 3 installations, only the versioned ``pip3`` and ``pip3.4`` commands are bootstrapped by default when ``ensurepip`` is invoked directly - the ``--default-pip`` option is needed to also request the unversioned ``pip`` command. ``pyvenv`` and the Windows installer ensure that the unqualified ``pip`` command is made available in those environments, and ``pip`` can always be invoked via the ``-m`` switch rather than directly to avoid ambiguity on systems with multiple Python installations.
pt_pt: Para evitar conflitos entre instalações paralelas do Python 2 e Python 3, apenas os comandos com versão ``pip3`` e ``pip3.4`` são inicializados por predefinição quando ``ensurepip`` é invocado diretamente - a opção ``--default-pip`` é necessária para também solicitar o comando ``pip`` sem versão. O ``pyvenv`` e o instalador do Windows garantem que o comando ``pip`` sem qualificação esteja disponível nesses ambientes, e o ``pip`` pode sempre ser invocado através da opção ``-m`` em vez de diretamente para evitar ambiguidade em sistemas com múltiplas instalações do Python.
ru: Чтобы избежать конфликтов между параллельными установками Python 2 и Python 3, только версионные команды pip3 и pip3.4 загружаются по умолчанию, когда ensurepip вызывается напрямую - команда ``--default- Опция pip необходима для запроса неверсионной команды pip. ``pyvenv`` и установщик Windows гарантируют, что неполная команда ``pip`` доступна в этих средах, и ``pip`` всегда можно вызвать через ключ ``-m``, а не напрямую, чтобы избежать неоднозначность в системах с несколькими установками Python.

source: Documentation Changes
pt_pt: Alterações na documentação
ru: Изменения в документации
