Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: A new method, :func:`~dis.get_instructions`, provides an iterator that emits the Instruction stream for a given piece of Python code. Thus it is now possible to write a program that inspects and manipulates a bytecode object in ways different from those provided by the :mod:`~dis` module itself. For example::
pt_pt: Um novo método, :func:`~dis.get_instructions`, fornece um iterador que emite o fluxo de instruções para um determinado trecho de código Python. Assim, é agora possível escrever um programa que inspeciona e manipula um objeto de *bytecode* de maneiras diferentes daquelas fornecidas pelo próprio módulo :mod:`~dis`. Por exemplo::
ru: Новый метод :func:`~dis.get_instructions` предоставляет итератор, который генерирует поток инструкций для заданного фрагмента кода Python. Таким образом, теперь можно написать программу, которая проверяет и манипулирует объектом байт-кода способами, отличными от тех, которые предусмотрены самим модулем :mod:`~dis`. Например::

source: The various display tools in the :mod:`dis` module have been rewritten to use these new components.
pt_pt: As várias ferramentas de exibição no módulo :mod:`dis` foram reescritas para usar estes novos componentes.
ru: Различные инструменты отображения в модуле :mod:`dis` были переписаны для использования этих новых компонентов.

source: In addition, a new application-friendly class :class:`~dis.Bytecode` provides an object-oriented API for inspecting bytecode in both in human-readable form and for iterating over instructions. The :class:`~dis.Bytecode` constructor takes the same arguments that :func:`~dis.get_instruction` does (plus an optional *current_offset*), and the resulting object can be iterated to produce :class:`~dis.Instruction` objects. But it also has a :mod:`~dis.Bytecode.dis` method, equivalent to calling :mod:`~dis.dis` on the constructor argument, but returned as a multi-line string::
ru: Кроме того, новый удобный для приложений класс :class:`~dis.Bytecode` предоставляет объектно-ориентированный API для проверки байт-кода как в удобочитаемой форме, так и для перебора инструкций. Конструктор :class:`~dis.Bytecode` принимает те же аргументы, что и :func:`~dis.get_instruction` (плюс необязательный *current_offset*), и полученный объект можно перебирать для создания :class:`~dis Объекты .Instruction. Но у него также есть метод :mod:`~dis.Bytecode.dis`, эквивалентный вызову :mod:`~dis.dis` для аргумента конструктора, но возвращаемый в виде многострочной строки::

source: :class:`~dis.Bytecode` also has a class method, :meth:`~dis.Bytecode.from_traceback`, that provides the ability to manipulate a traceback (that is, ``print(Bytecode.from_traceback(tb).dis())`` is equivalent to ``distb(tb)``).
pt_pt: A classe :class:`~dis.Bytecode` também tem um método de classe, :meth:`~dis.Bytecode.from_traceback`, que fornece a capacidade de manipular um *traceback* (ou seja, ``print(Bytecode.from_traceback(tb).dis())`` é equivalente a ``distb(tb)``).
ru: :class:`~dis.Bytecode` также имеет метод класса :meth:`~dis.Bytecode.from_traceback`, который предоставляет возможность манипулировать обратной трассировкой (то есть ``print(Bytecode.from_traceback(tb). dis())`` эквивалентен ``distb(tb)``).

source: (Contributed by Nick Coghlan, Ryan Kelly and Thomas Kluyver in :issue:`11816` and Claudiu Popa in :issue:`17916`.)
pt_pt: (Contribuído por Nick Coghlan, Ryan Kelly e Thomas Kluyver em :issue:`11816` e Claudiu Popa em :issue:`17916`.)
ru: (Сообщили Ник Коглан, Райан Келли и Томас Клюйвер в :issue:`11816` и Клаудиу Попа в :issue:`17916`.)

source: New function :func:`~dis.stack_effect` computes the effect on the Python stack of a given opcode and argument, information that is not otherwise available. (Contributed by Larry Hastings in :issue:`19722`.)
pt_pt: Nova função :func:`~dis.stack_effect` calcula o efeito na pilha do Python de um determinado *opcode* e argumento, informação que não está disponível de outra forma. (Contribuído por Larry Hastings em :issue:`19722`.)
ru: Новая функция :func:`~dis.stack_effect` вычисляет влияние на стек Python заданного кода операции и аргумента, информация, которая иначе недоступна. (Предоставлено Ларри Гастингсом в :issue:`19722`.)

source: A new :ref:`option flag <doctest-options>`, :const:`~doctest.FAIL_FAST`, halts test running as soon as the first failure is detected. (Contributed by R. David Murray and Daniel Urban in :issue:`16522`.)
pt_pt: Uma nova :ref:`flag de opção <doctest-options>`, :const:`~doctest.FAIL_FAST`, interrompe a execução dos testes assim que a primeira falha é detetada. (Contribuído por R. David Murray e Daniel Urban em :issue:`16522`.)
ru: Новый флаг опции <doctest-options>`, :const:`~doctest.FAIL_FAST`, останавливает выполнение теста, как только обнаруживается первый сбой. (Предоставлено Р. Дэвидом Мюрреем и Дэниелом Урбаном в :issue:`16522`.)

source: The :mod:`doctest` command line interface now uses :mod:`argparse`, and has two new options, ``-o`` and ``-f``. ``-o`` allows :ref:`doctest options <doctest-options>` to be specified on the command line, and ``-f`` is a shorthand for ``-o FAIL_FAST`` (to parallel the similar option supported by the :mod:`unittest` CLI). (Contributed by R. David Murray in :issue:`11390`.)
pt_pt: A interface de linha de comandos do :mod:`doctest` agora usa :mod:`argparse` e tem duas novas opções, ``-o`` e ``-f``. ``-o`` permite que as :ref:`opções do doctest <doctest-options>` sejam especificadas na linha de comandos, e ``-f`` é um atalho para ``-o FAIL_FAST`` (para ser paralelo à opção semelhante suportada pela CLI do :mod:`unittest`). (Contribuído por R. David Murray em :issue:`11390`.)
ru: Интерфейс командной строки :mod:`doctest` теперь использует :mod:`argparse` и имеет две новые опции: ``-o`` и ``-f``. ``-o`` позволяет указывать опции doctest <doctest-options>` в командной строке, а ``-f`` является сокращением для ``-o FAIL_FAST`` (для параллельного выполнения аналогичного опция, поддерживаемая CLI :mod:`unittest`). (Предоставлено Р. Дэвидом Мюрреем в :issue:`11390`.)

source: :mod:`doctest` will now find doctests in extension module ``__doc__`` strings. (Contributed by Zachary Ware in :issue:`3158`.)
pt_pt: O :mod:`doctest` agora encontrará *doctests* em *strings* ``__doc__`` de módulos de extensão. (Contribuído por Zachary Ware em :issue:`3158`.)
ru: :mod:`doctest` теперь будет искать доктесты в строках модуля расширения ``__doc__``. (Предоставлено Закари Уэром в :issue:`3158`.)

source: email
ru: электронная почта

source: :meth:`~email.message.Message.as_string` now accepts a *policy* argument to override the default policy of the message when generating a string representation of it. This means that ``as_string`` can now be used in more circumstances, instead of having to create and use a :mod:`~email.generator` in order to pass formatting parameters to its ``flatten`` method. (Contributed by R. David Murray in :issue:`18600`.)
pt_pt: O método :meth:`~email.message.Message.as_string` agora aceita um argumento *policy* para substituir a política predefinida da mensagem ao gerar uma representação em *string* da mesma. Isto significa que ``as_string`` pode agora ser usado em mais circunstâncias, em vez de ter de criar e usar um :mod:`~email.generator` para passar parâmetros de formatação ao seu método ``flatten``. (Contribuído por R. David Murray em :issue:`18600`.)
ru: :meth:`~email.message.Message.as_string` теперь принимает аргумент *policy* для переопределения политики сообщения по умолчанию при создании его строкового представления. Это означает, что ``as_string`` теперь можно использовать в большем количестве случаев, вместо того, чтобы создавать и использовать :mod:`~email.generator` для передачи параметров форматирования в его `` Flatten`` метод. (Предоставлено Р. Дэвидом Мюрреем в :issue:`18600`.)

source: New method :meth:`~email.message.Message.as_bytes` added to produce a bytes representation of the message in a fashion similar to how ``as_string`` produces a string representation. It does not accept the *maxheaderlen* argument, but does accept the *unixfrom* and *policy* arguments. The :class:`~email.message.Message` :meth:`~email.message.Message.__bytes__` method calls it, meaning that ``bytes(mymsg)`` will now produce the intuitive result: a bytes object containing the fully formatted message. (Contributed by R. David Murray in :issue:`18600`.)
pt_pt: Novo método :meth:`~email.message.Message.as_bytes` adicionado para produzir uma representação em *bytes* da mensagem de forma semelhante a como ``as_string`` produz uma representação em *string*. Não aceita o argumento *maxheaderlen*, mas aceita os argumentos *unixfrom* e *policy*. O método :class:`~email.message.Message` :meth:`~email.message.Message.__bytes__` chama-o, o que significa que ``bytes(mymsg)`` produzirá agora o resultado intuitivo: um objeto *bytes* contendo a mensagem totalmente formatada. (Contribuído por R. David Murray em :issue:`18600`.)
ru: Добавлен новый метод :meth:`~email.message.Message.as_bytes` для создания байтового представления сообщения аналогично тому, как ``as_string`` создает строковое представление. Он не принимает аргумент *maxheaderlen*, но принимает аргументы *unixfrom* и *policy*. Метод :class:`~email.message.Message` :meth:`~email.message.Message.__bytes__` вызывает его, а это означает, что ``bytes(mymsg)`` теперь выдаст интуитивно понятный результат: объект bytes, содержащий полностью отформатированное сообщение. (Предоставлено Р. Дэвидом Мюрреем в :issue:`18600`.)

source: The :meth:`.Message.set_param` message now accepts a *replace* keyword argument. When specified, the associated header will be updated without changing its location in the list of headers. For backward compatibility, the default is ``False``. (Contributed by R. David Murray in :issue:`18891`.)
pt_pt: A mensagem :meth:`.Message.set_param` agora aceita um argumento nomeado *replace*. Quando especificado, o cabeçalho associado será atualizado sem alterar a sua localização na lista de cabeçalhos. Para retrocompatibilidade, o predefinido é ``False``. (Contribuído por R. David Murray em :issue:`18891`.)
ru: Сообщение :meth:`.Message.set_param` теперь принимает аргумент ключевого слова *replace*. Если указано, связанный заголовок будет обновлен без изменения его местоположения в списке заголовков. Для обратной совместимости по умолчанию установлено значение «False». (Предоставлено Р. Дэвидом Мюрреем в :issue:`18891`.)

source: A pair of new subclasses of :class:`~email.message.Message` have been added (:class:`.EmailMessage` and :class:`.MIMEPart`), along with a new sub-module, :mod:`~email.contentmanager` and a new :mod:`~email.policy` attribute :attr:`~email.policy.EmailPolicy.content_manager`. All documentation is currently in the new module, which is being added as part of email's new :term:`provisional API`. These classes provide a number of new methods that make extracting content from and inserting content into email messages much easier. For details, see the :mod:`~email.contentmanager` documentation and the :ref:`email-examples`. These API additions complete the bulk of the work that was planned as part of the email6 project. The currently provisional API is scheduled to become final in Python 3.5 (possibly with a few minor additions in the area of error handling). (Contributed by R. David Murray in :issue:`18891`.)
pt_pt: Foi adicionado um par de novas subclasses de :class:`~email.message.Message` (:class:`.EmailMessage` e :class:`.MIMEPart`), juntamente com um novo submódulo, :mod:`~email.contentmanager`, e um novo atributo :mod:`~email.policy` :attr:`~email.policy.EmailPolicy.content_manager`. Toda a documentação está atualmente no novo módulo, que está a ser adicionado como parte da nova :term:`API provisória` do email. Estas classes fornecem vários novos métodos que tornam a extração de conteúdo de mensagens de email e a inserção de conteúdo nelas muito mais fácil. Para mais detalhes, consulte a documentação do :mod:`~email.contentmanager` e os :ref:`email-examples`. Estas adições à API completam a maior parte do trabalho que foi planeado como parte do projeto email6. A API atualmente provisória está programada para se tornar final no Python 3.5 (possivelmente com algumas pequenas adições na área de tratamento de erros). (Contribuído por R. David Murray em :issue:`18891`.)
ru: Была добавлена ​​пара новых подклассов :class:`~email.message.Message` (:class:`.EmailMessage` и :class:`.MIMEPart`), а также новый подмодуль :mod:` ~email.contentmanager` и новый атрибут :mod:`~email.policy` :attr:`~email.policy.EmailPolicy.content_manager`. Вся документация в настоящее время находится в новом модуле, который добавляется как часть нового :term:`предварительного API` электронной почты. Эти классы предоставляют ряд новых методов, которые значительно упрощают извлечение содержимого и вставку содержимого в сообщения электронной почты. Подробности смотрите в документации :mod:`~email.contentmanager` и :ref:`email-examples`. Эти дополнения API завершают основную часть работы, запланированной в рамках проекта email6. Планируется, что нынешний предварительный API станет окончательным в Python 3.5 (возможно, с несколькими незначительными дополнениями в области обработки ошибок). (Предоставлено Р. Дэвидом Мюрреем в :issue:`18891`.)

source: A new :func:`~filecmp.clear_cache` function provides the ability to clear the :mod:`filecmp` comparison cache, which uses :func:`os.stat` information to determine if the file has changed since the last compare. This can be used, for example, if the file might have been changed and re-checked in less time than the resolution of a particular filesystem's file modification time field. (Contributed by Mark Levitt in :issue:`18149`.)
pt_pt: Uma nova função :func:`~filecmp.clear_cache` fornece a capacidade de limpar a cache de comparação do :mod:`filecmp`, que usa informações de :func:`os.stat` para determinar se o ficheiro foi alterado desde a última comparação. Isto pode ser usado, por exemplo, se o ficheiro tiver sido alterado e re-verificado em menos tempo do que a resolução do campo de modificação de ficheiros de um sistema de ficheiros específico. (Contribuído por Mark Levitt em :issue:`18149`.)
ru: Новая функция :func:`~filecmp.clear_cache` обеспечивает возможность очистки кэша сравнения :mod:`filecmp`, который использует информацию :func:`os.stat` для определения того, изменился ли файл с момента последнего сравнения. Это можно использовать, например, если файл мог быть изменен и перепроверен за меньшее время, чем разрешение поля времени модификации файла конкретной файловой системы. (Предоставлено Марком Левиттом в :issue:`18149`.)

source: New module attribute :const:`~filecmp.DEFAULT_IGNORES` provides the list of directories that are used as the default value for the *ignore* parameter of the :func:`~filecmp.dircmp` function. (Contributed by Eli Bendersky in :issue:`15442`.)
pt_pt: Novo atributo do módulo :const:`~filecmp.DEFAULT_IGNORES` fornece a lista de diretórios que são usados como valor predefinido para o parâmetro *ignore* da função :func:`~filecmp.dircmp`. (Contribuído por Eli Bendersky em :issue:`15442`.)
ru: Новый атрибут модуля :const:`~filecmp.DEFAULT_IGNORES` предоставляет список каталогов, которые используются в качестве значения по умолчанию для параметра *ignore* функции :func:`~filecmp.dircmp`. (Предоставлено Эли Бендерским в :issue:`15442`.)

source: The new :func:`~functools.partialmethod` descriptor brings partial argument application to descriptors, just as :func:`~functools.partial` provides for normal callables. The new descriptor also makes it easier to get arbitrary callables (including :func:`~functools.partial` instances) to behave like normal instance methods when included in a class definition. (Contributed by Alon Horev and Nick Coghlan in :issue:`4331`.)
pt_pt: O novo descritor :func:`~functools.partialmethod` traz a aplicação parcial de argumentos para descritores, tal como :func:`~functools.partial` fornece para objetos chamáveis normais. O novo descritor também facilita a obtenção de objetos chamáveis arbitrários (incluindo instâncias de :func:`~functools.partial`) para se comportarem como métodos de instância normais quando incluídos numa definição de classe. (Contribuído por Alon Horev e Nick Coghlan em :issue:`4331`.)
ru: Новый дескриптор :func:`~functools.partialmethod` обеспечивает применение частичных аргументов к дескрипторам, точно так же, как :func:`~functools.partial` обеспечивает обычные вызываемые объекты. Новый дескриптор также упрощает получение произвольных вызываемых объектов (включая экземпляры :func:`~functools.partial`), которые будут вести себя как обычные методы экземпляра при включении в определение класса. (Предоставлено Алоном Хоревом и Ником Когланом в :issue:`4331`.)

source: The new :func:`~functools.singledispatch` decorator brings support for single-dispatch generic functions to the Python standard library. Where object oriented programming focuses on grouping multiple operations on a common set of data into a class, a generic function focuses on grouping multiple implementations of an operation that allows it to work with *different* kinds of data.
pt_pt: O novo decorador :func:`~functools.singledispatch` traz suporte para funções genéricas de despacho único para a biblioteca padrão do Python. Enquanto a programação orientada a objetos se concentra em agrupar múltiplas operações num conjunto comum de dados numa classe, uma função genérica concentra-se em agrupar múltiplas implementações de uma operação que permite que ela funcione com *diferentes* tipos de dados.
ru: Новый декоратор :func:`~functools.singledispatch` обеспечивает поддержку универсальных функций с одной отправкой в ​​стандартной библиотеке Python. В то время как объектно-ориентированное программирование фокусируется на группировке нескольких операций над общим набором данных в класс, универсальная функция фокусируется на группировке нескольких реализаций операции, что позволяет ей работать с *разными* типами данных.

source: :pep:`443` -- Single-dispatch generic functions
pt_pt: :pep:`443` -- Funções genéricas de despacho único
ru: :pep:`443` -- Общие функции для одной отправки

source: PEP written and implemented by Łukasz Langa.
pt_pt: PEP escrito e implementado por Łukasz Langa.
ru: PEP написан и реализован Лукашом Лангой.

source: :func:`~functools.total_ordering` now supports a return value of :data:`NotImplemented` from the underlying comparison function. (Contributed by Katie Miller in :issue:`10042`.)
pt_pt: :func:`~functools.total_ordering` agora suporta um valor de retorno de :data:`NotImplemented` a partir da função de comparação subjacente. (Contribuído por Katie Miller em :issue:`10042`.)
ru: :func:`~functools.total_ordering` теперь поддерживает возвращаемое значение :data:`NotImplemented` из базовой функции сравнения. (Предоставлено Кэти Миллер в :issue:`10042`.)

source: A pure-python version of the :func:`~functools.partial` function is now in the stdlib; in CPython it is overridden by the C accelerated version, but it is available for other implementations to use. (Contributed by Brian Thorne in :issue:`12428`.)
pt_pt: Uma versão em Python puro da função :func:`~functools.partial` está agora na biblioteca padrão; no CPython, é substituída pela versão acelerada em C, mas está disponível para outras implementações usarem. (Contribuído por Brian Thorne em :issue:`12428`.)
ru: Версия функции :func:`~functools.partial`, написанная на чистом Python, теперь находится в стандартной библиотеке; в CPython он переопределяется ускоренной версией C, но доступен для использования в других реализациях. (Предоставлено Брайаном Торном в :issue:`12428`.)

source: New function :func:`~gc.get_stats` returns a list of three per-generation dictionaries containing the collections statistics since interpreter startup. (Contributed by Antoine Pitrou in :issue:`16351`.)
pt_pt: Nova função :func:`~gc.get_stats` devolve uma lista de três dicionários por geração contendo as estatísticas de coleções desde o início do interpretador. (Contribuído por Antoine Pitrou em :issue:`16351`.)
ru: Новая функция :func:`~gc.get_stats` возвращает список из трёх словарей каждого поколения, содержащий статистику коллекций с момента запуска интерпретатора. (Предоставлено Антуаном Питру в :issue:`16351`.)

source: A new function :func:`~glob.escape` provides a way to escape special characters in a filename so that they do not become part of the globbing expansion but are instead matched literally. (Contributed by Serhiy Storchaka in :issue:`8402`.)
pt_pt: Uma nova função :func:`~glob.escape` fornece uma forma de escapar caracteres especiais num nome de ficheiro para que não façam parte da expansão de *globbing*, mas sejam em vez disso correspondidos literalmente. (Contribuído por Serhiy Storchaka em :issue:`8402`.)
ru: Новая функция :func:`~glob.escape` предоставляет возможность экранировать специальные символы в имени файла, чтобы они не становились частью подстановочного расширения, а вместо этого сопоставлялись буквально. (Внесено Сергеем Сторчакой в ​​:issue:`8402`.)

source: A new :func:`hashlib.pbkdf2_hmac` function provides the `PKCS#5 password-based key derivation function 2 <https://en.wikipedia.org/wiki/PBKDF2>`_. (Contributed by Christian Heimes in :issue:`18582`.)
pt_pt: Uma nova função :func:`hashlib.pbkdf2_hmac` fornece a `função de derivação de chave baseada em palavra-passe PKCS#5 2 <https://en.wikipedia.org/wiki/PBKDF2>`_. (Contribuído por Christian Heimes em :issue:`18582`.)
ru: Новая функция :func:`hashlib.pbkdf2_hmac` обеспечивает функцию деривации ключей на основе пароля PKCS#5 2 <https://en.wikipedia.org/wiki/PBKDF2>`_. (Предоставлено Кристианом Хаймсом в :issue:`18582`.)

source: The :attr:`~hashlib.hash.name` attribute of :mod:`hashlib` hash objects is now a formally supported interface. It has always existed in CPython's :mod:`hashlib` (although it did not return lower case names for all supported hashes), but it was not a public interface and so some other Python implementations have not previously supported it. (Contributed by Jason R. Coombs in :issue:`18532`.)
pt_pt: O atributo :attr:`~hashlib.hash.name` dos objetos *hash* do :mod:`hashlib` é agora uma interface formalmente suportada. Sempre existiu no :mod:`hashlib` do CPython (embora não devolvesse nomes em minúsculas para todos os *hashes* suportados), mas não era uma interface pública e, por isso, algumas outras implementações do Python não a suportavam anteriormente. (Contribuído por Jason R. Coombs em :issue:`18532`.)
ru: Атрибут :attr:`~hashlib.hash.name` хеш-объектов :mod:`hashlib` теперь является официально поддерживаемым интерфейсом. Он всегда существовал в :mod:`hashlib` CPython (хотя он не возвращал имена в нижнем регистре для всех поддерживаемых хешей), но он не был общедоступным интерфейсом, и поэтому некоторые другие реализации Python ранее его не поддерживали. (Предоставлено Джейсоном Р. Кумбсом в :issue:`18532`.)
