Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: The module supports new :mod:`~stat.ST_MODE` flags, :mod:`~stat.S_IFDOOR`, :const:`~stat.S_IFPORT`, and :const:`~stat.S_IFWHT`. (Contributed by Christian Hiemes in :issue:`11016`.)
pt_pt: O módulo suporta novas flags :mod:`~stat.ST_MODE`: :mod:`~stat.S_IFDOOR`, :const:`~stat.S_IFPORT`, e :const:`~stat.S_IFWHT`. (Contribuído por Christian Hiemes em :issue:`11016`.)
ru: Модуль поддерживает новые флаги :mod:`~stat.ST_MODE`, :mod:`~stat.S_IFDOOR`, :const:`~stat.S_IFPORT` и :const:`~stat.S_IFWHT`. (Предоставлено Кристианом Химсом в :issue:`11016`.)

source: New function :mod:`~struct.iter_unpack` and a new :meth:`struct.Struct.iter_unpack` method on compiled formats provide streamed unpacking of a buffer containing repeated instances of a given format of data. (Contributed by Antoine Pitrou in :issue:`17804`.)
pt_pt: A nova função :mod:`~struct.iter_unpack` e o novo método :meth:`struct.Struct.iter_unpack` em formatos compilados fornecem a descompactação em fluxo de um *buffer* que contém instâncias repetidas de um dado formato de dados. (Contribuído por Antoine Pitrou em :issue:`17804`.)
ru: Новая функция :mod:`~struct.iter_unpack` и новый метод :meth:`struct.Struct.iter_unpack` для скомпилированных форматов обеспечивают потоковую распаковку буфера, содержащего повторяющиеся экземпляры данного формата данных. (Предоставлено Антуаном Питру в :issue:`17804`.)

source: :func:`~subprocess.check_output` now accepts an *input* argument that can be used to provide the contents of ``stdin`` for the command that is run. (Contributed by Zack Weinberg in :issue:`16624`.)
pt_pt: A função :func:`~subprocess.check_output` aceita agora um argumento *input* que pode ser usado para fornecer o conteúdo de ``stdin`` para o comando que é executado. (Contribuído por Zack Weinberg em :issue:`16624`.)
ru: :func:`~subprocess.check_output` теперь принимает аргумент *input*, который можно использовать для предоставления содержимого ``stdin`` для запускаемой команды. (Предоставлено Заком Вайнбергом в :issue:`16624`.)

source: :func:`~subprocess.getstatus` and :func:`~subprocess.getstatusoutput` now work on Windows. This change was actually inadvertently made in 3.3.4. (Contributed by Tim Golden in :issue:`10197`.)
ru: :func:`~subprocess.getstatus` и :func:`~subprocess.getstatusoutput` теперь работают в Windows. На самом деле это изменение было случайно сделано в версии 3.3.4. (Предоставлено Тимом Голденом в :issue:`10197`.)

source: The :meth:`~sunau.getparams` method now returns a namedtuple rather than a plain tuple. (Contributed by Claudiu Popa in :issue:`18901`.)
ru: Метод :meth:`~sunau.getparams` теперь возвращает именованный кортеж, а не простой кортеж. (Предоставлено Клаудиу Попа в :issue:`18901`.)

source: :meth:`sunau.open` now supports the context management protocol: when used in a :keyword:`with` block, the ``close`` method of the returned object will be called automatically at the end of the block. (Contributed by Serhiy Storchaka in :issue:`18878`.)
ru: :meth:`sunau.open` теперь поддерживает протокол управления контекстом: при использовании в блоке :keyword:`with` метод close возвращаемого объекта будет вызываться автоматически в конце блока. (Добавлен Сергеем Сторчакой в ​​:issue:`18878`.)

source: :meth:`.AU_write.setsampwidth` now supports 24 bit samples, thus adding support for writing 24 sample using the module. (Contributed by Serhiy Storchaka in :issue:`19261`.)
ru: :meth:`.AU_write.setsampwidth` теперь поддерживает 24-битные сэмплы, что добавляет поддержку записи 24-битных сэмплов с использованием модуля. (Предоставлено Сергеем Сторчакой в ​​:issue:`19261`.)

source: The :meth:`~sunau.AU_write.writeframesraw` and :meth:`~sunau.AU_write.writeframes` methods now accept any :term:`bytes-like object`. (Contributed by Serhiy Storchaka in :issue:`8311`.)
ru: Методы :meth:`~sunau.AU_write.writeframesraw` и :meth:`~sunau.AU_write.writeframes` теперь принимают любой :term:`байтовый объект`. (Предоставлено Сергеем Сторчакой в ​​:issue:`8311`.)

source: New function :func:`sys.getallocatedblocks` returns the current number of blocks allocated by the interpreter. (In CPython with the default ``--with-pymalloc`` setting, this is allocations made through the :c:func:`PyObject_Malloc` API.) This can be useful for tracking memory leaks, especially if automated via a test suite. (Contributed by Antoine Pitrou in :issue:`13390`.)
pt_pt: A nova função :func:`sys.getallocatedblocks` devolve o número atual de blocos alocados pelo interpretador. (No CPython com a definição predefinida ``--with-pymalloc``, isto refere-se a alocações feitas através da API :c:func:`PyObject_Malloc`.) Isto pode ser útil para rastrear fugas de memória, especialmente se automatizado através de uma suite de testes. (Contribuído por Antoine Pitrou em :issue:`13390`.)
ru: Новая функция :func:`sys.getallocatedblocks` возвращает текущее количество блоков, выделенных интерпретатором. (В CPython с настройкой по умолчанию ``--with-pymalloc`` это распределение осуществляется через API :c:func:` PyObj ect_Malloc`.) Это может быть полезно для отслеживания утечек памяти, особенно если это автоматизировано с помощью теста. люкс. (Предоставлено Антуаном Питру в :issue:`13390`.)

source: When the Python interpreter starts in :ref:`interactive mode <tut-interactive>`, it checks for an :data:`~sys.__interactivehook__` attribute on the :mod:`sys` module. If the attribute exists, its value is called with no arguments just before interactive mode is started. The check is made after the :envvar:`PYTHONSTARTUP` file is read, so it can be set there. The :mod:`site` module :ref:`sets it <rlcompleter-config>` to a function that enables tab completion and history saving (in :file:`~/.python-history`) if the platform supports :mod:`readline`. If you do not want this (new) behavior, you can override it in :envvar:`PYTHONSTARTUP`, :mod:`sitecustomize`, or :mod:`usercustomize` by deleting this attribute from :mod:`sys` (or setting it to some other callable). (Contributed by Éric Araujo and Antoine Pitrou in :issue:`5845`.)
pt_pt: Quando o interpretador Python inicia em :ref:`modo interativo <tut-interactive>`, verifica se existe um atributo :data:`~sys.__interactivehook__` no módulo :mod:`sys`. Se o atributo existir, o seu valor é chamado sem argumentos imediatamente antes de iniciar o modo interativo. A verificação é feita após a leitura do ficheiro :envvar:`PYTHONSTARTUP`, pelo que pode ser definido ali. O módulo :mod:`site` :ref:`define-o <rlcompleter-config>` para uma função que ativa a conclusão automática por tabulação e o registo de histórico (no ficheiro :file:`~/.python-history`) se a plataforma suportar :mod:`readline`. Se não pretender este (novo) comportamento, pode substituí-lo em :envvar:`PYTHONSTARTUP`, :mod:`sitecustomize`, ou :mod:`usercustomize`, eliminando este atributo de :mod:`sys` (ou definindo-o para outra função chamável). (Contribuído por Éric Araujo e Antoine Pitrou em :issue:`5845`.)
ru: Когда интерпретатор Python запускается в интерактивном режиме <tut-interactive>`, он проверяет наличие атрибута :data:`~sys.__interactivehook__` в модуле :mod:`sys`. Если атрибут существует, его значение вызывается без аргументов непосредственно перед запуском интерактивного режима. Проверка производится после чтения файла :envvar:`PYTHONSTARTUP`, поэтому ее можно установить там. Модуль :mod:`site` :ref:`устанавливает для него <rlcompleter-config>` функцию, которая включает завершение табуляции и сохранение истории (в :file:`~/.python-history`), если платформа поддерживает :mod :`readline`. Если вам не нужно это (новое) поведение, вы можете переопределить его в :envvar:`PYTHONSTARTUP`, :mod:`sitecustomize` или :mod:`usercustomize`, удалив этот атрибут из :mod:`sys` (или установка его на какой-либо другой вызываемый объект). (Предоставлено Эриком Араужо и Антуаном Питру в :issue:`5845`.)

source: The :mod:`tarfile` module now supports a simple :ref:`tarfile-commandline` when called as a script directly or via ``-m``. This can be used to create and extract tarfile archives. (Contributed by Berker Peksag in :issue:`13477`.)
pt_pt: O módulo :mod:`tarfile` suporta agora uma :ref:`tarfile-commandline` quando chamado diretamente como um script ou via ``-m``. Isto pode ser usado para criar e extrair arquivos tar. (Contribuído por Berker Peksag em :issue:`13477`.)
ru: Модуль :mod:`tarfile` теперь поддерживает простую :ref:`tarfile-commandline` при вызове из скрипта напрямую или через ``-m``. Это можно использовать для создания и извлечения архивов tarfile. (Предоставлено Беркером Пексагом в :issue:`13477`.)

source: The :class:`~textwrap.TextWrapper` class has two new attributes/constructor arguments: :attr:`~textwrap.TextWrapper.max_lines`, which limits the number of lines in the output, and :attr:`~textwrap.TextWrapper.placeholder`, which is a string that will appear at the end of the output if it has been truncated because of *max_lines*. Building on these capabilities, a new convenience function :func:`~textwrap.shorten` collapses all of the whitespace in the input to single spaces and produces a single line of a given *width* that ends with the *placeholder* (by default, ``[...]``). (Contributed by Antoine Pitrou and Serhiy Storchaka in :issue:`18585` and :issue:`18725`.)
pt_pt: A classe :class:`~textwrap.TextWrapper` tem dois novos atributos/argumentos do construtor: :attr:`~textwrap.TextWrapper.max_lines`, que limita o número de linhas na saída, e :attr:`~textwrap.TextWrapper.placeholder`, que é uma string que aparecerá no final da saída se esta tiver sido truncada devido a *max_lines*. Com base nestas capacidades, a nova função de conveniência :func:`~textwrap.shorten` colapsa todo o espaço em branco na entrada para espaços simples e produz uma única linha de uma largura dada que termina com o *placeholder* (por predefinição, ``[...]``). (Contribuído por Antoine Pitrou e Serhiy Storchaka em :issue:`18585` e :issue:`18725`.)
ru: Класс :class:`~textwrap.TextWrapper` имеет два новых атрибута/аргумента конструктора: :attr:`~textwrap.TextWrapper.max_lines`, который ограничивает количество строк в выводе, и :attr:`~textwrap.TextWrapper` .placeholder` — строка, которая появится в конце вывода, если она была обрезана из-за *max_lines*. Основываясь на этих возможностях, новая удобная функция :func:`~textwrap.shorten` сжимает все пробелы во входных данных до одиночных пробелов и создает одну строку заданной *ширины*, которая заканчивается *заполнителем* (по умолчанию , ``[...]``). (Предоставлено Антуаном Питру и Сергеем Сторчакой в ​​:issue:`18585` и :issue:`18725`.)

source: The :class:`~threading.Thread` object representing the main thread can be obtained from the new :func:`~threading.main_thread` function. In normal conditions this will be the thread from which the Python interpreter was started. (Contributed by Andrew Svetlov in :issue:`18882`.)
pt_pt: O objeto :class:`~threading.Thread` que representa a *thread* principal pode ser obtido a partir da nova função :func:`~threading.main_thread`. Em condições normais, esta será a *thread* a partir da qual o interpretador Python foi iniciado. (Contribuído por Andrew Svetlov em :issue:`18882`.)
ru: Объект :class:`~threading.Thread`, представляющий основной поток, можно получить из новой функции :func:`~threading.main_thread`. В обычных условиях это будет поток, из которого был запущен интерпретатор Python. (Предоставлено Андреем Светловым в :issue:`18882`.)

source: traceback
ru: трассировка

source: A new :func:`traceback.clear_frames` function takes a traceback object and clears the local variables in all of the frames it references, reducing the amount of memory consumed. (Contributed by Andrew Kuchling in :issue:`1565525`.)
pt_pt: A nova função :func:`traceback.clear_frames` recebe um objeto *traceback* e limpa as variáveis locais em todos os *frames* que referencia, reduzindo a quantidade de memória consumida. (Contribuído por Andrew Kuchling em :issue:`1565525`.)
ru: Новая функция :func:`traceback.clear_frames` принимает объект трассировки и очищает локальные переменные во всех кадрах, на которые он ссылается, уменьшая объем потребляемой памяти. (Предоставлено Эндрю Кучлингом в :issue:`1565525`.)

source: types
ru: типы

source: A new :func:`~types.DynamicClassAttribute` descriptor provides a way to define an attribute that acts normally when looked up through an instance object, but which is routed to the *class* ``__getattr__`` when looked up through the class. This allows one to have properties active on a class, and have virtual attributes on the class with the same name (see :mod:`Enum` for an example). (Contributed by Ethan Furman in :issue:`19030`.)
ru: Новый :func:`~types.DynamicClassAttribute` дескриптор предоставляет способ определения атрибута, который работает нормально при поиске через объект экземпляра, но который направляется в *class* ``__getattr__`` при поиске через класс . Это позволяет иметь активные свойства класса и виртуальные атрибуты класса с тем же именем (пример см. в :mod:`Enum`). (Предоставлено Итаном Фурманом в :issue:`19030`.)

source: :mod:`urllib.request` now supports ``data:`` URLs via the :class:`~urllib.request.DataHandler` class. (Contributed by Mathias Panzenböck in :issue:`16423`.)
pt_pt: O módulo :mod:`urllib.request` suporta agora URLs ``data:`` através da classe :class:`~urllib.request.DataHandler`. (Contribuído por Mathias Panzenböck em :issue:`16423`.)
ru: :mod:`urllib.request` теперь поддерживает URL-адреса ``data:`` через класс :class:`~urllib.request.DataHandler`. (Предоставлено Матиасом Панценбеком в :issue:`16423`.)

source: The http method that will be used by a :class:`~urllib.request.Request` class can now be specified by setting a :class:`~urllib.request.Request.method` class attribute on the subclass. (Contributed by Jason R Coombs in :issue:`18978`.)
pt_pt: O método HTTP a ser usado por uma classe :class:`~urllib.request.Request` pode agora ser especificado definindo um atributo de classe :class:`~urllib.request.Request.method` na subclasse. (Contribuído por Jason R Coombs em :issue:`18978`.)
ru: Метод http, который будет использоваться классом :class:`~urllib.request.Request`, теперь можно указать, установив атрибут класса :class:`~urllib.request.Request.method` в подклассе. (Предоставлено Джейсоном Р. Кумбсом в :issue:`18978`.)

source: :class:`~urllib.request.Request` objects are now reusable: if the :attr:`~urllib.request.Request.full_url` or :attr:`~urllib.request.Request.data` attributes are modified, all relevant internal properties are updated. This means, for example, that it is now possible to use the same :class:`~urllib.request.Request` object in more than one :meth:`.OpenerDirector.open` call with different *data* arguments, or to modify a :class:`~urllib.request.Request`\ 's ``url`` rather than recomputing it from scratch. There is also a new :meth:`~urllib.request.Request.remove_header` method that can be used to remove headers from a :class:`~urllib.request.Request`. (Contributed by Alexey Kachayev in :issue:`16464`, Daniel Wozniak in :issue:`17485`, and Damien Brecht and Senthil Kumaran in :issue:`17272`.)
pt_pt: Os objetos :class:`~urllib.request.Request` são agora reutilizáveis: se os atributos :attr:`~urllib.request.Request.full_url` ou :attr:`~urllib.request.Request.data` forem modificados, todas as propriedades internas relevantes são atualizadas. Isto significa, por exemplo, que é agora possível usar o mesmo objeto :class:`~urllib.request.Request` em mais do que uma chamada :meth:`.OpenerDirector.open` com argumentos *data* diferentes, ou modificar a ``url`` de um :class:`~urllib.request.Request` em vez de a recalcular desde o início. Existe também um novo método :meth:`~urllib.request.Request.remove_header` que pode ser usado para remover cabeçalhos de um :class:`~urllib.request.Request`. (Contribuído por Alexey Kachayev em :issue:`16464`, Daniel Wozniak em :issue:`17485`, e Damien Brecht e Senthil Kumaran em :issue:`17272`.)
ru: Объекты :class:`~urllib.request.Request` теперь можно использовать повторно: если атрибуты :attr:`~urllib.request.Request.full_url` или :attr:`~urllib.request.Request.data` изменены, все соответствующие внутренние свойства обновляются. Это означает, например, что теперь можно использовать один и тот же объект :class:`~urllib.request.Request` более чем в одном вызове :meth:`.OpenerDirector.open` с разными аргументами *data* или измените ``url`` :class:`~urllib.request.Request`\ вместо того, чтобы пересчитывать его с нуля. Существует также новый метод :meth:`~urllib.request.Request.remove_header`, который можно использовать для удаления заголовков из :class:`~urllib.request.Request`. (Предоставлено Алексеем Качаевым в :issue:`16464`, Дэниелом Возняком в :issue:`17485`, а также Дэмиеном Брехтом и Сентилом Кумараном в :issue:`17272`.)

source: :class:`~urllib.error.HTTPError` objects now have a :attr:`~urllib.error.HTTPError.headers` attribute that provides access to the HTTP response headers associated with the error. (Contributed by Berker Peksag in :issue:`15701`.)
pt_pt: Os objetos :class:`~urllib.error.HTTPError` têm agora um atributo :attr:`~urllib.error.HTTPError.headers` que fornece acesso aos cabeçalhos de resposta HTTP associados ao erro. (Contribuído por Berker Peksag em :issue:`15701`.)
ru: Объекты :class:`~urllib.error.HTTPError` теперь имеют атрибут :attr:`~urllib.error.HTTPError.headers`, который обеспечивает доступ к заголовкам HTTP-ответа, связанным с ошибкой. (Предоставлено Беркером Пексагом в :issue:`15701`.)

source: The :class:`~unittest.TestCase` class has a new method, :meth:`~unittest.TestCase.subTest`, that produces a context manager whose :keyword:`with` block becomes a "sub-test". This context manager allows a test method to dynamically generate subtests by, say, calling the ``subTest`` context manager inside a loop. A single test method can thereby produce an indefinite number of separately identified and separately counted tests, all of which will run even if one or more of them fail. For example::
pt_pt: A classe :class:`~unittest.TestCase` tem um novo método, :meth:`~unittest.TestCase.subTest`, que produz um gestor de contexto cujo bloco :keyword:`with` se torna um "sub-teste". Este gestor de contexto permite que um método de teste gere dinamicamente sub-testes, por exemplo, chamando o gestor de contexto ``subTest`` dentro de um ciclo. Um único método de teste pode assim produzir um número indefinido de testes identificados e contados separadamente, todos os quais serão executados mesmo que um ou mais falhem. Por exemplo::
ru: Класс :class:`~unittest.TestCase` имеет новый метод :meth:`~unittest.TestCase.subTest`, который создает контекстный менеджер, блок :keyword:`with` становится "подтестом". Этот контекстный менеджер позволяет методу тестирования динамически генерировать подтесты, скажем, вызывая контекстный менеджер ``subTest`` внутри цикла. Таким образом, один метод тестирования может создать неопределенное количество отдельно идентифицированных и отдельно подсчитанных тестов, все из которых будут выполнены, даже если один или несколько из них не пройдут. Например::

source: will result in six subtests, each identified in the unittest verbose output with a label consisting of the variable name ``i`` and a particular value for that variable (``i=0``, ``i=1``, etc). See :ref:`subtests` for the full version of this example. (Contributed by Antoine Pitrou in :issue:`16997`.)
pt_pt: resultará em seis sub-testes, cada um identificado na saída detalhada do unittest com uma etiqueta composta pelo nome da variável ``i`` e um valor específico para essa variável (``i=0``, ``i=1``, etc). Consulte :ref:`subtests` para a versão completa deste exemplo. (Contribuído por Antoine Pitrou em :issue:`16997`.)
ru: приведет к шести подтестам, каждый из которых указан в подробном выводе unittest с меткой, состоящей из имени переменной ``i`` и конкретного значения для этой переменной (``i=0``, ``i=1``, и т. д). Полную версию этого примера см. в разделе :ref:`subtests`. (Предоставлено Антуаном Питру в :issue:`16997`.)

source: :func:`unittest.main` now accepts an iterable of test names for *defaultTest*, where previously it only accepted a single test name as a string. (Contributed by Jyrki Pulliainen in :issue:`15132`.)
pt_pt: A função :func:`unittest.main` aceita agora um iterável de nomes de testes para *defaultTest*, enquanto anteriormente só aceitava um único nome de teste como uma string. (Contribuído por Jyrki Pulliainen em :issue:`15132`.)
ru: :func:`unittest.main` теперь принимает итерацию имен тестов для *defaultTest*, тогда как раньше он принимал только одно имя теста в виде строки. (Предоставлено Юрки Пуллиайненом в :issue:`15132`.)

source: If :class:`~unittest.SkipTest` is raised during test discovery (that is, at the module level in the test file), it is now reported as a skip instead of an error. (Contributed by Zach Ware in :issue:`16935`.)
pt_pt: Se :class:`~unittest.SkipTest` for levantado durante a descoberta de testes (ou seja, a nível do módulo no ficheiro de teste), é agora reportado como um "skip" em vez de um erro. (Contribuído por Zach Ware em :issue:`16935`.)
ru: Если :class:`~unittest.SkipTest` возникает во время обнаружения теста (то есть на уровне модуля в тестовом файле), теперь об этом сообщается как о пропуске, а не об ошибке. (Предоставлено Заком Уэром в :issue:`16935`.)

source: :meth:`~unittest.TestLoader.discover` now sorts the discovered files to provide consistent test ordering. (Contributed by Martin Melin and Jeff Ramnani in :issue:`16709`.)
pt_pt: O método :meth:`~unittest.TestLoader.discover` ordena agora os ficheiros descobertos para fornecer uma ordenação consistente dos testes. (Contribuído por Martin Melin e Jeff Ramnani em :issue:`16709`.)
ru: :meth:`~unittest.TestLoader.discover` теперь сортирует обнаруженные файлы, чтобы обеспечить единообразный порядок тестов. (Предоставлено Мартином Мелином и Джеффом Рамнани в :issue:`16709`.)

source: :class:`~unittest.TestSuite` now drops references to tests as soon as the test has been run, if the test is successful. On Python interpreters that do garbage collection, this allows the tests to be garbage collected if nothing else is holding a reference to the test. It is possible to override this behavior by creating a :class:`~unittest.TestSuite` subclass that defines a custom ``_removeTestAtIndex`` method. (Contributed by Tom Wardill, Matt McClure, and Andrew Svetlov in :issue:`11798`.)
pt_pt: A classe :class:`~unittest.TestSuite` remove agora as referências aos testes assim que o teste é executado, se o teste for bem-sucedido. Em interpretadores Python que fazem recolha de lixo, isto permite que os testes sejam recolhidos se nada mais estiver a reter uma referência ao teste. É possível substituir este comportamento criando uma subclasse de :class:`~unittest.TestSuite` que defina um método personalizado ``_removeTestAtIndex``. (Contribuído por Tom Wardill, Matt McClure e Andrew Svetlov em :issue:`11798`.)
ru: :class:`~unittest.TestSuite` теперь удаляет ссылки на тесты сразу после запуска теста, если тест прошел успешно. В интерпретаторах Python, выполняющих сбор мусора, это позволяет выполнять сбор мусора в тестах, если ничто другое не содержит ссылку на тест. Это поведение можно переопределить, создав подкласс :class:`~unittest.TestSuite`, который определяет собственный метод _removeTestAtIndex``. (Предоставлено Томом Уордиллом, Мэттом МакКлюром и Эндрю Светловым в :issue:`11798`.)
