Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.4.po
Languages: pt_pt, ru

source: A new test assertion context-manager, :meth:`~unittest.TestCase.assertLogs`, will ensure that a given block of code emits a log message using the :mod:`logging` module. By default the message can come from any logger and have a priority of ``INFO`` or higher, but both the logger name and an alternative minimum logging level may be specified. The object returned by the context manager can be queried for the :class:`~logging.LogRecord`\ s and/or formatted messages that were logged. (Contributed by Antoine Pitrou in :issue:`18937`.)
pt_pt: Um novo gestor de contexto de afirmação de teste, :meth:`~unittest.TestCase.assertLogs`, garante que um dado bloco de código emite uma mensagem de registo usando o módulo :mod:`logging`. Por predefinição, a mensagem pode vir de qualquer registador e ter uma prioridade de ``INFO`` ou superior, mas tanto o nome do registador como um nível mínimo de registo alternativo podem ser especificados. O objeto devolvido pelo gestor de contexto pode ser consultado para obter os :class:`~logging.LogRecord` e/ou mensagens formatadas que foram registadas. (Contribuído por Antoine Pitrou em :issue:`18937`.)
ru: Новый контекстный менеджер тестовых утверждений, :meth:`~unittest.TestCase.assertLogs`, гарантирует, что данный блок кода выдает сообщение журнала, используя модуль :mod:`logging`. По умолчанию сообщение может исходить от любого регистратора и иметь приоритет INFO или выше, но можно указать как имя регистратора, так и альтернативный минимальный уровень протоколирования. Объект, возвращаемый менеджером контекста, может быть запрошен для :class:`~logging.LogRecord`\ и/или форматированных сообщений, которые были зарегистрированы. (Предоставлено Антуаном Питру в :issue:`18937`.)

source: Test discovery now works with namespace packages (Contributed by Claudiu Popa in :issue:`17457`.)
pt_pt: A descoberta de testes funciona agora com pacotes de *namespace*. (Contribuído por Claudiu Popa em :issue:`17457`.)
ru: Обнаружение тестов теперь работает с пакетами пространства имен (предоставлен Клаудиу Попа в :issue:`17457`.)

source: :mod:`unittest.mock` objects now inspect their specification signatures when matching calls, which means an argument can now be matched by either position or name, instead of only by position. (Contributed by Antoine Pitrou in :issue:`17015`.)
pt_pt: Os objetos :mod:`unittest.mock` inspecionam agora as suas assinaturas de especificação ao corresponder chamadas, o que significa que um argumento pode agora ser correspondido por posição ou nome, em vez de apenas por posição. (Contribuído por Antoine Pitrou em :issue:`17015`.)
ru: Объекты :mod:`unittest.mock` теперь проверяют свои сигнатуры спецификаций при сопоставлении вызовов, что означает, что аргумент теперь может сопоставляться либо по позиции, либо по имени, а не только по позиции. (Предоставлено Антуаном Питру в :issue:`17015`.)

source: :func:`~mock.mock_open` objects now have ``readline`` and ``readlines`` methods. (Contributed by Toshio Kuratomi in :issue:`17467`.)
ru: :func:`~mock.mock_open` Объекты теперь имеют методы ``readline`` и ``readlines``. (Предоставлено Тосио Куратоми в :issue:`17467`.)

source: :mod:`venv` now includes activation scripts for the ``csh`` and ``fish`` shells. (Contributed by Andrew Svetlov in :issue:`15417`.)
pt_pt: O módulo :mod:`venv` inclui agora scripts de ativação para as *shells* ``csh`` e ``fish``. (Contribuído por Andrew Svetlov em :issue:`15417`.)
ru: :mod:`venv` теперь включает сценарии активации для оболочек ``csh`` и ``fish``. (Предоставлено Андреем Светловым в :issue:`15417`.)

source: :class:`~venv.EnvBuilder` and the :func:`~venv.create` convenience function take a new keyword argument *with_pip*, which defaults to ``False``, that controls whether or not :class:`~venv.EnvBuilder` ensures that ``pip`` is installed in the virtual environment. (Contributed by Nick Coghlan in :issue:`19552` as part of the :pep:`453` implementation.)
pt_pt: A classe :class:`~venv.EnvBuilder` e a função de conveniência :func:`~venv.create` aceitam um novo argumento nomeado *with_pip*, que por predefinição é ``False``, e que controla se :class:`~venv.EnvBuilder` garante que o ``pip`` é instalado no ambiente virtual. (Contribuído por Nick Coghlan em :issue:`19552` como parte da implementação da :pep:`453`.)
ru: :class:`~venv.EnvBuilder` и удобная функция :func:`~venv.create` принимают новый аргумент ключевого слова *with_pip*, который по умолчанию имеет значение ``False``, который контролирует, будет ли :class:`~ venv.EnvBuilder гарантирует, что pip установлен в виртуальной среде. (Внесено Ником Когланом в :issue:`19552` как часть реализации :pep:`453`.)

source: The :meth:`~wave.getparams` method now returns a namedtuple rather than a plain tuple. (Contributed by Claudiu Popa in :issue:`17487`.)
ru: Метод :meth:`~wave.getparams` теперь возвращает именованный кортеж, а не простой кортеж. (Предоставлено Клаудиу Попа в :issue:`17487`.)

source: :meth:`wave.open` now supports the context management protocol. (Contributed by Claudiu Popa in :issue:`17616`.)
pt_pt: O método :meth:`wave.open` suporta agora o protocolo de gestão de contexto. (Contribuído por Claudiu Popa em :issue:`17616`.)
ru: :meth:`wave.open` теперь поддерживает протокол управления контекстом. (Предоставлено Клаудиу Попа в :issue:`17616`.)

source: :mod:`wave` can now :ref:`write output to unseekable files <wave-write-objects>`. (Contributed by David Jones, Guilherme Polo, and Serhiy Storchaka in :issue:`5202`.)
pt_pt: O módulo :mod:`wave` pode agora :ref:`escrever saída para ficheiros não pesquisáveis <wave-write-objects>`. (Contribuído por David Jones, Guilherme Polo e Serhiy Storchaka em :issue:`5202`.)
ru: :mod:`wave` теперь может :ref:`записывать вывод в недоступные для поиска файлы <wave-write-objects>`. (Предоставлено Дэвидом Джонсом, Гильерме Поло и Сергеем Сторчакой в ​​:issue:`5202`.)

source: The :meth:`~wave.Wave_write.writeframesraw` and :meth:`~wave.Wave_write.writeframes` methods now accept any :term:`bytes-like object`. (Contributed by Serhiy Storchaka in :issue:`8311`.)
pt_pt: Os métodos :meth:`~wave.Wave_write.writeframesraw` e :meth:`~wave.Wave_write.writeframes` aceitam agora qualquer objeto do tipo :term:`bytes`. (Contribuído por Serhiy Storchaka em :issue:`8311`.)
ru: Методы :meth:`~wave.Wave_write.writeframesraw` и :meth:`~wave.Wave_write.writeframes` теперь принимают любой :term:`байтоподобный объект`. (Предоставлено Сергеем Сторчакой в ​​:issue:`8311`.)

source: New :class:`~weakref.WeakMethod` class simulates weak references to bound methods. (Contributed by Antoine Pitrou in :issue:`14631`.)
pt_pt: A nova classe :class:`~weakref.WeakMethod` simula referências fracas a métodos ligados. (Contribuído por Antoine Pitrou em :issue:`14631`.)
ru: Новый класс :class:`~weakref.WeakMethod` имитирует слабые ссылки на связанные методы. (Предоставлено Антуаном Питру в :issue:`14631`.)

source: New :class:`~weakref.finalize` class makes it possible to register a callback to be invoked when an object is garbage collected, without needing to carefully manage the lifecycle of the weak reference itself. (Contributed by Richard Oudkerk in :issue:`15528`.)
pt_pt: A nova classe :class:`~weakref.finalize` permite registar uma função de retorno (*callback*) para ser invocada quando um objeto é recolhido pelo recolhedor de lixo, sem necessidade de gerir cuidadosamente o ciclo de vida da própria referência fraca. (Contribuído por Richard Oudkerk em :issue:`15528`.)
ru: Новый класс :class:`~weakref.finalize` позволяет зарегистрировать обратный вызов, который будет вызываться при сборке мусора объекта, без необходимости тщательного управления жизненным циклом самой слабой ссылки. (Предоставлено Ричардом Оудкерком в :issue:`15528`.)

source: The callback, if any, associated with a :class:`~weakref.ref` is now exposed via the :attr:`~weakref.ref.__callback__` attribute. (Contributed by Mark Dickinson in :issue:`17643`.)
pt_pt: A função de retorno (*callback*), se existir, associada a uma :class:`~weakref.ref` está agora exposta através do atributo :attr:`~weakref.ref.__callback__`. (Contribuído por Mark Dickinson em :issue:`17643`.)
ru: Обратный вызов, если таковой имеется, связанный с :class:`~weakref.ref`, теперь предоставляется через атрибут :attr:`~weakref.ref.__callback__`. (Предоставлено Марком Дикинсоном в :issue:`17643`.)

source: A new parser, :class:`~xml.etree.ElementTree.XMLPullParser`, allows a non-blocking applications to parse XML documents. An example can be seen at :ref:`elementtree-pull-parsing`. (Contributed by Antoine Pitrou in :issue:`17741`.)
pt_pt: Um novo analisador (*parser*), :class:`~xml.etree.ElementTree.XMLPullParser`, permite que aplicações não bloqueantes analisem documentos XML. Um exemplo pode ser visto em :ref:`elementtree-pull-parsing`. (Contribuído por Antoine Pitrou em :issue:`17741`.)
ru: Новый парсер :class:`~xml.etree.ElementTree.XMLPullParser` позволяет неблокирующим приложениям анализировать XML-документы. Пример можно увидеть на странице :ref:`elementtree-pull-parsing`. (Предоставлено Антуаном Питру в :issue:`17741`.)

source: The :mod:`xml.etree.ElementTree` :func:`~xml.etree.ElementTree.tostring` and :func:`~xml.etree.ElementTree.tostringlist` functions, and the :class:`~xml.etree.ElementTree.ElementTree` :meth:`~xml.etree.ElementTree.ElementTree.write` method, now have a *short_empty_elements* :ref:`keyword-only parameter <keyword-only_parameter>` providing control over whether elements with no content are written in abbreviated (``<tag />``) or expanded (``<tag></tag>``) form. (Contributed by Ariel Poliak and Serhiy Storchaka in :issue:`14377`.)
pt_pt: As funções :func:`~xml.etree.ElementTree.tostring` e :func:`~xml.etree.ElementTree.tostringlist` do módulo :mod:`xml.etree.ElementTree`, e o método :meth:`~xml.etree.ElementTree.ElementTree.write` da classe :class:`~xml.etree.ElementTree.ElementTree`, têm agora um parâmetro *short_empty_elements* :ref:`apenas por palavra-chave <keyword-only_parameter>` que permite controlar se os elementos sem conteúdo são escritos na forma abreviada (``<tag />``) ou expandida (``<tag></tag>``). (Contribuído por Ariel Poliak e Serhiy Storchaka em :issue:`14377`.)
ru: Функции :mod:`xml.etree.ElementTree` :func:`~xml.etree.ElementTree.tostring` и :func:`~xml.etree.ElementTree.tostringlist`, а также функции :class:`~xml.etree .ElementTree.ElementTree` :meth:`~xml.etree.ElementTree.ElementTree.write` метод, теперь имеет *short_empty_elements* :ref:`keyword-only параметр <keyword-only_parameter>`, обеспечивающий контроль над тем, являются ли элементы без содержимого записываются в сокращенном (``<tag />``) или расширенном (``<tag></tag>``) виде. (Предоставлено Ариэлем Поляком и Сергеем Сторчакой в ​​:issue:`14377`.)

source: zipfile
ru: zip-файл

source: The :meth:`~zipfile.PyZipFile.writepy` method of the :class:`~zipfile.PyZipFile` class has a new *filterfunc* option that can be used to control which directories and files are added to the archive. For example, this could be used to exclude test files from the archive. (Contributed by Christian Tismer in :issue:`19274`.)
pt_pt: O método :meth:`~zipfile.PyZipFile.writepy` da classe :class:`~zipfile.PyZipFile` tem uma nova opção *filterfunc* que pode ser usada para controlar quais diretórios e ficheiros são adicionados ao arquivo. Por exemplo, isto pode ser usado para excluir ficheiros de teste do arquivo. (Contribuído por Christian Tismer em :issue:`19274`.)
ru: Метод :meth:`~zipfile.PyZipFile.writepy` класса :class:`~zipfile.PyZipFile` имеет новую опцию *filterfunc*, которую можно использовать для управления тем, какие каталоги и файлы добавляются в архив. Например, это можно использовать для исключения тестовых файлов из архива. (Предоставлено Кристианом Тисмером в :issue:`19274`.)

source: The *allowZip64* parameter to :class:`~zipfile.ZipFile` and :class:`~zipfile.PyZipfile` is now ``True`` by default. (Contributed by William Mallard in :issue:`17201`.)
ru: Параметр *allowZip64* для :class:`~zipfile.ZipFile` и :class:`~zipfile.PyZipfile` теперь по умолчанию имеет значение ``True``. (Предоставлено Уильямом Маллардом в :issue:`17201`.)

source: CPython Implementation Changes
pt_pt: Alterações na Implementação do CPython
ru: Изменения в реализации CPython

source: PEP 445: Customization of CPython Memory Allocators
pt_pt: PEP 445: Personalização dos Alocadores de Memória do CPython
ru: PEP 445: настройка распределителей памяти CPython

source: :pep:`445` adds new C level interfaces to customize memory allocation in the CPython interpreter.
pt_pt: A :pep:`445` adiciona novas interfaces ao nível de C para personalizar a alocação de memória no interpretador CPython.
ru: :pep:`445` добавляет новые интерфейсы уровня C для настройки распределения памяти в интерпретаторе CPython.

source: :pep:`445` -- Add new APIs to customize Python memory allocators
pt_pt: :pep:`445` -- Adicionar novas APIs para personalizar os alocadores de memória do Python
ru: :pep:`445` -- Добавление новых API для настройки распределителей памяти Python.

source: PEP 442: Safe Object Finalization
pt_pt: PEP 442: Finalização Segura de Objetos
ru: PEP 442: завершение безопасного объекта

source: :pep:`442` removes the current limitations and quirks of object finalization in CPython. With it, objects with :meth:`__del__` methods, as well as generators with :keyword:`finally` clauses, can be finalized when they are part of a reference cycle.
ru: :pep:`442` устраняет текущие ограничения и особенности финализации объектов в CPython. С его помощью объекты с методами :meth:`__del__`, а также генераторы с предложениями :keyword:`finally` могут быть финализированы, когда они являются частью ссылочного цикла.

source: As part of this change, module globals are no longer forcibly set to :const:`None` during interpreter shutdown in most cases, instead relying on the normal operation of the cyclic garbage collector. This avoids a whole class of interpreter-shutdown-time errors, usually involving ``__del__`` methods, that have plagued Python since the cyclic GC was first introduced.
pt_pt: Como parte desta alteração, os globais do módulo já não são definidos forçosamente para :const:`None` durante o encerramento do interpretador na maioria dos casos, passando a depender da operação normal do recolhedor de lixo cíclico. Isto evita uma classe inteira de erros no encerramento do interpretador, geralmente envolvendo métodos ``__del__``, que têm afetado o Python desde que o GC cíclico foi introduzido pela primeira vez.
ru: В рамках этого изменения глобальные переменные модуля больше не устанавливаются принудительно в :const:`None` во время завершения работы интерпретатора в большинстве случаев, вместо этого они полагаются на нормальную работу циклического сборщика мусора. Это позволяет избежать целого класса ошибок, связанных с завершением работы интерпретатора, обычно связанных с методами ``__del__``, которые преследовали Python с момента первого появления циклического сбора мусора.

source: :pep:`442` -- Safe object finalization
pt_pt: :pep:`442` -- Finalização segura de objetos
ru: :pep:`442` -- Безопасная финализация объекта

source: PEP 456: Secure and Interchangeable Hash Algorithm
pt_pt: PEP 456: Algoritmo de Hash Seguro e Intercambiável
ru: PEP 456: безопасный и взаимозаменяемый алгоритм хеширования

source: :pep:`456` follows up on earlier security fix work done on Python's hash algorithm to address certain DOS attacks to which public facing APIs backed by dictionary lookups may be subject. (See :issue:`14621` for the start of the current round of improvements.) The PEP unifies CPython's hash code to make it easier for a packager to substitute a different hash algorithm, and switches Python's default implementation to a SipHash implementation on platforms that have a 64 bit data type. Any performance differences in comparison with the older FNV algorithm are trivial.
pt_pt: A :pep:`456` dá seguimento ao trabalho anterior de correção de segurança realizado no algoritmo de hash do Python para abordar certos ataques DoS aos quais APIs públicas baseadas em pesquisas de dicionário podem estar sujeitas. (Consulte :issue:`14621` para o início da atual ronda de melhorias.) A PEP unifica o código de hash do CPython para facilitar a substituição de um algoritmo de hash diferente, e muda a implementação predefinida do Python para uma implementação SipHash em plataformas que têm um tipo de dados de 64 bits. Quaisquer diferenças de desempenho em comparação com o algoritmo FNV mais antigo são triviais.
ru: :pep:`456` является продолжением предыдущей работы по исправлению безопасности, проделанной в хеш-алгоритме Python для борьбы с определенными DOS-атаками, которым могут быть подвержены общедоступные API, поддерживаемые поиском по словарю. (См.:issue:`14621`, чтобы узнать о начале текущего раунда улучшений.) PEP унифицирует хеш-код CPython, чтобы упаковщику было проще заменить другой хэш-алгоритм, и переключает реализацию Python по умолчанию на реализацию SipHash на платформах. которые имеют 64-битный тип данных. Любые различия в производительности по сравнению со старым алгоритмом FNV тривиальны.

source: The PEP adds additional fields to the :data:`sys.hash_info` named tuple to describe the hash algorithm in use by the currently executing binary. Otherwise, the PEP does not alter any existing CPython APIs.
pt_pt: A PEP adiciona campos adicionais ao *named tuple* :data:`sys.hash_info` para descrever o algoritmo de hash em uso pelo binário em execução. Caso contrário, a PEP não altera quaisquer APIs existentes do CPython.
ru: PEP добавляет дополнительные поля в именованный кортеж :data:`sys.hash_info` для описания алгоритма хэширования, используемого исполняемым в данный момент двоичным файлом. В противном случае PEP не изменяет существующие API CPython.

source: PEP 436: Argument Clinic
ru: PEP 436: Клиника аргументов

source: "Argument Clinic" (:pep:`436`) is now part of the CPython build process and can be used to simplify the process of defining and maintaining accurate signatures for builtins and standard library extension modules implemented in C.
pt_pt: O "Argument Clinic" (:pep:`436`) faz agora parte do processo de construção do CPython e pode ser usado para simplificar o processo de definição e manutenção de assinaturas precisas para *builtins* e módulos de extensão da biblioteca padrão implementados em C.
ru: «Клиника аргументов» (:pep:`436`) теперь является частью процесса сборки CPython и может использоваться для упрощения процесса определения и поддержания точных подписей для встроенных функций и модулей расширения стандартной библиотеки, реализованных на C.

source: Some standard library extension modules have been converted to use Argument Clinic in Python 3.4, and :mod:`pydoc` and :mod:`inspect` have been updated accordingly.
pt_pt: Alguns módulos de extensão da biblioteca padrão foram convertidos para usar o Argument Clinic no Python 3.4, e os módulos :mod:`pydoc` e :mod:`inspect` foram atualizados em conformidade.
ru: Некоторые модули расширения стандартной библиотеки были преобразованы для использования Argument Clinic в Python 3.4, а :mod:`pydoc` и :mod:`inspect` были обновлены соответствующим образом.

source: It is expected that signature metadata for programmatic introspection will be added to additional callables implemented in C as part of Python 3.4 maintenance releases.
pt_pt: Espera-se que os metadados de assinatura para introspeção programática sejam adicionados a chamáveis adicionais implementados em C como parte das versões de manutenção do Python 3.4.
ru: Ожидается, что метаданные сигнатур для программного самоанализа будут добавлены к дополнительным вызываемым объектам, реализованным на C, как часть обновлений Python 3.4.

source: The Argument Clinic PEP is not fully up to date with the state of the implementation. This has been deemed acceptable by the release manager and core development team in this case, as Argument Clinic will not be made available as a public API for third party use in Python 3.4.
pt_pt: A PEP do Argument Clinic não está totalmente atualizada com o estado da implementação. Isto foi considerado aceitável pelo gestor de versão e pela equipa de desenvolvimento principal neste caso, uma vez que o Argument Clinic não será disponibilizado como uma API pública para uso de terceiros no Python 3.4.
ru: PEP клиники «Аргумент» не полностью в курсе состояния реализации. В данном случае менеджер выпуска и основная группа разработчиков сочли это приемлемым, поскольку Argument Clinic не будет доступен в качестве общедоступного API для использования третьими лицами в Python 3.4.

source: PEP written and implemented by Larry Hastings.
pt_pt: PEP escrita e implementada por Larry Hastings.
ru: PEP написан и реализован Ларри Гастингсом.

source: Other Build and C API Changes
pt_pt: Outras Alterações na Construção e na API C
ru: Другие изменения в API сборки и C

source: The new :c:func:`PyType_GetSlot` function has been added to the stable ABI, allowing retrieval of function pointers from named type slots when using the limited API. (Contributed by Martin von Löwis in :issue:`17162`.)
pt_pt: A nova função :c:func:`PyType_GetSlot` foi adicionada à ABI estável, permitindo a recuperação de ponteiros de função a partir de *slots* de tipo nomeados ao usar a API limitada. (Contribuído por Martin von Löwis em :issue:`17162`.)
ru: В стабильный ABI была добавлена ​​новая функция :c:func:`PyType_GetSlot`, позволяющая извлекать указатели функций из слотов именованных типов при использовании ограниченного API. (Предоставлено Мартином фон Лёвисом в :issue:`17162`.)

source: The new :c:func:`Py_SetStandardStreamEncoding` pre-initialization API allows applications embedding the CPython interpreter to reliably force a particular encoding and error handler for the standard streams. (Contributed by Bastien Montagne and Nick Coghlan in :issue:`16129`.)
ru: Новый API предварительной инициализации :c:func:`Py_SetStandardStreamEncoding` позволяет приложениям, встраивающим интерпретатор CPython, надежно принудительно принудительно использовать определенную кодировку и обработчик ошибок для стандартных потоков. (Предоставлено Бастьеном Монтаньем и Ником Когланом в :issue:`16129`.)

source: Most Python C APIs that don't mutate string arguments are now correctly marked as accepting ``const char *`` rather than ``char *``. (Contributed by Serhiy Storchaka in :issue:`1772673`.)
pt_pt: A maioria das APIs C do Python que não mutam argumentos de string estão agora corretamente marcadas como aceitando ``const char *`` em vez de ``char *``. (Contribuído por Serhiy Storchaka em :issue:`1772673`.)
ru: Большинство API Python C, которые не изменяют строковые аргументы, теперь правильно помечены как принимающие ``const char *``, а не ``char *``. (Добавлен Сергеем Сторчакой в ​​:issue:`1772673`.)

source: A new shell version of ``python-config`` can be used even when a python interpreter is not available (for example, in cross compilation scenarios).
pt_pt: Uma nova versão de *shell* do ``python-config`` pode ser usada mesmo quando um interpretador Python não está disponível (por exemplo, em cenários de compilação cruzada).
ru: Новую версию оболочки ``python-config`` можно использовать, даже если интерпретатор Python недоступен (например, в сценариях кросс-компиляции).
