Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: What's New In Python 3.5
pt_pt: Novidades no Python 3.5
ru: Что нового в Python 3.5
sv: Vad är nytt i Python 3.5

source: Editors
pt_pt: Editores
ru: Редакция
sv: Redigerare

source: This article explains the new features in Python 3.5, compared to 3.4. Python 3.5 was released on September 13, 2015. See the `changelog <https://docs.python.org/3.5/whatsnew/changelog.html>`_ for a full list of changes.
pt_pt: Este artigo explica as novas funcionalidades do Python 3.5, em comparação com o 3.4. O Python 3.5 foi lançado a 13 de setembro de 2015. Consulte o `registo de alterações <https://docs.python.org/3.5/whatsnew/changelog.html>`_ para uma lista completa das alterações.
sv: I den här artikeln förklaras de nya funktionerna i Python 3.5 jämfört med 3.4. Python 3.5 släpptes den 13 september 2015. Se `changelog <https://docs.python.org/3.5/whatsnew/changelog.html>`_ för en fullständig lista över ändringar.

source: :pep:`478` - Python 3.5 Release Schedule
pt_pt: :pep:`478` — Cronograma de Lançamento do Python 3.5
ru: :pep:`478` - График выпуска Python 3.5
sv: :pep:`478` - Python 3.5 Utgivningsschema

source: Summary -- Release highlights
pt_pt: Resumo — Destaques da versão
ru: Краткое описание - Основные моменты релиза
sv: Sammanfattning -- Release highlights

source: New syntax features:
pt_pt: Novas funcionalidades de sintaxe:
ru: Новые возможности синтаксиса:
sv: Nya syntaxfunktioner:

source: :ref:`PEP 492 <whatsnew-pep-492>`, coroutines with async and await syntax.
pt_pt: :ref:`PEP 492 <whatsnew-pep-492>`, *coroutines* com sintaxe *async* e *await*.
ru: :ref:`PEP 492 <whatsnew-pep-492>`, сопрограммы с синтаксисом async и await.
sv: :ref:`PEP 492 <whatsnew-pep-492>`, coroutines med async- och await-syntax.

source: :ref:`PEP 465 <whatsnew-pep-465>`, a new matrix multiplication operator: ``a @ b``.
pt_pt: :ref:`PEP 465 <whatsnew-pep-465>`, um novo operador de multiplicação de matrizes: ``a @ b``.
ru: :ref:`PEP 465 <whatsnew-pep-465>`, новый оператор матричного умножения: ``a @ b``.
sv: :ref:`PEP 465 <whatsnew-pep-465>`, en ny operator för matrismultiplikation: ``a @ b``.

source: :ref:`PEP 448 <whatsnew-pep-448>`, additional unpacking generalizations.
pt_pt: :ref:`PEP 448 <whatsnew-pep-448>`, generalizações adicionais de *unpacking*.
ru: :ref:`PEP 448 <whatsnew-pep-448>`, дополнительные обобщения по распаковке.
sv: :ref:`PEP 448 <whatsnew-pep-448>`, ytterligare uppackning av generaliseringar.

source: New library modules:
pt_pt: Novos módulos de biblioteca:
ru: Новые библиотечные модули:
sv: Nya biblioteksmoduler:

source: :mod:`typing`: :ref:`PEP 484 -- Type Hints <whatsnew-pep-484>`.
pt_pt: :mod:`typing`: :ref:`PEP 484 — Dicas de Tipo <whatsnew-pep-484>`.
ru: :mod:`typing`: :ref:`PEP 484 -- Подсказки по типу <whatsnew-pep-484>`.

source: :mod:`zipapp`: :ref:`PEP 441 Improving Python ZIP Application Support <whatsnew-zipapp>`.
pt_pt: :mod:`zipapp`: :ref:`PEP 441 — Melhorar o Suporte para Aplicações ZIP em Python <whatsnew-zipapp>`.
ru: :mod:`zipapp`: :ref:`PEP 441 Улучшение поддержки приложений Python ZIP <whatsnew-zipapp>`.

source: New built-in features:
pt_pt: Novas funcionalidades integradas:
ru: Новые встроенные функции:
sv: Nya inbyggda funktioner:

source: ``bytes % args``, ``bytearray % args``: :ref:`PEP 461 <whatsnew-pep-461>` -- Adding ``%`` formatting to bytes and bytearray.
pt_pt: ``bytes % args``, ``bytearray % args``: :ref:`PEP 461 <whatsnew-pep-461>` — Adicionar formatação ``%`` a *bytes* e *bytearray*.
ru: ``bytes % args``, ``bytearray % args``: :ref:`PEP 461 <whatsnew-pep-461>` -- Добавление форматирования ``%`` к байтам и bytearray.
sv: ``bytes % args``, ``bytearray % args``: :ref:`PEP 461 <whatsnew-pep-461>` -- Lägger till ``%`` formatering till bytes och bytearray.

source: New :meth:`bytes.hex`, :meth:`bytearray.hex` and :meth:`memoryview.hex` methods. (Contributed by Arnon Yaari in :issue:`9951`.)
pt_pt: Novos métodos :meth:`bytes.hex`, :meth:`bytearray.hex` e :meth:`memoryview.hex`. (Contribuído por Arnon Yaari em :issue:`9951`.)
ru: Новые методы :meth:`bytes.hex`, :meth:`bytearray.hex` и :meth:`memoryview.hex`. (Предоставлено Арноном Яари в :issue:`9951`.)
sv: Nya metoder :meth:`bytes.hex`, :meth:`bytearray.hex` och :meth:`memoryview.hex`. (Bidrag från Arnon Yaari i :issue:`9951`.)

source: :class:`memoryview` now supports tuple indexing (including multi-dimensional). (Contributed by Antoine Pitrou in :issue:`23632`.)
pt_pt: A classe :class:`memoryview` agora suporta indexação por tuplo (incluindo multi-dimensional). (Contribuído por Antoine Pitrou em :issue:`23632`.)
ru: :class:`memoryview` теперь поддерживает индексацию кортежей (в том числе многомерную). (Предоставлено Антуаном Питру в :issue:`23632`.)
sv: :class:`memoryview` har nu stöd för tuple-indexering (inklusive flerdimensionell). (Bidrag från Antoine Pitrou i :issue:`23632`.)

source: Generators have a new ``gi_yieldfrom`` attribute, which returns the object being iterated by ``yield from`` expressions. (Contributed by Benno Leslie and Yury Selivanov in :issue:`24450`.)
pt_pt: Os geradores têm um novo atributo ``gi_yieldfrom``, que devolve o objeto que está a ser iterado pelas expressões ``yield from``. (Contribuído por Benno Leslie e Yury Selivanov em :issue:`24450`.)
ru: Генераторы имеют новый атрибут ``gi_yieldfrom``, который возвращает объект, который итерируется с помощью выражений ``yield from``. (Предоставлено Бенно Лесли и Юрием Селивановым в :issue:`24450`.)
sv: Generatorer har ett nytt attribut ``gi_yieldfrom``, som returnerar objektet som itereras av ``yield from``\ -uttryck. (Bidrag från Benno Leslie och Yury Selivanov i :issue:`24450`.)

source: A new :exc:`RecursionError` exception is now raised when maximum recursion depth is reached. (Contributed by Georg Brandl in :issue:`19235`.)
pt_pt: Uma nova exceção :exc:`RecursionError` é agora lançada quando é atingida a profundidade máxima de recursão. (Contribuído por Georg Brandl em :issue:`19235`.)
ru: Новое исключение :exc:`RecursionError` теперь вызывается при достижении максимальной глубины рекурсии. (Предоставлено Георгом Брандлом в :issue:`19235`.)
sv: Ett nytt :exc:`RecursionError`\-undantag görs nu när maximalt rekursionsdjup har uppnåtts. (Bidrag från Georg Brandl i :issue:`19235`.)

source: CPython implementation improvements:
pt_pt: Melhorias na implementação do CPython:
ru: Улучшения в реализации CPython:
sv: Förbättringar av CPython-implementeringen:

source: When the ``LC_TYPE`` locale is the POSIX locale (``C`` locale), :py:data:`sys.stdin` and :py:data:`sys.stdout` now use the ``surrogateescape`` error handler, instead of the ``strict`` error handler. (Contributed by Victor Stinner in :issue:`19977`.)
pt_pt: Quando a *locale* ``LC_TYPE`` é a *locale* POSIX (``C``), :py:data:`sys.stdin` e :py:data:`sys.stdout` agora usam o gestor de erros ``surrogateescape``, em vez do gestor de erros ``strict``. (Contribuído por Victor Stinner em :issue:`19977`.)
ru: Если локаль ``LC_TYPE`` является локалью POSIX (локаль ``C``), :py:data:`sys.stdin` и :py:data:`sys.stdout` теперь используют ``surrogateescape`` обработчик ошибок вместо ``строгого`` обработчика ошибок. (Предоставлено Виктором Стиннером в :issue:`19977`.)
sv: När ``LC_TYPE`` locale är POSIX locale (``C``\-locale), använder :py:data:`sys.stdin` och :py:data:`sys.stdout` nu felhanteraren ``surrogateescape`` istället för felhanteraren ``strict``. (Bidrag från Victor Stinner i :issue:`19977`.)

source: ``.pyo`` files are no longer used and have been replaced by a more flexible scheme that includes the optimization level explicitly in ``.pyc`` name. (See :ref:`PEP 488 overview <whatsnew-pep-488>`.)
pt_pt: Os ficheiros ``.pyo`` já não são usados e foram substituídos por um esquema mais flexível que inclui o nível de otimização explicitamente no nome ``.pyc``. (Consulte :ref:`visão geral da PEP 488 <whatsnew-pep-488>`.)
ru: Файлы ``.pyo`` больше не используются и были заменены более гибкой схемой, которая явно включает уровень оптимизации в имя ``.pyc``. (См. :ref:`Обзор PEP 488 <whatsnew-pep-488>`.)
sv: ``.pyo``\ -filer används inte längre och har ersatts av ett mer flexibelt system som inkluderar optimeringsnivån explicit i ``.pyc``\ -namnet. (Se :ref:`PEP 488 översikt <whatsnew-pep-488>`.)

source: Builtin and extension modules are now initialized in a multi-phase process, which is similar to how Python modules are loaded. (See :ref:`PEP 489 overview <whatsnew-pep-489>`.)
pt_pt: Os módulos integrados e de extensão são agora inicializados num processo de múltiplas fases, que é semelhante à forma como os módulos Python são carregados. (Consulte :ref:`visão geral da PEP 489 <whatsnew-pep-489>`.)
ru: Встроенные модули и модули расширения теперь инициализируются в многоэтапный процесс, аналогичный загрузке модулей Python. (См. :ref:`Обзор PEP 489 <whatsnew-pep-489>`.)
sv: Inbyggda moduler och tilläggsmoduler initialiseras nu i en flerfasprocess, som liknar hur Python-moduler laddas. (Se :ref:`PEP 489 översikt <whatsnew-pep-489>`.)

source: Significant improvements in the standard library:
pt_pt: Melhorias significativas na biblioteca padrão:
ru: Значительные улучшения в стандартной библиотеке:
sv: Betydande förbättringar i standardbiblioteket:

source: :class:`collections.OrderedDict` is now :ref:`implemented in C <whatsnew-ordereddict>`, which makes it 4 to 100 times faster.
pt_pt: A classe :class:`collections.OrderedDict` é agora :ref:`implementada em C <whatsnew-ordereddict>`, o que a torna 4 a 100 vezes mais rápida.
ru: :class:`collections.OrderedDict` теперь :ref:`реализован на C <whatsnew-ordereddict>`, что делает его в 4–100 раз быстрее.
sv: :class:`collections.OrderedDict` är nu :ref:`implemented in C <whatsnew-ordereddict>`, vilket gör den 4 till 100 gånger snabbare.

source: The :mod:`ssl` module gained :ref:`support for Memory BIO <whatsnew-sslmemorybio>`, which decouples SSL protocol handling from network IO.
pt_pt: O módulo :mod:`ssl` ganhou :ref:`suporte para Memory BIO <whatsnew-sslmemorybio>`, que desvincula o tratamento do protocolo SSL da E/S de rede.
ru: Модуль :mod:`ssl` получил :ref:`поддержку Memory BIO <whatsnew-sslmemorybio>`, которая отделяет обработку протокола SSL от сетевого ввода-вывода.
sv: Modulen :mod:`ssl` fick :ref:`stöd för Memory BIO <whatsnew-sslmemorybio>`, som frikopplar SSL-protokollhanteringen från nätverks-IO.

source: The new :func:`os.scandir` function provides a :ref:`better and significantly faster way <whatsnew-pep-471>` of directory traversal.
pt_pt: A nova função :func:`os.scandir` fornece uma :ref:`forma melhor e significativamente mais rápida <whatsnew-pep-471>` de percorrer diretórios.
ru: Новая функция :func:`os.scandir` обеспечивает :ref:`лучший и значительно более быстрый способ <whatsnew-pep-471>` обхода каталогов.
sv: Den nya :func:`os.scandir`\-funktionen ger ett :ref:`bättre och betydligt snabbare sätt <whatsnew-pep-471>` att genomkorsa kataloger.

source: :func:`functools.lru_cache` has been mostly :ref:`reimplemented in C <whatsnew-lrucache>`, yielding much better performance.
pt_pt: A função :func:`functools.lru_cache` foi maioritariamente :ref:`reimplementada em C <whatsnew-lrucache>`, resultando num desempenho muito melhor.
ru: :func:`functools.lru_cache` в основном :ref:`переписан в C <whatsnew-lrucache>`, что обеспечивает гораздо лучшую производительность.
sv: :func:`functools.lru_cache` har till största delen :ref:`reimplementerats i C <whatsnew-lrucache>`, vilket ger mycket bättre prestanda.

source: The new :func:`subprocess.run` function provides a :ref:`streamlined way to run subprocesses <whatsnew-subprocess>`.
pt_pt: A nova função :func:`subprocess.run` fornece uma :ref:`forma simplificada para executar subprocessos <whatsnew-subprocess>`.
ru: Новая функция :func:`subprocess.run` обеспечивает :ref:`упрощенный способ запуска подпроцессов <whatsnew-subprocess>`.
sv: Den nya funktionen :func:`subprocess.run` ger ett :ref:`strömlinjeformat sätt att köra underprocesser <whatsnew-subprocess>`.

source: The :mod:`traceback` module has been significantly :ref:`enhanced <whatsnew-traceback>` for improved performance and developer convenience.
pt_pt: O módulo :mod:`traceback` foi significativamente :ref:`melhorado <whatsnew-traceback>` para melhorar o desempenho e a conveniência do programador.
ru: Модуль :mod:`traceback` был значительно :ref:`улучшен <whatsnew-traceback>` для повышения производительности и удобства разработчиков.
sv: Modulen :mod:`traceback` har fått en betydande :ref:`enhanced <whatsnew-traceback>` för att förbättra prestanda och underlätta för utvecklare.

source: Security improvements:
pt_pt: Melhorias de segurança:
ru: Улучшения безопасности:
sv: Förbättringar av säkerheten:

source: SSLv3 is now disabled throughout the standard library. It can still be enabled by instantiating a :class:`ssl.SSLContext` manually. (See :issue:`22638` for more details; this change was backported to CPython 3.4 and 2.7.)
pt_pt: O SSLv3 está agora desativado em toda a biblioteca padrão. Ainda pode ser ativado instanciando manualmente um :class:`ssl.SSLContext`. (Consulte :issue:`22638` para mais detalhes; esta alteração foi retroportada para o CPython 3.4 e 2.7.)
ru: SSLv3 теперь отключен во всей стандартной библиотеке. Его все еще можно включить, создав экземпляр :class:`ssl.SSLContext` вручную. (Подробнее см. в :issue:`22638`; это изменение было перенесено в CPython 3.4 и 2.7.)
sv: SSLv3 är nu inaktiverat i hela standardbiblioteket. Det kan fortfarande aktiveras genom att instansiera en :class:`ssl.SSLContext` manuellt. (Se :issue:`22638` för mer information; denna ändring har backporterats till CPython 3.4 och 2.7.)

source: HTTP cookie parsing is now stricter, in order to protect against potential injection attacks. (Contributed by Antoine Pitrou in :issue:`22796`.)
pt_pt: A análise de *cookies* HTTP é agora mais rigorosa, para proteger contra potenciais ataques de injeção. (Contribuído por Antoine Pitrou em :issue:`22796`.)
ru: Анализ файлов cookie HTTP теперь стал более строгим, чтобы защититься от потенциальных атак путем внедрения. (Предоставлено Антуаном Питру в :issue:`22796`.)
sv: Parsing av HTTP-cookies är nu striktare, för att skydda mot potentiella injektionsattacker. (Bidrag från Antoine Pitrou i :issue:`22796`.)

source: Windows improvements:
pt_pt: Melhorias no Windows:
ru: Улучшения Windows:
sv: Förbättringar i Windows:

source: A new installer for Windows has replaced the old MSI. See :ref:`using-on-windows` for more information.
pt_pt: Um novo instalador para Windows substituiu o antigo MSI. Consulte :ref:`using-on-windows` para mais informações.
ru: Новый установщик для Windows заменил старый MSI. Дополнительную информацию см. в разделе :ref:`using-on-windows`.
sv: Ett nytt installationsprogram för Windows har ersatt det gamla MSI-programmet. Se :ref:`using-on-windows` för mer information.

source: Windows builds now use Microsoft Visual C++ 14.0, and extension modules should use the same.
pt_pt: As construções para Windows agora usam o Microsoft Visual C++ 14.0, e os módulos de extensão devem usar o mesmo.
ru: Сборки Windows теперь используют Microsoft Visual C++ 14.0, и модули расширения должны использовать то же самое.
sv: Windows-versioner använder nu Microsoft Visual C++ 14.0, och tilläggsmoduler bör använda samma sak.

source: Please read on for a comprehensive list of user-facing changes, including many other smaller improvements, CPython optimizations, deprecations, and potential porting issues.
pt_pt: Por favor, continue a ler para uma lista abrangente de alterações visíveis para o utilizador, incluindo muitas outras melhorias menores, otimizações do CPython, descontinuações e potenciais problemas de portabilidade.
ru: Пожалуйста, прочтите полный список изменений, с которыми сталкиваются пользователи, включая множество других небольших улучшений, оптимизацию CPython, прекращение поддержки и потенциальные проблемы с портированием.
sv: Läs vidare för en omfattande lista över användarorienterade ändringar, inklusive många andra mindre förbättringar, CPython-optimeringar, avskrivningar och potentiella portningsproblem.

source: New Features
pt_pt: Novas Funcionalidades
ru: Новые особенности
sv: Nya funktioner

source: PEP 492 - Coroutines with async and await syntax
pt_pt: PEP 492 — *Coroutines* com sintaxe *async* e *await*
ru: PEP 492 — сопрограммы с синтаксисом async и await
sv: PEP 492 - Coroutines med async- och await-syntax

source: :pep:`492` greatly improves support for asynchronous programming in Python by adding :term:`awaitable objects <awaitable>`, :term:`coroutine functions <coroutine function>`, :term:`asynchronous iteration <asynchronous iterable>`, and :term:`asynchronous context managers <asynchronous context manager>`.
pt_pt: A :pep:`492` melhora significativamente o suporte para programação assíncrona em Python, adicionando :term:`objetos aguardáveis <awaitable>`, :term:`funções *coroutine* <coroutine function>`, :term:`iteração assíncrona <asynchronous iterable>`, e :term:`gestores de contexto assíncronos <asynchronous context manager>`.
ru: :pep:`492` значительно улучшает поддержку асинхронного программирования на Python, добавляя :term:`awaitable объекты <awaitable>`, :term:`coroutine function <coroutine function>`, :term:`asynchronous iteration <asynchronous iterable>` и :term:`асинхронные контекстные менеджеры <асинхронный контекстный менеджер>`.
sv: :pep:`492` förbättrar kraftigt stödet för asynkron programmering i Python genom att lägga till :term:`awaitable objects <awaitable>`, :term:`coroutine functions <coroutine function>`, :term:`asynchronous iteration <asynchronous iterable>`, och :term:`asynchronous context managers <asynchronous context manager>`.

source: Coroutine functions are declared using the new :keyword:`async def` syntax::
pt_pt: As funções *coroutine* são declaradas usando a nova sintaxe :keyword:`async def`::
ru: Функции сопрограммы объявляются с использованием нового синтаксиса :keyword:`async def`::
sv: Coroutine-funktioner deklareras med hjälp av den nya :keyword:`async def` syntaxen::

source: Inside a coroutine function, the new :keyword:`await` expression can be used to suspend coroutine execution until the result is available. Any object can be *awaited*, as long as it implements the :term:`awaitable` protocol by defining the :meth:`~object.__await__` method.
pt_pt: Dentro de uma função *coroutine*, a nova expressão :keyword:`await` pode ser usada para suspender a execução da *coroutine* até que o resultado esteja disponível. Qualquer objeto pode ser *aguardado*, desde que implemente o protocolo :term:`awaitable` definindo o método :meth:`~object.__await__`.

source: PEP 492 also adds :keyword:`async for` statement for convenient iteration over asynchronous iterables.
pt_pt: A PEP 492 também adiciona a instrução :keyword:`async for` para iteração conveniente sobre iteráveis assíncronos.
ru: PEP 492 также добавляет оператор :keyword:`async for` для удобной итерации по асинхронным итерациям.
sv: PEP 492 lägger också till :keyword:`async for` statement för bekväm iteration över asynkrona iterabler.

source: An example of a rudimentary HTTP client written using the new syntax::
pt_pt: Um exemplo de um cliente HTTP rudimentar escrito usando a nova sintaxe::
ru: Пример элементарного HTTP-клиента, написанного с использованием нового синтаксиса:
sv: Ett exempel på en rudimentär HTTP-klient som skrivits med den nya syntaxen::

source: Similarly to asynchronous iteration, there is a new syntax for asynchronous context managers. The following script::
pt_pt: De forma semelhante à iteração assíncrona, existe uma nova sintaxe para gestores de contexto assíncronos. O seguinte script::
ru: Как и в случае с асинхронной итерацией, для асинхронных менеджеров контекста существует новый синтаксис. Следующий скрипт::
sv: På samma sätt som för asynkron iteration finns det en ny syntax för asynkrona kontexthanterare. Följande skript::

source: import asyncio async def coro(name, lock): print('coro {}: waiting for lock'.format(name)) async with lock: print('coro {}: holding the lock'.format(name)) await asyncio.sleep(1) print('coro {}: releasing the lock'.format(name)) loop = asyncio.get_event_loop() lock = asyncio.Lock() coros = asyncio.gather(coro(1, lock), coro(2, lock)) try: loop.run_until_complete(coros) finally: loop.close()
pt_pt: import asyncio async def coro(name, lock): print('coro {}: à espera de bloqueio'.format(name)) async with lock: print('coro {}: com bloqueio'.format(name)) await asyncio.sleep(1) print('coro {}: a libertar bloqueio'.format(name)) loop = asyncio.get_event_loop() lock = asyncio.Lock() coros = asyncio.gather(coro(1, lock), coro(2, lock)) try: loop.run_until_complete(coros) finally: loop.close()

source: will output::
pt_pt: produzirá a saída:
ru: выведет::
sv: kommer att mata ut::

source: coro 2: waiting for lock coro 2: holding the lock coro 1: waiting for lock coro 2: releasing the lock coro 1: holding the lock coro 1: releasing the lock
pt_pt: coro 2: à espera de bloqueio coro 2: com bloqueio coro 1: à espera de bloqueio coro 2: a libertar bloqueio coro 1: com bloqueio coro 1: a libertar bloqueio
sv: coro 2: väntar på lås coro 2: håller i låset coro 1: väntar på lås coro 2: frigör låset coro 1: håller i låset coro 1: släpper låset

source: Note that both :keyword:`async for` and :keyword:`async with` can only be used inside a coroutine function declared with :keyword:`async def`.
pt_pt: Note que tanto :keyword:`async for` como :keyword:`async with` só podem ser usados dentro de uma função *coroutine* declarada com :keyword:`async def`.
ru: Обратите внимание, что оба :keyword:`async for` и :keyword:`async with` могут использоваться только внутри функции сопрограммы, объявленной с помощью :keyword:`async def`.
sv: Observera att både :keyword:`async for` och :keyword:`async with` endast kan användas inuti en coroutine-funktion som deklarerats med :keyword:`async def`.

source: Coroutine functions are intended to be run inside a compatible event loop, such as the :ref:`asyncio loop <asyncio-event-loop>`.
pt_pt: As funções *coroutine* são destinadas a ser executadas dentro de um ciclo de eventos compatível, como o :ref:`ciclo asyncio <asyncio-event-loop>`.
ru: Функции сопрограммы предназначены для запуска внутри совместимого цикла событий, такого как цикл asyncio <asyncio-event-loop>.
sv: Coroutine-funktioner är avsedda att köras i en kompatibel händelseslinga, t.ex. :ref:`asyncio loop <asyncio-event-loop>`.

source: Starting with CPython 3.5.2, ``__aiter__`` can directly return :term:`asynchronous iterators <asynchronous iterator>`. Returning an :term:`awaitable` object will result in a :exc:`PendingDeprecationWarning`.
pt_pt: A partir do CPython 3.5.2, ``__aiter__`` pode devolver diretamente :term:`iteradores assíncronos <asynchronous iterator>`. Devolver um objeto :term:`awaitable` resultará num :exc:`PendingDeprecationWarning`.
ru: Начиная с CPython 3.5.2, ``__aiter__`` может напрямую возвращать :term:`асинхронные итераторы <asynchronous iterator>`. Возврат объекта :term:`awaitable` приведет к появлению :exc:`PendingDeprecationWarning`.
sv: Från och med CPython 3.5.2 kan ``__aiter__`` direkt returnera :term:`asynchronous iterators <asynchronous iterator>`. Att returnera ett :term:`awaitable`\-objekt kommer att resultera i en :exc:`PendingDeprecationWarning`.

source: See more details in the :ref:`async-iterators` documentation section.
pt_pt: Consulte mais detalhes na secção de documentação :ref:`async-iterators`.
ru: Подробности смотрите в разделе документации async-iterators.
sv: Se mer information i dokumentationsavsnittet :ref:`async-iterators`.
