Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: The :meth:`BZ2Decompressor.decompress <bz2.BZ2Decompressor.decompress>` method now accepts an optional *max_length* argument to limit the maximum size of decompressed data. (Contributed by Nikolaus Rath in :issue:`15955`.)
pt_pt: O método :meth:`BZ2Decompressor.decompress <bz2.BZ2Decompressor.decompress>` agora aceita um argumento opcional *max_length* para limitar o tamanho máximo dos dados descomprimidos. (Contribuído por Nikolaus Rath em :issue:`15955`.)
ru: Метод :meth:`BZ2Decompressor.decompress <bz2.BZ2Decompressor.decompress>` теперь принимает необязательный аргумент *max_length* для ограничения максимального размера распакованных данных. (Предоставлено Николаусом Ратом в :issue:`15955`.)
sv: Metoden :meth:`BZ2Decompressor.decompress <bz2.BZ2Decompressor.decompress>` accepterar nu ett valfritt *max_length*-argument för att begränsa den maximala storleken på dekomprimerade data. (Bidrag från Nikolaus Rath i :issue:`15955`.)

source: The :class:`!FieldStorage` class now supports the :term:`context manager` protocol. (Contributed by Berker Peksag in :issue:`20289`.)
pt_pt: A classe :class:`!FieldStorage` agora suporta o protocolo :term:`gestor de contexto`. (Contribuído por Berker Peksag em :issue:`20289`.)
sv: Klassen :class:`!FieldStorage` har nu stöd för protokollet :term:`context manager`. (Bidrag från Berker Peksag i :issue:`20289`.)

source: A new function :func:`~cmath.isclose` provides a way to test for approximate equality. (Contributed by Chris Barker and Tal Einat in :issue:`24270`.)
pt_pt: Uma nova função :func:`~cmath.isclose` fornece uma forma de testar igualdade aproximada. (Contribuído por Chris Barker e Tal Einat em :issue:`24270`.)
ru: Новая функция :func:`~cmath.isclose` позволяет проверить приблизительное равенство. (Предоставлено Крисом Баркером и Талом Эйнатом в :issue:`24270`.)
sv: En ny funktion :func:`~cmath.isclose` ger ett sätt att testa för ungefärlig likhet. (Bidrag från Chris Barker och Tal Einat i :issue:`24270`.)

source: The :func:`InteractiveInterpreter.showtraceback() <code.InteractiveInterpreter.showtraceback>` method now prints the full chained traceback, just like the interactive interpreter. (Contributed by Claudiu Popa in :issue:`17442`.)
pt_pt: O método :func:`InteractiveInterpreter.showtraceback() <code.InteractiveInterpreter.showtraceback>` agora imprime o *traceback* encadeado completo, tal como o interpretador interativo. (Contribuído por Claudiu Popa em :issue:`17442`.)
ru: Метод :func:`InteractiveInterpreter.showtraceback() <code.InteractiveInterpreter.showtraceback>` теперь печатает полную цепочку трассировки, как и интерактивный интерпретатор. (Предоставлено Клаудиу Попа в :issue:`17442`.)
sv: Metoden :func:`InteractiveInterpreter.showtraceback() <code.InteractiveInterpreter.showtraceback>` skriver nu ut hela den kedjade tracebacken, precis som den interaktiva tolken. (Bidrag från Claudiu Popa i :issue:`17442`.)

source: The :class:`~collections.OrderedDict` class is now implemented in C, which makes it 4 to 100 times faster. (Contributed by Eric Snow in :issue:`16991`.)
pt_pt: A classe :class:`~collections.OrderedDict` é agora implementada em C, o que a torna 4 a 100 vezes mais rápida. (Contribuído por Eric Snow em :issue:`16991`.)
ru: Класс :class:`~collections.OrderedDict` теперь реализован на языке C, что делает его работу в 4–100 раз быстрее. (Предоставлено Эриком Сноу в :issue:`16991`.)
sv: Klassen :class:`~collections.OrderedDict` är nu implementerad i C, vilket gör den 4 till 100 gånger snabbare. (Bidrag från Eric Snow i :issue:`16991`.)

source: :meth:`!OrderedDict.items`, :meth:`!OrderedDict.keys`, and :meth:`!OrderedDict.values` views now support :func:`reversed` iteration. (Contributed by Serhiy Storchaka in :issue:`19505`.)
pt_pt: As vistas :meth:`!OrderedDict.items`, :meth:`!OrderedDict.keys` e :meth:`!OrderedDict.values` agora suportam iteração :func:`reversed`. (Contribuído por Serhiy Storchaka em :issue:`19505`.)

source: The :class:`~collections.deque` class now defines :meth:`~collections.deque.index`, :meth:`~collections.deque.insert`, and :meth:`~collections.deque.copy`, and supports the ``+`` and ``*`` operators. This allows deques to be recognized as a :class:`~collections.abc.MutableSequence` and improves their substitutability for lists. (Contributed by Raymond Hettinger in :issue:`23704`.)
pt_pt: A classe :class:`~collections.deque` agora define :meth:`~collections.deque.index`, :meth:`~collections.deque.insert` e :meth:`~collections.deque.copy`, e suporta os operadores ``+`` e ``*``. Isto permite que as *deques* sejam reconhecidas como uma :class:`~collections.abc.MutableSequence` e melhora a sua substituição por listas. (Contribuído por Raymond Hettinger em :issue:`23704`.)
ru: Класс :class:`~collections.deque` теперь определяет :meth:`~collections.deque.index`, :meth:`~collections.deque.insert` и :meth:`~collections.deque.copy`, и поддерживает операторы ``+`` и ``*``. Это позволяет распознавать деки как :class:`~collections.abc.MutableSequence` и улучшает их заменяемость списками. (Предоставлено Рэймондом Хеттингером в :issue:`23704`.)
sv: Klassen :class:`~collections.deque` definierar nu :meth:`~collections.deque.index`, :meth:`~collections.deque.insert`, och :meth:`~collections.deque.copy`, och stöder operatorerna ``+`` och ``*``. Detta gör att deques kan identifieras som en :class:`~collections.abc.MutableSequence` och förbättrar deras utbytbarhet mot listor. (Bidrag från Raymond Hettinger i :issue:`23704`.)

source: Docstrings produced by :func:`~collections.namedtuple` can now be updated::
pt_pt: As *docstrings* produzidas por :func:`~collections.namedtuple` agora podem ser atualizadas::
ru: Строки документации, созданные :func:`~collections.namedtuple`, теперь можно обновлять::
sv: Docstrings producerade av :func:`~collections.namedtuple` kan nu uppdateras::

source: Point = namedtuple('Point', ['x', 'y']) Point.__doc__ += ': Cartesian coordinate' Point.x.__doc__ = 'abscissa' Point.y.__doc__ = 'ordinate'
pt_pt: Point = namedtuple('Point', ['x', 'y']) Point.__doc__ += ': Coordenada cartesiana' Point.x.__doc__ = 'abcissa' Point.y.__doc__ = 'ordenada'
sv: Point = namedtuple('Point', ['x', 'y']) Point.__doc__ += ': Kartesisk koordinat' Point.x.__doc__ = 'abscissa' Point.y.__doc__ = 'ordinat'

source: (Contributed by Berker Peksag in :issue:`24064`.)
pt_pt: (Contribuído por Berker Peksag em :issue:`24064`.)
ru: (Предоставлено Беркером Пексагом в :issue:`24064`.)
sv: (Bidrag från Berker Peksag i :issue:`24064`.)

source: The :class:`~collections.UserString` class now implements the :meth:`~object.__getnewargs__`, :meth:`~object.__rmod__`, :meth:`~str.casefold`, :meth:`~str.format_map`, :meth:`~str.isprintable`, and :meth:`~str.maketrans` methods to match the corresponding methods of :class:`str`. (Contributed by Joe Jevnik in :issue:`22189`.)
pt_pt: A classe :class:`~collections.UserString` agora implementa os métodos :meth:`~object.__getnewargs__`, :meth:`~object.__rmod__`, :meth:`~str.casefold`, :meth:`~str.format_map`, :meth:`~str.isprintable` e :meth:`~str.maketrans` para corresponder aos métodos correspondentes de :class:`str`. (Contribuído por Joe Jevnik em :issue:`22189`.)

source: The :meth:`!Sequence.index` method now accepts *start* and *stop* arguments to match the corresponding methods of :class:`tuple`, :class:`list`, etc. (Contributed by Devin Jeanpierre in :issue:`23086`.)
pt_pt: O método :meth:`!Sequence.index` agora aceita argumentos *start* e *stop* para corresponder aos métodos correspondentes de :class:`tuple`, :class:`list`, etc. (Contribuído por Devin Jeanpierre em :issue:`23086`.)

source: A new :class:`~collections.abc.Generator` abstract base class. (Contributed by Stefan Behnel in :issue:`24018`.)
pt_pt: Uma nova classe base abstrata :class:`~collections.abc.Generator`. (Contribuído por Stefan Behnel em :issue:`24018`.)
ru: Новый абстрактный базовый класс :class:`~collections.abc.Generator`. (Предоставлено Стефаном Бенелем в :issue:`24018`.)
sv: En ny :class:`~collections.abc.Generator` abstrakt basklass. (Bidrag från Stefan Behnel i :issue:`24018`.)

source: New :class:`~collections.abc.Awaitable`, :class:`~collections.abc.Coroutine`, :class:`~collections.abc.AsyncIterator`, and :class:`~collections.abc.AsyncIterable` abstract base classes. (Contributed by Yury Selivanov in :issue:`24184`.)
pt_pt: Novas classes base abstratas :class:`~collections.abc.Awaitable`, :class:`~collections.abc.Coroutine`, :class:`~collections.abc.AsyncIterator` e :class:`~collections.abc.AsyncIterable`. (Contribuído por Yury Selivanov em :issue:`24184`.)
ru: Новые :class:`~collections.abc.Awaitable`, :class:`~collections.abc.Coroutine`, :class:`~collections.abc.AsyncIterator` и :class:`~collections.abc.AsyncIterable` абстрактные. базовые классы. (Добавлен Юрием Селивановым в :issue:`24184`.)
sv: Nya :class:`~collections.abc.Awaitable`, :class:`~collections.abc.Coroutine`, :class:`~collections.abc.AsyncIterator`, och :class:`~collections.abc.AsyncIterable` abstrakta basklasser. (Bidrag från Yury Selivanov i :issue:`24184`.)

source: For earlier Python versions, a backport of the new ABCs is available in an external :pypi:`PyPI package <backports_abc>`.
pt_pt: Para versões anteriores do Python, uma retroportagem das novas ABCs está disponível num pacote externo :pypi:`PyPI <backports_abc>`.
sv: För tidigare Python-versioner finns en backport av de nya ABC:erna i ett externt :pypi:`PyPI-paket <backports_abc>`.

source: A new :mod:`compileall` option, :samp:`-j {N}`, allows running *N* workers simultaneously to perform parallel bytecode compilation. The :func:`~compileall.compile_dir` function has a corresponding ``workers`` parameter. (Contributed by Claudiu Popa in :issue:`16104`.)
pt_pt: Uma nova opção :mod:`compileall`, :samp:`-j {N}`, permite executar *N* trabalhadores simultaneamente para realizar compilação paralela de *bytecode*. A função :func:`~compileall.compile_dir` tem um parâmetro correspondente ``workers``. (Contribuído por Claudiu Popa em :issue:`16104`.)
ru: Новая опция :mod:`compileall`, :samp:`-j {N}`, позволяет одновременно запускать *N* воркеры для выполнения параллельной компиляции байт-кода. Функция :func:`~compileall.compile_dir` имеет соответствующий параметр ``workers``. (Предоставлено Клаудиу Попа в :issue:`16104`.)
sv: Ett nytt :mod:`compileall`\-alternativ, :samp:`\-j {N}`, gör det möjligt att köra *N* arbetare samtidigt för att utföra parallell bytekodkompilering. Funktionen :func:`~compileall.compile_dir` har en motsvarande parameter för ``workers``. (Bidrag från Claudiu Popa i :issue:`16104`.)

source: Another new option, ``-r``, allows controlling the maximum recursion level for subdirectories. (Contributed by Claudiu Popa in :issue:`19628`.)
pt_pt: Outra nova opção, ``-r``, permite controlar o nível máximo de recursão para subdiretórios. (Contribuído por Claudiu Popa em :issue:`19628`.)
ru: Другая новая опция, ``-r``, позволяет контролировать максимальный уровень рекурсии для подкаталогов. (Предоставлено Клаудиу Попа в :issue:`19628`.)
sv: Ett annat nytt alternativ, ``\-r``, gör det möjligt att kontrollera den maximala rekursionsnivån för underkataloger. (Bidrag från Claudiu Popa i :issue:`19628`.)

source: The ``-q`` command line option can now be specified more than once, in which case all output, including errors, will be suppressed. The corresponding ``quiet`` parameter in :func:`~compileall.compile_dir`, :func:`~compileall.compile_file`, and :func:`~compileall.compile_path` can now accept an integer value indicating the level of output suppression. (Contributed by Thomas Kluyver in :issue:`21338`.)
pt_pt: A opção de linha de comandos ``-q`` agora pode ser especificada mais do que uma vez, caso em que toda a saída, incluindo erros, será suprimida. O parâmetro correspondente ``quiet`` em :func:`~compileall.compile_dir`, :func:`~compileall.compile_file` e :func:`~compileall.compile_path` agora pode aceitar um valor inteiro indicando o nível de supressão de saída. (Contribuído por Thomas Kluyver em :issue:`21338`.)
ru: Опцию командной строки ``-q`` теперь можно указать более одного раза, и в этом случае весь вывод, включая ошибки, будет подавлен. Соответствующий параметр ``quiet`` в :func:`~compileall.compile_dir`, :func:`~compileall.compile_file` и :func:`~compileall.compile_path` теперь может принимать целочисленное значение, указывающее уровень вывода. подавление. (Предоставлено Томасом Клюйвером в :issue:`21338`.)
sv: Kommandoradsalternativet ``\-q`` kan nu anges mer än en gång, i vilket fall alla utdata, inklusive fel, kommer att undertryckas. Motsvarande ``quiet``\-parameter i :func:`~compileall.compile_dir`, :func:`~compileall.compile_file` och :func:`~compileall.compile_path` kan nu acceptera ett heltalsvärde som anger nivån på undertryckningen av utdata. (Bidrag från Thomas Kluyver i :issue:`21338`.)

source: The :meth:`Executor.map() <concurrent.futures.Executor.map>` method now accepts a *chunksize* argument to allow batching of tasks to improve performance when :meth:`~concurrent.futures.ProcessPoolExecutor` is used. (Contributed by Dan O'Reilly in :issue:`11271`.)
pt_pt: O método :meth:`Executor.map() <concurrent.futures.Executor.map>` agora aceita um argumento *chunksize* para permitir o processamento em lote de tarefas e melhorar o desempenho quando :meth:`~concurrent.futures.ProcessPoolExecutor` é usado. (Contribuído por Dan O'Reilly em :issue:`11271`.)
ru: Метод :meth:`Executor.map() <concurrent.futures.Executor.map>` теперь принимает аргумент *chunksize*, позволяющий группировать задачи для повышения производительности при использовании :meth:`~concurrent.futures.ProcessPoolExecutor` . (Предоставлено Дэном О'Рейли в :issue:`11271`.)
sv: Metoden :meth:`Executor.map() <concurrent.futures.Executor.map>` accepterar nu ett *chunksize*-argument för att tillåta batchning av uppgifter för att förbättra prestanda när :meth:`~concurrent.futures.ProcessPoolExecutor` används. (Bidrag från Dan O'Reilly i :issue:`11271`.)

source: The number of workers in the :class:`~concurrent.futures.ThreadPoolExecutor` constructor is optional now. The default value is 5 times the number of CPUs. (Contributed by Claudiu Popa in :issue:`21527`.)
pt_pt: O número de trabalhadores no construtor :class:`~concurrent.futures.ThreadPoolExecutor` agora é opcional. O valor predefinido é 5 vezes o número de CPUs. (Contribuído por Claudiu Popa em :issue:`21527`.)
ru: Количество рабочих в конструкторе :class:`~concurrent.futures.ThreadPoolExecutor` теперь не является обязательным. Значение по умолчанию — в 5 раз больше количества процессоров. (Предоставлено Клаудиу Попа в :issue:`21527`.)
sv: Antalet arbetare i :class:`~concurrent.futures.ThreadPoolExecutor`\-konstruktören är nu valfritt. Standardvärdet är 5 gånger antalet processorer. (Bidrag från Claudiu Popa i :issue:`21527`.)

source: :mod:`configparser` now provides a way to customize the conversion of values by specifying a dictionary of converters in the :class:`~configparser.ConfigParser` constructor, or by defining them as methods in ``ConfigParser`` subclasses. Converters defined in a parser instance are inherited by its section proxies.
pt_pt: O módulo :mod:`configparser` agora fornece uma forma de personalizar a conversão de valores especificando um dicionário de conversores no construtor :class:`~configparser.ConfigParser`, ou definindo-os como métodos em subclasses de ``ConfigParser``. Os conversores definidos numa instância de *parser* são herdados pelos seus proxies de secção.
ru: :mod:`configparser` теперь предоставляет возможность настроить преобразование значений, указав словарь преобразователей в конструкторе :class:`~configparser.ConfigParser` или определив их как методы в подклассах ``ConfigParser``. Преобразователи, определенные в экземпляре анализатора, наследуются его прокси-серверами раздела.
sv: :mod:`configparser` ger nu möjlighet att anpassa konverteringen av värden genom att ange en ordlista med konverterare i konstruktören :class:`~configparser.ConfigParser`, eller genom att definiera dem som metoder i underklasser till ``ConfigParser``. Omvandlare som definieras i en parserinstans ärvs av dess sektionsproxies.

source: Example::
pt_pt: Exemplo:
ru: Пример::
sv: Exempel::

source: (Contributed by Łukasz Langa in :issue:`18159`.)
pt_pt: (Contribuído por Łukasz Langa em :issue:`18159`.)
ru: (Предоставлено Лукашом Лангой в :issue:`18159`.)
sv: (Bidrag från Łukasz Langa i :issue:`18159`.)

source: The new :func:`~contextlib.redirect_stderr` :term:`context manager` (similar to :func:`~contextlib.redirect_stdout`) makes it easier for utility scripts to handle inflexible APIs that write their output to :data:`sys.stderr` and don't provide any options to redirect it::
pt_pt: O novo :term:`gestor de contexto` :func:`~contextlib.redirect_stderr` (semelhante a :func:`~contextlib.redirect_stdout`) facilita a manipulação de APIs inflexíveis que escrevem a sua saída para :data:`sys.stderr` e não fornecem opções para a redirecionar::
ru: Новый :func:`~contextlib.redirect_stderr` :term:`контекстный менеджер` (похожий на :func:`~contextlib.redirect_stdout`) упрощает служебным сценариям обработку негибких API, которые записывают свои выходные данные в :data:` sys.stderr` и не предоставляйте никаких возможностей для его перенаправления::
sv: Den nya :func:`~contextlib.redirect_stderr` :term:`context manager` (liknande :func:`~contextlib.redirect_stdout`) gör det lättare för verktygsskript att hantera oflexibla API:er som skriver utdata till :data:`sys.stderr` och inte ger några alternativ för att omdirigera den:

source: (Contributed by Berker Peksag in :issue:`22389`.)
pt_pt: (Contribuído por Berker Peksag em :issue:`22389`.)
ru: (Предоставлено Беркером Пексагом в :issue:`22389`.)
sv: (Bidrag från Berker Peksag i :issue:`22389`.)

source: The :meth:`~csv.csvwriter.writerow` method now supports arbitrary iterables, not just sequences. (Contributed by Serhiy Storchaka in :issue:`23171`.)
pt_pt: O método :meth:`~csv.csvwriter.writerow` agora suporta iteráveis arbitrários, não apenas sequências. (Contribuído por Serhiy Storchaka em :issue:`23171`.)
ru: Метод :meth:`~csv.csvwriter.writerow` теперь поддерживает произвольные итерации, а не только последовательности. (Предоставлено Сергеем Сторчакой в ​​:issue:`23171`.)
sv: Metoden :meth:`~csv.csvwriter.writerow` stöder nu godtyckliga iterabler, inte bara sekvenser. (Bidrag från Serhiy Storchaka i :issue:`23171`.)

source: The new :func:`~curses.update_lines_cols` function updates the :data:`~curses.LINES` and :data:`~curses.COLS` module variables. This is useful for detecting manual screen resizing. (Contributed by Arnon Yaari in :issue:`4254`.)
pt_pt: A nova função :func:`~curses.update_lines_cols` atualiza as variáveis do módulo :data:`~curses.LINES` e :data:`~curses.COLS`. Isto é útil para detetar redimensionamento manual do ecrã. (Contribuído por Arnon Yaari em :issue:`4254`.)

source: :func:`dumb.open <dbm.dumb.open>` always creates a new database when the flag has the value ``"n"``. (Contributed by Claudiu Popa in :issue:`18039`.)
pt_pt: :func:`dumb.open <dbm.dumb.open>` cria sempre uma nova base de dados quando a flag tem o valor ``"n"``. (Contribuído por Claudiu Popa em :issue:`18039`.)
ru: :func:`dumb.open <dbm.dumb.open>` всегда создает новую базу данных, если флаг имеет значение ``"n"``. (Предоставлено Клаудиу Попа в :issue:`18039`.)
sv: :func:`dumb.open <dbm.dumb.open>` skapar alltid en ny databas när flaggan har värdet ``"n"``. (Bidrag från Claudiu Popa i :issue:`18039`.)

source: The charset of HTML documents generated by :meth:`HtmlDiff.make_file() <difflib.HtmlDiff.make_file>` can now be customized by using a new *charset* keyword-only argument. The default charset of HTML document changed from ``"ISO-8859-1"`` to ``"utf-8"``. (Contributed by Berker Peksag in :issue:`2052`.)
pt_pt: O conjunto de caracteres dos documentos HTML gerados por :meth:`HtmlDiff.make_file() <difflib.HtmlDiff.make_file>` agora pode ser personalizado usando um novo argumento apenas por palavra-chave *charset*. O conjunto de caracteres predefinido do documento HTML mudou de ``"ISO-8859-1"`` para ``"utf-8"``. (Contribuído por Berker Peksag em :issue:`2052`.)
ru: Кодировку HTML-документов, созданных с помощью :meth:`HtmlDiff.make_file() <difflib.HtmlDiff.make_file>`, теперь можно настроить с помощью нового аргумента *charset*, содержащего только ключевые слова. Кодировка HTML-документа по умолчанию изменена с «ISO-8859-1» на «utf-8». (Предоставлено Беркером Пексагом в :issue:`2052`.)
sv: Teckensnittet för HTML-dokument som genereras av :meth:`HtmlDiff.make_file() <difflib.HtmlDiff.make_file>` kan nu anpassas med hjälp av ett nytt *charset* argument som endast innehåller nyckelord. Standardteckensnittet för HTML-dokument ändrades från ``"ISO-8859-1"`` till ``"utf-8"``. (Bidrag från Berker Peksag i :issue:`2052`.)

source: The :func:`~difflib.diff_bytes` function can now compare lists of byte strings. This fixes a regression from Python 2. (Contributed by Terry J. Reedy and Greg Ward in :issue:`17445`.)
pt_pt: A função :func:`~difflib.diff_bytes` agora pode comparar listas de *strings* de bytes. Isto corrige uma regressão do Python 2. (Contribuído por Terry J. Reedy e Greg Ward em :issue:`17445`.)
ru: Функция :func:`~difflib.diff_bytes` теперь может сравнивать списки байтовых строк. Это исправляет регрессию по сравнению с Python 2. (Предоставлено Терри Дж. Риди и Грегом Уордом в :issue:`17445`.)
sv: Funktionen :func:`~difflib.diff_bytes` kan nu jämföra listor med bytesträngar. Detta åtgärdar en regression från Python 2. (Bidrag från Terry J. Reedy och Greg Ward i :issue:`17445`.)

source: Both the ``build`` and ``build_ext`` commands now accept a ``-j`` option to enable parallel building of extension modules. (Contributed by Antoine Pitrou in :issue:`5309`.)
pt_pt: Tanto os comandos ``build`` como ``build_ext`` agora aceitam uma opção ``-j`` para ativar a construção paralela de módulos de extensão. (Contribuído por Antoine Pitrou em :issue:`5309`.)
ru: Обе команды ``build`` и ``build_ext`` теперь принимают опцию ``-j`` для включения параллельной сборки модулей расширения. (Предоставлено Антуаном Питру в :issue:`5309`.)
sv: Både kommandona ``build`` och ``build_ext`` accepterar nu alternativet ``\-j`` för att möjliggöra parallell byggnation av tilläggsmoduler. (Bidrag från Antoine Pitrou i :issue:`5309`.)

source: The ``distutils`` module now supports ``xz`` compression, and can be enabled by passing ``xztar`` as an argument to ``bdist --format``. (Contributed by Serhiy Storchaka in :issue:`16314`.)
pt_pt: O módulo ``distutils`` agora suporta compressão ``xz`` e pode ser ativada passando ``xztar`` como argumento para ``bdist --format``. (Contribuído por Serhiy Storchaka em :issue:`16314`.)
sv: Modulen ``distutils`` stöder nu ``xz``\-komprimering och kan aktiveras genom att skicka ``xztar`` som ett argument till ``bdist --format``. (Bidrag från Serhiy Storchaka i :issue:`16314`.)
