Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: The :class:`!SMTPServer` class now also supports the ``SMTPUTF8`` extension (:rfc:`6531`: Internationalized Email). If the client specified ``SMTPUTF8 BODY=8BITMIME`` on the ``MAIL`` command, they are passed to :meth:`!SMTPServer.process_message` via the *mail_options* keyword. It is the responsibility of the ``process_message`` method to correctly handle the ``SMTPUTF8`` data. (Contributed by Milan Oberkirch in :issue:`21725`.)
pt_pt: A classe :class:`!SMTPServer` agora também suporta a extensão ``SMTPUTF8`` (:rfc:`6531`: Email Internacionalizado). Se o cliente especificar ``SMTPUTF8 BODY=8BITMIME`` no comando ``MAIL``, são passados para :meth:`!SMTPServer.process_message` através da palavra-chave *mail_options*. É responsabilidade do método ``process_message`` tratar corretamente os dados ``SMTPUTF8``. (Contribuído por Milan Oberkirch em :issue:`21725`.)
sv: Klassen :class:`!SMTPServer` stöder nu även tillägget ``SMTPUTF8`` (:rfc:`6531`: Internationalized Email). Om klienten specificerade ``SMTPUTF8 BODY=8BITMIME`` på kommandot ``MAIL``, skickas de till :meth:`!SMTPServer.process_message` via nyckelordet *mail_options*. Det är metoden ``process_message`` ansvar att korrekt hantera ``SMTPUTF8`` data. (Bidrag från Milan Oberkirch i :issue:`21725`.)

source: It is now possible to provide, directly or via name resolution, IPv6 addresses in the :class:`!SMTPServer` constructor, and have it successfully connect. (Contributed by Milan Oberkirch in :issue:`14758`.)
pt_pt: Agora é possível fornecer, diretamente ou através de resolução de nome, endereços IPv6 no construtor :class:`!SMTPServer` e conectar com sucesso. (Contribuído por Milan Oberkirch em :issue:`14758`.)
sv: Det är nu möjligt att, direkt eller via namnupplösning, ange IPv6-adresser i :class:`!SMTPServer`\-konstruktören och få den att ansluta framgångsrikt. (Bidrag från Milan Oberkirch i :issue:`14758`.)

source: A new :meth:`SMTP.auth() <smtplib.SMTP.auth>` method provides a convenient way to implement custom authentication mechanisms. (Contributed by Milan Oberkirch in :issue:`15014`.)
pt_pt: Um novo método :meth:`SMTP.auth() <smtplib.SMTP.auth>` fornece uma forma conveniente de implementar mecanismos de autenticação personalizados. (Contribuído por Milan Oberkirch em :issue:`15014`.)
ru: Новый метод :meth:`SMTP.auth() <smtplib.SMTP.auth>` предоставляет удобный способ реализации пользовательских механизмов аутентификации. (Предоставлено Миланом Оберкирхом в :issue:`15014`.)
sv: En ny :meth:`SMTP.auth() <smtplib.SMTP.auth>`\-metod ger ett bekvämt sätt att implementera anpassade autentiseringsmekanismer. (Bidrag från Milan Oberkirch i :issue:`15014`.)

source: The :meth:`SMTP.set_debuglevel() <smtplib.SMTP.set_debuglevel>` method now accepts an additional debuglevel (2), which enables timestamps in debug messages. (Contributed by Gavin Chappell and Maciej Szulik in :issue:`16914`.)
pt_pt: O método :meth:`SMTP.set_debuglevel() <smtplib.SMTP.set_debuglevel>` agora aceita um nível de depuração adicional (2), que ativa carimbos de data/hora nas mensagens de depuração. (Contribuído por Gavin Chappell e Maciej Szulik em :issue:`16914`.)
ru: Метод :meth:`SMTP.set_debuglevel() <smtplib.SMTP.set_debuglevel>` теперь принимает дополнительный уровень отладки (2), который включает метки времени в сообщениях отладки. (Предоставлено Гэвином Чаппеллом и Мацеем Шуликом в :issue:`16914`.)
sv: Metoden :meth:`SMTP.set_debuglevel() <smtplib.SMTP.set_debuglevel>` accepterar nu ytterligare en debug-nivå (2), vilket möjliggör tidsstämplar i debug-meddelanden. (Bidrag från Gavin Chappell och Maciej Szulik i :issue:`16914`.)

source: Both the :meth:`SMTP.sendmail() <smtplib.SMTP.sendmail>` and :meth:`SMTP.send_message() <smtplib.SMTP.send_message>` methods now support :rfc:`6531` (SMTPUTF8). (Contributed by Milan Oberkirch and R. David Murray in :issue:`22027`.)
pt_pt: Tanto o método :meth:`SMTP.sendmail() <smtplib.SMTP.sendmail>` como o método :meth:`SMTP.send_message() <smtplib.SMTP.send_message>` agora suportam :rfc:`6531` (SMTPUTF8). (Contribuído por Milan Oberkirch e R. David Murray em :issue:`22027`.)
ru: Оба метода :meth:`SMTP.sendmail() <smtplib.SMTP.sendmail>` и :meth:`SMTP.send_message() <smtplib.SMTP.send_message>` теперь поддерживают :rfc:`6531` (SMTPUTF8). (Предоставлено Миланом Оберкирхом и Р. Дэвидом Мюрреем в :issue:`22027`.)
sv: Både metoderna :meth:`SMTP.sendmail() <smtplib.SMTP.sendmail>` och :meth:`SMTP.send_message() <smtplib.SMTP.send_message>` stöder nu :rfc:`6531` (SMTPUTF8). (Bidrag från Milan Oberkirch och R. David Murray i :issue:`22027`.)

source: The :func:`!what` and :func:`!whathdr` functions now return a :func:`~collections.namedtuple`. (Contributed by Claudiu Popa in :issue:`18615`.)
pt_pt: As funções :func:`!what` e :func:`!whathdr` agora devolvem um :func:`~collections.namedtuple`. (Contribuído por Claudiu Popa em :issue:`18615`.)
sv: Funktionerna :func:`!what` och :func:`!whathdr` returnerar nu en :func:`~collections.namedtuple`. (Bidrag från Claudiu Popa i :issue:`18615`.)

source: Functions with timeouts now use a monotonic clock, instead of a system clock. (Contributed by Victor Stinner in :issue:`22043`.)
pt_pt: Funções com *timeouts* agora usam um relógio monótono, em vez de um relógio do sistema. (Contribuído por Victor Stinner em :issue:`22043`.)
ru: Функции с таймаутами теперь используют монотонные часы вместо системных часов. (Предоставлено Виктором Стиннером в :issue:`22043`.)
sv: Funktioner med timeouts använder nu en monoton klocka istället för en systemklocka. (Bidrag från Victor Stinner i :issue:`22043`.)

source: A new :meth:`socket.sendfile() <socket.socket.sendfile>` method allows sending a file over a socket by using the high-performance :func:`os.sendfile` function on UNIX, resulting in uploads being from 2 to 3 times faster than when using plain :meth:`socket.send() <socket.socket.send>`. (Contributed by Giampaolo Rodola' in :issue:`17552`.)
pt_pt: Um novo método :meth:`socket.sendfile() <socket.socket.sendfile>` permite enviar um ficheiro através de um *socket* usando a função de alto desempenho :func:`os.sendfile` no UNIX, resultando em *uploads* 2 a 3 vezes mais rápidos do que quando se usa :meth:`socket.send() <socket.socket.send>`. (Contribuído por Giampaolo Rodola' em :issue:`17552`.)
ru: Новый метод :meth:`socket.sendfile() <socket.socket.sendfile>` позволяет отправлять файл через сокет с помощью высокопроизводительной функции :func:`os.sendfile` в UNIX, в результате чего загрузка осуществляется из В 2–3 раза быстрее, чем при использовании обычного :meth:`socket.send() <socket.socket.send>`. (Предоставлено Джампаоло Родолой в :issue:`17552`.)
sv: En ny :meth:`socket.sendfile() <socket.socket.sendfile>`\-metod gör det möjligt att skicka en fil över en socket med hjälp av den högpresterande :func:`os.sendfile`\-funktionen på UNIX, vilket resulterar i att uppladdningar blir 2 till 3 gånger snabbare än när man använder vanlig :meth:`socket.send() <socket.socket.send>`. (Bidrag från Giampaolo Rodola' i :issue:`17552`.)

source: The :meth:`socket.sendall() <socket.socket.sendall>` method no longer resets the socket timeout every time bytes are received or sent. The socket timeout is now the maximum total duration to send all data. (Contributed by Victor Stinner in :issue:`23853`.)
pt_pt: O método :meth:`socket.sendall() <socket.socket.sendall>` já não redefine o *timeout* do *socket* sempre que os bytes são recebidos ou enviados. O *timeout* do *socket* é agora a duração total máxima para enviar todos os dados. (Contribuído por Victor Stinner em :issue:`23853`.)
ru: Метод :meth:`socket.sendall() <socket.socket.sendall>` больше не сбрасывает таймаут сокета каждый раз, когда принимаются или отправляются байты. Тайм-аут сокета теперь равен максимальной общей продолжительности отправки всех данных. (Предоставлено Виктором Стиннером в :issue:`23853`.)
sv: Metoden :meth:`socket.sendall() <socket.socket.sendall>` återställer inte längre timeouten för uttaget varje gång byte tas emot eller skickas. Socket timeout är nu den maximala totala tiden det tar att skicka all data. (Bidrag från Victor Stinner i :issue:`23853`.)

source: The *backlog* argument of the :meth:`socket.listen() <socket.socket.listen>` method is now optional. By default it is set to :data:`SOMAXCONN <socket.SOMAXCONN>` or to ``128``, whichever is less. (Contributed by Charles-François Natali in :issue:`21455`.)
pt_pt: O argumento *backlog* do método :meth:`socket.listen() <socket.socket.listen>` agora é opcional. Por predefinição, é definido para :data:`SOMAXCONN <socket.SOMAXCONN>` ou para ``128``, o que for menor. (Contribuído por Charles-François Natali em :issue:`21455`.)
ru: Аргумент *backlog* метода :meth:`socket.listen() <socket.socket.listen>` теперь является необязательным. По умолчанию для него установлено значение :data:`SOMAXCONN <socket.SOMAXCONN>` или ``128``, в зависимости от того, какое значение меньше. (Предоставлено Шарлем-Франсуа Натали в :issue:`21455`.)
sv: Argumentet *backlog* i metoden :meth:`socket.listen() <socket.socket.listen>` är nu valfritt. Som standard är det satt till :data:`SOMAXCONN <socket.SOMAXCONN>` eller till ``128``, beroende på vilket som är minst. (Bidrag från Charles-François Natali i :issue:`21455`.)

source: Memory BIO Support
pt_pt: Suporte para Memory BIO
ru: Поддержка памяти BIO
sv: Stöd för BIO-minne

source: (Contributed by Geert Jansen in :issue:`21965`.)
pt_pt: (Contribuído por Geert Jansen em :issue:`21965`.)
ru: (Предоставлено Гертом Янсеном в :issue:`21965`.)
sv: (Bidrag från Geert Jansen i :issue:`21965`.)

source: The new :class:`~ssl.SSLObject` class has been added to provide SSL protocol support for cases when the network I/O capabilities of :class:`~ssl.SSLSocket` are not necessary or are suboptimal. ``SSLObject`` represents an SSL protocol instance, but does not implement any network I/O methods, and instead provides a memory buffer interface. The new :class:`~ssl.MemoryBIO` class can be used to pass data between Python and an SSL protocol instance.
pt_pt: A nova classe :class:`~ssl.SSLObject` foi adicionada para fornecer suporte ao protocolo SSL para casos em que as capacidades de E/S de rede de :class:`~ssl.SSLSocket` não são necessárias ou são subótimas. ``SSLObject`` representa uma instância do protocolo SSL, mas não implementa quaisquer métodos de E/S de rede, e em vez disso fornece uma interface de *buffer* de memória. A nova classe :class:`~ssl.MemoryBIO` pode ser usada para passar dados entre Python e uma instância do protocolo SSL.
ru: Новый класс :class:`~ssl.SSLObject` был добавлен для обеспечения поддержки протокола SSL в случаях, когда возможности сетевого ввода-вывода :class:`~ssl.SSLSocket` не нужны или неоптимальны. ``SSLObject`` представляет собой экземпляр протокола SSL, но не реализует никаких сетевых методов ввода-вывода, а вместо этого предоставляет интерфейс буфера памяти. Новый класс :class:`~ssl.MemoryBIO` можно использовать для передачи данных между Python и экземпляром протокола SSL.
sv: Den nya klassen :class:`~ssl.SSLObject` har lagts till för att ge stöd för SSL-protokoll i de fall då nätverks-I/O-funktionerna i :class:`~ssl.SSLSocket` inte är nödvändiga eller inte är optimala. ``SSLObject`` representerar en SSL-protokollinstans, men implementerar inte några nätverks-I/O-metoder utan tillhandahåller istället ett minnesbuffertgränssnitt. Den nya :class:`~ssl.MemoryBIO`\-klassen kan användas för att skicka data mellan Python och en SSL-protokollinstans.

source: The memory BIO SSL support is primarily intended to be used in frameworks implementing asynchronous I/O for which :class:`~ssl.SSLSocket`'s readiness model ("select/poll") is inefficient.
pt_pt: O suporte para SSL Memory BIO é principalmente destinado a ser usado em *frameworks* que implementam E/S assíncrona para os quais o modelo de prontidão de :class:`~ssl.SSLSocket` ("select/poll") é ineficiente.
ru: Поддержка BIO SSL в памяти в первую очередь предназначена для использования в средах, реализующих асинхронный ввод-вывод, для которых модель готовности :class:`~ssl.SSLSocket` («выбор/опрос») неэффективна.
sv: BIO SSL-stödet för minne är främst avsett att användas i ramverk som implementerar asynkron I/O för vilka :class:`~ssl.SSLSocket` beredskapsmodell ("select/poll") är ineffektiv.

source: A new :meth:`SSLContext.wrap_bio() <ssl.SSLContext.wrap_bio>` method can be used to create a new ``SSLObject`` instance.
pt_pt: Um novo método :meth:`SSLContext.wrap_bio() <ssl.SSLContext.wrap_bio>` pode ser usado para criar uma nova instância ``SSLObject``.
ru: Новый метод :meth:`SSLContext.wrap_bio() <ssl.SSLContext.wrap_bio>` можно использовать для создания нового экземпляра ``SSLObject``.
sv: En ny :meth:`SSLContext.wrap_bio() <ssl.SSLContext.wrap_bio>`\-metod kan användas för att skapa en ny ``SSLObject``\-instans.

source: Application-Layer Protocol Negotiation Support
pt_pt: Suporte para Negociação de Protocolo de Camada de Aplicação
ru: Поддержка согласования протоколов уровня приложений
sv: Stöd för förhandling av protokoll i applikationslager

source: (Contributed by Benjamin Peterson in :issue:`20188`.)
pt_pt: (Contribuído por Benjamin Peterson em :issue:`20188`.)
ru: (Предоставлено Бенджамином Петерсоном в :issue:`20188`.)
sv: (Bidrag från Benjamin Peterson i :issue:`20188`.)

source: Where OpenSSL support is present, the :mod:`ssl` module now implements the *Application-Layer Protocol Negotiation* TLS extension as described in :rfc:`7301`.
pt_pt: Onde o suporte OpenSSL está presente, o módulo :mod:`ssl` agora implementa a extensão TLS *Application-Layer Protocol Negotiation* como descrito em :rfc:`7301`.
ru: Там, где присутствует поддержка OpenSSL, модуль :mod:`ssl` теперь реализует расширение TLS *Application-Layer Protocol Negotiation*, как описано в :rfc:`7301`.
sv: Där OpenSSL-stöd finns, implementerar modulen :mod:`ssl` nu TLS-tillägget *Application-Layer Protocol Negotiation* enligt beskrivningen i :rfc:`7301`.

source: The new :meth:`SSLContext.set_alpn_protocols() <ssl.SSLContext.set_alpn_protocols>` can be used to specify which protocols a socket should advertise during the TLS handshake.
pt_pt: O novo método :meth:`SSLContext.set_alpn_protocols() <ssl.SSLContext.set_alpn_protocols>` pode ser usado para especificar quais protocolos um *socket* deve anunciar durante o *handshake* TLS.
ru: Новый :meth:`SSLContext.set_alpn_protocols() <ssl.SSLContext.set_alpn_protocols>` можно использовать для указания того, какие протоколы сокет должен объявлять во время установления связи TLS.
sv: Den nya :meth:`SSLContext.set_alpn_protocols() <ssl.SSLContext.set_alpn_protocols>` kan användas för att ange vilka protokoll ett uttag ska annonsera under TLS-handskakningen.

source: The new :meth:`SSLSocket.selected_alpn_protocol() <ssl.SSLSocket.selected_alpn_protocol>` returns the protocol that was selected during the TLS handshake. The :const:`~ssl.HAS_ALPN` flag indicates whether ALPN support is present.
pt_pt: O novo método :meth:`SSLSocket.selected_alpn_protocol() <ssl.SSLSocket.selected_alpn_protocol>` devolve o protocolo que foi selecionado durante o *handshake* TLS. A flag :const:`~ssl.HAS_ALPN` indica se o suporte ALPN está presente.
ru: Новый :meth:`SSLSocket.selected_alpn_protocol() <ssl.SSLSocket.selected_alpn_protocol>` возвращает протокол, который был выбран во время установления связи TLS. Флаг :const:`~ssl.HAS_ALPN` указывает, присутствует ли поддержка ALPN.
sv: Den nya :meth:`SSLSocket.selected_alpn_protocol() <ssl.SSLSocket.selected_alpn_protocol>` returnerar det protokoll som valdes under TLS-handskakningen. Flaggan :const:`~ssl.HAS_ALPN` anger om ALPN-stöd finns.

source: Other Changes
pt_pt: Outras Alterações
ru: Другие изменения
sv: Övriga förändringar

source: There is a new :meth:`SSLSocket.version() <ssl.SSLSocket.version>` method to query the actual protocol version in use. (Contributed by Antoine Pitrou in :issue:`20421`.)
pt_pt: Existe um novo método :meth:`SSLSocket.version() <ssl.SSLSocket.version>` para consultar a versão do protocolo em uso. (Contribuído por Antoine Pitrou em :issue:`20421`.)
ru: Появился новый метод :meth:`SSLSocket.version() <ssl.SSLSocket.version>` для запроса фактической используемой версии протокола. (Предоставлено Антуаном Питру в :issue:`20421`.)
sv: Det finns en ny :meth:`SSLSocket.version() <ssl.SSLSocket.version>`\-metod för att fråga den faktiska protokollversionen som används. (Bidrag från Antoine Pitrou i :issue:`20421`.)

source: The :class:`~ssl.SSLSocket` class now implements a :meth:`!SSLSocket.sendfile` method. (Contributed by Giampaolo Rodola' in :issue:`17552`.)
pt_pt: A classe :class:`~ssl.SSLSocket` agora implementa um método :meth:`!SSLSocket.sendfile`. (Contribuído por Giampaolo Rodola' em :issue:`17552`.)

source: The :meth:`!SSLSocket.send` method now raises either the :exc:`ssl.SSLWantReadError` or :exc:`ssl.SSLWantWriteError` exception on a non-blocking socket if the operation would block. Previously, it would return ``0``. (Contributed by Nikolaus Rath in :issue:`20951`.)
pt_pt: O método :meth:`!SSLSocket.send` agora lança a exceção :exc:`ssl.SSLWantReadError` ou :exc:`ssl.SSLWantWriteError` num *socket* não bloqueante se a operação bloqueasse. Anteriormente, devolvia ``0``. (Contribuído por Nikolaus Rath em :issue:`20951`.)

source: The :func:`~ssl.cert_time_to_seconds` function now interprets the input time as UTC and not as local time, per :rfc:`5280`. Additionally, the return value is always an :class:`int`. (Contributed by Akira Li in :issue:`19940`.)
pt_pt: A função :func:`~ssl.cert_time_to_seconds` agora interpreta o tempo de entrada como UTC e não como hora local, de acordo com :rfc:`5280`. Além disso, o valor de retorno é sempre um :class:`int`. (Contribuído por Akira Li em :issue:`19940`.)
ru: Функция :func:`~ssl.cert_time_to_секундs` теперь интерпретирует входное время как время в формате UTC, а не как местное время, согласно :rfc:`5280`. Кроме того, возвращаемым значением всегда является :class:`int`. (Предоставлено Акирой Ли в :issue:`19940`.)
sv: Funktionen :func:`~ssl.cert_time_to_seconds` tolkar nu inmatad tid som UTC och inte som lokal tid, enligt :rfc:`5280`. Dessutom är returvärdet alltid en :class:`int`. (Bidrag från Akira Li i :issue:`19940`.)

source: New :meth:`!SSLObject.shared_ciphers` and :meth:`SSLSocket.shared_ciphers() <ssl.SSLSocket.shared_ciphers>` methods return the list of ciphers sent by the client during the handshake. (Contributed by Benjamin Peterson in :issue:`23186`.)
pt_pt: Novos métodos :meth:`!SSLObject.shared_ciphers` e :meth:`SSLSocket.shared_ciphers() <ssl.SSLSocket.shared_ciphers>` devolvem a lista de cifras enviadas pelo cliente durante o *handshake*. (Contribuído por Benjamin Peterson em :issue:`23186`.)

source: The :meth:`SSLSocket.do_handshake() <ssl.SSLSocket.do_handshake>`, :meth:`SSLSocket.read() <ssl.SSLSocket.read>`, :meth:`!SSLSocket.shutdown`, and :meth:`SSLSocket.write() <ssl.SSLSocket.write>` methods of the :class:`~ssl.SSLSocket` class no longer reset the socket timeout every time bytes are received or sent. The socket timeout is now the maximum total duration of the method. (Contributed by Victor Stinner in :issue:`23853`.)
pt_pt: Os métodos :meth:`SSLSocket.do_handshake() <ssl.SSLSocket.do_handshake>`, :meth:`SSLSocket.read() <ssl.SSLSocket.read>`, :meth:`!SSLSocket.shutdown` e :meth:`SSLSocket.write() <ssl.SSLSocket.write>` da classe :class:`~ssl.SSLSocket` já não redefinem o *timeout* do *socket* sempre que os bytes são recebidos ou enviados. O *timeout* do *socket* é agora a duração total máxima do método. (Contribuído por Victor Stinner em :issue:`23853`.)

source: The :func:`!match_hostname` function now supports matching of IP addresses. (Contributed by Antoine Pitrou in :issue:`23239`.)
pt_pt: A função :func:`!match_hostname` agora suporta a correspondência de endereços IP. (Contribuído por Antoine Pitrou em :issue:`23239`.)

source: The :class:`~sqlite3.Row` class now fully supports the sequence protocol, in particular :func:`reversed` iteration and slice indexing. (Contributed by Claudiu Popa in :issue:`10203`; by Lucas Sinclair, Jessica McKellar, and Serhiy Storchaka in :issue:`13583`.)
pt_pt: A classe :class:`~sqlite3.Row` agora suporta totalmente o protocolo de sequência, em particular a iteração :func:`reversed` e a indexação por *slice*. (Contribuído por Claudiu Popa em :issue:`10203`; por Lucas Sinclair, Jessica McKellar e Serhiy Storchaka em :issue:`13583`.)
ru: Класс :class:`~sqlite3.Row` теперь полностью поддерживает протокол последовательности, в частности :func:`reversed` итерацию и индексацию срезов. (Предоставлено Клаудиу Попа в :issue:`10203`; Лукасом Синклером, Джессикой МакКеллар и Сергеем Сторчакой в ​​:issue:`13583`.)
sv: Klassen :class:`~sqlite3.Row` har nu fullt stöd för sekvensprotokollet, i synnerhet :func:`reversed` iteration och slice-indexering. (Bidrag från Claudiu Popa i :issue:`10203`; av Lucas Sinclair, Jessica McKellar och Serhiy Storchaka i :issue:`13583`.)

source: subprocess
pt_pt: subprocesso
sv: delprocess

source: The new :func:`~subprocess.run` function has been added. It runs the specified command and returns a :class:`~subprocess.CompletedProcess` object, which describes a finished process. The new API is more consistent and is the recommended approach to invoking subprocesses in Python code that does not need to maintain compatibility with earlier Python versions. (Contributed by Thomas Kluyver in :issue:`23342`.)
pt_pt: A nova função :func:`~subprocess.run` foi adicionada. Executa o comando especificado e devolve um objeto :class:`~subprocess.CompletedProcess`, que descreve um processo terminado. A nova API é mais consistente e é a abordagem recomendada para invocar subprocessos em código Python que não precisa de manter compatibilidade com versões anteriores do Python. (Contribuído por Thomas Kluyver em :issue:`23342`.)
ru: Добавлена ​​новая функция :func:`~subprocess.run`. Он запускает указанную команду и возвращает объект :class:`~subprocess.CompletedProcess`, который описывает завершенный процесс. Новый API более последователен и является рекомендуемым подходом к вызову подпроцессов в коде Python, который не требует обеспечения совместимости с более ранними версиями Python. (Предоставлено Томасом Клюйвером в :issue:`23342`.)
sv: Den nya funktionen :func:`~subprocess.run` har lagts till. Den kör det angivna kommandot och returnerar ett :class:`~subprocess.CompletedProcess`\-objekt, som beskriver en avslutad process. Det nya API:et är mer konsekvent och är det rekommenderade tillvägagångssättet för att anropa subprocesser i Python-kod som inte behöver upprätthålla kompatibilitet med tidigare Python-versioner. (Bidrag från Thomas Kluyver i :issue:`23342`.)

source: >>> subprocess.run(["ls", "-l"]) # doesn't capture output CompletedProcess(args=['ls', '-l'], returncode=0) >>> subprocess.run("exit 1", shell=True, check=True) Traceback (most recent call last): ... subprocess.CalledProcessError: Command 'exit 1' returned non-zero exit status 1 >>> subprocess.run(["ls", "-l", "/dev/null"], stdout=subprocess.PIPE) CompletedProcess(args=['ls', '-l', '/dev/null'], returncode=0, stdout=b'crw-rw-rw- 1 root root 1, 3 Jan 23 16:23 /dev/null\n')
pt_pt: >>> subprocess.run(["ls", "-l"]) # não captura a saída CompletedProcess(args=['ls', '-l'], returncode=0) >>> subprocess.run("exit 1", shell=True, check=True) Traceback (most recent call last): File "<stdin>", line 1, in <module> subprocess.CalledProcessError: O comando 'exit 1' devolveu estado de saída não nulo 1 >>> subprocess.run(["ls", "-l", "/dev/null"], stdout=subprocess.PIPE) CompletedProcess(args=['ls', '-l', '/dev/null'], returncode=0, stdout=b'crw-rw-rw- 1 root root 1, 3 Jan 23 16:23 /dev/null\n')
