Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: On Windows, a new :attr:`stat_result.st_file_attributes <os.stat_result.st_file_attributes>` attribute is now available. It corresponds to the ``dwFileAttributes`` member of the ``BY_HANDLE_FILE_INFORMATION`` structure returned by ``GetFileInformationByHandle()``. (Contributed by Ben Hoyt in :issue:`21719`.)
pt_pt: No Windows, um novo atributo :attr:`stat_result.st_file_attributes <os.stat_result.st_file_attributes>` está agora disponível. Corresponde ao membro ``dwFileAttributes`` da estrutura ``BY_HANDLE_FILE_INFORMATION`` devolvida por ``GetFileInformationByHandle()``. (Contribuído por Ben Hoyt em :issue:`21719`.)
ru: В Windows теперь доступен новый атрибут :attr:`stat_result.st_file_attributes <os.stat_result.st_file_attributes>`. Он соответствует члену dwFileAttributes структуры BY_HANDLE_FILE_INFORMATION, возвращаемой функцией GetFileInformationByHandle(). (Предоставлено Беном Хойтом в :issue:`21719`.)
sv: I Windows finns nu ett nytt attribut :attr:`stat_result.st_file_attributes <os.stat_result.st_file_attributes>`. Det motsvarar medlemmen ``dwFileAttributes`` i strukturen ``BY_HANDLE_FILE_INFORMATION`` som returneras av ``GetFileInformationByHandle()``. (Bidrag från Ben Hoyt i :issue:`21719`.)

source: The :func:`~os.urandom` function now uses the ``getrandom()`` syscall on Linux 3.17 or newer, and ``getentropy()`` on OpenBSD 5.6 and newer, removing the need to use ``/dev/urandom`` and avoiding failures due to potential file descriptor exhaustion. (Contributed by Victor Stinner in :issue:`22181`.)
pt_pt: A função :func:`~os.urandom` agora usa a chamada de sistema ``getrandom()`` no Linux 3.17 ou mais recente, e ``getentropy()`` no OpenBSD 5.6 e mais recente, eliminando a necessidade de usar ``/dev/urandom`` e evitando falhas devido à potencial exaustão de descritores de ficheiro. (Contribuído por Victor Stinner em :issue:`22181`.)
ru: Функция :func:`~os.urandom` теперь использует системный вызов ``getrandom()`` в Linux 3.17 или новее и ``getentropy()`` в OpenBSD 5.6 и новее, устраняя необходимость использования ``/ dev/urandom`` и избежать сбоев из-за потенциального исчерпания файлового дескриптора. (Предоставлено Виктором Стиннером в :issue:`22181`.)
sv: Funktionen :func:`~os.urandom` använder nu syscallen ``getrandom()`` på Linux 3.17 eller nyare och ``getentropy()`` på OpenBSD 5.6 eller nyare, vilket tar bort behovet av att använda ``/dev/urandom`` och undviker fel på grund av potentiell uttömning av filbeskrivare. (Bidrag från Victor Stinner i :issue:`22181`.)

source: New :func:`~os.get_blocking` and :func:`~os.set_blocking` functions allow getting and setting a file descriptor's blocking mode (:const:`~os.O_NONBLOCK`.) (Contributed by Victor Stinner in :issue:`22054`.)
pt_pt: Novas funções :func:`~os.get_blocking` e :func:`~os.set_blocking` permitem obter e definir o modo de bloqueio de um descritor de ficheiro (:const:`~os.O_NONBLOCK`.) (Contribuído por Victor Stinner em :issue:`22054`.)
ru: Новые функции :func:`~os.get_blocking` и :func:`~os.set_blocking` позволяют получать и устанавливать режим блокировки файлового дескриптора (:const:`~os.O_NONBLOCK`.) (Внесено Виктором Стиннером в :issue :`22054`.)
sv: Nya funktionerna :func:`~os.get_blocking` och :func:`~os.set_blocking` gör det möjligt att hämta och ställa in en filbeskrivares blockeringsläge (:const:`~os.O_NONBLOCK`.) (Bidrag från Victor Stinner i :issue:`22054`.)

source: The :func:`~os.truncate` and :func:`~os.ftruncate` functions are now supported on Windows. (Contributed by Steve Dower in :issue:`23668`.)
pt_pt: As funções :func:`~os.truncate` e :func:`~os.ftruncate` são agora suportadas no Windows. (Contribuído por Steve Dower em :issue:`23668`.)
ru: Функции :func:`~os.truncate` и :func:`~os.ftruncate` теперь поддерживаются в Windows. (Предоставлено Стивом Дауэром в :issue:`23668`.)
sv: Funktionerna :func:`~os.truncate` och :func:`~os.ftruncate` stöds nu i Windows. (Bidrag från Steve Dower i :issue:`23668`.)

source: There is a new :func:`os.path.commonpath` function returning the longest common sub-path of each passed pathname. Unlike the :func:`os.path.commonprefix` function, it always returns a valid path::
pt_pt: Existe uma nova função :func:`os.path.commonpath` que devolve o caminho subcomum mais longo de cada caminho passado. Ao contrário da função :func:`os.path.commonprefix`, sempre devolve um caminho válido::
ru: Появилась новая функция :func:`os.path.commonpath`, возвращающая самый длинный общий подпуть каждого переданного пути. В отличие от функции :func:`os.path.commonprefix`, она всегда возвращает действительный путь::
sv: Det finns en ny funktion :func:`os.path.commonpath` som returnerar den längsta gemensamma sub-sökvägen för varje passerat sökvägsnamn. Till skillnad från funktionen :func:`os.path.commonprefix` returnerar den alltid en giltig sökväg::

source: (Contributed by Rafik Draoui and Serhiy Storchaka in :issue:`10395`.)
pt_pt: (Contribuído por Rafik Draoui e Serhiy Storchaka em :issue:`10395`.)
ru: (Предоставлено Рафиком Драуи и Сергеем Сторчакой в ​​:issue:`10395`.)
sv: (Bidrag från Rafik Draoui och Serhiy Storchaka i :issue:`10395`.)

source: The new :meth:`Path.samefile() <pathlib.Path.samefile>` method can be used to check whether the path points to the same file as another path, which can be either another :class:`~pathlib.Path` object, or a string::
pt_pt: O novo método :meth:`Path.samefile() <pathlib.Path.samefile>` pode ser usado para verificar se o caminho aponta para o mesmo ficheiro que outro caminho, que pode ser outro objeto :class:`~pathlib.Path` ou uma *string*::
ru: Новый метод :meth:`Path.samefile() <pathlib.Path.samefile>` можно использовать для проверки того, указывает ли путь на тот же файл, что и другой путь, который может быть либо другим :class:`~pathlib.Path ` объект или строка::
sv: Den nya metoden :meth:`Path.samefile() <pathlib.Path.samefile>` kan användas för att kontrollera om sökvägen pekar på samma fil som en annan sökväg, som kan vara antingen ett annat :class:`~pathlib.Path`\-objekt eller en sträng::

source: (Contributed by Vajrasky Kok and Antoine Pitrou in :issue:`19775`.)
pt_pt: (Contribuído por Vajrasky Kok e Antoine Pitrou em :issue:`19775`.)
ru: (Предоставлено Ваджраски Коком и Антуаном Питру в :issue:`19775`.)
sv: (Bidrag från Vajrasky Kok och Antoine Pitrou i :issue:`19775`.)

source: The :meth:`Path.mkdir() <pathlib.Path.mkdir>` method now accepts a new optional *exist_ok* argument to match ``mkdir -p`` and :func:`os.makedirs` functionality. (Contributed by Berker Peksag in :issue:`21539`.)
pt_pt: O método :meth:`Path.mkdir() <pathlib.Path.mkdir>` agora aceita um novo argumento opcional *exist_ok* para corresponder à funcionalidade de ``mkdir -p`` e :func:`os.makedirs`. (Contribuído por Berker Peksag em :issue:`21539`.)
ru: Метод :meth:`Path.mkdir() <pathlib.Path.mkdir>` теперь принимает новый необязательный аргумент *exist_ok*, соответствующий функциональности ``mkdir -p`` и :func:`os.madeirs`. (Предоставлено Беркером Пексагом в :issue:`21539`.)
sv: Metoden :meth:`Path.mkdir() <pathlib.Path.mkdir>` accepterar nu ett nytt valfritt *exist_ok* argument för att matcha ``mkdir -p`` och :func:`os.makedirs` funktionalitet. (Bidrag från Berker Peksag i :issue:`21539`.)

source: There is a new :meth:`Path.expanduser() <pathlib.Path.expanduser>` method to expand ``~`` and ``~user`` prefixes. (Contributed by Serhiy Storchaka and Claudiu Popa in :issue:`19776`.)
pt_pt: Existe um novo método :meth:`Path.expanduser() <pathlib.Path.expanduser>` para expandir prefixos ``~`` e ``~user``. (Contribuído por Serhiy Storchaka e Claudiu Popa em :issue:`19776`.)
ru: Появился новый метод :meth:`Path.expanduser() <pathlib.Path.expanduser>` для расширения префиксов ``~`` и ``~user``. (Предоставлено Сергеем Сторчакой и Клаудиу Попа в :issue:`19776`.)
sv: Det finns en ny :meth:`Path.expanduser() <pathlib.Path.expanduser>`\-metod för att expandera prefixen ``~`` och ``~user``. (Bidrag från Serhiy Storchaka och Claudiu Popa i :issue:`19776`.)

source: A new :meth:`Path.home() <pathlib.Path.home>` class method can be used to get a :class:`~pathlib.Path` instance representing the user’s home directory. (Contributed by Victor Salgado and Mayank Tripathi in :issue:`19777`.)
pt_pt: Um novo método de classe :meth:`Path.home() <pathlib.Path.home>` pode ser usado para obter uma instância :class:`~pathlib.Path` que representa o diretório *home* do utilizador. (Contribuído por Victor Salgado e Mayank Tripathi em :issue:`19777`.)
ru: Новый метод класса :meth:`Path.home() <pathlib.Path.home>` можно использовать для получения экземпляра :class:`~pathlib.Path`, представляющего домашний каталог пользователя. (Предоставлено Виктором Сальгадо и Маянк Трипати в :issue:`19777`.)
sv: En ny :meth:`Path.home() <pathlib.Path.home>`\-klassmetod kan användas för att hämta en :class:`~pathlib.Path`\-instans som representerar användarens hemkatalog. (Bidrag från Victor Salgado och Mayank Tripathi i :issue:`19777`.)

source: New :meth:`Path.write_text() <pathlib.Path.write_text>`, :meth:`Path.read_text() <pathlib.Path.read_text>`, :meth:`Path.write_bytes() <pathlib.Path.write_bytes>`, :meth:`Path.read_bytes() <pathlib.Path.read_bytes>` methods to simplify read/write operations on files.
pt_pt: Novos métodos :meth:`Path.write_text() <pathlib.Path.write_text>`, :meth:`Path.read_text() <pathlib.Path.read_text>`, :meth:`Path.write_bytes() <pathlib.Path.write_bytes>`, :meth:`Path.read_bytes() <pathlib.Path.read_bytes>` para simplificar operações de leitura/escrita em ficheiros.
ru: Новые :meth:`Path.write_text() <pathlib.Path.write_text>`, :meth:`Path.read_text() <pathlib.Path.read_text>`, :meth:`Path.write_bytes() <pathlib.Path .write_bytes>`, :meth:`Path.read_bytes() <pathlib.Path.read_bytes>` методы для упрощения операций чтения/записи файлов.
sv: Nya metoder :meth:`Path.write_text() <pathlib.Path.write_text>`, :meth:`Path.read_text() <pathlib.Path.read_text>`, :meth:`Path.write_bytes() <pathlib.Path.write_bytes>`, :meth:`Path.read_bytes() <pathlib.Path.read_bytes>` för att förenkla läs- och skrivoperationer på filer.

source: The following code snippet will create or rewrite existing file ``~/spam42``::
pt_pt: O seguinte trecho de código criará ou reescreverá o ficheiro existente ``~/spam42``::
ru: Следующий фрагмент кода создаст или перезапишет существующий файл ``~/spam42``::
sv: Följande kodavsnitt kommer att skapa eller skriva om den befintliga filen ``~/spam42``::

source: (Contributed by Christopher Welborn in :issue:`20218`.)
pt_pt: (Contribuído por Christopher Welborn em :issue:`20218`.)
ru: (Предоставлено Кристофером Велборном в :issue:`20218`.)
sv: (Bidrag från Christopher Welborn i :issue:`20218`.)

source: Nested objects, such as unbound methods or nested classes, can now be pickled using :ref:`pickle protocols <pickle-protocols>` older than protocol version 4. Protocol version 4 already supports these cases. (Contributed by Serhiy Storchaka in :issue:`23611`.)
pt_pt: Objetos aninhados, como métodos não ligados ou classes aninhadas, agora podem ser serializados usando :ref:`protocolos pickle <pickle-protocols>` anteriores à versão 4 do protocolo. A versão 4 do protocolo já suporta estes casos. (Contribuído por Serhiy Storchaka em :issue:`23611`.)
ru: Вложенные объекты, такие как несвязанные методы или вложенные классы, теперь можно пиклировать с помощью :ref:`pickle протоколов <pickle-protocols>` старше версии протокола 4. Протокол версии 4 уже поддерживает эти случаи. (Предоставлено Сергеем Сторчакой в ​​:issue:`23611`.)
sv: Nästlade objekt, t.ex. obundna metoder eller nästlade klasser, kan nu betas med :ref:`pickle protocols <pickle-protocols>` som är äldre än protokollversion 4. Protokollversion 4 stöder redan dessa fall. (Bidrag från Serhiy Storchaka i :issue:`23611`.)

source: A new :meth:`POP3.utf8() <poplib.POP3.utf8>` command enables :rfc:`6856` (Internationalized Email) support, if a POP server supports it. (Contributed by Milan OberKirch in :issue:`21804`.)
pt_pt: Um novo comando :meth:`POP3.utf8() <poplib.POP3.utf8>` ativa o suporte para :rfc:`6856` (Email Internacionalizado), se um servidor POP o suportar. (Contribuído por Milan OberKirch em :issue:`21804`.)
ru: Новая команда :meth:`POP3.utf8() <poplib.POP3.utf8>` включает поддержку :rfc:`6856` (международная электронная почта), если POP-сервер поддерживает ее. (Предоставлено Миланом ОберКирхом в :issue:`21804`.)
sv: Ett nytt :meth:`POP3.utf8() <poplib.POP3.utf8>`\-kommando aktiverar :rfc:`6856`\-stöd (Internationaliserad e-post), om en POP-server stöder det. (Bidrag från Milan OberKirch i :issue:`21804`.)

source: References and conditional references to groups with fixed length are now allowed in lookbehind assertions::
pt_pt: Referências e referências condicionais a grupos com comprimento fixo são agora permitidas em afirmações de *lookbehind*::
ru: Ссылки и условные ссылки на группы фиксированной длины теперь разрешены в утверждениях просмотра назад:
sv: Referenser och villkorliga referenser till grupper med fast längd är nu tillåtna i lookbehind-assertions::

source: (Contributed by Serhiy Storchaka in :issue:`9179`.)
pt_pt: (Contribuído por Serhiy Storchaka em :issue:`9179`.)
ru: (Предоставлено Сергеем Сторчакой в ​​:issue:`9179`.)
sv: (Bidrag från Serhiy Storchaka i :issue:`9179`.)

source: The number of capturing groups in regular expressions is no longer limited to 100. (Contributed by Serhiy Storchaka in :issue:`22437`.)
pt_pt: O número de grupos de captura em expressões regulares já não está limitado a 100. (Contribuído por Serhiy Storchaka em :issue:`22437`.)
ru: Количество групп захвата в регулярных выражениях больше не ограничивается 100. (Размещено Сергеем Сторчакой в ​​:issue:`22437`.)
sv: Antalet fångande grupper i reguljära uttryck är inte längre begränsat till 100. (Bidrag från Serhiy Storchaka i :issue:`22437`.)

source: The :func:`~re.sub` and :func:`~re.subn` functions now replace unmatched groups with empty strings instead of raising an exception. (Contributed by Serhiy Storchaka in :issue:`1519638`.)
pt_pt: As funções :func:`~re.sub` e :func:`~re.subn` agora substituem grupos não correspondidos por *strings* vazias em vez de lançar uma exceção. (Contribuído por Serhiy Storchaka em :issue:`1519638`.)
ru: Функции :func:`~re.sub` и :func:`~re.subn` теперь заменяют несовпадающие группы пустыми строками вместо того, чтобы вызывать исключение. (Предоставлено Сергеем Сторчакой в ​​:issue:`1519638`.)
sv: Funktionerna :func:`~re.sub` och :func:`~re.subn` ersätter nu omatchade grupper med tomma strängar istället för att skapa ett undantag. (Bidrag från Serhiy Storchaka i :issue:`1519638`.)

source: The :class:`re.error <re.PatternError>` exceptions have new attributes, :attr:`~re.PatternError.msg`, :attr:`~re.PatternError.pattern`, :attr:`~re.PatternError.pos`, :attr:`~re.PatternError.lineno`, and :attr:`~re.PatternError.colno`, that provide better context information about the error::
pt_pt: As exceções :class:`re.error <re.PatternError>` têm novos atributos, :attr:`~re.PatternError.msg`, :attr:`~re.PatternError.pattern`, :attr:`~re.PatternError.pos`, :attr:`~re.PatternError.lineno` e :attr:`~re.PatternError.colno`, que fornecem melhor informação de contexto sobre o erro::

source: (Contributed by Serhiy Storchaka in :issue:`22578`.)
pt_pt: (Contribuído por Serhiy Storchaka em :issue:`22578`.)
ru: (Предоставлено Сергеем Сторчакой в ​​:issue:`22578`.)
sv: (Bidrag från Serhiy Storchaka i :issue:`22578`.)

source: A new :func:`~readline.append_history_file` function can be used to append the specified number of trailing elements in history to the given file. (Contributed by Bruno Cauet in :issue:`22940`.)
pt_pt: Uma nova função :func:`~readline.append_history_file` pode ser usada para anexar o número especificado de elementos finais no histórico ao ficheiro dado. (Contribuído por Bruno Cauet em :issue:`22940`.)
ru: Новую функцию :func:`~readline.append_history_file` можно использовать для добавления указанного количества конечных элементов истории в данный файл. (Предоставлено Бруно Коэ в :issue:`22940`.)
sv: En ny :func:`~readline.append_history_file`\-funktion kan användas för att lägga till det angivna antalet efterföljande element i historiken till den angivna filen. (Bidrag från Bruno Cauet i :issue:`22940`.)

source: The new :class:`~selectors.DevpollSelector` supports efficient ``/dev/poll`` polling on Solaris. (Contributed by Giampaolo Rodola' in :issue:`18931`.)
pt_pt: O novo :class:`~selectors.DevpollSelector` suporta sondagem eficiente de ``/dev/poll`` no Solaris. (Contribuído por Giampaolo Rodola' em :issue:`18931`.)
ru: Новый :class:`~selectors.DevpollSelector` поддерживает эффективный опрос ``/dev/poll`` в Solaris. (Предоставлено Джампаоло Родолой в :issue:`18931`.)
sv: Den nya :class:`~selectors.DevpollSelector` stöder effektiv ``/dev/poll`` polling på Solaris. (Bidrag från Giampaolo Rodola' i :issue:`18931`.)

source: The :func:`~shutil.move` function now accepts a *copy_function* argument, allowing, for example, the :func:`~shutil.copy` function to be used instead of the default :func:`~shutil.copy2` if there is a need to ignore file metadata when moving. (Contributed by Claudiu Popa in :issue:`19840`.)
pt_pt: A função :func:`~shutil.move` agora aceita um argumento *copy_function*, permitindo, por exemplo, que a função :func:`~shutil.copy` seja usada em vez da função predefinida :func:`~shutil.copy2` se houver necessidade de ignorar os metadados do ficheiro ao mover. (Contribuído por Claudiu Popa em :issue:`19840`.)
ru: Функция :func:`~shutil.move` теперь принимает аргумент *copy_function*, что позволяет, например, использовать функцию :func:`~shutil.copy` вместо стандартной :func:`~shutil.copy2. ` если есть необходимость игнорировать метаданные файла при перемещении. (Предоставлено Клаудиу Попа в :issue:`19840`.)
sv: Funktionen :func:`~shutil.move` accepterar nu ett *copy_function*-argument, vilket gör att t.ex. funktionen :func:`~shutil.copy` kan användas istället för standardfunktionen :func:`~shutil.copy2` om det finns ett behov av att ignorera filmetadata vid flyttning. (Bidrag från Claudiu Popa i :issue:`19840`.)

source: The :func:`~shutil.make_archive` function now supports the *xztar* format. (Contributed by Serhiy Storchaka in :issue:`5411`.)
pt_pt: A função :func:`~shutil.make_archive` agora suporta o formato *xztar*. (Contribuído por Serhiy Storchaka em :issue:`5411`.)
ru: Функция :func:`~shutil.make_archive` теперь поддерживает формат *xztar*. (Предоставлено Сергеем Сторчакой в ​​:issue:`5411`.)
sv: Funktionen :func:`~shutil.make_archive` har nu stöd för formatet *xztar*. (Bidrag från Serhiy Storchaka i :issue:`5411`.)

source: On Windows, the :func:`~signal.set_wakeup_fd` function now also supports socket handles. (Contributed by Victor Stinner in :issue:`22018`.)
pt_pt: No Windows, a função :func:`~signal.set_wakeup_fd` agora também suporta descritores de *socket*. (Contribuído por Victor Stinner em :issue:`22018`.)
ru: В Windows функция :func:`~signal.set_wakeup_fd` теперь также поддерживает дескрипторы сокетов. (Предоставлено Виктором Стиннером в :issue:`22018`.)
sv: I Windows har funktionen :func:`~signal.set_wakeup_fd` nu även stöd för socket-handtag. (Bidrag från Victor Stinner i :issue:`22018`.)

source: Various ``SIG*`` constants in the :mod:`signal` module have been converted into :mod:`Enums <enum>`. This allows meaningful names to be printed during debugging, instead of integer "magic numbers". (Contributed by Giampaolo Rodola' in :issue:`21076`.)
pt_pt: Várias constantes ``SIG*`` no módulo :mod:`signal` foram convertidas em :mod:`Enums <enum>`. Isto permite que nomes significativos sejam impressos durante a depuração, em vez de números inteiros "mágicos". (Contribuído por Giampaolo Rodola' em :issue:`21076`.)
ru: Различные константы ``SIG*`` в модуле :mod:`signal` были преобразованы в :mod:`Enums <enum>`. Это позволяет печатать осмысленные имена во время отладки вместо целых «магических чисел». (Предоставлено Джампаоло Родолой в :issue:`21076`.)
sv: Olika ``SIG*``\-konstanter i modulen :mod:`signal`` har konverterats till :mod:`Enums <enum>``. Detta gör att meningsfulla namn kan skrivas ut under felsökning, istället för heltal "magiska siffror". (Bidrag från Giampaolo Rodola' i :issue:`21076`.)

source: Both the :class:`!SMTPServer` and :class:`!SMTPChannel` classes now accept a *decode_data* keyword argument to determine if the ``DATA`` portion of the SMTP transaction is decoded using the ``"utf-8"`` codec or is instead provided to the :meth:`!SMTPServer.process_message` method as a byte string. The default is ``True`` for backward compatibility reasons, but will change to ``False`` in Python 3.6. If *decode_data* is set to ``False``, the ``process_message`` method must be prepared to accept keyword arguments. (Contributed by Maciej Szulik in :issue:`19662`.)
pt_pt: Tanto a classe :class:`!SMTPServer` como a classe :class:`!SMTPChannel` agora aceitam um argumento de palavra-chave *decode_data* para determinar se a parte ``DATA`` da transação SMTP é descodificada usando o *codec* ``"utf-8"`` ou se é fornecida ao método :meth:`!SMTPServer.process_message` como uma *string* de bytes. O valor predefinido é ``True`` por razões de compatibilidade retroativa, mas mudará para ``False`` no Python 3.6. Se *decode_data* for definido como ``False``, o método ``process_message`` deve estar preparado para aceitar argumentos de palavra-chave. (Contribuído por Maciej Szulik em :issue:`19662`.)
sv: Både klasserna :class:`!SMTPServer` och :class:`!SMTPChannel` accepterar nu ett *decode_data*\-nyckelordsargument för att avgöra om ``DATA``\-delen av SMTP-transaktionen avkodas med hjälp av ``"utf-8"``\-kodeken eller istället tillhandahålls till metoden :meth:`!SMTPServer.process_message` som en byte-sträng. Standardvärdet är ``True`` av bakåtkompatibilitetsskäl, men kommer att ändras till ``False`` i Python 3.6. Om *decode_data* är inställt på ``False`` måste metoden ``process_message`` vara förberedd för att acceptera nyckelordsargument. (Bidrag från Maciej Szulik i :issue:`19662`.)

source: The :class:`!SMTPServer` class now advertises the ``8BITMIME`` extension (:rfc:`6152`) if *decode_data* has been set ``True``. If the client specifies ``BODY=8BITMIME`` on the ``MAIL`` command, it is passed to :meth:`!SMTPServer.process_message` via the *mail_options* keyword. (Contributed by Milan Oberkirch and R. David Murray in :issue:`21795`.)
pt_pt: A classe :class:`!SMTPServer` agora anuncia a extensão ``8BITMIME`` (:rfc:`6152`) se *decode_data* estiver definido como ``True``. Se o cliente especificar ``BODY=8BITMIME`` no comando ``MAIL``, é passado para :meth:`!SMTPServer.process_message` através da palavra-chave *mail_options*. (Contribuído por Milan Oberkirch e R. David Murray em :issue:`21795`.)
sv: Klassen :class:`!SMTPServer` annonserar nu tillägget ``8BITMIME`` (:rfc:`6152`) om *decode_data* har satts till ``True``. Om klienten anger ``BODY=8BITMIME`` på kommandot ``MAIL``, skickas det till :meth:`!SMTPServer.process_message` via nyckelordet *mail_options*. (Bidrag från Milan Oberkirch och R. David Murray i :issue:`21795`.)
