Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: :pep:`475` implements automatic retry of system calls on ``EINTR``. This removes the burden of dealing with ``EINTR`` or :exc:`InterruptedError` in user code in most situations and makes Python programs, including the standard library, more robust. Note that the system call is only retried if the signal handler does not raise an exception.
pt_pt: A :pep:`475` implementa a repetição automática de chamadas de sistema em ``EINTR``. Isto remove o fardo de lidar com ``EINTR`` ou :exc:`InterruptedError` no código do utilizador na maioria das situações e torna os programas Python, incluindo a biblioteca padrão, mais robustos. Note que a chamada de sistema só é repetida se o gestor de sinal não lançar uma exceção.
ru: :pep:`475` реализует автоматический повтор системных вызовов ``EINTR``. Это устраняет необходимость работы с ``EINTR`` или :exc:`InterruptedError` в пользовательском коде в большинстве ситуаций и делает программы Python, включая стандартную библиотеку, более надежными. Обратите внимание, что системный вызов повторяется только в том случае, если обработчик сигнала не вызывает исключение.
sv: :pep:`475` implementerar automatisk omprövning av systemanrop vid ``EINTR``. Detta tar bort bördan av att hantera ``EINTR`` eller :exc:`InterruptedError` i användarkoden i de flesta situationer och gör Python-program, inklusive standardbiblioteket, mer robusta. Observera att systemanropet bara görs om om signalhanteraren inte ger upphov till ett undantag.

source: Below is a list of functions which are now retried when interrupted by a signal:
pt_pt: Em baixo está uma lista de funções que agora são repetidas quando interrompidas por um sinal:
ru: Ниже приведен список функций, которые теперь повторяются при прерывании сигналом:
sv: Nedan finns en lista över funktioner som nu prövas på nytt när de avbryts av en signal:

source: :func:`open` and :func:`io.open`;
pt_pt: :func:`open` e :func:`io.open`;
ru: :func:`open` и :func:`io.open`;
sv: :func:`open` och :func:`io.open`;

source: functions of the :mod:`faulthandler` module;
pt_pt: funções do módulo :mod:`faulthandler`;
ru: функции модуля :mod:`faulthandler`;
sv: funktioner i modulen :mod:`faulthandler`;

source: :mod:`os` functions: :func:`~os.fchdir`, :func:`~os.fchmod`, :func:`~os.fchown`, :func:`~os.fdatasync`, :func:`~os.fstat`, :func:`~os.fstatvfs`, :func:`~os.fsync`, :func:`~os.ftruncate`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.posix_fadvise`, :func:`~os.posix_fallocate`, :func:`~os.pread`, :func:`~os.pwrite`, :func:`~os.read`, :func:`~os.readv`, :func:`~os.sendfile`, :func:`~os.wait3`, :func:`~os.wait4`, :func:`~os.wait`, :func:`~os.waitid`, :func:`~os.waitpid`, :func:`~os.write`, :func:`~os.writev`;
pt_pt: funções do módulo :mod:`os`: :func:`~os.fchdir`, :func:`~os.fchmod`, :func:`~os.fchown`, :func:`~os.fdatasync`, :func:`~os.fstat`, :func:`~os.fstatvfs`, :func:`~os.fsync`, :func:`~os.ftruncate`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.posix_fadvise`, :func:`~os.posix_fallocate`, :func:`~os.pread`, :func:`~os.pwrite`, :func:`~os.read`, :func:`~os.readv`, :func:`~os.sendfile`, :func:`~os.wait3`, :func:`~os.wait4`, :func:`~os.wait`, :func:`~os.waitid`, :func:`~os.waitpid`, :func:`~os.write`, :func:`~os.writev`;
ru: :mod:`os` функции: :func:`~os.fchdir`, :func:`~os.fchmod`, :func:`~os.fchown`, :func:`~os.fdatasync`, :func :`~os.fstat`, :func:`~os.fstatvfs`, :func:`~os.fsync`, :func:`~os.ftruncate`, :func:`~os.mkfifo`, :func :`~os.mknod`, :func:`~os.open`, :func:`~os.posix_fadvise`, :func:`~os.posix_fallocate`, :func:`~os.pread`, :func :`~os.pwrite`, :func:`~os.read`, :func:`~os.readv`, :func:`~os.sendfile`, :func:`~os.wait3`, :func :`~os.wait4`, :func:`~os.wait`, :func:`~os.waitid`, :func:`~os.waitpid`, :func:`~os.write`, :func :`~os.writev`;

source: special cases: :func:`os.close` and :func:`os.dup2` now ignore :py:const:`~errno.EINTR` errors; the syscall is not retried (see the PEP for the rationale);
pt_pt: casos especiais: :func:`os.close` e :func:`os.dup2` agora ignoram erros :py:const:`~errno.EINTR`; a chamada de sistema não é repetida (consulte a PEP para a justificação);
ru: особые случаи: :func:`os.close` и :func:`os.dup2` теперь игнорируют ошибки :py:const:`~errno.EINTR`; системный вызов не повторяется (обоснование см. в PEP);
sv: specialfall: :func:`os.close` och :func:`os.dup2` ignorerar nu :py:const:`~errno.EINTR`\-fel; syscall-anropet försöker inte igen (se PEP för motivering);

source: :mod:`select` functions: :func:`devpoll.poll() <select.devpoll.poll>`, :func:`epoll.poll() <select.epoll.poll>`, :func:`kqueue.control() <select.kqueue.control>`, :func:`poll.poll() <select.poll.poll>`, :func:`~select.select`;
pt_pt: funções do módulo :mod:`select`: :func:`devpoll.poll() <select.devpoll.poll>`, :func:`epoll.poll() <select.epoll.poll>`, :func:`kqueue.control() <select.kqueue.control>`, :func:`poll.poll() <select.poll.poll>`, :func:`~select.select`;
ru: :mod:`select` функции: :func:`devpoll.poll() <select.devpoll.poll>`, :func:`epoll.poll() <select.epoll.poll>`, :func:`kqueue. control() <select.kqueue.control>`, :func:`poll.poll() <select.poll.poll>`, :func:`~select.select`;

source: methods of the :class:`~socket.socket` class: :meth:`~socket.socket.accept`, :meth:`~socket.socket.connect` (except for non-blocking sockets), :meth:`~socket.socket.recv`, :meth:`~socket.socket.recvfrom`, :meth:`~socket.socket.recvmsg`, :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall`, :meth:`~socket.socket.sendmsg`, :meth:`~socket.socket.sendto`;
pt_pt: métodos da classe :class:`~socket.socket`: :meth:`~socket.socket.accept`, :meth:`~socket.socket.connect` (exceto para *sockets* não bloqueantes), :meth:`~socket.socket.recv`, :meth:`~socket.socket.recvfrom`, :meth:`~socket.socket.recvmsg`, :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall`, :meth:`~socket.socket.sendmsg`, :meth:`~socket.socket.sendto`;
ru: методы класса :class:`~socket.socket`: :meth:`~socket.socket.accept`, :meth:`~socket.socket.connect` (кроме неблокирующих сокетов), :meth:` ~socket.socket.recv`, :meth:`~socket.socket.recvfrom`, :meth:`~socket.socket.recvmsg`, :meth:`~socket.socket.send`, :meth:`~socket .socket.sendall`, :meth:`~socket.socket.sendmsg`, :meth:`~socket.socket.sendto`;
sv: metoder för klassen :class:`~socket.socket`: :meth:`~socket.socket.accept`, :meth:`~socket.socket.connect` (utom för icke-blockerande uttag), :meth:`~socket.socket.recv`, :meth:`~socket.socket.recvfrom`, :meth:`~socket.socket.recvmsg`, :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall`, :meth:`~socket.socket.sendmsg`, :meth:`~socket.socket.sendto`;

source: :func:`signal.sigtimedwait` and :func:`signal.sigwaitinfo`;
pt_pt: :func:`signal.sigtimedwait` e :func:`signal.sigwaitinfo`;
ru: :func:`signal.sigtimedwait` и :func:`signal.sigwaitinfo`;
sv: :func:`signal.sigtimedwait` och :func:`signal.sigwaitinfo`;

source: :pep:`475` -- Retry system calls failing with EINTR
pt_pt: :pep:`475` — Repetir chamadas de sistema que falham com EINTR
ru: :pep:`475` -- Повторить неудачные системные вызовы с EINTR
sv: :pep:`475` -- Försök igen med systemanrop som misslyckas med EINTR

source: PEP and implementation written by Charles-François Natali and Victor Stinner, with the help of Antoine Pitrou (the French connection).
pt_pt: PEP e implementação escritas por Charles-François Natali e Victor Stinner, com a ajuda de Antoine Pitrou (a ligação francesa).
ru: PEP и реализация написаны Шарлем-Франсуа Натали и Виктором Стиннером при помощи Антуана Питру (связь с Францией).
sv: PEP och genomförandet skrevs av Charles-François Natali och Victor Stinner, med hjälp av Antoine Pitrou (den franska kopplingen).

source: PEP 479: Change StopIteration handling inside generators
pt_pt: PEP 479: Alterar o tratamento de StopIteration dentro de geradores
ru: PEP 479: изменение обработки StopIteration внутри генераторов
sv: PEP 479: Ändra StopIteration-hanteringen i generatorer

source: The interaction of generators and :exc:`StopIteration` in Python 3.4 and earlier was sometimes surprising, and could conceal obscure bugs. Previously, ``StopIteration`` raised accidentally inside a generator function was interpreted as the end of the iteration by the loop construct driving the generator.
pt_pt: A interação entre geradores e :exc:`StopIteration` no Python 3.4 e versões anteriores era por vezes surpreendente e podia ocultar erros obscuros. Anteriormente, uma exceção ``StopIteration`` lançada acidentalmente dentro de uma função geradora era interpretada como o fim da iteração pelo construto de ciclo que controlava o gerador.
ru: Взаимодействие генераторов и :exc:`StopIteration` в Python 3.4 и более ранних версиях иногда вызывало удивление и могло скрывать неясные ошибки. Раньше StopIteration, случайно вызываемый внутри функции-генератора, интерпретировался как конец итерации конструкцией цикла, управляющей генератором.
sv: Samspelet mellan generatorer och :exc:`StopIteration` i Python 3.4 och tidigare var ibland överraskande och kunde dölja obskyra buggar. Tidigare tolkades ``StopIteration`` som av misstag uppstod inuti en generatorfunktion som slutet på iterationen av den loopkonstruktion som driver generatorn.

source: :pep:`479` changes the behavior of generators: when a ``StopIteration`` exception is raised inside a generator, it is replaced with a :exc:`RuntimeError` before it exits the generator frame. The main goal of this change is to ease debugging in the situation where an unguarded :func:`next` call raises ``StopIteration`` and causes the iteration controlled by the generator to terminate silently. This is particularly pernicious in combination with the ``yield from`` construct.
pt_pt: A :pep:`479` altera o comportamento dos geradores: quando uma exceção ``StopIteration`` é lançada dentro de um gerador, é substituída por uma exceção :exc:`RuntimeError` antes de sair do *frame* do gerador. O principal objetivo desta alteração é facilitar a depuração em situações em que uma chamada não protegida a :func:`next` lança ``StopIteration`` e faz com que a iteração controlada pelo gerador termine silenciosamente. Isto é particularmente pernicioso em combinação com o construto ``yield from``.
ru: :pep:`479` изменяет поведение генераторов: когда внутри генератора возникает исключение ``StopIteration``, оно заменяется на :exc:`RuntimeError` перед выходом из кадра генератора. Основная цель этого изменения — облегчить отладку в ситуации, когда незащищенный вызов :func:`next` вызывает ``StopIteration`` и вызывает молчаливое завершение итерации, управляемой генератором. Это особенно губительно в сочетании с конструкцией «доходность от».
sv: :pep:`479` ändrar generatorernas beteende: när ett ``StopIteration``\ -undantag uppstår inuti en generator ersätts det med ett :exc:`RuntimeError` innan det lämnar generatorramen. Huvudsyftet med denna ändring är att underlätta felsökning i situationer där ett oskyddat :func:`next`\-anrop genererar ``StopIteration`` och orsakar att iterationen som styrs av generatorn avslutas utan meddelande. Detta är särskilt skadligt i kombination med konstruktionen ``yield from``.

source: This is a backwards incompatible change, so to enable the new behavior, a :term:`__future__` import is necessary::
pt_pt: Esta é uma alteração incompatível com versões anteriores, por isso, para ativar o novo comportamento, é necessária uma importação :term:`__future__`::
ru: Это обратно несовместимое изменение, поэтому для включения нового поведения необходим импорт :term:`__future__`::
sv: Detta är en bakåtkompatibel ändring, så för att aktivera det nya beteendet krävs en :term:`__future__`\-import::

source: Without a ``__future__`` import, a :exc:`PendingDeprecationWarning` will be raised whenever a :exc:`StopIteration` exception is raised inside a generator.
pt_pt: Sem uma importação ``__future__``, um aviso :exc:`PendingDeprecationWarning` será lançado sempre que uma exceção :exc:`StopIteration` for lançada dentro de um gerador.
ru: Без импорта ``__future__`` :exc:`PendingDeprecationWarning` будет вызываться всякий раз, когда внутри генератора возникает исключение :exc:`StopIteration`.
sv: Utan import av ``__future__`` kommer en :exc:`PendingDeprecationWarning`` att uppstå när ett :exc:`StopIteration``\-undantag uppstår i en generator.

source: :pep:`479` -- Change StopIteration handling inside generators
pt_pt: :pep:`479` — Alterar o tratamento de StopIteration dentro de geradores
ru: :pep:`479` -- Изменить обработку StopIteration внутри генераторов.
sv: :pep:`479` -- Ändra StopIteration-hanteringen i generatorer

source: PEP written by Chris Angelico and Guido van Rossum. Implemented by Chris Angelico, Yury Selivanov and Nick Coghlan.
pt_pt: PEP escrita por Chris Angelico e Guido van Rossum. Implementada por Chris Angelico, Yury Selivanov e Nick Coghlan.
ru: PEP, написанный Крисом Анджелико и Гвидо ван Россумом. Реализовано Крисом Анжелико, Юрием Селивановым и Ником Когланом.
sv: PEP skriven av Chris Angelico och Guido van Rossum. Implementerat av Chris Angelico, Yury Selivanov och Nick Coghlan.

source: PEP 485: A function for testing approximate equality
pt_pt: PEP 485: Uma função para testar igualdade aproximada
ru: PEP 485: функция для проверки приблизительного равенства.
sv: PEP 485: En funktion för att testa approximativ likhet

source: :pep:`485` adds the :func:`math.isclose` and :func:`cmath.isclose` functions which tell whether two values are approximately equal or "close" to each other. Whether or not two values are considered close is determined according to given absolute and relative tolerances. Relative tolerance is the maximum allowed difference between ``isclose`` arguments, relative to the larger absolute value::
pt_pt: A :pep:`485` adiciona as funções :func:`math.isclose` e :func:`cmath.isclose`, que indicam se dois valores são aproximadamente iguais ou "próximos" um do outro. Se dois valores são considerados próximos é determinado de acordo com tolerâncias absolutas e relativas dadas. A tolerância relativa é a diferença máxima permitida entre os argumentos de ``isclose``, relativa ao maior valor absoluto::
ru: :pep:`485` добавляет функции :func:`math.isclose` и :func:`cmath.isclose`, которые сообщают, являются ли два значения приблизительно равными или "близкими" друг к другу. Считаются ли два значения близкими или нет, определяется в соответствии с заданными абсолютными и относительными допусками. Относительный допуск — это максимально допустимая разница между аргументами ``isclose`` относительно большего абсолютного значения::
sv: :pep:`485` lägger till funktionerna :func:`math.isclose` och :func:`cmath.isclose` som anger om två värden är ungefär lika stora eller "nära" varandra. Huruvida två värden anses ligga nära varandra eller inte bestäms utifrån givna absoluta och relativa toleranser. Relativ tolerans är den maximalt tillåtna skillnaden mellan ``isclose``\-argument, i förhållande till det större absoluta värdet::

source: It is also possible to compare two values using absolute tolerance, which must be a non-negative value::
pt_pt: Também é possível comparar dois valores usando tolerância absoluta, que deve ser um valor não negativo::
ru: Также можно сравнить два значения, используя абсолютный допуск, который должен быть неотрицательным значением:
sv: Det är också möjligt att jämföra två värden med hjälp av absolut tolerans, som måste vara ett icke-negativt värde::

source: :pep:`485` -- A function for testing approximate equality
pt_pt: :pep:`485` — Uma função para testar igualdade aproximada
ru: :pep:`485` -- Функция для проверки приблизительного равенства
sv: :pep:`485` -- En funktion för att testa ungefärlig likhet

source: PEP written by Christopher Barker; implemented by Chris Barker and Tal Einat.
pt_pt: PEP escrita por Christopher Barker; implementada por Chris Barker e Tal Einat.
ru: PEP, написанный Кристофером Баркером; реализовано Крисом Баркером и Талом Эйнатом.
sv: PEP skriven av Christopher Barker; implementerad av Chris Barker och Tal Einat.

source: PEP 486: Make the Python Launcher aware of virtual environments
pt_pt: PEP 486: Tornar o Lançador do Python consciente de ambientes virtuais
ru: PEP 486: информируйте Python Launcher о виртуальных средах
sv: PEP 486: Gör Python Launcher medveten om virtuella miljöer

source: :pep:`486` makes the Windows launcher (see :pep:`397`) aware of an active virtual environment. When the default interpreter would be used and the ``VIRTUAL_ENV`` environment variable is set, the interpreter in the virtual environment will be used.
pt_pt: A :pep:`486` torna o lançador do Windows (consulte :pep:`397`) consciente de um ambiente virtual ativo. Quando o interpretador predefinido seria usado e a variável de ambiente ``VIRTUAL_ENV`` está definida, o interpretador no ambiente virtual será usado.
ru: :pep:`486` сообщает средству запуска Windows (см. :pep:`397`) об активной виртуальной среде. Если будет использоваться интерпретатор по умолчанию и установлена ​​переменная среды VIRTUAL_ENV, будет использоваться интерпретатор в виртуальной среде.
sv: :pep:`486` gör Windows-startprogrammet (se :pep:`397`) medvetet om en aktiv virtuell miljö. När standardtolken skulle användas och miljövariabeln ``VIRTUAL_ENV`` är satt, kommer tolken i den virtuella miljön att användas.

source: :pep:`486` -- Make the Python Launcher aware of virtual environments
pt_pt: :pep:`486` — Tornar o Lançador do Python consciente de ambientes virtuais
ru: :pep:`486` -- Включите в Python Launcher информацию о виртуальных средах.
sv: :pep:`486` -- Gör Python Launcher uppmärksam på virtuella miljöer

source: PEP written and implemented by Paul Moore.
pt_pt: PEP escrita e implementada por Paul Moore.
ru: PEP написан и реализован Полом Муром.
sv: PEP skrivet och implementerat av Paul Moore.

source: PEP 488: Elimination of PYO files
pt_pt: PEP 488: Eliminação de ficheiros PYO
ru: PEP 488: Удаление файлов PYO
sv: PEP 488: Eliminering av PYO-filer

source: :pep:`488` does away with the concept of ``.pyo`` files. This means that ``.pyc`` files represent both unoptimized and optimized bytecode. To prevent the need to constantly regenerate bytecode files, ``.pyc`` files now have an optional ``opt-`` tag in their name when the bytecode is optimized. This has the side-effect of no more bytecode file name clashes when running under either :option:`-O` or :option:`-OO`. Consequently, bytecode files generated from :option:`-O`, and :option:`-OO` may now exist simultaneously. :func:`importlib.util.cache_from_source` has an updated API to help with this change.
pt_pt: A :pep:`488` elimina o conceito de ficheiros ``.pyo``. Isto significa que os ficheiros ``.pyc`` representam tanto *bytecode* não otimizado como otimizado. Para evitar a necessidade de regenerar constantemente ficheiros de *bytecode*, os ficheiros ``.pyc`` têm agora uma etiqueta opcional ``opt-`` no nome quando o *bytecode* é otimizado. Isto tem o efeito colateral de não haver mais conflitos de nomes de ficheiros de *bytecode* ao executar com :option:`-O` ou :option:`-OO`. Consequentemente, os ficheiros de *bytecode* gerados a partir de :option:`-O` e :option:`-OO` podem agora existir simultaneamente. A função :func:`importlib.util.cache_from_source` tem uma API atualizada para ajudar com esta alteração.
ru: :pep:`488` покончит с концепцией файлов ``.pyo``. Это означает, что файлы ``.pyc`` представляют собой как неоптимизированный, так и оптимизированный байт-код. Чтобы предотвратить необходимость постоянной регенерации файлов байт-кода, файлы .pyc теперь имеют в своем имени дополнительный тег opt-, когда байт-код оптимизирован. Побочным эффектом этого является отсутствие конфликтов имен файлов байт-кода при работе с :option:`-O` или :option:`-OO`. Следовательно, файлы байт-кода, созданные с помощью :option:`-O` и :option:`-OO`, теперь могут существовать одновременно. :func:`importlib.util.cache_from_source` имеет обновленный API, который поможет с этим изменением.
sv: :pep:`488` avskaffar begreppet ``.pyo``\-filer. Detta innebär att ``.pyc``\-filer representerar både optimerad och icke-optimerad bytecode. För att undvika att bytecode-filer måste regenereras hela tiden har ``.pyc``\-filer nu en valfri ``opt-``\-tagg i namnet när bytecoden är optimerad. Detta har som bieffekt att det inte längre uppstår konflikter mellan bytecode-filnamn när man kör under antingen :option:`\-O` eller :option:`\-OO`. Följaktligen kan bytecode-filer som genererats från :option:`\-O` och :option:`\-OO` nu existera samtidigt. :func:`importlib.util.cache_from_source` har ett uppdaterat API för att underlätta denna förändring.

source: :pep:`488` -- Elimination of PYO files
pt_pt: :pep:`488` — Eliminação de ficheiros PYO
ru: :pep:`488` -- Удаление файлов PYO
sv: :pep:`488` -- Eliminering av PYO-filer

source: PEP written and implemented by Brett Cannon.
pt_pt: PEP escrita e implementada por Brett Cannon.
ru: PEP написан и реализован Бреттом Кэнноном.
sv: PEP skrivet och implementerat av Brett Cannon.

source: PEP 489: Multi-phase extension module initialization
pt_pt: PEP 489: Inicialização de módulos de extensão em múltiplas fases
ru: PEP 489: инициализация многофазного модуля расширения.
sv: PEP 489: Initialisering av flerfasig tilläggsmodul

source: :pep:`489` updates extension module initialization to take advantage of the two step module loading mechanism introduced by :pep:`451` in Python 3.4.
pt_pt: A :pep:`489` atualiza a inicialização de módulos de extensão para tirar partido do mecanismo de carregamento de módulos em duas etapas introduzido pela :pep:`451` no Python 3.4.
ru: :pep:`489` обновляет инициализацию модуля расширения, чтобы воспользоваться преимуществами двухэтапного механизма загрузки модуля, представленного :pep:`451` в Python 3.4.
sv: :pep:`489` uppdaterar initialiseringen av tilläggsmoduler för att dra nytta av den tvåstegs modulladdningsmekanism som introducerades av :pep:`451` i Python 3.4.

source: This change brings the import semantics of extension modules that opt-in to using the new mechanism much closer to those of Python source and bytecode modules, including the ability to use any valid identifier as a module name, rather than being restricted to ASCII.
pt_pt: Esta alteração aproxima a semântica de importação de módulos de extensão que optam por usar o novo mecanismo muito mais daqueles dos módulos de origem e *bytecode* do Python, incluindo a capacidade de usar qualquer identificador válido como nome de módulo, em vez de estar restrito a ASCII.
ru: Это изменение приближает семантику импорта модулей расширения, которые соглашаются на использование нового механизма, к семантике импорта модулей исходного кода и байт-кода Python, включая возможность использовать любой действительный идентификатор в качестве имени модуля, а не ограничиваться ASCII.
sv: Denna ändring gör att importsemantiken för tilläggsmoduler som väljer att använda den nya mekanismen kommer mycket närmare den för Pythons käll- och bytekodsmoduler, inklusive möjligheten att använda valfri giltig identifierare som modulnamn, i stället för att vara begränsad till ASCII.

source: :pep:`489` -- Multi-phase extension module initialization
pt_pt: :pep:`489` -- Inicialização do módulo de extensão multifásico
ru: :pep:`489` -- Многофазная инициализация модуля расширения
sv: :pep:`489` -- Initialisering av flerfasig tilläggsmodul

source: PEP written by Petr Viktorin, Stefan Behnel, and Nick Coghlan; implemented by Petr Viktorin.
pt_pt: PEP escrito por Petr Viktorin, Stefan Behnel e Nick Coghlan; implementado por Petr Viktorin.
ru: PEP, написанный Петром Викторином, Стефаном Бенелем и Ником Когланом; реализовал Петр Викторин.
sv: PEP skriven av Petr Viktorin, Stefan Behnel och Nick Coghlan; implementerad av Petr Viktorin.
