Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: The :meth:`SSLSocket.do_handshake() <ssl.SSLSocket.do_handshake>`, :meth:`SSLSocket.read() <ssl.SSLSocket.read>`, :meth:`SSLSocket.shutdown() <ssl.SSLSocket.shutdown>`, and :meth:`SSLSocket.write() <ssl.SSLSocket.write>` methods of the :class:`~ssl.SSLSocket` class no longer reset the socket timeout every time bytes are received or sent. The socket timeout is now the maximum total duration of the method. (Contributed by Victor Stinner in :issue:`23853`.)
ru: :meth:`SSLSocket.do_handshake() <ssl.SSLSocket.do_handshake>`, :meth:`SSLSocket.read() <ssl.SSLSocket.read>`, :meth:`SSLSocket.shutdown() <ssl.SSLSocket Методы .shutdown>` и :meth:`SSLSocket.write() <ssl.SSLSocket.write>` класса :class:`~ssl.SSLSocket` больше не сбрасывают тайм-аут сокета каждый раз, когда принимаются или отправляются байты. Тайм-аут сокета теперь равен максимальной общей продолжительности метода. (Предоставлено Виктором Стиннером в :issue:`23853`.)

source: The :func:`~ssl.match_hostname` function now supports matching of IP addresses. (Contributed by Antoine Pitrou in :issue:`23239`.)
ru: Функция :func:`~ssl.match_hostname` теперь поддерживает сопоставление IP-адресов. (Предоставлено Антуаном Питру в :issue:`23239`.)

source: A new :func:`~sys.set_coroutine_wrapper` function allows setting a global hook that will be called whenever a :term:`coroutine object <coroutine>` is created by an :keyword:`async def` function. A corresponding :func:`~sys.get_coroutine_wrapper` can be used to obtain a currently set wrapper. Both functions are :term:`provisional <provisional API>`, and are intended for debugging purposes only. (Contributed by Yury Selivanov in :issue:`24017`.)
ru: Новая функция :func:`~sys.set_coroutine_wrapper` позволяет установить глобальный перехватчик, который будет вызываться всякий раз, когда :term:`объект сопрограммы <coroutine>` создается функцией :keyword:`async def`. Соответствующий :func:`~sys.get_coroutine_wrapper` можно использовать для получения текущей установленной оболочки. Обе функции являются :term:`provisional <provisional API>` и предназначены только для целей отладки. (Добавлен Юрием Селивановым в :issue:`24017`.)

source: The :class:`~unittest.mock.MagicMock` class now supports :meth:`__truediv__`, :meth:`__divmod__` and :meth:`__matmul__` operators. (Contributed by Johannes Baiter in :issue:`20968`, and Håkan Lövdahl in :issue:`23581` and :issue:`23568`.)
ru: Класс :class:`~unittest.mock.MagicMock` теперь поддерживает операторы :meth:`__truediv__`, :meth:`__divmod__` и :meth:`__matmul__`. (Предоставлено Йоханнесом Байтером в :issue:`20968` и Хоканом Лёвдалом в :issue:`23581` и :issue:`23568`.)

source: Many functions in the :mod:`mmap`, :mod:`ossaudiodev`, :mod:`socket`, :mod:`ssl`, and :mod:`codecs` modules now accept writable :term:`bytes-like objects <bytes-like object>`. (Contributed by Serhiy Storchaka in :issue:`23001`.)
ru: Многие функции в модулях :mod:`mmap`, :mod:`ossaudiodev`, :mod:`socket`, :mod:`ssl` и :mod:`codecs` теперь принимают записываемые :term:`байтовые файлы объекты <байтовый объект>`. (Предоставлено Сергеем Сторчакой в ​​:issue:`23001`.)

source: The :mod:`formatter` module has now graduated to full deprecation and is still slated for removal in Python 3.6.
ru: Модуль :mod:`formatter` полностью устарел и его по-прежнему планируется удалить в Python 3.6.

source: The :func:`asyncio.async` function is deprecated in favor of :func:`~asyncio.ensure_future`.
ru: Функция :func:`asyncio.async` устарела в пользу :func:`~asyncio.ensure_future`.

source: The :func:`platform.dist` and :func:`platform.linux_distribution` functions are now deprecated. Linux distributions use too many different ways of describing themselves, so the functionality is left to a package. (Contributed by Vajrasky Kok and Berker Peksag in :issue:`1322`.)
ru: Функции :func:`platform.dist` и :func:`platform.linux_distribution` объявлены устаревшими. Дистрибутивы Linux используют слишком много разных способов описания себя, поэтому функциональность оставлена ​​на усмотрение пакета. (Предоставлено Ваджраски Коком и Беркером Пексагом в :issue:`1322`.)

source: The :func:`inspect.getargspec` function is deprecated and scheduled to be removed in Python 3.6. (See :issue:`20438` for details.)
ru: Функция :func:`inspect.getargspec` устарела и ее планируется удалить в Python 3.6. (Подробности см. в :issue:`20438`.)

source: The :mod:`inspect` :func:`~inspect.getfullargspec`, :func:`~inspect.getcallargs`, and :func:`~inspect.formatargspec` functions are deprecated in favor of the :func:`inspect.signature` API. (Contributed by Yury Selivanov in :issue:`20438`.)
ru: Функции :mod:`inspect` :func:`~inspect.getfullargspec`, :func:`~inspect.getcallargs` и :func:`~inspect.formatargspec` устарели в пользу :func:`inspect. подпись` API. (Добавлен Юрием Селивановым в :issue:`20438`.)

source: When an import loader defines :meth:`importlib.machinery.Loader.exec_module` it is now expected to also define :meth:`~importlib.machinery.Loader.create_module` (raises a :exc:`DeprecationWarning` now, will be an error in Python 3.6). If the loader inherits from :class:`importlib.abc.Loader` then there is nothing to do, else simply define :meth:`~importlib.machinery.Loader.create_module` to return ``None``. (Contributed by Brett Cannon in :issue:`23014`.)
ru: Когда загрузчик импорта определяет :meth:`importlib.machinery.Loader.exec_module`, теперь ожидается, что он также определит :meth:`~importlib.machinery.Loader.create_module` (вызывает :exc:`DeprecationWarning`, будет ошибка в Python 3.6). Если загрузчик наследует от :class:`importlib.abc.Loader`, то делать нечего, иначе просто определите :meth:`~importlib.machinery.Loader.create_module`, чтобы он возвращал ``None``. (Предоставлено Бреттом Кэнноном в :issue:`23014`.)

source: The :mod:`smtplib` module now uses :data:`sys.stderr` instead of the previous module-level :data:`stderr` variable for debug output. If your (test) program depends on patching the module-level variable to capture the debug output, you will need to update it to capture sys.stderr instead.
ru: Модуль :mod:`smtplib` теперь использует :data:`sys.stderr` вместо предыдущей переменной :data:`stderr` уровня модуля для вывода отладочных данных. Если ваша (тестовая) программа зависит от исправления переменной уровня модуля для захвата выходных данных отладки, вам потребуется обновить ее, чтобы вместо этого записывать sys.stderr.

source: The undocumented :c:member:`!format` member of the (non-public) :c:type:`PyMemoryViewObject` structure has been removed. All extensions relying on the relevant parts in ``memoryobject.h`` must be rebuilt.
ru: Недокументированный член :c:member:`!format` (непубличной) структуры :c:type:`PyMemoryViewObject` был удален. Все расширения, использующие соответствующие части memoryobject.h, должны быть пересобраны.

source: The :c:type:`PyMemAllocator` structure was renamed to :c:type:`PyMemAllocatorEx` and a new ``calloc`` field was added.
ru: Структура :c:type:`PyMemAllocator` была переименована в :c:type:`PyMemAllocatorEx` и было добавлено новое поле ``calloc``.
