Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: The :mod:`smtplib` module now uses :data:`sys.stderr` instead of the previous module-level :data:`!stderr` variable for debug output. If your (test) program depends on patching the module-level variable to capture the debug output, you will need to update it to capture sys.stderr instead.
pt_pt: O módulo :mod:`smtplib` agora usa :data:`sys.stderr` em vez da variável anterior a nível de módulo :data:`!stderr` para saída de depuração. Se o seu programa (de teste) depender de corrigir a variável a nível de módulo para capturar a saída de depuração, terá de atualizá-lo para capturar sys.stderr em vez disso.

source: The :meth:`str.startswith` and :meth:`str.endswith` methods no longer return ``True`` when finding the empty string and the indexes are completely out of range. (Contributed by Serhiy Storchaka in :issue:`24284`.)
pt_pt: Os métodos :meth:`str.startswith` e :meth:`str.endswith` já não devolvem ``True`` ao encontrar a *string* vazia e os índices estarem completamente fora do intervalo. (Contribuído por Serhiy Storchaka em :issue:`24284`.)
ru: Методы :meth:`str.startswith` и :meth:`str.endswith` больше не возвращают ``True`` при обнаружении пустой строки, а индексы полностью выходят за пределы допустимого диапазона. (Предоставлено Сергеем Сторчакой в ​​:issue:`24284`.)
sv: Metoderna :meth:`str.startswith` och :meth:`str.endswith` returnerar inte längre ``True`` när de hittar den tomma strängen och indexen är helt utanför intervallet. (Bidrag från Serhiy Storchaka i :issue:`24284`.)

source: The :func:`inspect.getdoc` function now returns documentation strings inherited from base classes. Documentation strings no longer need to be duplicated if the inherited documentation is appropriate. To suppress an inherited string, an empty string must be specified (or the documentation may be filled in). This change affects the output of the :mod:`pydoc` module and the :func:`help` function. (Contributed by Serhiy Storchaka in :issue:`15582`.)
pt_pt: A função :func:`inspect.getdoc` agora devolve *strings* de documentação herdadas de classes base. As *strings* de documentação já não precisam de ser duplicadas se a documentação herdada for apropriada. Para suprimir uma *string* herdada, deve ser especificada uma *string* vazia (ou a documentação pode ser preenchida). Esta alteração afeta a saída do módulo :mod:`pydoc` e da função :func:`help`. (Contribuído por Serhiy Storchaka em :issue:`15582`.)
ru: Функция :func:`inspect.getdoc` теперь возвращает строки документации, унаследованные от базовых классов. Строки документации больше не нужно дублировать, если унаследованная документация подходит. Чтобы подавить унаследованную строку, необходимо указать пустую строку (или можно заполнить документацию). Это изменение влияет на вывод модуля :mod:`pydoc` и функции :func:`help`. (Предоставлено Сергеем Сторчакой в ​​:issue:`15582`.)
sv: Funktionen :func:`inspect.getdoc` returnerar nu dokumentationssträngar som ärvts från basklasser. Dokumentationssträngar behöver inte längre dupliceras om den ärvda dokumentationen är lämplig. För att undertrycka en ärvd sträng måste en tom sträng anges (eller så kan dokumentationen fyllas i). Denna ändring påverkar utdata från modulen :mod:`pydoc` och funktionen :func:`help`. (Bidrag från Serhiy Storchaka i :issue:`15582`.)

source: Nested :func:`functools.partial` calls are now flattened. If you were relying on the previous behavior, you can now either add an attribute to a :func:`functools.partial` object or you can create a subclass of :func:`functools.partial`. (Contributed by Alexander Belopolsky in :issue:`7830`.)
pt_pt: As chamadas aninhadas de :func:`functools.partial` são agora achatadas. Se estava a depender do comportamento anterior, pode agora adicionar um atributo a um objeto :func:`functools.partial` ou pode criar uma subclasse de :func:`functools.partial`. (Contribuído por Alexander Belopolsky em :issue:`7830`.)
ru: Вложенные вызовы :func:`functools.partial` теперь сглажены. Если вы полагались на предыдущее поведение, теперь вы можете либо добавить атрибут к объекту :func:`functools.partial`, либо создать подкласс :func:`functools.partial`. (Предоставлено Александром Белопольским в :issue:`7830`.)
sv: Nästade :func:`functools.partial`\-anrop är nu utplattade. Om du förlitade dig på det tidigare beteendet kan du nu antingen lägga till ett attribut till ett :func:`functools.partial`\-objekt eller så kan du skapa en underklass av :func:`functools.partial`. (Bidrag från Alexander Belopolsky i :issue:`7830`.)

source: Changes in the C API
pt_pt: Alterações na API C
ru: Изменения в C API
sv: Förändringar i C API

source: The undocumented :c:member:`!format` member of the (non-public) :c:type:`!PyMemoryViewObject` structure has been removed. All extensions relying on the relevant parts in ``memoryobject.h`` must be rebuilt.
pt_pt: O membro não documentado :c:member:`!format` da estrutura (não pública) :c:type:`!PyMemoryViewObject` foi removido. Todas as extensões que dependem das partes relevantes em ``memoryobject.h`` devem ser recompiladas.

source: The :c:type:`!PyMemAllocator` structure was renamed to :c:type:`PyMemAllocatorEx` and a new ``calloc`` field was added.
pt_pt: A estrutura :c:type:`!PyMemAllocator` foi renomeada para :c:type:`PyMemAllocatorEx` e foi adicionado um novo campo ``calloc``.
sv: Strukturen :c:type:`!PyMemAllocator` döptes om till :c:type:`PyMemAllocatorEx` och ett nytt fält ``calloc`` lades till.

source: Removed non-documented macro :c:macro:`!PyObject_REPR()` which leaked references. Use format character ``%R`` in :c:func:`PyUnicode_FromFormat`-like functions to format the :func:`repr` of the object. (Contributed by Serhiy Storchaka in :issue:`22453`.)
pt_pt: Macro não documentada removida :c:macro:`!PyObject_REPR()`, que causava fugas de referências. Use o carácter de formatação ``%R`` em funções do tipo :c:func:`PyUnicode_FromFormat` para formatar o :func:`repr` do objeto. (Contribuído por Serhiy Storchaka em :issue:`22453`.)
ru: Удален недокументированный макрос :c:macro:`! PyObject_REPR ()`, из-за которого произошла утечка ссылок. Используйте символ форматирования ``%R`` в функциях, подобных :c:func:`PyUnicode_FromFormat`, для форматирования :func:`repr` объекта. (Предоставлено Сергеем Сторчакой в ​​:issue:`22453`.)
sv: Borttaget icke-dokumenterat makro :c:macro:`!PyObject_REPR()` som läckte referenser. Använd formattecknet ``%R`` i :c:func:`PyUnicode_FromFormat`\-liknande funktioner för att formatera objektets :func:`repr`. (Bidrag från Serhiy Storchaka i :issue:`22453`.)

source: Because the lack of the :attr:`~type.__module__` attribute breaks pickling and introspection, a deprecation warning is now raised for builtin types without the :attr:`~type.__module__` attribute. This will be an :exc:`AttributeError` in the future. (Contributed by Serhiy Storchaka in :issue:`20204`.)
pt_pt: Porque a falta do atributo :attr:`~type.__module__` quebra a serialização e a introspeção, um aviso de obsolescência é agora lançado para tipos integrados sem o atributo :attr:`~type.__module__`. Isto será um :exc:`AttributeError` no futuro. (Contribuído por Serhiy Storchaka em :issue:`20204`.)
sv: Eftersom avsaknaden av attributet :attr:`~type.__module__` bryter mot pickling och introspektion, utfärdas nu en varning om föråldring för inbyggda typer utan attributet :attr:`~type.__module__`. Detta kommer att vara ett :exc:`AttributeError` i framtiden. (Bidrag från Serhiy Storchaka i :issue:`20204`.)

source: As part of the :pep:`492` implementation, the ``tp_reserved`` slot of :c:type:`PyTypeObject` was replaced with a :c:member:`~PyTypeObject.tp_as_async` slot. Refer to :ref:`coro-objects` for new types, structures and functions.
pt_pt: Como parte da implementação da :pep:`492`, o *slot* ``tp_reserved`` de :c:type:`PyTypeObject` foi substituído por um slot :c:member:`~PyTypeObject.tp_as_async`. Consulte :ref:`coro-objects` para novos tipos, estruturas e funções.
ru: В рамках реализации :pep:`492` слот ``tp_reserved`` :c:type:`PyTypeObject` был заменен слотом :c:member:`~PyTypeObject.tp_as_async`. Обратитесь к :ref:`coro-objects` для получения информации о новых типах, структурах и функциях.
sv: Som en del av implementeringen av :pep:`492`, ersattes ``tp_reserved`` slot i :c:type:`PyTypeObject` med en :c:member:`~PyTypeObject.tp_as_async` slot. Se :ref:`coro-objects` för nya typer, strukturer och funktioner.

source: Notable changes in Python 3.5.4
pt_pt: Alterações notáveis no Python 3.5.4
ru: Заметные изменения в Python 3.5.4
sv: Viktiga ändringar i Python 3.5.4

source: New ``make regen-all`` build target
pt_pt: Novo alvo de compilação ``make regen-all``
ru: Новая цель сборки make regen-all
sv: Nytt byggmål för ``make regen-all``

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
pt_pt: Para simplificar a compilação cruzada e garantir que o CPython possa ser compilado de forma confiável sem exigir que uma versão existente do Python já esteja disponível, o sistema de compilação baseado em autotools já não tenta recompilar implicitamente ficheiros gerados com base nos tempos de modificação dos ficheiros.
ru: Чтобы упростить кросс-компиляцию и гарантировать, что CPython может быть надежно скомпилирован без необходимости наличия существующей версии Python, система сборки на основе autotools больше не пытается неявно перекомпилировать сгенерированные файлы на основе времени их изменения.
sv: För att förenkla korskompilering och säkerställa att CPython kan kompileras på ett tillförlitligt sätt utan att det krävs att en befintlig version av Python redan finns tillgänglig, försöker det autotools-baserade byggsystemet inte längre att implicit kompilera om genererade filer baserat på filändringstider.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
pt_pt: Em vez disso, foi adicionado um novo comando ``make regen-all`` para forçar a regeneração destes ficheiros quando desejado (por exemplo, após uma versão inicial do Python já ter sido compilada com base nas versões pré-geradas).
ru: Вместо этого была добавлена ​​новая команда make regen-all для принудительной регенерации этих файлов при необходимости (например, после того, как начальная версия Python уже была собрана на основе предварительно сгенерированных версий).
sv: Istället har ett nytt ``make regen-all``\-kommando lagts till för att tvinga fram regenerering av dessa filer när så önskas (t.ex. efter att en första version av Python redan har byggts baserat på de förgenererade versionerna).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
pt_pt: Também são definidos alvos de regeneração mais seletivos - consulte :source:`Makefile.pre.in` para detalhes.
ru: Также определены более выборочные цели регенерации — подробности см. в :source:`Makefile.pre.in`.
sv: Mer selektiva regenereringsmål definieras också - se :source:`Makefile.pre.in` för detaljer.

source: (Contributed by Victor Stinner in :issue:`23404`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`23404`.)
ru: (Предоставлено Виктором Стиннером в :issue:`23404`.)
sv: (Bidrag från Victor Stinner i :issue:`23404`.)

source: Removal of ``make touch`` build target
pt_pt: Remoção do alvo de compilação ``make touch``
ru: Удаление цели сборки ``make touch``.
sv: Borttagning av byggmålet ``make touch``

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
pt_pt: O alvo de compilação ``make touch``, anteriormente usado para solicitar a regeneração implícita de ficheiros gerados através da atualização das suas datas de modificação, foi removido.
ru: Цель сборки make touch, ранее использовавшаяся для запроса неявной регенерации сгенерированных файлов путем обновления времени их модификации, была удалена.
sv: Byggmålet ``make touch`` som tidigare användes för att begära implicit regenerering av genererade filer genom att uppdatera deras modifieringstider har tagits bort.

source: It has been replaced by the new ``make regen-all`` target.
pt_pt: Foi substituído pelo novo alvo ``make regen-all``.
ru: Он был заменен новой целью make regen-all.
sv: Det har ersatts av det nya målet ``make regen-all``.

source: def greeting(name: str) -> str: return 'Hello ' + name
sv: def greeting(namn: str) -> str: return 'Hej ' + namn

source: for entry in os.scandir(path): if not entry.name.startswith('.') and entry.is_file(): print(entry.name)
sv: för entry i os.scandir(path): if not entry.name.startswith('.') and entry.is_file(): print(post.namn)

source: print("Hello World")
sv: skriv ut("Hello World")

source: while True: try: print("Hello World") break except InterruptedError: continue
sv: medan True: try: print("Hello World") bryt except InterruptedError: fortsätt

source: :func:`time.sleep`.
sv: :func:`tid.sömn`.

source: code
ru: код
sv: kod

source: collections
ru: коллекции
sv: samlingar

source: collections.abc
sv: samlingar.abc

source: email
ru: электронная почта
sv: e-post

source: faulthandler
sv: felhanterare

source: glob
sv: klot

source: http.client
sv: http.klient

source: import http.client conn = http.client.HTTPConnection('www.python.org') for retries in range(3): try: conn.request('GET', '/') resp = conn.getresponse() except http.client.RemoteDisconnected: pass
sv: import http.client conn = http.client.HTTPConnection('www.python.org') för retries i intervall(3): försök: conn.request('GET', '/') resp = conn.getresponse() except http.client.RemoteDisconnected: pass

source: inspect
sv: inspektera

source: ipaddress
sv: ipadress

source: locale
ru: локаль
sv: lokal

source: logging
ru: логирование
sv: loggning

source: math
ru: математика
sv: matematik

source: pathlib
sv: sökväg

source: pickle
sv: gurka

source: readline
sv: läslinje

source: selectors
ru: селекторы
sv: väljare

source: socket
ru: сокет
sv: kortplats

source: sys
sv: system

source: tarfile
sv: tarfil

source: threading
sv: gängning

source: time
ru: время
sv: tid

source: timeit
sv: tidsinställning

source: traceback
ru: трассировка
sv: spårning

source: types
ru: типы
sv: typer

source: zipfile
ru: zip-файл
sv: zip-fil

source: f(1 for x in [1], *args) f(1 for x in [1], **kwargs)
sv: f(1 för x i [1], *args) f(1 för x i [1], **kwargs)

source: This article explains the new features in Python 3.5, compared to 3.4. Python 3.5 was released on September 13, 2015. See the `changelog <https://docs.python.org/3.5/whatsnew/changelog.html>`_ for a full list of changes.
ru: В этой статье объясняются новые возможности Python 3.5 по сравнению с версией 3.4. Python 3.5 был выпущен 13 сентября 2015 года. Полный список изменений см. в журнале изменений <https://docs.python.org/3.5/whatsnew/changelog.html>`_.

source: Inside a coroutine function, the new :keyword:`await` expression can be used to suspend coroutine execution until the result is available. Any object can be *awaited*, as long as it implements the :term:`awaitable` protocol by defining the :meth:`__await__` method.
ru: Внутри функции сопрограммы можно использовать новое выражение :keyword:`await` для приостановки выполнения сопрограммы до тех пор, пока не будет доступен результат. Любой объект может быть *ожидаемым*, если он реализует протокол :term:`awaitable` путем определения метода :meth:`__await__`.

source: :pep:`465` adds the ``@`` infix operator for matrix multiplication. Currently, no builtin Python types implement the new operator, however, it can be implemented by defining :meth:`__matmul__`, :meth:`__rmatmul__`, and :meth:`__imatmul__` for regular, reflected, and in-place matrix multiplication. The semantics of these methods is similar to that of methods defining other infix arithmetic operators.
ru: :pep:`465` добавляет инфиксный оператор ``@`` для умножения матриц. В настоящее время ни один из встроенных типов Python не реализует новый оператор, однако его можно реализовать, определив :meth:`__matmul__`, :meth:`__rmatmul__` и :meth:`__imatmul__` для обычной, отраженной матрицы и матрицы на месте. умножение. Семантика этих методов аналогична семантике методов, определяющих другие инфиксные арифметические операторы.

source: typing
ru: печатание

source: The :func:`~asyncio.async` function is deprecated in favor of :func:`~asyncio.ensure_future`. (Contributed by Yury Selivanov.)
ru: Функция :func:`~asyncio.async` устарела в пользу :func:`~asyncio.ensure_future`. (Сообщил Юрий Селиванов.)

source: The :class:`~cgi.FieldStorage` class now supports the :term:`context manager` protocol. (Contributed by Berker Peksag in :issue:`20289`.)
ru: Класс :class:`~cgi.FieldStorage` теперь поддерживает протокол :term:`контекстного менеджера`. (Предоставлено Беркером Пексагом в :issue:`20289`.)

source: :meth:`OrderedDict.items() <collections.OrderedDict.items>`, :meth:`OrderedDict.keys() <collections.OrderedDict.keys>`, :meth:`OrderedDict.values() <collections.OrderedDict.values>` views now support :func:`reversed` iteration. (Contributed by Serhiy Storchaka in :issue:`19505`.)
ru: :meth:`OrderedDict.items() <collections.OrderedDict.items>`, :meth:`OrderedDict.keys() <collections.OrderedDict.keys>`, :meth:`OrderedDict.values() <collections.OrderedDict. Представления значений>` теперь поддерживают :func:`reversed` итерацию. (Предоставлено Сергеем Сторчакой в ​​:issue:`19505`.)

source: The :class:`~collections.UserString` class now implements the :meth:`__getnewargs__`, :meth:`__rmod__`, :meth:`~str.casefold`, :meth:`~str.format_map`, :meth:`~str.isprintable`, and :meth:`~str.maketrans` methods to match the corresponding methods of :class:`str`. (Contributed by Joe Jevnik in :issue:`22189`.)
ru: Класс :class:`~collections.UserString` теперь реализует :meth:`__getnewargs__`, :meth:`__rmod__`, :meth:`~str.casefold`, :meth:`~str.format_map`, :meth :`~str.isprintable` и :meth:`~str.maketrans` для соответствия соответствующим методам :class:`str`. (Внесено Джо Джевником в :issue:`22189`.)

source: The :meth:`Sequence.index() <collections.abc.Sequence.index>` method now accepts *start* and *stop* arguments to match the corresponding methods of :class:`tuple`, :class:`list`, etc. (Contributed by Devin Jeanpierre in :issue:`23086`.)
ru: Метод :meth:`Sequence.index() <collections.abc.Sequence.index>` теперь принимает аргументы *start* и *stop*, соответствующие соответствующим методам :class:`tuple`, :class:`list` и т. д. (Предоставлено Девином Жанпьером в :issue:`23086`.)

source: The new :func:`~curses.update_lines_cols` function updates the :data:`LINES` and :data:`COLS` module variables. This is useful for detecting manual screen resizing. (Contributed by Arnon Yaari in :issue:`4254`.)
ru: Новая функция :func:`~curses.update_lines_cols` обновляет переменные модуля :data:`LINES` и :data:`COLS`. Это полезно для обнаружения изменения размера экрана вручную. (Предоставлено Арноном Яари в :issue:`4254`.)

source: The :func:`~imghdr.what` function now recognizes the `OpenEXR <https://www.openexr.com>`_ format (contributed by Martin Vignali and Claudiu Popa in :issue:`20295`), and the `WebP <https://en.wikipedia.org/wiki/WebP>`_ format (contributed by Fabrice Aneche and Claudiu Popa in :issue:`20197`.)
ru: Функция :func:`~imghdr.what` теперь распознаёт формат `OpenEXR <https://www.openexr.com>`_ (предоставленный Мартином Виньяли и Клаудиу Попа в :issue:`20295`), а также формат ` Формат WebP <https://en.wikipedia.org/wiki/WebP>`_ (предоставлен Фабрисом Анеше и Клаудиу Попа в :issue:`20197`.)

source: A new :attr:`~ipaddress.IPv4Network.reverse_pointer` attribute for the :class:`~ipaddress.IPv4Network` and :class:`~ipaddress.IPv6Network` classes returns the name of the reverse DNS PTR record::
ru: Новый атрибут :attr:`~ipaddress.IPv4Network.reverse_pointer` для классов :class:`~ipaddress.IPv4Network` и :class:`~ipaddress.IPv6Network` возвращает имя обратной DNS-записи PTR::

source: A new :func:`~math.gcd` function has been added. The :func:`fractions.gcd` function is now deprecated. (Contributed by Mark Dickinson and Serhiy Storchaka in :issue:`22486`.)
ru: Добавлена ​​новая функция :func:`~math.gcd`. Функция :func:`fractions.gcd` устарела. (Предоставлено Марком Дикинсоном и Сергеем Сторчакой в ​​:issue:`22486`.)

source: operator
ru: оператор

source: The :class:`re.error` exceptions have new attributes, :attr:`~re.error.msg`, :attr:`~re.error.pattern`, :attr:`~re.error.pos`, :attr:`~re.error.lineno`, and :attr:`~re.error.colno`, that provide better context information about the error::
ru: Исключения :class:`re.error` имеют новые атрибуты: :attr:`~re.error.msg`, :attr:`~re.error.pattern`, :attr:`~re.error.pos`, :attr:`~re.error.lineno` и :attr:`~re.error.colno`, которые предоставляют более точную контекстную информацию об ошибке::

source: signal
ru: сигнал

source: The :func:`~sndhdr.what` and :func:`~sndhdr.whathdr` functions now return a :func:`~collections.namedtuple`. (Contributed by Claudiu Popa in :issue:`18615`.)
ru: Функции :func:`~sndhdr.what` и :func:`~sndhdr.whathdr` теперь возвращают :func:`~collections.namedtuple`. (Предоставлено Клаудиу Попа в :issue:`18615`.)

source: The :class:`~ssl.SSLSocket` class now implements a :meth:`SSLSocket.sendfile() <ssl.SSLSocket.sendfile>` method. (Contributed by Giampaolo Rodola' in :issue:`17552`.)
ru: Класс :class:`~ssl.SSLSocket` теперь реализует метод :meth:`SSLSocket.sendfile() <ssl.SSLSocket.sendfile>`. (Предоставлено Джампаоло Родолой в :issue:`17552`.)

source: The :meth:`SSLSocket.send() <ssl.SSLSocket.send>` method now raises either the :exc:`ssl.SSLWantReadError` or :exc:`ssl.SSLWantWriteError` exception on a non-blocking socket if the operation would block. Previously, it would return ``0``. (Contributed by Nikolaus Rath in :issue:`20951`.)
ru: Метод :meth:`SSLSocket.send() <ssl.SSLSocket.send>` теперь вызывает исключение :exc:`ssl.SSLWantReadError` или :exc:`ssl.SSLWantWriteError` для неблокирующего сокета, если операция заблокировал бы. Раньше он возвращал ``0``. (Предоставлено Николаусом Ратом в :issue:`20951`.)

source: New :meth:`SSLObject.shared_ciphers() <ssl.SSLObject.shared_ciphers>` and :meth:`SSLSocket.shared_ciphers() <ssl.SSLSocket.shared_ciphers>` methods return the list of ciphers sent by the client during the handshake. (Contributed by Benjamin Peterson in :issue:`23186`.)
ru: Новые методы :meth:`SSLObject.shared_ciphers() <ssl.SSLObject.shared_ciphers>` и :meth:`SSLSocket.shared_ciphers() <ssl.SSLSocket.shared_ciphers>` возвращают список шифров, отправленных клиентом во время рукопожатия. (Предоставлено Бенджамином Петерсоном в :issue:`23186`.)
