Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: The ``__version__`` attribute has been dropped from the email package. The email code hasn't been shipped separately from the stdlib for a long time, and the ``__version__`` string was not updated in the last few releases.
pt_pt: O atributo ``__version__`` foi removido do pacote email. O código de email não tem sido distribuído separadamente da biblioteca padrão há muito tempo, e a *string* ``__version__`` não foi atualizada nas últimas versões.
ru: Атрибут ``__version__`` был удален из пакета электронной почты. Код электронной почты уже давно не поставляется отдельно от стандартной библиотеки, а строка ``__version__`` не обновлялась в последних нескольких выпусках.
sv: Attributet ``__version__`` har tagits bort från e-postpaketet. E-postkoden har inte levererats separat från stdlib på länge och strängen ``__version__`` har inte uppdaterats under de senaste utgåvorna.

source: The internal ``Netrc`` class in the :mod:`ftplib` module was deprecated in 3.4, and has now been removed. (Contributed by Matt Chaput in :issue:`6623`.)
pt_pt: A classe interna ``Netrc`` no módulo :mod:`ftplib` estava obsoleta desde a versão 3.4 e foi agora removida. (Contribuído por Matt Chaput em :issue:`6623`.)
sv: Den interna klassen ``Netrc`` i modulen :mod:`ftplib` var föråldrad i 3.4 och har nu tagits bort. (Bidrag från Matt Chaput i :issue:`6623`.)

source: The concept of ``.pyo`` files has been removed.
pt_pt: O conceito de ficheiros ``.pyo`` foi removido.
ru: Концепция файлов ``.pyo`` была удалена.
sv: Konceptet med ``.pyo``\-filer har tagits bort.

source: The JoinableQueue class in the provisional :mod:`asyncio` module was deprecated in 3.4.4 and is now removed. (Contributed by A. Jesse Jiryu Davis in :issue:`23464`.)
pt_pt: A classe JoinableQueue no módulo provisório :mod:`asyncio` estava obsoleta desde a versão 3.4.4 e foi agora removida. (Contribuído por A. Jesse Jiryu Davis em :issue:`23464`.)
ru: Класс JoinableQueue во временном модуле :mod:`asyncio` устарел в версии 3.4.4 и теперь удален. (Предоставлено А. Джесси Джирю Дэвисом в :issue:`23464`.)
sv: Klassen JoinableQueue i den provisoriska modulen :mod:`asyncio` var föråldrad i 3.4.4 och är nu borttagen. (Bidrag från A. Jesse Jiryu Davis i :issue:`23464`.)

source: Porting to Python 3.5
pt_pt: Portabilidade para Python 3.5
ru: Портирование на Python 3.5
sv: Portning till Python 3.5

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_pt: Esta secção lista alterações previamente descritas e outras correções de erros que podem exigir alterações no seu código.
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код.
sv: I det här avsnittet listas tidigare beskrivna ändringar och andra buggfixar som kan kräva ändringar i din kod.

source: Changes in Python behavior
pt_pt: Alterações no comportamento do Python
ru: Изменения в поведении Python
sv: Förändringar i Pythons beteende

source: Due to an oversight, earlier Python versions erroneously accepted the following syntax::
pt_pt: Devido a um descuido, versões anteriores do Python aceitavam erroneamente a seguinte sintaxe::
ru: Из-за недосмотра более ранние версии Python ошибочно принимали следующий синтаксис:
sv: På grund av ett förbiseende accepterade tidigare Python-versioner felaktigt följande syntax::

source: Python 3.5 now correctly raises a :exc:`SyntaxError`, as generator expressions must be put in parentheses if not a sole argument to a function.
pt_pt: O Python 3.5 agora lança corretamente um :exc:`SyntaxError`, uma vez que as expressões geradoras devem ser colocadas entre parênteses se não forem o único argumento de uma função.
ru: Python 3.5 теперь корректно вызывает ошибку :exc:`SyntaxError`, поскольку выражения генератора должны быть заключены в круглые скобки, если они не являются единственным аргументом функции.
sv: Python 3.5 utlöser nu korrekt ett :exc:`SyntaxError`, eftersom generatoruttryck måste sättas inom parentes om de inte är det enda argumentet till en funktion.

source: Changes in the Python API
pt_pt: Alterações na API do Python
ru: Изменения в API Python
sv: Ändringar i Python API

source: :pep:`475`: System calls are now retried when interrupted by a signal instead of raising :exc:`InterruptedError` if the Python signal handler does not raise an exception.
pt_pt: :pep:`475`: As chamadas de sistema são agora repetidas quando interrompidas por um sinal em vez de lançar :exc:`InterruptedError` se o gestor de sinal do Python não lançar uma exceção.
ru: :pep:`475`: Системные вызовы теперь повторяются при прерывании сигналом, а не вызывают :exc:`InterruptedError`, если обработчик сигнала Python не вызывает исключение.
sv: :pep:`475`: Systemanrop återupptas nu när de avbryts av en signal istället för att ge upphov till :exc:`InterruptedError` om Pythons signalhanterare inte ger upphov till ett undantag.

source: Before Python 3.5, a :class:`datetime.time` object was considered to be false if it represented midnight in UTC. This behavior was considered obscure and error-prone and has been removed in Python 3.5. See :issue:`13936` for full details.
pt_pt: Antes do Python 3.5, um objeto :class:`datetime.time` era considerado falso se representasse meia-noite em UTC. Este comportamento era considerado obscuro e propenso a erros e foi removido no Python 3.5. Veja :issue:`13936` para detalhes completos.
ru: До Python 3.5 объект :class:`datetime.time` считался ложным, если он представлял полночь в формате UTC. Такое поведение считалось непонятным и подверженным ошибкам, и оно было удалено в Python 3.5. Подробности смотрите в :issue:`13936`.
sv: Före Python 3.5 ansågs ett :class:`datetime.time`\-objekt vara falskt om det representerade midnatt i UTC. Detta beteende ansågs obskyrt och felbenäget och har tagits bort i Python 3.5. Se :issue:`13936` för fullständiga detaljer.

source: The :meth:`!ssl.SSLSocket.send` method now raises either :exc:`ssl.SSLWantReadError` or :exc:`ssl.SSLWantWriteError` on a non-blocking socket if the operation would block. Previously, it would return ``0``. (Contributed by Nikolaus Rath in :issue:`20951`.)
pt_pt: O método :meth:`!ssl.SSLSocket.send` agora lança :exc:`ssl.SSLWantReadError` ou :exc:`ssl.SSLWantWriteError` num *socket* não bloqueante se a operação bloqueasse. Anteriormente, devolvia ``0``. (Contribuído por Nikolaus Rath em :issue:`20951`.)

source: The ``__name__`` attribute of generators is now set from the function name, instead of being set from the code name. Use ``gen.gi_code.co_name`` to retrieve the code name. Generators also have a new ``__qualname__`` attribute, the qualified name, which is now used for the representation of a generator (``repr(gen)``). (Contributed by Victor Stinner in :issue:`21205`.)
pt_pt: O atributo ``__name__`` dos geradores é agora definido a partir do nome da função, em vez de ser definido a partir do nome do código. Use ``gen.gi_code.co_name`` para recuperar o nome do código. Os geradores também têm um novo atributo ``__qualname__``, o nome qualificado, que é agora usado para a representação de um gerador (``repr(gen)``). (Contribuído por Victor Stinner em :issue:`21205`.)
ru: Атрибут генераторов ``__name__`` теперь устанавливается по имени функции, а не по кодовому имени. Используйте ``gen.gi_code.co_name`` для получения кодового имени. Генераторы также имеют новый атрибут ``__qualname__``, квалифицированное имя, которое теперь используется для представления генератора (``repr(gen)``). (Предоставлено Виктором Стиннером в :issue:`21205`.)
sv: Generatorernas attribut ``__name__`` anges nu utifrån funktionsnamnet istället för kodnamnet. Använd ``gen.gi_code.co_name`` för att hämta kodnamnet. Generatorer har också ett nytt attribut ``__qualname__``, det kvalificerade namnet, som nu används för att representera en generator (``repr(gen)``). (Bidrag från Victor Stinner i :issue:`21205`.)

source: The deprecated "strict" mode and argument of :class:`~html.parser.HTMLParser`, :meth:`!HTMLParser.error`, and the :exc:`!HTMLParserError` exception have been removed. (Contributed by Ezio Melotti in :issue:`15114`.) The *convert_charrefs* argument of :class:`~html.parser.HTMLParser` is now ``True`` by default. (Contributed by Berker Peksag in :issue:`21047`.)
pt_pt: O modo "strict" obsoleto e o argumento de :class:`~html.parser.HTMLParser`, :meth:`!HTMLParser.error` e a exceção :exc:`!HTMLParserError` foram removidos. (Contribuído por Ezio Melotti em :issue:`15114`.) O argumento *convert_charrefs* de :class:`~html.parser.HTMLParser` é agora ``True`` por predefinição. (Contribuído por Berker Peksag em :issue:`21047`.)
ru: Устаревший «строгий» режим и аргумент :class:`~html.parser.HTMLParser`, :meth:`!HTMLParser.error` и исключение :exc:`!HTMLParserError` были удалены. (Внесено Эцио Мелотти в :issue:`15114`.) Аргумент *convert_charrefs* :class:`~html.parser.HTMLParser` теперь по умолчанию имеет значение ``True``. (Предоставлено Беркером Пексагом в :issue:`21047`.)
sv: Det föråldrade läget och argumentet "strict" i :class:`~html.parser.HTMLParser`, :meth:`!HTMLParser.error` och undantaget :exc:`!HTMLParserError` har tagits bort. (Bidrag från Ezio Melotti i :issue:`15114`.) Argumentet *convert_charrefs* i :class:`~html.parser.HTMLParser` är nu ``True`` som standard. (Bidrag från Berker Peksag i :issue:`21047`.)

source: Although it is not formally part of the API, it is worth noting for porting purposes (ie: fixing tests) that error messages that were previously of the form "'sometype' does not support the buffer protocol" are now of the form "a :term:`bytes-like object` is required, not 'sometype'". (Contributed by Ezio Melotti in :issue:`16518`.)
pt_pt: Embora não faça formalmente parte da API, vale a pena notar para fins de portabilidade (ou seja: corrigir testes) que as mensagens de erro que antes eram da forma "'sometype' não suporta o protocolo de *buffer*" agora são da forma "é necessário um objeto :term:`semelhante a bytes`, não 'sometype'". (Contribuído por Ezio Melotti em :issue:`16518`.)
ru: Хотя формально это не является частью API, стоит отметить, что в целях портирования (т. е. исправления тестов) сообщения об ошибках, которые раньше имели форму «sometype не поддерживает протокол буфера», теперь имеют форму «a». :term:`Требуется `байтовый объект`, а не `sometype'". (Предоставлено Эцио Мелотти в :issue:`16518`.)
sv: Även om det inte formellt är en del av API:et, är det värt att notera för portningsändamål (dvs: fixa tester) att felmeddelanden som tidigare var av formen "'sometype' stöder inte buffertprotokollet" nu är av formen "en :term:`bytesliknande objekt` krävs, inte 'sometype'". (Bidrag från Ezio Melotti i :issue:`16518`.)

source: If the current directory is set to a directory that no longer exists then :exc:`FileNotFoundError` will no longer be raised and instead :meth:`~importlib.machinery.FileFinder.find_spec` will return ``None`` **without** caching ``None`` in :data:`sys.path_importer_cache`, which is different than the typical case (:issue:`22834`).
pt_pt: Se o diretório atual estiver definido para um diretório que já não existe, então :exc:`FileNotFoundError` já não será lançado e, em vez disso, :meth:`~importlib.machinery.FileFinder.find_spec` devolverá ``None`` **sem** armazenar em cache ``None`` em :data:`sys.path_importer_cache`, o que é diferente do caso típico (:issue:`22834`).
ru: Если текущий каталог установлен в каталог, который больше не существует, то :exc:`FileNotFoundError` больше не будет вызываться и вместо этого :meth:`~importlib.machinery.FileFinder.find_spec` вернет ``None`` **без ** кэширование ``None`` в :data:`sys.path_importer_cache`, что отличается от типичного случая (:issue:`22834`).
sv: Om den aktuella katalogen är inställd på en katalog som inte längre finns kommer :exc:`FileNotFoundError` inte längre att uppstå och istället kommer :meth:`~importlib.machinery.FileFinder.find_spec` att returnera ``None`` **utan** att cachelagra ``None`` i :data:`sys.path_importer_cache`, vilket skiljer sig från det typiska fallet (:issue:`22834`).

source: HTTP status code and messages from :mod:`http.client` and :mod:`http.server` were refactored into a common :class:`~http.HTTPStatus` enum. The values in :mod:`http.client` and :mod:`http.server` remain available for backwards compatibility. (Contributed by Demian Brecht in :issue:`21793`.)
pt_pt: Os códigos de estado HTTP e mensagens de :mod:`http.client` e :mod:`http.server` foram refatorados para uma enumeração comum :class:`~http.HTTPStatus`. Os valores em :mod:`http.client` e :mod:`http.server` permanecem disponíveis para compatibilidade retroativa. (Contribuído por Demian Brecht em :issue:`21793`.)
ru: Код состояния HTTP и сообщения от :mod:`http.client` и :mod:`http.server` были преобразованы в общее перечисление :class:`~http.HTTPStatus`. Значения в :mod:`http.client` и :mod:`http.server` остаются доступными для обратной совместимости. (Предоставлено Демианом Брехтом в :issue:`21793`.)
sv: HTTP-statuskod och meddelanden från :mod:`http.client` och :mod:`http.server` omarbetades till ett gemensamt :class:`~http.HTTPStatus` enum. Värdena i :mod:`http.client` och :mod:`http.server` förblir tillgängliga för bakåtkompatibilitet. (Bidrag från Demian Brecht i :issue:`21793`.)

source: When an import loader defines :meth:`~importlib.abc.Loader.exec_module` it is now expected to also define :meth:`~importlib.abc.Loader.create_module` (raises a :exc:`DeprecationWarning` now, will be an error in Python 3.6). If the loader inherits from :class:`importlib.abc.Loader` then there is nothing to do, else simply define :meth:`~importlib.abc.Loader.create_module` to return ``None``. (Contributed by Brett Cannon in :issue:`23014`.)
pt_pt: Quando um carregador de importação define :meth:`~importlib.abc.Loader.exec_module`, agora também é esperado que defina :meth:`~importlib.abc.Loader.create_module` (lança um :exc:`DeprecationWarning` agora, será um erro no Python 3.6). Se o carregador herda de :class:`importlib.abc.Loader`, então não há nada a fazer, caso contrário, defina simplesmente :meth:`~importlib.abc.Loader.create_module` para devolver ``None``. (Contribuído por Brett Cannon em :issue:`23014`.)

source: The :func:`re.split` function always ignored empty pattern matches, so the ``"x*"`` pattern worked the same as ``"x+"``, and the ``"\b"`` pattern never worked. Now :func:`re.split` raises a warning if the pattern could match an empty string. For compatibility, use patterns that never match an empty string (e.g. ``"x+"`` instead of ``"x*"``). Patterns that could only match an empty string (such as ``"\b"``) now raise an error. (Contributed by Serhiy Storchaka in :issue:`22818`.)
pt_pt: A função :func:`re.split` sempre ignorou correspondências de padrões vazios, por isso o padrão ``"x*"`` funcionava da mesma forma que ``"x+"``, e o padrão ``"\b"`` nunca funcionou. Agora, :func:`re.split` lança um aviso se o padrão puder corresponder a uma *string* vazia. Para compatibilidade, use padrões que nunca correspondam a uma *string* vazia (por exemplo, ``"x+"`` em vez de ``"x*"``). Padrões que só possam corresponder a uma *string* vazia (como ``"\b"``) agora lançam um erro. (Contribuído por Serhiy Storchaka em :issue:`22818`.)
ru: Функция :func:`re.split` всегда игнорировала пустые совпадения с шаблонами, поэтому шаблон ``"x*"`` работал так же, как ``"x+"``, а шаблон ``"\b"`` никогда не работал. Теперь :func:`re.split` выдает предупреждение, если шаблон может соответствовать пустой строке. Для совместимости используйте шаблоны, которые никогда не соответствуют пустой строке (например, ``"x+"`` вместо ``"x*"``. Шаблоны, которые могут соответствовать только пустой строке (например, ``"\b"``), теперь вызывают ошибку. (Предоставлено Сергеем Сторчакой в ​​:issue:`22818`.)
sv: Funktionen :func:`re.split` ignorerade alltid tomma mönstermatchningar, så mönstret ``"x*"`` fungerade på samma sätt som ``"x+"``, och mönstret ``"\b"`` fungerade aldrig. Nu ger :func:`re.split` upphov till en varning om mönstret kan matcha en tom sträng. För kompatibilitet, använd mönster som aldrig matchar en tom sträng (t.ex. ``"x+"`` istället för ``"x*"``). Mönster som bara kunde matcha en tom sträng (t.ex. ``"\b"``) ger nu upphov till ett fel. (Bidrag från Serhiy Storchaka i :issue:`22818`.)

source: The :class:`http.cookies.Morsel` dict-like interface has been made self consistent: morsel comparison now takes the :attr:`~http.cookies.Morsel.key` and :attr:`~http.cookies.Morsel.value` into account, :meth:`~http.cookies.Morsel.copy` now results in a :class:`~http.cookies.Morsel` instance rather than a :class:`dict`, and :meth:`~http.cookies.Morsel.update` will now raise an exception if any of the keys in the update dictionary are invalid. In addition, the undocumented *LegalChars* parameter of :func:`~http.cookies.Morsel.set` is deprecated and is now ignored. (Contributed by Demian Brecht in :issue:`2211`.)
pt_pt: A interface semelhante a dicionário de :class:`http.cookies.Morsel` foi tornada auto-consistente: a comparação de *morsel* agora tem em conta o :attr:`~http.cookies.Morsel.key` e :attr:`~http.cookies.Morsel.value`, :meth:`~http.cookies.Morsel.copy` agora resulta numa instância :class:`~http.cookies.Morsel` em vez de um :class:`dict`, e :meth:`~http.cookies.Morsel.update` agora lançará uma exceção se alguma das chaves no dicionário de atualização for inválida. Além disso, o parâmetro não documentado *LegalChars* de :func:`~http.cookies.Morsel.set` está obsoleto e agora é ignorado. (Contribuído por Demian Brecht em :issue:`2211`.)
ru: Диктообразный интерфейс :class:`http.cookies.Morsel` стал самосогласованным: сравнение кусочков теперь использует :attr:`~http.cookies.Morsel.key` и :attr:`~http.cookies.Morsel` .value`, :meth:`~http.cookies.Morsel.copy` теперь приводит к созданию экземпляра :class:`~http.cookies.Morsel` вместо :class:`dict` и :meth:` ~http.cookies.Morsel.update` теперь будет вызывать исключение, если какой-либо из ключей в словаре обновления недействителен. Кроме того, недокументированный параметр *LegalChars* файла :func:`~http.cookies.Morsel.set` устарел и теперь игнорируется. (Предоставлено Демианом Брехтом в :issue:`2211`.)
sv: Det diktliknande gränssnittet :class:`http.cookies.Morsel` har gjorts självkonsistent: Morsel-jämförelse tar nu hänsyn till :attr:`~http.cookies.Morsel.key` och :attr:`~http.cookies.Morsel.value`, :meth:`~http.cookies.Morsel.copy` resulterar nu i en :class:`~http.cookies.Morsel`\-instans snarare än en :class:`dict`, och :meth:`~http.cookies.Morsel.update` kommer nu att ge upphov till ett undantag om någon av nycklarna i uppdateringsordlistan är ogiltig. Dessutom är den odokumenterade parametern *LegalChars* i :func:`~http.cookies.Morsel.set` föråldrad och ignoreras nu. (Bidrag från Demian Brecht i :issue:`2211`.)

source: :pep:`488` has removed ``.pyo`` files from Python and introduced the optional ``opt-`` tag in ``.pyc`` file names. The :func:`importlib.util.cache_from_source` has gained an *optimization* parameter to help control the ``opt-`` tag. Because of this, the *debug_override* parameter of the function is now deprecated. ``.pyo`` files are also no longer supported as a file argument to the Python interpreter and thus serve no purpose when distributed on their own (i.e. sourceless code distribution). Due to the fact that the magic number for bytecode has changed in Python 3.5, all old ``.pyo`` files from previous versions of Python are invalid regardless of this PEP.
pt_pt: A :pep:`488` removeu os ficheiros ``.pyo`` do Python e introduziu a etiqueta opcional ``opt-`` nos nomes de ficheiros ``.pyc``. A função :func:`importlib.util.cache_from_source` ganhou um parâmetro *optimization* para ajudar a controlar a etiqueta ``opt-``. Devido a isto, o parâmetro *debug_override* da função agora está obsoleto. Os ficheiros ``.pyo`` também já não são suportados como argumento de ficheiro para o interpretador Python e, portanto, não servem para nada quando distribuídos sozinhos (ou seja, distribuição de código sem fonte). Devido ao facto de o número mágico para *bytecode* ter mudado no Python 3.5, todos os antigos ficheiros ``.pyo`` de versões anteriores do Python são inválidos independentemente desta PEP.
ru: :pep:`488` удалил файлы ``.pyo`` из Python и добавил дополнительный тег ``opt-`` в имена файлов ``.pyc``. :func:`importlib.util.cache_from_source` получил параметр *optimization*, помогающий управлять тегом ``opt-``. По этой причине параметр *debug_override* функции объявлен устаревшим. Файлы ``.pyo`` также больше не поддерживаются в качестве файлового аргумента интерпретатора Python и, таким образом, не имеют смысла при распространении самостоятельно (т. е. при распространении кода без исходного кода). В связи с тем, что магическое число байт-кода изменилось в Python 3.5, все старые файлы ``.pyo`` из предыдущих версий Python недействительны независимо от этого PEP.
sv: :pep:`488` har tagit bort ``.pyo``\-filer från Python och infört den valfria taggen ``opt-`` i ``.pyc``\-filnamn. :func:`importlib.util.cache_from_source` har fått en *optimization* -parameter för att hjälpa till att kontrollera taggen ``opt-``. På grund av detta är parametern *debug_override* i funktionen nu föråldrad. ``.pyo``\-filer stöds inte längre som filargument till Python-tolken och har därför ingen funktion när de distribueras separat (dvs. distribution av källkod utan källkod). Eftersom det magiska talet för bytecode har ändrats i Python 3.5 är alla gamla ``.pyo``\-filer från tidigare versioner av Python ogiltiga, oavsett denna PEP.

source: The :mod:`socket` module now exports the :const:`~socket.CAN_RAW_FD_FRAMES` constant on linux 3.6 and greater.
pt_pt: O módulo :mod:`socket` agora exporta a constante :const:`~socket.CAN_RAW_FD_FRAMES` no Linux 3.6 e superior.
ru: Модуль :mod:`socket` теперь экспортирует константу :const:`~socket.CAN_RAW_FD_FRAMES` в Linux 3.6 и более поздних версиях.
sv: Modulen :mod:`socket` exporterar nu konstanten :const:`~socket.CAN_RAW_FD_FRAMES` på linux 3.6 och senare.

source: The :func:`ssl.cert_time_to_seconds` function now interprets the input time as UTC and not as local time, per :rfc:`5280`. Additionally, the return value is always an :class:`int`. (Contributed by Akira Li in :issue:`19940`.)
pt_pt: A função :func:`ssl.cert_time_to_seconds` agora interpreta o tempo de entrada como UTC e não como hora local, de acordo com :rfc:`5280`. Além disso, o valor de retorno é sempre um :class:`int`. (Contribuído por Akira Li em :issue:`19940`.)
ru: Функция :func:`ssl.cert_time_to_секундs` теперь интерпретирует входное время как время в формате UTC, а не как местное время, согласно :rfc:`5280`. Кроме того, возвращаемым значением всегда является :class:`int`. (Предоставлено Акирой Ли в :issue:`19940`.)
sv: Funktionen :func:`ssl.cert_time_to_seconds` tolkar nu inmatad tid som UTC och inte som lokal tid, enligt :rfc:`5280`. Dessutom är returvärdet alltid en :class:`int`. (Bidrag från Akira Li i :issue:`19940`.)

source: The ``pygettext.py`` Tool now uses the standard +NNNN format for timezones in the POT-Creation-Date header.
pt_pt: A ferramenta ``pygettext.py`` agora usa o formato padrão +NNNN para fusos horários no cabeçalho POT-Creation-Date.
ru: Инструмент ``pygettext.py`` теперь использует стандартный формат +NNNN для часовых поясов в заголовке POT-Creation-Date.
sv: Verktyget ``pygettext.py`` använder nu standardformatet +NNNN för tidszoner i rubriken POT-Creation-Date.
