Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: A new :func:`!set_coroutine_wrapper` function allows setting a global hook that will be called whenever a :term:`coroutine object <coroutine>` is created by an :keyword:`async def` function. A corresponding :func:`!get_coroutine_wrapper` can be used to obtain a currently set wrapper. Both functions are :term:`provisional <provisional API>`, and are intended for debugging purposes only. (Contributed by Yury Selivanov in :issue:`24017`.)
pt_pt: Uma nova função :func:`!set_coroutine_wrapper` permite definir um *hook* global que será chamado sempre que um :term:`objeto *coroutine* <coroutine>` for criado por uma função :keyword:`async def`. Uma função correspondente :func:`!get_coroutine_wrapper` pode ser usada para obter o *wrapper* atualmente definido. Ambas as funções são :term:`provisórias <provisional API>`, e são destinadas apenas a fins de depuração. (Contribuído por Yury Selivanov em :issue:`24017`.)

source: A new :func:`~sys.is_finalizing` function can be used to check if the Python interpreter is :term:`shutting down <interpreter shutdown>`. (Contributed by Antoine Pitrou in :issue:`22696`.)
pt_pt: Uma nova função :func:`~sys.is_finalizing` pode ser usada para verificar se o interpretador Python está a :term:`terminar <interpreter shutdown>`. (Contribuído por Antoine Pitrou em :issue:`22696`.)
ru: Новую функцию :func:`~sys.is_finalizing` можно использовать для проверки того, :term:`выключается ли интерпретатор Python <интерпретатор завершение работы>`. (Предоставлено Антуаном Питру в :issue:`22696`.)
sv: En ny :func:`~sys.is_finalizing`\-funktion kan användas för att kontrollera om Python-tolken :term:`stänger ner <interpreter shutdown>`. (Bidrag från Antoine Pitrou i :issue:`22696`.)

source: The name of the user scripts directory on Windows now includes the first two components of the Python version. (Contributed by Paul Moore in :issue:`23437`.)
pt_pt: O nome do diretório de *scripts* do utilizador no Windows agora inclui os dois primeiros componentes da versão do Python. (Contribuído por Paul Moore em :issue:`23437`.)
ru: Имя каталога пользовательских сценариев в Windows теперь включает первые два компонента версии Python. (Предоставлено Полом Муром в :issue:`23437`.)
sv: Namnet på katalogen för användarskript i Windows innehåller nu de två första komponenterna i Python-versionen. (Bidrag från Paul Moore i :issue:`23437`.)

source: The *mode* argument of the :func:`~tarfile.open` function now accepts ``"x"`` to request exclusive creation. (Contributed by Berker Peksag in :issue:`21717`.)
pt_pt: O argumento *mode* da função :func:`~tarfile.open` agora aceita ``"x"`` para solicitar criação exclusiva. (Contribuído por Berker Peksag em :issue:`21717`.)
ru: Аргумент *mode* функции :func:`~tarfile.open` теперь принимает ``"x"`` для запроса эксклюзивного создания. (Предоставлено Беркером Пексагом в :issue:`21717`.)
sv: Argumentet *mode* i funktionen :func:`~tarfile.open` accepterar nu ``"x"`` för att begära exklusiv skapelse. (Bidrag från Berker Peksag i :issue:`21717`.)

source: The :meth:`TarFile.extractall() <tarfile.TarFile.extractall>` and :meth:`TarFile.extract() <tarfile.TarFile.extract>` methods now take a keyword argument *numeric_owner*. If set to ``True``, the extracted files and directories will be owned by the numeric ``uid`` and ``gid`` from the tarfile. If set to ``False`` (the default, and the behavior in versions prior to 3.5), they will be owned by the named user and group in the tarfile. (Contributed by Michael Vogt and Eric Smith in :issue:`23193`.)
pt_pt: Os métodos :meth:`TarFile.extractall() <tarfile.TarFile.extractall>` e :meth:`TarFile.extract() <tarfile.TarFile.extract>` agora aceitam um argumento de palavra-chave *numeric_owner*. Se definido como ``True``, os ficheiros e diretórios extraídos serão propriedade do ``uid`` e ``gid`` numéricos do ficheiro tar. Se definido como ``False`` (o predefinido, e o comportamento em versões anteriores à 3.5), serão propriedade do utilizador e grupo nomeados no ficheiro tar. (Contribuído por Michael Vogt e Eric Smith em :issue:`23193`.)
ru: Методы :meth:`TarFile.extractall() <tarfile.TarFile.extractall>` и :meth:`TarFile.extract() <tarfile.TarFile.extract>` теперь принимают аргумент ключевого слова *numeric_owner*. Если установлено значение True, извлеченные файлы и каталоги будут принадлежать числовым идентификаторам uid и gid из tar-файла. Если установлено значение «False» (по умолчанию и поведение в версиях до 3.5), они будут принадлежать указанному пользователю и группе в tar-файле. (Предоставлено Майклом Фогтом и Эриком Смитом в :issue:`23193`.)
sv: Metoderna :meth:`TarFile.extractall() <tarfile.TarFile.extractall>` och :meth:`TarFile.extract() <tarfile.TarFile.extract>` tar nu ett nyckelordsargument *numeric_owner*. Om det sätts till ``True`` kommer de extraherade filerna och katalogerna att ägas av de numeriska ``uid`` och ``gid`` från tarfilen. Om inställningen är ``False`` (standard och beteendet i versioner före 3.5) kommer de att ägas av den namngivna användaren och gruppen i tarfilen. (Bidrag från Michael Vogt och Eric Smith i :issue:`23193`.)

source: The :meth:`TarFile.list() <tarfile.TarFile.list>` now accepts an optional *members* keyword argument that can be set to a subset of the list returned by :meth:`TarFile.getmembers() <tarfile.TarFile.getmembers>`. (Contributed by Serhiy Storchaka in :issue:`21549`.)
pt_pt: O método :meth:`TarFile.list() <tarfile.TarFile.list>` agora aceita um argumento de palavra-chave opcional *members* que pode ser definido como um subconjunto da lista devolvida por :meth:`TarFile.getmembers() <tarfile.TarFile.getmembers>`. (Contribuído por Serhiy Storchaka em :issue:`21549`.)
ru: :meth:`TarFile.list() <tarfile.TarFile.list>` теперь принимает необязательный аргумент ключевого слова *members*, который может быть установлен в подмножество списка, возвращаемого :meth:`TarFile.getmembers() <tarfile .TarFile.getmembers>`. (Добавлен Сергеем Сторчакой в ​​:issue:`21549`.)
sv: :meth:`TarFile.list() <tarfile.TarFile.list>` accepterar nu ett valfritt *members* nyckelordsargument som kan ställas in till en delmängd av listan som returneras av :meth:`TarFile.getmembers() <tarfile.TarFile.getmembers>`. (Bidrag från Serhiy Storchaka i :issue:`21549`.)

source: Both the :meth:`Lock.acquire() <threading.Lock.acquire>` and :meth:`RLock.acquire() <threading.RLock.acquire>` methods now use a monotonic clock for timeout management. (Contributed by Victor Stinner in :issue:`22043`.)
pt_pt: Tanto o método :meth:`Lock.acquire() <threading.Lock.acquire>` como o método :meth:`RLock.acquire() <threading.RLock.acquire>` agora usam um relógio monótono para gestão de *timeout*. (Contribuído por Victor Stinner em :issue:`22043`.)
ru: Оба метода :meth:`Lock.acquire() <threading.Lock.acquire>` и :meth:`RLock.acquire() <threading.RLock.acquire>` теперь используют монотонные часы для управления тайм-аутом. (Предоставлено Виктором Стиннером в :issue:`22043`.)
sv: Både metoderna :meth:`Lock.acquire() <threading.Lock.acquire>` och :meth:`RLock.acquire() <threading.RLock.acquire>` använder nu en monoton klocka för timeout-hantering. (Bidrag från Victor Stinner i :issue:`22043`.)

source: The :func:`~time.monotonic` function is now always available. (Contributed by Victor Stinner in :issue:`22043`.)
pt_pt: A função :func:`~time.monotonic` está agora sempre disponível. (Contribuído por Victor Stinner em :issue:`22043`.)
ru: Функция :func:`~time.monotonic` теперь всегда доступна. (Предоставлено Виктором Стиннером в :issue:`22043`.)
sv: Funktionen :func:`~time.monotonic` är nu alltid tillgänglig. (Bidrag från Victor Stinner i :issue:`22043`.)

source: A new command line option ``-u`` or :samp:`--unit={U}` can be used to specify the time unit for the timer output. Supported options are ``usec``, ``msec``, or ``sec``. (Contributed by Julian Gindi in :issue:`18983`.)
pt_pt: Uma nova opção de linha de comandos ``-u`` ou :samp:`--unit={U}` pode ser usada para especificar a unidade de tempo para a saída do temporizador. As opções suportadas são ``usec``, ``msec`` ou ``sec``. (Contribuído por Julian Gindi em :issue:`18983`.)
ru: Новая опция командной строки ``-u`` или :samp:`--unit={U}` может использоваться для указания единицы времени для вывода таймера. Поддерживаемые параметры: usec, msec или sec. (Предоставлено Джулианом Гинди в :issue:`18983`.)
sv: Ett nytt kommandoradsalternativ ``\-u`` eller :samp:`\--unit={U}` kan användas för att ange tidsenheten för timerutmatningen. Alternativ som stöds är ``usec``, ``msec`` eller ``sec``. (Bidrag från Julian Gindi i :issue:`18983`.)

source: The :func:`~timeit.timeit` function has a new *globals* parameter for specifying the namespace in which the code will be running. (Contributed by Ben Roberts in :issue:`2527`.)
pt_pt: A função :func:`~timeit.timeit` tem um novo parâmetro *globals* para especificar o espaço de nomes no qual o código será executado. (Contribuído por Ben Roberts em :issue:`2527`.)
ru: Функция :func:`~timeit.timeit` имеет новый параметр *globals* для указания пространства имен, в котором будет выполняться код. (Предоставлено Беном Робертсом в :issue:`2527`.)
sv: Funktionen :func:`~timeit.timeit` har en ny *globals*-parameter för att ange namnrymden där koden kommer att köras. (Bidrag från Ben Roberts i :issue:`2527`.)

source: The :mod:`!tkinter._fix` module used for setting up the Tcl/Tk environment on Windows has been replaced by a private function in the :mod:`!_tkinter` module which makes no permanent changes to environment variables. (Contributed by Zachary Ware in :issue:`20035`.)
pt_pt: O módulo :mod:`!tkinter._fix` usado para configurar o ambiente Tcl/Tk no Windows foi substituído por uma função privada no módulo :mod:`!_tkinter` que não faz alterações permanentes às variáveis de ambiente. (Contribuído por Zachary Ware em :issue:`20035`.)
sv: Modulen :mod:`!tkinter._fix` som används för att ställa in Tcl/Tk-miljön i Windows har ersatts av en privat funktion i modulen :mod:`!_tkinter` som inte gör några permanenta ändringar i miljövariabler. (Bidrag från Zachary Ware i :issue:`20035`.)

source: New :func:`~traceback.walk_stack` and :func:`~traceback.walk_tb` functions to conveniently traverse frame and :ref:`traceback objects <traceback-objects>`. (Contributed by Robert Collins in :issue:`17911`.)
pt_pt: Novas funções :func:`~traceback.walk_stack` e :func:`~traceback.walk_tb` para percorrer convenientemente *frames* e :ref:`objetos *traceback* <traceback-objects>`. (Contribuído por Robert Collins em :issue:`17911`.)
ru: Новые функции :func:`~traceback.walk_stack` и :func:`~traceback.walk_tb` для удобного перемещения по кадру и :ref:`объектов трассировки <traceback-objects>`. (Предоставлено Робертом Коллинзом в :issue:`17911`.)
sv: Nya :func:`~traceback.walk_stack` och :func:`~traceback.walk_tb` funktioner för att enkelt korsa frame och :ref:`traceback objects <traceback-objects>`. (Bidrag från Robert Collins i :issue:`17911`.)

source: New lightweight classes: :class:`~traceback.TracebackException`, :class:`~traceback.StackSummary`, and :class:`~traceback.FrameSummary`. (Contributed by Robert Collins in :issue:`17911`.)
pt_pt: Novas classes leves: :class:`~traceback.TracebackException`, :class:`~traceback.StackSummary` e :class:`~traceback.FrameSummary`. (Contribuído por Robert Collins em :issue:`17911`.)
ru: Новые облегченные классы: :class:`~traceback.TracebackException`, :class:`~traceback.StackSummary` и :class:`~traceback.FrameSummary`. (Предоставлено Робертом Коллинзом в :issue:`17911`.)
sv: Nya lättviktsklasser: :class:`~traceback.TracebackException`, :class:`~traceback.StackSummary`, och :class:`~traceback.FrameSummary`. (Bidrag från Robert Collins i :issue:`17911`.)

source: Both the :func:`~traceback.print_tb` and :func:`~traceback.print_stack` functions now support negative values for the *limit* argument. (Contributed by Dmitry Kazakov in :issue:`22619`.)
pt_pt: Tanto a função :func:`~traceback.print_tb` como a função :func:`~traceback.print_stack` agora suportam valores negativos para o argumento *limit*. (Contribuído por Dmitry Kazakov em :issue:`22619`.)
ru: Обе функции :func:`~traceback.print_tb` и :func:`~traceback.print_stack` теперь поддерживают отрицательные значения для аргумента *limit*. (Внесено Дмитрием Казаковым в :issue:`22619`.)
sv: Både funktionerna :func:`~traceback.print_tb` och :func:`~traceback.print_stack` stöder nu negativa värden för argumentet *limit*. (Bidrag från Dmitry Kazakov i :issue:`22619`.)

source: A new :func:`~types.coroutine` function to transform :term:`generator <generator iterator>` and :class:`generator-like <collections.abc.Generator>` objects into :term:`awaitables <awaitable>`. (Contributed by Yury Selivanov in :issue:`24017`.)
pt_pt: Uma nova função :func:`~types.coroutine` para transformar objetos :term:`gerador <generator iterator>` e :class:`semelhantes a geradores <collections.abc.Generator>` em :term:`objetos aguardáveis <awaitable>`. (Contribuído por Yury Selivanov em :issue:`24017`.)
ru: Новая функция :func:`~types.coroutine` для преобразования :term:`generator <generator iterator>` и :class:`generator-like <collections.abc.Generator>` в :term:`awaitables <awaitable> `. (Добавлен Юрием Селивановым в :issue:`24017`.)
sv: En ny :func:`~types.coroutine`\-funktion för att omvandla :term:`generator <generator iterator>` och :class:`generatorliknande <collections.abc.Generator>`\-objekt till :term:`awaitables <awaitable>`. (Bidrag från Yury Selivanov i :issue:`24017`.)

source: A new type called :class:`~types.CoroutineType`, which is used for :term:`coroutine` objects created by :keyword:`async def` functions. (Contributed by Yury Selivanov in :issue:`24400`.)
pt_pt: Um novo tipo chamado :class:`~types.CoroutineType`, que é usado para objetos :term:`coroutine` criados por funções :keyword:`async def`. (Contribuído por Yury Selivanov em :issue:`24400`.)
ru: Новый тип под названием :class:`~types.CoroutineType`, который используется для объектов :term:`coroutine`, созданных функциями :keyword:`async def`. (Добавлен Юрием Селивановым в :issue:`24400`.)
sv: En ny typ kallad :class:`~types.CoroutineType`, som används för :term:`coroutine`\-objekt som skapas av :keyword:`async def`\-funktioner. (Bidrag från Yury Selivanov i :issue:`24400`.)

source: The :mod:`unicodedata` module now uses data from `Unicode 8.0.0 <https://unicode.org/versions/Unicode8.0.0/>`_.
pt_pt: O módulo :mod:`unicodedata` agora usa dados do `Unicode 8.0.0 <https://unicode.org/versions/Unicode8.0.0/>`_.
ru: Модуль :mod:`unicodedata` теперь использует данные из `Unicode 8.0.0 <https://unicode.org/versions/Unicode8.0.0/>`_.
sv: Modulen :mod:`unicodedata` använder nu data från `Unicode 8.0.0 <https://unicode.org/versions/Unicode8.0.0/>`_.

source: The :meth:`TestLoader.loadTestsFromModule() <unittest.TestLoader.loadTestsFromModule>` method now accepts a keyword-only argument *pattern* which is passed to ``load_tests`` as the third argument. Found packages are now checked for ``load_tests`` regardless of whether their path matches *pattern*, because it is impossible for a package name to match the default pattern. (Contributed by Robert Collins and Barry A. Warsaw in :issue:`16662`.)
pt_pt: O método :meth:`TestLoader.loadTestsFromModule() <unittest.TestLoader.loadTestsFromModule>` agora aceita um argumento apenas por palavra-chave *pattern* que é passado para ``load_tests`` como terceiro argumento. Os pacotes encontrados agora são verificados quanto a ``load_tests`` independentemente de o seu caminho corresponder a *pattern*, porque é impossível que um nome de pacote corresponda ao padrão predefinido. (Contribuído por Robert Collins e Barry A. Warsaw em :issue:`16662`.)
ru: Метод :meth:`TestLoader.loadTestsFromModule() <unittest.TestLoader.loadTestsFromModule>` теперь принимает аргумент, содержащий только ключевые слова, *pattern*, который передается в ``load_tests`` в качестве третьего аргумента. Найденные пакеты теперь проверяются на предмет ``load_tests`` независимо от того, соответствует ли их путь *шаблону*, поскольку невозможно, чтобы имя пакета соответствовало шаблону по умолчанию. (Предоставлено Робертом Коллинзом и Барри А. Варшавой в :issue:`16662`.)
sv: Metoden :meth:`TestLoader.loadTestsFromModule() <unittest.TestLoader.loadTestsFromModule>` accepterar nu ett nyckelordsspecifikt argument *pattern* som skickas till ``load_tests`` som det tredje argumentet. Hittade paket kontrolleras nu för ``load_tests`` oavsett om deras sökväg matchar *pattern*, eftersom det är omöjligt för ett paketnamn att matcha standardmönstret. (Bidrag från Robert Collins och Barry A. Warsaw i :issue:`16662`.)

source: Unittest discovery errors now are exposed in the :data:`TestLoader.errors <unittest.TestLoader.errors>` attribute of the :class:`~unittest.TestLoader` instance. (Contributed by Robert Collins in :issue:`19746`.)
pt_pt: Os erros de descoberta de *unittest* agora são expostos no atributo :data:`TestLoader.errors <unittest.TestLoader.errors>` da instância :class:`~unittest.TestLoader`. (Contribuído por Robert Collins em :issue:`19746`.)
ru: Ошибки обнаружения Unittest теперь отображаются в атрибуте :data:`TestLoader.errors <unittest.TestLoader.errors>` экземпляра :class:`~unittest.TestLoader`. (Предоставлено Робертом Коллинзом в :issue:`19746`.)
sv: Unittest discovery errors visas nu i attributet :data:`TestLoader.errors <unittest.TestLoader.errors>` i instansen :class:`~unittest.TestLoader`. (Bidrag från Robert Collins i :issue:`19746`.)

source: A new command line option ``--locals`` to show local variables in tracebacks. (Contributed by Robert Collins in :issue:`22936`.)
pt_pt: Uma nova opção de linha de comandos ``--locals`` para mostrar variáveis locais em *tracebacks*. (Contribuído por Robert Collins em :issue:`22936`.)
ru: Новая опция командной строки ``--locals`` для отображения локальных переменных в обратных трассировках. (Предоставлено Робертом Коллинзом в :issue:`22936`.)
sv: Ett nytt kommandoradsalternativ ``\--locals`` för att visa lokala variabler i spårningar. (Bidrag från Robert Collins i :issue:`22936`.)

source: The :class:`~unittest.mock.Mock` class has the following improvements:
pt_pt: A classe :class:`~unittest.mock.Mock` tem as seguintes melhorias:
ru: Класс :class:`~unittest.mock.Mock` имеет следующие улучшения:
sv: Klassen :class:`~unittest.mock.Mock` har följande förbättringar:

source: The class constructor has a new *unsafe* parameter, which causes mock objects to raise :exc:`AttributeError` on attribute names starting with ``"assert"``. (Contributed by Kushal Das in :issue:`21238`.)
pt_pt: O construtor da classe tem um novo parâmetro *unsafe*, que faz com que os objetos *mock* lançem :exc:`AttributeError` em nomes de atributos que comecem com ``"assert"``. (Contribuído por Kushal Das em :issue:`21238`.)
ru: Конструктор класса имеет новый параметр *unsafe*, который заставляет фиктивные объекты вызывать :exc:`AttributeError` для имен атрибутов, начинающихся с ``"assert"``. (Предоставлено Кушалом Дасом в :issue:`21238`.)
sv: Klassens konstruktor har en ny *unsafe* parameter, som gör att mock-objekt ger upphov till :exc:`AttributeError` på attributnamn som börjar med ``"assert"``. (Bidrag från Kushal Das i :issue:`21238`.)

source: A new :meth:`Mock.assert_not_called() <unittest.mock.Mock.assert_not_called>` method to check if the mock object was called. (Contributed by Kushal Das in :issue:`21262`.)
pt_pt: Um novo método :meth:`Mock.assert_not_called() <unittest.mock.Mock.assert_not_called>` para verificar se o objeto *mock* foi chamado. (Contribuído por Kushal Das em :issue:`21262`.)
ru: Новый метод :meth:`Mock.assert_not_ Called() <unittest.mock.Mock.assert_not_ Called>` для проверки того, был ли вызван макетный объект. (Предоставлено Кушалом Дасом в :issue:`21262`.)
sv: En ny :meth:`Mock.assert_not_called() <unittest.mock.Mock.assert_not_called>` metod för att kontrollera om mock-objektet anropades. (Bidrag från Kushal Das i :issue:`21262`.)

source: The :class:`~unittest.mock.MagicMock` class now supports :meth:`~object.__truediv__`, :meth:`~object.__divmod__` and :meth:`~object.__matmul__` operators. (Contributed by Johannes Baiter in :issue:`20968`, and Håkan Lövdahl in :issue:`23581` and :issue:`23568`.)
pt_pt: A classe :class:`~unittest.mock.MagicMock` agora suporta os operadores :meth:`~object.__truediv__`, :meth:`~object.__divmod__` e :meth:`~object.__matmul__`. (Contribuído por Johannes Baiter em :issue:`20968`, e Håkan Lövdahl em :issue:`23581` e :issue:`23568`.)

source: It is no longer necessary to explicitly pass ``create=True`` to the :func:`~unittest.mock.patch` function when patching builtin names. (Contributed by Kushal Das in :issue:`17660`.)
pt_pt: Já não é necessário passar explicitamente ``create=True`` para a função :func:`~unittest.mock.patch` ao aplicar *patches* a nomes integrados. (Contribuído por Kushal Das em :issue:`17660`.)
ru: Больше нет необходимости явно передавать ``create=True`` в функцию :func:`~unittest.mock.patch` при исправлении встроенных имен. (Предоставлено Кушалом Дасом в :issue:`17660`.)
sv: Det är inte längre nödvändigt att uttryckligen skicka ``create=True`` till :func:`~unittest.mock.patch`\-funktionen när man patchar inbyggda namn. (Bidrag från Kushal Das i :issue:`17660`.)

source: A new :class:`request.HTTPPasswordMgrWithPriorAuth <urllib.request.HTTPPasswordMgrWithPriorAuth>` class allows HTTP Basic Authentication credentials to be managed so as to eliminate unnecessary ``401`` response handling, or to unconditionally send credentials on the first request in order to communicate with servers that return a ``404`` response instead of a ``401`` if the ``Authorization`` header is not sent. (Contributed by Matej Cepl in :issue:`19494` and Akshit Khurana in :issue:`7159`.)
pt_pt: Uma nova classe :class:`request.HTTPPasswordMgrWithPriorAuth <urllib.request.HTTPPasswordMgrWithPriorAuth>` permite gerir credenciais de Autenticação Básica HTTP de forma a eliminar o tratamento desnecessário de respostas ``401``, ou enviar incondicionalmente credenciais na primeira solicitação para comunicar com servidores que devolvem uma resposta ``404`` em vez de ``401`` se o cabeçalho ``Authorization`` não for enviado. (Contribuído por Matej Cepl em :issue:`19494` e Akshit Khurana em :issue:`7159`.)
ru: Новый класс :class:`request.HTTPPasswordMgrWithPriorAuth <urllib.request.HTTPPasswordMgrWithPriorAuth>` позволяет управлять учетными данными базовой аутентификации HTTP, чтобы исключить ненужную обработку ответа ``401`` или безоговорочно отправлять учетные данные при первом запросе по порядку. для связи с серверами, которые возвращают ответ «404» вместо «401», если заголовок «Authorization» не отправлен. (Предоставлено Матеем Чеплом в :issue:`19494` и Акшитом Хураной в :issue:`7159`.)
sv: En ny :class:`request.HTTPPasswordMgrWithPriorAuth <urllib.request.HTTPPasswordMgrWithPriorAuth>` gör det möjligt att hantera HTTP Basic Authentication-autentiseringsuppgifter för att eliminera onödig hantering av ``401``\-svar, eller för att villkorslöst skicka autentiseringsuppgifter vid den första begäran för att kommunicera med servrar som returnerar ett ``404``\-svar istället för ett ``401``\-svar om ``Authorization``\-rubriken inte skickas. (Bidrag från Matej Cepl i :issue:`19494` och Akshit Khurana i :issue:`7159`.)
