Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: Both the :class:`~inspect.Signature` and :class:`~inspect.Parameter` classes are now picklable and hashable. (Contributed by Yury Selivanov in :issue:`20726` and :issue:`20334`.)
pt_pt: Tanto a classe :class:`~inspect.Signature` como a classe :class:`~inspect.Parameter` são agora *picklable* e *hashable*. (Contribuído por Yury Selivanov em :issue:`20726` e :issue:`20334`.)
ru: Оба класса :class:`~inspect.Signature` и :class:`~inspect.Parameter` теперь можно выбирать и хешировать. (Добавлено Юрием Селивановым в :issue:`20726` и :issue:`20334`.)
sv: Både klasserna :class:`~inspect.Signature` och :class:`~inspect.Parameter` är nu picklable och hashable. (Bidrag från Yury Selivanov i :issue:`20726` och :issue:`20334`.)

source: A new :meth:`BoundArguments.apply_defaults() <inspect.BoundArguments.apply_defaults>` method provides a way to set default values for missing arguments::
pt_pt: Um novo método :meth:`BoundArguments.apply_defaults() <inspect.BoundArguments.apply_defaults>` fornece uma forma de definir valores predefinidos para argumentos em falta::
ru: Новый метод :meth:`BoundArguments.apply_defaults() <inspect.BoundArguments.apply_defaults>` предоставляет возможность установить значения по умолчанию для отсутствующих аргументов:
sv: En ny metod :meth:`BoundArguments.apply_defaults() <inspect.BoundArguments.apply_defaults>` ger möjlighet att ange standardvärden för saknade argument::

source: (Contributed by Yury Selivanov in :issue:`24190`.)
pt_pt: (Contribuído por Yury Selivanov em :issue:`24190`.)
sv: (Bidrag från Yury Selivanov i :issue:`24190`.)

source: A new class method :meth:`Signature.from_callable() <inspect.Signature.from_callable>` makes subclassing of :class:`~inspect.Signature` easier. (Contributed by Yury Selivanov and Eric Snow in :issue:`17373`.)
pt_pt: Um novo método de classe :meth:`Signature.from_callable() <inspect.Signature.from_callable>` facilita a criação de subclasses de :class:`~inspect.Signature`. (Contribuído por Yury Selivanov e Eric Snow em :issue:`17373`.)
ru: Новый метод класса :meth:`Signature.from_callable() <inspect.Signature.from_callable>` упрощает создание подклассов :class:`~inspect.Signature`. (Предоставлено Юрием Селивановым и Эриком Сноу в :issue:`17373`.)
sv: En ny klassmetod :meth:`Signature.from_callable() <inspect.Signature.from_callable>` gör det enklare att underklassa :class:`~inspect.Signature`. (Bidrag från Yury Selivanov och Eric Snow i :issue:`17373`.)

source: The :func:`~inspect.signature` function now accepts a *follow_wrapped* optional keyword argument, which, when set to ``False``, disables automatic following of ``__wrapped__`` links. (Contributed by Yury Selivanov in :issue:`20691`.)
pt_pt: A função :func:`~inspect.signature` agora aceita um argumento opcional de palavra-chave *follow_wrapped*, que, quando definido para ``False``, desativa o seguimento automático de ligações ``__wrapped__``. (Contribuído por Yury Selivanov em :issue:`20691`.)
ru: Функция :func:`~inspect.signature` теперь принимает необязательный аргумент ключевого слова *follow_wrapped*, который, если установлено значение ``False``, отключает автоматическое следование по ссылкам ``__wrapped__``. (Добавлен Юрием Селивановым в :issue:`20691`.)
sv: Funktionen :func:`~inspect.signature` accepterar nu ett *follow_wrapped* valfritt nyckelordsargument, som när det sätts till ``False`` inaktiverar automatisk följning av ``__wrapped__`` länkar. (Bidrag från Yury Selivanov i :issue:`20691`.)

source: A set of new functions to inspect :term:`coroutine functions <coroutine function>` and :term:`coroutine objects <coroutine>` has been added: :func:`~inspect.iscoroutine`, :func:`~inspect.iscoroutinefunction`, :func:`~inspect.isawaitable`, :func:`~inspect.getcoroutinelocals`, and :func:`~inspect.getcoroutinestate`. (Contributed by Yury Selivanov in :issue:`24017` and :issue:`24400`.)
pt_pt: Um conjunto de novas funções para inspecionar :term:`funções *coroutine* <coroutine function>` e :term:`objetos *coroutine* <coroutine>` foi adicionado: :func:`~inspect.iscoroutine`, :func:`~inspect.iscoroutinefunction`, :func:`~inspect.isawaitable`, :func:`~inspect.getcoroutinelocals` e :func:`~inspect.getcoroutinestate`. (Contribuído por Yury Selivanov em :issue:`24017` e :issue:`24400`.)
ru: Добавлен набор новых функций для проверки :term:`coroutine function <coroutine function>` и :term:`coroutine object <coroutine>`: :func:`~inspect.iscoroutine`, :func:`~inspect. iscoroutinefunction`, :func:`~inspect.isawaitable`, :func:`~inspect.getcoroutinelocals` и :func:`~inspect.getcoroutinestate`. (Добавлено Юрием Селивановым в :issue:`24017` и :issue:`24400`.)
sv: En uppsättning nya funktioner för att inspektera :term:`coroutine functions <coroutine function>` och :term:`coroutine objects <coroutine>` har lagts till: :func:`~inspect.iscoroutine`, :func:`~inspect.iscoroutinefunction`, :func:`~inspect.isawaitable`, :func:`~inspect.getcoroutinelocals`, och :func:`~inspect.getcoroutinestate`. (Bidrag från Yury Selivanov i :issue:`24017` och :issue:`24400`.)

source: The :func:`~inspect.stack`, :func:`~inspect.trace`, :func:`~inspect.getouterframes`, and :func:`~inspect.getinnerframes` functions now return a list of named tuples. (Contributed by Daniel Shahaf in :issue:`16808`.)
pt_pt: As funções :func:`~inspect.stack`, :func:`~inspect.trace`, :func:`~inspect.getouterframes` e :func:`~inspect.getinnerframes` agora devolvem uma lista de *tuples* nomeados. (Contribuído por Daniel Shahaf em :issue:`16808`.)
ru: Функции :func:`~inspect.stack`, :func:`~inspect.trace`, :func:`~inspect.getouterframes` и :func:`~inspect.getinnerframes` теперь возвращают список именованных кортежей. (Предоставлено Дэниелом Шахафом в :issue:`16808`.)
sv: Funktionerna :func:`~inspect.stack`, :func:`~inspect.trace`, :func:`~inspect.getouterframes` och :func:`~inspect.getinnerframes` returnerar nu en lista med namngivna tupler. (Bidrag från Daniel Shahaf i :issue:`16808`.)

source: A new :meth:`BufferedIOBase.readinto1() <io.BufferedIOBase.readinto1>` method, that uses at most one call to the underlying raw stream's :meth:`RawIOBase.read() <io.RawIOBase.read>` or :meth:`RawIOBase.readinto() <io.RawIOBase.readinto>` methods. (Contributed by Nikolaus Rath in :issue:`20578`.)
pt_pt: Um novo método :meth:`BufferedIOBase.readinto1() <io.BufferedIOBase.readinto1>`, que usa no máximo uma chamada aos métodos :meth:`RawIOBase.read() <io.RawIOBase.read>` ou :meth:`RawIOBase.readinto() <io.RawIOBase.readinto>` do fluxo bruto subjacente. (Contribuído por Nikolaus Rath em :issue:`20578`.)
ru: Новый метод :meth:`BufferedIOBase.readinto1() <io.BufferedIOBase.readinto1>`, который использует не более одного вызова :meth:`RawIOBase.read() базового необработанного потока <io.RawIOBase.read>` или :meth:`RawIOBase.readinto() <io.RawIOBase.readinto>` методы. (Предоставлено Николаусом Ратом в :issue:`20578`.)
sv: En ny :meth:`BufferedIOBase.readinto1() <io.BufferedIOBase.readinto1>`\-metod, som använder högst ett anrop till den underliggande råströmmens :meth:`RawIOBase.read() <io.RawIOBase.read>`\- eller :meth:`RawIOBase.readinto() <io.RawIOBase.readinto>`\-metoder. (Bidrag från Nikolaus Rath i :issue:`20578`.)

source: Both the :class:`~ipaddress.IPv4Network` and :class:`~ipaddress.IPv6Network` classes now accept an ``(address, netmask)`` tuple argument, so as to easily construct network objects from existing addresses::
pt_pt: Tanto a classe :class:`~ipaddress.IPv4Network` como a classe :class:`~ipaddress.IPv6Network` agora aceitam um argumento de tuplo ``(address, netmask)``, de forma a construir facilmente objetos de rede a partir de endereços existentes::
ru: Оба класса :class:`~ipaddress.IPv4Network` и :class:`~ipaddress.IPv6Network` теперь принимают аргумент-кортеж ``(адрес, сетевая маска)``, чтобы можно было легко создавать сетевые объекты из существующих адресов:
sv: Både klasserna :class:`~ipaddress.IPv4Network` och :class:`~ipaddress.IPv6Network` accepterar nu ett tuple-argument ``(adress, nätmask)``, så att man enkelt kan konstruera nätverksobjekt från befintliga adresser::

source: (Contributed by Peter Moody and Antoine Pitrou in :issue:`16531`.)
pt_pt: (Contribuído por Peter Moody e Antoine Pitrou em :issue:`16531`.)
ru: (Предоставлено Питером Муди и Антуаном Питру в :issue:`16531`.)
sv: (Bidrag från Peter Moody och Antoine Pitrou i :issue:`16531`.)

source: A new :attr:`~ipaddress.IPv4Address.reverse_pointer` attribute for the :class:`~ipaddress.IPv4Address` and :class:`~ipaddress.IPv6Address` classes returns the name of the reverse DNS PTR record::
pt_pt: Um novo atributo :attr:`~ipaddress.IPv4Address.reverse_pointer` para as classes :class:`~ipaddress.IPv4Address` e :class:`~ipaddress.IPv6Address` devolve o nome do registo PTR de DNS reverso::

source: (Contributed by Leon Weber in :issue:`20480`.)
pt_pt: (Contribuído por Leon Weber em :issue:`20480`.)
ru: (Предоставлено Леоном Вебером в :issue:`20480`.)
sv: (Bidrag från Leon Weber i :issue:`20480`.)

source: The :mod:`json.tool` command line interface now preserves the order of keys in JSON objects passed in input. The new ``--sort-keys`` option can be used to sort the keys alphabetically. (Contributed by Berker Peksag in :issue:`21650`.)
pt_pt: A interface de linha de comandos :mod:`json.tool` agora preserva a ordem das chaves em objetos JSON passados como entrada. A nova opção ``--sort-keys`` pode ser usada para ordenar as chaves alfabéticamente. (Contribuído por Berker Peksag em :issue:`21650`.)
ru: Интерфейс командной строки :mod:`json.tool` теперь сохраняет порядок ключей в объектах JSON, передаваемых на входе. Новую опцию ``--sort-keys`` можно использовать для сортировки ключей в алфавитном порядке. (Предоставлено Беркером Пексагом в :issue:`21650`.)
sv: Kommandoradsgränssnittet :mod:`json.tool` bevarar nu ordningen på nycklarna i JSON-objekt som skickas som indata. Det nya alternativet ``\--sort-keys`` kan användas för att sortera nycklarna i alfabetisk ordning. (Bidrag från Berker Peksag i :issue:`21650`.)

source: JSON decoder now raises :exc:`~json.JSONDecodeError` instead of :exc:`ValueError` to provide better context information about the error. (Contributed by Serhiy Storchaka in :issue:`19361`.)
pt_pt: O descodificador JSON agora lança :exc:`~json.JSONDecodeError` em vez de :exc:`ValueError` para fornecer melhor informação de contexto sobre o erro. (Contribuído por Serhiy Storchaka em :issue:`19361`.)
ru: Декодер JSON теперь вызывает :exc:`~json.JSONDecodeError` вместо :exc:`ValueError`, чтобы предоставить более точную контекстную информацию об ошибке. (Предоставлено Сергеем Сторчакой в ​​:issue:`19361`.)
sv: JSON-avkodaren ger nu upphov till :exc:`~json.JSONDecodeError` istället för :exc:`ValueError` för att ge bättre kontextinformation om felet. (Bidrag från Serhiy Storchaka i :issue:`19361`.)

source: A new :func:`~linecache.lazycache` function can be used to capture information about a non-file-based module to permit getting its lines later via :func:`~linecache.getline`. This avoids doing I/O until a line is actually needed, without having to carry the module globals around indefinitely. (Contributed by Robert Collins in :issue:`17911`.)
pt_pt: Uma nova função :func:`~linecache.lazycache` pode ser usada para capturar informação sobre um módulo não baseado em ficheiros para permitir obter as suas linhas mais tarde através de :func:`~linecache.getline`. Isto evita fazer E/S até que uma linha seja realmente necessária, sem ter de transportar os globais do módulo indefinidamente. (Contribuído por Robert Collins em :issue:`17911`.)
ru: Новую функцию :func:`~linecache.lazycache` можно использовать для сбора информации о модуле, не основанном на файлах, чтобы можно было получить его строки позже через :func:`~linecache.getline`. Это позволяет избежать ввода-вывода до тех пор, пока строка действительно не понадобится, без необходимости бесконечно переносить глобальные переменные модуля. (Предоставлено Робертом Коллинзом в :issue:`17911`.)
sv: En ny :func:`~linecache.lazycache`\-funktion kan användas för att fånga information om en icke-filbaserad modul för att göra det möjligt att hämta dess rader senare via :func:`~linecache.getline`. Detta undviker att göra I/O tills en rad faktiskt behövs, utan att behöva bära med sig modulens globaler på obestämd tid. (Bidrag från Robert Collins i :issue:`17911`.)

source: A new :func:`~locale.delocalize` function can be used to convert a string into a normalized number string, taking the ``LC_NUMERIC`` settings into account::
pt_pt: Uma nova função :func:`~locale.delocalize` pode ser usada para converter uma *string* numa *string* de número normalizada, tendo em conta as definições ``LC_NUMERIC``::
ru: Новую функцию :func:`~locale.delocalize` можно использовать для преобразования строки в нормализованную числовую строку с учетом настроек ``LC_NUMERIC``:
sv: En ny :func:`~locale.delocalize`\-funktion kan användas för att konvertera en sträng till en normaliserad talsträng, med hänsyn till inställningarna för ``LC_NUMERIC``::

source: (Contributed by Cédric Krier in :issue:`13918`.)
pt_pt: (Contribuído por Cédric Krier em :issue:`13918`.)
ru: (Предоставлено Седриком Криером в :issue:`13918`.)
sv: (Bidrag från Cédric Krier i :issue:`13918`.)

source: All logging methods (:class:`~logging.Logger` :meth:`~logging.Logger.log`, :meth:`~logging.Logger.exception`, :meth:`~logging.Logger.critical`, :meth:`~logging.Logger.debug`, etc.), now accept exception instances as an *exc_info* argument, in addition to boolean values and exception tuples::
pt_pt: Todos os métodos de registo (:class:`~logging.Logger` :meth:`~logging.Logger.log`, :meth:`~logging.Logger.exception`, :meth:`~logging.Logger.critical`, :meth:`~logging.Logger.debug`, etc.), agora aceitam instâncias de exceção como um argumento *exc_info*, além de valores booleanos e tuplos de exceção::
ru: Все методы журналирования (:class:`~logging.Logger` :meth:`~logging.Logger.log`, :meth:`~logging.Logger.Exception`, :meth:`~logging.Logger.critical`, : meth:`~logging.Logger.debug` и т. д.), теперь принимают экземпляры исключений в качестве аргумента *exc_info* в дополнение к логическим значениям и кортежам исключений::
sv: Alla logningsmetoder (:class:`~logging.Logger` :meth:`~logging.Logger.log`, :meth:`~logging.Logger.exception`, :meth:`~logging.Logger.critical`, :meth:`~logging.Logger.debug`, etc.) accepterar nu undantagsinstanser som ett *exc_info*-argument, förutom booleska värden och undantagstupler::

source: >>> import logging >>> try: ... 1/0 ... except ZeroDivisionError as ex: ... logging.error('exception', exc_info=ex) ERROR:root:exception
pt_pt: >>> import logging >>> try: ... 1/0 ... except ZeroDivisionError as ex: ... logging.error('exceção', exc_info=ex) ERROR:root:exceção

source: (Contributed by Yury Selivanov in :issue:`20537`.)
pt_pt: (Contribuído por Yury Selivanov em :issue:`20537`.)
sv: (Bidrag från Yury Selivanov i :issue:`20537`.)

source: The :class:`handlers.HTTPHandler <logging.handlers.HTTPHandler>` class now accepts an optional :class:`ssl.SSLContext` instance to configure SSL settings used in an HTTP connection. (Contributed by Alex Gaynor in :issue:`22788`.)
pt_pt: A classe :class:`handlers.HTTPHandler <logging.handlers.HTTPHandler>` agora aceita uma instância opcional :class:`ssl.SSLContext` para configurar as definições SSL usadas numa ligação HTTP. (Contribuído por Alex Gaynor em :issue:`22788`.)
ru: Класс :class:`handlers.HTTPHandler <logging.handlers.HTTPHandler>` теперь принимает необязательный экземпляр :class:`ssl.SSLContext` для настройки параметров SSL, используемых в HTTP-соединении. (Предоставлено Алексом Гейнором в :issue:`22788`.)
sv: Klassen :class:`handlers.HTTPHandler <logging.handlers.HTTPHandler>` accepterar nu en valfri :class:`ssl.SSLContext`\-instans för att konfigurera SSL-inställningar som används i en HTTP-anslutning. (Bidrag från Alex Gaynor i :issue:`22788`.)

source: The :class:`handlers.QueueListener <logging.handlers.QueueListener>` class now takes a *respect_handler_level* keyword argument which, if set to ``True``, will pass messages to handlers taking handler levels into account. (Contributed by Vinay Sajip.)
pt_pt: A classe :class:`handlers.QueueListener <logging.handlers.QueueListener>` agora aceita um argumento de palavra-chave *respect_handler_level* que, se definido para ``True``, passará mensagens para os gestores tendo em conta os níveis dos gestores. (Contribuído por Vinay Sajip.)
ru: Класс :class:`handlers.QueueListener <logging.handlers.QueueListener>` теперь принимает аргумент ключевого слова *respect_handler_level*, который, если установлено значение ``True``, будет передавать сообщения обработчикам с учетом уровней обработчиков. (Предоставлено Винаем Саджипом.)
sv: Klassen :class:`handlers.QueueListener <logging.handlers.QueueListener>` tar nu ett *respect_handler_level* nyckelordsargument som, om det sätts till ``True``, kommer att skicka meddelanden till hanterare som tar hänsyn till hanterarnivåer. (Bidrag från Vinay Sajip.)

source: The :meth:`LZMADecompressor.decompress() <lzma.LZMADecompressor.decompress>` method now accepts an optional *max_length* argument to limit the maximum size of decompressed data. (Contributed by Martin Panter in :issue:`15955`.)
pt_pt: O método :meth:`LZMADecompressor.decompress() <lzma.LZMADecompressor.decompress>` agora aceita um argumento opcional *max_length* para limitar o tamanho máximo dos dados descomprimidos. (Contribuído por Martin Panter em :issue:`15955`.)
ru: Метод :meth:`LZMADecompressor.decompress() <lzma.LZMADecompressor.decompress>` теперь принимает необязательный аргумент *max_length* для ограничения максимального размера распакованных данных. (Предоставлено Мартином Пантером в :issue:`15955`.)
sv: Metoden :meth:`LZMADecompressor.decompress() <lzma.LZMADecompressor.decompress>` accepterar nu ett valfritt *max_length*-argument för att begränsa den maximala storleken på dekomprimerade data. (Bidrag från Martin Panter i :issue:`15955`.)

source: Two new constants have been added to the :mod:`math` module: :data:`~math.inf` and :data:`~math.nan`. (Contributed by Mark Dickinson in :issue:`23185`.)
pt_pt: Duas novas constantes foram adicionadas ao módulo :mod:`math`: :data:`~math.inf` e :data:`~math.nan`. (Contribuído por Mark Dickinson em :issue:`23185`.)
ru: В модуль :mod:`math` были добавлены две новые константы: :data:`~math.inf` и :data:`~math.nan`. (Предоставлено Марком Дикинсоном в :issue:`23185`.)
sv: Två nya konstanter har lagts till i modulen :mod:`math`: :data:`~math.inf` och :data:`~math.nan`. (Bidrag från Mark Dickinson i :issue:`23185`.)

source: A new function :func:`~math.isclose` provides a way to test for approximate equality. (Contributed by Chris Barker and Tal Einat in :issue:`24270`.)
pt_pt: Uma nova função :func:`~math.isclose` fornece uma forma de testar igualdade aproximada. (Contribuído por Chris Barker e Tal Einat em :issue:`24270`.)
ru: Новая функция :func:`~math.isclose` позволяет проверить приблизительное равенство. (Предоставлено Крисом Баркером и Талом Эйнатом в :issue:`24270`.)
sv: En ny funktion :func:`~math.isclose` ger ett sätt att testa för ungefärlig likhet. (Bidrag från Chris Barker och Tal Einat i :issue:`24270`.)

source: A new :func:`~math.gcd` function has been added. The :func:`!fractions.gcd` function is now deprecated. (Contributed by Mark Dickinson and Serhiy Storchaka in :issue:`22486`.)
pt_pt: Uma nova função :func:`~math.gcd` foi adicionada. A função :func:`!fractions.gcd` agora está obsoleta. (Contribuído por Mark Dickinson e Serhiy Storchaka em :issue:`22486`.)

source: multiprocessing
pt_pt: multiprocessamento

source: :func:`sharedctypes.synchronized() <multiprocessing.sharedctypes.synchronized>` objects now support the :term:`context manager` protocol. (Contributed by Charles-François Natali in :issue:`21565`.)
pt_pt: Os objetos :func:`sharedctypes.synchronized() <multiprocessing.sharedctypes.synchronized>` agora suportam o protocolo :term:`gestor de contexto`. (Contribuído por Charles-François Natali em :issue:`21565`.)
ru: Объекты :func:`sharedctypes.synchronized() <multiprocessing.sharedctypes.synchronized>` теперь поддерживают протокол :term:`context Manager`. (Предоставлено Шарлем-Франсуа Натали в :issue:`21565`.)
sv: :func:`sharedctypes.synchronized() <multiprocessing.sharedctypes.synchronized>`\-objekt stöder nu protokollet :term:`context manager`. (Bidrag från Charles-François Natali i :issue:`21565`.)

source: :func:`~operator.attrgetter`, :func:`~operator.itemgetter`, and :func:`~operator.methodcaller` objects now support pickling. (Contributed by Josh Rosenberg and Serhiy Storchaka in :issue:`22955`.)
pt_pt: Os objetos :func:`~operator.attrgetter`, :func:`~operator.itemgetter` e :func:`~operator.methodcaller` agora suportam *pickling*. (Contribuído por Josh Rosenberg e Serhiy Storchaka em :issue:`22955`.)
ru: Объекты :func:`~operator.attrgetter`, :func:`~operator.itemgetter` и :func:`~operator.methodcaller` теперь поддерживают травление. (Предоставлено Джошем Розенбергом и Сергеем Сторчакой в ​​:issue:`22955`.)
sv: objekten :func:`~operator.attrgetter`, :func:`~operator.itemgetter` och :func:`~operator.methodcaller` har nu stöd för pickling. (Bidrag från Josh Rosenberg och Serhiy Storchaka i :issue:`22955`.)

source: New :func:`~operator.matmul` and :func:`~operator.imatmul` functions to perform matrix multiplication. (Contributed by Benjamin Peterson in :issue:`21176`.)
pt_pt: Novas funções :func:`~operator.matmul` e :func:`~operator.imatmul` para realizar multiplicação de matrizes. (Contribuído por Benjamin Peterson em :issue:`21176`.)
ru: Новые функции :func:`~operator.matmul` и :func:`~operator.imatmul` для выполнения умножения матриц. (Предоставлено Бенджамином Петерсоном в :issue:`21176`.)
sv: Nya :func:`~operator.matmul` och :func:`~operator.imatmul` funktioner för att utföra matrismultiplikation. (Bidrag från Benjamin Peterson i :issue:`21176`.)

source: The new :func:`~os.scandir` function returning an iterator of :class:`~os.DirEntry` objects has been added. If possible, :func:`~os.scandir` extracts file attributes while scanning a directory, removing the need to perform subsequent system calls to determine file type or attributes, which may significantly improve performance. (Contributed by Ben Hoyt with the help of Victor Stinner in :issue:`22524`.)
pt_pt: A nova função :func:`~os.scandir`, que devolve um iterador de objetos :class:`~os.DirEntry`, foi adicionada. Se possível, :func:`~os.scandir` extrai atributos de ficheiros enquanto percorre um diretório, eliminando a necessidade de realizar chamadas subsequentes ao sistema para determinar o tipo de ficheiro ou atributos, o que pode melhorar significativamente o desempenho. (Contribuído por Ben Hoyt com a ajuda de Victor Stinner em :issue:`22524`.)
ru: Добавлена ​​новая функция :func:`~os.scandir`, возвращающая итератор объектов :class:`~os.DirEntry`. Если возможно, :func:`~os.scandir` извлекает атрибуты файла при сканировании каталога, устраняя необходимость выполнения последующих системных вызовов для определения типа или атрибутов файла, что может значительно повысить производительность. (Предоставлено Беном Хойтом при помощи Виктора Стиннера в :issue:`22524`.)
sv: Den nya funktionen :func:`~os.scandir` som returnerar en iterator av :class:`~os.DirEntry`\-objekt har lagts till. Om möjligt extraherar :func:`~os.scandir` filattribut medan en katalog skannas, vilket gör att efterföljande systemanrop inte behöver utföras för att bestämma filtyp eller attribut, vilket kan förbättra prestandan avsevärt. (Bidrag från Ben Hoyt med hjälp av Victor Stinner i :issue:`22524`.)
