Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: A new *quote_via* argument for the :func:`parse.urlencode() <urllib.parse.urlencode>` function provides a way to control the encoding of query parts if needed. (Contributed by Samwyse and Arnon Yaari in :issue:`13866`.)
pt_pt: Um novo argumento *quote_via* para a função :func:`parse.urlencode() <urllib.parse.urlencode>` fornece uma forma de controlar a codificação de partes da consulta, se necessário. (Contribuído por Samwyse e Arnon Yaari em :issue:`13866`.)
ru: Новый аргумент *quote_via* для функции :func:`parse.urlencode() <urllib.parse.urlencode>` обеспечивает способ управления кодировкой частей запроса, если это необходимо. (Предоставлено Сэмвайсом и Арноном Яари в :issue:`13866`.)
sv: Ett nytt *quote_via*-argument för funktionen :func:`parse.urlencode() <urllib.parse.urlencode>` ger ett sätt att kontrollera kodningen av frågans delar om det behövs. (Bidrag från Samwyse och Arnon Yaari i :issue:`13866`.)

source: The :func:`request.urlopen() <urllib.request.urlopen>` function accepts an :class:`ssl.SSLContext` object as a *context* argument, which will be used for the HTTPS connection. (Contributed by Alex Gaynor in :issue:`22366`.)
pt_pt: A função :func:`request.urlopen() <urllib.request.urlopen>` aceita um objeto :class:`ssl.SSLContext` como argumento *context*, que será usado para a ligação HTTPS. (Contribuído por Alex Gaynor em :issue:`22366`.)
ru: Функция :func:`request.urlopen() <urllib.request.urlopen>` принимает объект :class:`ssl.SSLContext` в качестве аргумента *context*, который будет использоваться для HTTPS-соединения. (Предоставлено Алексом Гейнором в :issue:`22366`.)
sv: Funktionen :func:`request.urlopen() <urllib.request.urlopen>` accepterar ett :class:`ssl.SSLContext`\-objekt som ett *context*-argument, vilket kommer att användas för HTTPS-anslutningen. (Bidrag från Alex Gaynor i :issue:`22366`.)

source: The :func:`parse.urljoin() <urllib.parse.urljoin>` was updated to use the :rfc:`3986` semantics for the resolution of relative URLs, rather than :rfc:`1808` and :rfc:`2396`. (Contributed by Demian Brecht and Senthil Kumaran in :issue:`22118`.)
pt_pt: A função :func:`parse.urljoin() <urllib.parse.urljoin>` foi atualizada para usar a semântica :rfc:`3986` para a resolução de URLs relativos, em vez de :rfc:`1808` e :rfc:`2396`. (Contribuído por Demian Brecht e Senthil Kumaran em :issue:`22118`.)
ru: :func:`parse.urljoin() <urllib.parse.urljoin>` был обновлен для использования семантики :rfc:`3986` для разрешения относительных URL-адресов, а не :rfc:`1808` и :rfc:` 2396`. (Предоставлено Демианом Брехтом и Сентилом Кумараном в :issue:`22118`.)
sv: :func:`parse.urljoin() <urllib.parse.urljoin>` uppdaterades för att använda :rfc:`3986` semantiken för upplösning av relativa URL:er, snarare än :rfc:`1808` och :rfc:`2396`. (Bidrag från Demian Brecht och Senthil Kumaran i :issue:`22118`.)

source: The *headers* argument of the :class:`headers.Headers <wsgiref.headers.Headers>` class constructor is now optional. (Contributed by Pablo Torres Navarrete and SilentGhost in :issue:`5800`.)
pt_pt: O argumento *headers* do construtor da classe :class:`headers.Headers <wsgiref.headers.Headers>` agora é opcional. (Contribuído por Pablo Torres Navarrete e SilentGhost em :issue:`5800`.)
ru: Аргумент *headers* конструктора класса :class:`headers.Headers <wsgiref.headers.Headers>` теперь является необязательным. (Предоставлено Пабло Торресом Наваррете и SilentGhost в :issue:`5800`.)
sv: Argumentet *headers* i klasskonstruktören :class:`headers.Headers <wsgiref.headers.Headers>` är nu valfritt. (Bidrag från Pablo Torres Navarrete och SilentGhost i :issue:`5800`.)

source: The :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` class now supports the :term:`context manager` protocol. (Contributed by Claudiu Popa in :issue:`20627`.)
pt_pt: A classe :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` agora suporta o protocolo :term:`gestor de contexto`. (Contribuído por Claudiu Popa em :issue:`20627`.)
ru: Класс :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` теперь поддерживает протокол :term:`контекстного менеджера`. (Предоставлено Клаудиу Попа в :issue:`20627`.)
sv: Klassen :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` stöder nu protokollet :term:`context manager`. (Bidrag från Claudiu Popa i :issue:`20627`.)

source: The :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` constructor now accepts an optional :class:`ssl.SSLContext` instance. (Contributed by Alex Gaynor in :issue:`22960`.)
pt_pt: O construtor :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` agora aceita uma instância opcional :class:`ssl.SSLContext`. (Contribuído por Alex Gaynor em :issue:`22960`.)
ru: Конструктор :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` теперь принимает необязательный экземпляр :class:`ssl.SSLContext`. (Предоставлено Алексом Гейнором в :issue:`22960`.)
sv: Konstruktorn :class:`client.ServerProxy <xmlrpc.client.ServerProxy>` accepterar nu en valfri instans av :class:`ssl.SSLContext`. (Bidrag från Alex Gaynor i :issue:`22960`.)

source: SAX parsers now support a character stream of the :class:`xmlreader.InputSource <xml.sax.xmlreader.InputSource>` object. (Contributed by Serhiy Storchaka in :issue:`2175`.)
pt_pt: Os *parsers* SAX agora suportam um fluxo de caracteres do objeto :class:`xmlreader.InputSource <xml.sax.xmlreader.InputSource>`. (Contribuído por Serhiy Storchaka em :issue:`2175`.)
ru: Анализаторы SAX теперь поддерживают поток символов объекта :class:`xmlreader.InputSource <xml.sax.xmlreader.InputSource>`. (Предоставлено Сергеем Сторчакой в ​​:issue:`2175`.)
sv: SAX-parsers stöder nu en teckenström av :class:`xmlreader.InputSource <xml.sax.xmlreader.InputSource>`\-objektet. (Bidrag från Serhiy Storchaka i :issue:`2175`.)

source: :func:`~xml.sax.parseString` now accepts a :class:`str` instance. (Contributed by Serhiy Storchaka in :issue:`10590`.)
pt_pt: A função :func:`~xml.sax.parseString` agora aceita uma instância :class:`str`. (Contribuído por Serhiy Storchaka em :issue:`10590`.)
ru: :func:`~xml.sax.parseString` теперь принимает экземпляр :class:`str`. (Предоставлено Сергеем Сторчакой в ​​:issue:`10590`.)
sv: :func:`~xml.sax.parseString` accepterar nu en :class:`str`\-instans. (Bidrag från Serhiy Storchaka i :issue:`10590`.)

source: ZIP output can now be written to unseekable streams. (Contributed by Serhiy Storchaka in :issue:`23252`.)
pt_pt: A saída ZIP agora pode ser escrita para fluxos não procuráveis. (Contribuído por Serhiy Storchaka em :issue:`23252`.)
ru: Вывод ZIP теперь можно записывать в недоступные для поиска потоки. (Предоставлено Сергеем Сторчакой в ​​:issue:`23252`.)
sv: ZIP-utdata kan nu skrivas till oseekbara strömmar. (Bidrag från Serhiy Storchaka i :issue:`23252`.)

source: The *mode* argument of :meth:`ZipFile.open() <zipfile.ZipFile.open>` method now accepts ``"x"`` to request exclusive creation. (Contributed by Serhiy Storchaka in :issue:`21717`.)
pt_pt: O argumento *mode* do método :meth:`ZipFile.open() <zipfile.ZipFile.open>` agora aceita ``"x"`` para solicitar criação exclusiva. (Contribuído por Serhiy Storchaka em :issue:`21717`.)
ru: Аргумент *mode* метода :meth:`ZipFile.open() <zipfile.ZipFile.open>` теперь принимает ``"x"`` для запроса эксклюзивного создания. (Добавлен Сергеем Сторчакой в ​​:issue:`21717`.)
sv: Argumentet *mode* i metoden :meth:`ZipFile.open() <zipfile.ZipFile.open>` accepterar nu ``"x"`` för att begära exklusiv skapelse. (Bidrag från Serhiy Storchaka i :issue:`21717`.)

source: Other module-level changes
pt_pt: Outras alterações a nível de módulo
ru: Другие изменения на уровне модуля
sv: Andra ändringar på modulnivå

source: Many functions in the :mod:`mmap`, :mod:`!ossaudiodev`, :mod:`socket`, :mod:`ssl`, and :mod:`codecs` modules now accept writable :term:`bytes-like objects <bytes-like object>`. (Contributed by Serhiy Storchaka in :issue:`23001`.)
pt_pt: Muitas funções nos módulos :mod:`mmap`, :mod:`!ossaudiodev`, :mod:`socket`, :mod:`ssl` e :mod:`codecs` agora aceitam objetos :term:`semelhantes a bytes <bytes-like object>` graváveis. (Contribuído por Serhiy Storchaka em :issue:`23001`.)
sv: Många funktioner i modulerna :mod:`mmap`, :mod:`!ossaudiodev`, :mod:`socket`, :mod:`ssl` och :mod:`codecs` accepterar nu skrivbara :term:`bytesliknande objekt <bytes-like object>`. (Bidrag från Serhiy Storchaka i :issue:`23001`.)

source: Optimizations
pt_pt: Otimizações
ru: Оптимизации
sv: Optimeringar

source: The :func:`os.walk` function has been sped up by 3 to 5 times on POSIX systems, and by 7 to 20 times on Windows. This was done using the new :func:`os.scandir` function, which exposes file information from the underlying ``readdir`` or ``FindFirstFile``/``FindNextFile`` system calls. (Contributed by Ben Hoyt with help from Victor Stinner in :issue:`23605`.)
pt_pt: A função :func:`os.walk` foi acelerada entre 3 a 5 vezes em sistemas POSIX, e entre 7 a 20 vezes no Windows. Isto foi feito usando a nova função :func:`os.scandir`, que expõe informações de ficheiros a partir das chamadas de sistema subjacentes ``readdir`` ou ``FindFirstFile``/``FindNextFile``. (Contribuído por Ben Hoyt com a ajuda de Victor Stinner em :issue:`23605`.)
ru: Функция :func:`os.walk` ускорена в системах POSIX от 3 до 5 раз и в Windows от 7 до 20 раз. Это было сделано с помощью новой функции :func:`os.scandir`, которая предоставляет информацию о файле из базовых системных вызовов ``readdir`` или ``FindFirstFile``/``FindNextFile``. (Предоставлено Беном Хойтом при помощи Виктора Стиннера в :issue:`23605`.)
sv: Funktionen :func:`os.walk` har snabbats upp med 3-5 gånger på POSIX-system och med 7-20 gånger på Windows. Detta gjordes med hjälp av den nya funktionen :func:`os.scandir`, som exponerar filinformation från de underliggande systemanropen ``readdir`` eller ``FindFirstFile``/``FindNextFile``. (Bidrag från Ben Hoyt med hjälp av Victor Stinner i :issue:`23605`.)

source: Construction of ``bytes(int)`` (filled by zero bytes) is faster and uses less memory for large objects. ``calloc()`` is used instead of ``malloc()`` to allocate memory for these objects. (Contributed by Victor Stinner in :issue:`21233`.)
pt_pt: A construção de ``bytes(int)`` (preenchido com bytes a zero) é mais rápida e usa menos memória para objetos grandes. ``calloc()`` é usado em vez de ``malloc()`` para alocar memória para estes objetos. (Contribuído por Victor Stinner em :issue:`21233`.)
ru: Создание ``bytes(int)`` (заполненного нулевыми байтами) происходит быстрее и использует меньше памяти для больших объектов. ``calloc()`` используется вместо ``malloc()`` для выделения памяти для этих объектов. (Предоставлено Виктором Стиннером в :issue:`21233`.)
sv: Konstruktionen av ``bytes(int)`` (fylld med nollbytes) är snabbare och använder mindre minne för stora objekt. ``calloc()`` används istället för ``malloc()`` för att allokera minne för dessa objekt. (Bidrag från Victor Stinner i :issue:`21233`.)

source: Some operations on :mod:`ipaddress` :class:`~ipaddress.IPv4Network` and :class:`~ipaddress.IPv6Network` have been massively sped up, such as :meth:`~ipaddress.IPv4Network.subnets`, :meth:`~ipaddress.IPv4Network.supernet`, :func:`~ipaddress.summarize_address_range`, :func:`~ipaddress.collapse_addresses`. The speed up can range from 3 to 15 times. (Contributed by Antoine Pitrou, Michel Albert, and Markus in :issue:`21486`, :issue:`21487`, :issue:`20826`, :issue:`23266`.)
pt_pt: Algumas operações em :mod:`ipaddress` :class:`~ipaddress.IPv4Network` e :class:`~ipaddress.IPv6Network` foram significativamente aceleradas, como :meth:`~ipaddress.IPv4Network.subnets`, :meth:`~ipaddress.IPv4Network.supernet`, :func:`~ipaddress.summarize_address_range`, :func:`~ipaddress.collapse_addresses`. A aceleração pode variar de 3 a 15 vezes. (Contribuído por Antoine Pitrou, Michel Albert e Markus em :issue:`21486`, :issue:`21487`, :issue:`20826`, :issue:`23266`.)
ru: Некоторые операции на :mod:`ipaddress` :class:`~ipaddress.IPv4Network` и :class:`~ipaddress.IPv6Network` значительно ускорены, например :meth:`~ipaddress.IPv4Network.subnets`, :meth :`~ipaddress.IPv4Network.supernet`, :func:`~ipaddress.summarize_address_range`, :func:`~ipaddress.collapse_addresses`. Ускорение может варьироваться от 3 до 15 раз. (Внесено Антуаном Питру, Мишелем Альбером и Маркусом в :issue:`21486`, :issue:`21487`, :issue:`20826`, :issue:`23266`.)
sv: Vissa operationer på :mod:`ipaddress` :class:`~ipaddress.IPv4Network` och :class:`~ipaddress.IPv6Network` har blivit kraftigt påskyndade, såsom :meth:`~ipaddress.IPv4Network.subnets`, :meth:`~ipaddress.IPv4Network.supernet`, :func:`~ipaddress.summarize_address_range`, :func:`~ipaddress.collapse_addresses`. Hastigheten kan variera från 3 till 15 gånger. (Bidrag från Antoine Pitrou, Michel Albert och Markus i :issue:`21486`, :issue:`21487`, :issue:`20826`, :issue:`23266`.)

source: Pickling of :mod:`ipaddress` objects was optimized to produce significantly smaller output. (Contributed by Serhiy Storchaka in :issue:`23133`.)
pt_pt: A serialização de objetos :mod:`ipaddress` foi otimizada para produzir uma saída significativamente menor. (Contribuído por Serhiy Storchaka em :issue:`23133`.)
ru: Консервация объектов :mod:`ipaddress` была оптимизирована для получения значительно меньшего результата. (Предоставлено Сергеем Сторчакой в ​​:issue:`23133`.)
sv: Pickling av :mod:`ipaddress`\-objekt har optimerats för att ge betydligt mindre utdata. (Bidrag från Serhiy Storchaka i :issue:`23133`.)

source: Many operations on :class:`io.BytesIO` are now 50% to 100% faster. (Contributed by Serhiy Storchaka in :issue:`15381` and David Wilson in :issue:`22003`.)
pt_pt: Muitas operações em :class:`io.BytesIO` são agora 50% a 100% mais rápidas. (Contribuído por Serhiy Storchaka em :issue:`15381` e David Wilson em :issue:`22003`.)
ru: Многие операции над :class:`io.BytesIO` теперь выполняются на 50–100 % быстрее. (Предоставлено Сергеем Сторчакой в ​​:issue:`15381` и Дэвидом Уилсоном в :issue:`22003`.)
sv: Många operationer på :class:`io.BytesIO` är nu 50% to 100% faster. (Bidrag från Serhiy Storchaka i :issue:`15381` och David Wilson i :issue:`22003`.)

source: The :func:`marshal.dumps` function is now faster: 65--85% with versions 3 and 4, 20--25% with versions 0 to 2 on typical data, and up to 5 times in best cases. (Contributed by Serhiy Storchaka in :issue:`20416` and :issue:`23344`.)
pt_pt: A função :func:`marshal.dumps` é agora mais rápida: 65--85% com as versões 3 e 4, 20--25% com as versões 0 a 2 em dados típicos, e até 5 vezes nos melhores casos. (Contribuído por Serhiy Storchaka em :issue:`20416` e :issue:`23344`.)
ru: Функция :func:`marshal.dumps` теперь работает быстрее: 65--85% с версиями 3 и 4, 20--25% с версиями 0-2 на типичных данных и до 5 раз в лучших случаях. (Внесено Сергеем Сторчакой в ​​:issue:`20416` и :issue:`23344`.)
sv: Funktionen :func:`marshal.dumps` är nu snabbare: 65--85% med version 3 och 4, 20--25% med version 0 till 2 på typiska data, och upp till 5 gånger i bästa fall. (Bidrag från Serhiy Storchaka i :issue:`20416` och :issue:`23344`.)

source: The UTF-32 encoder is now 3 to 7 times faster. (Contributed by Serhiy Storchaka in :issue:`15027`.)
pt_pt: O codificador UTF-32 é agora 3 a 7 vezes mais rápido. (Contribuído por Serhiy Storchaka em :issue:`15027`.)
ru: Кодировщик UTF-32 теперь работает в 3–7 раз быстрее. (Предоставлено Сергеем Сторчакой в ​​:issue:`15027`.)
sv: UTF-32-kodaren är nu 3 till 7 gånger snabbare. (Bidrag från Serhiy Storchaka i :issue:`15027`.)

source: Regular expressions are now parsed up to 10% faster. (Contributed by Serhiy Storchaka in :issue:`19380`.)
pt_pt: As expressões regulares são agora analisadas até 10% mais rápido. (Contribuído por Serhiy Storchaka em :issue:`19380`.)
ru: Регулярные выражения теперь анализируются до 10% быстрее. (Предоставлено Сергеем Сторчакой в ​​:issue:`19380`.)
sv: Reguljära uttryck analyseras nu upp till 10% faster. (Bidrag från Serhiy Storchaka i :issue:`19380`.)

source: The :func:`json.dumps` function was optimized to run with ``ensure_ascii=False`` as fast as with ``ensure_ascii=True``. (Contributed by Naoki Inada in :issue:`23206`.)
pt_pt: A função :func:`json.dumps` foi otimizada para executar com ``ensure_ascii=False`` tão rápido quanto com ``ensure_ascii=True``. (Contribuído por Naoki Inada em :issue:`23206`.)
ru: Функция :func:`json.dumps` была оптимизирована для работы с ``ensure_ascii = False`` так же быстро, как с ``ensure_ascii = True``. (Предоставлено Наоки Инада в :issue:`23206`.)
sv: Funktionen :func:`json.dumps` optimerades för att köras med ``ensure_ascii=False`` lika snabbt som med ``ensure_ascii=True``. (Bidrag från Naoki Inada i :issue:`23206`.)

source: The :c:func:`PyObject_IsInstance` and :c:func:`PyObject_IsSubclass` functions have been sped up in the common case that the second argument has :class:`type` as its metaclass. (Contributed Georg Brandl by in :issue:`22540`.)
pt_pt: As funções :c:func:`PyObject_IsInstance` e :c:func:`PyObject_IsSubclass` foram aceleradas no caso comum em que o segundo argumento tem :class:`type` como sua metaclasse. (Contribuído por Georg Brandl em :issue:`22540`.)
ru: Функции :c:func:` PyObj ect_IsInstance` и :c:func:` PyObj ect_IsSubclass` были ускорены в обычном случае, когда второй аргумент имеет :class:`type` в качестве метакласса. (Внесено Георгом Брандлом в :issue:`22540`.)
sv: Funktionerna :c:func:`PyObject_IsInstance` och :c:func:`PyObject_IsSubclass` har snabbas upp i det vanliga fallet att det andra argumentet har :class:`type` som sin metaklass. (Bidrag från Georg Brandl i :issue:`22540`.)

source: Method caching was slightly improved, yielding up to 5% performance improvement in some benchmarks. (Contributed by Antoine Pitrou in :issue:`22847`.)
pt_pt: A cache de métodos foi ligeiramente melhorada, resultando em melhorias de desempenho de até 5% em alguns *benchmarks*. (Contribuído por Antoine Pitrou em :issue:`22847`.)
ru: Кэширование методов было немного улучшено, что привело к увеличению производительности до 5% в некоторых тестах. (Предоставлено Антуаном Питру в :issue:`22847`.)
sv: Cachelagringen av metoder förbättrades något, vilket gav upp till 5% p% bättre prestanda i vissa benchmarks. (Bidrag från Antoine Pitrou i :issue:`22847`.)

source: Objects from the :mod:`random` module now use 50% less memory on 64-bit builds. (Contributed by Serhiy Storchaka in :issue:`23488`.)
pt_pt: Os objetos do módulo :mod:`random` agora usam 50% menos memória em compilações de 64 bits. (Contribuído por Serhiy Storchaka em :issue:`23488`.)
ru: Объекты из модуля :mod:`random` теперь используют на 50% меньше памяти в 64-битных сборках. (Предоставлено Сергеем Сторчакой в ​​:issue:`23488`.)
sv: Objekt från modulen :mod:`random` använder nu 50% less minne i 64-bitarsversioner. (Bidrag från Serhiy Storchaka i :issue:`23488`.)

source: The :func:`property` getter calls are up to 25% faster. (Contributed by Joe Jevnik in :issue:`23910`.)
pt_pt: As chamadas de *getter* de :func:`property` são até 25% mais rápidas. (Contribuído por Joe Jevnik em :issue:`23910`.)
ru: Вызовы метода получения :func:`property` выполняются до 25% быстрее. (Внесено Джо Джевником в :issue:`23910`.)
sv: Anropen till :func:`property` getter är upp till 25% faster. (Bidrag från Joe Jevnik i :issue:`23910`.)

source: Instantiation of :class:`fractions.Fraction` is now up to 30% faster. (Contributed by Stefan Behnel in :issue:`22464`.)
pt_pt: A instanciação de :class:`fractions.Fraction` é agora até 30% mais rápida. (Contribuído por Stefan Behnel em :issue:`22464`.)
ru: Создание экземпляра :class:`fractions.Fraction` теперь происходит на 30 % быстрее. (Предоставлено Стефаном Бенелем в :issue:`22464`.)
sv: Instantiering av :class:`fractions.Fraction` är nu upp till 30% faster. (Bidrag från Stefan Behnel i :issue:`22464`.)

source: String methods :meth:`~str.find`, :meth:`~str.rfind`, :meth:`~str.split`, :meth:`~str.partition` and the :keyword:`in` string operator are now significantly faster for searching 1-character substrings. (Contributed by Serhiy Storchaka in :issue:`23573`.)
pt_pt: Os métodos de *string* :meth:`~str.find`, :meth:`~str.rfind`, :meth:`~str.split`, :meth:`~str.partition` e o operador de *string* :keyword:`in` são agora significativamente mais rápidos para pesquisar substrings de 1 carácter. (Contribuído por Serhiy Storchaka em :issue:`23573`.)
ru: Строковые методы :meth:`~str.find`, :meth:`~str.rfind`, :meth:`~str.split`, :meth:`~str.partition` и строка :keyword:`in` Оператор теперь значительно быстрее выполняет поиск односимвольных подстрок. (Предоставлено Сергеем Сторчакой в ​​:issue:`23573`.)
sv: Strängmetoderna :meth:`~str.find`, :meth:`~str.rfind`, :meth:`~str.split`, :meth:`~str.partition` och strängoperatorn :keyword:`in` är nu betydligt snabbare för sökning av substrängar med 1 tecken. (Bidrag från Serhiy Storchaka i :issue:`23573`.)

source: Build and C API Changes
pt_pt: Alterações na Compilação e na API C
ru: Изменения API сборки и C
sv: Ändringar i Build och C API

source: New ``calloc`` functions were added:
pt_pt: Foram adicionadas novas funções ``calloc``:
ru: Добавлены новые функции calloc:
sv: Nya ``calloc``\-funktioner har lagts till:

source: (Contributed by Victor Stinner in :issue:`21233`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`21233`.)
ru: (Предоставлено Виктором Стиннером в :issue:`21233`.)
sv: (Bidrag från Victor Stinner i :issue:`21233`.)

source: New encoding/decoding helper functions:
pt_pt: Novas funções auxiliares de codificação/descodificação:
ru: Новые вспомогательные функции кодирования/декодирования:
sv: Nya hjälpfunktioner för kodning/avkodning:

source: :c:func:`Py_DecodeLocale` (replaced ``_Py_char2wchar()``),
pt_pt: :c:func:`Py_DecodeLocale` (substituída ``_Py_char2wchar()``),
ru: :c:func:`Py_DecodeLocale` (заменено на ``_Py_char2wchar()``),
sv: :c:func:`Py_DecodeLocale` (ersatte ``_Py_char2wchar()``)),

source: :c:func:`Py_EncodeLocale` (replaced ``_Py_wchar2char()``).
pt_pt: :c:func:`Py_EncodeLocale` (substituída ``_Py_wchar2char()``).
ru: :c:func:`Py_EncodeLocale` (заменено на ``_Py_wchar2char()``).
sv: :c:func:`Py_EncodeLocale` (ersatte ``_Py_wchar2char()``)).

source: (Contributed by Victor Stinner in :issue:`18395`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`18395`.)
ru: (Предоставлено Виктором Стиннером в :issue:`18395`.)
sv: (Bidrag från Victor Stinner i :issue:`18395`.)

source: A new :c:func:`PyCodec_NameReplaceErrors` function to replace the unicode encode error with ``\N{...}`` escapes. (Contributed by Serhiy Storchaka in :issue:`19676`.)
pt_pt: Uma nova função :c:func:`PyCodec_NameReplaceErrors` para substituir o erro de codificação unicode com escapes ``\N{...}``. (Contribuído por Serhiy Storchaka em :issue:`19676`.)
ru: Новая функция :c:func:`PyCodec_NameReplaceErrors` для замены ошибки кодирования Юникода на escape-символ ``\N{...}``. (Предоставлено Сергеем Сторчакой в ​​:issue:`19676`.)
sv: En ny :c:func:`PyCodec_NameReplaceErrors`\-funktion för att ersätta unicode-kodningsfelet med ``\N{...}`` escapes. (Bidrag från Serhiy Storchaka i :issue:`19676`.)

source: A new :c:func:`PyErr_FormatV` function similar to :c:func:`PyErr_Format`, but accepts a :c:type:`va_list` argument. (Contributed by Antoine Pitrou in :issue:`18711`.)
pt_pt: Uma nova função :c:func:`PyErr_FormatV` semelhante a :c:func:`PyErr_Format`, mas que aceita um argumento :c:type:`va_list`. (Contribuído por Antoine Pitrou em :issue:`18711`.)
ru: Новая функция :c:func:`PyErr_FormatV`, похожая на :c:func:`PyErr_Format`, но принимает аргумент :c:type:`va_list`. (Предоставлено Антуаном Питру в :issue:`18711`.)
sv: En ny :c:func:`PyErr_FormatV` funktion som liknar :c:func:`PyErr_Format`, men accepterar ett :c:type:`va_list` argument. (Bidrag från Antoine Pitrou i :issue:`18711`.)
