Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: Other Language Changes
pt_pt: Outras Alterações na Linguagem
ru: Другие языковые изменения
sv: Andra språkliga förändringar

source: Some smaller changes made to the core Python language are:
pt_pt: Algumas alterações menores feitas à linguagem principal do Python são:
ru: Некоторые небольшие изменения, внесенные в основной язык Python:
sv: Några mindre ändringar som gjorts i Python-språkets kärna är:

source: Added the ``"namereplace"`` error handlers. The ``"backslashreplace"`` error handlers now work with decoding and translating. (Contributed by Serhiy Storchaka in :issue:`19676` and :issue:`22286`.)
pt_pt: Adicionados os gestores de erros ``"namereplace"``. Os gestores de erros ``"backslashreplace"`` agora funcionam com descodificação e tradução. (Contribuído por Serhiy Storchaka em :issue:`19676` e :issue:`22286`.)
ru: Добавлены обработчики ошибок ``namereplace``. Обработчики ошибок ``"backslashreplace"`` теперь работают с декодированием и переводом. (Внесено Сергеем Сторчакой в ​​:issue:`19676` и :issue:`22286`.)
sv: Lagt till felhanterare för ``"namereplace"``. Felhanterarna ``"backslashreplace"`` fungerar nu med avkodning och översättning. (Bidrag från Serhiy Storchaka i :issue:`19676` och :issue:`22286`.)

source: The :option:`-b` option now affects comparisons of :class:`bytes` with :class:`int`. (Contributed by Serhiy Storchaka in :issue:`23681`.)
pt_pt: A opção :option:`-b` agora afeta as comparações de :class:`bytes` com :class:`int`. (Contribuído por Serhiy Storchaka em :issue:`23681`.)
ru: Опция :option:`-b` теперь влияет на сравнение :class:`bytes` с :class:`int`. (Добавлен Сергеем Сторчакой в ​​:issue:`23681`.)
sv: Alternativet :option:`\-b` påverkar nu jämförelser av :class:`bytes` med :class:`int`. (Bidrag från Serhiy Storchaka i :issue:`23681`.)

source: New Kazakh ``kz1048`` and Tajik ``koi8_t`` :ref:`codecs <standard-encodings>`. (Contributed by Serhiy Storchaka in :issue:`22682` and :issue:`22681`.)
pt_pt: Novos :ref:`codecs <standard-encodings>` Cazaque ``kz1048`` e Tajique ``koi8_t``. (Contribuído por Serhiy Storchaka em :issue:`22682` e :issue:`22681`.)
ru: Новые казахские ``kz1048`` и таджикские ``koi8_t`` :ref:`кодеки <standard-encodings>`. (Внесено Сергеем Сторчакой в ​​:issue:`22682` и :issue:`22681`.)
sv: Nya kazakiska ``kz1048`` och tadzjikiska ``koi8_t`` :ref:`codecs <standard-encodings>`. (Bidrag från Serhiy Storchaka i :issue:`22682` och :issue:`22681`.)

source: Property docstrings are now writable. This is especially useful for :func:`collections.namedtuple` docstrings. (Contributed by Berker Peksag in :issue:`24064`.)
pt_pt: As *docstrings* de propriedades são agora editáveis. Isto é especialmente útil para as *docstrings* de :func:`collections.namedtuple`. (Contribuído por Berker Peksag em :issue:`24064`.)
ru: Строки документации свойств теперь доступны для записи. Это особенно полезно для строк документации :func:`collections.namedtuple`. (Предоставлено Беркером Пексагом в :issue:`24064`.)
sv: Egenskapsdokumentationer är nu skrivbara. Detta är särskilt användbart för :func:`collections.namedtuple`\-dokumentsträngar. (Bidrag från Berker Peksag i :issue:`24064`.)

source: Circular imports involving relative imports are now supported. (Contributed by Brett Cannon and Antoine Pitrou in :issue:`17636`.)
pt_pt: As importações circulares que envolvem importações relativas são agora suportadas. (Contribuído por Brett Cannon e Antoine Pitrou em :issue:`17636`.)
ru: Теперь поддерживается циклический импорт, включающий относительный импорт. (Предоставлено Бреттом Кэнноном и Антуаном Питру в :issue:`17636`.)
sv: Cirkulär import som involverar relativ import stöds nu. (Bidrag från Brett Cannon och Antoine Pitrou i :issue:`17636`.)

source: New Modules
pt_pt: Novos Módulos
ru: Новые модули
sv: Nya moduler

source: The new :mod:`typing` :term:`provisional <provisional API>` module provides standard definitions and tools for function type annotations. See :ref:`Type Hints <whatsnew-pep-484>` for more information.
pt_pt: O novo módulo :mod:`typing` :term:`provisório <provisional API>` fornece definições e ferramentas padrão para anotações de tipo de função. Consulte :ref:`Dicas de Tipo <whatsnew-pep-484>` para mais informações.
ru: Новый модуль :mod:`typing` :term:`provisional <provisional API>` предоставляет стандартные определения и инструменты для аннотаций типов функций. См. :ref:`Подсказки по типу <whatsnew-pep-484>` для получения дополнительной информации.
sv: Den nya modulen :mod:`typing` :term:`provisional <provisional API>` innehåller standarddefinitioner och verktyg för funktionstypskommentarer. Se :ref:`Type Hints <whatsnew-pep-484>` för mer information.

source: The new :mod:`zipapp` module (specified in :pep:`441`) provides an API and command line tool for creating executable Python Zip Applications, which were introduced in Python 2.6 in :issue:`1739468`, but which were not well publicized, either at the time or since.
pt_pt: O novo módulo :mod:`zipapp` (especificado na :pep:`441`) fornece uma API e uma ferramenta de linha de comandos para criar Aplicações Python Zip executáveis, que foram introduzidas no Python 2.6 em :issue:`1739468`, mas que não foram bem divulgadas, nem na altura nem desde então.
ru: Новый модуль :mod:`zipapp` (указанный в :pep:`441`) предоставляет API и инструмент командной строки для создания исполняемых Zip-приложений Python, которые были представлены в Python 2.6 в :issue:`1739468`, но которые были не получил широкой огласки ни в то время, ни после.
sv: Den nya modulen :mod:`zipapp` (specificerad i :pep:`441`) tillhandahåller ett API och kommandoradsverktyg för att skapa körbara Python Zip Applications, som introducerades i Python 2.6 i :issue:`1739468`, men som inte var särskilt välkända, varken då eller senare.

source: With the new module, bundling your application is as simple as putting all the files, including a ``__main__.py`` file, into a directory ``myapp`` and running:
pt_pt: Com o novo módulo, agrupar a sua aplicação é tão simples como colocar todos os ficheiros, incluindo um ficheiro ``__main__.py``, num diretório ``myapp`` e executar:
ru: С новым модулем объединить ваше приложение так же просто, как поместить все файлы, включая файл ``__main__.py``, в каталог ``myapp`` и запустить:
sv: Med den nya modulen är det så enkelt som att lägga alla filer, inklusive filen ``__main__.py``, i katalogen ``myapp`` och köra:

source: The module implementation has been contributed by Paul Moore in :issue:`23491`.
pt_pt: A implementação do módulo foi contribuída por Paul Moore em :issue:`23491`.
ru: Реализация модуля была предоставлена ​​Полом Муром в :issue:`23491`.
sv: Implementeringen av modulen har bidragit av Paul Moore i :issue:`23491`.

source: :pep:`441` -- Improving Python ZIP Application Support
pt_pt: :pep:`441` — Melhorar o Suporte para Aplicações ZIP em Python
ru: :pep:`441` -- Улучшение поддержки ZIP-приложений Python
sv: :pep:`441` -- Förbättrat stöd för Python ZIP-applikationer

source: Improved Modules
pt_pt: Módulos Melhorados
ru: Улучшенные модули
sv: Förbättrade moduler

source: The :class:`~argparse.ArgumentParser` class now allows disabling :ref:`abbreviated usage <prefix-matching>` of long options by setting :ref:`allow_abbrev` to ``False``. (Contributed by Jonathan Paugh, Steven Bethard, paul j3 and Daniel Eriksson in :issue:`14910`.)
pt_pt: A classe :class:`~argparse.ArgumentParser` agora permite desativar o :ref:`uso abreviado <prefix-matching>` de opções longas, definindo :ref:`allow_abbrev` para ``False``. (Contribuído por Jonathan Paugh, Steven Bethard, paul j3 e Daniel Eriksson em :issue:`14910`.)
ru: Класс :class:`~argparse.ArgumentParser` теперь позволяет отключать :ref:`сокращенное использование <prefix-matching>` длинных опций, установив :ref:`allow_abbrev` в ``False``. (Предоставлено Джонатаном По, Стивеном Бетхардом, Полом j3 и Дэниелом Эрикссоном в :issue:`14910`.)
sv: Klassen :class:`~argparse.ArgumentParser` tillåter nu att :ref:`förkortad användning <prefix-matching>` av långa alternativ inaktiveras genom att sätta :ref:`allow_abbrev` till ``False``. (Bidrag från Jonathan Paugh, Steven Bethard, paul j3 och Daniel Eriksson i :issue:`14910`.)

source: Since the :mod:`asyncio` module is :term:`provisional <provisional API>`, all changes introduced in Python 3.5 have also been backported to Python 3.4.x.
pt_pt: Como o módulo :mod:`asyncio` é :term:`provisório <provisional API>`, todas as alterações introduzidas no Python 3.5 também foram retroportadas para o Python 3.4.x.
ru: Поскольку модуль :mod:`asyncio` является :term:`provisional <provisional API>`, все изменения, внесенные в Python 3.5, также были перенесены в Python 3.4.x.
sv: Eftersom modulen :mod:`asyncio` är :term:`provisional <provisional API>`, har alla ändringar som introducerades i Python 3.5 också bakåtporterats till Python 3.4.x.

source: Notable changes in the :mod:`asyncio` module since Python 3.4.0:
pt_pt: Alterações notáveis no módulo :mod:`asyncio` desde o Python 3.4.0:
ru: Заметные изменения в модуле :mod:`asyncio` по сравнению с Python 3.4.0:
sv: Anmärkningsvärda ändringar i modulen :mod:`asyncio` sedan Python 3.4.0:

source: New debugging APIs: :meth:`loop.set_debug() <asyncio.loop.set_debug>` and :meth:`loop.get_debug() <asyncio.loop.get_debug>` methods. (Contributed by Victor Stinner.)
pt_pt: Novas APIs de depuração: métodos :meth:`loop.set_debug() <asyncio.loop.set_debug>` e :meth:`loop.get_debug() <asyncio.loop.get_debug>`. (Contribuído por Victor Stinner.)
ru: Новые API отладки: методы :meth:`loop.set_debug() <asyncio.loop.set_debug>` и :meth:`loop.get_debug() <asyncio.loop.get_debug>`. (Предоставлено Виктором Стиннером.)
sv: Nya debugging API:er: :meth:`loop.set_debug() <asyncio.loop.set_debug>` och :meth:`loop.get_debug() <asyncio.loop.get_debug>` metoder. (Bidrag från Victor Stinner.)

source: The proactor event loop now supports SSL. (Contributed by Antoine Pitrou and Victor Stinner in :issue:`22560`.)
pt_pt: O ciclo de eventos *proactor* agora suporta SSL. (Contribuído por Antoine Pitrou e Victor Stinner em :issue:`22560`.)
ru: Цикл событий proactor теперь поддерживает SSL. (Предоставлено Антуаном Питру и Виктором Стиннером в :issue:`22560`.)
sv: Proactors händelseslinga har nu stöd för SSL. (Bidrag från Antoine Pitrou och Victor Stinner i :issue:`22560`.)

source: A new :meth:`loop.is_closed() <asyncio.loop.is_closed>` method to check if the event loop is closed. (Contributed by Victor Stinner in :issue:`21326`.)
pt_pt: Um novo método :meth:`loop.is_closed() <asyncio.loop.is_closed>` para verificar se o ciclo de eventos está fechado. (Contribuído por Victor Stinner em :issue:`21326`.)
ru: Новый метод :meth:`loop.is_closed() <asyncio.loop.is_closed>` для проверки закрытия цикла событий. (Предоставлено Виктором Стиннером в :issue:`21326`.)
sv: En ny :meth:`loop.is_closed() <asyncio.loop.is_closed>`\-metod för att kontrollera om händelseslingan är stängd. (Bidrag från Victor Stinner i :issue:`21326`.)

source: A new :meth:`loop.create_task() <asyncio.loop.create_task>` to conveniently create and schedule a new :class:`~asyncio.Task` for a coroutine. The ``create_task`` method is also used by all asyncio functions that wrap coroutines into tasks, such as :func:`asyncio.wait`, :func:`asyncio.gather`, etc. (Contributed by Victor Stinner.)
pt_pt: Um novo método :meth:`loop.create_task() <asyncio.loop.create_task>` para criar e agendar convenientemente uma nova :class:`~asyncio.Task` para uma *coroutine*. O método ``create_task`` também é usado por todas as funções *asyncio* que envolvem *coroutines* em tarefas, como :func:`asyncio.wait`, :func:`asyncio.gather`, etc. (Contribuído por Victor Stinner.)
ru: Новый :meth:`loop.create_task() <asyncio.loop.create_task>` для удобного создания и планирования нового :class:`~asyncio.Task` для сопрограммы. Метод create_task также используется всеми функциями asyncio, которые оборачивают сопрограммы в задачи, например :func:`asyncio.wait`, :func:`asyncio.gather` и т. д. (Внесено Виктором Стиннером.)
sv: En ny :meth:`loop.create_task() <asyncio.loop.create_task>` för att enkelt skapa och schemalägga en ny :class:`~asyncio.Task` för en coroutine. Metoden ``create_task`` används också av alla asynciofunktioner som omsluter coroutines till tasks, till exempel :func:`asyncio.wait`, :func:`asyncio.gather`, etc. (Bidrag från Victor Stinner.)

source: A new :meth:`transport.get_write_buffer_limits() <asyncio.WriteTransport.get_write_buffer_limits>` method to inquire for *high-* and *low-* water limits of the flow control. (Contributed by Victor Stinner.)
pt_pt: Um novo método :meth:`transport.get_write_buffer_limits() <asyncio.WriteTransport.get_write_buffer_limits>` para consultar os limites *high-* e *low-* do controlo de fluxo. (Contribuído por Victor Stinner.)
ru: Новый метод :meth:`transport.get_write_buffer_limits() <asyncio.WriteTransport.get_write_buffer_limits>` для запроса *высоких* и *низких* пределов воды для управления потоком. (Предоставлено Виктором Стиннером.)
sv: En ny :meth:`transport.get_write_buffer_limits() <asyncio.WriteTransport.get_write_buffer_limits>`\-metod för att fråga efter *höga* och *låga* vattengränser för flödeskontrollen. (Bidrag från Victor Stinner.)

source: The :func:`!async` function is deprecated in favor of :func:`~asyncio.ensure_future`. (Contributed by Yury Selivanov.)
pt_pt: A função :func:`!async` está obsoleta em favor de :func:`~asyncio.ensure_future`. (Contribuído por Yury Selivanov.)

source: New :meth:`loop.set_task_factory() <asyncio.loop.set_task_factory>` and :meth:`loop.get_task_factory() <asyncio.loop.get_task_factory>` methods to customize the task factory that :meth:`loop.create_task() <asyncio.loop.create_task>` method uses. (Contributed by Yury Selivanov.)
pt_pt: Novos métodos :meth:`loop.set_task_factory() <asyncio.loop.set_task_factory>` e :meth:`loop.get_task_factory() <asyncio.loop.get_task_factory>` para personalizar a fábrica de tarefas que o método :meth:`loop.create_task() <asyncio.loop.create_task>` usa. (Contribuído por Yury Selivanov.)
ru: Новые методы :meth:`loop.set_task_factory() <asyncio.loop.set_task_factory>` и :meth:`loop.get_task_factory() <asyncio.loop.get_task_factory>` для настройки фабрики задач, которая :meth:`loop.create_task () <asyncio.loop.create_task>` использует метод. (Сообщил Юрий Селиванов.)
sv: Nya metoder :meth:`loop.set_task_factory() <asyncio.loop.set_task_factory>` och :meth:`loop.get_task_factory() <asyncio.loop.get_task_factory>` för att anpassa uppgiftsfabriken som metoden :meth:`loop.create_task() <asyncio.loop.create_task>` använder. (Bidrag från Yury Selivanov.)

source: New :meth:`Queue.join() <asyncio.Queue.join>` and :meth:`Queue.task_done() <asyncio.Queue.task_done>` queue methods. (Contributed by Victor Stinner.)
pt_pt: Novos métodos de fila :meth:`Queue.join() <asyncio.Queue.join>` e :meth:`Queue.task_done() <asyncio.Queue.task_done>`. (Contribuído por Victor Stinner.)
ru: Новые методы очереди :meth:`Queue.join() <asyncio.Queue.join>` и :meth:`Queue.task_done() <asyncio.Queue.task_done>`. (Предоставлено Виктором Стиннером.)
sv: Nya kömetoder :meth:`Queue.join() <asyncio.Queue.join>` och :meth:`Queue.task_done() <asyncio.Queue.task_done>`. (Bidrag från Victor Stinner.)

source: The ``JoinableQueue`` class was removed, in favor of the :class:`asyncio.Queue` class. (Contributed by Victor Stinner.)
pt_pt: A classe ``JoinableQueue`` foi removida, em favor da classe :class:`asyncio.Queue`. (Contribuído por Victor Stinner.)
ru: Класс JoinableQueue был удален в пользу класса :class:`asyncio.Queue`. (Предоставлено Виктором Стиннером.)
sv: Klassen ``JoinableQueue`` togs bort till förmån för klassen :class:`asyncio.Queue`. (Bidrag från Victor Stinner.)

source: Updates in 3.5.1:
pt_pt: Atualizações na versão 3.5.1:
ru: Обновления в версии 3.5.1:
sv: Uppdateringar i 3.5.1:

source: The :func:`~asyncio.ensure_future` function and all functions that use it, such as :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, now accept all kinds of :term:`awaitable objects <awaitable>`. (Contributed by Yury Selivanov.)
pt_pt: A função :func:`~asyncio.ensure_future` e todas as funções que a usam, como :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, agora aceitam todos os tipos de :term:`objetos aguardáveis <awaitable>`. (Contribuído por Yury Selivanov.)
ru: Функция :func:`~asyncio.ensure_future` и все функции, которые ее используют, такие как :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, теперь принимают все виды :term:`ожидаемых объектов < ожидается>`. (Сообщил Юрий Селиванов.)
sv: Funktionen :func:`~asyncio.ensure_future` och alla funktioner som använder den, till exempel :meth:`loop.run_until_complete() <asyncio.loop.run_until_complete>`, accepterar nu alla typer av :term:`awaitable objects <awaitable>`. (Bidrag från Yury Selivanov.)

source: New :func:`~asyncio.run_coroutine_threadsafe` function to submit coroutines to event loops from other threads. (Contributed by Vincent Michel.)
pt_pt: Nova função :func:`~asyncio.run_coroutine_threadsafe` para submeter *coroutines* a ciclos de eventos a partir de outras *threads*. (Contribuído por Vincent Michel.)
ru: Новая функция :func:`~asyncio.run_coroutine_threadsafe` для отправки сопрограмм в циклы событий из других потоков. (Предоставлено Винсентом Мишелем.)
sv: Ny :func:`~asyncio.run_coroutine_threadsafe`\-funktion för att skicka coroutines till händelseslingor från andra trådar. (Bidrag från Vincent Michel.)

source: New :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` method to check if the transport is closing or closed. (Contributed by Yury Selivanov.)
pt_pt: Novo método :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` para verificar se o transporte está a fechar ou fechado. (Contribuído por Yury Selivanov.)
ru: Новый метод :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>` для проверки закрытия или закрытия транспорта. (Сообщил Юрий Селиванов.)
sv: Ny :meth:`Transport.is_closing() <asyncio.BaseTransport.is_closing>`\-metod för att kontrollera om transporten stängs eller stängs. (Bidrag från Yury Selivanov.)

source: The :meth:`loop.create_server() <asyncio.loop.create_server>` method can now accept a list of hosts. (Contributed by Yann Sionneau.)
pt_pt: O método :meth:`loop.create_server() <asyncio.loop.create_server>` agora pode aceitar uma lista de *hosts*. (Contribuído por Yann Sionneau.)
ru: Метод :meth:`loop.create_server() <asyncio.loop.create_server>` теперь может принимать список хостов. (Предоставлено Янном Сионно.)
sv: Metoden :meth:`loop.create_server() <asyncio.loop.create_server>` kan nu acceptera en lista med värdar. (Bidrag från Yann Sionneau.)

source: Updates in 3.5.2:
pt_pt: Atualizações na versão 3.5.2:
ru: Обновления в версии 3.5.2:
sv: Uppdateringar i 3.5.2:

source: New :meth:`loop.create_future() <asyncio.loop.create_future>` method to create Future objects. This allows alternative event loop implementations, such as `uvloop <https://github.com/MagicStack/uvloop>`_, to provide a faster :class:`asyncio.Future` implementation. (Contributed by Yury Selivanov.)
pt_pt: Novo método :meth:`loop.create_future() <asyncio.loop.create_future>` para criar objetos Future. Isto permite que implementações alternativas de ciclos de eventos, como `uvloop <https://github.com/MagicStack/uvloop>`_, forneçam uma implementação mais rápida de :class:`asyncio.Future`. (Contribuído por Yury Selivanov.)
ru: Новый метод :meth:`loop.create_future() <asyncio.loop.create_future>` для создания объектов Future. Это позволяет альтернативным реализациям цикла событий, таким как `uvloop <https://github.com/MagicStack/uvloop>`_, обеспечить более быструю реализацию :class:`asyncio.Future`. (Сообщил Юрий Селиванов.)
sv: Ny :meth:`loop.create_future() <asyncio.loop.create_future>`\-metod för att skapa Future-objekt. Detta gör det möjligt för alternativa implementationer av händelseslingor, som `uvloop <https://github.com/MagicStack/uvloop>`_, att tillhandahålla en snabbare :class:`asyncio.Future`\-implementation. (Bidrag från Yury Selivanov.)

source: New :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>` method to get the current exception handler. (Contributed by Yury Selivanov.)
pt_pt: Novo método :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>` para obter o gestor de exceções atual. (Contribuído por Yury Selivanov.)
ru: Новый метод :meth:`loop.get_Exception_handler() <asyncio.loop.get_Exception_handler>` для получения текущего обработчика исключений. (Сообщил Юрий Селиванов.)
sv: Ny :meth:`loop.get_exception_handler() <asyncio.loop.get_exception_handler>`\-metod för att hämta den aktuella undantagshanteraren. (Bidrag från Yury Selivanov.)

source: New :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` method to read data from the stream until a separator bytes sequence appears. (Contributed by Mark Korenberg.)
pt_pt: Novo método :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` para ler dados do fluxo até que uma sequência de bytes separadora apareça. (Contribuído por Mark Korenberg.)
ru: Новый метод :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>` для чтения данных из потока до тех пор, пока не появится последовательность байтов-разделителей. (Предоставлено Марком Коренбергом.)
sv: Ny :meth:`StreamReader.readuntil() <asyncio.StreamReader.readuntil>`\-metod för att läsa data från strömmen tills en separatorbyte-sekvens visas. (Bidrag från Mark Korenberg.)

source: The :meth:`loop.create_connection() <asyncio.loop.create_connection>` and :meth:`loop.create_server() <asyncio.loop.create_server>` methods are optimized to avoid calling the system ``getaddrinfo`` function if the address is already resolved. (Contributed by A. Jesse Jiryu Davis.)
pt_pt: Os métodos :meth:`loop.create_connection() <asyncio.loop.create_connection>` e :meth:`loop.create_server() <asyncio.loop.create_server>` estão otimizados para evitar chamar a função do sistema ``getaddrinfo`` se o endereço já estiver resolvido. (Contribuído por A. Jesse Jiryu Davis.)
ru: Методы :meth:`loop.create_connection() <asyncio.loop.create_connection>` и :meth:`loop.create_server() <asyncio.loop.create_server>` оптимизированы, чтобы избежать вызова системной функции ``getaddrinfo``. если адрес уже разрешен. (Предоставлено А. Джесси Джирю Дэвисом.)
sv: Metoderna :meth:`loop.create_connection() <asyncio.loop.create_connection>` och :meth:`loop.create_server() <asyncio.loop.create_server>` är optimerade för att undvika att anropa systemets funktion ``getaddrinfo`` om adressen redan är löst. (Bidrag från A. Jesse Jiryu Davis.)

source: The :meth:`loop.sock_connect(sock, address) <asyncio.loop.sock_connect>` no longer requires the *address* to be resolved prior to the call. (Contributed by A. Jesse Jiryu Davis.)
pt_pt: O método :meth:`loop.sock_connect(sock, address) <asyncio.loop.sock_connect>` já não exige que o *address* seja resolvido antes da chamada. (Contribuído por A. Jesse Jiryu Davis.)
ru: :meth:`loop.sock_connect(sock, адрес) <asyncio.loop.sock_connect>` больше не требует разрешения *адреса* перед вызовом. (Предоставлено А. Джесси Джирю Дэвисом.)
sv: :meth:`loop.sock_connect(sock, address) <asyncio.loop.sock_connect>` kräver inte längre att *adressen* löses före anropet. (Bidrag från A. Jesse Jiryu Davis.)
