Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: A new :c:data:`PyExc_RecursionError` exception. (Contributed by Georg Brandl in :issue:`19235`.)
pt_pt: Uma nova exceção :c:data:`PyExc_RecursionError`. (Contribuído por Georg Brandlem :issue:`19235`.)
ru: Новое исключение :c:data:`PyExc_RecursionError`. (Предоставлено Георгом Брандлом в :issue:`19235`.)
sv: Ett nytt :c:data:`PyExc_RecursionError` undantag. (Bidrag från Georg Brandl i :issue:`19235`.)

source: New :c:func:`PyModule_FromDefAndSpec`, :c:func:`PyModule_FromDefAndSpec2`, and :c:func:`PyModule_ExecDef` functions introduced by :pep:`489` -- multi-phase extension module initialization. (Contributed by Petr Viktorin in :issue:`24268`.)
pt_pt: Novas funções :c:func:`PyModule_FromDefAndSpec`, :c:func:`PyModule_FromDefAndSpec2`, e :c:func:`PyModule_ExecDef` introduzidas pela :pep:`489` -- inicialização de módulos de extensão em múltiplas fases. (Contribuído por Petr Viktorin em :issue:`24268`.)
ru: Новые функции :c:func:`PyModule_FromDefAndSpec`, :c:func:`PyModule_FromDefAndSpec` и :c:func:`PyModule_ExecDef`, представленные :pep:`489` -- многофазной инициализацией модуля расширения. (Предоставлено Петром Викториным в :issue:`24268`.)
sv: Nya :c:func:`PyModule_FromDefAndSpec`, :c:func:`PyModule_FromDefAndSpec2`, och :c:func:`PyModule_ExecDef` funktioner införda av :pep:`489` -- initialisering av tilläggsmoduler i flera faser. (Bidrag från Petr Viktorin i :issue:`24268`.)

source: New :c:func:`PyNumber_MatrixMultiply` and :c:func:`PyNumber_InPlaceMatrixMultiply` functions to perform matrix multiplication. (Contributed by Benjamin Peterson in :issue:`21176`. See also :pep:`465` for details.)
pt_pt: Novas funções :c:func:`PyNumber_MatrixMultiply` e :c:func:`PyNumber_InPlaceMatrixMultiply` para realizar multiplicação de matrizes. (Contribuído por Benjamin Peterson em :issue:`21176`. Veja também :pep:`465` para detalhes.)
ru: Новые функции :c:func:`PyNumber_MatrixMultiply` и :c:func:`PyNumber_InPlaceMatrixMultiply` для выполнения матричного умножения. (Предоставлено Бенджамином Петерсоном в :issue:`21176`. Подробности см. также :pep:`465`.)
sv: Nya :c:func:`PyNumber_MatrixMultiply` och :c:func:`PyNumber_InPlaceMatrixMultiply` funktioner för att utföra matrismultiplikation. (Bidrag från Benjamin Peterson i :issue:`21176`. Se även :pep:`465` för detaljer)

source: The :c:member:`PyTypeObject.tp_finalize` slot is now part of the stable ABI.
pt_pt: O *slot* :c:member:`PyTypeObject.tp_finalize` agora faz parte da ABI estável.
ru: Слот :c:member:`PyTypeObject.tp_finalize` теперь является частью стабильного ABI.
sv: Platsen :c:member:`PyTypeObject.tp_finalize` är nu en del av det stabila ABI:et.

source: Windows builds now require Microsoft Visual C++ 14.0, which is available as part of `Visual Studio 2015 <https://visualstudio.microsoft.com/en/vs/older-downloads/#visual-studio-2015-and-other-products>`_.
pt_pt: As compilações para Windows agora requerem Microsoft Visual C++ 14.0, que está disponível como parte do `Visual Studio 2015 <https://visualstudio.microsoft.com/en/vs/older-downloads/#visual-studio-2015-and-other-products>`_.
ru: Для сборок Windows теперь требуется Microsoft Visual C++ 14.0, который доступен как часть Visual Studio 2015 <https://visualstudio.microsoft.com/en/vs/older-downloads/#visual-studio-2015-and-other-products >`_.
sv: Windows-versioner kräver nu Microsoft Visual C++ 14.0, som finns tillgängligt som en del av `Visual Studio 2015 <https://visualstudio.microsoft.com/en/vs/older-downloads/#visual-studio-2015-and-other-products>`_.

source: Extension modules now include a platform information tag in their filename on some platforms (the tag is optional, and CPython will import extensions without it, although if the tag is present and mismatched, the extension won't be loaded):
pt_pt: Os módulos de extensão agora incluem uma etiqueta de informação da plataforma nos seus nomes de ficheiro em algumas plataformas (a etiqueta é opcional, e o CPython importará extensões sem ela, embora se a etiqueta estiver presente e não corresponder, a extensão não será carregada):
ru: Модули расширений теперь включают тег информации о платформе в свое имя файла на некоторых платформах (тег не является обязательным, и CPython будет импортировать расширения без него, хотя, если тег присутствует и не соответствует, расширение не будет загружено):
sv: Tilläggsmoduler innehåller nu en plattformsinformationstagg i sitt filnamn på vissa plattformar (taggen är valfri och CPython importerar tillägg utan den, men om taggen finns och inte stämmer överens kommer tillägget inte att laddas):

source: On Linux, extension module filenames end with ``.cpython-<major><minor>m-<architecture>-<os>.pyd``:
pt_pt: No Linux, os nomes de ficheiros dos módulos de extensão terminam com ``.cpython-<major><minor>m-<architecture>-<os>.pyd``:
ru: В Linux имена файлов модулей расширения заканчиваются на ``.cpython-<major><minor>m-<architecture>-<os>.pyd``:
sv: På Linux slutar filnamn för tilläggsmoduler med ``.cpython-<major><minor>m-<architecture>-<os>.pyd``:

source: ``<major>`` is the major number of the Python version; for Python 3.5 this is ``3``.
pt_pt: ``<major>`` é o número principal da versão do Python; para o Python 3.5 este é ``3``.
ru: ``<major>`` — старший номер версии Python; для Python 3.5 это ``3``.
sv: ``<major>`` är huvudnumret för Python-versionen; för Python 3.5 är detta ``3``.

source: ``<minor>`` is the minor number of the Python version; for Python 3.5 this is ``5``.
pt_pt: ``<minor>`` é o número secundário da versão do Python; para o Python 3.5 este é ``5``.
ru: ``<minor>`` — это младший номер версии Python; для Python 3.5 это ``5``.
sv: ``<minor>`` är det mindre numret på Python-versionen; för Python 3.5 är detta ``5``.

source: ``<architecture>`` is the hardware architecture the extension module was built to run on. It's most commonly either ``i386`` for 32-bit Intel platforms or ``x86_64`` for 64-bit Intel (and AMD) platforms.
pt_pt: ``<architecture>`` é a arquitetura de hardware para a qual o módulo de extensão foi compilado para executar. É mais comumente ``i386`` para plataformas Intel de 32 bits ou ``x86_64`` para plataformas Intel (e AMD) de 64 bits.
ru: ``<architecture>`` — это аппаратная архитектура, для работы на которой создан модуль расширения. Чаще всего это либо ``i386`` для 32-битных платформ Intel, либо ``x86_64`` для 64-битных платформ Intel (и AMD).
sv: ``<architecture>`` är den hårdvaruarkitektur som tilläggsmodulen byggdes för att köras på. Det vanligaste är antingen ``i386`` för 32-bitars Intel-plattformar eller ``x86_64`` för 64-bitars Intel (och AMD)-plattformar.

source: ``<os>`` is always ``linux-gnu``, except for extensions built to talk to the 32-bit ABI on 64-bit platforms, in which case it is ``linux-gnu32`` (and ``<architecture>`` will be ``x86_64``).
pt_pt: ``<os>`` é sempre ``linux-gnu``, exceto para extensões compiladas para comunicar com a ABI de 32 bits em plataformas de 64 bits, caso em que será ``linux-gnu32`` (e ``<architecture>`` será ``x86_64``).
ru: ``<os>`` всегда называется ``linux-gnu``, за исключением расширений, созданных для взаимодействия с 32-битным ABI на 64-битных платформах, и в этом случае это ``linux-gnu32`` (и ``<os>`` `<архитектура>`` будет ``x86_64``).
sv: ``<os>`` är alltid ``linux-gnu``, förutom för tillägg som är byggda för att prata med 32-bitars ABI på 64-bitars plattformar, i vilket fall det är ``linux-gnu32`` (och ``<architecture>`` kommer att vara ``x86_64``).

source: On Windows, extension module filenames end with ``<debug>.cp<major><minor>-<platform>.pyd``:
pt_pt: No Windows, os nomes de ficheiros dos módulos de extensão terminam com ``<debug>.cp<major><minor>-<platform>.pyd``:
ru: В Windows имена файлов модулей расширения заканчиваются на ``<debug>.cp<major><minor>-<platform>.pyd``:
sv: I Windows slutar filnamnen för tilläggsmoduler med ``<debug>.cp<major><minor>-<platform>.pyd``:

source: ``<platform>`` is the platform the extension module was built for, either ``win32`` for Win32, ``win_amd64`` for Win64, ``win_ia64`` for Windows Itanium 64, and ``win_arm`` for Windows on ARM.
pt_pt: ``<platform>`` é a plataforma para a qual o módulo de extensão foi compilado, seja ``win32`` para Win32, ``win_amd64`` para Win64, ``win_ia64`` para Windows Itanium 64, e ``win_arm`` para Windows em ARM.
ru: ``<platform>`` — это платформа, для которой был создан модуль расширения: ``win32`` для Win32, ``win_amd64`` для Win64, ``win_ia64`` для Windows Itanium 64 и ``win_arm`` для Windows на ARM.
sv: ``<platform>`` är den plattform som tilläggsmodulen byggdes för, antingen ``win32`` för Win32, ``win_amd64`` för Win64, ``win_ia64`` för Windows Itanium 64 och ``win_arm`` för Windows on ARM.

source: If built in debug mode, ``<debug>`` will be ``_d``, otherwise it will be blank.
pt_pt: Se compilado em modo de depuração, ``<debug>`` será ``_d``, caso contrário, ficará em branco.
ru: Если он создан в режиме отладки, ``<debug>`` будет ``_d``, в противном случае он будет пустым.
sv: Om den är byggd i debugläge kommer ``<debug>`` att vara ``_d``, annars kommer den att vara tom.

source: On OS X platforms, extension module filenames now end with ``-darwin.so``.
pt_pt: Nas plataformas OS X, os nomes de ficheiros dos módulos de extensão agora terminam com ``-darwin.so``.
ru: На платформах OS X имена файлов модулей расширения теперь заканчиваются на ``-darwin.so``.
sv: På OS X-plattformar slutar filnamnen för tilläggsmoduler nu med ``\-darwin.so``.

source: On all other platforms, extension module filenames are the same as they were with Python 3.4.
pt_pt: Em todas as outras plataformas, os nomes de ficheiros dos módulos de extensão são os mesmos que eram com o Python 3.4.
ru: На всех других платформах имена файлов модулей расширения такие же, как и в Python 3.4.
sv: På alla andra plattformar är filnamnen för tilläggsmoduler desamma som de var med Python 3.4.

source: Deprecated
pt_pt: Obsoleto
ru: Устарел
sv: Föråldrat

source: New Keywords
pt_pt: Novas Palavras-Chave
ru: Новые ключевые слова
sv: Nya nyckelord

source: ``async`` and ``await`` are not recommended to be used as variable, class, function or module names. Introduced by :pep:`492` in Python 3.5, they will become proper keywords in Python 3.7.
pt_pt: Não é recomendado usar ``async`` e ``await`` como nomes de variáveis, classes, funções ou módulos. Introduzidas pela :pep:`492` no Python 3.5, tornar-se-ão palavras-chave próprias no Python 3.7.
ru: ``async`` и ``await`` не рекомендуется использовать в качестве имен переменных, классов, функций или модулей. Представленные :pep:`492` в Python 3.5, они станут полноценными ключевыми словами в Python 3.7.
sv: ``async`` och ``await`` rekommenderas inte att användas som variabel-, klass-, funktions- eller modulnamn. De introducerades av :pep:`492` i Python 3.5 och kommer att bli riktiga nyckelord i Python 3.7.

source: Deprecated Python Behavior
pt_pt: Comportamento Python Obsoleto
ru: Устаревшее поведение Python
sv: Föråldrat Python-beteende

source: Raising the :exc:`StopIteration` exception inside a generator will now generate a silent :exc:`PendingDeprecationWarning`, which will become a non-silent deprecation warning in Python 3.6 and will trigger a :exc:`RuntimeError` in Python 3.7. See :ref:`PEP 479: Change StopIteration handling inside generators <whatsnew-pep-479>` for details.
pt_pt: Lançar a exceção :exc:`StopIteration` dentro de um gerador agora gerará um aviso silencioso :exc:`PendingDeprecationWarning`, que se tornará um aviso de obsolescência não silencioso no Python 3.6 e desencadeará um :exc:`RuntimeError` no Python 3.7. Veja :ref:`PEP 479: Alterar o tratamento de StopIteration dentro de geradores <whatsnew-pep-479>` para detalhes.
ru: Вызов исключения :exc:`StopIteration` внутри генератора теперь будет генерировать молчаливое :exc:`PendingDeprecationWarning`, которое станет не-тихим предупреждением об устаревании в Python 3.6 и вызовет :exc:`RuntimeError` в Python 3.7. Подробности см. в разделе :ref:`PEP 479: изменение обработки StopIteration внутри генераторов <whatsnew-pep-479>`.
sv: Om man väcker :exc:`StopIteration`\-undantaget inuti en generator kommer det nu att generera en tyst :exc:`PendingDeprecationWarning`, som kommer att bli en icke-tyst deprecation-varning i Python 3.6 och kommer att utlösa ett :exc:`RuntimeError` i Python 3.7. Se :ref:`PEP 479: Ändra StopIteration-hanteringen i generatorer <whatsnew-pep-479>` för detaljer.

source: Unsupported Operating Systems
pt_pt: Sistemas Operativos Não Suportados
ru: Неподдерживаемые операционные системы
sv: Operativsystem som inte stöds

source: Windows XP is no longer supported by Microsoft, thus, per :PEP:`11`, CPython 3.5 is no longer officially supported on this OS.
pt_pt: O Windows XP já não é suportado pela Microsoft, portanto, de acordo com a :PEP:`11`, o CPython 3.5 já não é oficialmente suportado neste sistema operativo.
ru: Windows XP больше не поддерживается Microsoft, поэтому, согласно :PEP:`11`, CPython 3.5 больше официально не поддерживается в этой ОС.
sv: Windows XP stöds inte längre av Microsoft, vilket innebär att CPython 3.5 enligt :PEP:`11` inte längre stöds officiellt på detta operativsystem.

source: Deprecated Python modules, functions and methods
pt_pt: Módulos, funções e métodos Python obsoletos
ru: Устаревшие модули, функции и методы Python
sv: Föråldrade Python-moduler, -funktioner och -metoder

source: The :mod:`!formatter` module has now graduated to full deprecation and is still slated for removal in Python 3.6.
pt_pt: O módulo :mod:`!formatter` agora está completamente obsoleto e ainda está previsto para remoção no Python 3.6.

source: The :func:`!asyncio.async` function is deprecated in favor of :func:`~asyncio.ensure_future`.
pt_pt: A função :func:`!asyncio.async` está obsoleta em favor de :func:`~asyncio.ensure_future`.

source: The :mod:`!smtpd` module has in the past always decoded the DATA portion of email messages using the ``utf-8`` codec. This can now be controlled by the new *decode_data* keyword to :class:`!SMTPServer`. The default value is ``True``, but this default is deprecated. Specify the *decode_data* keyword with an appropriate value to avoid the deprecation warning.
pt_pt: O módulo :mod:`!smtpd` no passado sempre descodificava a parte DATA das mensagens de email usando o *codec* ``utf-8``. Isto agora pode ser controlado pela nova palavra-chave *decode_data* para :class:`!SMTPServer`. O valor predefinido é ``True``, mas este predefinido está obsoleto. Especifique a palavra-chave *decode_data* com um valor apropriado para evitar o aviso de obsolescência.
sv: Modulen :mod:`!smtpd` har tidigare alltid avkodat DATA-delen av e-postmeddelanden med hjälp av codec ``utf-8``. Detta kan nu kontrolleras med det nya nyckelordet *decode_data* i :class:`!SMTPServer`. Standardvärdet är ``True``, men detta standardvärde är föråldrat. Ange nyckelordet *decode_data* med ett lämpligt värde för att undvika deprecation-varningen.

source: Directly assigning values to the :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` and :attr:`~http.cookies.Morsel.coded_value` of :class:`http.cookies.Morsel` objects is deprecated. Use the :meth:`~http.cookies.Morsel.set` method instead. In addition, the undocumented *LegalChars* parameter of :meth:`~http.cookies.Morsel.set` is deprecated, and is now ignored.
pt_pt: Atribuir valores diretamente aos atributos :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` e :attr:`~http.cookies.Morsel.coded_value` de objetos :class:`http.cookies.Morsel` está obsoleto. Use o método :meth:`~http.cookies.Morsel.set` em vez disso. Além disso, o parâmetro não documentado *LegalChars* do método :meth:`~http.cookies.Morsel.set` está obsoleto e agora é ignorado.
ru: Непосредственное присвоение значений :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` и :attr:`~http.cookies.Morsel.coded_value` из :class: Объекты `http.cookies.Morsel` устарели. Вместо этого используйте метод :meth:`~http.cookies.Morsel.set`. Кроме того, недокументированный параметр *LegalChars* файла :meth:`~http.cookies.Morsel.set` устарел и теперь игнорируется.
sv: Att direkt tilldela värden till :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` och :attr:`~http.cookies.Morsel.coded_value` av :class:`http.cookies.Morsel`\-objekt är föråldrat. Använd istället metoden :meth:`~http.cookies.Morsel.set`. Dessutom är den odokumenterade parametern *LegalChars* i :meth:`~http.cookies.Morsel.set` föråldrad och ignoreras nu.

source: Passing a format string as keyword argument *format_string* to the :meth:`~string.Formatter.format` method of the :class:`string.Formatter` class has been deprecated. (Contributed by Serhiy Storchaka in :issue:`23671`.)
pt_pt: Passar uma *string* de formato como argumento de palavra-chave *format_string* para o método :meth:`~string.Formatter.format` da classe :class:`string.Formatter` está obsoleto. (Contribuído por Serhiy Storchaka em :issue:`23671`.)
ru: Передача строки формата в качестве аргумента ключевого слова *format_string* в метод :meth:`~string.Formatter.format` класса :class:`string.Formatter` устарела. (Предоставлено Сергеем Сторчакой в ​​:issue:`23671`.)
sv: Att skicka en formatsträng som nyckelordsargument *format_string* till :meth:`~string.Formatter.format`\-metoden i :class:`string.Formatter`\-klassen har utgått. (Bidrag från Serhiy Storchaka i :issue:`23671`.)

source: The :func:`!platform.dist` and :func:`!platform.linux_distribution` functions are now deprecated. Linux distributions use too many different ways of describing themselves, so the functionality is left to a package. (Contributed by Vajrasky Kok and Berker Peksag in :issue:`1322`.)
pt_pt: As funções :func:`!platform.dist` e :func:`!platform.linux_distribution` agora estão obsoletas. As distribuições Linux usam muitas formas diferentes de se descreverem, por isso a funcionalidade é deixada para um pacote. (Contribuído por Vajrasky Kok e Berker Peksag em :issue:`1322`.)

source: The previously undocumented ``from_function`` and ``from_builtin`` methods of :class:`inspect.Signature` are deprecated. Use the new :meth:`Signature.from_callable() <inspect.Signature.from_callable>` method instead. (Contributed by Yury Selivanov in :issue:`24248`.)
pt_pt: Os métodos não documentados ``from_function`` e ``from_builtin`` de :class:`inspect.Signature` estão obsoletos. Use o novo método :meth:`Signature.from_callable() <inspect.Signature.from_callable>` em vez disso. (Contribuído por Yury Selivanov em :issue:`24248`.)
ru: Ранее недокументированные методы from_function и from_builtin :class:inspect.Signature устарели. Вместо этого используйте новый метод :meth:`Signature.from_callable() <inspect.Signature.from_callable>`. (Автор: Юрий Селиванов в :issue:`24248`.)
sv: De tidigare odokumenterade metoderna ``from_function`` och ``from_builtin`` i :class:`inspect.Signature` är avförda. Använd den nya :meth:`Signature.from_callable() <inspect.Signature.from_callable>`\-metoden istället. (Bidrag från Yury Selivanov i :issue:`24248`.)

source: The :func:`!inspect.getargspec` function is deprecated and scheduled to be removed in Python 3.6. (See :issue:`20438` for details.)
pt_pt: A função :func:`!inspect.getargspec` está obsoleta e está agendada para ser removida no Python 3.6. (Veja :issue:`20438` para detalhes.)

source: The :mod:`inspect` :func:`~inspect.getfullargspec`, :func:`~inspect.getcallargs`, and :func:`!formatargspec` functions are deprecated in favor of the :func:`inspect.signature` API. (Contributed by Yury Selivanov in :issue:`20438`.)
pt_pt: As funções :mod:`inspect` :func:`~inspect.getfullargspec`, :func:`~inspect.getcallargs` e :func:`!formatargspec` estão obsoletas em favor da API :func:`inspect.signature`. (Contribuído por Yury Selivanov em :issue:`20438`.)

source: :func:`~inspect.getargvalues` and :func:`~inspect.formatargvalues` functions were inadvertently marked as deprecated with the release of Python 3.5.0.
pt_pt: As funções :func:`~inspect.getargvalues` e :func:`~inspect.formatargvalues` foram inadvertidamente marcadas como obsoletas com o lançamento do Python 3.5.0.
ru: Функции :func:`~inspect.getargvalues` и :func:`~inspect.formatargvalues` были случайно помечены как устаревшие в выпуске Python 3.5.0.
sv: funktionerna :func:`~inspect.getargvalues` och :func:`~inspect.formatargvalues` markerades oavsiktligt som föråldrade i och med lanseringen av Python 3.5.0.

source: Use of :const:`re.LOCALE` flag with str patterns or :const:`re.ASCII` is now deprecated. (Contributed by Serhiy Storchaka in :issue:`22407`.)
pt_pt: O uso da flag :const:`re.LOCALE` com padrões de *string* ou :const:`re.ASCII` está agora obsoleto. (Contribuído por Serhiy Storchaka em :issue:`22407`.)
ru: Использование флага :const:`re.LOCALE` с шаблонами str или :const:`re.ASCII` больше не рекомендуется. (Добавлен Сергеем Сторчакой в ​​:issue:`22407`.)
sv: Användning av flaggan :const:`re.LOCALE` med str-mönster eller :const:`re.ASCII` är nu föråldrad. (Bidrag från Serhiy Storchaka i :issue:`22407`.)

source: Use of unrecognized special sequences consisting of ``'\'`` and an ASCII letter in regular expression patterns and replacement patterns now raises a deprecation warning and will be forbidden in Python 3.6. (Contributed by Serhiy Storchaka in :issue:`23622`.)
pt_pt: O uso de sequências especiais não reconhecidas consistindo de ``'\'`` e uma letra ASCII em padrões de expressões regulares e padrões de substituição agora gera um aviso de obsolescência e será proibido no Python 3.6. (Contribuído por Serhiy Storchaka em :issue:`23622`.)
ru: Использование нераспознанных специальных последовательностей, состоящих из ``'\'`` и буквы ASCII в шаблонах регулярных выражений и шаблонах замены, теперь вызывает предупреждение об устаревании и будет запрещено в Python 3.6. (Предоставлено Сергеем Сторчакой в ​​:issue:`23622`.)
sv: Användning av oigenkända specialsekvenser bestående av ``'\'`` och en ASCII-bokstav i mönster för reguljära uttryck och ersättningsmönster ger nu upphov till en varning för föråldring och kommer att förbjudas i Python 3.6. (Bidrag från Serhiy Storchaka i :issue:`23622`.)

source: The undocumented and unofficial *use_load_tests* default argument of the :meth:`unittest.TestLoader.loadTestsFromModule` method now is deprecated and ignored. (Contributed by Robert Collins and Barry A. Warsaw in :issue:`16662`.)
pt_pt: O argumento predefinido não documentado e não oficial *use_load_tests* do método :meth:`unittest.TestLoader.loadTestsFromModule` agora está obsoleto e é ignorado. (Contribuído por Robert Collins e Barry A. Warsaw em :issue:`16662`.)
ru: Недокументированный и неофициальный аргумент по умолчанию *use_load_tests* метода :meth:`unittest.TestLoader.loadTestsFromModule` теперь считается устаревшим и игнорируется. (Предоставлено Робертом Коллинзом и Барри А. Варшавой в :issue:`16662`.)
sv: Det odokumenterade och inofficiella *use_load_tests* standardargumentet i metoden :meth:`unittest.TestLoader.loadTestsFromModule` är nu föråldrat och ignoreras. (Bidrag från Robert Collins och Barry A. Warsaw i :issue:`16662`.)

source: Removed
pt_pt: Removido
ru: Удалено
sv: Borttagen

source: API and Feature Removals
pt_pt: Remoções de API e Funcionalidades
ru: Удаление API и функций
sv: Borttagning av API och funktioner

source: The following obsolete and previously deprecated APIs and features have been removed:
pt_pt: As seguintes APIs e funcionalidades obsoletas e previamente obsoletas foram removidas:
ru: Следующие устаревшие и ранее не рекомендуемые API и функции были удалены:
sv: Följande föråldrade och tidigare utfasade API:er och funktioner har tagits bort:
