Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: The :func:`~doctest.DocTestSuite` function returns an empty :class:`unittest.TestSuite` if *module* contains no docstrings, instead of raising :exc:`ValueError`. (Contributed by Glenn Jones in :issue:`15916`.)
pt_pt: A função :func:`~doctest.DocTestSuite` devolve uma :class:`unittest.TestSuite` vazia se *module* não contiver *docstrings*, em vez de lançar :exc:`ValueError`. (Contribuído por Glenn Jones em :issue:`15916`.)
ru: Функция :func:`~doctest.DocTestSuite` возвращает пустой :class:`unittest.TestSuite`, если *module* не содержит строк документации, вместо вызова :exc:`ValueError`. (Предоставлено Гленном Джонсом в :issue:`15916`.)
sv: Funktionen :func:`~doctest.DocTestSuite` returnerar en tom :class:`unittest.TestSuite` om *modul* inte innehåller några docstrings, istället för att ge upphov till :exc:`ValueError`. (Bidrag från Glenn Jones i :issue:`15916`.)

source: A new policy option :attr:`Policy.mangle_from_ <email.policy.Policy.mangle_from_>` controls whether or not lines that start with ``"From "`` in email bodies are prefixed with a ``">"`` character by generators. The default is ``True`` for :attr:`~email.policy.compat32` and ``False`` for all other policies. (Contributed by Milan Oberkirch in :issue:`20098`.)
pt_pt: Uma nova opção de política :attr:`Policy.mangle_from_ <email.policy.Policy.mangle_from_>` controla se as linhas que começam com ``"From "`` nos corpos de email são prefixadas com um carácter ``">"`` pelos geradores. O valor predefinido é ``True`` para :attr:`~email.policy.compat32` e ``False`` para todas as outras políticas. (Contribuído por Milan Oberkirch em :issue:`20098`.)
ru: Новый параметр политики :attr:`Policy.mangle_from_ <email.policy.Policy.mangle_from_>` контролирует, будут ли строки, начинающиеся с ``"From "`` в тексте электронного письма, иметь префикс ``">"`` символ с помощью генераторов. По умолчанию установлено ``True`` для :attr:`~email.policy.compat32` и ``False`` для всех остальных политик. (Предоставлено Миланом Оберкирхом в :issue:`20098`.)
sv: Ett nytt policyalternativ :attr:`Policy.mangle_from_ <email.policy.Policy.mangle_from_>` styr om rader som börjar med ``"From"`` i e-posttexter ska föregås av ett ``">"``\-tecken av generatorer. Standardvärdet är ``True`` för :attr:`~email.policy.compat32` och ``False`` för alla andra policyer. (Bidrag från Milan Oberkirch i :issue:`20098`.)

source: A new :meth:`Message.get_content_disposition() <email.message.Message.get_content_disposition>` method provides easy access to a canonical value for the :mailheader:`Content-Disposition` header. (Contributed by Abhilash Raj in :issue:`21083`.)
pt_pt: Um novo método :meth:`Message.get_content_disposition() <email.message.Message.get_content_disposition>` fornece acesso fácil a um valor canónico para o cabeçalho :mailheader:`Content-Disposition`. (Contribuído por Abhilash Raj em :issue:`21083`.)
ru: Новый метод :meth:`Message.get_content_disposition() <email.message.Message.get_content_disposition>` обеспечивает легкий доступ к каноническому значению заголовка :mailheader:`Content-Disposition`. (Предоставлено Абхилашем Раджем в :issue:`21083`.)
sv: En ny :meth:`Message.get_content_disposition() <email.message.Message.get_content_disposition>`\-metod ger enkel åtkomst till ett kanoniskt värde för :mailheader:`Content-Disposition`\-huvudet. (Bidrag från Abhilash Raj i :issue:`21083`.)

source: A new policy option :attr:`EmailPolicy.utf8 <email.policy.EmailPolicy.utf8>` can be set to ``True`` to encode email headers using the UTF-8 charset instead of using encoded words. This allows ``Messages`` to be formatted according to :rfc:`6532` and used with an SMTP server that supports the :rfc:`6531` ``SMTPUTF8`` extension. (Contributed by R. David Murray in :issue:`24211`.)
pt_pt: Uma nova opção de política :attr:`EmailPolicy.utf8 <email.policy.EmailPolicy.utf8>` pode ser definida como ``True`` para codificar cabeçalhos de email usando o conjunto de caracteres UTF-8 em vez de usar palavras codificadas. Isto permite que ``Messages`` sejam formatadas de acordo com :rfc:`6532` e usadas com um servidor SMTP que suporta a extensão :rfc:`6531` ``SMTPUTF8``. (Contribuído por R. David Murray em :issue:`24211`.)
ru: Для нового параметра политики :attr:`EmailPolicy.utf8 <email.policy.EmailPolicy.utf8>` можно установить значение ``True`` для кодирования заголовков электронной почты с использованием кодировки UTF-8 вместо использования закодированных слов. Это позволяет форматировать «Сообщения» в соответствии с :rfc:`6532` и использовать их с SMTP-сервером, который поддерживает расширение :rfc:`6531```SMTPUTF8``. (Предоставлено Р. Дэвидом Мюрреем в :issue:`24211`.)
sv: Ett nytt policyalternativ :attr:`EmailPolicy.utf8 <email.policy.EmailPolicy.utf8>` kan sättas till ``True`` för att koda e-postrubriker med UTF-8-teckensnittet istället för att använda kodade ord. Detta gör att ``Messages`` kan formateras enligt :rfc:`6532` och användas med en SMTP-server som stöder tillägget :rfc:`6531` ``SMTPUTF8``. (Bidrag från R. David Murray i :issue:`24211`.)

source: The :class:`mime.text.MIMEText <email.mime.text.MIMEText>` constructor now accepts a :class:`charset.Charset <email.charset.Charset>` instance. (Contributed by Claude Paroz and Berker Peksag in :issue:`16324`.)
pt_pt: O construtor :class:`mime.text.MIMEText <email.mime.text.MIMEText>` agora aceita uma instância de :class:`charset.Charset <email.charset.Charset>`. (Contribuído por Claude Paroz e Berker Peksag em :issue:`16324`.)
ru: Конструктор :class:`mime.text.MIMEText <email.mime.text.MIMEText>` теперь принимает экземпляр :class:`charset.Charset <email.charset.Charset>`. (Предоставлено Клодом Парозом и Беркером Пексагом в :issue:`16324`.)
sv: Konstruktorn :class:`mime.text.MIMEText <email.mime.text.MIMEText>` accepterar nu en instans av :class:`charset.Charset <email.charset.Charset>`. (Bidrag från Claude Paroz och Berker Peksag i :issue:`16324`.)

source: The :class:`~enum.Enum` callable has a new parameter *start* to specify the initial number of enum values if only *names* are provided::
pt_pt: O chamável :class:`~enum.Enum` tem um novo parâmetro *start* para especificar o número inicial de valores de enumeração se apenas *names* forem fornecidos::
ru: Вызываемая функция :class:`~enum.Enum` имеет новый параметр *start* для указания начального количества значений перечисления, если указаны только *names*:
sv: Den anropsbara :class:`~enum.Enum` har en ny parameter *start* för att ange det initiala antalet enumvärden om endast *names* anges::

source: (Contributed by Ethan Furman in :issue:`21706`.)
pt_pt: (Contribuído por Ethan Furman em :issue:`21706`.)
ru: (Предоставлено Итаном Фурманом в :issue:`21706`.)
sv: (Bidrag från Ethan Furman i :issue:`21706`.)

source: The :func:`~faulthandler.enable`, :func:`~faulthandler.register`, :func:`~faulthandler.dump_traceback` and :func:`~faulthandler.dump_traceback_later` functions now accept file descriptors in addition to file-like objects. (Contributed by Wei Wu in :issue:`23566`.)
pt_pt: As funções :func:`~faulthandler.enable`, :func:`~faulthandler.register`, :func:`~faulthandler.dump_traceback` e :func:`~faulthandler.dump_traceback_later` agora aceitam descritores de ficheiro além de objetos tipo ficheiro. (Contribuído por Wei Wu em :issue:`23566`.)
ru: Функции :func:`~faulthandler.enable`, :func:`~faulthandler.register`, :func:`~faulthandler.dump_traceback` и :func:`~faulthandler.dump_traceback_later` теперь принимают файловые дескрипторы в дополнение к файловым дескрипторам. как предметы. (Предоставлено Вэй Ву в :issue:`23566`.)
sv: Funktionerna :func:`~faulthandler.enable`, :func:`~faulthandler.register`, :func:`~faulthandler.dump_traceback` och :func:`~faulthandler.dump_traceback_later` accepterar nu filbeskrivare i tillägg till filliknande objekt. (Bidrag från Wei Wu i :issue:`23566`.)

source: Most of the :func:`~functools.lru_cache` machinery is now implemented in C, making it significantly faster. (Contributed by Matt Joiner, Alexey Kachayev, and Serhiy Storchaka in :issue:`14373`.)
pt_pt: A maior parte da maquinaria de :func:`~functools.lru_cache` é agora implementada em C, tornando-a significativamente mais rápida. (Contribuído por Matt Joiner, Alexey Kachayev e Serhiy Storchaka em :issue:`14373`.)
ru: Большая часть механизма :func:`~functools.lru_cache` теперь реализована на C, что значительно ускоряет работу. (Предоставлено Мэттом Джойнером, Алексеем Качаевым и Сергеем Сторчакой в ​​:issue:`14373`.)
sv: Det mesta av :func:`~functools.lru_cache`\-maskineriet är nu implementerat i C, vilket gör det betydligt snabbare. (Bidrag från Matt Joiner, Alexey Kachayev och Serhiy Storchaka i :issue:`14373`.)

source: The :func:`~glob.iglob` and :func:`~glob.glob` functions now support recursive search in subdirectories, using the ``"**"`` pattern. (Contributed by Serhiy Storchaka in :issue:`13968`.)
pt_pt: As funções :func:`~glob.iglob` e :func:`~glob.glob` agora suportam pesquisa recursiva em subdiretórios, usando o padrão ``"**"``. (Contribuído por Serhiy Storchaka em :issue:`13968`.)
ru: Функции :func:`~glob.iglob` и :func:`~glob.glob` теперь поддерживают рекурсивный поиск в подкаталогах, используя шаблон ``"**"``. (Предоставлено Сергеем Сторчакой в ​​:issue:`13968`.)
sv: Funktionerna :func:`~glob.iglob` och :func:`~glob.glob` stöder nu rekursiv sökning i underkataloger med hjälp av mönstret ``"**"``. (Bidrag från Serhiy Storchaka i :issue:`13968`.)

source: The *mode* argument of the :class:`~gzip.GzipFile` constructor now accepts ``"x"`` to request exclusive creation. (Contributed by Tim Heaney in :issue:`19222`.)
pt_pt: O argumento *mode* do construtor :class:`~gzip.GzipFile` agora aceita ``"x"`` para solicitar criação exclusiva. (Contribuído por Tim Heaney em :issue:`19222`.)
ru: Аргумент *mode* конструктора :class:`~gzip.GzipFile` теперь принимает ``"x"`` для запроса эксклюзивного создания. (Предоставлено Тимом Хини в :issue:`19222`.)
sv: Argumentet *mode* i :class:`~gzip.GzipFile`\-konstruktören accepterar nu ``"x"`` för att begära exklusiv skapelse. (Bidrag från Tim Heaney i :issue:`19222`.)

source: Element comparison in :func:`~heapq.merge` can now be customized by passing a :term:`key function` in a new optional *key* keyword argument, and a new optional *reverse* keyword argument can be used to reverse element comparison::
pt_pt: A comparação de elementos em :func:`~heapq.merge` agora pode ser personalizada passando uma :term:`função-chave` num novo argumento opcional *key*, e um novo argumento opcional *reverse* pode ser usado para inverter a comparação de elementos::
ru: Сравнение элементов в :func:`~heapq.merge` теперь можно настроить, передав :term:`key function` в новом необязательном аргументе ключевого слова *key*, а для обратного изменения можно использовать новый необязательный аргумент ключевого слова *reverse*. сравнение элементов::
sv: Elementjämförelse i :func:`~heapq.merge` kan nu anpassas genom att skicka en :term:`key function` i ett nytt valfritt *key* nyckelordsargument, och ett nytt valfritt *reverse* nyckelordsargument kan användas för att vända elementjämförelsen::

source: (Contributed by Raymond Hettinger in :issue:`13742`.)
pt_pt: (Contribuído por Raymond Hettinger em :issue:`13742`.)
ru: (Предоставлено Рэймондом Хеттингером в :issue:`13742`.)
sv: (Bidrag från Raymond Hettinger i :issue:`13742`.)

source: A new :class:`HTTPStatus <http.HTTPStatus>` enum that defines a set of HTTP status codes, reason phrases and long descriptions written in English. (Contributed by Demian Brecht in :issue:`21793`.)
pt_pt: Uma nova enumeração :class:`HTTPStatus <http.HTTPStatus>` que define um conjunto de códigos de estado HTTP, frases de razão e descrições longas escritas em inglês. (Contribuído por Demian Brecht em :issue:`21793`.)
ru: Новое перечисление :class:`HTTPStatus <http.HTTPStatus>`, которое определяет набор кодов состояния HTTP, фраз-причин и длинных описаний, написанных на английском языке. (Предоставлено Демианом Брехтом в :issue:`21793`.)
sv: En ny :class:`HTTPStatus <http.HTTPStatus>` enum som definierar en uppsättning HTTP-statuskoder, orsaksfraser och långa beskrivningar skrivna på engelska. (Bidrag från Demian Brecht i :issue:`21793`.)

source: :meth:`HTTPConnection.getresponse() <http.client.HTTPConnection.getresponse>` now raises a :exc:`~http.client.RemoteDisconnected` exception when a remote server connection is closed unexpectedly. Additionally, if a :exc:`ConnectionError` (of which ``RemoteDisconnected`` is a subclass) is raised, the client socket is now closed automatically, and will reconnect on the next request::
pt_pt: :meth:`HTTPConnection.getresponse() <http.client.HTTPConnection.getresponse>` agora lança uma exceção :exc:`~http.client.RemoteDisconnected` quando uma ligação a um servidor remoto é fechada inesperadamente. Além disso, se for lançada uma :exc:`ConnectionError` (da qual ``RemoteDisconnected`` é uma subclasse), o *socket* do cliente é agora fechado automaticamente e reconectará na próxima solicitação::
ru: :meth:`HTTPConnection.getresponse() <http.client.HTTPConnection.getresponse>` теперь вызывает исключение :exc:`~http.client.RemoteDisconnected`, когда соединение с удаленным сервером неожиданно закрывается. Кроме того, если возникает :exc:`ConnectionError` (подклассом которого является ``RemoteDisconnected``), клиентский сокет теперь закрывается автоматически и будет повторно подключаться при следующем запросе:
sv: :meth:`HTTPConnection.getresponse() <http.client.HTTPConnection.getresponse>` ger nu upphov till ett :exc:`~http.client.RemoteDisconnected` undantag när en fjärrserveranslutning oväntat stängs. Dessutom, om ett :exc:`ConnectionError` (som ``RemoteDisconnected`` är en underklass till) uppstår, stängs nu klientuttaget automatiskt och återansluts vid nästa begäran:

source: (Contributed by Martin Panter in :issue:`3566`.)
pt_pt: (Contribuído por Martin Panter em :issue:`3566`.)
ru: (Предоставлено Мартином Пантером в :issue:`3566`.)
sv: (Bidrag från Martin Panter i :issue:`3566`.)

source: idlelib and IDLE
pt_pt: idlelib e IDLE
ru: idlelib и IDLE
sv: idlelib och IDLE

source: Since idlelib implements the IDLE shell and editor and is not intended for import by other programs, it gets improvements with every release. See :file:`Lib/idlelib/NEWS.txt` for a cumulative list of changes since 3.4.0, as well as changes made in future 3.5.x releases. This file is also available from the IDLE :menuselection:`Help --> About IDLE` dialog.
pt_pt: Como o idlelib implementa a *shell* e o editor IDLE e não é destinado a ser importado por outros programas, recebe melhorias em cada lançamento. Consulte :file:`Lib/idlelib/NEWS.txt` para uma lista cumulativa de alterações desde o 3.4.0, bem como alterações feitas em futuras versões 3.5.x. Este ficheiro também está disponível a partir do diálogo :menuselection:`Ajuda --> Sobre o IDLE` do IDLE.
ru: Поскольку Idlelib реализует оболочку и редактор IDLE и не предназначен для импорта другими программами, он совершенствуется с каждым выпуском. См. :file:`Lib/idlelib/NEWS.txt` для получения совокупного списка изменений, начиная с версии 3.4.0, а также изменений, внесенных в будущие выпуски 3.5.x. Этот файл также доступен в диалоговом окне IDLE :menuselection:`Справка --> О IDLE`.
sv: Eftersom idlelib implementerar IDLE:s skal och redigerare och inte är avsett att importeras av andra program, förbättras det för varje utgåva. Se :file:`Lib/idlelib/NEWS.txt` för en kumulativ lista över ändringar sedan 3.4.0, samt ändringar som görs i framtida 3.5.x utgåvor. Den här filen är också tillgänglig från IDLE:s :menuselection:`Hjälp --> Om IDLE`\-dialogruta.

source: The :class:`~imaplib.IMAP4` class now supports the :term:`context manager` protocol. When used in a :keyword:`with` statement, the IMAP4 ``LOGOUT`` command will be called automatically at the end of the block. (Contributed by Tarek Ziadé and Serhiy Storchaka in :issue:`4972`.)
pt_pt: A classe :class:`~imaplib.IMAP4` agora suporta o protocolo :term:`gestor de contexto`. Quando usada numa instrução :keyword:`with`, o comando IMAP4 ``LOGOUT`` será chamado automaticamente no final do bloco. (Contribuído por Tarek Ziadé e Serhiy Storchaka em :issue:`4972`.)
ru: Класс :class:`~imaplib.IMAP4` теперь поддерживает протокол :term:`контекстного менеджера`. При использовании в операторе :keyword:`with` команда IMAP4 ``LOGOUT`` будет вызываться автоматически в конце блока. (Предоставлено Тарек Зиаде и Сергей Сторчака в :issue:`4972`.)
sv: Klassen :class:`~imaplib.IMAP4` har nu stöd för protokollet :term:`context manager`. När det används i en :keyword:`with`\-sats kommer IMAP4-kommandot ``LOGOUT`` att anropas automatiskt i slutet av blocket. (Bidrag från Tarek Ziadé och Serhiy Storchaka i :issue:`4972`.)

source: The :mod:`imaplib` module now supports :rfc:`5161` (ENABLE Extension) and :rfc:`6855` (UTF-8 Support) via the :meth:`IMAP4.enable() <imaplib.IMAP4.enable>` method. A new :attr:`IMAP4.utf8_enabled <imaplib.IMAP4.utf8_enabled>` attribute tracks whether or not :rfc:`6855` support is enabled. (Contributed by Milan Oberkirch, R. David Murray, and Maciej Szulik in :issue:`21800`.)
pt_pt: O módulo :mod:`imaplib` agora suporta :rfc:`5161` (Extensão ENABLE) e :rfc:`6855` (Suporte UTF-8) através do método :meth:`IMAP4.enable() <imaplib.IMAP4.enable>`. Um novo atributo :attr:`IMAP4.utf8_enabled <imaplib.IMAP4.utf8_enabled>` regista se o suporte :rfc:`6855` está ativado. (Contribuído por Milan Oberkirch, R. David Murray e Maciej Szulik em :issue:`21800`.)
ru: Модуль :mod:`imaplib` теперь поддерживает :rfc:`5161` (расширение ENABLE) и :rfc:`6855` (поддержка UTF-8) через :meth:`IMAP4.enable() <imaplib.IMAP4.enable >` метод. Новый атрибут :attr:`IMAP4.utf8_enabled <imaplib.IMAP4.utf8_enabled>` отслеживает, включена ли поддержка :rfc:`6855`. (Предоставлено Миланом Оберкирхом, Р. Дэвидом Мюрреем и Мацеем Шуликом в :issue:`21800`.)
sv: Modulen :mod:`imaplib` stöder nu :rfc:`5161` (ENABLE Extension) och :rfc:`6855` (UTF-8 Support) via metoden :meth:`IMAP4.enable() <imaplib.IMAP4.enable>`. Ett nytt attribut :attr:`IMAP4.utf8_enabled <imaplib.IMAP4.utf8_enabled>` spårar om stöd för :rfc:`6855` är aktiverat eller inte. (Bidrag från Milan Oberkirch, R. David Murray och Maciej Szulik i :issue:`21800`.)

source: The :mod:`imaplib` module now automatically encodes non-ASCII string usernames and passwords using UTF-8, as recommended by the RFCs. (Contributed by Milan Oberkirch in :issue:`21800`.)
pt_pt: O módulo :mod:`imaplib` agora codifica automaticamente nomes de utilizador e palavras-passe não-ASCII usando UTF-8, como recomendado pelas RFCs. (Contribuído por Milan Oberkirch em :issue:`21800`.)
ru: Модуль :mod:`imaplib` теперь автоматически кодирует имена пользователей и пароли в виде строк, отличных от ASCII, с использованием UTF-8, как рекомендовано RFC. (Предоставлено Миланом Оберкирхом в :issue:`21800`.)
sv: Modulen :mod:`imaplib` kodar nu automatiskt användarnamn och lösenord i icke-ASCII-strängar med UTF-8, enligt RFC:s rekommendationer. (Bidrag från Milan Oberkirch i :issue:`21800`.)

source: The :func:`!what` function now recognizes the `OpenEXR <https://www.openexr.com>`_ format (contributed by Martin Vignali and Claudiu Popa in :issue:`20295`), and the `WebP <https://en.wikipedia.org/wiki/WebP>`_ format (contributed by Fabrice Aneche and Claudiu Popa in :issue:`20197`.)
pt_pt: A função :func:`!what` agora reconhece o formato `OpenEXR <https://www.openexr.com>`_ (contribuído por Martin Vignali e Claudiu Popa em :issue:`20295`), e o formato `WebP <https://en.wikipedia.org/wiki/WebP>`_ (contribuído por Fabrice Aneche e Claudiu Popa em :issue:`20197`.)
sv: Funktionen :func:`!what` känner nu igen formatet `OpenEXR <https://www.openexr.com>`_ (bidrag från Martin Vignali och Claudiu Popa i :issue:`20295`) och formatet `WebP <https://en.wikipedia.org/wiki/WebP>`_ (bidrag från Fabrice Aneche och Claudiu Popa i :issue:`20197`)

source: The :class:`util.LazyLoader <importlib.util.LazyLoader>` class allows for lazy loading of modules in applications where startup time is important. (Contributed by Brett Cannon in :issue:`17621`.)
pt_pt: A classe :class:`util.LazyLoader <importlib.util.LazyLoader>` permite o carregamento preguiçoso de módulos em aplicações onde o tempo de arranque é importante. (Contribuído por Brett Cannon em :issue:`17621`.)
ru: Класс :class:`util.LazyLoader <importlib.util.LazyLoader>` позволяет выполнять отложенную загрузку модулей в приложениях, где время запуска важно. (Предоставлено Бреттом Кэнноном в :issue:`17621`.)
sv: Klassen :class:`util.LazyLoader <importlib.util.LazyLoader>` möjliggör latladdning av moduler i applikationer där starttiden är viktig. (Bidrag från Brett Cannon i :issue:`17621`.)

source: The :func:`abc.InspectLoader.source_to_code() <importlib.abc.InspectLoader.source_to_code>` method is now a static method. This makes it easier to initialize a module object with code compiled from a string by running ``exec(code, module.__dict__)``. (Contributed by Brett Cannon in :issue:`21156`.)
pt_pt: O método :func:`abc.InspectLoader.source_to_code() <importlib.abc.InspectLoader.source_to_code>` é agora um método estático. Isto facilita a inicialização de um objeto de módulo com código compilado a partir de uma *string* executando ``exec(code, module.__dict__)``. (Contribuído por Brett Cannon em :issue:`21156`.)
ru: Метод :func:`abc.InspectLoader.source_to_code() <importlib.abc.InspectLoader.source_to_code>` теперь является статическим методом. Это упрощает инициализацию объекта модуля с помощью кода, скомпилированного из строки, запустив ``exec(code, Module.__dict__)``. (Предоставлено Бреттом Кэнноном в :issue:`21156`.)
sv: Metoden :func:`abc.InspectLoader.source_to_code() <importlib.abc.InspectLoader.source_to_code>` är nu en statisk metod. Detta gör det enklare att initiera ett modulobjekt med kod som kompilerats från en sträng genom att köra ``exec(code, module.__dict__)``. (Bidrag från Brett Cannon i :issue:`21156`.)

source: The new :func:`util.module_from_spec() <importlib.util.module_from_spec>` function is now the preferred way to create a new module. As opposed to creating a :class:`types.ModuleType` instance directly, this new function will set the various import-controlled attributes based on the passed-in spec object. (Contributed by Brett Cannon in :issue:`20383`.)
pt_pt: A nova função :func:`util.module_from_spec() <importlib.util.module_from_spec>` é agora a forma preferida de criar um novo módulo. Em oposição à criação direta de uma instância :class:`types.ModuleType`, esta nova função definirá os vários atributos controlados por importação com base no objeto de especificação passado. (Contribuído por Brett Cannon em :issue:`20383`.)
ru: Новая функция :func:`util.module_from_spec() <importlib.util.module_from_spec>` теперь является предпочтительным способом создания нового модуля. В отличие от непосредственного создания экземпляра :class:`types.ModuleType`, эта новая функция будет устанавливать различные атрибуты, управляемые импортом, на основе переданного объекта спецификации. (Предоставлено Бреттом Кэнноном в :issue:`20383`.)
sv: Den nya funktionen :func:`util.module_from_spec() <importlib.util.module_from_spec>` är nu det föredragna sättet att skapa en ny modul. I motsats till att skapa en :class:`types.ModuleType`\-instans direkt, kommer den här nya funktionen att ställa in de olika importkontrollerade attributen baserat på det inskickade spec-objektet. (Bidrag från Brett Cannon i :issue:`20383`.)
