Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.5.po
Languages: pt_pt, ru, sv

source: :pep:`492` -- Coroutines with async and await syntax
pt_pt: :pep:`492` — *Coroutines* com sintaxe *async* e *await*
ru: :pep:`492` -- Сопрограммы с синтаксисом async и await
sv: :pep:`492` -- Coroutines med async- och await-syntax

source: PEP written and implemented by Yury Selivanov.
pt_pt: PEP escrita e implementada por Yury Selivanov.
sv: PEP skrivet och implementerat av Yury Selivanov.

source: PEP 465 - A dedicated infix operator for matrix multiplication
pt_pt: PEP 465 — Um operador infixo dedicado para multiplicação de matrizes
ru: PEP 465 — специальный инфиксный оператор для умножения матриц.
sv: PEP 465 - En dedikerad infixoperator för matrismultiplikation

source: :pep:`465` adds the ``@`` infix operator for matrix multiplication. Currently, no builtin Python types implement the new operator, however, it can be implemented by defining :meth:`~object.__matmul__`, :meth:`~object.__rmatmul__`, and :meth:`~object.__imatmul__` for regular, reflected, and in-place matrix multiplication. The semantics of these methods is similar to that of methods defining other infix arithmetic operators.
pt_pt: A :pep:`465` adiciona o operador infixo ``@`` para multiplicação de matrizes. Atualmente, nenhum tipo integrado do Python implementa o novo operador, no entanto, este pode ser implementado definindo :meth:`~object.__matmul__`, :meth:`~object.__rmatmul__` e :meth:`~object.__imatmul__` para multiplicação de matrizes regular, refletida e *in-place*. A semântica destes métodos é semelhante à dos métodos que definem outros operadores aritméticos infixos.

source: Matrix multiplication is a notably common operation in many fields of mathematics, science, engineering, and the addition of ``@`` allows writing cleaner code::
pt_pt: A multiplicação de matrizes é uma operação notavelmente comum em muitos campos da matemática, ciência e engenharia, e a adição de ``@`` permite escrever código mais limpo::
ru: Умножение матриц — весьма распространенная операция во многих областях математики, науки, техники, а добавление @ позволяет писать более чистый код:
sv: Matrismultiplikation är en mycket vanlig operation inom många områden av matematik, vetenskap, teknik och tillägget av ``@`` gör det möjligt att skriva renare kod::

source: instead of::
pt_pt: em vez de:
ru: вместо::
sv: istället för::

source: NumPy 1.10 has support for the new operator::
pt_pt: O NumPy 1.10 tem suporte para o novo operador:
ru: В NumPy 1.10 есть поддержка нового оператора::
sv: NumPy 1.10 har stöd för den nya operatorn::

source: :pep:`465` -- A dedicated infix operator for matrix multiplication
pt_pt: :pep:`465` — Um operador infixo dedicado para multiplicação de matrizes
ru: :pep:`465` -- Специальный инфиксный оператор для умножения матриц.
sv: :pep:`465` -- En dedikerad infixoperator för matrismultiplikation

source: PEP written by Nathaniel J. Smith; implemented by Benjamin Peterson.
pt_pt: PEP escrita por Nathaniel J. Smith; implementada por Benjamin Peterson.
ru: PEP, написанный Натаниэлем Дж. Смитом; реализован Бенджамином Петерсоном.
sv: PEP skriven av Nathaniel J. Smith; implementerad av Benjamin Peterson.

source: PEP 448 - Additional Unpacking Generalizations
pt_pt: PEP 448 — Generalizações Adicionais de *Unpacking*
ru: PEP 448 — Дополнительные обобщения распаковки
sv: PEP 448 - Ytterligare generaliseringar för uppackning

source: :pep:`448` extends the allowed uses of the ``*`` iterable unpacking operator and ``**`` dictionary unpacking operator. It is now possible to use an arbitrary number of unpackings in :ref:`function calls <calls>`::
pt_pt: A :pep:`448` estende os usos permitidos do operador de *unpacking* iterável ``*`` e do operador de *unpacking* de dicionário ``**``. Agora é possível usar um número arbitrário de *unpackings* em :ref:`chamadas de função <calls>`::
ru: :pep:`448` расширяет возможности использования итерируемого оператора распаковки ``*`` и оператора распаковки словаря ``**``. Теперь можно использовать произвольное количество распаковок в :ref:`вызовах функций <calls>`::
sv: :pep:`448` utökar de tillåtna användningarna av ``*`` iterable unpacking operator och ``**`` dictionary unpacking operator. Det är nu möjligt att använda ett godtyckligt antal uppackningar i :ref:`funktionsanrop <calls>`::

source: Similarly, tuple, list, set, and dictionary displays allow multiple unpackings (see :ref:`exprlists` and :ref:`dict`)::
pt_pt: Da mesma forma, as exibições de tuplo, lista, conjunto e dicionário permitem múltiplos *unpackings* (consulte :ref:`exprlists` e :ref:`dict`):
ru: Аналогично, отображение кортежа, списка, набора и словаря допускает множественную распаковку (см. :ref:`exprlists` и :ref:`dict`)::
sv: På samma sätt tillåter tuple-, list-, set- och dictionary-displayer flera uppackningar (se :ref:`exprlists` och :ref:`dict`)::

source: :pep:`448` -- Additional Unpacking Generalizations
pt_pt: :pep:`448` — Generalizações Adicionais de *Unpacking*
ru: :pep:`448` -- Дополнительные обобщения распаковки
sv: :pep:`448` -- Ytterligare generaliseringar av uppackning

source: PEP written by Joshua Landau; implemented by Neil Girdhar, Thomas Wouters, and Joshua Landau.
pt_pt: PEP escrita por Joshua Landau; implementada por Neil Girdhar, Thomas Wouters e Joshua Landau.
ru: PEP, написанный Джошуа Ландау; реализовано Нилом Гирдхаром, Томасом Воутерсом и Джошуа Ландау.
sv: PEP skriven av Joshua Landau; implementerad av Neil Girdhar, Thomas Wouters och Joshua Landau.

source: PEP 461 - percent formatting support for bytes and bytearray
pt_pt: PEP 461 — Suporte de formatação percentual para *bytes* e *bytearray*
ru: PEP 461 — поддержка процентного форматирования байтов и байтовых массивов.
sv: PEP 461 - Stöd för procentformatering för bytes och bytearray

source: :pep:`461` adds support for the ``%`` :ref:`interpolation operator <bytes-formatting>` to :class:`bytes` and :class:`bytearray`.
pt_pt: A :pep:`461` adiciona suporte para o operador de :ref:`interpolação <bytes-formatting>`` ``%`` a :class:`bytes` e :class:`bytearray`.
ru: :pep:`461` добавляет поддержку оператора интерполяции ``%`` :ref:`<bytes-formatting>` в :class:`bytes` и :class:`bytearray`.
sv: :pep:`461` lägger till stöd för ``%`` :ref:`interpolationsoperatorn <bytes-formatting>` till :class:`bytes` och :class:`bytearray`.

source: While interpolation is usually thought of as a string operation, there are cases where interpolation on ``bytes`` or ``bytearrays`` makes sense, and the work needed to make up for this missing functionality detracts from the overall readability of the code. This issue is particularly important when dealing with wire format protocols, which are often a mixture of binary and ASCII compatible text.
pt_pt: Embora a interpolação seja geralmente considerada uma operação de *string*, existem casos em que a interpolação em ``bytes`` ou ``bytearrays`` faz sentido, e o trabalho necessário para compensar esta funcionalidade em falta prejudica a legibilidade geral do código. Esta questão é particularmente importante ao lidar com protocolos de formato de transmissão, que são frequentemente uma mistura de dados binários e texto compatível com ASCII.
ru: Хотя интерполяцию обычно рассматривают как строковую операцию, бывают случаи, когда интерполяция на ``байтах`` или ``байтовых массивах`` имеет смысл, и работа, необходимая для восполнения этой недостающей функциональности, ухудшает общую читаемость кода. . Эта проблема особенно важна при работе с протоколами проводного формата, которые часто представляют собой смесь двоичного и ASCII-совместимого текста.
sv: Även om interpolering vanligtvis betraktas som en strängoperation finns det fall där interpolering på ``bytes`` eller ``bytearrays`` är meningsfullt, och det arbete som krävs för att kompensera för denna saknade funktionalitet försämrar den övergripande läsbarheten i koden. Denna fråga är särskilt viktig när man hanterar protokoll i trådformat, som ofta är en blandning av binär och ASCII-kompatibel text.

source: Examples::
pt_pt: Exemplos:
ru: Примеры::
sv: Exempel::

source: Unicode is not allowed for ``%b``, but it is accepted by ``%a`` (equivalent of ``repr(obj).encode('ascii', 'backslashreplace')``)::
pt_pt: Unicode não é permitido para ``%b``, mas é aceite por ``%a`` (equivalente a ``repr(obj).encode('ascii', 'backslashreplace')``)::
ru: Юникод не поддерживается для ``%b``, но он принимается `` %а `` (эквивалент ``repr(obj).encode('ascii', 'backslashreplace')``)::
sv: Unicode är inte tillåtet för ``%b``, men det accepteras av ``%a`` (motsvarande ``repr(obj).encode('ascii', 'backslashreplace')``)::

source: Note that ``%s`` and ``%r`` conversion types, although supported, should only be used in codebases that need compatibility with Python 2.
pt_pt: Note que os tipos de conversão ``%s`` e ``%r``, embora suportados, só devem ser usados em bases de código que necessitam de compatibilidade com o Python 2.
ru: Обратите внимание, что `` %s Типы преобразования `` и ``%r``, хотя и поддерживаются, должны использоваться только в тех базах кода, которым необходима совместимость с Python 2.
sv: Observera att konverteringstyperna ``%s`` och ``%r``, även om de stöds, endast bör användas i kodbaser som behöver kompatibilitet med Python 2.

source: :pep:`461` -- Adding % formatting to bytes and bytearray
pt_pt: :pep:`461` — Adicionar formatação % a *bytes* e *bytearray*
ru: :pep:`461` -- Добавление % форматирования к байтам и байтаррайю
sv: :pep:`461` -- Lägger till % formatting till bytes och bytearray

source: PEP written by Ethan Furman; implemented by Neil Schemenauer and Ethan Furman.
pt_pt: PEP escrita por Ethan Furman; implementada por Neil Schemenauer e Ethan Furman.
ru: PEP, написанный Итаном Фурманом; реализовано Нилом Шеменауэром и Итаном Фурманом.
sv: PEP skriven av Ethan Furman; implementerad av Neil Schemenauer och Ethan Furman.

source: PEP 484 - Type Hints
pt_pt: PEP 484 — Dicas de Tipo
ru: PEP 484 — Подсказки по типам
sv: PEP 484 - Tips om typ

source: Function annotation syntax has been a Python feature since version 3.0 (:pep:`3107`), however the semantics of annotations has been left undefined.
pt_pt: A sintaxe de anotação de funções tem sido uma funcionalidade do Python desde a versão 3.0 (:pep:`3107`), no entanto, a semântica das anotações tem sido deixada indefinida.
ru: Синтаксис аннотаций функций является функцией Python начиная с версии 3.0 (:pep:`3107`), однако семантика аннотаций осталась неопределенной.
sv: Syntaxen för funktionsannoteringar har varit en Python-funktion sedan version 3.0 (:pep:`3107`), men semantiken för annoteringar har lämnats odefinierad.

source: Experience has shown that the majority of function annotation uses were to provide type hints to function parameters and return values. It became evident that it would be beneficial for Python users, if the standard library included the base definitions and tools for type annotations.
pt_pt: A experiência mostrou que a maioria dos usos de anotações de funções era para fornecer dicas de tipo para parâmetros de função e valores de retorno. Tornou-se evidente que seria benéfico para os utilizadores do Python se a biblioteca padrão incluísse as definições base e ferramentas para anotações de tipo.
ru: Опыт показал, что большинство аннотаций функций используются для предоставления подсказок типа для параметров функции и возвращаемых значений. Стало очевидно, что для пользователей Python было бы полезно, если бы стандартная библиотека включала базовые определения и инструменты для аннотаций типов.
sv: Erfarenheten har visat att de flesta funktionsannoteringar används för att ge typtips till funktionsparametrar och returvärden. Det blev uppenbart att det skulle vara till nytta för Python-användare om standardbiblioteket innehöll basdefinitioner och verktyg för typannoteringar.

source: :pep:`484` introduces a :term:`provisional module <provisional API>` to provide these standard definitions and tools, along with some conventions for situations where annotations are not available.
pt_pt: A :pep:`484` introduz um :term:`módulo provisório <provisional API>` para fornecer estas definições e ferramentas padrão, juntamente com algumas convenções para situações em que as anotações não estão disponíveis.
ru: :pep:`484` представляет :term:`предварительный модуль <предварительный API>` для предоставления этих стандартных определений и инструментов, а также некоторых соглашений для ситуаций, когда аннотации недоступны.
sv: :pep:`484` introducerar en :term:`provisorisk modul <provisional API>` för att tillhandahålla dessa standarddefinitioner och verktyg, tillsammans med vissa konventioner för situationer där anteckningar inte är tillgängliga.

source: For example, here is a simple function whose argument and return type are declared in the annotations::
pt_pt: Por exemplo, aqui está uma função simples cujos argumentos e tipo de retorno são declarados nas anotações::
ru: Например, вот простая функция, аргумент и тип возвращаемого значения которой объявлены в аннотациях:
sv: Här är till exempel en enkel funktion vars argument och returtyp deklareras i annotationerna::

source: While these annotations are available at runtime through the usual :attr:`~object.__annotations__` attribute, *no automatic type checking happens at runtime*. Instead, it is assumed that a separate off-line type checker (e.g. `mypy <https://mypy-lang.org>`_) will be used for on-demand source code analysis.
pt_pt: Embora estas anotações estejam disponíveis em tempo de execução através do atributo habitual :attr:`~object.__annotations__`, *nenhuma verificação de tipo automática ocorre em tempo de execução*. Em vez disso, assume-se que um verificador de tipo separado e *off-line* (por exemplo, `mypy <https://mypy-lang.org>`_) será usado para análise de código-fonte sob demanda.
sv: Även om dessa anteckningar är tillgängliga vid körning genom det vanliga attributet :attr:`~object.__annotations__`, sker *ingen automatisk typkontroll vid körning*. Istället antas det att en separat off-line typkontroll (t.ex. `mypy <https://mypy-lang.org>`_) kommer att användas för on-demand källkodsanalys.

source: The type system supports unions, generic types, and a special type named :class:`~typing.Any` which is consistent with (i.e. assignable to and from) all types.
pt_pt: O sistema de tipos suporta uniões, tipos genéricos e um tipo especial chamado :class:`~typing.Any`, que é consistente com (ou seja, atribuível a e de) todos os tipos.
ru: Система типов поддерживает объединения, универсальные типы и специальный тип с именем :class:`~typing.Any`, который совместим со всеми типами (т. е. может быть присвоен и из них).
sv: Typsystemet stöder unioner, generiska typer och en speciell typ med namnet :class:`~typing.Any` som är konsekvent med (dvs. kan tilldelas till och från) alla typer.

source: :mod:`typing` module documentation
pt_pt: Documentação do módulo :mod:`typing`
ru: Документация по модулю :mod:`typing`
sv: Dokumentation för modulen :mod:`typing`

source: :pep:`484` -- Type Hints
pt_pt: :pep:`484` — Dicas de Tipo
ru: :pep:`484` -- Подсказки по типам
sv: :pep:`484` -- Tips om typ

source: PEP written by Guido van Rossum, Jukka Lehtosalo, and Łukasz Langa; implemented by Guido van Rossum.
pt_pt: PEP escrita por Guido van Rossum, Jukka Lehtosalo e Łukasz Langa; implementada por Guido van Rossum.
ru: PEP, написанный Гвидо ван Россумом, Юккой Лехтосало и Лукашом Лангой; реализован Гвидо ван Россумом.
sv: PEP skriven av Guido van Rossum, Jukka Lehtosalo och Łukasz Langa; implementerad av Guido van Rossum.

source: :pep:`483` -- The Theory of Type Hints
pt_pt: :pep:`483` — A Teoria das Dicas de Tipo
ru: :pep:`483` -- Теория подсказок типов
sv: :pep:`483` -- Teorin om typhintar

source: PEP written by Guido van Rossum
pt_pt: PEP escrita por Guido van Rossum
ru: PEP, автор: Гвидо ван Россум
sv: PEP skriven av Guido van Rossum

source: PEP 471 - os.scandir() function -- a better and faster directory iterator
pt_pt: PEP 471 — Função os.scandir() — um iterador de diretórios melhor e mais rápido
ru: PEP 471 — функция os.scandir() — лучший и быстрый итератор каталогов
sv: PEP 471 - os.scandir()-funktionen - en bättre och snabbare katalogiterator

source: :pep:`471` adds a new directory iteration function, :func:`os.scandir`, to the standard library. Additionally, :func:`os.walk` is now implemented using ``scandir``, which makes it 3 to 5 times faster on POSIX systems and 7 to 20 times faster on Windows systems. This is largely achieved by greatly reducing the number of calls to :func:`os.stat` required to walk a directory tree.
pt_pt: A :pep:`471` adiciona uma nova função de iteração de diretórios, :func:`os.scandir`, à biblioteca padrão. Além disso, :func:`os.walk` é agora implementado usando ``scandir``, o que o torna 3 a 5 vezes mais rápido em sistemas POSIX e 7 a 20 vezes mais rápido em sistemas Windows. Isto é conseguido em grande parte reduzindo significativamente o número de chamadas a :func:`os.stat` necessárias para percorrer uma árvore de diretórios.
ru: :pep:`471` добавляет в стандартную библиотеку новую функцию итерации каталогов, :func:`os.scandir`. Кроме того, :func:`os.walk` теперь реализован с использованием ``scandir``, что делает его в 3–5 раз быстрее в системах POSIX и в 7–20 раз быстрее в системах Windows. Во многом это достигается за счет значительного сокращения количества вызовов :func:`os.stat`, необходимых для обхода дерева каталогов.
sv: :pep:`471` lägger till en ny funktion för katalogiteration, :func:`os.scandir`, i standardbiblioteket. Dessutom implementeras nu :func:`os.walk` med ``scandir``, vilket gör den 3 till 5 gånger snabbare på POSIX-system och 7 till 20 gånger snabbare på Windows-system. Detta uppnås till stor del genom att kraftigt minska antalet anrop till :func:`os.stat` som krävs för att gå igenom ett katalogträd.

source: Additionally, ``scandir`` returns an iterator, as opposed to returning a list of file names, which improves memory efficiency when iterating over very large directories.
pt_pt: Além disso, ``scandir`` devolve um iterador, em vez de devolver uma lista de nomes de ficheiros, o que melhora a eficiência de memória ao iterar sobre diretórios muito grandes.
ru: Кроме того, scandir возвращает итератор, а не список имен файлов, что повышает эффективность использования памяти при переборе очень больших каталогов.
sv: Dessutom returnerar ``scandir`` en iterator, i stället för en lista med filnamn, vilket förbättrar minneseffektiviteten vid iteration över mycket stora kataloger.

source: The following example shows a simple use of :func:`os.scandir` to display all the files (excluding directories) in the given *path* that don't start with ``'.'``. The :meth:`entry.is_file() <os.DirEntry.is_file>` call will generally not make an additional system call::
pt_pt: O exemplo seguinte mostra um uso simples de :func:`os.scandir` para apresentar todos os ficheiros (excluindo diretórios) no *path* dado que não começam com ``'.'``. A chamada :meth:`entry.is_file() <os.DirEntry.is_file>` geralmente não fará uma chamada adicional ao sistema::
ru: В следующем примере показано простое использование :func:`os.scandir` для отображения всех файлов (за исключением каталогов) по заданному *пути*, которые не начинаются с ``'.'``. Вызов :meth:`entry.is_file() <os.DirEntry.is_file>` обычно не выполняет дополнительный системный вызов::
sv: Följande exempel visar en enkel användning av :func:`os.scandir` för att visa alla filer (exklusive kataloger) i den angivna *path* som inte börjar med ``'.'``. Anropet :meth:`entry.is_file() <os.DirEntry.is_file>` kommer i allmänhet inte att göra ytterligare ett systemanrop::

source: :pep:`471` -- os.scandir() function -- a better and faster directory iterator
pt_pt: :pep:`471` — Função os.scandir() — um iterador de diretórios melhor e mais rápido
ru: :pep:`471` -- функция os.scandir() -- лучший и быстрый итератор каталогов
sv: :pep:`471` -- os.scandir() function -- en bättre och snabbare katalogiterator

source: PEP written and implemented by Ben Hoyt with the help of Victor Stinner.
pt_pt: PEP escrita e implementada por Ben Hoyt com a ajuda de Victor Stinner.
ru: PEP написан и реализован Беном Хойтом при помощи Виктора Стиннера.
sv: PEP skrivet och implementerat av Ben Hoyt med hjälp av Victor Stinner.

source: PEP 475: Retry system calls failing with EINTR
pt_pt: PEP 475: Repetir chamadas de sistema que falham com EINTR
ru: PEP 475: повторение системных вызовов завершилось неудачей с EINTR
sv: PEP 475: Försök igen med systemanrop som misslyckas med EINTR

source: An :py:const:`errno.EINTR` error code is returned whenever a system call, that is waiting for I/O, is interrupted by a signal. Previously, Python would raise :exc:`InterruptedError` in such cases. This meant that, when writing a Python application, the developer had two choices:
pt_pt: Um código de erro :py:const:`errno.EINTR` é devolvido sempre que uma chamada de sistema, que está à espera de E/S, é interrompida por um sinal. Anteriormente, o Python lançava uma exceção :exc:`InterruptedError` nestes casos. Isto significava que, ao escrever uma aplicação Python, o programador tinha duas escolhas:
ru: Код ошибки :py:const:`errno.EINTR` возвращается всякий раз, когда системный вызов, ожидающий ввода-вывода, прерывается сигналом. Раньше Python в таких случаях вызывал :exc:`InterruptedError`. Это означало, что при написании приложения Python у разработчика было два варианта:
sv: En :py:const:`errno.EINTR`\-felkod returneras när ett systemanrop, som väntar på I/O, avbryts av en signal. Tidigare skulle Python ge :exc:`InterruptedError` i sådana fall. Detta innebar att utvecklaren hade två val när han skrev en Python-applikation:

source: Ignore the ``InterruptedError``.
pt_pt: Ignorar a exceção ``InterruptedError``.
ru: Не обращайте внимания на ``InterruptedError``.
sv: Ignorera ``InterruptedError``.

source: Handle the ``InterruptedError`` and attempt to restart the interrupted system call at every call site.
pt_pt: Tratar a exceção ``InterruptedError`` e tentar reiniciar a chamada de sistema interrompida em cada local de chamada.
ru: Обработайте InterruptedError и попытайтесь перезапустить прерванный системный вызов на каждом месте вызова.
sv: Hantera ``InterruptedError`` och försök att starta om det avbrutna systemanropet på varje anropsplats.

source: The first option makes an application fail intermittently. The second option adds a large amount of boilerplate that makes the code nearly unreadable. Compare::
pt_pt: A primeira opção faz com que uma aplicação falhe intermitentemente. A segunda opção adiciona uma grande quantidade de código repetitivo que torna o código quase ilegível. Compare::
ru: Первый вариант приводит к периодическому сбою приложения. Второй вариант добавляет большое количество шаблонного кода, который делает код практически нечитаемым. Сравнивать::
sv: Det första alternativet gör att en applikation misslyckas intermittent. Det andra alternativet lägger till en stor mängd boilerplate som gör koden nästan oläslig. Jämför::

source: and::
pt_pt: e:
ru: и::
sv: och::
