Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: The overhead of calling many methods of various standard library classes implemented in C has been significantly reduced by porting more code to use the ``METH_FASTCALL`` convention. (Contributed by Victor Stinner in :issue:`29300`, :issue:`29507`, :issue:`29452`, and :issue:`29286`.)
pt_pt: A sobrecarga de chamar muitos métodos de várias classes da biblioteca padrão implementadas em C foi significativamente reduzida ao portar mais código para usar a convenção ``METH_FASTCALL``. (Contribuído por Victor Stinner em :issue:`29300`, :issue:`29507`, :issue:`29452` e :issue:`29286`.)

source: Various optimizations have reduced Python startup time by 10% on Linux and up to 30% on macOS. (Contributed by Victor Stinner, INADA Naoki in :issue:`29585`, and Ivan Levkivskyi in :issue:`31333`.)
pt_pt: Várias otimizações reduziram o tempo de inicialização do Python em 10% no Linux e até 30% no macOS. (Contribuído por Victor Stinner, INADA Naoki em :issue:`29585`, e Ivan Levkivskyi em :issue:`31333`.)

source: Method calls are now up to 20% faster due to the bytecode changes which avoid creating bound method instances. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26110`.)
pt_pt: As chamadas de método são agora até 20% mais rápidas devido às alterações no *bytecode* que evitam a criação de instâncias de métodos ligados. (Contribuído por Yury Selivanov e INADA Naoki em :issue:`26110`.)

source: The :mod:`asyncio` module received a number of notable optimizations for commonly used functions:
pt_pt: O módulo :mod:`asyncio` recebeu várias otimizações notáveis para funções comumente usadas:

source: The :func:`asyncio.get_event_loop` function has been reimplemented in C to make it up to 15 times faster. (Contributed by Yury Selivanov in :issue:`32296`.)
pt_pt: A função :func:`asyncio.get_event_loop` foi reimplementada em C para a tornar até 15 vezes mais rápida. (Contribuído por Yury Selivanov em :issue:`32296`.)

source: :class:`asyncio.Future` callback management has been optimized. (Contributed by Yury Selivanov in :issue:`32348`.)
pt_pt: A gestão de *callbacks* de :class:`asyncio.Future` foi otimizada. (Contribuído por Yury Selivanov em :issue:`32348`.)

source: :func:`asyncio.gather` is now up to 15% faster. (Contributed by Yury Selivanov in :issue:`32355`.)
pt_pt: :func:`asyncio.gather` é agora até 15% mais rápido. (Contribuído por Yury Selivanov em :issue:`32355`.)

source: :func:`asyncio.sleep` is now up to 2 times faster when the *delay* argument is zero or negative. (Contributed by Andrew Svetlov in :issue:`32351`.)
pt_pt: :func:`asyncio.sleep` é agora até 2 vezes mais rápido quando o argumento *delay* é zero ou negativo. (Contribuído por Andrew Svetlov em :issue:`32351`.)

source: The performance overhead of asyncio debug mode has been reduced. (Contributed by Antoine Pitrou in :issue:`31970`.)
pt_pt: A sobrecarga de desempenho do modo de depuração do asyncio foi reduzida. (Contribuído por Antoine Pitrou em :issue:`31970`.)

source: As a result of :ref:`PEP 560 work <whatsnew37-pep560>`, the import time of :mod:`typing` has been reduced by a factor of 7, and many typing operations are now faster. (Contributed by Ivan Levkivskyi in :issue:`32226`.)
pt_pt: Como resultado do :ref:`trabalho da PEP 560 <whatsnew37-pep560>`, o tempo de importação de :mod:`typing` foi reduzido por um fator de 7, e muitas operações de tipagem são agora mais rápidas. (Contribuído por Ivan Levkivskyi em :issue:`32226`.)

source: :func:`sorted` and :meth:`list.sort` have been optimized for common cases to be up to 40-75% faster. (Contributed by Elliot Gorokhovsky in :issue:`28685`.)
pt_pt: :func:`sorted` e :meth:`list.sort` foram otimizados para casos comuns para serem até 40-75% mais rápidos. (Contribuído por Elliot Gorokhovsky em :issue:`28685`.)

source: :meth:`dict.copy` is now up to 5.5 times faster. (Contributed by Yury Selivanov in :issue:`31179`.)
pt_pt: :meth:`dict.copy` é agora até 5,5 vezes mais rápido. (Contribuído por Yury Selivanov em :issue:`31179`.)

source: :func:`hasattr` and :func:`getattr` are now about 4 times faster when *name* is not found and *obj* does not override :meth:`object.__getattr__` or :meth:`object.__getattribute__`. (Contributed by INADA Naoki in :issue:`32544`.)
pt_pt: :func:`hasattr` e :func:`getattr` são agora cerca de 4 vezes mais rápidos quando *name* não é encontrado e *obj* não substitui :meth:`object.__getattr__` ou :meth:`object.__getattribute__`. (Contribuído por INADA Naoki em :issue:`32544`.)

source: Searching for certain Unicode characters (like Ukrainian capital "Є") in a string was up to 25 times slower than searching for other characters. It is now only 3 times slower in the worst case. (Contributed by Serhiy Storchaka in :issue:`24821`.)
pt_pt: A pesquisa por certos caracteres Unicode (como a letra maiúscula ucraniana "Є") numa cadeia de caracteres era até 25 vezes mais lenta do que a pesquisa por outros caracteres. Agora é apenas 3 vezes mais lenta no pior caso. (Contribuído por Serhiy Storchaka em :issue:`24821`.)

source: The :func:`collections.namedtuple` factory has been reimplemented to make the creation of named tuples 4 to 6 times faster. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
pt_pt: A fábrica :func:`collections.namedtuple` foi reimplementada para tornar a criação de tuplos nomeados 4 a 6 vezes mais rápida. (Contribuído por Jelle Zijlstra com melhorias adicionais de INADA Naoki, Serhiy Storchaka e Raymond Hettinger em :issue:`28638`.)

source: The :func:`os.fwalk` function is now up to 2 times faster thanks to the use of :func:`os.scandir`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
pt_pt: A função :func:`os.fwalk` é agora até 2 vezes mais rápida graças ao uso de :func:`os.scandir`. (Contribuído por Serhiy Storchaka em :issue:`25996`.)

source: The speed of the :func:`shutil.rmtree` function has been improved by 20--40% thanks to the use of the :func:`os.scandir` function. (Contributed by Serhiy Storchaka in :issue:`28564`.)
pt_pt: A velocidade da função :func:`shutil.rmtree` foi melhorada em 20--40% graças ao uso da função :func:`os.scandir`. (Contribuído por Serhiy Storchaka em :issue:`28564`.)

source: Optimized case-insensitive matching and searching of :mod:`regular expressions <re>`. Searching some patterns can now be up to 20 times faster. (Contributed by Serhiy Storchaka in :issue:`30285`.)
pt_pt: Otimizada a correspondência e pesquisa sem distinção de maiúsculas e minúsculas de :mod:`expressões regulares <re>`. A pesquisa de alguns padrões pode agora ser até 20 vezes mais rápida. (Contribuído por Serhiy Storchaka em :issue:`30285`.)

source: :func:`re.compile` now converts ``flags`` parameter to int object if it is ``RegexFlag``. It is now as fast as Python 3.5, and faster than Python 3.6 by about 10% depending on the pattern. (Contributed by INADA Naoki in :issue:`31671`.)
pt_pt: :func:`re.compile` agora converte o parâmetro ``flags`` para um objeto int se for ``RegexFlag``. Agora é tão rápido quanto o Python 3.5, e cerca de 10% mais rápido do que o Python 3.6, dependendo do padrão. (Contribuído por INADA Naoki em :issue:`31671`.)

source: The :meth:`~selectors.BaseSelector.modify` methods of classes :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` and :class:`selectors.DevpollSelector` may be around 10% faster under heavy loads. (Contributed by Giampaolo Rodola' in :issue:`30014`)
pt_pt: Os métodos :meth:`~selectors.BaseSelector.modify` das classes :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` e :class:`selectors.DevpollSelector` podem ser cerca de 10% mais rápidos sob cargas pesadas. (Contribuído por Giampaolo Rodola' em :issue:`30014`)

source: Constant folding has been moved from the peephole optimizer to the new AST optimizer, which is able perform optimizations more consistently. (Contributed by Eugene Toder and INADA Naoki in :issue:`29469` and :issue:`11549`.)
pt_pt: A dobra de constantes foi movida do otimizador de *peephole* para o novo otimizador AST, que é capaz de realizar otimizações de forma mais consistente. (Contribuído por Eugene Toder e INADA Naoki em :issue:`29469` e :issue:`11549`.)

source: Most functions and methods in :mod:`abc` have been rewritten in C. This makes creation of abstract base classes, and calling :func:`isinstance` and :func:`issubclass` on them 1.5x faster. This also reduces Python start-up time by up to 10%. (Contributed by Ivan Levkivskyi and INADA Naoki in :issue:`31333`)
pt_pt: A maioria das funções e métodos em :mod:`abc` foram reescritos em C. Isto torna a criação de classes base abstratas, e a chamada de :func:`isinstance` e :func:`issubclass` nelas 1,5 vezes mais rápida. Isto também reduz o tempo de inicialização do Python em até 10%. (Contribuído por Ivan Levkivskyi e INADA Naoki em :issue:`31333`)

source: Significant speed improvements to alternate constructors for :class:`datetime.date` and :class:`datetime.datetime` by using fast-path constructors when not constructing subclasses. (Contributed by Paul Ganssle in :issue:`32403`)
pt_pt: Melhorias significativas de velocidade nos construtores alternativos para :class:`datetime.date` e :class:`datetime.datetime` ao usar construtores de caminho rápido quando não se está a construir subclasses. (Contribuído por Paul Ganssle em :issue:`32403`)

source: The speed of comparison of :class:`array.array` instances has been improved considerably in certain cases. It is now from 10x to 70x faster when comparing arrays holding values of the same integer type. (Contributed by Adrian Wielgosik in :issue:`24700`.)
pt_pt: A velocidade de comparação de instâncias de :class:`array.array` foi melhorada consideravelmente em certos casos. Agora é de 10x a 70x mais rápido ao comparar *arrays* que contêm valores do mesmo tipo inteiro. (Contribuído por Adrian Wielgosik em :issue:`24700`.)

source: The :func:`math.erf` and :func:`math.erfc` functions now use the (faster) C library implementation on most platforms. (Contributed by Serhiy Storchaka in :issue:`26121`.)
pt_pt: As funções :func:`math.erf` e :func:`math.erfc` agora usam a implementação da biblioteca C (mais rápida) na maioria das plataformas. (Contribuído por Serhiy Storchaka em :issue:`26121`.)

source: Other CPython Implementation Changes
pt_pt: Outras alterações na implementação do CPython

source: Trace hooks may now opt out of receiving the ``line`` and opt into receiving the ``opcode`` events from the interpreter by setting the corresponding new :attr:`~frame.f_trace_lines` and :attr:`~frame.f_trace_opcodes` attributes on the frame being traced. (Contributed by Nick Coghlan in :issue:`31344`.)
pt_pt: Os *hooks* de rastreio podem agora optar por não receber o evento ``line`` e optar por receber os eventos ``opcode`` do interpretador, definindo os novos atributos correspondentes :attr:`~frame.f_trace_lines` e :attr:`~frame.f_trace_opcodes` no *frame* que está a ser rastreado. (Contribuído por Nick Coghlan em :issue:`31344`.)

source: Fixed some consistency problems with namespace package module attributes. Namespace module objects now have an ``__file__`` that is set to ``None`` (previously unset), and their ``__spec__.origin`` is also set to ``None`` (previously the string ``"namespace"``). See :issue:`32305`. Also, the namespace module object's ``__spec__.loader`` is set to the same value as ``__loader__`` (previously, the former was set to ``None``). See :issue:`32303`.
pt_pt: Corrigidos alguns problemas de consistência com atributos de módulos de pacotes de *namespace*. Os objetos de módulos de *namespace* agora têm um ``__file__`` definido como ``None`` (anteriormente não definido), e o seu ``__spec__.origin`` também é definido como ``None`` (anteriormente a cadeia de caracteres ``"namespace"``). Veja :issue:`32305`. Além disso, o ``__spec__.loader`` do objeto de módulo de *namespace* é definido para o mesmo valor que ``__loader__`` (anteriormente, o primeiro era definido como ``None``). Veja :issue:`32303`.

source: The :func:`locals` dictionary now displays in the lexical order that variables were defined. Previously, the order was undefined. (Contributed by Raymond Hettinger in :issue:`32690`.)
pt_pt: O dicionário :func:`locals` agora é exibido na ordem léxica em que as variáveis foram definidas. Anteriormente, a ordem era indefinida. (Contribuído por Raymond Hettinger em :issue:`32690`.)

source: The ``distutils`` ``upload`` command no longer tries to change CR end-of-line characters to CRLF. This fixes a corruption issue with sdists that ended with a byte equivalent to CR. (Contributed by Bo Bayles in :issue:`32304`.)
pt_pt: O comando ``upload`` do ``distutils`` já não tenta alterar caracteres de fim de linha CR para CRLF. Isto corrige um problema de corrupção com *sdists* que terminavam com um *byte* equivalente a CR. (Contribuído por Bo Bayles em :issue:`32304`.)

source: Deprecated Python Behavior
pt_pt: Comportamento Python Obsoleto

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now deprecated in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). This ensures that comprehensions always immediately return a container of the appropriate type (rather than potentially returning a :term:`generator iterator` object), while generator expressions won't attempt to interleave their implicit output with the output from any explicit yield expressions. In Python 3.7, such expressions emit :exc:`DeprecationWarning` when compiled, in Python 3.8 this will be a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :issue:`10544`.)
pt_pt: Expressões de *yield* (tanto cláusulas ``yield`` como ``yield from``) estão agora obsoletas em compreensões e expressões geradoras (à exceção da expressão iterável na cláusula :keyword:`!for` mais à esquerda). Isto garante que as compreensões sempre retornam imediatamente um contentor do tipo apropriado (em vez de potencialmente retornarem um objeto :term:`iterador gerador`), enquanto as expressões geradoras não tentarão entrelaçar a sua saída implícita com a saída de quaisquer expressões de *yield* explícitas. No Python 3.7, tais expressões emitem :exc:`DeprecationWarning` quando compiladas; no Python 3.8, isto será um :exc:`SyntaxError`. (Contribuído por Serhiy Storchaka em :issue:`10544`.)

source: Returning a subclass of :class:`complex` from :meth:`object.__complex__` is deprecated and will be an error in future Python versions. This makes ``__complex__()`` consistent with :meth:`object.__int__` and :meth:`object.__float__`. (Contributed by Serhiy Storchaka in :issue:`28894`.)
pt_pt: Retornar uma subclasse de :class:`complex` de :meth:`object.__complex__` está obsoleto e será um erro em futuras versões do Python. Isto torna ``__complex__()`` consistente com :meth:`object.__int__` e :meth:`object.__float__`. (Contribuído por Serhiy Storchaka em :issue:`28894`.)

source: Deprecated Python modules, functions and methods
pt_pt: Módulos, funções e métodos Python obsoleto

source: Support for directly ``await``-ing instances of :class:`asyncio.Lock` and other asyncio synchronization primitives has been deprecated. An asynchronous context manager must be used in order to acquire and release the synchronization resource. (Contributed by Andrew Svetlov in :issue:`32253`.)
pt_pt: O suporte para aguardar diretamente instâncias de :class:`asyncio.Lock` e outras primitivas de sincronização do asyncio está obsoleto. Um gestor de contexto assíncrono deve ser usado para adquirir e libertar o recurso de sincronização. (Contribuído por Andrew Svetlov em :issue:`32253`.)

source: The :meth:`!asyncio.Task.current_task` and :meth:`!asyncio.Task.all_tasks` methods have been deprecated. (Contributed by Andrew Svetlov in :issue:`32250`.)
pt_pt: Os métodos :meth:`!asyncio.Task.current_task` e :meth:`!asyncio.Task.all_tasks` estão obsoletos. (Contribuído por Andrew Svetlov em :issue:`32250`.)

source: In Python 3.8, the abstract base classes in :mod:`collections.abc` will no longer be exposed in the regular :mod:`collections` module. This will help create a clearer distinction between the concrete classes and the abstract base classes. (Contributed by Serhiy Storchaka in :issue:`25988`.)
pt_pt: No Python 3.8, as classes base abstratas em :mod:`collections.abc` já não serão expostas no módulo :mod:`collections` regular. Isto ajudará a criar uma distinção mais clara entre as classes concretas e as classes base abstratas. (Contribuído por Serhiy Storchaka em :issue:`25988`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed. A deprecation warning is now emitted if the index file is missing and recreated in the ``'r'`` and ``'w'`` modes (this will be an error in future Python releases). (Contributed by Serhiy Storchaka in :issue:`28847`.)
pt_pt: :mod:`dbm.dumb` agora suporta a leitura de ficheiros de apenas leitura e já não escreve o ficheiro de índice quando este não é alterado. Um aviso de obsolescência é agora emitido se o ficheiro de índice estiver em falta e for recriado nos modos ``'r'`` e ``'w'`` (isto será um erro em futuras versões do Python). (Contribuído por Serhiy Storchaka em :issue:`28847`.)

source: Using non-integer value for selecting a plural form in :mod:`gettext` is now deprecated. It never correctly worked. (Contributed by Serhiy Storchaka in :issue:`28692`.)
pt_pt: O uso de valores não inteiros para selecionar uma forma plural em :mod:`gettext` está agora obsoleto. Nunca funcionou corretamente. (Contribuído por Serhiy Storchaka em :issue:`28692`.)

source: Methods :meth:`!MetaPathFinder.find_module` (replaced by :meth:`MetaPathFinder.find_spec() <importlib.abc.MetaPathFinder.find_spec>`) and :meth:`!PathEntryFinder.find_loader` (replaced by :meth:`PathEntryFinder.find_spec() <importlib.abc.PathEntryFinder.find_spec>`) both deprecated in Python 3.4 now emit :exc:`DeprecationWarning`. (Contributed by Matthias Bussonnier in :issue:`29576`.)
pt_pt: Os métodos :meth:`!MetaPathFinder.find_module` (substituído por :meth:`MetaPathFinder.find_spec() <importlib.abc.MetaPathFinder.find_spec>`) e :meth:`!PathEntryFinder.find_loader` (substituído por :meth:`PathEntryFinder.find_spec() <importlib.abc.PathEntryFinder.find_spec>`), ambos obsoletos no Python 3.4, agora emitem :exc:`DeprecationWarning`. (Contribuído por Matthias Bussonnier em :issue:`29576`.)

source: The :class:`importlib.abc.ResourceLoader` ABC has been deprecated in favour of :class:`importlib.abc.ResourceReader`.
pt_pt: A ABC :class:`importlib.abc.ResourceLoader` está obsoleta em favor de :class:`importlib.abc.ResourceReader`.

source: :mod:`!dummy_threading` and :mod:`!_dummy_thread` have been deprecated. It is no longer possible to build Python with threading disabled. Use :mod:`threading` instead. (Contributed by Antoine Pitrou in :issue:`31370`.)
pt_pt: Os módulos :mod:`!dummy_threading` e :mod:`!_dummy_thread` estão obsoletos. Já não é possível compilar o Python com *threading* desativado. Use :mod:`threading` em vez disso. (Contribuído por Antoine Pitrou em :issue:`31370`.)

source: The silent argument value truncation in :func:`socket.htons` and :func:`socket.ntohs` has been deprecated. In future versions of Python, if the passed argument is larger than 16 bits, an exception will be raised. (Contributed by Oren Milman in :issue:`28332`.)
pt_pt: A truncagem silenciosa do valor do argumento em :func:`socket.htons` e :func:`socket.ntohs` está obsoleta. Em futuras versões do Python, se o argumento passado for maior do que 16 bits, será lançada uma exceção. (Contribuído por Oren Milman em :issue:`28332`.)

source: The undocumented ``sys.callstats()`` function has been deprecated and will be removed in a future Python version. (Contributed by Victor Stinner in :issue:`28799`.)
pt_pt: A função não documentada ``sys.callstats()`` está obsoleta e será removida numa futura versão do Python. (Contribuído por Victor Stinner em :issue:`28799`.)

source: Deprecated functions and types of the C API
pt_pt: Funções e tipos obsoletos da API C

source: Function :c:func:`PySlice_GetIndicesEx` is deprecated and replaced with a macro if ``Py_LIMITED_API`` is not set or set to a value in the range between ``0x03050400`` and ``0x03060000`` (not inclusive), or is ``0x03060100`` or higher. (Contributed by Serhiy Storchaka in :issue:`27867`.)
pt_pt: A função :c:func:`PySlice_GetIndicesEx` está obsoleta e foi substituída por uma macro se ``Py_LIMITED_API`` não estiver definida ou definida para um valor no intervalo entre ``0x03050400`` e ``0x03060000`` (não inclusivo), ou se for ``0x03060100`` ou superior. (Contribuído por Serhiy Storchaka em :issue:`27867`.)

source: :c:func:`PyOS_AfterFork` has been deprecated. Use :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` or :c:func:`PyOS_AfterFork_Child()` instead. (Contributed by Antoine Pitrou in :issue:`16500`.)
pt_pt: :c:func:`PyOS_AfterFork` está obsoleta. Use :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` ou :c:func:`PyOS_AfterFork_Child()` em vez disso. (Contribuído por Antoine Pitrou em :issue:`16500`.)

source: Platform Support Removals
pt_pt: Remoções de Suporte de Plataforma

source: FreeBSD 9 and older are no longer officially supported.
pt_pt: FreeBSD 9 e versões anteriores já não são oficialmente suportadas.

source: For full Unicode support, including within extension modules, \*nix platforms are now expected to provide at least one of ``C.UTF-8`` (full locale), ``C.utf8`` (full locale) or ``UTF-8`` (``LC_CTYPE``-only locale) as an alternative to the legacy ``ASCII``-based ``C`` locale.
pt_pt: Para suporte total a Unicode, incluindo dentro de módulos de extensão, as plataformas \*nix são agora esperadas fornecer pelo menos uma das seguintes opções: ``C.UTF-8`` (localidade completa), ``C.utf8`` (localidade completa) ou ``UTF-8`` (apenas localidade ``LC_CTYPE``) como alternativa à localidade ``ASCII`` legada ``C``.

source: OpenSSL 0.9.8 and 1.0.1 are no longer supported, which means building CPython 3.7 with SSL/TLS support on older platforms still using these versions requires custom build options that link to a more recent version of OpenSSL.
pt_pt: OpenSSL 0.9.8 e 1.0.1 já não são suportados, o que significa que a compilação do CPython 3.7 com suporte SSL/TLS em plataformas mais antigas que ainda usam estas versões requer opções de compilação personalizadas que liguem a uma versão mais recente do OpenSSL.

source: Notably, this issue affects the Debian 8 (aka "jessie") and Ubuntu 14.04 (aka "Trusty") LTS Linux distributions, as they still use OpenSSL 1.0.1 by default.
pt_pt: Notavelmente, este problema afeta as distribuições Linux LTS Debian 8 (aka "jessie") e Ubuntu 14.04 (aka "Trusty"), uma vez que ainda usam OpenSSL 1.0.1 por defeito.

source: Debian 9 ("stretch") and Ubuntu 16.04 ("xenial"), as well as recent releases of other LTS Linux releases (e.g. RHEL/CentOS 7.5, SLES 12-SP3), use OpenSSL 1.0.2 or later, and remain supported in the default build configuration.
pt_pt: Debian 9 ("stretch") e Ubuntu 16.04 ("xenial"), bem como lançamentos recentes de outras versões LTS de Linux (por exemplo, RHEL/CentOS 7.5, SLES 12-SP3), usam OpenSSL 1.0.2 ou posterior, e continuam suportados na configuração de compilação predefinida.
