Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: :mod:`argparse` subparsers can now be made mandatory by passing ``required=True`` to :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Contributed by Anthony Sottile in :issue:`26510`.)
pt_pt: Os subparsers de :mod:`argparse` podem agora ser tornados obrigatórios passando ``required=True`` para :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Contribuído por Anthony Sottile em :issue:`26510`.)

source: :meth:`ast.literal_eval` is now stricter. Addition and subtraction of arbitrary numbers are no longer allowed. (Contributed by Serhiy Storchaka in :issue:`31778`.)
pt_pt: :meth:`ast.literal_eval` é agora mais rigoroso. Adição e subtração de números arbitrários já não são permitidas. (Contribuído por Serhiy Storchaka em :issue:`31778`.)

source: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` will now consistently raise an exception when a date falls outside of the ``0001-01-01`` through ``9999-12-31`` range. To support applications that cannot tolerate such exceptions, the new :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` and :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>` can be used. The new methods return tuples and are not restricted by the range supported by :class:`datetime.date`. (Contributed by Alexander Belopolsky in :issue:`28292`.)
pt_pt: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` agora lançará consistentemente uma exceção quando uma data estiver fora do intervalo ``0001-01-01`` a ``9999-12-31``. Para suportar aplicações que não podem tolerar tais exceções, os novos métodos :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` e :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>` podem ser usados. Os novos métodos retornam tuplos e não estão restritos ao intervalo suportado por :class:`datetime.date`. (Contribuído por Alexander Belopolsky em :issue:`28292`.)

source: :class:`collections.ChainMap` now preserves the order of the underlying mappings. (Contributed by Raymond Hettinger in :issue:`32792`.)
pt_pt: :class:`collections.ChainMap` agora preserva a ordem dos mapeamentos subjacentes. (Contribuído por Raymond Hettinger em :issue:`32792`.)

source: The ``submit()`` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor` now raises a :exc:`RuntimeError` if called during interpreter shutdown. (Contributed by Mark Nemec in :issue:`33097`.)
pt_pt: O método ``submit()`` de :class:`concurrent.futures.ThreadPoolExecutor` e :class:`concurrent.futures.ProcessPoolExecutor` agora lança um :exc:`RuntimeError` se chamado durante o encerramento do interpretador. (Contribuído por Mark Nemec em :issue:`33097`.)

source: The :class:`configparser.ConfigParser` constructor now uses ``read_dict()`` to process the default values, making its behavior consistent with the rest of the parser. Non-string keys and values in the defaults dictionary are now being implicitly converted to strings. (Contributed by James Tocknell in :issue:`23835`.)
pt_pt: O construtor de :class:`configparser.ConfigParser` agora usa ``read_dict()`` para processar os valores predefinidos, tornando o seu comportamento consistente com o restante do *parser*. Chaves e valores não-cadeia de caracteres no dicionário de predefinições são agora implicitamente convertidos para cadeias de caracteres. (Contribuído por James Tocknell em :issue:`23835`.)

source: Several undocumented internal imports were removed. One example is that ``os.errno`` is no longer available; use ``import errno`` directly instead. Note that such undocumented internal imports may be removed any time without notice, even in micro version releases.
pt_pt: Várias importações internas não documentadas foram removidas. Um exemplo é que ``os.errno`` já não está disponível; use ``import errno`` diretamente em vez disso. Note que tais importações internas não documentadas podem ser removidas a qualquer momento sem aviso, mesmo em lançamentos de versões micro.

source: Changes in the C API
pt_pt: Alterações na API C

source: The function :c:func:`PySlice_GetIndicesEx` is considered unsafe for resizable sequences. If the slice indices are not instances of :class:`int`, but objects that implement the :meth:`!__index__` method, the sequence can be resized after passing its length to :c:func:`!PySlice_GetIndicesEx`. This can lead to returning indices out of the length of the sequence. For avoiding possible problems use new functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
pt_pt: A função :c:func:`PySlice_GetIndicesEx` é considerada insegura para sequências redimensionáveis. Se os índices de fatia não forem instâncias de :class:`int`, mas objetos que implementam o método :meth:`!__index__`, a sequência pode ser redimensionada após passar o seu comprimento para :c:func:`!PySlice_GetIndicesEx`. Isto pode levar ao retorno de índices fora do comprimento da sequência. Para evitar possíveis problemas, use as novas funções :c:func:`PySlice_Unpack` e :c:func:`PySlice_AdjustIndices`. (Contribuído por Serhiy Storchaka em :issue:`27867`.)

source: CPython bytecode changes
pt_pt: Alterações no bytecode do CPython

source: The :opcode:`!STORE_ANNOTATION` opcode has been removed. (Contributed by Mark Shannon in :issue:`32550`.)
pt_pt: O *opcode* :opcode:`!STORE_ANNOTATION` foi removido. (Contribuído por Mark Shannon em :issue:`32550`.)

source: The file used to override :data:`sys.path` is now called ``<python-executable>._pth`` instead of ``'sys.path'``. See :ref:`windows_finding_modules` for more information. (Contributed by Steve Dower in :issue:`28137`.)
pt_pt: O ficheiro usado para substituir :data:`sys.path` agora chama-se ``<python-executable>._pth`` em vez de ``'sys.path'``. Veja :ref:`windows_finding_modules` para mais informações. (Contribuído por Steve Dower em :issue:`28137`.)

source: Other CPython implementation changes
pt_pt: Outras alterações na implementação do CPython

source: In preparation for potential future changes to the public CPython runtime initialization API (see :pep:`432` for an initial, but somewhat outdated, draft), CPython's internal startup and configuration management logic has been significantly refactored. While these updates are intended to be entirely transparent to both embedding applications and users of the regular CPython CLI, they're being mentioned here as the refactoring changes the internal order of various operations during interpreter startup, and hence may uncover previously latent defects, either in embedding applications, or in CPython itself. (Initially contributed by Nick Coghlan and Eric Snow as part of :issue:`22257`, and further updated by Nick, Eric, and Victor Stinner in a number of other issues). Some known details affected:
pt_pt: Em preparação para potenciais alterações futuras à API de inicialização do tempo de execução do CPython (veja :pep:`432` para um rascunho inicial, mas algo desatualizado), a lógica interna de inicialização e gestão de configuração do CPython foi significativamente refatorada. Embora estas atualizações sejam destinadas a ser totalmente transparentes tanto para aplicações de incorporação como para utilizadores da CLI regular do CPython, estão a ser mencionadas aqui, uma vez que a refatoração altera a ordem interna de várias operações durante a inicialização do interpretador e, portanto, pode revelar defeitos latentes anteriores, quer em aplicações de incorporação, quer no próprio CPython. (Inicialmente contribuído por Nick Coghlan e Eric Snow como parte de :issue:`22257`, e posteriormente atualizado por Nick, Eric e Victor Stinner em vários outros *issues*). Alguns detalhes conhecidos afetados:

source: Due to changes in the way the default warnings filters are configured, setting :c:data:`Py_BytesWarningFlag` to a value greater than one is no longer sufficient to both emit :exc:`BytesWarning` messages and have them converted to exceptions. Instead, the flag must be set (to cause the warnings to be emitted in the first place), and an explicit ``error::BytesWarning`` warnings filter added to convert them to exceptions.
pt_pt: Devido a alterações na forma como os filtros de avisos predefinidos são configurados, definir :c:data:`Py_BytesWarningFlag` para um valor superior a um já não é suficiente para emitir mensagens :exc:`BytesWarning` e convertê-las em exceções. Em vez disso, a *flag* deve ser definida (para causar a emissão dos avisos em primeiro lugar), e um filtro de avisos explícito ``error::BytesWarning`` deve ser adicionado para os converter em exceções.

source: Due to a change in the way docstrings are handled by the compiler, the implicit ``return None`` in a function body consisting solely of a docstring is now marked as occurring on the same line as the docstring, not on the function's header line.
pt_pt: Devido a uma alteração na forma como os *docstrings* são tratados pelo compilador, o ``return None`` implícito num corpo de função constituído apenas por um *docstring* é agora marcado como ocorrendo na mesma linha que o *docstring*, não na linha do cabeçalho da função.

source: The current exception state has been moved from the frame object to the co-routine. This simplified the interpreter and fixed a couple of obscure bugs caused by having swap exception state when entering or exiting a generator. (Contributed by Mark Shannon in :issue:`25612`.)
pt_pt: O estado atual da exceção foi movido do objeto *frame* para a *coroutine*. Isto simplificou o interpretador e corrigiu alguns erros obscuros causados por ter o estado da exceção trocado ao entrar ou sair de um gerador. (Contribuído por Mark Shannon em :issue:`25612`.)

source: Notable changes in Python 3.7.1
pt_pt: Alterações notáveis no Python 3.7.1

source: Starting in 3.7.1, :c:func:`Py_Initialize` now consistently reads and respects all of the same environment settings as :c:func:`Py_Main` (in earlier Python versions, it respected an ill-defined subset of those environment variables, while in Python 3.7.0 it didn't read any of them due to :issue:`34247`). If this behavior is unwanted, set :c:data:`Py_IgnoreEnvironmentFlag` to 1 before calling :c:func:`Py_Initialize`.
pt_pt: A partir do 3.7.1, :c:func:`Py_Initialize` agora lê e respeita consistentemente todas as mesmas definições de ambiente que :c:func:`Py_Main` (em versões anteriores do Python, respeitava um subconjunto mal definido daquelas variáveis de ambiente, enquanto no Python 3.7.0 não lia nenhuma delas devido a :issue:`34247`). Se este comportamento não for desejado, defina :c:data:`Py_IgnoreEnvironmentFlag` para 1 antes de chamar :c:func:`Py_Initialize`.

source: In 3.7.1 the C API for Context Variables :ref:`was updated <contextvarsobjects_pointertype_change>` to use :c:type:`PyObject` pointers. See also :issue:`34762`.
pt_pt: No 3.7.1, a API C para Variáveis de Contexto :ref:`foi atualizada <contextvarsobjects_pointertype_change>` para usar ponteiros :c:type:`PyObject`. Veja também :issue:`34762`.

source: In 3.7.1 the :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
pt_pt: No 3.7.1, o módulo :mod:`tokenize` agora emite implicitamente um token ``NEWLINE`` quando fornecido com entrada que não tem uma nova linha final. Este comportamento agora corresponde ao que o *tokenizer* C faz internamente. (Contribuído por Ammar Askar em :issue:`33899`.)

source: Notable changes in Python 3.7.2
pt_pt: Alterações notáveis no Python 3.7.2

source: In 3.7.2, :mod:`venv` on Windows no longer copies the original binaries, but creates redirector scripts named ``python.exe`` and ``pythonw.exe`` instead. This resolves a long standing issue where all virtual environments would have to be upgraded or recreated with each Python update. However, note that this release will still require recreation of virtual environments in order to get the new scripts.
pt_pt: No 3.7.2, :mod:`venv` no Windows já não copia os binários originais, mas cria *scripts* de redirecionamento chamados ``python.exe`` e ``pythonw.exe`` em vez disso. Isto resolve um problema de longa data em que todos os ambientes virtuais teriam de ser atualizados ou recriados com cada atualização do Python. No entanto, note que esta versão ainda exigirá a recriação de ambientes virtuais para obter os novos *scripts*.

source: Notable changes in Python 3.7.6
pt_pt: Alterações notáveis no Python 3.7.6

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
pt_pt: Devido a preocupações significativas de segurança, o parâmetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` já não é suportado. Isto deve-se ao comportamento da opção de *socket* ``SO_REUSEADDR`` em UDP. Para mais detalhes, veja a documentação de ``loop.create_datagram_endpoint()``. (Contribuído por Kyle Stanley, Antoine Pitrou e Yury Selivanov em :issue:`37228`.)

source: Notable changes in Python 3.7.10
pt_pt: Alterações notáveis no Python 3.7.10

source: Notable changes in Python 3.7.11
pt_pt: Alterações notáveis no Python 3.7.11

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
pt_pt: Uma correção de segurança altera o comportamento de :class:`ftplib.FTP` para não confiar no endereço IPv4 enviado pelo servidor remoto ao configurar um canal de dados passivo. Em vez disso, reutilizamos o endereço IP do servidor FTP. Para código incomum que exija o comportamento antigo, defina um atributo ``trust_server_pasv_ipv4_address`` na sua instância FTP para ``True``. (Veja :gh:`87451`)

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates RFC 3986, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser :func:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
pt_pt: A presença de caracteres de nova linha ou tabulação em partes de um URL permite algumas formas de ataques. Seguindo a especificação WHATWG que atualiza o RFC 3986, os caracteres ASCII de nova linha ``\n``, ``\r`` e tabulação ``\t`` são removidos do URL pelo *parser* :func:`urllib.parse`, prevenindo tais ataques. Os caracteres a remover são controlados por uma nova variável a nível de módulo ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Veja :gh:`88048`)

source: Notable security feature in 3.7.14
pt_pt: Funcionalidade de segurança notável no 3.7.14

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
pt_pt: A conversão entre :class:`int` e :class:`str` em bases diferentes de 2 (binário), 4, 8 (octal), 16 (hexadecimal) ou 32, como a base 10 (decimal), agora lança um :exc:`ValueError` se o número de dígitos na forma de cadeia de caracteres estiver acima de um limite para evitar potenciais ataques de negação de serviço devido à complexidade algorítmica. Isto é uma mitigação para :cve:`2020-10735`. Este limite pode ser configurado ou desativado por variável de ambiente, flag de linha de comandos ou APIs :mod:`sys`. Consulte a documentação :ref:`limitação de comprimento de conversão de cadeia de caracteres inteiros <int_max_str_digits>`. O limite predefinido é de 4300 dígitos na forma de cadeia de caracteres.
