Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: What's New In Python 3.7
pt_pt: Novidades no Python 3.7

source: This article explains the new features in Python 3.7, compared to 3.6. Python 3.7 was released on June 27, 2018. For full details, see the :ref:`changelog <changelog>`.
pt_pt: Este artigo explica as novas funcionalidades do Python 3.7, em comparação com o 3.6. O Python 3.7 foi lançado a 27 de junho de 2018. Para detalhes completos, consulte o :ref:`registo de alterações <changelog>`

source: Summary -- Release Highlights
pt_pt: Resumo -- Destaques da Versão

source: New syntax features:
pt_pt: Novas funcionalidades de sintaxe:

source: :ref:`PEP 563 <whatsnew37-pep563>`, postponed evaluation of type annotations.
pt_pt: :ref:`PEP 563 <whatsnew37-pep563>`, avaliação adiada de anotações de tipo.

source: Backwards incompatible syntax changes:
pt_pt: Alterações de sintaxe incompatíveis com versões anteriores:

source: :keyword:`async` and :keyword:`await` are now reserved keywords.
pt_pt: As palavras-chave :keyword:`async` e :keyword:`await` são agora palavras reservadas.

source: New library modules:
pt_pt: Novos módulos de biblioteca:

source: :mod:`contextvars`: :ref:`PEP 567 -- Context Variables <whatsnew37-pep567>`
pt_pt: :mod:`contextvars`: :ref:`PEP 567 -- Variáveis de Contexto <whatsnew37-pep567>

source: :mod:`dataclasses`: :ref:`PEP 557 -- Data Classes <whatsnew37-pep557>`
pt_pt: :mod:`dataclasses`: :ref:`PEP 557 -- Classes de Dados <whatsnew37-pep557>

source: New built-in features:
pt_pt: Novas funcionalidades integradas:

source: :ref:`PEP 553 <whatsnew37-pep553>`, the new :func:`breakpoint` function.
pt_pt: :ref:`PEP 553 <whatsnew37-pep553>`, a nova função :func:`breakpoint`.

source: Python data model improvements:
pt_pt: Melhorias no modelo de dados do Python:

source: :ref:`PEP 562 <whatsnew37-pep562>`, customization of access to module attributes.
pt_pt: :ref:`PEP 562 <whatsnew37-pep562>`, personalização do acesso a atributos de módulo.

source: :ref:`PEP 560 <whatsnew37-pep560>`, core support for typing module and generic types.
pt_pt: :ref:`PEP 560 <whatsnew37-pep560>`, suporte central para o módulo typing e tipos genéricos.

source: the insertion-order preservation nature of :ref:`dict <typesmapping>` objects `has been declared`_ to be an official part of the Python language spec.
pt_pt: a natureza de preservação da ordem de inserção dos objetos :ref:`dict <typesmapping>` foi `declarada`_ como parte oficial da especificação da linguagem Python.

source: Significant improvements in the standard library:
pt_pt: Melhorias significativas na biblioteca padrão:

source: The :mod:`asyncio` module has received new features, significant :ref:`usability and performance improvements <whatsnew37_asyncio>`.
pt_pt: O módulo :mod:`asyncio` recebeu novas funcionalidades, melhorias significativas de :ref:`usabilidade e desempenho <whatsnew37_asyncio>`.

source: The :mod:`time` module gained support for :ref:`functions with nanosecond resolution <whatsnew37-pep564>`.
pt_pt: O módulo :mod:`time` ganhou suporte para :ref:`funções com resolução de nanosegundos <whatsnew37-pep564>`.

source: CPython implementation improvements:
pt_pt: Melhorias na implementação do CPython:

source: Avoiding the use of ASCII as a default text encoding:
pt_pt: Evitar o uso de ASCII como codificação de texto predefinida:

source: :ref:`PEP 538 <whatsnew37-pep538>`, legacy C locale coercion
pt_pt: :ref:`PEP 538 <whatsnew37-pep538>`, coerção de localidade C legada

source: :ref:`PEP 540 <whatsnew37-pep540>`, forced UTF-8 runtime mode
pt_pt: :ref:`PEP 540 <whatsnew37-pep540>`, modo de execução forçado UTF-8

source: :ref:`PEP 552 <whatsnew37-pep552>`, deterministic .pycs
pt_pt: :ref:`PEP 552 <whatsnew37-pep552>`, ficheiros .pyc determinísticos

source: :ref:`New Python Development Mode <whatsnew37-devmode>`
pt_pt: :ref:`Novo Modo de Desenvolvimento do Python <whatsnew37-devmode>

source: :ref:`PEP 565 <whatsnew37-pep565>`, improved :exc:`DeprecationWarning` handling
pt_pt: :ref:`PEP 565 <whatsnew37-pep565>`, melhoria no tratamento de :exc:`DeprecationWarning`

source: C API improvements:
pt_pt: Melhorias na API C:

source: :ref:`PEP 539 <whatsnew37-pep539>`, new C API for thread-local storage
pt_pt: :ref:`PEP 539 <whatsnew37-pep539>`, nova API C para armazenamento local de *thread*

source: Documentation improvements:
pt_pt: Melhorias na documentação:

source: :ref:`PEP 545 <whatsnew37-pep545>`, Python documentation translations
pt_pt: :ref:`PEP 545 <whatsnew37-pep545>`, traduções da documentação do Python

source: New documentation translations: `Japanese <https://docs.python.org/ja/>`_, `French <https://docs.python.org/fr/>`_, and `Korean <https://docs.python.org/ko/>`_.
pt_pt: Novas traduções da documentação: `Japonês <https://docs.python.org/ja/>`_, `Francês <https://docs.python.org/fr/>`_ e `Coreano <https://docs.python.org/ko/>`_.

source: This release features notable performance improvements in many areas. The :ref:`whatsnew37-perf` section lists them in detail.
pt_pt: Esta versão apresenta melhorias de desempenho notáveis em muitas áreas. A secção :ref:`whatsnew37-perf` lista-as em detalhe.

source: For a list of changes that may affect compatibility with previous Python releases please refer to the :ref:`porting-to-python-37` section.
pt_pt: Para uma lista de alterações que podem afetar a compatibilidade com versões anteriores do Python, consulte a secção :ref:`porting-to-python-37`.

source: New Features
pt_pt: Novas Funcionalidades

source: PEP 563: Postponed Evaluation of Annotations
pt_pt: PEP 563: Avaliação Adiada de Anotações

source: The advent of type hints in Python uncovered two glaring usability issues with the functionality of annotations added in :pep:`3107` and refined further in :pep:`526`:
pt_pt: A introdução de *type hints* no Python revelou dois problemas graves de usabilidade com a funcionalidade de anotações adicionadas na :pep:`3107` e refinadas na :pep:`526`:

source: annotations could only use names which were already available in the current scope, in other words they didn't support forward references of any kind; and
pt_pt: as anotações só podiam usar nomes que já estavam disponíveis no âmbito atual, em outras palavras, não suportavam referências antecipadas de qualquer tipo; e

source: annotating source code had adverse effects on startup time of Python programs.
pt_pt: anotar o código-fonte tinha efeitos adversos no tempo de inicialização dos programas Python.

source: Both of these issues are fixed by postponing the evaluation of annotations. Instead of compiling code which executes expressions in annotations at their definition time, the compiler stores the annotation in a string form equivalent to the AST of the expression in question. If needed, annotations can be resolved at runtime using :func:`typing.get_type_hints`. In the common case where this is not required, the annotations are cheaper to store (since short strings are interned by the interpreter) and make startup time faster.
pt_pt: Ambos os problemas são resolvidos adiando a avaliação das anotações. Em vez de compilar código que executa expressões em anotações no momento da sua definição, o compilador armazena a anotação numa forma de cadeia de caracteres equivalente à AST da expressão em questão. Se necessário, as anotações podem ser resolvidas em tempo de execução usando :func:`typing.get_type_hints`. No caso comum em que isto não é necessário, as anotações são mais baratas de armazenar (uma vez que cadeias de caracteres curtas são internadas pelo interpretador) e tornam o tempo de inicialização mais rápido.

source: Usability-wise, annotations now support forward references, making the following syntax valid::
pt_pt: Em termos de usabilidade, as anotações agora suportam referências antecipadas, tornando a seguinte sintaxe válida::

source: Since this change breaks compatibility, the new behavior needs to be enabled on a per-module basis in Python 3.7 using a :mod:`__future__` import::
pt_pt: Como esta alteração quebra a compatibilidade, o novo comportamento precisa de ser ativado módulo a módulo no Python 3.7 usando uma importação :mod:`__future__`::

source: It will become the default in Python 3.10.
pt_pt: Tornar-se-á o predefinido no Python 3.10.

source: :pep:`563` -- Postponed evaluation of annotations
pt_pt: :pep:`563` -- Avaliação adiada de anotações

source: PEP written and implemented by Łukasz Langa.
pt_pt: PEP escrito e implementado por Łukasz Langa.

source: PEP 538: Legacy C Locale Coercion
pt_pt: PEP 538: Coerção de Localidade C Legada

source: An ongoing challenge within the Python 3 series has been determining a sensible default strategy for handling the "7-bit ASCII" text encoding assumption currently implied by the use of the default C or POSIX locale on non-Windows platforms.
pt_pt: Um desafio contínuo na série Python 3 tem sido determinar uma estratégia predefinida sensata para lidar com a suposição de codificação de texto "7-bit ASCII" atualmente implícita pelo uso da localidade C ou POSIX predefinida em plataformas não-Windows.

source: :pep:`538` updates the default interpreter command line interface to automatically coerce that locale to an available UTF-8 based locale as described in the documentation of the new :envvar:`PYTHONCOERCECLOCALE` environment variable. Automatically setting ``LC_CTYPE`` this way means that both the core interpreter and locale-aware C extensions (such as :mod:`readline`) will assume the use of UTF-8 as the default text encoding, rather than ASCII.
pt_pt: A :pep:`538` atualiza a interface de linha de comandos do interpretador para forçar automaticamente essa localidade para uma localidade baseada em UTF-8 disponível, como descrito na documentação da nova variável de ambiente :envvar:`PYTHONCOERCECLOCALE`. Definir automaticamente ``LC_CTYPE`` desta forma significa que tanto o interpretador principal como as extensões C conscientes da localidade (como :mod:`readline`) assumirão o uso de UTF-8 como codificação de texto predefinida, em vez de ASCII.

source: The platform support definition in :pep:`11` has also been updated to limit full text handling support to suitably configured non-ASCII based locales.
pt_pt: A definição de suporte de plataforma na :pep:`11` também foi atualizada para limitar o suporte total de tratamento de texto a localidades não baseadas em ASCII devidamente configuradas.

source: As part of this change, the default error handler for :data:`~sys.stdin` and :data:`~sys.stdout` is now ``surrogateescape`` (rather than ``strict``) when using any of the defined coercion target locales (currently ``C.UTF-8``, ``C.utf8``, and ``UTF-8``). The default error handler for :data:`~sys.stderr` continues to be ``backslashreplace``, regardless of locale.
pt_pt: Como parte desta alteração, o *handler* de erros predefinido para :data:`~sys.stdin` e :data:`~sys.stdout` é agora ``surrogateescape`` (em vez de ``strict``) ao usar qualquer uma das localidades de destino de coerção definidas (atualmente ``C.UTF-8``, ``C.utf8`` e ``UTF-8``). O *handler* de erros predefinido para :data:`~sys.stderr` continua a ser ``backslashreplace``, independentemente da localidade.

source: Locale coercion is silent by default, but to assist in debugging potentially locale related integration problems, explicit warnings (emitted directly on :data:`~sys.stderr`) can be requested by setting ``PYTHONCOERCECLOCALE=warn``. This setting will also cause the Python runtime to emit a warning if the legacy C locale remains active when the core interpreter is initialized.
pt_pt: A coerção de localidade é silenciosa por defeito, mas para ajudar na depuração de potenciais problemas de integração relacionados com a localidade, avisos explícitos (emitidos diretamente em :data:`~sys.stderr`) podem ser solicitados definindo ``PYTHONCOERCECLOCALE=warn``. Esta definição também fará com que o tempo de execução do Python emita um aviso se a localidade C legada permanecer ativa quando o interpretador principal for inicializado.

source: While :pep:`538`'s locale coercion has the benefit of also affecting extension modules (such as GNU ``readline``), as well as child processes (including those running non-Python applications and older versions of Python), it has the downside of requiring that a suitable target locale be present on the running system. To better handle the case where no suitable target locale is available (as occurs on RHEL/CentOS 7, for example), Python 3.7 also implements :ref:`whatsnew37-pep540`.
pt_pt: Embora a coerção de localidade da :pep:`538` tenha a vantagem de também afetar módulos de extensão (como o GNU ``readline``), bem como processos filhos (incluindo aqueles que executam aplicações não-Python e versões mais antigas do Python), tem a desvantagem de exigir que uma localidade de destino adequada esteja presente no sistema em execução. Para lidar melhor com o caso em que nenhuma localidade de destino adequada está disponível (como ocorre no RHEL/CentOS 7, por exemplo), o Python 3.7 também implementa :ref:`whatsnew37-pep540`.

source: :pep:`538` -- Coercing the legacy C locale to a UTF-8 based locale
pt_pt: :pep:`538` -- Coerção da localidade C legada para uma localidade baseada em UTF-8

source: PEP written and implemented by Nick Coghlan.
pt_pt: PEP escrito e implementado por Nick Coghlan.

source: PEP 540: Forced UTF-8 Runtime Mode
pt_pt: PEP 540: Modo de Execução Forçado UTF-8

source: The new :option:`-X` ``utf8`` command line option and :envvar:`PYTHONUTF8` environment variable can be used to enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_pt: A nova opção de linha de comandos :option:`-X` ``utf8`` e a variável de ambiente :envvar:`PYTHONUTF8` podem ser usadas para ativar o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: When in UTF-8 mode, CPython ignores the locale settings, and uses the UTF-8 encoding by default. The error handlers for :data:`sys.stdin` and :data:`sys.stdout` streams are set to ``surrogateescape``.
pt_pt: Quando no modo UTF-8, o CPython ignora as definições de localidade e usa a codificação UTF-8 por defeito. Os *handlers* de erros para os fluxos :data:`sys.stdin` e :data:`sys.stdout` são definidos para ``surrogateescape``.

source: The forced UTF-8 mode can be used to change the text handling behavior in an embedded Python interpreter without changing the locale settings of an embedding application.
pt_pt: O modo UTF-8 forçado pode ser usado para alterar o comportamento de tratamento de texto num interpretador Python incorporado sem alterar as definições de localidade de uma aplicação de incorporação.

source: While :pep:`540`'s UTF-8 mode has the benefit of working regardless of which locales are available on the running system, it has the downside of having no effect on extension modules (such as GNU ``readline``), child processes running non-Python applications, and child processes running older versions of Python. To reduce the risk of corrupting text data when communicating with such components, Python 3.7 also implements :ref:`whatsnew37-pep540`).
pt_pt: Embora o modo UTF-8 da :pep:`540` tenha a vantagem de funcionar independentemente das localidades disponíveis no sistema em execução, tem a desvantagem de não ter efeito em módulos de extensão (como o GNU ``readline``), processos filhos que executam aplicações não-Python e processos filhos que executam versões mais antigas do Python. Para reduzir o risco de corrupção de dados de texto ao comunicar com tais componentes, o Python 3.7 também implementa :ref:`whatsnew37-pep540`.

source: The UTF-8 mode is enabled by default when the locale is ``C`` or ``POSIX``, and the :pep:`538` locale coercion feature fails to change it to a UTF-8 based alternative (whether that failure is due to ``PYTHONCOERCECLOCALE=0`` being set, ``LC_ALL`` being set, or the lack of a suitable target locale).
pt_pt: O modo UTF-8 está ativado por defeito quando a localidade é ``C`` ou ``POSIX``, e a funcionalidade de coerção de localidade da :pep:`538` falha ao alterá-la para uma alternativa baseada em UTF-8 (seja essa falha devida a ``PYTHONCOERCECLOCALE=0`` estar definido, ``LC_ALL`` estar definido, ou à falta de uma localidade de destino adequada).

source: :pep:`540` -- Add a new UTF-8 mode
pt_pt: :pep:`540` -- Adicionar um novo modo UTF-8

source: PEP written and implemented by Victor Stinner
pt_pt: PEP escrito e implementado por Victor Stinner

source: PEP 553: Built-in ``breakpoint()``
pt_pt: PEP 553: Função Integrada ``breakpoint()``

source: Python 3.7 includes the new built-in :func:`breakpoint` function as an easy and consistent way to enter the Python debugger.
pt_pt: O Python 3.7 inclui a nova função integrada :func:`breakpoint` como uma forma fácil e consistente de entrar no depurador do Python.

source: Built-in ``breakpoint()`` calls :func:`sys.breakpointhook`. By default, the latter imports :mod:`pdb` and then calls ``pdb.set_trace()``, but by binding ``sys.breakpointhook()`` to the function of your choosing, ``breakpoint()`` can enter any debugger. Additionally, the environment variable :envvar:`PYTHONBREAKPOINT` can be set to the callable of your debugger of choice. Set ``PYTHONBREAKPOINT=0`` to completely disable built-in ``breakpoint()``.
pt_pt: A função integrada ``breakpoint()`` chama :func:`sys.breakpointhook`. Por defeito, esta importa :mod:`pdb` e depois chama ``pdb.set_trace()``, mas ao associar ``sys.breakpointhook()`` à função da sua escolha, ``breakpoint()`` pode entrar em qualquer depurador. Além disso, a variável de ambiente :envvar:`PYTHONBREAKPOINT` pode ser definida para o objeto chamável do depurador da sua escolha. Defina ``PYTHONBREAKPOINT=0`` para desativar completamente a função integrada ``breakpoint()``.

source: :pep:`553` -- Built-in breakpoint()
pt_pt: :pep:`553` -- Função integrada breakpoint()

source: PEP written and implemented by Barry Warsaw
pt_pt: PEP escrito e implementado por Barry Warsaw

source: PEP 539: New C API for Thread-Local Storage
pt_pt: PEP 539: Nova API C para Armazenamento Local de *Thread*

source: While Python provides a C API for thread-local storage support; the existing :ref:`Thread Local Storage (TLS) API <thread-local-storage-api>` has used :c:expr:`int` to represent TLS keys across all platforms. This has not generally been a problem for officially support platforms, but that is neither POSIX-compliant, nor portable in any practical sense.
pt_pt: Embora o Python forneça uma API C para suporte de armazenamento local de *thread*; a :ref:`API de Armazenamento Local de *Thread* (TLS) <thread-local-storage-api>` existente usou :c:expr:`int` para representar chaves TLS em todas as plataformas. Isto não tem sido geralmente um problema para plataformas oficialmente suportadas, mas não é compatível com POSIX, nem portátil em qualquer sentido prático.

source: :pep:`539` changes this by providing a new :ref:`Thread Specific Storage (TSS) API <thread-specific-storage-api>` to CPython which supersedes use of the existing TLS API within the CPython interpreter, while deprecating the existing API. The TSS API uses a new type :c:type:`Py_tss_t` instead of :c:expr:`int` to represent TSS keys--an opaque type the definition of which may depend on the underlying TLS implementation. Therefore, this will allow to build CPython on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`.
pt_pt: A :pep:`539` altera isto ao fornecer uma nova :ref:`API de Armazenamento Específico de *Thread* (TSS) <thread-specific-storage-api>` para o CPython que substitui o uso da API TLS existente dentro do interpretador CPython, enquanto torna obsoleta a API existente. A API TSS usa um novo tipo :c:type:`Py_tss_t` em vez de :c:expr:`int` para representar chaves TSS - um tipo opaco cuja definição pode depender da implementação TLS subjacente. Portanto, isto permitirá compilar o CPython em plataformas onde a chave TLS nativa é definida de uma forma que não pode ser convertida com segurança para :c:expr:`int`.

source: Note that on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`, all functions of the existing TLS API will be no-op and immediately return failure. This indicates clearly that the old API is not supported on platforms where it cannot be used reliably, and that no effort will be made to add such support.
pt_pt: Note que em plataformas onde a chave TLS nativa é definida de uma forma que não pode ser convertida com segurança para :c:expr:`int`, todas as funções da API TLS existente serão no-op e retornarão falha imediatamente. Isto indica claramente que a API antiga não é suportada em plataformas onde não pode ser usada de forma confiável, e que nenhum esforço será feito para adicionar tal suporte.

source: :pep:`539` -- A New C-API for Thread-Local Storage in CPython
pt_pt: :pep:`539` -- Uma Nova API C para Armazenamento Local de *Thread* no CPython

source: PEP written by Erik M. Bray; implementation by Masayuki Yamamoto.
pt_pt: PEP escrito por Erik M. Bray; implementado por Masayuki Yamamoto.

source: PEP 562: Customization of Access to Module Attributes
pt_pt: PEP 562: Personalização do Acesso a Atributos de Módulo

source: A typical example of where this may be useful is module attribute deprecation and lazy loading.
pt_pt: Um exemplo típico de onde isto pode ser útil é a obsolescência de atributos de módulo e o carregamento preguiçoso.

source: :pep:`562` -- Module ``__getattr__`` and ``__dir__``
pt_pt: :pep:`562` -- ``__getattr__`` e ``__dir__`` de Módulo

source: PEP written and implemented by Ivan Levkivskyi
pt_pt: PEP escrito e implementado por Ivan Levkivskyi

source: PEP 564: New Time Functions With Nanosecond Resolution
pt_pt: PEP 564: Novas Funções de Tempo com Resolução de Nanosegundos

source: The resolution of clocks in modern systems can exceed the limited precision of a floating-point number returned by the :func:`time.time` function and its variants. To avoid loss of precision, :pep:`564` adds six new "nanosecond" variants of the existing timer functions to the :mod:`time` module:
pt_pt: A resolução dos relógios em sistemas modernos pode exceder a precisão limitada de um número de ponto flutuante retornado pela função :func:`time.time` e suas variantes. Para evitar perda de precisão, a :pep:`564` adiciona seis novas variantes de "nanosegundos" das funções de temporizador existentes ao módulo :mod:`time`:

source: The new functions return the number of nanoseconds as an integer value.
pt_pt: As novas funções retornam o número de nanosegundos como um valor inteiro.

source: :pep:`Measurements <0564#annex-clocks-resolution-in-python>` show that on Linux and Windows the resolution of :func:`time.time_ns` is approximately 3 times better than that of :func:`time.time`.
pt_pt: As :pep:`Medidas <0564#annex-clocks-resolution-in-python>` mostram que no Linux e Windows a resolução de :func:`time.time_ns` é aproximadamente 3 vezes melhor do que a de :func:`time.time`.

source: :pep:`564` -- Add new time functions with nanosecond resolution
pt_pt: :pep:`564` -- Adicionar novas funções de tempo com resolução de nanosegundos

source: PEP 565: Show DeprecationWarning in ``__main__``
pt_pt: PEP 565: Mostrar DeprecationWarning em ``__main__``
