Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: The new :meth:`Future.get_loop() <asyncio.Future.get_loop>` and ``Task.get_loop()`` methods return the instance of the loop on which a task or a future were created. :meth:`Server.get_loop() <asyncio.Server.get_loop>` allows doing the same for :class:`asyncio.Server` objects. (Contributed by Yury Selivanov in :issue:`32415` and Srinivas Reddy Thatiparthy in :issue:`32418`.)
pt_pt: Os novos métodos :meth:`Future.get_loop() <asyncio.Future.get_loop>` e ``Task.get_loop()`` retornam a instância do ciclo no qual uma tarefa ou um futuro foram criados. :meth:`Server.get_loop() <asyncio.Server.get_loop>` permite fazer o mesmo para objetos :class:`asyncio.Server`. (Contribuído por Yury Selivanov em :issue:`32415` e Srinivas Reddy Thatiparthy em :issue:`32418`.)

source: It is now possible to control how instances of :class:`asyncio.Server` begin serving. Previously, the server would start serving immediately when created. The new *start_serving* keyword argument to :meth:`loop.create_server() <asyncio.loop.create_server>` and :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, as well as :meth:`Server.start_serving() <asyncio.Server.start_serving>`, and :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` can be used to decouple server instantiation and serving. The new :meth:`Server.is_serving() <asyncio.Server.is_serving>` method returns ``True`` if the server is serving. :class:`~asyncio.Server` objects are now asynchronous context managers::
pt_pt: Agora é possível controlar como as instâncias de :class:`asyncio.Server` começam a servir. Anteriormente, o servidor começava a servir imediatamente quando criado. O novo argumento de palavra-chave *start_serving* para :meth:`loop.create_server() <asyncio.loop.create_server>` e :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, bem como :meth:`Server.start_serving() <asyncio.Server.start_serving>`, e :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` podem ser usados para desacoplar a instanciação do servidor e o serviço. O novo método :meth:`Server.is_serving() <asyncio.Server.is_serving>` retorna ``True`` se o servidor estiver a servir. Os objetos :class:`~asyncio.Server` são agora gestores de contexto assíncronos::

source: srv = await loop.create_server(...) async with srv: # some code # At this point, srv is closed and no longer accepts new connections.
pt_pt: srv = await loop.create_server(...) async with srv: # algum código # Neste ponto, srv está fechado e já não aceita novas ligações.

source: (Contributed by Yury Selivanov in :issue:`32662`.)
pt_pt: (Contribuído por Yury Selivanov em :issue:`32662`.)

source: Callback objects returned by :func:`loop.call_later() <asyncio.loop.call_later>` gained the new :meth:`when() <asyncio.TimerHandle.when>` method which returns an absolute scheduled callback timestamp. (Contributed by Andrew Svetlov in :issue:`32741`.)
pt_pt: Os objetos de *callback* retornados por :func:`loop.call_later() <asyncio.loop.call_later>` ganharam o novo método :meth:`when() <asyncio.TimerHandle.when>` que retorna um carimbo de data/hora absoluto agendado para o *callback*. (Contribuído por Andrew Svetlov em :issue:`32741`.)

source: The :meth:`loop.create_datagram_endpoint() \ <asyncio.loop.create_datagram_endpoint>` method gained support for Unix sockets. (Contributed by Quentin Dawans in :issue:`31245`.)
pt_pt: O método :meth:`loop.create_datagram_endpoint() <asyncio.loop.create_datagram_endpoint>` ganhou suporte para *sockets* Unix. (Contribuído por Quentin Dawans em :issue:`31245`.)

source: The :func:`asyncio.open_connection`, :func:`asyncio.start_server` functions, :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio.loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>` methods and their corresponding UNIX socket variants now accept the *ssl_handshake_timeout* keyword argument. (Contributed by Neil Aspinall in :issue:`29970`.)
pt_pt: As funções :func:`asyncio.open_connection`, :func:`asyncio.start_server`, os métodos :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio.loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>` e as suas variantes de *socket* UNIX correspondentes agora aceitam o argumento de palavra-chave *ssl_handshake_timeout*. (Contribuído por Neil Aspinall em :issue:`29970`.)

source: The new :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` method returns ``True`` if the callback was cancelled. (Contributed by Marat Sharafutdinov in :issue:`31943`.)
pt_pt: O novo método :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` retorna ``True`` se o *callback* foi cancelado. (Contribuído por Marat Sharafutdinov em :issue:`31943`.)

source: The asyncio source has been converted to use the :keyword:`async`/:keyword:`await` syntax. (Contributed by Andrew Svetlov in :issue:`32193`.)
pt_pt: A fonte do asyncio foi convertida para usar a sintaxe :keyword:`async`/:keyword:`await`. (Contribuído por Andrew Svetlov em :issue:`32193`.)

source: The new :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` method can be used to determine the reading state of the transport. Additionally, calls to :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` and :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` are now idempotent. (Contributed by Yury Selivanov in :issue:`32356`.)
pt_pt: O novo método :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` pode ser usado para determinar o estado de leitura do transporte. Além disso, as chamadas para :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` e :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` são agora idempotentes. (Contribuído por Yury Selivanov em :issue:`32356`.)

source: Loop methods which accept socket paths now support passing :term:`path-like objects <path-like object>`. (Contributed by Yury Selivanov in :issue:`32066`.)
pt_pt: Os métodos de ciclo que aceitam caminhos de *socket* agora suportam a passagem de :term:`objetos semelhantes a caminhos <path-like object>`. (Contribuído por Yury Selivanov em :issue:`32066`.)

source: In :mod:`asyncio` TCP sockets on Linux are now created with ``TCP_NODELAY`` flag set by default. (Contributed by Yury Selivanov and Victor Stinner in :issue:`27456`.)
pt_pt: No :mod:`asyncio`, os *sockets* TCP no Linux são agora criados com a *flag* ``TCP_NODELAY`` definida por defeito. (Contribuído por Yury Selivanov e Victor Stinner em :issue:`27456`.)

source: Exceptions occurring in cancelled tasks are no longer logged. (Contributed by Yury Selivanov in :issue:`30508`.)
pt_pt: As exceções que ocorrem em tarefas canceladas já não são registadas. (Contribuído por Yury Selivanov em :issue:`30508`.)

source: New ``WindowsSelectorEventLoopPolicy`` and ``WindowsProactorEventLoopPolicy`` classes. (Contributed by Yury Selivanov in :issue:`33792`.)
pt_pt: Novas classes ``WindowsSelectorEventLoopPolicy`` e ``WindowsProactorEventLoopPolicy``. (Contribuído por Yury Selivanov em :issue:`33792`.)

source: Several ``asyncio`` APIs have been :ref:`deprecated <whatsnew37-asyncio-deprecated>`.
pt_pt: Várias APIs ``asyncio`` foram :ref:`obsoletas <whatsnew37-asyncio-deprecated>`.

source: The :func:`~binascii.b2a_uu` function now accepts an optional *backtick* keyword argument. When it's true, zeros are represented by ``'`'`` instead of spaces. (Contributed by Xiang Zhang in :issue:`30103`.)
pt_pt: A função :func:`~binascii.b2a_uu` agora aceita um argumento de palavra-chave opcional *backtick*. Quando é verdadeiro, os zeros são representados por ``'`'`` em vez de espaços. (Contribuído por Xiang Zhang em :issue:`30103`.)

source: The :class:`~calendar.HTMLCalendar` class has new class attributes which ease the customization of CSS classes in the produced HTML calendar. (Contributed by Oz Tiram in :issue:`30095`.)
pt_pt: A classe :class:`~calendar.HTMLCalendar` tem novos atributos de classe que facilitam a personalização das classes CSS no calendário HTML produzido. (Contribuído por Oz Tiram em :issue:`30095`.)

source: ``collections.namedtuple()`` now supports default values. (Contributed by Raymond Hettinger in :issue:`32320`.)
pt_pt: ``collections.namedtuple()`` agora suporta valores predefinidos. (Contribuído por Raymond Hettinger em :issue:`32320`.)

source: :func:`compileall.compile_dir` learned the new *invalidation_mode* parameter, which can be used to enable :ref:`hash-based .pyc invalidation <whatsnew37-pep552>`. The invalidation mode can also be specified on the command line using the new ``--invalidation-mode`` argument. (Contributed by Benjamin Peterson in :issue:`31650`.)
pt_pt: :func:`compileall.compile_dir` aprendeu o novo parâmetro *invalidation_mode*, que pode ser usado para ativar a :ref:`invalidação de .pyc baseada em hash <whatsnew37-pep552>`. O modo de invalidação também pode ser especificado na linha de comandos usando o novo argumento ``--invalidation-mode``. (Contribuído por Benjamin Peterson em :issue:`31650`.)

source: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` and :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` now support the new *initializer* and *initargs* constructor arguments. (Contributed by Antoine Pitrou in :issue:`21423`.)
pt_pt: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` e :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` agora suportam os novos argumentos de construtor *initializer* e *initargs*. (Contribuído por Antoine Pitrou em :issue:`21423`.)

source: The :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` can now take the multiprocessing context via the new *mp_context* argument. (Contributed by Thomas Moreau in :issue:`31540`.)
pt_pt: O :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` agora pode receber o contexto de multiprocessamento através do novo argumento *mp_context*. (Contribuído por Thomas Moreau em :issue:`31540`.)

source: The new :func:`~contextlib.nullcontext` is a simpler and faster no-op context manager than :class:`~contextlib.ExitStack`. (Contributed by Jesse-Bakker in :issue:`10049`.)
pt_pt: O novo :func:`~contextlib.nullcontext` é um gestor de contexto sem operação mais simples e rápido do que :class:`~contextlib.ExitStack`. (Contribuído por Jesse Bakker em :issue:`10049`.)

source: The new :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager`, and :class:`~contextlib.AsyncExitStack` have been added to complement their synchronous counterparts. (Contributed by Jelle Zijlstra in :issue:`29679` and :issue:`30241`, and by Alexander Mohr and Ilya Kulakov in :issue:`29302`.)
pt_pt: Os novos :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager` e :class:`~contextlib.AsyncExitStack` foram adicionados para complementar os seus equivalentes síncronos. (Contribuído por Jelle Zijlstra em :issue:`29679` e :issue:`30241`, e por Alexander Mohr e Ilya Kulakov em :issue:`29302`.)

source: The :mod:`cProfile` command line now accepts ``-m module_name`` as an alternative to script path. (Contributed by Sanyam Khurana in :issue:`21862`.)
pt_pt: A linha de comandos :mod:`cProfile` agora aceita ``-m module_name`` como alternativa ao caminho do script. (Contribuído por Sanyam Khurana em :issue:`21862`.)

source: The new :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` method constructs a :class:`~datetime.datetime` object from a string in one of the formats output by :meth:`datetime.isoformat() <datetime.datetime.isoformat>`. (Contributed by Paul Ganssle in :issue:`15873`.)
pt_pt: O novo método :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` constrói um objeto :class:`~datetime.datetime` a partir de uma cadeia de caracteres num dos formatos produzidos por :meth:`datetime.isoformat() <datetime.datetime.isoformat>`. (Contribuído por Paul Ganssle em :issue:`15873`.)

source: The :class:`tzinfo <datetime.tzinfo>` class now supports sub-minute offsets. (Contributed by Alexander Belopolsky in :issue:`5288`.)
pt_pt: A classe :class:`tzinfo <datetime.tzinfo>` agora suporta deslocamentos de sub-minuto. (Contribuído por Alexander Belopolsky em :issue:`5288`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed.
pt_pt: :mod:`dbm.dumb` agora suporta a leitura de ficheiros de apenas leitura e já não escreve o ficheiro de índice quando este não é alterado.

source: The :mod:`decimal` module now uses :ref:`context variables <whatsnew37-pep567>` to store the decimal context. (Contributed by Yury Selivanov in :issue:`32630`.)
pt_pt: O módulo :mod:`decimal` agora usa :ref:`variáveis de contexto <whatsnew37-pep567>` para armazenar o contexto decimal. (Contribuído por Yury Selivanov em :issue:`32630`.)

source: The :func:`~dis.dis` function is now able to disassemble nested code objects (the code of comprehensions, generator expressions and nested functions, and the code used for building nested classes). The maximum depth of disassembly recursion is controlled by the new *depth* parameter. (Contributed by Serhiy Storchaka in :issue:`11822`.)
pt_pt: A função :func:`~dis.dis` agora é capaz de desmontar objetos de código aninhados (o código de compreensões, expressões geradoras e funções aninhadas, e o código usado para construir classes aninhadas). A profundidade máxima de recursão de desmontagem é controlada pelo novo parâmetro *depth*. (Contribuído por Serhiy Storchaka em :issue:`11822`.)

source: ``README.rst`` is now included in the list of distutils standard READMEs and therefore included in source distributions. (Contributed by Ryan Gonzalez in :issue:`11913`.)
pt_pt: ``README.rst`` agora está incluído na lista de READMEs padrão do distutils e, portanto, incluído nas distribuições de origem. (Contribuído por Ryan Gonzalez em :issue:`11913`.)

source: The :class:`Enum <enum.Enum>` learned the new ``_ignore_`` class property, which allows listing the names of properties which should not become enum members. (Contributed by Ethan Furman in :issue:`31801`.)
pt_pt: A :class:`Enum <enum.Enum>` aprendeu a nova propriedade de classe ``_ignore_``, que permite listar os nomes das propriedades que não devem tornar-se membros da enumeração. (Contribuído por Ethan Furman em :issue:`31801`.)

source: :func:`functools.singledispatch` now supports registering implementations using type annotations. (Contributed by Łukasz Langa in :issue:`32227`.)
pt_pt: :func:`functools.singledispatch` agora suporta o registo de implementações usando anotações de tipo. (Contribuído por Łukasz Langa em :issue:`32227`.)

source: The new :func:`gc.freeze` function allows freezing all objects tracked by the garbage collector and excluding them from future collections. This can be used before a POSIX ``fork()`` call to make the GC copy-on-write friendly or to speed up collection. The new :func:`gc.unfreeze` functions reverses this operation. Additionally, :func:`gc.get_freeze_count` can be used to obtain the number of frozen objects. (Contributed by Li Zekun in :issue:`31558`.)
pt_pt: A nova função :func:`gc.freeze` permite congelar todos os objetos rastreados pelo coletor de lixo e excluí-los de coleções futuras. Isto pode ser usado antes de uma chamada POSIX ``fork()`` para tornar o GC amigável a cópia-na-escrita ou para acelerar a coleção. A nova função :func:`gc.unfreeze` reverte esta operação. Além disso, :func:`gc.get_freeze_count` pode ser usada para obter o número de objetos congelados. (Contribuído por Li Zekun em :issue:`31558`.)

source: The :mod:`hmac` module now has an optimized one-shot :func:`~hmac.digest` function, which is up to three times faster than :func:`~hmac.HMAC`. (Contributed by Christian Heimes in :issue:`32433`.)
pt_pt: O módulo :mod:`hmac` agora tem uma função otimizada de única execução :func:`~hmac.digest`, que é até três vezes mais rápida do que :func:`~hmac.HMAC`. (Contribuído por Christian Heimes em :issue:`32433`.)

source: :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` now support the new *blocksize* argument for improved upload throughput. (Contributed by Nir Soffer in :issue:`31945`.)
pt_pt: :class:`~http.client.HTTPConnection` e :class:`~http.client.HTTPSConnection` agora suportam o novo argumento *blocksize* para melhorar a taxa de transferência de envio. (Contribuído por Nir Soffer em :issue:`31945`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` now supports the HTTP ``If-Modified-Since`` header. The server returns the 304 response status if the target file was not modified after the time specified in the header. (Contributed by Pierre Quentel in :issue:`29654`.)
pt_pt: :class:`~http.server.SimpleHTTPRequestHandler` agora suporta o cabeçalho HTTP ``If-Modified-Since``. O servidor retorna o estado de resposta 304 se o ficheiro de destino não foi modificado após o tempo especificado no cabeçalho. (Contribuído por Pierre Quentel em :issue:`29654`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` accepts the new *directory* argument, in addition to the new ``--directory`` command line argument. With this parameter, the server serves the specified directory, by default it uses the current working directory. (Contributed by Stéphane Wirtel and Julien Palard in :issue:`28707`.)
pt_pt: :class:`~http.server.SimpleHTTPRequestHandler` aceita o novo argumento *directory*, além do novo argumento de linha de comandos ``--directory``. Com este parâmetro, o servidor serve o diretório especificado; por defeito, usa o diretório de trabalho atual. (Contribuído por Stéphane Wirtel e Julien Palard em :issue:`28707`.)

source: idlelib and IDLE
pt_pt: idlelib e IDLE

source: Multiple fixes for autocompletion. (Contributed by Louie Lu in :issue:`15786`.)
pt_pt: Várias correções para autocompletar. (Contribuído por Louie Lu em :issue:`15786`.)

source: Module Browser (on the File menu, formerly called Class Browser), now displays nested functions and classes in addition to top-level functions and classes. (Contributed by Guilherme Polo, Cheryl Sabella, and Terry Jan Reedy in :issue:`1612262`.)
pt_pt: O Navegador de Módulos (no menu Ficheiro, anteriormente chamado Navegador de Classes) agora mostra funções e classes aninhadas, além de funções e classes de nível superior. (Contribuído por Guilherme Polo, Cheryl Sabella e Terry Jan Reedy em :issue:`1612262`.)

source: The Settings dialog (Options, Configure IDLE) has been partly rewritten to improve both appearance and function. (Contributed by Cheryl Sabella and Terry Jan Reedy in multiple issues.)
pt_pt: O diálogo de Definições (Opções, Configurar IDLE) foi parcialmente reescrito para melhorar tanto o aspeto como a funcionalidade. (Contribuído por Cheryl Sabella e Terry Jan Reedy em vários *issues*.)

source: The font sample now includes a selection of non-Latin characters so that users can better see the effect of selecting a particular font. (Contributed by Terry Jan Reedy in :issue:`13802`.) The sample can be edited to include other characters. (Contributed by Serhiy Storchaka in :issue:`31860`.)
pt_pt: A amostra de tipo de letra agora inclui uma seleção de caracteres não-latinos, para que os utilizadores possam ver melhor o efeito de selecionar um tipo de letra específico. (Contribuído por Terry Jan Reedy em :issue:`13802`.) A amostra pode ser editada para incluir outros caracteres. (Contribuído por Serhiy Storchaka em :issue:`31860`.)

source: The IDLE features formerly implemented as extensions have been reimplemented as normal features. Their settings have been moved from the Extensions tab to other dialog tabs. (Contributed by Charles Wohlganger and Terry Jan Reedy in :issue:`27099`.)
pt_pt: As funcionalidades do IDLE anteriormente implementadas como extensões foram reimplementadas como funcionalidades normais. As suas definições foram movidas do separador Extensões para outros separadores de diálogo. (Contribuído por Charles Wohlganger e Terry Jan Reedy em :issue:`27099`.)

source: Editor code context option revised. Box displays all context lines up to maxlines. Clicking on a context line jumps the editor to that line. Context colors for custom themes is added to Highlights tab of Settings dialog. (Contributed by Cheryl Sabella and Terry Jan Reedy in :issue:`33642`, :issue:`33768`, and :issue:`33679`.)
pt_pt: Opção de contexto de código do editor revista. A caixa mostra todas as linhas de contexto até maxlines. Clicar numa linha de contexto faz com que o editor salte para essa linha. Cores de contexto para temas personalizados foram adicionadas ao separador Destaques do diálogo de Definições. (Contribuído por Cheryl Sabella e Terry Jan Reedy em :issue:`33642`, :issue:`33768` e :issue:`33679`.)

source: On Windows, a new API call tells Windows that tk scales for DPI. On Windows 8.1+ or 10, with DPI compatibility properties of the Python binary unchanged, and a monitor resolution greater than 96 DPI, this should make text and lines sharper. It should otherwise have no effect. (Contributed by Terry Jan Reedy in :issue:`33656`.)
pt_pt: No Windows, uma nova chamada de API informa o Windows que o tk escala para DPI. No Windows 8.1+ ou 10, com as propriedades de compatibilidade de DPI do binário do Python inalteradas e uma resolução de monitor superior a 96 DPI, isto deve tornar o texto e as linhas mais nítidos. Não deve ter outro efeito. (Contribuído por Terry Jan Reedy em :issue:`33656`.)

source: New in 3.7.1:
pt_pt: Novo no 3.7.1:

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
pt_pt: A saída com mais de N linhas (50 por defeito) é comprimida num botão. N pode ser alterado na secção PyShell da página Geral do diálogo de Definições. Menos linhas, mas possivelmente muito longas, podem ser comprimidas clicando com o botão direito na saída. A saída comprimida pode ser expandida no local clicando duas vezes no botão ou para a área de transferência ou uma janela separada clicando com o botão direito no botão. (Contribuído por Tal Einat em :issue:`1529353`.)

source: The changes above have been backported to 3.6 maintenance releases.
pt_pt: As alterações acima foram retroportadas para as versões de manutenção 3.6.

source: NEW in 3.7.4:
pt_pt: NOVO no 3.7.4:

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
pt_pt: Adicionar "Executar Personalizado" ao menu Executar para executar um módulo com definições personalizadas. Quaisquer argumentos de linha de comandos inseridos são adicionados a sys.argv. Eles reaparecem na caixa para a próxima execução personalizada. Também é possível suprimir o reinício normal do módulo principal da Shell. (Contribuído por Cheryl Sabella, Terry Jan Reedy e outros em :issue:`5680` e :issue:`37627`.)

source: New in 3.7.5:
pt_pt: Novo no 3.7.5:
