Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: CPython's own `CI configuration file <https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ provides an example of using the SSL :source:`compatibility testing infrastructure <Tools/ssl/multissltests.py>` in CPython's test suite to build and link against OpenSSL 1.1.0 rather than an outdated system provided OpenSSL.
pt_pt: O ficheiro de configuração de CI do CPython `<https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ fornece um exemplo de uso da infraestrutura de teste de compatibilidade SSL `<Tools/ssl/multissltests.py>` na suíte de testes do CPython para compilar e ligar contra o OpenSSL 1.1.0 em vez de um OpenSSL desatualizado fornecido pelo sistema.

source: API and Feature Removals
pt_pt: Remoções de API e Funcionalidades

source: The following features and APIs have been removed from Python 3.7:
pt_pt: As seguintes funcionalidades e APIs foram removidas do Python 3.7:

source: The ``os.stat_float_times()`` function has been removed. It was introduced in Python 2.3 for backward compatibility with Python 2.2, and was deprecated since Python 3.1.
pt_pt: A função ``os.stat_float_times()`` foi removida. Foi introduzida no Python 2.3 para compatibilidade retroativa com o Python 2.2 e estava obsoleta desde o Python 3.1.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter in replacement templates for :func:`re.sub` were deprecated in Python 3.5, and will now cause an error.
pt_pt: Escapes desconhecidos consistindo de ``'\'`` e uma letra ASCII em modelos de substituição para :func:`re.sub` foram obsoletos no Python 3.5 e agora causarão um erro.

source: Removed support of the *exclude* argument in :meth:`tarfile.TarFile.add`. It was deprecated in Python 2.7 and 3.2. Use the *filter* argument instead.
pt_pt: Removido o suporte do argumento *exclude* em :meth:`tarfile.TarFile.add`. Foi obsoleto no Python 2.7 e 3.2. Use o argumento *filter* em vez disso.

source: The :func:`!ntpath.splitunc` function was deprecated in Python 3.1, and has now been removed. Use :func:`~os.path.splitdrive` instead.
pt_pt: A função :func:`!ntpath.splitunc` foi obsoleta no Python 3.1 e foi agora removida. Use :func:`~os.path.splitdrive` em vez disso.

source: :func:`collections.namedtuple` no longer supports the *verbose* parameter or ``_source`` attribute which showed the generated source code for the named tuple class. This was part of an optimization designed to speed-up class creation. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
pt_pt: :func:`collections.namedtuple` já não suporta o parâmetro *verbose* ou o atributo ``_source`` que mostrava o código-fonte gerado para a classe de tuplo nomeado. Isto fez parte de uma otimização concebida para acelerar a criação de classes. (Contribuído por Jelle Zijlstra com melhorias adicionais de INADA Naoki, Serhiy Storchaka e Raymond Hettinger em :issue:`28638`.)

source: Functions :func:`bool`, :func:`float`, :func:`list` and :func:`tuple` no longer take keyword arguments. The first argument of :func:`int` can now be passed only as positional argument.
pt_pt: As funções :func:`bool`, :func:`float`, :func:`list` e :func:`tuple` já não aceitam argumentos de palavra-chave. O primeiro argumento de :func:`int` agora só pode ser passado como argumento posicional.

source: The ``asyncio.windows_utils.socketpair()`` function has been removed. Use the :func:`socket.socketpair` function instead, it is available on all platforms since Python 3.5. ``asyncio.windows_utils.socketpair`` was just an alias to ``socket.socketpair`` on Python 3.5 and newer.
pt_pt: A função ``asyncio.windows_utils.socketpair()`` foi removida. Use a função :func:`socket.socketpair` em vez disso; está disponível em todas as plataformas desde o Python 3.5. ``asyncio.windows_utils.socketpair`` era apenas um alias para ``socket.socketpair`` no Python 3.5 e versões mais recentes.

source: :mod:`asyncio` no longer exports the :mod:`selectors` and :mod:`!_overlapped` modules as ``asyncio.selectors`` and ``asyncio._overlapped``. Replace ``from asyncio import selectors`` with ``import selectors``.
pt_pt: :mod:`asyncio` já não exporta os módulos :mod:`selectors` e :mod:`!_overlapped` como ``asyncio.selectors`` e ``asyncio._overlapped``. Substitua ``from asyncio import selectors`` por ``import selectors``.

source: The unused ``distutils`` ``install_misc`` command has been removed. (Contributed by Eric N. Vander Weele in :issue:`29218`.)
pt_pt: O comando não utilizado ``install_misc`` do ``distutils`` foi removido. (Contribuído por Eric N. Vander Weele em :issue:`29218`.)

source: Module Removals
pt_pt: Remoções de Módulos

source: The ``fpectl`` module has been removed. It was never enabled by default, never worked correctly on x86-64, and it changed the Python ABI in ways that caused unexpected breakage of C extensions. (Contributed by Nathaniel J. Smith in :issue:`29137`.)
pt_pt: O módulo ``fpectl`` foi removido. Nunca foi ativado por defeito, nunca funcionou corretamente em x86-64, e alterou a ABI do Python de formas que causaram quebras inesperadas de extensões C. (Contribuído por Nathaniel J. Smith em :issue:`29137`.)

source: Windows-only Changes
pt_pt: Alterações Apenas para Windows

source: The python launcher, (py.exe), can accept 32 & 64 bit specifiers **without** having to specify a minor version as well. So ``py -3-32`` and ``py -3-64`` become valid as well as ``py -3.7-32``, also the -*m*-64 and -*m.n*-64 forms are now accepted to force 64 bit python even if 32 bit would have otherwise been used. If the specified version is not available py.exe will error exit. (Contributed by Steve Barnes in :issue:`30291`.)
pt_pt: O lançador do Python (py.exe) pode aceitar especificadores de 32 e 64 bits **sem** ter de especificar uma versão secundária. Assim, ``py -3-32`` e ``py -3-64`` tornam-se válidos, bem como ``py -3.7-32``; também as formas -*m*-64 e -*m.n*-64 são agora aceites para forçar o Python de 64 bits, mesmo que o de 32 bits fosse usado de outra forma. Se a versão especificada não estiver disponível, o py.exe sairá com erro. (Contribuído por Steve Barnes em :issue:`30291`.)

source: The launcher can be run as ``py -0`` to produce a list of the installed pythons, *with default marked with an asterisk*. Running ``py -0p`` will include the paths. If py is run with a version specifier that cannot be matched it will also print the *short form* list of available specifiers. (Contributed by Steve Barnes in :issue:`30362`.)
pt_pt: O lançador pode ser executado como ``py -0`` para produzir uma lista dos Pythons instalados, *com o predefinido marcado com um asterisco*. Executar ``py -0p`` incluirá os caminhos. Se o py for executado com um especificador de versão que não pode ser correspondido, também imprimirá a lista de especificadores disponíveis na *forma curta*. (Contribuído por Steve Barnes em :issue:`30362`.)

source: Porting to Python 3.7
pt_pt: Portar para Python 3.7

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_pt: Esta secção lista alterações previamente descritas e outras correções de erros que podem exigir alterações no seu código.

source: Changes in Python Behavior
pt_pt: Alterações no Comportamento do Python

source: :keyword:`async` and :keyword:`await` names are now reserved keywords. Code using these names as identifiers will now raise a :exc:`SyntaxError`. (Contributed by Jelle Zijlstra in :issue:`30406`.)
pt_pt: Os nomes :keyword:`async` e :keyword:`await` são agora palavras reservadas. Código que use estes nomes como identificadores lançará agora um :exc:`SyntaxError`. (Contribuído por Jelle Zijlstra em :issue:`30406`.)

source: :pep:`479` is enabled for all code in Python 3.7, meaning that :exc:`StopIteration` exceptions raised directly or indirectly in coroutines and generators are transformed into :exc:`RuntimeError` exceptions. (Contributed by Yury Selivanov in :issue:`32670`.)
pt_pt: A :pep:`479` está ativada para todo o código no Python 3.7, o que significa que as exceções :exc:`StopIteration` lançadas diretamente ou indiretamente em *coroutines* e geradores são transformadas em exceções :exc:`RuntimeError`. (Contribuído por Yury Selivanov em :issue:`32670`.)

source: :meth:`object.__aiter__` methods can no longer be declared as asynchronous. (Contributed by Yury Selivanov in :issue:`31709`.)
pt_pt: Os métodos :meth:`object.__aiter__` já não podem ser declarados como assíncronos. (Contribuído por Yury Selivanov em :issue:`31709`.)

source: Due to an oversight, earlier Python versions erroneously accepted the following syntax::
pt_pt: Devido a um descuido, versões anteriores do Python aceitavam erroneamente a seguinte sintaxe::

source: Python 3.7 now correctly raises a :exc:`SyntaxError`, as a generator expression always needs to be directly inside a set of parentheses and cannot have a comma on either side, and the duplication of the parentheses can be omitted only on calls. (Contributed by Serhiy Storchaka in :issue:`32012` and :issue:`32023`.)
pt_pt: O Python 3.7 agora lança corretamente um :exc:`SyntaxError`, uma vez que uma expressão geradora precisa sempre de estar diretamente dentro de um conjunto de parênteses e não pode ter uma vírgula de qualquer lado, e a duplicação dos parênteses só pode ser omitida em chamadas. (Contribuído por Serhiy Storchaka em :issue:`32012` e :issue:`32023`.)

source: When using the :option:`-m` switch, the initial working directory is now added to :data:`sys.path`, rather than an empty string (which dynamically denoted the current working directory at the time of each import). Any programs that are checking for the empty string, or otherwise relying on the previous behaviour, will need to be updated accordingly (e.g. by also checking for ``os.getcwd()`` or ``os.path.dirname(__main__.__file__)``, depending on why the code was checking for the empty string in the first place).
pt_pt: Ao usar a opção :option:`-m`, o diretório de trabalho inicial é agora adicionado a :data:`sys.path`, em vez de uma cadeia de caracteres vazia (que denotava dinamicamente o diretório de trabalho atual no momento de cada importação). Quaisquer programas que estejam a verificar a cadeia de caracteres vazia, ou que dependam do comportamento anterior, terão de ser atualizados em conformidade (por exemplo, verificando também ``os.getcwd()`` ou ``os.path.dirname(__main__.__file__)``, dependendo de por que o código estava a verificar a cadeia de caracteres vazia em primeiro lugar).

source: Changes in the Python API
pt_pt: Alterações na API do Python

source: The :func:`locale.localeconv` function now temporarily sets the ``LC_CTYPE`` locale to the value of ``LC_NUMERIC`` in some cases. (Contributed by Victor Stinner in :issue:`31900`.)
pt_pt: A função :func:`locale.localeconv` agora define temporariamente a localidade ``LC_CTYPE`` para o valor de ``LC_NUMERIC`` em alguns casos. (Contribuído por Victor Stinner em :issue:`31900`.)

source: :meth:`pkgutil.walk_packages` now raises a :exc:`ValueError` if *path* is a string. Previously an empty list was returned. (Contributed by Sanyam Khurana in :issue:`24744`.)
pt_pt: :meth:`pkgutil.walk_packages` agora lança um :exc:`ValueError` se *path* for uma cadeia de caracteres. Anteriormente, uma lista vazia era retornada. (Contribuído por Sanyam Khurana em :issue:`24744`.)

source: A format string argument for :meth:`string.Formatter.format` is now :ref:`positional-only <positional-only_parameter>`. Passing it as a keyword argument was deprecated in Python 3.5. (Contributed by Serhiy Storchaka in :issue:`29193`.)
pt_pt: Um argumento de cadeia de caracteres de formato para :meth:`string.Formatter.format` é agora :ref:`apenas posicional <positional-only_parameter>`. Passá-lo como argumento de palavra-chave estava obsoleto no Python 3.5. (Contribuído por Serhiy Storchaka em :issue:`29193`.)

source: Attributes :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` and :attr:`~http.cookies.Morsel.coded_value` of class :class:`http.cookies.Morsel` are now read-only. Assigning to them was deprecated in Python 3.5. Use the :meth:`~http.cookies.Morsel.set` method for setting them. (Contributed by Serhiy Storchaka in :issue:`29192`.)
pt_pt: Os atributos :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` e :attr:`~http.cookies.Morsel.coded_value` da classe :class:`http.cookies.Morsel` são agora de apenas leitura. Atribuir-lhes valores estava obsoleto no Python 3.5. Use o método :meth:`~http.cookies.Morsel.set` para os definir. (Contribuído por Serhiy Storchaka em :issue:`29192`.)

source: The *mode* argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. To set their file permission bits you can set the umask before invoking ``makedirs()``. (Contributed by Serhiy Storchaka in :issue:`19930`.)
pt_pt: O argumento *mode* de :func:`os.makedirs` já não afeta os bits de permissão de ficheiro de diretórios de nível intermédio recém-criados. Para definir os seus bits de permissão de ficheiro, pode definir a *umask* antes de invocar ``makedirs()``. (Contribuído por Serhiy Storchaka em :issue:`19930`.)

source: The :attr:`struct.Struct.format` type is now :class:`str` instead of :class:`bytes`. (Contributed by Victor Stinner in :issue:`21071`.)
pt_pt: O tipo de :attr:`struct.Struct.format` é agora :class:`str` em vez de :class:`bytes`. (Contribuído por Victor Stinner em :issue:`21071`.)

source: Due to internal changes in :mod:`socket`, calling :func:`socket.fromshare` on a socket created by :func:`socket.share <socket.socket.share>` in older Python versions is not supported.
pt_pt: Devido a alterações internas em :mod:`socket`, chamar :func:`socket.fromshare` num *socket* criado por :func:`socket.share <socket.socket.share>` em versões mais antigas do Python não é suportado.

source: ``repr`` for :exc:`BaseException` has changed to not include the trailing comma. Most exceptions are affected by this change. (Contributed by Serhiy Storchaka in :issue:`30399`.)
pt_pt: A representação ``repr`` para :exc:`BaseException` foi alterada para não incluir a vírgula final. A maioria das exceções é afetada por esta alteração. (Contribuído por Serhiy Storchaka em :issue:`30399`.)

source: ``repr`` for :class:`datetime.timedelta` has changed to include the keyword arguments in the output. (Contributed by Utkarsh Upadhyay in :issue:`30302`.)
pt_pt: A representação ``repr`` para :class:`datetime.timedelta` foi alterada para incluir os argumentos de palavra-chave na saída. (Contribuído por Utkarsh Upadhyay em :issue:`30302`.)

source: Because :func:`shutil.rmtree` is now implemented using the :func:`os.scandir` function, the user specified handler *onerror* is now called with the first argument ``os.scandir`` instead of ``os.listdir`` when listing the directory is failed.
pt_pt: Como :func:`shutil.rmtree` é agora implementado usando a função :func:`os.scandir`, o *handler* especificado pelo utilizador *onerror* é agora chamado com o primeiro argumento ``os.scandir`` em vez de ``os.listdir`` quando a listagem do diretório falha.

source: Support for nested sets and set operations in regular expressions as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax. To facilitate this future change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That include sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning, escape them with a backslash. (Contributed by Serhiy Storchaka in :issue:`30349`.)
pt_pt: O suporte para conjuntos aninhados e operações de conjunto em expressões regulares, como no `Unicode Technical Standard #18`_, pode ser adicionado no futuro. Isto alteraria a sintaxe. Para facilitar esta alteração futura, um :exc:`FutureWarning` será lançado em casos ambíguos por enquanto. Isto inclui conjuntos que começam com um literal ``'['`` ou que contêm sequências de caracteres literais ``'--'``, ``'&&'``, ``'~~'`` e ``'||'``. Para evitar um aviso, escape-os com uma barra invertida. (Contribuído por Serhiy Storchaka em :issue:`30349`.)

source: The result of splitting a string on a :mod:`regular expression <re>` that could match an empty string has been changed. For example splitting on ``r'\s*'`` will now split not only on whitespaces as it did previously, but also on empty strings before all non-whitespace characters and just before the end of the string. The previous behavior can be restored by changing the pattern to ``r'\s+'``. A :exc:`FutureWarning` was emitted for such patterns since Python 3.5.
pt_pt: O resultado de dividir uma cadeia de caracteres numa :mod:`expressão regular <re>` que pode corresponder a uma cadeia de caracteres vazia foi alterado. Por exemplo, dividir em ``r'\s*'`` agora divide não só em espaços em branco como fazia anteriormente, mas também em cadeias de caracteres vazias antes de todos os caracteres não-brancos e imediatamente antes do fim da cadeia de caracteres. O comportamento anterior pode ser restaurado alterando o padrão para ``r'\s+'``. Um :exc:`FutureWarning` foi emitido para tais padrões desde o Python 3.5.

source: For patterns that match both empty and non-empty strings, the result of searching for all matches may also be changed in other cases. For example in the string ``'a\n\n'``, the pattern ``r'(?m)^\s*?$'`` will not only match empty strings at positions 2 and 3, but also the string ``'\n'`` at positions 2--3. To match only blank lines, the pattern should be rewritten as ``r'(?m)^[^\S\n]*$'``.
pt_pt: Para padrões que correspondem tanto a cadeias de caracteres vazias como não-vazias, o resultado da pesquisa por todas as correspondências também pode ser alterado noutros casos. Por exemplo, na cadeia de caracteres ``'a\n\n'``, o padrão ``r'(?m)^\s*?$'`` não corresponderá apenas a cadeias de caracteres vazias nas posições 2 e 3, mas também à cadeia de caracteres ``'\n'`` nas posições 2--3. Para corresponder apenas a linhas em branco, o padrão deve ser reescrito como ``r'(?m)^[^\S\n]*$'``.

source: :func:`re.sub` now replaces empty matches adjacent to a previous non-empty match. For example ``re.sub('x*', '-', 'abxd')`` returns now ``'-a-b--d-'`` instead of ``'-a-b-d-'`` (the first minus between 'b' and 'd' replaces 'x', and the second minus replaces an empty string between 'x' and 'd').
pt_pt: :func:`re.sub` agora substitui correspondências vazias adjacentes a uma correspondência não-vazia anterior. Por exemplo, ``re.sub('x*', '-', 'abxd')`` retorna agora ``'-a-b--d-'`` em vez de ``'-a-b-d-'`` (o primeiro hífen entre 'b' e 'd' substitui 'x', e o segundo hífen substitui uma cadeia de caracteres vazia entre 'x' e 'd').

source: (Contributed by Serhiy Storchaka in :issue:`25054` and :issue:`32308`.)
pt_pt: (Contribuído por Serhiy Storchaka em :issue:`25054` e :issue:`32308`.)

source: Change :func:`re.escape` to only escape regex special characters instead of escaping all characters other than ASCII letters, numbers, and ``'_'``. (Contributed by Serhiy Storchaka in :issue:`29995`.)
pt_pt: Alterar :func:`re.escape` para escapar apenas caracteres especiais de expressões regulares em vez de escapar todos os caracteres exceto letras ASCII, números e ``'_'``. (Contribuído por Serhiy Storchaka em :issue:`29995`.)

source: :class:`tracemalloc.Traceback` frames are now sorted from oldest to most recent to be more consistent with :mod:`traceback`. (Contributed by Jesse Bakker in :issue:`32121`.)
pt_pt: Os *frames* de :class:`tracemalloc.Traceback` são agora ordenados do mais antigo para o mais recente para serem mais consistentes com :mod:`traceback`. (Contribuído por Jesse Bakker em :issue:`32121`.)

source: On OSes that support :const:`socket.SOCK_NONBLOCK` or :const:`socket.SOCK_CLOEXEC` bit flags, the :attr:`socket.type <socket.socket.type>` no longer has them applied. Therefore, checks like ``if sock.type == socket.SOCK_STREAM`` work as expected on all platforms. (Contributed by Yury Selivanov in :issue:`32331`.)
pt_pt: Em sistemas operativos que suportam as *flags* de bits :const:`socket.SOCK_NONBLOCK` ou :const:`socket.SOCK_CLOEXEC`, o :attr:`socket.type <socket.socket.type>` já não as tem aplicadas. Portanto, verificações como ``if sock.type == socket.SOCK_STREAM`` funcionam como esperado em todas as plataformas. (Contribuído por Yury Selivanov em :issue:`32331`.)

source: On Windows the default for the *close_fds* argument of :class:`subprocess.Popen` was changed from :const:`False` to :const:`True` when redirecting the standard handles. If you previously depended on handles being inherited when using :class:`subprocess.Popen` with standard io redirection, you will have to pass ``close_fds=False`` to preserve the previous behaviour, or use :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.
pt_pt: No Windows, o valor predefinido para o argumento *close_fds* de :class:`subprocess.Popen` foi alterado de :const:`False` para :const:`True` ao redirecionar os *handles* padrão. Se dependia anteriormente da herança de *handles* ao usar :class:`subprocess.Popen` com redirecionamento de E/S padrão, terá de passar ``close_fds=False`` para preservar o comportamento anterior, ou usar :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.

source: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- which implicitly affects :func:`importlib.invalidate_caches` -- now deletes entries in :data:`sys.path_importer_cache` which are set to ``None``. (Contributed by Brett Cannon in :issue:`33169`.)
pt_pt: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- que afeta implicitamente :func:`importlib.invalidate_caches` -- agora apaga entradas em :data:`sys.path_importer_cache` que estão definidas para ``None``. (Contribuído por Brett Cannon em :issue:`33169`.)

source: In :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop.sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>`, :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` have been changed to be proper coroutine methods to match their documentation. Previously, these methods returned :class:`asyncio.Future` instances. (Contributed by Yury Selivanov in :issue:`32327`.)
pt_pt: No :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop.sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>`, e :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` foram alterados para serem métodos de *coroutine* adequados, de acordo com a sua documentação. Anteriormente, estes métodos retornavam instâncias de :class:`asyncio.Future`. (Contribuído por Yury Selivanov em :issue:`32327`.)

source: :attr:`asyncio.Server.sockets` now returns a copy of the internal list of server sockets, instead of returning it directly. (Contributed by Yury Selivanov in :issue:`32662`.)
pt_pt: :attr:`asyncio.Server.sockets` agora retorna uma cópia da lista interna de *sockets* do servidor, em vez de a retornar diretamente. (Contribuído por Yury Selivanov em :issue:`32662`.)

source: :attr:`Struct.format <struct.Struct.format>` is now a :class:`str` instance instead of a :class:`bytes` instance. (Contributed by Victor Stinner in :issue:`21071`.)
pt_pt: :attr:`Struct.format <struct.Struct.format>` é agora uma instância de :class:`str` em vez de uma instância de :class:`bytes`. (Contribuído por Victor Stinner em :issue:`21071`.)
