Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: The subprocess module is now more graceful when handling :exc:`KeyboardInterrupt` during :func:`subprocess.call`, :func:`subprocess.run`, or in a :class:`~subprocess.Popen` context manager. It now waits a short amount of time for the child to exit, before continuing the handling of the ``KeyboardInterrupt`` exception. (Contributed by Gregory P. Smith in :issue:`25942`.)
pt_pt: O módulo subprocesso é agora mais elegante ao lidar com :exc:`KeyboardInterrupt` durante :func:`subprocess.call`, :func:`subprocess.run`, ou num gestor de contexto :class:`~subprocess.Popen`. Agora aguarda um curto período de tempo para que o processo filho termine, antes de continuar o tratamento da exceção ``KeyboardInterrupt``. (Contribuído por Gregory P. Smith em :issue:`25942`.)

source: The new :func:`sys.breakpointhook` hook function is called by the built-in :func:`breakpoint`. (Contributed by Barry Warsaw in :issue:`31353`.)
pt_pt: A nova função de gancho :func:`sys.breakpointhook` é chamada pela função integrada :func:`breakpoint`. (Contribuído por Barry Warsaw em :issue:`31353`.)

source: On Android, the new :func:`sys.getandroidapilevel` returns the build-time Android API version. (Contributed by Victor Stinner in :issue:`28740`.)
pt_pt: No Android, a nova função :func:`sys.getandroidapilevel` retorna a versão da API Android em tempo de compilação. (Contribuído por Victor Stinner em :issue:`28740`.)

source: :pep:`564` adds six new functions with nanosecond resolution to the :mod:`time` module:
pt_pt: :pep:`564` adiciona seis novas funções com resolução de nanosegundos ao módulo :mod:`time`:

source: New clock identifiers have been added:
pt_pt: Foram adicionados novos identificadores de relógio:

source: :const:`time.CLOCK_BOOTTIME` (Linux): Identical to :const:`time.CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
pt_pt: :const:`time.CLOCK_BOOTTIME` (Linux): Idêntico a :const:`time.CLOCK_MONOTONIC`, exceto que também inclui qualquer tempo em que o sistema esteja suspenso.

source: :const:`time.CLOCK_PROF` (FreeBSD, NetBSD and OpenBSD): High-resolution per-process CPU timer.
pt_pt: :const:`time.CLOCK_PROF` (FreeBSD, NetBSD e OpenBSD): Temporizador de CPU de alta resolução por processo.

source: :const:`time.CLOCK_UPTIME` (FreeBSD, OpenBSD): Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement.
pt_pt: :const:`time.CLOCK_UPTIME` (FreeBSD, OpenBSD): Tempo cujo valor absoluto é o tempo que o sistema esteve em execução e não suspenso, fornecendo uma medição precisa do tempo de atividade.

source: The new :func:`time.thread_time` and :func:`time.thread_time_ns` functions can be used to get per-thread CPU time measurements. (Contributed by Antoine Pitrou in :issue:`32025`.)
pt_pt: As novas funções :func:`time.thread_time` e :func:`time.thread_time_ns` podem ser usadas para obter medições de tempo de CPU por *thread*. (Contribuído por Antoine Pitrou em :issue:`32025`.)

source: The new :func:`time.pthread_getcpuclockid` function returns the clock ID of the thread-specific CPU-time clock.
pt_pt: A nova função :func:`time.pthread_getcpuclockid` retorna o ID do relógio do tempo de CPU específico da *thread*.

source: The new :class:`tkinter.ttk.Spinbox` class is now available. (Contributed by Alan Moore in :issue:`32585`.)
pt_pt: A nova classe :class:`tkinter.ttk.Spinbox` está agora disponível. (Contribuído por Alan Moore em :issue:`32585`.)

source: :class:`tracemalloc.Traceback` behaves more like regular tracebacks, sorting the frames from oldest to most recent. :meth:`Traceback.format() <tracemalloc.Traceback.format>` now accepts negative *limit*, truncating the result to the ``abs(limit)`` oldest frames. To get the old behaviour, use the new *most_recent_first* argument to ``Traceback.format()``. (Contributed by Jesse Bakker in :issue:`32121`.)
pt_pt: :class:`tracemalloc.Traceback` comporta-se mais como *tracebacks* regulares, ordenando os *frames* do mais antigo para o mais recente. :meth:`Traceback.format() <tracemalloc.Traceback.format>` agora aceita *limit* negativo, truncando o resultado para os ``abs(limit)`` *frames* mais antigos. Para obter o comportamento antigo, use o novo argumento *most_recent_first* em ``Traceback.format()``. (Contribuído por Jesse Bakker em :issue:`32121`.)

source: The new :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType`, and :class:`~types.ClassMethodDescriptorType` classes are now available. (Contributed by Manuel Krebber and Guido van Rossum in :issue:`29377`, and Serhiy Storchaka in :issue:`32265`.)
pt_pt: As novas classes :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType` e :class:`~types.ClassMethodDescriptorType` estão agora disponíveis. (Contribuído por Manuel Krebber e Guido van Rossum em :issue:`29377`, e Serhiy Storchaka em :issue:`32265`.)

source: The new :func:`types.resolve_bases` function resolves MRO entries dynamically as specified by :pep:`560`. (Contributed by Ivan Levkivskyi in :issue:`32717`.)
pt_pt: A nova função :func:`types.resolve_bases` resolve as entradas MRO dinamicamente conforme especificado pela :pep:`560`. (Contribuído por Ivan Levkivskyi em :issue:`32717`.)

source: The internal :mod:`unicodedata` database has been upgraded to use `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Contributed by Benjamin Peterson.)
pt_pt: A base de dados interna :mod:`unicodedata` foi atualizada para usar `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Contribuído por Benjamin Peterson.)

source: The new ``-k`` command-line option allows filtering tests by a name substring or a Unix shell-like pattern. For example, ``python -m unittest -k foo`` runs ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``. (Contributed by Jonas Haag in :issue:`32071`.)
pt_pt: A nova opção de linha de comandos ``-k`` permite filtrar testes por uma substring de nome ou um padrão semelhante a uma *shell* Unix. Por exemplo, ``python -m unittest -k foo`` executa ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, mas não ``bar_tests.FooTest.test_something``. (Contribuído por Jonas Haag em :issue:`32071`.)

source: The :const:`~unittest.mock.sentinel` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`. (Contributed by Serhiy Storchaka in :issue:`20804`.)
pt_pt: Os atributos :const:`~unittest.mock.sentinel` agora preservam a sua identidade quando são :mod:`copiados <copy>` ou :mod:`serializados <pickle>`. (Contribuído por Serhiy Storchaka em :issue:`20804`.)

source: The new :func:`~unittest.mock.seal` function allows sealing :class:`~unittest.mock.Mock` instances, which will disallow further creation of attribute mocks. The seal is applied recursively to all attributes that are themselves mocks. (Contributed by Mario Corchero in :issue:`30541`.)
pt_pt: A nova função :func:`~unittest.mock.seal` permite selar instâncias :class:`~unittest.mock.Mock`, o que impedirá a criação adicional de *mocks* de atributos. O selo é aplicado recursivamente a todos os atributos que são eles próprios *mocks*. (Contribuído por Mario Corchero em :issue:`30541`.)

source: :func:`urllib.parse.quote` has been updated from :rfc:`2396` to :rfc:`3986`, adding ``~`` to the set of characters that are never quoted by default. (Contributed by Christian Theune and Ratnadeep Debnath in :issue:`16285`.)
pt_pt: :func:`urllib.parse.quote` foi atualizada de :rfc:`2396` para :rfc:`3986`, adicionando ``~`` ao conjunto de caracteres que nunca são citados por defeito. (Contribuído por Christian Theune e Ratnadeep Debnath em :issue:`16285`.)

source: The new :attr:`UUID.is_safe <uuid.UUID.is_safe>` attribute relays information from the platform about whether generated UUIDs are generated with a multiprocessing-safe method. (Contributed by Barry Warsaw in :issue:`22807`.)
pt_pt: O novo atributo :attr:`UUID.is_safe <uuid.UUID.is_safe>` transmite informações da plataforma sobre se os UUIDs gerados são gerados com um método seguro para multiprocessamento. (Contribuído por Barry Warsaw em :issue:`22807`.)

source: :func:`uuid.getnode` now prefers universally administered MAC addresses over locally administered MAC addresses. This makes a better guarantee for global uniqueness of UUIDs returned from :func:`uuid.uuid1`. If only locally administered MAC addresses are available, the first such one found is returned. (Contributed by Barry Warsaw in :issue:`32107`.)
pt_pt: :func:`uuid.getnode` agora prefere endereços MAC administrados universalmente em relação a endereços MAC administrados localmente. Isto oferece uma melhor garantia de unicidade global dos UUIDs retornados por :func:`uuid.uuid1`. Se apenas endereços MAC administrados localmente estiverem disponíveis, o primeiro encontrado é retornado. (Contribuído por Barry Warsaw em :issue:`32107`.)

source: The initialization of the default warnings filters has changed as follows:
pt_pt: A inicialização dos filtros de avisos predefinidos foi alterada da seguinte forma:

source: warnings enabled via command line options (including those for :option:`-b` and the new CPython-specific :option:`-X` ``dev`` option) are always passed to the warnings machinery via the :data:`sys.warnoptions` attribute.
pt_pt: avisos ativados através de opções de linha de comandos (incluindo aquelas para :option:`-b` e a nova opção específica do CPython :option:`-X` ``dev``) são sempre passados para a maquinaria de avisos através do atributo :data:`sys.warnoptions`.

source: warnings filters enabled via the command line or the environment now have the following order of precedence:
pt_pt: os filtros de avisos ativados através da linha de comandos ou do ambiente agora têm a seguinte ordem de precedência:

source: the ``BytesWarning`` filter for :option:`-b` (or ``-bb``)
pt_pt: o filtro ``BytesWarning`` para :option:`-b` (ou ``-bb``)

source: any filters specified with the :option:`-W` option
pt_pt: quaisquer filtros especificados com a opção :option:`-W`

source: any filters specified with the :envvar:`PYTHONWARNINGS` environment variable
pt_pt: quaisquer filtros especificados com a variável de ambiente :envvar:`PYTHONWARNINGS`

source: any other CPython specific filters (e.g. the ``default`` filter added for the new ``-X dev`` mode)
pt_pt: quaisquer outros filtros específicos do CPython (por exemplo, o filtro ``default`` adicionado para o novo modo ``-X dev``)

source: any implicit filters defined directly by the warnings machinery
pt_pt: quaisquer filtros implícitos definidos diretamente pela maquinaria de avisos

source: in :ref:`CPython debug builds <debug-build>`, all warnings are now displayed by default (the implicit filter list is empty)
pt_pt: em :ref:`compilações de depuração do CPython <debug-build>`, todos os avisos são agora exibidos por defeito (a lista de filtros implícitos está vazia)

source: (Contributed by Nick Coghlan and Victor Stinner in :issue:`20361`, :issue:`32043`, and :issue:`32230`.)
pt_pt: (Contribuído por Nick Coghlan e Victor Stinner em :issue:`20361`, :issue:`32043` e :issue:`32230`.)

source: Deprecation warnings are once again shown by default in single-file scripts and at the interactive prompt. See :ref:`whatsnew37-pep565` for details. (Contributed by Nick Coghlan in :issue:`31975`.)
pt_pt: Os avisos de obsolescência são novamente mostrados por defeito em *scripts* de ficheiro único e no *prompt* interativo. Veja :ref:`whatsnew37-pep565` para mais detalhes. (Contribuído por Nick Coghlan em :issue:`31975`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :gh:`61441`.)
pt_pt: Como mitigação contra a recuperação de DTD e entidades externas, os módulos :mod:`xml.dom.minidom` e :mod:`xml.sax` já não processam entidades externas por defeito. (Contribuído por Christian Heimes em :gh:`61441`.)

source: Function :func:`~zipapp.create_archive` now accepts an optional *filter* argument to allow the user to select which files should be included in the archive. (Contributed by Irmen de Jong in :issue:`31072`.)
pt_pt: A função :func:`~zipapp.create_archive` agora aceita um argumento opcional *filter* para permitir que o utilizador selecione quais ficheiros devem ser incluídos no arquivo. (Contribuído por Irmen de Jong em :issue:`31072`.)

source: Function :func:`~zipapp.create_archive` now accepts an optional *compressed* argument to generate a compressed archive. A command line option ``--compress`` has also been added to support compression. (Contributed by Zhiming Wang in :issue:`31638`.)
pt_pt: A função :func:`~zipapp.create_archive` agora aceita um argumento opcional *compressed* para gerar um arquivo comprimido. Uma opção de linha de comandos ``--compress`` também foi adicionada para suportar compressão. (Contribuído por Zhiming Wang em :issue:`31638`.)

source: :class:`~zipfile.ZipFile` now accepts the new *compresslevel* parameter to control the compression level. (Contributed by Bo Bayles in :issue:`21417`.)
pt_pt: :class:`~zipfile.ZipFile` agora aceita o novo parâmetro *compresslevel* para controlar o nível de compressão. (Contribuído por Bo Bayles em :issue:`21417`.)

source: Subdirectories in archives created by ``ZipFile`` are now stored in alphabetical order. (Contributed by Bernhard M. Wiedemann in :issue:`30693`.)
pt_pt: Subdiretórios em arquivos criados por ``ZipFile`` são agora armazenados por ordem alfabética. (Contribuído por Bernhard M. Wiedemann em :issue:`30693`.)

source: C API Changes
pt_pt: Alterações na API C

source: A new API for thread-local storage has been implemented. See :ref:`whatsnew37-pep539` for an overview and :ref:`thread-specific-storage-api` for a complete reference. (Contributed by Masayuki Yamamoto in :issue:`25658`.)
pt_pt: Uma nova API para armazenamento local de *thread* foi implementada. Veja :ref:`whatsnew37-pep539` para uma visão geral e :ref:`thread-specific-storage-api` para uma referência completa. (Contribuído por Masayuki Yamamoto em :issue:`25658`.)

source: The new :ref:`context variables <whatsnew37-pep567>` functionality exposes a number of :ref:`new C APIs <contextvarsobjects>`.
pt_pt: A nova funcionalidade de :ref:`variáveis de contexto <whatsnew37-pep567>` expõe várias :ref:`novas APIs C <contextvarsobjects>`.

source: The new :c:func:`PyImport_GetModule` function returns the previously imported module with the given name. (Contributed by Eric Snow in :issue:`28411`.)
pt_pt: A nova função :c:func:`PyImport_GetModule` retorna o módulo previamente importado com o nome dado. (Contribuído por Eric Snow em :issue:`28411`.)

source: The new :c:macro:`Py_RETURN_RICHCOMPARE` macro eases writing rich comparison functions. (Contributed by Petr Victorin in :issue:`23699`.)
pt_pt: A nova macro :c:macro:`Py_RETURN_RICHCOMPARE` facilita a escrita de funções de comparação rica. (Contribuído por Petr Victorin em :issue:`23699`.)

source: The new :c:macro:`Py_UNREACHABLE` macro can be used to mark unreachable code paths. (Contributed by Barry Warsaw in :issue:`31338`.)
pt_pt: A nova macro :c:macro:`Py_UNREACHABLE` pode ser usada para marcar caminhos de código inacessíveis. (Contribuído por Barry Warsaw em :issue:`31338`.)

source: The :mod:`tracemalloc` now exposes a C API through the new :c:func:`PyTraceMalloc_Track` and :c:func:`PyTraceMalloc_Untrack` functions. (Contributed by Victor Stinner in :issue:`30054`.)
pt_pt: O módulo :mod:`tracemalloc` agora expõe uma API C através das novas funções :c:func:`PyTraceMalloc_Track` e :c:func:`PyTraceMalloc_Untrack`. (Contribuído por Victor Stinner em :issue:`30054`.)

source: The result of :c:func:`PyUnicode_AsUTF8AndSize` and :c:func:`PyUnicode_AsUTF8` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`28769`.)
pt_pt: O resultado de :c:func:`PyUnicode_AsUTF8AndSize` e :c:func:`PyUnicode_AsUTF8` é agora do tipo ``const char *`` em vez de ``char *``. (Contribuído por Serhiy Storchaka em :issue:`28769`.)

source: The result of :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` and :c:func:`PyMapping_Items` is now always a list, rather than a list or a tuple. (Contributed by Oren Milman in :issue:`28280`.)
pt_pt: O resultado de :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` e :c:func:`PyMapping_Items` é agora sempre uma lista, em vez de uma lista ou um tuplo. (Contribuído por Oren Milman em :issue:`28280`.)

source: Added functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
pt_pt: Adicionadas as funções :c:func:`PySlice_Unpack` e :c:func:`PySlice_AdjustIndices`. (Contribuído por Serhiy Storchaka em :issue:`27867`.)

source: :c:func:`PyOS_AfterFork` is deprecated in favour of the new functions :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`. (Contributed by Antoine Pitrou in :issue:`16500`.)
pt_pt: :c:func:`PyOS_AfterFork` está obsoleta em favor das novas funções :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` e :c:func:`PyOS_AfterFork_Child`. (Contribuído por Antoine Pitrou em :issue:`16500`.)

source: The ``PyExc_RecursionErrorInst`` singleton that was part of the public API has been removed as its members being never cleared may cause a segfault during finalization of the interpreter. Contributed by Xavier de Gaye in :issue:`22898` and :issue:`30697`.
pt_pt: O *singleton* ``PyExc_RecursionErrorInst`` que fazia parte da API pública foi removido, uma vez que os seus membros nunca eram limpos e podiam causar uma falha de segmentação durante a finalização do interpretador. (Contribuído por Xavier de Gaye em :issue:`22898` e :issue:`30697`.)

source: Added C API support for timezones with timezone constructors :c:func:`PyTimeZone_FromOffset` and :c:func:`PyTimeZone_FromOffsetAndName`, and access to the UTC singleton with :c:data:`PyDateTime_TimeZone_UTC`. Contributed by Paul Ganssle in :issue:`10381`.
pt_pt: Adicionado suporte de API C para fusos horários com construtores de fuso horário :c:func:`PyTimeZone_FromOffset` e :c:func:`PyTimeZone_FromOffsetAndName`, e acesso ao *singleton* UTC com :c:data:`PyDateTime_TimeZone_UTC`. (Contribuído por Paul Ganssle em :issue:`10381`.)

source: :c:func:`PyUnicode_AsWideCharString` now raises a :exc:`ValueError` if the second argument is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters. (Contributed by Serhiy Storchaka in :issue:`30708`.)
pt_pt: :c:func:`PyUnicode_AsWideCharString` agora lança um :exc:`ValueError` se o segundo argumento for ``NULL`` e a cadeia de caracteres :c:expr:`wchar_t*` contiver caracteres nulos. (Contribuído por Serhiy Storchaka em :issue:`30708`.)

source: Changes to the startup sequence and the management of dynamic memory allocators mean that the long documented requirement to call :c:func:`Py_Initialize` before calling most C API functions is now relied on more heavily, and failing to abide by it may lead to segfaults in embedding applications. See the :ref:`porting-to-python-37` section in this document and the :ref:`pre-init-safe` section in the C API documentation for more details.
pt_pt: Alterações na sequência de inicialização e na gestão de alocadores de memória dinâmica significam que o requisito há muito documentado de chamar :c:func:`Py_Initialize` antes de chamar a maioria das funções da API C é agora mais dependente, e o não cumprimento pode levar a falhas de segmentação em aplicações de incorporação. Veja a secção :ref:`porting-to-python-37` neste documento e a secção :ref:`pre-init-safe` na documentação da API C para mais detalhes.

source: The new :c:func:`PyInterpreterState_GetID` returns the unique ID for a given interpreter. (Contributed by Eric Snow in :issue:`29102`.)
pt_pt: A nova função :c:func:`PyInterpreterState_GetID` retorna o ID único para um interpretador dado. (Contribuído por Eric Snow em :issue:`29102`.)

source: :c:func:`Py_DecodeLocale`, :c:func:`Py_EncodeLocale` now use the UTF-8 encoding when the :ref:`UTF-8 mode <whatsnew37-pep540>` is enabled. (Contributed by Victor Stinner in :issue:`29240`.)
pt_pt: :c:func:`Py_DecodeLocale` e :c:func:`Py_EncodeLocale` agora usam a codificação UTF-8 quando o :ref:`modo UTF-8 <whatsnew37-pep540>` está ativado. (Contribuído por Victor Stinner em :issue:`29240`.)

source: :c:func:`PyUnicode_DecodeLocaleAndSize` and :c:func:`PyUnicode_EncodeLocale` now use the current locale encoding for ``surrogateescape`` error handler. (Contributed by Victor Stinner in :issue:`29240`.)
pt_pt: :c:func:`PyUnicode_DecodeLocaleAndSize` e :c:func:`PyUnicode_EncodeLocale` agora usam a codificação de localidade atual para o *handler* de erros ``surrogateescape``. (Contribuído por Victor Stinner em :issue:`29240`.)

source: The *start* and *end* parameters of :c:func:`PyUnicode_FindChar` are now adjusted to behave like string slices. (Contributed by Xiang Zhang in :issue:`28822`.)
pt_pt: Os parâmetros *start* e *end* de :c:func:`PyUnicode_FindChar` são agora ajustados para se comportarem como fatias de cadeias de caracteres. (Contribuído por Xiang Zhang em :issue:`28822`.)

source: Build Changes
pt_pt: Alterações na Compilação

source: Support for building ``--without-threads`` has been removed. The :mod:`threading` module is now always available. (Contributed by Antoine Pitrou in :issue:`31370`.).
pt_pt: O suporte para compilação ``--without-threads`` foi removido. O módulo :mod:`threading` está agora sempre disponível. (Contribuído por Antoine Pitrou em :issue:`31370`.)

source: A full copy of libffi is no longer bundled for use when building the :mod:`_ctypes <ctypes>` module on non-OSX UNIX platforms. An installed copy of libffi is now required when building ``_ctypes`` on such platforms. (Contributed by Zachary Ware in :issue:`27979`.)
pt_pt: Uma cópia completa da libffi já não é incluída para uso ao compilar o módulo :mod:`_ctypes <ctypes>` em plataformas UNIX não-OSX. Uma cópia instalada da libffi é agora necessária ao compilar ``_ctypes`` nessas plataformas. (Contribuído por Zachary Ware em :issue:`27979`.)

source: The Windows build process no longer depends on Subversion to pull in external sources, a Python script is used to download zipfiles from GitHub instead. If Python 3.6 is not found on the system (via ``py -3.6``), NuGet is used to download a copy of 32-bit Python for this purpose. (Contributed by Zachary Ware in :issue:`30450`.)
pt_pt: O processo de compilação do Windows já não depende do Subversion para obter fontes externas; um *script* Python é usado para descarregar ficheiros zip do GitHub em vez disso. Se o Python 3.6 não for encontrado no sistema (através de ``py -3.6``), o NuGet é usado para descarregar uma cópia do Python de 32 bits para este fim. (Contribuído por Zachary Ware em :issue:`30450`.)

source: The :mod:`ssl` module requires OpenSSL 1.0.2 or 1.1 compatible libssl. OpenSSL 1.0.1 has reached end of lifetime on 2016-12-31 and is no longer supported. LibreSSL is temporarily not supported as well. LibreSSL releases up to version 2.6.4 are missing required OpenSSL 1.0.2 APIs.
pt_pt: O módulo :mod:`ssl` requer libssl compatível com OpenSSL 1.0.2 ou 1.1. O OpenSSL 1.0.1 atingiu o fim de vida em 2016-12-31 e já não é suportado. O LibreSSL também não é suportado temporariamente. As versões do LibreSSL até à 2.6.4 não têm as APIs necessárias do OpenSSL 1.0.2.

source: Optimizations
pt_pt: Otimizações
