Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: Add optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
pt_pt: Adicionar números de linha opcionais para janelas do editor IDLE. As janelas abrem sem números de linha, a menos que seja definido de outra forma no separador Geral do diálogo de configuração. Os números de linha para uma janela existente são mostrados e ocultados no menu Opções. (Contribuído por Tal Einat e Saimadhav Heblikar em :issue:`17535`.)

source: The :class:`importlib.abc.ResourceReader` ABC was introduced to support the loading of resources from packages. See also :ref:`whatsnew37_importlib_resources`. (Contributed by Barry Warsaw, Brett Cannon in :issue:`32248`.)
pt_pt: A ABC :class:`importlib.abc.ResourceReader` foi introduzida para suportar o carregamento de recursos a partir de pacotes. Veja também :ref:`whatsnew37_importlib_resources`. (Contribuído por Barry Warsaw, Brett Cannon em :issue:`32248`.)

source: :func:`importlib.reload` now raises :exc:`ModuleNotFoundError` if the module lacks a spec. (Contributed by Garvit Khatri in :issue:`29851`.)
pt_pt: :func:`importlib.reload` agora lança :exc:`ModuleNotFoundError` se o módulo não tiver uma especificação. (Contribuído por Garvit Khatri em :issue:`29851`.)

source: The new :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` method can be used to reconfigure the text stream with the new settings. (Contributed by Antoine Pitrou in :issue:`30526` and INADA Naoki in :issue:`15216`.)
pt_pt: O novo método :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` pode ser usado para reconfigurar o fluxo de texto com as novas definições. (Contribuído por Antoine Pitrou em :issue:`30526` e INADA Naoki em :issue:`15216`.)

source: The new ``subnet_of()`` and ``supernet_of()`` methods of :class:`ipaddress.IPv6Network` and :class:`ipaddress.IPv4Network` can be used for network containment tests. (Contributed by Michel Albert and Cheryl Sabella in :issue:`20825`.)
pt_pt: Os novos métodos ``subnet_of()`` e ``supernet_of()`` de :class:`ipaddress.IPv6Network` e :class:`ipaddress.IPv4Network` podem ser usados para testes de contenção de rede. (Contribuído por Michel Albert e Cheryl Sabella em :issue:`20825`.)

source: :func:`itertools.islice` now accepts :meth:`integer-like objects <object.__index__>` as start, stop, and slice arguments. (Contributed by Will Roberts in :issue:`30537`.)
pt_pt: :func:`itertools.islice` agora aceita :meth:`objetos semelhantes a inteiros <object.__index__>` como argumentos de início, parada e fatia. (Contribuído por Will Roberts em :issue:`30537`.)

source: The new *monetary* argument to :func:`locale.format_string` can be used to make the conversion use monetary thousands separators and grouping strings. (Contributed by Garvit in :issue:`10379`.)
pt_pt: O novo argumento *monetary* para :func:`locale.format_string` pode ser usado para fazer com que a conversão utilize separadores de milhares monetários e cadeias de agrupamento. (Contribuído por Garvit em :issue:`10379`.)

source: The :func:`locale.getpreferredencoding` function now always returns ``'UTF-8'`` on Android or when in the :ref:`forced UTF-8 mode <whatsnew37-pep540>`.
pt_pt: A função :func:`locale.getpreferredencoding` agora retorna sempre ``'UTF-8'`` no Android ou quando no :ref:`modo UTF-8 forçado <whatsnew37-pep540>`.

source: :class:`~logging.Logger` instances can now be pickled. (Contributed by Vinay Sajip in :issue:`30520`.)
pt_pt: As instâncias de :class:`~logging.Logger` agora podem ser serializadas. (Contribuído por Vinay Sajip em :issue:`30520`.)

source: The new :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` method can be used to replace the logger stream after handler creation. (Contributed by Vinay Sajip in :issue:`30522`.)
pt_pt: O novo método :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` pode ser usado para substituir o fluxo do registador após a criação do manipulador. (Contribuído por Vinay Sajip em :issue:`30522`.)

source: It is now possible to specify keyword arguments to handler constructors in configuration passed to :func:`logging.config.fileConfig`. (Contributed by Preston Landers in :issue:`31080`.)
pt_pt: Agora é possível especificar argumentos de palavra-chave para construtores de manipuladores na configuração passada para :func:`logging.config.fileConfig`. (Contribuído por Preston Landers em :issue:`31080`.)

source: The new :func:`math.remainder` function implements the IEEE 754-style remainder operation. (Contributed by Mark Dickinson in :issue:`29962`.)
pt_pt: A nova função :func:`math.remainder` implementa a operação de resto no estilo IEEE 754. (Contribuído por Mark Dickinson em :issue:`29962`.)

source: The MIME type of .bmp has been changed from ``'image/x-ms-bmp'`` to ``'image/bmp'``. (Contributed by Nitish Chandra in :issue:`22589`.)
pt_pt: O tipo MIME de .bmp foi alterado de ``'image/x-ms-bmp'`` para ``'image/bmp'``. (Contribuído por Nitish Chandra em :issue:`22589`.)

source: multiprocessing
pt_pt: multiprocessamento

source: The new :meth:`Process.close() <multiprocessing.Process.close>` method explicitly closes the process object and releases all resources associated with it. :exc:`ValueError` is raised if the underlying process is still running. (Contributed by Antoine Pitrou in :issue:`30596`.)
pt_pt: O novo método :meth:`Process.close() <multiprocessing.Process.close>` fecha explicitamente o objeto de processo e libera todos os recursos associados a ele. :exc:`ValueError` é lançado se o processo subjacente ainda estiver em execução. (Contribuído por Antoine Pitrou em :issue:`30596`.)

source: Non-daemonic threads created by :class:`~multiprocessing.Process` are now joined on process exit. (Contributed by Antoine Pitrou in :issue:`18966`.)
pt_pt: As *threads* não-demoníacas criadas por :class:`~multiprocessing.Process` agora são unidas na saída do processo. (Contribuído por Antoine Pitrou em :issue:`18966`.)

source: :func:`os.fwalk` now accepts the *path* argument as :class:`bytes`. (Contributed by Serhiy Storchaka in :issue:`28682`.)
pt_pt: :func:`os.fwalk` agora aceita o argumento *path* como :class:`bytes`. (Contribuído por Serhiy Storchaka em :issue:`28682`.)

source: :func:`os.scandir` gained support for :ref:`file descriptors <path_fd>`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
pt_pt: :func:`os.scandir` ganhou suporte para :ref:`descritores de ficheiro <path_fd>`. (Contribuído por Serhiy Storchaka em :issue:`25996`.)

source: The new :func:`~os.register_at_fork` function allows registering Python callbacks to be executed at process fork. (Contributed by Antoine Pitrou in :issue:`16500`.)
pt_pt: A nova função :func:`~os.register_at_fork` permite registar *callbacks* Python para serem executados na bifurcação do processo. (Contribuído por Antoine Pitrou em :issue:`16500`.)

source: Added :func:`os.preadv` (combine the functionality of :func:`os.readv` and :func:`os.pread`) and :func:`os.pwritev` functions (combine the functionality of :func:`os.writev` and :func:`os.pwrite`). (Contributed by Pablo Galindo in :issue:`31368`.)
pt_pt: Adicionadas as funções :func:`os.preadv` (combinam a funcionalidade de :func:`os.readv` e :func:`os.pread`) e :func:`os.pwritev` (combinam a funcionalidade de :func:`os.writev` e :func:`os.pwrite`). (Contribuído por Pablo Galindo em :issue:`31368`.)

source: The mode argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. (Contributed by Serhiy Storchaka in :issue:`19930`.)
pt_pt: O argumento de modo de :func:`os.makedirs` já não afeta os bits de permissão de ficheiro de diretórios de nível intermédio recém-criados. (Contribuído por Serhiy Storchaka em :issue:`19930`.)

source: :func:`os.dup2` now returns the new file descriptor. Previously, ``None`` was always returned. (Contributed by Benjamin Peterson in :issue:`32441`.)
pt_pt: :func:`os.dup2` agora retorna o novo descritor de ficheiro. Anteriormente, ``None`` era sempre retornado. (Contribuído por Benjamin Peterson em :issue:`32441`.)

source: The structure returned by :func:`os.stat` now contains the :attr:`~os.stat_result.st_fstype` attribute on Solaris and its derivatives. (Contributed by Jesús Cea Avión in :issue:`32659`.)
pt_pt: A estrutura retornada por :func:`os.stat` agora contém o atributo :attr:`~os.stat_result.st_fstype` no Solaris e seus derivados. (Contribuído por Jesús Cea Avión em :issue:`32659`.)

source: The new :meth:`Path.is_mount() <pathlib.Path.is_mount>` method is now available on POSIX systems and can be used to determine whether a path is a mount point. (Contributed by Cooper Ry Lees in :issue:`30897`.)
pt_pt: O novo método :meth:`Path.is_mount() <pathlib.Path.is_mount>` agora está disponível em sistemas POSIX e pode ser usado para determinar se um caminho é um ponto de montagem. (Contribuído por Cooper Ry Lees em :issue:`30897`.)

source: :func:`pdb.set_trace` now takes an optional *header* keyword-only argument. If given, it is printed to the console just before debugging begins. (Contributed by Barry Warsaw in :issue:`31389`.)
pt_pt: :func:`pdb.set_trace` agora aceita um argumento opcional apenas por palavra-chave *header*. Se fornecido, é impresso na consola imediatamente antes do início da depuração. (Contribuído por Barry Warsaw em :issue:`31389`.)

source: :mod:`pdb` command line now accepts ``-m module_name`` as an alternative to script file. (Contributed by Mario Corchero in :issue:`32206`.)
pt_pt: A linha de comandos :mod:`pdb` agora aceita ``-m module_name`` como alternativa ao ficheiro de script. (Contribuído por Mario Corchero em :issue:`32206`.)

source: :func:`py_compile.compile` -- and by extension, :mod:`compileall` -- now respects the :envvar:`SOURCE_DATE_EPOCH` environment variable by unconditionally creating ``.pyc`` files for hash-based validation. This allows for guaranteeing `reproducible builds <https://reproducible-builds.org/>`_ of ``.pyc`` files when they are created eagerly. (Contributed by Bernhard M. Wiedemann in :issue:`29708`.)
pt_pt: :func:`py_compile.compile` -- e por extensão, :mod:`compileall` -- agora respeita a variável de ambiente :envvar:`SOURCE_DATE_EPOCH`, criando incondicionalmente ficheiros ``.pyc`` para validação baseada em *hash*. Isto permite garantir `compilações reprodutíveis <https://reproducible-builds.org/>`_ de ficheiros ``.pyc`` quando são criados de forma imediata. (Contribuído por Bernhard M. Wiedemann em :issue:`29708`.)

source: The pydoc server can now bind to an arbitrary hostname specified by the new ``-n`` command-line argument. (Contributed by Feanil Patel in :issue:`31128`.)
pt_pt: O servidor pydoc agora pode ligar-se a um nome de anfitrião arbitrário especificado pelo novo argumento de linha de comandos ``-n``. (Contribuído por Feanil Patel em :issue:`31128`.)

source: The new :class:`~queue.SimpleQueue` class is an unbounded :abbr:`FIFO` queue. (Contributed by Antoine Pitrou in :issue:`14976`.)
pt_pt: A nova classe :class:`~queue.SimpleQueue` é uma fila :abbr:`FIFO` ilimitada. (Contribuído por Antoine Pitrou em :issue:`14976`.)

source: The flags :const:`re.ASCII`, :const:`re.LOCALE` and :const:`re.UNICODE` can be set within the scope of a group. (Contributed by Serhiy Storchaka in :issue:`31690`.)
pt_pt: As *flags* :const:`re.ASCII`, :const:`re.LOCALE` e :const:`re.UNICODE` podem ser definidas dentro do âmbito de um grupo. (Contribuído por Serhiy Storchaka em :issue:`31690`.)

source: :func:`re.split` now supports splitting on a pattern like ``r'\b'``, ``'^$'`` or ``(?=-)`` that matches an empty string. (Contributed by Serhiy Storchaka in :issue:`25054`.)
pt_pt: :func:`re.split` agora suporta a divisão num padrão como ``r'\b'``, ``'^$'`` ou ``(?=-)`` que corresponde a uma cadeia de caracteres vazia. (Contribuído por Serhiy Storchaka em :issue:`25054`.)

source: Regular expressions compiled with the :const:`re.LOCALE` flag no longer depend on the locale at compile time. Locale settings are applied only when the compiled regular expression is used. (Contributed by Serhiy Storchaka in :issue:`30215`.)
pt_pt: Expressões regulares compiladas com a *flag* :const:`re.LOCALE` já não dependem da localidade no momento da compilação. As definições de localidade são aplicadas apenas quando a expressão regular compilada é usada. (Contribuído por Serhiy Storchaka em :issue:`30215`.)

source: :exc:`FutureWarning` is now emitted if a regular expression contains character set constructs that will change semantically in the future, such as nested sets and set operations. (Contributed by Serhiy Storchaka in :issue:`30349`.)
pt_pt: :exc:`FutureWarning` é agora emitido se uma expressão regular contiver construções de conjuntos de caracteres que mudarão semanticamente no futuro, como conjuntos aninhados e operações de conjunto. (Contribuído por Serhiy Storchaka em :issue:`30349`.)

source: Compiled regular expression and match objects can now be copied using :func:`copy.copy` and :func:`copy.deepcopy`. (Contributed by Serhiy Storchaka in :issue:`10076`.)
pt_pt: Objetos de expressão regular compilada e de correspondência agora podem ser copiados usando :func:`copy.copy` e :func:`copy.deepcopy`. (Contribuído por Serhiy Storchaka em :issue:`10076`.)

source: signal
pt_pt: sinal

source: The new *warn_on_full_buffer* argument to the :func:`signal.set_wakeup_fd` function makes it possible to specify whether Python prints a warning on stderr when the wakeup buffer overflows. (Contributed by Nathaniel J. Smith in :issue:`30050`.)
pt_pt: O novo argumento *warn_on_full_buffer* para a função :func:`signal.set_wakeup_fd` torna possível especificar se o Python imprime um aviso em stderr quando o *buffer* de despertar transborda. (Contribuído por Nathaniel J. Smith em :issue:`30050`.)

source: The new :func:`socket.getblocking() <socket.socket.getblocking>` method returns ``True`` if the socket is in blocking mode and ``False`` otherwise. (Contributed by Yury Selivanov in :issue:`32373`.)
pt_pt: O novo método :func:`socket.getblocking() <socket.socket.getblocking>` retorna ``True`` se o *socket* estiver no modo de bloqueio e ``False`` caso contrário. (Contribuído por Yury Selivanov em :issue:`32373`.)

source: The new :func:`socket.close` function closes the passed socket file descriptor. This function should be used instead of :func:`os.close` for better compatibility across platforms. (Contributed by Christian Heimes in :issue:`32454`.)
pt_pt: A nova função :func:`socket.close` fecha o descritor de ficheiro de *socket* passado. Esta função deve ser usada em vez de :func:`os.close` para melhor compatibilidade entre plataformas. (Contribuído por Christian Heimes em :issue:`32454`.)

source: Support for :const:`socket.AF_VSOCK` sockets has been added to allow communication between virtual machines and their hosts. (Contributed by Cathy Avery in :issue:`27584`.)
pt_pt: Foi adicionado suporte para *sockets* :const:`socket.AF_VSOCK` para permitir a comunicação entre máquinas virtuais e os seus anfitriões. (Contribuído por Cathy Avery em :issue:`27584`.)

source: Sockets now auto-detect family, type and protocol from file descriptor by default. (Contributed by Christian Heimes in :issue:`28134`.)
pt_pt: Os *sockets* agora detetam automaticamente a família, tipo e protocolo a partir do descritor de ficheiro por defeito. (Contribuído por Christian Heimes em :issue:`28134`.)

source: :class:`sqlite3.Connection` now exposes the :meth:`~sqlite3.Connection.backup` method when the underlying SQLite library is at version 3.6.11 or higher. (Contributed by Lele Gaifax in :issue:`27645`.)
pt_pt: :class:`sqlite3.Connection` agora expõe o método :meth:`~sqlite3.Connection.backup` quando a biblioteca SQLite subjacente está na versão 3.6.11 ou superior. (Contribuído por Lele Gaifax em :issue:`27645`.)

source: The *database* argument of :func:`sqlite3.connect` now accepts any :term:`path-like object`, instead of just a string. (Contributed by Anders Lorentsen in :issue:`31843`.)
pt_pt: O argumento *database* de :func:`sqlite3.connect` agora aceita qualquer :term:`objeto semelhante a caminho`, em vez de apenas uma cadeia de caracteres. (Contribuído por Anders Lorentsen em :issue:`31843`.)

source: The improved host name check requires a *libssl* implementation compatible with OpenSSL 1.0.2 or 1.1. Consequently, OpenSSL 0.9.8 and 1.0.1 are no longer supported (see :ref:`37-platform-support-removals` for more details). The ssl module is mostly compatible with LibreSSL 2.7.2 and newer.
pt_pt: A verificação melhorada do nome de anfitrião requer uma implementação *libssl* compatível com OpenSSL 1.0.2 ou 1.1. Consequentemente, OpenSSL 0.9.8 e 1.0.1 já não são suportados (veja :ref:`37-platform-support-removals` para mais detalhes). O módulo ssl é maioritariamente compatível com LibreSSL 2.7.2 e versões mais recentes.

source: The default cipher suite selection of the ``ssl`` module now uses a blacklist approach rather than a hard-coded whitelist. Python no longer re-enables ciphers that have been blocked by OpenSSL security updates. Default cipher suite selection can be configured at compile time. (Contributed by Christian Heimes in :issue:`31429`.)
pt_pt: A seleção predefinida de *suites* de cifras do módulo ``ssl`` agora usa uma abordagem de lista negra em vez de uma lista branca codificada. O Python já não reativa cifras que foram bloqueadas por atualizações de segurança do OpenSSL. A seleção predefinida de *suites* de cifras pode ser configurada em tempo de compilação. (Contribuído por Christian Heimes em :issue:`31429`.)

source: Validation of server certificates containing internationalized domain names (IDNs) is now supported. As part of this change, the :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` attribute now stores the expected hostname in A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``). (Contributed by Nathaniel J. Smith and Christian Heimes in :issue:`28414`.)
pt_pt: A validação de certificados de servidor que contêm nomes de domínio internacionalizados (IDNs) é agora suportada. Como parte desta alteração, o atributo :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` agora armazena o nome de anfitrião esperado na forma A-label (``"xn--pythn-mua.org"``), em vez da forma U-label (``"pythön.org"``). (Contribuído por Nathaniel J. Smith e Christian Heimes em :issue:`28414`.)

source: The ``ssl`` module has preliminary and experimental support for TLS 1.3 and OpenSSL 1.1.1. At the time of Python 3.7.0 release, OpenSSL 1.1.1 is still under development and TLS 1.3 hasn't been finalized yet. The TLS 1.3 handshake and protocol behaves slightly differently than TLS 1.2 and earlier, see :ref:`ssl-tlsv1_3`. (Contributed by Christian Heimes in :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` and :issue:`33618`)
pt_pt: O módulo ``ssl`` tem suporte preliminar e experimental para TLS 1.3 e OpenSSL 1.1.1. Na altura do lançamento do Python 3.7.0, o OpenSSL 1.1.1 ainda estava em desenvolvimento e o TLS 1.3 ainda não tinha sido finalizado. O *handshake* e protocolo TLS 1.3 comportam-se ligeiramente diferente do TLS 1.2 e anteriores, veja :ref:`ssl-tlsv1_3`. (Contribuído por Christian Heimes em :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` e :issue:`33618`)

source: :class:`~ssl.SSLSocket` and :class:`~ssl.SSLObject` no longer have a public constructor. Direct instantiation was never a documented and supported feature. Instances must be created with :class:`~ssl.SSLContext` methods :meth:`~ssl.SSLContext.wrap_socket` and :meth:`~ssl.SSLContext.wrap_bio`. (Contributed by Christian Heimes in :issue:`32951`)
pt_pt: :class:`~ssl.SSLSocket` e :class:`~ssl.SSLObject` já não têm um construtor público. A instanciação direta nunca foi uma funcionalidade documentada e suportada. As instâncias devem ser criadas com os métodos :class:`~ssl.SSLContext` :meth:`~ssl.SSLContext.wrap_socket` e :meth:`~ssl.SSLContext.wrap_bio`. (Contribuído por Christian Heimes em :issue:`32951`)

source: OpenSSL 1.1 APIs for setting the minimum and maximum TLS protocol version are available as :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` and :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Supported protocols are indicated by several new flags, such as :data:`~ssl.HAS_TLSv1_1`. (Contributed by Christian Heimes in :issue:`32609`.)
pt_pt: As APIs do OpenSSL 1.1 para definir a versão mínima e máxima do protocolo TLS estão disponíveis como :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` e :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Os protocolos suportados são indicados por várias novas *flags*, como :data:`~ssl.HAS_TLSv1_1`. (Contribuído por Christian Heimes em :issue:`32609`.)

source: Added :attr:`ssl.SSLContext.post_handshake_auth` to enable and :meth:`ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :gh:`78851`.)
pt_pt: Adicionado :attr:`ssl.SSLContext.post_handshake_auth` para ativar e :meth:`ssl.SSLSocket.verify_client_post_handshake` para iniciar a autenticação TLS 1.3 pós-*handshake*. (Contribuído por Christian Heimes em :gh:`78851`.)

source: :class:`string.Template` now lets you to optionally modify the regular expression pattern for braced placeholders and non-braced placeholders separately. (Contributed by Barry Warsaw in :issue:`1198569`.)
pt_pt: :class:`string.Template` agora permite modificar opcionalmente o padrão de expressão regular para *placeholders* entre chavetas e *placeholders* sem chavetas separadamente. (Contribuído por Barry Warsaw em :issue:`1198569`.)

source: subprocess
pt_pt: subprocesso

source: The :func:`subprocess.run` function accepts the new *capture_output* keyword argument. When true, stdout and stderr will be captured. This is equivalent to passing :const:`subprocess.PIPE` as *stdout* and *stderr* arguments. (Contributed by Bo Bayles in :issue:`32102`.)
pt_pt: A função :func:`subprocess.run` aceita o novo argumento de palavra-chave *capture_output*. Quando verdadeiro, stdout e stderr serão capturados. Isto é equivalente a passar :const:`subprocess.PIPE` como argumentos *stdout* e *stderr*. (Contribuído por Bo Bayles em :issue:`32102`.)

source: The ``subprocess.run`` function and the :class:`subprocess.Popen` constructor now accept the *text* keyword argument as an alias to *universal_newlines*. (Contributed by Andrew Clegg in :issue:`31756`.)
pt_pt: A função ``subprocess.run`` e o construtor :class:`subprocess.Popen` agora aceitam o argumento de palavra-chave *text* como um alias para *universal_newlines*. (Contribuído por Andrew Clegg em :issue:`31756`.)

source: On Windows the default for *close_fds* was changed from ``False`` to ``True`` when redirecting the standard handles. It's now possible to set *close_fds* to true when redirecting the standard handles. See :class:`subprocess.Popen`. This means that *close_fds* now defaults to ``True`` on all supported platforms. (Contributed by Segev Finer in :issue:`19764`.)
pt_pt: No Windows, o valor predefinido de *close_fds* foi alterado de ``False`` para ``True`` ao redirecionar os *handles* padrão. Agora é possível definir *close_fds* como verdadeiro ao redirecionar os *handles* padrão. Veja :class:`subprocess.Popen`. Isto significa que *close_fds* agora é ``True`` por defeito em todas as plataformas suportadas. (Contribuído por Segev Finer em :issue:`19764`.)
