Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: pt_pt

source: The default handling of :exc:`DeprecationWarning` has been changed such that these warnings are once more shown by default, but only when the code triggering them is running directly in the :mod:`__main__` module. As a result, developers of single file scripts and those using Python interactively should once again start seeing deprecation warnings for the APIs they use, but deprecation warnings triggered by imported application, library and framework modules will continue to be hidden by default.
pt_pt: O tratamento predefinido de :exc:`DeprecationWarning` foi alterado de forma a que estes avisos sejam novamente mostrados por defeito, mas apenas quando o código que os desencadeia está a ser executado diretamente no módulo :mod:`__main__`. Como resultado, os desenvolvedores de scripts de ficheiro único e aqueles que usam o Python de forma interativa devem voltar a ver avisos de obsolescência para as APIs que usam, mas os avisos de obsolescência desencadeados por módulos de aplicação, biblioteca e *framework* importados continuarão a ser ocultados por defeito.

source: As a result of this change, the standard library now allows developers to choose between three different deprecation warning behaviours:
pt_pt: Como resultado desta alteração, a biblioteca padrão agora permite aos desenvolvedores escolher entre três comportamentos diferentes de avisos de obsolescência:

source: :exc:`FutureWarning`: always displayed by default, recommended for warnings intended to be seen by application end users (e.g. for deprecated application configuration settings).
pt_pt: :exc:`FutureWarning`: sempre exibido por defeito, recomendado para avisos destinados a serem vistos pelos utilizadores finais da aplicação (por exemplo, para definições de configuração de aplicação obsoletas).

source: :exc:`DeprecationWarning`: displayed by default only in :mod:`__main__` and when running tests, recommended for warnings intended to be seen by other Python developers where a version upgrade may result in changed behaviour or an error.
pt_pt: :exc:`DeprecationWarning`: exibido por defeito apenas em :mod:`__main__` e ao executar testes, recomendado para avisos destinados a serem vistos por outros desenvolvedores Python onde uma atualização de versão pode resultar em comportamento alterado ou num erro.

source: :exc:`PendingDeprecationWarning`: displayed by default only when running tests, intended for cases where a future version upgrade will change the warning category to :exc:`DeprecationWarning` or :exc:`FutureWarning`.
pt_pt: :exc:`PendingDeprecationWarning`: exibido por defeito apenas ao executar testes, destinado a casos em que uma atualização de versão futura alterará a categoria de aviso para :exc:`DeprecationWarning` ou :exc:`FutureWarning`.

source: Previously both :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning` were only visible when running tests, which meant that developers primarily writing single file scripts or using Python interactively could be surprised by breaking changes in the APIs they used.
pt_pt: Anteriormente, tanto :exc:`DeprecationWarning` como :exc:`PendingDeprecationWarning` só eram visíveis ao executar testes, o que significava que os desenvolvedores que escreviam principalmente scripts de ficheiro único ou usavam o Python de forma interativa podiam ser surpreendidos por alterações de rutura nas APIs que usavam.

source: :pep:`565` -- Show DeprecationWarning in ``__main__``
pt_pt: :pep:`565` -- Mostrar DeprecationWarning em ``__main__``

source: PEP written and implemented by Nick Coghlan
pt_pt: PEP escrito e implementado por Nick Coghlan

source: PEP 560: Core Support for ``typing`` module and Generic Types
pt_pt: PEP 560: Suporte Central para o Módulo ``typing`` e Tipos Genéricos

source: :pep:`560` -- Core support for typing module and generic types
pt_pt: :pep:`560` -- Suporte central para o módulo typing e tipos genéricos

source: PEP 552: Hash-based .pyc Files
pt_pt: PEP 552: Ficheiros .pyc Baseados em Hash

source: Python has traditionally checked the up-to-dateness of bytecode cache files (i.e., ``.pyc`` files) by comparing the source metadata (last-modified timestamp and size) with source metadata saved in the cache file header when it was generated. While effective, this invalidation method has its drawbacks. When filesystem timestamps are too coarse, Python can miss source updates, leading to user confusion. Additionally, having a timestamp in the cache file is problematic for `build reproducibility <https://reproducible-builds.org/>`_ and content-based build systems.
pt_pt: Tradicionalmente, o Python verifica a atualidade dos ficheiros de cache de *bytecode* (ou seja, ficheiros ``.pyc``) comparando os metadados da origem (carimbo de data/hora da última modificação e tamanho) com os metadados da origem guardados no cabeçalho do ficheiro de cache quando este foi gerado. Embora eficaz, este método de invalidação tem as suas desvantagens. Quando os carimbos de data/hora do sistema de ficheiros são demasiado grosseiros, o Python pode perder atualizações da origem, levando à confusão do utilizador. Além disso, ter um carimbo de data/hora no ficheiro de cache é problemático para a `reprodutibilidade da compilação <https://reproducible-builds.org/>`_ e sistemas de compilação baseados em conteúdo.

source: :pep:`552` extends the pyc format to allow the hash of the source file to be used for invalidation instead of the source timestamp. Such ``.pyc`` files are called "hash-based". By default, Python still uses timestamp-based invalidation and does not generate hash-based ``.pyc`` files at runtime. Hash-based ``.pyc`` files may be generated with :mod:`py_compile` or :mod:`compileall`.
pt_pt: A :pep:`552` estende o formato pyc para permitir que o *hash* do ficheiro de origem seja usado para invalidação em vez do carimbo de data/hora da origem. Tais ficheiros ``.pyc`` são chamados "baseados em *hash*". Por defeito, o Python ainda usa invalidação baseada em carimbo de data/hora e não gera ficheiros ``.pyc`` baseados em *hash* em tempo de execução. Ficheiros ``.pyc`` baseados em *hash* podem ser gerados com :mod:`py_compile` ou :mod:`compileall`.

source: Hash-based ``.pyc`` files come in two variants: checked and unchecked. Python validates checked hash-based ``.pyc`` files against the corresponding source files at runtime but doesn't do so for unchecked hash-based pycs. Unchecked hash-based ``.pyc`` files are a useful performance optimization for environments where a system external to Python (e.g., the build system) is responsible for keeping ``.pyc`` files up-to-date.
pt_pt: Os ficheiros ``.pyc`` baseados em *hash* vêm em duas variantes: verificados e não verificados. O Python valida ficheiros ``.pyc`` baseados em *hash* verificados contra os ficheiros de origem correspondentes em tempo de execução, mas não o faz para ficheiros ``.pyc`` baseados em *hash* não verificados. Os ficheiros ``.pyc`` baseados em *hash* não verificados são uma otimização de desempenho útil para ambientes onde um sistema externo ao Python (por exemplo, o sistema de compilação) é responsável por manter os ficheiros ``.pyc`` atualizados.

source: See :ref:`pyc-invalidation` for more information.
pt_pt: Consulte :ref:`pyc-invalidation` para mais informações.

source: :pep:`552` -- Deterministic pycs
pt_pt: :pep:`552` -- Ficheiros pyc determinísticos

source: PEP written and implemented by Benjamin Peterson
pt_pt: PEP escrito e implementado por Benjamin Peterson

source: PEP 545: Python Documentation Translations
pt_pt: PEP 545: Traduções da Documentação do Python

source: :pep:`545` describes the process of creating and maintaining Python documentation translations.
pt_pt: A :pep:`545` descreve o processo de criação e manutenção de traduções da documentação do Python.

source: Three new translations have been added:
pt_pt: Foram adicionadas três novas traduções:

source: Japanese: https://docs.python.org/ja/
pt_pt: Japonês: https://docs.python.org/ja/

source: French: https://docs.python.org/fr/
pt_pt: Francês: https://docs.python.org/fr/

source: Korean: https://docs.python.org/ko/
pt_pt: Coreano: https://docs.python.org/ko/

source: :pep:`545` -- Python Documentation Translations
pt_pt: :pep:`545` -- Traduções da Documentação do Python

source: PEP written and implemented by Julien Palard, Inada Naoki, and Victor Stinner.
pt_pt: PEP escrito e implementado por Julien Palard, Inada Naoki e Victor Stinner.

source: Python Development Mode (-X dev)
pt_pt: Modo de Desenvolvimento do Python (-X dev)

source: The new :option:`-X` ``dev`` command line option or the new :envvar:`PYTHONDEVMODE` environment variable can be used to enable :ref:`Python Development Mode <devmode>`. When in development mode, Python performs additional runtime checks that are too expensive to be enabled by default. See :ref:`Python Development Mode <devmode>` documentation for the full description.
pt_pt: A nova opção de linha de comandos :option:`-X` ``dev`` ou a nova variável de ambiente :envvar:`PYTHONDEVMODE` podem ser usadas para ativar o :ref:`Modo de Desenvolvimento do Python <devmode>`. Quando no modo de desenvolvimento, o Python realiza verificações adicionais em tempo de execução que são demasiado dispendiosas para serem ativadas por defeito. Consulte a documentação do :ref:`Modo de Desenvolvimento do Python <devmode>` para uma descrição completa.

source: Other Language Changes
pt_pt: Outras Alterações à Linguagem

source: An :keyword:`await` expression and comprehensions containing an :keyword:`async for` clause were illegal in the expressions in :ref:`formatted string literals <f-strings>` due to a problem with the implementation. In Python 3.7 this restriction was lifted.
pt_pt: Uma expressão :keyword:`await` e compreensões contendo uma cláusula :keyword:`async for` eram ilegais nas expressões em :ref:`literais de cadeias de caracteres formatadas <f-strings>` devido a um problema com a implementação. No Python 3.7, esta restrição foi removida.

source: More than 255 arguments can now be passed to a function, and a function can now have more than 255 parameters. (Contributed by Serhiy Storchaka in :issue:`12844` and :issue:`18896`.)
pt_pt: Agora podem ser passados mais de 255 argumentos para uma função, e uma função pode agora ter mais de 255 parâmetros. (Contribuído por Serhiy Storchaka em :issue:`12844` e :issue:`18896`.)

source: :meth:`bytes.fromhex` and :meth:`bytearray.fromhex` now ignore all ASCII whitespace, not only spaces. (Contributed by Robert Xiao in :issue:`28927`.)
pt_pt: :meth:`bytes.fromhex` e :meth:`bytearray.fromhex` agora ignoram todo o espaço em branco ASCII, não apenas espaços. (Contribuído por Robert Xiao em :issue:`28927`.)

source: :class:`str`, :class:`bytes`, and :class:`bytearray` gained support for the new :meth:`isascii() <str.isascii>` method, which can be used to test if a string or bytes contain only the ASCII characters. (Contributed by INADA Naoki in :issue:`32677`.)
pt_pt: :class:`str`, :class:`bytes` e :class:`bytearray` ganharam suporte para o novo método :meth:`isascii() <str.isascii>`, que pode ser usado para testar se uma cadeia de caracteres ou bytes contém apenas caracteres ASCII. (Contribuído por INADA Naoki em :issue:`32677`.)

source: :exc:`ImportError` now displays module name and module ``__file__`` path when ``from ... import ...`` fails. (Contributed by Matthias Bussonnier in :issue:`29546`.)
pt_pt: :exc:`ImportError` agora mostra o nome do módulo e o caminho do ficheiro ``__file__`` do módulo quando ``from ... import ...`` falha. (Contribuído por Matthias Bussonnier em :issue:`29546`.)

source: Circular imports involving absolute imports with binding a submodule to a name are now supported. (Contributed by Serhiy Storchaka in :issue:`30024`.)
pt_pt: Importações circulares envolvendo importações absolutas com a ligação de um submódulo a um nome são agora suportadas. (Contribuído por Serhiy Storchaka em :issue:`30024`.)

source: ``object.__format__(x, '')`` is now equivalent to ``str(x)`` rather than ``format(str(self), '')``. (Contributed by Serhiy Storchaka in :issue:`28974`.)
pt_pt: ``object.__format__(x, '')`` é agora equivalente a ``str(x)`` em vez de ``format(str(self), '')``. (Contribuído por Serhiy Storchaka em :issue:`28974`.)

source: In order to better support dynamic creation of stack traces, :class:`types.TracebackType` can now be instantiated from Python code, and the :attr:`~traceback.tb_next` attribute on :ref:`tracebacks <traceback-objects>` is now writable. (Contributed by Nathaniel J. Smith in :issue:`30579`.)
pt_pt: Para melhor suportar a criação dinâmica de *stack traces*, :class:`types.TracebackType` pode agora ser instanciado a partir de código Python, e o atributo :attr:`~traceback.tb_next` em :ref:`tracebacks <traceback-objects>` é agora gravável. (Contribuído por Nathaniel J. Smith em :issue:`30579`.)

source: When using the :option:`-m` switch, ``sys.path[0]`` is now eagerly expanded to the full starting directory path, rather than being left as the empty directory (which allows imports from the *current* working directory at the time when an import occurs) (Contributed by Nick Coghlan in :issue:`33053`.)
pt_pt: Ao usar a opção :option:`-m`, ``sys.path[0]`` é agora expandido imediatamente para o caminho completo do diretório de início, em vez de ser deixado como o diretório vazio (o que permite importações do diretório de trabalho *atual* no momento em que uma importação ocorre). (Contribuído por Nick Coghlan em :issue:`33053`.)

source: The new :option:`-X` ``importtime`` option or the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable can be used to show the timing of each module import. (Contributed by Inada Naoki in :issue:`31415`.)
pt_pt: A nova opção :option:`-X` ``importtime`` ou a variável de ambiente :envvar:`PYTHONPROFILEIMPORTTIME` podem ser usadas para mostrar o tempo de cada importação de módulo. (Contribuído por Inada Naoki em :issue:`31415`.)

source: New Modules
pt_pt: Novos Módulos

source: The new :mod:`contextvars` module and a set of :ref:`new C APIs <contextvarsobjects>` introduce support for *context variables*. Context variables are conceptually similar to thread-local variables. Unlike TLS, context variables support asynchronous code correctly.
pt_pt: O novo módulo :mod:`contextvars` e um conjunto de :ref:`novas APIs C <contextvarsobjects>` introduzem suporte para *variáveis de contexto*. As variáveis de contexto são conceitualmente semelhantes a variáveis locais de *thread*. Ao contrário das TLS, as variáveis de contexto suportam corretamente código assíncrono.

source: The :mod:`asyncio` and :mod:`decimal` modules have been updated to use and support context variables out of the box. Particularly the active decimal context is now stored in a context variable, which allows decimal operations to work with the correct context in asynchronous code.
pt_pt: Os módulos :mod:`asyncio` e :mod:`decimal` foram atualizados para usar e suportar variáveis de contexto prontas a usar. Em particular, o contexto decimal ativo é agora armazenado numa variável de contexto, o que permite que as operações decimais funcionem com o contexto correto em código assíncrono.

source: :pep:`567` -- Context Variables
pt_pt: :pep:`567` -- Variáveis de Contexto

source: PEP written and implemented by Yury Selivanov
pt_pt: PEP escrito e implementado por Yury Selivanov

source: The new :func:`~dataclasses.dataclass` decorator provides a way to declare *data classes*. A data class describes its attributes using class variable annotations. Its constructor and other magic methods, such as :meth:`~object.__repr__`, :meth:`~object.__eq__`, and :meth:`~object.__hash__` are generated automatically.
pt_pt: O novo decorador :func:`~dataclasses.dataclass` fornece uma forma de declarar *classes de dados*. Uma classe de dados descreve os seus atributos usando anotações de variáveis de classe. O seu construtor e outros métodos mágicos, como :meth:`~object.__repr__`, :meth:`~object.__eq__` e :meth:`~object.__hash__` são gerados automaticamente.

source: Example::
pt_pt: Exemplo::

source: @dataclass class Point: x: float y: float z: float = 0.0 p = Point(1.5, 2.5) print(p) # produces "Point(x=1.5, y=2.5, z=0.0)"
pt_pt: @dataclass class Ponto: x: float y: float z: float = 0.0 p = Ponto(1.5, 2.5) print(p) # produz "Ponto(x=1.5, y=2.5, z=0.0)"

source: :pep:`557` -- Data Classes
pt_pt: :pep:`557` -- Classes de Dados

source: PEP written and implemented by Eric V. Smith
pt_pt: PEP escrito e implementado por Eric V. Smith

source: Contributed by Barry Warsaw and Brett Cannon in :issue:`32248`.
pt_pt: Contribuído por Barry Warsaw e Brett Cannon em :issue:`32248`.

source: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_ -- a PyPI backport for earlier Python versions.
pt_pt: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_ -- uma retroportagem PyPI para versões anteriores do Python.

source: Improved Modules
pt_pt: Módulos Melhorados

source: The new :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` method allows intermixing options and positional arguments. (Contributed by paul.j3 in :issue:`14191`.)
pt_pt: O novo método :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` permite a mistura de opções e argumentos posicionais. (Contribuído por paul.j3 em :issue:`14191`.)

source: The :mod:`asyncio` module has received many new features, usability and :ref:`performance improvements <whatsnew37-asyncio-perf>`. Notable changes include:
pt_pt: O módulo :mod:`asyncio` recebeu muitas novas funcionalidades, melhorias de usabilidade e :ref:`desempenho <whatsnew37-asyncio-perf>`. As alterações notáveis incluem:

source: The new :term:`provisional <provisional API>` :func:`asyncio.run` function can be used to run a coroutine from synchronous code by automatically creating and destroying the event loop. (Contributed by Yury Selivanov in :issue:`32314`.)
pt_pt: A nova função :term:`provisória <provisional API>` :func:`asyncio.run` pode ser usada para executar uma *coroutine* a partir de código síncrono, criando e destruindo automaticamente o ciclo de eventos. (Contribuído por Yury Selivanov em :issue:`32314`.)

source: asyncio gained support for :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop.call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>`, and :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` have a new optional keyword-only *context* parameter. :class:`Tasks <asyncio.Task>` now track their context automatically. See :pep:`567` for more details. (Contributed by Yury Selivanov in :issue:`32436`.)
pt_pt: O asyncio ganhou suporte para :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop.call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>`, e :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` têm um novo parâmetro opcional apenas por palavra-chave *context*. :class:`Tasks <asyncio.Task>` agora rastreiam automaticamente o seu contexto. Veja :pep:`567` para mais detalhes. (Contribuído por Yury Selivanov em :issue:`32436`.)

source: The new :func:`asyncio.create_task` function has been added as a shortcut to ``asyncio.get_event_loop().create_task()``. (Contributed by Andrew Svetlov in :issue:`32311`.)
pt_pt: Foi adicionada a nova função :func:`asyncio.create_task` como um atalho para ``asyncio.get_event_loop().create_task()``. (Contribuído por Andrew Svetlov em :issue:`32311`.)

source: The new :meth:`loop.start_tls() <asyncio.loop.start_tls>` method can be used to upgrade an existing connection to TLS. (Contributed by Yury Selivanov in :issue:`23749`.)
pt_pt: O novo método :meth:`loop.start_tls() <asyncio.loop.start_tls>` pode ser usado para atualizar uma ligação existente para TLS. (Contribuído por Yury Selivanov em :issue:`23749`.)

source: The new :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` method allows reading data from a socket directly into a provided buffer making it possible to reduce data copies. (Contributed by Antoine Pitrou in :issue:`31819`.)
pt_pt: O novo método :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` permite ler dados de um *socket* diretamente para um *buffer* fornecido, tornando possível reduzir cópias de dados. (Contribuído por Antoine Pitrou em :issue:`31819`.)

source: The new :func:`asyncio.current_task` function returns the currently running :class:`~asyncio.Task` instance, and the new :func:`asyncio.all_tasks` function returns a set of all existing ``Task`` instances in a given loop. The :meth:`!Task.current_task` and :meth:`!Task.all_tasks` methods have been deprecated. (Contributed by Andrew Svetlov in :issue:`32250`.)
pt_pt: A nova função :func:`asyncio.current_task` retorna a instância :class:`~asyncio.Task` atualmente em execução, e a nova função :func:`asyncio.all_tasks` retorna um conjunto de todas as instâncias ``Task`` existentes num ciclo dado. Os métodos :meth:`!Task.current_task` e :meth:`!Task.all_tasks` foram obsoletos. (Contribuído por Andrew Svetlov em :issue:`32250`.)

source: The new *provisional* :class:`~asyncio.BufferedProtocol` class allows implementing streaming protocols with manual control over the receive buffer. (Contributed by Yury Selivanov in :issue:`32251`.)
pt_pt: A nova classe :class:`~asyncio.BufferedProtocol` *provisória* permite implementar protocolos de *streaming* com controlo manual sobre o *buffer* de receção. (Contribuído por Yury Selivanov em :issue:`32251`.)

source: The new :func:`asyncio.get_running_loop` function returns the currently running loop, and raises a :exc:`RuntimeError` if no loop is running. This is in contrast with :func:`asyncio.get_event_loop`, which will *create* a new event loop if none is running. (Contributed by Yury Selivanov in :issue:`32269`.)
pt_pt: A nova função :func:`asyncio.get_running_loop` retorna o ciclo atualmente em execução e lança um :exc:`RuntimeError` se nenhum ciclo estiver em execução. Isto contrasta com :func:`asyncio.get_event_loop`, que *criará* um novo ciclo de eventos se nenhum estiver em execução. (Contribuído por Yury Selivanov em :issue:`32269`.)

source: The new :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` coroutine method allows waiting until the stream writer is closed. The new :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` method can be used to determine if the writer is closing. (Contributed by Andrew Svetlov in :issue:`32391`.)
pt_pt: O novo método de *coroutine* :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` permite aguardar até que o escritor de fluxo seja fechado. O novo método :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` pode ser usado para determinar se o escritor está a fechar. (Contribuído por Andrew Svetlov em :issue:`32391`.)

source: The new :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` coroutine method allows sending files using :mod:`os.sendfile` when possible. (Contributed by Andrew Svetlov in :issue:`32410`.)
pt_pt: O novo método de *coroutine* :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` permite enviar ficheiros usando :mod:`os.sendfile` quando possível. (Contribuído por Andrew Svetlov em :issue:`32410`.)
