Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: pt_pt

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
pt_pt: Os valores constantes das *flags* futuras no módulo :mod:`__future__` foram atualizados para evitar colisões com *flags* do compilador. Anteriormente, ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` estava em conflito com ``CO_FUTURE_DIVISION``. (Contribuído por Batuhan Taskaya em :issue:`39562`.)

source: ``array('u')`` now uses :c:type:`wchar_t` as C type instead of ``Py_UNICODE``. This change doesn't affect to its behavior because ``Py_UNICODE`` is alias of :c:type:`wchar_t` since Python 3.3. (Contributed by Inada Naoki in :issue:`34538`.)
pt_pt: ``array('u')`` agora usa :c:type:`wchar_t` como tipo C em vez de ``Py_UNICODE``. Esta alteração não afeta o seu comportamento, porque ``Py_UNICODE`` é um *alias* de :c:type:`wchar_t` desde o Python 3.3. (Contribuído por Inada Naoki em :issue:`34538`.)

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
pt_pt: A API :func:`logging.getLogger` agora devolve o *logger* raiz quando é passado o nome ``'root'``, enquanto anteriormente devolvia um *logger* não raiz com o nome ``'root'``. Isto pode afetar casos em que o código do utilizador pretende explicitamente um *logger* não raiz com o nome ``'root'``, ou instancia um *logger* usando ``logging.getLogger(__name__)`` num módulo de nível superior chamado ``'root.py'``. (Contribuído por Vinay Sajip em :issue:`37742`.)

source: Division handling of :class:`~pathlib.PurePath` now returns :data:`NotImplemented` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
pt_pt: O tratamento de divisão de :class:`~pathlib.PurePath` agora devolve :data:`NotImplemented` em vez de lançar um :exc:`TypeError` quando é passado algo que não seja uma instância de ``str`` ou :class:`~pathlib.PurePath`. Isto permite criar classes compatíveis que não herdam desses tipos mencionados. (Contribuído por Roger Aiudi em :issue:`34775`.)

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notatation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros. (Contributed by Christian Heimes in :issue:`36384`).
pt_pt: A partir do Python 3.9.5, o módulo :mod:`ipaddress` já não aceita zeros à esquerda em cadeias de caracteres de endereços IPv4. Zeros à esquerda são ambíguos e interpretados como notação octal por algumas bibliotecas. Por exemplo, a função legada :func:`socket.inet_aton` trata zeros à esquerda como notação octal. A implementação glibc da função moderna :func:`~socket.inet_pton` não aceita quaisquer zeros à esquerda. (Contribuído por Christian Heimes em :issue:`36384`.)

source: :func:`codecs.lookup` now normalizes the encoding name the same way as :func:`encodings.normalize_encoding`, except that :func:`codecs.lookup` also converts the name to lower case. For example, ``"latex+latin1"`` encoding name is now normalized to ``"latex_latin1"``. (Contributed by Jordon Xu in :issue:`37751`.)
pt_pt: :func:`codecs.lookup` agora normaliza o nome da codificação da mesma forma que :func:`encodings.normalize_encoding`, exceto que :func:`codecs.lookup` também converte o nome para minúsculas. Por exemplo, o nome da codificação ``"latex+latin1"`` é agora normalizado para ``"latex_latin1"``. (Contribuído por Jordon Xu em :issue:`37751`.)

source: Changes in the C API
pt_pt: Alterações na API C

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
pt_pt: Instâncias de :ref:`tipos alocados no *heap* <heap-types>` (como aquelas criadas com :c:func:`PyType_FromSpec` e APIs semelhantes) mantêm uma referência ao seu objeto de tipo desde o Python 3.8. Como indicado em "Alterações na API C" do Python 3.8, na maioria dos casos, não deve haver efeitos secundários, mas para tipos que têm uma função personalizada :c:member:`~PyTypeObject.tp_traverse`, certifique-se de que todas as funções personalizadas ``tp_traverse`` de tipos alocados no *heap* visitam o tipo do objeto.

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
pt_pt: Se a sua função *traverse* delega para ``tp_traverse`` da sua classe base (ou outro tipo), certifique-se de que ``Py_TYPE(self)`` é visitado apenas uma vez. Note que apenas :ref:`tipos alocados no *heap* <heap-types>` são esperados para visitar o tipo em ``tp_traverse``.

source: For example, if your ``tp_traverse`` function includes:
pt_pt: Por exemplo, se a sua função ``tp_traverse`` incluir:

source: then add:
pt_pt: então adicione:

source: (See :issue:`35810` and :issue:`40217` for more information.)
pt_pt: (Veja :issue:`35810` e :issue:`40217` para mais informações.)

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
pt_pt: As funções ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` e ``PyEval_CallObjectWithKeywords`` estão obsoletas. Use :c:func:`PyObject_Call` e as suas variantes em vez disso. (Veja mais detalhes em :issue:`29548`.)

source: CPython bytecode changes
pt_pt: Alterações no bytecode do CPython

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
pt_pt: O *opcode* :opcode:`COMPARE_OP` foi dividido em quatro instruções distintas:

source: ``COMPARE_OP`` for rich comparisons
pt_pt: ``COMPARE_OP`` para comparações ricas

source: ``IS_OP`` for 'is' and 'is not' tests
pt_pt: ``IS_OP`` para testes 'is' e 'is not'

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
pt_pt: ``CONTAINS_OP`` para testes 'in' e 'not in'

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
pt_pt: ``JUMP_IF_NOT_EXC_MATCH`` para verificar exceções em instruções 'try-except'.

source: (Contributed by Mark Shannon in :issue:`39156`.)
pt_pt: (Contribuído por Mark Shannon em :issue:`39156`.)

source: Build Changes
pt_pt: Alterações na Compilação

source: Added ``--with-platlibdir`` option to the ``configure`` script: name of the platform-specific library directory, stored in the new :data:`sys.platlibdir` attribute. See :data:`sys.platlibdir` attribute for more information. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
pt_pt: Adicionada a opção ``--with-platlibdir`` ao *script* ``configure``: nome do diretório de bibliotecas específico da plataforma, armazenado no novo atributo :data:`sys.platlibdir`. Veja o atributo :data:`sys.platlibdir` para mais informações. (Contribuído por Jan Matějek, Matěj Cepl, Charalampos Stratakis e Victor Stinner em :issue:`1294959`.)

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
pt_pt: A macro de compilação especial ``COUNT_ALLOCS`` foi removida. (Contribuído por Victor Stinner em :issue:`39489`.)

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
pt_pt: Em plataformas não-Windows, a criação de instaladores ``bdist_wininst`` já não é oficialmente suportada. (Veja :issue:`10945` para mais detalhes.)

source: When building Python on macOS from source, ``_tkinter`` now links with non-system Tcl and Tk frameworks if they are installed in ``/Library/Frameworks``, as had been the case on older releases of macOS. If a macOS SDK is explicitly configured, by using :option:`--enable-universalsdk` or ``-isysroot``, only the SDK itself is searched. The default behavior can still be overridden with ``--with-tcltk-includes`` and ``--with-tcltk-libs``. (Contributed by Ned Deily in :issue:`34956`.)
pt_pt: Ao compilar o Python no macOS a partir do código-fonte, ``_tkinter`` agora liga com *frameworks* Tcl e Tk não-sistema se estiverem instalados em ``/Library/Frameworks``, como era o caso em versões mais antigas do macOS. Se um SDK do macOS for explicitamente configurado, usando :option:`--enable-universalsdk` ou ``-isysroot``, apenas o SDK é pesquisado. O comportamento predefinido ainda pode ser substituído com ``--with-tcltk-includes`` e ``--with-tcltk-libs``. (Contribuído por Ned Deily em :issue:`34956`.)

source: Python can now be built for Windows 10 ARM64. (Contributed by Steve Dower in :issue:`33125`.)
pt_pt: O Python agora pode ser compilado para Windows 10 ARM64. (Contribuído por Steve Dower em :issue:`33125`.)

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
pt_pt: Alguns testes individuais são agora ignorados quando ``--pgo`` é usado. Os testes em questão aumentavam significativamente o tempo da tarefa PGO e provavelmente não ajudavam a melhorar a otimização do executável final. Isto acelera a tarefa por um fator de cerca de 15x. Executar a suíte completa de testes unitários é lento. Esta alteração pode resultar numa compilação ligeiramente menos otimizada, uma vez que menos ramos de código serão executados. Se estiver disposto a esperar pela compilação muito mais lenta, o comportamento antigo pode ser restaurado usando ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. Não garantimos qual conjunto de tarefas PGO produz uma compilação mais rápida. Os utilizadores que se importam devem executar os seus próprios *benchmarks* relevantes, uma vez que os resultados podem depender do ambiente, carga de trabalho e cadeia de ferramentas do compilador. (Veja :issue:`36044` e :issue:`37707` para mais detalhes.)

source: C API Changes
pt_pt: Alterações na API C

source: :pep:`573`: Added :c:func:`PyType_FromModuleAndSpec` to associate a module with a class; :c:func:`PyType_GetModule` and :c:func:`PyType_GetModuleState` to retrieve the module and its state; and :c:type:`PyCMethod` and :c:macro:`METH_METHOD` to allow a method to access the class it was defined in. (Contributed by Marcel Plch and Petr Viktorin in :issue:`38787`.)
pt_pt: :pep:`573`: Adicionada :c:func:`PyType_FromModuleAndSpec` para associar um módulo a uma classe; :c:func:`PyType_GetModule` e :c:func:`PyType_GetModuleState` para recuperar o módulo e o seu estado; e :c:type:`PyCMethod` e :c:macro:`METH_METHOD` para permitir que um método aceda à classe em que foi definido. (Contribuído por Marcel Plch e Petr Viktorin em :issue:`38787`.)

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
pt_pt: Adicionada a função :c:func:`PyFrame_GetCode`: obtém o código de um *frame*. Adicionada a função :c:func:`PyFrame_GetBack`: obtém o *frame* exterior seguinte. (Contribuído por Victor Stinner em :issue:`40421`.)

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
pt_pt: Adicionada :c:func:`PyFrame_GetLineNumber` à API C limitada. (Contribuído por Victor Stinner em :issue:`40421`.)

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
pt_pt: Adicionadas as funções :c:func:`PyThreadState_GetInterpreter` e :c:func:`PyInterpreterState_Get` para obter o interpretador. Adicionada a função :c:func:`PyThreadState_GetFrame` para obter o *frame* atual de um estado de *thread* do Python. Adicionada a função :c:func:`PyThreadState_GetID`: obtém o identificador único de um estado de *thread* do Python. (Contribuído por Victor Stinner em :issue:`39947`.)

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
pt_pt: Adicionada uma nova função pública :c:func:`PyObject_CallNoArgs` à API C, que chama um objeto Python invocável sem quaisquer argumentos. É a forma mais eficiente de chamar um objeto Python invocável sem argumentos. (Contribuído por Victor Stinner em :issue:`37194`.)

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
pt_pt: Alterações na API C limitada (se a macro ``Py_LIMITED_API`` estiver definida):

source: Provide :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` as regular functions for the limited API. Previously, there were defined as macros, but these macros didn't compile with the limited C API which cannot access ``PyThreadState.recursion_depth`` field (the structure is opaque in the limited C API).
pt_pt: Disponibilizadas :c:func:`Py_EnterRecursiveCall` e :c:func:`Py_LeaveRecursiveCall` como funções regulares para a API limitada. Anteriormente, estavam definidas como macros, mas estes macros não compilavam com a API C limitada, que não pode aceder ao campo ``PyThreadState.recursion_depth`` (a estrutura é opaca na API C limitada).

source: ``PyObject_INIT()`` and ``PyObject_INIT_VAR()`` become regular "opaque" function to hide implementation details.
pt_pt: ``PyObject_INIT()`` e ``PyObject_INIT_VAR()`` tornaram-se funções "opacas" regulares para ocultar detalhes de implementação.

source: (Contributed by Victor Stinner in :issue:`38644` and :issue:`39542`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`38644` e :issue:`39542`.)

source: The :c:func:`PyModule_AddType` function is added to help adding a type to a module. (Contributed by Donghee Na in :issue:`40024`.)
pt_pt: Adicionada a função :c:func:`PyModule_AddType` para ajudar a adicionar um tipo a um módulo. (Contribuído por Donghee Na em :issue:`40024`.)

source: Added the functions :c:func:`PyObject_GC_IsTracked` and :c:func:`PyObject_GC_IsFinalized` to the public API to allow to query if Python objects are being currently tracked or have been already finalized by the garbage collector respectively. (Contributed by Pablo Galindo Salgado in :issue:`40241`.)
pt_pt: Adicionadas as funções :c:func:`PyObject_GC_IsTracked` e :c:func:`PyObject_GC_IsFinalized` à API pública para permitir verificar se objetos Python estão atualmente a ser rastreados ou se já foram finalizados pelo recolhedor de lixo, respetivamente. (Contribuído por Pablo Galindo Salgado em :issue:`40241`.)

source: Added :c:func:`PyObject_CallOneArg` for calling an object with one positional argument (Patch by Jeroen Demeyer in :issue:`37483`.)
pt_pt: Adicionada :c:func:`PyObject_CallOneArg` para chamar um objeto com um argumento posicional. (Patch de Jeroen Demeyer em :issue:`37483`.)

source: ``PyInterpreterState.eval_frame`` (:pep:`523`) now requires a new mandatory *tstate* parameter (``PyThreadState*``). (Contributed by Victor Stinner in :issue:`38500`.)
pt_pt: ``PyInterpreterState.eval_frame`` (:pep:`523`) agora requer um novo parâmetro obrigatório *tstate* (``PyThreadState*``). (Contribuído por Victor Stinner em :issue:`38500`.)

source: Extension modules: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef` are no longer called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, these functions are not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
pt_pt: Módulos de extensão: as funções :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` e :c:member:`~PyModuleDef.m_free` de :c:type:`PyModuleDef` já não são chamadas se o estado do módulo foi solicitado, mas ainda não foi alocado. Isto acontece imediatamente após a criação do módulo e antes da execução do módulo (função :c:data:`Py_mod_exec`). Mais precisamente, estas funções não são chamadas se :c:member:`~PyModuleDef.m_size` for maior que 0 e o estado do módulo (como devolvido por :c:func:`PyModule_GetState`) for ``NULL``.

source: Extension modules without module state (``m_size <= 0``) are not affected.
pt_pt: Módulos de extensão sem estado de módulo (``m_size <= 0``) não são afetados.

source: If :c:func:`Py_AddPendingCall` is called in a subinterpreter, the function is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls. (Contributed by Victor Stinner in :issue:`39984`.)
pt_pt: Se :c:func:`Py_AddPendingCall` for chamada num subinterpretador, a função agora é agendada para ser chamada a partir do subinterpretador, em vez de ser chamada a partir do interpretador principal. Cada subinterpretador agora tem a sua própria lista de chamadas agendadas. (Contribuído por Victor Stinner em :issue:`39984`.)

source: The Windows registry is no longer used to initialize :data:`sys.path` when the ``-E`` option is used (if :c:member:`PyConfig.use_environment` is set to ``0``). This is significant when embedding Python on Windows. (Contributed by Zackery Spytz in :issue:`8901`.)
pt_pt: O registo do Windows já não é usado para inicializar :data:`sys.path` quando a opção ``-E`` é usada (se :c:member:`PyConfig.use_environment` estiver definida para ``0``). Isto é significativo ao incorporar o Python no Windows. (Contribuído por Zackery Spytz em :issue:`8901`.)

source: The global variable :c:data:`PyStructSequence_UnnamedField` is now a constant and refers to a constant string. (Contributed by Serhiy Storchaka in :issue:`38650`.)
pt_pt: A variável global :c:data:`PyStructSequence_UnnamedField` é agora uma constante e refere-se a uma cadeia de caracteres constante. (Contribuído por Serhiy Storchaka em :issue:`38650`.)

source: The ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, and :c:func:`!PyUnicode_AsUnicodeAndSize` are marked as deprecated in C. They have been deprecated by :pep:`393` since Python 3.3. (Contributed by Inada Naoki in :issue:`36346`.)
pt_pt: ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode`` e :c:func:`!PyUnicode_AsUnicodeAndSize` estão marcados como obsoletos em C. Foram descontinuados pela :pep:`393` desde o Python 3.3. (Contribuído por Inada Naoki em :issue:`36346`.)

source: The :c:func:`Py_FatalError` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined. (Contributed by Victor Stinner in :issue:`39882`.)
pt_pt: A função :c:func:`Py_FatalError` foi substituída por uma macro que regista automaticamente o nome da função atual, a menos que a macro ``Py_LIMITED_API`` esteja definida. (Contribuído por Victor Stinner em :issue:`39882`.)

source: The vectorcall protocol now requires that the caller passes only strings as keyword names. (See :issue:`37540` for more information.)
pt_pt: O protocolo *vectorcall* agora requer que o chamador passe apenas cadeias de caracteres como nomes de argumentos nomeados. (Veja :issue:`37540` para mais informações.)

source: Implementation details of a number of macros and functions are now hidden:
pt_pt: Detalhes de implementação de várias macros e funções estão agora ocultos:

source: :c:func:`PyObject_IS_GC` macro was converted to a function.
pt_pt: A macro :c:func:`PyObject_IS_GC` foi convertida numa função.

source: :c:func:`PyObject_CheckBuffer` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_as_buffer` member.
pt_pt: A macro :c:func:`PyObject_CheckBuffer` foi convertida numa função: a macro acedia diretamente ao membro :c:member:`PyTypeObject.tp_as_buffer`.

source: :c:func:`PyIndex_Check` is now always declared as an opaque function to hide implementation details: removed the ``PyIndex_Check()`` macro. The macro accessed directly the :c:member:`PyTypeObject.tp_as_number` member.
pt_pt: :c:func:`PyIndex_Check` é agora sempre declarada como uma função opaca para ocultar detalhes de implementação: removida a macro ``PyIndex_Check()``. A macro acedia diretamente ao membro :c:member:`PyTypeObject.tp_as_number`.

source: (See :issue:`40170` for more details.)
pt_pt: (Veja :issue:`40170` para mais detalhes.)

source: Excluded ``PyFPE_START_PROTECT()`` and ``PyFPE_END_PROTECT()`` macros of ``pyfpe.h`` from the limited C API. (Contributed by Victor Stinner in :issue:`38835`.)
pt_pt: Excluídas as macros ``PyFPE_START_PROTECT()`` e ``PyFPE_END_PROTECT()`` de ``pyfpe.h`` da API C limitada. (Contribuído por Victor Stinner em :issue:`38835`.)

source: The ``tp_print`` slot of :ref:`PyTypeObject <type-structs>` has been removed. It was used for printing objects to files in Python 2.7 and before. Since Python 3.0, it has been ignored and unused. (Contributed by Jeroen Demeyer in :issue:`36974`.)
pt_pt: O *slot* ``tp_print`` de :ref:`PyTypeObject <type-structs>` foi removido. Era usado para imprimir objetos para ficheiros no Python 2.7 e versões anteriores. Desde o Python 3.0, tem sido ignorado e não utilizado. (Contribuído por Jeroen Demeyer em :issue:`36974`.)

source: Excluded the following functions from the limited C API:
pt_pt: Excluídas as seguintes funções da API C limitada:
