Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: pt_pt

source: Unlike the ``:=`` operator this idiom does not leak a variable to the outer scope.
pt_pt: Ao contrário do operador ``:=``, este idioma não expõe uma variável para o âmbito exterior.

source: (Contributed by Serhiy Storchaka in :issue:`32856`.)
pt_pt: (Contribuído por Serhiy Storchaka em :issue:`32856`.)

source: Optimized signal handling in multithreaded applications. If a thread different than the main thread gets a signal, the bytecode evaluation loop is no longer interrupted at each bytecode instruction to check for pending signals which cannot be handled. Only the main thread of the main interpreter can handle signals.
pt_pt: Otimizado o tratamento de sinais em aplicações multithread. Se uma *thread* diferente da *thread* principal receber um sinal, o ciclo de avaliação de *bytecode* já não é interrompido em cada instrução de *bytecode* para verificar sinais pendentes que não podem ser tratados. Apenas a *thread* principal do interpretador principal pode tratar sinais.

source: Previously, the bytecode evaluation loop was interrupted at each instruction until the main thread handles signals. (Contributed by Victor Stinner in :issue:`40010`.)
pt_pt: Anteriormente, o ciclo de avaliação de *bytecode* era interrompido em cada instrução até que a *thread* principal tratasse os sinais. (Contribuído por Victor Stinner em :issue:`40010`.)

source: Optimized the :mod:`subprocess` module on FreeBSD using ``closefrom()``. (Contributed by Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak and Victor Stinner in :issue:`38061`.)
pt_pt: Otimizado o módulo :mod:`subprocess` no FreeBSD usando ``closefrom()``. (Contribuído por Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak e Victor Stinner em :issue:`38061`.)

source: :c:func:`PyLong_FromDouble` is now up to 1.87x faster for values that fit into :c:expr:`long`. (Contributed by Sergey Fedoseev in :issue:`37986`.)
pt_pt: :c:func:`PyLong_FromDouble` é agora até 1,87x mais rápido para valores que cabem em :c:expr:`long`. (Contribuído por Sergey Fedoseev em :issue:`37986`.)

source: A number of Python builtins (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) are now sped up by using :pep:`590` vectorcall protocol. (Contributed by Donghee Na, Mark Shannon, Jeroen Demeyer and Petr Viktorin in :issue:`37207`.)
pt_pt: Várias funcionalidades integradas do Python (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) são agora aceleradas usando o protocolo :pep:`590` *vectorcall*. (Contribuído por Donghee Na, Mark Shannon, Jeroen Demeyer e Petr Viktorin em :issue:`37207`.)

source: Python's small object allocator (``obmalloc.c``) now allows (no more than) one empty arena to remain available for immediate reuse, without returning it to the OS. This prevents thrashing in simple loops where an arena could be created and destroyed anew on each iteration. (Contributed by Tim Peters in :issue:`37257`.)
pt_pt: O alocador de pequenos objetos do Python (``obmalloc.c``) agora permite que (no máximo) uma arena vazia permaneça disponível para reutilização imediata, sem a devolver ao sistema operativo. Isto evita *thrashing* em ciclos simples onde uma arena poderia ser criada e destruída em cada iteração. (Contribuído por Tim Peters em :issue:`37257`.)

source: :term:`floor division` of float operation now has a better performance. Also the message of :exc:`ZeroDivisionError` for this operation is updated. (Contributed by Donghee Na in :issue:`39434`.)
pt_pt: A :term:`divisão inteira` de operações com *floats* tem agora um melhor desempenho. Também foi atualizada a mensagem de :exc:`ZeroDivisionError` para esta operação. (Contribuído por Donghee Na em :issue:`39434`.)

source: Decoding short ASCII strings with UTF-8 and ascii codecs is now about 15% faster. (Contributed by Inada Naoki in :issue:`37348`.)
pt_pt: A descodificação de cadeias de caracteres ASCII curtas com *codecs* UTF-8 e ASCII é agora cerca de 15% mais rápida. (Contribuído por Inada Naoki em :issue:`37348`.)

source: Here's a summary of performance improvements from Python 3.4 through Python 3.9:
pt_pt: Aqui está um resumo das melhorias de desempenho do Python 3.4 ao Python 3.9:

source: These results were generated from the variable access benchmark script at: ``Tools/scripts/var_access_benchmark.py``. The benchmark script displays timings in nanoseconds. The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/macos/>`_.
pt_pt: Estes resultados foram gerados a partir do *script* de *benchmark* de acesso a variáveis em: ``Tools/scripts/var_access_benchmark.py``. O *script* de *benchmark* apresenta os tempos em nanosegundos. Os *benchmarks* foram medidos num processador `Intel® Core™ i7-4960HQ <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ a executar as compilações de 64 bits para macOS disponíveis em `python.org <https://www.python.org/downloads/macos/>`_.

source: Deprecated
pt_pt: Obsoleto

source: The distutils ``bdist_msi`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`39586`.)
pt_pt: O comando ``bdist_msi`` do *distutils* está agora obsoleto; use ``bdist_wheel`` (pacotes *wheel*) em vez disso. (Contribuído por Hugo van Kemenade em :issue:`39586`.)

source: Currently :func:`math.factorial` accepts :class:`float` instances with non-negative integer values (like ``5.0``). It raises a :exc:`ValueError` for non-integral and negative floats. It is now deprecated. In future Python versions it will raise a :exc:`TypeError` for all floats. (Contributed by Serhiy Storchaka in :issue:`37315`.)
pt_pt: Atualmente, :func:`math.factorial` aceita instâncias de :class:`float` com valores inteiros não negativos (como ``5.0``). Lança um :exc:`ValueError` para *floats* não inteiros e negativos. Está agora obsoleto. Em versões futuras do Python, lançará um :exc:`TypeError` para todos os *floats*. (Contribuído por Serhiy Storchaka em :issue:`37315`.)

source: The Public C API functions :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` and :c:func:`!PyNode_Compile` are deprecated and will be removed in Python 3.10 together with the old parser.
pt_pt: As funções da API C pública :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` e :c:func:`!PyNode_Compile` estão obsoletas e serão removidas no Python 3.10, juntamente com o antigo *parser*.

source: Using :data:`NotImplemented` in a boolean context has been deprecated, as it is almost exclusively the result of incorrect rich comparator implementations. It will be made a :exc:`TypeError` in a future version of Python. (Contributed by Josh Rosenberg in :issue:`35712`.)
pt_pt: O uso de :data:`NotImplemented` num contexto booleano está obsoleto, uma vez que é quase exclusivamente o resultado de implementações incorretas de comparadores ricos. Será convertido num :exc:`TypeError` numa versão futura do Python. (Contribuído por Josh Rosenberg em :issue:`35712`.)

source: The :mod:`random` module currently accepts any hashable type as a possible seed value. Unfortunately, some of those types are not guaranteed to have a deterministic hash value. After Python 3.9, the module will restrict its seeds to :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, and :class:`bytearray`.
pt_pt: O módulo :mod:`random` atualmente aceita qualquer tipo *hashable* como valor de semente. Infelizmente, alguns desses tipos não têm garantia de ter um valor de *hash* determinístico. Após o Python 3.9, o módulo restringirá as suas sementes a :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` e :class:`bytearray`.

source: Opening the :class:`~gzip.GzipFile` file for writing without specifying the *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* argument for opening it for writing and silencing a warning. (Contributed by Serhiy Storchaka in :issue:`28286`.)
pt_pt: Abrir o ficheiro :class:`~gzip.GzipFile` para escrita sem especificar o argumento *mode* está obsoleto. Em versões futuras do Python, será sempre aberto para leitura por predefinição. Especifique o argumento *mode* para o abrir para escrita e silenciar um aviso. (Contribuído por Serhiy Storchaka em :issue:`28286`.)

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov and Kyle Stanley in :issue:`34790`.)
pt_pt: A passagem explícita de objetos de *coroutine* para :func:`asyncio.wait` está obsoleta e será removida na versão 3.11. (Contribuído por Yury Selivanov e Kyle Stanley em :issue:`34790`.)

source: (Contributed by Victor Stinner in :issue:`39353`.)
pt_pt: (Contribuído por Victor Stinner em :issue:`39353`.)

source: :mod:`ast` classes ``slice``, ``Index`` and ``ExtSlice`` are considered deprecated and will be removed in future Python versions. ``value`` itself should be used instead of ``Index(value)``. ``Tuple(slices, Load())`` should be used instead of ``ExtSlice(slices)``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
pt_pt: As classes :mod:`ast` ``slice``, ``Index`` e ``ExtSlice`` estão obsoletas e serão removidas em versões futuras do Python. ``value`` deve ser usado em vez de ``Index(value)``. ``Tuple(slices, Load())`` deve ser usado em vez de ``ExtSlice(slices)``. (Contribuído por Serhiy Storchaka em :issue:`34822`.)

source: :mod:`ast` classes ``Suite``, ``Param``, ``AugLoad`` and ``AugStore`` are considered deprecated and will be removed in future Python versions. They were not generated by the parser and not accepted by the code generator in Python 3. (Contributed by Batuhan Taskaya in :issue:`39639` and :issue:`39969` and Serhiy Storchaka in :issue:`39988`.)
pt_pt: As classes :mod:`ast` ``Suite``, ``Param``, ``AugLoad`` e ``AugStore`` estão obsoletas e serão removidas em versões futuras do Python. Não eram geradas pelo *parser* nem aceites pelo gerador de código no Python 3. (Contribuído por Batuhan Taskaya em :issue:`39639` e :issue:`39969` e Serhiy Storchaka em :issue:`39988`.)

source: The :c:func:`!PyEval_InitThreads` and :c:func:`!PyEval_ThreadsInitialized` functions are now deprecated and will be removed in Python 3.11. Calling :c:func:`!PyEval_InitThreads` now does nothing. The :term:`GIL` is initialized by :c:func:`Py_Initialize` since Python 3.7. (Contributed by Victor Stinner in :issue:`39877`.)
pt_pt: As funções :c:func:`!PyEval_InitThreads` e :c:func:`!PyEval_ThreadsInitialized` estão agora obsoletas e serão removidas no Python 3.11. Chamar :c:func:`!PyEval_InitThreads` agora não faz nada. O :term:`GIL` é inicializado por :c:func:`Py_Initialize` desde o Python 3.7. (Contribuído por Victor Stinner em :issue:`39877`.)

source: Passing ``None`` as the first argument to the :func:`shlex.split` function has been deprecated. (Contributed by Zackery Spytz in :issue:`33262`.)
pt_pt: Passar ``None`` como primeiro argumento para a função :func:`shlex.split` está obsoleto. (Contribuído por Zackery Spytz em :issue:`33262`.)

source: The *random* parameter of :func:`random.shuffle` has been deprecated. (Contributed by Raymond Hettinger in :issue:`40465`)
pt_pt: O parâmetro *random* de :func:`random.shuffle` está obsoleto. (Contribuído por Raymond Hettinger em :issue:`40465`)

source: Removed
pt_pt: Removido

source: :class:`array.array`: ``tostring()`` and ``fromstring()`` methods have been removed. They were aliases to ``tobytes()`` and ``frombytes()``, deprecated since Python 3.2. (Contributed by Victor Stinner in :issue:`38916`.)
pt_pt: Os métodos ``tostring()`` e ``fromstring()`` de :class:`array.array` foram removidos. Eram *aliases* para ``tobytes()`` e ``frombytes()``, obsoletos desde o Python 3.2. (Contribuído por Victor Stinner em :issue:`38916`.)

source: The undocumented ``sys.callstats()`` function has been removed. Since Python 3.7, it was deprecated and always returned :const:`None`. It required a special build option ``CALL_PROFILE`` which was already removed in Python 3.7. (Contributed by Victor Stinner in :issue:`37414`.)
pt_pt: A função não documentada ``sys.callstats()`` foi removida. Desde o Python 3.7, estava obsoleta e sempre devolvia :const:`None`. Requer uma opção de compilação especial ``CALL_PROFILE``, que já tinha sido removida no Python 3.7. (Contribuído por Victor Stinner em :issue:`37414`.)

source: The ``sys.getcheckinterval()`` and ``sys.setcheckinterval()`` functions have been removed. They were deprecated since Python 3.2. Use :func:`sys.getswitchinterval` and :func:`sys.setswitchinterval` instead. (Contributed by Victor Stinner in :issue:`37392`.)
pt_pt: As funções ``sys.getcheckinterval()`` e ``sys.setcheckinterval()`` foram removidas. Estavam obsoletas desde o Python 3.2. Use :func:`sys.getswitchinterval` e :func:`sys.setswitchinterval` em vez disso. (Contribuído por Victor Stinner em :issue:`37392`.)

source: The C function ``PyImport_Cleanup()`` has been removed. It was documented as: "Empty the module table. For internal use only." (Contributed by Victor Stinner in :issue:`36710`.)
pt_pt: A função C ``PyImport_Cleanup()`` foi removida. Estava documentada como: "Esvaziar a tabela de módulos. Apenas para uso interno." (Contribuído por Victor Stinner em :issue:`36710`.)

source: ``_dummy_thread`` and ``dummy_threading`` modules have been removed. These modules were deprecated since Python 3.7 which requires threading support. (Contributed by Victor Stinner in :issue:`37312`.)
pt_pt: Os módulos ``_dummy_thread`` e ``dummy_threading`` foram removidos. Estes módulos estavam obsoletos desde o Python 3.7, que requer suporte para *threading*. (Contribuído por Victor Stinner em :issue:`37312`.)

source: Methods ``getchildren()`` and ``getiterator()`` of classes :class:`~xml.etree.ElementTree.ElementTree` and :class:`~xml.etree.ElementTree.Element` in the :mod:`~xml.etree.ElementTree` module have been removed. They were deprecated in Python 3.2. Use ``iter(x)`` or ``list(x)`` instead of ``x.getchildren()`` and ``x.iter()`` or ``list(x.iter())`` instead of ``x.getiterator()``. (Contributed by Serhiy Storchaka in :issue:`36543`.)
pt_pt: Os métodos ``getchildren()`` e ``getiterator()`` das classes :class:`~xml.etree.ElementTree.ElementTree` e :class:`~xml.etree.ElementTree.Element` no módulo :mod:`~xml.etree.ElementTree` foram removidos. Estavam obsoletos desde o Python 3.2. Use ``iter(x)`` ou ``list(x)`` em vez de ``x.getchildren()`` e ``x.iter()`` ou ``list(x.iter())`` em vez de ``x.getiterator()``. (Contribuído por Serhiy Storchaka em :issue:`36543`.)

source: The old :mod:`plistlib` API has been removed, it was deprecated since Python 3.4. Use the :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump`, and :func:`~plistlib.dumps` functions. Additionally, the *use_builtin_types* parameter was removed, standard :class:`bytes` objects are always used instead. (Contributed by Jon Janzen in :issue:`36409`.)
pt_pt: A antiga API do módulo :mod:`plistlib` foi removida; estava obsoleta desde o Python 3.4. Use as funções :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump` e :func:`~plistlib.dumps`. Além disso, o parâmetro *use_builtin_types* foi removido; objetos :class:`bytes` padrão são sempre usados em vez disso. (Contribuído por Jon Janzen em :issue:`36409`.)

source: The C function ``PyGen_NeedsFinalizing`` has been removed. It was not documented, tested, or used anywhere within CPython after the implementation of :pep:`442`. Patch by Joannah Nanjekye. (Contributed by Joannah Nanjekye in :issue:`15088`)
pt_pt: A função C ``PyGen_NeedsFinalizing`` foi removida. Não estava documentada, testada ou usada em qualquer parte do CPython após a implementação da :pep:`442`. *Patch* de Joannah Nanjekye. (Contribuído por Joannah Nanjekye em :issue:`15088`)

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
pt_pt: As funções ``base64.encodestring()`` e ``base64.decodestring()``, *aliases* obsoletos desde o Python 3.1, foram removidas; use :func:`base64.encodebytes` e :func:`base64.decodebytes` em vez disso. (Contribuído por Victor Stinner em :issue:`39351`.)

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
pt_pt: A função ``fractions.gcd()`` foi removida; estava obsoleta desde o Python 3.5 (:issue:`22486`); use :func:`math.gcd` em vez disso. (Contribuído por Victor Stinner em :issue:`39350`.)

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
pt_pt: O parâmetro *buffering* de :class:`bz2.BZ2File` foi removido. Desde o Python 3.0, era ignorado e o seu uso emitia um :exc:`DeprecationWarning`. Passe um objeto de ficheiro aberto para controlar como o ficheiro é aberto. (Contribuído por Victor Stinner em :issue:`39357`.)

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
pt_pt: O parâmetro *encoding* de :func:`json.loads` foi removido. Desde o Python 3.1, estava obsoleto e era ignorado; o seu uso emitia um :exc:`DeprecationWarning` desde o Python 3.8. (Contribuído por Inada Naoki em :issue:`39377`)

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
pt_pt: As instruções ``with (await asyncio.lock):`` e ``with (yield from asyncio.lock):`` já não são suportadas; use ``async with lock`` em vez disso. O mesmo aplica-se a ``asyncio.Condition`` e ``asyncio.Semaphore``. (Contribuído por Andrew Svetlov em :issue:`34793`.)

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
pt_pt: O atributo ``_field_types`` da classe :class:`typing.NamedTuple` foi removido. Estava obsoleto desde o Python 3.8. Use o atributo ``__annotations__`` em vez disso. (Contribuído por Serhiy Storchaka em :issue:`40182`.)

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
pt_pt: O método ``unescape()`` da classe :class:`html.parser.HTMLParser` foi removido (estava obsoleto desde o Python 3.4). Deve ser usada :func:`html.unescape` para converter referências de caracteres nos caracteres Unicode correspondentes.

source: Porting to Python 3.9
pt_pt: Portar para o Python 3.9

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_pt: Esta secção lista alterações previamente descritas e outras correções de erros que podem exigir alterações no seu código.

source: Changes in the Python API
pt_pt: Alterações na API do Python

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
pt_pt: As funções :func:`__import__` e :func:`importlib.util.resolve_name` agora lançam :exc:`ImportError` onde anteriormente lançavam :exc:`ValueError`. Os chamadores que capturam o tipo de exceção específico e suportam tanto o Python 3.9 como versões anteriores precisarão de capturar ambos usando ``except (ImportError, ValueError):``.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
pt_pt: Os *scripts* de ativação de :mod:`venv` já não tratam como caso especial quando ``__VENV_PROMPT__`` está definido como ``""``.

source: The :meth:`select.epoll.unregister` method no longer ignores the :const:`~errno.EBADF` error. (Contributed by Victor Stinner in :issue:`39239`.)
pt_pt: O método :meth:`select.epoll.unregister` já não ignora o erro :const:`~errno.EBADF`. (Contribuído por Victor Stinner em :issue:`39239`.)

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
pt_pt: O parâmetro *compresslevel* de :class:`bz2.BZ2File` passou a ser apenas por palavra-chave, uma vez que o parâmetro *buffering* foi removido. (Contribuído por Victor Stinner em :issue:`39357`.)

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
pt_pt: AST simplificado para subscrição. Índices simples serão representados pelo seu valor; *slices* estendidos serão representados como tuplos. ``Index(value)`` devolverá o próprio ``value``; ``ExtSlice(slices)`` devolverá ``Tuple(slices, Load())``. (Contribuído por Serhiy Storchaka em :issue:`34822`.)

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
pt_pt: O módulo :mod:`importlib` agora ignora a variável de ambiente :envvar:`PYTHONCASEOK` quando as opções de linha de comandos :option:`-E` ou :option:`-I` estão a ser usadas.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
pt_pt: O parâmetro *encoding* foi adicionado às classes :class:`ftplib.FTP` e :class:`ftplib.FTP_TLS` como um parâmetro apenas por palavra-chave, e a codificação predefinida foi alterada de Latin-1 para UTF-8, para seguir a :rfc:`2640`.

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
pt_pt: O método :meth:`asyncio.loop.shutdown_default_executor` foi adicionado a :class:`~asyncio.AbstractEventLoop`, o que significa que ciclos de eventos alternativos que herdam dele devem ter este método definido. (Contribuído por Kyle Stanley em :issue:`34037`.)
