Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: pt_pt

source: What's New In Python 3.9
pt_pt: Novidades no Python 3.9

source: This article explains the new features in Python 3.9, compared to 3.8. Python 3.9 was released on October 5, 2020. For full details, see the :ref:`changelog <changelog>`.
pt_pt: Este artigo explica as novas funcionalidades do Python 3.9, em comparação com a versão 3.8. O Python 3.9 foi lançado a 5 de outubro de 2020. Para detalhes completos, consulte o :ref:`registo de alterações <changelog>`.

source: :pep:`596` - Python 3.9 Release Schedule
pt_pt: :pep:`596` — Calendário de Lançamento do Python 3.9

source: Summary -- Release highlights
pt_pt: Resumo — Destaques da versão

source: New syntax features:
pt_pt: Novas funcionalidades de sintaxe:

source: :pep:`584`, union operators added to ``dict``;
pt_pt: :pep:`584`, operadores de união adicionados a ``dict``;

source: :pep:`585`, type hinting generics in standard collections;
pt_pt: :pep:`585`, *type hints* genéricos em coleções padrão;

source: :pep:`614`, relaxed grammar restrictions on decorators.
pt_pt: :pep:`614`, restrições gramaticais relaxadas em decoradores.

source: New built-in features:
pt_pt: Novas funcionalidades integradas:

source: :pep:`616`, string methods to remove prefixes and suffixes.
pt_pt: :pep:`616`, métodos de cadeias de caracteres para remover prefixos e sufixos.

source: New features in the standard library:
pt_pt: Novas funcionalidades na biblioteca padrão:

source: :pep:`593`, flexible function and variable annotations;
pt_pt: :pep:`593`, anotações flexíveis de funções e variáveis;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
pt_pt: Adicionada :func:`os.pidfd_open`, que permite a gestão de processos sem condições de corrida ou sinais.

source: Interpreter improvements:
pt_pt: Melhorias no interpretador:

source: :pep:`573`, fast access to module state from methods of C extension types;
pt_pt: :pep:`573`, acesso rápido ao estado do módulo a partir de métodos de tipos de extensão em C;

source: :pep:`617`, CPython now uses a new parser based on PEG;
pt_pt: :pep:`617`, o CPython agora usa um novo *parser* baseado em PEG;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
pt_pt: várias funcionalidades integradas do Python (range, tuple, set, frozenset, list, dict) são agora aceleradas usando :pep:`590` *vectorcall*;

source: garbage collection does not block on resurrected objects;
pt_pt: a recolha de lixo já não bloqueia em objetos ressuscitados;

source: New library modules:
pt_pt: Novos módulos de biblioteca:

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
pt_pt: :pep:`615`, a Base de Dados de Fusos Horários IANA está agora presente na biblioteca padrão no módulo :mod:`zoneinfo`;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
pt_pt: uma implementação de ordenação topológica de um grafo está agora disponível no novo módulo :mod:`graphlib`.

source: Release process changes:
pt_pt: Alterações no processo de lançamento:

source: :pep:`602`, CPython adopts an annual release cycle.
pt_pt: :pep:`602`, o CPython adota um ciclo de lançamento anual.

source: You should check for DeprecationWarning in your code
pt_pt: Deve verificar a presença de DeprecationWarning no seu código

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
pt_pt: Quando o Python 2.7 ainda era suportado, muitas funcionalidades no Python 3 eram mantidas para compatibilidade retroativa com o Python 2.7. Com o fim do suporte ao Python 2, estas camadas de compatibilidade retroativa foram removidas, ou serão removidas em breve. A maioria delas emitia um aviso :exc:`DeprecationWarning` durante vários anos. Por exemplo, usar ``collections.Mapping`` em vez de ``collections.abc.Mapping`` emite um :exc:`DeprecationWarning` desde o Python 3.3, lançado em 2012.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
pt_pt: Teste a sua aplicação com a opção de linha de comandos :option:`-W` ``default`` para ver :exc:`DeprecationWarning` e :exc:`PendingDeprecationWarning`, ou até com :option:`-W` ``error`` para tratá-los como erros. O :ref:`Filtro de Avisos <warning-filter>` pode ser usado para ignorar avisos de código de terceiros.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
pt_pt: O Python 3.9 é a última versão a fornecer essas camadas de compatibilidade retroativa com o Python 2, para dar mais tempo aos mantenedores de projetos Python para organizarem a remoção do suporte ao Python 2 e adicionarem suporte ao Python 3.9.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
pt_pt: Os *aliases* para :ref:`Classes Base Abstratas <collections-abstract-base-classes>` no módulo :mod:`collections`, como o *alias* ``collections.Mapping`` para :class:`collections.abc.Mapping`, são mantidos por uma última versão para compatibilidade retroativa. Serão removidos no Python 3.10.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
pt_pt: De um modo geral, tente executar os seus testes no :ref:`Modo de Desenvolvimento do Python <devmode>`, que ajuda a preparar o seu código para torná-lo compatível com a próxima versão do Python.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
pt_pt: Nota: várias descontinuações pré-existentes foram removidas nesta versão do Python. Consulte a secção :ref:`removed-in-python-39`.

source: New Features
pt_pt: Novas Funcionalidades

source: Dictionary Merge & Update Operators
pt_pt: Operadores de Fusão e Atualização de Dicionários

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
pt_pt: Os operadores de fusão (``|``) e atualização (``|=``) foram adicionados à classe integrada :class:`dict`. Estes complementam os métodos existentes ``dict.update`` e ``{**d1, **d2}`` de fusão de dicionários.

source: Example::
pt_pt: Exemplo::

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
pt_pt: Consulte :pep:`584` para uma descrição completa. (Contribuído por Brandt Bucher em :issue:`36144`.)

source: New String Methods to Remove Prefixes and Suffixes
pt_pt: Novos Métodos de Cadeias de Caracteres para Remover Prefixos e Sufixos

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
pt_pt: Os métodos :meth:`str.removeprefix(prefix)<str.removeprefix>` e :meth:`str.removesuffix(suffix)<str.removesuffix>` foram adicionados para remover facilmente um prefixo ou sufixo desnecessário de uma cadeia de caracteres. Métodos correspondentes para ``bytes``, ``bytearray`` e ``collections.UserString`` também foram adicionados. Consulte :pep:`616` para uma descrição completa. (Contribuído por Dennis Sweeney em :issue:`39939`.)

source: Type Hinting Generics in Standard Collections
pt_pt: Type Hints Genéricos em Coleções Padrão

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
pt_pt: Nas anotações de tipo, pode agora usar tipos de coleção integrados, como ``list`` e ``dict``, como tipos genéricos, em vez de importar os tipos correspondentes com maiúsculas (por exemplo, ``List`` ou ``Dict``) de ``typing``. Outros tipos na biblioteca padrão também são agora genéricos, por exemplo, ``queue.Queue``.

source: Example:
pt_pt: Exemplo:

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
pt_pt: Consulte :pep:`585` para mais detalhes. (Contribuído por Guido van Rossum, Ethan Smith e Batuhan Taşkaya em :issue:`39481`.)

source: New Parser
pt_pt: Novo *Parser*

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
pt_pt: O Python 3.9 usa um novo *parser*, baseado em `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ em vez de `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. O desempenho do novo *parser* é aproximadamente comparável ao do antigo, mas o formalismo PEG é mais flexível do que o LL(1) no que diz respeito ao desenho de novas funcionalidades da linguagem. Vamos começar a usar esta flexibilidade no Python 3.10 e posteriores.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
pt_pt: O módulo :mod:`ast` usa o novo *parser* e produz a mesma AST que o antigo *parser*.

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
pt_pt: Consulte :pep:`617` para mais detalhes. (Contribuído por Guido van Rossum, Pablo Galindo e Lysandros Nikolaou em :issue:`40334`.)

source: Other Language Changes
pt_pt: Outras Alterações à Linguagem

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
pt_pt: A função :func:`__import__` agora lança :exc:`ImportError` em vez de :exc:`ValueError`, que ocorria quando uma importação relativa ia além do seu pacote de nível superior. (Contribuído por Ngalim Siregar em :issue:`37444`.)

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
pt_pt: O Python agora obtém o caminho absoluto do nome do *script* especificado na linha de comandos (ex: ``python3 script.py``): o atributo ``__file__`` do módulo :mod:`__main__` passou a ser um caminho absoluto, em vez de um caminho relativo. Estes caminhos permanecem válidos após a alteração do diretório atual por :func:`os.chdir`. Como efeito secundário, o *traceback* também apresenta o caminho absoluto para os *frames* do módulo :mod:`__main__` neste caso. (Contribuído por Victor Stinner em :issue:`20443`.)

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
pt_pt: No :ref:`Modo de Desenvolvimento do Python <devmode>` e em :ref:`compilações de depuração <debug-build>`, os argumentos *encoding* e *errors* são agora verificados para operações de codificação e descodificação de cadeias de caracteres. Exemplos: :func:`open`, :meth:`str.encode` e :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
pt_pt: Por predefinição, para melhor desempenho, o argumento *errors* é apenas verificado no primeiro erro de codificação/descodificação e o argumento *encoding* é por vezes ignorado para cadeias de caracteres vazias. (Contribuído por Victor Stinner em :issue:`37388`.)

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
pt_pt: ``"".replace("", s, n)`` agora devolve ``s`` em vez de uma cadeia de caracteres vazia para todos os valores não nulos de ``n``. Agora é consistente com ``"".replace("", s)``. Existem alterações semelhantes para objetos :class:`bytes` e :class:`bytearray`. (Contribuído por Serhiy Storchaka em :issue:`28029`.)

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
pt_pt: Qualquer expressão válida pode agora ser usada como um :term:`decorador`. Anteriormente, a gramática era muito mais restritiva. Consulte :pep:`614` para detalhes. (Contribuído por Brandt Bucher em :issue:`39702`.)

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
pt_pt: Melhorada a ajuda para o módulo :mod:`typing`. As *docstrings* são agora apresentadas para todas as formas especiais e *aliases* genéricos especiais (como ``Union`` e ``List``). Usar :func:`help` com um *alias* genérico como ``List[int]`` mostrará a ajuda para o tipo concreto correspondente (``list`` neste caso). (Contribuído por Serhiy Storchaka em :issue:`40257`.)

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
pt_pt: A execução paralela de :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` está agora proibida, e ``ag_running`` reflete agora o estado de execução real do gerador assíncrono. (Contribuído por Yury Selivanov em :issue:`30773`.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
pt_pt: Erros inesperados ao chamar o método ``__iter__`` já não são mascarados por ``TypeError`` no operador :keyword:`in` e nas funções :func:`~operator.contains`, :func:`~operator.indexOf` e :func:`~operator.countOf` do módulo :mod:`operator`. (Contribuído por Serhiy Storchaka em :issue:`40824`.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
pt_pt: Expressões lambda não parentizadas já não podem ser a parte da expressão numa cláusula ``if`` em *comprehensions* e expressões de gerador. Consulte :issue:`41848` e :issue:`43755` para detalhes.

source: New Modules
pt_pt: Novos Módulos

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
pt_pt: O módulo :mod:`zoneinfo` traz suporte para a base de dados de fusos horários IANA à biblioteca padrão. Adiciona :class:`zoneinfo.ZoneInfo`, uma implementação concreta de :class:`datetime.tzinfo` suportada pelos dados de fuso horário do sistema.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
pt_pt: :pep:`615` — Suporte para a Base de Dados de Fusos Horários IANA na Biblioteca Padrão

source: PEP written and implemented by Paul Ganssle
pt_pt: PEP escrito e implementado por Paul Ganssle

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
pt_pt: Um novo módulo, :mod:`graphlib`, foi adicionado e contém a classe :class:`graphlib.TopologicalSorter`, que oferece funcionalidade para realizar ordenação topológica de grafos. (Contribuído por Pablo Galindo, Tim Peters e Larry Hastings em :issue:`17005`.)

source: Improved Modules
pt_pt: Módulos Melhorados

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
pt_pt: Adicionada a opção *indent* a :func:`~ast.dump`, que permite produzir uma saída indentada em várias linhas. (Contribuído por Serhiy Storchaka em :issue:`37995`.)

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
pt_pt: Adicionada :func:`ast.unparse` como função no módulo :mod:`ast`, que pode ser usada para converter um objeto :class:`ast.AST` e produzir uma cadeia de caracteres com código que, quando analisado, produziria um objeto :class:`ast.AST` equivalente. (Contribuído por Pablo Galindo e Batuhan Taskaya em :issue:`38870`.)

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
pt_pt: Adicionadas *docstrings* aos nós AST que contêm a assinatura ASDL usada para construir esse nó. (Contribuído por Batuhan Taskaya em :issue:`39638`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
pt_pt: Devido a preocupações significativas de segurança, o parâmetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` já não é suportado. Isto deve-se ao comportamento da opção de *socket* ``SO_REUSEADDR`` em UDP. Para mais detalhes, veja a documentação de ``loop.create_datagram_endpoint()``. (Contribuído por Kyle Stanley, Antoine Pitrou e Yury Selivanov em :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
pt_pt: Adicionada uma nova :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor`, que agenda o encerramento do executor predefinido e aguarda que o :class:`~concurrent.futures.ThreadPoolExecutor` termine o encerramento. Além disso, :func:`asyncio.run` foi atualizada para usar a nova :term:`coroutine`. (Contribuído por Kyle Stanley em :issue:`34037`.)

source: Added a new :term:`coroutine` :func:`asyncio.to_thread`. It is mainly used for running IO-bound functions in a separate thread to avoid blocking the event loop, and essentially works as a high-level version of :meth:`~asyncio.loop.run_in_executor` that can directly take keyword arguments. (Contributed by Kyle Stanley and Yury Selivanov in :issue:`32309`.)
pt_pt: Adicionada uma nova :term:`coroutine` :func:`asyncio.to_thread`. É usada principalmente para executar funções limitadas por E/S numa *thread* separada, evitando bloquear o ciclo de eventos, e funciona essencialmente como uma versão de alto nível de :meth:`~asyncio.loop.run_in_executor`, que pode aceitar diretamente argumentos nomeados. (Contribuído por Kyle Stanley e Yury Selivanov em :issue:`32309`.)

source: When cancelling the task due to a timeout, :meth:`asyncio.wait_for` will now wait until the cancellation is complete also in the case when *timeout* is <= 0, like it does with positive timeouts. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
pt_pt: Ao cancelar a tarefa devido a um *timeout*, :meth:`asyncio.wait_for` agora aguardará até que o cancelamento esteja completo, mesmo quando *timeout* é <= 0, tal como faz com *timeouts* positivos. (Contribuído por Elvis Pranskevichus em :issue:`32751`.)

source: Added new possibility to use hardlinks for duplicated ``.pyc`` files: *hardlink_dupes* parameter and --hardlink-dupes command line option. (Contributed by Lumír 'Frenzy' Balhar in :issue:`40495`.)
pt_pt: Adicionada nova possibilidade de usar *hardlinks* para ficheiros ``.pyc`` duplicados: parâmetro *hardlink_dupes* e opção de linha de comandos --hardlink-dupes. (Contribuído por Lumír 'Frenzy' Balhar em :issue:`40495`.)

source: Added new options for path manipulation in resulting ``.pyc`` files: *stripdir*, *prependdir*, *limit_sl_dest* parameters and -s, -p, -e command line options. Added the possibility to specify the option for an optimization level multiple times. (Contributed by Lumír 'Frenzy' Balhar in :issue:`38112`.)
pt_pt: Adicionadas novas opções para manipulação de caminhos em ficheiros ``.pyc`` resultantes: parâmetros *stripdir*, *prependdir*, *limit_sl_dest* e opções de linha de comandos -s, -p, -e. Adicionada a possibilidade de especificar a opção para um nível de otimização várias vezes. (Contribuído por Lumír 'Frenzy' Balhar em :issue:`38112`.)
