Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: pt_pt

source: ``PyThreadState_DeleteCurrent()`` (Contributed by Joannah Nanjekye in :issue:`37878`.)
pt_pt: ``PyThreadState_DeleteCurrent()`` (Contribuído por Joannah Nanjekye em :issue:`37878`.)

source: The trashcan mechanism which never worked in the limited C API.
pt_pt: O mecanismo *trashcan*, que nunca funcionou na API C limitada.

source: Moved following functions and definitions to the internal C API:
pt_pt: Movidas as seguintes funções e definições para a API C interna:

source: ``_Py_AddToAllObjects()`` (specific to ``Py_TRACE_REFS`` build)
pt_pt: ``_Py_AddToAllObjects()`` (específico para compilações ``Py_TRACE_REFS``)

source: Removed ``_PyRuntime.getframe`` hook and removed ``_PyThreadState_GetFrame`` macro which was an alias to ``_PyRuntime.getframe``. They were only exposed by the internal C API. Removed also ``PyThreadFrameGetter`` type. (Contributed by Victor Stinner in :issue:`39946`.)
pt_pt: Removido o *hook* ``_PyRuntime.getframe`` e removida a macro ``_PyThreadState_GetFrame``, que era um *alias* para ``_PyRuntime.getframe``. Estavam apenas expostos pela API C interna. Também removido o tipo ``PyThreadFrameGetter``. (Contribuído por Victor Stinner em :issue:`39946`.)

source: Removed the following functions from the C API. Call :c:func:`PyGC_Collect` explicitly to clear all free lists. (Contributed by Inada Naoki and Victor Stinner in :issue:`37340`, :issue:`38896` and :issue:`40428`.)
pt_pt: Removidas as seguintes funções da API C. Chame :c:func:`PyGC_Collect` explicitamente para limpar todas as listas livres. (Contribuído por Inada Naoki e Victor Stinner em :issue:`37340`, :issue:`38896` e :issue:`40428`.)

source: ``PyMethod_ClearFreeList()`` and ``PyCFunction_ClearFreeList()``: the free lists of bound method objects have been removed.
pt_pt: ``PyMethod_ClearFreeList()`` e ``PyCFunction_ClearFreeList()``: as listas livres de objetos de métodos ligados foram removidas.

source: ``PySet_ClearFreeList()``: the set free list has been removed in Python 3.4.
pt_pt: ``PySet_ClearFreeList()``: a lista livre de conjuntos foi removida no Python 3.4.

source: ``PyUnicode_ClearFreeList()``: the Unicode free list has been removed in Python 3.3.
pt_pt: ``PyUnicode_ClearFreeList()``: a lista livre de Unicode foi removida no Python 3.3.

source: Removed ``_PyUnicode_ClearStaticStrings()`` function. (Contributed by Victor Stinner in :issue:`39465`.)
pt_pt: Removida a função ``_PyUnicode_ClearStaticStrings()``. (Contribuído por Victor Stinner em :issue:`39465`.)

source: Removed ``Py_UNICODE_MATCH``. It has been deprecated by :pep:`393`, and broken since Python 3.3. The :c:func:`PyUnicode_Tailmatch` function can be used instead. (Contributed by Inada Naoki in :issue:`36346`.)
pt_pt: Removido ``Py_UNICODE_MATCH``. Foi descontinuado pela :pep:`393` e estava quebrado desde o Python 3.3. A função :c:func:`PyUnicode_Tailmatch` pode ser usada em vez disso. (Contribuído por Inada Naoki em :issue:`36346`.)

source: Cleaned header files of interfaces defined but with no implementation. The public API symbols being removed are: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contributed by Pablo Galindo Salgado in :issue:`39372`.)
pt_pt: Limpos os ficheiros de cabeçalho de interfaces definidas, mas sem implementação. Os símbolos da API pública que estão a ser removidos são: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contribuído por Pablo Galindo Salgado em :issue:`39372`.)

source: Notable changes in Python 3.9.1
pt_pt: Alterações notáveis no Python 3.9.1

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
pt_pt: O comportamento de :class:`typing.Literal` foi alterado para estar em conformidade com :pep:`586` e para corresponder ao comportamento dos verificadores de tipo estático especificados na PEP.

source: ``Literal`` now de-duplicates parameters.
pt_pt: ``Literal`` agora remove parâmetros duplicados.

source: Equality comparisons between ``Literal`` objects are now order independent.
pt_pt: As comparações de igualdade entre objetos ``Literal`` são agora independentes da ordem.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
pt_pt: As comparações ``Literal`` agora respeitam tipos. Por exemplo, ``Literal[0] == Literal[False]`` avaliava anteriormente para ``True``. Agora é ``False``. Para suportar esta alteração, a cache de tipos usada internamente agora suporta a diferenciação de tipos.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with mutable parameters will not throw an error::
pt_pt: Os objetos ``Literal`` agora lançarão uma exceção :exc:`TypeError` durante comparações de igualdade se algum dos seus parâmetros não for :term:`hashable`. Note que declarar ``Literal`` com parâmetros mutáveis não lançará um erro:

source: (Contributed by Yurii Karabas in :issue:`42345`.)
pt_pt: (Contribuído por Yurii Karabas em :issue:`42345`.)

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
pt_pt: Suporte para macOS 11.0 (Big Sur) e Mac com Apple Silicon

source: As of 3.9.1, Python now fully supports building and running on macOS 11.0 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Binaries can also now be built on current versions of macOS to be deployed on a range of older macOS versions (tested to 10.9) while making some newer OS functions and options conditionally available based on the operating system version in use at runtime ("weaklinking").
pt_pt: A partir da versão 3.9.1, o Python agora suporta totalmente a compilação e execução no macOS 11.0 (Big Sur) e em Macs com Apple Silicon (baseados na arquitetura ``ARM64``). Uma nova variante de compilação universal, ``universal2``, está agora disponível para suportar nativamente tanto ``ARM64`` como ``Intel 64`` num único conjunto de executáveis. Os binários também podem agora ser compilados em versões atuais do macOS para serem implementados numa gama de versões mais antigas do macOS (testado até 10.9), enquanto algumas funções e opções mais recentes do sistema operativo estão condicionalmente disponíveis com base na versão do sistema operativo em uso em tempo de execução ("weaklinking").

source: (Contributed by Ronald Oussoren and Lawrence D'Anna in :issue:`41100`.)
pt_pt: (Contribuído por Ronald Oussoren e Lawrence D'Anna em :issue:`41100`.)

source: Notable changes in Python 3.9.2
pt_pt: Alterações notáveis no Python 3.9.2

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. A :exc:`DeprecationWarning` may be emitted for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9.1. This :exc:`DeprecationWarning` will become a :exc:`TypeError` in Python 3.10. (Contributed by Ken Jin in :issue:`42195`.)
pt_pt: O genérico :class:`collections.abc.Callable` agora achata os parâmetros de tipo, semelhante ao que :data:`typing.Callable` faz atualmente. Isto significa que ``collections.abc.Callable[[int, str], str]`` terá ``__args__`` de ``(int, str, str)``; anteriormente, isto era ``([int, str], str)``. Para permitir esta alteração, :class:`types.GenericAlias` pode agora ser subclassificado, e uma subclasse será devolvida ao subscrever o tipo :class:`collections.abc.Callable`. O código que acede aos argumentos através de :func:`typing.get_args` ou ``__args__`` precisa de ter em conta esta alteração. Um :exc:`DeprecationWarning` pode ser emitido para formas inválidas de parametrização de :class:`collections.abc.Callable`, que podem ter passado silenciosamente no Python 3.9.1. Este :exc:`DeprecationWarning` tornar-se-á um :exc:`TypeError` no Python 3.10. (Contribuído por Ken Jin em :issue:`42195`.)

source: Notable changes in Python 3.9.3
pt_pt: Alterações notáveis no Python 3.9.3

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
pt_pt: Uma correção de segurança altera o comportamento de :class:`ftplib.FTP` para não confiar no endereço IPv4 enviado pelo servidor remoto ao configurar um canal de dados passivo. Em vez disso, reutilizamos o endereço IP do servidor FTP. Para código incomum que exija o comportamento antigo, defina um atributo ``trust_server_pasv_ipv4_address`` na sua instância FTP para ``True``. (Veja :gh:`87451`)

source: Notable changes in Python 3.9.5
pt_pt: Alterações notáveis no Python 3.9.5

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
pt_pt: A presença de caracteres de nova linha ou tabulação em partes de um URL permite algumas formas de ataques. Seguindo a especificação WHATWG que atualiza :rfc:`3986`, os caracteres ASCII de nova linha ``\n``, ``\r`` e tabulação ``\t`` são removidos do URL pelo analisador em :mod:`urllib.parse`, prevenindo tais ataques. Os caracteres de remoção são controlados por uma nova variável a nível de módulo ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Veja :gh:`88048`)

source: Notable security feature in 3.9.14
pt_pt: Funcionalidade de segurança notável na versão 3.9.14

source: Notable changes in 3.9.17
pt_pt: Alterações notáveis na versão 3.9.17

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
pt_pt: Os métodos de extração em :mod:`tarfile` e :func:`shutil.unpack_archive` têm um novo argumento *filter* que permite limitar funcionalidades tar que podem ser surpreendentes ou perigosas, como criar ficheiros fora do diretório de destino. Consulte :ref:`tarfile-extraction-filter` para mais detalhes. No Python 3.12, o uso sem o argumento *filter* mostrará um :exc:`DeprecationWarning`. No Python 3.14, o predefinido mudará para ``'data'``. (Contribuído por Petr Viktorin em :pep:`706`.)
