Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: pt_pt

source: Added a new *cancel_futures* parameter to :meth:`concurrent.futures.Executor.shutdown` that cancels all pending futures which have not started running, instead of waiting for them to complete before shutting down the executor. (Contributed by Kyle Stanley in :issue:`39349`.)
pt_pt: Adicionado um novo parâmetro *cancel_futures* a :meth:`concurrent.futures.Executor.shutdown`, que cancela todos os *futures* pendentes que ainda não começaram a executar, em vez de aguardar que sejam concluídos antes de encerrar o executor. (Contribuído por Kyle Stanley em :issue:`39349`.)

source: Removed daemon threads from :class:`~concurrent.futures.ThreadPoolExecutor` and :class:`~concurrent.futures.ProcessPoolExecutor`. This improves compatibility with subinterpreters and predictability in their shutdown processes. (Contributed by Kyle Stanley in :issue:`39812`.)
pt_pt: Removidas *threads* *daemon* de :class:`~concurrent.futures.ThreadPoolExecutor` e :class:`~concurrent.futures.ProcessPoolExecutor`. Isto melhora a compatibilidade com subinterpretadores e a previsibilidade nos seus processos de encerramento. (Contribuído por Kyle Stanley em :issue:`39812`.)

source: Workers in :class:`~concurrent.futures.ProcessPoolExecutor` are now spawned on demand, only when there are no available idle workers to reuse. This optimizes startup overhead and reduces the amount of lost CPU time to idle workers. (Contributed by Kyle Stanley in :issue:`39207`.)
pt_pt: Os *workers* em :class:`~concurrent.futures.ProcessPoolExecutor` são agora criados sob demanda, apenas quando não há *workers* ociosos disponíveis para reutilizar. Isto otimiza a sobrecarga de inicialização e reduz a quantidade de tempo de CPU perdido em *workers* ociosos. (Contribuído por Kyle Stanley em :issue:`39207`.)

source: Added :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, and :func:`curses.set_tabsize` functions. (Contributed by Anthony Sottile in :issue:`38312`.)
pt_pt: Adicionadas as funções :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize` e :func:`curses.set_tabsize`. (Contribuído por Anthony Sottile em :issue:`38312`.)

source: The :command:`upload` command now creates SHA2-256 and Blake2b-256 hash digests. It skips MD5 on platforms that block MD5 digest. (Contributed by Christian Heimes in :issue:`40698`.)
pt_pt: O comando :command:`upload` agora cria *hashes* SHA2-256 e Blake2b-256. Ignora MD5 em plataformas que bloqueiam o *digest* MD5. (Contribuído por Christian Heimes em :issue:`40698`.)

source: :class:`~ftplib.FTP` and :class:`~ftplib.FTP_TLS` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
pt_pt: As classes :class:`~ftplib.FTP` e :class:`~ftplib.FTP_TLS` agora lançam um :class:`ValueError` se o *timeout* fornecido para o seu construtor for zero, para evitar a criação de um *socket* não bloqueante. (Contribuído por Donghee Na em :issue:`39259`.)

source: When the garbage collector makes a collection in which some objects resurrect (they are reachable from outside the isolated cycles after the finalizers have been executed), do not block the collection of all objects that are still unreachable. (Contributed by Pablo Galindo and Tim Peters in :issue:`38379`.)
pt_pt: Quando o recolhedor de lixo faz uma recolha na qual alguns objetos ressuscitam (ou seja, tornam-se acessíveis a partir de fora dos ciclos isolados após a execução dos finalizadores), não bloqueie a recolha de todos os objetos que ainda estão inacessíveis. (Contribuído por Pablo Galindo e Tim Peters em :issue:`38379`.)

source: Added a new function :func:`gc.is_finalized` to check if an object has been finalized by the garbage collector. (Contributed by Pablo Galindo in :issue:`39322`.)
pt_pt: Adicionada uma nova função :func:`gc.is_finalized` para verificar se um objeto foi finalizado pelo recolhedor de lixo. (Contribuído por Pablo Galindo em :issue:`39322`.)

source: The :mod:`hashlib` module can now use SHA3 hashes and SHAKE XOF from OpenSSL when available. (Contributed by Christian Heimes in :issue:`37630`.)
pt_pt: O módulo :mod:`hashlib` agora pode usar *hashes* SHA3 e SHAKE XOF do OpenSSL, quando disponíveis. (Contribuído por Christian Heimes em :issue:`37630`.)

source: Builtin hash modules can now be disabled with ``./configure --without-builtin-hashlib-hashes`` or selectively enabled with e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` to force use of OpenSSL based implementation. (Contributed by Christian Heimes in :issue:`40479`)
pt_pt: Os módulos de *hash* integrados podem agora ser desativados com ``./configure --without-builtin-hashlib-hashes`` ou ativados seletivamente com, por exemplo, ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` para forçar o uso da implementação baseada no OpenSSL. (Contribuído por Christian Heimes em :issue:`40479`)

source: HTTP status codes ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` and ``425 TOO_EARLY`` are added to :class:`http.HTTPStatus`. (Contributed by Donghee Na in :issue:`39509` and Ross Rhodes in :issue:`39507`.)
pt_pt: Os códigos de estado HTTP ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` e ``425 TOO_EARLY`` foram adicionados a :class:`http.HTTPStatus`. (Contribuído por Donghee Na em :issue:`39509` e Ross Rhodes em :issue:`39507`.)

source: IDLE and idlelib
pt_pt: IDLE e idlelib

source: Added option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
pt_pt: Adicionada opção para desativar o piscar do cursor. (Contribuído por Zackery Spytz em :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
pt_pt: A tecla Escape agora fecha as janelas de conclusão do IDLE. (Contribuído por Johnny Najera em :issue:`38944`.)

source: Added keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
pt_pt: Adicionadas palavras-chave à lista de conclusão de nomes de módulos. (Contribuído por Terry J. Reedy em :issue:`37765`.)

source: New in 3.9 maintenance releases
pt_pt: Novo nas versões de manutenção do 3.9

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
pt_pt: Fazer com que o IDLE invoque :func:`sys.excepthook` (quando iniciado sem '-n'). Os ganchos do utilizador eram anteriormente ignorados. (Contribuído por Ken Hilton em :issue:`43008`.)

source: The changes above have been backported to 3.8 maintenance releases.
pt_pt: As alterações acima foram retroportadas para as versões de manutenção do 3.8.

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
pt_pt: Reorganizar a caixa de diálogo de configurações. Dividir o separador Geral em separadores Janelas e Shell/Ed. Mover as fontes de ajuda, que estendem o menu Ajuda, para o separador Extensões. Criar espaço para novas opções e encurtar a caixa de diálogo. Isto faz com que a caixa de diálogo se adapte melhor a ecrãs pequenos. (Contribuído por Terry Jan Reedy em :issue:`40468`.) Mover a configuração de espaço de indentação do separador Fonte para o novo separador Janelas. (Contribuído por Mark Roseman e Terry Jan Reedy em :issue:`33962`.)

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
pt_pt: Aplicar realce de sintaxe a ficheiros ``.pyi``. (Contribuído por Alex Waygood e Terry Jan Reedy em :issue:`45447`.)

source: :class:`~imaplib.IMAP4` and :class:`~imaplib.IMAP4_SSL` now have an optional *timeout* parameter for their constructors. Also, the :meth:`~imaplib.IMAP4.open` method now has an optional *timeout* parameter with this change. The overridden methods of :class:`~imaplib.IMAP4_SSL` and :class:`~imaplib.IMAP4_stream` were applied to this change. (Contributed by Donghee Na in :issue:`38615`.)
pt_pt: As classes :class:`~imaplib.IMAP4` e :class:`~imaplib.IMAP4_SSL` têm agora um parâmetro opcional *timeout* para os seus construtores. Além disso, o método :meth:`~imaplib.IMAP4.open` tem agora um parâmetro opcional *timeout* com esta alteração. Os métodos substituídos de :class:`~imaplib.IMAP4_SSL` e :class:`~imaplib.IMAP4_stream` foram aplicados a esta alteração. (Contribuído por Donghee Na em :issue:`38615`.)

source: :meth:`imaplib.IMAP4.unselect` is added. :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox. (Contributed by Donghee Na in :issue:`40375`.)
pt_pt: Adicionado :meth:`imaplib.IMAP4.unselect`. O método :meth:`imaplib.IMAP4.unselect` libera os recursos do servidor associados à caixa de correio selecionada e devolve o servidor ao estado autenticado. Este comando executa as mesmas ações que :meth:`imaplib.IMAP4.close`, exceto que nenhuma mensagem é permanentemente removida da caixa de correio atualmente selecionada. (Contribuído por Donghee Na em :issue:`40375`.)

source: To improve consistency with import statements, :func:`importlib.util.resolve_name` now raises :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts. (Contributed by Ngalim Siregar in :issue:`37444`.)
pt_pt: Para melhorar a consistência com as instruções de importação, :func:`importlib.util.resolve_name` agora lança :exc:`ImportError` em vez de :exc:`ValueError` para tentativas de importação relativa inválidas. (Contribuído por Ngalim Siregar em :issue:`37444`.)

source: Import loaders which publish immutable module objects can now publish immutable packages in addition to individual modules. (Contributed by Dino Viehland in :issue:`39336`.)
pt_pt: Os carregadores de importação que publicam objetos de módulo imutáveis podem agora publicar pacotes imutáveis além de módulos individuais. (Contribuído por Dino Viehland em :issue:`39336`.)

source: Added :func:`importlib.resources.files` function with support for subdirectories in package data, matching backport in ``importlib_resources`` version 1.5. (Contributed by Jason R. Coombs in :issue:`39791`.)
pt_pt: Adicionada a função :func:`importlib.resources.files` com suporte para subdiretórios em dados de pacotes, correspondente à retroportagem na versão 1.5 de ``importlib_resources``. (Contribuído por Jason R. Coombs em :issue:`39791`.)

source: Refreshed ``importlib.metadata`` from ``importlib_metadata`` version 1.6.1.
pt_pt: Atualizado ``importlib.metadata`` a partir da versão 1.6.1 de ``importlib_metadata``.

source: :attr:`inspect.BoundArguments.arguments` is changed from ``OrderedDict`` to regular dict. (Contributed by Inada Naoki in :issue:`36350` and :issue:`39775`.)
pt_pt: :attr:`inspect.BoundArguments.arguments` foi alterado de ``OrderedDict`` para um dicionário regular. (Contribuído por Inada Naoki em :issue:`36350` e :issue:`39775`.)

source: :mod:`ipaddress` now supports IPv6 Scoped Addresses (IPv6 address with suffix ``%<scope_id>``).
pt_pt: O módulo :mod:`ipaddress` agora suporta Endereços IPv6 com Âmbito (endereços IPv6 com sufixo ``%<scope_id>``).

source: Scoped IPv6 addresses can be parsed using :class:`ipaddress.IPv6Address`. If present, scope zone ID is available through the :attr:`~ipaddress.IPv6Address.scope_id` attribute. (Contributed by Oleksandr Pavliuk in :issue:`34788`.)
pt_pt: Endereços IPv6 com âmbito podem ser analisados usando :class:`ipaddress.IPv6Address`. Se presente, o ID da zona de âmbito está disponível através do atributo :attr:`~ipaddress.IPv6Address.scope_id`. (Contribuído por Oleksandr Pavliuk em :issue:`34788`.)

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. (Contributed by Christian Heimes in :issue:`36384`).
pt_pt: A partir do Python 3.9.5, o módulo :mod:`ipaddress` já não aceita zeros à esquerda em cadeias de caracteres de endereços IPv4. (Contribuído por Christian Heimes em :issue:`36384`.)

source: Expanded the :func:`math.gcd` function to handle multiple arguments. Formerly, it only supported two arguments. (Contributed by Serhiy Storchaka in :issue:`39648`.)
pt_pt: Expandida a função :func:`math.gcd` para lidar com múltiplos argumentos. Anteriormente, suportava apenas dois argumentos. (Contribuído por Serhiy Storchaka em :issue:`39648`.)

source: Added :func:`math.lcm`: return the least common multiple of specified arguments. (Contributed by Mark Dickinson, Ananthakrishnan and Serhiy Storchaka in :issue:`39479` and :issue:`39648`.)
pt_pt: Adicionada :func:`math.lcm`: devolve o mínimo múltiplo comum dos argumentos especificados. (Contribuído por Mark Dickinson, Ananthakrishnan e Serhiy Storchaka em :issue:`39479` e :issue:`39648`.)

source: Added :func:`math.nextafter`: return the next floating-point value after *x* towards *y*. (Contributed by Victor Stinner in :issue:`39288`.)
pt_pt: Adicionada :func:`math.nextafter`: devolve o próximo valor de ponto flutuante após *x* em direção a *y*. (Contribuído por Victor Stinner em :issue:`39288`.)

source: Added :func:`math.ulp`: return the value of the least significant bit of a float. (Contributed by Victor Stinner in :issue:`39310`.)
pt_pt: Adicionada :func:`math.ulp`: devolve o valor do bit menos significativo de um *float*. (Contribuído por Victor Stinner em :issue:`39310`.)

source: multiprocessing
pt_pt: multiprocessamento

source: The :class:`multiprocessing.SimpleQueue` class has a new :meth:`~multiprocessing.SimpleQueue.close` method to explicitly close the queue. (Contributed by Victor Stinner in :issue:`30966`.)
pt_pt: A classe :class:`multiprocessing.SimpleQueue` tem um novo método :meth:`~multiprocessing.SimpleQueue.close` para fechar explicitamente a fila. (Contribuído por Victor Stinner em :issue:`30966`.)

source: Exposed the Linux-specific :func:`os.pidfd_open` (:issue:`38692`) and :const:`os.P_PIDFD` (:issue:`38713`) for process management with file descriptors.
pt_pt: Disponibilizadas as funcionalidades específicas do Linux :func:`os.pidfd_open` (:issue:`38692`) e :const:`os.P_PIDFD` (:issue:`38713`) para gestão de processos com descritores de ficheiros.

source: The :func:`os.unsetenv` function is now also available on Windows. (Contributed by Victor Stinner in :issue:`39413`.)
pt_pt: A função :func:`os.unsetenv` está agora também disponível no Windows. (Contribuído por Victor Stinner em :issue:`39413`.)

source: The :func:`os.putenv` and :func:`os.unsetenv` functions are now always available. (Contributed by Victor Stinner in :issue:`39395`.)
pt_pt: As funções :func:`os.putenv` e :func:`os.unsetenv` estão agora sempre disponíveis. (Contribuído por Victor Stinner em :issue:`39395`.)

source: Added :func:`os.waitstatus_to_exitcode` function: convert a wait status to an exit code. (Contributed by Victor Stinner in :issue:`40094`.)
pt_pt: Adicionada a função :func:`os.waitstatus_to_exitcode`: converte um estado de espera num código de saída. (Contribuído por Victor Stinner em :issue:`40094`.)

source: On Windows now :class:`~pdb.Pdb` supports ``~/.pdbrc``. (Contributed by Tim Hopper and Dan Lidral-Porter in :issue:`20523`.)
pt_pt: No Windows, :class:`~pdb.Pdb` agora suporta ``~/.pdbrc``. (Contribuído por Tim Hopper e Dan Lidral-Porter em :issue:`20523`.)

source: :class:`~poplib.POP3` and :class:`~poplib.POP3_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
pt_pt: As classes :class:`~poplib.POP3` e :class:`~poplib.POP3_SSL` agora lançam um :class:`ValueError` se o *timeout* fornecido para o seu construtor for zero, para evitar a criação de um *socket* não bloqueante. (Contribuído por Donghee Na em :issue:`39259`.)

source: :mod:`pprint` can now pretty-print :class:`types.SimpleNamespace`. (Contributed by Carl Bordum Hansen in :issue:`37376`.)
pt_pt: O módulo :mod:`pprint` agora pode apresentar :class:`types.SimpleNamespace` de forma legível. (Contribuído por Carl Bordum Hansen em :issue:`37376`.)

source: signal
pt_pt: sinal

source: Exposed the Linux-specific :func:`signal.pidfd_send_signal` for sending to signals to a process using a file descriptor instead of a pid. (:issue:`38712`)
pt_pt: Disponibilizada a função específica do Linux :func:`signal.pidfd_send_signal` para enviar sinais a um processo usando um descritor de ficheiro em vez de um PID. (:issue:`38712`)

source: :class:`~smtplib.SMTP` and :class:`~smtplib.SMTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
pt_pt: As classes :class:`~smtplib.SMTP` e :class:`~smtplib.SMTP_SSL` agora lançam um :class:`ValueError` se o *timeout* fornecido ao construtor for zero, para evitar a criação de um *socket* não bloqueante. (Contribuído por Donghee Na em :issue:`39259`.)

source: :class:`~smtplib.LMTP` constructor now has an optional *timeout* parameter. (Contributed by Donghee Na in :issue:`39329`.)
pt_pt: O construtor de :class:`~smtplib.LMTP` agora tem um parâmetro opcional *timeout*. (Contribuído por Donghee Na em :issue:`39329`.)

source: The :mod:`socket` module now exports the :const:`~socket.CAN_RAW_JOIN_FILTERS` constant on Linux 4.1 and greater. (Contributed by Stefan Tatschner and Zackery Spytz in :issue:`25780`.)
pt_pt: O módulo :mod:`socket` agora exporta a constante :const:`~socket.CAN_RAW_JOIN_FILTERS` no Linux 4.1 e superiores. (Contribuído por Stefan Tatschner e Zackery Spytz em :issue:`25780`.)

source: The socket module now supports the :const:`~socket.CAN_J1939` protocol on platforms that support it. (Contributed by Karl Ding in :issue:`40291`.)
pt_pt: O módulo *socket* agora suporta o protocolo :const:`~socket.CAN_J1939` em plataformas que o suportam. (Contribuído por Karl Ding em :issue:`40291`.)

source: The socket module now has the :func:`socket.send_fds` and :func:`socket.recv_fds` functions. (Contributed by Joannah Nanjekye, Shinya Okano and Victor Stinner in :issue:`28724`.)
pt_pt: O módulo *socket* agora tem as funções :func:`socket.send_fds` e :func:`socket.recv_fds`. (Contribuído por Joannah Nanjekye, Shinya Okano e Victor Stinner em :issue:`28724`.)

source: On AIX, :func:`~time.thread_time` is now implemented with ``thread_cputime()`` which has nanosecond resolution, rather than ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` which has a resolution of 10 milliseconds. (Contributed by Batuhan Taskaya in :issue:`40192`)
pt_pt: No AIX, :func:`~time.thread_time` é agora implementado com ``thread_cputime()``, que tem resolução de nanosegundos, em vez de ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)``, que tem uma resolução de 10 milissegundos. (Contribuído por Batuhan Taskaya em :issue:`40192`.)

source: Added a new :data:`sys.platlibdir` attribute: name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules. It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
pt_pt: Adicionado um novo atributo :data:`sys.platlibdir`: nome do diretório de bibliotecas específico da plataforma. É usado para construir o caminho da biblioteca padrão e os caminhos dos módulos de extensão instalados. É igual a ``"lib"`` na maioria das plataformas. No Fedora e SuSE, é igual a ``"lib64"`` em plataformas de 64 bits. (Contribuído por Jan Matějek, Matěj Cepl, Charalampos Stratakis e Victor Stinner em :issue:`1294959`.)

source: Previously, :data:`sys.stderr` was block-buffered when non-interactive. Now ``stderr`` defaults to always being line-buffered. (Contributed by Jendrik Seipp in :issue:`13601`.)
pt_pt: Anteriormente, :data:`sys.stderr` era *bufferizado* em blocos quando não interativo. Agora, ``stderr`` é, por predefinição, sempre *bufferizado* por linha. (Contribuído por Jendrik Seipp em :issue:`13601`.)

source: Added :func:`tracemalloc.reset_peak` to set the peak size of traced memory blocks to the current size, to measure the peak of specific pieces of code. (Contributed by Huon Wilson in :issue:`40630`.)
pt_pt: Adicionada :func:`tracemalloc.reset_peak` para definir o tamanho máximo dos blocos de memória rastreados para o tamanho atual, para medir o pico de partes específicas de código. (Contribuído por Huon Wilson em :issue:`40630`.)

source: :pep:`593` introduced an :data:`typing.Annotated` type to decorate existing types with context-specific metadata and new ``include_extras`` parameter to :func:`typing.get_type_hints` to access the metadata at runtime. (Contributed by Till Varoquaux and Konstantin Kashin.)
pt_pt: A :pep:`593` introduziu o tipo :data:`typing.Annotated` para decorar tipos existentes com metadados específicos do contexto e um novo parâmetro ``include_extras`` para :func:`typing.get_type_hints` para aceder aos metadados em tempo de execução. (Contribuído por Till Varoquaux e Konstantin Kashin.)

source: The Unicode database has been updated to version 13.0.0. (:issue:`39926`).
pt_pt: A base de dados Unicode foi atualizada para a versão 13.0.0. (:issue:`39926`.)

source: The activation scripts provided by :mod:`venv` now all specify their prompt customization consistently by always using the value specified by ``__VENV_PROMPT__``. Previously some scripts unconditionally used ``__VENV_PROMPT__``, others only if it happened to be set (which was the default case), and one used ``__VENV_NAME__`` instead. (Contributed by Brett Cannon in :issue:`37663`.)
pt_pt: Os *scripts* de ativação fornecidos por :mod:`venv` agora especificam a personalização do *prompt* de forma consistente, usando sempre o valor especificado por ``__VENV_PROMPT__``. Anteriormente, alguns *scripts* usavam ``__VENV_PROMPT__`` incondicionalmente, outros apenas se estivesse definido (que era o caso predefinido), e um usava ``__VENV_NAME__`` em vez disso. (Contribuído por Brett Cannon em :issue:`37663`.)

source: White space characters within attributes are now preserved when serializing :mod:`xml.etree.ElementTree` to XML file. EOLNs are no longer normalized to "\n". This is the result of discussion about how to interpret section 2.11 of XML spec. (Contributed by Mefistotelis in :issue:`39011`.)
pt_pt: Os caracteres de espaço em branco dentro de atributos são agora preservados ao serializar :mod:`xml.etree.ElementTree` para um ficheiro XML. As quebras de linha já não são normalizadas para "\n". Isto é o resultado da discussão sobre como interpretar a secção 2.11 da especificação XML. (Contribuído por Mefistotelis em :issue:`39011`.)

source: Optimizations
pt_pt: Otimizações

source: Optimized the idiom for assignment a temporary variable in comprehensions. Now ``for y in [expr]`` in comprehensions is as fast as a simple assignment ``y = expr``. For example:
pt_pt: Otimizado o idioma para atribuição de uma variável temporária em *comprehensions*. Agora, ``for y in [expr]`` em *comprehensions* é tão rápido quanto uma atribuição simples ``y = expr``. Por exemplo:
