Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/allocation.po
Languages: fa, id, ja, sv

source: Allocating Objects on the Heap
fa: تخصیص اشیاء روی پشته
id: Mengalokasikan objek kedalam struktur data (heap)
ja: オブジェクトをヒープ上にメモリ確保する
sv: Tilldela objekt på heapen

source: Initialize a newly allocated object *op* with its type and initial reference. Returns the initialized object. Other fields of the object are not initialized. Despite its name, this function is unrelated to the object's :meth:`~object.__init__` method (:c:member:`~PyTypeObject.tp_init` slot). Specifically, this function does **not** call the object's :meth:`!__init__` method.
id: Menginisialisasi objek *op* yang baru dialokasikan dengan tipe dan referensi awalnya. Mengembalikan objek yang telah diinisialisasi. Bidang lain dari objek tidak diinisialisasi. Terlepas dari namanya, fungsi ini tidak terkait dengan metode :meth:`~object.__init__` objek (slot:c:member:`~PyTypeObject.tp_init` ). Secara khusus, fungsi ini tidak **tidak** memanggil metode :meth:`!__init__` objek.
ja: 新規に割り当てられたオブジェクト *op* を、その型と初期参照で初期化します。初期化されたオブジェクトを返します。オブジェクトの他のフィールドは初期化されていません。この関数は、その名前にもかかわらず、オブジェクトの :meth:`~object.__init__` メソッド ( :c:member:`~PyTypeObject.tp_init`スロット)。 具体的には、この関数は **not** オブジェクトの :meth:`!__init__`メソッド
sv: Initialiserar ett nyallokerat objekt *op* med dess typ och initiala referens. Returnerar det initialiserade objektet. Andra fält i objektet initialiseras inte. Trots sitt namn är denna funktion inte relaterad till objektets :meth:`~object.__init__`-metod (:c:member:`~PyTypeObject.tp_init` slot). Specifikt anropar den här funktionen **inte** objektets :meth:`!__init__`-metod.

source: In general, consider this function to be a low-level routine. Use :c:member:`~PyTypeObject.tp_alloc` where possible. For implementing :c:member:`!tp_alloc` for your type, prefer :c:func:`PyType_GenericAlloc` or :c:func:`PyObject_New`.
id: Secara umum, anggaplah fungsi ini sebagai rutinitas tingkat rendah. Gunakan :c:member:`~PyTypeObject.tp_alloc` jika memungkinkan. Untuk mengimplementasikan :c:member:`!tp_alloc` untuk tipe Anda, pilih :c:func:`PyType_GenericAlloc` atau :c:func:`PyObject_New`.
ja: 一般的には、この関数を低レベルルーチンとして扱ってください。使用 :c:member:`~PyTypeObject.tp_alloc` 可能な限り。実施のため :c:member:`!tp_alloc` あなたのタイプには、以下のものがおすすめです。:c:func:`PyType_GenericAlloc`または:c:func:`PyObject_New`
sv: I allmänhet bör du betrakta denna funktion som en lågnivårutin. Använd :c:member:`~PyTypeObject.tp_alloc` där det är möjligt. För implementering av :c:member:`!tp_alloc` för din typ, föredra :c:func:`PyType_GenericAlloc` eller :c:func:`PyObject_New`.

source: This function only initializes the object's memory corresponding to the initial :c:type:`PyObject` structure. It does not zero the rest.
id: Fungsi ini hanya menginisialisasi memori objek yang sesuai dengan struktur awal :c:type:`PyObject`. Fungsi ini tidak mengosongkan sisanya.
ja: この関数は、オブジェクトの初期状態に対応するメモリ領域のみを初期化します:c:type:`PyObject` 構造。 残りの部分をゼロにしません。
sv: Denna funktion initialiserar endast objektets minne som motsvarar den ursprungliga :c:type:`PyObject`-strukturen. Den nollställer inte resten.

source: This does everything :c:func:`PyObject_Init` does, and also initializes the length information for a variable-size object.
fa: این، هر کاری که:c:func:`PyObject_Init` انجام دهد را انجام می دهد و همچنین اطلاعات طول یک شی با اندازه متغیر را مقداردهی اولیه می کند.
id: Ini melakukan segalanya :c:func:`PyObject_Init`, dan juga menginisialiasi panjang informasi pada sebuah ukuran object variabel.
ja: :c:func:`PyObject_Init` の全ての処理を行い、可変サイズオブジェクトの場合には長さ情報も初期化します。
sv: Detta gör allt som :c:func:`PyObject_Init` gör, och initierar även längdinformationen för ett objekt med variabel storlek.

source: This function only initializes some of the object's memory. It does not zero the rest.
id: Fungsi ini hanya menginisialisasi sebagian memori objek. Fungsi ini tidak mengosongkan sisanya.
ja: この関数は、オブジェクトのメモリの一部だけを初期化します。残りはゼロクリアされません。
sv: Denna funktion initialiserar endast en del av objektets minne. Den nollställer inte resten.

source: Allocates a new Python object using the C structure type *TYPE* and the Python type object *typeobj* (``PyTypeObject*``) by calling :c:func:`PyObject_Malloc` to allocate memory and initializing it like :c:func:`PyObject_Init`. The caller will own the only reference to the object (i.e. its reference count will be one).
id: Mengalokasikan objek Python baru menggunakan tipe struktur C *TYPE* dan objek tipe Python *typeobj* (``PyTypeObject*``) dengan memanggil :c:func:`PyObject_Malloc` untuk mengalokasikan memori dan menginisialisasinya sebagai :c:func:`PyObject_Init`. Pemanggil akan memiliki satu-satunya referensi ke objek tersebut (misal: jumlah referensinya adalah satu).
ja: C構造体型を使用して新しいPythonオブジェクトを割り当てます *TYPE* およびPythonのオブジェクト型 *typeobj* (``PyTypeObject*``) 電話をかけることで :c:func:`PyObject_Malloc` メモリを割り当てて初期化するには、次のようにします:c:func:`PyObject_Init`. 呼び出し元はオブジェクトへの唯一の参照を保持します（つまり、その参照カウントは1になります）。
sv: Allokerar ett nytt Python-objekt med hjälp av C-strukturtypen *TYPE* och Python-typobjektet *typeobj* (``PyTypeObject*``) genom att anropa :c:func:`PyObject_Malloc` för att allokera minne och initiera det som :c:func:`PyObject_Init`. Anroparen kommer att äga den enda referensen till objektet (d.v.s. dess referensantal kommer att vara ett).

source: Avoid calling this directly to allocate memory for an object; call the type's :c:member:`~PyTypeObject.tp_alloc` slot instead.
id: Hindari memanggil ini secara langsung untuk mengalokasikan memori untuk sebuah objek; panggil slot :c:member:`~PyTypeObject.tp_alloc` dari tipe sebagai gantinya.
ja: この関数を直接呼び出してオブジェクトのメモリを割り当てることは避けてください；タイプの呼び出し :c:member:`~PyTypeObject.tp_alloc` 代わりにスロットを。
sv: Undvik att anropa detta direkt för att allokera minne för ett objekt; anropa istället typens :c:member:`~PyTypeObject.tp_alloc` slot.

source: When populating a type's :c:member:`~PyTypeObject.tp_alloc` slot, :c:func:`PyType_GenericAlloc` is preferred over a custom function that simply calls this macro.
id: Ketika mengisi slot tipe :c:member:`~PyTypeObject.tp_alloc` , :c:func:`PyType_GenericAlloc` lebih direkomendasikan daripada fungsi kustom yang hanya memanggil makro ini.
ja: タイプの値を格納する際、:c:member:`~PyTypeObject.tp_alloc` スロット、:c:func:`PyType_GenericAlloc` このマクロを単に呼び出すだけのカスタム関数よりも、このマクロを直接呼び出す方が好ましい。
sv: När en typs :c:member:`~PyTypeObject.tp_alloc`-plats fylls i är :c:func:`PyType_GenericAlloc` att föredra framför en anpassad funktion som helt enkelt anropar detta makro.

source: This macro does not call :c:member:`~PyTypeObject.tp_alloc`, :c:member:`~PyTypeObject.tp_new` (:meth:`~object.__new__`), or :c:member:`~PyTypeObject.tp_init` (:meth:`~object.__init__`).
id: Makro ini tidak memanggil :c:member:`~PyTypeObject.tp_alloc`, :c:member:`~PyTypeObject.tp_new` (:meth:`~object.__new__`), atau :c:member:`~PyTypeObject.tp_init` (:meth:`~object.__init__`).
ja: このマクロは呼び出しません :c:member:`~PyTypeObject.tp_alloc`, :c:member:`~PyTypeObject.tp_new` (:meth:`~object.__new__`), または :c:member:`~PyTypeObject.tp_init` (:meth:`~object.__init__`).
sv: Detta makro anropar inte :c:member:`~PyTypeObject.tp_alloc`, :c:member:`~PyTypeObject.tp_new` (:meth:`~object.__new__`), eller :c:member:`~PyTypeObject.tp_init` (:meth:`~object.__init__`).

source: This cannot be used for objects with :c:macro:`Py_TPFLAGS_HAVE_GC` set in :c:member:`~PyTypeObject.tp_flags`; use :c:macro:`PyObject_GC_New` instead.
id: Ini tidak dapat digunakan untuk objek dengan :c:macro:`Py_TPFLAGS_HAVE_GC` yang diatur di :c:member:`~PyTypeObject.tp_flags`; gunakan :c:macro:`PyObject_GC_New` sebagai gantinya.
ja: これは、以下の対象物には使用できません :c:macro:`Py_TPFLAGS_HAVE_GC` 設定される :c:member:`~PyTypeObject.tp_flags`; 使用 :c:macro:`PyObject_GC_New` 代わりに。
sv: Detta kan inte användas för objekt med :c:macro:`Py_TPFLAGS_HAVE_GC` inställt i :c:member:`~PyTypeObject.tp_flags`; använd :c:macro:`PyObject_GC_New` istället.

source: Memory allocated by this macro must be freed with :c:func:`PyObject_Free` (usually called via the object's :c:member:`~PyTypeObject.tp_free` slot).
id: Memori yang dialokasikan oleh makro ini harus dibebaskan dengan :c:func:`PyObject_Free` (biasanya dipanggil melalui slot objek :c:member:`~PyTypeObject.tp_free` ).
ja: このマクロで割り当てられたメモリは :c:func:`PyObject_Free` （通常、オブジェクトの経由で呼び出されます :c:member:`~PyTypeObject.tp_free` スロット)
sv: Minne som allokerats av detta makro måste frigöras med :c:func:`PyObject_Free` (anropas vanligtvis via objektets :c:member:`~PyTypeObject.tp_free` slot).

source: The returned memory is not guaranteed to have been completely zeroed before it was initialized.
id: Memori yang dikembalikan tidak dijamin telah di-nol-kan sepenuhnya sebelum diinisialisasi.
ja: 返却されたメモリは、初期化される前に完全にゼロクリアされていることが保証されていません。
sv: Det är inte säkert att det returnerade minnet har nollställts helt innan det initialiserades.

source: This macro does not construct a fully initialized object of the given type; it merely allocates memory and prepares it for further initialization by :c:member:`~PyTypeObject.tp_init`. To construct a fully initialized object, call *typeobj* instead. For example::
id: Makro ini tidak membuat objek yang diinisialisasi penuh dari tipe yang diberikan; makro ini hanya mengalokasikan memori dan mempersiapkannya untuk inisialisasi lebih lanjut oleh :c:member:`~PyTypeObject.tp_init`. Untuk membuat objek yang diinisialisasi secara penuh, panggil *typeobj* sebagai gantinya. Sebagai contoh::
ja: このマクロは、指定された型の完全に初期化されたオブジェクトを構築しません; 単にメモリを割り当て、さらに初期化するための準備を行うだけです:c:member:`~PyTypeObject.tp_init`. 完全に初期化されたオブジェクトを作成するには、代わりに*typeobj*を呼び出してください。 例::
sv: Detta makro konstruerar inte ett fullständigt initialiserat objekt av den angivna typen; det allokerar bara minne och förbereder det för ytterligare initialisering av :c:member:`~PyTypeObject.tp_init`. För att konstruera ett helt initialiserat objekt, anropa *typeobj* istället. Till exempel::

source: :c:macro:`PyObject_GC_New`
sv: :c:makro:`PyObject_GC_New`

source: :c:member:`~PyTypeObject.tp_alloc`
sv: :c:medlem:`~PyTypeObject.tp_alloc`

source: Like :c:macro:`PyObject_New` except:
id: Seperti :c:macro:`PyObject_New` kecuali:
ja: のように :c:macro:`PyObject_New` ただし：
sv: Som :c:macro:`PyObject_New` utom:

source: It allocates enough memory for the *TYPE* structure plus *size* (``Py_ssize_t``) fields of the size given by the :c:member:`~PyTypeObject.tp_itemsize` field of *typeobj*.
id: Ini mengalokasikan cukup memori untuk struktur *TYPE* ditambah bidang *size* (``Py_ssize_t``) dengan ukuran yang diberikan oleh bidang :c:member:`~PyTypeObject.tp_itemsize` dari *typeobj*.
ja: *TYPE*構造体と*size*分のメモリを割り当てます (``Py_ssize_t``) 指定されたサイズによるフィールド :c:member:`~PyTypeObject.tp_itemsize` *typeobj* 型のフィールド。
sv: Den allokerar tillräckligt med minne för *TYPE*-strukturen plus *size*-fält (``Py_ssize_t``) med den storlek som anges av fältet :c:member:`~PyTypeObject.tp_itemsize` i *typeobj*.

source: The memory is initialized like :c:func:`PyObject_InitVar`.
id: Memori diinisialisasi seperti :c:func:`PyObject_InitVar`.
ja: メモリは次のように初期化されます:c:func:`PyObject_InitVar`.
sv: Minnet initialiseras på samma sätt som :c:func:`PyObject_InitVar`.

source: This is useful for implementing objects like tuples, which are able to determine their size at construction time. Embedding the array of fields into the same allocation decreases the number of allocations, improving the memory management efficiency.
id: Hal ini berguna untuk mengimplementasikan objek seperti tuple, yang dapat menentukan ukurannya pada saat konstruksi. Menanamkan array of fields ke dalam alokasi yang sama akan mengurangi jumlah alokasi, sehingga meningkatkan efisiensi manajemen memori.
ja: これは、構築時にサイズを決定できるタプルのようなオブジェクトを実装するのに役立ちます。 フィールドの配列を同じ割り当てに埋め込むことで、割り当ての回数を減らし、メモリ管理の効率を向上させます。
sv: Detta är användbart för att implementera objekt som t.ex. tupler, som kan bestämma sin storlek vid konstruktionstillfället. Om fältmatrisen bäddas in i samma allokering minskar antalet allokeringar, vilket förbättrar minneshanteringens effektivitet.

source: This cannot be used for objects with :c:macro:`Py_TPFLAGS_HAVE_GC` set in :c:member:`~PyTypeObject.tp_flags`; use :c:macro:`PyObject_GC_NewVar` instead.
id: Ini tidak dapat digunakan untuk objek dengan :c:macro:`Py_TPFLAGS_HAVE_GC` yang diatur di :c:member:`~PyTypeObject.tp_flags`; gunakan :c:macro:`PyObject_GC_NewVar` sebagai gantinya.
ja: これは、以下の対象物には使用できません :c:macro:`Py_TPFLAGS_HAVE_GC` 設定される :c:member:`~PyTypeObject.tp_flags`; 使用 :c:macro:`PyObject_GC_NewVar`代わりに。
sv: Detta kan inte användas för objekt med :c:macro:`Py_TPFLAGS_HAVE_GC` inställt i :c:member:`~PyTypeObject.tp_flags`; använd :c:macro:`PyObject_GC_NewVar` istället.

source: Memory allocated by this function must be freed with :c:func:`PyObject_Free` (usually called via the object's :c:member:`~PyTypeObject.tp_free` slot).
id: Memori yang dialokasikan oleh fungsi ini harus dibebaskan dengan :c:func:`PyObject_Free` (biasanya dipanggil melalui slot :c:member:`~PyTypeObject.tp_free` objek).
ja: この関数によって割り当てられたメモリは :c:func:`PyObject_Free` （通常、オブジェクトの :c:member:`~PyTypeObject.tp_free` スロット)
sv: Minne som allokerats av denna funktion måste frigöras med :c:func:`PyObject_Free` (anropas vanligtvis via objektets :c:member:`~PyTypeObject.tp_free` slot).

source: :c:macro:`PyObject_GC_NewVar`
sv: :c:makro:`PyObject_GC_NewVar`

source: Same as :c:func:`PyObject_Free`.
id: Sama seperti :c:func:`PyObject_Free`.
ja: 同じです :c:func:`PyObject_Free`.
sv: Samma som :c:func:`PyObject_Free`.

source: Object which is visible in Python as ``None``. This should only be accessed using the :c:macro:`Py_None` macro, which evaluates to a pointer to this object.
fa: شیئی که در پایتون به صورت ``None`` قابل مشاهده است این فقط باید با استفاده از ماکرو :c:macro:`Py_None`، که به یک اشاره گر به این شی ارزیابی می شود، دسترسی داشت.
id: Object yang terlihat di Python sebagai ``None``. Ini seharusnya hanya dapat diakses menggunakan makro :c:macro:`Py_None`, yang mengevaluasi ke sebuah pointer ke object ini.
ja: Python からは ``None`` に見えるオブジェクトです。この値へのアクセスは、このオブジェクトへのポインタを評価する :c:macro:`Py_None` マクロを使わなければなりません。
sv: Objekt som är synligt i Python som ``None``. Detta bör endast nås med hjälp av :c:macro:`Py_None`-makrot, som utvärderas till en pekare till detta objekt.

source: :ref:`moduleobjects`
sv: :ref:`modulobjekt`

source: To allocate and create extension modules.
fa: برای تخصیص و ایجاد ماژول های افزونه.
id: Untuk mengalokasikan dan membuat modul ekstensi.
ja: 拡張モジュールのアロケートと生成。
sv: För att tilldela och skapa tilläggsmoduler.

source: Initialize a newly allocated object *op* with its type and initial reference. Returns the initialized object. Other fields of the object are not affected.
fa: یک شیء تازه تخصیص یافته *op* را با نوع و مرجع اولیه آن مقداردهی کنید. شیء اولیه را برمی گرداند. سایر فیلدهای شی تحت تأثیر قرار نمی گیرند.

source: Allocate a new Python object using the C structure type *TYPE* and the Python type object *typeobj* (``PyTypeObject*``). Fields not defined by the Python object header are not initialized. The caller will own the only reference to the object (i.e. its reference count will be one). The size of the memory allocation is determined from the :c:member:`~PyTypeObject.tp_basicsize` field of the type object.
fa: یک شی جدید پایتون را با استفاده از ساختار C نوع *TYPE* ​​و شیء نوع پایتون *typeobj* (``PyTypeObject*``) اختصاص دهید. فیلدهایی که توسط هدر شی پایتون تعریف نشده اند مقداردهی اولیه نمی شوند. صدا زننده تنها مرجع شیء را در اختیار خواهد داشت (یعنی تعداد مراجع آن یک خواهد بود). اندازه تخصیص حافظه از تعیین می شود از فیلد نوع شئ.:c:member:`~PyTypeObject.tp_basicsize`

source: Note that this function is unsuitable if *typeobj* has :c:macro:`Py_TPFLAGS_HAVE_GC` set. For such objects, use :c:func:`PyObject_GC_New` instead.
fa: توجه داشته باشید که اگر *typeobj* دارای:c:macro:`Py_TPFLAGS_HAVE_GC` مجموعه باشد، این تابع نامناسب است. برای چنین اشیایی به جای آن از :c:func:`PyObject_GC_New` استفاده کنید

source: Allocate a new Python object using the C structure type *TYPE* and the Python type object *typeobj* (``PyTypeObject*``). Fields not defined by the Python object header are not initialized. The allocated memory allows for the *TYPE* structure plus *size* (``Py_ssize_t``) fields of the size given by the :c:member:`~PyTypeObject.tp_itemsize` field of *typeobj*. This is useful for implementing objects like tuples, which are able to determine their size at construction time. Embedding the array of fields into the same allocation decreases the number of allocations, improving the memory management efficiency.
fa: یک شیء جدید پایتون را با استفاده از ساختار C نوع *TYPE* ​​و شیء نوع پایتون *typeobj*(``PyTypeObject*``) اختصاص دهید. فیلدهایی که توسط هدر شی پایتون تعریف نشده اند مقداردهی اولیه نمی شوند. حافظه تخصیص یافته اجازه می دهد تا ساختار *TYPE* ​​به اضافه *size* (``Py_ssize_t``) فیلدهای اندازه داده شده توسط فیلد :c:member:`~PyTypeObject.tp_itemsize` *typeobj*. این برای اجرای اشیایی مانند تاپل ها که قادر به تعیین اندازه آنها در زمان ساخت هستند مفید است. جاسازی آرایه فیلدها در یک تخصیص تعداد تخصیص ها را کاهش می دهد و کارایی مدیریت حافظه را بهبود می بخشد.

source: Note that this function is unsuitable if *typeobj* has :c:macro:`Py_TPFLAGS_HAVE_GC` set. For such objects, use :c:func:`PyObject_GC_NewVar` instead.
fa: توجه داشته باشید که اگر *typeobj* دارای :c:macro:`Py_TPFLAGS_HAVE_GC` مجموعه باشد، این تابع نامناسب است. برای چنین اشیایی به جای آن از :c:func:`PyObject_GC_NewVar` استفاده کنید.

source: Releases memory allocated to an object using :c:macro:`PyObject_New` or :c:macro:`PyObject_NewVar`. This is normally called from the :c:member:`~PyTypeObject.tp_dealloc` handler specified in the object's type. The fields of the object should not be accessed after this call as the memory is no longer a valid Python object.
fa: حافظه اختصاص داده شده به یک شی را با استفاده از :c:macro:`PyObject_New` یا :c:macro:`PyObject_NewVar` آزاد می کند. این معمولاً از کنترل کننده :c:member:`~PyTypeObject.tp_dealloc` مشخص شده در نوع شیء ، فراخوانی می شود. پس از این فراخوانی نباید به فیلدهای شیء دسترسی داشت زیرا حافظه دیگر یک شیء پایتون معتبر نیست.
