Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/bool.po
Languages: es_es, ru, sv

source: Boolean Objects
es_es: Objetos booleanos
ru: Логические объекты
sv: Booleska objekt

source: Booleans in Python are implemented as a subclass of integers. There are only two booleans, :c:data:`Py_False` and :c:data:`Py_True`. As such, the normal creation and deletion functions don't apply to booleans. The following macros are available, however.
es_es: Los valores booleanos en Python se implementan como una subclase de enteros. Solo hay dos booleanos, :c:data:`Py_False` y :c:data:`Py_True`. Como tal, las funciones normales de creación y eliminación no se aplican a los valores booleanos. Sin embargo, están disponibles las siguientes macros.
ru: Логические значения в Python реализованы как подкласс целых чисел. Существует только два логических значения :c:data:`Py_False` и :c:data:`Py_True`. Таким образом, обычные функции создания и удаления не применяются к логическим значениям. Однако доступны следующие макросы.
sv: Booleaner i Python är implementerade som en underklass till heltal. Det finns bara två booleaner, :c:data:`Py_False` och :c:data:`Py_True`. Därför gäller inte de normala funktionerna för att skapa och radera booleaner. Följande makron är dock tillgängliga.

source: This instance of :c:type:`PyTypeObject` represents the Python boolean type; it is the same object as :class:`bool` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo booleano de Python; es el mismo objeto que :class:`bool` en la capa de Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет логический тип Python; это тот же объект, что и :class:`bool` на уровне Python.
sv: Denna instans av :c:type:`PyTypeObject` representerar Python-typen boolean; det är samma objekt som :class:`bool` i Python-lagret.

source: Return true if *o* is of type :c:data:`PyBool_Type`. This function always succeeds.
es_es: Devuelve true si *o* es de tipo :c:data:`PyBool_Type`. Esta función siempre tiene éxito.
ru: Возвращает значение true, если *o* имеет тип :c:data:`PyBool_Type`. Эта функция всегда выполняется успешно.
sv: Returnerar true om *o* är av typen :c:data:`PyBool_Type`. Denna funktion lyckas alltid.

source: The Python ``False`` object. This object has no methods and is `immortal <https://peps.python.org/pep-0683/>`_.
es_es: El objeto Python ``False``. Este objeto no tiene métodos y es `inmortal <https://peps.python.org/pep-0683/>`_.
ru: Объект Python ``False``. Этот объект не имеет методов и является бессмертным <https://peps.python.org/pep-0683/>`_.

source: :c:data:`Py_False` is immortal.
es_es: :c:data:`Py_False` es inmortal.
ru: :c:data:`Py_False` бессмертный.

source: The Python ``True`` object. This object has no methods and is `immortal <https://peps.python.org/pep-0683/>`_.
es_es: El objeto Python ``True``. Este objeto no tiene métodos y es `inmortal <https://peps.python.org/pep-0683/>`_.
ru: Объект Python ``True``. Этот объект не имеет методов и является бессмертным <https://peps.python.org/pep-0683/>`_.

source: :c:data:`Py_True` is immortal.
es_es: :c:data:`Py_True` es inmortal.
ru: :c:data:`Py_True` бессмертный.

source: Return :c:data:`Py_False` from a function.
es_es: Devuelve :c:data:`Py_False` desde una función.
ru: Возвращает :c:data:`Py_False` из функции.
sv: Returnera :c:data:`Py_False` från en funktion.

source: Return :c:data:`Py_True` from a function.
es_es: Devuelve :c:data:`Py_True` desde una función.
ru: Возвращает :c:data:`Py_True` из функции.
sv: Returnera :c:data:`Py_True` från en funktion.

source: Return :c:data:`Py_True` or :c:data:`Py_False`, depending on the truth value of *v*.
es_es: Devuelve :c:data:`Py_True` o :c:data:`Py_False`, dependiendo del valor verdadero de *v*.
ru: Возвращает :c:data:`Py_True` или :c:data:`Py_False`, в зависимости от логического значения *v*.
sv: Returnerar :c:data:`Py_True` eller :c:data:`Py_False`, beroende på sanningsvärdet för *v*.

source: The Python ``False`` object. This object has no methods and is :term:`immortal`.
sv: Python-objektet ``False``. Detta objekt har inga metoder och är :term:`odödligt`.

source: :c:data:`Py_False` is :term:`immortal`.
sv: :c:data:`Py_False` är :term:`odödlig`.

source: The Python ``True`` object. This object has no methods and is :term:`immortal`.
sv: Python-objektet ``True``. Detta objekt har inga metoder och är :term:`odödligt`.

source: :c:data:`Py_True` is :term:`immortal`.
sv: :c:data:`Py_True` är :term:`immortal`.
