Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/bytes.po
Languages: es_es, ru, sv, uk

source: Bytes Objects
es_es: Objetos de bytes
ru: Байтовые объекты
sv: Bytes-objekt
uk: Об'єкти Bytes

source: These functions raise :exc:`TypeError` when expecting a bytes parameter and called with a non-bytes parameter.
es_es: Estas funciones generan :exc:`TypeError` cuando esperan un parámetro de bytes y se llaman con un parámetro que no es de bytes.
ru: Эти функции генерируют :exc:`TypeError` при ожидании байтового параметра и вызываются с не байтовым параметром.
sv: Dessa funktioner ger upphov till :exc:`TypeError` när de förväntar sig en bytesparameter och anropas med en parameter som inte är bytes.
uk: Ці функції викликають :exc:`TypeError`, коли очікується параметр bytes і викликаються з параметром, який не є байтом.

source: This subtype of :c:type:`PyObject` represents a Python bytes object.
es_es: Este subtipo de :c:type:`PyObject` representa un objeto de bytes de Python.
ru: Этот подтип :c:type:`PyObject` представляет байтовый объект Python.
sv: Denna subtyp av :c:type:`PyObject` representerar ett Python bytes-objekt.
uk: Цей підтип :c:type:`PyObject` представляє об’єкт Python bytes.

source: This instance of :c:type:`PyTypeObject` represents the Python bytes type; it is the same object as :class:`bytes` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject`representa el tipo de bytes de Python; es el mismo objeto que :class:`bytes` en la capa de Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип байта Python; это тот же объект, что и :class:`bytes` на уровне Python.
sv: Denna instans av :c:type:`PyTypeObject` representerar Python-bytes-typen; det är samma objekt som :class:`bytes` i Python-lagret.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє тип Python bytes; це той самий об’єкт, що й :class:`bytes` на рівні Python.

source: Return true if the object *o* is a bytes object or an instance of a subtype of the bytes type. This function always succeeds.
es_es: Devuelve verdadero si el objeto *o* es un objeto de bytes o una instancia de un subtipo del tipo de bytes. Esta función siempre tiene éxito.
ru: Возвращает значение true, если объект *o* является байтовым объектом или экземпляром подтипа типа байтов. Эта функция всегда выполняется успешно.
sv: Returnerar true om objektet *o* är ett bytesobjekt eller en instans av en subtyp av bytes-typen. Denna funktion lyckas alltid.
uk: Повертає true, якщо об’єкт *o* є об’єктом bytes або екземпляром підтипу типу bytes. Ця функція завжди успішна.

source: Return true if the object *o* is a bytes object, but not an instance of a subtype of the bytes type. This function always succeeds.
es_es: Devuelve verdadero si el objeto *o* es un objeto de bytes, pero no una instancia de un subtipo del tipo de bytes. Esta función siempre tiene éxito.
ru: Возвращает значение true, если объект *o* является байтовым объектом, но не экземпляром подтипа типа байтов. Эта функция всегда выполняется успешно.
sv: Returnerar true om objektet *o* är ett bytesobjekt, men inte en instans av en subtyp av bytes-typen. Denna funktion lyckas alltid.
uk: Повертає true, якщо об’єкт *o* є об’єктом bytes, але не екземпляром підтипу типу bytes. Ця функція завжди успішна.

source: Return a new bytes object with a copy of the string *v* as value on success, and ``NULL`` on failure. The parameter *v* must not be ``NULL``; it will not be checked.
es_es: Devuelve un nuevo objeto de bytes con una copia de la cadena *v* como valor en caso de éxito y ``NULL`` en caso de error. El parámetro *v* no debe ser ``NULL``; no se comprobará..
ru: Возвращает новый байтовый объект с копией строки *v* в качестве значения в случае успеха и ``NULL`` в случае неудачи. Параметр *v* не должен быть ``NULL``; он не будет проверяться.
sv: Returnerar ett nytt bytesobjekt med en kopia av strängen *v* som värde vid framgång, och ``NULL`` vid misslyckande. Parametern *v* får inte vara ``NULL``; den kommer inte att kontrolleras.
uk: Повертає новий об’єкт bytes із копією рядка *v* як значення в разі успіху та ``NULL`` у разі помилки. Параметр *v* не має бути ``NULL``; перевірятися не буде.

source: Return a new bytes object with a copy of the string *v* as value and length *len* on success, and ``NULL`` on failure. If *v* is ``NULL``, the contents of the bytes object are uninitialized.
es_es: Devuelve un nuevo objeto de bytes con una copia de la cadena *v* como valor y longitud *len* en caso de éxito, y ``NULL`` en caso de error. Si *v* es ``NULL``, el contenido del objeto de bytes no se inicializa.
ru: Возвращает новый байтовый объект с копией строки *v* в качестве значения и длиной *len* в случае успеха и ``NULL`` в случае неудачи. Если *v* равно ``NULL``, содержимое байтового объекта не инициализировано.
sv: Returnerar ett nytt bytes-objekt med en kopia av strängen *v* som värde och längden *len* vid framgång, och ``NULL`` vid misslyckande. Om *v* är ``NULL`` avinitialiseras innehållet i bytes-objektet.
uk: Повертає новий об’єкт bytes із копією рядка *v* як значення та довжиною *len* у разі успіху та ``NULL`` у разі помилки. Якщо *v* має значення ``NULL``, вміст об’єкта bytes не ініціалізується.

source: Take a C :c:func:`printf`\ -style *format* string and a variable number of arguments, calculate the size of the resulting Python bytes object and return a bytes object with the values formatted into it. The variable arguments must be C types and must correspond exactly to the format characters in the *format* string. The following format characters are allowed:
es_es: Tomar una cadena C :c:func:`printf`\ -style *format* y un número variable de argumentos, calcular el tamaño del objeto de bytes de Python resultante y devolver un objeto de bytes con los valores formateados en él. Los argumentos variables deben ser de tipo C y deben corresponder exactamente a los caracteres de formato en la cadena *formato*. Se permiten los siguientes caracteres de formato:
ru: Берет строку C :c:func:`printf`\ -style *format* и переменное количество аргументов, вычисляет размер результирующего байтового объекта Python и возвращает байтовый объект со значениями, отформатированными в нем. Аргументы переменных должны быть типами C и точно соответствовать символам формата в строке *format*. Допустимы следующие символы формата:
sv: Ta en C :c:func:`printf`-stil *format*-sträng och ett variabelt antal argument, beräkna storleken på det resulterande Python bytes-objektet och returnera ett bytes-objekt med de värden som formaterats i det. De variabla argumenten måste vara C-typer och måste exakt motsvara formattecknen i *format*-strängen. Följande formattecken är tillåtna:
uk: Візьміть рядок *format* у стилі C :c:func:`printf`\ і змінну кількість аргументів, обчисліть розмір результуючого об’єкта Python bytes і поверніть об’єкт bytes із відформатованими значеннями. Змінні аргументи мають бути типу C і точно відповідати символам формату в рядку *format*. Дозволяються такі символи формату:

source: Format Characters
es_es: Caracteres de formato
ru: Форматирование символов
sv: Format tecken
uk: Формат символів

source: Type
es_es: Tipo
ru: Тип
sv: Typ
uk: Тип

source: Comment
es_es: Comentario
ru: Комментарий
sv: Kommentar
uk: коментар

source: The literal % character.
es_es: El carácter % literal.
ru: Литеральный символ %
sv: Det bokstavliga % ctecknet.
uk: Літеральний символ %.

source: A single byte, represented as a C int.
es_es: Un solo byte, representado como C int.
ru: Один байт, представленный в виде C int.
sv: En enda byte, representerad som en C int.
uk: Один байт, представлений як C int.

source: Equivalent to ``printf("%d")``. [1]_
es_es: Equivalente a ``printf("%d")``. [1]_
ru: Эквивалентно ``printf("%d")``. [1]_
sv: Motsvarar ``printf("%d")``. [1]_
uk: Еквівалент ``printf("%d")``. [1]_

source: unsigned int
es_es: int sin firmar
sv: osignerad int

source: Equivalent to ``printf("%u")``. [1]_
es_es: Equivalente a ``printf("%u")``. [1]_
ru: Эквивалентно ``printf("%u")``. [1]_
sv: Motsvarar ``printf("%u")``. [1]_
uk: Еквівалент ``printf("%u")``. [1]_

source: Equivalent to ``printf("%ld")``. [1]_
es_es: Equivalente a ``printf("%ld")``. [1]_
ru: Эквивалентно ``printf("%ld")``. [1]_
sv: Motsvarar ``printf("%ld")``. [1]_
uk: Еквівалент ``printf("%ld")``. [1]_

source: Equivalent to ``printf("%lu")``. [1]_
es_es: Equivalente a ``printf("%lu")``. [1]_
ru: Эквивалентно ``printf("%lu")``. [1]_
sv: Motsvarar ``printf("%lu")``. [1]_
uk: Еквівалент ``printf("%lu")``. [1]_

source: Equivalent to ``printf("%zd")``. [1]_
es_es: Equivalente a ``printf("%zd")``. [1]_
ru: Эквивалентно ``printf("%zd")``. [1]_
sv: Motsvarar ``printf("%zd")``. [1]_
uk: Еквівалент ``printf("%zd")``. [1]_

source: size_t
sv: storlek_t

source: Equivalent to ``printf("%zu")``. [1]_
es_es: Equivalente a ``printf("%zu")``. [1]_
ru: Эквивалентно ``printf("%zu")``. [1]_
sv: Motsvarar ``printf("%zu")``. [1]_
uk: Еквівалент ``printf("%zu")``. [1]_

source: Equivalent to ``printf("%i")``. [1]_
es_es: Equivalente a ``printf("%i")``. [1]_
ru: Эквивалентно ``printf("%i")``. [1]_
sv: Motsvarar ``printf("%i")``. [1]_
uk: Еквівалент ``printf("%i")``. [1]_

source: Equivalent to ``printf("%x")``. [1]_
es_es: Equivalente a ``printf("%x")``. [1]_
ru: Эквивалентно ``printf("%x")``. [1]_
sv: Motsvarar ``printf("%x")``. [1]_
uk: Еквівалент ``printf("%x")``. [1]_

source: const char\*
sv: konst char\*

source: A null-terminated C character array.
es_es: Una matriz de caracteres C terminada en nulo.
ru: Нуль-терминированный массив символов С.
sv: En nollavslutad C-teckenmatris.
uk: Масив символів C із закінченням нулем.

source: const void\*
sv: konst void\*

source: The hex representation of a C pointer. Mostly equivalent to ``printf("%p")`` except that it is guaranteed to start with the literal ``0x`` regardless of what the platform's ``printf`` yields.
es_es: La representación hexadecimal de un puntero C. Mayormente equivalente a ``printf("%p")`` excepto si se garantiza que comienza con el literal ``0x`` independientemente de lo que produzca``printf`` de la plataforma.
ru: Шестнадцатеричное представление указателя на языке Си. В основном эквивалентно ``printf("%p")``, за исключением того, что оно гарантированно начинается с литерала ``0x`` независимо от того, что дает ``printf`` платформы.
sv: Hex-representationen av en C-pekare. I stort sett likvärdig med ``printf("%p")`` förutom att den garanterat börjar med den bokstavliga ``0x`` oavsett vad plattformens ``printf`` ger.
uk: Шістнадцяткове представлення покажчика C. Здебільшого еквівалентний ``printf("%p")`` за винятком того, що він гарантовано починається з літералу ``0x`` незалежно від того, що дає ``printf`` платформи.

source: An unrecognized format character causes all the rest of the format string to be copied as-is to the result object, and any extra arguments discarded.
es_es: Un carácter de formato no reconocido hace que todo el resto de la cadena de formato se copie tal cual en el objeto de resultado y se descarten los argumentos adicionales.
ru: Нераспознанный символ формата приводит к тому, что вся остальная строка формата копируется в результирующий объект как есть, а все дополнительные аргументы отбрасываются.
sv: Ett formattecken som inte känns igen gör att resten av formatsträngen kopieras som den är till resultatobjektet och att eventuella extra argument kasseras.
uk: Нерозпізнаний символ формату спричиняє копіювання всієї решти рядка формату в об’єкт результату як є, а будь-які додаткові аргументи відкидаються.

source: For integer specifiers (d, u, ld, lu, zd, zu, i, x): the 0-conversion flag has effect even when a precision is given.
es_es: Para especificadores de enteros (d, u, ld, lu, zd, zu, i, x): el indicador de conversión 0 tiene efecto incluso cuando se proporciona una precisión.
ru: Для целочисленных спецификаторов (d, u, ld, lu, zd, zu, i, x): флаг преобразования в 0 действует даже при заданной точности.
sv: För heltalsangivelser (d, u, ld, lu, zd, zu, i, x): 0-konverteringsflaggan gäller även när en precision anges.
uk: Для цілочисельних специфікаторів (d, u, ld, lu, zd, zu, i, x): прапор 0-конверсії діє, навіть якщо задано точність.

source: Identical to :c:func:`PyBytes_FromFormat` except that it takes exactly two arguments.
es_es: Idéntico a :c:func:`PyBytes_FromFormat` salvo que toma exactamente dos argumentos.
ru: Идентичен :c:func:`PyBytes_FromFormat`, за исключением того, что он принимает ровно два аргумента.
sv: Identisk med :c:func:`PyBytes_FromFormat` förutom att den tar exakt två argument.
uk: Ідентичний :c:func:`PyBytes_FromFormat` за винятком того, що він приймає рівно два аргументи.

source: Return the bytes representation of object *o* that implements the buffer protocol.
es_es: Devuelve la representación de bytes del objeto *o* que implementa el protocolo de búfer.
ru: Возвращает байтовое представление объекта *o*, который реализует буферный протокол.
sv: Returnera bytesrepresentationen av objektet *o* som implementerar buffertprotokollet.
uk: Повертає представлення байтів об’єкта *o*, який реалізує протокол буфера.

source: Return the length of the bytes in bytes object *o*.
es_es: Devuelve la longitud de los bytes en bytes objeto *o*.
ru: Возвращает длину байтов в байтовом объекте *o*.
sv: Returnera längden på byte i bytesobjektet *o*.
uk: Повертає довжину байтів у байтах об'єкт *o*.

source: Similar to :c:func:`PyBytes_Size`, but without error checking.
es_es: Similar a :c:func:`PyBytes_Size`, pero sin comprobación de errores.
ru: Аналогично :c:func:`PyBytes_Size`, но без проверки ошибок.
sv: Liknar :c:func:`PyBytes_Size`, men utan felkontroll.

source: Return a pointer to the contents of *o*. The pointer refers to the internal buffer of *o*, which consists of ``len(o) + 1`` bytes. The last byte in the buffer is always null, regardless of whether there are any other null bytes. The data must not be modified in any way, unless the object was just created using ``PyBytes_FromStringAndSize(NULL, size)``. It must not be deallocated. If *o* is not a bytes object at all, :c:func:`PyBytes_AsString` returns ``NULL`` and raises :exc:`TypeError`.
es_es: Devuelve un puntero al contenido de *o*. El puntero se refiere al búfer interno de *o*, que consta de ``len(o) + 1`` bytes. El último byte del búfer siempre es nulo, independientemente de que haya o no otros bytes nulos. Los datos no deben modificarse de ninguna manera, a menos que el objeto se acabe de crear usando``PyBytes_FromStringAndSize(NULL, size)``. No debe desasignarse. Si *o* no es un objeto de bytes en absoluto,:c:func:`PyBytes_AsString` devuelve ``NULL`` e incrementa :exc:`TypeError`.
ru: Возвращает указатель на содержимое *o*. Указатель ссылается на внутренний буфер *o*, который состоит из байтов ``len(o) + 1``. Последний байт в буфере всегда равен null, независимо от того, есть ли другие пустые байты. Данные не должны быть изменены каким-либо образом, если только объект не был только что создан с использованием ``PyBytes_FromStringAndSize(NULL, size)``. Он не должен быть освобожден. Если *o* вообще не является байтовым объектом, :c:func:`PyBytes_AsString` возвращает ``NULL`` и вызывает :exc:`TypeError`.
sv: Returnerar en pekare till innehållet i *o*. Pekaren refererar till den interna bufferten i *o*, som består av ``len(o) + 1`` byte. Den sista byten i bufferten är alltid null, oavsett om det finns några andra null-bytes. Data får inte ändras på något sätt, såvida inte objektet just skapades med ``PyBytes_FromStringAndSize(NULL, size)``. Det får inte deallokeras. Om *o* inte alls är ett bytesobjekt, returnerar :c:func:`PyBytes_AsString` ``NULL`` och ger upphov till :exc:`TypeError`.
uk: Повернути вказівник на вміст *o*. Покажчик посилається на внутрішній буфер *o*, який складається з ``len(o) + 1`` байтів. Останній байт у буфері завжди нульовий, незалежно від того, чи є інші нульові байти. Дані не можна змінювати жодним чином, якщо об’єкт не було щойно створено за допомогою ``PyBytes_FromStringAndSize(NULL, size)``. Його не можна звільняти. Якщо *o* взагалі не є об’єктом bytes, :c:func:`PyBytes_AsString` повертає ``NULL`` і викликає :exc:`TypeError`.

source: Similar to :c:func:`PyBytes_AsString`, but without error checking.
es_es: Similar a :c:func:`PyBytes_AsString`, pero sin comprobación de errores.
ru: Аналогично :c:func:`PyBytes_AsString`, но без проверки ошибок.
sv: Liknar :c:func:`PyBytes_AsString`, men utan felkontroll.

source: Return the null-terminated contents of the object *obj* through the output variables *buffer* and *length*. Returns ``0`` on success.
es_es: Devuelve el contenido terminado en cero del objeto *obj* a través de las variables de salida *buffer* y *length*. Devuelve ``0`` en caso de éxito.
ru: Возвращает содержимое объекта *obj*, завершающееся нулем, через выходные переменные *buffer* и *length*. Возвращает ``0`` в случае успеха.
sv: Returnerar det nollavslutade innehållet i objektet *obj* genom utdatavariablerna *buffer* och *length*. Returnerar ``0`` vid framgång.

source: If *length* is ``NULL``, the bytes object may not contain embedded null bytes; if it does, the function returns ``-1`` and a :exc:`ValueError` is raised.
es_es: Si *length* es ``NULL``, el objeto bytes no puede contener bytes nulos incrustados; si lo hace, la función devuelve ``-1`` y se incrementa un :exc:`ValueError`.
ru: Если значение *length* равно ``NULL``, байтовый объект может не содержать встроенных нулевых байтов; если это так, функция возвращает ``-1`` и возникает ошибка :exc:`ValueError`.
sv: Om *length* är ``NULL`` får bytesobjektet inte innehålla inbäddade nullbytes; om det gör det returnerar funktionen ``-1`` och ett :exc:`ValueError`` uppstår.
uk: Якщо *length* дорівнює ``NULL``, об’єкт bytes може не містити вбудованих нульових байтів; якщо це так, функція повертає ``-1`` і викликає :exc:`ValueError`.

source: The buffer refers to an internal buffer of *obj*, which includes an additional null byte at the end (not counted in *length*). The data must not be modified in any way, unless the object was just created using ``PyBytes_FromStringAndSize(NULL, size)``. It must not be deallocated. If *obj* is not a bytes object at all, :c:func:`PyBytes_AsStringAndSize` returns ``-1`` and raises :exc:`TypeError`.
es_es: El búfer hace referencia a un búfer interno de *obj*, que incluye un byte nulo adicional al final (no se cuenta en *length*). Los datos no deben modificarse de ninguna manera, a menos que el objeto se acabe de crear usando ``PyBytes_FromStringAndSize(NULL, size)``. No debe desasignarse. Si *obj* no es un objeto de bytes en absoluto,:c:func:`PyBytes_AsStringAndSize` devuelve ``-1`` e incrementa :exc:`TypeError`.
ru: Буфер относится к внутреннему буферу *obj*, который включает в себя дополнительный нулевой байт в конце (не учитываемый в *length*). Данные не должны быть изменены каким-либо образом, если только объект не был только что создан с использованием ``PyBytes_FromStringAndSize(NULL, size)``. Он не должен быть освобожден. Если *obj* вообще не является байтовым объектом, :c:func:`PyBytes_AsStringAndSize` возвращает ``-1`` и вызывает :exc:`TypeError`.
sv: Bufferten hänvisar till en intern buffert i *obj*, som innehåller en extra null-byte i slutet (räknas inte in i *length*). Data får inte ändras på något sätt, såvida inte objektet precis skapades med ``PyBytes_FromStringAndSize(NULL, size)``. Det får inte deallokeras. Om *obj* inte alls är ett bytesobjekt, returnerar :c:func:`PyBytes_AsStringAndSize` ``-1`` och ger upphov till :exc:`TypeError`.
uk: Буфер відноситься до внутрішнього буфера *obj*, який містить додатковий нульовий байт у кінці (не враховується в *довжині*). Дані не можна змінювати жодним чином, якщо об’єкт не було щойно створено за допомогою ``PyBytes_FromStringAndSize(NULL, size)``. Його не можна звільняти. Якщо *obj* взагалі не є об’єктом bytes, :c:func:`PyBytes_AsStringAndSize` повертає ``-1`` і викликає :exc:`TypeError`.

source: Previously, :exc:`TypeError` was raised when embedded null bytes were encountered in the bytes object.
es_es: Anteriormente, se generaba :exc:`TypeError` cuando se encontraron bytes nulos incrustados en el objeto de bytes.
ru: Ранее :exc:`TypeError` вызывался, когда в байтовом объекте обнаруживались встроенные нулевые байты.
sv: Tidigare skapades :exc:`TypeError` när inbäddade null-bytes påträffades i bytes-objektet.
uk: Раніше :exc:`TypeError` виникало, коли в об’єкті bytes зустрічалися вбудовані нульові байти.

source: Create a new bytes object in *\*bytes* containing the contents of *newpart* appended to *bytes*; the caller will own the new reference. The reference to the old value of *bytes* will be stolen. If the new object cannot be created, the old reference to *bytes* will still be discarded and the value of *\*bytes* will be set to ``NULL``; the appropriate exception will be set.
es_es: Cree un nuevo objeto de bytes en *\*bytes* que contenga el contenido de *newpart* anexado a *bytes*; caller será propietaria de la nueva referencia. Tomará la referencia del valor antiguo de *bytes*. Si no se puede crear el nuevo objeto, la antigua referencia a *bytes* se descartará y el valor de *\*bytes* se establecerá en ``NULL``; se establecerá la excepción apropiada.
ru: Создает новый байтовый объект в *\*bytes*, содержащий содержимое *newpart*, добавленное к *bytes*; вызывающий объект будет владеть новой ссылкой. Ссылка на старое значение *bytes* будет украдена. Если новый объект не может быть создан, старая ссылка на *bytes* все равно будет удалена, а для значения *\*bytes* будет установлено значение ``NULL``; будет установлено соответствующее исключение.
sv: Skapa ett nytt bytesobjekt i *\*bytes* som innehåller innehållet i *newpart* som lagts till *bytes*; den som anropar kommer att äga den nya referensen. Referensen till det gamla värdet av *bytes* kommer att stjälas. Om det nya objektet inte kan skapas, kommer den gamla referensen till *bytes* ändå att kasseras och värdet på *\*bytes* kommer att sättas till ``NULL``; lämpligt undantag kommer att sättas.
uk: Створіть новий об’єкт bytes у *\*bytes*, що містить вміст *newpart*, доданий до *bytes*; абонент буде володіти новим посиланням. Посилання на старе значення *bytes* буде викрадено. Якщо новий об’єкт неможливо створити, старе посилання на *bytes* все одно буде відкинуто, а значення *\*bytes* буде встановлено на ``NULL``; буде встановлено відповідний виняток.

source: Create a new bytes object in *\*bytes* containing the contents of *newpart* appended to *bytes*. This version releases the :term:`strong reference` to *newpart* (i.e. decrements its reference count).
es_es: Crea un nuevo objeto bytes en *\*bytes* que contiene el contenido de *newpart* añadido a *bytes*. Esta versión libera la referencia :term:`strong` a *newpart* (es decir, decrementa su cuenta de referencias).
ru: Создайте новый объект bytes в *\*bytes*, содержащий содержимое *newpart*, добавленное к *bytes*. Эта версия освобождает :term:`strong ссылку` на *newpart* (т.е. уменьшает ее счетчик ссылок).
sv: Skapa ett nytt bytesobjekt i *\*bytes* som innehåller innehållet i *newpart* tillagt *bytes*. Denna version släpper :term:`strong reference` till *newpart* (dvs. minskar dess referensantal).

source: Similar to ``sep.join(iterable)`` in Python.
sv: Liknar ``sep.join(iterable)`` i Python.

source: *sep* must be Python :class:`bytes` object. (Note that :c:func:`PyUnicode_Join` accepts ``NULL`` separator and treats it as a space, whereas :c:func:`PyBytes_Join` doesn't accept ``NULL`` separator.)
sv: *sep* måste vara ett Python :class:`bytes`\ -objekt. (Observera att :c:func:`PyUnicode_Join` accepterar ``NULL`` separator och behandlar det som ett mellanslag, medan :c:func:`PyBytes_Join` inte accepterar ``NULL`` separator)
