Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/bytes.po
Languages: es_es, ru, sv, uk

source: *iterable* must be an iterable object yielding objects that implement the :ref:`buffer protocol <bufferobjects>`.
sv: *iterable* måste vara ett iterabelt objekt som ger objekt som implementerar :ref:`buffer protocol <bufferobjects>`.

source: On success, return a new :class:`bytes` object. On error, set an exception and return ``NULL``.
sv: Vid framgång returneras ett nytt :class:`bytes`\ -objekt. Vid fel, ange ett undantag och returnera ``NULL``.

source: Resize a bytes object. *newsize* will be the new length of the bytes object. You can think of it as creating a new bytes object and destroying the old one, only more efficiently. Pass the address of an existing bytes object as an lvalue (it may be written into), and the new size desired. On success, *\*bytes* holds the resized bytes object and ``0`` is returned; the address in *\*bytes* may differ from its input value. If the reallocation fails, the original bytes object at *\*bytes* is deallocated, *\*bytes* is set to ``NULL``, :exc:`MemoryError` is set, and ``-1`` is returned.
sv: Ändra storlek på ett bytes-objekt. *newsize* blir den nya längden på bytesobjektet. Du kan tänka på det som att skapa ett nytt bytes-objekt och förstöra det gamla, fast mer effektivt. Skicka adressen till ett befintligt bytes-objekt som ett l-värde (det kan skrivas in i det) och den nya önskade storleken. Vid framgång innehåller *\*bytes* det storleksförändrade bytesobjektet och ``0`` returneras; adressen i *\*bytes* kan skilja sig från dess ingångsvärde. Om omallokeringen misslyckas, avallokeras det ursprungliga bytesobjektet i *\*bytes*, *\*bytes* sätts till ``NULL``, :exc:`MemoryError` sätts och ``-1`` returneras.

source: object
es_es: objeto
ru: объект
sv: objekt

source: bytes
ru: байт
sv: byte

source: unsigned long
es_es: int sin firmar
uk: беззнаковий довгий

source: A way to resize a bytes object even though it is "immutable". Only use this to build up a brand new bytes object; don't use this if the bytes may already be known in other parts of the code. It is an error to call this function if the refcount on the input bytes object is not one. Pass the address of an existing bytes object as an lvalue (it may be written into), and the new size desired. On success, *\*bytes* holds the resized bytes object and ``0`` is returned; the address in *\*bytes* may differ from its input value. If the reallocation fails, the original bytes object at *\*bytes* is deallocated, *\*bytes* is set to ``NULL``, :exc:`MemoryError` is set, and ``-1`` is returned.
es_es: Una forma de cambiar el tamaño de un objeto de bytes aunque sea "inmutable". Solo use esto para construir un objeto de bytes completamente nuevo; no use esto si los bytes ya se conocen en otras partes del código. Es un error llamar a esta función si el refcount en el objeto de bytes de entrada no es uno. Pasar la dirección de un objeto de bytes existente como un valor l (puede escribirse en él) y el nuevo tamaño deseado. En caso de éxito, *\*bytes* contiene el objeto de bytes redimensionado y se devuelve ``0`` la dirección en *\*bytes* puede diferir de su valor de entrada. Si la reasignación falla, el objeto de bytes original en *\*bytes* se desasigna, *\*bytes* se establece en ``NULL``, :exc:`MemoryError` se establece en ``-1`` y se devuelve.
ru: Способ изменить размер байтового объекта, даже если он "неизменяем". Используйте это только для создания совершенно нового байтового объекта; не используйте это, если байты уже могут быть известны в других частях кода. Вызов этой функции приводит к ошибке, если значение refcount для входного байтового объекта не равно единице. Передайте адрес существующего байтового объекта в качестве значения lvalue (оно может быть записано в) и желаемый новый размер. В случае успеха *\*bytes* содержит байтовый объект измененного размера и возвращается значение ``0``; адрес в *\*bytes* может отличаться от его входного значения. Если перераспределение завершается неудачей, исходный байтовый объект в *\*bytes* освобождается, *\*bytes* присваивается значение ``NULL``, устанавливается значение :exc:`MemoryError` и возвращается значение ``-1``.
uk: Спосіб змінити розмір об'єкта bytes, навіть якщо він "незмінний". Використовуйте це лише для створення абсолютно нового об’єкта bytes; не використовуйте це, якщо байти можуть бути вже відомі в інших частинах коду. Виклик цієї функції буде помилковим, якщо refcount для об’єкта вхідних байтів не один. Передайте адресу існуючого об’єкта bytes як lvalue (його можна записати) і новий бажаний розмір. У разі успіху *\*bytes* містить змінений об’єкт байтів і повертає ``0``; адреса в *\*байтах* може відрізнятися від введеного значення. Якщо перерозподіл не вдається, вихідний об’єкт bytes у *\*bytes* звільняється, *\*bytes* встановлюється на ``NULL``, встановлюється :exc:`MemoryError` і повертається ``-1`` .

source: *n/a*
uk: *немає*

source: long
uk: довгота

source: Return the null-terminated contents of the object *obj* through the output variables *buffer* and *length*.
uk: Повертає нульовий вміст об’єкта *obj* через вихідні змінні *buffer* і *length*.
