Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/capsule.po
Languages: es_es, ru, sv

source: Capsules
es_es: Cápsulas
ru: Оболочки
sv: Kapslar

source: Refer to :ref:`using-capsules` for more information on using these objects.
es_es: Consultar :ref:`using-capsules` para obtener más información sobre el uso de estos objetos.
ru: Более подробную информацию об использовании этих объектов см. по адресу :ref:`using-capsules`.
sv: Se :ref:`using-capsules` för mer information om hur du använder dessa objekt.

source: This subtype of :c:type:`PyObject` represents an opaque value, useful for C extension modules who need to pass an opaque value (as a :c:expr:`void*` pointer) through Python code to other C code. It is often used to make a C function pointer defined in one module available to other modules, so the regular import mechanism can be used to access C APIs defined in dynamically loaded modules.
es_es: Este subtipo de :c:type:`PyObject` representa un valor opaco, útil para módulos de extensión C que necesitan pasar un valor opaco (como un puntero :c:expr:`void*` ) a través de código Python a otro código C. A menudo se utiliza para hacer que un puntero de función C definido en un módulo esté disponible para otros módulos, de modo que el mecanismo de importación normal pueda utilizarse para acceder a APIs C definidas en módulos cargados dinámicamente.
ru: Этот подтип :c:type:` PyObject` представляет собой непрозрачное значение, полезное для модулей расширения C, которым необходимо передать непрозрачное значение (как указатель :c:expr:`void*`) через код Python в другой код C. . Он часто используется для того, чтобы сделать указатель на функцию C, определенный в одном модуле, доступным для других модулей, поэтому обычный механизм импорта можно использовать для доступа к API C, определенным в динамически загружаемых модулях.
sv: Denna subtyp av :c:type:`PyObject` representerar ett opakt värde, användbart för C-tilläggsmoduler som behöver skicka ett opakt värde (som en :c:expr:`void*`-pekare) genom Python-kod till annan C-kod. Det används ofta för att göra en C-funktionspekare som definieras i en modul tillgänglig för andra moduler, så att den vanliga importmekanismen kan användas för att komma åt C API:er som definieras i dynamiskt laddade moduler.

source: The type of a destructor callback for a capsule. Defined as::
es_es: El tipo de una devolución de llamada destructor para una cápsula. Definido como::
ru: Тип обратного вызова деструктора для капсулы. Определяется как::
sv: Typen av ett destruktoranrop för en kapsel. Definierad som::

source: See :c:func:`PyCapsule_New` for the semantics of PyCapsule_Destructor callbacks.
es_es: ver :c:func:`PyCapsule_New` por la semántica de PyCapsule_Destructor callbacks.
ru: См. :c:func:`PyCapsule_New`для семантику обратных вызовов PyCapsule_Destructor.
sv: Se :c:func:`PyCapsule_New` för semantiken för PyCapsule_Destructor callbacks.

source: Return true if its argument is a :c:type:`PyCapsule`. This function always succeeds.
es_es: Devuelve verdadero si su argumento es un :c:type:`PyCapsule`. Esta función siempre tiene éxito.
ru: вернуть истину, если его аргумент является :c:type:`PyCapsule`. Этот функция всегда успешна.
sv: Returnerar true om dess argument är en :c:type:`PyCapsule`. Denna funktion lyckas alltid.

source: Create a :c:type:`PyCapsule` encapsulating the *pointer*. The *pointer* argument may not be ``NULL``.
es_es: Crear un :c:type:`PyCapsule` encapsulando el *puntero*. El argumento *puntero* puede no ser ``NULL``.
ru: создать :c:type:`PyCapsule` , содержащий *указатель*. Аргкмент *указателя* аргумент не может быть ``NULL``.
sv: Skapa en :c:type:`PyCapsule` som kapslar in *pekaren*. Argumentet *pekare* får inte vara ``NULL``.

source: On failure, set an exception and return ``NULL``.
es_es: En caso de fallo, establecer una excepción y devuelve ``NULL``.
ru: В случае неудачи установите исключение и верните . ``NULL`` .
sv: Vid misslyckande, sätt ett undantag och returnera ``NULL``.

source: The *name* string may either be ``NULL`` or a pointer to a valid C string. If non-``NULL``, this string must outlive the capsule. (Though it is permitted to free it inside the *destructor*.)
es_es: La cadena *nombre* puede ser ``NULL`` o un puntero a una cadena C válida. Si no es-``NULL``, esta cadena debe seguir más tiempo en memoria. (Aunque está permitido liberarlo dentro de *destructor*.)
ru: Строка *name* может иметь значение NULL или указатель на действительную строку C. Если значение не NULL, эта строка должна пережить капсулу. (Хотя его можно освободить внутри *деструктора*.)
sv: Strängen *name* kan antingen vara ``NULL`` eller en pekare till en giltig C-sträng. Om den inte är ``NULL`` måste denna sträng överleva kapseln. (Det är dock tillåtet att frigöra den i *destructor*.)

source: If the *destructor* argument is not ``NULL``, it will be called with the capsule as its argument when it is destroyed.
es_es: Si el argumento *destructor* no es ``NULL``, se llamará con la cápsula como argumento cuando se destruya.
ru: Если аргумент *destructor* не равен NULL, он будет вызван с капсулой в качестве аргумента при ее уничтожении.
sv: Om argumentet *destructor* inte är ``NULL``, kommer den att anropas med kapseln som argument när den förstörs.

source: If this capsule will be stored as an attribute of a module, the *name* should be specified as ``modulename.attributename``. This will enable other modules to import the capsule using :c:func:`PyCapsule_Import`.
es_es: Si esta cápsula se almacenara como un atributo de un módulo, el *nombre* debe especificarse como ``modulename.attributename``. Esto permitirá que otros módulos importen la cápsula usando :c:func:`PyCapsule_Import`.
ru: Если эта капсула будет храниться как атрибут модуля, *имя* должно быть указано как ``имя_модуля.имя_атрибута``. Это позволит другим модулям импортировать капсулу с помощью :c:func:`PyCapsule_Import`.
sv: Om denna kapsel skall lagras som ett attribut i en modul, skall *namnet* anges som ``modulename.attributename``. Detta gör det möjligt för andra moduler att importera kapseln med hjälp av :c:func:`PyCapsule_Import`.

source: Retrieve the *pointer* stored in the capsule. On failure, set an exception and return ``NULL``.
es_es: Recuperar el *puntero* almacenado en la cápsula. En caso de fallo, establecer una excepción y regresar ``NULL``.
ru: Получите *указатель*, хранящийся в капсуле. В случае неудачи установите исключение и верните ``NULL``.
sv: Hämtar *pekaren* som finns lagrad i kapseln. Vid misslyckande, sätt ett undantag och returnera ``NULL``.

source: The *name* parameter must compare exactly to the name stored in the capsule. If the name stored in the capsule is ``NULL``, the *name* passed in must also be ``NULL``. Python uses the C function :c:func:`!strcmp` to compare capsule names.
es_es: El parámetro *name* debe compararse exactamente con el nombre almacenado en la cápsula. Si el nombre almacenado en la cápsula es ``NULL``, el *name* pasado también debe ser ``NULL``. Python utiliza la función C :c:func:`!strcmp` para comparar los nombres de las cápsulas.
ru: Параметр *name* должен точно соответствовать имени, хранящемуся в капсуле. Если имя, хранящееся в капсуле, равно NULL, переданное *name* также должно быть NULL. Python использует функцию C :c:func:`!strcmp` для сравнения имен капсул.
sv: Parametern *name* måste jämföras exakt med det namn som lagrats i kapseln. Om namnet som lagras i kapseln är ``NULL``, måste *name* som skickas in också vara ``NULL``. Python använder C-funktionen :c:func:`!strcmp` för att jämföra kapselnamn.

source: Return the current destructor stored in the capsule. On failure, set an exception and return ``NULL``.
es_es: Devuelve el destructor actual almacenado en la cápsula.. En caso de fallo, establecer una excepción y devolver ``NULL``.
ru: Вернуть текущий деструктор, хранящийся в капсуле. В случае сбоя установить исключение и выполнить возврат ``NULL``.
sv: Returnerar den aktuella destruktorn som finns lagrad i kapseln. Vid misslyckande, sätt ett undantag och returnera ``NULL``.

source: It is legal for a capsule to have a ``NULL`` destructor. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
es_es: Es legal que una cápsula tenga un destructor ``NULL``. TEsto hace que un código de retorno ``NULL`` sea algo ambiguo; usar :c:func:`PyCapsule_IsValid` o :c:func:`PyErr_Occurred` para eliminar la ambigüedad.
ru: Капсула может иметь деструктор ``NULL``. Это делает код возврата NULL несколько двусмысленным; используйте :c:func:`PyCapsule_IsValid` или :c:func:`PyErr_Occurred` для устранения неоднозначности.
sv: Det är lagligt för en kapsel att ha en ``NULL`` destruktor. Detta gör att en ``NULL`` returkod är något tvetydig; använd :c:func:`PyCapsule_IsValid` eller :c:func:`PyErr_Occurred` för att reda ut det.

source: Return the current context stored in the capsule. On failure, set an exception and return ``NULL``.
es_es: Devuelve el destructor actual almacenado en la cápsula. En caso de fallo, establecer una excepción y devolver ``NULL``.
ru: Вернуть текущий контекст, хранящийся в капсуле. В случае неудачи установите исключение и верните ``NULL``.
sv: Returnerar det aktuella sammanhanget som lagrats i kapseln. Vid misslyckande anges ett undantag och ``NULL`` returneras.

source: It is legal for a capsule to have a ``NULL`` context. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
es_es: Es legal que una cápsula tenga un contexto ``NULL``. Esto hace que un código de retorno ``NULL`` sea algo ambiguo; usar :c:func:`PyCapsule_IsValid` o :c:func:`PyErr_Occurred` para eliminar la ambigüedad.
ru: Для капсулы допустимо иметь контекст ``NULL``. Это делает код возврата NULL несколько двусмысленным; используйте :c:func:`PyCapsule_IsValid` или :c:func:`PyErr_Occurred` для устранения неоднозначности.
sv: Det är lagligt för en kapsel att ha en ``NULL`` kontext. Detta gör att en ``NULL`` returkod är något tvetydig; använd :c:func:`PyCapsule_IsValid` eller :c:func:`PyErr_Occurred` för att reda ut det.

source: Return the current name stored in the capsule. On failure, set an exception and return ``NULL``.
es_es: Devuelve el nombre actual almacenado en la cápsula. En caso de fallo, establece una excepción y devuelve ``NULL``.
ru: Вернуть текущее имя, хранящееся в капсуле. В случае неудачи установите исключение и верните ``NULL``.
sv: Returnerar det aktuella namnet som lagrats i kapseln. Vid misslyckande, sätt ett undantag och returnera ``NULL``.

source: It is legal for a capsule to have a ``NULL`` name. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
es_es: Es legal que una cápsula tenga un nombre ``NULL``. Esto hace que un código de retorno ``NULL`` sea algo ambiguo; usar :c:func:`PyCapsule_IsValid` o :c:func:`PyErr_Occurred` para eliminar la ambigüedad.
ru: Капсуле разрешено иметь имя NULL. Это делает код возврата NULL несколько двусмысленным; используйте :c:func:`PyCapsule_IsValid` или :c:func:`PyErr_Occurred` для устранения неоднозначности.
sv: Det är lagligt för en kapsel att ha ett ``NULL`` namn. Detta gör att en ``NULL`` returkod är något tvetydig; använd :c:func:`PyCapsule_IsValid` eller :c:func:`PyErr_Occurred` för att reda ut det.

source: Import a pointer to a C object from a capsule attribute in a module. The *name* parameter should specify the full name to the attribute, as in ``module.attribute``. The *name* stored in the capsule must match this string exactly.
es_es: Importa un puntero a un objeto C desde un atributo cápsula en un módulo. El parámetro *name* debe especificar el nombre completo del atributo, como en ``module.attribute``. El *nombre* almacenado en la cápsula debe coincidir exactamente con esta cadena.
ru: Импортируйте указатель на объект C из атрибута капсулы в модуле. Параметр *name* должен указывать полное имя атрибута, как в ``module.attribute``. *имя*, хранящееся в капсуле, должно точно соответствовать этой строке.
sv: Importerar en pekare till ett C-objekt från ett kapselattribut i en modul. Parametern *name* bör ange det fullständiga namnet på attributet, som i ``module.attribute``. Det *namn* som lagras i kapseln måste matcha denna sträng exakt.

source: Return the capsule's internal *pointer* on success. On failure, set an exception and return ``NULL``.
es_es: Devuelve el *puntero* interno de la cápsula en caso de éxito. En caso de error, establezer una excepción y regresar ``NULL``.
ru: В случае успеха вернуть внутренний *указатель* капсулы. В случае неудачи установите исключение и верните ``NULL``.
sv: Returnerar kapselns interna *pekare* vid framgång. Vid misslyckande, sätt ett undantag och returnera ``NULL``.

source: *no_block* has no effect anymore.
es_es: *no_block* ya no tiene efecto.
ru: *no_block* больше не имеет никакого эффекта.
sv: *no_block* har ingen effekt längre.

source: Determines whether or not *capsule* is a valid capsule. A valid capsule is non-``NULL``, passes :c:func:`PyCapsule_CheckExact`, has a non-``NULL`` pointer stored in it, and its internal name matches the *name* parameter. (See :c:func:`PyCapsule_GetPointer` for information on how capsule names are compared.)
es_es: Determina si *capsule* es o no una cápsula válida. Una cápsula válida no es -``NULL``, pasar :c:func:`PyCapsule_CheckExact`, tiene un puntero que no es ``NULL`` almacenado y su nombre interno coincide con el parámetro *name*. (Consultar :c:func:`PyCapsule_GetPointer` para información de cómo comparar los nombres de las cápsulas).
ru: Определяет, является ли *capsule* допустимой капсулой. Действительная капсула не NULL, передает :c:func:PyCapsule_CheckExact, содержит указатель, отличный от NULL, и ее внутреннее имя соответствует параметру *name*. (См. :c:func:`PyCapsule_GetPointer` для получения информации о том, как сравниваются имена капсул.)
sv: Avgör om *capsule* är en giltig kapsel eller inte. En giltig kapsel är inte ``NULL``, klarar :c:func:`PyCapsule_CheckExact`, har en pekare som inte är ``NULL`` lagrad i den och dess interna namn matchar parametern *name*. (Se :c:func:`PyCapsule_GetPointer` för information om hur kapselnamn jämförs)

source: In other words, if :c:func:`PyCapsule_IsValid` returns a true value, calls to any of the accessors (any function starting with ``PyCapsule_Get``) are guaranteed to succeed.
es_es: En otras palabras, si :c:func:`PyCapsule_IsValid` devuelve un valor verdadero, las llamadas a cualquiera de los accesores (cualquier función que empiece por ``PyCapsule_Get``) tienen garantizado el éxito.
ru: Другими словами, если :c:func:`PyCapsule_IsValid` возвращает истинное значение, вызов любого из методов доступа (любой функции, начинающейся с ``PyCapsule_Get``) гарантированно будет успешным.
sv: Med andra ord, om :c:func:`PyCapsule_IsValid` returnerar ett sant värde, kommer anrop till någon av accessorerna (alla funktioner som börjar med ``PyCapsule_Get``) garanterat att lyckas.

source: Return a nonzero value if the object is valid and matches the name passed in. Return ``0`` otherwise. This function will not fail.
es_es: Devuelve un valor distinto de cero si el objeto es válido y coincide con el nombre pasado. De lo contrario, devuelve ``0``. Esta función no fallará.
ru: Возвращайте ненулевое значение, если объект действителен и соответствует переданному имени. В противном случае верните ``0``. Эта функция не подведет.
sv: Returnerar ett värde som inte är noll om objektet är giltigt och matchar namnet som skickades in. Returnerar annars ``0``. Denna funktion kommer inte att misslyckas.

source: Set the context pointer inside *capsule* to *context*.
es_es: Establecer el puntero de contexto dentro de *cápsula* en *contexto*.
ru: Установите указатель контекста внутри *capsule* на *context*.
sv: Ställ in kontextpekaren i *capsule* till *context*.

source: Return ``0`` on success. Return nonzero and set an exception on failure.
es_es: Devuelve ``0`` en caso de éxito. Devuelve distinto de cero y establece una excepción en caso de fallo.
ru: Верните ``0`` в случае успеха. Верните ненулевое значение и установите исключение в случае сбоя.
sv: Returnera ``0`` vid framgång. Returnerar icke-noll och sätter ett undantag vid misslyckande.

source: Set the destructor inside *capsule* to *destructor*.
es_es: Establecer el destructor dentro de *cápsula* en *destructor*.
ru: Установите деструктор внутри *capsule* на *destructor*.
sv: Ställ in destruktorn inuti *capsule* till *destructor*.

source: Set the name inside *capsule* to *name*. If non-``NULL``, the name must outlive the capsule. If the previous *name* stored in the capsule was not ``NULL``, no attempt is made to free it.
es_es: Establecer el nombre dentro de *cápsula* en *nombre*. Si no es -``NULL``, el nombre debe sobrevivir a la cápsula. Si el *nombre* anterior almacenado en la capsular no era ``NULL``, no se intenta liberarlo.
ru: Установите имя внутри *capsule* на *name*. Если значение не NULL, имя должно пережить капсулу. Если предыдущее *имя*, хранящееся в капсуле, не было NULL, попытки освободить его не предпринимаются.
sv: Ställ in namnet inuti *kapsel* till *namn*. Om det inte är ``NULL`` måste namnet överleva kapseln. Om det tidigare *namn* som lagrades i kapseln inte var ``NULL``, görs inget försök att frigöra det.

source: Set the void pointer inside *capsule* to *pointer*. The pointer may not be ``NULL``.
es_es: Establecer el puntero vacío dentro de *cápsula* en *puntero*. El puntero puede no estar ``NULL``.
ru: Установите указатель void внутри *capsule* на *pointer*. Указатель не может быть NULL.
sv: Ställ in void-pekaren inuti *capsule* till *pointer*. Pekaren får inte vara ``NULL``.

source: object
es_es: objeto
ru: объект

source: Capsule
es_es: Cápsula
ru: Капсула
sv: Kapsel
