Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/code.po
Languages: es_es, ru, uk

source: Code Objects
es_es: Objetos código
ru: Объекты кода
uk: Об'єкти коду

source: Code objects are a low-level detail of the CPython implementation. Each one represents a chunk of executable code that hasn't yet been bound into a function.
es_es: Los objetos de código son un detalle de bajo nivel de la implementación de CPython. Cada uno representa un fragmento de código ejecutable que aún no se ha vinculado a una función.
ru: Объекты кода — это низкоуровневая деталь реализации CPython. Каждый из них представляет собой фрагмент исполняемого кода, который еще не связан с функцией.
uk: Об’єкти коду є низькорівневими деталями реалізації CPython. Кожен з них представляє фрагмент виконуваного коду, який ще не прив’язано до функції.

source: The C structure of the objects used to describe code objects. The fields of this type are subject to change at any time.
es_es: La estructura C de los objetos utilizados para describir objetos de código. Los campos de este tipo están sujetos a cambios en cualquier momento.
ru: Структура C объектов, используемых для описания объектов кода. Поля этого типа могут быть изменены в любое время.
uk: Структура C об’єктів, яка використовується для опису об’єктів коду. Поля цього типу можуть бути змінені в будь-який час.

source: This is an instance of :c:type:`PyTypeObject` representing the Python :ref:`code object <code-objects>`.
es_es: Se trata de una instancia de :c:type:`PyTypeObject` que representa el objeto :ref:`code <code-objects>` de Python.
ru: Это экземпляр :c:type:`PyTypeObject`, представляющий объект кода Python <code-objects>`.

source: Return true if *co* is a :ref:`code object <code-objects>`. This function always succeeds.
es_es: Devuelve verdadero si *co* es un objeto :ref:`code <code-objects>`. Esta función siempre tiene éxito.
ru: Возвращает true, если *co* является :ref:`объектом кода <code-objects>`. Эта функция всегда завершается успешно.

source: Return the number of free variables in a code object.
ru: Возвращает количество свободных переменных в объекте кода.

source: Return the position of the first free variable in a code object.
ru: Возвращает позицию первой свободной переменной в объекте кода.

source: Return a new code object. If you need a dummy code object to create a frame, use :c:func:`PyCode_NewEmpty` instead.
es_es: Devuelve un nuevo objeto de código. Si necesita un objeto de código ficticio para crear un marco, utilice :c:func:`PyCode_NewEmpty` en su lugar.
ru: Верните новый объект кода. Если вам нужен фиктивный объект кода для создания фрейма, используйте вместо него :c:func:`PyCode_NewEmpty`.

source: Since the definition of the bytecode changes often, calling :c:func:`PyUnstable_Code_New` directly can bind you to a precise Python version.
es_es: Dado que la definición del código de bytes cambia a menudo, llamar directamente a :c:func:`PyUnstable_Code_New` puede vincularte a una versión precisa de Python.
ru: Поскольку определение байт-кода часто меняется, прямой вызов :c:func:`PyUnstable_Code_New` может привязать вас к точной версии Python.

source: The many arguments of this function are inter-dependent in complex ways, meaning that subtle changes to values are likely to result in incorrect execution or VM crashes. Use this function only with extreme care.
es_es: Los numerosos argumentos de esta función son interdependientes de forma compleja, lo que significa que cambios sutiles en los valores pueden provocar una ejecución incorrecta o fallos de la máquina virtual. Utilice esta función sólo con extremo cuidado.
ru: Многие аргументы этой функции сложным образом взаимозависимы, а это означает, что незначительные изменения значений могут привести к неправильному выполнению или сбою виртуальной машины. Используйте эту функцию только с особой осторожностью.

source: Added ``qualname`` and ``exceptiontable`` parameters.
es_es: Añadidos los parámetros ``qualname`` y ``exceptiontable``.
ru: Добавлены параметры Qualname иExceptiontable.

source: Renamed from ``PyCode_New`` as part of :ref:`unstable-c-api`. The old name is deprecated, but will remain available until the signature changes again.
es_es: Renombrado de ``PyCode_New`` como parte de :ref:`unstable-c-api`. El nombre antiguo está obsoleto, pero seguirá disponible hasta que la firma vuelva a cambiar.
ru: Переименован из PyCode_New как часть :ref:`unstable-c-api`. Старое имя устарело, но останется доступным до тех пор, пока подпись не изменится снова.

source: Similar to :c:func:`PyUnstable_Code_New`, but with an extra "posonlyargcount" for positional-only arguments. The same caveats that apply to ``PyUnstable_Code_New`` also apply to this function.
es_es: Similar a :c:func:`PyUnstable_Code_New`, pero con un "posonlyargcount" extra para argumentos de sólo posición. Las mismas advertencias que se aplican a ``PyUnstable_Code_New`` también se aplican a esta función.
ru: Аналогично :c:func:`PyUnstable_Code_New`, но с дополнительным «posonlyargcount» для позиционных аргументов. К этой функции применимы те же предостережения, что и к PyUnstable_Code_New.

source: as ``PyCode_NewWithPosOnlyArgs``
es_es: como ``PyCode_NewWithPosOnlyArgs``
ru: как ``PyCode_NewWithPosOnlyArgs``

source: Added ``qualname`` and ``exceptiontable`` parameters.
es_es: Añadidos los parámetros ``qualname`` y ``exceptiontable``.
ru: Добавлены параметры Qualname иExceptiontable.

source: Renamed to ``PyUnstable_Code_NewWithPosOnlyArgs``. The old name is deprecated, but will remain available until the signature changes again.
es_es: Se ha cambiado el nombre a ``PyUnstable_Code_NewWithPosOnlyArgs``. El nombre antiguo está obsoleto, pero seguirá disponible hasta que la firma vuelva a cambiar.
ru: Переименован в PyUnstable_Code_NewWithPosOnlyArgs. Старое имя устарело, но останется доступным до тех пор, пока подпись не изменится снова.

source: Return a new empty code object with the specified filename, function name, and first line number. The resulting code object will raise an ``Exception`` if executed.
es_es: Devuelve un nuevo objeto de código vacío con el nombre de archivo, el nombre de la función y el número de la primera línea especificados. El objeto de código resultante generará un ``Exception`` si se ejecuta.
ru: Верните новый пустой объект кода с указанным именем файла, именем функции и номером первой строки. Результирующий объект кода вызовет исключение при выполнении.

source: Return the line number of the instruction that occurs on or before ``byte_offset`` and ends after it. If you just need the line number of a frame, use :c:func:`PyFrame_GetLineNumber` instead.
es_es: Devuelve el número de línea de la instrucción que ocurre en o antes de ``byte_offset`` y termina después de ella. Si sólo necesita el número de línea de una trama, utilice :c:func:`PyFrame_GetLineNumber` en su lugar.
ru: Возвращает номер строки инструкции, которая встречается до или перед ``byte_offset`` и заканчивается после нее. Если вам нужен только номер строки кадра, используйте вместо него :c:func:`PyFrame_GetLineNumber`.
uk: Повертає номер рядка інструкції, яка виникає до або перед ``byte_offset`` і закінчується після нього. Якщо вам потрібен лише номер рядка кадру, використовуйте натомість :c:func:`PyFrame_GetLineNumber`.

source: For efficiently iterating over the line numbers in a code object, use :pep:`the API described in PEP 626 <0626#out-of-process-debuggers-and-profilers>`.
es_es: Para iterar eficientemente sobre los números de línea en un objeto de código, utilice :pep:`la API descrita en PEP 626 <0626#out-of-process-debuggers-and-profilers>`.
ru: Для эффективного перебора номеров строк в объекте кода используйте :pep:`API, описанный в PEP 626 <0626#out-of-process-debuggers-and-profilers>`.

source: Sets the passed ``int`` pointers to the source code line and column numbers for the instruction at ``byte_offset``. Sets the value to ``0`` when information is not available for any particular element.
es_es: Establece los punteros ``int`` pasados a los números de línea y columna del código fuente para la instrucción en ``byte_offset``. Establece el valor a ``0`` cuando no hay información disponible para algún elemento en particular.
ru: Устанавливает переданные указатели ``int`` на номера строк и столбцов исходного кода для инструкции в ``byte_offset``. Устанавливает значение «0», когда информация недоступна для какого-либо конкретного элемента.

source: Returns ``1`` if the function succeeds and 0 otherwise.
es_es: Devuelve ``1`` si la función tiene éxito y 0 en caso contrario.
ru: Возвращает ``1``, если функция завершилась успешно, и 0 в противном случае.

source: Equivalent to the Python code ``getattr(co, 'co_code')``. Returns a strong reference to a :c:type:`PyBytesObject` representing the bytecode in a code object. On error, ``NULL`` is returned and an exception is raised.
es_es: Equivalente al código de Python ``getattr(co, 'co_code')``. Devuelve una referencia fuerte a un :c:type:`PyBytesObject` que representa el bytecode en un objeto de código. En caso de error, se devuelve ``NULL`` y se lanza una excepción.
ru: Эквивалент кода Python ``getattr(co, 'co_code')``. Возвращает сильную ссылку на :c:type:`PyBytesObject`, представляющий байт-код в объекте кода. В случае ошибки возвращается NULL и возникает исключение.

source: This ``PyBytesObject`` may be created on-demand by the interpreter and does not necessarily represent the bytecode actually executed by CPython. The primary use case for this function is debuggers and profilers.
es_es: Este ``PyBytesObject`` puede ser creado bajo demanda por el intérprete y no representa necesariamente el bytecode realmente ejecutado por CPython. El principal caso de uso de esta función son los depuradores y perfiladores.
ru: Этот PyBytesObject может быть создан интерпретатором по требованию и не обязательно представляет собой байт-код, фактически выполняемый CPython. Основной вариант использования этой функции — отладчики и профилировщики.

source: Equivalent to the Python code ``getattr(co, 'co_varnames')``. Returns a new reference to a :c:type:`PyTupleObject` containing the names of the local variables. On error, ``NULL`` is returned and an exception is raised.
es_es: Equivalente al código Python ``getattr(co, 'co_varnames')``. Devuelve una nueva referencia a un :c:type:`PyTupleObject` que contiene los nombres de las variables locales. En caso de error, se devuelve ``NULL`` y se lanza una excepción.
ru: Эквивалент кода Python ``getattr(co, 'co_varnames')``. Возвращает новую ссылку на :c:type:`PyTupleObject`, содержащую имена локальных переменных. В случае ошибки возвращается NULL и возникает исключение.

source: Equivalent to the Python code ``getattr(co, 'co_cellvars')``. Returns a new reference to a :c:type:`PyTupleObject` containing the names of the local variables that are referenced by nested functions. On error, ``NULL`` is returned and an exception is raised.
es_es: Equivalente al código Python ``getattr(co, 'co_cellvars')``. Devuelve una nueva referencia a :c:type:`PyTupleObject` que contiene los nombres de las variables locales a las que hacen referencia las funciones anidadas. En caso de error, se devuelve ``NULL`` y se lanza una excepción.
ru: Эквивалент кода Python ``getattr(co, 'co_cellvars')``. Возвращает новую ссылку на :c:type:`PyTupleObject`, содержащую имена локальных переменных, на которые ссылаются вложенные функции. В случае ошибки возвращается NULL и возникает исключение.

source: Equivalent to the Python code ``getattr(co, 'co_freevars')``. Returns a new reference to a :c:type:`PyTupleObject` containing the names of the free variables. On error, ``NULL`` is returned and an exception is raised.
ru: Эквивалент кода Python ``getattr(co, 'co_freevars')``. Возвращает новую ссылку на :c:type:`PyTupleObject`, содержащую имена свободных переменных. В случае ошибки возвращается NULL и возникает исключение.

source: Register *callback* as a code object watcher for the current interpreter. Return an ID which may be passed to :c:func:`PyCode_ClearWatcher`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
es_es: Registrar *callback* como observador de objetos de código para el intérprete actual. Devuelve un ID que puede pasarse a :c:func:`PyCode_ClearWatcher`. En caso de error (por ejemplo, no hay más IDs de observador disponibles), devuelve ``-1`` y establece una excepción.
ru: Зарегистрируйте *callback* в качестве наблюдателя за объектами кода для текущего интерпретатора. Возвращает идентификатор, который можно передать в :c:func:`PyCode_ClearWatcher`. В случае ошибки (например, больше нет доступных идентификаторов наблюдателей) верните ``-1`` и установите исключение.

source: Clear watcher identified by *watcher_id* previously returned from :c:func:`PyCode_AddWatcher` for the current interpreter. Return ``0`` on success, or ``-1`` and set an exception on error (e.g. if the given *watcher_id* was never registered.)
es_es: Borra el observador identificado por *watcher_id* devuelto previamente por :c:func:`PyCode_AddWatcher` para el intérprete actual. Devuelve ``0`` en caso de éxito, o ``-1`` y establece una excepción en caso de error (por ejemplo, si el *watcher_id* dado nunca fue registrado).
ru: Очистить наблюдатель, идентифицированный *watcher_id*, ранее возвращенный из :c:func:`PyCode_AddWatcher` для текущего интерпретатора. Возвращает ``0`` в случае успеха или ``-1`` и устанавливает исключение в случае ошибки (например, если данный *watcher_id* никогда не был зарегистрирован).

source: Enumeration of possible code object watcher events: - ``PY_CODE_EVENT_CREATE`` - ``PY_CODE_EVENT_DESTROY``
es_es: Enumeración de posibles eventos del vigilante de objetos de código: - ``PY_CODE_EVENT_CREATE`` - ``PY_CODE_EVENT_DESTROY``
ru: Перечисление возможных событий наблюдателя за объектами кода: - ``PY_CODE_EVENT_CREATE`` - ``PY_CODE_EVENT_DESTROY``

source: Type of a code object watcher callback function.
es_es: Tipo de una función de devolución de llamada del observador de objetos de código.
ru: Тип функции обратного вызова наблюдателя за объектом кода.

source: If *event* is ``PY_CODE_EVENT_CREATE``, then the callback is invoked after `co` has been fully initialized. Otherwise, the callback is invoked before the destruction of *co* takes place, so the prior state of *co* can be inspected.
ru: Если *event* равно ``PY_CODE_EVENT_CREATE``, обратный вызов вызывается после полной инициализации ``co`. В противном случае обратный вызов вызывается до того, как произойдет уничтожение *co*, поэтому можно проверить предыдущее состояние *co*.

source: If *event* is ``PY_CODE_EVENT_DESTROY``, taking a reference in the callback to the about-to-be-destroyed code object will resurrect it and prevent it from being freed at this time. When the resurrected object is destroyed later, any watcher callbacks active at that time will be called again.
es_es: Si *event* es ``PY_CODE_EVENT_DESTROY``, tomar una referencia en la llamada de retorno al objeto de código a punto de ser destruido lo resucitará y evitará que sea liberado en ese momento. Cuando el objeto resucitado sea destruido más tarde, cualquier llamada de retorno activa en ese momento será llamada de nuevo.
ru: Если *event* равно ``PY_CODE_EVENT_DESTROY``, использование ссылки в обратном вызове на объект кода, который вот-вот будет уничтожен, воскресит его и предотвратит его освобождение в данный момент. Когда воскрешенный объект будет позже уничтожен, все активные в тот момент обратные вызовы наблюдателя будут вызваны снова.

source: Users of this API should not rely on internal runtime implementation details. Such details may include, but are not limited to, the exact order and timing of creation and destruction of code objects. While changes in these details may result in differences observable by watchers (including whether a callback is invoked or not), it does not change the semantics of the Python code being executed.
es_es: Los usuarios de esta API no deben confiar en los detalles internos de implementación en tiempo de ejecución. Dichos detalles pueden incluir, entre otros, el orden y el momento exactos de creación y destrucción de objetos de código. Mientras que los cambios en estos detalles pueden resultar en diferencias observables por los observadores (incluyendo si una llamada de retorno es invocada o no), esto no cambia la semántica del código Python que está siendo ejecutado.
ru: Пользователи этого API не должны полагаться на детали реализации внутренней среды выполнения. Такие детали могут включать, помимо прочего, точный порядок и время создания и уничтожения объектов кода. Хотя изменения в этих деталях могут привести к различиям, наблюдаемым наблюдателями (в том числе к тому, вызывается ли обратный вызов или нет), это не меняет семантику исполняемого кода Python.

source: If the callback sets an exception, it must return ``-1``; this exception will be printed as an unraisable exception using :c:func:`PyErr_WriteUnraisable`. Otherwise it should return ``0``.
es_es: Si la llamada de retorno establece una excepción, debe devolver ``-1``; esta excepción se imprimirá como una excepción no calificable utilizando :c:func:`PyErr_WriteUnraisable`. En caso contrario, debe devolver ``0``.
ru: Если обратный вызов устанавливает исключение, он должен вернуть ``-1``; это исключение будет напечатано как невызываемое с использованием :c:func:`PyErr_WriteUnraisable`. В противном случае он должен вернуть ``0``.

source: There may already be a pending exception set on entry to the callback. In this case, the callback should return ``0`` with the same exception still set. This means the callback may not call any other API that can set an exception unless it saves and clears the exception state first, and restores it before returning.
es_es: Puede que ya haya una excepción pendiente al entrar en la llamada de retorno. En este caso, la llamada de retorno debe volver a ``0`` con la misma excepción todavía establecida. Esto significa que la llamada de retorno no puede llamar a ninguna otra API que pueda establecer una excepción a menos que guarde y borre el estado de excepción primero, y lo restaure antes de regresar.
ru: При входе в обратный вызов уже может быть установлено ожидающее исключение. В этом случае обратный вызов должен вернуть ``0`` с тем же самым установленным исключением. Это означает, что обратный вызов не может вызывать какой-либо другой API, который может установить исключение, если он сначала не сохранит и не очистит состояние исключения, а затем не восстановит его перед возвратом.

source: Extra information
es_es: Información adicional
ru: Дополнительная информация

source: To support low-level extensions to frame evaluation, such as external just-in-time compilers, it is possible to attach arbitrary extra data to code objects.
es_es: Para soportar extensiones de bajo nivel en la evaluación de tramas, como compiladores externos just-in-time, es posible adjuntar datos extra arbitrarios a los objetos de código.
ru: Для поддержки низкоуровневых расширений для оценки кадра, таких как внешние JIT-компиляторы, к объектам кода можно прикреплять произвольные дополнительные данные.

source: These functions are part of the unstable C API tier: this functionality is a CPython implementation detail, and the API may change without deprecation warnings.
es_es: Estas funciones forman parte del nivel inestable de la API de C: esta funcionalidad es un detalle de implementación de CPython, y la API puede cambiar sin advertencias de desaprobación.
ru: Эти функции являются частью нестабильного уровня C API: эта функциональность является деталью реализации CPython, и API может измениться без предупреждений об устаревании.

source: Return a new an opaque index value used to adding data to code objects.
ru: Возвращает новое непрозрачное значение индекса, используемое для добавления данных в объекты кода.

source: You generally call this function once (per interpreter) and use the result with ``PyCode_GetExtra`` and ``PyCode_SetExtra`` to manipulate data on individual code objects.
es_es: Generalmente se llama a esta función una vez (por intérprete) y se utiliza el resultado con ``PyCode_GetExtra`` y ``PyCode_SetExtra`` para manipular datos en objetos de código individuales.
ru: Обычно вы вызываете эту функцию один раз (для каждого интерпретатора) и используете результат с PyCode_GetExtra и PyCode_SetExtra для манипулирования данными в отдельных объектах кода.

source: If *free* is not ``NULL``: when a code object is deallocated, *free* will be called on non-``NULL`` data stored under the new index. Use :c:func:`Py_DecRef` when storing :c:type:`PyObject`.
es_es: Si *free* no es ``NULL``: cuando un objeto de código es desasignado, *free* será llamado sobre datos no``NULL`` almacenados bajo el nuevo índice. Utilice :c:func:`Py_DecRef` cuando almacene :c:type:`PyObject`.
ru: Если *free* не является ``NULL``: когда объект кода освобождается, *free* будет вызываться для данных, отличных от ``NULL``, хранящихся под новым индексом. Используйте :c:func:`Py_DecRef` при сохранении :c:type:` PyObj ect`.

source: as ``_PyEval_RequestCodeExtraIndex``
es_es: como ``_PyEval_RequestCodeExtraIndex``
ru: как ``_PyEval_RequestCodeExtraIndex``

source: Renamed to ``PyUnstable_Eval_RequestCodeExtraIndex``. The old private name is deprecated, but will be available until the API changes.
es_es: Renombrado a ``PyUnstable_Eval_RequestCodeExtraIndex``. El antiguo nombre privado está obsoleto, pero estará disponible hasta que cambie la API.
ru: Переименован в PyUnstable_Eval_RequestCodeExtraIndex. Старое частное имя устарело, но будет доступно до изменения API.

source: Set *extra* to the extra data stored under the given index. Return 0 on success. Set an exception and return -1 on failure.
es_es: Establece *extra* a los datos extra almacenados bajo el índice dado. Devuelve 0 en caso de éxito. Establece una excepción y devuelve -1 en caso de fallo.
ru: Установите *extra* для дополнительных данных, хранящихся под данным индексом. Вернуть 0 в случае успеха. Установите исключение и верните -1 в случае ошибки.

source: If no data was set under the index, set *extra* to ``NULL`` and return 0 without setting an exception.
es_es: Si no se ha establecido ningún dato bajo el índice, establece *extra* en ``NULL`` y devuelve 0 sin establecer una excepción.
ru: Если в индексе не было задано никаких данных, установите для *extra* значение ``NULL`` и верните 0, не устанавливая исключения.

source: as ``_PyCode_GetExtra``
es_es: como ``_PyCode_GetExtra``
ru: как ``_PyCode_GetExtra``

source: Renamed to ``PyUnstable_Code_GetExtra``. The old private name is deprecated, but will be available until the API changes.
es_es: Renombrado a ``PyUnstable_Code_GetExtra``. El antiguo nombre privado está obsoleto, pero estará disponible hasta que cambie la API.
ru: Переименован в PyUnstable_Code_GetExtra. Старое частное имя устарело, но будет доступно до изменения API.

source: Set the extra data stored under the given index to *extra*. Return 0 on success. Set an exception and return -1 on failure.
es_es: Establece los datos extra almacenados bajo el índice dado a *extra*. Devuelve 0 en caso de éxito. Establece una excepción y devuelve -1 en caso de fallo.
ru: Установите для дополнительных данных, хранящихся под данным индексом, значение *extra*. Вернуть 0 в случае успеха. Установите исключение и верните -1 в случае ошибки.

source: as ``_PyCode_SetExtra``
es_es: como ``_PyCode_SetExtra``
ru: как ``_PyCode_SetExtra``
