Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/code.po
Languages: es_es, ru, uk

source: Renamed to ``PyUnstable_Code_SetExtra``. The old private name is deprecated, but will be available until the API changes.
es_es: Renombrado a ``PyUnstable_Code_SetExtra``. El antiguo nombre privado está obsoleto, pero estará disponible hasta que cambie la API.
ru: Переименован в PyUnstable_Code_SetExtra. Старое частное имя устарело, но будет доступно до изменения API.

source: object
es_es: objeto
ru: объект

source: code
es_es: código
ru: код

source: code object
es_es: objeto de código
ru: объект кода

source: PyCode_New (C function)
es_es: PyCode_New (función C)
ru: PyCode_New (функция C)

source: PyCode_NewWithPosOnlyArgs (C function)
es_es: PyCode_NewWithPosOnlyArgs (función C)
ru: PyCode_NewWithPosOnlyArgs (функция C)

source: _PyEval_RequestCodeExtraIndex (C function)
es_es: _PyEval_RequestCodeExtraIndex (función C)
ru: _PyEval_RequestCodeExtraIndex (функция C)

source: _PyCode_GetExtra (C function)
es_es: PyCode_GetExtra (función C)
ru: _PyCode_GetExtra (функция C)

source: _PyCode_SetExtra (C function)
es_es: _PyCode_SetExtra (función C)
ru: _PyCode_SetExtra (функция C)

source: Flag
es_es: Bandera

source: Meaning
es_es: Significado

source: This is an instance of :c:type:`PyTypeObject` representing the Python :class:`code` type.
uk: Це екземпляр :c:type:`PyTypeObject`, що представляє тип :class:`code` Python.

source: Return true if *co* is a :class:`code` object. This function always succeeds.
uk: Повертає true, якщо *co* є об’єктом :class:`code`. Ця функція завжди успішна.

source: Return the number of free variables in *co*.
uk: Повертає кількість вільних змінних у *co*.

source: Return a new code object. If you need a dummy code object to create a frame, use :c:func:`PyCode_NewEmpty` instead. Calling :c:func:`PyCode_New` directly can bind you to a precise Python version since the definition of the bytecode changes often.
uk: Повертає новий обьект коду. Якщо вам потрібен порожній об’єкт для створення фрейму, використовуйте :c:func:`PyCode_NewEmpty`. Виклик :c:func:`PyCode_New` напряму може прив'язати вас до конкретної версії Python в той час як байткод змінюється дуже часто.

source: Similar to :c:func:`PyCode_New`, but with an extra "posonlyargcount" for positional-only arguments.
uk: Подібний до :c:func:`PyCode_New`, але з додатковим аргументом "posonlyargcount" для позиційних аргументів.

source: Return a new empty code object with the specified filename, function name, and first line number. It is illegal to :func:`exec` or :func:`eval` the resulting code object.
uk: Повертає новий порожній об'єкт коду з вказаним ім'ям файлу, ім'ям функції та номером першого рядка. Виконувати :func:`exec` або :func:`eval` отриманий об'єкт коду заборонено.

source: For efficiently iterating over the line numbers in a code object, use `the API described in PEP 626 <https://www.python.org/dev/peps/pep-0626/#out-of-process-debuggers-and-profilers>`_.
uk: Для ефективного перебору номерів рядків в об'єкті коду використовуйте `API, описаний в PEP 626 <https://www.python.org/dev/peps/pep-0626/#out-of-process-debuggers-and-profilers>`_.
