Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/contextvars.po
Languages: es_es, ru, sv

source: Context Variables Objects
es_es: Objetos de variables de contexto
ru: Объекты контекстных переменных
sv: Kontextvariabelobjekt

source: In Python 3.7.1 the signatures of all context variables C APIs were **changed** to use :c:type:`PyObject` pointers instead of :c:type:`PyContext`, :c:type:`PyContextVar`, and :c:type:`PyContextToken`, e.g.::
es_es: En Python 3.7.1, las firmas de todas las API de C de variables de contexto se **cambiaron** para usar punteros :c:type:`PyObject` en lugar de :c:type:`PyContext`, :c:type:`PyContextVar`, y :c:type:`PyContextToken`, p.ej.::
ru: В Python 3.7.1 сигнатуры всех контекстных переменных C API были **изменены** для использования указателей :c:type:` PyObj ect` вместо :c:type:`PyContext`, :c:type:`PyContextVar` и :c:type:`PyContextToken`, например::
sv: I Python 3.7.1 ändrades signaturerna för alla kontextvariabler C API:er till att använda :c:type:`PyObject` pekare istället för :c:type:`PyContext`, :c:type:`PyContextVar`, och :c:type:`PyContextToken`, t.ex:

source: // in 3.7.0: PyContext *PyContext_New(void); // in 3.7.1+: PyObject *PyContext_New(void);
sv: // i 3.7.0: PyContext *PyContext_New(void); // i 3.7.1+: PyObject *PyContext_New(void);

source: See :issue:`34762` for more details.
es_es: Ver para más detalles :issue:`34762`.
ru: Дополнительную информацию см. в :issue:`34762`.
sv: Se :issue:`34762` för mer information.

source: This section details the public C API for the :mod:`contextvars` module.
es_es: En esta sección se detalla la API pública en C del módulo :mod:`contextvars`.
ru: модуля :mod:`contextvars`.
sv: Detta avsnitt beskriver det publika C API:et för modulen :mod:`contextvars`.

source: The C structure used to represent a :class:`contextvars.Context` object.
es_es: La estructura C utilizada para representar un objeto :class:`contextvars.Context`.
ru: Структура C, используемая для представления объекта :class:`contextvars.Context`.
sv: Den C-struktur som används för att representera ett :class:`contextvars.Context`-objekt.

source: The C structure used to represent a :class:`contextvars.ContextVar` object.
es_es: La estructura C utilizada para representar un objeto :class:`contextvars.ContextVar`.
ru: Структура C, используемая для представления объекта :class:`contextvars.ContextVar`.
sv: Den C-struktur som används för att representera ett :class:`contextvars.ContextVar`-objekt.

source: The C structure used to represent a :class:`contextvars.Token` object.
es_es: La estructura C utilizada para representar un objeto :class:`contextvars.Token`.
ru: Структура C, используемая для представления объекта :class:`contextvars.Token`.
sv: Den C-struktur som används för att representera ett :class:`contextvars.Token`-objekt.

source: The type object representing the *context* type.
es_es: El objeto de tipo que representa el tipo *context*.
ru: Объект типа представляет тип *context*.
sv: Typobjektet som representerar *kontext*-typen.

source: The type object representing the *context variable* type.
es_es: El objeto tipo que representa el tipo de *context variable*.
ru: Объект типа представляет тип *переменная контекста*.
sv: Typobjektet som representerar typen av *kontextvariabel*.

source: The type object representing the *context variable token* type.
es_es: El objeto tipo que representa el tipo *context variable token*.
ru: Объект типа представляет тип *токена переменной контекста*.
sv: Typobjektet som representerar *kontextvariabelns token*-typ.

source: Type-check macros:
es_es: Macros de comprobación tipográfica:
ru: Макросы для проверки типа:
sv: Typkontrollera makron:

source: Return true if *o* is of type :c:data:`PyContext_Type`. *o* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *o* es de tipo :c:data:`PyContext_Type`. *o* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *o* имеет тип :c:data:`PyContext_Type`. *o* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *o* är av typen :c:data:`PyContext_Type`. *o* får inte vara ``NULL``. Denna funktion lyckas alltid.

source: Return true if *o* is of type :c:data:`PyContextVar_Type`. *o* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *o* es de tipo :c:data:`PyContextVar_Type`. *o* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *o* имеет тип :c:data:`PyContextVar_Type`. *o* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *o* är av typen :c:data:`PyContextVar_Type`. *o* får inte vara ``NULL``. Denna funktion lyckas alltid.

source: Return true if *o* is of type :c:data:`PyContextToken_Type`. *o* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *o* es de tipo :c:data:`PyContextToken_Type`. *o* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *o* имеет тип :c:data:`PyContextToken_Type`. *o* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *o* är av typen :c:data:`PyContextToken_Type`. *o* får inte vara ``NULL``. Denna funktion lyckas alltid.

source: Context object management functions:
es_es: Funciones de gestión de objetos de contexto:
ru: Функции управления контекстными объектами:
sv: Funktioner för hantering av kontextobjekt:

source: Create a new empty context object. Returns ``NULL`` if an error has occurred.
es_es: Crear un nuevo objeto de contexto vacío. Devuelve ``NULL`` si ha ocurrido un error.
ru: Создайте новый пустой объект контекста. Возвращает ``NULL``, если произошла ошибка.
sv: Skapar ett nytt tomt kontextobjekt. Returnerar ``NULL`` om ett fel har inträffat.

source: Create a shallow copy of the passed *ctx* context object. Returns ``NULL`` if an error has occurred.
es_es: Cree una copia superficial del objeto de contexto *ctx* pasado. Devuelve ``NULL`` si ha ocurrido un error.
ru: Создайте неглубокую копию переданного объекта контекста *ctx*. Возвращает ``NULL``, если произошла ошибка.
sv: Skapar en ytlig kopia av det passerade *ctx* kontextobjektet. Returnerar ``NULL`` om ett fel har inträffat.

source: Create a shallow copy of the current thread context. Returns ``NULL`` if an error has occurred.
es_es: Crear una copia superficial del contexto del hilo actual. Devuelve ``NULL`` si se ha producido un error.
ru: Создайте неполную копию текущего контекста потока. Возвращает ``NULL``, если произошла ошибка.
sv: Skapar en ytlig kopia av den aktuella trådkontexten. Returnerar ``NULL`` om ett fel har inträffat.

source: Set *ctx* as the current context for the current thread. Returns ``0`` on success, and ``-1`` on error.
es_es: Establecer *ctx* como el contexto actual para el subproceso actual. Devuelve ``0`` en caso de éxito, y ``-1`` en caso de error.
ru: Установите *ctx* в качестве текущего контекста для текущего потока. Возвращает ``0`` в случае успеха и ``-1`` в случае ошибки.
sv: Ställ in *ctx* som aktuell kontext för aktuell tråd. Returnerar ``0`` vid framgång och ``-1`` vid fel.

source: Deactivate the *ctx* context and restore the previous context as the current context for the current thread. Returns ``0`` on success, and ``-1`` on error.
es_es: Desactivar el contexto *ctx* y restaurar el contexto anterior como el contexto actual para el hilo actual. Devuelve ``0`` en caso de éxito, y ``-1`` de error.
ru: Деактивируйте контекст *ctx* и восстановите предыдущий контекст в качестве текущего контекста для текущего потока. Возвращает ``0`` в случае успеха и ``-1`` в случае ошибки.
sv: Avaktiverar *ctx*-kontexten och återställer den föregående kontexten som aktuell kontext för den aktuella tråden. Returnerar ``0`` vid framgång och ``-1`` vid fel.

source: Register *callback* as a context object watcher for the current interpreter. Return an ID which may be passed to :c:func:`PyContext_ClearWatcher`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
sv: Registrerar *callback* som en kontextobjekt-vaktare för den aktuella tolken. Returnerar ett ID som kan skickas till :c:func:`PyContext_ClearWatcher`. I händelse av fel (t.ex. inga fler ID:n tillgängliga), returnera ``-1`` och sätt ett undantag.

source: Clear watcher identified by *watcher_id* previously returned from :c:func:`PyContext_AddWatcher` for the current interpreter. Return ``0`` on success, or ``-1`` and set an exception on error (e.g. if the given *watcher_id* was never registered.)
sv: Rensa den observatör som identifieras av *watcher_id* och som tidigare returnerats från :c:func:`PyContext_AddWatcher` för den aktuella tolken. Returnerar ``0`` vid framgång, eller ``-1`` och sätter ett undantag vid fel (t.ex. om det givna *watcher_id* aldrig registrerades)

source: Enumeration of possible context object watcher events:
sv: Uppräkning av möjliga händelser för kontextobjektets bevakare:

source: ``Py_CONTEXT_SWITCHED``: The :term:`current context` has switched to a different context. The object passed to the watch callback is the now-current :class:`contextvars.Context` object, or None if no context is current.
sv: ``Py_CONTEXT_SWITCHED``: Den :term:`aktuella kontexten` har bytt till en annan kontext. Objektet som skickas till watch callback är det nu aktuella :class:`contextvars.Context`-objektet, eller None om inget sammanhang är aktuellt.

source: Context object watcher callback function. The object passed to the callback is event-specific; see :c:type:`PyContextEvent` for details.
sv: Återkallelsefunktion för kontextobjektets bevakare. Objektet som skickas till återuppringningen är händelsespecifikt; se :c:type:`PyContextEvent` för detaljer.

source: If the callback returns with an exception set, it must return ``-1``; this exception will be printed as an unraisable exception using :c:func:`PyErr_FormatUnraisable`. Otherwise it should return ``0``.
sv: Om callbacken returneras med ett undantag inställt måste den returnera ``-1``; detta undantag kommer att skrivas ut som ett undantag som inte kan bedömas med :c:func:`PyErr_FormatUnraisable`. Annars bör det returnera ``0``.

source: There may already be a pending exception set on entry to the callback. In this case, the callback should return ``0`` with the same exception still set. This means the callback may not call any other API that can set an exception unless it saves and clears the exception state first, and restores it before returning.
sv: Det kan redan finnas ett väntande undantag inställt vid ingången till återuppringningen. I detta fall bör återuppringningen returnera ``0`` med samma undantag fortfarande inställt. Detta innebär att återuppringningen inte får anropa något annat API som kan ställa in ett undantag om det inte sparar och rensar undantagstillståndet först och återställer det innan det returneras.

source: Context variable functions:
es_es: Funciones variables de contexto
ru: Функции контекстных переменных:
sv: Funktioner för kontextvariabler:

source: Create a new ``ContextVar`` object. The *name* parameter is used for introspection and debug purposes. The *def* parameter specifies a default value for the context variable, or ``NULL`` for no default. If an error has occurred, this function returns ``NULL``.
es_es: Crear un nuevo objeto ``ContextVar``. The *name* parameter is used for introspection and debug purposes. El parámetro *nombre* se utiliza con fines de introspección y depuración. El parámetro *def* especifica un valor predeterminado para la variable de contexto, o ``NULL``si no hay valor predeterminado. Si ha ocurrido un error, esta función devuelve ``NULL``.
ru: Создайте новый объект ContextVar. Параметр *name* используется для целей самоанализа и отладки. Параметр *def* указывает значение по умолчанию для переменной контекста или ``NULL``, если значение по умолчанию отсутствует. Если произошла ошибка, эта функция возвращает ``NULL``.
sv: Skapar ett nytt ``ContextVar``-objekt. Parametern *name* används för introspektion och felsökning. Parametern *def* anger ett standardvärde för kontextvariabeln, eller ``NULL`` om inget standardvärde anges. Om ett fel har inträffat returnerar denna funktion ``NULL``.

source: Get the value of a context variable. Returns ``-1`` if an error has occurred during lookup, and ``0`` if no error occurred, whether or not a value was found.
es_es: Obtener el valor de una variable de contexto. Devuelve``-1``si se ha producido un error durante la búsqueda, y ``0`` si no se ha producido ningún error, se haya o no encontrado un valor.
ru: Получите значение контекстной переменной. Возвращает ``-1``, если во время поиска произошла ошибка, и ``0``, если ошибок не произошло, независимо от того, было ли найдено значение.
sv: Hämtar värdet på en kontextvariabel. Returnerar ``-1`` om ett fel har inträffat under sökningen, och ``0`` om inget fel har inträffat, oavsett om ett värde hittades eller inte.

source: If the context variable was found, *value* will be a pointer to it. If the context variable was *not* found, *value* will point to:
es_es: Si se encontró la variable de contexto, *value* será un puntero a ella. Si se encontró la variable de contexto *no*, *value* apuntará a:
ru: Если переменная контекста была найдена, *value* будет указателем на нее. Если переменная контекста *не* найдена, *value* будет указывать на:
sv: Om kontextvariabeln hittades kommer *value* att vara en pekare till den. Om kontextvariabeln *inte* hittades kommer *value* att peka på:

source: *default_value*, if not ``NULL``;
es_es: *default_value*, si no ``NULL``;
ru: *default_value*, если не ``NULL``;
sv: *default_value*, om inte ``NULL``;

source: the default value of *var*, if not ``NULL``;
es_es: el valor por defecto de *var*, si no ``NULL``;
ru: значение по умолчанию *var*, если нет ``NULL``;
sv: standardvärdet för *var*, om det inte är ``NULL``;

source: Except for ``NULL``, the function returns a new reference.
es_es: Excepto en ``NULL``, la función devuelve una nueva referencia.
ru: За исключением ``NULL``, функция возвращает новую ссылку.
sv: Med undantag för ``NULL`` returnerar funktionen en ny referens.

source: Set the value of *var* to *value* in the current context. Returns a new token object for this change, or ``NULL`` if an error has occurred.
es_es: Establece el valor de *var* a *value* en el contexto actual. Devuelve un nuevo objeto token para este cambio, o ``NULL`` si se ha producido un error.
ru: Установите значение *var* на *value* в текущем контексте. Возвращает новый объект токена для этого изменения или NULL, если произошла ошибка.
sv: Ställer in värdet på *var* till *värde* i det aktuella sammanhanget. Returnerar ett nytt token-objekt för denna ändring, eller ``NULL`` om ett fel har inträffat.

source: Reset the state of the *var* context variable to that it was in before :c:func:`PyContextVar_Set` that returned the *token* was called. This function returns ``0`` on success and ``-1`` on error.
es_es: Restablece el estado de la variable de contexto *var* al que tenía antes de llamar a :c:func:`PyContextVar_Set` que devolvió el *token*. Esta función devuelve ``0`` en caso de éxito y ``-1`` en caso de error.
ru: Сбросьте состояние контекстной переменной *var* до того состояния, в котором она была до вызова :c:func:`PyContextVar_Set`, который вернул *токен*. Эта функция возвращает ``0`` в случае успеха и ``-1`` в случае ошибки.
sv: Återställer tillståndet för kontextvariabeln *var* till det tillstånd den hade innan :c:func:`PyContextVar_Set` som returnerade *token* anropades. Denna funktion returnerar ``0`` vid framgång och ``-1`` vid fel.
