Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/datetime.po
Languages: es_es, ru, sv, tr, zh_cn

source: Macros to extract fields from date objects. The argument must be an instance of :c:type:`PyDateTime_Date`, including subclasses (such as :c:type:`PyDateTime_DateTime`). The argument must not be ``NULL``, and the type is not checked:
es_es: Macros para extraer campos de objetos de fecha. El argumento debe ser una instancia de :c:type:`PyDateTime_Date`, incluidas las subclases (como :c:type:`PyDateTime_DateTime`). El argumento no debe ser ``NULL``, y no se comprueba el tipo:
ru: Макросы для извлечения полей из объектов даты. Аргумент должен быть экземпляром :c:type:`PyDateTime_Date`, включая подклассы (например, :c:type:`PyDateTime_DateTime`). Аргумент не должен быть NULL, и тип не проверяется:
sv: Makron för att extrahera fält från datumobjekt. Argumentet måste vara en instans av :c:type:`PyDateTime_Date`, inklusive underklasser (t.ex. :c:type:`PyDateTime_DateTime`). Argumentet får inte vara ``NULL``, och typen kontrolleras inte:
tr: Макросы для извлечения полей из объектов даты. Аргумент должен быть экземпляром :c:type:`PyDateTime_Date`, включая подклассы (например, :c:type:`PyDateTime_DateTime`). Аргумент не должен быть NULL, и тип не проверяется:
zh_cn: 一些用来从日期对象中提取字段的宏。 参数必须是 :c:type:`PyDateTime_Date` 包括其子类 (如 :c:type:`PyDateTime_DateTime`) 的实例。 参数不能为 ``NULL``，且不会检查类型:

source: Return the year, as a positive int.
es_es: Devuelve el año, como un int positivo.
ru: Верните год как положительное целое число.
sv: Returnerar året som en positiv int.
tr: Yılı, Pozitif tam sayı olarak dondür.
zh_cn: 以正整数的形式返回年份值。

source: Return the month, as an int from 1 through 12.
es_es: Devuelve el mes, como un int de 1 a 12.
ru: Возвращает месяц в виде целого числа от 1 до 12.
sv: Returnerar månaden, som ett int från 1 till 12.
tr: Повертає місяць як int від 1 до 12.
zh_cn: 返回月，从0到12的整数。

source: Return the day, as an int from 1 through 31.
es_es: Devuelve el día, como un int de 1 a 31.
ru: Возвращает день в виде целого числа от 1 до 31.
sv: Returnera dagen, som ett int från 1 till 31.
tr: Повертає день як int від 1 до 31.
zh_cn: 返回日期，从0到31的整数。

source: Macros to extract fields from datetime objects. The argument must be an instance of :c:type:`PyDateTime_DateTime`, including subclasses. The argument must not be ``NULL``, and the type is not checked:
es_es: Macros para extraer campos de objetos datetime. El argumento debe ser una instancia de :c:type:`PyDateTime_DateTime`, incluidas las subclases. El argumento no debe ser ``NULL``, y no se comprueba el tipo:
ru: Макросы для извлечения полей из объектов datetime. Аргумент должен быть экземпляром :c:type:`PyDateTime_DateTime`, включая подклассы. Аргумент не должен быть NULL, и тип не проверяется:
sv: Makron för att extrahera fält från datetime-objekt. Argumentet måste vara en instans av :c:type:`PyDateTime_DateTime`, inklusive underklasser. Argumentet får inte vara ``NULL``, och typen kontrolleras inte:
tr: Макросы для извлечения полей из объектов datetime. Аргумент должен быть экземпляром :c:type:`PyDateTime_DateTime`, включая подклассы. Аргумент не должен быть NULL, и тип не проверяется:
zh_cn: 一些用来从日期时间对象中提取字段的宏。 参数必须是 :c:type:`PyDateTime_DateTime` 包括其子类的实例。 参数不能为 ``NULL``，并且不会检查类型:

source: Return the hour, as an int from 0 through 23.
es_es: Devuelve la hora, como un int de 0 a 23.
ru: Верните час в виде целого числа от 0 до 23.
sv: Returnerar timmen som ett int från 0 till 23.
tr: Повертає годину як int від 0 до 23.
zh_cn: 返回小时，从0到23的整数。

source: Return the minute, as an int from 0 through 59.
es_es: Devuelve el minuto, como un int de 0 a 59.
ru: Верните минуты в виде целого числа от 0 до 59.
sv: Returnera minuten som ett int från 0 till 59.
tr: Повертає хвилини як int від 0 до 59.
zh_cn: 返回分钟，从0到59的整数。

source: Return the second, as an int from 0 through 59.
es_es: Devuelve el segundo, como un int de 0 a 59.
ru: Верните второе значение в виде целого числа от 0 до 59.
sv: Returnera den andra, som ett int från 0 till 59.
tr: Повертає секунду як int від 0 до 59.
zh_cn: 返回秒，从0到59的整数。

source: Return the microsecond, as an int from 0 through 999999.
es_es: Devuelve el microsegundo, como un int de 0 a 999999.
ru: Возвращает микросекунду в виде целого числа от 0 до 999999.
sv: Returnerar mikrosekunden, som ett int från 0 till 999999.
tr: Повертає мікросекунду як int від 0 до 999999.
zh_cn: 返回微秒，从0到999999的整数。

source: Return the fold, as an int from 0 through 1.
es_es: Devuelve la vez, como un int de 0 a 1.
ru: вернуть сложенное, в виде числа int от 0 до 1.
sv: Returnera vikningen, som ett int från 0 till 1.
tr: вернуть сложенное, в виде числа int от 0 до 1.
zh_cn: 返回折叠值，为整数 0 或 1。

source: Return the tzinfo (which may be ``None``).
es_es: Devuelve el tzinfo (que puede ser ``None``).
ru: Верните tzinfo (который может быть ``None``).
sv: Returnerar tzinfo (som kan vara ``None``).
tr: Повертає tzinfo (яка може бути ``None``).
zh_cn: 返回 tzinfo (可以为 ``None``)。

source: Macros to extract fields from time objects. The argument must be an instance of :c:type:`PyDateTime_Time`, including subclasses. The argument must not be ``NULL``, and the type is not checked:
es_es: Macros para extraer campos de objetos temporales. El argumento debe ser una instancia de :c:type:`PyDateTime_Time`, incluidas las subclases. El argumento no debe ser ``NULL``, y no se comprueba el tipo:
ru: Макросы для извлечения полей из объектов времени. Аргумент должен быть экземпляром :c:type:`PyDateTime_Time`, включая подклассы. Аргумент не должен быть NULL, и тип не проверяется:
sv: Makron för att extrahera fält från tidsobjekt. Argumentet måste vara en instans av :c:type:`PyDateTime_Time`, inklusive underklasser. Argumentet får inte vara ``NULL``, och typen kontrolleras inte:
tr: Макросы для извлечения полей из объектов времени. Аргумент должен быть экземпляром :c:type:`PyDateTime_Time`, включая подклассы. Аргумент не должен быть NULL, и тип не проверяется:
zh_cn: 一些用来从时间对象中提取字段的宏。 参数必须是 :c:type:`PyDateTime_Time` 包括其子类的实例。 参数不能为 ``NULL``，且不会检查类型:

source: Macros to extract fields from time delta objects. The argument must be an instance of :c:type:`PyDateTime_Delta`, including subclasses. The argument must not be ``NULL``, and the type is not checked:
es_es: Macros para extraer campos de objetos delta de tiempo. El argumento debe ser una instancia de :c:type:`PyDateTime_Delta`, incluidas las subclases. El argumento no debe ser ``NULL``, y no se comprueba el tipo:
ru: Макросы для извлечения полей из объектов временной разницы. Аргумент должен быть экземпляром :c:type:`PyDateTime_Delta`, включая подклассы. Аргумент не должен быть NULL, и тип не проверяется:
sv: Makron för att extrahera fält från tidsdeltaobjekt. Argumentet måste vara en instans av :c:type:`PyDateTime_Delta`, inklusive underklasser. Argumentet får inte vara ``NULL``, och typen kontrolleras inte:
tr: Макросы для извлечения полей из объектов временной разницы. Аргумент должен быть экземпляром :c:type:`PyDateTime_Delta`, включая подклассы. Аргумент не должен быть NULL, и тип не проверяется:
zh_cn: 一些用来从时间差对象中提取字段的宏。 参数必须是 :c:type:`PyDateTime_Delta` 包括其子类的实例。参数不能为 ``NULL``，并且不会检查类型:

source: Return the number of days, as an int from -999999999 to 999999999.
es_es: Devuelve el número de días, como un int de -999999999 a 999999999.
ru: Возвращает количество дней в виде целого числа от -999999999 до 999999999.
sv: Returnera antalet dagar, som ett int från -999999999 till 999999999.
tr: Повертає кількість днів у вигляді int від -999999999 до 999999999.
zh_cn: 返回天数，从-999999999到999999999的整数。

source: Return the number of seconds, as an int from 0 through 86399.
es_es: Devuelve el número de segundos, como un int de 0 a 86399.
ru: Возвращает количество секунд в виде целого числа от 0 до 86399.
sv: Returnerar antalet sekunder, som ett int från 0 till 86399.
tr: Повертає кількість секунд у вигляді цілого типу від 0 до 86399.
zh_cn: 返回秒数，从0到86399的整数。

source: Return the number of microseconds, as an int from 0 through 999999.
es_es: Devuelve el número de microsegundos, como un int de 0 a 999999.
ru: Возвращает количество микросекунд в виде целого числа от 0 до 999999.
sv: Returnerar antalet mikrosekunder, som ett int från 0 till 999999.
tr: Повертає кількість мікросекунд у вигляді цілого значення від 0 до 999999.
zh_cn: 返回微秒数，从0到999999的整数。

source: Macros for the convenience of modules implementing the DB API:
es_es: Macros para comodidad de los módulos que implementan la DB API:
ru: Макросы для удобства модулей, реализующих API БД:
sv: Makron för att underlätta för moduler som implementerar DB API:
tr: Макроси для зручності модулів, що реалізують API БД:
zh_cn: 一些便于模块实现 DB API 的宏:

source: Create and return a new :class:`datetime.datetime` object given an argument tuple suitable for passing to :meth:`datetime.datetime.fromtimestamp`.
es_es: Crea y devuelve un nuevo objeto :class:`datetime.datetime` dada una tupla de argumentos adecuada para pasar a :meth:`datetime.datetime.fromtimestamp`.
ru: Создайте и верните новый объект :class:`datetime.datetime` с кортежем аргументов, подходящим для передачи в :meth:`datetime.datetime.fromtimestamp`.
sv: Skapa och returnera ett nytt :class:`datetime.datetime`\-objekt med en argumenttupel som är lämplig att skicka till :meth:`datetime.datetime.fromtimestamp`.
zh_cn: 创建并返回一个给定参数元组的新 :class:`datetime.datetime` 对象，适合传给 :meth:`datetime.datetime.fromtimestamp`。

source: Create and return a new :class:`datetime.date` object given an argument tuple suitable for passing to :meth:`datetime.date.fromtimestamp`.
es_es: Crea y devuelve un nuevo objeto :class:`datetime.date` dada una tupla de argumentos adecuada para pasar a :meth:`datetime.date.fromtimestamp`.
ru: Создайте и верните новый объект :class:`datetime.date` с кортежем аргументов, подходящим для передачи в :meth:`datetime.date.fromtimestamp`.
sv: Skapar och returnerar ett nytt :class:`datetime.date`\-objekt med en argumenttupel som kan skickas till :meth:`datetime.date.fromtimestamp`.
zh_cn: 创建并返回一个新的 :class:`datetime.date` 对象，给定一个适合传递给 :meth:`datetime.date.fromtimestamp` 的参数元组

source: Internal data
zh_cn: 内部数据

source: The following symbols are exposed by the C API but should be considered internal-only.
zh_cn: 下列符号由 C API 对外暴露但是应当被视为仅限内部使用。but should be considered internal-only.

source: Name of the datetime capsule to pass to :c:func:`PyCapsule_Import`.
zh_cn: 要传给 :c:func:`PyCapsule_Import` 的 datetime capsule 的名称。

source: Internal usage only. Use :c:macro:`PyDateTime_IMPORT` instead.
zh_cn: 仅限内部使用。 请改用 :c:macro:`PyDateTime_IMPORT`。

source: Various date and time objects are supplied by the :mod:`datetime` module. Before using any of these functions, the header file :file:`datetime.h` must be included in your source (note that this is not included by :file:`Python.h`), and the macro :c:macro:`!PyDateTime_IMPORT` must be invoked, usually as part of the module initialisation function. The macro puts a pointer to a C structure into a static variable, :c:data:`!PyDateTimeAPI`, that is used by the following macros.
es_es: El módulo :mod:`datetime` proporciona varios objetos de fecha y hora. Antes de utilizar cualquiera de estas funciones, debe incluirse en el código fuente el fichero de cabecera :file:`datetime.h` (tenga en cuenta que no lo incluye :file:`Python.h`), e invocar la macro :c:macro:`!PyDateTime_IMPORT`, normalmente como parte de la función de inicialización del módulo. La macro pone un puntero a una estructura C en una variable estática, :c:data:`!PyDateTimeAPI`, que es utilizada por las siguientes macros.
tr: Различные объекты даты и времени предоставляются модулем :mod:`datetime`. Перед использованием любой из этих функций в исходный код должен быть включен заголовочный файл :file:`datetime.h` (обратите внимание, что он не включен в :file:`Python.h`), а также макрос :c:macro: `!PyDateTime_IMPORT` должен вызываться, обычно как часть функции инициализации модуля. Макрос помещает указатель на структуру C в статическую переменную :c:data:`!PyDateTimeAPI`, которая используется следующими макросами.

source: This instance of :c:type:`PyTypeObject` represents Python type for the difference between two datetime values; it is the same object as :class:`datetime.timedelta` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo Python para la diferencia entre dos valores datetime; es el mismo objeto que :class:`datetime.timedelta` en la capa Python.
tr: Этот экземпляр :c:type:`PyTypeObject` представляет тип Python для разницы между двумя значениями даты и времени; это тот же объект, что и :class:`datetime.timedelta` на уровне Python.
