Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/datetime.po
Languages: es_es, ru, sv, tr, zh_cn

source: DateTime Objects
es_es: Objetos DateTime
ru: Объекты даты и времени
sv: DateTime-objekt
tr: Objek DateTime
zh_cn: DateTime 对象

source: Various date and time objects are supplied by the :mod:`datetime` module. Before using any of these functions, the header file :file:`datetime.h` must be included in your source (note that this is not included by :file:`Python.h`), and the macro :c:macro:`PyDateTime_IMPORT` must be invoked, usually as part of the module initialisation function. The macro puts a pointer to a C structure into a static variable, :c:data:`PyDateTimeAPI`, that is used by the following macros.
zh_cn: :mod:`datetime` 模块提供了各种日期和时间对象。 在使用任何这些函数之前，必须在你的源码中包含头文件 :file:`datetime.h` (请注意此文件并未包含在 :file:`Python.h` 中)，并且宏 :c:macro:`PyDateTime_IMPORT` 必须被发起调用，通常是作为模块初始化函数的一部分。 这个宏会将指向特定 C 结构的指针放入一个静态变量 :c:data:`PyDateTimeAPI` 中，它会由下面的宏来使用。

source: Import the datetime C API.
zh_cn: 导入 datetime C API。

source: On success, populate the :c:var:`PyDateTimeAPI` pointer. On failure, set :c:var:`PyDateTimeAPI` to ``NULL`` and set an exception. The caller must check if an error occurred via :c:func:`PyErr_Occurred`:
zh_cn: 成功时，填充 :c:var:`PyDateTimeAPI` 指针。 失败时，将 :c:var:`PyDateTimeAPI` 设为 ``NULL`` 并设置一个异常。 调用方必须通过 :c:func:`PyErr_Occurred` 检查是否发生了错误：

source: This is not compatible with subinterpreters.
zh_cn: 此特性不兼容子解释器。

source: Structure containing the fields for the datetime C API.
zh_cn: 包含用于 datetime C API 的字段的结构体。

source: The fields of this structure are private and subject to change.
zh_cn: 该结构体的字段是私有的并可能发生改变。

source: Do not use this directly; prefer ``PyDateTime_*`` APIs instead.
zh_cn: 不要直接使用此字段；建议改用 ``PyDateTime_*`` API。

source: Dynamically allocated object containing the datetime C API.
zh_cn: 包含 datetime C API 的动态分配的对象。

source: This variable is only available once :c:macro:`PyDateTime_IMPORT` succeeds.
zh_cn: 此变量仅在 :c:macro:`PyDateTime_IMPORT` 执行成功时才可用。

source: This subtype of :c:type:`PyObject` represents a Python date object.
es_es: Este subtipo de :c:type:`PyObject` representa un objeto fecha de Python.
ru: Этот подтип :c:type:` PyObject` представляет объект даты Python.
sv: Denna subtyp av :c:type:`PyObject` representerar ett Python-datumobjekt.
tr: Цей підтип :c:type:`PyObject` представляє об'єкт date в Python.
zh_cn: :c:type:`PyObject` 的这个子类型表示 Python 日期对象。

source: This subtype of :c:type:`PyObject` represents a Python datetime object.
es_es: Este subtipo de :c:type:`PyObject` representa un objeto datetime de Python.
ru: Этот подтип :c:type:` PyObject` представляет объект даты и времени Python.
sv: Denna subtyp av :c:type:`PyObject` representerar ett Python datetime-objekt.
tr: Цей підтип :c:type:`PyObject` представляє об'єкт datetime в Python.
zh_cn: :c:type:`PyObject` 的这个子类型表示 Python 日期时间对象。

source: This subtype of :c:type:`PyObject` represents a Python time object.
es_es: Este subtipo de :c:type:`PyObject` representa un objeto de tiempo de Python.
ru: Этот подтип :c:type:` PyObject` представляет объект времени Python.
sv: Denna subtyp av :c:type:`PyObject` representerar ett Python-tidsobjekt.
tr: Цей підтип :c:type:`PyObject` представляє об'єкт time в Python.
zh_cn: :c:type:`PyObject` 的这个子类型表示 Python 时间对象。

source: This subtype of :c:type:`PyObject` represents the difference between two datetime values.
es_es: Este subtipo de :c:type:`PyObject` representa la diferencia entre dos valores datetime.
ru: Этот подтип :c:type:` PyObject` представляет разницу между двумя значениями даты и времени.
sv: Denna subtyp av :c:type:`PyObject` representerar skillnaden mellan två datetime-värden.
tr: Цей підтип :c:type:`PyObject` представляє різницю між двома значеннями datetime.
zh_cn: :c:type:`PyObject` 的这个子类型表示两个日期时间值之间的差值。

source: This instance of :c:type:`PyTypeObject` represents the Python date type; it is the same object as :class:`datetime.date` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo de fecha de Python; es el mismo objeto que :class:`datetime.date` en la capa de Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип даты Python; это тот же объект, что и :class:`datetime.date` на уровне Python.
sv: Denna instans av :c:type:`PyTypeObject` representerar Pythons datumtyp; det är samma objekt som :class:`datetime.date` i Python-lagret.
tr: Этот экземпляр :c:type:`PyTypeObject` представляет тип даты Python; это тот же объект, что и :class:`datetime.date` на уровне Python.
zh_cn: 这个 :c:type:`PyTypeObject` 的实例代表 Python 日期类型；它与 Python 层面的 :class:`datetime.date` 对象相同。

source: This instance of :c:type:`PyTypeObject` represents the Python datetime type; it is the same object as :class:`datetime.datetime` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo datetime de Python; es el mismo objeto que :class:`datetime.datetime` en la capa de Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип даты и времени Python; это тот же объект, что и :class:`datetime.datetime` на уровне Python.
sv: Denna instans av :c:type:`PyTypeObject` representerar Python-typen datetime; det är samma objekt som :class:`datetime.datetime` i Python-lagret.
tr: Этот экземпляр :c:type:`PyTypeObject` представляет тип даты и времени Python; это тот же объект, что и :class:`datetime.datetime` на уровне Python.
zh_cn: 这个 :c:type:`PyTypeObject` 的实例代表 Python 日期时间类型；它与 Python 层面的 :class:`datetime.datetime` 对象相同。

source: This instance of :c:type:`PyTypeObject` represents the Python time type; it is the same object as :class:`datetime.time` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo de tiempo de Python; es el mismo objeto que :class:`datetime.time` en la capa de Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип времени Python; это тот же объект, что и :class:`datetime.time` на уровне Python.
sv: Denna instans av :c:type:`PyTypeObject` representerar Pythons tidstyp; det är samma objekt som :class:`datetime.time` i Python-lagret.
tr: Этот экземпляр :c:type:`PyTypeObject` представляет тип времени Python; это тот же объект, что и :class:`datetime.time` на уровне Python.
zh_cn: 这个 :c:type:`PyTypeObject` 的实例代表 Python 时间类型；它与 Python 层面的 :class:`datetime.time` 对象相同。

source: This instance of :c:type:`PyTypeObject` represents the Python type for the difference between two datetime values; it is the same object as :class:`datetime.timedelta` in the Python layer.
zh_cn: 这个 :c:type:`PyTypeObject` 的实例代表两个日期时间值之间差值的 Python 类型；它与 Python 层面的 :class:`datetime.timedelta` 是同一对象。

source: This instance of :c:type:`PyTypeObject` represents the Python time zone info type; it is the same object as :class:`datetime.tzinfo` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo de información de zona horaria de Python; es el mismo objeto que :class:`datetime.tzinfo` en la capa de Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип информации о часовом поясе Python; это тот же объект, что и :class:`datetime.tzinfo` на уровне Python.
sv: Denna instans av :c:type:`PyTypeObject` representerar Python-typen tidszoninfo; det är samma objekt som :class:`datetime.tzinfo` i Python-lagret.
tr: Этот экземпляр :c:type:`PyTypeObject` представляет тип информации о часовом поясе Python; это тот же объект, что и :class:`datetime.tzinfo` на уровне Python.
zh_cn: 这个 :c:type:`PyTypeObject` 的实例代表 Python 时区信息类型；它与 Python 层面的 :class:`datetime.tzinfo` 对象相同。

source: Macro for access to the UTC singleton:
es_es: Macro para acceder al tono sencillo de UTC:
ru: Макрос для доступа к синглтону UTC:
sv: Makro för åtkomst till UTC-singleton:
tr: Макрос для доступу до синглтону UTC:
zh_cn: 宏访问UTC单例:

source: Returns the time zone singleton representing UTC, the same object as :attr:`datetime.timezone.utc`.
es_es: Devuelve el tono simple de zona horaria que representa UTC, el mismo objeto que :attr:`datetime.timezone.utc`.
ru: Возвращает синглтон часового пояса, представляющий время UTC, тот же объект, что и :attr:`datetime.timezone.utc`.
sv: Returnerar tidszonens singleton som representerar UTC, samma objekt som :attr:`datetime.timezone.utc`.
tr: Повертає синглтон часового поясу, який представляє UTC, той самий об’єкт, що й :attr:`datetime.timezone.utc`.
zh_cn: 返回表示 UTC 的时区单例，与 :attr:`datetime.timezone.utc` 为同一对象。

source: Type-check macros:
es_es: Macros de comprobación tipográfica:
ru: Макросы для проверки типа:
sv: Typkontrollera makron:
tr: Sprawdzanie typu makr:
zh_cn: 类型检查宏：

source: Return true if *ob* is of type :c:data:`PyDateTime_DateType` or a subtype of :c:data:`!PyDateTime_DateType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es del tipo :c:data:`PyDateTime_DateType` o un subtipo de :c:data:`!PyDateTime_DateType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DateType` или подтип :c:data:`!PyDateTime_DateType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_DateType` eller en subtyp av :c:data:`!PyDateTime_DateType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DateType` или подтип :c:data:`!PyDateTime_DateType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_DateType` 类型或 :c:data:`!PyDateTime_DateType` 的某个子类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_DateType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es del tipo :c:data:`PyDateTime_DateType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DateType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_DateType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Повертає true, якщо *ob* має тип :c:data:`PyDateTime_DateType`. *ob* не має бути ``NULL``. Ця функція завжди успішна.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_DateType` 类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_DateTimeType` or a subtype of :c:data:`!PyDateTime_DateTimeType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es del tipo :c:data:`PyDateTime_DateTimeType` o un subtipo de :c:data:`!PyDateTime_DateTimeType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DateTimeType` или подтип :c:data:`!PyDateTime_DateTimeType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_DateTimeType` eller en subtyp av :c:data:`!PyDateTime_DateTimeType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DateTimeType` или подтип :c:data:`!PyDateTime_DateTimeType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_DateTimeType` 类型或 :c:data:`!PyDateTime_DateTimeType` 的某个子类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_DateTimeType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es del tipo :c:data:`PyDateTime_DateTimeType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DateTimeType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_DateTimeType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Повертає true, якщо *ob* має тип :c:data:`PyDateTime_DateTimeType`. *ob* не має бути ``NULL``. Ця функція завжди успішна.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_DateTimeType` 类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_TimeType` or a subtype of :c:data:`!PyDateTime_TimeType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve verdad si *ob* es del tipo :c:data:`PyDateTime_TimeType` o un subtipo de :c:data:`!PyDateTime_TimeType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_TimeType` или подтип :c:data:`!PyDateTime_TimeType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_TimeType` eller en subtyp av :c:data:`!PyDateTime_TimeType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_TimeType` или подтип :c:data:`!PyDateTime_TimeType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_TimeType` 类型或 :c:data:`!PyDateTime_TimeType` 的某个子类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_TimeType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es del tipo :c:data:`PyDateTime_TimeType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_TimeType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_TimeType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Повертає true, якщо *ob* має тип :c:data:`PyDateTime_TimeType`. *ob* не має бути ``NULL``. Ця функція завжди успішна.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_TimeType` 类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_DeltaType` or a subtype of :c:data:`!PyDateTime_DeltaType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve verdad si *ob* es del tipo :c:data:`PyDateTime_DeltaType` o un subtipo de :c:data:`!PyDateTime_DeltaType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DeltaType` или подтип :c:data:`!PyDateTime_DeltaType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_DeltaType` eller en subtyp av :c:data:`!PyDateTime_DeltaType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DeltaType` или подтип :c:data:`!PyDateTime_DeltaType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_DeltaType` 类型或 :c:data:`!PyDateTime_DeltaType` 的某个子类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_DeltaType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es del tipo :c:data:`PyDateTime_DeltaType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_DeltaType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_DeltaType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Повертає true, якщо *ob* має тип :c:data:`PyDateTime_DeltaType`. *ob* не має бути ``NULL``. Ця функція завжди успішна.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_DeltaType` 类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_TZInfoType` or a subtype of :c:data:`!PyDateTime_TZInfoType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve verdad si *ob* es del tipo :c:data:`PyDateTime_TZInfoType` o un subtipo de :c:data:`!PyDateTime_TZInfoType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_TZInfoType` или подтип :c:data:`!PyDateTime_TZInfoType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_TZInfoType` eller en subtyp av :c:data:`!PyDateTime_TZInfoType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_TZInfoType` или подтип :c:data:`!PyDateTime_TZInfoType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_TZInfoType` 类型或 :c:data:`!PyDateTime_TZInfoType` 的某个子类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Return true if *ob* is of type :c:data:`PyDateTime_TZInfoType`. *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es del tipo :c:data:`PyDateTime_TZInfoType`. *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращайте true, если *ob* имеет тип :c:data:`PyDateTime_TZInfoType`. *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.
sv: Returnerar true om *ob* är av typen :c:data:`PyDateTime_TZInfoType`. *ob* får inte vara ``NULL``. Denna funktion lyckas alltid.
tr: Повертає true, якщо *ob* має тип :c:data:`PyDateTime_TZInfoType`. *ob* не має бути ``NULL``. Ця функція завжди успішна.
zh_cn: 如果 *ob* 为 :c:data:`PyDateTime_TZInfoType` 类型则返回真值。 *ob* 不能为 ``NULL``。 此函数总是会成功执行。

source: Macros to create objects:
es_es: Macros para crear objetos:
ru: Макросы для создания объектов:
sv: Makron för att skapa objekt:
tr: Nesneleri oluşturmak için makrolar:
zh_cn: 用于创建对象的宏：

source: Return a :class:`datetime.date` object with the specified year, month and day.
es_es: Devuelve un objeto :class:`datetime.date` con el año, mes y día especificados.
ru: Возвращает объект :class:`datetime.date` с указанным годом, месяцем и днем.
sv: Returnerar ett :class:`datetime.date`\-objekt med angivet år, månad och dag.
tr: Повертає об’єкт :class:`datetime.date` із зазначеним роком, місяцем і днем.
zh_cn: 返回指定年、月、日的 :class:`datetime.date` 对象。

source: Return a :class:`datetime.datetime` object with the specified year, month, day, hour, minute, second and microsecond.
es_es: Devuelve un objeto :class:`datetime.datetime` con el año, mes, día, hora, minuto, segundo y microsegundo especificados.
ru: Возвращает объект :class:`datetime.datetime` с указанным годом, месяцем, днем, часом, минутой, секундой и микросекундой.
sv: Returnerar ett :class:`datetime.datetime`\-objekt med angivet år, månad, dag, timme, minut, sekund och mikrosekund.
tr: Повертає об’єкт :class:`datetime.datetime` із вказаним роком, місяцем, днем, годиною, хвилиною, секундою та мікросекундою.
zh_cn: 返回具有指定 year, month, day, hour, minute, second 和 microsecond 属性的 :class:`datetime.datetime` 对象。

source: Return a :class:`datetime.datetime` object with the specified year, month, day, hour, minute, second, microsecond and fold.
es_es: Devuelve un objeto :class:`datetime.datetime` con el año, mes, día, hora, minuto, segundo, microsegundo y pliegue especificados.
ru: Возвращает объект :class:`datetime.datetime` с указанным годом, месяцем, днем, часом, минутой, секундой, микросекундой и кратностью.
sv: Returnera ett :class:`datetime.datetime`\-objekt med angivet år, månad, dag, timme, minut, sekund, mikrosekund och vikning.
tr: Повертає об’єкт :class:`datetime.datetime` із вказаним роком, місяцем, днем, годиною, хвилиною, секундою, мікросекундою та кратністю.
zh_cn: 返回具有指定 year, month, day, hour, minute, second, microsecond 和 fold 属性的 :class:`datetime.datetime` 对象。

source: Return a :class:`datetime.time` object with the specified hour, minute, second and microsecond.
es_es: Devuelve un objeto :class:`datetime.time` con la hora, minuto, segundo y microsegundo especificados.
ru: Возвращает объект :class:`datetime.time` с указанными часами, минутами, секундами и микросекундами.
sv: Returnerar ett :class:`datetime.time`\-objekt med angiven timme, minut, sekund och mikrosekund.
tr: Повертає об’єкт :class:`datetime.time` із вказаною годиною, хвилиною, секундою та мікросекундою.
zh_cn: 返回具有指定 hour, minute, second and microsecond 属性的 :class:`datetime.time` 对象。

source: Return a :class:`datetime.time` object with the specified hour, minute, second, microsecond and fold.
es_es: Devuelve un objeto :class:`datetime.time` con la hora, minuto, segundo, microsegundo y pliegue especificados.
ru: Возвращает объект :class:`datetime.time` с указанным часом, минутой, секундой, микросекундой и кратностью.
sv: Returnerar ett :class:`datetime.time`\-objekt med angiven timme, minut, sekund, mikrosekund och vikning.
tr: Повертає об’єкт :class:`datetime.time` із вказаною годиною, хвилиною, секундою, мікросекундою та кратністю.
zh_cn: 返回具有指定 hour, minute, second, microsecond 和 fold 属性的 :class:`datetime.time` 对象。

source: Return a :class:`datetime.timedelta` object representing the given number of days, seconds and microseconds. Normalization is performed so that the resulting number of microseconds and seconds lie in the ranges documented for :class:`datetime.timedelta` objects.
es_es: Devuelve un objeto :class:`datetime.timedelta` que representa el número dado de días, segundos y microsegundos. La normalización se realiza de forma que el número resultante de microsegundos y segundos se encuentre dentro de los rangos documentados para los objetos :class:`datetime.timedelta`.
ru: Возвращает объект :class:`datetime.timedelta`, представляющий заданное количество дней, секунд и микросекунд. Нормализация выполняется так, чтобы результирующее количество микросекунд и секунд лежало в диапазонах, документированных для объектов :class:`datetime.timedelta`.
sv: Returnerar ett :class:`datetime.timedelta`\-objekt som representerar det givna antalet dagar, sekunder och mikrosekunder. Normalisering utförs så att det resulterande antalet mikrosekunder och sekunder ligger inom de intervall som dokumenterats för :class:`datetime.timedelta`\-objekt.
tr: Повертає об’єкт :class:`datetime.timedelta`, що представляє задану кількість днів, секунд і мікросекунд. Нормалізація виконується таким чином, щоб результуюча кількість мікросекунд і секунд лежала в діапазонах, задокументованих для об’єктів :class:`datetime.timedelta`.
zh_cn: 返回代表给定天、秒和微秒数的 :class:`datetime.timedelta` 对象。 将执行正规化操作以使最终的微秒和秒数处在 :class:`datetime.timedelta` 对象的文档指明的区间之内。

source: Return a :class:`datetime.timezone` object with an unnamed fixed offset represented by the *offset* argument.
es_es: Devuelve un objeto :class:`datetime.timezone` con un desplazamiento fijo sin nombre representado por el argumento *offset*.
ru: Возвращает объект :class:`datetime.timezone` с безымянным фиксированным смещением, представленным аргументом *offset*.
sv: Returnerar ett :class:`datetime.timezone`\-objekt med en icke namngiven fast offset som representeras av argumentet *offset*.
tr: Повертає об’єкт :class:`datetime.timezone` із фіксованим зсувом без назви, представленим аргументом *offset*.
zh_cn: 返回一个 :class:`datetime.timezone` 对象，该对象具有以 *offset* 参数表示 的未命名固定时差。

source: Return a :class:`datetime.timezone` object with a fixed offset represented by the *offset* argument and with tzname *name*.
es_es: Devuelve un objeto :class:`datetime.timezone` con un desplazamiento fijo representado por el argumento *offset* y con tzname *name*.
ru: Возвращает объект :class:`datetime.timezone` с фиксированным смещением, представленным аргументом *offset*, и с tzname *name*.
sv: Returnerar ett :class:`datetime.timezone`\-objekt med en fast offset som representeras av argumentet *offset* och med tzname *name*.
tr: Повертає об’єкт :class:`datetime.timezone` із фіксованим зсувом, представленим аргументом *offset*, і з tzname *name*.
zh_cn: 返回一个 :class:`datetime.timezone` 对象，该对象具有以 *offset* 参数表示的固定时差和时区名称 *name*。
