Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/exceptions.po
Languages: ru, zh_tw

source: Exception Handling
ru: Обработка исключений
zh_tw: 例外處理

source: The functions described in this chapter will let you handle and raise Python exceptions. It is important to understand some of the basics of Python exception handling. It works somewhat like the POSIX :c:data:`errno` variable: there is a global indicator (per thread) of the last error that occurred. Most C API functions don't clear this on success, but will set it to indicate the cause of the error on failure. Most C API functions also return an error indicator, usually ``NULL`` if they are supposed to return a pointer, or ``-1`` if they return an integer (exception: the ``PyArg_*`` functions return ``1`` for success and ``0`` for failure).
ru: Функции, описанные в этой главе, позволят вам обрабатывать и вызывать исключения Python. Важно понимать некоторые основы обработки исключений Python. Это работает примерно так же, как переменная POSIX :c:data:`errno`: существует глобальный индикатор (для каждого потока) последней возникшей ошибки. Большинство функций C API не очищают это значение при успешном выполнении, но устанавливают его для указания причины ошибки при сбое. Большинство функций C API также возвращают индикатор ошибки, обычно ``NULL``, если предполагается, что они возвращают указатель, или ``-1`` , если они возвращают целое число (исключение: функции ``PyArg_*`` возвращают ``1`` для успешного выполнения и ``0`` для ошибки).
zh_tw: Функции, описанные в этой главе, позволят вам обрабатывать и вызывать исключения Python. Важно понимать некоторые основы обработки исключений Python. Это работает примерно так же, как переменная POSIX :c:data:`errno`: существует глобальный индикатор (для каждого потока) последней возникшей ошибки. Большинство функций C API не очищают это значение при успешном выполнении, но устанавливают его для указания причины ошибки при сбое. Большинство функций C API также возвращают индикатор ошибки, обычно ``NULL``, если предполагается, что они возвращают указатель, или ``-1`` , если они возвращают целое число (исключение: функции ``PyArg_*`` возвращают ``1`` для успешного выполнения и ``0`` для ошибки).

source: Concretely, the error indicator consists of three object pointers: the exception's type, the exception's value, and the traceback object. Any of those pointers can be ``NULL`` if non-set (although some combinations are forbidden, for example you can't have a non-``NULL`` traceback if the exception type is ``NULL``).
ru: Конкретно, индикатор ошибки состоит из трех указателей на объекты: тип исключения, значение исключения и объект обратной трассировки. Любой из этих указателей может быть ``NULL``, если не задан (хотя некоторые комбинации запрещены, например, у вас не может быть обратной трассировки, отличной от ``NULL``, если тип исключения ``NULL``).
zh_tw: Зокрема, індикатор помилки складається з трьох покажчиків на об’єкти: тип винятку, значення винятку та об’єкт трасування. Будь-який із цих покажчиків може бути ``NULL``, якщо не встановлено (хоча деякі комбінації заборонені, наприклад, ви не можете мати не ``NULL`` трасування, якщо тип винятку ``NULL``).

source: When a function must fail because some function it called failed, it generally doesn't set the error indicator; the function it called already set it. It is responsible for either handling the error and clearing the exception or returning after cleaning up any resources it holds (such as object references or memory allocations); it should *not* continue normally if it is not prepared to handle the error. If returning due to an error, it is important to indicate to the caller that an error has been set. If the error is not handled or carefully propagated, additional calls into the Python/C API may not behave as intended and may fail in mysterious ways.
ru: Когда функция должна завершиться неудачно из-за сбоя какой-либо функции, которую она вызвала, индикатор ошибки обычно не устанавливается; функция, которую он вызвал, уже установила его. Он отвечает либо за обработку ошибки и очистку исключения, либо за возврат после очистки любых имеющихся у него ресурсов (таких как ссылки на объекты или выделение памяти); он *не* должен продолжать работать нормально, если не готов обработать ошибку. При возврате из-за ошибки важно указать вызывающему объекту, что была установлена ошибка. Если ошибка не обрабатывается или не распространяется должным образом, дополнительные вызовы API Python/C могут вести себя не так, как предполагалось, и могут загадочным образом завершиться неудачей.
zh_tw: Gdy zadanie musi zawieźć z powodu błędu zadania które wywołało, ogólnie nie ustawia ona wskaźnika błędu; podzadanie które zostało wywołane już go ustawiła. Jest on odpowiedzialny albo za obsługę błędu i wyczyszczenie wskaźnika sytuacji wyjątkowej lub powrót po sprzątnięciu jakichkolwiek zasobów które utrzymuje (takich jak odwołania do przedmiotów lub zajęte pamięci); *nie* powinien kontynuować zwyczajnie jeśli nie jest przygotowany do obsługi błędu. Jeśli kończy z powodu błędu, istotne jest zwrócenie uwagi wołającego że został zgłoszony błąd. Jeśli błąd nie jest obsługiwany lub propagowany właściwie, dodatkowe odwołania do sprzęgu języka pytonowskiego/C mogą nie zachowywać się tak, jak planowano i mogą zawieźć w nieoczekiwane sposoby.

source: The error indicator is **not** the result of :func:`sys.exc_info`. The former corresponds to an exception that is not yet caught (and is therefore still propagating), while the latter returns an exception after it is caught (and has therefore stopped propagating).
ru: Индикатор ошибки **не** является результатом :func:`sys.exc_info`. Первое соответствует исключению, которое еще не перехвачено (и, следовательно, все еще распространяется), тогда как второе возвращает исключение после того, как оно было перехвачено (и, следовательно, прекратило распространение).
zh_tw: Индикатор ошибки **не** является результатом :func:`sys.exc_info`. Первое соответствует исключению, которое еще не перехвачено (и, следовательно, все еще распространяется), тогда как второе возвращает исключение после того, как оно было перехвачено (и, следовательно, прекратило распространение).

source: Printing and clearing
ru: Печать и очистка
zh_tw: Mencetak dan membersihkan

source: Clear the error indicator. If the error indicator is not set, there is no effect.
ru: Очищает индикатор ошибки. Если индикатор ошибки не установлен, эффекта не будет.
zh_tw: Очистіть індикатор помилки. Якщо індикатор помилки не встановлено, ефекту немає.

source: Print a standard traceback to ``sys.stderr`` and clear the error indicator. **Unless** the error is a ``SystemExit``, in that case no traceback is printed and the Python process will exit with the error code specified by the ``SystemExit`` instance.
ru: Печатает стандартную обратную трассировку в ``sys.stderr`` и очищает индикатор ошибки. **Если только** ошибка не является ``SystemExit``, в этом случае обратная трассировка не выводится, и процесс Python завершится с кодом ошибки, указанным экземпляром ``SystemExit``.
zh_tw: Надрукуйте стандартне відстеження до ``sys.stderr`` і очистіть індикатор помилки. **Якщо** помилка не є ``SystemExit``, у такому випадку трасування не друкується, і процес Python завершить роботу з кодом помилки, указаним екземпляром ``SystemExit``.

source: Call this function **only** when the error indicator is set. Otherwise it will cause a fatal error!
ru: Вызывайте эту функцию **только** при установленном индикаторе ошибки. В противном случае это приведет к фатальной ошибке!
zh_tw: Викликайте цю функцію **лише**, коли встановлено індикатор помилки. Інакше це призведе до фатальної помилки!

source: If *set_sys_last_vars* is nonzero, the variable :data:`sys.last_exc` is set to the printed exception. For backwards compatibility, the deprecated variables :data:`sys.last_type`, :data:`sys.last_value` and :data:`sys.last_traceback` are also set to the type, value and traceback of this exception, respectively.
ru: Если *set_sys_last_vars* не равно нулю, переменной :data:`sys.last_exc` присваивается значение напечатанного исключения. Для обратной совместимости устаревшим переменным :data:`sys.last_type`, :data:`sys.last_value` и :data:`sys.last_traceback` также присваиваются тип, значение и обратная трассировка этого исключения соответственно.
zh_tw: Если *set_sys_last_vars* не равно нулю, переменной :data:`sys.last_exc` присваивается значение напечатанного исключения. Для обратной совместимости устаревшим переменным :data:`sys.last_type`, :data:`sys.last_value` и :data:`sys.last_traceback` также присваиваются тип, значение и обратная трассировка этого исключения соответственно.

source: The setting of :data:`sys.last_exc` was added.
ru: Была добавлена настройка :data:`sys.last_exc`.
zh_tw: Была добавлена настройка :data:`sys.last_exc`.

source: Alias for ``PyErr_PrintEx(1)``.
ru: Псевдоним для ``PyErr_PrintEx(1)``.
zh_tw: Alias dari ``PyErr_PrintEx(1)``.

source: Call :func:`sys.unraisablehook` using the current exception and *obj* argument.
ru: Вызывает :func:`sys.unraisablehook``, используя текущее исключение и аргумент *obj*.
zh_tw: Викликайте :func:`sys.unraisablehook`, використовуючи поточний виняток і аргумент *obj*.

source: This utility function prints a warning message to ``sys.stderr`` when an exception has been set but it is impossible for the interpreter to actually raise the exception. It is used, for example, when an exception occurs in an :meth:`~object.__del__` method.
ru: Эта служебная функция выводит предупреждающее сообщение в ``sys.stderr``, когда установлено исключение, но интерпретатор не может фактически вызвать исключение. Он используется, например, когда возникает исключение в методе :meth:`~object.__del__`.
zh_tw: Эта служебная функция выводит предупреждающее сообщение в ``sys.stderr``, когда установлено исключение, но интерпретатор не может фактически вызвать исключение. Он используется, например, когда возникает исключение в методе :meth:`~object.__del__`.

source: The function is called with a single argument *obj* that identifies the context in which the unraisable exception occurred. If possible, the repr of *obj* will be printed in the warning message. If *obj* is ``NULL``, only the traceback is printed.
ru: Функция вызывается с единственным аргументом *obj*, который идентифицирует контекст, в котором возникло недопустимое исключение. Если возможно, в предупреждающем сообщении будет напечатано повторение *obj*. Если *obj* равно ``NULL``, печатается только обратная трассировка.
zh_tw: Функция вызывается с единственным аргументом *obj*, который идентифицирует контекст, в котором возникло недопустимое исключение. Если возможно, в предупреждающем сообщении будет напечатано повторение *obj*. Если *obj* равно ``NULL``, печатается только обратная трассировка.

source: An exception must be set when calling this function.
ru: При вызове этой функции должно быть установлено исключение.
zh_tw: При виклику цієї функції необхідно встановити виняток.

source: Print a traceback. Print only traceback if *obj* is ``NULL``.
ru: Выводит обратную трассировку. Выводит обратную трассировку только в том случае, если *obj* имеет значение ``NULL``.
zh_tw: Выводит обратную трассировку. Выводит обратную трассировку только в том случае, если *obj* имеет значение ``NULL``.

source: Use :func:`sys.unraisablehook`.
ru: Используйте :func:`sys.unraisablehook`.
zh_tw: Используйте :func:`sys.unraisablehook`.

source: Similar to :c:func:`PyErr_WriteUnraisable`, but the *format* and subsequent parameters help format the warning message; they have the same meaning and values as in :c:func:`PyUnicode_FromFormat`. ``PyErr_WriteUnraisable(obj)`` is roughly equivalent to ``PyErr_FormatUnraisable("Exception ignored in: %R", obj)``. If *format* is ``NULL``, only the traceback is printed.
ru: Аналогично :c:func:`PyErr_WriteUnraisable`, но *format* и последующие параметры помогают форматировать предупреждающее сообщение; они имеют то же значение и значения, что и в :c:func:`PyUnicode_FromFormat`. ``PyErr_WriteUnraisable(obj)`` примерно эквивалентен ``PyErr_FormatUnraisable("Исключение игнорируется в: %R", obj)``. Если *format* равен ``NULL``, печатается только обратная трассировка.
zh_tw: Аналогично :c:func:`PyErr_WriteUnraisable`, но *format* и последующие параметры помогают форматировать предупреждающее сообщение; они имеют то же значение и значения, что и в :c:func:`PyUnicode_FromFormat`. ``PyErr_WriteUnraisable(obj)`` примерно эквивалентен ``PyErr_FormatUnraisable("Исключение игнорируется в: %R", obj)``. Если *format* равен ``NULL``, печатается только обратная трассировка.

source: Print the standard traceback display of ``exc`` to ``sys.stderr``, including chained exceptions and notes.
ru: Выводит стандартное отображение обратной трассировки от ``exc`` до ``sys.stderr``, включая связанные исключения и примечания.
zh_tw: Выводит стандартное отображение обратной трассировки от ``exc`` до ``sys.stderr``, включая связанные исключения и примечания.

source: Raising exceptions
ru: Создание исключений
zh_tw: Menghasilkan pengecualian

source: These functions help you set the current thread's error indicator. For convenience, some of these functions will always return a ``NULL`` pointer for use in a ``return`` statement.
ru: Эти функции помогут вам установить индикатор ошибки текущего потока. Для удобства некоторые из этих функций всегда будут возвращать указатель ``NULL`` для использования в инструкции ``return``.
zh_tw: Ці функції допомагають встановити індикатор помилки поточного потоку. Для зручності деякі з цих функцій завжди повертатимуть покажчик ``NULL`` для використання в операторі ``return``.

source: This is the most common way to set the error indicator. The first argument specifies the exception type; it is normally one of the standard exceptions, e.g. :c:data:`PyExc_RuntimeError`. You need not create a new :term:`strong reference` to it (e.g. with :c:func:`Py_INCREF`). The second argument is an error message; it is decoded from ``'utf-8'``.
ru: Это наиболее распространенный способ установки индикатора ошибки. Первый аргумент указывает тип исключения; обычно это одно из стандартных исключений, например :c:data:`PyExc_RuntimeError`. Вам не нужно создавать новый :term:`strong reference` на него (например, с помощью :c:func:`Py_INCREF`). Второй аргумент - это сообщение об ошибке; оно декодируется из ``'utf-8'``.
zh_tw: Это наиболее распространенный способ установки индикатора ошибки. Первый аргумент указывает тип исключения; обычно это одно из стандартных исключений, например :c:data:`PyExc_RuntimeError`. Вам не нужно создавать новый :term:`strong reference` на него (например, с помощью :c:func:`Py_INCREF`). Второй аргумент - это сообщение об ошибке; оно декодируется из ``'utf-8'``.

source: This function is similar to :c:func:`PyErr_SetString` but lets you specify an arbitrary Python object for the "value" of the exception.
ru: Эта функция аналогична :c:func:`PyErr_SetString`, но позволяет указать произвольный объект Python для "значения" исключения.
zh_tw: Ця функція схожа на :c:func:`PyErr_SetString`, але дозволяє вказати довільний об’єкт Python для "значення" винятку.

source: This function sets the error indicator and returns ``NULL``. *exception* should be a Python exception class. The *format* and subsequent parameters help format the error message; they have the same meaning and values as in :c:func:`PyUnicode_FromFormat`. *format* is an ASCII-encoded string.
ru: Эта функция устанавливает индикатор ошибки и возвращает ``NULL``. *exception* должен быть классом исключений Python. *format* и последующие параметры помогают отформатировать сообщение об ошибке; они имеют то же значение, что и в :c:func:`PyUnicode_FromFormat`. *format* - это строка в кодировке ASCII.
zh_tw: Ця функція встановлює індикатор помилки та повертає ``NULL``. *exception* має бути класом винятків Python. *format* і наступні параметри допомагають відформатувати повідомлення про помилку; вони мають те саме значення та значення, що й у :c:func:`PyUnicode_FromFormat`. *format* — це рядок у кодуванні ASCII.

source: Same as :c:func:`PyErr_Format`, but taking a :c:type:`va_list` argument rather than a variable number of arguments.
ru: То же, что и :c:func:`PyErr_Format`, но принимающий аргумент :c:type:`va_list`, а не переменное количество аргументов.
zh_tw: Те саме, що :c:func:`PyErr_Format`, але приймає аргумент :c:type:`va_list`, а не змінну кількість аргументів.

source: This is a shorthand for ``PyErr_SetObject(type, Py_None)``.
ru: Это сокращение от ``PyErr_SetObject(type, Py_None)``.
zh_tw: Це скорочення для ``PyErr_SetObject(type, Py_None)``.

source: This is a shorthand for ``PyErr_SetString(PyExc_TypeError, message)``, where *message* indicates that a built-in operation was invoked with an illegal argument. It is mostly for internal use.
ru: Это сокращение от ``PyErr_SetString(PyExc_TypeError, message)``, где *message* указывает, что встроенная операция была вызвана с недопустимым аргументом. В основном это для внутреннего использования.
zh_tw: Це скорочення для ``PyErr_SetString(PyExc_TypeError, повідомлення)``, де *повідомлення* вказує на те, що вбудовану операцію було викликано з недопустимим аргументом. В основному він призначений для внутрішнього використання.

source: This is a shorthand for ``PyErr_SetNone(PyExc_MemoryError)``; it returns ``NULL`` so an object allocation function can write ``return PyErr_NoMemory();`` when it runs out of memory.
ru: Это сокращение от ``PyErr_SetNone(PyExc_MemoryError)``; оно возвращает ``NULL``, поэтому функция выделения объекта может записать ``return PyErr_NoMemory();``, когда у нее заканчивается память.
zh_tw: Це скорочення для ``PyErr_SetNone(PyExc_MemoryError)``; він повертає ``NULL``, тому функція розподілу об’єктів може написати ``return PyErr_NoMemory();``, коли їй вичерпується пам’ять.

source: This is a convenience function to raise an exception when a C library function has returned an error and set the C variable :c:data:`errno`. It constructs a tuple object whose first item is the integer :c:data:`errno` value and whose second item is the corresponding error message (gotten from :c:func:`!strerror`), and then calls ``PyErr_SetObject(type, object)``. On Unix, when the :c:data:`errno` value is :c:macro:`!EINTR`, indicating an interrupted system call, this calls :c:func:`PyErr_CheckSignals`, and if that set the error indicator, leaves it set to that. The function always returns ``NULL``, so a wrapper function around a system call can write ``return PyErr_SetFromErrno(type);`` when the system call returns an error.
ru: Это удобная функция для создания исключения, когда функция библиотеки C вернула ошибку и установила переменную C :c:data:`errno`. Он создает объект кортежа, первым элементом которого является целочисленное значение :c:data:`errno`, а вторым элементом которого является соответствующее сообщение об ошибке (полученное из :c:func:`!strerror`), а затем вызывает ``PyErr_SetObject(type, object)``. В Unix, когда значение :c:data:`errno` равно :c:macro:`!EINTR`, указывающее на прерванный системный вызов, это вызывает :c:func:`PyErr_CheckSignals`, и если она устанавливает индикатор ошибки, оставляет его равным этому. Функция всегда возвращает ``NULL``, поэтому функция-оболочка для системного вызова может написать ``return PyErr_SetFromErrno(type);``, когда системный вызов возвращает ошибку.
zh_tw: Это удобная функция для создания исключения, когда функция библиотеки C вернула ошибку и установила переменную C :c:data:`errno`. Он создает объект кортежа, первым элементом которого является целочисленное значение :c:data:`errno`, а вторым элементом которого является соответствующее сообщение об ошибке (полученное из :c:func:`!strerror`), а затем вызывает ``PyErr_SetObject(type, object)``. В Unix, когда значение :c:data:`errno` равно :c:macro:`!EINTR`, указывающее на прерванный системный вызов, это вызывает :c:func:`PyErr_CheckSignals`, и если она устанавливает индикатор ошибки, оставляет его равным этому. Функция всегда возвращает ``NULL``, поэтому функция-оболочка для системного вызова может написать ``return PyErr_SetFromErrno(type);``, когда системный вызов возвращает ошибку.

source: Similar to :c:func:`PyErr_SetFromErrno`, with the additional behavior that if *filenameObject* is not ``NULL``, it is passed to the constructor of *type* as a third parameter. In the case of :exc:`OSError` exception, this is used to define the :attr:`!filename` attribute of the exception instance.
ru: Аналогично :c:func:`PyErr_SetFromErrno`, с дополнительным поведением, заключающимся в том, что если *filenameObject* не является ``NULL``, оно передается конструктору *type* в качестве третьего параметра. В случае исключения :exc:`OSError` это используется для определения атрибута :attr:`!filename` экземпляра исключения.
zh_tw: Аналогично :c:func:`PyErr_SetFromErrno`, с дополнительным поведением, заключающимся в том, что если *filenameObject* не является ``NULL``, оно передается конструктору *type* в качестве третьего параметра. В случае исключения :exc:`OSError` это используется для определения атрибута :attr:`!filename` экземпляра исключения.

source: Similar to :c:func:`PyErr_SetFromErrnoWithFilenameObject`, but takes a second filename object, for raising errors when a function that takes two filenames fails.
ru: Аналогично :c:func:`PyErr_SetFromErrnoWithFilenameObject`, но принимает второе имя объекта для выдачи ошибок при сбое функции, принимающей два имени файлов.
zh_tw: Подібно до :c:func:`PyErr_SetFromErrnoWithFilenameObject`, але приймає другий об’єкт імені файлу, щоб викликати помилки, коли функція, яка приймає два імені файлу, виходить з ладу.

source: Similar to :c:func:`PyErr_SetFromErrnoWithFilenameObject`, but the filename is given as a C string. *filename* is decoded from the :term:`filesystem encoding and error handler`.
ru: Аналогично :c:func:`PyErr_SetFromErrnoWithFilenameObject`, но имя файла задается в виде строки C. *имя файла* декодируется из :term:`filesystem encoding and error handler`.
zh_tw: Подібно до :c:func:`PyErr_SetFromErrnoWithFilenameObject`, але ім’я файлу подається як рядок C. *ім’я файлу* розшифровується з :term:`filesystem encoding and error handler`.
