Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/exceptions.po
Languages: ru, zh_tw

source: This is a convenience function to raise :exc:`OSError`. If called with *ierr* of ``0``, the error code returned by a call to :c:func:`!GetLastError` is used instead. It calls the Win32 function :c:func:`!FormatMessage` to retrieve the Windows description of error code given by *ierr* or :c:func:`!GetLastError`, then it constructs a :exc:`OSError` object with the :attr:`~OSError.winerror` attribute set to the error code, the :attr:`~OSError.strerror` attribute set to the corresponding error message (gotten from :c:func:`!FormatMessage`), and then calls ``PyErr_SetObject(PyExc_OSError, object)``. This function always returns ``NULL``.
ru: Это удобная функция для вызова :exc:`OSError`. Если вызывается с *ierr* из ``0``, вместо этого используется код ошибки, возвращаемый вызовом :c:func:`!GetLastError`. Он вызывает функцию Win32 :c:func:`!FormatMessage` для получения описания кода ошибки Windows, заданного *ierr* или :c:func:`!GetLastError`, затем он создает объект :exc:`OSError` с атрибуту :attr:`~OSError.winerror` присвоен код ошибки, атрибуту :attr:`~OSError.strerror` присвоено соответствующее сообщение об ошибке (полученное из :c:func:`!FormatMessage`), а затем вызывает ``PyErr_SetObject(PyExc_OSError, object)``. Эта функция всегда возвращает NULL.
zh_tw: Это удобная функция для вызова :exc:`OSError`. Если вызывается с *ierr* из ``0``, вместо этого используется код ошибки, возвращаемый вызовом :c:func:`!GetLastError`. Он вызывает функцию Win32 :c:func:`!FormatMessage` для получения описания кода ошибки Windows, заданного *ierr* или :c:func:`!GetLastError`, затем он создает объект :exc:`OSError` с атрибуту :attr:`~OSError.winerror` присвоен код ошибки, атрибуту :attr:`~OSError.strerror` присвоено соответствующее сообщение об ошибке (полученное из :c:func:`!FormatMessage`), а затем вызывает ``PyErr_SetObject(PyExc_OSError, object)``. Эта функция всегда возвращает NULL.

source: Availability
ru: Доступность
zh_tw: Dostępność

source: Similar to :c:func:`PyErr_SetFromWindowsErr`, with an additional parameter specifying the exception type to be raised.
ru: Аналогично :c:func:`PyErr_SetFromWindowsErr`, с дополнительным параметром, указывающим тип вызываемого исключения.
zh_tw: Подібно до :c:func:`PyErr_SetFromWindowsErr`, з додатковим параметром, що визначає тип винятку, який буде створено.

source: Similar to :c:func:`PyErr_SetFromWindowsErr`, with the additional behavior that if *filename* is not ``NULL``, it is decoded from the filesystem encoding (:func:`os.fsdecode`) and passed to the constructor of :exc:`OSError` as a third parameter to be used to define the :attr:`!filename` attribute of the exception instance.
ru: Аналогично :c:func:`PyErr_SetFromWindowsErr`, с дополнительным поведением, заключающимся в том, что если *filename* не равно ``NULL``, оно декодируется из кодировки файловой системы (:func:`os.fsdecode`) и передается конструктору :exc:`OSError` в качестве третьего параметра, который будет использоваться для определения атрибута :attr:`!filename` экземпляра исключения.
zh_tw: Аналогично :c:func:`PyErr_SetFromWindowsErr`, с дополнительным поведением, заключающимся в том, что если *filename* не равно ``NULL``, оно декодируется из кодировки файловой системы (:func:`os.fsdecode`) и передается конструктору :exc:`OSError` в качестве третьего параметра, который будет использоваться для определения атрибута :attr:`!filename` экземпляра исключения.

source: Similar to :c:func:`PyErr_SetExcFromWindowsErr`, with the additional behavior that if *filename* is not ``NULL``, it is passed to the constructor of :exc:`OSError` as a third parameter to be used to define the :attr:`!filename` attribute of the exception instance.
ru: Аналогично :c:func:`PyErr_SetExcFromWindowsErr`, с дополнительным поведением, заключающимся в том, что если *filename* не равно ``NULL``, оно передается конструктору :exc:`OSError` в качестве третьего параметра, который будет использоваться для определения :attr:`!filename` атрибута экземпляра исключения.
zh_tw: Аналогично :c:func:`PyErr_SetExcFromWindowsErr`, с дополнительным поведением, заключающимся в том, что если *filename* не равно ``NULL``, оно передается конструктору :exc:`OSError` в качестве третьего параметра, который будет использоваться для определения :attr:`!filename` атрибута экземпляра исключения.

source: Similar to :c:func:`PyErr_SetExcFromWindowsErrWithFilenameObject`, but accepts a second filename object.
ru: Аналогично :c:func:`PyErr_SetExcFromWindowsErrWithFilenameObject`, но принимает второе имя объекта.
zh_tw: Подібно до :c:func:`PyErr_SetExcFromWindowsErrWithFilenameObject`, але приймає другий об’єкт імені файлу.

source: Similar to :c:func:`PyErr_SetFromWindowsErrWithFilename`, with an additional parameter specifying the exception type to be raised.
ru: Аналогично :c:func:`PyErr_SetFromWindowsErrWithFilename`, с дополнительным параметром, указывающим тип вызываемого исключения.
zh_tw: Подібно до :c:func:`PyErr_SetFromWindowsErrWithFilename`, з додатковим параметром, що визначає тип винятку, який буде створено.

source: This is a convenience function to raise :exc:`ImportError`. *msg* will be set as the exception's message string. *name* and *path*, both of which can be ``NULL``, will be set as the :exc:`ImportError`'s respective ``name`` and ``path`` attributes.
ru: Это удобная функция для вызова :exc:`ImportError`. *msg* будет задано в качестве строки сообщения об исключении. *name* и *path*, оба из которых могут быть ``NULL``, будут установлены в качестве соответствующих атрибутов ``name`` и ``path`` для :exc:`ImportError`.
zh_tw: Це зручна функція для виклику :exc:`ImportError`. *msg* буде встановлено як рядок повідомлення винятку. *name* і *path*, обидва з яких можуть мати значення ``NULL``, буде встановлено як відповідні атрибути ``name`` і ``path`` :exc:`ImportError`.

source: Much like :c:func:`PyErr_SetImportError` but this function allows for specifying a subclass of :exc:`ImportError` to raise.
ru: Очень похоже на :c:func:`PyErr_SetImportError`, но эта функция позволяет указать подкласс :exc:`ImportError` для вызова.
zh_tw: Дуже схоже на :c:func:`PyErr_SetImportError`, але ця функція дозволяє вказати підклас :exc:`ImportError` для підвищення.

source: Set file, line, and offset information for the current exception. If the current exception is not a :exc:`SyntaxError`, then it sets additional attributes, which make the exception printing subsystem think the exception is a :exc:`SyntaxError`.
ru: Задает информацию о файле, строке и смещении для текущего исключения. Если текущее исключение не является :exc:`SyntaxError`, то оно устанавливает дополнительные атрибуты, которые заставляют подсистему печати исключений думать, что исключение является :exc:`SyntaxError`.
zh_tw: Установіть інформацію про файл, рядок і зсув для поточного винятку. Якщо поточний виняток не є :exc:`SyntaxError`, тоді він встановлює додаткові атрибути, які змушують підсистему друку виключення вважати, що виняток є :exc:`SyntaxError`.

source: Like :c:func:`PyErr_SyntaxLocationObject`, but *filename* is a byte string decoded from the :term:`filesystem encoding and error handler`.
ru: Как :c:func:`PyErr_SyntaxLocationObject`, но *filename* - это байтовая строка, декодированная из :term:`filesystem encoding and error handler`.
zh_tw: Подібно до :c:func:`PyErr_SyntaxLocationObject`, але *filename* — це рядок байтів, декодований з :term:`filesystem encoding and error handler`.

source: Like :c:func:`PyErr_SyntaxLocationEx`, but the *col_offset* parameter is omitted.
ru: Как :c:func:`PyErr_SyntaxLocationEx`, но параметр *col_offset* опущен.
zh_tw: Як :c:func:`PyErr_SyntaxLocationEx`, але параметр *col_offset* опущено.

source: This is a shorthand for ``PyErr_SetString(PyExc_SystemError, message)``, where *message* indicates that an internal operation (e.g. a Python/C API function) was invoked with an illegal argument. It is mostly for internal use.
ru: Это сокращение от ``PyErr_SetString(PyExc_SystemError, message)``, где *message* указывает, что внутренняя операция (например, функция API Python/C) была вызвана с недопустимым аргументом. В основном для внутреннего использования.
zh_tw: Це скорочення для ``PyErr_SetString(PyExc_SystemError, повідомлення)``, де *повідомлення* вказує на те, що внутрішня операція (наприклад, функція Python/C API) була викликана з недопустимим аргументом. В основному він призначений для внутрішнього використання.

source: Issuing warnings
ru: Выдача предупреждений
zh_tw: Menerbitkan peringatan

source: Use these functions to issue warnings from C code. They mirror similar functions exported by the Python :mod:`warnings` module. They normally print a warning message to *sys.stderr*; however, it is also possible that the user has specified that warnings are to be turned into errors, and in that case they will raise an exception. It is also possible that the functions raise an exception because of a problem with the warning machinery. The return value is ``0`` if no exception is raised, or ``-1`` if an exception is raised. (It is not possible to determine whether a warning message is actually printed, nor what the reason is for the exception; this is intentional.) If an exception is raised, the caller should do its normal exception handling (for example, :c:func:`Py_DECREF` owned references and return an error value).
ru: Используйте эти функции для выдачи предупреждений из кода на C. Они отражают аналогичные функции, экспортируемые модулем Python :mod:`warnings`. Обычно они выводят предупреждающее сообщение в *sys.stderr*; однако также возможно, что пользователь указал, что предупреждения должны быть преобразованы в ошибки, и в этом случае они вызовут исключение. Также возможно, что функции генерируют исключение из-за проблемы с механизмом предупреждения. Возвращаемое значение равно ``0``, если исключение не генерируется, или ``-1``, если возникает исключение. (Невозможно определить, действительно ли напечатано предупреждающее сообщение, а также какова причина исключения; это сделано намеренно.) Если возникает исключение, вызывающий объект должен выполнить свою обычную обработку исключений (например, ссылки, принадлежащие :c:func:`Py_DECREF`, и вернуть значение ошибки).
zh_tw: Використовуйте ці функції, щоб видавати попередження з коду C. Вони відображають аналогічні функції, експортовані модулем Python :mod:`warnings`. Зазвичай вони друкують попередження на *sys.stderr*; однак також можливо, що користувач вказав, що попередження потрібно перетворити на помилки, і в такому випадку вони викличуть виняток. Також можливо, що функції викликають виняток через проблему з механізмом попередження. Повертається значення ``0``, якщо не викликається виняткова ситуація, або ``-1``, якщо виникає виняток. (Неможливо визначити, чи справді друкується попереджувальне повідомлення, а також причину винятку; це навмисно.) Якщо виникає виняток, абонент, що викликає, має виконати звичайну обробку винятків (наприклад, :c:func:`Py_DECREF` належать посилання та повертають значення помилки).

source: Issue a warning message. The *category* argument is a warning category (see below) or ``NULL``; the *message* argument is a UTF-8 encoded string. *stack_level* is a positive number giving a number of stack frames; the warning will be issued from the currently executing line of code in that stack frame. A *stack_level* of 1 is the function calling :c:func:`PyErr_WarnEx`, 2 is the function above that, and so forth.
ru: Выдает предупреждающее сообщение. Аргумент *category* - это категория предупреждения (см. ниже) или ``NULL``; аргумент *message* - это строка в кодировке UTF-8. *stack_level* - положительное число, указывающее количество фреймов стека; предупреждение будет выдано из текущей выполняемой строки кода в этом фрейме стека. A *stack_level*, равный 1 - это функция, вызывающая :c:func:`PyErr_WarnEx`, 2 - функция выше этой, и так далее.
zh_tw: Видавати попереджувальне повідомлення. Аргумент *category* є категорією попередження (див. нижче) або ``NULL``; аргумент *message* — це рядок у кодуванні UTF-8. *stack_level* — додатне число, яке дає кількість кадрів стека; попередження буде видано з поточного рядка коду в цьому фреймі стека. *Stack_level* 1 — це функція, яка викликає :c:func:`PyErr_WarnEx`, 2 — це функція, яка стоїть вище, і так далі.

source: Warning categories must be subclasses of :c:data:`PyExc_Warning`; :c:data:`PyExc_Warning` is a subclass of :c:data:`PyExc_Exception`; the default warning category is :c:data:`PyExc_RuntimeWarning`. The standard Python warning categories are available as global variables whose names are enumerated at :ref:`standardwarningcategories`.
ru: Категории предупреждений должны быть подклассами :c:data:`PyExc_Warning`; :c:data:`PyExc_Warning` является подклассом :c:data:`PyExc_Exception`; категория предупреждений по умолчанию :c:data:`PyExc_RuntimeWarning`. Стандартные категории предупреждений Python доступны в виде глобальных переменных, имена которых перечислены по адресу :ref:`standardwarningcategories`.
zh_tw: Категорії попереджень мають бути підкласами :c:data:`PyExc_Warning`; :c:data:`PyExc_Warning` є підкласом :c:data:`PyExc_Exception`; стандартна категорія попередження: :c:data:`PyExc_RuntimeWarning`. Стандартні категорії попереджень Python доступні як глобальні змінні, імена яких пронумеровані в :ref:`standardwarningcategories`.

source: For information about warning control, see the documentation for the :mod:`warnings` module and the :option:`-W` option in the command line documentation. There is no C API for warning control.
ru: Информацию об управлении предупреждениями смотрите в документации к модулю :mod:`warnings` и опции :option:`-W` в документации по командной строке. Для управления предупреждениями нет C API.
zh_tw: Щоб отримати інформацію про керування попередженнями, перегляньте документацію до модуля :mod:`warnings` і опції :option:`-W` у документації командного рядка. Немає C API для керування попередженнями.

source: Issue a warning message with explicit control over all warning attributes. This is a straightforward wrapper around the Python function :func:`warnings.warn_explicit`; see there for more information. The *module* and *registry* arguments may be set to ``NULL`` to get the default effect described there.
ru: Выдает предупреждающее сообщение с явным контролем над всеми атрибутами предупреждения. Это простая оболочка для функции Python :func:`warnings.warn_explicit`; смотрите там для получения дополнительной информации. Аргументам *module* и *registry* может быть присвоено значение ``NULL``, чтобы получить эффект по умолчанию, описанный там.
zh_tw: Видавати попереджувальне повідомлення з явним керуванням усіма атрибутами попередження. Це проста обгортка функції Python :func:`warnings.warn_explicit`; дивіться там для отримання додаткової інформації. Для аргументів *module* і *registry* можна встановити значення ``NULL``, щоб отримати описаний там ефект за замовчуванням.

source: Similar to :c:func:`PyErr_WarnExplicitObject` except that *message* and *module* are UTF-8 encoded strings, and *filename* is decoded from the :term:`filesystem encoding and error handler`.
ru: Аналогично :c:func:`PyErr_WarnExplicitObject`, за исключением того, что *message* и *module* являются строками в кодировке UTF-8, а *filename* декодируется из :term:`filesystem encoding and error handler`.
zh_tw: Подібно до :c:func:`PyErr_WarnExplicitObject`, за винятком того, що *message* і *module* є рядками в кодуванні UTF-8, а *filename* декодується з :term:`filesystem encoding and error handler`.

source: Function similar to :c:func:`PyErr_WarnEx`, but use :c:func:`PyUnicode_FromFormat` to format the warning message. *format* is an ASCII-encoded string.
ru: Функция, аналогичная :c:func:`PyErr_WarnEx`, но использует :c:func:`PyUnicode_FromFormat` для форматирования предупреждающего сообщения. *format* - это строка в кодировке ASCII.
zh_tw: Функція схожа на :c:func:`PyErr_WarnEx`, але використовуйте :c:func:`PyUnicode_FromFormat` для форматування повідомлення попередження. *format* — це рядок у кодуванні ASCII.

source: Function similar to :c:func:`PyErr_WarnFormat`, but *category* is :exc:`ResourceWarning` and it passes *source* to :class:`!warnings.WarningMessage`.
ru: Функция аналогична :c:func:`PyErr_WarnFormat`, но *category* - это :exc:`ResourceWarning`, и она передает *source* в :class:`!warnings.WarningMessage`.
zh_tw: Функция аналогична :c:func:`PyErr_WarnFormat`, но *category* - это :exc:`ResourceWarning`, и она передает *source* в :class:`!warnings.WarningMessage`.

source: Querying the error indicator
ru: Запрос индикатора ошибки
zh_tw: Meminta indikator kesalahan

source: Test whether the error indicator is set. If set, return the exception *type* (the first argument to the last call to one of the ``PyErr_Set*`` functions or to :c:func:`PyErr_Restore`). If not set, return ``NULL``. You do not own a reference to the return value, so you do not need to :c:func:`Py_DECREF` it.
ru: Проверяет, установлен ли индикатор ошибки. Если установлен, возвращает исключение *type* (первый аргумент последнего вызова одной из функций ``PyErr_Set*`` или :c:func:`PyErr_Restore`). Если не задано, возвращает ``NULL``. У вас нет ссылки на возвращаемое значение, поэтому вам не нужно её :c:func:`Py_DECREF`.
zh_tw: Проверяет, установлен ли индикатор ошибки. Если установлен, возвращает исключение *type* (первый аргумент последнего вызова одной из функций ``PyErr_Set*`` или :c:func:`PyErr_Restore`). Если не задано, возвращает ``NULL``. У вас нет ссылки на возвращаемое значение, поэтому вам не нужно её :c:func:`Py_DECREF`.

source: Do not compare the return value to a specific exception; use :c:func:`PyErr_ExceptionMatches` instead, shown below. (The comparison could easily fail since the exception may be an instance instead of a class, in the case of a class exception, or it may be a subclass of the expected exception.)
ru: Не сравнивайте возвращаемое значение с конкретным исключением; вместо этого используйте :c:func:`PyErr_ExceptionMatches`, как показано ниже. (Сравнение может легко завершиться неудачей, поскольку исключение может быть экземпляром вместо класса, в случае исключения класса, или это может быть подкласс ожидаемого исключения.)
zh_tw: Не порівнюйте повернуте значення з певним винятком; замість цього використовуйте :c:func:`PyErr_ExceptionMatches`, як показано нижче. (Порівняння може бути легко невдалим, оскільки виняток може бути екземпляром замість класу, у випадку винятку класу, або він може бути підкласом очікуваного винятку.)

source: Equivalent to ``PyErr_GivenExceptionMatches(PyErr_Occurred(), exc)``. This should only be called when an exception is actually set; a memory access violation will occur if no exception has been raised.
ru: Эквивалентно ``PyErr_GivenExceptionMatches(PyErr_Occurred(), exc)``. Это должно вызываться только тогда, когда действительно установлено исключение; произойдет нарушение доступа к памяти, если исключение не было вызвано.
zh_tw: Еквівалент ``PyErr_GivenExceptionMatches(PyErr_Occurred(), exc)``. Це слід викликати лише тоді, коли фактично встановлено виняток; порушення доступу до пам'яті відбудеться, якщо не було викликано жодного винятку.

source: Return true if the *given* exception matches the exception type in *exc*. If *exc* is a class object, this also returns true when *given* is an instance of a subclass. If *exc* is a tuple, all exception types in the tuple (and recursively in subtuples) are searched for a match.
ru: Возвращает значение true, если исключение *given* соответствует типу исключения в *exc*. Если *exc* является объектом класса, это также возвращает значение true, когда *given* является экземпляром подкласса. Если *exc* является кортежем, выполняется поиск совпадения по всем типам исключений в кортеже (и рекурсивно в подтипах).
zh_tw: Повертає true, якщо *given* виняток відповідає типу винятку в *exc*. Якщо *exc* є об’єктом класу, це також повертає true, коли *given* є екземпляром підкласу. Якщо *exc* є кортежем, усі типи винятків у кортежі (і рекурсивно в підкортежах) шукаються на відповідність.

source: Return the exception currently being raised, clearing the error indicator at the same time. Return ``NULL`` if the error indicator is not set.
ru: Возвращает вызываемое в данный момент исключение, одновременно очищая индикатор ошибки. Возвращает ``NULL``, если индикатор ошибки не установлен.
zh_tw: Возвращает вызываемое в данный момент исключение, одновременно очищая индикатор ошибки. Возвращает ``NULL``, если индикатор ошибки не установлен.

source: This function is used by code that needs to catch exceptions, or code that needs to save and restore the error indicator temporarily.
ru: Эта функция используется кодом, которому необходимо перехватывать исключения, или кодом, которому необходимо временно сохранять и восстанавливать индикатор ошибки.
zh_tw: Эта функция используется кодом, которому необходимо перехватывать исключения, или кодом, которому необходимо временно сохранять и восстанавливать индикатор ошибки.

source: For example::
ru: Например::
zh_tw: Na przykład::

source: :c:func:`PyErr_GetHandledException`, to save the exception currently being handled.
ru: :c:func:`PyErr_GetHandledException`, для сохранения обрабатываемого в данный момент исключения.
zh_tw: :c:func:`PyErr_GetHandledException`, для сохранения обрабатываемого в данный момент исключения.

source: Set *exc* as the exception currently being raised, clearing the existing exception if one is set.
ru: Устанавливает *exc* в качестве вызываемого в данный момент исключения, очистив существующее исключение, если оно установлено.
zh_tw: Устанавливает *exc* в качестве вызываемого в данный момент исключения, очистив существующее исключение, если оно установлено.

source: This call steals a reference to *exc*, which must be a valid exception.
ru: Этот вызов забирает ссылку на *exc*, которая должна быть допустимым исключением.
zh_tw: Этот вызов забирает ссылку на *exc*, которая должна быть допустимым исключением.

source: Use :c:func:`PyErr_GetRaisedException` instead.
ru: Вместо этого используется :c:func:`PyErr_GetRaisedException`.
zh_tw: Вместо этого используется :c:func:`PyErr_GetRaisedException`.

source: Retrieve the error indicator into three variables whose addresses are passed. If the error indicator is not set, set all three variables to ``NULL``. If it is set, it will be cleared and you own a reference to each object retrieved. The value and traceback object may be ``NULL`` even when the type object is not.
ru: Извлекает индикатор ошибки из трех переменных, адреса которых переданы. Если индикатор ошибки не установлен, устанавливает для всех трех переменных значение ``NULL``. Если он установлен, он будет удален, и у вас будет собственная ссылка на каждый извлеченный объект. Значение и объект обратной трассировки могут быть ``NULL``, даже если объект типа таковым не является.
zh_tw: Отримати індикатор помилки в трьох змінних, адреси яких передано. Якщо індикатор помилки не встановлено, установіть для всіх трьох змінних значення ``NULL``. Якщо його встановлено, його буде очищено, і ви матимете посилання на кожен отриманий об’єкт. Значення та об’єкт трасування можуть бути ``NULL``, навіть якщо об’єкт типу не є таким.

source: This function is normally only used by legacy code that needs to catch exceptions or save and restore the error indicator temporarily.
ru: Эта функция обычно используется только устаревшим кодом, которому необходимо перехватывать исключения или временно сохранять и восстанавливать индикатор ошибки.
zh_tw: Эта функция обычно используется только устаревшим кодом, которому необходимо перехватывать исключения или временно сохранять и восстанавливать индикатор ошибки.
