Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/exceptions.po
Languages: ru, zh_tw

source: Use :c:func:`PyErr_SetRaisedException` instead.
ru: Вместо этого используйте :c:func:`PyErr_SetRaisedException`.
zh_tw: Вместо этого используйте :c:func:`PyErr_SetRaisedException`.

source: Set the error indicator from the three objects, *type*, *value*, and *traceback*, clearing the existing exception if one is set. If the objects are ``NULL``, the error indicator is cleared. Do not pass a ``NULL`` type and non-``NULL`` value or traceback. The exception type should be a class. Do not pass an invalid exception type or value. (Violating these rules will cause subtle problems later.) This call takes away a reference to each object: you must own a reference to each object before the call and after the call you no longer own these references. (If you don't understand this, don't use this function. I warned you.)
ru: Устанавливает индикатор ошибки для трех объектов: *type*, *value* и *traceback*, удалив существующее исключение, если оно установлено. Если объекты имеют значение ``NULL``, индикатор ошибки будет удален. Не передает тип ``NULL`` и значение, отличное от ``NULL``, или данные обратной трассировки. Типом исключения должен быть класс. Не передает недопустимый тип исключения или значение. (Нарушение этих правил приведет к возникновению незначительных проблем в дальнейшем). Этот вызов удаляет ссылку на каждый объект: перед вызовом у вас должна быть ссылка на каждый объект, а после вызова вы больше не будете владеть этими ссылками. (Если вы этого не понимаете, не используйте эту функцию. Я вас предупреждал.)
zh_tw: Устанавливает индикатор ошибки для трех объектов: *type*, *value* и *traceback*, удалив существующее исключение, если оно установлено. Если объекты имеют значение ``NULL``, индикатор ошибки будет удален. Не передает тип ``NULL`` и значение, отличное от ``NULL``, или данные обратной трассировки. Типом исключения должен быть класс. Не передает недопустимый тип исключения или значение. (Нарушение этих правил приведет к возникновению незначительных проблем в дальнейшем). Этот вызов удаляет ссылку на каждый объект: перед вызовом у вас должна быть ссылка на каждый объект, а после вызова вы больше не будете владеть этими ссылками. (Если вы этого не понимаете, не используйте эту функцию. Я вас предупреждал.)

source: This function is normally only used by legacy code that needs to save and restore the error indicator temporarily. Use :c:func:`PyErr_Fetch` to save the current error indicator.
ru: Эта функция обычно используется только в устаревшем коде, которому необходимо временно сохранить и восстановить индикатор ошибки. Используйте :c:func:`PyErr_Fetch` для сохранения текущего индикатора ошибки.
zh_tw: Эта функция обычно используется только в устаревшем коде, которому необходимо временно сохранить и восстановить индикатор ошибки. Используйте :c:func:`PyErr_Fetch` для сохранения текущего индикатора ошибки.

source: Use :c:func:`PyErr_GetRaisedException` instead, to avoid any possible de-normalization.
ru: Вместо этого используйте :c:func:`PyErr_GetRaisedException`, чтобы избежать любой возможной нормализации.
zh_tw: Вместо этого используйте :c:func:`PyErr_GetRaisedException`, чтобы избежать любой возможной нормализации.

source: Under certain circumstances, the values returned by :c:func:`PyErr_Fetch` below can be "unnormalized", meaning that ``*exc`` is a class object but ``*val`` is not an instance of the same class. This function can be used to instantiate the class in that case. If the values are already normalized, nothing happens. The delayed normalization is implemented to improve performance.
ru: При определенных обстоятельствах значения, возвращаемые :c:func:`PyErr_Fetch`, приведенные ниже, могут быть "ненормализованными", что означает, что ``*exc`` является объектом класса, но ``*val`` не является экземпляром того же класса. В этом случае эту функцию можно использовать для создания экземпляра класса. Если значения уже нормализованы, ничего не происходит. Отложенная нормализация реализована для повышения производительности.
zh_tw: За певних обставин значення, які повертає :c:func:`PyErr_Fetch` нижче, можуть бути "ненормалізованими", тобто ``*exc`` є об’єктом класу, але ``*val`` не є екземпляром того самого класу . У цьому випадку цю функцію можна використовувати для створення екземпляра класу. Якщо значення вже нормалізовані, нічого не відбувається. Відкладену нормалізацію реалізовано для покращення продуктивності.

source: This function *does not* implicitly set the :attr:`~BaseException.__traceback__` attribute on the exception value. If setting the traceback appropriately is desired, the following additional snippet is needed::
ru: Эта функция *не устанавливает* неявно атрибут :attr:`~BaseException.__traceback__` для значения исключения. Если требуется соответствующая настройка трассировки, необходим следующий дополнительный фрагмент кода::
zh_tw: Эта функция *не устанавливает* неявно атрибут :attr:`~BaseException.__traceback__` для значения исключения. Если требуется соответствующая настройка трассировки, необходим следующий дополнительный фрагмент кода::

source: Retrieve the active exception instance, as would be returned by :func:`sys.exception`. This refers to an exception that was *already caught*, not to an exception that was freshly raised. Returns a new reference to the exception or ``NULL``. Does not modify the interpreter's exception state.
ru: Извлекает активный экземпляр исключения, как это было бы возвращено с помощью :func:`sys.exception`. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было недавно создано. Возвращает новую ссылку на исключение или ``NULL``. Не изменяет состояние исключения интерпретатора.
zh_tw: Извлекает активный экземпляр исключения, как это было бы возвращено с помощью :func:`sys.exception`. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было недавно создано. Возвращает новую ссылку на исключение или ``NULL``. Не изменяет состояние исключения интерпретатора.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_SetHandledException` to restore or clear the exception state.
ru: Эта функция обычно не используется кодом, который хочет обрабатывать исключения. Скорее, ее можно использовать, когда коду необходимо временно сохранить и восстановить состояние исключения. Используйте :c:func:`PyErr_SetHandledException` для восстановления или очистки состояния исключения.
zh_tw: Эта функция обычно не используется кодом, который хочет обрабатывать исключения. Скорее, ее можно использовать, когда коду необходимо временно сохранить и восстановить состояние исключения. Используйте :c:func:`PyErr_SetHandledException` для восстановления или очистки состояния исключения.

source: Set the active exception, as known from ``sys.exception()``. This refers to an exception that was *already caught*, not to an exception that was freshly raised. To clear the exception state, pass ``NULL``.
ru: Устанавливает активное исключение, как известно из ``sys.exception()``. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было вызвано недавно. Чтобы очистить состояние исключения, введите ``NULL``.
zh_tw: Устанавливает активное исключение, как известно из ``sys.exception()``. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было вызвано недавно. Чтобы очистить состояние исключения, введите ``NULL``.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_GetHandledException` to get the exception state.
ru: Эта функция обычно не используется кодом, который хочет обрабатывать исключения. Скорее, ее можно использовать, когда коду необходимо временно сохранить и восстановить состояние исключения. Используйте :c:func:`PyErr_GetHandledException`, чтобы получить состояние исключения.
zh_tw: Эта функция обычно не используется кодом, который хочет обрабатывать исключения. Скорее, ее можно использовать, когда коду необходимо временно сохранить и восстановить состояние исключения. Используйте :c:func:`PyErr_GetHandledException`, чтобы получить состояние исключения.

source: Retrieve the old-style representation of the exception info, as known from :func:`sys.exc_info`. This refers to an exception that was *already caught*, not to an exception that was freshly raised. Returns new references for the three objects, any of which may be ``NULL``. Does not modify the exception info state. This function is kept for backwards compatibility. Prefer using :c:func:`PyErr_GetHandledException`.
ru: Извлекает информацию об исключении в старом формате, известную из :func:`sys.exc_info`. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было вызвано недавно. Возвращает новые ссылки для трех объектов, любой из которых может быть ``NULL``. Не изменяет состояние информации об исключении. Эта функция сохранена для обеспечения обратной совместимости. Предпочтительно использовать :c:func:`PyErr_GetHandledException`.
zh_tw: Извлекает информацию об исключении в старом формате, известную из :func:`sys.exc_info`. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было вызвано недавно. Возвращает новые ссылки для трех объектов, любой из которых может быть ``NULL``. Не изменяет состояние информации об исключении. Эта функция сохранена для обеспечения обратной совместимости. Предпочтительно использовать :c:func:`PyErr_GetHandledException`.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_SetExcInfo` to restore or clear the exception state.
ru: Эта функция обычно не используется кодом, который хочет обрабатывать исключения. Скорее, ее можно использовать, когда коду необходимо временно сохранить и восстановить состояние исключения. Используйте :c:func:`PyErr_SetExcInfo` для восстановления или очистки состояния исключения.
zh_tw: Ця функція зазвичай не використовується кодом, який хоче обробляти винятки. Натомість його можна використовувати, коли коду потрібно тимчасово зберегти та відновити винятковий стан. Використовуйте :c:func:`PyErr_SetExcInfo`, щоб відновити або видалити винятковий стан.

source: Set the exception info, as known from ``sys.exc_info()``. This refers to an exception that was *already caught*, not to an exception that was freshly raised. This function steals the references of the arguments. To clear the exception state, pass ``NULL`` for all three arguments. This function is kept for backwards compatibility. Prefer using :c:func:`PyErr_SetHandledException`.
ru: Задает информацию об исключении, как это известно из ``sys.exc_info()``. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было вызвано недавно. Эта функция крадет ссылки на аргументы. Чтобы очистить состояние исключения, передайте ``NULL`` для всех трех аргументов. Эта функция сохранена для обеспечения обратной совместимости. Предпочтительно использовать :c:func:`PyErr_SetHandledException`.
zh_tw: Задает информацию об исключении, как это известно из ``sys.exc_info()``. Это относится к исключению, которое было *уже перехвачено*, а не к исключению, которое было вызвано недавно. Эта функция крадет ссылки на аргументы. Чтобы очистить состояние исключения, передайте ``NULL`` для всех трех аргументов. Эта функция сохранена для обеспечения обратной совместимости. Предпочтительно использовать :c:func:`PyErr_SetHandledException`.

source: This function is not normally used by code that wants to handle exceptions. Rather, it can be used when code needs to save and restore the exception state temporarily. Use :c:func:`PyErr_GetExcInfo` to read the exception state.
ru: Эта функция обычно не используется кодом, который хочет обрабатывать исключения. Скорее, ее можно использовать, когда коду необходимо временно сохранить и восстановить состояние исключения. Используйте :c:func:`PyErr_GetExcInfo` для считывания состояния исключения.
zh_tw: Ця функція зазвичай не використовується кодом, який хоче обробляти винятки. Натомість його можна використовувати, коли коду потрібно тимчасово зберегти та відновити винятковий стан. Використовуйте :c:func:`PyErr_GetExcInfo`, щоб прочитати винятковий стан.

source: The ``type`` and ``traceback`` arguments are no longer used and can be NULL. The interpreter now derives them from the exception instance (the ``value`` argument). The function still steals references of all three arguments.
ru: Аргументы ``type`` и ``traceback`` больше не используются и могут иметь значение NULL. Интерпретатор теперь извлекает их из экземпляра исключения (аргумент ``value``). Функция по-прежнему перехватывает ссылки на все три аргумента.
zh_tw: Аргументы ``type`` и ``traceback`` больше не используются и могут иметь значение NULL. Интерпретатор теперь извлекает их из экземпляра исключения (аргумент ``value``). Функция по-прежнему перехватывает ссылки на все три аргумента.

source: Signal Handling
ru: Обработка сигналов
zh_tw: Penanganan Sinyal *Signal*

source: This function interacts with Python's signal handling.
ru: Эта функция взаимодействует с обработкой сигналов в Python.
zh_tw: Ця функція взаємодіє з обробкою сигналів Python.

source: If the function is called from the main thread and under the main Python interpreter, it checks whether a signal has been sent to the processes and if so, invokes the corresponding signal handler. If the :mod:`signal` module is supported, this can invoke a signal handler written in Python.
ru: Если функция вызывается из основного потока и под управлением основного интерпретатора Python, она проверяет, был ли отправлен сигнал процессам, и если да, то вызывает соответствующий обработчик сигналов. Если поддерживается модуль :mod:`signal`, это может вызвать обработчик сигналов, написанный на Python.
zh_tw: Якщо функція викликається з головного потоку та під основним інтерпретатором Python, вона перевіряє, чи було надіслано сигнал до процесів, і якщо так, викликає відповідний обробник сигналу. Якщо модуль :mod:`signal` підтримується, це може викликати обробник сигналів, написаний на Python.

source: The function attempts to handle all pending signals, and then returns ``0``. However, if a Python signal handler raises an exception, the error indicator is set and the function returns ``-1`` immediately (such that other pending signals may not have been handled yet: they will be on the next :c:func:`PyErr_CheckSignals()` invocation).
ru: Функция пытается обработать все ожидающие сигналы, а затем возвращает ``0``. Однако, если обработчик сигналов Python вызывает исключение, устанавливается индикатор ошибки, и функция немедленно возвращает значение ``-1`` (так что другие ожидающие сигналы, возможно, еще не были обработаны: они будут при следующем вызове :c:func:`PyErr_CheckSignals()`).
zh_tw: Функція намагається обробити всі незавершені сигнали, а потім повертає ``0``. Однак, якщо обробник сигналів Python викликає виняток, індикатор помилки встановлюється, і функція негайно повертає ``-1`` (наприклад, інші сигнали, що очікують на розгляд, ще не були оброблені: вони будуть на наступному :c:func:`PyErr_CheckSignals()` виклик).

source: If the function is called from a non-main thread, or under a non-main Python interpreter, it does nothing and returns ``0``.
ru: Если функция вызывается из не основного потока или с помощью не основного интерпретатора Python, она ничего не делает и возвращает ``0``.
zh_tw: Якщо функція викликається з неосновного потоку або під неосновним інтерпретатором Python, вона нічого не робить і повертає ``0``.

source: This function can be called by long-running C code that wants to be interruptible by user requests (such as by pressing Ctrl-C).
ru: Эта функция может быть вызвана длительно выполняющимся кодом на C, который хочет, чтобы его можно было прерывать запросами пользователя (например, нажатием Ctrl-C).
zh_tw: Ця функція може бути викликана довгостроковим кодом C, який хоче бути перерваним запитами користувача (наприклад, натисканням Ctrl-C).

source: The default Python signal handler for :c:macro:`!SIGINT` raises the :exc:`KeyboardInterrupt` exception.
ru: Обработчик сигналов Python по умолчанию для :c:macro:`!SIGINT` вызывает исключение :exc:`KeyboardInterrupt`.
zh_tw: Обработчик сигналов Python по умолчанию для :c:macro:`!SIGINT` вызывает исключение :exc:`KeyboardInterrupt`.

source: Simulate the effect of a :c:macro:`!SIGINT` signal arriving. This is equivalent to ``PyErr_SetInterruptEx(SIGINT)``.
ru: Имитирует эффект поступления сигнала :c:macro:`!SIGINT`. Это эквивалентно ``PyErr_SetInterruptEx(SIGINT)``.
zh_tw: Имитирует эффект поступления сигнала :c:macro:`!SIGINT`. Это эквивалентно ``PyErr_SetInterruptEx(SIGINT)``.

source: Simulate the effect of a signal arriving. The next time :c:func:`PyErr_CheckSignals` is called, the Python signal handler for the given signal number will be called.
ru: Имитирует эффект поступления сигнала. При следующем вызове :c:func:`PyErr_CheckSignals` будет вызван обработчик сигнала Python для данного номера сигнала.
zh_tw: Імітація ефекту надходження сигналу. Під час наступного виклику :c:func:`PyErr_CheckSignals` буде викликано обробник сигналу Python для заданого номера сигналу.

source: This function can be called by C code that sets up its own signal handling and wants Python signal handlers to be invoked as expected when an interruption is requested (for example when the user presses Ctrl-C to interrupt an operation).
ru: Эта функция может быть вызвана кодом на C, который настраивает свою собственную обработку сигналов и хочет, чтобы обработчики сигналов Python вызывались ожидаемым образом при запросе прерывания (например, когда пользователь нажимает Ctrl-C, чтобы прервать операцию).
zh_tw: Цю функцію можна викликати за допомогою коду C, який налаштовує власну обробку сигналів і хоче, щоб обробники сигналів Python викликалися належним чином, коли надходить запит на переривання (наприклад, коли користувач натискає Ctrl-C, щоб перервати операцію).

source: If the given signal isn't handled by Python (it was set to :py:const:`signal.SIG_DFL` or :py:const:`signal.SIG_IGN`), it will be ignored.
ru: Если данный сигнал не обрабатывается Python (для него было задано значение :const:`signal.SIG_DFL` или :const:`signal.SIG_IGN`), он будет проигнорирован.
zh_tw: Если данный сигнал не обрабатывается Python (для него было задано значение :const:`signal.SIG_DFL` или :const:`signal.SIG_IGN`), он будет проигнорирован.

source: If *signum* is outside of the allowed range of signal numbers, ``-1`` is returned. Otherwise, ``0`` is returned. The error indicator is never changed by this function.
ru: Если значение *signum* выходит за допустимый диапазон значений сигналов, возвращается значение ``-1``. В противном случае возвращается значение ``0``. Эта функция никогда не изменяет индикатор ошибки.
zh_tw: Якщо *signum* знаходиться за межами дозволеного діапазону чисел сигналу, повертається ``-1``. В іншому випадку повертається ``0``. Ця функція ніколи не змінює індикатор помилки.

source: This utility function specifies a file descriptor to which the signal number is written as a single byte whenever a signal is received. *fd* must be non-blocking. It returns the previous such file descriptor.
ru: Эта служебная функция определяет файловый дескриптор, в который номер сигнала записывается в виде одного байта всякий раз, когда принимается сигнал. *fd* должен быть неблокирующим. Он возвращает предыдущий файловый дескриптор.
zh_tw: Ця допоміжна функція вказує дескриптор файлу, до якого номер сигналу записується як один байт кожного разу, коли надходить сигнал. *fd* має бути неблокуючим. Він повертає попередній такий файловий дескриптор.

source: The value ``-1`` disables the feature; this is the initial state. This is equivalent to :func:`signal.set_wakeup_fd` in Python, but without any error checking. *fd* should be a valid file descriptor. The function should only be called from the main thread.
ru: Значение ``-1`` отключает функцию; это начальное состояние. Это эквивалентно :func:`signal.set_wakeup_fd` в Python, но без какой-либо проверки на ошибки. *fd* должен быть допустимым файловым дескриптором. Функция должна вызываться только из основного потока.
zh_tw: Значення ``-1`` вимикає функцію; це початковий стан. Це еквівалентно :func:`signal.set_wakeup_fd` у Python, але без перевірки помилок. *fd* має бути дійсним дескриптором файлу. Функцію слід викликати лише з основного потоку.

source: On Windows, the function now also supports socket handles.
ru: В Windows эта функция теперь также поддерживает дескрипторы сокетов.
zh_tw: У Windows функція тепер також підтримує ручки сокетів.

source: Exception Classes
ru: Классы исключений
zh_tw: Kelas Pengecualian

source: This utility function creates and returns a new exception class. The *name* argument must be the name of the new exception, a C string of the form ``module.classname``. The *base* and *dict* arguments are normally ``NULL``. This creates a class object derived from :exc:`Exception` (accessible in C as :c:data:`PyExc_Exception`).
ru: Эта служебная функция создает и возвращает новый класс исключений. Аргументом *name* должно быть имя нового исключения, строка на языке Си в виде ``module.classname``. Аргументы *base* и *dict* обычно имеют значение ``NULL``. Это создает объект класса, производный от :exc:`Exception` (доступный в C как :c:data:`PyExc_Exception`).
zh_tw: Ця службова функція створює та повертає новий клас винятків. Аргумент *name* має бути назвою нового винятку, рядком C у формі ``module.classname``. Аргументи *base* і *dict* зазвичай мають значення ``NULL``. Це створює об’єкт класу, похідний від :exc:`Exception` (доступний у C як :c:data:`PyExc_Exception`).

source: The :attr:`~type.__module__` attribute of the new class is set to the first part (up to the last dot) of the *name* argument, and the class name is set to the last part (after the last dot). The *base* argument can be used to specify alternate base classes; it can either be only one class or a tuple of classes. The *dict* argument can be used to specify a dictionary of class variables and methods.
ru: Атрибут :attr:`~type.__module__` нового класса устанавливается в первую часть (до последней точки) аргумента *name*, а имя класса устанавливается в последнюю часть (после последней точки). ). Аргумент *base* можно использовать для указания альтернативных базовых классов; это может быть либо только один класс, либо кортеж классов. Аргумент *dict* можно использовать для указания словаря переменных и методов класса.
zh_tw: Атрибут :attr:`~type.__module__` нового класса устанавливается в первую часть (до последней точки) аргумента *name*, а имя класса устанавливается в последнюю часть (после последней точки). ). Аргумент *base* можно использовать для указания альтернативных базовых классов; это может быть либо только один класс, либо кортеж классов. Аргумент *dict* можно использовать для указания словаря переменных и методов класса.
