Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/exceptions.po
Languages: ru, zh_tw

source: Same as :c:func:`PyErr_NewException`, except that the new exception class can easily be given a docstring: If *doc* is non-``NULL``, it will be used as the docstring for the exception class.
ru: То же, что :c:func:`PyErr_NewException`, за исключением того, что новому классу исключений можно легко присвоить строку документации: если значение *doc* не равно ``NULL``, оно будет использоваться в качестве строки документации для класса исключений.
zh_tw: Те саме, що :c:func:`PyErr_NewException`, за винятком того, що новому класу винятків можна легко надати рядок документації: якщо *doc* не є ``NULL``, він використовуватиметься як рядок документації для класу винятків.

source: Return non-zero if *ob* is an exception class, zero otherwise. This function always succeeds.
zh_tw: 如果 *ob* 是异常类则返回非零，否则返回零。此函数总是会成功执行。

source: Return :c:member:`~PyTypeObject.tp_name` of the exception class *ob*.
zh_tw: 返回异常类 *ob* 的 :c:member:`~PyTypeObject.tp_name`。

source: Exception Objects
ru: Объекты исключений
zh_tw: Przedmioty Sytuacji Wyjątkowych

source: Return the traceback associated with the exception as a new reference, as accessible from Python through the :attr:`~BaseException.__traceback__` attribute. If there is no traceback associated, this returns ``NULL``.
ru: Возвращает обратную трассировку, связанную с исключением, в виде новой ссылки, доступной из Python через атрибут :attr:`~BaseException.__traceback__`. Если обратная трассировка не связана, возвращается значение ``NULL``.
zh_tw: Возвращает обратную трассировку, связанную с исключением, в виде новой ссылки, доступной из Python через атрибут :attr:`~BaseException.__traceback__`. Если обратная трассировка не связана, возвращается значение ``NULL``.

source: Set the traceback associated with the exception to *tb*. Use ``Py_None`` to clear it.
ru: Устанавливает для параметра обратной трассировки, связанного с исключением, значение *tb*. Используйте ``Py_None``, чтобы очистить его.
zh_tw: Установіть для трасування, пов’язаного з винятком, значення *tb*. Використовуйте ``Py_None``, щоб очистити його.

source: Return the context (another exception instance during whose handling *ex* was raised) associated with the exception as a new reference, as accessible from Python through the :attr:`~BaseException.__context__` attribute. If there is no context associated, this returns ``NULL``.
ru: Возвращает контекст (другой экземпляр исключения, во время обработки которого был запущен *ex*), связанный с исключением, в качестве новой ссылки, доступной из Python через атрибут :attr:`~BaseException.__context__`. Если контекст не связан, то возвращается значение ``NULL``.
zh_tw: Возвращает контекст (другой экземпляр исключения, во время обработки которого был запущен *ex*), связанный с исключением, в качестве новой ссылки, доступной из Python через атрибут :attr:`~BaseException.__context__`. Если контекст не связан, то возвращается значение ``NULL``.

source: Set the context associated with the exception to *ctx*. Use ``NULL`` to clear it. There is no type check to make sure that *ctx* is an exception instance. This steals a reference to *ctx*.
ru: Задает контексту, связанному с исключением, значение *ctx*. Используйте ``NULL``, чтобы очистить его. Нет проверки типа, чтобы убедиться, что *ctx* является экземпляром исключения. При этом будет украдена ссылка на *ctx*.
zh_tw: Установіть для контексту, пов’язаного з винятком, значення *ctx*. Щоб очистити його, використовуйте ``NULL``. Немає перевірки типу, щоб переконатися, що *ctx* є винятком. Це краде посилання на *ctx*.

source: Return the cause (either an exception instance, or ``None``, set by ``raise ... from ...``) associated with the exception as a new reference, as accessible from Python through the :attr:`~BaseException.__cause__` attribute.
ru: Возвращает причину (либо экземпляр исключения, либо ``None``, заданный параметром ``raise ... from ...``), связанную с исключением в качестве новой ссылки, доступной из Python через атрибут :attr:`~BaseException.__cause__`.
zh_tw: Возвращает причину (либо экземпляр исключения, либо ``None``, заданный параметром ``raise ... from ...``), связанную с исключением в качестве новой ссылки, доступной из Python через атрибут :attr:`~BaseException.__cause__`.

source: Set the cause associated with the exception to *cause*. Use ``NULL`` to clear it. There is no type check to make sure that *cause* is either an exception instance or ``None``. This steals a reference to *cause*.
ru: Задает для причины, связанной с исключением, значение *cause*. Используйте ``NULL``, чтобы очистить его. Нет проверки типа, чтобы убедиться, что *cause* является либо экземпляром исключения, либо ``None``. Это приведет к краже ссылки на *cause*.
zh_tw: Задает для причины, связанной с исключением, значение *cause*. Используйте ``NULL``, чтобы очистить его. Нет проверки типа, чтобы убедиться, что *cause* является либо экземпляром исключения, либо ``None``. Это приведет к краже ссылки на *cause*.

source: The :attr:`~BaseException.__suppress_context__` attribute is implicitly set to ``True`` by this function.
ru: Атрибуту :attr:`~BaseException.__suppress_context__` этой функцией неявно присваивается значение ``True``.
zh_tw: Атрибуту :attr:`~BaseException.__suppress_context__` этой функцией неявно присваивается значение ``True``.

source: Return :attr:`~BaseException.args` of exception *ex*.
ru: Возвращает :attr:`~BaseException.args` из исключения *ex*.
zh_tw: Возвращает :attr:`~BaseException.args` из исключения *ex*.

source: Set :attr:`~BaseException.args` of exception *ex* to *args*.
ru: Устанавливает :attr:`~BaseException.args` для исключения *ex* в *args*.
zh_tw: Устанавливает :attr:`~BaseException.args` для исключения *ex* в *args*.

source: Implement part of the interpreter's implementation of :keyword:`!except*`. *orig* is the original exception that was caught, and *excs* is the list of the exceptions that need to be raised. This list contains the unhandled part of *orig*, if any, as well as the exceptions that were raised from the :keyword:`!except*` clauses (so they have a different traceback from *orig*) and those that were reraised (and have the same traceback as *orig*). Return the :exc:`ExceptionGroup` that needs to be reraised in the end, or ``None`` if there is nothing to reraise.
ru: Реализует часть реализации интерпретатора :keyword:`!except*`. *orig* - это исходное исключение, которое было перехвачено, а *excs* - это список исключений, которые необходимо вызвать. Этот список содержит необработанную часть *orig*, если таковая имеется, а также исключения, которые были вызваны предложениями :keyword:`!except*` (поэтому они имеют обратную трассировку, отличную от *orig*), и те, которые были повторно запущены (и имеют ту же обратную трассировку, что и *orig*). Возвращает :exc:`ExceptionGroup`, который в конце должен быть повторно вызван, или ``None``, если повторно вызывать нечего.
zh_tw: Реализует часть реализации интерпретатора :keyword:`!except*`. *orig* - это исходное исключение, которое было перехвачено, а *excs* - это список исключений, которые необходимо вызвать. Этот список содержит необработанную часть *orig*, если таковая имеется, а также исключения, которые были вызваны предложениями :keyword:`!except*` (поэтому они имеют обратную трассировку, отличную от *orig*), и те, которые были повторно запущены (и имеют ту же обратную трассировку, что и *orig*). Возвращает :exc:`ExceptionGroup`, который в конце должен быть повторно вызван, или ``None``, если повторно вызывать нечего.

source: Unicode Exception Objects
ru: Объекты исключений в Unicode
zh_tw: Objek Pengecualian Unicode

source: The following functions are used to create and modify Unicode exceptions from C.
ru: Следующие функции используются для создания и изменения исключений Unicode из C.
zh_tw: Наступні функції використовуються для створення та зміни винятків Unicode з C.

source: Create a :class:`UnicodeDecodeError` object with the attributes *encoding*, *object*, *length*, *start*, *end* and *reason*. *encoding* and *reason* are UTF-8 encoded strings.
ru: Создает объект :class:`UnicodeDecodeError` с атрибутами *encoding*, *object*, *length*, *start*, *end* и *reason*. *encoding* и *reason* являются строками в кодировке UTF-8.
zh_tw: Створіть об’єкт :class:`UnicodeDecodeError` з атрибутами *encoding*, *object*, *length*, *start*, *end* і *reason*. *encoding* і *reason* є рядками в кодуванні UTF-8.

source: Return the *encoding* attribute of the given exception object.
ru: Возвращает атрибут *encoding* данного объекта исключения.
zh_tw: Повертає атрибут *encoding* даного об’єкта винятку.

source: Return the *object* attribute of the given exception object.
ru: Возвращает атрибут *object* данного объекта исключения.
zh_tw: Повертає атрибут *object* даного об’єкта винятку.

source: Get the *start* attribute of the given exception object and place it into *\*start*. *start* must not be ``NULL``. Return ``0`` on success, ``-1`` on failure.
ru: Получает атрибут *start* данного объекта exception и помещает его в *\*start*. Значение *start* не должно быть ``NULL``. Возвращает ``0`` в случае успеха, ``-1`` в случае сбоя.
zh_tw: Отримайте атрибут *start* даного об’єкта винятку та помістіть його в *\*start*. *початок* не має бути ``NULL``. Повертає ``0`` в разі успіху, ``-1`` у випадку невдачі.

source: Get the *end* attribute of the given exception object and place it into *\*end*. *end* must not be ``NULL``. Return ``0`` on success, ``-1`` on failure.
ru: Получает атрибут *end* данного объекта exception и помещает его в *\*end*. *end* не должен быть равен ``NULL``. Возвращает ``0`` в случае успеха, ``-1`` в случае сбоя.
zh_tw: Отримайте атрибут *end* даного об’єкта винятку та помістіть його в *\*end*. *end* не має бути ``NULL``. Повертає ``0`` в разі успіху, ``-1`` у випадку невдачі.

source: Set the *end* attribute of the given exception object to *end*. Return ``0`` on success, ``-1`` on failure.
ru: Устанавливает для атрибута *end* данного объекта исключения значение *end*. Возвращает ``0`` в случае успеха, ``-1`` в случае сбоя.
zh_tw: Установіть для атрибута *end* даного об’єкта винятку значення *end*. Повертає ``0`` в разі успіху, ``-1`` у випадку невдачі.

source: Return the *reason* attribute of the given exception object.
ru: Возвращает атрибут *reason* данного объекта исключения.
zh_tw: Повертає атрибут *reason* даного об’єкта винятку.

source: Set the *reason* attribute of the given exception object to *reason*. Return ``0`` on success, ``-1`` on failure.
ru: Устанавливает для атрибута *reason* данного объекта исключения значение *reason*. Возвращает ``0`` в случае успеха, ``-1`` в случае сбоя.
zh_tw: Установіть для атрибута *reason* даного об’єкта винятку значення *reason*. Повертає ``0`` в разі успіху, ``-1`` у випадку невдачі.

source: Recursion Control
ru: Управление рекурсией
zh_tw: Kontrola Rekursji

source: These two functions provide a way to perform safe recursive calls at the C level, both in the core and in extension modules. They are needed if the recursive code does not necessarily invoke Python code (which tracks its recursion depth automatically). They are also not needed for *tp_call* implementations because the :ref:`call protocol <call>` takes care of recursion handling.
ru: Эти две функции обеспечивают возможность выполнения безопасных рекурсивных вызовов на уровне C, как в ядре, так и в модулях расширения. Они необходимы, если рекурсивный код не обязательно вызывает код на Python (который автоматически отслеживает глубину рекурсии). Они также не нужны для реализаций *tp_call*, потому что :ref:`call protocol <call>` заботится об обработке рекурсии.
zh_tw: Ці дві функції забезпечують спосіб виконання безпечних рекурсивних викликів на рівні C, як в ядрі, так і в модулях розширення. Вони потрібні, якщо рекурсивний код не обов’язково викликає код Python (який автоматично відстежує глибину рекурсії). Вони також не потрібні для реалізації *tp_call*, оскільки :ref:`протокол виклику <call>` піклується про обробку рекурсії.

source: Marks a point where a recursive C-level call is about to be performed.
ru: Отмечает точку, в которой вот-вот будет выполнен рекурсивный вызов уровня C.
zh_tw: Позначає точку, де має бути виконано рекурсивний виклик C-рівня.

source: *where* should be a UTF-8 encoded string such as ``" in instance check"`` to be concatenated to the :exc:`RecursionError` message caused by the recursion depth limit.
ru: *where* должна быть строкой в кодировке UTF-8, такой как ``" in instance check"``, которая должна быть объединена с сообщением :exc:`RecursionError`, вызванным ограничением глубины рекурсии.
zh_tw: *де* має бути рядок у кодуванні UTF-8, такий як ``" у перевірці екземпляра"``, який об’єднується з повідомленням :exc:`RecursionError`, спричиненим обмеженням глибини рекурсії.

source: This function is now also available in the :ref:`limited API <limited-c-api>`.
ru: Эта функция теперь также доступна в :ref:`limited API <limited-c-api>`.
zh_tw: Эта функция теперь также доступна в :ref:`limited API <limited-c-api>`.

source: Ends a :c:func:`Py_EnterRecursiveCall`. Must be called once for each *successful* invocation of :c:func:`Py_EnterRecursiveCall`.
ru: Завершает :c:func:`Py_EnterRecursiveCall`. Должен вызываться один раз для каждого *успешного* вызова :c:func:`Py_EnterRecursiveCall`.
zh_tw: Завершує :c:func:`Py_EnterRecursiveCall`. Потрібно викликати один раз для кожного *успішного* виклику :c:func:`Py_EnterRecursiveCall`.

source: Properly implementing :c:member:`~PyTypeObject.tp_repr` for container types requires special recursion handling. In addition to protecting the stack, :c:member:`~PyTypeObject.tp_repr` also needs to track objects to prevent cycles. The following two functions facilitate this functionality. Effectively, these are the C equivalent to :func:`reprlib.recursive_repr`.
ru: Правильная реализация :c:member:`~PyTypeObject.tp_repr` для типов контейнеров требует специальной обработки рекурсии. В дополнение к защите стека, :c:member:`~PyTypeObject.tp_repr` также должен отслеживать объекты, чтобы предотвратить циклы. Следующие две функции облегчают эту функциональность. По сути, это C-эквивалент :func:`reprlib.recursive_repr`.
zh_tw: Правильна реалізація :c:member:`~PyTypeObject.tp_repr` для типів контейнерів вимагає спеціальної обробки рекурсії. Окрім захисту стека, :c:member:`~PyTypeObject.tp_repr` також має відстежувати об’єкти, щоб запобігти циклам. Наступні дві функції полегшують цю функцію. По суті, це C еквівалент :func:`reprlib.recursive_repr`.

source: Called at the beginning of the :c:member:`~PyTypeObject.tp_repr` implementation to detect cycles.
ru: Вызывается в начале реализации :c:member:`~PyTypeObject.tp_repr` для обнаружения циклов.
zh_tw: Викликається на початку реалізації :c:member:`~PyTypeObject.tp_repr` для виявлення циклів.

source: If the object has already been processed, the function returns a positive integer. In that case the :c:member:`~PyTypeObject.tp_repr` implementation should return a string object indicating a cycle. As examples, :class:`dict` objects return ``{...}`` and :class:`list` objects return ``[...]``.
ru: Если объект уже был обработан, функция возвращает положительное целое число. В этом случае реализация :c:member:`~PyTypeObject.tp_repr` должна возвращать строковый объект, указывающий на цикл. В качестве примеров, объекты :class:`dict` возвращают значение ``{...}``, а объекты :class:`list` возвращают значение ``[...]``.
zh_tw: Якщо об’єкт уже оброблено, функція повертає додатне ціле число. У цьому випадку реалізація :c:member:`~PyTypeObject.tp_repr` має повертати рядковий об’єкт, що вказує на цикл. Як приклад, об’єкти :class:`dict` повертають ``{...}``, а об’єкти :class:`list` повертають ``[...]``.

source: The function will return a negative integer if the recursion limit is reached. In that case the :c:member:`~PyTypeObject.tp_repr` implementation should typically return ``NULL``.
ru: Функция вернет отрицательное целое число, если будет достигнут предел рекурсии. В этом случае реализация :c:member:`~PyTypeObject.tp_repr` обычно должна возвращать значение ``NULL``.
zh_tw: Функція поверне від’ємне ціле число, якщо досягнуто обмеження рекурсії. У цьому випадку реалізація :c:member:`~PyTypeObject.tp_repr` зазвичай повинна повертати ``NULL``.

source: Otherwise, the function returns zero and the :c:member:`~PyTypeObject.tp_repr` implementation can continue normally.
ru: В противном случае функция возвращает ноль, и реализация :c:member:`~PyTypeObject.tp_repr` может продолжаться в обычном режиме.
zh_tw: В іншому випадку функція повертає нуль, і реалізація :c:member:`~PyTypeObject.tp_repr` може продовжуватися нормально.

source: Ends a :c:func:`Py_ReprEnter`. Must be called once for each invocation of :c:func:`Py_ReprEnter` that returns zero.
ru: Завершает :c:func:`Py_ReprEnter`. Должен вызываться один раз для каждого вызова :c:func:`Py_ReprEnter`, который возвращает ноль.
zh_tw: Завершує :c:func:`Py_ReprEnter`. Потрібно викликати один раз для кожного виклику :c:func:`Py_ReprEnter`, який повертає нуль.

source: :c:data:`PyExc_BlockingIOError`, :c:data:`PyExc_BrokenPipeError`, :c:data:`PyExc_ChildProcessError`, :c:data:`PyExc_ConnectionError`, :c:data:`PyExc_ConnectionAbortedError`, :c:data:`PyExc_ConnectionRefusedError`, :c:data:`PyExc_ConnectionResetError`, :c:data:`PyExc_FileExistsError`, :c:data:`PyExc_FileNotFoundError`, :c:data:`PyExc_InterruptedError`, :c:data:`PyExc_IsADirectoryError`, :c:data:`PyExc_NotADirectoryError`, :c:data:`PyExc_PermissionError`, :c:data:`PyExc_ProcessLookupError` and :c:data:`PyExc_TimeoutError` were introduced following :pep:`3151`.
ru: :c:data:`PyExc_BlockingIOError`, :c:data:`PyExc_BrokenPipeError`, :c:data:`PyExc_ChildProcessError`, :c:data:`PyExc_ConnectionError`, :c:data:`PyExc_ConnectionAbortedError`, :c:data:`PyExc_ConnectionRefusedError`, :c:data:`PyExc_ConnectionResetError`, :c:data:`PyExc_FileExistsError`, :c:data:`PyExc_FileNotFoundError`, :c:data:`PyExc_InterruptedError`, :c:data:`PyExc_IsADirectoryError`, :c:data:`PyExc_NotADirectoryError`, :c:data:`PyExc_PermissionError`, :c:data:`PyExc_ProcessLookupError` и :c:data:`PyExc_TimeoutError` были введены следующим образом :pep:`3151`.
zh_tw: :c:data:`PyExc_BlockingIOError`, :c:data:`PyExc_BrokenPipeError`, :c:data:`PyExc_ChildProcessError`, :c:data:`PyExc_ConnectionError`, :c:data:`PyExc_ConnectionAbortedError`, :c:data:`PyExc_ConnectionRefusedError`, :c:data:`PyExc_ConnectionResetError`, :c:data:`PyExc_FileExistsError`, :c:data:`PyExc_FileNotFoundError`, :c:data:`PyExc_InterruptedError`, :c:data:`PyExc_IsADirectoryError`, :c:data:`PyExc_NotADirectoryError`, :c:data:`PyExc_PermissionError`, :c:data:`PyExc_ProcessLookupError` dan :c:data:`PyExc_TimeoutError` diperkenalkan berikut :pep:`3151`.

source: :c:data:`PyExc_StopAsyncIteration` and :c:data:`PyExc_RecursionError`.
ru: :c:data:`PyExc_StopAsyncIteration` и :c:data:`PyExc_RecursionError`.
zh_tw: :c:data:`PyExc_StopAsyncIteration` dan :c:data:`PyExc_RecursionError`.

source: These aliases used to be separate exception types.
ru: Эти псевдонимы раньше были отдельными типами исключений.
zh_tw: Раніше ці псевдоніми були окремими типами винятків.

source: Notes
ru: Примечания
zh_tw: 註解

source: Notes:
ru: Примечания:
zh_tw: 註解：

source: strerror (C function)
ru: strerror (C функция)
zh_tw: strerror (C функция)

source: module
ru: модуль
zh_tw: moduł

source: SIGINT (C macro)
ru: SIGINT (C макрос)
zh_tw: SIGINT (C макрос)

source: KeyboardInterrupt (built-in exception)
ru: KeyboardInterrupt (встроенное исключение)
zh_tw: KeyboardInterrupt (встроенное исключение)

source: signal
ru: сигнал
