Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/file.po
Languages: es_es, pt_pt, ru

source: File Objects
es_es: Objetos de archivo
pt_pt: objeto de ficheiro
ru: Файловые объекты

source: These APIs are a minimal emulation of the Python 2 C API for built-in file objects, which used to rely on the buffered I/O (:c:expr:`FILE*`) support from the C standard library. In Python 3, files and streams use the new :mod:`io` module, which defines several layers over the low-level unbuffered I/O of the operating system. The functions described below are convenience C wrappers over these new APIs, and meant mostly for internal error reporting in the interpreter; third-party code is advised to access the :mod:`io` APIs instead.
es_es: Estas API son una emulación mínima de la API de Python 2 C para objetos de archivo integrados, que solían depender del soporte de E/S (:c:expr:`FILE*`) almacenado en búfer de la biblioteca estándar de C. En Python 3, los archivos y transmisiones usan el nuevo módulo :mod:`io` que define varias capas sobre la E/S sin búfer de bajo nivel del sistema operativo. Las funciones que se describen a continuación son envoltorios C convenientes sobre estas nuevas API, y están destinadas principalmente a informar errores internos en el intérprete; en su lugar, se recomienda que el código de terceros acceda a las API :mod:`io`.
ru: Эти API представляют собой минимальную эмуляцию Python 2 C API для встроенных файловых объектов, которые раньше полагались на поддержку буферизованного ввода-вывода (:c:expr:`FILE*`) из стандартной библиотеки C. В Python 3 файлы и потоки используют новый модуль :mod:`io`, который определяет несколько уровней над низкоуровневым не буферизованным вводом-выводом операционной системы. Функции, описанные ниже, являются удобными оболочками на языке Си для этих новых API и предназначены в основном для сообщения о внутренних ошибках в интерпретаторе; стороннему коду рекомендуется вместо этого обращаться к API :mod:`io`.

source: Create a Python file object from the file descriptor of an already opened file *fd*. The arguments *name*, *encoding*, *errors* and *newline* can be ``NULL`` to use the defaults; *buffering* can be *-1* to use the default. *name* is ignored and kept for backward compatibility. Return ``NULL`` on failure. For a more comprehensive description of the arguments, please refer to the :func:`io.open` function documentation.
es_es: Crea un objeto archivo Python a partir del descriptor de archivo de un archivo *fd* ya abierto. Los argumentos *name*, *encoding*, *errors* y *newline* pueden ser ``NULL`` para usar los valores por defecto; *buffering* puede ser *-1* para usar el valor por defecto. *name* se ignora y se mantiene por compatibilidad con versiones anteriores. Devuelve ``NULL`` en caso de fallo. Para una descripción más completa de los argumentos, consultar la documentación de la función :func:`io.open`.
pt_pt: Cria um objeto de ficheiro Python a partir do descritor de ficheiro de um ficheiro já aberto *fd*. Os argumentos *name*, *encoding*, *errors* and *newline* podem ser ``NULL`` para usar os padrões; *buffering* pode ser *-1* para usar o padrão. *name* é ignorado e mantido para compatibilidade com versões anteriores. Retorna ``NULL`` em caso de falha. Para uma descrição mais abrangente dos argumentos, consulte a documentação da função :func:`io.open`.
ru: Создает файловый объект Python из файлового дескриптора уже открытого файла *fd*. Аргументы *name*, *encoding*, *errors* и *newline* могут иметь значение ``NULL`` для использования по умолчанию; *buffering* может иметь значение *-1* для использования по умолчанию. *name* игнорируется и сохраняется для обеспечения обратной совместимости. Возвращает ``NULL`` в случае сбоя. Для получения более подробного описания аргументов, пожалуйста, обратитесь к документации по функции :func:`io.open`.

source: Since Python streams have their own buffering layer, mixing them with OS-level file descriptors can produce various issues (such as unexpected ordering of data).
es_es: Dado que los flujos de Python tienen su propia capa de almacenamiento en búfer, mezclarlos con descriptores de archivo a nivel de sistema operativo puede producir varios problemas (como el ordenamiento inesperado de los datos).
pt_pt: Como os streams do Python têm sua própria camada de buffer, combiná-los com os descritores de ficheiro no nível do sistema operativo pode produzir vários problemas (como ordenação inesperada de dados).
ru: Поскольку потоки Python имеют свой собственный уровень буферизации, их смешивание с файловыми дескрипторами уровня операционной системы может привести к различным проблемам (например, к неожиданному упорядочению данных).

source: Ignore *name* attribute.
es_es: Ignora el atributo *name*.
pt_pt: Ignora o atributo *name*.
ru: Игнорирует атрибут *name*.

source: Return the file descriptor associated with *p* as an :c:expr:`int`. If the object is an integer, its value is returned. If not, the object's :meth:`~io.IOBase.fileno` method is called if it exists; the method must return an integer, which is returned as the file descriptor value. Sets an exception and returns ``-1`` on failure.
es_es: Devuelve el descriptor de archivo asociado con * p * como un :c:expr:`int`. Si el objeto es un número entero, se devuelve su valor. De lo contrario, se llama al método:meth:`~io.IOBase.fileno` del objeto si existe; el método debe devolver un número entero, que se devuelve como el valor del descriptor de archivo. Establece una excepción y devuelve ``-1`` en caso de error.
ru: Возвращает файловый дескриптор, связанный с *p*, в виде :c:expr:`int`. Если объект является целым числом, возвращается его значение. Если нет, то вызывается метод объекта :meth:`~io.IOBase.fileno`, если он существует; метод должен возвращать целое число, которое возвращается в качестве значения файлового дескриптора. Устанавливает исключение и возвращает ``-1`` в случае сбоя.

source: Equivalent to ``p.readline([n])``, this function reads one line from the object *p*. *p* may be a file object or any object with a :meth:`~io.IOBase.readline` method. If *n* is ``0``, exactly one line is read, regardless of the length of the line. If *n* is greater than ``0``, no more than *n* bytes will be read from the file; a partial line can be returned. In both cases, an empty string is returned if the end of the file is reached immediately. If *n* is less than ``0``, however, one line is read regardless of length, but :exc:`EOFError` is raised if the end of the file is reached immediately.
es_es: Equivalente a ``p.readline([n])``, esta función lee una línea del objeto *p*. *p* puede ser un objeto fichero o cualquier objeto con un método :meth:`~io.IOBase.readline`. Si *n* es ``0``, se lee exactamente una línea, independientemente de la longitud de la línea. Si *n* es mayor que ``0``, no se leerán más de *n* bytes del fichero; se puede devolver una línea parcial. En ambos casos, se devuelve una cadena vacía si se alcanza inmediatamente el final del fichero. Si *n* es menor que ``0``, sin embargo, se lee una línea independientemente de la longitud, pero se devuelve :exc:`EOFError` si se alcanza el final del fichero inmediatamente.
pt_pt: Equivalente a ``p.readline([n])``, esta função lê uma linha do objeto *p*. *p* pode ser um objeto de ficheiro ou qualquer objeto com um método :meth:`~io.IOBase.readline`. Se *n* for ``0``, exatamente uma linha é lida, independentemente do comprimento da linha. Se *n* for maior que ``0``, não mais do que *n* bytes serão lidos do ficheiro; uma linha parcial pode ser retornada. Em ambos os casos, uma string vazia é retornada se o final do ficheiro for alcançado imediatamente. Se *n* for menor que ``0``, entretanto, uma linha é lida independentemente do comprimento, mas :exc:`EOFError` é levantada se o final do ficheiro for alcançado imediatamente.
ru: Эквивалентно ``p.readline([n])``, эта функция считывает одну строку из объекта *p*. *p* может быть файловым объектом или любым методом объекта :meth:`~io.IOBase.readline`. Если *n* равно ``0``, считывается ровно одна строка, независимо от длины строки. Если *n* больше ``0``, из файла будет считано не более *n* байт; может быть возвращена неполная строка. В обоих случаях возвращается пустая строка, если конец файла достигнут немедленно. Однако, если *n* меньше ``0``, считывается одна строка независимо от длины, но :exc:`EOFError` вызывается, если конец файла достигнут немедленно.

source: Overrides the normal behavior of :func:`io.open_code` to pass its parameter through the provided handler.
es_es: Anula el comportamiento normal de :func:`io.open_code` para pasar su parámetro a través del manejador proporcionado.
pt_pt: Substitui o comportamento normal de :func:`io.open_code` para passar seu parâmetro por meio do tratador fornecido.
ru: Переопределяет обычное поведение :func:`io.open_code` для передачи его параметра через предоставленный обработчик.

source: The *handler* is a function of type:
es_es: El *handler* es una función de tipo:
ru: *Обработчик* — это функция типа:

source: Equivalent of :c:expr:`PyObject *(\*)(PyObject *path, void *userData)`, where *path* is guaranteed to be :c:type:`PyUnicodeObject`.
es_es: Equivalente de: c: expr` ' PyObject *(\*)(PyObject *path, void *userData)', donde se garantiza que *path * será:c:type:`PyUnicodeObject`.
ru: Эквивалент :c:expr:`PyObject *(\*)(PyObject *path, void *userData)`, где *path* гарантированно будет :c:type:`PyUnicodeObject`.

source: The *userData* pointer is passed into the hook function. Since hook functions may be called from different runtimes, this pointer should not refer directly to Python state.
es_es: El puntero *userData* se pasa a la función gancho. Dado que las funciones gancho se pueden llamar en diferentes tiempos de ejecución, este puntero no debe referirse directamente al estado de Python.
pt_pt: O ponteiro *userData* é passado para a função de gancho. Como as funções de gancho podem ser chamadas de diferentes tempos de execução, esse ponteiro não deve se referir diretamente ao estado do Python.
ru: В функцию перехвата передается указатель *userData*. Поскольку функции перехвата могут вызываться из разных сред выполнения, этот указатель не должен напрямую ссылаться на состояние Python.

source: As this hook is intentionally used during import, avoid importing new modules during its execution unless they are known to be frozen or available in ``sys.modules``.
es_es: Dado que este hook se utiliza intencionadamente durante la importación, evite importar nuevos módulos durante su ejecución a menos que se sepa que están congelados o disponibles en ``sys.modules``.
pt_pt: Como este gancho é usado intencionalmente durante a importação, evite importar novos módulos durante sua execução, a menos que eles estejam congelados ou disponíveis em ``sys.modules``.
ru: Поскольку этот перехват намеренно используется во время импорта, избегайте импорта новых модулей во время его выполнения, если только не известно, что они заморожены или доступны в ``sys.modules``.

source: Once a hook has been set, it cannot be removed or replaced, and later calls to :c:func:`PyFile_SetOpenCodeHook` will fail. On failure, the function returns -1 and sets an exception if the interpreter has been initialized.
es_es: Una vez que se ha establecido un gancho, no puede ser eliminado o reemplazado, y las llamadas posteriores a :c:func:`PyFile_SetOpenCodeHook` fallarán. En caso de fallo, la función devuelve -1 y lanza una excepción si se ha inicializado el intérprete.
pt_pt: Uma vez que um gancho foi definido, ele não pode ser removido ou substituído, e chamadas posteriores para :c:func:`PyFile_SetOpenCodeHook` irão falhar. Em caso de falha, a função retorna -1 e define uma exceção se o interpretador foi inicializado.
ru: После установки перехватчика его нельзя удалить или заменить, и последующие вызовы :c:func:`PyFile_SetOpenCodeHook` завершатся ошибкой. В случае сбоя функция возвращает значение -1 и устанавливает исключение, если интерпретатор был инициализирован.

source: This function is safe to call before :c:func:`Py_Initialize`.
es_es: Es seguro llamar a esta función antes de :c:func:`Py_Initialize`.
pt_pt: É seguro chamar esta função antes de :c:func:`Py_Initialize`.
ru: Эту функцию безопасно вызывать перед :c:func:`Py_Initialize`.

source: Raises an :ref:`auditing event <auditing>` ``setopencodehook`` with no arguments.
es_es: Lanza un evento :ref:`auditing <auditing>` ``setopencodehook`` sin argumentos.
pt_pt: Levanta um :ref:`evento de auditoria<auditing>` ``setopencodehook`` sem argumentos.
ru: Вызывает :ref:`auditing event <auditing>` ``setopencodehook`` без аргументов.

source: Write object *obj* to file object *p*. The only supported flag for *flags* is :c:macro:`Py_PRINT_RAW`; if given, the :func:`str` of the object is written instead of the :func:`repr`. Return ``0`` on success or ``-1`` on failure; the appropriate exception will be set.
es_es: Escriba el objeto *obj* en el objeto de archivo *p*. La única bandera admitida para *flags* es :c:macro:`Py_PRINT_RAW`; si se proporciona, se escribe :func:`str` del objeto en lugar de :func:`repr`. Devuelve ``0`` en caso de éxito ``-1`` en caso de error; se establecerá la excepción apropiada.
ru: Записывает объект *obj* в файл object *p*. Единственным поддерживаемым флагом для *flags* является :c:macro:`Py_PRINT_RAW`; если он задан, то вместо :func:`repr` записывается :func:`str` объекта. Верните ``0`` в случае успеха или ``-1`` в случае сбоя; будет установлено соответствующее исключение.

source: Write string *s* to file object *p*. Return ``0`` on success or ``-1`` on failure; the appropriate exception will be set.
es_es: Escribe la cadena *s* en el objeto de archivo *p*. Devuelve ``0`` en caso de éxito o ``-1`` en caso de fallo; se establecerá la excepción apropiada.
pt_pt: Escreve a string *s* no objeto de ficheiro *p*. Retorna ``0`` em caso de sucesso ou ``-1`` em caso de falha; a exceção apropriada será definida.
ru: Запишите строку *s* в файловый объект *p*. Верните ``0`` в случае успеха или ``-1`` в случае сбоя; будет установлено соответствующее исключение.

source: object
es_es: objeto
ru: объект

source: file
es_es: archivo
ru: файл

source: EOFError (built-in exception)
es_es: EOFError (excepción incorporada)
ru: EOFError (встроенное исключение)

source: Py_PRINT_RAW (C macro)
es_es: Py_PRINT_RAW (Macro de C)
ru: Py_PRINT_RAW (C макрос)
