Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/gcsupport.po
Languages: es_es, pt_pt, ru

source: To simplify writing :c:member:`~PyTypeObject.tp_traverse` handlers, a :c:func:`Py_VISIT` macro is provided. In order to use this macro, the :c:member:`~PyTypeObject.tp_traverse` implementation must name its arguments exactly *visit* and *arg*:
es_es: Para simplificar la escritura de los manejadores de :c:member:`~PyTypeObject.tp_traverse`, se proporciona una macro :c:func:`Py_VISIT`. Para poder utilizar esta macro, la implementación de :c:member:`~PyTypeObject.tp_traverse` debe nombrar sus argumentos exactamente *visit* y *arg*:
pt_pt: Para simplificar a escrita de manipuladores :c:member:`~PyTypeObject.tp_traverse`, é fornecida uma macro :c:func:`Py_VISIT`. Para usar essa macro, a implementação :c:member:`~PyTypeObject.tp_traverse` deve nomear seus argumentos exatamente como *visit* e *arg*:
ru: Для упрощения написания обработчиков :c:member:`~PyTypeObject.tp_traverse` предусмотрен макрос :c:func:`Py_VISIT`. Чтобы использовать этот макрос, реализация :c:member:`~PyTypeObject.tp_traverse` должна точно назвать свои аргументы *visit* и *arg*:

source: If *o* is not ``NULL``, call the *visit* callback, with arguments *o* and *arg*. If *visit* returns a non-zero value, then return it. Using this macro, :c:member:`~PyTypeObject.tp_traverse` handlers look like::
es_es: Si *o* no es ``NULL``, llama a la llamada de retorno *visit*, con los argumentos *o* y *arg*. Si *visit* devuelve un valor distinto de cero, devuélvalo. Usando esta macro, los manejadores de :c:member:`~PyTypeObject.tp_traverse` se ven como::
ru: Если *o* не равно NULL, вызовите обратный вызов *visit* с аргументами *o* и *arg*. Если *visit* возвращает ненулевое значение, верните его. Используя этот макрос, обработчики :c:member:`~PyTypeObject.tp_traverse` выглядят следующим образом::

source: The :c:member:`~PyTypeObject.tp_clear` handler must be of the :c:type:`inquiry` type, or ``NULL`` if the object is immutable.
es_es: El manejador :c:member:`~PyTypeObject.tp_clear` debe ser del tipo :c:type:`inquiry`, o ``NULL`` si el objeto es inmutable.
pt_pt: O manipulador :c:member:`~PyTypeObject.tp_clear` deve ser do tipo :c:type:`inquiry` ou ``NULL`` se o objeto for imutável.
ru: Обработчик :c:member:`~PyTypeObject.tp_clear` должен иметь тип :c:type:`inquiry` или ``NULL``, если объект является неизменяемым.

source: Drop references that may have created reference cycles. Immutable objects do not have to define this method since they can never directly create reference cycles. Note that the object must still be valid after calling this method (don't just call :c:func:`Py_DECREF` on a reference). The collector will call this method if it detects that this object is involved in a reference cycle.
es_es: Elimina las referencias que puedan haber creado ciclos de referencia. Los objetos inmutables no tienen que definir este método ya que nunca pueden crear directamente ciclos de referencia. Tener en cuenta que el objeto debe seguir siendo válido después de llamar a este método (no llamar simplemente a :c:func:`Py_DECREF` en una referencia). El recolector llamará a este método si detecta que este objeto está involucrado en un ciclo de referencia.
pt_pt: Elimine referências que possam ter criado ciclos de referência. Objetos imutáveis não precisam definir este método, pois nunca podem criar ciclos de referência diretamente. Observe que o objeto ainda deve ser válido após chamar este método (não basta chamar :c:func:`Py_DECREF` em uma referência). O coletor chamará este método se detectar que este objeto está envolvido em um ciclo de referência.
ru: Удалите ссылки, которые могли создать ссылочные циклы. Неизменяемым объектам не обязательно определять этот метод, поскольку они никогда не могут напрямую создавать ссылочные циклы. Обратите внимание, что объект должен оставаться действительным после вызова этого метода (не вызывайте просто :c:func:`Py_DECREF` по ссылке). Сборщик вызовет этот метод, если обнаружит, что этот объект участвует в ссылочном цикле.

source: Controlling the Garbage Collector State
es_es: Control del estado del recolector de basura
pt_pt: Controlando o estado do coletor de lixo
ru: Управление состоянием сборщика мусора

source: The C-API provides the following functions for controlling garbage collection runs.
es_es: La C-API proporciona las siguientes funciones para controlar las ejecuciones de recolección de basura.
pt_pt: A C-API fornece as seguintes funções para controlar as execuções da recolha de lixo.
ru: C-API предоставляет следующие функции для управления сборкой мусора.

source: Perform a full garbage collection, if the garbage collector is enabled. (Note that :func:`gc.collect` runs it unconditionally.)
es_es: Realiza una recolección de basura completa, si el recolector de basura está habilitado. (Tenga en cuenta que :func:`gc.collect` lo ejecuta incondicionalmente).
pt_pt: Executa uma recolha completa de lixo, se o recolhedor de lixo estiver ativado. (Observe que :func:`gc.collect` o executa incondicionalmente.)
ru: Выполните полную сборку мусора, если сборщик мусора включен. (Обратите внимание, что :func:`gc.collect` запускает его безоговорочно.)

source: Returns the number of collected + unreachable objects which cannot be collected. If the garbage collector is disabled or already collecting, returns ``0`` immediately. Errors during garbage collection are passed to :data:`sys.unraisablehook`. This function does not raise exceptions.
es_es: Devuelve el número de objetos recogidos + no alcanzables que no se pueden recoger. Si el recolector de basura está deshabilitado o ya está recolectando, devuelve ``0`` inmediatamente. Los errores durante la recolección de basura se pasan a :data:`sys.unraisablehook`. Esta función no lanza excepciones.
pt_pt: Retorna o número de objetos recolhidos + inacessíveis que não podem ser recolhidos. Se o coletor de lixo estiver desativado ou já estiver a recolher, retorna ``0`` imediatamente. Os erros durante a recolha de lixo são passados para :data:`sys.unraisablehook`. Esta função não gera exceções.
ru: Возвращает количество собранных + недоступных объектов, которые невозможно собрать. Если сборщик мусора отключен или уже собирает мусор, немедленно возвращает ``0``. Ошибки во время сборки мусора передаются в :data:`sys.unraisablehook`. Эта функция не вызывает исключений.

source: Enable the garbage collector: similar to :func:`gc.enable`. Returns the previous state, 0 for disabled and 1 for enabled.
es_es: Habilitar el recolector de basura: similar a :func:`gc.enable`. Devuelve el estado anterior, 0 para desactivado y 1 para activado.
pt_pt: Ativar o coletor de lixo: semelhante a :func:`gc.enable`. Retorna o estado anterior, 0 para desativado e 1 para ativado.
ru: Включите сборщик мусора: аналогично :func:`gc.enable`. Возвращает предыдущее состояние: 0 для отключенного и 1 для включенного.

source: Disable the garbage collector: similar to :func:`gc.disable`. Returns the previous state, 0 for disabled and 1 for enabled.
es_es: Desactivar el recolector de basura: similar a :func:`gc.disable`. Devuelve el estado anterior, 0 para desactivado y 1 para activado.
pt_pt: Desativar o coletor de lixo: semelhante a :func:`gc.disable`. Retorna o estado anterior, 0 para desativado e 1 para ativado.
ru: Отключите сборщик мусора: аналогично :func:`gc.disable`. Возвращает предыдущее состояние: 0 для отключенного и 1 для включенного.

source: Query the state of the garbage collector: similar to :func:`gc.isenabled`. Returns the current state, 0 for disabled and 1 for enabled.
es_es: Consulta el estado del recolector de basura: similar a :func:`gc.isenabled`. Devuelve el estado actual, 0 para desactivado y 1 para activado.
pt_pt: Consultar o estado do coletor de lixo: semelhante a :func:`gc.isenabled`. Retorna o estado atual, 0 para desativado e 1 para ativado.
ru: Запросить состояние сборщика мусора: аналогично :func:`gc.isenabled`. Возвращает текущее состояние: 0 для отключенного и 1 для включенного.

source: Querying Garbage Collector State
es_es: Consulta del estado del recolector de basura

source: The C-API provides the following interface for querying information about the garbage collector.
es_es: La C-API proporciona la siguiente interfaz para consultar información sobre el recolector de basura.

source: Run supplied *callback* on all live GC-capable objects. *arg* is passed through to all invocations of *callback*.
es_es: Ejecuta el *callback* suministrado en todos los objetos vivos con GC. *arg* se pasa a través de todas las invocaciones de *callback*.

source: If new objects are (de)allocated by the callback it is undefined if they will be visited.
es_es: Si los nuevos objetos son (de)asignados por la llamada de retorno, no está definido si serán visitados.

source: Garbage collection is disabled during operation. Explicitly running a collection in the callback may lead to undefined behaviour e.g. visiting the same objects multiple times or not at all.
es_es: La recogida de basura está desactivada durante el funcionamiento. Ejecutar explícitamente una recolección en la devolución de llamada puede conducir a un comportamiento indefinido, por ejemplo, visitar los mismos objetos varias veces o no visitarlos en absoluto.

source: Type of the visitor function to be passed to :c:func:`PyUnstable_GC_VisitObjects`. *arg* is the same as the *arg* passed to ``PyUnstable_GC_VisitObjects``. Return ``0`` to continue iteration, return ``1`` to stop iteration. Other return values are reserved for now so behavior on returning anything else is undefined.
es_es: Tipo de la función visitante que se pasa a :c:func:`PyUnstable_GC_VisitObjects`. *arg* es el mismo que el *arg* pasado a ``PyUnstable_GC_VisitObjects``. Devuelve ``0`` para continuar la iteración, devuelve ``1`` para detener la iteración. Otros valores de retorno están reservados por ahora, por lo que el comportamiento al devolver cualquier otra cosa no está definido.
