Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/gcsupport.po
Languages: es_es, pt_pt, ru

source: Supporting Cyclic Garbage Collection
es_es: Recogida de basura cíclica
pt_pt: Suporta a Coleta Cíclica de Lixo
ru: Поддержка циклической сборки мусора

source: Python's support for detecting and collecting garbage which involves circular references requires support from object types which are "containers" for other objects which may also be containers. Types which do not store references to other objects, or which only store references to atomic types (such as numbers or strings), do not need to provide any explicit support for garbage collection.
es_es: El soporte de Python para detectar y recoger basura que implique referencias circulares requiere el soporte de tipos de objetos que son "containers" de otros objetos que también pueden ser contenedores. Los tipos que no almacenan referencias a otros objetos, o que sólo almacenan referencias a tipos atómicos (como números o cadenas), no necesitan proporcionar ningún soporte explícito para la recolección de basura.
pt_pt: O suporte do Python para detectar e coletar o lixo, que envolve referencias circulares, requer suporte dos tipos de objetos que são "contentores" para outros objetos que também podem ser contentores. Tipos que não armazenam referências a outros tipos de objetos, ou que apenas armazenam referências a tipos atômicos (como números ou strings), não precisam fornecer nenhum suporte explicito para coleta de lixo.
ru: Поддержка Python для обнаружения и сбора мусора, включающего циклические ссылки, требует поддержки типов объектов, которые являются «контейнерами» для других объектов, которые также могут быть контейнерами. Типы, которые не хранят ссылки на другие объекты или хранят только ссылки на атомарные типы (например, числа или строки), не нуждаются в явной поддержке сборки мусора.

source: To create a container type, the :c:member:`~PyTypeObject.tp_flags` field of the type object must include the :c:macro:`Py_TPFLAGS_HAVE_GC` and provide an implementation of the :c:member:`~PyTypeObject.tp_traverse` handler. If instances of the type are mutable, a :c:member:`~PyTypeObject.tp_clear` implementation must also be provided.
es_es: Para crear un tipo contenedor, el campo :c:member:`~PyTypeObject.tp_flags` del objeto de tipo debe incluir el :c:macro:`Py_TPFLAGS_HAVE_GC` y proporcionar una implementación del manejador :c:member:`~PyTypeObject.tp_traverse`. Si las instancias del tipo son mutables, también debe proporcionarse una implementación de :c:member:`~PyTypeObject.tp_clear`.
pt_pt: Para criar um tipo de contentor, o campo :c:member:`~PyTypeObject.tp_flags` do objeto de tipo deve incluir o :c:macro:`Py_TPFLAGS_HAVE_GC` e fornecer uma implementação do manipulador :c:member:`~PyTypeObject.tp_traverse`. Se as instâncias do tipo forem mutáveis, uma implementação :c:member:`~PyTypeObject.tp_clear` também deve ser fornecida.
ru: Чтобы создать тип контейнера, поле :c:member:`~PyTypeObject.tp_flags` объекта типа должно включать :c:macro:`Py_TPFLAGS_HAVE_GC` и обеспечивать реализацию :c:member:`~PyTypeObject.tp_traverse. `обработчик. Если экземпляры типа изменяемы, необходимо также предоставить реализацию :c:member:`~PyTypeObject.tp_clear`.

source: Objects with a type with this flag set must conform with the rules documented here. For convenience these objects will be referred to as container objects.
es_es: Los objetos con un tipo con esta bandera establecida deben ajustarse a las reglas documentadas aquí. Por comodidad, estos objetos se denominarán objetos contenedores.
pt_pt: Os objetos com um tipo com este sinalizador definido devem estar em conformidade com as regras aqui documentadas. Por conveniência, esses objetos serão referidos como objetos contentores.
ru: Объекты типа с этим установленным флагом должны соответствовать правилам, описанным здесь. Для удобства эти объекты будем называть объектами-контейнерами.

source: Constructors for container types must conform to two rules:
es_es: Los constructores de tipos contenedores deben cumplir dos reglas:
pt_pt: Os construtores para tipos de contentores devem estar em conformidade com duas regras:
ru: Конструкторы типов контейнеров должны соответствовать двум правилам:

source: The memory for the object must be allocated using :c:macro:`PyObject_GC_New` or :c:macro:`PyObject_GC_NewVar`.
es_es: La memoria para el objeto debe asignarse utilizando :c:macro:`PyObject_GC_New` o :c:macro:`PyObject_GC_NewVar`.
pt_pt: A memória para o objeto deve ser alocada usando :c:macro:`PyObject_GC_New` ou :c:macro:`PyObject_GC_NewVar`.
ru: Память для объекта должна быть выделена с помощью :c:macro:`PyObject_GC_New` или :c:macro:`PyObject_GC_NewVar`.

source: Once all the fields which may contain references to other containers are initialized, it must call :c:func:`PyObject_GC_Track`.
es_es: Una vez inicializados todos los campos que puedan contener referencias a otros contenedores, hay que llamar a :c:func:`PyObject_GC_Track`.
pt_pt: Depois de todos os campos que podem conter referências a outros contentores serem inicializados, deve chamar :c:func:`PyObject_GC_Track`.
ru: После инициализации всех полей, которые могут содержать ссылки на другие контейнеры, необходимо вызвать :c:func:`PyObject_GC_Track`.

source: Similarly, the deallocator for the object must conform to a similar pair of rules:
es_es: Del mismo modo, el desasignador del objeto debe ajustarse a un par de reglas similares:
pt_pt: Da mesma forma, o desalocador para o objeto deve estar em conformidade com regras semelhantes:
ru: Аналогично, освободитель объекта должен соответствовать аналогичной паре правил:

source: Before fields which refer to other containers are invalidated, :c:func:`PyObject_GC_UnTrack` must be called.
es_es: Antes de invalidar los campos que hacen referencia a otros contenedores, se debe llamar a :c:func:`PyObject_GC_UnTrack`.
pt_pt: Antes que os campos que se referem a outros contentores sejam invalidados, :c:func:`PyObject_GC_UnTrack` deve ser chamado.
ru: Прежде чем поля, которые ссылаются на другие контейнеры, станут недействительными, необходимо вызвать :c:func:`PyObject_GC_UnTrack`.

source: The object's memory must be deallocated using :c:func:`PyObject_GC_Del`.
es_es: La memoria del objeto debe ser liberada mediante :c:func:`PyObject_GC_Del`.
pt_pt: A memória destinada ao objeto deve ser desalocada usando :c:func:`PyObject_GC_Del`.
ru: Память объекта должна быть освобождена с помощью :c:func:`PyObject_GC_Del`.

source: If a type adds the Py_TPFLAGS_HAVE_GC, then it *must* implement at least a :c:member:`~PyTypeObject.tp_traverse` handler or explicitly use one from its subclass or subclasses.
es_es: Si un tipo añade el Py_TPFLAGS_HAVE_GC, entonces *debe* implementar al menos un manejador :c:member:`~PyTypeObject.tp_traverse` o usar explícitamente uno de su subclase o subclases.
pt_pt: Se um tipo adicionar Py_TPFLAGS_HAVE_GC, então ele *deve* implementar pelo menos um manipulador :c:member:`~PyTypeObject.tp_traverse` ou usar explicitamente um da sua subclasse ou subclasses.
ru: Если тип добавляет Py_TPFLAGS_HAVE_GC, то он *должен* реализовать как минимум обработчик :c:member:`~PyTypeObject.tp_traverse` или явно использовать один из его подкласса или подклассов.

source: When calling :c:func:`PyType_Ready` or some of the APIs that indirectly call it like :c:func:`PyType_FromSpecWithBases` or :c:func:`PyType_FromSpec` the interpreter will automatically populate the :c:member:`~PyTypeObject.tp_flags`, :c:member:`~PyTypeObject.tp_traverse` and :c:member:`~PyTypeObject.tp_clear` fields if the type inherits from a class that implements the garbage collector protocol and the child class does *not* include the :c:macro:`Py_TPFLAGS_HAVE_GC` flag.
es_es: Cuando se llama a :c:func:`PyType_Ready` o a algunas de las APIs que lo llaman indirectamente como :c:func:`PyType_FromSpecWithBases` o :c:func:`PyType_FromSpec` el intérprete rellenará automáticamente los campos :c:member:`~PyTypeObject.tp_flags`, :c:member:`~PyTypeObject.tp_traverse` y :c:member:`~PyTypeObject.tp_clear` si el tipo hereda de una clase que implementa el protocolo del recolector de basura y la clase hija *no* incluye la bandera :c:macro:`Py_TPFLAGS_HAVE_GC`.
pt_pt: Ao chamar :c:func:`PyType_Ready` ou algumas das APIs que o chamam indiretamente, como :c:func:`PyType_FromSpecWithBases` ou :c:func:`PyType_FromSpec`, o interpretador preencherá automaticamente os campos :c:member:`~PyTypeObject.tp_flags`, :c:member:`~PyTypeObject.tp_traverse` e :c:member:`~PyTypeObject.tp_clear` se o tipo herdar de uma classe que implementa o protocolo do coletor de lixo e a classe filha *não* incluir o sinalizador :c:macro:`Py_TPFLAGS_HAVE_GC`.
ru: При вызове :c:func:`PyType_Ready` или некоторых API, которые косвенно вызывают его, например :c:func:`PyType_FromSpecWithBases` или :c:func:`PyType_FromSpec`, интерпретатор автоматически заполняет :c:member:`~ Поля PyTypeObject.tp_flags`, :c:member:`~PyTypeObject.tp_traverse` и :c:member:`~PyTypeObject.tp_clear`, если тип наследуется от класса, реализующего протокол сборщика мусора, а дочерний класс *нет* включите флаг :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Analogous to :c:macro:`PyObject_New` but for container objects with the :c:macro:`Py_TPFLAGS_HAVE_GC` flag set.
es_es: Análogo a :c:macro:`PyObject_New` pero para objetos contenedores con la bandera :c:macro:`Py_TPFLAGS_HAVE_GC` activada.
pt_pt: Análogo a :c:macro:`PyObject_New`, mas para objetos contentores com o sinalizador :c:macro:`Py_TPFLAGS_HAVE_GC` definido.
ru: Аналогично :c:macro:`PyObject_New`, но для объектов-контейнеров с установленным флагом :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Analogous to :c:macro:`PyObject_NewVar` but for container objects with the :c:macro:`Py_TPFLAGS_HAVE_GC` flag set.
es_es: Análogo a :c:macro:`PyObject_NewVar` pero para objetos contenedores con la bandera :c:macro:`Py_TPFLAGS_HAVE_GC` activada.
pt_pt: Análogo a :c:macro:`PyObject_NewVar`, mas para objetos contentores com o sinalizador :c:macro:`Py_TPFLAGS_HAVE_GC` definido.
ru: Аналогично :c:macro:`PyObject_NewVar`, но для объектов-контейнеров с установленным флагом :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Analogous to :c:macro:`PyObject_GC_New` but allocates *extra_size* bytes at the end of the object (at offset :c:member:`~PyTypeObject.tp_basicsize`). The allocated memory is initialized to zeros, except for the :c:type:`Python object header <PyObject>`.
es_es: Análogo a :c:macro:`PyObject_GC_New` pero asigna *extra_size* bytes al final del objeto (en el offset :c:member:`~PyTypeObject.tp_basicsize`). La memoria asignada se inicializa a ceros, excepto para la cabecera del objeto :c:type:`Python <PyObject>`.

source: The extra data will be deallocated with the object, but otherwise it is not managed by Python.
es_es: Los datos extra serán reasignados con el objeto, pero por lo demás no son gestionados por Python.

source: The function is marked as unstable because the final mechanism for reserving extra data after an instance is not yet decided. For allocating a variable number of fields, prefer using :c:type:`PyVarObject` and :c:member:`~PyTypeObject.tp_itemsize` instead.
es_es: La función está marcada como inestable porque aún no se ha decidido el mecanismo definitivo para reservar datos adicionales después de una instancia. Para asignar un número variable de campos, prefiera utilizar :c:type:`PyVarObject` y :c:member:`~PyTypeObject.tp_itemsize` en su lugar.

source: Resize an object allocated by :c:macro:`PyObject_NewVar`. Returns the resized object of type ``TYPE*`` (refers to any C type) or ``NULL`` on failure.
es_es: Redimensiona un objeto asignado por :c:macro:`PyObject_NewVar`. Devuelve el objeto redimensionado de tipo ``TYPE*`` (se refiere a cualquier tipo C) o ``NULL`` en caso de fallo.
pt_pt: Redimensiona um objeto alocado por :c:macro:`PyObject_NewVar`. Retorna o objeto redimensionado do tipo ``TYPE*`` (refere-se a qualquer tipo C) ou ``NULL`` em caso de falha.
ru: Измените размер объекта, выделенного :c:macro:`PyObject_NewVar`. Возвращает объект измененного размера типа TYPE* ​​(относится к любому типу C) или NULL в случае ошибки.

source: *op* must be of type :c:expr:`PyVarObject *` and must not be tracked by the collector yet. *newsize* must be of type :c:type:`Py_ssize_t`.
es_es: *op* debe ser del tipo :c:expr:`PyVarObject *` y aún no debe ser rastreado por el recolector. *newsize* debe ser del tipo :c:type:`Py_ssize_t`.
pt_pt: *op* deve ser do tipo :c:expr:`PyVarObject *` e não deve ser rastreado pelo coletor ainda. *newsize* deve ser do tipo :c:type:`Py_ssize_t`.
ru: *op* должен иметь тип :c:expr:`PyVarObject *` и пока не должен отслеживаться сборщиком. *newsize* должен иметь тип :c:type:`Py_ssize_t`.

source: Adds the object *op* to the set of container objects tracked by the collector. The collector can run at unexpected times so objects must be valid while being tracked. This should be called once all the fields followed by the :c:member:`~PyTypeObject.tp_traverse` handler become valid, usually near the end of the constructor.
es_es: Añade el objeto *op* al conjunto de objetos contenedores rastreados por el recopilador. El recolector puede ejecutarse en momentos inesperados, por lo que los objetos han de ser válidos mientras se rastrean. Debe llamarse una vez que todos los campos seguidos por el manejador :c:member:`~PyTypeObject.tp_traverse` sean válidos, normalmente cerca del final del constructor.
pt_pt: Adiciona o objeto *op* ao conjunto de objetos contentores rastreados pelo coletor. O coletor pode ser executado em momentos inesperados, portanto os objetos devem ser válidos enquanto são rastreados. Isso deve ser chamado assim que todos os campos seguidos pelo manipulador :c:member:`~PyTypeObject.tp_traverse` se tornarem válidos, geralmente perto do final do construtor.
ru: Добавляет объект *op* в набор объектов-контейнеров, отслеживаемых сборщиком. Сборщик может запускаться в неожиданное время, поэтому объекты должны быть действительными во время отслеживания. Его следует вызывать, как только все поля, за которыми следует обработчик :c:member:`~PyTypeObject.tp_traverse`, станут действительными, обычно ближе к концу конструктора.

source: Returns non-zero if the object implements the garbage collector protocol, otherwise returns 0.
es_es: Devuelve un valor distinto de cero si el objeto implementa el protocolo del recolector de basura; en caso contrario, devuelve 0.
pt_pt: Retorna um valor diferente de zero se o objeto implementar o protocolo do coletor de lixo, caso contrário, retorna 0.
ru: Возвращает ненулевое значение, если объект реализует протокол сборщика мусора, в противном случае возвращает 0.

source: The object cannot be tracked by the garbage collector if this function returns 0.
es_es: Si esta función devuelve 0, el objeto no se puede rastrear por el recolector de basura.
pt_pt: O objeto não pode ser rastreado pelo coletor de lixo se esta função retornar 0.
ru: Объект не может отслеживаться сборщиком мусора, если эта функция возвращает 0.

source: Returns 1 if the object type of *op* implements the GC protocol and *op* is being currently tracked by the garbage collector and 0 otherwise.
es_es: Devuelve 1 si el tipo de objeto de *op* implementa el protocolo GC y *op* está siendo actualmente rastreado por el recolector de basura y 0 en caso contrario.
pt_pt: Retorna 1 se o tipo de objeto de *op* implementar o protocolo GC e *op* estiver a ser rastreado pelo coletor de lixo, e 0 caso contrário.
ru: Возвращает 1, если тип объекта *op* реализует протокол GC и *op* в данный момент отслеживается сборщиком мусора, и 0 в противном случае.

source: This is analogous to the Python function :func:`gc.is_tracked`.
es_es: Esto es análogo a la función de Python :func:`gc.is_tracked`.
pt_pt: Isso é análogo à função Python :func:`gc.is_tracked`.
ru: Это аналог функции Python :func:`gc.is_tracked`.

source: Returns 1 if the object type of *op* implements the GC protocol and *op* has been already finalized by the garbage collector and 0 otherwise.
es_es: Devuelve 1 si el tipo de objeto de *op* implementa el protocolo GC y *op* ya ha sido finalizado por el recolector de basura y 0 en caso contrario.
pt_pt: Retorna 1 se o tipo de objeto de *op* implementar o protocolo GC e *op* já tiver sido finalizado pelo coletor de lixo, e 0 caso contrário.
ru: Возвращает 1, если тип объекта *op* реализует протокол GC и *op* уже завершен сборщиком мусора, и 0 в противном случае.

source: This is analogous to the Python function :func:`gc.is_finalized`.
es_es: Esto es análogo a la función de Python :func:`gc.is_finalized`.
pt_pt: Isso é análogo à função Python :func:`gc.is_finalized`.
ru: Это аналогично функции Python :func:`gc.is_finalized`.

source: Releases memory allocated to an object using :c:macro:`PyObject_GC_New` or :c:macro:`PyObject_GC_NewVar`.
es_es: Libera la memoria asignada a un objeto mediante :c:macro:`PyObject_GC_New` o :c:macro:`PyObject_GC_NewVar`.
pt_pt: Libera a memória alocada para um objeto usando :c:macro:`PyObject_GC_New` ou :c:macro:`PyObject_GC_NewVar`.
ru: Освобождает память, выделенную объекту, используя :c:macro:`PyObject_GC_New` или :c:macro:`PyObject_GC_NewVar`.

source: Remove the object *op* from the set of container objects tracked by the collector. Note that :c:func:`PyObject_GC_Track` can be called again on this object to add it back to the set of tracked objects. The deallocator (:c:member:`~PyTypeObject.tp_dealloc` handler) should call this for the object before any of the fields used by the :c:member:`~PyTypeObject.tp_traverse` handler become invalid.
es_es: Elimina el objeto *op* del conjunto de objetos contenedores rastreados por el recolector. Tener en cuenta que :c:func:`PyObject_GC_Track` se puede llamar de nuevo a este objeto para añadirlo de nuevo al conjunto de objetos rastreados. El no asignador (gestor de:c:member:`~PyTypeObject.tp_dealloc` ) debe llamar a esto para el objeto antes de que cualquiera de los campos utilizados por el gestor de :c:member:`~PyTypeObject.tp_traverse` deje de ser válido.
pt_pt: Remova o objeto *op* do conjunto de objetos contentores rastreados pelo coletor. Observe que :c:func:`PyObject_GC_Track` pode ser chamado novamente neste objeto para adicioná-lo de volta ao conjunto de objetos rastreados. O desalocador (manipulador :c:member:`~PyTypeObject.tp_dealloc`) deve chamar isso para o objeto antes que qualquer um dos campos usados pelo manipulador :c:member:`~PyTypeObject.tp_traverse` se torne inválido.
ru: Удалите объект *op* из набора объектов-контейнеров, отслеживаемых сборщиком. Обратите внимание, что :c:func:`PyObject_GC_Track` можно вызвать снова для этого объекта, чтобы добавить его обратно в набор отслеживаемых объектов. Deallocator (:c:member:`~PyTypeObject.tp_dealloc` обработчик) должен вызвать это для объекта до того, как любое из полей, используемых обработчиком :c:member:`~PyTypeObject.tp_traverse`, станет недействительным.

source: The :c:func:`!_PyObject_GC_TRACK` and :c:func:`!_PyObject_GC_UNTRACK` macros have been removed from the public C API.
es_es: Las macros :c:func:`!_PyObject_GC_TRACK` y :c:func:`!_PyObject_GC_UNTRACK` se han eliminado de la API pública de C.
pt_pt: As macros :c:func:`!_PyObject_GC_TRACK` e :c:func:`!_PyObject_GC_UNTRACK` foram removidas da API C pública.
ru: Макросы :c:func:`!_PyObject_GC_TRACK` и :c:func:`!_PyObject_GC_UNTRACK` были удалены из общедоступного C API.

source: The :c:member:`~PyTypeObject.tp_traverse` handler accepts a function parameter of this type:
es_es: El manejador :c:member:`~PyTypeObject.tp_traverse` acepta un parámetro de función de este tipo:
pt_pt: O manipulador :c:member:`~PyTypeObject.tp_traverse` aceita um parâmetro de função deste tipo:
ru: Обработчик :c:member:`~PyTypeObject.tp_traverse` принимает параметр функции этого типа:

source: Type of the visitor function passed to the :c:member:`~PyTypeObject.tp_traverse` handler. The function should be called with an object to traverse as *object* and the third parameter to the :c:member:`~PyTypeObject.tp_traverse` handler as *arg*. The Python core uses several visitor functions to implement cyclic garbage detection; it's not expected that users will need to write their own visitor functions.
es_es: Tipo de la función visitante pasada al manejador :c:member:`~PyTypeObject.tp_traverse`. La función debe llamarse con un objeto a recorrer como *object* y el tercer parámetro al manejador :c:member:`~PyTypeObject.tp_traverse` como *arg*. El núcleo de Python utiliza varias funciones de visitante para implementar la detección cíclica de basura; no se espera que los usuarios tengan que escribir sus propias funciones de visitante.
pt_pt: Tipo da função visitante passada para o manipulador :c:member:`~PyTypeObject.tp_traverse`. A função deve ser chamada com um objeto a ser percorrido como *object* e o terceiro parâmetro para o manipulador :c:member:`~PyTypeObject.tp_traverse` como *arg*. O núcleo do Python usa várias funções visitante para implementar a deteção de lixo cíclico; não se espera que os utilizadores precisem escrever as suas próprias funções visitante.
ru: Тип функции посетителя, передаваемой обработчику :c:member:`~PyTypeObject.tp_traverse`. Функцию следует вызывать с объектом для перемещения как *object* и третьим параметром обработчика :c:member:`~PyTypeObject.tp_traverse` как *arg*. Ядро Python использует несколько гостевых функций для реализации циклического обнаружения мусора; не ожидается, что пользователям потребуется писать свои собственные функции посетителей.

source: The :c:member:`~PyTypeObject.tp_traverse` handler must have the following type:
es_es: El manejador :c:member:`~PyTypeObject.tp_traverse` debe tener el siguiente tipo:
pt_pt: O manipulador :c:member:`~PyTypeObject.tp_traverse` deve ter o seguinte tipo:
ru: Обработчик :c:member:`~PyTypeObject.tp_traverse` должен иметь следующий тип:

source: Traversal function for a container object. Implementations must call the *visit* function for each object directly contained by *self*, with the parameters to *visit* being the contained object and the *arg* value passed to the handler. The *visit* function must not be called with a ``NULL`` object argument. If *visit* returns a non-zero value that value should be returned immediately.
es_es: Función transversal para un objeto contenedor.. Las implementaciones deben llamar a la función *visit* para cada objeto contenido directamente por *self*, siendo los parámetros de *visit* el objeto contenido y el valor *arg* pasado al manejador. La función *visit* no se debe llamar con un argumento de objeto ``NULL``. Si *visit* devuelve un valor distinto de cero, dicho valor debe devolverse inmediatamente.
pt_pt: Função transversal para um objeto contentor. As implementações devem chamar a função *visit* para cada objeto diretamente contido em *self*, com os parâmetros para *visit* sendo o objeto contido e o valor *arg* passado para o manipulador. A função *visit* não deve ser chamada com um argumento de objeto ``NULL``. Se *visit* retornar um valor diferente de zero, esse valor deve ser retornado imediatamente.
ru: Функция обхода объекта-контейнера. Реализации должны вызывать функцию *visit* для каждого объекта, непосредственно содержащегося в *self*, причем параметры *visit* являются содержащимся объектом, а значение *arg* передается обработчику. Функцию *visit* нельзя вызывать с аргументом объекта ``NULL``. Если *visit* возвращает ненулевое значение, это значение должно быть возвращено немедленно.
