Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: es_es, sv

source: On other platforms: use ``"surrogateescape"`` by default.
es_es: En otras plataformas: utilice ``"surrogateescape"`` por defecto.
sv: På andra plattformar: använd ``"surrogateescape"`` som standard.

source: Supported error handlers:
es_es: Manejadores de error soportados:
sv: Felhanterare som stöds:

source: ``"strict"``
sv: ``"strikt"``

source: ``"surrogateescape"``
sv: ``"surrogatlandskap"``

source: ``"surrogatepass"`` (only supported with the UTF-8 encoding)
es_es: ``"surrogatepass"`` (sólo compatible con la codificación UTF-8)
sv: ``"surrogatepass"`` (stöds endast med UTF-8-kodning)

source: See also the :c:member:`~PyConfig.filesystem_encoding` member.
es_es: Ver también el miembro :c:member:`~PyConfig.filesystem_encoding`.
sv: Se även medlemmen :c:member:`~PyConfig.filesystem_encoding`.

source: If non-zero, use frozen modules.
sv: Om värdet är annat än noll, använd frysta moduler.

source: Set by the :envvar:`PYTHON_FROZEN_MODULES` environment variable.
sv: Ställs in av miljövariabeln :envvar:`PYTHON_FROZEN_MODULES`.

source: Default: ``1`` in a release build, or ``0`` in a :ref:`debug build <debug-build>`.
sv: Standard: ``1`` i en release-byggnad, eller ``0`` i en :ref:`debug-byggnad <debug-build>`.

source: Randomized hash function seed.
es_es: Semilla de función hash aleatoria.
sv: Slumpmässigt utsäde för hashfunktion.

source: If :c:member:`~PyConfig.use_hash_seed` is zero, a seed is chosen randomly at Python startup, and :c:member:`~PyConfig.hash_seed` is ignored.
es_es: Si :c:member:`~PyConfig.use_hash_seed` es cero, se elige una semilla aleatoriamente al inicio de Python, y se ignora :c:member:`~PyConfig.hash_seed`.
sv: Om :c:member:`~PyConfig.use_hash_seed` är noll, väljs ett frö slumpmässigt vid Python-start och :c:member:`~PyConfig.hash_seed` ignoreras.

source: Set by the :envvar:`PYTHONHASHSEED` environment variable.
es_es: Establecido por la variable de entorno :envvar:`PYTHONHASHSEED`.
sv: Ställs in av miljövariabeln :envvar:`PYTHONHASHSEED`.

source: Default *use_hash_seed* value: ``-1`` in Python mode, ``0`` in isolated mode.
es_es: Por defecto *use_hash_seed* value: ``-1`` en modo Python, ``0`` en modo aislado.
sv: Standardvärde för *use_hash_seed*: ``-1`` i Python-läge, ``0`` i isolerat läge.

source: Set the default Python "home" directory, that is, the location of the standard Python libraries (see :envvar:`PYTHONHOME`).
sv: Ange standardkatalogen för Python, det vill säga platsen där Pythons standardbibliotek finns (se :envvar:`PYTHONHOME`).

source: Set by the :envvar:`PYTHONHOME` environment variable.
es_es: Establecido por la variable de entorno :envvar:`PYTHONHOME`.
sv: Ställs in av miljövariabeln :envvar:`PYTHONHOME`.

source: Part of the :ref:`Python Path Configuration <init-path-config>` input.
es_es: Parte de la entrada :ref:`Python Path Configuration <init-path-config>`.
sv: Del av :ref:`Python Path Configuration <init-path-config>` inmatning.

source: If ``1``, profile import time. If ``2``, include additional output that indicates when an imported module has already been loaded.
sv: Om ``1``, profilera importtiden. Om ``2``, inkludera ytterligare utdata som indikerar när en importerad modul redan har laddats.

source: Set by the :option:`-X importtime <-X>` option and the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable.
sv: Ställs in med alternativet :option:`-X importtime <-X>` och miljövariabeln :envvar:`PYTHONPROFILEIMPORTTIME`.

source: Added support for ``import_time = 2``
sv: Lagt till stöd för ``import_time = 2``

source: Enter interactive mode after executing a script or a command.
es_es: Entrar en modo interactivo después de ejecutar un script o un comando.
sv: Gå till interaktivt läge efter att du har kört ett skript eller ett kommando.

source: If greater than ``0``, enable inspect: when a script is passed as first argument or the -c option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal.
es_es: Si es mayor que ``0``, habilita la inspección: cuando se pasa un script como primer argumento o se utiliza la opción -c, entra en modo interactivo después de ejecutar el script o el comando, incluso cuando :data:`sys.stdin` no parece ser un terminal.
sv: Om större än ``0``, aktivera inspect: när ett skript skickas som första argument eller alternativet -c används, gå till interaktivt läge efter att skriptet eller kommandot har exekverats, även om :data:`sys.stdin` inte verkar vara en terminal.

source: Incremented by the :option:`-i` command line option. Set to ``1`` if the :envvar:`PYTHONINSPECT` environment variable is non-empty.
es_es: Incrementado por la opción de línea de comandos :option:`-i`. Se establece en ``1`` si la variable de entorno :envvar:`PYTHONINSPECT` no está vacía.
sv: Ökas med kommandoradsalternativet :option:`-i`. Sätts till ``1`` om miljövariabeln :envvar:`PYTHONINSPECT` inte är tom.

source: Install Python signal handlers?
es_es: ¿Instalar manejadores de señales de Python?
sv: Installera Python-signalhanterare?

source: Default: ``1`` in Python mode, ``0`` in isolated mode.
es_es: Por defecto: ``1`` en modo Python, ``0`` en modo aislado.
sv: Standard: ``1`` i Python-läge, ``0`` i isolerat läge.

source: If greater than ``0``, enable the interactive mode (REPL).
es_es: Si es mayor que ``0``, active el modo interactivo (REPL).
sv: Om större än ``0``, aktivera det interaktiva läget (REPL).

source: Incremented by the :option:`-i` command line option.
es_es: Incrementado por la opción de línea de comandos :option:`-i`.
sv: Ökas med kommandoradsalternativet :option:`-i`.

source: Configures the :ref:`integer string conversion length limitation <int_max_str_digits>`. An initial value of ``-1`` means the value will be taken from the command line or environment or otherwise default to 4300 (:data:`sys.int_info.default_max_str_digits`). A value of ``0`` disables the limitation. Values greater than zero but less than 640 (:data:`sys.int_info.str_digits_check_threshold`) are unsupported and will produce an error.
es_es: Configura la limitación de longitud de conversión de cadenas :ref:`integer <int_max_str_digits>`. Un valor inicial de ``-1`` significa que el valor se tomará de la línea de comandos o del entorno o, de lo contrario, será por defecto 4300 (:data:`sys.int_info.default_max_str_digits`). Un valor de ``0`` desactiva la limitación. Los valores mayores que cero pero menores que 640 (:data:`sys.int_info.str_digits_check_threshold`) no se soportan y producirán un error.
sv: Konfigurerar :ref:`Längdsbegränsning för konvertering av heltalssträngar <int_max_str_digits>`. Ett initialt värde på ``-1`` innebär att värdet hämtas från kommandoraden eller miljön eller annars är standardvärdet 4300 (:data:`sys.int_info.default_max_str_digits`). Ett värde på ``0`` inaktiverar begränsningen. Värden som är större än noll men mindre än 640 (:data:`sys.int_info.str_digits_check_threshold`) stöds inte och leder till ett fel.

source: Configured by the :option:`-X int_max_str_digits <-X>` command line flag or the :envvar:`PYTHONINTMAXSTRDIGITS` environment variable.
es_es: Configurado mediante el indicador de línea de comandos :option:`-X int_max_str_digits <-X>` o la variable de entorno :envvar:`PYTHONINTMAXSTRDIGITS`.
sv: Konfigureras av kommandoradsflaggan :option:`-X int_max_str_digits <-X>` eller miljövariabeln :envvar:`PYTHONINTMAXSTRDIGITS`.

source: Default: ``-1`` in Python mode. 4300 (:data:`sys.int_info.default_max_str_digits`) in isolated mode.
es_es: Por defecto: ``-1`` en modo Python. 4300 (:data:`sys.int_info.default_max_str_digits`) en modo aislado.
sv: Standard: ``-1`` i Python-läge. 4300 (:data:`sys.int_info.default_max_str_digits`) i isolerat läge.

source: If the value of :c:member:`~PyConfig.cpu_count` is not ``-1`` then it will override the return values of :func:`os.cpu_count`, :func:`os.process_cpu_count`, and :func:`multiprocessing.cpu_count`.
sv: Om värdet för :c:member:`~PyConfig.cpu_count` inte är ``-1`` så kommer det att åsidosätta returvärdena för :func:`os.cpu_count`, :func:`os.process_cpu_count`, och :func:`multiprocessing.cpu_count`.

source: Configured by the :samp:`-X cpu_count={n|default}` command line flag or the :envvar:`PYTHON_CPU_COUNT` environment variable.
sv: Konfigureras av kommandoradsflaggan :samp:`-X cpu_count={n|default}` eller miljövariabeln :envvar:`PYTHON_CPU_COUNT`.

source: Default: ``-1``.
es_es: Por defecto: ``-1``.
sv: Standard: ``-1``.

source: If greater than ``0``, enable isolated mode:
es_es: Si es mayor que ``0``, activa el modo aislado:
sv: Om större än ``0``, aktivera isolerat läge:

source: Set :c:member:`~PyConfig.safe_path` to ``1``: don't prepend a potentially unsafe path to :data:`sys.path` at Python startup, such as the current directory, the script's directory or an empty string.
es_es: Establezca :c:member:`~PyConfig.safe_path` en ``1``: no anteponga una ruta potencialmente insegura a :data:`sys.path` al inicio de Python, como el directorio actual, el directorio del script o una cadena vacía.
sv: Sätt :c:member:`~PyConfig.safe_path` till ``1``: lägg inte till en potentiellt osäker sökväg till :data:`sys.path` vid Python-start, t.ex. den aktuella katalogen, skriptets katalog eller en tom sträng.

source: Set :c:member:`~PyConfig.use_environment` to ``0``: ignore ``PYTHON`` environment variables.
es_es: Establezca :c:member:`~PyConfig.use_environment` en ``0``: ignore las variables de entorno ``PYTHON``.
sv: Sätt :c:member:`~PyConfig.use_environment` till ``0``: ignorera ``PYTHON`` miljövariabler.

source: Set :c:member:`~PyConfig.user_site_directory` to ``0``: don't add the user site directory to :data:`sys.path`.
es_es: Establezca :c:member:`~PyConfig.user_site_directory` en ``0``: no añada el directorio del sitio del usuario en :data:`sys.path`.
sv: Sätt :c:member:`~PyConfig.user_site_directory` till ``0``: lägg inte till användarkatalogen i :data:`sys.path`.

source: Python REPL doesn't import :mod:`readline` nor enable default readline configuration on interactive prompts.
es_es: Python REPL no importa :mod:`readline` ni habilita la configuración readline por defecto en las peticiones interactivas.
sv: Python REPL importerar inte :mod:`readline` eller aktiverar standardkonfiguration för readline på interaktiva prompter.

source: Set to ``1`` by the :option:`-I` command line option.
es_es: Establecido en ``1`` mediante la opción de línea de comandos :option:`-I`.
sv: Sätts till ``1`` med kommandoradsalternativet :option:`-I`.

source: See also the :ref:`Isolated Configuration <init-isolated-conf>` and :c:member:`PyPreConfig.isolated`.
es_es: Consulte también la :ref:`Isolated Configuration <init-isolated-conf>` y :c:member:`PyPreConfig.isolated`.
sv: Se även :ref:`Isolated Configuration <init-isolated-conf>` och :c:member:`PyPreConfig.isolated`.

source: If non-zero, use :class:`io.FileIO` instead of :class:`!io._WindowsConsoleIO` for :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr`.
es_es: Si es distinto de cero, utilice :class:`io.FileIO` en lugar de :class:`!io._WindowsConsoleIO` para :data:`sys.stdin`, :data:`sys.stdout` y :data:`sys.stderr`.
sv: Om den inte är noll, använd :class:`io.FileIO` istället för :class:`!io._WindowsConsoleIO` för :data:`sys.stdin`, :data:`sys.stdout` och :data:`sys.stderr`.

source: Set to ``1`` if the :envvar:`PYTHONLEGACYWINDOWSSTDIO` environment variable is set to a non-empty string.
es_es: Se establece en ``1`` si la variable de entorno :envvar:`PYTHONLEGACYWINDOWSSTDIO` se establece en una cadena no vacía.
sv: Sätts till ``1`` om miljövariabeln :envvar:`PYTHONLEGACYWINDOWSSTDIO` är satt till en icke-tom sträng.

source: See also the :pep:`528` (Change Windows console encoding to UTF-8).
es_es: Ver también :pep:`528` (Cambiar la codificación de la consola de Windows a UTF-8).
sv: Se även :pep:`528` (Ändra Windows-konsolens kodning till UTF-8).

source: If non-zero, dump statistics on :ref:`Python pymalloc memory allocator <pymalloc>` at exit.
es_es: Si no es cero, vuelca las estadísticas en :ref:`Python pymalloc memory allocator <pymalloc>` al salir.
sv: Om ej noll, dumpa statistik på :ref:`Python pymalloc memory allocator <pymalloc>` vid avslut.

source: Set to ``1`` by the :envvar:`PYTHONMALLOCSTATS` environment variable.
es_es: Establecido en ``1`` por la variable de entorno :envvar:`PYTHONMALLOCSTATS`.
sv: Sätts till ``1`` av miljövariabeln :envvar:`PYTHONMALLOCSTATS`.

source: The option is ignored if Python is :option:`configured using the --without-pymalloc option <--without-pymalloc>`.
es_es: La opción se ignora si Python está :option:`configurado utilizando la opción --without-pymalloc <--without-pymalloc>`.
sv: Alternativet ignoreras om Python är :option:`konfigurerad med alternativet --without-pymalloc <--without-pymalloc>`.

source: Platform library directory name: :data:`sys.platlibdir`.
es_es: Nombre del directorio de la biblioteca de la plataforma: :data:`sys.platlibdir`.
sv: Katalognamn för plattformsbibliotek: :data:`sys.platlibdir`.

source: Set by the :envvar:`PYTHONPLATLIBDIR` environment variable.
es_es: Establecido por la variable de entorno :envvar:`PYTHONPLATLIBDIR`.
sv: Ställs in av miljövariabeln :envvar:`PYTHONPLATLIBDIR`.

source: Default: value of the ``PLATLIBDIR`` macro which is set by the :option:`configure --with-platlibdir option <--with-platlibdir>` (default: ``"lib"``, or ``"DLLs"`` on Windows).
es_es: Por defecto: valor de la macro ``PLATLIBDIR`` que se establece mediante la opción :option:`configure --with-platlibdir option <--with-platlibdir>` (por defecto: ``"lib"``, o ``"DLLs"`` en Windows).
sv: Standard: värdet på makrot ``PLATLIBDIR`` som anges av :option:`configure --with-platlibdir option <--with-platlibdir>` (standard: ``"lib"``, eller ``"DLLs"`` på Windows).

source: This macro is now used on Windows to locate the standard library extension modules, typically under ``DLLs``. However, for compatibility, note that this value is ignored for any non-standard layouts, including in-tree builds and virtual environments.
es_es: Esta macro se utiliza ahora en Windows para localizar los módulos de extensión de la biblioteca estándar, normalmente en ``DLLs``. Sin embargo, por motivos de compatibilidad, tenga en cuenta que este valor se ignora para cualquier disposición no estándar, incluidas las compilaciones en árbol y los entornos virtuales.
sv: Detta makro används nu i Windows för att lokalisera standardbibliotekets tilläggsmoduler, vanligtvis under ``DLLs``. Av kompatibilitetsskäl bör du dock notera att detta värde ignoreras för alla icke-standardiserade layouter, inklusive in-tree builds och virtuella miljöer.

source: Module search paths (:data:`sys.path`) as a string separated by ``DELIM`` (:data:`os.pathsep`).
es_es: Rutas de búsqueda de módulos (:data:`sys.path`) como cadena separada por ``DELIM`` (:data:`os.pathsep`).
sv: Sökvägar för modul (:data:`sys.path`) som en sträng separerad med ``DELIM`` (:data:`os.pathsep`).

source: Set by the :envvar:`PYTHONPATH` environment variable.
es_es: Establecido por la variable de entorno :envvar:`PYTHONPATH`.
sv: Ställs in av miljövariabeln :envvar:`PYTHONPATH`.

source: Module search paths: :data:`sys.path`.
es_es: Rutas de búsqueda de módulos: :data:`sys.path`.
sv: Sökvägar för modul: :data:`sys.path`.

source: If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:func:`Py_InitializeFromConfig` will replace :c:member:`~PyConfig.module_search_paths` and sets :c:member:`~PyConfig.module_search_paths_set` to ``1``.
es_es: Si :c:member:`~PyConfig.module_search_paths_set` es igual a ``0``, :c:func:`Py_InitializeFromConfig` sustituirá a :c:member:`~PyConfig.module_search_paths` y establece :c:member:`~PyConfig.module_search_paths_set` en ``1``.
sv: Om :c:member:`~PyConfig.module_search_paths_set` är lika med ``0``, kommer :c:func:`Py_InitializeFromConfig` att ersätta :c:member:`~PyConfig.module_search_paths` och sätter :c:member:`~PyConfig.module_search_paths_set` till ``1``.

source: Default: empty list (``module_search_paths``) and ``0`` (``module_search_paths_set``).
es_es: Por defecto: lista vacía (``module_search_paths``) y ``0`` (``module_search_paths_set``).
sv: Standard: tom lista (``module_search_paths``) och ``0`` (``module_search_paths_set``).

source: Compilation optimization level:
es_es: Nivel de optimización de la compilación:
sv: Nivå för kompileringsoptimering:

source: ``0``: Peephole optimizer, set ``__debug__`` to ``True``.
es_es: ``0``: Optimizador de peephole, ajuste ``__debug__`` a ``True``.
sv: ``0``: Peephole optimizer, ställ in ``__debug__`` till ``True``.

source: ``1``: Level 0, remove assertions, set ``__debug__`` to ``False``.
es_es: ``1``: Nivel 0, eliminar aserciones, establecer ``__debug__`` a ``False``.
sv: ``1``: Nivå 0, ta bort påståenden, sätt ``__debug__`` till ``False``.

source: ``2``: Level 1, strip docstrings.
es_es: ``2``: Nivel 1, tira de docstrings.
sv: ``2``: Nivå 1, remsa docstrings.

source: Incremented by the :option:`-O` command line option. Set to the :envvar:`PYTHONOPTIMIZE` environment variable value.
es_es: Incrementado por la opción de línea de comandos :option:`-O`. Se establece en el valor de la variable de entorno :envvar:`PYTHONOPTIMIZE`.
sv: Ökas med kommandoradsalternativet :option:`-O`. Sätts till värdet för miljövariabeln :envvar:`PYTHONOPTIMIZE`.

source: The list of the original command line arguments passed to the Python executable: :data:`sys.orig_argv`.
es_es: La lista de los argumentos de línea de comandos originales pasados al ejecutable Python: :data:`sys.orig_argv`.
sv: Listan över de ursprungliga kommandoradsargumenten som skickades till Python-körprogrammet: :data:`sys.orig_argv`.

source: If :c:member:`~PyConfig.orig_argv` list is empty and :c:member:`~PyConfig.argv` is not a list only containing an empty string, :c:func:`PyConfig_Read` copies :c:member:`~PyConfig.argv` into :c:member:`~PyConfig.orig_argv` before modifying :c:member:`~PyConfig.argv` (if :c:member:`~PyConfig.parse_argv` is non-zero).
es_es: Si la lista :c:member:`~PyConfig.orig_argv` está vacía y :c:member:`~PyConfig.argv` no es una lista que sólo contenga una cadena vacía, :c:func:`PyConfig_Read` copia :c:member:`~PyConfig.argv` en :c:member:`~PyConfig.orig_argv` antes de modificar :c:member:`~PyConfig.argv` (si :c:member:`~PyConfig.parse_argv` es distinto de cero).
sv: Om listan :c:member:`~PyConfig.orig_argv` är tom och :c:member:`~PyConfig.argv` inte är en lista som bara innehåller en tom sträng, kopierar :c:func:`PyConfig_Read` :c:member:`~PyConfig.argv` till :c:member:`~PyConfig.orig_argv` innan den modifierar :c:member:`~PyConfig.argv` (om :c:member:`~PyConfig.parse_argv` inte är noll).

source: See also the :c:member:`~PyConfig.argv` member and the :c:func:`Py_GetArgcArgv` function.
es_es: Ver también el miembro :c:member:`~PyConfig.argv` y la función :c:func:`Py_GetArgcArgv`.
sv: Se även medlemmen :c:member:`~PyConfig.argv` och funktionen :c:func:`Py_GetArgcArgv`.

source: Default: empty list.
es_es: Por defecto: lista vacía.
sv: Standard: tom lista.

source: Parse command line arguments?
es_es: ¿Analizar argumentos de línea de comandos?
sv: Analysera kommandoradsargument?

source: If equals to ``1``, parse :c:member:`~PyConfig.argv` the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and strip Python arguments from :c:member:`~PyConfig.argv`.
es_es: Si es igual a ``1``, analiza :c:member:`~PyConfig.argv` del mismo modo que Python analiza :ref:`argumentos de línea de comandos <using-on-cmdline>`, y elimina los argumentos Python de :c:member:`~PyConfig.argv`.
sv: Om lika med ``1``, analyseras :c:member:`~PyConfig.argv` på samma sätt som vanliga Python analyserar :ref:`kommandoradsargument <using-on-cmdline>`, och Python-argument tas bort från :c:member:`~PyConfig.argv`.

source: The :c:member:`PyConfig.argv` arguments are now only parsed if :c:member:`PyConfig.parse_argv` equals to ``1``.
es_es: Los argumentos :c:member:`PyConfig.argv` ahora sólo se analizan si :c:member:`PyConfig.parse_argv` es igual a ``1``.
sv: Argumenten i :c:member:`PyConfig.argv` analyseras nu endast om :c:member:`PyConfig.parse_argv` är lika med ``1``.

source: Parser debug mode. If greater than ``0``, turn on parser debugging output (for expert only, depending on compilation options).
es_es: Modo de depuración del analizador sintáctico. Si es mayor que ``0``, activa la salida de depuración del analizador (sólo para expertos, dependiendo de las opciones de compilación).
sv: Felsökningsläge för parser. Om större än ``0``, aktivera felsökningsutmatning för parser (endast för experter, beroende på kompileringsalternativ).

source: Incremented by the :option:`-d` command line option. Set to the :envvar:`PYTHONDEBUG` environment variable value.
es_es: Incrementado por la opción de línea de comandos :option:`-d`. Se establece en el valor de la variable de entorno :envvar:`PYTHONDEBUG`.
sv: Ökas med kommandoradsalternativet :option:`-d`. Sätts till värdet för miljövariabeln :envvar:`PYTHONDEBUG`.

source: Needs a :ref:`debug build of Python <debug-build>` (the ``Py_DEBUG`` macro must be defined).
sv: Kräver en :ref:`debug-version av Python <debug-build>` (makrot ``Py_DEBUG`` måste vara definierat).

source: If non-zero, calculation of path configuration is allowed to log warnings into ``stderr``. If equals to ``0``, suppress these warnings.
es_es: Si es distinto de cero, se permite que el cálculo de la configuración de la ruta registre advertencias en ``stderr``. Si es igual a ``0``, se suprimen estas advertencias.
sv: Om ej noll, tillåts beräkning av sökvägskonfiguration att logga varningar i ``stderr``. Om lika med ``0``, undertrycks dessa varningar.

source: Now also applies on Windows.
es_es: Ahora también se aplica en Windows.
sv: Gäller nu även på Windows.

source: The site-specific directory prefix where the platform independent Python files are installed: :data:`sys.prefix`.
es_es: El prefijo del directorio específico del sitio donde se instalan los archivos Python independientes de la plataforma: :data:`sys.prefix`.
sv: Det platsspecifika katalogprefixet där de plattformsoberoende Python-filerna installeras: :data:`sys.prefix`.

source: See also :c:member:`PyConfig.base_prefix`.
sv: Se även :c:member:`PyConfig.base_prefix`.

source: Program name used to initialize :c:member:`~PyConfig.executable` and in early error messages during Python initialization.
es_es: Nombre del programa utilizado para inicializar :c:member:`~PyConfig.executable` y en los primeros mensajes de error durante la inicialización de Python.
sv: Programnamn som används för att initiera :c:member:`~PyConfig.executable` och i tidiga felmeddelanden under Python-initialisering.

source: On macOS, use :envvar:`PYTHONEXECUTABLE` environment variable if set.
es_es: En macOS, utilice la variable de entorno :envvar:`PYTHONEXECUTABLE` si está configurada.
sv: På macOS, använd :envvar:`PYTHONEXECUTABLE` miljövariabel om den är inställd.

source: If the ``WITH_NEXT_FRAMEWORK`` macro is defined, use :envvar:`__PYVENV_LAUNCHER__` environment variable if set.
es_es: Si la macro ``WITH_NEXT_FRAMEWORK`` está definida, utilice la variable de entorno :envvar:`__PYVENV_LAUNCHER__` si está establecida.
sv: Om makrot ``WITH_NEXT_FRAMEWORK`` är definierat, använd :envvar:`__PYVENV_LAUNCHER__` miljövariabel om den är inställd.

source: Use ``argv[0]`` of :c:member:`~PyConfig.argv` if available and non-empty.
es_es: Utilice ``argv[0]`` de :c:member:`~PyConfig.argv` si está disponible y no está vacío.
sv: Använd ``argv[0]`` i :c:member:`~PyConfig.argv` om den finns tillgänglig och inte är tom.
