Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: es_es, sv

source: Otherwise, use ``L"python"`` on Windows, or ``L"python3"`` on other platforms.
es_es: En caso contrario, utilice ``L"python"`` en Windows, o ``L"python3"`` en otras plataformas.
sv: Annars använder du ``L"python"`` på Windows, eller ``L"python3"`` på andra plattformar.

source: Directory where cached ``.pyc`` files are written: :data:`sys.pycache_prefix`.
es_es: Directorio donde se escriben los archivos ``.pyc`` en caché: :data:`sys.pycache_prefix`.
sv: Katalog där cachade ``.pyc``-filer skrivs: :data:`sys.pycache_prefix`.

source: Set by the :option:`-X pycache_prefix=PATH <-X>` command line option and the :envvar:`PYTHONPYCACHEPREFIX` environment variable. The command-line option takes precedence.
sv: Ställs in med kommandoradsalternativet :option:`-X pycache_prefix=PATH <-X>` och miljövariabeln :envvar:`PYTHONPYCACHEPREFIX`. Kommandoradsalternativet har företräde.

source: If ``NULL``, :data:`sys.pycache_prefix` is set to ``None``.
es_es: Si ``NULL``, :data:`sys.pycache_prefix` se establece en ``None``.
sv: Om ``NULL``, sätts :data:`sys.pycache_prefix` till ``None``.

source: Quiet mode. If greater than ``0``, don't display the copyright and version at Python startup in interactive mode.
es_es: Modo silencioso. Si es mayor que ``0``, no mostrar el copyright y la versión al iniciar Python en modo interactivo.
sv: Tyst läge. Om större än ``0``, visa inte copyright och version vid Python-start i interaktivt läge.

source: Incremented by the :option:`-q` command line option.
es_es: Incrementado por la opción de línea de comandos :option:`-q`.
sv: Ökas med kommandoradsalternativet :option:`-q`.

source: Value of the :option:`-c` command line option.
es_es: Valor de la opción de línea de comandos :option:`-c`.
sv: Värde för kommandoradsalternativet :option:`-c`.

source: Used by :c:func:`Py_RunMain`.
es_es: Utilizado por :c:func:`Py_RunMain`.
sv: Används av :c:func:`Py_RunMain`.

source: Filename passed on the command line: trailing command line argument without :option:`-c` or :option:`-m`. It is used by the :c:func:`Py_RunMain` function.
es_es: Nombre de archivo pasado en la línea de comandos: argumento final de la línea de comandos sin :option:`-c` o :option:`-m`. Lo utiliza la función :c:func:`Py_RunMain`.
sv: Filnamn som skickas på kommandoraden: efterföljande argument på kommandoraden utan :option:`-c` eller :option:`-m`. Den används av funktionen :c:func:`Py_RunMain`.

source: For example, it is set to ``script.py`` by the ``python3 script.py arg`` command line.
es_es: Por ejemplo, se establece en ``script.py`` mediante la línea de comandos ``python3 script.py arg``.
sv: Den ställs till exempel in på ``cript.py`` med kommandoraden ``python3 script.py arg``.

source: See also the :c:member:`PyConfig.skip_source_first_line` option.
es_es: Ver también la opción :c:member:`PyConfig.skip_source_first_line`.
sv: Se även alternativet :c:member:`PyConfig.skip_source_first_line`.

source: Value of the :option:`-m` command line option.
es_es: Valor de la opción de línea de comandos :option:`-m`.
sv: Värde för kommandoradsalternativet :option:`-m`.

source: ``package.module`` path to module that should be imported before ``site.py`` is run.
sv: ``package.module`` sökväg till modul som ska importeras innan ``site.py`` körs.

source: Set by the :option:`-X presite=package.module <-X>` command-line option and the :envvar:`PYTHON_PRESITE` environment variable. The command-line option takes precedence.
sv: Ställs in med kommandoradsalternativet :option:`-X presite=package.module <-X>` och miljövariabeln :envvar:`PYTHON_PRESITE`. Kommandoradsalternativet har företräde.

source: Show total reference count at exit (excluding :term:`immortal` objects)?
sv: Visa totalt antal referenser vid utgången (exklusive :term:`immortal`-objekt)?

source: Set to ``1`` by :option:`-X showrefcount <-X>` command line option.
es_es: Se establece en ``1`` mediante la opción de línea de comandos :option:`-X showrefcount <-X>`.
sv: Sätts till ``1`` av :option:`-X showrefcount <-X>` kommandoradsalternativ.

source: Needs a :ref:`debug build of Python <debug-build>` (the ``Py_REF_DEBUG`` macro must be defined).
sv: Kräver en :ref:`debug-byggnad av Python <debug-build>` (makrot ``Py_REF_DEBUG`` måste vara definierat).

source: Import the :mod:`site` module at startup?
es_es: ¿Importar el módulo :mod:`site` al inicio?
sv: Importera modulen :mod:`site` vid uppstart?

source: If equal to zero, disable the import of the module site and the site-dependent manipulations of :data:`sys.path` that it entails.
es_es: Si es igual a cero, desactiva la importación del sitio del módulo y las manipulaciones dependientes del sitio de :data:`sys.path` que conlleva.
sv: Om värdet är noll inaktiveras importen av modulens webbplats och de webbplatsberoende manipulationerna av :data:`sys.path` som den medför.

source: Also disable these manipulations if the :mod:`site` module is explicitly imported later (call :func:`site.main` if you want them to be triggered).
es_es: Desactive también estas manipulaciones si el módulo :mod:`site` se importa explícitamente más tarde (llame a :func:`site.main` si desea que se activen).
sv: Inaktivera även dessa manipulationer om modulen :mod:`site` uttryckligen importeras senare (anropa :func:`site.main` om du vill att de ska utlösas).

source: Set to ``0`` by the :option:`-S` command line option.
es_es: Establecido en ``0`` mediante la opción de línea de comandos :option:`-S`.
sv: Sätts till ``0`` med kommandoradsalternativet :option:`-S`.

source: :data:`sys.flags.no_site <sys.flags>` is set to the inverted value of :c:member:`~PyConfig.site_import`.
es_es: :data:`sys.flags.no_site <sys.flags>` se establece en el valor invertido de :c:member:`~PyConfig.site_import`.
sv: :data:`sys.flags.no_site <sys.flags>` är satt till det inverterade värdet av :c:member:`~PyConfig.site_import`.

source: If non-zero, skip the first line of the :c:member:`PyConfig.run_filename` source.
es_es: Si es distinto de cero, omite la primera línea de la fuente :c:member:`PyConfig.run_filename`.
sv: Om värdet är annat än noll, hoppa över första raden i källan :c:member:`PyConfig.run_filename`.

source: It allows the usage of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
es_es: Permite el uso de formas no-Unix de ``#!cmd``. Esto está pensado sólo para un hack específico de DOS.
sv: Det gör det möjligt att använda icke-Unix-former av ``#!cmd``. Detta är endast avsett för ett DOS-specifikt hack.

source: Set to ``1`` by the :option:`-x` command line option.
es_es: Establecido en ``1`` mediante la opción de línea de comandos :option:`-x`.
sv: Sätts till ``1`` med kommandoradsalternativet :option:`-x`.

source: Encoding and encoding errors of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` (but :data:`sys.stderr` always uses ``"backslashreplace"`` error handler).
es_es: Codificación y errores de codificación de :data:`sys.stdin`, :data:`sys.stdout` y :data:`sys.stderr` (pero :data:`sys.stderr` siempre utiliza el gestor de errores ``"backslashreplace"`` ).
sv: Kodnings- och kodningsfel i :data:`sys.stdin`, :data:`sys.stdout` och :data:`sys.stderr` (men :data:`sys.stderr` använder alltid felhanteraren ``"backslashreplace"``).

source: Use the :envvar:`PYTHONIOENCODING` environment variable if it is non-empty.
es_es: Utilice la variable de entorno :envvar:`PYTHONIOENCODING` si no está vacía.
sv: Använd miljövariabeln :envvar:`PYTHONIOENCODING` om den inte är tom.

source: Default encoding:
es_es: Codificación por defecto:
sv: Standardkodning:

source: ``"UTF-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
es_es: ``"UTF-8"`` si :c:member:`PyPreConfig.utf8_mode` es distinto de cero.
sv: ``"UTF-8"`` om :c:member:`PyPreConfig.utf8_mode` inte är noll.

source: Otherwise, use the :term:`locale encoding`.
es_es: En caso contrario, utilice :term:`locale encoding`.
sv: I annat fall används :term:`locale encoding`.

source: Default error handler:
es_es: Gestor de errores por defecto:
sv: Standard felhanterare:

source: On Windows: use ``"surrogateescape"``.
es_es: En Windows: utilice ``"surrogateescape"``.
sv: I Windows: använd ``"surrogateescape"``.

source: ``"surrogateescape"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero, or if the LC_CTYPE locale is "C" or "POSIX".
es_es: ``"surrogateescape"`` si :c:member:`PyPreConfig.utf8_mode` es distinto de cero, o si la configuración regional LC_CTYPE es "C" o "POSIX".
sv: ``"surrogateescape"`` om :c:member:`PyPreConfig.utf8_mode` är icke-noll, eller om LC_CTYPE locale är "C" eller "POSIX".

source: ``"strict"`` otherwise.
es_es: ``"strict"`` de lo contrario.
sv: ``"strikt"`` annars.

source: See also :c:member:`PyConfig.legacy_windows_stdio`.
sv: Se även :c:member:`PyConfig.legacy_windows_stdio`.

source: Enable tracemalloc?
es_es: ¿Habilitar tracemalloc?
sv: Aktivera tracemalloc?

source: If non-zero, call :func:`tracemalloc.start` at startup.
es_es: Si no es cero, llame a :func:`tracemalloc.start` al inicio.
sv: Om ej noll, anropa :func:`tracemalloc.start` vid uppstart.

source: Set by :option:`-X tracemalloc=N <-X>` command line option and by the :envvar:`PYTHONTRACEMALLOC` environment variable.
es_es: Se establece mediante la opción de línea de comandos :option:`-X tracemalloc=N <-X>` y mediante la variable de entorno :envvar:`PYTHONTRACEMALLOC`.
sv: Ställs in av :option:`-X tracemalloc=N <-X>` kommandoradsalternativ och av miljövariabeln :envvar:`PYTHONTRACEMALLOC`.

source: Enable the Linux ``perf`` profiler support?
sv: Aktivera stöd för Linux-profiler ``perf``?

source: If equals to ``1``, enable support for the Linux ``perf`` profiler.
sv: Om lika med ``1``, aktiveras stöd för Linux-profileraren ``perf``.

source: If equals to ``2``, enable support for the Linux ``perf`` profiler with DWARF JIT support.
sv: Om lika med ``2``, aktivera stöd för Linux ``perf`` profiler med DWARF JIT-stöd.

source: Set to ``1`` by :option:`-X perf <-X>` command-line option and the :envvar:`PYTHONPERFSUPPORT` environment variable.
sv: Sätts till ``1`` av :option:`-X perf <-X>` kommandoradsalternativ och miljövariabeln :envvar:`PYTHONPERFSUPPORT`.

source: Set to ``2`` by the :option:`-X perf_jit <-X>` command-line option and the :envvar:`PYTHON_PERF_JIT_SUPPORT` environment variable.
sv: Sätts till ``2`` med kommandoradsalternativet :option:`-X perf_jit <-X>` och miljövariabeln :envvar:`PYTHON_PERF_JIT_SUPPORT`.

source: See :ref:`perf_profiling` for more information.
sv: Se :ref:`perf_profiling` för mer information.

source: Directory of the Python standard library.
sv: Katalog över Pythons standardbibliotek.

source: Use :ref:`environment variables <using-on-envvars>`?
es_es: Usar :ref:`variables de entorno <using-on-envvars>`?
sv: Använd :ref:`miljövariabler <using-on-envvars>`?

source: If equals to zero, ignore the :ref:`environment variables <using-on-envvars>`.
es_es: Si es igual a cero, ignora las ::ref:`environment variables <using-on-envvars>`.
sv: Om den är lika med noll ignoreras :ref:`miljövariabler <using-on-envvars>`.

source: Set to ``0`` by the :option:`-E` environment variable.
es_es: Establecido en ``0`` por la variable de entorno :option:`-E`.
sv: Sätts till ``0`` av miljövariabeln :option:`-E`.

source: If non-zero, ``stdout`` and ``stderr`` will be redirected to the system log.
sv: Om värdet inte är noll kommer ``stdout`` och ``stderr`` att omdirigeras till systemloggen.

source: Only available on macOS 10.12 and later, and on iOS.
sv: Endast tillgängligt på macOS 10.12 och senare, och på iOS.

source: Default: ``0`` (don't use the system log) on macOS; ``1`` on iOS (use the system log).
sv: Standard: ``0`` (använd inte systemloggen) på macOS; ``1`` på iOS (använd systemloggen).

source: If non-zero, add the user site directory to :data:`sys.path`.
es_es: Si es distinto de cero, añade el directorio del sitio del usuario a :data:`sys.path`.
sv: Om värdet är annat än noll läggs användarens webbplatskatalog till i :data:`sys.path`.

source: Set to ``0`` by the :option:`-s` and :option:`-I` command line options.
es_es: Se establece en ``0`` mediante las opciones de línea de comandos :option:`-s` y :option:`-I`.
sv: Sätts till ``0`` med kommandoradsalternativen :option:`-s` och :option:`-I`.

source: Set to ``0`` by the :envvar:`PYTHONNOUSERSITE` environment variable.
es_es: Establecido en ``0`` por la variable de entorno :envvar:`PYTHONNOUSERSITE`.
sv: Sätts till ``0`` av miljövariabeln :envvar:`PYTHONNOUSERSITE`.

source: Verbose mode. If greater than ``0``, print a message each time a module is imported, showing the place (filename or built-in module) from which it is loaded.
es_es: Modo detallado. Si es mayor que ``0``, imprime un mensaje cada vez que se importa un módulo, mostrando el lugar (nombre de archivo o módulo incorporado) desde el que se carga.
sv: Verbose-läge. Om större än ``0``, skriv ut ett meddelande varje gång en modul importeras, som visar platsen (filnamn eller inbyggd modul) från vilken den laddas.

source: If greater than or equal to ``2``, print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit.
es_es: Si es mayor o igual que ``2``, imprime un mensaje por cada archivo que se comprueba al buscar un módulo. También proporciona información sobre la limpieza del módulo al salir.
sv: Om större än eller lika med ``2``, skrivs ett meddelande ut för varje fil som kontrolleras vid sökning efter en modul. Ger också information om modulrensning vid avslutning.

source: Incremented by the :option:`-v` command line option.
es_es: Incrementado por la opción de línea de comandos :option:`-v`.
sv: Ökas med kommandoradsalternativet :option:`-v`.

source: Set by the :envvar:`PYTHONVERBOSE` environment variable value.
es_es: Establecido por el valor de la variable de entorno :envvar:`PYTHONVERBOSE`.
sv: Ställs in av värdet för miljövariabeln :envvar:`PYTHONVERBOSE`.

source: Options of the :mod:`warnings` module to build warnings filters, lowest to highest priority: :data:`sys.warnoptions`.
es_es: Opciones del módulo :mod:`warnings` para construir filtros de avisos, de menor a mayor prioridad: :data:`sys.warnoptions`.
sv: Alternativ för modulen :mod:`warnings` för att bygga varningsfilter, från lägsta till högsta prioritet: :data:`sys.warnoptions`.

source: The :mod:`warnings` module adds :data:`sys.warnoptions` in the reverse order: the last :c:member:`PyConfig.warnoptions` item becomes the first item of :data:`warnings.filters` which is checked first (highest priority).
es_es: El módulo :mod:`warnings` añade :data:`sys.warnoptions` en orden inverso: el último elemento de :c:member:`PyConfig.warnoptions` se convierte en el primer elemento de :data:`warnings.filters`, que se comprueba en primer lugar (máxima prioridad).
sv: Modulen :mod:`warnings` lägger till :data:`sys.warnoptions` i omvänd ordning: det sista :c:member:`PyConfig.warnoptions`-objektet blir det första objektet i :data:`warnings.filters` som kontrolleras först (högsta prioritet).

source: The :option:`-W` command line options adds its value to :c:member:`~PyConfig.warnoptions`, it can be used multiple times.
es_es: La opción de línea de comandos :option:`-W` añade su valor a :c:member:`~PyConfig.warnoptions`, puede utilizarse varias veces.
sv: Kommandoradsalternativet :option:`-W` lägger till sitt värde i :c:member:`~PyConfig.warnoptions`, det kan användas flera gånger.

source: The :envvar:`PYTHONWARNINGS` environment variable can also be used to add warning options. Multiple options can be specified, separated by commas (``,``).
es_es: La variable de entorno :envvar:`PYTHONWARNINGS` también puede utilizarse para añadir opciones de advertencia. Se pueden especificar varias opciones, separadas por comas (``,``).
sv: Miljövariabeln :envvar:`PYTHONWARNINGS` kan också användas för att lägga till varningsalternativ. Flera alternativ kan anges, åtskilda med kommatecken (``,``).

source: If equal to ``0``, Python won't try to write ``.pyc`` files on the import of source modules.
es_es: Si es igual a ``0``, Python no intentará escribir archivos ``.pyc`` en la importación de módulos fuente.
sv: Om lika med ``0``, kommer Python inte att försöka skriva ``.pyc``-filer vid import av källmoduler.

source: Set to ``0`` by the :option:`-B` command line option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable.
es_es: Se establece en ``0`` mediante la opción de línea de comandos :option:`-B` y la variable de entorno :envvar:`PYTHONDONTWRITEBYTECODE`.
sv: Sätts till ``0`` med kommandoradsalternativet :option:`-B` och miljövariabeln :envvar:`PYTHONDONTWRITEBYTECODE`.

source: :data:`sys.dont_write_bytecode` is initialized to the inverted value of :c:member:`~PyConfig.write_bytecode`.
es_es: :data:`sys.dont_write_bytecode` se inicializa con el valor invertido de :c:member:`~PyConfig.write_bytecode`.
sv: :data:`sys.dont_write_bytecode` initialiseras till det inverterade värdet av :c:member:`~PyConfig.write_bytecode`.

source: Values of the :option:`-X` command line options: :data:`sys._xoptions`.
es_es: Valores de las opciones de la línea de comandos :option:`-X`: :data:`sys._xoptions`.
sv: Värden för kommandoradsalternativen :option:`-X`: :data:`sys._xoptions`.

source: If non-zero, write performance statistics at Python exit.
sv: Om ej noll, skriv prestandastatistik när Python avslutas.

source: Need a special build with the ``Py_STATS`` macro: see :option:`--enable-pystats`.
sv: Behöver en speciell konstruktion med makrot ``Py_STATS``: se :option:`--enable-pystats`.

source: If :c:member:`~PyConfig.parse_argv` is non-zero, :c:member:`~PyConfig.argv` arguments are parsed the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and Python arguments are stripped from :c:member:`~PyConfig.argv`.
es_es: Si :c:member:`~PyConfig.parse_argv` es distinto de cero, los argumentos de :c:member:`~PyConfig.argv` se analizan de la misma forma que Python analiza los argumentos de :ref:`línea de comandos <using-on-cmdline>`, y los argumentos de Python se eliminan de :c:member:`~PyConfig.argv`.
sv: Om :c:member:`~PyConfig.parse_argv` inte är noll, analyseras :c:member:`~PyConfig.argv`-argument på samma sätt som vanliga Python analyserar :ref:`kommandoradsargument <using-on-cmdline>`, och Python-argument tas bort från :c:member:`~PyConfig.argv`.

source: The :c:member:`~PyConfig.xoptions` options are parsed to set other options: see the :option:`-X` command line option.
es_es: Las opciones de :c:member:`~PyConfig.xoptions` se analizan para establecer otras opciones: consulte la opción de línea de comandos :option:`-X`.
sv: Alternativen :c:member:`~PyConfig.xoptions` analyseras för att ange andra alternativ: se kommandoradsalternativet :option:`-X`.

source: The ``show_alloc_count`` field has been removed.
es_es: Se ha eliminado el campo ``show_alloc_count``.
sv: Fältet ``show_alloc_count`` har tagits bort.

source: Initialization with PyConfig
es_es: Inicialización con PyConfig
sv: Initialisering med PyConfig

source: Initializing the interpreter from a populated configuration struct is handled by calling :c:func:`Py_InitializeFromConfig`.
sv: Initialisering av tolken från en ifylld konfigurationsstruktur hanteras genom att anropa :c:func:`Py_InitializeFromConfig`.

source: If :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` are used, they must be set or called after Python preinitialization and before the Python initialization. If Python is initialized multiple times, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` must be called before each Python initialization.
es_es: Si se usan :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` o :c:func:`PyImport_ExtendInittab`, se deben ser fijar o llamar después de la preinicialización de Python y antes de la inicialización de Python. Si Python se inicializa varias veces, :c:func:`PyImport_AppendInittab` o :c:func:`PyImport_ExtendInittab` deben llamarse antes de cada inicialización de Python.
sv: Om :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` eller :c:func:`PyImport_ExtendInittab` används, måste de anges eller anropas efter Pythons förinitialisering och före Pythons initialisering. Om Python initialiseras flera gånger måste :c:func:`PyImport_AppendInittab` eller :c:func:`PyImport_ExtendInittab` anropas före varje Python-initialisering.

source: The current configuration (``PyConfig`` type) is stored in ``PyInterpreterState.config``.
es_es: La configuración actual (tipo``PyConfig`` ) se almacena en ``PyInterpreterState.config``.
sv: Den aktuella konfigurationen (av typen ``PyConfig``) lagras i ``PyInterpreterState.config``.

source: Example setting the program name::
es_es: Ejemplo de configuración del nombre del programa::
sv: Exempel på inställning av programnamn::

source: void init_python(void) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Set the program name. Implicitly preinitialize Python. */ status = PyConfig_SetString(&config, &config.program_name, L"/path/to/my_program"); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return; exception: PyConfig_Clear(&config); Py_ExitStatusException(status); }
es_es: void init_python(void) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Establecer el nombre del programa. Preinicializar implícitamente Python. */ status = PyConfig_SetString(&config, &config.program_name, L"/path/to/my_program"); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return; exception: PyConfig_Clear(&config); Py_ExitStatusException(status); }
sv: void init_python(void) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Ställ in programnamnet. Förinitialisera Python implicit. */ status = PyConfig_SetString(&config, &config.program_name, L"/stig/till/mitt_program"); if (PyStatus_Exception(status)) { goto undantag; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { gå till undantaget; } PyConfig_Clear(&config); returnera; undantag: PyConfig_Clear(&config); Py_ExitStatusException(status); }

source: More complete example modifying the default configuration, read the configuration, and then override some parameters. Note that since 3.11, many parameters are not calculated until initialization, and so values cannot be read from the configuration structure. Any values set before initialize is called will be left unchanged by initialization::
es_es: Ejemplo más completo modificando la configuración por defecto, leer la configuración, y luego anular algunos parámetros. Tenga en cuenta que desde 3.11, muchos parámetros no se calculan hasta la inicialización, por lo que los valores no se pueden leer de la estructura de configuración. Cualquier valor establecido antes de llamar a initialize será dejado sin cambios por initialization::
sv: Ett mer komplett exempel på hur man ändrar standardkonfigurationen, läser konfigurationen och sedan åsidosätter vissa parametrar. Observera att sedan 3.11 beräknas många parametrar inte förrän vid initialiseringen, och därför kan värdena inte läsas från konfigurationsstrukturen. Alla värden som ställts in innan initialize anropas kommer att lämnas oförändrade av initialization::
