Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: es_es, sv

source: PyStatus init_python(const char *program_name) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Set the program name before reading the configuration (decode byte string from the locale encoding). Implicitly preinitialize Python. */ status = PyConfig_SetBytesString(&config, &config.program_name, program_name); if (PyStatus_Exception(status)) { goto done; } /* Read all configuration at once */ status = PyConfig_Read(&config); if (PyStatus_Exception(status)) { goto done; } /* Specify sys.path explicitly */ /* If you want to modify the default set of paths, finish initialization first and then use PySys_GetObject("path") */ config.module_search_paths_set = 1; status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/stdlib"); if (PyStatus_Exception(status)) { goto done; } status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/more/modules"); if (PyStatus_Exception(status)) { goto done; } /* Override executable computed by PyConfig_Read() */ status = PyConfig_SetString(&config, &config.executable, L"/path/to/my_executable"); if (PyStatus_Exception(status)) { goto done; } status = Py_InitializeFromConfig(&config); done: PyConfig_Clear(&config); return status; }
es_es: PyStatus init_python(const char *program_name) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /*Establecer el nombre del programa antes de leer la configuración (decodificar la cadena de bytes de la codificación local). Implicitly preinitialize Python. */ status = PyConfig_SetBytesString(&config, &config.program_name, program_name); if (PyStatus_Exception(status)) { goto done; } /* Leer toda la configuración a la vez */ status = PyConfig_Read(&config); if (PyStatus_Exception(status)) { goto done; } /* Especifique sys.path explícitamente*/ /* Si desea modificar el conjunto predeterminado de rutas, finalice inicialización primero y luego use PySys_GetObject("path") */ config.module_search_paths_set = 1; status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/stdlib"); if (PyStatus_Exception(status)) { goto done; } status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/more/modules"); if (PyStatus_Exception(status)) { goto done; } /* Override executable computed by PyConfig_Read() */ status = PyConfig_SetString(&config, &config.executable, L"/path/to/my_executable"); if (PyStatus_Exception(status)) { goto done; } status = Py_InitializeFromConfig(&config); done: PyConfig_Clear(&config); return status; }
sv: PyStatus init_python(const char *programnamn) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); /* Ställ in programnamnet innan du läser konfigurationen (avkoda byte-strängen från den lokala kodningen). Förinitialiserar Python implicit. */ status = PyConfig_SetBytesString(&config, &config.program_name, program_namn); if (PyStatus_Exception(status)) { goto done; } /* Läs all konfiguration på en gång */ status = PyConfig_Read(&config); if (PyStatus_Exception(status)) { goto done; } /* Ange sys.path uttryckligen */ /* Om du vill ändra standarduppsättningen av sökvägar, avsluta initialiseringen först och använd sedan PySys_GetObject("path") */ config.module_search_paths_set = 1; status = PyWideStringList_Append(&config.module_search_paths, L"/path/to/stdlib"); if (PyStatus_Exception(status)) { goto done; } status = PyWideStringList_Append(&config.module_search_paths, L"/väg/till/mera/moduler"); if (PyStatus_Exception(status)) { goto done; } /* Åsidosätt den körbara filen som beräknas av PyConfig_Read() */ status = PyConfig_SetString(&config, &config.körbar, L"/stig/till/mitt_körbara"); if (PyStatus_Exception(status)) { goto done; } status = Py_InitializeFromConfig(&config); gjort: PyConfig_Clear(&config); returnera status; }

source: Isolated Configuration
es_es: Configuración aislada
sv: Isolerad konfiguration

source: :c:func:`PyPreConfig_InitIsolatedConfig` and :c:func:`PyConfig_InitIsolatedConfig` functions create a configuration to isolate Python from the system. For example, to embed Python into an application.
es_es: Las funciones :c:func:`PyPreConfig_InitIsolatedConfig` y :c:func:`PyConfig_InitIsolatedConfig` crean una configuración para aislar Python del sistema. Por ejemplo, para incrustar Python en una aplicación.
sv: funktionerna :c:func:`PyPreConfig_InitIsolatedConfig` och :c:func:`PyConfig_InitIsolatedConfig` skapar en konfiguration för att isolera Python från systemet. Till exempel för att bädda in Python i en applikation.

source: This configuration ignores global configuration variables, environment variables, command line arguments (:c:member:`PyConfig.argv` is not parsed) and user site directory. The C standard streams (ex: ``stdout``) and the LC_CTYPE locale are left unchanged. Signal handlers are not installed.
es_es: Esta configuración ignora las variables de configuración global, las variables de entorno, los argumentos de línea de comandos (:c:member:`PyConfig.argv` no se analiza) y el directorio del sitio de usuario. Los flujos estándar C (ej: ``stdout``) y la configuración regional LC_CTYPE no se modifican. Los manejadores de señales no están instalados.
sv: Denna konfiguration ignorerar globala konfigurationsvariabler, miljövariabler, kommandoradsargument (:c:member:`PyConfig.argv` tolkas inte) och användarens webbplatskatalog. C-standardströmmarna (t.ex. ``stdout``) och LC_CTYPE-lokalen lämnas oförändrade. Signalhanterare är inte installerade.

source: Configuration files are still used with this configuration to determine paths that are unspecified. Ensure :c:member:`PyConfig.home` is specified to avoid computing the default path configuration.
es_es: Los archivos de configuración se siguen utilizando con esta configuración para determinar las rutas que no se especifican. Asegúrese de que se especifica :c:member:`PyConfig.home` para evitar calcular la configuración de rutas por defecto.
sv: Konfigurationsfiler används fortfarande med den här konfigurationen för att bestämma sökvägar som inte är specificerade. Se till att :c:member:`PyConfig.home` anges för att undvika att beräkna standardsökvägskonfigurationen.

source: Python Configuration
es_es: Configuración de Python
sv: Python-konfiguration

source: :c:func:`PyPreConfig_InitPythonConfig` and :c:func:`PyConfig_InitPythonConfig` functions create a configuration to build a customized Python which behaves as the regular Python.
es_es: Las funciones :c:func:`PyPreConfig_InitPythonConfig` y :c:func:`PyConfig_InitPythonConfig` crean una configuración para construir un Python personalizado que se comporta como el Python normal.
sv: funktionerna :c:func:`PyPreConfig_InitPythonConfig` och :c:func:`PyConfig_InitPythonConfig` skapar en konfiguration för att bygga ett anpassat Python som beter sig som det vanliga Python.

source: Environments variables and command line arguments are used to configure Python, whereas global configuration variables are ignored.
es_es: Las variables de entorno y los argumentos de línea de comandos se utilizan para configurar Python, mientras que las variables de configuración global se ignoran.
sv: Miljövariabler och kommandoradsargument används för att konfigurera Python, medan globala konfigurationsvariabler ignoreras.

source: This function enables C locale coercion (:pep:`538`) and :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) depending on the LC_CTYPE locale, :envvar:`PYTHONUTF8` and :envvar:`PYTHONCOERCECLOCALE` environment variables.
es_es: Esta función habilita la coerción de la localización C (:pep:`538`) y :ref:`Modo Python UTF-8 <utf8-mode>` (:pep:`540`) dependiendo de las variables de entorno LC_CTYPE locale, :envvar:`PYTHONUTF8` y :envvar:`PYTHONCOERCECLOCALE`.
sv: Denna funktion aktiverar C locale coercion (:pep:`538`) och :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) beroende på LC_CTYPE locale, :envvar:`PYTHONUTF8` och :envvar:`PYTHONCOERCECLOCALE` miljövariabler.

source: Python Path Configuration
es_es: Configuración de la ruta de Python
sv: Konfiguration av Python-sökväg

source: :c:type:`PyConfig` contains multiple fields for the path configuration:
es_es: :c:type:`PyConfig` contiene varios campos para la configuración de la ruta:
sv: :c:type:`PyConfig` innehåller flera fält för sökvägskonfigurationen:

source: Path configuration inputs:
es_es: Entradas de configuración de ruta:
sv: Ingångar för konfiguration av sökväg:

source: :c:member:`PyConfig.program_name`
sv: :c:member:`PyConfig.program_namn`

source: current working directory: to get absolute paths
es_es: directorio de trabajo actual: para obtener rutas absolutas
sv: aktuell arbetskatalog: för att få absoluta sökvägar

source: ``PATH`` environment variable to get the program full path (from :c:member:`PyConfig.program_name`)
es_es: variable de entorno ``PATH`` para obtener la ruta completa del programa (de :c:member:`PyConfig.program_name`)
sv: ``PATH`` miljövariabel för att få den fullständiga sökvägen till programmet (från :c:member:`PyConfig.program_name`)

source: ``__PYVENV_LAUNCHER__`` environment variable
es_es: ``__PYVENV_LAUNCHER__`` variable de entorno
sv: miljövariabeln ``PYVENV_LAUNCHER__``

source: (Windows only) Application paths in the registry under "Software\Python\PythonCore\X.Y\PythonPath" of HKEY_CURRENT_USER and HKEY_LOCAL_MACHINE (where X.Y is the Python version).
es_es: (Sólo Windows) Rutas de aplicación en el registro bajo "Software\Python\PythonCore\X.Y\PythonPath" de HKEY_CURRENT_USER y HKEY_LOCAL_MACHINE (donde X.Y es la versión de Python).
sv: (Endast Windows) Programsökvägar i registret under "Software\Python\PythonCore\X.Y\PythonPath" i HKEY_CURRENT_USER och HKEY_LOCAL_MACHINE (där X.Y är Python-versionen).

source: Path configuration output fields:
es_es: Campos de salida de configuración de ruta:
sv: Utmatningsfält för konfiguration av sökväg:

source: :c:member:`PyConfig.executable`
sv: :c:member:`PyConfig.körbar`

source: If at least one "output field" is not set, Python calculates the path configuration to fill unset fields. If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:member:`~PyConfig.module_search_paths` is overridden and :c:member:`~PyConfig.module_search_paths_set` is set to ``1``.
es_es: Si al menos un "campo de salida" no está establecido, Python calcula la configuración de la ruta para rellenar los campos no establecidos. Si :c:member:`~PyConfig.module_search_paths_set` es igual a ``0``, :c:member:`~PyConfig.module_search_paths` se anula y :c:member:`~PyConfig.module_search_paths_set` se establece en ``1``.
sv: Om minst ett "utdatafält" inte är inställt, beräknar Python sökvägskonfigurationen för att fylla oinställda fält. Om :c:member:`~PyConfig.module_search_paths_set` är lika med ``0``, åsidosätts :c:member:`~PyConfig.module_search_paths` och :c:member:`~PyConfig.module_search_paths_set` sätts till ``1``.

source: It is possible to completely ignore the function calculating the default path configuration by setting explicitly all path configuration output fields listed above. A string is considered as set even if it is non-empty. ``module_search_paths`` is considered as set if ``module_search_paths_set`` is set to ``1``. In this case, ``module_search_paths`` will be used without modification.
es_es: Es posible ignorar por completo la función que calcula la configuración por defecto de la ruta estableciendo explícitamente todos los campos de salida de configuración de ruta enumerados anteriormente. Una cadena se considera establecida incluso si no está vacía. ``module_search_paths`` se considera establecida si ``module_search_paths_set`` se establece en ``1``. En este caso, ``module_search_paths`` se utilizará sin modificación.
sv: Det är möjligt att helt ignorera funktionen som beräknar standardsökvägskonfigurationen genom att uttryckligen ange alla utdatafält för sökvägskonfigurationen som anges ovan. En sträng anses vara inställd även om den inte är tom. ``module_search_paths`` betraktas som set om ``module_search_paths_set`` är satt till ``1``. I detta fall kommer ``module_search_paths`` att användas utan modifiering.

source: Set :c:member:`~PyConfig.pathconfig_warnings` to ``0`` to suppress warnings when calculating the path configuration (Unix only, Windows does not log any warning).
es_es: Fijar :c:member:`~PyConfig.pathconfig_warnings` en ``0`` para suprimir las advertencias al calcular la configuración de la ruta (sólo Unix, Windows no registra ninguna advertencia).
sv: Sätt :c:member:`~PyConfig.pathconfig_warnings` till ``0`` för att undertrycka varningar vid beräkning av sökvägskonfigurationen (endast Unix, Windows loggar inte någon varning).

source: If :c:member:`~PyConfig.base_prefix` or :c:member:`~PyConfig.base_exec_prefix` fields are not set, they inherit their value from :c:member:`~PyConfig.prefix` and :c:member:`~PyConfig.exec_prefix` respectively.
es_es: Si los campos :c:member:`~PyConfig.base_prefix` o :c:member:`~PyConfig.base_exec_prefix` no están configurados, heredan su valor de :c:member:`~PyConfig.prefix` y :c:member:`~PyConfig.exec_prefix` respectivamente.
sv: Om fälten :c:member:`~PyConfig.base_prefix` eller :c:member:`~PyConfig.base_exec_prefix` inte har angetts ärver de sina värden från :c:member:`~PyConfig.prefix` respektive :c:member:`~PyConfig.exec_prefix`.

source: :c:func:`Py_RunMain` and :c:func:`Py_Main` modify :data:`sys.path`:
es_es: :c:func:`Py_RunMain` y :c:func:`Py_Main` modifican :data:`sys.path`:
sv: :c:func:`Py_RunMain` och :c:func:`Py_Main` modifierar :data:`sys.path`:

source: If :c:member:`~PyConfig.run_filename` is set and is a directory which contains a ``__main__.py`` script, prepend :c:member:`~PyConfig.run_filename` to :data:`sys.path`.
es_es: Si :c:member:`~PyConfig.run_filename` está configurado y es un directorio que contiene un script ``__main__.py``, anteponer :c:member:`~PyConfig.run_filename` a :data:`sys.path`.
sv: Om :c:member:`~PyConfig.run_filename` är inställd och är en katalog som innehåller ett ``__main__.py``-skript, prepend :c:member:`~PyConfig.run_filename` till :data:`sys.path`.

source: If :c:member:`~PyConfig.isolated` is zero:
es_es: Si :c:member:`~PyConfig.isolated` es cero:
sv: Om :c:member:`~PyConfig.isolated` är noll:

source: If :c:member:`~PyConfig.run_module` is set, prepend the current directory to :data:`sys.path`. Do nothing if the current directory cannot be read.
es_es: Si se establece :c:member:`~PyConfig.run_module`, antepone el directorio actual a :data:`sys.path`. No hacer nada si no se puede leer el directorio actual.
sv: Om :c:member:`~PyConfig.run_module` är inställd, lägg till den aktuella katalogen i :data:`sys.path`. Gör ingenting om den aktuella katalogen inte kan läsas.

source: If :c:member:`~PyConfig.run_filename` is set, prepend the directory of the filename to :data:`sys.path`.
es_es: Si se establece :c:member:`~PyConfig.run_filename`, anteponer el directorio del nombre de archivo a :data:`sys.path`.
sv: Om :c:member:`~PyConfig.run_filename` är inställt, lägg till katalogen för filnamnet i :data:`sys.path`.

source: Otherwise, prepend an empty string to :data:`sys.path`.
es_es: En caso contrario, añade una cadena vacía a :data:`sys.path`.
sv: I annat fall läggs en tom sträng till :data:`sys.path`.

source: If :c:member:`~PyConfig.site_import` is non-zero, :data:`sys.path` can be modified by the :mod:`site` module. If :c:member:`~PyConfig.user_site_directory` is non-zero and the user's site-package directory exists, the :mod:`site` module appends the user's site-package directory to :data:`sys.path`.
es_es: Si :c:member:`~PyConfig.site_import` es distinto de cero, el módulo :mod:`site` puede modificar :data:`sys.path`. Si :c:member:`~PyConfig.user_site_directory` es distinto de cero y el directorio del paquete del sitio del usuario existe, el módulo :mod:`site` añade el directorio del paquete del sitio del usuario a :data:`sys.path`.
sv: Om :c:member:`~PyConfig.site_import` inte är noll, kan :data:`sys.path` ändras av modulen :mod:`site`. Om :c:member:`~PyConfig.user_site_directory` inte är noll och användarens katalog för site-paketet finns, lägger modulen :mod:`site` till användarens katalog för site-paketet till :data:`sys.path`.

source: The following configuration files are used by the path configuration:
es_es: La configuración de la ruta utiliza los siguientes archivos de configuración:
sv: Följande konfigurationsfiler används av sökvägskonfigurationen:

source: ``._pth`` file (ex: ``python._pth``)
es_es: ``._pth`` archivo (por ejemplo: ``python._pth``)
sv: filen ``._pth`` (t.ex. ``python._pth``)

source: ``pybuilddir.txt`` (Unix only)
es_es: ``pybuilddir.txt`` (sólo Unix)
sv: ``pybuilddir.txt`` (endast Unix)

source: If a ``._pth`` file is present:
es_es: Si existe un archivo ``._pth``:
sv: Om en ``._pth``-fil finns:

source: Set :c:member:`~PyConfig.isolated` to ``1``.
es_es: Configura :c:member:`~PyConfig.isolated` en ``1``.
sv: Sätt :c:member:`~PyConfig.isolated` till ``1``.

source: Set :c:member:`~PyConfig.use_environment` to ``0``.
es_es: Configura :c:member:`~PyConfig.use_environment` en ``0``.
sv: Sätt :c:member:`~PyConfig.use_environment` till ``0``.

source: Set :c:member:`~PyConfig.site_import` to ``0``.
es_es: Configura :c:member:`~PyConfig.site_import` en ``0``.
sv: Ställ in :c:member:`~PyConfig.site_import` till ``0``.

source: Set :c:member:`~PyConfig.safe_path` to ``1``.
es_es: Configura :c:member:`~PyConfig.safe_path` en ``1``.
sv: Sätt :c:member:`~PyConfig.safe_path` till ``1``.

source: If :c:member:`~PyConfig.home` is not set and a ``pyvenv.cfg`` file is present in the same directory as :c:member:`~PyConfig.executable`, or its parent, :c:member:`~PyConfig.prefix` and :c:member:`~PyConfig.exec_prefix` are set that location. When this happens, :c:member:`~PyConfig.base_prefix` and :c:member:`~PyConfig.base_exec_prefix` still keep their value, pointing to the base installation. See :ref:`sys-path-init-virtual-environments` for more information.
sv: Om :c:member:`~PyConfig.home` inte är inställd och en ``pyvenv.cfg``-fil finns i samma katalog som :c:member:`~PyConfig.executable`, eller dess överordnade, kommer :c:member:`~PyConfig.prefix` och :c:member:`~PyConfig.exec_prefix` att ställas in på den platsen. När detta händer behåller :c:member:`~PyConfig.base_prefix` och :c:member:`~PyConfig.base_exec_prefix` fortfarande sina värden och pekar på basinstallationen. Se :ref:`sys-path-init-virtual-environments` för mer information.

source: The ``__PYVENV_LAUNCHER__`` environment variable is used to set :c:member:`PyConfig.base_executable`.
sv: Miljövariabeln ``__PYVENV_LAUNCHER__`` används för att ställa in :c:member:`PyConfig.base_executable`.

source: :c:member:`~PyConfig.prefix`, and :c:member:`~PyConfig.exec_prefix`, are now set to the ``pyvenv.cfg`` directory. This was previously done by :mod:`site`, therefore affected by :option:`-S`.
sv: :c:member:`~PyConfig.prefix`, och :c:member:`~PyConfig.exec_prefix`, är nu inställda på katalogen ``pyvenv.cfg``. Detta gjordes tidigare av :mod:`site`, och påverkas därför av :option:`-S`.

source: Get the original command line arguments, before Python modified them.
es_es: Obtiene los argumentos originales de la línea de comandos, antes de que Python los modifique.
sv: Hämta de ursprungliga kommandoradsargumenten, innan Python ändrade dem.

source: See also :c:member:`PyConfig.orig_argv` member.
es_es: Ver también :c:member:`PyConfig.orig_argv` member.
sv: Se även :c:member:`PyConfig.orig_argv` member.

source: Delaying main module execution
sv: Fördröjning av exekvering av huvudmodul

source: In some embedding use cases, it may be desirable to separate interpreter initialization from the execution of the main module.
sv: I vissa inbäddningsfall kan det vara önskvärt att skilja initialiseringen av tolken från exekveringen av huvudmodulen.

source: This separation can be achieved by setting ``PyConfig.run_command`` to the empty string during initialization (to prevent the interpreter from dropping into the interactive prompt), and then subsequently executing the desired main module code using ``__main__.__dict__`` as the global namespace.
sv: Denna separation kan uppnås genom att sätta ``PyConfig.run_command`` till den tomma strängen under initialiseringen (för att förhindra att tolken hamnar i den interaktiva prompten) och sedan köra den önskade huvudmodulskoden med ``__main__.__dict__`` som globalt namnområde.

source: argv (in module sys)
sv: argv (i modul sys)

source: :pep:`587` "Python Initialization Configuration".
es_es: :pep:`587` "Configuración de inicialización de Python".

source: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`default memory allocators <default-memory-allocators>` with :ref:`debug hooks <pymem-debug-hooks>`.
es_es: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`default memory allocators <default-memory-allocators>` con :ref:`debug hooks <pymem-debug-hooks>`.

source: Command line arguments: :data:`sys.argv`.
es_es: Argumentos de la línea de comandos: :data:`sys.argv`.

source: Need a special build of Python with the ``Py_TRACE_REFS`` macro defined: see the :option:`configure --with-trace-refs option <--with-trace-refs>`.
es_es: Necesita una compilación especial de Python con la macro ``Py_TRACE_REFS`` definida: vea la :opción:`configure --with-trace-refs option <--with-trace-refs>`.

source: Python home directory.
es_es: Directorio personal de Python.

source: If :c:func:`Py_SetPythonHome` has been called, use its argument if it is not ``NULL``.
es_es: Si se ha llamado a :c:func:`Py_SetPythonHome`, utiliza su argumento si no es ``NULL``.

source: If non-zero, profile import time.
es_es: Si es distinto de cero, tiempo de importación del perfil.

source: Set the ``1`` by the :option:`-X importtime <-X>` option and the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable.
es_es: Establezca ``1`` mediante la opción :option:`-X importtime <-X>` y la variable de entorno :envvar:`PYTHONPROFILEIMPORTTIME`.

source: Need a :ref:`debug build of Python <debug-build>` (the ``Py_DEBUG`` macro must be defined).
es_es: Necesita una compilación :ref:`debug de Python <debug-build>` (la macro ``Py_DEBUG`` debe estar definida).

source: If :func:`Py_SetProgramName` has been called, use its argument.
es_es: Si se ha llamado a :func:`Py_SetProgramName`, utilice su argumento.

source: Set by the :option:`-X pycache_prefix=PATH <-X>` command line option and the :envvar:`PYTHONPYCACHEPREFIX` environment variable.
es_es: Se establece mediante la opción de línea de comandos :option:`-X pycache_prefix=PATH <-X>` y la variable de entorno :envvar:`PYTHONPYCACHEPREFIX`.

source: Show total reference count at exit (excluding immortal objects)?
es_es: ¿Mostrar el recuento total de referencias a la salida (excluyendo los objetos inmortales)?

source: Need a :ref:`debug build of Python <debug-build>` (the ``Py_REF_DEBUG`` macro must be defined).
es_es: Necesita una compilación :ref:`debug de Python <debug-build>` (la macro ``Py_REF_DEBUG`` debe estar definida).

source: If :c:func:`Py_SetStandardStreamEncoding` has been called, use its *error* and *errors* arguments if they are not ``NULL``.
es_es: Si se ha llamado a :c:func:`Py_SetStandardStreamEncoding`, utilice sus argumentos *error* y *errors* si no son ``NULL``.

source: Enable compatibility mode with the perf profiler?
es_es: ¿Habilitar el modo de compatibilidad con el perf profiler?

source: If non-zero, initialize the perf trampoline. See :ref:`perf_profiling` for more information.
es_es: Si no es cero, inicializa el trampolín perf. Consulte :ref:`perf_profiling` para obtener más información.
