Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: es_es, sv

source: Python Initialization Configuration
es_es: Configuración de inicialización de Python
sv: Konfiguration av Python-initialisering

source: Python can be initialized with :c:func:`Py_InitializeFromInitConfig`.
sv: Python kan initialiseras med :c:func:`Py_InitializeFromInitConfig`.

source: The :c:func:`Py_RunMain` function can be used to write a customized Python program.
es_es: La función :c:func:`Py_RunMain` puede utilizarse para escribir un programa Python personalizado.
sv: Funktionen :c:func:`Py_RunMain` kan användas för att skriva ett anpassat Python-program.

source: See also :ref:`Initialization, Finalization, and Threads <initialization>`.
es_es: Véase también :ref:`Inicialización, Finalización e Hilos <initialization>`.
sv: Se även :ref:`Initialization, Finalization, and Threads <initialization>`.

source: Example
es_es: Ejemplo
sv: Exempel

source: Example of customized Python always running with the :ref:`Python Development Mode <devmode>` enabled; return ``-1`` on error:
sv: Exempel på anpassat Python som alltid körs med :ref:`Python Development Mode <devmode>` aktiverat; returnerar ``-1`` vid fel:

source: int init_python(void) { PyInitConfig *config = PyInitConfig_Create(); if (config == NULL) { printf("PYTHON INIT ERROR: memory allocation failed\n"); return -1; } // Enable the Python Development Mode if (PyInitConfig_SetInt(config, "dev_mode", 1) < 0) { goto error; } // Initialize Python with the configuration if (Py_InitializeFromInitConfig(config) < 0) { goto error; } PyInitConfig_Free(config); return 0; error: { // Display the error message. // // This uncommon braces style is used, because you cannot make // goto targets point to variable declarations. const char *err_msg; (void)PyInitConfig_GetError(config, &err_msg); printf("PYTHON INIT ERROR: %s\n", err_msg); PyInitConfig_Free(config); return -1; } }
sv: int init_python(void) { PyInitConfig *config = PyInitConfig_Create(); if (config == NULL) { printf("PYTHON INIT ERROR: minnesallokering misslyckades\n"); return -1; } // Aktivera Pythons utvecklingsläge if (PyInitConfig_SetInt(config, "dev_mode", 1) < 0) { gå till fel; } // Initiera Python med konfigurationen if (Py_InitializeFromInitConfig(config) < 0) { goto fel; } PyInitConfig_Free(config); return 0; fel: { // Visa felmeddelandet. // // Denna ovanliga stil med hakparenteser används eftersom man inte kan få // goto-mål pekar på variabeldeklarationer. const char *err_msg; (void)PyInitConfig_GetError(config, &err_msg); printf("PYTHON INIT ERROR: %s\n", err_msg); PyInitConfig_Free(config); return -1; } }

source: Create Config
sv: Skapa konfiguration

source: Opaque structure to configure the Python initialization.
sv: Ogenomskinlig struktur för att konfigurera Python-initialiseringen.

source: Create a new initialization configuration using :ref:`Isolated Configuration <init-isolated-conf>` default values.
sv: Skapa en ny initieringskonfiguration med hjälp av :ref:``Isolated Configuration <init-isolated-conf>`` standardvärden.

source: It must be freed by :c:func:`PyInitConfig_Free`.
sv: Den måste frigöras genom :c:func:`PyInitConfig_Free`.

source: Return ``NULL`` on memory allocation failure.
sv: Returnerar ``NULL`` om minnesallokeringen misslyckas.

source: Free memory of the initialization configuration *config*.
sv: Frigör minne för initialiseringskonfigurationen *config*.

source: If *config* is ``NULL``, no operation is performed.
sv: Om *config* är ``NULL`` utförs ingen åtgärd.

source: Error Handling
sv: Felhantering

source: Get the *config* error message.
sv: Få felmeddelandet *config*.

source: Set *\*err_msg* and return ``1`` if an error is set.
sv: Ställ in *\*err_msg* och returnera ``1`` om ett fel har ställts in.

source: Set *\*err_msg* to ``NULL`` and return ``0`` otherwise.
sv: Sätt *\*err_msg* till ``NULL`` och returnera annars ``0``.

source: An error message is an UTF-8 encoded string.
sv: Ett felmeddelande är en UTF-8-kodad sträng.

source: If *config* has an exit code, format the exit code as an error message.
sv: Om *config* har en utgångskod, formatera utgångskoden som ett felmeddelande.

source: The error message remains valid until another ``PyInitConfig`` function is called with *config*. The caller doesn't have to free the error message.
sv: Felmeddelandet förblir giltigt tills en annan ``PyInitConfig``-funktion anropas med *config*. Den som anropar behöver inte återställa felmeddelandet.

source: Get the *config* exit code.
sv: Hämta utgångskoden för *config*.

source: Set *\*exitcode* and return ``1`` if *config* has an exit code set.
sv: Ställ in *\*exitcode* och returnera ``1`` om *config* har en exitkod inställd.

source: Return ``0`` if *config* has no exit code set.
sv: Returnerar ``0`` om *config* inte har någon exitkod inställd.

source: Only the ``Py_InitializeFromInitConfig()`` function can set an exit code if the ``parse_argv`` option is non-zero.
sv: Endast funktionen ``Py_InitializeFromInitConfig()`` kan ange en utgångskod om alternativet ``parse_argv`` inte är noll.

source: An exit code can be set when parsing the command line failed (exit code ``2``) or when a command line option asks to display the command line help (exit code ``0``).
sv: En utgångskod kan anges när tolkningen av kommandoraden misslyckades (utgångskod ``2``) eller när ett kommandoradsalternativ begär att kommandoradshjälpen ska visas (utgångskod ``0``).

source: Get Options
sv: Få alternativ

source: The configuration option *name* parameter must be a non-NULL null-terminated UTF-8 encoded string. See :ref:`Configuration Options <pyinitconfig-opts>`.
sv: Parametern *name* för konfigurationsalternativet måste vara en UTF-8-kodad sträng med nollavgränsning som inte är NULL. Se :ref:`Konfigurationsalternativ <pyinitconfig-opts>`.

source: Test if the configuration has an option called *name*.
sv: Testa om konfigurationen har ett alternativ som heter *namn*.

source: Return ``1`` if the option exists, or return ``0`` otherwise.
sv: Returnerar ``1`` om alternativet finns, eller returnerar ``0`` annars.

source: Get an integer configuration option.
sv: Hämta ett konfigurationsalternativ för heltal.

source: Set *\*value*, and return ``0`` on success.
sv: Ställ in *\*värde* och returnera ``0`` vid framgång.

source: Set an error in *config* and return ``-1`` on error.
sv: Ange ett fel i *config* och returnera ``-1`` vid fel.

source: Get a string configuration option as a null-terminated UTF-8 encoded string.
sv: Hämta ett konfigurationsalternativ för en sträng som en nollavslutad UTF-8-kodad sträng.

source: *\*value* can be set to ``NULL`` if the option is an optional string and the option is unset.
sv: *\*värde* kan sättas till ``NULL`` om alternativet är en valfri sträng och alternativet inte är inställt.

source: On success, the string must be released with ``free(value)`` if it's not ``NULL``.
sv: Vid framgång måste strängen släppas med ``free(value)`` om den inte är ``NULL``.

source: Get a string list configuration option as an array of null-terminated UTF-8 encoded strings.
sv: Hämta ett konfigurationsalternativ i en stränglista som en array av nollavslutade UTF-8-kodade strängar.

source: Set *\*length* and *\*value*, and return ``0`` on success.
sv: Ställ in *\*length* och *\*value*, och returnera ``0`` vid framgång.

source: On success, the string list must be released with ``PyInitConfig_FreeStrList(length, items)``.
sv: Vid framgång måste stränglistan släppas med ``PyInitConfig_FreeStrList(length, items)``.

source: Free memory of a string list created by ``PyInitConfig_GetStrList()``.
sv: Frigör minne för en stränglista som skapats av ``PyInitConfig_GetStrList()``.

source: Set Options
sv: Ställ in alternativ

source: Some configuration options have side effects on other options. This logic is only implemented when ``Py_InitializeFromInitConfig()`` is called, not by the "Set" functions below. For example, setting ``dev_mode`` to ``1`` does not set ``faulthandler`` to ``1``.
sv: Vissa konfigurationsalternativ har bieffekter på andra alternativ. Denna logik implementeras endast när ``Py_InitializeFromInitConfig()`` anropas, inte av "Set"-funktionerna nedan. Att till exempel sätta ``dev_mode`` till ``1`` sätter inte ``faulthandler`` till ``1``.

source: Set an integer configuration option.
sv: Ställ in ett konfigurationsalternativ för heltal.

source: Return ``0`` on success.
sv: Returnerar ``0`` vid framgång.

source: Set a string configuration option from a null-terminated UTF-8 encoded string. The string is copied.
sv: Ställ in ett konfigurationsalternativ för en sträng från en nollavslutad UTF-8-kodad sträng. Strängen kopieras.

source: Set a string list configuration option from an array of null-terminated UTF-8 encoded strings. The string list is copied.
sv: Ange ett konfigurationsalternativ för en stränglista från en array med nollavslutade UTF-8-kodade strängar. Stränglistan kopieras.

source: Module
sv: Modul

source: Add a built-in extension module to the table of built-in modules.
sv: Lägg till en inbyggd förlängningsmodul i tabellen över inbyggda moduler.

source: The new module can be imported by the name *name*, and uses the function *initfunc* as the initialization function called on the first attempted import.
sv: Den nya modulen kan importeras med namnet *name* och använder funktionen *initfunc* som initialiseringsfunktion som anropas vid första importförsöket.

source: If Python is initialized multiple times, ``PyInitConfig_AddModule()`` must be called at each Python initialization.
sv: Om Python initialiseras flera gånger måste ``PyInitConfig_AddModule()`` anropas vid varje Python-initialisering.

source: Similar to the :c:func:`PyImport_AppendInittab` function.
sv: Liknar funktionen :c:func:`PyImport_AppendInittab`.

source: Initialize Python
sv: Initialisera Python

source: Initialize Python from the initialization configuration.
sv: Initiera Python från initieringskonfigurationen.

source: Set an exit code in *config* and return ``-1`` if Python wants to exit.
sv: Ange en utgångskod i *config* och returnera ``-1`` om Python vill avsluta.

source: See ``PyInitConfig_GetExitcode()`` for the exit code case.
sv: Se ``PyInitConfig_GetExitcode()`` för utgångskodsfallet.

source: Configuration Options
sv: Alternativ för konfiguration

source: Option
sv: Alternativ

source: PyConfig/PyPreConfig member
sv: PyConfig/PyPreConfig-medlem

source: Type
sv: Typ

source: Visibility
sv: Synlighet

source: ``"allocator"``
sv: ``"fördelare"``

source: :c:member:`allocator <PyPreConfig.allocator>`
sv: :c:member:`allokator <PyPreConfig.allokator>`

source: Read-only
sv: Endast läs

source: Public
sv: Offentlig

source: ``"base_prefix"``
sv: ``"basprefix"``

source: ``"buffered_stdio"``
sv: ``"buffrad_stdio"``

source: ``"bytes_warning"``
sv: ``"bytes_varning"``

source: ``"coerce_c_locale_warn"``
sv: ``"tvinga_c_lokal_varning"``

source: ``"configure_c_stdio"``
sv: ``"konfigurera_c_stdio"``

source: ``"executable"``
sv: ``"körbar"```

source: :c:member:`executable <PyConfig.executable>`
sv: :c:member:`exekverbar <PyConfig.exekverbar>`

source: ``"home"``
sv: ``"hem"``

source: :c:member:`home <PyConfig.home>`
sv: :c:member:`hem <PyConfig.hem>`

source: ``"import_time"``
sv: ``"import_tid"```

source: ``"inspect"``
sv: ``"inspektera"```

source: :c:member:`inspect <PyConfig.inspect>`
sv: :c:member:`inspektera <PyConfig.inspektera>`

source: ``"install_signal_handlers"``
sv: ``"installera_signal_handläggare"``

source: ``"interactive"``
sv: ``"interaktiv"``

source: :c:member:`interactive <PyConfig.interactive>`
sv: :c:member:`interaktiv <PyConfig.interaktiv>`

source: ``"isolated"``
sv: "isolerad"

source: :c:member:`isolated <PyConfig.isolated>`
sv: :c:member:`isolerad <PyConfig.isolerad>`

source: ``"module_search_paths"``
sv: ``"modul_search_paths"``

source: :c:member:`module_search_paths <PyConfig.module_search_paths>`
sv: :c:member:`modul_search_paths <PyConfig.module_search_paths>`

source: ``"optimization_level"``
sv: ``"optimeringsnivå"``

source: :c:member:`optimization_level <PyConfig.optimization_level>`
sv: :c:member:`optimering_nivå <PyConfig.optimering_nivå>`

source: ``"program_name"``
sv: ``"program_namn"``

source: :c:member:`program_name <PyConfig.program_name>`
sv: :c:member:`program_namn <PyConfig.program_namn>`

source: ``"quiet"``
sv: "tyst"

source: ``"run_filename"``
sv: ``"run_filnamn"``

source: ``"stdio_errors"``
sv: ``"stdio_fel"``

source: :c:member:`use_frozen_modules <PyConfig.use_frozen_modules>`
sv: :c:member:`använd_frozen_modules <PyConfig.use_frozen_modules>`

source: :c:member:`use_hash_seed <PyConfig.use_hash_seed>`
sv: :c:member:`använd_hash_seed <PyConfig.use_hash_seed>`

source: :c:member:`user_site_directory <PyConfig.user_site_directory>`
sv: :c:member:`användare_site_directory <PyConfig.user_site_directory>`

source: Visibility:
sv: Synlighet:

source: Public: Can by get by :c:func:`PyConfig_Get` and set by :c:func:`PyConfig_Set`.
sv: Allmän: Kan hämtas med :c:func:`PyConfig_Get` och ställas in med :c:func:`PyConfig_Set`.

source: Read-only: Can by get by :c:func:`PyConfig_Get`, but cannot be set by :c:func:`PyConfig_Set`.
sv: Skrivskyddad: Kan hämtas med :c:func:`PyConfig_Get`, men kan inte ställas in med :c:func:`PyConfig_Set`.

source: Runtime Python configuration API
sv: Python-konfigurations-API för körtid

source: At runtime, it's possible to get and set configuration options using :c:func:`PyConfig_Get` and :c:func:`PyConfig_Set` functions.
sv: Vid körning är det möjligt att hämta och ställa in konfigurationsalternativ med hjälp av funktionerna :c:func:`PyConfig_Get` och :c:func:`PyConfig_Set`.

source: Some options are read from the :mod:`sys` attributes. For example, the option ``"argv"`` is read from :data:`sys.argv`.
sv: Vissa alternativ läses från :mod:`sys`-attributen. Till exempel läses alternativet ``"argv"`` från :data:`sys.argv`.

source: Get the current runtime value of a configuration option as a Python object.
sv: Hämta det aktuella runtime-värdet för ett konfigurationsalternativ som ett Python-objekt.

source: Return a new reference on success.
sv: Returnerar en ny referens vid framgång.

source: Set an exception and return ``NULL`` on error.
sv: Ställ in ett undantag och returnera ``NULL`` vid fel.

source: The object type depends on the configuration option. It can be:
sv: Objekttypen beror på konfigurationsalternativet. Den kan vara:

source: The caller must have an :term:`attached thread state`. The function cannot be called before Python initialization nor after Python finalization.
sv: Den som anropar måste ha en :term:`attached thread state`. Funktionen kan inte anropas före Python-initialisering eller efter Python-finalisering.

source: Similar to :c:func:`PyConfig_Get`, but get the value as a C int.
sv: Liknar :c:func:`PyConfig_Get`, men får värdet som en C int.

source: Set an exception and return ``-1`` on error.
sv: Ställ in ett undantag och returnera ``-1`` vid fel.

source: Get all configuration option names as a ``frozenset``.
sv: Hämta alla namn på konfigurationsalternativ som ett ``frozenset``.

source: Set the current runtime value of a configuration option.
sv: Ställ in det aktuella runtime-värdet för ett konfigurationsalternativ.

source: Raise a :exc:`ValueError` if there is no option *name*.
sv: Skapar ett :exc:`ValueError` om det inte finns något alternativ *namn*.

source: Raise a :exc:`ValueError` if *value* is an invalid value.
sv: Skapar ett :exc:`ValueError` om *värde* är ett ogiltigt värde.

source: Raise a :exc:`ValueError` if the option is read-only (cannot be set).
sv: Skapar ett :exc:`ValueError` om alternativet är skrivskyddat (kan inte ställas in).

source: Raise a :exc:`TypeError` if *value* has not the proper type.
sv: Skapar ett :exc:`TypeError` om *värde* inte har rätt typ.

source: Raises an :ref:`auditing event <auditing>` ``cpython.PyConfig_Set`` with arguments ``name``, ``value``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``cpython.PyConfig_Set`` med argumenten ``name``, ``value``.

source: Python can be initialized with :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure. It can be preinitialized with :c:func:`Py_PreInitialize` and the :c:type:`PyPreConfig` structure.
es_es: Python puede inicializarse con :c:func:`Py_InitializeFromConfig` y la estructura :c:type:`PyConfig`. Se puede preinicializar con :c:func:`Py_PreInitialize` y la estructura :c:type:`PyPreConfig`.
sv: Python kan initialiseras med :c:func:`Py_InitializeFromConfig` och :c:type:`PyConfig`-strukturen. Den kan förinitialiseras med :c:func:`Py_PreInitialize` och strukturen :c:type:`PyPreConfig`.

source: There are two kinds of configuration:
es_es: Existen dos tipos de configuración:
sv: Det finns två typer av konfigurering:

source: The :ref:`Python Configuration <init-python-config>` can be used to build a customized Python which behaves as the regular Python. For example, environment variables and command line arguments are used to configure Python.
es_es: La :ref:`Configuración de Python <init-python-config>` se puede utilizar para construir un Python personalizado que se comporte como el Python normal. Por ejemplo, las variables de entorno y los argumentos de línea de comandos se utilizan para configurar Python.
sv: :ref:`Python Configuration <init-python-config>` kan användas för att bygga en anpassad Python som beter sig som den vanliga Python. Till exempel används miljövariabler och kommandoradsargument för att konfigurera Python.

source: The :ref:`Isolated Configuration <init-isolated-conf>` can be used to embed Python into an application. It isolates Python from the system. For example, environment variables are ignored, the LC_CTYPE locale is left unchanged and no signal handler is registered.
es_es: La :ref:`Configuración Aislada <init-isolated-conf>` se puede utilizar para incrustar Python en una aplicación. Aísla Python del sistema. Por ejemplo, las variables de entorno se ignoran, la configuración regional LC_CTYPE no se modifica y no se registra ningún manejador de señales.
sv: :ref:`Isolated Configuration <init-isolated-conf>` kan användas för att bädda in Python i en applikation. Den isolerar Python från systemet. Till exempel ignoreras miljövariabler, LC_CTYPE locale lämnas oförändrad och ingen signalhanterare registreras.

source: Example of customized Python always running in isolated mode::
es_es: Ejemplo de Python personalizado ejecutándose siempre en modo aislado::
sv: Exempel på anpassad Python som alltid körs i isolerat läge::

source: int main(int argc, char **argv) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); config.isolated = 1; /* Decode command line arguments. Implicitly preinitialize Python (in isolated mode). */ status = PyConfig_SetBytesArgv(&config, argc, argv); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return Py_RunMain(); exception: PyConfig_Clear(&config); if (PyStatus_IsExit(status)) { return status.exitcode; } /* Display the error message and exit the process with non-zero exit code */ Py_ExitStatusException(status); }
es_es: int main(int argc, char **argv) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); config.isolated = 1; /* Decodificar argumentos de línea de comandos. Preinicializar implícitamente Python (en modo aislado). */ status = PyConfig_SetBytesArgv(&config, argc, argv); if (PyStatus_Exception(status)) { goto exception; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { goto exception; } PyConfig_Clear(&config); return Py_RunMain(); exception: PyConfig_Clear(&config); if (PyStatus_IsExit(status)) { return status.exitcode; } /* Muestra el mensaje de error y sal del proceso con código de salida distinto de cero */ Py_ExitStatusException(status); }
sv: int main(int argc, char **argv) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); config.isolated = 1; /* Avkoda kommandoradsargument. Förinitialisera Python implicit (i isolerat läge). */ status = PyConfig_SetBytesArgv(&config, argc, argv); if (PyStatus_Exception(status)) { goto undantag; } status = Py_InitializeFromConfig(&config); if (PyStatus_Exception(status)) { gå till undantaget; } PyConfig_Clear(&config); return Py_RunMain(); undantag: PyConfig_Clear(&config); if (PyStatus_IsExit(status)) { return status.exitcode; } /* Visa felmeddelandet och avsluta processen med en med en utgångskod som inte är noll */ Py_ExitStatusException(status); }

source: List of ``wchar_t*`` strings.
es_es: Lista de cadenas ``wchar_t*``.
sv: Lista över strängar av typen ``wchar_t*``.

source: If *length* is non-zero, *items* must be non-``NULL`` and all strings must be non-``NULL``.
es_es: Si *length* es distinto de cero, *items* debe ser distinto de``NULL`` y todas las cadenas deben ser distintas de``NULL``.
sv: Om *length* inte är noll måste *items* vara något annat än ``NULL`` och alla strängar måste vara något annat än ``NULL``.

source: Methods:
es_es: Métodos:
sv: Metoder:

source: Append *item* to *list*.
es_es: Añadir *item* a *list*.
sv: Lägg till *item* till *list*.

source: Python must be preinitialized to call this function.
es_es: Python debe estar preinicializado para llamar a esta función.
sv: Python måste vara förinitialiserat för att denna funktion ska kunna anropas.

source: Insert *item* into *list* at *index*.
es_es: Insertar *item* en *list* en *index*.
sv: Infoga *objekt* i *lista* vid *index*.

source: If *index* is greater than or equal to *list* length, append *item* to *list*.
es_es: Si *index* es mayor o igual que la longitud de *list*, añade *item* a *list*.
sv: Om *index* är större än eller lika med *list* längd, lägg till *item* till *list*.

source: *index* must be greater than or equal to ``0``.
es_es: *index* debe ser mayor o igual que ``0``.
sv: *index* måste vara större än eller lika med ``0``.

source: Structure fields:
es_es: Campos de estructura:
sv: Strukturfält:

source: List length.
es_es: Longitud de la lista.
sv: Listans längd.

source: List items.
es_es: Lista de items.
sv: Lista objekt.

source: Structure to store an initialization function status: success, error or exit.
es_es: Estructura para almacenar el estado de una función de inicialización: éxito, error o salida.
sv: Struktur för att lagra en initialiseringsfunktions status: success, error eller exit.

source: For an error, it can store the C function name which created the error.
es_es: Para un error, puede almacenar el nombre de la función C que creó el error.
sv: För ett fel kan det lagra namnet på den C-funktion som skapade felet.

source: Exit code. Argument passed to ``exit()``.
es_es: Código de salida. Argumento pasado a ``exit()``.
sv: Exit-kod. Argument som skickas till ``exit()``.

source: Error message.
es_es: Mensaje de error.
sv: Felmeddelande.

source: Name of the function which created an error, can be ``NULL``.
es_es: Nombre de la función que creó un error, puede ser ``NULL``.
sv: Namn på den funktion som skapade ett fel, kan vara ``NULL``.

source: Functions to create a status:
es_es: Funciones para crear un estado:
sv: Funktioner för att skapa en status:

source: Success.
es_es: Éxito.
sv: Lyckades.

source: Initialization error with a message.
es_es: Error de inicialización con un mensaje.
sv: Initialiseringsfel med ett meddelande.

source: *err_msg* must not be ``NULL``.
es_es: *err_msg* no debe ser ``NULL``.
sv: *err_msg* får inte vara ``NULL``.

source: Memory allocation failure (out of memory).
es_es: Fallo de asignación de memoria (sin memoria).
sv: Fel i minnesallokeringen (minnet är slut).
