Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: es_es, sv

source: Fields for :ref:`path configuration <init-path-config>` are no longer calculated or modified when calling this function, as of Python 3.11.
es_es: Los campos de :ref:`path configuration<init-path-config>` ya no se calculan ni modifican al llamar a esta función, a partir de Python 3.11.
sv: Fält för :ref:`path configuration <init-path-config>` beräknas eller ändras inte längre vid anrop av denna funktion, från och med Python 3.11.

source: The :c:func:`PyConfig_Read` function only parses :c:member:`PyConfig.argv` arguments once: :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed. Since Python arguments are stripped from :c:member:`PyConfig.argv`, parsing arguments twice would parse the application options as Python options.
es_es: La función :c:func:`PyConfig_Read` sólo analiza los argumentos de :c:member:`PyConfig.argv` una vez: :c:member:`PyConfig.parse_argv` se convierte en ``2`` después de analizar los argumentos. Dado que los argumentos de Python se eliminan de :c:member:`PyConfig.argv`, si se analizan los argumentos dos veces, las opciones de la aplicación se analizarían como opciones de Python.
sv: Funktionen :c:func:`PyConfig_Read` analyserar bara :c:member:`PyConfig.argv`-argument en gång: :c:member:`PyConfig.parse_argv` sätts till ``2`` efter att argumenten har analyserats. Eftersom Python-argument tas bort från :c:member:`PyConfig.argv`, skulle analys av argument två gånger innebära att programalternativen analyseras som Python-alternativ.

source: The :c:member:`PyConfig.argv` arguments are now only parsed once, :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed, and arguments are only parsed if :c:member:`PyConfig.parse_argv` equals ``1``.
es_es: Los argumentos :c:member:`PyConfig.argv` ahora sólo se analizan una vez, :c:member:`PyConfig.parse_argv` se establece en ``2`` después de analizar los argumentos, y los argumentos sólo se analizan si :c:member:`PyConfig.parse_argv` es igual a ``1``.
sv: Argumenten :c:member:`PyConfig.argv` analyseras nu endast en gång, :c:member:`PyConfig.parse_argv` sätts till ``2`` efter att argumenten har analyserats och argumenten analyseras endast om :c:member:`PyConfig.parse_argv` är lika med ``1``.

source: :c:func:`PyConfig_Read` no longer calculates all paths, and so fields listed under :ref:`Python Path Configuration <init-path-config>` may no longer be updated until :c:func:`Py_InitializeFromConfig` is called.
es_es: :c:func:`PyConfig_Read` ya no calcula todas las rutas, por lo que es posible que los campos listados en :ref:`Python Path Configuration <init-path-config>` no se actualicen hasta que se llame a :c:func:`Py_InitializeFromConfig`.
sv: :c:func:`PyConfig_Read` beräknar inte längre alla sökvägar, och därför kan fält som listas under :ref:`Python Path Configuration <init-path-config>` inte längre uppdateras förrän :c:func:`Py_InitializeFromConfig` anropas.

source: Release configuration memory.
es_es: Liberar memoria de configuración.
sv: Frigör konfigurationsminnet.

source: Most ``PyConfig`` methods :ref:`preinitialize Python <c-preinit>` if needed. In that case, the Python preinitialization configuration (:c:type:`PyPreConfig`) in based on the :c:type:`PyConfig`. If configuration fields which are in common with :c:type:`PyPreConfig` are tuned, they must be set before calling a :c:type:`PyConfig` method:
es_es: La mayoría de los métodos ``PyConfig``:ref:`preinitialize Python <c-preinit>` si es necesario. En ese caso, la configuración de preinicialización de Python (:c:type:`PyPreConfig`) se basa en la de :c:type:`PyConfig`. Si se sintonizan campos de configuración que son comunes con :c:type:`PyPreConfig`, deben establecerse antes de llamar a un método :c:type:`PyConfig`:
sv: De flesta ``PyConfig``-metoder :ref:`förinitiera Python <c-preinit>`` om det behövs. I så fall baseras Pythons förinitialiseringskonfiguration (:c:type:`PyPreConfig`) på :c:type:`PyConfig`. Om konfigurationsfält som är gemensamma med :c:type:`PyPreConfig` är inställda, måste de ställas in innan en :c:type:`PyConfig`-metod anropas:

source: Moreover, if :c:func:`PyConfig_SetArgv` or :c:func:`PyConfig_SetBytesArgv` is used, this method must be called before other methods, since the preinitialization configuration depends on command line arguments (if :c:member:`~PyConfig.parse_argv` is non-zero).
es_es: Además, si se utiliza :c:func:`PyConfig_SetArgv` o :c:func:`PyConfig_SetBytesArgv`, este método debe llamarse antes que otros métodos, ya que la configuración de preinicialización depende de los argumentos de la línea de comandos (si :c:member:`~PyConfig.parse_argv` es distinto de cero).
sv: Dessutom, om :c:func:`PyConfig_SetArgv` eller :c:func:`PyConfig_SetBytesArgv` används, måste denna metod anropas före andra metoder, eftersom konfigurationen före initieringen beror på kommandoradsargument (om :c:member:`~PyConfig.parse_argv` inte är noll).

source: The caller of these methods is responsible to handle exceptions (error or exit) using ``PyStatus_Exception()`` and ``Py_ExitStatusException()``.
es_es: El invocador de estos métodos es responsable de manejar las excepciones (error o salida) utilizando ``PyStatus_Exception()`` y ``Py_ExitStatusException()``.
sv: Den som anropar dessa metoder är ansvarig för att hantera undantag (fel eller exit) med hjälp av ``PyStatus_Exception()`` och ``Py_ExitStatusException()``.

source: Set :data:`sys.argv` command line arguments based on :c:member:`~PyConfig.argv`. These parameters are similar to those passed to the program's :c:func:`main` function with the difference that the first entry should refer to the script file to be executed rather than the executable hosting the Python interpreter. If there isn't a script that will be run, the first entry in :c:member:`~PyConfig.argv` can be an empty string.
sv: Ställ in :data:`sys.argv` kommandoradsargument baserat på :c:member:`~PyConfig.argv`. Dessa parametrar liknar de som skickas till programmets funktion :c:func:`main` med skillnaden att den första posten ska referera till skriptfilen som ska köras istället för den körbara filen som är värd för Python-tolken. Om det inte finns något skript som ska köras kan den första posten i :c:member:`~PyConfig.argv` vara en tom sträng.

source: Set :c:member:`~PyConfig.parse_argv` to ``1`` to parse :c:member:`~PyConfig.argv` the same way the regular Python parses Python command line arguments and then to strip Python arguments from :c:member:`~PyConfig.argv`.
es_es: Establezca :c:member:`~PyConfig.parse_argv` en ``1`` para analizar :c:member:`~PyConfig.argv` del mismo modo que Python analiza los argumentos de la línea de comandos de Python y, a continuación, elimine los argumentos de Python de :c:member:`~PyConfig.argv`.
sv: Sätt :c:member:`~PyConfig.parse_argv` till ``1`` för att analysera :c:member:`~PyConfig.argv` på samma sätt som vanliga Python analyserar Python-kommandoradsargument och sedan ta bort Python-argument från :c:member:`~PyConfig.argv`.

source: If :c:member:`~PyConfig.argv` is empty, an empty string is added to ensure that :data:`sys.argv` always exists and is never empty.
es_es: Si :c:member:`~PyConfig.argv` está vacío, se añade una cadena vacía para garantizar que :data:`sys.argv` siempre existe y nunca está vacío.
sv: Om :c:member:`~PyConfig.argv` är tom, läggs en tom sträng till för att säkerställa att :data:`sys.argv` alltid existerar och aldrig är tom.

source: Default: ``NULL``.
es_es: Por defecto: ``NULL``.
sv: Standard: ``NULL``.

source: See also the :c:member:`~PyConfig.orig_argv` member.
es_es: Ver también el miembro :c:member:`~PyConfig.orig_argv`.
sv: Se även :c:member:`~PyConfig.orig_argv`-medlemmen.

source: If equals to zero, ``Py_RunMain()`` prepends a potentially unsafe path to :data:`sys.path` at startup:
es_es: Si es igual a cero, ``Py_RunMain()`` antepone una ruta potencialmente insegura a :data:`sys.path` al iniciarse:
sv: Om den är lika med noll, lägger ``Py_RunMain()`` till en potentiellt osäker sökväg till :data:`sys.path` vid uppstart:

source: If :c:member:`argv[0] <PyConfig.argv>` is equal to ``L"-m"`` (``python -m module``), prepend the current working directory.
es_es: Si :c:member:`argv[0] <PyConfig.argv>` es igual a ``L"-m"`` (``python -m module``), añade el directorio de trabajo actual.
sv: Om :c:member:`argv[0] <PyConfig.argv>` är lika med ``L"-m"`` (``python -m module``), lägg till den aktuella arbetskatalogen.

source: If running a script (``python script.py``), prepend the script's directory. If it's a symbolic link, resolve symbolic links.
es_es: Si se ejecuta un script (``python script.py``), anteponer el directorio del script. Si es un enlace simbólico, resolver enlaces simbólicos.
sv: Om du kör ett skript (``python script.py``), lägg till skriptets katalog. Om det är en symbolisk länk, lös symboliska länkar.

source: Otherwise (``python -c code`` and ``python``), prepend an empty string, which means the current working directory.
es_es: En caso contrario (``python -c code`` y ``python``), antepone una cadena vacía, que significa el directorio de trabajo actual.
sv: I annat fall (``python -c code`` och ``python``) läggs en tom sträng till, vilket innebär den aktuella arbetskatalogen.

source: Set to ``1`` by the :option:`-P` command line option and the :envvar:`PYTHONSAFEPATH` environment variable.
es_es: Se establece en ``1`` mediante la opción de línea de comandos :option:`-P` y la variable de entorno :envvar:`PYTHONSAFEPATH`.
sv: Sätts till ``1`` med kommandoradsalternativet :option:`-P` och miljövariabeln :envvar:`PYTHONSAFEPATH`.

source: Default: ``0`` in Python config, ``1`` in isolated config.
es_es: Por defecto: ``0`` en configuración Python, ``1`` en configuración aislada.
sv: Standard: ``0`` i Python-konfiguration, ``1`` i isolerad konfiguration.

source: Part of the :ref:`Python Path Configuration <init-path-config>` output.
es_es: Parte de la salida :ref:`Python Path Configuration <init-path-config>`.
sv: Del av :ref:`Python Path Configuration <init-path-config>` utdata.

source: See also :c:member:`PyConfig.exec_prefix`.
sv: Se även :c:member:`PyConfig.exec_prefix`.

source: Python base executable: :data:`sys._base_executable`.
es_es: Ejecutable base de Python: :data:`sys._base_executable`.
sv: Körbar Python-bas: :data:`sys._base_executable`.

source: Set by the :envvar:`__PYVENV_LAUNCHER__` environment variable.
es_es: Establecido por la variable de entorno :envvar:`__PYVENV_LAUNCHER__`.
sv: Ställs in av miljövariabeln :envvar:`__PYVENV_LAUNCHER__`.

source: Set from :c:member:`PyConfig.executable` if ``NULL``.
es_es: Fijar desde :c:member:`PyConfig.executable` si ``NULL``.
sv: Set från :c:member:`PyConfig.executable` if ``NULL``.

source: See also :c:member:`PyConfig.executable`.
sv: Se även :c:member:`PyConfig.executable`.

source: See also :c:member:`PyConfig.prefix`.
sv: Se även :c:member:`PyConfig.prefix`.

source: If equals to ``0`` and :c:member:`~PyConfig.configure_c_stdio` is non-zero, disable buffering on the C streams stdout and stderr.
es_es: Si es igual a ``0`` y :c:member:`~PyConfig.configure_c_stdio` es distinto de cero, desactiva el almacenamiento en búfer en los flujos C stdout y stderr.
sv: Om lika med ``0`` och :c:member:`~PyConfig.configure_c_stdio` är icke-noll, inaktivera buffring på C-strömmarna stdout och stderr.

source: Set to ``0`` by the :option:`-u` command line option and the :envvar:`PYTHONUNBUFFERED` environment variable.
es_es: Se establece en ``0`` mediante la opción de línea de comandos :option:`-u` y la variable de entorno :envvar:`PYTHONUNBUFFERED`.
sv: Sätts till ``0`` med kommandoradsalternativet :option:`-u` och miljövariabeln :envvar:`PYTHONUNBUFFERED`.

source: stdin is always opened in buffered mode.
es_es: stdin se abre siempre en modo de búfer.
sv: stdin öppnas alltid i buffrat läge.

source: Default: ``1``.
es_es: Por defecto: ``1``.
sv: Standard: ``1``.

source: If equals to ``1``, issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str`, or comparing :class:`bytes` with :class:`int`.
es_es: Si es igual a ``1``, emite una advertencia al comparar :class:`bytes` o :class:`bytearray` con :class:`str`, o al comparar :class:`bytes` con :class:`int`.
sv: Om lika med ``1``, utfärda en varning när du jämför :class:`bytes` eller :class:`bytearray` med :class:`str`, eller jämför :class:`bytes` med :class:`int`.

source: If equal or greater to ``2``, raise a :exc:`BytesWarning` exception in these cases.
es_es: Si es igual o mayor que ``2``, lance una excepción :exc:`BytesWarning` en estos casos.
sv: Om lika med eller större än ``2``, skapa ett :exc:`BytesWarning` undantag i dessa fall.

source: Incremented by the :option:`-b` command line option.
es_es: Incrementado por la opción de línea de comandos :option:`-b`.
sv: Ökas med kommandoradsalternativet :option:`-b`.

source: If non-zero, emit a :exc:`EncodingWarning` warning when :class:`io.TextIOWrapper` uses its default encoding. See :ref:`io-encoding-warning` for details.
es_es: Si no es cero, emite una advertencia :exc:`EncodingWarning` cuando :class:`io.TextIOWrapper` utiliza su codificación por defecto. Véase :ref:`io-encoding-warning` para más detalles.
sv: Om ung, avge en :exc:`EncodingWarning`-varning när :class:`io.TextIOWrapper` använder sin standardkodning. Se :ref:`io-encoding-warning` för detaljer.

source: If equals to ``0``, disables the inclusion of the end line and column mappings in code objects. Also disables traceback printing carets to specific error locations.
es_es: Si es igual a ``0``, desactiva la inclusión de las asignaciones de fin de línea y columna en los objetos de código. También desactiva la impresión de caretas de rastreo a ubicaciones de error específicas.
sv: Om lika med ``0``, inaktiveras inkludering av slutrad och kolumnmappningar i kodobjekt. Inaktiverar också spårningsutskrift av carets till specifika felplatser.

source: Set to ``0`` by the :envvar:`PYTHONNODEBUGRANGES` environment variable and by the :option:`-X no_debug_ranges <-X>` command line option.
es_es: Establecido en ``0`` por la variable de entorno :envvar:`PYTHONNODEBUGRANGES` y por la opción de línea de comandos :option:`-X no_debug_ranges <-X>`.
sv: Sätts till ``0`` av miljövariabeln :envvar:`PYTHONNODEBUGRANGES` och av kommandoradsalternativet :option:`-X no_debug_ranges <-X>`.

source: Control the validation behavior of hash-based ``.pyc`` files: value of the :option:`--check-hash-based-pycs` command line option.
es_es: Controlar el comportamiento de validación de los archivos ``.pyc`` basados en hash: valor de la opción de línea de comandos :option:`--check-hash-based-pycs`.
sv: Kontrollera valideringsbeteendet för hash-baserade ``.pyc``-filer: värdet av kommandoradsalternativet :option:`--check-hash-based-pycs`.

source: Valid values:
es_es: Valores válidos:
sv: Giltiga värden:

source: ``L"always"``: Hash the source file for invalidation regardless of value of the 'check_source' flag.
es_es: ``L"always"``: Realiza un hash del archivo fuente para invalidarlo independientemente del valor de la bandera 'check_source'.
sv: ``L"alltid"``: Hashar källfilen för ogiltigförklaring oavsett värdet på flaggan "check_source".

source: ``L"never"``: Assume that hash-based pycs always are valid.
es_es: ``L"never"``: Asumir que las pycs basadas en hash siempre son válidas.
sv: ``L"aldrig"``: Anta att hash-baserade pycs alltid är giltiga.

source: ``L"default"``: The 'check_source' flag in hash-based pycs determines invalidation.
es_es: ``L"default"``: La bandera 'check_source' en pycs basado en hash determina la invalidación.
sv: ``L"standard"``: Flaggan "check_source" i hash-baserade pycs avgör ogiltighet.

source: Default: ``L"default"``.
es_es: Por defecto: ``L"default"``.
sv: Standard: ``L"default"``.

source: See also :pep:`552` "Deterministic pycs".
es_es: Véase también :pep:`552` "Deterministic pycs".
sv: Se även :pep:`552` "Deterministic pycs".

source: If non-zero, configure C standard streams:
es_es: Si es distinto de cero, configura los flujos estándar C:
sv: Om ej noll, konfigurera C-standardströmmar:

source: On Windows, set the binary mode (``O_BINARY``) on stdin, stdout and stderr.
es_es: En Windows, establezca el modo binario (``O_BINARY``) en stdin, stdout y stderr.
sv: I Windows ställer du in binärt läge (``O_BINARY``) på stdin, stdout och stderr.

source: If :c:member:`~PyConfig.buffered_stdio` equals zero, disable buffering of stdin, stdout and stderr streams.
es_es: Si :c:member:`~PyConfig.buffered_stdio` es igual a cero, desactiva el almacenamiento en búfer de los flujos stdin, stdout y stderr.
sv: Om :c:member:`~PyConfig.buffered_stdio` är lika med noll, inaktiveras buffring av strömmarna stdin, stdout och stderr.

source: If :c:member:`~PyConfig.interactive` is non-zero, enable stream buffering on stdin and stdout (only stdout on Windows).
es_es: Si :c:member:`~PyConfig.interactive` es distinto de cero, activa el almacenamiento en búfer en stdin y stdout (sólo stdout en Windows).
sv: Om :c:member:`~PyConfig.interactive` inte är noll, aktivera strömbuffring på stdin och stdout (endast stdout på Windows).

source: If non-zero, enable the :ref:`Python Development Mode <devmode>`.
es_es: Si es distinto de cero, activa el :ref:`Modo de desarrollo de Python <devmode>`.
sv: Om värdet är annat än noll aktiveras :ref:`Python Development Mode <devmode>`.

source: Set to ``1`` by the :option:`-X dev <-X>` option and the :envvar:`PYTHONDEVMODE` environment variable.
es_es: Se establece en ``1`` mediante la opción :option:`-X dev <-X>` y la variable de entorno :envvar:`PYTHONDEVMODE`.
sv: Sätts till ``1`` med alternativet :option:`-X dev <-X>` och miljövariabeln :envvar:`PYTHONDEVMODE`.

source: Dump Python references?
es_es: ¿Descargar referencias de Python?
sv: Dumpa Python-referenser?

source: If non-zero, dump all objects which are still alive at exit.
es_es: Si es distinto de cero, vuelca todos los objetos que siguen vivos al salir.
sv: Om värdet inte är noll, dumpas alla objekt som fortfarande lever vid avslut.

source: Set to ``1`` by the :envvar:`PYTHONDUMPREFS` environment variable.
es_es: Establecido en ``1`` por la variable de entorno :envvar:`PYTHONDUMPREFS`.
sv: Sätts till ``1`` av miljövariabeln :envvar:`PYTHONDUMPREFS`.

source: Needs a special build of Python with the ``Py_TRACE_REFS`` macro defined: see the :option:`configure --with-trace-refs option <--with-trace-refs>`.
sv: Kräver en specialversion av Python med makrot ``Py_TRACE_REFS`` definierat: se :option:`configure --with-trace-refs option <--with-trace-refs>`.

source: Filename where to dump Python references.
sv: Filnamn där Python-referenser ska dumpas.

source: Set by the :envvar:`PYTHONDUMPREFSFILE` environment variable.
sv: Ställs in av miljövariabeln :envvar:`PYTHONDUMPREFSFILE`.

source: The site-specific directory prefix where the platform-dependent Python files are installed: :data:`sys.exec_prefix`.
es_es: El prefijo del directorio específico del sitio donde se instalan los archivos Python dependientes de la plataforma: :data:`sys.exec_prefix`.
sv: Det platsspecifika katalogprefixet där de plattformsberoende Python-filerna installeras: :data:`sys.exec_prefix`.

source: See also :c:member:`PyConfig.base_exec_prefix`.
sv: Se även :c:member:`PyConfig.base_exec_prefix`.

source: The absolute path of the executable binary for the Python interpreter: :data:`sys.executable`.
es_es: La ruta absoluta del binario ejecutable para el intérprete de Python: :data:`sys.executable`.
sv: Den absoluta sökvägen till den körbara binärfilen för Python-tolken: :data:`sys.executable`.

source: See also :c:member:`PyConfig.base_executable`.
sv: Se även :c:member:`PyConfig.base_executable`.

source: Enable faulthandler?
es_es: ¿Habilitar faulthandler?
sv: Aktivera Faulthandler?

source: If non-zero, call :func:`faulthandler.enable` at startup.
es_es: Si no es cero, llamar a :func:`faulthandler.enable` al inicio.
sv: Om ej noll, anropa :func:`faulthandler.enable` vid uppstart.

source: Set to ``1`` by :option:`-X faulthandler <-X>` and the :envvar:`PYTHONFAULTHANDLER` environment variable.
es_es: Se establece en ``1`` mediante :option:`-X faulthandler <-X>` y la variable de entorno :envvar:`PYTHONFAULTHANDLER`.
sv: Sätts till ``1`` av :option:`-X faulthandler <-X>` och miljövariabeln :envvar:`PYTHONFAULTHANDLER`.

source: On macOS, Android and VxWorks: use ``"utf-8"`` by default.
es_es: En macOS, Android y VxWorks: utilice ``"utf-8"`` por defecto.
sv: På macOS, Android och VxWorks: använd ``"utf-8"`` som standard.

source: On Windows: use ``"utf-8"`` by default, or ``"mbcs"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
es_es: En Windows: utilice ``"utf-8"`` por defecto, o ``"mbcs"`` si :c:member:`~PyPreConfig.legacy_windows_fs_encoding` de :c:type:`PyPreConfig` es distinto de cero.
sv: På Windows: använd ``"utf-8"`` som standard, eller ``"mbcs"`` om :c:member:`~PyPreConfig.legacy_windows_fs_encoding` av :c:type:`PyPreConfig` är icke-noll.

source: Default encoding on other platforms:
es_es: Codificación por defecto en otras plataformas:
sv: Standardkodning på andra plattformar:

source: ``"utf-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
es_es: ``"utf-8"`` si :c:member:`PyPreConfig.utf8_mode` es distinto de cero.
sv: ``"utf-8"`` om :c:member:`PyPreConfig.utf8_mode` inte är noll.

source: ``"ascii"`` if Python detects that ``nl_langinfo(CODESET)`` announces the ASCII encoding, whereas the ``mbstowcs()`` function decodes from a different encoding (usually Latin1).
es_es: ``"ascii"`` si Python detecta que ``nl_langinfo(CODESET)`` anuncia la codificación ASCII, mientras que la función ``mbstowcs()`` decodifica a partir de una codificación diferente (normalmente Latin1).
sv: ``"ascii"`` om Python upptäcker att ``nl_langinfo(CODESET)`` meddelar ASCII-kodning, medan funktionen ``mbstowcs()`` avkodar från en annan kodning (vanligtvis Latin1).

source: ``"utf-8"`` if ``nl_langinfo(CODESET)`` returns an empty string.
es_es: ``"utf-8"`` si ``nl_langinfo(CODESET)`` devuelve una cadena vacía.
sv: ``"utf-8"`` om ``nl_langinfo(CODESET)`` returnerar en tom sträng.

source: Otherwise, use the :term:`locale encoding`: ``nl_langinfo(CODESET)`` result.
es_es: En caso contrario, utilice el resultado :term:`locale encoding`: ``nl_langinfo(CODESET)``.
sv: Annars används :term:`locale encoding`: ``nl_langinfo(CODESET)`` resultat.

source: At Python startup, the encoding name is normalized to the Python codec name. For example, ``"ANSI_X3.4-1968"`` is replaced with ``"ascii"``.
es_es: Al iniciar Python, el nombre de la codificación se normaliza con el nombre del códec de Python. Por ejemplo, ``"ANSI_X3.4-1968"`` se sustituye por ``"ascii"``.
sv: Vid Python-start normaliseras kodningsnamnet till Python-codec-namnet. Till exempel ersätts ``"ANSI_X3.4-1968"`` med ``"ascii"``.

source: See also the :c:member:`~PyConfig.filesystem_errors` member.
es_es: Ver también el miembro :c:member:`~PyConfig.filesystem_errors`.
sv: Se även :c:member:`~PyConfig.filesystem_errors` member.

source: :term:`Filesystem error handler <filesystem encoding and error handler>`: :func:`sys.getfilesystemencodeerrors`.
sv: :term:`Filsystemfelhanterare <filesystem encoding and error handler>`: :func:`sys.getfilesystemencodeerrors`.

source: On Windows: use ``"surrogatepass"`` by default, or ``"replace"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
es_es: En Windows: utilice ``"surrogatepass"`` por defecto, o ``"replace"`` si :c:member:`~PyPreConfig.legacy_windows_fs_encoding` de :c:type:`PyPreConfig` es distinto de cero.
sv: På Windows: använd ``"surrogatepass"`` som standard, eller ``"replace"`` om :c:member:`~PyPreConfig.legacy_windows_fs_encoding` av :c:type:`PyPreConfig` inte är noll.
