Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: es_es, sv

source: Set by :option:`-X perf <-X>` command line option and by the :envvar:`PYTHONPERFSUPPORT` environment variable.
es_es: Se establece mediante la opción de línea de comandos :option:`-X perf <-X>` y mediante la variable de entorno :envvar:`PYTHONPERFSUPPORT`.

source: Function to initialize Python:
es_es: Función para inicializar Python:

source: Initialize Python from *config* configuration.
es_es: Inicializar Python a partir de la configuración *config*.

source: The ``__PYVENV_LAUNCHER__`` environment variable is used to set :c:member:`PyConfig.base_executable`
es_es: La variable de entorno ``__PYVENV_LAUNCHER__`` se utiliza para establecer :c:member:`PyConfig.base_executable`

source: Execute the command (:c:member:`PyConfig.run_command`), the script (:c:member:`PyConfig.run_filename`) or the module (:c:member:`PyConfig.run_module`) specified on the command line or in the configuration.
es_es: Ejecuta el comando (:c:member:`PyConfig.run_command`), el script (:c:member:`PyConfig.run_filename`) o el módulo (:c:member:`PyConfig.run_module`) especificados en la línea de comandos o en la configuración.

source: By default and when if :option:`-i` option is used, run the REPL.
es_es: Por defecto y cuando se utiliza la opción :option:`-i`, ejecuta el REPL.

source: Finally, finalizes Python and returns an exit status that can be passed to the ``exit()`` function.
es_es: Por último, finaliza Python y devuelve un estado de salida que se puede pasar a la función ``exit()``.

source: See :ref:`Python Configuration <init-python-config>` for an example of customized Python always running in isolated mode using :c:func:`Py_RunMain`.
es_es: Ver :ref:`Configuración de Python <init-python-config>` para un ejemplo de Python personalizado ejecutándose siempre en modo aislado usando :c:func:`Py_RunMain`.

source: Multi-Phase Initialization Private Provisional API
es_es: Inicialización multifase API privada provisional

source: This section is a private provisional API introducing multi-phase initialization, the core feature of :pep:`432`:
es_es: Esta sección es una API privada provisional que introduce la inicialización multifase, característica central de :pep:`432`:

source: "Core" initialization phase, "bare minimum Python":
es_es: Fase de inicialización "Core", "bare minimum Python":

source: Builtin types;
es_es: Tipos incorporados;

source: Builtin exceptions;
es_es: Excepciones incorporadas;

source: Builtin and frozen modules;
es_es: Módulos integrados y congelados;

source: The :mod:`sys` module is only partially initialized (ex: :data:`sys.path` doesn't exist yet).
es_es: El módulo :mod:`sys` está sólo parcialmente inicializado (ej: :data:`sys.path` no existe todavía).

source: "Main" initialization phase, Python is fully initialized:
es_es: Fase de inicialización "Main", Python está totalmente inicializado:

source: Install and configure :mod:`importlib`;
es_es: Instalar y configurar :mod:`importlib`;

source: Apply the :ref:`Path Configuration <init-path-config>`;
es_es: Aplicar :ref:`Path Configuration <init-path-config>`;

source: Install signal handlers;
es_es: Instalar manejadores de señales;

source: Finish :mod:`sys` module initialization (ex: create :data:`sys.stdout` and :data:`sys.path`);
es_es: Finalizar la inicialización del módulo :mod:`sys` (por ejemplo: crear :data:`sys.stdout` y :data:`sys.path`);

source: Enable optional features like :mod:`faulthandler` and :mod:`tracemalloc`;
es_es: Activar funciones opcionales como :mod:`faulthandler` y :mod:`tracemalloc`;

source: Import the :mod:`site` module;
es_es: Importar el módulo :mod:`site`;

source: Private provisional API:
es_es: API privada provisional:

source: :c:member:`PyConfig._init_main`: if set to ``0``, :c:func:`Py_InitializeFromConfig` stops at the "Core" initialization phase.
es_es: :c:member:`PyConfig._init_main`: si se establece en ``0``, :c:func:`Py_InitializeFromConfig` se detiene en la fase de inicialización "Core".

source: Move to the "Main" initialization phase, finish the Python initialization.
es_es: Pasa a la fase de inicialización "Principal", termina la inicialización de Python.

source: No module is imported during the "Core" phase and the ``importlib`` module is not configured: the :ref:`Path Configuration <init-path-config>` is only applied during the "Main" phase. It may allow to customize Python in Python to override or tune the :ref:`Path Configuration <init-path-config>`, maybe install a custom :data:`sys.meta_path` importer or an import hook, etc.
es_es: No se importa ningún módulo durante la fase "Core" y no se configura el módulo ``importlib``: el :ref:`Path Configuration <init-path-config>` sólo se aplica durante la fase "Main". Puede permitir personalizar Python en Python para anular o ajustar el :ref:`Path Configuration <init-path-config>`, tal vez instalar un importador personalizado :data:`sys.meta_path` o un gancho de importación, etc.

source: It may become possible to calculate the :ref:`Path Configuration <init-path-config>` in Python, after the Core phase and before the Main phase, which is one of the :pep:`432` motivation.
es_es: Puede llegar a ser posible calcular la :ref:`Configuración de la ruta <init-path-config>` en Python, después de la fase Core y antes de la fase Main, que es una de las motivaciones de :pep:`432`.

source: The "Core" phase is not properly defined: what should be and what should not be available at this phase is not specified yet. The API is marked as private and provisional: the API can be modified or even be removed anytime until a proper public API is designed.
es_es: La fase "Core" no está bien definida: aún no se ha especificado qué debe estar y qué no debe estar disponible en esta fase. La API está marcada como privada y provisional: la API puede modificarse o incluso eliminarse en cualquier momento hasta que se diseñe una API pública adecuada.

source: Example running Python code between "Core" and "Main" initialization phases::
es_es: Ejemplo de ejecución de código Python entre las fases de inicialización "Core" y "Main"::

source: void init_python(void) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); config._init_main = 0; /* ... customize 'config' configuration ... */ status = Py_InitializeFromConfig(&config); PyConfig_Clear(&config); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } /* Use sys.stderr because sys.stdout is only created by _Py_InitializeMain() */ int res = PyRun_SimpleString( "import sys; " "print('Run Python code before _Py_InitializeMain', " "file=sys.stderr)"); if (res < 0) { exit(1); } /* ... put more configuration code here ... */ status = _Py_InitializeMain(); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } }
es_es: void init_python(void) { PyStatus status; PyConfig config; PyConfig_InitPythonConfig(&config); config._init_main = 0; /* ... customize 'config' configuration ... */ status = Py_InitializeFromConfig(&config); PyConfig_Clear(&config); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } /* Utilice sys.stderr porque sys.stdout solo se crea by _Py_InitializeMain() */ int res = PyRun_SimpleString( "import sys; " "print('Run Python code before _Py_InitializeMain', " "file=sys.stderr)"); if (res < 0) { exit(1); } /* ...ponga más código de configuración aquí ... */ status = _Py_InitializeMain(); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } }
