Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: es_es, sv

source: Exit Python with the specified exit code.
es_es: Salir de Python con el código de salida especificado.
sv: Avsluta Python med den angivna exit-koden.

source: Functions to handle a status:
es_es: Funciones para gestionar un estado:
sv: Funktioner för att hantera en status:

source: Is the status an error or an exit? If true, the exception must be handled; by calling :c:func:`Py_ExitStatusException` for example.
es_es: ¿El estado es un error o una salida? Si es verdadero, la excepción se debe tratar; por ejemplo, llamando a :c:func:`Py_ExitStatusException`.
sv: Är statusen ett fel eller en exit? Om true måste undantaget hanteras, t.ex. genom att anropa :c:func:`Py_ExitStatusException`.

source: Is the result an error?
es_es: ¿El resultado es un error?
sv: Är resultatet ett fel?

source: Is the result an exit?
es_es: ¿El resultado es una salida?
sv: Är resultatet en exit?

source: Call ``exit(exitcode)`` if *status* is an exit. Print the error message and exit with a non-zero exit code if *status* is an error. Must only be called if ``PyStatus_Exception(status)`` is non-zero.
es_es: Llamar a ``exit(exitcode)`` si *status* es una salida. Imprime el mensaje de error y sale con un código de salida distinto de cero si *status* es un error. Sólo debe llamarse si ``PyStatus_Exception(status)`` es distinto de cero.
sv: Anropa ``exit(exitcode)`` om *status* är en exit. Skriv ut felmeddelandet och avsluta med en utgångskod som inte är noll om *status* är ett fel. Får endast anropas om ``PyStatus_Exception(status)`` inte är noll.

source: Internally, Python uses macros which set ``PyStatus.func``, whereas functions to create a status set ``func`` to ``NULL``.
es_es: Internamente, Python utiliza macros que establecen ``PyStatus.func``, mientras que las funciones para crear un estado establecen ``func`` a ``NULL``.
sv: Internt använder Python makron som sätter ``PyStatus.func``, medan funktioner för att skapa en status sätter ``func`` till ``NULL``.

source: Example::
es_es: Ejemplo::
sv: Exempel::

source: PyStatus alloc(void **ptr, size_t size) { *ptr = PyMem_RawMalloc(size); if (*ptr == NULL) { return PyStatus_NoMemory(); } return PyStatus_Ok(); } int main(int argc, char **argv) { void *ptr; PyStatus status = alloc(&ptr, 16); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } PyMem_Free(ptr); return 0; }
sv: PyStatus alloc(void **ptr, size_t size) { *ptr = PyMem_RawMalloc(size); om (*ptr == NULL) { return PyStatus_NoMemory(); } return PyStatus_Ok(); } int main(int argc, char **argv) { void *ptr; PyStatus status = alloc(&ptr, 16); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } PyMem_Free(ptr); return 0; }

source: Structure used to preinitialize Python.
es_es: Estructura utilizada para preinicializar Python.
sv: Struktur som används för att förinitialisera Python.

source: Function to initialize a preconfiguration:
es_es: Función para inicializar una preconfiguración:
sv: Funktion för att initiera en förkonfiguration:

source: Initialize the preconfiguration with :ref:`Python Configuration <init-python-config>`.
es_es: Inicializar la preconfiguración con :ref:`Python Configuration <init-python-config>`.
sv: Initiera förkonfigurationen med :ref:`Python Configuration <init-python-config>`.

source: Initialize the preconfiguration with :ref:`Isolated Configuration <init-isolated-conf>`.
es_es: Inicialice la preconfiguración con :ref:`Isolated Configuration <init-isolated-conf>`.
sv: Initiera förkonfigurationen med :ref:`Isolated Configuration <init-isolated-conf>`.

source: Name of the Python memory allocators:
es_es: Nombre de los asignadores de memoria de Python:
sv: Namn på Pythons minnesallokatorer:

source: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): don't change memory allocators (use defaults).
es_es: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): no cambie los asignadores de memoria (utilice los predeterminados).
sv: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): ändra inte minnesallokatorer (använd standardvärden).

source: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:`default memory allocators <default-memory-allocators>`.
sv: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:``standard minnesallokatorer <default-memory-allocators>`.

source: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): use ``malloc()`` of the C library.
es_es: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): utiliza ``malloc()`` de la biblioteca C.
sv: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): använd ``malloc()`` från C-biblioteket.

source: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): force usage of ``malloc()`` with :ref:`debug hooks <pymem-debug-hooks>`.
es_es: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): fuerza el uso de ``malloc()`` con :ref:`debug hooks <pymem-debug-hooks>`.
sv: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): tvinga fram användning av ``malloc()`` med :ref:`debug hooks <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Python pymalloc memory allocator <pymalloc>` with :ref:`debug hooks <pymem-debug-hooks>`.
es_es: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Python pymalloc memory allocator <pymalloc>` con :ref:`debug hooks <pymem-debug-hooks>`.
sv: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Python pymalloc memory allocator <pymalloc>` med :ref:`debug hooks <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_MIMALLOC`` (``6``): use ``mimalloc``, a fast malloc replacement.
sv: ``PYMEM_ALLOCATOR_MIMALLOC`` (``6``): Använd ``mimalloc``, en snabb malloc-ersättning.

source: ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` (``7``): use ``mimalloc``, a fast malloc replacement with :ref:`debug hooks <pymem-debug-hooks>`.
sv: ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` (``7``): Använd ``mimalloc``, en snabb malloc-ersättning med :ref:`debug-krokar <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` and ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-pymalloc <--without-pymalloc>`.
es_es: ``PYMEM_ALLOCATOR_PYMALLOC`` y ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` no están soportados si Python es :option:`configured using --without-pymalloc <--without-pymalloc>`.
sv: ``PYMEM_ALLOCATOR_PYMALLOC`` och ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` stöds inte om Python är :option:`konfigurerat med --without-pymalloc <--without-pymalloc>`.

source: ``PYMEM_ALLOCATOR_MIMALLOC`` and ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-mimalloc <--without-mimalloc>` or if the underlying atomic support isn't available.
sv: ``PYMEM_ALLOCATOR_MIMALLOC`` och ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` stöds inte om Python är :option:`konfigurerad med --without-mimalloc <--without-mimalloc>` eller om det underliggande atomära stödet inte är tillgängligt.

source: See :ref:`Memory Management <memory>`.
es_es: Véase :ref:`Gestión de memoria <memory>`.
sv: Se :ref:`Memory Management <memory>`.

source: Default: ``PYMEM_ALLOCATOR_NOT_SET``.
es_es: Por defecto: ``PYMEM_ALLOCATOR_NOT_SET``.
sv: Standard: ``PYMEM_ALLOCATOR_NOT_SET``.

source: Set the LC_CTYPE locale to the user preferred locale.
es_es: Establece la configuración LC_CTYPE a la configuración regional preferida por el usuario.
sv: Ställ in LC_CTYPE locale till den locale som användaren föredrar.

source: If equals to ``0``, set :c:member:`~PyPreConfig.coerce_c_locale` and :c:member:`~PyPreConfig.coerce_c_locale_warn` members to ``0``.
es_es: Si es igual a ``0``, establezca los miembros :c:member:`~PyPreConfig.coerce_c_locale` y :c:member:`~PyPreConfig.coerce_c_locale_warn` en ``0``.
sv: Om lika med ``0``, sätt medlemmarna :c:member:`~PyPreConfig.coerce_c_locale` och :c:member:`~PyPreConfig.coerce_c_locale_warn` till ``0``.

source: See the :term:`locale encoding`.
es_es: Véase el :term:`locale encoding`.
sv: Se :term:`locale encoding`.

source: Default: ``1`` in Python config, ``0`` in isolated config.
es_es: Por defecto: ``1`` en configuración Python, ``0`` en configuración aislada.
sv: Standard: ``1`` i Python-konfiguration, ``0`` i isolerad konfiguration.

source: If equals to ``2``, coerce the C locale.
es_es: Si es igual a ``2``, coacciona la configuración regional C.
sv: Om lika med ``2``, tvinga fram C locale.

source: If equals to ``1``, read the LC_CTYPE locale to decide if it should be coerced.
es_es: Si es igual a ``1``, lee la configuración regional LC_CTYPE para decidir si se debe forzar.
sv: Om lika med ``1``, läs LC_CTYPE locale för att avgöra om den ska tvingas.

source: Default: ``-1`` in Python config, ``0`` in isolated config.
es_es: Por defecto: ``-1`` en Python config, ``0`` en configuración aislada.
sv: Standard: ``-1`` i Python-konfiguration, ``0`` i isolerad konfiguration.

source: If non-zero, emit a warning if the C locale is coerced.
es_es: Si es distinto de cero, emite una advertencia si la configuración regional de C está forzada.
sv: Om ej noll, avge en varning om C-landets språk är tvingat.

source: :ref:`Python Development Mode <devmode>`: see :c:member:`PyConfig.dev_mode`.
es_es: :ref:`Python Development Mode <devmode>`: ver :c:member:`PyConfig.dev_mode`.
sv: :ref:`Python Development Mode <devmode>`: se :c:member:`PyConfig.dev_mode`.

source: Default: ``-1`` in Python mode, ``0`` in isolated mode.
es_es: Por defecto: ``-1`` en modo Python, ``0`` en modo aislado.
sv: Standard: ``-1`` i Python-läge, ``0`` i isolerat läge.

source: Isolated mode: see :c:member:`PyConfig.isolated`.
es_es: Modo aislado: ver :c:member:`PyConfig.isolated`.
sv: Isolerat läge: se :c:member:`PyConfig.isolated`.

source: Default: ``0`` in Python mode, ``1`` in isolated mode.
es_es: Por defecto: ``0`` en modo Python, ``1`` en modo aislado.
sv: Standard: ``0`` i Python-läge, ``1`` i isolerat läge.

source: If non-zero:
es_es: Si es distinto de cero:
sv: Om ej noll:

source: Set :c:member:`PyPreConfig.utf8_mode` to ``0``,
es_es: Configura :c:member:`PyPreConfig.utf8_mode` en ``0``,
sv: Sätt :c:member:`PyPreConfig.utf8_mode` till ``0``,

source: Set :c:member:`PyConfig.filesystem_encoding` to ``"mbcs"``,
es_es: Configura :c:member:`PyConfig.filesystem_encoding` en ``"mbcs"``,
sv: Sätt :c:member:`PyConfig.filesystem_encoding` till ``"mbcs"``,

source: Set :c:member:`PyConfig.filesystem_errors` to ``"replace"``.
es_es: Configura :c:member:`PyConfig.filesystem_errors` en ``"replace"``.
sv: Sätt :c:member:`PyConfig.filesystem_errors` till ``"replace"``.

source: Initialized from the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable value.
es_es: Inicializado a partir del valor de la variable de entorno :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.
sv: Initialiseras från miljövariabelns värde :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.

source: Only available on Windows. ``#ifdef MS_WINDOWS`` macro can be used for Windows specific code.
es_es: Sólo disponible en Windows. ``#ifdef MS_WINDOWS`` macro puede utilizarse para código específico de Windows.
sv: Endast tillgängligt på Windows. makrot ``#ifdef MS_WINDOWS`` kan användas för Windows-specifik kod.

source: Default: ``0``.
es_es: Por defecto: ``0``.
sv: Standard: ``0``.

source: If non-zero, :c:func:`Py_PreInitializeFromArgs` and :c:func:`Py_PreInitializeFromBytesArgs` parse their ``argv`` argument the same way the regular Python parses command line arguments: see :ref:`Command Line Arguments <using-on-cmdline>`.
es_es: Si es distinto de cero, :c:func:`Py_PreInitializeFromArgs` y :c:func:`Py_PreInitializeFromBytesArgs` analizan su argumento ``argv`` de la misma forma que Python analiza los argumentos de la línea de comandos: ver :ref:`Argumentos de la línea de comandos <using-on-cmdline>`.
sv: Om icke-noll, analyserar :c:func:`Py_PreInitializeFromArgs` och :c:func:`Py_PreInitializeFromBytesArgs` sina ``argv`` argument på samma sätt som vanliga Python analyserar kommandoradsargument: se :ref:`Command Line Arguments <using-on-cmdline>`.

source: Use :ref:`environment variables <using-on-envvars>`? See :c:member:`PyConfig.use_environment`.
es_es: Use :ref:`environment variables <using-on-envvars>`? Ver :c:member:`PyConfig.use_environment`.
sv: Använda :ref:``miljövariabler <using-on-envvars>`? Se :c:member:`PyConfig.use_environment`.

source: Default: ``1`` in Python config and ``0`` in isolated config.
es_es: Por defecto: ``1`` en configuración Python y ``0`` en configuración aislada.
sv: Standard: ``1`` i Python-konfiguration och ``0`` i isolerad konfiguration.

source: If non-zero, enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
es_es: Si es distinto de cero, activa el :ref:`Python UTF-8 Mode <utf8-mode>`.
sv: Om värdet är annat än noll aktiveras :ref:`Python UTF-8 Mode <utf8-mode>`.

source: Set to ``0`` or ``1`` by the :option:`-X utf8 <-X>` command line option and the :envvar:`PYTHONUTF8` environment variable.
es_es: Se establece en ``0`` o ``1`` mediante la opción de línea de comandos :option:`-X utf8 <-X>` y la variable de entorno :envvar:`PYTHONUTF8`.
sv: Sätts till ``0`` eller ``1`` med kommandoradsalternativet :option:`-X utf8 <-X>` och miljövariabeln :envvar:`PYTHONUTF8`.

source: Also set to ``1`` if the ``LC_CTYPE`` locale is ``C`` or ``POSIX``.
es_es: También se establece en ``1`` si la configuración regional de ``LC_CTYPE`` es ``C`` o ``POSIX``.
sv: Sätts också till ``1`` om ``LC_CTYPE`` locale är ``C`` eller ``POSIX``.

source: Default: ``-1`` in Python config and ``0`` in isolated config.
es_es: Por defecto: ``-1`` en configuración Python y ``0`` en configuración aislada.
sv: Standard: ``-1`` i Python-konfiguration och ``0`` i isolerad konfiguration.

source: Preinitialize Python with PyPreConfig
es_es: Preiniciar Python con PyPreConfig
sv: Förinitiera Python med PyPreConfig

source: The preinitialization of Python:
es_es: La preinicialización de Python:
sv: Förinitialisering av Python:

source: Set the Python memory allocators (:c:member:`PyPreConfig.allocator`)
es_es: Establecer los asignadores de memoria de Python (:c:member:`PyPreConfig.allocator`)
sv: Ange Pythons minnesallokatorer (:c:member:`PyPreConfig.allocator`)

source: Configure the LC_CTYPE locale (:term:`locale encoding`)
es_es: Configurar la configuración regional LC_CTYPE (:term:`locale encoding`)
sv: Konfigurera LC_CTYPE-locale (:term:`locale encoding`)

source: Set the :ref:`Python UTF-8 Mode <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)
es_es: Establezca el :ref:`Python UTF-8 Mode<utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)
sv: Ställ in :ref:`Python UTF-8 Mode <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)

source: The current preconfiguration (``PyPreConfig`` type) is stored in ``_PyRuntime.preconfig``.
es_es: La preconfiguración actual (tipo``PyPreConfig`` ) se almacena en ``_PyRuntime.preconfig``.
sv: Den aktuella förkonfigurationen (av typen ``PyPreConfig``) lagras i ``_PyRuntime.preconfig``.

source: Functions to preinitialize Python:
es_es: Funciones para preinicializar Python:
sv: Funktioner för att förinitialisera Python:

source: Preinitialize Python from *preconfig* preconfiguration.
es_es: Preiniciar Python desde *preconfig* preconfiguración.
sv: Förinitiera Python från *preconfig* preconfiguration.

source: *preconfig* must not be ``NULL``.
es_es: *preconfig* no debe ser ``NULL``.
sv: *preconfig* får inte vara ``NULL``.

source: Parse *argv* command line arguments (bytes strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
es_es: Analiza *argv* argumentos de línea de órdenes (cadenas de bytes) si :c:member:`~PyPreConfig.parse_argv` de *preconfig* es distinto de cero.
sv: Analysera *argv* kommandoradsargument (bytessträngar) om :c:member:`~PyPreConfig.parse_argv` i *preconfig* är ung.

source: Parse *argv* command line arguments (wide strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
es_es: Analiza *argv* argumentos de línea de órdenes (cadenas anchas) si :c:member:`~PyPreConfig.parse_argv` de *preconfig* es distinto de cero.
sv: Analysera *argv* kommandoradsargument (breda strängar) om :c:member:`~PyPreConfig.parse_argv` i *preconfig* är ung.

source: The caller is responsible to handle exceptions (error or exit) using :c:func:`PyStatus_Exception` and :c:func:`Py_ExitStatusException`.
es_es: El llamante es responsable de manejar las excepciones (error o salida) utilizando :c:func:`PyStatus_Exception` y :c:func:`Py_ExitStatusException`.
sv: Anroparen ansvarar för att hantera undantag (error eller exit) med hjälp av :c:func:`PyStatus_Exception` och :c:func:`Py_ExitStatusException`.

source: For :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), if Python is initialized with command line arguments, the command line arguments must also be passed to preinitialize Python, since they have an effect on the pre-configuration like encodings. For example, the :option:`-X utf8 <-X>` command line option enables the :ref:`Python UTF-8 Mode <utf8-mode>`.
es_es: Para :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), si Python se inicializa con argumentos de línea de órdenes, los argumentos de línea de órdenes también deben pasarse para preinicializar Python, ya que tienen un efecto sobre la preconfiguración como las codificaciones. Por ejemplo, la opción de línea de órdenes :option:`-X utf8 <-X>` activa el modo :ref:`Python UTF-8 <utf8-mode>`.
sv: För :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), om Python initieras med kommandoradsargument, måste kommandoradsargumenten också skickas för att förinitialisera Python, eftersom de har en effekt på förkonfigurationen som kodningar. Till exempel aktiverar :option:`-X utf8 <-X>` kommandoradsalternativet :ref:`Python UTF-8 Mode <utf8-mode>`.

source: ``PyMem_SetAllocator()`` can be called after :c:func:`Py_PreInitialize` and before :c:func:`Py_InitializeFromConfig` to install a custom memory allocator. It can be called before :c:func:`Py_PreInitialize` if :c:member:`PyPreConfig.allocator` is set to ``PYMEM_ALLOCATOR_NOT_SET``.
es_es: ``PyMem_SetAllocator()`` se puede llamar después de :c:func:`Py_PreInitialize` y antes de :c:func:`Py_InitializeFromConfig` para instalar un asignador de memoria personalizado. Se puede llamar antes de :c:func:`Py_PreInitialize` si :c:member:`PyPreConfig.allocator` se establece en ``PYMEM_ALLOCATOR_NOT_SET``.
sv: ``PyMem_SetAllocator()`` kan anropas efter :c:func:`Py_PreInitialize` och före :c:func:`Py_InitializeFromConfig` för att installera en anpassad minnesallokator. Den kan anropas före :c:func:`Py_PreInitialize` om :c:member:`PyPreConfig.allocator` är satt till ``PYMEM_ALLOCATOR_NOT_SET``.

source: Python memory allocation functions like :c:func:`PyMem_RawMalloc` must not be used before the Python preinitialization, whereas calling directly ``malloc()`` and ``free()`` is always safe. :c:func:`Py_DecodeLocale` must not be called before the Python preinitialization.
es_es: Las funciones de asignación de memoria de Python como :c:func:`PyMem_RawMalloc` no se deben usar antes de la preinicialización de Python, mientras que llamar directamente a ``malloc()`` y ``free()`` es siempre seguro. :c:func:`Py_DecodeLocale` no se debe llamar antes de la preinicialización de Python.
sv: Python-minnesallokeringsfunktioner som :c:func:`PyMem_RawMalloc` får inte användas före Pythons förinitialisering, medan det alltid är säkert att anropa ``malloc()`` och ``free()`` direkt. :c:func:`Py_DecodeLocale` får inte anropas före Pythons förinitialisering.

source: Example using the preinitialization to enable the :ref:`Python UTF-8 Mode <utf8-mode>`::
es_es: Ejemplo de uso de la preinicialización para habilitar :ref:`Python UTF-8 Mode<utf8-mode>`::
sv: Exempel på användning av förinitialisering för att aktivera :ref:`Python UTF-8 Mode <utf8-mode>`::

source: PyStatus status; PyPreConfig preconfig; PyPreConfig_InitPythonConfig(&preconfig); preconfig.utf8_mode = 1; status = Py_PreInitialize(&preconfig); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } /* at this point, Python speaks UTF-8 */ Py_Initialize(); /* ... use Python API here ... */ Py_Finalize();
sv: PyStatus status; PyPreConfig preconfig; PyPreConfig_InitPythonConfig(&preconfig); preconfig.utf8_mode = 1; status = Py_PreInitialize(&preconfig); if (PyStatus_Exception(status)) { Py_ExitStatusException(status); } /* vid denna punkt talar Python UTF-8 */ Py_Initialize(); /* ... använd Python API här ... */ Py_Finalize();

source: Structure containing most parameters to configure Python.
es_es: Estructura que contiene la mayoría de los parámetros para configurar Python.
sv: Struktur som innehåller de flesta parametrar för att konfigurera Python.

source: When done, the :c:func:`PyConfig_Clear` function must be used to release the configuration memory.
es_es: Una vez hecho esto, debe utilizarse la función :c:func:`PyConfig_Clear` para liberar la memoria de configuración.
sv: När detta är gjort måste funktionen :c:func:`PyConfig_Clear` användas för att frigöra konfigurationsminnet.

source: Structure methods:
es_es: Métodos de estructura:
sv: Strukturmetoder:

source: Initialize configuration with the :ref:`Python Configuration <init-python-config>`.
es_es: Inicializar la configuración con el :ref:`Python Configuration <init-python-config>`.
sv: Initiera konfigurationen med :ref:`Python Configuration <init-python-config>`.

source: Initialize configuration with the :ref:`Isolated Configuration <init-isolated-conf>`.
es_es: Inicialice la configuración con :ref:`Isolated Configuration <init-isolated-conf>`.
sv: Initiera konfigurationen med :ref:`Isolated Configuration <init-isolated-conf>`.

source: Copy the wide character string *str* into ``*config_str``.
es_es: Copie la cadena de caracteres anchos *str* en ``*config_str``.
sv: Kopiera den breda teckensträngen *str* till ``*config_str``.

source: :ref:`Preinitialize Python <c-preinit>` if needed.
es_es: :ref:`Preinitialize Python <c-preinit>` si es necesario.
sv: :ref:`Preinitialize Python <c-preinit>` om det behövs.

source: Decode *str* using :c:func:`Py_DecodeLocale` and set the result into ``*config_str``.
es_es: Decodifica *str* usando :c:func:`Py_DecodeLocale` y coloca el resultado en ``*config_str``.
sv: Avkoda *str* med :c:func:`Py_DecodeLocale` och lägg in resultatet i ``*config_str``.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of wide character strings.
es_es: Establece los argumentos de la línea de comandos (:c:member:`~PyConfig.argv` miembro de *config*) a partir de la lista *argv* de cadenas de caracteres anchos.
sv: Ange kommandoradsargument (:c:member:`~PyConfig.argv` member of *config*) från listan *argv* med breda teckensträngar.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of bytes strings. Decode bytes using :c:func:`Py_DecodeLocale`.
es_es: Establecer argumentos de línea de comandos (:c:member:`~PyConfig.argv` miembro de *config*) a partir de la lista *argv* de cadenas de bytes. Decodificar bytes usando :c:func:`Py_DecodeLocale`.
sv: Ange kommandoradsargument (:c:member:`~PyConfig.argv` member of *config*) från listan *argv* med bytessträngar. Avkoda bytes med hjälp av :c:func:`Py_DecodeLocale`.

source: Set the list of wide strings *list* to *length* and *items*.
es_es: Establece la lista de cadenas anchas *list* a *length* e *items*.
sv: Ställ in listan med breda strängar *list* till *length* och *items*.

source: Read all Python configuration.
es_es: Leer toda la configuración de Python.
sv: Läs alla Python-konfigurationer.

source: Fields which are already initialized are left unchanged.
es_es: Los campos ya inicializados no se modifican.
sv: Fält som redan är initialiserade lämnas oförändrade.
