Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/mapping.po
Languages: es_es, pt_pt

source: Mapping Protocol
es_es: Protocolo de mapeo
pt_pt: Protocolo de mapeamento

source: See also :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` and :c:func:`PyObject_DelItem`.
es_es: Ver también :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` y :c:func:`PyObject_DelItem`.
pt_pt: Veja também :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` e :c:func:`PyObject_DelItem`.

source: Return ``1`` if the object provides the mapping protocol or supports slicing, and ``0`` otherwise. Note that it returns ``1`` for Python classes with a :meth:`~object.__getitem__` method, since in general it is impossible to determine what type of keys the class supports. This function always succeeds.
es_es: Devuelve ``1`` si el objeto proporciona el protocolo de mapeo o soporta slicing, y ``0`` en caso contrario. Observe que devuelve ``1`` para clases Python con un método :meth:`~object.__getitem__`, ya que en general es imposible determinar qué tipo de claves soporta la clase. Esta función siempre tiene éxito.
pt_pt: Retorne ``1`` se o objeto fornecer o protocolo de mapeamento ou suportar slicing, e ``0`` caso contrário. Observe que ele retorna ``1`` para classes Python com um método :meth:`~object.__getitem__`, já que, em geral, é impossível determinar que tipo de chaves a classe suporta. Esta função sempre é bem-sucedida.

source: Returns the number of keys in object *o* on success, and ``-1`` on failure. This is equivalent to the Python expression ``len(o)``.
es_es: Devuelve el número de claves del objeto *o* en caso de éxito, y ``-1`` en caso de fallo. Esto es equivalente a la expresión de Python ``len(o)``.
pt_pt: Retorna o número de chaves no objeto *o* em caso de sucesso e ``-1`` em caso de falha. Isso é equivalente à expressão Python ``len(o)``.

source: This is the same as :c:func:`PyObject_GetItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Es lo mismo que :c:func:`PyObject_GetItem`, pero *key* se especifica como una cadena de bytes :c:expr:`const char*` codificada en UTF-8, en lugar de :c:expr:`PyObject*`.
pt_pt: É o mesmo que :c:func:`PyObject_GetItem`, mas *key* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de :c:expr:`PyObject*`.

source: Variant of :c:func:`PyObject_GetItem` which doesn't raise :exc:`KeyError` if the key is not found.
pt_pt: Variante de :c:func:`PyObject_GetItem` que não gera :exc:`KeyError` se a chave não for encontrada.

source: If the key is found, return ``1`` and set *\*result* to a new :term:`strong reference` to the corresponding value. If the key is not found, return ``0`` and set *\*result* to ``NULL``; the :exc:`KeyError` is silenced. If an error other than :exc:`KeyError` is raised, return ``-1`` and set *\*result* to ``NULL``.
pt_pt: Se a chave for encontrada, retorne ``1`` e defina *\*result* como uma nova :term:`referência forte` para o valor correspondente. Se a chave não for encontrada, retorne ``0`` e defina *\*result* como ``NULL``; o :exc:`KeyError` será silenciado. Se for levantado um erro diferente de :exc:`KeyError`, retorne ``-1`` e defina *\*result* como ``NULL``.

source: This is the same as :c:func:`PyMapping_GetOptionalItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_pt: É igual a :c:func:`PyMapping_GetOptionalItem`, mas *key* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de :c:expr:`PyObject*`.

source: This is the same as :c:func:`PyObject_SetItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Es lo mismo que :c:func:`PyObject_SetItem`, pero *key* se especifica como una cadena de bytes :c:expr:`const char*` codificada en UTF-8, en lugar de :c:expr:`PyObject*`.
pt_pt: É o mesmo que :c:func:`PyObject_SetItem`, mas *key* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de :c:expr:`PyObject*`.

source: This is an alias of :c:func:`PyObject_DelItem`.
es_es: Se trata de un alias de :c:func:`PyObject_DelItem`.
pt_pt: Este é um alias de :c:func:`PyObject_DelItem`.

source: This is the same as :c:func:`PyObject_DelItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Es lo mismo que :c:func:`PyObject_DelItem`, pero *key* se especifica como una cadena de bytes :c:expr:`const char*` codificada en UTF-8, en lugar de :c:expr:`PyObject*`.
pt_pt: É o mesmo que :c:func:`PyObject_DelItem`, mas *key* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de :c:expr:`PyObject*`.

source: Return ``1`` if the mapping object has the key *key* and ``0`` otherwise. This is equivalent to the Python expression ``key in o``. On failure, return ``-1``.
pt_pt: Retorne ``1`` se o objeto de mapeamento tiver a chave *key* e ``0`` caso contrário. Isso é equivalente à expressão Python ``key in o``. Em caso de falha, retorne ``-1``.

source: This is the same as :c:func:`PyMapping_HasKeyWithError`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_pt: É o mesmo que :c:func:`PyMapping_HasKeyWithError`, mas *key* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de :c:expr:`PyObject*`.

source: Return ``1`` if the mapping object has the key *key* and ``0`` otherwise. This is equivalent to the Python expression ``key in o``. This function always succeeds.
es_es: Devuelve ``1`` si el objeto de mapeo tiene la clave *key* y ``0`` en caso contrario. Esto es equivalente a la expresión de Python ``key in o``. Esta función siempre tiene éxito.
pt_pt: Retorne ``1`` se o objeto de mapeamento tiver a chave *key* e ``0`` caso contrário. Isso é equivalente à expressão Python ``key in o``. Esta função sempre é bem-sucedida.

source: Exceptions which occur when this calls :meth:`~object.__getitem__` method are silently ignored. For proper error handling, use :c:func:`PyMapping_HasKeyWithError`, :c:func:`PyMapping_GetOptionalItem` or :c:func:`PyObject_GetItem()` instead.
pt_pt: As exceções que ocorrem quando este método :meth:`~object.__getitem__` é chamado são silenciosamente ignoradas. Para um tratamento adequado de erros, use :c:func:`PyMapping_HasKeyWithError`, :c:func:`PyMapping_GetOptionalItem` ou :c:func:`PyObject_GetItem()` em vez disso.

source: This is the same as :c:func:`PyMapping_HasKey`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Es lo mismo que :c:func:`PyMapping_HasKey`, pero *key* se especifica como una cadena de bytes :c:expr:`const char*` codificada en UTF-8, en lugar de :c:expr:`PyObject*`.
pt_pt: É o mesmo que :c:func:`PyMapping_HasKey`, mas *key* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de :c:expr:`PyObject*`.

source: Exceptions that occur when this calls :meth:`~object.__getitem__` method or while creating the temporary :class:`str` object are silently ignored. For proper error handling, use :c:func:`PyMapping_HasKeyStringWithError`, :c:func:`PyMapping_GetOptionalItemString` or :c:func:`PyMapping_GetItemString` instead.
pt_pt: As exceções que ocorrem quando este método chama :meth:`~object.__getitem__` ou durante a criação do objeto temporário :class:`str` são silenciosamente ignoradas. Para um tratamento adequado de erros, use :c:func:`PyMapping_HasKeyStringWithError`, :c:func:`PyMapping_GetOptionalItemString` ou :c:func:`PyMapping_GetItemString` em vez disso.

source: On success, return a list of the keys in object *o*. On failure, return ``NULL``.
es_es: En caso de éxito, devuelve una lista de las claves del objeto *o*. En caso de error, devuelve ``NULL``.
pt_pt: Em caso de sucesso, retorne uma lista das chaves no objeto *o*. Em caso de falha, retorne ``NULL``.

source: Previously, the function returned a list or a tuple.
es_es: Antes, la función devolvía una lista o una tupla.
pt_pt: Anteriormente, a função retornava uma lista ou uma tupla.

source: On success, return a list of the values in object *o*. On failure, return ``NULL``.
es_es: En caso de éxito, devuelve una lista de los valores del objeto *o*. En caso de error, devuelve ``NULL``.
pt_pt: Em caso de sucesso, retorne uma lista dos valores no objeto *o*. Em caso de falha, retorne ``NULL``.

source: On success, return a list of the items in object *o*, where each item is a tuple containing a key-value pair. On failure, return ``NULL``.
es_es: En caso de éxito, devuelve una lista de los elementos del objeto *o*, donde cada elemento es una tupla que contiene un par clave-valor. En caso de error, devuelve ``NULL``.
pt_pt: Em caso de sucesso, retorne uma lista dos itens no objeto *o*, onde cada item é uma tupla contendo um par chave-valor. Em caso de falha, retorne ``NULL``.

source: built-in function
es_es: función incorporada
pt_pt: função incorporada

source: Exceptions which occur when this calls :meth:`~object.__getitem__` method are silently ignored. For proper error handling, use :c:func:`PyObject_GetItem()` instead.
es_es: Las excepciones que se producen cuando se llama al método :meth:`~object.__getitem__` se ignoran silenciosamente. Para una correcta gestión de errores, utilice :c:func:`PyObject_GetItem()` en su lugar.

source: Exceptions that occur when this calls :meth:`~object.__getitem__` method or while creating the temporary :class:`str` object are silently ignored. For proper error handling, use :c:func:`PyMapping_GetItemString` instead.
es_es: Las excepciones que se producen cuando se llama al método :meth:`~object.__getitem__` o mientras se crea el objeto temporal :class:`str` se ignoran silenciosamente. Para una correcta gestión de errores, utilice :c:func:`PyMapping_GetItemString` en su lugar.
