Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/memory.po
Languages: pt_pt

source: Debug build, without pymalloc
pt_pt: Compilação de depuração, sem pymalloc

source: Legend:
pt_pt: Legenda:

source: Name: value for :envvar:`PYTHONMALLOC` environment variable.
pt_pt: Nome: valor para a variável de ambiente :envvar:`PYTHONMALLOC`.

source: ``malloc``: system allocators from the standard C library, C functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`.
pt_pt: ``malloc``: alocadores do sistema da biblioteca C padrão, funções C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` e :c:func:`free`.

source: ``pymalloc``: :ref:`pymalloc memory allocator <pymalloc>`.
pt_pt: ``pymalloc``: :ref:`alocador de memória pymalloc <pymalloc>`.

source: ``mimalloc``: :ref:`mimalloc memory allocator <mimalloc>`. The pymalloc allocator will be used if mimalloc support isn't available.
pt_pt: ``mimalloc``: :ref:`alocador de memória mimalloc <mimalloc>`. O alocador pymalloc será usado se o suporte para mimalloc não estiver disponível.

source: "+ debug": with :ref:`debug hooks on the Python memory allocators <pymem-debug-hooks>`.
pt_pt: "+ depuração": com :ref:`ganchos de depuração nos alocadores de memória do Python <pymem-debug-hooks>`.

source: "Debug build": :ref:`Python build in debug mode <debug-build>`.
pt_pt: "Compilação de depuração": :ref:`compilação do Python em modo de depuração <debug-build>`.

source: Customize Memory Allocators
pt_pt: Personalizar Alocadores de Memória

source: Structure used to describe a memory block allocator. The structure has the following fields:
pt_pt: Estrutura usada para descrever um alocador de blocos de memória. A estrutura tem os seguintes campos:

source: Field
pt_pt: Campo

source: Meaning
pt_pt: Significado

source: user context passed as first argument
pt_pt: contexto do utilizador passado como primeiro argumento

source: allocate a memory block
pt_pt: alocar um bloco de memória

source: allocate a memory block initialized with zeros
pt_pt: alocar um bloco de memória inicializado com zeros

source: allocate or resize a memory block
pt_pt: alocar ou redimensionar um bloco de memória

source: free a memory block
pt_pt: libertar um bloco de memória

source: The :c:type:`!PyMemAllocator` structure was renamed to :c:type:`PyMemAllocatorEx` and a new ``calloc`` field was added.
pt_pt: A estrutura :c:type:`!PyMemAllocator` foi renomeada para :c:type:`PyMemAllocatorEx` e foi adicionado um novo campo ``calloc``.

source: Enum used to identify an allocator domain. Domains:
pt_pt: Enum usado para identificar um domínio de alocação. Domínios:

source: Functions:
pt_pt: Funções:

source: Get the memory block allocator of the specified domain.
pt_pt: Obter o alocador de blocos de memória do domínio especificado.

source: Set the memory block allocator of the specified domain.
pt_pt: Definir o alocador de blocos de memória do domínio especificado.

source: The new allocator must return a distinct non-``NULL`` pointer when requesting zero bytes.
pt_pt: O novo alocador deve retornar um ponteiro não-``NULL`` distinto ao solicitar zero bytes.

source: If the new allocator is not a hook (does not call the previous allocator), the :c:func:`PyMem_SetupDebugHooks` function must be called to reinstall the debug hooks on top on the new allocator.
pt_pt: Se o novo alocador não for um *hook* (não chama o alocador anterior), a função :c:func:`PyMem_SetupDebugHooks` deve ser chamada para reinstalar os *hooks* de depuração no novo alocador.

source: See also :c:member:`PyPreConfig.allocator` and :ref:`Preinitialize Python with PyPreConfig <c-preinit>`.
pt_pt: Veja também :c:member:`PyPreConfig.allocator` e :ref:`Pré-inicializar o Python com PyPreConfig <c-preinit>`.

source: :c:func:`PyMem_SetAllocator` does have the following contract:
pt_pt: :c:func:`PyMem_SetAllocator` tem o seguinte contrato:

source: If called after Python has finish initializing (after :c:func:`Py_InitializeFromConfig` has been called) the allocator **must** wrap the existing allocator. Substituting the current allocator for some other arbitrary one is **not supported**.
pt_pt: Se chamada após o Python ter terminado a inicialização (após :c:func:`Py_InitializeFromConfig` ter sido chamada), o alocador **deve** encapsular o alocador existente. Substituir o alocador atual por outro arbitrário **não é suportado**.

source: All allocators must be thread-safe.
pt_pt: Todos os alocadores devem ser *thread-safe*.

source: Setup :ref:`debug hooks in the Python memory allocators <pymem-debug-hooks>` to detect memory errors.
pt_pt: Configurar :ref:`*hooks* de depuração nos alocadores de memória do Python <pymem-debug-hooks>` para detetar erros de memória.

source: Debug hooks on the Python memory allocators
pt_pt: *Hooks* de depuração nos alocadores de memória do Python

source: When :ref:`Python is built in debug mode <debug-build>`, the :c:func:`PyMem_SetupDebugHooks` function is called at the :ref:`Python preinitialization <c-preinit>` to setup debug hooks on Python memory allocators to detect memory errors.
pt_pt: Quando o :ref:`Python é compilado em modo de depuração <debug-build>`, a função :c:func:`PyMem_SetupDebugHooks` é chamada durante a :ref:`pré-inicialização do Python <c-preinit>` para configurar *hooks* de depuração nos alocadores de memória do Python e detetar erros de memória.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to install debug hooks on a Python compiled in release mode (ex: ``PYTHONMALLOC=debug``).
pt_pt: A variável de ambiente :envvar:`PYTHONMALLOC` pode ser usada para instalar *hooks* de depuração num Python compilado em modo de lançamento (ex: ``PYTHONMALLOC=debug``).

source: The :c:func:`PyMem_SetupDebugHooks` function can be used to set debug hooks after calling :c:func:`PyMem_SetAllocator`.
pt_pt: A função :c:func:`PyMem_SetupDebugHooks` pode ser usada para definir *hooks* de depuração após chamar :c:func:`PyMem_SetAllocator`.

source: These debug hooks fill dynamically allocated memory blocks with special, recognizable bit patterns. Newly allocated memory is filled with the byte ``0xCD`` (``PYMEM_CLEANBYTE``), freed memory is filled with the byte ``0xDD`` (``PYMEM_DEADBYTE``). Memory blocks are surrounded by "forbidden bytes" filled with the byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Strings of these bytes are unlikely to be valid addresses, floats, or ASCII strings.
pt_pt: Estes *hooks* de depuração preenchem blocos de memória alocados dinamicamente com padrões de bits especiais e reconhecíveis. A memória recém-alocada é preenchida com o byte ``0xCD`` (``PYMEM_CLEANBYTE``), a memória libertada é preenchida com o byte ``0xDD`` (``PYMEM_DEADBYTE``). Os blocos de memória são rodeados por "bytes proibidos" preenchidos com o byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Cadeias destes bytes são improváveis de serem endereços, floats ou cadeias ASCII válidos.

source: Runtime checks:
pt_pt: Verificações em tempo de execução:

source: Detect API violations. For example, detect if :c:func:`PyObject_Free` is called on a memory block allocated by :c:func:`PyMem_Malloc`.
pt_pt: Detetar violações da API. Por exemplo, detetar se :c:func:`PyObject_Free` é chamada num bloco de memória alocado por :c:func:`PyMem_Malloc`.

source: Detect write before the start of the buffer (buffer underflow).
pt_pt: Detetar escrita antes do início do buffer (*buffer underflow*).

source: Detect write after the end of the buffer (buffer overflow).
pt_pt: Detetar escrita após o fim do buffer (*buffer overflow*).

source: Check that the :term:`GIL <global interpreter lock>` is held when allocator functions of :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) and :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) domains are called.
pt_pt: Verificar se o :term:`GIL <global interpreter lock>` está retido quando as funções de alocação dos domínios :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) e :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) são chamadas.

source: On error, the debug hooks use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated. The traceback is only displayed if :mod:`tracemalloc` is tracing Python memory allocations and the memory block was traced.
pt_pt: Em caso de erro, os *hooks* de depuração usam o módulo :mod:`tracemalloc` para obter o *traceback* de onde um bloco de memória foi alocado. O *traceback* só é apresentado se o :mod:`tracemalloc` estiver a traçar alocações de memória do Python e o bloco de memória tiver sido traçado.

source: Let *S* = ``sizeof(size_t)``. ``2*S`` bytes are added at each end of each block of *N* bytes requested. The memory layout is like so, where p represents the address returned by a malloc-like or realloc-like function (``p[i:j]`` means the slice of bytes from ``*(p+i)`` inclusive up to ``*(p+j)`` exclusive; note that the treatment of negative indices differs from a Python slice):
pt_pt: Seja *S* = ``sizeof(size_t)``. ``2*S`` bytes são adicionados em cada extremidade de cada bloco de *N* bytes solicitados. O *layout* da memória é como segue, onde p representa o endereço retornado por uma função do tipo malloc ou realloc (``p[i:j]`` significa a fatia de bytes de ``*(p+i)`` inclusive até ``*(p+j)`` exclusivo; note que o tratamento de índices negativos difere de uma fatia Python):

source: Number of bytes originally asked for. This is a size_t, big-endian (easier to read in a memory dump).
pt_pt: Número de bytes originalmente solicitados. Isto é um size_t, em *big-endian* (mais fácil de ler num *dump* de memória).

source: API identifier (ASCII character):
pt_pt: Identificador da API (caractere ASCII):

source: ``'r'`` for :c:macro:`PYMEM_DOMAIN_RAW`.
pt_pt: ``'r'`` para :c:macro:`PYMEM_DOMAIN_RAW`.

source: ``'m'`` for :c:macro:`PYMEM_DOMAIN_MEM`.
pt_pt: ``'m'`` para :c:macro:`PYMEM_DOMAIN_MEM`.

source: ``'o'`` for :c:macro:`PYMEM_DOMAIN_OBJ`.
pt_pt: ``'o'`` para :c:macro:`PYMEM_DOMAIN_OBJ`.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch under- writes and reads.
pt_pt: Cópias de PYMEM_FORBIDDENBYTE. Usado para detetar escritas e leituras abaixo do limite.

source: The requested memory, filled with copies of PYMEM_CLEANBYTE, used to catch reference to uninitialized memory. When a realloc-like function is called requesting a larger memory block, the new excess bytes are also filled with PYMEM_CLEANBYTE. When a free-like function is called, these are overwritten with PYMEM_DEADBYTE, to catch reference to freed memory. When a realloc- like function is called requesting a smaller memory block, the excess old bytes are also filled with PYMEM_DEADBYTE.
pt_pt: A memória solicitada, preenchida com cópias de PYMEM_CLEANBYTE, usada para detetar referências a memória não inicializada. Quando uma função do tipo realloc é chamada solicitando um bloco de memória maior, os novos bytes em excesso também são preenchidos com PYMEM_CLEANBYTE. Quando uma função do tipo free é chamada, estes são sobrescritos com PYMEM_DEADBYTE, para detetar referências a memória libertada. Quando uma função do tipo realloc é chamada solicitando um bloco de memória menor, os bytes antigos em excesso também são preenchidos com PYMEM_DEADBYTE.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch over- writes and reads.
pt_pt: Cópias de PYMEM_FORBIDDENBYTE. Usado para detetar escritas e leituras acima do limite.

source: Only used if the ``PYMEM_DEBUG_SERIALNO`` macro is defined (not defined by default).
pt_pt: Apenas usado se a macro ``PYMEM_DEBUG_SERIALNO`` estiver definida (não definida por predefinição).

source: A serial number, incremented by 1 on each call to a malloc-like or realloc-like function. Big-endian :c:type:`size_t`. If "bad memory" is detected later, the serial number gives an excellent way to set a breakpoint on the next run, to capture the instant at which this block was passed out. The static function bumpserialno() in obmalloc.c is the only place the serial number is incremented, and exists so you can set such a breakpoint easily.
pt_pt: Um número de série, incrementado em 1 em cada chamada a uma função do tipo malloc ou realloc. :c:type:`size_t` em *big-endian*. Se for detetada "memória corrompida" mais tarde, o número de série fornece uma excelente forma de definir um *breakpoint* na próxima execução, para capturar o instante em que este bloco foi passado. A função estática bumpserialno() em obmalloc.c é o único local onde o número de série é incrementado, e existe para que possa definir facilmente tal *breakpoint*.

source: A realloc-like or free-like function first checks that the PYMEM_FORBIDDENBYTE bytes at each end are intact. If they've been altered, diagnostic output is written to stderr, and the program is aborted via Py_FatalError(). The other main failure mode is provoking a memory error when a program reads up one of the special bit patterns and tries to use it as an address. If you get in a debugger then and look at the object, you're likely to see that it's entirely filled with PYMEM_DEADBYTE (meaning freed memory is getting used) or PYMEM_CLEANBYTE (meaning uninitialized memory is getting used).
pt_pt: Uma função do tipo realloc ou free verifica primeiro se os bytes PYMEM_FORBIDDENBYTE em cada extremidade estão intactos. Se tiverem sido alterados, é escrita saída de diagnóstico para stderr, e o programa é abortado via Py_FatalError(). O outro modo principal de falha é provocar um erro de memória quando um programa lê um dos padrões de bits especiais e tenta usá-lo como um endereço. Se entrar num depurador nesse momento e observar o objeto, é provável que veja que está completamente preenchido com PYMEM_DEADBYTE (significando que memória libertada está a ser usada) ou PYMEM_CLEANBYTE (significando que memória não inicializada está a ser usada).

source: Byte patterns ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) and ``0xFB`` (``PYMEM_FORBIDDENBYTE``) have been replaced with ``0xCD``, ``0xDD`` and ``0xFD`` to use the same values than Windows CRT debug ``malloc()`` and ``free()``.
pt_pt: Os padrões de bytes ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) e ``0xFB`` (``PYMEM_FORBIDDENBYTE``) foram substituídos por ``0xCD``, ``0xDD`` e ``0xFD`` para usar os mesmos valores que o ``malloc()`` e ``free()`` de depuração da CRT do Windows.

source: The pymalloc allocator
pt_pt: O alocador pymalloc

source: Python has a *pymalloc* allocator optimized for small objects (smaller or equal to 512 bytes) with a short lifetime. It uses memory mappings called "arenas" with a fixed size of either 256 KiB on 32-bit platforms or 1 MiB on 64-bit platforms. It falls back to :c:func:`PyMem_RawMalloc` and :c:func:`PyMem_RawRealloc` for allocations larger than 512 bytes.
pt_pt: O Python tem um alocador *pymalloc* otimizado para objetos pequenos (menores ou iguais a 512 bytes) com um tempo de vida curto. Utiliza mapeamentos de memória chamados "arenas" com um tamanho fixo de 256 KiB em plataformas de 32 bits ou 1 MiB em plataformas de 64 bits. Recorre a :c:func:`PyMem_RawMalloc` e :c:func:`PyMem_RawRealloc` para alocações maiores que 512 bytes.

source: *pymalloc* is the :ref:`default allocator <default-memory-allocators>` of the :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) and :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) domains.
pt_pt: O *pymalloc* é o :ref:`alocador predefinido <default-memory-allocators>` dos domínios :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) e :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`).

source: The arena allocator uses the following functions:
pt_pt: O alocador de arenas usa as seguintes funções:

source: :c:func:`!VirtualAlloc` and :c:func:`!VirtualFree` on Windows,
pt_pt: :c:func:`!VirtualAlloc` e :c:func:`!VirtualFree` no Windows,

source: :c:func:`!mmap` and :c:func:`!munmap` if available,
pt_pt: :c:func:`!mmap` e :c:func:`!munmap` se disponíveis,

source: :c:func:`malloc` and :c:func:`free` otherwise.
pt_pt: :c:func:`malloc` e :c:func:`free` caso contrário.

source: This allocator is disabled if Python is configured with the :option:`--without-pymalloc` option. It can also be disabled at runtime using the :envvar:`PYTHONMALLOC` environment variable (ex: ``PYTHONMALLOC=malloc``).
pt_pt: Este alocador está desativado se o Python for configurado com a opção :option:`--without-pymalloc`. Também pode ser desativado em tempo de execução usando a variável de ambiente :envvar:`PYTHONMALLOC` (ex: ``PYTHONMALLOC=malloc``).

source: Typically, it makes sense to disable the pymalloc allocator when building Python with AddressSanitizer (:option:`--with-address-sanitizer`) which helps uncover low level bugs within the C code.
pt_pt: Normalmente, faz sentido desativar o alocador pymalloc ao compilar o Python com AddressSanitizer (:option:`--with-address-sanitizer`), que ajuda a descobrir erros de baixo nível no código C.

source: Customize pymalloc Arena Allocator
pt_pt: Personalizar o Alocador de Arenas do pymalloc

source: Structure used to describe an arena allocator. The structure has three fields:
pt_pt: Estrutura usada para descrever um alocador de arenas. A estrutura tem três campos:

source: allocate an arena of size bytes
pt_pt: alocar uma arena de tamanho *bytes*

source: free an arena
pt_pt: libertar uma arena

source: Get the arena allocator.
pt_pt: Obter o alocador de arenas.

source: Set the arena allocator.
pt_pt: Definir o alocador de arenas.

source: The mimalloc allocator
pt_pt: O alocador mimalloc

source: Python supports the mimalloc allocator when the underlying platform support is available. mimalloc "is a general purpose allocator with excellent performance characteristics. Initially developed by Daan Leijen for the runtime systems of the Koka and Lean languages."
pt_pt: O Python suporta o alocador mimalloc quando o suporte da plataforma subjacente estiver disponível. O mimalloc "é um alocador de uso geral com excelentes características de desempenho. Desenvolvido inicialmente por Daan Leijen para os sistemas de execução das linguagens Koka e Lean."

source: tracemalloc C API
pt_pt: API C do tracemalloc

source: Track an allocated memory block in the :mod:`tracemalloc` module.
pt_pt: Rastrear um bloco de memória alocado no módulo :mod:`tracemalloc`.

source: Return ``0`` on success, return ``-1`` on error (failed to allocate memory to store the trace). Return ``-2`` if tracemalloc is disabled.
pt_pt: Retorna ``0`` em caso de sucesso, ``-1`` em caso de erro (falha ao alocar memória para armazenar o rastreio). Retorna ``-2`` se o tracemalloc estiver desativado.

source: If memory block is already tracked, update the existing trace.
pt_pt: Se o bloco de memória já estiver a ser rastreado, atualizar o rastreio existente.

source: Untrack an allocated memory block in the :mod:`tracemalloc` module. Do nothing if the block was not tracked.
pt_pt: Deixar de rastrear um bloco de memória alocado no módulo :mod:`tracemalloc`. Não fazer nada se o bloco não estiver a ser rastreado.

source: Return ``-2`` if tracemalloc is disabled, otherwise return ``0``.
pt_pt: Retorna ``-2`` se o tracemalloc estiver desativado, caso contrário retorna ``0``.

source: Examples
pt_pt: Exemplos

source: Here is the example from section :ref:`memoryoverview`, rewritten so that the I/O buffer is allocated from the Python heap by using the first function set::
pt_pt: Aqui está o exemplo da secção :ref:`memoryoverview`, reescrito de forma a que o buffer de I/O seja alocado a partir do *heap* do Python usando o primeiro conjunto de funções::

source: PyObject *res; char *buf = (char *) PyMem_Malloc(BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); /* ...Do some I/O operation involving buf... */ res = PyBytes_FromString(buf); PyMem_Free(buf); /* allocated with PyMem_Malloc */ return res;
pt_pt: PyObject *res; char *buf = (char *) PyMem_Malloc(BUFSIZ); /* para I/O */ if (buf == NULL) return PyErr_NoMemory(); /* ...Efetuar alguma operação de I/O envolvendo buf... */ res = PyBytes_FromString(buf); PyMem_Free(buf); /* alocado com PyMem_Malloc */ return res;

source: The same code using the type-oriented function set::
pt_pt: O mesmo código usando o conjunto de funções orientadas a tipos::

source: Note that in the two examples above, the buffer is always manipulated via functions belonging to the same set. Indeed, it is required to use the same memory API family for a given memory block, so that the risk of mixing different allocators is reduced to a minimum. The following code sequence contains two errors, one of which is labeled as *fatal* because it mixes two different allocators operating on different heaps. ::
pt_pt: Note que nos dois exemplos acima, o buffer é sempre manipulado através de funções pertencentes ao mesmo conjunto. De facto, é necessário usar a mesma família de API de memória para um determinado bloco de memória, de forma a reduzir ao mínimo o risco de misturar alocadores diferentes. A seguinte sequência de código contém dois erros, um dos quais é rotulado como *fatal* porque mistura dois alocadores que operam em *heaps* diferentes.::

source: These will be explained in the next chapter on defining and implementing new object types in C.
pt_pt: Estas serão explicadas no próximo capítulo sobre a definição e implementação de novos tipos de objetos em C.

source: malloc (C function)
pt_pt: malloc (função C)

source: calloc (C function)
pt_pt: calloc (função C)

source: realloc (C function)
pt_pt: realloc (função C)

source: free (C function)
pt_pt: free (função C)
