Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/memory.po
Languages: pt_pt

source: Memory Management
pt_pt: Gestão de Memória

source: Overview
pt_pt: Visão Geral

source: Memory management in Python involves a private heap containing all Python objects and data structures. The management of this private heap is ensured internally by the *Python memory manager*. The Python memory manager has different components which deal with various dynamic storage management aspects, like sharing, segmentation, preallocation or caching.
pt_pt: A gestão de memória em Python envolve um *heap* privado que contém todos os objetos e estruturas de dados Python. A gestão deste *heap* privado é garantida internamente pelo *gestor de memória do Python*. O gestor de memória do Python tem diferentes componentes que lidam com vários aspetos da gestão dinâmica de armazenamento, como partilha, segmentação, pré-alocação ou cache.

source: At the lowest level, a raw memory allocator ensures that there is enough room in the private heap for storing all Python-related data by interacting with the memory manager of the operating system. On top of the raw memory allocator, several object-specific allocators operate on the same heap and implement distinct memory management policies adapted to the peculiarities of every object type. For example, integer objects are managed differently within the heap than strings, tuples or dictionaries because integers imply different storage requirements and speed/space tradeoffs. The Python memory manager thus delegates some of the work to the object-specific allocators, but ensures that the latter operate within the bounds of the private heap.
pt_pt: Ao nível mais baixo, um alocador de memória bruta garante que existe espaço suficiente no *heap* privado para armazenar todos os dados relacionados com Python, interagindo com o gestor de memória do sistema operativo. Por cima do alocador de memória bruta, vários alocadores específicos de objetos operam no mesmo *heap* e implementam políticas distintas de gestão de memória, adaptadas às particularidades de cada tipo de objeto. Por exemplo, os objetos inteiros são geridos de forma diferente no *heap* em relação a cadeias de caracteres, tuplos ou dicionários, porque os inteiros implicam requisitos de armazenamento e compromissos de velocidade/espaço distintos. O gestor de memória do Python delega, assim, parte do trabalho aos alocadores específicos de objetos, mas garante que estes operam dentro dos limites do *heap* privado.

source: It is important to understand that the management of the Python heap is performed by the interpreter itself and that the user has no control over it, even if they regularly manipulate object pointers to memory blocks inside that heap. The allocation of heap space for Python objects and other internal buffers is performed on demand by the Python memory manager through the Python/C API functions listed in this document.
pt_pt: É importante compreender que a gestão do *heap* do Python é realizada pelo próprio intérprete e que o utilizador não tem controlo sobre ela, mesmo que manipule regularmente ponteiros de objetos para blocos de memória dentro desse *heap*. A alocação de espaço no *heap* para objetos Python e outros buffers internos é realizada sob pedido pelo gestor de memória do Python, através das funções da API C/Python listadas neste documento.

source: To avoid memory corruption, extension writers should never try to operate on Python objects with the functions exported by the C library: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`. This will result in mixed calls between the C allocator and the Python memory manager with fatal consequences, because they implement different algorithms and operate on different heaps. However, one may safely allocate and release memory blocks with the C library allocator for individual purposes, as shown in the following example::
pt_pt: Para evitar corrupção de memória, os programadores de extensões nunca devem tentar operar em objetos Python com as funções exportadas pela biblioteca C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` e :c:func:`free`. Isto resultará em chamadas misturadas entre o alocador C e o gestor de memória do Python, com consequências fatais, porque implementam algoritmos diferentes e operam em *heaps* distintos. No entanto, pode-se alocar e libertar blocos de memória com o alocador da biblioteca C para fins individuais, como mostrado no exemplo seguinte::

source: PyObject *res; char *buf = (char *) malloc(BUFSIZ); /* for I/O */ if (buf == NULL) return PyErr_NoMemory(); ...Do some I/O operation involving buf... res = PyBytes_FromString(buf); free(buf); /* malloc'ed */ return res;
pt_pt: PyObject *res; char *buf = (char *) malloc(BUFSIZ); /* para I/O */ if (buf == NULL) return PyErr_NoMemory(); ...Efetuar alguma operação de I/O envolvendo buf... res = PyBytes_FromString(buf); free(buf); /* alocado com malloc */ return res;

source: In this example, the memory request for the I/O buffer is handled by the C library allocator. The Python memory manager is involved only in the allocation of the bytes object returned as a result.
pt_pt: Neste exemplo, o pedido de memória para o buffer de I/O é tratado pelo alocador da biblioteca C. O gestor de memória do Python está envolvido apenas na alocação do objeto bytes retornado como resultado.

source: In most situations, however, it is recommended to allocate memory from the Python heap specifically because the latter is under control of the Python memory manager. For example, this is required when the interpreter is extended with new object types written in C. Another reason for using the Python heap is the desire to *inform* the Python memory manager about the memory needs of the extension module. Even when the requested memory is used exclusively for internal, highly specific purposes, delegating all memory requests to the Python memory manager causes the interpreter to have a more accurate image of its memory footprint as a whole. Consequently, under certain circumstances, the Python memory manager may or may not trigger appropriate actions, like garbage collection, memory compaction or other preventive procedures. Note that by using the C library allocator as shown in the previous example, the allocated memory for the I/O buffer escapes completely the Python memory manager.
pt_pt: Na maioria das situações, no entanto, é recomendado alocar memória a partir do *heap* do Python, especificamente porque este está sob controlo do gestor de memória do Python. Por exemplo, isto é necessário quando o intérprete é estendido com novos tipos de objetos escritos em C. Outra razão para usar o *heap* do Python é o desejo de *informar* o gestor de memória do Python sobre as necessidades de memória do módulo de extensão. Mesmo quando a memória solicitada é usada exclusivamente para fins internos e altamente específicos, delegar todos os pedidos de memória ao gestor de memória do Python faz com que o intérprete tenha uma imagem mais precisa da sua pegada de memória como um todo. Consequentemente, em certas circunstâncias, o gestor de memória do Python pode ou não desencadear ações apropriadas, como recolha de lixo, compactação de memória ou outros procedimentos preventivos. Note que, ao usar o alocador da biblioteca C, como mostrado no exemplo anterior, a memória alocada para o buffer de I/O escapa completamente ao gestor de memória do Python.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to configure the memory allocators used by Python.
pt_pt: A variável de ambiente :envvar:`PYTHONMALLOC` pode ser usada para configurar os alocadores de memória usados pelo Python.

source: The :envvar:`PYTHONMALLOCSTATS` environment variable can be used to print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
pt_pt: A variável de ambiente :envvar:`PYTHONMALLOCSTATS` pode ser usada para imprimir estatísticas do alocador de memória :ref:`pymalloc <pymalloc>` sempre que uma nova arena de objetos pymalloc é criada e no encerramento.

source: Allocator Domains
pt_pt: Domínios de Alocação

source: All allocating functions belong to one of three different "domains" (see also :c:type:`PyMemAllocatorDomain`). These domains represent different allocation strategies and are optimized for different purposes. The specific details on how every domain allocates memory or what internal functions each domain calls is considered an implementation detail, but for debugging purposes a simplified table can be found at :ref:`default-memory-allocators`. The APIs used to allocate and free a block of memory must be from the same domain. For example, :c:func:`PyMem_Free` must be used to free memory allocated using :c:func:`PyMem_Malloc`.
pt_pt: Todas as funções de alocação pertencem a um dos três diferentes "domínios" (consulte também :c:type:`PyMemAllocatorDomain`). Estes domínios representam diferentes estratégias de alocação e são otimizados para diferentes finalidades. Os detalhes específicos sobre como cada domínio aloca memória ou quais funções internas cada domínio chama são considerados detalhes de implementação, mas para fins de depuração, uma tabela simplificada pode ser encontrada em :ref:`default-memory-allocators`. As APIs utilizadas para alocar e liberar um bloco de memória devem ser do mesmo domínio. Por exemplo, :c:func:`PyMem_Free` deve ser utilizado para liberar a memória alocada utilizando :c:func:`PyMem_Malloc`.

source: The three allocation domains are:
pt_pt: Os três domínios de alocação são:

source: Object domain: intended for allocating memory for Python objects. The memory is taken from the Python private heap. See :ref:`Object allocators <objectinterface>`.
pt_pt: Domínio de Objetos: destinado à alocação de memória para objetos Python. A memória é obtida do *heap* privado do Python. Veja :ref:`Alocadores de Objetos <objectinterface>`.

source: The :term:`free-threaded <free threading>` build requires that only Python objects are allocated using the "object" domain and that all Python objects are allocated using that domain. This differs from the prior Python versions, where this was only a best practice and not a hard requirement.
pt_pt: A compilação :term:`free-threaded <free threading>` exige que apenas objetos Python sejam alocados usando o domínio "objeto" e que todos os objetos Python sejam alocados usando esse domínio. Isto difere das versões anteriores do Python, onde isto era apenas uma boa prática e não um requisito obrigatório.

source: For example, buffers (non-Python objects) should be allocated using :c:func:`PyMem_Malloc`, :c:func:`PyMem_RawMalloc`, or :c:func:`malloc`, but not :c:func:`PyObject_Malloc`.
pt_pt: Por exemplo, buffers (objetos não-Python) devem ser alocados usando :c:func:`PyMem_Malloc`, :c:func:`PyMem_RawMalloc`, ou :c:func:`malloc`, mas não :c:func:`PyObject_Malloc`.

source: See :ref:`Memory Allocation APIs <free-threaded-memory-allocation>`.
pt_pt: Veja :ref:`APIs de Alocação de Memória <free-threaded-memory-allocation>`....

source: Raw Memory Interface
pt_pt: Interface de Memória Raw

source: The :ref:`default raw memory allocator <default-memory-allocators>` uses the following functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`!free`; call ``malloc(1)`` (or ``calloc(1, 1)``) when requesting zero bytes.
pt_pt: O :ref:`alocador de memória raw predefinido <default-memory-allocators>` usa as seguintes funções: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` e :c:func:`!free`; chamar ``malloc(1)`` (ou ``calloc(1, 1)``) ao solicitar zero bytes.

source: Allocates *n* bytes and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails.
pt_pt: Aloca *n* bytes e retorna um ponteiro do tipo :c:expr:`void*` para a memória alocada, ou ``NULL`` se o pedido falhar.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawMalloc(1)`` had been called instead. The memory will not have been initialized in any way.
pt_pt: Solicitar zero bytes retorna um ponteiro não-``NULL`` distinto, se possível, como se ``PyMem_RawMalloc(1)`` tivesse sido chamado. A memória não será inicializada de nenhuma forma.

source: Allocates *nelem* elements each whose size in bytes is *elsize* and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails. The memory is initialized to zeros.
pt_pt: Aloca *nelem* elementos, cada um com tamanho em bytes de *elsize*, e retorna um ponteiro do tipo :c:expr:`void*` para a memória alocada, ou ``NULL`` se o pedido falhar. A memória é inicializada a zeros.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawCalloc(1, 1)`` had been called instead.
pt_pt: Solicitar zero elementos ou elementos com tamanho de zero bytes retorna um ponteiro não-``NULL`` distinto, se possível, como se ``PyMem_RawCalloc(1, 1)`` tivesse sido chamado.

source: Resizes the memory block pointed to by *p* to *n* bytes. The contents will be unchanged to the minimum of the old and the new sizes.
pt_pt: Redimensiona o bloco de memória apontado por *p* para *n* bytes. O conteúdo será inalterado até ao mínimo dos tamanhos antigo e novo.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_RawMalloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
pt_pt: Se *p* for ``NULL``, a chamada é equivalente a ``PyMem_RawMalloc(n)``; caso contrário, se *n* for igual a zero, o bloco de memória é redimensionado, mas não libertado, e o ponteiro retornado é não-``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`.
pt_pt: A menos que *p* seja ``NULL``, deve ter sido retornado por uma chamada anterior a :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` ou :c:func:`PyMem_RawCalloc`.

source: If the request fails, :c:func:`PyMem_RawRealloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
pt_pt: Se o pedido falhar, :c:func:`PyMem_RawRealloc` retorna ``NULL`` e *p* permanece um ponteiro válido para a área de memória anterior.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`. Otherwise, or if ``PyMem_RawFree(p)`` has been called before, undefined behavior occurs.
pt_pt: Liberta o bloco de memória apontado por *p*, que deve ter sido retornado por uma chamada anterior a :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` ou :c:func:`PyMem_RawCalloc`. Caso contrário, ou se ``PyMem_RawFree(p)`` tiver sido chamado anteriormente, ocorre comportamento indefinido.

source: If *p* is ``NULL``, no operation is performed.
pt_pt: Se *p* for ``NULL``, nenhuma operação é realizada.

source: Memory Interface
pt_pt: Interface de Memória

source: The following function sets, modeled after the ANSI C standard, but specifying behavior when requesting zero bytes, are available for allocating and releasing memory from the Python heap.
pt_pt: Os seguintes conjuntos de funções, modelados segundo o padrão ANSI C, mas especificando o comportamento ao solicitar zero bytes, estão disponíveis para alocar e libertar memória do *heap* do Python.

source: The :ref:`default memory allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
pt_pt: O :ref:`alocador de memória predefinido <default-memory-allocators>` usa o :ref:`alocador de memória pymalloc <pymalloc>`.

source: The default allocator is now pymalloc instead of system :c:func:`malloc`.
pt_pt: O alocador predefinido é agora o pymalloc em vez do :c:func:`malloc` do sistema.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
pt_pt: Solicitar zero bytes retorna um ponteiro não-``NULL`` distinto, se possível, como se ``PyMem_Malloc(1)`` tivesse sido chamado. A memória não será inicializada de nenhuma forma.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Calloc(1, 1)`` had been called instead.
pt_pt: Solicitar zero elementos ou elementos com tamanho de zero bytes retorna um ponteiro não-``NULL`` distinto, se possível, como se ``PyMem_Calloc(1, 1)`` tivesse sido chamado.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
pt_pt: Se *p* for ``NULL``, a chamada é equivalente a ``PyMem_Malloc(n)``; caso contrário, se *n* for igual a zero, o bloco de memória é redimensionado, mas não libertado, e o ponteiro retornado é não-``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`.
pt_pt: A menos que *p* seja ``NULL``, deve ter sido retornado por uma chamada anterior a :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` ou :c:func:`PyMem_Calloc`.

source: If the request fails, :c:func:`PyMem_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
pt_pt: Se o pedido falhar, :c:func:`PyMem_Realloc` retorna ``NULL`` e *p* permanece um ponteiro válido para a área de memória anterior.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`. Otherwise, or if ``PyMem_Free(p)`` has been called before, undefined behavior occurs.
pt_pt: Liberta o bloco de memória apontado por *p*, que deve ter sido retornado por uma chamada anterior a :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` ou :c:func:`PyMem_Calloc`. Caso contrário, ou se ``PyMem_Free(p)`` tiver sido chamado anteriormente, ocorre comportamento indefinido.

source: The following type-oriented macros are provided for convenience. Note that *TYPE* refers to any C type.
pt_pt: As seguintes macros orientadas a tipos são fornecidas por conveniência. Note que *TYPE* refere-se a qualquer tipo C.

source: Same as :c:func:`PyMem_Malloc`, but allocates ``(n * sizeof(TYPE))`` bytes of memory. Returns a pointer cast to ``TYPE*``. The memory will not have been initialized in any way.
pt_pt: Semelhante a :c:func:`PyMem_Malloc`, mas aloca ``(n * sizeof(TYPE))`` bytes de memória. Retorna um ponteiro convertido para ``TYPE*``. A memória não será inicializada de nenhuma forma.

source: Same as :c:func:`PyMem_Realloc`, but the memory block is resized to ``(n * sizeof(TYPE))`` bytes. Returns a pointer cast to ``TYPE*``. On return, *p* will be a pointer to the new memory area, or ``NULL`` in the event of failure.
pt_pt: Semelhante a :c:func:`PyMem_Realloc`, mas o bloco de memória é redimensionado para ``(n * sizeof(TYPE))`` bytes. Retorna um ponteiro convertido para ``TYPE*``. Ao retornar, *p* será um ponteiro para a nova área de memória, ou ``NULL`` em caso de falha.

source: This is a C preprocessor macro; *p* is always reassigned. Save the original value of *p* to avoid losing memory when handling errors.
pt_pt: Esta é uma macro do pré-processador C; *p* é sempre reatribuído. Guarde o valor original de *p* para evitar perder memória ao tratar erros.

source: Same as :c:func:`PyMem_Free`.
pt_pt: Semelhante a :c:func:`PyMem_Free`.

source: Deprecated aliases
pt_pt: Alias obsoleto

source: These are :term:`soft deprecated` aliases to existing functions and macros. They exist solely for backwards compatibility.
pt_pt: Estes são aliases em :term:`descontinuação latente` para funções e macros existentes. Eles existem apenas para compatibilidade com versões anteriores.

source: Deprecated alias
pt_pt: Alias obsoleto

source: Object allocators
pt_pt: Alocadores de Objetos

source: There is no guarantee that the memory returned by these allocators can be successfully cast to a Python object when intercepting the allocating functions in this domain by the methods described in the :ref:`Customize Memory Allocators <customize-memory-allocators>` section.
pt_pt: Não há garantia de que a memória retornada por estes alocadores possa ser convertida com sucesso para um objeto Python ao interceptar as funções de alocação neste domínio pelos métodos descritos na secção :ref:`Personalizar Alocadores de Memória <customize-memory-allocators>`.

source: The :ref:`default object allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
pt_pt: O :ref:`alocador de objetos predefinido <default-memory-allocators>` usa o :ref:`alocador de memória pymalloc <pymalloc>`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
pt_pt: Solicitar zero bytes retorna um ponteiro não-``NULL`` distinto, se possível, como se ``PyObject_Malloc(1)`` tivesse sido chamado. A memória não será inicializada de nenhuma forma.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Calloc(1, 1)`` had been called instead.
pt_pt: Solicitar zero elementos ou elementos com tamanho de zero bytes retorna um ponteiro não-``NULL`` distinto, se possível, como se ``PyObject_Calloc(1, 1)`` tivesse sido chamado.

source: If *p* is ``NULL``, the call is equivalent to ``PyObject_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
pt_pt: Se *p* for ``NULL``, a chamada é equivalente a ``PyObject_Malloc(n)``; caso contrário, se *n* for igual a zero, o bloco de memória é redimensionado, mas não libertado, e o ponteiro retornado é não-``NULL``.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`.
pt_pt: A menos que *p* seja ``NULL``, deve ter sido retornado por uma chamada anterior a :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` ou :c:func:`PyObject_Calloc`.

source: If the request fails, :c:func:`PyObject_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
pt_pt: Se o pedido falhar, :c:func:`PyObject_Realloc` retorna ``NULL`` e *p* permanece um ponteiro válido para a área de memória anterior.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`. Otherwise, or if ``PyObject_Free(p)`` has been called before, undefined behavior occurs.
pt_pt: Liberta o bloco de memória apontado por *p*, que deve ter sido retornado por uma chamada anterior a :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` ou :c:func:`PyObject_Calloc`. Caso contrário, ou se ``PyObject_Free(p)`` tiver sido chamado anteriormente, ocorre comportamento indefinido.

source: Default Memory Allocators
pt_pt: Alocadores de Memória Predefinidos

source: Default memory allocators:
pt_pt: Alocadores de memória predefinidos:

source: Configuration
pt_pt: Configuração

source: Name
pt_pt: Nome

source: Release build
pt_pt: Compilação de lançamento

source: Debug build
pt_pt: Compilação de depuração

source: ``malloc`` + debug
pt_pt: ``malloc`` + depuração

source: ``pymalloc`` + debug
pt_pt: ``pymalloc`` + depuração

source: Release build, without pymalloc
pt_pt: Compilação de lançamento, sem pymalloc
