Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/number.po
Languages: es_es, ru

source: Number Protocol
es_es: Número Protocolo
ru: Протокол нумерации

source: Returns ``1`` if the object *o* provides numeric protocols, and false otherwise. This function always succeeds.
es_es: Devuelve ``1`` si el objeto *o* proporciona protocolos numéricos, y falso en caso contrario. Esta función siempre tiene éxito.
ru: Возвращает ``1``, если объект *o* предоставляет числовые протоколы, и false в противном случае. Эта функция всегда завершается успешно.

source: Returns ``1`` if *o* is an index integer.
es_es: Devuelve ``1`` si *o* es un entero índice.
ru: Возвращает ``1``, если *o* — целое число индекса.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 + o2``.
es_es: Devuelve el resultado de sumar *o1* y *o2*, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 + o2``.
ru: Возвращает результат сложения *o1* и *o2* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o1 + o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 - o2``.
es_es: Devuelve el resultado de restar *o2* de *o1*, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 - o2``.
ru: Возвращает результат вычитания *o2* из *o1* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o1 - o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 * o2``.
es_es: Devuelve el resultado de multiplicar *o1* y *o2*, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 * o2``.
ru: Возвращает результат умножения *o1* и *o2* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o1 * o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 @ o2``.
es_es: Devuelve el resultado de la multiplicación de matrices en *o1* y *o2*, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 @ o2``.
ru: Возвращает результат умножения матриц на *o1* и *o2* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o1 @ o2``.

source: Return the floor of *o1* divided by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 // o2``.
es_es: Devuelve el valor mínimo de *o1* dividido por *o2*, o ``NULL`` en caso de error. Equivale a la expresión de Python ``o1 // o2``.
ru: Возвращает минимальное значение *o1*, разделенное на *o2*, или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o1 // o2``.

source: Return a reasonable approximation for the mathematical value of *o1* divided by *o2*, or ``NULL`` on failure. The return value is "approximate" because binary floating point numbers are approximate; it is not possible to represent all real numbers in base two. This function can return a floating point value when passed two integers. This is the equivalent of the Python expression ``o1 / o2``.
es_es: Devuelve una aproximación razonable del valor matemático de *o1* dividido por *o2*, o ``NULL`` en caso de fallo. El valor devuelto es "aproximado" porque los números binarios de coma flotante son aproximados; no es posible representar todos los números reales en base dos. Esta función puede devolver un valor en coma flotante cuando se le pasan dos números enteros. Es el equivalente de la expresión de Python ``o1 / o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 % o2``.
es_es: Devuelve el resto de dividir *o1* entre *o2*, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 % o2``.
ru: Возвращает остаток от деления *o1* на *o2* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o1 % o2``.

source: See the built-in function :func:`divmod`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``divmod(o1, o2)``.
es_es: Ver la función incorporada :func:`divmod`. Devuelve ``NULL`` en caso de fallo. Equivale a la expresión de Python ``divmod(o1, o2)``.
ru: См. встроенную функцию :func:`divmod`. Возвращает NULL в случае ошибки. Это эквивалент выражения Python ``divmod(o1, o2)``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. This is the equivalent of the Python expression ``pow(o1, o2, o3)``, where *o3* is optional. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
es_es: Ver la función incorporada :func:`pow`. Devuelve ``NULL`` en caso de fallo. Equivale a la expresión de Python ``pow(o1, o2, o3)``, donde *o3* es opcional. Si *o3* se debe ignorar, pasar :c:data:`Py_None` en su lugar (pasar ``NULL`` por *o3* causaría un acceso ilegal a memoria).
ru: См. встроенную функцию :func:`pow`. Возвращает NULL в случае ошибки. Это эквивалент выражения Python ``pow(o1, o2, o3)``, где *o3* не является обязательным. Если *o3* нужно игнорировать, передайте вместо него :c:data:`Py_None` (передача ``NULL`` для *o3* приведет к несанкционированному доступу к памяти).

source: Returns the negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``-o``.
es_es: Devuelve la negación de *o* en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``-o``.
ru: Возвращает отрицание *o* в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``-o``.

source: Returns *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``+o``.
es_es: Devuelve *o* en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``+o``.
ru: Возвращает *o* в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``+o``.

source: Returns the absolute value of *o*, or ``NULL`` on failure. This is the equivalent of the Python expression ``abs(o)``.
es_es: Devuelve el valor absoluto de *o*, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``abs(o)``.
ru: Возвращает абсолютное значение *o* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``abs(o)``.

source: Returns the bitwise negation of *o* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``~o``.
es_es: Devuelve la negación bitwise de *o* en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``~o``.
ru: Возвращает побитовое отрицание *o* в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``~o``.

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 << o2``.
es_es: Devuelve el resultado de desplazar a la izquierda *o1* por *o2* en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 << o2``.
ru: Возвращает результат смещения влево *o1* на *o2* в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``o1 << o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 >> o2``.
es_es: Devuelve el resultado de desplazar a la derecha *o1* por *o2* en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 >> o2``.
ru: Возвращает результат смещения вправо *o1* на *o2* в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``o1 >> o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. This is the equivalent of the Python expression ``o1 & o2``.
es_es: Devuelve el "bitwise and" de *o1* y *o2* en caso de éxito y ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 & o2``.
ru: Возвращает побитовое «и» для *o1* и *o2* в случае успеха и ``NULL`` в случае неудачи. Это эквивалент выражения Python ``o1 & o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 ^ o2``.
es_es: Devuelve el "bitwise exclusive or" de *o1* por *o2* en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 ^ o2``.
ru: Возвращает «побитовое исключающее ИЛИ» *o1* на *o2* в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``o1 ^ o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o1 | o2``.
es_es: Devuelve el "bitwise or" de *o1* y *o2* en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o1 | o2``.
ru: Возвращает «побитовое или» *o1* и *o2* в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``o1 | о2``.

source: Returns the result of adding *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 += o2``.
es_es: Devuelve el resultado de sumar *o1* y *o2*, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Equivale a la sentencia de Python ``o1 += o2``.
ru: Возвращает результат сложения *o1* и *o2* или ``NULL`` в случае ошибки. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 += o2``.

source: Returns the result of subtracting *o2* from *o1*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 -= o2``.
es_es: Devuelve el resultado de restar *o2* de *o1*, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Equivale a la sentencia de Python ``o1 -= o2``.
ru: Возвращает результат вычитания *o2* из *o1* или ``NULL`` в случае ошибки. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 -= o2``.

source: Returns the result of multiplying *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 *= o2``.
es_es: Devuelve el resultado de multiplicar *o1* y *o2*, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Equivale a la sentencia de Python ``o1 *= o2``.
ru: Возвращает результат умножения *o1* и *o2* или ``NULL`` в случае ошибки. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 *= o2``.

source: Returns the result of matrix multiplication on *o1* and *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 @= o2``.
es_es: Devuelve el resultado de la multiplicación de matrices en *o1* y *o2*, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Es el equivalente de la sentencia de Python ``o1 @= o2``.
ru: Возвращает результат умножения матриц на *o1* и *o2* или ``NULL`` в случае ошибки. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 @= o2``.

source: Returns the mathematical floor of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 //= o2``.
es_es: Devuelve el suelo matemático de dividir *o1* entre *o2*, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Esto es equivalente a la sentencia de Python ``o1 //= o2``.
ru: Возвращает математическое значение деления *o1* на *o2* или ``NULL`` в случае ошибки. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 //= o2``.

source: Return a reasonable approximation for the mathematical value of *o1* divided by *o2*, or ``NULL`` on failure. The return value is "approximate" because binary floating point numbers are approximate; it is not possible to represent all real numbers in base two. This function can return a floating point value when passed two integers. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 /= o2``.
es_es: Devuelve una aproximación razonable del valor matemático de *o1* dividido por *o2*, o ``NULL`` en caso de fallo. El valor devuelto es "aproximado" porque los números binarios de coma flotante son aproximados; no es posible representar todos los números reales en base dos. Esta función puede devolver un valor de coma flotante cuando se le pasan dos enteros. La operación se realiza *in-place* cuando *o1* lo admite. Esto es equivalente a la sentencia de Python ``o1 /= o2``.

source: Returns the remainder of dividing *o1* by *o2*, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 %= o2``.
es_es: Devuelve el resto de dividir *o1* entre *o2*, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Equivale a la sentencia de Python ``o1 %= o2``.
ru: Возвращает остаток от деления *o1* на *o2* или ``NULL`` в случае ошибки. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 %= o2``.

source: See the built-in function :func:`pow`. Returns ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 **= o2`` when o3 is :c:data:`Py_None`, or an in-place variant of ``pow(o1, o2, o3)`` otherwise. If *o3* is to be ignored, pass :c:data:`Py_None` in its place (passing ``NULL`` for *o3* would cause an illegal memory access).
es_es: Ver la función incorporada :func:`pow`. Devuelve ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo soporta. Esto es equivalente a la sentencia Python ``o1 **= o2`` cuando o3 es :c:data:`Py_None`, o una variante in-place de ``pow(o1, o2, o3)`` en caso contrario. Si *o3* debe ser ignorado, pase :c:data:`Py_None` en su lugar (pasar ``NULL`` por *o3* causaría un acceso ilegal a memoria).
ru: См. встроенную функцию :func:`pow`. Возвращает NULL в случае ошибки. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 **= o2``, когда o3 равен :c:data:`Py_None`, или альтернативного варианта ``pow(o1, o2, o3)`` в противном случае. Если *o3* нужно игнорировать, передайте вместо него :c:data:`Py_None` (передача ``NULL`` для *o3* приведет к несанкционированному доступу к памяти).

source: Returns the result of left shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 <<= o2``.
es_es: Devuelve el resultado de desplazar a la izquierda *o1* por *o2* en caso de éxito, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Esto es equivalente a la sentencia de Python ``o1 <<= o2``.
ru: Возвращает результат смещения влево *o1* на *o2* в случае успеха или ``NULL`` в случае неудачи. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 <<= o2``.

source: Returns the result of right shifting *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 >>= o2``.
es_es: Devuelve el resultado de desplazar a la derecha *o1* por *o2* en caso de éxito, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Esto es equivalente a la sentencia de Python ``o1 >>= o2``.
ru: Возвращает результат смещения вправо *o1* на *o2* в случае успеха или ``NULL`` в случае неудачи. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 >>= o2``.

source: Returns the "bitwise and" of *o1* and *o2* on success and ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 &= o2``.
es_es: Devuelve el "bitwise and" de *o1* y *o2* en caso de éxito y ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Es el equivalente de la sentencia de Python ``o1 &= o2``.
ru: Возвращает побитовое «и» для *o1* и *o2* в случае успеха и ``NULL`` в случае неудачи. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 &= o2``.

source: Returns the "bitwise exclusive or" of *o1* by *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 ^= o2``.
es_es: Devuelve el "bitwise exclusive or" de *o1* por *o2* en caso de éxito, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Equivale a la sentencia de Python ``o1 ^= o2``.
ru: Возвращает «побитовое исключающее ИЛИ» *o1* на *o2* в случае успеха или ``NULL`` в случае неудачи. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 ^= o2``.

source: Returns the "bitwise or" of *o1* and *o2* on success, or ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python statement ``o1 |= o2``.
es_es: Devuelve el "bitwise or" de *o1* y *o2* en caso de éxito, o ``NULL`` en caso de fallo. La operación se realiza *in-place* cuando *o1* lo admite. Equivale a la sentencia de Python ``o1 |= o2``.
ru: Возвращает «побитовое или» *o1* и *o2* в случае успеха или ``NULL`` в случае неудачи. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент оператора Python ``o1 |= o2``.

source: Returns the *o* converted to an integer object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``int(o)``.
es_es: Devuelve el *o* convertido a un objeto entero en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``int(o)``.
ru: Возвращает *o*, преобразованное в целочисленный объект в случае успеха, или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``int(o)``.

source: Returns the *o* converted to a float object on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``float(o)``.
es_es: Devuelve el *o* convertido a un objeto flotante en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``float(o)``.
ru: Возвращает *o*, преобразованное в объект с плавающей точкой в ​​случае успеха, или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``float(o)``.

source: Returns the *o* converted to a Python int on success or ``NULL`` with a :exc:`TypeError` exception raised on failure.
es_es: Devuelve el *o* convertido a un int de Python en caso de éxito o ``NULL`` con una excepción :exc:`TypeError` en caso de fallo.
ru: Возвращает *o*, преобразованное в int Python в случае успеха, или ``NULL`` с исключением :exc:`TypeError`, возникающим в случае неудачи.

source: The result always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``.
es_es: El resultado siempre tiene el tipo exacto :class:`int`. Antes, el resultado podía ser una instancia de una subclase de ``int``.
ru: Результат всегда имеет точный тип :class:`int`. Раньше результатом мог быть экземпляр подкласса int.

source: Returns the integer *n* converted to base *base* as a string. The *base* argument must be one of 2, 8, 10, or 16. For base 2, 8, or 16, the returned string is prefixed with a base marker of ``'0b'``, ``'0o'``, or ``'0x'``, respectively. If *n* is not a Python int, it is converted with :c:func:`PyNumber_Index` first.
es_es: Devuelve el número entero *n* convertido a base *base* como cadena. El argumento *base* debe ser uno de 2, 8, 10 ó 16. Para base 2, 8 o 16, la cadena devuelta lleva como prefijo un marcador de base ``'0b'``, ``'0o'`` o ``'0x'``, respectivamente. Si *n* no es un int de Python, se convierte primero con :c:func:`PyNumber_Index`.
ru: Возвращает целое число *n*, преобразованное в базовое *base*, в виде строки. Аргумент *base* должен иметь одно из чисел 2, 8, 10 или 16. Для оснований 2, 8 или 16 возвращаемая строка имеет префикс базового маркера ``'0b'``, ``'0o' `` или ``'0x'`` соответственно. Если *n* не является int Python, он сначала преобразуется с помощью :c:func:`PyNumber_Index`.

source: Returns *o* converted to a :c:type:`Py_ssize_t` value if *o* can be interpreted as an integer. If the call fails, an exception is raised and ``-1`` is returned.
es_es: Devuelve *o* convertido a un valor :c:type:`Py_ssize_t` si *o* puede interpretarse como un entero. Si la llamada falla, se lanza una excepción y se devuelve ``-1``.
ru: Возвращает *o*, преобразованное в значение :c:type:`Py_ssize_t`, если *o* можно интерпретировать как целое число. Если вызов завершается неудачно, возникает исключение и возвращается ``-1``.

source: If *o* can be converted to a Python int but the attempt to convert to a :c:type:`Py_ssize_t` value would raise an :exc:`OverflowError`, then the *exc* argument is the type of exception that will be raised (usually :exc:`IndexError` or :exc:`OverflowError`). If *exc* is ``NULL``, then the exception is cleared and the value is clipped to ``PY_SSIZE_T_MIN`` for a negative integer or ``PY_SSIZE_T_MAX`` for a positive integer.
es_es: Si *o* puede convertirse a un int de Python pero el intento de conversión a un valor de :c:type:`Py_ssize_t` lanzaría una excepción :exc:`OverflowError`, entonces el argumento *exc* es el tipo de excepción que se lanzará (normalmente :exc:`IndexError` o :exc:`OverflowError`). Si *exc* es ``NULL``, entonces la excepción se borra y el valor se recorta a ``PY_SSIZE_T_MIN`` para un entero negativo o ``PY_SSIZE_T_MAX`` para un entero positivo.
ru: Если *o* можно преобразовать в int Python, но попытка преобразовать в значение :c:type:`Py_ssize_t` вызовет ошибку :exc:`OverflowError`, то аргумент *exc* является типом исключения, которое будет быть повышено (обычно :exc:`IndexError` или :exc:`OverflowError`). Если *exc* равно NULL, то исключение очищается и значение обрезается до PY_SSIZE_T_MIN для отрицательного целого числа или PY_SSIZE_T_MAX для положительного целого числа.

source: Returns ``1`` if *o* is an index integer (has the ``nb_index`` slot of the ``tp_as_number`` structure filled in), and ``0`` otherwise. This function always succeeds.
es_es: Devuelve ``1`` si *o* es un entero de índice (tiene rellenada la ranura ``nb_index`` de la estructura ``tp_as_number`` ), y ``0`` en caso contrario. Esta función siempre tiene éxito.
ru: Возвращает ``1``, если *o* является индексным целым числом (имеет заполненный слот ``nb_index`` структуры ``tp_as_number``), и ``0`` в противном случае. Эта функция всегда завершается успешно.

source: built-in function
es_es: función incorporada
ru: встроенная функция

source: float
es_es: flotante
