Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/object.po
Languages: es_es, pt_pt, ru

source: When *o* is non-``NULL``, returns a type object corresponding to the object type of object *o*. On failure, raises :exc:`SystemError` and returns ``NULL``. This is equivalent to the Python expression ``type(o)``. This function creates a new :term:`strong reference` to the return value. There's really no reason to use this function instead of the :c:func:`Py_TYPE()` function, which returns a pointer of type :c:expr:`PyTypeObject*`, except when a new :term:`strong reference` is needed.
es_es: Если *o* не равно NULL, возвращается объект типа, соответствующий типу объекта *o*. В случае неудачи вызывает :exc:`SystemError` и возвращает ``NULL``. Это эквивалентно выражению Python ``type(o)``. Эта функция создает новую :term:`сильную ссылку` на возвращаемое значение. На самом деле нет причин использовать эту функцию вместо функции :c:func:`Py_TYPE()`, которая возвращает указатель типа :c:expr:`PyTypeObject*`, за исключением случаев, когда появляется новая :term:`strong reference` необходим.
pt_pt: Quando *o* não é ``NULL``, retorna um objeto de tipo correspondente ao tipo de objeto de *o*. Em caso de falha, levanta :exc:`SystemError` e retorna ``NULL``. Isto é equivalente à expressão Python ``type(o)``. Esta função cria uma nova :term:`referência forte` ao valor de retorno. Não há realmente nenhuma razão para usar esta função em vez da função :c:func:`Py_TYPE()`, que retorna um ponteiro do tipo :c:expr:`PyTypeObject*`, exceto quando uma nova :term:`referência forte` é necessária.
ru: Если *o* не равно NULL, возвращается объект типа, соответствующий типу объекта *o*. В случае неудачи вызывает :exc:`SystemError` и возвращает ``NULL``. Это эквивалентно выражению Python ``type(o)``. Эта функция создает новую :term:`сильную ссылку` на возвращаемое значение. На самом деле нет причин использовать эту функцию вместо функции :c:func:`Py_TYPE()`, которая возвращает указатель типа :c:expr:`PyTypeObject*`, за исключением случаев, когда появляется новая :term:`strong reference` необходим.

source: Return non-zero if the object *o* is of type *type* or a subtype of *type*, and ``0`` otherwise. Both parameters must be non-``NULL``.
es_es: Повертає відмінне від нуля значення, якщо об’єкт *o* має тип *type* або підтип *type*, і ``0`` інакше. Обидва параметри не мають бути ``NULL``.
pt_pt: Retorna um valor diferente de zero se o objeto *o* for do tipo *type* ou de um subtipo de *type*, e ``0`` caso contrário. Ambos os parâmetros devem ser diferentes de ``NULL``.
ru: Возвращает ненулевое значение, если объект *o* имеет тип *type* или подтип *type*, и ``0`` в противном случае. Оба параметра не должны быть NULL.

source: Return the length of object *o*. If the object *o* provides either the sequence and mapping protocols, the sequence length is returned. On error, ``-1`` is returned. This is the equivalent to the Python expression ``len(o)``.
es_es: Devuelve la longitud del objeto *o*. Si el objeto *o* proporciona los protocolos de secuencia y asignación, se devuelve la longitud de la secuencia. En caso de error, se devuelve ``-1``. Esto es equivalente a la expresión de Python ``len(o)``.
pt_pt: Retorna o comprimento do objeto *o*. Se o objeto *o* fornecer os protocolos de sequência e mapeamento, o comprimento da sequência é retornado. Em caso de erro, ``-1`` é retornado. Isto é equivalente à expressão Python ``len(o)``.
ru: Возвращает длину объекта *o*. Если объект *o* предоставляет протоколы последовательности и сопоставления, возвращается длина последовательности. В случае ошибки возвращается ``-1``. Это эквивалент выражения Python ``len(o)``.

source: Return an estimated length for the object *o*. First try to return its actual length, then an estimate using :meth:`~object.__length_hint__`, and finally return the default value. On error return ``-1``. This is the equivalent to the Python expression ``operator.length_hint(o, defaultvalue)``.
es_es: Devuelve una longitud estimada para el objeto *o*. Primero intenta devolver su longitud real, luego una estimación usando :meth:`~object.__length_hint__`, y finalmente devuelve el valor por defecto. En caso de error devuelve ``-1``. Esto es equivalente a la expresión de Python ``operator.length_hint(o, defaultvalue)``.
pt_pt: Retorna um comprimento estimado para o objeto *o*. Primeiro tenta retornar o seu comprimento real, depois uma estimativa usando :meth:`~object.__length_hint__`, e finalmente retorna o valor padrão. Em caso de erro, retorna ``-1``. Isto é equivalente à expressão Python ``operator.length_hint(o, defaultvalue)``.
ru: Возвращает предполагаемую длину объекта *o*. Сначала попытайтесь вернуть его фактическую длину, затем оценку, используя :meth:`~object.__length_hint__`, и, наконец, верните значение по умолчанию. В случае ошибки верните ``-1``. Это эквивалент выражения Python ``operator.length_hint(o, defaultvalue)``.

source: Return element of *o* corresponding to the object *key* or ``NULL`` on failure. This is the equivalent of the Python expression ``o[key]``.
es_es: Devuelve el elemento de *o* correspondiente al objeto *key* o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o[key]``.
pt_pt: Retorna o elemento de *o* correspondente ao objeto *key* ou ``NULL`` em caso de falha. Isto é equivalente à expressão Python ``o[key]``.
ru: Возвращает элемент *o*, соответствующий объекту *key* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o[key]``.

source: Map the object *key* to the value *v*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o[key] = v``. This function *does not* steal a reference to *v*.
es_es: Asigna el objeto *key* al valor *v*. Lanza una excepción y devuelve ``-1`` si falla; devuelve ``0`` en caso de éxito. Esto es equivalente a la sentencia de Python ``o[key] = v``. Esta función *no* roba una referencia a *v*.
pt_pt: Mapear o objeto *key* para o valor *v*. Levanta uma exceção e retorna ``-1`` em caso de falha; retorna ``0`` em caso de sucesso. Isto é equivalente à instrução Python ``o[key] = v``. Esta função *não* rouba uma referência a *v*.
ru: Сопоставьте объект *key* со значением *v*. Вызвать исключение и вернуть ``-1`` в случае неудачи; верните ``0`` в случае успеха. Это эквивалент оператора Python ``o[key] = v``. Эта функция *не* крадет ссылку на *v*.

source: Remove the mapping for the object *key* from the object *o*. Return ``-1`` on failure. This is equivalent to the Python statement ``del o[key]``.
es_es: Elimina la asignación del objeto *key* del objeto *o*. Devuelve ``-1`` en caso de fallo. Esto es equivalente a la sentencia de Python ``del o[key]``.
pt_pt: Remove o mapeamento para o objeto *key* do objeto *o*. Retorna ``-1`` em caso de falha. Isto é equivalente à instrução Python ``del o[key]``.
ru: Удалите сопоставление объекта *key* с объектом *o*. Возврат ``-1`` в случае неудачи. Это эквивалентно оператору Python del o[key]``.

source: This is the same as :c:func:`PyObject_DelItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Это то же самое, что и :c:func:` PyObj ect_DelItem`, но *key* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:` PyObj т. д. *`.
pt_pt: É o mesmo que :c:func:`PyObject_DelItem`, mas *key* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de :c:expr:`PyObject*`.

source: This is equivalent to the Python expression ``dir(o)``, returning a (possibly empty) list of strings appropriate for the object argument, or ``NULL`` if there was an error. If the argument is ``NULL``, this is like the Python ``dir()``, returning the names of the current locals; in this case, if no execution frame is active then ``NULL`` is returned but :c:func:`PyErr_Occurred` will return false.
es_es: Esto es equivalente a la expresión de Python ``dir(o)``, devolviendo una lista (posiblemente vacía) de cadenas apropiadas para el argumento objeto, o ``NULL`` si hubo un error. Si el argumento es ``NULL``, esto es como la expresión de Python ``dir()``, devolviendo los nombres de los locales actuales; en este caso, si no hay ningún marco de ejecución activo entonces se devuelve ``NULL`` pero :c:func:`PyErr_Occurred` devolverá falso.
pt_pt: Isto é equivalente à expressão Python ``dir(o)``, retornando uma lista (possivelmente vazia) de strings apropriadas para o argumento do objeto, ou ``NULL`` se houver um erro. Se o argumento for ``NULL``, isto é como o Python ``dir()``, retornando os nomes dos locais atuais; neste caso, se nenhum quadro de execução estiver ativo, então ``NULL`` é retornado, mas :c:func:`PyErr_Occurred` retornará falso.
ru: Это эквивалентно выражению Python ``dir(o)``, возвращающему (возможно, пустой) список строк, соответствующих аргументу объекта, или ``NULL``, если произошла ошибка. Если аргумент равен ``NULL``, это похоже на Python ``dir()``, возвращающий имена текущих локальных переменных; в этом случае, если ни один кадр выполнения не активен, возвращается ``NULL``, но :c:func:`PyErr_Occurred` вернет false.

source: This is equivalent to the Python expression ``iter(o)``. It returns a new iterator for the object argument, or the object itself if the object is already an iterator. Raises :exc:`TypeError` and returns ``NULL`` if the object cannot be iterated.
es_es: Equivale a la expresión de Python ``iter(o)``. Devuelve un nuevo iterador para el argumento objeto, o el objeto mismo si el objeto ya es un iterador. Lanza :exc:`TypeError` y devuelve ``NULL`` si el objeto no puede ser iterado.
pt_pt: Isto é equivalente à expressão Python ``iter(o)``. Retorna um novo iterador para o argumento do objeto, ou o próprio objeto se o objeto já for um iterador. Levanta :exc:`TypeError` e retorna ``NULL`` se o objeto não puder ser iterado.
ru: Это эквивалентно выражению Python ``iter(o)``. Он возвращает новый итератор для аргумента объекта или сам объект, если объект уже является итератором. Вызывает :exc:`TypeError` и возвращает ``NULL``, если объект не может быть повторен.

source: This is equivalent to the Python ``__iter__(self): return self`` method. It is intended for :term:`iterator` types, to be used in the :c:member:`PyTypeObject.tp_iter` slot.
es_es: Это эквивалентно методу Python ``__iter__(self): return self``. Он предназначен для типов :term:`iterator`, которые будут использоваться в слоте :c:member:`PyTypeObject.tp_iter`.
pt_pt: Isto é equivalente ao método Python ``__iter__(self): return self``. É destinado a tipos de :term:`iterador`, para ser usado no slot :c:member:`PyTypeObject.tp_iter`.

source: This is the equivalent to the Python expression ``aiter(o)``. Takes an :class:`AsyncIterable` object and returns an :class:`AsyncIterator` for it. This is typically a new iterator but if the argument is an :class:`AsyncIterator`, this returns itself. Raises :exc:`TypeError` and returns ``NULL`` if the object cannot be iterated.
es_es: Це еквівалент виразу Python ``aiter(o)``. Бере об’єкт :class:`AsyncIterable` і повертає для нього :class:`AsyncIterator`. Зазвичай це новий ітератор, але якщо аргументом є :class:`AsyncIterator`, він повертає сам себе. Викликає :exc:`TypeError` і повертає ``NULL``, якщо об’єкт не можна повторити.
pt_pt: Isto é equivalente à expressão Python ``aiter(o)``. Recebe um objeto :class:`AsyncIterable` e retorna um :class:`AsyncIterator` para ele. Isto é tipicamente um novo iterador, mas se o argumento for um :class:`AsyncIterator`, retorna ele próprio. Levanta :exc:`TypeError` e retorna ``NULL`` se o objeto não puder ser iterado.
ru: Это эквивалент выражения Python ``aiter(o)``. Принимает объект :class:`AsyncIterable` и возвращает для него :class:`AsyncIterator`. Обычно это новый итератор, но если аргументом является :class:`AsyncIterator`, он возвращает себя. Вызывает :exc:`TypeError` и возвращает ``NULL``, если объект не может быть повторен.

source: Get a pointer to subclass-specific data reserved for *cls*.
es_es: Получите указатель на данные, относящиеся к подклассу, зарезервированные для *cls*.
pt_pt: Obter um ponteiro para dados específicos de subclasse reservados para *cls*.

source: The object *o* must be an instance of *cls*, and *cls* must have been created using negative :c:member:`PyType_Spec.basicsize`. Python does not check this.
es_es: Объект *o* должен быть экземпляром *cls*, а *cls* должен быть создан с использованием отрицательного :c:member:`PyType_Spec.basicsize`. Python не проверяет это.
pt_pt: O objeto *o* deve ser uma instância de *cls*, e *cls* deve ter sido criado usando :c:member:`PyType_Spec.basicsize` negativo. O Python não verifica isto.

source: On error, set an exception and return ``NULL``.
es_es: При ошибке установите исключение и верните ``NULL``.
pt_pt: Em caso de erro, define uma exceção e retorna ``NULL``.

source: Return the size of the instance memory space reserved for *cls*, i.e. the size of the memory :c:func:`PyObject_GetTypeData` returns.
es_es: Возвращает размер пространства памяти экземпляра, зарезервированного для *cls*, т.е. размер возвращаемой памяти :c:func:`PyObject_GetTypeData`.
pt_pt: Retorna o tamanho do espaço de memória da instância reservado para *cls*, ou seja, o tamanho da memória que :c:func:`PyObject_GetTypeData` retorna.

source: This may be larger than requested using :c:member:`-PyType_Spec.basicsize <PyType_Spec.basicsize>`; it is safe to use this larger size (e.g. with :c:func:`!memset`).
es_es: Это может быть больше, чем запрошено с использованием :c:member:`-PyType_Spec.basicsize <PyType_Spec.basicsize>`; безопасно использовать больший размер (например, с :c:func:`!memset`).
pt_pt: Isto pode ser maior do que o solicitado usando :c:member:`-PyType_Spec.basicsize <PyType_Spec.basicsize>`; é seguro usar este tamanho maior (por exemplo, com :c:func:`!memset`).

source: The type *cls* **must** have been created using negative :c:member:`PyType_Spec.basicsize`. Python does not check this.
es_es: Тип *cls* **должен** быть создан с использованием отрицательного :c:member:`PyType_Spec.basicsize`. Python не проверяет это.
pt_pt: O tipo *cls* **deve** ter sido criado usando :c:member:`PyType_Spec.basicsize` negativo. O Python não verifica isto.

source: On error, set an exception and return a negative value.
es_es: В случае ошибки установите исключение и верните отрицательное значение.
pt_pt: Em caso de erro, define uma exceção e retorna um valor negativo.

source: Get a pointer to per-item data for a class with :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.
es_es: Получите указатель на данные по каждому элементу для класса с помощью :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.
pt_pt: Obter um ponteiro para dados por item para uma classe com :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.

source: On error, set an exception and return ``NULL``. :py:exc:`TypeError` is raised if *o* does not have :c:macro:`Py_TPFLAGS_ITEMS_AT_END` set.
es_es: В случае ошибки установить исключение и вернуть ``NULL``. :py:exc:`TypeError` возникает, если для *o* не установлен :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.
pt_pt: Em caso de erro, define uma exceção e retorna ``NULL``. :py:exc:`TypeError` é levantado se *o* não tiver :c:macro:`Py_TPFLAGS_ITEMS_AT_END` definido.

source: Visit the managed dictionary of *obj*.
es_es: Посетите управляемый словарь *obj*.
pt_pt: Visitar o dicionário gerido de *obj*.

source: This function must only be called in a traverse function of the type which has the :c:macro:`Py_TPFLAGS_MANAGED_DICT` flag set.
es_es: Эту функцию следует вызывать только в функции перемещения того типа, у которого установлен флаг :c:macro:`Py_TPFLAGS_MANAGED_DICT`.
pt_pt: Esta função só deve ser chamada numa função de travessia do tipo que tem a flag :c:macro:`Py_TPFLAGS_MANAGED_DICT` definida.

source: Clear the managed dictionary of *obj*.
es_es: Очистите управляемый словарь *obj*.
pt_pt: Limpar o dicionário gerido de *obj*.

source: This function must only be called in a clear function of the type which has the :c:macro:`Py_TPFLAGS_MANAGED_DICT` flag set.
pt_pt: Esta função só deve ser chamada numa função de limpeza do tipo que tem a flag :c:macro:`Py_TPFLAGS_MANAGED_DICT` definida.

source: built-in function
es_es: funkcja wbudowana
pt_pt: função incorporada
ru: встроенная функция

source: PyObject_Str (C function)
pt_pt: PyObject_Str (função C)

source: type
es_es: tipo
pt_pt: tipo
ru: тип

source: Flag to be used with multiple functions that print the object (like :c:func:`PyObject_Print` and :c:func:`PyFile_WriteObject`). If passed, these function would use the :func:`str` of the object instead of the :func:`repr`.
es_es: Флаг, который будет использоваться с несколькими функциями, печатающими объект (например, :c:func:`PyObject_Print` и :c:func:`PyFile_WriteObject`). В случае прохождения эти функции будут использовать :func:`str` объекта вместо :func:`repr`.
ru: Флаг, который будет использоваться с несколькими функциями, печатающими объект (например, :c:func:`PyObject_Print` и :c:func:`PyFile_WriteObject`). В случае прохождения эти функции будут использовать :func:`str` объекта вместо :func:`repr`.

source: string
es_es: cadena
ru: строка

source: Returns ``1`` if *o* has the attribute *attr_name*, and ``0`` otherwise. This is equivalent to the Python expression ``hasattr(o, attr_name)``. This function always succeeds.
ru: Возвращает ``1`` если *о* имеет атрибут *attr_name*, и ``0`` иначе. Это эквивалентно выражению ``hasattr(o, attr_name)``. Эта функция всегда завершается успешно.

source: Exceptions that occur when this calls :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` methods are silently ignored. For proper error handling, use :c:func:`PyObject_GetAttr` instead.
ru: Исключения, возникающие при вызове методов :meth:`~object.__getattr__` и :meth:`~object.__getattribute__`, молча игнорируются. Для правильной обработки ошибок вместо этого используйте :c:func:`PyObject_GetAttr`.

source: Exceptions that occur when this calls :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` methods or while creating the temporary :class:`str` object are silently ignored. For proper error handling, use :c:func:`PyObject_GetAttrString` instead.
ru: Исключения, возникающие при вызове методов :meth:`~object.__getattr__` и :meth:`~object.__getattribute__` или при создании временного объекта :class:`str`, молча игнорируются. Для правильной обработки ошибок вместо этого используйте :c:func:`PyObject_GetAttrString`.

source: bytes
ru: байт
