Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/object.po
Languages: es_es, pt_pt, ru

source: Object Protocol
es_es: Protocolo de objetos
pt_pt: Protocolo de Objetos
ru: Протокол объекта

source: Get a :term:`strong reference` to a constant.
es_es: Получите :term:`сильную ссылку` на константу.
pt_pt: Obter uma :term:`referência forte` a uma constante.

source: Set an exception and return ``NULL`` if *constant_id* is invalid.
es_es: Установите исключение и верните ``NULL``, если *constant_id* недействителен.
pt_pt: Definir uma exceção e retornar ``NULL`` se *constant_id* for inválido.

source: *constant_id* must be one of these constant identifiers:
es_es: *constant_id* должен быть одним из следующих идентификаторов констант:
pt_pt: *constant_id* deve ser um dos seguintes identificadores de constantes:

source: Constant Identifier
es_es: Постоянный идентификатор
pt_pt: Identificador da Constante

source: Value
es_es: Valor
pt_pt: Valor

source: Returned object
es_es: Возвращенный объект
pt_pt: Objeto retornado

source: Numeric values are only given for projects which cannot use the constant identifiers.
es_es: Числовые значения даны только для проектов, которые не могут использовать постоянные идентификаторы.
pt_pt: Os valores numéricos são fornecidos apenas para projetos que não podem usar os identificadores de constantes.

source: In CPython, all of these constants are :term:`immortal`.
es_es: В CPython все эти константы бессмертны.
pt_pt: No CPython, todas estas constantes são :term:`imortais`.

source: Similar to :c:func:`Py_GetConstant`, but return a :term:`borrowed reference`.
es_es: Аналогично :c:func:`Py_GetConstant`, но возвращает :term:`заимствованную ссылку`.
pt_pt: Semelhante a :c:func:`Py_GetConstant`, mas retorna uma :term:`referência emprestada`.

source: This function is primarily intended for backwards compatibility: using :c:func:`Py_GetConstant` is recommended for new code.
es_es: Эта функция в первую очередь предназначена для обратной совместимости: для нового кода рекомендуется использовать :c:func:`Py_GetConstant`.
pt_pt: Esta função é destinada principalmente à compatibilidade retroativa: recomenda-se o uso de :c:func:`Py_GetConstant` para novo código.

source: The reference is borrowed from the interpreter, and is valid until the interpreter finalization.
es_es: Ссылка заимствована у интерпретатора и действительна до завершения интерпретатора.
pt_pt: A referência é emprestada do interpretador e é válida até à finalização do interpretador.

source: The ``NotImplemented`` singleton, used to signal that an operation is not implemented for the given type combination.
es_es: El singleton ``NotImplemented``, utilizado para señalar que una operación no está implementada para la combinación de tipos dada.
pt_pt: O singleton ``NotImplemented``, usado para sinalizar que uma operação não está implementada para a combinação de tipos dada.
ru: Синглтон ``NotImplemented`` сигнализирует, что операция не реализована для данной комбинации типа.

source: Properly handle returning :c:data:`Py_NotImplemented` from within a C function (that is, create a new :term:`strong reference` to :const:`NotImplemented` and return it).
es_es: Правильно обрабатывайте возврат :c:data:`Py_NotImplemented` из функции C (то есть создайте новую :term:`strong ссылку` на :const:`NotImplemented` и верните ее).
pt_pt: Tratar corretamente o retorno de :c:data:`Py_NotImplemented` a partir de uma função C (ou seja, criar uma nova :term:`referência forte` para :const:`NotImplemented` e retorná-la).

source: Flag to be used with multiple functions that print the object (like :c:func:`PyObject_Print` and :c:func:`PyFile_WriteObject`). If passed, these functions use the :func:`str` of the object instead of the :func:`repr`.
pt_pt: Flag a ser usada com várias funções que imprimem o objeto (como :c:func:`PyObject_Print` e :c:func:`PyFile_WriteObject`). Se passada, estas funções usam o :func:`str` do objeto em vez do :func:`repr`.

source: Print an object *o*, on file *fp*. Returns ``-1`` on error. The flags argument is used to enable certain printing options. The only option currently supported is :c:macro:`Py_PRINT_RAW`; if given, the :func:`str` of the object is written instead of the :func:`repr`.
es_es: Напечатайте объект *o* в файле *fp*. Возвращает ``-1`` в случае ошибки. Аргумент flags используется для включения определенных параметров печати. В настоящее время поддерживается только один вариант: c:macro:`Py_PRINT_RAW`; если задано, вместо :func:`repr` записывается :func:`str` объекта.
pt_pt: Imprimir um objeto *o* no ficheiro *fp*. Retorna ``-1`` em caso de erro. O argumento flags é usado para ativar certas opções de impressão. A única opção atualmente suportada é :c:macro:`Py_PRINT_RAW`; se fornecida, o :func:`str` do objeto é escrito em vez do :func:`repr`.
ru: Напечатайте объект *o* в файле *fp*. Возвращает ``-1`` в случае ошибки. Аргумент flags используется для включения определенных параметров печати. В настоящее время поддерживается только один вариант: c:macro:`Py_PRINT_RAW`; если задано, вместо :func:`repr` записывается :func:`str` объекта.

source: Returns ``1`` if *o* has the attribute *attr_name*, and ``0`` otherwise. This is equivalent to the Python expression ``hasattr(o, attr_name)``. On failure, return ``-1``.
es_es: Возвращает ``1``, если *o* имеет атрибут *attr_name*, и ``0`` в противном случае. Это эквивалентно выражению Python «hasattr(o, attr_name)». В случае неудачи верните ``-1``.
pt_pt: Retorna ``1`` se *o* tiver o atributo *attr_name*, e ``0`` caso contrário. Isto é equivalente à expressão Python ``hasattr(o, attr_name)``. Em caso de falha, retorna ``-1``.

source: This is the same as :c:func:`PyObject_HasAttrWithError`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Это то же самое, что и :c:func:`PyObject_HasAttrWithError`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.
pt_pt: Isto é o mesmo que :c:func:`PyObject_HasAttrWithError`, mas *attr_name* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de um :c:expr:`PyObject*`.

source: Returns ``1`` if *o* has the attribute *attr_name*, and ``0`` otherwise. This function always succeeds.
es_es: Возвращает ``1``, если *o* имеет атрибут *attr_name*, и ``0`` в противном случае. Эта функция всегда завершается успешно.
pt_pt: Retorna ``1`` se *o* tiver o atributo *attr_name*, e ``0`` caso contrário. Esta função sempre tem sucesso.

source: Exceptions that occur when this calls :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` methods aren't propagated, but instead given to :func:`sys.unraisablehook`. For proper error handling, use :c:func:`PyObject_HasAttrWithError`, :c:func:`PyObject_GetOptionalAttr` or :c:func:`PyObject_GetAttr` instead.
es_es: Исключения, возникающие при вызове методов :meth:`~object.__getattr__` и :meth:`~object.__getattribute__`, не распространяются, а вместо этого передаются в :func:`sys.unraisablehook`. Для правильной обработки ошибок используйте вместо этого :c:func:`PyObject_HasAttrWithError`, :c:func:`PyObject_GetOptionalAttr` или :c:func:`PyObject_GetAttr`.
pt_pt: As exceções que ocorrem quando esta função chama os métodos :meth:`~object.__getattr__` e :meth:`~object.__getattribute__` não são propagadas, mas sim passadas para :func:`sys.unraisablehook`. Para um tratamento de erros adequado, use :c:func:`PyObject_HasAttrWithError`, :c:func:`PyObject_GetOptionalAttr` ou :c:func:`PyObject_GetAttr` em vez disso.

source: This is the same as :c:func:`PyObject_HasAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Это то же самое, что :c:func:`PyObject_HasAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.
pt_pt: Isto é o mesmo que :c:func:`PyObject_HasAttr`, mas *attr_name* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de um :c:expr:`PyObject*`.
ru: Это то же самое, что :c:func:`PyObject_HasAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.

source: Exceptions that occur when this calls :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` methods or while creating the temporary :class:`str` object are silently ignored. For proper error handling, use :c:func:`PyObject_HasAttrStringWithError`, :c:func:`PyObject_GetOptionalAttrString` or :c:func:`PyObject_GetAttrString` instead.
es_es: Исключения, возникающие при вызове методов :meth:`~object.__getattr__` и :meth:`~object.__getattribute__` или при создании временного объекта :class:`str`, молча игнорируются. Для правильной обработки ошибок вместо этого используйте :c:func:`PyObject_HasAttrStringWithError`, :c:func:`PyObject_GetOptionalAttrString` или :c:func:`PyObject_GetAttrString`.
pt_pt: As exceções que ocorrem quando esta função chama os métodos :meth:`~object.__getattr__` e :meth:`~object.__getattribute__` ou ao criar o objeto temporário :class:`str` são ignoradas silenciosamente. Para um tratamento de erros adequado, use :c:func:`PyObject_HasAttrStringWithError`, :c:func:`PyObject_GetOptionalAttrString` ou :c:func:`PyObject_GetAttrString` em vez disso.

source: Retrieve an attribute named *attr_name* from object *o*. Returns the attribute value on success, or ``NULL`` on failure. This is the equivalent of the Python expression ``o.attr_name``.
es_es: Recupera un atributo llamado *attr_name* del objeto *o*. Devuelve el valor del atributo en caso de éxito, o ``NULL`` en caso de fallo. Equivale a la expresión de Python ``o.attr_name``.
pt_pt: Recuperar um atributo chamado *attr_name* do objeto *o*. Retorna o valor do atributo em caso de sucesso, ou ``NULL`` em caso de falha. Isto é equivalente à expressão Python ``o.attr_name``.
ru: Получите атрибут с именем *attr_name* из объекта *o*. Возвращает значение атрибута в случае успеха или ``NULL`` в случае неудачи. Это эквивалент выражения Python ``o.attr_name``.

source: If the missing attribute should not be treated as a failure, you can use :c:func:`PyObject_GetOptionalAttr` instead.
es_es: Если отсутствующий атрибут не следует рассматривать как сбой, вместо этого вы можете использовать :c:func:`PyObject_GetOptionalAttr`.
pt_pt: Se o atributo em falta não deve ser tratado como uma falha, pode usar :c:func:`PyObject_GetOptionalAttr` em vez disso.

source: This is the same as :c:func:`PyObject_GetAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Это то же самое, что :c:func:`PyObject_GetAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.
pt_pt: Isto é o mesmo que :c:func:`PyObject_GetAttr`, mas *attr_name* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de um :c:expr:`PyObject*`.
ru: Это то же самое, что :c:func:`PyObject_GetAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.

source: If the missing attribute should not be treated as a failure, you can use :c:func:`PyObject_GetOptionalAttrString` instead.
es_es: Если отсутствующий атрибут не следует рассматривать как сбой, вместо этого вы можете использовать :c:func:`PyObject_GetOptionalAttrString`.
pt_pt: Se o atributo em falta não deve ser tratado como uma falha, pode usar :c:func:`PyObject_GetOptionalAttrString` em vez disso.

source: Variant of :c:func:`PyObject_GetAttr` which doesn't raise :exc:`AttributeError` if the attribute is not found.
es_es: Вариант :c:func:`PyObject_GetAttr`, который не вызывает :exc:`AttributeError`, если атрибут не найден.
pt_pt: Variante de :c:func:`PyObject_GetAttr` que não levanta :exc:`AttributeError` se o atributo não for encontrado.

source: If the attribute is found, return ``1`` and set *\*result* to a new :term:`strong reference` to the attribute. If the attribute is not found, return ``0`` and set *\*result* to ``NULL``; the :exc:`AttributeError` is silenced. If an error other than :exc:`AttributeError` is raised, return ``-1`` and set *\*result* to ``NULL``.
es_es: Если атрибут найден, верните ``1`` и установите *\*result* в новую :term:`strong ссылку` на атрибут. Если атрибут не найден, верните ``0`` и установите для *\*result* значение ``NULL``; :exc:`AttributeError` отключен. Если возникает ошибка, отличная от :exc:`AttributeError`, верните ``-1`` и установите для *\*result* значение ``NULL``.
pt_pt: Se o atributo for encontrado, retorna ``1`` e define *\*result* para uma nova :term:`referência forte` ao atributo. Se o atributo não for encontrado, retorna ``0`` e define *\*result* para ``NULL``; o :exc:`AttributeError` é silenciado. Se for levantado um erro diferente de :exc:`AttributeError`, retorna ``-1`` e define *\*result* para ``NULL``.

source: This is the same as :c:func:`PyObject_GetOptionalAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Это то же самое, что и :c:func:`PyObject_GetOptionalAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.
pt_pt: Isto é o mesmo que :c:func:`PyObject_GetOptionalAttr`, mas *attr_name* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de um :c:expr:`PyObject*`.

source: Generic attribute getter function that is meant to be put into a type object's ``tp_getattro`` slot. It looks for a descriptor in the dictionary of classes in the object's MRO as well as an attribute in the object's :attr:`~object.__dict__` (if present). As outlined in :ref:`descriptors`, data descriptors take preference over instance attributes, while non-data descriptors don't. Otherwise, an :exc:`AttributeError` is raised.
es_es: Función genérica de obtención de atributos que se coloca en la ranura ``tp_getattro`` de un objeto de tipo. Busca un descriptor en el diccionario de clases del MRO del objeto, así como un atributo en el :attr:`~object.__dict__` del objeto (si está presente). Como se indica en :ref:`descriptors`, los descriptores de datos tienen preferencia sobre los atributos de instancia, mientras que los descriptores que no son de datos no la tienen. En caso contrario, se produce un :exc:`AttributeError`.
pt_pt: Função genérica de obtenção de atributos destinada a ser colocada no slot ``tp_getattro`` de um objeto de tipo. Procura um descritor no dicionário de classes na MRO do objeto, bem como um atributo no :attr:`~object.__dict__` do objeto (se presente). Como descrito em :ref:`descriptors`, os descritores de dados têm preferência sobre os atributos de instância, enquanto os descritores não de dados não têm. Caso contrário, é levantado um :exc:`AttributeError`.
ru: Общая функция получения атрибутов, предназначенная для помещения в слот tp_getattro объекта типа. Он ищет дескриптор в словаре классов в MRO объекта, а также атрибут в :attr:`~object.__dict__` объекта (если он присутствует). Как указано в :ref:`descriptors`, дескрипторы данных имеют преимущество перед атрибутами экземпляра, а дескрипторы, не являющиеся данными, — нет. В противном случае возникает ошибка :exc:`AttributeError`.

source: Set the value of the attribute named *attr_name*, for object *o*, to the value *v*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o.attr_name = v``.
es_es: Establece el valor del atributo llamado *attr_name*, para el objeto *o*, al valor *v*. Lanza una excepción y devuelve ``-1`` en caso de fallo; devuelve ``0`` en caso de éxito. Esto es equivalente a la sentencia de Python ``o.attr_name = v``.
pt_pt: Definir o valor do atributo chamado *attr_name*, para o objeto *o*, para o valor *v*. Levanta uma exceção e retorna ``-1`` em caso de falha; retorna ``0`` em caso de sucesso. Isto é equivalente à instrução Python ``o.attr_name = v``.
ru: Установите значение атрибута с именем *attr_name* для объекта *o* на значение *v*. Вызвать исключение и вернуть ``-1`` в случае неудачи; верните ``0`` в случае успеха. Это эквивалент оператора Python ``o.attr_name = v``.

source: If *v* is ``NULL``, the attribute is deleted. This behaviour is deprecated in favour of using :c:func:`PyObject_DelAttr`, but there are currently no plans to remove it.
es_es: Si *v* es ``NULL``, el atributo se elimina. Este comportamiento está obsoleto en favor del uso de :c:func:`PyObject_DelAttr`, pero actualmente no hay planes para eliminarlo.
pt_pt: Se *v* for ``NULL``, o atributo é eliminado. Este comportamento está obsoleto em favor do uso de :c:func:`PyObject_DelAttr`, mas atualmente não há planos para removê-lo.
ru: Если *v* имеет значение NULL, атрибут удаляется. Это поведение устарело в пользу использования :c:func:`PyObject_DelAttr`, но в настоящее время нет планов по его удалению.

source: This is the same as :c:func:`PyObject_SetAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Это то же самое, что и :c:func:`PyObject_SetAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.
pt_pt: Isto é o mesmo que :c:func:`PyObject_SetAttr`, mas *attr_name* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de um :c:expr:`PyObject*`.
ru: Это то же самое, что и :c:func:`PyObject_SetAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.

source: If *v* is ``NULL``, the attribute is deleted, but this feature is deprecated in favour of using :c:func:`PyObject_DelAttrString`.
es_es: Si *v* es ``NULL``, el atributo se elimina, pero esta función está obsoleta en favor del uso de :c:func:`PyObject_DelAttrString`.
pt_pt: Se *v* for ``NULL``, o atributo é eliminado, mas esta funcionalidade está obsoleta em favor do uso de :c:func:`PyObject_DelAttrString`.
ru: Если *v* имеет значение ``NULL``, атрибут удаляется, но эта функция устарела в пользу использования :c:func:`PyObject_DelAttrString`.

source: The number of different attribute names passed to this function should be kept small, usually by using a statically allocated string as *attr_name*. For attribute names that aren't known at compile time, prefer calling :c:func:`PyUnicode_FromString` and :c:func:`PyObject_SetAttr` directly. For more details, see :c:func:`PyUnicode_InternFromString`, which may be used internally to create a key object.
es_es: Количество различных имен атрибутов, передаваемых в эту функцию, должно быть небольшим, обычно с использованием статически выделенной строки в качестве *attr_name*. Для имен атрибутов, которые неизвестны во время компиляции, предпочтительнее вызывать :c:func:`PyUnicode_FromString` и :c:func:`PyObject_SetAttr` напрямую. Для получения более подробной информации см. :c:func:`PyUnicode_InternFromString`, который можно использовать внутри компании для создания ключевого объекта.
pt_pt: O número de nomes de atributos diferentes passados para esta função deve ser mantido pequeno, geralmente usando uma string estaticamente alocada como *attr_name*. Para nomes de atributos que não são conhecidos em tempo de compilação, prefira chamar diretamente :c:func:`PyUnicode_FromString` e :c:func:`PyObject_SetAttr`. Para mais detalhes, consulte :c:func:`PyUnicode_InternFromString`, que pode ser usada internamente para criar um objeto chave.

source: Generic attribute setter and deleter function that is meant to be put into a type object's :c:member:`~PyTypeObject.tp_setattro` slot. It looks for a data descriptor in the dictionary of classes in the object's MRO, and if found it takes preference over setting or deleting the attribute in the instance dictionary. Otherwise, the attribute is set or deleted in the object's :attr:`~object.__dict__` (if present). On success, ``0`` is returned, otherwise an :exc:`AttributeError` is raised and ``-1`` is returned.
es_es: Función genérica de establecimiento y borrado de atributos que debe colocarse en la ranura :c:member:`~PyTypeObject.tp_setattro` de un objeto de tipo. Busca un descriptor de datos en el diccionario de clases de la MRO del objeto, y si lo encuentra tiene preferencia sobre el establecimiento o borrado del atributo en el diccionario de instancia. De lo contrario, el atributo se establece o elimina en el :attr:`~object.__dict__` del objeto (si está presente). En caso de éxito, se devuelve ``0``; en caso contrario, se genera un :exc:`AttributeError` y se devuelve ``-1``.
pt_pt: Função genérica de definição e eliminação de atributos destinada a ser colocada no slot :c:member:`~PyTypeObject.tp_setattro` de um objeto de tipo. Procura um descritor de dados no dicionário de classes na MRO do objeto, e se encontrado, tem preferência sobre a definição ou eliminação do atributo no dicionário da instância. Caso contrário, o atributo é definido ou eliminado no :attr:`~object.__dict__` do objeto (se presente). Em caso de sucesso, ``0`` é retornado; caso contrário, é levantado um :exc:`AttributeError` e ``-1`` é retornado.
ru: Универсальная функция установки и удаления атрибутов, предназначенная для помещения в слот :c:member:`~PyTypeObject.tp_setattro` объекта типа. Он ищет дескриптор данных в словаре классов в MRO объекта и, если находит, отдает предпочтение установке или удалению атрибута в словаре экземпляра. В противном случае атрибут устанавливается или удаляется в :attr:`~object.__dict__` объекта (если он присутствует). В случае успеха возвращается ``0``, в противном случае выдается :exc:`AttributeError` и возвращается ``-1``.

source: Delete attribute named *attr_name*, for object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``del o.attr_name``.
es_es: Elimina el atributo *attr_name* del objeto *o*. Devuelve ``-1`` en caso de fallo. Equivale a la sentencia de Python ``del o.attr_name``.
pt_pt: Elimina o atributo chamado *attr_name*, para o objeto *o*. Retorna ``-1`` em caso de falha. Isto é equivalente à instrução Python ``del o.attr_name``.
ru: Удалить атрибут с именем *attr_name* для объекта *o*. Возвращает ``-1`` в случае неудачи. Это эквивалент оператора Python del o.attr_name.

source: This is the same as :c:func:`PyObject_DelAttr`, but *attr_name* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
es_es: Это то же самое, что :c:func:`PyObject_DelAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.
pt_pt: Isto é o mesmo que :c:func:`PyObject_DelAttr`, mas *attr_name* é especificado como uma string de bytes codificada em UTF-8 :c:expr:`const char*`, em vez de um :c:expr:`PyObject*`.
ru: Это то же самое, что :c:func:`PyObject_DelAttr`, но *attr_name* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:`PyObject* `.
