Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/object.po
Languages: es_es, pt_pt, ru

source: The number of different attribute names passed to this function should be kept small, usually by using a statically allocated string as *attr_name*. For attribute names that aren't known at compile time, prefer calling :c:func:`PyUnicode_FromString` and :c:func:`PyObject_DelAttr` directly. For more details, see :c:func:`PyUnicode_InternFromString`, which may be used internally to create a key object for lookup.
es_es: Количество различных имен атрибутов, передаваемых в эту функцию, должно быть небольшим, обычно с использованием статически выделенной строки в качестве *attr_name*. Для имен атрибутов, которые неизвестны во время компиляции, предпочтительнее вызывать :c:func:`PyUnicode_FromString` и :c:func:`PyObject_DelAttr` напрямую. Для получения более подробной информации см. :c:func:`PyUnicode_InternFromString`, который можно использовать внутри, чтобы создать ключевой объект для поиска.
pt_pt: O número de nomes de atributos diferentes passados para esta função deve ser mantido pequeno, geralmente usando uma string estaticamente alocada como *attr_name*. Para nomes de atributos que não são conhecidos em tempo de compilação, prefira chamar diretamente :c:func:`PyUnicode_FromString` e :c:func:`PyObject_DelAttr`. Para mais detalhes, consulte :c:func:`PyUnicode_InternFromString`, que pode ser usada internamente para criar um objeto chave para pesquisa.

source: A generic implementation for the getter of a ``__dict__`` descriptor. It creates the dictionary if necessary.
es_es: Una implementación genérica para el getter de un descriptor ``__dict__``. Crea el diccionario si es necesario.
pt_pt: Uma implementação genérica para o getter de um descritor ``__dict__``. Cria o dicionário se necessário.
ru: Общая реализация метода получения дескриптора ``__dict__``. При необходимости он создает словарь.

source: This function may also be called to get the :py:attr:`~object.__dict__` of the object *o*. Pass ``NULL`` for *context* when calling it. Since this function may need to allocate memory for the dictionary, it may be more efficient to call :c:func:`PyObject_GetAttr` when accessing an attribute on the object.
es_es: Эту функцию также можно вызвать для получения :py:attr:`~object.__dict__` объекта *o*. Передайте ``NULL`` для *context* при вызове. Поскольку этой функции может потребоваться выделить память для словаря, возможно, будет более эффективно вызвать :c:func:`PyObject_GetAttr` при доступе к атрибуту объекта.
pt_pt: Esta função também pode ser chamada para obter o :py:attr:`~object.__dict__` do objeto *o*. Passe ``NULL`` para *context* ao chamá-la. Como esta função pode precisar alocar memória para o dicionário, pode ser mais eficiente chamar :c:func:`PyObject_GetAttr` ao aceder a um atributo no objeto.
ru: Эту функцию также можно вызвать для получения :py:attr:`~object.__dict__` объекта *o*. Передайте ``NULL`` для *context* при вызове. Поскольку этой функции может потребоваться выделить память для словаря, возможно, будет более эффективно вызвать :c:func:`PyObject_GetAttr` при доступе к атрибуту объекта.

source: On failure, returns ``NULL`` with an exception set.
es_es: В случае неудачи возвращает NULL с установленным исключением.
pt_pt: Em caso de falha, retorna ``NULL`` com uma exceção definida.
ru: В случае неудачи возвращает NULL с установленным исключением.

source: A generic implementation for the setter of a ``__dict__`` descriptor. This implementation does not allow the dictionary to be deleted.
es_es: Una implementación genérica para el setter de un descriptor ``__dict__``. Esta implementación no permite borrar el diccionario.
pt_pt: Uma implementação genérica para o setter de um descritor ``__dict__``. Esta implementação não permite que o dicionário seja eliminado.
ru: Общая реализация установщика дескриптора ``__dict__``. Эта реализация не позволяет удалить словарь.

source: Return a pointer to :py:attr:`~object.__dict__` of the object *obj*. If there is no ``__dict__``, return ``NULL`` without setting an exception.
es_es: Верните указатель на :py:attr:`~object.__dict__` объекта *obj*. Если ``__dict__`` нет, верните ``NULL`` без установки исключения.
pt_pt: Retorna um ponteiro para :py:attr:`~object.__dict__` do objeto *obj*. Se não houver ``__dict__``, retorna ``NULL`` sem definir uma exceção.
ru: Верните указатель на :py:attr:`~object.__dict__` объекта *obj*. Если ``__dict__`` нет, верните ``NULL`` без установки исключения.

source: This function may need to allocate memory for the dictionary, so it may be more efficient to call :c:func:`PyObject_GetAttr` when accessing an attribute on the object.
es_es: Этой функции может потребоваться выделить память для словаря, поэтому может оказаться более эффективным вызвать :c:func:`PyObject_GetAttr` при доступе к атрибуту объекта.
pt_pt: Esta função pode precisar alocar memória para o dicionário, por isso pode ser mais eficiente chamar :c:func:`PyObject_GetAttr` ao aceder a um atributo no objeto.
ru: Этой функции может потребоваться выделить память для словаря, поэтому может оказаться более эффективным вызвать :c:func:`PyObject_GetAttr` при доступе к атрибуту объекта.

source: Compare the values of *o1* and *o2* using the operation specified by *opid*, which must be one of :c:macro:`Py_LT`, :c:macro:`Py_LE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_GT`, or :c:macro:`Py_GE`, corresponding to ``<``, ``<=``, ``==``, ``!=``, ``>``, or ``>=`` respectively. This is the equivalent of the Python expression ``o1 op o2``, where ``op`` is the operator corresponding to *opid*. Returns the value of the comparison on success, or ``NULL`` on failure.
es_es: Сравните значения *o1* и *o2*, используя операцию, указанную в *opid*, которая должна быть одной из :c:macro:`Py_LT`, :c:macro:`Py_LE`, :c:macro:`Py_EQ `, :c:macro:`Py_NE`, :c:macro:`Py_GT` или :c:macro:`Py_GE`, соответствующие ``<``, ``<=``, ``==` `, ``!=``, ``>`` или ``>=`` соответственно. Это эквивалент выражения Python ``o1 op o2``, где ``op`` — это оператор, соответствующий *opid*. Возвращает значение сравнения в случае успеха или NULL в случае неудачи.
pt_pt: Comparar os valores de *o1* e *o2* usando a operação especificada por *opid*, que deve ser uma das seguintes: :c:macro:`Py_LT`, :c:macro:`Py_LE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_GT`, ou :c:macro:`Py_GE`, correspondendo a ``<``, ``<=``, ``==``, ``!=``, ``>``, ou ``>=``, respetivamente. Isto é equivalente à expressão Python ``o1 op o2``, onde ``op`` é o operador correspondente a *opid*. Retorna o valor da comparação em caso de sucesso, ou ``NULL`` em caso de falha.
ru: Сравните значения *o1* и *o2*, используя операцию, указанную в *opid*, которая должна быть одной из :c:macro:`Py_LT`, :c:macro:`Py_LE`, :c:macro:`Py_EQ `, :c:macro:`Py_NE`, :c:macro:`Py_GT` или :c:macro:`Py_GE`, соответствующие ``<``, ``<=``, ``==` `, ``!=``, ``>`` или ``>=`` соответственно. Это эквивалент выражения Python ``o1 op o2``, где ``op`` — это оператор, соответствующий *opid*. Возвращает значение сравнения в случае успеха или NULL в случае неудачи.

source: Compare the values of *o1* and *o2* using the operation specified by *opid*, like :c:func:`PyObject_RichCompare`, but returns ``-1`` on error, ``0`` if the result is false, ``1`` otherwise.
es_es: Сравните значения *o1* и *o2*, используя операцию, указанную в *opid*, например :c:func:`PyObject_RichCompare`, но возвращает ``-1`` в случае ошибки, ``0``, если результат равен false, ``1`` в противном случае.
pt_pt: Comparar os valores de *o1* e *o2* usando a operação especificada por *opid*, como :c:func:`PyObject_RichCompare`, mas retorna ``-1`` em caso de erro, ``0`` se o resultado for falso, ``1`` caso contrário.
ru: Сравните значения *o1* и *o2*, используя операцию, указанную в *opid*, например :c:func:`PyObject_RichCompare`, но возвращает ``-1`` в случае ошибки, ``0``, если результат равен false, ``1`` в противном случае.

source: If *o1* and *o2* are the same object, :c:func:`PyObject_RichCompareBool` will always return ``1`` for :c:macro:`Py_EQ` and ``0`` for :c:macro:`Py_NE`.
es_es: Если *o1* и *o2* являются одним и тем же объектом, :c:func:`PyObject_RichCompareBool` всегда будет возвращать ``1`` для :c:macro:`Py_EQ` и ``0`` для :c:macro: `Пы_НЕ`.
pt_pt: Se *o1* e *o2* forem o mesmo objeto, :c:func:`PyObject_RichCompareBool` sempre retornará ``1`` para :c:macro:`Py_EQ` e ``0`` para :c:macro:`Py_NE`.
ru: Если *o1* и *o2* являются одним и тем же объектом, :c:func:`PyObject_RichCompareBool` всегда будет возвращать ``1`` для :c:macro:`Py_EQ` и ``0`` для :c:macro: `Пы_НЕ`.

source: Format *obj* using *format_spec*. This is equivalent to the Python expression ``format(obj, format_spec)``.
es_es: Отформатируйте *obj*, используя *format_spec*. Это эквивалентно выражению Python «format(obj, format_spec)».
pt_pt: Formatar *obj* usando *format_spec*. Isto é equivalente à expressão Python ``format(obj, format_spec)``.
ru: Отформатируйте *obj*, используя *format_spec*. Это эквивалентно выражению Python «format(obj, format_spec)».

source: *format_spec* may be ``NULL``. In this case the call is equivalent to ``format(obj)``. Returns the formatted string on success, ``NULL`` on failure.
es_es: *format_spec* может иметь значение ``NULL``. В этом случае вызов эквивалентен ``format(obj)``. Возвращает отформатированную строку в случае успеха и ``NULL`` в случае неудачи.
pt_pt: *format_spec* pode ser ``NULL``. Neste caso, a chamada é equivalente a ``format(obj)``. Retorna a string formatada em caso de sucesso, ``NULL`` em caso de falha.
ru: *format_spec* может иметь значение ``NULL``. В этом случае вызов эквивалентен ``format(obj)``. Возвращает отформатированную строку в случае успеха и ``NULL`` в случае неудачи.

source: Compute a string representation of object *o*. Returns the string representation on success, ``NULL`` on failure. This is the equivalent of the Python expression ``repr(o)``. Called by the :func:`repr` built-in function.
es_es: Calcula una representación de cadena del objeto *o*. Devuelve la representación de cadena en caso de éxito, ``NULL`` en caso de fallo. Equivale a la expresión de Python ``repr(o)``. Llamada por la función incorporada :func:`repr`.
pt_pt: Calcular uma representação em string do objeto *o*. Retorna a representação em string em caso de sucesso, ``NULL`` em caso de falha. Isto é equivalente à expressão Python ``repr(o)``. Chamado pela função incorporada :func:`repr`.
ru: Вычислить строковое представление объекта *o*. Возвращает строковое представление в случае успеха и ``NULL`` в случае неудачи. Это эквивалент выражения Python ``repr(o)``. Вызывается встроенной функцией :func:`repr`.

source: This function now includes a debug assertion to help ensure that it does not silently discard an active exception.
es_es: Esta función incluye ahora una aserción de depuración para ayudar a garantizar que no descarta silenciosamente una excepción activa.
pt_pt: Esta função agora inclui uma afirmação de depuração para ajudar a garantir que não descarta silenciosamente uma exceção ativa.
ru: Эта функция теперь включает утверждение отладки, чтобы гарантировать, что она не отбрасывает активное исключение автоматически.

source: As :c:func:`PyObject_Repr`, compute a string representation of object *o*, but escape the non-ASCII characters in the string returned by :c:func:`PyObject_Repr` with ``\x``, ``\u`` or ``\U`` escapes. This generates a string similar to that returned by :c:func:`PyObject_Repr` in Python 2. Called by the :func:`ascii` built-in function.
es_es: Como :c:func:`PyObject_Repr`, calcula una representación de cadena del objeto *o*, pero escapa los caracteres no ASCII de la cadena devuelta por :c:func:`PyObject_Repr` con escapes ``\x``, ``\u`` o ``\U``. Esto genera una cadena similar a la devuelta por :c:func:`PyObject_Repr` en Python 2. Llamado por la función incorporada :func:`ascii`.
pt_pt: Como :c:func:`PyObject_Repr`, calcular uma representação em string do objeto *o*, mas escapar os caracteres não-ASCII na string retornada por :c:func:`PyObject_Repr` com escapes ``\x``, ``\u`` ou ``\U``. Isto gera uma string semelhante à retornada por :c:func:`PyObject_Repr` no Python 2. Chamado pela função incorporada :func:`ascii`.
ru: Как :c:func:`PyObject_Repr`, вычисляет строковое представление объекта *o*, но экранирует символы, отличные от ASCII, в строке, возвращаемой :c:func:`PyObject_Repr`, с помощью ``\x``, `` \u`` или ``\U`` экранируются. При этом генерируется строка, аналогичная той, которая возвращается :c:func:`PyObject_Repr` в Python 2. Вызывается встроенной функцией :func:`ascii`.

source: Compute a string representation of object *o*. Returns the string representation on success, ``NULL`` on failure. This is the equivalent of the Python expression ``str(o)``. Called by the :func:`str` built-in function and, therefore, by the :func:`print` function.
es_es: Calcula una representación de cadena del objeto *o*. Devuelve la representación de cadena en caso de éxito, ``NULL`` en caso de fallo. Equivale a la expresión de Python ``str(o)``. Llamada por la función incorporada :func:`str` y, por tanto, por la función :func:`print`.
pt_pt: Calcular uma representação em string do objeto *o*. Retorna a representação em string em caso de sucesso, ``NULL`` em caso de falha. Isto é equivalente à expressão Python ``str(o)``. Chamado pela função incorporada :func:`str` e, portanto, pela função :func:`print`.
ru: Вычислить строковое представление объекта *o*. Возвращает строковое представление в случае успеха и ``NULL`` в случае неудачи. Это эквивалент выражения Python ``str(o)``. Вызывается встроенной функцией :func:`str` и, следовательно, функцией :func:`print`.

source: Compute a bytes representation of object *o*. ``NULL`` is returned on failure and a bytes object on success. This is equivalent to the Python expression ``bytes(o)``, when *o* is not an integer. Unlike ``bytes(o)``, a TypeError is raised when *o* is an integer instead of a zero-initialized bytes object.
es_es: Calcula una representación en bytes del objeto *o*. ``NULL`` se devuelve en caso de fallo y un objeto bytes en caso de éxito. Esto es equivalente a la expresión de Python ``bytes(o)``, cuando *o* no es un entero. A diferencia de ``bytes(o)``, se produce un error de tipo TypeError cuando *o* es un entero en lugar de un objeto bytes inicializado a cero.
pt_pt: Calcular uma representação em bytes do objeto *o*. ``NULL`` é retornado em caso de falha e um objeto bytes em caso de sucesso. Isto é equivalente à expressão Python ``bytes(o)``, quando *o* não é um inteiro. Ao contrário de ``bytes(o)``, um TypeError é levantado quando *o* é um inteiro em vez de um objeto bytes inicializado com zeros.
ru: Вычислить байтовое представление объекта *o*. ``NULL`` возвращается в случае неудачи и объект bytes в случае успеха. Это эквивалентно выражению Python ``bytes(o)``, когда *o* не является целым числом. В отличие от ``bytes(o)``, TypeError возникает, когда *o* является целым числом, а не объектом байтов, инициализированным нулем.

source: Return ``1`` if the class *derived* is identical to or derived from the class *cls*, otherwise return ``0``. In case of an error, return ``-1``.
es_es: Devuelve ``1`` si la clase *derived* es idéntica o derivada de la clase *cls*, en caso contrario devuelve ``0``. En caso de error, devuelve ``-1``.
pt_pt: Retorna ``1`` se a classe *derived* for idêntica ou derivada da classe *cls*, caso contrário retorna ``0``. Em caso de erro, retorna ``-1``.
ru: Верните ``1``, если класс *derived* идентичен классу *cls* или является его производным, в противном случае верните ``0``. В случае ошибки верните ``-1``.

source: If *cls* is a tuple, the check will be done against every entry in *cls*. The result will be ``1`` when at least one of the checks returns ``1``, otherwise it will be ``0``.
es_es: Si *cls* es una tupla, la comprobación se realizará con cada entrada de *cls*. El resultado será ``1`` cuando al menos una de las comprobaciones devuelva ``1``, en caso contrario será ``0``.
pt_pt: Se *cls* for uma tupla, a verificação será feita contra cada entrada em *cls*. O resultado será ``1`` quando pelo menos uma das verificações retornar ``1``, caso contrário será ``0``.
ru: Если *cls* является кортежем, проверка будет выполняться для каждой записи в *cls*. Результатом будет ``1``, если хотя бы одна из проверок вернет ``1``, в противном случае это будет ``0``.

source: If *cls* has a :meth:`~type.__subclasscheck__` method, it will be called to determine the subclass status as described in :pep:`3119`. Otherwise, *derived* is a subclass of *cls* if it is a direct or indirect subclass, i.e. contained in :attr:`cls.__mro__ <type.__mro__>`.
es_es: Если *cls* имеет метод :meth:`~type.__subclasscheck__`, он будет вызываться для определения статуса подкласса, как описано в :pep:`3119`. В противном случае *derived* является подклассом *cls*, если он является прямым или косвенным подклассом, т.е. содержится в :attr:`cls.__mro__ <type.__mro__>`.
pt_pt: Se *cls* tiver um método :meth:`~type.__subclasscheck__`, ele será chamado para determinar o estado de subclasse como descrito em :pep:`3119`. Caso contrário, *derived* é uma subclasse de *cls* se for uma subclasse direta ou indireta, ou seja, contida em :attr:`cls.__mro__ <type.__mro__>`.

source: Normally only class objects, i.e. instances of :class:`type` or a derived class, are considered classes. However, objects can override this by having a :attr:`~type.__bases__` attribute (which must be a tuple of base classes).
es_es: Обычно классами считаются только объекты класса, то есть экземпляры :class:`type` или производного класса. Однако объекты могут переопределить это, имея атрибут :attr:`~type.__bases__` (который должен представлять собой кортеж базовых классов).
pt_pt: Normalmente, apenas objetos de classe, ou seja, instâncias de :class:`type` ou de uma classe derivada, são considerados classes. No entanto, os objetos podem substituir isto tendo um atributo :attr:`~type.__bases__` (que deve ser uma tupla de classes base).

source: Return ``1`` if *inst* is an instance of the class *cls* or a subclass of *cls*, or ``0`` if not. On error, returns ``-1`` and sets an exception.
es_es: Devuelve ``1`` si *inst* es una instancia de la clase *cls* o una subclase de *cls*, o ``0`` en caso contrario. En caso de error, devuelve ``-1`` y establece una excepción.
pt_pt: Retorna ``1`` se *inst* for uma instância da classe *cls* ou de uma subclasse de *cls*, ou ``0`` caso contrário. Em caso de erro, retorna ``-1`` e define uma exceção.
ru: Возвращайте ``1``, если *inst* является экземпляром класса *cls* или подклассом *cls*, или ``0`` в противном случае. В случае ошибки возвращает ``-1`` и устанавливает исключение.

source: If *cls* has a :meth:`~type.__instancecheck__` method, it will be called to determine the subclass status as described in :pep:`3119`. Otherwise, *inst* is an instance of *cls* if its class is a subclass of *cls*.
es_es: Если *cls* имеет метод :meth:`~type.__instancecheck__`, он будет вызываться для определения статуса подкласса, как описано в :pep:`3119`. В противном случае *inst* является экземпляром *cls*, если его класс является подклассом *cls*.
pt_pt: Se *cls* tiver um método :meth:`~type.__instancecheck__`, ele será chamado para determinar o estado de instância como descrito em :pep:`3119`. Caso contrário, *inst* é uma instância de *cls* se a sua classe for uma subclasse de *cls*.

source: An instance *inst* can override what is considered its class by having a :attr:`~object.__class__` attribute.
es_es: Экземпляр *inst* может переопределить то, что считается его классом, имея атрибут :attr:`~object.__class__`.
pt_pt: Uma instância *inst* pode substituir o que é considerado a sua classe tendo um atributo :attr:`~object.__class__`.

source: An object *cls* can override if it is considered a class, and what its base classes are, by having a :attr:`~type.__bases__` attribute (which must be a tuple of base classes).
es_es: Объект *cls* может переопределить, считается ли он классом и каковы его базовые классы, имея атрибут :attr:`~type.__bases__` (который должен быть кортежем базовых классов).
pt_pt: Um objeto *cls* pode substituir se é considerado uma classe, e quais são as suas classes base, tendo um atributo :attr:`~type.__bases__` (que deve ser uma tupla de classes base).

source: Compute and return the hash value of an object *o*. On failure, return ``-1``. This is the equivalent of the Python expression ``hash(o)``.
es_es: Calcula y devuelve el valor hash de un objeto *o*. En caso de fallo, devuelve ``-1``. Esto es equivalente a la expresión de Python ``hash(o)``.
pt_pt: Calcular e retornar o valor de hash de um objeto *o*. Em caso de falha, retorna ``-1``. Isto é equivalente à expressão Python ``hash(o)``.
ru: Вычислите и верните хэш-значение объекта *o*. В случае неудачи верните ``-1``. Это эквивалент выражения Python «hash(o)».

source: The return type is now Py_hash_t. This is a signed integer the same size as :c:type:`Py_ssize_t`.
es_es: El tipo de retorno es ahora Py_hash_t. Se trata de un entero con signo del mismo tamaño que :c:type:`Py_ssize_t`.
pt_pt: O tipo de retorno é agora Py_hash_t. Isto é um inteiro com sinal do mesmo tamanho que :c:type:`Py_ssize_t`.
ru: Тип возвращаемого значения теперь — Py_hash_t. Это целое число со знаком того же размера, что и :c:type:`Py_ssize_t`.

source: Set a :exc:`TypeError` indicating that ``type(o)`` is not :term:`hashable` and return ``-1``. This function receives special treatment when stored in a ``tp_hash`` slot, allowing a type to explicitly indicate to the interpreter that it is not hashable.
es_es: Установите :exc:`TypeError`, указывающий, что ``type(o)`` не является :term:`hashable`, и верните ``-1``. Эта функция получает специальную обработку при хранении в слоте tp_hash, что позволяет типу явно указать интерпретатору, что он не является хэшируемым.
pt_pt: Definir um :exc:`TypeError` indicando que ``type(o)`` não é :term:`hashable` e retornar ``-1``. Esta função recebe tratamento especial quando armazenada num slot ``tp_hash``, permitindo que um tipo indique explicitamente ao interpretador que não é hashable.
ru: Установите :exc:`TypeError`, указывающий, что ``type(o)`` не является :term:`hashable`, и верните ``-1``. Эта функция получает специальную обработку при хранении в слоте tp_hash, что позволяет типу явно указать интерпретатору, что он не является хэшируемым.

source: Returns ``1`` if the object *o* is considered to be true, and ``0`` otherwise. This is equivalent to the Python expression ``not not o``. On failure, return ``-1``.
es_es: Devuelve ``1`` si el objeto *o* se considera verdadero, y ``0`` en caso contrario. Esto es equivalente a la expresión de Python ``not not o``. En caso de fallo, devuelve ``-1``.
pt_pt: Retorna ``1`` se o objeto *o* for considerado verdadeiro, e ``0`` caso contrário. Isto é equivalente à expressão Python ``not not o``. Em caso de falha, retorna ``-1``.
ru: Возвращает ``1``, если объект *o* считается истинным, и ``0`` в противном случае. Это эквивалентно выражению Python «not not o». В случае неудачи верните ``-1``.

source: Returns ``0`` if the object *o* is considered to be true, and ``1`` otherwise. This is equivalent to the Python expression ``not o``. On failure, return ``-1``.
es_es: Devuelve ``0`` si el objeto *o* se considera verdadero, y ``1`` en caso contrario. Esto es equivalente a la expresión de Python ``not o``. En caso de fallo, devuelve ``-1``.
pt_pt: Retorna ``0`` se o objeto *o* for considerado verdadeiro, e ``1`` caso contrário. Isto é equivalente à expressão Python ``not o``. Em caso de falha, retorna ``-1``.
ru: Возвращает ``0``, если объект *o* считается истинным, и ``1`` в противном случае. Это эквивалентно выражению Python «not o». В случае неудачи верните ``-1``.
