Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/perfmaps.po
Languages: es_es, pt_pt

source: Support for Perf Maps
es_es: Soporte para Perf Maps
pt_pt: Suporte para Perf Maps

source: On supported platforms (as of this writing, only Linux), the runtime can take advantage of *perf map files* to make Python functions visible to an external profiling tool (such as `perf <https://perf.wiki.kernel.org/index.php/Main_Page>`_). A running process may create a file in the ``/tmp`` directory, which contains entries that can map a section of executable code to a name. This interface is described in the `documentation of the Linux Perf tool <https://git.kernel.org/pub/scm/linux/ kernel/git/torvalds/linux.git/tree/tools/perf/Documentation/jit-interface.txt>`_.
es_es: En las plataformas soportadas (en el momento de escribir esto, sólo Linux), el tiempo de ejecución puede aprovecharse de *perf map files* para hacer visibles las funciones de Python a una herramienta externa de perfilado (como `perf <https://perf.wiki.kernel.org/index.php/Main_Page>`_). Un proceso en ejecución puede crear un fichero en el directorio ``/tmp``, que contiene entradas que pueden mapear una sección de código ejecutable a un nombre. Esta interfaz se describe en la `documentación de la herramienta Perf de Linux <https://git.kernel.org/pub/scm/linux/ kernel/git/torvalds/linux.git/tree/tools/perf/Documentation/jit-interface.txt>`_.
pt_pt: Em plataformas suportadas (no momento da redação deste artigo, apenas Linux), o tempo de execução pode aproveitar os *ficheiros de mapa perf* para tornar as funções Python visíveis para uma ferramenta de perfilagem externa (como `perf <https://perf.wiki.kernel.org/index.php/Main_Page>`_). Um processo em execução pode criar um ficheiro no diretório ``/tmp``, que contém entradas que podem mapear uma secção do código executável para um nome. Esta interface é descrita na `documentação da ferramenta Linux Perf <https://git.kernel.org/pub/scm/linux/ kernel/git/torvalds/linux.git/tree/tools/perf/Documentation/jit-interface.txt>`_.

source: In Python, these helper APIs can be used by libraries and features that rely on generating machine code on the fly.
es_es: En Python, estas API de ayuda pueden ser utilizadas por bibliotecas y funciones que dependen de la generación de código máquina sobre la marcha.
pt_pt: Em Python, essas APIs auxiliares podem ser usadas por bibliotecas e recursos que dependem da geração de código de máquina em tempo real.

source: Note that holding the Global Interpreter Lock (GIL) is not required for these APIs.
es_es: Tenga en cuenta que para estas APIs no es necesario mantener el Bloqueo Global del Intérprete (GIL).

source: Open the ``/tmp/perf-$pid.map`` file, unless it's already opened, and create a lock to ensure thread-safe writes to the file (provided the writes are done through :c:func:`PyUnstable_WritePerfMapEntry`). Normally, there's no need to call this explicitly; just use :c:func:`PyUnstable_WritePerfMapEntry` and it will initialize the state on first call.
es_es: Abre el archivo ``/tmp/perf-$pid.map``, a menos que ya esté abierto, y crea un bloqueo para garantizar que las escrituras en el archivo sean seguras (siempre que las escrituras se realicen a través de :c:func:`PyUnstable_WritePerfMapEntry`). Normalmente, no hay necesidad de llamar a esto explícitamente; sólo tiene que utilizar :c:func:`PyUnstable_WritePerfMapEntry` y se inicializará el estado en la primera llamada.
pt_pt: Abra o ficheiro ``/tmp/perf-$pid.map``, a menos que já esteja aberto, e crie um bloqueio para garantir gravações seguras no ficheiro (desde que as gravações sejam feitas através de :c:func:`PyUnstable_WritePerfMapEntry`). Normalmente, não há necessidade de chamar isso explicitamente; basta usar :c:func:`PyUnstable_WritePerfMapEntry` e ele inicializará o estado na primeira chamada.

source: Returns ``0`` on success, ``-1`` on failure to create/open the perf map file, or ``-2`` on failure to create a lock. Check ``errno`` for more information about the cause of a failure.
es_es: Devuelve ``0`` en caso de éxito, ``-1`` en caso de fallo al crear/abrir el archivo de mapa de rendimiento, o ``-2`` en caso de fallo al crear un bloqueo. Consulte ``errno`` para obtener más información sobre la causa de un fallo.
pt_pt: Retorna ``0`` em caso de sucesso, ``-1`` em caso de falha ao criar/abrir o ficheiro de mapa de desempenho ou ``-2`` em caso de falha ao criar um bloqueio. Verifique ``errno`` para obter mais informações sobre a causa da falha.

source: Write one single entry to the ``/tmp/perf-$pid.map`` file. This function is thread safe. Here is what an example entry looks like::
es_es: Escribe una única entrada en el archivo ``/tmp/perf-$pid.map``. Esta función es thread safe. Aquí está lo que una entrada de ejemplo parece::
pt_pt: Escreve uma única entrada no ficheiro ``/tmp/perf-$pid.map``. Esta função é segura para threads. Aqui está um exemplo de como uma entrada parece-se::

source: # address size name 7f3529fcf759 b py::bar:/run/t.py
es_es: # dirección tamaño nombre 7f3529fcf759 b py::bar:/run/t.py
pt_pt: # endereço tamanho nome 7f3529fcf759 b py::bar:/run/t.py

source: Will call :c:func:`PyUnstable_PerfMapState_Init` before writing the entry, if the perf map file is not already opened. Returns ``0`` on success, or the same error codes as :c:func:`PyUnstable_PerfMapState_Init` on failure.
es_es: Llamará a :c:func:`PyUnstable_PerfMapState_Init` antes de escribir la entrada, si el archivo de mapa de perf no está ya abierto. Devuelve ``0`` en caso de éxito, o los mismos códigos de error que :c:func:`PyUnstable_PerfMapState_Init` en caso de fallo.
pt_pt: Chamará :c:func:`PyUnstable_PerfMapState_Init` antes de gravar a entrada, se o ficheiro de mapa de desempenho ainda não estiver aberto. Retorna ``0`` em caso de sucesso ou os mesmos códigos de erro que :c:func:`PyUnstable_PerfMapState_Init` em caso de falha.

source: Close the perf map file opened by :c:func:`PyUnstable_PerfMapState_Init`. This is called by the runtime itself during interpreter shut-down. In general, there shouldn't be a reason to explicitly call this, except to handle specific scenarios such as forking.
es_es: Cierra el archivo de mapa de rendimiento abierto por :c:func:`PyUnstable_PerfMapState_Init`. Esto es llamado por el propio runtime durante el cierre del intérprete. En general, no debería haber una razón para llamar explícitamente a esto, excepto para manejar escenarios específicos como la bifurcación.
pt_pt: Fecha o ficheiro de mapa de desempenho aberto por :c:func:`PyUnstable_PerfMapState_Init`. Isto é chamado pelo próprio tempo de execução durante o encerramento do interpretador. Em geral, não deve haver motivo para chamar isto explicitamente, exceto para lidar com cenários específicos, como forking.

source: Note that holding an :term:`attached thread state` is not required for these APIs.
pt_pt: Observe que não é necessário manter um :term:`estado de thread anexado` para essas APIs.
