Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/sequence.po
Languages: ru, sv

source: Sequence Protocol
ru: Протокол последовательности
sv: Sekvensprotokoll

source: Return ``1`` if the object provides the sequence protocol, and ``0`` otherwise. Note that it returns ``1`` for Python classes with a :meth:`~object.__getitem__` method, unless they are :class:`dict` subclasses, since in general it is impossible to determine what type of keys the class supports. This function always succeeds.
ru: Возвращайте ``1``, если объект предоставляет протокол последовательности, и ``0`` в противном случае. Обратите внимание, что он возвращает ``1`` для классов Python с помощью метода :meth:`~object.__getitem__`, если только они не являются подклассами :class:`dict`, поскольку в общем случае невозможно определить, какой тип ключей принадлежит классу. поддерживает. Эта функция всегда завершается успешно.

source: Returns the number of objects in sequence *o* on success, and ``-1`` on failure. This is equivalent to the Python expression ``len(o)``.
ru: Возвращает количество объектов в последовательности *o* в случае успеха и ``-1`` в случае неудачи. Это эквивалентно выражению Python ``len(o)``.
sv: Returnerar antalet objekt i sekvensen *o* vid framgång, och ``\-1`` vid misslyckande. Detta är likvärdigt med Python-uttrycket ``len(o)``.

source: Return the concatenation of *o1* and *o2* on success, and ``NULL`` on failure. This is the equivalent of the Python expression ``o1 + o2``.
ru: Возвращает объединение *o1* и *o2* в случае успеха и ``NULL`` в случае неудачи. Это эквивалент выражения Python ``o1 + o2``.
sv: Returnerar konkateneringen av *o1* och *o2* vid framgång och ``NULL`` vid misslyckande. Detta är motsvarigheten till Python-uttrycket ``o1 + o2``.

source: Return the result of repeating sequence object *o* *count* times, or ``NULL`` on failure. This is the equivalent of the Python expression ``o * count``.
ru: Возвращает результат повторения объекта последовательности *o* *count* раз или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o * count``.
sv: Returnerar resultatet av att upprepa sekvensobjektet *o* *count* gånger, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o * count``.

source: Return the concatenation of *o1* and *o2* on success, and ``NULL`` on failure. The operation is done *in-place* when *o1* supports it. This is the equivalent of the Python expression ``o1 += o2``.
ru: Возвращает объединение *o1* и *o2* в случае успеха и ``NULL`` в случае неудачи. Операция выполняется *на месте*, если *o1* поддерживает ее. Это эквивалент выражения Python ``o1 += o2``.
sv: Returnerar konkateneringen av *o1* och *o2* vid framgång, och ``NULL`` vid misslyckande. Operationen utförs *in-place* när *o1* stöder det. Detta är motsvarigheten till Python-uttrycket ``o1 += o2``.

source: Return the result of repeating sequence object *o* *count* times, or ``NULL`` on failure. The operation is done *in-place* when *o* supports it. This is the equivalent of the Python expression ``o *= count``.
ru: Возвращает результат повторения объекта последовательности *o* *count* раз или ``NULL`` в случае ошибки. Операция выполняется *на месте*, если *o* ее поддерживает. Это эквивалент выражения Python ``o *= count``.
sv: Returnerar resultatet av att upprepa sekvensobjektet *o* *antal* gånger, eller ``NULL`` om det misslyckas. Operationen görs *in-place* när *o* stöder den. Detta är motsvarigheten till Python-uttrycket ``o *= count``.

source: Return the *i*\ th element of *o*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o[i]``.
ru: Возвращает *i*\-й элемент *o* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o[i]``.
sv: Returnerar det *i*\:e elementet i *o*, eller ``NULL`` om det misslyckas. Detta är motsvarigheten till Python-uttrycket ``o[i]``.

source: Return the slice of sequence object *o* between *i1* and *i2*, or ``NULL`` on failure. This is the equivalent of the Python expression ``o[i1:i2]``.
ru: Возвращает фрагмент объекта последовательности *o* между *i1* и *i2* или ``NULL`` в случае ошибки. Это эквивалент выражения Python ``o[i1:i2]``.
sv: Returnerar den del av sekvensobjektet *o* som ligger mellan *i1* och *i2*, eller ``NULL`` om den misslyckas. Detta är motsvarigheten till Python-uttrycket ``o[i1:i2]``.

source: Assign object *v* to the *i*\ th element of *o*. Raise an exception and return ``-1`` on failure; return ``0`` on success. This is the equivalent of the Python statement ``o[i] = v``. This function *does not* steal a reference to *v*.
ru: Присвойте объект *v* *i*\-му элементу *o*. Вызвать исключение и вернуть ``-1`` в случае неудачи; верните ``0`` в случае успеха. Это эквивалент оператора Python ``o[i] = v``. Эта функция *не* крадет ссылку на *v*.
sv: Tilldela objekt *v* till det *i*:e elementet i *o*. Utlös ett undantag och returnera ``\-1`` vid misslyckande; returnera ``0`` vid framgång. Detta är motsvarigheten till Python-satsen ``o[i] = v``. Den här funktionen *stjäl* inte en referens till *v*.

source: If *v* is ``NULL``, the element is deleted, but this feature is deprecated in favour of using :c:func:`PySequence_DelItem`.
ru: Если *v* имеет значение ``NULL``, элемент удаляется, но эта функция устарела в пользу использования :c:func:`PySequence_DelItem`.
sv: Om *v* är ``NULL`` raderas elementet, men denna funktion är föråldrad till förmån för användning av :c:func:`PySequence_DelItem`.

source: Delete the *i*\ th element of object *o*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``del o[i]``.
ru: Удалить *i*\-й элемент объекта *o*. Возвращает ``-1`` в случае неудачи. Это эквивалент оператора Python del o[i]``.
sv: Ta bort det *i*\:e elementet i objektet *o*. Returnerar ``\-1`` om det misslyckas. Detta är motsvarigheten till Python-satsen ``del o[i]``.

source: Assign the sequence object *v* to the slice in sequence object *o* from *i1* to *i2*. This is the equivalent of the Python statement ``o[i1:i2] = v``.
ru: Назначьте объект последовательности *v* срезу в объекте последовательности *o* от *i1* до *i2*. Это эквивалент оператора Python ``o[i1:i2] = v``.
sv: Tilldela sekvensobjektet *v* till snittet i sekvensobjektet *o* från *i1* till *i2*. Detta är motsvarigheten till Python-satsen ``o[i1:i2] = v``.

source: Delete the slice in sequence object *o* from *i1* to *i2*. Returns ``-1`` on failure. This is the equivalent of the Python statement ``del o[i1:i2]``.
ru: Удалите фрагмент в объекте последовательности *o* от *i1* до *i2*. Возвращает ``-1`` в случае неудачи. Это эквивалент оператора Python del o[i1:i2]``.
sv: Raderar delen i sekvensobjektet *o* från *i1* till *i2*. Returnerar ``\-1`` om det misslyckas. Detta är motsvarigheten till Python-satsen ``del o[i1:i2]``.

source: Return the number of occurrences of *value* in *o*, that is, return the number of keys for which ``o[key] == value``. On failure, return ``-1``. This is equivalent to the Python expression ``o.count(value)``.
ru: Возвращает количество вхождений *value* в *o*, то есть возвращает количество ключей, для которых ``o[key] == value``. В случае неудачи верните ``-1``. Это эквивалентно выражению Python ``o.count(value)``.
sv: Returnerar antalet förekomster av *värde* i *o*, det vill säga returnerar antalet nycklar för vilka ``o[key] == value``. Vid misslyckande returneras ``\-1``. Detta är likvärdigt med Python-uttrycket ``o.count(value)``.

source: Determine if *o* contains *value*. If an item in *o* is equal to *value*, return ``1``, otherwise return ``0``. On error, return ``-1``. This is equivalent to the Python expression ``value in o``.
ru: Определите, содержит ли *o* *value*. Если элемент в *o* равен *value*, верните ``1``, в противном случае верните ``0``. В случае ошибки верните ``-1``. Это эквивалентно выражению Python «значение в o».
sv: Bestäm om *o* innehåller *värde*. Om en post i *o* är lika med *värde*, returneras ``1``, annars returneras ``0``. Vid fel returneras ``\-1``. Detta är likvärdigt med Python-uttrycket ``value in o``.

source: Return the first index *i* for which ``o[i] == value``. On error, return ``-1``. This is equivalent to the Python expression ``o.index(value)``.
ru: Возвращает первый индекс *i*, для которого ``o[i] == value``. В случае ошибки верните ``-1``. Это эквивалентно выражению Python ``o.index(value)``.
sv: Returnerar det första indexet *i* för vilket ``o[i] == value``. Vid fel returneras ``\-1``. Detta är likvärdigt med Python-uttrycket ``o.index(value)``.

source: Return a list object with the same contents as the sequence or iterable *o*, or ``NULL`` on failure. The returned list is guaranteed to be new. This is equivalent to the Python expression ``list(o)``.
ru: Возвращает объект списка с тем же содержимым, что и последовательность или итерируемый объект *o*, или ``NULL`` в случае ошибки. Возвращаемый список гарантированно будет новым. Это эквивалентно выражению Python ``list(o)``.
sv: Returnerar ett listobjekt med samma innehåll som sekvensen eller iterabeln *o*, eller ``NULL`` om det misslyckas. Den returnerade listan är garanterat ny. Detta är likvärdigt med Python-uttrycket ``list(o)``.

source: Return a tuple object with the same contents as the sequence or iterable *o*, or ``NULL`` on failure. If *o* is a tuple, a new reference will be returned, otherwise a tuple will be constructed with the appropriate contents. This is equivalent to the Python expression ``tuple(o)``.
ru: Возвращает объект-кортеж с тем же содержимым, что и последовательность или итерируемый объект *o*, или ``NULL`` в случае ошибки. Если *o* является кортежем, будет возвращена новая ссылка, в противном случае кортеж будет создан с соответствующим содержимым. Это эквивалентно выражению Python ``tuple(o)``.
sv: Returnerar ett tuple-objekt med samma innehåll som sekvensen eller iterabeln *o*, eller ``NULL`` om det misslyckas. Om *o* är en tupel returneras en ny referens, annars konstrueras en tupel med lämpligt innehåll. Detta är likvärdigt med Python-uttrycket ``tuple(o)``.

source: Return the sequence or iterable *o* as an object usable by the other ``PySequence_Fast*`` family of functions. If the object is not a sequence or iterable, raises :exc:`TypeError` with *m* as the message text. Returns ``NULL`` on failure.
ru: Возвращает последовательность или итерируемый объект *o* как объект, используемый другим семейством функций ``PySequence_Fast*``. Если объект не является последовательностью или итерируемым объектом, выдается :exc:`TypeError` с *m* в качестве текста сообщения. Возвращает NULL в случае ошибки.
sv: Returnerar sekvensen eller den itererbara *o* som ett objekt som kan användas av andra funktioner i familjen ``PySequence_Fast*``. Om objektet inte är en sekvens eller itererbart, genereras :exc:`TypeError` med *m* som meddelandetext. Returnerar ``NULL`` vid fel.

source: The ``PySequence_Fast*`` functions are thus named because they assume *o* is a :c:type:`PyTupleObject` or a :c:type:`PyListObject` and access the data fields of *o* directly.
ru: Функции ``PySequence_Fast*`` названы таким образом, потому что они предполагают, что *o* является :c:type:`PyTupleObject` или :c:type:`PyListObject`, и обращаются к полям данных *o* напрямую.
sv: Funktionerna ``PySequence_Fast*`` har fått detta namn eftersom de antar att *o* är ett :c:type:`PyTupleObject` eller ett :c:type:`PyListObject` och har direkt åtkomst till datafälten i *o*.

source: As a CPython implementation detail, if *o* is already a sequence or list, it will be returned.
ru: В качестве детали реализации CPython, если *o* уже является последовательностью или списком, оно будет возвращено.
sv: Som en detalj i CPython-implementeringen, om *o* redan är en sekvens eller lista, kommer den att returneras.

source: Returns the length of *o*, assuming that *o* was returned by :c:func:`PySequence_Fast` and that *o* is not ``NULL``. The size can also be retrieved by calling :c:func:`PySequence_Size` on *o*, but :c:func:`PySequence_Fast_GET_SIZE` is faster because it can assume *o* is a list or tuple.
ru: Возвращает длину *o*, предполагая, что *o* было возвращено :c:func:`PySequence_Fast` и что *o* не равно ``NULL``. Размер также можно получить, вызвав :c:func:`PySequence_Size` для *o*, но :c:func:`PySequence_Fast_GET_SIZE` работает быстрее, поскольку может считать, что *o* — это список или кортеж.
sv: Returnerar längden på *o*, förutsatt att *o* returnerades av :c:func:`PySequence_Fast` och att *o* inte är ``NULL``. Storleken kan också hämtas genom att anropa :c:func:`PySequence_Size` på *o*, men :c:func:`PySequence_Fast_GET_SIZE` är snabbare eftersom den kan anta att *o* är en lista eller tupel.

source: Return the *i*\ th element of *o*, assuming that *o* was returned by :c:func:`PySequence_Fast`, *o* is not ``NULL``, and that *i* is within bounds.
ru: Верните *i*\-й элемент *o*, предполагая, что *o* было возвращено :c:func:`PySequence_Fast`, *o* не равно ``NULL`` и что *i* находится в пределах допустимых значений.
sv: Returnerar det *i*\:e elementet i *o*, förutsatt att *o* returnerades av :c:func:`PySequence_Fast`, att *o* inte är ``NULL`` och att *i* är inom gränserna.

source: Return the underlying array of PyObject pointers. Assumes that *o* was returned by :c:func:`PySequence_Fast` and *o* is not ``NULL``.
ru: Возвращает базовый массив PyObject указателей . Предполагается, что *o* было возвращено :c:func:`PySequence_Fast` и *o* не равно ``NULL``.
sv: Returnerar den underliggande matrisen av PyObject-pekare. Antar att *o* returnerades av :c:func:`PySequence_Fast` och att *o* inte är ``NULL``.

source: Note, if a list gets resized, the reallocation may relocate the items array. So, only use the underlying array pointer in contexts where the sequence cannot change.
ru: Обратите внимание: если размер списка изменяется, перераспределение может привести к перемещению массива элементов. Поэтому используйте указатель базового массива только в тех контекстах, где последовательность не может измениться.
sv: Observera att om en lista ändras i storlek kan omallokeringen flytta objektmatrisen. Använd därför endast den underliggande arraypekaren i sammanhang där sekvensen inte kan ändras.

source: Return the *i*\ th element of *o* or ``NULL`` on failure. Faster form of :c:func:`PySequence_GetItem` but without checking that :c:func:`PySequence_Check` on *o* is true and without adjustment for negative indices.
ru: В случае ошибки вернуть *i*\-й элемент *o* или ``NULL``. Более быстрая форма :c:func:`PySequence_GetItem`, но без проверки истинности :c:func:`PySequence_Check` для *o* и без корректировки отрицательных индексов.
sv: Returnerar *i*\ th elementet i *o* eller ``NULL`` vid fel. Snabbare form av :c:func:`PySequence_GetItem` men utan att kontrollera att :c:func:`PySequence_Check` på *o* är sant och utan justering för negativa index.

source: built-in function
ru: встроенная функция

source: tuple
ru: кортеж
