Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/structures.po
Languages: pt_pt, ru

source: Extension of :c:macro:`METH_FASTCALL` supporting also keyword arguments, with methods of type :c:type:`PyCFunctionFastWithKeywords`. Keyword arguments are passed the same way as in the :ref:`vectorcall protocol <vectorcall>`: there is an additional fourth :c:expr:`PyObject*` parameter which is a tuple representing the names of the keyword arguments (which are guaranteed to be strings) or possibly ``NULL`` if there are no keywords. The values of the keyword arguments are stored in the *args* array, after the positional arguments.
pt_pt: Extensão de :c:macro:`METH_FASTCALL` que suporta também argumentos nomeados, com métodos do tipo :c:type:`PyCFunctionFastWithKeywords`. Os argumentos nomeados são passados da mesma forma que no protocolo :ref:`vectorcall <vectorcall>`: existe um quarto parâmetro adicional :c:expr:`PyObject*` que é um tuplo representando os nomes dos argumentos nomeados (que são garantidamente strings) ou possivelmente ``NULL`` se não houver argumentos nomeados. Os valores dos argumentos nomeados são armazenados no array *args*, após os argumentos posicionais.
ru: Расширение :c:macro:`METH_FASTCALL`, поддерживающее также аргументы ключевых слов, с методами типа :c:type:`PyCFunctionFastWithKeywords`. Аргументы ключевых слов передаются так же, как и в протоколе :ref:`vectorcall <vectorcall>`: есть дополнительный четвертый параметр :c:expr:`PyObject*`, который представляет собой кортеж, представляющий имена аргументов ключевых слов (которые гарантированно будут строками) или, возможно, ``NULL``, если ключевые слова отсутствуют. Значения аргументов ключевого слова сохраняются в массиве *args* после позиционных аргументов.

source: Can only be used in the combination with other flags: :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
pt_pt: Pode ser utilizada apenas em combinação com outras flags: :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
ru: Может использоваться только в сочетании с другими флагами: :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.

source: Extension of :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` supporting the *defining class*, that is, the class that contains the method in question. The defining class might be a superclass of ``Py_TYPE(self)``.
pt_pt: Extensão de :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` que suporta a *classe de definição*, ou seja, a classe que contém o método em questão. A classe de definição pode ser uma superclasse de ``Py_TYPE(self)``.
ru: Расширение :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` поддерживающий *определяющий класс*, то есть класс, содержащий рассматриваемый метод. Определяющий класс может быть суперклассом ``Py_TYPE(self)``.

source: The method needs to be of type :c:type:`PyCMethod`, the same as for ``METH_FASTCALL | METH_KEYWORDS`` with ``defining_class`` argument added after ``self``.
pt_pt: O método precisa de ser do tipo :c:type:`PyCMethod`, o mesmo que para ``METH_FASTCALL | METH_KEYWORDS`` com o argumento ``defining_class`` adicionado após ``self``.
ru: Метод должен иметь тип :c:type:`PyCMethod`, такой же, как для ``METH_FASTCALL | METH_KEYWORDS`` с аргументом ``defining_class``, добавленным после ``self``.

source: Methods without parameters don't need to check whether arguments are given if they are listed with the :c:macro:`METH_NOARGS` flag. They need to be of type :c:type:`PyCFunction`. The first parameter is typically named *self* and will hold a reference to the module or object instance. In all cases the second parameter will be ``NULL``.
pt_pt: Métodos sem parâmetros não precisam de verificar se são fornecidos argumentos se forem listados com a flag :c:macro:`METH_NOARGS`. Devem ser do tipo :c:type:`PyCFunction`. O primeiro parâmetro é tipicamente chamado *self* e conterá uma referência ao módulo ou instância do objeto. Em todos os casos, o segundo parâmetro será ``NULL``.
ru: Методам без параметров не нужно проверять, переданы ли аргументы, если они указаны с флагом :c:macro:`METH_NOARGS`. Они должны иметь тип :c:type:`PyCFunction`. Первый параметр обычно называется *self* и содержит ссылку на экземпляр модуля или объекта. Во всех случаях второй параметр будет NULL.

source: The function must have 2 parameters. Since the second parameter is unused, :c:macro:`Py_UNUSED` can be used to prevent a compiler warning.
pt_pt: A função deve ter 2 parâmetros. Como o segundo parâmetro não é utilizado, pode ser usada a macro :c:macro:`Py_UNUSED` para evitar um aviso do compilador.
ru: Функция должна иметь 2 параметра. Поскольку второй параметр не используется, :c:macro:`Py_UNUSED` можно использовать для предотвращения предупреждения компилятора.

source: Methods with a single object argument can be listed with the :c:macro:`METH_O` flag, instead of invoking :c:func:`PyArg_ParseTuple` with a ``"O"`` argument. They have the type :c:type:`PyCFunction`, with the *self* parameter, and a :c:expr:`PyObject*` parameter representing the single argument.
pt_pt: Métodos com um único argumento de objeto podem ser listados com a flag :c:macro:`METH_O`, em vez de invocar :c:func:`PyArg_ParseTuple` com um argumento ``"O"``. Têm o tipo :c:type:`PyCFunction`, com o parâmetro *self* e um parâmetro :c:expr:`PyObject*` que representa o argumento único.
ru: Методы с одним аргументом объекта могут быть перечислены с флагом :c:macro:`METH_O` вместо вызова :c:func:`PyArg_ParseTuple` с аргументом ``"O"``. Они имеют тип :c:type:`PyCFunction` с параметром *self* и параметром :c:expr:`PyObject*`, представляющим один аргумент.

source: These two constants are not used to indicate the calling convention but the binding when use with methods of classes. These may not be used for functions defined for modules. At most one of these flags may be set for any given method.
pt_pt: Estas duas constantes não são utilizadas para indicar a convenção de chamada, mas sim a ligação quando usadas com métodos de classes. Não podem ser utilizadas para funções definidas para módulos. No máximo, uma destas flags pode ser definida para qualquer método dado.
ru: Эти две константы используются не для обозначения соглашения о вызовах, а для привязки при использовании с методами классов. Их нельзя использовать для функций, определенных для модулей. Для любого метода может быть установлен не более одного из этих флагов.

source: The method will be passed the type object as the first parameter rather than an instance of the type. This is used to create *class methods*, similar to what is created when using the :func:`classmethod` built-in function.
pt_pt: O método receberá o objeto de tipo como primeiro parâmetro em vez de uma instância do tipo. Isto é utilizado para criar *métodos de classe*, semelhante ao que é criado ao utilizar a função incorporada :func:`classmethod`.
ru: Методу будет передан объект типа в качестве первого параметра, а не экземпляр типа. Это используется для создания *методов класса*, аналогично тому, что создается при использовании встроенной функции :func:`classmethod`.

source: The method will be passed ``NULL`` as the first parameter rather than an instance of the type. This is used to create *static methods*, similar to what is created when using the :func:`staticmethod` built-in function.
pt_pt: O método receberá ``NULL`` como primeiro parâmetro em vez de uma instância do tipo. Isto é utilizado para criar *métodos estáticos*, semelhante ao que é criado ao utilizar a função incorporada :func:`staticmethod`.
ru: Методу будет передан NULL в качестве первого параметра, а не экземпляр типа. Это используется для создания *статических методов*, аналогично тому, что создается при использовании встроенной функции :func:`staticmethod`.

source: One other constant controls whether a method is loaded in place of another definition with the same method name.
pt_pt: Outra constante controla se um método é carregado no lugar de outra definição com o mesmo nome de método.
ru: Еще одна константа контролирует, загружается ли метод вместо другого определения с тем же именем метода.

source: The method will be loaded in place of existing definitions. Without *METH_COEXIST*, the default is to skip repeated definitions. Since slot wrappers are loaded before the method table, the existence of a *sq_contains* slot, for example, would generate a wrapped method named :meth:`~object.__contains__` and preclude the loading of a corresponding PyCFunction with the same name. With the flag defined, the PyCFunction will be loaded in place of the wrapper object and will co-exist with the slot. This is helpful because calls to PyCFunctions are optimized more than wrapper object calls.
pt_pt: O método será carregado no lugar de definições existentes. Sem *METH_COEXIST*, o comportamento predefinido é ignorar definições repetidas. Como os wrappers de slots são carregados antes da tabela de métodos, a existência de um slot *sq_contains*, por exemplo, geraria um método encapsulado chamado :meth:`~object.__contains__` e impediria o carregamento de uma PyCFunction correspondente com o mesmo nome. Com a flag definida, a PyCFunction será carregada no lugar do objeto wrapper e coexistirá com o slot. Isto é útil porque as chamadas para PyCFunctions são mais otimizadas do que as chamadas para objetos wrapper.
ru: Метод будет загружен вместо существующих определений. Без *METH_COEXIST* по умолчанию повторяющиеся определения пропускаются. Поскольку оболочки слотов загружаются до таблицы методов, существование слота *sq_contains*, например, приведет к созданию обернутого метода с именем :meth:`~object.__contains__` и предотвратит загрузку соответствующей PyCFunction с тем же именем. Если флаг определен, PyCFunction будет загружен вместо объекта-оболочки и будет сосуществовать со слотом. Это полезно, поскольку вызовы PyCFunctions оптимизированы больше, чем вызовы объектов-оболочек.

source: The type object corresponding to Python C method objects. This is available as :class:`types.BuiltinMethodType` in the Python layer.
pt_pt: O objeto de tipo correspondente a objetos de métodos C em Python. Isto está disponível como :class:`types.BuiltinMethodType` na camada Python.

source: Return true if *op* is an instance of the :c:type:`PyCMethod_Type` type or a subtype of it. This function always succeeds.
pt_pt: Retorna verdadeiro se *op* for uma instância do tipo :c:type:`PyCMethod_Type` ou de um subtipo deste. Esta função sempre tem sucesso.

source: This is the same as :c:func:`PyCMethod_Check`, but does not account for subtypes.
pt_pt: Isto é o mesmo que :c:func:`PyCMethod_Check`, mas não considera subtipos.

source: Turn *ml* into a Python :term:`callable` object. The caller must ensure that *ml* outlives the :term:`callable`. Typically, *ml* is defined as a static variable.
pt_pt: Converte *ml* num objeto Python :term:`chamável`. O chamador deve garantir que *ml* sobrevive ao objeto :term:`chamável`. Tipicamente, *ml* é definido como uma variável estática.
ru: Превратите *ml* в объект Python :term:`callable`. Вызывающий должен гарантировать, что *ml* переживет :term:`callable`. Обычно *ml* определяется как статическая переменная.

source: The *self* parameter will be passed as the *self* argument to the C function in ``ml->ml_meth`` when invoked. *self* can be ``NULL``.
pt_pt: O parâmetro *self* será passado como argumento *self* para a função C em ``ml->ml_meth`` quando invocada. *self* pode ser ``NULL``.
ru: Параметр *self* будет передан как аргумент *self* функции C в ``ml->ml_meth`` при вызове. *self* может быть ``NULL``.

source: The :term:`callable` object's ``__module__`` attribute can be set from the given *module* argument. *module* should be a Python string, which will be used as name of the module the function is defined in. If unavailable, it can be set to :const:`None` or ``NULL``.
pt_pt: O atributo ``__module__`` do objeto :term:`chamável` pode ser definido a partir do argumento *module*. *module* deve ser uma string Python, que será utilizada como nome do módulo onde a função está definida. Se não estiver disponível, pode ser definido como :const:`None` ou ``NULL``.
ru: Атрибут ``__module__`` объекта :term:`callable` может быть установлен из данного аргумента *module*. *module* должен быть строкой Python, которая будет использоваться в качестве имени модуля, в котором определена функция. Если он недоступен, для него можно установить значение :const:`None` или ``NULL``.

source: The *cls* parameter will be passed as the *defining_class* argument to the C function. Must be set if :c:macro:`METH_METHOD` is set on ``ml->ml_flags``.
pt_pt: O parâmetro *cls* será passado como argumento *defining_class* para a função C. Deve ser definido se :c:macro:`METH_METHOD` estiver definido em ``ml->ml_flags``.
ru: Параметр *cls* будет передан в качестве аргумента *defining_class* функции C. Должен быть установлен, если :c:macro:`METH_METHOD` установлен в ``ml->ml_flags``.

source: The type object corresponding to Python C function objects. This is available as :class:`types.BuiltinFunctionType` in the Python layer.
pt_pt: O objeto de tipo correspondente a objetos de funções C em Python. Isto está disponível como :class:`types.BuiltinFunctionType` na camada Python.

source: Return true if *op* is an instance of the :c:type:`PyCFunction_Type` type or a subtype of it. This function always succeeds.
pt_pt: Retorna verdadeiro se *op* for uma instância do tipo :c:type:`PyCFunction_Type` ou de um subtipo deste. Esta função sempre tem sucesso.

source: This is the same as :c:func:`PyCFunction_Check`, but does not account for subtypes.
pt_pt: Isto é o mesmo que :c:func:`PyCFunction_Check`, mas não considera subtipos.

source: Equivalent to ``PyCMethod_New(ml, self, module, NULL)``.
pt_pt: Equivalente a ``PyCMethod_New(ml, self, module, NULL)``.
ru: Эквивалент ``PyCMethod_New(ml, self, Module, NULL)``.

source: Equivalent to ``PyCMethod_New(ml, self, NULL, NULL)``.
pt_pt: Equivalente a ``PyCMethod_New(ml, self, NULL, NULL)``.
ru: Эквивалент ``PyCMethod_New(ml, self, NULL, NULL)``.

source: Get the function's flags on *func* as they were passed to :c:member:`~PyMethodDef.ml_flags`.
pt_pt: Obtém as flags da função em *func* conforme foram passadas para :c:member:`~PyMethodDef.ml_flags`.

source: If *func* is not a C function object, this fails with an exception. *func* must not be ``NULL``.
pt_pt: Se *func* não for um objeto de função C, isto falha com uma exceção. *func* não deve ser ``NULL``.

source: This function returns the function's flags on success, and ``-1`` with an exception set on failure.
pt_pt: Esta função retorna as flags da função em caso de sucesso, e ``-1`` com uma exceção definida em caso de falha.

source: This is the same as :c:func:`PyCFunction_GetFlags`, but without error or type checking.
pt_pt: Isto é o mesmo que :c:func:`PyCFunction_GetFlags`, mas sem verificação de erros ou de tipo.

source: Get the function pointer on *func* as it was passed to :c:member:`~PyMethodDef.ml_meth`.
pt_pt: Obtém o ponteiro da função em *func* conforme foi passado para :c:member:`~PyMethodDef.ml_meth`.

source: This function returns the function pointer on success, and ``NULL`` with an exception set on failure.
pt_pt: Esta função retorna o ponteiro da função em caso de sucesso, e ``NULL`` com uma exceção definida em caso de falha.

source: This is the same as :c:func:`PyCFunction_GetFunction`, but without error or type checking.
pt_pt: Isto é o mesmo que :c:func:`PyCFunction_GetFunction`, mas sem verificação de erros ou de tipo.

source: Get the "self" object on *func*. This is the object that would be passed to the first argument of a :c:type:`PyCFunction`. For C function objects created through a :c:type:`PyMethodDef` on a :c:type:`PyModuleDef`, this is the resulting module object.
pt_pt: Obtém o objeto "self" em *func*. Este é o objeto que seria passado para o primeiro argumento de uma :c:type:`PyCFunction`. Para objetos de função C criados através de uma :c:type:`PyMethodDef` num :c:type:`PyModuleDef`, este é o objeto módulo resultante.

source: This function returns a :term:`borrowed reference` to the "self" object on success, and ``NULL`` with an exception set on failure.
pt_pt: Esta função retorna uma :term:`referência emprestada` para o objeto "self" em caso de sucesso, e ``NULL`` com uma exceção definida em caso de falha.

source: This is the same as :c:func:`PyCFunction_GetSelf`, but without error or type checking.
pt_pt: Isto é o mesmo que :c:func:`PyCFunction_GetSelf`, mas sem verificação de erros ou de tipo.

source: Accessing attributes of extension types
pt_pt: Acesso a atributos de tipos de extensão
ru: Доступ к атрибутам типов расширения

source: Structure which describes an attribute of a type which corresponds to a C struct member. When defining a class, put a NULL-terminated array of these structures in the :c:member:`~PyTypeObject.tp_members` slot.
pt_pt: Estrutura que descreve um atributo de um tipo que corresponde a um membro de uma struct C. Ao definir uma classe, coloque um array terminado por NULL destas estruturas no slot :c:member:`~PyTypeObject.tp_members`.
ru: Структура, описывающая атрибут типа, соответствующего члену структуры C. При определении класса поместите массив этих структур, завершающийся NULL, в слот :c:member:`~PyTypeObject.tp_members`.

source: Its fields are, in order:
pt_pt: Os seus campos são, por ordem:
ru: Его поля по порядку:

source: Name of the member. A NULL value marks the end of a ``PyMemberDef[]`` array.
pt_pt: Nome do membro. Um valor NULL marca o fim de um array ``PyMemberDef[]``.
ru: Имя участника. Значение NULL отмечает конец массива ``PyMemberDef[]``.

source: The string should be static, no copy is made of it.
pt_pt: A string deve ser estática, não é feita nenhuma cópia.
ru: Строка должна быть статической, ее копия не создается.

source: The type of the member in the C struct. See :ref:`PyMemberDef-types` for the possible values.
pt_pt: O tipo do membro na struct C. Consulte :ref:`PyMemberDef-types` para os valores possíveis.
ru: Тип члена в структуре C. См. возможные значения в разделе :ref:`PyMemberDef-types`.

source: The offset in bytes that the member is located on the type’s object struct.
pt_pt: O deslocamento em bytes onde o membro está localizado na struct do objeto do tipo.
ru: объекта

source: Zero or more of the :ref:`PyMemberDef-flags`, combined using bitwise OR.
pt_pt: Zero ou mais das :ref:`PyMemberDef-flags`, combinadas utilizando OR bit a bit.
ru: Ноль или более :ref:`PyMemberDef-флагов`, объединенных с помощью побитового ИЛИ.

source: The docstring, or NULL. The string should be static, no copy is made of it. Typically, it is defined using :c:macro:`PyDoc_STR`.
pt_pt: A docstring, ou NULL. A string deve ser estática, não é feita nenhuma cópia. Tipicamente, é definida utilizando :c:macro:`PyDoc_STR`.
ru: Строка документации или NULL. Строка должна быть статической, ее копия не создается. Обычно он определяется с помощью :c:macro:`PyDoc_STR`.

source: By default (when :c:member:`~PyMemberDef.flags` is ``0``), members allow both read and write access. Use the :c:macro:`Py_READONLY` flag for read-only access. Certain types, like :c:macro:`Py_T_STRING`, imply :c:macro:`Py_READONLY`. Only :c:macro:`Py_T_OBJECT_EX` (and legacy :c:macro:`T_OBJECT`) members can be deleted.
pt_pt: Por predefinição (quando :c:member:`~PyMemberDef.flags` é ``0``), os membros permitem acesso de leitura e escrita. Utilize a flag :c:macro:`Py_READONLY` para acesso apenas de leitura. Certos tipos, como :c:macro:`Py_T_STRING`, implicam :c:macro:`Py_READONLY`. Apenas membros :c:macro:`Py_T_OBJECT_EX` (e legados :c:macro:`T_OBJECT`) podem ser eliminados.
ru: По умолчанию (когда :c:member:`~PyMemberDef.flags` имеет значение ``0``), члены разрешают доступ как для чтения, так и для записи. Используйте флаг :c:macro:`Py_READONLY` для доступа только для чтения. Некоторые типы, например :c:macro:`Py_T_STRING`, подразумевают :c:macro:`Py_READONLY`. Удалить можно только члены :c:macro:`Py_T_OBJECT_EX` (и устаревшие :c:macro:`T_OBJECT`).

source: For heap-allocated types (created using :c:func:`PyType_FromSpec` or similar), ``PyMemberDef`` may contain a definition for the special member ``"__vectorcalloffset__"``, corresponding to :c:member:`~PyTypeObject.tp_vectorcall_offset` in type objects. This member must be defined with ``Py_T_PYSSIZET``, and either ``Py_READONLY`` or ``Py_READONLY | Py_RELATIVE_OFFSET``. For example::
pt_pt: Para tipos alocados em heap (criados utilizando :c:func:`PyType_FromSpec` ou similar), ``PyMemberDef`` pode conter uma definição para o membro especial ``"__vectorcalloffset__"``, correspondente a :c:member:`~PyTypeObject.tp_vectorcall_offset` em objetos de tipo. Este membro deve ser definido com ``Py_T_PYSSIZET``, e com ``Py_READONLY`` ou ``Py_READONLY | Py_RELATIVE_OFFSET``. Por exemplo::

source: static PyMemberDef spam_type_members[] = { {"__vectorcalloffset__", Py_T_PYSSIZET, offsetof(Spam_object, vectorcall), Py_READONLY}, {NULL} /* Sentinel */ };
pt_pt: static PyMemberDef spam_type_members[] = { {"__vectorcalloffset__", Py_T_PYSSIZET, offsetof(Spam_object, vectorcall), Py_READONLY}, {NULL} /* Sentinela */ };

source: (You may need to ``#include <stddef.h>`` for :c:func:`!offsetof`.)
pt_pt: (Pode ser necessário ``#include <stddef.h>`` para :c:func:`!offsetof`.)
ru: (Вам может потребоваться ``#include <stddef.h>`` для :c:func:`!offsetof`.)

source: The legacy offsets :c:member:`~PyTypeObject.tp_dictoffset` and :c:member:`~PyTypeObject.tp_weaklistoffset` can be defined similarly using ``"__dictoffset__"`` and ``"__weaklistoffset__"`` members, but extensions are strongly encouraged to use :c:macro:`Py_TPFLAGS_MANAGED_DICT` and :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead.
pt_pt: Os deslocamentos legados :c:member:`~PyTypeObject.tp_dictoffset` e :c:member:`~PyTypeObject.tp_weaklistoffset` podem ser definidos de forma semelhante utilizando membros ``"__dictoffset__"`` e ``"__weaklistoffset__"``, mas é fortemente recomendado que as extensões utilizem :c:macro:`Py_TPFLAGS_MANAGED_DICT` e :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` em vez disso.
ru: Устаревшие смещения :c:member:`~PyTypeObject.tp_dictoffset` и :c:member:`~PyTypeObject.tp_weaklistoffset` могут быть определены аналогичным образом с использованием членов ``"__dictoffset__"`` и ``"__weaklistoffset__"``, но с расширениями. настоятельно рекомендуется вместо этого использовать :c:macro:`Py_TPFLAGS_MANAGED_DICT` и :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF`.

source: ``PyMemberDef`` is always available. Previously, it required including ``"structmember.h"``.
pt_pt: ``PyMemberDef`` está sempre disponível. Anteriormente, era necessário incluir ``"structmember.h"``.
ru: ``PyMemberDef`` всегда доступен. Раньше требовалось включить ``"structmember.h"``.

source: :c:macro:`Py_RELATIVE_OFFSET` is now allowed for ``"__vectorcalloffset__"``, ``"__dictoffset__"`` and ``"__weaklistoffset__"``.
pt_pt: A macro :c:macro:`Py_RELATIVE_OFFSET` é agora permitida para ``"__vectorcalloffset__"``, ``"__dictoffset__"`` e ``"__weaklistoffset__"``.

source: Get an attribute belonging to the object at address *obj_addr*. The attribute is described by ``PyMemberDef`` *m*. Returns ``NULL`` on error.
pt_pt: Obtém um atributo pertencente ao objeto no endereço *obj_addr*. O atributo é descrito por ``PyMemberDef`` *m*. Retorna ``NULL`` em caso de erro.
ru: Получите атрибут, принадлежащий объекту по адресу *obj_addr*. Атрибут описывается ``PyMemberDef`` *m*. Возвращает ``NULL`` в случае ошибки.
