Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/structures.po
Languages: pt_pt, ru

source: ``PyMember_GetOne`` is always available. Previously, it required including ``"structmember.h"``.
pt_pt: ``PyMember_GetOne`` está sempre disponível. Anteriormente, era necessário incluir ``"structmember.h"``.
ru: ``PyMember_GetOne`` всегда доступен. Раньше требовалось включить ``"structmember.h"``.

source: Set an attribute belonging to the object at address *obj_addr* to object *o*. The attribute to set is described by ``PyMemberDef`` *m*. Returns ``0`` if successful and a negative value on failure.
pt_pt: Define um atributo pertencente ao objeto no endereço *obj_addr* para o objeto *o*. O atributo a definir é descrito por ``PyMemberDef`` *m*. Retorna ``0`` em caso de sucesso e um valor negativo em caso de falha.
ru: Установите атрибут, принадлежащий объекту по адресу *obj_addr*, на объект *o*. Устанавливаемый атрибут описывается ``PyMemberDef`` *m*. Возвращает ``0`` в случае успеха и отрицательное значение в случае неудачи.

source: ``PyMember_SetOne`` is always available. Previously, it required including ``"structmember.h"``.
pt_pt: ``PyMember_SetOne`` está sempre disponível. Anteriormente, era necessário incluir ``"structmember.h"``.
ru: ``PyMember_SetOne`` всегда доступен. Раньше требовалось включить ``"structmember.h"``.

source: Member flags
pt_pt: Flags de membros
ru: Флаги участников

source: The following flags can be used with :c:member:`PyMemberDef.flags`:
pt_pt: As seguintes flags podem ser utilizadas com :c:member:`PyMemberDef.flags`:
ru: Следующие флаги можно использовать с :c:member:`PyMemberDef.flags`:

source: Not writable.
pt_pt: Não gravável.
ru: Недоступен для записи.

source: Emit an ``object.__getattr__`` :ref:`audit event <audit-events>` before reading.
pt_pt: Emite um evento de auditoria :ref:`audit event <audit-events>` de ``object.__getattr__`` antes da leitura.
ru: Перед чтением создайте ``object.__getattr__`` :ref:`audit event <audit-events>`.

source: Indicates that the :c:member:`~PyMemberDef.offset` of this ``PyMemberDef`` entry indicates an offset from the subclass-specific data, rather than from ``PyObject``.
pt_pt: Indica que o :c:member:`~PyMemberDef.offset` desta entrada ``PyMemberDef`` indica um deslocamento a partir dos dados específicos da subclasse, em vez de a partir de ``PyObject``.
ru: Указывает, что :c:member:`~PyMemberDef.offset` этой записи ``PyMemberDef`` указывает смещение от данных, специфичных для подкласса, а не от ``PyObject``.

source: Can only be used as part of the :c:data:`Py_tp_members` :c:type:`slot <PyType_Slot>` when creating a class using negative :c:member:`~PyType_Spec.basicsize`. It is mandatory in that case. When setting :c:member:`~PyTypeObject.tp_members` from the slot during class creation, Python clears the flag and sets :c:member:`PyMemberDef.offset` to the offset from the ``PyObject`` struct.
pt_pt: Pode ser utilizada apenas como parte do :c:data:`Py_tp_members` :c:type:`slot <PyType_Slot>` ao criar uma classe utilizando um :c:member:`~PyType_Spec.basicsize` negativo. É obrigatório nesse caso. Ao definir :c:member:`~PyTypeObject.tp_members` a partir do slot durante a criação da classe, o Python limpa a flag e define :c:member:`PyMemberDef.offset` para o deslocamento a partir da struct ``PyObject``.

source: The :c:macro:`!RESTRICTED`, :c:macro:`!READ_RESTRICTED` and :c:macro:`!WRITE_RESTRICTED` macros available with ``#include "structmember.h"`` are deprecated. :c:macro:`!READ_RESTRICTED` and :c:macro:`!RESTRICTED` are equivalent to :c:macro:`Py_AUDIT_READ`; :c:macro:`!WRITE_RESTRICTED` does nothing.
pt_pt: As macros :c:macro:`!RESTRICTED`, :c:macro:`!READ_RESTRICTED` e :c:macro:`!WRITE_RESTRICTED`, disponíveis com ``#include "structmember.h"``, estão obsoleta. :c:macro:`!READ_RESTRICTED` e :c:macro:`!RESTRICTED` são equivalentes a :c:macro:`Py_AUDIT_READ`; :c:macro:`!WRITE_RESTRICTED` não faz nada.
ru: Макросы :c:macro:`!RESTRICTED`, :c:macro:`!READ_RESTRICTED` и :c:macro:`!WRITE_RESTRICTED`, доступные с ``#include "structmember.h"``, устарели. :c:macro:`!READ_RESTRICTED` и :c:macro:`!RESTRICTED` эквивалентны :c:macro:`Py_AUDIT_READ`; :c:macro:`!WRITE_RESTRICTED` ничего не делает.

source: The :c:macro:`!READONLY` macro was renamed to :c:macro:`Py_READONLY`. The :c:macro:`!PY_AUDIT_READ` macro was renamed with the ``Py_`` prefix. The new names are now always available. Previously, these required ``#include "structmember.h"``. The header is still available and it provides the old names.
pt_pt: A macro :c:macro:`!READONLY` foi renomeada para :c:macro:`Py_READONLY`. A macro :c:macro:`!PY_AUDIT_READ` foi renomeada com o prefixo ``Py_``. Os novos nomes estão agora sempre disponíveis. Anteriormente, era necessário ``#include "structmember.h"``. O cabeçalho ainda está disponível e fornece os nomes antigos.
ru: Макрос :c:macro:`!READONLY` был переименован в :c:macro:`Py_READONLY`. Макрос :c:macro:`!PY_AUDIT_READ` был переименован с префиксом ``Py_``. Новые имена теперь всегда доступны. Раньше для этого требовался ``#include "structmember.h"``. Заголовок все еще доступен и содержит старые имена.

source: Member types
pt_pt: Tipos de membros
ru: Типы участников

source: :c:member:`PyMemberDef.type` can be one of the following macros corresponding to various C types. When the member is accessed in Python, it will be converted to the equivalent Python type. When it is set from Python, it will be converted back to the C type. If that is not possible, an exception such as :exc:`TypeError` or :exc:`ValueError` is raised.
pt_pt: O :c:member:`PyMemberDef.type` pode ser uma das seguintes macros correspondentes a vários tipos C. Quando o membro é acedido em Python, será convertido para o tipo Python equivalente. Quando é definido a partir do Python, será convertido de volta para o tipo C. Se isso não for possível, é levantada uma exceção como :exc:`TypeError` ou :exc:`ValueError`.
ru: :c:member:`PyMemberDef.type` может быть одним из следующих макросов, соответствующих различным типам C. Когда к элементу обращаются в Python, он преобразуется в эквивалентный тип Python. Если он установлен из Python, он будет преобразован обратно в тип C. Если это невозможно, создается исключение, такое как :exc:`TypeError` или :exc:`ValueError`.

source: Unless marked (D), attributes defined this way cannot be deleted using e.g. :keyword:`del` or :py:func:`delattr`.
pt_pt: A menos que marcado com (D), os atributos definidos desta forma não podem ser eliminados utilizando, por exemplo, :keyword:`del` ou :py:func:`delattr`.
ru: Если не отмечено (D), атрибуты, определенные таким образом, не могут быть удалены, например, с помощью :keyword:`del` или :py:func:`delattr`.

source: Macro name
pt_pt: Nome da macro
ru: Название макроса

source: C type
pt_pt: tipo C
ru: Тип C

source: Python type
pt_pt: tipo Python
ru: Тип Python

source: :c:expr:`char` (written as 0 or 1)
pt_pt: :c:expr:`char` (escrito como 0 ou 1)
ru: :c:expr:`char` (записывается как 0 или 1)

source: :py:class:`str` (RO)
pt_pt: :py:class:`str` (SO)

source: :py:class:`object` (D)
pt_pt: :py:class:`object` (E)

source: (*): Zero-terminated, UTF8-encoded C string. With :c:macro:`!Py_T_STRING` the C representation is a pointer; with :c:macro:`!Py_T_STRING_INPLACE` the string is stored directly in the structure.
pt_pt: (*): String C terminada por zero, codificada em UTF8. Com :c:macro:`!Py_T_STRING`, a representação C é um ponteiro; com :c:macro:`!Py_T_STRING_INPLACE`, a string é armazenada diretamente na estrutura.
ru: (*): строка C с нулевым завершением в кодировке UTF8. С :c:macro:`!Py_T_STRING` представление C является указателем; с :c:macro:`!Py_T_STRING_INPLACE` строка сохраняется непосредственно в структуре.

source: (**): String of length 1. Only ASCII is accepted.
pt_pt: (**): String de comprimento 1. Apenas ASCII é aceite.
ru: (**): строка длиной 1. Принимается только ASCII.

source: (RO): Implies :c:macro:`Py_READONLY`.
pt_pt: (SO): Implica :c:macro:`Py_READONLY`.
ru: (RO): подразумевает :c:macro:`Py_READONLY`.

source: (D): Can be deleted, in which case the pointer is set to ``NULL``. Reading a ``NULL`` pointer raises :py:exc:`AttributeError`.
pt_pt: (E): Pode ser eliminado, caso em que o ponteiro é definido para ``NULL``. A leitura de um ponteiro ``NULL`` levanta :py:exc:`AttributeError`.
ru: (D): Можно удалить, в этом случае указатель устанавливается в NULL. Чтение указателя ``NULL`` вызывает :py:exc:`AttributeError`.

source: In previous versions, the macros were only available with ``#include "structmember.h"`` and were named without the ``Py_`` prefix (e.g. as ``T_INT``). The header is still available and contains the old names, along with the following deprecated types:
pt_pt: Em versões anteriores, as macros estavam disponíveis apenas com ``#include "structmember.h"`` e eram nomeadas sem o prefixo ``Py_`` (por exemplo, como ``T_INT``). O cabeçalho ainda está disponível e contém os nomes antigos, juntamente com os seguintes tipos obsoletos:
ru: В предыдущих версиях макросы были доступны только с ``#include "structmember.h"`` и назывались без префикса ``Py_`` (например, как ``T_INT``). Заголовок по-прежнему доступен и содержит старые имена, а также следующие устаревшие типы:

source: Like ``Py_T_OBJECT_EX``, but ``NULL`` is converted to ``None``. This results in surprising behavior in Python: deleting the attribute effectively sets it to ``None``.
pt_pt: Semelhante a ``Py_T_OBJECT_EX``, mas ``NULL`` é convertido para ``None``. Isto resulta em comportamento surpreendente em Python: eliminar o atributo define-o efetivamente para ``None``.
ru: Аналогично Py_T_OBJECT_EX, но NULL преобразуется в None. Это приводит к удивительному поведению Python: удаление атрибута фактически устанавливает его в значение None.

source: Always ``None``. Must be used with :c:macro:`Py_READONLY`.
pt_pt: Sempre ``None``. Deve ser utilizado com :c:macro:`Py_READONLY`.
ru: Всегда ``Нет``. Должен использоваться с :c:macro:`Py_READONLY`.

source: Defining Getters and Setters
pt_pt: Definição de Getters e Setters
ru: Определение геттеров и сеттеров

source: Structure to define property-like access for a type. See also description of the :c:member:`PyTypeObject.tp_getset` slot.
pt_pt: Estrutura para definir acesso semelhante a propriedades para um tipo. Veja também a descrição do slot :c:member:`PyTypeObject.tp_getset`.
ru: Структура для определения доступа к типу наподобие свойства. См. также описание слота :c:member:`PyTypeObject.tp_getset`.

source: attribute name
pt_pt: nome do atributo
ru: имя атрибута

source: C function to get the attribute.
pt_pt: Função C para obter o atributo.
ru: Функция C для получения атрибута.

source: Optional C function to set or delete the attribute. If ``NULL``, the attribute is read-only.
pt_pt: Função C opcional para definir ou eliminar o atributo. Se ``NULL``, o atributo é apenas de leitura.
ru: Дополнительная функция C для установки или удаления атрибута. Если ``NULL``, атрибут доступен только для чтения.

source: optional docstring
pt_pt: docstring opcional
ru: необязательная строка документации

source: Optional user data pointer, providing additional data for getter and setter.
pt_pt: Ponteiro de dados do utilizador opcional, fornecendo dados adicionais para getter e setter.
ru: Необязательный указатель пользовательских данных, предоставляющий дополнительные данные для методов получения и установки.

source: The ``get`` function takes one :c:expr:`PyObject*` parameter (the instance) and a user data pointer (the associated ``closure``):
pt_pt: A função ``get`` recebe um parâmetro :c:expr:`PyObject*` (a instância) e um ponteiro de dados do utilizador (o ``closure`` associado):
ru: Функция get принимает один параметр :c:expr:`PyObject*` (экземпляр) и указатель пользовательских данных (связанное с ним ``замыкание``):

source: It should return a new reference on success or ``NULL`` with a set exception on failure.
pt_pt: Deve retornar uma nova referência em caso de sucesso ou ``NULL`` com uma exceção definida em caso de falha.
ru: Он должен возвращать новую ссылку в случае успеха или ``NULL`` с установленным исключением в случае неудачи.

source: ``set`` functions take two :c:expr:`PyObject*` parameters (the instance and the value to be set) and a user data pointer (the associated ``closure``):
pt_pt: As funções ``set`` recebem dois parâmetros :c:expr:`PyObject*` (a instância e o valor a definir) e um ponteiro de dados do utilizador (o ``closure`` associado):
ru: Функции ``set`` принимают два параметра :c:expr:`PyObject*` (экземпляр и значение, которое нужно установить) и указатель пользовательских данных (связанное с ним ``замыкание``):

source: In case the attribute should be deleted the second parameter is ``NULL``. Should return ``0`` on success or ``-1`` with a set exception on failure.
pt_pt: Caso o atributo deva ser eliminado, o segundo parâmetro é ``NULL``. Deve retornar ``0`` em caso de sucesso ou ``-1`` com uma exceção definida em caso de falha.
ru: В случае, если атрибут должен быть удален, вторым параметром будет ``NULL``. Должен возвращать ``0`` в случае успеха или ``-1`` с установленным исключением в случае неудачи.

source: built-in function
pt_pt: função incorporada
ru: встроенная функция

source: classmethod
pt_pt: método de classe

source: staticmethod
pt_pt: método estático

source: READ_RESTRICTED (C macro)
pt_pt: LEITURA_RESTRITA (macro C)
ru: READ_RESTRICTED (C макрос)

source: WRITE_RESTRICTED (C macro)
pt_pt: ESCRITA_RESTRITA (macro C)
ru: WRITE_RESTRICTED (C макрос)

source: RESTRICTED (C macro)
pt_pt: RESTRITA (macro C)
ru: ОГРАНИЧЕННЫЙ (C макрос)

source: READONLY (C macro)
pt_pt: APENAS_LEITURA (macro C)
ru: READONLY (C макрос)

source: T_BYTE (C macro)
pt_pt: T_BYTE (macro C)
ru: T_BYTE (C макрос)

source: T_SHORT (C macro)
pt_pt: T_SHORT (macro C)
ru: T_SHORT (C макрос)

source: T_INT (C macro)
pt_pt: T_INT (macro C)
ru: T_INT (C макрос)

source: T_LONG (C macro)
pt_pt: T_LONG (macro C)
ru: T_LONG (C макрос)

source: T_LONGLONG (C macro)
pt_pt: T_LONGLONG (macro C)
ru: T_LONGLONG (C макрос)

source: T_UBYTE (C macro)
pt_pt: T_UBYTE (macro C)
ru: T_UBYTE (C макрос)

source: T_USHORT (C macro)
pt_pt: T_USHORT (macro C)
ru: T_USHORT (C макрос)

source: T_UINT (C macro)
pt_pt: T_UINT (macro C)
ru: T_UINT (C макрос)

source: T_ULONG (C macro)
pt_pt: T_ULONG (macro C)
ru: T_ULONG (C макрос)

source: T_ULONGULONG (C macro)
pt_pt: T_ULONGULONG (macro C)
ru: T_ULONGULONG (C макрос)

source: T_PYSSIZET (C macro)
pt_pt: T_PYSSIZET (macro C)
ru: T_PYSSIZET (C макрос)

source: T_FLOAT (C macro)
pt_pt: T_FLOAT (macro C)
ru: T_FLOAT (C макрос)

source: T_DOUBLE (C macro)
pt_pt: T_DOUBLE (macro C)
ru: T_DOUBLE (C макрос)

source: T_BOOL (C macro)
pt_pt: T_BOOL (macro C)
ru: T_BOOL (C макрос)

source: T_CHAR (C macro)
pt_pt: T_CHAR (macro C)
ru: T_CHAR (C макрос)

source: T_STRING (C macro)
pt_pt: T_STRING (macro C)
ru: T_STRING (C макрос)

source: T_STRING_INPLACE (C macro)
pt_pt: T_STRING_INPLACE (macro C)
ru: T_STRING_INPLACE (C макрос)

source: T_OBJECT_EX (C macro)
pt_pt: T_OBJECT_EX (macro C)
ru: T_OBJECT_EX (C макрос)

source: Can only be used as part of :c:member:`Py_tp_members <PyTypeObject.tp_members>` :c:type:`slot <PyType_Slot>` when creating a class using negative :c:member:`~PyType_Spec.basicsize`. It is mandatory in that case.
ru: Может использоваться только как часть :c:member:`Py_tp_members <PyTypeObject.tp_members>` :c:type:`slot <PyType_Slot>` при создании класса с использованием отрицательного :c:member:`~PyType_Spec.basicsize`. В таком случае это обязательно.

source: This flag is only used in :c:type:`PyType_Slot`. When setting :c:member:`~PyTypeObject.tp_members` during class creation, Python clears it and sets :c:member:`PyMemberDef.offset` to the offset from the ``PyObject`` struct.
ru: Этот флаг используется только в :c:type:`PyType_Slot`. При установке :c:member:`~PyTypeObject.tp_members` во время создания класса Python очищает его и устанавливает для :c:member:`PyMemberDef.offset` значение смещения из структуры ``PyObject``.
