Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/structures.po
Languages: pt_pt, ru

source: Common Object Structures
pt_pt: Estruturas Comuns de Objetos
ru: Общие структуры объектов

source: There are a large number of structures which are used in the definition of object types for Python. This section describes these structures and how they are used.
pt_pt: Existe um grande número de estruturas utilizadas na definição de tipos de objetos em Python. Esta secção descreve essas estruturas e como são utilizadas.
ru: Существует большое количество структур, которые используются при определении типов объектов в Python. В этом разделе описываются эти структуры и способы их использования.

source: Base object types and macros
pt_pt: Tipos base de objetos e macros
ru: Базовые типы объектов и макросы

source: All Python objects ultimately share a small number of fields at the beginning of the object's representation in memory. These are represented by the :c:type:`PyObject` and :c:type:`PyVarObject` types, which are defined, in turn, by the expansions of some macros also used, whether directly or indirectly, in the definition of all other Python objects. Additional macros can be found under :ref:`reference counting <countingrefs>`.
pt_pt: Todos os objetos Python partilham, em última instância, um pequeno número de campos no início da representação do objeto na memória. Estes são representados pelos tipos :c:type:`PyObject` e :c:type:`PyVarObject`, que são definidos, por sua vez, pelas expansões de algumas macros também utilizadas, direta ou indiretamente, na definição de todos os outros objetos Python. Macros adicionais podem ser encontradas em :ref:`contagem de referências <countingrefs>`.
ru: Все объекты Python в конечном итоге совместно используют небольшое количество полей в начале представления объекта в памяти. Они представлены типами :c:type:`PyObject` и :c:type:`PyVarObject`, которые, в свою очередь, определяются расширениями некоторых макросов, которые также используются, прямо или косвенно, при определении всех другие объекты Python. Дополнительные макросы можно найти в разделе :ref:`reference counting <countingrefs>`.

source: All object types are extensions of this type. This is a type which contains the information Python needs to treat a pointer to an object as an object. In a normal "release" build, it contains only the object's reference count and a pointer to the corresponding type object. Nothing is actually declared to be a :c:type:`PyObject`, but every pointer to a Python object can be cast to a :c:expr:`PyObject*`.
pt_pt: Todos os tipos de objetos são extensões deste tipo. Este é um tipo que contém a informação que o Python necessita para tratar um ponteiro para um objeto como um objeto. Numa compilação "release" normal, contém apenas a contagem de referências do objeto e um ponteiro para o objeto de tipo correspondente. Nada é declarado explicitamente como :c:type:`PyObject`, mas qualquer ponteiro para um objeto Python pode ser convertido para :c:expr:`PyObject*`.

source: The members must not be accessed directly; instead use macros such as :c:macro:`Py_REFCNT` and :c:macro:`Py_TYPE`.
pt_pt: Os membros não devem ser acedidos diretamente; em vez disso, utilize macros como :c:macro:`Py_REFCNT` e :c:macro:`Py_TYPE`.

source: The object's reference count, as returned by :c:macro:`Py_REFCNT`. Do not use this field directly; instead use functions and macros such as :c:macro:`!Py_REFCNT`, :c:func:`Py_INCREF` and :c:func:`Py_DecRef`.
pt_pt: A contagem de referências do objeto, conforme retornado por :c:macro:`Py_REFCNT`. Não utilize este campo diretamente; em vez disso, utilize funções e macros como :c:macro:`!Py_REFCNT`, :c:func:`Py_INCREF` e :c:func:`Py_DecRef`.

source: The field type may be different from ``Py_ssize_t``, depending on build configuration and platform.
pt_pt: O tipo do campo pode ser diferente de ``Py_ssize_t``, dependendo da configuração da compilação e da plataforma.

source: The object's type. Do not use this field directly; use :c:macro:`Py_TYPE` and :c:func:`Py_SET_TYPE` instead.
pt_pt: O tipo do objeto. Não utilize este campo diretamente; utilize :c:macro:`Py_TYPE` e :c:func:`Py_SET_TYPE` em vez disso.

source: An extension of :c:type:`PyObject` that adds the :c:member:`~PyVarObject.ob_size` field. This is intended for objects that have some notion of *length*.
pt_pt: Uma extensão de :c:type:`PyObject` que adiciona o campo :c:member:`~PyVarObject.ob_size`. Isto destina-se a objetos que têm uma noção de *comprimento*.

source: As with :c:type:`!PyObject`, the members must not be accessed directly; instead use macros such as :c:macro:`Py_SIZE`, :c:macro:`Py_REFCNT` and :c:macro:`Py_TYPE`.
pt_pt: Tal como com :c:type:`!PyObject`, os membros não devem ser acedidos diretamente; em vez disso, utilize macros como :c:macro:`Py_SIZE`, :c:macro:`Py_REFCNT` e :c:macro:`Py_TYPE`.

source: A size field, whose contents should be considered an object's internal implementation detail.
pt_pt: Um campo de tamanho, cujo conteúdo deve ser considerado um detalhe interno da implementação do objeto.

source: Do not use this field directly; use :c:macro:`Py_SIZE` instead.
pt_pt: Não utilize este campo diretamente; utilize :c:macro:`Py_SIZE` em vez disso.

source: Object creation functions such as :c:func:`PyObject_NewVar` will generally set this field to the requested size (number of items). After creation, arbitrary values can be stored in :c:member:`!ob_size` using :c:macro:`Py_SET_SIZE`.
pt_pt: Funções de criação de objetos, como :c:func:`PyObject_NewVar`, geralmente definem este campo para o tamanho solicitado (número de itens). Após a criação, valores arbitrários podem ser armazenados em :c:member:`!ob_size` utilizando :c:macro:`Py_SET_SIZE`.

source: To get an object's publicly exposed length, as returned by the Python function :py:func:`len`, use :c:func:`PyObject_Length` instead.
pt_pt: Para obter o comprimento publicamente exposto de um objeto, conforme retornado pela função Python :py:func:`len`, utilize :c:func:`PyObject_Length` em vez disso.

source: This is a macro used when declaring new types which represent objects without a varying length. The PyObject_HEAD macro expands to::
pt_pt: Esta é uma macro utilizada ao declarar novos tipos que representam objetos sem comprimento variável. A macro PyObject_HEAD expande-se para::
ru: Это макрос, используемый при объявлении новых типов, представляющих объекты без меняющейся длины. Макрос PyObject_HEAD расширяется до::

source: See documentation of :c:type:`PyObject` above.
pt_pt: Consulte a documentação de :c:type:`PyObject` acima.
ru: См. документацию :c:type:`PyObject` выше.

source: This is a macro used when declaring new types which represent objects with a length that varies from instance to instance. The PyObject_VAR_HEAD macro expands to::
pt_pt: Esta é uma macro utilizada ao declarar novos tipos que representam objetos com um comprimento que varia de instância para instância. A macro PyObject_VAR_HEAD expande-se para::
ru: Это макрос, используемый при объявлении новых типов, которые представляют объекты, длина которых варьируется от экземпляра к экземпляру. Макрос PyObject_VAR_HEAD расширяется до::

source: See documentation of :c:type:`PyVarObject` above.
pt_pt: Consulte a documentação de :c:type:`PyVarObject` acima.
ru: См. документацию :c:type:`PyVarObject` выше.

source: The base class of all other objects, the same as :class:`object` in Python.
pt_pt: A classe base de todos os outros objetos, a mesma que :class:`object` em Python.
ru: Базовый класс всех остальных объектов, такой же, как :class:`object` в Python.

source: Test if the *x* object is the *y* object, the same as ``x is y`` in Python.
pt_pt: Testa se o objeto *x* é o objeto *y*, o mesmo que ``x is y`` em Python.
ru: Проверьте, является ли объект *x* объектом *y*, так же, как ``x is y`` в Python.

source: Test if an object is the ``None`` singleton, the same as ``x is None`` in Python.
pt_pt: Testa se um objeto é o singleton ``None``, o mesmo que ``x is None`` em Python.
ru: Проверьте, является ли объект синглтоном None, так же, как x is None в Python.

source: Test if an object is the ``True`` singleton, the same as ``x is True`` in Python.
pt_pt: Testa se um objeto é o singleton ``True``, o mesmo que ``x is True`` em Python.
ru: Проверьте, является ли объект синглтоном ``True``, так же, как ``x is True`` в Python.

source: Test if an object is the ``False`` singleton, the same as ``x is False`` in Python.
pt_pt: Testa se um objeto é o singleton ``False``, o mesmo que ``x is False`` em Python.
ru: Проверьте, является ли объект синглтоном ``False``, так же, как ``x is False`` в Python.

source: Get the type of the Python object *o*.
pt_pt: Obtém o tipo do objeto Python *o*.
ru: Получите тип объекта Python *o*.

source: The returned reference is :term:`borrowed <borrowed reference>` from *o*. Do not release it with :c:func:`Py_DECREF` or similar.
pt_pt: A referência retornada é :term:`emprestada <borrowed reference>` de *o*. Não a libere com :c:func:`Py_DECREF` ou similar.

source: :c:func:`Py_TYPE()` is changed to an inline static function. The parameter type is no longer :c:expr:`const PyObject*`.
pt_pt: :c:func:`Py_TYPE()` foi alterada para uma função estática em linha. O parâmetro type já não é :c:expr:`const PyObject*`.
ru: :c:func:`Py_TYPE()` заменена на встроенную статическую функцию. Тип параметра больше не :c:expr:`const PyObject*`.

source: Return non-zero if the object *o* type is *type*. Return zero otherwise. Equivalent to: ``Py_TYPE(o) == type``.
pt_pt: Retorna um valor não-zero se o tipo do objeto *o* for *type*. Retorna zero caso contrário. Equivalente a: ``Py_TYPE(o) == type``.
ru: Возвращает ненулевое значение, если тип объекта *o* равен *type*. В противном случае верните ноль. Эквивалент: ``Py_TYPE(o) == type``.

source: Set the type of object *o* to *type*, without any checking or reference counting.
pt_pt: Define o tipo do objeto *o* para *type*, sem qualquer verificação ou contagem de referências.

source: This is a very low-level operation. Consider instead setting the Python attribute :attr:`~object.__class__` using :c:func:`PyObject_SetAttrString` or similar.
pt_pt: Esta é uma operação de muito baixo nível. Considere, em vez disso, definir o atributo Python :attr:`~object.__class__` utilizando :c:func:`PyObject_SetAttrString` ou similar.

source: Note that assigning an incompatible type can lead to undefined behavior.
pt_pt: Note que atribuir um tipo incompatível pode levar a comportamento indefinido.

source: If *type* is a :ref:`heap type <heap-types>`, the caller must create a new reference to it. Similarly, if the old type of *o* is a heap type, the caller must release a reference to that type.
pt_pt: Se *type* for um :ref:`tipo heap <heap-types>`, o chamador deve criar uma nova referência para ele. Da mesma forma, se o tipo antigo de *o* for um tipo heap, o chamador deve libertar uma referência para esse tipo.

source: Get the :c:member:`~PyVarObject.ob_size` field of *o*.
pt_pt: Obtém o campo :c:member:`~PyVarObject.ob_size` de *o*.

source: :c:func:`Py_SIZE()` is changed to an inline static function. The parameter type is no longer :c:expr:`const PyVarObject*`.
pt_pt: :c:func:`Py_SIZE()` foi alterada para uma função estática em linha. O parâmetro type já não é :c:expr:`const PyVarObject*`.
ru: :c:func:`Py_SIZE()` заменена на встроенную статическую функцию. Тип параметра больше не :c:expr:`const PyVarObject*`.

source: Set the :c:member:`~PyVarObject.ob_size` field of *o* to *size*.
pt_pt: Define o campo :c:member:`~PyVarObject.ob_size` de *o* para *size*.

source: This is a macro which expands to initialization values for a new :c:type:`PyObject` type. This macro expands to::
pt_pt: Esta é uma macro que se expande para valores de inicialização para um novo tipo :c:type:`PyObject`. Esta macro expande-se para::
ru: Это макрос, который расширяется до значений инициализации для нового типа :c:type:`PyObject`. Этот макрос расширяется до::

source: This is a macro which expands to initialization values for a new :c:type:`PyVarObject` type, including the :c:member:`~PyVarObject.ob_size` field. This macro expands to::
pt_pt: Esta é uma macro que se expande para valores de inicialização para um novo tipo :c:type:`PyVarObject`, incluindo o campo :c:member:`~PyVarObject.ob_size`. Esta macro expande-se para::
ru: Это макрос, который расширяется до значений инициализации для нового типа :c:type:`PyVarObject`, включая поле :c:member:`~PyVarObject.ob_size`. Этот макрос расширяется до::

source: Implementing functions and methods
pt_pt: Implementação de funções e métodos
ru: Реализация функций и методов

source: Type of the functions used to implement most Python callables in C. Functions of this type take two :c:expr:`PyObject*` parameters and return one such value. If the return value is ``NULL``, an exception shall have been set. If not ``NULL``, the return value is interpreted as the return value of the function as exposed in Python. The function must return a new reference.
pt_pt: Tipo das funções utilizadas para implementar a maioria dos objetos chamáveis em Python em C. Funções deste tipo recebem dois parâmetros :c:expr:`PyObject*` e retornam um valor desse tipo. Se o valor de retorno for ``NULL``, uma exceção deve ter sido definida. Se não for ``NULL``, o valor de retorno é interpretado como o valor de retorno da função conforme exposto em Python. A função deve retornar uma nova referência.
ru: Тип функций, используемых для реализации большинства вызываемых объектов Python в C. Функции этого типа принимают два параметра :c:expr:`PyObject*` и возвращают одно такое значение. Если возвращаемое значение равно NULL, должно быть установлено исключение. Если значение не ``NULL``, возвращаемое значение интерпретируется как возвращаемое значение функции, представленное в Python. Функция должна вернуть новую ссылку.

source: The function signature is::
pt_pt: A assinatura da função é::
ru: Сигнатура функции::

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`. The function signature is::
pt_pt: Tipo das funções utilizadas para implementar objetos chamáveis em Python em C com a assinatura :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`. A assinatura da função é::
ru: Тип функций, используемых для реализации вызовов Python в C с сигнатурой :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`. Сигнатура функции:

source: Type of the functions used to implement Python callables in C with signature :c:macro:`METH_FASTCALL`. The function signature is::
pt_pt: Tipo das funções utilizadas para implementar objetos chamáveis em Python em C com a assinatura :c:macro:`METH_FASTCALL`. A assinatura da função é::
ru: Тип функций, используемых для реализации вызовов Python в C с сигнатурой :c:macro:`METH_FASTCALL`. Сигнатура функции:

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>`. The function signature is::
pt_pt: Tipo das funções utilizadas para implementar objetos chamáveis em Python em C com a assinatura :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>`. A assinatura da função é::
ru: Тип функций, используемых для реализации вызовов Python в C с сигнатурой :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>`. Сигнатура функции:

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`. The function signature is::
pt_pt: Tipo das funções utilizadas para implementar objetos chamáveis em Python em C com a assinatura :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`. A assinatura da função é::
ru: Тип функций, используемых для реализации вызовов Python в C с сигнатурой :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`. Сигнатура функции:

source: Structure used to describe a method of an extension type. This structure has four fields:
pt_pt: Estrutura utilizada para descrever um método de um tipo de extensão. Esta estrutura tem quatro campos:
ru: Структура, используемая для описания метода типа расширения. Эта структура имеет четыре поля:

source: Name of the method.
pt_pt: Nome do método.
ru: Название метода.

source: Pointer to the C implementation.
pt_pt: Ponteiro para a implementação em C.
ru: Указатель на реализацию C.

source: Flags bits indicating how the call should be constructed.
pt_pt: Bits de flags que indicam como a chamada deve ser construída.
ru: Биты флагов, указывающие, как должен быть построен вызов.

source: Points to the contents of the docstring.
pt_pt: Aponta para o conteúdo da docstring.
ru: Указывает на содержимое строки документации.

source: The :c:member:`~PyMethodDef.ml_meth` is a C function pointer. The functions may be of different types, but they always return :c:expr:`PyObject*`. If the function is not of the :c:type:`PyCFunction`, the compiler will require a cast in the method table. Even though :c:type:`PyCFunction` defines the first parameter as :c:expr:`PyObject*`, it is common that the method implementation uses the specific C type of the *self* object.
pt_pt: O :c:member:`~PyMethodDef.ml_meth` é um ponteiro para uma função em C. As funções podem ser de tipos diferentes, mas sempre retornam :c:expr:`PyObject*`. Se a função não for do tipo :c:type:`PyCFunction`, o compilador exigirá um cast na tabela de métodos. Embora :c:type:`PyCFunction` defina o primeiro parâmetro como :c:expr:`PyObject*`, é comum que a implementação do método utilize o tipo C específico do objeto *self*.
ru: :c:member:`~PyMethodDef.ml_meth` — это указатель на функцию C. Функции могут быть разных типов, но они всегда возвращают :c:expr:`PyObject*`. Если функция не относится к типу :c:type:`PyCFunction`, компилятор потребует приведение в таблице методов. Несмотря на то, что :c:type:`PyCFunction` определяет первый параметр как :c:expr:`PyObject*`, обычно реализация метода использует конкретный тип C объекта *self*.

source: The :c:member:`~PyMethodDef.ml_flags` field is a bitfield which can include the following flags. The individual flags indicate either a calling convention or a binding convention.
pt_pt: O campo :c:member:`~PyMethodDef.ml_flags` é um campo de bits que pode incluir as seguintes flags. As flags individuais indicam uma convenção de chamada ou uma convenção de ligação.
ru: Поле :c:member:`~PyMethodDef.ml_flags` представляет собой битовое поле, которое может включать следующие флаги. Отдельные флаги указывают либо соглашение о вызовах, либо соглашение о привязке.

source: There are these calling conventions:
pt_pt: Existem as seguintes convenções de chamada:
ru: Существуют следующие соглашения о вызовах:

source: This is the typical calling convention, where the methods have the type :c:type:`PyCFunction`. The function expects two :c:expr:`PyObject*` values. The first one is the *self* object for methods; for module functions, it is the module object. The second parameter (often called *args*) is a tuple object representing all arguments. This parameter is typically processed using :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_UnpackTuple`.
pt_pt: Esta é a convenção de chamada típica, onde os métodos têm o tipo :c:type:`PyCFunction`. A função espera dois valores :c:expr:`PyObject*`. O primeiro é o objeto *self* para métodos; para funções de módulo, é o objeto módulo. O segundo parâmetro (geralmente chamado *args*) é um objeto tuplo que representa todos os argumentos. Este parâmetro é tipicamente processado utilizando :c:func:`PyArg_ParseTuple` ou :c:func:`PyArg_UnpackTuple`.
ru: Это типичное соглашение о вызовах, где методы имеют тип :c:type:`PyCFunction`. Функция ожидает два значения :c:expr:`PyObject*`. Первый — это объект *self* для методов; для функций модуля это объект модуля. Второй параметр (часто называемый *args*) представляет собой объект-кортеж, представляющий все аргументы. Этот параметр обычно обрабатывается с помощью :c:func:`PyArg_ParseTuple` или :c:func:`PyArg_UnpackTuple`.

source: Can only be used in certain combinations with other flags: :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`, :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` and :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
pt_pt: Pode ser utilizada apenas em certas combinações com outras flags: :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`, :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` e :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
ru: Может использоваться только в определенных комбинациях с другими флагами: :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`, :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` и :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.

source: Methods with these flags must be of type :c:type:`PyCFunctionWithKeywords`. The function expects three parameters: *self*, *args*, *kwargs* where *kwargs* is a dictionary of all the keyword arguments or possibly ``NULL`` if there are no keyword arguments. The parameters are typically processed using :c:func:`PyArg_ParseTupleAndKeywords`.
pt_pt: Métodos com estas flags devem ser do tipo :c:type:`PyCFunctionWithKeywords`. A função espera três parâmetros: *self*, *args*, *kwargs*, onde *kwargs* é um dicionário de todos os argumentos nomeados ou possivelmente ``NULL`` se não houver argumentos nomeados. Os parâmetros são tipicamente processados utilizando :c:func:`PyArg_ParseTupleAndKeywords`.
ru: Методы с этими флагами должны иметь тип :c:type:`PyCFunctionWithKeywords`. Функция ожидает три параметра: *self*, *args*, *kwargs*, где *kwargs* — словарь всех аргументов ключевых слов или, возможно, ``NULL``, если аргументов ключевых слов нет. Параметры обычно обрабатываются с помощью :c:func:`PyArg_ParseTupleAndKeywords`.

source: Fast calling convention supporting only positional arguments. The methods have the type :c:type:`PyCFunctionFast`. The first parameter is *self*, the second parameter is a C array of :c:expr:`PyObject*` values indicating the arguments and the third parameter is the number of arguments (the length of the array).
pt_pt: Convenção de chamada rápida que suporta apenas argumentos posicionais. Os métodos têm o tipo :c:type:`PyCFunctionFast`. O primeiro parâmetro é *self*, o segundo parâmetro é um array C de valores :c:expr:`PyObject*` que indicam os argumentos e o terceiro parâmetro é o número de argumentos (o comprimento do array).
ru: Соглашение о быстрых вызовах, поддерживающее только позиционные аргументы. Методы имеют тип :c:type:`PyCFunctionFast`. Первый параметр — *self*, второй параметр — это массив C значений :c:expr:`PyObject*`, указывающий аргументы, а третий параметр — это количество аргументов (длина массива).

source: ``METH_FASTCALL`` is now part of the :ref:`stable ABI <stable-abi>`.
pt_pt: ``METH_FASTCALL`` faz agora parte da :ref:`ABI estável <stable-abi>`.
ru: ``METH_FASTCALL`` теперь является частью :ref:`stable ABI <stable-abi>`.
