Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/tuple.po
Languages: sv

source: Tuple Objects
sv: Tuple-objekt

source: This subtype of :c:type:`PyObject` represents a Python tuple object.
sv: Denna subtyp av :c:type:`PyObject` representerar ett Python tuple-objekt.

source: This instance of :c:type:`PyTypeObject` represents the Python tuple type; it is the same object as :class:`tuple` in the Python layer.
sv: Denna instans av :c:type:`PyTypeObject` representerar Pythons tupeltyp; det är samma objekt som :class:`tuple` i Python-lagret.

source: Return true if *p* is a tuple object or an instance of a subtype of the tuple type. This function always succeeds.
sv: Returnerar true om *p* är ett tuple-objekt eller en instans av en subtyp av tuple-typen. Denna funktion lyckas alltid.

source: Return true if *p* is a tuple object, but not an instance of a subtype of the tuple type. This function always succeeds.
sv: Returnerar true om *p* är ett tuple-objekt, men inte en instans av en subtyp av tuple-typen. Denna funktion lyckas alltid.

source: Return a new tuple object of size *len*, or ``NULL`` with an exception set on failure.
sv: Returnerar ett nytt tuple-objekt av storleken *len*, eller ``NULL`` med en undantagsuppsättning vid fel.

source: Return a new tuple object of size *n*, or ``NULL`` with an exception set on failure. The tuple values are initialized to the subsequent *n* C arguments pointing to Python objects. ``PyTuple_Pack(2, a, b)`` is equivalent to ``Py_BuildValue("(OO)", a, b)``.
sv: Returnerar ett nytt tuple-objekt av storlek *n*, eller ``NULL`` med en exception set vid misslyckande. Tupelvärdena initialiseras till de efterföljande *n* C-argumenten som pekar på Python-objekt. ``PyTuple_Pack(2, a, b)`` är ekvivalent med ``Py_BuildValue("(OO)", a, b)``.

source: Take a pointer to a tuple object, and return the size of that tuple. On error, return ``-1`` and with an exception set.
sv: Ta en pekare till ett tuple-objekt och returnera storleken på tupeln. Vid fel returneras ``\-1`` och med en undantagsuppsättning.

source: Like :c:func:`PyTuple_Size`, but without error checking.
sv: Som :c:func:`PyTuple_Size`, men utan felkontroll.

source: Return the object at position *pos* in the tuple pointed to by *p*. If *pos* is negative or out of bounds, return ``NULL`` and set an :exc:`IndexError` exception.
sv: Returnerar objektet på position *pos* i den tupel som *p* pekar på. Om *pos* är negativ eller utanför gränserna, returneras ``NULL`` och ett :exc:`IndexError` undantag anges.

source: The returned reference is borrowed from the tuple *p* (that is: it is only valid as long as you hold a reference to *p*). To get a :term:`strong reference`, use :c:func:`Py_NewRef(PyTuple_GetItem(...)) <Py_NewRef>` or :c:func:`PySequence_GetItem`.
sv: Den returnerade referensen är lånad från tupeln *p* (det vill säga: den är bara giltig så länge du har en referens till *p*). För att få en :term:`strong reference`, använd :c:func:`Py_NewRef(PyTuple_GetItem(...)) <Py_NewRef>` eller :c:func:`PySequence_GetItem`.

source: Like :c:func:`PyTuple_GetItem`, but does no checking of its arguments.
sv: Som :c:func:`PyTuple_GetItem`, men gör ingen kontroll av argumenten.

source: Return the slice of the tuple pointed to by *p* between *low* and *high*, or ``NULL`` with an exception set on failure.
sv: Returnerar den del av tupeln som pekas ut av *p* mellan *low* och *high*, eller ``NULL`` med en undantagsuppsättning vid fel.

source: This is the equivalent of the Python expression ``p[low:high]``. Indexing from the end of the tuple is not supported.
sv: Detta är motsvarigheten till Python-uttrycket ``p[low:high]``. Indexering från slutet av tupeln stöds inte.

source: Insert a reference to object *o* at position *pos* of the tuple pointed to by *p*. Return ``0`` on success. If *pos* is out of bounds, return ``-1`` and set an :exc:`IndexError` exception.
sv: Infoga en referens till objektet *o* på position *pos* i den tupel som *p* pekar på. Returnerar ``0`` vid framgång. Om *pos* är utanför gränserna, returneras ``\-1`` och ett :exc:`IndexError` undantag anges.

source: This function "steals" a reference to *o* and discards a reference to an item already in the tuple at the affected position.
sv: Denna funktion "stjäl" en referens till *o* och kastar bort en referens till ett objekt som redan finns i tupeln på den berörda positionen.

source: Like :c:func:`PyTuple_SetItem`, but does no error checking, and should *only* be used to fill in brand new tuples.
sv: Som :c:func:`PyTuple_SetItem`, men gör ingen felkontroll och bör *endast* användas för att fylla i helt nya tupler.

source: Bounds checking is performed as an assertion if Python is built in :ref:`debug mode <debug-build>` or :option:`with assertions <--with-assertions>`.
sv: Gränskontroll utförs som ett påstående om Python är byggt i :ref:`debugläge <debug-build>` eller :option:`med påstående <--with-assertions>`.

source: This function "steals" a reference to *o*, and, unlike :c:func:`PyTuple_SetItem`, does *not* discard a reference to any item that is being replaced; any reference in the tuple at position *pos* will be leaked.
sv: Denna funktion "stjäl" en referens till *o* och, till skillnad från :c:func:`PyTuple_SetItem`, förkastar den *inte* en referens till något objekt som ersätts; alla referenser i tupeln på position *pos* läcker ut.

source: Can be used to resize a tuple. *newsize* will be the new length of the tuple. Because tuples are *supposed* to be immutable, this should only be used if there is only one reference to the object. Do *not* use this if the tuple may already be known to some other part of the code. The tuple will always grow or shrink at the end. Think of this as destroying the old tuple and creating a new one, only more efficiently. Returns ``0`` on success. Client code should never assume that the resulting value of ``*p`` will be the same as before calling this function. If the object referenced by ``*p`` is replaced, the original ``*p`` is destroyed. On failure, returns ``-1`` and sets ``*p`` to ``NULL``, and raises :exc:`MemoryError` or :exc:`SystemError`.
sv: Kan användas för att ändra storlek på en tupel. *newsize* kommer att vara den nya längden på tupeln. Eftersom tuplar *förutsätts* vara oföränderliga bör detta endast användas om det bara finns en referens till objektet. Använd *inte* detta om tupeln redan kan vara känd av någon annan del av koden. Tupeln kommer alltid att växa eller krympa i slutet. Tänk på detta som att förstöra den gamla tupeln och skapa en ny, fast mer effektivt. Returnerar ``0`` vid framgång. Klientkoden bör aldrig anta att det resulterande värdet av ``*p`` kommer att vara detsamma som innan funktionen anropades. Om objektet som refereras till av ``*p`` ersätts, förstörs det ursprungliga ``*p``. Om funktionen misslyckas, returneras ``\-1`` och ``*p`` sätts till ``NULL``, och ger upphov till :exc:`MemoryError` eller :exc:`SystemError`.

source: Struct sequence objects are the C equivalent of :func:`~collections.namedtuple` objects, i.e. a sequence whose items can also be accessed through attributes. To create a struct sequence, you first have to create a specific struct sequence type.
sv: Struct sequence-objekt är C-motsvarigheten till :func:`~collections.namedtuple`\-objekt, dvs. en sekvens vars objekt också kan nås via attribut. För att skapa en struct-sekvens måste du först skapa en specifik struct-sekvenstyp.

source: Create a new struct sequence type from the data in *desc*, described below. Instances of the resulting type can be created with :c:func:`PyStructSequence_New`.
sv: Skapar en ny struct sequence-typ från data i *desc*, enligt beskrivningen nedan. Instanser av den resulterande typen kan skapas med :c:func:`PyStructSequence_New`.

source: Return ``NULL`` with an exception set on failure.
sv: Returnerar ``NULL`` med en exceptionell uppsättning vid fel.

source: Initializes a struct sequence type *type* from *desc* in place.
sv: Initialiserar en struct-sekvens typ *type* från *desc* på plats.

source: Like :c:func:`PyStructSequence_InitType`, but returns ``0`` on success and ``-1`` with an exception set on failure.
sv: Som :c:func:`PyStructSequence_InitType`, men returnerar ``0`` vid framgång och ``\-1`` med en exception set vid misslyckande.

source: Contains the meta information of a struct sequence type to create.
sv: Innehåller metainformationen för en struct-sekvenstyp som ska skapas.

source: Fully qualified name of the type; null-terminated UTF-8 encoded. The name must contain the module name.
sv: Fullständigt kvalificerat namn på typen; nollavslutad UTF-8-kodad. Namnet måste innehålla modulnamnet.

source: Pointer to docstring for the type or ``NULL`` to omit.
sv: Pekare till docstring för typen eller ``NULL`` för att utelämna.

source: Pointer to ``NULL``-terminated array with field names of the new type.
sv: Pekare till en ``NULL``\-avslutad array med fältnamn av den nya typen.

source: Number of fields visible to the Python side (if used as tuple).
sv: Antal fält som är synliga för Python-sidan (om de används som tuple).

source: Describes a field of a struct sequence. As a struct sequence is modeled as a tuple, all fields are typed as :c:expr:`PyObject*`. The index in the :c:member:`~PyStructSequence_Desc.fields` array of the :c:type:`PyStructSequence_Desc` determines which field of the struct sequence is described.
sv: Beskriver ett fält i en struct sequence. Eftersom en struct sequence är modellerad som en tupel, är alla fält typade som :c:expr:`PyObject*`. Indexet i :c:member:`~PyStructSequence_Desc.fields`\-arrayen i :c:type:`PyStructSequence_Desc` avgör vilket fält i struct-sekvensen som beskrivs.

source: Name for the field or ``NULL`` to end the list of named fields, set to :c:data:`PyStructSequence_UnnamedField` to leave unnamed.
sv: Namn på fältet eller ``NULL`` för att avsluta listan över namngivna fält, inställt på :c:data:`PyStructSequence_UnnamedField` för att lämna fältet utan namn.

source: Field docstring or ``NULL`` to omit.
sv: Fältets dokumentsträng eller ``NULL`` för att utelämna.

source: Special value for a field name to leave it unnamed.
sv: Specialvärde för ett fältnamn för att lämna det namnlöst.

source: The type was changed from ``char *``.
sv: Typen ändrades från ``char *``.

source: Creates an instance of *type*, which must have been created with :c:func:`PyStructSequence_NewType`.
sv: Skapar en instans av *typ*, som måste ha skapats med :c:func:`PyStructSequence_NewType`.

source: Return the object at position *pos* in the struct sequence pointed to by *p*.
sv: Returnerar objektet på position *pos* i struct-sekvensen som pekas ut av *p*.

source: Alias to :c:func:`PyStructSequence_GetItem`.
sv: Alias till :c:func:`PyStructSequence_GetItem`.

source: Now implemented as an alias to :c:func:`PyStructSequence_GetItem`.
sv: Nu implementerad som ett alias till :c:func:`PyStructSequence_GetItem`.

source: Sets the field at index *pos* of the struct sequence *p* to value *o*. Like :c:func:`PyTuple_SET_ITEM`, this should only be used to fill in brand new instances.
sv: Ställer in fältet vid index *pos* i struct-sekvensen *p* till värdet *o*. Precis som :c:func:`PyTuple_SET_ITEM` bör detta endast användas för att fylla i helt nya instanser.

source: This function "steals" a reference to *o*.
sv: Denna funktion "stjäl" en referens till *o*.

source: Alias to :c:func:`PyStructSequence_SetItem`.
sv: Alias till :c:func:`PyStructSequence_SetItem`.

source: Now implemented as an alias to :c:func:`PyStructSequence_SetItem`.
sv: Nu implementerad som ett alias till :c:func:`PyStructSequence_SetItem`.

source: tuple
sv: tupel
