Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/type.po
Languages: pt_pt, ru

source: If it is not possible to switch to a ``MANAGED`` flag (for example, for vectorcall or to support Python older than 3.12), specify the offset in :c:data:`Py_tp_members`. See :ref:`PyMemberDef documentation <pymemberdef-offsets>` for details.
pt_pt: Se não for possível mudar para uma flag ``MANAGED`` (por exemplo, para vectorcall ou para suportar Python anterior a 3.12), especifique o deslocamento em :c:data:`Py_tp_members`. Veja :ref:`documentação PyMemberDef <pymemberdef-offsets>` para detalhes.

source: The following internal fields cannot be set at all when creating a heap type:
pt_pt: Os seguintes campos internos não podem ser definidos de todo ao criar um tipo heap:

source: :c:member:`~PyTypeObject.tp_dict`, :c:member:`~PyTypeObject.tp_mro`, :c:member:`~PyTypeObject.tp_cache`, :c:member:`~PyTypeObject.tp_subclasses`, and :c:member:`~PyTypeObject.tp_weaklist`.
pt_pt: :c:member:`~PyTypeObject.tp_dict`, :c:member:`~PyTypeObject.tp_mro`, :c:member:`~PyTypeObject.tp_cache`, :c:member:`~PyTypeObject.tp_subclasses` e :c:member:`~PyTypeObject.tp_weaklist`.

source: Setting :c:data:`Py_tp_bases` or :c:data:`Py_tp_base` may be problematic on some platforms. To avoid issues, use the *bases* argument of :c:func:`PyType_FromSpecWithBases` instead.
pt_pt: Definir :c:data:`Py_tp_bases` ou :c:data:`Py_tp_base` pode ser problemático em algumas plataformas. Para evitar problemas, use o argumento *bases* de :c:func:`PyType_FromSpecWithBases` em vez disso.
ru: Установка :c:data:`Py_tp_bases` или :c:data:`Py_tp_base` может быть проблематичной на некоторых платформах. Чтобы избежать проблем, используйте вместо этого аргумент *bases* функции :c:func:`PyType_FromSpecWithBases`.

source: Slots in :c:type:`PyBufferProcs` may be set in the unlimited API.
pt_pt: Slots em :c:type:`PyBufferProcs` podem ser definidos na API ilimitada.
ru: Слоты в :c:type:`PyBufferProcs` могут быть установлены в неограниченном API.

source: :c:member:`~PyBufferProcs.bf_getbuffer` and :c:member:`~PyBufferProcs.bf_releasebuffer` are now available under the :ref:`limited API <limited-c-api>`.
pt_pt: :c:member:`~PyBufferProcs.bf_getbuffer` e :c:member:`~PyBufferProcs.bf_releasebuffer` estão agora disponíveis sob a :ref:`API limitada <limited-c-api>`.
ru: :c:member:`~PyBufferProcs.bf_getbuffer` и :c:member:`~PyBufferProcs.bf_releasebuffer` теперь доступны в рамках :ref:`limited API <limited-c-api>`.

source: The field :c:member:`~PyTypeObject.tp_vectorcall` can now be set using :c:data:`Py_tp_vectorcall`. See the field's documentation for details.
pt_pt: O campo :c:member:`~PyTypeObject.tp_vectorcall` agora pode ser definido usando :c:data:`Py_tp_vectorcall`. Veja a documentação do campo para detalhes.

source: The desired value of the slot. In most cases, this is a pointer to a function.
pt_pt: O valor desejado do slot. Na maioria dos casos, isto é um ponteiro para uma função.
ru: Желаемое значение слота. В большинстве случаев это указатель на функцию.

source: *pfunc* values may not be ``NULL``, except for the following slots:
pt_pt: Os valores *pfunc* não podem ser ``NULL``, exceto para os seguintes slots:

source: :c:data:`Py_tp_token` (for clarity, prefer :c:data:`Py_TP_USE_SPEC` rather than ``NULL``)
pt_pt: :c:data:`Py_tp_token` (para clareza, prefira :c:data:`Py_TP_USE_SPEC` em vez de ``NULL``)

source: A :c:member:`~PyType_Slot.slot` that records a static memory layout ID for a class.
pt_pt: Um :c:member:`~PyType_Slot.slot` que regista um ID de layout de memória estático para uma classe.

source: If the :c:type:`PyType_Spec` of the class is statically allocated, the token can be set to the spec using the special value :c:data:`Py_TP_USE_SPEC`:
pt_pt: Se o :c:type:`PyType_Spec` da classe for alocado estaticamente, o token pode ser definido para a especificação usando o valor especial :c:data:`Py_TP_USE_SPEC`:

source: It can also be set to an arbitrary pointer, but you must ensure that:
pt_pt: Também pode ser definido para um ponteiro arbitrário, mas deve garantir que:

source: The pointer outlives the class, so it's not reused for something else while the class exists.
pt_pt: O ponteiro sobrevive à classe, para que não seja reutilizado para outra coisa enquanto a classe existir.

source: It "belongs" to the extension module where the class lives, so it will not clash with other extensions.
pt_pt: Pertence ao módulo de extensão onde a classe reside, para que não entre em conflito com outras extensões.

source: Use :c:func:`PyType_GetBaseByToken` to check if a class's superclass has a given token -- that is, check whether the memory layout is compatible.
pt_pt: Use :c:func:`PyType_GetBaseByToken` para verificar se uma superclasse de uma classe tem um token dado -- ou seja, verificar se o layout de memória é compatível.

source: To get the token for a given class (without considering superclasses), use :c:func:`PyType_GetSlot` with ``Py_tp_token``.
pt_pt: Para obter o token para uma classe dada (sem considerar superclasses), use :c:func:`PyType_GetSlot` com ``Py_tp_token``.

source: Used as a value with :c:data:`Py_tp_token` to set the token to the class's :c:type:`PyType_Spec`. Expands to ``NULL``.
pt_pt: Usado como um valor com :c:data:`Py_tp_token` para definir o token para a :c:type:`PyType_Spec` da classe. Expande para ``NULL``.

source: object
pt_pt: objeto
ru: объект

source: type
pt_pt: tipo
ru: тип

source: The *bases* argument can be used to specify base classes; it can either be only one class or a tuple of classes. If *bases* is ``NULL``, the *Py_tp_bases* slot is used instead. If that also is ``NULL``, the *Py_tp_base* slot is used instead. If that also is ``NULL``, the new type derives from :class:`object`.
ru: Аргумент *bases* можно использовать для указания базовых классов; это может быть либо только один класс, либо кортеж классов. Если *bases* имеет значение NULL, вместо него используется слот *Py_tp_bases*. Если это также ``NULL``, вместо него используется слот *Py_tp_base*. Если это также ``NULL``, новый тип наследуется от :class:`object`.

source: ``Py_tp_dealloc`` to set :c:member:`PyTypeObject.tp_dealloc`
ru: `Py_tp_dealloc` для установки :c:member:`PyTypeObject.tp_dealloc`

source: ``Py_nb_add`` to set :c:member:`PyNumberMethods.nb_add`
ru: ``Py_nb_add`` для установки :c:member:`PyNumberMethods.nb_add`

source: ``Py_sq_length`` to set :c:member:`PySequenceMethods.sq_length`
ru: ``Py_sq_length`` для установки :c:member:`PySequenceMethods.sq_length`

source: If it is not possible to switch to a ``MANAGED`` flag (for example, for vectorcall or to support Python older than 3.12), specify the offset in :c:member:`Py_tp_members <PyTypeObject.tp_members>`. See :ref:`PyMemberDef documentation <pymemberdef-offsets>` for details.
ru: Если невозможно переключиться на флаг ``MANAGED`` (например, для векторного вызова или для поддержки Python старше 3.12), укажите смещение в :c:member:`Py_tp_members <PyTypeObject.tp_members>`. Подробности смотрите в документации PyMemberDef <pymemberdef-offsets>.
