Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/type.po
Languages: pt_pt, ru

source: Return the state of the module object associated with the given type. This is a shortcut for calling :c:func:`PyModule_GetState()` on the result of :c:func:`PyType_GetModule`.
pt_pt: Devolve o estado do objeto módulo associado ao tipo dado. Isto é um atalho para chamar :c:func:`PyModule_GetState()` no resultado de :c:func:`PyType_GetModule`.
ru: Возвращает состояние объекта модуля, связанного с данным типом. Это ярлык для вызова :c:func:`PyModule_GetState()` по результату :c:func:`PyType_GetModule`.

source: If the *type* has an associated module but its state is ``NULL``, returns ``NULL`` without setting an exception.
pt_pt: Se o *type* tiver um módulo associado, mas o seu estado for ``NULL``, devolve ``NULL`` sem definir uma exceção.
ru: Если *type* имеет связанный модуль, но его состояние равно NULL, возвращается NULL без установки исключения.

source: Find the first superclass whose module was created from the given :c:type:`PyModuleDef` *def*, and return that module.
pt_pt: Encontrar a primeira superclasse cujo módulo foi criado a partir do :c:type:`PyModuleDef` *def* dado, e devolver esse módulo.
ru: Найдите первый суперкласс, модуль которого был создан на основе заданного :c:type:`PyModuleDef` *def*, и верните этот модуль.

source: If no module is found, raises a :py:class:`TypeError` and returns ``NULL``.
pt_pt: Se nenhum módulo for encontrado, levanta uma :py:class:`TypeError` e devolve ``NULL``.
ru: Если модуль не найден, вызывает :py:class:`TypeError`` и возвращает ``NULL``.

source: This function is intended to be used together with :c:func:`PyModule_GetState()` to get module state from slot methods (such as :c:member:`~PyTypeObject.tp_init` or :c:member:`~PyNumberMethods.nb_add`) and other places where a method's defining class cannot be passed using the :c:type:`PyCMethod` calling convention.
pt_pt: Esta função destina-se a ser usada em conjunto com :c:func:`PyModule_GetState()` para obter o estado do módulo a partir de métodos de slot (como :c:member:`~PyTypeObject.tp_init` ou :c:member:`~PyNumberMethods.nb_add`) e outros locais onde a classe que define o método não pode ser passada usando a convenção de chamada :c:type:`PyCMethod`.
ru: Эта функция предназначена для использования вместе с :c:func:`PyModule_GetState()` для получения состояния модуля из методов слота (таких как :c:member:`~PyTypeObject.tp_init` или :c:member:`~PyNumberMethods. nb_add`) и другие места, где определяющий класс метода не может быть передан с использованием соглашения о вызовах :c:type:`PyCMethod`.

source: The returned reference is :term:`borrowed <borrowed reference>` from *type*, and will be valid as long as you hold a reference to *type*. Do not release it with :c:func:`Py_DECREF` or similar.
pt_pt: A referência devolvida é :term:`emprestada <borrowed reference>` de *type*, e será válida enquanto mantiver uma referência a *type*. Não a libere com :c:func:`Py_DECREF` ou similar.

source: Find the first superclass in *type*'s :term:`method resolution order` whose :c:macro:`Py_tp_token` token is equal to the given one.
pt_pt: Encontrar a primeira superclasse na :term:`ordem de resolução de métodos` de *type* cujo token :c:macro:`Py_tp_token` seja igual ao dado.

source: If found, set *\*result* to a new :term:`strong reference` to it and return ``1``.
pt_pt: Se encontrado, define *\*result* para uma nova :term:`referência forte` para ele e devolve ``1``.

source: If not found, set *\*result* to ``NULL`` and return ``0``.
pt_pt: Se não encontrado, define *\*result* para ``NULL`` e devolve ``0``.

source: On error, set *\*result* to ``NULL`` and return ``-1`` with an exception set.
pt_pt: Em caso de erro, define *\*result* para ``NULL`` e devolve ``-1`` com uma exceção definida.

source: The *result* argument may be ``NULL``, in which case *\*result* is not set. Use this if you need only the return value.
pt_pt: O argumento *result* pode ser ``NULL``, caso em que *\*result* não é definido. Use isto se precisar apenas do valor de retorno.

source: The *token* argument may not be ``NULL``.
pt_pt: O argumento *token* não pode ser ``NULL``.

source: Attempt to assign a version tag to the given type.
pt_pt: Tenta atribuir uma etiqueta de versão ao tipo dado.
ru: Попытайтесь присвоить тег версии данному типу.

source: Returns 1 if the type already had a valid version tag or a new one was assigned, or 0 if a new tag could not be assigned.
pt_pt: Devolve 1 se o tipo já tinha uma etiqueta de versão válida ou se uma nova foi atribuída, ou 0 se uma nova etiqueta não pôde ser atribuída.
ru: Возвращает 1, если тип уже имеет допустимый тег версии или был назначен новый, или 0, если новый тег не может быть назначен.

source: Return true if instances of *type* support creating weak references, false otherwise. This function always succeeds. *type* must not be ``NULL``.
pt_pt: Devolve verdadeiro se as instâncias de *type* suportarem a criação de referências fracas, falso caso contrário. Esta função sempre tem sucesso. *type* não deve ser ``NULL``.

source: Creating Heap-Allocated Types
pt_pt: Criar Tipos Alocados em Heap
ru: Создание типов, выделяемых в куче

source: The following functions and structs are used to create :ref:`heap types <heap-types>`.
pt_pt: As seguintes funções e estruturas são usadas para criar :ref:`tipos heap <heap-types>`.
ru: Следующие функции и структуры используются для создания :ref:`типов кучи <heap-types>`.

source: Create and return a :ref:`heap type <heap-types>` from the *spec* (see :c:macro:`Py_TPFLAGS_HEAPTYPE`).
pt_pt: Cria e devolve um :ref:`tipo heap <heap-types>` a partir do *spec* (veja :c:macro:`Py_TPFLAGS_HEAPTYPE`).
ru: Создайте и верните :ref:`тип кучи <heap-types>` из *spec* (см. :c:macro:`Py_TPFLAGS_HEAPTYPE`).

source: The metaclass *metaclass* is used to construct the resulting type object. When *metaclass* is ``NULL``, the metaclass is derived from *bases* (or *Py_tp_base[s]* slots if *bases* is ``NULL``, see below).
pt_pt: A metaclasse *metaclass* é usada para construir o objeto tipo resultante. Quando *metaclass* é ``NULL``, a metaclasse é derivada de *bases* (ou dos slots *Py_tp_base[s]* se *bases* for ``NULL``, veja abaixo).
ru: Метакласс *metaclass* используется для создания результирующего объекта типа. Если *metaclass* имеет значение ``NULL``, метакласс является производным от *bases* (или слотов *Py_tp_base[s]*, если *bases* имеет значение ``NULL``, см. ниже).

source: Metaclasses that override :c:member:`~PyTypeObject.tp_new` are not supported, except if ``tp_new`` is ``NULL``.
pt_pt: Metaclasses que substituem :c:member:`~PyTypeObject.tp_new` não são suportadas, exceto se ``tp_new`` for ``NULL``.

source: The *bases* argument can be used to specify base classes; it can either be only one class or a tuple of classes. If *bases* is ``NULL``, the :c:data:`Py_tp_bases` slot is used instead. If that also is ``NULL``, the :c:data:`Py_tp_base` slot is used instead. If that also is ``NULL``, the new type derives from :class:`object`.
pt_pt: O argumento *bases* pode ser usado para especificar classes base; pode ser apenas uma classe ou um tuplo de classes. Se *bases* for ``NULL``, o slot :c:data:`Py_tp_bases` é usado em vez disso. Se esse também for ``NULL``, o slot :c:data:`Py_tp_base` é usado em vez disso. Se esse também for ``NULL``, o novo tipo deriva de :class:`object`.

source: The *module* argument can be used to record the module in which the new class is defined. It must be a module object or ``NULL``. If not ``NULL``, the module is associated with the new type and can later be retrieved with :c:func:`PyType_GetModule`. The associated module is not inherited by subclasses; it must be specified for each class individually.
pt_pt: O argumento *module* pode ser usado para registar o módulo no qual a nova classe é definida. Deve ser um objeto módulo ou ``NULL``. Se não for ``NULL``, o módulo é associado ao novo tipo e pode ser recuperado mais tarde com :c:func:`PyType_GetModule`. O módulo associado não é herdado por subclasses; deve ser especificado para cada classe individualmente.
ru: Аргумент *module* можно использовать для записи модуля, в котором определен новый класс. Это должен быть объект модуля или ``NULL``. Если значение не ``NULL``, модуль связан с новым типом и позже может быть получен с помощью :c:func:`PyType_GetModule`. Соответствующий модуль не наследуется подклассами; его необходимо указывать для каждого класса индивидуально.

source: This function calls :c:func:`PyType_Ready` on the new type.
pt_pt: Esta função chama :c:func:`PyType_Ready` no novo tipo.
ru: Эта функция вызывает :c:func:`PyType_Ready` для нового типа.

source: Note that this function does *not* fully match the behavior of calling :py:class:`type() <type>` or using the :keyword:`class` statement. With user-provided base types or metaclasses, prefer :ref:`calling <capi-call>` :py:class:`type` (or the metaclass) over ``PyType_From*`` functions. Specifically:
pt_pt: Note que esta função *não* corresponde totalmente ao comportamento de chamar :py:class:`type() <type>` ou usar a instrução :keyword:`class`. Com tipos base ou metaclasses fornecidos pelo utilizador, prefira :ref:`chamar <capi-call>` :py:class:`type` (ou a metaclasse) em vez de funções ``PyType_From*``. Especificamente:
ru: Обратите внимание, что эта функция *не* полностью соответствует поведению вызова :py:class:`type() <type>` или использования оператора :keyword:`class`. При использовании базовых типов или метаклассов, предоставленных пользователем, отдавайте предпочтение :ref:`вызову <capi-call>` :py:class:`type` (или метаклассу) вместо функций ``PyType_From*``. Конкретно:

source: :py:meth:`~object.__new__` is not called on the new class (and it must be set to ``type.__new__``).
pt_pt: :py:meth:`~object.__new__` não é chamado na nova classe (e deve ser definido para ``type.__new__``).
ru: :py:meth:`~object.__new__` не вызывается для нового класса (и для него должно быть установлено значение ``type.__new__``).

source: :py:meth:`~object.__init__` is not called on the new class.
pt_pt: :py:meth:`~object.__init__` não é chamado na nova classe.
ru: :py:meth:`~object.__init__` не вызывается в новом классе.

source: :py:meth:`~object.__init_subclass__` is not called on any bases.
pt_pt: :py:meth:`~object.__init_subclass__` não é chamado em nenhuma base.
ru: :py:meth:`~object.__init_subclass__` не вызывается ни на каких базах.

source: :py:meth:`~object.__set_name__` is not called on new descriptors.
pt_pt: :py:meth:`~object.__set_name__` não é chamado em novos descritores.
ru: :py:meth:`~object.__set_name__` не вызывается для новых дескрипторов.

source: Equivalent to ``PyType_FromMetaclass(NULL, module, spec, bases)``.
pt_pt: Equivalente a ``PyType_FromMetaclass(NULL, module, spec, bases)``.
ru: Эквивалент ``PyType_FromMetaclass(NULL, модуль, спецификация, базы)``.

source: The function now accepts a single class as the *bases* argument and ``NULL`` as the ``tp_doc`` slot.
pt_pt: A função agora aceita uma única classe como argumento *bases* e ``NULL`` como o slot ``tp_doc``.
ru: Функция теперь принимает один класс в качестве аргумента *bases* и ``NULL`` в качестве слота ``tp_doc``.

source: The function now finds and uses a metaclass corresponding to the provided base classes. Previously, only :class:`type` instances were returned.
pt_pt: A função agora encontra e usa uma metaclasse correspondente às classes base fornecidas. Anteriormente, apenas instâncias de :class:`type` eram devolvidas.
ru: Теперь функция находит и использует метакласс, соответствующий предоставленным базовым классам. Раньше возвращались только экземпляры :class:`type`.

source: The :c:member:`~PyTypeObject.tp_new` of the metaclass is *ignored*. which may result in incomplete initialization. Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated.
pt_pt: O :c:member:`~PyTypeObject.tp_new` da metaclasse é *ignorado*, o que pode resultar em inicialização incompleta. Criar classes cuja metaclasse substitui :c:member:`~PyTypeObject.tp_new` está obsoleto.

source: Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is no longer allowed.
pt_pt: A criação de classes cuja metaclasse substitui :c:member:`~PyTypeObject.tp_new` já não é permitida.

source: Equivalent to ``PyType_FromMetaclass(NULL, NULL, spec, bases)``.
pt_pt: Equivalente a ``PyType_FromMetaclass(NULL, NULL, spec, bases)``.
ru: Эквивалент ``PyType_FromMetaclass(NULL, NULL, spec, bases)``.

source: Equivalent to ``PyType_FromMetaclass(NULL, NULL, spec, NULL)``.
pt_pt: Equivalente a ``PyType_FromMetaclass(NULL, NULL, spec, NULL)``.
ru: Эквивалент ``PyType_FromMetaclass(NULL, NULL, spec, NULL)``.

source: The function now finds and uses a metaclass corresponding to the base classes provided in *Py_tp_base[s]* slots. Previously, only :class:`type` instances were returned.
pt_pt: A função agora encontra e usa uma metaclasse correspondente às classes base fornecidas nos slots *Py_tp_base[s]*. Anteriormente, apenas instâncias de :class:`type` eram devolvidas.
ru: Теперь функция находит и использует метакласс, соответствующий базовым классам, представленным в слотах *Py_tp_base[s]*. Раньше возвращались только экземпляры :class:`type`.

source: Make a type immutable: set the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag.
pt_pt: Tornar um tipo imutável: definir a flag :c:macro:`Py_TPFLAGS_IMMUTABLETYPE`.

source: All base classes of *type* must be immutable.
pt_pt: Todas as classes base de *type* devem ser imutáveis.

source: On success, return ``0``. On error, set an exception and return ``-1``.
pt_pt: Em caso de sucesso, devolve ``0``. Em caso de erro, define uma exceção e devolve ``-1``.

source: The type must not be used before it's made immutable. For example, type instances must not be created before the type is made immutable.
pt_pt: O tipo não deve ser usado antes de ser tornado imutável. Por exemplo, instâncias de tipo não devem ser criadas antes de o tipo ser tornado imutável.

source: Structure defining a type's behavior.
pt_pt: Estrutura que define o comportamento de um tipo.
ru: Структура, определяющая поведение типа.

source: Name of the type, used to set :c:member:`PyTypeObject.tp_name`.
pt_pt: Nome do tipo, usado para definir :c:member:`PyTypeObject.tp_name`.
ru: Имя типа, используемое для установки :c:member:`PyTypeObject.tp_name`.

source: If positive, specifies the size of the instance in bytes. It is used to set :c:member:`PyTypeObject.tp_basicsize`.
pt_pt: Se positivo, especifica o tamanho da instância em bytes. É usado para definir :c:member:`PyTypeObject.tp_basicsize`.
ru: Если положительное значение, указывает размер экземпляра в байтах. Он используется для установки :c:member:`PyTypeObject.tp_basicsize`.

source: If zero, specifies that :c:member:`~PyTypeObject.tp_basicsize` should be inherited.
pt_pt: Se zero, especifica que :c:member:`~PyTypeObject.tp_basicsize` deve ser herdado.
ru: Если ноль, указывает, что :c:member:`~PyTypeObject.tp_basicsize` должен быть унаследован.

source: If negative, the absolute value specifies how much space instances of the class need *in addition* to the superclass. Use :c:func:`PyObject_GetTypeData` to get a pointer to subclass-specific memory reserved this way. For negative :c:member:`!basicsize`, Python will insert padding when needed to meet :c:member:`~PyTypeObject.tp_basicsize`'s alignment requirements.
pt_pt: Se negativo, o valor absoluto especifica quanto espaço as instâncias da classe precisam *além* da superclasse. Use :c:func:`PyObject_GetTypeData` para obter um ponteiro para a memória específica da subclasse reservada desta forma. Para :c:member:`!basicsize` negativo, o Python inserirá preenchimento quando necessário para cumprir os requisitos de alinhamento de :c:member:`~PyTypeObject.tp_basicsize`.
ru: Если отрицательное, абсолютное значение указывает, сколько места требуется экземплярам класса *в дополнение* к суперклассу. Используйте :c:func:`PyObject_GetTypeData`, чтобы получить указатель на память подкласса, зарезервированную таким образом. Для отрицательного :c:member:`!basicsize`, Python вставит заполнение, когда это необходимо, чтобы удовлетворить требованиям выравнивания :c:member:`~PyTypeObject.tp_basicsize`.

source: Previously, this field could not be negative.
pt_pt: Anteriormente, este campo não podia ser negativo.
ru: Раньше это поле не могло быть отрицательным.

source: Size of one element of a variable-size type, in bytes. Used to set :c:member:`PyTypeObject.tp_itemsize`. See ``tp_itemsize`` documentation for caveats.
pt_pt: Tamanho de um elemento de um tipo de tamanho variável, em bytes. Usado para definir :c:member:`PyTypeObject.tp_itemsize`. Veja a documentação de ``tp_itemsize`` para advertências.
ru: Размер одного элемента типа переменного размера в байтах. Используется для установки :c:member:`PyTypeObject.tp_itemsize`. См. предостережения в документации ``tp_itemsize``.

source: If zero, :c:member:`~PyTypeObject.tp_itemsize` is inherited. Extending arbitrary variable-sized classes is dangerous, since some types use a fixed offset for variable-sized memory, which can then overlap fixed-sized memory used by a subclass. To help prevent mistakes, inheriting ``itemsize`` is only possible in the following situations:
pt_pt: Se zero, :c:member:`~PyTypeObject.tp_itemsize` é herdado. Estender classes de tamanho variável arbitrárias é perigoso, uma vez que alguns tipos usam um deslocamento fixo para memória de tamanho variável, que pode então sobrepor a memória de tamanho fixo usada por uma subclasse. Para ajudar a prevenir erros, herdar ``itemsize`` só é possível nas seguintes situações:
ru: Если ноль, :c:member:`~PyTypeObject.tp_itemsize` наследуется. Расширение произвольных классов переменного размера опасно, поскольку некоторые типы используют фиксированное смещение для памяти переменного размера, которое затем может перекрывать память фиксированного размера, используемую подклассом. Чтобы избежать ошибок, наследование itemsize возможно только в следующих ситуациях:

source: The base is not variable-sized (its :c:member:`~PyTypeObject.tp_itemsize`).
pt_pt: A base não é de tamanho variável (o seu :c:member:`~PyTypeObject.tp_itemsize`).
ru: База не имеет переменного размера (ее :c:member:`~PyTypeObject.tp_itemsize`).

source: The requested :c:member:`PyType_Spec.basicsize` is positive, suggesting that the memory layout of the base class is known.
pt_pt: O :c:member:`PyType_Spec.basicsize` solicitado é positivo, sugerindo que o layout de memória da classe base é conhecido.
ru: Запрошенный :c:member:`PyType_Spec.basicsize` является положительным, что предполагает, что расположение памяти базового класса известно.

source: The requested :c:member:`PyType_Spec.basicsize` is zero, suggesting that the subclass does not access the instance's memory directly.
pt_pt: O :c:member:`PyType_Spec.basicsize` solicitado é zero, sugerindo que a subclasse não acede diretamente à memória da instância.
ru: Запрошенный :c:member:`PyType_Spec.basicsize` равен нулю, что предполагает, что подкласс не имеет прямого доступа к памяти экземпляра.

source: With the :c:macro:`Py_TPFLAGS_ITEMS_AT_END` flag.
pt_pt: Com a flag :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.
ru: С флагом :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.

source: Type flags, used to set :c:member:`PyTypeObject.tp_flags`.
pt_pt: Flags de tipo, usadas para definir :c:member:`PyTypeObject.tp_flags`.
ru: Флаги типа, используемые для установки :c:member:`PyTypeObject.tp_flags`.

source: If the ``Py_TPFLAGS_HEAPTYPE`` flag is not set, :c:func:`PyType_FromSpecWithBases` sets it automatically.
pt_pt: Se a flag ``Py_TPFLAGS_HEAPTYPE`` não estiver definida, :c:func:`PyType_FromSpecWithBases` define-a automaticamente.
ru: Если флаг Py_TPFLAGS_HEAPTYPE не установлен, :c:func:`PyType_FromSpecWithBases` устанавливает его автоматически.

source: Array of :c:type:`PyType_Slot` structures. Terminated by the special slot value ``{0, NULL}``.
pt_pt: Array de estruturas :c:type:`PyType_Slot`. Terminado pelo valor especial de slot ``{0, NULL}``.
ru: Массив структур :c:type:`PyType_Slot`. Завершается специальным значением слота ``{0, NULL}``.

source: Each slot ID should be specified at most once.
pt_pt: Cada ID de slot deve ser especificado no máximo uma vez.
ru: Идентификатор каждого слота следует указывать не более одного раза.

source: Structure defining optional functionality of a type, containing a slot ID and a value pointer.
pt_pt: Estrutura que define funcionalidade opcional de um tipo, contendo um ID de slot e um ponteiro de valor.
ru: Структура, определяющая дополнительную функциональность типа, содержащая идентификатор слота и указатель значения.

source: A slot ID.
pt_pt: Um ID de slot.
ru: Идентификатор слота.

source: Slot IDs are named like the field names of the structures :c:type:`PyTypeObject`, :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, :c:type:`PyMappingMethods` and :c:type:`PyAsyncMethods` with an added ``Py_`` prefix. For example, use:
pt_pt: Os IDs de slot são nomeados como os nomes dos campos das estruturas :c:type:`PyTypeObject`, :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, :c:type:`PyMappingMethods` e :c:type:`PyAsyncMethods` com um prefixo ``Py_`` adicionado. Por exemplo, use:
ru: Идентификаторы слотов называются так же, как имена полей структур :c:type:`PyTypeObject`, :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, :c:type:`PyMappingMethods` и :c: введите:`PyAsyncMethods` с добавленным префиксом ``Py_``. Например, используйте:

source: :c:data:`Py_tp_dealloc` to set :c:member:`PyTypeObject.tp_dealloc`
pt_pt: :c:data:`Py_tp_dealloc` para definir :c:member:`PyTypeObject.tp_dealloc`

source: :c:data:`Py_nb_add` to set :c:member:`PyNumberMethods.nb_add`
pt_pt: :c:data:`Py_nb_add` para definir :c:member:`PyNumberMethods.nb_add`

source: :c:data:`Py_sq_length` to set :c:member:`PySequenceMethods.sq_length`
pt_pt: :c:data:`Py_sq_length` para definir :c:member:`PySequenceMethods.sq_length`

source: An additional slot is supported that does not correspond to a :c:type:`!PyTypeObject` struct field:
pt_pt: Um slot adicional é suportado que não corresponde a um campo de estrutura :c:type:`!PyTypeObject`:

source: The following “offset” fields cannot be set using :c:type:`PyType_Slot`:
pt_pt: Os seguintes campos de "deslocamento" não podem ser definidos usando :c:type:`PyType_Slot`:
ru: Следующие поля «смещения» нельзя установить с помощью :c:type:`PyType_Slot`:

source: :c:member:`~PyTypeObject.tp_weaklistoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead if possible)
pt_pt: :c:member:`~PyTypeObject.tp_weaklistoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` em vez disso, se possível)
ru: :c:member:`~PyTypeObject.tp_weaklistoffset` (вместо этого используйте :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF`, если это возможно)

source: :c:member:`~PyTypeObject.tp_dictoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_DICT` instead if possible)
pt_pt: :c:member:`~PyTypeObject.tp_dictoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_DICT` em vez disso, se possível)
ru: :c:member:`~PyTypeObject.tp_dictoffset` (вместо этого используйте :c:macro:`Py_TPFLAGS_MANAGED_DICT`, если это возможно)

source: :c:member:`~PyTypeObject.tp_vectorcall_offset` (use ``"__vectorcalloffset__"`` in :ref:`PyMemberDef <pymemberdef-offsets>`)
pt_pt: :c:member:`~PyTypeObject.tp_vectorcall_offset` (use ``"__vectorcalloffset__"`` em :ref:`PyMemberDef <pymemberdef-offsets>`)
ru: :c:member:`~PyTypeObject.tp_vectorcall_offset` (используйте ``"__vectorcalloffset__"`` в :ref:`PyMemberDef <pymemberdef-offsets>`)
