Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/c-api/type.po
Languages: pt_pt, ru

source: Type Objects
pt_pt: Objetos Tipo
ru: Объекты типа

source: The C structure of the objects used to describe built-in types.
pt_pt: A estrutura C dos objetos usados para descrever tipos integrados.
ru: Структура объектов C, используемая для описания встроенных типов.

source: This is the type object for type objects; it is the same object as :class:`type` in the Python layer.
pt_pt: Este é o objeto tipo para objetos tipo; é o mesmo objeto que :class:`type` na camada Python.
ru: Это объект типа для объектов типа; это тот же объект, что и :class:`type` на уровне Python.

source: Return non-zero if the object *o* is a type object, including instances of types derived from the standard type object. Return 0 in all other cases. This function always succeeds.
pt_pt: Devolve um valor diferente de zero se o objeto *o* for um objeto tipo, incluindo instâncias de tipos derivados do objeto tipo padrão. Devolve 0 em todos os outros casos. Esta função sempre tem sucesso.
ru: Возвращает ненулевое значение, если объект *o* является объектом типа, включая экземпляры типов, производных от объекта стандартного типа. Во всех остальных случаях возвращайте 0. Эта функция всегда завершается успешно.

source: Return non-zero if the object *o* is a type object, but not a subtype of the standard type object. Return 0 in all other cases. This function always succeeds.
pt_pt: Devolve um valor diferente de zero se o objeto *o* for um objeto tipo, mas não um subtipo do objeto tipo padrão. Devolve 0 em todos os outros casos. Esta função sempre tem sucesso.
ru: Возвращает ненулевое значение, если объект *o* является объектом типа, но не подтипом объекта стандартного типа. Во всех остальных случаях возвращайте 0. Эта функция всегда завершается успешно.

source: Clear the internal lookup cache. Return the current version tag.
pt_pt: Limpa a cache de pesquisa interna. Devolve a etiqueta de versão atual.
ru: Очистите внутренний кэш поиска. Вернуть тег текущей версии.

source: Return the :c:member:`~PyTypeObject.tp_flags` member of *type*. This function is primarily meant for use with ``Py_LIMITED_API``; the individual flag bits are guaranteed to be stable across Python releases, but access to :c:member:`~PyTypeObject.tp_flags` itself is not part of the :ref:`limited API <limited-c-api>`.
pt_pt: Devolve o membro :c:member:`~PyTypeObject.tp_flags` de *type*. Esta função é destinada principalmente para uso com ``Py_LIMITED_API``; os bits de flag individuais são garantidos como estáveis entre versões do Python, mas o acesso a :c:member:`~PyTypeObject.tp_flags` em si não faz parte da :ref:`API limitada <limited-c-api>`.
ru: Верните член :c:member:`~PyTypeObject.tp_flags` из *type*. Эта функция в первую очередь предназначена для использования с Py_LIMITED_API; отдельные биты флагов гарантированно стабильны во всех выпусках Python, но доступ к :c:member:`~PyTypeObject.tp_flags` сам по себе не является частью :ref:`limited API <limited-c-api>`.

source: The return type is now ``unsigned long`` rather than ``long``.
pt_pt: O tipo de retorno é agora ``unsigned long`` em vez de ``long``.
ru: Тип возвращаемого значения теперь ``unsigned long``, а не ``long``.

source: Return the type object's internal namespace, which is otherwise only exposed via a read-only proxy (:attr:`cls.__dict__ <type.__dict__>`). This is a replacement for accessing :c:member:`~PyTypeObject.tp_dict` directly. The returned dictionary must be treated as read-only.
pt_pt: Devolve o espaço de nomes interno do objeto tipo, que de outra forma é exposto apenas através de um proxy de somente leitura (:attr:`cls.__dict__ <type.__dict__>`). Isto é um substituto para acessar :c:member:`~PyTypeObject.tp_dict` diretamente. O dicionário devolvido deve ser tratado como somente leitura.
ru: Возвращает внутреннее пространство имен объекта типа, которое в противном случае предоставляется только через прокси-сервер, доступный только для чтения (:attr:`cls.__dict__ <type.__dict__>`). Это замена прямого доступа к :c:member:`~PyTypeObject.tp_dict`. Возвращенный словарь должен рассматриваться как доступный только для чтения.

source: This function is meant for specific embedding and language-binding cases, where direct access to the dict is necessary and indirect access (e.g. via the proxy or :c:func:`PyObject_GetAttr`) isn't adequate.
pt_pt: Esta função é destinada a casos específicos de incorporação e ligação de linguagem, onde o acesso direto ao dicionário é necessário e o acesso indireto (por exemplo, através do proxy ou :c:func:`PyObject_GetAttr`) não é adequado.
ru: Эта функция предназначена для конкретных случаев встраивания и привязки языка, когда необходим прямой доступ к dict, а косвенный доступ (например, через прокси или :c:func:`PyObject_GetAttr`) недостаточен.

source: Extension modules should continue to use ``tp_dict``, directly or indirectly, when setting up their own types.
pt_pt: Os módulos de extensão devem continuar a usar ``tp_dict``, diretamente ou indiretamente, ao configurar os seus próprios tipos.
ru: Модули расширения должны продолжать использовать tp_dict, прямо или косвенно, при настройке своих собственных типов.

source: Invalidate the internal lookup cache for the type and all of its subtypes. This function must be called after any manual modification of the attributes or base classes of the type.
pt_pt: Invalidar a cache de pesquisa interna para o tipo e todos os seus subtipos. Esta função deve ser chamada após qualquer modificação manual dos atributos ou classes base do tipo.
ru: Сделайте недействительным внутренний кэш поиска для типа и всех его подтипов. Эту функцию необходимо вызывать после любого изменения вручную атрибутов или базовых классов типа.

source: Register *callback* as a type watcher. Return a non-negative integer ID which must be passed to future calls to :c:func:`PyType_Watch`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
pt_pt: Registar *callback* como um observador de tipo. Devolve um ID inteiro não negativo que deve ser passado para chamadas futuras a :c:func:`PyType_Watch`. Em caso de erro (por exemplo, não há mais IDs de observador disponíveis), devolve ``-1`` e define uma exceção.
ru: Зарегистрируйте *callback* в качестве наблюдателя типов. Возвращает неотрицательный целочисленный идентификатор, который необходимо передавать в будущие вызовы :c:func:`PyType_Watch`. В случае ошибки (например, больше нет доступных идентификаторов наблюдателей) верните ``-1`` и установите исключение.

source: In free-threaded builds, :c:func:`PyType_AddWatcher` is not thread-safe, so it must be called at start up (before spawning the first thread).
pt_pt: Em compilações free-threaded, :c:func:`PyType_AddWatcher` não é seguro para threads, por isso deve ser chamado na inicialização (antes de criar o primeiro thread).
ru: В свободно-поточных сборках :c:func:`PyType_AddWatcher` не является потокобезопасной, поэтому ее необходимо вызывать при запуске (до порождения первого потока).

source: Clear watcher identified by *watcher_id* (previously returned from :c:func:`PyType_AddWatcher`). Return ``0`` on success, ``-1`` on error (e.g. if *watcher_id* was never registered.)
pt_pt: Limpar o observador identificado por *watcher_id* (anteriormente devolvido por :c:func:`PyType_AddWatcher`). Devolve ``0`` em caso de sucesso, ``-1`` em caso de erro (por exemplo, se *watcher_id* nunca foi registado).
ru: Очистить наблюдатель, идентифицированный *watcher_id* (ранее возвращаемый из :c:func:`PyType_AddWatcher`). Возвращает ``0`` в случае успеха, ``-1`` в случае ошибки (например, если *watcher_id* никогда не был зарегистрирован).

source: An extension should never call ``PyType_ClearWatcher`` with a *watcher_id* that was not returned to it by a previous call to :c:func:`PyType_AddWatcher`.
pt_pt: Uma extensão nunca deve chamar ``PyType_ClearWatcher`` com um *watcher_id* que não lhe tenha sido devolvido por uma chamada anterior a :c:func:`PyType_AddWatcher`.
ru: Расширение никогда не должно вызывать PyType_ClearWatcher с *watcher_id*, который не был возвращен ему предыдущим вызовом :c:func:`PyType_AddWatcher`.

source: Mark *type* as watched. The callback granted *watcher_id* by :c:func:`PyType_AddWatcher` will be called whenever :c:func:`PyType_Modified` reports a change to *type*. (The callback may be called only once for a series of consecutive modifications to *type*, if :c:func:`!_PyType_Lookup` is not called on *type* between the modifications; this is an implementation detail and subject to change.)
pt_pt: Marcar *type* como observado. A função de retorno *callback* concedida pelo *watcher_id* por :c:func:`PyType_AddWatcher` será chamada sempre que :c:func:`PyType_Modified` reportar uma alteração em *type*. (A função de retorno pode ser chamada apenas uma vez para uma série de modificações consecutivas em *type*, se :c:func:`!_PyType_Lookup` não for chamado em *type* entre as modificações; isto é um detalhe de implementação e está sujeito a alterações.)
ru: Отметить *тип* как просмотренное. Обратный вызов, предоставленный *watcher_id* от :c:func:`PyType_AddWatcher`, будет вызываться всякий раз, когда :c:func:`PyType_Modified` сообщает об изменении *type*. (Обратный вызов может быть вызван только один раз для серии последовательных модификаций *type*, если :c:func:`!_PyType_Lookup` не вызывается для *type* между модификациями; это деталь реализации и может быть изменена. )

source: An extension should never call ``PyType_Watch`` with a *watcher_id* that was not returned to it by a previous call to :c:func:`PyType_AddWatcher`.
pt_pt: Uma extensão nunca deve chamar ``PyType_Watch`` com um *watcher_id* que não lhe tenha sido devolvido por uma chamada anterior a :c:func:`PyType_AddWatcher`.
ru: Расширение никогда не должно вызывать PyType_Watch с *watcher_id*, который не был возвращен ему предыдущим вызовом :c:func:`PyType_AddWatcher`.

source: Mark *type* as not watched. This undoes a previous call to :c:func:`PyType_Watch`. *type* must not be ``NULL``.
pt_pt: Marcar *type* como não observado. Isto desfaz uma chamada anterior a :c:func:`PyType_Watch`. *type* não deve ser ``NULL``.

source: An extension should never call this function with a *watcher_id* that was not returned to it by a previous call to :c:func:`PyType_AddWatcher`.
pt_pt: Uma extensão nunca deve chamar esta função com um *watcher_id* que não lhe tenha sido devolvido por uma chamada anterior a :c:func:`PyType_AddWatcher`.

source: On success, this function returns ``0``. On failure, this function returns ``-1`` with an exception set.
pt_pt: Em caso de sucesso, esta função devolve ``0``. Em caso de falha, esta função devolve ``-1`` com uma exceção definida.

source: Type of a type-watcher callback function.
pt_pt: Tipo de uma função de retorno de observador de tipo.
ru: Тип функции обратного вызова наблюдателя за типами.

source: The callback must not modify *type* or cause :c:func:`PyType_Modified` to be called on *type* or any type in its MRO; violating this rule could cause infinite recursion.
pt_pt: A função de retorno não deve modificar *type* ou causar que :c:func:`PyType_Modified` seja chamada em *type* ou em qualquer tipo na sua MRO; violar esta regra pode causar recursão infinita.
ru: Обратный вызов не должен изменять *type* или вызывать вызов :c:func:`PyType_Modified` для *type* или любого типа в его MRO; нарушение этого правила может привести к бесконечной рекурсии.

source: Return non-zero if the type object *o* sets the feature *feature*. Type features are denoted by single bit flags.
pt_pt: Devolve um valor diferente de zero se o objeto tipo *o* definir a funcionalidade *feature*. As funcionalidades do tipo são denotadas por flags de bit único.
ru: Возвращает ненулевое значение, если объект типа *o* устанавливает функцию *feature*. Типовые признаки обозначаются однобитовыми флагами.

source: Return non-zero if the type object *type* sets the subclass flag *flag*. Subclass flags are denoted by :c:macro:`Py_TPFLAGS_*_SUBCLASS <Py_TPFLAGS_LONG_SUBCLASS>`. This function is used by many ``_Check`` functions for common types.
pt_pt: Devolve um valor diferente de zero se o objeto tipo *type* definir a flag de subtipo *flag*. As flags de subtipo são denotadas por :c:macro:`Py_TPFLAGS_*_SUBCLASS <Py_TPFLAGS_LONG_SUBCLASS>`. Esta função é usada por muitas funções ``_Check`` para tipos comuns.

source: :c:func:`PyObject_TypeCheck`, which is used as a slower alternative in ``_Check`` functions for types that don't come with subclass flags.
pt_pt: :c:func:`PyObject_TypeCheck`, que é usado como uma alternativa mais lenta em funções ``_Check`` para tipos que não vêm com flags de subtipo.

source: Return true if the type object includes support for the cycle detector; this tests the type flag :c:macro:`Py_TPFLAGS_HAVE_GC`.
pt_pt: Devolve verdadeiro se o objeto tipo incluir suporte para o detetor de ciclos; isto testa a flag de tipo :c:macro:`Py_TPFLAGS_HAVE_GC`.
ru: Возвращайте true, если объект типа включает поддержку детектора цикла; это проверяет флаг типа :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Return true if *a* is a subtype of *b*.
pt_pt: Devolve verdadeiro se *a* for um subtipo de *b*.
ru: Возвращайте true, если *a* является подтипом *b*.

source: This function only checks for actual subtypes, which means that :meth:`~type.__subclasscheck__` is not called on *b*. Call :c:func:`PyObject_IsSubclass` to do the same check that :func:`issubclass` would do.
pt_pt: Esta função verifica apenas subtipos reais, o que significa que :meth:`~type.__subclasscheck__` não é chamado em *b*. Chame :c:func:`PyObject_IsSubclass` para fazer a mesma verificação que :func:`issubclass` faria.
ru: Эта функция проверяет только фактические подтипы, а это означает, что :meth:`~type.__subclasscheck__` не вызывается для *b*. Вызовите :c:func:`PyObject_IsSubclass`, чтобы выполнить ту же проверку, что и :func:`issubclass`.

source: Generic handler for the :c:member:`~PyTypeObject.tp_alloc` slot of a type object. Uses Python's default memory allocation mechanism to allocate memory for a new instance, zeros the memory, then initializes the memory as if by calling :c:func:`PyObject_Init` or :c:func:`PyObject_InitVar`.
pt_pt: Manipulador genérico para o slot :c:member:`~PyTypeObject.tp_alloc` de um objeto tipo. Usa o mecanismo de alocação de memória padrão do Python para alocar memória para uma nova instância, coloca a memória a zero, e depois inicializa a memória como se chamasse :c:func:`PyObject_Init` ou :c:func:`PyObject_InitVar`.

source: Do not call this directly to allocate memory for an object; call the type's :c:member:`~PyTypeObject.tp_alloc` slot instead.
pt_pt: Não chame isto diretamente para alocar memória para um objeto; em vez disso, chame o slot :c:member:`~PyTypeObject.tp_alloc` do tipo.

source: For types that support garbage collection (i.e., the :c:macro:`Py_TPFLAGS_HAVE_GC` flag is set), this function behaves like :c:macro:`PyObject_GC_New` or :c:macro:`PyObject_GC_NewVar` (except the memory is guaranteed to be zeroed before initialization), and should be paired with :c:func:`PyObject_GC_Del` in :c:member:`~PyTypeObject.tp_free`. Otherwise, it behaves like :c:macro:`PyObject_New` or :c:macro:`PyObject_NewVar` (except the memory is guaranteed to be zeroed before initialization) and should be paired with :c:func:`PyObject_Free` in :c:member:`~PyTypeObject.tp_free`.
pt_pt: Para tipos que suportam recolha de lixo (ou seja, a flag :c:macro:`Py_TPFLAGS_HAVE_GC` está definida), esta função comporta-se como :c:macro:`PyObject_GC_New` ou :c:macro:`PyObject_GC_NewVar` (exceto que a memória é garantidamente colocada a zero antes da inicialização), e deve ser emparelhada com :c:func:`PyObject_GC_Del` em :c:member:`~PyTypeObject.tp_free`. Caso contrário, comporta-se como :c:macro:`PyObject_New` ou :c:macro:`PyObject_NewVar` (exceto que a memória é garantidamente colocada a zero antes da inicialização) e deve ser emparelhada com :c:func:`PyObject_Free` em :c:member:`~PyTypeObject.tp_free`.

source: Generic handler for the :c:member:`~PyTypeObject.tp_new` slot of a type object. Creates a new instance using the type's :c:member:`~PyTypeObject.tp_alloc` slot and returns the resulting object.
pt_pt: Manipulador genérico para o slot :c:member:`~PyTypeObject.tp_new` de um objeto tipo. Cria uma nova instância usando o slot :c:member:`~PyTypeObject.tp_alloc` do tipo e devolve o objeto resultante.

source: Finalize a type object. This should be called on all type objects to finish their initialization. This function is responsible for adding inherited slots from a type's base class. Return ``0`` on success, or return ``-1`` and sets an exception on error.
pt_pt: Finaliza um objeto tipo. Isto deve ser chamado em todos os objetos tipo para terminar a sua inicialização. Esta função é responsável por adicionar slots herdados da classe base de um tipo. Devolve ``0`` em caso de sucesso, ou devolve ``-1`` e define uma exceção em caso de erro.
ru: Завершите типовой объект. Это следует вызывать для всех объектов типа, чтобы завершить их инициализацию. Эта функция отвечает за добавление слотов, унаследованных от базового класса типа. Возвращает ``0`` в случае успеха или возвращает ``-1`` и устанавливает исключение в случае ошибки.

source: If some of the base classes implements the GC protocol and the provided type does not include the :c:macro:`Py_TPFLAGS_HAVE_GC` in its flags, then the GC protocol will be automatically implemented from its parents. On the contrary, if the type being created does include :c:macro:`Py_TPFLAGS_HAVE_GC` in its flags then it **must** implement the GC protocol itself by at least implementing the :c:member:`~PyTypeObject.tp_traverse` handle.
pt_pt: Se algumas das classes base implementam o protocolo GC e o tipo fornecido não incluir a flag :c:macro:`Py_TPFLAGS_HAVE_GC`, então o protocolo GC será implementado automaticamente a partir dos seus pais. Pelo contrário, se o tipo a ser criado incluir :c:macro:`Py_TPFLAGS_HAVE_GC` nas suas flags, então **deve** implementar o protocolo GC por si mesmo, implementando pelo menos o manipulador :c:member:`~PyTypeObject.tp_traverse`.
ru: Если некоторые базовые классы реализуют протокол GC, а предоставленный тип не включает :c:macro:`Py_TPFLAGS_HAVE_GC` в свои флаги, то протокол GC будет автоматически реализован из его родительских классов. Напротив, если создаваемый тип включает :c:macro:`Py_TPFLAGS_HAVE_GC` в свои флаги, то он **должен** реализовать сам протокол GC, по крайней мере реализовав :c:member:`~PyTypeObject.tp_traverse` ручка.

source: Return the type's name. Equivalent to getting the type's :attr:`~type.__name__` attribute.
pt_pt: Devolve o nome do tipo. Equivalente a obter o atributo :attr:`~type.__name__` do tipo.
ru: Верните имя типа. Эквивалентно получению атрибута типа :attr:`~type.__name__`.

source: Return the type's qualified name. Equivalent to getting the type's :attr:`~type.__qualname__` attribute.
pt_pt: Devolve o nome qualificado do tipo. Equivalente a obter o atributo :attr:`~type.__qualname__` do tipo.
ru: Верните полное имя типа. Эквивалентно получению атрибута типа :attr:`~type.__qualname__`.

source: Return the type's fully qualified name. Equivalent to ``f"{type.__module__}.{type.__qualname__}"``, or :attr:`type.__qualname__` if :attr:`type.__module__` is not a string or is equal to ``"builtins"``.
pt_pt: Devolve o nome totalmente qualificado do tipo. Equivalente a ``f"{type.__module__}.{type.__qualname__}"``, ou :attr:`type.__qualname__` se :attr:`type.__module__` não for uma string ou for igual a ``"builtins"``.
ru: Верните полное имя типа. Эквивалентно ``f"{type.__module__}.{type.__qualname__}"`` или :attr:`type.__qualname__`, если :attr:`type.__module__` не является строкой или равно ``" встроенные функции"``.

source: Return the type's module name. Equivalent to getting the :attr:`type.__module__` attribute.
pt_pt: Devolve o nome do módulo do tipo. Equivalente a obter o atributo :attr:`type.__module__`.
ru: Верните имя модуля типа. Эквивалентно получению атрибута :attr:`type.__module__`.

source: Return the function pointer stored in the given slot. If the result is ``NULL``, this indicates that either the slot is ``NULL``, or that the function was called with invalid parameters. Callers will typically cast the result pointer into the appropriate function type.
pt_pt: Devolve o ponteiro de função armazenado no slot dado. Se o resultado for ``NULL``, isto indica que ou o slot é ``NULL``, ou que a função foi chamada com parâmetros inválidos. Os chamadores normalmente converterão o ponteiro de resultado no tipo de função apropriado.
ru: Верните указатель функции, хранящийся в данном слоте. Если результат равен NULL, это означает, что либо слот имеет значение NULL, либо функция была вызвана с недопустимыми параметрами. Вызывающие программы обычно преобразуют указатель результата в соответствующий тип функции.

source: See :c:member:`PyType_Slot.slot` for possible values of the *slot* argument.
pt_pt: Veja :c:member:`PyType_Slot.slot` para possíveis valores do argumento *slot*.
ru: См. :c:member:`PyType_Slot.slot` для возможных значений аргумента *slot*.

source: :c:func:`PyType_GetSlot` can now accept all types. Previously, it was limited to :ref:`heap types <heap-types>`.
pt_pt: :c:func:`PyType_GetSlot` agora pode aceitar todos os tipos. Anteriormente, estava limitado a :ref:`tipos heap <heap-types>`.
ru: :c:func:`PyType_GetSlot` теперь может принимать все типы. Раньше оно было ограничено :ref:`типами кучи <heap-types>`.

source: Return the module object associated with the given type when the type was created using :c:func:`PyType_FromModuleAndSpec`.
pt_pt: Devolve o objeto módulo associado ao tipo dado quando o tipo foi criado usando :c:func:`PyType_FromModuleAndSpec`.
ru: Возвращает объект модуля, связанный с данным типом, когда тип был создан с использованием :c:func:`PyType_FromModuleAndSpec`.

source: If no module is associated with the given type, sets :py:class:`TypeError` and returns ``NULL``.
pt_pt: Se nenhum módulo estiver associado ao tipo dado, define :py:class:`TypeError` e devolve ``NULL``.
ru: Если с данным типом не связан ни один модуль, устанавливается :py:class:`TypeError` и возвращается ``NULL``.

source: This function is usually used to get the module in which a method is defined. Note that in such a method, ``PyType_GetModule(Py_TYPE(self))`` may not return the intended result. ``Py_TYPE(self)`` may be a *subclass* of the intended class, and subclasses are not necessarily defined in the same module as their superclass. See :c:type:`PyCMethod` to get the class that defines the method. See :c:func:`PyType_GetModuleByDef` for cases when :c:type:`!PyCMethod` cannot be used.
pt_pt: Esta função é normalmente usada para obter o módulo no qual um método é definido. Note que, em tal método, ``PyType_GetModule(Py_TYPE(self))`` pode não devolver o resultado pretendido. ``Py_TYPE(self)`` pode ser uma *subclasse* da classe pretendida, e as subclasses não são necessariamente definidas no mesmo módulo que a sua superclasse. Veja :c:type:`PyCMethod` para obter a classe que define o método. Veja :c:func:`PyType_GetModuleByDef` para casos em que :c:type:`!PyCMethod` não pode ser usado.
ru: Эта функция обычно используется для получения модуля, в котором определен метод. Обратите внимание, что в таком методе PyType_GetModule(Py_TYPE(self)) может не вернуть желаемый результат. ``Py_TYPE(self)`` может быть *подклассом* предполагаемого класса, и подклассы не обязательно определяются в том же модуле, что и их суперкласс. См. :c:type:`PyCMethod`, чтобы получить класс, определяющий метод. См. :c:func:`PyType_GetModuleByDef` для случаев, когда :c:type:`!PyCMethod` не может быть использован.
