Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: pt_pt

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
pt_pt: Esta função primeiro empresta uma referência a ``list[0]``, depois substitui ``list[1]`` pelo valor ``0``, e finalmente imprime a referência emprestada. Parece inofensivo, certo? Mas não é!

source: Since it is written in Python, the :meth:`!__del__` method can execute arbitrary Python code. Could it perhaps do something to invalidate the reference to ``item`` in :c:func:`!bug`? You bet! Assuming that the list passed into :c:func:`!bug` is accessible to the :meth:`!__del__` method, it could execute a statement to the effect of ``del list[0]``, and assuming this was the last reference to that object, it would free the memory associated with it, thereby invalidating ``item``.
pt_pt: Como está escrito em Python, o método :meth:`!__del__` pode executar código Python arbitrário. Poderia fazer algo para invalidar a referência a ``item`` em :c:func:`!bug`? Claro! Assumindo que a lista passada para :c:func:`!bug` é acessível ao método :meth:`!__del__`, poderia executar uma instrução do tipo ``del list[0]``, e assumindo que esta era a última referência a esse objeto, libertaria a memória associada a ele, invalidando assim ``item``.

source: The solution, once you know the source of the problem, is easy: temporarily increment the reference count. The correct version of the function reads::
pt_pt: A solução, uma vez conhecido o problema, é fácil: incrementar temporariamente a contagem de referências. A versão correta da função é::

source: This is a true story. An older version of Python contained variants of this bug and someone spent a considerable amount of time in a C debugger to figure out why his :meth:`!__del__` methods would fail...
pt_pt: Esta é uma história verdadeira. Uma versão mais antiga do Python continha variantes deste erro e alguém passou uma quantidade considerável de tempo num depurador C para descobrir por que os seus métodos :meth:`!__del__` falhavam...

source: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); Py_BEGIN_ALLOW_THREADS ...some blocking I/O call... Py_END_ALLOW_THREADS PyObject_Print(item, stdout, 0); /* BUG! */ }
pt_pt: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); Py_BEGIN_ALLOW_THREADS ...alguma chamada de I/O bloqueante... Py_END_ALLOW_THREADS PyObject_Print(item, stdout, 0); /* ERRO! */ }

source: NULL Pointers
pt_pt: Ponteiros Nulos

source: In general, functions that take object references as arguments do not expect you to pass them ``NULL`` pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return ``NULL`` only to indicate that an exception occurred. The reason for not testing for ``NULL`` arguments is that functions often pass the objects they receive on to other function --- if each function were to test for ``NULL``, there would be a lot of redundant tests and the code would run more slowly.
pt_pt: Em geral, funções que recebem referências a objetos como argumentos não esperam que passe ponteiros ``NULL``, e irão causar um *core dump* (ou causar *core dumps* posteriores) se o fizer. Funções que retornam referências a objetos geralmente retornam ``NULL`` apenas para indicar que ocorreu uma exceção. A razão para não testar argumentos ``NULL`` é que as funções frequentemente passam os objetos que recebem para outras funções — se cada função testasse ``NULL``, haveria muitos testes redundantes e o código executaria mais lentamente.

source: It is better to test for ``NULL`` only at the "source:" when a pointer that may be ``NULL`` is received, for example, from :c:func:`malloc` or from a function that may raise an exception.
pt_pt: É melhor testar ``NULL`` apenas na "fonte": quando um ponteiro que pode ser ``NULL`` é recebido, por exemplo, de :c:func:`malloc` ou de uma função que pode levantar uma exceção.

source: The macros :c:func:`Py_INCREF` and :c:func:`Py_DECREF` do not check for ``NULL`` pointers --- however, their variants :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` do.
pt_pt: As macros :c:func:`Py_INCREF` e :c:func:`Py_DECREF` não verificam ponteiros ``NULL`` — no entanto, as suas variantes :c:func:`Py_XINCREF` e :c:func:`Py_XDECREF` verificam.

source: The macros for checking for a particular object type (``Pytype_Check()``) don't check for ``NULL`` pointers --- again, there is much code that calls several of these in a row to test an object against various different expected types, and this would generate redundant tests. There are no variants with ``NULL`` checking.
pt_pt: As macros para verificar um tipo de objeto específico (``Pytype_Check()``) não verificam ponteiros ``NULL`` — novamente, existe muito código que chama várias destas em sequência para testar um objeto contra vários tipos esperados diferentes, e isto geraria testes redundantes. Não existem variantes com verificação de ``NULL``.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never ``NULL`` --- in fact it guarantees that it is always a tuple [#]_.
pt_pt: O mecanismo de chamada de funções C garante que a lista de argumentos passada para funções C (``args`` nos exemplos) nunca é ``NULL`` — na verdade, garante que é sempre uma *tuple* [#]_.

source: It is a severe error to ever let a ``NULL`` pointer "escape" to the Python user.
pt_pt: É um erro grave permitir que um ponteiro ``NULL`` "escape" para o utilizador Python.

source: Writing Extensions in C++
pt_pt: Escrever Extensões em C++

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
pt_pt: É possível escrever módulos de extensão em C++. Aplicam-se algumas restrições. Se o programa principal (o interpretador Python) for compilado e ligado pelo compilador C, objetos globais ou estáticos com construtores não podem ser usados. Isto não é um problema se o programa principal for ligado pelo compilador C++. Funções que serão chamadas pelo interpretador Python (em particular, funções de inicialização de módulos) têm de ser declaradas usando ``extern "C"``. Não é necessário envolver os ficheiros de cabeçalho do Python em ``extern "C" {...}`` — eles já usam esta forma se o símbolo ``__cplusplus`` estiver definido (todos os compiladores C++ recentes definem este símbolo).

source: Providing a C API for an Extension Module
pt_pt: Fornecer uma API C para um Módulo de Extensão

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
pt_pt: Muitos módulos de extensão fornecem apenas novas funções e tipos para serem usados a partir do Python, mas às vezes o código num módulo de extensão pode ser útil para outros módulos de extensão. Por exemplo, um módulo de extensão poderia implementar um tipo "coleção" que funciona como listas sem ordem. Assim como o tipo de lista padrão do Python tem uma API C que permite que módulos de extensão criem e manipulem listas, este novo tipo de coleção deve ter um conjunto de funções C para manipulação direta a partir de outros módulos de extensão.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
pt_pt: À primeira vista, isto parece fácil: basta escrever as funções (sem as declarar ``static``, claro), fornecer um ficheiro de cabeçalho apropriado e documentar a API C. E, de facto, isto funcionaria se todos os módulos de extensão fossem sempre ligados estaticamente com o interpretador Python. No entanto, quando os módulos são usados como bibliotecas partilhadas, os símbolos definidos num módulo podem não ser visíveis para outro módulo. Os detalhes da visibilidade dependem do sistema operativo; alguns sistemas usam um espaço de nomes global para o interpretador Python e todos os módulos de extensão (Windows, por exemplo), enquanto outros exigem uma lista explícita de símbolos importados no momento da ligação do módulo (AIX é um exemplo), ou oferecem uma escolha de diferentes estratégias (a maioria dos Unices). E mesmo que os símbolos sejam globalmente visíveis, o módulo cujas funções se deseja chamar pode ainda não ter sido carregado!

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
pt_pt: A portabilidade exige, portanto, não fazer quaisquer suposições sobre a visibilidade dos símbolos. Isto significa que todos os símbolos nos módulos de extensão devem ser declarados ``static``, exceto a função de inicialização do módulo, a fim de evitar conflitos de nomes com outros módulos de extensão (como discutido na secção :ref:`methodtable`). E significa que os símbolos que *devem* ser acessíveis a partir de outros módulos de extensão devem ser exportados de uma forma diferente.

source: Python provides a special mechanism to pass C-level information (pointers) from one extension module to another one: Capsules. A Capsule is a Python data type which stores a pointer (:c:expr:`void \*`). Capsules can only be created and accessed via their C API, but they can be passed around like any other Python object. In particular, they can be assigned to a name in an extension module's namespace. Other extension modules can then import this module, retrieve the value of this name, and then retrieve the pointer from the Capsule.
pt_pt: O Python fornece um mecanismo especial para passar informações ao nível de C (ponteiros) de um módulo de extensão para outro: Capsules. Uma Capsule é um tipo de dados Python que armazena um ponteiro (:c:expr:`void \*`). As Capsules só podem ser criadas e acedidas através da sua API C, mas podem ser passadas como qualquer outro objeto Python. Em particular, podem ser atribuídas a um nome no espaço de nomes de um módulo de extensão. Outros módulos de extensão podem então importar este módulo, recuperar o valor deste nome e, em seguida, recuperar o ponteiro da Capsule.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
pt_pt: Existem muitas formas de usar Capsules para exportar a API C de um módulo de extensão. Cada função pode ter a sua própria Capsule, ou todos os ponteiros da API C podem ser armazenados num *array* cujo endereço é publicado numa Capsule. As várias tarefas de armazenar e recuperar os ponteiros podem ser distribuídas de diferentes formas entre o módulo que fornece o código e os módulos clientes.

source: Whichever method you choose, it's important to name your Capsules properly. The function :c:func:`PyCapsule_New` takes a name parameter (:c:expr:`const char \*`); you're permitted to pass in a ``NULL`` name, but we strongly encourage you to specify a name. Properly named Capsules provide a degree of runtime type-safety; there is no feasible way to tell one unnamed Capsule from another.
pt_pt: Qualquer que seja o método que escolher, é importante nomear corretamente as suas Capsules. A função :c:func:`PyCapsule_New` recebe um parâmetro de nome (:c:expr:`const char \*`); é permitido passar um nome ``NULL``, mas encorajamos fortemente a especificar um nome. Capsules corretamente nomeadas fornecem um grau de segurança de tipo em tempo de execução; não há uma forma viável de distinguir uma Capsule sem nome de outra.

source: In particular, Capsules used to expose C APIs should be given a name following this convention::
pt_pt: Em particular, as Capsules usadas para expor APIs C devem ser nomeadas seguindo esta convenção::

source: modulename.attributename
pt_pt: nome_do_módulo.nome_do_atributo

source: The convenience function :c:func:`PyCapsule_Import` makes it easy to load a C API provided via a Capsule, but only if the Capsule's name matches this convention. This behavior gives C API users a high degree of certainty that the Capsule they load contains the correct C API.
pt_pt: A função de conveniência :c:func:`PyCapsule_Import` facilita o carregamento de uma API C fornecida através de uma Capsule, mas apenas se o nome da Capsule corresponder a esta convenção. Este comportamento dá aos utilizadores da API C um alto grau de certeza de que a Capsule que carregam contém a API C correta.

source: The following example demonstrates an approach that puts most of the burden on the writer of the exporting module, which is appropriate for commonly used library modules. It stores all C API pointers (just one in the example!) in an array of :c:expr:`void` pointers which becomes the value of a Capsule. The header file corresponding to the module provides a macro that takes care of importing the module and retrieving its C API pointers; client modules only have to call this macro before accessing the C API.
pt_pt: O exemplo seguinte demonstra uma abordagem que coloca a maior parte do trabalho sobre o autor do módulo exportador, o que é apropriado para módulos de biblioteca comumente usados. Armazena todos os ponteiros da API C (apenas um no exemplo!) num *array* de ponteiros :c:expr:`void` que se torna o valor de uma Capsule. O ficheiro de cabeçalho correspondente ao módulo fornece uma macro que trata da importação do módulo e da recuperação dos seus ponteiros da API C; os módulos clientes só têm de chamar esta macro antes de aceder à API C.

source: The exporting module is a modification of the :mod:`!spam` module from section :ref:`extending-simpleexample`. The function :func:`!spam.system` does not call the C library function :c:func:`system` directly, but a function :c:func:`!PySpam_System`, which would of course do something more complicated in reality (such as adding "spam" to every command). This function :c:func:`!PySpam_System` is also exported to other extension modules.
pt_pt: O módulo exportador é uma modificação do módulo :mod:`!spam` da secção :ref:`extending-simpleexample`. A função :func:`!spam.system` não chama diretamente a função da biblioteca C :c:func:`system`, mas uma função :c:func:`!PySpam_System`, que, claro, faria algo mais complicado na realidade (como adicionar "spam" a cada comando). Esta função :c:func:`!PySpam_System` também é exportada para outros módulos de extensão.

source: The function :c:func:`!PySpam_System` is a plain C function, declared ``static`` like everything else::
pt_pt: A função :c:func:`!PySpam_System` é uma função C simples, declarada ``static`` como tudo o resto::

source: The function :c:func:`!spam_system` is modified in a trivial way::
pt_pt: A função :c:func:`!spam_system` é modificada de uma forma trivial::

source: In the beginning of the module, right after the line ::
pt_pt: No início do módulo, logo após a linha ::

source: two more lines must be added::
pt_pt: devem ser adicionadas mais duas linhas::

source: Note that ``PySpam_API`` is declared ``static``; otherwise the pointer array would disappear when :c:func:`!PyInit_spam` terminates!
pt_pt: Note que ``PySpam_API`` é declarado ``static``; caso contrário, o *array* de ponteiros desapareceria quando :c:func:`!PyInit_spam` terminasse!

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
pt_pt: A maior parte do trabalho está no ficheiro de cabeçalho :file:`spammodule.h`, que é assim::

source: #ifndef Py_SPAMMODULE_H #define Py_SPAMMODULE_H #ifdef __cplusplus extern "C" { #endif /* Header file for spammodule */ /* C API functions */ #define PySpam_System_NUM 0 #define PySpam_System_RETURN int #define PySpam_System_PROTO (const char *command) /* Total number of C API pointers */ #define PySpam_API_pointers 1 #ifdef SPAM_MODULE /* This section is used when compiling spammodule.c */ static PySpam_System_RETURN PySpam_System PySpam_System_PROTO; #else /* This section is used in modules that use spammodule's API */ static void **PySpam_API; #define PySpam_System \ (*(PySpam_System_RETURN (*)PySpam_System_PROTO) PySpam_API[PySpam_System_NUM]) /* Return -1 on error, 0 on success. * PyCapsule_Import will set an exception if there's an error. */ static int import_spam(void) { PySpam_API = (void **)PyCapsule_Import("spam._C_API", 0); return (PySpam_API != NULL) ? 0 : -1; } #endif #ifdef __cplusplus } #endif #endif /* !defined(Py_SPAMMODULE_H) */
pt_pt: #ifndef Py_SPAMMODULE_H #define Py_SPAMMODULE_H #ifdef __cplusplus extern "C" { #endif /* Ficheiro de cabeçalho para spammodule */ /* Funções da API C */ #define PySpam_System_NUM 0 #define PySpam_System_RETURN int #define PySpam_System_PROTO (const char *command) /* Número total de ponteiros da API C */ #define PySpam_API_pointers 1 #ifdef SPAM_MODULE /* Esta secção é usada ao compilar spammodule.c */ static PySpam_System_RETURN PySpam_System PySpam_System_PROTO; #else /* Esta secção é usada em módulos que usam a API de spammodule */ static void **PySpam_API; #define PySpam_System \ (*(PySpam_System_RETURN (*)PySpam_System_PROTO) PySpam_API[PySpam_System_NUM]) /* Retorna -1 em caso de erro, 0 em caso de sucesso. * PyCapsule_Import irá definir uma exceção se houver um erro. */ static int import_spam(void) { PySpam_API = (void **)PyCapsule_Import("spam._C_API", 0); return (PySpam_API != NULL) ? 0 : -1; } #endif #ifdef __cplusplus } #endif #endif /* !defined(Py_SPAMMODULE_H) */

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
pt_pt: A principal desvantagem desta abordagem é que o ficheiro :file:`spammodule.h` é bastante complicado. No entanto, a estrutura básica é a mesma para cada função exportada, por isso só tem de ser aprendida uma vez.

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
pt_pt: Finalmente, deve ser mencionado que as Capsules oferecem funcionalidade adicional, que é especialmente útil para a alocação e desalocação de memória do ponteiro armazenado numa Capsule. Os detalhes são descritos no Manual de Referência da API Python/C na secção :ref:`capsules` e na implementação das Capsules (ficheiros :file:`Include/pycapsule.h` e :file:`Objects/pycapsule.c` na distribuição do código-fonte do Python).

source: Footnotes
pt_pt: Notas de rodapé

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
pt_pt: Uma interface para esta função já existe no módulo padrão :mod:`os` — foi escolhida como um exemplo simples e direto.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
pt_pt: A metáfora de "emprestar" uma referência não está completamente correta: o proprietário ainda tem uma cópia da referência.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
pt_pt: Verificar se a contagem de referências é pelo menos 1 **não funciona** — a própria contagem de referências pode estar em memória libertada e, portanto, pode ser reutilizada para outro objeto!

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
pt_pt: Estas garantias não se aplicam quando se usa a convenção de chamada "antiga" — isto ainda é encontrado em muito código existente.

source: PyObject_CallObject (C function)
pt_pt: PyObject_CallObject (função C)

source: PyArg_ParseTuple (C function)
pt_pt: PyArg_ParseTuple (função C)

source: PyArg_ParseTupleAndKeywords (C function)
pt_pt: PyArg_ParseTupleAndKeywords (função C)
