Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: pt_pt

source: Extending Python with C or C++
pt_pt: Estender o Python com C ou C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
pt_pt: É bastante fácil adicionar novos módulos integrados ao Python, se souber programar em C. Tais :dfn:`módulos de extensão` podem fazer duas coisas que não podem ser feitas diretamente em Python: podem implementar novos tipos de objetos integrados e podem chamar funções de bibliotecas C e chamadas de sistema.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
pt_pt: Para suportar extensões, a API do Python (Application Programmers Interface) define um conjunto de funções, macros e variáveis que fornecem acesso à maioria dos aspetos do sistema de execução do Python. A API do Python é incorporada num ficheiro fonte C incluindo o cabeçalho ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
pt_pt: A compilação de um módulo de extensão depende da sua utilização pretendida, bem como da configuração do sistema; os detalhes são fornecidos em capítulos posteriores.

source: The C extension interface is specific to CPython, and extension modules do not work on other Python implementations. In many cases, it is possible to avoid writing C extensions and preserve portability to other implementations. For example, if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module or the `cffi <https://cffi.readthedocs.io/>`_ library rather than writing custom C code. These modules let you write Python code to interface with C code and are more portable between implementations of Python than writing and compiling a C extension module.
pt_pt: A interface de extensão C é específica do CPython, e os módulos de extensão não funcionam em outras implementações do Python. Em muitos casos, é possível evitar escrever extensões em C e preservar a portabilidade para outras implementações. Por exemplo, se o seu caso de uso é chamar funções de bibliotecas C ou chamadas de sistema, deve considerar usar o módulo :mod:`ctypes` ou a biblioteca `cffi <https://cffi.readthedocs.io/>`_ em vez de escrever código C personalizado. Estes módulos permitem escrever código Python para interagir com código C e são mais portáteis entre implementações do Python do que escrever e compilar um módulo de extensão em C.

source: A Simple Example
pt_pt: Um Exemplo Simples

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :c:func:`system` [#]_. This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows:
pt_pt: Vamos criar um módulo de extensão chamado ``spam`` (a comida favorita dos fãs de Monty Python...) e digamos que queremos criar uma interface Python para a função da biblioteca C :c:func:`system` [#]_. Esta função recebe uma *string* de caracteres terminada em nulo como argumento e retorna um inteiro. Queremos que esta função seja chamável a partir do Python da seguinte forma:

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
pt_pt: Comece por criar um ficheiro :file:`spammodule.c`. (Historicamente, se um módulo se chama ``spam``, o ficheiro C que contém a sua implementação chama-se :file:`spammodule.c`; se o nome do módulo for muito longo, como ``spammify``, o nome do módulo pode ser simplesmente :file:`spammify.c`.)

source: The first two lines of our file can be::
pt_pt: As primeiras duas linhas do nosso ficheiro podem ser::

source: #define PY_SSIZE_T_CLEAN #include <Python.h>
pt_pt: #define PY_SSIZE_T_CLEAN #inclui <Python.h>

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
pt_pt: que inclui a API do Python (pode adicionar um comentário a descrever o propósito do módulo e um aviso de direitos de autor, se desejar).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
pt_pt: Como o Python pode definir algumas definições de pré-processador que afetam os cabeçalhos padrão em alguns sistemas, é *necessário* incluir :file:`Python.h` antes de incluir quaisquer cabeçalhos padrão.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
pt_pt: A próxima coisa que adicionamos ao nosso ficheiro de módulo é a função C que será chamada quando a expressão Python ``spam.system(string)`` for avaliada (veremos em breve como ela acaba por ser chamada)::

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
pt_pt: Existe uma tradução direta da lista de argumentos em Python (por exemplo, a expressão única ``"ls -l"``) para os argumentos passados à função C. A função C tem sempre dois argumentos, convencionalmente chamados *self* e *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
pt_pt: O argumento *self* aponta para o objeto do módulo para funções ao nível do módulo; para um método, apontaria para a instância do objeto.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :c:func:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
pt_pt: O argumento *args* será um ponteiro para um objeto *tuple* do Python contendo os argumentos. Cada item da *tuple* corresponde a um argumento na lista de argumentos da chamada. Os argumentos são objetos Python — para fazer algo com eles na nossa função C, temos de os converter para valores C. A função :c:func:`PyArg_ParseTuple` na API do Python verifica os tipos dos argumentos e converte-os para valores C. Utiliza uma *string* de modelo para determinar os tipos necessários dos argumentos, bem como os tipos das variáveis C nas quais armazenar os valores convertidos. Mais sobre isto mais tarde.

source: :c:func:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return ``NULL`` immediately (as we saw in the example).
pt_pt: :c:func:`PyArg_ParseTuple` retorna verdadeiro (não zero) se todos os argumentos tiverem o tipo correto e os seus componentes tiverem sido armazenados nas variáveis cujos endereços são passados. Retorna falso (zero) se uma lista de argumentos inválida for passada. Neste último caso, também levanta uma exceção apropriada, para que a função chamadora possa retornar ``NULL`` imediatamente (como vimos no exemplo).

source: Intermezzo: Errors and Exceptions
pt_pt: Intermezzo: Erros e Exceções

source: An important convention throughout the Python interpreter is the following: when a function fails, it should set an exception condition and return an error value (usually ``-1`` or a ``NULL`` pointer). Exception information is stored in three members of the interpreter's thread state. These are ``NULL`` if there is no exception. Otherwise they are the C equivalents of the members of the Python tuple returned by :meth:`sys.exc_info`. These are the exception type, exception instance, and a traceback object. It is important to know about them to understand how errors are passed around.
pt_pt: Uma convenção importante em todo o interpretador Python é a seguinte: quando uma função falha, deve definir uma condição de exceção e retornar um valor de erro (geralmente ``-1`` ou um ponteiro ``NULL``). A informação da exceção é armazenada em três membros do estado da *thread* do interpretador. Estes são ``NULL`` se não houver exceção. Caso contrário, são os equivalentes em C dos membros da *tuple* Python retornada por :meth:`sys.exc_info`. Estes são o tipo de exceção, a instância da exceção e um objeto de rastreio. É importante conhecê-los para entender como os erros são passados.

source: The Python API defines a number of functions to set various types of exceptions.
pt_pt: A API do Python define várias funções para definir vários tipos de exceções.

source: The most common one is :c:func:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :c:data:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
pt_pt: A mais comum é :c:func:`PyErr_SetString`. Os seus argumentos são um objeto de exceção e uma *string* C. O objeto de exceção é geralmente um objeto predefinido como :c:data:`PyExc_ZeroDivisionError`. A *string* C indica a causa do erro e é convertida para um objeto *string* do Python e armazenada como o "valor associado" da exceção.

source: Another useful function is :c:func:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :c:data:`errno`. The most general function is :c:func:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :c:func:`Py_INCREF` the objects passed to any of these functions.
pt_pt: Outra função útil é :c:func:`PyErr_SetFromErrno`, que só recebe um argumento de exceção e constrói o valor associado através da inspeção da variável global :c:data:`errno`. A função mais geral é :c:func:`PyErr_SetObject`, que recebe dois argumentos de objeto, a exceção e o seu valor associado. Não precisa de chamar :c:func:`Py_INCREF` nos objetos passados para qualquer uma destas funções.

source: You can test non-destructively whether an exception has been set with :c:func:`PyErr_Occurred`. This returns the current exception object, or ``NULL`` if no exception has occurred. You normally don't need to call :c:func:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
pt_pt: Pode testar de forma não destrutiva se uma exceção foi definida com :c:func:`PyErr_Occurred`. Isto retorna o objeto de exceção atual, ou ``NULL`` se nenhuma exceção tiver ocorrido. Normalmente, não precisa de chamar :c:func:`PyErr_Occurred` para ver se ocorreu um erro numa chamada de função, uma vez que deve ser capaz de determinar isso pelo valor de retorno.

source: When a function *f* that calls another function *g* detects that the latter fails, *f* should itself return an error value (usually ``NULL`` or ``-1``). It should *not* call one of the ``PyErr_*`` functions --- one has already been called by *g*. *f*'s caller is then supposed to also return an error indication to *its* caller, again *without* calling ``PyErr_*``, and so on --- the most detailed cause of the error was already reported by the function that first detected it. Once the error reaches the Python interpreter's main loop, this aborts the currently executing Python code and tries to find an exception handler specified by the Python programmer.
pt_pt: Quando uma função *f* que chama outra função *g* deteta que esta falha, *f* deve ela própria retornar um valor de erro (geralmente ``NULL`` ou ``-1``). Não deve chamar nenhuma das funções ``PyErr_*`` — uma já foi chamada por *g*. O chamador de *f* deve então também retornar uma indicação de erro ao *seu* chamador, novamente *sem* chamar ``PyErr_*``, e assim por diante — a causa mais detalhada do erro já foi reportada pela função que a detetou primeiro. Assim que o erro atinge o loop principal do interpretador Python, este aborta o código Python atualmente em execução e tenta encontrar um manipulador de exceção especificado pelo programador Python.

source: (There are situations where a module can actually give a more detailed error message by calling another ``PyErr_*`` function, and in such cases it is fine to do so. As a general rule, however, this is not necessary, and can cause information about the cause of the error to be lost: most operations can fail for a variety of reasons.)
pt_pt: (Existem situações em que um módulo pode fornecer uma mensagem de erro mais detalhada chamando outra função ``PyErr_*``, e nesses casos está bem fazê-lo. No entanto, como regra geral, isto não é necessário e pode fazer com que a informação sobre a causa do erro se perca: a maioria das operações pode falhar por várias razões.)

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :c:func:`PyErr_Clear`. The only time C code should call :c:func:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
pt_pt: Para ignorar uma exceção definida por uma chamada de função que falhou, a condição de exceção deve ser limpa explicitamente chamando :c:func:`PyErr_Clear`. A única altura em que o código C deve chamar :c:func:`PyErr_Clear` é se não quiser passar o erro para o interpretador, mas quiser tratá-lo completamente por si próprio (possivelmente tentando outra coisa, ou fingindo que nada correu mal).

source: Every failing :c:func:`malloc` call must be turned into an exception --- the direct caller of :c:func:`malloc` (or :c:func:`realloc`) must call :c:func:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :c:func:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :c:func:`malloc` directly.
pt_pt: Cada chamada falhada a :c:func:`malloc` deve ser convertida numa exceção — o chamador direto de :c:func:`malloc` (ou :c:func:`realloc`) deve chamar :c:func:`PyErr_NoMemory` e retornar um indicador de falha. Todas as funções de criação de objetos (por exemplo, :c:func:`PyLong_FromLong`) já fazem isto, por isso esta nota é relevante apenas para aqueles que chamam :c:func:`malloc` diretamente.

source: Also note that, with the important exception of :c:func:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
pt_pt: Note também que, com a importante exceção de :c:func:`PyArg_ParseTuple` e funções relacionadas, as funções que retornam um estado inteiro geralmente retornam um valor positivo ou zero para sucesso e ``-1`` para falha, como chamadas de sistema Unix.

source: Finally, be careful to clean up garbage (by making :c:func:`Py_XDECREF` or :c:func:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
pt_pt: Finalmente, tenha cuidado em limpar o lixo (fazendo chamadas a :c:func:`Py_XDECREF` ou :c:func:`Py_DECREF` para objetos que já criou) quando retornar um indicador de erro!

source: The choice of which exception to raise is entirely yours. There are predeclared C objects corresponding to all built-in Python exceptions, such as :c:data:`PyExc_ZeroDivisionError`, which you can use directly. Of course, you should choose exceptions wisely --- don't use :c:data:`PyExc_TypeError` to mean that a file couldn't be opened (that should probably be :c:data:`PyExc_OSError`). If something's wrong with the argument list, the :c:func:`PyArg_ParseTuple` function usually raises :c:data:`PyExc_TypeError`. If you have an argument whose value must be in a particular range or must satisfy other conditions, :c:data:`PyExc_ValueError` is appropriate.
pt_pt: A escolha de qual exceção levantar é inteiramente sua. Existem objetos C pré-declarados correspondentes a todas as exceções integradas do Python, como :c:data:`PyExc_ZeroDivisionError`, que pode usar diretamente. Claro, deve escolher as exceções com sabedoria — não use :c:data:`PyExc_TypeError` para indicar que um ficheiro não pôde ser aberto (isso provavelmente deveria ser :c:data:`PyExc_OSError`). Se algo estiver errado com a lista de argumentos, a função :c:func:`PyArg_ParseTuple` geralmente levanta :c:data:`PyExc_TypeError`. Se tiver um argumento cujo valor deve estar dentro de um intervalo específico ou deve satisfazer outras condições, :c:data:`PyExc_ValueError` é apropriado.

source: Note that the Python name for the exception object is :exc:`!spam.error`. The :c:func:`PyErr_NewException` function may create a class with the base class being :exc:`Exception` (unless another class is passed in instead of ``NULL``), described in :ref:`bltin-exceptions`.
pt_pt: Note que o nome Python para o objeto de exceção é :exc:`!spam.error`. A função :c:func:`PyErr_NewException` pode criar uma classe com a classe base sendo :exc:`Exception` (a menos que outra classe seja passada em vez de ``NULL``), descrita em :ref:`bltin-exceptions`.

source: Note also that the :c:data:`!SpamError` variable retains a reference to the newly created exception class; this is intentional! Since the exception could be removed from the module by external code, an owned reference to the class is needed to ensure that it will not be discarded, causing :c:data:`!SpamError` to become a dangling pointer. Should it become a dangling pointer, C code which raises the exception could cause a core dump or other unintended side effects.
pt_pt: Note também que a variável :c:data:`!SpamError` retém uma referência à classe de exceção recém-criada; isto é intencional! Como a exceção pode ser removida do módulo por código externo, é necessária uma referência detida à classe para garantir que não seja descartada, fazendo com que :c:data:`!SpamError` se torne um ponteiro pendurado. Se se tornar um ponteiro pendurado, o código C que levanta a exceção pode causar um *core dump* ou outros efeitos secundários indesejados.

source: We discuss the use of :c:macro:`PyMODINIT_FUNC` as a function return type later in this sample.
pt_pt: Discutiremos o uso de :c:macro:`PyMODINIT_FUNC` como tipo de retorno de função mais adiante neste exemplo.

source: The :exc:`!spam.error` exception can be raised in your extension module using a call to :c:func:`PyErr_SetString` as shown below::
pt_pt: A exceção :exc:`!spam.error` pode ser levantada no seu módulo de extensão usando uma chamada a :c:func:`PyErr_SetString` como mostrado abaixo::

source: static PyObject * spam_system(PyObject *self, PyObject *args) { const char *command; int sts; if (!PyArg_ParseTuple(args, "s", &command)) return NULL; sts = system(command); if (sts < 0) { PyErr_SetString(SpamError, "System command failed"); return NULL; } return PyLong_FromLong(sts); }
pt_pt: static PyObject * spam_system(PyObject *self, PyObject *args) { const char *command; int sts; if (!PyArg_ParseTuple(args, "s", &command)) return NULL; sts = system(command); if (sts < 0) { PyErr_SetString(SpamError, "O comando do sistema falhou"); return NULL; } return PyLong_FromLong(sts); }

source: Back to the Example
pt_pt: De Volta ao Exemplo

source: Going back to our example function, you should now be able to understand this statement::
pt_pt: Voltando à nossa função de exemplo, agora deve ser capaz de entender esta instrução::

source: It returns ``NULL`` (the error indicator for functions returning object pointers) if an error is detected in the argument list, relying on the exception set by :c:func:`PyArg_ParseTuple`. Otherwise the string value of the argument has been copied to the local variable :c:data:`!command`. This is a pointer assignment and you are not supposed to modify the string to which it points (so in Standard C, the variable :c:data:`!command` should properly be declared as ``const char *command``).
pt_pt: Retorna ``NULL`` (o indicador de erro para funções que retornam ponteiros de objeto) se for detetado um erro na lista de argumentos, dependendo da exceção definida por :c:func:`PyArg_ParseTuple`. Caso contrário, o valor da *string* do argumento foi copiado para a variável local :c:data:`!command`. Isto é uma atribuição de ponteiro e não deve modificar a *string* para a qual aponta (por isso, em C padrão, a variável :c:data:`!command` deve ser devidamente declarada como ``const char *command``).

source: The next statement is a call to the Unix function :c:func:`system`, passing it the string we just got from :c:func:`PyArg_ParseTuple`::
pt_pt: A próxima instrução é uma chamada à função Unix :c:func:`system`, passando-lhe a *string* que acabámos de obter de :c:func:`PyArg_ParseTuple`::

source: Our :func:`!spam.system` function must return the value of :c:data:`!sts` as a Python object. This is done using the function :c:func:`PyLong_FromLong`. ::
pt_pt: A nossa função :func:`!spam.system` deve retornar o valor de :c:data:`!sts` como um objeto Python. Isto é feito usando a função :c:func:`PyLong_FromLong`. :

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
pt_pt: Neste caso, retornará um objeto inteiro. (Sim, até os inteiros são objetos no *heap* em Python!)

source: If you have a C function that returns no useful argument (a function returning :c:expr:`void`), the corresponding Python function must return ``None``. You need this idiom to do so (which is implemented by the :c:macro:`Py_RETURN_NONE` macro)::
pt_pt: Se tiver uma função C que não retorna nenhum argumento útil (uma função que retorna :c:expr:`void`), a função Python correspondente deve retornar ``None``. Precisa deste idioma para o fazer (que é implementado pela macro :c:macro:`Py_RETURN_NONE`)::

source: :c:data:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a ``NULL`` pointer, which means "error" in most contexts, as we have seen.
pt_pt: :c:data:`Py_None` é o nome C para o objeto especial do Python ``None``. É um objeto Python genuíno em vez de um ponteiro ``NULL``, que significa "erro" na maioria dos contextos, como vimos.

source: The Module's Method Table and Initialization Function
pt_pt: A Tabela de Métodos do Módulo e a Função de Inicialização
