Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: pt_pt

source: The *arg* and *format* parameters are identical to those of the :c:func:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a ``NULL``-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :c:func:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
pt_pt: Os parâmetros *arg* e *format* são idênticos aos da função :c:func:`PyArg_ParseTuple`. O parâmetro *kwdict* é o dicionário de palavras-chave recebido como o terceiro parâmetro do tempo de execução do Python. O parâmetro *kwlist* é uma lista terminada em ``NULL`` de *strings* que identificam os parâmetros; os nomes são combinados com as informações de tipo de *format* da esquerda para a direita. Em caso de sucesso, :c:func:`PyArg_ParseTupleAndKeywords` retorna verdadeiro, caso contrário retorna falso e levanta uma exceção apropriada.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
pt_pt: Tuplos aninhados não podem ser analisados ao usar argumentos de palavra-chave! Parâmetros de palavra-chave passados que não estão presentes na *kwlist* causarão o levantamento de :exc:`TypeError`.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
pt_pt: Aqui está um exemplo de módulo que usa palavras-chave, baseado num exemplo de Geoff Philbrick (philbrick@hks.com)::

source: Building Arbitrary Values
pt_pt: Construir Valores Arbitrários

source: This function is the counterpart to :c:func:`PyArg_ParseTuple`. It is declared as follows::
pt_pt: Esta função é a contraparte de :c:func:`PyArg_ParseTuple`. É declarada da seguinte forma::

source: It recognizes a set of format units similar to the ones recognized by :c:func:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
pt_pt: Reconhece um conjunto de unidades de formato semelhante às reconhecidas por :c:func:`PyArg_ParseTuple`, mas os argumentos (que são entrada para a função, não saída) não devem ser ponteiros, apenas valores. Retorna um novo objeto Python, adequado para retornar de uma função C chamada a partir do Python.

source: One difference with :c:func:`PyArg_ParseTuple`: while the latter requires its first argument to be a tuple (since Python argument lists are always represented as tuples internally), :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
pt_pt: Uma diferença em relação a :c:func:`PyArg_ParseTuple`: enquanto esta última exige que o seu primeiro argumento seja uma *tuple* (uma vez que as listas de argumentos Python são sempre representadas internamente como *tuples*), :c:func:`Py_BuildValue` não constrói sempre uma *tuple*. Constrói uma *tuple* apenas se a sua *string* de formato contiver duas ou mais unidades de formato. Se a *string* de formato estiver vazia, retorna ``None``; se contiver exatamente uma unidade de formato, retorna qualquer objeto descrito por essa unidade de formato. Para forçá-la a retornar uma *tuple* de tamanho 0 ou 1, coloque a *string* de formato entre parênteses.

source: Examples (to the left the call, to the right the resulting Python value):
pt_pt: Exemplos (à esquerda a chamada, à direita o valor Python resultante):

source: Reference Counts
pt_pt: Contagens de referência

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :c:func:`malloc` and :c:func:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
pt_pt: Em linguagens como C ou C++, o programador é responsável pela alocação e desalocação dinâmica de memória no *heap*. Em C, isto é feito usando as funções :c:func:`malloc` e :c:func:`free`. Em C++, os operadores ``new`` e ``delete`` são usados com essencialmente o mesmo significado, e vamos restringir a discussão seguinte ao caso C.

source: Every block of memory allocated with :c:func:`malloc` should eventually be returned to the pool of available memory by exactly one call to :c:func:`free`. It is important to call :c:func:`free` at the right time. If a block's address is forgotten but :c:func:`free` is not called for it, the memory it occupies cannot be reused until the program terminates. This is called a :dfn:`memory leak`. On the other hand, if a program calls :c:func:`free` for a block and then continues to use the block, it creates a conflict with reuse of the block through another :c:func:`malloc` call. This is called :dfn:`using freed memory`. It has the same bad consequences as referencing uninitialized data --- core dumps, wrong results, mysterious crashes.
pt_pt: Cada bloco de memória alocado com :c:func:`malloc` deve eventualmente ser devolvido ao conjunto de memória disponível por exatamente uma chamada a :c:func:`free`. É importante chamar :c:func:`free` na altura certa. Se o endereço de um bloco for esquecido, mas :c:func:`free` não for chamado para ele, a memória que ocupa não pode ser reutilizada até que o programa termine. Isto é chamado de :dfn:`fuga de memória`. Por outro lado, se um programa chamar :c:func:`free` para um bloco e depois continuar a usar o bloco, cria um conflito com a reutilização do bloco através de outra chamada a :c:func:`malloc`. Isto é chamado de :dfn:`uso de memória libertada`. Tem as mesmas más consequências que referenciar dados não inicializados — *core dumps*, resultados errados, falhas misteriosas.

source: Common causes of memory leaks are unusual paths through the code. For instance, a function may allocate a block of memory, do some calculation, and then free the block again. Now a change in the requirements for the function may add a test to the calculation that detects an error condition and can return prematurely from the function. It's easy to forget to free the allocated memory block when taking this premature exit, especially when it is added later to the code. Such leaks, once introduced, often go undetected for a long time: the error exit is taken only in a small fraction of all calls, and most modern machines have plenty of virtual memory, so the leak only becomes apparent in a long-running process that uses the leaking function frequently. Therefore, it's important to prevent leaks from happening by having a coding convention or strategy that minimizes this kind of errors.
pt_pt: Causas comuns de fugas de memória são caminhos incomuns através do código. Por exemplo, uma função pode alocar um bloco de memória, fazer alguns cálculos e depois libertar o bloco novamente. Agora, uma mudança nos requisitos da função pode adicionar um teste ao cálculo que deteta uma condição de erro e pode retornar prematuramente da função. É fácil esquecer de libertar o bloco de memória alocado ao tomar esta saída prematura, especialmente quando é adicionado mais tarde ao código. Tais fugas, uma vez introduzidas, muitas vezes passam despercebidas durante muito tempo: a saída de erro é tomada apenas numa pequena fração de todas as chamadas, e a maioria das máquinas modernas tem muita memória virtual, por isso a fuga só se torna aparente num processo de longa duração que usa a função com fuga com frequência. Portanto, é importante prevenir fugas de acontecerem, tendo uma convenção ou estratégia de codificação que minimize este tipo de erros.

source: Since Python makes heavy use of :c:func:`malloc` and :c:func:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
pt_pt: Como o Python faz uso intensivo de :c:func:`malloc` e :c:func:`free`, precisa de uma estratégia para evitar fugas de memória, bem como o uso de memória libertada. O método escolhido é chamado de :dfn:`contagem de referências`. O princípio é simples: cada objeto contém um contador, que é incrementado quando uma referência ao objeto é armazenada em algum lugar, e que é decrementado quando uma referência a ele é eliminada. Quando o contador atinge zero, a última referência ao objeto foi eliminada e o objeto é libertado.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :c:func:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :c:func:`malloc` and :c:func:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
pt_pt: Uma estratégia alternativa é chamada de :dfn:`recolha automática de lixo`. (Às vezes, a contagem de referências também é referida como uma estratégia de recolha de lixo, daí o meu uso de "automática" para distinguir as duas.) A grande vantagem da recolha automática de lixo é que o utilizador não precisa de chamar :c:func:`free` explicitamente. (Outra vantagem alegada é uma melhoria na velocidade ou uso de memória — isto não é um facto concreto, no entanto.) A desvantagem é que, para C, não existe um recolhedor automático de lixo verdadeiramente portátil, enquanto a contagem de referências pode ser implementada de forma portátil (desde que as funções :c:func:`malloc` e :c:func:`free` estejam disponíveis — o que a norma C garante). Talvez um dia um recolhedor automático de lixo suficientemente portátil esteja disponível para C. Até lá, teremos de conviver com contagens de referências.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
pt_pt: Embora o Python utilize a implementação tradicional de contagem de referências, também oferece um detetor de ciclos que funciona para detetar ciclos de referência. Isto permite que as aplicações não se preocupem em criar referências circulares diretas ou indiretas; estas são a fraqueza da recolha de lixo implementada usando apenas contagem de referências. Os ciclos de referência consistem em objetos que contêm (possivelmente indiretas) referências a si mesmos, de modo que cada objeto no ciclo tem uma contagem de referências diferente de zero. As implementações típicas de contagem de referências não são capazes de recuperar a memória pertencente a quaisquer objetos num ciclo de referência, ou referenciados a partir dos objetos no ciclo, mesmo que não haja mais referências ao próprio ciclo.

source: The cycle detector is able to detect garbage cycles and can reclaim them. The :mod:`gc` module exposes a way to run the detector (the :func:`~gc.collect` function), as well as configuration interfaces and the ability to disable the detector at runtime.
pt_pt: O detetor de ciclos é capaz de detetar ciclos de lixo e pode recuperá-los. O módulo :mod:`gc` expõe uma forma de executar o detetor (a função :func:`~gc.collect`), bem como interfaces de configuração e a capacidade de desativar o detetor em tempo de execução.

source: Reference Counting in Python
pt_pt: Contagem de Referências em Python

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :c:func:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :c:func:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
pt_pt: Existem duas macros, ``Py_INCREF(x)`` e ``Py_DECREF(x)``, que tratam do incremento e decremento da contagem de referências. :c:func:`Py_DECREF` também liberta o objeto quando a contagem atinge zero. Para flexibilidade, não chama :c:func:`free` diretamente — em vez disso, faz uma chamada através de um ponteiro de função no :dfn:`objeto de tipo` do objeto. Para este propósito (e outros), cada objeto também contém um ponteiro para o seu objeto de tipo.

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :c:func:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :c:func:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
pt_pt: A grande questão agora é: quando usar ``Py_INCREF(x)`` e ``Py_DECREF(x)``? Vamos primeiro introduzir alguns termos. Ninguém "possui" um objeto; no entanto, pode :dfn:`possuir uma referência` a um objeto. A contagem de referências de um objeto é agora definida como o número de referências possuídas a ele. O possuidor de uma referência é responsável por chamar :c:func:`Py_DECREF` quando a referência já não for necessária. A posse de uma referência pode ser transferida. Existem três maneiras de descartar uma referência possuída: passá-la, armazená-la ou chamar :c:func:`Py_DECREF`. Esquecer-se de descartar uma referência possuída cria uma fuga de memória.

source: It is also possible to :dfn:`borrow` [#]_ a reference to an object. The borrower of a reference should not call :c:func:`Py_DECREF`. The borrower must not hold on to the object longer than the owner from which it was borrowed. Using a borrowed reference after the owner has disposed of it risks using freed memory and should be avoided completely [#]_.
pt_pt: Também é possível :dfn:`emprestar` [#]_ uma referência a um objeto. O emprestador de uma referência não deve chamar :c:func:`Py_DECREF`. O emprestador não deve reter o objeto por mais tempo do que o proprietário de quem foi emprestado. Usar uma referência emprestada depois que o proprietário a descartou arrisca usar memória libertada e deve ser completamente evitado [#]_.

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
pt_pt: A vantagem de emprestar em vez de possuir uma referência é que não precisa de se preocupar em descartar a referência em todos os caminhos possíveis através do código — em outras palavras, com uma referência emprestada, não corre o risco de vazamento quando uma saída prematura é tomada. A desvantagem de emprestar em vez de possuir é que existem algumas situações subtis em que, em código aparentemente correto, uma referência emprestada pode ser usada depois que o proprietário de quem foi emprestada a descartou.

source: A borrowed reference can be changed into an owned reference by calling :c:func:`Py_INCREF`. This does not affect the status of the owner from which the reference was borrowed --- it creates a new owned reference, and gives full owner responsibilities (the new owner must dispose of the reference properly, as well as the previous owner).
pt_pt: Uma referência emprestada pode ser transformada numa referência possuída chamando :c:func:`Py_INCREF`. Isto não afeta o estado do proprietário de quem a referência foi emprestada — cria uma nova referência possuída e dá responsabilidades completas de proprietário (o novo proprietário deve descartar a referência adequadamente, assim como o proprietário anterior).

source: Ownership Rules
pt_pt: Regras de Propriedade

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
pt_pt: Sempre que uma referência a um objeto é passada para dentro ou para fora de uma função, faz parte da especificação da interface da função se a propriedade é transferida com a referência ou não.

source: Most functions that return a reference to an object pass on ownership with the reference. In particular, all functions whose function it is to create a new object, such as :c:func:`PyLong_FromLong` and :c:func:`Py_BuildValue`, pass ownership to the receiver. Even if the object is not actually new, you still receive ownership of a new reference to that object. For instance, :c:func:`PyLong_FromLong` maintains a cache of popular values and can return a reference to a cached item.
pt_pt: A maioria das funções que retornam uma referência a um objeto passam a propriedade com a referência. Em particular, todas as funções cuja função é criar um novo objeto, como :c:func:`PyLong_FromLong` e :c:func:`Py_BuildValue`, passam a propriedade ao recetor. Mesmo que o objeto não seja realmente novo, ainda recebe a propriedade de uma nova referência a esse objeto. Por exemplo, :c:func:`PyLong_FromLong` mantém uma cache de valores populares e pode retornar uma referência a um item em cache.

source: Many functions that extract objects from other objects also transfer ownership with the reference, for instance :c:func:`PyObject_GetAttrString`. The picture is less clear, here, however, since a few common routines are exceptions: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, and :c:func:`PyDict_GetItemString` all return references that you borrow from the tuple, list or dictionary.
pt_pt: Muitas funções que extraem objetos de outros objetos também transferem a propriedade com a referência, por exemplo :c:func:`PyObject_GetAttrString`. A imagem aqui é menos clara, no entanto, uma vez que algumas rotinas comuns são exceções: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem` e :c:func:`PyDict_GetItemString` retornam todas referências que empresta da *tuple*, lista ou dicionário.

source: The function :c:func:`PyImport_AddModule` also returns a borrowed reference, even though it may actually create the object it returns: this is possible because an owned reference to the object is stored in ``sys.modules``.
pt_pt: A função :c:func:`PyImport_AddModule` também retorna uma referência emprestada, mesmo que possa realmente criar o objeto que retorna: isto é possível porque uma referência possuída ao objeto é armazenada em ``sys.modules``.

source: When you pass an object reference into another function, in general, the function borrows the reference from you --- if it needs to store it, it will use :c:func:`Py_INCREF` to become an independent owner. There are exactly two important exceptions to this rule: :c:func:`PyTuple_SetItem` and :c:func:`PyList_SetItem`. These functions take over ownership of the item passed to them --- even if they fail! (Note that :c:func:`PyDict_SetItem` and friends don't take over ownership --- they are "normal.")
pt_pt: Quando passa uma referência a um objeto para outra função, em geral, a função empresta a referência de si — se precisar de a armazenar, usará :c:func:`Py_INCREF` para se tornar um proprietário independente. Existem exatamente duas exceções importantes a esta regra: :c:func:`PyTuple_SetItem` e :c:func:`PyList_SetItem`. Estas funções assumem a propriedade do item passado a elas — mesmo que falhem! (Note que :c:func:`PyDict_SetItem` e similares não assumem a propriedade — são "normais".)

source: When a C function is called from Python, it borrows references to its arguments from the caller. The caller owns a reference to the object, so the borrowed reference's lifetime is guaranteed until the function returns. Only when such a borrowed reference must be stored or passed on, it must be turned into an owned reference by calling :c:func:`Py_INCREF`.
pt_pt: Quando uma função C é chamada a partir do Python, ela empresta referências aos seus argumentos do chamador. O chamador possui uma referência ao objeto, por isso a vida útil da referência emprestada é garantida até que a função retorne. Apenas quando tal referência emprestada deve ser armazenada ou passada adiante, deve ser transformada numa referência possuída chamando :c:func:`Py_INCREF`.

source: The object reference returned from a C function that is called from Python must be an owned reference --- ownership is transferred from the function to its caller.
pt_pt: A referência ao objeto retornada de uma função C que é chamada a partir do Python deve ser uma referência possuída — a propriedade é transferida da função para o seu chamador.

source: Thin Ice
pt_pt: Gelo Fino

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
pt_pt: Existem algumas situações em que o uso aparentemente inofensivo de uma referência emprestada pode levar a problemas. Todas têm a ver com invocações implícitas do interpretador, que podem fazer com que o proprietário de uma referência a descarte.

source: The first and most important case to know about is using :c:func:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
pt_pt: O primeiro e mais importante caso a conhecer é o uso de :c:func:`Py_DECREF` num objeto não relacionado enquanto empresta uma referência a um item de lista. Por exemplo::

source: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(item, stdout, 0); /* BUG! */ }
pt_pt: void bug(PyObject *list) { PyObject *item = PyList_GetItem(list, 0); PyList_SetItem(list, 1, PyLong_FromLong(0L)); PyObject_Print(item, stdout, 0); /* ERRO! */ }
