Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: pt_pt

source: I promised to show how :c:func:`!spam_system` is called from Python programs. First, we need to list its name and address in a "method table"::
pt_pt: Prometi mostrar como :c:func:`!spam_system` é chamada a partir de programas Python. Primeiro, precisamos de listar o seu nome e endereço numa "tabela de métodos"::

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :c:func:`PyArg_ParseTuple` is used.
pt_pt: Note a terceira entrada (``METH_VARARGS``). Isto é uma *flag* que indica ao interpretador a convenção de chamada a ser usada para a função C. Deve ser normalmente sempre ``METH_VARARGS`` ou ``METH_VARARGS | METH_KEYWORDS``; um valor de ``0`` significa que uma variante obsoleta de :c:func:`PyArg_ParseTuple` é usada.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :c:func:`PyArg_ParseTuple`; more information on this function is provided below.
pt_pt: Ao usar apenas ``METH_VARARGS``, a função deve esperar que os parâmetros ao nível do Python sejam passados como uma *tuple* aceitável para análise via :c:func:`PyArg_ParseTuple`; mais informações sobre esta função são fornecidas abaixo.

source: The :c:macro:`METH_KEYWORDS` bit may be set in the third field if keyword arguments should be passed to the function. In this case, the C function should accept a third ``PyObject *`` parameter which will be a dictionary of keywords. Use :c:func:`PyArg_ParseTupleAndKeywords` to parse the arguments to such a function.
pt_pt: O bit :c:macro:`METH_KEYWORDS` pode ser definido no terceiro campo se argumentos de palavra-chave devem ser passados para a função. Neste caso, a função C deve aceitar um terceiro parâmetro ``PyObject *`` que será um dicionário de palavras-chave. Use :c:func:`PyArg_ParseTupleAndKeywords` para analisar os argumentos para tal função.

source: The method table must be referenced in the module definition structure::
pt_pt: A tabela de métodos deve ser referenciada na estrutura de definição do módulo::

source: This structure, in turn, must be passed to the interpreter in the module's initialization function. The initialization function must be named :c:func:`!PyInit_name`, where *name* is the name of the module, and should be the only non-\ ``static`` item defined in the module file::
pt_pt: Esta estrutura, por sua vez, deve ser passada ao interpretador na função de inicialização do módulo. A função de inicialização deve ser chamada :c:func:`!PyInit_name`, onde *name* é o nome do módulo, e deve ser o único item não-\ ``static`` definido no ficheiro do módulo::

source: Note that :c:macro:`PyMODINIT_FUNC` declares the function as ``PyObject *`` return type, declares any special linkage declarations required by the platform, and for C++ declares the function as ``extern "C"``.
pt_pt: Note que :c:macro:`PyMODINIT_FUNC` declara a função como tipo de retorno ``PyObject *``, declara quaisquer declarações de ligação especiais exigidas pela plataforma e, para C++, declara a função como ``extern "C"``.

source: When embedding Python, the :c:func:`!PyInit_spam` function is not called automatically unless there's an entry in the :c:data:`PyImport_Inittab` table. To add the module to the initialization table, use :c:func:`PyImport_AppendInittab`, optionally followed by an import of the module::
pt_pt: Ao incorporar o Python, a função :c:func:`!PyInit_spam` não é chamada automaticamente a menos que exista uma entrada na tabela :c:data:`PyImport_Inittab`. Para adicionar o módulo à tabela de inicialização, use :c:func:`PyImport_AppendInittab`, opcionalmente seguido de uma importação do módulo::

source: Compilation and Linkage
pt_pt: Compilação e Ligação

source: There are two more things to do before you can use your new extension: compiling and linking it with the Python system. If you use dynamic loading, the details may depend on the style of dynamic loading your system uses; see the chapters about building extension modules (chapter :ref:`building`) and additional information that pertains only to building on Windows (chapter :ref:`building-on-windows`) for more information about this.
pt_pt: Existem mais duas coisas a fazer antes de poder usar a sua nova extensão: compilá-la e ligá-la ao sistema Python. Se usar carregamento dinâmico, os detalhes podem depender do estilo de carregamento dinâmico que o seu sistema usa; consulte os capítulos sobre a construção de módulos de extensão (capítulo :ref:`building`) e informações adicionais que se aplicam apenas à construção no Windows (capítulo :ref:`building-on-windows`) para mais informações sobre isto.

source: If you can't use dynamic loading, or if you want to make your module a permanent part of the Python interpreter, you will have to change the configuration setup and rebuild the interpreter. Luckily, this is very simple on Unix: just place your file (:file:`spammodule.c` for example) in the :file:`Modules/` directory of an unpacked source distribution, add a line to the file :file:`Modules/Setup.local` describing your file:
pt_pt: Se não puder usar carregamento dinâmico, ou se quiser tornar o seu módulo uma parte permanente do interpretador Python, terá de alterar a configuração e recompilar o interpretador. Felizmente, isto é muito simples em Unix: basta colocar o seu ficheiro (por exemplo, :file:`spammodule.c`) no diretório :file:`Modules/` de uma distribuição de código-fonte descompactada e adicionar uma linha ao ficheiro :file:`Modules/Setup.local` descrevendo o seu ficheiro:

source: and rebuild the interpreter by running :program:`make` in the toplevel directory. You can also run :program:`make` in the :file:`Modules/` subdirectory, but then you must first rebuild :file:`Makefile` there by running ':program:`make` Makefile'. (This is necessary each time you change the :file:`Setup` file.)
pt_pt: e recompile o interpretador executando :program:`make` no diretório de nível superior. Também pode executar :program:`make` no subdiretório :file:`Modules/`, mas então deve primeiro recompilar :file:`Makefile` lá executando ':program:`make` Makefile'. (Isto é necessário cada vez que alterar o ficheiro :file:`Setup`.)

source: If your module requires additional libraries to link with, these can be listed on the line in the configuration file as well, for instance:
pt_pt: Se o seu módulo necessitar de bibliotecas adicionais para ligação, estas também podem ser listadas na linha do ficheiro de configuração, por exemplo:

source: Calling Python Functions from C
pt_pt: Chamar Funções Python a partir de C

source: Fortunately, the Python interpreter is easily called recursively, and there is a standard interface to call a Python function. (I won't dwell on how to call the Python parser with a particular string as input --- if you're interested, have a look at the implementation of the :option:`-c` command line option in :file:`Modules/main.c` from the Python source code.)
pt_pt: Felizmente, o interpretador Python pode ser facilmente chamado de forma recursiva, e existe uma interface padrão para chamar uma função Python. (Não vou aprofundar como chamar o *parser* do Python com uma *string* específica como entrada — se estiver interessado, dê uma olhada na implementação da opção de linha de comando :option:`-c` em :file:`Modules/main.c` a partir do código-fonte do Python.)

source: Calling a Python function is easy. First, the Python program must somehow pass you the Python function object. You should provide a function (or some other interface) to do this. When this function is called, save a pointer to the Python function object (be careful to :c:func:`Py_INCREF` it!) in a global variable --- or wherever you see fit. For example, the following function might be part of a module definition::
pt_pt: Chamar uma função Python é fácil. Primeiro, o programa Python deve, de alguma forma, passar-lhe o objeto da função Python. Deve fornecer uma função (ou outra interface) para fazer isto. Quando esta função é chamada, guarde um ponteiro para o objeto da função Python (tenha cuidado para chamar :c:func:`Py_INCREF`!) numa variável global — ou onde achar apropriado. Por exemplo, a seguinte função pode fazer parte de uma definição de módulo::

source: static PyObject *my_callback = NULL; static PyObject * my_set_callback(PyObject *dummy, PyObject *args) { PyObject *result = NULL; PyObject *temp; if (PyArg_ParseTuple(args, "O:set_callback", &temp)) { if (!PyCallable_Check(temp)) { PyErr_SetString(PyExc_TypeError, "parameter must be callable"); return NULL; } Py_XINCREF(temp); /* Add a reference to new callback */ Py_XDECREF(my_callback); /* Dispose of previous callback */ my_callback = temp; /* Remember new callback */ /* Boilerplate to return "None" */ Py_INCREF(Py_None); result = Py_None; } return result; }
pt_pt: static PyObject *my_callback = NULL; static PyObject * my_set_callback(PyObject *dummy, PyObject *args) { PyObject *result = NULL; PyObject *temp; if (PyArg_ParseTuple(args, "O:set_callback", &temp)) { if (!PyCallable_Check(temp)) { PyErr_SetString(PyExc_TypeError, "o parâmetro deve ser chamável"); return NULL; } Py_XINCREF(temp); /* Adiciona uma referência à nova retrochamada */ Py_XDECREF(my_callback); /* Descarta a retrochamada anterior */ my_callback = temp; /* Lembra a nova retrochamada */ /* Código padrão para retornar "None" */ Py_INCREF(Py_None); result = Py_None; } return result; }

source: This function must be registered with the interpreter using the :c:macro:`METH_VARARGS` flag; this is described in section :ref:`methodtable`. The :c:func:`PyArg_ParseTuple` function and its arguments are documented in section :ref:`parsetuple`.
pt_pt: Esta função deve ser registada no interpretador usando a *flag* :c:macro:`METH_VARARGS`; isto é descrito na secção :ref:`methodtable`. A função :c:func:`PyArg_ParseTuple` e os seus argumentos estão documentados na secção :ref:`parsetuple`.

source: The macros :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of ``NULL`` pointers (but note that *temp* will not be ``NULL`` in this context). More info on them in section :ref:`refcounts`.
pt_pt: As macros :c:func:`Py_XINCREF` e :c:func:`Py_XDECREF` incrementam/decrementam a contagem de referências de um objeto e são seguras na presença de ponteiros ``NULL`` (mas note que *temp* não será ``NULL`` neste contexto). Mais informações sobre elas na secção :ref:`refcounts`.

source: Later, when it is time to call the function, you call the C function :c:func:`PyObject_CallObject`. This function has two arguments, both pointers to arbitrary Python objects: the Python function, and the argument list. The argument list must always be a tuple object, whose length is the number of arguments. To call the Python function with no arguments, pass in ``NULL``, or an empty tuple; to call it with one argument, pass a singleton tuple. :c:func:`Py_BuildValue` returns a tuple when its format string consists of zero or more format codes between parentheses. For example::
pt_pt: Mais tarde, quando for altura de chamar a função, chama a função C :c:func:`PyObject_CallObject`. Esta função tem dois argumentos, ambos ponteiros para objetos Python arbitrários: a função Python e a lista de argumentos. A lista de argumentos deve ser sempre um objeto *tuple*, cujo comprimento é o número de argumentos. Para chamar a função Python sem argumentos, passe ``NULL`` ou uma *tuple* vazia; para chamá-la com um argumento, passe uma *tuple* com um único elemento. :c:func:`Py_BuildValue` retorna uma *tuple* quando a sua *string* de formato consiste em zero ou mais códigos de formato entre parênteses. Por exemplo::

source: int arg; PyObject *arglist; PyObject *result; ... arg = 123; ... /* Time to call the callback */ arglist = Py_BuildValue("(i)", arg); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist);
pt_pt: int arg; PyObject *arglist; PyObject *result; ... arg = 123; ... /* Hora de chamar a retrochamada */ arglist = Py_BuildValue("(i)", arg); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist);

source: :c:func:`PyObject_CallObject` returns a Python object pointer: this is the return value of the Python function. :c:func:`PyObject_CallObject` is "reference-count-neutral" with respect to its arguments. In the example a new tuple was created to serve as the argument list, which is :c:func:`Py_DECREF`\ -ed immediately after the :c:func:`PyObject_CallObject` call.
pt_pt: :c:func:`PyObject_CallObject` retorna um ponteiro para um objeto Python: este é o valor de retorno da função Python. :c:func:`PyObject_CallObject` é "neutro em relação à contagem de referências" em relação aos seus argumentos. No exemplo, uma nova *tuple* foi criada para servir como lista de argumentos, que é :c:func:`Py_DECREF` imediatamente após a chamada a :c:func:`PyObject_CallObject`.

source: The return value of :c:func:`PyObject_CallObject` is "new": either it is a brand new object, or it is an existing object whose reference count has been incremented. So, unless you want to save it in a global variable, you should somehow :c:func:`Py_DECREF` the result, even (especially!) if you are not interested in its value.
pt_pt: O valor de retorno de :c:func:`PyObject_CallObject` é "novo": ou é um objeto completamente novo, ou é um objeto existente cuja contagem de referências foi incrementada. Portanto, a menos que queira guardá-lo numa variável global, deve de alguma forma chamar :c:func:`Py_DECREF` no resultado, mesmo (especialmente!) se não estiver interessado no seu valor.

source: Before you do this, however, it is important to check that the return value isn't ``NULL``. If it is, the Python function terminated by raising an exception. If the C code that called :c:func:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :c:func:`PyErr_Clear`. For example::
pt_pt: Antes de fazer isto, no entanto, é importante verificar se o valor de retorno não é ``NULL``. Se for, a função Python terminou levantando uma exceção. Se o código C que chamou :c:func:`PyObject_CallObject` for chamado a partir de Python, deve agora retornar uma indicação de erro ao seu chamador Python, para que o interpretador possa imprimir um rastreio de pilha, ou o código Python chamador possa tratar a exceção. Se isto não for possível ou desejável, a exceção deve ser limpa chamando :c:func:`PyErr_Clear`. Por exemplo::

source: if (result == NULL) return NULL; /* Pass error back */ ...use result... Py_DECREF(result);
pt_pt: if (result == NULL) return NULL; /* Passar erro de volta */ ...usar result... Py_DECREF(result);

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :c:func:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :c:func:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
pt_pt: Dependendo da interface desejada para a função de retrochamada Python, também pode ter de fornecer uma lista de argumentos a :c:func:`PyObject_CallObject`. Em alguns casos, a lista de argumentos também é fornecida pelo programa Python, através da mesma interface que especificou a função de retrochamada. Pode então ser guardada e usada da mesma forma que o objeto da função. Noutros casos, pode ter de construir uma nova *tuple* para passar como lista de argumentos. A forma mais simples de fazer isto é chamar :c:func:`Py_BuildValue`. Por exemplo, se quiser passar um código de evento inteiro, pode usar o seguinte código::

source: PyObject *arglist; ... arglist = Py_BuildValue("(l)", eventcode); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist); if (result == NULL) return NULL; /* Pass error back */ /* Here maybe use the result */ Py_DECREF(result);
pt_pt: PyObject *arglist; ... arglist = Py_BuildValue("(l)", eventcode); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist); if (result == NULL) return NULL; /* Passar erro de volta */ /* Aqui talvez usar o resultado */ Py_DECREF(result);

source: Note the placement of ``Py_DECREF(arglist)`` immediately after the call, before the error check! Also note that strictly speaking this code is not complete: :c:func:`Py_BuildValue` may run out of memory, and this should be checked.
pt_pt: Note a colocação de ``Py_DECREF(arglist)`` imediatamente após a chamada, antes da verificação de erro! Note também que, estritamente falando, este código não está completo: :c:func:`Py_BuildValue` pode ficar sem memória, e isto deve ser verificado.

source: You may also call a function with keyword arguments by using :c:func:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :c:func:`Py_BuildValue` to construct the dictionary. ::
pt_pt: Também pode chamar uma função com argumentos de palavra-chave usando :c:func:`PyObject_Call`, que suporta argumentos e argumentos de palavra-chave. Como no exemplo acima, usamos :c:func:`Py_BuildValue` para construir o dicionário. ::

source: PyObject *dict; ... dict = Py_BuildValue("{s:i}", "name", val); result = PyObject_Call(my_callback, NULL, dict); Py_DECREF(dict); if (result == NULL) return NULL; /* Pass error back */ /* Here maybe use the result */ Py_DECREF(result);
pt_pt: PyObject *dict; ... dict = Py_BuildValue("{s:i}", "name", val); result = PyObject_Call(my_callback, NULL, dict); Py_DECREF(dict); if (result == NULL) return NULL; /* Passar erro de volta */ /* Aqui talvez usar o resultado */ Py_DECREF(result);

source: Extracting Parameters in Extension Functions
pt_pt: Extrair Parâmetros em Funções de Extensão

source: The :c:func:`PyArg_ParseTuple` function is declared as follows::
pt_pt: A função :c:func:`PyArg_ParseTuple` é declarada da seguinte forma::

source: The *arg* argument must be a tuple object containing an argument list passed from Python to a C function. The *format* argument must be a format string, whose syntax is explained in :ref:`arg-parsing` in the Python/C API Reference Manual. The remaining arguments must be addresses of variables whose type is determined by the format string.
pt_pt: O argumento *arg* deve ser um objeto *tuple* contendo uma lista de argumentos passada do Python para uma função C. O argumento *format* deve ser uma *string* de formato, cuja sintaxe é explicada em :ref:`arg-parsing` no Manual de Referência da API Python/C. Os argumentos restantes devem ser endereços de variáveis cujos tipos são determinados pela *string* de formato.

source: Note that while :c:func:`PyArg_ParseTuple` checks that the Python arguments have the required types, it cannot check the validity of the addresses of C variables passed to the call: if you make mistakes there, your code will probably crash or at least overwrite random bits in memory. So be careful!
pt_pt: Note que, embora :c:func:`PyArg_ParseTuple` verifique se os argumentos Python têm os tipos necessários, não pode verificar a validade dos endereços das variáveis C passadas para a chamada: se cometer erros aí, o seu código provavelmente irá falhar ou, pelo menos, sobrescrever bits aleatórios na memória. Portanto, tenha cuidado!

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
pt_pt: Note que quaisquer referências a objetos Python que são fornecidas ao chamador são referências *emprestadas*; não decremente a sua contagem de referências!

source: Some example calls::
pt_pt: Algumas chamadas de exemplo::

source: int ok; int i, j; long k, l; const char *s; Py_ssize_t size; ok = PyArg_ParseTuple(args, ""); /* No arguments */ /* Python call: f() */
pt_pt: int ok; int i, j; long k, l; const char *s; Py_ssize_t size; ok = PyArg_ParseTuple(args, ""); /* Sem argumentos */ /* Chamada Python: f() */

source: ok = PyArg_ParseTuple(args, "s", &s); /* A string */ /* Possible Python call: f('whoops!') */
pt_pt: ok = PyArg_ParseTuple(args, "s", &s); /* Uma string */ /* Possível chamada Python: f('whoops!') */

source: ok = PyArg_ParseTuple(args, "lls", &k, &l, &s); /* Two longs and a string */ /* Possible Python call: f(1, 2, 'three') */
pt_pt: ok = PyArg_ParseTuple(args, "lls", &k, &l, &s); /* Dois longos e uma string */ /* Possível chamada Python: f(1, 2, 'three') */

source: ok = PyArg_ParseTuple(args, "(ii)s#", &i, &j, &s, &size); /* A pair of ints and a string, whose size is also returned */ /* Possible Python call: f((1, 2), 'three') */
pt_pt: ok = PyArg_ParseTuple(args, "(ii)s#", &i, &j, &s, &size); /* Um par de inteiros e uma string, cujo tamanho também é retornado */ /* Possível chamada Python: f((1, 2), 'three') */

source: { const char *file; const char *mode = "r"; int bufsize = 0; ok = PyArg_ParseTuple(args, "s|si", &file, &mode, &bufsize); /* A string, and optionally another string and an integer */ /* Possible Python calls: f('spam') f('spam', 'w') f('spam', 'wb', 100000) */ }
pt_pt: { const char *file; const char *mode = "r"; int bufsize = 0; ok = PyArg_ParseTuple(args, "s|si", &file, &mode, &bufsize); /* Uma string, e opcionalmente outra string e um inteiro */ /* Possíveis chamadas Python: f('spam') f('spam', 'w') f('spam', 'wb', 100000) */ }

source: { int left, top, right, bottom, h, v; ok = PyArg_ParseTuple(args, "((ii)(ii))(ii)", &left, &top, &right, &bottom, &h, &v); /* A rectangle and a point */ /* Possible Python call: f(((0, 0), (400, 300)), (10, 10)) */ }
pt_pt: { int left, top, right, bottom, h, v; ok = PyArg_ParseTuple(args, "((ii)(ii))(ii)", &left, &top, &right, &bottom, &h, &v); /* Um retângulo e um ponto */ /* Possível chamada Python: f(((0, 0), (400, 300)), (10, 10)) */ }

source: { Py_complex c; ok = PyArg_ParseTuple(args, "D:myfunction", &c); /* a complex, also providing a function name for errors */ /* Possible Python call: myfunction(1+2j) */ }
pt_pt: { Py_complex c; ok = PyArg_ParseTuple(args, "D:myfunction", &c); /* um número complexo, também fornecendo um nome de função para erros */ /* Possível chamada Python: myfunction(1+2j) */ }

source: Keyword Parameters for Extension Functions
pt_pt: Parâmetros de Palavra-Chave para Funções de Extensão

source: The :c:func:`PyArg_ParseTupleAndKeywords` function is declared as follows::
pt_pt: A função :c:func:`PyArg_ParseTupleAndKeywords` é declarada da seguinte forma::
