Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/newtypes_tutorial.po
Languages: es_es, pt_pt

source: In this example, we create a list that contains itself. When we delete it, it still has a reference from itself. Its reference count doesn't drop to zero. Fortunately, Python's cyclic garbage collector will eventually figure out that the list is garbage and free it.
es_es: En este ejemplo, creamos una lista que se contiene a sí misma. Cuando la borramos, sigue teniendo una referencia a sí misma. Su número de referencias no cae a cero. Afortunadamente, el recolector de basura cíclico de Python se dará cuenta de que la lista es basura y la liberará.

source: In the second version of the :class:`Custom` example, we allowed any kind of object to be stored in the :attr:`first` or :attr:`last` attributes [#]_. Besides, in the second and third versions, we allowed subclassing :class:`Custom`, and subclasses may add arbitrary attributes. For any of those two reasons, :class:`Custom` objects can participate in cycles:
es_es: En la segunda versión del ejemplo :class:`Custom`, permitimos almacenar cualquier tipo de objeto en los atributos :attr:`first` o :attr:`last` [#]_. Además, en la segunda y tercera versiones, permitimos subclasificar :class:`Custom`, y las subclases pueden añadir atributos arbitrarios. Por cualquiera de esas dos razones, los objetos :class:`Custom` pueden participar en ciclos:

source: To allow a :class:`Custom` instance participating in a reference cycle to be properly detected and collected by the cyclic GC, our :class:`Custom` type needs to fill two additional slots and to enable a flag that enables these slots:
es_es: Para permitir que una instancia de :class:`Custom` que participa en un ciclo de referencia sea correctamente detectada y recogida por la GC cíclica, nuestro tipo :class:`Custom` necesita llenar dos ranuras adicionales y habilitar una bandera que habilite estas ranuras:

source: First, the traversal method lets the cyclic GC know about subobjects that could participate in cycles::
es_es: En primer lugar, el método transversal permite a la GC cíclica conocer los subobjetos que podrían participar en ciclos::

source: For each subobject that can participate in cycles, we need to call the :c:func:`visit` function, which is passed to the traversal method. The :c:func:`visit` function takes as arguments the subobject and the extra argument *arg* passed to the traversal method. It returns an integer value that must be returned if it is non-zero.
es_es: Para cada subobjeto que pueda participar en ciclos, necesitamos llamar a la función :c:func:`visit`, que se pasa al método traversal. La función :c:func:`visit` toma como argumentos el subobjeto y el argumento extra *arg* pasado al método transversal. Devuelve un valor entero que debe ser devuelto si es distinto de cero.

source: Python provides a :c:func:`Py_VISIT` macro that automates calling visit functions. With :c:func:`Py_VISIT`, we can minimize the amount of boilerplate in ``Custom_traverse``::
es_es: Python proporciona una macro :c:func:`Py_VISIT` que automatiza la llamada a funciones de visita. Con :c:func:`Py_VISIT`, podemos minimizar la cantidad de repetición en ``Custom_traverse``::

source: The :c:member:`~PyTypeObject.tp_traverse` implementation must name its arguments exactly *visit* and *arg* in order to use :c:func:`Py_VISIT`.
es_es: La implementación de :c:member:`~PyTypeObject.tp_traverse` debe nombrar sus argumentos exactamente *visit* y *arg* para poder utilizar :c:func:`Py_VISIT`.

source: Second, we need to provide a method for clearing any subobjects that can participate in cycles::
es_es: En segundo lugar, necesitamos proporcionar un método para borrar cualquier subobjeto que pueda participar en ciclos::

source: Notice the use of the :c:func:`Py_CLEAR` macro. It is the recommended and safe way to clear data attributes of arbitrary types while decrementing their reference counts. If you were to call :c:func:`Py_XDECREF` instead on the attribute before setting it to ``NULL``, there is a possibility that the attribute's destructor would call back into code that reads the attribute again (*especially* if there is a reference cycle).
es_es: Observe el uso de la macro :c:func:`Py_CLEAR`. Es la forma recomendada y segura de borrar atributos de datos de tipos arbitrarios mientras se decrementa su número de referencias. Si en su lugar llamara a :c:func:`Py_XDECREF` en el atributo antes de establecerlo en ``NULL``, existe la posibilidad de que el destructor del atributo volviera a llamar al código que lee el atributo de nuevo (*especialmente* si hay un ciclo de referencia).

source: You could emulate :c:func:`Py_CLEAR` by writing::
es_es: Podrías emular :c:func:`Py_CLEAR` escribiendo::

source: Nevertheless, it is much easier and less error-prone to always use :c:func:`Py_CLEAR` when deleting an attribute. Don't try to micro-optimize at the expense of robustness!
es_es: Sin embargo, es mucho más fácil y menos propenso a errores utilizar siempre :c:func:`Py_CLEAR` al eliminar un atributo. No intentes microoptimizar a costa de la robustez.

source: The deallocator ``Custom_dealloc`` may call arbitrary code when clearing attributes. It means the circular GC can be triggered inside the function. Since the GC assumes reference count is not zero, we need to untrack the object from the GC by calling :c:func:`PyObject_GC_UnTrack` before clearing members. Here is our reimplemented deallocator using :c:func:`PyObject_GC_UnTrack` and ``Custom_clear``::
es_es: El deallocator ``Custom_dealloc`` puede llamar a código arbitrario al borrar atributos. Esto significa que la GC circular puede activarse dentro de la función. Dado que la GC asume que el número de referencias no es cero, necesitamos eliminar el objeto de la GC llamando a :c:func:`PyObject_GC_UnTrack` antes de borrar los miembros. Aquí está nuestro reimplementado deallocator usando :c:func:`PyObject_GC_UnTrack` y ``Custom_clear``::

source: Finally, we add the :const:`Py_TPFLAGS_HAVE_GC` flag to the class flags::
es_es: Por último, añadimos la bandera :const:`Py_TPFLAGS_HAVE_GC` a la clase flags::

source: That's pretty much it. If we had written custom :c:member:`~PyTypeObject.tp_alloc` or :c:member:`~PyTypeObject.tp_free` handlers, we'd need to modify them for cyclic garbage collection. Most extensions will use the versions automatically provided.
es_es: Eso es todo. Si hubiéramos escrito gestores personalizados para :c:member:`~PyTypeObject.tp_alloc` o :c:member:`~PyTypeObject.tp_free`, tendríamos que modificarlos para la recogida cíclica de basura. La mayoría de las extensiones utilizarán las versiones proporcionadas automáticamente.

source: Subclassing other types
es_es: Subclases de otros tipos

source: It is possible to create new extension types that are derived from existing types. It is easiest to inherit from the built in types, since an extension can easily use the :c:type:`PyTypeObject` it needs. It can be difficult to share these :c:type:`PyTypeObject` structures between extension modules.
es_es: Es posible crear nuevos tipos de extensiones que se derivan de tipos existentes. Es más fácil heredar de los tipos incorporados, ya que una extensión puede usar fácilmente el :c:type:`PyTypeObject` que necesita. Puede ser difícil compartir estas estructuras :c:type:`PyTypeObject` entre módulos de extensión.

source: In this example we will create a :class:`SubList` type that inherits from the built-in :class:`list` type. The new type will be completely compatible with regular lists, but will have an additional :meth:`increment` method that increases an internal counter:
es_es: En este ejemplo crearemos un tipo :class:`SubList` que hereda del tipo incorporado :class:`list`. El nuevo tipo será completamente compatible con las listas regulares, pero tendrá un método adicional :meth:`increment` que aumenta un contador interno:

source: As you can see, the source code closely resembles the :class:`Custom` examples in previous sections. We will break down the main differences between them. ::
es_es: Como puedes ver, el código fuente se asemeja estrechamente a los ejemplos de :class:`Custom` en las secciones anteriores. Desglosaremos las principales diferencias entre ellos. ::

source: The primary difference for derived type objects is that the base type's object structure must be the first value. The base type will already include the :c:func:`PyObject_HEAD` at the beginning of its structure.
es_es: La diferencia principal para los objetos de tipo derivado es que la estructura del objeto del tipo base debe ser el primer valor. El tipo base ya incluirá :c:func:`PyObject_HEAD` al principio de su estructura.

source: When a Python object is a :class:`SubList` instance, its ``PyObject *`` pointer can be safely cast to both ``PyListObject *`` and ``SubListObject *``::
es_es: Cuando un objeto de Python es una instancia de :class:`SubList`, su puntero ``PyObject *`` se puede convertir de forma segura tanto a ``PyListObject *`` como a ``SubListObject *``::

source: We see above how to call through to the :attr:`__init__` method of the base type.
es_es: Vemos arriba cómo llamar al método :attr:`__init__` del tipo base.

source: This pattern is important when writing a type with custom :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_dealloc` members. The :c:member:`~PyTypeObject.tp_new` handler should not actually create the memory for the object with its :c:member:`~PyTypeObject.tp_alloc`, but let the base class handle it by calling its own :c:member:`~PyTypeObject.tp_new`.
es_es: Este patrón es importante al escribir un tipo con miembros personalizados :c:member:`~PyTypeObject.tp_new` y :c:member:`~PyTypeObject.tp_dealloc`. El controlador :c:member:`~PyTypeObject.tp_new` no debe crear realmente la memoria para el objeto con su :c:member:`~PyTypeObject.tp_alloc`, sino dejar que la clase base lo maneje llamando a su propio :c:member:`~PyTypeObject.tp_new`.

source: The :c:type:`PyTypeObject` struct supports a :c:member:`~PyTypeObject.tp_base` specifying the type's concrete base class. Due to cross-platform compiler issues, you can't fill that field directly with a reference to :c:type:`PyList_Type`; it should be done later in the module initialization function::
es_es: La estructura :c:type:`PyTypeObject` admite un :c:member:`~PyTypeObject.tp_base` que especifica la clase base concreta del tipo. Debido a problemas de compilador multiplataforma, no se puede llenar ese campo directamente con una referencia a :c:type:`PyList_Type`; debe hacerse más tarde en la función de inicialización del módulo::

source: Before calling :c:func:`PyType_Ready`, the type structure must have the :c:member:`~PyTypeObject.tp_base` slot filled in. When we are deriving an existing type, it is not necessary to fill out the :c:member:`~PyTypeObject.tp_alloc` slot with :c:func:`PyType_GenericNew` -- the allocation function from the base type will be inherited.
es_es: Antes de llamar a :c:func:`PyType_Ready`, la estructura del tipo debe tener el espacio :c:member:`~PyTypeObject.tp_base` lleno. Cuando estamos derivando un tipo existente, no es necesario completar el espacio :c:member:`~PyTypeObject.tp_alloc` con :c:func:`PyType_GenericNew` -- la función de asignación del tipo base será heredada.

source: After that, calling :c:func:`PyType_Ready` and adding the type object to the module is the same as with the basic :class:`Custom` examples.
es_es: Después de eso, llamar a :c:func:`PyType_Ready` y agregar el objeto de tipo al módulo es lo mismo que con los ejemplos básicos de :class:`Custom`.

source: Footnotes
es_es: Notas a pie de página
pt_pt: Notas de rodapé

source: This is true when we know that the object is a basic type, like a string or a float.
es_es: Esto es cierto cuando sabemos que el objeto es un tipo básico, como una cadena o un número decimal.

source: We relied on this in the :c:member:`~PyTypeObject.tp_dealloc` handler in this example, because our type doesn't support garbage collection.
es_es: Dependimos de esto en el controlador :c:member:`~PyTypeObject.tp_dealloc` en este ejemplo, porque nuestro tipo no admite la recolección de basura.

source: We now know that the first and last members are strings, so perhaps we could be less careful about decrementing their reference counts, however, we accept instances of string subclasses. Even though deallocating normal strings won't call back into our objects, we can't guarantee that deallocating an instance of a string subclass won't call back into our objects.
es_es: Ahora sabemos que los primeros y últimos miembros son cadenas de texto, por lo que tal vez podríamos ser menos cuidadosos al decrementar sus recuentos de referencia, sin embargo, aceptamos instancias de subclases de cadenas de texto. Aunque desasignar cadenas normales no llamará de vuelta a nuestros objetos, no podemos garantizar que desasignar una instancia de una subclase de cadena de texto no llamará de vuelta a nuestros objetos.

source: Also, even with our attributes restricted to strings instances, the user could pass arbitrary :class:`str` subclasses and therefore still create reference cycles.
es_es: Además, incluso con nuestros atributos restringidos a instancias de cadenas, el usuario podría pasar subclases arbitrarias de :class:`str` y, por lo tanto, seguir creando ciclos de referencia.

source: This sort of thing can only be explained by example, so here's a minimal, but complete, module that defines a new type named :class:`!Custom` inside a C extension module :mod:`!custom`:
pt_pt: Este tipo de coisa só pode ser explicado por exemplo, então aqui está um módulo mínimo, mas completo, que define um novo tipo chamado :class:`!Custom` dentro de um módulo de extensão C :mod:`!custom`:

source: What a :class:`!Custom` **object** contains: this is the ``CustomObject`` struct, which is allocated once for each :class:`!Custom` instance.
pt_pt: O que um **objeto** :class:`!Custom` contém: esta é a estrutura ``CustomObject``, que é alocada uma vez para cada instância :class:`!Custom`.

source: How the :class:`!Custom` **type** behaves: this is the ``CustomType`` struct, which defines a set of flags and function pointers that the interpreter inspects when specific operations are requested.
pt_pt: Como o **tipo** :class:`!Custom` se comporta: esta é a estrutura ``CustomType``, que define um conjunto de flags e ponteiros de função que o interpretador inspeciona quando operações específicas são solicitadas.

source: Note that the name is a dotted name that includes both the module name and the name of the type within the module. The module in this case is :mod:`!custom` and the type is :class:`!Custom`, so we set the type name to :class:`!custom.Custom`. Using the real dotted import path is important to make your type compatible with the :mod:`pydoc` and :mod:`pickle` modules. ::
pt_pt: Note que o nome é um nome pontuado que inclui tanto o nome do módulo como o nome do tipo dentro do módulo. O módulo neste caso é :mod:`!custom` e o tipo é :class:`!Custom`, por isso definimos o nome do tipo como :class:`!custom.Custom`. Usar o caminho de importação pontuado real é importante para tornar o seu tipo compatível com os módulos :mod:`pydoc` e :mod:`pickle`.

source: This is so that Python knows how much memory to allocate when creating new :class:`!Custom` instances. :c:member:`~PyTypeObject.tp_itemsize` is only used for variable-sized objects and should otherwise be zero.
pt_pt: Isto é para que o Python saiba quanto memória alocar ao criar novas instâncias :class:`!Custom`. :c:member:`~PyTypeObject.tp_itemsize` é usado apenas para objetos de tamanho variável e deve ser zero nos outros casos.

source: We set the class flags to :c:macro:`Py_TPFLAGS_DEFAULT`. ::
pt_pt: Definimos as flags da classe para :c:macro:`Py_TPFLAGS_DEFAULT`:

source: To enable object creation, we have to provide a :c:member:`~PyTypeObject.tp_new` handler. This is the equivalent of the Python method :meth:`~object.__new__`, but has to be specified explicitly. In this case, we can just use the default implementation provided by the API function :c:func:`PyType_GenericNew`. ::
pt_pt: Para permitir a criação de objetos, temos de fornecer um gestor :c:member:`~PyTypeObject.tp_new`. Isto é o equivalente ao método Python :meth:`~object.__new__`, mas tem de ser especificado explicitamente. Neste caso, podemos simplesmente usar a implementação padrão fornecida pela função da API :c:func:`PyType_GenericNew`.

source: This initializes the :class:`!Custom` type, filling in a number of members to the appropriate default values, including :c:member:`~PyObject.ob_type` that we initially set to ``NULL``. ::
pt_pt: Isto inicializa o tipo :class:`!Custom`, preenchendo vários membros com os valores padrão apropriados, incluindo :c:member:`~PyObject.ob_type` que inicialmente definimos como ``NULL``.

source: This adds the type to the module dictionary. This allows us to create :class:`!Custom` instances by calling the :class:`!Custom` class:
pt_pt: Isto adiciona o tipo ao dicionário do módulo. Isto permite-nos criar instâncias :class:`!Custom` chamando a classe :class:`!Custom`:

source: Let's extend the basic example to add some data and methods. Let's also make the type usable as a base class. We'll create a new module, :mod:`!custom2` that adds these capabilities:
pt_pt: Vamos estender o exemplo básico para adicionar alguns dados e métodos. Vamos também tornar o tipo utilizável como uma classe base. Vamos criar um novo módulo, :mod:`!custom2`, que adiciona estas capacidades:

source: The :class:`!Custom` type now has three data attributes in its C struct, *first*, *last*, and *number*. The *first* and *last* variables are Python strings containing first and last names. The *number* attribute is a C integer.
pt_pt: O tipo :class:`!Custom` agora tem três atributos de dados na sua estrutura C, *first*, *last*, e *number*. As variáveis *first* e *last* são strings Python que contêm o primeiro e último nomes. O atributo *number* é um inteiro C.

source: This method first clears the reference counts of the two Python attributes. :c:func:`Py_XDECREF` correctly handles the case where its argument is ``NULL`` (which might happen here if ``tp_new`` failed midway). It then calls the :c:member:`~PyTypeObject.tp_free` member of the object's type (computed by ``Py_TYPE(self)``) to free the object's memory. Note that the object's type might not be :class:`!CustomType`, because the object may be an instance of a subclass.
pt_pt: Este método primeiro limpa as contagens de referência dos dois atributos Python. :c:func:`Py_XDECREF` trata corretamente o caso em que o seu argumento é ``NULL`` (o que pode acontecer aqui se ``tp_new`` falhar a meio). Depois, chama o membro :c:member:`~PyTypeObject.tp_free` do tipo do objeto (calculado por ``Py_TYPE(self)``) para libertar a memória do objeto. Note que o tipo do objeto pode não ser :class:`!CustomType`, porque o objeto pode ser uma instância de uma subclasse.

source: The ``tp_new`` handler is responsible for creating (as opposed to initializing) objects of the type. It is exposed in Python as the :meth:`~object.__new__` method. It is not required to define a ``tp_new`` member, and indeed many extension types will simply reuse :c:func:`PyType_GenericNew` as done in the first version of the :class:`!Custom` type above. In this case, we use the ``tp_new`` handler to initialize the ``first`` and ``last`` attributes to non-``NULL`` default values.
pt_pt: O gestor ``tp_new`` é responsável por criar (em oposição a inicializar) objetos do tipo. É exposto em Python como o método :meth:`~object.__new__`. Não é obrigatório definir um membro ``tp_new``, e de facto muitos tipos de extensão simplesmente reutilizam :c:func:`PyType_GenericNew` como feito na primeira versão do tipo :class:`!Custom` acima. Neste caso, usamos o gestor ``tp_new`` para inicializar os atributos ``first`` e ``last`` com valores padrão não-``NULL``.

source: If you are creating a co-operative :c:member:`~PyTypeObject.tp_new` (one that calls a base type's :c:member:`~PyTypeObject.tp_new` or :meth:`~object.__new__`), you must *not* try to determine what method to call using method resolution order at runtime. Always statically determine what type you are going to call, and call its :c:member:`~PyTypeObject.tp_new` directly, or via ``type->tp_base->tp_new``. If you do not do this, Python subclasses of your type that also inherit from other Python-defined classes may not work correctly. (Specifically, you may not be able to create instances of such subclasses without getting a :exc:`TypeError`.)
pt_pt: Se estiver a criar um :c:member:`~PyTypeObject.tp_new` cooperativo (um que chama o :c:member:`~PyTypeObject.tp_new` de um tipo base ou :meth:`~object.__new__`), não deve tentar determinar que método chamar usando a ordem de resolução de métodos em tempo de execução. Deve sempre determinar estaticamente que tipo vai chamar, e chamar o seu :c:member:`~PyTypeObject.tp_new` diretamente, ou via ``type->tp_base->tp_new``. Se não o fizer, subclasses Python do seu tipo que também herdam de outras classes definidas em Python podem não funcionar corretamente. (Especificamente, pode não ser capaz de criar instâncias de tais subclasses sem obter um :exc:`TypeError`.)

source: The :c:member:`~PyTypeObject.tp_init` slot is exposed in Python as the :meth:`~object.__init__` method. It is used to initialize an object after it's created. Initializers always accept positional and keyword arguments, and they should return either ``0`` on success or ``-1`` on error.
pt_pt: O slot :c:member:`~PyTypeObject.tp_init` é exposto em Python como o método :meth:`~object.__init__`. É usado para inicializar um objeto depois de criado. Os inicializadores sempre aceitam argumentos posicionais e de palavra-chave, e devem retornar ``0`` em caso de sucesso ou ``-1`` em caso de erro.

source: Unlike the ``tp_new`` handler, there is no guarantee that ``tp_init`` is called at all (for example, the :mod:`pickle` module by default doesn't call :meth:`~object.__init__` on unpickled instances). It can also be called multiple times. Anyone can call the :meth:`!__init__` method on our objects. For this reason, we have to be extra careful when assigning the new attribute values. We might be tempted, for example to assign the ``first`` member like this::
pt_pt: Ao contrário do gestor ``tp_new``, não há garantia de que ``tp_init`` seja chamado (por exemplo, o módulo :mod:`pickle` por defeito não chama :meth:`~object.__init__` em instâncias deserializadas). Também pode ser chamado múltiplas vezes. Qualquer pessoa pode chamar o método :meth:`!__init__` nos nossos objetos. Por esta razão, temos de ser especialmente cuidadosos ao atribuir os novos valores dos atributos. Podemos ser tentados, por exemplo, a atribuir o membro ``first`` assim:

source: The method is implemented as a C function that takes a :class:`!Custom` (or :class:`!Custom` subclass) instance as the first argument. Methods always take an instance as the first argument. Methods often take positional and keyword arguments as well, but in this case we don't take any and don't need to accept a positional argument tuple or keyword argument dictionary. This method is equivalent to the Python method:
pt_pt: O método é implementado como uma função C que recebe uma instância :class:`!Custom` (ou uma subclasse de :class:`!Custom`) como primeiro argumento. Os métodos sempre recebem uma instância como primeiro argumento. Os métodos muitas vezes também aceitam argumentos posicionais e de palavra-chave, mas neste caso não aceitamos nenhum e não precisamos de aceitar uma tupla de argumentos posicionais ou um dicionário de argumentos de palavra-chave. Este método é equivalente ao método Python:
