Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/newtypes_tutorial.po
Languages: es_es, pt_pt

source: Note that we have to check for the possibility that our :attr:`!first` and :attr:`!last` members are ``NULL``. This is because they can be deleted, in which case they are set to ``NULL``. It would be better to prevent deletion of these attributes and to restrict the attribute values to be strings. We'll see how to do that in the next section.
pt_pt: Note que temos de verificar a possibilidade de os nossos membros :attr:`!first` e :attr:`!last` serem ``NULL``. Isto acontece porque podem ser apagados, caso em que são definidos como ``NULL``. Seria melhor prevenir a eliminação destes atributos e restringir os valores dos atributos a serem strings. Veremos como fazer isso na próxima secção.

source: (note that we used the :c:macro:`METH_NOARGS` flag to indicate that the method is expecting no arguments other than *self*)
pt_pt: (note que usámos a flag :c:macro:`METH_NOARGS` para indicar que o método não espera argumentos além de *self*)

source: Finally, we'll make our type usable as a base class for subclassing. We've written our methods carefully so far so that they don't make any assumptions about the type of the object being created or used, so all we need to do is to add the :c:macro:`Py_TPFLAGS_BASETYPE` to our class flag definition::
pt_pt: Finalmente, vamos tornar o nosso tipo utilizável como uma classe base para subclassificação. Escrevemos os nossos métodos com cuidado até agora, de modo a que não façam quaisquer suposições sobre o tipo do objeto que está a ser criado ou usado, por isso tudo o que precisamos de fazer é adicionar a macro :c:macro:`Py_TPFLAGS_BASETYPE` à definição das flags da nossa classe:

source: We rename :c:func:`!PyInit_custom` to :c:func:`!PyInit_custom2`, update the module name in the :c:type:`PyModuleDef` struct, and update the full class name in the :c:type:`PyTypeObject` struct.
pt_pt: Renomeamos :c:func:`!PyInit_custom` para :c:func:`!PyInit_custom2`, atualizamos o nome do módulo na estrutura :c:type:`PyModuleDef`, e atualizamos o nome completo da classe na estrutura :c:type:`PyTypeObject`.

source: In this section, we'll provide finer control over how the :attr:`!first` and :attr:`!last` attributes are set in the :class:`!Custom` example. In the previous version of our module, the instance variables :attr:`!first` and :attr:`!last` could be set to non-string values or even deleted. We want to make sure that these attributes always contain strings.
pt_pt: Nesta secção, vamos fornecer um controlo mais refinado sobre como os atributos :attr:`!first` e :attr:`!last` são definidos no exemplo :class:`!Custom`. Na versão anterior do nosso módulo, as variáveis de instância :attr:`!first` e :attr:`!last` podiam ser definidas para valores não-string ou até apagadas. Queremos garantir que estes atributos contenham sempre strings.

source: To provide greater control, over the :attr:`!first` and :attr:`!last` attributes, we'll use custom getter and setter functions. Here are the functions for getting and setting the :attr:`!first` attribute::
pt_pt: Para fornecer um controlo mais refinado sobre os atributos :attr:`!first` e :attr:`!last`, vamos usar funções personalizadas de getter e setter. Aqui estão as funções para obter e definir o atributo :attr:`!first`:

source: The getter function is passed a :class:`!Custom` object and a "closure", which is a void pointer. In this case, the closure is ignored. (The closure supports an advanced usage in which definition data is passed to the getter and setter. This could, for example, be used to allow a single set of getter and setter functions that decide the attribute to get or set based on data in the closure.)
pt_pt: A função getter recebe um objeto :class:`!Custom` e um "closure", que é um ponteiro void. Neste caso, o closure é ignorado. (O closure suporta um uso avançado em que dados de definição são passados para o getter e setter. Isto poderia, por exemplo, ser usado para permitir um único conjunto de funções getter e setter que decidem o atributo a obter ou definir com base em dados no closure.)

source: The setter function is passed the :class:`!Custom` object, the new value, and the closure. The new value may be ``NULL``, in which case the attribute is being deleted. In our setter, we raise an error if the attribute is deleted or if its new value is not a string.
pt_pt: A função setter recebe o objeto :class:`!Custom`, o novo valor, e o closure. O novo valor pode ser ``NULL``, caso em que o atributo está a ser apagado. No nosso setter, lançamos um erro se o atributo for apagado ou se o seu novo valor não for uma string.
