Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/newtypes_tutorial.po
Languages: es_es, pt_pt

source: The ``tp_new`` handler is responsible for creating (as opposed to initializing) objects of the type. It is exposed in Python as the :meth:`__new__` method. It is not required to define a ``tp_new`` member, and indeed many extension types will simply reuse :c:func:`PyType_GenericNew` as done in the first version of the ``Custom`` type above. In this case, we use the ``tp_new`` handler to initialize the ``first`` and ``last`` attributes to non-``NULL`` default values.
es_es: El manejador ``tp_new`` es responsable de crear (en lugar de inicializar) objetos del tipo. Está expuesto en Python como el método :meth:`__new__`. No es necesario definir un miembro ``tp_new``, y de hecho muchos tipos de extensión simplemente reutilizarán :c:func:`PyType_GenericNew` como se hizo en la primera versión del tipo ``Custom`` anteriormente. En este caso, usamos el manejador ``tp_new`` para inicializar los atributos ``first`` y ``last`` a valores por defecto no``NULL``.

source: ``tp_new`` is passed the type being instantiated (not necessarily ``CustomType``, if a subclass is instantiated) and any arguments passed when the type was called, and is expected to return the instance created. ``tp_new`` handlers always accept positional and keyword arguments, but they often ignore the arguments, leaving the argument handling to initializer (a.k.a. ``tp_init`` in C or ``__init__`` in Python) methods.
es_es: ``tp_new`` se le pasa el tipo que se está instanciando (no necesariamente ``CustomType``, si se instancia una subclase) y cualquier argumento pasado cuando se llamó al tipo, y se espera que devuelva la instancia creada. Los manejadores ``tp_new`` siempre aceptan argumentos posicionales y de palabra clave, pero a menudo ignoran los argumentos, dejando el manejo de los argumentos a los métodos inicializadores (también conocidos como ``tp_init`` en C o ``__init__`` en Python).
pt_pt: ``tp_new`` recebe o tipo que está a ser instanciado (não necessariamente ``CustomType``, se uma subclasse for instanciada) e quaisquer argumentos passados quando o tipo foi chamado, e espera-se que retorne a instância criada. Os gestores ``tp_new`` sempre aceitam argumentos posicionais e de palavra-chave, mas muitas vezes ignoram os argumentos, deixando o tratamento dos argumentos para os métodos de inicialização (também conhecidos como ``tp_init`` em C ou ``__init__`` em Python).

source: ``tp_new`` shouldn't call ``tp_init`` explicitly, as the interpreter will do it itself.
es_es: ``tp_new`` no debería llamar explícitamente a ``tp_init``, ya que el intérprete lo hará por sí mismo.
pt_pt: ``tp_new`` não deve chamar ``tp_init`` explicitamente, pois o interpretador fará isso.

source: The ``tp_new`` implementation calls the :c:member:`~PyTypeObject.tp_alloc` slot to allocate memory::
es_es: La implementación de ``tp_new`` llama a la ranura :c:member:`~PyTypeObject.tp_alloc` para asignar memoria::
pt_pt: A implementação ``tp_new`` chama o slot :c:member:`~PyTypeObject.tp_alloc` para alocar memória:

source: Since memory allocation may fail, we must check the :c:member:`~PyTypeObject.tp_alloc` result against ``NULL`` before proceeding.
es_es: Dado que la asignación de memoria puede fallar, debemos comprobar el resultado de :c:member:`~PyTypeObject.tp_alloc` con ``NULL`` antes de continuar.
pt_pt: Como a alocação de memória pode falhar, devemos verificar o resultado :c:member:`~PyTypeObject.tp_alloc` contra ``NULL`` antes de prosseguir.

source: We didn't fill the :c:member:`~PyTypeObject.tp_alloc` slot ourselves. Rather :c:func:`PyType_Ready` fills it for us by inheriting it from our base class, which is :class:`object` by default. Most types use the default allocation strategy.
es_es: No llenamos la ranura :c:member:`~PyTypeObject.tp_alloc` nosotros mismos. Más bien :c:func:`PyType_Ready` lo llena por nosotros heredándolo de nuestra clase base, que es :class:`object` por defecto. La mayoría de los tipos utilizan la estrategia de asignación por defecto.
pt_pt: Não preenchemos o slot :c:member:`~PyTypeObject.tp_alloc` nós mesmos. Em vez disso, :c:func:`PyType_Ready` preenche-o para nós herdando-o da nossa classe base, que por defeito é :class:`object`. A maioria dos tipos usa a estratégia de alocação padrão.

source: If you are creating a co-operative :c:member:`~PyTypeObject.tp_new` (one that calls a base type's :c:member:`~PyTypeObject.tp_new` or :meth:`__new__`), you must *not* try to determine what method to call using method resolution order at runtime. Always statically determine what type you are going to call, and call its :c:member:`~PyTypeObject.tp_new` directly, or via ``type->tp_base->tp_new``. If you do not do this, Python subclasses of your type that also inherit from other Python-defined classes may not work correctly. (Specifically, you may not be able to create instances of such subclasses without getting a :exc:`TypeError`.)
es_es: Si está creando un :c:member:`~PyTypeObject.tp_new` cooperativo (uno que llama a :c:member:`~PyTypeObject.tp_new` o :meth:`__new__` de un tipo base), no debe *intentar* determinar a qué método llamar utilizando el orden de resolución de métodos en tiempo de ejecución. Determina siempre estáticamente qué tipo vas a llamar, y llama a su :c:member:`~PyTypeObject.tp_new` directamente, o a través de ``type->tp_base->tp_new``. Si no haces esto, las subclases Python de tu tipo que también heredan de otras clases definidas por Python pueden no funcionar correctamente. (Específicamente, puede que no seas capaz de crear instancias de tales subclases sin obtener un :exc:`TypeError`.)

source: We also define an initialization function which accepts arguments to provide initial values for our instance::
es_es: También definimos una función de inicialización que acepta argumentos para proporcionar valores iniciales a nuestra instancia::
pt_pt: Também definimos uma função de inicialização que aceita argumentos para fornecer valores iniciais para a nossa instância:

source: by filling the :c:member:`~PyTypeObject.tp_init` slot. ::
es_es: llenando la ranura :c:member:`~PyTypeObject.tp_init`. ::
pt_pt: preenchendo o slot :c:member:`~PyTypeObject.tp_init`:

source: The :c:member:`~PyTypeObject.tp_init` slot is exposed in Python as the :meth:`__init__` method. It is used to initialize an object after it's created. Initializers always accept positional and keyword arguments, and they should return either ``0`` on success or ``-1`` on error.
es_es: La ranura :c:member:`~PyTypeObject.tp_init` está expuesta en Python como el método :meth:`__init__`. Se utiliza para inicializar un objeto después de crearlo. Los inicializadores siempre aceptan argumentos posicionales y de palabra clave, y deben devolver ``0`` en caso de éxito o ``-1`` en caso de error.

source: Unlike the ``tp_new`` handler, there is no guarantee that ``tp_init`` is called at all (for example, the :mod:`pickle` module by default doesn't call :meth:`__init__` on unpickled instances). It can also be called multiple times. Anyone can call the :meth:`__init__` method on our objects. For this reason, we have to be extra careful when assigning the new attribute values. We might be tempted, for example to assign the ``first`` member like this::
es_es: A diferencia del manejador ``tp_new``, no hay garantía de que ``tp_init`` sea llamado en absoluto (por ejemplo, el módulo :mod:`pickle` por defecto no llama a :meth:`__init__` en instancias no bloqueadas). También puede ser llamado varias veces. Cualquiera puede llamar al método :meth:`__init__` en nuestros objetos. Por esta razón, tenemos que tener mucho cuidado al asignar los nuevos valores de los atributos. Podríamos caer en la tentación, por ejemplo, de asignar el miembro ``first`` así::

source: But this would be risky. Our type doesn't restrict the type of the ``first`` member, so it could be any kind of object. It could have a destructor that causes code to be executed that tries to access the ``first`` member; or that destructor could release the :term:`Global interpreter Lock <GIL>` and let arbitrary code run in other threads that accesses and modifies our object.
es_es: Pero esto sería arriesgado. Nuestro tipo no restringe el tipo del miembro ``first``, por lo que podría ser cualquier tipo de objeto. Podría tener un destructor que hiciera que se ejecutara código que intentara acceder al miembro ``first``; o ese destructor podría liberar el :term:`Global interpreter Lock <GIL>` y dejar que se ejecutara código arbitrario en otros hilos que accediera y modificara nuestro objeto.

source: To be paranoid and protect ourselves against this possibility, we almost always reassign members before decrementing their reference counts. When don't we have to do this?
es_es: Ser paranoico y protegernos contra esta posibilidad, casi siempre reasignamos miembros antes de decrementar sus recuentos de referencia. ¿Cuándo no tenemos que hacer esto?
pt_pt: Para sermos paranoicos e nos protegermos contra esta possibilidade, quase sempre reatribuímos membros antes de decrementar as suas contagens de referência. Quando não precisamos de fazer isto?

source: when we absolutely know that the reference count is greater than 1;
es_es: cuando absolutamente sabemos que el recuento de referencias es mayor que 1;
pt_pt: quando sabemos absolutamente que a contagem de referência é maior que 1;

source: when we know that deallocation of the object [#]_ will neither release the :term:`GIL` nor cause any calls back into our type's code;
es_es: cuando sabemos que la desasignación del objeto [#]_ no liberará el :term:`GIL` ni causará ninguna llamada de vuelta al código de nuestro tipo;

source: when decrementing a reference count in a :c:member:`~PyTypeObject.tp_dealloc` handler on a type which doesn't support cyclic garbage collection [#]_.
es_es: cuando se decrementa un contador de referencias en un manejador :c:member:`~PyTypeObject.tp_dealloc` en un tipo que no soporta la recolección cíclica de basura [#]_.
pt_pt: quando decrementamos uma contagem de referência num gestor :c:member:`~PyTypeObject.tp_dealloc` de um tipo que não suporta recolha de lixo cíclica [#]_.

source: We want to expose our instance variables as attributes. There are a number of ways to do that. The simplest way is to define member definitions::
es_es: Queremos exponer nuestras variables de instancia como atributos. Hay varias formas de hacerlo. La forma más sencilla es definir las definiciones de miembros::
pt_pt: Queremos expor as nossas variáveis de instância como atributos. Há várias formas de fazer isso. A forma mais simples é definir definições de membros:

source: and put the definitions in the :c:member:`~PyTypeObject.tp_members` slot::
es_es: y poner las definiciones en la ranura :c:member:`~PyTypeObject.tp_members`::
pt_pt: e colocar as definições no slot :c:member:`~PyTypeObject.tp_members`:

source: Each member definition has a member name, type, offset, access flags and documentation string. See the :ref:`Generic-Attribute-Management` section below for details.
es_es: Cada definición de miembro tiene un nombre de miembro, tipo, desplazamiento, indicadores de acceso y cadena de documentación. Para más información, ver la sección :ref:`Generic-Attribute-Management`.
pt_pt: Cada definição de membro tem um nome de membro, tipo, deslocamento, flags de acesso e string de documentação. Veja a secção :ref:`Generic-Attribute-Management` abaixo para mais detalhes.

source: A disadvantage of this approach is that it doesn't provide a way to restrict the types of objects that can be assigned to the Python attributes. We expect the first and last names to be strings, but any Python objects can be assigned. Further, the attributes can be deleted, setting the C pointers to ``NULL``. Even though we can make sure the members are initialized to non-``NULL`` values, the members can be set to ``NULL`` if the attributes are deleted.
es_es: Una desventaja de este enfoque es que no proporciona una forma de restringir los tipos de objetos que se pueden asignar a los atributos Python. Esperamos que el nombre y el apellido sean cadenas, pero se puede asignar cualquier objeto Python. Además, los atributos se pueden borrar, estableciendo los punteros C a ``NULL``. Aunque podemos asegurarnos de que los miembros se inicializan a valores no``NULL``, los miembros se pueden establecer ``NULL`` si los atributos son borrados.
pt_pt: Uma desvantagem desta abordagem é que não fornece uma forma de restringir os tipos de objetos que podem ser atribuídos aos atributos Python. Esperamos que os primeiros e últimos nomes sejam strings, mas qualquer objeto Python pode ser atribuído. Além disso, os atributos podem ser apagados, definindo os ponteiros C para ``NULL``. Mesmo que possamos garantir que os membros são inicializados com valores não-``NULL``, os membros podem ser definidos para ``NULL`` se os atributos forem apagados.

source: We define a single method, :meth:`Custom.name()`, that outputs the objects name as the concatenation of the first and last names. ::
es_es: Definimos un único método, :meth:`Custom.name()`, que devuelve el nombre del objeto como la concatenación del nombre y el apellido. ::

source: The method is implemented as a C function that takes a :class:`Custom` (or :class:`Custom` subclass) instance as the first argument. Methods always take an instance as the first argument. Methods often take positional and keyword arguments as well, but in this case we don't take any and don't need to accept a positional argument tuple or keyword argument dictionary. This method is equivalent to the Python method:
es_es: El método se implementa como una función C que toma una instancia de :class:`Custom` (o subclase de :class:`Custom` ) como primer argumento. Los métodos siempre toman una instancia como primer argumento. Los métodos a menudo toman también argumentos posicionales y de palabra clave, pero en este caso no tomamos ninguno y no necesitamos aceptar una tupla de argumentos posicionales o un diccionario de argumentos de palabra clave. Este método es equivalente al método de Python:

source: Note that we have to check for the possibility that our :attr:`first` and :attr:`last` members are ``NULL``. This is because they can be deleted, in which case they are set to ``NULL``. It would be better to prevent deletion of these attributes and to restrict the attribute values to be strings. We'll see how to do that in the next section.
es_es: Tener en cuenta que debemos comprobar la posibilidad de que nuestros miembros :attr:`first` y :attr:`last` sean ``NULL``. Esto se debe a que se pueden eliminar, en cuyo caso se establecen como ``NULL``. Sería mejor evitar la eliminación de estos atributos y restringir los valores de los atributos a ser cadenas de texto. Veremos cómo hacerlo en la próxima sección.

source: Now that we've defined the method, we need to create an array of method definitions::
es_es: Ahora que hemos definido el método, tenemos que crear una matriz de definiciones de método::
pt_pt: Agora que definimos o método, precisamos de criar um array de definições de métodos:

source: (note that we used the :const:`METH_NOARGS` flag to indicate that the method is expecting no arguments other than *self*)
es_es: (nótese que hemos utilizado la bandera :const:`METH_NOARGS` para indicar que el método no espera más argumentos que *self*)

source: and assign it to the :c:member:`~PyTypeObject.tp_methods` slot::
es_es: y asignarlo a la ranura :c:member:`~PyTypeObject.tp_methods`::
pt_pt: e atribuí-lo ao slot :c:member:`~PyTypeObject.tp_methods`:

source: Finally, we'll make our type usable as a base class for subclassing. We've written our methods carefully so far so that they don't make any assumptions about the type of the object being created or used, so all we need to do is to add the :const:`Py_TPFLAGS_BASETYPE` to our class flag definition::
es_es: Por último, haremos que nuestro tipo sea utilizable como clase base para subclases. Hemos escrito nuestros métodos cuidadosamente hasta ahora para que no hagan ninguna suposición sobre el tipo del objeto que se está creando o utilizando, por lo que todo lo que tenemos que hacer es añadir el :const:`Py_TPFLAGS_BASETYPE` a nuestra definición de la bandera de la clase::

source: We rename :c:func:`PyInit_custom` to :c:func:`PyInit_custom2`, update the module name in the :c:type:`PyModuleDef` struct, and update the full class name in the :c:type:`PyTypeObject` struct.
es_es: Cambiamos el nombre de :c:func:`PyInit_custom` a :c:func:`PyInit_custom2`, actualizamos el nombre del módulo en la estructura :c:type:`PyModuleDef` y actualizamos el nombre completo de la clase en la estructura :c:type:`PyTypeObject`.

source: Finally, we update our :file:`setup.py` file to build the new module:
es_es: Finalmente, actualizamos nuestro archivo :file:`setup.py` para construir el nuevo módulo.

source: Providing finer control over data attributes
es_es: Proporcionando un control más preciso sobre los atributos de datos
pt_pt: Fornecer um controlo mais refinado sobre os atributos de dados

source: In this section, we'll provide finer control over how the :attr:`first` and :attr:`last` attributes are set in the :class:`Custom` example. In the previous version of our module, the instance variables :attr:`first` and :attr:`last` could be set to non-string values or even deleted. We want to make sure that these attributes always contain strings.
es_es: En esta sección, proporcionaremos un control más preciso sobre cómo se establecen los atributos :attr:`first` y :attr:`last` en el ejemplo :class:`Custom`. En la versión anterior de nuestro módulo, las variables de instancia :attr:`first` y :attr:`last` podían establecerse con valores que no fueran cadenas o incluso eliminarse. Queremos asegurarnos de que estos atributos siempre contengan cadenas.

source: To provide greater control, over the :attr:`first` and :attr:`last` attributes, we'll use custom getter and setter functions. Here are the functions for getting and setting the :attr:`first` attribute::
es_es: Para proporcionar un mayor control sobre los atributos :attr:`first` y :attr:`last`, utilizaremos funciones getter y setter personalizadas. Estas son las funciones para obtener y establecer el atributo :attr:`first`::

source: The getter function is passed a :class:`Custom` object and a "closure", which is a void pointer. In this case, the closure is ignored. (The closure supports an advanced usage in which definition data is passed to the getter and setter. This could, for example, be used to allow a single set of getter and setter functions that decide the attribute to get or set based on data in the closure.)
es_es: La función getter recibe un objeto :class:`Custom` y un "closure", que es un puntero nulo. En este caso, se ignora el closure. (El closure admite un uso avanzado en el que se pasa información de definición al getter y al setter. Esto podría, por ejemplo, permitir un único conjunto de funciones getter y setter que decidan el atributo a obtener o establecer en función de los datos en el closure.)

source: The setter function is passed the :class:`Custom` object, the new value, and the closure. The new value may be ``NULL``, in which case the attribute is being deleted. In our setter, we raise an error if the attribute is deleted or if its new value is not a string.
es_es: A la función setter se le pasa el objeto :class:`Custom`, el nuevo valor y el cierre. El nuevo valor puede ser ``NULL``, en cuyo caso se elimina el atributo. En nuestro setter, lanzamos un error si el atributo se borra o si su nuevo valor no es una cadena.

source: We create an array of :c:type:`PyGetSetDef` structures::
es_es: Creamos una serie de estructuras :c:type:`PyGetSetDef`::
pt_pt: Criamos um array de estruturas :c:type:`PyGetSetDef`:

source: and register it in the :c:member:`~PyTypeObject.tp_getset` slot::
es_es: y regístrelo en la ranura :c:member:`~PyTypeObject.tp_getset`::
pt_pt: e registá-lo no slot :c:member:`~PyTypeObject.tp_getset`:

source: The last item in a :c:type:`PyGetSetDef` structure is the "closure" mentioned above. In this case, we aren't using a closure, so we just pass ``NULL``.
es_es: El último elemento de una estructura :c:type:`PyGetSetDef` es el "closure" ya mencionado. En este caso, no estamos utilizando un cierre, por lo que sólo pasamos ``NULL``.
pt_pt: O último item numa estrutura :c:type:`PyGetSetDef` é o "closure" mencionado acima. Neste caso, não estamos a usar um closure, por isso passamos simplesmente ``NULL``.

source: We also remove the member definitions for these attributes::
es_es: También eliminamos las definiciones de miembros para estos atributos:
pt_pt: Também removemos as definições de membros para estes atributos:

source: We also need to update the :c:member:`~PyTypeObject.tp_init` handler to only allow strings [#]_ to be passed::
es_es: También necesitamos actualizar el controlador :c:member:`~PyTypeObject.tp_init` para permitir solo cadenas [#]_ que se pasen::
pt_pt: Também precisamos de atualizar o gestor :c:member:`~PyTypeObject.tp_init` para permitir apenas que strings [#]_ sejam passadas:

source: With these changes, we can assure that the ``first`` and ``last`` members are never ``NULL`` so we can remove checks for ``NULL`` values in almost all cases. This means that most of the :c:func:`Py_XDECREF` calls can be converted to :c:func:`Py_DECREF` calls. The only place we can't change these calls is in the ``tp_dealloc`` implementation, where there is the possibility that the initialization of these members failed in ``tp_new``.
es_es: Con estos cambios, podemos asegurar que los miembros ``first`` y ``last`` nunca son ``NULL`` por lo que podemos eliminar las comprobaciones de los valores ``NULL`` en casi todos los casos. Esto significa que la mayoría de las llamadas a :c:func:`Py_XDECREF` pueden convertirse en llamadas a :c:func:`Py_DECREF`. El único lugar donde no podemos cambiar estas llamadas es en la implementación de ``tp_dealloc``, donde existe la posibilidad de que la inicialización de estos miembros haya fallado en ``tp_new``.
pt_pt: Com estas alterações, podemos garantir que os membros ``first`` e ``last`` nunca são ``NULL``, por isso podemos remover as verificações de valores ``NULL`` em quase todos os casos. Isto significa que a maioria das chamadas :c:func:`Py_XDECREF` podem ser convertidas em chamadas :c:func:`Py_DECREF`. O único local onde não podemos alterar estas chamadas é na implementação de ``tp_dealloc``, onde existe a possibilidade de a inicialização destes membros ter falhado em ``tp_new``.

source: We also rename the module initialization function and module name in the initialization function, as we did before, and we add an extra definition to the :file:`setup.py` file.
es_es: También renombramos la función de inicialización del módulo y el nombre del módulo en la función de inicialización, como hicimos antes, y añadimos una definición extra al archivo :file:`setup.py`.
pt_pt: Também renomeamos a função de inicialização do módulo e o nome do módulo na função de inicialização, como fizemos antes, e adicionamos uma definição extra ao ficheiro :file:`setup.py`.

source: Supporting cyclic garbage collection
es_es: Recogida de basura cíclica

source: Python has a :term:`cyclic garbage collector (GC) <garbage collection>` that can identify unneeded objects even when their reference counts are not zero. This can happen when objects are involved in cycles. For example, consider:
es_es: Python tiene un :term:`cyclic garbage collector (GC) <garbage collection>` que puede identificar objetos innecesarios incluso cuando sus recuentos de referencia no son cero. Esto puede ocurrir cuando los objetos están involucrados en ciclos. Por ejemplo, considere:
