Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/newtypes_tutorial.po
Languages: es_es, pt_pt

source: Defining Extension Types: Tutorial
es_es: Definición de tipos de extensión: Tutorial
pt_pt: Definir tipos de extensão: Tutorial

source: Python allows the writer of a C extension module to define new types that can be manipulated from Python code, much like the built-in :class:`str` and :class:`list` types. The code for all extension types follows a pattern, but there are some details that you need to understand before you can get started. This document is a gentle introduction to the topic.
es_es: Python permite al escritor de un módulo de extensión C definir nuevos tipos que pueden ser manipulados desde el código Python, de forma similar a los tipos incorporados :class:`str` y :class:`list`. El código para todos los tipos de extensión sigue un patrón, pero hay algunos detalles que necesitas entender antes de empezar. Este documento es una ligera introducción al tema.
pt_pt: O Python permite que o autor de um módulo de extensão em C defina novos tipos que podem ser manipulados a partir de código Python, tal como os tipos integrados :class:`str` e :class:`list`. O código para todos os tipos de extensão segue um padrão, mas existem alguns detalhes que precisa de entender antes de começar. Este documento é uma introdução suave ao tema.

source: The Basics
es_es: Los fundamentos
pt_pt: Os Conceitos Básicos

source: The :term:`CPython` runtime sees all Python objects as variables of type :c:expr:`PyObject*`, which serves as a "base type" for all Python objects. The :c:type:`PyObject` structure itself only contains the object's :term:`reference count` and a pointer to the object's "type object". This is where the action is; the type object determines which (C) functions get called by the interpreter when, for instance, an attribute gets looked up on an object, a method called, or it is multiplied by another object. These C functions are called "type methods".
es_es: El tiempo de ejecución :term:`CPython` ve todos los objetos Python como variables de tipo :c:expr:`PyObject*`, que sirve como "base type" para todos los objetos Python. La propia estructura :c:type:`PyObject` sólo contiene el :term:`reference count` del objeto y un puntero al "type object" del objeto. Aquí es donde está la acción; el objeto de tipo determina qué funciones (C) son llamadas por el intérprete cuando, por ejemplo, se busca un atributo en un objeto, se llama a un método, o se multiplica por otro objeto. Estas funciones C se denominan "type methods".
pt_pt: O runtime :term:`CPython` vê todos os objetos Python como variáveis do tipo :c:expr:`PyObject*`, que serve como um "tipo base" para todos os objetos Python. A estrutura :c:type:`PyObject` em si contém apenas a :term:`contagem de referências` do objeto e um ponteiro para o "objeto tipo" do objeto. É aqui que a ação está; o objeto tipo determina quais funções (C) são chamadas pelo interpretador quando, por exemplo, um atributo é procurado num objeto, um método é chamado, ou é multiplicado por outro objeto. Estas funções C são chamadas "métodos de tipo".

source: So, if you want to define a new extension type, you need to create a new type object.
es_es: Entonces, si quieres definir un nuevo tipo de extensión, necesitas crear un nuevo objeto de tipo.
pt_pt: Portanto, se quiser definir um novo tipo de extensão, precisa de criar um novo objeto tipo.

source: This sort of thing can only be explained by example, so here's a minimal, but complete, module that defines a new type named :class:`Custom` inside a C extension module :mod:`custom`:
es_es: Este tipo de cosas sólo se pueden explicar con ejemplos, así que aquí tienes un módulo mínimo, pero completo, que define un nuevo tipo llamado :class:`Custom` dentro de un módulo de extensión C :mod:`custom`:

source: What we're showing here is the traditional way of defining *static* extension types. It should be adequate for most uses. The C API also allows defining heap-allocated extension types using the :c:func:`PyType_FromSpec` function, which isn't covered in this tutorial.
es_es: Lo que estamos mostrando aquí es la forma tradicional de definir tipos de extensión *estáticos*. Debería ser adecuado para la mayoría de los usos. La API de C también permite definir tipos de extensión asignados en el montón utilizando la función :c:func:`PyType_FromSpec`, que no se cubre en este tutorial.
pt_pt: O que estamos a mostrar aqui é a forma tradicional de definir tipos de extensão *estáticos*. Deve ser adequado para a maioria dos usos. A API C também permite definir tipos de extensão alocados na heap usando a função :c:func:`PyType_FromSpec`, que não é abordada neste tutorial.

source: Now that's quite a bit to take in at once, but hopefully bits will seem familiar from the previous chapter. This file defines three things:
es_es: Ahora eso es bastante para asimilar de una vez, pero esperemos que algunas partes te resulten familiares del capítulo anterior. Este archivo define tres cosas:
pt_pt: Agora, isto é bastante coisa para absorver de uma vez, mas esperamos que algumas partes lhe pareçam familiares do capítulo anterior. Este ficheiro define três coisas:

source: What a :class:`Custom` **object** contains: this is the ``CustomObject`` struct, which is allocated once for each :class:`Custom` instance.
es_es: Qué contiene un **object** :class:`Custom`: esto es la estructura ``CustomObject``, que se asigna una vez para cada instancia de :class:`Custom`.

source: How the :class:`Custom` **type** behaves: this is the ``CustomType`` struct, which defines a set of flags and function pointers that the interpreter inspects when specific operations are requested.
es_es: Cómo se comporta el **type** :class:`Custom`: se trata de la estructura ``CustomType``, que define un conjunto de banderas y punteros de función que el intérprete inspecciona cuando se solicitan operaciones específicas.

source: How to initialize the :mod:`custom` module: this is the ``PyInit_custom`` function and the associated ``custommodule`` struct.
es_es: Cómo inicializar el módulo :mod:`custom`: se trata de la función ``PyInit_custom`` y la estructura asociada ``custommodule``.

source: The first bit is::
es_es: La primera parte es::
pt_pt: A primeira parte é:

source: This is what a Custom object will contain. ``PyObject_HEAD`` is mandatory at the start of each object struct and defines a field called ``ob_base`` of type :c:type:`PyObject`, containing a pointer to a type object and a reference count (these can be accessed using the macros :c:macro:`Py_TYPE` and :c:macro:`Py_REFCNT` respectively). The reason for the macro is to abstract away the layout and to enable additional fields in :ref:`debug builds <debug-build>`.
es_es: Esto es lo que contendrá un objeto personalizado. ``PyObject_HEAD`` es obligatorio al principio de cada estructura de objeto y define un campo llamado ``ob_base`` de tipo :c:type:`PyObject`, que contiene un puntero a un objeto de tipo y un recuento de referencias (se puede acceder a ellos utilizando las macros :c:macro:`Py_TYPE` y :c:macro:`Py_REFCNT` respectivamente). La razón de la macro es abstraer el diseño y habilitar campos adicionales en :ref:`debug builds <debug-build>`.
pt_pt: Isto é o que um objeto Custom conterá. ``PyObject_HEAD`` é obrigatório no início de cada estrutura de objeto e define um campo chamado ``ob_base`` do tipo :c:type:`PyObject`, contendo um ponteiro para um objeto tipo e uma contagem de referências (estes podem ser acedidos usando as macros :c:macro:`Py_TYPE` e :c:macro:`Py_REFCNT`, respetivamente). A razão para a macro é abstrair o layout e permitir campos adicionais em :ref:`compilações de depuração <debug-build>`.

source: There is no semicolon above after the :c:macro:`PyObject_HEAD` macro. Be wary of adding one by accident: some compilers will complain.
es_es: No hay punto y coma encima después de la macro :c:macro:`PyObject_HEAD`. Ten cuidado de añadir uno por accidente: algunos compiladores se quejarán.
pt_pt: Não há ponto e vírgula acima após a macro :c:macro:`PyObject_HEAD`. Tenha cuidado para não adicionar um por engano: alguns compiladores irão reclamar.

source: Of course, objects generally store additional data besides the standard ``PyObject_HEAD`` boilerplate; for example, here is the definition for standard Python floats::
es_es: Por supuesto, los objetos generalmente almacenan datos adicionales además del estándar ``PyObject_HEAD`` boilerplate; por ejemplo, aquí está la definición para los flotadores estándar de Python::
pt_pt: Claro, os objetos geralmente armazenam dados adicionais além do padrão ``PyObject_HEAD``; por exemplo, aqui está a definição para floats Python padrão:

source: The second bit is the definition of the type object. ::
es_es: El segundo bit es la definición del tipo objeto. ::
pt_pt: A segunda parte é a definição do objeto tipo:

source: We recommend using C99-style designated initializers as above, to avoid listing all the :c:type:`PyTypeObject` fields that you don't care about and also to avoid caring about the fields' declaration order.
es_es: Recomendamos utilizar inicializadores designados al estilo de C99, para evitar listar todos los campos de :c:type:`PyTypeObject` que no le interesan y también para evitar preocuparse por el orden de declaración de los campos.
pt_pt: Recomendamos o uso de inicializadores designados no estilo C99 como acima, para evitar listar todos os campos :c:type:`PyTypeObject` que não lhe interessam e também para evitar preocupar-se com a ordem de declaração dos campos.

source: The actual definition of :c:type:`PyTypeObject` in :file:`object.h` has many more :ref:`fields <type-structs>` than the definition above. The remaining fields will be filled with zeros by the C compiler, and it's common practice to not specify them explicitly unless you need them.
es_es: La definición real de :c:type:`PyTypeObject` en :file:`object.h` tiene muchos más campos :ref:` <type-structs>` que la definición anterior. Los campos restantes serán rellenados con ceros por el compilador de C, y es una práctica común no especificarlos explícitamente a menos que los necesite.
pt_pt: A definição real de :c:type:`PyTypeObject` em :file:`object.h` tem muitos mais :ref:`campos <type-structs>` do que a definição acima. Os campos restantes serão preenchidos com zeros pelo compilador C, e é prática comum não os especificar explicitamente, a menos que precise deles.

source: We're going to pick it apart, one field at a time::
es_es: Vamos a desmontarlo, campo por campo::
pt_pt: Vamos analisá-lo, campo a campo:

source: This line is mandatory boilerplate to initialize the ``ob_base`` field mentioned above. ::
es_es: Esta línea es obligatoria para inicializar el campo ``ob_base`` mencionado anteriormente. ::
pt_pt: Esta linha é um código padrão obrigatório para inicializar o campo ``ob_base`` mencionado acima.

source: The name of our type. This will appear in the default textual representation of our objects and in some error messages, for example:
es_es: El nombre de nuestro tipo. Aparecerá en la representación textual por defecto de nuestros objetos y en algunos mensajes de error, por ejemplo:
pt_pt: O nome do nosso tipo. Isto aparecerá na representação textual padrão dos nossos objetos e em algumas mensagens de erro, por exemplo:

source: Note that the name is a dotted name that includes both the module name and the name of the type within the module. The module in this case is :mod:`custom` and the type is :class:`Custom`, so we set the type name to :class:`custom.Custom`. Using the real dotted import path is important to make your type compatible with the :mod:`pydoc` and :mod:`pickle` modules. ::
es_es: Tenga en cuenta que el nombre es un nombre con puntos que incluye tanto el nombre del módulo como el nombre del tipo dentro del módulo. En este caso, el módulo es :mod:`custom` y el tipo es :class:`Custom`, por lo que el nombre del tipo es :class:`custom.Custom`. Es importante utilizar la ruta de importación real con puntos para que el tipo sea compatible con los módulos :mod:`pydoc` y :mod:`pickle`. ::

source: This is so that Python knows how much memory to allocate when creating new :class:`Custom` instances. :c:member:`~PyTypeObject.tp_itemsize` is only used for variable-sized objects and should otherwise be zero.
es_es: Esto es para que Python sepa cuánta memoria debe asignar al crear nuevas instancias de :class:`Custom`. :c:member:`~PyTypeObject.tp_itemsize` sólo se utiliza para objetos de tamaño variable y, en caso contrario, debe ser cero.

source: If you want your type to be subclassable from Python, and your type has the same :c:member:`~PyTypeObject.tp_basicsize` as its base type, you may have problems with multiple inheritance. A Python subclass of your type will have to list your type first in its :attr:`~class.__bases__`, or else it will not be able to call your type's :meth:`__new__` method without getting an error. You can avoid this problem by ensuring that your type has a larger value for :c:member:`~PyTypeObject.tp_basicsize` than its base type does. Most of the time, this will be true anyway, because either your base type will be :class:`object`, or else you will be adding data members to your base type, and therefore increasing its size.
es_es: Si quieres que tu tipo sea subclasificable desde Python, y tu tipo tiene el mismo :c:member:`~PyTypeObject.tp_basicsize` que su tipo base, puedes tener problemas con la herencia múltiple. Una subclase Python de tu tipo tendrá que listar tu tipo primero en su :attr:`~class.__bases__`, o de lo contrario no podrá llamar al método :meth:`__new__` de tu tipo sin obtener un error. Puede evitar este problema asegurándose de que su tipo tiene un valor mayor para :c:member:`~PyTypeObject.tp_basicsize` que su tipo base. La mayoría de las veces, esto será cierto de todas formas, porque o bien tu tipo base será :class:`object`, o bien estarás añadiendo miembros de datos a tu tipo base, y por lo tanto incrementando su tamaño.

source: We set the class flags to :const:`Py_TPFLAGS_DEFAULT`. ::
es_es: Establecemos las banderas de clase en :const:`Py_TPFLAGS_DEFAULT`. ::

source: All types should include this constant in their flags. It enables all of the members defined until at least Python 3.3. If you need further members, you will need to OR the corresponding flags.
es_es: Todos los tipos deben incluir esta constante en sus banderas. Habilita todos los miembros definidos hasta al menos Python 3.3. Si necesita más miembros, necesitará O las banderas correspondientes.
pt_pt: Todos os tipos devem incluir esta constante nas suas flags. Isto ativa todos os membros definidos até pelo menos o Python 3.3. Se precisar de mais membros, precisará de fazer OR com as flags correspondentes.

source: We provide a doc string for the type in :c:member:`~PyTypeObject.tp_doc`. ::
es_es: Proporcionamos una cadena doc para el tipo en :c:member:`~PyTypeObject.tp_doc`. ::
pt_pt: Fornecemos uma string de documentação para o tipo em :c:member:`~PyTypeObject.tp_doc`:

source: To enable object creation, we have to provide a :c:member:`~PyTypeObject.tp_new` handler. This is the equivalent of the Python method :meth:`__new__`, but has to be specified explicitly. In this case, we can just use the default implementation provided by the API function :c:func:`PyType_GenericNew`. ::
es_es: Para permitir la creación de objetos, tenemos que proporcionar un manejador :c:member:`~PyTypeObject.tp_new`. Es el equivalente al método de Python :meth:`__new__`, pero debe especificarse explícitamente. En este caso, podemos utilizar la implementación por defecto proporcionada por la función de la API :c:func:`PyType_GenericNew`. ::

source: Everything else in the file should be familiar, except for some code in :c:func:`PyInit_custom`::
es_es: Todo lo demás en el archivo debe ser familiar, a excepción de un poco de código en :c:func:`PyInit_custom`::

source: This initializes the :class:`Custom` type, filling in a number of members to the appropriate default values, including :attr:`ob_type` that we initially set to ``NULL``. ::
es_es: Esto inicializa el tipo :class:`Custom`, rellenando una serie de miembros con los valores predeterminados apropiados, incluyendo :attr:`ob_type` que inicialmente establecimos en ``NULL``. ::

source: This adds the type to the module dictionary. This allows us to create :class:`Custom` instances by calling the :class:`Custom` class:
es_es: Esto añade el tipo al diccionario del módulo. Esto nos permite crear instancias de :class:`Custom` llamando a la clase :class:`Custom`:

source: That's it! All that remains is to build it; put the above code in a file called :file:`custom.c` and:
es_es: Ya está. Todo lo que queda es construirlo; poner el código anterior en un archivo llamado :file:`custom.c` y:

source: in a file called :file:`setup.py`; then typing
es_es: en un archivo llamado :file:`setup.py`; luego escribiendo
pt_pt: num ficheiro chamado :file:`setup.py`; depois digite

source: at a shell should produce a file :file:`custom.so` in a subdirectory; move to that directory and fire up Python --- you should be able to ``import custom`` and play around with Custom objects.
es_es: en un intérprete de comandos debería producir un archivo :file:`custom.so` en un subdirectorio; vaya a ese directorio y encienda Python --- debería poder ``import custom`` y jugar con objetos personalizados.

source: That wasn't so hard, was it?
es_es: Eso no fue tan difícil, ¿verdad?
pt_pt: Não foi tão difícil, pois não?

source: Of course, the current Custom type is pretty uninteresting. It has no data and doesn't do anything. It can't even be subclassed.
es_es: Por supuesto, el tipo de encargo actual es bastante aburrido. No tiene datos y no hace nada. Ni siquiera se puede subclasificar.
pt_pt: Claro, o tipo Custom atual não é muito interessante. Não tem dados e não faz nada. Não pode nem ser subclassificado.

source: While this documentation showcases the standard :mod:`distutils` module for building C extensions, it is recommended in real-world use cases to use the newer and better-maintained ``setuptools`` library. Documentation on how to do this is out of scope for this document and can be found in the `Python Packaging User's Guide <https://packaging.python.org/tutorials/distributing-packages/>`_.
es_es: Aunque esta documentación muestra el módulo estándar :mod:`distutils` para construir extensiones C, se recomienda en casos de uso en el mundo real utilizar la biblioteca ``setuptools``, más nueva y mejor mantenida. La documentación sobre cómo hacerlo está fuera del alcance de este documento y se puede encontrar en la `Guía del usuario de empaquetado de Python <https://packaging.python.org/tutorials/distributing-packages/>`_.

source: Adding data and methods to the Basic example
es_es: Añadiendo datos y métodos al ejemplo Básico
pt_pt: Adicionar dados e métodos ao exemplo básico

source: Let's extend the basic example to add some data and methods. Let's also make the type usable as a base class. We'll create a new module, :mod:`custom2` that adds these capabilities:
es_es: Vamos a ampliar el ejemplo básico para añadir algunos datos y métodos. También haremos que el tipo sea utilizable como una clase base. Crearemos un nuevo módulo, :mod:`custom2`, que añade estas capacidades.

source: This version of the module has a number of changes.
es_es: Esta versión del módulo tiene varios cambios.
pt_pt: Esta versão do módulo tem várias alterações.

source: We've added an extra include::
es_es: Hemos añadido un include extra::

source: This include provides declarations that we use to handle attributes, as described a bit later.
es_es: Este include proporciona declaraciones que usamos para manejar atributos, como se describe un poco más adelante.

source: The :class:`Custom` type now has three data attributes in its C struct, *first*, *last*, and *number*. The *first* and *last* variables are Python strings containing first and last names. The *number* attribute is a C integer.
es_es: El tipo :class:`Custom` ahora tiene tres atributos de datos en su estructura C, *first*, *last* y *number*. Las variables *first* y *last* son cadenas de texto en Python que contienen nombres y apellidos. El atributo *number* es un entero en C.

source: The object structure is updated accordingly::
es_es: La estructura del objeto se actualiza en consecuencia::
pt_pt: A estrutura do objeto é atualizada de acordo:

source: Because we now have data to manage, we have to be more careful about object allocation and deallocation. At a minimum, we need a deallocation method::
es_es: Porque ahora tenemos datos para gestionar, tenemos que ser más cuidadosos con la asignación y desasignación de objetos. Como mínimo, necesitamos un método de desasignación::
pt_pt: Como agora temos dados para gerir, temos de ser mais cuidadosos com a alocação e desalocação de objetos. No mínimo, precisamos de um método de desalocação:

source: which is assigned to the :c:member:`~PyTypeObject.tp_dealloc` member::
es_es: que se asigna al miembro :c:member:`~PyTypeObject.tp_dealloc`::
pt_pt: que é atribuído ao membro :c:member:`~PyTypeObject.tp_dealloc`:

source: This method first clears the reference counts of the two Python attributes. :c:func:`Py_XDECREF` correctly handles the case where its argument is ``NULL`` (which might happen here if ``tp_new`` failed midway). It then calls the :c:member:`~PyTypeObject.tp_free` member of the object's type (computed by ``Py_TYPE(self)``) to free the object's memory. Note that the object's type might not be :class:`CustomType`, because the object may be an instance of a subclass.
es_es: Este método primero borra los recuentos de referencia de los dos atributos de Python. :c:func:`Py_XDECREF` maneja correctamente el caso en el que su argumento es ``NULL`` (lo cual podría ocurrir aquí si ``tp_new`` falló a mitad de camino). Luego llama al miembro :c:member:`~PyTypeObject.tp_free` del tipo del objeto (calculado por ``Py_TYPE(self)``) para liberar la memoria del objeto. Tenga en cuenta que el tipo del objeto podría no ser :class:`CustomType`, porque el objeto puede ser una instancia de una subclase.

source: The explicit cast to ``destructor`` above is needed because we defined ``Custom_dealloc`` to take a ``CustomObject *`` argument, but the ``tp_dealloc`` function pointer expects to receive a ``PyObject *`` argument. Otherwise, the compiler will emit a warning. This is object-oriented polymorphism, in C!
es_es: La conversión explícita a ``destructor`` es necesaria porque definimos ``Custom_dealloc`` para recibir un argumento ``CustomObject *``, pero el puntero de función ``tp_dealloc`` espera recibir un argumento ``PyObject *``. De lo contrario, el compilador emitirá una advertencia. De lo contrario, el compilador emitirá una advertencia. Esto es polimorfismo orientado a objetos, ¡en C!

source: We want to make sure that the first and last names are initialized to empty strings, so we provide a ``tp_new`` implementation::
es_es: Queremos asegurarnos de que el nombre y los apellidos se inicializan con cadenas vacías, por lo que proporcionamos una implementación ``tp_new``::
pt_pt: Queremos garantir que os primeiros e últimos nomes são inicializados para strings vazias, por isso fornecemos uma implementação ``tp_new``:

source: and install it in the :c:member:`~PyTypeObject.tp_new` member::
es_es: e instalarlo en el miembro :c:member:`~PyTypeObject.tp_new`::
pt_pt: e instalá-lo no membro :c:member:`~PyTypeObject.tp_new`:
