Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/extending/windows.po
Languages: pt_pt, ru

source: Building C and C++ Extensions on Windows
pt_pt: Criar extensões C e C++ no Windows
ru: Создание расширений C и C++ в Windows

source: This chapter briefly explains how to create a Windows extension module for Python using Microsoft Visual C++, and follows with more detailed background information on how it works. The explanatory material is useful for both the Windows programmer learning to build Python extensions and the Unix programmer interested in producing software which can be successfully built on both Unix and Windows.
pt_pt: Este capítulo explica resumidamente como criar um módulo de extensão do Windows para Python utilizando o Microsoft Visual C++ e, em seguida, apresenta informações mais detalhadas sobre como ele funciona. O material explicativo é útil tanto para programadores do Windows que estão a aprender a criar extensões do Python quanto para programadores do Unix interessados em produzir software que possa ser compilado com sucesso tanto no Unix quanto no Windows.
ru: В этой главе кратко объясняется, как создать модуль расширения Windows для Python с использованием Microsoft Visual C++, а затем приводится более подробная справочная информация о том, как он работает. Пояснительный материал полезен как программистам Windows, обучающимся созданию расширений Python, так и программистам Unix, заинтересованным в создании программного обеспечения, которое можно успешно создавать как в Unix, так и в Windows.

source: Module authors are encouraged to use the distutils approach for building extension modules, instead of the one described in this section. You will still need the C compiler that was used to build Python; typically Microsoft Visual C++.
pt_pt: Os autores de módulos são incentivados a usar a abordagem distutils para construir módulos de extensão, em vez da descrita nesta secção. Ainda será necessário o compilador C utilizado para construir o Python; normalmente o Microsoft Visual C++.
ru: Авторам модулей рекомендуется использовать подход distutils для создания модулей расширения вместо того, который описан в этом разделе. Вам по-прежнему понадобится компилятор C, который использовался для сборки Python; обычно Microsoft Visual C++.

source: This chapter mentions a number of filenames that include an encoded Python version number. These filenames are represented with the version number shown as ``XY``; in practice, ``'X'`` will be the major version number and ``'Y'`` will be the minor version number of the Python release you're working with. For example, if you are using Python 2.2.1, ``XY`` will actually be ``22``.
pt_pt: Este capítulo menciona vários nomes de ficheiros que incluem um número de versão Python codificado. Esses nomes de ficheiros são representados com o número da versão mostrado como ``XY``; na prática, ``'X'`` será o número da versão principal e ``'Y'`` será o número da versão secundária da versão Python com a qual está a trabalhar. Por exemplo, se estiver a utilizar o Python 2.2.1, ``XY`` será, na verdade, ``22``.
ru: В этой главе упоминается ряд имен файлов, которые включают закодированный номер версии Python. Эти имена файлов представлены номером версии, обозначенным как ``XY``; на практике X будет основным номером версии, а Y будет младшим номером версии Python, с которой вы работаете. Например, если вы используете Python 2.2.1, ``XY`` на самом деле будет ``22``.

source: A Cookbook Approach
pt_pt: Uma abordagem tipo livro de receitas
ru: Подход с кулинарной книгой

source: There are two approaches to building extension modules on Windows, just as there are on Unix: use the ``setuptools`` package to control the build process, or do things manually. The setuptools approach works well for most extensions; documentation on using ``setuptools`` to build and package extension modules is available in :ref:`setuptools-index`. If you find you really need to do things manually, it may be instructive to study the project file for the :source:`winsound <PCbuild/winsound.vcxproj>` standard library module.
ru: Существует два подхода к созданию модулей расширения в Windows, как и в Unix: использовать пакет ``setuptools`` для управления процессом сборки или делать все вручную. Подход setuptools хорошо работает для большинства расширений; Документация по использованию ``setuptools`` для сборки и упаковки модулей расширения доступна в :ref:`setuptools-index`. Если вы обнаружите, что вам действительно нужно делать что-то вручную, возможно, будет полезно изучить файл проекта стандартного библиотечного модуля :source:`winsound <PCbuild/winsound.vcxproj>`.

source: Differences Between Unix and Windows
pt_pt: Diferenças entre Unix e Windows
ru: Различия между Unix и Windows

source: Unix and Windows use completely different paradigms for run-time loading of code. Before you try to build a module that can be dynamically loaded, be aware of how your system works.
pt_pt: O Unix e o Windows utilizam paradigmas completamente diferentes para o carregamento de código em tempo de execução. Antes de tentar criar um módulo que possa ser carregado dinamicamente, esteja ciente de como o seu sistema funciona.
ru: Unix и Windows используют совершенно разные парадигмы загрузки кода во время выполнения. Прежде чем попытаться создать модуль, который можно будет динамически загружать, узнайте, как работает ваша система.

source: In Unix, a shared object (:file:`.so`) file contains code to be used by the program, and also the names of functions and data that it expects to find in the program. When the file is joined to the program, all references to those functions and data in the file's code are changed to point to the actual locations in the program where the functions and data are placed in memory. This is basically a link operation.
pt_pt: No Unix, um ficheiro objeto partilhado (:file:`.so`) contém código a ser utilizado pelo programa, bem como os nomes das funções e dados que ele espera encontrar no programa. Quando o ficheiro é anexado ao programa, todas as referências a essas funções e dados no código do ficheiro são alteradas para apontar para os locais reais no programa onde as funções e os dados estão colocados na memória. Trata-se basicamente de uma operação de ligação.
ru: В Unix файл общего объекта (:file:`.so`) содержит код, который будет использоваться программой, а также имена функций и данных, которые она ожидает найти в программе. Когда файл присоединяется к программе, все ссылки на эти функции и данные в коде файла изменяются, чтобы указывать на фактические места в программе, где функции и данные размещаются в памяти. По сути, это операция связи.

source: In Windows, a dynamic-link library (:file:`.dll`) file has no dangling references. Instead, an access to functions or data goes through a lookup table. So the DLL code does not have to be fixed up at runtime to refer to the program's memory; instead, the code already uses the DLL's lookup table, and the lookup table is modified at runtime to point to the functions and data.
pt_pt: No Windows, um ficheiro de biblioteca de ligação dinâmica (:file:`.dll`) não tem referências pendentes. Em vez disso, o acesso a funções ou dados é feito através de uma tabela de pesquisa. Assim, o código DLL não precisa de ser corrigido em tempo de execução para se referir à memória do programa; em vez disso, o código já usa a tabela de pesquisa da DLL, e a tabela de pesquisa é modificada em tempo de execução para apontar para as funções e dados.
ru: В Windows файл библиотеки динамической компоновки (:file:`.dll`) не имеет висячих ссылок. Вместо этого доступ к функциям или данным осуществляется через справочную таблицу. Таким образом, код DLL не нужно исправлять во время выполнения, чтобы он мог обращаться к памяти программы; вместо этого код уже использует таблицу поиска DLL, а таблица поиска модифицируется во время выполнения, чтобы указывать на функции и данные.

source: In Unix, there is only one type of library file (:file:`.a`) which contains code from several object files (:file:`.o`). During the link step to create a shared object file (:file:`.so`), the linker may find that it doesn't know where an identifier is defined. The linker will look for it in the object files in the libraries; if it finds it, it will include all the code from that object file.
pt_pt: No Unix, existe apenas um tipo de ficheiro de biblioteca (:file:`.a`) que contém código de vários ficheiros objeto (:file:`.o`). Durante a etapa de ligação para criar um ficheiro objeto partilhado (:file:`.so`), o ligador pode descobrir que não sabe onde um identificador está definido. O ligador irá procurá-lo nos ficheiros objeto nas bibliotecas; se o encontrar, incluirá todo o código desse ficheiro objeto.
ru: В Unix существует только один тип библиотечного файла (:file:`.a`), который содержит код из нескольких объектных файлов (:file:`.o`). На этапе компоновки для создания общего объектного файла (:file:`.so`) компоновщик может обнаружить, что он не знает, где определен идентификатор. Компоновщик будет искать его в объектных файлах библиотек; если он его найдет, он включит весь код из этого объектного файла.

source: In Windows, there are two types of library, a static library and an import library (both called :file:`.lib`). A static library is like a Unix :file:`.a` file; it contains code to be included as necessary. An import library is basically used only to reassure the linker that a certain identifier is legal, and will be present in the program when the DLL is loaded. So the linker uses the information from the import library to build the lookup table for using identifiers that are not included in the DLL. When an application or a DLL is linked, an import library may be generated, which will need to be used for all future DLLs that depend on the symbols in the application or DLL.
pt_pt: No Windows, existem dois tipos de biblioteca: uma biblioteca estática e uma biblioteca de importação (ambas chamadas :file:`.lib`). Uma biblioteca estática é semelhante a um ficheiro :file:`.a` do Unix; contém código a ser incluído conforme necessário. Uma biblioteca de importação é basicamente usada apenas para garantir ao ligador que um determinado identificador é válido e estará presente no programa quando a DLL for carregada. Assim, o vinculador usa as informações da biblioteca de importação para construir a tabela de pesquisa para usar identificadores que não estão incluídos na DLL. Quando uma aplicação ou uma DLL é vinculada, uma biblioteca de importação pode ser gerada, que precisará ser usada para todas as DLLs futuras que dependem dos símbolos na aplicação ou na DLL.
ru: В Windows существует два типа библиотек: статическая библиотека и библиотека импорта (обе называются :file:`.lib`). Статическая библиотека похожа на файл :file:`.a` в Unix; он содержит код, который можно включать при необходимости. Библиотека импорта в основном используется только для того, чтобы убедить компоновщика в том, что определенный идентификатор является допустимым и будет присутствовать в программе при загрузке DLL. Таким образом, компоновщик использует информацию из библиотеки импорта для построения таблицы поиска для использования идентификаторов, не включенных в DLL. Когда приложение или DLL связывается, может быть создана библиотека импорта, которую необходимо будет использовать для всех будущих DLL, которые зависят от символов в приложении или DLL.

source: Suppose you are building two dynamic-load modules, B and C, which should share another block of code A. On Unix, you would *not* pass :file:`A.a` to the linker for :file:`B.so` and :file:`C.so`; that would cause it to be included twice, so that B and C would each have their own copy. In Windows, building :file:`A.dll` will also build :file:`A.lib`. You *do* pass :file:`A.lib` to the linker for B and C. :file:`A.lib` does not contain code; it just contains information which will be used at runtime to access A's code.
pt_pt: Suponha que você esteja a construir dois módulos de carga dinâmica, B e C, que devem partilhar outro bloco de código A. No Unix, você *não* passaria :file:`A.a` para o ligador para :file:`B.so` e :file:`C.so`; isso faria com que fosse incluído duas vezes, de modo que B e C teriam cada um a sua própria cópia. No Windows, a compilação de :file:`A.dll` também compilará :file:`A.lib`. Você *passa* :file:`A.lib` para o vinculador para B e C. :file:`A.lib` não contém código; contém apenas informações que serão usadas em tempo de execução para aceder ao código de A.
ru: Предположим, вы создаете два модуля динамической загрузки, B и C, которые должны совместно использовать другой блок кода A. В Unix вы *не* передаете :file:`Aa` компоновщику для :file:`B.so` и :file:`C.so`; это приведет к тому, что он будет включен дважды, так что у B и C будет своя собственная копия. В Windows сборка :file:`A.dll` также приведет к сборке :file:`A.lib`. Вы *делаете* передачу :file:`A.lib` компоновщику для B и C. :file:`A.lib` не содержит кода; он просто содержит информацию, которая будет использоваться во время выполнения для доступа к коду A.

source: In Windows, using an import library is sort of like using ``import spam``; it gives you access to spam's names, but does not create a separate copy. On Unix, linking with a library is more like ``from spam import *``; it does create a separate copy.
pt_pt: No Windows, usar uma biblioteca de importação é como usar ``import spam``; dá acesso aos nomes do spam, mas não cria uma cópia separada. No Unix, ligar a uma biblioteca é mais como ``from spam import *``; cria uma cópia separada.
ru: В Windows использование библиотеки импорта похоже на использование «импорта спама»; он дает вам доступ к именам спамеров, но не создает отдельную копию. В Unix связывание с библиотекой больше похоже на «импорт спама *»; он создает отдельную копию.

source: Using DLLs in Practice
pt_pt: Utilizar DLLs na prática
ru: Использование DLL на практике

source: Windows Python is built in Microsoft Visual C++; using other compilers may or may not work. The rest of this section is MSVC++ specific.
pt_pt: O Windows Python é compilado no Microsoft Visual C++; o uso de outros compiladores pode ou não funcionar. O restante desta secção é específico do MSVC++.
ru: Windows Python встроен в Microsoft Visual C++; использование других компиляторов может работать, а может и не работать. Остальная часть этого раздела относится только к MSVC++.

source: When creating DLLs in Windows, you must pass :file:`pythonXY.lib` to the linker. To build two DLLs, spam and ni (which uses C functions found in spam), you could use these commands::
ru: При создании DLL в Windows вы должны передать :file:`pythonXY.lib` компоновщику. Чтобы создать две библиотеки DLL, spam и ni (которые используют функции C, найденные в спаме), вы можете использовать следующие команды:

source: The first command created three files: :file:`spam.obj`, :file:`spam.dll` and :file:`spam.lib`. :file:`Spam.dll` does not contain any Python functions (such as :c:func:`PyArg_ParseTuple`), but it does know how to find the Python code thanks to :file:`pythonXY.lib`.
pt_pt: O primeiro comando criou três ficheiros: :file:`spam.obj`, :file:`spam.dll` e :file:`spam.lib`. :file:`Spam.dll` não contém nenhuma função Python (como :c:func:`PyArg_ParseTuple`), mas sabe como encontrar o código Python graças ao :file:`pythonXY.lib`.
ru: Первая команда создала три файла: :file:`spam.obj`, :file:`spam.dll` и :file:`spam.lib`. :file:`Spam.dll` не содержит никаких функций Python (таких как :c:func:`PyArg_ParseTuple`), но знает, как найти код Python благодаря :file:`pythonXY.lib`.

source: The second command created :file:`ni.dll` (and :file:`.obj` and :file:`.lib`), which knows how to find the necessary functions from spam, and also from the Python executable.
pt_pt: O segundo comando criou :file:`ni.dll` (e :file:`.obj` e :file:`.lib`), que sabe como encontrar as funções necessárias a partir do spam e também do executável Python.
ru: Вторая команда создала :file:`ni.dll` (а также :file:`.obj` и :file:`.lib`), который умеет находить нужные функции в спаме, а также в исполняемом файле Python.

source: Not every identifier is exported to the lookup table. If you want any other modules (including Python) to be able to see your identifiers, you have to say ``_declspec(dllexport)``, as in ``void _declspec(dllexport) initspam(void)`` or ``PyObject _declspec(dllexport) *NiGetSpamData(void)``.
pt_pt: Nem todos os identificadores são exportados para a tabela de pesquisa. Se quiser que outros módulos (incluindo Python) possam ver os seus identificadores, tem de indicar ``_declspec(dllexport)``, como em ``void _declspec(dllexport) initspam(void)`` ou ``PyObject _declspec(dllexport) *NiGetSpamData(void)``.
ru: Не каждый идентификатор экспортируется в таблицу поиска. Если вы хотите, чтобы другие модули (включая Python) могли видеть ваши идентификаторы, вам нужно сказать ``_declspec(dllexport)``, например ``void _declspec(dllexport) initspam(void)`` или ``PyObject _declspec(dllexport) *NiGetSpamData(void)``.

source: Developer Studio will throw in a lot of import libraries that you do not really need, adding about 100K to your executable. To get rid of them, use the Project Settings dialog, Link tab, to specify *ignore default libraries*. Add the correct :file:`msvcrt{xx}.lib` to the list of libraries.
pt_pt: O Developer Studio irá incluir muitas bibliotecas de importação que não são realmente necessárias, adicionando cerca de 100K ao seu executável. Para se livrar delas, use a caixa de diálogo Project Settings (Configurações do projeto), guia Link (Ligação), para especificar *ignore default libraries* (ignorar bibliotecas padrão). Adicione o :file:`msvcrt{xx}.lib` correto à lista de bibliotecas.
ru: Developer Studio добавит множество библиотек импорта, которые вам на самом деле не нужны, добавив около 100 КБ к вашему исполняемому файлу. Чтобы избавиться от них, используйте диалоговое окно «Настройки проекта» на вкладке «Ссылка» и укажите *игнорировать библиотеки по умолчанию*. Добавьте правильный :file:`msvcrt{xx}.lib` в список библиотек.
