Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/faq/extending.po
Languages: es_es, ru

source: Extending/Embedding FAQ
es_es: Preguntas frecuentes Extensión/Incrustación
ru: ЧаВО по расширению/встраиванию

source: Contents
es_es: Contenido
ru: Содержание

source: Can I create my own functions in C?
es_es: ¿Puedo crear mis propias funciones en C?
ru: Могу ли я создавать свои собственные функции на C?

source: Yes, you can create built-in modules containing functions, variables, exceptions and even new types in C. This is explained in the document :ref:`extending-index`.
es_es: Sí, puedes crear módulos integrados que contengan funciones, variables, excepciones e incluso nuevos tipos en C. Esto se explica en el documento :ref:`extending-index`.
ru: Да, вы можете создавать встроенные модули, содержащие функции, переменные, исключения и даже новые типы в C. Это объясняется в документе :ref:`extending-index`.

source: Most intermediate or advanced Python books will also cover this topic.
es_es: La mayoría de los libros de Python intermedios o avanzados también tratarán este tema.
ru: Большинство книг по Python среднего или продвинутого уровня также охватывают эту тему.

source: Can I create my own functions in C++?
es_es: ¿Puedo crear mis propias funciones en C++?
ru: Могу ли я создавать свои собственные функции на C++?

source: Yes, using the C compatibility features found in C++. Place ``extern "C" { ... }`` around the Python include files and put ``extern "C"`` before each function that is going to be called by the Python interpreter. Global or static C++ objects with constructors are probably not a good idea.
es_es: Sí, utilizando las características de compatibilidad con C que se encuentran en C++. Coloca ``extern "C" { ... }`` alrededor de los archivos de inclusión de Python y pon ``extern "C"`` antes de cada función que vaya a ser llamada por el intérprete de Python. Los objetos C++ globales o estáticos con constructores no son probablemente una buena idea.
ru: Да, используя функции совместимости C, имеющиеся в C++. Поместите ``extern "C" { ... }`` вокруг включаемых файлов Python и поместите ``extern "C"`` перед каждой функцией, которая будет вызываться интерпретатором Python. Глобальные или статические объекты C++ с конструкторами, вероятно, не являются хорошей идеей.

source: Writing C is hard; are there any alternatives?
es_es: Escribir en C es difícil; ¿existen alternativas?
ru: Писать на C сложно - есть ли какие-нибудь альтернативы?

source: There are a number of alternatives to writing your own C extensions, depending on what you're trying to do.
es_es: Hay varias alternativas a escribir tus propias extensiones en C, dependiendo de lo que estés intentando hacer.
ru: Существует множество альтернатив написанию собственных расширений C, в зависимости от того, что вы пытаетесь сделать.

source: `Cython <https://cython.org>`_ and its relative `Pyrex <https://www.cosc.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ are compilers that accept a slightly modified form of Python and generate the corresponding C code. Cython and Pyrex make it possible to write an extension without having to learn Python's C API.
es_es: `Cython <https://cython.org>`_ y su pariente `Pyrex <https://www.cosc.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ son compiladores que aceptan una forma ligeramente modificada de Python y generan el código C correspondiente. Cython y Pyrex hacen posible escribir una extensión sin tener que aprender la API en C de Python.

source: If you need to interface to some C or C++ library for which no Python extension currently exists, you can try wrapping the library's data types and functions with a tool such as `SWIG <https://www.swig.org>`_. `SIP <https://riverbankcomputing.com/software/sip/intro>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs/python/doc/index.html>`_, or `Weave <https://github.com/scipy/weave>`_ are also alternatives for wrapping C++ libraries.
es_es: Si necesitas interactuar con alguna biblioteca de C o C++ para la cual no existe actualmente una extensión de Python, puedes intentar envolver los tipos de datos y funciones de la biblioteca con una herramienta como `SWIG <https://www.swig.org>`_. `SIP <https://riverbankcomputing.com/software/sip/intro>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs/python/doc/index.html>`_ o `Weave <https://github.com/scipy/weave>`_ también son alternativas para envolver bibliotecas de C++.

source: How can I execute arbitrary Python statements from C?
es_es: ¿Cómo puedo ejecutar declaraciones arbitrarias de Python desde C?
ru: Как я могу выполнить произвольные инструкции Python из C?

source: The highest-level function to do this is :c:func:`PyRun_SimpleString` which takes a single string argument to be executed in the context of the module ``__main__`` and returns ``0`` for success and ``-1`` when an exception occurred (including :exc:`SyntaxError`). If you want more control, use :c:func:`PyRun_String`; see the source for :c:func:`PyRun_SimpleString` in ``Python/pythonrun.c``.
es_es: La función de más alto nivel para hacer esto es :c:func:`PyRun_SimpleString` que toma un único argumento de cadena para ejecutarse en el contexto del módulo ``__main__`` y devuelve ``0`` en caso de éxito y ``-1`` cuando se produce una excepción (incluyendo :exc:`SyntaxError`). Si desea un mayor control, use :c:func:`PyRun_String`; ver el código fuente de :c:func:`PyRun_SimpleString` en ``Python/pythonrun.c``.
ru: Функция самого высокого уровня для этого — :c:func:`PyRun_SimpleString`, которая принимает один строковый аргумент для выполнения в контексте модуля ``__main__`` и возвращает ``0`` в случае успеха и ``- 1`` при возникновении исключения (включая :exc:`SyntaxError`). Если вам нужен больший контроль, используйте :c:func:`PyRun_String`; см. исходный код :c:func:`PyRun_SimpleString` в ``Python/pythonrun.c``.

source: How can I evaluate an arbitrary Python expression from C?
es_es: ¿Cómo puedo evaluar una expresión arbitraria de Python desde C?
ru: Как я могу вычислить произвольное выражение Python из C?

source: Call the function :c:func:`PyRun_String` from the previous question with the start symbol :c:data:`Py_eval_input`; it parses an expression, evaluates it and returns its value.
es_es: Llama a la función :c:func:`PyRun_String` de la pregunta anterior con el símbolo de inicio :c:data:`Py_eval_input`; analiza una expresión, la evalúa y devuelve su valor.
ru: Вызовите функцию :c:func:`PyRun_String` из предыдущего вопроса со стартовым символом :c:data:`Py_eval_input`; он анализирует выражение, оценивает его и возвращает его значение.

source: How do I extract C values from a Python object?
es_es: ¿Cómo extraigo los valores C de un objeto Python?
ru: Как мне извлечь значения C из объекта Python?

source: That depends on the object's type. If it's a tuple, :c:func:`PyTuple_Size` returns its length and :c:func:`PyTuple_GetItem` returns the item at a specified index. Lists have similar functions, :c:func:`PyListSize` and :c:func:`PyList_GetItem`.
es_es: Eso depende del tipo de objeto. Si es una tupla, :c:func:`PyTuple_Size` devuelve su longitud y :c:func:`PyTuple_GetItem` devuelve el elemento en un índice especificado. Las listas tienen funciones similares, :c:func:`PyListSize` y :c:func:`PyList_GetItem`.

source: For bytes, :c:func:`PyBytes_Size` returns its length and :c:func:`PyBytes_AsStringAndSize` provides a pointer to its value and its length. Note that Python bytes objects may contain null bytes so C's :c:func:`strlen` should not be used.
es_es: Para bytes, :c:func:`PyBytes_Size` devuelve su longitud y :c:func:`PyBytes_AsStringAndSize` proporciona un puntero a su valor y su longitud. Tenga en cuenta que los objetos bytes de Python pueden contener bytes nulos, por lo que no se debe usar :c:func:`strlen` de C.

source: To test the type of an object, first make sure it isn't ``NULL``, and then use :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, etc.
es_es: Para probar el tipo de un objeto, primero asegúrese de que no sea ``NULL``, y luego use :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, etc.
ru: Чтобы проверить тип объекта, сначала убедитесь, что он не NULL, а затем используйте :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check` , и т. д.

source: There is also a high-level API to Python objects which is provided by the so-called 'abstract' interface -- read ``Include/abstract.h`` for further details. It allows interfacing with any kind of Python sequence using calls like :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, etc. as well as many other useful protocols such as numbers (:c:func:`PyNumber_Index` et al.) and mappings in the PyMapping APIs.
es_es: También hay una API de alto nivel para objetos de Python que es proporcionada por la llamada interfaz 'abstracta' -- leer ``Include/abstract.h`` para más detalles. Permite la interfaz con cualquier tipo de secuencia de Python utilizando llamadas como :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, etc. así como muchos otros protocolos útiles como números (:c:func:`PyNumber_Index` et al.) y mapeos en las APIs de PyMapping.
ru: Существует также высокоуровневый API для объектов Python, который предоставляется так называемым «абстрактным» интерфейсом — для получения более подробной информации прочитайте ``Include/abstract.h``. Он позволяет взаимодействовать с любым типом последовательности Python, используя такие вызовы, как :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem` и т. д., а также многие другие полезные протоколы, такие как числа (:c:func:`PyNumber_Index). ` и др.) и сопоставления в API PyMapping.

source: How do I use Py_BuildValue() to create a tuple of arbitrary length?
es_es: ¿Cómo uso Py_BuildValue() para crear una tupla de longitud arbitraria?
ru: Как использовать Py_BuildValue() для создания кортежа произвольной длины?

source: You can't. Use :c:func:`PyTuple_Pack` instead.
es_es: No puedes. Usa :c:func:`PyTuple_Pack` en su lugar.
ru: Ты не можешь. Вместо этого используй :c:func:`PyTuple_Pack`.

source: How do I call an object's method from C?
es_es: ¿Cómo llamo al método de un objeto desde C?
ru: Как мне вызвать метод объекта из C?

source: The :c:func:`PyObject_CallMethod` function can be used to call an arbitrary method of an object. The parameters are the object, the name of the method to call, a format string like that used with :c:func:`Py_BuildValue`, and the argument values::
es_es: La función :c:func:`PyObject_CallMethod` se puede utilizar para llamar a un método arbitrario de un objeto. Los parámetros son el objeto, el nombre del método a llamar, una cadena de formato similar a la utilizada con :c:func:`Py_BuildValue`, y los valores de los argumentos::
ru: Функцию :c:func:`PyObject_CallMethod` можно использовать для вызова произвольного метода объекта. Параметры — это объект, имя вызываемого метода, строка формата, подобная той, которая используется с :c:func:`Py_BuildValue`, и значения аргументов::

source: This works for any object that has methods -- whether built-in or user-defined. You are responsible for eventually :c:func:`Py_DECREF`\ 'ing the return value.
es_es: Esto funciona para cualquier objeto que tenga métodos, ya sean incorporados o definidos por el usuario. Eres responsable de eventualmente :c:func:`Py_DECREF`\ 'ing el valor de retorno.
ru: Это работает для любого объекта, у которого есть методы — встроенные или определяемые пользователем. Вы несете ответственность за окончательную обработку возвращаемого значения.

source: To call, e.g., a file object's "seek" method with arguments 10, 0 (assuming the file object pointer is "f")::
es_es: Para llamar, por ejemplo, el método "seek" de un objeto de archivo con los argumentos 10, 0 (suponiendo que el puntero del objeto de archivo es "f")::
ru: Чтобы вызвать, например, метод "seek" файлового объекта с аргументами 10, 0 (при условии, что указатель файлового объекта равен "f"):

source: Note that since :c:func:`PyObject_CallObject` *always* wants a tuple for the argument list, to call a function without arguments, pass "()" for the format, and to call a function with one argument, surround the argument in parentheses, e.g. "(i)".
es_es: Tenga en cuenta que, dado que :c:func:`PyObject_CallObject` *siempre* requiere una tupla para la lista de argumentos, para llamar a una función sin argumentos, pase "()" para el formato, y para llamar a una función con un argumento, rodee el argumento entre paréntesis, por ejemplo, "(i)".
ru: Обратите внимание: поскольку :c:func:`PyObject_CallObject` *всегда* требует кортеж для списка аргументов, для вызова функции без аргументов передайте "()" в качестве формата, а для вызова функции с одним аргументом окружите аргумент в скобках, например «(i)».

source: How do I catch the output from PyErr_Print() (or anything that prints to stdout/stderr)?
es_es: ¿Cómo puedo capturar la salida de PyErr_Print() (o cualquier cosa que imprima en stdout/stderr)?
ru: Как мне перехватить вывод PyErr_Print() (или чего-либо, что печатает на стандартный вывод/stderr)?

source: In Python code, define an object that supports the ``write()`` method. Assign this object to :data:`sys.stdout` and :data:`sys.stderr`. Call print_error, or just allow the standard traceback mechanism to work. Then, the output will go wherever your ``write()`` method sends it.
es_es: En el código de Python, define un objeto que admita el método ``write()``. Asigna este objeto a :data:`sys.stdout` y :data:`sys.stderr`. Llama a print_error, o simplemente permite que el mecanismo de seguimiento estándar funcione. Luego, la salida irá donde tu método ``write()`` la envíe.
ru: В коде Python определите объект, поддерживающий метод write(). Назначьте этот объект :data:`sys.stdout` и :data:`sys.stderr`. Вызовите print_error или просто разрешите работу стандартному механизму трассировки. Затем выходные данные будут отправлены туда, куда их отправит ваш метод write().

source: The easiest way to do this is to use the :class:`io.StringIO` class:
es_es: La forma más fácil de hacer esto es usar la clase :class:`io.StringIO`.
ru: Самый простой способ сделать это — использовать класс :class:`io.StringIO`:

source: A custom object to do the same would look like this:
es_es: Un objeto personalizado para hacer lo mismo se vería así:
ru: Пользовательский объект, делающий то же самое, будет выглядеть так:

source: How do I access a module written in Python from C?
es_es: ¿Cómo accedo a un módulo escrito en Python desde C?
ru: Как мне получить доступ к модулю, написанному на Python, из C?

source: You can get a pointer to the module object as follows::
es_es: Puede obtener un puntero al objeto del módulo de la siguiente manera:
ru: Вы можете получить указатель на объект модуля следующим образом:

source: If the module hasn't been imported yet (i.e. it is not yet present in :data:`sys.modules`), this initializes the module; otherwise it simply returns the value of ``sys.modules["<modulename>"]``. Note that it doesn't enter the module into any namespace -- it only ensures it has been initialized and is stored in :data:`sys.modules`.
es_es: Si el módulo aún no ha sido importado (es decir, no está presente en :data:`sys.modules`), esto inicializa el módulo; de lo contrario, simplemente devuelve el valor de ``sys.modules["<modulename>"]``. Tenga en cuenta que no ingresa el módulo en ningún espacio de nombres, solo se asegura de que se haya inicializado y se almacene en :data:`sys.modules`.
ru: Если модуль еще не импортирован (т.е. он еще не присутствует в :data:`sys.modules`), это инициализирует модуль; в противном случае он просто возвращает значение ``sys.modules["<имя_модуля>"]``. Обратите внимание, что он не помещает модуль в какое-либо пространство имен — он лишь гарантирует, что он был инициализирован и сохранен в :data:`sys.modules`.

source: You can then access the module's attributes (i.e. any name defined in the module) as follows::
es_es: Puede acceder a los atributos del módulo (es decir, cualquier nombre definido en el módulo) de la siguiente manera:
ru: Затем вы можете получить доступ к атрибутам модуля (т. е. к любому имени, определенному в модуле) следующим образом:

source: Calling :c:func:`PyObject_SetAttrString` to assign to variables in the module also works.
es_es: Llamando a :c:func:`PyObject_SetAttrString` para asignar a variables en el módulo también funciona.
ru: Вызов :c:func:`PyObject_SetAttrString` для присвоения переменных в модуле также работает.

source: How do I interface to C++ objects from Python?
es_es: ¿Cómo interactúo con objetos C++ desde Python?
ru: Как мне взаимодействовать с объектами C++ из Python?

source: Depending on your requirements, there are many approaches. To do this manually, begin by reading :ref:`the "Extending and Embedding" document <extending-index>`. Realize that for the Python run-time system, there isn't a whole lot of difference between C and C++ -- so the strategy of building a new Python type around a C structure (pointer) type will also work for C++ objects.
es_es: Dependiendo de tus requisitos, hay muchos enfoques. Para hacer esto manualmente, comienza leyendo el documento :ref:`the "Extending and Embedding" document `. Date cuenta de que para el sistema de tiempo de ejecución de Python, no hay mucha diferencia entre C y C++ -- por lo que la estrategia de construir un nuevo tipo de Python alrededor de un tipo de estructura C (puntero) también funcionará para objetos de C++.
ru: В зависимости от ваших требований существует множество подходов. Чтобы сделать это вручную, начните с чтения :ref:`документа «Расширение и встраивание» <extending-index>`. Помните, что для системы времени выполнения Python нет большой разницы между C и C++, поэтому стратегия создания нового типа Python на основе типа структуры (указателя) C также будет работать для объектов C++.

source: For C++ libraries, see :ref:`c-wrapper-software`.
es_es: Para bibliotecas de C++, ver :ref:`c-wrapper-software`.
ru: О библиотеках C++ см. :ref:`c-wrapper-software`.

source: I added a module using the Setup file and the make fails; why?
es_es: He añadido un módulo utilizando el archivo Setup y make falla; ¿por qué?
ru: Я добавил модуль, используя файл установки, и сборка завершилась неудачно; почему?

source: Setup must end in a newline, if there is no newline there, the build process fails. (Fixing this requires some ugly shell script hackery, and this bug is so minor that it doesn't seem worth the effort.)
es_es: La configuración debe terminar en una nueva línea, si no hay una nueva línea, el proceso de construcción falla. (Arreglar esto requiere un poco de trucos feos de script de shell, y este error es tan menor que no parece valer la pena el esfuerzo.)
ru: Установка должна заканчиваться новой строкой; если новой строки нет, процесс сборки завершится неудачей. (Чтобы это исправить, требуется какой-то уродливый хакерский сценарий оболочки, и эта ошибка настолько незначительна, что, похоже, не стоит затрачиваемых усилий.)

source: How do I debug an extension?
es_es: ¿Cómo depuro una extensión?
ru: Как отладить расширение?

source: When using GDB with dynamically loaded extensions, you can't set a breakpoint in your extension until your extension is loaded.
es_es: Cuando se utiliza GDB con extensiones cargadas dinámicamente, no se puede establecer un punto de interrupción en la extensión hasta que la extensión esté cargada.
ru: При использовании GDB с динамически загружаемыми расширениями вы не можете установить точку останова в своем расширении, пока ваше расширение не будет загружено.

source: In your ``.gdbinit`` file (or interactively), add the command:
es_es: En su archivo ``.gdbinit`` (o interactivamente), añada el comando:
ru: В файл ``.gdbinit`` (или в интерактивном режиме) добавьте команду:

source: Then, when you run GDB:
es_es: Entonces, cuando ejecutes GDB:
ru: Затем, когда вы запустите GDB:

source: I want to compile a Python module on my Linux system, but some files are missing. Why?
es_es: Quiero compilar un módulo de Python en mi sistema Linux, pero faltan algunos archivos. ¿Por qué?
ru: Я хочу скомпилировать модуль Python в своей системе Linux, но некоторые файлы отсутствуют. Почему?

source: Most packaged versions of Python don't include the :file:`/usr/lib/python2.{x}/config/` directory, which contains various files required for compiling Python extensions.
es_es: La mayoría de las versiones empaquetadas de Python no incluyen el directorio :file:`/usr/lib/python2.{x}/config/`, que contiene varios archivos necesarios para compilar extensiones de Python.

source: For Red Hat, install the python-devel RPM to get the necessary files.
es_es: Para Red Hat, instale el RPM python-devel para obtener los archivos necesarios.

source: For Debian, run ``apt-get install python-dev``.
es_es: Para Debian, ejecute ``apt-get install python-dev``.

source: How do I tell "incomplete input" from "invalid input"?
es_es: ¿Cómo diferencio "entrada incompleta" de "entrada no válida"?
ru: Как отличить «неполный ввод» от «неверного ввода»?

source: Sometimes you want to emulate the Python interactive interpreter's behavior, where it gives you a continuation prompt when the input is incomplete (e.g. you typed the start of an "if" statement or you didn't close your parentheses or triple string quotes), but it gives you a syntax error message immediately when the input is invalid.
es_es: A veces quieres emular el comportamiento del intérprete interactivo de Python, que te da un mensaje de continuación cuando la entrada está incompleta (por ejemplo, has escrito el principio de una sentencia "if" o no has cerrado los paréntesis o las comillas triples), pero te da un mensaje de error sintáctico inmediatamente cuando la entrada no es válida.
ru: Иногда вам нужно имитировать поведение интерактивного интерпретатора Python, когда он выдает приглашение на продолжение, если ввод неполный (например, вы ввели начало оператора «if» или не закрыли круглые скобки или тройные строковые кавычки), но он сразу же выдает сообщение о синтаксической ошибке, когда ввод недействителен.

source: In Python you can use the :mod:`codeop` module, which approximates the parser's behavior sufficiently. IDLE uses this, for example.
es_es: En Python se puede utilizar el módulo :mod:`codeop`, que aproxima suficientemente el comportamiento del analizador sintáctico. IDLE lo utiliza, por ejemplo.
ru: В Python вы можете использовать модуль :mod:`codeop`, который в достаточной степени аппроксимирует поведение парсера. IDLE использует это, например.

source: The easiest way to do it in C is to call :c:func:`PyRun_InteractiveLoop` (perhaps in a separate thread) and let the Python interpreter handle the input for you. You can also set the :c:func:`PyOS_ReadlineFunctionPointer` to point at your custom input function. See ``Modules/readline.c`` and ``Parser/myreadline.c`` for more hints.
es_es: La forma más fácil de hacerlo en C es llamar a :c:func:`PyRun_InteractiveLoop` (quizás en un hilo separado) y dejar que el intérprete de Python maneje la entrada por ti. También puedes configurar :c:func:`PyOS_ReadlineFunctionPointer` para que apunte a tu función de entrada personalizada. Vea ``Modules/readline.c`` y ``Parser/myreadline.c`` para más consejos.
ru: Самый простой способ сделать это в C — вызвать :c:func:`PyRun_InteractiveLoop` (возможно, в отдельном потоке) и позволить интерпретатору Python обработать ввод за вас. Вы также можете установить :c:func:`PyOS_ReadlineFunctionPointer` так, чтобы он указывал на вашу пользовательскую функцию ввода. Дополнительные подсказки смотрите в ``Modules/readline.c`` и ``Parser/myreadline.c``.
