Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/faq/extending.po
Languages: es_es, ru

source: How do I find undefined g++ symbols __builtin_new or __pure_virtual?
es_es: ¿Cómo encuentro los símbolos indefinidos de g++ __builtin_new o __pure_virtual?
ru: Как найти неопределенные символы g++ __builtin_new или __pure_virtual?

source: To dynamically load g++ extension modules, you must recompile Python, relink it using g++ (change LINKCC in the Python Modules Makefile), and link your extension module using g++ (e.g., ``g++ -shared -o mymodule.so mymodule.o``).
es_es: Para cargar dinámicamente módulos de extensión de g++, debe recompilar Python, volver a enlazarlo usando g++ (cambie LINKCC en el Makefile de Módulos de Python), y enlazar su módulo de extensión usando g++ (por ejemplo, ``g++ -shared -o mymodule.so mymodule.o``).
ru: Чтобы динамически загружать модули расширения g++, вы должны перекомпилировать Python, повторно связать его с помощью g++ (изменить LINKCC в Makefile модулей Python) и связать свой модуль расширения с помощью g++ (например, ``g++ -shared -o mymodule.so mymodule.o` `).

source: Can I create an object class with some methods implemented in C and others in Python (e.g. through inheritance)?
es_es: ¿Puedo crear una clase de objeto con algunos métodos implementados en C y otros en Python (por ejemplo, a través de la herencia)?
ru: Могу ли я создать класс объекта, в котором некоторые методы реализованы на C, а другие — на Python (например, посредством наследования)?

source: Yes, you can inherit from built-in classes such as :class:`int`, :class:`list`, :class:`dict`, etc.
es_es: Sí, puede heredar de clases incorporadas como :class:`int`, :class:`list`, :class:`dict`, etc.
ru: Да, вы можете наследовать от встроенных классов, таких как :class:`int`, :class:`list`, :class:`dict` и т. д.

source: The Boost Python Library (BPL, https://www.boost.org/libs/python/doc/index.html) provides a way of doing this from C++ (i.e. you can inherit from an extension class written in C++ using the BPL).
es_es: La biblioteca Boost Python Library (BPL, https://www.boost.org/libs/python/doc/index.html) ofrece una forma de hacerlo desde C++ (es decir, se puede heredar de una clase de extensión escrita en C++ utilizando la BPL).
ru: Библиотека Boost Python (BPL, https://www.boost.org/libs/python/doc/index.html) предоставляет способ сделать это из C++ (т. е. вы можете наследовать класс расширения, написанный на C++, используя BPL ).

source: `Cython <https://cython.org>`_ and its relative `Pyrex <https://www.csse.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ are compilers that accept a slightly modified form of Python and generate the corresponding C code. Cython and Pyrex make it possible to write an extension without having to learn Python's C API.
ru: `Cython <https://cython.org>`_ и его родственник `Pyrex <https://www.csse.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ являются компиляторами, которые принимают слегка модифицированную форму Python и сгенерировать соответствующий код C. Cython и Pyrex позволяют писать расширения без необходимости изучения C API Python.

source: If you need to interface to some C or C++ library for which no Python extension currently exists, you can try wrapping the library's data types and functions with a tool such as `SWIG <https://www.swig.org>`_. `SIP <https://github.com/Python-SIP/sip>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs/python/doc/index.html>`_, or `Weave <https://github.com/scipy/weave>`_ are also alternatives for wrapping C++ libraries.
ru: Если вам нужно взаимодействовать с какой-либо библиотекой C или C++, для которой в настоящее время не существует расширения Python, вы можете попробовать обернуть типы данных и функции библиотеки с помощью такого инструмента, как `SWIG <https://www.swig.org>`_. `SIP <https://github.com/Python-SIP/sip>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs /python/doc/index.html>`_ или `Weave <https://github.com/scipy/weave>`_ также являются альтернативами для упаковки библиотек C++.

source: That depends on the object's type. If it's a tuple, :c:func:`PyTuple_Size` returns its length and :c:func:`PyTuple_GetItem` returns the item at a specified index. Lists have similar functions, :c:func:`PyList_Size` and :c:func:`PyList_GetItem`.
ru: Это зависит от типа объекта. Если это кортеж, :c:func:`PyTuple_Size` возвращает его длину, а :c:func:`PyTuple_GetItem` возвращает элемент по указанному индексу. Списки имеют схожие функции: :c:func:`PyList_Size` и :c:func:`PyList_GetItem`.

source: For bytes, :c:func:`PyBytes_Size` returns its length and :c:func:`PyBytes_AsStringAndSize` provides a pointer to its value and its length. Note that Python bytes objects may contain null bytes so C's :c:func:`!strlen` should not be used.
ru: Для байтов :c:func:`PyBytes_Size` возвращает их длину, а :c:func:`PyBytes_AsStringAndSize` предоставляет указатель на их значение и длину. Обратите внимание, что байтовые объекты Python могут содержать нулевые байты, поэтому не следует использовать C :c:func:`!strlen`.
