Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/faq/general.po
Languages: pt_pt

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
pt_pt: Também pode procurar livrarias online por "Python" e filtrar as referências ao Monty Python; ou talvez procurar por "Python" e "linguagem".

source: Where in the world is www.python.org located?
pt_pt: Onde está localizado o www.python.org?

source: The Python project's infrastructure is located all over the world and is managed by the Python Infrastructure Team. Details `here <https://infra.psf.io>`__.
pt_pt: A infraestrutura do projeto Python está localizada em todo o mundo e é gerida pela Equipa de Infraestrutura Python. Detalhes `aqui <https://infra.psf.io>`__.

source: Why is it called Python?
pt_pt: Por que se chama Python?

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
pt_pt: Quando começou a implementar o Python, Guido van Rossum também estava a ler os guiões publicados de `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, uma série de comédia da BBC dos anos 1970s. Van Rossum pensou que precisava de um nome curto, único e ligeiramente misterioso, por isso decidiu chamar à linguagem Python.

source: Do I have to like "Monty Python's Flying Circus"?
pt_pt: Tenho de gostar de "Monty Python's Flying Circus"?

source: No, but it helps. :)
pt_pt: Não, mas ajuda. :)

source: Python in the real world
pt_pt: Python no mundo real

source: How stable is Python?
pt_pt: Quão estável é o Python?

source: Very stable. New, stable releases have been coming out roughly every 6 to 18 months since 1991, and this seems likely to continue. As of version 3.9, Python will have a new feature release every 12 months (:pep:`602`).
pt_pt: Muito estável. Novas versões estáveis têm sido lançadas aproximadamente a cada 6 a 18 meses desde 1991, e parece provável que isto continue. A partir da versão 3.9, o Python terá um novo lançamento de funcionalidades a cada 12 meses (:pep:`602`).

source: The developers issue bugfix releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
pt_pt: Os programadores emitem lançamentos de correção de erros de versões mais antigas, pelo que a estabilidade das versões existentes melhora gradualmente. Os lançamentos de correção de erros, indicados por um terceiro componente do número de versão (por exemplo, 3.5.3, 3.6.2), são geridos para estabilidade; apenas são incluídas correções para problemas conhecidos num lançamento de correção de erros, e é garantido que as interfaces permanecem as mesmas ao longo de uma série de lançamentos de correção de erros.

source: How many people are using Python?
pt_pt: Quantas pessoas usam o Python?

source: There are probably millions of users, though it's difficult to obtain an exact count.
pt_pt: Provavelmente milhões de utilizadores, embora seja difícil obter uma contagem exata.

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
pt_pt: O Python está disponível para descarregamento gratuito, pelo que não há dados de vendas, e está disponível em muitos sites diferentes e incluído em muitas distribuições Linux, pelo que as estatísticas de descarregamento também não contam toda a história.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
pt_pt: O grupo de notícias comp.lang.python é muito ativo, mas nem todos os utilizadores do Python publicam no grupo ou sequer o leem.

source: Have any significant projects been done in Python?
pt_pt: Foram realizados projetos significativos em Python?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
pt_pt: Consulte https://www.python.org/about/success para ver uma lista de projetos que usam o Python. Consultar as atas de `conferências anteriores do Python <https://www.python.org/community/workshops/>`_ revelará contribuições de muitas empresas e organizações diferentes.

source: High-profile Python projects include `the Mailman mailing list manager <https://www.list.org>`_ and `the Zope application server <https://www.zope.dev>`_. Several Linux distributions, most notably `Red Hat <https://www.redhat.com>`_, have written part or all of their installer and system administration software in Python. Companies that use Python internally include Google, Yahoo, and Lucasfilm Ltd.
pt_pt: Projetos de destaque em Python incluem o `gestor de listas de correio Mailman <https://www.list.org>`_ e o `servidor de aplicações Zope <https://www.zope.dev>`_. Várias distribuições Linux, nomeadamente a `Red Hat <https://www.redhat.com>`_, escreveram parte ou toda a sua software de instalação e administração de sistema em Python. Empresas que usam o Python internamente incluem a Google, a Yahoo e a Lucasfilm Ltd.

source: What new developments are expected for Python in the future?
pt_pt: Quais são os novos desenvolvimentos esperados para o Python no futuro?

source: See https://peps.python.org/ for the Python Enhancement Proposals (PEPs). PEPs are design documents describing a suggested new feature for Python, providing a concise technical specification and a rationale. Look for a PEP titled "Python X.Y Release Schedule", where X.Y is a version that hasn't been publicly released yet.
pt_pt: Consulte https://peps.python.org/ para ver as Propostas de Melhoria do Python (PEPs). As PEPs são documentos de design que descrevem uma nova funcionalidade sugerida para o Python, fornecendo uma especificação técnica concisa e uma justificação. Procure uma PEP intitulada "Calendário de Lançamento do Python X.Y", onde X.Y é uma versão que ainda não foi lançada publicamente.

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman3/lists/python-dev.python.org/>`_.
pt_pt: Novos desenvolvimentos são discutidos na `lista de correio python-dev <https://mail.python.org/mailman3/lists/python-dev.python.org/>`_.

source: Is it reasonable to propose incompatible changes to Python?
pt_pt: É razoável propor alterações incompatíveis ao Python?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
pt_pt: Em geral, não. Já existem milhões de linhas de código Python em todo o mundo, por isso qualquer alteração na linguagem que invalide mais do que uma fração muito pequena dos programas existentes tem de ser vista com reservas. Mesmo que consiga fornecer um programa de conversão, ainda existe o problema de atualizar toda a documentação; muitos livros foram escritos sobre o Python, e não queremos invalidá-los todos de uma só vez.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
pt_pt: Fornecer um caminho de atualização gradual é necessário se uma funcionalidade tiver de ser alterada. O :pep:`5` descreve o procedimento seguido para introduzir alterações retroincompatíveis, minimizando a perturbação para os utilizadores.

source: Is Python a good language for beginning programmers?
pt_pt: O Python é uma boa linguagem para programadores iniciantes?

source: Yes.
pt_pt: Sim.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
pt_pt: Ainda é comum começar os estudantes com uma linguagem procedural e estaticamente tipada, como Pascal, C, ou um subconjunto de C++ ou Java. Os estudantes podem ser melhor servidos aprendendo Python como sua primeira linguagem. O Python tem uma sintaxe muito simples e consistente e uma grande biblioteca padrão e, mais importante, usar o Python num curso introdutório de programação permite que os estudantes se concentrem em competências importantes de programação, como a decomposição de problemas e o design de tipos de dados. Com o Python, os estudantes podem ser rapidamente introduzidos a conceitos básicos como ciclos e procedimentos. Podem até trabalhar com objetos definidos pelo utilizador no seu primeiro curso.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
pt_pt: Para um estudante que nunca programou antes, usar uma linguagem estaticamente tipada parece antinatural. Apresenta uma complexidade adicional que o estudante tem de dominar e abrandar o ritmo do curso. Os estudantes estão a tentar aprender a pensar como um computador, decompor problemas, conceber interfaces consistentes e encapsular dados. Embora aprender a usar uma linguagem estaticamente tipada seja importante a longo prazo, não é necessariamente o melhor tópico a abordar no primeiro curso de programação dos estudantes.

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
pt_pt: Muitos outros aspetos do Python tornam-no uma boa primeira linguagem. Tal como o Java, o Python tem uma grande biblioteca padrão, pelo que os estudantes podem ser atribuídos projetos de programação muito cedo no curso que *fazem* algo. As tarefas não se limitam à calculadora de quatro operações e aos programas de balanço de contas. Ao usar a biblioteca padrão, os estudantes podem obter a satisfação de trabalhar em aplicações realistas enquanto aprendem os fundamentos da programação. Usar a biblioteca padrão também ensina os estudantes sobre reutilização de código. Módulos de terceiros, como o PyGame, também são úteis para estender o alcance dos estudantes.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
pt_pt: O interpretador interativo do Python permite que os estudantes testem funcionalidades da linguagem enquanto programam. Podem manter uma janela com o interpretador em execução enquanto introduzem o código-fonte do seu programa noutra janela. Se não se lembrarem dos métodos para uma lista, podem fazer algo como isto:

source: With the interpreter, documentation is never far from the student as they are programming.
pt_pt: Com o interpretador, a documentação nunca está longe do estudante enquanto programam.

source: There are also good IDEs for Python. IDLE is a cross-platform IDE for Python that is written in Python using Tkinter. Emacs users will be happy to know that there is a very good Python mode for Emacs. All of these programming environments provide syntax highlighting, auto-indenting, and access to the interactive interpreter while coding. Consult `the Python wiki <https://wiki.python.org/moin/PythonEditors>`_ for a full list of Python editing environments.
pt_pt: Também existem bons IDEs para Python. O IDLE é um IDE multiplataforma para Python escrito em Python usando Tkinter. Os utilizadores do Emacs ficarão felizes por saber que existe um modo Python muito bom para o Emacs. Todos estes ambientes de programação fornecem realce de sintaxe, indentação automática e acesso ao interpretador interativo enquanto codificam. Consulte a `wiki do Python <https://wiki.python.org/moin/PythonEditors>`_ para obter uma lista completa de ambientes de edição para Python.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
pt_pt: Se quiser discutir o uso do Python na educação, pode estar interessado em juntar-se à `lista de correio edu-sig <https://www.python.org/community/sigs/current/edu-sig>`_.
