Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/faq/general.po
Languages: pt_pt

source: General Python FAQ
pt_pt: FAQ Geral do Python

source: Contents
pt_pt: Conteúdos

source: General Information
pt_pt: Informação Geral

source: What is Python?
pt_pt: O que é o Python?

source: Python is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. It supports multiple programming paradigms beyond object-oriented programming, such as procedural and functional programming. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants including Linux and macOS, and on Windows.
pt_pt: Python é uma linguagem de programação interpretada, interativa e orientada a objetos. Ela incorpora módulos, exceções, tipagem dinâmica, tipos de dados dinâmicos de alto nível e classes. Ela suporta vários paradigmas de programação além da programação orientada a objetos, como programação procedural e funcional. Python combina um poder notável com uma sintaxe muito clara. Possui interfaces para muitas chamadas de sistema e bibliotecas, bem como para vários sistemas de janelas, e é extensível em C ou C++. Também pode ser usado como uma linguagem de extensão para aplicações que precisam de uma interface programável. Por fim, Python é portátil: funciona em muitas variantes do Unix, incluindo Linux e macOS, e no Windows.

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
pt_pt: Para saber mais, comece com o :ref:`tutorial-index`. O `Guia para Iniciantes em Python <https://wiki.python.org/moin/BeginnersGuide>`_ liga a outros tutoriais introdutórios e recursos para aprender Python.

source: What is the Python Software Foundation?
pt_pt: O que é a Python Software Foundation?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
pt_pt: A Python Software Foundation é uma organização independente sem fins lucrativos que detém os direitos de autor das versões do Python 2.1 e posteriores. A missão da PSF é promover a tecnologia de código aberto relacionada com a linguagem de programação Python e divulgar a utilização do Python. A página inicial da PSF está em https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
pt_pt: As doações à PSF são isentas de impostos nos EUA. Se usa o Python e considera-o útil, contribua através da `página de doações da PSF <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
pt_pt: Existem restrições de direitos de autor na utilização do Python?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
pt_pt: Pode fazer o que quiser com o código-fonte, desde que mantenha os direitos de autor e os exiba em qualquer documentação sobre o Python que produza. Se respeitar as regras de direitos de autor, é permitido usar o Python para uso comercial, vender cópias do Python em formato de código-fonte ou binário (modificado ou não modificado), ou vender produtos que incorporem o Python de alguma forma. Gostaríamos, claro, de saber sobre todo o uso comercial do Python.

source: See `the license page <https://docs.python.org/3/license.html>`_ to find further explanations and the full text of the PSF License.
pt_pt: Consulte a `página da licença <https://docs.python.org/3/license.html>`_ para encontrar explicações adicionais e o texto integral da Licença da PSF.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
pt_pt: O logótipo do Python é uma marca registada e, em certos casos, é necessária autorização para o utilizar. Consulte a `Política de Utilização de Marcas <https://www.python.org/psf/trademarks/>`__ para mais informações.

source: Why was Python created in the first place?
pt_pt: Por que foi o Python criado?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
pt_pt: Aqui está um resumo *muito* breve do que deu origem a tudo, escrito por Guido van Rossum:

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
pt_pt: Tinha vasta experiência na implementação de uma linguagem interpretada no grupo ABC no CWI, e com este grupo aprendi muito sobre o design de linguagens. Esta é a origem de muitas funcionalidades do Python, incluindo o uso de indentação para agrupar instruções e a inclusão de tipos de dados de muito alto nível (embora os detalhes sejam todos diferentes no Python).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
pt_pt: Tinha várias queixas sobre a linguagem ABC, mas também gostava de muitas das suas funcionalidades. Era impossível estender a linguagem ABC (ou a sua implementação) para resolver as minhas queixas — na verdade, a sua falta de extensibilidade era um dos seus maiores problemas. Tinha alguma experiência com a utilização de Modula-2+ e falei com os designers do Modula-3 e li o relatório do Modula-3. O Modula-3 é a origem da sintaxe e semântica usadas para exceções e algumas outras funcionalidades do Python.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
pt_pt: Estava a trabalhar no grupo do sistema operativo distribuído Amoeba no CWI. Precisávamos de uma forma melhor de fazer administração de sistemas do que escrever programas em C ou scripts Bourne shell, uma vez que o Amoeba tinha a sua própria interface de chamadas de sistema, que não era facilmente acessível a partir do Bourne shell. A minha experiência com o tratamento de erros no Amoeba tornou-me profundamente consciente da importância das exceções como funcionalidade de uma linguagem de programação.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
pt_pt: Ocorreu-me que uma linguagem de script com uma sintaxe como a do ABC, mas com acesso às chamadas de sistema do Amoeba, preencheria essa necessidade. Percebi que seria tolo escrever uma linguagem específica para o Amoeba, por isso decidi que precisava de uma linguagem geralmente extensível.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
pt_pt: Durante as férias de Natal de 1989, tinha muito tempo livre, por isso decidi tentar. Durante o ano seguinte, enquanto ainda trabalhava maioritariamente no meu tempo livre, o Python foi usado no projeto Amoeba com crescente sucesso, e o feedback dos colegas levou-me a adicionar muitas melhorias iniciais.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
pt_pt: Em fevereiro de 1991, após pouco mais de um ano de desenvolvimento, decidi publicar na USENET. O resto está no ficheiro ``Misc/HISTORY``.

source: What is Python good for?
pt_pt: Para que serve o Python?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
pt_pt: O Python é uma linguagem de programação de alto nível e de uso geral que pode ser aplicada a muitas classes diferentes de problemas.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
pt_pt: A linguagem vem com uma grande biblioteca padrão que cobre áreas como processamento de strings (expressões regulares, Unicode, cálculo de diferenças entre ficheiros), protocolos de Internet (HTTP, FTP, SMTP, XML-RPC, POP, IMAP), engenharia de software (testes unitários, registo, perfil, análise de código Python) e interfaces de sistema operativo (chamadas de sistema, sistemas de ficheiros, sockets TCP/IP). Consulte o índice de conteúdos do :ref:`library-index` para ter uma ideia do que está disponível. Uma grande variedade de extensões de terceiros também estão disponíveis. Consulte o `Python Package Index <https://pypi.org>`_ para encontrar pacotes do seu interesse.

source: How does the Python version numbering scheme work?
pt_pt: Como funciona o esquema de numeração de versões do Python?

source: Python versions are numbered "A.B.C" or "A.B":
pt_pt: As versões do Python são numeradas como "A.B.C" ou "A.B":

source: *A* is the major version number -- it is only incremented for really major changes in the language.
pt_pt: *A* é o número da versão principal — só é incrementado para alterações realmente significativas na linguagem.

source: *B* is the minor version number -- it is incremented for less earth-shattering changes.
pt_pt: *B* é o número da versão secundária — é incrementado para alterações menos drásticas.

source: *C* is the micro version number -- it is incremented for each bugfix release.
pt_pt: *C* é o número da versão micro — é incrementado em cada lançamento de correção de erros.

source: Not all releases are bugfix releases. In the run-up to a new feature release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
pt_pt: Nem todos os lançamentos são lançamentos de correção de erros. Na preparação de um novo lançamento de funcionalidades, é feita uma série de lançamentos de desenvolvimento, designados como alfa, beta ou candidato a lançamento. As versões alfa são lançamentos iniciais em que as interfaces ainda não estão finalizadas; não é inesperado ver uma alteração de interface entre duas versões alfa. As versões beta são mais estáveis, preservando as interfaces existentes, mas possivelmente adicionando novos módulos, e os candidatos a lançamento estão congelados, não fazendo alterações exceto as necessárias para corrigir erros críticos.

source: Alpha, beta and release candidate versions have an additional suffix:
pt_pt: As versões alfa, beta e candidato a lançamento têm um sufixo adicional:

source: The suffix for an alpha version is "aN" for some small number *N*.
pt_pt: O sufixo para uma versão alfa é "aN" para um pequeno número *N*.

source: The suffix for a beta version is "bN" for some small number *N*.
pt_pt: O sufixo para uma versão beta é "bN" para um pequeno número *N*.

source: The suffix for a release candidate version is "rcN" for some small number *N*.
pt_pt: O sufixo para uma versão candidato a lançamento é "rcN" para um pequeno número *N*.

source: In other words, all versions labeled *2.0aN* precede the versions labeled *2.0bN*, which precede versions labeled *2.0rcN*, and *those* precede 2.0.
pt_pt: Em outras palavras, todas as versões etiquetadas como *2.0aN* precedem as versões etiquetadas como *2.0bN*, que precedem as versões etiquetadas como *2.0rcN*, e estas precedem a 2.0.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
pt_pt: Também pode encontrar números de versão com um sufixo "+", por exemplo, "2.2+". Estas são versões não lançadas, construídas diretamente a partir do repositório de desenvolvimento do CPython. Na prática, após um lançamento final secundário, a versão é incrementada para a próxima versão secundária, que se torna a versão "a0", por exemplo, "2.4a0".

source: See the `Developer's Guide <https://devguide.python.org/developer-workflow/development-cycle/>`__ for more information about the development cycle, and :pep:`387` to learn more about Python's backward compatibility policy. See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
pt_pt: Consulte o `Guia do Programador <https://devguide.python.org/developer-workflow/development-cycle/>`__ para mais informações sobre o ciclo de desenvolvimento e o :pep:`387` para saber mais sobre a política de compatibilidade retroativa do Python. Consulte também a documentação para :data:`sys.version`, :data:`sys.hexversion` e :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
pt_pt: Como obtenho uma cópia do código-fonte do Python?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
pt_pt: A distribuição mais recente do código-fonte do Python está sempre disponível em python.org, em https://www.python.org/downloads/. As fontes de desenvolvimento mais recentes podem ser obtidas em https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
pt_pt: A distribuição do código-fonte é um ficheiro tar compactado com gzip que contém o código-fonte C completo, documentação formatada em Sphinx, módulos da biblioteca Python, programas de exemplo e várias peças úteis de software livremente distribuível. O código-fonte compila e executa sem problemas na maioria das plataformas UNIX.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
pt_pt: Consulte a `secção Introdução do Guia do Programador Python <https://devguide.python.org/setup/>`__ para obter mais informações sobre como obter o código-fonte e compilá-lo.

source: How do I get documentation on Python?
pt_pt: Como obtenho documentação sobre o Python?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
pt_pt: A documentação padrão para a versão estável atual do Python está disponível em https://docs.python.org/3/. Versões em PDF, texto simples e HTML descarregáveis também estão disponíveis em https://docs.python.org/3/download.html.

source: The documentation is written in reStructuredText and processed by `the Sphinx documentation tool <https://www.sphinx-doc.org/>`__. The reStructuredText source for the documentation is part of the Python source distribution.
pt_pt: A documentação é escrita em reStructuredText e processada pela `ferramenta de documentação Sphinx <https://www.sphinx-doc.org/>`__. O código-fonte reStructuredText da documentação faz parte da distribuição do código-fonte do Python.

source: I've never programmed before. Is there a Python tutorial?
pt_pt: Nunca programei antes. Existe um tutorial de Python?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
pt_pt: Existem inúmeros tutoriais e livros disponíveis. A documentação padrão inclui o :ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
pt_pt: Consulte o `Guia para Iniciantes <https://wiki.python.org/moin/BeginnersGuide>`_ para encontrar informações para programadores iniciantes em Python, incluindo listas de tutoriais.

source: Is there a newsgroup or mailing list devoted to Python?
pt_pt: Existe um grupo de notícias ou lista de correio dedicada ao Python?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
pt_pt: Existe um grupo de notícias, :newsgroup:`comp.lang.python`, e uma lista de correio, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. O grupo de notícias e a lista de correio estão interligados — se conseguir ler notícias, não é necessário subscrever a lista de correio. O :newsgroup:`comp.lang.python` tem muito tráfego, recebendo centenas de publicações todos os dias, e os leitores de Usenet são muitas vezes mais capazes de lidar com este volume.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman3/lists/python-announce-list.python.org/>`_.
pt_pt: Os anúncios de novos lançamentos de software e eventos podem ser encontrados em comp.lang.python.announce, uma lista moderada de baixo tráfego que recebe cerca de cinco publicações por dia. Está disponível como `a lista de correio python-announce <https://mail.python.org/mailman3/lists/python-announce-list.python.org/>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
pt_pt: Mais informações sobre outras listas de correio e grupos de notícias podem ser encontradas em https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
pt_pt: Como obtenho uma versão beta de teste do Python?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
pt_pt: As versões alfa e beta estão disponíveis em https://www.python.org/downloads/. Todos os lançamentos são anunciados nos grupos de notícias comp.lang.python e comp.lang.python.announce e na página inicial do Python em https://www.python.org/; está disponível um feed RSS de notícias.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
pt_pt: Também pode aceder à versão de desenvolvimento do Python através do Git. Consulte o `Guia do Programador Python <https://devguide.python.org/>`_ para mais detalhes.

source: How do I submit bug reports and patches for Python?
pt_pt: Como posso submeter relatórios de erros e patches para o Python?

source: To report a bug or submit a patch, use the issue tracker at https://github.com/python/cpython/issues.
pt_pt: Para reportar um erro ou submeter um patch, utilize o rastreador de problemas em https://github.com/python/cpython/issues.

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
pt_pt: Para mais informações sobre como o Python é desenvolvido, consulte o `Guia do Programador Python <https://devguide.python.org/>`_.

source: Are there any published articles about Python that I can reference?
pt_pt: Existem artigos publicados sobre o Python que eu possa referenciar?

source: It's probably best to cite your favorite book about Python.
pt_pt: Provavelmente, o melhor é citar o seu livro favorito sobre Python.

source: The `very first article <https://ir.cwi.nl/pub/18204>`_ about Python was written in 1991 and is now quite outdated.
pt_pt: O `primeiro artigo <https://ir.cwi.nl/pub/18204>`_ sobre o Python foi escrito em 1991 e está agora bastante desatualizado.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
pt_pt: Guido van Rossum e Jelke de Boer, "Teste Interativo de Servidores Remotos Usando a Linguagem de Programação Python", CWI Quarterly, Volume 4, Edição 4 (dezembro de 1991), Amesterdão, pp 283--303.

source: Are there any books on Python?
pt_pt: Existem livros sobre Python?

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
pt_pt: Sim, existem muitos, e mais estão a ser publicados. Consulte a wiki do python.org em https://wiki.python.org/moin/PythonBooks para ver uma lista.
