Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/using/mac.po
Languages: pt_pt, ru

source: The traditional framework installation by default does something similar, except for :file:`Python.framework`. Be aware that having both framework ``bin`` directories in ``PATH`` can lead to confusion if there are duplicate names like |python_x_dot_y_literal| in both; which one is actually used depends on the order they appear in ``PATH``. The ``which python3.x`` or ``which python3.xt`` commands can show which path is being used. Using virtual environments can help avoid such ambiguities. Another option might be to create a shell :command:`alias` to the desired interpreter, like:
pt_pt: A instalação do *framework* tradicional, por predefinição, faz algo semelhante, exceto para :file:`Python.framework`. Tenha em atenção que ter ambos os diretórios ``bin`` do *framework* no ``PATH`` pode levar a confusão se houver nomes duplicados, como |python_x_dot_y_literal| em ambos; qual é realmente usado depende da ordem em que aparecem no ``PATH``. Os comandos ``which python3.x`` ou ``which python3.xt`` podem mostrar qual caminho está a ser usado. A utilização de ambientes virtuais pode ajudar a evitar tais ambiguidades. Outra opção pode ser criar um :command:`alias` da *shell* para o interpretador desejado, como:

source: Installing using the command line
pt_pt: A instalar usando a linha de comando

source: If you want to use automation to install the ``python.org`` installer package (rather than by using the familiar macOS :program:`Installer` GUI app), the macOS command line :command:`installer` utility lets you select non-default options, too. If you are not familiar with :command:`installer`, it can be somewhat cryptic (see :command:`man installer` for more information). As an example, the following shell snippet shows one way to do it, using the |x_dot_y_b2_literal| release and selecting the free-threaded interpreter option:
pt_pt: Se pretender usar automação para instalar o pacote de instalação ``python.org`` (em vez de usar a aplicação GUI :program:`Installer` familiar do macOS), a utilidade de linha de comando :command:`installer` do macOS permite-lhe selecionar opções não predefinidas. Se não estiver familiarizado com :command:`installer`, pode ser um pouco críptico (consulte :command:`man installer` para mais informações). Como exemplo, o seguinte trecho de *shell* mostra uma forma de o fazer, usando a versão |x_dot_y_b2_literal| e selecionando a opção do interpretador *free-threaded*:

source: RELEASE="python-\ |version|\ 0b2-macos11.pkg" # download installer pkg curl -O \https://www.python.org/ftp/python/\ |version|\ .0/${RELEASE} # create installer choicechanges to customize the install: # enable the PythonTFramework-\ |version|\ package # while accepting the other defaults (install all other packages) cat > ./choicechanges.plist <<EOF <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "\http://www.apple.com/DTDs/PropertyList-1.0.dtd"> <plist version="1.0"> <array> <dict> <key>attributeSetting</key> <integer>1</integer> <key>choiceAttribute</key> <string>selected</string> <key>choiceIdentifier</key> <string>org.python.Python.PythonTFramework-\ |version|\ </string> </dict> </array> </plist> EOF sudo installer -pkg ./${RELEASE} -applyChoiceChangesXML ./choicechanges.plist -target /
pt_pt: RELEASE="python-\ |version|\ 0b2-macos11.pkg" # descarregar o pacote de instalação curl -O \https://www.python.org/ftp/python/\ |version|\ .0/${RELEASE} # criar alterações de escolha do instalador para personalizar a instalação: # ativar o pacote PythonTFramework-\ |version|\ # enquanto aceita as outras predefinições (instalar todos os outros pacotes) cat > ./choicechanges.plist <<EOF <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "\http://www.apple.com/DTDs/PropertyList-1.0.dtd"> <plist version="1.0"> <array> <dict> <key>attributeSetting</key> <integer>1</integer> <key>choiceAttribute</key> <string>selected</string> <key>choiceIdentifier</key> <string>org.python.Python.PythonTFramework-\ |version|\ </string> </dict> </array> </plist> EOF sudo installer -pkg ./${RELEASE} -applyChoiceChangesXML ./choicechanges.plist -target /

source: You can then test that both installer builds are now available with something like:
pt_pt: Pode então testar que ambas as construções do instalador estão agora disponíveis com algo como:

source: Current ``python.org`` installers only install to fixed locations like :file:`/Library/Frameworks/`, :file:`/Applications`, and :file:`/usr/local/bin`. You cannot use the :command:`installer` ``-domain`` option to install to other locations.
pt_pt: Os instaladores atuais do ``python.org`` instalam apenas em locais fixos como :file:`/Library/Frameworks/`, :file:`/Applications` e :file:`/usr/local/bin`. Não pode usar a opção ``-domain`` do :command:`installer` para instalar noutros locais.

source: Distributing Python Applications
pt_pt: A distribuir aplicações Python
ru: Распространение приложений Python

source: A range of tools exist for converting your Python code into a standalone distributable application:
pt_pt: Existe uma variedade de ferramentas para converter o seu código Python numa aplicação autónoma distribuível:
ru: Существует ряд инструментов для преобразования вашего кода Python в автономное распространяемое приложение:

source: :pypi:`py2app`: Supports creating macOS ``.app`` bundles from a Python project.
pt_pt: :pypi:`py2app`: Suporta a criação de pacotes ``.app`` do macOS a partir de um projeto Python.
ru: :pypi:`py2app`: поддерживает создание пакетов macOS ``.app`` из проекта Python.

source: `Briefcase <https://briefcase.readthedocs.io>`_: Part of the `BeeWare Project <https://beeware.org>`_; a cross-platform packaging tool that supports creation of ``.app`` bundles on macOS, as well as managing signing and notarization.
pt_pt: `Briefcase <https://briefcase.readthedocs.io>`_: Parte do `Projeto BeeWare <https://beeware.org>`_; uma ferramenta de empacotamento multi-plataforma que suporta a criação de pacotes ``.app`` no macOS, bem como a gestão de assinatura e notarização.

source: `PyInstaller <https://pyinstaller.org/>`_: A cross-platform packaging tool that creates a single file or folder as a distributable artifact.
pt_pt: `PyInstaller <https://pyinstaller.org/>`_: Uma ferramenta de empacotamento multi-plataforma que cria um único ficheiro ou pasta como um artefacto distribuível.

source: App Store Compliance
pt_pt: Conformidade com a App Store

source: Apps submitted for distribution through the macOS App Store must pass Apple's app review process. This process includes a set of automated validation rules that inspect the submitted application bundle for problematic code.
pt_pt: As aplicações submetidas para distribuição através da App Store do macOS devem passar no processo de revisão de aplicações da Apple. Este processo inclui um conjunto de regras de validação automatizadas que inspecionam o pacote da aplicação submetida em busca de código problemático.

source: The Python standard library contains some code that is known to violate these automated rules. While these violations appear to be false positives, Apple's review rules cannot be challenged. Therefore, it is necessary to modify the Python standard library for an app to pass App Store review.
pt_pt: A biblioteca padrão do Python contém algum código que é conhecido por violar estas regras automatizadas. Embora estas violações pareçam ser falsos positivos, as regras de revisão da Apple não podem ser contestadas. Portanto, é necessário modificar a biblioteca padrão do Python para que uma aplicação passe na revisão da App Store.

source: The Python source tree contains :source:`a patch file <Mac/Resources/app-store-compliance.patch>` that will remove all code that is known to cause issues with the App Store review process. This patch is applied automatically when CPython is configured with the :option:`--with-app-store-compliance` option.
pt_pt: A árvore de origem do Python contém :source:`um ficheiro de patch <Mac/Resources/app-store-compliance.patch>` que removerá todo o código conhecido por causar problemas com o processo de revisão da App Store. Este patch é aplicado automaticamente quando o CPython é configurado com a opção :option:`--with-app-store-compliance`.

source: This patch is not normally required to use CPython on a Mac; nor is it required if you are distributing an app *outside* the macOS App Store. It is *only* required if you are using the macOS App Store as a distribution channel.
pt_pt: Este patch não é normalmente necessário para usar o CPython num Mac; nem é necessário se estiver a distribuir uma aplicação *fora* da App Store do macOS. É *apenas* necessário se estiver a usar a App Store do macOS como canal de distribuição.

source: Other Resources
pt_pt: Outros Recursos
ru: Другие ресурсы

source: The `python.org Help page <https://www.python.org/about/help/>`_ has links to many useful resources. The `Pythonmac-SIG mailing list <https://www.python.org/community/sigs/current/pythonmac-sig/>`_ is another support resource specifically for Python users and developers on the Mac.
pt_pt: A `página de Ajuda do python.org <https://www.python.org/about/help/>`_ tem ligações para muitos recursos úteis. A `lista de correio Pythonmac-SIG <https://www.python.org/community/sigs/current/pythonmac-sig/>`_ é outro recurso de suporte especificamente para utilizadores e programadores do Python no Mac.

source: Using Python on a Mac
ru: Использование Python на Mac

source: Author
ru: Автор

source: Python on a Mac running macOS is in principle very similar to Python on any other Unix platform, but there are a number of additional features such as the integrated development environment (IDE) and the Package Manager that are worth pointing out.
ru: Python на Mac под управлением macOS в принципе очень похож на Python на любой другой платформе Unix, но есть ряд дополнительных функций, таких как интегрированная среда разработки (IDE) и диспетчер пакетов, на которые стоит обратить внимание.

source: Getting and Installing Python
ru: Получение и установка Python

source: macOS used to come with Python 2.7 pre-installed between versions 10.8 and `12.3 <https://developer.apple.com/documentation/macos-release-notes/macos-12_3-release-notes#Python>`_. You are invited to install the most recent version of Python 3 from the `Python website <https://www.python.org/downloads/macos/>`__. A current "universal2 binary" build of Python, which runs natively on the Mac's new Apple Silicon and legacy Intel processors, is available there.
ru: Раньше macOS поставлялся с предустановленным Python 2.7 между версиями 10.8 и `12.3 <https://developer.apple.com/documentation/macos-release-notes/macos-12_3-release-notes#Python>`_. Вам предлагается установить самую последнюю версию Python 3 с веб-сайта Python <https://www.python.org/downloads/macos/>`__. Здесь доступна текущая бинарная сборка Python Universal2, которая изначально работает на новых процессорах Apple Silicon и устаревших процессорах Intel для Mac.

source: What you get after installing is a number of things:
ru: После установки вы получаете ряд вещей:

source: A |python_version_literal| folder in your :file:`Applications` folder. In here you find IDLE, the development environment that is a standard part of official Python distributions; and :program:`Python Launcher`, which handles double-clicking Python scripts from the Finder.
ru: А |python_version_literal| в папке :file:`Applications`. Здесь вы найдете IDLE, среду разработки, которая является стандартной частью официальных дистрибутивов Python; и :program:`Python Launcher`, который обрабатывает сценарии Python при двойном щелчке из Finder.

source: A framework :file:`/Library/Frameworks/Python.framework`, which includes the Python executable and libraries. The installer adds this location to your shell path. To uninstall Python, you can remove these three things. A symlink to the Python executable is placed in :file:`/usr/local/bin/`.
ru: Фреймворк :file:`/Library/Frameworks/Python.framework`, который включает исполняемый файл Python и библиотеки. Установщик добавляет это местоположение в путь к вашей оболочке. Чтобы удалить Python, вы можете удалить эти три вещи. Символическая ссылка на исполняемый файл Python помещается в :file:`/usr/local/bin/`.

source: On macOS 10.8-12.3, the Apple-provided build of Python is installed in :file:`/System/Library/Frameworks/Python.framework` and :file:`/usr/bin/python`, respectively. You should never modify or delete these, as they are Apple-controlled and are used by Apple- or third-party software. Remember that if you choose to install a newer Python version from python.org, you will have two different but functional Python installations on your computer, so it will be important that your paths and usages are consistent with what you want to do.
ru: В macOS 10.8–12.3 сборка Python, предоставленная Apple, устанавливается в :file:`/System/Library/Frameworks/Python.framework` и :file:`/usr/bin/python` соответственно. Никогда не следует изменять или удалять их, поскольку они контролируются Apple и используются программным обеспечением Apple или сторонних производителей. Помните, что если вы решите установить более новую версию Python с сайта python.org, на вашем компьютере будут две разные, но функциональные установки Python, поэтому важно, чтобы ваши пути и способы использования соответствовали тому, что вы хотите сделать.

source: IDLE includes a Help menu that allows you to access Python documentation. If you are completely new to Python you should start reading the tutorial introduction in that document.
ru: IDLE включает меню «Справка», которое позволяет получить доступ к документации Python. Если вы новичок в Python, вам следует начать читать введение в руководство в этом документе.

source: If you are familiar with Python on other Unix platforms you should read the section on running Python scripts from the Unix shell.
ru: Если вы знакомы с Python на других платформах Unix, вам следует прочитать раздел о запуске сценариев Python из оболочки Unix.

source: Your best way to get started with Python on macOS is through the IDLE integrated development environment; see section :ref:`ide` and use the Help menu when the IDE is running.
ru: Лучший способ начать работу с Python в macOS — использовать интегрированную среду разработки IDLE; см. раздел :ref:`ide` и используйте меню «Справка» во время работы IDE.

source: If you want to run Python scripts from the Terminal window command line or from the Finder you first need an editor to create your script. macOS comes with a number of standard Unix command line editors, :program:`vim` :program:`nano` among them. If you want a more Mac-like editor, :program:`BBEdit` from Bare Bones Software (see https://www.barebones.com/products/bbedit/index.html) are good choices, as is :program:`TextMate` (see https://macromates.com). Other editors include :program:`MacVim` (https://macvim.org) and :program:`Aquamacs` (https://aquamacs.org).
ru: Если вы хотите запускать сценарии Python из командной строки окна терминала или из Finder, вам сначала понадобится редактор для создания сценария. macOS поставляется с рядом стандартных редакторов командной строки Unix, в том числе :program:`vim` :program:`nano`. Если вам нужен редактор, более похожий на Mac, хорошим выбором будет :program:`BBEdit` от Bare Bones Software (см. https://www.barebones.com/products/bbedit/index.html), а также :program:` TextMate` (см. https://macromate.com). Другие редакторы включают :program:`MacVim` (https://macvim.org) и :program:`Aquamacs` (https://aquamacs.org).

source: To run your script from the Terminal window you must make sure that :file:`/usr/local/bin` is in your shell search path.
ru: Чтобы запустить скрипт из окна терминала, вы должны убедиться, что :file:`/usr/local/bin` находится в пути поиска вашей оболочки.

source: To run your script from the Finder you have two options:
ru: Чтобы запустить скрипт из Finder, у вас есть два варианта:

source: Select :program:`Python Launcher` as the default application to open your script (or any ``.py`` script) through the finder Info window and double-click it. :program:`Python Launcher` has various preferences to control how your script is launched. Option-dragging allows you to change these for one invocation, or use its Preferences menu to change things globally.
ru: Выберите :program:`Python Launcher` в качестве приложения по умолчанию, чтобы открыть ваш скрипт (или любой ``.py`` скрипт) через окно информации искателя, и дважды щелкните его. :program:`Python Launcher` имеет различные настройки для управления запуском вашего скрипта. Перетаскивание опций позволяет вам изменить их за один вызов или использовать меню «Настройки» для глобального изменения.

source: Running scripts with a GUI
ru: Запуск скриптов с графическим интерфейсом

source: With older versions of Python, there is one macOS quirk that you need to be aware of: programs that talk to the Aqua window manager (in other words, anything that has a GUI) need to be run in a special way. Use :program:`pythonw` instead of :program:`python` to start such scripts.
ru: В более старых версиях Python есть одна особенность macOS, о которой вам следует знать: программы, которые взаимодействуют с оконным менеджером Aqua (другими словами, все, что имеет графический интерфейс), необходимо запускать особым образом. Используйте :program:`pythonw` вместо :program:`python` для запуска таких сценариев.

source: With Python 3.9, you can use either :program:`python` or :program:`pythonw`.
ru: В Python 3.9 вы можете использовать либо :program:`python`, либо :program:`pythonw`.

source: Configuration
ru: Конфигурация

source: Python on macOS honors all standard Unix environment variables such as :envvar:`PYTHONPATH`, but setting these variables for programs started from the Finder is non-standard as the Finder does not read your :file:`.profile` or :file:`.cshrc` at startup. You need to create a file :file:`~/.MacOSX/environment.plist`. See Apple's `Technical Q&A QA1067 <https://developer.apple.com/library/archive/qa/qa1067/_index.html>`__ for details.
ru: Python в macOS учитывает все стандартные переменные среды Unix, такие как :envvar:`PYTHONPATH`, но установка этих переменных для программ, запускаемых из Finder, нестандартна, поскольку Finder не читает ваш :file:`.profile` или :file: `.cshrc` при запуске. Вам необходимо создать файл :file:`~/.MacOSX/environment.plist`. Подробности см. в разделе «Технические вопросы и ответы QA1067» Apple <https://developer.apple.com/library/archive/qa/qa1067/_index.html>`__.

source: For more information on installation Python packages, see section :ref:`mac-package-manager`.
ru: Дополнительную информацию об установке пакетов Python см. в разделе :ref:`mac-package-manager`.

source: The IDE
ru: Среда IDE

source: Python ships with the standard IDLE development environment. A good introduction to using IDLE can be found at https://www.hashcollision.org/hkn/python/idle_intro/index.html.
ru: Python поставляется со стандартной средой разработки IDLE. Хорошее введение в использование IDLE можно найти по адресу https://www.hashcollision.org/hkn/python/idle_intro/index.html.

source: This section has moved to the `Python Packaging User Guide`_.
ru: Этот раздел перемещен в «Руководство пользователя упаковки Python».

source: *PyObjC* is a Python binding to Apple's Objective-C/Cocoa framework, which is the foundation of most modern Mac development. Information on PyObjC is available from :pypi:`pyobjc`.
ru: *PyObjC* — это привязка Python к платформе Apple Objective-C/Cocoa, которая является основой большинства современных разработок для Mac. Информацию о PyObjC можно получить на сайте :pypi:`pyobjc`.

source: The standard Python GUI toolkit is :mod:`tkinter`, based on the cross-platform Tk toolkit (https://www.tcl.tk). An Aqua-native version of Tk is bundled with macOS by Apple, and the latest version can be downloaded and installed from https://www.activestate.com; it can also be built from source.
ru: Стандартный набор инструментов Python GUI — :mod:`tkinter`, основанный на кроссплатформенном наборе инструментов Tk (https://www.tcl.tk). Версия Tk для Aqua поставляется в комплекте с macOS от Apple, а последнюю версию можно загрузить и установить с https://www.activestate.com; его также можно собрать из исходного кода.

source: A number of alternative macOS GUI toolkits are available:
ru: Доступен ряд альтернативных наборов инструментов графического интерфейса macOS:

source: `PySide <https://www.qt.io/qt-for-python>`__: Official Python bindings to the `Qt GUI toolkit <https://www.qt.io>`__.
ru: `PySide <https://www.qt.io/qt-for-python>`__: Официальные привязки Python к `Qt GUI Toolkit <https://www.qt.io>`__.

source: `PyQt <https://riverbankcomputing.com/software/pyqt/intro>`__: Alternative Python bindings to Qt.
ru: `PyQt <https://riverbankcomputing.com/software/pyqt/intro>`__: Альтернативные привязки Python к Qt.

source: `Kivy <https://kivy.org>`__: A cross-platform GUI toolkit that supports desktop and mobile platforms.
ru: `Kivy <https://kivy.org>`__: кроссплатформенный набор инструментов с графическим интерфейсом, поддерживающий настольные и мобильные платформы.

source: `Toga <https://toga.readthedocs.io>`__: Part of the `BeeWare Project <https://beeware.org>`__; supports desktop, mobile, web and console apps.
ru: `Toga <https://toga.readthedocs.io>`__: часть `BeeWare Project <https://beeware.org>`__; поддерживает настольные, мобильные, веб-приложения и консольные приложения.

source: `wxPython <https://www.wxpython.org>`__: A cross-platform toolkit that supports desktop operating systems.
ru: `wxPython <https://www.wxpython.org>`__: кроссплатформенный набор инструментов, поддерживающий настольные операционные системы.

source: `Briefcase <https://briefcase.readthedocs.io>`__: Part of the `BeeWare Project <https://beeware.org>`__; a cross-platform packaging tool that supports creation of ``.app`` bundles on macOS, as well as managing signing and notarization.
ru: `Портфель <https://briefcase.readthedocs.io>`__: часть `BeeWare Project <https://beeware.org>`__; кроссплатформенный инструмент упаковки, который поддерживает создание пакетов .app в macOS, а также управление подписанием и нотариальным заверением.

source: `PyInstaller <https://pyinstaller.org/>`__: A cross-platform packaging tool that creates a single file or folder as a distributable artifact.
ru: `PyInstaller <https://pyinstaller.org/>`__: кросс-платформенный инструмент упаковки, который создает один файл или папку в качестве распространяемого артефакта.

source: The Pythonmac-SIG mailing list is an excellent support resource for Python users and developers on the Mac:
ru: Список рассылки Pythonmac-SIG — отличный ресурс поддержки для пользователей и разработчиков Python на Mac:

source: Another useful resource is the MacPython wiki:
ru: Еще один полезный ресурс — вики MacPython:
