Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/using/mac.po
Languages: pt_pt, ru

source: Using Python on macOS
pt_pt: A utilizar Python no macOS

source: This document aims to give an overview of macOS-specific behavior you should know about to get started with Python on Mac computers. Python on a Mac running macOS is very similar to Python on other Unix-derived platforms, but there are some differences in installation and some features.
pt_pt: Este documento visa dar uma visão geral do comportamento específico do macOS que deve conhecer para começar a utilizar Python em computadores Mac. O Python num Mac a executar macOS é muito semelhante ao Python noutras plataformas derivadas do Unix, mas existem algumas diferenças na instalação e em algumas funcionalidades.

source: There are various ways to obtain and install Python for macOS. Pre-built versions of the most recent versions of Python are available from a number of distributors. Much of this document describes use of the Pythons provided by the CPython release team for download from the `python.org website <https://www.python.org/downloads/>`_. See :ref:`alternative_bundles` for some other options.
pt_pt: Existem várias formas de obter e instalar o Python para macOS. Versões pré-construídas das versões mais recentes do Python estão disponíveis a partir de vários distribuidores. Grande parte deste documento descreve a utilização dos Pythons fornecidos pela equipa de lançamento do CPython para descarregamento a partir do `site python.org <https://www.python.org/downloads/>`_. Consulte :ref:`alternative_bundles` para outras opções.

source: Using Python for macOS from ``python.org``
pt_pt: A utilizar Python para macOS a partir do ``python.org``

source: Installation steps
pt_pt: Passos de instalação

source: The downloaded file is a standard macOS installer package file (``.pkg``). File integrity information (checksum, size, sigstore signature, etc) for each file is included on the release download page. Installer packages and their contents are signed and notarized with ``Python Software Foundation`` Apple Developer ID certificates to meet `macOS Gatekeeper requirements <https://support.apple.com/en-us/102445>`_.
pt_pt: O ficheiro descarregado é um ficheiro de pacote de instalação padrão do macOS (``.pkg``). Informações de integridade do ficheiro (soma de verificação, tamanho, assinatura sigstore, etc.) para cada ficheiro estão incluídas na página de descarregamento da versão. Os pacotes de instalação e os seus conteúdos são assinados e notarizados com certificados de ID de Desenvolvedor Apple da ``Python Software Foundation`` para cumprir os `requisitos do Gatekeeper do macOS <https://support.apple.com/en-us/102445>`_.

source: For a default installation, double-click on the downloaded installer package file. This should launch the standard macOS Installer app and display the first of several installer windows steps.
pt_pt: Para uma instalação predefinida, faça duplo clique no ficheiro do pacote de instalação descarregado. Isto deve lançar a aplicação de instalação padrão do macOS e exibir a primeira de várias etapas da janela de instalação.

source: Clicking on the **Continue** button brings up the **Read Me** for this installer. Besides other important information, the **Read Me** documents which Python version is going to be installed and on what versions of macOS it is supported. You may need to scroll through to read the whole file. By default, this **Read Me** will also be installed in |applications_python_version_literal| and available to read anytime.
pt_pt: Ao clicar no botão **Continuar**, é exibido o **Leia-me** deste instalador. Além de outras informações importantes, o **Leia-me** documenta qual a versão do Python que vai ser instalada e em quais versões do macOS é suportada. Pode ser necessário percorrer para ler o ficheiro inteiro. Por predefinição, este **Leia-me** também será instalado em |applications_python_version_literal| e estará disponível para leitura a qualquer momento.

source: Clicking on **Continue** proceeds to display the license for Python and for other included software. You will then need to **Agree** to the license terms before proceeding to the next step. This license file will also be installed and available to be read later.
pt_pt: Ao clicar em **Continuar**, é exibida a licença para o Python e para outro software incluído. Em seguida, terá de **Aceitar** os termos da licença antes de prosseguir para a próxima etapa. Este ficheiro de licença também será instalado e estará disponível para leitura posterior.

source: After the license terms are accepted, the next step is the **Installation Type** display. For most uses, the standard set of installation operations is appropriate.
pt_pt: Após a aceitação dos termos da licença, a próxima etapa é a exibição do **Tipo de Instalação**. Para a maioria das utilizações, o conjunto padrão de operações de instalação é apropriado.

source: In either case, clicking **Install** will begin the install process by asking permission to install new software. A macOS user name with ``Administrator`` privilege is needed as the installed Python will be available to all users of the Mac.
pt_pt: Em qualquer caso, clicar em **Instalar** iniciará o processo de instalação, pedindo permissão para instalar novo software. É necessário um nome de utilizador macOS com privilégios de ``Administrator``, uma vez que o Python instalado estará disponível para todos os utilizadores do Mac.

source: When the installation is complete, the **Summary** window will appear.
pt_pt: Quando a instalação estiver completa, a janela **Resumo** será exibida.

source: Double-click on the :command:`Install Certificates.command` icon or file in the |applications_python_version_literal| window to complete the installation.
pt_pt: Faça duplo clique no ícone ou ficheiro :command:`Install Certificates.command` na janela |applications_python_version_literal| para completar a instalação.

source: This will open a temporary :program:`Terminal` shell window that will use the new Python to download and install SSL root certificates for its use.
pt_pt: Isto abrirá uma janela temporária de shell :program:`Terminal` que usará o novo Python para descarregar e instalar certificados raiz SSL para a sua utilização.

source: If ``Successfully installed certifi`` and ``update complete`` appears in the terminal window, the installation is complete. Close this terminal window and the installer window.
pt_pt: Se ``Successfully installed certifi`` e ``update complete`` aparecerem na janela do terminal, a instalação está completa. Feche esta janela do terminal e a janela do instalador.

source: A default install will include:
pt_pt: Uma instalação predefinida incluirá:

source: A |python_version_literal| folder in your :file:`Applications` folder. In here you find :program:`IDLE`, the development environment that is a standard part of official Python distributions; and :program:`Python Launcher`, which handles double-clicking Python scripts from the macOS `Finder <https://support.apple.com/en-us/HT201732>`_.
pt_pt: Uma pasta |python_version_literal| na sua pasta :file:`Applications`. Aqui encontra :program:`IDLE`, o ambiente de desenvolvimento que é uma parte padrão das distribuições oficiais do Python; e :program:`Python Launcher`, que trata do duplo clique em scripts Python a partir do `Finder do macOS <https://support.apple.com/en-us/HT201732>`_.

source: A framework :file:`/Library/Frameworks/Python.framework`, which includes the Python executable and libraries. The installer adds this location to your shell path. To uninstall Python, you can remove these three things. Symlinks to the Python executable are placed in :file:`/usr/local/bin/`.
pt_pt: Um *framework* :file:`/Library/Frameworks/Python.framework`, que inclui o executável do Python e as bibliotecas. O instalador adiciona este local ao caminho da sua *shell*. Para desinstalar o Python, pode remover estas três coisas. Ligações simbólicas para o executável do Python são colocadas em :file:`/usr/local/bin/`.

source: Recent versions of macOS include a :command:`python3` command in :file:`/usr/bin/python3` that links to a usually older and incomplete version of Python provided by and for use by the Apple development tools, :program:`Xcode` or the :program:`Command Line Tools for Xcode`. You should never modify or attempt to delete this installation, as it is Apple-controlled and is used by Apple-provided or third-party software. If you choose to install a newer Python version from ``python.org``, you will have two different but functional Python installations on your computer that can co-exist. The default installer options should ensure that its :command:`python3` will be used instead of the system :command:`python3`.
pt_pt: Versões recentes do macOS incluem um comando :command:`python3` em :file:`/usr/bin/python3` que liga a uma versão geralmente mais antiga e incompleta do Python fornecida e para uso pelas ferramentas de desenvolvimento da Apple, :program:`Xcode` ou as :program:`Command Line Tools for Xcode`. Nunca deve modificar ou tentar eliminar esta instalação, pois é controlada pela Apple e é usada por software fornecido pela Apple ou por terceiros. Se optar por instalar uma versão mais recente do Python a partir do ``python.org``, terá duas instalações diferentes, mas funcionais, do Python no seu computador que podem coexistir. As opções predefinidas do instalador devem garantir que o seu :command:`python3` será usado em vez do :command:`python3` do sistema.

source: How to run a Python script
pt_pt: Como executar um script Python
ru: Как запустить скрипт Python

source: There are two ways to invoke the Python interpreter. If you are familiar with using a Unix shell in a terminal window, you can invoke |python_x_dot_y_literal| or ``python3`` optionally followed by one or more command line options (described in :ref:`using-on-general`). The Python tutorial also has a useful section on :ref:`using Python interactively from a shell <tut-interac>`.
pt_pt: Existem duas formas de invocar o interpretador Python. Se estiver familiarizado com a utilização de uma *shell* Unix numa janela de terminal, pode invocar |python_x_dot_y_literal| ou ``python3``, opcionalmente seguido por uma ou mais opções de linha de comando (descritas em :ref:`using-on-general`). O tutorial do Python também tem uma secção útil sobre :ref:`utilizar o Python interativamente a partir de uma shell <tut-interac>`.

source: You can also invoke the interpreter through an integrated development environment. :ref:`idle` is a basic editor and interpreter environment which is included with the standard distribution of Python. :program:`IDLE` includes a Help menu that allows you to access Python documentation. If you are completely new to Python, you can read the tutorial introduction in that document.
pt_pt: Também pode invocar o interpretador através de um ambiente de desenvolvimento integrado. :ref:`idle` é um editor básico e ambiente de interpretador que é incluído com a distribuição padrão do Python. O :program:`IDLE` inclui um menu Ajudar que permite aceder à documentação do Python. Se for completamente novo no Python, pode ler a introdução do tutorial nesse documento.

source: There are many other editors and IDEs available, see :ref:`editors` for more information.
pt_pt: Existem muitos outros editores e IDEs disponíveis; consulte :ref:`editors` para mais informações.

source: To run a Python script file from the terminal window, you can invoke the interpreter with the name of the script file:
pt_pt: Para executar um ficheiro de script Python a partir da janela do terminal, pode invocar o interpretador com o nome do ficheiro de script:

source: To run your script from the Finder, you can either:
pt_pt: Para executar o seu script a partir do Finder, pode:

source: Drag it to :program:`Python Launcher`.
pt_pt: Arrastá-lo para o :program:`Python Launcher`.
ru: Перетащите его в :program:`Python Launcher`.

source: Select :program:`Python Launcher` as the default application to open your script (or any ``.py`` script) through the Finder Info window and double-click it. :program:`Python Launcher` has various preferences to control how your script is launched. Option-dragging allows you to change these for one invocation, or use its ``Preferences`` menu to change things globally.
pt_pt: Selecionar :program:`Python Launcher` como a aplicação predefinida para abrir o seu script (ou qualquer script ``.py``) através da janela de Informação do Finder e fazer duplo clique. O :program:`Python Launcher` tem várias preferências para controlar como o seu script é lançado. Arraste com a tecla Option para alterar estas preferências para uma invocação, ou use o menu ``Preferences`` para alterar globalmente.

source: Be aware that running the script directly from the macOS Finder might produce different results than when running from a terminal window as the script will not be run in the usual shell environment including any setting of environment variables in shell profiles. And, as with any other script or program, be certain of what you are about to run.
pt_pt: Tenha em atenção que executar o script diretamente a partir do Finder do macOS pode produzir resultados diferentes do que quando executado a partir de uma janela de terminal, uma vez que o script não será executado no ambiente de *shell* habitual, incluindo qualquer definição de variáveis de ambiente nos perfis da *shell*. E, como com qualquer outro script ou programa, certifique-se do que está prestes a executar.

source: Alternative Distributions
pt_pt: Distribuições Alternativas

source: Besides the standard ``python.org`` for macOS installer, there are third-party distributions for macOS that may include additional functionality. Some popular distributions and their key features:
pt_pt: Além do instalador padrão ``python.org`` para macOS, existem distribuições de terceiros para macOS que podem incluir funcionalidades adicionais. Algumas distribuições populares e as suas principais características:

source: Installer with multi-platform compatibility, documentation
pt_pt: Instalador com compatibilidade multi-plataforma, documentação

source: Popular scientific modules (such as numpy, scipy, and pandas) and the ``conda`` package manager.
pt_pt: Módulos científicos populares (como numpy, scipy e pandas) e o gestor de pacotes ``conda``.

source: Package manager for macOS including multiple versions of Python and many third-party Python-based packages (including numpy, scipy, and pandas).
pt_pt: Gestor de pacotes para macOS que inclui várias versões do Python e muitos pacotes baseados em Python de terceiros (incluindo numpy, scipy e pandas).

source: Another package manager for macOS including multiple versions of Python and many third-party Python-based packages. May include pre-built versions of Python and many packages for older versions of macOS.
pt_pt: Outro gestor de pacotes para macOS que inclui várias versões do Python e muitos pacotes baseados em Python de terceiros. Pode incluir versões pré-construídas do Python e de muitos pacotes para versões mais antigas do macOS.

source: Note that distributions might not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
pt_pt: Note que as distribuições podem não incluir as versões mais recentes do Python ou de outras bibliotecas e não são mantidas ou suportadas pela equipa principal do Python.

source: Installing Additional Python Packages
pt_pt: A instalar pacotes adicionais do Python
ru: Установка дополнительных пакетов Python

source: Refer to the `Python Packaging User Guide`_ for more information.
pt_pt: Consulte o `Guia do Utilizador de Empacotamento do Python`_ para mais informações.

source: GUI Programming
pt_pt: Programação de Interface Gráfica
ru: Программирование с графическим интерфейсом

source: There are several options for building GUI applications on the Mac with Python.
pt_pt: Existem várias opções para construir aplicações de interface gráfica no Mac com Python.
ru: Существует несколько вариантов создания приложений с графическим интерфейсом на Mac с помощью Python.

source: The standard Python GUI toolkit is :mod:`tkinter`, based on the cross-platform Tk toolkit (https://www.tcl.tk). A macOS-native version of Tk is included with the installer.
pt_pt: O *toolkit* de interface gráfica padrão do Python é :mod:`tkinter`, baseado no *toolkit* multi-plataforma Tk (https://www.tcl.tk). Uma versão nativa do Tk para macOS está incluída com o instalador.

source: *PyObjC* is a Python binding to Apple's Objective-C/Cocoa framework. Information on PyObjC is available from :pypi:`pyobjc`.
pt_pt: *PyObjC* é uma ligação Python para o *framework* Objective-C/Cocoa da Apple. Informações sobre PyObjC estão disponíveis em :pypi:`pyobjc`.

source: A number of alternative macOS GUI toolkits are available including:
pt_pt: Várias alternativas de *toolkits* de interface gráfica para macOS estão disponíveis, incluindo:

source: `PySide <https://www.qt.io/qt-for-python>`_: Official Python bindings to the `Qt GUI toolkit <https://wiki.qt.io/Qt_for_Python>`_.
pt_pt: `PySide <https://www.qt.io/qt-for-python>`_: Ligações oficiais do Python para o *toolkit* de interface gráfica `Qt <https://wiki.qt.io/Qt_for_Python>`_.

source: `PyQt <https://riverbankcomputing.com/software/pyqt/>`_: Alternative Python bindings to Qt.
pt_pt: `PyQt <https://riverbankcomputing.com/software/pyqt/>`_: Ligações alternativas do Python para Qt.

source: `Kivy <https://kivy.org>`_: A cross-platform GUI toolkit that supports desktop and mobile platforms.
pt_pt: `Kivy <https://kivy.org>`_: Um *toolkit* de interface gráfica multi-plataforma que suporta plataformas de *desktop* e móveis.

source: `Toga <https://toga.readthedocs.io>`_: Part of the `BeeWare Project <https://beeware.org>`_; supports desktop, mobile, web and console apps.
pt_pt: `Toga <https://toga.readthedocs.io>`_: Parte do `Projeto BeeWare <https://beeware.org>`_; suporta aplicações de *desktop*, móveis, web e consola.

source: `wxPython <https://wxpython.org>`_: A cross-platform toolkit that supports desktop operating systems.
pt_pt: `wxPython <https://wxpython.org>`_: Um *toolkit* multi-plataforma que suporta sistemas operativos de *desktop*.

source: Advanced Topics
pt_pt: Tópicos Avançados

source: Installing Free-threaded Binaries
pt_pt: A instalar binários *free-threaded*

source: Known cautions and limitations:
pt_pt: Avisos e limitações conhecidos:

source: The **UNIX command-line tools** package, which is selected by default, will install links in :file:`/usr/local/bin` for |python_x_dot_y_t_literal|, the free-threaded interpreter, and |python_x_dot_y_t_literal_config|, a configuration utility which may be useful for package builders. Since :file:`/usr/local/bin` is typically included in your shell ``PATH``, in most cases no changes to your ``PATH`` environment variables should be needed to use |python_x_dot_y_t_literal|.
pt_pt: O pacote **Ferramentas de linha de comando UNIX**, que é selecionado por predefinição, instalará ligações em :file:`/usr/local/bin` para |python_x_dot_y_t_literal|, o interpretador *free-threaded*, e |python_x_dot_y_t_literal_config|, uma utilidade de configuração que pode ser útil para construtores de pacotes. Como :file:`/usr/local/bin` está tipicamente incluído no ``PATH`` da sua *shell*, na maioria dos casos não serão necessárias alterações às suas variáveis de ambiente ``PATH`` para usar |python_x_dot_y_t_literal|.

source: The free-threaded build and the traditional build have separate search paths and separate :file:`site-packages` directories so, by default, if you need a package available in both builds, it may need to be installed in both. The free-threaded package will install a separate instance of :program:`pip` for use with |python_x_dot_y_t_literal|.
pt_pt: A construção *free-threaded* e a construção tradicional têm caminhos de pesquisa separados e diretórios :file:`site-packages` separados, por isso, por predefinição, se precisar de um pacote disponível em ambas as construções, pode ser necessário instalá-lo em ambas. O pacote *free-threaded* instalará uma instância separada do :program:`pip` para uso com |python_x_dot_y_t_literal|.

source: To install a package using :command:`pip` without a :command:`venv`:
pt_pt: Para instalar um pacote usando :command:`pip` sem um :command:`venv`:

source: python\ |version|\ t -m pip install <package_name>
pt_pt: python\ |version|\ t -m pip install <nome_do_pacote>

source: When working with multiple Python environments, it is usually safest and easiest to :ref:`create and use virtual environments <tut-venv>`. This can avoid possible command name conflicts and confusion about which Python is in use:
pt_pt: Ao trabalhar com vários ambientes Python, é geralmente mais seguro e fácil :ref:`criar e usar ambientes virtuais <tut-venv>`. Isto pode evitar possíveis conflitos de nomes de comandos e confusão sobre qual Python está em uso:

source: python\ |version|\ t -m venv <venv_name>
pt_pt: python\ |version|\ t -m venv <nome_do_venv>

source: then :command:`activate`.
pt_pt: depois :command:`activate`.

source: To run a free-threaded version of IDLE:
pt_pt: Para executar uma versão *free-threaded* do IDLE:

source: The interpreters in both builds respond to the same :ref:`PYTHON environment variables <using-on-envvars>` which may have unexpected results, for example, if you have ``PYTHONPATH`` set in a shell profile. If necessary, there are :ref:`command line options <using-on-interface-options>` like ``-E`` to ignore these environment variables.
pt_pt: Os interpretadores em ambas as construções respondem às mesmas :ref:`variáveis de ambiente PYTHON <using-on-envvars>`, o que pode ter resultados inesperados, por exemplo, se tiver ``PYTHONPATH`` definido num perfil de *shell*. Se necessário, existem :ref:`opções de linha de comando <using-on-interface-options>` como ``-E`` para ignorar estas variáveis de ambiente.

source: The free-threaded build links to the third-party shared libraries, such as ``OpenSSL`` and ``Tk``, installed in the traditional framework. This means that both builds also share one set of trust certificates as installed by the :command:`Install Certificates.command` script, thus it only needs to be run once.
pt_pt: A construção *free-threaded* liga-se às bibliotecas partilhadas de terceiros, como ``OpenSSL`` e ``Tk``, instaladas no *framework* tradicional. Isto significa que ambas as construções também partilham um conjunto de certificados de confiança, conforme instalado pelo script :command:`Install Certificates.command`, portanto, só precisa de ser executado uma vez.

source: If you cannot depend on the link in ``/usr/local/bin`` pointing to the ``python.org`` free-threaded |python_x_dot_y_t_literal| (for example, if you want to install your own version there or some other distribution does), you can explicitly set your shell ``PATH`` environment variable to include the ``PythonT`` framework ``bin`` directory:
pt_pt: Se não puder depender da ligação em ``/usr/local/bin`` que aponta para o |python_x_dot_y_t_literal| *free-threaded* do ``python.org`` (por exemplo, se pretender instalar a sua própria versão lá ou se outra distribuição o fizer), pode definir explicitamente a variável de ambiente ``PATH`` da sua *shell* para incluir o diretório ``bin`` do *framework* ``PythonT``:
