Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/__future__.po
Languages: es_es

source: :mod:`!__future__` --- Future statement definitions
es_es: :mod:`!__future__` --- Futuras definiciones de las declaraciones

source: **Source code:** :source:`Lib/__future__.py`
es_es: **Código fuente:** :source:`Lib/__future__.py`

source: Imports of the form ``from __future__ import feature`` are called :ref:`future statements <future>`. These are special-cased by the Python compiler to allow the use of new Python features in modules containing the future statement before the release in which the feature becomes standard.
es_es: Las importaciones de la forma ``from __future__ import feature`` se denominan :ref:`future statements <future>`. El compilador de Python las utiliza en casos especiales para permitir el uso de nuevas características de Python en módulos que contienen la sentencia future antes de la versión en la que la característica se convierte en estándar.

source: While these future statements are given additional special meaning by the Python compiler, they are still executed like any other import statement and the :mod:`__future__` exists and is handled by the import system the same way any other Python module would be. This design serves three purposes:
es_es: Aunque estas sentencias future reciben un significado especial adicional por parte del compilador de Python, se ejecutan como cualquier otra sentencia import y :mod:`__future__` existe y es manejado por el sistema import de la misma forma que cualquier otro módulo de Python. Este diseño tiene tres propósitos:

source: To avoid confusing existing tools that analyze import statements and expect to find the modules they're importing.
es_es: Para evitar confundir a las herramientas existentes que analizan las sentencias import y esperan encontrar los módulos que están importando.

source: To document when incompatible changes were introduced, and when they will be --- or were --- made mandatory. This is a form of executable documentation, and can be inspected programmatically via importing :mod:`__future__` and examining its contents.
es_es: Documentar cuándo se introdujeron cambios incompatibles y cuándo serán -o fueron- obligatorios. Esta es una forma de documentación ejecutable, y puede inspeccionarse mediante programación importando :mod:`__future__` y examinando su contenido.

source: To ensure that :ref:`future statements <future>` run under releases prior to Python 2.1 at least yield runtime exceptions (the import of :mod:`__future__` will fail, because there was no module of that name prior to 2.1).
es_es: Para asegurar que las sentencias :ref:`future <future>` ejecutadas bajo versiones anteriores a Python 2.1 produzcan al menos excepciones en tiempo de ejecución (la importación de :mod:`__future__` fallará, porque no existía un módulo con ese nombre antes de 2.1).

source: Module Contents
es_es: Contenidos del módulo

source: No feature description will ever be deleted from :mod:`__future__`. Since its introduction in Python 2.1 the following features have found their way into the language using this mechanism:
es_es: Ninguna descripción de característica se borrará nunca de :mod:`__future__`. Desde su introducción en Python 2.1 las siguientes características han encontrado su camino en el lenguaje usando este mecanismo:

source: feature
es_es: función

source: optional in
es_es: opcional en

source: mandatory in
es_es: obligatorio en

source: effect
es_es: efecto

source: :pep:`227`: *Statically Nested Scopes*
es_es: :pep:`227`: *Ámbitos anidados estáticamente*

source: generators
es_es: generadores

source: :pep:`255`: *Simple Generators*
es_es: :pep:`255`: *Generadores simples*

source: division
es_es: división

source: :pep:`238`: *Changing the Division Operator*
es_es: :pep:`238`: *Cambiar el operador de división*

source: :pep:`328`: *Imports: Multi-Line and Absolute/Relative*
es_es: :pep:`328`: *Importaciones: Multilínea y Absoluta/Relativa*.

source: :pep:`343`: *The "with" Statement*
es_es: :pep:`343`: *La declaración "con "*

source: :pep:`3105`: *Make print a function*
es_es: :pep:`3105`: *Hacer de print una función*

source: :pep:`3112`: *Bytes literals in Python 3000*
es_es: :pep:`3112`: *Bytes literales en Python 3000*

source: :pep:`479`: *StopIteration handling inside generators*
es_es: :pep:`479`: *Manejo de StopIteration dentro de generadores*

source: annotations
es_es: anotaciones

source: :pep:`563`: *Postponed evaluation of annotations*
es_es: :pep:`563`: *Aplazamiento de la evaluación de las anotaciones*

source: Each statement in :file:`__future__.py` is of the form::
es_es: Cada declaración en :file:`__future__.py` es de la forma::

source: where, normally, *OptionalRelease* is less than *MandatoryRelease*, and both are 5-tuples of the same form as :data:`sys.version_info`::
es_es: donde, normalmente, *LiberaciónOpcional* es menor que *LiberaciónObligatoria*, y ambas son 5-tuplas de la misma forma que :data:`sys.version_info`::

source: *OptionalRelease* records the first release in which the feature was accepted.
es_es: *OptionalRelease* registra la primera versión en la que se aceptó la función.

source: In the case of a *MandatoryRelease* that has not yet occurred, *MandatoryRelease* predicts the release in which the feature will become part of the language.
es_es: En el caso de un *MandatoryRelease* que aún no se ha producido, *MandatoryRelease* predice la versión en la que la característica formará parte del lenguaje.

source: Else *MandatoryRelease* records when the feature became part of the language; in releases at or after that, modules no longer need a future statement to use the feature in question, but may continue to use such imports.
es_es: Además *MandatoryRelease* registra el momento en que la característica pasó a formar parte del lenguaje; en las versiones de ese momento o posteriores, los módulos ya no necesitan una declaración futura para utilizar la característica en cuestión, pero pueden seguir utilizando dichas importaciones.

source: *MandatoryRelease* may also be ``None``, meaning that a planned feature got dropped or that it is not yet decided.
es_es: *MandatoryRelease* también puede ser ``None``, lo que significa que una característica prevista se ha descartado o que aún no está decidida.

source: *CompilerFlag* is the (bitfield) flag that should be passed in the fourth argument to the built-in function :func:`compile` to enable the feature in dynamically compiled code. This flag is stored in the :attr:`_Feature.compiler_flag` attribute on :class:`_Feature` instances.
es_es: *CompilerFlag* es la bandera (bitfield) que debe pasarse en el cuarto argumento a la función incorporada :func:`compile` para habilitar la característica en código compilado dinámicamente. Este indicador se almacena en el atributo :attr:`_Feature.compiler_flag` de las instancias de :class:`_Feature`.

source: ``from __future__ import annotations`` was previously scheduled to become mandatory in Python 3.10, but the Python Steering Council twice decided to delay the change (`announcement for Python 3.10 <https://mail.python.org/archives/list/python-dev@python.org/message/CLVXXPQ2T2LQ5MP2Y53VVQFCXYWQJHKZ/>`__; `announcement for Python 3.11 <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__). No final decision has been made yet. See also :pep:`563` and :pep:`649`.
es_es: ``from __future__ import annotations`` estaba previsto que fuera obligatorio en Python 3.10, pero el Consejo Directivo de Python decidió retrasar el cambio en dos ocasiones (`announcement for Python 3.10 <https://mail.python.org/archives/list/python-dev@python.org/message/CLVXXPQ2T2LQ5MP2Y53VVQFCXYWQJHKZ/>`__; `announcement for Python 3.11 <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__). Aún no se ha tomado una decisión definitiva. Véase también :pep:`563` y :pep:`649`.

source: How the compiler treats future imports.
es_es: Cómo trata el compilador las importaciones futuras.

source: :pep:`236` - Back to the __future__
es_es: :pep:`236` - Volver al __future__

source: The original proposal for the __future__ mechanism.
es_es: La propuesta original del __future__ mechanism.
