Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-extending.po
Languages: es_es, sv

source: Extending
es_es: Ampliar
sv: Utvidga

source: The main direction for :mod:`asyncio` extending is writing custom *event loop* classes. Asyncio has helpers that could be used to simplify this task.
es_es: La dirección principal para extender :mod:`asyncio` es escribir clases *event loop* personalizadas. Asyncio tiene ayudantes que podrían utilizarse para simplificar esta tarea.
sv: Den huvudsakliga inriktningen för :mod:`asyncio`\-utvidgning är att skriva anpassade *event loop*-klasser. Asyncio har hjälpmedel som kan användas för att förenkla denna uppgift.

source: Third-parties should reuse existing asyncio code with caution, a new Python version is free to break backward compatibility in *internal* part of API.
es_es: Los terceros deben reutilizar el código asyncio existente con precaución, una nueva versión de Python es libre de romper la compatibilidad con versiones anteriores en la parte *interna* de la API.
sv: Tredje part bör återanvända befintlig asynciokod med försiktighet, en ny Python-version är fri att bryta bakåtkompatibilitet i *intern* del av API.

source: Writing a Custom Event Loop
es_es: Escribir un bucle de eventos personalizado
sv: Skriva en anpassad händelseslinga

source: :class:`asyncio.AbstractEventLoop` declares very many methods. Implementing all them from scratch is a tedious job.
es_es: :class:`asyncio.AbstractEventLoop` declara muchos métodos. Implementarlos todos desde cero es un trabajo tedioso.
sv: :class:`asyncio.AbstractEventLoop` deklarerar väldigt många metoder. Att implementera dem alla från grunden är ett tråkigt jobb.

source: A loop can get many common methods implementation for free by inheriting from :class:`asyncio.BaseEventLoop`.
es_es: Un bucle puede obtener gratuitamente la implementación de muchos métodos comunes heredando de :class:`asyncio.BaseEventLoop`.
sv: En loop kan få många vanliga metoder implementerade gratis genom att ärva från :class:`asyncio.BaseEventLoop`.

source: In turn, the successor should implement a bunch of *private* methods declared but not implemented in :class:`asyncio.BaseEventLoop`.
es_es: A su vez, el sucesor debe implementar un montón de métodos *private* declarados pero no implementados en :class:`asyncio.BaseEventLoop`.
sv: Efterträdaren ska i sin tur implementera ett antal *privata* metoder som deklarerats men inte implementerats i :class:`asyncio.BaseEventLoop`.

source: For example, ``loop.create_connection()`` checks arguments, resolves DNS addresses, and calls ``loop._make_socket_transport()`` that should be implemented by inherited class. The ``_make_socket_transport()`` method is not documented and is considered as an *internal* API.
es_es: Por ejemplo, ``loop.create_connection()`` comprueba los argumentos, resuelve las direcciones DNS y llama a ``loop._make_socket_transport()`` que debería ser implementado por la clase heredada. El método ``_make_socket_transport()`` no está documentado y se considera una API *internal*.
sv: Till exempel kontrollerar ``loop.create_connection()`` argument, löser DNS-adresser och anropar ``loop._make_socket_transport()`` som bör implementeras av en ärvd klass. Metoden ``_make_socket_transport()`` är inte dokumenterad och betraktas som ett *internt* API.

source: Future and Task private constructors
es_es: Constructores privados Future y Task
sv: Privata konstruktörer för Future och Task

source: :class:`asyncio.Future` and :class:`asyncio.Task` should be never created directly, please use corresponding :meth:`loop.create_future` and :meth:`loop.create_task`, or :func:`asyncio.create_task` factories instead.
es_es: :class:`asyncio.Future` y :class:`asyncio.Task` nunca deben crearse directamente, utilice en su lugar las fábricas correspondientes :meth:`loop.create_future` y :meth:`loop.create_task`, o :func:`asyncio.create_task`.
sv: :class:`asyncio.Future` och :class:`asyncio.Task` bör aldrig skapas direkt, använd istället motsvarande :meth:`loop.create_future` och :meth:`loop.create_task`, eller :func:`asyncio.create_task` fabriker.

source: However, third-party *event loops* may *reuse* built-in future and task implementations for the sake of getting a complex and highly optimized code for free.
es_es: Sin embargo, los *event loops* de terceros pueden *reutilizar* implementaciones incorporadas de futuros y tareas con tal de obtener un código complejo y altamente optimizado de forma gratuita.
sv: Tredjeparts *händelseslingor* kan dock *återanvända* inbyggda framtids- och uppgiftsimplementeringar för att få en komplex och mycket optimerad kod gratis.

source: For this purpose the following, *private* constructors are listed:
es_es: Con este fin se enumeran los siguientes constructores *privados*:
sv: För detta ändamål listas följande, *privata* konstruktörer:

source: Create a built-in future instance.
es_es: Crear una instancia futura incorporada.
sv: Skapa en inbyggd framtida instans.

source: *loop* is an optional event loop instance.
es_es: *loop* es una instancia opcional del bucle de eventos.
sv: *loop* är en valfri instans för händelseslinga.

source: Create a built-in task instance.
es_es: Crear una instancia de tarea integrada.
sv: Skapa en inbyggd uppgiftsinstans.

source: *loop* is an optional event loop instance. The rest of arguments are described in :meth:`loop.create_task` description.
es_es: *loop* es una instancia opcional del bucle de eventos. El resto de argumentos se describen en :meth:`loop.create_task` descripción.
sv: *loop* är en valfri instans för händelseslingan. Resten av argumenten beskrivs i beskrivningen av :meth:`loop.create_task`.

source: *context* argument is added.
es_es: Se añade el argumento *context*.
sv: *context*-argumentet läggs till.

source: Task lifetime support
es_es: Apoyo a las tareas durante toda su vida útil
sv: Stöd för uppdragets livslängd

source: A third party task implementation should call the following functions to keep a task visible by :func:`asyncio.all_tasks` and :func:`asyncio.current_task`:
es_es: Una implementación de tarea de terceros debe llamar a las siguientes funciones para mantener una tarea visible por :func:`asyncio.all_tasks` y :func:`asyncio.current_task`:
sv: En tredjepartsuppgiftsimplementering bör anropa följande funktioner för att hålla en uppgift synlig för :func:`asyncio.all_tasks` och :func:`asyncio.current_task`:

source: Register a new *task* as managed by *asyncio*.
es_es: Registrar una nueva *tarea* como gestionada por *asyncio*.
sv: Registrera en ny *task* som hanteras av *asyncio*.

source: Call the function from a task constructor.
es_es: Llamar a la función desde un constructor de tarea.
sv: Anropa funktionen från en task-konstruktör.

source: Unregister a *task* from *asyncio* internal structures.
es_es: Dar de baja una *tarea* de las estructuras internas de *asyncio*.
sv: Avregistrera en *task* från *asyncio* interna strukturer.

source: The function should be called when a task is about to finish.
es_es: La función debe ser llamada cuando una tarea está a punto de terminar.
sv: Funktionen ska anropas när en uppgift är på väg att avslutas.

source: Switch the current task to the *task* argument.
es_es: Cambia la tarea actual al argumento *task*.
sv: Byt den aktuella uppgiften till argumentet *task*.

source: Call the function just before executing a portion of embedded *coroutine* (:meth:`coroutine.send` or :meth:`coroutine.throw`).
es_es: Llama a la función justo antes de ejecutar una porción de *coroutine* incrustada (:meth:`coroutine.send` o :meth:`coroutine.throw`).
sv: Anropa funktionen precis innan du utför en del av en inbäddad *coroutine* (:meth:`coroutine.send` eller :meth:`coroutine.throw`).

source: Switch the current task back from *task* to ``None``.
es_es: Vuelve a cambiar la tarea actual de *task* a ``None``.
sv: Byt tillbaka den aktuella uppgiften från *task* till ``None``.

source: Call the function just after :meth:`coroutine.send` or :meth:`coroutine.throw` execution.
es_es: Llame a la función justo después de la ejecución de :meth:`coroutine.send` o :meth:`coroutine.throw`.
sv: Anropa funktionen precis efter att :meth:`coroutine.send` eller :meth:`coroutine.throw` har körts.
