Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-subprocess.po
Languages: es_es, ru

source: Spawning a subprocess with *inactive* current child watcher raises :exc:`RuntimeError`.
es_es: La creación de un subproceso con un vigilante hijo actual *inactivo* plantea :exc:`RuntimeError`.
ru: Порождение подпроцесса с *неактивным* текущим дочерним наблюдателем вызывает :exc:`RuntimeError`.

source: Note that alternative event loop implementations might have own limitations; please refer to their documentation.
es_es: Tenga en cuenta que las implementaciones alternativas del bucle de eventos pueden tener sus propias limitaciones; consulte su documentación.
ru: Обратите внимание, что альтернативные реализации цикла событий могут иметь свои ограничения; пожалуйста, обратитесь к их документации.

source: The :ref:`Concurrency and multithreading in asyncio <asyncio-multithreading>` section.
es_es: La sección :ref:`Concurrency and multithreading in asyncio <asyncio-multithreading>`.
ru: Раздел :ref:`Параллелизм и многопоточность в asyncio <asyncio-multithreading>`.

source: Examples
es_es: Ejemplos
ru: Примеры

source: An example using the :class:`~asyncio.subprocess.Process` class to control a subprocess and the :class:`StreamReader` class to read from its standard output.
es_es: Un ejemplo utilizando la clase :class:`~asyncio.subprocess.Process` para controlar un subproceso y la clase :class:`StreamReader` para leer de su salida estándar.
ru: Пример использования класса :class:`~asyncio.subprocess.Process` для управления подпроцессом и класса :class:`StreamReader` для чтения из его стандартного вывода.

source: The subprocess is created by the :func:`create_subprocess_exec` function::
es_es: El subproceso se crea mediante la función :func:`create_subprocess_exec`::
ru: Подпроцесс создается функцией :func:`create_subprocess_exec`::

source: import asyncio import sys async def get_date(): code = 'import datetime; print(datetime.datetime.now())' # Create the subprocess; redirect the standard output # into a pipe. proc = await asyncio.create_subprocess_exec( sys.executable, '-c', code, stdout=asyncio.subprocess.PIPE) # Read one line of output. data = await proc.stdout.readline() line = data.decode('ascii').rstrip() # Wait for the subprocess exit. await proc.wait() return line date = asyncio.run(get_date()) print(f"Current date: {date}")
es_es: import asyncio import sys async def get_date(): code = 'import datetime; print(datetime.datetime.now())' # Crea el subproceso; redirige la salida estándar # a una tubería. proc = await asyncio.create_subprocess_exec( sys.executable, '-c', code, stdout=asyncio.subprocess.PIPE) # Leer una línea de salida. data = await proc.stdout.readline() line = data.decode('ascii').rstrip() # Espera la salida del subproceso. await proc.wait() devolver linea date = asyncio.run(get_date()) print(f"Current date: {date}")

source: See also the :ref:`same example <asyncio_example_subprocess_proto>` written using low-level APIs.
es_es: Ver también el :ref:`same example <asyncio_example_subprocess_proto>` escrito utilizando APIs de bajo nivel.
ru: См. также тот же пример <asyncio_example_subprocess_proto>, написанный с использованием низкоуровневых API.
