Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: es_es, pt_pt

source: *ssl_handshake_timeout* is (for a TLS server) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
es_es: *ssl_handshake_timeout* es (para un servidor TLS) el tiempo en segundos que se debe esperar a que se complete el handshake TLS antes de abortar la conexión. ``60.0`` segundos si ``None`` (por defecto).
pt_pt: *ssl_handshake_timeout* é (para um servidor TLS) o tempo em segundos para aguardar que o TLS handshake seja concluído antes de abortar a ligação. ``60.0`` segundos se for ``None`` (predefinição).

source: *start_serving* set to ``True`` (the default) causes the created server to start accepting connections immediately. When set to ``False``, the user should await on :meth:`Server.start_serving` or :meth:`Server.serve_forever` to make the server to start accepting connections.
es_es: *start_serving* establecido en ``True`` (por defecto) hace que el servidor creado empiece a aceptar conexiones inmediatamente. Cuando se establece en ``False``, el usuario debe esperar en :meth:`Server.start_serving` o :meth:`Server.serve_forever` para que el servidor comience a aceptar conexiones.
pt_pt: *start_serving* definido como ``True`` (predefinição) faz com que o servidor criado comece a aceitar ligações imediatamente. Quando definido como ``False``, o utilizador deve aguardar por :meth:`Server.start_serving` ou :meth:`Server.serve_forever` para que o servidor comece a aceitar ligações.

source: The *host* parameter can be a sequence of strings.
es_es: El parámetro *host* puede ser una secuencia de cadenas.
pt_pt: O parâmetro *host* pode ser uma sequência de strings.

source: Added *ssl_handshake_timeout* and *start_serving* parameters. The socket option :ref:`socket.TCP_NODELAY <socket-unix-constants>` is set by default for all TCP connections.
es_es: Добавлены параметры *ssl_handshake_timeout* и *start_serving*. Опция сокета :ref:`socket.TCP_NODELAY <socket-unix-constants>` установлена ​​по умолчанию для всех TCP-соединений.
pt_pt: Adicionados os parâmetros *ssl_handshake_timeout* e *start_serving*. A opção de socket :ref:`socket.TCP_NODELAY <socket-unix-constants>` é definida por predefinição para todas as ligações TCP.

source: The :func:`start_server` function is a higher-level alternative API that returns a pair of :class:`StreamReader` and :class:`StreamWriter` that can be used in an async/await code.
es_es: La función :func:`start_server` es una API alternativa de nivel superior que devuelve un par de :class:`StreamReader` y :class:`StreamWriter` que pueden utilizarse en un código async/await.
pt_pt: A função :func:`start_server` é uma API alternativa de alto nível que devolve um par de :class:`StreamReader` e :class:`StreamWriter` que pode ser utilizado em código async/await.

source: Similar to :meth:`loop.create_server` but works with the :py:const:`~socket.AF_UNIX` socket family.
es_es: Похож на :meth:`loop.create_server`, но работает с семейством сокетов :py:const:`~socket.AF_UNIX`.
pt_pt: Semelhante a :meth:`loop.create_server`, mas funciona com a família de sockets :py:const:`~socket.AF_UNIX`.

source: *path* is the name of a Unix domain socket, and is required, unless a *sock* argument is provided. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
es_es: *path* es el nombre de un socket de dominio Unix, y es obligatorio, a menos que se proporcione un argumento *sock*. Se admiten los sockets Unix abstractos, las rutas :class:`str`, :class:`bytes` y :class:`~pathlib.Path`.
pt_pt: *path* é o nome de um socket de domínio Unix e é obrigatório, a menos que seja fornecido um argumento *sock*. São suportados sockets Unix abstratos, :class:`str`, :class:`bytes` e caminhos :class:`~pathlib.Path`.

source: If *cleanup_socket* is true then the Unix socket will automatically be removed from the filesystem when the server is closed, unless the socket has been replaced after the server has been created.
es_es: Если *cleanup_socket* имеет значение true, сокет Unix будет автоматически удален из файловой системы при закрытии сервера, если только сокет не был заменен после создания сервера.

source: See the documentation of the :meth:`loop.create_server` method for information about arguments to this method.
es_es: Consulte la documentación del método :meth:`loop.create_server` para obtener información sobre los argumentos de este método.
pt_pt: Consulte a documentação do método :meth:`loop.create_server` para obter informações sobre os argumentos deste método.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :class:`~pathlib.Path` object.
es_es: Додано параметри *ssl_handshake_timeout* і *start_serving*. Параметр *path* тепер може бути об’єктом :class:`~pathlib.Path`.
pt_pt: Adicionados os parâmetros *ssl_handshake_timeout* e *start_serving*. O parâmetro *path* agora pode ser um objeto :class:`~pathlib.Path`.

source: Added the *cleanup_socket* parameter.
es_es: Добавлен параметр *cleanup_socket*.

source: Wrap an already accepted connection into a transport/protocol pair.
es_es: Envuelve una conexión ya aceptada en un par transporte/protocolo.
pt_pt: Encapsula uma ligação já aceite num par transporte/protocolo.

source: This method can be used by servers that accept connections outside of asyncio but that use asyncio to handle them.
es_es: Este método puede ser utilizado por servidores que aceptan conexiones fuera de asyncio pero que utilizan asyncio para gestionarlas.
pt_pt: Este método pode ser utilizado por servidores que aceitam ligações fora do asyncio, mas que utilizam o asyncio para as tratar.

source: Parameters:
es_es: Parámetros:
pt_pt: Parâmetros:

source: *sock* is a preexisting socket object returned from :meth:`socket.accept <socket.socket.accept>`.
es_es: *sock* es un objeto socket preexistente devuelto por :meth:`socket.accept <socket.socket.accept>`.
pt_pt: *sock* é um objeto socket pré-existente devolvido por :meth:`socket.accept <socket.socket.accept>`.

source: *ssl* can be set to an :class:`~ssl.SSLContext` to enable SSL over the accepted connections.
es_es: *ssl* puede establecerse en :class:`~ssl.SSLContext` para habilitar SSL en las conexiones aceptadas.
pt_pt: *ssl* pode ser definido como um :class:`~ssl.SSLContext` para ativar SSL nas ligações aceites.

source: *ssl_handshake_timeout* is (for an SSL connection) the time in seconds to wait for the SSL handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
es_es: *ssl_handshake_timeout* es (para una conexión SSL) el tiempo en segundos que se debe esperar a que se complete el handshake SSL antes de abortar la conexión. ``60.0`` segundos si ``None`` (por defecto).
pt_pt: *ssl_handshake_timeout* é (para uma ligação SSL) o tempo em segundos para aguardar que o SSL handshake seja concluído antes de abortar a ligação. ``60.0`` segundos se for ``None`` (predefinição).

source: Returns a ``(transport, protocol)`` pair.
es_es: Devuelve un par ``(transport, protocol)``.
pt_pt: Devolve um par ``(transport, protocol)``.

source: Transferring files
es_es: Transferencia de archivos
pt_pt: Transferência de ficheiros

source: Send a *file* over a *transport*. Return the total number of bytes sent.
es_es: Envía un *fichero* a través de un *transporte*. Devuelve el número total de bytes enviados.
pt_pt: Envie um *ficheiro* através de um *transporte*. Devolve o número total de bytes enviados.

source: The method uses high-performance :meth:`os.sendfile` if available.
es_es: El método utiliza :meth:`os.sendfile` de alto rendimiento si está disponible.
pt_pt: O método utiliza :meth:`os.sendfile` de alto desempenho, se disponível.

source: *file* must be a regular file object opened in binary mode.
es_es: *fichero* debe ser un objeto fichero normal abierto en modo binario.
pt_pt: *file* deve ser um objeto de ficheiro regular aberto em modo binário.

source: *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is always updated, even when this method raises an error, and :meth:`file.tell() <io.IOBase.tell>` can be used to obtain the actual number of bytes sent.
es_es: *offset* indica desde dónde empezar a leer el fichero. Si se especifica, *count* es el número total de bytes a transmitir en lugar de enviar el fichero hasta alcanzar EOF. La posición del fichero siempre se actualiza, incluso cuando este método produce un error, y :meth:`file.tell() <io.IOBase.tell>` puede utilizarse para obtener el número real de bytes enviados.
pt_pt: *offset* indica de onde começar a ler o ficheiro. Se especificado, *count* é o número total de bytes a transmitir, em vez de enviar o ficheiro até atingir o EOF. A posição do ficheiro é sempre atualizada, mesmo quando este método levanta um erro, e :meth:`file.tell() <io.IOBase.tell>` pode ser utilizado para obter o número real de bytes enviados.

source: *fallback* set to ``True`` makes asyncio to manually read and send the file when the platform does not support the sendfile system call (e.g. Windows or SSL socket on Unix).
es_es: *fallback* establecido en ``True`` hace que asyncio lea y envíe manualmente el archivo cuando la plataforma no soporta la llamada al sistema sendfile (por ejemplo, Windows o socket SSL en Unix).
pt_pt: *fallback* definido como ``True`` faz com que o asyncio leia e envie manualmente o ficheiro quando a plataforma não suporta a chamada de sistema sendfile (por exemplo, Windows ou socket SSL em Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support the *sendfile* syscall and *fallback* is ``False``.
es_es: Lanza :exc:`SendfileNotAvailableError` si el sistema no soporta la llamada syscall *sendfile* y *fallback* es ``False``.
pt_pt: Levanta :exc:`SendfileNotAvailableError` se o sistema não suportar a chamada de sistema *sendfile* e *fallback* for ``False``.

source: TLS Upgrade
es_es: Actualización de TLS
pt_pt: Atualização TLS

source: Upgrade an existing transport-based connection to TLS.
es_es: Actualizar una conexión basada en transporte existente a TLS.
pt_pt: Atualiza uma ligação baseada em transporte existente para TLS.

source: Create a TLS coder/decoder instance and insert it between the *transport* and the *protocol*. The coder/decoder implements both *transport*-facing protocol and *protocol*-facing transport.
es_es: Создайте экземпляр кодера/декодера TLS и вставьте его между *транспортом* и *протоколом*. Кодер/декодер реализует как протокол, ориентированный на *транспорт*, так и транспорт, ориентированный на *протокол*.
pt_pt: Cria uma instância de codificador/descodificador TLS e insere-a entre o *transporte* e o *protocolo*. O codificador/descodificador implementa tanto o protocolo voltado para o *transporte* como o transporte voltado para o *protocolo*.

source: Return the created two-interface instance. After *await*, the *protocol* must stop using the original *transport* and communicate with the returned object only because the coder caches *protocol*-side data and sporadically exchanges extra TLS session packets with *transport*.
es_es: Верните созданный двухинтерфейсный экземпляр. После *await* *протокол* должен прекратить использование исходного *транспорта* и взаимодействовать с возвращаемым объектом только потому, что кодер кэширует данные на стороне *протокола* и время от времени обменивается дополнительными пакетами сеанса TLS с *транспортом*.
pt_pt: Devolve a instância de duas interfaces criada. Após *await*, o *protocolo* deve parar de utilizar o *transporte* original e comunicar apenas com o objeto devolvido, porque o codificador guarda em cache dados do lado do *protocolo* e troca esporadicamente pacotes adicionais da sessão TLS com o *transporte*.

source: In some situations (e.g. when the passed transport is already closing) this may return ``None``.
es_es: В некоторых ситуациях (например, когда переданный транспорт уже закрывается) это может возвращать None.
pt_pt: Em algumas situações (por exemplo, quando o transporte passado já está a fechar), isto pode devolver ``None``.

source: *transport* and *protocol* instances that methods like :meth:`~loop.create_server` and :meth:`~loop.create_connection` return.
es_es: instancias *transport* y *protocol* que devuelven métodos como :meth:`~loop.create_server` y :meth:`~loop.create_connection`.
pt_pt: Instâncias de *transporte* e *protocolo* que métodos como :meth:`~loop.create_server` e :meth:`~loop.create_connection` devolvem.

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
es_es: *sslcontext*: una instancia configurada de :class:`~ssl.SSLContext`.
pt_pt: *sslcontext*: uma instância configurada de :class:`~ssl.SSLContext`.

source: *server_side* pass ``True`` when a server-side connection is being upgraded (like the one created by :meth:`~loop.create_server`).
es_es: *server_side* pasa ``True`` cuando se está actualizando una conexión del lado del servidor (como la creada por :meth:`~loop.create_server`).
pt_pt: *server_side* passe ``True`` quando uma ligação do lado do servidor está a ser atualizada (como a criada por :meth:`~loop.create_server`).

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
es_es: *server_hostname*: establece o anula el nombre de host con el que se comparará el certificado del servidor de destino.
pt_pt: *server_hostname*: define ou substitui o nome do host contra o qual o certificado do servidor de destino será comparado.

source: Watching file descriptors
es_es: Vigilancia de descriptores de archivos
pt_pt: Observação de descritores de ficheiros

source: Start monitoring the *fd* file descriptor for read availability and invoke *callback* with the specified arguments once *fd* is available for reading.
es_es: Comienza a monitorizar el descriptor de fichero *fd* para disponibilidad de lectura e invoca *callback* con los argumentos especificados una vez que *fd* está disponible para lectura.
pt_pt: Inicia a monitorização do descritor de ficheiro *fd* para disponibilidade de leitura e invoca *callback* com os argumentos especificados assim que *fd* estiver disponível para leitura.

source: Any preexisting callback registered for *fd* is cancelled and replaced by *callback*.
es_es: 任何为 *fd* 注册的预先存在的回调都会被取消并由 *callback* 代替。
pt_pt: Qualquer chamada de retorno pré-existente registada para *fd* é cancelada e substituída por *callback*.

source: Stop monitoring the *fd* file descriptor for read availability. Returns ``True`` if *fd* was previously being monitored for reads.
es_es: Прекратите мониторинг файлового дескриптора *fd* на предмет доступности чтения. Возвращает ``True``, если *fd* ранее отслеживался на предмет чтения.
pt_pt: Para de monitorizar o descritor de ficheiro *fd* para disponibilidade de leitura. Devolve ``True`` se *fd* estava a ser monitorizado para leituras.

source: Start monitoring the *fd* file descriptor for write availability and invoke *callback* with the specified arguments once *fd* is available for writing.
es_es: Comienza a monitorizar el descriptor de fichero *fd* para disponibilidad de escritura e invoca *callback* con los argumentos especificados una vez que *fd* está disponible para escribir.
pt_pt: Inicia a monitorização do descritor de ficheiro *fd* para disponibilidade de escrita e invoca *callback* com os argumentos especificados assim que *fd* estiver disponível para escrita.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *callback*.
es_es: Utilice :func:`functools.partial`:ref:` para pasar argumentos de palabra clave <asyncio-pass-keywords>` a *callback*.
pt_pt: Utilize :func:`functools.partial` :ref:`para passar argumentos de palavra-chave <asyncio-pass-keywords>` para *callback*.

source: Stop monitoring the *fd* file descriptor for write availability. Returns ``True`` if *fd* was previously being monitored for writes.
es_es: Прекратите мониторинг файлового дескриптора *fd* на предмет доступности записи. Возвращает ``True``, если *fd* ранее отслеживался на предмет записи.
pt_pt: Para de monitorizar o descritor de ficheiro *fd* para disponibilidade de escrita. Devolve ``True`` se *fd* estava a ser monitorizado para escritas.

source: See also :ref:`Platform Support <asyncio-platform-support>` section for some limitations of these methods.
es_es: Consulte también la sección :ref:`Platform Support <asyncio-platform-support>` para conocer algunas limitaciones de estos métodos.
pt_pt: Consulte também a secção :ref:`Suporte de Plataforma <asyncio-platform-support>` para algumas limitações destes métodos.

source: Working with socket objects directly
es_es: Trabajar directamente con objetos socket
pt_pt: Trabalhar diretamente com objetos socket

source: In general, protocol implementations that use transport-based APIs such as :meth:`loop.create_connection` and :meth:`loop.create_server` are faster than implementations that work with sockets directly. However, there are some use cases when performance is not critical, and working with :class:`~socket.socket` objects directly is more convenient.
es_es: En general, las implementaciones de protocolos que utilizan APIs basadas en transporte como :meth:`loop.create_connection` y :meth:`loop.create_server` son más rápidas que las implementaciones que trabajan con sockets directamente. Sin embargo, hay algunos casos de uso en los que el rendimiento no es crítico, y trabajar con objetos :class:`~socket.socket` directamente es más conveniente.
pt_pt: Em geral, as implementações de protocolos que utilizam APIs baseadas em transporte, como :meth:`loop.create_connection` e :meth:`loop.create_server`, são mais rápidas do que as implementações que trabalham diretamente com sockets. No entanto, existem alguns casos de uso em que o desempenho não é crítico e trabalhar diretamente com objetos :class:`~socket.socket` é mais conveniente.

source: Receive up to *nbytes* from *sock*. Asynchronous version of :meth:`socket.recv() <socket.socket.recv>`.
es_es: Recibe hasta *nbytes* de *sock*. Versión asíncrona de :meth:`socket.recv() <socket.socket.recv>`.
pt_pt: Recebe até *nbytes* de *sock*. Versão assíncrona de :meth:`socket.recv() <socket.socket.recv>`.

source: Return the received data as a bytes object.
es_es: Devuelve los datos recibidos como un objeto bytes.
pt_pt: Devolve os dados recebidos como um objeto bytes.

source: *sock* must be a non-blocking socket.
es_es: *sock* debe ser un socket no bloqueante.
pt_pt: *sock* deve ser um socket não bloqueante.

source: Even though this method was always documented as a coroutine method, releases before Python 3.7 returned a :class:`Future`. Since Python 3.7 this is an ``async def`` method.
es_es: Aunque este método siempre estuvo documentado como un método corrutina, las versiones anteriores a Python 3.7 devolvían un :class:`Future`. Desde Python 3.7 este es un método ``async def``.
pt_pt: Embora este método tenha sido sempre documentado como um método de corrotina, as versões anteriores ao Python 3.7 devolviam um :class:`Future`. Desde o Python 3.7, este é um método ``async def``.

source: Receive data from *sock* into the *buf* buffer. Modeled after the blocking :meth:`socket.recv_into() <socket.socket.recv_into>` method.
es_es: Recibe datos de *sock* en el buffer *buf*. Modelado según el método bloqueante :meth:`socket.recv_into() <socket.socket.recv_into>`.
pt_pt: Recebe dados de *sock* para o buffer *buf*. Modelado após o método bloqueante :meth:`socket.recv_into() <socket.socket.recv_into>`.

source: Return the number of bytes written to the buffer.
es_es: Devuelve el número de bytes escritos en el buffer.
pt_pt: Devolve o número de bytes escritos no buffer.

source: Receive a datagram of up to *bufsize* from *sock*. Asynchronous version of :meth:`socket.recvfrom() <socket.socket.recvfrom>`.
es_es: Получите датаграмму размером до *bufsize* от *sock*. Асинхронная версия :meth:`socket.recvfrom() <socket.socket.recvfrom>`.
pt_pt: Recebe um datagrama de até *bufsize* de *sock*. Versão assíncrona de :meth:`socket.recvfrom() <socket.socket.recvfrom>`.

source: Return a tuple of (received data, remote address).
es_es: Вернуть кортеж (полученные данные, удаленный адрес).
pt_pt: Devolve um tuplo de (dados recebidos, endereço remoto).

source: Receive a datagram of up to *nbytes* from *sock* into *buf*. Asynchronous version of :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.
es_es: Получите датаграмму размером до *nbytes* из *sock* в *buf*. Асинхронная версия :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.
pt_pt: Recebe um datagrama de até *nbytes* de *sock* para *buf*. Versão assíncrona de :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.

source: Return a tuple of (number of bytes received, remote address).
es_es: Вернуть кортеж (количество полученных байтов, удаленный адрес).
pt_pt: Devolve um tuplo de (número de bytes recebidos, endereço remoto).

source: Send *data* to the *sock* socket. Asynchronous version of :meth:`socket.sendall() <socket.socket.sendall>`.
es_es: Envía *data* al socket *sock*. Versión asíncrona de :meth:`socket.sendall() <socket.socket.sendall>`.
pt_pt: Envie *data* para o socket *sock*. Versão assíncrona de :meth:`socket.sendall() <socket.socket.sendall>`.

source: This method continues to send to the socket until either all data in *data* has been sent or an error occurs. ``None`` is returned on success. On error, an exception is raised. Additionally, there is no way to determine how much data, if any, was successfully processed by the receiving end of the connection.
es_es: Este método continúa enviando al socket hasta que se han enviado todos los datos de *data* o se produce un error. ``None`` se devuelve en caso de éxito. En caso de error, se lanza una excepción. Además, no hay forma de determinar cuántos datos, si los hay, fueron procesados con éxito por el extremo receptor de la conexión.
pt_pt: Este método continua a enviar para o socket até que todos os dados em *data* tenham sido enviados ou ocorra um erro. ``None`` é devolvido em caso de sucesso. Em caso de erro, é levantada uma exceção. Além disso, não há forma de determinar quantos dados, se houver, foram processados com sucesso pelo lado recetor da ligação.

source: Even though the method was always documented as a coroutine method, before Python 3.7 it returned a :class:`Future`. Since Python 3.7, this is an ``async def`` method.
es_es: Aunque el método siempre estuvo documentado como un método corrutina, antes de Python 3.7 devolviera un :class:`Future`. Desde Python 3.7, este es un método ``async def``.
pt_pt: Embora este método tenha sido sempre documentado como um método de corrotina, antes do Python 3.7 devolvia um :class:`Future`. Desde o Python 3.7, este é um método ``async def``.

source: Send a datagram from *sock* to *address*. Asynchronous version of :meth:`socket.sendto() <socket.socket.sendto>`.
es_es: Отправьте датаграмму с *sock* на *address*. Асинхронная версия :meth:`socket.sendto() <socket.socket.sendto>`.
pt_pt: Envie um datagrama de *sock* para *address*. Versão assíncrona de :meth:`socket.sendto() <socket.socket.sendto>`.

source: Return the number of bytes sent.
es_es: Возвращает количество отправленных байтов.
pt_pt: Devolve o número de bytes enviados.

source: Connect *sock* to a remote socket at *address*.
es_es: Conectar *sock* a un socket remoto en *address*.
pt_pt: Liga *sock* a um socket remoto em *address*.
