Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-sync.po
Languages: es_es, pt_pt, ru, sv

source: Note that a task *may* return from this call spuriously, which is why the caller should always re-check the state and be prepared to :meth:`~Condition.wait` again. For this reason, you may prefer to use :meth:`~Condition.wait_for` instead.
pt_pt: Note que uma tarefa *pode* retornar desta chamada de forma espúria, razão pela qual o chamador deve sempre reverificar o estado e estar preparado para chamar :meth:`~Condition.wait` novamente. Por esta razão, pode preferir usar :meth:`~Condition.wait_for` em vez disso.
sv: Observera att en uppgift *kan* återvända från detta anrop på ett felaktigt sätt, vilket är anledningen till att anroparen alltid bör kontrollera tillståndet igen och vara beredd att :meth:`~Condition.wait` igen. Av denna anledning kanske du föredrar att använda :meth:`~Condition.wait_for` istället.

source: Wait until a predicate becomes *true*.
es_es: Esperar a que un predicado sea *true*.
pt_pt: Aguarda até que um predicado se torne *verdadeiro*.
ru: Подождите, пока предикат не станет *истиной*.
sv: Vänta tills ett predikat blir *sant*.

source: The predicate must be a callable which result will be interpreted as a boolean value. The method will repeatedly :meth:`~Condition.wait` until the predicate evaluates to *true*. The final value is the return value.
pt_pt: O predicado deve ser um objeto invocável cujo resultado será interpretado como um valor booleano. O método chamará repetidamente :meth:`~Condition.wait` até que o predicado avalie como *verdadeiro*. O valor final é o valor de retorno.
ru: Предикат должен быть вызываемым, результат которого будет интерпретироваться как логическое значение. Метод будет повторять :meth:`~Condition.wait` до тех пор, пока предикат не примет значение *true*. Окончательное значение является возвращаемым значением.
sv: Predikatet måste vara en callable vars resultat kommer att tolkas som ett booleskt värde. Metoden kommer att upprepa :meth:`~Condition.wait` tills predikatet utvärderas till *true*. Det slutliga värdet är returvärdet.

source: Semaphore
pt_pt: Semáforo
ru: Семафор
sv: Semafor

source: A Semaphore object. Not thread-safe.
es_es: Un objeto Semaphore. No es seguro para hilos.
pt_pt: Um objeto Semáforo. Não é *thread-safe*.
ru: Объект Семафор. Не потокобезопасный.
sv: Ett semaforobjekt. Inte tråd-säkert.

source: A semaphore manages an internal counter which is decremented by each :meth:`acquire` call and incremented by each :meth:`release` call. The counter can never go below zero; when :meth:`acquire` finds that it is zero, it blocks, waiting until some task calls :meth:`release`.
es_es: Un semáforo gestiona un contador interno que se decrece con cada llamada a :meth:`acquire` y se incrementa con cada llamada a :meth:`release`. El contador nunca puede bajar de cero; cuando :meth:`acquire` llega a cero, se bloquea, esperando que alguna tarea llame a :meth:`release`.
pt_pt: Um semáforo gere um contador interno que é decrementado por cada chamada a :meth:`acquire` e incrementado por cada chamada a :meth:`release`. O contador nunca pode ser inferior a zero; quando :meth:`acquire` verifica que é zero, bloqueia, aguardando até que alguma tarefa chame :meth:`release`.
ru: Семафор управляет внутренним счетчиком, который уменьшается при каждом вызове :meth:`acquire` и увеличивается при каждом вызове :meth:`release`. Счетчик никогда не может опуститься ниже нуля; когда :meth:`acquire` обнаруживает, что оно равно нулю, он блокируется, ожидая, пока какая-нибудь задача не вызовет :meth:`release`.
sv: En semafor hanterar en intern räknare som decimeras vid varje anrop av :meth:`acquire` och ökas vid varje anrop av :meth:`release`. Räknaren kan aldrig gå under noll; när :meth:`acquire` upptäcker att den är noll blockeras den och väntar tills någon uppgift anropar :meth:`release`.

source: The optional *value* argument gives the initial value for the internal counter (``1`` by default). If the given value is less than ``0`` a :exc:`ValueError` is raised.
es_es: El argumento opcional *value* da el valor inicial para el contador interno (``1`` por defecto). Si el valor dado es menor que ``0`` se produce un :exc:`ValueError`.
pt_pt: O argumento opcional *value* define o valor inicial para o contador interno (``1`` por predefinição). Se o valor fornecido for inferior a ``0``, é levantada uma exceção :exc:`ValueError`.
ru: Необязательный аргумент *value* дает начальное значение внутреннего счетчика (по умолчанию «1»). Если заданное значение меньше ``0``, возникает ошибка :exc:`ValueError`.
sv: Det valfria argumentet *value* anger det initiala värdet för den interna räknaren (``1`` som standard). Om det angivna värdet är mindre än ``0`` uppstår ett :exc:`ValueError`.

source: The preferred way to use a Semaphore is an :keyword:`async with` statement::
es_es: La forma preferida de utilizar un Semaphore es una declaración :keyword:`async with`::
pt_pt: A forma preferencial de usar um Semáforo é com a instrução :keyword:`async with`::
ru: Предпочтительным способом использования семафора является оператор :keyword:`async with`::
sv: Det föredragna sättet att använda en semafor är en :keyword:`async with`-sats::

source: sem = asyncio.Semaphore(10) # ... later async with sem: # work with shared resource
pt_pt: sem = asyncio.Semaphore(10) # ... mais tarde async with sem: # trabalhar com o recurso partilhado

source: sem = asyncio.Semaphore(10) # ... later await sem.acquire() try: # work with shared resource finally: sem.release()
pt_pt: sem = asyncio.Semaphore(10) # ... mais tarde await sem.acquire() try: # trabalhar com o recurso partilhado finally: sem.release()

source: Acquire a semaphore.
es_es: Adquiere un semáforo.
pt_pt: Adquire um semáforo.
ru: Приобретите семафор.
sv: Förvärva en semafor.

source: If the internal counter is greater than zero, decrement it by one and return ``True`` immediately. If it is zero, wait until a :meth:`release` is called and return ``True``.
es_es: Si el contador interno es mayor que cero, disminuye en uno y devuelve ``True`` inmediatamente. Si es cero, espere hasta que se llame a :meth:`release` y devuelva ``True``.
pt_pt: Se o contador interno for maior que zero, decrementa-o em um e devolve ``True`` imediatamente. Se for zero, aguarda até que :meth:`release` seja chamado e devolve ``True``.
ru: Если внутренний счетчик больше нуля, уменьшите его на единицу и немедленно верните True. Если оно равно нулю, дождитесь вызова :meth:`release` и верните ``True``.
sv: Om den interna räknaren är större än noll, decimera den med ett och returnera ``True`` omedelbart. Om den är noll, vänta tills en :meth:`release` anropas och returnera ``True``.

source: Returns ``True`` if semaphore can not be acquired immediately.
es_es: Devuelve ``True`` si el semáforo no puede adquirirse inmediatamente.
pt_pt: Devolve ``True`` se o semáforo não puder ser adquirido imediatamente.
ru: Возвращает True, если семафор не может быть получен немедленно.
sv: Returnerar ``True`` om semaforen inte kan förvärvas omedelbart.

source: Release a semaphore, incrementing the internal counter by one. Can wake up a task waiting to acquire the semaphore.
es_es: Libera un semáforo, incrementando el contador interno en uno. Puede despertar una tarea en espera de adquirir el semáforo.
pt_pt: Liberta um semáforo, incrementando o contador interno em um. Pode despertar uma tarefa à espera de adquirir o semáforo.
ru: Освободите семафор, увеличив внутренний счетчик на единицу. Может разбудить задачу, ожидающую получения семафора.
sv: Frigör en semafor, vilket ökar den interna räknaren med ett steg. Kan väcka en uppgift som väntar på att förvärva semaforen.

source: Unlike :class:`BoundedSemaphore`, :class:`Semaphore` allows making more ``release()`` calls than ``acquire()`` calls.
es_es: A diferencia de :class:`BoundedSemaphore`, :class:`Semaphore` permite realizar más llamadas a ``release()`` que a ``acquire()``.
pt_pt: Ao contrário de :class:`BoundedSemaphore`, :class:`Semaphore` permite fazer mais chamadas a ``release()`` do que a ``acquire()``.
ru: В отличие от :class:`BoundedSemaphore`, :class:`Semaphore` позволяет выполнять больше вызовов ``release()``, чем ``acquire()``.
sv: Till skillnad från :class:`BoundedSemaphore` tillåter :class:`Semaphore` fler ``release()`` -anrop än ``acquire()`` -anrop.

source: BoundedSemaphore
pt_pt: SemáforoLimitado

source: A bounded semaphore object. Not thread-safe.
es_es: Un objeto semáforo limitado. No es seguro para hilos.
pt_pt: Um objeto SemáforoLimitado. Não é *thread-safe*.
ru: Ограниченный объект-семафор. Не потокобезопасный.
sv: Ett avgränsat semaforobjekt. Inte tråd-säkert.

source: Bounded Semaphore is a version of :class:`Semaphore` that raises a :exc:`ValueError` in :meth:`~Semaphore.release` if it increases the internal counter above the initial *value*.
es_es: Bounded Semaphore es una versión de :class:`Semaphore` que lanza un :exc:`ValueError` en :meth:`~Semaphore.release` si incrementa el contador interno por encima del *valor* inicial.
pt_pt: Bounded Semaphore é uma versão de :class:`Semaphore` que levanta uma exceção :exc:`ValueError` em :meth:`~Semaphore.release` se aumentar o contador interno acima do *valor* inicial.
ru: Ограниченный семафор — это версия :class:`Semaphore`, которая вызывает :exc:`ValueError` в :meth:`~Semaphore.release`, если внутренний счетчик превышает начальное *значение*.
sv: Bounded Semaphore är en version av :class:`Semaphore` som ger upphov till ett :exc:`ValueError` i :meth:`~Semaphore.release` om den ökar den interna räknaren över det ursprungliga *värdet*.

source: Barrier
pt_pt: Barreira
ru: Барьер

source: A barrier object. Not thread-safe.
pt_pt: Um objeto Barreira. Não é *thread-safe*.
ru: Барьерный объект. Не потокобезопасный.
sv: Ett barriärobjekt. Inte tråd-säkert.

source: A barrier is a simple synchronization primitive that allows to block until *parties* number of tasks are waiting on it. Tasks can wait on the :meth:`~Barrier.wait` method and would be blocked until the specified number of tasks end up waiting on :meth:`~Barrier.wait`. At that point all of the waiting tasks would unblock simultaneously.
pt_pt: Uma barreira é uma primitiva de sincronização simples que permite bloquear até que um número de *parties* de tarefas esteja à sua espera. As tarefas podem esperar no método :meth:`~Barrier.wait` e serão bloqueadas até que o número especificado de tarefas acabe por esperar em :meth:`~Barrier.wait`. Nesse momento, todas as tarefas à espera serão desbloqueadas simultaneamente.
ru: Барьер — это простой примитив синхронизации, который позволяет блокировать до тех пор, пока на нем не будет ожидать *сторон* ряд задач. Задачи могут ждать метода :meth:`~Barrier.wait` и будут заблокированы до тех пор, пока указанное количество задач не окажется в ожидании :meth:`~Barrier.wait`. В этот момент все ожидающие задачи разблокируются одновременно.
sv: En barriär är en enkel synkroniseringsprimitiv som gör det möjligt att blockera tills *parties* antal uppgifter väntar på den. Uppgifter kan vänta på :meth:`~Barrier.wait`-metoden och blockeras tills det angivna antalet uppgifter slutar vänta på :meth:`~Barrier.wait`. Vid den tidpunkten kommer alla väntande uppgifter att avblockeras samtidigt.

source: :keyword:`async with` can be used as an alternative to awaiting on :meth:`~Barrier.wait`.
pt_pt: :keyword:`async with` pode ser usado como alternativa a aguardar em :meth:`~Barrier.wait`.
ru: :keyword:`async with` можно использовать как альтернативу ожиданию :meth:`~Barrier.wait`.
sv: :keyword:`async with` kan användas som ett alternativ till att vänta på :meth:`~Barrier.wait`.

source: The barrier can be reused any number of times.
pt_pt: A barreira pode ser reutilizada qualquer número de vezes.
ru: Барьер можно использовать повторно любое количество раз.
sv: Barriären kan återanvändas ett obegränsat antal gånger.

source: async def example_barrier(): # barrier with 3 parties b = asyncio.Barrier(3) # create 2 new waiting tasks asyncio.create_task(b.wait()) asyncio.create_task(b.wait()) await asyncio.sleep(0) print(b) # The third .wait() call passes the barrier await b.wait() print(b) print("barrier passed") await asyncio.sleep(0) print(b) asyncio.run(example_barrier())
pt_pt: async def example_barrier(): # barreira com 3 participantes b = asyncio.Barrier(3) # criar 2 novas tarefas à espera asyncio.create_task(b.wait()) asyncio.create_task(b.wait()) await asyncio.sleep(0) print(b) # A terceira chamada a .wait() ultrapassa a barreira await b.wait() print(b) print("barreira ultrapassada") await asyncio.sleep(0) print(b) asyncio.run(example_barrier())

source: Result of this example is::
pt_pt: O resultado deste exemplo é::
ru: Результат этого примера::
sv: Resultatet av detta exempel är::

source: <asyncio.locks.Barrier object at 0x... [filling, waiters:2/3]> <asyncio.locks.Barrier object at 0x... [draining, waiters:0/3]> barrier passed <asyncio.locks.Barrier object at 0x... [filling, waiters:0/3]>
pt_pt: <objeto asyncio.locks.Barrier em 0x... [a encher, à espera:2/3]> <objeto asyncio.locks.Barrier em 0x... [a esvaziar, à espera:0/3]> barreira ultrapassada <objeto asyncio.locks.Barrier em 0x... [a encher, à espera:0/3]>

source: Pass the barrier. When all the tasks party to the barrier have called this function, they are all unblocked simultaneously.
pt_pt: Ultrapassa a barreira. Quando todas as tarefas participantes na barreira chamarem esta função, todas são desbloqueadas simultaneamente.
ru: Пройдите барьер. Когда все задачи, участвующие в барьере, вызвали эту функцию, все они разблокируются одновременно.
sv: Passera spärren. När alla uppgifter som är parter i barriären har anropat denna funktion, avblockeras alla samtidigt.

source: When a waiting or blocked task in the barrier is cancelled, this task exits the barrier which stays in the same state. If the state of the barrier is "filling", the number of waiting task decreases by 1.
pt_pt: Quando uma tarefa à espera ou bloqueada na barreira é cancelada, esta tarefa sai da barreira, que permanece no mesmo estado. Se o estado da barreira for "a encher", o número de tarefas à espera diminui em 1.
ru: Когда ожидающая или заблокированная задача в барьере отменяется, эта задача выходит из барьера, оставаясь в том же состоянии. Если состояние барьера «заполнение», количество ожидающих задач уменьшается на 1.
sv: När en väntande eller blockerad uppgift i barriären avbryts, lämnar denna uppgift barriären som förblir i samma tillstånd. Om barriärens tillstånd är "fyllning", minskar antalet väntande uppgifter med 1.

source: The return value is an integer in the range of 0 to ``parties-1``, different for each task. This can be used to select a task to do some special housekeeping, e.g.::
pt_pt: O valor de retorno é um inteiro no intervalo de 0 a ``parties-1``, diferente para cada tarefa. Isto pode ser usado para selecionar uma tarefa para fazer alguma manutenção especial, por exemplo::
ru: Возвращаемое значение представляет собой целое число в диапазоне от 0 до ``party-1``, различное для каждой задачи. Это можно использовать для выбора задачи для выполнения какой-либо специальной хозяйственной деятельности, например:
sv: Returvärdet är ett heltal i intervallet 0 till ``parties-1``, olika för varje uppgift. Detta kan användas för att välja en uppgift för att göra några speciella hushållsarbeten, t.ex.::

source: ... async with barrier as position: if position == 0: # Only one task prints this print('End of *draining phase*')
pt_pt: ... async with barrier as position: if position == 0: # Apenas uma tarefa imprime isto print('Fim da *fase de esvaziamento*')

source: This method may raise a :class:`BrokenBarrierError` exception if the barrier is broken or reset while a task is waiting. It could raise a :exc:`CancelledError` if a task is cancelled.
pt_pt: Este método pode levantar uma exceção :class:`BrokenBarrierError` se a barreira for quebrada ou reiniciada enquanto uma tarefa está à espera. Pode levantar uma exceção :exc:`CancelledError` se uma tarefa for cancelada.
ru: Этот метод может вызвать исключение :class:`BrokenBarrierError`, если барьер сломан или сброшен во время ожидания задачи. Это может вызвать :exc:`CancelledError`, если задача отменена.
sv: Denna metod kan ge upphov till ett :class:`BrokenBarrierError` undantag om barriären bryts eller återställs medan en uppgift väntar. Den kan ge upphov till ett :exc:`CancelledError` om en uppgift avbryts.

source: Return the barrier to the default, empty state. Any tasks waiting on it will receive the :class:`BrokenBarrierError` exception.
pt_pt: Devolve a barreira ao estado predefinido, vazio. Todas as tarefas à sua espera receberão a exceção :class:`BrokenBarrierError`.
ru: Верните барьер в пустое состояние по умолчанию. Любые задачи, ожидающие его, получат исключение :class:`BrokenBarrierError`.
sv: Återställer barriären till standardtillståndet, tom. Alla uppgifter som väntar på den kommer att få undantaget :class:`BrokenBarrierError`.

source: If a barrier is broken it may be better to just leave it and create a new one.
pt_pt: Se uma barreira estiver quebrada, pode ser melhor deixá-la e criar uma nova.
ru: Если барьер разрушен, возможно, лучше просто оставить его и создать новый.
sv: Om en barriär är bruten kan det vara bättre att bara lämna den och skapa en ny.

source: Put the barrier into a broken state. This causes any active or future calls to :meth:`~Barrier.wait` to fail with the :class:`BrokenBarrierError`. Use this for example if one of the tasks needs to abort, to avoid infinite waiting tasks.
pt_pt: Coloca a barreira num estado quebrado. Isto faz com que quaisquer chamadas ativas ou futuras a :meth:`~Barrier.wait` falhem com a exceção :class:`BrokenBarrierError`. Utilize isto, por exemplo, se uma das tarefas precisar de abortar, para evitar tarefas em espera infinita.
ru: Приведите барьер в сломанное состояние. Это приводит к тому, что любые активные или будущие вызовы :meth:`~Barrier.wait` завершаются с ошибкой :class:`BrokenBarrierError`. Используйте это, например, если одну из задач необходимо прервать, чтобы избежать бесконечного ожидания задач.
sv: Sätter barriären i ett trasigt tillstånd. Detta gör att alla aktiva eller framtida anrop till :meth:`~Barrier.wait` misslyckas med :class:`BrokenBarrierError`. Använd detta till exempel om en av uppgifterna måste avbrytas, för att undvika oändligt väntande uppgifter.

source: The number of tasks required to pass the barrier.
pt_pt: O número de tarefas necessárias para ultrapassar a barreira.
ru: Количество задач, необходимых для прохождения барьера.
sv: Det antal uppgifter som krävs för att passera barriären.

source: The number of tasks currently waiting in the barrier while filling.
pt_pt: O número de tarefas atualmente à espera na barreira enquanto esta está a encher.
ru: Количество задач, ожидающих в настоящее время в барьере при заполнении.
sv: Antalet uppgifter som för närvarande väntar i barriären medan den fylls på.

source: A boolean that is ``True`` if the barrier is in the broken state.
es_es: Un booleano que es ``True`` si la barrera está en estado roto.
pt_pt: Um booleano que é ``True`` se a barreira estiver no estado quebrado.
ru: Логическое значение, имеющее значение «Истина», если барьер находится в разрушенном состоянии.
sv: En boolean som är ``True`` om barriären är i ett trasigt tillstånd.

source: This exception, a subclass of :exc:`RuntimeError`, is raised when the :class:`Barrier` object is reset or broken.
es_es: Esta excepción, una subclase de :exc:`RuntimeError`, se lanza cuando el objeto :class:`Barrier` se reinicia o se rompe.
pt_pt: Esta exceção, uma subclasse de :exc:`RuntimeError`, é levantada quando o objeto :class:`Barrier` é reiniciado ou quebrado.
ru: Это исключение, подкласс :exc:`RuntimeError`, возникает, когда объект :class:`Barrier` сбрасывается или разрушается.
sv: Detta undantag, en underklass till :exc:`RuntimeError`, uppstår när objektet :class:`Barrier` återställs eller bryts.

source: Acquiring a lock using ``await lock`` or ``yield from lock`` and/or :keyword:`with` statement (``with await lock``, ``with (yield from lock)``) was removed. Use ``async with lock`` instead.
es_es: Se ha eliminado la adquisición de un bloqueo mediante ``await lock`` o ``yield from lock`` y/o la sentencia :keyword:`with` (``with await lock``, ``with (yield from lock)``). Utilice ``async with lock`` en su lugar.
pt_pt: A aquisição de um bloqueio usando ``await lock`` ou ``yield from lock`` e/ou a instrução :keyword:`with` (``with await lock``, ``with (yield from lock)``) foi removida. Utilize ``async with lock`` em vez disso.
ru: Получение блокировки с помощью оператора ``await lock`` или ``yield from lock`` и/или :keyword:`with` (``with await lock``, ``with (yield from lock)``) было удалено. . Вместо этого используйте ``async с блокировкой``.
sv: Att förvärva ett lås med hjälp av ``await lock`` eller ``yield from lock`` och/eller :keyword:`with`-satsen (``with await lock``, ``with (yield from lock)``) togs bort. Använd ``async with lock`` istället.

source: Tasks awaiting on :meth:`~Event.wait` will now block until the :meth:`~Event.set` method is called again.
ru: Задачи, ожидающие :meth:`~Event.wait`, теперь будут блокироваться до тех пор, пока метод :meth:`~Event.set` не будет вызван снова.
sv: Uppgifter som väntar på :meth:`~Event.wait` kommer nu att blockeras tills metoden :meth:`~Event.set` anropas igen.

source: Wake up at most *n* tasks (1 by default) waiting on this condition. The method is no-op if no tasks are waiting.
ru: Пробуждение не более *n* задач (1 по умолчанию), ожидающих этого условия. Этот метод является пустым, если нет ожидающих задач.
