Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: es_es, pt_pt

source: Event loop provides mechanisms to schedule callback functions to be called at some point in the future. Event loop uses monotonic clocks to track time.
es_es: El bucle de eventos proporciona mecanismos para programar funciones callback que serán llamadas en algún momento en el futuro. El bucle de eventos utiliza relojes monotónicos para controlar el tiempo.
pt_pt: O ciclo de eventos fornece mecanismos para agendar funções de chamada de retorno para serem chamadas em algum momento no futuro. O ciclo de eventos utiliza relógios monótonos para acompanhar o tempo.

source: Schedule *callback* to be called after the given *delay* number of seconds (can be either an int or a float).
es_es: Programar *callback* para ser llamado después del *delay* número de segundos dado (puede ser un int o un float).
pt_pt: Agenda *callback* para ser chamada após o número de segundos especificado em *delay* (pode ser um int ou um float).

source: An instance of :class:`asyncio.TimerHandle` is returned which can be used to cancel the callback.
es_es: Se devuelve una instancia de :class:`asyncio.TimerHandle` que puede utilizarse para cancelar la llamada de retorno.
pt_pt: É devolvida uma instância de :class:`asyncio.TimerHandle`, que pode ser utilizada para cancelar a chamada de retorno.

source: *callback* will be called exactly once. If two callbacks are scheduled for exactly the same time, the order in which they are called is undefined.
es_es: Se llamará *callback* exactamente una vez. Si dos llamadas de retorno están programadas exactamente para la misma hora, el orden en el que se llaman es indefinido.
pt_pt: *callback* será chamada exatamente uma vez. Se duas chamadas de retorno forem agendadas para exatamente o mesmo momento, a ordem pela qual são chamadas é indefinida.

source: The optional positional *args* will be passed to the callback when it is called. If you want the callback to be called with keyword arguments use :func:`functools.partial`.
es_es: Los *args* posicionales opcionales se pasarán a la llamada de retorno cuando sea invocada. Si desea que la llamada de retorno se ejecute con argumentos de palabra clave, utilice :func:`functools.partial`.
pt_pt: Os argumentos posicionais opcionais *args* serão passados para a chamada de retorno quando esta for chamada. Se pretender que a chamada de retorno seja chamada com argumentos de palavra-chave, utilize :func:`functools.partial`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
es_es: Un argumento opcional *context* permite especificar un :class:`contextvars.Context` personalizado para que se ejecute la *callback*. El contexto actual se utiliza cuando no se proporciona *context*.
pt_pt: Um argumento opcional apenas por palavra-chave *context* permite especificar um :class:`contextvars.Context` personalizado para a *callback* ser executada. O contexto atual é utilizado quando nenhum *context* é fornecido.

source: In Python 3.7 and earlier with the default event loop implementation, the *delay* could not exceed one day. This has been fixed in Python 3.8.
es_es: En Python 3.7 y anteriores con la implementación de bucle de eventos por defecto, el *retraso* no podía exceder de un día. Esto se ha corregido en Python 3.8.
pt_pt: Nas versões do Python 3.7 e anteriores, com a implementação padrão do ciclo de eventos, o *delay* não podia exceder um dia. Isto foi corrigido no Python 3.8.

source: Schedule *callback* to be called at the given absolute timestamp *when* (an int or a float), using the same time reference as :meth:`loop.time`.
es_es: Programar *callback* para ser llamado en la fecha y hora absolutas dadas *when* (un int o un float), utilizando la misma referencia de tiempo que :meth:`loop.time`.
pt_pt: Agenda *callback* para ser chamada no carimbo de tempo absoluto *when* (um int ou um float), utilizando a mesma referência de tempo que :meth:`loop.time`.

source: This method's behavior is the same as :meth:`call_later`.
es_es: El comportamiento de este método es el mismo que :meth:`call_later`.
pt_pt: O comportamento deste método é o mesmo que :meth:`call_later`.

source: In Python 3.7 and earlier with the default event loop implementation, the difference between *when* and the current time could not exceed one day. This has been fixed in Python 3.8.
es_es: En Python 3.7 y anteriores con la implementación por defecto del bucle de eventos, la diferencia entre *cuando* y la hora actual no podía exceder de un día. Esto se ha corregido en Python 3.8.
pt_pt: Nas versões do Python 3.7 e anteriores, com a implementação padrão do ciclo de eventos, a diferença entre *when* e a hora atual não podia exceder um dia. Isto foi corrigido no Python 3.8.

source: Return the current time, as a :class:`float` value, according to the event loop's internal monotonic clock.
es_es: Devuelve la hora actual, como valor de :class:`float`, según el reloj monotónico interno del bucle de eventos.
pt_pt: Devolve a hora atual, como um valor :class:`float`, de acordo com o relógio monótono interno do ciclo de eventos.

source: In Python 3.7 and earlier timeouts (relative *delay* or absolute *when*) should not exceed one day. This has been fixed in Python 3.8.
es_es: En Python 3.7 y anteriores los tiempos de espera (relativos *delay* o absolutos *when*) no deberían exceder un día. Esto se ha corregido en Python 3.8.
pt_pt: Nas versões do Python 3.7 e anteriores, os timeouts (atraso relativo *delay* ou absoluto *when*) não deviam exceder um dia. Isto foi corrigido no Python 3.8.

source: The :func:`asyncio.sleep` function.
es_es: La función :func:`asyncio.sleep`.
pt_pt: A função :func:`asyncio.sleep`.

source: Creating Futures and Tasks
es_es: Creación de futuros y tareas
pt_pt: Criação de Futures e Tarefas

source: Create an :class:`asyncio.Future` object attached to the event loop.
es_es: Crear un objeto :class:`asyncio.Future` adjunto al bucle de eventos.
pt_pt: Cria um objeto :class:`asyncio.Future` associado ao ciclo de eventos.

source: This is the preferred way to create Futures in asyncio. This lets third-party event loops provide alternative implementations of the Future object (with better performance or instrumentation).
es_es: Esta es la forma preferida de crear Futuros en asyncio. Esto permite que los bucles de eventos de terceros proporcionen implementaciones alternativas del objeto Futuro (con mejor rendimiento o instrumentación).
pt_pt: Esta é a forma preferida de criar Futures no asyncio. Isto permite que ciclos de eventos de terceiros forneçam implementações alternativas do objeto Future (com melhor desempenho ou instrumentação).

source: Schedule the execution of :ref:`coroutine <coroutine>` *coro*. Return a :class:`Task` object.
es_es: Запланируйте выполнение :ref:`coroutine <coroutine>` *coro*. Верните объект :class:`Task`.
pt_pt: Agenda a execução da :ref:`corrotina <coroutine>` *coro*. Devolve um objeto :class:`Task`.

source: Third-party event loops can use their own subclass of :class:`Task` for interoperability. In this case, the result type is a subclass of :class:`Task`.
es_es: Los bucles de eventos de terceros pueden utilizar su propia subclase de :class:`Task` para la interoperabilidad. En este caso, el tipo de resultado es una subclase de :class:`Task`.
pt_pt: Ciclos de eventos de terceiros podem utilizar a sua própria subclasse de :class:`Task` para interoperabilidade. Neste caso, o tipo de resultado é uma subclasse de :class:`Task`.

source: If the *name* argument is provided and not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
es_es: Si se proporciona el argumento *nombre* y no ``None``, se establece como el nombre de la tarea utilizando :meth:`Task.set_name`.
pt_pt: Se o argumento *name* for fornecido e não for ``None``, é definido como o nome da tarefa utilizando :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
es_es: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для запуска *coro*. Текущая копия контекста создается, когда *context* не указан.
pt_pt: Um argumento opcional apenas por palavra-chave *context* permite especificar um :class:`contextvars.Context` personalizado para a *coro* ser executada. Uma cópia do contexto atual é criada quando nenhum *context* é fornecido.

source: Added the *name* parameter.
es_es: Додано параметр *name*.
pt_pt: Adicionado o parâmetro *name*.

source: Added the *context* parameter.
es_es: Добавлен параметр *context*.
pt_pt: Adicionado o parâmetro *context*.

source: Added ``kwargs`` which passes on arbitrary extra parameters, including ``name`` and ``context``.
es_es: 增加了 ``kwargs``，它将传递任意附加形参，包括 ``name`` 和 ``context``。

source: Rolled back the change that passes on *name* and *context* (if it is None), while still passing on other arbitrary keyword arguments (to avoid breaking backwards compatibility with 3.13.3).
es_es: 撤回传递 *name* 和 *context* (如果其为 None) 的更改，虽然仍会传递其他任何关键字参数（以避免破坏与 3.13.3 的向下兼容）。

source: Set a task factory that will be used by :meth:`loop.create_task`.
es_es: Establecer una task factory que será utilizada por :meth:`loop.create_task`.
pt_pt: Define uma fábrica de tarefas que será utilizada por :meth:`loop.create_task`.

source: If *factory* is ``None`` the default task factory will be set. Otherwise, *factory* must be a *callable* with the signature matching ``(loop, coro, **kwargs)``, where *loop* is a reference to the active event loop, and *coro* is a coroutine object. The callable must pass on all *kwargs*, and return a :class:`asyncio.Task`-compatible object.
es_es: Если * Factory * is `` none``, завод по умолчанию будет установлен. В противном случае, *Factory *должен быть *Callable *с подписанием, соответствующей `` (петля, Coro, ** kwargs) ``, где *Loop * - это ссылка на цикл активного события, а *coro * - объект Coroutine Полем Вызов должен передать все *kwargs *и возвращать A: класс: `asyncio.task`-совместимый объект.

source: Required that all *kwargs* are passed on to :class:`asyncio.Task`.
es_es: 要求所有 *kwargs* 被传递给 :class:`asyncio.Task`。

source: *name* is no longer passed to task factories. *context* is no longer passed to task factories if it is ``None``.
es_es: *name* 不再会被传递给任务工厂函数。 如果其为 ``None`` 则 *context* 也不再会被传递给任务工厂函数。

source: Return a task factory or ``None`` if the default one is in use.
es_es: Devuelve una task factory o ``None`` si está en uso la predeterminada.
pt_pt: Devolve uma fábrica de tarefas ou ``None`` se a predefinida estiver em uso.

source: Opening network connections
es_es: Abrir conexiones de red
pt_pt: Abertura de ligações de rede

source: Open a streaming transport connection to a given address specified by *host* and *port*.
es_es: Abre una conexión de transporte de flujo a una dirección dada especificada por *host* y *port*.
pt_pt: Abre uma ligação de transporte de fluxo para um endereço especificado por *host* e *port*.

source: The socket family can be either :py:const:`~socket.AF_INET` or :py:const:`~socket.AF_INET6` depending on *host* (or the *family* argument, if provided).
es_es: Семейство сокетов может быть либо :py:const:`~socket.AF_INET`, либо :py:const:`~socket.AF_INET6` в зависимости от *host* (или аргумента *family*, если он указан).
pt_pt: A família de sockets pode ser :py:const:`~socket.AF_INET` ou :py:const:`~socket.AF_INET6`, dependendo de *host* (ou do argumento *family*, se fornecido).

source: The socket type will be :py:const:`~socket.SOCK_STREAM`.
es_es: Тип сокета будет :py:const:`~socket.SOCK_STREAM`.
pt_pt: O tipo de socket será :py:const:`~socket.SOCK_STREAM`.

source: *protocol_factory* must be a callable returning an :ref:`asyncio protocol <asyncio-protocol>` implementation.
es_es: *protocol_factory* debe ser un callable que devuelva una implementación de :ref:`protocolo asyncio <asyncio-protocol>`.
pt_pt: *protocol_factory* deve ser um callable que devolva uma implementação de :ref:`protocolo asyncio <asyncio-protocol>`.

source: This method will try to establish the connection in the background. When successful, it returns a ``(transport, protocol)`` pair.
es_es: Este método intentará establecer la conexión en segundo plano. Si tiene éxito, devuelve un par ``(transport, protocol)``.
pt_pt: Este método tentará estabelecer a ligação em segundo plano. Quando bem-sucedido, devolve um par ``(transport, protocol)``.

source: The chronological synopsis of the underlying operation is as follows:
es_es: La sinopsis cronológica de la operación subyacente es la siguiente:
pt_pt: O resumo cronológico da operação subjacente é o seguinte:

source: The connection is established and a :ref:`transport <asyncio-transport>` is created for it.
es_es: Se establece la conexión y se crea un :ref:`transport <asyncio-transport>` para ella.
pt_pt: A ligação é estabelecida e um :ref:`transporte <asyncio-transport>` é criado para a mesma.

source: *protocol_factory* is called without arguments and is expected to return a :ref:`protocol <asyncio-protocol>` instance.
es_es: *protocol_factory* se llama sin argumentos y se espera que devuelva una instancia :ref:`protocol <asyncio-protocol>`.
pt_pt: *protocol_factory* é chamado sem argumentos e espera-se que devolva uma instância de :ref:`protocolo <asyncio-protocol>`.

source: The protocol instance is coupled with the transport by calling its :meth:`~BaseProtocol.connection_made` method.
es_es: La instancia del protocolo se acopla al transporte llamando a su método :meth:`~BaseProtocol.connection_made`.
pt_pt: A instância do protocolo é acoplada ao transporte chamando o seu método :meth:`~BaseProtocol.connection_made`.

source: A ``(transport, protocol)`` tuple is returned on success.
es_es: En caso de éxito, se devuelve una tupla ``(transport, protocol)``.
pt_pt: Um tuplo ``(transport, protocol)`` é devolvido em caso de sucesso.

source: The created transport is an implementation-dependent bidirectional stream.
es_es: El transporte creado es un flujo bidireccional que depende de la implementación.
pt_pt: O transporte criado é um fluxo bidirecional dependente da implementação.

source: Other arguments:
es_es: Otros argumentos:
pt_pt: Outros argumentos:

source: *ssl*: if given and not false, a SSL/TLS transport is created (by default a plain TCP transport is created). If *ssl* is a :class:`ssl.SSLContext` object, this context is used to create the transport; if *ssl* is :const:`True`, a default context returned from :func:`ssl.create_default_context` is used.
es_es: *ssl*: si se da y no es false, se crea un transporte SSL/TLS (por defecto se crea un transporte TCP plano). Si *ssl* es un objeto :class:`ssl.SSLContext`, se utiliza este contexto para crear el transporte; si *ssl* es :const:`True`, se utiliza un contexto por defecto devuelto por :func:`ssl.create_default_context`.
pt_pt: *ssl*: se fornecido e não falso, é criado um transporte SSL/TLS (por predefinição, é criado um transporte TCP simples). Se *ssl* for um objeto :class:`ssl.SSLContext`, este contexto é utilizado para criar o transporte; se *ssl* for :const:`True`, é utilizado um contexto predefinido devolvido por :func:`ssl.create_default_context`.

source: *server_hostname* sets or overrides the hostname that the target server's certificate will be matched against. Should only be passed if *ssl* is not ``None``. By default the value of the *host* argument is used. If *host* is empty, there is no default and you must pass a value for *server_hostname*. If *server_hostname* is an empty string, hostname matching is disabled (which is a serious security risk, allowing for potential man-in-the-middle attacks).
es_es: *server_hostname* establece o anula el nombre de host con el que se comparará el certificado del servidor de destino. Sólo debe pasarse si *ssl* no es ``None``. Por defecto se utiliza el valor del argumento *host*. Si *host* está vacío, no hay valor por defecto y debe pasar un valor para *server_hostname*. Si *nombre_de_servidor* es una cadena vacía, la coincidencia de nombres de host está deshabilitada (lo que es un serio riesgo de seguridad, permitiendo potenciales ataques man-in-the-middle).
pt_pt: *server_hostname* define ou substitui o nome do host contra o qual o certificado do servidor de destino será comparado. Deve ser passado apenas se *ssl* não for ``None``. Por predefinição, é utilizado o valor do argumento *host*. Se *host* estiver vazio, não existe um valor predefinido e deve passar um valor para *server_hostname*. Se *server_hostname* for uma string vazia, a correspondência do nome do host é desativada (o que representa um sério risco de segurança, permitindo potenciais ataques man-in-the-middle).

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to getaddrinfo() for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
es_es: *family*, *proto*, *flags* son la familia de direcciones opcional, el protocolo y las banderas que se pasarán a getaddrinfo() para la resolución *host*. Si se dan, deben ser enteros de las constantes correspondientes del módulo :mod:`socket`.
pt_pt: *family*, *proto*, *flags* são a família de endereços, protocolo e flags opcionais a serem passados para getaddrinfo() para resolução de *host*. Se fornecidos, estes devem ser todos inteiros das constantes do módulo :mod:`socket` correspondentes.

source: *happy_eyeballs_delay*, if given, enables Happy Eyeballs for this connection. It should be a floating-point number representing the amount of time in seconds to wait for a connection attempt to complete, before starting the next attempt in parallel. This is the "Connection Attempt Delay" as defined in :rfc:`8305`. A sensible default value recommended by the RFC is ``0.25`` (250 milliseconds).
es_es: *happy_eyeballs_delay*, si se indica, habilita Happy Eyeballs para esta conexión. Debe ser un número en coma flotante que represente la cantidad de tiempo en segundos que hay que esperar a que se complete un intento de conexión, antes de iniciar el siguiente intento en paralelo. Se trata del "Retraso en el intento de conexión" definido en :rfc:`8305`. Un valor por defecto razonable recomendado por la RFC es ``0.25`` (250 milisegundos).
pt_pt: *happy_eyeballs_delay*, se fornecido, ativa o Happy Eyeballs para esta ligação. Deve ser um número de vírgula flutuante que representa a quantidade de tempo em segundos para aguardar que uma tentativa de ligação seja concluída, antes de iniciar a próxima tentativa em paralelo. Este é o "Atraso de Tentativa de Ligação" conforme definido na :rfc:`8305`. Um valor predefinido recomendado pela RFC é ``0.25`` (250 milissegundos).

source: *interleave* controls address reordering when a host name resolves to multiple IP addresses. If ``0`` or unspecified, no reordering is done, and addresses are tried in the order returned by :meth:`getaddrinfo`. If a positive integer is specified, the addresses are interleaved by address family, and the given integer is interpreted as "First Address Family Count" as defined in :rfc:`8305`. The default is ``0`` if *happy_eyeballs_delay* is not specified, and ``1`` if it is.
es_es: *interleave* controla la reordenación de direcciones cuando un nombre de host resuelve múltiples direcciones IP. Si ``0`` o no se especifica, no se realiza ninguna reordenación, y las direcciones se intentan en el orden devuelto por :meth:`getaddrinfo`. Si se especifica un entero positivo, las direcciones se intercalan por familia de direcciones, y el entero dado se interpreta como "First Address Family Count" tal y como se define en :rfc:`8305`. El valor por defecto es ``0`` si *happy_eyeballs_delay* no está especificado, y ``1`` si lo está.
pt_pt: *interleave* controla a reordenação de endereços quando um nome de host resolve para vários endereços IP. Se for ``0`` ou não especificado, não é feita nenhuma reordenação e os endereços são tentados pela ordem devolvida por :meth:`getaddrinfo`. Se for especificado um inteiro positivo, os endereços são intercalados por família de endereços, e o inteiro fornecido é interpretado como "Contagem da Primeira Família de Endereços" conforme definido na :rfc:`8305`. O valor predefinido é ``0`` se *happy_eyeballs_delay* não for especificado, e ``1`` se for.

source: *sock*, if given, should be an existing, already connected :class:`socket.socket` object to be used by the transport. If *sock* is given, none of *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* and *local_addr* should be specified.
es_es: *sock*, si se da, debe ser un objeto :class:`socket.socket` existente y ya conectado para ser usado por el transporte. Si se da *sock*, no debe especificarse *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* y *local_addr*.
pt_pt: *sock*, se fornecido, deve ser um objeto :class:`socket.socket` existente e já ligado a ser utilizado pelo transporte. Se *sock* for fornecido, nenhum dos seguintes deve ser especificado: *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* e *local_addr*.

source: The *sock* argument transfers ownership of the socket to the transport created. To close the socket, call the transport's :meth:`~asyncio.BaseTransport.close` method.
es_es: Аргумент *sock* передает право собственности на сокет созданному транспорту. Чтобы закрыть сокет, вызовите метод транспорта :meth:`~asyncio.BaseTransport.close`.
pt_pt: O argumento *sock* transfere a propriedade do socket para o transporte criado. Para fechar o socket, chame o método :meth:`~asyncio.BaseTransport.close` do transporte.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using ``getaddrinfo()``, similarly to *host* and *port*.
es_es: *local_addr*, si se da, es una tupla ``(local_host, local_port)`` utilizada para enlazar el socket localmente. El *local_host* y *local_port* se buscan usando ``getaddrinfo()``, de forma similar a *host* y *port*.
pt_pt: *local_addr*, se fornecido, é um tuplo ``(local_host, local_port)`` utilizado para ligar o socket localmente. *local_host* e *local_port* são pesquisados utilizando ``getaddrinfo()``, de forma semelhante a *host* e *port*.

source: *ssl_handshake_timeout* is (for a TLS connection) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
es_es: *ssl_handshake_timeout* es (para una conexión TLS) el tiempo en segundos que se debe esperar a que se complete el handshake TLS antes de abortar la conexión. ``60.0`` segundos si ``None`` (por defecto).
pt_pt: *ssl_handshake_timeout* é (para uma ligação TLS) o tempo em segundos para aguardar que o TLS handshake seja concluído antes de abortar a ligação. ``60.0`` segundos se for ``None`` (predefinição).

source: *ssl_shutdown_timeout* is the time in seconds to wait for the SSL shutdown to complete before aborting the connection. ``30.0`` seconds if ``None`` (default).
es_es: *ssl_shutdown_timeout* — время в секундах ожидания завершения завершения работы SSL перед прерыванием соединения. ``30,0`` секунд, если ``Нет`` (по умолчанию).
pt_pt: *ssl_shutdown_timeout* é o tempo em segundos para aguardar que o encerramento SSL seja concluído antes de abortar a ligação. ``30.0`` segundos se for ``None`` (predefinição).
