Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-protocol.po
Languages: es_es, pt_pt, sv

source: **Source code:** :source:`Lib/asyncio/transports.py`
pt_pt: **Código fonte:** :source:`Lib/asyncio/transports.py`
sv: **Källkod:** :source:`Lib/asyncio/transports.py`
