Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: es_es, pt_pt

source: Asynchronous version of :meth:`socket.connect() <socket.socket.connect>`.
es_es: Versión asíncrona de :meth:`socket.connect() <socket.socket.connect>`.
pt_pt: Versão assíncrona de :meth:`socket.connect() <socket.socket.connect>`.

source: ``address`` no longer needs to be resolved. ``sock_connect`` will try to check if the *address* is already resolved by calling :func:`socket.inet_pton`. If not, :meth:`loop.getaddrinfo` will be used to resolve the *address*.
es_es: ``address`` ``sock_connect`` intentará comprobar si la *dirección* ya está resuelta llamando a :func:`socket.inet_pton`. Si no es así, se utilizará :meth:`loop.getaddrinfo` para resolver la *dirección*.
pt_pt: ``address`` já não precisa de ser resolvido. ``sock_connect`` tentará verificar se *address* já está resolvido chamando :func:`socket.inet_pton`. Caso contrário, :meth:`loop.getaddrinfo` será utilizado para resolver *address*.

source: :meth:`loop.create_connection` and :func:`asyncio.open_connection() <open_connection>`.
es_es: :meth:`loop.create_connection` y :func:`asyncio.open_connection() <open_connection>`.
pt_pt: :meth:`loop.create_connection` e :func:`asyncio.open_connection() <open_connection>`.

source: Accept a connection. Modeled after the blocking :meth:`socket.accept() <socket.socket.accept>` method.
es_es: Acepta una conexión. Modelado a partir del método bloqueante :meth:`socket.accept() <socket.socket.accept>`.
pt_pt: Aceita uma ligação. Modelado após o método bloqueante :meth:`socket.accept() <socket.socket.accept>`.

source: The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
es_es: El socket debe estar vinculado a una dirección y a la escucha de conexiones. El valor devuelto es un par ``(conn, address)`` donde *conn* es un *nuevo* objeto socket utilizable para enviar y recibir datos en la conexión, y *address* es la dirección vinculada al socket en el otro extremo de la conexión.
pt_pt: O socket deve estar ligado a um endereço e à escuta de ligações. O valor devolvido é um par ``(conn, address)``, onde *conn* é um *novo* objeto socket utilizável para enviar e receber dados na ligação, e *address* é o endereço ligado ao socket na outra extremidade da ligação.

source: :meth:`loop.create_server` and :func:`start_server`.
es_es: :meth:`loop.create_server` y :func:`start_server`.
pt_pt: :meth:`loop.create_server` e :func:`start_server`.

source: Send a file using high-performance :mod:`os.sendfile` if possible. Return the total number of bytes sent.
es_es: Enviar un archivo utilizando :mod:`os.sendfile` de alto rendimiento si es posible. Devuelve el número total de bytes enviados.
pt_pt: Envie um ficheiro utilizando :mod:`os.sendfile` de alto desempenho, se possível. Devolve o número total de bytes enviados.

source: Asynchronous version of :meth:`socket.sendfile() <socket.socket.sendfile>`.
es_es: Versión asíncrona de :meth:`socket.sendfile() <socket.socket.sendfile>`.
pt_pt: Versão assíncrona de :meth:`socket.sendfile() <socket.socket.sendfile>`.

source: *sock* must be a non-blocking :const:`socket.SOCK_STREAM` :class:`~socket.socket`.
es_es: *sock* debe ser un :const:`socket.SOCK_STREAM` no bloqueante :class:`~socket.socket`.
pt_pt: *sock* deve ser um :const:`socket.SOCK_STREAM` não bloqueante :class:`~socket.socket`.

source: *file* must be a regular file object open in binary mode.
es_es: *file* debe ser un objeto fichero normal abierto en modo binario.
pt_pt: *file* deve ser um objeto de ficheiro regular aberto em modo binário.

source: *fallback*, when set to ``True``, makes asyncio manually read and send the file when the platform does not support the sendfile syscall (e.g. Windows or SSL socket on Unix).
es_es: *fallback*, cuando se establece en ``True``, hace que asyncio lea y envíe manualmente el archivo cuando la plataforma no soporta la llamada syscall sendfile (por ejemplo, Windows o socket SSL en Unix).
pt_pt: *fallback*, quando definido como ``True``, faz com que o asyncio leia e envie manualmente o ficheiro quando a plataforma não suporta a chamada de sistema sendfile (por exemplo, Windows ou socket SSL em Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support *sendfile* syscall and *fallback* is ``False``.
es_es: Lanza :exc:`SendfileNotAvailableError` si el sistema no soporta *sendfile* syscall y *fallback* es ``False``.
pt_pt: Levanta :exc:`SendfileNotAvailableError` se o sistema não suportar a chamada de sistema *sendfile* e *fallback* for ``False``.

source: Asynchronous version of :meth:`socket.getaddrinfo`.
es_es: Versión asíncrona de :meth:`socket.getaddrinfo`.
pt_pt: Versão assíncrona de :meth:`socket.getaddrinfo`.

source: Asynchronous version of :meth:`socket.getnameinfo`.
es_es: Versión asíncrona de :meth:`socket.getnameinfo`.
pt_pt: Versão assíncrona de :meth:`socket.getnameinfo`.

source: Both *getaddrinfo* and *getnameinfo* internally utilize their synchronous versions through the loop's default thread pool executor. When this executor is saturated, these methods may experience delays, which higher-level networking libraries may report as increased timeouts. To mitigate this, consider using a custom executor for other user tasks, or setting a default executor with a larger number of workers.
es_es: И *getaddrinfo*, и *getnameinfo* внутренне используют свои синхронные версии через исполнителя пула потоков цикла по умолчанию. Когда этот исполнитель насыщен, эти методы могут испытывать задержки, о которых сетевые библиотеки более высокого уровня могут сообщать как увеличенные тайм-ауты. Чтобы избежать этого, рассмотрите возможность использования специального исполнителя для других пользовательских задач или установки исполнителя по умолчанию с большим количеством рабочих процессов.
pt_pt: Tanto *getaddrinfo* como *getnameinfo* utilizam internamente as suas versões síncronas através do executor de pool de threads predefinido do ciclo. Quando este executor está saturado, estes métodos podem sofrer atrasos, que bibliotecas de rede de nível superior podem reportar como timeouts aumentados. Para mitigar isto, considere utilizar um executor personalizado para outras tarefas do utilizador, ou definir um executor predefinido com um maior número de trabalhadores.

source: Both *getaddrinfo* and *getnameinfo* methods were always documented to return a coroutine, but prior to Python 3.7 they were, in fact, returning :class:`asyncio.Future` objects. Starting with Python 3.7 both methods are coroutines.
es_es: Ambos métodos *getaddrinfo* y *getnameinfo* siempre estuvieron documentados para devolver una corrutina, pero antes de Python 3.7 devolvían, de hecho, objetos :class:`asyncio.Future`. A partir de Python 3.7 ambos métodos son corrutinas.
pt_pt: Ambos os métodos *getaddrinfo* e *getnameinfo* foram sempre documentados para devolver uma corrotina, mas antes do Python 3.7 devolviam, de facto, objetos :class:`asyncio.Future`. A partir do Python 3.7, ambos os métodos são corrotinas.

source: Working with pipes
es_es: Trabajar con tuberías
pt_pt: Trabalhar com pipes

source: Register the read end of *pipe* in the event loop.
es_es: Registra el extremo de lectura de *pipe* en el bucle de eventos.
pt_pt: Regista a extremidade de leitura de *pipe* no ciclo de eventos.

source: *pipe* is a :term:`file-like object <file object>`.
es_es: *pipe* es un :term:`file-like object <file object>`.
pt_pt: *pipe* é um :term:`objeto tipo ficheiro <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports the :class:`ReadTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
es_es: Devuelve el par ``(transport, protocol)``, donde *transport* soporta la interfaz :class:`ReadTransport` y *protocol* es un objeto instanciado por *protocol_factory*.
pt_pt: Devolve um par ``(transport, protocol)``, onde *transporte* suporta a interface :class:`ReadTransport` e *protocolo* é um objeto instanciado por *protocol_factory*.

source: With :class:`SelectorEventLoop` event loop, the *pipe* is set to non-blocking mode.
es_es: Con :class:`SelectorEventLoop` event loop, el *pipe* se pone en modo no-bloqueo.
pt_pt: Com o ciclo de eventos :class:`SelectorEventLoop`, o *pipe* é definido para modo não bloqueante.

source: Register the write end of *pipe* in the event loop.
es_es: Registra el final de escritura de *pipe* en el bucle de eventos.
pt_pt: Regista a extremidade de escrita de *pipe* no ciclo de eventos.

source: *pipe* is :term:`file-like object <file object>`.
es_es: *pipe* es :term:`file-like object <file object>`.
pt_pt: *pipe* é um :term:`objeto tipo ficheiro <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports :class:`WriteTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
es_es: Devuelve el par ``(transport, protocol)``, donde *transport* soporta la interfaz :class:`WriteTransport` y *protocol* es un objeto instanciado por la *protocol_factory*.
pt_pt: Devolve um par ``(transport, protocol)``, onde *transporte* suporta a interface :class:`WriteTransport` e *protocolo* é um objeto instanciado por *protocol_factory*.

source: :class:`SelectorEventLoop` does not support the above methods on Windows. Use :class:`ProactorEventLoop` instead for Windows.
es_es: :class:`SelectorEventLoop` no admite los métodos anteriores en Windows. Utilice :class:`ProactorEventLoop` en su lugar para Windows.
pt_pt: :class:`SelectorEventLoop` não suporta os métodos acima no Windows. Utilize :class:`ProactorEventLoop` em vez disso para Windows.

source: The :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
es_es: Los métodos :meth:`loop.subprocess_exec` y :meth:`loop.subprocess_shell`.
pt_pt: Os métodos :meth:`loop.subprocess_exec` e :meth:`loop.subprocess_shell`.

source: Unix signals
es_es: Señales Unix
pt_pt: Sinais Unix

source: Set *callback* as the handler for the *signum* signal.
es_es: Establece *callback* como manejador de la señal *signum*.
pt_pt: Define *callback* como o manipulador para o sinal *signum*.

source: The callback will be invoked by *loop*, along with other queued callbacks and runnable coroutines of that event loop. Unlike signal handlers registered using :func:`signal.signal`, a callback registered with this function is allowed to interact with the event loop.
es_es: La llamada de retorno será invocada por *loop*, junto con otras llamadas de retorno en cola y corrutinas ejecutables de ese bucle de eventos. A diferencia de los controladores de señales registrados con :func:`signal.signal`, una llamada de retorno registrada con esta función puede interactuar con el bucle de eventos.
pt_pt: A chamada de retorno será invocada por *loop*, juntamente com outras chamadas de retorno em fila e corrotinas executáveis desse ciclo de eventos. Ao contrário dos manipuladores de sinais registados utilizando :func:`signal.signal`, uma chamada de retorno registada com esta função pode interagir com o ciclo de eventos.

source: Raise :exc:`ValueError` if the signal number is invalid or uncatchable. Raise :exc:`RuntimeError` if there is a problem setting up the handler.
es_es: Lanza :exc:`ValueError` si el número de señal no es válido o no se puede capturar. Lanza :exc:`RuntimeError` si hay un problema al configurar el gestor.
pt_pt: Levanta :exc:`ValueError` se o número do sinal for inválido ou não puder ser capturado. Levanta :exc:`RuntimeError` se houver um problema ao configurar o manipulador.

source: Like :func:`signal.signal`, this function must be invoked in the main thread.
es_es: Al igual que :func:`signal.signal`, esta función debe invocarse en el hilo principal.
pt_pt: Tal como :func:`signal.signal`, esta função deve ser invocada na thread principal.

source: Remove the handler for the *sig* signal.
es_es: Elimina el manejador de la señal *sig*.
pt_pt: Remove o manipulador para o sinal *sig*.

source: Return ``True`` if the signal handler was removed, or ``False`` if no handler was set for the given signal.
es_es: Devuelve ``True`` si se ha eliminado el manejador de señales, o ``False`` si no se ha establecido ningún manejador para la señal dada.
pt_pt: Devolve ``True`` se o manipulador de sinal foi removido, ou ``False`` se nenhum manipulador estava definido para o sinal dado.

source: The :mod:`signal` module.
es_es: El módulo :mod:`signal`.
pt_pt: O módulo :mod:`signal`.

source: Executing code in thread or process pools
es_es: Ejecución de código en pools de hilos o procesos
pt_pt: Execução de código em pools de threads ou processos

source: Arrange for *func* to be called in the specified executor.
es_es: Dispone que *func* sea llamado en el ejecutor especificado.
pt_pt: Organiza para que *func* seja chamada no executor especificado.

source: The *executor* argument should be an :class:`concurrent.futures.Executor` instance. The default executor is used if *executor* is ``None``. The default executor can be set by :meth:`loop.set_default_executor`, otherwise, a :class:`concurrent.futures.ThreadPoolExecutor` will be lazy-initialized and used by :func:`run_in_executor` if needed.
es_es: Аргумент *executor* должен быть экземпляром :class:`concurrent.futures.Executor`. Исполнитель по умолчанию используется, если *executor* имеет значение «None». Исполнитель по умолчанию может быть установлен с помощью :meth:`loop.set_default_executor`, в противном случае :class:`concurrent.futures.ThreadPoolExecutor` будет лениво инициализирован и использован :func:`run_in_executor` при необходимости.

source: Note that the entry point guard (``if __name__ == '__main__'``) is required for option 3 due to the peculiarities of :mod:`multiprocessing`, which is used by :class:`~concurrent.futures.ProcessPoolExecutor`. See :ref:`Safe importing of main module <multiprocessing-safe-main-import>`.
es_es: Обратите внимание, что защита точки входа (``if __name__ == '__main__'``) требуется для варианта 3 из-за особенностей :mod:`multiprocessing`, который используется :class:`~concurrent.futures.ProcessPoolExecutor `. См. :ref:`Безопасный импорт основного модуля <multiprocessing-safe-main-import>`.
pt_pt: Note que a guarda do ponto de entrada (``if __name__ == '__main__'``) é necessária para a opção 3 devido às particularidades do :mod:`multiprocessing`, que é utilizado por :class:`~concurrent.futures.ProcessPoolExecutor`. Consulte :ref:`Importação segura do módulo principal <multiprocessing-safe-main-import>`.

source: This method returns a :class:`asyncio.Future` object.
es_es: Este método devuelve un objeto :class:`asyncio.Future`.
pt_pt: Este método devolve um objeto :class:`asyncio.Future`.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *func*.
es_es: Utilice :func:`functools.partial`:ref:`to pass keyword arguments <asyncio-pass-keywords>` a *func*.
pt_pt: Utilize :func:`functools.partial` :ref:`para passar argumentos de palavra-chave <asyncio-pass-keywords>` para *func*.

source: :meth:`loop.run_in_executor` no longer configures the ``max_workers`` of the thread pool executor it creates, instead leaving it up to the thread pool executor (:class:`~concurrent.futures.ThreadPoolExecutor`) to set the default.
es_es: :meth:`loop.run_in_executor` ya no configura el ``max_workers`` del ejecutor del grupo de hilos que crea, sino que deja que sea el ejecutor del grupo de hilos (:class:`~concurrent.futures.ThreadPoolExecutor`) el que establezca el valor predeterminado.
pt_pt: :meth:`loop.run_in_executor` já não configura o ``max_workers`` do executor de pool de threads que cria, deixando em vez disso que o executor de pool de threads (:class:`~concurrent.futures.ThreadPoolExecutor`) defina o valor predefinido.

source: *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
es_es: *executor* должен быть экземпляром :class:`~concurrent.futures.ThreadPoolExecutor`.
pt_pt: *executor* deve ser uma instância de :class:`~concurrent.futures.ThreadPoolExecutor`.

source: Error Handling API
es_es: API de gestión de errores
pt_pt: API de Tratamento de Erros

source: Allows customizing how exceptions are handled in the event loop.
es_es: Permite personalizar cómo se gestionan las excepciones en el bucle de eventos.
pt_pt: Permite personalizar a forma como as exceções são tratadas no ciclo de eventos.

source: Set *handler* as the new event loop exception handler.
es_es: Establece *handler* como el nuevo manejador de excepciones del bucle de eventos.
pt_pt: Define *handler* como o novo manipulador de exceções do ciclo de eventos.

source: If *handler* is ``None``, the default exception handler will be set. Otherwise, *handler* must be a callable with the signature matching ``(loop, context)``, where ``loop`` is a reference to the active event loop, and ``context`` is a ``dict`` object containing the details of the exception (see :meth:`call_exception_handler` documentation for details about context).
es_es: Si *handler* es ``None``, se establecerá el manejador de excepciones por defecto. En caso contrario, *handler* debe ser un callable con la firma que coincida con ``(loop, context)``, donde ``loop`` es una referencia al bucle de eventos activo, y ``context`` es un objeto ``dict`` que contiene los detalles de la excepción (véase la documentación de :meth:`call_exception_handler` para más detalles sobre el contexto).
pt_pt: Se *handler* for ``None``, o manipulador de exceções predefinido será definido. Caso contrário, *handler* deve ser um callable com a assinatura correspondente a ``(loop, context)``, onde ``loop`` é uma referência ao ciclo de eventos ativo e ``context`` é um objeto ``dict`` contendo os detalhes da exceção (consulte a documentação de :meth:`call_exception_handler` para detalhes sobre o contexto).

source: If the handler is called on behalf of a :class:`~asyncio.Task` or :class:`~asyncio.Handle`, it is run in the :class:`contextvars.Context` of that task or callback handle.
es_es: Если обработчик вызывается от имени :class:`~asyncio.Task` или :class:`~asyncio.Handle`, он запускается в :class:`contextvars.Context` этой задачи или дескриптора обратного вызова.
pt_pt: Se o manipulador for chamado em nome de uma :class:`~asyncio.Task` ou :class:`~asyncio.Handle`, é executado no :class:`contextvars.Context` dessa tarefa ou manipulador de chamada de retorno.

source: The handler may be called in the :class:`~contextvars.Context` of the task or handle where the exception originated.
es_es: Обработчик может быть вызван в :class:`~contextvars.Context` задачи или дескриптора, из которого возникло исключение.
pt_pt: O manipulador pode ser chamado no :class:`~contextvars.Context` da tarefa ou manipulador onde a exceção se originou.

source: Return the current exception handler, or ``None`` if no custom exception handler was set.
es_es: Devuelve el manejador de excepciones actual, o ``None`` si no se ha establecido un manejador de excepciones personalizado.
pt_pt: Devolve o manipulador de exceções atual, ou ``None`` se nenhum manipulador de exceções personalizado foi definido.

source: Default exception handler.
es_es: Gestor de excepciones por defecto.
pt_pt: Manipulador de exceções predefinido.

source: This is called when an exception occurs and no exception handler is set. This can be called by a custom exception handler that wants to defer to the default handler behavior.
es_es: Se ejecuta cuando se produce una excepción y no se ha establecido ningún manejador de excepciones. Esto puede ser llamado por un manejador de excepciones personalizado que quiere diferir al comportamiento del manejador por defecto.
pt_pt: Isto é chamado quando ocorre uma exceção e nenhum manipulador de exceções está definido. Isto pode ser chamado por um manipulador de exceções personalizado que pretenda recorrer ao comportamento do manipulador predefinido.

source: *context* parameter has the same meaning as in :meth:`call_exception_handler`.
es_es: El parámetro *context* tiene el mismo significado que en :meth:`call_exception_handler`.
pt_pt: O parâmetro *context* tem o mesmo significado que em :meth:`call_exception_handler`.

source: Call the current event loop exception handler.
es_es: Llama al manejador de excepciones del bucle de eventos actual.
pt_pt: Chama o manipulador de exceções atual do ciclo de eventos.

source: *context* is a ``dict`` object containing the following keys (new keys may be introduced in future Python versions):
es_es: *context* es un objeto ``dict`` que contiene las siguientes claves (es posible que se introduzcan nuevas claves en futuras versiones de Python):
pt_pt: *context* é um objeto ``dict`` contendo as seguintes chaves (podem ser introduzidas novas chaves em versões futuras do Python):

source: 'message': Error message;
es_es: 'message': Mensaje de error;
pt_pt: 'message': Mensagem de erro;

source: 'exception' (optional): Exception object;
es_es: 'exception' (opcional): Objeto de excepción;
pt_pt: 'exception' (opcional): Objeto de exceção;

source: 'future' (optional): :class:`asyncio.Future` instance;
es_es: 'future' (opcional): :class:`asyncio.Future` instance;
pt_pt: 'future' (opcional): Instância de :class:`asyncio.Future`;

source: 'task' (optional): :class:`asyncio.Task` instance;
es_es: 'task' (opcional): :class:`asyncio.Task` instance;
pt_pt: 'task' (opcional): Instância de :class:`asyncio.Task`;

source: 'handle' (optional): :class:`asyncio.Handle` instance;
es_es: 'handle' (opcional): :class:`asyncio.Handle` instance;
pt_pt: 'handle' (opcional): Instância de :class:`asyncio.Handle`;

source: 'protocol' (optional): :ref:`Protocol <asyncio-protocol>` instance;
es_es: 'protocol' (opcional): :ref:`Protocol <asyncio-protocol>` instance;
pt_pt: 'protocol' (opcional): Instância de :ref:`Protocolo <asyncio-protocol>`;

source: 'transport' (optional): :ref:`Transport <asyncio-transport>` instance;
es_es: 'transport' (opcional): :ref:`Transport <asyncio-transport>` instance;
pt_pt: 'transport' (opcional): Instância de :ref:`Transporte <asyncio-transport>`;

source: 'socket' (optional): :class:`socket.socket` instance;
es_es: 'socket' (opcional): :class:`socket.socket` instance;
pt_pt: 'socket' (opcional): Instância de :class:`socket.socket`;

source: 'source_traceback' (optional): Traceback of the source;
es_es: 'source_traceback' (可选)：源的回溯；

source: 'handle_traceback' (optional): Traceback of the handle;
es_es: 'handle_traceback' (可选)：句柄的回溯；

source: 'asyncgen' (optional): Asynchronous generator that caused
es_es: 'asyncgen' (opcional): Generador asíncrono que provocó
pt_pt: 'asyncgen' (opcional): Gerador assíncrono que causou

source: the exception.
es_es: la excepción.
pt_pt: a exceção.

source: This method should not be overloaded in subclassed event loops. For custom exception handling, use the :meth:`set_exception_handler` method.
es_es: Этот метод не следует перегружать в циклах событий подклассов. Для пользовательской обработки исключений используйте метод :meth:`set_Exception_handler`.
pt_pt: Este método não deve ser sobrecarregado em ciclos de eventos subclassificados. Para tratamento de exceções personalizado, utilize o método :meth:`set_exception_handler`.

source: Enabling debug mode
es_es: Activación del modo de depuración
pt_pt: Ativação do modo de depuração

source: Get the debug mode (:class:`bool`) of the event loop.
es_es: Obtiene el modo de depuración (:class:`bool`) del bucle de eventos.
pt_pt: Obtém o modo de depuração (:class:`bool`) do ciclo de eventos.
