Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-protocol.po
Languages: es_es, pt_pt, sv

source: ``'cipher'``: a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used; result of :meth:`ssl.SSLSocket.cipher`
es_es: ``'cipher'``: una tupla de tres valores que contiene el nombre del cifrado que se está utilizando, la versión del protocolo SSL que define su uso y el número de bits secretos que se están utilizando; resultado de :meth:`ssl.SSLSocket.cipher`
pt_pt: ``'cipher'``: um tuplo de três valores contendo o nome do *cipher* a ser usado, a versão do protocolo SSL que define o seu uso, e o número de bits secretos a serem usados; resultado de :meth:`ssl.SSLSocket.cipher`
sv: ``'cipher'``: en tupel med tre värden som innehåller namnet på det chiffer som används, den version av SSL-protokollet som definierar dess användning och antalet hemliga bitar som används; resultat av :meth:`ssl.SSLSocket.cipher`

source: ``'peercert'``: peer certificate; result of :meth:`ssl.SSLSocket.getpeercert`
es_es: ``'peercert'``: certificado paritario; resultado de :meth:`ssl.SSLSocket.getpeercert`
pt_pt: ``'peercert'``: certificado do par; resultado de :meth:`ssl.SSLSocket.getpeercert`
sv: ``'peercert'``: peer-certifikat; resultat av :meth:`ssl.SSLSocket.getpeercert`

source: ``'sslcontext'``: :class:`ssl.SSLContext` instance
es_es: ``'sslcontext'``: :class:`ssl.SSLContext` instancia
pt_pt: ``'sslcontext'``: instância :class:`ssl.SSLContext`
sv: ``'sslcontext'``: :class:`ssl.SSLContext` instans

source: ``'ssl_object'``: :class:`ssl.SSLObject` or :class:`ssl.SSLSocket` instance
es_es: ``'ssl_object'``: :class:`ssl.SSLObject` o :class:`ssl.SSLSocket` instancia
pt_pt: ``'ssl_object'``: instância :class:`ssl.SSLObject` ou :class:`ssl.SSLSocket`
sv: ``'ssl_object'``: :class:`ssl.SSLObject` eller :class:`ssl.SSLSocket` instans

source: pipe:
es_es: tubería:
sv: rör:

source: ``'pipe'``: pipe object
es_es: ``'pipe'``: objeto tubería
pt_pt: ``'pipe'``: objeto *pipe*
sv: ``'pipe'``: rörobjekt

source: subprocess:
es_es: subproceso:
pt_pt: subprocesso:
sv: underprocess:

source: ``'subprocess'``: :class:`subprocess.Popen` instance
es_es: ``'subprocess'``: :class:`subprocess.Popen` instancia
pt_pt: ``'subprocess'``: instância :class:`subprocess.Popen`
sv: ``'subprocess'``: :class:`subprocess.Popen` instans

source: Set a new protocol.
es_es: Establece un nuevo protocolo.
pt_pt: Define um novo protocolo.
sv: Ställ in ett nytt protokoll.

source: Switching protocol should only be done when both protocols are documented to support the switch.
es_es: El cambio de protocolo sólo debe hacerse cuando ambos protocolos estén documentados para soportar el cambio.
pt_pt: A mudança de protocolo só deve ser feita quando ambos os protocolos estiverem documentados para suportar a mudança.
sv: Byte av protokoll bör endast göras när båda protokollen är dokumenterade för att stödja bytet.

source: Return the current protocol.
es_es: Devuelve el protocolo actual.
pt_pt: Devolve o protocolo atual.
sv: Returnerar det aktuella protokollet.

source: Read-only Transports
es_es: Transportes de sólo lectura
pt_pt: Transportes apenas de leitura
sv: Skrivskyddade transporter

source: Return ``True`` if the transport is receiving new data.
es_es: Devuelve ``True`` si el transporte está recibiendo nuevos datos.
pt_pt: Devolve ``True`` se o transporte estiver a receber novos dados.
sv: Returnerar ``True`` om transporten tar emot nya data.

source: Pause the receiving end of the transport. No data will be passed to the protocol's :meth:`protocol.data_received() <Protocol.data_received>` method until :meth:`resume_reading` is called.
es_es: Pone en pausa el extremo receptor del transporte. No se pasarán datos al método :meth:`protocol.data_received() <Protocol.data_received>` del protocolo hasta que se llame a :meth:`resume_reading`.
pt_pt: Pausa a extremidade de receção do transporte. Nenhum dado será passado para o método :meth:`protocol.data_received() <Protocol.data_received>` do protocolo até que :meth:`resume_reading` seja chamado.
sv: Pausa den mottagande änden av transporten. Inga data kommer att skickas till protokollets :meth:`protocol.data_received() <Protocol.data_received>`\-metod förrän :meth:`resume_reading` anropas.

source: The method is idempotent, i.e. it can be called when the transport is already paused or closed.
es_es: El método es idempotente, es decir, se puede llamar cuando el transporte ya está en pausa o cerrado.
pt_pt: O método é idempotente, ou seja, pode ser chamado quando o transporte já estiver pausado ou fechado.
sv: Metoden är idempotent, d.v.s. den kan anropas när transporten redan är pausad eller stängd.

source: Resume the receiving end. The protocol's :meth:`protocol.data_received() <Protocol.data_received>` method will be called once again if some data is available for reading.
es_es: Reanudar el extremo receptor. Se volverá a llamar al método :meth:`protocol.data_received() <Protocol.data_received>` del protocolo si hay algún dato disponible para leer.
pt_pt: Retoma a extremidade de receção. O método :meth:`protocol.data_received() <Protocol.data_received>` do protocolo será chamado novamente se alguns dados estiverem disponíveis para leitura.
sv: Återuppta den mottagande änden. Protokollets :meth:`protocol.data_received() <Protocol.data_received>`\-metod kommer att anropas igen om några data är tillgängliga för läsning.

source: The method is idempotent, i.e. it can be called when the transport is already reading.
es_es: El método es idempotente, es decir, se puede llamar cuando transport ya está leyendo.
pt_pt: O método é idempotente, ou seja, pode ser chamado quando o transporte já estiver a ler.
sv: Metoden är idempotent, d.v.s. den kan anropas när transporten redan läser.

source: Write-only Transports
es_es: Transports de sólo escritura
pt_pt: Transportes apenas de escrita
sv: Skrivskyddade transporter

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
es_es: Cierre transport inmediatamente, sin esperar a que finalicen las operaciones pendientes. Se perderán los datos almacenados en el búfer. No se recibirán más datos. El método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` del protocolo se llamará finalmente con :const:`None` como argumento.
pt_pt: Fecha o transporte imediatamente, sem esperar que as operações pendentes sejam concluídas. Os dados em *buffer* serão perdidos. Não serão recebidos mais dados. O método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` do protocolo será eventualmente chamado com :const:`None` como argumento.
sv: Stäng transporten omedelbart, utan att vänta på att väntande operationer ska slutföras. Buffrade data kommer att gå förlorade. Inga fler data kommer att tas emot. Protokollets metod :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` kommer så småningom att anropas med :const:`None` som argument.

source: Return :const:`True` if the transport supports :meth:`~WriteTransport.write_eof`, :const:`False` if not.
es_es: Devuelve :const:`True` si transport admite :meth:`~WriteTransport.write_eof`, :const:`False` en caso contrario.
pt_pt: Devolve :const:`True` se o transporte suportar :meth:`~WriteTransport.write_eof`, :const:`False` caso contrário.
sv: Returnerar :const:`True` om transporten stöder :meth:`~WriteTransport.write_eof`, :const:`False` om inte.

source: Return the current size of the output buffer used by the transport.
es_es: Devuelve el tamaño actual del búfer de salida utilizado por transport.
pt_pt: Devolve o tamanho atual do *buffer* de saída usado pelo transporte.
sv: Returnerar den aktuella storleken på den utmatningsbuffert som används av transporten.

source: Get the *high* and *low* watermarks for write flow control. Return a tuple ``(low, high)`` where *low* and *high* are positive number of bytes.
es_es: Obtiene las marcas de agua *high* y *low* para el control de flujo de escritura. Devuelve una tupla ``(low, high)`` donde *low* y *high* son números positivos de bytes.
pt_pt: Obtém os limites *high* e *low* para o controlo de fluxo de escrita. Devolve um tuplo ``(low, high)`` onde *low* e *high* são números positivos de bytes.
sv: Hämta vattenmärkena *hög* och *låg* för skrivflödeskontroll. Returnerar en tupel ``(låg, hög)`` där *låg* och *hög* är positiva antal byte.

source: Use :meth:`set_write_buffer_limits` to set the limits.
es_es: Utilice :meth:`set_write_buffer_limits` para fijar los límites.
pt_pt: Use :meth:`set_write_buffer_limits` para definir os limites.
sv: Använd :meth:`set_write_buffer_limits` för att ställa in gränserna.

source: Set the *high* and *low* watermarks for write flow control.
es_es: Establezca las marcas de agua *high* y *low* para el control del flujo de escritura.
pt_pt: Define os limites *high* e *low* para o controlo de fluxo de escrita.
sv: Ställ in vattenmärkena *hög* och *låg* för skrivflödeskontroll.

source: These two values (measured in number of bytes) control when the protocol's :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` and :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` methods are called. If specified, the low watermark must be less than or equal to the high watermark. Neither *high* nor *low* can be negative.
es_es: Estos dos valores (medidos en número de bytes) controlan cuándo se llama a los métodos :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` y :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` del protocolo. Si se especifica, la marca de agua low debe ser menor o igual que la marca de agua high. Ni *high* ni *low* pueden ser negativas.
pt_pt: Estes dois valores (medidos em número de bytes) controlam quando os métodos :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` e :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` do protocolo são chamados. Se especificado, o limite inferior deve ser menor ou igual ao limite superior. Nem *high* nem *low* podem ser negativos.
sv: Dessa två värden (mätt i antal byte) styr när protokollets metoder :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` och :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` anropas. Om det anges måste det låga vattenmärket vara mindre än eller lika med det höga vattenmärket. Varken *high* eller *low* kan vara negativa.

source: :meth:`~BaseProtocol.pause_writing` is called when the buffer size becomes greater than or equal to the *high* value. If writing has been paused, :meth:`~BaseProtocol.resume_writing` is called when the buffer size becomes less than or equal to the *low* value.
es_es: :meth:`~BaseProtocol.pause_writing` cuando el tamaño del búfer es mayor o igual que el valor *high*. Si se ha detenido la escritura, se llama a :meth:`~BaseProtocol.resume_writing` cuando el tamaño del búfer es menor o igual que el valor *low*.
pt_pt: :meth:`~BaseProtocol.pause_writing` é chamado quando o tamanho do *buffer* se torna maior ou igual ao valor *high*. Se a escrita tiver sido pausada, :meth:`~BaseProtocol.resume_writing` é chamado quando o tamanho do *buffer* se torna menor ou igual ao valor *low*.
sv: :meth:`~BaseProtocol.pause_writing` anropas när buffertstorleken blir större än eller lika med värdet *high*. Om skrivningen har pausats anropas :meth:`~BaseProtocol.resume_writing` när buffertstorleken blir mindre än eller lika med värdet *low*.

source: The defaults are implementation-specific. If only the high watermark is given, the low watermark defaults to an implementation-specific value less than or equal to the high watermark. Setting *high* to zero forces *low* to zero as well, and causes :meth:`~BaseProtocol.pause_writing` to be called whenever the buffer becomes non-empty. Setting *low* to zero causes :meth:`~BaseProtocol.resume_writing` to be called only once the buffer is empty. Use of zero for either limit is generally sub-optimal as it reduces opportunities for doing I/O and computation concurrently.
es_es: Los valores por defecto son específicos de cada aplicación. Si sólo se especifica la marca de agua high, la marca de agua low será por defecto un valor específico de la implementación menor o igual que la marca de agua high. Establecer *high* a cero fuerza *low* a cero también, y hace que se llame a :meth:`~BaseProtocol.pause_writing` siempre que el buffer no esté vacío. Establecer *low* a cero hace que :meth:`~BaseProtocol.resume_writing` se llame sólo una vez a que el buffer esté vacío. El uso de cero para cualquiera de los límites es generalmente sub-óptimo ya que reduce las oportunidades de hacer E/S y computación concurrentemente.
pt_pt: Os valores predefinidos são específicos da implementação. Se apenas o limite superior for dado, o limite inferior assume um valor específico da implementação, menor ou igual ao limite superior. Definir *high* para zero força *low* a zero também, e faz com que :meth:`~BaseProtocol.pause_writing` seja chamado sempre que o *buffer* se tornar não vazio. Definir *low* para zero faz com que :meth:`~BaseProtocol.resume_writing` seja chamado apenas quando o *buffer* estiver vazio. O uso de zero para qualquer limite é geralmente sub-ótimo, pois reduz as oportunidades de fazer I/O e computação concorrentemente.
sv: Standardvärdena är implementationsspecifika. Om endast det höga vattenmärket anges, är det låga vattenmärket ett implementationsspecifikt standardvärde som är mindre än eller lika med det höga vattenmärket. Om *high* sätts till noll sätts även *low* till noll, vilket gör att :meth:`~BaseProtocol.pause_writing` anropas när bufferten inte längre är tom. Om *low* sätts till noll kommer :meth:`~BaseProtocol.resume_writing` att anropas först när bufferten är tom. Att använda noll för någon av gränserna är i allmänhet suboptimalt eftersom det minskar möjligheterna att göra I/O och beräkningar samtidigt.

source: Use :meth:`~WriteTransport.get_write_buffer_limits` to get the limits.
es_es: Usar :meth:`~WriteTransport.get_write_buffer_limits` para obtener los límites.
pt_pt: Use :meth:`~WriteTransport.get_write_buffer_limits` para obter os limites.
sv: Använd :meth:`~WriteTransport.get_write_buffer_limits` för att få fram gränserna.

source: Write some *data* bytes to the transport.
es_es: Escribir algunos bytes de *datos* en transport.
pt_pt: Escreve alguns bytes de *data* para o transporte.
sv: Skriv några *data*-bytes till transporten.

source: This method does not block; it buffers the data and arranges for it to be sent out asynchronously.
es_es: Este método no se bloquea; almacena los datos en la memoria intermedia y se encarga de que se envíen de forma asíncrona.
pt_pt: Este método não bloqueia; coloca os dados em *buffer* e organiza-os para serem enviados de forma assíncrona.
sv: Den här metoden blockerar inte, utan buffrar data och ser till att den skickas ut asynkront.

source: Write a list (or any iterable) of data bytes to the transport. This is functionally equivalent to calling :meth:`write` on each element yielded by the iterable, but may be implemented more efficiently.
es_es: Escribe una lista (o cualquier iterable) de bytes de datos en transport. Esto es funcionalmente equivalente a llamar a :meth:`write` en cada elemento producido por el iterable, pero se puede implementar de manera más eficiente.
pt_pt: Escreve uma lista (ou qualquer iterável) de bytes de dados para o transporte. Isto é funcionalmente equivalente a chamar :meth:`write` em cada elemento produzido pelo iterável, mas pode ser implementado de forma mais eficiente.
sv: Skriv en lista (eller en iterabel) med databytes till transporten. Detta är funktionellt likvärdigt med att anropa :meth:`write` på varje element som iterabeln ger, men kan implementeras mer effektivt.

source: Close the write end of the transport after flushing all buffered data. Data may still be received.
es_es: Cierra el extremo de escritura del transporte después de vaciar todos los datos almacenados en el búfer. Es posible que se sigan recibiendo datos.
pt_pt: Fecha a extremidade de escrita do transporte após descarregar todos os dados em *buffer*. Os dados ainda podem ser recebidos.
sv: Stäng transportens skrivände efter att ha spolat ut alla buffrade data. Data kan fortfarande tas emot.

source: This method can raise :exc:`NotImplementedError` if the transport (e.g. SSL) doesn't support half-closed connections.
es_es: Este método puede generar :exc:`NotImplementedError` si el transporte (por ejemplo, SSL) no admite conexiones semicerradas.
pt_pt: Este método pode gerar :exc:`NotImplementedError` se o transporte (por exemplo, SSL) não suportar ligações semi-fechadas.
sv: Denna metod kan ge upphov till :exc:`NotImplementedError` om transporten (t.ex. SSL) inte stöder halvstängda anslutningar.

source: Datagram Transports
es_es: Transports de datagramas
pt_pt: Transportes de datagrama
sv: Datagramtransporter

source: Send the *data* bytes to the remote peer given by *addr* (a transport-dependent target address). If *addr* is :const:`None`, the data is sent to the target address given on transport creation.
es_es: Envía los bytes *data* al par remoto indicado por *addr* (una dirección de destino dependiente del transporte). Si *addr* es :const:`None`, los datos se envían a la dirección de destino dada en la creación del transporte.
pt_pt: Envie os bytes de *data* para o par remoto dado por *addr* (um endereço de destino dependente do transporte). Se *addr* for :const:`None`, os dados são enviados para o endereço de destino dado na criação do transporte.
sv: Skicka *data* byte till den fjärrpeer som anges av *addr* (en transportberoende måladress). Om *addr* är :const:`None` skickas data till den måladress som anges när transporten skapas.

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
es_es: Cierre transport inmediatamente, sin esperar a que finalicen las operaciones pendientes. Se perderán los datos almacenados en el búfer. No se recibirán más datos. El :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` del protocolo se llamará finalmente con :const:`None` como argumento.
pt_pt: Fecha o transporte imediatamente, sem esperar que as operações pendentes sejam concluídas. Os dados em *buffer* serão perdidos. Não serão recebidos mais dados. O método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` do protocolo será eventualmente chamado com :const:`None` como argumento.
sv: Stäng transporten omedelbart, utan att vänta på att väntande operationer ska slutföras. Buffrade data kommer att gå förlorade. Inga fler data kommer att tas emot. Protokollets metod :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` kommer så småningom att anropas med :const:`None` som argument.

source: Subprocess Transports
es_es: Subproceso Transports
pt_pt: Transportes de subprocesso
sv: Underprocess transporter

source: Return the subprocess process id as an integer.
es_es: Devuelve el id de proceso del subproceso como un entero.
pt_pt: Devolve o ID do processo do subprocesso como um inteiro.
sv: Returnerar subprocessens process-ID som ett heltal.

source: Return the transport for the communication pipe corresponding to the integer file descriptor *fd*:
es_es: Devuelve el transporte de la tubería de comunicación correspondiente al descriptor de fichero entero *fd*:
pt_pt: Devolve o transporte para o *pipe* de comunicação correspondente ao descritor de ficheiro inteiro *fd*:
sv: Returnera transporten för kommunikationsröret som motsvarar filbeskrivaren för heltal *fd*:

source: other *fd*: :const:`None`
es_es: otros *fd*: :const:`None`
pt_pt: outro *fd*: :const:`None`
sv: andra *fd*: :const:`None`

source: Return the subprocess return code as an integer or :const:`None` if it hasn't returned, which is similar to the :attr:`subprocess.Popen.returncode` attribute.
es_es: Devuelve el código de retorno del subproceso como un entero o :const:`None` si no ha vuelto, que es similar al atributo :attr:`subprocess.Popen.returncode`.
pt_pt: Devolve o código de retorno do subprocesso como um inteiro ou :const:`None` se ainda não retornou, o que é semelhante ao atributo :attr:`subprocess.Popen.returncode`.
sv: Returnerar subprocessens returkod som ett heltal eller :const:`None` om den inte har returnerats, vilket liknar attributet :attr:`subprocess.Popen.returncode`.

source: Kill the subprocess.
es_es: Mata el subproceso.
pt_pt: Mata o subprocesso.
sv: Stäng av underprocessen.

source: On POSIX systems, the function sends SIGKILL to the subprocess. On Windows, this method is an alias for :meth:`terminate`.
es_es: En sistemas POSIX, la función envía SIGKILL al subproceso. En Windows, este método es un alias de :meth:`terminate`.
pt_pt: Em sistemas POSIX, a função envia SIGKILL para o subprocesso. No Windows, este método é um alias para :meth:`terminate`.
sv: På POSIX-system skickar funktionen SIGKILL till subprocessen. I Windows är den här metoden ett alias för :meth:`terminate`.

source: See also :meth:`subprocess.Popen.kill`.
es_es: Ver también :meth:`subprocess.Popen.kill`.
pt_pt: Veja também :meth:`subprocess.Popen.kill`.
sv: Se även :meth:`subprocess.Popen.kill`.

source: Send the *signal* number to the subprocess, as in :meth:`subprocess.Popen.send_signal`.
es_es: Envía el número de *señal* al subproceso, como en :meth:`subprocess.Popen.send_signal`.
pt_pt: Envie o número do *signal* para o subprocesso, como em :meth:`subprocess.Popen.send_signal`.
sv: Skicka *signal*-numret till underprocessen, som i :meth:`subprocess.Popen.send_signal`.

source: Stop the subprocess.
es_es: Detener el subproceso.
pt_pt: Para o subprocesso.
sv: Stoppa underprocessen.

source: On POSIX systems, this method sends :py:const:`~signal.SIGTERM` to the subprocess. On Windows, the Windows API function :c:func:`!TerminateProcess` is called to stop the subprocess.
es_es: En sistemas POSIX, este método envía :py:const:`~signal.SIGTERM` al subproceso. En Windows, se llama a la función de la API de Windows :c:func:`!TerminateProcess` para detener el subproceso.

source: See also :meth:`subprocess.Popen.terminate`.
es_es: Ver también :meth:`subprocess.Popen.terminate`.
pt_pt: Veja também :meth:`subprocess.Popen.terminate`.
sv: Se även :meth:`subprocess.Popen.terminate`.

source: Kill the subprocess by calling the :meth:`kill` method.
es_es: Mata el subproceso llamando al método :meth:`kill`.
pt_pt: Mata o subprocesso chamando o método :meth:`kill`.
sv: Döda subprocessen genom att anropa metoden :meth:`kill`.

source: If the subprocess hasn't returned yet, and close transports of *stdin*, *stdout*, and *stderr* pipes.
es_es: Si el subproceso aún no ha regresado, y cerrar los transportes de tuberías *stdin*, *stdout* y *stderr*.
pt_pt: Se o subprocesso ainda não tiver retornado, fecha os transportes dos *pipes* de *stdin*, *stdout* e *stderr*.
sv: Om underprocessen inte har återvänt ännu, och stäng transporterna av rören *stdin*, *stdout* och *stderr*.

source: Protocols
es_es: Protocolos
pt_pt: Protocolos
sv: Protokoll

source: **Source code:** :source:`Lib/asyncio/protocols.py`
es_es: **Código fuente:** :source:`Lib/asyncio/protocols.py`
pt_pt: **Código fonte:** :source:`Lib/asyncio/protocols.py`
sv: **Källkod:** :source:`Lib/asyncio/protocols.py`
