Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-platforms.po
Languages: es_es, ru, sv

source: Platform Support
es_es: Soporte de plataformas
ru: Поддержка платформы
sv: Plattformsstöd

source: The :mod:`asyncio` module is designed to be portable, but some platforms have subtle differences and limitations due to the platforms' underlying architecture and capabilities.
es_es: El módulo :mod:`asyncio` está diseñado para ser portátil, pero algunas plataformas presentan sutiles diferencias y limitaciones debidas a la arquitectura y capacidades subyacentes de las mismas.
ru: Модуль :mod:`asyncio` спроектирован так, чтобы быть переносимым, но некоторые платформы имеют небольшие различия и ограничения, связанные с базовой архитектурой и возможностями платформ.
sv: Modulen :mod:`asyncio` är utformad för att vara portabel, men vissa plattformar har subtila skillnader och begränsningar på grund av plattformarnas underliggande arkitektur och kapacitet.

source: All Platforms
es_es: Todas las plataformas
ru: Все платформы
sv: Alla plattformar

source: :meth:`loop.add_reader` and :meth:`loop.add_writer` cannot be used to monitor file I/O.
es_es: :meth:`loop.add_reader` y :meth:`loop.add_writer` no pueden utilizarse para supervisar la E/S de archivos.
ru: :meth:`loop.add_reader` и :meth:`loop.add_writer` нельзя использовать для мониторинга файлового ввода-вывода.
sv: :meth:`loop.add_reader` och :meth:`loop.add_writer` kan inte användas för att övervaka fil-I/O.

source: **Source code:** :source:`Lib/asyncio/proactor_events.py`, :source:`Lib/asyncio/windows_events.py`, :source:`Lib/asyncio/windows_utils.py`
es_es: **Código fuente:** :source:`Lib/asyncio/proactor_events.py`, :source:`Lib/asyncio/windows_events.py`, :source:`Lib/asyncio/windows_utils.py`
ru: **Исходный код:** :source:`Lib/asyncio/proactor_events.py`, :source:`Lib/asyncio/windows_events.py`, :source:`Lib/asyncio/windows_utils.py`
sv: **Källkod:** :source:`Lib/asyncio/proactor_events.py`, :source:`Lib/asyncio/windows_events.py`, :source:`Lib/asyncio/windows_utils.py`

source: On Windows, :class:`ProactorEventLoop` is now the default event loop.
es_es: En Windows, :class:`ProactorEventLoop` es ahora el bucle de eventos por defecto.
ru: В Windows :class:`ProactorEventLoop` теперь является циклом событий по умолчанию.
sv: I Windows är :class:`ProactorEventLoop` nu standardhändelseslingan.

source: All event loops on Windows do not support the following methods:
es_es: Todos los bucles de eventos en Windows no admiten los siguientes métodos:
ru: Все циклы событий в Windows не поддерживают следующие методы:
sv: Alla händelseslingor i Windows stöder inte följande metoder:

source: :meth:`loop.add_signal_handler` and :meth:`loop.remove_signal_handler` are not supported.
es_es: :meth:`loop.add_signal_handler` y :meth:`loop.remove_signal_handler` no son compatibles.
ru: :meth:`loop.add_signal_handler` и :meth:`loop.remove_signal_handler` не поддерживаются.
sv: :meth:`loop.add_signal_handler` och :meth:`loop.remove_signal_handler` stöds inte.

source: :class:`SelectorEventLoop` has the following limitations:
es_es: :class:`SelectorEventLoop` tiene las siguientes limitaciones:
ru: :class:`SelectorEventLoop` имеет следующие ограничения:
sv: :class:`SelectorEventLoop` har följande begränsningar:

source: :class:`~selectors.SelectSelector` is used to wait on socket events: it supports sockets and is limited to 512 sockets.
es_es: :class:`~selectors.SelectSelector` se utiliza para esperar eventos de socket: soporta sockets y está limitado a 512 sockets.
ru: :class:`~selectors.SelectSelector` используется для ожидания событий сокета: он поддерживает сокеты и ограничен 512 сокетами.
sv: :class:`~selectors.SelectSelector` används för att vänta på socket-händelser: den stöder sockets och är begränsad till 512 sockets.

source: :meth:`loop.add_reader` and :meth:`loop.add_writer` only accept socket handles (e.g. pipe file descriptors are not supported).
es_es: :meth:`loop.add_reader` y :meth:`loop.add_writer` sólo aceptan manejadores de socket (por ejemplo, no se admiten descriptores de archivo de tubería).
ru: :meth:`loop.add_reader` и :meth:`loop.add_writer` принимают только дескрипторы сокетов (например, дескрипторы файлов каналов не поддерживаются).
sv: :meth:`loop.add_reader` och :meth:`loop.add_writer` accepterar endast socket-handtag (t.ex. pipe file descriptors stöds inte).

source: Pipes are not supported, so the :meth:`loop.connect_read_pipe` and :meth:`loop.connect_write_pipe` methods are not implemented.
es_es: Las tuberías no son compatibles, por lo que los métodos :meth:`loop.connect_read_pipe` y :meth:`loop.connect_write_pipe` no están implementados.
ru: Каналы не поддерживаются, поэтому методы :meth:`loop.connect_read_pipe` и :meth:`loop.connect_write_pipe` не реализованы.
sv: Pipes stöds inte, så metoderna :meth:`loop.connect_read_pipe` och :meth:`loop.connect_write_pipe` implementeras inte.

source: :ref:`Subprocesses <asyncio-subprocess>` are not supported, i.e. :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods are not implemented.
es_es: :ref:`Subprocesses <asyncio-subprocess>` no son compatibles, es decir, los métodos :meth:`loop.subprocess_exec` y :meth:`loop.subprocess_shell` no están implementados.
ru: :ref:`Подпроцессы <asyncio-subprocess>` не поддерживаются, т.е. методы :meth:`loop.subprocess_exec` и :meth:`loop.subprocess_shell` не реализованы.
sv: :ref:`Subprocesser <asyncio-subprocess>` stöds inte, dvs. metoderna :meth:`loop.subprocess_exec` och :meth:`loop.subprocess_shell` implementeras inte.

source: :class:`ProactorEventLoop` has the following limitations:
es_es: :class:`ProactorEventLoop` tiene las siguientes limitaciones:
ru: :class:`ProactorEventLoop` имеет следующие ограничения:
sv: :class:`ProactorEventLoop` har följande begränsningar:

source: The :meth:`loop.add_reader` and :meth:`loop.add_writer` methods are not supported.
es_es: Los métodos :meth:`loop.add_reader` y :meth:`loop.add_writer` no son compatibles.
ru: Методы :meth:`loop.add_reader` и :meth:`loop.add_writer` не поддерживаются.
sv: Metoderna :meth:`loop.add_reader` och :meth:`loop.add_writer` stöds inte.

source: Subprocess Support on Windows
es_es: Soporte de subprocesos en Windows
ru: Поддержка подпроцессов в Windows
sv: Stöd för underprocesser i Windows

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not.
es_es: En Windows, el bucle de eventos por defecto :class:`ProactorEventLoop` admite subprocesos, mientras que :class:`SelectorEventLoop` no.
ru: В Windows цикл событий по умолчанию :class:`ProactorEventLoop` поддерживает подпроцессы, а :class:`SelectorEventLoop` — нет.
sv: I Windows har standardhändelseslingan :class:`ProactorEventLoop` stöd för underprocesser, medan :class:`SelectorEventLoop` inte har det.

source: The :meth:`policy.set_child_watcher() <AbstractEventLoopPolicy.set_child_watcher>` function is also not supported, as :class:`ProactorEventLoop` has a different mechanism to watch child processes.
es_es: La función :meth:`policy.set_child_watcher() <AbstractEventLoopPolicy.set_child_watcher>` tampoco es compatible, ya que :class:`ProactorEventLoop` tiene un mecanismo diferente para vigilar los procesos hijo.
ru: Функция :meth:`policy.set_child_watcher() <AbstractEventLoopPolicy.set_child_watcher>` также не поддерживается, поскольку :class:`ProactorEventLoop` имеет другой механизм наблюдения за дочерними процессами.

source: Modern macOS versions are fully supported.
es_es: Las versiones modernas de macOS son totalmente compatibles.
ru: Современные версии macOS полностью поддерживаются.
sv: Moderna macOS-versioner stöds fullt ut.

source: On macOS 10.6, 10.7 and 10.8, the default event loop uses :class:`selectors.KqueueSelector`, which does not support character devices on these versions. The :class:`SelectorEventLoop` can be manually configured to use :class:`~selectors.SelectSelector` or :class:`~selectors.PollSelector` to support character devices on these older versions of macOS. Example::
es_es: En macOS 10.6, 10.7 y 10.8, el bucle de eventos predeterminado utiliza :class:`selectors.KqueueSelector`, que no admite dispositivos de caracteres en estas versiones. El :class:`SelectorEventLoop` se puede configurar manualmente para usar :class:`~selectors.SelectSelector` o :class:`~selectors.PollSelector` para soportar dispositivos de caracteres en estas versiones antiguas de macOS. Ejemplo::
ru: В macOS 10.6, 10.7 и 10.8 цикл событий по умолчанию использует :class:`selectors.KqueueSelector`, который не поддерживает символьные устройства в этих версиях. :class:`SelectorEventLoop` можно вручную настроить на использование :class:`~selectors.SelectSelector` или :class:`~selectors.PollSelector` для поддержки символьных устройств в этих старых версиях macOS. Пример::
sv: På macOS 10.6, 10.7 och 10.8 använder standardhändelseslingan :class:`selectors.KqueueSelector`, som inte stöder teckenenheter på dessa versioner. Händelseslingan :class:`SelectorEventLoop` kan konfigureras manuellt så att den använder :class:`~selectors.SelectSelector` eller :class:`~selectors.PollSelector` för att stödja teckenenheter i dessa äldre versioner av macOS. Exempel::
