Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-protocol.po
Languages: es_es, pt_pt, sv

source: Transports and Protocols
es_es: Transportes y protocolos
pt_pt: Transportes e Protocolos
sv: Transporter och protokoll

source: Preface
es_es: Prefacio
pt_pt: Prefácio
sv: Förord

source: Transports and Protocols are used by the **low-level** event loop APIs such as :meth:`loop.create_connection`. They use callback-based programming style and enable high-performance implementations of network or IPC protocols (e.g. HTTP).
es_es: Los transportes y protocolos son utilizados por las API de bucle de eventos de **bajo nivel** como :meth:`loop.create_connection`. Utilizan un estilo de programación basado en llamadas de retorno y permiten implementaciones de alto rendimiento de protocolos de red o IPC (por ejemplo, HTTP).
pt_pt: Os Transportes e Protocolos são usados pelas APIs de **baixo nível** do ciclo de eventos, como :meth:`loop.create_connection`. Utilizam um estilo de programação baseado em *callbacks* e permitem implementações de alto desempenho de protocolos de rede ou IPC (por exemplo, HTTP).
sv: Transporter och protokoll används av API:er för händelseslingor på **låg nivå**, t.ex. :meth:`loop.create_connection`. De använder en callback-baserad programmeringsstil och möjliggör högpresterande implementeringar av nätverks- eller IPC-protokoll (t.ex. HTTP).

source: Essentially, transports and protocols should only be used in libraries and frameworks and never in high-level asyncio applications.
es_es: Esencialmente, los transportes y protocolos sólo deberían utilizarse en bibliotecas y frameworks y nunca en aplicaciones asyncio de alto nivel.
pt_pt: Essencialmente, os transportes e protocolos devem ser usados apenas em bibliotecas e *frameworks*, e nunca em aplicações asyncio de alto nível.
sv: I grund och botten bör transporter och protokoll endast användas i bibliotek och ramverk och aldrig i asyncio-applikationer på hög nivå.

source: This documentation page covers both `Transports`_ and `Protocols`_.
es_es: Esta página de documentación abarca tanto `Transports`_ como `Protocols`_.
pt_pt: Esta página de documentação abrange tanto `Transports`_ como `Protocols`_.
sv: Denna dokumentationssida omfattar både `Transports`_ och `Protocols`_.

source: Introduction
es_es: Introducción
pt_pt: Introdução
sv: Introduktion

source: At the highest level, the transport is concerned with *how* bytes are transmitted, while the protocol determines *which* bytes to transmit (and to some extent when).
es_es: Al más alto nivel, el transporte se ocupa de *how* se transmiten los bytes, mientras que el protocolo determina *which* bytes transmitir (y hasta cierto punto cuándo).
pt_pt: Num nível mais elevado, o transporte está preocupado com *como* os bytes são transmitidos, enquanto o protocolo determina *quais* bytes transmitir (e, até certo ponto, quando).
sv: På högsta nivå handlar transporten om *hur* bytes överförs, medan protokollet avgör *vilka* bytes som ska överföras (och i viss mån när).

source: A different way of saying the same thing: a transport is an abstraction for a socket (or similar I/O endpoint) while a protocol is an abstraction for an application, from the transport's point of view.
es_es: Una forma diferente de decir lo mismo: un transporte es una abstracción para un socket (o punto final de E/S similar) mientras que un protocolo es una abstracción para una aplicación, desde el punto de vista del transporte.
pt_pt: Outra forma de dizer a mesma coisa: um transporte é uma abstração para um *socket* (ou ponto final de I/O semelhante), enquanto um protocolo é uma abstração para uma aplicação, do ponto de vista do transporte.
sv: Ett annat sätt att säga samma sak: en transport är en abstraktion för en socket (eller liknande I/O-slutpunkt) medan ett protokoll är en abstraktion för en applikation, ur transportens synvinkel.

source: Yet another view is the transport and protocol interfaces together define an abstract interface for using network I/O and interprocess I/O.
es_es: Otro punto de vista es que las interfaces de transporte y protocolo definen conjuntamente una interfaz abstracta para utilizar la E/S de red y la E/S entre procesos.
pt_pt: Outra visão é que as interfaces de transporte e protocolo, em conjunto, definem uma interface abstrata para usar I/O de rede e I/O entre processos.
sv: En annan syn är att transport- och protokollgränssnitten tillsammans definierar ett abstrakt gränssnitt för användning av nätverks-I/O och interprocess-I/O.

source: There is always a 1:1 relationship between transport and protocol objects: the protocol calls transport methods to send data, while the transport calls protocol methods to pass it data that has been received.
es_es: Siempre existe una relación 1:1 entre los objetos de transporte y protocolo: el protocolo llama a los métodos de transporte para enviar datos, mientras que el transporte llama a los métodos de protocolo para pasarle los datos que ha recibido.
pt_pt: Existe sempre uma relação 1:1 entre objetos de transporte e protocolo: o protocolo chama métodos de transporte para enviar dados, enquanto o transporte chama métodos de protocolo para passar dados que foram recebidos.
sv: Det finns alltid ett 1:1-förhållande mellan transport- och protokollobjekt: protokollet anropar transportmetoder för att skicka data, medan transporten anropar protokollmetoder för att vidarebefordra data som har mottagits.

source: Most of connection oriented event loop methods (such as :meth:`loop.create_connection`) usually accept a *protocol_factory* argument used to create a *Protocol* object for an accepted connection, represented by a *Transport* object. Such methods usually return a tuple of ``(transport, protocol)``.
es_es: La mayoría de los métodos de bucle de eventos orientados a conexión (como :meth:`loop.create_connection`) suelen aceptar un argumento *protocol_factory* utilizado para crear un objeto *Protocol* para una conexión aceptada, representada por un objeto *Transport*. Tales métodos normalmente devuelven una tupla de ``(transport, protocol)``.
pt_pt: A maioria dos métodos de ciclo de eventos orientados à ligação (como :meth:`loop.create_connection`) geralmente aceita um argumento *protocol_factory* usado para criar um objeto *Protocol* para uma ligação aceite, representado por um objeto *Transport*. Esses métodos geralmente retornam um tuplo de ``(transport, protocol)``.
sv: De flesta anslutningsorienterade event loop-metoder (t.ex. :meth:`loop.create_connection`) accepterar vanligtvis ett *protocol_factory*-argument som används för att skapa ett *Protocol*-objekt för en accepterad anslutning, representerad av ett *Transport*-objekt. Sådana metoder returnerar vanligtvis en tupel av ``(transport, protocol)``.

source: Contents
es_es: Contenido
pt_pt: Conteúdos
sv: Innehåll

source: This documentation page contains the following sections:
es_es: Esta página de documentación contiene las siguientes secciones:
pt_pt: Esta página de documentação contém as seguintes secções:
sv: Denna dokumentationssida innehåller följande avsnitt:

source: The `Transports`_ section documents asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, and :class:`SubprocessTransport` classes.
es_es: La sección `Transports`_ documenta las clases asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, y :class:`SubprocessTransport`.
pt_pt: A secção `Transports`_ documenta as classes asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, e :class:`SubprocessTransport`.
sv: Avsnittet `Transports`_ dokumenterar asyncio klasserna :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport` och :class:`SubprocessTransport`.

source: The `Protocols`_ section documents asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, and :class:`SubprocessProtocol` classes.
es_es: La sección `Protocols`_ documenta las clases asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, y :class:`SubprocessProtocol`.
pt_pt: A secção `Protocols`_ documenta as classes asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, e :class:`SubprocessProtocol`.
sv: Avsnittet `Protocols`_ dokumenterar asyncio klasserna :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol` och :class:`SubprocessProtocol`.

source: The `Examples`_ section showcases how to work with transports, protocols, and low-level event loop APIs.
es_es: La sección `Examples`_ muestra cómo trabajar con transportes, protocolos y APIs de bucle de eventos de bajo nivel.
pt_pt: A secção `Examples`_ mostra como trabalhar com transportes, protocolos e APIs de baixo nível do ciclo de eventos.
sv: Avsnittet `Examples`_ visar hur man arbetar med transporter, protokoll och API:er för händelseslingor på låg nivå.

source: Transports
es_es: Transportes
pt_pt: Transportes
sv: Transporter

source: Transports are classes provided by :mod:`asyncio` in order to abstract various kinds of communication channels.
es_es: Los transportes son clases proporcionadas por :mod:`asyncio` para abstraer varios tipos de canales de comunicación.
pt_pt: Os Transportes são classes fornecidas por :mod:`asyncio` para abstrair vários tipos de canais de comunicação.
sv: Transporter är klasser som tillhandahålls av :mod:`asyncio` för att abstrahera olika typer av kommunikationskanaler.

source: Transport objects are always instantiated by an :ref:`asyncio event loop <asyncio-event-loop>`.
es_es: Los objetos de transporte siempre se ejemplifican mediante :ref:`asyncio event loop <asyncio-event-loop>`.
pt_pt: Os objetos de Transporte são sempre instanciados por um :ref:`ciclo de eventos asyncio <asyncio-event-loop>`.
sv: Transportobjekt instansieras alltid av en :ref:`asyncio event loop <asyncio-event-loop>`.

source: asyncio implements transports for TCP, UDP, SSL, and subprocess pipes. The methods available on a transport depend on the transport's kind.
es_es: asyncio implementa transportes para TCP, UDP, SSL y tuberías de subprocesos. Los métodos disponibles en un transporte dependen del tipo de transporte.
pt_pt: O asyncio implementa transportes para TCP, UDP, SSL e *pipes* de subprocessos. Os métodos disponíveis num transporte dependem do tipo de transporte.
sv: asyncio implementerar transporter för TCP, UDP, SSL och subprocessrör. Vilka metoder som är tillgängliga för en transport beror på transportens typ.

source: The transport classes are :ref:`not thread safe <asyncio-multithreading>`.
es_es: Las clases de transporte son :ref:`no thread safe <asyncio-multithreading>`.
pt_pt: As classes de transporte :ref:`não são seguras para *threads* <asyncio-multithreading>`.
sv: Transportklasserna är :ref:`not thread safe <asyncio-multithreading>`.

source: Transports Hierarchy
es_es: Jerarquía de transportes
pt_pt: Hierarquia de Transportes
sv: Transporter Hierarki

source: Base class for all transports. Contains methods that all asyncio transports share.
es_es: Clase base para todos los transportes. Contiene métodos que comparten todos los transportes asyncio.
pt_pt: Classe base para todos os transportes. Contém métodos que todos os transportes asyncio partilham.
sv: Basklass för alla transporter. Innehåller metoder som alla asynciotransporter delar.

source: A base transport for write-only connections.
es_es: Un transporte base para conexiones de sólo escritura.
pt_pt: Um transporte base para ligações apenas de escrita.
sv: En bastransport för skrivskyddade anslutningar.

source: Instances of the *WriteTransport* class are returned from the :meth:`loop.connect_write_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
es_es: Las instancias de la clase *WriteTransport* son devueltas por el método de bucle de eventos :meth:`loop.connect_write_pipe` y también son utilizadas por métodos relacionados con subprocesos como :meth:`loop.subprocess_exec`.
pt_pt: Instâncias da classe *WriteTransport* são retornadas pelo método de ciclo de eventos :meth:`loop.connect_write_pipe` e também são usadas por métodos relacionados com subprocessos, como :meth:`loop.subprocess_exec`.
sv: Instanser av klassen *WriteTransport* returneras från händelseslingans metod :meth:`loop.connect_write_pipe` och används även av subprocessrelaterade metoder som :meth:`loop.subprocess_exec`.

source: A base transport for read-only connections.
es_es: Un transporte base para conexiones de sólo lectura.
pt_pt: Um transporte base para ligações apenas de leitura.
sv: En bastransport för skrivskyddade anslutningar.

source: Instances of the *ReadTransport* class are returned from the :meth:`loop.connect_read_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
es_es: Las instancias de la clase *ReadTransport* se devuelven por el método de bucle de eventos :meth:`loop.connect_read_pipe` y también se utilizan por métodos relacionados con subprocesos como :meth:`loop.subprocess_exec`.
pt_pt: Instâncias da classe *ReadTransport* são retornadas pelo método de ciclo de eventos :meth:`loop.connect_read_pipe` e também são usadas por métodos relacionados com subprocessos, como :meth:`loop.subprocess_exec`.
sv: Instanser av klassen *ReadTransport* returneras från händelseslingans metod :meth:`loop.connect_read_pipe` och används även av subprocessrelaterade metoder som :meth:`loop.subprocess_exec`.

source: Interface representing a bidirectional transport, such as a TCP connection.
es_es: Interfaz que representa un transporte bidireccional, como una conexión TCP.
pt_pt: Interface que representa um transporte bidirecional, como uma ligação TCP.
sv: Gränssnitt som representerar en dubbelriktad transport, t.ex. en TCP-anslutning.

source: The user does not instantiate a transport directly; they call a utility function, passing it a protocol factory and other information necessary to create the transport and protocol.
es_es: El usuario no instanciará un transporte directamente, sino que llamará a una función de utilidad, pasándole una fábrica de protocolos y otra información necesaria para crear el transporte y el protocolo.
pt_pt: O utilizador não instancia um transporte diretamente; chama uma função utilitária, passando-lhe uma fábrica de protocolos e outras informações necessárias para criar o transporte e o protocolo.
sv: Användaren instansierar inte en transport direkt, utan anropar en utility-funktion som får en protokollfabrik och annan information som krävs för att skapa transport och protokoll.

source: Instances of the *Transport* class are returned from or used by event loop methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.
es_es: Las instancias de la clase *Transport* son devueltas o utilizadas por métodos de bucle de eventos como :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.
pt_pt: Instâncias da classe *Transport* são retornadas ou usadas por métodos de ciclo de eventos como :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.
sv: Instanser av klassen *Transport* returneras från eller används av metoder i händelseslingor som :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.

source: A transport for datagram (UDP) connections.
es_es: Un transporte para conexiones de datagramas (UDP).
pt_pt: Um transporte para ligações de datagrama (UDP).
sv: En transport för datagram (UDP)-anslutningar.

source: Instances of the *DatagramTransport* class are returned from the :meth:`loop.create_datagram_endpoint` event loop method.
es_es: Las instancias de la clase *DatagramTransport* se devuelven desde el método de bucle de eventos :meth:`loop.create_datagram_endpoint`.
pt_pt: Instâncias da classe *DatagramTransport* são retornadas pelo método de ciclo de eventos :meth:`loop.create_datagram_endpoint`.
sv: Instanser av klassen *DatagramTransport* returneras från metoden :meth:`loop.create_datagram_endpoint` i händelseslingan.

source: An abstraction to represent a connection between a parent and its child OS process.
es_es: Una abstracción para representar una conexión entre un proceso OS padre y su proceso OS hijo.
pt_pt: Uma abstração para representar uma ligação entre um processo pai e o seu processo filho do sistema operativo.
sv: En abstraktion för att representera en koppling mellan en överordnad och en underordnad OS-process.

source: Instances of the *SubprocessTransport* class are returned from event loop methods :meth:`loop.subprocess_shell` and :meth:`loop.subprocess_exec`.
es_es: Las instancias de la clase *SubprocessTransport* se devuelven desde los métodos de bucle de eventos :meth:`loop.subprocess_shell` y :meth:`loop.subprocess_exec`.
pt_pt: Instâncias da classe *SubprocessTransport* são retornadas pelos métodos de ciclo de eventos :meth:`loop.subprocess_shell` e :meth:`loop.subprocess_exec`.
sv: Instanser av klassen *SubprocessTransport* returneras från eventloop-metoderna :meth:`loop.subprocess_shell` och :meth:`loop.subprocess_exec`.

source: Base Transport
es_es: Transporte base
pt_pt: Transporte Base
sv: Bas transport

source: Close the transport.
es_es: Cierra el transporte.
pt_pt: Fecha o transporte.
sv: Stäng transporten.

source: If the transport has a buffer for outgoing data, buffered data will be flushed asynchronously. No more data will be received. After all buffered data is flushed, the protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will be called with :const:`None` as its argument. The transport should not be used once it is closed.
es_es: Si el transporte tiene un búfer para los datos salientes, los datos almacenados en el búfer se vaciarán de forma asíncrona. No se recibirán más datos. Después de que todos los datos almacenados en el buffer se hayan vaciado, se llamará el método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` del protocolo con :const:`None` como argumento. El transporte no debe utilizarse una vez cerrado.
pt_pt: Se o transporte tiver um *buffer* para dados de saída, os dados em *buffer* serão descarregados de forma assíncrona. Não serão recebidos mais dados. Depois de todos os dados em *buffer* serem descarregados, o método :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` do protocolo será chamado com :const:`None` como argumento. O transporte não deve ser usado depois de fechado.
sv: Om transporten har en buffert för utgående data kommer buffrade data att tömmas asynkront. Inga fler data kommer att tas emot. När alla buffrade data har spolats kommer protokollets metod :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` att anropas med :const:`None` som argument. Transporten bör inte användas när den är stängd.

source: Return ``True`` if the transport is closing or is closed.
es_es: Devuelve ``True`` si el transporte se está cerrando o está cerrado.
pt_pt: Devolve ``True`` se o transporte estiver a fechar ou estiver fechado.
sv: Returnerar ``True`` om transporten håller på att stängas eller är stängd.

source: Return information about the transport or underlying resources it uses.
es_es: Devuelve información sobre el transporte o los recursos subyacentes que utiliza.
pt_pt: Devolve informações sobre o transporte ou os recursos subjacentes que utiliza.
sv: Returnera information om transporten eller underliggande resurser som den använder.

source: *name* is a string representing the piece of transport-specific information to get.
es_es: *name* es una cadena que representa la información específica del transporte que se desea obtener.
pt_pt: *name* é uma string que representa a peça de informação específica do transporte a obter.
sv: *name* är en sträng som representerar den transportspecifika information som ska hämtas.

source: *default* is the value to return if the information is not available, or if the transport does not support querying it with the given third-party event loop implementation or on the current platform.
es_es: *default* es el valor a devolver si la información no está disponible, o si el transporte no admite su consulta con la implementación de bucle de eventos de terceros dada o en la plataforma actual.
pt_pt: *default* é o valor a devolver se a informação não estiver disponível, ou se o transporte não suportar a sua consulta com a implementação dada de ciclo de eventos de terceiros ou na plataforma atual.
sv: *default* är det värde som ska returneras om informationen inte är tillgänglig, eller om transporten inte stöder att den efterfrågas med den givna implementeringen av händelseslingan från tredje part eller på den aktuella plattformen.

source: For example, the following code attempts to get the underlying socket object of the transport::
es_es: Por ejemplo, el siguiente código intenta obtener el objeto socket subyacente del transporte::
pt_pt: Por exemplo, o seguinte código tenta obter o objeto *socket* subjacente do transporte:
sv: Följande kod försöker till exempel hämta det underliggande socket-objektet för transporten::

source: Categories of information that can be queried on some transports:
es_es: Categorías de información que pueden consultarse en algunos transportes:
pt_pt: Categorias de informação que podem ser consultadas em alguns transportes:
sv: Kategorier av information som kan efterfrågas på vissa transporter:

source: ``'peername'``: the remote address to which the socket is connected, result of :meth:`socket.socket.getpeername` (``None`` on error)
es_es: ``'peername'``: la dirección remota a la que está conectado el socket, resultado de :meth:`socket.socket.getpeername` (``None`` en caso de error)
pt_pt: ``'peername'``: o endereço remoto ao qual o *socket* está ligado, resultado de :meth:`socket.socket.getpeername` (``None`` em caso de erro)
sv: ``'peername'``: den fjärradress som uttaget är anslutet till, resultat av :meth:`socket.socket.getpeername` (``None`` vid fel)

source: ``'socket'``: :class:`socket.socket` instance
es_es: ``'socket'``: :class:`socket.socket` instancia
pt_pt: ``'socket'``: instância :class:`socket.socket`
sv: ``'socket'``: :class:`socket.socket` instans

source: ``'sockname'``: the socket's own address, result of :meth:`socket.socket.getsockname`
es_es: ``'sockname'``: la propia dirección del socket, resultado de :meth:`socket.socket.getsockname`
pt_pt: ``'sockname'``: o endereço próprio do *socket*, resultado de :meth:`socket.socket.getsockname`
sv: ``'sockname'``: socketens egen adress, resultat av :meth:`socket.socket.getsockname`

source: SSL socket:
es_es: Socket SSL:
sv: SSL-uttag:

source: ``'compression'``: the compression algorithm being used as a string, or ``None`` if the connection isn't compressed; result of :meth:`ssl.SSLSocket.compression`
es_es: ``'compression'``: el algoritmo de compresión utilizado en forma de cadena, o ``None`` si la conexión no está comprimida; resultado de :meth:`ssl.SSLSocket.compression`
pt_pt: ``'compression'``: o algoritmo de compressão a ser usado como uma string, ou ``None`` se a ligação não estiver comprimida; resultado de :meth:`ssl.SSLSocket.compression`
sv: ``'compression'``: den komprimeringsalgoritm som används som en sträng, eller ``None`` om anslutningen inte komprimeras; resultat av :meth:`ssl.SSLSocket.compression`
