Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-sync.po
Languages: es_es, pt_pt, ru, sv

source: Synchronization Primitives
es_es: Primitivas de sincronización
pt_pt: Primitivas de sincronização
ru: Примитивы синхронизации
sv: Synkroniseringsprimitiver

source: **Source code:** :source:`Lib/asyncio/locks.py`
es_es: **Código fuente:** :source:`Lib/asyncio/locks.py`
pt_pt: **Código-fonte:** :source:`Lib/asyncio/locks.py`
ru: **Исходный код:** :source:`Lib/asyncio/locks.py`
sv: **Källkod:** :source:`Lib/asyncio/locks.py`

source: asyncio synchronization primitives are designed to be similar to those of the :mod:`threading` module with two important caveats:
es_es: Las primitivas de sincronización de asyncio están diseñadas para ser similares a las del módulo :mod:`threading`, con dos salvedades importantes:
pt_pt: As primitivas de sincronização do asyncio foram concebidas para serem semelhantes às do módulo :mod:`threading`, com duas ressalvas importantes:
ru: Примитивы синхронизации asyncio аналогичны примитивам модуля :mod:`threading` с двумя важными оговорками:
sv: asyncios synkroniseringsprimitiver är utformade för att likna dem i modulen :mod:`threading` med två viktiga förbehåll:

source: asyncio primitives are not thread-safe, therefore they should not be used for OS thread synchronization (use :mod:`threading` for that);
es_es: Las primitivas de asyncio no son seguras para los hilos, por lo que no deben utilizarse para la sincronización de hilos del sistema operativo (para ello, utilice :mod:`threading` );
pt_pt: as primitivas do asyncio não são *thread-safe*, pelo que não devem ser usadas para sincronização de *threads* do sistema operativo (utilize :mod:`threading` para isso);
ru: Примитивы asyncio не являются потокобезопасными, поэтому их не следует использовать для синхронизации потоков ОС (для этого используйте :mod:`threading`);
sv: asyncioprimitiver är inte trådsäkra, därför bör de inte användas för synkronisering av OS-trådar (använd :mod:`threading` för det);

source: methods of these synchronization primitives do not accept the *timeout* argument; use the :func:`asyncio.wait_for` function to perform operations with timeouts.
es_es: de estas primitivas de sincronización no aceptan el argumento *timeout*; utilice la función :func:`asyncio.wait_for` para realizar operaciones con tiempos de espera.
pt_pt: os métodos destas primitivas de sincronização não aceitam o argumento *timeout*; utilize a função :func:`asyncio.wait_for` para realizar operações com *timeouts*.
ru: методы этих примитивов синхронизации не принимают аргумент *timeout*; используйте функцию :func:`asyncio.wait_for` для выполнения операций с таймаутами.
sv: metoderna för dessa synkroniseringsprimitiver accepterar inte argumentet *timeout*; använd funktionen :func:`asyncio.wait_for` för att utföra operationer med timeouts.

source: asyncio has the following basic synchronization primitives:
es_es: asyncio tiene las siguientes primitivas básicas de sincronización:
pt_pt: O asyncio possui as seguintes primitivas básicas de sincronização:
ru: asyncio имеет следующие базовые примитивы синхронизации:
sv: asyncio har följande grundläggande synkroniseringsprimitiver:

source: Lock
es_es: Bloqueo
pt_pt: Bloqueio
ru: Блокировка
sv: Lås

source: Implements a mutex lock for asyncio tasks. Not thread-safe.
es_es: Implementa un bloqueo mutex para tareas asyncio. No es seguro para hilos.
pt_pt: Implementa um bloqueio mútuo (*mutex*) para tarefas asyncio. Não é *thread-safe*.
ru: Реализует блокировку мьютекса для асинхронных задач. Не потокобезопасный.
sv: Implementerar ett mutex-lås för asyncio-uppgifter. Inte tråd-säker.

source: An asyncio lock can be used to guarantee exclusive access to a shared resource.
es_es: Un bloqueo asyncio puede utilizarse para garantizar el acceso exclusivo a un recurso compartido.
pt_pt: Um bloqueio asyncio pode ser usado para garantir acesso exclusivo a um recurso partilhado.
ru: Блокировку asyncio можно использовать, чтобы гарантировать монопольный доступ к общему ресурсу.
sv: Ett asynciolås kan användas för att garantera exklusiv tillgång till en delad resurs.

source: The preferred way to use a Lock is an :keyword:`async with` statement::
es_es: La forma preferida de utilizar un Bloqueo es una sentencia :keyword:`async with`::
pt_pt: A forma preferencial de usar um bloqueio é com a instrução :keyword:`async with`::
ru: Предпочтительным способом использования блокировки является оператор :keyword:`async with`::
sv: Det föredragna sättet att använda ett Lock är en :nyckelord:`async with`-sats::

source: lock = asyncio.Lock() # ... later async with lock: # access shared state
pt_pt: lock = asyncio.Lock() # ... mais tarde async with lock: # aceder ao estado partilhado

source: which is equivalent to::
es_es: que equivale a::
pt_pt: que é equivalente a::
ru: что эквивалентно::
sv: vilket är likvärdigt med::

source: lock = asyncio.Lock() # ... later await lock.acquire() try: # access shared state finally: lock.release()
pt_pt: lock = asyncio.Lock() # ... mais tarde await lock.acquire() try: # aceder ao estado partilhado finally: lock.release()

source: Removed the *loop* parameter.
es_es: Eliminado el parámetro *loop*.
pt_pt: Removido o parâmetro *loop*.
ru: Удален параметр *loop*.
sv: Parametern *loop* har tagits bort.

source: Acquire the lock.
es_es: Activado el bloqueo
pt_pt: Adquire o bloqueio.
ru: Приобретите замок.
sv: Förvärva låset.

source: This method waits until the lock is *unlocked*, sets it to *locked* and returns ``True``.
es_es: Este método espera hasta que el bloqueo esté *desbloqueado*, lo pone en *bloqueado* y devuelve ``True``.
pt_pt: Este método aguarda até que o bloqueio esteja *desbloqueado*, define-o como *bloqueado* e devolve ``True``.
ru: Этот метод ждет, пока блокировка не будет *разблокирована*, устанавливает ее в значение *locked* и возвращает ``True``.
sv: Den här metoden väntar tills låset är *unlocked*, sätter det till *locked* och returnerar ``True``.

source: When more than one coroutine is blocked in :meth:`acquire` waiting for the lock to be unlocked, only one coroutine eventually proceeds.
es_es: Cuando más de una corrutina está bloqueada en :meth:`acquire` esperando a que se desbloquee el bloqueo, sólo una corrutina procede finalmente.
pt_pt: Quando mais do que uma corrotina está bloqueada em :meth:`acquire` à espera que o bloqueio seja desbloqueado, apenas uma corrotina prossegue.
ru: Когда более одной сопрограммы блокируется в :meth:`acquire` в ожидании разблокировки блокировки, в конечном итоге работает только одна сопрограмма.
sv: När mer än en coroutine blockeras i :meth:`acquire` i väntan på att låset ska låsas upp, fortsätter bara en coroutine till slut.

source: Acquiring a lock is *fair*: the coroutine that proceeds will be the first coroutine that started waiting on the lock.
es_es: Activar un bloqueo es *fair*: la corrutina que procede será la primera corrutina que empezó esperando en el bloqueo.
pt_pt: A aquisição de um bloqueio é *justa*: a corrotina que prossegue será a primeira que começou a esperar pelo bloqueio.
ru: Получение блокировки является *справедливым*: выполняемая сопрограмма будет первой сопрограммой, которая начала ожидать блокировки.
sv: Att förvärva ett lås är *rättvist*: den coroutine som fortsätter kommer att vara den första coroutine som började vänta på låset.

source: Release the lock.
es_es: Libera el cierre.
pt_pt: Liberta o bloqueio.
ru: Отпустите замок.
sv: Lossa låset.

source: When the lock is *locked*, reset it to *unlocked* and return.
es_es: Cuando el seguro esté *locked*, restablécelo a *unlocked* y vuelve.
pt_pt: Quando o bloqueio está *bloqueado*, redefine-o para *desbloqueado* e devolve.
ru: Когда замок *заблокирован*, сбросьте его на *разблокирован* и вернитесь.
sv: När låset är *locked*, återställ det till *unlocked* och returnera.

source: If the lock is *unlocked*, a :exc:`RuntimeError` is raised.
es_es: Si la cerradura está *desbloqueada*, aparece :exc:`RuntimeError`.
pt_pt: Se o bloqueio estiver *desbloqueado*, é levantada uma exceção :exc:`RuntimeError`.
ru: Если блокировка *разблокирована*, выдается ошибка :exc:`RuntimeError`.
sv: Om låset är *olåst* uppstår ett :exc:`RuntimeError`.

source: Return ``True`` if the lock is *locked*.
es_es: Devuelve ``True`` si el seguro está *bloqueado*.
pt_pt: Devolve ``True`` se o bloqueio estiver *bloqueado*.
ru: Верните ``True``, если замок *заблокирован*.
sv: Returnerar ``True`` om låset är *locked*.

source: Event
es_es: Evento
pt_pt: Evento
ru: Событие

source: An event object. Not thread-safe.
es_es: Un objeto de evento. No es seguro para hilos.
pt_pt: Um objeto de evento. Não é *thread-safe*.
ru: Объект события. Не потокобезопасный.
sv: Ett händelseobjekt. Inte tråd-säkert.

source: An asyncio event can be used to notify multiple asyncio tasks that some event has happened.
es_es: Un evento asyncio se puede utilizar para notificar a múltiples tareas asyncio que ha ocurrido algún evento.
pt_pt: Um evento asyncio pode ser usado para notificar várias tarefas asyncio de que algum evento ocorreu.
ru: Событие asyncio можно использовать для уведомления нескольких задач asyncio о том, что произошло какое-то событие.
sv: En asynciohändelse kan användas för att meddela flera asynciouppgifter att en händelse har inträffat.

source: An Event object manages an internal flag that can be set to *true* with the :meth:`~Event.set` method and reset to *false* with the :meth:`clear` method. The :meth:`~Event.wait` method blocks until the flag is set to *true*. The flag is set to *false* initially.
es_es: Un objeto Event gestiona un indicador interno que se puede establecer en *true* con el método :meth:`~Event.set` y restablecer en *false* con el método :meth:`clear`. El método :meth:`~Event.wait` se bloquea hasta que el indicador se establece en *true*. El indicador se establece inicialmente en *false*.
pt_pt: Um objeto Evento gere uma *flag* interna que pode ser definida como *verdadeira* com o método :meth:`~Event.set` e redefinida como *falsa* com o método :meth:`clear`. O método :meth:`~Event.wait` bloqueia até que a *flag* seja definida como *verdadeira*. A *flag* é definida como *falsa* inicialmente.
ru: Объект Event управляет внутренним флагом, которому можно установить значение *true* с помощью метода :meth:`~Event.set` и сбросить значение *false* с помощью метода :meth:`clear`. Метод :meth:`~Event.wait` блокируется до тех пор, пока флаг не будет установлен в значение *true*. Изначально флаг установлен в значение *false*.
sv: Ett Event-objekt hanterar en intern flagga som kan sättas till *true* med metoden :meth:`~Event.set` och återställas till *false* med metoden :meth:`clear`. Metoden :meth:`~Event.wait` blockerar tills flaggan är satt till *true*. Flaggan är initialt satt till *false*.

source: Example::
es_es: Ejemplo::
pt_pt: Exemplo::
ru: Пример::
sv: Exempel::

source: async def waiter(event): print('waiting for it ...') await event.wait() print('... got it!') async def main(): # Create an Event object. event = asyncio.Event() # Spawn a Task to wait until 'event' is set. waiter_task = asyncio.create_task(waiter(event)) # Sleep for 1 second and set the event. await asyncio.sleep(1) event.set() # Wait until the waiter task is finished. await waiter_task asyncio.run(main())
pt_pt: async def waiter(event): print('à espera ...') await event.wait() print('... obtido!') async def main(): # Criar um objeto Evento. event = asyncio.Event() # Criar uma tarefa para esperar até que 'event' seja definido. waiter_task = asyncio.create_task(waiter(event)) # Dormir 1 segundo e definir o evento. await asyncio.sleep(1) event.set() # Esperar até que a tarefa de espera termine. await waiter_task asyncio.run(main())

source: Wait until the event is set.
es_es: Espere hasta que se active el evento.
pt_pt: Aguarda até que o evento seja definido.
ru: Подождите, пока событие не будет установлено.
sv: Vänta tills händelsen är inställd.

source: If the event is set, return ``True`` immediately. Otherwise block until another task calls :meth:`~Event.set`.
es_es: Si se activa el evento, devuelve ``True`` inmediatamente. En caso contrario, bloquea hasta que otra tarea llame a :meth:`~Event.set`.
pt_pt: Se o evento estiver definido, devolve ``True`` imediatamente. Caso contrário, bloqueia até que outra tarefa chame :meth:`~Event.set`.
ru: Если событие установлено, немедленно верните ``True``. В противном случае заблокируйте, пока другая задача не вызовет :meth:`~Event.set`.
sv: Om händelsen är inställd, returnera ``True`` omedelbart. Annars blockeras tills en annan uppgift anropar :meth:`~Event.set`.

source: Set the event.
es_es: Fija el evento.
pt_pt: Define o evento.
ru: Установите событие.
sv: Ställ in händelsen.

source: All tasks waiting for event to be set will be immediately awakened.
es_es: Todas las tareas que estén esperando a que se active el evento despertarán inmediatamente.
pt_pt: Todas as tarefas à espera de que o evento seja definido serão imediatamente despertadas.
ru: Все задачи, ожидающие установки события, будут немедленно активированы.
sv: Alla uppgifter som väntar på att händelsen ska aktiveras kommer omedelbart att väckas.

source: Clear (unset) the event.
es_es: Borra (anula) el evento.
pt_pt: Limpa (redefine) o evento.
ru: Очистить (сбросить) событие.
sv: Rensa (avmarkera) händelsen.

source: Subsequent tasks awaiting on :meth:`~Event.wait` will now block until the :meth:`~Event.set` method is called again.
pt_pt: As tarefas subsequentes à espera em :meth:`~Event.wait` bloquearão agora até que o método :meth:`~Event.set` seja chamado novamente.

source: Return ``True`` if the event is set.
es_es: Devuelve ``True`` si el evento está activado.
pt_pt: Devolve ``True`` se o evento estiver definido.
ru: Верните ``True``, если событие установлено.
sv: Returnerar ``True`` om händelsen är inställd.

source: Condition
es_es: Condición
pt_pt: Condição
ru: Состояние
sv: Villkor

source: A Condition object. Not thread-safe.
es_es: Un objeto Condición. No es seguro para hilos.
pt_pt: Um objeto Condição. Não é *thread-safe*.
ru: Объект условия. Не потокобезопасный.
sv: Ett Condition-objekt. Inte tråd-säkert.

source: An asyncio condition primitive can be used by a task to wait for some event to happen and then get exclusive access to a shared resource.
es_es: Una primitiva de condición asyncio se puede utilizar por una tarea para esperar a que ocurra algún evento y luego obtener acceso exclusivo a un recurso compartido.
pt_pt: Uma primitiva de condição asyncio pode ser usada por uma tarefa para esperar que algum evento ocorra e, em seguida, obter acesso exclusivo a um recurso partilhado.
ru: Примитив условия asyncio может использоваться задачей для ожидания наступления какого-либо события и последующего получения монопольного доступа к общему ресурсу.
sv: En asyncio-villkorsprimitiv kan användas av en uppgift för att vänta på att en händelse ska inträffa och sedan få exklusiv tillgång till en delad resurs.

source: In essence, a Condition object combines the functionality of an :class:`Event` and a :class:`Lock`. It is possible to have multiple Condition objects share one Lock, which allows coordinating exclusive access to a shared resource between different tasks interested in particular states of that shared resource.
es_es: En esencia, un objeto Condition combina la funcionalidad de un :class:`Event` y un :class:`Lock`. Es posible tener múltiples objetos Condition compartiendo un Lock, lo que permite coordinar el acceso exclusivo a un recurso compartido entre diferentes tareas interesadas en estados particulares de ese recurso compartido.
pt_pt: Em essência, um objeto Condição combina a funcionalidade de um :class:`Event` e um :class:`Lock`. É possível ter vários objetos Condição a partilhar um Bloqueio, o que permite coordenar o acesso exclusivo a um recurso partilhado entre diferentes tarefas interessadas em estados particulares desse recurso.
ru: По сути, объект Condition сочетает в себе функциональность :class:`Event` и :class:`Lock`. Возможно, что несколько объектов Condition совместно используют один Lock, что позволяет координировать монопольный доступ к общему ресурсу между различными задачами, заинтересованными в определенных состояниях этого общего ресурса.
sv: I huvudsak kombinerar ett Condition-objekt funktionaliteten hos en :class:`Event` och en :class:`Lock`. Det är möjligt att låta flera Condition-objekt dela ett Lock, vilket gör det möjligt att samordna exklusiv tillgång till en delad resurs mellan olika uppgifter som är intresserade av särskilda tillstånd för den delade resursen.

source: The optional *lock* argument must be a :class:`Lock` object or ``None``. In the latter case a new Lock object is created automatically.
es_es: El argumento opcional *lock* debe ser un objeto :class:`Lock` o ``None``. En este último caso, se crea automáticamente un nuevo objeto Lock.
pt_pt: O argumento opcional *lock* deve ser um objeto :class:`Lock` ou ``None``. Neste último caso, um novo objeto Bloqueio é criado automaticamente.
ru: Необязательный аргумент *lock* должен быть объектом :class:`Lock` или ``None``. В последнем случае новый объект Lock создается автоматически.
sv: Det valfria *lock*-argumentet måste vara ett :class:`Lock`-objekt eller ``None``. I det senare fallet skapas ett nytt Lock-objekt automatiskt.

source: The preferred way to use a Condition is an :keyword:`async with` statement::
es_es: La forma preferida de utilizar una condición es una declaración :keyword:`async with`::
pt_pt: A forma preferencial de usar uma Condição é com a instrução :keyword:`async with`::
ru: Предпочтительным способом использования Условия является оператор :keyword:`async with`::
sv: Det föredragna sättet att använda ett villkor är en :nyckelord:`async with`-sats::

source: cond = asyncio.Condition() # ... later async with cond: await cond.wait()
pt_pt: cond = asyncio.Condition() # ... mais tarde async with cond: await cond.wait()

source: cond = asyncio.Condition() # ... later await cond.acquire() try: await cond.wait() finally: cond.release()
pt_pt: cond = asyncio.Condition() # ... mais tarde await cond.acquire() try: await cond.wait() finally: cond.release()

source: Acquire the underlying lock.
es_es: Adquiere el bloqueo subyacente.
pt_pt: Adquire o bloqueio subjacente.
ru: Получите базовый замок.
sv: Förvärva det underliggande låset.

source: This method waits until the underlying lock is *unlocked*, sets it to *locked* and returns ``True``.
es_es: Este método espera hasta que el bloqueo subyacente esté *unlocked*, lo establece en *locked* y devuelve ``True``.
pt_pt: Este método aguarda até que o bloqueio subjacente esteja *desbloqueado*, define-o como *bloqueado* e devolve ``True``.
ru: Этот метод ждет, пока базовая блокировка не будет *разблокирована*, устанавливает ее в значение *locked* и возвращает ``True``.
sv: Denna metod väntar tills det underliggande låset är *unlocked*, sätter det till *locked* och returnerar ``True``.

source: Wake up *n* tasks (1 by default) waiting on this condition. If fewer than *n* tasks are waiting they are all awakened.
pt_pt: Desperta *n* tarefas (1 por predefinição) à espera nesta condição. Se menos de *n* tarefas estiverem à espera, todas são despertadas.
sv: Väck *n* uppgifter (1 som standard) som väntar på detta villkor. Om färre än *n* uppgifter väntar väcks de alla.

source: The lock must be acquired before this method is called and released shortly after. If called with an *unlocked* lock a :exc:`RuntimeError` error is raised.
es_es: El bloqueo debe adquirirse antes de llamar a este método y liberarse poco después. Si se llama con un bloqueo *desbloqueado*, se produce un error :exc:`RuntimeError`.
pt_pt: O bloqueio deve ser adquirido antes de este método ser chamado e libertado pouco depois. Se for chamado com um bloqueio *desbloqueado*, é levantada uma exceção :exc:`RuntimeError`.
ru: Блокировка должна быть получена до вызова этого метода и вскоре после этого снята. При вызове с *разблокированной* блокировкой возникает ошибка :exc:`RuntimeError`.
sv: Låset måste förvärvas innan denna metod anropas och släppas kort därefter. Om metoden anropas med ett *olåst* lås kommer ett :exc:`RuntimeError`-fel att uppstå.

source: Return ``True`` if the underlying lock is acquired.
es_es: Devuelve ``True`` si se adquiere el bloqueo subyacente.
pt_pt: Devolve ``True`` se o bloqueio subjacente estiver adquirido.
ru: Верните True, если базовая блокировка получена.
sv: Returnerar ``True`` om det underliggande låset är förvärvat.

source: Wake up all tasks waiting on this condition.
es_es: Despierta todas las tareas que esperan esta condición.
pt_pt: Desperta todas as tarefas à espera nesta condição.
ru: Разбудите все задачи, ожидающие этого условия.
sv: Väck alla uppgifter som väntar på detta villkor.

source: This method acts like :meth:`notify`, but wakes up all waiting tasks.
es_es: Este método actúa como :meth:`notify`, pero despierta todas las tareas en espera.
pt_pt: Este método age como :meth:`notify`, mas desperta todas as tarefas à espera.
ru: Этот метод действует как :meth:`notify`, но пробуждает все ожидающие задачи.
sv: Den här metoden fungerar som :meth:`notify`, men väcker alla väntande uppgifter.

source: Release the underlying lock.
es_es: Libera el bloqueo subyacente.
pt_pt: Liberta o bloqueio subjacente.
ru: Снимите основной замок.
sv: Lossa det underliggande låset.

source: When invoked on an unlocked lock, a :exc:`RuntimeError` is raised.
es_es: Cuando se invoca en una cerradura desbloqueada, se genera un :exc:`RuntimeError`.
pt_pt: Quando invocado num bloqueio desbloqueado, é levantada uma exceção :exc:`RuntimeError`.
ru: При вызове разблокированной блокировки возникает ошибка :exc:`RuntimeError`.
sv: När den anropas på ett olåst lås uppstår ett :exc:`RuntimeError`.

source: Wait until notified.
es_es: Espere hasta que se le notifique.
pt_pt: Aguarda até ser notificado.
ru: Подождите, пока вас не уведомят.
sv: Vänta tills du får besked.

source: If the calling task has not acquired the lock when this method is called, a :exc:`RuntimeError` is raised.
es_es: Si la tarea que llama no ha adquirido el bloqueo cuando se llama a este método, se lanza un :exc:`RuntimeError`.
pt_pt: Se a tarefa chamadora não tiver adquirido o bloqueio quando este método é chamado, é levantada uma exceção :exc:`RuntimeError`.
ru: Если вызывающая задача не получила блокировку при вызове этого метода, возникает ошибка :exc:`RuntimeError`.
sv: Om den anropande uppgiften inte har förvärvat låset när denna metod anropas, uppstår ett :exc:`RuntimeError`.

source: This method releases the underlying lock, and then blocks until it is awakened by a :meth:`notify` or :meth:`notify_all` call. Once awakened, the Condition re-acquires its lock and this method returns ``True``.
es_es: Este método libera el bloqueo subyacente y se bloquea hasta que se activa mediante una llamada a :meth:`notify` o :meth:`notify_all`. Una vez despertado, la Condición vuelve a adquirir su bloqueo y este método devuelve ``True``.
pt_pt: Este método liberta o bloqueio subjacente e, em seguida, bloqueia até ser despertado por uma chamada a :meth:`notify` ou :meth:`notify_all`. Assim que despertado, a Condição readquire o seu bloqueio e este método devolve ``True``.
ru: Этот метод снимает базовую блокировку, а затем блокируется до тех пор, пока она не будет разбужена вызовом :meth:`notify` или :meth:`notify_all`. После пробуждения Condition повторно получает блокировку, и этот метод возвращает True.
sv: Den här metoden frigör det underliggande låset och blockerar sedan tills den väcks av ett anrop från :meth:`notify` eller :meth:`notify_all`. När den har väckts återtar Condition sitt lås och denna metod returnerar ``True``.
