Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: es_es, pt_pt

source: The default value is ``True`` if the environment variable :envvar:`PYTHONASYNCIODEBUG` is set to a non-empty string, ``False`` otherwise.
es_es: El valor por defecto es ``True`` si la variable de entorno :envvar:`PYTHONASYNCIODEBUG` está definida como una cadena no vacía, ``False`` en caso contrario.
pt_pt: O valor predefinido é ``True`` se a variável de ambiente :envvar:`PYTHONASYNCIODEBUG` estiver definida para uma string não vazia, ``False`` caso contrário.

source: Set the debug mode of the event loop.
es_es: Establece el modo de depuración del bucle de eventos.
pt_pt: Define o modo de depuração do ciclo de eventos.

source: The new :ref:`Python Development Mode <devmode>` can now also be used to enable the debug mode.
es_es: El nuevo :ref:`Python Development Mode <devmode>` ahora también se puede utilizar para activar el modo de depuración.
pt_pt: O novo :ref:`Modo de Desenvolvimento do Python <devmode>` também pode ser utilizado para ativar o modo de depuração.

source: This attribute can be used to set the minimum execution duration in seconds that is considered "slow". When debug mode is enabled, "slow" callbacks are logged.
es_es: Этот атрибут можно использовать для установки минимальной продолжительности выполнения в секундах, которая считается «медленной». Когда режим отладки включен, регистрируются «медленные» обратные вызовы.
pt_pt: Este atributo pode ser utilizado para definir a duração mínima de execução em segundos que é considerada "lenta". Quando o modo de depuração está ativado, as chamadas de retorno "lentas" são registadas.

source: Default value is 100 milliseconds.
es_es: Значение по умолчанию — 100 миллисекунд.
pt_pt: O valor predefinido é 100 milissegundos.

source: The :ref:`debug mode of asyncio <asyncio-debug-mode>`.
es_es: El :ref:`debug mode of asyncio <asyncio-debug-mode>`.
pt_pt: O :ref:`modo de depuração do asyncio <asyncio-debug-mode>`.

source: Running Subprocesses
es_es: Ejecutando subprocesos
pt_pt: Execução de Subprocessos

source: Methods described in this subsections are low-level. In regular async/await code consider using the high-level :func:`asyncio.create_subprocess_shell` and :func:`asyncio.create_subprocess_exec` convenience functions instead.
es_es: Los métodos descritos en esta subsección son de bajo nivel. En el código async/await normal, considere usar las funciones de alto nivel :func:`asyncio.create_subprocess_shell` y :func:`asyncio.create_subprocess_exec` en su lugar.
pt_pt: Os métodos descritos nestas subsecções são de baixo nível. Em código async/await regular, considere utilizar as funções de conveniência de alto nível :func:`asyncio.create_subprocess_shell` e :func:`asyncio.create_subprocess_exec` em vez disso.

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
es_es: En Windows, el bucle de eventos por defecto :class:`ProactorEventLoop` soporta subprocesos, mientras que :class:`SelectorEventLoop` no. Ver para más detalles :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>`.
pt_pt: No Windows, o ciclo de eventos predefinido :class:`ProactorEventLoop` suporta subprocessos, enquanto :class:`SelectorEventLoop` não suporta. Consulte :ref:`Suporte a Subprocessos no Windows <asyncio-windows-subprocess>` para mais detalhes.

source: Create a subprocess from one or more string arguments specified by *args*.
es_es: Crea un subproceso a partir de uno o más argumentos de cadena especificados por *args*.
pt_pt: Cria um subprocesso a partir de um ou mais argumentos de string especificados por *args*.

source: *args* must be a list of strings represented by:
es_es: *args* debe ser una lista de cadenas representadas por:
pt_pt: *args* deve ser uma lista de strings representada por:

source: or :class:`bytes`, encoded to the :ref:`filesystem encoding <filesystem-encoding>`.
es_es: o :class:`bytes`, codificado según la codificación :ref:`filesystem <filesystem-encoding>`.
pt_pt: ou :class:`bytes`, codificado para a :ref:`codificação do sistema de ficheiros <filesystem-encoding>`.

source: The first string specifies the program executable, and the remaining strings specify the arguments. Together, string arguments form the ``argv`` of the program.
es_es: La primera cadena especifica el ejecutable del programa, y las cadenas restantes especifican los argumentos. Juntas, las cadenas de argumentos forman el ``argv`` del programa.
pt_pt: A primeira string especifica o executável do programa, e as strings restantes especificam os argumentos. Em conjunto, os argumentos de string formam o ``argv`` do programa.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=False`` and the list of strings passed as the first argument; however, where :class:`~subprocess.Popen` takes a single argument which is list of strings, *subprocess_exec* takes multiple string arguments.
es_es: Esto es similar a la clase :class:`subprocess.Popen` de la biblioteca estándar llamada con ``shell=False`` y la lista de cadenas pasada como primer argumento; sin embargo, donde :class:`~subprocess.Popen` toma un único argumento que es una lista de cadenas, *subprocess_exec* toma múltiples argumentos de cadena.
pt_pt: Isto é semelhante à classe :class:`subprocess.Popen` da biblioteca padrão chamada com ``shell=False`` e a lista de strings passada como primeiro argumento; no entanto, enquanto :class:`~subprocess.Popen` recebe um único argumento que é uma lista de strings, *subprocess_exec* recebe vários argumentos de string.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`asyncio.SubprocessProtocol` class.
es_es: El *protocol_factory* debe ser un callable que devuelva una subclase de la clase :class:`asyncio.SubprocessProtocol`.
pt_pt: *protocol_factory* deve ser um objeto invocável que devolva uma subclasse da classe :class:`asyncio.SubprocessProtocol`.

source: Other parameters:
es_es: Otros parámetros:
pt_pt: Outros parâmetros:

source: *stdin* can be any of these:
es_es: *stdin* puede ser cualquiera de estos:
pt_pt: *stdin* pode ser qualquer um dos seguintes:

source: a file-like object
es_es: файлоподобный объект
pt_pt: um objeto tipo ficheiro

source: an existing file descriptor (a positive integer), for example those created with :meth:`os.pipe`
es_es: существующий файловый дескриптор (положительное целое число), например созданный с помощью :meth:`os.pipe`
pt_pt: um descritor de ficheiro existente (um inteiro positivo), por exemplo, aqueles criados com :meth:`os.pipe`

source: the :const:`subprocess.PIPE` constant (default) which will create a new pipe and connect it,
es_es: la constante :const:`subprocess.PIPE` (por defecto) que creará una nueva tubería y la conectará,
pt_pt: a constante :const:`subprocess.PIPE` (predefinição), que criará uma nova pipe e ligá-la-á,

source: the value ``None`` which will make the subprocess inherit the file descriptor from this process
es_es: el valor ``None`` que hará que el subproceso herede el descriptor de fichero de este proceso
pt_pt: o valor ``None``, que fará com que o subprocesso herde o descritor de ficheiro deste processo

source: the :const:`subprocess.DEVNULL` constant which indicates that the special :data:`os.devnull` file will be used
es_es: la constante :const:`subprocess.DEVNULL` que indica que se utilizará el archivo especial :data:`os.devnull`
pt_pt: a constante :const:`subprocess.DEVNULL`, que indica que o ficheiro especial :data:`os.devnull` será utilizado

source: *stdout* can be any of these:
es_es: *stdout* puede ser cualquiera de estos:
pt_pt: *stdout* pode ser qualquer um dos seguintes:

source: *stderr* can be any of these:
es_es: *stderr* puede ser cualquiera de estos:
pt_pt: *stderr* pode ser qualquer um dos seguintes:

source: the :const:`subprocess.STDOUT` constant which will connect the standard error stream to the process' standard output stream
es_es: la constante :const:`subprocess.STDOUT` que conectará el flujo de error estándar con el flujo de salida estándar del proceso
pt_pt: a constante :const:`subprocess.STDOUT`, que ligará o fluxo de erro padrão ao fluxo de saída padrão do processo

source: All other keyword arguments are passed to :class:`subprocess.Popen` without interpretation, except for *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* and *errors*, which should not be specified at all.
es_es: Todos los demás argumentos de palabra clave se pasan a :class:`subprocess.Popen` sin interpretación, excepto *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* y *errors*, que no deben especificarse en absoluto.
pt_pt: Todos os outros argumentos de palavra-chave são passados para :class:`subprocess.Popen` sem interpretação, exceto *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* e *errors*, que não devem ser especificados.

source: The ``asyncio`` subprocess API does not support decoding the streams as text. :func:`bytes.decode` can be used to convert the bytes returned from the stream to text.
es_es: La API del subproceso ``asyncio`` no permite descodificar los flujos como texto. :func:`bytes.decode` puede utilizarse para convertir los bytes devueltos por el flujo en texto.
pt_pt: A API de subprocessos ``asyncio`` não suporta a descodificação dos fluxos como texto. :func:`bytes.decode` pode ser utilizado para converter os bytes devolvidos pelo fluxo em texto.

source: If a file-like object passed as *stdin*, *stdout* or *stderr* represents a pipe, then the other side of this pipe should be registered with :meth:`~loop.connect_write_pipe` or :meth:`~loop.connect_read_pipe` for use with the event loop.
es_es: Если файлоподобный объект, передаваемый как *stdin*, *stdout* или *stderr*, представляет канал, то другая сторона этого канала должна быть зарегистрирована с помощью :meth:`~loop.connect_write_pipe` или :meth:`~loop. .connect_read_pipe` для использования с циклом событий.
pt_pt: Se um objeto tipo ficheiro passado como *stdin*, *stdout* ou *stderr* representar uma pipe, então a outra extremidade desta pipe deve ser registada com :meth:`~loop.connect_write_pipe` ou :meth:`~loop.connect_read_pipe` para uso com o ciclo de eventos.

source: See the constructor of the :class:`subprocess.Popen` class for documentation on other arguments.
es_es: Consulte el constructor de la clase :class:`subprocess.Popen` para obtener documentación sobre otros argumentos.
pt_pt: Consulte o construtor da classe :class:`subprocess.Popen` para documentação sobre outros argumentos.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`asyncio.SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
es_es: Devuelve un par de ``(transport, protocol)``, donde *transport* se ajusta a la clase base :class:`asyncio.SubprocessTransport` y *protocol* es un objeto instanciado por *protocol_factory*.
pt_pt: Devolve um par ``(transport, protocol)``, onde *transporte* está em conformidade com a classe base :class:`asyncio.SubprocessTransport` e *protocolo* é um objeto instanciado por *protocol_factory*.

source: Create a subprocess from *cmd*, which can be a :class:`str` or a :class:`bytes` string encoded to the :ref:`filesystem encoding <filesystem-encoding>`, using the platform's "shell" syntax.
es_es: Crea un subproceso a partir de *cmd*, que puede ser un :class:`str` o una cadena :class:`bytes` codificada según la codificación :ref:`filesystem <filesystem-encoding>`, utilizando la sintaxis "shell" de la plataforma.
pt_pt: Cria um subprocesso a partir de *cmd*, que pode ser uma :class:`str` ou uma string :class:`bytes` codificada para a :ref:`codificação do sistema de ficheiros <filesystem-encoding>`, utilizando a sintaxe "shell" da plataforma.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=True``.
es_es: Esto es similar a la clase de la biblioteca estándar :class:`subprocess.Popen` llamada con ``shell=True``.
pt_pt: Isto é semelhante à classe :class:`subprocess.Popen` da biblioteca padrão chamada com ``shell=True``.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`SubprocessProtocol` class.
es_es: El *protocol_factory* debe ser un callable que devuelva una subclase de la clase :class:`SubprocessProtocol`.
pt_pt: *protocol_factory* deve ser um objeto invocável que devolva uma subclasse da classe :class:`SubprocessProtocol`.

source: See :meth:`~loop.subprocess_exec` for more details about the remaining arguments.
es_es: Consulte :meth:`~loop.subprocess_exec` para obtener más información sobre el resto de argumentos.
pt_pt: Consulte :meth:`~loop.subprocess_exec` para mais detalhes sobre os argumentos restantes.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
es_es: Devuelve un par de ``(transport, protocol)``, donde *transport* se ajusta a la clase base :class:`SubprocessTransport` y *protocol* es un objeto instanciado por *protocol_factory*.
pt_pt: Devolve um par ``(transport, protocol)``, onde *transporte* está em conformidade com a classe base :class:`SubprocessTransport` e *protocolo* é um objeto instanciado por *protocol_factory*.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special characters in strings that are going to be used to construct shell commands.
es_es: Es responsabilidad de la aplicación asegurarse de que todos los espacios en blanco y caracteres especiales se entrecomillan adecuadamente para evitar vulnerabilidades de `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. La función :func:`shlex.quote` se puede utilizar para escapar correctamente los espacios en blanco y caracteres especiales en las cadenas que se van a utilizar para construir comandos de shell.
pt_pt: É responsabilidade da aplicação garantir que todos os espaços em branco e caracteres especiais sejam devidamente protegidos para evitar vulnerabilidades de `injeção de shell <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. A função :func:`shlex.quote` pode ser utilizada para escapar corretamente espaços em branco e caracteres especiais em strings que serão utilizadas para construir comandos shell.

source: Callback Handles
es_es: Identificadores de Devolución de Llamada
pt_pt: Manipuladores de Chamadas de Retorno

source: A callback wrapper object returned by :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.
es_es: Un objeto de devolución de llamada devuelto por :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.
pt_pt: Um objeto encapsulador de chamada de retorno devolvido por :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.

source: Return the :class:`contextvars.Context` object associated with the handle.
es_es: Верните объект :class:`contextvars.Context`, связанный с дескриптором.
pt_pt: Devolve o objeto :class:`contextvars.Context` associado ao manipulador.

source: Cancel the callback. If the callback has already been canceled or executed, this method has no effect.
es_es: Cancela la llamada de retorno. Si la llamada de retorno ya se ha cancelado o ejecutado, este método no tiene ningún efecto.
pt_pt: Cancela a chamada de retorno. Se a chamada de retorno já tiver sido cancelada ou executada, este método não tem efeito.

source: Return ``True`` if the callback was cancelled.
es_es: Devuelve ``True`` si se canceló la llamada de retorno.
pt_pt: Devolve ``True`` se a chamada de retorno foi cancelada.

source: A callback wrapper object returned by :meth:`loop.call_later`, and :meth:`loop.call_at`.
es_es: Un objeto de devolución de llamada devuelto por :meth:`loop.call_later`, y :meth:`loop.call_at`.
pt_pt: Um objeto encapsulador de chamada de retorno devolvido por :meth:`loop.call_later` e :meth:`loop.call_at`.

source: This class is a subclass of :class:`Handle`.
es_es: Esta clase es una subclase de :class:`Handle`.
pt_pt: Esta classe é uma subclasse de :class:`Handle`.

source: Return a scheduled callback time as :class:`float` seconds.
es_es: Devuelve una hora de devolución de llamada programada como :class:`float` segundos.
pt_pt: Devolve o tempo agendado da chamada de retorno em segundos :class:`float`.

source: The time is an absolute timestamp, using the same time reference as :meth:`loop.time`.
es_es: La hora es una marca de tiempo absoluta, que utiliza la misma referencia de tiempo que :meth:`loop.time`.
pt_pt: O tempo é um carimbo de tempo absoluto, utilizando a mesma referência temporal que :meth:`loop.time`.

source: Server Objects
es_es: Objetos del servidor
pt_pt: Objetos de Servidor

source: Server objects are created by :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, and :func:`start_unix_server` functions.
es_es: Los objetos servidor se crean mediante las funciones :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, y :func:`start_unix_server`.
pt_pt: Os objetos de servidor são criados pelas funções :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server` e :func:`start_unix_server`.

source: Do not instantiate the :class:`Server` class directly.
es_es: Не создавайте экземпляр класса :class:`Server` напрямую.
pt_pt: Não instancie diretamente a classe :class:`Server`.

source: *Server* objects are asynchronous context managers. When used in an ``async with`` statement, it's guaranteed that the Server object is closed and not accepting new connections when the ``async with`` statement is completed::
es_es: Los objetos *Server* son gestores de contexto asíncronos. Cuando se utilizan en una sentencia ``async with``, se garantiza que el objeto Servidor está cerrado y no acepta nuevas conexiones cuando finaliza la sentencia ``async with``::
pt_pt: Os objetos *Server* são gestores de contexto assíncronos. Quando utilizados numa instrução ``async with``, é garantido que o objeto Server está fechado e não aceita novas ligações quando a instrução ``async with`` é concluída::

source: Server object is an asynchronous context manager since Python 3.7.
es_es: El objeto servidor es un gestor de contexto asíncrono desde Python 3.7.
pt_pt: O objeto Server é um gestor de contexto assíncrono desde o Python 3.7.

source: This class was exposed publicly as ``asyncio.Server`` in Python 3.9.11, 3.10.3 and 3.11.
es_es: Этот класс был публично представлен как asyncio.Server в Python 3.9.11, 3.10.3 и 3.11.
pt_pt: Esta classe foi exposta publicamente como ``asyncio.Server`` no Python 3.9.11, 3.10.3 e 3.11.

source: Stop serving: close listening sockets and set the :attr:`sockets` attribute to ``None``.
es_es: Dejar de servir: cerrar los sockets de escucha y establecer el atributo :attr:`sockets` en ``None``.
pt_pt: Para de servir: fecha os sockets à escuta e define o atributo :attr:`sockets` para ``None``.

source: The sockets that represent existing incoming client connections are left open.
es_es: Los sockets que representan conexiones entrantes de clientes existentes se dejan abiertos.
pt_pt: Os sockets que representam ligações de clientes existentes permanecem abertos.

source: The server is closed asynchronously; use the :meth:`wait_closed` coroutine to wait until the server is closed (and no more connections are active).
es_es: Сервер закрывается асинхронно; используйте сопрограмму :meth:`wait_closed`, чтобы дождаться закрытия сервера (и отсутствия активных соединений).
pt_pt: O servidor é fechado de forma assíncrona; utilize a corrotina :meth:`wait_closed` para aguardar até que o servidor esteja fechado (e não haja mais ligações ativas).

source: Close all existing incoming client connections.
es_es: Закройте все существующие входящие клиентские соединения.

source: Calls :meth:`~asyncio.BaseTransport.close` on all associated transports.
es_es: Вызывает :meth:`~asyncio.BaseTransport.close` для всех связанных транспортов.

source: :meth:`close` should be called before :meth:`close_clients` when closing the server to avoid races with new clients connecting.
es_es: :meth:`close` следует вызывать перед :meth:`close_clients` при закрытии сервера, чтобы избежать гонок при подключении новых клиентов.

source: Close all existing incoming client connections immediately, without waiting for pending operations to complete.
es_es: Немедленно закройте все существующие входящие клиентские подключения, не дожидаясь завершения ожидающих операций.

source: Calls :meth:`~asyncio.WriteTransport.abort` on all associated transports.
es_es: Вызывает :meth:`~asyncio.WriteTransport.abort` для всех связанных транспортов.

source: :meth:`close` should be called before :meth:`abort_clients` when closing the server to avoid races with new clients connecting.
es_es: :meth:`close` следует вызывать перед :meth:`abort_clients` при закрытии сервера, чтобы избежать гонок при подключении новых клиентов.

source: Return the event loop associated with the server object.
es_es: Devuelve el bucle de eventos asociado al objeto servidor.
pt_pt: Devolve o ciclo de eventos associado ao objeto servidor.

source: Start accepting connections.
es_es: Empieza a aceptar conexiones.
pt_pt: Começa a aceitar ligações.

source: This method is idempotent, so it can be called when the server is already serving.
es_es: Этот метод идемпотентен, поэтому его можно вызвать, когда сервер уже обслуживает.
pt_pt: Este método é idempotente, pelo que pode ser chamado quando o servidor já está a servir.

source: The *start_serving* keyword-only parameter to :meth:`loop.create_server` and :meth:`asyncio.start_server` allows creating a Server object that is not accepting connections initially. In this case ``Server.start_serving()``, or :meth:`Server.serve_forever` can be used to make the Server start accepting connections.
es_es: El parámetro *start_serving* de :meth:`loop.create_server` y :meth:`asyncio.start_server` permite crear un objeto Servidor que no acepte conexiones inicialmente. En este caso ``Server.start_serving()``, o :meth:`Server.serve_forever` pueden ser usados para hacer que el Servidor comience a aceptar conexiones.
pt_pt: O parâmetro apenas por palavra-chave *start_serving* para :meth:`loop.create_server` e :meth:`asyncio.start_server` permite criar um objeto Server que não aceita ligações inicialmente. Neste caso, ``Server.start_serving()`` ou :meth:`Server.serve_forever` podem ser utilizados para fazer com que o servidor comece a aceitar ligações.

source: Start accepting connections until the coroutine is cancelled. Cancellation of ``serve_forever`` task causes the server to be closed.
es_es: Comienza a aceptar conexiones hasta que se cancela la corrutina. La cancelación de la tarea ``serve_forever`` provoca el cierre del servidor.
pt_pt: Começa a aceitar ligações até que a corrotina seja cancelada. O cancelamento da tarefa ``serve_forever`` faz com que o servidor seja fechado.

source: This method can be called if the server is already accepting connections. Only one ``serve_forever`` task can exist per one *Server* object.
es_es: Se puede llamar este método si el servidor ya está aceptando conexiones. Sólo puede existir una tarea ``serve_forever`` por cada objeto *Server*.
pt_pt: Este método pode ser chamado se o servidor já estiver a aceitar ligações. Só pode existir uma tarefa ``serve_forever`` por objeto *Server*.
