Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: es_es, pt_pt

source: *all_errors* determines what exceptions are raised when a connection cannot be created. By default, only a single ``Exception`` is raised: the first exception if there is only one or all errors have same message, or a single ``OSError`` with the error messages combined. When ``all_errors`` is ``True``, an ``ExceptionGroup`` will be raised containing all exceptions (even if there is only one).
es_es: *all_errors* определяет, какие исключения возникают, когда соединение не может быть создано. По умолчанию возникает только одно исключение: первое исключение, если есть только одна или все ошибки имеют одинаковое сообщение, или одно исключение OSError с объединенными сообщениями об ошибках. Когда ``all_errors`` имеет значение ``True``, будет создана группа ``ExceptionGroup``, содержащая все исключения (даже если есть только одно).
pt_pt: *all_errors* determina quais exceções são levantadas quando uma ligação não pode ser criada. Por predefinição, apenas uma única ``Exception`` é levantada: a primeira exceção se houver apenas uma ou se todas as mensagens de erro forem iguais, ou um único ``OSError`` com as mensagens de erro combinadas. Quando ``all_errors`` for ``True``, um ``ExceptionGroup`` será levantado contendo todas as exceções (mesmo que haja apenas uma).

source: Added support for SSL/TLS in :class:`ProactorEventLoop`.
es_es: Se ha añadido compatibilidad con SSL/TLS en :class:`ProactorEventLoop`.
pt_pt: Adicionado suporte para SSL/TLS em :class:`ProactorEventLoop`.

source: The socket option :ref:`socket.TCP_NODELAY <socket-unix-constants>` is set by default for all TCP connections.
es_es: Опция сокета :ref:`socket.TCP_NODELAY <socket-unix-constants>` установлена ​​по умолчанию для всех TCP-соединений.
pt_pt: A opção de socket :ref:`socket.TCP_NODELAY <socket-unix-constants>` é definida por predefinição para todas as ligações TCP.

source: Added the *ssl_handshake_timeout* parameter.
es_es: Додано параметр *ssl_handshake_timeout*.
pt_pt: Adicionado o parâmetro *ssl_handshake_timeout*.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
es_es: Añadidos los parámetros *happy_eyeballs_delay* e *interleave*.
pt_pt: Adicionados os parâmetros *happy_eyeballs_delay* e *interleave*.

source: Happy Eyeballs Algorithm: Success with Dual-Stack Hosts. When a server's IPv4 path and protocol are working, but the server's IPv6 path and protocol are not working, a dual-stack client application experiences significant connection delay compared to an IPv4-only client. This is undesirable because it causes the dual-stack client to have a worse user experience. This document specifies requirements for algorithms that reduce this user-visible delay and provides an algorithm.
es_es: Алгоритм счастливых глаз: успех с хостами с двумя стеками. Если путь и протокол IPv4 сервера работают, но путь и протокол IPv6 сервера не работают, клиентское приложение с двойным стеком испытывает значительную задержку подключения по сравнению с клиентом, поддерживающим только IPv4. Это нежелательно, поскольку это приводит к ухудшению пользовательского опыта клиента с двойным стеком. Этот документ определяет требования к алгоритмам, которые уменьшают эту видимую пользователю задержку, и предоставляет алгоритм.
pt_pt: Algoritmo Happy Eyeballs: Sucesso com Hosts Dual-Stack. Quando o caminho e protocolo IPv4 de um servidor estão a funcionar, mas o caminho e protocolo IPv6 do servidor não estão a funcionar, uma aplicação cliente dual-stack experimenta um atraso significativo na ligação em comparação com um cliente apenas IPv4. Isto é indesejável porque faz com que o cliente dual-stack tenha uma pior experiência de utilizador. Este documento especifica os requisitos para algoritmos que reduzem este atraso visível pelo utilizador e fornece um algoritmo.

source: For more information: https://datatracker.ietf.org/doc/html/rfc6555
es_es: Для получения дополнительной информации: https://datatracker.ietf.org/doc/html/rfc6555.
pt_pt: Para mais informações: https://datatracker.ietf.org/doc/html/rfc6555

source: Added the *ssl_shutdown_timeout* parameter.
es_es: Добавлен параметр *ssl_shutdown_timeout*.
pt_pt: Adicionado o parâmetro *ssl_shutdown_timeout*.

source: *all_errors* was added.
es_es: Добавлено *all_errors*.
pt_pt: Foi adicionado *all_errors*.

source: The :func:`open_connection` function is a high-level alternative API. It returns a pair of (:class:`StreamReader`, :class:`StreamWriter`) that can be used directly in async/await code.
es_es: La función :func:`open_connection` es una API alternativa de alto nivel. Devuelve un par de (:class:`StreamReader`, :class:`StreamWriter`) que puede utilizarse directamente en código async/await.
pt_pt: A função :func:`open_connection` é uma API alternativa de alto nível. Devolve um par (:class:`StreamReader`, :class:`StreamWriter`) que pode ser utilizado diretamente em código async/await.

source: Create a datagram connection.
es_es: Crear una conexión de datagramas.
pt_pt: Cria uma ligação de datagrama.

source: The socket family can be either :py:const:`~socket.AF_INET`, :py:const:`~socket.AF_INET6`, or :py:const:`~socket.AF_UNIX`, depending on *host* (or the *family* argument, if provided).
es_es: Семейство сокетов может быть :py:const:`~socket.AF_INET`, :py:const:`~socket.AF_INET6` или :py:const:`~socket.AF_UNIX`, в зависимости от *хоста* (или аргумент *family*, если он указан).
pt_pt: A família de sockets pode ser :py:const:`~socket.AF_INET`, :py:const:`~socket.AF_INET6`, ou :py:const:`~socket.AF_UNIX`, dependendo de *host* (ou do argumento *family*, se fornecido).

source: The socket type will be :py:const:`~socket.SOCK_DGRAM`.
es_es: Тип сокета будет :py:const:`~socket.SOCK_DGRAM`.
pt_pt: O tipo de socket será :py:const:`~socket.SOCK_DGRAM`.

source: *protocol_factory* must be a callable returning a :ref:`protocol <asyncio-protocol>` implementation.
es_es: *protocol_factory* debe ser un callable que devuelva una implementación :ref:`protocol <asyncio-protocol>`.
pt_pt: *protocol_factory* deve ser um callable que devolva uma implementação de :ref:`protocolo <asyncio-protocol>`.

source: A tuple of ``(transport, protocol)`` is returned on success.
es_es: En caso de éxito, se devuelve una tupla de ``(transport, protocol)``.
pt_pt: Um tuplo ``(transport, protocol)`` é devolvido em caso de sucesso.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using :meth:`getaddrinfo`.
es_es: *local_addr*, si se da, es una tupla ``(local_host, local_port)`` utilizada para enlazar el socket localmente. El *local_host* y *local_port* se buscan usando :meth:`getaddrinfo`.
pt_pt: *local_addr*, se fornecido, é um tuplo ``(local_host, local_port)`` utilizado para ligar o socket localmente. *local_host* e *local_port* são pesquisados utilizando :meth:`getaddrinfo`.

source: *remote_addr*, if given, is a ``(remote_host, remote_port)`` tuple used to connect the socket to a remote address. The *remote_host* and *remote_port* are looked up using :meth:`getaddrinfo`.
es_es: *remote_addr*, si se da, es una tupla ``(remote_host, remote_port)`` utilizada para conectar el socket a una dirección remota. El *remote_host* y *remote_port* se buscan usando :meth:`getaddrinfo`.
pt_pt: *remote_addr*, se fornecido, é um tuplo ``(remote_host, remote_port)`` utilizado para ligar o socket a um endereço remoto. *remote_host* e *remote_port* são pesquisados utilizando :meth:`getaddrinfo`.

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to :meth:`getaddrinfo` for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
es_es: *family*, *proto*, *flags* son la familia de direcciones opcional, el protocolo y las banderas que se pasarán a :meth:`getaddrinfo` para la resolución *host*. Si se dan, deben ser enteros de las constantes correspondientes del módulo :mod:`socket`.
pt_pt: *family*, *proto*, *flags* são a família de endereços, protocolo e flags opcionais a serem passados para :meth:`getaddrinfo` para resolução de *host*. Se fornecidos, estes devem ser todos inteiros das constantes do módulo :mod:`socket` correspondentes.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows and some Unixes. If the :ref:`socket.SO_REUSEPORT <socket-unix-constants>` constant is not defined then this capability is unsupported.
es_es: *reuse_port* указывает ядру разрешить привязку этой конечной точки к тому же порту, к которому привязаны другие существующие конечные точки, при условии, что все они установили этот флаг при создании. Эта опция не поддерживается в Windows и некоторых Unix-системах. Если константа :ref:`socket.SO_REUSEPORT <socket-unix-constants>` не определена, то эта возможность не поддерживается.
pt_pt: *reuse_port* indica ao kernel para permitir que este endpoint seja ligado à mesma porta que outros endpoints existentes, desde que todos definam esta flag ao serem criados. Esta opção não é suportada no Windows e em alguns Unix. Se a constante :ref:`socket.SO_REUSEPORT <socket-unix-constants>` não estiver definida, esta capacidade não é suportada.

source: *allow_broadcast* tells the kernel to allow this endpoint to send messages to the broadcast address.
es_es: *allow_broadcast* indica al núcleo que permita a este punto final enviar mensajes a la dirección de difusión.
pt_pt: *allow_broadcast* indica ao kernel para permitir que este endpoint envie mensagens para o endereço de broadcast.

source: *sock* can optionally be specified in order to use a preexisting, already connected, :class:`socket.socket` object to be used by the transport. If specified, *local_addr* and *remote_addr* should be omitted (must be :const:`None`).
es_es: *sock* puede especificarse opcionalmente para utilizar un objeto :class:`socket.socket` preexistente, ya conectado, que será utilizado por el transporte. Si se especifica, *local_addr* y *remote_addr* deben omitirse (deben ser :const:`None`).
pt_pt: *sock* pode ser opcionalmente especificado para utilizar um objeto :class:`socket.socket` pré-existente e já ligado a ser utilizado pelo transporte. Se especificado, *local_addr* e *remote_addr* devem ser omitidos (devem ser :const:`None`).

source: See :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` and :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>` examples.
es_es: Consulte los ejemplos :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` y :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>`.
pt_pt: Consulte os exemplos :ref:`protocolo de cliente eco UDP <asyncio-udp-echo-client-protocol>` e :ref:`protocolo de servidor eco UDP <asyncio-udp-echo-server-protocol>`.

source: The *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast*, and *sock* parameters were added.
es_es: Были добавлены параметры *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast* и *sock*.
pt_pt: Foram adicionados os parâmetros *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast* e *sock*.

source: Added support for Windows.
es_es: Se ha añadido compatibilidad con Windows.
pt_pt: Adicionado suporte para Windows.

source: The *reuse_address* parameter is no longer supported, as using :ref:`socket.SO_REUSEADDR <socket-unix-constants>` poses a significant security concern for UDP. Explicitly passing ``reuse_address=True`` will raise an exception.
es_es: Параметр *reuse_address* больше не поддерживается, поскольку использование :ref:`socket.SO_REUSEADDR <socket-unix-constants>` представляет собой серьезную проблему безопасности для UDP. Явная передача ``reuse_address=True`` вызовет исключение.
pt_pt: O parâmetro *reuse_address* já não é suportado, uma vez que a utilização de :ref:`socket.SO_REUSEADDR <socket-unix-constants>` representa uma preocupação significativa de segurança para UDP. Passar explicitamente ``reuse_address=True`` levantará uma exceção.

source: When multiple processes with differing UIDs assign sockets to an identical UDP socket address with ``SO_REUSEADDR``, incoming packets can become randomly distributed among the sockets.
es_es: Cuando varios procesos con UID diferentes asignan sockets a una dirección de socket UDP idéntica con ``SO_REUSEADDR``, los paquetes entrantes pueden distribuirse aleatoriamente entre los sockets.
pt_pt: Quando vários processos com UIDs diferentes atribuem sockets ao mesmo endereço de socket UDP com ``SO_REUSEADDR``, os pacotes recebidos podem ser distribuídos aleatoriamente entre os sockets.

source: For supported platforms, *reuse_port* can be used as a replacement for similar functionality. With *reuse_port*, :ref:`socket.SO_REUSEPORT <socket-unix-constants>` is used instead, which specifically prevents processes with differing UIDs from assigning sockets to the same socket address.
es_es: Для поддерживаемых платформ *reuse_port* можно использовать в качестве замены аналогичной функциональности. При использовании *reuse_port* вместо этого используется :ref:`socket.SO_REUSEPORT <socket-unix-constants>`, что специально предотвращает назначение процессами с разными UID сокетов одному и тому же адресу сокета.
pt_pt: Para plataformas suportadas, *reuse_port* pode ser utilizado como substituto para funcionalidade semelhante. Com *reuse_port*, é utilizado :ref:`socket.SO_REUSEPORT <socket-unix-constants>`, que impede especificamente que processos com UIDs diferentes atribuam sockets ao mesmo endereço de socket.

source: The *reuse_address* parameter, disabled since Python 3.8.1, 3.7.6 and 3.6.10, has been entirely removed.
es_es: Параметр *reuse_address*, отключенный начиная с Python 3.8.1, 3.7.6 и 3.6.10, был полностью удален.
pt_pt: O parâmetro *reuse_address*, desativado desde o Python 3.8.1, 3.7.6 e 3.6.10, foi completamente removido.

source: Create a Unix connection.
es_es: Crear una conexión Unix.
pt_pt: Cria uma ligação Unix.

source: The socket family will be :py:const:`~socket.AF_UNIX`; socket type will be :py:const:`~socket.SOCK_STREAM`.
es_es: Семейство сокетов будет :py:const:`~socket.AF_UNIX`; тип сокета будет :py:const:`~socket.SOCK_STREAM`.
pt_pt: A família de sockets será :py:const:`~socket.AF_UNIX`; o tipo de socket será :py:const:`~socket.SOCK_STREAM`.

source: *path* is the name of a Unix domain socket and is required, unless a *sock* parameter is specified. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
es_es: *ruta* es el nombre de un socket de dominio Unix y es obligatorio, a menos que se especifique un parámetro *sock*. Se admiten los sockets Unix abstractos, las rutas :class:`str`, :class:`bytes` y :class:`~pathlib.Path`.
pt_pt: *path* é o nome de um socket de domínio Unix e é obrigatório, a menos que seja especificado um parâmetro *sock*. São suportados sockets Unix abstratos, :class:`str`, :class:`bytes` e caminhos :class:`~pathlib.Path`.

source: See the documentation of the :meth:`loop.create_connection` method for information about arguments to this method.
es_es: Consulte la documentación del método :meth:`loop.create_connection` para obtener información sobre los argumentos de este método.
pt_pt: Consulte a documentação do método :meth:`loop.create_connection` para obter informações sobre os argumentos deste método.

source: Availability
es_es: Dostępność
pt_pt: Disponibilidade

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`.
es_es: Додано параметр *ssl_handshake_timeout*. Параметр *path* тепер може бути :term:`path-like object`.
pt_pt: Adicionado o parâmetro *ssl_handshake_timeout*. O parâmetro *path* agora pode ser um :term:`objeto tipo caminho`.

source: Creating network servers
es_es: Creación de servidores de red
pt_pt: Criação de servidores de rede

source: Create a TCP server (socket type :const:`~socket.SOCK_STREAM`) listening on *port* of the *host* address.
es_es: Создайте TCP-сервер (тип сокета :const:`~socket.SOCK_STREAM`), прослушивающий *порт* адреса *хоста*.
pt_pt: Cria um servidor TCP (tipo de socket :const:`~socket.SOCK_STREAM`) à escuta na *porta* do endereço *host*.

source: Returns a :class:`Server` object.
es_es: Devuelve un objeto :class:`Server`.
pt_pt: Devolve um objeto :class:`Server`.

source: Arguments:
es_es: Argumentos:
pt_pt: Argumentos:

source: The *host* parameter can be set to several types which determine where the server would be listening:
es_es: El parámetro *host* puede establecerse en varios tipos que determinan dónde escuchará el servidor:
pt_pt: O parâmetro *host* pode ser definido para vários tipos que determinam onde o servidor estará à escuta:

source: If *host* is a string, the TCP server is bound to a single network interface specified by *host*.
es_es: Si *host* es una cadena, el servidor TCP está vinculado a una única interfaz de red especificada por *host*.
pt_pt: Se *host* for uma string, o servidor TCP é ligado a uma única interface de rede especificada por *host*.

source: If *host* is a sequence of strings, the TCP server is bound to all network interfaces specified by the sequence.
es_es: Si *host* es una secuencia de cadenas, el servidor TCP está vinculado a todas las interfaces de red especificadas por la secuencia.
pt_pt: Se *host* for uma sequência de strings, o servidor TCP é ligado a todas as interfaces de rede especificadas pela sequência.

source: If *host* is an empty string or ``None``, all interfaces are assumed and a list of multiple sockets will be returned (most likely one for IPv4 and another one for IPv6).
es_es: Si *host* es una cadena vacía o ``None``, se asumen todas las interfaces y se devolverá una lista de múltiples sockets (probablemente uno para IPv4 y otro para IPv6).
pt_pt: Se *host* for uma string vazia ou ``None``, todas as interfaces são assumidas e será devolvida uma lista de vários sockets (provavelmente um para IPv4 e outro para IPv6).

source: The *port* parameter can be set to specify which port the server should listen on. If ``0`` or ``None`` (the default), a random unused port will be selected (note that if *host* resolves to multiple network interfaces, a different random port will be selected for each interface).
es_es: El parámetro *port* puede establecerse para especificar en qué puerto debe escuchar el servidor. Si ``0`` o ``None`` (por defecto), se seleccionará un puerto aleatorio no utilizado (tenga en cuenta que si *host* resuelve a múltiples interfaces de red, se seleccionará un puerto aleatorio diferente para cada interfaz).
pt_pt: O parâmetro *port* pode ser definido para especificar em que porta o servidor deve escutar. Se for ``0`` ou ``None`` (predefinição), será selecionada uma porta aleatória não utilizada (note que se *host* resolver para várias interfaces de rede, uma porta aleatória diferente será selecionada para cada interface).

source: *family* can be set to either :const:`socket.AF_INET` or :const:`~socket.AF_INET6` to force the socket to use IPv4 or IPv6. If not set, the *family* will be determined from host name (defaults to :const:`~socket.AF_UNSPEC`).
es_es: Для *family* может быть установлено значение :const:`socket.AF_INET` или :const:`~socket.AF_INET6`, чтобы заставить сокет использовать IPv4 или IPv6. Если не установлено, *семейство* будет определяться по имени хоста (по умолчанию :const:`~socket.AF_UNSPEC`).
pt_pt: *family* pode ser definido como :const:`socket.AF_INET` ou :const:`~socket.AF_INET6` para forçar o socket a usar IPv4 ou IPv6. Se não for definido, *family* será determinado a partir do nome do host (predefinição para :const:`~socket.AF_UNSPEC`).

source: *flags* is a bitmask for :meth:`getaddrinfo`.
es_es: *flags* es una máscara de bits para :meth:`getaddrinfo`.
pt_pt: *flags* é uma máscara de bits para :meth:`getaddrinfo`.

source: *sock* can optionally be specified in order to use a preexisting socket object. If specified, *host* and *port* must not be specified.
es_es: *sock* puede especificarse opcionalmente para utilizar un objeto socket preexistente. Si se especifica, *host* y *port* no deben especificarse.
pt_pt: *sock* pode ser opcionalmente especificado para utilizar um objeto socket pré-existente. Se especificado, *host* e *port* não devem ser especificados.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
es_es: Аргумент *sock* передает право собственности на сокет созданному серверу. Чтобы закрыть сокет, вызовите метод сервера :meth:`~asyncio.Server.close`.
pt_pt: O argumento *sock* transfere a propriedade do socket para o servidor criado. Para fechar o socket, chame o método :meth:`~asyncio.Server.close` do servidor.

source: *backlog* is the maximum number of queued connections passed to :meth:`~socket.socket.listen` (defaults to 100).
es_es: *backlog* es el número máximo de conexiones en cola pasadas a :meth:`~socket.socket.listen` (por defecto 100).
pt_pt: *backlog* é o número máximo de ligações em fila passadas para :meth:`~socket.socket.listen` (predefinição é 100).

source: *ssl* can be set to an :class:`~ssl.SSLContext` instance to enable TLS over the accepted connections.
es_es: *ssl* puede establecerse en una instancia de :class:`~ssl.SSLContext` para habilitar TLS en las conexiones aceptadas.
pt_pt: *ssl* pode ser definido como uma instância :class:`~ssl.SSLContext` para ativar TLS nas ligações aceites.

source: *reuse_address* tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire. If not specified will automatically be set to ``True`` on Unix.
es_es: *reuse_address* indica al núcleo que reutilice un socket local en estado ``TIME_WAIT``, sin esperar a que expire su tiempo de espera natural. Si no se especifica se establecerá automáticamente a ``True`` en Unix.
pt_pt: *reuse_address* indica ao kernel para reutilizar um socket local no estado ``TIME_WAIT``, sem aguardar que o seu timeout natural expire. Se não for especificado, será automaticamente definido como ``True`` em Unix.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows.
es_es: *reuse_port* le dice al kernel que permita que este endpoint sea enlazado al mismo puerto al que otros endpoints existentes están enlazados, siempre y cuando todos ellos establezcan esta bandera cuando son creados. Esta opción no es compatible con Windows.
pt_pt: *reuse_port* indica ao kernel para permitir que este endpoint seja ligado à mesma porta que outros endpoints existentes, desde que todos definam esta flag ao serem criados. Esta opção não é suportada no Windows.

source: *keep_alive* set to ``True`` keeps connections active by enabling the periodic transmission of messages.
es_es: Для параметра *keep_alive* установлено значение ``True``, соединения остаются активными, позволяя периодическую передачу сообщений.

source: Added the *keep_alive* parameter.
es_es: Добавлен параметр *keep_alive*.
