Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-subprocess.po
Languages: es_es, ru

source: Subprocesses
es_es: Subprocesos
ru: Подпроцессы

source: **Source code:** :source:`Lib/asyncio/subprocess.py`, :source:`Lib/asyncio/base_subprocess.py`
es_es: **Código fuente:** :source:`Lib/asyncio/subprocess.py`, :source:`Lib/asyncio/base_subprocess.py`
ru: **Исходный код:** :source:`Lib/asyncio/subprocess.py`, :source:`Lib/asyncio/base_subprocess.py`

source: This section describes high-level async/await asyncio APIs to create and manage subprocesses.
es_es: Esta sección describe las APIs async/await asyncio de alto nivel para crear y gestionar subprocesos.
ru: В этом разделе описываются высокоуровневые API-интерфейсы async/await asyncio для создания подпроцессов и управления ими.

source: Here's an example of how asyncio can run a shell command and obtain its result::
es_es: He aquí un ejemplo de cómo asyncio puede ejecutar un comando shell y obtener su resultado::
ru: Вот пример того, как asyncio может запустить команду оболочки и получить ее результат:

source: will print::
es_es: imprimirá::
ru: будет напечатано::

source: Because all asyncio subprocess functions are asynchronous and asyncio provides many tools to work with such functions, it is easy to execute and monitor multiple subprocesses in parallel. It is indeed trivial to modify the above example to run several commands simultaneously::
es_es: Como todas las funciones de subproceso de asyncio son asíncronas y asyncio proporciona muchas herramientas para trabajar con dichas funciones, es fácil ejecutar y monitorizar múltiples subprocesos en paralelo. De hecho, es trivial modificar el ejemplo anterior para ejecutar varios comandos simultáneamente::
ru: Поскольку все функции подпроцесса asyncio являются асинхронными, а asyncio предоставляет множество инструментов для работы с такими функциями, можно легко выполнять и отслеживать несколько подпроцессов параллельно. Модифицировать приведенный выше пример для одновременного запуска нескольких команд действительно тривиально:

source: async def main(): await asyncio.gather( run('ls /zzz'), run('sleep 1; echo "hello"')) asyncio.run(main())
es_es: async def main(): await asyncio.gather( run('ls /zzz'), run('sleep 1; echo "hola"')) asyncio.run(main())

source: See also the `Examples`_ subsection.
es_es: Ver también la subsección `Examples`_.
ru: См. также подраздел `Примеры`_.

source: Creating Subprocesses
es_es: Creación de subprocesos
ru: Создание подпроцессов

source: Create a subprocess.
es_es: Crear un subproceso.
ru: Создайте подпроцесс.

source: The *limit* argument sets the buffer limit for :class:`StreamReader` wrappers for :attr:`~asyncio.subprocess.Process.stdout` and :attr:`~asyncio.subprocess.Process.stderr` (if :const:`subprocess.PIPE` is passed to *stdout* and *stderr* arguments).
es_es: El argumento *limit* establece el límite del búfer de las envolturas :class:`StreamReader` para :attr:`~asyncio.subprocess.Process.stdout` y :attr:`~asyncio.subprocess.Process.stderr` (si se pasa :const:`subprocess.PIPE` a los argumentos *stdout* y *stderr*).

source: Return a :class:`~asyncio.subprocess.Process` instance.
es_es: Devuelve una instancia de :class:`~asyncio.subprocess.Process`.
ru: Верните экземпляр :class:`~asyncio.subprocess.Process`.

source: See the documentation of :meth:`loop.subprocess_exec` for other parameters.
es_es: Ver la documentación de :meth:`loop.subprocess_exec` para conocer otros parámetros.
ru: Другие параметры смотрите в документации :meth:`loop.subprocess_exec`.

source: Removed the *loop* parameter.
es_es: Eliminado el parámetro *loop*.
ru: Удален параметр *loop*.

source: Run the *cmd* shell command.
es_es: Ejecutar el comando de shell *cmd*.
ru: Запустите команду оболочки *cmd*.

source: See the documentation of :meth:`loop.subprocess_shell` for other parameters.
es_es: Consulte la documentación de :meth:`loop.subprocess_shell` para conocer otros parámetros.
ru: Другие параметры смотрите в документации :meth:`loop.subprocess_shell`.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special shell characters in strings that are going to be used to construct shell commands.
es_es: Es responsabilidad de la aplicación asegurarse de que todos los espacios en blanco y caracteres especiales se entrecomillan adecuadamente para evitar vulnerabilidades de `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. La función :func:`shlex.quote` se puede utilizar para escapar correctamente los espacios en blanco y los caracteres especiales de shell en las cadenas que se van a utilizar para construir comandos de shell.
ru: Приложение несет ответственность за то, чтобы все пробелы и специальные символы были заключены в кавычки соответствующим образом, чтобы избежать `_ уязвимостей внедрения оболочки <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. Функцию :func:`shlex.quote` можно использовать для правильного экранирования пробелов и специальных символов оболочки в строках, которые будут использоваться для создания команд оболочки.

source: Subprocesses are available for Windows if a :class:`ProactorEventLoop` is used. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
es_es: Los subprocesos están disponibles para Windows si se utiliza :class:`ProactorEventLoop`. Para más detalles :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>`.
ru: Подпроцессы доступны для Windows, если используется :class:`ProactorEventLoop`. Подробности см. в разделе «Поддержка подпроцессов в Windows <asyncio-windows-subprocess>».

source: asyncio also has the following *low-level* APIs to work with subprocesses: :meth:`loop.subprocess_exec`, :meth:`loop.subprocess_shell`, :meth:`loop.connect_read_pipe`, :meth:`loop.connect_write_pipe`, as well as the :ref:`Subprocess Transports <asyncio-subprocess-transports>` and :ref:`Subprocess Protocols <asyncio-subprocess-protocols>`.
es_es: asyncio también tiene las siguientes APIs de *bajo nivel* para trabajar con subprocesos: :meth:`loop.subprocess_exec`, :meth:`loop.subprocess_shell`, :meth:`loop.connect_read_pipe`, :meth:`loop.connect_write_pipe`, así como los :ref:`Subprocess Transports <asyncio-subprocess-transports>` y :ref:`Subprocess Protocols <asyncio-subprocess-protocols>`.
ru: asyncio также имеет следующие *низкоуровневые* API для работы с подпроцессами: :meth:`loop.subprocess_exec`, :meth:`loop.subprocess_shell`, :meth:`loop.connect_read_pipe`, :meth:`loop.connect_write_pipe `, а также :ref:`Транспорты подпроцессов <asyncio-subprocess-transports>` и :ref:`Протоколы подпроцессов <asyncio-subprocess-protocols>`.

source: Constants
es_es: Constantes
ru: Константы

source: Can be passed to the *stdin*, *stdout* or *stderr* parameters.
es_es: Puede pasarse a los parámetros *stdin*, *stdout* o *stderr*.
ru: Может передаваться в параметры *stdin*, *stdout* или *stderr*.

source: If *PIPE* is passed to *stdin* argument, the :attr:`Process.stdin <asyncio.subprocess.Process.stdin>` attribute will point to a :class:`~asyncio.StreamWriter` instance.
es_es: Si se pasa *PIPE* al argumento *stdin*, el atributo :attr:`Process.stdin <asyncio.subprocess.Process.stdin>` apuntará a una instancia de :class:`~asyncio.StreamWriter`.

source: If *PIPE* is passed to *stdout* or *stderr* arguments, the :attr:`Process.stdout <asyncio.subprocess.Process.stdout>` and :attr:`Process.stderr <asyncio.subprocess.Process.stderr>` attributes will point to :class:`~asyncio.StreamReader` instances.
es_es: Si se pasa *PIPE* a los argumentos *stdout* o *stderr*, los atributos :attr:`Process.stdout <asyncio.subprocess.Process.stdout>` y :attr:`Process.stderr <asyncio.subprocess.Process.stderr>` apuntarán a las instancias :class:`~asyncio.StreamReader`.

source: Special value that can be used as the *stderr* argument and indicates that standard error should be redirected into standard output.
es_es: Valor especial que puede utilizarse como argumento *stderr* e indica que el error estándar debe redirigirse a la salida estándar.
ru: Специальное значение, которое можно использовать в качестве аргумента *stderr* и указывает, что стандартная ошибка должна быть перенаправлена ​​в стандартный вывод.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to process creation functions. It indicates that the special file :data:`os.devnull` will be used for the corresponding subprocess stream.
es_es: Valor especial que puede utilizarse como argumento *stdin*, *stdout* o *stderr* en las funciones de creación de procesos. Indica que se utilizará el archivo especial :data:`os.devnull` para el flujo del subproceso correspondiente.
ru: Специальное значение, которое можно использовать в качестве аргумента *stdin*, *stdout* или *stderr* для функций создания процессов. Это указывает на то, что специальный файл :data:`os.devnull` будет использоваться для соответствующего потока подпроцесса.

source: Interacting with Subprocesses
es_es: Interacción con subprocesos
ru: Взаимодействие с подпроцессами

source: Both :func:`create_subprocess_exec` and :func:`create_subprocess_shell` functions return instances of the *Process* class. *Process* is a high-level wrapper that allows communicating with subprocesses and watching for their completion.
es_es: Ambas funciones :func:`create_subprocess_exec` y :func:`create_subprocess_shell` devuelven instancias de la clase *Process*. *Process* es una envoltura de alto nivel que permite comunicarse con subprocesos y vigilar su finalización.
ru: Обе функции :func:`create_subprocess_exec` и :func:`create_subprocess_shell` возвращают экземпляры класса *Process*. *Процесс* — это высокоуровневая оболочка, позволяющая взаимодействовать с подпроцессами и следить за их завершением.

source: An object that wraps OS processes created by the :func:`~asyncio.create_subprocess_exec` and :func:`~asyncio.create_subprocess_shell` functions.
es_es: Un objeto que envuelve los procesos del SO creados por las funciones :func:`~asyncio.create_subprocess_exec` y :func:`~asyncio.create_subprocess_shell`.

source: This class is designed to have a similar API to the :class:`subprocess.Popen` class, but there are some notable differences:
es_es: Esta clase está diseñada para tener una API similar a la clase :class:`subprocess.Popen`, pero hay algunas diferencias notables:
ru: Этот класс спроектирован так, чтобы иметь API, аналогичный классу :class:`subprocess.Popen`, но есть некоторые заметные различия:

source: unlike Popen, Process instances do not have an equivalent to the :meth:`~subprocess.Popen.poll` method;
es_es: A diferencia de Popen, las instancias de Proceso no tienen un equivalente al método :meth:`~subprocess.Popen.poll`;
ru: в отличие от Popen, экземпляры Process не имеют эквивалента метода :meth:`~subprocess.Popen.poll`;

source: the :meth:`~asyncio.subprocess.Process.communicate` and :meth:`~asyncio.subprocess.Process.wait` methods don't have a *timeout* parameter: use the :func:`~asyncio.wait_for` function;
es_es: los métodos :meth:`~asyncio.subprocess.Process.communicate` y :meth:`~asyncio.subprocess.Process.wait` no tienen un parámetro *timeout*: utilizar la función :func:`~asyncio.wait_for`;
ru: методы :meth:`~asyncio.subprocess.Process.communicate` и :meth:`~asyncio.subprocess.Process.wait` не имеют параметра *timeout*: используйте :func:`~asyncio.wait_for` функция;

source: the :meth:`Process.wait() <asyncio.subprocess.Process.wait>` method is asynchronous, whereas :meth:`subprocess.Popen.wait` method is implemented as a blocking busy loop;
es_es: el método :meth:`Process.wait() <asyncio.subprocess.Process.wait>` es asíncrono, mientras que el método :meth:`subprocess.Popen.wait` se implementa como un bucle ocupado de bloqueo;
ru: метод :meth:`Process.wait() <asyncio.subprocess.Process.wait>` является асинхронным, тогда как метод :meth:`subprocess.Popen.wait` реализован как блокирующий цикл занятости;

source: the *universal_newlines* parameter is not supported.
es_es: el parámetro *universal_newlines* no está soportado.
ru: параметр *universal_newlines* не поддерживается.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
es_es: Esta clase es :ref:`no thread safe <asyncio-multithreading>`.
ru: Этот класс :ref:`не потокобезопасен <asyncio-multithreading>`.

source: See also the :ref:`Subprocess and Threads <asyncio-subprocess-threads>` section.
es_es: Ver también la sección :ref:`Subprocess and Threads <asyncio-subprocess-threads>`.
ru: См. также раздел :ref:`Подпроцесс и потоки <asyncio-subprocess-threads>`.

source: Wait for the child process to terminate.
es_es: Esperar a que el proceso hijo termine.
ru: Подождите, пока дочерний процесс завершится.

source: Set and return the :attr:`returncode` attribute.
es_es: Establece y devuelve el atributo :attr:`returncode`.
ru: Установите и верните атрибут :attr:`returncode`.

source: This method can deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates so much output that it blocks waiting for the OS pipe buffer to accept more data. Use the :meth:`communicate` method when using pipes to avoid this condition.
es_es: Este método puede bloquearse cuando se utiliza ``stdout=PIPE`` o ``stderr=PIPE`` y el proceso hijo genera tanta salida que se bloquea esperando a que el buffer de la tubería del sistema operativo acepte más datos. Utilice el método :meth:`communicate` cuando use tuberías para evitar esta situación.
ru: Этот метод может заблокироваться при использовании stdout=PIPE или stderr=PIPE, а дочерний процесс генерирует так много выходных данных, что блокируется ожидание, пока буфер канала ОС примет больше данных. Используйте метод :meth:`communicate` при использовании каналов, чтобы избежать этой ситуации.

source: Interact with process:
es_es: Interactúa con el proceso:
ru: Взаимодействуйте с процессом:

source: send data to *stdin* (if *input* is not ``None``);
es_es: enviar datos a *stdin* (si *input* no es ``None``);
ru: отправить данные на *stdin* (если *input* не ``None``);

source: closes *stdin*;
es_es: cierra *stdin*;
ru: закрывает *stdin*;

source: read data from *stdout* and *stderr*, until EOF is reached;
es_es: leer datos de *stdout* y *stderr*, hasta alcanzar EOF;
ru: читать данные из *stdout* и *stderr*, пока не будет достигнут EOF;

source: wait for process to terminate.
es_es: esperar a que termine el proceso.
ru: дождитесь завершения процесса.

source: The optional *input* argument is the data (:class:`bytes` object) that will be sent to the child process.
es_es: El argumento opcional *input* son los datos ( objeto:class:`bytes` ) que se enviarán al proceso hijo.
ru: Необязательный аргумент *input* — это данные (объект:class:`bytes`), которые будут отправлены дочернему процессу.

source: Return a tuple ``(stdout_data, stderr_data)``.
es_es: Devuelve una tupla ``(stdout_data, stderr_data)``.
ru: Вернуть кортеж ``(stdout_data, stderr_data)``.

source: If either :exc:`BrokenPipeError` or :exc:`ConnectionResetError` exception is raised when writing *input* into *stdin*, the exception is ignored. This condition occurs when the process exits before all data are written into *stdin*.
es_es: Si se produce una excepción en :exc:`BrokenPipeError` o :exc:`ConnectionResetError` al escribir *input* en *stdin*, la excepción se ignora. Esta condición ocurre cuando el proceso sale antes de que todos los datos sean escritos en *stdin*.
ru: Если при записи *input* в *stdin* возникает исключение :exc:`BrokenPipeError` или :exc:`ConnectionResetError`, это исключение игнорируется. Это условие возникает, когда процесс завершается до того, как все данные будут записаны в *stdin*.

source: If it is desired to send data to the process' *stdin*, the process needs to be created with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, the process has to be created with ``stdout=PIPE`` and/or ``stderr=PIPE`` arguments.
es_es: Si se desea enviar datos al *stdin* del proceso, éste debe crearse con ``stdin=PIPE``. Del mismo modo, para obtener cualquier cosa que no sea ``None`` en la tupla de resultados, el proceso tiene que ser creado con ``stdout=PIPE`` y/o ``stderr=PIPE`` argumentos.
ru: Если необходимо отправить данные в процесс *stdin*, процесс необходимо создать с помощью ``stdin=PIPE``. Аналогично, чтобы получить в кортеже результатов что-либо, кроме None, процесс должен быть создан с аргументами stdout=PIPE и/или stderr=PIPE.

source: Note, that the data read is buffered in memory, so do not use this method if the data size is large or unlimited.
es_es: Tenga en cuenta que los datos leídos se almacenan en memoria, por lo que no debe utilizar este método si el tamaño de los datos es grande o ilimitado.
ru: Обратите внимание, что считанные данные буферизуются в памяти, поэтому не используйте этот метод, если размер данных большой или неограниченный.

source: *stdin* gets closed when ``input=None`` too.
es_es: *stdin* también se cierra cuando ``input=None``.

source: Sends the signal *signal* to the child process.
es_es: Envía la señal *signal* al proceso hijo.
ru: Отправляет сигнал *signal* дочернему процессу.

source: On Windows, :py:const:`~signal.SIGTERM` is an alias for :meth:`terminate`. ``CTRL_C_EVENT`` and ``CTRL_BREAK_EVENT`` can be sent to processes started with a *creationflags* parameter which includes ``CREATE_NEW_PROCESS_GROUP``.
es_es: En Windows, :py:const:`~signal.SIGTERM` es un alias de :meth:`terminate`. ``CTRL_C_EVENT`` y ``CTRL_BREAK_EVENT`` pueden enviarse a procesos iniciados con un parámetro *creationflags* que incluya ``CREATE_NEW_PROCESS_GROUP``.
ru: В Windows :py:const:`~signal.SIGTERM` является псевдонимом для :meth:`terminate`. ``CTRL_C_EVENT`` и ``CTRL_BREAK_EVENT`` могут быть отправлены процессам, запущенным с параметром *creationflags*, который включает ``CREATE_NEW_PROCESS_GROUP``.

source: Stop the child process.
es_es: Detener el proceso hijo.
ru: Остановите дочерний процесс.

source: On POSIX systems this method sends :py:const:`~signal.SIGTERM` to the child process.
es_es: En sistemas POSIX este método envía :py:const:`~signal.SIGTERM` al proceso hijo.
ru: В системах POSIX этот метод отправляет :py:const:`~signal.SIGTERM` дочернему процессу.

source: On Windows the Win32 API function :c:func:`!TerminateProcess` is called to stop the child process.
es_es: En Windows se llama a la función Win32 API :c:func:`!TerminateProcess` para detener el proceso hijo.
ru: В Windows функция Win32 API :c:func:`!TerminateProcess` вызывается для остановки дочернего процесса.

source: Kill the child process.
es_es: Mata el proceso hijo.
ru: Убейте дочерний процесс.

source: On POSIX systems this method sends :py:data:`~signal.SIGKILL` to the child process.
es_es: En sistemas POSIX este método envía :py:data:`~signal.SIGKILL` al proceso hijo.

source: On Windows this method is an alias for :meth:`terminate`.
es_es: En Windows, este método es un alias de :meth:`terminate`.
ru: В Windows этот метод является псевдонимом :meth:`terminate`.

source: Standard input stream (:class:`~asyncio.StreamWriter`) or ``None`` if the process was created with ``stdin=None``.
es_es: Flujo de entrada estándar (:class:`~asyncio.StreamWriter`) o ``None`` si el proceso se creó con ``stdin=None``.

source: Standard output stream (:class:`~asyncio.StreamReader`) or ``None`` if the process was created with ``stdout=None``.
es_es: Flujo de salida estándar (:class:`~asyncio.StreamReader`) o ``None`` si el proceso se creó con ``stdout=None``.

source: Standard error stream (:class:`~asyncio.StreamReader`) or ``None`` if the process was created with ``stderr=None``.
es_es: Flujo de error estándar (:class:`~asyncio.StreamReader`) o ``None`` si el proceso se creó con ``stderr=None``.

source: Use the :meth:`communicate` method rather than :attr:`process.stdin.write() <stdin>`, :attr:`await process.stdout.read() <stdout>` or :attr:`await process.stderr.read() <stderr>`. This avoids deadlocks due to streams pausing reading or writing and blocking the child process.
es_es: Utilice el método :meth:`communicate` en lugar de :attr:`process.stdin.write() <stdin>`, :attr:`await process.stdout.read() <stdout>` o :attr:`await process.stderr.read() <stderr>`. Esto evita bloqueos debidos a flujos que detienen la lectura o escritura y bloquean el proceso hijo.
ru: Используйте метод :meth:`communicate` вместо :attr:`process.stdin.write() <stdin>`, :attr:`awaitprocess.stdout.read() <stdout>` или :attr:`await процесса .stderr.read() <stderr>`. Это позволяет избежать взаимоблокировок из-за того, что потоки приостанавливают чтение или запись и блокируют дочерний процесс.

source: Process identification number (PID).
es_es: Número de identificación del proceso (PID).
ru: Идентификатор процесса (PID).

source: Note that for processes created by the :func:`~asyncio.create_subprocess_shell` function, this attribute is the PID of the spawned shell.
es_es: Tenga en cuenta que para los procesos creados por la función :func:`~asyncio.create_subprocess_shell`, este atributo es el PID del shell generado.

source: Return code of the process when it exits.
es_es: Código de retorno del proceso cuando sale.
ru: Код возврата процесса при его выходе.

source: A ``None`` value indicates that the process has not terminated yet.
es_es: Un valor ``None`` indica que el proceso aún no ha terminado.
ru: Значение None указывает, что процесс еще не завершен.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
es_es: Un valor negativo ``-N`` indica que el hijo fue terminado por la señal ``N`` (sólo POSIX).
ru: Отрицательное значение ``-N`` указывает, что дочерний процесс был завершен сигналом ``N`` (только POSIX).

source: Subprocess and Threads
es_es: Subprocesos e hilos
ru: Подпроцессы и потоки

source: Standard asyncio event loop supports running subprocesses from different threads by default.
es_es: El bucle de eventos estándar de asyncio admite la ejecución de subprocesos desde diferentes hilos de forma predeterminada.
ru: Стандартный цикл событий asyncio по умолчанию поддерживает запуск подпроцессов из разных потоков.

source: On Windows subprocesses are provided by :class:`ProactorEventLoop` only (default), :class:`SelectorEventLoop` has no subprocess support.
es_es: En Windows los subprocesos son proporcionados únicamente por :class:`ProactorEventLoop` (por defecto), :class:`SelectorEventLoop` no tiene soporte para subprocesos.
ru: В Windows подпроцессы предоставляются только :class:`ProactorEventLoop` (по умолчанию), :class:`SelectorEventLoop` не имеет поддержки подпроцессов.

source: On UNIX *child watchers* are used for subprocess finish waiting, see :ref:`asyncio-watchers` for more info.
es_es: En UNIX *child watchers* se utilizan para la espera de fin de subproceso, ver :ref:`asyncio-watchers` para más información.
ru: В UNIX *дочерние наблюдатели* используются для ожидания завершения подпроцесса, дополнительную информацию см. в разделе :ref:`asyncio-watchers`.

source: UNIX switched to use :class:`ThreadedChildWatcher` for spawning subprocesses from different threads without any limitation.
es_es: UNIX pasó a utilizar :class:`ThreadedChildWatcher` para desovar subprocesos de diferentes hilos sin ninguna limitación.
ru: UNIX перешел на использование :class:`ThreadedChildWatcher` для создания подпроцессов из разных потоков без каких-либо ограничений.
