Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: es_es, pt_pt

source: Event Loop
es_es: Bucle de eventos
pt_pt: Ciclo de Eventos

source: **Source code:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`
es_es: **Código fuente:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`
pt_pt: **Código-fonte:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`

source: Preface
es_es: Prefacio
pt_pt: Prefácio

source: The event loop is the core of every asyncio application. Event loops run asynchronous tasks and callbacks, perform network IO operations, and run subprocesses.
es_es: El bucle de hechos es el núcleo de toda aplicación asyncio. Los bucles de eventos ejecutan tareas asíncronas y callbacks, realizan operaciones de IO de red y ejecutan subprocesos.
pt_pt: O ciclo de eventos é o núcleo de todas as aplicações asyncio. Os ciclos de eventos executam tarefas e chamadas de retorno assíncronas, realizam operações de E/S de rede e executam subprocessos.

source: Application developers should typically use the high-level asyncio functions, such as :func:`asyncio.run`, and should rarely need to reference the loop object or call its methods. This section is intended mostly for authors of lower-level code, libraries, and frameworks, who need finer control over the event loop behavior.
es_es: Los desarrolladores de aplicaciones deberían utilizar normalmente las funciones de alto nivel de asyncio, como :func:`asyncio.run`, y rara vez deberían necesitar hacer referencia al objeto de bucle o llamar a sus métodos. Esta sección está destinada principalmente a los autores de código de bajo nivel, bibliotecas y frameworks, que necesitan un control más fino sobre el comportamiento del bucle de eventos.
pt_pt: Os programadores de aplicações devem normalmente utilizar as funções de alto nível do asyncio, como :func:`asyncio.run`, e raramente precisam de referenciar o objeto do ciclo ou chamar os seus métodos. Esta secção destina-se principalmente a autores de código de baixo nível, bibliotecas e frameworks, que necessitam de um controlo mais fino sobre o comportamento do ciclo de eventos.

source: Obtaining the Event Loop
es_es: Obtención del bucle de eventos
pt_pt: Obter o ciclo de eventos

source: The following low-level functions can be used to get, set, or create an event loop:
es_es: Las siguientes funciones de bajo nivel se pueden utilizar para obtener, establecer o crear un bucle de eventos:
pt_pt: As seguintes funções de baixo nível podem ser utilizadas para obter, definir ou criar um ciclo de eventos:

source: Return the running event loop in the current OS thread.
es_es: Devuelve el bucle de eventos en ejecución en el hilo OS actual.
pt_pt: Devolve o ciclo de eventos em execução na thread atual do sistema operativo.

source: Raise a :exc:`RuntimeError` if there is no running event loop.
es_es: Вызовите :exc:`RuntimeError`, если нет текущего цикла событий.
pt_pt: Levanta um :exc:`RuntimeError` se não existir nenhum ciclo de eventos em execução.

source: This function can only be called from a coroutine or a callback.
es_es: Эту функцию можно вызвать только из сопрограммы или обратного вызова.
pt_pt: Esta função só pode ser chamada a partir de uma corrotina ou de uma chamada de retorno.

source: Get the current event loop.
es_es: Obtener el bucle actual de eventos.
pt_pt: Obtém o ciclo de eventos atual.

source: When called from a coroutine or a callback (e.g. scheduled with call_soon or similar API), this function will always return the running event loop.
es_es: При вызове из сопрограммы или обратного вызова (например, запланированного с помощью call_soon или аналогичного API) эта функция всегда будет возвращать текущий цикл событий.
pt_pt: Quando chamada a partir de uma corrotina ou de uma chamada de retorno (por exemplo, agendada com call_soon ou API semelhante), esta função irá sempre devolver o ciclo de eventos em execução.

source: If there is no running event loop set, the function will return the result of the ``get_event_loop_policy().get_event_loop()`` call.
es_es: Если не установлен текущий цикл событий, функция вернет результат вызова ``get_event_loop_policy().get_event_loop()``.
pt_pt: Se não existir nenhum ciclo de eventos em execução definido, a função irá devolver o resultado da chamada ``get_event_loop_policy().get_event_loop()``.

source: Because this function has rather complex behavior (especially when custom event loop policies are in use), using the :func:`get_running_loop` function is preferred to :func:`get_event_loop` in coroutines and callbacks.
es_es: Debido a que esta función tiene un comportamiento bastante complejo (especialmente cuando se utilizan políticas de bucle de eventos personalizadas), es preferible utilizar la función :func:`get_running_loop` en lugar de :func:`get_event_loop` en corrutinas y callbacks.
pt_pt: Como esta função tem um comportamento bastante complexo (especialmente quando são utilizadas políticas personalizadas de ciclo de eventos), é preferível utilizar a função :func:`get_running_loop` em vez de :func:`get_event_loop` em corrotinas e chamadas de retorno.

source: As noted above, consider using the higher-level :func:`asyncio.run` function, instead of using these lower level functions to manually create and close an event loop.
es_es: Как отмечалось выше, рассмотрите возможность использования функции :func:`asyncio.run` более высокого уровня вместо использования этих функций более низкого уровня для ручного создания и закрытия цикла событий.
pt_pt: Como mencionado acima, considere utilizar a função de alto nível :func:`asyncio.run`, em vez de utilizar estas funções de baixo nível para criar e fechar manualmente um ciclo de eventos.

source: Set *loop* as the current event loop for the current OS thread.
es_es: Установите *loop* в качестве текущего цикла событий для текущего потока ОС.
pt_pt: Define *loop* como o ciclo de eventos atual para a thread atual do sistema operativo.

source: Create and return a new event loop object.
es_es: Crea y devuelve un nuevo objeto de bucle de eventos.
pt_pt: Cria e devolve um novo objeto de ciclo de eventos.

source: Note that the behaviour of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop` functions can be altered by :ref:`setting a custom event loop policy <asyncio-policies>`.
es_es: Tener en cuenta que el comportamiento de las funciones :func:`get_event_loop`, :func:`set_event_loop`, y :func:`new_event_loop` puede alterarse mediante :ref:`setting a custom event loop policy <asyncio-policies>`.
pt_pt: Note que o comportamento das funções :func:`get_event_loop`, :func:`set_event_loop` e :func:`new_event_loop` pode ser alterado através da :ref:`definição de uma política personalizada de ciclo de eventos <asyncio-policies>`.

source: Contents
es_es: Contenido
pt_pt: Conteúdos

source: This documentation page contains the following sections:
es_es: Esta página de documentación contiene las siguientes secciones:
pt_pt: Esta página de documentação contém as seguintes secções:

source: The `Event Loop Methods`_ section is the reference documentation of the event loop APIs;
es_es: La sección `Event Loop Methods`_ es la documentación de referencia de las APIs del bucle de eventos;
pt_pt: A secção `Métodos do Ciclo de Eventos`_ é a documentação de referência das APIs do ciclo de eventos;

source: The `Callback Handles`_ section documents the :class:`Handle` and :class:`TimerHandle` instances which are returned from scheduling methods such as :meth:`loop.call_soon` and :meth:`loop.call_later`;
es_es: La sección `Callback Handles`_ documenta las instancias :class:`Handle` y :class:`TimerHandle` que se devuelven de métodos de programación como :meth:`loop.call_soon` y :meth:`loop.call_later`;
pt_pt: A secção `Manipuladores de Chamadas de Retorno`_ documenta as instâncias :class:`Handle` e :class:`TimerHandle` que são devolvidas pelos métodos de agendamento, como :meth:`loop.call_soon` e :meth:`loop.call_later`;

source: The `Server Objects`_ section documents types returned from event loop methods like :meth:`loop.create_server`;
es_es: La sección `Server Objects`_ documenta los tipos devueltos por métodos de bucle de eventos como :meth:`loop.create_server`;
pt_pt: A secção `Objetos de Servidor`_ documenta os tipos devolvidos pelos métodos do ciclo de eventos, como :meth:`loop.create_server`;

source: The `Event Loop Implementations`_ section documents the :class:`SelectorEventLoop` and :class:`ProactorEventLoop` classes;
es_es: La sección `Event Loop Implementations`_ documenta las clases :class:`SelectorEventLoop` y :class:`ProactorEventLoop`;
pt_pt: A secção `Implementações do Ciclo de Eventos`_ documenta as classes :class:`SelectorEventLoop` e :class:`ProactorEventLoop`;

source: The `Examples`_ section showcases how to work with some event loop APIs.
es_es: La sección `Examples`_ muestra cómo trabajar con algunas API de bucle de eventos.
pt_pt: A secção `Examples`_ mostra como trabalhar com algumas APIs do ciclo de eventos.

source: Event Loop Methods
es_es: Métodos de bucle de eventos
pt_pt: Métodos do ciclo de eventos

source: Event loops have **low-level** APIs for the following:
es_es: Los bucles de eventos tienen API de **nivel bajo** para lo siguiente:
pt_pt: Os ciclos de eventos têm APIs de **baixo nível** para as seguintes operações:

source: Running and stopping the loop
es_es: Ejecutar y detener el bucle
pt_pt: Execução e paragem do ciclo

source: Run until the *future* (an instance of :class:`Future`) has completed.
es_es: Ejecutar hasta que el *future* (una instancia de :class:`Future`) se haya completado.
pt_pt: Executa até que o *future* (uma instância de :class:`Future`) esteja concluído.

source: If the argument is a :ref:`coroutine object <coroutine>` it is implicitly scheduled to run as a :class:`asyncio.Task`.
es_es: Si el argumento es un objeto :ref:`coroutine <coroutine>` se programa implícitamente para que se ejecute como :class:`asyncio.Task`.
pt_pt: Se o argumento for um :ref:`objeto corrotina <coroutine>`, é implicitamente agendado para ser executado como uma :class:`asyncio.Task`.

source: Return the Future's result or raise its exception.
es_es: Devuelve el resultado de Future o lanza su excepción.
pt_pt: Devolve o resultado do Future ou levanta a sua exceção.

source: Run the event loop until :meth:`stop` is called.
es_es: Ejecuta el bucle de eventos hasta que se llame a :meth:`stop`.
pt_pt: Executa o ciclo de eventos até que :meth:`stop` seja chamado.

source: If :meth:`stop` is called before :meth:`run_forever` is called, the loop will poll the I/O selector once with a timeout of zero, run all callbacks scheduled in response to I/O events (and those that were already scheduled), and then exit.
es_es: Если :meth:`stop` вызывается до вызова :meth:`run_forever`, цикл один раз опрашивает селектор ввода-вывода с нулевым тайм-аутом, запускает все запланированные обратные вызовы в ответ на события ввода-вывода (и те, которые уже запланированы), а затем выйти.
pt_pt: Se :meth:`stop` for chamado antes de :meth:`run_forever`, o ciclo irá consultar o seletor de E/S uma vez com um timeout de zero, executar todas as chamadas de retorno agendadas em resposta a eventos de E/S (e aquelas que já estavam agendadas), e depois sair.

source: If :meth:`stop` is called while :meth:`run_forever` is running, the loop will run the current batch of callbacks and then exit. Note that new callbacks scheduled by callbacks will not run in this case; instead, they will run the next time :meth:`run_forever` or :meth:`run_until_complete` is called.
es_es: Si se llama a :meth:`stop` mientras se está ejecutando :meth:`run_forever`, el bucle ejecutará el lote actual de retrollamadas y luego saldrá. Tener en cuenta que las nuevas retrollamadas programadas por retrollamadas no se ejecutarán en este caso; en su lugar, se ejecutarán la próxima vez que se llame a :meth:`run_forever` o :meth:`run_until_complete`.
pt_pt: Se :meth:`stop` for chamado enquanto :meth:`run_forever` estiver a ser executado, o ciclo irá executar o lote atual de chamadas de retorno e depois sair. Note que novas chamadas de retorno agendadas por chamadas de retorno não serão executadas neste caso; em vez disso, serão executadas na próxima vez que :meth:`run_forever` ou :meth:`run_until_complete` for chamado.

source: Stop the event loop.
es_es: Detener el bucle de eventos.
pt_pt: Para o ciclo de eventos.

source: Return ``True`` if the event loop is currently running.
es_es: Devuelve ``True`` si el bucle de eventos se está ejecutando actualmente.
pt_pt: Devolve ``True`` se o ciclo de eventos estiver atualmente em execução.

source: Return ``True`` if the event loop was closed.
es_es: Devuelve ``True`` si se ha cerrado el bucle de eventos.
pt_pt: Devolve ``True`` se o ciclo de eventos tiver sido fechado.

source: Close the event loop.
es_es: Cierra el bucle de eventos.
pt_pt: Fecha o ciclo de eventos.

source: The loop must not be running when this function is called. Any pending callbacks will be discarded.
es_es: El bucle no debe estar en ejecución cuando se llame a esta función. Se descartará cualquier devolución de llamada pendiente.
pt_pt: O ciclo não deve estar em execução quando esta função é chamada. Quaisquer chamadas de retorno pendentes serão descartadas.

source: This method clears all queues and shuts down the executor, but does not wait for the executor to finish.
es_es: Este método borra todas las colas y apaga el ejecutor, pero no espera a que el ejecutor termine.
pt_pt: Este método limpa todas as filas e desliga o executor, mas não aguarda que o executor termine.

source: This method is idempotent and irreversible. No other methods should be called after the event loop is closed.
es_es: Este método es idempotente e irreversible. No se debe llamar a ningún otro método una vez cerrado el bucle de eventos.
pt_pt: Este método é idempotente e irreversível. Nenhum outro método deve ser chamado após o ciclo de eventos ser fechado.

source: Schedule all currently open :term:`asynchronous generator` objects to close with an :meth:`~agen.aclose` call. After calling this method, the event loop will issue a warning if a new asynchronous generator is iterated. This should be used to reliably finalize all scheduled asynchronous generators.
es_es: Запланируйте закрытие всех открытых в данный момент объектов асинхронного генератора с помощью вызова :meth:`~agen.aclose`. После вызова этого метода цикл событий выдаст предупреждение, если будет запущен новый асинхронный генератор. Это следует использовать для надежной финализации всех запланированных асинхронных генераторов.
pt_pt: Agenda todos os objetos :term:`gerador assíncrono` atualmente abertos para fechar com uma chamada :meth:`~agen.aclose`. Após chamar este método, o ciclo de eventos emitirá um aviso se um novo gerador assíncrono for iterado. Isto deve ser utilizado para finalizar de forma fiável todos os geradores assíncronos agendados.

source: Note that there is no need to call this function when :func:`asyncio.run` is used.
es_es: Tener en cuenta que no es necesario llamar a esta función cuando se utiliza :func:`asyncio.run`.
pt_pt: Note que não é necessário chamar esta função quando :func:`asyncio.run` é utilizado.

source: Example::
es_es: Ejemplo::
pt_pt: Exemplo::

source: Schedule the closure of the default executor and wait for it to join all of the threads in the :class:`~concurrent.futures.ThreadPoolExecutor`. Once this method has been called, using the default executor with :meth:`loop.run_in_executor` will raise a :exc:`RuntimeError`.
es_es: Запланируйте закрытие исполнителя по умолчанию и подождите, пока он присоединится ко всем потокам в :class:`~concurrent.futures.ThreadPoolExecutor`. После вызова этого метода использование исполнителя по умолчанию с :meth:`loop.run_in_executor` вызовет :exc:`RuntimeError`.
pt_pt: Agenda o encerramento do executor padrão e aguarda que este se junte a todas as threads no :class:`~concurrent.futures.ThreadPoolExecutor`. Depois de este método ser chamado, a utilização do executor padrão com :meth:`loop.run_in_executor` levantará um :exc:`RuntimeError`.

source: The *timeout* parameter specifies the amount of time (in :class:`float` seconds) the executor will be given to finish joining. With the default, ``None``, the executor is allowed an unlimited amount of time.
es_es: Параметр *timeout* указывает количество времени (в секундах), которое будет предоставлено исполнителю для завершения присоединения. При значении по умолчанию «Нет» исполнителю разрешено неограниченное количество времени.
pt_pt: O parâmetro *timeout* especifica a quantidade de tempo (em segundos :class:`float`) que o executor terá para terminar a junção. Com o valor predefinido, ``None``, é permitido ao executor um tempo ilimitado.

source: If the *timeout* is reached, a :exc:`RuntimeWarning` is emitted and the default executor is terminated without waiting for its threads to finish joining.
es_es: Если *тайм-аут* достигнут, выдается :exc:`RuntimeWarning` и исполнитель по умолчанию завершается, не дожидаясь завершения соединения своих потоков.
pt_pt: Se o *timeout* for atingido, é emitido um :exc:`RuntimeWarning` e o executor padrão é terminado sem aguardar que as suas threads terminem a junção.

source: Do not call this method when using :func:`asyncio.run`, as the latter handles default executor shutdown automatically.
es_es: Не вызывайте этот метод при использовании :func:`asyncio.run`, поскольку последний автоматически обрабатывает завершение работы исполнителя по умолчанию.
pt_pt: Não chame este método ao utilizar :func:`asyncio.run`, uma vez que este último trata automaticamente do encerramento do executor padrão.

source: Added the *timeout* parameter.
es_es: Добавлен параметр *timeout*.
pt_pt: Adicionado o parâmetro *timeout*.

source: Scheduling callbacks
es_es: Programación de retrollamadas
pt_pt: Agendamento de chamadas de retorno

source: Schedule the *callback* :term:`callback` to be called with *args* arguments at the next iteration of the event loop.
es_es: Programa el *callback* :term:`callback` para ser llamado con argumentos *args* en la siguiente iteración del bucle de eventos.
pt_pt: Agenda a :term:`chamada de retorno` *callback* para ser chamada com os argumentos *args* na próxima iteração do ciclo de eventos.

source: Return an instance of :class:`asyncio.Handle`, which can be used later to cancel the callback.
es_es: Верните экземпляр :class:`asyncio.Handle`, который можно использовать позже для отмены обратного вызова.
pt_pt: Devolve uma instância de :class:`asyncio.Handle`, que pode ser utilizada mais tarde para cancelar a chamada de retorno.

source: Callbacks are called in the order in which they are registered. Each callback will be called exactly once.
es_es: Las retrollamadas se ejecutan en el orden en que se registran. Cada devolución de llamada se llamará exactamente una vez.
pt_pt: As chamadas de retorno são chamadas pela ordem em que são registadas. Cada chamada de retorno será chamada exatamente uma vez.

source: The optional keyword-only *context* argument specifies a custom :class:`contextvars.Context` for the *callback* to run in. Callbacks use the current context when no *context* is provided.
es_es: Необязательный аргумент *context*, содержащий только ключевые слова, указывает пользовательский :class:`contextvars.Context` для выполнения *обратного вызова*. Обратные вызовы используют текущий контекст, если *context* не указан.
pt_pt: O argumento opcional apenas por palavra-chave *context* especifica um :class:`contextvars.Context` personalizado para a *callback* ser executada. As chamadas de retorno utilizam o contexto atual quando nenhum *context* é fornecido.

source: Unlike :meth:`call_soon_threadsafe`, this method is not thread-safe.
es_es: В отличие от :meth:`call_soon_threadsafe`, этот метод не является потокобезопасным.
pt_pt: Ao contrário de :meth:`call_soon_threadsafe`, este método não é seguro para threads.

source: A thread-safe variant of :meth:`call_soon`. When scheduling callbacks from another thread, this function *must* be used, since :meth:`call_soon` is not thread-safe.
es_es: Потокобезопасный вариант :meth:`call_soon`. При планировании обратных вызовов из другого потока эта функция *должна* использоваться, поскольку :meth:`call_soon` не является потокобезопасным.
pt_pt: Uma variante segura para threads de :meth:`call_soon`. Ao agendar chamadas de retorno a partir de outra thread, esta função *deve* ser utilizada, uma vez que :meth:`call_soon` não é seguro para threads.

source: This function is safe to be called from a reentrant context or signal handler, however, it is not safe or fruitful to use the returned handle in such contexts.
es_es: Эту функцию можно безопасно вызывать из реентерабельного контекста или обработчика сигналов, однако использовать возвращаемый дескриптор в таких контекстах небезопасно и непродуктивно.
pt_pt: Esta função é segura para ser chamada a partir de um contexto reentrante ou de um manipulador de sinais, no entanto, não é seguro nem produtivo utilizar o manipulador devolvido nestes contextos.

source: Raises :exc:`RuntimeError` if called on a loop that's been closed. This can happen on a secondary thread when the main application is shutting down.
es_es: Lanza :exc:`RuntimeError` si se llama a un bucle que se ha cerrado. Esto puede ocurrir en un hilo secundario cuando la aplicación principal se está cerrando.
pt_pt: Levanta :exc:`RuntimeError` se chamado num ciclo que foi fechado. Isto pode acontecer numa thread secundária quando a aplicação principal está a encerrar.

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
es_es: Ver la sección :ref:`concurrency and multithreading <asyncio-multithreading>` de la documentación.
pt_pt: Consulte a secção :ref:`concorrência e multithreading <asyncio-multithreading>` da documentação.

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
es_es: Se ha añadido el parámetro *context* de sólo palabra clave. Consultar :pep:`567` para obtener más detalles.
pt_pt: O parâmetro apenas por palavra-chave *context* foi adicionado. Consulte :pep:`567` para mais detalhes.

source: Most :mod:`asyncio` scheduling functions don't allow passing keyword arguments. To do that, use :func:`functools.partial`::
es_es: La mayoría de las funciones de programación de :mod:`asyncio` no permiten pasar argumentos de palabra clave. Para ello, usar :func:`functools.partial`::
pt_pt: A maioria das funções de agendamento :mod:`asyncio` não permite passar argumentos de palavra-chave. Para o fazer, utilize :func:`functools.partial`::

source: Using partial objects is usually more convenient than using lambdas, as asyncio can render partial objects better in debug and error messages.
es_es: Usar objetos parciales suele ser más conveniente que usar lambdas, ya que asyncio puede renderizar mejor los objetos parciales en los mensajes de depuración y error.
pt_pt: A utilização de objetos parciais é geralmente mais conveniente do que a utilização de lambdas, uma vez que o asyncio pode apresentar melhor os objetos parciais em mensagens de depuração e de erro.

source: Scheduling delayed callbacks
es_es: Programación de retrollamadas
pt_pt: Agendamento de chamadas de retorno adiado
