Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-protocol.po
Languages: es_es, pt_pt, sv

source: asyncio provides a set of abstract base classes that should be used to implement network protocols. Those classes are meant to be used together with :ref:`transports <asyncio-transport>`.
es_es: asyncio proporciona un conjunto de clases base abstractas que deben utilizarse para implementar protocolos de red. Esas clases están pensadas para ser utilizadas junto con :ref:`transports <asyncio-transport>`.
pt_pt: O asyncio fornece um conjunto de classes base abstratas que devem ser usadas para implementar protocolos de rede. Essas classes são destinadas a serem usadas em conjunto com :ref:`transportes <asyncio-transport>`.
sv: asyncio tillhandahåller en uppsättning abstrakta basklasser som bör användas för att implementera nätverksprotokoll. Dessa klasser är avsedda att användas tillsammans med :ref:`transports <asyncio-transport>`.

source: Subclasses of abstract base protocol classes may implement some or all methods. All these methods are callbacks: they are called by transports on certain events, for example when some data is received. A base protocol method should be called by the corresponding transport.
es_es: Las subclases de las clases de protocolo base abstractas pueden implementar algunos o todos los métodos. Todos estos métodos son retrollamadas: son llamados por los transportes en determinados eventos, por ejemplo, cuando se recibe algún dato. Un método de protocolo base debe ser llamado por el transporte correspondiente.
pt_pt: Subclasses de classes base de protocolo abstrato podem implementar alguns ou todos os métodos. Todos estes métodos são *callbacks*: são chamados por transportes em certos eventos, por exemplo, quando alguns dados são recebidos. Um método de protocolo base deve ser chamado pelo transporte correspondente.
sv: Underklasser av abstrakta basprotokollklasser kan implementera vissa eller alla metoder. Alla dessa metoder är callbacks: de anropas av transporter vid vissa händelser, t.ex. när data tas emot. En basprotokollmetod bör anropas av motsvarande transport.

source: Base Protocols
es_es: Protocolos base
pt_pt: Protocolos Base
sv: Basprotokoll

source: Base protocol with methods that all protocols share.
es_es: Protocolo base con métodos que comparten todos los protocolos.
pt_pt: Protocolo base com métodos que todos os protocolos partilham.
sv: Basprotokoll med metoder som är gemensamma för alla protokoll.

source: The base class for implementing streaming protocols (TCP, Unix sockets, etc).
es_es: La clase base para implementar protocolos de streaming (TCP, sockets Unix, etc).
pt_pt: A classe base para implementar protocolos de fluxo (TCP, *sockets* Unix, etc.).
sv: Basklassen för implementering av streamingprotokoll (TCP, Unix-sockets, etc).

source: A base class for implementing streaming protocols with manual control of the receive buffer.
es_es: Una clase base para implementar protocolos de streaming con control manual del buffer de recepción.
pt_pt: Uma classe base para implementar protocolos de fluxo com controlo manual do *buffer* de receção.
sv: En basklass för implementering av streamingprotokoll med manuell kontroll av mottagningsbufferten.

source: The base class for implementing datagram (UDP) protocols.
es_es: La clase base para implementar protocolos de datagramas (UDP).
pt_pt: A classe base para implementar protocolos de datagrama (UDP).
sv: Basklassen för implementering av datagram (UDP)-protokoll.

source: The base class for implementing protocols communicating with child processes (unidirectional pipes).
es_es: La clase base para implementar protocolos que se comunican con procesos hijos (tuberías unidireccionales).
pt_pt: A classe base para implementar protocolos que comunicam com processos filhos (pipes unidirecionais).
sv: Basklass för implementering av protokoll som kommunicerar med underordnade processer (enkelriktade pipes).

source: Base Protocol
es_es: Protocolo base
pt_pt: Protocolo Base
sv: Basprotokoll

source: All asyncio protocols can implement Base Protocol callbacks.
es_es: Todos los protocolos asyncio pueden implementar llamadas de retorno del Protocolo Base.
pt_pt: Todos os protocolos asyncio podem implementar *callbacks* de Protocolo Base.
sv: Alla asyncioprotokoll kan implementera Base Protocol callbacks.

source: Connection Callbacks
es_es: Devoluciones de llamada de conexión
pt_pt: *Callbacks* de Ligação
sv: Callbacks för anslutning

source: Connection callbacks are called on all protocols, exactly once per a successful connection. All other protocol callbacks can only be called between those two methods.
es_es: Las retrollamadas de conexión son llamadas en todos los protocolos, exactamente una vez por cada conexión exitosa. Todas las demás retrollamadas de protocolo sólo pueden invocarse entre esos dos métodos.
pt_pt: Os *callbacks* de ligação são chamados em todos os protocolos, exatamente uma vez por ligação bem-sucedida. Todos os outros *callbacks* de protocolo só podem ser chamados entre esses dois métodos.
sv: Connection callbacks anropas på alla protokoll, exakt en gång per lyckad anslutning. Alla andra protokollåterkallelser kan bara anropas mellan dessa två metoder.

source: Called when a connection is made.
es_es: Se activa cuando se establece una conexión.
pt_pt: Chamado quando uma ligação é estabelecida.
sv: Anropas när en anslutning har gjorts.

source: The *transport* argument is the transport representing the connection. The protocol is responsible for storing the reference to its transport.
es_es: El argumento *transport* es el transporte que representa la conexión. El protocolo es responsable de almacenar la referencia a su transporte.
pt_pt: O argumento *transport* é o transporte que representa a ligação. O protocolo é responsável por armazenar a referência ao seu transporte.
sv: Argumentet *transport* är den transport som representerar anslutningen. Protokollet är ansvarigt för att lagra referensen till sin transport.

source: Called when the connection is lost or closed.
es_es: Llamada cuando la conexión se pierde o se cierra.
pt_pt: Chamado quando a ligação é perdida ou fechada.
sv: Anropas när anslutningen bryts eller stängs.

source: The argument is either an exception object or :const:`None`. The latter means a regular EOF is received, or the connection was aborted or closed by this side of the connection.
es_es: El argumento es un objeto de excepción o :const:`None`. Este último significa que se ha recibido un EOF normal, o que la conexión ha sido abortada o cerrada por este lado de la conexión.
pt_pt: O argumento é um objeto de exceção ou :const:`None`. Este último significa que um EOF regular foi recebido, ou que a ligação foi abortada ou fechada por este lado da ligação.
sv: Argumentet är antingen ett undantagsobjekt eller :const:`None`. Det senare innebär att en vanlig EOF tas emot, eller att anslutningen avbröts eller stängdes av den här sidan av anslutningen.

source: Flow Control Callbacks
es_es: Llamadas de retorno de control de flujo
pt_pt: *Callbacks* de Controlo de Fluxo
sv: Återkallelser för flödeskontroll

source: Flow control callbacks can be called by transports to pause or resume writing performed by the protocol.
es_es: Las retrollamadas de control de flujo se pueden invocar por los transportes para pausar o reanudar la escritura realizada por el protocolo.
pt_pt: Os *callbacks* de controlo de fluxo podem ser chamados por transportes para pausar ou retomar a escrita realizada pelo protocolo.
sv: Återanrop för flödeskontroll kan anropas av transporter för att pausa eller återuppta skrivning som utförs av protokollet.

source: See the documentation of the :meth:`~WriteTransport.set_write_buffer_limits` method for more details.
es_es: Para más detalles, ver la documentación del método :meth:`~WriteTransport.set_write_buffer_limits`.
pt_pt: Veja a documentação do método :meth:`~WriteTransport.set_write_buffer_limits` para mais detalhes.
sv: Se dokumentationen för metoden :meth:`~WriteTransport.set_write_buffer_limits` för mer information.

source: Called when the transport's buffer goes over the high watermark.
es_es: Llamada cuando el buffer del transporte sobrepasa la marca de agua alta.
pt_pt: Chamado quando o *buffer* do transporte ultrapassa o limite superior.
sv: Anropas när transportens buffert går över det högsta vattenmärket.

source: Called when the transport's buffer drains below the low watermark.
es_es: Llamada cuando el buffer del transporte se vacía por debajo de la marca de agua baja.
pt_pt: Chamado quando o *buffer* do transporte desce abaixo do limite inferior.
sv: Anropas när transportens buffert töms under lågvattenmärket.

source: If the buffer size equals the high watermark, :meth:`~BaseProtocol.pause_writing` is not called: the buffer size must go strictly over.
es_es: Si el tamaño del búfer es igual a la filigrana digital alta, no se llama a :meth:`~BaseProtocol.pause_writing`: el tamaño del búfer debe superarse estrictamente.
pt_pt: Se o tamanho do *buffer* for igual ao limite superior, :meth:`~BaseProtocol.pause_writing` não é chamado: o tamanho do *buffer* deve ultrapassar estritamente.
sv: Om buffertstorleken är lika med den höga vattenstämpeln anropas inte :meth:`~BaseProtocol.pause_writing`: buffertstorleken måste gå strikt över.

source: Conversely, :meth:`~BaseProtocol.resume_writing` is called when the buffer size is equal or lower than the low watermark. These end conditions are important to ensure that things go as expected when either mark is zero.
es_es: A la inversa, se llama a :meth:`~BaseProtocol.resume_writing` cuando el tamaño del búfer es igual o inferior a la filigrana digital baja. Estas condiciones finales son importantes para asegurar que las cosas van como se espera cuando cualquiera de las marcas es cero.
pt_pt: Por outro lado, :meth:`~BaseProtocol.resume_writing` é chamado quando o tamanho do *buffer* é igual ou inferior ao limite inferior. Estas condições finais são importantes para garantir que as coisas funcionem como esperado quando qualquer um dos limites é zero.
sv: Omvänt anropas :meth:`~BaseProtocol.resume_writing` när buffertstorleken är lika med eller lägre än det låga vattenmärket. Dessa slutvillkor är viktiga för att säkerställa att saker och ting går som förväntat när något av märkena är noll.

source: Streaming Protocols
es_es: Protocolos de streaming
pt_pt: Protocolos de Fluxo
sv: Protokoll för streaming

source: Event methods, such as :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, and :meth:`loop.connect_write_pipe` accept factories that return streaming protocols.
es_es: Los métodos de eventos, como :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, y :meth:`loop.connect_write_pipe` aceptan fábricas que devuelven protocolos de streaming.
pt_pt: Métodos de eventos, como :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, e :meth:`loop.connect_write_pipe` aceitam fábricas que retornam protocolos de fluxo.
sv: Händelsemetoder som :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe` och :meth:`loop.connect_write_pipe` accepterar fabriker som returnerar streamingprotokoll.

source: Called when some data is received. *data* is a non-empty bytes object containing the incoming data.
es_es: Se ejecuta cuando se reciben datos. *data* es un objeto bytes no vacío que contiene los datos recibidos.
pt_pt: Chamado quando alguns dados são recebidos. *data* é um objeto bytes não vazio que contém os dados recebidos.
sv: Anropas när data har tagits emot. *data* är ett icke-tomt bytes-objekt som innehåller inkommande data.

source: Whether the data is buffered, chunked or reassembled depends on the transport. In general, you shouldn't rely on specific semantics and instead make your parsing generic and flexible. However, data is always received in the correct order.
es_es: Que los datos se almacenen en búfer, en trozos o se reensamblen depende del transporte. En general, no se debe depender de una semántica específica y, en su lugar, hacer que el análisis sintáctico sea genérico y flexible. Sin embargo, los datos siempre se reciben en el orden correcto.
pt_pt: Se os dados são colocados em *buffer*, divididos em partes ou remontados depende do transporte. Em geral, não deve confiar em semânticas específicas e, em vez disso, tornar a sua análise genérica e flexível. No entanto, os dados são sempre recebidos na ordem correta.
sv: Om data buffras, delas upp i bitar eller sammanställs på nytt beror på transporten. I allmänhet bör du inte förlita dig på specifik semantik utan i stället göra din parsning generisk och flexibel. Data tas dock alltid emot i rätt ordning.

source: The method can be called an arbitrary number of times while a connection is open.
es_es: El método se puede llamar un número arbitrario de veces mientras una conexión está abierta.
pt_pt: O método pode ser chamado um número arbitrário de vezes enquanto uma ligação estiver aberta.
sv: Metoden kan anropas ett godtyckligt antal gånger medan en anslutning är öppen.

source: However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once. Once ``eof_received()`` is called, ``data_received()`` is not called anymore.
es_es: Sin embargo, :meth:`protocol.eof_received() <Protocol.eof_received>` se llama como máximo una vez. Una vez que se llama a ``eof_received()``, no se vuelve a llamar a ``data_received()``.
pt_pt: No entanto, :meth:`protocol.eof_received() <Protocol.eof_received>` é chamado no máximo uma vez. Depois de ``eof_received()`` ser chamado, ``data_received()`` não é mais chamado.
sv: Men :meth:`protocol.eof_received() <Protocol.eof_received>` anropas högst en gång. När ``eof_received()`` har anropats anropas inte ``data_received()`` längre.

source: Called when the other end signals it won't send any more data (for example by calling :meth:`transport.write_eof() <WriteTransport.write_eof>`, if the other end also uses asyncio).
es_es: Llamada cuando el otro extremo señala que no enviará más datos (por ejemplo llamando a :meth:`transport.write_eof() <WriteTransport.write_eof>`, si el otro extremo también utiliza asyncio).
pt_pt: Chamado quando a outra extremidade sinaliza que não enviará mais dados (por exemplo, chamando :meth:`transport.write_eof() <WriteTransport.write_eof>`, se a outra extremidade também usar asyncio).
sv: Anropas när den andra änden signalerar att den inte kommer att skicka mer data (t.ex. genom att anropa :meth:`transport.write_eof() <WriteTransport.write_eof>`, om den andra änden också använder asyncio).

source: This method may return a false value (including ``None``), in which case the transport will close itself. Conversely, if this method returns a true value, the protocol used determines whether to close the transport. Since the default implementation returns ``None``, it implicitly closes the connection.
es_es: Este método puede devolver un valor falso (incluyendo ``None``), en cuyo caso el transporte se cerrará por sí mismo. Por el contrario, si este método devuelve un valor verdadero, el protocolo utilizado determina si se cierra el transporte. Dado que la implementación por defecto devuelve ``None``, implícitamente cierra la conexión.
pt_pt: Este método pode devolver um valor falso (incluindo ``None``), caso em que o transporte se fechará. Por outro lado, se este método devolver um valor verdadeiro, o protocolo usado determina se deve fechar o transporte. Como a implementação predefinida devolve ``None``, fecha implicitamente a ligação.
sv: Denna metod kan returnera ett falskt värde (inklusive ``None``), i vilket fall transporten kommer att stänga sig själv. Omvänt, om denna metod returnerar ett sant värde, avgör det protokoll som används om transporten ska stängas. Eftersom standardimplementeringen returnerar ``None``, stänger den implicit anslutningen.

source: Some transports, including SSL, don't support half-closed connections, in which case returning true from this method will result in the connection being closed.
es_es: Algunos transportes, incluyendo SSL, no soportan conexiones semicerradas, en cuyo caso devolver true desde este método resultará en el cierre de la conexión.
pt_pt: Alguns transportes, incluindo SSL, não suportam ligações semi-fechadas, caso em que devolver verdadeiro deste método resultará no fechamento da ligação.
sv: Vissa transporter, inklusive SSL, stöder inte halvstängda anslutningar, i vilket fall returnering av true från denna metod kommer att resultera i att anslutningen stängs.

source: State machine:
es_es: Máquina de estados:
pt_pt: Máquina de estados:
sv: Statlig maskin:

source: Buffered Streaming Protocols
es_es: Protocolos de transmisión en búfer
pt_pt: Protocolos de fluxo com *buffer*
sv: Protokoll för buffrad strömning

source: Buffered Protocols can be used with any event loop method that supports `Streaming Protocols`_.
es_es: Los protocolos en búfer pueden utilizarse con cualquier método de bucle de eventos que admita `Streaming Protocols`_.
pt_pt: Protocolos com *Buffer* podem ser usados com qualquer método de ciclo de eventos que suporte `Protocolos de Fluxo`_.
sv: Buffrade protokoll kan användas med alla metoder för händelseslingor som stöder `Streaming Protocols`_.

source: ``BufferedProtocol`` implementations allow explicit manual allocation and control of the receive buffer. Event loops can then use the buffer provided by the protocol to avoid unnecessary data copies. This can result in noticeable performance improvement for protocols that receive big amounts of data. Sophisticated protocol implementations can significantly reduce the number of buffer allocations.
es_es: ``BufferedProtocol`` permiten la asignación manual explícita y el control del búfer de recepción. Los bucles de eventos pueden entonces utilizar el búfer proporcionado por el protocolo para evitar copias innecesarias de datos. Esto puede mejorar notablemente el rendimiento de los protocolos que reciben grandes cantidades de datos. Las implementaciones sofisticadas de protocolos pueden reducir significativamente el número de asignaciones de búfer.
pt_pt: As implementações de ``BufferedProtocol`` permitem alocação manual explícita e controlo do *buffer* de receção. Os ciclos de eventos podem então usar o *buffer* fornecido pelo protocolo para evitar cópias de dados desnecessárias. Isto pode resultar em melhorias de desempenho notáveis para protocolos que recebem grandes quantidades de dados. Implementações sofisticadas de protocolos podem reduzir significativamente o número de alocações de *buffer*.
sv: implementeringar av ``BufferedProtocol`` tillåter explicit manuell tilldelning och kontroll av mottagningsbufferten. Händelseslingor kan då använda den buffert som tillhandahålls av protokollet för att undvika onödiga datakopior. Detta kan resultera i märkbara prestandaförbättringar för protokoll som tar emot stora mängder data. Sofistikerade protokollimplementeringar kan avsevärt minska antalet buffertallokeringar.

source: The following callbacks are called on :class:`BufferedProtocol` instances:
es_es: Las siguientes llamadas de retorno se ejecutan en las instancias de :class:`BufferedProtocol`:
pt_pt: Os seguintes *callbacks* são chamados em instâncias de :class:`BufferedProtocol`:
sv: Följande callbacks anropas på :class:`BufferedProtocol`\-instanser:

source: Called to allocate a new receive buffer.
es_es: Llamada para asignar un nuevo búfer de recepción.
pt_pt: Chamado para alocar um novo *buffer* de receção.
sv: Anropas för att allokera en ny mottagningsbuffert.

source: *sizehint* is the recommended minimum size for the returned buffer. It is acceptable to return smaller or larger buffers than what *sizehint* suggests. When set to -1, the buffer size can be arbitrary. It is an error to return a buffer with a zero size.
es_es: *sizehint* es el tamaño mínimo recomendado para el búfer devuelto. Es aceptable devolver búferes más pequeños o más grandes que lo que *sizehint* sugiere. Cuando se establece a -1, el tamaño del búfer puede ser arbitrario. Es un error devolver un buffer con tamaño cero.
pt_pt: *sizehint* é o tamanho mínimo recomendado para o *buffer* devolvido. É aceitável devolver *buffers* menores ou maiores do que o sugerido por *sizehint*. Quando definido como -1, o tamanho do *buffer* pode ser arbitrário. É um erro devolver um *buffer* com tamanho zero.
sv: *sizehint* är den rekommenderade minimistorleken för den returnerade bufferten. Det är acceptabelt att returnera mindre eller större buffertar än vad *sizehint* föreslår. När den är satt till -1 kan buffertstorleken vara godtycklig. Det är ett fel att returnera en buffert med noll i storlek.

source: ``get_buffer()`` must return an object implementing the :ref:`buffer protocol <bufferobjects>`.
es_es: ``get_buffer()`` debe devolver un objeto que implemente :ref:`buffer protocol <bufferobjects>`.
pt_pt: ``get_buffer()`` deve devolver um objeto que implemente o :ref:`protocolo de buffer <bufferobjects>`.
sv: ``get_buffer()`` måste returnera ett objekt som implementerar :ref:`buffer protocol <bufferobjects>`.

source: Called when the buffer was updated with the received data.
es_es: Llamada cuando se actualizó el buffer con los datos recibidos.
pt_pt: Chamado quando o *buffer* foi atualizado com os dados recebidos.
sv: Anropas när bufferten har uppdaterats med de mottagna uppgifterna.

source: *nbytes* is the total number of bytes that were written to the buffer.
es_es: *nbytes* es el número total de bytes que se han escrito en el búfer.
pt_pt: *nbytes* é o número total de bytes que foram escritos no *buffer*.
sv: *nbytes* är det totala antalet bytes som skrevs till bufferten.

source: See the documentation of the :meth:`protocol.eof_received() <Protocol.eof_received>` method.
es_es: Ver la documentación del método :meth:`protocol.eof_received() <Protocol.eof_received>`.
pt_pt: Veja a documentação do método :meth:`protocol.eof_received() <Protocol.eof_received>`.
sv: Se dokumentationen för metoden :meth:`protocol.eof_received() <Protocol.eof_received>`.

source: :meth:`~BufferedProtocol.get_buffer` can be called an arbitrary number of times during a connection. However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once and, if called, :meth:`~BufferedProtocol.get_buffer` and :meth:`~BufferedProtocol.buffer_updated` won't be called after it.
es_es: :meth:`~BufferedProtocol.get_buffer` puede ser llamado un número arbitrario de veces durante una conexión. Sin embargo, :meth:`protocol.eof_received() <Protocol.eof_received>` se llama como máximo una vez y, si se llama, :meth:`~BufferedProtocol.get_buffer` y :meth:`~BufferedProtocol.buffer_updated` no se llamarán después.
pt_pt: :meth:`~BufferedProtocol.get_buffer` pode ser chamado um número arbitrário de vezes durante uma ligação. No entanto, :meth:`protocol.eof_received() <Protocol.eof_received>` é chamado no máximo uma vez e, se chamado, :meth:`~BufferedProtocol.get_buffer` e :meth:`~BufferedProtocol.buffer_updated` não serão chamados depois disso.
sv: :meth:`~BufferedProtocol.get_buffer` kan anropas ett godtyckligt antal gånger under en anslutning. Men :meth:`protocol.eof_received() <Protocol.eof_received>` anropas högst en gång och om den anropas kommer :meth:`~BufferedProtocol.get_buffer` och :meth:`~BufferedProtocol.buffer_updated` inte att anropas efter den.
