Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-protocol.po
Languages: es_es, pt_pt, sv

source: Datagram Protocols
es_es: Protocolos de datagramas
pt_pt: Protocolos de datagrama
sv: Datagram-protokoll

source: Datagram Protocol instances should be constructed by protocol factories passed to the :meth:`loop.create_datagram_endpoint` method.
es_es: Las instancias del Protocolo de Datagramas deben ser construidas por fábricas de protocolo pasadas al método :meth:`loop.create_datagram_endpoint`.
pt_pt: Instâncias de Protocolo de Datagrama devem ser construídas por fábricas de protocolos passadas ao método :meth:`loop.create_datagram_endpoint`.
sv: Datagram-protokollinstanser bör konstrueras av protokollfabriker som skickas till metoden :meth:`loop.create_datagram_endpoint`.

source: Called when a datagram is received. *data* is a bytes object containing the incoming data. *addr* is the address of the peer sending the data; the exact format depends on the transport.
es_es: Se ejecuta cuando se recibe un datagrama. *data* es un objeto bytes que contiene los datos entrantes. *addr* es la dirección del par que envía los datos; el formato exacto depende del transporte.
pt_pt: Chamado quando um datagrama é recebido. *data* é um objeto bytes que contém os dados recebidos. *addr* é o endereço do par que envia os dados; o formato exato depende do transporte.
sv: Anropas när ett datagram tas emot. *data* är ett bytes-objekt som innehåller inkommande data. *addr* är adressen till den peer som skickar data; det exakta formatet beror på transportmedlet.

source: Called when a previous send or receive operation raises an :class:`OSError`. *exc* is the :class:`OSError` instance.
es_es: Llamada cuando una operación previa de envío o recepción genera un :class:`OSError`. *exc* es la instancia de :class:`OSError`.
pt_pt: Chamado quando uma operação de envio ou receção anterior gera um :class:`OSError`. *exc* é a instância de :class:`OSError`.
sv: Anropas när en tidigare sändnings- eller mottagningsoperation ger upphov till ett :class:`OSError`. *exc* är en instans av :class:`OSError`.

source: This method is called in rare conditions, when the transport (e.g. UDP) detects that a datagram could not be delivered to its recipient. In many conditions though, undeliverable datagrams will be silently dropped.
es_es: Este método se ejecuta en raras ocasiones, cuando el transporte (por ejemplo, UDP) detecta que un datagrama no ha podido entregarse a su destinatario. Sin embargo, en muchos casos, los datagramas que no se pueden entregar se descartan silenciosamente.
pt_pt: Este método é chamado em condições raras, quando o transporte (por exemplo, UDP) deteta que um datagrama não pôde ser entregue ao seu destinatário. No entanto, em muitas condições, datagramas não entregáveis serão descartados silenciosamente.
sv: Denna metod anropas i sällsynta fall när transporten (t.ex. UDP) upptäcker att ett datagram inte kunde levereras till mottagaren. Under många förhållanden kommer dock datagram som inte kan levereras att släppas i tysthet.

source: On BSD systems (macOS, FreeBSD, etc.) flow control is not supported for datagram protocols, because there is no reliable way to detect send failures caused by writing too many packets.
es_es: En sistemas BSD (macOS, FreeBSD, etc.) el control de flujo no está soportado para protocolos de datagramas, porque no hay una forma fiable de detectar fallos de envío causados por la escritura de demasiados paquetes.
pt_pt: Em sistemas BSD (macOS, FreeBSD, etc.), o controlo de fluxo não é suportado para protocolos de datagrama, porque não há uma forma fiável de detetar falhas de envio causadas pela escrita de demasiados pacotes.
sv: På BSD-system (macOS, FreeBSD etc.) stöds inte flödeskontroll för datagramprotokoll, eftersom det inte finns något tillförlitligt sätt att upptäcka sändningsfel som orsakas av att för många paket skrivs.

source: The socket always appears 'ready' and excess packets are dropped. An :class:`OSError` with ``errno`` set to :const:`errno.ENOBUFS` may or may not be raised; if it is raised, it will be reported to :meth:`DatagramProtocol.error_received` but otherwise ignored.
es_es: El socket siempre aparece 'ready' y los paquetes sobrantes se descartan. Un :class:`OSError` con ``errno`` ajustado a :const:`errno.ENOBUFS` puede o no ser levantado; si es levantado, será reportado a :meth:`DatagramProtocol.error_received` pero de lo contrario será ignorado.
pt_pt: O *socket* parece sempre 'pronto' e os pacotes em excesso são descartados. Um :class:`OSError` com ``errno`` definido para :const:`errno.ENOBUFS` pode ou não ser gerado; se for gerado, será reportado a :meth:`DatagramProtocol.error_received`, mas de outra forma será ignorado.
sv: Uttaget verkar alltid "klart" och överflödiga paket släpps. Ett :class:`OSError` med ``errno`` satt till :const:`errno.ENOBUFS` kan eller inte kan uppstå; om det uppstår kommer det att rapporteras till :meth:`DatagramProtocol.error_received` men annars ignoreras.

source: Subprocess Protocols
es_es: Protocolos de subprocesos
pt_pt: Protocolos de subprocesso
sv: Protokoll för delprocesser

source: Subprocess Protocol instances should be constructed by protocol factories passed to the :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
es_es: Las instancias de Protocolo de Subproceso deben construirse por la automatización de protocolos pasadas a los métodos :meth:`loop.subprocess_exec` y :meth:`loop.subprocess_shell`.
pt_pt: Instâncias de Protocolo de Subprocesso devem ser construídas por fábricas de protocolos passadas aos métodos :meth:`loop.subprocess_exec` e :meth:`loop.subprocess_shell`.
sv: Subprocessprotokollinstanser bör konstrueras av protokollfabriker som skickas till metoderna :meth:`loop.subprocess_exec` och :meth:`loop.subprocess_shell`.

source: Called when the child process writes data into its stdout or stderr pipe.
es_es: Llamada cuando el proceso hijo escribe datos en su tubería stdout o stderr.
pt_pt: Chamado quando o processo filho escreve dados no seu *pipe* de stdout ou stderr.
sv: Anropas när barnprocessen skriver data till sin stdout- eller stderr-pipeline.

source: *fd* is the integer file descriptor of the pipe.
es_es: *fd* es el descriptor de fichero entero de la tubería.
pt_pt: *fd* é o descritor de ficheiro inteiro do *pipe*.
sv: *fd* är pipens filbeskrivare i heltal.

source: *data* is a non-empty bytes object containing the received data.
es_es: *data* es un objeto bytes no vacío que contiene los datos recibidos.
pt_pt: *data* é um objeto bytes não vazio que contém os dados recebidos.
sv: *data* är ett icke-tomt bytesobjekt som innehåller de mottagna data.

source: Called when one of the pipes communicating with the child process is closed.
es_es: Llamada cuando se cierra una de las tuberías que comunica con el proceso hijo.
pt_pt: Chamado quando um dos *pipes* que comunicam com o processo filho é fechado.
sv: Anropas när ett av de rör som kommunicerar med barnprocessen stängs.

source: *fd* is the integer file descriptor that was closed.
es_es: *fd* es el descriptor de archivo entero que se cerró.
pt_pt: *fd* é o descritor de ficheiro inteiro que foi fechado.
sv: *fd* är den heltalsfilsbeskrivare som stängdes.

source: Called when the child process has exited.
es_es: Llamada cuando el proceso hijo ha salido.
pt_pt: Chamado quando o processo filho terminou.
sv: Anropas när den underordnade processen har avslutats.

source: It can be called before :meth:`~SubprocessProtocol.pipe_data_received` and :meth:`~SubprocessProtocol.pipe_connection_lost` methods.
es_es: Puede invocarse antes de los métodos :meth:`~SubprocessProtocol.pipe_data_received` y :meth:`~SubprocessProtocol.pipe_connection_lost`.

source: Examples
es_es: Ejemplos
pt_pt: Exemplos
sv: Exempel

source: TCP Echo Server
es_es: Servidor Eco TCP
pt_pt: Servidor TCP Echo

source: Create a TCP echo server using the :meth:`loop.create_server` method, send back received data, and close the connection::
es_es: Crear un servidor eco TCP utilizando el método :meth:`loop.create_server`, devolver los datos recibidos y cerrar la conexión::
pt_pt: Criar um servidor TCP echo usando o método :meth:`loop.create_server`, enviar de volta os dados recebidos e fechar a ligação:
sv: Skapa en TCP-ekoserver med hjälp av metoden :meth:`loop.create_server`, skicka tillbaka mottagna data och stäng anslutningen::

source: The :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` example uses the high-level :func:`asyncio.start_server` function.
es_es: El ejemplo :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` utiliza la función de alto nivel :func:`asyncio.start_server`.
pt_pt: O exemplo :ref:`servidor TCP echo usando fluxos <asyncio-tcp-echo-server-streams>` usa a função de alto nível :func:`asyncio.start_server`.
sv: I exemplet :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` används funktionen :func:`asyncio.start_server` på hög nivå.

source: TCP Echo Client
es_es: Cliente Eco TCP
pt_pt: Cliente TCP Echo
sv: TCP Echo-klient

source: A TCP echo client using the :meth:`loop.create_connection` method, sends data, and waits until the connection is closed::
es_es: Un cliente eco TCP que utiliza el método :meth:`loop.create_connection`, envía datos y espera a que se cierre la conexión::
pt_pt: Um cliente TCP echo usando o método :meth:`loop.create_connection`, envia dados e espera até que a ligação seja fechada:
sv: En TCP-ekoklient som använder metoden :meth:`loop.create_connection`, skickar data och väntar tills anslutningen stängs::

source: import asyncio class EchoClientProtocol(asyncio.Protocol): def __init__(self, message, on_con_lost): self.message = message self.on_con_lost = on_con_lost def connection_made(self, transport): transport.write(self.message.encode()) print('Data sent: {!r}'.format(self.message)) def data_received(self, data): print('Data received: {!r}'.format(data.decode())) def connection_lost(self, exc): print('The server closed the connection') self.on_con_lost.set_result(True) async def main(): # Get a reference to the event loop as we plan to use # low-level APIs. loop = asyncio.get_running_loop() on_con_lost = loop.create_future() message = 'Hello World!' transport, protocol = await loop.create_connection( lambda: EchoClientProtocol(message, on_con_lost), '127.0.0.1', 8888) # Wait until the protocol signals that the connection # is lost and close the transport. try: await on_con_lost finally: transport.close() asyncio.run(main())
es_es: import asyncio class EchoClientProtocol(asyncio.Protocol): def __init__(self, message, on_con_lost): self.message = message self.on_con_lost = on_con_lost def connection_made(self, transport): transport.write(self.message.encode()) print('Data sent: {!r}'.format(self.message)) def data_received(self, data): print('Data received: {!r}'.format(data.decode())) def connection_lost(self, exc): print('The server closed the connection') self.on_con_lost.set_result(True) async def main(): # Obtener una referencia al bucle de eventos que planeamos usar # API de bajo nivel. loop = asyncio.get_running_loop() on_con_lost = loop.create_future() message = '¡Hola Mundo!' transport, protocol = await loop.create_connection( lambda: EchoClientProtocol(message, on_con_lost), '127.0.0.1', 8888) # Esperar hasta que el protocolo indique que la conexión # se pierde y cierra el transporte. probar: await on_con_lost por último: transport.close() asyncio.run(main())

source: The :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` example uses the high-level :func:`asyncio.open_connection` function.
es_es: El ejemplo :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` utiliza la función de alto nivel :func:`asyncio.open_connection`.
pt_pt: O exemplo :ref:`cliente TCP echo usando fluxos <asyncio-tcp-echo-client-streams>` usa a função de alto nível :func:`asyncio.open_connection`.
sv: I exemplet :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` används högnivåfunktionen :func:`asyncio.open_connection`.

source: UDP Echo Server
es_es: Servidor Eco UDP
pt_pt: Servidor UDP Echo

source: A UDP echo server, using the :meth:`loop.create_datagram_endpoint` method, sends back received data::
es_es: Un servidor eco UDP, utilizando el método :meth:`loop.create_datagram_endpoint`, devuelve los datos recibidos::
pt_pt: Um servidor UDP echo, usando o método :meth:`loop.create_datagram_endpoint`, envia de volta os dados recebidos:
sv: En UDP-ekoserver, som använder metoden :meth:`loop.create_datagram_endpoint`, skickar tillbaka mottagna data::

source: UDP Echo Client
es_es: Cliente Eco UDP
pt_pt: Cliente UDP Echo
sv: UDP Echo-klient

source: A UDP echo client, using the :meth:`loop.create_datagram_endpoint` method, sends data and closes the transport when it receives the answer::
es_es: Un cliente eco UDP, utilizando el método :meth:`loop.create_datagram_endpoint`, envía datos y cierra el transporte cuando recibe la respuesta::
sv: En UDP-eko-klient, som använder metoden :meth:`loop.create_datagram_endpoint`, skickar data och stänger transporten när den får svaret::

source: import asyncio class EchoClientProtocol: def __init__(self, message, on_con_lost): self.message = message self.on_con_lost = on_con_lost self.transport = None def connection_made(self, transport): self.transport = transport print('Send:', self.message) self.transport.sendto(self.message.encode()) def datagram_received(self, data, addr): print("Received:", data.decode()) print("Close the socket") self.transport.close() def error_received(self, exc): print('Error received:', exc) def connection_lost(self, exc): print("Connection closed") self.on_con_lost.set_result(True) async def main(): # Get a reference to the event loop as we plan to use # low-level APIs. loop = asyncio.get_running_loop() on_con_lost = loop.create_future() message = "Hello World!" transport, protocol = await loop.create_datagram_endpoint( lambda: EchoClientProtocol(message, on_con_lost), remote_addr=('127.0.0.1', 9999)) try: await on_con_lost finally: transport.close() asyncio.run(main())
es_es: import asyncio class EchoClientProtocol: def __init__(self, message, on_con_lost): self.message = message self.on_con_lost = on_con_lost self.transport = None def connection_made(self, transport): self.transport = transport print('Send:', self.message) self.transport.sendto(self.message.encode()) def datagram_received(self, data, addr): print("Received:", data.decode()) print("Close the socket") self.transport.close() def error_received(self, exc): print('Error received:', exc) def connection_lost(self, exc): print("Connection closed") self.on_con_lost.set_result(True) async def main(): # Obtener una referencia al bucle de eventos que planeamos usar # API de bajo nivel. loop = asyncio.get_running_loop() on_con_lost = loop.create_future() message = "Hello World!" transport, protocol = await loop.create_datagram_endpoint( lambda: EchoClientProtocol(message, on_con_lost), remote_addr=('127.0.0.1', 9999)) try: await on_con_lost finally: transport.close() asyncio.run(main())

source: Connecting Existing Sockets
es_es: Conexión de tomas existentes
pt_pt: Ligar *Sockets* Existentes
sv: Anslutning av befintliga uttag

source: Wait until a socket receives data using the :meth:`loop.create_connection` method with a protocol::
es_es: Esperar hasta que un socket recibe datos utilizando el método :meth:`loop.create_connection` con un protocolo::
pt_pt: Esperar até que um *socket* receba dados usando o método :meth:`loop.create_connection` com um protocolo:
sv: Vänta tills ett uttag tar emot data med hjälp av metoden :meth:`loop.create_connection` med protokollet::

source: import asyncio import socket class MyProtocol(asyncio.Protocol): def __init__(self, on_con_lost): self.transport = None self.on_con_lost = on_con_lost def connection_made(self, transport): self.transport = transport def data_received(self, data): print("Received:", data.decode()) # We are done: close the transport; # connection_lost() will be called automatically. self.transport.close() def connection_lost(self, exc): # The socket has been closed self.on_con_lost.set_result(True) async def main(): # Get a reference to the event loop as we plan to use # low-level APIs. loop = asyncio.get_running_loop() on_con_lost = loop.create_future() # Create a pair of connected sockets rsock, wsock = socket.socketpair() # Register the socket to wait for data. transport, protocol = await loop.create_connection( lambda: MyProtocol(on_con_lost), sock=rsock) # Simulate the reception of data from the network. loop.call_soon(wsock.send, 'abc'.encode()) try: await protocol.on_con_lost finally: transport.close() wsock.close() asyncio.run(main())
es_es: import asyncio import socket class MyProtocol(asyncio.Protocol): def __init__(self, on_con_lost): self.transport = None self.on_con_lost = on_con_lost def connection_made(self, transport): self.transport = transport def data_received(self, data): print("Received:", data.decode()) # Hemos terminado: cerrar el transporte; # connection_lost () se llamará automáticamente. self.transport.close() def connection_lost(self, exc): # The socket has been closed self.on_con_lost.set_result(True) async def main(): # Obtener una referencia al bucle de eventos que planeamos usar # API de bajo nivel. loop = asyncio.get_running_loop() on_con_lost = loop.create_future() # Create a pair of connected sockets rsock, wsock = socket.socketpair() # Registrar el socket para esperar datos. transport, protocol = await loop.create_connection( lambda: MyProtocol(on_con_lost), sock=rsock) # Simular la recepción de datos de la red. loop.call_soon(wsock.send, 'abc'.encode()) try: await protocol.on_con_lost finally: transport.close() wsock.close() asyncio.run(main())

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to register an FD.
es_es: El ejemplo :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` utiliza el método de bajo nivel :meth:`loop.add_reader` para registrar un FD.
pt_pt: O exemplo :ref:`observar um descritor de ficheiro para eventos de leitura <asyncio_example_watch_fd>` usa o método de baixo nível :meth:`loop.add_reader` para registar um FD.
sv: I exemplet :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` används lågnivåmetoden :meth:`loop.add_reader` för att registrera en FD.

source: The :ref:`register an open socket to wait for data using streams <asyncio_example_create_connection-streams>` example uses high-level streams created by the :func:`open_connection` function in a coroutine.
es_es: El ejemplo :ref:`register an open socket to wait for data using streams <asyncio_example_create_connection-streams>` utiliza flujos de alto nivel creados por la función :func:`open_connection` en una corrutina.
pt_pt: O exemplo :ref:`registar um socket aberto para esperar por dados usando fluxos <asyncio_example_create_connection-streams>` usa fluxos de alto nível criados pela função :func:`open_connection` numa corrotina.
sv: I exemplet :ref:`registrera ett öppet uttag för att vänta på data med hjälp av strömmar <asyncio_example_create_connection-streams>` används strömmar på hög nivå som skapas av funktionen :func:`open_connection` i en coroutine.

source: loop.subprocess_exec() and SubprocessProtocol
es_es: loop.subprocess_exec() y SubprocessProtocol
pt_pt: loop.subprocess_exec() e SubprocessProtocol
sv: loop.subprocess_exec() och SubprocessProtocol

source: An example of a subprocess protocol used to get the output of a subprocess and to wait for the subprocess exit.
es_es: Un ejemplo de protocolo de subproceso utilizado para obtener la salida de un subproceso y esperar la salida del subproceso.
pt_pt: Um exemplo de um protocolo de subprocesso usado para obter a saída de um subprocesso e para esperar pela saída do subprocesso.
sv: Ett exempel på ett subprocessprotokoll som används för att få utdata från en subprocess och för att vänta på att subprocessen ska avslutas.

source: The subprocess is created by the :meth:`loop.subprocess_exec` method::
es_es: Se crea el subproceso mediante el método :meth:`loop.subprocess_exec`::
pt_pt: O subprocesso é criado pelo método :meth:`loop.subprocess_exec`:
sv: Subprocessen skapas med metoden :meth:`loop.subprocess_exec`::

source: import asyncio import sys class DateProtocol(asyncio.SubprocessProtocol): def __init__(self, exit_future): self.exit_future = exit_future self.output = bytearray() self.pipe_closed = False self.exited = False def pipe_connection_lost(self, fd, exc): self.pipe_closed = True self.check_for_exit() def pipe_data_received(self, fd, data): self.output.extend(data) def process_exited(self): self.exited = True # process_exited() method can be called before # pipe_connection_lost() method: wait until both methods are # called. self.check_for_exit() def check_for_exit(self): if self.pipe_closed and self.exited: self.exit_future.set_result(True) async def get_date(): # Get a reference to the event loop as we plan to use # low-level APIs. loop = asyncio.get_running_loop() code = 'import datetime; print(datetime.datetime.now())' exit_future = asyncio.Future(loop=loop) # Create the subprocess controlled by DateProtocol; # redirect the standard output into a pipe. transport, protocol = await loop.subprocess_exec( lambda: DateProtocol(exit_future), sys.executable, '-c', code, stdin=None, stderr=None) # Wait for the subprocess exit using the process_exited() # method of the protocol. await exit_future # Close the stdout pipe. transport.close() # Read the output which was collected by the # pipe_data_received() method of the protocol. data = bytes(protocol.output) return data.decode('ascii').rstrip() date = asyncio.run(get_date()) print(f"Current date: {date}")
es_es: import asyncio import sys class DateProtocol(asyncio.SubprocessProtocol): def __init__(self, exit_future): self.exit_future = exit_future self.output = bytearray() self.pipe_closed = False self.exited = False def pipe_connection_lost(self, fd, exc): self.pipe_closed = True self.check_for_exit() def pipe_data_received(self, fd, data): self.output.extend(data) def process_exited(self): self.exited = True # el método process_exited() se puede llamar antes # pipe_connection_lost (): espere hasta que ambos se llamen ambos # métodos. self.check_for_exit() def check_for_exit(self): if self.pipe_closed and self.exited: self.exit_future.set_result(True) async def get_date(): # Obtener una referencia al bucle de eventos que planeamos usar # API de bajo nivel. loop = asyncio.get_running_loop() code = 'import datetime; print(datetime.datetime.now())' exit_future = asyncio.Future(loop=loop) # Crear el subproceso controlado por protocolo de datos; # redirigir la salida estándar a una tubería. transporte, protocolo = await loop.subprocess_exec( lambda: DateProtocol(exit_future), sys.executable, '-c', code, stdin=None, stderr=None) # Esperar a que el subproceso salga usando # el método del protocolo process_exited() esperar exit_future # Cerrar la tubería de salida stdout. transport.close() # Leer la salida recopilada por el # método pipe_data_received() del protocolo. data = bytes(protocol.output) return data.decode('ascii').rstrip() date = asyncio.run(get_date()) print(f"Current date: {date}")

source: See also the :ref:`same example <asyncio_example_create_subprocess_exec>` written using high-level APIs.
es_es: Ver también el :ref:`same example <asyncio_example_create_subprocess_exec>` escrito con API de alto nivel.
pt_pt: Veja também o :ref:`mesmo exemplo <asyncio_example_create_subprocess_exec>` escrito usando APIs de alto nível.
sv: Se även :ref:`samme exempel <asyncio_example_create_subprocess_exec>` skrivet med hjälp av API:er på hög nivå.
