Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: es_es, pt_pt

source: Return ``True`` if the server is accepting new connections.
es_es: Devuelve ``True`` si el servidor está aceptando nuevas conexiones.
pt_pt: Devolve ``True`` se o servidor estiver a aceitar novas ligações.

source: Wait until the :meth:`close` method completes and all active connections have finished.
es_es: Подождите, пока метод :meth:`close` завершится и все активные соединения не завершится.
pt_pt: Aguarda até que o método :meth:`close` seja concluído e todas as ligações ativas tenham terminado.

source: List of socket-like objects, ``asyncio.trsock.TransportSocket``, which the server is listening on.
es_es: Список объектов, подобных сокетам, asyncio.trsock.TransportSocket, которые прослушивает сервер.
pt_pt: Lista de objetos tipo socket, ``asyncio.trsock.TransportSocket``, nos quais o servidor está à escuta.

source: Prior to Python 3.7 ``Server.sockets`` used to return an internal list of server sockets directly. In 3.7 a copy of that list is returned.
es_es: Antes de Python 3.7 ``Server.sockets`` devolvía directamente una lista interna de sockets del servidor. En 3.7 se devuelve una copia de esa lista.
pt_pt: Antes do Python 3.7, ``Server.sockets`` devolvia diretamente uma lista interna de sockets do servidor. A partir do 3.7, é devolvida uma cópia dessa lista.

source: Event Loop Implementations
es_es: Implementación de bucles de eventos
pt_pt: Implementações do Ciclo de Eventos

source: asyncio ships with two different event loop implementations: :class:`SelectorEventLoop` and :class:`ProactorEventLoop`.
es_es: asyncio incluye dos implementaciones diferentes de bucles de eventos: :class:`SelectorEventLoop` y :class:`ProactorEventLoop`.
pt_pt: O asyncio inclui duas implementações diferentes de ciclo de eventos: :class:`SelectorEventLoop` e :class:`ProactorEventLoop`.

source: By default asyncio is configured to use :class:`EventLoop`.
es_es: По умолчанию asyncio настроен на использование :class:`EventLoop`.

source: A subclass of :class:`AbstractEventLoop` based on the :mod:`selectors` module.
es_es: Подкласс :class:`AbstractEventLoop`, основанный на модуле :mod:`selectors`.

source: Uses the most efficient *selector* available for the given platform. It is also possible to manually configure the exact selector implementation to be used::
es_es: Utiliza el *selector* más eficiente disponible para la plataforma dada. También es posible configurar manualmente la implementación exacta del selector que se va a utilizar::
pt_pt: Utiliza o *selector* mais eficiente disponível para a plataforma dada. Também é possível configurar manualmente a implementação exata do selector a ser utilizada::

source: A subclass of :class:`AbstractEventLoop` for Windows that uses "I/O Completion Ports" (IOCP).
es_es: Подкласс :class:`AbstractEventLoop` для Windows, который использует «Порты завершения ввода-вывода» (IOCP).

source: `MSDN documentation on I/O Completion Ports <https://learn.microsoft.com/windows/win32/fileio/i-o-completion-ports>`_.
es_es: `Документация MSDN по портам завершения ввода-вывода <https://learn.microsoft.com/windows/win32/fileio/io-completion-ports>`_.
pt_pt: `Documentação MSDN sobre Portas de Conclusão de E/S <https://learn.microsoft.com/windows/win32/fileio/i-o-completion-ports>`_._

source: An alias to the most efficient available subclass of :class:`AbstractEventLoop` for the given platform.
es_es: Псевдоним наиболее эффективного доступного подкласса :class:`AbstractEventLoop` для данной платформы.

source: It is an alias to :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
es_es: Это псевдоним :class:`SelectorEventLoop` в Unix и :class:`ProactorEventLoop` в Windows.

source: Abstract base class for asyncio-compliant event loops.
es_es: Clase base abstracta para bucles de eventos compatibles con asyncio.
pt_pt: Classe base abstrata para ciclos de eventos compatíveis com asyncio.

source: The :ref:`asyncio-event-loop-methods` section lists all methods that an alternative implementation of ``AbstractEventLoop`` should have defined.
es_es: В разделе :ref:`asyncio-event-loop-methods` перечислены все методы, которые должна была определить альтернативная реализация ``AbstractEventLoop``.
pt_pt: A secção :ref:`asyncio-event-loop-methods` lista todos os métodos que uma implementação alternativa de ``AbstractEventLoop`` deve ter definido.

source: Examples
es_es: Ejemplos
pt_pt: Exemplos

source: Note that all examples in this section **purposefully** show how to use the low-level event loop APIs, such as :meth:`loop.run_forever` and :meth:`loop.call_soon`. Modern asyncio applications rarely need to be written this way; consider using the high-level functions like :func:`asyncio.run`.
es_es: Ten en cuenta que todos los ejemplos de esta sección muestran **a propósito** cómo utilizar las APIs de bucle de eventos de bajo nivel, como :meth:`loop.run_forever` y :meth:`loop.call_soon`. Las aplicaciones asyncio modernas raramente necesitan ser escritas de esta manera; considera usar las funciones de alto nivel como :func:`asyncio.run`.
pt_pt: Note que todos os exemplos nesta secção mostram **intencionalmente** como utilizar as APIs de baixo nível do ciclo de eventos, como :meth:`loop.run_forever` e :meth:`loop.call_soon`. As aplicações modernas asyncio raramente precisam de ser escritas desta forma; considere utilizar funções de alto nível como :func:`asyncio.run`.

source: Hello World with call_soon()
es_es: Hola Mundo con call_soon()
pt_pt: Olá Mundo com call_soon()

source: An example using the :meth:`loop.call_soon` method to schedule a callback. The callback displays ``"Hello World"`` and then stops the event loop::
es_es: Un ejemplo usando el método :meth:`loop.call_soon` para programar un callback. La devolución de llamada muestra ``"Hello World"`` y luego detiene el bucle de eventos::
pt_pt: Um exemplo que utiliza o método :meth:`loop.call_soon` para agendar uma chamada de retorno. A chamada de retorno mostra ``"Hello World"`` e depois para o ciclo de eventos::

source: A similar :ref:`Hello World <coroutine>` example created with a coroutine and the :func:`run` function.
es_es: Un ejemplo similar :ref:`Hello World <coroutine>` creado con una corrutina y la función :func:`run`.
pt_pt: Um exemplo semelhante de :ref:`Olá Mundo <coroutine>` criado com uma corrotina e a função :func:`run`.

source: Display the current date with call_later()
es_es: Mostrar la fecha actual con call_later()
pt_pt: Mostrar a data atual com call_later()

source: An example of a callback displaying the current date every second. The callback uses the :meth:`loop.call_later` method to reschedule itself after 5 seconds, and then stops the event loop::
es_es: Un ejemplo de un callback que muestra la fecha actual cada segundo. La llamada de retorno utiliza el método :meth:`loop.call_later` para reprogramarse después de 5 segundos, y luego detiene el bucle de eventos::
pt_pt: Um exemplo de uma chamada de retorno que mostra a data atual a cada segundo. A chamada de retorno utiliza o método :meth:`loop.call_later` para se reagendar após 5 segundos e depois para o ciclo de eventos::

source: A similar :ref:`current date <asyncio_example_sleep>` example created with a coroutine and the :func:`run` function.
es_es: Un ejemplo similar :ref:`current date <asyncio_example_sleep>` creado con una corrutina y la función :func:`run`.
pt_pt: Um exemplo semelhante de :ref:`data atual <asyncio_example_sleep>` criado com uma corrotina e a função :func:`run`.

source: Watch a file descriptor for read events
es_es: Observar un descriptor de archivo para eventos de lectura
pt_pt: Observar um descritor de ficheiro para eventos de leitura

source: Wait until a file descriptor received some data using the :meth:`loop.add_reader` method and then close the event loop::
es_es: Espera hasta que un descriptor de archivo reciba algún dato usando el método :meth:`loop.add_reader` y luego cierra el bucle de eventos::
pt_pt: Aguarda até que um descritor de ficheiro receba alguns dados utilizando o método :meth:`loop.add_reader` e depois fecha o ciclo de eventos::

source: A similar :ref:`example <asyncio_example_create_connection>` using transports, protocols, and the :meth:`loop.create_connection` method.
es_es: Un ejemplo similar :ref:` <asyncio_example_create_connection>` utilizando transportes, protocolos y el método :meth:`loop.create_connection`.
pt_pt: Um :ref:`example <asyncio_example_create_connection>` semelhante que utiliza transportes, protocolos e o método :meth:`loop.create_connection`.

source: Another similar :ref:`example <asyncio_example_create_connection-streams>` using the high-level :func:`asyncio.open_connection` function and streams.
es_es: Otro ejemplo similar :ref:` <asyncio_example_create_connection-streams>` utilizando la función de alto nivel :func:`asyncio.open_connection` y flujos.
pt_pt: Outro :ref:`example <asyncio_example_create_connection-streams>` semelhante que utiliza a função de alto nível :func:`asyncio.open_connection` e fluxos.

source: Set signal handlers for SIGINT and SIGTERM
es_es: Establecer manejadores de señales para SIGINT y SIGTERM
pt_pt: Definir manipuladores de sinais para SIGINT e SIGTERM

source: (This ``signals`` example only works on Unix.)
es_es: (Este ejemplo de ``signals`` sólo funciona en Unix).
pt_pt: (Este exemplo de ``signals`` só funciona em Unix.)

source: Register handlers for signals :const:`~signal.SIGINT` and :const:`~signal.SIGTERM` using the :meth:`loop.add_signal_handler` method::
es_es: Зарегистрируйте обработчики сигналов :const:`~signal.SIGINT` и :const:`~signal.SIGTERM` с помощью метода :meth:`loop.add_signal_handler`::
pt_pt: Registar manipuladores para os sinais :const:`~signal.SIGINT` e :const:`~signal.SIGTERM` utilizando o método :meth:`loop.add_signal_handler`::

source: # will schedule "print("Hello", flush=True)" loop.call_soon( functools.partial(print, "Hello", flush=True))
pt_pt: # irá agendar "print("Hello", flush=True)" loop.call_soon( functools.partial(print, "Hello", flush=True))

source: :ref:`SSL/TLS security considerations <ssl-security>`
pt_pt: :ref:`Considerações de segurança SSL/TLS <ssl-security>`

source: srv = await loop.create_server(...) async with srv: # some code # At this point, srv is closed and no longer accepts new connections.
pt_pt: srv = await loop.create_server(...) async with srv: # algum código # Neste ponto, srv está fechado e já não aceita novas ligações.

source: async def client_connected(reader, writer): # Communicate with the client with # reader/writer streams. For example: await reader.readline() async def main(host, port): srv = await asyncio.start_server( client_connected, host, port) await srv.serve_forever() asyncio.run(main('127.0.0.1', 0))
pt_pt: async def client_connected(reader, writer): # Comunicar com o cliente usando # fluxos reader/writer. Por exemplo: await reader.readline() async def main(host, port): srv = await asyncio.start_server( client_connected, host, port) await srv.serve_forever() asyncio.run(main('127.0.0.1', 0))

source: import asyncio def hello_world(loop): """A callback to print 'Hello World' and stop the event loop""" print('Hello World') loop.stop() loop = asyncio.new_event_loop() # Schedule a call to hello_world() loop.call_soon(hello_world, loop) # Blocking call interrupted by loop.stop() try: loop.run_forever() finally: loop.close()
pt_pt: import asyncio def hello_world(loop): """Uma chamada de retorno para imprimir 'Olá Mundo' e parar o ciclo de eventos""" print('Olá Mundo') loop.stop() loop = asyncio.new_event_loop() # Agendar uma chamada para hello_world() loop.call_soon(hello_world, loop) # Chamada bloqueante interrompida por loop.stop() try: loop.run_forever() finally: loop.close()

source: import asyncio import datetime def display_date(end_time, loop): print(datetime.datetime.now()) if (loop.time() + 1.0) < end_time: loop.call_later(1, display_date, end_time, loop) else: loop.stop() loop = asyncio.new_event_loop() # Schedule the first call to display_date() end_time = loop.time() + 5.0 loop.call_soon(display_date, end_time, loop) # Blocking call interrupted by loop.stop() try: loop.run_forever() finally: loop.close()
pt_pt: import asyncio import datetime def display_date(end_time, loop): print(datetime.datetime.now()) if (loop.time() + 1.0) < end_time: loop.call_later(1, display_date, end_time, loop) else: loop.stop() loop = asyncio.new_event_loop() # Agendar a primeira chamada para display_date() end_time = loop.time() + 5.0 loop.call_soon(display_date, end_time, loop) # Chamada bloqueante interrompida por loop.stop() try: loop.run_forever() finally: loop.close()

source: import asyncio from socket import socketpair # Create a pair of connected file descriptors rsock, wsock = socketpair() loop = asyncio.new_event_loop() def reader(): data = rsock.recv(100) print("Received:", data.decode()) # We are done: unregister the file descriptor loop.remove_reader(rsock) # Stop the event loop loop.stop() # Register the file descriptor for read event loop.add_reader(rsock, reader) # Simulate the reception of data from the network loop.call_soon(wsock.send, 'abc'.encode()) try: # Run the event loop loop.run_forever() finally: # We are done. Close sockets and the event loop. rsock.close() wsock.close() loop.close()
pt_pt: import asyncio from socket import socketpair # Criar um par de descritores de ficheiro ligados rsock, wsock = socketpair() loop = asyncio.new_event_loop() def reader(): data = rsock.recv(100) print("Recebido:", data.decode()) # Terminámos: remover o registo do descritor de ficheiro loop.remove_reader(rsock) # Parar o ciclo de eventos loop.stop() # Registar o descritor de ficheiro para evento de leitura loop.add_reader(rsock, reader) # Simular a receção de dados da rede loop.call_soon(wsock.send, 'abc'.encode()) try: # Executar o ciclo de eventos loop.run_forever() finally: # Terminámos. Fechar sockets e o ciclo de eventos. rsock.close() wsock.close() loop.close()

source: import asyncio import functools import os import signal def ask_exit(signame, loop): print("got signal %s: exit" % signame) loop.stop() async def main(): loop = asyncio.get_running_loop() for signame in {'SIGINT', 'SIGTERM'}: loop.add_signal_handler( getattr(signal, signame), functools.partial(ask_exit, signame, loop)) await asyncio.sleep(3600) print("Event loop running for 1 hour, press Ctrl+C to interrupt.") print(f"pid {os.getpid()}: send SIGINT or SIGTERM to exit.") asyncio.run(main())
pt_pt: import asyncio import functools import os import signal def ask_exit(signame, loop): print("recebeu sinal %s: sair" % signame) loop.stop() async def main(): loop = asyncio.get_running_loop() for signame in {'SIGINT', 'SIGTERM'}: loop.add_signal_handler( getattr(signal, signame), functools.partial(ask_exit, signame, loop)) await asyncio.sleep(3600) print("Ciclo de eventos a executar durante 1 hora, prima Ctrl+C para interromper.") print(f"pid {os.getpid()}: envie SIGINT ou SIGTERM para sair.") asyncio.run(main())
