Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/atexit.po
Languages: es_es, sv

source: The :mod:`atexit` module defines functions to register and unregister cleanup functions. Functions thus registered are automatically executed upon normal interpreter termination. :mod:`atexit` runs these functions in the *reverse* order in which they were registered; if you register ``A``, ``B``, and ``C``, at interpreter termination time they will be run in the order ``C``, ``B``, ``A``.
es_es: El módulo :mod:`atexit` define funciones para registrar y anular el registro de funciones de limpieza. Las funciones así registradas se ejecutan automáticamente al finalizar el intérprete. :mod:`atexit` ejecuta estas funciones en el orden *reverse* en el que se registraron; si registra ``A``, ``B``, y ``C``, al finalizar el intérprete se ejecutarán en el orden ``C``, ``B``, ``A``.
sv: Modulen :mod:`atexit` definierar funktioner för att registrera och avregistrera rensningsfunktioner. Funktioner som registrerats på detta sätt körs automatiskt vid normal avslutning av tolken. :mod:`atexit` kör dessa funktioner i *omvänd* ordning som de registrerades i; om du registrerar ``A``, ``B`` och ``C`` kommer de vid avslutning av tolken att köras i ordningen ``C``, ``B``, ``A``.

source: **Note:** The functions registered via this module are not called when the program is killed by a signal not handled by Python, when a Python fatal internal error is detected, or when :func:`os._exit` is called.
es_es: **Nota:** Las funciones registradas a través de este módulo no se llaman cuando mata al programa una señal no manejada por Python, cuando se detecta un error interno fatal de Python, o cuando se llama a :func:`os._exit`.
sv: **Observera:** De funktioner som registreras via denna modul anropas inte när programmet dödas av en signal som inte hanteras av Python, när ett fatalt internt fel i Python upptäcks eller när :func:`os._exit` anropas.

source: **Note:** The effect of registering or unregistering functions from within a cleanup function is undefined.
sv: **Note:** Effekten av att registrera eller avregistrera funktioner inom en rensningsfunktion är odefinierad.

source: When used with C-API subinterpreters, registered functions are local to the interpreter they were registered in.
es_es: Cuando se utilizan con subinterpretadores C-API, las funciones registradas son locales al intérprete en el que se registraron.
sv: När de används med C-API-undertolkar är registrerade funktioner lokala för den tolk de registrerades i.

source: Register *func* as a function to be executed at termination. Any optional arguments that are to be passed to *func* must be passed as arguments to :func:`register`. It is possible to register the same function and arguments more than once.
es_es: Registra *func* como una función que se ejecutará al terminar. Cualquier argumento opcional que deba pasarse a *func* debe pasarse como argumento a :func:`register`. Es posible registrar la misma función y los mismos argumentos más de una vez.
sv: Registrera *func* som en funktion som ska exekveras vid avslutning. Eventuella valfria argument som ska skickas till *func* måste skickas som argument till :func:`register`. Det är möjligt att registrera samma funktion och argument mer än en gång.

source: At normal program termination (for instance, if :func:`sys.exit` is called or the main module's execution completes), all functions registered are called in last in, first out order. The assumption is that lower level modules will normally be imported before higher level modules and thus must be cleaned up later.
es_es: A la terminación normal del programa (por ejemplo, si se llama a :func:`sys.exit` o finaliza la ejecución del módulo principal), se llama a todas las funciones registradas en orden de último en entrar, primero en salir. El supuesto es que los módulos de nivel inferior se importarán normalmente antes que los de nivel superior y, por tanto, deberán limpiarse más tarde.
sv: Vid normal programavslutning (t.ex. om :func:`sys.exit` anropas eller om huvudmodulens exekvering avslutas) anropas alla registrerade funktioner i ordningen sist in, först ut. Antagandet är att moduler på lägre nivå normalt kommer att importeras före moduler på högre nivå och därför måste rensas upp senare.

source: If an exception is raised during execution of the exit handlers, a traceback is printed (unless :exc:`SystemExit` is raised) and the exception information is saved. After all exit handlers have had a chance to run, the last exception to be raised is re-raised.
es_es: Si se lanza una excepción durante la ejecución de los controladores de salida, se imprime un rastreo (a menos que se lance :exc:`SystemExit` ) y se guarda la información de la excepción. Una vez que todos los controladores de salida han tenido la oportunidad de ejecutarse, se vuelve a lanzar la última excepción.
sv: Om ett undantag uppstår under exekveringen av exit-hanterarna skrivs en spårning ut (såvida inte :exc:`SystemExit` uppstår) och informationen om undantaget sparas. När alla exit-hanterare har haft en chans att köras, aktiveras det sista undantaget som aktiverades på nytt.

source: This function returns *func*, which makes it possible to use it as a decorator.
es_es: Esta función devuelve *func*, lo que permite utilizarla como decorador.
sv: Denna funktion returnerar *func*, vilket gör det möjligt att använda den som en dekorator.

source: Remove *func* from the list of functions to be run at interpreter shutdown. :func:`unregister` silently does nothing if *func* was not previously registered. If *func* has been registered more than once, every occurrence of that function in the :mod:`atexit` call stack will be removed. Equality comparisons (``==``) are used internally during unregistration, so function references do not need to have matching identities.
es_es: Elimina *func* de la lista de funciones que se ejecutarán al apagar el intérprete. :func:`unregister` no hace nada silenciosamente si *func* no se registró previamente. Si *func* ha sido registrada más de una vez, cada aparición de esa función en la pila de llamadas de :mod:`atexit` será eliminada. Las comparaciones de igualdad (``==``) se usan internamente durante el desregistro, por lo que las referencias a funciones no necesitan tener identidades coincidentes.
sv: Ta bort *func* från listan över funktioner som ska köras när tolken stängs av. :func:`unregister` gör ingenting om *func* inte registrerats tidigare. Om *func* har registrerats mer än en gång kommer varje förekomst av den funktionen i anropsstacken :mod:`atexit` att tas bort. Jämlikhetsjämförelser (``==``) används internt under avregistreringen, så funktionsreferenser behöver inte ha matchande identiteter.

source: Module :mod:`readline`
es_es: Módulo :mod:`readline`
sv: Modul :mod:`readline`

source: Useful example of :mod:`atexit` to read and write :mod:`readline` history files.
es_es: Ejemplo útil de :mod:`atexit` para leer y escribir :mod:`readline` archivos de historial..
sv: Användbart exempel på :mod:`atexit` för att läsa och skriva :mod:`readline` historikfiler.

source: :mod:`atexit` Example
es_es: :mod:`atexit` Ejemplo
sv: :mod:`atexit` Exempel

source: The following simple example demonstrates how a module can initialize a counter from a file when it is imported and save the counter's updated value automatically when the program terminates without relying on the application making an explicit call into this module at termination. ::
es_es: El siguiente ejemplo sencillo demuestra cómo un módulo puede inicializar un contador desde un archivo cuando se importa y guardar el valor actualizado del contador automáticamente cuando el programa termina sin depender de que la aplicación haga una llamada explícita a este módulo al terminar. ::
sv: Följande enkla exempel visar hur en modul kan initiera en räknare från en fil när den importeras och spara räknarens uppdaterade värde automatiskt när programmet avslutas utan att vara beroende av att programmet gör ett uttryckligt anrop till denna modul vid avslutningen. ::

source: Positional and keyword arguments may also be passed to :func:`register` to be passed along to the registered function when it is called::
es_es: Los argumentos posicionales y de palabra clave también se pueden pasar a :func:`register` para que se pasen a la función registrada cuando se llame::
sv: Positionella argument och nyckelordsargument kan också skickas till :func:`register` för att skickas vidare till den registrerade funktionen när den anropas::

source: Usage as a :term:`decorator`::
es_es: Utilización como :term:`decorator`::
sv: Användning som :term:`decorator`::

source: This only works with functions that can be called without arguments.
es_es: Esto sólo funciona con funciones que se pueden llamar sin argumentos.
sv: Detta fungerar endast med funktioner som kan anropas utan argument.
