Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/binascii.po
Languages: es_es, ru, sv

source: :mod:`!binascii` --- Convert between binary and ASCII
es_es: :mod:`!binascii` --- Convertir entre binario y ASCII

source: The :mod:`binascii` module contains a number of methods to convert between binary and various ASCII-encoded binary representations. Normally, you will not use these functions directly but use wrapper modules like :mod:`uu` or :mod:`base64` instead. The :mod:`binascii` module contains low-level functions written in C for greater speed that are used by the higher-level modules.
es_es: El módulo :mod:`binascii` contiene varios métodos para convertir entre binario y varias representaciones binarias codificadas en ASCII. Normalmente, estas funciones no se utilizarán directamente, sino que se emplearán módulos envolventes como :mod:`uu` o :mod:`base64`. El módulo :mod:`binascii` contiene funciones de bajo nivel escritas en C para una mayor velocidad que son utilizadas por los módulos de nivel superior.
ru: Модуль :mod:`binascii` содержит ряд методов для преобразования между двоичными и различными двоичными представлениями в кодировке ASCII. Обычно вы не будете использовать эти функции напрямую, а вместо этого будете использовать модули-оболочки, такие как :mod:`uu` или :mod:`base64`. Модуль :mod:`binascii` содержит функции низкого уровня, написанные на C для большей скорости, которые используются модулями более высокого уровня.

source: ``a2b_*`` functions accept Unicode strings containing only ASCII characters. Other functions only accept :term:`bytes-like objects <bytes-like object>` (such as :class:`bytes`, :class:`bytearray` and other objects that support the buffer protocol).
es_es: ``a2b_*`` aceptan cadenas Unicode que sólo contengan caracteres ASCII. Otras funciones sólo aceptan objetos tipo :term:`bytes <bytes-like object>` (como :class:`bytes`, :class:`bytearray` y otros objetos que admiten el protocolo de búfer).
ru: Функции ``a2b_*`` принимают строки Unicode, содержащие только символы ASCII. Другие функции принимают только :term:`bytes-подобные объекты <bytes-like object>` (такие как :class:`bytes`, :class:`bytearray` и другие объекты, поддерживающие протокол буфера).
sv: ``a2b_*``\-funktioner accepterar Unicode-strängar som endast innehåller ASCII-tecken. Andra funktioner accepterar endast :term:`bytesliknande objekt <bytes-like object>` (t.ex. :class:`bytes`, :class:`bytearray` och andra objekt som stöder buffertprotokollet).

source: ASCII-only unicode strings are now accepted by the ``a2b_*`` functions.
es_es: Las cadenas unicode sólo ASCII son ahora aceptadas por las funciones ``a2b_*``.
ru: Строки Юникода, содержащие только ASCII, теперь принимаются функциями ``a2b_*``.
sv: ASCII-only unicode-strängar accepteras nu av funktionerna ``a2b_*``.

source: The :mod:`binascii` module defines the following functions:
es_es: El módulo :mod:`binascii` define las siguientes funciones:
ru: Модуль :mod:`binascii` определяет следующие функции:
sv: Modulen :mod:`binascii` definierar följande funktioner:

source: Convert a single line of uuencoded data back to binary and return the binary data. Lines normally contain 45 (binary) bytes, except for the last line. Line data may be followed by whitespace.
es_es: Convierte una sola línea de datos uuencodificados a binarios y devuelve los datos binarios. Las líneas contienen normalmente 45 bytes (binarios), excepto la última línea. Los datos de línea pueden ir seguidos de espacios en blanco.
ru: Преобразуйте одну строку данных, закодированных uu, обратно в двоичные данные и верните двоичные данные. Строки обычно содержат 45 (двоичных) байт, за исключением последней строки. За строковыми данными может следовать пробел.
sv: Konvertera en enda rad med uuencoded data tillbaka till binär och returnera binärdata. Rader innehåller normalt 45 (binära) byte, med undantag för den sista raden. Raddata kan följas av blanksteg.

source: Convert binary data to a line of ASCII characters, the return value is the converted line, including a newline char. The length of *data* should be at most 45. If *backtick* is true, zeros are represented by ``'`'`` instead of spaces.
es_es: Convierte datos binarios a una línea de caracteres ASCII, el valor de retorno es la línea convertida, incluyendo un carácter de nueva línea. La longitud de *data* debe ser como máximo 45. Si *backtick* es verdadero, los ceros se representan mediante ``'`'`` en lugar de espacios.
ru: Преобразуйте двоичные данные в строку символов ASCII. Возвращаемым значением является преобразованная строка, включая символ новой строки. Длина *data* должна быть не более 45. Если *backtick* истинно, нули представляются ``'`'`` вместо пробелов.
sv: Konvertera binära data till en rad med ASCII-tecken, returvärdet är den konverterade raden, inklusive ett tecken för ny rad. Längden på *data* bör vara högst 45. Om *backtick* är true representeras nollor av ``'`'`` istället för mellanslag.

source: Added the *backtick* parameter.
es_es: Añadido el parámetro *backtick*.
ru: Добавлен параметр *backtick*.
sv: Lagt till parametern *backtick*.

source: Convert a block of base64 data back to binary and return the binary data. More than one line may be passed at a time.
es_es: Convierte un bloque de datos base64 a binario y devuelve los datos binarios. Se puede pasar más de una línea a la vez.
ru: Преобразуйте блок данных base64 обратно в двоичный формат и верните двоичные данные. Одновременно можно передавать более одной строки.
sv: Konverterar ett block med base64-data tillbaka till binär och returnerar de binära data. Mer än en rad kan skickas åt gången.

source: If *strict_mode* is true, only valid base64 data will be converted. Invalid base64 data will raise :exc:`binascii.Error`.
es_es: Si *strict_mode* es verdadero, sólo se convertirán datos base64 válidos. Los datos base64 no válidos generarán :exc:`binascii.Error`.
ru: Если *strict_mode* имеет значение true, будут преобразованы только допустимые данные base64. Неверные данные base64 вызовут ошибку :exc:`binascii.Error`.

source: Valid base64:
es_es: Base64 válido:
ru: Действительная base64:

source: Conforms to :rfc:`3548`.
es_es: Conforme a :rfc:`3548`.
ru: Соответствует :rfc:`3548`.

source: Contains only characters from the base64 alphabet.
es_es: Contiene sólo caracteres del alfabeto base64.
ru: Содержит только символы алфавита base64.

source: Contains no excess data after padding (including excess padding, newlines, etc.).
es_es: No contiene datos sobrantes después del relleno (incluido el exceso de relleno, nuevas líneas, etc.).
ru: Не содержит лишних данных после заполнения (включая лишние поля, символы новой строки и т. д.).

source: Does not start with a padding.
es_es: No empieza con relleno.
ru: Не начинается с отступа.

source: Added the *strict_mode* parameter.
es_es: Añadido el parámetro *strict_mode*.
ru: Добавлен параметр *strict_mode*.

source: Convert binary data to a line of ASCII characters in base64 coding. The return value is the converted line, including a newline char if *newline* is true. The output of this function conforms to :rfc:`3548`.
es_es: Convierte datos binarios a una línea de caracteres ASCII en codificación base64. El valor devuelto es la línea convertida, incluyendo un carácter de nueva línea si *newline* es verdadero. La salida de esta función se ajusta a :rfc:`3548`.
ru: Преобразуйте двоичные данные в строку символов ASCII в кодировке Base64. Возвращаемое значение — это преобразованная строка, включая символ новой строки, если *newline* имеет значение true. Вывод этой функции соответствует :rfc:`3548`.
sv: Konverterar binära data till en rad ASCII-tecken i base64-kodning. Returvärdet är den konverterade raden, inklusive ett tecken för ny rad om *newline* är sant. Utdata från denna funktion överensstämmer med :rfc:`3548`.

source: Added the *newline* parameter.
es_es: Añadido el parámetro *newline*.
ru: Добавлен параметр *newline*.
sv: Parametern *newline* har lagts till.

source: Convert a block of quoted-printable data back to binary and return the binary data. More than one line may be passed at a time. If the optional argument *header* is present and true, underscores will be decoded as spaces.
es_es: Convierte un bloque de datos imprimibles entre comillas a binarios y devuelve los datos binarios. Se puede pasar más de una línea a la vez. Si el argumento opcional *header* está presente y es verdadero, los guiones bajos se decodificarán como espacios.
ru: Преобразуйте блок данных, доступных для печати, обратно в двоичный формат и верните двоичные данные. Одновременно можно передавать более одной строки. Если необязательный аргумент *header* присутствует и имеет значение true, символы подчеркивания будут декодированы как пробелы.
sv: Konverterar ett block med data som kan skrivas ut med citattecken tillbaka till binära data och returnerar de binära data. Mer än en rad kan skickas åt gången. Om det valfria argumentet *header* är närvarande och true, kommer understrykningar att avkodas som mellanslag.

source: Convert binary data to a line(s) of ASCII characters in quoted-printable encoding. The return value is the converted line(s). If the optional argument *quotetabs* is present and true, all tabs and spaces will be encoded. If the optional argument *istext* is present and true, newlines are not encoded but trailing whitespace will be encoded. If the optional argument *header* is present and true, spaces will be encoded as underscores per :rfc:`1522`. If the optional argument *header* is present and false, newline characters will be encoded as well; otherwise linefeed conversion might corrupt the binary data stream.
es_es: Convierte datos binarios en línea(s) de caracteres ASCII en codificación imprimible entre comillas. El valor devuelto es la-s línea(s) convertida-s. Si el argumento opcional *quotetabs* está presente y es verdadero, se codificarán todos los tabuladores y espacios. Si el argumento opcional *istext* está presente y es verdadero, las nuevas líneas no se codifican, pero sí los espacios en blanco finales. Si el argumento opcional *header* está presente y es verdadero, los espacios se codificarán como guiones bajos según :rfc:`1522`. Si el argumento opcional *header* está presente y es falso, los caracteres de nueva línea también se codificarán; de lo contrario, la conversión del salto de línea podría corromper el flujo de datos binarios.
ru: Преобразуйте двоичные данные в строку(и) символов ASCII в кодировке для печати в кавычках. Возвращаемое значение — это преобразованные строки. Если необязательный аргумент *quotetabs* присутствует и имеет значение true, все табуляции и пробелы будут закодированы. Если необязательный аргумент *istext* присутствует и имеет значение true, символы новой строки не кодируются, но будут кодироваться конечные пробелы. Если необязательный аргумент *header* присутствует и имеет значение true, пробелы будут закодированы как символы подчеркивания согласно :rfc:`1522`. Если необязательный аргумент *header* присутствует и имеет значение false, символы новой строки также будут закодированы; в противном случае преобразование перевода строки может повредить поток двоичных данных.
sv: Konverterar binära data till en eller flera rader med ASCII-tecken i citattryckbar kodning. Returvärdet är den konverterade raden/raderna. Om det valfria argumentet *quotetabs* är närvarande och sant, kommer alla tabbar och mellanslag att kodas. Om det valfria argumentet *istext* är närvarande och true, kodas inte nya rader men efterföljande blanksteg kodas. Om det valfria argumentet *header* är närvarande och sant, kommer mellanslag att kodas som understrykningstecken enligt :rfc:`1522`. Om det valfria argumentet *header* är närvarande och false, kommer även tecken för nya rader att kodas; annars kan omvandling av radavbrott korrumpera den binära dataströmmen.

source: Compute a 16-bit CRC value of *data*, starting with *value* as the initial CRC, and return the result. This uses the CRC-CCITT polynomial *x*:sup:`16` + *x*:sup:`12` + *x*:sup:`5` + 1, often represented as 0x1021. This CRC is used in the binhex4 format.
es_es: Calcula un valor CRC de 16 bits de *datos*, comenzando con *valor* como CRC inicial, y devuelve el resultado. Esto utiliza el polinomio CRC-CCITT *x*:sup:`16` + *x*:sup:`12` + *x*:sup:`5` + 1, a menudo representado como 0x1021. Este CRC se utiliza en el formato binhex4.
ru: Вычислите 16-битное значение CRC для *data*, начиная с *value* в качестве начального CRC, и верните результат. При этом используется полином CRC-CCITT *x*:sup:`16` + *x*:sup:`12` + *x*:sup:`5` + 1, часто представленный как 0x1021. Этот CRC используется в формате binhex4.
sv: Beräkna ett 16-bitars CRC-värde för *data*, med *värde* som första CRC, och returnera resultatet. Detta använder CRC-CCITT-polynomet *x*:sup:`16` + *x*:sup:`12` + *x*:sup:`5` + 1, ofta representerat som 0x1021. Denna CRC används i binhex4-formatet.

source: Compute CRC-32, the unsigned 32-bit checksum of *data*, starting with an initial CRC of *value*. The default initial CRC is zero. The algorithm is consistent with the ZIP file checksum. Since the algorithm is designed for use as a checksum algorithm, it is not suitable for use as a general hash algorithm. Use as follows::
es_es: Calcula CRC-32, la suma de comprobación de 32 bits sin signo de *datos*, comenzando con un CRC inicial de *valor*. El CRC inicial por defecto es cero. El algoritmo es consistente con la suma de comprobación de archivos ZIP. Dado que el algoritmo está diseñado para su uso como algoritmo de suma de comprobación, no es adecuado para su uso como algoritmo hash general. Utilícelo de la siguiente manera::
ru: Вычислите CRC-32, беззнаковую 32-битную контрольную сумму *данных*, начиная с начальной CRC *значения*. Начальный CRC по умолчанию равен нулю. Алгоритм соответствует контрольной сумме ZIP-файла. Поскольку алгоритм предназначен для использования в качестве алгоритма контрольной суммы, он не подходит для использования в качестве общего алгоритма хеширования. Используйте следующим образом::
sv: Beräkna CRC-32, den osignerade 32-bitars kontrollsumman för *data*, med utgångspunkt från en initial CRC på *värde*. Standardvärdet för den initiala CRC:n är noll. Algoritmen är konsekvent med ZIP-filens kontrollsumma. Eftersom algoritmen är utformad för att användas som en kontrollsummealgoritm är den inte lämplig att använda som en allmän hashalgoritm. Använd enligt följande::

source: print(binascii.crc32(b"hello world")) # Or, in two pieces: crc = binascii.crc32(b"hello") crc = binascii.crc32(b" world", crc) print('crc32 = {:#010x}'.format(crc))
es_es: print(binascii.crc32(b "hola mundo")) # O, en dos partes crc = binascii.crc32(b "hola") crc = binascii.crc32(b" mundo", crc) print('crc32 = {:#010x}'.format(crc))

source: The result is always unsigned.
es_es: El resultado es siempre sin signo.
ru: Результат всегда беззнаковый.

source: Return the hexadecimal representation of the binary *data*. Every byte of *data* is converted into the corresponding 2-digit hex representation. The returned bytes object is therefore twice as long as the length of *data*.
es_es: Devuelve la representación hexadecimal de los *data* binarios. Cada byte de *data* se convierte en su correspondiente representación hexadecimal de 2 dígitos. El objeto bytes devuelto es, por tanto, el doble de largo que la longitud de *data*.
ru: Возвращает шестнадцатеричное представление двоичных *данных*. Каждый байт *данных* преобразуется в соответствующее двухзначное шестнадцатеричное представление. Таким образом, длина возвращаемого объекта байтов в два раза превышает длину *data*.
sv: Returnerar den hexadecimala representationen av binära *data*. Varje byte i *data* konverteras till motsvarande 2-siffriga hexadecimala representation. Det returnerade bytes-objektet är därför dubbelt så långt som längden på *data*.

source: Similar functionality (but returning a text string) is also conveniently accessible using the :meth:`bytes.hex` method.
es_es: También se puede acceder cómodamente a una funcionalidad similar (pero devolviendo una cadena de texto) mediante el método :meth:`bytes.hex`.
ru: Аналогичная функциональность (но с возвратом текстовой строки) также удобно доступна с помощью метода :meth:`bytes.hex`.
sv: Liknande funktionalitet (men som returnerar en textsträng) är också lättillgänglig med metoden :meth:`bytes.hex`.

source: If *sep* is specified, it must be a single character str or bytes object. It will be inserted in the output after every *bytes_per_sep* input bytes. Separator placement is counted from the right end of the output by default, if you wish to count from the left, supply a negative *bytes_per_sep* value.
es_es: Si se especifica *sep*, debe ser un objeto str o bytes de un solo carácter. Se insertará en la salida después de cada *bytes_per_sep* bytes de entrada. La colocación del separador se cuenta desde el extremo derecho de la salida por defecto, si desea contar desde la izquierda, suministre un valor *bytes_per_sep* negativo.
ru: Если указано *sep*, это должен быть односимвольный объект str или bytes. Он будет вставлен в выходные данные после каждого входного байта *bytes_per_sep*. По умолчанию размещение разделителя отсчитывается от правого конца вывода. Если вы хотите считать от левого, укажите отрицательное значение *bytes_per_sep*.
sv: Om *sep* anges måste det vara ett str- eller bytes-objekt med ett enda tecken. Det kommer att infogas i utdata efter varje *bytes_per_sep* indatabytes. Separatorplaceringen räknas som standard från den högra änden av utmatningen, om du vill räkna från vänster anger du ett negativt *bytes_per_sep*-värde.

source: The *sep* and *bytes_per_sep* parameters were added.
es_es: Se han añadido los parámetros *sep* y *bytes_per_sep*.
ru: Были добавлены параметры *sep* и *bytes_per_sep*.
sv: Parametrarna *sep* och *bytes_per_sep* har lagts till.

source: Return the binary data represented by the hexadecimal string *hexstr*. This function is the inverse of :func:`b2a_hex`. *hexstr* must contain an even number of hexadecimal digits (which can be upper or lower case), otherwise an :exc:`Error` exception is raised.
es_es: Devuelve los datos binarios representados por la cadena hexadecimal *hexstr*. Esta función es la inversa de :func:`b2a_hex`. *hexstr* debe contener un número par de dígitos hexadecimales (que pueden ser mayúsculas o minúsculas), de lo contrario se lanza una excepción :exc:`Error`.
ru: Возвращает двоичные данные, представленные шестнадцатеричной строкой *hexstr*. Эта функция является обратной :func:`b2a_hex`. *hexstr* должен содержать четное количество шестнадцатеричных цифр (которые могут быть в верхнем или нижнем регистре), в противном случае выдается исключение :exc:`Error`.
sv: Returnerar binärdata som representeras av den hexadecimala strängen *hexstr*. Denna funktion är inversen av :func:`b2a_hex`. *hexstr* måste innehålla ett jämnt antal hexadecimala siffror (som kan vara versaler eller gemener), annars uppstår ett :exc:`Error` undantag.

source: Similar functionality (accepting only text string arguments, but more liberal towards whitespace) is also accessible using the :meth:`bytes.fromhex` class method.
es_es: También se puede acceder a una funcionalidad similar (aceptando sólo argumentos de cadena de texto, pero más liberal con los espacios en blanco) utilizando el método de la clase :meth:`bytes.fromhex`.
ru: Аналогичная функциональность (принимающая только аргументы текстовой строки, но более свободная в отношении пробелов) также доступна с использованием метода класса :meth:`bytes.fromhex`.
sv: Liknande funktionalitet (som endast accepterar argument i form av textsträngar, men som är mer liberal när det gäller blanksteg) kan också nås med klassmetoden :meth:`bytes.fromhex`.

source: Exception raised on errors. These are usually programming errors.
es_es: Excepción planteada en caso de error. Suelen ser errores de programación.
ru: Исключение возникает при ошибках. Обычно это ошибки программирования.
sv: Undantag som uppstår vid fel. Dessa är vanligtvis programmeringsfel.

source: Exception raised on incomplete data. These are usually not programming errors, but may be handled by reading a little more data and trying again.
es_es: Excepción planteada por datos incompletos. Normalmente no son errores de programación, pero pueden solucionarse leyendo un poco más de datos e intentándolo de nuevo.
ru: Исключение возникает при неполных данных. Обычно это не ошибки программирования, но их можно устранить, прочитав немного больше данных и повторив попытку.
sv: Undantag på grund av ofullständiga data. Dessa är vanligtvis inte programmeringsfel, men kan hanteras genom att läsa lite mer data och försöka igen.

source: Module :mod:`base64`
es_es: Módulo :mod:`base64`
ru: Модуль :mod:`base64`
sv: Modul :mod:`base64`

source: Support for RFC compliant base64-style encoding in base 16, 32, 64, and 85.
es_es: Compatibilidad con la codificación de estilo base64 compatible con RFC en base 16, 32, 64 y 85.
ru: Поддержка кодировки в стиле base64, совместимой с RFC, в базовых кодировках 16, 32, 64 и 85.
sv: Stöd för RFC-kompatibel kodning i base64-stil i baserna 16, 32, 64 och 85.

source: Module :mod:`uu`
es_es: Módulo :mod:`uu`

source: Support for UU encoding used on Unix.
es_es: Soporte para la codificación UU utilizada en Unix.
ru: Поддержка кодировки UU, используемой в Unix.

source: Module :mod:`quopri`
es_es: Módulo :mod:`quopri`
ru: Модуль :mod:`quopri`
sv: Modul :mod:`quopri`

source: Support for quoted-printable encoding used in MIME email messages.
es_es: Compatibilidad con la codificación quoted-printable utilizada en los mensajes de correo electrónico MIME.
ru: Поддержка кодировки Quote-printable, используемой в сообщениях электронной почты MIME.
sv: Stöd för utskriftskodning med citattecken som används i MIME-e-postmeddelanden.

source: module
es_es: módulo
ru: модуль
