Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/calendar.po
Languages: es_es, pt_pt, ru, sv

source: Returns the day of the week (``0`` is Monday) for *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).
es_es: Devuelve el día de la semana (``0`` es lunes) para *año* (``1970``--...), *month* (``1``--``12``), *día* (``1``--``31``).
pt_pt: Devolve o dia da semana (``0`` é segunda-feira) para *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).
sv: Returnerar veckodagen (``0`` är måndag) för *år* (``1970``\--...), *month* (``1``\--``12``), *dag* (``1``\--``31``).

source: Return a header containing abbreviated weekday names. *n* specifies the width in characters for one weekday.
es_es: Devuelve una cabecera que contiene los nombres abreviados de los días de la semana. *n* especifica la anchura en caracteres de un día de la semana.
pt_pt: Devolve um cabeçalho contendo os nomes abreviados dos dias da semana. *n* especifica a largura em caracteres para cada dia da semana.
ru: Возвращает заголовок, содержащий сокращенные названия дней недели. *n* указывает ширину в символах для одного дня недели.
sv: Returnerar en header som innehåller förkortade veckodagsnamn. *n* anger bredden i tecken för en veckodag.

source: Returns weekday of first day of the month and number of days in month, for the specified *year* and *month*.
es_es: Devuelve el día de la semana del primer día del mes y el número de días del mes, para el *year* y el *month* especificados.
pt_pt: Devolve o dia da semana do primeiro dia do mês e o número de dias no mês, para o *year* e *month* especificados.
ru: Возвращает день недели первого дня месяца и количество дней в месяце для указанных *год* и *месяц*.
sv: Returnerar veckodag för första dagen i månaden och antal dagar i månaden, för angivna *år* och *månad*.

source: Returns a matrix representing a month's calendar. Each row represents a week; days outside of the month are represented by zeros. Each week begins with Monday unless set by :func:`setfirstweekday`.
es_es: Devuelve una matriz que representa el calendario de un mes. Cada fila representa una semana; los días fuera del mes se representan con ceros. Cada semana comienza con el lunes a menos que se establezca mediante :func:`setfirstweekday`.
pt_pt: Devolve uma matriz que representa o calendário de um mês. Cada linha representa uma semana; os dias fora do mês são representados por zeros. Cada semana começa à segunda-feira, a menos que seja definido por :func:`setfirstweekday`.
ru: Возвращает матрицу, представляющую календарь на месяц. Каждая строка представляет неделю; дни вне месяца обозначаются нулями. Каждая неделя начинается с понедельника, если не указано в :func:`setfirstweekday`.
sv: Returnerar en matris som representerar en månads kalender. Varje rad representerar en vecka; dagar utanför månaden representeras av nollor. Varje vecka börjar med måndag om den inte har ställts in med :func:`setfirstweekday`.

source: Prints a month's calendar as returned by :func:`month`.
es_es: Imprime el calendario de un mes devuelto por :func:`month`.
pt_pt: Imprime o calendário de um mês como devolvido por :func:`month`.
ru: Печатает календарь на месяц, возвращаемый :func:`month`.
sv: Skriver ut en månads kalender som den returneras av :func:`month`.

source: Returns a month's calendar in a multi-line string using the :meth:`~TextCalendar.formatmonth` of the :class:`TextCalendar` class.
es_es: Devuelve el calendario de un mes en una cadena de varias líneas utilizando la dirección :meth:`~TextCalendar.formatmonth` de la clase :class:`TextCalendar`.
pt_pt: Devolve o calendário de um mês numa string de várias linhas, usando o :meth:`~TextCalendar.formatmonth` da classe :class:`TextCalendar`.
ru: Возвращает календарь на месяц в виде многострочной строки, используя :meth:`~TextCalendar.formatmonth` класса :class:`TextCalendar`.
sv: Returnerar en månads kalender i en flerradig sträng med hjälp av :meth:`~TextCalendar.formatmonth` i klassen :class:`TextCalendar`.

source: Prints the calendar for an entire year as returned by :func:`calendar`.
es_es: Imprime el calendario de todo un año devuelto por :func:`calendar`.
pt_pt: Imprime o calendário para um ano inteiro como devolvido por :func:`calendar`.
ru: Печатает календарь на весь год, возвращаемый :func:`calendar`.
sv: Skriver ut kalendern för ett helt år som returneras av :func:`calendar`.

source: Returns a 3-column calendar for an entire year as a multi-line string using the :meth:`~TextCalendar.formatyear` of the :class:`TextCalendar` class.
es_es: Devuelve un calendario de 3 columnas para un año entero como una cadena de varias líneas utilizando la :meth:`~TextCalendar.formatyear` de la clase :class:`TextCalendar`.
pt_pt: Devolve um calendário de 3 colunas para um ano inteiro como uma string de várias linhas, usando o :meth:`~TextCalendar.formatyear` da classe :class:`TextCalendar`.
ru: Возвращает календарь с тремя столбцами за весь год в виде многострочной строки, используя :meth:`~TextCalendar.formatyear` класса :class:`TextCalendar`.
sv: Returnerar en kalender med 3 kolumner för ett helt år som en sträng med flera rader med :meth:`~TextCalendar.formatyear` i klassen :class:`TextCalendar`.

source: An unrelated but handy function that takes a time tuple such as returned by the :func:`~time.gmtime` function in the :mod:`time` module, and returns the corresponding Unix timestamp value, assuming an epoch of 1970, and the POSIX encoding. In fact, :func:`time.gmtime` and :func:`timegm` are each others' inverse.
es_es: Una función no relacionada pero útil que toma una tupla de tiempo como la devuelta por la función :func:`~time.gmtime` en el módulo :mod:`time`, y devuelve el correspondiente valor de marca de tiempo Unix, asumiendo una época de 1970, y la codificación POSIX. De hecho, :func:`time.gmtime` y :func:`timegm` son inversamente proporcionales.
pt_pt: Uma função útil, embora não relacionada, que recebe um tuplo de tempo como o devolvido pela função :func:`~time.gmtime` no módulo :mod:`time`, e devolve o valor do carimbo de tempo Unix correspondente, assumindo uma época de 1970 e a codificação POSIX. De facto, :func:`time.gmtime` e :func:`timegm` são inversas uma da outra.
ru: Несвязанная, но удобная функция, которая принимает кортеж времени, например, возвращаемый функцией :func:`~time.gmtime` в модуле :mod:`time`, и возвращает соответствующее значение временной метки Unix, предполагая, что это эпоха 1970 года, и кодировка POSIX. Фактически, :func:`time.gmtime` и :func:`timegm` являются обратными друг другу.
sv: En orelaterad men praktisk funktion som tar en tidstupel, som den som returneras av funktionen :func:`~time.gmtime` i modulen :mod:`time`, och returnerar motsvarande Unix-tidsstämpelvärde, med epoken 1970 och POSIX-kodning. I själva verket är :func:`time.gmtime` och :func:`timegm` varandras invers.

source: The :mod:`calendar` module exports the following data attributes:
es_es: El módulo :mod:`calendar` exporta los siguientes atributos de datos:
pt_pt: O módulo :mod:`calendar` exporta os seguintes atributos de dados:
ru: Модуль :mod:`calendar` экспортирует следующие атрибуты данных:
sv: Modulen :mod:`calendar` exporterar följande dataattribut:

source: A sequence that represents the days of the week in the current locale, where Monday is day number 0.
sv: En sekvens som representerar veckodagarna i den aktuella språkversionen, där måndag är dag nummer 0.

source: A sequence that represents the abbreviated days of the week in the current locale, where Mon is day number 0.
sv: En sekvens som representerar de förkortade veckodagarna i den aktuella språkversionen, där Mon är dag nummer 0.

source: Aliases for the days of the week, where ``MONDAY`` is ``0`` and ``SUNDAY`` is ``6``.
sv: Aliasnamn för veckodagarna, där ``MONDAY`` är ``0`` och ``SUNDAY`` är ``6``.

source: Enumeration defining days of the week as integer constants. The members of this enumeration are exported to the module scope as :data:`MONDAY` through :data:`SUNDAY`.
sv: Enumeration som definierar veckodagar som heltalskonstanter. Medlemmarna i denna uppräkning exporteras till modulens omfattning som :data:`MONDAY` till :data:`SUNDAY`.

source: A sequence that represents the months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_name[0]`` is the empty string.
sv: En sekvens som representerar årets månader i den aktuella locale. Detta följer den normala konventionen att januari är månad nummer 1, så den har en längd på 13 och ``month_name[0]`` är den tomma strängen.

source: A sequence that represents the abbreviated months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_abbr[0]`` is the empty string.
sv: En sekvens som representerar årets förkortade månader i aktuell lokal. Detta följer den normala konventionen att januari är månad nummer 1, så den har en längd på 13 och ``month_abbr[0]`` är den tomma strängen.

source: Aliases for the months of the year, where ``JANUARY`` is ``1`` and ``DECEMBER`` is ``12``.
sv: Alias för årets månader, där ``JANUARI`` är ``1`` och ``DECEMBER`` är ``12``.

source: Enumeration defining months of the year as integer constants. The members of this enumeration are exported to the module scope as :data:`JANUARY` through :data:`DECEMBER`.
sv: Enumeration som definierar årets månader som heltalskonstanter. Medlemmarna i denna uppräkning exporteras till modulens omfattning som :data:`JANUARY` till :data:`DECEMBER`.

source: The :mod:`calendar` module defines the following exceptions:
es_es: El módulo :mod:`calendar` define las siguientes excepciones:
pt_pt: O módulo :mod:`calendar` define as seguintes exceções:
ru: Модуль :mod:`calendar` определяет следующие исключения:
sv: Modulen :mod:`calendar` definierar följande undantag:

source: A subclass of :exc:`ValueError`, raised when the given month number is outside of the range 1-12 (inclusive).
es_es: Una subclase de :exc:`ValueError`, se eleva cuando el número de mes dado está fuera del rango 1-12 (inclusive).
pt_pt: Uma subclasse de :exc:`ValueError`, levantada quando o número do mês fornecido está fora do intervalo 1-12 (inclusivo).
ru: Подкласс :exc:`ValueError`, вызываемый, когда указанный номер месяца выходит за пределы диапазона 1–12 (включительно).
sv: En subklass av :exc:`ValueError` som uppstår när det angivna månadsnumret ligger utanför intervallet 1-12 (inklusive).

source: The invalid month number.
es_es: El número de mes no válido.
pt_pt: O número do mês inválido.
ru: Неверный номер месяца.
sv: Det ogiltiga månadsnumret.

source: A subclass of :exc:`ValueError`, raised when the given weekday number is outside of the range 0-6 (inclusive).
es_es: Una subclase de :exc:`ValueError`, aumenta cuando el número de días de la semana dado está fuera del rango 0-6 (inclusive).
pt_pt: Uma subclasse de :exc:`ValueError`, levantada quando o número do dia da semana fornecido está fora do intervalo 0-6 (inclusivo).
ru: Подкласс :exc:`ValueError`, вызываемый, когда указанный номер дня недели выходит за пределы диапазона 0–6 (включительно).
sv: En subklass av :exc:`ValueError` som uppstår när det angivna veckodagsnumret ligger utanför intervallet 0-6 (inklusive).

source: The invalid weekday number.
es_es: Número de día de la semana no válido.
pt_pt: O número do dia da semana inválido.
ru: Неверный номер дня недели.
sv: Det ogiltiga veckodagsnumret.

source: Module :mod:`datetime`
es_es: Módulo :mod:`datetime`
pt_pt: Módulo :mod:`datetime`
ru: Модуль :mod:`datetime`
sv: Modul :mod:`datetime`

source: Object-oriented interface to dates and times with similar functionality to the :mod:`time` module.
es_es: Interfaz orientada a objetos para fechas y horas con funcionalidad similar al módulo :mod:`time`.
pt_pt: Interface orientada a objetos para datas e horas com funcionalidade semelhante ao módulo :mod:`time`.
ru: Объектно-ориентированный интерфейс для дат и времени с функциональностью, аналогичной модулю :mod:`time`.
sv: Objektorienterat gränssnitt för datum och tid med liknande funktionalitet som modulen :mod:`time`.

source: Module :mod:`time`
es_es: Módulo :mod:`time`
pt_pt: Módulo :mod:`time`
ru: Модуль :mod:`time`
sv: Modul :mod:`tid`

source: Low-level time related functions.
es_es: Funciones de bajo nivel relacionadas con el tiempo.
pt_pt: Funções de baixo nível relacionadas com tempo.
ru: Функции низкого уровня, связанные со временем.
sv: Tidsrelaterade funktioner på låg nivå.

source: Command-line usage
sv: Användning av kommandoraden

source: The :mod:`calendar` module can be executed as a script from the command line to interactively print a calendar.
es_es: El módulo :mod:`calendar` puede ejecutarse como un script desde la línea de comandos para imprimir interactivamente un calendario.
pt_pt: O módulo :mod:`calendar` pode ser executado como um script a partir da linha de comandos para imprimir interativamente um calendário.
ru: Модуль :mod:`calendar` можно запустить как скрипт из командной строки для интерактивной печати календаря.
sv: Modulen :mod:`calendar` kan köras som ett skript från kommandoraden för att interaktivt skriva ut en kalender.

source: python -m calendar [-h] [-L LOCALE] [-e ENCODING] [-t {text,html}] [-w WIDTH] [-l LINES] [-s SPACING] [-m MONTHS] [-c CSS] [-f FIRST_WEEKDAY] [year] [month]
sv: python -m calendar [-h] [-L LOCALE] [-e ENCODING] [-t {text,html}] [-w WIDTH] [-l LINES] [-s SPACING] [-m MONTHS] [-c CSS [-w WIDTH] [-l LINES] [-s SPACING] [-m MONTHS] [-c CSS] [-f FÖRSTA_VECKODAGEN] [år] [månad]

source: For example, to print a calendar for the year 2000:
es_es: Por ejemplo, para imprimir un calendario del año 2000:
ru: Например, чтобы распечатать календарь на 2000 год:
sv: Till exempel för att skriva ut en kalender för år 2000:

source: $ python -m calendar 2000 2000 January February March Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su 1 2 1 2 3 4 5 6 1 2 3 4 5 3 4 5 6 7 8 9 7 8 9 10 11 12 13 6 7 8 9 10 11 12 10 11 12 13 14 15 16 14 15 16 17 18 19 20 13 14 15 16 17 18 19 17 18 19 20 21 22 23 21 22 23 24 25 26 27 20 21 22 23 24 25 26 24 25 26 27 28 29 30 28 29 27 28 29 30 31 31 April May June Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su 1 2 1 2 3 4 5 6 7 1 2 3 4 3 4 5 6 7 8 9 8 9 10 11 12 13 14 5 6 7 8 9 10 11 10 11 12 13 14 15 16 15 16 17 18 19 20 21 12 13 14 15 16 17 18 17 18 19 20 21 22 23 22 23 24 25 26 27 28 19 20 21 22 23 24 25 24 25 26 27 28 29 30 29 30 31 26 27 28 29 30 July August September Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su 1 2 1 2 3 4 5 6 1 2 3 3 4 5 6 7 8 9 7 8 9 10 11 12 13 4 5 6 7 8 9 10 10 11 12 13 14 15 16 14 15 16 17 18 19 20 11 12 13 14 15 16 17 17 18 19 20 21 22 23 21 22 23 24 25 26 27 18 19 20 21 22 23 24 24 25 26 27 28 29 30 28 29 30 31 25 26 27 28 29 30 31 October November December Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su Mo Tu We Th Fr Sa Su 1 1 2 3 4 5 1 2 3 2 3 4 5 6 7 8 6 7 8 9 10 11 12 4 5 6 7 8 9 10 9 10 11 12 13 14 15 13 14 15 16 17 18 19 11 12 13 14 15 16 17 16 17 18 19 20 21 22 20 21 22 23 24 25 26 18 19 20 21 22 23 24 23 24 25 26 27 28 29 27 28 29 30 25 26 27 28 29 30 31 30 31
sv: $ python -m kalender 2000 2000 Januari Februari Mars Mån tu ons tors fre sö mån tu ons tors fre sö mån tu ons tors fre sö mån tu ons tors fre sö 1 2 1 2 3 4 5 6 1 2 3 4 5 3 4 5 6 7 8 9 7 8 9 10 11 12 13 6 7 8 9 10 11 12 10 11 12 13 14 15 16 14 15 16 17 18 19 20 13 14 15 16 17 18 19 17 18 19 20 21 22 23 21 22 23 24 25 26 27 20 21 22 23 24 25 26 24 25 26 27 28 29 30 28 29 27 28 29 30 31 31 April Maj Juni Mån tu ons ti fr sa su mån tu ons ti fr sa su mån tu ons ti fr sa su mån tu ons ti fr sa su 1 2 1 2 3 4 5 6 7 1 2 3 4 3 4 5 6 7 8 9 8 9 10 11 12 13 14 5 6 7 8 9 10 11 10 11 12 13 14 15 16 15 16 17 18 19 20 21 12 13 14 15 16 17 18 17 18 19 20 21 22 23 22 23 24 25 26 27 28 19 20 21 22 23 24 25 24 25 26 27 28 29 30 29 30 31 26 27 28 29 30 Juli Augusti September Mån tu ons tors fre sö mån tu ons tors fre sö mån tu ons tors fre sö mån tu ons tors fre sö 1 2 1 2 3 4 5 6 1 2 3 3 4 5 6 7 8 9 7 8 9 10 11 12 13 4 5 6 7 8 9 10 10 11 12 13 14 15 16 14 15 16 17 18 19 20 11 12 13 14 15 16 17 17 18 19 20 21 22 23 21 22 23 24 25 26 27 18 19 20 21 22 23 24 24 25 26 27 28 29 30 28 29 30 31 25 26 27 28 29 30 31 Oktober November December Mo Tu Vi Th Fr Sa Su Mo Tu Vi Th Fr Sa Su Mo Tu Vi Th Fr Sa Su Mo Tu Vi Th Fr Sa Su 1 1 2 3 4 5 1 2 3 2 3 4 5 6 7 8 6 7 8 9 10 11 12 4 5 6 7 8 9 10 9 10 11 12 13 14 15 13 14 15 16 17 18 19 11 12 13 14 15 16 17 16 17 18 19 20 21 22 20 21 22 23 24 25 26 18 19 20 21 22 23 24 23 24 25 26 27 28 29 27 28 29 30 25 26 27 28 29 30 31 30 31

source: The following options are accepted:
es_es: Se aceptan las siguientes opciones:
pt_pt: As seguintes opções são aceites:
ru: Принимаются следующие варианты:
sv: Följande alternativ accepteras:

source: Show the help message and exit.
es_es: Mostrar el mensaje de ayuda y salir.
pt_pt: Mostra a mensagem de ajuda e sai.
ru: Покажите справочное сообщение и выйдите.
sv: Visa hjälpmeddelandet och avsluta.

source: The locale to use for month and weekday names. Defaults to English.
es_es: La configuración regional a utilizar para los nombres de mes y día de la semana. Por defecto es Inglés.
ru: Языковой стандарт, используемый для названий месяцев и дней недели. По умолчанию английский.
sv: Det språk som ska användas för namn på månad och veckodag. Standardvärdet är engelska.

source: The encoding to use for output. :option:`--encoding` is required if :option:`--locale` is set.
es_es: La codificación a utilizar para la salida. :option:`--encoding` es necesaria si :option:`--locale` está configurado.
ru: Кодировка, используемая для вывода. :option:`--encoding` требуется, если установлен :option:`--locale`.
sv: Den kodning som ska användas för utdata. :option:`\--encoding` krävs om :option:`\--locale` har angetts.

source: Print the calendar to the terminal as text, or as an HTML document.
es_es: Imprima el calendario en el terminal como texto o como documento HTML.
ru: Распечатайте календарь на терминале в виде текста или HTML-документа.
sv: Skriv ut kalendern till terminalen som text eller som ett HTML-dokument.

source: The weekday to start each week. Must be a number between 0 (Monday) and 6 (Sunday). Defaults to 0.
sv: Den veckodag som ska starta varje vecka. Måste vara ett tal mellan 0 (måndag) och 6 (söndag). Standardvärdet är 0.

source: The year to print the calendar for. Defaults to the current year.
sv: Det år som kalendern ska skrivas ut för. Standardvärdet är innevarande år.

source: The month of the specified :option:`year` to print the calendar for. Must be a number between 1 and 12, and may only be used in text mode. Defaults to printing a calendar for the full year.
es_es: El mes del :option:`year` especificado para imprimir el calendario. Debe ser un número entre 1 y 12, y sólo puede utilizarse en modo texto. Por defecto se imprime un calendario para el año completo.
ru: Месяц указанного :option:`year` для печати календаря. Должно быть числом от 1 до 12 и может использоваться только в текстовом режиме. По умолчанию распечатывается календарь на весь год.
sv: Den månad i det angivna :option:`year` som kalendern ska skrivas ut för. Måste vara ett tal mellan 1 och 12 och kan endast användas i textläge. Standard är att skriva ut en kalender för hela året.

source: *Text-mode options:*
ru: *Параметры текстового режима:*
sv: *Alternativ för textläge:*

source: The width of the date column in terminal columns. The date is printed centred in the column. Any value lower than 2 is ignored. Defaults to 2.
es_es: La anchura de la columna de fecha en columnas terminales. La fecha se imprime centrada en la columna. Cualquier valor inferior a 2 se ignora. El valor por defecto es 2.
ru: Ширина столбца даты в столбцах терминала. Дата печатается по центру столбца. Любое значение ниже 2 игнорируется. По умолчанию 2.
sv: Datumkolumnens bredd i terminalkolumner. Datumet skrivs ut centrerat i kolumnen. Alla värden lägre än 2 ignoreras. Standardvärdet är 2.

source: The number of lines for each week in terminal rows. The date is printed top-aligned. Any value lower than 1 is ignored. Defaults to 1.
es_es: El número de líneas para cada semana en filas terminales. La fecha se imprime alineada en la parte superior. Cualquier valor inferior a 1 se ignora. El valor por defecto es 1.
ru: Количество строк за каждую неделю в терминальных строках. Дата печатается по верхнему краю. Любое значение ниже 1 игнорируется. По умолчанию 1.
sv: Antalet rader för varje vecka i terminalrader. Datumet skrivs ut toppjusterat. Alla värden lägre än 1 ignoreras. Standardvärdet är 1.

source: The space between months in columns. Any value lower than 2 is ignored. Defaults to 6.
es_es: El espacio entre meses en las columnas. Cualquier valor inferior a 2 se ignora. El valor por defecto es 6.
ru: Пробел между месяцами в столбцах. Любое значение ниже 2 игнорируется. По умолчанию 6.
sv: Mellanrummet mellan månader i kolumner. Alla värden lägre än 2 ignoreras. Standardvärdet är 6.

source: The number of months printed per row. Defaults to 3.
es_es: El número de meses impresos por fila. Por defecto es 3.
ru: Количество месяцев, напечатанных в каждой строке. По умолчанию 3.
sv: Antal månader som skrivs ut per rad. Standardvärdet är 3.

source: By default, today's date is highlighted in color and can be :ref:`controlled using environment variables <using-on-controlling-color>`.
sv: Som standard är dagens datum markerat i färg och kan :ref:`kontrolleras med hjälp av miljövariabler <using-on-controlling-color>`.

source: *HTML-mode options:*
ru: *Параметры HTML-режима:*
sv: *Alternativ för HTML-läge:*

source: The path of a CSS stylesheet to use for the calendar. This must either be relative to the generated HTML, or an absolute HTTP or ``file:///`` URL.
es_es: La ruta de una hoja de estilos CSS a utilizar para el calendario. Debe ser relativa al HTML generado o una URL HTTP o ``file:///`` absoluta.
ru: Путь к таблице стилей CSS, которая будет использоваться для календаря. Это должно быть либо относительно сгенерированного HTML, либо абсолютный URL-адрес HTTP или ``file:///``.
sv: Sökvägen till en CSS-stilmall som ska användas för kalendern. Den måste antingen vara relativ till den genererade HTML-filen eller en absolut HTTP- eller ``file:///`` -URL.

source: :class:`Calendar` instances have the following methods:
ru: Экземпляры :class:`Calendar` имеют следующие методы:

source: Return an iterator for the week day numbers that will be used for one week. The first value from the iterator will be the same as the value of the :attr:`firstweekday` property.
ru: Возвращает итератор для чисел дней недели, которые будут использоваться в течение одной недели. Первое значение итератора будет таким же, как значение свойства :attr:`firstweekday`.

source: Command-Line Usage
es_es: Uso de la línea de comandos
ru: Использование командной строки

source: The year to print the calendar for. Must be a number between 1 and 9999. Defaults to the current year.
es_es: El año para el que se imprimirá el calendario. Debe ser un número entre 1 y 9999. Por defecto es el año actual.
ru: Год для печати календаря. Должно быть числом от 1 до 9999. По умолчанию используется текущий год.
