Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/calendar.po
Languages: es_es, pt_pt, ru, sv

source: Return a month's calendar in a multi-line string. If *w* is provided, it specifies the width of the date columns, which are centered. If *l* is given, it specifies the number of lines that each week will use. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
es_es: Devuelve el calendario de un mes en una cadena multilínea. Si se proporciona *w*, especifica el ancho de las columnas de fecha, que están centradas. Si se proporciona *l*, especifica el número de líneas que utilizará cada semana. Depende del primer día de la semana especificado en el constructor o establecido por el método :meth:`setfirstweekday`.
pt_pt: Devolve o calendário de um mês numa string de várias linhas. Se *w* for fornecido, especifica a largura das colunas de datas, que são centradas. Se *l* for fornecido, especifica o número de linhas que cada semana utilizará. Depende do primeiro dia da semana, conforme especificado no construtor ou definido pelo método :meth:`setfirstweekday`.
ru: Возвращает календарь на месяц в виде многострочной строки. Если указано *w*, оно определяет ширину столбцов даты, которые располагаются по центру. Если указано *l*, оно определяет количество строк, которые будут использоваться каждую неделю. Зависит от первого дня недели, указанного в конструкторе или заданного методом :meth:`setfirstweekday`.
sv: Returnerar en månads kalender i en sträng med flera rader. Om *w* anges, specificerar det bredden på datumkolumnerna, som är centrerade. Om *l* anges, specificerar det antalet rader som varje vecka ska använda. Beror på den första veckodagen som anges i konstruktören eller ställs in med metoden :meth:`setfirstweekday`.

source: Return a string representing the month's name centered within the specified *width*. If *withyear* is ``True``, include the year in the output. The *theyear* and *themonth* parameters specify the year and month for the name to be formatted respectively.
sv: Returnerar en sträng som representerar månadens namn centrerat inom den angivna *bredden*. Om *withyear* är ``True`` inkluderas året i utdata. Parametrarna *theyear* och *themonth* anger året respektive månaden för det namn som ska formateras.

source: Print a month's calendar as returned by :meth:`formatmonth`.
es_es: Imprime el calendario de un mes devuelto por :meth:`formatmonth`.
pt_pt: Imprime o calendário de um mês como devolvido por :meth:`formatmonth`.
ru: Распечатайте календарь на месяц, возвращенный :meth:`formatmonth`.
sv: Skriv ut en månads kalender som den returneras av :meth:`formatmonth`.

source: Return a *m*-column calendar for an entire year as a multi-line string. Optional parameters *w*, *l*, and *c* are for date column width, lines per week, and number of spaces between month columns, respectively. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method. The earliest year for which a calendar can be generated is platform-dependent.
es_es: Devuelve un calendario de *m* columnas para un año entero como una cadena de varias líneas. Los parámetros opcionales *w*, *l* y *c* son para el ancho de la columna de fecha, las líneas por semana y el número de espacios entre las columnas de mes, respectivamente. Depende del primer día de la semana especificado en el constructor o establecido por el método :meth:`setfirstweekday`. El primer año para el que se puede generar un calendario depende de la plataforma.
pt_pt: Devolve um calendário de *m* colunas para um ano inteiro como uma string de várias linhas. Os parâmetros opcionais *w*, *l* e *c* são para a largura da coluna de datas, linhas por semana e número de espaços entre colunas de meses, respetivamente. Depende do primeiro dia da semana, conforme especificado no construtor ou definido pelo método :meth:`setfirstweekday`. O ano mais antigo para o qual um calendário pode ser gerado depende da plataforma.
ru: Возвращает календарь со столбцами *m* за весь год в виде многострочной строки. Необязательные параметры *w*, *l* и *c* предназначены для ширины столбца даты, строк в неделю и количества пробелов между столбцами месяца соответственно. Зависит от первого дня недели, указанного в конструкторе или заданного методом :meth:`setfirstweekday`. Самый ранний год, для которого может быть создан календарь, зависит от платформы.
sv: Returnerar en kalender med *m*-kolumner för ett helt år som en sträng med flera rader. De valfria parametrarna *w*, *l* och *c* anger datumkolumnens bredd, rader per vecka respektive antal mellanslag mellan månadskolumnerna. Beror på den första veckodagen som anges i konstruktören eller ställs in med metoden :meth:`setfirstweekday`. Det tidigaste året för vilket en kalender kan genereras är plattformsberoende.

source: Print the calendar for an entire year as returned by :meth:`formatyear`.
es_es: Imprima el calendario de todo un año devuelto por :meth:`formatyear`.
pt_pt: Imprime o calendário para um ano inteiro como devolvido por :meth:`formatyear`.
ru: Распечатайте календарь на весь год, возвращенный :meth:`formatyear`.
sv: Skriv ut kalendern för ett helt år enligt :meth:`formatyear`.

source: This class can be used to generate HTML calendars.
es_es: Esta clase puede utilizarse para generar calendarios HTML.
pt_pt: Esta classe pode ser usada para gerar calendários em HTML.
ru: Этот класс можно использовать для создания HTML-календарей.
sv: Denna klass kan användas för att generera HTML-kalendrar.

source: :class:`!HTMLCalendar` instances have the following methods:
es_es: :class:`!HTMLCalendar` tienen los siguientes métodos:
pt_pt: As instâncias de :class:`!HTMLCalendar` têm os seguintes métodos:
ru: Экземпляры :class:`!HTMLCalendar` имеют следующие методы:
sv: :class:`!HTMLCalendar`\-instanser har följande metoder:

source: Return a month's calendar as an HTML table. If *withyear* is true the year will be included in the header, otherwise just the month name will be used.
es_es: Devuelve el calendario de un mes como una tabla HTML. Si *withyear* es true se incluirá el año en la cabecera, en caso contrario sólo se usará el nombre del mes.
pt_pt: Devolve o calendário de um mês como uma tabela HTML. Se *withyear* for verdadeiro, o ano será incluído no cabeçalho; caso contrário, apenas o nome do mês será utilizado.
ru: Верните календарь на месяц в виде таблицы HTML. Если *withyear* имеет значение true, год будет включен в заголовок, в противном случае будет использоваться только название месяца.
sv: Returnerar en månads kalender som en HTML-tabell. Om *withyear* är true kommer året att inkluderas i sidhuvudet, annars används bara månadsnamnet.

source: Return a year's calendar as an HTML table. *width* (defaulting to 3) specifies the number of months per row.
es_es: Devuelve el calendario de un año como una tabla HTML. *width* (por defecto 3) especifica el número de meses por fila.
pt_pt: Devolve o calendário de um ano como uma tabela HTML. *width* (predefinido para 3) especifica o número de meses por linha.
ru: Верните календарь на год в виде таблицы HTML. *ширина* (по умолчанию 3) указывает количество месяцев в строке.
sv: Returnerar en kalender för ett år som en HTML-tabell. *width* (standard är 3) anger antalet månader per rad.

source: Return a year's calendar as a complete HTML page. *width* (defaulting to 3) specifies the number of months per row. *css* is the name for the cascading style sheet to be used. :const:`None` can be passed if no style sheet should be used. *encoding* specifies the encoding to be used for the output (defaulting to the system default encoding).
es_es: Devuelve el calendario de un año como una página HTML completa. *width* (por defecto 3) especifica el número de meses por fila. *css* es el nombre de la hoja de estilo en cascada que se utilizará. :const:`None` se puede pasar si no se debe utilizar ninguna hoja de estilo. *encoding* especifica la codificación a utilizar para la salida (por defecto la codificación por defecto del sistema).
pt_pt: Devolve o calendário de um ano como uma página HTML completa. *width* (predefinido para 3) especifica o número de meses por linha. *css* é o nome da folha de estilo em cascata a ser utilizada. Pode ser passado :const:`None` se não deve ser usada nenhuma folha de estilo. *encoding* especifica a codificação a ser usada para a saída (predefinida para a codificação predefinida do sistema).
ru: Верните календарь на год в виде полной HTML-страницы. *ширина* (по умолчанию 3) указывает количество месяцев в строке. *css* — имя используемой таблицы каскадных стилей. :const:`None` можно передать, если не требуется использовать таблицу стилей. *encoding* указывает кодировку, которая будет использоваться для вывода (по умолчанию используется системная кодировка по умолчанию).
sv: Returnerar ett års kalender som en komplett HTML-sida. *width* (standard är 3) anger antalet månader per rad. *css* är namnet på den kaskadformatmall som ska användas. :const:`None` kan anges om ingen formatmall ska användas. *encoding* anger den kodning som ska användas för utdata (standard är systemets standardkodning).

source: Return a month name as an HTML table row. If *withyear* is true the year will be included in the row, otherwise just the month name will be used.
es_es: Devuelve el nombre de un mes como una fila de una tabla HTML. Si *withyear* es true se incluirá el año en la fila, en caso contrario sólo se utilizará el nombre del mes.
pt_pt: Devolve o nome de um mês como uma linha de tabela HTML. Se *withyear* for verdadeiro, o ano será incluído na linha; caso contrário, apenas o nome do mês será utilizado.
ru: Возвращает название месяца в виде строки таблицы HTML. Если *withyear* имеет значение true, в строку будет включен год, в противном случае будет использоваться только название месяца.
sv: Returnerar ett månadsnamn som en HTML-tabellrad. Om *withyear* är true kommer året att inkluderas i raden, annars kommer bara månadsnamnet att användas.

source: :class:`!HTMLCalendar` has the following attributes you can override to customize the CSS classes used by the calendar:
es_es: :class:`!HTMLCalendar` tiene los siguientes atributos que puedes anular para personalizar las clases CSS utilizadas por el calendario:
pt_pt: A classe :class:`!HTMLCalendar` tem os seguintes atributos que pode substituir para personalizar as classes CSS usadas pelo calendário:
ru: :class:`!HTMLCalendar` имеет следующие атрибуты, которые вы можете переопределить для настройки классов CSS, используемых календарем:
sv: :class:`!HTMLCalendar` har följande attribut som du kan åsidosätta för att anpassa de CSS-klasser som används av kalendern:

source: A list of CSS classes used for each weekday. The default class list is::
es_es: Una lista de clases CSS utilizadas para cada día de la semana. La lista de clases por defecto es::
pt_pt: Uma lista de classes CSS usadas para cada dia da semana. A lista de classes predefinida é::
ru: Список классов CSS, используемых для каждого дня недели. Список классов по умолчанию::
sv: En lista över CSS-klasser som används för varje veckodag. Standardklasslistan är::

source: more styles can be added for each day::
es_es: se pueden añadir más estilos para cada día::
pt_pt: mais estilos podem ser adicionados para cada dia::
ru: на каждый день можно добавить больше стилей::
sv: fler stilar kan läggas till för varje dag::

source: Note that the length of this list must be seven items.
es_es: Tenga en cuenta que la longitud de esta lista debe ser de siete elementos.
pt_pt: Note que o comprimento desta lista deve ser de sete itens.
ru: Обратите внимание, что длина этого списка должна составлять семь элементов.
sv: Observera att längden på denna lista måste vara sju punkter.

source: The CSS class for a weekday occurring in the previous or coming month.
es_es: La clase CSS para un día de la semana del mes anterior o del mes siguiente.
pt_pt: A classe CSS para um dia da semana que ocorre no mês anterior ou seguinte.
ru: Класс CSS для дня недели, происходящего в предыдущем или наступающем месяце.
sv: CSS-klassen för en veckodag som infaller under föregående eller kommande månad.

source: A list of CSS classes used for weekday names in the header row. The default is the same as :attr:`cssclasses`.
es_es: Una lista de clases CSS utilizadas para los nombres de los días de la semana en la fila de cabecera. El valor predeterminado es el mismo que :attr:`cssclasses`.
pt_pt: Uma lista de classes CSS usadas para os nomes dos dias da semana na linha de cabeçalho. A predefinição é a mesma que :attr:`cssclasses`.
ru: Список классов CSS, используемых для названий дней недели в строке заголовка. По умолчанию то же самое, что и :attr:`cssclasses`.
sv: En lista med CSS-klasser som används för veckodagsnamn i rubrikraden. Standardvärdet är detsamma som för :attr:`cssclasses`.

source: The month's head CSS class (used by :meth:`formatmonthname`). The default value is ``"month"``.
es_es: La clase CSS de la cabecera del mes (utilizada por :meth:`formatmonthname`). El valor por defecto es ``"month"``.
pt_pt: A classe CSS do cabeçalho do mês (usada por :meth:`formatmonthname`). O valor predefinido é ``"month"``.
ru: Главный CSS-класс месяца (используется :meth:`formatmonthname`). Значение по умолчанию — «месяц».
sv: CSS-klassen för månadens huvud (används av :meth:`formatmonthname`). Standardvärdet är ``"month"``.

source: The CSS class for the whole month's table (used by :meth:`formatmonth`). The default value is ``"month"``.
es_es: La clase CSS para toda la tabla del mes (utilizada por :meth:`formatmonth`). El valor por defecto es ``"month"``.
pt_pt: A classe CSS para a tabela inteira do mês (usada por :meth:`formatmonth`). O valor predefinido é ``"month"``.
ru: Класс CSS для таблицы всего месяца (используется :meth:`formatmonth`). Значение по умолчанию — «месяц».
sv: CSS-klassen för hela månadens tabell (används av :meth:`formatmonth`). Standardvärdet är ``"month"``.

source: The CSS class for the whole year's table of tables (used by :meth:`formatyear`). The default value is ``"year"``.
es_es: La clase CSS para la tabla de tablas de todo el año (utilizada por :meth:`formatyear`). El valor por defecto es ``"year"``.
pt_pt: A classe CSS para a tabela inteira do ano (usada por :meth:`formatyear`). O valor predefinido é ``"year"``.
ru: Класс CSS для таблицы таблиц за весь год (используется :meth:`formatyear`). Значение по умолчанию — ``"год"``.
sv: CSS-klassen för hela årets tabell av tabeller (används av :meth:`formatyear`). Standardvärdet är ``"year"``.

source: The CSS class for the table head for the whole year (used by :meth:`formatyear`). The default value is ``"year"``.
es_es: La clase CSS para la cabecera de la tabla para todo el año (utilizada por :meth:`formatyear`). El valor por defecto es ``"year"``.
pt_pt: A classe CSS para o cabeçalho da tabela do ano inteiro (usada por :meth:`formatyear`). O valor predefinido é ``"year"``.
ru: Класс CSS для заголовка таблицы за весь год (используется :meth:`formatyear`). Значение по умолчанию — ``"год"``.
sv: CSS-klassen för tabellhuvudet för hela året (används av :meth:`formatyear`). Standardvärdet är ``"year"``.

source: Note that although the naming for the above described class attributes is singular (e.g. ``cssclass_month`` ``cssclass_noday``), one can replace the single CSS class with a space separated list of CSS classes, for example::
es_es: Tener en cuenta que, aunque la denominación de los atributos de clase descrita anteriormente es singular (por ejemplo, ``cssclass_month`` ``cssclass_noday`` ), se puede sustituir la clase CSS singular por una lista de clases CSS separadas por espacios, por ejemplo::
pt_pt: Note que, embora a nomenclatura dos atributos de classe descritos acima seja singular (por exemplo, ``cssclass_month``, ``cssclass_noday``), é possível substituir a classe CSS única por uma lista de classes CSS separadas por espaços, por exemplo::
ru: Обратите внимание, что хотя имена описанных выше атрибутов класса имеют единственное число (например, ``cssclass_month`` ``cssclass_noday``), можно заменить один CSS-класс списком CSS-классов, разделенных пробелами, например:
sv: Observera att även om namngivningen för de ovan beskrivna klassattributen är singular (t.ex. ``cssclass_month`` ``cssclass_noday``), kan man ersätta den enskilda CSS-klassen med en mellanslagsseparerad lista över CSS-klasser, till exempel::

source: Here is an example how :class:`!HTMLCalendar` can be customized::
es_es: He aquí un ejemplo de cómo puede personalizarse :class:`!HTMLCalendar`::
pt_pt: Aqui está um exemplo de como :class:`!HTMLCalendar` pode ser personalizado::
ru: Вот пример того, как можно настроить :class:`!HTMLCalendar`::
sv: Här är ett exempel på hur :class:`!HTMLCalendar` kan anpassas::

source: class CustomHTMLCal(calendar.HTMLCalendar): cssclasses = [style + " text-nowrap" for style in calendar.HTMLCalendar.cssclasses] cssclass_month_head = "text-center month-head" cssclass_month = "text-center month" cssclass_year = "text-italic lead"
sv: class CustomHTMLCal(kalender.HTMLCalendar): cssclasses = [style + " text-nowrap" for style in calendar.HTMLCalendar.cssclasses] cssclass_month_head = "text-center månad-huvud" cssclass_month = "text-center månad" cssclass_year = "text-italic lead"

source: This subclass of :class:`TextCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale.
es_es: A esta subclase de :class:`TextCalendar` se le puede pasar un nombre de configuración regional en el constructor y devolverá los nombres de mes y día de la semana en la configuración regional especificada.
pt_pt: Esta subclasse de :class:`TextCalendar` pode receber um nome de localização no construtor e devolverá os nomes dos meses e dos dias da semana na localização especificada.
ru: Этому подклассу :class:`TextCalendar` можно передать имя локали в конструкторе, и он будет возвращать названия месяца и дня недели в указанной локали.
sv: Denna subklass av :class:`TextCalendar` kan ges ett lokalt namn i konstruktören och returnerar namn på månader och veckodagar i den angivna lokalen.

source: This subclass of :class:`HTMLCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale.
es_es: A esta subclase de :class:`HTMLCalendar` se le puede pasar un nombre de configuración regional en el constructor y devolverá los nombres de mes y día de la semana en la configuración regional especificada.
pt_pt: Esta subclasse de :class:`HTMLCalendar` pode receber um nome de localização no construtor e devolverá os nomes dos meses e dos dias da semana na localização especificada.
ru: Этому подклассу :class:`HTMLCalendar` можно передать имя локали в конструкторе, и он будет возвращать названия месяца и дня недели в указанной локали.
sv: Denna subklass av :class:`HTMLCalendar` kan ges ett lokalt namn i konstruktören och returnerar namn på månader och veckodagar i det angivna lokala språket.

source: The constructor, :meth:`!formatweekday` and :meth:`!formatmonthname` methods of these two classes temporarily change the ``LC_TIME`` locale to the given *locale*. Because the current locale is a process-wide setting, they are not thread-safe.
es_es: El constructor y los métodos :meth:`!formatweekday` y :meth:`!formatmonthname` de estas dos clases cambian temporalmente la configuración regional ``LC_TIME`` a la *configuración regional* dada. Debido a que la configuración regional actual es una configuración de todo el proceso, no son seguras para los hilos.
pt_pt: O construtor, os métodos :meth:`!formatweekday` e :meth:`!formatmonthname` destas duas classes alteram temporariamente a localização ``LC_TIME`` para a *locale* fornecida. Como a localização atual é uma definição global do processo, estes métodos não são seguros para threads.
ru: Конструктор, методы :meth:`!formatweekday` и :meth:`!formatmonthname` этих двух классов временно изменяют локаль ``LC_TIME`` на заданную *locale*. Поскольку текущий языковой стандарт является параметром всего процесса, они не являются потокобезопасными.
sv: Metoderna constructor, :meth:`!formatweekday` och :meth:`!formatmonthname` i dessa två klasser ändrar temporärt ``LC_TIME`` locale till den angivna *locale*. Eftersom den aktuella locale är en processomfattande inställning är de inte trådsäkra.

source: For simple text calendars this module provides the following functions.
es_es: Para los calendarios de texto simples, este módulo ofrece las siguientes funciones.
pt_pt: Para calendários simples em texto, este módulo fornece as seguintes funções.
ru: Для простых текстовых календарей этот модуль предоставляет следующие функции.
sv: För enkla textkalendrar tillhandahåller denna modul följande funktioner.

source: Sets the weekday (``0`` is Monday, ``6`` is Sunday) to start each week. The values :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, and :const:`SUNDAY` are provided for convenience. For example, to set the first weekday to Sunday::
es_es: Establece el día de la semana (``0`` es lunes, ``6`` es domingo) para comenzar cada semana. Los valores :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, y :const:`SUNDAY` se proporcionan por comodidad. Por ejemplo, para fijar el primer día de la semana en domingo::
pt_pt: Define o dia da semana (``0`` é segunda-feira, ``6`` é domingo) para iniciar cada semana. Os valores :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY` e :const:`SUNDAY` são fornecidos por conveniência. Por exemplo, para definir o primeiro dia da semana como domingo::
sv: Anger vilken veckodag (``0`` är måndag, ``6`` är söndag) som ska börja varje vecka. Värdena :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY` och :const:`SUNDAY` anges för enkelhets skull. Till exempel, för att ställa in den första veckodagen till söndag::

source: Returns the current setting for the weekday to start each week.
es_es: Devuelve la configuración actual del día de la semana para comenzar cada semana.
pt_pt: Devolve a definição atual para o dia da semana que inicia cada semana.
ru: Возвращает текущую настройку дня недели, начиная с которого начинается каждая неделя.
sv: Returnerar den aktuella inställningen för vilken veckodag som ska starta varje vecka.

source: Returns :const:`True` if *year* is a leap year, otherwise :const:`False`.
es_es: Devuelve :const:`True` si *year* es bisiesto, en caso contrario :const:`False`.
pt_pt: Devolve :const:`True` se *year* for um ano bissexto, caso contrário devolve :const:`False`.
ru: Возвращает :const:`True`, если *year* високосный год, в противном случае :const:`False`.
sv: Returnerar :const:`True` om *year* är ett skottår, annars :const:`False`.

source: Returns the number of leap years in the range from *y1* to *y2* (exclusive), where *y1* and *y2* are years.
es_es: Devuelve el número de años bisiestos en el rango de *y1* a *y2* (excluyente), donde *y1* y *y2* son años.
pt_pt: Devolve o número de anos bissextos no intervalo de *y1* a *y2* (exclusivo), onde *y1* e *y2* são anos.
ru: Возвращает количество високосных лет в диапазоне от *y1* до *y2* (не включая), где *y1* и *y2* — годы.
sv: Returnerar antalet skottår i intervallet från *y1* till *y2* (exklusive), där *y1* och *y2* är årtal.

source: This function works for ranges spanning a century change.
es_es: Esta función sirve para rangos que abarcan un cambio de siglo.
pt_pt: Esta função funciona para intervalos que abrangem a mudança de século.
ru: Эта функция работает для диапазонов, охватывающих смену столетия.
sv: Denna funktion fungerar för intervall som sträcker sig över ett sekelskifte.
