Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/calendar.po
Languages: es_es, pt_pt, ru, sv

source: :mod:`!calendar` --- General calendar-related functions
sv: :mod:`!calendar` --- Allmänna kalenderrelaterade funktioner

source: **Source code:** :source:`Lib/calendar.py`
es_es: **Código fuente:** :source:`Lib/calendar.py`
pt_pt: **Código-fonte:** :source:`Lib/calendar.py`
ru: **Исходный код:** :source:`Lib/calendar.py`
sv: **Källkod:** :source:`Lib/calendar.py`

source: This module allows you to output calendars like the Unix :program:`cal` program, and provides additional useful functions related to the calendar. By default, these calendars have Monday as the first day of the week, and Sunday as the last (the European convention). Use :func:`setfirstweekday` to set the first day of the week to Sunday (6) or to any other weekday. Parameters that specify dates are given as integers. For related functionality, see also the :mod:`datetime` and :mod:`time` modules.
es_es: Este módulo permite obtener calendarios como el programa Unix :program:`cal`, y proporciona funciones adicionales útiles relacionadas con el calendario. Por defecto, estos calendarios tienen el lunes como primer día de la semana, y el domingo como último (la convención europea). Utilice :func:`setfirstweekday` para fijar el primer día de la semana en domingo (6) o en cualquier otro día de la semana. Los parámetros que especifican fechas se dan como números enteros. Para funciones relacionadas, consulte también los módulos :mod:`datetime` y :mod:`time`.
pt_pt: Este módulo permite-lhe gerar calendários semelhantes ao programa Unix :program:`cal`, e fornece funções adicionais úteis relacionadas com calendários. Por predefinição, estes calendários têm a segunda-feira como primeiro dia da semana e o domingo como último (a convenção europeia). Use :func:`setfirstweekday` para definir o primeiro dia da semana como domingo (6) ou qualquer outro dia. Os parâmetros que especificam datas são fornecidos como inteiros. Para funcionalidades relacionadas, consulte também os módulos :mod:`datetime` e :mod:`time`.
ru: Этот модуль позволяет выводить календари, как программа Unix :program:`cal`, и предоставляет дополнительные полезные функции, связанные с календарем. По умолчанию в этих календарях понедельник является первым днем ​​недели, а воскресенье — последним (европейское соглашение). Используйте :func:`setfirstweekday`, чтобы установить первым днем ​​недели воскресенье (6) или любой другой день недели. Параметры, определяющие даты, задаются как целые числа. Соответствующие функции см. также в модулях :mod:`datetime` и :mod:`time`.
sv: Med den här modulen kan du skriva ut kalendrar på samma sätt som med Unix-programmet :program:`cal`, och du får tillgång till ytterligare användbara funktioner som är relaterade till kalendern. Som standard har dessa kalendrar måndag som veckans första dag och söndag som den sista (den europeiska konventionen). Använd :func:`setfirstweekday` för att ställa in veckans första dag till söndag (6) eller till någon annan veckodag. Parametrar som anger datum anges som heltal. För relaterad funktionalitet, se även modulerna :mod:`datetime` och :mod:`time`.

source: The functions and classes defined in this module use an idealized calendar, the current Gregorian calendar extended indefinitely in both directions. This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book "Calendrical Calculations", where it's the base calendar for all computations. Zero and negative years are interpreted as prescribed by the ISO 8601 standard. Year 0 is 1 BC, year -1 is 2 BC, and so on.
es_es: Las funciones y clases definidas en este módulo utilizan un calendario idealizado, el calendario gregoriano actual extendido indefinidamente en ambas direcciones. Esto coincide con la definición del calendario "gregoriano proléptico" del libro "Cálculos calendáricos" de Dershowitz y Reingold, donde es el calendario base para todos los cálculos. Los años cero y negativos se interpretan como prescribe la norma ISO 8601. El año 0 es 1 a.C., el año -1 es 2 a.C., y así sucesivamente.
pt_pt: As funções e classes definidas neste módulo utilizam um calendário idealizado, o atual calendário gregoriano estendido indefinidamente em ambas as direções. Isto corresponde à definição do calendário "proléptico gregoriano" no livro "Calendrical Calculations" de Dershowitz e Reingold, onde é o calendário base para todos os cálculos. Anos zero e negativos são interpretados conforme prescrito pela norma ISO 8601. O ano 0 é 1 AC, o ano -1 é 2 AC, e assim por diante.
ru: Функции и классы, определенные в этом модуле, используют идеализированный календарь, текущий григорианский календарь расширяется на неопределенный срок в обоих направлениях. Это соответствует определению «предварительного григорианского» календаря в книге Дершовица и Рейнгольда «Календарные вычисления», где он является базовым календарем для всех вычислений. Нулевые и отрицательные годы интерпретируются в соответствии со стандартом ISO 8601. Год 0 — это 1 г. до н.э., год -1 — это 2 г. до н.э. и так далее.
sv: De funktioner och klasser som definieras i denna modul använder en idealiserad kalender, den nuvarande gregorianska kalendern förlängd på obestämd tid i båda riktningarna. Detta motsvarar definitionen av den "proleptiska gregorianska" kalendern i Dershowitz och Reingolds bok "Calendrical Calculations", där den är baskalendern för alla beräkningar. Noll och negativa år tolkas enligt ISO 8601-standarden. År 0 är 1 f.Kr., år -1 är 2 f.Kr. och så vidare.

source: Creates a :class:`Calendar` object. *firstweekday* is an integer specifying the first day of the week. :const:`MONDAY` is ``0`` (the default), :const:`SUNDAY` is ``6``.
es_es: Crea un objeto :class:`Calendar`. *firstweekday* es un entero que especifica el primer día de la semana. :const:`MONDAY` es ``0`` (por defecto), :const:`SUNDAY` es ``6``.
pt_pt: Cria um objeto :class:`Calendar`. *firstweekday* é um inteiro que especifica o primeiro dia da semana. :const:`MONDAY` é ``0`` (predefinido), :const:`SUNDAY` é ``6``.
ru: Создает объект :class:`Calendar`. *firstweekday* — целое число, определяющее первый день недели. :const:`MONDAY` имеет значение ``0`` (по умолчанию), :const:``SUNDAY`` имеет значение ``6``.
sv: Skapar ett :class:`Calendar`\-objekt. *firstweekday* är ett heltal som anger den första dagen i veckan. :const:`MONDAY` är ``0`` (standard), :const:`SUNDAY` är ``6``.

source: A :class:`Calendar` object provides several methods that can be used for preparing the calendar data for formatting. This class doesn't do any formatting itself. This is the job of subclasses.
es_es: Un objeto :class:`Calendar` proporciona varios métodos que pueden utilizarse para preparar los datos del calendario para su formateo. Esta clase no realiza ningún formateo por sí misma. Este es el trabajo de las subclases.
pt_pt: Um objeto :class:`Calendar` fornece vários métodos que podem ser usados para preparar os dados do calendário para formatação. Esta classe não faz qualquer formatação por si só. Essa é a função das subclasses.
ru: Объект :class:`Calendar` предоставляет несколько методов, которые можно использовать для подготовки данных календаря к форматированию. Этот класс сам не выполняет никакого форматирования. Это работа подклассов.
sv: Ett :class:`Calendar`\-objekt tillhandahåller flera metoder som kan användas för att förbereda kalenderdata för formatering. Den här klassen gör inte någon formatering själv. Detta är ett jobb för underklasser.

source: :class:`Calendar` instances have the following methods and attributes:
sv: :class:`Calendar`\-instanser har följande metoder och attribut:

source: The first weekday as an integer (0--6).
sv: Den första veckodagen som ett heltal (0--6).

source: This property can also be set and read using :meth:`~Calendar.setfirstweekday` and :meth:`~Calendar.getfirstweekday` respectively.
sv: Denna egenskap kan också ställas in och läsas med :meth:`~Calendar.setfirstweekday` respektive :meth:`~Calendar.getfirstweekday`.

source: Return an :class:`int` for the current first weekday (0--6).
sv: Returnerar en :class:`int` för den aktuella första veckodagen (0--6).

source: Identical to reading the :attr:`~Calendar.firstweekday` property.
sv: Identiskt med att läsa egenskapen :attr:`~Calendar.firstweekday`.

source: Set the first weekday to *firstweekday*, passed as an :class:`int` (0--6)
sv: Ställ in den första veckodagen till *firstweekday*, som skickas som en :class:`int` (0--6)

source: Identical to setting the :attr:`~Calendar.firstweekday` property.
sv: Identiskt med att ställa in egenskapen :attr:`~Calendar.firstweekday`.

source: Return an iterator for the week day numbers that will be used for one week. The first value from the iterator will be the same as the value of the :attr:`~Calendar.firstweekday` property.
sv: Returnerar en iterator för de veckodagsnummer som kommer att användas för en vecka. Det första värdet från iteratorn kommer att vara detsamma som värdet för egenskapen :attr:`~Calendar.firstweekday`.

source: Return an iterator for the month *month* (1--12) in the year *year*. This iterator will return all days (as :class:`datetime.date` objects) for the month and all days before the start of the month or after the end of the month that are required to get a complete week.
es_es: Devuelve un iterador para el mes *month* (1--12) en el año *year*. Este iterador devolverá todos los días (como objetos :class:`datetime.date` ) del mes y todos los días anteriores al inicio del mes o posteriores al final del mes que sean necesarios para obtener una semana completa.
pt_pt: Devolve um iterador para o mês *month* (1--12) no ano *year*. Este iterador devolverá todos os dias (como objetos :class:`datetime.date`) do mês e todos os dias antes do início do mês ou após o fim do mês que sejam necessários para obter uma semana completa.
ru: Возвращает итератор для месяца *month* (1–12) в году *year*. Этот итератор вернет все дни (как объекты :class:`datetime.date`) за месяц и все дни до начала месяца или после конца месяца, которые необходимы для получения полной недели.
sv: Returnerar en iterator för månaden *month* (1--12) i året *year*. Denna iterator returnerar alla dagar (som :class:`datetime.date`\-objekt) för månaden och alla dagar före månadens början eller efter månadens slut som krävs för att få en komplett vecka.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will simply be day of the month numbers. For the days outside of the specified month, the day number is ``0``.
es_es: Devuelve un iterador para el mes *month* en el año *year* similar a :meth:`itermonthdates`, pero no restringido por el rango :class:`datetime.date`. Los días devueltos serán simplemente números de día del mes. Para los días fuera del mes especificado, el número del día es ``0``.
pt_pt: Devolve um iterador para o mês *month* no ano *year*, semelhante a :meth:`itermonthdates`, mas não restrito ao intervalo :class:`datetime.date`. Os dias devolvidos serão simplesmente números do dia do mês. Para os dias fora do mês especificado, o número do dia é ``0``.
ru: Возвращает итератор для месяца *month* в году *year*, аналогичный :meth:`itermonthdates`, но не ограниченный диапазоном :class:`datetime.date`. Возвращаемые дни будут просто числами дней месяца. Для дней за пределами указанного месяца номер дня равен «0».
sv: Returnerar en iterator för månaden *month* i året *year* liknande :meth:`itermonthdates`, men inte begränsad av :class:`datetime.date` intervallet. Dagar som returneras kommer helt enkelt att vara nummer för dag i månaden. För dagar som ligger utanför den angivna månaden är dagsnumret ``0``.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a day of the month number and a week day number.
es_es: Devuelve un iterador para el mes *month* en el año *year* similar a :meth:`itermonthdates`, pero no restringido por el rango :class:`datetime.date`. Los días devueltos serán tuplas formadas por un número de día del mes y un número de día de la semana.
pt_pt: Devolve um iterador para o mês *month* no ano *year*, semelhante a :meth:`itermonthdates`, mas não restrito ao intervalo :class:`datetime.date`. Os dias devolvidos serão tuplos compostos por um número do dia do mês e um número do dia da semana.
ru: Возвращает итератор для месяца *month* в году *year*, аналогичный :meth:`itermonthdates`, но не ограниченный диапазоном :class:`datetime.date`. Возвращаемые дни будут представлять собой кортежи, состоящие из числа дня месяца и номера дня недели.
sv: Returnerar en iterator för månaden *month* i året *year* liknande :meth:`itermonthdates`, men inte begränsad av :class:`datetime.date` intervallet. Dagar som returneras är tupler som består av ett nummer för dagen i månaden och ett nummer för veckodagen.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month and a day of the month numbers.
es_es: Devuelve un iterador para el mes *month* en el año *year* similar a :meth:`itermonthdates`, pero no restringido por el rango :class:`datetime.date`. Los días devueltos serán tuplas formadas por los números de un año, un mes y un día del mes.
pt_pt: Devolve um iterador para o mês *month* no ano *year*, semelhante a :meth:`itermonthdates`, mas não restrito ao intervalo :class:`datetime.date`. Os dias devolvidos serão tuplos compostos por um ano, um mês e um número do dia do mês.
ru: Возвращает итератор для месяца *month* в году *year*, аналогичный :meth:`itermonthdates`, но не ограниченный диапазоном :class:`datetime.date`. Возвращаемые дни будут кортежами, состоящими из чисел года, месяца и дня месяца.
sv: Returnerar en iterator för månaden *månad* i året *år* liknande :meth:`itermonthdates`, men inte begränsad av intervallet :class:`datetime.date`. Dagar som returneras är tupler som består av ett år, en månad och en dag i månaden.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month, a day of the month, and a day of the week numbers.
es_es: Devuelve un iterador para el mes *month* en el año *year* similar a :meth:`itermonthdates`, pero no restringido por el rango :class:`datetime.date`. Los días devueltos serán tuplas formadas por un año, un mes, un día del mes y un día de la semana.
pt_pt: Devolve um iterador para o mês *month* no ano *year*, semelhante a :meth:`itermonthdates`, mas não restrito ao intervalo :class:`datetime.date`. Os dias devolvidos serão tuplos compostos por um ano, um mês, um dia do mês e um número do dia da semana.
ru: Возвращает итератор для месяца *month* в году *year*, аналогичный :meth:`itermonthdates`, но не ограниченный диапазоном :class:`datetime.date`. Возвращаемые дни будут кортежами, состоящими из чисел года, месяца, дня месяца и дня недели.
sv: Returnerar en iterator för månaden *månad* i året *år* liknande :meth:`itermonthdates`, men inte begränsad av intervallet :class:`datetime.date`. Dagar som returneras kommer att vara tupler som består av ett år, en månad, en dag i månaden och en veckodag.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven :class:`datetime.date` objects.
es_es: Devuelve una lista de las semanas del mes *mes* del *año* como semanas completas. Las semanas son listas de siete objetos :class:`datetime.date`.
pt_pt: Devolve uma lista das semanas do mês *month* do ano *year* como semanas completas. As semanas são listas de sete objetos :class:`datetime.date`.
ru: Возвращает список недель в месяце *месяц* *года* как полные недели. Недели представляют собой списки из семи объектов :class:`datetime.date`.
sv: Returnerar en lista över veckorna i månaden *månad* i *året* som hela veckor. Veckorna är listor med sju :class:`datetime.date`\-objekt.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven tuples of day numbers and weekday numbers.
es_es: Devuelve una lista de las semanas del mes *month* del *year* como semanas completas. Las semanas son listas de siete tuplas de números de días y números de días de la semana.
pt_pt: Devolve uma lista das semanas do mês *month* do ano *year* como semanas completas. As semanas são listas de sete tuplos de números de dias e números de dias da semana.
ru: Возвращает список недель в месяце *месяц* *года* как полные недели. Недели представляют собой списки из семи кортежей номеров дней и дней недели.
sv: Returnerar en lista över veckorna i månaden *månad* i *år* som hela veckor. Veckorna är listor med sju tupler av dagsnummer och veckodagsnummer.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven day numbers.
es_es: Devuelve una lista de las semanas del mes *month* del *year* como semanas completas. Las semanas son listas de números de siete días.
pt_pt: Devolve uma lista das semanas do mês *month* do ano *year* como semanas completas. As semanas são listas de sete números de dias.
ru: Возвращает список недель в месяце *месяц* *года* как полные недели. Недели представляют собой списки из семи дней.
sv: Returnerar en lista med veckorna i månaden *månad* i *år* som hela veckor. Veckorna är listor med sjudagarsnummer.

source: Return the data for the specified year ready for formatting. The return value is a list of month rows. Each month row contains up to *width* months (defaulting to 3). Each month contains between 4 and 6 weeks and each week contains 1--7 days. Days are :class:`datetime.date` objects.
es_es: Devuelve los datos del año especificado listos para formatear. El valor devuelto es una lista de filas de meses. Cada fila de mes contiene hasta *width* meses (por defecto 3). Cada mes contiene entre 4 y 6 semanas y cada semana contiene entre 1--7 días. Los días son objetos de :class:`datetime.date`.
pt_pt: Devolve os dados para o ano especificado prontos para formatação. O valor devolvido é uma lista de linhas de meses. Cada linha de mês contém até *width* meses (predefinido para 3). Cada mês contém entre 4 e 6 semanas e cada semana contém 1--7 dias. Os dias são objetos :class:`datetime.date`.
ru: Возвращает данные за указанный год, готовые к форматированию. Возвращаемое значение представляет собой список строк месяцев. Каждая строка месяца содержит до *ширины* месяцев (по умолчанию — 3). Каждый месяц содержит от 4 до 6 недель, а каждая неделя содержит 1-7 дней. Дни — это объекты :class:`datetime.date`.
sv: Returnerar data för det angivna året som är redo för formatering. Returvärdet är en lista med månadsrader. Varje månadsrad innehåller upp till *bredd* månader (standard är 3). Varje månad innehåller mellan 4 och 6 veckor och varje vecka innehåller 1--7 dagar. Dagar är :class:`datetime.date`\-objekt.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are tuples of day numbers and weekday numbers. Day numbers outside this month are zero.
es_es: Devuelve los datos del año especificado listos para formatear (similar a :meth:`yeardatescalendar`). Las entradas en las listas de semanas son tuplas de números de días y números de días de la semana. Los números de día fuera de este mes son cero.
pt_pt: Devolve os dados para o ano especificado prontos para formatação (semelhante a :meth:`yeardatescalendar`). As entradas nas listas de semanas são tuplos de números de dias e números de dias da semana. Os números de dias fora do mês são zero.
ru: Возвращает данные за указанный год, готовые к форматированию (аналогично :meth:`yeardatescalendar`). Записи в списках недель представляют собой кортежи номеров дней и дней недели. Номера дней за пределами этого месяца равны нулю.
sv: Returnerar data för det angivna året redo för formatering (liknande :meth:`yeardatescalendar`). Posterna i veckolistorna är tupler av dagsnummer och veckodagsnummer. Dagnummer utanför denna månad är noll.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are day numbers. Day numbers outside this month are zero.
es_es: Devuelve los datos del año especificado listos para formatear (similar a :meth:`yeardatescalendar`). Las entradas en las listas de semanas son números de día. Los números de día fuera de este mes son cero.
pt_pt: Devolve os dados para o ano especificado prontos para formatação (semelhante a :meth:`yeardatescalendar`). As entradas nas listas de semanas são números de dias. Os números de dias fora do mês são zero.
ru: Возвращает данные за указанный год, готовые к форматированию (аналогично :meth:`yeardatescalendar`). Записи в списках недель обозначают номера дней. Номера дней за пределами этого месяца равны нулю.
sv: Returnerar data för det angivna året redo för formatering (liknande :meth:`yeardatescalendar`). Posterna i veckolistorna är dagnummer. Dagnummer utanför denna månad är noll.

source: This class can be used to generate plain text calendars.
es_es: Esta clase puede utilizarse para generar calendarios en texto plano.
pt_pt: Esta classe pode ser usada para gerar calendários em texto simples.
ru: Этот класс можно использовать для создания текстовых календарей.
sv: Denna klass kan användas för att generera kalendrar i klartext.

source: :class:`TextCalendar` instances have the following methods:
es_es: :class:`TextCalendar` tienen los siguientes métodos:
pt_pt: As instâncias de :class:`TextCalendar` têm os seguintes métodos:
ru: Экземпляры :class:`TextCalendar` имеют следующие методы:
sv: :class:`TextCalendar`\-instanser har följande metoder:

source: Return a string representing a single day formatted with the given *width*. If *theday* is ``0``, return a string of spaces of the specified width, representing an empty day. The *weekday* parameter is unused.
sv: Returnerar en sträng som representerar en enda dag formaterad med den angivna *bredden*. Om *theday* är ``0``, returneras en sträng med mellanslag med angiven bredd, som representerar en tom dag. Parametern *weekday* är oanvänd.

source: Return a single week in a string with no newline. If *w* is provided, it specifies the width of the date columns, which are centered. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
sv: Returnerar en enskild vecka i en sträng utan ny rad. Om *w* anges, specificerar det bredden på datumkolumnerna, som är centrerade. Beror på den första veckodagen som anges i konstruktören eller ställs in med metoden :meth:`setfirstweekday`.

source: Return a string representing the name of a single weekday formatted to the specified *width*. The *weekday* parameter is an integer representing the day of the week, where ``0`` is Monday and ``6`` is Sunday.
sv: Returnerar en sträng som representerar namnet på en enskild veckodag formaterad till den angivna *bredden*. Parametern *weekday* är ett heltal som representerar veckodagen, där ``0`` är måndag och ``6`` är söndag.

source: Return a string containing the header row of weekday names, formatted with the given *width* for each column. The names depend on the locale settings and are padded to the specified width.
sv: Returnerar en sträng som innehåller rubrikraden med veckodagsnamn, formaterad med angiven *bredd* för varje kolumn. Namnen beror på lokalinställningarna och fylls på med den angivna bredden.
