Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/cmd.po
Languages: es_es, ru, sv

source: :mod:`!cmd` --- Support for line-oriented command interpreters
es_es: :mod:`!cmd` --- Soporte para intérpretes de comandos orientados a líneas

source: **Source code:** :source:`Lib/cmd.py`
es_es: **Código fuente:** :source:`Lib/cmd.py`
ru: **Исходный код:** :source:`Lib/cmd.py`
sv: **Källkod:** :source:`Lib/cmd.py`

source: The :class:`Cmd` class provides a simple framework for writing line-oriented command interpreters. These are often useful for test harnesses, administrative tools, and prototypes that will later be wrapped in a more sophisticated interface.
es_es: La clase :class:`Cmd` proporciona un marco simple para escribir intérpretes de comandos orientados a la línea. Suelen ser útiles para arneses de prueba, herramientas administrativas y prototipos que más tarde se envolverán en una interfaz más sofisticada.
ru: Класс :class:`Cmd` предоставляет простую основу для написания строко-ориентированных интерпретаторов команд. Они часто полезны для тестовых программ, инструментов администрирования и прототипов, которые позже будут облачены в более сложный интерфейс.
sv: Klassen :class:`Cmd` tillhandahåller ett enkelt ramverk för att skriva linjeorienterade kommandotolkar. Dessa är ofta användbara för testverktyg, administrativa verktyg och prototyper som senare kommer att förpackas i ett mer sofistikerat gränssnitt.

source: A :class:`Cmd` instance or subclass instance is a line-oriented interpreter framework. There is no good reason to instantiate :class:`Cmd` itself; rather, it's useful as a superclass of an interpreter class you define yourself in order to inherit :class:`Cmd`'s methods and encapsulate action methods.
es_es: Una instancia o subclase de :class:`Cmd` es un marco de intérprete orientado a la línea. No hay ninguna buena razón para instanciar :class:`Cmd` en sí; más bien, es útil como superclase de una clase de intérprete que defina usted mismo para heredar los métodos de :class:`Cmd` y encapsular los métodos de acción.
ru: Экземпляр или подкласс :class:`Cmd` представляет собой структуру строко-ориентированного интерпретатора. Нет веской причины создавать экземпляр самого :class:`Cmd`; скорее, он полезен в качестве суперкласса класса интерпретатора, который вы определяете сами, чтобы наследовать методы :class:`Cmd` и инкапсулировать методы действий.
sv: En :class:`Cmd`\-instans eller underklass-instans är ett linjeorienterat tolkningsramverk. Det finns ingen bra anledning att instansiera :class:`Cmd` själv; snarare är den användbar som en superklass av en tolkklass som du definierar själv för att ärva :class:`Cmd`\s metoder och kapsla in åtgärdsmetoder.

source: The optional argument *completekey* is the :mod:`readline` name of a completion key; it defaults to :kbd:`Tab`. If *completekey* is not :const:`None` and :mod:`readline` is available, command completion is done automatically.
es_es: El argumento opcional *completekey* es el nombre :mod:`readline` de una clave de finalización; por defecto es :kbd:`Tab`. Si *completekey* no es :const:`None` y :mod:`readline` está disponible, la finalización del comando se realiza automáticamente.
ru: Необязательный аргумент *completekey* — это :mod:`readline` имя ключа завершения; по умолчанию это :kbd:`Tab`. Если *completekey* не равен :const:`None` и доступен :mod:`readline`, завершение команды выполняется автоматически.
sv: Det valfria argumentet *completekey* är namnet :mod:`readline` på en kompletteringsnyckel; standardvärdet är :kbd:`Tab`. Om *completekey* inte är :const:`None` och :mod:`readline` är tillgängligt, sker kommandokomplettering automatiskt.

source: The optional arguments *stdin* and *stdout* specify the input and output file objects that the Cmd instance or subclass instance will use for input and output. If not specified, they will default to :data:`sys.stdin` and :data:`sys.stdout`.
es_es: Los argumentos opcionales *stdin* y *stdout* especifican los objetos de archivo de entrada y salida que la instancia o subclase de Cmd utilizará para la entrada y la salida. Si no se especifican, se utilizarán por defecto :data:`sys.stdin` y :data:`sys.stdout`.
ru: Необязательные аргументы *stdin* и *stdout* указывают объекты входного и выходного файла, которые экземпляр Cmd или экземпляр подкласса будут использовать для ввода и вывода. Если они не указаны, по умолчанию будут использоваться :data:`sys.stdin` и :data:`sys.stdout`.
sv: De valfria argumenten *stdin* och *stdout* anger de in- och utdatafilobjekt som Cmd-instansen eller underklassinstansen ska använda för in- och utdata. Om de inte anges kommer de som standard att vara :data:`sys.stdin` och :data:`sys.stdout`.

source: If you want a given *stdin* to be used, make sure to set the instance's :attr:`use_rawinput` attribute to ``False``, otherwise *stdin* will be ignored.
es_es: Si desea que se utilice un *stdin* determinado, asegúrese de establecer el atributo :attr:`use_rawinput` de la instancia en ``False``, de lo contrario se ignorará *stdin*.
ru: Если вы хотите, чтобы использовался данный *stdin*, обязательно установите для атрибута :attr:`use_rawinput` экземпляра значение ``False``, иначе *stdin* будет игнорироваться.
sv: Om du vill att en viss *stdin* ska användas, se till att sätta instansens attribut :attr:`use_rawinput` till ``False``, annars kommer *stdin* att ignoreras.

source: Cmd Objects
es_es: Objetos Cmd
ru: Объекты Cmd
sv: Cmd-objekt

source: A :class:`Cmd` instance has the following methods:
es_es: Una instancia de :class:`Cmd` tiene los siguientes métodos:
ru: Экземпляр :class:`Cmd` имеет следующие методы:
sv: En :class:`Cmd`\-instans har följande metoder:

source: Repeatedly issue a prompt, accept input, parse an initial prefix off the received input, and dispatch to action methods, passing them the remainder of the line as argument.
es_es: Emitir repetidamente un prompt, aceptar la entrada, analizar un prefijo inicial de la entrada recibida, y enviar a los métodos de acción, pasándoles el resto de la línea como argumento.
ru: Повторно выдавайте приглашение, принимайте ввод, анализируйте исходный префикс полученного ввода и отправляйте его методам действия, передавая им оставшуюся часть строки в качестве аргумента.
sv: Upprepa en uppmaning, acceptera inmatning, analysera ett initialt prefix från den mottagna inmatningen och skicka till åtgärdsmetoder och skicka resten av raden till dem som argument.

source: The optional argument is a banner or intro string to be issued before the first prompt (this overrides the :attr:`intro` class attribute).
es_es: El argumento opcional es un banner o cadena de introducción que se emitirá antes del primer aviso (esto anula el atributo de clase :attr:`intro` ).
ru: Необязательный аргумент — это баннер или вводная строка, которая выдается перед первым приглашением (это переопределяет атрибут класса :attr:`intro`).
sv: Det valfria argumentet är en banner eller introsträng som ska visas före den första prompten (detta åsidosätter klassattributet :attr:`intro`).

source: If the :mod:`readline` module is loaded, input will automatically inherit :program:`bash`\ -like history-list editing (e.g. :kbd:`Control-P` scrolls back to the last command, :kbd:`Control-N` forward to the next one, :kbd:`Control-F` moves the cursor to the right non-destructively, :kbd:`Control-B` moves the cursor to the left non-destructively, etc.).
es_es: Si se carga el módulo :mod:`readline`, la entrada heredará automáticamente la edición de listas históricas similar a :program:`bash`(por ejemplo, :kbd:`Control-P` retrocede hasta el último comando, :kbd:`Control-N` avanza hasta el siguiente, :kbd:`Control-F` mueve el cursor a la derecha de forma no destructiva, :kbd:`Control-B` mueve el cursor a la izquierda de forma no destructiva, etc.).
ru: Если модуль :mod:`readline` загружен, ввод автоматически наследует :program:`bash`\ -подобное редактированию списка истории (например, :kbd:`Control-P` прокручивает назад к последней команде, :kbd:` Control-N` вперед к следующему, :kbd:`Control-F` перемещает курсор вправо неразрушающим образом, :kbd:`Control-B` перемещает курсор влево неразрушающим образом и т.д.).
sv: Om modulen :mod:`readline` laddas, kommer inmatningen automatiskt att ärva :program:`bash` -liknande historielistredigering (t.ex. :kbd:`Control-P` rullar tillbaka till det senaste kommandot, :kbd:`Control-N` framåt till nästa, :kbd:`Control-F` flyttar markören till höger på ett icke-destruktivt sätt, :kbd:`Control-B` flyttar markören till vänster på ett icke-destruktivt sätt, etc.).

source: An end-of-file on input is passed back as the string ``'EOF'``.
es_es: Un final de archivo en la entrada se devuelve como la cadena ``'EOF'``.
ru: Конец файла при вводе передается обратно как строка ``'EOF'``.
sv: En fil som slutar vid inmatning skickas tillbaka som strängen ``'EOF'``.

source: An interpreter instance will recognize a command name ``foo`` if and only if it has a method :meth:`!do_foo`. As a special case, a line beginning with the character ``'?'`` is dispatched to the method :meth:`do_help`. As another special case, a line beginning with the character ``'!'`` is dispatched to the method :meth:`!do_shell` (if such a method is defined).
es_es: Una instancia de intérprete reconocerá un nombre de comando ``foo`` si y sólo si tiene un método :meth:`!do_foo`. Como caso especial, una línea que comienza con el carácter ``'?'`` se envía al método :meth:`do_help`. Como otro caso especial, una línea que comience con el carácter ``'!'`` se enviará al método :meth:`!do_shell` (si tal método está definido).
ru: Экземпляр интерпретатора распознает имя команды ``foo`` тогда и только тогда, когда у него есть метод :meth:`!do_foo`. В частном случае строка, начинающаяся с символа ``'?'``, передается методу :meth:`do_help`. В другом особом случае строка, начинающаяся с символа ``'!'``, передается методу :meth:`!do_shell` (если такой метод определен).

source: This method will return when the :meth:`postcmd` method returns a true value. The *stop* argument to :meth:`postcmd` is the return value from the command's corresponding :meth:`!do_\*` method.
es_es: Este método retornará cuando el método :meth:`postcmd` devuelva un valor verdadero. El argumento *stop* de :meth:`postcmd` es el valor de retorno del método :meth:`!do_\*` correspondiente al comando.
ru: Этот метод вернется, когда метод :meth:`postcmd` вернет истинное значение. Аргумент *stop* для :meth:`postcmd` — это возвращаемое значение соответствующего метода :meth:`!do_\*` команды.

source: If completion is enabled, completing commands will be done automatically, and completing of commands args is done by calling :meth:`!complete_foo` with arguments *text*, *line*, *begidx*, and *endidx*. *text* is the string prefix we are attempting to match: all returned matches must begin with it. *line* is the current input line with leading whitespace removed, *begidx* and *endidx* are the beginning and ending indexes of the prefix text, which could be used to provide different completion depending upon which position the argument is in.
es_es: Si la finalización está activada, los comandos se completarán automáticamente, y la finalización de los comandos args se realiza llamando a :meth:`!complete_foo` con los argumentos *text*, *line*, *begidx* y *endidx*. *text* es el prefijo de la cadena con la que intentamos coincidir: todas las coincidencias devueltas deben empezar por él. *line* es la línea de entrada actual con los espacios en blanco eliminados, *begidx* y *endidx* son los índices inicial y final del prefijo de texto, que pueden usarse para proporcionar una terminación diferente dependiendo de la posición en la que se encuentre el argumento.
ru: Если завершение включено, завершение команд будет выполняться автоматически, а завершение команд args выполняется путем вызова :meth:`!complete_foo` с аргументами *text*, *line*, *begidx* и *endidx*. *текст* — это префикс строки, которую мы пытаемся сопоставить: все возвращаемые совпадения должны начинаться с него. *line* — это текущая строка ввода с удаленными пробелами в начале, *begidx* и *endidx* — это начальный и конечный индексы текста префикса, которые можно использовать для обеспечения различного завершения в зависимости от того, в какой позиции находится аргумент.

source: All subclasses of :class:`Cmd` inherit a predefined :meth:`!do_help`. This method, called with an argument ``'bar'``, invokes the corresponding method :meth:`!help_bar`, and if that is not present, prints the docstring of :meth:`!do_bar`, if available. With no argument, :meth:`!do_help` lists all available help topics (that is, all commands with corresponding :meth:`!help_\*` methods or commands that have docstrings), and also lists any undocumented commands.
es_es: Todas las subclases de :class:`Cmd` heredan un método predefinido :meth:`!do_help`. Este método, llamado con un argumento ``'bar'``, invoca al método correspondiente :meth:`!help_bar`, y si éste no está presente, imprime el docstring de :meth:`!do_bar`, si está disponible. Sin argumento, :meth:`!do_help` lista todos los temas de ayuda disponibles (es decir, todos los comandos con métodos :meth:`!help_\*` correspondientes o comandos que tienen docstrings), y también lista cualquier comando no documentado.
ru: Все подклассы :class:`Cmd` наследуют предопределенный :meth:`!do_help`. Этот метод, вызываемый с аргументом ``'bar'``, вызывает соответствующий метод :meth:`!help_bar`, и если он отсутствует, печатает строку документации :meth:`!do_bar`, если она доступна. Без аргументов :meth:`!do_help` перечисляет все доступные разделы справки (то есть все команды с соответствующими методами :meth:`!help_\*` или команды, имеющие строки документации), а также перечисляет все недокументированные команды.

source: Interpret the argument as though it had been typed in response to the prompt. This may be overridden, but should not normally need to be; see the :meth:`precmd` and :meth:`postcmd` methods for useful execution hooks. The return value is a flag indicating whether interpretation of commands by the interpreter should stop. If there is a :meth:`!do_\*` method for the command *str*, the return value of that method is returned, otherwise the return value from the :meth:`default` method is returned.
es_es: Interpreta el argumento como si hubiera sido escrito en respuesta al prompt. Esto puede ser sobreescrito, pero normalmente no debería ser necesario; ver los métodos :meth:`precmd` y :meth:`postcmd` para ganchos de ejecución útiles. El valor de retorno es una bandera que indica si la interpretación de comandos por el intérprete debe detenerse. Si existe un método :meth:`!do_\*` para el comando *str*, se devuelve el valor de retorno de ese método, en caso contrario se devuelve el valor de retorno del método :meth:`default`.
ru: Интерпретируйте аргумент так, как если бы он был введен в ответ на подсказку. Это можно переопределить, но обычно этого не требуется; см. методы :meth:`precmd` и :meth:`postcmd` для полезных перехватчиков выполнения. Возвращаемое значение — это флаг, указывающий, следует ли прекратить интерпретацию команд интерпретатором. Если для команды *str* существует метод :meth:`!do_\*`, возвращается возвращаемое значение этого метода, в противном случае возвращается возвращаемое значение метода :meth:`default`.

source: Method called when an empty line is entered in response to the prompt. If this method is not overridden, it repeats the last nonempty command entered.
es_es: Método llamado cuando se introduce una línea vacía en respuesta al prompt. Si no se anula este método, se repite el último comando no vacío introducido.
ru: Метод вызывается, когда в ответ на приглашение вводится пустая строка. Если этот метод не переопределен, он повторяет последнюю введенную непустую команду.
sv: Metod som anropas när en tom rad skrivs in som svar på prompten. Om den här metoden inte åsidosätts upprepas det senast angivna kommandot som inte var tomt.

source: Method called on an input line when the command prefix is not recognized. If this method is not overridden, it prints an error message and returns.
es_es: Método llamado en una línea de entrada cuando no se reconoce el prefijo del comando. Si este método no se sobrescribe, imprime un mensaje de error y devuelve.
ru: Метод вызывается в строке ввода, когда префикс команды не распознается. Если этот метод не переопределен, он выводит сообщение об ошибке и завершает работу.
sv: Metod som anropas på en inmatningsrad när kommandoprefixet inte känns igen. Om denna metod inte åsidosätts skriver den ut ett felmeddelande och returnerar.

source: Method called to complete an input line when no command-specific :meth:`!complete_\*` method is available. By default, it returns an empty list.
es_es: Método llamado para completar una línea de entrada cuando no hay disponible ningún método :meth:`!complete_\*` específico del comando. Por defecto, devuelve una lista vacía.
ru: Метод, вызываемый для завершения строки ввода, когда метод :meth:`!complete_\*`, специфичный для команды, недоступен. По умолчанию он возвращает пустой список.

source: Method called to display a list of strings as a compact set of columns. Each column is only as wide as necessary. Columns are separated by two spaces for readability.
es_es: Método llamado para mostrar una lista de cadenas como un conjunto compacto de columnas. Cada columna es tan ancha como sea necesario. Las columnas están separadas por dos espacios para facilitar la lectura.
ru: Метод, вызываемый для отображения списка строк в виде компактного набора столбцов. Ширина каждого столбца равна необходимой. Столбцы разделены двумя пробелами для удобства чтения.

source: Hook method executed just before the command line *line* is interpreted, but after the input prompt is generated and issued. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. The return value is used as the command which will be executed by the :meth:`onecmd` method; the :meth:`precmd` implementation may re-write the command or simply return *line* unchanged.
es_es: Método gancho ejecutado justo antes de que se interprete la línea *line* de comandos, pero después de que se genere y emita el prompt de entrada. Este método es un stub en :class:`Cmd`; existe para sobreescribirse por subclases. El valor devuelto se utiliza como la orden que se ejecutará por el método :meth:`onecmd`; la implementación de :meth:`precmd` puede reescribir la orden o simplemente devolver *línea* sin cambios.
ru: Метод-перехватчик выполняется непосредственно перед интерпретацией командной строки *line*, но после того, как сгенерировано и выдано приглашение для ввода. Этот метод является заглушкой в ​​:class:`Cmd`; он существует для того, чтобы его переопределяли подклассы. Возвращаемое значение используется в качестве команды, которая будет выполнена методом :meth:`onecmd`; реализация :meth:`precmd` может переписать команду или просто вернуть *строку* без изменений.
sv: Hook-metod som exekveras precis innan kommandoraden *line* tolkas, men efter att indataprompten har genererats och skickats ut. Denna metod är en stub i :class:`Cmd`; den existerar för att kunna åsidosättas av underklasser. Returvärdet används som det kommando som kommer att utföras av metoden :meth:`onecmd`; implementationen av :meth:`precmd` kan skriva om kommandot eller helt enkelt returnera *line* oförändrad.

source: Hook method executed just after a command dispatch is finished. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses. *line* is the command line which was executed, and *stop* is a flag which indicates whether execution will be terminated after the call to :meth:`postcmd`; this will be the return value of the :meth:`onecmd` method. The return value of this method will be used as the new value for the internal flag which corresponds to *stop*; returning false will cause interpretation to continue.
es_es: Método gancho que se ejecuta justo después de finalizar el envío de un comando. Este método es un stub en :class:`Cmd`; existe para ser sobreescrito por subclases. *line* es la línea de comando que fue ejecutada, y *stop* es una bandera que indica si la ejecución será terminada después de la llamada a :meth:`postcmd`; este será el valor de retorno del método :meth:`onecmd`. El valor de retorno de este método se utilizará como el nuevo valor para la bandera interna que corresponde a *stop*; devolver false hará que la interpretación continúe.
ru: Метод-перехватчик выполняется сразу после завершения отправки команды. Этот метод является заглушкой в ​​:class:`Cmd`; он существует для того, чтобы его переопределяли подклассы. *line* — это командная строка, которая была выполнена, а *stop* — это флаг, указывающий, будет ли выполнение прекращено после вызова :meth:`postcmd`; это будет возвращаемое значение метода :meth:`onecmd`. Возвращаемое значение этого метода будет использоваться как новое значение внутреннего флага, соответствующего *stop*; возврат false приведет к продолжению интерпретации.
sv: Hook-metod som exekveras strax efter att ett kommando är färdigt. Denna metod är en stub i :class:`Cmd`; den existerar för att kunna åsidosättas av underklasser. *line* är kommandoraden som kördes, och *stop* är en flagga som anger om körningen skall avslutas efter anropet till :meth:`postcmd`; detta kommer att vara returvärdet för metoden :meth:`onecmd`. Returvärdet för denna metod kommer att användas som det nya värdet för den interna flagga som motsvarar *stop*; om den returnerar false kommer tolkningen att fortsätta.

source: Hook method executed once when :meth:`cmdloop` is called. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
es_es: Método gancho que se ejecuta una vez cuando se llama a :meth:`cmdloop`. Este método es un stub en :class:`Cmd`; existe para ser sobrescrito por subclases.
ru: Метод-перехватчик выполняется один раз при вызове :meth:`cmdloop`. Этот метод является заглушкой в ​​:class:`Cmd`; он существует для того, чтобы его переопределяли подклассы.
sv: Hook-metod som exekveras en gång när :meth:`cmdloop` anropas. Denna metod är en stub i :class:`Cmd`; den finns för att åsidosättas av subklasser.

source: Hook method executed once when :meth:`cmdloop` is about to return. This method is a stub in :class:`Cmd`; it exists to be overridden by subclasses.
es_es: Método gancho que se ejecuta una vez cuando :meth:`cmdloop` está a punto de regresar. Este método es un stub en :class:`Cmd`; existe para ser sobrescrito por subclases.
ru: Метод-перехватчик выполняется один раз, когда :meth:`cmdloop` собирается вернуться. Этот метод является заглушкой в ​​:class:`Cmd`; он существует для того, чтобы его переопределяли подклассы.
sv: Hook-metod som exekveras en gång när :meth:`cmdloop` är på väg att returnera. Denna metod är en stub i :class:`Cmd`; den existerar för att kunna åsidosättas av subklasser.

source: Instances of :class:`Cmd` subclasses have some public instance variables:
es_es: Las instancias de las subclases de :class:`Cmd` tienen algunas variables de instancia públicas:
ru: Экземпляры подклассов :class:`Cmd` имеют некоторые общедоступные переменные экземпляра:
sv: Instanser av :class:`Cmd`\-subklasser har vissa offentliga instansvariabler:

source: The prompt issued to solicit input.
es_es: El mensaje emitido para solicitar entradas.
ru: Подсказка, выданная для запроса ввода.
sv: Den uppmaning som gavs för att få in synpunkter.

source: The string of characters accepted for the command prefix.
es_es: La cadena de caracteres aceptada para el prefijo del comando.
ru: Строка символов, принятая в качестве префикса команды.
sv: Den teckensträng som accepteras för kommandoprefixet.
