Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/cmd.po
Languages: es_es, ru, sv

source: The last nonempty command prefix seen.
es_es: El último prefijo de comando no vacío visto.
ru: Последний увиденный непустой командный префикс.
sv: Det sista icke-tomma kommandoprefixet sett.

source: A list of queued input lines. The cmdqueue list is checked in :meth:`cmdloop` when new input is needed; if it is nonempty, its elements will be processed in order, as if entered at the prompt.
es_es: Una lista de líneas de entrada en cola. La lista cmdqueue se comprueba en :meth:`cmdloop` cuando se necesita una nueva entrada; si no está vacía, sus elementos se procesarán en orden, como si se hubieran introducido en el prompt.
ru: Список строк ввода в очереди. Список cmdqueue проверяется в :meth:`cmdloop`, когда требуется новый ввод; если он непустой, его элементы будут обрабатываться по порядку, как если бы они были введены в командной строке.
sv: En lista med köade inmatningsrader. Listan cmdqueue kontrolleras i :meth:`cmdloop` när ny indata behövs; om den inte är tom kommer dess element att behandlas i ordning, som om de angetts vid prompten.

source: A string to issue as an intro or banner. May be overridden by giving the :meth:`cmdloop` method an argument.
es_es: Una cadena para usar como intro o banner. Puede anularse dando un argumento al método :meth:`cmdloop`.
ru: Строка, которая будет использоваться в качестве вступления или баннера. Может быть переопределено путем передачи аргумента методу :meth:`cmdloop`.
sv: En sträng som ska användas som intro eller banner. Kan åsidosättas genom att ge metoden :meth:`cmdloop` ett argument.

source: The header to issue if the help output has a section for documented commands.
es_es: La cabecera a emitir si la salida de ayuda tiene una sección para comandos documentados.
ru: Заголовок, который выдается, если в выводе справки есть раздел для документированных команд.
sv: Den rubrik som ska visas om hjälputmatningen har ett avsnitt för dokumenterade kommandon.

source: The header to issue if the help output has a section for miscellaneous help topics (that is, there are :meth:`!help_\*` methods without corresponding :meth:`!do_\*` methods).
es_es: La cabecera a emitir si la salida de ayuda tiene una sección para temas de ayuda varios (es decir, hay métodos :meth:`!help_\*` sin los correspondientes métodos :meth:`!do_\*` ).
ru: Заголовок, который выдается, если в выводе справки есть раздел для разных тем справки (то есть существуют методы :meth:`!help_\*` без соответствующих методов :meth:`!do_\*`).

source: The header to issue if the help output has a section for undocumented commands (that is, there are :meth:`!do_\*` methods without corresponding :meth:`!help_\*` methods).
es_es: El encabezado a emitir si la salida de ayuda tiene una sección para comandos no documentados (es decir, hay métodos :meth:`!do_\*` sin los correspondientes métodos :meth:`!help_\*` ).
ru: Заголовок, который выдается, если вывод справки содержит раздел для недокументированных команд (то есть существуют методы :meth:`!do_\*` без соответствующих методов :meth:`!help_\*`).

source: The character used to draw separator lines under the help-message headers. If empty, no ruler line is drawn. It defaults to ``'='``.
es_es: Carácter utilizado para dibujar líneas de separación bajo las cabeceras de los mensajes de ayuda. Si está vacío, no se dibuja ninguna línea de separación. Por defecto es ``'='``.
ru: Символ, используемый для рисования разделительных линий под заголовками справочных сообщений. Если пусто, линия линейки не рисуется. По умолчанию оно равно ``'='``.
sv: Det tecken som används för att rita separatorlinjer under rubrikerna i hjälpmeddelanden. Om det är tomt ritas ingen linjal. Standardvärdet är ``'='``.

source: A flag, defaulting to true. If true, :meth:`cmdloop` uses :func:`input` to display a prompt and read the next command; if false, :data:`sys.stdout.write() <sys.stdout>` and :data:`sys.stdin.readline() <sys.stdin>` are used. (This means that by importing :mod:`readline`, on systems that support it, the interpreter will automatically support :program:`Emacs`\ -like line editing and command-history keystrokes.)
es_es: Un indicador, por defecto verdadero. Si es verdadero, :meth:`cmdloop` usa :func:`input` para mostrar un prompt y leer el siguiente comando; si es falso, se usa :data:`sys.stdout.write() <sys.stdout>` y :data:`sys.stdin.readline() <sys.stdin>`. (Esto significa que al importar :mod:`readline`, en los sistemas que lo soporten, el intérprete soportará automáticamente :program:`Emacs`\ -como la edición de líneas y las pulsaciones de teclas de historial de comandos).
ru: Флаг, по умолчанию равный true. Если это правда, :meth:`cmdloop` использует :func:`input` для отображения приглашения и чтения следующей команды; если false, используются :data:`sys.stdout.write() <sys.stdout>` и :data:`sys.stdin.readline() <sys.stdin>`. (Это означает, что при импорте :mod:`readline` в системах, которые его поддерживают, интерпретатор будет автоматически поддерживать :program:`Emacs`\ -подобное редактированию строк и нажатия клавиш истории команд.)

source: Cmd Example
es_es: Cmd Ejemplo
ru: Пример Cmd
sv: Cmd-exempel

source: The :mod:`cmd` module is mainly useful for building custom shells that let a user work with a program interactively.
es_es: El módulo :mod:`cmd` es útil principalmente para construir shells personalizados que permitan al usuario trabajar con un programa de forma interactiva.
ru: Модуль :mod:`cmd` в основном полезен для создания пользовательских оболочек, которые позволяют пользователю работать с программой в интерактивном режиме.
sv: Modulen :mod:`cmd` är främst användbar för att bygga egna skal som låter användaren arbeta interaktivt med ett program.

source: This section presents a simple example of how to build a shell around a few of the commands in the :mod:`turtle` module.
es_es: Esta sección presenta un ejemplo sencillo de cómo construir un intérprete de comandos en torno a algunos de los comandos del módulo :mod:`turtle`.
ru: В этом разделе представлен простой пример того, как построить оболочку на основе нескольких команд модуля :mod:`turtle`.
sv: I det här avsnittet ges ett enkelt exempel på hur du bygger ett skal med hjälp av några av kommandona i modulen :mod:`turtle`.

source: Basic turtle commands such as :meth:`~turtle.forward` are added to a :class:`Cmd` subclass with method named :meth:`!do_forward`. The argument is converted to a number and dispatched to the turtle module. The docstring is used in the help utility provided by the shell.
es_es: Los comandos básicos de turtle como :meth:`~turtle.forward` se añaden a una subclase de :class:`Cmd` con un método llamado :meth:`!do_forward`. El argumento se convierte en un número y se envía al módulo turtle. El docstring se utiliza en la utilidad de ayuda proporcionada por el shell.
ru: Базовые команды черепахи, такие как :meth:`~turtle.forward`, добавляются в подкласс :class:`Cmd` с методом с именем :meth:`!do_forward`. Аргумент преобразуется в число и отправляется в модуль черепахи. Строка документации используется в справочной утилите, предоставляемой оболочкой.

source: The example also includes a basic record and playback facility implemented with the :meth:`~Cmd.precmd` method which is responsible for converting the input to lowercase and writing the commands to a file. The :meth:`!do_playback` method reads the file and adds the recorded commands to the :attr:`~Cmd.cmdqueue` for immediate playback::
es_es: El ejemplo también incluye una función básica de grabación y reproducción implementada con el método :meth:`~Cmd.precmd`, que se encarga de convertir la entrada a minúsculas y escribir los comandos en un archivo. El método :meth:`!do_playback` lee el archivo y añade los comandos grabados a :attr:`~Cmd.cmdqueue` para su reproducción inmediata::
ru: Пример также включает базовое средство записи и воспроизведения, реализованное с помощью метода :meth:`~Cmd.precmd`, который отвечает за преобразование ввода в нижний регистр и запись команд в файл. Метод :meth:`!do_playback` считывает файл и добавляет записанные команды в :attr:`~Cmd.cmdqueue` для немедленного воспроизведения::

source: import cmd, sys from turtle import * class TurtleShell(cmd.Cmd): intro = 'Welcome to the turtle shell. Type help or ? to list commands.\n' prompt = '(turtle) ' file = None # ----- basic turtle commands ----- def do_forward(self, arg): 'Move the turtle forward by the specified distance: FORWARD 10' forward(*parse(arg)) def do_right(self, arg): 'Turn turtle right by given number of degrees: RIGHT 20' right(*parse(arg)) def do_left(self, arg): 'Turn turtle left by given number of degrees: LEFT 90' left(*parse(arg)) def do_goto(self, arg): 'Move turtle to an absolute position with changing orientation. GOTO 100 200' goto(*parse(arg)) def do_home(self, arg): 'Return turtle to the home position: HOME' home() def do_circle(self, arg): 'Draw circle with given radius an options extent and steps: CIRCLE 50' circle(*parse(arg)) def do_position(self, arg): 'Print the current turtle position: POSITION' print('Current position is %d %d\n' % position()) def do_heading(self, arg): 'Print the current turtle heading in degrees: HEADING' print('Current heading is %d\n' % (heading(),)) def do_color(self, arg): 'Set the color: COLOR BLUE' color(arg.lower()) def do_undo(self, arg): 'Undo (repeatedly) the last turtle action(s): UNDO' def do_reset(self, arg): 'Clear the screen and return turtle to center: RESET' reset() def do_bye(self, arg): 'Stop recording, close the turtle window, and exit: BYE' print('Thank you for using Turtle') self.close() bye() return True # ----- record and playback ----- def do_record(self, arg): 'Save future commands to filename: RECORD rose.cmd' self.file = open(arg, 'w') def do_playback(self, arg): 'Playback commands from a file: PLAYBACK rose.cmd' self.close() with open(arg) as f: self.cmdqueue.extend(f.read().splitlines()) def precmd(self, line): line = line.lower() if self.file and 'playback' not in line: print(line, file=self.file) return line def close(self): if self.file: self.file.close() self.file = None def parse(arg): 'Convert a series of zero or more numbers to an argument tuple' return tuple(map(int, arg.split())) if __name__ == '__main__': TurtleShell().cmdloop()
es_es: import cmd, sys from turtle import * class TurtleShell(cmd.Cmd): intro = 'Bienvenido al shell de turtle. Escribe help o ? para ver la lista de comandos.\n' prompt = '(turtle) ' file = None # ----- comandos básicos de turtle ----- def do_forward(self, arg): 'Mueve turtle adelante a la distancia especificada: FORWARD 10' forward(*parse(arg)) def do_right(self, arg): 'Gira turtle a la derecha el número de grados dado: RIGHT 20' right(*parse(arg)) def do_left(self, arg): 'Gira turtle a la izquierda el número de grados dado: LEFT 90' left(*parse(arg)) def do_goto(self, arg): 'Mueve turtle a una posición absoluta con cambio de orientación. GOTO 100 200' goto(*parse(arg)) def do_home(self, arg): 'Devuelve turtle a la posición inicial: HOME' home() def do_circle(self, arg): 'Dibuja un circulo con un radio dado y opciones de extensión y pasos: CIRCLE 50' circle(*parse(arg)) def do_position(self, arg): 'Imprime la posición actual de turtle: POSITION' print('El rumbo actual es %d %d\n' % position()) def do_heading(self, arg): 'Imprime el rumbo actual de turtle en grados: HEADING' print('El rumbo actual es %d\n' % (heading(),)) def do_color(self, arg): 'Establece el color: COLOR BLUE' color(arg.lower()) def do_undo(self, arg): 'Deshacer (repetidamente) la-s última(s) acción-es de turtle: UNDO' def do_reset(self, arg): 'Limpia la pantalla y devuelve turtle al centro: RESET' reset() def do_bye(self, arg): 'Deja de grabar, cierra la ventana de turtle y sal: BYE' print('Thank you for using Turtle') self.close() bye() return True # ----- grabar y reproducir ----- def do_record(self, arg): 'Guarda los futuros comandos en un archivo: RECORD rose.cmd' self.file = open(arg, 'w') def do_playback(self, arg): 'Reproducir comandos desde un archivo: PLAYBACK rose.cmd' self.close() with open(arg) as f: self.cmdqueue.extend(f.read().splitlines()) def precmd(self, line): line = line.lower() if self.file and 'playback' not in line: print(line, file=self.file) return line def close(self): if self.file: self.file.close() self.file = None def parse(arg): 'Convierte una serie de cero o más números en una tupla de argumentos' return tuple(map(int, arg.split())) if __name__ == '__main__': TurtleShell().cmdloop()

source: Here is a sample session with the turtle shell showing the help functions, using blank lines to repeat commands, and the simple record and playback facility:
es_es: Aquí tienes un ejemplo de sesión con el caparazón de tortuga que muestra las funciones de ayuda, el uso de líneas en blanco para repetir comandos y la sencilla función de grabación y reproducción:
ru: Вот пример сеанса с оболочкой черепахи, показывающий функции справки, использование пустых строк для повторения команд и простые возможности записи и воспроизведения:
sv: Här är ett exempel på en session med sköldpaddsskalet som visar hjälpfunktionerna, användning av tomma rader för att upprepa kommandon och den enkla inspelnings- och uppspelningsfunktionen:

source: Welcome to the turtle shell. Type help or ? to list commands. (turtle) ? Documented commands (type help <topic>): ======================================== bye color goto home playback record right circle forward heading left position reset undo (turtle) help forward Move the turtle forward by the specified distance: FORWARD 10 (turtle) record spiral.cmd (turtle) position Current position is 0 0 (turtle) heading Current heading is 0 (turtle) reset (turtle) circle 20 (turtle) right 30 (turtle) circle 40 (turtle) right 30 (turtle) circle 60 (turtle) right 30 (turtle) circle 80 (turtle) right 30 (turtle) circle 100 (turtle) right 30 (turtle) circle 120 (turtle) right 30 (turtle) circle 120 (turtle) heading Current heading is 180 (turtle) forward 100 (turtle) (turtle) right 90 (turtle) forward 100 (turtle) (turtle) right 90 (turtle) forward 400 (turtle) right 90 (turtle) forward 500 (turtle) right 90 (turtle) forward 400 (turtle) right 90 (turtle) forward 300 (turtle) playback spiral.cmd Current position is 0 0 Current heading is 0 Current heading is 180 (turtle) bye Thank you for using Turtle
es_es: Bienvenido al caparazón de turtle. Escribe help o ? para ver la lista de comandos. (turtle) ? Comandos documentados (escribe help <topic>): ======================================== bye color goto home reproducción grabar derecha círculo adelante dirección izquierda posición reset deshacer (turtle) ayuda adelante Mueve turtle hacia delante la distancia especificada: ADELANTE 10 (turtle) grabar espiral.cmd (turtle) posición La posición actual es 0 0 (turtle) rumbo El rumbo actual es 0 (turtle) reinicio (turtle) círculo 20 (turtle) derecha 30 (turtle) círculo 40 (turtle) derecha 30 (turtle) círculo 60 (turtle) derecha 30 (turtle) círculo 80 (turtle) derecha 30 (turtle) círculo 100 (turtle) derecha 30 (turtle) círculo 120 (turtle) derecha 30 (turtle) círculo 120 (turtle) rumbo El rumbo actual es 180 (turtle) adelante 100 (turtle) (turtle) derecha 90 (turtle) adelante 100 (turtle) (turtle) derecha 90 (turtle) adelante 400 (turtle) derecha 90 (turtle) adelante 500 (turtle) derecha 90 (turtle) adelante 400 (turtle) derecha 90 (turtle) adelante 300 (turtle) reproducción espiral.cmd La posición actual es 0 0 Rumbo actual es 0 El rumbo actual es 180 (turtle) adiós Gracias por usar Turtle

source: ? (question mark)
es_es: ? (signo de interrogación)
ru: ? (знак вопроса)

source: in a command interpreter
es_es: en un intérprete de comandos
ru: в командном интерпретаторе

source: ! (exclamation)
es_es: ¡! (exclamación)
ru: ! (восклицание)
