Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/codeop.po
Languages: es_es, ru

source: :mod:`!codeop` --- Compile Python code
es_es: :mod:`!codeop` --- Compilar código Python

source: **Source code:** :source:`Lib/codeop.py`
es_es: **Código fuente:** :source:`Lib/codeop.py`
ru: **Мсходный код:** :source:`Lib/codeop.py`

source: The :mod:`codeop` module provides utilities upon which the Python read-eval-print loop can be emulated, as is done in the :mod:`code` module. As a result, you probably don't want to use the module directly; if you want to include such a loop in your program you probably want to use the :mod:`code` module instead.
es_es: El módulo :mod:`codeop` proporciona utilidades sobre las que se puede emular el bucle de lectura-evaluación-impresión de Python, como se hace en el módulo :mod:`code`. Como resultado, probablemente no quieras usar el módulo directamente; si quieres incluir un bucle de este tipo en tu programa, probablemente quieras usar el módulo :mod:`code` en su lugar.
ru: Модуль :mod:`codeop` предоставляет утилиты, с помощью которых можно эмулировать цикл чтения-оценки-печати Python, как это сделано в модуле :mod:`code`. В результате вы, вероятно, не захотите использовать модуль напрямую; если вы хотите включить такой цикл в свою программу, вы, вероятно, захотите вместо этого использовать модуль :mod:`code`.

source: There are two parts to this job:
es_es: Este trabajo consta de dos partes:
ru: Эта работа состоит из двух частей:

source: Being able to tell if a line of input completes a Python statement: in short, telling whether to print '``>>>``' or '``...``' next.
es_es: Ser capaz de saber si una línea de entrada completa una sentencia Python: en resumen, saber si imprimir '``>>>``' o '``...``' a continuación.
ru: Возможность определить, завершает ли строка ввода оператор Python: короче говоря, указание, следует ли печатать «``>>>>``' или '``...``' дальше.

source: Remembering which future statements the user has entered, so subsequent input can be compiled with these in effect.
es_es: Recordar qué declaraciones futuras ha introducido el usuario, de modo que las entradas posteriores puedan compilarse con éstas en vigor.
ru: Запоминает, какие будущие операторы ввел пользователь, поэтому последующий ввод может быть скомпилирован с их учетом.

source: The :mod:`codeop` module provides a way of doing each of these things, and a way of doing them both.
es_es: El módulo :mod:`codeop` proporciona una forma de hacer cada una de estas cosas, y una forma de hacer ambas.
ru: Модуль :mod:`codeop` предоставляет возможность выполнения каждой из этих задач, а также возможность выполнения обеих.

source: To do just the former:
es_es: Para hacer precisamente lo primero:
ru: Чтобы сделать только первое:

source: Tries to compile *source*, which should be a string of Python code and return a code object if *source* is valid Python code. In that case, the filename attribute of the code object will be *filename*, which defaults to ``'<input>'``. Returns ``None`` if *source* is *not* valid Python code, but is a prefix of valid Python code.
es_es: Intenta compilar *fuente*, que debería ser una cadena de código Python y devolver un objeto código si *fuente* es código Python válido. En ese caso, el atributo filename del objeto de código será *filename*, que por defecto es ``'<input>'``. Devuelve ``None`` si *fuente* es *no* código Python válido, pero es un prefijo de código Python válido.
ru: Пытается скомпилировать *source*, который должен представлять собой строку кода Python, и вернуть объект кода, если *source* является допустимым кодом Python. В этом случае атрибутом имени файла объекта кода будет *filename*, который по умолчанию имеет значение ``'<input>'``. Возвращает ``None``, если *source* *не* является допустимым кодом Python, но является префиксом допустимого кода Python.

source: If there is a problem with *source*, an exception will be raised. :exc:`SyntaxError` is raised if there is invalid Python syntax, and :exc:`OverflowError` or :exc:`ValueError` if there is an invalid literal.
es_es: Si hay un problema con *source*, se lanzará una excepción. :exc:`SyntaxError` se lanza si hay una sintaxis Python inválida, y :exc:`OverflowError` o :exc:`ValueError` si hay un literal inválido.
ru: Если есть проблема с *source*, будет выдано исключение. :exc:`SyntaxError` возникает, если существует неверный синтаксис Python, и :exc:`OverflowError` или :exc:`ValueError`, если существует недопустимый литерал.

source: The *symbol* argument determines whether *source* is compiled as a statement (``'single'``, the default), as a sequence of :term:`statement` (``'exec'``) or as an :term:`expression` (``'eval'``). Any other value will cause :exc:`ValueError` to be raised.
es_es: El argumento *symbol* determina si *source* se compila como una sentencia (``'single'``, por defecto), como una secuencia de :term:`statement` (``'exec'``) o como una :term:`expression` (``'eval'``). Cualquier otro valor provocará la aparición de :exc:`ValueError`.
ru: Аргумент *symbol* определяет, компилируется ли *source* как оператор («single», по умолчанию), как последовательность :term:`statement` (``'exec'``) или как :term:`expression` (``'eval'``). Любое другое значение приведет к возникновению :exc:`ValueError`.

source: It is possible (but not likely) that the parser stops parsing with a successful outcome before reaching the end of the source; in this case, trailing symbols may be ignored instead of causing an error. For example, a backslash followed by two newlines may be followed by arbitrary garbage. This will be fixed once the API for the parser is better.
es_es: Es posible (pero no probable) que el analizador deje de analizar con un resultado satisfactorio antes de llegar al final de la fuente; en este caso, los símbolos finales pueden ser ignorados en lugar de causar un error. Por ejemplo, una barra invertida seguida de dos nuevas líneas puede ir seguida de basura arbitraria. Esto se arreglará una vez que mejore la API del analizador sintáctico.
ru: Возможно (но маловероятно), что анализатор прекратит анализ с успешным результатом до достижения конца источника; в этом случае конечные символы могут игнорироваться, а не вызывать ошибку. Например, за обратной косой чертой, за которой следуют две новые строки, может следовать произвольный мусор. Это будет исправлено, как только API для парсера станет лучше.

source: Instances of this class have :meth:`~object.__call__` methods identical in signature to the built-in function :func:`compile`, but with the difference that if the instance compiles program text containing a :mod:`__future__` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
es_es: Las instancias de esta clase tienen métodos :meth:`~object.__call__` idénticos en firma a la función incorporada :func:`compile`, pero con la diferencia de que si la instancia compila un texto de programa que contiene una sentencia :mod:`__future__`, la instancia 'recuerda' y compila todos los textos de programa posteriores con la sentencia en vigor.
ru: Экземпляры этого класса имеют методы :meth:`~object.__call__`, идентичные по сигнатуре встроенной функции :func:`compile`, но с той разницей, что если экземпляр компилирует текст программы, содержащий :mod:`__future__` оператор, экземпляр «запоминает» и компилирует все последующие тексты программы с действующим оператором.

source: Instances of this class have :meth:`~object.__call__` methods identical in signature to :func:`compile_command`; the difference is that if the instance compiles program text containing a :mod:`__future__` statement, the instance 'remembers' and compiles all subsequent program texts with the statement in force.
es_es: Las instancias de esta clase tienen métodos :meth:`~object.__call__` idénticos en firma a :func:`compile_command`; la diferencia es que si la instancia compila un texto de programa que contiene una sentencia :mod:`__future__`, la instancia 'recuerda' y compila todos los textos de programa posteriores con la sentencia en vigor.
ru: Экземпляры этого класса имеют методы :meth:`~object.__call__`, идентичные по сигнатуре методам :func:`compile_command`; разница в том, что если экземпляр компилирует текст программы, содержащий оператор :mod:`__future__`, экземпляр "запоминает" и компилирует все последующие тексты программы с действующим оператором.
