Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/concurrent.futures.po
Languages: es_es, pt_pt

source: :mod:`!concurrent.futures` --- Launching parallel tasks
es_es: :mod:`!concurrent.futures` --- Lanzamiento de tareas paralelas
pt_pt: :mod:`!concurrent.futures` — Lançamento de tarefas paralelas

source: **Source code:** :source:`Lib/concurrent/futures/thread.py`, :source:`Lib/concurrent/futures/process.py`, and :source:`Lib/concurrent/futures/interpreter.py`
pt_pt: **Código-fonte:** :source:`Lib/concurrent/futures/thread.py`, :source:`Lib/concurrent/futures/process.py` e :source:`Lib/concurrent/futures/interpreter.py`

source: The :mod:`concurrent.futures` module provides a high-level interface for asynchronously executing callables.
es_es: El módulo :mod:`concurrent.futures` proporciona una interfaz de alto nivel para la ejecución asíncrona de callables.
pt_pt: O módulo :mod:`concurrent.futures` fornece uma interface de alto nível para executar objetos chamáveis de forma assíncrona.

source: The asynchronous execution can be performed with threads, using :class:`ThreadPoolExecutor` or :class:`InterpreterPoolExecutor`, or separate processes, using :class:`ProcessPoolExecutor`. Each implements the same interface, which is defined by the abstract :class:`Executor` class.
pt_pt: A execução assíncrona pode ser realizada com threads, usando :class:`ThreadPoolExecutor` ou :class:`InterpreterPoolExecutor`, ou com processos separados, usando :class:`ProcessPoolExecutor`. Cada um implementa a mesma interface, que é definida pela classe abstrata :class:`Executor`.

source: Availability
es_es: Disponibilidad
pt_pt: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_pt: Este módulo não funciona ou não está disponível em WebAssembly. Consulte :ref:`wasm-availability` para mais informações.

source: Executor Objects
es_es: Objetos ejecutores
pt_pt: Objetos Executor

source: An abstract class that provides methods to execute calls asynchronously. It should not be used directly, but through its concrete subclasses.
es_es: Clase abstracta que proporciona métodos para ejecutar llamadas de forma asíncrona. No debe utilizarse directamente, sino a través de sus subclases concretas.
pt_pt: Uma classe abstrata que fornece métodos para executar chamadas de forma assíncrona. Não deve ser usada diretamente, mas através das suas subclasses concretas.

source: Schedules the callable, *fn*, to be executed as ``fn(*args, **kwargs)`` and returns a :class:`Future` object representing the execution of the callable. ::
es_es: Programa la llamada, *fn*, para que se ejecute como ``fn(*args, **kwargs)`` y devuelve un objeto :class:`Future` que representa la ejecución de la llamada. ::
pt_pt: Agenda a execução do objeto chamável, *fn*, como ``fn(*args, **kwargs)`` e devolve um objeto :class:`Future` que representa a execução do objeto chamável.

source: Similar to :func:`map(fn, *iterables) <map>` except:
es_es: Similar a :func:`map(fn, *iterables) <map>` excepto:
pt_pt: Semelhante a :func:`map(fn, *iterables) <map>`, exceto:

source: The *iterables* are collected immediately rather than lazily, unless a *buffersize* is specified to limit the number of submitted tasks whose results have not yet been yielded. If the buffer is full, iteration over the *iterables* pauses until a result is yielded from the buffer.
pt_pt: Os *iterables* são recolhidos imediatamente em vez de de forma preguiçosa, a menos que um *buffersize* seja especificado para limitar o número de tarefas submetidas cujos resultados ainda não foram produzidos. Se o buffer estiver cheio, a iteração sobre os *iterables* pausará até que um resultado seja produzido a partir do buffer.

source: *fn* is executed asynchronously and several calls to *fn* may be made concurrently.
es_es: *fn* se ejecuta de forma asíncrona y pueden realizarse varias llamadas a *fn* simultáneamente.
pt_pt: *fn* é executado de forma assíncrona e várias chamadas a *fn* podem ser feitas concorrentemente.

source: The returned iterator raises a :exc:`TimeoutError` if :meth:`~iterator.__next__` is called and the result isn't available after *timeout* seconds from the original call to :meth:`Executor.map`. *timeout* can be an int or a float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
es_es: El iterador devuelto genera un :exc:`TimeoutError` si se llama a :meth:`~iterator.__next__` y el resultado no está disponible después de *timeout* segundos desde la llamada original a :meth:`Executor.map`. *timeout* puede ser un int o un float. Si *timeout* no se especifica o ``None``, no hay límite para el tiempo de espera.
pt_pt: O iterador devolvido levanta uma exceção :exc:`TimeoutError` se :meth:`~iterator.__next__` for chamado e o resultado não estiver disponível após *timeout* segundos desde a chamada original a :meth:`Executor.map`. *timeout* pode ser um inteiro ou um float. Se *timeout* não for especificado ou for ``None``, não há limite para o tempo de espera.

source: If a *fn* call raises an exception, then that exception will be raised when its value is retrieved from the iterator.
es_es: Si una llamada *fn* lanza una excepción, entonces esa excepción será lanzada cuando su valor sea recuperado del iterador.
pt_pt: Se uma chamada a *fn* levantar uma exceção, essa exceção será levantada quando o seu valor for recuperado do iterador.

source: When using :class:`ProcessPoolExecutor`, this method chops *iterables* into a number of chunks which it submits to the pool as separate tasks. The (approximate) size of these chunks can be specified by setting *chunksize* to a positive integer. For very long iterables, using a large value for *chunksize* can significantly improve performance compared to the default size of 1. With :class:`ThreadPoolExecutor` and :class:`InterpreterPoolExecutor`, *chunksize* has no effect.
pt_pt: Ao usar :class:`ProcessPoolExecutor`, este método divide os *iterables* em vários pedaços que são submetidos ao pool como tarefas separadas. O tamanho (aproximado) destes pedaços pode ser especificado definindo *chunksize* como um inteiro positivo. Para iteráveis muito longos, usar um valor grande para *chunksize* pode melhorar significativamente o desempenho em comparação com o tamanho predefinido de 1. Com :class:`ThreadPoolExecutor` e :class:`InterpreterPoolExecutor`, *chunksize* não tem efeito.

source: Added the *chunksize* parameter.
pt_pt: Adicionado o parâmetro *chunksize*.

source: Added the *buffersize* parameter.
pt_pt: Adicionado o parâmetro *buffersize*.

source: Signal the executor that it should free any resources that it is using when the currently pending futures are done executing. Calls to :meth:`Executor.submit` and :meth:`Executor.map` made after shutdown will raise :exc:`RuntimeError`.
es_es: Indica al ejecutor que debe liberar los recursos que esté utilizando cuando los futuros pendientes en ese momento hayan terminado de ejecutarse. Las llamadas a :meth:`Executor.submit` y :meth:`Executor.map` realizadas después de la desconexión activarán :exc:`RuntimeError`.
pt_pt: Sinaliza ao executor que deve libertar quaisquer recursos que esteja a usar quando os futuros atualmente pendentes terminarem a execução. Chamadas a :meth:`Executor.submit` e :meth:`Executor.map` feitas após o shutdown levantarão :exc:`RuntimeError`.

source: If *wait* is ``True`` then this method will not return until all the pending futures are done executing and the resources associated with the executor have been freed. If *wait* is ``False`` then this method will return immediately and the resources associated with the executor will be freed when all pending futures are done executing. Regardless of the value of *wait*, the entire Python program will not exit until all pending futures are done executing.
es_es: Si *wait* es ``True`` entonces este método no retornará hasta que todos los futuros pendientes hayan terminado de ejecutarse y los recursos asociados con el ejecutor hayan sido liberados. Si *wait* es ``False`` entonces este método retornará inmediatamente y los recursos asociados con el ejecutor serán liberados cuando todos los futuros pendientes hayan terminado de ejecutarse. Independientemente del valor de *wait*, todo el programa Python no saldrá hasta que todos los futuros pendientes hayan terminado de ejecutarse.
pt_pt: Se *wait* for ``True``, este método não retornará até que todos os futuros pendentes terminem a execução e os recursos associados ao executor tenham sido libertados. Se *wait* for ``False``, este método retornará imediatamente e os recursos associados ao executor serão libertados quando todos os futuros pendentes terminarem a execução. Independentemente do valor de *wait*, todo o programa Python não sairá até que todos os futuros pendentes terminem a execução.

source: If *cancel_futures* is ``True``, this method will cancel all pending futures that the executor has not started running. Any futures that are completed or running won't be cancelled, regardless of the value of *cancel_futures*.
es_es: Si *cancel_futures* es ``True``, este método cancelará todos los futuros pendientes que el ejecutor no haya empezado a ejecutar. Cualquier futuro que esté completado o en ejecución no será cancelado, independientemente del valor de *cancel_futures*.
pt_pt: Se *cancel_futures* for ``True``, este método cancelará todos os futuros pendentes que o executor ainda não começou a executar. Quaisquer futuros que já estejam concluídos ou em execução não serão cancelados, independentemente do valor de *cancel_futures*.

source: If both *cancel_futures* and *wait* are ``True``, all futures that the executor has started running will be completed prior to this method returning. The remaining futures are cancelled.
es_es: Si tanto *cancel_futures* como *wait* son ``True``, todos los futuros que el ejecutor haya empezado a ejecutar se completarán antes de que este método regrese. Los futuros restantes se cancelan.
pt_pt: Se *cancel_futures* e *wait* forem ambos ``True``, todos os futuros que o executor já começou a executar serão concluídos antes deste método retornar. Os futuros restantes são cancelados.

source: You can avoid having to call this method explicitly if you use the executor as a :term:`context manager` via the :keyword:`with` statement, which will shutdown the :class:`Executor` (waiting as if :meth:`Executor.shutdown` were called with *wait* set to ``True``)::
pt_pt: Pode evitar ter de chamar este método explicitamente se usar o executor como um :term:`gestor de contexto` através da instrução :keyword:`with`, que encerrará o :class:`Executor` (aguardando como se :meth:`Executor.shutdown` fosse chamado com *wait* definido como ``True``):

source: Added *cancel_futures*.
es_es: Añadido *cancel_futures*.
pt_pt: Adicionado *cancel_futures*.

source: :class:`ThreadPoolExecutor` is an :class:`Executor` subclass that uses a pool of threads to execute calls asynchronously.
es_es: :class:`ThreadPoolExecutor` es una subclase de :class:`Executor` que utiliza un pool de hilos para ejecutar llamadas de forma asíncrona.
pt_pt: :class:`ThreadPoolExecutor` é uma subclasse de :class:`Executor` que usa um pool de threads para executar chamadas de forma assíncrona.

source: Deadlocks can occur when the callable associated with a :class:`Future` waits on the results of another :class:`Future`. For example::
es_es: Pueden producirse bloqueos cuando la llamada asociada a :class:`Future` espera los resultados de otra :class:`Future`. Por ejemplo::
pt_pt: Podem ocorrer deadlocks quando o objeto chamável associado a um :class:`Future` aguarda pelos resultados de outro :class:`Future`. Por exemplo::

source: import time def wait_on_b(): time.sleep(5) print(b.result()) # b will never complete because it is waiting on a. return 5 def wait_on_a(): time.sleep(5) print(a.result()) # a will never complete because it is waiting on b. return 6 executor = ThreadPoolExecutor(max_workers=2) a = executor.submit(wait_on_b) b = executor.submit(wait_on_a)
es_es: import time def wait_on_b(): time.sleep(5) print(b.result()) # b nunca se completará porque está esperando a a. return 5 def wait_on_a(): time.sleep(5) print(a.result()) # a nunca se completará porque está esperando a b. return 6 executor = ThreadPoolExecutor(max_workers=2) a = executor.submit(wait_on_b) b = executor.submit(wait_on_a)
pt_pt: import time def wait_on_b(): time.sleep(5) print(b.result()) # b nunca será concluído porque está à espera de a. return 5 def wait_on_a(): time.sleep(5) print(a.result()) # a nunca será concluído porque está à espera de b. return 6 executor = ThreadPoolExecutor(max_workers=2) a = executor.submit(wait_on_b) b = executor.submit(wait_on_a)

source: And::
es_es: Y::
pt_pt: E::

source: def wait_on_future(): f = executor.submit(pow, 5, 2) # This will never complete because there is only one worker thread and # it is executing this function. print(f.result()) executor = ThreadPoolExecutor(max_workers=1) executor.submit(wait_on_future)
es_es: def wait_on_future()): f = executor.submit(pow, 5, 2) # Esto nunca se completará porque sólo hay un hilo trabajador y # está ejecutando esta función. print(f.result()) executor = ThreadPoolExecutor(max_trabajadores=1) executor.submit(wait_on_future)
pt_pt: def wait_on_future(): f = executor.submit(pow, 5, 2) # Isto nunca será concluído porque só existe uma thread de trabalho e # está a executar esta função. print(f.result()) executor = ThreadPoolExecutor(max_workers=1) executor.submit(wait_on_future)

source: An :class:`Executor` subclass that uses a pool of at most *max_workers* threads to execute calls asynchronously.
es_es: Una subclase de :class:`Executor` que utiliza un grupo de como máximo *max_workers* hilos para ejecutar llamadas de forma asíncrona.
pt_pt: Uma subclasse de :class:`Executor` que usa um pool de no máximo *max_workers* threads para executar chamadas de forma assíncrona.

source: All threads enqueued to ``ThreadPoolExecutor`` will be joined before the interpreter can exit. Note that the exit handler which does this is executed *before* any exit handlers added using ``atexit``. This means exceptions in the main thread must be caught and handled in order to signal threads to exit gracefully. For this reason, it is recommended that ``ThreadPoolExecutor`` not be used for long-running tasks.
es_es: Todos los hilos en cola a ``ThreadPoolExecutor`` se unirán antes de que el intérprete pueda salir. Tenga en cuenta que el manejador de salida que hace esto se ejecuta *antes* que cualquier manejador de salida añadido usando ``atexit``. Esto significa que las excepciones en el subproceso principal deben ser capturadas y manejadas para indicar a los subprocesos que salgan correctamente. Por esta razón, se recomienda no utilizar ``ThreadPoolExecutor`` para tareas de larga duración.
pt_pt: Todas as threads enfileiradas para ``ThreadPoolExecutor`` serão unidas antes de o interpretador poder sair. Note que o manipulador de saída que faz isto é executado *antes* de quaisquer manipuladores de saída adicionados usando ``atexit``. Isto significa que as exceções no thread principal devem ser capturadas e tratadas para sinalizar às threads que saiam de forma elegante. Por esta razão, recomenda-se que ``ThreadPoolExecutor`` não seja usado para tarefas de longa duração.

source: *initializer* is an optional callable that is called at the start of each worker thread; *initargs* is a tuple of arguments passed to the initializer. Should *initializer* raise an exception, all currently pending jobs will raise a :exc:`~concurrent.futures.thread.BrokenThreadPool`, as well as any attempt to submit more jobs to the pool.
es_es: *initializer* es una llamada opcional que se realiza al inicio de cada subproceso del trabajador; *initargs* es una tupla de argumentos pasados al inicializador. Si *initializer* lanza una excepción, todos los trabajos pendientes lanzarán un :exc:`~concurrent.futures.thread.BrokenThreadPool`, así como cualquier intento de enviar más trabajos al pool.
pt_pt: *initializer* é um objeto chamável opcional que é chamado no início de cada thread de trabalho; *initargs* é um tuplo de argumentos passados ao inicializador. Se *initializer* levantar uma exceção, todas as tarefas atualmente pendentes levantarão uma :exc:`~concurrent.futures.thread.BrokenThreadPool`, bem como qualquer tentativa de submeter mais tarefas ao pool.

source: If *max_workers* is ``None`` or not given, it will default to the number of processors on the machine, multiplied by ``5``, assuming that :class:`ThreadPoolExecutor` is often used to overlap I/O instead of CPU work and the number of workers should be higher than the number of workers for :class:`ProcessPoolExecutor`.
es_es: Si *max_workers* es ``None`` o no se indica, por defecto será el número de procesadores de la máquina, multiplicado por ``5``, asumiendo que :class:`ThreadPoolExecutor` se utiliza a menudo para solapar trabajo de E/S en lugar de trabajo de CPU y el número de trabajadores debería ser mayor que el número de trabajadores para :class:`ProcessPoolExecutor`.
pt_pt: Se *max_workers* for ``None`` ou não for especificado, o valor predefinido será o número de processadores na máquina, multiplicado por ``5``, assumindo que :class:`ThreadPoolExecutor` é frequentemente usado para sobrepor E/S em vez de trabalho de CPU e que o número de trabalhadores deve ser maior do que o número de trabalhadores para :class:`ProcessPoolExecutor`.

source: Added the *thread_name_prefix* parameter to allow users to control the :class:`threading.Thread` names for worker threads created by the pool for easier debugging.
es_es: Se ha añadido el parámetro *thread_name_prefix* para permitir a los usuarios controlar los nombres :class:`threading.Thread` de los hilos de trabajo creados por el pool para facilitar la depuración.
pt_pt: Adicionado o parâmetro *thread_name_prefix* para permitir que os utilizadores controlem os nomes das :class:`threading.Thread` para threads de trabalho criadas pelo pool, facilitando a depuração.

source: Added the *initializer* and *initargs* arguments.
es_es: Añadidos los argumentos *initializer* e *initargs*.
pt_pt: Adicionados os argumentos *initializer* e *initargs*.

source: Default value of *max_workers* is changed to ``min(32, os.cpu_count() + 4)``. This default value preserves at least 5 workers for I/O bound tasks. It utilizes at most 32 CPU cores for CPU bound tasks which release the GIL. And it avoids using very large resources implicitly on many-core machines.
es_es: El valor por defecto de *max_workers* se cambia a ``min(32, os.cpu_count() + 4)``. Este valor por defecto preserva al menos 5 trabajadores para tareas ligadas a E/S. Utiliza como máximo 32 núcleos de CPU para tareas ligadas a CPU que liberan el GIL. Y evita el uso implícito de recursos muy grandes en máquinas de muchos núcleos.
pt_pt: O valor predefinido de *max_workers* foi alterado para ``min(32, os.cpu_count() + 4)``. Este valor predefinido preserva pelo menos 5 trabalhadores para tarefas limitadas por E/S. Utiliza no máximo 32 núcleos de CPU para tarefas limitadas por CPU que libertam o GIL. E evita o uso implícito de recursos muito grandes em máquinas com muitos núcleos.

source: ThreadPoolExecutor now reuses idle worker threads before starting *max_workers* worker threads too.
es_es: ThreadPoolExecutor ahora reutiliza los hilos de trabajo inactivos antes de iniciar también los hilos de trabajo *max_workers*.
pt_pt: ThreadPoolExecutor agora reutiliza threads de trabalho ociosos antes de iniciar demasiadas threads de trabalho *max_workers*.

source: Default value of *max_workers* is changed to ``min(32, (os.process_cpu_count() or 1) + 4)``.
pt_pt: O valor predefinido de *max_workers* foi alterado para ``min(32, (os.process_cpu_count() or 1) + 4)``.

source: ThreadPoolExecutor Example
pt_pt: Exemplo de ThreadPoolExecutor

source: import concurrent.futures import urllib.request URLS = ['http://www.foxnews.com/', 'http://www.cnn.com/', 'http://europe.wsj.com/', 'http://www.bbc.co.uk/', 'http://nonexistent-subdomain.python.org/'] # Retrieve a single page and report the URL and contents def load_url(url, timeout): with urllib.request.urlopen(url, timeout=timeout) as conn: return conn.read() # We can use a with statement to ensure threads are cleaned up promptly with concurrent.futures.ThreadPoolExecutor(max_workers=5) as executor: # Start the load operations and mark each future with its URL future_to_url = {executor.submit(load_url, url, 60): url for url in URLS} for future in concurrent.futures.as_completed(future_to_url): url = future_to_url[future] try: data = future.result() except Exception as exc: print('%r generated an exception: %s' % (url, exc)) else: print('%r page is %d bytes' % (url, len(data)))
pt_pt: import concurrent.futures import urllib.request URLS = ['http://www.foxnews.com/', 'http://www.cnn.com/', 'http://europe.wsj.com/', 'http://www.bbc.co.uk/', 'http://nonexistent-subdomain.python.org/'] # Obter uma única página e reportar a URL e o conteúdo def load_url(url, timeout): with urllib.request.urlopen(url, timeout=timeout) as conn: return conn.read() # Podemos usar uma instrução with para garantir que as threads são limpas prontamente with concurrent.futures.ThreadPoolExecutor(max_workers=5) as executor: # Iniciar as operações de carregamento e marcar cada futuro com a sua URL future_to_url = {executor.submit(load_url, url, 60): url for url in URLS} for future in concurrent.futures.as_completed(future_to_url): url = future_to_url[future] try: data = future.result() except Exception as exc: print('%r gerou uma exceção: %s' % (url, exc)) else: print('%r a página tem %d bytes' % (url, len(data)))

source: The :class:`InterpreterPoolExecutor` class uses a pool of interpreters to execute calls asynchronously. It is a :class:`ThreadPoolExecutor` subclass, which means each worker is running in its own thread. The difference here is that each worker has its own interpreter, and runs each task using that interpreter.
pt_pt: A classe :class:`InterpreterPoolExecutor` usa um pool de interpretadores para executar chamadas de forma assíncrona. É uma subclasse de :class:`ThreadPoolExecutor`, o que significa que cada trabalhador está a executar na sua própria thread. A diferença aqui é que cada trabalhador tem o seu próprio interpretador e executa cada tarefa usando esse interpretador.

source: The biggest benefit to using interpreters instead of only threads is true multi-core parallelism. Each interpreter has its own :term:`Global Interpreter Lock <global interpreter lock>`, so code running in one interpreter can run on one CPU core, while code in another interpreter runs unblocked on a different core.
pt_pt: O maior benefício de usar interpretadores em vez de apenas threads é o paralelismo verdadeiro multi-núcleo. Cada interpretador tem o seu próprio :term:`Global Interpreter Lock <global interpreter lock>`, pelo que o código a executar num interpretador pode executar num núcleo de CPU, enquanto o código noutro interpretador executa sem bloqueio noutro núcleo.
