Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/concurrent.futures.po
Languages: es_es, pt_pt

source: Return the value returned by the call. If the call hasn't yet completed then this method will wait up to *timeout* seconds. If the call hasn't completed in *timeout* seconds, then a :exc:`TimeoutError` will be raised. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
es_es: Devuelve el valor devuelto por la llamada. Si la llamada aún no se ha completado, este método esperará hasta *timeout* segundos. Si la llamada no se ha completado en *timeout* segundos, se mostrará un mensaje :exc:`TimeoutError`. *timeout* puede ser un int o un float. Si *timeout* no se especifica o ``None``, no hay límite para el tiempo de espera.
pt_pt: Devolve o valor retornado pela chamada. Se a chamada ainda não tiver sido concluída, este método aguardará até *timeout* segundos. Se a chamada não for concluída em *timeout* segundos, será levantada uma exceção :exc:`TimeoutError`. *timeout* pode ser um inteiro ou um float. Se *timeout* não for especificado ou for ``None``, não há limite para o tempo de espera.

source: If the future is cancelled before completing then :exc:`.CancelledError` will be raised.
es_es: Si el futuro se cancela antes de completarse, se creará :exc:`.CancelledError`.
pt_pt: Se o futuro for cancelado antes de ser concluído, será levantada uma exceção :exc:`.CancelledError`.

source: If the call raised an exception, this method will raise the same exception.
es_es: Si la llamada lanzó una excepción, este método lanzará la misma excepción.
pt_pt: Se a chamada tiver levantado uma exceção, este método levantará a mesma exceção.

source: Return the exception raised by the call. If the call hasn't yet completed then this method will wait up to *timeout* seconds. If the call hasn't completed in *timeout* seconds, then a :exc:`TimeoutError` will be raised. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
es_es: Devuelve la excepción lanzada por la llamada. Si la llamada aún no se ha completado, este método esperará hasta *timeout* segundos. Si la llamada no se ha completado en *timeout* segundos, entonces se lanzará un :exc:`TimeoutError`. *timeout* puede ser un int o un float. Si *timeout* no se especifica o ``None``, no hay límite para el tiempo de espera.
pt_pt: Devolve a exceção levantada pela chamada. Se a chamada ainda não tiver sido concluída, este método aguardará até *timeout* segundos. Se a chamada não for concluída em *timeout* segundos, será levantada uma exceção :exc:`TimeoutError`. *timeout* pode ser um inteiro ou um float. Se *timeout* não for especificado ou for ``None``, não há limite para o tempo de espera.

source: If the call completed without raising, ``None`` is returned.
es_es: Si la llamada finaliza sin elevarse, se devuelve ``None``.
pt_pt: Se a chamada for concluída sem levantar exceções, ``None`` é devolvido.

source: Attaches the callable *fn* to the future. *fn* will be called, with the future as its only argument, when the future is cancelled or finishes running.
es_es: Adjunta la llamada *fn* al futuro. *fn* será llamada, con el futuro como único argumento, cuando el futuro se cancele o termine de ejecutarse.
pt_pt: Anexa o objeto chamável *fn* ao futuro. *fn* será chamado, com o futuro como seu único argumento, quando o futuro for cancelado ou terminar a execução.

source: Added callables are called in the order that they were added and are always called in a thread belonging to the process that added them. If the callable raises an :exc:`Exception` subclass, it will be logged and ignored. If the callable raises a :exc:`BaseException` subclass, the behavior is undefined.
es_es: Las llamadas añadidas se ejecutan en el orden en que fueron añadidas y siempre se ejecutan en un subproceso perteneciente al proceso que las añadió. Si la llamada genera una subclase :exc:`Exception`, será registrada e ignorada. Si la llamada genera una subclase :exc:`BaseException`, el comportamiento es indefinido.
pt_pt: Os objetos chamáveis adicionados são chamados pela ordem em que foram adicionados e são sempre chamados numa thread pertencente ao processo que os adicionou. Se o objeto chamável levantar uma subclasse de :exc:`Exception`, será registado e ignorado. Se o objeto chamável levantar uma subclasse de :exc:`BaseException`, o comportamento é indefinido.

source: If the future has already completed or been cancelled, *fn* will be called immediately.
es_es: Si el futuro ya se ha completado o cancelado, *fn* será llamado inmediatamente.
pt_pt: Se o futuro já tiver sido concluído ou cancelado, *fn* será chamado imediatamente.

source: The following :class:`Future` methods are meant for use in unit tests and :class:`Executor` implementations.
es_es: Los siguientes métodos de :class:`Future` están pensados para su uso en pruebas unitarias e implementaciones de :class:`Executor`.
pt_pt: Os seguintes métodos de :class:`Future` são destinados a serem usados em testes unitários e implementações de :class:`Executor`.

source: This method should only be called by :class:`Executor` implementations before executing the work associated with the :class:`Future` and by unit tests.
es_es: Este método sólo debe ser llamado por las implementaciones de :class:`Executor` antes de ejecutar el trabajo asociado a :class:`Future` y por las pruebas unitarias.
pt_pt: Este método só deve ser chamado por implementações de :class:`Executor` antes de executar o trabalho associado ao :class:`Future` e por testes unitários.

source: If the method returns ``False`` then the :class:`Future` was cancelled, i.e. :meth:`Future.cancel` was called and returned ``True``. Any threads waiting on the :class:`Future` completing (i.e. through :func:`as_completed` or :func:`wait`) will be woken up.
es_es: Si el método devuelve ``False`` entonces el :class:`Future` fue cancelado, es decir, :meth:`Future.cancel` fue llamado y devolvió ``True``. Cualquier hilo que esté esperando la finalización de :class:`Future` (es decir, a través de :func:`as_completed` o :func:`wait`) será despertado.
pt_pt: Se o método devolver ``False``, então o :class:`Future` foi cancelado, ou seja, :meth:`Future.cancel` foi chamado e devolveu ``True``. Quaisquer threads à espera que o :class:`Future` seja concluído (por exemplo, através de :func:`as_completed` ou :func:`wait`) serão acordadas.

source: If the method returns ``True`` then the :class:`Future` was not cancelled and has been put in the running state, i.e. calls to :meth:`Future.running` will return ``True``.
es_es: Si el método devuelve ``True`` entonces el :class:`Future` no se ha cancelado y se ha puesto en estado de ejecución, es decir, las llamadas a :meth:`Future.running` devolverán ``True``.
pt_pt: Se o método devolver ``True``, então o :class:`Future` não foi cancelado e foi colocado no estado de execução, ou seja, chamadas a :meth:`Future.running` devolverão ``True``.

source: This method can only be called once and cannot be called after :meth:`Future.set_result` or :meth:`Future.set_exception` have been called.
es_es: Este método sólo puede invocarse una vez y no puede invocarse después de haber invocado :meth:`Future.set_result` o :meth:`Future.set_exception`.
pt_pt: Este método só pode ser chamado uma vez e não pode ser chamado após :meth:`Future.set_result` ou :meth:`Future.set_exception` terem sido chamados.

source: Sets the result of the work associated with the :class:`Future` to *result*.
es_es: Establece el resultado del trabajo asociado a :class:`Future` en *result*.
pt_pt: Define o resultado do trabalho associado ao :class:`Future` como *result*.

source: This method should only be used by :class:`Executor` implementations and unit tests.
es_es: Este método sólo debe ser utilizado por :class:`Executor` implementaciones y pruebas unitarias.
pt_pt: Este método só deve ser usado por implementações de :class:`Executor` e testes unitários.

source: This method raises :exc:`concurrent.futures.InvalidStateError` if the :class:`Future` is already done.
es_es: Este método muestra :exc:`concurrent.futures.InvalidStateError` si :class:`Future` ya está hecho.
pt_pt: Este método levanta :exc:`concurrent.futures.InvalidStateError` se o :class:`Future` já estiver concluído.

source: Sets the result of the work associated with the :class:`Future` to the :class:`Exception` *exception*.
es_es: Establece el resultado del trabajo asociado con la :class:`Future` a la :class:`Exception` *exception*.
pt_pt: Define o resultado do trabalho associado ao :class:`Future` como a exceção :class:`Exception` *exception*.

source: Module Functions
es_es: Funciones del módulo
pt_pt: Funções do Módulo

source: Wait for the :class:`Future` instances (possibly created by different :class:`Executor` instances) given by *fs* to complete. Duplicate futures given to *fs* are removed and will be returned only once. Returns a named 2-tuple of sets. The first set, named ``done``, contains the futures that completed (finished or cancelled futures) before the wait completed. The second set, named ``not_done``, contains the futures that did not complete (pending or running futures).
es_es: Espera a que se completen las instancias de :class:`Future` (posiblemente creadas por diferentes instancias de :class:`Executor` ) dadas por *fs*. Los futuros duplicados dados a *fs* se eliminan y se devolverán sólo una vez. Devuelve una 2-tupla de conjuntos con nombre. El primer conjunto, llamado ``done``, contiene los futuros que se completaron (futuros terminados o cancelados) antes de que se completara la espera. El segundo conjunto, denominado ``not_done``, contiene los futuros que no se completaron (futuros pendientes o en ejecución).
pt_pt: Aguarda que as instâncias de :class:`Future` (possivelmente criadas por diferentes instâncias de :class:`Executor`) dadas por *fs* sejam concluídas. Futuros duplicados fornecidos a *fs* são removidos e serão devolvidos apenas uma vez. Devolve um tuplo nomeado de 2 conjuntos. O primeiro conjunto, chamado ``done``, contém os futuros que foram concluídos (futuros terminados ou cancelados) antes de a espera ser concluída. O segundo conjunto, chamado ``not_done``, contém os futuros que não foram concluídos (futuros pendentes ou em execução).

source: *timeout* can be used to control the maximum number of seconds to wait before returning. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
es_es: *timeout* se puede utilizar para controlar el número máximo de segundos que se debe esperar antes de volver. *timeout* puede ser un int o un float. Si *timeout* no se especifica o ``None``, no hay límite para el tiempo de espera.
pt_pt: *timeout* pode ser usado para controlar o número máximo de segundos a aguardar antes de retornar. *timeout* pode ser um inteiro ou um float. Se *timeout* não for especificado ou for ``None``, não há limite para o tempo de espera.

source: *return_when* indicates when this function should return. It must be one of the following constants:
es_es: *return_when* indica cuándo debe retornar esta función. Debe ser una de las siguientes constantes:
pt_pt: *return_when* indica quando esta função deve retornar. Deve ser uma das seguintes constantes:

source: Constant
es_es: Constante
pt_pt: Constante

source: Description
pt_pt: Descrição

source: The function will return when any future finishes or is cancelled.
es_es: La función volverá cuando cualquier futuro termine o se cancele.
pt_pt: A função retornará quando qualquer futuro terminar ou for cancelado.

source: The function will return when any future finishes by raising an exception. If no future raises an exception then it is equivalent to :const:`ALL_COMPLETED`.
es_es: La función regresará cuando cualquier futuro termine lanzando una excepción. Si ningún futuro lanza una excepción entonces es equivalente a :const:`ALL_COMPLETED`.
pt_pt: A função retornará quando qualquer futuro terminar levantando uma exceção. Se nenhum futuro levantar uma exceção, então é equivalente a :const:`ALL_COMPLETED`.

source: The function will return when all futures finish or are cancelled.
es_es: La función regresará cuando todos los futuros finalicen o se cancelen.
pt_pt: A função retornará quando todos os futuros terminarem ou forem cancelados.

source: Returns an iterator over the :class:`Future` instances (possibly created by different :class:`Executor` instances) given by *fs* that yields futures as they complete (finished or cancelled futures). Any futures given by *fs* that are duplicated will be returned once. Any futures that completed before :func:`as_completed` is called will be yielded first. The returned iterator raises a :exc:`TimeoutError` if :meth:`~iterator.__next__` is called and the result isn't available after *timeout* seconds from the original call to :func:`as_completed`. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
es_es: Devuelve un iterador sobre las instancias de :class:`Future` (posiblemente creadas por diferentes instancias de :class:`Executor` ) dadas por *fs* que devuelve futuros a medida que se completan (futuros finalizados o cancelados). Cualquier futuro dado por *fs* que esté duplicado será devuelto una vez. Cualquier futuro que se haya completado antes de llamar a :func:`as_completed` se devolverá primero. El iterador devuelto genera un :exc:`TimeoutError` si se llama a :meth:`~iterator.__next__` y el resultado no está disponible después de *timeout* segundos desde la llamada original a :func:`as_completed`. *timeout* puede ser un int o un float. Si *timeout* no se especifica o ``None``, no hay límite para el tiempo de espera.
pt_pt: Devolve um iterador sobre as instâncias de :class:`Future` (possivelmente criadas por diferentes instâncias de :class:`Executor`) dadas por *fs* que produz futuros à medida que são concluídos (futuros terminados ou cancelados). Quaisquer futuros dados por *fs* que sejam duplicados serão devolvidos uma vez. Quaisquer futuros que tenham sido concluídos antes de :func:`as_completed` ser chamado serão produzidos primeiro. O iterador devolvido levanta uma exceção :exc:`TimeoutError` se :meth:`~iterator.__next__` for chamado e o resultado não estiver disponível após *timeout* segundos desde a chamada original a :func:`as_completed`. *timeout* pode ser um inteiro ou um float. Se *timeout* não for especificado ou for ``None``, não há limite para o tempo de espera.

source: :pep:`3148` -- futures - execute computations asynchronously
es_es: :pep:`3148` -- futures: ejecutan cálculos de forma asíncrona.
pt_pt: :pep:`3148` — futuros — executar cálculos de forma assíncrona

source: The proposal which described this feature for inclusion in the Python standard library.
es_es: La propuesta que describía esta característica para su inclusión en la biblioteca estándar de Python.
pt_pt: A proposta que descreveu esta funcionalidade para inclusão na biblioteca padrão do Python.

source: Exception classes
es_es: Clases de excepción
pt_pt: Classes de Exceção

source: Raised when a future is cancelled.
es_es: Aparece cuando se cancela un futuro.
pt_pt: Levantada quando um futuro é cancelado.

source: A deprecated alias of :exc:`TimeoutError`, raised when a future operation exceeds the given timeout.
es_es: Un alias obsoleto de :exc:`TimeoutError`, que se activa cuando una operación futura supera el tiempo de espera dado.
pt_pt: Um alias obsoleto de :exc:`TimeoutError`, levantado quando uma operação futura excede o tempo limite dado.

source: This class was made an alias of :exc:`TimeoutError`.
es_es: Esta clase se convirtió en un alias de :exc:`TimeoutError`.
pt_pt: Esta classe tornou-se um alias de :exc:`TimeoutError`.

source: Derived from :exc:`RuntimeError`, this exception class is raised when an executor is broken for some reason, and cannot be used to submit or execute new tasks.
es_es: Derivada de :exc:`RuntimeError`, esta clase de excepción se lanza cuando un ejecutor está roto por alguna razón, y no se puede utilizar para enviar o ejecutar nuevas tareas.
pt_pt: Derivada de :exc:`RuntimeError`, esta classe de exceção é levantada quando um executor está avariado por algum motivo e não pode ser usado para submeter ou executar novas tarefas.

source: Raised when an operation is performed on a future that is not allowed in the current state.
es_es: Se produce cuando se realiza una operación en un futuro que no está permitida en el estado actual.
pt_pt: Levantada quando uma operação é realizada num futuro que não é permitida no estado atual.

source: Derived from :exc:`~concurrent.futures.BrokenExecutor`, this exception class is raised when one of the workers of a :class:`~concurrent.futures.ThreadPoolExecutor` has failed initializing.
es_es: Derivada de :exc:`~concurrent.futures.BrokenExecutor`, esta clase de excepción se lanza cuando uno de los trabajadores de :class:`~concurrent.futures.ThreadPoolExecutor` ha fallado al inicializarse.
pt_pt: Derivada de :exc:`~concurrent.futures.BrokenExecutor`, esta classe de exceção é levantada quando um dos trabalhadores de um :class:`~concurrent.futures.ThreadPoolExecutor` falha na inicialização.

source: Derived from :exc:`~concurrent.futures.thread.BrokenThreadPool`, this exception class is raised when one of the workers of a :class:`~concurrent.futures.InterpreterPoolExecutor` has failed initializing.
pt_pt: Derivada de :exc:`~concurrent.futures.thread.BrokenThreadPool`, esta classe de exceção é levantada quando um dos trabalhadores de um :class:`~concurrent.futures.InterpreterPoolExecutor` falha na inicialização.

source: Raised from :class:`~concurrent.futures.InterpreterPoolExecutor` when the given initializer fails or from :meth:`~concurrent.futures.Executor.submit` when there's an uncaught exception from the submitted task.
pt_pt: Levantada de :class:`~concurrent.futures.InterpreterPoolExecutor` quando o inicializador dado falha ou de :meth:`~concurrent.futures.Executor.submit` quando há uma exceção não capturada da tarefa submetida.

source: Derived from :exc:`~concurrent.futures.BrokenExecutor` (formerly :exc:`RuntimeError`), this exception class is raised when one of the workers of a :class:`~concurrent.futures.ProcessPoolExecutor` has terminated in a non-clean fashion (for example, if it was killed from the outside).
es_es: Derivada de :exc:`~concurrent.futures.BrokenExecutor` (antes :exc:`RuntimeError`), esta clase de excepción se lanza cuando uno de los trabajadores de un :class:`~concurrent.futures.ProcessPoolExecutor` ha terminado de forma no limpia (por ejemplo, si ha sido matado desde el exterior).
pt_pt: Derivada de :exc:`~concurrent.futures.BrokenExecutor` (anteriormente :exc:`RuntimeError`), esta classe de exceção é levantada quando um dos trabalhadores de um :class:`~concurrent.futures.ProcessPoolExecutor` terminou de forma não limpa (por exemplo, se foi morto externamente).

source: with ThreadPoolExecutor(max_workers=1) as executor: future = executor.submit(pow, 323, 1235) print(future.result())
es_es: con ThreadPoolExecutor(max_trabajadores=1) como executor: future = executor.submit(pow, 323, 1235) print(futuro.resultado())

source: ThreadPoolExecutor
es_es: Ejecutor de ThreadPool
