Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/concurrent.futures.po
Languages: es_es, pt_pt

source: The tradeoff is that writing concurrent code for use with multiple interpreters can take extra effort. However, this is because it forces you to be deliberate about how and when interpreters interact, and to be explicit about what data is shared between interpreters. This results in several benefits that help balance the extra effort, including true multi-core parallelism, For example, code written this way can make it easier to reason about concurrency. Another major benefit is that you don't have to deal with several of the big pain points of using threads, like race conditions.
pt_pt: A compensação é que escrever código concorrente para uso com vários interpretadores pode exigir um esforço extra. No entanto, isto acontece porque obriga a ser deliberado sobre como e quando os interpretadores interagem e a ser explícito sobre quais dados são partilhados entre interpretadores. Isto resulta em vários benefícios que ajudam a equilibrar o esforço extra, incluindo paralelismo multi-núcleo verdadeiro. Por exemplo, o código escrito desta forma pode facilitar o raciocínio sobre concorrência. Outro grande benefício é que não é necessário lidar com vários dos grandes pontos problemáticos do uso de threads, como condições de corrida.

source: Each worker's interpreter is isolated from all the other interpreters. "Isolated" means each interpreter has its own runtime state and operates completely independently. For example, if you redirect :data:`sys.stdout` in one interpreter, it will not be automatically redirected to any other interpreter. If you import a module in one interpreter, it is not automatically imported in any other. You would need to import the module separately in interpreter where you need it. In fact, each module imported in an interpreter is a completely separate object from the same module in a different interpreter, including :mod:`sys`, :mod:`builtins`, and even ``__main__``.
pt_pt: O interpretador de cada trabalhador está isolado de todos os outros interpretadores. "Isolado" significa que cada interpretador tem o seu próprio estado de execução e opera completamente de forma independente. Por exemplo, se redirecionar :data:`sys.stdout` num interpretador, não será automaticamente redirecionado para qualquer outro interpretador. Se importar um módulo num interpretador, não será automaticamente importado em nenhum outro. Terá de importar o módulo separadamente no interpretador onde o necessita. De facto, cada módulo importado num interpretador é um objeto completamente separado do mesmo módulo noutro interpretador, incluindo :mod:`sys`, :mod:`builtins` e até ``__main__``.

source: Isolation means a mutable object, or other data, cannot be used by more than one interpreter at the same time. That effectively means interpreters cannot actually share such objects or data. Instead, each interpreter must have its own copy, and you will have to synchronize any changes between the copies manually. Immutable objects and data, like the builtin singletons, strings, and tuples of immutable objects, don't have these limitations.
pt_pt: O isolamento significa que um objeto mutável, ou outros dados, não pode ser usado por mais do que um interpretador ao mesmo tempo. Isso significa efetivamente que os interpretadores não podem partilhar tais objetos ou dados. Em vez disso, cada interpretador deve ter a sua própria cópia, e terá de sincronizar manualmente quaisquer alterações entre as cópias. Objetos e dados imutáveis, como os singletons integrados, strings e tuplos de objetos imutáveis, não têm estas limitações.

source: Communicating and synchronizing between interpreters is most effectively done using dedicated tools, like those proposed in :pep:`734`. One less efficient alternative is to serialize with :mod:`pickle` and then send the bytes over a shared :mod:`socket <socket>` or :func:`pipe <os.pipe>`.
pt_pt: A comunicação e sincronização entre interpretadores é feita de forma mais eficaz usando ferramentas dedicadas, como as propostas em :pep:`734`. Uma alternativa menos eficiente é serializar com :mod:`pickle` e depois enviar os bytes através de um :mod:`socket <socket>` partilhado ou :func:`pipe <os.pipe>`.

source: A :class:`ThreadPoolExecutor` subclass that executes calls asynchronously using a pool of at most *max_workers* threads. Each thread runs tasks in its own interpreter. The worker interpreters are isolated from each other, which means each has its own runtime state and that they can't share any mutable objects or other data. Each interpreter has its own :term:`Global Interpreter Lock <global interpreter lock>`, which means code run with this executor has true multi-core parallelism.
pt_pt: Uma subclasse de :class:`ThreadPoolExecutor` que executa chamadas de forma assíncrona usando um pool de no máximo *max_workers* threads. Cada thread executa tarefas no seu próprio interpretador. Os interpretadores dos trabalhadores estão isolados uns dos outros, o que significa que cada um tem o seu próprio estado de execução e não podem partilhar quaisquer objetos mutáveis ou outros dados. Cada interpretador tem o seu próprio :term:`Global Interpreter Lock <global interpreter lock>`, o que significa que o código executado com este executor tem paralelismo multi-núcleo verdadeiro.

source: The optional *initializer* and *initargs* arguments have the same meaning as for :class:`!ThreadPoolExecutor`: the initializer is run when each worker is created, though in this case it is run in the worker's interpreter. The executor serializes the *initializer* and *initargs* using :mod:`pickle` when sending them to the worker's interpreter.
pt_pt: Os argumentos opcionais *initializer* e *initargs* têm o mesmo significado que para :class:`!ThreadPoolExecutor`: o inicializador é executado quando cada trabalhador é criado, embora neste caso seja executado no interpretador do trabalhador. O executor serializa o *initializer* e *initargs* usando :mod:`pickle` ao enviá-los para o interpretador do trabalhador.

source: The executor may replace uncaught exceptions from *initializer* with :class:`~concurrent.futures.interpreter.ExecutionFailed`.
pt_pt: O executor pode substituir exceções não capturadas de *initializer* por :class:`~concurrent.futures.interpreter.ExecutionFailed`.

source: Other caveats from parent :class:`ThreadPoolExecutor` apply here.
pt_pt: Outras advertências da classe pai :class:`ThreadPoolExecutor` aplicam-se aqui.

source: :meth:`~Executor.submit` and :meth:`~Executor.map` work like normal, except the worker serializes the callable and arguments using :mod:`pickle` when sending them to its interpreter. The worker likewise serializes the return value when sending it back.
pt_pt: :meth:`~Executor.submit` e :meth:`~Executor.map` funcionam normalmente, exceto que o trabalhador serializa o objeto chamável e os argumentos usando :mod:`pickle` ao enviá-los para o seu interpretador. O trabalhador também serializa o valor de retorno ao enviá-lo de volta.

source: When a worker's current task raises an uncaught exception, the worker always tries to preserve the exception as-is. If that is successful then it also sets the ``__cause__`` to a corresponding :class:`~concurrent.futures.interpreter.ExecutionFailed` instance, which contains a summary of the original exception. In the uncommon case that the worker is not able to preserve the original as-is then it directly preserves the corresponding :class:`~concurrent.futures.interpreter.ExecutionFailed` instance instead.
pt_pt: Quando a tarefa atual de um trabalhador levanta uma exceção não capturada, o trabalhador tenta sempre preservar a exceção como está. Se isso for bem-sucedido, também define o ``__cause__`` para uma instância correspondente de :class:`~concurrent.futures.interpreter.ExecutionFailed`, que contém um resumo da exceção original. No caso incomum em que o trabalhador não consegue preservar a original como está, preserva diretamente a instância correspondente de :class:`~concurrent.futures.interpreter.ExecutionFailed`.

source: The :class:`ProcessPoolExecutor` class is an :class:`Executor` subclass that uses a pool of processes to execute calls asynchronously. :class:`ProcessPoolExecutor` uses the :mod:`multiprocessing` module, which allows it to side-step the :term:`Global Interpreter Lock <global interpreter lock>` but also means that only picklable objects can be executed and returned.
es_es: La clase :class:`ProcessPoolExecutor` es una subclase de :class:`Executor` que utiliza un conjunto de procesos para ejecutar llamadas de forma asíncrona. :class:`ProcessPoolExecutor` utiliza el módulo :mod:`multiprocessing`, lo que le permite evitar el:term:`Global Interpreter Lock <global interpreter lock>` pero también significa que sólo se pueden ejecutar y devolver objetos seleccionables.
pt_pt: A classe :class:`ProcessPoolExecutor` é uma subclasse de :class:`Executor` que usa um pool de processos para executar chamadas de forma assíncrona. :class:`ProcessPoolExecutor` usa o módulo :mod:`multiprocessing`, que permite contornar o :term:`Global Interpreter Lock <global interpreter lock>`, mas também significa que apenas objetos serializáveis podem ser executados e devolvidos.

source: The ``__main__`` module must be importable by worker subprocesses. This means that :class:`ProcessPoolExecutor` will not work in the interactive interpreter.
es_es: El módulo ``__main__`` debe ser importable por los subprocesos de los trabajadores. Esto significa que :class:`ProcessPoolExecutor` no funcionará en el intérprete interactivo.
pt_pt: O módulo ``__main__`` deve ser importável pelos subprocessos dos trabalhadores. Isto significa que :class:`ProcessPoolExecutor` não funcionará no interpretador interativo.

source: Calling :class:`Executor` or :class:`Future` methods from a callable submitted to a :class:`ProcessPoolExecutor` will result in deadlock.
es_es: La llamada a los métodos :class:`Executor` o :class:`Future` desde una llamada enviada a :class:`ProcessPoolExecutor` provocará un bloqueo.
pt_pt: Chamar métodos :class:`Executor` ou :class:`Future` a partir de um objeto chamável submetido a um :class:`ProcessPoolExecutor` resultará em deadlock.

source: Note that the restrictions on functions and arguments needing to picklable as per :class:`multiprocessing.Process` apply when using :meth:`~Executor.submit` and :meth:`~Executor.map` on a :class:`ProcessPoolExecutor`. A function defined in a REPL or a lambda should not be expected to work.
pt_pt: Note que as restrições sobre funções e argumentos que precisam de ser serializáveis, conforme :class:`multiprocessing.Process`, aplicam-se ao usar :meth:`~Executor.submit` e :meth:`~Executor.map` num :class:`ProcessPoolExecutor`. Uma função definida num REPL ou uma lambda não deve ser esperada para funcionar.

source: An :class:`Executor` subclass that executes calls asynchronously using a pool of at most *max_workers* processes. If *max_workers* is ``None`` or not given, it will default to :func:`os.process_cpu_count`. If *max_workers* is less than or equal to ``0``, then a :exc:`ValueError` will be raised. On Windows, *max_workers* must be less than or equal to ``61``. If it is not then :exc:`ValueError` will be raised. If *max_workers* is ``None``, then the default chosen will be at most ``61``, even if more processors are available. *mp_context* can be a :mod:`multiprocessing` context or ``None``. It will be used to launch the workers. If *mp_context* is ``None`` or not given, the default :mod:`multiprocessing` context is used. See :ref:`multiprocessing-start-methods`.
pt_pt: Uma subclasse de :class:`Executor` que executa chamadas de forma assíncrona usando um pool de no máximo *max_workers* processos. Se *max_workers* for ``None`` ou não for especificado, o valor predefinido será :func:`os.process_cpu_count`. Se *max_workers* for menor ou igual a ``0``, será levantada uma exceção :exc:`ValueError`. No Windows, *max_workers* deve ser menor ou igual a ``61``. Se não for, será levantada uma exceção :exc:`ValueError`. Se *max_workers* for ``None``, o valor predefinido escolhido será no máximo ``61``, mesmo que mais processadores estejam disponíveis. *mp_context* pode ser um contexto :mod:`multiprocessing` ou ``None``. Será usado para lançar os trabalhadores. Se *mp_context* for ``None`` ou não for especificado, o contexto predefinido :mod:`multiprocessing` é usado. Veja :ref:`multiprocessing-start-methods`.

source: *initializer* is an optional callable that is called at the start of each worker process; *initargs* is a tuple of arguments passed to the initializer. Should *initializer* raise an exception, all currently pending jobs will raise a :exc:`~concurrent.futures.process.BrokenProcessPool`, as well as any attempt to submit more jobs to the pool.
es_es: *initializer* es una llamada opcional que se realiza al inicio de cada proceso de trabajo; *initargs* es una tupla de argumentos pasados al inicializador. Si *initializer* lanza una excepción, todos los trabajos actualmente pendientes lanzarán un :exc:`~concurrent.futures.process.BrokenProcessPool`, así como cualquier intento de enviar más trabajos al pool.
pt_pt: *initializer* é um objeto chamável opcional que é chamado no início de cada processo de trabalho; *initargs* é um tuplo de argumentos passados ao inicializador. Se *initializer* levantar uma exceção, todas as tarefas atualmente pendentes levantarão uma :exc:`~concurrent.futures.process.BrokenProcessPool`, assim como qualquer tentativa de submeter mais tarefas ao pool.

source: *max_tasks_per_child* is an optional argument that specifies the maximum number of tasks a single process can execute before it will exit and be replaced with a fresh worker process. By default *max_tasks_per_child* is ``None`` which means worker processes will live as long as the pool. When a max is specified, the "spawn" multiprocessing start method will be used by default in absence of a *mp_context* parameter. This feature is incompatible with the "fork" start method.
es_es: *max_tasks_per_child* es un argumento opcional que especifica el número máximo de tareas que un único proceso puede ejecutar antes de salir y ser reemplazado por un nuevo proceso trabajador. Por defecto, *max_tasks_per_child* es ``None``, lo que significa que los procesos trabajadores vivirán tanto como el pool. Cuando se especifica un max, el método de inicio de multiprocesamiento "spawn" se utilizará por defecto en ausencia de un parámetro *mp_context*. Esta característica es incompatible con el método de inicio "fork".
pt_pt: *max_tasks_per_child* é um argumento opcional que especifica o número máximo de tarefas que um único processo pode executar antes de sair e ser substituído por um novo processo de trabalho. Por predefinição, *max_tasks_per_child* é ``None``, o que significa que os processos de trabalho viverão enquanto o pool existir. Quando um máximo é especificado, o método de início "spawn" de multiprocessamento será usado por predefinição na ausência de um parâmetro *mp_context*. Esta funcionalidade é incompatível com o método de início "fork".

source: When one of the worker processes terminates abruptly, a :exc:`~concurrent.futures.process.BrokenProcessPool` error is now raised. Previously, behaviour was undefined but operations on the executor or its futures would often freeze or deadlock.
es_es: Cuando uno de los procesos de trabajo termina abruptamente, ahora se genera un error :exc:`~concurrent.futures.process.BrokenProcessPool`. Anteriormente, el comportamiento era indefinido, pero las operaciones sobre el ejecutor o sus futuros a menudo se congelaban o bloqueaban.
pt_pt: Quando um dos processos de trabalho termina abruptamente, um erro :exc:`~concurrent.futures.process.BrokenProcessPool` é agora levantado. Anteriormente, o comportamento era indefinido, mas as operações no executor ou nos seus futuros frequentemente congelavam ou entravam em deadlock.

source: The *mp_context* argument was added to allow users to control the start_method for worker processes created by the pool.
es_es: Se ha añadido el argumento *mp_context* para permitir a los usuarios controlar el método de inicio de los procesos de trabajo creados por el pool.
pt_pt: O argumento *mp_context* foi adicionado para permitir que os utilizadores controlem o *start_method* para os processos de trabalho criados pelo pool.

source: The *max_tasks_per_child* argument was added to allow users to control the lifetime of workers in the pool.
es_es: Se ha añadido el argumento *max_tasks_per_child* para permitir a los usuarios controlar el tiempo de vida de los trabajadores en el pool.
pt_pt: O argumento *max_tasks_per_child* foi adicionado para permitir que os utilizadores controlem o tempo de vida dos trabalhadores no pool.

source: On POSIX systems, if your application has multiple threads and the :mod:`multiprocessing` context uses the ``"fork"`` start method: The :func:`os.fork` function called internally to spawn workers may raise a :exc:`DeprecationWarning`. Pass a *mp_context* configured to use a different start method. See the :func:`os.fork` documentation for further explanation.
es_es: En sistemas POSIX, si su aplicación tiene múltiples hilos y el contexto :mod:`multiprocessing` utiliza el método de inicio ``"fork"``: La función :func:`os.fork` llamada internamente para desovar trabajadores puede lanzar un :exc:`DeprecationWarning`. Pase un *mp_context* configurado para usar un método de inicio diferente. Consulte la documentación de :func:`os.fork` para más información.
pt_pt: Em sistemas POSIX, se a sua aplicação tiver várias threads e o contexto :mod:`multiprocessing` usar o método de início ``"fork"``: A função :func:`os.fork` chamada internamente para criar trabalhadores pode levantar um :exc:`DeprecationWarning`. Passe um *mp_context* configurado para usar um método de início diferente. Consulte a documentação de :func:`os.fork` para mais explicações.

source: *max_workers* uses :func:`os.process_cpu_count` by default, instead of :func:`os.cpu_count`.
pt_pt: *max_workers* usa :func:`os.process_cpu_count` por predefinição, em vez de :func:`os.cpu_count`.

source: The default process start method (see :ref:`multiprocessing-start-methods`) changed away from *fork*. If you require the *fork* start method for :class:`ProcessPoolExecutor` you must explicitly pass ``mp_context=multiprocessing.get_context("fork")``.
pt_pt: O método de início de processo predefinido (veja :ref:`multiprocessing-start-methods`) mudou de *fork*. Se necessitar do método de início *fork* para :class:`ProcessPoolExecutor`, deve passar explicitamente ``mp_context=multiprocessing.get_context("fork")``.

source: Attempt to terminate all living worker processes immediately by calling :meth:`Process.terminate <multiprocessing.Process.terminate>` on each of them. Internally, it will also call :meth:`Executor.shutdown` to ensure that all other resources associated with the executor are freed.
pt_pt: Tenta terminar imediatamente todos os processos de trabalho ativos chamando :meth:`Process.terminate <multiprocessing.Process.terminate>` em cada um deles. Internamente, também chamará :meth:`Executor.shutdown` para garantir que todos os outros recursos associados ao executor sejam libertados.

source: After calling this method the caller should no longer submit tasks to the executor.
pt_pt: Após chamar este método, o chamador não deve submeter mais tarefas ao executor.

source: Attempt to kill all living worker processes immediately by calling :meth:`Process.kill <multiprocessing.Process.kill>` on each of them. Internally, it will also call :meth:`Executor.shutdown` to ensure that all other resources associated with the executor are freed.
pt_pt: Tenta matar imediatamente todos os processos de trabalho ativos chamando :meth:`Process.kill <multiprocessing.Process.kill>` em cada um deles. Internamente, também chamará :meth:`Executor.shutdown` para garantir que todos os outros recursos associados ao executor sejam libertados.

source: ProcessPoolExecutor Example
es_es: Ejemplo de ProcessPoolExecutor
pt_pt: Exemplo de ProcessPoolExecutor

source: import concurrent.futures import math PRIMES = [ 112272535095293, 112582705942171, 112272535095293, 115280095190773, 115797848077099, 1099726899285419] def is_prime(n): if n < 2: return False if n == 2: return True if n % 2 == 0: return False sqrt_n = int(math.floor(math.sqrt(n))) for i in range(3, sqrt_n + 1, 2): if n % i == 0: return False return True def main(): with concurrent.futures.ProcessPoolExecutor() as executor: for number, prime in zip(PRIMES, executor.map(is_prime, PRIMES)): print('%d is prime: %s' % (number, prime)) if __name__ == '__main__': main()
pt_pt: import concurrent.futures import math PRIMES = [ 112272535095293, 112582705942171, 112272535095293, 115280095190773, 115797848077099, 1099726899285419] def is_prime(n): if n < 2: return False if n == 2: return True if n % 2 == 0: return False sqrt_n = int(math.floor(math.sqrt(n))) for i in range(3, sqrt_n + 1, 2): if n % i == 0: return False return True def main(): with concurrent.futures.ProcessPoolExecutor() as executor: for number, prime in zip(PRIMES, executor.map(is_prime, PRIMES)): print('%d é primo: %s' % (number, prime)) if __name__ == '__main__': main()

source: Future Objects
es_es: Objetos del futuro
pt_pt: Objetos Future

source: The :class:`Future` class encapsulates the asynchronous execution of a callable. :class:`Future` instances are created by :meth:`Executor.submit`.
es_es: La clase :class:`Future` encapsula la ejecución asíncrona de un callable. Las instancias de :class:`Future` son creadas por :meth:`Executor.submit`.
pt_pt: A classe :class:`Future` encapsula a execução assíncrona de um objeto chamável. Instâncias de :class:`Future` são criadas por :meth:`Executor.submit`.

source: Encapsulates the asynchronous execution of a callable. :class:`Future` instances are created by :meth:`Executor.submit` and should not be created directly except for testing.
es_es: Encapsula la ejecución asíncrona de un callable. :class:`Future` instancias son creadas por :meth:`Executor.submit` y no deben ser creadas directamente excepto para pruebas.
pt_pt: Encapsula a execução assíncrona de um objeto chamável. Instâncias de :class:`Future` são criadas por :meth:`Executor.submit` e não devem ser criadas diretamente, exceto para testes.

source: Attempt to cancel the call. If the call is currently being executed or finished running and cannot be cancelled then the method will return ``False``, otherwise the call will be cancelled and the method will return ``True``.
es_es: Intento de cancelar la llamada. Si la llamada se está ejecutando actualmente o ha terminado de ejecutarse y no puede cancelarse, el método devolverá ``False``, de lo contrario, la llamada se cancelará y el método devolverá ``True``.
pt_pt: Tenta cancelar a chamada. Se a chamada estiver atualmente a ser executada ou já tiver terminado e não puder ser cancelada, o método retornará ``False``; caso contrário, a chamada será cancelada e o método retornará ``True``.

source: Return ``True`` if the call was successfully cancelled.
es_es: Devuelve ``True`` si la llamada se ha cancelado correctamente.
pt_pt: Devolve ``True`` se a chamada foi cancelada com sucesso.

source: Return ``True`` if the call is currently being executed and cannot be cancelled.
es_es: Devuelve ``True`` si la llamada se está ejecutando en ese momento y no se puede cancelar.
pt_pt: Devolve ``True`` se a chamada estiver atualmente a ser executada e não puder ser cancelada.

source: Return ``True`` if the call was successfully cancelled or finished running.
es_es: Devuelve ``True`` si la llamada se canceló con éxito o terminó de ejecutarse.
pt_pt: Devolve ``True`` se a chamada foi cancelada com sucesso ou terminou a execução.
