Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/configparser.po
Languages: es_es, pt_pt, ru

source: There are nearly as many INI format variants as there are applications using it. :mod:`configparser` goes a long way to provide support for the largest sensible set of INI styles available. The default functionality is mainly dictated by historical background and it's very likely that you will want to customize some of the features.
es_es: Existen casi tantas variantes de formato INI como aplicaciones que lo utilizan. :mod:`configparser` hace todo lo posible por ofrecer compatibilidad con el mayor conjunto razonable de estilos INI disponible. La funcionalidad por defecto está dictada principalmente por antecedentes históricos y es muy probable que quieras personalizar algunas de las características.
pt_pt: Existem quase tantos variantes do formato INI quanto aplicações que o usam. :mod:`configparser` faz um grande esforço para fornecer suporte para o maior conjunto sensato de estilos INI disponíveis. A funcionalidade predefinida é principalmente ditada pelo histórico e é muito provável que queira personalizar algumas das funcionalidades.
ru: Вариантов формата INI почти столько же, сколько приложений, его использующих. :mod:`configparser` имеет большое значение для обеспечения поддержки самого большого разумного набора доступных стилей INI. Функциональность по умолчанию в основном продиктована историческим прошлым, и весьма вероятно, что вы захотите настроить некоторые функции.

source: The most common way to change the way a specific config parser works is to use the :meth:`!__init__` options:
es_es: La forma más habitual de cambiar el funcionamiento de un analizador de configuración específico es utilizar las opciones de :meth:`!__init__`:
pt_pt: A forma mais comum de alterar a forma como um analisador de configuração específico funciona é usar as opções :meth:`!__init__`:
ru: Самый распространенный способ изменить способ работы конкретного анализатора конфигурации — использовать параметры :meth:`!__init__`:

source: *defaults*, default value: ``None``
es_es: *defaults*, valor por defecto: ``None``
pt_pt: *defaults*, valor predefinido: ``None``
ru: *defaults*, значение по умолчанию: ``None``

source: This option accepts a dictionary of key-value pairs which will be initially put in the ``DEFAULT`` section. This makes for an elegant way to support concise configuration files that don't specify values which are the same as the documented default.
es_es: Esta opción acepta un diccionario de pares clave-valor que se colocarán inicialmente en la sección ``DEFAULT``. Es una forma elegante de admitir archivos de configuración concisos que no especifiquen valores iguales a los predeterminados documentados.
pt_pt: Esta opção aceita um dicionário de pares chave-valor que serão inicialmente colocados na secção ``DEFAULT``. Isto torna-se uma forma elegante de suportar ficheiros de configuração concisos que não especificam valores que são iguais ao predefinido documentado.
ru: Эта опция принимает словарь пар ключ-значение, который изначально будет помещен в раздел DEFAULT. Это обеспечивает элегантный способ поддержки кратких файлов конфигурации, в которых не указаны значения, совпадающие с документированными значениями по умолчанию.

source: Hint: if you want to specify default values for a specific section, use :meth:`~ConfigParser.read_dict` before you read the actual file.
es_es: Sugerencia: si desea especificar valores por defecto para una sección concreta, utilice :meth:`~ConfigParser.read_dict` antes de leer el archivo real.
pt_pt: Dica: se quiser especificar valores predefinidos para uma secção específica, use :meth:`~ConfigParser.read_dict` antes de ler o ficheiro real.
ru: Подсказка: если вы хотите указать значения по умолчанию для определенного раздела, используйте :meth:`~ConfigParser.read_dict` перед чтением фактического файла.

source: *dict_type*, default value: :class:`dict`
es_es: *dict_type*, valor por defecto: :class:`dict`
pt_pt: *dict_type*, valor predefinido: :class:`dict`
ru: *dict_type*, значение по умолчанию: :class:`dict`

source: This option has a major impact on how the mapping protocol will behave and how the written configuration files look. With the standard dictionary, every section is stored in the order they were added to the parser. Same goes for options within sections.
es_es: Esta opción tiene un gran impacto en el comportamiento del protocolo de mapeo y en el aspecto de los archivos de configuración escritos. Con el diccionario estándar, cada sección se almacena en el orden en que se añadieron al analizador sintáctico. Lo mismo ocurre con las opciones dentro de las secciones.
pt_pt: Esta opção tem um grande impacto em como o protocolo de mapeamento se comportará e como os ficheiros de configuração escritos parecerão. Com o dicionário padrão, cada secção é armazenada na ordem em que foram adicionadas ao analisador. O mesmo acontece com as opções dentro das secções.
ru: Этот параметр оказывает существенное влияние на поведение протокола сопоставления и на то, как будут выглядеть записанные файлы конфигурации. В стандартном словаре каждый раздел сохраняется в том порядке, в котором они были добавлены в анализатор. То же самое касается опций внутри разделов.

source: An alternative dictionary type can be used for example to sort sections and options on write-back.
es_es: Se puede utilizar un tipo de diccionario alternativo, por ejemplo, para clasificar secciones y opciones en la reescritura.
pt_pt: Um tipo de dicionário alternativo pode ser usado, por exemplo, para ordenar secções e opções na escrita de volta.
ru: Альтернативный тип словаря можно использовать, например, для сортировки разделов и опций при обратной записи.

source: Please note: there are ways to add a set of key-value pairs in a single operation. When you use a regular dictionary in those operations, the order of the keys will be ordered. For example:
es_es: Atención: hay formas de añadir un conjunto de pares clave-valor en una sola operación. Cuando utilice un diccionario normal en esas operaciones, el orden de las claves será ordenado. Por ejemplo:
pt_pt: Note que: existem formas de adicionar um conjunto de pares chave-valor numa única operação. Quando usa um dicionário regular nessas operações, a ordem das chaves será ordenada. Por exemplo:
ru: Обратите внимание: существуют способы добавить набор пар ключ-значение за одну операцию. Когда вы используете в этих операциях обычный словарь, порядок ключей будет упорядочен. Например:

source: *allow_no_value*, default value: ``False``
es_es: *allow_no_value*, valor por defecto: ``False``
pt_pt: *allow_no_value*, valor predefinido: ``False``
ru: *allow_no_value*, значение по умолчанию: ``False``

source: Some configuration files are known to include settings without values, but which otherwise conform to the syntax supported by :mod:`configparser`. The *allow_no_value* parameter to the constructor can be used to indicate that such values should be accepted:
es_es: Se sabe que algunos archivos de configuración incluyen opciones sin valores, pero que por lo demás se ajustan a la sintaxis admitida por :mod:`configparser`. El parámetro *allow_no_value* del constructor puede utilizarse para indicar que se deben aceptar dichos valores:
pt_pt: Alguns ficheiros de configuração incluem definições sem valores, mas que, de outra forma, estão em conformidade com a sintaxe suportada por :mod:`configparser`. O parâmetro *allow_no_value* para o construtor pode ser usado para indicar que tais valores devem ser aceites:
ru: Известно, что некоторые файлы конфигурации содержат настройки без значений, но в остальном они соответствуют синтаксису, поддерживаемому :mod:`configparser`. Параметр *allow_no_value* конструктора можно использовать для указания того, что такие значения должны быть приняты:

source: >>> import configparser >>> sample_config = """ ... [mysqld] ... user = mysql ... pid-file = /var/run/mysqld/mysqld.pid ... skip-external-locking ... old_passwords = 1 ... skip-bdb ... # we don't need ACID today ... skip-innodb ... """ >>> config = configparser.ConfigParser(allow_no_value=True) >>> config.read_string(sample_config) >>> # Settings with values are treated as before: >>> config["mysqld"]["user"] 'mysql' >>> # Settings without values provide None: >>> config["mysqld"]["skip-bdb"] >>> # Settings which aren't specified still raise an error: >>> config["mysqld"]["does-not-exist"] Traceback (most recent call last): ... KeyError: 'does-not-exist'
es_es: >>> import configparser >>> sample_config = """ ... [mysqld] ... user = mysql ... pid-file = /var/run/mysqld/mysqld.pid ... skip-external-locking ... old_passwords = 1 ... skip-bdb ... # no necesitamos ACID hoy ... skip-innodb ... """ >>> config = configparser.ConfigParser(allow_no_value=True) >>> config.read_string(sample_config) >>> # Las configuraciones con valores se tratan como antes: >>> config["mysqld"]["user"] 'mysql' >>> # Las configuraciones sin valores proporcionan None: >>> config["mysqld"]["skip-bdb"] >>> # Las opciones que no se especifican producen un error: >>> config["mysqld"]["does-not-exist"] Traceback (most recent call last): ... KeyError: 'does-not-exist'
pt_pt: >>> import configparser >>> sample_config = """ ... [mysqld] ... user = mysql ... pid-file = /var/run/mysqld/mysqld.pid ... skip-external-locking ... old_passwords = 1 ... skip-bdb ... # não precisamos de ACID hoje ... skip-innodb ... """ >>> config = configparser.ConfigParser(allow_no_value=True) >>> config.read_string(sample_config) >>> # Definições com valores são tratadas como antes: >>> config["mysqld"]["user"] 'mysql' >>> # Definições sem valores fornecem None: >>> config["mysqld"]["skip-bdb"] >>> # Definições que não estão especificadas ainda levantam um erro: >>> config["mysqld"]["does-not-exist"] Traceback (most recent call last): ... KeyError: 'does-not-exist'

source: *delimiters*, default value: ``('=', ':')``
es_es: *delimiters*, valor por defecto: ``('=', ':')``
pt_pt: *delimiters*, valor predefinido: ``('=', ':')``
ru: *разделители*, значение по умолчанию: ``('=', ':')``

source: Delimiters are substrings that delimit keys from values within a section. The first occurrence of a delimiting substring on a line is considered a delimiter. This means values (but not keys) can contain the delimiters.
es_es: Los delimitadores son subcadenas que delimitan las claves de los valores dentro de una sección. La primera aparición de una subcadena delimitadora en una línea se considera un delimitador. Esto significa que los valores (pero no las claves) pueden contener delimitadores.
pt_pt: Os delimitadores são substrings que delimitam chaves de valores dentro de uma secção. A primeira ocorrência de uma substring delimitadora numa linha é considerada um delimitador. Isto significa que os valores (mas não as chaves) podem conter os delimitadores.
ru: Разделители — это подстроки, которые отделяют ключи от значений внутри раздела. Первое появление разделительной подстроки в строке считается разделителем. Это означает, что значения (но не ключи) могут содержать разделители.

source: See also the *space_around_delimiters* argument to :meth:`ConfigParser.write`.
es_es: Véase también el argumento *space_around_delimiters* de :meth:`ConfigParser.write`.
pt_pt: Veja também o argumento *space_around_delimiters* para :meth:`ConfigParser.write`.
ru: См. также аргумент *space_around_delimiters* для :meth:`ConfigParser.write`.

source: *comment_prefixes*, default value: ``('#', ';')``
es_es: *comment_prefixes*, valor por defecto: ``('#', ';')``
pt_pt: *comment_prefixes*, valor predefinido: ``('#', ';')``
ru: *comment_prefixes*, значение по умолчанию: ``('#', ';')``

source: *inline_comment_prefixes*, default value: ``None``
es_es: *inline_comment_prefixes*, valor por defecto: ``None``
pt_pt: *inline_comment_prefixes*, valor predefinido: ``None``
ru: *inline_comment_prefixes*, значение по умолчанию: ``None``

source: Comment prefixes are strings that indicate the start of a valid comment within a config file. *comment_prefixes* are used only on otherwise empty lines (optionally indented) whereas *inline_comment_prefixes* can be used after every valid value (e.g. section names, options and empty lines as well). By default inline comments are disabled and ``'#'`` and ``';'`` are used as prefixes for whole line comments.
es_es: Los prefijos de comentario son cadenas que indican el inicio de un comentario válido dentro de un archivo de configuración. Los prefijos *comment_prefixes* se utilizan sólo en líneas vacías (opcionalmente con sangría), mientras que los prefijos *inline_comment_prefixes* pueden utilizarse después de cualquier valor válido (por ejemplo, nombres de sección, opciones y también líneas vacías). Por defecto, los comentarios en línea están desactivados y se utilizan ``'#'`` y ``';'`` como prefijos para los comentarios de línea completa.
pt_pt: Os prefixos de comentário são strings que indicam o início de um comentário válido dentro de um ficheiro de configuração. *comment_prefixes* são usados apenas em linhas vazias (opcionalmente indentadas), enquanto *inline_comment_prefixes* podem ser usados após cada valor válido (por exemplo, nomes de secções, opções e linhas vazias também). Por predefinição, os comentários em linha estão desativados e ``'#'`` e ``';'`` são usados como prefixos para comentários de linha inteira.
ru: Префиксы комментариев — это строки, обозначающие начало допустимого комментария в файле конфигурации. *comment_prefixes* используются только в пустых строках (необязательно с отступом), тогда как *inline_comment_prefixes* можно использовать после каждого допустимого значения (например, названий разделов, опций и пустых строк). По умолчанию встроенные комментарии отключены, а ``'#'`` и ``';'`` используются в качестве префиксов для комментариев всей строки.

source: In previous versions of :mod:`configparser` behaviour matched ``comment_prefixes=('#',';')`` and ``inline_comment_prefixes=(';',)``.
es_es: En versiones anteriores de :mod:`configparser` el comportamiento coincidía con ``comment_prefixes=('#',';')`` y ``inline_comment_prefixes=(';',)``.
pt_pt: Em versões anteriores de :mod:`configparser`, o comportamento correspondia a ``comment_prefixes=('#',';')`` e ``inline_comment_prefixes=(';',)``.
ru: В предыдущих версиях :mod:`configparser` поведение соответствовало ``comment_prefixes=('#',';')`` и ``inline_comment_prefixes=(';',)``.

source: Please note that config parsers don't support escaping of comment prefixes so using *inline_comment_prefixes* may prevent users from specifying option values with characters used as comment prefixes. When in doubt, avoid setting *inline_comment_prefixes*. In any circumstances, the only way of storing comment prefix characters at the beginning of a line in multiline values is to interpolate the prefix, for example::
es_es: Tenga en cuenta que los analizadores de configuración no admiten el escape de prefijos de comentarios, por lo que el uso de *inline_comment_prefixes* puede impedir que los usuarios especifiquen valores de opción con caracteres utilizados como prefijos de comentarios. En caso de duda, evite configurar *inline_comment_prefixes*. En cualquier circunstancia, la única forma de almacenar caracteres de prefijo de comentario al principio de una línea en valores multilínea es interpolar el prefijo, por ejemplo::
pt_pt: Note que os analisadores de configuração não suportam o escape de prefixos de comentário, por isso usar *inline_comment_prefixes* pode impedir os utilizadores de especificar valores de opção com caracteres usados como prefixos de comentário. Em caso de dúvida, evite definir *inline_comment_prefixes*. Em qualquer circunstância, a única forma de armazenar caracteres de prefixo de comentário no início de uma linha em valores multilinhas é interpolá-los, por exemplo::
ru: Обратите внимание, что анализаторы конфигурации не поддерживают экранирование префиксов комментариев, поэтому использование *inline_comment_prefixes* может помешать пользователям указывать значения параметров с помощью символов, используемых в качестве префиксов комментариев. В случае сомнений не устанавливайте *inline_comment_prefixes*. В любых обстоятельствах единственный способ сохранить символы префикса комментария в начале строки в многострочных значениях — это интерполировать префикс, например::

source: >>> from configparser import ConfigParser, ExtendedInterpolation >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> # the default BasicInterpolation could be used as well >>> parser.read_string(""" ... [DEFAULT] ... hash = # ... ... [hashes] ... shebang = ... ${hash}!/usr/bin/env python ... ${hash} -*- coding: utf-8 -*- ... ... extensions = ... enabled_extension ... another_extension ... #disabled_by_comment ... yet_another_extension ... ... interpolation not necessary = if # is not at line start ... even in multiline values = line #1 ... line #2 ... line #3 ... """) >>> print(parser['hashes']['shebang']) #!/usr/bin/env python # -*- coding: utf-8 -*- >>> print(parser['hashes']['extensions']) enabled_extension another_extension yet_another_extension >>> print(parser['hashes']['interpolation not necessary']) if # is not at line start >>> print(parser['hashes']['even in multiline values']) line #1 line #2 line #3
es_es: >>> from configparser import ConfigParser, ExtendedInterpolation >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> # la interpolación básica predeterminada también podría usarse >>> parser.read_string(""" ... [DEFAULT] ... hash = # ... ... [hashes] ... shebang = ... ${hash}!/usr/bin/env python ... ${hash} -*- coding: utf-8 -*- ... ... extensions = ... enabled_extension ... another_extension ... #disabled_by_comment ... yet_another_extension ... ... interpolation not necessary = if # is not at line start ... even in multiline values = line #1 ... line #2 ... line #3 ... """) >>> print(parser['hashes']['shebang']) #!/usr/bin/env python # -*- coding: utf-8 -*- >>> print(parser['hashes']['extensions']) enabled_extension another_extension yet_another_extension >>> print(parser['hashes']['interpolation not necessary']) if # no está en el inicio de la línea >>> print(parser['hashes']['even in multiline values']) line #1 line #2 line #3

source: *strict*, default value: ``True``
es_es: *estricto*, valor por defecto: ``True``
pt_pt: *strict*, valor predefinido: ``True``
ru: *strict*, значение по умолчанию: ``True``

source: When set to ``True``, the parser will not allow for any section or option duplicates while reading from a single source (using :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` or :meth:`~ConfigParser.read_dict`). It is recommended to use strict parsers in new applications.
es_es: Cuando se establece en ``True``, el analizador sintáctico no permitirá ninguna sección u opción duplicada mientras se lee de una única fuente (utilizando :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` o :meth:`~ConfigParser.read_dict`). Se recomienda utilizar analizadores sintácticos estrictos en las nuevas aplicaciones.
pt_pt: Quando definido como ``True``, o analisador não permitirá quaisquer duplicados de secções ou opções ao ler de uma única fonte (usando :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` ou :meth:`~ConfigParser.read_dict`). É recomendado usar analisadores estritos em novas aplicações.
ru: Если установлено значение «True», анализатор не допустит дублирования разделов или параметров при чтении из одного источника (с использованием :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` или :meth :`~ConfigParser.read_dict`). В новых приложениях рекомендуется использовать строгие парсеры.

source: In previous versions of :mod:`configparser` behaviour matched ``strict=False``.
es_es: En versiones anteriores de :mod:`configparser` el comportamiento coincidía con ``strict=False``.
pt_pt: Em versões anteriores de :mod:`configparser`, o comportamento correspondia a ``strict=False``.
ru: В предыдущих версиях поведение :mod:`configparser` соответствовало ``strict=False``.

source: *empty_lines_in_values*, default value: ``True``
es_es: *empty_lines_in_values*, valor por defecto: ``True``
pt_pt: *empty_lines_in_values*, valor predefinido: ``True``
ru: *empty_lines_in_values*, значение по умолчанию: ``True``

source: In config parsers, values can span multiple lines as long as they are indented more than the key that holds them. By default parsers also let empty lines to be parts of values. At the same time, keys can be arbitrarily indented themselves to improve readability. In consequence, when configuration files get big and complex, it is easy for the user to lose track of the file structure. Take for instance:
es_es: En los analizadores sintácticos de configuración, los valores pueden abarcar varias líneas siempre que tengan una sangría superior a la de la tecla que los contiene. Por defecto, los analizadores también permiten que las líneas vacías formen parte de los valores. Al mismo tiempo, las claves pueden tener una sangría arbitraria para mejorar la legibilidad. En consecuencia, cuando los archivos de configuración se hacen grandes y complejos, es fácil para el usuario perder la pista de la estructura del archivo. Por ejemplo:
pt_pt: Nos analisadores de configuração, os valores podem abranger várias linhas, desde que estejam indentados mais do que a chave que os contém. Por predefinição, os analisadores também permitem que linhas vazias façam parte dos valores. Ao mesmo tempo, as chaves podem ser indentadas arbitrariamente para melhorar a legibilidade. Em consequência, quando os ficheiros de configuração se tornam grandes e complexos, é fácil para o utilizador perder a noção da estrutura do ficheiro. Tome como exemplo:
ru: В анализаторах конфигурации значения могут занимать несколько строк, если их отступ больше, чем у ключа, который их содержит. По умолчанию анализаторы также позволяют пустым строкам быть частью значений. В то же время клавиши могут иметь произвольный отступ для улучшения читаемости. Как следствие, когда файлы конфигурации становятся большими и сложными, пользователь может легко потерять структуру файла. Возьмем, к примеру:

source: This can be especially problematic for the user to see if she's using a proportional font to edit the file. That is why when your application does not need values with empty lines, you should consider disallowing them. This will make empty lines split keys every time. In the example above, it would produce two keys, ``key`` and ``this``.
es_es: Esto puede ser especialmente problemático para el usuario si está utilizando una fuente proporcional para editar el archivo. Por eso, cuando su aplicación no necesite valores con líneas vacías, debería considerar desautorizarlos. Esto hará que las líneas vacías dividan las teclas cada vez. En el ejemplo anterior, produciría dos claves, ``key`` y ``this``.
pt_pt: Isto pode ser especialmente problemático para o utilizador ver se estiver a usar uma fonte proporcional para editar o ficheiro. É por isso que, quando a sua aplicação não precisa de valores com linhas vazias, deve considerar não os permitir. Isto fará com que as linhas vazias separem as chaves todas as vezes. No exemplo acima, produziria duas chaves, ``key`` e ``this``.
ru: Пользователю может быть особенно проблематично увидеть, использует ли он пропорциональный шрифт для редактирования файла. Вот почему, если вашему приложению не нужны значения с пустыми строками, вам следует запретить их использование. Это приведет к тому, что пустые строки будут каждый раз разделять ключи. В приведенном выше примере будет создано два ключа: ``key`` и ``this``.
