Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/configparser.po
Languages: es_es, pt_pt, ru

source: import configparser cfg = configparser.ConfigParser() cfg.read('example.cfg') # Set the optional *raw* argument of get() to True if you wish to disable # interpolation in a single get operation. print(cfg.get('Section1', 'foo', raw=False)) # -> "Python is fun!" print(cfg.get('Section1', 'foo', raw=True)) # -> "%(bar)s is %(baz)s!" # The optional *vars* argument is a dict with members that will take # precedence in interpolation. print(cfg.get('Section1', 'foo', vars={'bar': 'Documentation', 'baz': 'evil'})) # The optional *fallback* argument can be used to provide a fallback value print(cfg.get('Section1', 'foo')) # -> "Python is fun!" print(cfg.get('Section1', 'foo', fallback='Monty is not.')) # -> "Python is fun!" print(cfg.get('Section1', 'monster', fallback='No such things as monsters.')) # -> "No such things as monsters." # A bare print(cfg.get('Section1', 'monster')) would raise NoOptionError # but we can also use: print(cfg.get('Section1', 'monster', fallback=None)) # -> None
es_es: import configparser cfg = configparser.ConfigParser() cfg.read('example.cfg') # Establecer el argumento opcional *raw* de get() en True si desea deshabilitar # la interpolación en una sola operación get. print(cfg.get('Section1', 'foo', raw=False)) # -> "Python is fun!" print(cfg.get('Section1', 'foo', raw=True)) # -> "%(bar)s is %(baz)s!" # El argumento opcional *vars* es un dict con miembros que tomarán # precedencia en la interpolación. print(cfg.get('Section1', 'foo', vars={'bar': 'Documentation', 'baz': 'evil'})) # El argumento opcional *fallback* se puede usar para proporcionar un valor alternativo print(cfg.get('Section1', 'foo')) # -> "¡Python es divertido!" print(cfg.get('Section1', 'foo', fallback='Monty is not.')) # -> "Python es divertido." print(cfg.get('Section1', 'monster', fallback='No such things as monsters.')) # -> "No hay monstruos." # Un simple print(cfg.get('Section1', 'monster')) generaría NoOptionError # pero también podemos usar: print(cfg.get('Section1', 'monster', fallback=None)) # -> Ninguno
pt_pt: import configparser cfg = configparser.ConfigParser() cfg.read('example.cfg') # Defina o argumento opcional *raw* de get() como True se desejar desativar # a interpolação numa única operação get. print(cfg.get('Section1', 'foo', raw=False)) # -> "Python is fun!" print(cfg.get('Section1', 'foo', raw=True)) # -> "%(bar)s is %(baz)s!" # O argumento opcional *vars* é um dicionário com membros que terão precedência na interpolação. print(cfg.get('Section1', 'foo', vars={'bar': 'Documentation', 'baz': 'evil'})) # O argumento opcional *fallback* pode ser usado para fornecer um valor de recurso print(cfg.get('Section1', 'foo')) # -> "Python is fun!" print(cfg.get('Section1', 'foo', fallback='Monty is not.')) # -> "Python is fun!" print(cfg.get('Section1', 'monster', fallback='No such things as monsters.')) # -> "No such things as monsters." # Um simples print(cfg.get('Section1', 'monster')) levantaria NoOptionError # mas também podemos usar: print(cfg.get('Section1', 'monster', fallback=None)) # -> None

source: Default values are available in both types of ConfigParsers. They are used in interpolation if an option used is not defined elsewhere. ::
es_es: Los valores por defecto están disponibles en ambos tipos de ConfigParsers. Se utilizan en la interpolación si una opción utilizada no está definida en otra parte. ::
pt_pt: Os valores predefinidos estão disponíveis em ambos os tipos de ConfigParsers. São usados na interpolação se uma opção usada não estiver definida noutro lugar. ::
ru: Значения по умолчанию доступны в обоих типах ConfigParsers. Они используются при интерполяции, если используемый параметр не определен где-либо еще. ::

source: import configparser # New instance with 'bar' and 'baz' defaulting to 'Life' and 'hard' each config = configparser.ConfigParser({'bar': 'Life', 'baz': 'hard'}) config.read('example.cfg') print(config.get('Section1', 'foo')) # -> "Python is fun!" config.remove_option('Section1', 'bar') config.remove_option('Section1', 'baz') print(config.get('Section1', 'foo')) # -> "Life is hard!"
es_es: import configparser # Nueva instancia con 'bar' y 'baz'predeterminados a 'Life' y 'hard' cada uno config = configparser.ConfigParser({'bar': 'Life', 'baz': 'hard'}) config.read('example.cfg') print(config.get('Section1', 'foo')) # -> "¡Python es divertido!" config.remove_option('Section1', 'bar') config.remove_option('Section1', 'baz') print(config.get('Section1', 'foo')) # -> "¡La vida es dura!"
pt_pt: import configparser # Nova instância com 'bar' e 'baz' predefinidos para 'Life' e 'hard', respetivamente config = configparser.ConfigParser({'bar': 'Life', 'baz': 'hard'}) config.read('example.cfg') print(config.get('Section1', 'foo')) # -> "Python is fun!" config.remove_option('Section1', 'bar') config.remove_option('Section1', 'baz') print(config.get('Section1', 'foo')) # -> "Life is hard!"

source: ConfigParser Objects
es_es: Objetos ConfigParser
pt_pt: Objetos ConfigParser
ru: Объекты ConfigParser

source: The main configuration parser. When *defaults* is given, it is initialized into the dictionary of intrinsic defaults. When *dict_type* is given, it will be used to create the dictionary objects for the list of sections, for the options within a section, and for the default values.
es_es: El principal analizador de configuración. Cuando se da *defaults*, se inicializa en el diccionario de valores por defecto intrínsecos. Cuando se da *dict_type*, se usará para crear los objetos diccionario para la lista de secciones, para las opciones dentro de una sección, y para los valores por defecto.
pt_pt: O principal analisador de configuração. Quando *defaults* é fornecido, é inicializado no dicionário de valores predefinidos intrínsecos. Quando *dict_type* é fornecido, será usado para criar os objetos de dicionário para a lista de secções, para as opções dentro de uma secção e para os valores predefinidos.
ru: Основной парсер конфигурации. Когда задано значение *defaults*, оно инициализируется в словаре встроенных значений по умолчанию. Если указан *dict_type*, он будет использоваться для создания объектов словаря для списка разделов, для параметров внутри раздела и для значений по умолчанию.

source: When *delimiters* is given, it is used as the set of substrings that divide keys from values. When *comment_prefixes* is given, it will be used as the set of substrings that prefix comments in otherwise empty lines. Comments can be indented. When *inline_comment_prefixes* is given, it will be used as the set of substrings that prefix comments in non-empty lines.
es_es: Cuando se proporciona *comment_prefixes*, se usará como el conjunto de subcadenas que prefijan comentarios en líneas que de otro modo estarían vacías. Los comentarios se pueden sangrar. Cuando se proporciona *inline_comment_prefixes*, se usará como el conjunto de subcadenas que prefijan comentarios en líneas no vacías.
pt_pt: Quando *delimiters* é fornecido, é usado como o conjunto de substrings que dividem as chaves dos valores. Quando *comment_prefixes* é fornecido, será usado como o conjunto de substrings que prefixam comentários em linhas vazias. Os comentários podem ser indentados. Quando *inline_comment_prefixes* é fornecido, será usado como o conjunto de substrings que prefixam comentários em linhas não vazias.
ru: Если указаны *разделители*, они используются как набор подстрок, которые отделяют ключи от значений. Если указан *comment_prefixes*, он будет использоваться как набор подстрок, которые ставят комментарии в пустых строках. Комментарии могут быть с отступом. Если указан *inline_comment_prefixes*, он будет использоваться как набор подстрок, которые ставят комментарии перед комментариями в непустых строках.

source: When *strict* is ``True`` (the default), the parser won't allow for any section or option duplicates while reading from a single source (file, string or dictionary), raising :exc:`DuplicateSectionError` or :exc:`DuplicateOptionError`. When *empty_lines_in_values* is ``False`` (default: ``True``), each empty line marks the end of an option. Otherwise, internal empty lines of a multiline option are kept as part of the value. When *allow_no_value* is ``True`` (default: ``False``), options without values are accepted; the value held for these is ``None`` and they are serialized without the trailing delimiter.
es_es: Cuando *strict* es ``True`` (el valor por defecto), el analizador sintáctico no permitirá ninguna sección u opción duplicada mientras se lee de una única fuente (archivo, cadena o diccionario), elevando :exc:`DuplicateSectionError` o :exc:`DuplicateOptionError`. Cuando *empty_lines_in_values* es ``False`` (valor por defecto: ``True``), cada línea vacía marca el final de una opción. En caso contrario, las líneas vacías internas de una opción multilínea se mantienen como parte del valor. Cuando *allow_no_value* es ``True`` (por defecto: ``False``), se aceptan opciones sin valores; el valor que se mantiene para éstas es ``None`` y se serializan sin el delimitador final.
pt_pt: Quando *strict* é ``True`` (o predefinido), o analisador não permitirá quaisquer duplicados de secções ou opções ao ler de uma única fonte (ficheiro, string ou dicionário), levantando :exc:`DuplicateSectionError` ou :exc:`DuplicateOptionError`. Quando *empty_lines_in_values* é ``False`` (predefinido: ``True``), cada linha vazia marca o fim de uma opção. Caso contrário, as linhas vazias internas de uma opção multilinha são mantidas como parte do valor. Quando *allow_no_value* é ``True`` (predefinido: ``False``), as opções sem valores são aceites; o valor mantido para estas é ``None`` e são serializadas sem o delimitador final.
ru: Когда *strict* имеет значение True (по умолчанию), синтаксический анализатор не допускает дублирования разделов или опций при чтении из одного источника (файла, строки или словаря), вызывая :exc:`DuplateSectionError` или : exc:`DuplateOptionError`. Когда *empty_lines_in_values* имеет значение «False» (по умолчанию: «True»), каждая пустая строка отмечает конец опции. В противном случае внутренние пустые строки многострочного параметра сохраняются как часть значения. Когда *allow_no_value* имеет значение True (по умолчанию: False), принимаются параметры без значений; для них сохраняется значение None, и они сериализуются без конечного разделителя.

source: When *default_section* is given, it specifies the name for the special section holding default values for other sections and interpolation purposes (normally named ``"DEFAULT"``). This value can be retrieved and changed at runtime using the ``default_section`` instance attribute. This won't re-evaluate an already parsed config file, but will be used when writing parsed settings to a new config file.
es_es: Cuando se da *default_section*, se especifica el nombre de la sección especial que contiene los valores por defecto para otras secciones y propósitos de interpolación (normalmente llamada ``"DEFAULT"``). Este valor puede recuperarse y modificarse en tiempo de ejecución mediante el atributo de instancia ``default_section``. Esto no reevaluará un archivo de configuración ya analizado, pero se utilizará cuando se escriban los ajustes analizados en un nuevo archivo de configuración.
pt_pt: Quando *default_section* é fornecido, especifica o nome para a secção especial que contém valores predefinidos para outras secções e fins de interpolação (normalmente chamada ``"DEFAULT"``). Este valor pode ser recuperado e alterado em tempo de execução usando o atributo de instância ``default_section``. Isto não reavaliará um ficheiro de configuração já analisado, mas será usado ao escrever as definições analisadas num novo ficheiro de configuração.
ru: Если указан *default_section*, он определяет имя специального раздела, содержащего значения по умолчанию для других разделов и целей интерполяции (обычно называемый ``"DEFAULT"``). Это значение можно получить и изменить во время выполнения, используя атрибут экземпляра ``default_section``. Это не приведет к повторной оценке уже проанализированного файла конфигурации, но будет использоваться при записи проанализированных настроек в новый файл конфигурации.

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_.
es_es: El comportamiento de interpolación puede personalizarse proporcionando un manejador personalizado a través del argumento *interpolation*. ``None`` puede utilizarse para desactivar completamente la interpolación, ``ExtendedInterpolation()`` proporciona una variante más avanzada inspirada en ``zc.buildout``. Más información sobre el tema en la sección `dedicada a la documentación <#interpolation-of-values>`_.
ru: Поведение интерполяции можно настроить, предоставив собственный обработчик через аргумент *interpolation*. ``None`` можно использовать для полного отключения интерполяции, ``ExtendedInterpolation()`` предоставляет более продвинутый вариант, вдохновленный ``zc.buildout``. Подробнее об этом читайте в `специальном разделе документации <#interpolation-of-values>`_.

source: All option names used in interpolation will be passed through the :meth:`optionxform` method just like any other option name reference. For example, using the default implementation of :meth:`optionxform` (which converts option names to lower case), the values ``foo %(bar)s`` and ``foo %(BAR)s`` are equivalent.
es_es: Todos los nombres de opción utilizados en la interpolación se pasarán a través del método :meth:`optionxform` como cualquier otra referencia de nombre de opción. Por ejemplo, utilizando la implementación por defecto de :meth:`optionxform` (que convierte los nombres de opción a minúsculas), los valores ``foo %(bar)s`` y ``foo %(BAR)s`` son equivalentes.
pt_pt: Todos os nomes de opções usados na interpolação serão passados pelo método :meth:`optionxform`, tal como qualquer outra referência de nome de opção. Por exemplo, usando a implementação predefinida de :meth:`optionxform` (que converte nomes de opções para minúsculas), os valores ``foo %(bar)s`` e ``foo %(BAR)s`` são equivalentes.
ru: Все имена опций, используемые при интерполяции, будут передаваться через метод :meth:`optionxform`, как и любая другая ссылка на имя опции. Например, при использовании реализации :meth:`optionxform` по умолчанию (которая преобразует имена опций в нижний регистр), значения ``foo %(бар)с `` и ``фу %(БАР)с `` эквивалентны.

source: When *converters* is given, it should be a dictionary where each key represents the name of a type converter and each value is a callable implementing the conversion from string to the desired datatype. Every converter gets its own corresponding :meth:`!get*` method on the parser object and section proxies.
es_es: Cuando se da *converters*, debe ser un diccionario donde cada clave representa el nombre de un convertidor de tipo y cada valor es un callable que implementa la conversión de cadena al tipo de dato deseado. Cada convertidor tiene su propio método :meth:`!get*` correspondiente en el objeto analizador y en los proxies de sección.
pt_pt: Quando *converters* é fornecido, deve ser um dicionário onde cada chave representa o nome de um conversor de tipo e cada valor é um objeto invocável que implementa a conversão de string para o tipo de dados desejado. Cada conversor obtém o seu próprio método :meth:`!get*` correspondente no objeto analisador e nos proxies de secção.

source: The default *dict_type* is :class:`collections.OrderedDict`.
es_es: El *dict_type* por defecto es :class:`collections.OrderedDict`.
pt_pt: O tipo *dict_type* predefinido é :class:`collections.OrderedDict`.
ru: По умолчанию *dict_type* — :class:`collections.OrderedDict`.

source: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* and *interpolation* were added.
es_es: Se han añadido *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* e *interpolation*.
pt_pt: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* e *interpolation* foram adicionados.
ru: Были добавлены *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* и *interpolation*.

source: The *converters* argument was added.
es_es: Se ha añadido el argumento *converters*.
pt_pt: O argumento *converters* foi adicionado.
ru: Был добавлен аргумент *converters*.

source: The *defaults* argument is read with :meth:`read_dict`, providing consistent behavior across the parser: non-string keys and values are implicitly converted to strings.
es_es: El argumento *defaults* se lee con :meth:`read_dict`, lo que proporciona un comportamiento coherente en todo el analizador sintáctico: las claves y los valores que no son cadenas se convierten implícitamente en cadenas.
pt_pt: O argumento *defaults* é lido com :meth:`read_dict`, fornecendo comportamento consistente em todo o analisador: chaves e valores não-string são implicitamente convertidos para strings.

source: The default *dict_type* is :class:`dict`, since it now preserves insertion order.
es_es: El *dict_type* por defecto es :class:`dict`, ya que ahora preserva el orden de inserción.
pt_pt: O tipo *dict_type* predefinido é :class:`dict`, uma vez que agora preserva a ordem de inserção.
ru: По умолчанию *dict_type* — :class:`dict`, поскольку теперь он сохраняет порядок вставки.

source: Return a dictionary containing the instance-wide defaults.
es_es: Devuelve un diccionario que contiene los valores predeterminados para toda la instancia.
pt_pt: Retorna um dicionário contendo os valores predefinidos em toda a instância.
ru: Возвращает словарь, содержащий значения по умолчанию для всего экземпляра.

source: Return a list of the sections available; the *default section* is not included in the list.
es_es: Devuelve una lista de las secciones disponibles; la *sección predeterminada* no se incluye en la lista.
pt_pt: Retorna uma lista das secções disponíveis; a *secção predefinida* não está incluída na lista.
ru: Вернуть список доступных разделов; *раздел по умолчанию* не включен в список.

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised. The name of the section must be a string; if not, :exc:`TypeError` is raised.
es_es: Añade una sección llamada *section* a la instancia. Si ya existe una sección con el nombre indicado, aparece :exc:`DuplicateSectionError`. Si se pasa el nombre de *sección* por defecto, aparece :exc:`ValueError`. El nombre de la sección debe ser una cadena; en caso contrario, aparece :exc:`TypeError`.
pt_pt: Adiciona uma secção com o nome *section* à instância. Se uma secção com o nome dado já existir, é levantada uma :exc:`DuplicateSectionError`. Se o nome da *secção predefinida* for passado, é levantada uma :exc:`ValueError`. O nome da secção deve ser uma string; se não for, é levantada uma :exc:`TypeError`.
ru: Добавьте в экземпляр раздел с именем *section*. Если раздел с данным именем уже существует, возникает :exc:`DuplateSectionError`. Если передается имя раздела *default*, возникает :exc:`ValueError`. Имя раздела должно быть строкой; в противном случае возникает :exc:`TypeError`.

source: Non-string section names raise :exc:`TypeError`.
es_es: Los nombres de sección que no son de cadena generan :exc:`TypeError`.
pt_pt: Nomes de secção não-string levantam :exc:`TypeError`.
ru: Имена нестроковых разделов вызывают :exc:`TypeError`.

source: Indicates whether the named *section* is present in the configuration. The *default section* is not acknowledged.
es_es: Indica si la *sección* nombrada está presente en la configuración. No se reconoce la *sección por defecto*.
pt_pt: Indica se a *secção* nomeada está presente na configuração. A *secção predefinida* não é reconhecida.
ru: Указывает, присутствует ли указанный *раздел* в конфигурации. *Раздел по умолчанию* не подтверждается.

source: Return a list of options available in the specified *section*.
es_es: Devuelve una lista de opciones disponibles en la *sección* especificada.
pt_pt: Retorna uma lista de opções disponíveis na *secção* especificada.
ru: Возвращает список опций, доступных в указанном *разделе*.

source: If the given *section* exists, and contains the given *option*, return :const:`True`; otherwise return :const:`False`. If the specified *section* is :const:`None` or an empty string, DEFAULT is assumed.
es_es: Si la *sección* dada existe, y contiene la *opción* dada, devuelve :const:`True`; en caso contrario devuelve :const:`False`. Si la *sección* especificada es :const:`None` o una cadena vacía, se asume DEFAULT.
pt_pt: Se a *secção* dada existir e contiver a *opção* dada, retorna :const:`True`; caso contrário, retorna :const:`False`. Se a *secção* especificada for :const:`None` ou uma string vazia, assume-se DEFAULT.
ru: Если данный *раздел* существует и содержит данную *опцию*, верните :const:`True`; в противном случае верните :const:`False`. Если указанный *раздел* имеет значение :const:`None` или пустую строку, предполагается DEFAULT.

source: Attempt to read and parse an iterable of filenames, returning a list of filenames which were successfully parsed.
es_es: Intenta leer y analizar un iterable de nombres de archivo, devolviendo una lista de nombres de archivo que se han analizado correctamente.
pt_pt: Tenta ler e analisar um iterável de nomes de ficheiros, retornando uma lista de nomes de ficheiros que foram analisados com sucesso.
ru: Попытка прочитать и проанализировать итерацию имен файлов, вернув список имен файлов, которые были успешно проанализированы.
