Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/configparser.po
Languages: es_es, pt_pt, ru

source: If *filenames* is a string, a :class:`bytes` object or a :term:`path-like object`, it is treated as a single filename. If a file named in *filenames* cannot be opened, that file will be ignored. This is designed so that you can specify an iterable of potential configuration file locations (for example, the current directory, the user's home directory, and some system-wide directory), and all existing configuration files in the iterable will be read.
es_es: Si *filenames* es una cadena, un objeto :class:`bytes` o un objeto :term:`path-like object`, se tratará como un único nombre de archivo. Si un fichero nombrado en *filenames* no se puede abrir, se ignorará ese fichero. Esto está diseñado para que pueda especificar una iterable de posibles ubicaciones de ficheros de configuración (por ejemplo, el directorio actual, el directorio personal del usuario y algún directorio de todo el sistema), y se leerán todos los ficheros de configuración existentes en la iterable.
pt_pt: Se *filenames* for uma string, um objeto :class:`bytes` ou um objeto :term:`path-like`, é tratado como um único nome de ficheiro. Se um ficheiro nomeado em *filenames* não puder ser aberto, esse ficheiro será ignorado. Isto é concebido para que possa especificar um iterável de locais potenciais de ficheiros de configuração (por exemplo, o diretório atual, o diretório inicial do utilizador e algum diretório do sistema), e todos os ficheiros de configuração existentes no iterável serão lidos.
ru: Если *filenames* представляет собой строку, объект :class:`bytes` или :term:`path-like object`, он рассматривается как одно имя файла. Если файл, указанный в *filenames*, не может быть открыт, этот файл будет проигнорирован. Это сделано так, что вы можете указать итерацию потенциальных местоположений файлов конфигурации (например, текущий каталог, домашний каталог пользователя и какой-либо общесистемный каталог), и все существующие файлы конфигурации в итерации будут прочитаны.

source: If none of the named files exist, the :class:`ConfigParser` instance will contain an empty dataset. An application which requires initial values to be loaded from a file should load the required file or files using :meth:`read_file` before calling :meth:`read` for any optional files::
es_es: Si no existe ninguno de los archivos mencionados, la instancia :class:`ConfigParser` contendrá un conjunto de datos vacío. Una aplicación que requiera que los valores iniciales se carguen desde un archivo debe cargar el archivo o archivos requeridos utilizando :meth:`read_file` antes de llamar a :meth:`read` para cualquier archivo opcional::
pt_pt: Se nenhum dos ficheiros nomeados existir, a instância :class:`ConfigParser` conterá um conjunto de dados vazio. Uma aplicação que requer valores iniciais a serem carregados de um ficheiro deve carregar o ficheiro ou ficheiros necessários usando :meth:`read_file` antes de chamar :meth:`read` para quaisquer ficheiros opcionais::
ru: Если ни один из указанных файлов не существует, экземпляр :class:`ConfigParser` будет содержать пустой набор данных. Приложение, которому требуется загрузка начальных значений из файла, должно загрузить требуемый файл или файлы с помощью :meth:`read_file` перед вызовом :meth:`read` для любых необязательных файлов::

source: Added the *encoding* parameter. Previously, all files were read using the default encoding for :func:`open`.
es_es: Se ha añadido el parámetro *encoding*. Anteriormente, todos los archivos se leían utilizando la codificación predeterminada para :func:`open`.
pt_pt: Adicionado o parâmetro *encoding*. Anteriormente, todos os ficheiros eram lidos usando a codificação predefinida para :func:`open`.
ru: Добавлен параметр *encoding*. Раньше все файлы читались с использованием кодировки по умолчанию для :func:`open`.

source: The *filenames* parameter accepts a :term:`path-like object`.
es_es: El parámetro *filenames* acepta un :term:`path-like object`.
pt_pt: O parâmetro *filenames* aceita um objeto :term:`path-like`.
ru: Параметр *filenames* принимает объект, похожий на путь.

source: The *filenames* parameter accepts a :class:`bytes` object.
es_es: El parámetro *filenames* acepta un objeto :class:`bytes`.
pt_pt: O parâmetro *filenames* aceita um objeto :class:`bytes`.
ru: Параметр *filenames* принимает объект :class:`bytes`.

source: Read and parse configuration data from *f* which must be an iterable yielding Unicode strings (for example files opened in text mode).
es_es: Lee y analiza los datos de configuración de *f*, que debe ser un iterable que produzca cadenas Unicode (por ejemplo, archivos abiertos en modo texto).
pt_pt: Lê e analisa dados de configuração de *f*, que deve ser um iterável que produz strings Unicode (por exemplo, ficheiros abertos em modo de texto).
ru: Считайте и проанализируйте данные конфигурации из *f*, которые должны быть итеративными, возвращающими строки Unicode (например, файлы, открытые в текстовом режиме).

source: Optional argument *source* specifies the name of the file being read. If not given and *f* has a :attr:`!name` attribute, that is used for *source*; the default is ``'<???>'``.
es_es: El argumento opcional *source* especifica el nombre del fichero que se está leyendo. Si no se indica y *f* tiene un atributo :attr:`!name`, se utilizará para *source*; el valor predeterminado es ``'<???>'``.
pt_pt: O argumento opcional *source* especifica o nome do ficheiro a ser lido. Se não for fornecido e *f* tiver um atributo :attr:`!name`, esse é usado para *source*; o predefinido é ``'<???>'``.
ru: Необязательный аргумент *source* указывает имя читаемого файла. Если он не указан и *f* имеет атрибут :attr:`!name`, который используется для *source*; значение по умолчанию — ``'<???>'``.

source: Replaces :meth:`!readfp`.
es_es: Sustituye a :meth:`!readfp`.
pt_pt: Substitui :meth:`!readfp`.
ru: Заменяет :meth:`!readfp`.

source: Parse configuration data from a string.
es_es: Analiza los datos de configuración de una cadena.
pt_pt: Analisa dados de configuração a partir de uma string.
ru: Анализ данных конфигурации из строки.

source: Optional argument *source* specifies a context-specific name of the string passed. If not given, ``'<string>'`` is used. This should commonly be a filesystem path or a URL.
es_es: El argumento opcional *source* especifica un nombre específico del contexto de la cadena pasada. Si no se indica, se utiliza ``'<string>'``. Normalmente debería ser una ruta del sistema de archivos o una URL.
pt_pt: O argumento opcional *source* especifica um nome específico do contexto da string passada. Se não for fornecido, ``'<string>'`` é usado. Isto deve ser comumente um caminho do sistema de ficheiros ou um URL.
ru: Необязательный аргумент *source* указывает контекстно-зависимое имя передаваемой строки. Если не указано, используется ``'<string>'``. Обычно это должен быть путь к файловой системе или URL-адрес.

source: Load configuration from any object that provides a dict-like ``items()`` method. Keys are section names, values are dictionaries with keys and values that should be present in the section. If the used dictionary type preserves order, sections and their keys will be added in order. Values are automatically converted to strings.
es_es: Carga la configuración desde cualquier objeto que proporcione un método tipo dict ``items()``. Las claves son nombres de secciones, los valores son diccionarios con claves y valores que deben estar presentes en la sección. Si el tipo de diccionario utilizado preserva el orden, las secciones y sus claves se añadirán en orden. Los valores se convierten automáticamente en cadenas.
pt_pt: Carrega a configuração de qualquer objeto que forneça um método ``items()`` semelhante a um dicionário. As chaves são nomes de secções, os valores são dicionários com chaves e valores que devem estar presentes na secção. Se o tipo de dicionário usado preservar a ordem, as secções e as suas chaves serão adicionadas por ordem. Os valores são automaticamente convertidos para strings.
ru: Загрузите конфигурацию из любого объекта, который предоставляет метод item(), похожий на dict. Ключи — это названия разделов, значения — словари с ключами и значениями, которые должны присутствовать в разделе. Если используемый тип словаря сохраняет порядок, разделы и их ключи будут добавлены по порядку. Значения автоматически преобразуются в строки.

source: Optional argument *source* specifies a context-specific name of the dictionary passed. If not given, ``<dict>`` is used.
es_es: El argumento opcional *source* especifica un nombre específico del contexto del diccionario pasado. Si no se indica, se utiliza ``<dict>``.
pt_pt: O argumento opcional *source* especifica um nome específico do contexto do dicionário passado. Se não for fornecido, ``<dict>`` é usado.
ru: Необязательный аргумент *source* указывает контекстно-зависимое имя переданного словаря. Если не указано, используется ``<dict>``.

source: This method can be used to copy state between parsers.
es_es: Este método puede utilizarse para copiar el estado entre analizadores sintácticos.
pt_pt: Este método pode ser usado para copiar o estado entre analisadores.
ru: Этот метод можно использовать для копирования состояния между парсерами.

source: Get an *option* value for the named *section*. If *vars* is provided, it must be a dictionary. The *option* is looked up in *vars* (if provided), *section*, and in *DEFAULTSECT* in that order. If the key is not found and *fallback* is provided, it is used as a fallback value. ``None`` can be provided as a *fallback* value.
es_es: Obtiene un valor de *option* para la *sección* indicada. Si se proporciona *vars*, debe ser un diccionario. La *option* se busca en *vars* (si se proporciona), *section*, y en *DEFAULTSECT* en ese orden. Si no se encuentra la clave y se proporciona *fallback*, se utiliza como valor de reserva. ``None`` puede proporcionarse como valor de *fallback*.
pt_pt: Obtém um valor de *opção* para a *secção* nomeada. Se *vars* for fornecido, deve ser um dicionário. A *opção* é procurada em *vars* (se fornecido), *secção* e em *DEFAULTSECT* por essa ordem. Se a chave não for encontrada e *fallback* for fornecido, é usado como um valor de recurso. ``None`` pode ser fornecido como um valor de *fallback*.
ru: Получите значение *option* для именованного *section*. Если указан *vars*, это должен быть словарь. *опция* ищется в *vars* (если есть), *section* и в *DEFAULTSECT* в указанном порядке. Если ключ не найден и указан *fallback*, он используется как резервное значение. ``None`` может быть предоставлено как *резервное* значение.

source: All the ``'%'`` interpolations are expanded in the return values, unless the *raw* argument is true. Values for interpolation keys are looked up in the same manner as the option.
es_es: Todas las interpolaciones de ``'%'`` se expanden en los valores de retorno, a menos que el argumento *raw* sea verdad. Los valores de las claves de interpolación se buscan del mismo modo que la opción.
pt_pt: Todas as interpolações ``'%'`` são expandidas nos valores de retorno, a menos que o argumento *raw* seja verdadeiro. Os valores para as chaves de interpolação são procurados da mesma forma que a opção.
ru: Все интерполяции ``'%'`` расширяются в возвращаемых значениях, если только аргумент *raw* не имеет значения true. Значения ключей интерполяции ищутся так же, как и этот параметр.

source: Arguments *raw*, *vars* and *fallback* are keyword only to protect users from trying to use the third argument as the *fallback* fallback (especially when using the mapping protocol).
es_es: Los argumentos *raw*, *vars* y *fallback* son sólo palabras clave para proteger a los usuarios de intentar utilizar el tercer argumento como el *fallback* fallback (especialmente cuando se utiliza el protocolo de mapeo).
pt_pt: Os argumentos *raw*, *vars* e *fallback* são apenas por palavra-chave para proteger os utilizadores de tentarem usar o terceiro argumento como o *fallback* de recurso (especialmente ao usar o protocolo de mapeamento).
ru: Аргументы *raw*, *vars* и *fallback* являются ключевыми словами только для защиты пользователей от попыток использовать третий аргумент в качестве запасного *fallback* (особенно при использовании протокола сопоставления).

source: A convenience method which coerces the *option* in the specified *section* to an integer. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
es_es: Método práctico que convierte la *opción* de la *sección* especificada en un número entero. Véase :meth:`get` para la explicación de *raw*, *vars* y *fallback*.
pt_pt: Um método de conveniência que converte a *opção* na *secção* especificada para um inteiro. Consulte :meth:`get` para a explicação de *raw*, *vars* e *fallback*.
ru: Удобный метод, который приводит *опцию* в указанном *разделе* к целому числу. См. :meth:`get` для объяснения *raw*, *vars* и *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a floating-point number. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
es_es: Método que convierte la *opción* de la *sección* especificada en un número de coma flotante. Véase :meth:`get` para la explicación de *raw*, *vars* y *fallback*.
pt_pt: Um método de conveniência que converte a *opção* na *secção* especificada para um número de ponto flutuante. Consulte :meth:`get` para a explicação de *raw*, *vars* e *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a Boolean value. Note that the accepted values for the option are ``'1'``, ``'yes'``, ``'true'``, and ``'on'``, which cause this method to return ``True``, and ``'0'``, ``'no'``, ``'false'``, and ``'off'``, which cause it to return ``False``. These string values are checked in a case-insensitive manner. Any other value will cause it to raise :exc:`ValueError`. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
es_es: Método práctico que convierte la *opción* de la *sección* especificada en un valor booleano. Tenga en cuenta que los valores aceptados para la opción son ``'1'``, ``'yes'``, ``'true'``, y ``'on'``, que hacen que este método devuelva ``True``, y ``'0'``, ``'no'``, ``'false'``, y ``'off'``, que hacen que devuelva ``False``. Estos valores de cadena se comprueban sin distinguir entre mayúsculas y minúsculas. Cualquier otro valor hará que se muestre :exc:`ValueError`. Véase :meth:`get` para la explicación de *raw*, *vars* y *fallback*.
pt_pt: Um método de conveniência que converte a *opção* na *secção* especificada para um valor booleano. Note que os valores aceites para a opção são ``'1'``, ``'yes'``, ``'true'`` e ``'on'``, que fazem com que este método retorne ``True``, e ``'0'``, ``'no'``, ``'false'`` e ``'off'``, que fazem com que retorne ``False``. Estes valores de string são verificados de forma não sensível a maiúsculas e minúsculas. Qualquer outro valor fará com que levante :exc:`ValueError`. Consulte :meth:`get` para a explicação de *raw*, *vars* e *fallback*.
ru: Удобный метод, который приводит *option* в указанном *section* к логическому значению. Обратите внимание, что допустимыми значениями для этой опции являются ``'1'``, ``'yes'``, ``'true'`` и ``'on'``, что приводит к тому, что этот метод возвращает `` True``, ``'0'``, ``'no'``, ``'false'`` и ``'off'`, которые заставляют его возвращать ``False``. Эти строковые значения проверяются без учета регистра. Любое другое значение приведет к повышению :exc:`ValueError`. См. :meth:`get` для объяснения *raw*, *vars* и *fallback*.

source: When *section* is not given, return a list of *section_name*, *section_proxy* pairs, including DEFAULTSECT.
es_es: Si no se indica *section*, devuelve una lista de pares *section_name*, *section_proxy*, incluido DEFAULTSECT.
pt_pt: Quando *section* não é fornecido, retorna uma lista de pares *section_name*, *section_proxy*, incluindo DEFAULTSECT.
ru: Если *section* не указан, верните список пар *section_name*, *section_proxy*, включая DEFAULTSECT.

source: Otherwise, return a list of *name*, *value* pairs for the options in the given *section*. Optional arguments have the same meaning as for the :meth:`get` method.
es_es: En caso contrario, devuelve una lista de pares *nombre*, *valor* para las opciones de la *sección* dada. Los argumentos opcionales tienen el mismo significado que para el método :meth:`get`.
pt_pt: Caso contrário, retorna uma lista de pares *name*, *value* para as opções na *secção* dada. Os argumentos opcionais têm o mesmo significado que para o método :meth:`get`.
ru: В противном случае верните список пар *имя*, *значение* для параметров в данном *разделе*. Необязательные аргументы имеют то же значение, что и для метода :meth:`get`.

source: Items present in *vars* no longer appear in the result. The previous behaviour mixed actual parser options with variables provided for interpolation.
es_es: Los elementos presentes en *vars* ya no aparecen en el resultado. El comportamiento anterior mezclaba opciones reales del analizador sintáctico con variables proporcionadas para la interpolación.
pt_pt: Itens presentes em *vars* já não aparecem no resultado. O comportamento anterior misturava opções reais do analisador com variáveis fornecidas para interpolação.
ru: Элементы, присутствующие в *vars*, больше не отображаются в результатах. Предыдущее поведение смешивало фактические параметры синтаксического анализа с переменными, предоставленными для интерполяции.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. *option* and *value* must be strings; if not, :exc:`TypeError` is raised.
es_es: Si la sección dada existe, establece la opción dada en el valor especificado; en caso contrario, lanza :exc:`NoSectionError`. *option** y *value* deben ser cadenas; en caso contrario, aparece :exc:`TypeError`.
pt_pt: Se a secção dada existir, define a opção dada para o valor especificado; caso contrário, levanta :exc:`NoSectionError`. *option* e *value* devem ser strings; se não forem, é levantada uma :exc:`TypeError`.
ru: Если данный раздел существует, установите для данной опции указанное значение; в противном случае поднимите :exc:`NoSectionError`. *опция* и *значение* должны быть строками; в противном случае возникает :exc:`TypeError`.

source: Write a representation of the configuration to the specified :term:`file object`, which must be opened in text mode (accepting strings). This representation can be parsed by a future :meth:`read` call. If *space_around_delimiters* is true, delimiters between keys and values are surrounded by spaces.
es_es: Escribe una representación de la configuración en el objeto :term:`file object` especificado, que debe abrirse en modo texto (aceptando cadenas). Esta representación puede ser analizada por una futura llamada a :meth:`read`. Si *space_around_delimiters* es verdadero, los delimitadores entre claves y valores se rodean de espacios.
pt_pt: Escreve uma representação da configuração no objeto :term:`file` especificado, que deve ser aberto em modo de texto (aceitando strings). Esta representação pode ser analisada por uma chamada futura :meth:`read`. Se *space_around_delimiters* for verdadeiro, os delimitadores entre chaves e valores são rodeados por espaços.
ru: Запишите представление конфигурации в указанный :term:`файловый объект`, который должен быть открыт в текстовом режиме (принимающий строки). Это представление может быть проанализировано будущим вызовом :meth:`read`. Если *space_around_delimiters* имеет значение true, разделители между ключами и значениями заключаются в пробелы.

source: Comments in the original configuration file are not preserved when writing the configuration back. What is considered a comment, depends on the given values for *comment_prefix* and *inline_comment_prefix*.
es_es: Los comentarios en el fichero de configuración original no se conservan al volver a escribir la configuración. Lo que se considera un comentario, depende de los valores dados para *comment_prefix* y *inline_comment_prefix*.
pt_pt: Os comentários no ficheiro de configuração original não são preservados ao escrever a configuração de volta. O que é considerado um comentário depende dos valores dados para *comment_prefix* e *inline_comment_prefix*.
ru: Комментарии в исходном файле конфигурации не сохраняются при обратной записи конфигурации. То, что считается комментарием, зависит от заданных значений *comment_prefix* и *inline_comment_prefix*.

source: Remove the specified *option* from the specified *section*. If the section does not exist, raise :exc:`NoSectionError`. If the option existed to be removed, return :const:`True`; otherwise return :const:`False`.
es_es: Elimina la *option* especificada de la *section* especificada. Si la sección no existe, devuelve :exc:`NoSectionError`. Si la opción existía para ser eliminada, devuelve :const:`True`; en caso contrario devuelve :const:`False`.
pt_pt: Remove a *opção* especificada da *secção* especificada. Se a secção não existir, levanta :exc:`NoSectionError`. Se a opção existir para ser removida, retorna :const:`True`; caso contrário, retorna :const:`False`.
ru: Удалить указанную *опцию* из указанного *раздела*. Если раздел не существует, поднимите :exc:`NoSectionError`. Если опция, которую нужно удалить, существовала, верните :const:`True`; в противном случае верните :const:`False`.

source: Remove the specified *section* from the configuration. If the section in fact existed, return ``True``. Otherwise return ``False``.
es_es: Elimina la *section* especificada de la configuración. Si la sección existía, devuelve ``True``. Si no, devuelve ``False``.
pt_pt: Remove a *secção* especificada da configuração. Se a secção de facto existir, retorna ``True``. Caso contrário, retorna ``False``.
ru: Удалите указанный *раздел* из конфигурации. Если раздел действительно существовал, верните ``True``. В противном случае верните ``False``.

source: Transforms the option name *option* as found in an input file or as passed in by client code to the form that should be used in the internal structures. The default implementation returns a lower-case version of *option*; subclasses may override this or client code can set an attribute of this name on instances to affect this behavior.
es_es: Transforma el nombre de la opción *option* tal y como se encuentra en un archivo de entrada o tal y como lo pasa el código del cliente a la forma que debería utilizarse en las estructuras internas. La implementación predeterminada devuelve una versión en minúsculas de *option*; las subclases pueden anular esto o el código cliente puede establecer un atributo de este nombre en las instancias para afectar a este comportamiento.
pt_pt: Transforma o nome da opção *option*, conforme encontrado num ficheiro de entrada ou conforme passado pelo código do cliente, para a forma que deve ser usada nas estruturas internas. A implementação predefinida retorna uma versão em minúsculas de *option*; subclasses podem substituir isto ou o código do cliente pode definir um atributo com este nome nas instâncias para afetar este comportamento.
ru: Преобразует имя опции *option*, найденное во входном файле или переданное клиентским кодом, в форму, которая должна использоваться во внутренних структурах. Реализация по умолчанию возвращает версию *option* в нижнем регистре; подклассы могут переопределить это, или клиентский код может установить атрибут с этим именем в экземплярах, чтобы повлиять на это поведение.
