Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/configparser.po
Languages: es_es, pt_pt, ru

source: :mod:`!configparser` --- Configuration file parser
es_es: :mod:`!configparser` --- Analizador sintáctico de archivos de configuración
pt_pt: :mod:`!configparser` --- Analisador de ficheiros de configuração

source: **Source code:** :source:`Lib/configparser.py`
es_es: **Código fuente:** :source:`Lib/configparser.py`
pt_pt: **Código-fonte:** :source:`Lib/configparser.py`
ru: **Исходный код:** :source:`Lib/configparser.py`

source: This module provides the :class:`ConfigParser` class which implements a basic configuration language which provides a structure similar to what's found in Microsoft Windows INI files. You can use this to write Python programs which can be customized by end users easily.
es_es: Este módulo proporciona la clase :class:`ConfigParser` que implementa un lenguaje de configuración básico que proporciona una estructura similar a la que se encuentra en los archivos INI de Microsoft Windows. Puedes usar esto para escribir programas Python que pueden ser personalizados por usuarios finales fácilmente.
pt_pt: Este módulo fornece a classe :class:`ConfigParser`, que implementa uma linguagem básica de configuração que fornece uma estrutura semelhante à encontrada nos ficheiros INI do Microsoft Windows. Pode usar isto para escrever programas Python que podem ser facilmente personalizados pelos utilizadores finais.
ru: Этот модуль предоставляет класс :class:`ConfigParser`, который реализует базовый язык конфигурации, обеспечивающий структуру, аналогичную той, что находится в INI-файлах Microsoft Windows. Вы можете использовать это для написания программ на Python, которые конечные пользователи могут легко настроить.

source: This library does *not* interpret or write the value-type prefixes used in the Windows Registry extended version of INI syntax.
es_es: Esta biblioteca *no* interpreta ni escribe los prefijos de tipo valor utilizados en la versión extendida del Registro de Windows de la sintaxis INI.
pt_pt: Esta biblioteca *não* interpreta nem escreve os prefixos de tipo de valor usados na versão estendida da sintaxe INI do Registo do Windows.
ru: Эта библиотека *не* интерпретирует и не записывает префиксы типов значений, используемые в расширенной версии синтаксиса INI реестра Windows.

source: Module :mod:`tomllib`
es_es: Módulo :mod:`tomllib`
pt_pt: Módulo :mod:`tomllib`
ru: Модуль :mod:`tomllib`

source: TOML is a well-specified format for application configuration files. It is specifically designed to be an improved version of INI.
es_es: TOML es un formato bien especificado para archivos de configuración de aplicaciones. Está diseñado específicamente para ser una versión mejorada de INI.
pt_pt: TOML é um formato bem especificado para ficheiros de configuração de aplicações. Foi especificamente concebido para ser uma versão melhorada do INI.
ru: TOML — это четко определенный формат файлов конфигурации приложения. Он специально разработан как улучшенная версия INI.

source: Module :mod:`shlex`
es_es: Módulo :mod:`shlex`
pt_pt: Módulo :mod:`shlex`
ru: Модуль :mod:`shlex`

source: Support for creating Unix shell-like mini-languages which can also be used for application configuration files.
es_es: Soporte para crear minilenguajes tipo shell de Unix que también pueden utilizarse para los archivos de configuración de las aplicaciones.
pt_pt: Suporte para criar mini-linguagens semelhantes a shell Unix, que também podem ser usadas para ficheiros de configuração de aplicações.
ru: Поддержка создания мини-языков, подобных оболочке Unix, которые также можно использовать для файлов конфигурации приложений.

source: Module :mod:`json`
es_es: Módulo :mod:`json`
pt_pt: Módulo :mod:`json`
ru: Модуль :mod:`json`

source: The ``json`` module implements a subset of JavaScript syntax which is sometimes used for configuration, but does not support comments.
es_es: El módulo ``json`` implementa un subconjunto de sintaxis JavaScript que a veces se utiliza para la configuración, pero no admite comentarios.
pt_pt: O módulo ``json`` implementa um subconjunto da sintaxe JavaScript que é, por vezes, usado para configuração, mas não suporta comentários.
ru: Модуль json реализует подмножество синтаксиса JavaScript, который иногда используется для настройки, но не поддерживает комментарии.

source: Quick Start
es_es: Inicio rápido
pt_pt: Início Rápido
ru: Быстрый старт

source: Let's take a very basic configuration file that looks like this:
es_es: Tomemos un fichero de configuración muy básico con el siguiente aspecto:
pt_pt: Vamos considerar um ficheiro de configuração muito básico que se parece com isto:
ru: Давайте возьмем очень простой файл конфигурации, который выглядит следующим образом:

source: The structure of INI files is described `in the following section <#supported-ini-file-structure>`_. Essentially, the file consists of sections, each of which contains keys with values. :mod:`configparser` classes can read and write such files. Let's start by creating the above configuration file programmatically.
es_es: La estructura de los ficheros INI se describe `en la siguiente sección <#supported-ini-file-structure>`_. Esencialmente, el fichero consiste en secciones, cada una de las cuales contiene claves con valores. Las clases :mod:`configparser` pueden leer y escribir tales ficheros. Empecemos creando el fichero de configuración anterior mediante programación.
pt_pt: A estrutura dos ficheiros INI é descrita `na secção seguinte <#supported-ini-file-structure>`_. Basicamente, o ficheiro consiste em secções, cada uma das quais contém chaves com valores. As classes :mod:`configparser` podem ler e escrever tais ficheiros. Vamos começar por criar o ficheiro de configuração acima programaticamente.
ru: Структура файлов INI описана `в следующем разделе <#supported-ini-file-structure>`_. По сути файл состоит из разделов, каждый из которых содержит ключи со значениями. Классы :mod:`configparser` могут читать и записывать такие файлы. Начнем с программного создания вышеуказанного файла конфигурации.

source: As you can see, we can treat a config parser much like a dictionary. There are differences, `outlined later <#mapping-protocol-access>`_, but the behavior is very close to what you would expect from a dictionary.
es_es: Como puedes ver, podemos tratar un analizador de configuración como un diccionario. Hay diferencias, `resumidas más adelante <#mapping-protocol-access>`_, pero el comportamiento es muy parecido a lo que cabría esperar de un diccionario.
pt_pt: Como pode ver, podemos tratar um analisador de configuração muito como um dicionário. Existem diferenças, `descritas mais tarde <#mapping-protocol-access>`_, mas o comportamento é muito próximo do que esperaria de um dicionário.
ru: Как видите, мы можем относиться к анализатору конфигурации во многом как к словарю. Есть различия, `описанные позже <#mapping-protocol-access>`_, но поведение очень близко к тому, что вы ожидаете от словаря.

source: Now that we have created and saved a configuration file, let's read it back and explore the data it holds.
es_es: Ahora que hemos creado y guardado un archivo de configuración, vamos a leerlo y explorar los datos que contiene.
pt_pt: Ahora que criámos e guardámos um ficheiro de configuração, vamos lê-lo de volta e explorar os dados que contém.
ru: Теперь, когда мы создали и сохранили файл конфигурации, давайте прочитаем его и изучим содержащиеся в нем данные.

source: As we can see above, the API is pretty straightforward. The only bit of magic involves the ``DEFAULT`` section which provides default values for all other sections [1]_. Note also that keys in sections are case-insensitive and stored in lowercase [1]_.
es_es: Como vemos, la API es bastante sencilla. La única parte mágica tiene que ver con la sección ``DEFAULT``, que proporciona valores por defecto para todas las demás secciones [1]_. Ten en cuenta también que las claves de las secciones no distinguen entre mayúsculas y minúsculas y se almacenan en minúsculas [1]_.
pt_pt: Como podemos ver acima, a API é bastante simples. A única parte mágica envolve a secção ``DEFAULT``, que fornece valores predefinidos para todas as outras secções [1]_. Note também que as chaves nas secções não são sensíveis a maiúsculas e minúsculas e são armazenadas em minúsculas [1]_.
ru: Как мы видим выше, API довольно прост. Единственная магия связана с разделом DEFAULT, который предоставляет значения по умолчанию для всех остальных разделов. [1]_ . Также обратите внимание, что ключи в разделах не чувствительны к регистру и хранятся в нижнем регистре. [1]_ .

source: It is possible to read several configurations into a single :class:`ConfigParser`, where the most recently added configuration has the highest priority. Any conflicting keys are taken from the more recent configuration while the previously existing keys are retained. The example below reads in an ``override.ini`` file, which will override any conflicting keys from the ``example.ini`` file.
es_es: Es posible leer varias configuraciones en un único :class:`ConfigParser`, donde la configuración añadida más recientemente tiene la máxima prioridad. Cualquier clave conflictiva se toma de la configuración más reciente mientras que las claves existentes previamente se mantienen. En el ejemplo siguiente se lee un archivo ``override.ini``, que anulará cualquier clave conflictiva del archivo ``example.ini``.
pt_pt: É possível ler várias configurações num único :class:`ConfigParser`, onde a configuração mais recentemente adicionada tem a maior prioridade. Quaisquer chaves conflitantes são obtidas da configuração mais recente, enquanto as chaves previamente existentes são mantidas. O exemplo abaixo lê um ficheiro ``override.ini``, que substituirá quaisquer chaves conflitantes do ficheiro ``example.ini``.

source: This behaviour is equivalent to a :meth:`ConfigParser.read` call with several files passed to the *filenames* parameter.
es_es: Este comportamiento equivale a una llamada a :meth:`ConfigParser.read` con varios archivos pasados al parámetro *filenames*.
pt_pt: Este comportamento é equivalente a uma chamada :meth:`ConfigParser.read` com vários ficheiros passados ao parâmetro *filenames*.
ru: Такое поведение эквивалентно вызову :meth:`ConfigParser.read` с несколькими файлами, передаваемыми в параметр *filenames*.

source: Supported Datatypes
es_es: Tipos de datos admitidos
pt_pt: Tipos de Dados Suportados
ru: Поддерживаемые типы данных

source: Config parsers do not guess datatypes of values in configuration files, always storing them internally as strings. This means that if you need other datatypes, you should convert on your own:
es_es: Los analizadores sintácticos de configuración no adivinan los tipos de datos de los valores en los archivos de configuración, almacenándolos siempre internamente como cadenas. Esto significa que si necesitas otros tipos de datos, debes convertirlos por tu cuenta:
pt_pt: Os analisadores de configuração não adivinham os tipos de dados dos valores nos ficheiros de configuração, armazenando-os sempre internamente como strings. Isto significa que, se precisar de outros tipos de dados, deve convertê-los por si próprio:
ru: Анализаторы конфигурации не угадывают типы данных значений в файлах конфигурации, всегда сохраняя их внутри в виде строк. Это означает, что если вам нужны другие типы данных, вам следует преобразовать их самостоятельно:

source: Since this task is so common, config parsers provide a range of handy getter methods to handle integers, floats and booleans. The last one is the most interesting because simply passing the value to ``bool()`` would do no good since ``bool('False')`` is still ``True``. This is why config parsers also provide :meth:`~ConfigParser.getboolean`. This method is case-insensitive and recognizes Boolean values from ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` and ``'1'``/``'0'`` [1]_. For example:
es_es: Dado que esta tarea es tan común, los analizadores de configuraciones proporcionan una serie de prácticos métodos de obtención para manejar enteros, flotantes y booleanos. Este último es el más interesante, porque pasar el valor a ``bool()`` no serviría de nada, ya que ``bool('False')`` sigue siendo ``True``. Esta es la razón por la que los analizadores de configuración también proporcionan :meth:`~ConfigParser.getboolean`. Este método no distingue entre mayúsculas y minúsculas y reconoce los valores booleanos de ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` y ``'1'``/``'0'`` [1]_ . Por ejemplo:
pt_pt: Como esta tarefa é tão comum, os analisadores de configuração fornecem uma série de métodos de obtenção úteis para lidar com inteiros, floats e booleanos. O último é o mais interessante porque simplesmente passar o valor para ``bool()`` não seria útil, uma vez que ``bool('False')`` ainda é ``True``. É por isso que os analisadores de configuração também fornecem :meth:`~ConfigParser.getboolean`. Este método não é sensível a maiúsculas e minúsculas e reconhece valores booleanos de ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` e ``'1'``/``'0'`` [1]_. Por exemplo:
ru: Поскольку эта задача настолько распространена, анализаторы конфигурации предоставляют ряд удобных методов получения для обработки целых чисел, чисел с плавающей запятой и логических значений. Последний вариант наиболее интересен, поскольку простая передача значения в ``bool()`` не принесет никакой пользы, поскольку ``bool('False')`` по-прежнему имеет ``True``. Вот почему анализаторы конфигурации также предоставляют :meth:`~ConfigParser.getboolean`. Этот метод нечувствителен к регистру и распознает логические значения из ``'да'``/``'нет'``, ``'вкл'``/``'выкл'``, ``'истина'`` /``'false'`` и ``'1'``/``'0'`` [1]_ . Например:

source: Apart from :meth:`~ConfigParser.getboolean`, config parsers also provide equivalent :meth:`~ConfigParser.getint` and :meth:`~ConfigParser.getfloat` methods. You can register your own converters and customize the provided ones. [1]_
es_es: Aparte de :meth:`~ConfigParser.getboolean`, los analizadores sintácticos config también proporcionan métodos equivalentes :meth:`~ConfigParser.getint` y :meth:`~ConfigParser.getfloat`. Puedes registrar tus propios conversores y personalizar los proporcionados. [1]_
pt_pt: Além de :meth:`~ConfigParser.getboolean`, os analisadores de configuração também fornecem métodos equivalentes :meth:`~ConfigParser.getint` e :meth:`~ConfigParser.getfloat`. Pode registar os seus próprios conversores e personalizar os fornecidos. [1]_
ru: Помимо :meth:`~ConfigParser.getboolean`, анализаторы конфигурации также предоставляют эквивалентные методы :meth:`~ConfigParser.getint` и :meth:`~ConfigParser.getfloat`. Вы можете зарегистрировать свои собственные конвертеры и настроить имеющиеся. [1]_

source: Fallback Values
es_es: Valores de reserva
pt_pt: Valores de Recurso
ru: Резервные значения

source: As with a dictionary, you can use a section's :meth:`~ConfigParser.get` method to provide fallback values:
es_es: Al igual que con un diccionario, puede utilizar el método :meth:`~ConfigParser.get` de una sección para proporcionar valores alternativos:
pt_pt: Como com um dicionário, pode usar o método :meth:`~ConfigParser.get` de uma secção para fornecer valores de recurso:
ru: Как и в случае со словарем, вы можете использовать метод раздела :meth:`~ConfigParser.get` для предоставления резервных значений:

source: Please note that default values have precedence over fallback values. For instance, in our example the ``'CompressionLevel'`` key was specified only in the ``'DEFAULT'`` section. If we try to get it from the section ``'topsecret.server.example'``, we will always get the default, even if we specify a fallback:
es_es: Tenga en cuenta que los valores por defecto tienen prioridad sobre los valores alternativos. Por ejemplo, en nuestro ejemplo la clave ``'CompressionLevel'`` se especificó sólo en la sección ``'DEFAULT'``. Si intentamos obtenerla de la sección ``'topsecret.server.example'``, siempre obtendremos el valor por defecto, aunque especifiquemos un valor alternativo:
pt_pt: Note que os valores predefinidos têm precedência sobre os valores de recurso. Por exemplo, no nosso exemplo, a chave ``'CompressionLevel'`` foi especificada apenas na secção ``'DEFAULT'``. Se tentarmos obtê-la da secção ``'topsecret.server.example'``, sempre obteremos o valor predefinido, mesmo que especifiquemos um valor de recurso:
ru: Обратите внимание, что значения по умолчанию имеют приоритет над резервными значениями. Например, в нашем примере ключ CompressionLevel был указан только в разделе DEFAULT. Если мы попытаемся получить его из раздела topsecret.server.example, мы всегда получим значение по умолчанию, даже если укажем запасной вариант:

source: One more thing to be aware of is that the parser-level :meth:`~ConfigParser.get` method provides a custom, more complex interface, maintained for backwards compatibility. When using this method, a fallback value can be provided via the ``fallback`` keyword-only argument:
es_es: Otra cosa que hay que tener en cuenta es que el método :meth:`~ConfigParser.get` a nivel de analizador proporciona una interfaz personalizada más compleja, que se mantiene por compatibilidad con versiones anteriores. Cuando se utiliza este método, se puede proporcionar un valor alternativo a través del argumento de sólo palabra clave ``fallback``:
pt_pt: Mais uma coisa a ter em conta é que o método :meth:`~ConfigParser.get` ao nível do analisador fornece uma interface personalizada e mais complexa, mantida para compatibilidade retroativa. Ao usar este método, um valor de recurso pode ser fornecido através do argumento ``fallback`` apenas por palavra-chave:
ru: Еще одна вещь, о которой следует знать, это то, что метод :meth:`~ConfigParser.get` уровня парсера предоставляет собственный, более сложный интерфейс, поддерживаемый для обратной совместимости. При использовании этого метода резервное значение может быть предоставлено через аргумент, содержащий только ключевое слово ``fallback``:

source: >>> config.get('forge.example', 'monster', ... fallback='No such things as monsters') 'No such things as monsters'
es_es: >>> config.get('forge.example', 'monstruo', ... fallback='No existen los monstruos') 'No existen los monstruos'
pt_pt: >>> config.get('forge.example', 'monster', ... fallback='Não existem coisas como monstros') 'Não existem coisas como monstros'

source: The same ``fallback`` argument can be used with the :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` and :meth:`~ConfigParser.getboolean` methods, for example:
es_es: El mismo argumento ``fallback`` puede utilizarse con los métodos :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` y :meth:`~ConfigParser.getboolean`, por ejemplo:
pt_pt: O mesmo argumento ``fallback`` pode ser usado com os métodos :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` e :meth:`~ConfigParser.getboolean`, por exemplo:
ru: Тот же аргумент ``fallback`` можно использовать с методами :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` и :meth:`~ConfigParser.getboolean`, например:

source: Supported INI File Structure
es_es: Estructura de archivos INI compatibles
pt_pt: Estrutura de Ficheiro INI Suportada
ru: Поддерживаемая файловая структура INI

source: A configuration file consists of sections, each led by a ``[section]`` header, followed by key/value entries separated by a specific string (``=`` or ``:`` by default [1]_). By default, section names are case sensitive but keys are not [1]_. Leading and trailing whitespace is removed from keys and values. Values can be omitted if the parser is configured to allow it [1]_, in which case the key/value delimiter may also be left out. Values can also span multiple lines, as long as they are indented deeper than the first line of the value. Depending on the parser's mode, blank lines may be treated as parts of multiline values or ignored.
es_es: Un archivo de configuración consta de secciones, cada una encabezada por una cabecera ``[section]``, seguida de entradas clave/valor separadas por una cadena específica (``=`` o ``:`` por defecto [1]_). Por defecto, los nombres de las secciones distinguen entre mayúsculas y minúsculas, pero las claves no [1]_. Los espacios en blanco iniciales y finales se eliminan de las claves y los valores. Los valores pueden omitirse si el analizador sintáctico está configurado para permitirlo [1]_, en cuyo caso también puede omitirse el delimitador clave/valor. Los valores también pueden abarcar varias líneas, siempre que tengan una sangría más profunda que la primera línea del valor. Dependiendo del modo del analizador sintáctico, las líneas en blanco pueden tratarse como partes de valores multilínea o ignorarse.
pt_pt: Um ficheiro de configuração consiste em secções, cada uma liderada por um cabeçalho ``[section]``, seguido de entradas chave/valor separadas por uma string específica (``=`` ou ``:`` por predefinição [1]_). Por predefinição, os nomes das secções são sensíveis a maiúsculas e minúsculas, mas as chaves não são [1]_. Os espaços em branco no início e no fim são removidos das chaves e valores. Os valores podem ser omitidos se o analisador estiver configurado para permitir [1]_, caso em que o delimitador chave/valor também pode ser omitido. Os valores também podem abranger várias linhas, desde que estejam indentados mais profundamente do que a primeira linha do valor. Dependendo do modo do analisador, linhas em branco podem ser tratadas como partes de valores multilinhas ou ignoradas.
ru: Файл конфигурации состоит из разделов, каждый из которых начинается с заголовка ``[section]``, за которым следуют записи ключ/значение, разделенные определенной строкой (``=`` или ``:`` по умолчанию. [1]_ ). По умолчанию имена разделов чувствительны к регистру, но ключи — нет. [1]_ . Ведущие и конечные пробелы удаляются из ключей и значений. Значения могут быть опущены, если синтаксический анализатор настроен на это. [1]_ , и в этом случае разделитель ключ/значение также может быть опущен. Значения также могут занимать несколько строк, если они имеют более глубокий отступ, чем первая строка значения. В зависимости от режима анализатора пустые строки могут рассматриваться как части многострочных значений или игнорироваться.

source: By default, a valid section name can be any string that does not contain '\\n'. To change this, see :attr:`ConfigParser.SECTCRE`.
es_es: Por defecto, un nombre de sección válido puede ser cualquier cadena que no contenga '\\n'. Para cambiar esto, consulte :attr:`ConfigParser.SECTCRE`.
pt_pt: Por predefinição, um nome de secção válido pode ser qualquer string que não contenha '\\n'. Para alterar isto, consulte :attr:`ConfigParser.SECTCRE`.
ru: По умолчанию допустимым именем раздела может быть любая строка, не содержащая '\\n'. Чтобы изменить это, см. :attr:`ConfigParser.SECTCRE`.

source: Configuration files may include comments, prefixed by specific characters (``#`` and ``;`` by default [1]_). Comments may appear on their own on an otherwise empty line, possibly indented. [1]_
es_es: Los archivos de configuración pueden incluir comentarios, precedidos por caracteres específicos (``#`` y ``;`` por defecto [1]_). Los comentarios pueden aparecer solos en una línea vacía, posiblemente con sangría. [1]_
pt_pt: Os ficheiros de configuração podem incluir comentários, prefixados por caracteres específicos (``#`` e ``;`` por predefinição [1]_). Os comentários podem aparecer sozinhos numa linha, possivelmente indentados. [1]_
ru: Файлы конфигурации могут включать комментарии, которым предшествуют определенные символы (``#`` и ``;`` по умолчанию. [1]_ ). Комментарии могут появляться отдельно в пустой строке, возможно, с отступом. [1]_

source: For example:
es_es: Por ejemplo:
pt_pt: Por exemplo:
ru: Например:
