Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/configparser.po
Languages: es_es, pt_pt, ru

source: *default_section*, default value: ``configparser.DEFAULTSECT`` (that is: ``"DEFAULT"``)
es_es: *default_section*, valor por defecto: ``configparser.DEFAULTSECT`` (es decir: ``"DEFAULT"``)
pt_pt: *default_section*, valor predefinido: ``configparser.DEFAULTSECT`` (ou seja: ``"DEFAULT"``)
ru: *default_section*, значение по умолчанию: ``configparser.DEFAULTSECT`` (то есть: ``"DEFAULT"``)

source: The convention of allowing a special section of default values for other sections or interpolation purposes is a powerful concept of this library, letting users create complex declarative configurations. This section is normally called ``"DEFAULT"`` but this can be customized to point to any other valid section name. Some typical values include: ``"general"`` or ``"common"``. The name provided is used for recognizing default sections when reading from any source and is used when writing configuration back to a file. Its current value can be retrieved using the ``parser_instance.default_section`` attribute and may be modified at runtime (i.e. to convert files from one format to another).
es_es: La convención de permitir una sección especial de valores por defecto para otras secciones o propósitos de interpolación es un concepto poderoso de esta biblioteca, permitiendo a los usuarios crear configuraciones declarativas complejas. Esta sección se llama normalmente ``"DEFAULT"`` pero puede personalizarse para que apunte a cualquier otro nombre de sección válido. Algunos valores típicos incluyen: ``"general"`` o ``"common"``. El nombre proporcionado se utiliza para reconocer las secciones por defecto cuando se lee desde cualquier fuente y se utiliza cuando se escribe la configuración de nuevo a un archivo. Su valor actual puede recuperarse utilizando el atributo ``parser_instance.default_section`` y puede modificarse en tiempo de ejecución (por ejemplo, para convertir archivos de un formato a otro).
pt_pt: A convenção de permitir uma secção especial de valores predefinidos para outras secções ou para fins de interpolação é um conceito poderoso desta biblioteca, permitindo que os utilizadores criem configurações declarativas complexas. Esta secção é normalmente chamada ``"DEFAULT"``, mas isto pode ser personalizado para apontar para qualquer outro nome de secção válido. Alguns valores típicos incluem: ``"general"`` ou ``"common"``. O nome fornecido é usado para reconhecer secções predefinidas ao ler de qualquer fonte e é usado ao escrever a configuração de volta para um ficheiro. O seu valor atual pode ser recuperado usando o atributo ``parser_instance.default_section`` e pode ser modificado em tempo de execução (por exemplo, para converter ficheiros de um formato para outro).
ru: Соглашение о разрешении специального раздела значений по умолчанию для других разделов или целей интерполяции является мощной концепцией этой библиотеки, позволяющей пользователям создавать сложные декларативные конфигурации. Этот раздел обычно называется ``DEFAULT'`, но его можно настроить так, чтобы он указывал на любое другое допустимое имя раздела. Некоторые типичные значения включают: ``"general"`` или ``"common"``. Предоставленное имя используется для распознавания разделов по умолчанию при чтении из любого источника и при записи конфигурации обратно в файл. Его текущее значение можно получить с помощью атрибута parser_instance.default_section и можно изменить во время выполнения (т. е. для преобразования файлов из одного формата в другой).

source: *interpolation*, default value: ``configparser.BasicInterpolation``
es_es: *interpolation*, valor por defecto: ``configparser.BasicInterpolation``
pt_pt: *interpolation*, valor predefinido: ``configparser.BasicInterpolation``
ru: *интерполяция*, значение по умолчанию: ``configparser.BasicInterpolation``

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_. :class:`RawConfigParser` has a default value of ``None``.
es_es: El comportamiento de interpolación puede personalizarse proporcionando un manejador personalizado a través del argumento *interpolation*. ``None`` puede utilizarse para desactivar completamente la interpolación, ``ExtendedInterpolation()`` proporciona una variante más avanzada inspirada en ``zc.buildout``. Más información sobre el tema en la sección `dedicada a la documentación <#interpolation-of-values>`_. :class:`RawConfigParser` tiene un valor por defecto de ``None``.
pt_pt: O comportamento de interpolação pode ser personalizado fornecendo um manipulador personalizado através do argumento *interpolation*. ``None`` pode ser usado para desligar completamente a interpolação, ``ExtendedInterpolation()`` fornece uma variante mais avançada inspirada em ``zc.buildout``. Mais sobre o assunto na `secção de documentação dedicada <#interpolation-of-values>`_. :class:`RawConfigParser` tem um valor predefinido de ``None``.
ru: Поведение интерполяции можно настроить, предоставив собственный обработчик через аргумент *interpolation*. ``None`` можно использовать для полного отключения интерполяции, ``ExtendedInterpolation()`` предоставляет более продвинутый вариант, вдохновленный ``zc.buildout``. Подробнее об этом читайте в `специальном разделе документации <#interpolation-of-values>`_. :class:`RawConfigParser` имеет значение по умолчанию ``None``.

source: *converters*, default value: not set
es_es: *converters*, valor por defecto: no establecido
pt_pt: *converters*, valor predefinido: não definido
ru: *converters*, значение по умолчанию: не установлено

source: Config parsers provide option value getters that perform type conversion. By default :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat`, and :meth:`~ConfigParser.getboolean` are implemented. Should other getters be desirable, users may define them in a subclass or pass a dictionary where each key is a name of the converter and each value is a callable implementing said conversion. For instance, passing ``{'decimal': decimal.Decimal}`` would add :meth:`!getdecimal` on both the parser object and all section proxies. In other words, it will be possible to write both ``parser_instance.getdecimal('section', 'key', fallback=0)`` and ``parser_instance['section'].getdecimal('key', 0)``.
es_es: Los analizadores sintácticos de configuración proporcionan captadores de valores de opción que realizan la conversión de tipos. Por defecto se implementan :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat`, y :meth:`~ConfigParser.getboolean`. Si se desean otros getters, los usuarios pueden definirlos en una subclase o pasar un diccionario donde cada clave es un nombre del conversor y cada valor es un callable que implementa dicha conversión. Por ejemplo, pasar ``{'decimal': decimal.Decimal}`` añadiría :meth:`!getdecimal` tanto en el objeto analizador como en todos los proxies de sección. En otras palabras, será posible escribir tanto ``parser_instance.getdecimal('section', 'key', fallback=0)`` como ``parser_instance['section'].getdecimal('key', 0)``.
pt_pt: Os analisadores de configuração fornecem métodos de obtenção de valores de opção que realizam conversão de tipo. Por predefinição, :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` e :meth:`~ConfigParser.getboolean` são implementados. Se outros métodos de obtenção forem desejáveis, os utilizadores podem defini-los numa subclasse ou passar um dicionário onde cada chave é um nome do conversor e cada valor é um objeto invocável que implementa a conversão. Por exemplo, passar ``{'decimal': decimal.Decimal}`` adicionaria :meth:`!getdecimal` tanto no objeto analisador como em todos os proxies de secção. Em outras palavras, será possível escrever tanto ``parser_instance.getdecimal('section', 'key', fallback=0)`` como ``parser_instance['section'].getdecimal('key', 0)``.
ru: Анализаторы конфигурации предоставляют методы получения значений опций, которые выполняют преобразование типов. По умолчанию реализованы :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` и :meth:`~ConfigParser.getboolean`. Если желательны другие методы получения, пользователи могут определить их в подклассе или передать словарь, где каждый ключ является именем преобразователя, а каждое значение является вызываемым объектом, реализующим указанное преобразование. Например, передача ``{'decimal': decimal.Decimal}`` добавит :meth:`!getdecimal` как к объекту синтаксического анализатора, так и ко всем прокси разделов. Другими словами, можно будет написать как ``parser_instance.getdecimal('section', 'key', Fallback=0)``, так и ``parser_instance['section'].getdecimal('key', 0)` `.

source: If the converter needs to access the state of the parser, it can be implemented as a method on a config parser subclass. If the name of this method starts with ``get``, it will be available on all section proxies, in the dict-compatible form (see the ``getdecimal()`` example above).
es_es: Si el conversor necesita acceder al estado del analizador sintáctico, puede implementarse como un método en una subclase del analizador sintáctico config. Si el nombre de este método empieza por ``get``, estará disponible en todos los proxies de sección, en la forma compatible con dict (véase el ejemplo anterior de ``getdecimal()`` ).
pt_pt: Se o conversor precisar de aceder ao estado do analisador, pode ser implementado como um método numa subclasse do analisador de configuração. Se o nome deste método começar com ``get``, estará disponível em todos os proxies de secção, na forma compatível com dicionário (consulte o exemplo ``getdecimal()`` acima).
ru: Если преобразователю необходимо получить доступ к состоянию анализатора, его можно реализовать как метод в подклассе анализатора конфигурации. Если имя этого метода начинается с ``get``, он будет доступен на всех прокси-серверах раздела в совместимой с dict формой (см. пример ``getdecimal()`` выше).

source: More advanced customization may be achieved by overriding default values of these parser attributes. The defaults are defined on the classes, so they may be overridden by subclasses or by attribute assignment.
es_es: Se puede lograr una personalización más avanzada anulando los valores por defecto de estos atributos del analizador sintáctico. Los valores por defecto se definen en las clases, por lo que pueden ser anulados por subclases o por asignación de atributos.
pt_pt: Uma personalização mais avançada pode ser alcançada substituindo os valores predefinidos destes atributos do analisador. Os valores predefinidos são definidos nas classes, por isso podem ser substituídos por subclasses ou por atribuição de atributos.
ru: Более продвинутая настройка может быть достигнута путем переопределения значений по умолчанию этих атрибутов синтаксического анализатора. Значения по умолчанию определены в классах, поэтому они могут быть переопределены подклассами или присвоением атрибутов.

source: By default when using :meth:`~ConfigParser.getboolean`, config parsers consider the following values ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` and the following values ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. You can override this by specifying a custom dictionary of strings and their Boolean outcomes. For example:
es_es: Por defecto, cuando se utiliza :meth:`~ConfigParser.getboolean`, los analizadores sintácticos de configuración consideran los siguientes valores ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` y los siguientes valores ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. Puede anular esto especificando un diccionario personalizado de cadenas y sus resultados booleanos. Por ejemplo
ru: По умолчанию при использовании :meth:`~ConfigParser.getboolean` анализаторы конфигурации учитывают следующие значения ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` и следующие значения ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. Вы можете переопределить это, указав собственный словарь строк и их логических результатов. Например:

source: Other typical Boolean pairs include ``accept``/``reject`` or ``enabled``/``disabled``.
es_es: Otros pares booleanos típicos son ``accept``/``reject`` o ``enabled``/``disabled``.
ru: Другие типичные логические пары включают ``accept``/``reject`` или ``enabled``/``disabled``.

source: This method transforms option names on every read, get, or set operation. The default converts the name to lowercase. This also means that when a configuration file gets written, all keys will be lowercase. Override this method if that's unsuitable. For example:
es_es: Este método transforma los nombres de las opciones en cada operación de lectura, obtención o establecimiento. Por defecto convierte el nombre a minúsculas. Esto también significa que cuando se escribe un fichero de configuración, todas las claves estarán en minúsculas. Anula este método si no es adecuado. Por ejemplo:
ru: Этот метод преобразует имена опций при каждой операции чтения, получения или установки. По умолчанию имя преобразуется в нижний регистр. Это также означает, что при записи файла конфигурации все ключи будут в нижнем регистре. Переопределите этот метод, если он не подходит. Например:

source: The optionxform function transforms option names to a canonical form. This should be an idempotent function: if the name is already in canonical form, it should be returned unchanged.
es_es: La función optionxform transforma los nombres de las opciones a una forma canónica. Debería ser una función idempotente: si el nombre ya está en forma canónica, debería devolverse sin cambios.
pt_pt: A função optionxform transforma os nomes das opções para uma forma canónica. Isto deve ser uma função idempotente: se o nome já estiver na forma canónica, deve ser retornado inalterado.
ru: Функция optionxform преобразует имена опций в каноническую форму. Это должна быть идемпотентная функция: если имя уже находится в канонической форме, оно должно быть возвращено без изменений.

source: A compiled regular expression used to parse section headers. The default matches ``[section]`` to the name ``"section"``. Whitespace is considered part of the section name, thus ``[ larch ]`` will be read as a section of name ``" larch "``. Override this attribute if that's unsuitable. For example:
es_es: Expresión regular compilada que se utiliza para analizar los encabezados de sección. Por defecto, ``[section]`` coincide con el nombre ``"section"``. Los espacios en blanco se consideran parte del nombre de la sección, por lo que ``[ larch ]`` se leerá como una sección de nombre ``" larch "``. Anule este atributo si no es adecuado. Por ejemplo:
ru: Скомпилированное регулярное выражение, используемое для анализа заголовков разделов. По умолчанию имя ``[section]`` соответствует имени ``"section"``. Пробелы считаются частью имени раздела, поэтому ``[ larch ]`` будет читаться как раздел с именем ``" larch "``. Переопределите этот атрибут, если он не подходит. Например:

source: >>> import re >>> config = """ ... [Section 1] ... option = value ... ... [ Section 2 ] ... another = val ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> typical.sections() ['Section 1', ' Section 2 '] >>> custom = configparser.ConfigParser() >>> custom.SECTCRE = re.compile(r"\[ *(?P<header>[^]]+?) *\]") >>> custom.read_string(config) >>> custom.sections() ['Section 1', 'Section 2']
es_es: >>> import re >>> config = """ ... [Sección 1] ... option = valor ... ... [Sección 2] ... otro = val ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> typical.sections() ['Sección 1', ' Sección 2 '] >>> custom = configparser.ConfigParser() >>> custom.SECTCRE = re.compile(r"\[ *(?P<header>[^]]+?) *\]") >>> custom.read_string(config) >>> custom.sections() ['Sección 1', 'Sección 2']

source: While ConfigParser objects also use an ``OPTCRE`` attribute for recognizing option lines, it's not recommended to override it because that would interfere with constructor options *allow_no_value* and *delimiters*.
es_es: Aunque los objetos ConfigParser también utilizan un atributo ``OPTCRE`` para reconocer las líneas de opción, no se recomienda anularlo porque interferiría con las opciones del constructor *allow_no_value* y *delimiters*.
ru: Хотя объекты ConfigParser также используют атрибут OPTCRE для распознавания строк параметров, не рекомендуется переопределять его, поскольку это будет мешать параметрам конструктора *allow_no_value* и *delimiters*.

source: Legacy API Examples
es_es: Ejemplos de API heredadas
pt_pt: Exemplos de API Legada
ru: Примеры устаревших API

source: Mainly because of backwards compatibility concerns, :mod:`configparser` provides also a legacy API with explicit ``get``/``set`` methods. While there are valid use cases for the methods outlined below, mapping protocol access is preferred for new projects. The legacy API is at times more advanced, low-level and downright counterintuitive.
es_es: Principalmente por cuestiones de compatibilidad con versiones anteriores, :mod:`configparser` proporciona también una API heredada con métodos explícitos ``get``/``set``. Aunque existen casos de uso válidos para los métodos descritos a continuación, se prefiere el acceso al protocolo de mapeo para los nuevos proyectos. La API heredada es a veces más avanzada, de bajo nivel y francamente contraintuitiva.
ru: В основном из-за проблем обратной совместимости, :mod:`configparser` также предоставляет устаревший API с явными методами ``get``/``set``. Хотя существуют допустимые варианты использования методов, описанных ниже, доступ к протоколу сопоставления предпочтителен для новых проектов. Устаревший API порой более продвинутый, низкоуровневый и совершенно нелогичный.

source: An example of writing to a configuration file::
es_es: Un ejemplo de escritura en un archivo de configuración::
pt_pt: Um exemplo de escrita num ficheiro de configuração::
ru: Пример записи в файл конфигурации::

source: import configparser config = configparser.RawConfigParser() # Please note that using RawConfigParser's set functions, you can assign # non-string values to keys internally, but will receive an error when # attempting to write to a file or when you get it in non-raw mode. Setting # values using the mapping protocol or ConfigParser's set() does not allow # such assignments to take place. config.add_section('Section1') config.set('Section1', 'an_int', '15') config.set('Section1', 'a_bool', 'true') config.set('Section1', 'a_float', '3.1415') config.set('Section1', 'baz', 'fun') config.set('Section1', 'bar', 'Python') config.set('Section1', 'foo', '%(bar)s is %(baz)s!') # Writing our configuration file to 'example.cfg' with open('example.cfg', 'w') as configfile: config.write(configfile)
es_es: import configparser config = configparser.RawConfigParser() #Tenga en cuenta que al usar las funciones set de RawConfigParser, puede asignar # valores que no son cadenas a las claves internamente, pero recibirán un error cuando # intentando escribir en un archivo o cuando lo obtiene en modo no raw . Configuración # los valores que usan el protocolo de asignación o set () de ConfigParser no permiten # tales asignaciones se llevarán a cabo.. config.add_section('Section1') config.set('Section1', 'an_int', '15') config.set('Section1', 'a_bool', 'true') config.set('Section1', 'a_float', '3.1415') config.set('Section1', 'baz', 'fun') config.set('Section1', 'bar', 'Python') config.set('Section1', 'foo', '%(bar)s is %(baz)s!') # Escribiendo nuestro archivo de configuración en ' ejemplo.cfg' con open ('ejemplo.cfg', 'w') como archivo de configuración: config.write(configfile)

source: An example of reading the configuration file again::
es_es: Un ejemplo de volver a leer el archivo de configuración::
pt_pt: Um exemplo de leitura do ficheiro de configuração novamente::
ru: Пример повторного чтения файла конфигурации:

source: import configparser config = configparser.RawConfigParser() config.read('example.cfg') # getfloat() raises an exception if the value is not a float # getint() and getboolean() also do this for their respective types a_float = config.getfloat('Section1', 'a_float') an_int = config.getint('Section1', 'an_int') print(a_float + an_int) # Notice that the next output does not interpolate '%(bar)s' or '%(baz)s'. # This is because we are using a RawConfigParser(). if config.getboolean('Section1', 'a_bool'): print(config.get('Section1', 'foo'))
es_es: import configparser config = configparser.RawConfigParser() config.read('example.cfg') # getfloat() genera una excepción si el valor no es flotante # getint() y getboolean() también hacen esto para sus respectivos tipos a_float = config.getfloat('Section1', 'a_float') an_int = config.getint('Section1', 'an_int')) print(a_float + an_int) # Observe que la siguiente salida no interpola '%(bar)s' o '%(baz)s'. # Esto se debe a que estamos usando un RawConfigParser(). si config.getboolean ('Section1', 'a_bool'): print(config.get('Section1', 'foo'))
pt_pt: import configparser config = configparser.RawConfigParser() config.read('example.cfg') # getfloat() levanta uma exceção se o valor não for um float # getint() e getboolean() também o fazem para os seus respetivos tipos a_float = config.getfloat('Section1', 'a_float') an_int = config.getint('Section1', 'an_int') print(a_float + an_int) # Note que a próxima saída não interpola '%(bar)s' ou '%(baz)s'. # Isto é porque estamos a usar um RawConfigParser(). if config.getboolean('Section1', 'a_bool'): print(config.get('Section1', 'foo'))

source: To get interpolation, use :class:`ConfigParser`::
es_es: Para obtener la interpolación, utilice :class:`ConfigParser`::
pt_pt: Para obter interpolação, use :class:`ConfigParser`::
ru: Чтобы получить интерполяцию, используйте :class:`ConfigParser`::
