Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/configparser.po
Languages: es_es, pt_pt, ru

source: You don't need to subclass the parser to use this method, you can also set it on an instance, to a function that takes a string argument and returns a string. Setting it to ``str``, for example, would make option names case sensitive::
es_es: No es necesario subclasificar el analizador para utilizar este método, también se puede establecer en una instancia, a una función que toma un argumento de cadena y devuelve una cadena. Establecerlo a ``str``, por ejemplo, haría que los nombres de las opciones distingan entre mayúsculas y minúsculas::
pt_pt: Não precisa de criar uma subclasse do analisador para usar este método, também pode defini-lo numa instância, para uma função que recebe um argumento string e retorna uma string. Defini-lo para ``str``, por exemplo, tornaria os nomes das opções sensíveis a maiúsculas e minúsculas::
ru: Вам не нужно создавать подкласс синтаксического анализатора, чтобы использовать этот метод, вы также можете установить его в экземпляре в функцию, которая принимает строковый аргумент и возвращает строку. Например, установка значения ``str`` сделает имена опций чувствительными к регистру::

source: Note that when reading configuration files, whitespace around the option names is stripped before :meth:`optionxform` is called.
es_es: Tenga en cuenta que cuando se leen archivos de configuración, los espacios en blanco alrededor de los nombres de las opciones se eliminan antes de llamar a :meth:`optionxform`.
pt_pt: Note que, ao ler ficheiros de configuração, os espaços em branco em redor dos nomes das opções são removidos antes de :meth:`optionxform` ser chamado.
ru: Обратите внимание, что при чтении файлов конфигурации пробелы вокруг имен опций удаляются перед вызовом :meth:`optionxform`.

source: The maximum depth for recursive interpolation for :meth:`~configparser.ConfigParser.get` when the *raw* parameter is false. This is relevant only when the default *interpolation* is used.
es_es: La profundidad máxima para la interpolación recursiva para :meth:`~configparser.ConfigParser.get` cuando el parámetro *raw* es false. Esto es relevante sólo cuando se utiliza la *interpolation* por defecto.
pt_pt: A profundidade máxima para interpolação recursiva para :meth:`~configparser.ConfigParser.get` quando o parâmetro *raw* é falso. Isto é relevante apenas quando a *interpolação* predefinida é usada.
ru: Максимальная глубина рекурсивной интерполяции для :meth:`~configparser.ConfigParser.get`, когда параметр *raw* имеет значение false. Это актуально только при использовании *интерполяции* по умолчанию.

source: RawConfigParser Objects
es_es: Objetos RawConfigParser
pt_pt: Objetos RawConfigParser
ru: Объекты RawConfigParser

source: Legacy variant of the :class:`ConfigParser`. It has interpolation disabled by default and allows for non-string section names, option names, and values via its unsafe ``add_section`` and ``set`` methods, as well as the legacy ``defaults=`` keyword argument handling.
es_es: Variante heredada de :class:`ConfigParser`. Tiene la interpolación desactivada por defecto y permite nombres de sección, nombres de opción y valores que no son cadenas a través de sus métodos inseguros ``add_section`` y ``set``, así como el manejo de argumentos de palabras clave heredado ``defaults=``.
ru: Устаревший вариант :class:`ConfigParser`. По умолчанию в нем отключена интерполяция, и он позволяет использовать нестроковые имена разделов, имена опций и значения с помощью небезопасных методов ``add_section`` и ``set``, а также устаревшую обработку аргументов ключевого слова ``defaults=``. .

source: Consider using :class:`ConfigParser` instead which checks types of the values to be stored internally. If you don't want interpolation, you can use ``ConfigParser(interpolation=None)``.
es_es: Considere el uso de :class:`ConfigParser` en su lugar, que comprueba los tipos de los valores que se almacenarán internamente. Si no desea interpolación, puede utilizar ``ConfigParser(interpolation=None)``.
pt_pt: Considere usar :class:`ConfigParser` em vez disso, que verifica os tipos dos valores a serem armazenados internamente. Se não quiser interpolação, pode usar ``ConfigParser(interpolation=None)``.
ru: Вместо этого рассмотрите возможность использования :class:`ConfigParser`, который проверяет типы значений, которые будут храниться внутри. Если вам не нужна интерполяция, вы можете использовать ``ConfigParser(interpolation=None)``.

source: Type of *section* is not checked which lets users create non-string named sections. This behaviour is unsupported and may cause internal errors.
es_es: El tipo de *section* no se comprueba, lo que permite a los usuarios crear secciones sin nombre de cadena. Este comportamiento no está soportado y puede causar errores internos.
pt_pt: O tipo de *section* não é verificado, o que permite aos utilizadores criar secções com nomes não-string. Este comportamento não é suportado e pode causar erros internos.
ru: Тип *раздела* не отмечен, что позволяет пользователям создавать разделы с нестроковыми именами. Такое поведение не поддерживается и может вызвать внутренние ошибки.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. While it is possible to use :class:`RawConfigParser` (or :class:`ConfigParser` with *raw* parameters set to true) for *internal* storage of non-string values, full functionality (including interpolation and output to files) can only be achieved using string values.
es_es: Si la sección dada existe, establece la opción dada al valor especificado; en caso contrario, lanza :exc:`NoSectionError`. Aunque es posible utilizar :class:`RawConfigParser` (o :class:`ConfigParser` con los parámetros *raw* establecidos en true) para el almacenamiento *interno* de valores que no sean cadenas, la funcionalidad completa (incluida la interpolación y la salida a archivos) sólo puede lograrse utilizando valores de cadenas.
pt_pt: Se a secção dada existir, define a opção dada para o valor especificado; caso contrário, levanta :exc:`NoSectionError`. Embora seja possível usar :class:`RawConfigParser` (ou :class:`ConfigParser` com parâmetros *raw* definidos como verdadeiros) para armazenamento *interno* de valores não-string, a funcionalidade completa (incluindo interpolação e saída para ficheiros) só pode ser alcançada usando valores string.
ru: Если данный раздел существует, установите для данной опции указанное значение; в противном случае поднимите :exc:`NoSectionError`. Хотя можно использовать :class:`RawConfigParser` (или :class:`ConfigParser` с параметрами *raw*, установленными в true) для *внутреннего* хранения нестроковых значений, полная функциональность (включая интерполяцию и вывод в файлы) может быть достигнуто только с использованием строковых значений.

source: This method lets users assign non-string values to keys internally. This behaviour is unsupported and will cause errors when attempting to write to a file or get it in non-raw mode. **Use the mapping protocol API** which does not allow such assignments to take place.
es_es: Este método permite a los usuarios asignar valores no string a las claves internamente. Este comportamiento no está soportado y provocará errores al intentar escribir en un fichero u obtenerlo en modo no raw. **Utiliza la API del protocolo de mapeo**, que no permite este tipo de asignaciones.
pt_pt: Este método permite que os utilizadores atribuam valores não-string a chaves internamente. Este comportamento não é suportado e causará erros ao tentar escrever num ficheiro ou obtê-lo em modo não-raw. **Use a API do protocolo de mapeamento**, que não permite que tais atribuições ocorram.
ru: Этот метод позволяет пользователям внутренне присваивать ключам нестроковые значения. Такое поведение не поддерживается и приведет к ошибкам при попытке записи в файл или получения его в режиме, отличном от необработанных. **Используйте API протокола сопоставления**, который не позволяет выполнять такие назначения.

source: Exceptions
es_es: Excepciones
pt_pt: Exceções
ru: Исключения

source: Base class for all other :mod:`configparser` exceptions.
es_es: Clase base para todas las demás excepciones de :mod:`configparser`.
pt_pt: Classe base para todas as outras exceções :mod:`configparser`.
ru: Базовый класс для всех остальных исключений :mod:`configparser`.

source: Exception raised when a specified section is not found.
es_es: Excepción planteada cuando no se encuentra una sección especificada.
pt_pt: Exceção levantada quando uma secção especificada não é encontrada.
ru: Исключение возникает, когда указанный раздел не найден.

source: Exception raised if :meth:`~ConfigParser.add_section` is called with the name of a section that is already present or in strict parsers when a section if found more than once in a single input file, string or dictionary.
es_es: Se produce una excepción si se llama a :meth:`~ConfigParser.add_section` con el nombre de una sección que ya está presente o en analizadores sintácticos estrictos cuando una sección se encuentra más de una vez en un único archivo de entrada, cadena o diccionario.
pt_pt: Exceção levantada se :meth:`~ConfigParser.add_section` for chamado com o nome de uma secção que já está presente ou em analisadores estritos quando uma secção é encontrada mais do que uma vez num único ficheiro de entrada, string ou dicionário.
ru: Исключение возникает, если :meth:`~ConfigParser.add_section` вызывается с именем уже существующего раздела или в строгих синтаксических анализаторах, когда раздел найден более одного раза в одном входном файле, строке или словаре.

source: Added the optional *source* and *lineno* attributes and parameters to :meth:`!__init__`.
es_es: Se han añadido los atributos y parámetros opcionales *source* y *lineno* a :meth:`!__init__`.
pt_pt: Adicionados os atributos e parâmetros opcionais *source* e *lineno* a :meth:`!__init__`.
ru: В :meth:`!__init__` добавлены необязательные атрибуты и параметры *source* и *lineno*.

source: Exception raised by strict parsers if a single option appears twice during reading from a single file, string or dictionary. This catches misspellings and case sensitivity-related errors, e.g. a dictionary may have two keys representing the same case-insensitive configuration key.
es_es: Excepción lanzada por los analizadores sintácticos estrictos si una única opción aparece dos veces durante la lectura de un único archivo, cadena o diccionario. Esto detecta errores ortográficos y errores relacionados con la distinción entre mayúsculas y minúsculas, por ejemplo, un diccionario puede tener dos claves que representan la misma clave de configuración sin distinción entre mayúsculas y minúsculas.
pt_pt: Exceção levantada por analisadores estritos se uma única opção aparecer duas vezes durante a leitura de um único ficheiro, string ou dicionário. Isto deteta erros ortográficos e erros relacionados com a sensibilidade a maiúsculas e minúsculas, por exemplo, um dicionário pode ter duas chaves que representam a mesma chave de configuração não sensível a maiúsculas e minúsculas.
ru: Исключение возникает строгими анализаторами, если одна опция появляется дважды во время чтения из одного файла, строки или словаря. Это позволяет выявить орфографические ошибки и ошибки, связанные с чувствительностью к регистру, например, словарь может иметь два ключа, представляющих один и тот же ключ конфигурации без учета регистра.

source: Exception raised when a specified option is not found in the specified section.
es_es: Excepción planteada cuando una opción especificada no se encuentra en la sección especificada.
pt_pt: Exceção levantada quando uma opção especificada não é encontrada na secção especificada.
ru: Исключение возникает, когда указанный параметр не найден в указанном разделе.

source: Base class for exceptions raised when problems occur performing string interpolation.
es_es: Clase base para las excepciones que surgen cuando se producen problemas al realizar la interpolación de cadenas.
pt_pt: Classe base para exceções levantadas quando ocorrem problemas ao realizar interpolação de strings.
ru: Базовый класс для исключений, возникающих при возникновении проблем при интерполяции строк.

source: Exception raised when string interpolation cannot be completed because the number of iterations exceeds :const:`MAX_INTERPOLATION_DEPTH`. Subclass of :exc:`InterpolationError`.
es_es: Excepción planteada cuando la interpolación de cadenas no puede completarse porque el número de iteraciones excede :const:`MAX_INTERPOLATION_DEPTH`. Subclase de :exc:`InterpolationError`.
pt_pt: Exceção levantada quando a interpolação de strings não pode ser concluída porque o número de iterações excede :const:`MAX_INTERPOLATION_DEPTH`. Subclasse de :exc:`InterpolationError`.
ru: Исключение возникает, когда интерполяцию строк невозможно завершить, поскольку количество итераций превышает :const:`MAX_INTERPOLATION_DEPTH`. Подкласс :exc:`InterpolationError`.

source: Exception raised when an option referenced from a value does not exist. Subclass of :exc:`InterpolationError`.
es_es: Excepción lanzada cuando una opción referenciada desde un valor no existe. Subclase de :exc:`InterpolationError`.
pt_pt: Exceção levantada quando uma opção referenciada a partir de um valor não existe. Subclasse de :exc:`InterpolationError`.
ru: Исключение возникает, когда параметр, на который ссылается значение, не существует. Подкласс :exc:`InterpolationError`.

source: Exception raised when the source text into which substitutions are made does not conform to the required syntax. Subclass of :exc:`InterpolationError`.
es_es: Excepción planteada cuando el texto fuente en el que se realizan las sustituciones no se ajusta a la sintaxis requerida. Subclase de :exc:`InterpolationError`.
pt_pt: Exceção levantada quando o texto de origem no qual as substituições são feitas não está em conformidade com a sintaxe necessária. Subclasse de :exc:`InterpolationError`.
ru: Исключение возникает, когда исходный текст, в который производятся замены, не соответствует требуемому синтаксису. Подкласс :exc:`InterpolationError`.

source: Exception raised when attempting to parse a file which has no section headers.
es_es: Excepción planteada al intentar analizar un archivo que no tiene cabeceras de sección.
pt_pt: Exceção levantada ao tentar analisar um ficheiro que não tem cabeçalhos de secção.
ru: Исключение возникает при попытке анализа файла, не имеющего заголовков разделов.

source: Exception raised when errors occur attempting to parse a file.
es_es: Excepción planteada cuando se producen errores al intentar analizar un archivo.
pt_pt: Exceção levantada quando ocorrem erros ao tentar analisar um ficheiro.
ru: ошибок при попытке анализа файл

source: The ``filename`` attribute and :meth:`!__init__` constructor argument were removed. They have been available using the name ``source`` since 3.2.
es_es: Se han eliminado el atributo ``filename`` y el argumento del constructor :meth:`!__init__`. Han estado disponibles utilizando el nombre ``source`` desde la versión 3.2.
pt_pt: O atributo ``filename`` e o argumento do construtor :meth:`!__init__` foram removidos. Estão disponíveis usando o nome ``source`` desde a versão 3.2.

source: Footnotes
es_es: Notas a pie de página
pt_pt: Notas de rodapé
ru: Сноски

source: Config parsers allow for heavy customization. If you are interested in changing the behaviour outlined by the footnote reference, consult the `Customizing Parser Behaviour`_ section.
es_es: Los analizadores sintácticos Config permiten una gran personalización. Si está interesado en cambiar el comportamiento descrito en la nota de referencia, consulte la sección `Customizing Parser Behaviour`_.
ru: Анализаторы конфигурации допускают глубокую настройку. Если вы заинтересованы в изменении поведения, описанного в сноске, обратитесь к разделу «Настройка поведения анализатора».

source: file
es_es: archivo
pt_pt: ficheiro
ru: файл

source: Windows ini file
es_es: Archivo ini de Windows
ru: ini-файлы Windows

source: >>> import configparser >>> config = configparser.ConfigParser() >>> config['DEFAULT'] = {'ServerAliveInterval': '45', ... 'Compression': 'yes', ... 'CompressionLevel': '9'} >>> config['forge.example'] = {} >>> config['forge.example']['User'] = 'hg' >>> config['topsecret.server.example'] = {} >>> topsecret = config['topsecret.server.example'] >>> topsecret['Port'] = '50022' # mutates the parser >>> topsecret['ForwardX11'] = 'no' # same here >>> config['DEFAULT']['ForwardX11'] = 'yes' >>> with open('example.ini', 'w') as configfile: ... config.write(configfile) ...
pt_pt: >>> import configparser >>> config = configparser.ConfigParser() >>> config['DEFAULT'] = {'ServerAliveInterval': '45', ... 'Compression': 'yes', ... 'CompressionLevel': '9'} >>> config['forge.example'] = {} >>> config['forge.example']['User'] = 'hg' >>> config['topsecret.server.example'] = {} >>> topsecret = config['topsecret.server.example'] >>> topsecret['Port'] = '50022' # modifica o analisador >>> topsecret['ForwardX11'] = 'no' # o mesmo aqui >>> config['DEFAULT']['ForwardX11'] = 'yes' >>> with open('example.ini', 'w') as configfile: ... config.write(configfile) ...

source: [Section] key = multiline value with a gotcha this = is still a part of the multiline value of 'key'
pt_pt: [Section] key = multiline valor com uma armadilha this = ainda faz parte do valor multilinhas de 'key'

source: configuration
pt_pt: configuração
ru: конфигурация

source: ini file
pt_pt: ficheiro ini
ru: ini-файл

source: % (percent)
pt_pt: % (percentagem)
ru: % (процент)

source: $ (dollar)
pt_pt: $ (dólar)
ru: $ (доллар)

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised.
ru: Добавьте в экземпляр раздел с именем *section*. Если раздел с данным именем уже существует, возникает :exc:`DuplateSectionError`. Если передается имя раздела *default*, возникает :exc:`ValueError`.

source: interpolation in configuration files
ru: интерполяция в файлах конфигурации
