Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/configparser.po
Languages: es_es, pt_pt, ru

source: [Simple Values] key=value spaces in keys=allowed spaces in values=allowed as well spaces around the delimiter = obviously you can also use : to delimit keys from values [All Values Are Strings] values like this: 1000000 or this: 3.14159265359 are they treated as numbers? : no integers, floats and booleans are held as: strings can use the API to get converted values directly: true [Multiline Values] chorus: I'm a lumberjack, and I'm okay I sleep all night and I work all day [No Values] key_without_value empty string value here = [You can use comments] # like this ; or this # By default only in an empty line. # Inline comments can be harmful because they prevent users # from using the delimiting characters as parts of values. # That being said, this can be customized. [Sections Can Be Indented] can_values_be_as_well = True does_that_mean_anything_special = False purpose = formatting for readability multiline_values = are handled just fine as long as they are indented deeper than the first line of a value # Did I mention we can indent comments, too?
es_es: [Simple Values] key=value spaces in keys=allowed spaces in values=allowed as well spaces around the delimiter = obviously you can also use : to delimit keys from values [All Values Are Strings] values like this: 1000000 or this: 3.14159265359 are they treated as numbers? : no integers, floats and booleans are held as: strings can use the API to get converted values directly: true [Multiline Values] chorus: I'm a lumberjack, and I'm okay I sleep all night and I work all day [No Values] key_without_value empty string value here = [You can use comments] # así ; o así # Por defecto solo en una línea vacía. # Los comentarios en línea pueden ser perjudiciales porque impiden a los usuarios # de usar los caracteres delimitadores como partes de valores. # Dicho esto, esto se puede personalizar. [Sections Can Be Indented] can_values_be_as_well = True does_that_mean_anything_special = False purpose = formatting for readability multiline_values = are handled just fine as long as they are indented deeper than the first line of a value # ¿Mencioné que también podemos sangrar comentarios?
pt_pt: [Valores Simples] chave=valor espaços em chaves=permitidos espaços em valores=também permitidos espaços em redor do delimitador = óbvio também pode usar : para delimitar chaves de valores [Todos os Valores São Strings] valores como este: 1000000 ou este: 3.14159265359 são tratados como números? : não inteiros, floats e booleanos são mantidos como: strings pode usar a API para obter valores convertidos diretamente: true [Valores Multilinha] refrão: Sou um lenhador, e estou bem Durmo toda a noite e trabalho todo o dia [Sem Valores] chave_sem_valor valor de string vazio aqui = [Pode Usar Comentários] # como este ; ou este # Por predefinição apenas numa linha vazia. # Comentários em linha podem ser prejudiciais porque impedem os utilizadores # de usar os caracteres delimitadores como partes de valores. # Dito isto, isto pode ser personalizado. [As Secções Podem Ser Indentadas] os_valores_também_podem_ser = True isso_significa_algo_especial = False propósito = formatação para legibilidade valores_multilinha = são tratados muito bem desde que estejam indentados mais profundamente do que a primeira linha de um valor # Já mencionei que também podemos indentar comentários?

source: Interpolation of values
es_es: Interpolación de valores
pt_pt: Interpolation de Valores
ru: Интерполяция значений

source: On top of the core functionality, :class:`ConfigParser` supports interpolation. This means values can be preprocessed before returning them from ``get()`` calls.
es_es: Además de la funcionalidad básica, :class:`ConfigParser` admite interpolación. Esto significa que los valores pueden preprocesarse antes de ser devueltos por las llamadas a ``get()``.
pt_pt: Além da funcionalidade principal, :class:`ConfigParser` suporta interpolação. Isto significa que os valores podem ser pré-processados antes de serem retornados de chamadas ``get()``.
ru: Помимо основной функциональности, :class:`ConfigParser` поддерживает интерполяцию. Это означает, что значения могут быть предварительно обработаны перед их возвратом из вызовов get().

source: The default implementation used by :class:`ConfigParser`. It enables values to contain format strings which refer to other values in the same section, or values in the special default section [1]_. Additional default values can be provided on initialization.
es_es: La implementación por defecto utilizada por :class:`ConfigParser`. Permite que los valores contengan cadenas de formato que hagan referencia a otros valores de la misma sección o a valores de la sección especial por defecto [1]_. Se pueden proporcionar valores por defecto adicionales en la inicialización.
pt_pt: A implementação predefinida usada por :class:`ConfigParser`. Permite que os valores contenham strings de formato que se referem a outros valores na mesma secção, ou valores na secção especial predefinida [1]_. Valores predefinidos adicionais podem ser fornecidos na inicialização.
ru: Реализация по умолчанию, используемая :class:`ConfigParser`. Это позволяет значениям содержать строки формата, которые ссылаются на другие значения в том же разделе или значения в специальном разделе по умолчанию. [1]_ . Дополнительные значения по умолчанию могут быть предоставлены при инициализации.

source: [Paths] home_dir: /Users my_dir: %(home_dir)s/lumberjack my_pictures: %(my_dir)s/Pictures [Escape] # use a %% to escape the % sign (% is the only character that needs to be escaped): gain: 80%%
es_es: [Paths] home_dir: /Users my_dir: %(home_dir)s/lumberjack my_pictures: %(my_dir)s/Pictures [Escape] # use un %% para escapar el signo % (% es el único caracter que necesita ser escapado): ganancia: 80%%
pt_pt: [Paths] home_dir: /Users my_dir: %(home_dir)s/lumberjack my_pictures: %(my_dir)s/Pictures [Escape] # use %% para escapar o sinal % (% é o único caráter que precisa de ser escapado): gain: 80%%

source: In the example above, :class:`ConfigParser` with *interpolation* set to ``BasicInterpolation()`` would resolve ``%(home_dir)s`` to the value of ``home_dir`` (``/Users`` in this case). ``%(my_dir)s`` in effect would resolve to ``/Users/lumberjack``. All interpolations are done on demand so keys used in the chain of references do not have to be specified in any specific order in the configuration file.
es_es: En el ejemplo anterior, :class:`ConfigParser` con *interpolación* establecida en ``BasicInterpolation()`` resolvería ``%(home_dir)s`` al valor de ``home_dir`` (``/Users`` en este caso). ``%(my_dir)s`` en efecto resolvería a ``/Users/lumberjack``. Todas las interpolaciones se realizan bajo demanda, por lo que las claves utilizadas en la cadena de referencias no tienen que especificarse en ningún orden concreto en el archivo de configuración.
pt_pt: No exemplo acima, :class:`ConfigParser` com *interpolação* definida para ``BasicInterpolation()`` resolveria ``%(home_dir)s`` para o valor de ``home_dir`` (``/Users`` neste caso). ``%(my_dir)s``, na prática, resolveria para ``/Users/lumberjack``. Todas as interpolações são feitas sob demanda, por isso as chaves usadas na cadeia de referências não precisam de ser especificadas em nenhuma ordem específica no ficheiro de configuração.
ru: В приведенном выше примере :class:`ConfigParser` с *interpolation*, установленным в ``BasicInterpolation()``, разрешит `` %(man_dir)с `` на значение ``home_dir`` (в данном случае ``/Users``). `` %(my_dir)с `` по сути будет разрешено как ``/Users/lumberjack``. Все интерполяции выполняются по требованию, поэтому ключи, используемые в цепочке ссылок, не нужно указывать в каком-либо определенном порядке в файле конфигурации.

source: With ``interpolation`` set to ``None``, the parser would simply return ``%(my_dir)s/Pictures`` as the value of ``my_pictures`` and ``%(home_dir)s/lumberjack`` as the value of ``my_dir``.
es_es: Con ``interpolation`` establecido en ``None``, el analizador sintáctico simplemente devolvería ``%(my_dir)s/Pictures`` como valor de ``my_pictures`` y ``%(home_dir)s/lumberjack`` como valor de ``my_dir``.
pt_pt: Com ``interpolation`` definido como ``None``, o analisador simplesmente retornaria ``%(my_dir)s/Pictures`` como o valor de ``my_pictures`` e ``%(home_dir)s/lumberjack`` como o valor de ``my_dir``.
ru: Если для ``интерполяции`` установлено значение ``Нет``, синтаксический анализатор просто вернет `` %(my_dir)с /Pictures`` как значение ``my_pictures`` и `` %(man_dir)с /lumberjack`` как значение ``my_dir``.

source: An alternative handler for interpolation which implements a more advanced syntax, used for instance in ``zc.buildout``. Extended interpolation is using ``${section:option}`` to denote a value from a foreign section. Interpolation can span multiple levels. For convenience, if the ``section:`` part is omitted, interpolation defaults to the current section (and possibly the default values from the special section).
es_es: Un manejador alternativo para la interpolación que implementa una sintaxis más avanzada, utilizada por ejemplo en ``zc.buildout``. La interpolación ampliada consiste en utilizar ``${section:option}`` para denotar un valor de una sección ajena. La interpolación puede abarcar varios niveles. Por comodidad, si se omite la parte ``section:``, la interpolación se realiza por defecto en la sección actual (y posiblemente en los valores por defecto de la sección especial).
pt_pt: Um manipulador alternativo para interpolação que implementa uma sintaxe mais avançada, usada, por exemplo, em ``zc.buildout``. A interpolação estendida usa ``${section:option}`` para denotar um valor de uma secção externa. A interpolação pode abranger vários níveis. Por conveniência, se a parte ``section:`` for omitida, a interpolação predefine para a secção atual (e possivelmente os valores predefinidos da secção especial).
ru: Альтернативный обработчик интерполяции, реализующий более продвинутый синтаксис, используемый, например, в zc.buildout. Расширенная интерполяция использует ``${section:option}`` для обозначения значения из стороннего раздела. Интерполяция может охватывать несколько уровней. Для удобства, если часть ``section:`` опущена, интерполяция по умолчанию будет использоваться для текущего раздела (и, возможно, значений по умолчанию из специального раздела).

source: For example, the configuration specified above with basic interpolation, would look like this with extended interpolation:
es_es: Por ejemplo, la configuración especificada anteriormente con interpolación básica, tendría este aspecto con interpolación ampliada:
pt_pt: Por exemplo, a configuração especificada acima com interpolação básica ficaria assim com interpolação estendida:
ru: Например, указанная выше конфигурация с базовой интерполяцией будет выглядеть так с расширенной интерполяцией:

source: [Paths] home_dir: /Users my_dir: ${home_dir}/lumberjack my_pictures: ${my_dir}/Pictures [Escape] # use a $$ to escape the $ sign ($ is the only character that needs to be escaped): cost: $$80
es_es: [Paths] home_dir: /Users my_dir: ${home_dir}/lumberjack my_pictures: ${my_dir}/Pictures [Escape] # use un $$ para escapar el signo $ ($ es el único carácter que necesita ser escapado): coste: $$80

source: Values from other sections can be fetched as well:
es_es: También se pueden obtener valores de otras secciones:
pt_pt: Valores de outras secções também podem ser obtidos:
ru: Также можно получить значения из других разделов:

source: Mapping Protocol Access
es_es: Asignación de protocolos de acceso
pt_pt: Acesso ao Protocolo de Mapeamento
ru: Доступ к протоколу сопоставления

source: Mapping protocol access is a generic name for functionality that enables using custom objects as if they were dictionaries. In case of :mod:`configparser`, the mapping interface implementation is using the ``parser['section']['option']`` notation.
es_es: El acceso al protocolo de mapeo es un nombre genérico para la funcionalidad que permite utilizar objetos personalizados como si fueran diccionarios. En el caso de :mod:`configparser`, la implementación de la interfaz de mapeo utiliza la notación ``parser['section']['option']``.
pt_pt: O acesso ao protocolo de mapeamento é um nome genérico para a funcionalidade que permite usar objetos personalizados como se fossem dicionários. No caso de :mod:`configparser`, a implementação da interface de mapeamento usa a notação ``parser['section']['option']``.
ru: Доступ к протоколу сопоставления — это общее название функциональности, которая позволяет использовать пользовательские объекты, как если бы они были словарями. В случае :mod:`configparser` реализация интерфейса сопоставления использует нотацию ``parser['section']['option']``.

source: ``parser['section']`` in particular returns a proxy for the section's data in the parser. This means that the values are not copied but they are taken from the original parser on demand. What's even more important is that when values are changed on a section proxy, they are actually mutated in the original parser.
es_es: ``parser['section']`` en particular, devuelve un proxy para los datos de la sección en el analizador sintáctico. Esto significa que los valores no se copian, sino que se toman del analizador sintáctico original bajo demanda. Lo que es aún más importante es que cuando los valores se cambian en un proxy de sección, en realidad se mutan en el analizador sintáctico original.
pt_pt: ``parser['section']``, em particular, retorna um proxy para os dados da secção no analisador. Isto significa que os valores não são copiados, mas são obtidos do analisador original sob demanda. O que é ainda mais importante é que, quando os valores são alterados num proxy de secção, eles são realmente modificados no analisador original.
ru: ``parser['section']``, в частности, возвращает прокси для данных раздела в анализаторе. Это означает, что значения не копируются, а берутся из исходного парсера по требованию. Еще более важно то, что когда значения изменяются в прокси-сервере раздела, они фактически изменяются в исходном парсере.

source: :mod:`configparser` objects behave as close to actual dictionaries as possible. The mapping interface is complete and adheres to the :class:`~collections.abc.MutableMapping` ABC. However, there are a few differences that should be taken into account:
es_es: :mod:`configparser` se comportan de la forma más parecida posible a los diccionarios reales. La interfaz de mapeo es completa y se ciñe al ABC de :class:`~collections.abc.MutableMapping`. Sin embargo, hay algunas diferencias que deben tenerse en cuenta:
pt_pt: Os objetos :mod:`configparser` comportam-se o mais próximo possível de dicionários reais. A interface de mapeamento é completa e aderente à :class:`~collections.abc.MutableMapping` ABC. No entanto, existem algumas diferenças que devem ser tidas em conta:
ru: Объекты :mod:`configparser` ведут себя как можно ближе к реальным словарям. Интерфейс сопоставления завершен и соответствует ABC :class:`~collections.abc.MutableMapping`. Однако есть несколько отличий, которые следует учитывать:

source: By default, all keys in sections are accessible in a case-insensitive manner [1]_. E.g. ``for option in parser["section"]`` yields only ``optionxform``'ed option key names. This means lowercased keys by default. At the same time, for a section that holds the key ``'a'``, both expressions return ``True``::
es_es: Por defecto, todas las claves de las secciones son accesibles sin distinción entre mayúsculas y minúsculas [1]_. Por ejemplo, ``for option in parser["section"]`` sólo muestra los nombres de las claves de opción de ``optionxform``. Esto significa que, por defecto, las claves se escriben en minúsculas. Al mismo tiempo, para una sección que contiene la clave ``'a'``, ambas expresiones devuelven ``True``::
pt_pt: Por predefinição, todas as chaves nas secções são acessíveis de forma não sensível a maiúsculas e minúsculas [1]_. Por exemplo, ``for option in parser["section"]`` produz apenas nomes de chaves de opção transformados por ``optionxform``. Isto significa chaves em minúsculas por predefinição. Ao mesmo tempo, para uma secção que contém a chave ``'a'``, ambas as expressões retornam ``True``::
ru: По умолчанию все ключи в разделах доступны без учета регистра. [1]_ . Например, ``for option in parser["section"]`` дает только имена опций, заданные ``optionxform``. Это означает, что клавиши в нижнем регистре по умолчанию. В то же время для раздела, содержащего ключ «a», оба выражения возвращают «True»::

source: All sections include ``DEFAULTSECT`` values as well which means that ``.clear()`` on a section may not leave the section visibly empty. This is because default values cannot be deleted from the section (because technically they are not there). If they are overridden in the section, deleting causes the default value to be visible again. Trying to delete a default value causes a :exc:`KeyError`.
es_es: Todas las secciones incluyen también valores ``DEFAULTSECT``, lo que significa que ``.clear()`` en una sección no puede dejar la sección visiblemente vacía. Esto se debe a que los valores por defecto no pueden borrarse de la sección (porque técnicamente no están ahí). Si se anulan en la sección, al borrarlos el valor por defecto vuelve a ser visible. Si se intenta eliminar un valor por defecto, se produce un error en :exc:`KeyError`.
pt_pt: Todas as secções incluem também valores ``DEFAULTSECT``, o que significa que ``.clear()`` numa secção pode não deixar a secção visivelmente vazia. Isto porque os valores predefinidos não podem ser eliminados da secção (porque, tecnicamente, não estão lá). Se forem substituídos na secção, a eliminação faz com que o valor predefinido volte a estar visível. Tentar eliminar um valor predefinido causa um :exc:`KeyError`.
ru: Все разделы также включают значения DEFAULTSECT, что означает, что ``.clear()`` в разделе не может оставить раздел визуально пустым. Это связано с тем, что значения по умолчанию нельзя удалить из раздела (потому что технически их там нет). Если они переопределены в разделе, удаление приведет к тому, что значение по умолчанию снова станет видимым. Попытка удалить значение по умолчанию вызывает ошибку :exc:`KeyError`.

source: ``DEFAULTSECT`` cannot be removed from the parser:
es_es: ``DEFAULTSECT`` no puede eliminarse del analizador sintáctico:
pt_pt: ``DEFAULTSECT`` não pode ser removido do analisador:
ru: ``DEFAULTSECT`` нельзя удалить из парсера:

source: trying to delete it raises :exc:`ValueError`,
es_es: al intentar borrarlo aparece :exc:`ValueError`,
pt_pt: tentar eliminá-lo levanta :exc:`ValueError`,
ru: при попытке удалить возникает :exc:`ValueError`,

source: ``parser.clear()`` leaves it intact,
es_es: ``parser.clear()`` lo deja intacto,
pt_pt: ``parser.clear()`` deixa-o intacto,
ru: ``pars.clear()`` оставляет его нетронутым,

source: ``parser.popitem()`` never returns it.
es_es: ``parser.popitem()`` nunca lo devuelve.
pt_pt: ``parser.popitem()`` nunca o retorna.
ru: ``parser.popitem()`` никогда не возвращает его.

source: ``parser.get(section, option, **kwargs)`` - the second argument is **not** a fallback value. Note however that the section-level ``get()`` methods are compatible both with the mapping protocol and the classic configparser API.
es_es: ``parser.get(section, option, **kwargs)`` - el segundo argumento **no** es un valor fallback. Tenga en cuenta, no obstante, que los métodos ``get()`` a nivel de sección son compatibles tanto con el protocolo de mapeo como con la API configparser clásica.
pt_pt: ``parser.get(section, option, **kwargs)`` - o segundo argumento **não** é um valor de recurso. Note, no entanto, que os métodos ``get()`` ao nível da secção são compatíveis tanto com o protocolo de mapeamento como com a API clássica do configparser.
ru: ``parser.get(section, option, **kwargs)`` - второй аргумент **не** является резервным значением. Однако обратите внимание, что методы get() на уровне раздела совместимы как с протоколом сопоставления, так и с классическим API configparser.

source: ``parser.items()`` is compatible with the mapping protocol (returns a list of *section_name*, *section_proxy* pairs including the DEFAULTSECT). However, this method can also be invoked with arguments: ``parser.items(section, raw, vars)``. The latter call returns a list of *option*, *value* pairs for a specified ``section``, with all interpolations expanded (unless ``raw=True`` is provided).
es_es: ``parser.items()`` es compatible con el protocolo de mapeo (devuelve una lista de pares *section_name*, *section_proxy* incluyendo el DEFAULTSECT). Sin embargo, este método también puede invocarse con argumentos: ``parser.items(section, raw, vars)``. Esta última llamada devuelve una lista de pares *option*, *value* para un ``section`` especificado, con todas las interpolaciones expandidas (a menos que se proporcione ``raw=True`` ).
pt_pt: ``parser.items()`` é compatível com o protocolo de mapeamento (retorna uma lista de pares *section_name*, *section_proxy*, incluindo DEFAULTSECT). No entanto, este método também pode ser invocado com argumentos: ``parser.items(section, raw, vars)``. A última chamada retorna uma lista de pares *option*, *value* para uma ``section`` especificada, com todas as interpolações expandidas (a menos que ``raw=True`` seja fornecido).
ru: ``parser.items()`` совместим с протоколом сопоставления (возвращает список пар *section_name*, *section_proxy*, включая DEFAULTSECT). Однако этот метод также можно вызвать с аргументами: ``parser.items(section, raw, vars)``. Последний вызов возвращает список пар *option*, *value* для указанного ``section`` со всеми расширенными интерполяциями (если не указан ``raw=True``).

source: The mapping protocol is implemented on top of the existing legacy API so that subclasses overriding the original interface still should have mappings working as expected.
es_es: El protocolo de mapeo se implementa sobre la API heredada existente, de modo que las subclases que sobrescriben la interfaz original deberían seguir utilizando los mapeos de la forma esperada.
pt_pt: O protocolo de mapeamento é implementado sobre a API legada existente, de modo que subclasses que substituem a interface original ainda devem ter mapeamentos a funcionar como esperado.
ru: Протокол сопоставления реализован поверх существующего устаревшего API, поэтому подклассы, переопределяющие исходный интерфейс, по-прежнему должны иметь сопоставления, работающие должным образом.

source: Customizing Parser Behaviour
es_es: Personalización del comportamiento del analizador sintáctico
pt_pt: Personalizar o Comportamento do Analisador
ru: Настройка поведения анализатора
