Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/constants.po
Languages: es_es, zh_tw

source: Built-in Constants
es_es: Constantes incorporadas
zh_tw: 內建常數

source: A small number of constants live in the built-in namespace. They are:
es_es: Un pequeño número de constantes viven en el espacio de nombres incorporado. Éstas son:
zh_tw: We wbudowanej przestrzeni nazw znajduje się kilka stałych. Są to:

source: The false value of the :class:`bool` type. Assignments to ``False`` are illegal and raise a :exc:`SyntaxError`.
es_es: El falso valor del tipo :class:`bool`. Las asignaciones a ``False`` son ilegales y generan un :exc:`SyntaxError`.
zh_tw: Wartość "fałsz" typu :class:`bool`. Przypisania do ``False`` są niedozwolone i rzucają wyjątkiem :exc:`SyntaxError`.

source: The true value of the :class:`bool` type. Assignments to ``True`` are illegal and raise a :exc:`SyntaxError`.
es_es: El valor verdadero del tipo :class:`bool`. Las asignaciones a ``True`` son ilegales y generan un :exc:`SyntaxError`.
zh_tw: Wartość "prawda" typu :class:`bool`. Przypisania do ``True`` są niedozwolone i rzucają wyjątkiem :exc:`SyntaxError`.

source: An object frequently used to represent the absence of a value, as when default arguments are not passed to a function. Assignments to ``None`` are illegal and raise a :exc:`SyntaxError`. ``None`` is the sole instance of the :data:`~types.NoneType` type.
es_es: Objeto utilizado frecuentemente para representar la ausencia de un valor, como cuando no se pasan argumentos por defecto a una función. Las asignaciones a ``None`` son ilegales y provocan un :exc:`SyntaxError`. ``None`` es la única instancia del tipo :data:`~types.NoneType`.
zh_tw: Obiekt często używany do reprezentowania braku wartości, na przykład gdy domyślne argumenty nie są przekazywane do funkcji. Przypisania do ``None`` są niedozwolone i rzucają wyjątkiem :exc:`SyntaxError`. ``None`` jest jedyną instancją typu :data:`~types.NoneType`.

source: A special value which should be returned by the binary special methods (e.g. :meth:`~object.__eq__`, :meth:`~object.__lt__`, :meth:`~object.__add__`, :meth:`~object.__rsub__`, etc.) to indicate that the operation is not implemented with respect to the other type; may be returned by the in-place binary special methods (e.g. :meth:`~object.__imul__`, :meth:`~object.__iand__`, etc.) for the same purpose. It should not be evaluated in a boolean context. :data:`!NotImplemented` is the sole instance of the :data:`types.NotImplementedType` type.
es_es: Valor especial que deben devolver los métodos binarios especiales (por ejemplo, :meth:`~object.__eq__`, :meth:`~object.__lt__`, :meth:`~object.__add__`, :meth:`~object.__rsub__`, etc.) para indicar que la operación no está implementada con respecto al otro tipo; puede ser devuelto por los métodos binarios especiales in-place (por ejemplo, :meth:`~object.__imul__`, :meth:`~object.__iand__`, etc.) con el mismo propósito. No debe evaluarse en un contexto booleano. :data:`!NotImplemented` es la única instancia del tipo :data:`types.NotImplementedType`.
zh_tw: Specjalna wartość, która powinna być zwracana przez specjalne metody binarne (np. :meth:`~object.__eq__`, :meth:`~object.__lt__`, :meth:`~object.__add__`, :meth:`~object.__rsub__`, itp.) aby zasygnalizować, że dana operacja nie jest zaimplementowana w odniesieniu do drugiego typu; może być zwracana przez specjalne metody binarne operujące w miejscu (ang. in-place) (np. :meth:`~object.__imul__`, :meth:`~object.__iand__`, itp.) w tym samym celu. Nie powinna być ewaluowana w kontekście logicznym. :data:`!NotImplemented` jest jedyną instancją typu :data:`types.NotImplementedType`.

source: When a binary (or in-place) method returns :data:`!NotImplemented` the interpreter will try the reflected operation on the other type (or some other fallback, depending on the operator). If all attempts return :data:`!NotImplemented`, the interpreter will raise an appropriate exception. Incorrectly returning :data:`!NotImplemented` will result in a misleading error message or the :data:`!NotImplemented` value being returned to Python code.
es_es: Cuando un método binario (o in-place) devuelve :data:`!NotImplemented` el intérprete intentará la operación reflejada en el otro tipo (o algún otro fallback, dependiendo del operador). Si todos los intentos devuelven :data:`!NotImplemented`, el intérprete lanzará una excepción apropiada. La devolución incorrecta de :data:`!NotImplemented` resultará en un mensaje de error engañoso o en la devolución del valor :data:`!NotImplemented` al código Python.
zh_tw: Gdy metoda binarna (albo operująca w miejscu) zwróci :data:`!NotImplemented`, interpreter spróbuje wykonać odpowiadającą jej operację na drugim typie (albo innego mechanizmu rezerwowego, w zależności od rodzaju operatora). Dopiero gdy wszystkie próby zwrócą :data:`!NotImplemented`, interpreter rzuci odpowiednim wyjątkiem. Nieprawidłowe zwracanie :data:`!NotImplemented` spowoduje wyświetlenie mylnego komunikatu błędu lub też zwrócenie wartości :data:`!NotImplemented` do kodu Pythona.

source: See :ref:`implementing-the-arithmetic-operations` for examples.
es_es: Consulte ejemplos en :ref:`implementing-the-arithmetic-operations`.
zh_tw: Zobacz przykłady w :ref:`implementing-the-arithmetic-operations`.

source: :data:`!NotImplemented` and :exc:`!NotImplementedError` are not interchangeable. This constant should only be used as described above; see :exc:`NotImplementedError` for details on correct usage of the exception.
es_es: :data:`!NotImplemented` y :exc:`!NotImplementedError` no son intercambiables. Esta constante sólo debe utilizarse como se ha descrito anteriormente; consulte :exc:`NotImplementedError` para obtener más información sobre el uso correcto de la excepción.
zh_tw: :data:`!NotImplemented` e :exc:`!NotImplementedError` não são intercambiáveis. Esta constante deve ser usada somente conforme descrito acima; veja :exc:`NotImplementedError` para detalhes sobre o uso correto da exceção.

source: Evaluating :data:`!NotImplemented` in a boolean context is deprecated. While it currently evaluates as true, it will emit a :exc:`DeprecationWarning`. It will raise a :exc:`TypeError` in a future version of Python.
es_es: Evaluar :data:`!NotImplemented` en un contexto booleano está obsoleto. Si bien actualmente se evalúa como verdadero, emitirá un :exc:`DeprecationWarning`. Dará lugar a un :exc:`TypeError` en una futura versión de Python.

source: The same as the ellipsis literal "``...``". Special value used mostly in conjunction with extended slicing syntax for user-defined container data types. ``Ellipsis`` is the sole instance of the :data:`types.EllipsisType` type.
es_es: Igual que el literal de elipsis "``...``". Valor especial utilizado principalmente junto con la sintaxis de corte ampliada para tipos de datos contenedores definidos por el usuario. ``Ellipsis`` es la única instancia del tipo :data:`types.EllipsisType`.
zh_tw: To samo co literalny zapis wielokropka "``...``". Wartość specjalna używana głównie w połączeniu z rozszerzoną składnią krojenia typów danych kontenerów zdefiniowanych przez użytkownika. ``Ellipsis`` jest jedyną instancją typu :data:`types.EllipsisType`.

source: This constant is true if Python was not started with an :option:`-O` option. See also the :keyword:`assert` statement.
es_es: Esta constante es verdadera si Python no se inició con una opción :option:`-O`. Ver también la sentencia :keyword:`assert`.
zh_tw: Ta stała ma wartość True jeśli Python nie został uruchomiony z opcją :option:`-O`. Zobacz także deklarację :keyword:`assert`.

source: The names :data:`None`, :data:`False`, :data:`True` and :data:`__debug__` cannot be reassigned (assignments to them, even as an attribute name, raise :exc:`SyntaxError`), so they can be considered "true" constants.
es_es: Los nombres :data:`None`, :data:`False`, :data:`True` y :data:`__debug__` no pueden reasignarse (las asignaciones a los mismos, incluso como nombre de atributo, levantan :exc:`SyntaxError`), por lo que pueden considerarse constantes "verdaderas".
zh_tw: Nazwy :data:`None`, :data:`False`, :data:`True` oraz :data:`__debug__` nie mogą być przypisane ponownie (przypisania do nich, nawet jako nazwa atrybutu, rzucają :exc:`SyntaxError`), więc mogą być uważane za „prawdziwe” stałe.

source: Constants added by the :mod:`site` module
es_es: Constantes añadidas por el módulo :mod:`site`
zh_tw: Stałe dodane przez moduł :mod:`site`

source: The :mod:`site` module (which is imported automatically during startup, except if the :option:`-S` command-line option is given) adds several constants to the built-in namespace. They are useful for the interactive interpreter shell and should not be used in programs.
es_es: El módulo :mod:`site` (que se importa automáticamente durante el inicio, excepto si se da la opción de línea de comandos :option:`-S` ) añade varias constantes al espacio de nombres incorporado. Son útiles para el intérprete de comandos interactivo y no deben utilizarse en los programas.
zh_tw: Moduł :mod:`site` (który jest importowany automatycznie podczas uruchamiania, z wyjątkiem sytuacji, gdy podano opcję wiersza poleceń :option:`-S`) dodaje kilka stałych do wbudowanej przestrzeni nazw. Są one przydatne w interaktywnej powłoce interpretera i nie powinny być używane w programach.

source: Objects that when printed, print a message like "Use quit() or Ctrl-D (i.e. EOF) to exit", and when called, raise :exc:`SystemExit` with the specified exit code.
es_es: Objetos que cuando se imprimen, imprimen un mensaje como "Use quit() o Ctrl-D (i.e. EOF) para salir", y cuando se llaman, lanzan :exc:`SystemExit` con el código de salida especificado.
zh_tw: Obiekty, które, gdy ich nazwa zostanie wpisana w powłoce - wyświetlają wiadomość w formie "Use quit() or Ctrl-D (i.e. EOF) to exit", a gdy wywołane - rzucą wyjątek :exc:`SystemExit` z podanym kodem wyjścia.

source: Object that when printed, prints the message "Type help() for interactive help, or help(object) for help about object.", and when called, acts as described :func:`elsewhere <help>`.
es_es: Objeto que cuando se imprime, imprime el mensaje "Escriba help() para ayuda interactiva, o help(object) para ayuda sobre el objeto.", y cuando se llama, actúa como se describe :func:`elsewhere <help>`.
zh_tw: Объект, который при печати печатает сообщение «Введите help() для интерактивной справки или help(object) для справки об объекте.», а при вызове действует, как описано :func:`elsewhere <help>`.

source: Objects that when printed or called, print the text of copyright or credits, respectively.
es_es: Objetos que al ser impresos o llamados, imprimen el texto de copyright o créditos, respectivamente.
zh_tw: Obiekty, które, gdy wypisane lub wywołane - wyświetlają treść odpowiednio praw autorskich i słów uznania.

source: Object that when printed, prints the message "Type license() to see the full license text", and when called, displays the full license text in a pager-like fashion (one screen at a time).
es_es: Objeto que cuando se imprime, imprime el mensaje "Escriba license() para ver el texto completo de la licencia", y cuando se llama, muestra el texto completo de la licencia en forma de paginador (una pantalla cada vez).
zh_tw: Obiekt, który, gdy jego nazwa zostanie wpisana w powłoce - wyświetla wiadomość "Type license() to see the full license text", a gdy wywołany - wyświetla pełny tekst licencji w sposób podobny do pagera (jeden ekran na raz).

source: ellipsis literal
es_es: elipsis literal
zh_tw: Literalny zapis wielokropka
