Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/contextlib.po
Languages: es_es, pt_pt

source: Context managers created using :func:`contextmanager` are also single use context managers, and will complain about the underlying generator failing to yield if an attempt is made to use them a second time::
pt_pt: Os gestores de contexto criados usando :func:`contextmanager` também são gestores de contexto de uso único e reclamarão sobre o gerador subjacente que falha ao produzir se for feita uma tentativa de os usar uma segunda vez::

source: Reentrant context managers
pt_pt: Gestores de contexto reentrantes

source: More sophisticated context managers may be "reentrant". These context managers can not only be used in multiple :keyword:`with` statements, but may also be used *inside* a :keyword:`!with` statement that is already using the same context manager.
pt_pt: Gestores de contexto mais sofisticados podem ser "reentrantes". Estes gestores de contexto podem não só ser usados em múltiplas instruções :keyword:`with`, mas também podem ser usados *dentro* de uma instrução :keyword:`!with` que já está a usar o mesmo gestor de contexto.

source: :class:`threading.RLock` is an example of a reentrant context manager, as are :func:`suppress`, :func:`redirect_stdout`, and :func:`chdir`. Here's a very simple example of reentrant use::
pt_pt: :class:`threading.RLock` é um exemplo de um gestor de contexto reentrante, assim como :func:`suppress`, :func:`redirect_stdout` e :func:`chdir`. Aqui está um exemplo muito simples de uso reentrante::

source: Real world examples of reentrancy are more likely to involve multiple functions calling each other and hence be far more complicated than this example.
pt_pt: Exemplos do mundo real de reentrada são mais propensos a envolver múltiplas funções a chamarem-se umas às outras e, portanto, serem muito mais complicados do que este exemplo.

source: Note also that being reentrant is *not* the same thing as being thread safe. :func:`redirect_stdout`, for example, is definitely not thread safe, as it makes a global modification to the system state by binding :data:`sys.stdout` to a different stream.
pt_pt: Note também que ser reentrante *não* é a mesma coisa que ser thread-safe. :func:`redirect_stdout`, por exemplo, definitivamente não é thread-safe, pois faz uma modificação global no estado do sistema ao ligar :data:`sys.stdout` a um fluxo diferente.

source: Reusable context managers
pt_pt: Gestores de contexto reutilizáveis

source: Distinct from both single use and reentrant context managers are "reusable" context managers (or, to be completely explicit, "reusable, but not reentrant" context managers, since reentrant context managers are also reusable). These context managers support being used multiple times, but will fail (or otherwise not work correctly) if the specific context manager instance has already been used in a containing with statement.
pt_pt: Distintos tanto dos gestores de contexto de uso único como dos reentrantes estão os gestores de contexto "reutilizáveis" (ou, para ser completamente explícito, gestores de contexto "reutilizáveis, mas não reentrantes", uma vez que os gestores de contexto reentrantes também são reutilizáveis). Estes gestores de contexto suportam ser usados várias vezes, mas falharão (ou não funcionarão corretamente) se a instância específica do gestor de contexto já tiver sido usada numa instrução with contenedora.

source: :class:`threading.Lock` is an example of a reusable, but not reentrant, context manager (for a reentrant lock, it is necessary to use :class:`threading.RLock` instead).
pt_pt: :class:`threading.Lock` é um exemplo de um gestor de contexto reutilizável, mas não reentrante (para um bloqueio reentrante, é necessário usar :class:`threading.RLock` em vez disso).

source: Another example of a reusable, but not reentrant, context manager is :class:`ExitStack`, as it invokes *all* currently registered callbacks when leaving any with statement, regardless of where those callbacks were added::
pt_pt: Outro exemplo de um gestor de contexto reutilizável, mas não reentrante, é :class:`ExitStack`, pois invoca *todos* os callbacks atualmente registados ao sair de qualquer instrução with, independentemente de onde esses callbacks foram adicionados::

source: As the output from the example shows, reusing a single stack object across multiple with statements works correctly, but attempting to nest them will cause the stack to be cleared at the end of the innermost with statement, which is unlikely to be desirable behaviour.
pt_pt: Como a saída do exemplo mostra, reutilizar um único objeto de pilha em várias instruções with funciona corretamente, mas tentar aninhá-las fará com que a pilha seja limpa no final da instrução with mais interna, o que é improvável de ser um comportamento desejável.

source: Using separate :class:`ExitStack` instances instead of reusing a single instance avoids that problem::
pt_pt: Usar instâncias separadas de :class:`ExitStack` em vez de reutilizar uma única instância evita esse problema::

source: While many objects natively support use in with statements, sometimes a resource needs to be managed that isn't a context manager in its own right, and doesn't implement a ``close()`` method for use with ``contextlib.closing``
es_es: Aunque muchos objetos admiten de forma nativa el uso en sentencias with, a veces es necesario gestionar un recurso que no es un gestor de contexto por derecho propio, y no implementa un método ``close()`` para su uso con ``contextlib.closing``

source: >>> @mycontext() ... def function(): ... print('The bit in the middle') ... >>> function() Starting The bit in the middle Finishing >>> with mycontext(): ... print('The bit in the middle') ... Starting The bit in the middle Finishing
es_es: >>> @mycontext() ... def function(): ... print('El bit del medio') ... >>> function() Starting El bit del medio Finishing >>> with mycontext(): ... print('El bit del medio') ... Starting El bit del medio Finishing

source: from asyncio import run from contextlib import AsyncContextDecorator class mycontext(AsyncContextDecorator): async def __aenter__(self): print('Starting') return self async def __aexit__(self, *exc): print('Finishing') return False
es_es: from asyncio import run from contextlib import AsyncContextDecorator class micontexto(AsyncContextDecorator): async def __aenter__(self): print('Empezando') return self async def __aexit__(self, *exc): print('Terminando') return False

source: >>> @mycontext() ... async def function(): ... print('The bit in the middle') ... >>> run(function()) Starting The bit in the middle Finishing >>> async def function(): ... async with mycontext(): ... print('The bit in the middle') ... >>> run(function()) Starting The bit in the middle Finishing
es_es: >>> @mycontext() ... async def function(): ... print('El bit del medio') ... >>> run(function()) Starting The bit in the middle Finishing >>> async def function(): ... async con mycontext(): ... print('La parte del medio') ... >>> run(function()) Starting The bit in the middle Finishing
