Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/contextlib.po
Languages: es_es, pt_pt

source: As with any other mechanism that completely suppresses exceptions, this context manager should be used only to cover very specific errors where silently continuing with program execution is known to be the right thing to do.
es_es: Al igual que con cualquier otro mecanismo que suprima completamente las excepciones, este gestor de contexto sólo debe utilizarse para cubrir errores muy específicos en los que se sabe que continuar silenciosamente con la ejecución del programa es lo correcto.
pt_pt: Como qualquer outro mecanismo que suprime completamente exceções, este gestor de contexto deve ser usado apenas para cobrir erros muito específicos onde continuar silenciosamente com a execução do programa é sabidamente a coisa certa a fazer.

source: For example::
es_es: Por ejemplo::
pt_pt: Por exemplo::

source: This code is equivalent to::
es_es: Este código equivale a::
pt_pt: Este código é equivalente a::

source: This context manager is :ref:`reentrant <reentrant-cms>`.
es_es: Este gestor de contexto es :ref:`reentrant <reentrant-cms>`.
pt_pt: Este gestor de contexto é :ref:`reentrante <reentrant-cms>`.

source: If the code within the :keyword:`!with` block raises a :exc:`BaseExceptionGroup`, suppressed exceptions are removed from the group. Any exceptions of the group which are not suppressed are re-raised in a new group which is created using the original group's :meth:`~BaseExceptionGroup.derive` method.
es_es: Si el código dentro del bloque :keyword:`!with` lanza una :exc:`BaseExceptionGroup`, las excepciones suprimidas se eliminan del grupo. Las excepciones del grupo no suprimidas se vuelven a lanzar en un nuevo grupo que se crea utilizando el método :meth:`~BaseExceptionGroup.derive` del grupo original.
pt_pt: Se o código dentro do bloco :keyword:`!with` levantar um :exc:`BaseExceptionGroup`, as exceções suprimidas são removidas do grupo. Quaisquer exceções do grupo que não sejam suprimidas são relançadas num novo grupo que é criado usando o método :meth:`~BaseExceptionGroup.derive` do grupo original.

source: ``suppress`` now supports suppressing exceptions raised as part of a :exc:`BaseExceptionGroup`.
es_es: ``suppress`` admite ahora la supresión de excepciones planteadas como parte de :exc:`BaseExceptionGroup`.
pt_pt: ``suppress`` agora suporta suprimir exceções levantadas como parte de um :exc:`BaseExceptionGroup`.

source: Context manager for temporarily redirecting :data:`sys.stdout` to another file or file-like object.
es_es: Gestor de contexto para redirigir temporalmente :data:`sys.stdout` a otro archivo u objeto similar a un archivo.
pt_pt: Gestor de contexto para redirecionar temporariamente :data:`sys.stdout` para outro ficheiro ou objeto semelhante a ficheiro.

source: This tool adds flexibility to existing functions or classes whose output is hardwired to stdout.
es_es: Esta herramienta añade flexibilidad a las funciones o clases existentes cuya salida está conectada a stdout.
pt_pt: Esta ferramenta adiciona flexibilidade a funções ou classes existentes cuja saída está fixa para stdout.

source: For example, the output of :func:`help` normally is sent to *sys.stdout*. You can capture that output in a string by redirecting the output to an :class:`io.StringIO` object. The replacement stream is returned from the ``__enter__`` method and so is available as the target of the :keyword:`with` statement::
es_es: Por ejemplo, la salida de :func:`help` normalmente se envía a *sys.stdout*. Puede capturar esa salida en una cadena redirigiendo la salida a un objeto :class:`io.StringIO`. El flujo de sustitución se devuelve desde el método ``__enter__`` y por lo tanto está disponible como objetivo de la sentencia :keyword:`with`::
pt_pt: Por exemplo, a saída de :func:`help` normalmente é enviada para *sys.stdout*. Pode capturar essa saída numa string redirecionando a saída para um objeto :class:`io.StringIO`. O fluxo de substituição é devolvido pelo método ``__enter__`` e, portanto, está disponível como alvo da instrução :keyword:`with`::

source: To send the output of :func:`help` to a file on disk, redirect the output to a regular file::
es_es: Para enviar la salida de :func:`help` a un archivo en disco, redirija la salida a un archivo normal::
pt_pt: Para enviar a saída de :func:`help` para um ficheiro no disco, redirecione a saída para um ficheiro regular::

source: To send the output of :func:`help` to *sys.stderr*::
es_es: Para enviar la salida de :func:`help` a *sys.stderr*::
pt_pt: Para enviar a saída de :func:`help` para *sys.stderr*::

source: Note that the global side effect on :data:`sys.stdout` means that this context manager is not suitable for use in library code and most threaded applications. It also has no effect on the output of subprocesses. However, it is still a useful approach for many utility scripts.
es_es: Tenga en cuenta que el efecto secundario global en :data:`sys.stdout` significa que este gestor de contexto no es adecuado para su uso en código de biblioteca y la mayoría de las aplicaciones roscadas. Tampoco tiene efecto sobre la salida de subprocesos. Sin embargo, sigue siendo un enfoque útil para muchos scripts de utilidades.
pt_pt: Note que o efeito colateral global em :data:`sys.stdout` significa que este gestor de contexto não é adequado para uso em código de biblioteca e na maioria das aplicações com threads. Também não tem efeito na saída de subprocessos. No entanto, ainda é uma abordagem útil para muitos scripts utilitários.

source: Similar to :func:`~contextlib.redirect_stdout` but redirecting :data:`sys.stderr` to another file or file-like object.
es_es: Similar a :func:`~contextlib.redirect_stdout` pero redirigiendo :data:`sys.stderr` a otro archivo u objeto similar a un archivo.
pt_pt: Semelhante a :func:`~contextlib.redirect_stdout`, mas redirecionando :data:`sys.stderr` para outro ficheiro ou objeto semelhante a ficheiro.

source: Non parallel-safe context manager to change the current working directory. As this changes a global state, the working directory, it is not suitable for use in most threaded or async contexts. It is also not suitable for most non-linear code execution, like generators, where the program execution is temporarily relinquished -- unless explicitly desired, you should not yield when this context manager is active.
es_es: Gestor de contexto no seguro en paralelo para cambiar el directorio de trabajo actual. Como esto cambia un estado global, el directorio de trabajo, no es adecuado para su uso en la mayoría de los contextos roscados o asíncronos. Tampoco es adecuado para la mayoría de la ejecución de código no lineal, como los generadores, donde la ejecución del programa se abandona temporalmente -- a menos que se desee explícitamente, no se debe ceder cuando este gestor de contexto está activo.
pt_pt: Gestor de contexto não seguro para paralelo para alterar o diretório de trabalho atual. Como isto altera um estado global, o diretório de trabalho, não é adequado para uso na maioria dos contextos com threads ou assíncronos. Também não é adequado para a maioria das execuções de código não lineares, como geradores, onde a execução do programa é temporariamente abandonada — a menos que seja explicitamente desejado, não deve usar yield quando este gestor de contexto estiver ativo.

source: This is a simple wrapper around :func:`~os.chdir`, it changes the current working directory upon entering and restores the old one on exit.
es_es: Esta es una simple envoltura alrededor de :func:`~os.chdir`, cambia el directorio de trabajo actual al entrar y restaura el antiguo al salir.
pt_pt: Isto é um invólucro simples em torno de :func:`~os.chdir`, altera o diretório de trabalho atual ao entrar e restaura o antigo à saída.

source: A base class that enables a context manager to also be used as a decorator.
es_es: Una clase base que permite utilizar un gestor de contexto también como decorador.
pt_pt: Uma classe base que permite que um gestor de contexto também seja usado como um decorador.

source: Context managers inheriting from ``ContextDecorator`` have to implement ``__enter__`` and ``__exit__`` as normal. ``__exit__`` retains its optional exception handling even when used as a decorator.
es_es: Los gestores de contexto que hereden de ``ContextDecorator`` tienen que implementar ``__enter__`` y ``__exit__`` de forma normal. ``__exit__`` conserva su gestión opcional de excepciones incluso cuando se utiliza como decorador.
pt_pt: Os gestores de contexto que herdam de ``ContextDecorator`` têm de implementar ``__enter__`` e ``__exit__`` normalmente. ``__exit__`` mantém o seu tratamento opcional de exceções, mesmo quando usado como decorador.

source: ``ContextDecorator`` is used by :func:`contextmanager`, so you get this functionality automatically.
es_es: ``ContextDecorator`` es utilizado por :func:`contextmanager`, por lo que obtendrá esta funcionalidad automáticamente.
pt_pt: ``ContextDecorator`` é usado por :func:`contextmanager`, por isso obtém esta funcionalidade automaticamente.

source: Example of ``ContextDecorator``::
es_es: Ejemplo de ``ContextDecorator``::
pt_pt: Exemplo de ``ContextDecorator``::

source: The class can then be used like this::
es_es: La clase se puede utilizar así::
pt_pt: A classe pode então ser usada assim::

source: This change is just syntactic sugar for any construct of the following form::
es_es: Este cambio es sólo azúcar sintáctico para cualquier construcción de la siguiente forma::
pt_pt: Esta alteração é apenas açúcar sintático para qualquer construção da seguinte forma::

source: def f(): with cm(): # Do stuff
es_es: def f(): with cm(): # Hacer cosas
pt_pt: def f(): with cm(): # Fazer coisas

source: ``ContextDecorator`` lets you instead write::
es_es: ``ContextDecorator`` te permite escribir::
pt_pt: ``ContextDecorator`` permite-lhe escrever em vez disso::

source: @cm() def f(): # Do stuff
es_es: @cm() def f(): # Hacer cosas
pt_pt: @cm() def f(): # Fazer coisas

source: It makes it clear that the ``cm`` applies to the whole function, rather than just a piece of it (and saving an indentation level is nice, too).
es_es: Deja claro que ``cm`` se aplica a toda la función, y no sólo a una parte de ella (y guardar un nivel de indentación también está bien).
pt_pt: Torna claro que o ``cm`` se aplica a toda a função, em vez de apenas a uma parte dela (e poupar um nível de indentação também é bom).

source: Existing context managers that already have a base class can be extended by using ``ContextDecorator`` as a mixin class::
es_es: Los gestores de contexto existentes que ya tienen una clase base pueden ampliarse utilizando ``ContextDecorator`` como clase mixta::
pt_pt: Os gestores de contexto existentes que já têm uma classe base podem ser estendidos usando ``ContextDecorator`` como uma classe mixin::

source: As the decorated function must be able to be called multiple times, the underlying context manager must support use in multiple :keyword:`with` statements. If this is not the case, then the original construct with the explicit :keyword:`!with` statement inside the function should be used.
es_es: Dado que la función decorada debe poder llamarse varias veces, el gestor de contexto subyacente debe admitir su uso en varias sentencias :keyword:`with`. De no ser así, deberá utilizarse la construcción original con la sentencia :keyword:`!with` explícita dentro de la función.
pt_pt: Como a função decorada deve poder ser chamada várias vezes, o gestor de contexto subjacente deve suportar uso em múltiplas instruções :keyword:`with`. Se não for o caso, então a construção original com a instrução :keyword:`!with` explícita dentro da função deve ser usada.

source: Similar to :class:`ContextDecorator` but only for asynchronous functions.
es_es: Similar a :class:`ContextDecorator` pero sólo para funciones asíncronas.
pt_pt: Semelhante a :class:`ContextDecorator`, mas apenas para funções assíncronas.

source: Example of ``AsyncContextDecorator``::
es_es: Ejemplo de ``AsyncContextDecorator``::
pt_pt: Exemplo de ``AsyncContextDecorator``::

source: A context manager that is designed to make it easy to programmatically combine other context managers and cleanup functions, especially those that are optional or otherwise driven by input data.
es_es: Un gestor de contexto que está diseñado para facilitar la combinación programática de otros gestores de contexto y funciones de limpieza, especialmente aquellos que son opcionales o impulsados por datos de entrada.
pt_pt: Um gestor de contexto concebido para facilitar a combinação programática de outros gestores de contexto e funções de limpeza, especialmente aquelas que são opcionais ou de outra forma orientadas por dados de entrada.

source: For example, a set of files may easily be handled in a single with statement as follows::
es_es: Por ejemplo, un conjunto de ficheros puede manejarse fácilmente en una única sentencia with de la siguiente manera::
pt_pt: Por exemplo, um conjunto de ficheiros pode ser facilmente tratado numa única instrução with da seguinte forma::

source: with ExitStack() as stack: files = [stack.enter_context(open(fname)) for fname in filenames] # All opened files will automatically be closed at the end of # the with statement, even if attempts to open files later # in the list raise an exception
es_es: with ExitStack() as stack: fiiles = [stack.enter_context(open(fname)) for fname in filenames] # Se cerrarán automáticamente todos los archivos abiertos al final de # la sentencia with, incluso si los intentos de abrir archivos más adelante # en la lista lanzan una excepción
pt_pt: with ExitStack() as stack: files = [stack.enter_context(open(fname)) for fname in filenames] # Todos os ficheiros abertos serão automaticamente fechados no final # da instrução with, mesmo que tentativas de abrir ficheiros mais tarde # na lista levantem uma exceção

source: The :meth:`~object.__enter__` method returns the :class:`ExitStack` instance, and performs no additional operations.
es_es: El método :meth:`~object.__enter__` devuelve la instancia :class:`ExitStack`, y no realiza ninguna operación adicional.
pt_pt: O método :meth:`~object.__enter__` devolve a instância :class:`ExitStack` e não realiza operações adicionais.

source: Each instance maintains a stack of registered callbacks that are called in reverse order when the instance is closed (either explicitly or implicitly at the end of a :keyword:`with` statement). Note that callbacks are *not* invoked implicitly when the context stack instance is garbage collected.
es_es: Cada instancia mantiene una pila de llamadas de retorno registradas que se invocan en orden inverso cuando se cierra la instancia (explícita o implícitamente al final de una sentencia :keyword:`with` ). Tenga en cuenta que las retrollamadas *no* se invocan implícitamente cuando se recoge la pila de contexto de la instancia.
pt_pt: Cada instância mantém uma pilha de callbacks registados que são chamados em ordem inversa quando a instância é fechada (explícita ou implicitamente no final de uma instrução :keyword:`with`). Note que os callbacks *não* são invocados implicitamente quando a instância da pilha de contexto é recolhida pelo garbage collector.

source: This stack model is used so that context managers that acquire their resources in their ``__init__`` method (such as file objects) can be handled correctly.
es_es: Este modelo de pila se utiliza para que los gestores de contexto que adquieren sus recursos en su método ``__init__`` (como los objetos de archivo) puedan manejarse correctamente.
pt_pt: Este modelo de pilha é usado para que os gestores de contexto que adquirem os seus recursos no método ``__init__`` (como objetos de ficheiro) possam ser tratados corretamente.

source: Since registered callbacks are invoked in the reverse order of registration, this ends up behaving as if multiple nested :keyword:`with` statements had been used with the registered set of callbacks. This even extends to exception handling - if an inner callback suppresses or replaces an exception, then outer callbacks will be passed arguments based on that updated state.
es_es: Dado que las retrollamadas registradas se invocan en el orden inverso al registro, esto acaba comportándose como si se hubieran utilizado múltiples sentencias anidadas :keyword:`with` con el conjunto registrado de retrollamadas. Esto se extiende incluso al manejo de excepciones - si una llamada de retorno interna suprime o reemplaza una excepción, entonces las llamadas de retorno externas recibirán argumentos basados en ese estado actualizado.
pt_pt: Como os callbacks registados são invocados na ordem inversa do registo, isto acaba por se comportar como se múltiplas instruções :keyword:`with` aninhadas tivessem sido usadas com o conjunto de callbacks registados. Isto até se estende ao tratamento de exceções - se um callback interno suprimir ou substituir uma exceção, então os callbacks externos receberão argumentos baseados nesse estado atualizado.

source: This is a relatively low level API that takes care of the details of correctly unwinding the stack of exit callbacks. It provides a suitable foundation for higher level context managers that manipulate the exit stack in application specific ways.
es_es: Se trata de una API de nivel relativamente bajo que se ocupa de los detalles de desenrollar correctamente la pila de retrollamadas de salida. Proporciona una base adecuada para gestores de contexto de nivel superior que manipulan la pila de salida de formas específicas de la aplicación.
pt_pt: Esta é uma API de nível relativamente baixo que trata dos detalhes de desempilhar corretamente a pilha de callbacks de saída. Fornece uma base adequada para gestores de contexto de nível superior que manipulam a pilha de saída de formas específicas da aplicação.

source: Enters a new context manager and adds its :meth:`~object.__exit__` method to the callback stack. The return value is the result of the context manager's own :meth:`~object.__enter__` method.
es_es: Introduce un nuevo gestor de contexto y añade su método :meth:`~object.__exit__` a la pila de retrollamadas. El valor de retorno es el resultado del propio método :meth:`~object.__enter__` del gestor de contexto.
pt_pt: Entra num novo gestor de contexto e adiciona o seu método :meth:`~object.__exit__` à pilha de callbacks. O valor de retorno é o resultado do método :meth:`~object.__enter__` do próprio gestor de contexto.

source: These context managers may suppress exceptions just as they normally would if used directly as part of a :keyword:`with` statement.
es_es: Estos gestores de contexto pueden suprimir excepciones del mismo modo que lo harían normalmente si se utilizaran directamente como parte de una sentencia :keyword:`with`.
pt_pt: Estes gestores de contexto podem suprimir exceções tal como normalmente fariam se usados diretamente como parte de uma instrução :keyword:`with`.

source: Raises :exc:`TypeError` instead of :exc:`AttributeError` if *cm* is not a context manager.
es_es: Lanza :exc:`TypeError` en lugar de :exc:`AttributeError` si *cm* no es un gestor de contexto.
pt_pt: Levanta :exc:`TypeError` em vez de :exc:`AttributeError` se *cm* não for um gestor de contexto.

source: Adds a context manager's :meth:`~object.__exit__` method to the callback stack.
es_es: Añade el método :meth:`~object.__exit__` de un gestor de contexto a la pila de retrollamadas.
pt_pt: Adiciona o método :meth:`~object.__exit__` de um gestor de contexto à pilha de callbacks.

source: As ``__enter__`` is *not* invoked, this method can be used to cover part of an :meth:`~object.__enter__` implementation with a context manager's own :meth:`~object.__exit__` method.
es_es: Dado que ``__enter__`` *no* se invoca, este método puede utilizarse para cubrir parte de una implementación de :meth:`~object.__enter__` con un método propio del gestor de contexto :meth:`~object.__exit__`.
pt_pt: Como ``__enter__`` *não* é invocado, este método pode ser usado para cobrir parte de uma implementação :meth:`~object.__enter__` com o método :meth:`~object.__exit__` de um gestor de contexto.

source: If passed an object that is not a context manager, this method assumes it is a callback with the same signature as a context manager's :meth:`~object.__exit__` method and adds it directly to the callback stack.
es_es: Si se le pasa un objeto que no es un gestor de contexto, este método asume que es una llamada de retorno con la misma firma que el método :meth:`~object.__exit__` de un gestor de contexto y lo añade directamente a la pila de llamadas de retorno.
pt_pt: Se for passado um objeto que não é um gestor de contexto, este método assume que é um callback com a mesma assinatura que o método :meth:`~object.__exit__` de um gestor de contexto e adiciona-o diretamente à pilha de callbacks.

source: By returning true values, these callbacks can suppress exceptions the same way context manager :meth:`~object.__exit__` methods can.
es_es: Al devolver valores verdaderos, estas retrollamadas pueden suprimir excepciones del mismo modo que los métodos del gestor de contexto :meth:`~object.__exit__`.
pt_pt: Ao devolver valores verdadeiros, estes callbacks podem suprimir exceções da mesma forma que os métodos :meth:`~object.__exit__` dos gestores de contexto.

source: The passed in object is returned from the function, allowing this method to be used as a function decorator.
es_es: La función devuelve el objeto introducido, lo que permite utilizar este método como un decorador de funciones.
pt_pt: O objeto passado é devolvido pela função, permitindo que este método seja usado como um decorador de função.

source: Accepts an arbitrary callback function and arguments and adds it to the callback stack.
es_es: Acepta una función de llamada de retorno arbitraria y argumentos y la añade a la pila de llamadas de retorno.
pt_pt: Aceita uma função de callback arbitrária e argumentos e adiciona-a à pilha de callbacks.

source: Unlike the other methods, callbacks added this way cannot suppress exceptions (as they are never passed the exception details).
es_es: A diferencia de los otros métodos, las retrollamadas añadidas de esta forma no pueden suprimir excepciones (ya que nunca se les pasan los detalles de la excepción).
pt_pt: Ao contrário dos outros métodos, os callbacks adicionados desta forma não podem suprimir exceções (uma vez que nunca recebem os detalhes da exceção).

source: The passed in callback is returned from the function, allowing this method to be used as a function decorator.
es_es: El callback pasado es devuelto por la función, permitiendo que este método sea utilizado como un decorador de funciones.
pt_pt: O callback passado é devolvido pela função, permitindo que este método seja usado como um decorador de função.

source: Transfers the callback stack to a fresh :class:`ExitStack` instance and returns it. No callbacks are invoked by this operation - instead, they will now be invoked when the new stack is closed (either explicitly or implicitly at the end of a :keyword:`with` statement).
es_es: Transfiere la pila de retrollamadas a una nueva instancia de :class:`ExitStack` y la devuelve. Esta operación no invoca ninguna llamada de retorno, sino que se invocarán cuando se cierre la nueva pila (ya sea explícita o implícitamente al final de una sentencia :keyword:`with` ).
pt_pt: Transfere a pilha de callbacks para uma nova instância :class:`ExitStack` e devolve-a. Nenhum callback é invocado por esta operação - em vez disso, serão agora invocados quando a nova pilha for fechada (explícita ou implicitamente no final de uma instrução :keyword:`with`).
