Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/contextlib.po
Languages: es_es, pt_pt

source: :mod:`!contextlib` --- Utilities for :keyword:`!with`\ -statement contexts
es_es: :mod:`!contextlib` --- Utilidades para :keyword:`!with`-contextos de declaración
pt_pt: :mod:`!contextlib` --- Utilitários para contextos de instruções :keyword:`!with`

source: **Source code:** :source:`Lib/contextlib.py`
es_es: **Código fuente:** :source:`Lib/contextlib.py`
pt_pt: **Código-fonte:** :source:`Lib/contextlib.py`

source: This module provides utilities for common tasks involving the :keyword:`with` statement. For more information see also :ref:`typecontextmanager` and :ref:`context-managers`.
es_es: Este módulo proporciona utilidades para tareas comunes relacionadas con la sentencia :keyword:`with`. Para más información, consulte también :ref:`typecontextmanager` y :ref:`context-managers`.
pt_pt: Este módulo fornece utilitários para tarefas comuns envolvendo a instrução :keyword:`with`. Para mais informações, veja também :ref:`typecontextmanager` e :ref:`context-managers`.

source: Utilities
es_es: Utilidades
pt_pt: Utilitários

source: Functions and classes provided:
es_es: Funciones y clases impartidas:
pt_pt: Funções e classes fornecidas:

source: An :term:`abstract base class` for classes that implement :meth:`object.__enter__` and :meth:`object.__exit__`. A default implementation for :meth:`object.__enter__` is provided which returns ``self`` while :meth:`object.__exit__` is an abstract method which by default returns ``None``. See also the definition of :ref:`typecontextmanager`.
es_es: Una :term:`abstract base class` para clases que implementan :meth:`object.__enter__` y :meth:`object.__exit__`. Se proporciona una implementación por defecto para :meth:`object.__enter__` que devuelve ``self`` mientras que :meth:`object.__exit__` es un método abstracto que por defecto devuelve ``None``. Ver también la definición de :ref:`typecontextmanager`.
pt_pt: Uma :term:`classe base abstrata` para classes que implementam :meth:`object.__enter__` e :meth:`object.__exit__`. Uma implementação predefinida para :meth:`object.__enter__` é fornecida, que devolve ``self``, enquanto :meth:`object.__exit__` é um método abstrato que, por predefinição, devolve ``None``. Veja também a definição de :ref:`typecontextmanager`.

source: An :term:`abstract base class` for classes that implement :meth:`object.__aenter__` and :meth:`object.__aexit__`. A default implementation for :meth:`object.__aenter__` is provided which returns ``self`` while :meth:`object.__aexit__` is an abstract method which by default returns ``None``. See also the definition of :ref:`async-context-managers`.
es_es: Una :term:`abstract base class` para clases que implementan :meth:`object.__aenter__` y :meth:`object.__aexit__`. Se proporciona una implementación por defecto para :meth:`object.__aenter__` que devuelve ``self`` mientras que :meth:`object.__aexit__` es un método abstracto que por defecto devuelve ``None``. Ver también la definición de :ref:`async-context-managers`.
pt_pt: Uma :term:`classe base abstrata` para classes que implementam :meth:`object.__aenter__` e :meth:`object.__aexit__`. Uma implementação predefinida para :meth:`object.__aenter__` é fornecida, que devolve ``self``, enquanto :meth:`object.__aexit__` é um método abstrato que, por predefinição, devolve ``None``. Veja também a definição de :ref:`async-context-managers`.

source: This function is a :term:`decorator` that can be used to define a factory function for :keyword:`with` statement context managers, without needing to create a class or separate :meth:`~object.__enter__` and :meth:`~object.__exit__` methods.
es_es: Esta función es un :term:`decorator` que puede utilizarse para definir una función de fábrica para los gestores de contexto de sentencia :keyword:`with`, sin necesidad de crear una clase o métodos separados :meth:`~object.__enter__` y :meth:`~object.__exit__`.
pt_pt: Esta função é um :term:`decorador` que pode ser usado para definir uma função de fábrica para gestores de contexto de instruções :keyword:`with`, sem necessidade de criar uma classe ou métodos separados :meth:`~object.__enter__` e :meth:`~object.__exit__`.

source: While many objects natively support use in with statements, sometimes a resource needs to be managed that isn't a context manager in its own right, and doesn't implement a ``close()`` method for use with ``contextlib.closing``.
pt_pt: Embora muitos objetos suportem nativamente o uso em instruções with, às vezes é necessário gerir um recurso que não é um gestor de contexto por si só e não implementa um método ``close()`` para uso com ``contextlib.closing``.

source: An abstract example would be the following to ensure correct resource management::
es_es: Un ejemplo abstracto sería el siguiente para garantizar la correcta gestión de los recursos::
pt_pt: Um exemplo abstrato seria o seguinte para garantir a gestão correta de recursos::

source: from contextlib import contextmanager @contextmanager def managed_resource(*args, **kwds): # Code to acquire resource, e.g.: resource = acquire_resource(*args, **kwds) try: yield resource finally: # Code to release resource, e.g.: release_resource(resource)
es_es: from contextlib import contextmanager @gestor_contexto def recurso_gestionado(*args, **kwds): # Código para adquirir el recurso, por ejemplo resource = acquire_resource(*args, **kwds) try: yield resource finally: # Código para liberar el recurso, por ejemplo release_resource(resource)
pt_pt: from contextlib import contextmanager @contextmanager def managed_resource(*args, **kwds): # Código para adquirir recurso, por exemplo: resource = acquire_resource(*args, **kwds) try: yield resource finally: # Código para libertar recurso, por exemplo: release_resource(resource)

source: The function can then be used like this::
es_es: La función se puede utilizar así::
pt_pt: A função pode então ser usada assim::

source: >>> with managed_resource(timeout=3600) as resource: ... # Resource is released at the end of this block, ... # even if code in the block raises an exception
es_es: >>> with managed_resource(timeout=3600) as resource: ... # El recurso se libera al final de este bloque, ... # incluso si el código del bloque lanza una excepción
pt_pt: >>> with managed_resource(timeout=3600) as resource: ... # O recurso é libertado no final deste bloco, ... # mesmo que o código no bloco levante uma exceção

source: The function being decorated must return a :term:`generator`-iterator when called. This iterator must yield exactly one value, which will be bound to the targets in the :keyword:`with` statement's :keyword:`!as` clause, if any.
es_es: La función decorada debe devolver un term:`generator`-iterator cuando se llame. Este iterador debe producir exactamente un valor, que se vinculará a los objetivos de la cláusula :keyword:`!as` de la sentencia :keyword:`with`, si existe.
pt_pt: A função decorada deve devolver um iterador :term:`gerador` quando chamada. Este iterador deve produzir exatamente um valor, que será ligado aos alvos na cláusula :keyword:`!as` da instrução :keyword:`with`, se houver.

source: At the point where the generator yields, the block nested in the :keyword:`with` statement is executed. The generator is then resumed after the block is exited. If an unhandled exception occurs in the block, it is reraised inside the generator at the point where the yield occurred. Thus, you can use a :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` statement to trap the error (if any), or ensure that some cleanup takes place. If an exception is trapped merely in order to log it or to perform some action (rather than to suppress it entirely), the generator must reraise that exception. Otherwise the generator context manager will indicate to the :keyword:`!with` statement that the exception has been handled, and execution will resume with the statement immediately following the :keyword:`!with` statement.
es_es: En el punto en el que el generador cede, se ejecuta el bloque anidado en la sentencia :keyword:`with`. El generador se reanuda después de salir del bloque. Si se produce una excepción no controlada en el bloque, se vuelve a lanzar dentro del generador en el punto en el que se produjo el rendimiento. Así, puede utilizar una sentencia :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` para atrapar el error (si lo hay), o asegurarse de que se produce alguna limpieza. Si se atrapa una excepción simplemente para registrarla o para realizar alguna acción (en lugar de suprimirla por completo), el generador debe volver a lanzar esa excepción. En caso contrario, el gestor de contexto del generador indicará a la sentencia :keyword:`!with` que la excepción ha sido tratada, y la ejecución se reanudará con la sentencia inmediatamente posterior a la sentencia :keyword:`!with`.
pt_pt: No ponto em que o gerador produz, o bloco aninhado na instrução :keyword:`with` é executado. O gerador é então retomado após o bloco ser saído. Se uma exceção não tratada ocorrer no bloco, é relançada dentro do gerador no ponto em que o yield ocorreu. Assim, pode usar uma instrução :keyword:`try`... :keyword:`except`... :keyword:`finally` para capturar o erro (se houver), ou garantir que alguma limpeza seja feita. Se uma exceção for capturada apenas para a registar ou para realizar alguma ação (em vez de a suprimir totalmente), o gerador deve relançar essa exceção. Caso contrário, o gestor de contexto do gerador indicará à instrução :keyword:`!with` que a exceção foi tratada, e a execução será retomada com a instrução imediatamente seguinte à instrução :keyword:`!with`.

source: :func:`contextmanager` uses :class:`ContextDecorator` so the context managers it creates can be used as decorators as well as in :keyword:`with` statements. When used as a decorator, a new generator instance is implicitly created on each function call (this allows the otherwise "one-shot" context managers created by :func:`contextmanager` to meet the requirement that context managers support multiple invocations in order to be used as decorators).
es_es: :func:`contextmanager` utiliza :class:`ContextDecorator` para que los gestores de contexto que crea puedan utilizarse como decoradores, así como en las sentencias de :keyword:`with`. Cuando se utiliza como decorador, se crea implícitamente una nueva instancia de generador en cada llamada a función (esto permite que los gestores de contexto creados por :func:`contextmanager`, que de otro modo serían "de un solo uso", cumplan el requisito de que los gestores de contexto admitan múltiples invocaciones para poder utilizarse como decoradores).
pt_pt: :func:`contextmanager` usa :class:`ContextDecorator`, de modo que os gestores de contexto que cria podem ser usados como decoradores, bem como em instruções :keyword:`with`. Quando usado como decorador, uma nova instância de gerador é implicitamente criada em cada chamada de função (isto permite que os gestores de contexto "de uso único" criados por :func:`contextmanager` cumpram o requisito de que os gestores de contexto suportem múltiplas invocações para serem usados como decoradores).

source: Use of :class:`ContextDecorator`.
es_es: Utilización de :class:`ContextDecorator`.
pt_pt: Uso de :class:`ContextDecorator`.

source: Similar to :func:`~contextlib.contextmanager`, but creates an :ref:`asynchronous context manager <async-context-managers>`.
es_es: Similar a :func:`~contextlib.contextmanager`, pero crea un :ref:`asynchronous context manager <async-context-managers>`.
pt_pt: Semelhante a :func:`~contextlib.contextmanager`, mas cria um :ref:`gestor de contexto assíncrono <async-context-managers>`.

source: This function is a :term:`decorator` that can be used to define a factory function for :keyword:`async with` statement asynchronous context managers, without needing to create a class or separate :meth:`~object.__aenter__` and :meth:`~object.__aexit__` methods. It must be applied to an :term:`asynchronous generator` function.
es_es: Esta función es un :term:`decorator` que puede utilizarse para definir una función de fábrica para gestores de contexto asíncronos de sentencia :keyword:`async with`, sin necesidad de crear una clase o métodos separados :meth:`~object.__aenter__` y :meth:`~object.__aexit__`. Debe aplicarse a una función :term:`asynchronous generator`.
pt_pt: Esta função é um :term:`decorador` que pode ser usado para definir uma função de fábrica para gestores de contexto assíncronos de instruções :keyword:`async with`, sem necessidade de criar uma classe ou métodos separados :meth:`~object.__aenter__` e :meth:`~object.__aexit__`. Deve ser aplicada a uma função :term:`gerador assíncrono`.

source: A simple example::
es_es: Un ejemplo sencillo::
pt_pt: Um exemplo simples::

source: Context managers defined with :func:`asynccontextmanager` can be used either as decorators or with :keyword:`async with` statements::
es_es: Los gestores de contexto definidos con :func:`asynccontextmanager` pueden utilizarse como decoradores o con declaraciones :keyword:`async with`::
pt_pt: Os gestores de contexto definidos com :func:`asynccontextmanager` podem ser usados como decoradores ou com instruções :keyword:`async with`::

source: import time from contextlib import asynccontextmanager @asynccontextmanager async def timeit(): now = time.monotonic() try: yield finally: print(f'it took {time.monotonic() - now}s to run') @timeit() async def main(): # ... async code ...
es_es: import time from contextlib import asynccontextmanager @asynccontextmanager async def timeit(): now = time.monotonic() try: yield finally: print(f'it took {time.monotonic() - now}s to run') @timeit() async def main(): # ... código asíncrono ...
pt_pt: import time from contextlib import asynccontextmanager @asynccontextmanager async def timeit(): now = time.monotonic() try: yield finally: print(f'it took {time.monotonic() - now}s to run') @timeit() async def main(): # ... código assíncrono ...

source: When used as a decorator, a new generator instance is implicitly created on each function call. This allows the otherwise "one-shot" context managers created by :func:`asynccontextmanager` to meet the requirement that context managers support multiple invocations in order to be used as decorators.
es_es: Cuando se utiliza como decorador, se crea implícitamente una nueva instancia del generador en cada llamada a la función. Esto permite que los gestores de contexto creados por :func:`asynccontextmanager`, que de otro modo serían "de un solo uso", cumplan el requisito de que los gestores de contexto admitan múltiples invocaciones para poder utilizarse como decoradores.
pt_pt: Quando usado como decorador, uma nova instância de gerador é implicitamente criada em cada chamada de função. Isto permite que os gestores de contexto "de uso único" criados por :func:`asynccontextmanager` cumpram o requisito de que os gestores de contexto suportem múltiplas invocações para serem usados como decoradores.

source: Async context managers created with :func:`asynccontextmanager` can be used as decorators.
es_es: Los gestores de contexto asíncronos creados con :func:`asynccontextmanager` pueden utilizarse como decoradores.
pt_pt: Os gestores de contexto assíncronos criados com :func:`asynccontextmanager` podem ser usados como decoradores.

source: Return a context manager that closes *thing* upon completion of the block. This is basically equivalent to::
es_es: Devuelve un gestor de contexto que cierra *thing* al finalizar el bloque. Esto básicamente equivale a::
pt_pt: Devolve um gestor de contexto que fecha *thing* após a conclusão do bloco. Isto é basicamente equivalente a::

source: And lets you write code like this::
es_es: Y permite escribir código como este::
pt_pt: E permite escrever código como este::

source: without needing to explicitly close ``page``. Even if an error occurs, ``page.close()`` will be called when the :keyword:`with` block is exited.
es_es: sin necesidad de cerrar explícitamente ``page``. Aunque se produzca un error, se llamará a ``page.close()`` cuando se salga del bloque :keyword:`with`.
pt_pt: sem necessidade de fechar explicitamente ``page``. Mesmo que ocorra um erro, ``page.close()`` será chamado quando o bloco :keyword:`with` for saído.

source: Most types managing resources support the :term:`context manager` protocol, which closes *thing* on leaving the :keyword:`with` statement. As such, :func:`!closing` is most useful for third party types that don't support context managers. This example is purely for illustration purposes, as :func:`~urllib.request.urlopen` would normally be used in a context manager.
es_es: La mayoría de los tipos que gestionan recursos soportan el protocolo :term:`context manager`, que cierra *thing* al salir de la sentencia :keyword:`with`. Como tal, :func:`!closing` es más útil para tipos de terceros que no soportan gestores de contexto. Este ejemplo es puramente ilustrativo, ya que :func:`~urllib.request.urlopen` se utilizaría normalmente en un gestor de contexto.
pt_pt: A maioria dos tipos que gerem recursos suportam o protocolo :term:`gestor de contexto`, que fecha *thing* ao sair da instrução :keyword:`with`. Como tal, :func:`!closing` é mais útil para tipos de terceiros que não suportam gestores de contexto. Este exemplo é apenas para fins de ilustração, já que :func:`~urllib.request.urlopen` normalmente seria usado num gestor de contexto.

source: Return an async context manager that calls the ``aclose()`` method of *thing* upon completion of the block. This is basically equivalent to::
es_es: Devuelve un gestor de contexto asíncrono que llama al método ``aclose()`` de *thing* al finalizar el bloque. Esto es básicamente equivalente a::
pt_pt: Devolve um gestor de contexto assíncrono que chama o método ``aclose()`` de *thing* após a conclusão do bloco. Isto é basicamente equivalente a::

source: Significantly, ``aclosing()`` supports deterministic cleanup of async generators when they happen to exit early by :keyword:`break` or an exception. For example::
es_es: Significativamente, ``aclosing()`` soporta la limpieza determinista de generadores asíncronos cuando salen antes de tiempo por :keyword:`break` o una excepción. Por ejemplo::
pt_pt: Significativamente, ``aclosing()`` suporta limpeza determinística de geradores assíncronos quando saem antecipadamente por :keyword:`break` ou uma exceção. Por exemplo::

source: This pattern ensures that the generator's async exit code is executed in the same context as its iterations (so that exceptions and context variables work as expected, and the exit code isn't run after the lifetime of some task it depends on).
es_es: Este patrón garantiza que el código de salida asíncrono del generador se ejecute en el mismo contexto que sus iteraciones (de modo que las excepciones y las variables de contexto funcionen como se espera, y que el código de salida no se ejecute después del tiempo de vida de alguna tarea de la que dependa).
pt_pt: Este padrão garante que o código de saída assíncrono do gerador é executado no mesmo contexto que as suas iterações (para que exceções e variáveis de contexto funcionem como esperado, e o código de saída não seja executado após o tempo de vida de alguma tarefa da qual depende).

source: Return a context manager that returns *enter_result* from ``__enter__``, but otherwise does nothing. It is intended to be used as a stand-in for an optional context manager, for example::
es_es: Devuelve un gestor de contexto que devuelve *enter_result* de ``__enter__``, pero por lo demás no hace nada. Está pensado para ser utilizado como sustituto de un gestor de contexto opcional, por ejemplo::
pt_pt: Devolve um gestor de contexto que devolve *enter_result* de ``__enter__``, mas que, de resto, não faz nada. Destina-se a ser usado como substituto para um gestor de contexto opcional, por exemplo::

source: def myfunction(arg, ignore_exceptions=False): if ignore_exceptions: # Use suppress to ignore all exceptions. cm = contextlib.suppress(Exception) else: # Do not ignore any exceptions, cm has no effect. cm = contextlib.nullcontext() with cm: # Do something
es_es: def mifuncion(arg, ignorar_excepciones=False): if ignore_exceptions: # Usa suppress para ignorar todas las excepciones. cm = contextlib.suppress(Exception) else: # No ignorar ninguna excepción, cm no tiene efecto. cm = contextlib.nullcontext() with cm: # Hacer algo
pt_pt: def myfunction(arg, ignore_exceptions=False): if ignore_exceptions: # Usar suppress para ignorar todas as exceções. cm = contextlib.suppress(Exception) else: # Não ignorar quaisquer exceções, cm não tem efeito. cm = contextlib.nullcontext() with cm: # Fazer algo

source: An example using *enter_result*::
es_es: Un ejemplo utilizando *enter_result*::
pt_pt: Um exemplo usando *enter_result*::

source: def process_file(file_or_path): if isinstance(file_or_path, str): # If string, open file cm = open(file_or_path) else: # Caller is responsible for closing file cm = nullcontext(file_or_path) with cm as file: # Perform processing on the file
es_es: def process_file(file_or_path): if isinstance(file_or_path, str): # Si es cadena, abrir archivo cm = open(file_or_path) else: # El llamante es responsable de cerrar el archivo cm = nullcontext(file_or_path) with cm as file:: # Realizar el procesamiento en el archivo
pt_pt: def process_file(file_or_path): if isinstance(file_or_path, str): # Se for string, abrir ficheiro cm = open(file_or_path) else: # O chamador é responsável por fechar o ficheiro cm = nullcontext(file_or_path) with cm as file: # Realizar processamento no ficheiro

source: It can also be used as a stand-in for :ref:`asynchronous context managers <async-context-managers>`::
es_es: También puede utilizarse como sustituto de :ref:`asynchronous context managers <async-context-managers>`::
pt_pt: Também pode ser usado como substituto para :ref:`gestores de contexto assíncronos <async-context-managers>`::

source: async def send_http(session=None): if not session: # If no http session, create it with aiohttp cm = aiohttp.ClientSession() else: # Caller is responsible for closing the session cm = nullcontext(session) async with cm as session: # Send http requests with session
es_es: async def send_http(session=None): if not session: # Si no hay sesión http, crearla con aiohttp cm = aiohttp.ClientSession() else: # El llamante es responsable de cerrar la sesión cm = nullcontext(session) async with cm as session: # Enviar peticiones http con sesión
pt_pt: async def send_http(session=None): if not session: # Se não houver sessão http, criar com aiohttp cm = aiohttp.ClientSession() else: # O chamador é responsável por fechar a sessão cm = nullcontext(session) async with cm as session: # Enviar pedidos http com a sessão

source: :term:`asynchronous context manager` support was added.
es_es: Se ha añadido soporte para :term:`asynchronous context manager`.
pt_pt: Foi adicionado suporte para :term:`gestor de contexto assíncrono`.

source: Return a context manager that suppresses any of the specified exceptions if they occur in the body of a :keyword:`!with` statement and then resumes execution with the first statement following the end of the :keyword:`!with` statement.
es_es: Devuelve un gestor de contexto que suprime cualquiera de las excepciones especificadas si se producen en el cuerpo de una sentencia :keyword:`!with` y, a continuación, reanuda la ejecución con la primera sentencia que sigue al final de la sentencia :keyword:`!with`.
pt_pt: Devolve um gestor de contexto que suprime quaisquer das exceções especificadas se ocorrerem no corpo de uma instrução :keyword:`!with` e, em seguida, retoma a execução com a primeira instrução seguinte ao final da instrução :keyword:`!with`.
