Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/contextlib.po
Languages: es_es, pt_pt

source: For example, a group of files can be opened as an "all or nothing" operation as follows::
es_es: Por ejemplo, un grupo de archivos puede abrirse como una operación "todo o nada" de la siguiente manera::
pt_pt: Por exemplo, um grupo de ficheiros pode ser aberto como uma operação "tudo ou nada" da seguinte forma::

source: with ExitStack() as stack: files = [stack.enter_context(open(fname)) for fname in filenames] # Hold onto the close method, but don't call it yet. close_files = stack.pop_all().close # If opening any file fails, all previously opened files will be # closed automatically. If all files are opened successfully, # they will remain open even after the with statement ends. # close_files() can then be invoked explicitly to close them all.
es_es: with ExitStack() as stack: files = [stack.enter_context(open(fname)) for fname in filenames] # Espera al método close, pero no lo llames todavía. close_files = stack.pop_all().close # Si la apertura de cualquier archivo falla, todos los archivos abiertos previamente serán # cerrados automáticamente. Si todos los archivos se abren con éxito, # permanecerán abiertos incluso después de que la sentencia with termine. # close_files() puede ser invocada explícitamente para cerrarlos todos.
pt_pt: with ExitStack() as stack: files = [stack.enter_context(open(fname)) for fname in filenames] # Manter o método close, mas não o chamar ainda. close_files = stack.pop_all().close # Se a abertura de qualquer ficheiro falhar, todos os ficheiros abertos anteriormente serão # fechados automaticamente. Se todos os ficheiros forem abertos com sucesso, # permanecerão abertos mesmo após o término da instrução with. # close_files() pode então ser invocado explicitamente para os fechar todos.

source: Immediately unwinds the callback stack, invoking callbacks in the reverse order of registration. For any context managers and exit callbacks registered, the arguments passed in will indicate that no exception occurred.
es_es: Despliega inmediatamente la pila de retrollamadas, invocando las retrollamadas en el orden inverso al registro. Para cualquier gestor de contexto y retrollamada de salida registrados, los argumentos pasados indicarán que no se ha producido ninguna excepción.
pt_pt: Desempilha imediatamente a pilha de callbacks, invocando callbacks na ordem inversa do registo. Para quaisquer gestores de contexto e callbacks de saída registados, os argumentos passados indicarão que nenhuma exceção ocorreu.

source: An :ref:`asynchronous context manager <async-context-managers>`, similar to :class:`ExitStack`, that supports combining both synchronous and asynchronous context managers, as well as having coroutines for cleanup logic.
es_es: Un :ref:`asynchronous context manager <async-context-managers>`, similar a :class:`ExitStack`, que soporta la combinación de gestores de contexto síncronos y asíncronos, además de tener coroutines para la lógica de limpieza.
pt_pt: Um :ref:`gestor de contexto assíncrono <async-context-managers>`, semelhante a :class:`ExitStack`, que suporta a combinação de gestores de contexto síncronos e assíncronos, bem como ter corrotinas para lógica de limpeza.

source: The :meth:`~ExitStack.close` method is not implemented; :meth:`aclose` must be used instead.
es_es: El método :meth:`~ExitStack.close` no está implementado; en su lugar debe utilizarse :meth:`aclose`.
pt_pt: O método :meth:`~ExitStack.close` não está implementado; deve ser usado :meth:`aclose` em vez disso.

source: Similar to :meth:`ExitStack.enter_context` but expects an asynchronous context manager.
es_es: Similar a :meth:`ExitStack.enter_context` pero espera un gestor de contexto asíncrono.
pt_pt: Semelhante a :meth:`ExitStack.enter_context`, mas espera um gestor de contexto assíncrono.

source: Raises :exc:`TypeError` instead of :exc:`AttributeError` if *cm* is not an asynchronous context manager.
es_es: Lanza :exc:`TypeError` en lugar de :exc:`AttributeError` si *cm* no es un gestor de contexto asíncrono.
pt_pt: Levanta :exc:`TypeError` em vez de :exc:`AttributeError` se *cm* não for um gestor de contexto assíncrono.

source: Similar to :meth:`ExitStack.push` but expects either an asynchronous context manager or a coroutine function.
es_es: Similar a :meth:`ExitStack.push` pero espera un gestor de contexto asíncrono o una función de corrutina.
pt_pt: Semelhante a :meth:`ExitStack.push`, mas espera um gestor de contexto assíncrono ou uma função de corrotina.

source: Similar to :meth:`ExitStack.callback` but expects a coroutine function.
es_es: Similar a :meth:`ExitStack.callback` pero espera una función corrutina.
pt_pt: Semelhante a :meth:`ExitStack.callback`, mas espera uma função de corrotina.

source: Similar to :meth:`ExitStack.close` but properly handles awaitables.
es_es: Similar a :meth:`ExitStack.close` pero maneja correctamente awaitables.
pt_pt: Semelhante a :meth:`ExitStack.close`, mas trata corretamente awaitables.

source: Continuing the example for :func:`asynccontextmanager`::
es_es: Continuando con el ejemplo de :func:`asynccontextmanager`::
pt_pt: Continuando o exemplo para :func:`asynccontextmanager`::

source: async with AsyncExitStack() as stack: connections = [await stack.enter_async_context(get_connection()) for i in range(5)] # All opened connections will automatically be released at the end of # the async with statement, even if attempts to open a connection # later in the list raise an exception.
es_es: async with AsyncExitStack() as stack: connections = [await stack.enter_async_context(get_connection()) for i in range(5)] # Todas las conexiones abiertas se liberarán automáticamente al final de # la sentencia async with, incluso si los intentos de abrir una conexión # más adelante en la lista lanzan una excepción.
pt_pt: async with AsyncExitStack() as stack: connections = [await stack.enter_async_context(get_connection()) for i in range(5)] # Todas as ligações abertas serão automaticamente libertadas no final # da instrução async with, mesmo que tentativas de abrir uma ligação # mais tarde na lista levantem uma exceção.

source: Examples and Recipes
es_es: Ejemplos y recetas
pt_pt: Exemplos e Receitas

source: This section describes some examples and recipes for making effective use of the tools provided by :mod:`contextlib`.
es_es: En esta sección se describen algunos ejemplos y recetas para utilizar eficazmente las herramientas que ofrece :mod:`contextlib`.
pt_pt: Esta secção descreve alguns exemplos e receitas para fazer uso efetivo das ferramentas fornecidas por :mod:`contextlib`.

source: Supporting a variable number of context managers
es_es: Admite un número variable de gestores de contexto
pt_pt: Suportar um número variável de gestores de contexto

source: The primary use case for :class:`ExitStack` is the one given in the class documentation: supporting a variable number of context managers and other cleanup operations in a single :keyword:`with` statement. The variability may come from the number of context managers needed being driven by user input (such as opening a user specified collection of files), or from some of the context managers being optional::
es_es: El principal caso de uso de :class:`ExitStack` es el que se indica en la documentación de la clase: admitir un número variable de gestores de contexto y otras operaciones de limpieza en una única sentencia :keyword:`with`. La variabilidad puede deberse a que el número de gestores de contexto necesarios depende de la entrada del usuario (como abrir una colección de archivos especificada por el usuario), o a que algunos de los gestores de contexto son opcionales::
pt_pt: O caso de uso primário para :class:`ExitStack` é o dado na documentação da classe: suportar um número variável de gestores de contexto e outras operações de limpeza numa única instrução :keyword:`with`. A variabilidade pode vir do número de gestores de contexto necessários ser determinado pela entrada do utilizador (como abrir uma coleção de ficheiros especificada pelo utilizador), ou de alguns dos gestores de contexto serem opcionais::

source: with ExitStack() as stack: for resource in resources: stack.enter_context(resource) if need_special_resource(): special = acquire_special_resource() stack.callback(release_special_resource, special) # Perform operations that use the acquired resources
es_es: with ExitStack() as stack: for resource in resources: stack.enter_context(resource) if need_special_resource(): special = acquire_special_resource() stack.callback(release_special_resource, special) # Realizar operaciones que utilicen los recursos adquiridos
pt_pt: with ExitStack() as stack: for resource in resources: stack.enter_context(resource) if need_special_resource(): special = acquire_special_resource() stack.callback(release_special_resource, special) # Realizar operações que usam os recursos adquiridos

source: As shown, :class:`ExitStack` also makes it quite easy to use :keyword:`with` statements to manage arbitrary resources that don't natively support the context management protocol.
es_es: Como se muestra, :class:`ExitStack` también facilita bastante el uso de las sentencias :keyword:`with` para gestionar recursos arbitrarios que no soportan de forma nativa el protocolo de gestión de contextos.
pt_pt: Como mostrado, :class:`ExitStack` também torna bastante fácil usar instruções :keyword:`with` para gerir recursos arbitrários que não suportam nativamente o protocolo de gestão de contexto.

source: Catching exceptions from ``__enter__`` methods
es_es: Captura de excepciones de los métodos de ``__enter__``
pt_pt: Capturar exceções de métodos ``__enter__``

source: It is occasionally desirable to catch exceptions from an ``__enter__`` method implementation, *without* inadvertently catching exceptions from the :keyword:`with` statement body or the context manager's ``__exit__`` method. By using :class:`ExitStack` the steps in the context management protocol can be separated slightly in order to allow this::
es_es: Ocasionalmente es deseable capturar excepciones de la implementación de un método ``__enter__``, *sin* capturar inadvertidamente excepciones del cuerpo de la sentencia :keyword:`with` o del método ``__exit__`` del gestor de contexto. Usando :class:`ExitStack` los pasos del protocolo de gestión de contexto pueden separarse ligeramente para permitir esto::
pt_pt: Às vezes é desejável capturar exceções de uma implementação de método ``__enter__``, *sem* capturar inadvertidamente exceções do corpo da instrução :keyword:`with` ou do método ``__exit__`` do gestor de contexto. Ao usar :class:`ExitStack`, os passos no protocolo de gestão de contexto podem ser separados ligeiramente para permitir isto::

source: stack = ExitStack() try: x = stack.enter_context(cm) except Exception: # handle __enter__ exception else: with stack: # Handle normal case
es_es: stack = ExitStack() try: x = stack.enter_context(cm) except Exception: # handle __enter__ exception else: with stack: # Manejar caso normal
pt_pt: stack = ExitStack() try: x = stack.enter_context(cm) except Exception: # tratar exceção __enter__ else: with stack: # Tratar caso normal

source: Actually needing to do this is likely to indicate that the underlying API should be providing a direct resource management interface for use with :keyword:`try`/:keyword:`except`/:keyword:`finally` statements, but not all APIs are well designed in that regard. When a context manager is the only resource management API provided, then :class:`ExitStack` can make it easier to handle various situations that can't be handled directly in a :keyword:`with` statement.
es_es: Es probable que la necesidad real de hacer esto indique que la API subyacente debería proporcionar una interfaz directa de gestión de recursos para su uso con sentencias :keyword:`try`/:keyword:`except`/:keyword:`finally`, pero no todas las API están bien diseñadas en ese sentido. Cuando un gestor de contexto es la única API de gestión de recursos proporcionada, entonces :class:`ExitStack` puede facilitar el manejo de varias situaciones que no se pueden manejar directamente en una sentencia :keyword:`with`.
pt_pt: Na verdade, a necessidade de fazer isto é provável que indique que a API subjacente deveria fornecer uma interface de gestão de recursos direta para uso com instruções :keyword:`try`/:keyword:`except`/:keyword:`finally`, mas nem todas as APIs são bem concebidas nesse aspeto. Quando um gestor de contexto é a única API de gestão de recursos fornecida, então :class:`ExitStack` pode facilitar o tratamento de várias situações que não podem ser tratadas diretamente numa instrução :keyword:`with`.

source: Cleaning up in an ``__enter__`` implementation
es_es: Limpieza en una aplicación ``__enter__``
pt_pt: Limpeza numa implementação ``__enter__``

source: As noted in the documentation of :meth:`ExitStack.push`, this method can be useful in cleaning up an already allocated resource if later steps in the :meth:`~object.__enter__` implementation fail.
es_es: Como se indica en la documentación de :meth:`ExitStack.push`, este método puede ser útil para limpiar un recurso ya asignado si fallan pasos posteriores en la implementación de :meth:`~object.__enter__`.
pt_pt: Como observado na documentação de :meth:`ExitStack.push`, este método pode ser útil na limpeza de um recurso já alocado se passos posteriores na implementação :meth:`~object.__enter__` falharem.

source: Here's an example of doing this for a context manager that accepts resource acquisition and release functions, along with an optional validation function, and maps them to the context management protocol::
es_es: He aquí un ejemplo de cómo hacerlo para un gestor de contextos que acepta funciones de adquisición y liberación de recursos, junto con una función de validación opcional, y las asigna al protocolo de gestión de contextos::
pt_pt: Aqui está um exemplo de como fazer isto para um gestor de contexto que aceita funções de aquisição e libertação de recursos, juntamente com uma função de validação opcional, e as mapeia para o protocolo de gestão de contexto::

source: from contextlib import contextmanager, AbstractContextManager, ExitStack class ResourceManager(AbstractContextManager): def __init__(self, acquire_resource, release_resource, check_resource_ok=None): self.acquire_resource = acquire_resource self.release_resource = release_resource if check_resource_ok is None: def check_resource_ok(resource): return True self.check_resource_ok = check_resource_ok @contextmanager def _cleanup_on_error(self): with ExitStack() as stack: stack.push(self) yield # The validation check passed and didn't raise an exception # Accordingly, we want to keep the resource, and pass it # back to our caller stack.pop_all() def __enter__(self): resource = self.acquire_resource() with self._cleanup_on_error(): if not self.check_resource_ok(resource): msg = "Failed validation for {!r}" raise RuntimeError(msg.format(resource)) return resource def __exit__(self, *exc_details): # We don't need to duplicate any of our resource release logic self.release_resource()
es_es: from contextlib import contextmanager, AbstractContextManager, ExitStack class ResourceManager(AbstractContextManager): def __init__(self, acquire_resource, release_resource, check_resource_ok=None): self.acquire_resource = acquire_resource self.release_resource = release_resource if check_resource_ok is None: def check_resource_ok(resource): return True self.check_resource_ok = check_resource_ok @contextmanager def _cleanup_on_error(self): with ExitStack() as stack: stack.push(self) yield # La comprobación de validación ha pasado y no ha lanzado una excepción # En consecuencia, queremos mantener el recurso, y pasarlo # a nuestro invocador stack.pop_all() def __enter__(self): resource = self.acquire_resource() with self._cleanup_on_error(): if not self.check_resource_ok(resource): msg = "Failed validation for {!r}" raise RuntimeError(msg.format(resource)) return resource def __exit__(self, *exc_details): # No necesitamos duplicar nada de nuestra lógica de liberación de recursos self.release_resource()
pt_pt: from contextlib import contextmanager, AbstractContextManager, ExitStack class ResourceManager(AbstractContextManager): def __init__(self, acquire_resource, release_resource, check_resource_ok=None): self.acquire_resource = acquire_resource self.release_resource = release_resource if check_resource_ok is None: def check_resource_ok(resource): return True self.check_resource_ok = check_resource_ok @contextmanager def _cleanup_on_error(self): with ExitStack() as stack: stack.push(self) yield # A verificação de validação passou e não levantou uma exceção # Consequentemente, queremos manter o recurso e passá-lo # de volta ao nosso chamador stack.pop_all() def __enter__(self): resource = self.acquire_resource() with self._cleanup_on_error(): if not self.check_resource_ok(resource): msg = "Failed validation for {!r}" raise RuntimeError(msg.format(resource)) return resource def __exit__(self, *exc_details): # Não precisamos de duplicar qualquer lógica de libertação de recursos self.release_resource()

source: Replacing any use of ``try-finally`` and flag variables
pt_pt: Substituir qualquer uso de ``try-finally`` e variáveis de flag

source: A pattern you will sometimes see is a ``try-finally`` statement with a flag variable to indicate whether or not the body of the ``finally`` clause should be executed. In its simplest form (that can't already be handled just by using an ``except`` clause instead), it looks something like this::
pt_pt: Um padrão que às vezes verá é uma instrução ``try-finally`` com uma variável de flag para indicar se o corpo da cláusula ``finally`` deve ou não ser executado. Na sua forma mais simples (que não pode já ser tratada apenas usando uma cláusula ``except`` em vez disso), parece algo como isto::

source: As with any ``try`` statement based code, this can cause problems for development and review, because the setup code and the cleanup code can end up being separated by arbitrarily long sections of code.
pt_pt: Como com qualquer código baseado em instruções ``try``, isto pode causar problemas para desenvolvimento e revisão, porque o código de configuração e o código de limpeza podem acabar separados por secções de código arbitrariamente longas.

source: :class:`ExitStack` makes it possible to instead register a callback for execution at the end of a ``with`` statement, and then later decide to skip executing that callback::
pt_pt: :class:`ExitStack` torna possível registar um callback para execução no final de uma instrução ``with``, e depois decidir mais tarde ignorar a execução desse callback::

source: This allows the intended cleanup behaviour to be made explicit up front, rather than requiring a separate flag variable.
pt_pt: Isto permite que o comportamento de limpeza pretendido seja tornado explícito desde o início, em vez de exigir uma variável de flag separada.

source: If a particular application uses this pattern a lot, it can be simplified even further by means of a small helper class::
pt_pt: Se uma aplicação específica usar muito este padrão, pode ser simplificado ainda mais por meio de uma pequena classe auxiliar::

source: If the resource cleanup isn't already neatly bundled into a standalone function, then it is still possible to use the decorator form of :meth:`ExitStack.callback` to declare the resource cleanup in advance::
pt_pt: Se a limpeza do recurso não estiver já agrupada num função independente, ainda é possível usar a forma de decorador de :meth:`ExitStack.callback` para declarar a limpeza do recurso antecipadamente::

source: Due to the way the decorator protocol works, a callback function declared this way cannot take any parameters. Instead, any resources to be released must be accessed as closure variables.
pt_pt: Devido à forma como o protocolo de decorador funciona, uma função de callback declarada desta forma não pode aceitar quaisquer parâmetros. Em vez disso, quaisquer recursos a serem libertados devem ser acessados como variáveis de closure.

source: Using a context manager as a function decorator
pt_pt: Usar um gestor de contexto como um decorador de função

source: :class:`ContextDecorator` makes it possible to use a context manager in both an ordinary ``with`` statement and also as a function decorator.
pt_pt: :class:`ContextDecorator` torna possível usar um gestor de contexto tanto numa instrução ``with`` comum como também como um decorador de função.

source: For example, it is sometimes useful to wrap functions or groups of statements with a logger that can track the time of entry and time of exit. Rather than writing both a function decorator and a context manager for the task, inheriting from :class:`ContextDecorator` provides both capabilities in a single definition::
pt_pt: Por exemplo, às vezes é útil envolver funções ou grupos de instruções com um registador que pode acompanhar o tempo de entrada e o tempo de saída. Em vez de escrever tanto um decorador de função como um gestor de contexto para a tarefa, herdar de :class:`ContextDecorator` fornece ambas as capacidades numa única definição::

source: Instances of this class can be used as both a context manager::
pt_pt: Instâncias desta classe podem ser usadas como um gestor de contexto::

source: And also as a function decorator::
pt_pt: E também como um decorador de função::

source: Note that there is one additional limitation when using context managers as function decorators: there's no way to access the return value of :meth:`~object.__enter__`. If that value is needed, then it is still necessary to use an explicit ``with`` statement.
pt_pt: Note que há uma limitação adicional ao usar gestores de contexto como decoradores de função: não há forma de aceder ao valor de retorno de :meth:`~object.__enter__`. Se esse valor for necessário, então ainda é necessário usar uma instrução ``with`` explícita.

source: :pep:`343` - The "with" statement
pt_pt: :pep:`343` - A instrução "with"

source: The specification, background, and examples for the Python :keyword:`with` statement.
pt_pt: A especificação, contexto e exemplos para a instrução :keyword:`with` do Python.

source: Single use, reusable and reentrant context managers
pt_pt: Gestores de contexto de uso único, reutilizáveis e reentrantes

source: Most context managers are written in a way that means they can only be used effectively in a :keyword:`with` statement once. These single use context managers must be created afresh each time they're used - attempting to use them a second time will trigger an exception or otherwise not work correctly.
pt_pt: A maioria dos gestores de contexto são escritos de forma a que só possam ser usados efetivamente numa instrução :keyword:`with` uma vez. Estes gestores de contexto de uso único devem ser criados de novo cada vez que são usados - tentar usá-los uma segunda vez desencadeará uma exceção ou não funcionará corretamente.

source: This common limitation means that it is generally advisable to create context managers directly in the header of the :keyword:`with` statement where they are used (as shown in all of the usage examples above).
pt_pt: Esta limitação comum significa que é geralmente aconselhável criar gestores de contexto diretamente no cabeçalho da instrução :keyword:`with` onde são usados (como mostrado em todos os exemplos de uso acima).

source: Files are an example of effectively single use context managers, since the first :keyword:`with` statement will close the file, preventing any further IO operations using that file object.
pt_pt: Os ficheiros são um exemplo de gestores de contexto efetivamente de uso único, uma vez que a primeira instrução :keyword:`with` fechará o ficheiro, impedindo quaisquer operações de IO adicionais usando esse objeto de ficheiro.
