Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/copyreg.po
Languages: es_es, ja

source: :mod:`!copyreg` --- Register :mod:`!pickle` support functions
es_es: :mod:`!copyreg` --- Registro :mod:`!pickle` funciones de apoyo

source: **Source code:** :source:`Lib/copyreg.py`
es_es: **Código fuente:** :source:`Lib/copyreg.py`
ja: **Kod źródłowy:** :source:`Lib/copyreg.py`

source: The :mod:`copyreg` module offers a way to define functions used while pickling specific objects. The :mod:`pickle` and :mod:`copy` modules use those functions when pickling/copying those objects. The module provides configuration information about object constructors which are not classes. Such constructors may be factory functions or class instances.
es_es: El módulo :mod:`copyreg` ofrece una forma de definir las funciones que se utilizan al decapar objetos específicos. Los módulos :mod:`pickle` y :mod:`copy` utilizan esas funciones al decapar/copiar esos objetos. El módulo proporciona información de configuración sobre los constructores de objetos que no son clases. Estos constructores pueden ser funciones de fábrica o instancias de clase.
ja: Модуль :mod:`copyreg` пропонує спосіб визначення функцій, які використовуються під час маринування конкретних об’єктів. Модулі :mod:`pickle` і :mod:`copy` використовують ці функції під час маринування/копіювання цих об’єктів. Модуль надає конфігураційну інформацію про конструктори об’єктів, які не є класами. Такими конструкторами можуть бути фабричні функції або екземпляри класу.

source: Declares *object* to be a valid constructor. If *object* is not callable (and hence not valid as a constructor), raises :exc:`TypeError`.
es_es: Declara que *objeto* es un constructor válido. Si *objeto* no es invocable (y por tanto no es válido como constructor), muestra :exc:`TypeError`.
ja: Оголошує *object* як дійсний конструктор. Якщо *object* не можна викликати (і, отже, недійсний як конструктор), викликає :exc:`TypeError`.

source: Declares that *function* should be used as a "reduction" function for objects of type *type*. *function* must return either a string or a tuple containing between two and six elements. See the :attr:`~pickle.Pickler.dispatch_table` for more details on the interface of *function*.
es_es: Declara que *función* debe utilizarse como función de "reducción" para objetos de tipo *tipo*. *función* debe devolver una cadena o una tupla que contenga entre dos y seis elementos. Véase :attr:`~pickle.Pickler.dispatch_table` para más detalles sobre la interfaz de *function*.
ja: Объявляет, что *функция* должна использоваться как функция «сокращения» для объектов типа *тип*. *функция* должна возвращать либо строку, либо кортеж, содержащий от двух до шести элементов. См. :attr:`~pickle.Pickler.dispatch_table` для получения более подробной информации об интерфейсе *функции*.

source: The *constructor_ob* parameter is a legacy feature and is now ignored, but if passed it must be a callable.
es_es: El parámetro *constructor_ob* es una característica heredada y ahora se ignora, pero si se pasa debe ser un callable.
ja: Параметр *constructor_ob* является устаревшей функцией и теперь игнорируется, но если он передан, он должен быть вызываемым.

source: Note that the :attr:`~pickle.Pickler.dispatch_table` attribute of a pickler object or subclass of :class:`pickle.Pickler` can also be used for declaring reduction functions.
es_es: Tener en cuenta que el atributo :attr:`~pickle.Pickler.dispatch_table` de un objeto pickler o subclase de :class:`pickle.Pickler` también se puede utilizar para declarar funciones de reducción.
ja: Обратите внимание, что атрибут :attr:`~pickle.Pickler.dispatch_table` объекта пиклера или подкласса :class:`pickle.Pickler` также может использоваться для объявления функций сокращения.

source: Example
es_es: Ejemplo
ja: Przykład

source: The example below would like to show how to register a pickle function and how it will be used:
es_es: El siguiente ejemplo quiere mostrar cómo registrar una función pickle y cómo se utilizará:
ja: Наведений нижче приклад показує, як зареєструвати функцію pickle і як вона буде використовуватися:

source: module
es_es: módulo
ja: moduł

source: copy
es_es: copia
ja: копировать

source: :mod:`copyreg` --- Register :mod:`pickle` support functions
ja: :mod:`copyreg` --- :mod:`pickle` サポート関数を登録する
