Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: Since ``table`` is a ``pointer`` to the array of ``struct_frozen`` records, we can iterate over it, but we just have to make sure that our loop terminates, because pointers have no size. Sooner or later it would probably crash with an access violation or whatever, so it's better to break out of the loop when we hit the ``NULL`` entry::
pt_pt: Como ``table`` é um ``pointer`` para o array de registos ``struct_frozen``, podemos iterar sobre ele, mas temos de garantir que o nosso ciclo termina, porque os ponteiros não têm tamanho. Mais cedo ou mais tarde, provavelmente falharia com uma violação de acesso ou algo do género, pelo que é melhor sair do ciclo quando encontrarmos a entrada ``NULL``:
sv: Eftersom ``table`` är en ``pekare`` till arrayen av ``struct_frozen``-poster kan vi iterera över den, men vi måste bara se till att vår slinga avslutas, eftersom pekare inte har någon storlek. Förr eller senare skulle det förmodligen krascha med en access violation eller vad som helst, så det är bättre att bryta sig ur slingan när vi träffar ``NULL``-ingången::

source: >>> for item in table: ... if item.name is None: ... break ... print(item.name.decode("ascii"), item.size) ... _frozen_importlib 31764 _frozen_importlib_external 41499 zipimport 12345 >>>
sv: >>> för objekt i tabellen: ... om item.name är None: ... break ... print(objekt.namn.decode("ascii")), objekt.storlek) ... _frozen_importlib 31764 _frozen_importlib_external 41499 zipimport 12345 >>>

source: The fact that standard Python has a frozen module and a frozen package (indicated by the negative ``size`` member) is not well known, it is only used for testing. Try it out with ``import __hello__`` for example.
pt_pt: O facto de o Python padrão ter um módulo congelado e um pacote congelado (indicado pelo membro ``size`` negativo) não é muito conhecido, sendo usado apenas para testes. Experimente, por exemplo, com ``import __hello__``.
sv: Det faktum att standard Python har en frusen modul och ett fruset paket (indikeras av den negativa ``size``-medlemmen) är inte välkänt, det används bara för testning. Prova det till exempel med ``import __hello__``.

source: Surprises
pt_pt: Surpresas
sv: Överraskningar

source: There are some edges in :mod:`ctypes` where you might expect something other than what actually happens.
pt_pt: Existem alguns aspetos em :mod:`ctypes` onde pode esperar algo diferente daquilo que realmente acontece.
sv: Det finns vissa kanter i :mod:`ctypes` där man kan förvänta sig något annat än vad som faktiskt händer.

source: Consider the following example::
pt_pt: Considere o seguinte exemplo::
sv: Tänk på följande exempel::

source: >>> from ctypes import * >>> class POINT(Structure): ... _fields_ = ("x", c_int), ("y", c_int) ... >>> class RECT(Structure): ... _fields_ = ("a", POINT), ("b", POINT) ... >>> p1 = POINT(1, 2) >>> p2 = POINT(3, 4) >>> rc = RECT(p1, p2) >>> print(rc.a.x, rc.a.y, rc.b.x, rc.b.y) 1 2 3 4 >>> # now swap the two points >>> rc.a, rc.b = rc.b, rc.a >>> print(rc.a.x, rc.a.y, rc.b.x, rc.b.y) 3 4 3 4 >>>
pt_pt: >>> from ctypes import * >>> class POINT(Structure): ... _fields_ = ("x", c_int), ("y", c_int) ... >>> class RECT(Structure): ... _fields_ = ("a", POINT), ("b", POINT) ... >>> p1 = POINT(1, 2) >>> p2 = POINT(3, 4) >>> rc = RECT(p1, p2) >>> print(rc.a.x, rc.a.y, rc.b.x, rc.b.y) 1 2 3 4 >>> # agora troque os dois pontos >>> rc.a, rc.b = rc.b, rc.a >>> print(rc.a.x, rc.a.y, rc.b.x, rc.b.y) 3 4 3 4 >>>
sv: >>> från ctypes importera * >>> klass POINT(Struktur): ... _fields_ = ("x", c_int), ("y", c_int) ... >>> klass RECT(Struktur): ... _fields_ = ("a", POINT), ("b", POINT) ... >>> p1 = POINT(1, 2) >>> p2 = POINT(3, 4) >>> rc = RECT(p1, p2) >>> print(rc.a.x, rc.a.y, rc.b.x, rc.b.y) 1 2 3 4 >>> # byt nu ut de två punkterna >>> rc.a, rc.b = rc.b, rc.a >>> print(rc.a.x, rc.a.y, rc.b.x, rc.b.y) 3 4 3 4 >>>

source: Hm. We certainly expected the last statement to print ``3 4 1 2``. What happened? Here are the steps of the ``rc.a, rc.b = rc.b, rc.a`` line above::
pt_pt: Hm. Certamente esperávamos que a última instrução imprimisse ``3 4 1 2``. O que aconteceu? Aqui estão os passos da linha ``rc.a, rc.b = rc.b, rc.a`` acima::
sv: Hm. Vi förväntade oss verkligen att det sista uttalandet skulle skriva ut ``3 4 1 2``. Vad var det som hände? Här är stegen i raden ``rc.a, rc.b = rc.b, rc.a`` ovan::

source: Note that ``temp0`` and ``temp1`` are objects still using the internal buffer of the ``rc`` object above. So executing ``rc.a = temp0`` copies the buffer contents of ``temp0`` into ``rc`` 's buffer. This, in turn, changes the contents of ``temp1``. So, the last assignment ``rc.b = temp1``, doesn't have the expected effect.
pt_pt: Note que ``temp0`` e ``temp1`` são objetos que ainda usam o buffer interno do objeto ``rc`` acima. Assim, executar ``rc.a = temp0`` copia o conteúdo do buffer de ``temp0`` para o buffer de ``rc``. Isto, por sua vez, altera o conteúdo de ``temp1``. Portanto, a última atribuição ``rc.b = temp1`` não tem o efeito esperado.
sv: Observera att ``temp0`` och ``temp1`` är objekt som fortfarande använder den interna bufferten i ``rc``-objektet ovan. Så när du kör ``rc.a = temp0`` kopieras buffertinnehållet i ``temp0`` till ``rc`` buffert. Detta ändrar i sin tur innehållet i ``temp1``. Så den sista uppgiften ``rc.b = temp1`` har inte den förväntade effekten.

source: Keep in mind that retrieving sub-objects from Structure, Unions, and Arrays doesn't *copy* the sub-object, instead it retrieves a wrapper object accessing the root-object's underlying buffer.
pt_pt: Tenha em mente que recuperar sub-objetos de Structure, Unions e Arrays não *copia* o sub-objeto, em vez disso, recupera um objeto wrapper que acede ao buffer subjacente do objeto raiz.
sv: Tänk på att när du hämtar underobjekt från Structure, Unions och Arrays *kopieras* inte underobjektet, utan istället hämtas ett omslagsobjekt som har åtkomst till rotobjektets underliggande buffert.

source: Another example that may behave differently from what one would expect is this::
pt_pt: Outro exemplo que pode comportar-se de forma diferente do esperado é este::
sv: Ett annat exempel som kan bete sig annorlunda än vad man förväntar sig är detta::

source: >>> s = c_char_p() >>> s.value = b"abc def ghi" >>> s.value b'abc def ghi' >>> s.value is s.value False >>>
sv: >>> s = c_char_p() >>> s.värde = b"abc def ghi" >>> s.värde b'abc def ghi' >>> s.value är s.value Falskt >>>

source: Objects instantiated from :class:`c_char_p` can only have their value set to bytes or integers.
pt_pt: Objetos instanciados a partir de :class:`c_char_p` só podem ter o seu valor definido para bytes ou inteiros.
sv: Objekt som instansieras från :class:`c_char_p` kan bara ha sitt värde inställt på bytes eller heltal.

source: Why is it printing ``False``? ctypes instances are objects containing a memory block plus some :term:`descriptor`\s accessing the contents of the memory. Storing a Python object in the memory block does not store the object itself, instead the ``contents`` of the object is stored. Accessing the contents again constructs a new Python object each time!
pt_pt: Porque imprime ``False``? As instâncias ctypes são objetos que contêm um bloco de memória e alguns :term:`descritores` que acedem ao conteúdo da memória. Armazenar um objeto Python no bloco de memória não armazena o objeto em si, em vez disso, armazena-se o ``contents`` do objeto. Aceder novamente ao conteúdo constrói um novo objeto Python cada vez!
sv: Varför skriver den ut ``False``? ctypes-instanser är objekt som innehåller ett minnesblock plus några :term:`descriptor`` som har åtkomst till innehållet i minnet. När ett Python-objekt lagras i minnesblocket lagras inte själva objektet, utan istället lagras objektets ``innehåll``. Om du öppnar innehållet igen konstrueras ett nytt Python-objekt varje gång!

source: Variable-sized data types
pt_pt: Tipos de dados de tamanho variável
sv: Datatyper med variabel storlek

source: :mod:`ctypes` provides some support for variable-sized arrays and structures.
pt_pt: :mod:`ctypes` fornece algum suporte para arrays e estruturas de tamanho variável.
sv: :mod:`ctypes` ger visst stöd för arrayer och strukturer med variabel storlek.

source: The :func:`resize` function can be used to resize the memory buffer of an existing ctypes object. The function takes the object as first argument, and the requested size in bytes as the second argument. The memory block cannot be made smaller than the natural memory block specified by the objects type, a :exc:`ValueError` is raised if this is tried::
pt_pt: A função :func:`resize` pode ser usada para redimensionar o buffer de memória de um objeto ctypes existente. A função recebe o objeto como primeiro argumento e o tamanho solicitado em bytes como segundo argumento. O bloco de memória não pode ser tornado mais pequeno do que o bloco de memória natural especificado pelo tipo do objeto; é levantado um :exc:`ValueError` se isto for tentado::
sv: Funktionen :func:`resize` kan användas för att ändra storlek på minnesbufferten för ett befintligt ctypes-objekt. Funktionen tar objektet som första argument och den begärda storleken i byte som andra argument. Minnesblocket kan inte göras mindre än det naturliga minnesblock som anges av objektets typ, ett :exc:`ValueError` uppstår om detta försöker:

source: >>> short_array = (c_short * 4)() >>> print(sizeof(short_array)) 8 >>> resize(short_array, 4) Traceback (most recent call last): ... ValueError: minimum size is 8 >>> resize(short_array, 32) >>> sizeof(short_array) 32 >>> sizeof(type(short_array)) 8 >>>
sv: >>> short_array = (c_short * 4)() >>> print(sizeof(short_array)) 8 >>> ändra storlek(short_array, 4) Traceback (senaste anropet senast): ... ValueError: minsta storlek är 8 >>> storleksändring(kort_matris, 32) >>> sizeof(short_array) 32 >>> sizeof(type(short_array)) 8 >>>

source: This is nice and fine, but how would one access the additional elements contained in this array? Since the type still only knows about 4 elements, we get errors accessing other elements::
pt_pt: Isto é bom, mas como aceder aos elementos adicionais contidos neste array? Como o tipo ainda só conhece 4 elementos, obtemos erros ao aceder a outros elementos::
sv: Detta är bra, men hur skulle man komma åt de ytterligare element som finns i denna array? Eftersom typen fortfarande bara känner till 4 element, får vi fel vid åtkomst till andra element::

source: >>> short_array[:] [0, 0, 0, 0] >>> short_array[7] Traceback (most recent call last): ... IndexError: invalid index >>>
sv: >>> kort_array[:] [0, 0, 0, 0] >>> short_array[7] Traceback (senaste anropet senast): ... IndexError: ogiltigt index >>>

source: Another way to use variable-sized data types with :mod:`ctypes` is to use the dynamic nature of Python, and (re-)define the data type after the required size is already known, on a case by case basis.
pt_pt: Outra forma de usar tipos de dados de tamanho variável com :mod:`ctypes` é utilizar a natureza dinâmica do Python e (re)definir o tipo de dados depois de o tamanho necessário ser conhecido, caso a caso.
sv: Ett annat sätt att använda datatyper med variabel storlek med :mod:`ctypes` är att använda Pythons dynamiska natur och (om)definiera datatypen efter att den önskade storleken redan är känd, från fall till fall.

source: ctypes reference
pt_pt: Referência de ctypes
sv: ctypes referens

source: Finding shared libraries
pt_pt: A localizar bibliotecas partilhadas
sv: Hitta delade bibliotek

source: When programming in a compiled language, shared libraries are accessed when compiling/linking a program, and when the program is run.
pt_pt: Ao programar numa linguagem compilada, as bibliotecas partilhadas são acedidas durante a compilação/ligação de um programa e quando o programa é executado.
sv: När du programmerar i ett kompilerat språk används delade bibliotek när du kompilerar/länkar ett program och när programmet körs.

source: The purpose of the :func:`~ctypes.util.find_library` function is to locate a library in a way similar to what the compiler or runtime loader does (on platforms with several versions of a shared library the most recent should be loaded), while the ctypes library loaders act like when a program is run, and call the runtime loader directly.
pt_pt: O objetivo da função :func:`~ctypes.util.find_library` é localizar uma biblioteca de forma semelhante ao que o compilador ou carregador de runtime faz (em plataformas com várias versões de uma biblioteca partilhada, a mais recente deve ser carregada), enquanto os carregadores de biblioteca ctypes agem como quando um programa é executado e chamam diretamente o carregador de runtime.
sv: Syftet med funktionen :func:`~ctypes.util.find_library` är att hitta ett bibliotek på ett sätt som liknar det som kompilatorn eller runtime-laddaren gör (på plattformar med flera versioner av ett delat bibliotek bör den senaste laddas), medan ctypes-biblioteksladdarna fungerar som när ett program körs och anropar runtime-laddaren direkt.

source: The :mod:`!ctypes.util` module provides a function which can help to determine the library to load.
pt_pt: O módulo :mod:`!ctypes.util` fornece uma função que pode ajudar a determinar a biblioteca a carregar.
sv: Modulen :mod:`!ctypes.util` innehåller en funktion som kan hjälpa till att bestämma vilket bibliotek som ska laddas.

source: Try to find a library and return a pathname. *name* is the library name without any prefix like *lib*, suffix like ``.so``, ``.dylib`` or version number (this is the form used for the posix linker option :option:`!-l`). If no library can be found, returns ``None``.
pt_pt: Tenta encontrar uma biblioteca e devolve um caminho. *name* é o nome da biblioteca sem qualquer prefixo como *lib*, sufixo como ``.so``, ``.dylib`` ou número de versão (esta é a forma usada para a opção do linker posix :option:`!-l`). Se nenhuma biblioteca for encontrada, devolve ``None``.
sv: Försöker hitta ett bibliotek och returnerar ett sökvägsnamn. *name* är biblioteksnamnet utan något prefix som *lib*, suffix som ``.so``, ``.dylib`` eller versionsnummer (detta är den form som används för posix-länkalternativet :option:`!-l`). Om inget bibliotek kan hittas returneras ``None``.

source: The exact functionality is system dependent.
pt_pt: A funcionalidade exata depende do sistema.
sv: Den exakta funktionaliteten är systemberoende.

source: On Linux, :func:`~ctypes.util.find_library` tries to run external programs (``/sbin/ldconfig``, ``gcc``, ``objdump`` and ``ld``) to find the library file. It returns the filename of the library file.
pt_pt: No Linux, :func:`~ctypes.util.find_library` tenta executar programas externos (``/sbin/ldconfig``, ``gcc``, ``objdump`` e ``ld``) para encontrar o ficheiro da biblioteca. Devolve o nome do ficheiro da biblioteca.
sv: På Linux försöker :func:`~ctypes.util.find_library` köra externa program (``/sbin/ldconfig``, ``gcc``, ``objdump`` och ``ld``) för att hitta biblioteksfilen. Den returnerar filnamnet på biblioteksfilen.

source: On Linux, the value of the environment variable ``LD_LIBRARY_PATH`` is used when searching for libraries, if a library cannot be found by any other means.
pt_pt: No Linux, o valor da variável de ambiente ``LD_LIBRARY_PATH`` é usado quando se procura bibliotecas, se uma biblioteca não puder ser encontrada por outros meios.
sv: Under Linux används värdet för miljövariabeln ``LD_LIBRARY_PATH`` vid sökning efter bibliotek, om ett bibliotek inte kan hittas på något annat sätt.

source: Here are some examples::
pt_pt: Aqui estão alguns exemplos::
sv: Här är några exempel::

source: >>> from ctypes.util import find_library >>> find_library("m") 'libm.so.6' >>> find_library("c") 'libc.so.6' >>> find_library("bz2") 'libbz2.so.1.0' >>>
sv: >>> från ctypes.util import find_library >>> find_library("m") 'libm.so.6' >>> find_library("c") 'libc.so.6' >>> find_library("bz2") 'libbz2.so.1.0' >>>

source: On macOS and Android, :func:`~ctypes.util.find_library` uses the system's standard naming schemes and paths to locate the library, and returns a full pathname if successful::
pt_pt: No macOS e Android, :func:`~ctypes.util.find_library` usa os esquemas de nomenclatura e caminhos padrão do sistema para localizar a biblioteca e devolve um caminho completo se tiver sucesso::
sv: På macOS och Android använder :func:`~ctypes.util.find_library` systemets standardnamngivningsscheman och sökvägar för att hitta biblioteket och returnerar ett fullständigt söknamn om det lyckas::

source: >>> from ctypes.util import find_library >>> find_library("c") '/usr/lib/libc.dylib' >>> find_library("m") '/usr/lib/libm.dylib' >>> find_library("bz2") '/usr/lib/libbz2.dylib' >>> find_library("AGL") '/System/Library/Frameworks/AGL.framework/AGL' >>>
sv: >>> från ctypes.util importera find_library >>> find_library("c") '/usr/lib/libc.dylib' >>> find_library("m") '/usr/lib/libm.dylib' >>> hitta_bibliotek("bz2") '/usr/lib/libbz2.dylib' >>> hitta_bibliotek("AGL") '/System/Bibliotek/Framverk/AGL.ramverk/AGL' >>>

source: On Windows, :func:`~ctypes.util.find_library` searches along the system search path, and returns the full pathname, but since there is no predefined naming scheme a call like ``find_library("c")`` will fail and return ``None``.
pt_pt: No Windows, :func:`~ctypes.util.find_library` pesquisa ao longo do caminho de pesquisa do sistema e devolve o caminho completo, mas como não existe um esquema de nomenclatura predefinido, uma chamada como ``find_library("c")`` falhará e devolverá ``None``.
sv: På Windows söker :func:`~ctypes.util.find_library` längs systemets sökväg och returnerar det fullständiga sökvägsnamnet, men eftersom det inte finns något fördefinierat namngivningsschema kommer ett anrop som ``find_library("c")`` att misslyckas och returnera ``None``.

source: If wrapping a shared library with :mod:`ctypes`, it *may* be better to determine the shared library name at development time, and hardcode that into the wrapper module instead of using :func:`~ctypes.util.find_library` to locate the library at runtime.
pt_pt: Ao encapsular uma biblioteca partilhada com :mod:`ctypes`, *pode* ser melhor determinar o nome da biblioteca partilhada em tempo de desenvolvimento e codificá-lo no módulo wrapper em vez de usar :func:`~ctypes.util.find_library` para localizar a biblioteca em tempo de execução.
sv: Om du omsluter ett delat bibliotek med :mod:`ctypes`, kan det *vara* bättre att bestämma det delade bibliotekets namn under utvecklingstiden och hårdkoda det i omslutningsmodulen istället för att använda :func:`~ctypes.util.find_library` för att hitta biblioteket vid körning.

source: Loading shared libraries
pt_pt: A carregar bibliotecas partilhadas
sv: Ladda delade bibliotek

source: There are several ways to load shared libraries into the Python process. One way is to instantiate one of the following classes:
pt_pt: Existem várias formas de carregar bibliotecas partilhadas no processo Python. Uma das formas é instanciar uma das seguintes classes:
sv: Det finns flera sätt att ladda in delade bibliotek i Python-processen. Ett sätt är att instansiera en av följande klasser:

source: Instances of this class represent loaded shared libraries. Functions in these libraries use the standard C calling convention, and are assumed to return :c:expr:`int`.
pt_pt: Instâncias desta classe representam bibliotecas partilhadas carregadas. As funções nestas bibliotecas usam a convenção de chamada C padrão e assumem-se que devolvem :c:expr:`int`.
sv: Instanser av denna klass representerar laddade delade bibliotek. Funktioner i dessa bibliotek använder standard C-anropskonventionen och antas returnera :c:expr:`int`.

source: On Windows creating a :class:`CDLL` instance may fail even if the DLL name exists. When a dependent DLL of the loaded DLL is not found, a :exc:`OSError` error is raised with the message *"[WinError 126] The specified module could not be found".* This error message does not contain the name of the missing DLL because the Windows API does not return this information making this error hard to diagnose. To resolve this error and determine which DLL is not found, you need to find the list of dependent DLLs and determine which one is not found using Windows debugging and tracing tools.
pt_pt: No Windows, a criação de uma instância :class:`CDLL` pode falhar mesmo que o nome da DLL exista. Quando uma DLL dependente da DLL carregada não é encontrada, é levantado um erro :exc:`OSError` com a mensagem *"[WinError 126] The specified module could not be found".* Esta mensagem de erro não contém o nome da DLL em falta porque a API do Windows não devolve esta informação, tornando este erro difícil de diagnosticar. Para resolver este erro e determinar qual a DLL em falta, é necessário encontrar a lista de DLLs dependentes e determinar qual não foi encontrada usando ferramentas de depuração e rastreio do Windows.
sv: I Windows kan det misslyckas att skapa en :class:`CDLL`-instans även om DLL-namnet finns. När en DLL som är beroende av den inlästa DLL:en inte hittas, uppstår ett :exc:`OSError`-fel med meddelandet *"[WinError 126] Den angivna modulen kunde inte hittas".* Detta felmeddelande innehåller inte namnet på den DLL som saknas eftersom Windows API inte returnerar denna information, vilket gör det svårt att diagnostisera detta fel. För att lösa det här felet och avgöra vilken DLL som inte hittas måste du hitta listan över beroende DLL:er och avgöra vilken som inte hittas med hjälp av Windows felsöknings- och spårningsverktyg.

source: The *name* parameter can now be a :term:`path-like object`.
pt_pt: O parâmetro *name* pode agora ser um objeto do tipo :term:`path-like`.
sv: Parametern *namn* kan nu vara en :term:`path-liknande objekt`.

source: `Microsoft DUMPBIN tool <https://docs.microsoft.com/cpp/build/reference/dependents>`_ -- A tool to find DLL dependents.
pt_pt: Ferramenta `Microsoft DUMPBIN <https://docs.microsoft.com/cpp/build/reference/dependents>`_ — Uma ferramenta para encontrar dependências de DLL.
sv: microsofts DUMPBIN-verktyg <https://docs.microsoft.com/cpp/build/reference/dependents>`_ -- Ett verktyg för att hitta DLL-beroenden.

source: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return the windows specific :class:`HRESULT` code. :class:`HRESULT` values contain information specifying whether the function call failed or succeeded, together with additional error code. If the return value signals a failure, an :class:`OSError` is automatically raised.
pt_pt: Instâncias desta classe representam bibliotecas partilhadas carregadas. As funções nestas bibliotecas usam a convenção de chamada ``stdcall`` e assumem-se que devolvem o código específico do Windows :class:`HRESULT`. Os valores :class:`HRESULT` contêm informação que especifica se a chamada da função falhou ou teve sucesso, juntamente com um código de erro adicional. Se o valor de retorno sinalizar uma falha, é automaticamente levantado um :class:`OSError`.
sv: Instanser av denna klass representerar inlästa delade bibliotek, funktioner i dessa bibliotek använder anropskonventionen ``stdcall`` och antas returnera den Windows-specifika :class:`HRESULT`-koden. :class:`HRESULT`-värden innehåller information som anger om funktionsanropet misslyckades eller lyckades, tillsammans med ytterligare felkod. Om returvärdet signalerar ett misslyckande, skapas automatiskt ett :class:`OSError`.

source: Availability
pt_pt: Disponibilidade
sv: Tillgänglighet

source: :exc:`WindowsError` used to be raised, which is now an alias of :exc:`OSError`.
pt_pt: :exc:`WindowsError` costumava ser levantado, que agora é um alias de :exc:`OSError`.
sv: tidigare användes :exc:`WindowsError`, som nu är ett alias för :exc:`OSError`.
