Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: The :mod:`!ctypes.wintypes` module provides quite some other Windows specific data types, for example :c:type:`!HWND`, :c:type:`!WPARAM`, or :c:type:`!DWORD`. Some useful structures like :c:type:`!MSG` or :c:type:`!RECT` are also defined.
pt_pt: O módulo :mod:`!ctypes.wintypes` fornece vários outros tipos de dados específicos do Windows, por exemplo :c:type:`!HWND`, :c:type:`!WPARAM` ou :c:type:`!DWORD`. Algumas estruturas úteis como :c:type:`!MSG` ou :c:type:`!RECT` também estão definidas.
sv: Modulen :mod:`!ctypes.wintypes` tillhandahåller en hel del andra Windows-specifika datatyper, till exempel :c:type:`!HWND`, :c:type:`!WPARAM` eller :c:type:`!DWORD`. Några användbara strukturer som :c:type:`!MSG` eller :c:type:`!RECT` är också definierade.

source: Structured data types
pt_pt: Tipos de dados estruturados
sv: Strukturerade datatyper

source: Abstract base class for unions in native byte order.
pt_pt: Classe base abstrata para uniões em ordem de bytes nativa.
sv: Abstrakt basklass för unioner i inbyggd byte-ordning.

source: Abstract base class for unions in *big endian* byte order.
pt_pt: Classe base abstrata para uniões em ordem de bytes *big endian*.
sv: Abstrakt basklass för unioner i *big endian* byteordning.

source: Abstract base class for unions in *little endian* byte order.
pt_pt: Classe base abstrata para uniões em ordem de bytes *little endian*.
sv: Abstrakt basklass för unioner i byteordning *little endian*.

source: Abstract base class for structures in *big endian* byte order.
pt_pt: Classe base abstrata para estruturas em ordem de bytes *big endian*.
sv: Abstrakt basklass för strukturer i *big endian* byteordning.

source: Abstract base class for structures in *little endian* byte order.
pt_pt: Classe base abstrata para estruturas em ordem de bytes *little endian*.
sv: Abstrakt basklass för strukturer i byteordning *little endian*.

source: Structures and unions with non-native byte order cannot contain pointer type fields, or any other data types containing pointer type fields.
pt_pt: Estruturas e uniões com ordem de bytes não nativa não podem conter campos de tipo ponteiro ou quaisquer outros tipos de dados que contenham campos de tipo ponteiro.
sv: Strukturer och unioner med icke inhemsk byteordning kan inte innehålla fält av pekartyp eller andra datatyper som innehåller fält av pekartyp.

source: Abstract base class for structures in *native* byte order.
pt_pt: Classe base abstrata para estruturas em ordem de bytes *nativa*.
sv: Abstrakt basklass för strukturer i *nativ* byte-ordning.

source: Concrete structure and union types must be created by subclassing one of these types, and at least define a :attr:`_fields_` class variable. :mod:`ctypes` will create :term:`descriptor`\s which allow reading and writing the fields by direct attribute accesses. These are the
pt_pt: Os tipos concretos de estruturas e uniões devem ser criados por subclasse de um destes tipos e, pelo menos, definir uma variável de classe :attr:`_fields_`. O :mod:`ctypes` criará :term:`descritores` que permitem ler e escrever os campos através de acessos diretos aos atributos. Estes são os
sv: Konkreta struktur- och unionstyper måste skapas genom att underklassa en av dessa typer och åtminstone definiera en klassvariabel :attr:`_fields_`. :mod:`ctypes` skapar :term:`descriptor` som gör det möjligt att läsa och skriva fälten genom direkt attributåtkomst. Dessa är

source: A sequence defining the structure fields. The items must be 2-tuples or 3-tuples. The first item is the name of the field, the second item specifies the type of the field; it can be any ctypes data type.
pt_pt: Uma sequência que define os campos da estrutura. Os itens devem ser 2-tuplos ou 3-tuplos. O primeiro item é o nome do campo; o segundo item especifica o tipo do campo, que pode ser qualquer tipo de dados ctypes.
sv: En sekvens som definierar strukturfälten. Elementen måste vara 2-tupler eller 3-tupler. Det första objektet är fältets namn, det andra objektet anger fältets typ; det kan vara vilken ctypes-datatyp som helst.

source: For integer type fields like :class:`c_int`, a third optional item can be given. It must be a small positive integer defining the bit width of the field.
pt_pt: Para campos de tipo inteiro como :class:`c_int`, pode ser fornecido um terceiro item opcional. Deve ser um inteiro positivo pequeno que define a largura em bits do campo.
sv: För fält av heltalstyp som :class:`c_int` kan ett tredje valfritt element anges. Det måste vara ett litet positivt heltal som definierar fältets bitbredd.

source: Field names must be unique within one structure or union. This is not checked, only one field can be accessed when names are repeated.
pt_pt: Os nomes dos campos devem ser únicos dentro de uma estrutura ou união. Isto não é verificado; apenas um campo pode ser acedido quando os nomes são repetidos.
sv: Fältnamn måste vara unika inom en struktur eller union. Detta kontrolleras inte, endast ett fält kan nås när namnen upprepas.

source: It is possible to define the :attr:`_fields_` class variable *after* the class statement that defines the Structure subclass, this allows creating data types that directly or indirectly reference themselves::
pt_pt: É possível definir a variável de classe :attr:`_fields_` *depois* da instrução de classe que define a subclasse Structure, o que permite criar tipos de dados que referenciam diretamente ou indiretamente a si mesmos::
sv: Det är möjligt att definiera klassvariabeln :attr:`_fields_` *efter* den class-sats som definierar underklassen Structure, vilket gör det möjligt att skapa datatyper som direkt eller indirekt refererar till sig själva::

source: class List(Structure): pass List._fields_ = [("pnext", POINTER(List)), ... ]
sv: klass Lista(Struktur): pass List._fields_ = [("pnext", POINTER(List)), ... ]

source: An optional small integer that allows overriding the alignment of structure fields in the instance. :attr:`_pack_` must already be defined when :attr:`_fields_` is assigned, otherwise it will have no effect. Setting this attribute to 0 is the same as not setting it at all.
sv: Ett valfritt litet heltal som gör det möjligt att åsidosätta inriktningen av strukturfälten i instansen. :attr:`_pack_` måste redan vara definierat när :attr:`_fields_` tilldelas, annars har det ingen effekt. Att sätta detta attribut till 0 är samma sak som att inte sätta det alls.

source: An optional small integer that allows overriding the alignment of the structure when being packed or unpacked to/from memory. Setting this attribute to 0 is the same as not setting it at all.
sv: Ett valfritt litet heltal som gör det möjligt att åsidosätta strukturens inriktning när den packas eller packas upp till/från minnet. Att sätta detta attribut till 0 är samma sak som att inte sätta det alls.

source: An optional sequence that lists the names of unnamed (anonymous) fields. :attr:`_anonymous_` must be already defined when :attr:`_fields_` is assigned, otherwise it will have no effect.
pt_pt: Uma sequência opcional que lista os nomes dos campos sem nome (anónimos). :attr:`_anonymous_` já deve estar definido quando :attr:`_fields_` é atribuído, caso contrário não terá efeito.
sv: En valfri sekvens som listar namnen på namnlösa (anonyma) fält. :attr:`_anonymous_` måste redan vara definierat när :attr:`_fields_` tilldelas, annars har det ingen effekt.

source: The fields listed in this variable must be structure or union type fields. :mod:`ctypes` will create descriptors in the structure type that allows accessing the nested fields directly, without the need to create the structure or union field.
pt_pt: Os campos listados nesta variável devem ser campos de tipo estrutura ou união. :mod:`ctypes` criará descritores no tipo de estrutura que permitem aceder aos campos aninhados diretamente, sem necessidade de criar o campo de estrutura ou união.
sv: De fält som anges i denna variabel måste vara av strukturtyp eller unionstyp. :mod:`ctypes` skapar deskriptorer i strukturtypen som gör det möjligt att komma åt de nästlade fälten direkt, utan att behöva skapa struktur- eller unionsfältet.

source: Here is an example type (Windows)::
pt_pt: Aqui está um exemplo de tipo (Windows)::
sv: Här är ett exempel på en typ (Windows)::

source: class _U(Union): _fields_ = [("lptdesc", POINTER(TYPEDESC)), ("lpadesc", POINTER(ARRAYDESC)), ("hreftype", HREFTYPE)] class TYPEDESC(Structure): _anonymous_ = ("u",) _fields_ = [("u", _U), ("vt", VARTYPE)]
sv: klass _U(Union): _fields_ = [("lptdesc", POINTER(TYPEDESC)), ("lpadesc", POINTER(ARRAYDESC)), ("hreftype", HREFTYPE)] klass TYPEDESC(Struktur): _anonymous_ = ("u",) _fields_ = [("u", _U), ("vt", VARTYPE)]

source: The ``TYPEDESC`` structure describes a COM data type, the ``vt`` field specifies which one of the union fields is valid. Since the ``u`` field is defined as anonymous field, it is now possible to access the members directly off the TYPEDESC instance. ``td.lptdesc`` and ``td.u.lptdesc`` are equivalent, but the former is faster since it does not need to create a temporary union instance::
pt_pt: A estrutura ``TYPEDESC`` descreve um tipo de dados COM; o campo ``vt`` especifica qual dos campos da união é válido. Como o campo ``u`` está definido como campo anónimo, é agora possível aceder aos membros diretamente a partir da instância TYPEDESC. ``td.lptdesc`` e ``td.u.lptdesc`` são equivalentes, mas o primeiro é mais rápido, uma vez que não precisa de criar uma instância temporária da união::
sv: Strukturen ``TYPEDESC`` beskriver en COM-datatyp, fältet ``vt`` anger vilket av unionsfälten som är giltigt. Eftersom fältet ``u`` är definierat som ett anonymt fält är det nu möjligt att komma åt medlemmarna direkt från TYPEDESC-instansen. ``td.lptdesc`` och ``td.u.lptdesc`` är likvärdiga, men den förra är snabbare eftersom den inte behöver skapa en tillfällig unionsinstans::

source: It is possible to define sub-subclasses of structures, they inherit the fields of the base class. If the subclass definition has a separate :attr:`_fields_` variable, the fields specified in this are appended to the fields of the base class.
pt_pt: É possível definir sub-subclasses de estruturas; estas herdam os campos da classe base. Se a definição da subclasse tiver uma variável :attr:`_fields_` separada, os campos especificados nesta são adicionados aos campos da classe base.
sv: Det är möjligt att definiera sub-subklasser av strukturer, de ärver fälten i basklassen. Om subklassdefinitionen har en separat variabel :attr:`_fields_`, läggs de fält som anges i denna till basklassens fält.

source: Structure and union constructors accept both positional and keyword arguments. Positional arguments are used to initialize member fields in the same order as they are appear in :attr:`_fields_`. Keyword arguments in the constructor are interpreted as attribute assignments, so they will initialize :attr:`_fields_` with the same name, or create new attributes for names not present in :attr:`_fields_`.
pt_pt: Os construtores de estruturas e uniões aceitam argumentos posicionais e de palavra-chave. Os argumentos posicionais são usados para inicializar os campos membros pela mesma ordem em que aparecem em :attr:`_fields_`. Os argumentos de palavra-chave no construtor são interpretados como atribuições de atributos, pelo que inicializarão :attr:`_fields_` com o mesmo nome ou criarão novos atributos para nomes não presentes em :attr:`_fields_`.
sv: Struktur- och unionskonstruktörer accepterar både positionella argument och nyckelordsargument. Positionella argument används för att initiera medlemsfält i samma ordning som de visas i :attr:`_fields_`. Nyckelord i konstruktorn tolkas som attributtilldelningar, vilket innebär att de initierar :attr:`_fields_` med samma namn eller skapar nya attribut för namn som inte finns i :attr:`_fields_`.

source: Arrays and pointers
pt_pt: Arrays e ponteiros
sv: Arrayer och pekare

source: Abstract base class for arrays.
pt_pt: Classe base abstrata para arrays.
sv: Abstrakt basklass för arrayer.

source: The recommended way to create concrete array types is by multiplying any :mod:`ctypes` data type with a non-negative integer. Alternatively, you can subclass this type and define :attr:`_length_` and :attr:`_type_` class variables. Array elements can be read and written using standard subscript and slice accesses; for slice reads, the resulting object is *not* itself an :class:`Array`.
pt_pt: A forma recomendada de criar tipos de array concretos é multiplicando qualquer tipo de dados :mod:`ctypes` por um inteiro não negativo. Alternativamente, pode criar uma subclasse deste tipo e definir as variáveis de classe :attr:`_length_` e :attr:`_type_`. Os elementos do array podem ser lidos e escritos usando acessos de subscrito e fatia padrão; para leituras de fatia, o objeto resultante *não* é ele próprio um :class:`Array`.
sv: Det rekommenderade sättet att skapa konkreta array-typer är att multiplicera valfri :mod:`ctypes`-datatyp med ett icke-negativt heltal. Alternativt kan du underklassa den här typen och definiera klassvariablerna :attr:`_length_` och :attr:`_type_`. Array-element kan läsas och skrivas med hjälp av standardåtkomst för subscript och slice; för slice-läsning är det resulterande objektet *inte* i sig självt en :class:`Array`.

source: A positive integer specifying the number of elements in the array. Out-of-range subscripts result in an :exc:`IndexError`. Will be returned by :func:`len`.
pt_pt: Um inteiro positivo que especifica o número de elementos no array. Subscritos fora do intervalo resultam num :exc:`IndexError`. Será devolvido por :func:`len`.
sv: Ett positivt heltal som anger antalet element i matrisen. Subskriptioner utanför intervallet resulterar i ett :exc:`IndexError`. Kommer att returneras av :func:`len`.

source: Specifies the type of each element in the array.
pt_pt: Especifica o tipo de cada elemento no array.
sv: Anger typen för varje element i matrisen.

source: Array subclass constructors accept positional arguments, used to initialize the elements in order.
pt_pt: Os construtores de subclasses de array aceitam argumentos posicionais, usados para inicializar os elementos por ordem.
sv: Array-underklassens konstruktörer accepterar positionella argument som används för att initiera elementen i ordning.

source: Create an array. Equivalent to ``type * length``, where *type* is a :mod:`ctypes` data type and *length* an integer.
pt_pt: Cria um array. Equivalente a ``type * length``, onde *type* é um tipo de dados :mod:`ctypes` e *length* um inteiro.
sv: Skapar en array. Motsvarar ``type * length``, där *type* är en :mod:`ctypes`-datatyp och *length* ett heltal.

source: This function is :term:`soft deprecated` in favor of multiplication. There are no plans to remove it.
pt_pt: Esta função está :term:`obsoleta` em favor da multiplicação. Não há planos para removê-la.
sv: Denna funktion är :term:`soft deprecated` till förmån för multiplikation. Det finns inga planer på att ta bort den.

source: Private, abstract base class for pointers.
pt_pt: Classe base abstrata privada para ponteiros.
sv: Privat, abstrakt basklass för pekare.

source: Concrete pointer types are created by calling :func:`POINTER` with the type that will be pointed to; this is done automatically by :func:`pointer`.
pt_pt: Os tipos de ponteiros concretos são criados chamando :func:`POINTER` com o tipo que será apontado; isto é feito automaticamente por :func:`pointer`.
sv: Konkreta pekartyper skapas genom att anropa :func:`POINTER` med den typ som ska pekas på; detta görs automatiskt av :func:`pointer`.

source: If a pointer points to an array, its elements can be read and written using standard subscript and slice accesses. Pointer objects have no size, so :func:`len` will raise :exc:`TypeError`. Negative subscripts will read from the memory *before* the pointer (as in C), and out-of-range subscripts will probably crash with an access violation (if you're lucky).
pt_pt: Se um ponteiro apontar para um array, os seus elementos podem ser lidos e escritos usando acessos de subscrito e fatia padrão. Os objetos ponteiro não têm tamanho, pelo que :func:`len` levantará um :exc:`TypeError`. Subscritos negativos lerão da memória *antes* do ponteiro (como em C), e subscritos fora do intervalo provavelmente causarão uma violação de acesso (se tiver sorte).
sv: Om en pekare pekar på en array kan dess element läsas och skrivas med hjälp av standardåtkomst för subscript och slice. Pekarobjekt har ingen storlek, så :func:`len` kommer att ge upphov till :exc:`TypeError`. Negativa subscripts läser från minnet *före* pekaren (som i C), och out-of-range subscripts kraschar förmodligen med en access violation (om du har tur).

source: Specifies the type pointed to.
pt_pt: Especifica o tipo apontado.
sv: Anger vilken typ som pekas ut.

source: Returns the object to which to pointer points. Assigning to this attribute changes the pointer to point to the assigned object.
pt_pt: Devolve o objeto para o qual o ponteiro aponta. Atribuir a este atributo altera o ponteiro para apontar para o objeto atribuído.
sv: Returnerar det objekt som pekaren till pekar på. Om du tilldelar detta attribut ändras pekaren till att peka på det tilldelade objektet.

source: /* ANSI version */ HMODULE GetModuleHandleA(LPCSTR lpModuleName); /* UNICODE version */ HMODULE GetModuleHandleW(LPCWSTR lpModuleName);
pt_pt: /* versão ANSI */ HMODULE GetModuleHandleA(LPCSTR lpModuleName); /* versão UNICODE */ HMODULE GetModuleHandleW(LPCWSTR lpModuleName);
