Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: This method, and others that indirectly call this method, raises an :ref:`auditing event <auditing>` ``ctypes.cdata`` with argument ``address``.
pt_pt: Este método, e outros que chamam indiretamente este método, levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.cdata`` com o argumento ``address``.
sv: Denna metod, och andra som indirekt anropar denna metod, ger upphov till en :ref:``auditing event <auditing>``ctypes.cdata`` med argumentet ``address``.

source: This method adapts *obj* to a ctypes type. It is called with the actual object used in a foreign function call when the type is present in the foreign function's :attr:`~_CFuncPtr.argtypes` tuple; it must return an object that can be used as a function call parameter.
pt_pt: Este método adapta *obj* a um tipo ctypes. É chamado com o objeto real usado numa chamada de função externa quando o tipo está presente no tuplo :attr:`~_CFuncPtr.argtypes` da função externa; deve devolver um objeto que possa ser usado como parâmetro de chamada de função.
sv: Denna metod anpassar *obj* till en ctypes-typ. Den anropas med det faktiska objekt som används i ett utländskt funktionsanrop när typen finns i den utländska funktionens :attr:`~_CFuncPtr.argtypes`-tupel; den måste returnera ett objekt som kan användas som parameter för funktionsanropet.

source: All ctypes data types have a default implementation of this classmethod that normally returns *obj* if that is an instance of the type. Some types accept other objects as well.
pt_pt: Todos os tipos de dados ctypes têm uma implementação predefinida deste método de classe que normalmente devolve *obj* se este for uma instância do tipo. Alguns tipos aceitam outros objetos também.
sv: Alla ctypes-datatyper har en standardimplementering av denna classmethod som normalt returnerar *obj* om det är en instans av typen. Vissa typer accepterar även andra objekt.

source: This method returns a ctypes type instance exported by a shared library. *name* is the name of the symbol that exports the data, *library* is the loaded shared library.
pt_pt: Este método devolve uma instância de tipo ctypes exportada por uma biblioteca partilhada. *name* é o nome do símbolo que exporta os dados, *library* é a biblioteca partilhada carregada.
sv: Denna metod returnerar en ctypes-typinstans som exporteras av ett delat bibliotek. *name* är namnet på den symbol som exporterar data, *library* är det laddade delade biblioteket.

source: Common instance variables of ctypes data types:
pt_pt: Variáveis de instância comuns dos tipos de dados ctypes:
sv: Vanliga instansvariabler för ctypes datatyper:

source: Sometimes ctypes data instances do not own the memory block they contain, instead they share part of the memory block of a base object. The :attr:`_b_base_` read-only member is the root ctypes object that owns the memory block.
pt_pt: Às vezes, as instâncias de dados ctypes não são proprietárias do bloco de memória que contêm; em vez disso, partilham parte do bloco de memória de um objeto base. O membro de apenas leitura :attr:`_b_base_` é o objeto ctypes raiz que possui o bloco de memória.
sv: Ibland äger inte ctypes-datainstanser det minnesblock de innehåller, utan de delar istället en del av minnesblocket för ett basobjekt. Den skrivskyddade medlemmen :attr:`_b_base_` är det rot-ctypes-objekt som äger minnesblocket.

source: This read-only variable is true when the ctypes data instance has allocated the memory block itself, false otherwise.
pt_pt: Esta variável de apenas leitura é verdadeira quando a instância de dados ctypes alocou ela própria o bloco de memória, falsa caso contrário.
sv: Denna skrivskyddade variabel är sann när ctypes-datainstansen har allokerat minnesblocket själv, annars falsk.

source: This member is either ``None`` or a dictionary containing Python objects that need to be kept alive so that the memory block contents is kept valid. This object is only exposed for debugging; never modify the contents of this dictionary.
pt_pt: Este membro é ``None`` ou um dicionário que contém objetos Python que precisam de ser mantidos vivos para que o conteúdo do bloco de memória permaneça válido. Este objeto é exposto apenas para depuração; nunca modifique o conteúdo deste dicionário.
sv: Denna medlem är antingen ``None`` eller en ordbok som innehåller Python-objekt som måste hållas vid liv så att minnesblockets innehåll hålls giltigt. Detta objekt är endast exponerat för felsökning; ändra aldrig innehållet i denna ordbok.

source: This non-public class is the base class of all fundamental ctypes data types. It is mentioned here because it contains the common attributes of the fundamental ctypes data types. :class:`_SimpleCData` is a subclass of :class:`_CData`, so it inherits their methods and attributes. ctypes data types that are not and do not contain pointers can now be pickled.
pt_pt: Esta classe não pública é a classe base de todos os tipos de dados fundamentais ctypes. É mencionada aqui porque contém os atributos comuns dos tipos de dados fundamentais ctypes. :class:`_SimpleCData` é uma subclasse de :class:`_CData`, pelo que herda os seus métodos e atributos. Os tipos de dados ctypes que não são e não contêm ponteiros agora podem ser serializados.
sv: Denna icke-offentliga klass är basklass för alla grundläggande ctypes-datatyper. Den nämns här eftersom den innehåller de gemensamma attributen för de grundläggande ctypes-datatyperna. :class:`_SimpleCData` är en underklass till :class:`_CData`, så den ärver deras metoder och attribut. ctypes-datatyper som inte är och inte innehåller pekare kan nu picklas.

source: Instances have a single attribute:
pt_pt: As instâncias têm um único atributo:
sv: Instanser har ett enda attribut:

source: This attribute contains the actual value of the instance. For integer and pointer types, it is an integer, for character types, it is a single character bytes object or string, for character pointer types it is a Python bytes object or string.
pt_pt: Este atributo contém o valor real da instância. Para tipos inteiros e ponteiros, é um inteiro; para tipos de caracteres, é um objeto bytes de um único carácter ou uma string; para tipos de ponteiros de caracteres, é um objeto bytes ou uma string Python.
sv: Detta attribut innehåller det faktiska värdet för instansen. För heltals- och pekartyper är det ett heltal, för teckentyper är det ett objekt eller en sträng med enstaka teckenbytes, för teckenspekartyper är det ett objekt eller en sträng med Python-bytes.

source: When the ``value`` attribute is retrieved from a ctypes instance, usually a new object is returned each time. :mod:`ctypes` does *not* implement original object return, always a new object is constructed. The same is true for all other ctypes object instances.
pt_pt: Quando o atributo ``value`` é recuperado de uma instância ctypes, normalmente um novo objeto é devolvido cada vez. :mod:`ctypes` *não* implementa o retorno do objeto original; um novo objeto é sempre construído. O mesmo é verdadeiro para todas as outras instâncias de objetos ctypes.
sv: När attributet ``value`` hämtas från en ctypes-instans returneras vanligtvis ett nytt objekt varje gång. :mod:`ctypes` implementerar *inte* originalobjektretur, alltid konstrueras ett nytt objekt. Detsamma gäller för alla andra ctypes-objektinstanser.

source: Fundamental data types, when returned as foreign function call results, or, for example, by retrieving structure field members or array items, are transparently converted to native Python types. In other words, if a foreign function has a :attr:`~_CFuncPtr.restype` of :class:`c_char_p`, you will always receive a Python bytes object, *not* a :class:`c_char_p` instance.
pt_pt: Os tipos de dados fundamentais, quando devolvidos como resultados de chamadas de funções externas ou, por exemplo, ao recuperar membros de campos de estruturas ou itens de arrays, são convertidos transparente para tipos nativos do Python. Em outras palavras, se uma função externa tiver um :attr:`~_CFuncPtr.restype` de :class:`c_char_p`, receberá sempre um objeto bytes do Python, *não* uma instância de :class:`c_char_p`.
sv: Grundläggande datatyper, när de returneras som resultat av anrop från främmande funktioner, eller till exempel genom att hämta strukturfältmedlemmar eller arrayobjekt, konverteras transparent till ursprungliga Python-typer. Med andra ord, om en utländsk funktion har en :attr:`~_CFuncPtr.restype` av :class:`c_char_p`, kommer du alltid att få ett Python bytes-objekt, *inte* en :class:`c_char_p`-instans.

source: Subclasses of fundamental data types do *not* inherit this behavior. So, if a foreign functions :attr:`!restype` is a subclass of :class:`c_void_p`, you will receive an instance of this subclass from the function call. Of course, you can get the value of the pointer by accessing the ``value`` attribute.
pt_pt: As subclasses de tipos de dados fundamentais *não* herdam este comportamento. Assim, se o :attr:`!restype` de uma função externa for uma subclasse de :class:`c_void_p`, receberá uma instância desta subclasse da chamada da função. Claro, pode obter o valor do ponteiro acedendo ao atributo ``value``.
sv: Underklasser av grundläggande datatyper ärver *inte* detta beteende. Så om en utländsk funktion :attr:`!restype` är en subklass av :class:`c_void_p`, kommer du att få en instans av denna subklass från funktionsanropet. Naturligtvis kan du få pekarens värde genom att komma åt attributet ``value``.

source: These are the fundamental ctypes data types:
pt_pt: Estes são os tipos de dados fundamentais ctypes:
sv: Dessa är de grundläggande ctypes-datatyperna:

source: Represents the C :c:expr:`signed char` datatype, and interprets the value as small integer. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`signed char` e interpreta o valor como um inteiro pequeno. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar C:s datatyp :c:expr:`signed char` och tolkar värdet som ett litet heltal. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:expr:`char` datatype, and interprets the value as a single character. The constructor accepts an optional string initializer, the length of the string must be exactly one character.
pt_pt: Representa o tipo de dados C :c:expr:`char` e interpreta o valor como um único carácter. O construtor aceita um inicializador de string opcional; o comprimento da string deve ser exatamente um carácter.
sv: Representerar C :c:expr:`char`-datatypen och tolkar värdet som ett enda tecken. Konstruktören accepterar en valfri stränginitialiserare, strängens längd måste vara exakt ett tecken.

source: Represents the C :c:expr:`char *` datatype when it points to a zero-terminated string. For a general character pointer that may also point to binary data, ``POINTER(c_char)`` must be used. The constructor accepts an integer address, or a bytes object.
pt_pt: Representa o tipo de dados C :c:expr:`char *` quando aponta para uma string terminada por zero. Para um ponteiro de carácter geral que também pode apontar para dados binários, deve ser usado ``POINTER(c_char)``. O construtor aceita um endereço inteiro ou um objeto bytes.
sv: Representerar datatypen C :c:expr:`char *` när den pekar på en nollavslutad sträng. För en allmän teckenpekare som också kan peka på binära data måste ``POINTER(c_char)`` användas. Konstruktören accepterar en heltalsadress eller ett bytes-objekt.

source: Represents the C :c:expr:`double` datatype. The constructor accepts an optional float initializer.
pt_pt: Representa o tipo de dados C :c:expr:`double`. O construtor aceita um inicializador float opcional.
sv: Representerar datatypen C :c:expr:`double`. Konstruktören accepterar en valfri float-initialiserare.

source: Represents the C :c:expr:`long double` datatype. The constructor accepts an optional float initializer. On platforms where ``sizeof(long double) == sizeof(double)`` it is an alias to :class:`c_double`.
pt_pt: Representa o tipo de dados C :c:expr:`long double`. O construtor aceita um inicializador float opcional. Em plataformas onde ``sizeof(long double) == sizeof(double)``, é um alias para :class:`c_double`.
sv: Representerar datatypen C :c:expr:`long double`. Konstruktorn accepterar en valfri float-initialiserare. På plattformar där ``sizeof(long double) == sizeof(double)`` är det ett alias till :class:`c_double`.

source: Represents the C :c:expr:`float` datatype. The constructor accepts an optional float initializer.
pt_pt: Representa o tipo de dados C :c:expr:`float`. O construtor aceita um inicializador float opcional.
sv: Representerar datatypen C :c:expr:`float`. Konstruktören accepterar en valfri float-initialiserare.

source: Represents the C :c:expr:`signed int` datatype. The constructor accepts an optional integer initializer; no overflow checking is done. On platforms where ``sizeof(int) == sizeof(long)`` it is an alias to :class:`c_long`.
pt_pt: Representa o tipo de dados C :c:expr:`signed int`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow. Em plataformas onde ``sizeof(int) == sizeof(long)``, é um alias para :class:`c_long`.
sv: Representerar datatypen C :c:expr:`signed int`. Konstruktorn accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs. På plattformar där ``sizeof(int) == sizeof(long)`` är det ett alias till :class:`c_long`.

source: Represents the C 8-bit :c:expr:`signed int` datatype. It is an alias for :class:`c_byte`.
pt_pt: Representa o tipo de dados C 8-bit :c:expr:`signed int`. É um alias para :class:`c_byte`.
sv: Representerar C 8-bitars :c:expr:`signed int`-datatypen. Det är ett alias för :class:`c_byte`.

source: Represents the C 16-bit :c:expr:`signed int` datatype. Usually an alias for :class:`c_short`.
pt_pt: Representa o tipo de dados C 16-bit :c:expr:`signed int`. Normalmente um alias para :class:`c_short`.
sv: Representerar C 16-bitars :c:expr:`signed int`-datatypen. Vanligtvis ett alias för :class:`c_short`.

source: Represents the C 32-bit :c:expr:`signed int` datatype. Usually an alias for :class:`c_int`.
pt_pt: Representa o tipo de dados C 32-bit :c:expr:`signed int`. Normalmente um alias para :class:`c_int`.
sv: Representerar C 32-bitars :c:expr:`signed int`-datatypen. Vanligtvis ett alias för :class:`c_int`.

source: Represents the C 64-bit :c:expr:`signed int` datatype. Usually an alias for :class:`c_longlong`.
pt_pt: Representa o tipo de dados C 64-bit :c:expr:`signed int`. Normalmente um alias para :class:`c_longlong`.
sv: Representerar C 64-bitars :c:expr:`signed int`-datatypen. Vanligtvis ett alias för :class:`c_longlong`.

source: Represents the C :c:expr:`signed long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`signed long`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar datatypen C :c:expr:`signed long`. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:expr:`signed long long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`signed long long`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar datatypen C :c:expr:`signed long long`. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:expr:`signed short` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`signed short`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar datatypen C :c:expr:`signed short`. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:type:`size_t` datatype.
pt_pt: Representa o tipo de dados C :c:type:`size_t`.
sv: Representerar datatypen C :c:type:`size_t`.

source: Represents the C :c:type:`ssize_t` datatype.
pt_pt: Representa o tipo de dados C :c:type:`ssize_t`.
sv: Representerar datatypen C :c:type:`ssize_t`.

source: Represents the C :c:type:`time_t` datatype.
pt_pt: Representa o tipo de dados C :c:type:`time_t`.
sv: Representerar datatypen C :c:type:`time_t`.

source: Represents the C :c:expr:`unsigned char` datatype, it interprets the value as small integer. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`unsigned char` e interpreta o valor como um inteiro pequeno. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar C :c:expr:`unsigned char`-datatypen, tolkar värdet som ett litet heltal. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:expr:`unsigned int` datatype. The constructor accepts an optional integer initializer; no overflow checking is done. On platforms where ``sizeof(int) == sizeof(long)`` it is an alias for :class:`c_ulong`.
pt_pt: Representa o tipo de dados C :c:expr:`unsigned int`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow. Em plataformas onde ``sizeof(int) == sizeof(long)``, é um alias para :class:`c_ulong`.
sv: Representerar datatypen C :c:expr:`unsigned int`. Konstruktorn accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs. På plattformar där ``sizeof(int) == sizeof(long)`` är det ett alias för :class:`c_ulong`.

source: Represents the C 8-bit :c:expr:`unsigned int` datatype. It is an alias for :class:`c_ubyte`.
pt_pt: Representa o tipo de dados C 8-bit :c:expr:`unsigned int`. É um alias para :class:`c_ubyte`.
sv: Representerar C 8-bitars datatypen :c:expr:`unsigned int`. Det är ett alias för :class:`c_ubyte`.

source: Represents the C 16-bit :c:expr:`unsigned int` datatype. Usually an alias for :class:`c_ushort`.
pt_pt: Representa o tipo de dados C 16-bit :c:expr:`unsigned int`. Normalmente um alias para :class:`c_ushort`.
sv: Representerar C 16-bitars :c:expr:`unsigned int`-datatypen. Vanligtvis ett alias för :class:`c_ushort`.

source: Represents the C 32-bit :c:expr:`unsigned int` datatype. Usually an alias for :class:`c_uint`.
pt_pt: Representa o tipo de dados C 32-bit :c:expr:`unsigned int`. Normalmente um alias para :class:`c_uint`.
sv: Representerar C 32-bitars :c:expr:`unsigned int`-datatypen. Vanligtvis ett alias för :class:`c_uint`.

source: Represents the C 64-bit :c:expr:`unsigned int` datatype. Usually an alias for :class:`c_ulonglong`.
pt_pt: Representa o tipo de dados C 64-bit :c:expr:`unsigned int`. Normalmente um alias para :class:`c_ulonglong`.
sv: Representerar C 64-bitars :c:expr:`unsigned int`-datatypen. Vanligtvis ett alias för :class:`c_ulonglong`.

source: Represents the C :c:expr:`unsigned long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`unsigned long`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar datatypen C :c:expr:`unsigned long`. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:expr:`unsigned long long` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`unsigned long long`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar datatypen C :c:expr:`unsigned long long`. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:expr:`unsigned short` datatype. The constructor accepts an optional integer initializer; no overflow checking is done.
pt_pt: Representa o tipo de dados C :c:expr:`unsigned short`. O construtor aceita um inicializador inteiro opcional; não é feita verificação de overflow.
sv: Representerar datatypen C :c:expr:`unsigned short`. Konstruktören accepterar en valfri heltalsinitialiserare; ingen kontroll av överflöd görs.

source: Represents the C :c:expr:`void *` type. The value is represented as integer. The constructor accepts an optional integer initializer.
pt_pt: Representa o tipo C :c:expr:`void *`. O valor é representado como um inteiro. O construtor aceita um inicializador inteiro opcional.
sv: Representerar C :c:expr:`void *`-typen. Värdet representeras som ett heltal. Konstruktören accepterar en valfri heltalsinitialiserare.

source: Represents the C :c:type:`wchar_t` datatype, and interprets the value as a single character unicode string. The constructor accepts an optional string initializer, the length of the string must be exactly one character.
pt_pt: Representa o tipo de dados C :c:type:`wchar_t` e interpreta o valor como uma string Unicode de um único carácter. O construtor aceita um inicializador de string opcional; o comprimento da string deve ser exatamente um carácter.
sv: Representerar datatypen C :c:type:`wchar_t` och tolkar värdet som en unicode-sträng med ett tecken. Konstruktören accepterar en valfri stränginitialiserare, strängens längd måste vara exakt ett tecken.

source: Represents the C :c:expr:`wchar_t *` datatype, which must be a pointer to a zero-terminated wide character string. The constructor accepts an integer address, or a string.
pt_pt: Representa o tipo de dados C :c:expr:`wchar_t *`, que deve ser um ponteiro para uma string de caracteres largos terminada por zero. O construtor aceita um endereço inteiro ou uma string.
sv: Representerar datatypen C :c:expr:`wchar_t *`, som måste vara en pekare till en nollavslutad bred teckensträng. Konstruktören accepterar en heltalsadress eller en sträng.

source: Represent the C :c:expr:`bool` datatype (more accurately, :c:expr:`_Bool` from C99). Its value can be ``True`` or ``False``, and the constructor accepts any object that has a truth value.
pt_pt: Representa o tipo de dados C :c:expr:`bool` (mais precisamente, :c:expr:`_Bool` do C99). O seu valor pode ser ``True`` ou ``False``, e o construtor aceita qualquer objeto que tenha um valor de verdade.
sv: Representerar C:s datatyp :c:expr:`bool` (mer exakt :c:expr:`_Bool` från C99). Dess värde kan vara ``True`` eller ``False``, och konstruktören accepterar alla objekt som har ett sanningsvärde.

source: Represents a :c:type:`!HRESULT` value, which contains success or error information for a function or method call.
pt_pt: Representa um valor :c:type:`!HRESULT`, que contém informações de sucesso ou erro para uma chamada de função ou método.
sv: Representerar ett värde av :c:type:`!HRESULT`, som innehåller information om framgång eller fel för ett funktions- eller metodanrop.

source: Represents the C :c:expr:`PyObject *` datatype. Calling this without an argument creates a ``NULL`` :c:expr:`PyObject *` pointer.
pt_pt: Representa o tipo de dados C :c:expr:`PyObject *`. Chamar isto sem um argumento cria um ponteiro ``NULL`` :c:expr:`PyObject *`.
sv: Representerar datatypen C :c:expr:`PyObject *`. Anrop av detta utan argument skapar en ``NULL`` :c:expr:`PyObject *`-pekare.
