Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: All these types can be created by calling them with an optional initializer of the correct type and value::
pt_pt: Todos estes tipos podem ser criados chamando-os com um inicializador opcional do tipo e valor corretos:
sv: Alla dessa typer kan skapas genom att anropa dem med en valfri initialiserare av rätt typ och värde::

source: >>> c_int() c_long(0) >>> c_wchar_p("Hello, World") c_wchar_p(140018365411392) >>> c_ushort(-3) c_ushort(65533) >>>
sv: >>> c_int() c_long(0) >>> c_wchar_p("Hej, världen") c_wchar_p(140018365411392) >>> c_ushort(-3) c_ushort(65533) >>>

source: Since these types are mutable, their value can also be changed afterwards::
pt_pt: Como estes tipos são mutáveis, o seu valor também pode ser alterado posteriormente:
sv: Eftersom dessa typer är mutabla kan deras värde också ändras i efterhand::

source: >>> i = c_int(42) >>> print(i) c_long(42) >>> print(i.value) 42 >>> i.value = -99 >>> print(i.value) -99 >>>
sv: >>> i = c_int(42) >>> skriv ut(i) c_long(42) >>> print(i.värde) 42 >>> i.värde = -99 >>> skriv ut(i.värde) -99 >>>

source: Assigning a new value to instances of the pointer types :class:`c_char_p`, :class:`c_wchar_p`, and :class:`c_void_p` changes the *memory location* they point to, *not the contents* of the memory block (of course not, because Python string objects are immutable)::
pt_pt: Atribuir um novo valor a instâncias dos tipos de ponteiro :class:`c_char_p`, :class:`c_wchar_p` e :class:`c_void_p` altera a *localização de memória* para a qual apontam, *não o conteúdo* do bloco de memória (é claro, porque os objetos string do Python são imutáveis):
sv: Genom att tilldela ett nytt värde till instanser av pekartyperna :class:`c_char_p`, :class:`c_wchar_p` och :class:`c_void_p` ändras den *minnesplats* de pekar på, *inte innehållet* i minnesblocket (naturligtvis inte, eftersom Pythons strängobjekt är oföränderliga)::

source: >>> s = "Hello, World" >>> c_s = c_wchar_p(s) >>> print(c_s) c_wchar_p(139966785747344) >>> print(c_s.value) Hello World >>> c_s.value = "Hi, there" >>> print(c_s) # the memory location has changed c_wchar_p(139966783348904) >>> print(c_s.value) Hi, there >>> print(s) # first object is unchanged Hello, World >>>
pt_pt: >>> s = "Hello, World" >>> c_s = c_wchar_p(s) >>> print(c_s) c_wchar_p(139966785747344) >>> print(c_s.value) Hello World >>> c_s.value = "Hi, there" >>> print(c_s) # a localização de memória mudou c_wchar_p(139966783348904) >>> print(c_s.value) Hi, there >>> print(s) # o primeiro objeto permanece inalterado Hello, World >>>
sv: >>> s = "Hej, världen" >>> c_s = c_wchar_p(s) >>> skriv ut(c_s) c_wchar_p(139966785747344) >>> print(c_s.värde) Hej världen >>> c_s.value = "Hej, där" >>> print(c_s) # minnesplatsen har ändrats c_wchar_p(139966783348904) >>> skriv ut(c_s.värde) Hej, där >>> print(s) # första objektet är oförändrat Hallå, världen >>>

source: You should be careful, however, not to pass them to functions expecting pointers to mutable memory. If you need mutable memory blocks, ctypes has a :func:`create_string_buffer` function which creates these in various ways. The current memory block contents can be accessed (or changed) with the ``raw`` property; if you want to access it as NUL terminated string, use the ``value`` property::
pt_pt: Deve, no entanto, ter cuidado para não os passar para funções que esperam ponteiros para memória mutável. Se precisar de blocos de memória mutáveis, o ctypes tem uma função :func:`create_string_buffer` que os cria de várias formas. O conteúdo atual do bloco de memória pode ser acedido (ou alterado) com a propriedade ``raw``; se quiser aceder como uma string terminada em NUL, use a propriedade ``value``:
sv: Du bör dock vara försiktig så att du inte skickar dem till funktioner som förväntar sig pekare till föränderligt minne. Om du behöver föränderliga minnesblock har ctypes en :func:`create_string_buffer`-funktion som skapar dessa på olika sätt. Det aktuella innehållet i minnesblocket kan nås (eller ändras) med egenskapen ``raw``; om du vill komma åt det som en NUL-avslutad sträng, använd egenskapen ``value``::

source: >>> from ctypes import * >>> p = create_string_buffer(3) # create a 3 byte buffer, initialized to NUL bytes >>> print(sizeof(p), repr(p.raw)) 3 b'\x00\x00\x00' >>> p = create_string_buffer(b"Hello") # create a buffer containing a NUL terminated string >>> print(sizeof(p), repr(p.raw)) 6 b'Hello\x00' >>> print(repr(p.value)) b'Hello' >>> p = create_string_buffer(b"Hello", 10) # create a 10 byte buffer >>> print(sizeof(p), repr(p.raw)) 10 b'Hello\x00\x00\x00\x00\x00' >>> p.value = b"Hi" >>> print(sizeof(p), repr(p.raw)) 10 b'Hi\x00lo\x00\x00\x00\x00\x00' >>>
pt_pt: >>> from ctypes import * >>> p = create_string_buffer(3) # cria um buffer de 3 bytes, inicializado com bytes NUL >>> print(sizeof(p), repr(p.raw)) 3 b'\x00\x00\x00' >>> p = create_string_buffer(b"Hello") # cria um buffer contendo uma string terminada em NUL >>> print(sizeof(p), repr(p.raw)) 6 b'Hello\x00' >>> print(repr(p.value)) b'Hello' >>> p = create_string_buffer(b"Hello", 10) # cria um buffer de 10 bytes >>> print(sizeof(p), repr(p.raw)) 10 b'Hello\x00\x00\x00\x00\x00' >>> p.value = b"Hi" >>> print(sizeof(p), repr(p.raw)) 10 b'Hi\x00lo\x00\x00\x00\x00\x00' >>>
sv: >>> från ctypes import * >>> p = create_string_buffer(3) # skapa en buffert på 3 byte, initialiserad till NUL-byte >>> print(sizeof(p), repr(p.raw)) 3 b'\x00\x00\x00' >>> p = create_string_buffer(b"Hello") # skapa en buffert som innehåller en NUL-avslutad sträng >>> print(sizeof(p), repr(p.raw)) 6 b'Hej\x00' >>> skriv ut(repr(p.värde)) b'Hej' >>> p = create_string_buffer(b"Hello", 10) # skapa en buffert på 10 byte >>> print(sizeof(p), repr(p.raw)) 10 b'Hello\x00\x00\x00\x00\x00' >>> p.värde = b"Hej" >>> print(sizeof(p), repr(p.raw)) 10 b'Hi\x00lo\x00\x00\x00\x00\x00' >>>

source: The :func:`create_string_buffer` function replaces the old :func:`!c_buffer` function (which is still available as an alias). To create a mutable memory block containing unicode characters of the C type :c:type:`wchar_t`, use the :func:`create_unicode_buffer` function.
pt_pt: A função :func:`create_string_buffer` substitui a antiga função :func:`!c_buffer` (que ainda está disponível como um alias). Para criar um bloco de memória mutável contendo caracteres unicode do tipo C :c:type:`wchar_t`, use a função :func:`create_unicode_buffer`.
sv: Funktionen :func:`create_string_buffer` ersätter den gamla funktionen :func:`!c_buffer` (som fortfarande är tillgänglig som alias). För att skapa ett föränderligt minnesblock som innehåller unicode-tecken av C-typen :c:type:`wchar_t`, använd funktionen :func:`create_unicode_buffer`.

source: Calling functions, continued
pt_pt: Chamar funções (continuação)
sv: Anropsfunktioner, fortsättning

source: Note that printf prints to the real standard output channel, *not* to :data:`sys.stdout`, so these examples will only work at the console prompt, not from within *IDLE* or *PythonWin*::
pt_pt: Note que printf imprime para o canal de saída padrão real, *não* para :data:`sys.stdout`, pelo que estes exemplos só funcionarão no prompt da consola, não a partir do *IDLE* ou *PythonWin*:
sv: Observera att printf skriver ut till den riktiga standardutdatakanalen, *inte* till :data:`sys.stdout`, så dessa exempel fungerar bara vid konsolprompten, inte från *IDLE* eller *PythonWin*::

source: >>> printf = libc.printf >>> printf(b"Hello, %s\n", b"World!") Hello, World! 14 >>> printf(b"Hello, %S\n", "World!") Hello, World! 14 >>> printf(b"%d bottles of beer\n", 42) 42 bottles of beer 19 >>> printf(b"%f bottles of beer\n", 42.5) Traceback (most recent call last): File "<stdin>", line 1, in <module> ctypes.ArgumentError: argument 2: TypeError: Don't know how to convert parameter 2 >>>
sv: &gt;&gt;&gt; printf = libc.printf &gt;&gt;&gt; printf(b"Hej, %s\n", b"Världen!") Hej, världen! 14 &gt;&gt;&gt; printf(b"Hej, %S\n", "Världen!") Hej, världen! 14 &gt;&gt;&gt; printf(b"%d flaskor öl\n", 42) 42 flaskor öl 19 &gt;&gt;&gt; printf(b"%f flaskor öl\n", 42.5) Traceback (senaste anropet sist): Fil "<stdin>", rad 1, i <module> ctypes.ArgumentError: argument 2: TypeError: Vet inte hur man konverterar parameter 2 &gt;&gt;&gt

source: As has been mentioned before, all Python types except integers, strings, and bytes objects have to be wrapped in their corresponding :mod:`ctypes` type, so that they can be converted to the required C data type::
pt_pt: Como foi mencionado anteriormente, todos os tipos Python, exceto inteiros, strings e objetos bytes, têm de ser encapsulados no seu tipo :mod:`ctypes` correspondente, para que possam ser convertidos para o tipo de dados C necessário:
sv: Som tidigare nämnts måste alla Python-typer utom heltal, strängar och bytesobjekt förpackas i sin motsvarande :mod:`ctypes`-typ, så att de kan konverteras till den nödvändiga C-datatypen::

source: >>> printf(b"An int %d, a double %f\n", 1234, c_double(3.14)) An int 1234, a double 3.140000 31 >>>
sv: >>> printf(b"Ett int %d, en dubbel %f\n", 1234, c_double(3.14)) Ett int 1234, en dubbel 3,140000 31 >>>

source: Calling variadic functions
pt_pt: Chamar funções variádicas
sv: Anrop av variadiska funktioner

source: On a lot of platforms calling variadic functions through ctypes is exactly the same as calling functions with a fixed number of parameters. On some platforms, and in particular ARM64 for Apple Platforms, the calling convention for variadic functions is different than that for regular functions.
pt_pt: Em muitas plataformas, chamar funções variádicas através de ctypes é exatamente igual a chamar funções com um número fixo de parâmetros. Em algumas plataformas, e em particular ARM64 para plataformas Apple, a convenção de chamada para funções variádicas é diferente da das funções regulares.
sv: På många plattformar är det exakt samma sak att anropa variadiska funktioner via ctypes som att anropa funktioner med ett fast antal parametrar. På vissa plattformar, och i synnerhet ARM64 för Apple-plattformar, är anropskonventionen för variadiska funktioner annorlunda än för vanliga funktioner.

source: On those platforms it is required to specify the :attr:`~_CFuncPtr.argtypes` attribute for the regular, non-variadic, function arguments:
pt_pt: Nessas plataformas, é necessário especificar o atributo :attr:`~_CFuncPtr.argtypes` para os argumentos de função regulares, não variádicos:
sv: På dessa plattformar är det nödvändigt att ange attributet :attr:`~_CFuncPtr.argtypes` för de vanliga, icke-variadiska, funktionsargumenten:

source: Because specifying the attribute does not inhibit portability it is advised to always specify :attr:`~_CFuncPtr.argtypes` for all variadic functions.
pt_pt: Como especificar o atributo não inibe a portabilidade, é aconselhado especificar sempre :attr:`~_CFuncPtr.argtypes` para todas as funções variádicas.
sv: Eftersom angivandet av attributet inte hindrar portabilitet rekommenderas att alltid ange :attr:`~_CFuncPtr.argtypes` för alla variadiska funktioner.

source: Calling functions with your own custom data types
pt_pt: Chamar funções com os seus próprios tipos de dados personalizados
sv: Anropa funktioner med dina egna anpassade datatyper

source: You can also customize :mod:`ctypes` argument conversion to allow instances of your own classes be used as function arguments. :mod:`ctypes` looks for an :attr:`!_as_parameter_` attribute and uses this as the function argument. The attribute must be an integer, string, bytes, a :mod:`ctypes` instance, or an object with an :attr:`!_as_parameter_` attribute::
pt_pt: Também pode personalizar a conversão de argumentos :mod:`ctypes` para permitir que instâncias das suas próprias classes sejam usadas como argumentos de função. :mod:`ctypes` procura um atributo :attr:`!_as_parameter_` e usa-o como argumento da função. O atributo deve ser um inteiro, string, bytes, uma instância :mod:`ctypes` ou um objeto com um atributo :attr:`!_as_parameter_`::
sv: Du kan också anpassa :mod:`ctypes` argumentkonvertering så att instanser av dina egna klasser kan användas som funktionsargument. :mod:`ctypes` letar efter ett :attr:`!_as_parameter_`-attribut och använder detta som funktionsargument. Attributet måste vara ett heltal, en sträng, bytes, en :mod:`ctypes`-instans eller ett objekt med ett :attr:`!_as_parameter_`-attribut:

source: >>> class Bottles: ... def __init__(self, number): ... self._as_parameter_ = number ... >>> bottles = Bottles(42) >>> printf(b"%d bottles of beer\n", bottles) 42 bottles of beer 19 >>>
sv: >>> klass Flaskor: ... def __init__(self, number): ... self._as_parameter_ = antal ... >>> flaskor = Flaskor(42) >>> printf(b"%d flaskor öl\n", flaskor) 42 flaskor öl 19 >>>

source: If you don't want to store the instance's data in the :attr:`!_as_parameter_` instance variable, you could define a :class:`property` which makes the attribute available on request.
pt_pt: Se não quiser armazenar os dados da instância na variável de instância :attr:`!_as_parameter_`, pode definir uma :class:`property` que torna o atributo disponível quando solicitado.
sv: Om du inte vill lagra instansens data i instansvariabeln :attr:`!_as_parameter_` kan du definiera en :class:`property` som gör attributet tillgängligt på begäran.

source: Specifying the required argument types (function prototypes)
pt_pt: Especificar os tipos de argumentos necessários (protótipos de função)
sv: Ange de nödvändiga argumenttyperna (funktionsprototyper)

source: It is possible to specify the required argument types of functions exported from DLLs by setting the :attr:`~_CFuncPtr.argtypes` attribute.
pt_pt: É possível especificar os tipos de argumentos necessários de funções exportadas de DLLs definindo o atributo :attr:`~_CFuncPtr.argtypes`.
sv: Det är möjligt att ange vilka argumenttyper som krävs för funktioner som exporteras från DLL:er genom att ange attributet :attr:`~_CFuncPtr.argtypes`.

source: :attr:`~_CFuncPtr.argtypes` must be a sequence of C data types (the :func:`!printf` function is probably not a good example here, because it takes a variable number and different types of parameters depending on the format string, on the other hand this is quite handy to experiment with this feature)::
pt_pt: :attr:`~_CFuncPtr.argtypes` deve ser uma sequência de tipos de dados C (a função :func:`!printf` provavelmente não é um bom exemplo aqui, porque aceita um número variável e diferentes tipos de parâmetros dependendo da string de formato, por outro lado, isto é bastante útil para experimentar esta funcionalidade):
sv: :attr:`~_CFuncPtr.argtypes` måste vara en sekvens av C-datatyper (funktionen :func:`!printf` är förmodligen inte ett bra exempel här, eftersom den tar ett variabelt antal och olika typer av parametrar beroende på formatsträngen, å andra sidan är det ganska praktiskt att experimentera med den här funktionen)::

source: >>> printf.argtypes = [c_char_p, c_char_p, c_int, c_double] >>> printf(b"String '%s', Int %d, Double %f\n", b"Hi", 10, 2.2) String 'Hi', Int 10, Double 2.200000 37 >>>
sv: >>> printf.argtypes = [c_char_p, c_char_p, c_int, c_double] >>> printf(b"Sträng '%s', Int %d, Dubbel %f\n", b"Hej", 10, 2,2) Sträng "Hi", Int 10, Dubbel 2,200000 37 >>>

source: Specifying a format protects against incompatible argument types (just as a prototype for a C function), and tries to convert the arguments to valid types::
pt_pt: Especificar um formato protege contra tipos de argumentos incompatíveis (tal como um protótipo para uma função C) e tenta converter os argumentos para tipos válidos:
sv: Genom att ange ett format skyddar man sig mot inkompatibla argumenttyper (precis som en prototyp för en C-funktion) och försöker konvertera argumenten till giltiga typer::

source: >>> printf(b"%d %d %d", 1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> ctypes.ArgumentError: argument 2: TypeError: 'int' object cannot be interpreted as ctypes.c_char_p >>> printf(b"%s %d %f\n", b"X", 2, 3) X 2 3.000000 13 >>>
sv: &gt;&gt;&gt; printf(b"%d %d %d", 1, 2, 3) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> ctypes.ArgumentError: argument 2: TypeError: objektet 'int' kan inte tolkas som ctypes.c_char_p &gt;&gt;&gt; printf(b"%s %d %f\n", b"X", 2, 3) X 2 3.000000 13 &gt;&gt;&gt

source: If you have defined your own classes which you pass to function calls, you have to implement a :meth:`~_CData.from_param` class method for them to be able to use them in the :attr:`~_CFuncPtr.argtypes` sequence. The :meth:`~_CData.from_param` class method receives the Python object passed to the function call, it should do a typecheck or whatever is needed to make sure this object is acceptable, and then return the object itself, its :attr:`!_as_parameter_` attribute, or whatever you want to pass as the C function argument in this case. Again, the result should be an integer, string, bytes, a :mod:`ctypes` instance, or an object with an :attr:`!_as_parameter_` attribute.
pt_pt: Se definiu as suas próprias classes que passa para chamadas de função, tem de implementar um método de classe :meth:`~_CData.from_param` para elas para poder usá-las na sequência :attr:`~_CFuncPtr.argtypes`. O método de classe :meth:`~_CData.from_param` recebe o objeto Python passado para a chamada da função, deve fazer uma verificação de tipo ou o que for necessário para garantir que este objeto é aceitável, e depois devolver o próprio objeto, o seu atributo :attr:`!_as_parameter_`, ou o que quiser passar como argumento da função C neste caso. Mais uma vez, o resultado deve ser um inteiro, string, bytes, uma instância :mod:`ctypes`, ou um objeto com um atributo :attr:`!_as_parameter_`.
sv: Om du har definierat dina egna klasser som du skickar till funktionsanrop, måste du implementera en :meth:`~_CData.from_param` klassmetod för att de ska kunna använda dem i :attr:`~_CFuncPtr.argtypes` sekvensen. Klassmetoden :meth:`~_CData.from_param` tar emot Python-objektet som skickas till funktionsanropet, den bör göra en typkontroll eller vad som behövs för att se till att detta objekt är acceptabelt och sedan returnera själva objektet, dess :attr:`!_as_parameter_`-attribut eller vad du vill skicka som C-funktionsargument i det här fallet. Återigen bör resultatet vara ett heltal, en sträng, bytes, en :mod:`ctypes`-instans eller ett objekt med ett :attr:`!_as_parameter_`-attribut.

source: Return types
pt_pt: Tipos de retorno
sv: Typer av avkastning

source: By default functions are assumed to return the C :c:expr:`int` type. Other return types can be specified by setting the :attr:`~_CFuncPtr.restype` attribute of the function object.
pt_pt: Por predefinição, assume-se que as funções devolvem o tipo C :c:expr:`int`. Outros tipos de retorno podem ser especificados definindo o atributo :attr:`~_CFuncPtr.restype` do objeto função.
sv: Som standard antas funktioner returnera C :c:expr:`int`-typen. Andra returtyper kan anges genom att ställa in attributet :attr:`~_CFuncPtr.restype` för funktionsobjektet.

source: The C prototype of :c:func:`time` is ``time_t time(time_t *)``. Because :c:type:`time_t` might be of a different type than the default return type :c:expr:`int`, you should specify the :attr:`!restype` attribute::
pt_pt: O protótipo C de :c:func:`time` é ``time_t time(time_t *)``. Como :c:type:`time_t` pode ser de um tipo diferente do tipo de retorno predefinido :c:expr:`int`, deve especificar o atributo :attr:`!restype`:
sv: C-prototypen för :c:func:`time` är ``time_t time(time_t *)``. Eftersom :c:type:`time_t` kan vara av en annan typ än standardreturtypen :c:expr:`int`, bör du ange attributet :attr:`!restype`::

source: The argument types can be specified using :attr:`~_CFuncPtr.argtypes`::
pt_pt: Os tipos de argumentos podem ser especificados usando :attr:`~_CFuncPtr.argtypes`:
sv: Argumenttyperna kan anges med hjälp av :attr:`~_CFuncPtr.argtypes`::

source: To call the function with a ``NULL`` pointer as first argument, use ``None``::
pt_pt: Para chamar a função com um ponteiro ``NULL`` como primeiro argumento, use ``None``:
sv: Om du vill anropa funktionen med en ``NULL``-pekare som första argument använder du ``None``::

source: Here is a more advanced example, it uses the :func:`!strchr` function, which expects a string pointer and a char, and returns a pointer to a string::
pt_pt: Aqui está um exemplo mais avançado, que usa a função :func:`!strchr`, que espera um ponteiro para uma string e um char, e devolve um ponteiro para uma string:
sv: Här är ett mer avancerat exempel, det använder funktionen :func:`!strchr`, som förväntar sig en strängpekare och en char, och returnerar en pekare till en sträng::

source: >>> strchr = libc.strchr >>> strchr(b"abcdef", ord("d")) 8059983 >>> strchr.restype = c_char_p # c_char_p is a pointer to a string >>> strchr(b"abcdef", ord("d")) b'def' >>> print(strchr(b"abcdef", ord("x"))) None >>>
pt_pt: >>> strchr = libc.strchr >>> strchr(b"abcdef", ord("d")) 8059983 >>> strchr.restype = c_char_p # c_char_p é um ponteiro para uma string >>> strchr(b"abcdef", ord("d")) b'def' >>> print(strchr(b"abcdef", ord("x"))) None >>>
sv: >>> strchr = libc.strchr >>> strchr(b"abcdef", ord("d")) 8059983 >>> strchr.restype = c_char_p # c_char_p är en pekare till en sträng >>> strchr(b"abcdef", ord("d")) b'def' >>> print(strchr(b"abcdef", ord("x"))) Ingen >>>

source: If you want to avoid the :func:`ord("x") <ord>` calls above, you can set the :attr:`~_CFuncPtr.argtypes` attribute, and the second argument will be converted from a single character Python bytes object into a C char:
pt_pt: Se quiser evitar as chamadas :func:`ord("x") <ord>` acima, pode definir o atributo :attr:`~_CFuncPtr.argtypes`, e o segundo argumento será convertido de um objeto bytes Python de um único caráter para um char C:
sv: Om du vill undvika :func:`ord("x") <ord>`-anropen ovan kan du ställa in attributet :attr:`~_CFuncPtr.argtypes`, och det andra argumentet konverteras från ett Python bytes-objekt med ett tecken till ett C char:

source: >>> strchr.restype = c_char_p >>> strchr.argtypes = [c_char_p, c_char] >>> strchr(b"abcdef", b"d") b'def' >>> strchr(b"abcdef", b"def") Traceback (most recent call last): ctypes.ArgumentError: argument 2: TypeError: one character bytes, bytearray or integer expected >>> print(strchr(b"abcdef", b"x")) None >>> strchr(b"abcdef", b"d") b'def' >>>
pt_pt: >>> strchr.restype = c_char_p >>> strchr.argtypes = [c_char_p, c_char] >>> strchr(b"abcdef", b"d") b'def' >>> strchr(b"abcdef", b"def") Traceback (most recent call last): ctypes.ArgumentError: argumento 2: TypeError: esperado um byte, bytearray ou inteiro >>> print(strchr(b"abcdef", b"x")) None >>> strchr(b"abcdef", b"d") b'def' >>>
sv: >>> strchr.restype = c_char_p >>> strchr.argtypes = [c_char_p, c_char] >>> strchr(b"abcdef", b"d") b"def >>> strchr(b"abcdef", b"def") Traceback (senaste anropet senast): ctypes.ArgumentError: argument 2: TypeError: ett tecken bytes, bytearray eller heltal förväntas >>> print(strchr(b"abcdef", b"x")) Ingen >>> strchr(b"abcdef", b"d") b'def' >>>
