Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: You can also use a callable Python object (a function or a class for example) as the :attr:`~_CFuncPtr.restype` attribute, if the foreign function returns an integer. The callable will be called with the *integer* the C function returns, and the result of this call will be used as the result of your function call. This is useful to check for error return values and automatically raise an exception::
pt_pt: Também pode usar um objeto Python chamável (uma função ou uma classe, por exemplo) como o atributo :attr:`~_CFuncPtr.restype`, se a função externa devolver um inteiro. O objeto chamável será chamado com o *inteiro* que a função C devolve, e o resultado desta chamada será usado como o resultado da sua chamada de função. Isto é útil para verificar valores de retorno de erro e gerar automaticamente uma exceção:
sv: Du kan också använda ett anropbart Python-objekt (t.ex. en funktion eller en klass) som attributet :attr:`~_CFuncPtr.restype`, om den utländska funktionen returnerar ett heltal. Det anropbara objektet kommer att anropas med det *integer* som C-funktionen returnerar, och resultatet av detta anrop kommer att användas som resultatet av ditt funktionsanrop. Detta är användbart för att kontrollera felaktiga returvärden och automatiskt skapa ett undantag::

source: >>> GetModuleHandle = windll.kernel32.GetModuleHandleA >>> def ValidHandle(value): ... if value == 0: ... raise WinError() ... return value ... >>> >>> GetModuleHandle.restype = ValidHandle >>> GetModuleHandle(None) 486539264 >>> GetModuleHandle("something silly") Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 3, in ValidHandle OSError: [Errno 126] The specified module could not be found. >>>
pt_pt: >>> GetModuleHandle = windll.kernel32.GetModuleHandleA >>> def ValidHandle(value): ... if value == 0: ... raise WinError() ... return value ... >>> >>> GetModuleHandle.restype = ValidHandle >>> GetModuleHandle(None) 486539264 >>> GetModuleHandle("algo absurdo") Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 3, in ValidHandle OSError: [Errno 126] O módulo especificado não foi encontrado. >>>
sv: &gt;&gt;&gt; GetModuleHandle = windll.kernel32.GetModuleHandleA &gt;&gt;&gt; def ValidHandle(värde): ... om värde == 0: ... raise WinError() ... returnera värde ... &gt;&gt;&gt &gt;&gt;&gt; GetModuleHandle.restype = GiltigHandle &gt;&gt;&gt; HämtaModulHandle(Ingen) 486539264 &gt;&gt;&gt; GetModuleHandle("något fånigt") Traceback (senaste anropet sist): Fil "<stdin>", rad 1, i <module> Fil "<stdin>", rad 3, i ValidHandle OSError: [Errno 126] Den angivna modulen kunde inte hittas. &gt;&gt;&gt

source: ``WinError`` is a function which will call Windows ``FormatMessage()`` api to get the string representation of an error code, and *returns* an exception. ``WinError`` takes an optional error code parameter, if no one is used, it calls :func:`GetLastError` to retrieve it.
pt_pt: ``WinError`` é uma função que chamará a API Windows ``FormatMessage()`` para obter a representação em string de um código de erro e *devolve* uma exceção. ``WinError`` aceita um parâmetro opcional de código de erro; se nenhum for usado, chama :func:`GetLastError` para o obter.
sv: ``WinError`` är en funktion som anropar Windows ``FormatMessage()`` api för att få strängrepresentationen av en felkod, och *returnerar* ett undantag. ``WinError`` tar en valfri felkodsparameter, om ingen används anropar den :func:`GetLastError` för att hämta den.

source: Please note that a much more powerful error checking mechanism is available through the :attr:`~_CFuncPtr.errcheck` attribute; see the reference manual for details.
pt_pt: Note que um mecanismo de verificação de erros muito mais poderoso está disponível através do atributo :attr:`~_CFuncPtr.errcheck`; consulte o manual de referência para mais detalhes.
sv: Observera att en mycket kraftfullare felkontrollmekanism är tillgänglig via attributet :attr:`~_CFuncPtr.errcheck`; se referenshandboken för mer information.

source: Passing pointers (or: passing parameters by reference)
pt_pt: Passar ponteiros (ou: passar parâmetros por referência)
sv: Passera pekare (eller: passera parametrar genom referens)

source: Sometimes a C api function expects a *pointer* to a data type as parameter, probably to write into the corresponding location, or if the data is too large to be passed by value. This is also known as *passing parameters by reference*.
pt_pt: Às vezes, uma função de API C espera um *ponteiro* para um tipo de dados como parâmetro, provavelmente para escrever na localização correspondente, ou se os dados forem demasiado grandes para serem passados por valor. Isto também é conhecido como *passar parâmetros por referência*.
sv: Ibland förväntar sig en C api-funktion en *pekare* till en datatyp som parameter, förmodligen för att skriva till motsvarande plats, eller om data är för stora för att skickas med värde. Detta kallas också att *överföra parametrar genom referens*.

source: :mod:`ctypes` exports the :func:`byref` function which is used to pass parameters by reference. The same effect can be achieved with the :func:`pointer` function, although :func:`pointer` does a lot more work since it constructs a real pointer object, so it is faster to use :func:`byref` if you don't need the pointer object in Python itself::
pt_pt: :mod:`ctypes` exporta a função :func:`byref`, que é usada para passar parâmetros por referência. O mesmo efeito pode ser alcançado com a função :func:`pointer`, embora :func:`pointer` faça muito mais trabalho, uma vez que constrói um objeto ponteiro real, pelo que é mais rápido usar :func:`byref` se não precisar do objeto ponteiro em Python:
sv: :mod:`ctypes` exporterar funktionen :func:`byref` som används för att skicka parametrar som referenser. Samma effekt kan uppnås med funktionen :func:`pointer`, även om :func:`pointer` gör mycket mer arbete eftersom den konstruerar ett riktigt pekarobjekt, så det är snabbare att använda :func:`byref` om du inte behöver pekarobjektet i Python själv::

source: >>> i = c_int() >>> f = c_float() >>> s = create_string_buffer(b'\000' * 32) >>> print(i.value, f.value, repr(s.value)) 0 0.0 b'' >>> libc.sscanf(b"1 3.14 Hello", b"%d %f %s", ... byref(i), byref(f), s) 3 >>> print(i.value, f.value, repr(s.value)) 1 3.1400001049 b'Hello' >>>
sv: >>> i = c_int() >>> f = c_float() >>> s = skapa_sträng_buffer(b'\000' * 32) >>> print(i.värde, f.värde, repr(s.värde)) 0 0.0 b'' >>> libc.sscanf(b"1 3.14 Hello", b"%d %f %s", ... byref(i), byref(f), s) 3 >>> print(i.värde, f.värde, repr(s.värde)) 1 3.1400001049 b'Hello' >>>

source: Structures and unions
pt_pt: Estruturas e uniões
sv: Strukturer och fackföreningar

source: Structures and unions must derive from the :class:`Structure` and :class:`Union` base classes which are defined in the :mod:`ctypes` module. Each subclass must define a :attr:`~Structure._fields_` attribute. :attr:`!_fields_` must be a list of *2-tuples*, containing a *field name* and a *field type*.
pt_pt: Estruturas e uniões devem derivar das classes base :class:`Structure` e :class:`Union`, que estão definidas no módulo :mod:`ctypes`. Cada subclasse deve definir um atributo :attr:`~Structure._fields_`. :attr:`!_fields_` deve ser uma lista de *2-tuplos*, contendo um *nome de campo* e um *tipo de campo*.
sv: Strukturer och unioner måste härledas från basklasserna :class:`Structure` och :class:`Union` som definieras i modulen :mod:`ctypes`. Varje underklass måste definiera ett attribut :attr:`~Structure._fields_`. :attr:`!_fields_` måste vara en lista med *2-tuples*, innehållande ett *fältsnamn* och en *fältstyp*.

source: The field type must be a :mod:`ctypes` type like :class:`c_int`, or any other derived :mod:`ctypes` type: structure, union, array, pointer.
pt_pt: O tipo de campo deve ser um tipo :mod:`ctypes`, como :class:`c_int`, ou qualquer outro tipo derivado de :mod:`ctypes`: estrutura, união, array, ponteiro.
sv: Fälttypen måste vara en :mod:`ctypes`-typ som :class:`c_int`, eller någon annan härledd :mod:`ctypes`-typ: struktur, union, array, pekare.

source: Here is a simple example of a POINT structure, which contains two integers named *x* and *y*, and also shows how to initialize a structure in the constructor::
pt_pt: Aqui está um exemplo simples de uma estrutura POINT, que contém dois inteiros chamados *x* e *y*, e também mostra como inicializar uma estrutura no construtor:
sv: Här följer ett enkelt exempel på en POINT-struktur, som innehåller två heltal med namnen *x* och *y*, och som också visar hur man initialiserar en struktur i konstruktorn::

source: >>> from ctypes import * >>> class POINT(Structure): ... _fields_ = [("x", c_int), ... ("y", c_int)] ... >>> point = POINT(10, 20) >>> print(point.x, point.y) 10 20 >>> point = POINT(y=5) >>> print(point.x, point.y) 0 5 >>> POINT(1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: too many initializers >>>
pt_pt: >>> from ctypes import * >>> class POINT(Structure): ... _fields_ = [("x", c_int), ... ("y", c_int)] ... >>> point = POINT(10, 20) >>> print(point.x, point.y) 10 20 >>> point = POINT(y=5) >>> print(point.x, point.y) 0 5 >>> POINT(1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: demasiados inicializadores >>>
sv: &gt;&gt;&gt; från ctypes importera * &gt;&gt;&gt; klass POINT(Struktur): ... _fields_ = [("x", c_int), ... ("y", c_int)] ... &gt;&gt;&gt; punkt = POINT(10, 20) &gt;&gt;&gt; print(punkt.x, punkt.y) 10 20 &gt;&gt;&gt; punkt = PUNKT(y=5) &gt;&gt;&gt; skriv ut(punkt.x, punkt.y) 0 5 &gt;&gt;&gt; PUNKT(1, 2, 3) Traceback (senaste anropet sist): Fil "<stdin>", rad 1, i <module> TypeError: för många initialiserare &gt;&gt;&gt

source: You can, however, build much more complicated structures. A structure can itself contain other structures by using a structure as a field type.
pt_pt: Pode, no entanto, construir estruturas muito mais complicadas. Uma estrutura pode ela própria conter outras estruturas, usando uma estrutura como tipo de campo.
sv: Det går dock att bygga mycket mer komplicerade strukturer. En struktur kan i sig innehålla andra strukturer genom att använda en struktur som fälttyp.

source: Here is a RECT structure which contains two POINTs named *upperleft* and *lowerright*::
pt_pt: Aqui está uma estrutura RECT que contém dois POINTs chamados *upperleft* e *lowerright*:
sv: Här är en RECT-struktur som innehåller två POINTs med namnen *upperleft* och *lowerright*::

source: >>> class RECT(Structure): ... _fields_ = [("upperleft", POINT), ... ("lowerright", POINT)] ... >>> rc = RECT(point) >>> print(rc.upperleft.x, rc.upperleft.y) 0 5 >>> print(rc.lowerright.x, rc.lowerright.y) 0 0 >>>
sv: >>> klass RECT(Struktur): ... _fields_ = [("upperleft", POINT), ... ("lowerright", POINT)] ... >>> rc = RECT(punkt) >>> print(rc.upperleft.x, rc.upperleft.y) 0 5 >>> print(rc.lowerright.x, rc.lowerright.y) 0 0 >>>

source: Nested structures can also be initialized in the constructor in several ways::
pt_pt: Estruturas aninhadas também podem ser inicializadas no construtor de várias formas:
sv: Nästlade strukturer kan också initialiseras i konstruktorn på flera sätt::

source: >>> r = RECT(POINT(1, 2), POINT(3, 4)) >>> r = RECT((1, 2), (3, 4))
sv: >>> r = RECT(PUNKT(1, 2), PUNKT(3, 4)) >>> r = RECT((1, 2), (3, 4))

source: :mod:`ctypes` does not support passing unions or structures with bit-fields to functions by value. While this may work on 32-bit x86, it's not guaranteed by the library to work in the general case. Unions and structures with bit-fields should always be passed to functions by pointer.
pt_pt: :mod:`ctypes` não suporta passar uniões ou estruturas com campos de bits para funções por valor. Embora isto possa funcionar em x86 de 32 bits, não é garantido pela biblioteca que funcione no caso geral. Uniões e estruturas com campos de bits devem sempre ser passadas para funções por ponteiro.
sv: :mod:`ctypes` har inte stöd för att skicka unioner eller strukturer med bitfält till funktioner med värde. Även om detta kan fungera på 32-bitars x86, garanteras det inte av biblioteket att det fungerar i det allmänna fallet. Unioner och strukturer med bitfält bör alltid skickas till funktioner med pekare.

source: :mod:`ctypes` uses the native byte order for Structures and Unions. To build structures with non-native byte order, you can use one of the :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion`, and :class:`LittleEndianUnion` base classes. These classes cannot contain pointer fields.
pt_pt: :mod:`ctypes` usa a ordem de bytes nativa para Estruturas e Uniões. Para construir estruturas com ordem de bytes não nativa, pode usar uma das classes base :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion` e :class:`LittleEndianUnion`. Estas classes não podem conter campos de ponteiro.
sv: :mod:`ctypes` använder den ursprungliga byteordningen för strukturer och unioner. Om du vill bygga strukturer med en annan byteordning kan du använda någon av basklasserna :class:`BigEndianStructure`, :class:`LittleEndianStructure`, :class:`BigEndianUnion` och :class:`LittleEndianUnion`. Dessa klasser kan inte innehålla pekarfält.

source: Bit fields in structures and unions
pt_pt: Campos de bits em estruturas e uniões
sv: Bitfält i strukturer och fackföreningar

source: It is possible to create structures and unions containing bit fields. Bit fields are only possible for integer fields, the bit width is specified as the third item in the :attr:`~Structure._fields_` tuples::
pt_pt: É possível criar estruturas e uniões contendo campos de bits. Campos de bits só são possíveis para campos inteiros; a largura do bit é especificada como o terceiro item nos tuplos :attr:`~Structure._fields_`:
sv: Det är möjligt att skapa strukturer och unioner som innehåller bitfält. Bitfält är endast möjliga för heltalsfält, bitbredden anges som det tredje objektet i :attr:`~Structure._fields_`-tuplerna::

source: Arrays
sv: Arrayer

source: Arrays are sequences, containing a fixed number of instances of the same type.
pt_pt: Arrays são sequências que contêm um número fixo de instâncias do mesmo tipo.
sv: Arrayer är sekvenser som innehåller ett fast antal instanser av samma typ.

source: The recommended way to create array types is by multiplying a data type with a positive integer::
pt_pt: A forma recomendada de criar tipos de array é multiplicando um tipo de dados por um inteiro positivo:
sv: Det rekommenderade sättet att skapa array-typer är genom att multiplicera en datatyp med ett positivt heltal::

source: TenPointsArrayType = POINT * 10
sv: TenPointsArrayType = PUNKT * 10

source: Here is an example of a somewhat artificial data type, a structure containing 4 POINTs among other stuff::
pt_pt: Aqui está um exemplo de um tipo de dados algo artificial, uma estrutura que contém 4 POINTs entre outras coisas:
sv: Här är ett exempel på en något artificiell datatyp, en struktur som bland annat innehåller 4 POINTs::

source: >>> from ctypes import * >>> class POINT(Structure): ... _fields_ = ("x", c_int), ("y", c_int) ... >>> class MyStruct(Structure): ... _fields_ = [("a", c_int), ... ("b", c_float), ... ("point_array", POINT * 4)] >>> >>> print(len(MyStruct().point_array)) 4 >>>
sv: >>> från ctypes importera * >>> klass POINT(Struktur): ... _fields_ = ("x", c_int), ("y", c_int) ... >>> klass MyStruct(Struktur): ... _fields_ = [("a", c_int), ... ("b", c_float), ... ("point_array", POINT * 4)] >>> >>> print(len(MyStruct().point_array)) 4 >>>

source: Instances are created in the usual way, by calling the class::
pt_pt: As instâncias são criadas da forma habitual, chamando a classe:
sv: Instanser skapas på vanligt sätt, genom att anropa class::

source: arr = TenPointsArrayType() for pt in arr: print(pt.x, pt.y)
sv: arr = TenPointsArrayType() för pt i arr: print(pt.x, pt.y)

source: The above code print a series of ``0 0`` lines, because the array contents is initialized to zeros.
pt_pt: O código acima imprime uma série de linhas ``0 0``, porque o conteúdo do array é inicializado com zeros.
sv: Ovanstående kod skriver ut en serie ``0 0`` rader, eftersom matrisens innehåll är initialiserat till nollor.

source: Initializers of the correct type can also be specified::
pt_pt: Inicializadores do tipo correto também podem ser especificados:
sv: Initialiserare av rätt typ kan också anges::

source: >>> from ctypes import * >>> TenIntegers = c_int * 10 >>> ii = TenIntegers(1, 2, 3, 4, 5, 6, 7, 8, 9, 10) >>> print(ii) <c_long_Array_10 object at 0x...> >>> for i in ii: print(i, end=" ") ... 1 2 3 4 5 6 7 8 9 10 >>>
sv: >>> från ctypes import * >>> TenIntegers = c_int * 10 >>> ii = TenIntegers(1, 2, 3, 4, 5, 6, 7, 8, 9, 10) >>> print(ii) <c_long_Array_10-objekt vid 0x...> >>> för i i ii >>> for i in ii: print(i, end=" ") ... 1 2 3 4 5 6 7 8 9 10 >>>

source: Pointers
pt_pt: Ponteiros
sv: Pekare

source: Pointer instances are created by calling the :func:`pointer` function on a :mod:`ctypes` type::
pt_pt: Instâncias de ponteiros são criadas chamando a função :func:`pointer` num tipo :mod:`ctypes`:
sv: Pekarinstanser skapas genom att anropa funktionen :func:`pointer` på en :mod:`ctypes`-typ::

source: >>> from ctypes import * >>> i = c_int(42) >>> pi = pointer(i) >>>
sv: >>> från ctypes import * >>> i = c_int(42) >>> pi = pekare(i) >>>

source: Pointer instances have a :attr:`~_Pointer.contents` attribute which returns the object to which the pointer points, the ``i`` object above::
pt_pt: Instâncias de ponteiros têm um atributo :attr:`~_Pointer.contents` que devolve o objeto para o qual o ponteiro aponta, o objeto ``i`` acima:
sv: Pekarinstanser har ett :attr:`~_Pointer.contents`-attribut som returnerar det objekt som pekaren pekar på, ``i``-objektet ovan::

source: >>> pi.contents c_long(42) >>>
sv: >>> pi.innehåll c_long(42) >>>

source: Note that :mod:`ctypes` does not have OOR (original object return), it constructs a new, equivalent object each time you retrieve an attribute::
pt_pt: Note que :mod:`ctypes` não tem OOR (original object return); constrói um novo objeto equivalente cada vez que recupera um atributo:
sv: Observera att :mod:`ctypes` inte har OOR (original object return), utan konstruerar ett nytt, likvärdigt objekt varje gång du hämtar ett attribut::

source: >>> pi.contents is i False >>> pi.contents is pi.contents False >>>
sv: >>> pi.innehåll är i Falskt >>> pi.innehåll är pi.innehåll Falskt >>>

source: Assigning another :class:`c_int` instance to the pointer's contents attribute would cause the pointer to point to the memory location where this is stored::
pt_pt: Atribuir outra instância :class:`c_int` ao atributo contents do ponteiro faria com que o ponteiro apontasse para a localização de memória onde esta está armazenada:
sv: Om du tilldelar en annan :class:`c_int`-instans till pekarens innehållsattribut skulle pekaren peka på den minnesplats där detta är lagrat::

source: >>> i = c_int(99) >>> pi.contents = i >>> pi.contents c_long(99) >>>
sv: >>> i = c_int(99) >>> pi.innehåll = i >>> pi.innehåll c_long(99) >>>

source: Pointer instances can also be indexed with integers::
pt_pt: Instâncias de ponteiros também podem ser indexadas com inteiros:
sv: Pekarinstanser kan också indexeras med heltal::

source: Assigning to an integer index changes the pointed to value::
pt_pt: Atribuir a um índice inteiro altera o valor apontado:
sv: Genom att tilldela ett heltalsindex ändras det pekade till värdet::

source: >>> print(i) c_long(99) >>> pi[0] = 22 >>> print(i) c_long(22) >>>
sv: >>> skriv ut(i) c_long(99) >>> pi[0] = 22 >>> skriv ut(i) c_long(22) >>>

source: It is also possible to use indexes different from 0, but you must know what you're doing, just as in C: You can access or change arbitrary memory locations. Generally you only use this feature if you receive a pointer from a C function, and you *know* that the pointer actually points to an array instead of a single item.
pt_pt: Também é possível usar índices diferentes de 0, mas deve saber o que está a fazer, tal como em C: pode aceder ou alterar localizações de memória arbitrárias. Geralmente, só usa esta funcionalidade se receber um ponteiro de uma função C e *saber* que o ponteiro aponta na verdade para um array em vez de um único item.
sv: Det är också möjligt att använda index som skiljer sig från 0, men du måste veta vad du gör, precis som i C: Du kan komma åt eller ändra godtyckliga minnesplatser. I allmänhet använder du bara den här funktionen om du får en pekare från en C-funktion och du *vet* att pekaren faktiskt pekar på en array i stället för på ett enda objekt.

source: Behind the scenes, the :func:`pointer` function does more than simply create pointer instances, it has to create pointer *types* first. This is done with the :func:`POINTER` function, which accepts any :mod:`ctypes` type, and returns a new type::
pt_pt: Por trás dos panos, a função :func:`pointer` faz mais do que simplesmente criar instâncias de ponteiro; primeiro, tem de criar *tipos* de ponteiro. Isto é feito com a função :func:`POINTER`, que aceita qualquer tipo :mod:`ctypes` e devolve um novo tipo:
sv: Bakom kulisserna gör funktionen :func:`pointer` mer än att bara skapa pekarinstanser, den måste först skapa pekar*typer*. Detta görs med funktionen :func:`POINTER`, som accepterar vilken typ som helst av :mod:`ctypes` och returnerar en ny typ::

source: >>> PI = POINTER(c_int) >>> PI <class 'ctypes.LP_c_long'> >>> PI(42) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: expected c_long instead of int >>> PI(c_int(42)) <ctypes.LP_c_long object at 0x...> >>>
pt_pt: >>> PI = POINTER(c_int) >>> PI <class 'ctypes.LP_c_long'> >>> PI(42) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: esperado c_long em vez de int >>> PI(c_int(42)) <ctypes.LP_c_long object at 0x...> >>>
sv: &gt;&gt;&gt; PI = POINTER(c_int) &gt;&gt;&gt; PI <class 'ctypes.LP_c_long'> &gt;&gt;&gt; PI(42) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: förväntade c_long istället för int &gt;&gt;&gt; PI(c_int(42)) <ctypes.LP_c_long object at 0x...> &gt;&gt;&gt

source: Calling the pointer type without an argument creates a ``NULL`` pointer. ``NULL`` pointers have a ``False`` boolean value::
pt_pt: Chamar o tipo de ponteiro sem argumento cria um ponteiro ``NULL``. Ponteiros ``NULL`` têm um valor booleano ``False``:
sv: Anrop av pekartypen utan ett argument skapar en ``NULL``-pekare. ``NULL`` pekare har ett ``False`` boolean värde::

source: >>> null_ptr = POINTER(c_int)() >>> print(bool(null_ptr)) False >>>
sv: >>> null_ptr = POINTER(c_int)() >>> print(bool(null_ptr)) Falsk >>>

source: :mod:`ctypes` checks for ``NULL`` when dereferencing pointers (but dereferencing invalid non-\ ``NULL`` pointers would crash Python)::
pt_pt: :mod:`ctypes` verifica ``NULL`` ao desreferenciar ponteiros (mas desreferenciar ponteiros inválidos não-``NULL`` faria o Python falhar):
sv: :mod:`ctypes` kontrollerar för ``NULL`` vid dereferencing av pekare (men dereferencing av ogiltiga icke ``NULL`` pekare skulle krascha Python)::

source: >>> null_ptr[0] Traceback (most recent call last): .... ValueError: NULL pointer access >>> >>> null_ptr[0] = 1234 Traceback (most recent call last): .... ValueError: NULL pointer access >>>
pt_pt: >>> null_ptr[0] Traceback (most recent call last): .... ValueError: acesso a ponteiro NULL >>> >>> null_ptr[0] = 1234 Traceback (most recent call last): .... ValueError: acesso a ponteiro NULL >>>
sv: >>> null_ptr[0] Traceback (senaste anropet senast): .... Värdefel: Tillgång till NULL-pekare >>> >>> null_ptr[0] = 1234 Traceback (senaste anropet senast): .... Värdefel (ValueError): Tillgång till NULL-pekare >>>
