Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: Type conversions
pt_pt: Conversões de tipo
sv: Typkonverteringar

source: Usually, ctypes does strict type checking. This means, if you have ``POINTER(c_int)`` in the :attr:`~_CFuncPtr.argtypes` list of a function or as the type of a member field in a structure definition, only instances of exactly the same type are accepted. There are some exceptions to this rule, where ctypes accepts other objects. For example, you can pass compatible array instances instead of pointer types. So, for ``POINTER(c_int)``, ctypes accepts an array of c_int::
pt_pt: Normalmente, ctypes faz verificação estrita de tipos. Isto significa que, se tiver ``POINTER(c_int)`` na lista :attr:`~_CFuncPtr.argtypes` de uma função ou como o tipo de um campo membro numa definição de estrutura, apenas instâncias exatamente do mesmo tipo são aceites. Existem algumas exceções a esta regra, onde ctypes aceita outros objetos. Por exemplo, pode passar instâncias de array compatíveis em vez de tipos de ponteiro. Assim, para ``POINTER(c_int)``, ctypes aceita um array de c_int:
sv: Vanligtvis gör ctypes en strikt typkontroll. Detta innebär att om du har ``POINTER(c_int)`` i :attr:`~_CFuncPtr.argtypes`-listan för en funktion eller som typ för ett medlemsfält i en strukturdefinition, accepteras endast instanser av exakt samma typ. Det finns några undantag från denna regel, där ctypes accepterar andra objekt. Du kan t.ex. skicka kompatibla array-instanser i stället för pekartyper. Så för ``POINTER(c_int)`` accepterar ctypes en array av c_int::

source: >>> class Bar(Structure): ... _fields_ = [("count", c_int), ("values", POINTER(c_int))] ... >>> bar = Bar() >>> bar.values = (c_int * 3)(1, 2, 3) >>> bar.count = 3 >>> for i in range(bar.count): ... print(bar.values[i]) ... 1 2 3 >>>
sv: >>> klass Bar(Struktur): ... _fields_ = [("count", c_int), ("values", POINTER(c_int))] ... >>> bar = Bar() >>> bar.värden = (c_int * 3)(1, 2, 3) >>> bar.count = 3 >>> for i in range(bar.count): ... print(bar.värden[i]) ... 1 2 3 >>>

source: In addition, if a function argument is explicitly declared to be a pointer type (such as ``POINTER(c_int)``) in :attr:`~_CFuncPtr.argtypes`, an object of the pointed type (``c_int`` in this case) can be passed to the function. ctypes will apply the required :func:`byref` conversion in this case automatically.
pt_pt: Além disso, se um argumento de função for explicitamente declarado como um tipo de ponteiro (como ``POINTER(c_int)``) em :attr:`~_CFuncPtr.argtypes`, um objeto do tipo apontado (``c_int`` neste caso) pode ser passado para a função. O ctypes aplicará automaticamente a conversão necessária :func:`byref` neste caso.
sv: Dessutom, om ett funktionsargument uttryckligen deklareras vara en pekartyp (t.ex. ``POINTER(c_int)``) i :attr:`~_CFuncPtr.argtypes`, kan ett objekt av pekartypen (``c_int`` i detta fall) skickas till funktionen. ctypes kommer att tillämpa den nödvändiga :func:`byref`-konverteringen i detta fall automatiskt.

source: To set a POINTER type field to ``NULL``, you can assign ``None``::
pt_pt: Para definir um campo do tipo POINTER para ``NULL``, pode atribuir ``None``:
sv: För att ställa in ett fält av typen POINTER till ``NULL`` kan du tilldela ``None``::

source: >>> bar.values = None >>>
sv: >>> bar.värden = Ingen >>>

source: Sometimes you have instances of incompatible types. In C, you can cast one type into another type. :mod:`ctypes` provides a :func:`cast` function which can be used in the same way. The ``Bar`` structure defined above accepts ``POINTER(c_int)`` pointers or :class:`c_int` arrays for its ``values`` field, but not instances of other types::
pt_pt: Às vezes, tem instâncias de tipos incompatíveis. Em C, pode converter um tipo noutro tipo. :mod:`ctypes` fornece uma função :func:`cast` que pode ser usada da mesma forma. A estrutura ``Bar`` definida acima aceita ponteiros ``POINTER(c_int)`` ou arrays :class:`c_int` para o seu campo ``values``, mas não instâncias de outros tipos:
sv: Ibland har man instanser av inkompatibla typer. I C kan du casta en typ till en annan typ. :mod:`ctypes` tillhandahåller en :func:`cast`-funktion som kan användas på samma sätt. Strukturen ``Bar`` som definieras ovan accepterar ``POINTER(c_int)`` pekare eller :class:`c_int` matriser för sitt ``values`` fält, men inte instanser av andra typer::

source: >>> bar.values = (c_byte * 4)() Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: incompatible types, c_byte_Array_4 instance instead of LP_c_long instance >>>
pt_pt: >>> bar.values = (c_byte * 4)() Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: tipos incompatíveis, instância c_byte_Array_4 em vez de instância LP_c_long >>>
sv: &gt;&gt;&gt; bar.värden = (c_byte * 4)() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: inkompatibla typer, c_byte_Array_4-instans istället för LP_c_long-instans &gt;&gt;&gt

source: For these cases, the :func:`cast` function is handy.
pt_pt: Para estes casos, a função :func:`cast` é útil.
sv: I dessa fall är funktionen :func:`cast` praktisk.

source: The :func:`cast` function can be used to cast a ctypes instance into a pointer to a different ctypes data type. :func:`cast` takes two parameters, a ctypes object that is or can be converted to a pointer of some kind, and a ctypes pointer type. It returns an instance of the second argument, which references the same memory block as the first argument::
pt_pt: A função :func:`cast` pode ser usada para converter uma instância ctypes num ponteiro para um tipo de dados ctypes diferente. :func:`cast` recebe dois parâmetros: um objeto ctypes que é ou pode ser convertido num ponteiro de algum tipo, e um tipo de ponteiro ctypes. Devolve uma instância do segundo argumento, que referencia o mesmo bloco de memória que o primeiro argumento:
sv: Funktionen :func:`cast` kan användas för att casta en ctypes-instans till en pekare på en annan ctypes-datatyp. :func:`cast` tar två parametrar, ett ctypes-objekt som är eller kan konverteras till en pekare av något slag och en ctypes-pekartyp. Den returnerar en instans av det andra argumentet, som refererar till samma minnesblock som det första argumentet::

source: >>> a = (c_byte * 4)() >>> cast(a, POINTER(c_int)) <ctypes.LP_c_long object at ...> >>>
sv: >>> a = (c_byte * 4)() >>> cast(a, POINTER(c_int)) <ctypes.LP_c_long-objekt vid ...> >>>

source: So, :func:`cast` can be used to assign to the ``values`` field of ``Bar`` the structure::
pt_pt: Assim, :func:`cast` pode ser usado para atribuir ao campo ``values`` da estrutura ``Bar``:
sv: Så :func:`cast` kan användas för att tilldela fältet ``values`` i ``Bar`` strukturen::

source: >>> bar = Bar() >>> bar.values = cast((c_byte * 4)(), POINTER(c_int)) >>> print(bar.values[0]) 0 >>>
sv: >>> bar = Bar() >>> bar.values = cast((c_byte * 4)(), POINTER(c_int)) >>> print(bar.värden[0]) 0 >>>

source: Incomplete Types
pt_pt: Tipos Incompletos
sv: Ofullständiga typer

source: *Incomplete Types* are structures, unions or arrays whose members are not yet specified. In C, they are specified by forward declarations, which are defined later::
pt_pt: *Tipos Incompletos* são estruturas, uniões ou arrays cujos membros ainda não estão especificados. Em C, são especificados por declarações antecipadas, que são definidas mais tarde:
sv: *Ofullständiga typer* är strukturer, unioner eller matriser vars medlemmar ännu inte har specificerats. I C specificeras de genom forward-deklarationer, som definieras senare::

source: struct cell; /* forward declaration */ struct cell { char *name; struct cell *next; };
pt_pt: struct cell; /* declaração antecipada */ struct cell { char *name; struct cell *next; };
sv: struct cell; /* framåtdeklaration */ struct cell { char *namn; strukturcell *nästa; };

source: The straightforward translation into ctypes code would be this, but it does not work::
pt_pt: A tradução direta para código ctypes seria esta, mas não funciona:
sv: Den raka översättningen till ctypes-kod skulle vara denna, men det fungerar inte::

source: >>> class cell(Structure): ... _fields_ = [("name", c_char_p), ... ("next", POINTER(cell))] ... Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 2, in cell NameError: name 'cell' is not defined >>>
sv: &gt;&gt;&gt; klass cell(Struktur): ... _fields_ = [("name", c_char_p), ... ("next", POINTER(cell))] ... Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> Fil "<stdin>", rad 2, i cell NameError: namnet 'cell' är inte definierat &gt;&gt;&gt

source: because the new ``class cell`` is not available in the class statement itself. In :mod:`ctypes`, we can define the ``cell`` class and set the :attr:`~Structure._fields_` attribute later, after the class statement::
pt_pt: porque a nova ``class cell`` não está disponível na própria instrução de classe. Em :mod:`ctypes`, podemos definir a classe ``cell`` e definir o atributo :attr:`~Structure._fields_` mais tarde, após a instrução de classe:
sv: eftersom den nya ``class cell`` inte är tillgänglig i själva klassuttalandet. I :mod:`ctypes` kan vi definiera klassen ``cell`` och ställa in attributet :attr:`~Structure._fields_` senare, efter klassuttalandet::

source: >>> from ctypes import * >>> class cell(Structure): ... pass ... >>> cell._fields_ = [("name", c_char_p), ... ("next", POINTER(cell))] >>>
sv: >>> från ctypes importera * >>> klass cell(Struktur): ... pass ... >>> cell._fields_ = [("name", c_char_p), ... ("next", POINTER(cell))] >>>

source: Let's try it. We create two instances of ``cell``, and let them point to each other, and finally follow the pointer chain a few times::
pt_pt: Vamos experimentar. Criamos duas instâncias de ``cell``, fazemos com que apontem uma para a outra e, finalmente, seguimos a cadeia de ponteiros algumas vezes:
sv: Låt oss prova det. Vi skapar två instanser av ``cell``, och låter dem peka på varandra, och följer slutligen pekarkedjan några gånger::

source: >>> c1 = cell() >>> c1.name = b"foo" >>> c2 = cell() >>> c2.name = b"bar" >>> c1.next = pointer(c2) >>> c2.next = pointer(c1) >>> p = c1 >>> for i in range(8): ... print(p.name, end=" ") ... p = p.next[0] ... foo bar foo bar foo bar foo bar >>>
sv: >>> c1 = cell() >>> c1.namn = b"foo" >>> c2 = cell() >>> c2.namn = b"bar" >>> c1.nästa = pekare(c2) >>> c2.nästa = pekare(c1) >>> p = c1 >>> för i i intervall(8): ... print(p.namn, end=" ") ... p = p.nästa[0] ... foo bar foo bar foo bar foo bar foo bar >>>

source: Callback functions
pt_pt: Funções de retorno de chamada
sv: Återkallelsefunktioner

source: :mod:`ctypes` allows creating C callable function pointers from Python callables. These are sometimes called *callback functions*.
pt_pt: :mod:`ctypes` permite criar ponteiros de função chamáveis em C a partir de objetos chamáveis em Python. Estas são por vezes chamadas *funções de retorno de chamada*.
sv: :mod:`ctypes` gör det möjligt att skapa C-kallbara funktionspoängare från Python-kallbara funktioner. Dessa kallas ibland för *callback-funktioner*.

source: First, you must create a class for the callback function. The class knows the calling convention, the return type, and the number and types of arguments this function will receive.
pt_pt: Primeiro, deve criar uma classe para a função de retorno de chamada. A classe conhece a convenção de chamada, o tipo de retorno e o número e tipos de argumentos que esta função receberá.
sv: Först måste du skapa en klass för återuppringningsfunktionen. Klassen känner till anropskonventionen, returtypen och antalet och typerna av argument som denna funktion kommer att ta emot.

source: The :func:`CFUNCTYPE` factory function creates types for callback functions using the ``cdecl`` calling convention. On Windows, the :func:`WINFUNCTYPE` factory function creates types for callback functions using the ``stdcall`` calling convention.
pt_pt: A função de fábrica :func:`CFUNCTYPE` cria tipos para funções de retorno de chamada usando a convenção de chamada ``cdecl``. No Windows, a função de fábrica :func:`WINFUNCTYPE` cria tipos para funções de retorno de chamada usando a convenção de chamada ``stdcall``.
sv: Fabriksfunktionen :func:`CFUNCTYPE` skapar typer för återuppringningsfunktioner med hjälp av anropskonventionen ``cdecl``. I Windows skapar fabriksfunktionen :func:`WINFUNCTYPE` typer för återkallningsfunktioner med hjälp av anropskonventionen ``stdcall``.

source: Both of these factory functions are called with the result type as first argument, and the callback functions expected argument types as the remaining arguments.
pt_pt: Ambas estas funções de fábrica são chamadas com o tipo de resultado como primeiro argumento e os tipos de argumentos esperados pelas funções de retorno de chamada como argumentos restantes.
sv: Båda dessa fabriksfunktioner anropas med resultattypen som första argument, och callback-funktionernas förväntade argumenttyper som resterande argument.

source: I will present an example here which uses the standard C library's :c:func:`!qsort` function, that is used to sort items with the help of a callback function. :c:func:`!qsort` will be used to sort an array of integers::
pt_pt: Vou apresentar aqui um exemplo que usa a função :c:func:`!qsort` da biblioteca C padrão, que é usada para ordenar itens com a ajuda de uma função de retorno de chamada. :c:func:`!qsort` será usada para ordenar um array de inteiros:
sv: Jag kommer här att presentera ett exempel som använder standard C-bibliotekets :c:func:`!qsort`-funktion, som används för att sortera objekt med hjälp av en callback-funktion. :c:func:`!qsort` kommer att användas för att sortera en array av heltal::

source: >>> IntArray5 = c_int * 5 >>> ia = IntArray5(5, 1, 7, 33, 99) >>> qsort = libc.qsort >>> qsort.restype = None >>>
sv: >>> IntArray5 = c_int * 5 >>> ia = IntArray5(5, 1, 7, 33, 99) >>> qsort = libc.qsort >>> qsort.restype = Ingen >>>

source: :func:`!qsort` must be called with a pointer to the data to sort, the number of items in the data array, the size of one item, and a pointer to the comparison function, the callback. The callback will then be called with two pointers to items, and it must return a negative integer if the first item is smaller than the second, a zero if they are equal, and a positive integer otherwise.
pt_pt: :func:`!qsort` deve ser chamada com um ponteiro para os dados a ordenar, o número de itens no array de dados, o tamanho de um item e um ponteiro para a função de comparação, a função de retorno de chamada. A função de retorno de chamada será então chamada com dois ponteiros para itens e deve devolver um inteiro negativo se o primeiro item for menor que o segundo, zero se forem iguais e um inteiro positivo caso contrário.
sv: :func:`!qsort` måste anropas med en pekare till de data som skall sorteras, antalet objekt i dataarrayen, storleken på ett objekt och en pekare till jämförelsefunktionen, callback. Callbacken anropas sedan med två pekare till objekt och måste returnera ett negativt heltal om det första objektet är mindre än det andra, en nolla om de är lika stora och ett positivt heltal annars.

source: So our callback function receives pointers to integers, and must return an integer. First we create the ``type`` for the callback function::
pt_pt: Assim, a nossa função de retorno de chamada recebe ponteiros para inteiros e deve devolver um inteiro. Primeiro, criamos o ``type`` para a função de retorno de chamada:
sv: Så vår callback-funktion tar emot pekare till heltal och måste returnera ett heltal. Först skapar vi ``typ`` för callback-funktionen::

source: To get started, here is a simple callback that shows the values it gets passed::
pt_pt: Para começar, aqui está um retorno de chamada simples que mostra os valores que recebe:
sv: För att komma igång, här är en enkel callback som visar de värden den får skickade till sig::

source: The result::
pt_pt: O resultado:
sv: Resultatet::

source: Now we can actually compare the two items and return a useful result::
pt_pt: Agora podemos comparar os dois itens e devolver um resultado útil:
sv: Nu kan vi faktiskt jämföra de två objekten och returnera ett användbart resultat::

source: As we can easily check, our array is sorted now::
pt_pt: Como podemos verificar facilmente, o nosso array está agora ordenado:
sv: Som vi lätt kan kontrollera är vår matris nu sorterad::

source: The function factories can be used as decorator factories, so we may as well write::
pt_pt: As fábricas de funções podem ser usadas como fábricas de decoradores, pelo que também podemos escrever:
sv: Funktionsfabrikerna kan användas som dekoratorfabriker, så vi kan lika gärna skriva::

source: Make sure you keep references to :func:`CFUNCTYPE` objects as long as they are used from C code. :mod:`ctypes` doesn't, and if you don't, they may be garbage collected, crashing your program when a callback is made.
pt_pt: Certifique-se de que mantém referências a objetos :func:`CFUNCTYPE` enquanto forem usados a partir de código C. :mod:`ctypes` não o faz, e se não o fizer, podem ser recolhidos pelo garbage collector, fazendo com que o seu programa falhe quando for feito um retorno de chamada.
sv: Se till att du behåller referenser till :func:`CFUNCTYPE`-objekt så länge som de används från C-kod. :mod:`ctypes` gör inte det, och om du inte gör det kan de bli garbage collected, vilket kraschar ditt program när en callback görs.

source: Also, note that if the callback function is called in a thread created outside of Python's control (e.g. by the foreign code that calls the callback), ctypes creates a new dummy Python thread on every invocation. This behavior is correct for most purposes, but it means that values stored with :class:`threading.local` will *not* survive across different callbacks, even when those calls are made from the same C thread.
pt_pt: Além disso, note que se a função de retorno de chamada for chamada numa thread criada fora do controlo do Python (por exemplo, pelo código externo que chama o retorno de chamada), o ctypes cria uma nova thread Python fictícia em cada invocação. Este comportamento é correto para a maioria dos fins, mas significa que os valores armazenados com :class:`threading.local` *não* sobreviverão entre diferentes retornos de chamada, mesmo quando essas chamadas são feitas a partir da mesma thread C.
sv: Observera också att om återuppringningsfunktionen anropas i en tråd som skapats utanför Pythons kontroll (t.ex. av den utländska kod som anropar återuppringningen), skapar ctypes en ny dummy Python-tråd vid varje anrop. Detta beteende är korrekt för de flesta ändamål, men det innebär att värden som lagras med :class:`threading.local` *inte* kommer att överleva mellan olika anrop, även när dessa anrop görs från samma C-tråd.

source: Accessing values exported from dlls
pt_pt: Aceder a valores exportados de dlls
sv: Tillgång till värden exporterade från dll-filer

source: Some shared libraries not only export functions, they also export variables. An example in the Python library itself is the :c:data:`Py_Version`, Python runtime version number encoded in a single constant integer.
pt_pt: Algumas bibliotecas partilhadas não exportam apenas funções, também exportam variáveis. Um exemplo na própria biblioteca Python é o :c:data:`Py_Version`, número de versão do ambiente de execução Python codificado num único inteiro constante.
sv: Vissa delade bibliotek exporterar inte bara funktioner, utan även variabler. Ett exempel i själva Python-biblioteket är :c:data:`Py_Version`, Pythons versionsnummer för runtime kodat i ett enda konstant heltal.

source: :mod:`ctypes` can access values like this with the :meth:`~_CData.in_dll` class methods of the type. *pythonapi* is a predefined symbol giving access to the Python C api::
pt_pt: :mod:`ctypes` pode aceder a valores como este com os métodos de classe :meth:`~_CData.in_dll` do tipo. *pythonapi* é um símbolo predefinido que dá acesso à API C do Python:
sv: :mod:`ctypes` kan komma åt värden som detta med :meth:`~_CData.in_dll` klassmetoderna för typen. *pythonapi* är en fördefinierad symbol som ger tillgång till Python C api::

source: >>> version = ctypes.c_int.in_dll(ctypes.pythonapi, "Py_Version") >>> print(hex(version.value)) 0x30c00a0
sv: >>> version = ctypes.c_int.in_dll(ctypes.pythonapi, "Py_Version") >>> print(hex(version.värde)) 0x30c00a0

source: An extended example which also demonstrates the use of pointers accesses the :c:data:`PyImport_FrozenModules` pointer exported by Python.
pt_pt: Um exemplo estendido que também demonstra o uso de ponteiros acede ao ponteiro :c:data:`PyImport_FrozenModules` exportado pelo Python.
sv: Ett utökat exempel som också demonstrerar användningen av pekare kommer åt :c:data:`PyImport_FrozenModules`-pekaren som exporteras av Python.

source: Quoting the docs for that value:
pt_pt: Citando a documentação para esse valor:
sv: Citerar dokumenten för det värdet:

source: This pointer is initialized to point to an array of :c:struct:`_frozen` records, terminated by one whose members are all ``NULL`` or zero. When a frozen module is imported, it is searched in this table. Third-party code could play tricks with this to provide a dynamically created collection of frozen modules.
pt_pt: Este ponteiro é inicializado para apontar para uma array de registos :c:struct:`_frozen`, terminada por um cujos membros são todos ``NULL`` ou zero. Quando um módulo congelado é importado, ele é procurado nesta tabela. Código de terceiros poderia usar isso para fornecer uma coleção criada dinamicamente de módulos congelados.
sv: Denna pekare initialiseras så att den pekar på en array av :c:struct:`_frozen`\-poster, som avslutas med en post vars alla medlemmar är ``NULL`` eller noll. När en fryst modul importeras söks den i den här tabellen. Tredjepartskod kan använda detta för att skapa en dynamiskt skapad samling av frysta moduler.

source: So manipulating this pointer could even prove useful. To restrict the example size, we show only how this table can be read with :mod:`ctypes`::
pt_pt: Assim, manipular este ponteiro poderia até ser útil. Para restringir o tamanho do exemplo, mostramos apenas como esta tabela pode ser lida com :mod:`ctypes`:
sv: Så att manipulera denna pekare kan till och med visa sig vara användbart. För att begränsa exemplets storlek visar vi bara hur denna tabell kan läsas med :mod:`ctypes`::

source: >>> from ctypes import * >>> >>> class struct_frozen(Structure): ... _fields_ = [("name", c_char_p), ... ("code", POINTER(c_ubyte)), ... ("size", c_int), ... ("get_code", POINTER(c_ubyte)), # Function pointer ... ] ... >>>
pt_pt: >>> from ctypes import * >>> >>> class struct_frozen(Structure): ... _fields_ = [("name", c_char_p), ... ("code", POINTER(c_ubyte)), ... ("size", c_int), ... ("get_code", POINTER(c_ubyte)), # Ponteiro de função ... ] ... >>>
sv: >>> från ctypes import * >>> >>> klass struct_frozen(Struktur): ... _fields_ = [("name", c_char_p), ... ("code", POINTER(c_ubyte)), ... ("size", c_int), ... ("get_code", POINTER(c_ubyte)), # Funktionspekare ... ] ... >>>

source: We have defined the :c:struct:`_frozen` data type, so we can get the pointer to the table::
pt_pt: Definimos o tipo de dados :c:struct:`_frozen`, pelo que podemos obter o ponteiro para a tabela:
sv: Vi har definierat datatypen :c:struct:`_frozen`, så vi kan hämta pekaren till tabellen::

source: >>> FrozenTable = POINTER(struct_frozen) >>> table = FrozenTable.in_dll(pythonapi, "_PyImport_FrozenBootstrap") >>>
sv: >>> FrozenTable = POINTER(struct_frozen) >>> tabell = FrozenTable.in_dll(pythonapi, "_PyImport_FrozenBootstrap") >>>
