Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: :mod:`!ctypes` --- A foreign function library for Python
pt_pt: :mod:`!ctypes` --- Uma biblioteca de funções externas para Python
sv: :mod:`!ctypes` --- Ett bibliotek med främmande funktioner för Python

source: **Source code:** :source:`Lib/ctypes`
pt_pt: **Código-fonte:** :source:`Lib/ctypes`
sv: **Källkod:** :source:`Lib/ctypes`

source: :mod:`ctypes` is a foreign function library for Python. It provides C compatible data types, and allows calling functions in DLLs or shared libraries. It can be used to wrap these libraries in pure Python.
pt_pt: :mod:`ctypes` é uma biblioteca de funções externas para Python. Fornece tipos de dados compatíveis com C e permite chamar funções em DLLs ou bibliotecas partilhadas. Pode ser usada para encapsular estas bibliotecas em Python puro.
sv: :mod:`ctypes` är ett bibliotek med främmande funktioner för Python. Det tillhandahåller C-kompatibla datatyper och gör det möjligt att anropa funktioner i DLL:er eller delade bibliotek. Det kan användas för att paketera dessa bibliotek i ren Python.

source: ctypes tutorial
pt_pt: tutorial de ctypes
sv: ctypes handledning

source: Note: The code samples in this tutorial use :mod:`doctest` to make sure that they actually work. Since some code samples behave differently under Linux, Windows, or macOS, they contain doctest directives in comments.
pt_pt: Nota: Os exemplos de código neste tutorial usam :mod:`doctest` para garantir que funcionam. Como alguns exemplos de código se comportam de forma diferente em Linux, Windows ou macOS, contêm diretivas de doctest nos comentários.
sv: Observera: I kodproverna i den här handledningen används :mod:`doctest` för att säkerställa att de faktiskt fungerar. Eftersom vissa kodprover beter sig olika under Linux, Windows eller macOS innehåller de doctest-direktiv i kommentarerna.

source: Note: Some code samples reference the ctypes :class:`c_int` type. On platforms where ``sizeof(long) == sizeof(int)`` it is an alias to :class:`c_long`. So, you should not be confused if :class:`c_long` is printed if you would expect :class:`c_int` --- they are actually the same type.
pt_pt: Nota: Alguns exemplos de código referenciam o tipo :class:`c_int` de ctypes. Em plataformas onde ``sizeof(long) == sizeof(int)``, é um alias para :class:`c_long`. Portanto, não deve ficar confuso se :class:`c_long` for impresso quando esperava :class:`c_int` — são, na verdade, o mesmo tipo.
sv: Observera: I vissa kodexempel hänvisas till typen ctypes :class:`c_int`. På plattformar där ``sizeof(long) == sizeof(int)`` är det ett alias till :class:`c_long`. Så du bör inte bli förvirrad om :class:`c_long` skrivs ut när du förväntar dig :class:`c_int` --- de är faktiskt samma typ.

source: Loading dynamic link libraries
pt_pt: Carregar bibliotecas de ligação dinâmica
sv: Ladda dynamiska länkbibliotek

source: :mod:`ctypes` exports the *cdll*, and on Windows *windll* and *oledll* objects, for loading dynamic link libraries.
pt_pt: :mod:`ctypes` exporta os objetos *cdll* e, no Windows, *windll* e *oledll*, para carregar bibliotecas de ligação dinâmica.
sv: :mod:`ctypes` exporterar objekten *cdll*, och i Windows *windll* och *oledll*, för laddning av dynamiska länkbibliotek.

source: You load libraries by accessing them as attributes of these objects. *cdll* loads libraries which export functions using the standard ``cdecl`` calling convention, while *windll* libraries call functions using the ``stdcall`` calling convention. *oledll* also uses the ``stdcall`` calling convention, and assumes the functions return a Windows :c:type:`!HRESULT` error code. The error code is used to automatically raise an :class:`OSError` exception when the function call fails.
pt_pt: Carrega bibliotecas acedendo a elas como atributos destes objetos. *cdll* carrega bibliotecas que exportam funções usando a convenção de chamada ``cdecl`` padrão, enquanto *windll* carrega bibliotecas que chamam funções usando a convenção de chamada ``stdcall``. *oledll* também usa a convenção de chamada ``stdcall`` e assume que as funções devolvem um código de erro Windows :c:type:`!HRESULT`. O código de erro é usado para gerar automaticamente uma exceção :class:`OSError` quando a chamada da função falha.
sv: Du laddar bibliotek genom att komma åt dem som attribut till dessa objekt. *cdll* laddar bibliotek som exporterar funktioner med hjälp av standardkonventionen ``cdecl``, medan *windll*-bibliotek anropar funktioner med hjälp av konventionen ``stdcall``. *oledll* använder också anropskonventionen ``stdcall`` och antar att funktionerna returnerar en Windows :c:type:`!HRESULT`-felkod. Felkoden används för att automatiskt skapa ett :class:`OSError`-undantag när funktionsanropet misslyckas.

source: Windows errors used to raise :exc:`WindowsError`, which is now an alias of :exc:`OSError`.
pt_pt: Os erros do Windows costumavam gerar :exc:`WindowsError`, que agora é um alias de :exc:`OSError`.
sv: Windows-fel gav tidigare upphov till :exc:`WindowsError`, som nu är ett alias för :exc:`OSError`.

source: Here are some examples for Windows. Note that ``msvcrt`` is the MS standard C library containing most standard C functions, and uses the ``cdecl`` calling convention::
pt_pt: Aqui estão alguns exemplos para Windows. Note que ``msvcrt`` é a biblioteca C padrão da MS que contém a maioria das funções C padrão e usa a convenção de chamada ``cdecl``:
sv: Här är några exempel för Windows. Observera att ``msvcrt`` är MS standard C-bibliotek som innehåller de flesta standard C-funktioner och använder ``cdecl`` anropskonventionen::

source: >>> from ctypes import * >>> print(windll.kernel32) <WinDLL 'kernel32', handle ... at ...> >>> print(cdll.msvcrt) <CDLL 'msvcrt', handle ... at ...> >>> libc = cdll.msvcrt >>>
sv: >>> från ctypes import * >>> print(windll.kernel32) <WinDLL 'kernel32', handtag ... vid ...> >>> print(windll msvcrt) >>> print(cdll.msvcrt) <CDLL 'msvcrt', handtag ... vid ...> >>> libc = cdll.msvcrt >>>

source: Windows appends the usual ``.dll`` file suffix automatically.
pt_pt: O Windows adiciona automaticamente o sufixo de ficheiro ``.dll`` habitual.
sv: Windows lägger till det vanliga filsuffixet ``.dll`` automatiskt.

source: Accessing the standard C library through ``cdll.msvcrt`` will use an outdated version of the library that may be incompatible with the one being used by Python. Where possible, use native Python functionality, or else import and use the ``msvcrt`` module.
pt_pt: Aceder à biblioteca C padrão através de ``cdll.msvcrt`` usará uma versão desatualizada da biblioteca que pode ser incompatível com a usada pelo Python. Sempre que possível, use a funcionalidade nativa do Python, ou então importe e use o módulo ``msvcrt``.
sv: Om du använder standard C-biblioteket via ``cdll.msvcrt`` kommer du att använda en föråldrad version av biblioteket som kan vara inkompatibel med den som används av Python. Där det är möjligt, använd Pythons inbyggda funktionalitet, eller importera och använd modulen ``msvcrt``.

source: On Linux, it is required to specify the filename *including* the extension to load a library, so attribute access can not be used to load libraries. Either the :meth:`~LibraryLoader.LoadLibrary` method of the dll loaders should be used, or you should load the library by creating an instance of CDLL by calling the constructor::
pt_pt: No Linux, é necessário especificar o nome do ficheiro *incluindo* a extensão para carregar uma biblioteca, pelo que o acesso por atributo não pode ser usado para carregar bibliotecas. Ou deve ser usado o método :meth:`~LibraryLoader.LoadLibrary` dos carregadores de dll, ou deve carregar a biblioteca criando uma instância de CDLL chamando o construtor:
sv: Under Linux måste filnamnet *inklusive* tillägget anges för att ladda ett bibliotek, så attributåtkomst kan inte användas för att ladda bibliotek. Antingen bör metoden :meth:`~LibraryLoader.LoadLibrary` i dll-laddarna användas, eller så bör du ladda biblioteket genom att skapa en instans av CDLL genom att anropa konstruktören::

source: >>> cdll.LoadLibrary("libc.so.6") <CDLL 'libc.so.6', handle ... at ...> >>> libc = CDLL("libc.so.6") >>> libc <CDLL 'libc.so.6', handle ... at ...> >>>
sv: >>> cdll.LoadLibrary("libc.so.6") <CDLL 'libc.so.6', handtag ... vid ...> >>> libc = CDLL("libc.so.6") >>> libc = CDLL("libc.so.6") >>> libc <CDLL 'libc.so.6', handtag ... vid ...> >>>

source: Accessing functions from loaded dlls
pt_pt: Aceder a funções de bibliotecas carregadas
sv: Åtkomst till funktioner från inlästa dll-filer

source: Functions are accessed as attributes of dll objects::
pt_pt: As funções são acedidas como atributos de objetos dll:
sv: Funktioner är åtkomliga som attribut till dll-objekt::

source: >>> libc.printf <_FuncPtr object at 0x...> >>> print(windll.kernel32.GetModuleHandleA) <_FuncPtr object at 0x...> >>> print(windll.kernel32.MyOwnFunction) Traceback (most recent call last): File "<stdin>", line 1, in <module> File "ctypes.py", line 239, in __getattr__ func = _StdcallFuncPtr(name, self) AttributeError: function 'MyOwnFunction' not found >>>
sv: &gt;&gt;&gt; libc.printf <_FuncPtr object at 0x...> &gt;&gt;&gt; print(windll.kernel32.GetModuleHandleA) <_FuncPtr object at 0x...> &gt;&gt;&gt; Skriv ut(windll.kernel32.MyOwnFunction) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> Fil "ctypes.py", rad 239, i __getattr__ func = _StdcallFuncPtr(namn, self) AttributeError: funktionen 'MyOwnFunction' hittades inte &gt;&gt;&gt

source: Note that win32 system dlls like ``kernel32`` and ``user32`` often export ANSI as well as UNICODE versions of a function. The UNICODE version is exported with a ``W`` appended to the name, while the ANSI version is exported with an ``A`` appended to the name. The win32 ``GetModuleHandle`` function, which returns a *module handle* for a given module name, has the following C prototype, and a macro is used to expose one of them as ``GetModuleHandle`` depending on whether UNICODE is defined or not::
pt_pt: Note que as dlls do sistema win32 como ``kernel32`` e ``user32`` exportam frequentemente versões ANSI e UNICODE de uma função. A versão UNICODE é exportada com um ``W`` anexado ao nome, enquanto a versão ANSI é exportada com um ``A`` anexado ao nome. A função win32 ``GetModuleHandle``, que devolve um *handle* de módulo para um nome de módulo dado, tem o seguinte protótipo C, e uma macro é usada para expor uma delas como ``GetModuleHandle`` dependendo se UNICODE está definido ou não:
sv: Observera att Win32-systemdLL:er som ``kernel32`` och ``user32`` ofta exporterar både ANSI- och UNICODE-versioner av en funktion. UNICODE-versionen exporteras med ``W`` som tillägg till namnet, medan ANSI-versionen exporteras med ``A`` som tillägg till namnet. Win32-funktionen ``GetModuleHandle``, som returnerar ett *modulhandtag* för ett givet modulnamn, har följande C-prototyp, och ett makro används för att exponera en av dem som ``GetModuleHandle`` beroende på om UNICODE är definierat eller inte::

source: *windll* does not try to select one of them by magic, you must access the version you need by specifying ``GetModuleHandleA`` or ``GetModuleHandleW`` explicitly, and then call it with bytes or string objects respectively.
pt_pt: *windll* não tenta selecionar uma delas por magia, deve aceder à versão que precisa especificando explicitamente ``GetModuleHandleA`` ou ``GetModuleHandleW`` e depois chamá-la com objetos bytes ou string, respetivamente.
sv: *windll* försöker inte välja en av dem med magi, du måste komma åt den version du behöver genom att ange ``GetModuleHandleA`` eller ``GetModuleHandleW`` uttryckligen, och sedan anropa den med bytes- respektive strängobjekt.

source: Sometimes, dlls export functions with names which aren't valid Python identifiers, like ``"??2@YAPAXI@Z"``. In this case you have to use :func:`getattr` to retrieve the function::
pt_pt: Às vezes, as dlls exportam funções com nomes que não são identificadores Python válidos, como ``"??2@YAPAXI@Z"``. Neste caso, tem de usar :func:`getattr` para recuperar a função:
sv: Ibland exporterar dll-filer funktioner med namn som inte är giltiga Python-identifierare, som ``"??2@YAPAXI@Z"``. I det här fallet måste du använda :func:`getattr` för att hämta funktionen::

source: >>> getattr(cdll.msvcrt, "??2@YAPAXI@Z") <_FuncPtr object at 0x...> >>>
sv: >>> getattr(cdll.msvcrt, "??2@YAPAXI@Z") <_FuncPtr-objekt på 0x ...> >>>

source: On Windows, some dlls export functions not by name but by ordinal. These functions can be accessed by indexing the dll object with the ordinal number::
pt_pt: No Windows, algumas dlls exportam funções não por nome, mas por ordinal. Estas funções podem ser acedidas indexando o objeto dll com o número ordinal:
sv: I Windows exporterar vissa dll-filer funktioner inte efter namn utan efter ordinal. Dessa funktioner kan nås genom att indexera dll-objektet med ordinalnumret::

source: >>> cdll.kernel32[1] <_FuncPtr object at 0x...> >>> cdll.kernel32[0] Traceback (most recent call last): File "<stdin>", line 1, in <module> File "ctypes.py", line 310, in __getitem__ func = _StdcallFuncPtr(name, self) AttributeError: function ordinal 0 not found >>>
sv: &gt;&gt;&gt; cdll.kernel32[1] <_FuncPtr object at 0x...> &gt;&gt;&gt; cdll.kernel32[0] Återkoppling (senaste anropet senast): Fil "<stdin>", rad 1, i <module> Fil "ctypes.py", rad 310, i __getitem__ func = _StdcallFuncPtr(namn, self) AttributeError: funktionen ordinal 0 hittades inte &gt;&gt;&gt

source: Calling functions
pt_pt: Chamar funções
sv: Anropsfunktioner

source: You can call these functions like any other Python callable. This example uses the ``rand()`` function, which takes no arguments and returns a pseudo-random integer::
pt_pt: Pode chamar estas funções como qualquer outro objeto chamável em Python. Este exemplo usa a função ``rand()``, que não recebe argumentos e devolve um inteiro pseudoaleatório:
sv: Du kan anropa dessa funktioner som alla andra Python-anropbara funktioner. I det här exemplet används funktionen ``rand()``, som inte tar några argument och returnerar ett pseudoslumpmässigt heltal::

source: On Windows, you can call the ``GetModuleHandleA()`` function, which returns a win32 module handle (passing ``None`` as single argument to call it with a ``NULL`` pointer)::
pt_pt: No Windows, pode chamar a função ``GetModuleHandleA()``, que devolve um *handle* de módulo win32 (passando ``None`` como argumento único para chamá-la com um ponteiro ``NULL``):
sv: I Windows kan du anropa funktionen ``GetModuleHandleA()``, som returnerar ett win32-modulhandtag (genom att ange ``None`` som enda argument kan du anropa den med en ``NULL``-pekare)::

source: :exc:`ValueError` is raised when you call an ``stdcall`` function with the ``cdecl`` calling convention, or vice versa::
pt_pt: :exc:`ValueError` é gerado quando chama uma função ``stdcall`` com a convenção de chamada ``cdecl``, ou vice-versa:
sv: :exc:`ValueError` uppstår när du anropar en ``stdcall``-funktion med anropskonventionen ``cdecl``, eller vice versa::

source: >>> cdll.kernel32.GetModuleHandleA(None) Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: Procedure probably called with not enough arguments (4 bytes missing) >>> >>> windll.msvcrt.printf(b"spam") Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: Procedure probably called with too many arguments (4 bytes in excess) >>>
sv: &gt;&gt;&gt; cdll.kernel32.HämtaModulHandleA(Ingen) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> ValueError (värdefel): Proceduren anropades troligen med för få argument (4 byte saknas) &gt;&gt;&gt &gt;&gt;&gt; windll.msvcrt.printf(b"spam") Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> ValueError (värdefel): Proceduren anropades förmodligen med för många argument (4 byte i överskott) &gt;&gt;&gt

source: To find out the correct calling convention you have to look into the C header file or the documentation for the function you want to call.
pt_pt: Para descobrir a convenção de chamada correta, tem de consultar o ficheiro de cabeçalho C ou a documentação da função que deseja chamar.
sv: För att ta reda på den korrekta anropskonventionen måste du titta i C-headerfilen eller dokumentationen för den funktion du vill anropa.

source: On Windows, :mod:`ctypes` uses win32 structured exception handling to prevent crashes from general protection faults when functions are called with invalid argument values::
pt_pt: No Windows, :mod:`ctypes` usa o tratamento de exceções estruturado win32 para evitar falhas de proteção geral quando funções são chamadas com valores de argumentos inválidos:
sv: I Windows använder :mod:`ctypes` win32-strukturerad undantagshantering för att förhindra krascher på grund av generella skyddsfel när funktioner anropas med ogiltiga argumentvärden::

source: >>> windll.kernel32.GetModuleHandleA(32) Traceback (most recent call last): File "<stdin>", line 1, in <module> OSError: exception: access violation reading 0x00000020 >>>
sv: &gt;&gt;&gt; windll.kernel32.HämtaModuleHandleA(32) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> OSError: undantag: åtkomstöverträdelse vid läsning av 0x00000020 &gt;&gt;&gt

source: There are, however, enough ways to crash Python with :mod:`ctypes`, so you should be careful anyway. The :mod:`faulthandler` module can be helpful in debugging crashes (e.g. from segmentation faults produced by erroneous C library calls).
pt_pt: No entanto, existem formas suficientes de fazer o Python falhar com :mod:`ctypes`, pelo que deve ter cuidado. O módulo :mod:`faulthandler` pode ser útil na depuração de falhas (por exemplo, de falhas de segmentação produzidas por chamadas erradas a bibliotecas C).
sv: Det finns dock tillräckligt många sätt att krascha Python med :mod:`ctypes`, så du bör vara försiktig ändå. Modulen :mod:`faulthandler` kan vara till hjälp vid felsökning av krascher (t.ex. från segmenteringsfel som orsakas av felaktiga anrop till C-biblioteket).

source: ``None``, integers, bytes objects and (unicode) strings are the only native Python objects that can directly be used as parameters in these function calls. ``None`` is passed as a C ``NULL`` pointer, bytes objects and strings are passed as pointer to the memory block that contains their data (:c:expr:`char *` or :c:expr:`wchar_t *`). Python integers are passed as the platform's default C :c:expr:`int` type, their value is masked to fit into the C type.
pt_pt: ``None``, inteiros, objetos bytes e strings (unicode) são os únicos objetos Python nativos que podem ser usados diretamente como parâmetros nestas chamadas de função. ``None`` é passado como um ponteiro C ``NULL``, objetos bytes e strings são passados como ponteiros para o bloco de memória que contém os seus dados (:c:expr:`char *` ou :c:expr:`wchar_t *`). Inteiros Python são passados como o tipo C :c:expr:`int` predefinido da plataforma, o seu valor é mascarado para caber no tipo C.
sv: ``None``, heltal, bytesobjekt och (unicode) strängar är de enda Python-objekt som direkt kan användas som parametrar i dessa funktionsanrop. ``None`` skickas som en C ``NULL`` pekare, bytesobjekt och strängar skickas som pekare till minnesblocket som innehåller deras data (:c:expr:`char *` eller :c:expr:`wchar_t *`). Python heltal skickas som plattformens standard C :c:expr:`int`-typ, deras värde maskeras för att passa in i C-typen.

source: Before we move on calling functions with other parameter types, we have to learn more about :mod:`ctypes` data types.
pt_pt: Antes de avançarmos para chamar funções com outros tipos de parâmetros, temos de aprender mais sobre os tipos de dados :mod:`ctypes`.
sv: Innan vi går vidare med att anropa funktioner med andra parametertyper måste vi lära oss mer om datatyperna :mod:`ctypes`.

source: Fundamental data types
pt_pt: Tipos de dados fundamentais
sv: Grundläggande datatyper

source: :mod:`ctypes` defines a number of primitive C compatible data types:
pt_pt: :mod:`ctypes` define vários tipos de dados primitivos compatíveis com C:
sv: :mod:`ctypes` definierar ett antal primitiva C-kompatibla datatyper:

source: ctypes type
pt_pt: tipo ctypes
sv: ctypes typ

source: C type
pt_pt: tipo C
sv: C-typ

source: Python type
pt_pt: tipo Python
sv: Python-typ

source: :class:`c_bool`
sv: :klass:`c_bool`

source: :class:`c_char`
sv: :klass:`c_char`

source: 1-character bytes object
pt_pt: objeto bytes de 1 caráter
sv: 1-teckens bytes objekt

source: :class:`c_wchar`
sv: :klass:`c_wchar`

source: :c:type:`wchar_t`
sv: :c:typ:`wchar_t`

source: 1-character string
pt_pt: string de 1 caráter
sv: 1-teckens sträng

source: :class:`c_byte`
sv: :klass:`c_byte`

source: :class:`c_ubyte`
sv: :klass:`c_ubyte`

source: :class:`c_short`
sv: :klass:`c_short`

source: :class:`c_ushort`
sv: :klass:`c_ushort`

source: :class:`c_int`
sv: :klass:`c_int`

source: :class:`c_int8`
sv: :klass:`c_int8`

source: :c:type:`int8_t`
sv: :c:typ:`int8_t`

source: :class:`c_int16`
sv: :klass:`c_int16`

source: :c:type:`int16_t`
sv: :c:typ:`int16_t`

source: :class:`c_int32`
sv: :klass:`c_int32`

source: :c:type:`int32_t`
sv: :c:typ:`int32_t`

source: :class:`c_int64`
sv: :klass:`c_int64`

source: :c:type:`int64_t`
sv: :c:typ:`int64_t`

source: :class:`c_uint`
sv: :klass:`c_uint`

source: :class:`c_uint8`
sv: :klass:`c_uint8`

source: :c:type:`uint8_t`
sv: :c:typ:`uint8_t`

source: :class:`c_uint16`
sv: :klass:`c_uint16`

source: :c:type:`uint16_t`
sv: :c:typ:`uint16_t`

source: :class:`c_uint32`
sv: :klass:`c_uint32`

source: :c:type:`uint32_t`
sv: :c:typ:`uint32_t`

source: :class:`c_uint64`
sv: :klass:`c_uint64`

source: :c:type:`uint64_t`
sv: :c:typ:`uint64_t`

source: :class:`c_long`
sv: :klass:`c_long`

source: :class:`c_ulong`
sv: :klass:`c_ulong`

source: :class:`c_longlong`
sv: :klass:`c_longlong`

source: :c:expr:`__int64` or :c:expr:`long long`
pt_pt: :c:expr:`__int64` ou :c:expr:`long long`
sv: :c:expr:`__int64` eller :c:expr:`long long`

source: :class:`c_ulonglong`
sv: :klass:`c_ulonglong`

source: :c:expr:`unsigned __int64` or :c:expr:`unsigned long long`
pt_pt: :c:expr:`unsigned __int64` ou :c:expr:`unsigned long long`
sv: :c:expr:`unsigned __int64` eller :c:expr:`unsigned long long`

source: :class:`c_size_t`
sv: :klass:`c_size_t`

source: :class:`c_ssize_t`
sv: :klass:`c_ssize_t`

source: :c:type:`ssize_t` or :c:expr:`Py_ssize_t`
pt_pt: :c:type:`ssize_t` ou :c:expr:`Py_ssize_t`
sv: :c:type:`ssize_t` eller :c:expr:`Py_ssize_t`

source: :class:`c_time_t`
sv: :klass:`c_time_t`

source: :c:type:`time_t`
sv: :c:typ:`time_t`

source: :class:`c_float`
sv: :klass:`c_float`

source: :class:`c_double`
sv: :klass:`c_double`

source: :class:`c_longdouble`
sv: :klass:`c_longdouble`

source: :c:expr:`long double`
sv: :c:expr:`lång dubbel`

source: :class:`c_char_p`
sv: :klass:`c_char_p`

source: :c:expr:`char *` (NUL terminated)
pt_pt: :c:expr:`char *` (terminado em NUL)
sv: :c:expr:`char *` (NUL-terminerad)

source: bytes object or ``None``
pt_pt: objeto bytes ou ``None``
sv: bytes objekt eller ``None``

source: :class:`c_wchar_p`
sv: :klass:`c_wchar_p`

source: :c:expr:`wchar_t *` (NUL terminated)
pt_pt: :c:expr:`wchar_t *` (terminado em NUL)
sv: :c:expr:`wchar_t *` (NUL-terminerad)

source: string or ``None``
pt_pt: string ou ``None``
sv: sträng eller ``None``

source: :class:`c_void_p`
sv: :klass:`c_void_p`

source: int or ``None``
pt_pt: int ou ``None``
sv: int eller ``None``

source: The constructor accepts any object with a truth value.
pt_pt: O construtor aceita qualquer objeto com um valor de verdade.
sv: Konstruktören accepterar alla objekt med ett sanningsvärde.
