Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: Instances of this class represent loaded shared libraries, functions in these libraries use the ``stdcall`` calling convention, and are assumed to return :c:expr:`int` by default.
pt_pt: Instâncias desta classe representam bibliotecas partilhadas carregadas. As funções nestas bibliotecas usam a convenção de chamada ``stdcall`` e assumem-se que devolvem :c:expr:`int` por defeito.
sv: Instanser av den här klassen representerar laddade delade bibliotek, funktioner i dessa bibliotek använder anropskonventionen ``stdcall`` och antas returnera :c:expr:`int` som standard.

source: The Python :term:`global interpreter lock` is released before calling any function exported by these libraries, and reacquired afterwards.
pt_pt: A :term:`trava global do intérprete` do Python é libertada antes de chamar qualquer função exportada por estas bibliotecas e readquirida depois.
sv: Python :term:`global interpreter lock` släpps innan anrop av någon funktion som exporteras av dessa bibliotek, och återfås efteråt.

source: Instances of this class behave like :class:`CDLL` instances, except that the Python GIL is *not* released during the function call, and after the function execution the Python error flag is checked. If the error flag is set, a Python exception is raised.
pt_pt: Instâncias desta classe comportam-se como instâncias :class:`CDLL`, exceto que a GIL do Python *não* é libertada durante a chamada da função e, após a execução da função, a flag de erro do Python é verificada. Se a flag de erro estiver definida, é levantada uma exceção Python.
sv: Instanser av denna klass beter sig som :class:`CDLL`-instanser, förutom att Python GIL *inte* släpps under funktionsanropet, och efter att funktionen har exekverats kontrolleras Pythons felflagga. Om fel-flaggan är satt, uppstår ett Python-undantag.

source: Thus, this is only useful to call Python C api functions directly.
pt_pt: Portanto, isto é útil apenas para chamar diretamente funções da API C do Python.
sv: Därför är detta endast användbart för att anropa Python C api-funktioner direkt.

source: All these classes can be instantiated by calling them with at least one argument, the pathname of the shared library. If you have an existing handle to an already loaded shared library, it can be passed as the ``handle`` named parameter, otherwise the underlying platform's :c:func:`!dlopen` or :c:func:`!LoadLibrary` function is used to load the library into the process, and to get a handle to it.
pt_pt: Todas estas classes podem ser instanciadas chamando-as com pelo menos um argumento, o caminho da biblioteca partilhada. Se tiver um identificador existente de uma biblioteca partilhada já carregada, pode ser passado como o parâmetro nomeado ``handle``; caso contrário, a função subjacente da plataforma :c:func:`!dlopen` ou :c:func:`!LoadLibrary` é usada para carregar a biblioteca no processo e obter um identificador para a mesma.
sv: Alla dessa klasser kan instansieras genom att anropa dem med minst ett argument, sökvägen till det delade biblioteket. Om du har ett befintligt handtag till ett redan laddat delat bibliotek kan det skickas som den namngivna parametern ``handle``, annars används den underliggande plattformens funktion :c:func:`!dlopen` eller :c:func:`!LoadLibrary` för att ladda biblioteket i processen och för att få ett handtag till det.

source: The *mode* parameter can be used to specify how the library is loaded. For details, consult the :manpage:`dlopen(3)` manpage. On Windows, *mode* is ignored. On posix systems, RTLD_NOW is always added, and is not configurable.
pt_pt: O parâmetro *mode* pode ser usado para especificar como a biblioteca é carregada. Para mais detalhes, consulte a página de manual :manpage:`dlopen(3)`. No Windows, *mode* é ignorado. Em sistemas POSIX, RTLD_NOW é sempre adicionado e não é configurável.
sv: Parametern *mode* kan användas för att ange hur biblioteket laddas. För mer information, se :manpage:`dlopen(3)` manpage. I Windows ignoreras *mode*. På posix-system läggs RTLD_NOW alltid till och är inte konfigurerbart.

source: The *use_errno* parameter, when set to true, enables a ctypes mechanism that allows accessing the system :data:`errno` error number in a safe way. :mod:`ctypes` maintains a thread-local copy of the system's :data:`errno` variable; if you call foreign functions created with ``use_errno=True`` then the :data:`errno` value before the function call is swapped with the ctypes private copy, the same happens immediately after the function call.
pt_pt: O parâmetro *use_errno*, quando definido como verdadeiro, ativa um mecanismo ctypes que permite aceder ao número de erro do sistema :data:`errno` de forma segura. :mod:`ctypes` mantém uma cópia local por thread da variável :data:`errno` do sistema; se chamar funções externas criadas com ``use_errno=True``, o valor :data:`errno` antes da chamada da função é trocado com a cópia privada do ctypes, o mesmo acontece imediatamente após a chamada da função.
sv: Parametern *use_errno*, när den är satt till true, aktiverar en ctypes-mekanism som gör det möjligt att komma åt systemets :data:`errno`-felnummer på ett säkert sätt. :mod:`ctypes` upprätthåller en trådlokal kopia av systemets :data:`errno`-variabel; om du anropar utländska funktioner som skapats med ``use_errno=True`` byts :data:`errno`-värdet före funktionsanropet ut mot ctypes privata kopia, och samma sak händer omedelbart efter funktionsanropet.

source: The function :func:`ctypes.get_errno` returns the value of the ctypes private copy, and the function :func:`ctypes.set_errno` changes the ctypes private copy to a new value and returns the former value.
pt_pt: A função :func:`ctypes.get_errno` devolve o valor da cópia privada do ctypes, e a função :func:`ctypes.set_errno` altera a cópia privada do ctypes para um novo valor e devolve o valor anterior.
sv: Funktionen :func:`ctypes.get_errno` returnerar värdet på den privata kopian av ctypes, och funktionen :func:`ctypes.set_errno` ändrar den privata kopian av ctypes till ett nytt värde och returnerar det tidigare värdet.

source: The *use_last_error* parameter, when set to true, enables the same mechanism for the Windows error code which is managed by the :func:`GetLastError` and :func:`!SetLastError` Windows API functions; :func:`ctypes.get_last_error` and :func:`ctypes.set_last_error` are used to request and change the ctypes private copy of the windows error code.
pt_pt: O parâmetro *use_last_error*, quando definido como verdadeiro, ativa o mesmo mecanismo para o código de erro do Windows, que é gerido pelas funções da API do Windows :func:`GetLastError` e :func:`!SetLastError`; :func:`ctypes.get_last_error` e :func:`ctypes.set_last_error` são usadas para solicitar e alterar a cópia privada do ctypes do código de erro do Windows.
sv: Parametern *use_last_error*, när den är satt till true, aktiverar samma mekanism för Windows-felkoden som hanteras av Windows API-funktionerna :func:`GetLastError` och :func:`!SetLastError`; :func:`ctypes.get_last_error` och :func:`ctypes.set_last_error` används för att begära och ändra ctypes privata kopia av Windows-felkoden.

source: The *winmode* parameter is used on Windows to specify how the library is loaded (since *mode* is ignored). It takes any value that is valid for the Win32 API ``LoadLibraryEx`` flags parameter. When omitted, the default is to use the flags that result in the most secure DLL load, which avoids issues such as DLL hijacking. Passing the full path to the DLL is the safest way to ensure the correct library and dependencies are loaded.
pt_pt: O parâmetro *winmode* é usado no Windows para especificar como a biblioteca é carregada (uma vez que *mode* é ignorado). Aceita qualquer valor válido para o parâmetro de flags da API Win32 ``LoadLibraryEx``. Quando omitido, o valor predefinido é usar as flags que resultam no carregamento mais seguro da DLL, evitando problemas como o sequestro de DLL. Passar o caminho completo para a DLL é a forma mais segura de garantir que a biblioteca e as dependências corretas são carregadas.
sv: Parametern *winmode* används i Windows för att ange hur biblioteket laddas (eftersom *mode* ignoreras). Den tar alla värden som är giltiga för Win32 API:s flaggparameter ``LoadLibraryEx``. När den utelämnas är standardinställningen att använda de flaggor som ger den säkraste DLL-laddningen, vilket undviker problem som DLL-kapning. Att ange den fullständiga sökvägen till DLL:en är det säkraste sättet att se till att rätt bibliotek och beroenden laddas.

source: Added *winmode* parameter.
pt_pt: Adicionado o parâmetro *winmode*.
sv: Lagt till parametern *winmode*.

source: Flag to use as *mode* parameter. On platforms where this flag is not available, it is defined as the integer zero.
pt_pt: Flag a usar como parâmetro *mode*. Em plataformas onde esta flag não está disponível, é definida como o inteiro zero.
sv: Flagga som ska användas som *mode*-parameter. På plattformar där denna flagga inte är tillgänglig definieras den som heltalet noll.

source: Flag to use as *mode* parameter. On platforms where this is not available, it is the same as *RTLD_GLOBAL*.
pt_pt: Flag a usar como parâmetro *mode*. Em plataformas onde esta não está disponível, é o mesmo que *RTLD_GLOBAL*.
sv: Flagga att använda som *mode*-parameter. På plattformar där detta inte är tillgängligt är det samma sak som *RTLD_GLOBAL*.

source: The default mode which is used to load shared libraries. On OSX 10.3, this is *RTLD_GLOBAL*, otherwise it is the same as *RTLD_LOCAL*.
pt_pt: O modo predefinido usado para carregar bibliotecas partilhadas. No OSX 10.3, este é *RTLD_GLOBAL*, caso contrário é o mesmo que *RTLD_LOCAL*.
sv: Det standardläge som används för att ladda delade bibliotek. I OSX 10.3 är detta *RTLD_GLOBAL*, annars är det samma som *RTLD_LOCAL*.

source: Instances of these classes have no public methods. Functions exported by the shared library can be accessed as attributes or by index. Please note that accessing the function through an attribute caches the result and therefore accessing it repeatedly returns the same object each time. On the other hand, accessing it through an index returns a new object each time::
pt_pt: Instâncias destas classes não têm métodos públicos. As funções exportadas pela biblioteca partilhada podem ser acedidas como atributos ou por índice. Note que aceder à função através de um atributo guarda em cache o resultado e, portanto, aceder repetidamente devolve o mesmo objeto cada vez. Por outro lado, aceder através de um índice devolve um novo objeto cada vez::
sv: Instanser av dessa klasser har inga publika metoder. Funktioner som exporteras av det delade biblioteket kan nås som attribut eller via index. Observera att om du använder funktionen via ett attribut cachas resultatet och därför returneras samma objekt varje gång om du använder den upprepade gånger. Å andra sidan returnerar åtkomst via ett index ett nytt objekt varje gång::

source: >>> from ctypes import CDLL >>> libc = CDLL("libc.so.6") # On Linux >>> libc.time == libc.time True >>> libc['time'] == libc['time'] False
pt_pt: >>> from ctypes import CDLL >>> libc = CDLL("libc.so.6") # No Linux >>> libc.time == libc.time True >>> libc['time'] == libc['time'] False
sv: >>> från ctypes import CDLL >>> libc = CDLL("libc.so.6") # På Linux >>> libc.time == libc.time Sann >>> libc['time'] == libc['time'] False

source: The following public attributes are available, their name starts with an underscore to not clash with exported function names:
pt_pt: Os seguintes atributos públicos estão disponíveis; os seus nomes começam com um sublinhado para não conflituar com os nomes das funções exportadas:
sv: Följande publika attribut finns tillgängliga, deras namn börjar med ett understreck för att inte krocka med exporterade funktionsnamn:

source: The system handle used to access the library.
pt_pt: O identificador do sistema usado para aceder à biblioteca.
sv: Det systemhandtag som används för att komma åt biblioteket.

source: The name of the library passed in the constructor.
pt_pt: O nome da biblioteca passado no construtor.
sv: Namnet på det bibliotek som skickas i konstruktören.

source: Shared libraries can also be loaded by using one of the prefabricated objects, which are instances of the :class:`LibraryLoader` class, either by calling the :meth:`~LibraryLoader.LoadLibrary` method, or by retrieving the library as attribute of the loader instance.
pt_pt: As bibliotecas partilhadas também podem ser carregadas usando um dos objetos pré-fabricados, que são instâncias da classe :class:`LibraryLoader`, chamando o método :meth:`~LibraryLoader.LoadLibrary` ou recuperando a biblioteca como atributo da instância do carregador.
sv: Delade bibliotek kan också laddas med hjälp av ett av de prefabricerade objekten, som är instanser av klassen :class:`LibraryLoader`, antingen genom att anropa metoden :meth:`~LibraryLoader.LoadLibrary` eller genom att hämta biblioteket som attribut för laddningsinstansen.

source: Class which loads shared libraries. *dlltype* should be one of the :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL`, or :class:`OleDLL` types.
pt_pt: Classe que carrega bibliotecas partilhadas. *dlltype* deve ser um dos tipos :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL` ou :class:`OleDLL`.
sv: Klass som laddar delade bibliotek. *dlltype* bör vara en av typerna :class:`CDLL`, :class:`PyDLL`, :class:`WinDLL` eller :class:`OleDLL`.

source: :meth:`!__getattr__` has special behavior: It allows loading a shared library by accessing it as attribute of a library loader instance. The result is cached, so repeated attribute accesses return the same library each time.
pt_pt: :meth:`!__getattr__` tem um comportamento especial: permite carregar uma biblioteca partilhada acedendo-a como atributo de uma instância de carregador de biblioteca. O resultado é guardado em cache, pelo que acessos repetidos ao atributo devolvem a mesma biblioteca cada vez.
sv: :meth:`!__getattr__` har ett speciellt beteende: Det gör det möjligt att ladda ett delat bibliotek genom att komma åt det som attribut för en biblioteksladdningsinstans. Resultatet cachas, så upprepade attributåtkomster returnerar samma bibliotek varje gång.

source: Load a shared library into the process and return it. This method always returns a new instance of the library.
pt_pt: Carrega uma biblioteca partilhada no processo e devolve-a. Este método devolve sempre uma nova instância da biblioteca.
sv: Ladda in ett delat bibliotek i processen och returnera det. Denna metod returnerar alltid en ny instans av biblioteket.

source: These prefabricated library loaders are available:
pt_pt: Os seguintes carregadores de biblioteca pré-fabricados estão disponíveis:
sv: Dessa prefabricerade bibliotekslastare finns tillgängliga:

source: Creates :class:`CDLL` instances.
pt_pt: Cria instâncias :class:`CDLL`.
sv: Skapar :class:`CDLL`-instanser.

source: Creates :class:`WinDLL` instances.
pt_pt: Cria instâncias :class:`WinDLL`.
sv: Skapar :class:`WinDLL`-instanser.

source: Creates :class:`OleDLL` instances.
pt_pt: Cria instâncias :class:`OleDLL`.
sv: Skapar :class:`OleDLL`-instanser.

source: Creates :class:`PyDLL` instances.
pt_pt: Cria instâncias :class:`PyDLL`.
sv: Skapar :class:`PyDLL`-instanser.

source: For accessing the C Python api directly, a ready-to-use Python shared library object is available:
pt_pt: Para aceder diretamente à API C do Python, está disponível um objeto de biblioteca partilhada Python pronto a usar:
sv: För direkt åtkomst till C Python Api finns ett färdigt Python shared library-objekt tillgängligt:

source: An instance of :class:`PyDLL` that exposes Python C API functions as attributes. Note that all these functions are assumed to return C :c:expr:`int`, which is of course not always the truth, so you have to assign the correct :attr:`!restype` attribute to use these functions.
pt_pt: Uma instância de :class:`PyDLL` que expõe funções da API C do Python como atributos. Note que todas estas funções assumem que devolvem C :c:expr:`int`, o que nem sempre é verdade, pelo que tem de atribuir o atributo :attr:`!restype` correto para usar estas funções.
sv: En instans av :class:`PyDLL` som exponerar Python C API-funktioner som attribut. Observera att alla dessa funktioner antas returnera C :c:expr:`int`, vilket naturligtvis inte alltid är sant, så du måste tilldela rätt :attr:`!restype`-attribut för att använda dessa funktioner.

source: Loading a library through any of these objects raises an :ref:`auditing event <auditing>` ``ctypes.dlopen`` with string argument ``name``, the name used to load the library.
pt_pt: Carregar uma biblioteca através de qualquer um destes objetos levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.dlopen`` com o argumento string ``name``, o nome usado para carregar a biblioteca.
sv: Att ladda ett bibliotek via något av dessa objekt ger upphov till en :ref:`auditing event <auditing>` ``ctypes.dlopen`` med strängargumentet ``name``, namnet som används för att ladda biblioteket.

source: Accessing a function on a loaded library raises an auditing event ``ctypes.dlsym`` with arguments ``library`` (the library object) and ``name`` (the symbol's name as a string or integer).
pt_pt: Aceder a uma função numa biblioteca carregada levanta um evento de auditoria ``ctypes.dlsym`` com os argumentos ``library`` (o objeto biblioteca) e ``name`` (o nome do símbolo como string ou inteiro).
sv: Åtkomst till en funktion i ett laddat bibliotek ger upphov till en granskningshändelse ``ctypes.dlsym`` med argumenten ``library`` (biblioteksobjektet) och ``name`` (symbolens namn som en sträng eller ett heltal).

source: In cases when only the library handle is available rather than the object, accessing a function raises an auditing event ``ctypes.dlsym/handle`` with arguments ``handle`` (the raw library handle) and ``name``.
pt_pt: Nos casos em que apenas o identificador da biblioteca está disponível em vez do objeto, aceder a uma função levanta um evento de auditoria ``ctypes.dlsym/handle`` com os argumentos ``handle`` (o identificador bruto da biblioteca) e ``name``.
sv: I de fall då endast bibliotekshandtaget är tillgängligt i stället för objektet, ger åtkomst till en funktion upphov till en granskningshändelse ``ctypes.dlsym/handle`` med argumenten ``handle`` (det råa bibliotekshandtaget) och ``name``.

source: Foreign functions
pt_pt: Funções externas
sv: Utländska funktioner

source: As explained in the previous section, foreign functions can be accessed as attributes of loaded shared libraries. The function objects created in this way by default accept any number of arguments, accept any ctypes data instances as arguments, and return the default result type specified by the library loader.
pt_pt: Como explicado na secção anterior, funções externas podem ser acedidas como atributos de bibliotecas partilhadas carregadas. Os objetos de função criados desta forma aceitam, por defeito, qualquer número de argumentos, aceitam quaisquer instâncias de dados ctypes como argumentos e devolvem o tipo de resultado predefinido especificado pelo carregador da biblioteca.
sv: Som förklarades i föregående avsnitt kan utländska funktioner nås som attribut till inlästa delade bibliotek. De funktionsobjekt som skapas på detta sätt accepterar som standard valfritt antal argument, accepterar valfria ctypes-datainstanser som argument och returnerar den standardresultattyp som anges av biblioteksladdaren.

source: They are instances of a private local class :class:`!_FuncPtr` (not exposed in :mod:`!ctypes`) which inherits from the private :class:`_CFuncPtr` class:
pt_pt: São instâncias de uma classe local privada :class:`!_FuncPtr` (não exposta em :mod:`!ctypes`) que herda da classe privada :class:`_CFuncPtr`:
sv: De är instanser av en privat lokal klass :class:`!_FuncPtr` (inte exponerad i :mod:`!ctypes`) som ärver från den privata klassen :class:`_CFuncPtr`:

source: >>> import ctypes >>> lib = ctypes.CDLL(None) >>> issubclass(lib._FuncPtr, ctypes._CFuncPtr) True >>> lib._FuncPtr is ctypes._CFuncPtr False
sv: >>> import ctypes >>> lib = ctypes.CDLL(None) >>> issubclass(lib._FuncPtr, ctypes._CFuncPtr) Sant >>> lib._FuncPtr är ctypes._CFuncPtr Falsk

source: Base class for C callable foreign functions.
pt_pt: Classe base para funções externas chamáveis em C.
sv: Basklass för C-anropsbara utländska funktioner.

source: Instances of foreign functions are also C compatible data types; they represent C function pointers.
pt_pt: Instâncias de funções externas também são tipos de dados compatíveis com C; representam ponteiros de função C.
sv: Instanser av utländska funktioner är också C-kompatibla datatyper; de representerar C-funktionspoängare.

source: This behavior can be customized by assigning to special attributes of the foreign function object.
pt_pt: Este comportamento pode ser personalizado atribuindo atributos especiais ao objeto da função externa.
sv: Detta beteende kan anpassas genom att tilldela speciella attribut till det utländska funktionsobjektet.

source: Assign a ctypes type to specify the result type of the foreign function. Use ``None`` for :c:expr:`void`, a function not returning anything.
pt_pt: Atribua um tipo ctypes para especificar o tipo de resultado da função externa. Use ``None`` para :c:expr:`void`, uma função que não devolve nada.
sv: Tilldela en ctypes-typ för att ange resultattypen för den främmande funktionen. Använd ``None`` för :c:expr:`void`, en funktion som inte returnerar någonting.

source: It is possible to assign a callable Python object that is not a ctypes type, in this case the function is assumed to return a C :c:expr:`int`, and the callable will be called with this integer, allowing further processing or error checking. Using this is deprecated, for more flexible post processing or error checking use a ctypes data type as :attr:`!restype` and assign a callable to the :attr:`errcheck` attribute.
pt_pt: É possível atribuir um objeto Python chamável que não seja um tipo ctypes; neste caso, assume-se que a função devolve um C :c:expr:`int`, e o objeto chamável será chamado com este inteiro, permitindo processamento adicional ou verificação de erros. O uso desta abordagem está obsoleto; para um pós-processamento ou verificação de erros mais flexível, use um tipo de dados ctypes como :attr:`!restype` e atribua um objeto chamável ao atributo :attr:`errcheck`.
sv: Det är möjligt att tilldela ett anropbart Python-objekt som inte är en ctypes-typ, i det här fallet antas funktionen returnera en C :c:expr:`int`, och den anropbara kommer att anropas med detta heltal, vilket möjliggör ytterligare bearbetning eller felkontroll. Att använda detta är föråldrat, för mer flexibel efterbehandling eller felkontroll, använd en ctypes-datatyp som :attr:`!restype` och tilldela en anropbar till attributet :attr:`errcheck`.

source: Assign a tuple of ctypes types to specify the argument types that the function accepts. Functions using the ``stdcall`` calling convention can only be called with the same number of arguments as the length of this tuple; functions using the C calling convention accept additional, unspecified arguments as well.
pt_pt: Atribua um tuplo de tipos ctypes para especificar os tipos de argumentos que a função aceita. Funções que usam a convenção de chamada ``stdcall`` só podem ser chamadas com o mesmo número de argumentos que o comprimento deste tuplo; funções que usam a convenção de chamada C também aceitam argumentos adicionais não especificados.
sv: Tilldela en tupel av ctypes-typer för att ange de argumenttyper som funktionen accepterar. Funktioner som använder anropskonventionen ``stdcall`` kan bara anropas med samma antal argument som längden på denna tupel; funktioner som använder anropskonventionen C accepterar även ytterligare, ospecificerade argument.
