Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: When a foreign function is called, each actual argument is passed to the :meth:`~_CData.from_param` class method of the items in the :attr:`argtypes` tuple, this method allows adapting the actual argument to an object that the foreign function accepts. For example, a :class:`c_char_p` item in the :attr:`argtypes` tuple will convert a string passed as argument into a bytes object using ctypes conversion rules.
pt_pt: Quando uma função externa é chamada, cada argumento real é passado para o método de classe :meth:`~_CData.from_param` dos itens no tuplo :attr:`argtypes`; este método permite adaptar o argumento real a um objeto que a função externa aceita. Por exemplo, um item :class:`c_char_p` no tuplo :attr:`argtypes` converterá uma string passada como argumento num objeto bytes, usando as regras de conversão do ctypes.
sv: När en utländsk funktion anropas skickas varje faktiskt argument till klassmetoden :meth:`~_CData.from_param` för objekten i tupeln :attr:`argtypes`, denna metod gör det möjligt att anpassa det faktiska argumentet till ett objekt som den utländska funktionen accepterar. Exempelvis kommer ett :class:`c_char_p`-objekt i :attr:`argtypes`-tupeln att konvertera en sträng som skickas som argument till ett bytes-objekt med hjälp av ctypes konverteringsregler.

source: New: It is now possible to put items in argtypes which are not ctypes types, but each item must have a :meth:`~_CData.from_param` method which returns a value usable as argument (integer, string, ctypes instance). This allows defining adapters that can adapt custom objects as function parameters.
pt_pt: Novo: Agora é possível colocar itens em argtypes que não são tipos ctypes, mas cada item deve ter um método :meth:`~_CData.from_param` que devolve um valor utilizável como argumento (inteiro, string, instância ctypes). Isto permite definir adaptadores que podem adaptar objetos personalizados como parâmetros de função.
sv: Nytt: Det är nu möjligt att lägga in objekt i argtypes som inte är ctypes-typer, men varje objekt måste ha en :meth:`~_CData.from_param`-metod som returnerar ett värde som kan användas som argument (heltal, sträng, ctypes-instans). Detta gör det möjligt att definiera adaptrar som kan anpassa anpassade objekt som funktionsparametrar.

source: Assign a Python function or another callable to this attribute. The callable will be called with three or more arguments:
pt_pt: Atribua uma função Python ou outro objeto chamável a este atributo. O objeto chamável será chamado com três ou mais argumentos:
sv: Tilldela en Python-funktion eller en annan anropbar funktion till detta attribut. Den anropsbara funktionen kommer att anropas med tre eller fler argument:

source: *result* is what the foreign function returns, as specified by the :attr:`!restype` attribute.
pt_pt: *result* é o que a função externa devolve, conforme especificado pelo atributo :attr:`!restype`.
sv: *result* är vad den främmande funktionen returnerar, enligt vad som anges av attributet :attr:`!restype`.

source: *func* is the foreign function object itself, this allows reusing the same callable object to check or post process the results of several functions.
pt_pt: *func* é o próprio objeto da função externa; isto permite reutilizar o mesmo objeto chamável para verificar ou pós-processar os resultados de várias funções.
sv: *func* är själva det främmande funktionsobjektet, vilket gör det möjligt att återanvända samma anropsbara objekt för att kontrollera eller efterbehandla resultaten av flera funktioner.

source: *arguments* is a tuple containing the parameters originally passed to the function call, this allows specializing the behavior on the arguments used.
pt_pt: *arguments* é um tuplo que contém os parâmetros originalmente passados para a chamada da função; isto permite especializar o comportamento com base nos argumentos usados.
sv: *arguments* är en tupel som innehåller de parametrar som ursprungligen skickades till funktionsanropet, vilket gör det möjligt att specialisera beteendet på de argument som används.

source: The object that this function returns will be returned from the foreign function call, but it can also check the result value and raise an exception if the foreign function call failed.
pt_pt: O objeto que esta função devolve será devolvido pela chamada da função externa, mas também pode verificar o valor do resultado e levantar uma exceção se a chamada da função externa falhar.
sv: Det objekt som den här funktionen returnerar kommer att returneras från det utländska funktionsanropet, men den kan också kontrollera resultatvärdet och skapa ett undantag om det utländska funktionsanropet misslyckades.

source: This exception is raised when a foreign function call cannot convert one of the passed arguments.
pt_pt: Esta exceção é levantada quando uma chamada de função externa não consegue converter um dos argumentos passados.
sv: Detta undantag uppstår när ett anrop av en utländsk funktion inte kan konvertera ett av de passerade argumenten.

source: On Windows, when a foreign function call raises a system exception (for example, due to an access violation), it will be captured and replaced with a suitable Python exception. Further, an auditing event ``ctypes.set_exception`` with argument ``code`` will be raised, allowing an audit hook to replace the exception with its own.
pt_pt: No Windows, quando uma chamada de função externa levanta uma exceção do sistema (por exemplo, devido a uma violação de acesso), esta será capturada e substituída por uma exceção Python adequada. Além disso, será levantado um evento de auditoria ``ctypes.set_exception`` com o argumento ``code``, permitindo que um gancho de auditoria substitua a exceção pela sua própria.
sv: I Windows, när ett främmande funktionsanrop ger upphov till ett systemundantag (t.ex. på grund av en åtkomstöverträdelse), kommer det att fångas upp och ersättas med ett lämpligt Python-undantag. Dessutom kommer en granskningshändelse ``ctypes.set_exception`` med argumentet ``code`` att uppstå, vilket gör det möjligt för en granskningskrok att ersätta undantaget med sitt eget.

source: Function prototypes
pt_pt: Protótipos de função
sv: Prototyper av funktioner

source: Foreign functions can also be created by instantiating function prototypes. Function prototypes are similar to function prototypes in C; they describe a function (return type, argument types, calling convention) without defining an implementation. The factory functions must be called with the desired result type and the argument types of the function, and can be used as decorator factories, and as such, be applied to functions through the ``@wrapper`` syntax. See :ref:`ctypes-callback-functions` for examples.
pt_pt: Funções externas também podem ser criadas instanciando protótipos de função. Os protótipos de função são semelhantes aos protótipos de função em C; descrevem uma função (tipo de retorno, tipos de argumentos, convenção de chamada) sem definir uma implementação. As funções de fábrica devem ser chamadas com o tipo de resultado desejado e os tipos de argumentos da função, e podem ser usadas como fábricas de decoradores, sendo aplicadas a funções através da sintaxe ``@wrapper``. Veja :ref:`ctypes-callback-functions` para exemplos.
sv: Utländska funktioner kan också skapas genom instansiering av funktionsprototyper. Funktionsprototyper liknar funktionsprototyper i C; de beskriver en funktion (returtyp, argumenttyper, anropskonvention) utan att definiera en implementation. Fabriksfunktionerna måste anropas med önskad resultattyp och funktionens argumenttyper och kan användas som dekoratorfabriker och som sådana tillämpas på funktioner genom syntaxen ``@wrapper``. Se :ref:`ctypes-callback-functions` för exempel.

source: The returned function prototype creates functions that use the standard C calling convention. The function will release the GIL during the call. If *use_errno* is set to true, the ctypes private copy of the system :data:`errno` variable is exchanged with the real :data:`errno` value before and after the call; *use_last_error* does the same for the Windows error code.
pt_pt: O protótipo de função devolvido cria funções que usam a convenção de chamada C padrão. A função libertará a GIL durante a chamada. Se *use_errno* estiver definido como verdadeiro, a cópia privada do ctypes da variável do sistema :data:`errno` é trocada com o valor real de :data:`errno` antes e depois da chamada; *use_last_error* faz o mesmo para o código de erro do Windows.
sv: Den returnerade funktionsprototypen skapar funktioner som använder C:s standardkonvention för anrop. Funktionen kommer att frigöra GIL under anropet. Om *use_errno* är satt till true, kommer ctypes privata kopia av systemvariabeln :data:`errno` att bytas ut mot det verkliga värdet för :data:`errno` före och efter anropet; *use_last_error* gör samma sak för Windows felkod.

source: The returned function prototype creates functions that use the ``stdcall`` calling convention. The function will release the GIL during the call. *use_errno* and *use_last_error* have the same meaning as above.
pt_pt: O protótipo de função devolvido cria funções que usam a convenção de chamada ``stdcall``. A função libertará a GIL durante a chamada. *use_errno* e *use_last_error* têm o mesmo significado que acima.
sv: Den returnerade funktionsprototypen skapar funktioner som använder anropskonventionen ``stdcall``. Funktionen kommer att frigöra GIL under anropet. *use_errno* och *use_last_error* har samma betydelse som ovan.

source: The returned function prototype creates functions that use the Python calling convention. The function will *not* release the GIL during the call.
pt_pt: O protótipo de função devolvido cria funções que usam a convenção de chamada Python. A função *não* libertará a GIL durante a chamada.
sv: Den returnerade funktionsprototypen skapar funktioner som använder Pythons anropskonvention. Funktionen kommer *inte* att frigöra GIL under anropet.

source: Function prototypes created by these factory functions can be instantiated in different ways, depending on the type and number of the parameters in the call:
pt_pt: Os protótipos de função criados por estas funções de fábrica podem ser instanciados de diferentes formas, dependendo do tipo e número de parâmetros na chamada:
sv: Funktionsprototyper som skapas av dessa fabriksfunktioner kan instansieras på olika sätt, beroende på typen och antalet parametrar i anropet:

source: Returns a foreign function at the specified address which must be an integer.
pt_pt: Devolve uma função externa no endereço especificado, que deve ser um inteiro.
sv: Returnerar en utländsk funktion på den angivna adressen som måste vara ett heltal.

source: Create a C callable function (a callback function) from a Python *callable*.
pt_pt: Cria uma função chamável em C (uma função de retorno) a partir de um objeto *callable* Python.
sv: Skapa en anropsbar C-funktion (en callback-funktion) från en Python *callable*.

source: Returns a foreign function exported by a shared library. *func_spec* must be a 2-tuple ``(name_or_ordinal, library)``. The first item is the name of the exported function as string, or the ordinal of the exported function as small integer. The second item is the shared library instance.
pt_pt: Devolve uma função externa exportada por uma biblioteca partilhada. *func_spec* deve ser um tuplo de 2 elementos ``(name_or_ordinal, library)``. O primeiro item é o nome da função exportada como string, ou o ordinal da função exportada como inteiro pequeno. O segundo item é a instância da biblioteca partilhada.
sv: Returnerar en utländsk funktion som exporteras av ett delat bibliotek. *func_spec* måste vara en 2-tupel ``(name_or_ordinal, library)``. Det första elementet är namnet på den exporterade funktionen som en sträng, eller den exporterade funktionens ordinal som ett litet heltal. Det andra elementet är den delade biblioteksinstansen.

source: Returns a foreign function that will call a COM method. *vtbl_index* is the index into the virtual function table, a small non-negative integer. *name* is name of the COM method. *iid* is an optional pointer to the interface identifier which is used in extended error reporting.
pt_pt: Devolve uma função externa que chamará um método COM. *vtbl_index* é o índice na tabela de funções virtuais, um inteiro não negativo pequeno. *name* é o nome do método COM. *iid* é um ponteiro opcional para o identificador da interface, que é usado em relatórios de erro estendidos.
sv: Returnerar en utländsk funktion som anropar en COM-metod. *vtbl_index* är index i den virtuella funktionstabellen, ett litet icke-negativt heltal. *name* är namnet på COM-metoden. *iid* är en valfri pekare till gränssnittsidentifieraren som används vid utökad felrapportering.

source: COM methods use a special calling convention: They require a pointer to the COM interface as first argument, in addition to those parameters that are specified in the :attr:`!argtypes` tuple.
pt_pt: Os métodos COM usam uma convenção de chamada especial: exigem um ponteiro para a interface COM como primeiro argumento, além dos parâmetros especificados no tuplo :attr:`!argtypes`.
sv: COM-metoder använder en speciell anropskonvention: De kräver en pekare till COM-gränssnittet som första argument, utöver de parametrar som anges i :attr:`!argtypes`-tupeln.

source: The optional *paramflags* parameter creates foreign function wrappers with much more functionality than the features described above.
pt_pt: O parâmetro opcional *paramflags* cria wrappers de funções externas com muito mais funcionalidade do que as características descritas acima.
sv: Den valfria parametern *paramflags* skapar omslag för utländska funktioner med mycket mer funktionalitet än de funktioner som beskrivs ovan.

source: *paramflags* must be a tuple of the same length as :attr:`~_CFuncPtr.argtypes`.
pt_pt: *paramflags* deve ser um tuplo do mesmo comprimento que :attr:`~_CFuncPtr.argtypes`.
sv: *paramflags* måste vara en tupel av samma längd som :attr:`~_CFuncPtr.argtypes`.

source: Each item in this tuple contains further information about a parameter, it must be a tuple containing one, two, or three items.
pt_pt: Cada item neste tuplo contém mais informações sobre um parâmetro; deve ser um tuplo contendo um, dois ou três itens.
sv: Varje objekt i denna tupel innehåller ytterligare information om en parameter, det måste vara en tupel som innehåller ett, två eller tre objekt.

source: The first item is an integer containing a combination of direction flags for the parameter:
pt_pt: O primeiro item é um inteiro contendo uma combinação de flags de direção para o parâmetro:
sv: Den första posten är ett heltal som innehåller en kombination av riktningsflaggor för parametern:

source: Specifies an input parameter to the function.
pt_pt: Especifica um parâmetro de entrada para a função.
sv: Anger en inparameter till funktionen.

source: Output parameter. The foreign function fills in a value.
pt_pt: Parâmetro de saída. A função externa preenche um valor.
sv: Parameter för utdata. Den utländska funktionen fyller i ett värde.

source: Input parameter which defaults to the integer zero.
pt_pt: Parâmetro de entrada que, por defeito, é o inteiro zero.
sv: Inmatningsparameter som som standard är heltalet noll.

source: The optional second item is the parameter name as string. If this is specified, the foreign function can be called with named parameters.
pt_pt: O segundo item opcional é o nome do parâmetro como string. Se isto for especificado, a função externa pode ser chamada com parâmetros nomeados.
sv: Den andra valfria posten är parameternamnet som en sträng. Om detta anges kan den utländska funktionen anropas med namngivna parametrar.

source: The optional third item is the default value for this parameter.
pt_pt: O terceiro item opcional é o valor predefinido para este parâmetro.
sv: Den valfria tredje posten är standardvärdet för denna parameter.

source: The following example demonstrates how to wrap the Windows ``MessageBoxW`` function so that it supports default parameters and named arguments. The C declaration from the windows header file is this::
pt_pt: O exemplo seguinte demonstra como encapsular a função Windows ``MessageBoxW`` para que suporte parâmetros predefinidos e argumentos nomeados. A declaração C do ficheiro de cabeçalho do Windows é esta::
sv: Följande exempel visar hur man slår in Windows ``MessageBoxW``-funktionen så att den stöder standardparametrar och namngivna argument. C-deklarationen från Windows header-fil är denna::

source: Here is the wrapping with :mod:`ctypes`::
pt_pt: Aqui está o encapsulamento com :mod:`ctypes`::
sv: Här är förpackningen med :mod:`ctypes`::

source: >>> from ctypes import c_int, WINFUNCTYPE, windll >>> from ctypes.wintypes import HWND, LPCWSTR, UINT >>> prototype = WINFUNCTYPE(c_int, HWND, LPCWSTR, LPCWSTR, UINT) >>> paramflags = (1, "hwnd", 0), (1, "text", "Hi"), (1, "caption", "Hello from ctypes"), (1, "flags", 0) >>> MessageBox = prototype(("MessageBoxW", windll.user32), paramflags)
sv: >>> från ctypes importera c_int, WINFUNCTYPE, windll >>> från ctypes.wintypes importera HWND, LPCWSTR, UINT >>> prototype = WINFUNCTYPE(c_int, HWND, LPCWSTR, LPCWSTR, UINT) >>> paramflags = (1, "hwnd", 0), (1, "text", "Hi"), (1, "caption", "Hello from ctypes"), (1, "flags", 0) >>> MessageBox = prototyp(("MessageBoxW", windll.user32), paramflags)

source: The ``MessageBox`` foreign function can now be called in these ways::
pt_pt: A função externa ``MessageBox`` pode agora ser chamada das seguintes formas::
sv: Den utländska funktionen ``MessageBox`` kan nu anropas på följande sätt::

source: >>> MessageBox() >>> MessageBox(text="Spam, spam, spam") >>> MessageBox(flags=2, text="foo bar")
sv: >>> MessageBox() >>> MessageBox(text="Skräppost, skräppost, skräppost") >>> MessageBox(flaggor=2, text="foo bar")

source: A second example demonstrates output parameters. The win32 ``GetWindowRect`` function retrieves the dimensions of a specified window by copying them into ``RECT`` structure that the caller has to supply. Here is the C declaration::
pt_pt: Um segundo exemplo demonstra parâmetros de saída. A função win32 ``GetWindowRect`` obtém as dimensões de uma janela especificada, copiando-as para uma estrutura ``RECT`` que o chamador tem de fornecer. Aqui está a declaração C::
sv: Ett andra exempel demonstrerar utdataparametrar. Win32-funktionen ``GetWindowRect`` hämtar dimensionerna för ett angivet fönster genom att kopiera dem till ``RECT``-strukturen som anroparen måste tillhandahålla. Här är C-deklarationen::

source: >>> from ctypes import POINTER, WINFUNCTYPE, windll, WinError >>> from ctypes.wintypes import BOOL, HWND, RECT >>> prototype = WINFUNCTYPE(BOOL, HWND, POINTER(RECT)) >>> paramflags = (1, "hwnd"), (2, "lprect") >>> GetWindowRect = prototype(("GetWindowRect", windll.user32), paramflags) >>>
sv: >>> från ctypes importera POINTER, WINFUNCTYPE, windll, WinError >>> från ctypes.wintypes importera BOOL, HWND, RECT >>> prototype = WINFUNCTYPE(BOOL, HWND, POINTER(RECT)) >>> paramflags = (1, "hwnd"), (2, "lprect") >>> GetWindowRect = prototyp(("GetWindowRect", windll.user32), paramflags) >>>

source: Functions with output parameters will automatically return the output parameter value if there is a single one, or a tuple containing the output parameter values when there are more than one, so the GetWindowRect function now returns a RECT instance, when called.
pt_pt: Funções com parâmetros de saída devolverão automaticamente o valor do parâmetro de saída se houver apenas um, ou um tuplo contendo os valores dos parâmetros de saída quando houver mais do que um; assim, a função GetWindowRect agora devolve uma instância RECT quando chamada.
sv: Funktioner med utparametrar returnerar automatiskt utparametervärdet om det finns ett enda, eller en tupel som innehåller utparametervärdena om det finns fler än ett, så funktionen GetWindowRect returnerar nu en RECT-instans när den anropas.

source: Output parameters can be combined with the :attr:`~_CFuncPtr.errcheck` protocol to do further output processing and error checking. The win32 ``GetWindowRect`` api function returns a ``BOOL`` to signal success or failure, so this function could do the error checking, and raises an exception when the api call failed::
pt_pt: Parâmetros de saída podem ser combinados com o protocolo :attr:`~_CFuncPtr.errcheck` para fazer processamento adicional de saída e verificação de erros. A função da API win32 ``GetWindowRect`` devolve um ``BOOL`` para sinalizar sucesso ou falha; assim, esta função pode fazer a verificação de erros e levantar uma exceção quando a chamada da API falhar::
sv: Utdataparametrar kan kombineras med :attr:`~_CFuncPtr.errcheck`-protokollet för att göra ytterligare utdatabehandling och felkontroll. Win32 ``GetWindowRect`` api-funktionen returnerar en ``BOOL`` för att signalera framgång eller misslyckande, så den här funktionen kan göra felkontrollen och ger upphov till ett undantag när api-anropet misslyckades::

source: >>> def errcheck(result, func, args): ... if not result: ... raise WinError() ... return args ... >>> GetWindowRect.errcheck = errcheck >>>
sv: >>> def errcheck(resultat, func, args): ... om inte resultat: ... raise WinError() ... returnerar args ... >>> GetWindowRect.errcheck = errcheck >>>

source: If the :attr:`~_CFuncPtr.errcheck` function returns the argument tuple it receives unchanged, :mod:`ctypes` continues the normal processing it does on the output parameters. If you want to return a tuple of window coordinates instead of a ``RECT`` instance, you can retrieve the fields in the function and return them instead, the normal processing will no longer take place::
pt_pt: Se a função :attr:`~_CFuncPtr.errcheck` devolver o tuplo de argumentos que recebe inalterado, :mod:`ctypes` continua o processamento normal que faz nos parâmetros de saída. Se pretender devolver um tuplo de coordenadas de janela em vez de uma instância ``RECT``, pode recuperar os campos na função e devolvê-los em vez disso; o processamento normal já não terá lugar::
sv: Om funktionen :attr:`~_CFuncPtr.errcheck` returnerar den argumenttupel som den tar emot oförändrad, fortsätter :mod:`ctypes` med den normala bearbetning som den gör på utdataparametrarna. Om du vill returnera en tupel av fönsterkoordinater istället för en ``RECT``-instans, kan du hämta fälten i funktionen och returnera dem istället, den normala bearbetningen kommer inte längre att äga rum::

source: >>> def errcheck(result, func, args): ... if not result: ... raise WinError() ... rc = args[1] ... return rc.left, rc.top, rc.bottom, rc.right ... >>> GetWindowRect.errcheck = errcheck >>>
sv: >>> def errcheck(resultat, func, args): ... om inte resultat: ... raise WinError() ... rc = args[1] ... return rc.vänster, rc.topp, rc.botten, rc.höger ... >>> GetWindowRect.errcheck = errcheck >>>

source: Utility functions
pt_pt: Funções utilitárias
sv: Verktygsfunktioner

source: Returns the address of the memory buffer as integer. *obj* must be an instance of a ctypes type.
pt_pt: Devolve o endereço do buffer de memória como inteiro. *obj* deve ser uma instância de um tipo ctypes.
sv: Returnerar minnesbuffertens adress som heltal. *obj* måste vara en instans av en ctypes-typ.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.addressof`` with argument ``obj``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.addressof`` com o argumento ``obj``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.addressof`` med argumentet ``obj``.
