Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ctypes.po
Languages: pt_pt, sv

source: Returns the alignment requirements of a ctypes type. *obj_or_type* must be a ctypes type or instance.
pt_pt: Devolve os requisitos de alinhamento de um tipo ctypes. *obj_or_type* deve ser um tipo ou instância ctypes.
sv: Returnerar anpassningskraven för en ctypes-typ. *obj_or_type* måste vara en ctypes-typ eller -instans.

source: Returns a light-weight pointer to *obj*, which must be an instance of a ctypes type. *offset* defaults to zero, and must be an integer that will be added to the internal pointer value.
pt_pt: Devolve um ponteiro leve para *obj*, que deve ser uma instância de um tipo ctypes. *offset* é zero por defeito e deve ser um inteiro que será adicionado ao valor interno do ponteiro.
sv: Returnerar en lättviktspekare till *obj*, som måste vara en instans av en ctypes-typ. *offset* är som standard noll och måste vara ett heltal som läggs till det interna pekarvärdet.

source: ``byref(obj, offset)`` corresponds to this C code::
pt_pt: ``byref(obj, offset)`` corresponde ao seguinte código C::
sv: ``byref(obj, offset)`` motsvarar denna C-kod::

source: The returned object can only be used as a foreign function call parameter. It behaves similar to ``pointer(obj)``, but the construction is a lot faster.
pt_pt: O objeto devolvido só pode ser usado como parâmetro de chamada de função externa. Comporta-se de forma semelhante a ``pointer(obj)``, mas a construção é muito mais rápida.
sv: Det returnerade objektet kan endast användas som en parameter i ett främmande funktionsanrop. Det fungerar på samma sätt som ``pointer(obj)``, men konstruktionen är mycket snabbare.

source: This function is similar to the cast operator in C. It returns a new instance of *type* which points to the same memory block as *obj*. *type* must be a pointer type, and *obj* must be an object that can be interpreted as a pointer.
pt_pt: Esta função é semelhante ao operador cast em C. Devolve uma nova instância de *type* que aponta para o mesmo bloco de memória que *obj*. *type* deve ser um tipo de ponteiro e *obj* deve ser um objeto que pode ser interpretado como um ponteiro.
sv: Denna funktion liknar cast-operatorn i C. Den returnerar en ny instans av *type* som pekar på samma minnesblock som *obj*. *typ* måste vara en pekartyp och *obj* måste vara ett objekt som kan tolkas som en pekare.

source: This function creates a mutable character buffer. The returned object is a ctypes array of :class:`c_char`.
pt_pt: Esta função cria um buffer de caracteres mutável. O objeto devolvido é um array ctypes de :class:`c_char`.
sv: Denna funktion skapar en föränderlig teckenbuffert. Det returnerade objektet är en ctypes-array av :class:`c_char`.

source: If *size* is given (and not ``None``), it must be an :class:`int`. It specifies the size of the returned array.
pt_pt: Se *size* for fornecido (e não ``None``), deve ser um :class:`int`. Especifica o tamanho do array devolvido.
sv: Om *size* anges (och inte ``None``) måste det vara en :class:`int`. Den anger storleken på den returnerade arrayen.

source: If the *init* argument is given, it must be :class:`bytes`. It is used to initialize the array items. Bytes not initialized this way are set to zero (NUL).
pt_pt: Se o argumento *init* for fornecido, deve ser :class:`bytes`. É usado para inicializar os itens do array. Bytes não inicializados desta forma são definidos para zero (NUL).
sv: Om *init*-argumentet anges måste det vara :class:`bytes`. Det används för att initialisera arrayobjekten. Bytes som inte initieras på detta sätt sätts till noll (NUL).

source: If *size* is not given (or if it is ``None``), the buffer is made one element larger than *init*, effectively adding a NUL terminator.
pt_pt: Se *size* não for fornecido (ou se for ``None``), o buffer é feito um elemento maior que *init*, adicionando efetivamente um terminador NUL.
sv: Om *size* inte anges (eller om den är ``None``) görs bufferten ett element större än *init*, vilket innebär att en NUL-terminator läggs till.

source: If both arguments are given, *size* must not be less than ``len(init)``.
pt_pt: Se ambos os argumentos forem fornecidos, *size* não deve ser menor que ``len(init)``.
sv: Om båda argumenten anges får *size* inte vara mindre än ``len(init)``.

source: If *size* is equal to ``len(init)``, a NUL terminator is not added. Do not treat such a buffer as a C string.
pt_pt: Se *size* for igual a ``len(init)``, um terminador NUL não é adicionado. Não trate esse buffer como uma string C.
sv: Om *size* är lika med ``len(init)``, läggs ingen NUL-terminator till. Behandla inte en sådan buffert som en C-sträng.

source: For example::
pt_pt: Por exemplo::
sv: Till exempel::

source: >>> bytes(create_string_buffer(2)) b'\x00\x00' >>> bytes(create_string_buffer(b'ab')) b'ab\x00' >>> bytes(create_string_buffer(b'ab', 2)) b'ab' >>> bytes(create_string_buffer(b'ab', 4)) b'ab\x00\x00' >>> bytes(create_string_buffer(b'abcdef', 2)) Traceback (most recent call last): ... ValueError: byte string too long
pt_pt: >>> bytes(create_string_buffer(2)) b'\x00\x00' >>> bytes(create_string_buffer(b'ab')) b'ab\x00' >>> bytes(create_string_buffer(b'ab', 2)) b'ab' >>> bytes(create_string_buffer(b'ab', 4)) b'ab\x00\x00' >>> bytes(create_string_buffer(b'abcdef', 2)) Traceback (most recent call last): ... ValueError: string de bytes demasiado longa
sv: >>> bytes(skapa_sträng_buffer(2)) b'\x00\x00' >>> byte(skapa_sträng_buffer(b'ab')) b'ab\x00' >>> byte(skapa_sträng_buffer(b'ab', 2)) b'ab' >>> byte(skapa_sträng_buffer(b'ab', 4)) b'ab\x00\x00' >>> byte(skapa_sträng_buffert(b'abcdef', 2)) Traceback (senaste anropet senast): ... ValueError: byte-strängen är för lång

source: Raises an :ref:`auditing event <auditing>` ``ctypes.create_string_buffer`` with arguments ``init``, ``size``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.create_string_buffer`` com os argumentos ``init``, ``size``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.create_string_buffer`` med argumenten ``init``, ``size``.

source: This function creates a mutable unicode character buffer. The returned object is a ctypes array of :class:`c_wchar`.
pt_pt: Esta função cria um buffer de caracteres Unicode mutável. O objeto devolvido é um array ctypes de :class:`c_wchar`.
sv: Denna funktion skapar en mutabel unicode-teckenbuffert. Det returnerade objektet är en ctypes-array av :class:`c_wchar`.

source: The function takes the same arguments as :func:`~create_string_buffer` except *init* must be a string and *size* counts :class:`c_wchar`.
pt_pt: A função aceita os mesmos argumentos que :func:`~create_string_buffer`, exceto que *init* deve ser uma string e *size* conta :class:`c_wchar`.
sv: Funktionen tar samma argument som :func:`~create_string_buffer` förutom att *init* måste vara en sträng och *size* räknar :class:`c_wchar`.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.create_unicode_buffer`` with arguments ``init``, ``size``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.create_unicode_buffer`` com os argumentos ``init``, ``size``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.create_unicode_buffer`` med argumenten ``init``, ``size``.

source: This function is a hook which allows implementing in-process COM servers with ctypes. It is called from the DllCanUnloadNow function that the _ctypes extension dll exports.
pt_pt: Esta função é um gancho que permite implementar servidores COM em processo com ctypes. É chamada a partir da função DllCanUnloadNow que a dll de extensão _ctypes exporta.
sv: Denna funktion är en krok som gör det möjligt att implementera COM-servrar i processen med ctypes. Den anropas från funktionen DllCanUnloadNow som exporteras av tilläggsdivisionen _ctypes.

source: This function is a hook which allows implementing in-process COM servers with ctypes. It is called from the DllGetClassObject function that the ``_ctypes`` extension dll exports.
pt_pt: Esta função é um gancho que permite implementar servidores COM em processo com ctypes. É chamada a partir da função DllGetClassObject que a dll de extensão ``_ctypes`` exporta.
sv: Denna funktion är en krok som gör det möjligt att implementera COM-servrar i processen med ctypes. Den anropas från funktionen DllGetClassObject som exporteras av dll-tillägget ``_ctypes``.

source: Try to find a library and return a pathname. *name* is the library name without any prefix like ``lib``, suffix like ``.so``, ``.dylib`` or version number (this is the form used for the posix linker option :option:`!-l`). If no library can be found, returns ``None``.
pt_pt: Tenta encontrar uma biblioteca e devolve um caminho. *name* é o nome da biblioteca sem qualquer prefixo como ``lib``, sufixo como ``.so``, ``.dylib`` ou número de versão (esta é a forma usada para a opção do linker posix :option:`!-l`). Se nenhuma biblioteca for encontrada, devolve ``None``.
sv: Försöker hitta ett bibliotek och returnerar ett sökvägsnamn. *name* är biblioteksnamnet utan något prefix som ``lib``, suffix som ``.so``, ``.dylib`` eller versionsnummer (detta är den form som används för posix-länkaralternativet :option:`!-l`). Om inget bibliotek kan hittas returneras ``None``.

source: Returns the filename of the VC runtime library used by Python, and by the extension modules. If the name of the library cannot be determined, ``None`` is returned.
pt_pt: Devolve o nome do ficheiro da biblioteca de runtime VC usada pelo Python e pelos módulos de extensão. Se o nome da biblioteca não puder ser determinado, é devolvido ``None``.
sv: Returnerar filnamnet på det VC runtime-bibliotek som används av Python och av tilläggsmodulerna. Om namnet på biblioteket inte kan fastställas returneras ``None``.

source: If you need to free memory, for example, allocated by an extension module with a call to the ``free(void *)``, it is important that you use the function in the same library that allocated the memory.
pt_pt: Se precisar de libertar memória, por exemplo, alocada por um módulo de extensão com uma chamada para ``free(void *)``, é importante que utilize a função na mesma biblioteca que alocou a memória.
sv: Om du behöver frigöra minne, t.ex. minne som har allokerats av en tilläggsmodul med ett anrop till funktionen ``free(void *)``, är det viktigt att du använder funktionen i samma bibliotek som allokerade minnet.

source: Returns the last error code set by Windows in the calling thread. This function calls the Windows ``GetLastError()`` function directly, it does not return the ctypes-private copy of the error code.
pt_pt: Devolve o último código de erro definido pelo Windows na thread de chamada. Esta função chama diretamente a função ``GetLastError()`` do Windows, não devolve a cópia privada do código de erro do ctypes.
sv: Returnerar den senaste felkoden som ställts in av Windows i den anropande tråden. Denna funktion anropar Windows-funktionen ``GetLastError()`` direkt, den returnerar inte den ctypes-privata kopian av felkoden.

source: Returns the current value of the ctypes-private copy of the system :data:`errno` variable in the calling thread.
pt_pt: Devolve o valor atual da cópia privada do ctypes da variável do sistema :data:`errno` na thread de chamada.
sv: Returnerar det aktuella värdet av den ctypes-privata kopian av systemvariabeln :data:`errno` i den anropande tråden.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.get_errno`` with no arguments.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.get_errno`` sem argumentos.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.get_errno`` utan argument.

source: Returns the current value of the ctypes-private copy of the system :data:`!LastError` variable in the calling thread.
pt_pt: Devolve o valor atual da cópia privada do ctypes da variável do sistema :data:`!LastError` na thread de chamada.
sv: Returnerar det aktuella värdet av den ctypes-privata kopian av systemvariabeln :data:`!LastError` i den anropande tråden.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.get_last_error`` with no arguments.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.get_last_error`` sem argumentos.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.get_last_error`` utan argument.

source: Same as the standard C memmove library function: copies *count* bytes from *src* to *dst*. *dst* and *src* must be integers or ctypes instances that can be converted to pointers.
pt_pt: Igual à função de biblioteca C padrão memmove: copia *count* bytes de *src* para *dst*. *dst* e *src* devem ser inteiros ou instâncias ctypes que possam ser convertidos em ponteiros.
sv: Samma som standard C memmove biblioteksfunktionen: kopierar *count* bytes från *src* till *dst*. *dst* och *src* måste vara heltal eller ctypes-instanser som kan konverteras till pekare.

source: Same as the standard C memset library function: fills the memory block at address *dst* with *count* bytes of value *c*. *dst* must be an integer specifying an address, or a ctypes instance.
pt_pt: Igual à função de biblioteca C padrão memset: preenche o bloco de memória no endereço *dst* com *count* bytes do valor *c*. *dst* deve ser um inteiro que especifica um endereço ou uma instância ctypes.
sv: Samma som standardfunktionen memset i C-biblioteket: fyller minnesblocket på adress *dst* med *count* byte av värdet *c*. *dst* måste vara ett heltal som anger en adress, eller en ctypes-instans.

source: Create a new pointer instance, pointing to *obj*. The returned object is of the type ``POINTER(type(obj))``.
pt_pt: Cria uma nova instância de ponteiro, apontando para *obj*. O objeto devolvido é do tipo ``POINTER(type(obj))``.
sv: Skapa en ny pekarinstans som pekar på *obj*. Det returnerade objektet är av typen ``POINTER(type(obj))``.

source: Note: If you just want to pass a pointer to an object to a foreign function call, you should use ``byref(obj)`` which is much faster.
pt_pt: Nota: Se apenas pretender passar um ponteiro para um objeto a uma chamada de função externa, deve usar ``byref(obj)``, que é muito mais rápido.
sv: Observera: Om du bara vill skicka en pekare till ett objekt till ett främmande funktionsanrop bör du använda ``byref(obj)`` som är mycket snabbare.

source: This function resizes the internal memory buffer of *obj*, which must be an instance of a ctypes type. It is not possible to make the buffer smaller than the native size of the objects type, as given by ``sizeof(type(obj))``, but it is possible to enlarge the buffer.
pt_pt: Esta função redimensiona o buffer de memória interno de *obj*, que deve ser uma instância de um tipo ctypes. Não é possível tornar o buffer mais pequeno do que o tamanho nativo do tipo do objeto, conforme dado por ``sizeof(type(obj))``, mas é possível aumentar o buffer.
sv: Den här funktionen ändrar storleken på internminnesbufferten för *obj*, som måste vara en instans av en ctypes-typ. Det är inte möjligt att göra bufferten mindre än den ursprungliga storleken för objekttypen, som anges av ``sizeof(type(obj))``, men det är möjligt att förstora bufferten.

source: Set the current value of the ctypes-private copy of the system :data:`errno` variable in the calling thread to *value* and return the previous value.
pt_pt: Define o valor atual da cópia privada do ctypes da variável do sistema :data:`errno` na thread de chamada para *value* e devolve o valor anterior.
sv: Ställ in det aktuella värdet för den ctypes-privata kopian av systemvariabeln :data:`errno` i den anropande tråden till *värde* och returnera det tidigare värdet.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.set_errno`` with argument ``errno``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.set_errno`` com o argumento ``errno``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.set_errno`` med argumentet ``errno``.

source: Sets the current value of the ctypes-private copy of the system :data:`!LastError` variable in the calling thread to *value* and return the previous value.
pt_pt: Define o valor atual da cópia privada do ctypes da variável do sistema :data:`!LastError` na thread de chamada para *value* e devolve o valor anterior.
sv: Ställer in det aktuella värdet för den ctypes-privata kopian av systemvariabeln :data:`!LastError` i den anropande tråden till *värde* och returnerar det tidigare värdet.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.set_last_error`` with argument ``error``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.set_last_error`` com o argumento ``error``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.set_last_error`` med argumentet ``error``.

source: Returns the size in bytes of a ctypes type or instance memory buffer. Does the same as the C ``sizeof`` operator.
pt_pt: Devolve o tamanho em bytes de um tipo ctypes ou buffer de memória de instância. Faz o mesmo que o operador C ``sizeof``.
sv: Returnerar storleken i byte på en minnesbuffert för en ctypes-typ eller instans. Gör samma sak som C-operatorn ``sizeof``.

source: Return the byte string at *void \*ptr*. If *size* is specified, it is used as size, otherwise the string is assumed to be zero-terminated.
pt_pt: Devolve a string de bytes em *void \*ptr*. Se *size* for especificado, é usado como tamanho; caso contrário, assume-se que a string é terminada por zero.
sv: Returnerar byte-strängen på *void \*ptr*. Om *size* anges används den som storlek, annars antas strängen vara nollavslutad.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.string_at`` with arguments ``ptr``, ``size``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.string_at`` com os argumentos ``ptr``, ``size``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.string_at`` med argumenten ``ptr``, ``size``.

source: An instance of :exc:`WindowsError` used to be created, which is now an alias of :exc:`OSError`.
pt_pt: Uma instância de :exc:`WindowsError` costumava ser criada, que agora é um alias de :exc:`OSError`.
sv: Tidigare skapades en instans av :exc:`WindowsError`, som nu är ett alias av :exc:`OSError`.

source: Return the wide-character string at *void \*ptr*. If *size* is specified, it is used as the number of characters of the string, otherwise the string is assumed to be zero-terminated.
pt_pt: Devolve a string de caracteres largos em *void \*ptr*. Se *size* for especificado, é usado como o número de caracteres da string; caso contrário, assume-se que a string é terminada por zero.
sv: Returnerar den breda teckensträngen på *void \*ptr*. Om *size* anges används det som antal tecken i strängen, annars antas strängen vara nollavslutad.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.wstring_at`` with arguments ``ptr``, ``size``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.wstring_at`` com os argumentos ``ptr``, ``size``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.wstring_at`` med argumenten ``ptr``, ``size``.

source: Data types
pt_pt: Tipos de dados
sv: Datatyper

source: This non-public class is the common base class of all ctypes data types. Among other things, all ctypes type instances contain a memory block that hold C compatible data; the address of the memory block is returned by the :func:`addressof` helper function. Another instance variable is exposed as :attr:`_objects`; this contains other Python objects that need to be kept alive in case the memory block contains pointers.
pt_pt: Esta classe não pública é a classe base comum de todos os tipos de dados ctypes. Entre outras coisas, todas as instâncias de tipos ctypes contêm um bloco de memória que mantém dados compatíveis com C; o endereço do bloco de memória é devolvido pela função auxiliar :func:`addressof`. Outra variável de instância é exposta como :attr:`_objects`; esta contém outros objetos Python que precisam de ser mantidos vivos caso o bloco de memória contenha ponteiros.
sv: Denna icke-offentliga klass är den gemensamma basklassen för alla ctypes-datatyper. Bland annat innehåller alla instanser av ctypes-typen ett minnesblock som innehåller C-kompatibla data; adressen till minnesblocket returneras av hjälpfunktionen :func:`addressof`. En annan instansvariabel exponeras som :attr:`_objects`; denna innehåller andra Python-objekt som måste hållas vid liv ifall minnesblocket innehåller pekare.

source: Common methods of ctypes data types, these are all class methods (to be exact, they are methods of the :term:`metaclass`):
pt_pt: Métodos comuns dos tipos de dados ctypes, estes são todos métodos de classe (para ser exato, são métodos da :term:`metaclasse`):
sv: Vanliga metoder för ctypes-datatyper, dessa är alla klassmetoder (för att vara exakt är de metoder för :term:`metaclass`):

source: This method returns a ctypes instance that shares the buffer of the *source* object. The *source* object must support the writeable buffer interface. The optional *offset* parameter specifies an offset into the source buffer in bytes; the default is zero. If the source buffer is not large enough a :exc:`ValueError` is raised.
pt_pt: Este método devolve uma instância ctypes que partilha o buffer do objeto *source*. O objeto *source* deve suportar a interface de buffer gravável. O parâmetro opcional *offset* especifica um deslocamento no buffer de origem em bytes; o valor predefinido é zero. Se o buffer de origem não for grande o suficiente, é levantado um :exc:`ValueError`.
sv: Denna metod returnerar en ctypes-instans som delar buffert med *käll*-objektet. Objektet *källa* måste stödja gränssnittet för skrivbar buffert. Den valfria parametern *offset* anger en förskjutning i källbufferten i byte; standardvärdet är noll. Om källbufferten inte är tillräckligt stor uppstår ett :exc:`ValueError`.

source: Raises an :ref:`auditing event <auditing>` ``ctypes.cdata/buffer`` with arguments ``pointer``, ``size``, ``offset``.
pt_pt: Levanta um evento de auditoria :ref:`auditing <auditing>` ``ctypes.cdata/buffer`` com os argumentos ``pointer``, ``size``, ``offset``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ctypes.cdata/buffer`` med argumenten ``pointer``, ``size``, ``offset``.

source: This method creates a ctypes instance, copying the buffer from the *source* object buffer which must be readable. The optional *offset* parameter specifies an offset into the source buffer in bytes; the default is zero. If the source buffer is not large enough a :exc:`ValueError` is raised.
pt_pt: Este método cria uma instância ctypes, copiando o buffer do buffer do objeto *source*, que deve ser legível. O parâmetro opcional *offset* especifica um deslocamento no buffer de origem em bytes; o valor predefinido é zero. Se o buffer de origem não for grande o suficiente, é levantado um :exc:`ValueError`.
sv: Denna metod skapar en ctypes-instans genom att kopiera bufferten från *källans* objektbuffert som måste vara läsbar. Den valfria parametern *offset* anger en förskjutning i källbufferten i byte; standardvärdet är noll. Om källbufferten inte är tillräckligt stor uppstår ett :exc:`ValueError`.

source: This method returns a ctypes type instance using the memory specified by *address* which must be an integer.
pt_pt: Este método devolve uma instância de tipo ctypes usando a memória especificada por *address*, que deve ser um inteiro.
sv: Den här metoden returnerar en ctypes-typinstans som använder det minne som anges av *address*, som måste vara ett heltal.
