Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/curses.po
Languages: es_es, pt_pt

source: Return ``True`` if the specified line was modified since the last call to :meth:`refresh`; otherwise return ``False``. Raise a :exc:`curses.error` exception if *line* is not valid for the given window.
es_es: Devuelve ``True`` si la línea especificada fue modificada desde la última llamada a :meth:`refresh`; en caso contrario devuelve ``False``. Lanza una excepción :exc:`curses.error` si *línea* no es válida para la ventana dada.
pt_pt: Devolve ``True`` se a linha especificada foi modificada desde a última chamada a :meth:`refresh`; caso contrário, devolve ``False``. Lança uma exceção :exc:`curses.error` se *line* não for válida para a janela dada.

source: Return ``True`` if the specified window was modified since the last call to :meth:`refresh`; otherwise return ``False``.
es_es: Devuelve ``True`` si la ventana especificada fue modificada desde la última llamada a :meth:`refresh`; en caso contrario devuelve ``False``.
pt_pt: Devolve ``True`` se a janela especificada foi modificada desde a última chamada a :meth:`refresh`; caso contrário, devolve ``False``.

source: If *flag* is ``True``, escape sequences generated by some keys (keypad, function keys) will be interpreted by :mod:`curses`. If *flag* is ``False``, escape sequences will be left as is in the input stream.
es_es: Si *flag* es ``True``, las secuencias de escape generadas por algunas teclas (teclado, teclas de función) serán interpretadas por :mod:`curses`. Si *flag* es ``False``, las secuencias de escape se dejarán tal cual en el flujo de entrada.
pt_pt: Se *flag* for ``True``, as sequências de escape geradas por algumas teclas (teclado numérico, teclas de função) serão interpretadas por :mod:`curses`. Se *flag* for ``False``, as sequências de escape serão deixadas como estão no fluxo de entrada.

source: If *flag* is ``True``, cursor is left where it is on update, instead of being at "cursor position." This reduces cursor movement where possible. If possible the cursor will be made invisible.
es_es: Si *flag* es ``True``, el cursor se deja donde está en la actualización, en lugar de estar en la "posición del cursor". Esto reduce el movimiento del cursor siempre que sea posible. Si es posible el cursor se hará invisible.
pt_pt: Se *flag* for ``True``, o cursor é deixado onde está na atualização, em vez de estar na "posição do cursor". Isto reduz o movimento do cursor sempre que possível. Se possível, o cursor será tornado invisível.

source: If *flag* is ``False``, cursor will always be at "cursor position" after an update.
es_es: Si *flag* es ``False``, el cursor estará siempre en la "posición del cursor" después de una actualización.
pt_pt: Se *flag* for ``False``, o cursor estará sempre na "posição do cursor" após uma atualização.

source: Move cursor to ``(new_y, new_x)``.
es_es: Mueva el cursor a ``(new_y, new_x)``.
pt_pt: Move o cursor para ``(new_y, new_x)``.

source: Move the window inside its parent window. The screen-relative parameters of the window are not changed. This routine is used to display different parts of the parent window at the same physical position on the screen.
es_es: Mueve la ventana dentro de su ventana padre. Los parámetros relativos a la pantalla de la ventana no se modifican. Esta rutina se utiliza para mostrar diferentes partes de la ventana padre en la misma posición física en la pantalla.
pt_pt: Move a janela dentro da sua janela pai. Os parâmetros relativos ao ecrã da janela não são alterados. Esta rotina é usada para exibir diferentes partes da janela pai na mesma posição física no ecrã.

source: Move the window so its upper-left corner is at ``(new_y, new_x)``.
es_es: Mueva la ventana para que su esquina superior izquierda esté en ``(new_y, new_x)``.
pt_pt: Move a janela de forma que o seu canto superior esquerdo fique em ``(new_y, new_x)``.

source: If *flag* is ``True``, :meth:`getch` will be non-blocking.
es_es: Si *flag* es ``True``, :meth:`getch` será no-bloqueante.
pt_pt: Se *flag* for ``True``, :meth:`getch` será não bloqueante.

source: If *flag* is ``True``, escape sequences will not be timed out.
es_es: Si *flag* es ``True``, las secuencias de escape no serán temporizadas.
pt_pt: Se *flag* for ``True``, as sequências de escape não terão tempo limite.

source: If *flag* is ``False``, after a few milliseconds, an escape sequence will not be interpreted, and will be left in the input stream as is.
es_es: Si *flag* es ``False``, después de unos milisegundos, una secuencia de escape no será interpretada, y se dejará en el flujo de entrada tal cual.
pt_pt: Se *flag* for ``False``, após alguns milissegundos, uma sequência de escape não será interpretada e será deixada no fluxo de entrada como está.

source: Mark for refresh but wait. This function updates the data structure representing the desired state of the window, but does not force an update of the physical screen. To accomplish that, call :func:`doupdate`.
es_es: Marcar para actualizar pero esperar. Esta función actualiza la estructura de datos que representa el estado deseado de la ventana, pero no fuerza una actualización de la pantalla física. Para ello, llame a :func:`doupdate`.
pt_pt: Marca para atualização, mas espera. Esta função atualiza a estrutura de dados que representa o estado desejado da janela, mas não força uma atualização do ecrã físico. Para isso, chame :func:`doupdate`.

source: Overlay the window on top of *destwin*. The windows need not be the same size, only the overlapping region is copied. This copy is non-destructive, which means that the current background character does not overwrite the old contents of *destwin*.
es_es: Superpone la ventana sobre *destwin*. No es necesario que las ventanas tengan el mismo tamaño, sólo se copia la región superpuesta. Esta copia no es destructiva, lo que significa que el carácter de fondo actual no sobrescribe el contenido antiguo de *destwin*.
pt_pt: Sobrepõe a janela sobre *destwin*. As janelas não precisam de ter o mesmo tamanho; apenas a região sobreposta é copiada. Esta cópia é não destrutiva, o que significa que o caractere de fundo atual não sobrescreve o conteúdo antigo de *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overlay` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, and the other variables mark a rectangle in the destination window.
es_es: Para obtener un control más preciso de la región copiada, puede utilizarse la segunda forma de :meth:`overlay`. *sminrow* y *smincol* son las coordenadas superiores izquierdas de la ventana de origen, y las otras variables marcan un rectángulo en la ventana de destino.
pt_pt: Para obter controlo detalhado sobre a região copiada, a segunda forma de :meth:`overlay` pode ser usada. *sminrow* e *smincol* são as coordenadas do canto superior esquerdo da janela de origem, e as outras variáveis marcam um retângulo na janela de destino.

source: Overwrite the window on top of *destwin*. The windows need not be the same size, in which case only the overlapping region is copied. This copy is destructive, which means that the current background character overwrites the old contents of *destwin*.
es_es: Sobrescribe la ventana encima de *destwin*. No es necesario que las ventanas tengan el mismo tamaño, en cuyo caso sólo se copia la región solapada. Esta copia es destructiva, lo que significa que el carácter de fondo actual sobrescribe el contenido antiguo de *destwin*.
pt_pt: Sobrepõe a janela sobre *destwin*. As janelas não precisam de ter o mesmo tamanho; apenas a região sobreposta é copiada. Esta cópia é destrutiva, o que significa que o caractere de fundo atual sobrescreve o conteúdo antigo de *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overwrite` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, the other variables mark a rectangle in the destination window.
es_es: Para obtener un control más preciso de la región copiada, puede utilizarse la segunda forma de :meth:`overwrite`. *sminrow* y *smincol* son las coordenadas superiores izquierdas de la ventana de origen, las otras variables marcan un rectángulo en la ventana de destino.
pt_pt: Para obter controlo detalhado sobre a região copiada, a segunda forma de :meth:`overwrite` pode ser usada. *sminrow* e *smincol* são as coordenadas do canto superior esquerdo da janela de origem; as outras variáveis marcam um retângulo na janela de destino.

source: Write all data associated with the window into the provided file object. This information can be later retrieved using the :func:`getwin` function.
es_es: Escribe todos los datos asociados a la ventana en el objeto de archivo proporcionado. Esta información puede recuperarse posteriormente mediante la función :func:`getwin`.
pt_pt: Escreve todos os dados associados à janela no objeto de ficheiro fornecido. Esta informação pode ser recuperada mais tarde usando a função :func:`getwin`.

source: Indicate that the *num* screen lines, starting at line *beg*, are corrupted and should be completely redrawn on the next :meth:`refresh` call.
es_es: Indica que las *num* líneas de pantalla, comenzando en la línea *beg*, están corruptas y deben ser completamente redibujadas en la próxima llamada a :meth:`refresh`.
pt_pt: Indica que as *num* linhas do ecrã, a começar na linha *beg*, estão corrompidas e devem ser completamente redesenhadas na próxima chamada a :meth:`refresh`.

source: Touch the entire window, causing it to be completely redrawn on the next :meth:`refresh` call.
es_es: Toca toda la ventana, haciendo que se redibuje completamente en la siguiente llamada a :meth:`refresh`.
pt_pt: Marca toda a janela, fazendo com que seja completamente redesenhada na próxima chamada a :meth:`refresh`.

source: Update the display immediately (sync actual screen with previous drawing/deleting methods).
es_es: Actualiza la pantalla inmediatamente (sincroniza la pantalla real con los métodos de dibujo/borrado anteriores).
pt_pt: Atualiza o ecrã imediatamente (sincroniza o ecrã real com os métodos anteriores de desenho/apagar).

source: The 6 optional arguments can only be specified when the window is a pad created with :func:`newpad`. The additional parameters are needed to indicate what part of the pad and screen are involved. *pminrow* and *pmincol* specify the upper left-hand corner of the rectangle to be displayed in the pad. *sminrow*, *smincol*, *smaxrow*, and *smaxcol* specify the edges of the rectangle to be displayed on the screen. The lower right-hand corner of the rectangle to be displayed in the pad is calculated from the screen coordinates, since the rectangles must be the same size. Both rectangles must be entirely contained within their respective structures. Negative values of *pminrow*, *pmincol*, *sminrow*, or *smincol* are treated as if they were zero.
es_es: Los 6 argumentos opcionales sólo pueden especificarse cuando la ventana es un pad creado con :func:`newpad`. Los parámetros adicionales son necesarios para indicar de qué parte del pad y de la pantalla se trata. *pminrow* y *pmincol* especifican la esquina superior izquierda del rectángulo que se mostrará en el pad. *sminrow*, *smincol*, *smaxrow* y *smaxcol* especifican los bordes del rectángulo que se mostrará en la pantalla. La esquina inferior derecha del rectángulo que se mostrará en el pad se calcula a partir de las coordenadas de la pantalla, ya que los rectángulos deben tener el mismo tamaño. Ambos rectángulos deben estar completamente contenidos en sus respectivas estructuras. Los valores negativos de *pminrow*, *pmincol*, *sminrow* o *smincol* se tratan como si fueran cero.
pt_pt: Os 6 argumentos opcionais só podem ser especificados quando a janela é um bloco criado com :func:`newpad`. Os parâmetros adicionais são necessários para indicar que parte do bloco e do ecrã estão envolvidos. *pminrow* e *pmincol* especificam o canto superior esquerdo do retângulo a ser exibido no bloco. *sminrow*, *smincol*, *smaxrow* e *smaxcol* especificam as bordas do retângulo a ser exibido no ecrã. O canto inferior direito do retângulo a ser exibido no bloco é calculado a partir das coordenadas do ecrã, uma vez que os retângulos devem ter o mesmo tamanho. Ambos os retângulos devem estar inteiramente contidos nas suas respetivas estruturas. Valores negativos de *pminrow*, *pmincol*, *sminrow* ou *smincol* são tratados como se fossem zero.

source: Reallocate storage for a curses window to adjust its dimensions to the specified values. If either dimension is larger than the current values, the window's data is filled with blanks that have the current background rendition (as set by :meth:`bkgdset`) merged into them.
es_es: Reasigna el almacenamiento de una ventana curses para ajustar sus dimensiones a los valores especificados. Si cualquiera de las dimensiones es mayor que los valores actuales, los datos de la ventana se rellenan con espacios en blanco que tienen la representación de fondo actual (según lo establecido por :meth:`bkgdset`) fusionada en ellos.
pt_pt: Realoca o armazenamento para uma janela curses para ajustar as suas dimensões aos valores especificados. Se qualquer dimensão for maior do que os valores atuais, os dados da janela são preenchidos com espaços em branco que têm a apresentação de fundo atual (definida por :meth:`bkgdset`) incorporada neles.

source: Scroll the screen or scrolling region upward by *lines* lines.
es_es: Desplaza la pantalla o la región de desplazamiento hacia arriba por *líneas*.
pt_pt: Desloca o ecrã ou a região de deslocamento para cima por *lines* linhas.

source: Control what happens when the cursor of a window is moved off the edge of the window or scrolling region, either as a result of a newline action on the bottom line, or typing the last character of the last line. If *flag* is ``False``, the cursor is left on the bottom line. If *flag* is ``True``, the window is scrolled up one line. Note that in order to get the physical scrolling effect on the terminal, it is also necessary to call :meth:`idlok`.
es_es: Controla lo que ocurre cuando el cursor de una ventana se desplaza fuera del borde de la ventana o de la región de desplazamiento, ya sea como resultado de una acción de nueva línea en la línea inferior, o tecleando el último carácter de la última línea. Si *flag* es ``False``, el cursor se deja en la línea inferior. Si *flag* es ``True``, la ventana se desplaza una línea hacia arriba. Tenga en cuenta que para obtener el efecto de desplazamiento físico en el terminal, también es necesario llamar a :meth:`idlok`.
pt_pt: Controla o que acontece quando o cursor de uma janela é movido para fora da borda da janela ou região de deslocamento, seja como resultado de uma ação de nova linha na linha inferior, ou ao digitar o último caractere da última linha. Se *flag* for ``False``, o cursor é deixado na linha inferior. Se *flag* for ``True``, a janela é deslocada uma linha para cima. Note que, para obter o efeito de deslocamento físico no terminal, também é necessário chamar :meth:`idlok`.

source: Set the scrolling region from line *top* to line *bottom*. All scrolling actions will take place in this region.
es_es: Establece la región de desplazamiento desde la línea *superior* hasta la línea *inferior*. Todas las acciones de desplazamiento tendrán lugar en esta región.
pt_pt: Define a região de deslocamento da linha *top* até à linha *bottom*. Todas as ações de deslocamento ocorrerão nesta região.

source: Turn off the standout attribute. On some terminals this has the side effect of turning off all attributes.
es_es: Desactivar el atributo destacado. En algunos terminales esto tiene el efecto secundario de desactivar todos los atributos.
pt_pt: Desativa o atributo de destaque. Em alguns terminais, isto tem o efeito colateral de desativar todos os atributos.

source: Turn on attribute *A_STANDOUT*.
es_es: Activa el atributo *A_STANDOUT*.
pt_pt: Ativa o atributo *A_STANDOUT*.

source: Return a sub-window, whose upper-left corner is at ``(begin_y, begin_x)``, and whose width/height is *ncols*/*nlines*.
es_es: Devuelve una subventana, cuya esquina superior izquierda está en ``(begin_y, begin_x)``, y cuya anchura/altura es *ncols*/*nlines*.
pt_pt: Devolve uma subjanela, cujo canto superior esquerdo está em ``(begin_y, begin_x)``, e cuja largura/altura é *ncols*/*nlines*.

source: By default, the sub-window will extend from the specified position to the lower right corner of the window.
es_es: Por defecto, la subventana se extenderá desde la posición especificada hasta la esquina inferior derecha de la ventana.
pt_pt: Por predefinição, a subjanela estender-se-á da posição especificada até ao canto inferior direito da janela.

source: Touch each location in the window that has been touched in any of its ancestor windows. This routine is called by :meth:`refresh`, so it should almost never be necessary to call it manually.
es_es: Toca cada lugar de la ventana que haya sido tocado en cualquiera de sus ventanas antecesoras. Esta rutina es llamada por :meth:`refresh`, por lo que casi nunca debería ser necesario llamarla manualmente.
pt_pt: Marca cada localização na janela que foi marcada em qualquer das suas janelas ancestrais. Esta rotina é chamada por :meth:`refresh`, por isso quase nunca deve ser necessário chamá-la manualmente.

source: If *flag* is ``True``, then :meth:`syncup` is called automatically whenever there is a change in the window.
es_es: Si *flag* es ``True``, entonces se llama :meth:`syncup` de forma automática cada vez que hay un cambio en la ventana.
pt_pt: Se *flag* for ``True``, então :meth:`syncup` é chamado automaticamente sempre que houver uma alteração na janela.

source: Touch all locations in ancestors of the window that have been changed in the window.
es_es: Toque todas las ubicaciones en los ancestros de la ventana que se han cambiado en la ventana.
pt_pt: Marca todas as localizações nos ancestrais da janela que foram alteradas na janela.

source: Set blocking or non-blocking read behavior for the window. If *delay* is negative, blocking read is used (which will wait indefinitely for input). If *delay* is zero, then non-blocking read is used, and :meth:`getch` will return ``-1`` if no input is waiting. If *delay* is positive, then :meth:`getch` will block for *delay* milliseconds, and return ``-1`` if there is still no input at the end of that time.
es_es: Establece el comportamiento de lectura bloqueante o no bloqueante para la ventana. Si *delay* es negativo, se utiliza lectura de bloqueo (que esperará indefinidamente la entrada). Si *delay* es cero, entonces se usa lectura no bloqueante, y :meth:`getch` devolverá ``-1`` si no hay entrada esperando. Si *delay* es positivo, entonces :meth:`getch` se bloqueará durante *delay* milisegundos, y devolverá ``-1`` si todavía no hay entrada al final de ese tiempo.
pt_pt: Define o comportamento de leitura bloqueante ou não bloqueante para a janela. Se *delay* for negativo, é usada a leitura bloqueante (que espera indefinidamente por entrada). Se *delay* for zero, é usada a leitura não bloqueante, e :meth:`getch` devolverá ``-1`` se não houver entrada à espera. Se *delay* for positivo, então :meth:`getch` bloqueará durante *delay* milissegundos e devolverá ``-1`` se ainda não houver entrada no final desse tempo.

source: Pretend *count* lines have been changed, starting with line *start*. If *changed* is supplied, it specifies whether the affected lines are marked as having been changed (*changed*\ ``=True``) or unchanged (*changed*\ ``=False``).
es_es: Pretende que se han cambiado *count*, empezando por la línea *start*. Si se proporciona *changed*, se especifica si las líneas afectadas se marcan como cambiadas (*changed*\ ``=True``) o no cambiadas (*changed*\ ``=False``).
pt_pt: Finge que *count* linhas foram alteradas, começando na linha *start*. Se *changed* for fornecido, especifica se as linhas afetadas são marcadas como tendo sido alteradas (*changed*\ ``=True``) ou não alteradas (*changed*\ ``=False``).

source: Pretend the whole window has been changed, for purposes of drawing optimizations.
es_es: Fingir que se ha cambiado toda la ventana, a efectos de optimizaciones de dibujo.
pt_pt: Finge que toda a janela foi alterada, para fins de otimizações de desenho.

source: Mark all lines in the window as unchanged since the last call to :meth:`refresh`.
es_es: Marca todas las líneas de la ventana como no modificadas desde la última llamada a :meth:`refresh`.
pt_pt: Marca todas as linhas na janela como não alteradas desde a última chamada a :meth:`refresh`.

source: Display a vertical line starting at ``(y, x)`` with length *n* consisting of the character *ch* with attributes *attr*.
es_es: Muestra una línea vertical que comienza en ``(y, x)`` con longitud *n* formada por el carácter *ch* con atributos *attr*.
pt_pt: Exibe uma linha vertical a começar em ``(y, x)`` com comprimento *n* composta pelo caractere *ch* com atributos *attr*.

source: Constants
es_es: Constantes
pt_pt: Constantes

source: The :mod:`curses` module defines the following data members:
es_es: El módulo :mod:`curses` define los siguientes miembros de datos:
pt_pt: O módulo :mod:`curses` define os seguintes membros de dados:

source: Some curses routines that return an integer, such as :meth:`~window.getch`, return :const:`ERR` upon failure.
es_es: Algunas rutinas curses que devuelven un entero, como :meth:`~window.getch`, devuelven :const:`ERR` en caso de fallo.
pt_pt: Algumas rotinas curses que devolvem um inteiro, como :meth:`~window.getch`, devolvem :const:`ERR` em caso de falha.

source: Some curses routines that return an integer, such as :func:`napms`, return :const:`OK` upon success.
es_es: Algunas rutinas curses que devuelven un entero, como :func:`napms`, devuelven :const:`OK` en caso de éxito.
pt_pt: Algumas rotinas curses que devolvem um inteiro, como :func:`napms`, devolvem :const:`OK` em caso de sucesso.

source: A bytes object representing the current version of the module.
es_es: Un objeto bytes que representa la versión actual del módulo.
pt_pt: Um objeto de bytes que representa a versão atual do módulo.

source: A named tuple containing the three components of the ncurses library version: *major*, *minor*, and *patch*. All values are integers. The components can also be accessed by name, so ``curses.ncurses_version[0]`` is equivalent to ``curses.ncurses_version.major`` and so on.
es_es: Una tupla con nombre que contiene los tres componentes de la versión de la biblioteca ncurses: *major*, *minor*, y *patch*. Todos los valores son enteros. Los componentes también se pueden acceder por nombre, así que ``curses.ncurses_version[0]`` es equivalente a ``curses.ncurses_version.major`` y así sucesivamente.
pt_pt: Um tuplo nomeado contendo os três componentes da versão da biblioteca ncurses: *major*, *minor* e *patch*. Todos os valores são inteiros. Os componentes também podem ser acedidos pelo nome, por isso ``curses.ncurses_version[0]`` é equivalente a ``curses.ncurses_version.major`` e assim por diante.

source: Availability: if the ncurses library is used.
es_es: Disponibilidad: si se utiliza la biblioteca ncurses.
pt_pt: Disponibilidade: se a biblioteca ncurses for usada.

source: The maximum number of colors the terminal can support. It is defined only after the call to :func:`start_color`.
es_es: El número máximo de colores que puede admitir el terminal. Se define sólo después de la llamada a :func:`start_color`.
pt_pt: O número máximo de cores que o terminal pode suportar. Está definido apenas após a chamada a :func:`start_color`.
