Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/curses.po
Languages: es_es, pt_pt

source: The maximum number of color pairs the terminal can support. It is defined only after the call to :func:`start_color`.
es_es: El número máximo de pares de colores que puede admitir el terminal. Se define sólo después de la llamada a :func:`start_color`.
pt_pt: O número máximo de pares de cores que o terminal pode suportar. Está definido apenas após a chamada a :func:`start_color`.

source: The width of the screen, i.e., the number of columns. It is defined only after the call to :func:`initscr`. Updated by :func:`update_lines_cols`, :func:`resizeterm` and :func:`resize_term`.
es_es: La anchura de la pantalla, es decir, el número de columnas. Se define sólo después de la llamada a :func:`initscr`. Actualizado por :func:`update_lines_cols`, :func:`resizeterm` y :func:`resize_term`.
pt_pt: A largura do ecrã, ou seja, o número de colunas. Está definido apenas após a chamada a :func:`initscr`. Atualizado por :func:`update_lines_cols`, :func:`resizeterm` e :func:`resize_term`.

source: The height of the screen, i.e., the number of lines. It is defined only after the call to :func:`initscr`. Updated by :func:`update_lines_cols`, :func:`resizeterm` and :func:`resize_term`.
es_es: La altura de la pantalla, es decir, el número de líneas. Se define sólo después de la llamada a :func:`initscr`. Actualizado por :func:`update_lines_cols`, :func:`resizeterm` y :func:`resize_term`.
pt_pt: A altura do ecrã, ou seja, o número de linhas. Está definido apenas após a chamada a :func:`initscr`. Atualizado por :func:`update_lines_cols`, :func:`resizeterm` e :func:`resize_term`.

source: Some constants are available to specify character cell attributes. The exact constants available are system dependent.
es_es: Algunas constantes están disponibles para especificar atributos de celdas de caracteres. Las constantes exactas disponibles dependen del sistema.
pt_pt: Algumas constantes estão disponíveis para especificar atributos de células de caracteres. As constantes exatas disponíveis dependem do sistema.

source: Attribute
es_es: Atributo
pt_pt: Atributo

source: Meaning
es_es: Significado
pt_pt: Significado

source: Alternate character set mode
es_es: Modo de juego de caracteres alternativo
pt_pt: Modo de conjunto de caracteres alternativo

source: Blink mode
es_es: Modo parpadeo
pt_pt: Modo de piscar

source: Bold mode
es_es: Modo negrita
pt_pt: Modo negrito

source: Dim mode
es_es: Modo atenuado
pt_pt: Modo escuro

source: Invisible or blank mode
es_es: Modo invisible o en blanco
pt_pt: Modo invisível ou em branco

source: Italic mode
es_es: Modo cursiva
pt_pt: Modo itálico

source: Normal attribute
es_es: Atributo normal
pt_pt: Atributo normal

source: Protected mode
es_es: Modo protegido
pt_pt: Modo protegido

source: Reverse background and foreground colors
es_es: Invertir los colores de fondo y primer plano
pt_pt: Inverte as cores de fundo e primeiro plano

source: Standout mode
es_es: Modo destacado
pt_pt: Modo de destaque

source: Underline mode
es_es: Modo subrayado
pt_pt: Modo sublinhado

source: Horizontal highlight
es_es: Resaltado horizontal
pt_pt: Destaque horizontal

source: Left highlight
es_es: Resaltar a la izquierda
pt_pt: Destaque esquerdo

source: Low highlight
es_es: Bajo relieve
pt_pt: Destaque baixo

source: Right highlight
es_es: Lo más destacado
pt_pt: Destaque direito

source: Top highlight
es_es: Lo más destacado
pt_pt: Destaque superior

source: Vertical highlight
es_es: Resaltado vertical
pt_pt: Destaque vertical

source: ``A_ITALIC`` was added.
es_es: ``A_ITALIC`` se añadió.
pt_pt: ``A_ITALIC`` foi adicionado.

source: Several constants are available to extract corresponding attributes returned by some methods.
es_es: Existen varias constantes para extraer los atributos correspondientes devueltos por algunos métodos.
pt_pt: Várias constantes estão disponíveis para extrair atributos correspondentes devolvidos por alguns métodos.

source: Bit-mask
es_es: Máscara de bits
pt_pt: Máscara de bits

source: Bit-mask to extract attributes
es_es: Máscara de bits para extraer atributos
pt_pt: Máscara de bits para extrair atributos

source: Bit-mask to extract a character
es_es: Máscara de bits para extraer un carácter
pt_pt: Máscara de bits para extrair um caractere

source: Bit-mask to extract color-pair field information
es_es: Máscara de bits para extraer la información de los campos de pares de colores
pt_pt: Máscara de bits para extrair informações do campo de par de cores

source: Keys are referred to by integer constants with names starting with ``KEY_``. The exact keycaps available are system dependent.
es_es: Se hace referencia a las claves mediante constantes enteras cuyos nombres empiezan por ``KEY_``. Las exactas claves disponibles dependen del sistema.
pt_pt: As teclas são referidas por constantes inteiras com nomes que começam com ``KEY_``. As teclas exatas disponíveis dependem do sistema.

source: Key constant
es_es: Constante clave
pt_pt: Constante de tecla

source: Key
es_es: Clave
pt_pt: Tecla

source: Minimum key value
es_es: Valor mínimo de la clave
pt_pt: Valor mínimo da tecla

source: Break key (unreliable)
es_es: Clave de rotura (poco fiable)
pt_pt: Tecla de interrupção (pouco fiável)

source: Down-arrow
es_es: Flecha abajo
pt_pt: Seta para baixo

source: Up-arrow
es_es: Flecha arriba
pt_pt: Seta para cima

source: Left-arrow
es_es: Flecha izquierda
pt_pt: Seta para a esquerda

source: Right-arrow
es_es: Flecha derecha
pt_pt: Seta para a direita

source: Home key (upward+left arrow)
es_es: Tecla Inicio (flecha arriba+izquierda)
pt_pt: Tecla Home (seta para cima + esquerda)

source: Backspace (unreliable)
es_es: Retroceso (poco fiable)
pt_pt: Retrocesso (pouco fiável)

source: Function keys. Up to 64 function keys are supported.
es_es: Teclas de función. Se admiten hasta 64 teclas de función.
pt_pt: Teclas de função. Até 64 teclas de função são suportadas.

source: Value of function key *n*
es_es: Valor de la clave de función *n*
pt_pt: Valor da tecla de função *n*

source: Delete line
es_es: Borrar línea
pt_pt: Apagar linha

source: Insert line
es_es: Insertar línea
pt_pt: Inserir linha

source: Delete character
es_es: Borrar carácter
pt_pt: Apagar caractere

source: Insert char or enter insert mode
es_es: Insertar carácter o entrar en modo inserción
pt_pt: Inserir caractere ou entrar no modo de inserção

source: Exit insert char mode
es_es: Salir del modo insertar caracteres
pt_pt: Sair do modo de inserção de caracteres

source: Clear screen
es_es: Limpiar pantalla
pt_pt: Limpar ecrã

source: Clear to end of screen
es_es: Borrar hasta el final de la pantalla
pt_pt: Limpar até ao final do ecrã

source: Clear to end of line
es_es: Borrar hasta el final de línea
pt_pt: Limpar até ao final da linha

source: Scroll 1 line forward
es_es: Avanzar 1 línea
pt_pt: Deslocar 1 linha para a frente

source: Scroll 1 line backward (reverse)
es_es: Desplazarse 1 línea hacia atrás (retroceso)
pt_pt: Deslocar 1 linha para trás (inverso)

source: Next page
es_es: Página siguiente
pt_pt: Página seguinte

source: Previous page
es_es: Página anterior
pt_pt: Página anterior

source: Set tab
es_es: Ficha Set
pt_pt: Definir tabulação

source: Clear tab
es_es: Limpiar pestaña
pt_pt: Limpar tabulação

source: Clear all tabs
es_es: Borrar todas las pestañas
pt_pt: Limpar todas as tabulações

source: Enter or send (unreliable)
es_es: Introducir o enviar (poco fiable)
pt_pt: Entrar ou enviar (pouco fiável)

source: Soft (partial) reset (unreliable)
es_es: Reinicio suave (parcial) (poco fiable)
pt_pt: Reposição suave (parcial) (pouco fiável)

source: Reset or hard reset (unreliable)
es_es: Reinicio o reinicio duro (poco fiable)
pt_pt: Reposição ou redefinição total (pouco fiável)

source: Print
es_es: Imprimir
pt_pt: Imprimir

source: Home down or bottom (lower left)
es_es: Inicio abajo o inferior (abajo a la izquierda)
pt_pt: Home para baixo ou base (inferior esquerdo)

source: Upper left of keypad
es_es: Parte superior izquierda del teclado
pt_pt: Superior esquerdo do teclado numérico

source: Upper right of keypad
es_es: Parte superior derecha del teclado
pt_pt: Superior direito do teclado numérico

source: Center of keypad
es_es: Centro del teclado
pt_pt: Centro do teclado numérico

source: Lower left of keypad
es_es: Parte inferior izquierda del teclado
pt_pt: Inferior esquerdo do teclado numérico

source: Lower right of keypad
es_es: Parte inferior derecha del teclado
pt_pt: Inferior direito do teclado numérico

source: Back tab
es_es: Ficha posterior
pt_pt: Tabulação para trás

source: Beg (beginning)
es_es: Beg (comienzo)
pt_pt: Início

source: Cancel
es_es: Cancelar
pt_pt: Cancelar

source: Close
es_es: Cerrar
pt_pt: Fechar

source: Cmd (command)
es_es: Cmd (comando)
pt_pt: Comando

source: Copy
es_es: Copia
pt_pt: Copiar

source: Create
es_es: Cree
pt_pt: Criar

source: End
es_es: Fin
pt_pt: Fim

source: Exit
es_es: Salir
pt_pt: Sair

source: Find
es_es: Encontrar
pt_pt: Localizar

source: Help
es_es: Ayuda
pt_pt: Ajuda

source: Mark
es_es: Marca
pt_pt: Marcar

source: Message
es_es: Mensaje
pt_pt: Mensagem

source: Move
es_es: Mover
pt_pt: Mover

source: Next
pt_pt: Próximo

source: Open
pt_pt: Abrir

source: Options
pt_pt: Opções

source: Prev (previous)
pt_pt: Anterior

source: Redo
pt_pt: Refazer

source: Ref (reference)
pt_pt: Referência

source: Refresh
pt_pt: Atualizar

source: Replace
pt_pt: Substituir

source: Restart
pt_pt: Reiniciar

source: Resume
pt_pt: Retomar

source: Save
pt_pt: Guardar

source: Shifted Beg (beginning)
pt_pt: Início com Shift

source: Shifted Cancel
pt_pt: Cancelar com Shift

source: Shifted Command
pt_pt: Comando com Shift

source: Shifted Copy
pt_pt: Copiar com Shift

source: Shifted Create
pt_pt: Criar com Shift

source: Shifted Delete char
pt_pt: Apagar caractere com Shift

source: Shifted Delete line
pt_pt: Apagar linha com Shift

source: Select
pt_pt: Selecionar

source: Shifted End
pt_pt: Fim com Shift

source: Shifted Clear line
pt_pt: Limpar linha com Shift

source: Shifted Exit
pt_pt: Sair com Shift

source: Shifted Find
pt_pt: Localizar com Shift

source: Shifted Help
pt_pt: Ajuda com Shift

source: Shifted Home
pt_pt: Home com Shift

source: Shifted Input
pt_pt: Entrada com Shift

source: Shifted Left arrow
pt_pt: Seta esquerda com Shift

source: Shifted Message
pt_pt: Mensagem com Shift

source: Shifted Move
pt_pt: Mover com Shift

source: Shifted Next
pt_pt: Próximo com Shift

source: Shifted Options
pt_pt: Opções com Shift

source: Shifted Prev
pt_pt: Anterior com Shift

source: Shifted Print
pt_pt: Imprimir com Shift

source: Shifted Redo
pt_pt: Refazer com Shift

source: Shifted Replace
pt_pt: Substituir com Shift

source: Shifted Right arrow
pt_pt: Seta direita com Shift

source: Shifted Resume
pt_pt: Retomar com Shift

source: Shifted Save
pt_pt: Guardar com Shift

source: Shifted Suspend
pt_pt: Suspensão com Shift

source: Shifted Undo
pt_pt: Anular com Shift

source: Suspend
pt_pt: Suspender

source: Undo
pt_pt: Anular

source: Mouse event has occurred
pt_pt: Ocorreu um evento de rato

source: Terminal resize event
pt_pt: Evento de redimensionamento do terminal

source: Maximum key value
pt_pt: Valor máximo da tecla

source: On VT100s and their software emulations, such as X terminal emulators, there are normally at least four function keys (:const:`KEY_F1 <KEY_Fn>`, :const:`KEY_F2 <KEY_Fn>`, :const:`KEY_F3 <KEY_Fn>`, :const:`KEY_F4 <KEY_Fn>`) available, and the arrow keys mapped to :const:`KEY_UP`, :const:`KEY_DOWN`, :const:`KEY_LEFT` and :const:`KEY_RIGHT` in the obvious way. If your machine has a PC keyboard, it is safe to expect arrow keys and twelve function keys (older PC keyboards may have only ten function keys); also, the following keypad mappings are standard:
pt_pt: Nos terminais VT100 e nas suas emulações por software, como os emuladores de terminal X, normalmente existem pelo menos quatro teclas de função (:const:`KEY_F1 <KEY_Fn>`, :const:`KEY_F2 <KEY_Fn>`, :const:`KEY_F3 <KEY_Fn>`, :const:`KEY_F4 <KEY_Fn>`) disponíveis, e as teclas de seta mapeadas para :const:`KEY_UP`, :const:`KEY_DOWN`, :const:`KEY_LEFT` e :const:`KEY_RIGHT` da forma óbvia. Se a sua máquina tiver um teclado de PC, pode contar com as teclas de seta e doze teclas de função (teclados de PC mais antigos podem ter apenas dez teclas de função); além disso, os seguintes mapeamentos do teclado numérico são padrão:

source: Keycap
pt_pt: Tecla

source: Constant
es_es: Constante
pt_pt: Constante

source: :kbd:`Page Up`
pt_pt: :kbd:`Página Acima`

source: :kbd:`Page Down`
pt_pt: :kbd:`Página Abaixo`

source: The following table lists characters from the alternate character set. These are inherited from the VT100 terminal, and will generally be available on software emulations such as X terminals. When there is no graphic available, curses falls back on a crude printable ASCII approximation.
pt_pt: A tabela seguinte lista caracteres do conjunto de caracteres alternativo. Estes são herdados do terminal VT100 e geralmente estarão disponíveis em emulações de software, como terminais X. Quando não houver um gráfico disponível, curses recorre a uma aproximação ASCII imprimível rudimentar.

source: These are available only after :func:`initscr` has been called.
pt_pt: Estes estão disponíveis apenas após a chamada a :func:`initscr`.

source: ACS code
pt_pt: Código ACS

source: alternate name for upper right corner
pt_pt: nome alternativo para canto superior direito

source: solid square block
pt_pt: bloco quadrado sólido

source: board of squares
pt_pt: tabuleiro de quadrados

source: alternate name for horizontal line
pt_pt: nome alternativo para linha horizontal

source: alternate name for upper left corner
pt_pt: nome alternativo para canto superior esquerdo

source: alternate name for top tee
pt_pt: nome alternativo para tee superior

source: bottom tee
pt_pt: tee inferior

source: bullet
pt_pt: ponto

source: checker board (stipple)
pt_pt: tabuleiro de xadrez (pontilhado)

source: arrow pointing down
pt_pt: seta a apontar para baixo

source: degree symbol
pt_pt: símbolo de grau

source: diamond
pt_pt: diamante

source: greater-than-or-equal-to
pt_pt: maior-ou-igual-a

source: horizontal line
pt_pt: linha horizontal

source: lantern symbol
pt_pt: símbolo de lanterna

source: left arrow
pt_pt: seta esquerda

source: less-than-or-equal-to
pt_pt: menor-ou-igual-a

source: lower left-hand corner
pt_pt: canto inferior esquerdo

source: lower right-hand corner
pt_pt: canto inferior direito

source: left tee
pt_pt: tee esquerdo

source: not-equal sign
pt_pt: sinal de diferente

source: letter pi
pt_pt: letra pi

source: plus-or-minus sign
pt_pt: sinal de mais-ou-menos

source: big plus sign
pt_pt: sinal de mais grande

source: right arrow
pt_pt: seta direita

source: right tee
pt_pt: tee direito

source: scan line 1
pt_pt: linha de varrimento 1

source: scan line 3
pt_pt: linha de varrimento 3

source: scan line 7
pt_pt: linha de varrimento 7

source: scan line 9
pt_pt: linha de varrimento 9

source: alternate name for lower right corner
pt_pt: nome alternativo para canto inferior direito

source: alternate name for vertical line
pt_pt: nome alternativo para linha vertical

source: alternate name for right tee
pt_pt: nome alternativo para tee direito

source: alternate name for lower left corner
pt_pt: nome alternativo para canto inferior esquerdo

source: alternate name for bottom tee
pt_pt: nome alternativo para tee inferior

source: alternate name for left tee
pt_pt: nome alternativo para tee esquerdo

source: alternate name for crossover or big plus
pt_pt: nome alternativo para cruzamento ou mais grande

source: pound sterling
pt_pt: libra esterlina

source: top tee
pt_pt: tee superior

source: up arrow
pt_pt: seta para cima

source: upper left corner
pt_pt: canto superior esquerdo

source: upper right corner
pt_pt: canto superior direito

source: vertical line
pt_pt: linha vertical

source: The following table lists mouse button constants used by :meth:`getmouse`:
pt_pt: A tabela seguinte lista as constantes dos botões do rato usadas por :meth:`getmouse`:

source: Mouse button constant
pt_pt: Constante do botão do rato

source: Mouse button *n* pressed
pt_pt: Botão do rato *n* pressionado

source: Mouse button *n* released
pt_pt: Botão do rato *n* libertado

source: Mouse button *n* clicked
pt_pt: Botão do rato *n* clicado

source: Mouse button *n* double clicked
pt_pt: Botão do rato *n* clicado duas vezes

source: Mouse button *n* triple clicked
pt_pt: Botão do rato *n* clicado três vezes

source: Shift was down during button state change
pt_pt: Shift estava pressionado durante a mudança de estado do botão

source: Control was down during button state change
pt_pt: Control estava pressionado durante a mudança de estado do botão

source: The following table lists the predefined colors:
pt_pt: A tabela seguinte lista as cores predefinidas:

source: Color
pt_pt: Cor

source: Black
pt_pt: Preto

source: Blue
pt_pt: Azul

source: Cyan (light greenish blue)
pt_pt: Ciano (azul esverdeado claro)

source: Green
pt_pt: Verde

source: Magenta (purplish red)
pt_pt: Magenta (vermelho arroxeado)

source: Red
pt_pt: Vermelho

source: White
pt_pt: Branco

source: Yellow
pt_pt: Amarelo

source: :mod:`curses.textpad` --- Text input widget for curses programs
pt_pt: :mod:`curses.textpad` --- Widget de entrada de texto para programas curses

source: The :mod:`curses.textpad` module provides a :class:`Textbox` class that handles elementary text editing in a curses window, supporting a set of keybindings resembling those of Emacs (thus, also of Netscape Navigator, BBedit 6.x, FrameMaker, and many other programs). The module also provides a rectangle-drawing function useful for framing text boxes or for other purposes.
pt_pt: O módulo :mod:`curses.textpad` fornece uma classe :class:`Textbox` que trata da edição elementar de texto numa janela curses, suportando um conjunto de ligações de teclas semelhantes às do Emacs (e, portanto, também do Netscape Navigator, BBedit 6.x, FrameMaker e muitos outros programas). O módulo também fornece uma função de desenho de retângulos útil para enquadrar caixas de texto ou para outros fins.

source: The module :mod:`curses.textpad` defines the following function:
pt_pt: O módulo :mod:`curses.textpad` define a seguinte função:

source: Draw a rectangle. The first argument must be a window object; the remaining arguments are coordinates relative to that window. The second and third arguments are the y and x coordinates of the upper left hand corner of the rectangle to be drawn; the fourth and fifth arguments are the y and x coordinates of the lower right hand corner. The rectangle will be drawn using VT100/IBM PC forms characters on terminals that make this possible (including xterm and most other software terminal emulators). Otherwise it will be drawn with ASCII dashes, vertical bars, and plus signs.
pt_pt: Desenha um retângulo. O primeiro argumento deve ser um objeto de janela; os argumentos restantes são coordenadas relativas a essa janela. O segundo e terceiro argumentos são as coordenadas y e x do canto superior esquerdo do retângulo a ser desenhado; o quarto e quinto argumentos são as coordenadas y e x do canto inferior direito. O retângulo será desenhado usando caracteres de formas VT100/IBM PC em terminais que permitam isso (incluindo xterm e a maioria dos outros emuladores de terminal por software). Caso contrário, será desenhado com traços ASCII, barras verticais e sinais de mais.

source: Textbox objects
pt_pt: Objetos Textbox

source: You can instantiate a :class:`Textbox` object as follows:
pt_pt: Pode instanciar um objeto :class:`Textbox` da seguinte forma:

source: Return a textbox widget object. The *win* argument should be a curses :ref:`window <curses-window-objects>` object in which the textbox is to be contained. The edit cursor of the textbox is initially located at the upper left hand corner of the containing window, with coordinates ``(0, 0)``. The instance's :attr:`stripspaces` flag is initially on.
pt_pt: Devolve um objeto widget de caixa de texto. O argumento *win* deve ser um objeto de janela :ref:`window <curses-window-objects>` curses no qual a caixa de texto deve estar contida. O cursor de edição da caixa de texto está inicialmente localizado no canto superior esquerdo da janela contenedora, com coordenadas ``(0, 0)``. A flag :attr:`stripspaces` da instância está inicialmente ativa.

source: :class:`Textbox` objects have the following methods:
pt_pt: Os objetos :class:`Textbox` têm os seguintes métodos:

source: This is the entry point you will normally use. It accepts editing keystrokes until one of the termination keystrokes is entered. If *validator* is supplied, it must be a function. It will be called for each keystroke entered with the keystroke as a parameter; command dispatch is done on the result. This method returns the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` attribute.
pt_pt: Este é o ponto de entrada que normalmente usará. Aceita teclas de edição até que uma das teclas de terminação seja inserida. Se *validator* for fornecido, deve ser uma função. Será chamada para cada tecla pressionada com a tecla como parâmetro; o despacho de comandos é feito com base no resultado. Este método devolve o conteúdo da janela como uma string; se os espaços em branco na janela estão incluídos é afetado pelo atributo :attr:`stripspaces`.

source: Process a single command keystroke. Here are the supported special keystrokes:
pt_pt: Processa uma única tecla de comando. Aqui estão as teclas especiais suportadas:

source: Keystroke
pt_pt: Tecla

source: Action
pt_pt: Ação

source: Go to left edge of window.
pt_pt: Vai para a borda esquerda da janela.

source: Cursor left, wrapping to previous line if appropriate.
pt_pt: Move o cursor para a esquerda, passando para a linha anterior se apropriado.

source: Delete character under cursor.
pt_pt: Apaga o caractere sob o cursor.

source: Go to right edge (stripspaces off) or end of line (stripspaces on).
pt_pt: Vai para a borda direita (stripspaces desligado) ou final da linha (stripspaces ligado).

source: Cursor right, wrapping to next line when appropriate.
pt_pt: Move o cursor para a direita, passando para a linha seguinte quando apropriado.

source: Terminate, returning the window contents.
pt_pt: Termina, devolvendo o conteúdo da janela.

source: Delete character backward.
pt_pt: Apaga o caractere anterior.

source: Terminate if the window is 1 line, otherwise insert newline.
pt_pt: Termina se a janela tiver 1 linha, caso contrário insere uma nova linha.

source: If line is blank, delete it, otherwise clear to end of line.
pt_pt: Se a linha estiver em branco, apaga-a, caso contrário limpa até ao final da linha.

source: Refresh screen.
pt_pt: Atualiza o ecrã.

source: Cursor down; move down one line.
pt_pt: Move o cursor para baixo; move uma linha para baixo.

source: Insert a blank line at cursor location.
pt_pt: Insere uma linha em branco na localização do cursor.

source: Cursor up; move up one line.
pt_pt: Move o cursor para cima; move uma linha para cima.

source: Move operations do nothing if the cursor is at an edge where the movement is not possible. The following synonyms are supported where possible:
pt_pt: As operações de movimento não fazem nada se o cursor estiver numa borda onde o movimento não é possível. Os seguintes sinónimos são suportados onde possível:

source: All other keystrokes are treated as a command to insert the given character and move right (with line wrapping).
pt_pt: Todas as outras teclas são tratadas como um comando para inserir o caractere dado e mover para a direita (com quebra de linha).
