Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/curses.po
Languages: es_es, pt_pt

source: Backend function used by :func:`resizeterm`, performing most of the work; when resizing the windows, :func:`resize_term` blank-fills the areas that are extended. The calling application should fill in these areas with appropriate data. The :func:`!resize_term` function attempts to resize all windows. However, due to the calling convention of pads, it is not possible to resize these without additional interaction with the application.
es_es: Función backend utilizada por :func:`resizeterm`, que realiza la mayor parte del trabajo; al redimensionar las ventanas, :func:`resize_term` rellena en blanco las áreas que se amplían. La aplicación que llama debe rellenar estas áreas con los datos apropiados. La función :func:`!resize_term` intenta redimensionar todas las ventanas. Sin embargo, debido a la convención de llamada de los pads, no es posible redimensionarlas sin una interacción adicional con la aplicación.
pt_pt: Função de backend usada por :func:`resizeterm`, realizando a maior parte do trabalho; ao redimensionar as janelas, :func:`resize_term` preenche com espaços em branco as áreas que são estendidas. A aplicação chamadora deve preencher estas áreas com dados apropriados. A função :func:`!resize_term` tenta redimensionar todas as janelas. No entanto, devido à convenção de chamada dos blocos, não é possível redimensioná-los sem interação adicional com a aplicação.

source: Resize the standard and current windows to the specified dimensions, and adjusts other bookkeeping data used by the curses library that record the window dimensions (in particular the SIGWINCH handler).
es_es: Redimensiona las ventanas estándar y actual a las dimensiones especificadas, y ajusta otros datos de contabilidad utilizados por la biblioteca curses que registran las dimensiones de la ventana (en particular el manejador SIGWINCH).
pt_pt: Redimensiona as janelas padrão e atuais para as dimensões especificadas e ajusta outros dados de registo usados pela biblioteca curses que registam as dimensões da janela (em particular, o gestor SIGWINCH).

source: Save the current state of the terminal modes in a buffer, usable by :func:`resetty`.
es_es: Guarda el estado actual de los modos del terminal en un buffer, utilizable por :func:`resetty`.
pt_pt: Guarda o estado atual dos modos do terminal num buffer, utilizável por :func:`resetty`.

source: Retrieves the value set by :func:`set_escdelay`.
es_es: Recupera el valor establecido por :func:`set_escdelay`.
pt_pt: Recupera o valor definido por :func:`set_escdelay`.

source: Sets the number of milliseconds to wait after reading an escape character, to distinguish between an individual escape character entered on the keyboard from escape sequences sent by cursor and function keys.
es_es: Establece el número de milisegundos a esperar después de leer un carácter de escape, para distinguir entre un carácter de escape individual introducido en el teclado de las secuencias de escape enviadas por el cursor y las teclas de función.
pt_pt: Define o número de milissegundos a aguardar após a leitura de um caractere de escape, para distinguir entre um caractere de escape individual inserido no teclado e sequências de escape enviadas pelas teclas de cursor e função.

source: Retrieves the value set by :func:`set_tabsize`.
es_es: Recupera el valor establecido por :func:`set_tabsize`.
pt_pt: Recupera o valor definido por :func:`set_tabsize`.

source: Sets the number of columns used by the curses library when converting a tab character to spaces as it adds the tab to a window.
es_es: Establece el número de columnas utilizadas por la biblioteca curses cuando convierte un carácter de tabulación en espacios al añadir la tabulación a una ventana.
pt_pt: Define o número de colunas usadas pela biblioteca curses ao converter um caractere de tabulação em espaços à medida que adiciona a tabulação a uma janela.

source: Set the virtual screen cursor to *y*, *x*. If *y* and *x* are both ``-1``, then :meth:`leaveok <window.leaveok>` is set ``True``.
es_es: Establece el cursor de la pantalla virtual en *y*, *x*. Si *y* y *x* son ambos ``-1``, entonces :meth:`leaveok <window.leaveok>` se establece ``True``.
pt_pt: Define o cursor do ecrã virtual para *y*, *x*. Se *y* e *x* forem ambos ``-1``, então :meth:`leaveok <window.leaveok>` é definido como ``True``.

source: Initialize the terminal. *term* is a string giving the terminal name, or ``None``; if omitted or ``None``, the value of the :envvar:`TERM` environment variable will be used. *fd* is the file descriptor to which any initialization sequences will be sent; if not supplied or ``-1``, the file descriptor for ``sys.stdout`` will be used.
es_es: Inicializar el terminal. *term* es una cadena que indica el nombre del terminal, o ``None``; si se omite o ``None``, se utilizará el valor de la variable de entorno :envvar:`TERM`. *fd* es el descriptor de fichero al que se enviará cualquier secuencia de inicialización; si no se proporciona o ``-1``, se utilizará el descriptor de fichero para ``sys.stdout``.
pt_pt: Inicializa o terminal. *term* é uma string que dá o nome do terminal, ou ``None``; se omitido ou ``None``, será usado o valor da variável de ambiente :envvar:`TERM`. *fd* é o descritor de ficheiro para o qual quaisquer sequências de inicialização serão enviadas; se não for fornecido ou for ``-1``, será usado o descritor de ficheiro para ``sys.stdout``.

source: Must be called if the programmer wants to use colors, and before any other color manipulation routine is called. It is good practice to call this routine right after :func:`initscr`.
es_es: Debe llamarse si el programador desea utilizar colores, y antes de llamar a cualquier otra rutina de manipulación de colores. Es una buena práctica llamar a esta rutina justo después de :func:`initscr`.
pt_pt: Deve ser chamada se o programador pretender usar cores e antes de qualquer outra rotina de manipulação de cores ser chamada. É uma boa prática chamar esta rotina logo após :func:`initscr`.

source: :func:`start_color` initializes eight basic colors (black, red, green, yellow, blue, magenta, cyan, and white), and two global variables in the :mod:`curses` module, :const:`COLORS` and :const:`COLOR_PAIRS`, containing the maximum number of colors and color-pairs the terminal can support. It also restores the colors on the terminal to the values they had when the terminal was just turned on.
es_es: :func:`start_color` inicializa ocho colores básicos (negro, rojo, verde, amarillo, azul, magenta, cian y blanco) y dos variables globales en el módulo :mod:`curses`, :const:`COLORS` y :const:`COLOR_PAIRS`, que contienen el número máximo de colores y pares de colores que puede admitir el terminal. También restaura los colores del terminal a los valores que tenían cuando se encendió el terminal.
pt_pt: :func:`start_color` inicializa oito cores básicas (preto, vermelho, verde, amarelo, azul, magenta, ciano e branco) e duas variáveis globais no módulo :mod:`curses`, :const:`COLORS` e :const:`COLOR_PAIRS`, que contêm o número máximo de cores e pares de cores que o terminal pode suportar. Também restaura as cores no terminal para os valores que tinham quando o terminal foi ligado.

source: Return a logical OR of all video attributes supported by the terminal. This information is useful when a curses program needs complete control over the appearance of the screen.
es_es: Devuelve un OR lógico de todos los atributos de vídeo soportados por el terminal. Esta información es útil cuando un programa curses necesita un control total sobre la apariencia de la pantalla.
pt_pt: Devolve um OR lógico de todos os atributos de vídeo suportados pelo terminal. Esta informação é útil quando um programa curses precisa de controlo total sobre a aparência do ecrã.

source: Return the value of the environment variable :envvar:`TERM`, as a bytes object, truncated to 14 characters.
es_es: Devuelve el valor de la variable de entorno :envvar:`TERM`, como un objeto bytes, truncado a 14 caracteres.
pt_pt: Devolve o valor da variável de ambiente :envvar:`TERM` como um objeto de bytes, truncado para 14 caracteres.

source: Return the value of the Boolean capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-1`` if *capname* is not a Boolean capability, or ``0`` if it is canceled or absent from the terminal description.
es_es: Devuelve el valor de la capacidad booleana correspondiente al nombre de capacidad terminfo *capname* como un entero. Devuelve el valor ``-1`` si *capname* no es una capacidad booleana, o ``0`` si está cancelada o ausente en la descripción del terminal.
pt_pt: Devolve o valor da capacidade booleana correspondente ao nome da capacidade terminfo *capname* como um inteiro. Devolve o valor ``-1`` se *capname* não for uma capacidade booleana, ou ``0`` se estiver cancelada ou ausente da descrição do terminal.

source: Return the value of the numeric capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-2`` if *capname* is not a numeric capability, or ``-1`` if it is canceled or absent from the terminal description.
es_es: Devuelve el valor de la capacidad numérica correspondiente al nombre de capacidad terminfo *capname* como un entero. Devuelve el valor ``-2`` si *capname* no es una capacidad numérica, o ``-1`` si está cancelada o ausente en la descripción del terminal.
pt_pt: Devolve o valor da capacidade numérica correspondente ao nome da capacidade terminfo *capname* como um inteiro. Devolve o valor ``-2`` se *capname* não for uma capacidade numérica, ou ``-1`` se estiver cancelada ou ausente da descrição do terminal.

source: Return the value of the string capability corresponding to the terminfo capability name *capname* as a bytes object. Return ``None`` if *capname* is not a terminfo "string capability", or is canceled or absent from the terminal description.
es_es: Devuelve el valor de la capacidad de cadena correspondiente al nombre de capacidad terminfo *capname* como un objeto bytes. Devuelve ``None`` si *capname* no es una "capacidad de cadena" terminfo, o está cancelada o ausente de la descripción del terminal.
pt_pt: Devolve o valor da capacidade de string correspondente ao nome da capacidade terminfo *capname* como um objeto de bytes. Devolve ``None`` se *capname* não for uma capacidade de string terminfo, ou se estiver cancelada ou ausente da descrição do terminal.

source: Instantiate the bytes object *str* with the supplied parameters, where *str* should be a parameterized string obtained from the terminfo database. E.g. ``tparm(tigetstr("cup"), 5, 3)`` could result in ``b'\033[6;4H'``, the exact result depending on terminal type.
es_es: Instanciar el objeto bytes *str* con los parámetros suministrados, donde *str* debe ser una cadena parametrizada obtenida de la base de datos terminfo. Por ejemplo, ``tparm(tigetstr("cup"), 5, 3)`` podría dar como resultado ``b'\033[6;4H'``, el resultado exacto dependerá del tipo de terminal.
pt_pt: Instancia o objeto de bytes *str* com os parâmetros fornecidos, onde *str* deve ser uma string parametrizada obtida da base de dados terminfo. Por exemplo, ``tparm(tigetstr("cup"), 5, 3)`` poderia resultar em ``b'\033[6;4H'``, sendo o resultado exato dependente do tipo de terminal.

source: Specify that the file descriptor *fd* be used for typeahead checking. If *fd* is ``-1``, then no typeahead checking is done.
es_es: Especifica que se utilice el descriptor de fichero *fd* para la comprobación de tipo. Si *fd* es ``-1``, no se realiza ninguna comprobación de tipo.
pt_pt: Especifica que o descritor de ficheiro *fd* deve ser usado para verificação de entrada antecipada. Se *fd* for ``-1``, não é feita nenhuma verificação de entrada antecipada.

source: The curses library does "line-breakout optimization" by looking for typeahead periodically while updating the screen. If input is found, and it is coming from a tty, the current update is postponed until refresh or doupdate is called again, allowing faster response to commands typed in advance. This function allows specifying a different file descriptor for typeahead checking.
es_es: La biblioteca curses hace una "optimización de salto de línea" buscando typeahead periódicamente mientras actualiza la pantalla. Si la entrada es encontrada, y viene de un tty, la actualización actual es pospuesta hasta que refresh o doupdate es llamado de nuevo, permitiendo una respuesta más rápida a los comandos tecleados por adelantado. Esta función permite especificar un descriptor de fichero diferente para la comprobación typeahead.
pt_pt: A biblioteca curses faz "otimização de interrupção de linha" procurando entrada antecipada periodicamente enquanto atualiza o ecrã. Se for encontrada entrada e esta vier de um tty, a atualização atual é adiada até que refresh ou doupdate seja chamado novamente, permitindo uma resposta mais rápida a comandos digitados antecipadamente. Esta função permite especificar um descritor de ficheiro diferente para verificação de entrada antecipada.

source: Return a bytes object which is a printable representation of the character *ch*. Control characters are represented as a caret followed by the character, for example as ``b'^C'``. Printing characters are left as they are.
es_es: Devuelve un objeto bytes que es una representación imprimible del carácter *ch*. Los caracteres de control se representan como un signo de intercalación seguido del carácter, por ejemplo ``b'^C'``. Los caracteres de impresión se dejan tal cual.
pt_pt: Devolve um objeto de bytes que é uma representação imprimível do caractere *ch*. Os caracteres de controlo são representados como um acento circunflexo seguido do caractere, por exemplo, como ``b'^C'``. Os caracteres imprimíveis são deixados como estão.

source: Push *ch* so the next :meth:`~window.getch` will return it.
es_es: Pulsa *ch* para que el siguiente :meth:`~window.getch` lo devuelva.
pt_pt: Coloca *ch* de forma a que a próxima chamada a :meth:`~window.getch` o devolva.

source: Only one *ch* can be pushed before :meth:`!getch` is called.
es_es: Sólo se puede pulsar una *ch* antes de llamar a :meth:`!getch`.
pt_pt: Apenas um *ch* pode ser colocado antes de :meth:`!getch` ser chamado.

source: Update the :const:`LINES` and :const:`COLS` module variables. Useful for detecting manual screen resize.
es_es: Actualiza las variables de los módulos :const:`LINES` y :const:`COLS`. Útil para detectar el redimensionamiento manual de la pantalla.
pt_pt: Atualiza as variáveis do módulo :const:`LINES` e :const:`COLS`. Útil para detetar redimensionamento manual do ecrã.

source: Push *ch* so the next :meth:`~window.get_wch` will return it.
es_es: Pulsa *ch* para que el siguiente :meth:`~window.get_wch` lo devuelva.
pt_pt: Coloca *ch* de forma a que a próxima chamada a :meth:`~window.get_wch` o devolva.

source: Only one *ch* can be pushed before :meth:`!get_wch` is called.
es_es: Sólo se puede pulsar una *ch* antes de llamar a :meth:`!get_wch`.
pt_pt: Apenas um *ch* pode ser colocado antes de :meth:`!get_wch` ser chamado.

source: Push a :const:`KEY_MOUSE` event onto the input queue, associating the given state data with it.
es_es: Coloca un evento :const:`KEY_MOUSE` en la cola de entrada, asociándole los datos de estado dados.
pt_pt: Coloca um evento :const:`KEY_MOUSE` na fila de entrada, associando os dados de estado fornecidos a ele.

source: If used, this function should be called before :func:`initscr` or newterm are called. When *flag* is ``False``, the values of lines and columns specified in the terminfo database will be used, even if environment variables :envvar:`LINES` and :envvar:`COLUMNS` (used by default) are set, or if curses is running in a window (in which case default behavior would be to use the window size if :envvar:`LINES` and :envvar:`COLUMNS` are not set).
es_es: Si se usa, se debe llamar esta función antes de que se llamen:func:`initscr` o newterm. Cuando *flag* es ``False``, se usarán los valores de líneas y columnas especificados en la base de datos terminfo, incluso si las variables de entorno :envvar:`LINES` y :envvar:`COLUMNS` (usadas por defecto) están establecidas, o si curses se está ejecutando en una ventana (en cuyo caso el comportamiento por defecto sería usar el tamaño de la ventana si :envvar:`LINES` y :envvar:`COLUMNS` no están establecidas).
pt_pt: Se usada, esta função deve ser chamada antes de :func:`initscr` ou newterm serem chamadas. Quando *flag* é ``False``, os valores de linhas e colunas especificados na base de dados terminfo serão usados, mesmo que as variáveis de ambiente :envvar:`LINES` e :envvar:`COLUMNS` (usadas por predefinição) estejam definidas, ou se curses estiver a ser executado numa janela (caso em que o comportamento predefinido seria usar o tamanho da janela se :envvar:`LINES` e :envvar:`COLUMNS` não estiverem definidas).

source: Initialize curses and call another callable object, *func*, which should be the rest of your curses-using application. If the application raises an exception, this function will restore the terminal to a sane state before re-raising the exception and generating a traceback. The callable object *func* is then passed the main window 'stdscr' as its first argument, followed by any other arguments passed to :func:`!wrapper`. Before calling *func*, :func:`!wrapper` turns on cbreak mode, turns off echo, enables the terminal keypad, and initializes colors if the terminal has color support. On exit (whether normally or by exception) it restores cooked mode, turns on echo, and disables the terminal keypad.
es_es: Inicializa curses y llama a otro objeto invocable, *func*, que debería ser el resto de la aplicación que utiliza curses. Si la aplicación lanza una excepción, esta función restaurará el terminal a un estado sano antes de volver a lanzar la excepción y generar un rastreo. Al objeto invocable *func* se le pasa la ventana principal 'stdscr' como primer argumento, seguido de cualquier otro argumento pasado a :func:`!wrapper`. Antes de llamar a *func*, :func:`!wrapper` activa el modo cbreak, desactiva echo, activa el teclado del terminal, e inicializa los colores si el terminal tiene soporte de color. Al salir (normalmente o por excepción), restaura el modo cocinado, activa el eco y desactiva el teclado del terminal.
pt_pt: Inicializa curses e chama outro objeto chamável, *func*, que deve ser o resto da sua aplicação que usa curses. Se a aplicação lançar uma exceção, esta função restaurará o terminal para um estado coerente antes de relançar a exceção e gerar um traceback. O objeto chamável *func* recebe então a janela principal 'stdscr' como seu primeiro argumento, seguido de quaisquer outros argumentos passados para :func:`!wrapper`. Antes de chamar *func*, :func:`!wrapper` ativa o modo cbreak, desativa o eco, ativa o teclado do terminal e inicializa as cores se o terminal tiver suporte para cores. Na saída (seja normal ou por exceção), restaura o modo cozinhado, ativa o eco e desativa o teclado do terminal.

source: Window Objects
es_es: Objetos de ventana
pt_pt: Objetos de Janela

source: Window objects, as returned by :func:`initscr` and :func:`newwin` above, have the following methods and attributes:
es_es: Los objetos Window, devueltos por :func:`initscr` y :func:`newwin`, tienen los siguientes métodos y atributos:
pt_pt: Os objetos de janela, como devolvidos por :func:`initscr` e :func:`newwin` acima, têm os seguintes métodos e atributos:

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, overwriting any character previously painted at that location. By default, the character position and attributes are the current settings for the window object.
es_es: Pinta el carácter *ch* en ``(y, x)`` con los atributos *attr*, sobrescribiendo cualquier carácter pintado previamente en esa ubicación. Por defecto, la posición del carácter y los atributos son los ajustes actuales para el objeto ventana.
pt_pt: Desenha o caractere *ch* em ``(y, x)`` com os atributos *attr*, sobrescrevendo qualquer caractere anteriormente desenhado nessa localização. Por predefinição, a posição do caractere e os atributos são as definições atuais para o objeto de janela.

source: Writing outside the window, subwindow, or pad raises a :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the character is printed.
es_es: Si se escribe fuera de la ventana, subventana o almohadilla, se produce un error :exc:`curses.error`. Si se intenta escribir en la esquina inferior derecha de una ventana, subventana o almohadilla, se producirá una excepción después de imprimir el carácter.
pt_pt: Escrever fora da janela, subjanela ou bloco lança uma exceção :exc:`curses.error`. Tentar escrever no canto inferior direito de uma janela, subjanela ou bloco fará com que uma exceção seja lançada após o caractere ser impresso.

source: Paint at most *n* characters of the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
es_es: Pinta como máximo *n* caracteres de la cadena de caracteres *str* en ``(y, x)`` con los atributos *attr*, sobrescribiendo todo lo que había previamente en la pantalla.
pt_pt: Desenha no máximo *n* caracteres da string de caracteres *str* em ``(y, x)`` com os atributos *attr*, sobrescrevendo qualquer coisa anteriormente no ecrã.

source: Paint the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
es_es: Pinta la cadena de caracteres *str* en ``(y, x)`` con los atributos *attr*, sobrescribiendo todo lo que había previamente en la pantalla.
pt_pt: Desenha a string de caracteres *str* em ``(y, x)`` com os atributos *attr*, sobrescrevendo qualquer coisa anteriormente no ecrã.

source: Writing outside the window, subwindow, or pad raises :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the string is printed.
es_es: Si se escribe fuera de la ventana, subventana o almohadilla, se produce :exc:`curses.error`. Si se intenta escribir en la esquina inferior derecha de una ventana, subventana o almohadilla, se producirá una excepción después de imprimir la cadena.
pt_pt: Escrever fora da janela, subjanela ou bloco lança uma exceção :exc:`curses.error`. Tentar escrever no canto inferior direito de uma janela, subjanela ou bloco fará com que uma exceção seja lançada após a string ser impressa.

source: A `bug in ncurses <https://bugs.python.org/issue35924>`_, the backend for this Python module, can cause SegFaults when resizing windows. This is fixed in ncurses-6.1-20190511. If you are stuck with an earlier ncurses, you can avoid triggering this if you do not call :func:`addstr` with a *str* that has embedded newlines. Instead, call :func:`addstr` separately for each line.
es_es: Un `bug en ncurses <https://bugs.python.org/issue35924>`_, el backend para este módulo Python, puede causar SegFaults al redimensionar ventanas. Esto está arreglado en ncurses-6.1-20190511. Si está atascado con un ncurses anterior, puede evitar desencadenar esto si no llama a :func:`addstr` con una *str* que tenga nuevas líneas incrustadas. En su lugar, llame a :func:`addstr` separadamente para cada línea.
pt_pt: Um `bug na ncurses <https://bugs.python.org/issue35924>`_, o backend para este módulo Python, pode causar SegFaults ao redimensionar janelas. Isto está corrigido na ncurses-6.1-20190511. Se estiver limitado a uma versão anterior da ncurses, pode evitar desencadear isto se não chamar :func:`addstr` com uma *str* que tenha novas linhas incorporadas. Em vez disso, chame :func:`addstr` separadamente para cada linha.
