Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/curses.po
Languages: es_es, pt_pt

source: Return the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` member.
pt_pt: Devolve o conteúdo da janela como uma string; se os espaços em branco na janela estão incluídos é afetado pelo membro :attr:`stripspaces`.

source: This attribute is a flag which controls the interpretation of blanks in the window. When it is on, trailing blanks on each line are ignored; any cursor motion that would land the cursor on a trailing blank goes to the end of that line instead, and trailing blanks are stripped when the window contents are gathered.
pt_pt: Este atributo é uma flag que controla a interpretação de espaços em branco na janela. Quando está ativa, os espaços em branco no final de cada linha são ignorados; qualquer movimento do cursor que o colocaria num espaço em branco no final vai para o final dessa linha em vez disso, e os espaços em branco no final são removidos quando o conteúdo da janela é recolhido.

source: A panel stack extension that adds depth to curses windows.
es_es: Una extensión de la pila de paneles que añade profundidad a las ventanas curses.

source: Change the definition of a color-pair. It takes three arguments: the number of the color-pair to be changed, the foreground color number, and the background color number. The value of *pair_number* must be between ``1`` and ``COLOR_PAIRS - 1`` (the ``0`` color pair is wired to white on black and cannot be changed). The value of *fg* and *bg* arguments must be between ``0`` and ``COLORS - 1``, or, after calling :func:`use_default_colors`, ``-1``. If the color-pair was previously initialized, the screen is refreshed and all occurrences of that color-pair are changed to the new definition.
es_es: Cambia la definición de un par de colores. Recibe tres argumentos: el número del par de colores que se va a modificar, el número del color de primer plano y el número del color de fondo. El valor de *número_de_par* debe estar comprendido entre ``1`` y ``COLOR_PAIRS - 1`` (el par de colores ``0`` está conectado a blanco sobre negro y no puede modificarse). El valor de los argumentos *fg* y *bg* debe estar entre ``0`` y ``COLORS - 1``, o, tras llamar a :func:`use_default_colors`, ``-1``. Si el par de colores se ha inicializado previamente, la pantalla se actualiza y todas las apariciones de ese par de colores se cambian a la nueva definición.

source: Allow use of default values for colors on terminals supporting this feature. Use this to support transparency in your application. The default color is assigned to the color number ``-1``. After calling this function, ``init_pair(x, curses.COLOR_RED, -1)`` initializes, for instance, color pair *x* to a red foreground color on the default background.
es_es: Permitir el uso de valores por defecto para los colores en los terminales que soportan esta característica. Utilícelo para admitir la transparencia en su aplicación. El color por defecto se asigna al número de color ``-1``. Después de llamar a esta función, ``init_pair(x, curses.COLOR_RED, -1)`` inicializa, por ejemplo, el par de colores *x* a un color de primer plano rojo sobre el fondo por defecto.

source: Add attribute *attr* from the "background" set applied to all writes to the current window.
es_es: Añade el atributo *attr* del conjunto "background" aplicado a todas las escrituras en la ventana actual.

source: Read a bytes object from the user, with primitive line editing capacity.
es_es: Lee un objeto bytes del usuario, con capacidad de edición de líneas primitivas.

source: Return a bytes object of characters, extracted from the window starting at the current cursor position, or at *y*, *x* if specified. Attributes are stripped from the characters. If *n* is specified, :meth:`instr` returns a string at most *n* characters long (exclusive of the trailing NUL).
es_es: Devuelve un objeto bytes de caracteres, extraídos de la ventana comenzando en la posición actual del cursor, o en *y*, *x* si se especifica. Los atributos se eliminan de los caracteres. Si se especifica *n*, :meth:`instr` devuelve una cadena con un máximo de *n* caracteres (excluyendo el NUL final).
