Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/curses.po
Languages: es_es, pt_pt

source: Return ``True`` if the module supports extended colors; otherwise, return ``False``. Extended color support allows more than 256 color pairs for terminals that support more than 16 colors (e.g. xterm-256color).
es_es: Devuelve ``True`` si el módulo admite colores extendidos; en caso contrario, devuelve ``False``. El soporte de colores extendidos permite más de 256 pares de colores para terminales que soportan más de 16 colores (por ejemplo, xterm-256color).
pt_pt: Devolve ``True`` se o módulo suportar cores estendidas; caso contrário, devolve ``False``. O suporte a cores estendidas permite mais de 256 pares de cores para terminais que suportam mais de 16 cores (por exemplo, xterm-256color).

source: Extended color support requires ncurses version 6.1 or later.
es_es: El soporte de color extendido requiere ncurses versión 6.1 o posterior.
pt_pt: O suporte a cores estendidas requer a versão 6.1 ou posterior da ncurses.

source: Return ``True`` if the terminal has insert- and delete-character capabilities. This function is included for historical reasons only, as all modern software terminal emulators have such capabilities.
es_es: Devuelve ``True`` si el terminal tiene capacidades de inserción y borrado de caracteres. Esta función se incluye sólo por razones históricas, ya que todos los emuladores de terminal de software modernos tienen estas capacidades.
pt_pt: Devolve ``True`` se o terminal tiver capacidades de inserir e apagar caracteres. Esta função está incluída apenas por razões históricas, uma vez que todos os emuladores de terminal modernos têm essas capacidades.

source: Return ``True`` if the terminal has insert- and delete-line capabilities, or can simulate them using scrolling regions. This function is included for historical reasons only, as all modern software terminal emulators have such capabilities.
es_es: Devuelve ``True`` si el terminal tiene capacidades de inserción y borrado de líneas, o puede simularlas utilizando regiones de desplazamiento. Esta función se incluye sólo por razones históricas, ya que todos los emuladores de terminal de software modernos tienen tales capacidades.
pt_pt: Devolve ``True`` se o terminal tiver capacidades de inserir e apagar linhas, ou puder simulá-las usando regiões de deslocamento. Esta função está incluída apenas por razões históricas, uma vez que todos os emuladores de terminal modernos têm essas capacidades.

source: Take a key value *ch*, and return ``True`` if the current terminal type recognizes a key with that value.
es_es: Toma un valor de clave *ch*, y devuelve ``True`` si el tipo de terminal actual reconoce una clave con ese valor.
pt_pt: Recebe um valor de tecla *ch* e devolve ``True`` se o tipo de terminal atual reconhecer uma tecla com esse valor.

source: Used for half-delay mode, which is similar to cbreak mode in that characters typed by the user are immediately available to the program. However, after blocking for *tenths* tenths of seconds, raise an exception if nothing has been typed. The value of *tenths* must be a number between ``1`` and ``255``. Use :func:`nocbreak` to leave half-delay mode.
es_es: Usado para el modo de medio retardo, que es similar al modo cbreak en que los caracteres tecleados por el usuario están inmediatamente disponibles para el programa. Sin embargo, después de bloquear durante *décimas* décimas de segundo, lanza una excepción si no se ha tecleado nada. El valor de *décimas* debe ser un número entre ``1`` y ``255``. Utilice :func:`nocbreak` para salir del modo de medio retardo.
pt_pt: Usado no modo half-delay, que é semelhante ao modo cbreak, pois os caracteres digitados pelo utilizador estão imediatamente disponíveis para o programa. No entanto, após bloquear durante *tenths* décimos de segundo, lança uma exceção se nada tiver sido digitado. O valor de *tenths* deve ser um número entre ``1`` e ``255``. Use :func:`nocbreak` para sair do modo half-delay.

source: Change the definition of a color, taking the number of the color to be changed followed by three RGB values (for the amounts of red, green, and blue components). The value of *color_number* must be between ``0`` and ``COLORS - 1``. Each of *r*, *g*, *b*, must be a value between ``0`` and ``1000``. When :func:`init_color` is used, all occurrences of that color on the screen immediately change to the new definition. This function is a no-op on most terminals; it is active only if :func:`can_change_color` returns ``True``.
es_es: Cambia la definición de un color, tomando el número del color a cambiar seguido de tres valores RGB (para las cantidades de componentes rojo, verde y azul). El valor de *número_color* debe estar comprendido entre ``0`` y ``COLORS - 1``. Cada uno de *r*, *g*, *b*, debe ser un valor entre ``0`` y ``1000``. Cuando se utiliza :func:`init_color`, todas las apariciones de ese color en la pantalla cambian inmediatamente a la nueva definición. Esta función no funciona en la mayoría de los terminales; sólo se activa si :func:`can_change_color` devuelve ``True``.
pt_pt: Altera a definição de uma cor, recebendo o número da cor a ser alterada, seguido de três valores RGB (para as quantidades de componentes vermelho, verde e azul). O valor de *color_number* deve estar entre ``0`` e ``COLORS - 1``. Cada um dos valores *r*, *g*, *b* deve estar entre ``0`` e ``1000``. Quando :func:`init_color` é usado, todas as ocorrências dessa cor no ecrã mudam imediatamente para a nova definição. Esta função não tem efeito na maioria dos terminais; só está ativa se :func:`can_change_color` devolver ``True``.

source: Initialize the library. Return a :ref:`window <curses-window-objects>` object which represents the whole screen.
es_es: Inicializa la librería. Devuelve un objeto :ref:`window <curses-window-objects>` que representa toda la pantalla.
pt_pt: Inicializa a biblioteca. Devolve um objeto :ref:`window <curses-window-objects>` que representa todo o ecrã.

source: If there is an error opening the terminal, the underlying curses library may cause the interpreter to exit.
es_es: Si se produce un error al abrir el terminal, la biblioteca curses subyacente puede provocar la salida del intérprete.
pt_pt: Se ocorrer um erro ao abrir o terminal, a biblioteca curses subjacente pode fazer com que o interpretador termine.

source: Return ``True`` if :func:`resize_term` would modify the window structure, ``False`` otherwise.
es_es: Devuelve ``True`` si :func:`resize_term` modificaría la estructura de la ventana, ``False`` en caso contrario.
pt_pt: Devolve ``True`` se :func:`resize_term` modificar a estrutura da janela, ``False`` caso contrário.

source: Return ``True`` if :func:`endwin` has been called (that is, the curses library has been deinitialized).
es_es: Devuelve ``True`` si se ha llamado a :func:`endwin` (es decir, si se ha desinicializado la biblioteca curses).
pt_pt: Devolve ``True`` se :func:`endwin` tiver sido chamada (ou seja, se a biblioteca curses tiver sido desinicializada).

source: Return the name of the key numbered *k* as a bytes object. The name of a key generating printable ASCII character is the key's character. The name of a control-key combination is a two-byte bytes object consisting of a caret (``b'^'``) followed by the corresponding printable ASCII character. The name of an alt-key combination (128--255) is a bytes object consisting of the prefix ``b'M-'`` followed by the name of the corresponding ASCII character.
es_es: Devuelve el nombre de la clave numerada *k* como un objeto bytes. El nombre de una tecla que genera un carácter ASCII imprimible es el carácter de la tecla. El nombre de una combinación de teclas de control es un objeto bytes de dos bytes formado por un signo de intercalación (``b'^'``) seguido del carácter ASCII imprimible correspondiente. El nombre de una combinación de teclas alt (128--255) es un objeto de bytes formado por el prefijo ``b'M-'`` seguido del nombre del carácter ASCII correspondiente.
pt_pt: Devolve o nome da tecla numerada *k* como um objeto de bytes. O nome de uma tecla que gera um caractere ASCII imprimível é o caractere da tecla. O nome de uma combinação de tecla de controlo é um objeto de bytes de dois bytes constituído por um acento circunflexo (``b'^'``) seguido do caractere ASCII imprimível correspondente. O nome de uma combinação de tecla alt (128--255) é um objeto de bytes constituído pelo prefixo ``b'M-'`` seguido do nome do caractere ASCII correspondente.

source: Return the user's current line kill character as a one-byte bytes object. Under Unix operating systems this is a property of the controlling tty of the curses program, and is not set by the curses library itself.
es_es: Devuelve el carácter de fin de línea actual del usuario como un objeto bytes de un byte. En sistemas operativos Unix esta es una propiedad del tty controlador del programa curses, y no es establecida por la propia biblioteca curses.
pt_pt: Devolve o caractere de eliminação de linha atual do utilizador como um objeto de bytes de um byte. Em sistemas operativos Unix, esta é uma propriedade do tty de controlo do programa curses, e não é definida pela própria biblioteca curses.

source: Return a bytes object containing the terminfo long name field describing the current terminal. The maximum length of a verbose description is 128 characters. It is defined only after the call to :func:`initscr`.
es_es: Devuelve un objeto bytes que contiene el campo terminfo long name que describe el terminal actual. La longitud máxima de una descripción verbose es de 128 caracteres. Se define sólo después de la llamada a :func:`initscr`.
pt_pt: Devolve um objeto de bytes contendo o campo de nome longo terminfo que descreve o terminal atual. O comprimento máximo de uma descrição detalhada é de 128 caracteres. Está definido apenas após a chamada a :func:`initscr`.

source: If *flag* is ``True``, allow 8-bit characters to be input. If *flag* is ``False``, allow only 7-bit chars.
es_es: Si *flag* es ``True``, permite la entrada de caracteres de 8 bits. Si *flag* es ``False``, permite sólo caracteres de 7 bits.
pt_pt: Se *flag* for ``True``, permite a entrada de caracteres de 8 bits. Se *flag* for ``False``, permite apenas caracteres de 7 bits.

source: Set the maximum time in milliseconds that can elapse between press and release events in order for them to be recognized as a click, and return the previous interval value. The default value is 200 milliseconds, or one fifth of a second.
es_es: Establece el tiempo máximo en milisegundos que puede transcurrir entre los eventos de pulsar y soltar para que se reconozcan como un clic, y devuelve el valor del intervalo anterior. El valor predeterminado es 200 milisegundos, o una quinta parte de un segundo.
pt_pt: Define o tempo máximo em milissegundos que pode decorrer entre os eventos de pressionar e libertar para que sejam reconhecidos como um clique, e devolve o valor do intervalo anterior. O valor predefinido é de 200 milissegundos, ou um quinto de segundo.

source: Set the mouse events to be reported, and return a tuple ``(availmask, oldmask)``. *availmask* indicates which of the specified mouse events can be reported; on complete failure it returns ``0``. *oldmask* is the previous value of the given window's mouse event mask. If this function is never called, no mouse events are ever reported.
es_es: Establece los eventos de ratón que deben notificarse y devuelve una tupla ``(availmask, oldmask)``. *availmask* indica cuáles de los eventos de ratón especificados pueden ser reportados; en caso de fallo completo devuelve ``0``. *oldmask* es el valor anterior de la máscara de eventos de ratón de la ventana dada. Si nunca se llama a esta función, no se informará de ningún evento de ratón.
pt_pt: Define os eventos do rato a serem reportados e devolve um tuplo ``(availmask, oldmask)``. *availmask* indica quais dos eventos do rato especificados podem ser reportados; em caso de falha completa, devolve ``0``. *oldmask* é o valor anterior da máscara de eventos do rato da janela dada. Se esta função nunca for chamada, nenhum evento do rato é reportado.

source: Sleep for *ms* milliseconds.
es_es: Dormir durante *ms* milisegundos.
pt_pt: Dormir durante *ms* milissegundos.

source: Create and return a pointer to a new pad data structure with the given number of lines and columns. Return a pad as a window object.
es_es: Crea y devuelve un puntero a una nueva estructura de datos de pad con el número dado de líneas y columnas. Devuelve un pad como objeto ventana.
pt_pt: Cria e devolve um ponteiro para uma nova estrutura de dados de bloco com o número dado de linhas e colunas. Devolve um bloco como um objeto de janela.

source: A pad is like a window, except that it is not restricted by the screen size, and is not necessarily associated with a particular part of the screen. Pads can be used when a large window is needed, and only a part of the window will be on the screen at one time. Automatic refreshes of pads (such as from scrolling or echoing of input) do not occur. The :meth:`~window.refresh` and :meth:`~window.noutrefresh` methods of a pad require 6 arguments to specify the part of the pad to be displayed and the location on the screen to be used for the display. The arguments are *pminrow*, *pmincol*, *sminrow*, *smincol*, *smaxrow*, *smaxcol*; the *p* arguments refer to the upper left corner of the pad region to be displayed and the *s* arguments define a clipping box on the screen within which the pad region is to be displayed.
es_es: Una almohadilla es como una ventana, salvo que no está restringida por el tamaño de la pantalla y no está necesariamente asociada a una parte concreta de la misma. Los pads se pueden utilizar cuando se necesita una ventana grande, y sólo una parte de la ventana estará en la pantalla a la vez. Los pads no se actualizan automáticamente (por ejemplo, al desplazarse o al hacerse eco de la entrada). Los métodos :meth:`~window.refresh` y :meth:`~window.noutrefresh` de un pad requieren 6 argumentos para especificar la parte del pad que se mostrará y la ubicación en la pantalla que se utilizará para la visualización. Los argumentos son *pminrow*, *pmincol*, *sminrow*, *smincol*, *smaxrow*, *smaxcol*; los argumentos *p* se refieren a la esquina superior izquierda de la región del pad que se va a mostrar y los argumentos *s* definen una caja de recorte en la pantalla dentro de la cual se va a mostrar la región del pad.
pt_pt: Um bloco é semelhante a uma janela, exceto que não está restrito pelo tamanho do ecrã e não está necessariamente associado a uma parte específica do ecrã. Os blocos podem ser usados quando é necessária uma grande janela e apenas uma parte da janela estará no ecrã de cada vez. As atualizações automáticas de blocos (como por deslocamento ou eco de entrada) não ocorrem. Os métodos :meth:`~window.refresh` e :meth:`~window.noutrefresh` de um bloco requerem 6 argumentos para especificar a parte do bloco a ser exibida e a localização no ecrã a ser usada para a exibição. Os argumentos são *pminrow*, *pmincol*, *sminrow*, *smincol*, *smaxrow*, *smaxcol*; os argumentos *p* referem-se ao canto superior esquerdo da região do bloco a ser exibida e os argumentos *s* definem uma caixa de recorte no ecrã dentro da qual a região do bloco deve ser exibida.

source: Return a new :ref:`window <curses-window-objects>`, whose left-upper corner is at ``(begin_y, begin_x)``, and whose height/width is *nlines*/*ncols*.
es_es: Devuelve una nueva :ref:`window <curses-window-objects>`, cuya esquina superior izquierda está en ``(begin_y, begin_x)``, y cuya altura/anchura es *nlines*/*ncols*.
pt_pt: Devolve uma nova :ref:`window <curses-window-objects>`, cujo canto superior esquerdo está em ``(begin_y, begin_x)``, e cuja altura/largura é *nlines*/*ncols*.

source: By default, the window will extend from the specified position to the lower right corner of the screen.
es_es: Por defecto, la ventana se extenderá desde la posición especificada hasta la esquina inferior derecha de la pantalla.
pt_pt: Por predefinição, a janela estender-se-á da posição especificada até ao canto inferior direito do ecrã.

source: Enter newline mode. This mode translates the return key into newline on input, and translates newline into return and line-feed on output. Newline mode is initially on.
es_es: Entra en el modo nueva línea. Este modo convierte la tecla de retorno en nueva línea en la entrada, y convierte la nueva línea en retorno y salto de línea en la salida. El modo nueva línea está activado inicialmente.
pt_pt: Ativa o modo de nova linha. Este modo traduz a tecla de retorno em nova linha na entrada e traduz a nova linha em retorno e avanço de linha na saída. O modo de nova linha está ativo por predefinição.

source: Leave cbreak mode. Return to normal "cooked" mode with line buffering.
es_es: Salir del modo cbreak. Vuelve al modo normal "cooked" con búfer de línea.
pt_pt: Sai do modo cbreak. Volta ao modo "cozinhado" normal com buffer de linha.

source: Leave echo mode. Echoing of input characters is turned off.
es_es: Salir del modo eco. Se desactiva el eco de los caracteres introducidos.
pt_pt: Sai do modo eco. O eco dos caracteres de entrada é desativado.

source: Leave newline mode. Disable translation of return into newline on input, and disable low-level translation of newline into newline/return on output (but this does not change the behavior of ``addch('\n')``, which always does the equivalent of return and line feed on the virtual screen). With translation off, curses can sometimes speed up vertical motion a little; also, it will be able to detect the return key on input.
es_es: Dejar el modo de nueva línea. Desactivar la traducción de retorno a nueva línea en la entrada, y desactivar la traducción de bajo nivel de nueva línea a nueva línea/retorno en la salida (pero esto no cambia el comportamiento de ``addch('\n')``, que siempre hace el equivalente de retorno y salto de línea en la pantalla virtual). Con la traducción desactivada, curses puede a veces acelerar un poco el movimiento vertical; además, será capaz de detectar la tecla return en la entrada.
pt_pt: Sai do modo de nova linha. Desativa a tradução de retorno em nova linha na entrada e desativa a tradução de baixo nível de nova linha em nova linha/retorno na saída (mas isto não altera o comportamento de ``addch('\n')``, que sempre faz o equivalente a retorno e avanço de linha no ecrã virtual). Com a tradução desativada, curses pode, por vezes, acelerar um pouco o movimento vertical; além disso, será capaz de detetar a tecla de retorno na entrada.

source: When the :func:`!noqiflush` routine is used, normal flush of input and output queues associated with the ``INTR``, ``QUIT`` and ``SUSP`` characters will not be done. You may want to call :func:`!noqiflush` in a signal handler if you want output to continue as though the interrupt had not occurred, after the handler exits.
es_es: Cuando se utiliza la rutina :func:`!noqiflush`, no se realiza el vaciado normal de las colas de entrada y salida asociadas a los caracteres ``INTR``, ``QUIT`` y ``SUSP``. Es posible que desee llamar a :func:`!noqiflush` en un manejador de señales si desea que la salida continúe como si la interrupción no se hubiera producido, después de que el manejador salga.
pt_pt: Quando a rotina :func:`!noqiflush` é usada, a limpeza normal das filas de entrada e saída associadas aos caracteres ``INTR``, ``QUIT`` e ``SUSP`` não será feita. Pode querer chamar :func:`!noqiflush` num gestor de sinais se pretender que a saída continue como se a interrupção não tivesse ocorrido, após a saída do gestor.

source: Leave raw mode. Return to normal "cooked" mode with line buffering.
es_es: Salir del modo raw. Volver al modo normal "cooked" con búfer de línea.
pt_pt: Sai do modo raw. Volta ao modo "cozinhado" normal com buffer de linha.

source: Return a tuple ``(fg, bg)`` containing the colors for the requested color pair. The value of *pair_number* must be between ``0`` and ``COLOR_PAIRS - 1``.
es_es: Devuelve una tupla ``(fg, bg)`` que contiene los colores del par de colores solicitado. El valor de *pair_number* debe estar comprendido entre ``0`` y ``COLOR_PAIRS - 1``.
pt_pt: Devolve um tuplo ``(fg, bg)`` contendo as cores do par de cores solicitado. O valor de *pair_number* deve estar entre ``0`` e ``COLOR_PAIRS - 1``.

source: Return the number of the color-pair set by the attribute value *attr*. :func:`color_pair` is the counterpart to this function.
es_es: Devuelve el número del par de colores establecido por el valor del atributo *attr*. :func:`color_pair` es la contrapartida de esta función.
pt_pt: Devolve o número do par de cores definido pelo valor do atributo *attr*. :func:`color_pair` é a contraparte desta função.

source: Equivalent to ``tputs(str, 1, putchar)``; emit the value of a specified terminfo capability for the current terminal. Note that the output of :func:`putp` always goes to standard output.
es_es: Equivale a ``tputs(str, 1, putchar)``; emite el valor de una capacidad terminfo especificada para el terminal actual. Tenga en cuenta que la salida de :func:`putp` siempre va a la salida estándar.
pt_pt: Equivalente a ``tputs(str, 1, putchar)``; emite o valor de uma capacidade terminfo especificada para o terminal atual. Note que a saída de :func:`putp` vai sempre para a saída padrão.

source: If *flag* is ``False``, the effect is the same as calling :func:`noqiflush`. If *flag* is ``True``, or no argument is provided, the queues will be flushed when these control characters are read.
es_es: Si *flag* es ``False``, el efecto es el mismo que llamar a :func:`noqiflush`. Si *flag* es ``True``, o no se proporciona ningún argumento, las colas se vaciarán cuando se lean estos caracteres de control.
pt_pt: Se *flag* for ``False``, o efeito é o mesmo que chamar :func:`noqiflush`. Se *flag* for ``True``, ou se nenhum argumento for fornecido, as filas serão limpas quando estes caracteres de controlo forem lidos.

source: Enter raw mode. In raw mode, normal line buffering and processing of interrupt, quit, suspend, and flow control keys are turned off; characters are presented to curses input functions one by one.
es_es: Entrar en modo raw. En el modo raw, el almacenamiento en búfer de la línea normal y el procesamiento de las teclas de interrupción, salida, suspensión y control de flujo están desactivados; los caracteres se presentan a las funciones de entrada curses uno a uno.
pt_pt: Ativa o modo raw. No modo raw, o buffer de linha normal e o processamento das teclas de interrupção, saída, suspensão e controlo de fluxo são desativados; os caracteres são apresentados às funções de entrada curses um a um.

source: Restore the terminal to "program" mode, as previously saved by :func:`def_prog_mode`.
es_es: Restablecer el terminal al modo "program", tal y como se guardó anteriormente mediante :func:`def_prog_mode`.
pt_pt: Restaura o terminal para o modo "programa", como guardado anteriormente por :func:`def_prog_mode`.

source: Restore the terminal to "shell" mode, as previously saved by :func:`def_shell_mode`.
es_es: Restaura el terminal al modo "shell", tal y como se guardó previamente en :func:`def_shell_mode`.
pt_pt: Restaura o terminal para o modo "shell", como guardado anteriormente por :func:`def_shell_mode`.

source: Restore the state of the terminal modes to what it was at the last call to :func:`savetty`.
es_es: Restaura el estado de los modos del terminal al que tenían en la última llamada a :func:`savetty`.
pt_pt: Restaura o estado dos modos do terminal para o que era na última chamada a :func:`savetty`.
