Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/curses.po
Languages: es_es, pt_pt

source: Remove attribute *attr* from the "background" set applied to all writes to the current window.
es_es: Elimina el atributo *attr* del conjunto "background" aplicado a todas las escrituras en la ventana actual.
pt_pt: Remove o atributo *attr* do conjunto de "fundo" aplicado a todas as escritas na janela atual.

source: Add attribute *attr* to the "background" set applied to all writes to the current window.
pt_pt: Adiciona o atributo *attr* ao conjunto de "fundo" aplicado a todas as escritas na janela atual.

source: Set the "background" set of attributes to *attr*. This set is initially ``0`` (no attributes).
es_es: Establece el conjunto de atributos "background" en *attr*. Este conjunto es inicialmente ``0`` (sin atributos).
pt_pt: Define o conjunto de atributos de "fundo" para *attr*. Este conjunto é inicialmente ``0`` (sem atributos).

source: Set the background property of the window to the character *ch*, with attributes *attr*. The change is then applied to every character position in that window:
es_es: Establece la propiedad background de la ventana al carácter *ch*, con atributos *attr*. El cambio se aplica entonces a cada posición de carácter en esa ventana:
pt_pt: Define a propriedade de fundo da janela para o caractere *ch*, com os atributos *attr*. A alteração é então aplicada a cada posição de caractere nessa janela:

source: The attribute of every character in the window is changed to the new background attribute.
es_es: El atributo de cada carácter de la ventana se cambia al nuevo atributo de fondo.
pt_pt: O atributo de cada caractere na janela é alterado para o novo atributo de fundo.

source: Wherever the former background character appears, it is changed to the new background character.
es_es: Dondequiera que aparezca el antiguo personaje de fondo, se cambia por el nuevo personaje de fondo.
pt_pt: Onde quer que o antigo caractere de fundo apareça, é alterado para o novo caractere de fundo.

source: Set the window's background. A window's background consists of a character and any combination of attributes. The attribute part of the background is combined (OR'ed) with all non-blank characters that are written into the window. Both the character and attribute parts of the background are combined with the blank characters. The background becomes a property of the character and moves with the character through any scrolling and insert/delete line/character operations.
es_es: Establece el fondo de la ventana. El fondo de una ventana consiste en un carácter y cualquier combinación de atributos. La parte de atributos del fondo se combina (OR'ed) con todos los caracteres no vacíos que se escriben en la ventana. Tanto la parte de carácter como la parte de atributo del fondo se combinan con los caracteres en blanco. El fondo se convierte en una propiedad del carácter y se desplaza con él a través de las operaciones de desplazamiento e inserción/eliminación de líneas/caracteres.
pt_pt: Define o fundo da janela. O fundo de uma janela consiste num caractere e qualquer combinação de atributos. A parte de atributo do fundo é combinada (OR) com todos os caracteres não em branco que são escritos na janela. Tanto a parte de caractere como a de atributo do fundo são combinadas com os caracteres em branco. O fundo torna-se uma propriedade do caractere e move-se com o caractere através de quaisquer operações de deslocamento e inserção/eliminação de linha/caractere.

source: Draw a border around the edges of the window. Each parameter specifies the character to use for a specific part of the border; see the table below for more details.
es_es: Dibuja un borde alrededor de los bordes de la ventana. Cada parámetro especifica el carácter a utilizar para una parte específica del borde; véase la tabla siguiente para más detalles.
pt_pt: Desenha uma borda em torno das bordas da janela. Cada parâmetro especifica o caractere a usar para uma parte específica da borda; consulte a tabela abaixo para mais detalhes.

source: A ``0`` value for any parameter will cause the default character to be used for that parameter. Keyword parameters can *not* be used. The defaults are listed in this table:
es_es: Un valor ``0`` para cualquier parámetro hará que se utilice el carácter por defecto para ese parámetro. Los parámetros de palabra clave *no* pueden utilizarse. Los valores por defecto se enumeran en esta tabla:
pt_pt: Um valor ``0`` para qualquer parâmetro fará com que o caractere predefinido seja usado para esse parâmetro. Não podem ser usados parâmetros nomeados. Os valores predefinidos estão listados nesta tabela:

source: Parameter
es_es: Parámetro
pt_pt: Parâmetro

source: Description
pt_pt: Descrição

source: Default value
es_es: Valor por defecto
pt_pt: Valor predefinido

source: Left side
es_es: Lado izquierdo
pt_pt: Lado esquerdo

source: Right side
es_es: Lado derecho
pt_pt: Lado direito

source: Top
pt_pt: Topo

source: Bottom
es_es: Fondo
pt_pt: Base

source: Upper-left corner
es_es: Esquina superior izquierda
pt_pt: Canto superior esquerdo

source: Upper-right corner
es_es: Esquina superior derecha
pt_pt: Canto superior direito

source: Bottom-left corner
es_es: Esquina inferior izquierda
pt_pt: Canto inferior esquerdo

source: Bottom-right corner
es_es: Esquina inferior derecha
pt_pt: Canto inferior direito

source: Similar to :meth:`border`, but both *ls* and *rs* are *vertch* and both *ts* and *bs* are *horch*. The default corner characters are always used by this function.
es_es: Similar a :meth:`border`, pero tanto *ls* como *rs* son *vertch* y tanto *ts* como *bs* son *horch*. Esta función utiliza siempre los caracteres de esquina predeterminados.
pt_pt: Semelhante a :meth:`border`, mas tanto *ls* como *rs* são *vertch* e tanto *ts* como *bs* são *horch*. Os caracteres de canto predefinidos são sempre usados por esta função.

source: Set the attributes of *num* characters at the current cursor position, or at position ``(y, x)`` if supplied. If *num* is not given or is ``-1``, the attribute will be set on all the characters to the end of the line. This function moves cursor to position ``(y, x)`` if supplied. The changed line will be touched using the :meth:`touchline` method so that the contents will be redisplayed by the next window refresh.
es_es: Establece los atributos de *num* caracteres en la posición actual del cursor, o en la posición ``(y, x)`` si se proporciona. Si *num* no se proporciona o es ``-1``, el atributo se establecerá en todos los caracteres hasta el final de la línea. Esta función mueve el cursor a la posición ``(y, x)`` si se proporciona. La línea modificada se tocará utilizando el método :meth:`touchline` para que el contenido se vuelva a mostrar en la siguiente actualización de la ventana.
pt_pt: Define os atributos de *num* caracteres na posição atual do cursor, ou na posição ``(y, x)`` se fornecida. Se *num* não for fornecido ou for ``-1``, o atributo será definido em todos os caracteres até ao final da linha. Esta função move o cursor para a posição ``(y, x)`` se fornecida. A linha alterada será marcada usando o método :meth:`touchline` para que o conteúdo seja reexibido na próxima atualização da janela.

source: Like :meth:`erase`, but also cause the whole window to be repainted upon next call to :meth:`refresh`.
es_es: Como :meth:`erase`, pero también hace que se vuelva a pintar toda la ventana en la siguiente llamada a :meth:`refresh`.
pt_pt: Semelhante a :meth:`erase`, mas também faz com que toda a janela seja repintada na próxima chamada a :meth:`refresh`.

source: If *flag* is ``True``, the next call to :meth:`refresh` will clear the window completely.
es_es: Si *flag* es ``True``, la siguiente llamada a :meth:`refresh` borrará la ventana completamente.
pt_pt: Se *flag* for ``True``, a próxima chamada a :meth:`refresh` limpará completamente a janela.

source: Erase from cursor to the end of the window: all lines below the cursor are deleted, and then the equivalent of :meth:`clrtoeol` is performed.
es_es: Borrar desde el cursor hasta el final de la ventana: se borran todas las líneas por debajo del cursor y, a continuación, se realiza el equivalente de :meth:`clrtoeol`.
pt_pt: Apaga do cursor até ao final da janela: todas as linhas abaixo do cursor são eliminadas, e depois é executado o equivalente a :meth:`clrtoeol`.

source: Erase from cursor to the end of the line.
es_es: Borrar desde el cursor hasta el final de la línea.
pt_pt: Apaga do cursor até ao final da linha.

source: Update the current cursor position of all the ancestors of the window to reflect the current cursor position of the window.
es_es: Actualiza la posición actual del cursor de todos los ancestros de la ventana para reflejar la posición actual del cursor de la ventana.
pt_pt: Atualiza a posição atual do cursor de todos os ancestrais da janela para refletir a posição atual do cursor da janela.

source: Delete any character at ``(y, x)``.
es_es: Borre cualquier carácter en ``(y, x)``.
pt_pt: Apaga qualquer caractere em ``(y, x)``.

source: Delete the line under the cursor. All following lines are moved up by one line.
es_es: Borra la línea situada bajo el cursor. Todas las líneas siguientes se desplazan una línea hacia arriba.
pt_pt: Apaga a linha sob o cursor. Todas as linhas seguintes são movidas uma linha para cima.

source: An abbreviation for "derive window", :meth:`derwin` is the same as calling :meth:`subwin`, except that *begin_y* and *begin_x* are relative to the origin of the window, rather than relative to the entire screen. Return a window object for the derived window.
es_es: Abreviatura de "derivar ventana", :meth:`derwin` es lo mismo que llamar a :meth:`subwin`, salvo que *begin_y* y *begin_x* son relativos al origen de la ventana, en lugar de relativos a toda la pantalla. Devuelve un objeto ventana para la ventana derivada.
pt_pt: Abreviatura de "derivar janela", :meth:`derwin` é o mesmo que chamar :meth:`subwin`, exceto que *begin_y* e *begin_x* são relativos à origem da janela, em vez de serem relativos a todo o ecrã. Devolve um objeto de janela para a janela derivada.

source: Add character *ch* with attribute *attr*, and immediately call :meth:`refresh` on the window.
es_es: Añade el carácter *ch* con el atributo *attr*, e inmediatamente llama a :meth:`refresh` en la ventana.
pt_pt: Adiciona o caractere *ch* com o atributo *attr* e chama imediatamente :meth:`refresh` na janela.

source: Test whether the given pair of screen-relative character-cell coordinates are enclosed by the given window, returning ``True`` or ``False``. It is useful for determining what subset of the screen windows enclose the location of a mouse event.
es_es: Comprueba si el par dado de coordenadas de celda-carácter relativas a la pantalla están encerradas por la ventana dada, devolviendo ``True`` o ``False``. Es útil para determinar qué subconjunto de ventanas de pantalla encierran la ubicación de un evento de ratón.
pt_pt: Testa se o par de coordenadas de células de caracteres relativas ao ecrã está contido na janela dada, devolvendo ``True`` ou ``False``. É útil para determinar que subconjunto das janelas do ecrã contém a localização de um evento do rato.

source: Previously it returned ``1`` or ``0`` instead of ``True`` or ``False``.
es_es: Antes devolvía ``1`` o ``0`` en lugar de ``True`` o ``False``.
pt_pt: Anteriormente devolvia ``1`` ou ``0`` em vez de ``True`` ou ``False``.

source: Encoding used to encode method arguments (Unicode strings and characters). The encoding attribute is inherited from the parent window when a subwindow is created, for example with :meth:`window.subwin`. By default, current locale encoding is used (see :func:`locale.getencoding`).
es_es: Codificación utilizada para codificar los argumentos del método (cadenas y caracteres Unicode). El atributo encoding se hereda de la ventana padre cuando se crea una subventana, por ejemplo con :meth:`window.subwin`. Por defecto, se utiliza la codificación de la configuración regional actual (véase :func:`locale.getencoding`).
pt_pt: Codificação usada para codificar argumentos do método (strings Unicode e caracteres). O atributo de codificação é herdado da janela pai quando uma subjanela é criada, por exemplo, com :meth:`window.subwin`. Por predefinição, é usada a codificação da localização atual (ver :func:`locale.getencoding`).

source: Clear the window.
es_es: Despeja la ventana.
pt_pt: Limpa a janela.

source: Return a tuple ``(y, x)`` of coordinates of upper-left corner.
es_es: Devuelve una tupla ``(y, x)`` de coordenadas de la esquina superior izquierda.
pt_pt: Devolve um tuplo ``(y, x)`` com as coordenadas do canto superior esquerdo.

source: Return the given window's current background character/attribute pair.
es_es: Devuelve el par carácter/atributo de fondo actual de la ventana dada.
pt_pt: Devolve o par de caractere/atributo de fundo atual da janela fornecida.

source: Get a character. Note that the integer returned does *not* have to be in ASCII range: function keys, keypad keys and so on are represented by numbers higher than 255. In no-delay mode, return ``-1`` if there is no input, otherwise wait until a key is pressed.
es_es: Obtener un carácter. Tenga en cuenta que el entero devuelto *no* tiene que estar en el rango ASCII: las teclas de función, las teclas del teclado y demás se representan con números superiores a 255. En modo sin retardo, devuelve ``-1`` si no hay entrada, en caso contrario espera hasta que se pulse una tecla.
pt_pt: Obtém um caractere. Note que o inteiro devolvido *não* tem de estar na gama ASCII: teclas de função, teclas do teclado numérico, etc., são representadas por números superiores a 255. No modo sem atraso, devolve ``-1`` se não houver entrada, caso contrário, espera até que uma tecla seja pressionada.

source: Get a wide character. Return a character for most keys, or an integer for function keys, keypad keys, and other special keys. In no-delay mode, raise an exception if there is no input.
es_es: Obtener un carácter ancho. Devuelve un carácter para la mayoría de las teclas, o un entero para las teclas de función, las teclas del teclado y otras teclas especiales. En modo sin retardo, lanza una excepción si no hay entrada.
pt_pt: Obtém um caractere largo. Devolve um caractere para a maioria das teclas, ou um inteiro para teclas de função, teclas do teclado numérico e outras teclas especiais. No modo sem atraso, lança uma exceção se não houver entrada.

source: Get a character, returning a string instead of an integer, as :meth:`getch` does. Function keys, keypad keys and other special keys return a multibyte string containing the key name. In no-delay mode, raise an exception if there is no input.
es_es: Obtiene un carácter, devolviendo una cadena en lugar de un entero, como hace :meth:`getch`. Las teclas de función, teclado y otras teclas especiales devuelven una cadena multibyte que contiene el nombre de la tecla. En modo sin retardo, lanza una excepción si no hay entrada.
pt_pt: Obtém um caractere, devolvendo uma string em vez de um inteiro, como faz :meth:`getch`. Teclas de função, teclas do teclado numérico e outras teclas especiais devolvem uma string multibyte contendo o nome da tecla. No modo sem atraso, lança uma exceção se não houver entrada.

source: Return a tuple ``(y, x)`` of the height and width of the window.
es_es: Devuelve una tupla ``(y, x)`` de la altura y la anchura de la ventana.
pt_pt: Devolve um tuplo ``(y, x)`` com a altura e largura da janela.

source: Return the beginning coordinates of this window relative to its parent window as a tuple ``(y, x)``. Return ``(-1, -1)`` if this window has no parent.
es_es: Devuelve las coordenadas iniciales de esta ventana respecto a su ventana padre como una tupla ``(y, x)``. Devuelve ``(-1, -1)`` si esta ventana no tiene padre.
pt_pt: Devolve as coordenadas de início desta janela relativas à sua janela pai como um tuplo ``(y, x)``. Devolve ``(-1, -1)`` se esta janela não tiver pai.

source: Return a tuple ``(y, x)`` of current cursor position relative to the window's upper-left corner.
es_es: Devuelve una tupla ``(y, x)`` de la posición actual del cursor relativa a la esquina superior izquierda de la ventana.
pt_pt: Devolve um tuplo ``(y, x)`` com a posição atual do cursor relativa ao canto superior esquerdo da janela.

source: Display a horizontal line starting at ``(y, x)`` with length *n* consisting of the character *ch*.
es_es: Muestra una línea horizontal que comienza en ``(y, x)`` con una longitud *n* formada por el carácter *ch*.
pt_pt: Exibe uma linha horizontal a começar em ``(y, x)`` com comprimento *n* composta pelo caractere *ch*.

source: If *flag* is ``False``, curses no longer considers using the hardware insert/delete character feature of the terminal; if *flag* is ``True``, use of character insertion and deletion is enabled. When curses is first initialized, use of character insert/delete is enabled by default.
es_es: Si *flag* es ``False``, curses ya no considera el uso de la característica hardware de inserción/borrado de caracteres del terminal; si *flag* es ``True``, se habilita el uso de inserción y borrado de caracteres. Cuando curses se inicializa por primera vez, el uso de inserción/borrado de caracteres está habilitado por defecto.
pt_pt: Se *flag* for ``False``, curses deixa de considerar o uso da funcionalidade de inserção/apagar caracteres do hardware do terminal; se *flag* for ``True``, o uso de inserção e eliminação de caracteres é ativado. Quando curses é inicializado pela primeira vez, o uso de inserção/eliminação de caracteres está ativado por predefinição.

source: If *flag* is ``True``, :mod:`curses` will try and use hardware line editing facilities. Otherwise, line insertion/deletion are disabled.
es_es: Si *flag* es ``True``, :mod:`curses` intentará utilizar las facilidades de edición de línea del hardware. En caso contrario, la inserción/eliminación de líneas estará deshabilitada.
pt_pt: Se *flag* for ``True``, :mod:`curses` tentará usar as funcionalidades de edição de linha do hardware. Caso contrário, a inserção/eliminação de linhas é desativada.

source: If *flag* is ``True``, any change in the window image automatically causes the window to be refreshed; you no longer have to call :meth:`refresh` yourself. However, it may degrade performance considerably, due to repeated calls to wrefresh. This option is disabled by default.
es_es: Si *flag* es ``True``, cualquier cambio en la imagen de la ventana hace que ésta se actualice automáticamente; ya no tiene que llamar usted mismo a :meth:`refresh`. Sin embargo, puede degradar el rendimiento considerablemente, debido a las repetidas llamadas a wrefresh. Esta opción está desactivada por defecto.
pt_pt: Se *flag* for ``True``, qualquer alteração na imagem da janela faz com que a janela seja automaticamente atualizada; já não é necessário chamar :meth:`refresh` manualmente. No entanto, pode degradar consideravelmente o desempenho, devido a chamadas repetidas a wrefresh. Esta opção está desativada por predefinição.

source: Return the character at the given position in the window. The bottom 8 bits are the character proper, and upper bits are the attributes.
es_es: Devuelve el carácter en la posición dada en la ventana. Los 8 bits inferiores son el carácter propiamente dicho, y los bits superiores son los atributos.
pt_pt: Devolve o caractere na posição dada na janela. Os 8 bits inferiores são o próprio caractere, e os bits superiores são os atributos.

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, moving the line from position *x* right by one character.
es_es: Pinta el carácter *ch* en ``(y, x)`` con los atributos *attr*, moviendo la línea desde la posición *x* a la derecha un carácter.
pt_pt: Desenha o caractere *ch* em ``(y, x)`` com os atributos *attr*, movendo a linha a partir da posição *x* uma posição para a direita.

source: Insert *nlines* lines into the specified window above the current line. The *nlines* bottom lines are lost. For negative *nlines*, delete *nlines* lines starting with the one under the cursor, and move the remaining lines up. The bottom *nlines* lines are cleared. The current cursor position remains the same.
es_es: Inserta *nlines* líneas en la ventana especificada por encima de la línea actual. Las *nlines* inferiores se pierden. Para *nlines* negativas, borrar *nlines* líneas empezando por la que está bajo el cursor, y mover las líneas restantes hacia arriba. Las líneas *nlines* inferiores se borran. La posición actual del cursor permanece igual.
pt_pt: Insere *nlines* linhas na janela especificada acima da linha atual. As *nlines* linhas inferiores são perdidas. Para *nlines* negativo, apaga *nlines* linhas a começar pela linha sob o cursor, e move as linhas restantes para cima. As *nlines* linhas inferiores são limpas. A posição atual do cursor permanece a mesma.

source: Insert a blank line under the cursor. All following lines are moved down by one line.
es_es: Inserta una línea en blanco bajo el cursor. Todas las líneas siguientes se desplazan una línea hacia abajo.
pt_pt: Insere uma linha em branco sob o cursor. Todas as linhas seguintes são movidas uma linha para baixo.

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor, up to *n* characters. If *n* is zero or negative, the entire string is inserted. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
es_es: Inserta una cadena de caracteres (tantos caracteres como quepan en la línea) antes del carácter situado bajo el cursor, hasta *n* caracteres. Si *n* es cero o negativo, se inserta toda la cadena. Todos los caracteres situados a la derecha del cursor se desplazan hacia la derecha, perdiéndose los caracteres situados más a la derecha de la línea. La posición del cursor no cambia (después de desplazarse a *y*, *x*, si se especifica).
pt_pt: Insere uma string de caracteres (tantos caracteres quantos couberem na linha) antes do caractere sob o cursor, até *n* caracteres. Se *n* for zero ou negativo, toda a string é inserida. Todos os caracteres à direita do cursor são deslocados para a direita, com os caracteres mais à direita na linha a serem perdidos. A posição do cursor não muda (após mover para *y*, *x*, se especificado).

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
es_es: Inserta una cadena de caracteres (tantos como quepan en la línea) antes del carácter situado bajo el cursor. Todos los caracteres situados a la derecha del cursor se desplazan hacia la derecha, perdiéndose los caracteres situados más a la derecha de la línea. La posición del cursor no cambia (después de desplazarse a *y*, *x*, si se especifica).
pt_pt: Insere uma string de caracteres (tantos caracteres quantos couberem na linha) antes do caractere sob o cursor. Todos os caracteres à direita do cursor são deslocados para a direita, com os caracteres mais à direita na linha a serem perdidos. A posição do cursor não muda (após mover para *y*, *x*, se especificado).
