Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: The default value is ``True``. If Python is :option:`configured using the --without-decimal-contextvar option <--without-decimal-contextvar>`, the C version uses a thread-local rather than a coroutine-local context and the value is ``False``. This is slightly faster in some nested context scenarios.
pt_pt: O valor predefinido é ``True``. Se o Python for :option:`configurado usando a opção --without-decimal-contextvar <--without-decimal-contextvar>`, a versão C usa um contexto local à thread em vez de um contexto local à corrotina e o valor é ``False``. Isto é ligeiramente mais rápido em alguns cenários de contexto aninhado.
ru: Значение по умолчанию — ``True``. Если Python :option:`настроен с использованием опции --without-decimal-contextvar <--without-decimal-contextvar>`, версия C использует локальный контекст потока, а не локальный контекст сопрограммы, и значение равно `` Ложь``. В некоторых сценариях с вложенным контекстом это происходит немного быстрее.

source: Rounding modes
pt_pt: Modos de arredondamento
ru: Режимы округления

source: Round towards ``Infinity``.
pt_pt: Arredonda para ``Infinity``.
ru: Округление в сторону «Бесконечности».

source: Round towards zero.
pt_pt: Arredonda para zero.
ru: Округляем в сторону нуля.

source: Round towards ``-Infinity``.
pt_pt: Arredonda para ``-Infinity``.
ru: Округление в сторону ``-Бесконечности``.

source: Round to nearest with ties going towards zero.
pt_pt: Arredonda para o mais próximo com empates a irem para zero.
ru: Округляем до ближайшего значения, при этом связи стремятся к нулю.

source: Round to nearest with ties going to nearest even integer.
pt_pt: Arredonda para o mais próximo com empates a irem para o inteiro par mais próximo.
ru: Округляем до ближайшего, при этом связи идут к ближайшему четному целому числу.

source: Round to nearest with ties going away from zero.
pt_pt: Arredonda para o mais próximo com empates a irem para longe de zero.
ru: Округляем до ближайшего значения, отсчитывая от нуля.

source: Round away from zero.
pt_pt: Arredonda para longe de zero.
ru: Округляем от нуля.

source: Round away from zero if last digit after rounding towards zero would have been 0 or 5; otherwise round towards zero.
pt_pt: Arredonda para longe de zero se o último dígito após o arredondamento para zero fosse 0 ou 5; caso contrário, arredonda para zero.
ru: Округлите в сторону от нуля, если последняя цифра после округления в сторону нуля была бы 0 или 5; в противном случае округлите до нуля.

source: Signals
pt_pt: Sinais
ru: Сигналы

source: Signals represent conditions that arise during computation. Each corresponds to one context flag and one context trap enabler.
pt_pt: Os sinais representam condições que surgem durante a computação. Cada um corresponde a uma flag de contexto e a um ativador de armadilha de contexto.
ru: Сигналы представляют собой условия, возникающие во время вычислений. Каждый соответствует одному флагу контекста и одному активатору контекстной ловушки.

source: The context flag is set whenever the condition is encountered. After the computation, flags may be checked for informational purposes (for instance, to determine whether a computation was exact). After checking the flags, be sure to clear all flags before starting the next computation.
pt_pt: A flag de contexto é definida sempre que a condição é encontrada. Após a computação, as flags podem ser verificadas para fins informativos (por exemplo, para determinar se uma computação foi exata). Após verificar as flags, certifique-se de limpar todas as flags antes de iniciar a próxima computação.
ru: Флаг контекста устанавливается всякий раз, когда встречается условие. После вычисления флаги могут быть проверены в информационных целях (например, чтобы определить, было ли вычисление точным). После проверки флагов обязательно очистите все флаги перед началом следующего вычисления.

source: If the context's trap enabler is set for the signal, then the condition causes a Python exception to be raised. For example, if the :class:`DivisionByZero` trap is set, then a :exc:`DivisionByZero` exception is raised upon encountering the condition.
pt_pt: Se o ativador de armadilha do contexto estiver definido para o sinal, então a condição faz com que uma exceção Python seja levantada. Por exemplo, se a armadilha :class:`DivisionByZero` estiver definida, então uma exceção :exc:`DivisionByZero` é levantada ao encontrar a condição.
ru: Если для сигнала установлен активатор ловушки контекста, то условие вызывает возникновение исключения Python. Например, если установлена ​​ловушка :class:`DivisionByZero`, то при обнаружении условия возникает исключение :exc:`DivisionByZero`.

source: Altered an exponent to fit representation constraints.
pt_pt: Alterou um expoente para se ajustar às restrições de representação.
ru: Изменен показатель степени, чтобы он соответствовал ограничениям представления.

source: Typically, clamping occurs when an exponent falls outside the context's :attr:`~Context.Emin` and :attr:`~Context.Emax` limits. If possible, the exponent is reduced to fit by adding zeros to the coefficient.
pt_pt: Tipicamente, o clamping ocorre quando um expoente cai fora dos limites :attr:`~Context.Emin` e :attr:`~Context.Emax` do contexto. Se possível, o expoente é reduzido para se ajustar, adicionando zeros ao coeficiente.
ru: Обычно ограничение происходит, когда экспонента выходит за пределы контекста :attr:`~Context.Emin` и :attr:`~Context.Emax`. Если возможно, показатель степени уменьшается до соответствия путем добавления нулей к коэффициенту.

source: Base class for other signals and a subclass of :exc:`ArithmeticError`.
pt_pt: Classe base para outros sinais e uma subclasse de :exc:`ArithmeticError`.
ru: Базовый класс для других сигналов и подкласс :exc:`ArithmeticError`.

source: Signals the division of a non-infinite number by zero.
pt_pt: Sinaliza a divisão de um número não infinito por zero.
ru: Сигнализирует о делении небесконечного числа на ноль.

source: Can occur with division, modulo division, or when raising a number to a negative power. If this signal is not trapped, returns ``Infinity`` or ``-Infinity`` with the sign determined by the inputs to the calculation.
pt_pt: Pode ocorrer com divisão, divisão módulo, ou ao elevar um número a uma potência negativa. Se este sinal não for capturado, retorna ``Infinity`` ou ``-Infinity`` com o sinal determinado pelas entradas do cálculo.
ru: Может произойти при делении, делении по модулю или при возведении числа в отрицательную степень. Если этот сигнал не перехвачен, возвращается ``Бесконечность`` или ``-Бесконечность`` со знаком, определяемым входными данными для расчета.

source: Indicates that rounding occurred and the result is not exact.
pt_pt: Indica que ocorreu arredondamento e o resultado não é exato.
ru: Указывает, что произошло округление и результат неточный.

source: Signals when non-zero digits were discarded during rounding. The rounded result is returned. The signal flag or trap is used to detect when results are inexact.
pt_pt: Sinaliza quando dígitos não-zero foram descartados durante o arredondamento. O resultado arredondado é retornado. A flag de sinal ou armadilha é usada para detetar quando os resultados são inexatos.
ru: Сигналы, когда ненулевые цифры были отброшены во время округления. Возвращается округленный результат. Сигнальный флаг или ловушка используются для обнаружения неточных результатов.

source: An invalid operation was performed.
pt_pt: Foi realizada uma operação inválida.
ru: Была выполнена недопустимая операция.

source: Indicates that an operation was requested that does not make sense. If not trapped, returns ``NaN``. Possible causes include::
pt_pt: Indica que foi solicitada uma operação que não faz sentido. Se não for capturado, retorna ``NaN``. Possíveis causas incluem::
ru: Указывает, что была запрошена операция, которая не имеет смысла. Если не перехвачен, возвращает ``NaN``. Возможные причины включают в себя:

source: Infinity - Infinity 0 * Infinity Infinity / Infinity x % 0 Infinity % x sqrt(-x) and x > 0 0 ** 0 x ** (non-integer) x ** Infinity
pt_pt: Infinity - Infinity 0 * Infinity Infinity / Infinity x % 0 Infinity % x sqrt(-x) e x > 0 0 ** 0 x ** (não-inteiro) x ** Infinity

source: Numerical overflow.
pt_pt: Overflow numérico.
ru: Числовое переполнение.

source: Indicates the exponent is larger than :attr:`Context.Emax` after rounding has occurred. If not trapped, the result depends on the rounding mode, either pulling inward to the largest representable finite number or rounding outward to ``Infinity``. In either case, :class:`Inexact` and :class:`Rounded` are also signaled.
pt_pt: Indica que o expoente é maior que :attr:`Context.Emax` após o arredondamento ter ocorrido. Se não for capturado, o resultado depende do modo de arredondamento, puxando para dentro para o maior número finito representável ou arredondando para fora para ``Infinity``. Em qualquer caso, :class:`Inexact` e :class:`Rounded` também são sinalizados.
ru: Указывает, что показатель степени больше :attr:`Context.Emax` после того, как произошло округление. Если не захвачено, результат зависит от режима округления: либо вытягивание внутрь до наибольшего представимого конечного числа, либо округление наружу до «Бесконечности». В любом случае также сигнализируются :class:`Inexact` и :class:`Rounded`.

source: Rounding occurred though possibly no information was lost.
pt_pt: Ocorreu arredondamento, embora possivelmente nenhuma informação tenha sido perdida.
ru: Произошло округление, хотя, возможно, никакая информация не была потеряна.

source: Signaled whenever rounding discards digits; even if those digits are zero (such as rounding ``5.00`` to ``5.0``). If not trapped, returns the result unchanged. This signal is used to detect loss of significant digits.
pt_pt: Sinalizado sempre que o arredondamento descarta dígitos; mesmo que esses dígitos sejam zero (como arredondar ``5.00`` para ``5.0``). Se não for capturado, retorna o resultado inalterado. Este sinal é usado para detetar a perda de dígitos significativos.
ru: Сигнализируется всякий раз, когда при округлении отбрасываются цифры; даже если эти цифры равны нулю (например, округление ``5,00`` до ``5,0``). Если не перехвачен, возвращает результат без изменений. Этот сигнал используется для обнаружения потери значащих цифр.

source: Exponent was lower than :attr:`~Context.Emin` prior to rounding.
pt_pt: O expoente era inferior a :attr:`~Context.Emin` antes do arredondamento.
ru: До округления показатель степени был меньше, чем :attr:`~Context.Emin`.

source: Occurs when an operation result is subnormal (the exponent is too small). If not trapped, returns the result unchanged.
pt_pt: Ocorre quando o resultado de uma operação é subnormal (o expoente é demasiado pequeno). Se não for capturado, retorna o resultado inalterado.
ru: Происходит, когда результат операции не соответствует норме (показатель степени слишком мал). Если не перехвачен, возвращает результат без изменений.

source: Numerical underflow with result rounded to zero.
pt_pt: Underflow numérico com resultado arredondado para zero.
ru: Числовое переполнение, результат округляется до нуля.

source: Enable stricter semantics for mixing floats and Decimals.
pt_pt: Ativar semântica mais rigorosa para misturar floats e Decimals.
ru: Включите более строгую семантику для смешивания чисел с плавающей запятой и десятичных дробей.

source: If the signal is not trapped (default), mixing floats and Decimals is permitted in the :class:`~decimal.Decimal` constructor, :meth:`~decimal.Context.create_decimal` and all comparison operators. Both conversion and comparisons are exact. Any occurrence of a mixed operation is silently recorded by setting :exc:`FloatOperation` in the context flags. Explicit conversions with :meth:`~decimal.Decimal.from_float` or :meth:`~decimal.Context.create_decimal_from_float` do not set the flag.
pt_pt: Se o sinal não for capturado (predefinição), misturar floats e Decimals é permitido no construtor :class:`~decimal.Decimal`, :meth:`~decimal.Context.create_decimal` e todos os operadores de comparação. Tanto a conversão como as comparações são exatas. Qualquer ocorrência de uma operação mista é registada silenciosamente definindo :exc:`FloatOperation` nas flags do contexto. Conversões explícitas com :meth:`~decimal.Decimal.from_float` ou :meth:`~decimal.Context.create_decimal_from_float` não definem a flag.
ru: Если сигнал не перехвачен (по умолчанию), смешивание чисел с плавающей запятой и десятичных дробей разрешено в конструкторе :class:`~decimal.Decimal`, :meth:`~decimal.Context.create_decimal` и во всех операторах сравнения. И преобразование, и сравнение точны. Любое возникновение смешанной операции автоматически записывается путем установки :exc:`FloatOperation` в контекстных флагах. Явные преобразования с помощью :meth:`~decimal.Decimal.from_float` или :meth:`~decimal.Context.create_decimal_from_float` не устанавливают флаг.

source: Otherwise (the signal is trapped), only equality comparisons and explicit conversions are silent. All other mixed operations raise :exc:`FloatOperation`.
pt_pt: Caso contrário (o sinal é capturado), apenas as comparações de igualdade e conversões explícitas são silenciosas. Todas as outras operações mistas levantam :exc:`FloatOperation`.
ru: В противном случае (сигнал перехватывается) молчат только сравнения на равенство и явные преобразования. Все остальные смешанные операции вызывают :exc:`FloatOperation`.

source: The following table summarizes the hierarchy of signals::
pt_pt: A tabela seguinte resume a hierarquia de sinais::
ru: В следующей таблице представлена ​​иерархия сигналов:

source: Floating-point notes
pt_pt: Notas sobre vírgula flutuante

source: Mitigating round-off error with increased precision
pt_pt: Mitigar erro de arredondamento com maior precisão
ru: Уменьшение ошибки округления за счет повышения точности

source: The use of decimal floating point eliminates decimal representation error (making it possible to represent ``0.1`` exactly); however, some operations can still incur round-off error when non-zero digits exceed the fixed precision.
pt_pt: O uso de vírgula flutuante decimal elimina o erro de representação decimal (tornando possível representar ``0.1`` exatamente); no entanto, algumas operações ainda podem incorrer em erro de arredondamento quando dígitos não-zero excedem a precisão fixa.
ru: Использование десятичной плавающей точки устраняет ошибку десятичного представления (давая возможность точно представить ``0,1``); однако некоторые операции все равно могут вызывать ошибку округления, когда ненулевые цифры превышают фиксированную точность.

source: The effects of round-off error can be amplified by the addition or subtraction of nearly offsetting quantities resulting in loss of significance. Knuth provides two instructive examples where rounded floating-point arithmetic with insufficient precision causes the breakdown of the associative and distributive properties of addition:
pt_pt: Os efeitos do erro de arredondamento podem ser amplificados pela adição ou subtração de quantidades quase compensatórias, resultando em perda de significância. Knuth fornece dois exemplos instrutivos onde a aritmética de vírgula flutuante arredondada com precisão insuficiente causa a quebra das propriedades associativa e distributiva da adição:

source: # Examples from Seminumerical Algorithms, Section 4.2.2. >>> from decimal import Decimal, getcontext >>> getcontext().prec = 8 >>> u, v, w = Decimal(11111113), Decimal(-11111111), Decimal('7.51111111') >>> (u + v) + w Decimal('9.5111111') >>> u + (v + w) Decimal('10') >>> u, v, w = Decimal(20000), Decimal(-6), Decimal('6.0000003') >>> (u*v) + (u*w) Decimal('0.01') >>> u * (v+w) Decimal('0.0060000')
pt_pt: # Exemplos de Seminumerical Algorithms, Secção 4.2.2. >>> from decimal import Decimal, getcontext >>> getcontext().prec = 8 >>> u, v, w = Decimal(11111113), Decimal(-11111111), Decimal('7.51111111') >>> (u + v) + w Decimal('9.5111111') >>> u + (v + w) Decimal('10') >>> u, v, w = Decimal(20000), Decimal(-6), Decimal('6.0000003') >>> (u*v) + (u*w) Decimal('0.01') >>> u * (v+w) Decimal('0.0060000')

source: The :mod:`decimal` module makes it possible to restore the identities by expanding the precision sufficiently to avoid loss of significance:
pt_pt: O módulo :mod:`decimal` torna possível restaurar as identidades expandindo a precisão suficientemente para evitar a perda de significância:
ru: Модуль :mod:`decimal` позволяет восстановить идентичность, достаточно расширив точность, чтобы избежать потери значимости:

source: Special values
pt_pt: Valores especiais
ru: Специальные значения

source: The number system for the :mod:`decimal` module provides special values including ``NaN``, ``sNaN``, ``-Infinity``, ``Infinity``, and two zeros, ``+0`` and ``-0``.
pt_pt: O sistema numérico para o módulo :mod:`decimal` fornece valores especiais, incluindo ``NaN``, ``sNaN``, ``-Infinity``, ``Infinity``, e dois zeros, ``+0`` e ``-0``.
ru: Система счисления для модуля :mod:`decimal` предоставляет специальные значения, включая ``NaN``, ``sNaN``, ``-Infinity``, ``Infinity`` и два нуля, ``+0` ` и ``-0``.

source: Infinities can be constructed directly with: ``Decimal('Infinity')``. Also, they can arise from dividing by zero when the :exc:`DivisionByZero` signal is not trapped. Likewise, when the :exc:`Overflow` signal is not trapped, infinity can result from rounding beyond the limits of the largest representable number.
pt_pt: Os infinitos podem ser construídos diretamente com: ``Decimal('Infinity')``. Também podem surgir da divisão por zero quando o sinal :exc:`DivisionByZero` não é capturado. Da mesma forma, quando o sinal :exc:`Overflow` não é capturado, o infinito pode resultar do arredondamento além dos limites do maior número representável.
ru: Бесконечности можно построить напрямую с помощью: ``Decimal('Infinity')``. Кроме того, они могут возникнуть в результате деления на ноль, если сигнал :exc:`DivisionByZero` не перехвачен. Аналогично, если сигнал :exc:`Overflow` не перехвачен, бесконечность может возникнуть в результате округления за пределами наибольшего представимого числа.

source: The infinities are signed (affine) and can be used in arithmetic operations where they get treated as very large, indeterminate numbers. For instance, adding a constant to infinity gives another infinite result.
pt_pt: Os infinitos são assinados (afins) e podem ser usados em operações aritméticas onde são tratados como números muito grandes e indeterminados. Por exemplo, adicionar uma constante ao infinito dá outro resultado infinito.
ru: Бесконечности имеют знак (аффинные) и могут использоваться в арифметических операциях, где они рассматриваются как очень большие неопределенные числа. Например, добавление константы к бесконечности дает еще один бесконечный результат.

source: Some operations are indeterminate and return ``NaN``, or if the :exc:`InvalidOperation` signal is trapped, raise an exception. For example, ``0/0`` returns ``NaN`` which means "not a number". This variety of ``NaN`` is quiet and, once created, will flow through other computations always resulting in another ``NaN``. This behavior can be useful for a series of computations that occasionally have missing inputs --- it allows the calculation to proceed while flagging specific results as invalid.
pt_pt: Algumas operações são indeterminadas e retornam ``NaN``, ou, se o sinal :exc:`InvalidOperation` for capturado, levantam uma exceção. Por exemplo, ``0/0`` retorna ``NaN``, que significa "não é um número". Esta variedade de ``NaN`` é silenciosa e, uma vez criada, fluirá através de outras computações, resultando sempre em outro ``NaN``. Este comportamento pode ser útil para uma série de computações que ocasionalmente têm entradas em falta — permite que o cálculo prossiga, sinalizando resultados específicos como inválidos.
ru: Некоторые операции являются неопределенными и возвращают ``NaN``, или, если сигнал :exc:`InvalidOperation` перехвачен, вызывают исключение. Например, ``0/0`` возвращает ``NaN``, что означает «не число». Эта разновидность ``NaN`` тиха и после создания будет проходить через другие вычисления, всегда приводящие к другому ``NaN``. Такое поведение может быть полезно для серии вычислений, в которых иногда отсутствуют входные данные — оно позволяет продолжить вычисление, помечая определенные результаты как недействительные.

source: A variant is ``sNaN`` which signals rather than remaining quiet after every operation. This is a useful return value when an invalid result needs to interrupt a calculation for special handling.
pt_pt: Uma variante é ``sNaN``, que sinaliza em vez de permanecer silencioso após cada operação. Este é um valor de retorno útil quando um resultado inválido precisa interromper um cálculo para tratamento especial.
ru: Вариантом является sNaN, который сигнализирует, а не молчит после каждой операции. Это полезное возвращаемое значение, когда недопустимый результат требует прерывания вычислений для специальной обработки.
