Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: Other Unicode decimal digits are also permitted where ``digit`` appears above. These include decimal digits from various other alphabets (for example, Arabic-Indic and Devanāgarī digits) along with the fullwidth digits ``'\uff10'`` through ``'\uff19'``. Case is not significant, so, for example, ``inf``, ``Inf``, ``INFINITY``, and ``iNfINity`` are all acceptable spellings for positive infinity.
pt_pt: Outros dígitos decimais Unicode também são permitidos onde ``digit`` aparece acima. Estes incluem dígitos decimais de vários outros alfabetos (por exemplo, dígitos Árabe-Indic e Devanāgarī) juntamente com os dígitos de largura total ``'\uff10'`` a ``'\uff19'``. A caixa não é significativa, por isso, por exemplo, ``inf``, ``Inf``, ``INFINITY`` e ``iNfINity`` são todas grafias aceitáveis para infinito positivo.

source: If *value* is a :class:`tuple`, it should have three components, a sign (``0`` for positive or ``1`` for negative), a :class:`tuple` of digits, and an integer exponent. For example, ``Decimal((0, (1, 4, 1, 4), -3))`` returns ``Decimal('1.414')``.
pt_pt: Se *value* for um :class:`tuple`, deve ter três componentes, um sinal (``0`` para positivo ou ``1`` para negativo), um :class:`tuple` de dígitos e um expoente inteiro. Por exemplo, ``Decimal((0, (1, 4, 1, 4), -3))`` retorna ``Decimal('1.414')``.
ru: Если *value* представляет собой :class:`tuple`, оно должно состоять из трёх компонентов: знак (``0`` для положительного значения или ``1`` для отрицательного), :class:`tuple` цифр и целочисленный показатель. Например, ``Decimal((0, (1, 4, 1, 4), -3))`` возвращает ``Decimal('1.414')``.

source: If *value* is a :class:`float`, the binary floating-point value is losslessly converted to its exact decimal equivalent. This conversion can often require 53 or more digits of precision. For example, ``Decimal(float('1.1'))`` converts to ``Decimal('1.100000000000000088817841970012523233890533447265625')``.
pt_pt: Se *value* for um :class:`float`, o valor de vírgula flutuante binária é convertido sem perda para o seu equivalente decimal exato. Esta conversão pode frequentemente requerer 53 ou mais dígitos de precisão. Por exemplo, ``Decimal(float('1.1'))`` converte para ``Decimal('1.100000000000000088817841970012523233890533447265625')``.

source: The *context* precision does not affect how many digits are stored. That is determined exclusively by the number of digits in *value*. For example, ``Decimal('3.00000')`` records all five zeros even if the context precision is only three.
pt_pt: A precisão do *context* não afeta quantos dígitos são armazenados. Isso é determinado exclusivamente pelo número de dígitos em *value*. Por exemplo, ``Decimal('3.00000')`` regista todos os cinco zeros mesmo que a precisão do contexto seja apenas três.
ru: Точность *контекста* не влияет на количество сохраняемых цифр. Это определяется исключительно количеством цифр в *значении*. Например, ``Decimal('3.00000')`` записывает все пять нулей, даже если точность контекста равна всего трем.

source: The purpose of the *context* argument is determining what to do if *value* is a malformed string. If the context traps :const:`InvalidOperation`, an exception is raised; otherwise, the constructor returns a new Decimal with the value of ``NaN``.
pt_pt: O propósito do argumento *context* é determinar o que fazer se *value* for uma string malformada. Se o contexto capturar :const:`InvalidOperation`, uma exceção é levantada; caso contrário, o construtor retorna um novo Decimal com o valor de ``NaN``.
ru: Назначение аргумента *context* — определить, что делать, если *value* представляет собой неверную строку. Если контекст перехватывает :const:`InvalidOperation`, возникает исключение; в противном случае конструктор возвращает новое десятичное число со значением NaN.

source: Once constructed, :class:`Decimal` objects are immutable.
pt_pt: Uma vez construídos, os objetos :class:`Decimal` são imutáveis.
ru: После создания объекты :class:`Decimal` становятся неизменяемыми.

source: The argument to the constructor is now permitted to be a :class:`float` instance.
pt_pt: O argumento para o construtor agora pode ser uma instância :class:`float`.
ru: Аргументом конструктора теперь может быть экземпляр :class:`float`.

source: :class:`float` arguments raise an exception if the :exc:`FloatOperation` trap is set. By default the trap is off.
pt_pt: Os argumentos :class:`float` levantam uma exceção se a armadilha :exc:`FloatOperation` estiver definida. Por predefinição, a armadilha está desativada.
ru: Аргументы :class:`float` вызывают исключение, если установлена ​​ловушка :exc:`FloatOperation`. По умолчанию ловушка отключена.

source: Underscores are allowed for grouping, as with integral and floating-point literals in code.
pt_pt: Os sublinhados são permitidos para agrupamento, como com literais inteiros e de vírgula flutuante no código.
ru: Для группировки разрешены подчеркивания, как и в случае целочисленных литералов и литералов с плавающей запятой в коде.

source: Decimal floating-point objects share many properties with the other built-in numeric types such as :class:`float` and :class:`int`. All of the usual math operations and special methods apply. Likewise, decimal objects can be copied, pickled, printed, used as dictionary keys, used as set elements, compared, sorted, and coerced to another type (such as :class:`float` or :class:`int`).
pt_pt: Os objetos de vírgula flutuante decimal partilham muitas propriedades com os outros tipos numéricos integrados, como :class:`float` e :class:`int`. Todas as operações matemáticas habituais e métodos especiais aplicam-se. Da mesma forma, os objetos decimais podem ser copiados, serializados, impressos, usados como chaves de dicionário, usados como elementos de conjunto, comparados, ordenados e convertidos para outro tipo (como :class:`float` ou :class:`int`).

source: There are some small differences between arithmetic on Decimal objects and arithmetic on integers and floats. When the remainder operator ``%`` is applied to Decimal objects, the sign of the result is the sign of the *dividend* rather than the sign of the divisor::
pt_pt: Existem algumas pequenas diferenças entre a aritmética em objetos Decimal e a aritmética em inteiros e floats. Quando o operador de resto ``%`` é aplicado a objetos Decimal, o sinal do resultado é o sinal do *dividendo* em vez do sinal do divisor::
ru: Есть некоторые небольшие различия между арифметикой объектов Decimal и арифметикой целых чисел и чисел с плавающей запятой. Когда оператор остатка ``%`` применяется к десятичным объектам, знаком результата является знак *делимого*, а не знак делителя::

source: The integer division operator ``//`` behaves analogously, returning the integer part of the true quotient (truncating towards zero) rather than its floor, so as to preserve the usual identity ``x == (x // y) * y + x % y``::
pt_pt: O operador de divisão inteira ``//`` comporta-se de forma análoga, retornando a parte inteira do quociente verdadeiro (truncando para zero) em vez do seu piso, de modo a preservar a identidade habitual ``x == (x // y) * y + x % y``::
ru: Оператор целочисленного деления ``//`` ведет себя аналогично, возвращая целую часть истинного частного (усекаясь в сторону нуля), а не его нижнюю часть, чтобы сохранить обычную идентичность ``x == (x // y) * y + x % y``::

source: The ``%`` and ``//`` operators implement the ``remainder`` and ``divide-integer`` operations (respectively) as described in the specification.
pt_pt: Os operadores ``%`` e ``//`` implementam as operações ``remainder`` e ``divide-integer`` (respetivamente) como descrito na especificação.
ru: Операторы ``%`` и ``//`` реализуют операции ``остаток`` и ``деление целого числа`` (соответственно), как описано в спецификации.

source: Decimal objects cannot generally be combined with floats or instances of :class:`fractions.Fraction` in arithmetic operations: an attempt to add a :class:`Decimal` to a :class:`float`, for example, will raise a :exc:`TypeError`. However, it is possible to use Python's comparison operators to compare a :class:`Decimal` instance ``x`` with another number ``y``. This avoids confusing results when doing equality comparisons between numbers of different types.
pt_pt: Os objetos Decimal geralmente não podem ser combinados com floats ou instâncias de :class:`fractions.Fraction` em operações aritméticas: uma tentativa de adicionar um :class:`Decimal` a um :class:`float`, por exemplo, levantará um :exc:`TypeError`. No entanto, é possível usar os operadores de comparação do Python para comparar uma instância :class:`Decimal` ``x`` com outro número ``y``. Isto evita resultados confusos ao fazer comparações de igualdade entre números de tipos diferentes.
ru: Десятичные объекты обычно не могут комбинироваться с числами с плавающей запятой или экземплярами :class:`fractions.Fraction` в арифметических операциях: например, попытка добавить :class:`Decimal` к :class:`float` вызовет : exc:`TypeError`. Однако можно использовать операторы сравнения Python для сравнения экземпляра :class:`Decimal``x`` с другим числом ``y``. Это позволяет избежать путаницы при сравнении чисел разных типов на равенство.

source: Mixed-type comparisons between :class:`Decimal` instances and other numeric types are now fully supported.
pt_pt: As comparações de tipo misto entre instâncias :class:`Decimal` e outros tipos numéricos são agora totalmente suportadas.
ru: Сравнения смешанного типа между экземплярами :class:`Decimal` и другими числовыми типами теперь полностью поддерживаются.

source: In addition to the standard numeric properties, decimal floating-point objects also have a number of specialized methods:
pt_pt: Além das propriedades numéricas padrão, os objetos de vírgula flutuante decimal também têm vários métodos especializados:

source: Return the adjusted exponent after shifting out the coefficient's rightmost digits until only the lead digit remains: ``Decimal('321e+5').adjusted()`` returns seven. Used for determining the position of the most significant digit with respect to the decimal point.
pt_pt: Retorna o expoente ajustado após deslocar os dígitos mais à direita do coeficiente até que apenas o dígito principal permaneça: ``Decimal('321e+5').adjusted()`` retorna sete. Usado para determinar a posição do dígito mais significativo em relação ao ponto decimal.
ru: Возвращает скорректированную экспоненту после смещения крайних правых цифр коэффициента до тех пор, пока не останется только первая цифра: ``Decimal('321e+5').adjusted()`` возвращает семь. Используется для определения положения старшей цифры относительно десятичной точки.

source: Return a pair ``(n, d)`` of integers that represent the given :class:`Decimal` instance as a fraction, in lowest terms and with a positive denominator::
pt_pt: Retorna um par ``(n, d)`` de inteiros que representam a instância :class:`Decimal` dada como uma fração, nos termos mais baixos e com um denominador positivo::
ru: Возвращает пару целых чисел ``(n, d)``, которые представляют данный экземпляр :class:`Decimal` как дробь, в наименьших выражениях и с положительным знаменателем::

source: The conversion is exact. Raise OverflowError on infinities and ValueError on NaNs.
pt_pt: A conversão é exata. Levanta OverflowError em infinitos e ValueError em NaNs.
ru: Преобразование точное. Поднимите OverflowError для бесконечностей и ValueError для NaN.

source: Return a :term:`named tuple` representation of the number: ``DecimalTuple(sign, digits, exponent)``.
pt_pt: Retorna uma representação de :term:`named tuple` do número: ``DecimalTuple(sign, digits, exponent)``.
ru: Возвращает :term:`именованный кортеж`, представляющий число: ``DecimalTuple(знак, цифры, показатель степени)``.

source: Return the canonical encoding of the argument. Currently, the encoding of a :class:`Decimal` instance is always canonical, so this operation returns its argument unchanged.
pt_pt: Retorna a codificação canónica do argumento. Atualmente, a codificação de uma instância :class:`Decimal` é sempre canónica, por isso esta operação retorna o seu argumento inalterado.
ru: Верните каноническую кодировку аргумента. В настоящее время кодировка экземпляра :class:`Decimal` всегда каноническая, поэтому эта операция возвращает аргумент без изменений.

source: Compare the values of two Decimal instances. :meth:`compare` returns a Decimal instance, and if either operand is a NaN then the result is a NaN::
pt_pt: Compara os valores de duas instâncias Decimal. :meth:`compare` retorna uma instância Decimal, e se algum dos operandos for um NaN, então o resultado é um NaN::
ru: Сравните значения двух экземпляров Decimal. :meth:`compare` возвращает экземпляр Decimal, и если любой операнд имеет значение NaN, то результатом будет NaN::

source: a or b is a NaN ==> Decimal('NaN') a < b ==> Decimal('-1') a == b ==> Decimal('0') a > b ==> Decimal('1')
pt_pt: a ou b é um NaN ==> Decimal('NaN') a < b ==> Decimal('-1') a == b ==> Decimal('0') a > b ==> Decimal('1')

source: This operation is identical to the :meth:`compare` method, except that all NaNs signal. That is, if neither operand is a signaling NaN then any quiet NaN operand is treated as though it were a signaling NaN.
pt_pt: Esta operação é idêntica ao método :meth:`compare`, exceto que todos os NaNs sinalizam. Ou seja, se nenhum dos operandos for um NaN de sinalização, então qualquer operando NaN silencioso é tratado como se fosse um NaN de sinalização.
ru: Эта операция идентична методу :meth:`compare`, за исключением того, что все NaN сигнализируют. То есть, если ни один из операндов не является сигнальным NaN, то любой тихий операнд NaN обрабатывается так, как если бы он был сигнальным NaN.

source: Compare two operands using their abstract representation rather than their numerical value. Similar to the :meth:`compare` method, but the result gives a total ordering on :class:`Decimal` instances. Two :class:`Decimal` instances with the same numeric value but different representations compare unequal in this ordering:
pt_pt: Compara dois operandos usando a sua representação abstrata em vez do seu valor numérico. Semelhante ao método :meth:`compare`, mas o resultado dá uma ordenação total em instâncias :class:`Decimal`. Duas instâncias :class:`Decimal` com o mesmo valor numérico, mas representações diferentes, comparam-se como desiguais nesta ordenação:
ru: Сравните два операнда, используя их абстрактное представление, а не числовое значение. Похож на метод :meth:`compare`, но результат дает общий порядок экземпляров :class:`Decimal`. Два экземпляра :class:`Decimal` с одинаковым числовым значением, но разными представлениями сравниваются в неравномерном порядке:

source: Quiet and signaling NaNs are also included in the total ordering. The result of this function is ``Decimal('0')`` if both operands have the same representation, ``Decimal('-1')`` if the first operand is lower in the total order than the second, and ``Decimal('1')`` if the first operand is higher in the total order than the second operand. See the specification for details of the total order.
pt_pt: NaNs silenciosos e de sinalização também estão incluídos na ordenação total. O resultado desta função é ``Decimal('0')`` se ambos os operandos tiverem a mesma representação, ``Decimal('-1')`` se o primeiro operando for inferior na ordem total do que o segundo, e ``Decimal('1')`` se o primeiro operando for superior na ordem total do que o segundo operando. Consulte a especificação para detalhes da ordem total.
ru: Тихие и сигнальные NaN также включены в общий порядок. Результатом этой функции является ``Decimal('0')``, если оба операнда имеют одинаковое представление, ``Decimal('-1')``, если первый операнд в общем порядке ниже второго, и ``Decimal('1')``, если первый операнд в общем порядке выше второго операнда. Подробную информацию об общей сумме заказа см. в спецификации.

source: This operation is unaffected by context and is quiet: no flags are changed and no rounding is performed. As an exception, the C version may raise InvalidOperation if the second operand cannot be converted exactly.
pt_pt: Esta operação não é afetada pelo contexto e é silenciosa: nenhuma flag é alterada e nenhum arredondamento é realizado. Como exceção, a versão C pode levantar InvalidOperation se o segundo operando não puder ser convertido exatamente.
ru: На эту операцию не влияет контекст, и она выполняется тихо: флаги не изменяются и округление не выполняется. В виде исключения версия C может вызвать InvalidOperation, если второй операнд не может быть точно преобразован.

source: Compare two operands using their abstract representation rather than their value as in :meth:`compare_total`, but ignoring the sign of each operand. ``x.compare_total_mag(y)`` is equivalent to ``x.copy_abs().compare_total(y.copy_abs())``.
pt_pt: Compara dois operandos usando a sua representação abstrata em vez do seu valor como em :meth:`compare_total`, mas ignorando o sinal de cada operando. ``x.compare_total_mag(y)`` é equivalente a ``x.copy_abs().compare_total(y.copy_abs())``.
ru: Сравните два операнда, используя их абстрактное представление, а не их значение, как в :meth:`compare_total`, но игнорируя знак каждого операнда. ``x.compare_total_mag(y)`` эквивалентен ``x.copy_abs().compare_total(y.copy_abs())``.

source: Just returns self, this method is only to comply with the Decimal Specification.
pt_pt: Apenas retorna self, este método existe apenas para cumprir a Especificação Decimal.
ru: Просто возвращает себя, этот метод должен соответствовать только десятичной спецификации.

source: Return the absolute value of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
pt_pt: Retorna o valor absoluto do argumento. Esta operação não é afetada pelo contexto e é silenciosa: nenhuma flag é alterada e nenhum arredondamento é realizado.
ru: Возвращает абсолютное значение аргумента. На эту операцию не влияет контекст, и она выполняется тихо: флаги не изменяются и округление не выполняется.

source: Return the negation of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
pt_pt: Retorna a negação do argumento. Esta operação não é afetada pelo contexto e é silenciosa: nenhuma flag é alterada e nenhum arredondamento é realizado.
ru: Вернуть отрицание аргумента. На эту операцию не влияет контекст, и она выполняется тихо: флаги не изменяются и округление не выполняется.

source: Return a copy of the first operand with the sign set to be the same as the sign of the second operand. For example:
pt_pt: Retorna uma cópia do primeiro operando com o sinal definido para ser o mesmo que o sinal do segundo operando. Por exemplo:
ru: Верните копию первого операнда со знаком, совпадающим со знаком второго операнда. Например:

source: Return the value of the (natural) exponential function ``e**x`` at the given number. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
pt_pt: Retorna o valor da função exponencial (natural) ``e**x`` no número dado. O resultado é corretamente arredondado usando o modo de arredondamento :const:`ROUND_HALF_EVEN`.
ru: Возвращает значение (натуральной) экспоненциальной функции ``e**x`` по заданному номеру. Результат правильно округляется с использованием режима округления :const:`ROUND_HALF_EVEN`.

source: Alternative constructor that only accepts instances of :class:`float` or :class:`int`.
pt_pt: Construtor alternativo que aceita apenas instâncias de :class:`float` ou :class:`int`.
ru: Альтернативный конструктор, который принимает только экземпляры :class:`float` или :class:`int`.

source: Note ``Decimal.from_float(0.1)`` is not the same as ``Decimal('0.1')``. Since 0.1 is not exactly representable in binary floating point, the value is stored as the nearest representable value which is ``0x1.999999999999ap-4``. That equivalent value in decimal is ``0.1000000000000000055511151231257827021181583404541015625``.
pt_pt: Note que ``Decimal.from_float(0.1)`` não é o mesmo que ``Decimal('0.1')``. Uma vez que 0.1 não é exatamente representável em vírgula flutuante binária, o valor é armazenado como o valor representável mais próximo que é ``0x1.999999999999ap-4``. Esse valor equivalente em decimal é ``0.1000000000000000055511151231257827021181583404541015625``.
ru: Обратите внимание: ``Decimal.from_float(0.1)`` — это не то же самое, что ``Decimal('0.1')``. Поскольку 0,1 не совсем представимо в двоичном виде с плавающей запятой, значение сохраняется как ближайшее представимое значение, которое равно ``0x1.999999999999ap-4``. Это эквивалентное десятичное значение равно ``0,1000000000000000055511151231257827021181583404541015625``.

source: From Python 3.2 onwards, a :class:`Decimal` instance can also be constructed directly from a :class:`float`.
pt_pt: A partir do Python 3.2, uma instância :class:`Decimal` também pode ser construída diretamente a partir de um :class:`float`.
ru: Начиная с Python 3.2, экземпляр :class:`Decimal` также может быть создан непосредственно из :class:`float`.

source: Fused multiply-add. Return self*other+third with no rounding of the intermediate product self*other.
pt_pt: Multiplicação-soma fundida. Retorna self*other+third sem arredondamento do produto intermédio self*other.
ru: Слитое умножение-сложение. Вернуть self*other+ Third без округления промежуточного продукта self*other.

source: Return :const:`True` if the argument is canonical and :const:`False` otherwise. Currently, a :class:`Decimal` instance is always canonical, so this operation always returns :const:`True`.
pt_pt: Retorna :const:`True` se o argumento for canónico e :const:`False` caso contrário. Atualmente, uma instância :class:`Decimal` é sempre canónica, por isso esta operação sempre retorna :const:`True`.
ru: Верните :const:`True`, если аргумент канонический, и :const:`False` в противном случае. В настоящее время экземпляр :class:`Decimal` всегда является каноническим, поэтому эта операция всегда возвращает :const:`True`.

source: Return :const:`True` if the argument is a finite number, and :const:`False` if the argument is an infinity or a NaN.
pt_pt: Retorna :const:`True` se o argumento for um número finito, e :const:`False` se o argumento for um infinito ou um NaN.
ru: Верните :const:`True`, если аргумент является конечным числом, и :const:`False`, если аргумент является бесконечностью или NaN.

source: Return :const:`True` if the argument is either positive or negative infinity and :const:`False` otherwise.
pt_pt: Retorna :const:`True` se o argumento for infinito positivo ou negativo e :const:`False` caso contrário.
ru: Верните :const:`True`, если аргумент имеет положительную или отрицательную бесконечность, и :const:`False` в противном случае.

source: Return :const:`True` if the argument is a (quiet or signaling) NaN and :const:`False` otherwise.
pt_pt: Retorna :const:`True` se o argumento for um NaN (silencioso ou de sinalização) e :const:`False` caso contrário.
ru: Верните :const:`True`, если аргумент имеет значение NaN (тихое или сигнальное), и :const:`False` в противном случае.

source: Return :const:`True` if the argument is a *normal* finite number. Return :const:`False` if the argument is zero, subnormal, infinite or a NaN.
pt_pt: Retorna :const:`True` se o argumento for um número finito *normal*. Retorna :const:`False` se o argumento for zero, subnormal, infinito ou um NaN.
ru: Верните :const:`True`, если аргумент является *нормальным* конечным числом. Верните :const:`False`, если аргумент равен нулю, субнормальному, бесконечному или NaN.
