Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: A. The decimal module makes it easy to test results. A best practice is to re-run calculations using greater precision and with various rounding modes. Widely differing results indicate insufficient precision, rounding mode issues, ill-conditioned inputs, or a numerically unstable algorithm.
pt_pt: R. O módulo decimal facilita o teste de resultados. Uma boa prática é re-executar cálculos usando maior precisão e com vários modos de arredondamento. Resultados muito diferentes indicam precisão insuficiente, problemas com o modo de arredondamento, entradas mal condicionadas ou um algoritmo numericamete instável.
ru: Ответ. Десятичный модуль упрощает проверку результатов. Лучше всего повторить расчеты с большей точностью и с различными режимами округления. Сильно различающиеся результаты указывают на недостаточную точность, проблемы с режимом округления, плохие входные данные или численно нестабильный алгоритм.

source: Q. I noticed that context precision is applied to the results of operations but not to the inputs. Is there anything to watch out for when mixing values of different precisions?
pt_pt: P. Notei que a precisão do contexto é aplicada aos resultados das operações, mas não às entradas. Existe algo a que deva estar atento ao misturar valores de diferentes precisões?
ru: Вопрос. Я заметил, что точность контекста применяется к результатам операций, а не к входным данным. На что следует обратить внимание при смешивании значений разной точности?

source: The solution is either to increase precision or to force rounding of inputs using the unary plus operation:
pt_pt: A solução é aumentar a precisão ou forçar o arredondamento das entradas usando a operação de mais unário:
ru: Решение состоит в том, чтобы либо повысить точность, либо принудительно округлить входные данные с помощью операции унарного плюса:

source: >>> getcontext().prec = 3 >>> +Decimal('1.23456789') # unary plus triggers rounding Decimal('1.23')
pt_pt: >>> getcontext().prec = 3 >>> +Decimal('1.23456789') # mais unário desencadeia arredondamento Decimal('1.23')

source: Alternatively, inputs can be rounded upon creation using the :meth:`Context.create_decimal` method:
pt_pt: Alternativamente, as entradas podem ser arredondadas na criação usando o método :meth:`Context.create_decimal`:
ru: Альтернативно, входные данные можно округлить при создании с помощью метода :meth:`Context.create_decimal`:

source: Q. Is the CPython implementation fast for large numbers?
pt_pt: P. A implementação CPython é rápida para números grandes?
ru: Вопрос. Быстра ли реализация CPython для больших чисел?

source: A. Yes. In the CPython and PyPy3 implementations, the C/CFFI versions of the decimal module integrate the high speed `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ library for arbitrary precision correctly rounded decimal floating-point arithmetic [#]_. ``libmpdec`` uses `Karatsuba multiplication <https://en.wikipedia.org/wiki/Karatsuba_algorithm>`_ for medium-sized numbers and the `Number Theoretic Transform <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ for very large numbers.
pt_pt: R. Sim. Nas implementações CPython e PyPy3, as versões C/CFFI do módulo decimal integram a biblioteca de alta velocidade `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ para aritmética decimal de vírgula flutuante de precisão arbitrária corretamente arredondada [#]_. ``libmpdec`` usa a `multiplicação de Karatsuba <https://en.wikipedia.org/wiki/Karatsuba_algorithm>`_ para números de tamanho médio e a `Transformada Teórica dos Números <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ para números muito grandes.

source: The context must be adapted for exact arbitrary precision arithmetic. :attr:`~Context.Emin` and :attr:`~Context.Emax` should always be set to the maximum values, :attr:`~Context.clamp` should always be 0 (the default). Setting :attr:`~Context.prec` requires some care.
pt_pt: O contexto deve ser adaptado para aritmética de precisão arbitrária exata. :attr:`~Context.Emin` e :attr:`~Context.Emax` devem sempre ser definidos para os valores máximos, :attr:`~Context.clamp` deve sempre ser 0 (o predefinido). Definir :attr:`~Context.prec` requer algum cuidado.
ru: Контекст должен быть адаптирован для точной арифметики произвольной точности. :attr:`~Context.Emin` и :attr:`~Context.Emax` всегда должны быть установлены на максимальные значения, :attr:`~Context.clamp` всегда должен быть равен 0 (по умолчанию). Настройка :attr:`~Context.prec` требует некоторой осторожности.

source: The easiest approach for trying out bignum arithmetic is to use the maximum value for :attr:`~Context.prec` as well [#]_::
pt_pt: A abordagem mais fácil para experimentar aritmética bignum é usar também o valor máximo para :attr:`~Context.prec` [#]_:
ru: Самый простой способ опробовать арифметику bignum — использовать также максимальное значение для :attr:`~Context.prec`. [#]_ ::

source: For inexact results, :const:`MAX_PREC` is far too large on 64-bit platforms and the available memory will be insufficient::
pt_pt: Para resultados inexatos, :const:`MAX_PREC` é demasiado grande em plataformas de 64-bit e a memória disponível será insuficiente::

source: On systems with overallocation (e.g. Linux), a more sophisticated approach is to adjust :attr:`~Context.prec` to the amount of available RAM. Suppose that you have 8GB of RAM and expect 10 simultaneous operands using a maximum of 500MB each::
pt_pt: Em sistemas com sobrealocação (por exemplo, Linux), uma abordagem mais sofisticada é ajustar :attr:`~Context.prec` à quantidade de RAM disponível. Suponha que tem 8GB de RAM e espera 10 operandos simultâneos usando um máximo de 500MB cada::
ru: В системах с избыточным распределением ресурсов (например, Linux) более сложный подход заключается в настройке :attr:`~Context.prec` в соответствии с объемом доступной оперативной памяти. Предположим, что у вас 8 ГБ ОЗУ и вы ожидаете одновременного выполнения 10 операндов, каждый из которых будет занимать максимум 500 МБ:

source: >>> import sys >>> >>> # Maximum number of digits for a single operand using 500MB in 8-byte words >>> # with 19 digits per word (4-byte and 9 digits for the 32-bit build): >>> maxdigits = 19 * ((500 * 1024**2) // 8) >>> >>> # Check that this works: >>> c = Context(prec=maxdigits, Emax=MAX_EMAX, Emin=MIN_EMIN) >>> c.traps[Inexact] = True >>> setcontext(c) >>> >>> # Fill the available precision with nines: >>> x = Decimal(0).logical_invert() * 9 >>> sys.getsizeof(x) 524288112 >>> x + 2 Traceback (most recent call last): File "<stdin>", line 1, in <module> decimal.Inexact: [<class 'decimal.Inexact'>]
pt_pt: >>> import sys >>> >>> # Número máximo de dígitos para um único operando usando 500MB em palavras de 8-byte >>> # com 19 dígitos por palavra (4-byte e 9 dígitos para a construção de 32-bit): >>> maxdigits = 19 * ((500 * 1024**2) // 8) >>> >>> # Verificar que isto funciona: >>> c = Context(prec=maxdigits, Emax=MAX_EMAX, Emin=MIN_EMIN) >>> c.traps[Inexact] = True >>> setcontext(c) >>> >>> # Preencher a precisão disponível com noves: >>> x = Decimal(0).logical_invert() * 9 >>> sys.getsizeof(x) 524288112 >>> x + 2 Traceback (most recent call last): File "<stdin>", line 1, in <module> decimal.Inexact: [<class 'decimal.Inexact'>]

source: In general (and especially on systems without overallocation), it is recommended to estimate even tighter bounds and set the :attr:`Inexact` trap if all calculations are expected to be exact.
pt_pt: Em geral (e especialmente em sistemas sem sobrealocação), é recomendado estimar limites ainda mais apertados e definir a armadilha :attr:`Inexact` se todos os cálculos forem esperados como exatos.
ru: В целом (и особенно в системах без избыточного распределения) рекомендуется оценивать еще более жесткие границы и устанавливать ловушку :attr:`Inexact`, если ожидается, что все вычисления будут точными.

source: This approach now works for all exact results except for non-integer powers.
pt_pt: Esta abordagem agora funciona para todos os resultados exatos, exceto para potências não inteiras.
ru: Этот подход теперь работает для всех точных результатов, за исключением нецелых степеней.

source: Quick-start Tutorial
ru: Краткое руководство

source: For more advanced work, it may be useful to create alternate contexts using the Context() constructor. To make an alternate active, use the :func:`setcontext` function.
ru: Для более сложной работы может быть полезно создать альтернативные контексты с помощью конструктора Context(). Чтобы сделать альтернативу активной, используйте функцию :func:`setcontext`.

source: Other Unicode decimal digits are also permitted where ``digit`` appears above. These include decimal digits from various other alphabets (for example, Arabic-Indic and Devanāgarī digits) along with the fullwidth digits ``'\uff10'`` through ``'\uff19'``.
ru: Другие десятичные цифры Юникода также разрешены там, где выше встречается слово «цифра». К ним относятся десятичные цифры из различных других алфавитов (например, арабско-индийские цифры и цифры деванагари), а также цифры полной ширины от ``'\uff10'`` до ``'\uff19'``.

source: *prec* is an integer in the range [``1``, :const:`MAX_PREC`] that sets the precision for arithmetic operations in the context.
ru: *prec* — целое число в диапазоне [``1``, :const:`MAX_PREC`], которое устанавливает точность для арифметических операций в контексте.

source: The *rounding* option is one of the constants listed in the section `Rounding Modes`_.
ru: Параметр *rounding* — это одна из констант, перечисленных в разделе «Режимы округления».

source: The *traps* and *flags* fields list any signals to be set. Generally, new contexts should only set traps and leave the flags clear.
ru: В полях *trap* и *flags* перечислены все сигналы, которые необходимо установить. Как правило, в новых контекстах следует только устанавливать ловушки и оставлять флаги незамеченными.

source: The *Emin* and *Emax* fields are integers specifying the outer limits allowable for exponents. *Emin* must be in the range [:const:`MIN_EMIN`, ``0``], *Emax* in the range [``0``, :const:`MAX_EMAX`].
ru: Поля *Emin* и *Emax* представляют собой целые числа, определяющие внешние пределы, допустимые для экспонент. *Emin* должен находиться в диапазоне [:const:`MIN_EMIN`, ``0``], *Emax* в диапазоне [``0``, :const:`MAX_EMAX`].

source: The *capitals* field is either ``0`` or ``1`` (the default). If set to ``1``, exponents are printed with a capital ``E``; otherwise, a lowercase ``e`` is used: ``Decimal('6.02e+23')``.
ru: Поле *capitals* имеет значение «0» или «1» (по умолчанию). Если установлено значение «1», показатели степени печатаются с заглавной буквы «E»; в противном случае используется строчная буква ``e``: ``Decimal('6.02e+23')``.

source: The *clamp* field is either ``0`` (the default) or ``1``. If set to ``1``, the exponent ``e`` of a :class:`Decimal` instance representable in this context is strictly limited to the range ``Emin - prec + 1 <= e <= Emax - prec + 1``. If *clamp* is ``0`` then a weaker condition holds: the adjusted exponent of the :class:`Decimal` instance is at most :attr:`~Context.Emax`. When *clamp* is ``1``, a large normal number will, where possible, have its exponent reduced and a corresponding number of zeros added to its coefficient, in order to fit the exponent constraints; this preserves the value of the number but loses information about significant trailing zeros. For example::
ru: Поле *clamp* имеет значение либо ``0`` (по умолчанию), либо ``1``. Если установлено значение ``1``, показатель степени ``e`` экземпляра :class:`Decimal`, представленного в этом контексте, строго ограничен диапазоном ``Emin - prec + 1 <= e <= Emax - prec + 1``. Если *clamp* равен ``0``, тогда выполняется более слабое условие: скорректированная экспонента экземпляра :class:`Decimal` не превышает :attr:`~Context.Emax`. Когда *clamp* равен ``1``, для большого нормального числа, где это возможно, показатель степени будет уменьшен, а к его коэффициенту добавлено соответствующее количество нулей, чтобы соответствовать ограничениям показателя степени; при этом сохраняется значение числа, но теряется информация о значимых конечных нулях. Например::

source: 32-bit
ru: 32-бит

source: 64-bit
ru: 64-бит

source: Occurs when a subnormal result is pushed to zero by rounding. :class:`Inexact` and :class:`Subnormal` are also signaled.
ru: Происходит, когда ненормальный результат округляется до нуля. Также сигнализируются :class:`Inexact` и :class:`Subnormal`.

source: Floating Point Notes
ru: Заметки о плавающей точке

source: If :func:`setcontext` has not been called before :func:`getcontext`, then :func:`getcontext` will automatically create a new context for use in the current thread.
ru: Если :func:`setcontext` не вызывался до :func:`getcontext`, то :func:`getcontext` автоматически создаст новый контекст для использования в текущем потоке.

source: The new context is copied from a prototype context called *DefaultContext*. To control the defaults so that each thread will use the same values throughout the application, directly modify the *DefaultContext* object. This should be done *before* any threads are started so that there won't be a race condition between threads calling :func:`getcontext`. For example::
ru: Новый контекст копируется из контекста прототипа с именем *DefaultContext*. Чтобы контролировать значения по умолчанию, чтобы каждый поток использовал одни и те же значения во всем приложении, напрямую измените объект *DefaultContext*. Это должно быть сделано *до* запуска любых потоков, чтобы не возникло состояние гонки между потоками, вызывающими :func:`getcontext`. Например::

source: A. Yes. The principle is that all values are considered to be exact and so is the arithmetic on those values. Only the results are rounded. The advantage for inputs is that "what you type is what you get". A disadvantage is that the results can look odd if you forget that the inputs haven't been rounded:
ru: А. Да. Принцип заключается в том, что все значения считаются точными, как и арифметика этих значений. Только результаты округляются. Преимущество ввода заключается в том, что «что вы вводите, то и получаете». Недостатком является то, что результаты могут выглядеть странно, если вы забудете, что входные данные не были округлены:

source: For inexact results, :attr:`MAX_PREC` is far too large on 64-bit platforms and the available memory will be insufficient::
ru: Из-за неточных результатов :attr:`MAX_PREC` слишком велик на 64-битных платформах, и доступной памяти будет недостаточно::
