Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: Return :const:`True` if the argument is a quiet NaN, and :const:`False` otherwise.
pt_pt: Retorna :const:`True` se o argumento for um NaN silencioso, e :const:`False` caso contrário.
ru: Верните :const:`True`, если аргументом является тихое значение NaN, и :const:`False` в противном случае.

source: Return :const:`True` if the argument has a negative sign and :const:`False` otherwise. Note that zeros and NaNs can both carry signs.
pt_pt: Retorna :const:`True` se o argumento tiver um sinal negativo e :const:`False` caso contrário. Note que zeros e NaNs podem ambos ter sinais.
ru: Верните :const:`True`, если аргумент имеет отрицательный знак, и :const:`False` в противном случае. Обратите внимание, что нули и NaN могут иметь знаки.

source: Return :const:`True` if the argument is a signaling NaN and :const:`False` otherwise.
pt_pt: Retorna :const:`True` se o argumento for um NaN de sinalização e :const:`False` caso contrário.
ru: Верните :const:`True`, если аргумент является сигнальным NaN, и :const:`False` в противном случае.

source: Return :const:`True` if the argument is subnormal, and :const:`False` otherwise.
pt_pt: Retorna :const:`True` se o argumento for subnormal, e :const:`False` caso contrário.
ru: Верните :const:`True`, если аргумент ненормальный, и :const:`False` в противном случае.

source: Return :const:`True` if the argument is a (positive or negative) zero and :const:`False` otherwise.
pt_pt: Retorna :const:`True` se o argumento for um zero (positivo ou negativo) e :const:`False` caso contrário.
ru: Верните :const:`True`, если аргумент представляет собой ноль (положительный или отрицательный), и :const:`False` в противном случае.

source: Return the natural (base e) logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
pt_pt: Retorna o logaritmo natural (base e) do operando. O resultado é corretamente arredondado usando o modo de arredondamento :const:`ROUND_HALF_EVEN`.
ru: Возвращает натуральный логарифм (по основанию e) операнда. Результат правильно округляется с использованием режима округления :const:`ROUND_HALF_EVEN`.

source: Return the base ten logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
pt_pt: Retorna o logaritmo de base dez do operando. O resultado é corretamente arredondado usando o modo de arredondamento :const:`ROUND_HALF_EVEN`.
ru: Возвращает десятичный логарифм операнда. Результат правильно округляется с использованием режима округления :const:`ROUND_HALF_EVEN`.

source: For a nonzero number, return the adjusted exponent of its operand as a :class:`Decimal` instance. If the operand is a zero then ``Decimal('-Infinity')`` is returned and the :const:`DivisionByZero` flag is raised. If the operand is an infinity then ``Decimal('Infinity')`` is returned.
pt_pt: Para um número não zero, retorna o expoente ajustado do seu operando como uma instância :class:`Decimal`. Se o operando for um zero, então ``Decimal('-Infinity')`` é retornado e a flag :const:`DivisionByZero` é levantada. Se o operando for um infinito, então ``Decimal('Infinity')`` é retornado.
ru: Для ненулевого числа верните скорректированную степень его операнда в виде экземпляра :class:`Decimal`. Если операнд равен нулю, то возвращается ``Decimal('-Infinity')`` и поднимается флаг :const:`DivisionByZero`. Если операнд является бесконечностью, возвращается ``Decimal('Infinity')``.

source: :meth:`logical_and` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``and`` of the two operands.
pt_pt: :meth:`logical_and` é uma operação lógica que recebe dois *operandos lógicos* (veja :ref:`logical_operands_label`). O resultado é o ``and`` dígito a dígito dos dois operandos.
ru: :meth:`ological_and` — это логическая операция, которая принимает два *логических операнда* (см. :ref:`ological_operands_label`). Результатом является поразрядное «и» двух операндов.

source: :meth:`logical_invert` is a logical operation. The result is the digit-wise inversion of the operand.
pt_pt: :meth:`logical_invert` é uma operação lógica. O resultado é a inversão dígito a dígito do operando.
ru: :meth:`ologic_invert` — это логическая операция. Результатом является поразрядная инверсия операнда.

source: :meth:`logical_or` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``or`` of the two operands.
pt_pt: :meth:`logical_or` é uma operação lógica que recebe dois *operandos lógicos* (veja :ref:`logical_operands_label`). O resultado é o ``or`` dígito a dígito dos dois operandos.
ru: :meth:`логическое_или` — это логическая операция, которая принимает два *логических операнда* (см. :ref:`ological_operands_label`). Результатом является поразрядное «или» двух операндов.

source: :meth:`logical_xor` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise exclusive or of the two operands.
pt_pt: :meth:`logical_xor` é uma operação lógica que recebe dois *operandos lógicos* (veja :ref:`logical_operands_label`). O resultado é o ou exclusivo dígito a dígito dos dois operandos.
ru: :meth:`ological_xor` — это логическая операция, которая принимает два *логических операнда* (см. :ref:`ological_operands_label`). Результатом является исключающее число или из двух операндов.

source: Like ``max(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
pt_pt: Semelhante a ``max(self, other)`` exceto que a regra de arredondamento do contexto é aplicada antes de retornar e que os valores ``NaN`` são sinalizados ou ignorados (dependendo do contexto e se são de sinalização ou silenciosos).
ru: Подобно ``max(self,other)``, за исключением того, что правило округления контекста применяется перед возвратом и что значения ``NaN`` либо сигнализируются, либо игнорируются (в зависимости от контекста и от того, сигнализируют они или молчат).

source: Similar to the :meth:`.max` method, but the comparison is done using the absolute values of the operands.
pt_pt: Semelhante ao método :meth:`.max`, mas a comparação é feita usando os valores absolutos dos operandos.
ru: Аналогичен методу :meth:`.max`, но сравнение выполняется с использованием абсолютных значений операндов.

source: Like ``min(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
pt_pt: Semelhante a ``min(self, other)`` exceto que a regra de arredondamento do contexto é aplicada antes de retornar e que os valores ``NaN`` são sinalizados ou ignorados (dependendo do contexto e se são de sinalização ou silenciosos).
ru: Подобно ``min(self,other)``, за исключением того, что правило округления контекста применяется перед возвратом и что значения ``NaN`` либо сигнализируются, либо игнорируются (в зависимости от контекста и от того, сигнализируют они или молчат).

source: Similar to the :meth:`.min` method, but the comparison is done using the absolute values of the operands.
pt_pt: Semelhante ao método :meth:`.min`, mas a comparação é feita usando os valores absolutos dos operandos.
ru: Аналогичен методу :meth:`.min`, но сравнение выполняется с использованием абсолютных значений операндов.

source: Return the largest number representable in the given context (or in the current thread's context if no context is given) that is smaller than the given operand.
pt_pt: Retorna o maior número representável no contexto dado (ou no contexto da thread atual se nenhum contexto for dado) que é menor que o operando dado.
ru: Возвращает наибольшее число, представимое в данном контексте (или в контексте текущего потока, если контекст не указан), которое меньше заданного операнда.

source: Return the smallest number representable in the given context (or in the current thread's context if no context is given) that is larger than the given operand.
pt_pt: Retorna o menor número representável no contexto dado (ou no contexto da thread atual se nenhum contexto for dado) que é maior que o operando dado.
ru: Возвращает наименьшее число, которое можно представить в данном контексте (или в контексте текущего потока, если контекст не указан), которое больше заданного операнда.

source: If the two operands are unequal, return the number closest to the first operand in the direction of the second operand. If both operands are numerically equal, return a copy of the first operand with the sign set to be the same as the sign of the second operand.
pt_pt: Se os dois operandos forem desiguais, retorna o número mais próximo do primeiro operando na direção do segundo operando. Se ambos os operandos forem numericamete iguais, retorna uma cópia do primeiro operando com o sinal definido para ser o mesmo que o sinal do segundo operando.
ru: Если два операнда не равны, верните число, ближайшее к первому операнду, в направлении второго операнда. Если оба операнда численно равны, верните копию первого операнда со знаком, совпадающим со знаком второго операнда.

source: Used for producing canonical values of an equivalence class within either the current context or the specified context.
pt_pt: Usado para produzir valores canónicos de uma classe de equivalência dentro do contexto atual ou do contexto especificado.
ru: Используется для создания канонических значений класса эквивалентности либо в текущем контексте, либо в указанном контексте.

source: This has the same semantics as the unary plus operation, except that if the final result is finite it is reduced to its simplest form, with all trailing zeros removed and its sign preserved. That is, while the coefficient is non-zero and a multiple of ten the coefficient is divided by ten and the exponent is incremented by 1. Otherwise (the coefficient is zero) the exponent is set to 0. In all cases the sign is unchanged.
pt_pt: Isto tem a mesma semântica que a operação unária de mais, exceto que se o resultado final for finito, é reduzido à sua forma mais simples, com todos os zeros à direita removidos e o seu sinal preservado. Ou seja, enquanto o coeficiente for não-zero e um múltiplo de dez, o coeficiente é dividido por dez e o expoente é incrementado por 1. Caso contrário (o coeficiente é zero), o expoente é definido para 0. Em todos os casos, o sinal permanece inalterado.
ru: Она имеет ту же семантику, что и операция унарного плюса, за исключением того, что, если конечный результат конечен, она сводится к простейшей форме, при этом удаляются все конечные нули и сохраняется ее знак. То есть, пока коэффициент ненулевой и кратен десяти, коэффициент делится на десять и показатель степени увеличивается на 1. В противном случае (коэффициент равен нулю) показатель степени устанавливается равным 0. Во всех случаях знак не меняется. .

source: For example, ``Decimal('32.100')`` and ``Decimal('0.321000e+2')`` both normalize to the equivalent value ``Decimal('32.1')``.
pt_pt: Por exemplo, ``Decimal('32.100')`` e ``Decimal('0.321000e+2')`` ambos normalizam para o valor equivalente ``Decimal('32.1')``.
ru: Например, ``Decimal('32.100')`` и ``Decimal('0.321000e+2')`` оба нормализуются до эквивалентного значения ``Decimal('32.1')``.

source: Note that rounding is applied *before* reducing to simplest form.
pt_pt: Note que o arredondamento é aplicado *antes* de reduzir para a forma mais simples.
ru: Обратите внимание, что округление применяется *до* приведения к простейшей форме.

source: In the latest versions of the specification, this operation is also known as ``reduce``.
pt_pt: Nas versões mais recentes da especificação, esta operação também é conhecida como ``reduce``.
ru: В последних версиях спецификации эта операция также известна как «сокращение».

source: Return a string describing the *class* of the operand. The returned value is one of the following ten strings.
pt_pt: Retorna uma string que descreve a *classe* do operando. O valor retornado é uma das seguintes dez strings.
ru: Возвращает строку, описывающую *класс* операнда. Возвращаемое значение — одна из следующих десяти строк.

source: ``"-Infinity"``, indicating that the operand is negative infinity.
pt_pt: ``"-Infinity"``, indicando que o operando é infinito negativo.
ru: ``"-Infinity"``, указывающий, что операнд имеет отрицательную бесконечность.

source: ``"-Normal"``, indicating that the operand is a negative normal number.
pt_pt: ``"-Normal"``, indicando que o operando é um número normal negativo.
ru: ``"-Normal"``, указывающий, что операнд является отрицательным нормальным числом.

source: ``"-Subnormal"``, indicating that the operand is negative and subnormal.
pt_pt: ``"-Subnormal"``, indicando que o operando é negativo e subnormal.
ru: ``"-Subnormal"``, указывающий, что операнд отрицательный и ненормальный.

source: ``"-Zero"``, indicating that the operand is a negative zero.
pt_pt: ``"-Zero"``, indicando que o operando é um zero negativo.
ru: ``"-Zero"``, указывающий, что операнд является отрицательным нулем.

source: ``"+Zero"``, indicating that the operand is a positive zero.
pt_pt: ``"+Zero"``, indicando que o operando é um zero positivo.
ru: ``"+Zero"``, указывающий, что операнд является положительным нулем.

source: ``"+Subnormal"``, indicating that the operand is positive and subnormal.
pt_pt: ``"+Subnormal"``, indicando que o operando é positivo e subnormal.
ru: ``"+Субнормальный"``, указывающий, что операнд положительный и субнормальный.

source: ``"+Normal"``, indicating that the operand is a positive normal number.
pt_pt: ``"+Normal"``, indicando que o operando é um número normal positivo.
ru: ``"+Normal"``, указывающий, что операнд является положительным нормальным числом.

source: ``"+Infinity"``, indicating that the operand is positive infinity.
pt_pt: ``"+Infinity"``, indicando que o operando é infinito positivo.
ru: ``"+Infinity"``, указывающий, что операнд имеет положительную бесконечность.

source: ``"NaN"``, indicating that the operand is a quiet NaN (Not a Number).
pt_pt: ``"NaN"``, indicando que o operando é um NaN silencioso (Não é um Número).
ru: ``"NaN"``, указывающий, что операнд является молчаливым NaN (не числом).

source: ``"sNaN"``, indicating that the operand is a signaling NaN.
pt_pt: ``"sNaN"``, indicando que o operando é um NaN de sinalização.
ru: ``"sNaN"``, указывающий, что операнд является сигнальным NaN.

source: Return a value equal to the first operand after rounding and having the exponent of the second operand.
pt_pt: Retorna um valor igual ao primeiro operando após arredondamento e tendo o expoente do segundo operando.
ru: Возвращает значение, равное первому операнду после округления и имеющее показатель степени второго операнда.

source: Unlike other operations, if the length of the coefficient after the quantize operation would be greater than precision, then an :const:`InvalidOperation` is signaled. This guarantees that, unless there is an error condition, the quantized exponent is always equal to that of the right-hand operand.
pt_pt: Ao contrário de outras operações, se o comprimento do coeficiente após a operação de quantização for maior que a precisão, então um :const:`InvalidOperation` é sinalizado. Isto garante que, a menos que haja uma condição de erro, o expoente quantizado é sempre igual ao do operando do lado direito.
ru: В отличие от других операций, если длина коэффициента после операции квантования превышает точность, то сигнализируется :const:`InvalidOperation`. Это гарантирует, что, если не возникнет ошибка, квантованная экспонента всегда равна экспоненте правого операнда.

source: Also unlike other operations, quantize never signals Underflow, even if the result is subnormal and inexact.
pt_pt: Ao contrário de outras operações, quantize nunca sinaliza Underflow, mesmo que o resultado seja subnormal e inexato.
ru: Кроме того, в отличие от других операций, квантование никогда не сигнализирует о недостаточном переполнении, даже если результат ненормальный и неточный.

source: If the exponent of the second operand is larger than that of the first then rounding may be necessary. In this case, the rounding mode is determined by the ``rounding`` argument if given, else by the given ``context`` argument; if neither argument is given the rounding mode of the current thread's context is used.
pt_pt: Se o expoente do segundo operando for maior que o do primeiro, então o arredondamento pode ser necessário. Neste caso, o modo de arredondamento é determinado pelo argumento ``rounding``, se fornecido, caso contrário pelo argumento ``context`` fornecido; se nenhum argumento for fornecido, o modo de arredondamento do contexto da thread atual é usado.
ru: Если показатель степени второго операнда больше показателя степени первого, то может потребоваться округление. В этом случае режим округления определяется аргументом округления, если он задан, в противном случае — заданным аргументом контекста; если ни один аргумент не указан, используется режим округления контекста текущего потока.

source: An error is returned whenever the resulting exponent is greater than :attr:`~Context.Emax` or less than :meth:`~Context.Etiny`.
pt_pt: Um erro é retornado sempre que o expoente resultante for maior que :attr:`~Context.Emax` ou menor que :meth:`~Context.Etiny`.
ru: Ошибка возвращается всякий раз, когда результирующий показатель степени больше :attr:`~Context.Emax` или меньше :meth:`~Context.Etiny`.

source: Return ``Decimal(10)``, the radix (base) in which the :class:`Decimal` class does all its arithmetic. Included for compatibility with the specification.
pt_pt: Retorna ``Decimal(10)``, a base (radix) na qual a classe :class:`Decimal` faz toda a sua aritmética. Incluído para compatibilidade com a especificação.
ru: Возвращает ``Decimal(10)``, систему счисления (основание), в которой класс :class:`Decimal` выполняет всю свою арифметику. Включено для совместимости со спецификацией.

source: Return the remainder from dividing *self* by *other*. This differs from ``self % other`` in that the sign of the remainder is chosen so as to minimize its absolute value. More precisely, the return value is ``self - n * other`` where ``n`` is the integer nearest to the exact value of ``self / other``, and if two integers are equally near then the even one is chosen.
pt_pt: Retorna o resto da divisão de *self* por *other*. Isto difere de ``self % other`` no sentido em que o sinal do resto é escolhido de forma a minimizar o seu valor absoluto. Mais precisamente, o valor de retorno é ``self - n * other`` onde ``n`` é o inteiro mais próximo do valor exato de ``self / other``, e se dois inteiros estiverem igualmente próximos, então o par é escolhido.
ru: Вернуть остаток от деления *self* на *other*. Это отличается от «self %other» тем, что знак остатка выбирается так, чтобы минимизировать его абсолютное значение. Точнее, возвращаемое значение — ``self - n *other``, где ``n`` — целое число, ближайшее к точному значению ``self/other``, и если два целых числа одинаково близки, то четное выбран.

source: If the result is zero then its sign will be the sign of *self*.
pt_pt: Se o resultado for zero, então o seu sinal será o sinal de *self*.
ru: Если результат равен нулю, то его знаком будет знак *self*.

source: Return the result of rotating the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to rotate. If the second operand is positive then rotation is to the left; otherwise rotation is to the right. The coefficient of the first operand is padded on the left with zeros to length precision if necessary. The sign and exponent of the first operand are unchanged.
pt_pt: Retorna o resultado da rotação dos dígitos do primeiro operando por uma quantidade especificada pelo segundo operando. O segundo operando deve ser um inteiro no intervalo -precisão até precisão. O valor absoluto do segundo operando dá o número de posições a rotacionar. Se o segundo operando for positivo, então a rotação é para a esquerda; caso contrário, a rotação é para a direita. O coeficiente do primeiro operando é preenchido à esquerda com zeros até ao comprimento da precisão, se necessário. O sinal e o expoente do primeiro operando permanecem inalterados.
ru: Возвращает результат вращения цифр первого операнда на величину, указанную вторым операндом. Второй операнд должен быть целым числом в диапазоне от точности до точности. Абсолютное значение второго операнда дает количество мест для вращения. Если второй операнд положительный, то вращение происходит влево; в противном случае вращение происходит вправо. Коэффициент первого операнда при необходимости дополняется слева нулями для точности длины. Знак и показатель степени первого операнда не изменяются.

source: Test whether self and other have the same exponent or whether both are ``NaN``.
pt_pt: Testa se self e other têm o mesmo expoente ou se ambos são ``NaN``.
ru: Проверьте, имеют ли я и другие одинаковый показатель степени или оба являются ``NaN``.

source: Return the first operand with exponent adjusted by the second. Equivalently, return the first operand multiplied by ``10**other``. The second operand must be an integer.
pt_pt: Retorna o primeiro operando com o expoente ajustado pelo segundo. Equivalentemente, retorna o primeiro operando multiplicado por ``10**other``. O segundo operando deve ser um inteiro.
ru: Верните первый операнд с показателем степени, скорректированным вторым. Аналогично, верните первый операнд, умноженный на ``10**other``. Второй операнд должен быть целым числом.

source: Return the result of shifting the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to shift. If the second operand is positive then the shift is to the left; otherwise the shift is to the right. Digits shifted into the coefficient are zeros. The sign and exponent of the first operand are unchanged.
pt_pt: Retorna o resultado do deslocamento dos dígitos do primeiro operando por uma quantidade especificada pelo segundo operando. O segundo operando deve ser um inteiro no intervalo -precisão até precisão. O valor absoluto do segundo operando dá o número de posições a deslocar. Se o segundo operando for positivo, então o deslocamento é para a esquerda; caso contrário, o deslocamento é para a direita. Os dígitos deslocados para o coeficiente são zeros. O sinal e o expoente do primeiro operando permanecem inalterados.
ru: Возвращает результат сдвига цифр первого операнда на величину, указанную вторым операндом. Второй операнд должен быть целым числом в диапазоне от точности до точности. Абсолютное значение второго операнда дает количество мест для сдвига. Если второй операнд положительный, то сдвиг происходит влево; в противном случае сдвиг происходит вправо. Цифры, вставленные в коэффициент, являются нулями. Знак и показатель степени первого операнда не изменяются.

source: Return the square root of the argument to full precision.
pt_pt: Retorna a raiz quadrada do argumento com precisão total.
ru: Верните квадратный корень аргумента с полной точностью.

source: Convert to a string, using engineering notation if an exponent is needed.
pt_pt: Converte para uma string, usando notação de engenharia se um expoente for necessário.
ru: Преобразуйте в строку, используя инженерную нотацию, если требуется показатель степени.
