Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: Engineering notation has an exponent which is a multiple of 3. This can leave up to 3 digits to the left of the decimal place and may require the addition of either one or two trailing zeros.
pt_pt: A notação de engenharia tem um expoente que é um múltiplo de 3. Isto pode deixar até 3 dígitos à esquerda do ponto decimal e pode requerer a adição de um ou dois zeros à direita.
ru: В инженерных обозначениях показатель степени кратен 3. При этом слева от десятичного знака может оставаться до 3 цифр, и может потребоваться добавление одного или двух конечных нулей.

source: For example, this converts ``Decimal('123E+1')`` to ``Decimal('1.23E+3')``.
pt_pt: Por exemplo, isto converte ``Decimal('123E+1')`` para ``Decimal('1.23E+3')``.
ru: Например, это преобразует ``Decimal('123E+1')`` в ``Decimal('1.23E+3')``.

source: Identical to the :meth:`to_integral_value` method. The ``to_integral`` name has been kept for compatibility with older versions.
pt_pt: Idêntico ao método :meth:`to_integral_value`. O nome ``to_integral`` foi mantido para compatibilidade com versões mais antigas.
ru: Идентичен методу :meth:`to_integral_value`. Имя to_integral сохранено для совместимости со старыми версиями.

source: Round to the nearest integer, signaling :const:`Inexact` or :const:`Rounded` as appropriate if rounding occurs. The rounding mode is determined by the ``rounding`` parameter if given, else by the given ``context``. If neither parameter is given then the rounding mode of the current context is used.
pt_pt: Arredonda para o inteiro mais próximo, sinalizando :const:`Inexact` ou :const:`Rounded` conforme apropriado se ocorrer arredondamento. O modo de arredondamento é determinado pelo parâmetro ``rounding``, se fornecido, caso contrário pelo ``context`` fornecido; se nenhum parâmetro for fornecido, então o modo de arredondamento do contexto atual é usado.
ru: Округлите до ближайшего целого числа, сигнализируя :const:`Inexact` или :const:`Rounded` в зависимости от ситуации, если происходит округление. Режим округления определяется параметром округления, если он задан, в противном случае — заданным контекстом. Если ни один из параметров не указан, используется режим округления текущего контекста.

source: Round to the nearest integer without signaling :const:`Inexact` or :const:`Rounded`. If given, applies *rounding*; otherwise, uses the rounding method in either the supplied *context* or the current context.
pt_pt: Arredonda para o inteiro mais próximo sem sinalizar :const:`Inexact` ou :const:`Rounded`. Se fornecido, aplica *rounding*; caso contrário, usa o método de arredondamento no *context* fornecido ou no contexto atual.
ru: Округлите до ближайшего целого числа, не сигнализируя :const:`Inexact` или :const:`Rounded`. Если задано, применяется *округление*; в противном случае используется метод округления либо в предоставленном *контексте*, либо в текущем контексте.

source: Decimal numbers can be rounded using the :func:`.round` function:
pt_pt: Os números decimais podem ser arredondados usando a função :func:`.round`:

source: If *ndigits* is not given or ``None``, returns the nearest :class:`int` to *number*, rounding ties to even, and ignoring the rounding mode of the :class:`Decimal` context. Raises :exc:`OverflowError` if *number* is an infinity or :exc:`ValueError` if it is a (quiet or signaling) NaN.
pt_pt: Se *ndigits* não for fornecido ou for ``None``, retorna o :class:`int` mais próximo de *number*, arredondando empates para par, e ignorando o modo de arredondamento do contexto :class:`Decimal`. Levanta :exc:`OverflowError` se *number* for um infinito ou :exc:`ValueError` se for um NaN (silencioso ou de sinalização).

source: If *ndigits* is an :class:`int`, the context's rounding mode is respected and a :class:`Decimal` representing *number* rounded to the nearest multiple of ``Decimal('1E-ndigits')`` is returned; in this case, ``round(number, ndigits)`` is equivalent to ``self.quantize(Decimal('1E-ndigits'))``. Returns ``Decimal('NaN')`` if *number* is a quiet NaN. Raises :class:`InvalidOperation` if *number* is an infinity, a signaling NaN, or if the length of the coefficient after the quantize operation would be greater than the current context's precision. In other words, for the non-corner cases:
pt_pt: Se *ndigits* for um :class:`int`, o modo de arredondamento do contexto é respeitado e um :class:`Decimal` que representa *number* arredondado para o múltiplo mais próximo de ``Decimal('1E-ndigits')`` é retornado; neste caso, ``round(number, ndigits)`` é equivalente a ``self.quantize(Decimal('1E-ndigits'))``. Retorna ``Decimal('NaN')`` se *number* for um NaN silencioso. Levanta :class:`InvalidOperation` se *number* for um infinito, um NaN de sinalização, ou se o comprimento do coeficiente após a operação de quantização for maior que a precisão do contexto atual. Em outras palavras, para os casos não extremos:

source: if *ndigits* is positive, return *number* rounded to *ndigits* decimal places;
pt_pt: se *ndigits* for positivo, retorna *number* arredondado para *ndigits* casas decimais;

source: if *ndigits* is zero, return *number* rounded to the nearest integer;
pt_pt: se *ndigits* for zero, retorna *number* arredondado para o inteiro mais próximo;

source: if *ndigits* is negative, return *number* rounded to the nearest multiple of ``10**abs(ndigits)``.
pt_pt: se *ndigits* for negativo, retorna *number* arredondado para o múltiplo mais próximo de ``10**abs(ndigits)``.

source: For example::
pt_pt: Por exemplo::

source: >>> from decimal import Decimal, getcontext, ROUND_DOWN >>> getcontext().rounding = ROUND_DOWN >>> round(Decimal('3.75')) # context rounding ignored 4 >>> round(Decimal('3.5')) # round-ties-to-even 4 >>> round(Decimal('3.75'), 0) # uses the context rounding Decimal('3') >>> round(Decimal('3.75'), 1) Decimal('3.7') >>> round(Decimal('3.75'), -1) Decimal('0E+1')
pt_pt: >>> from decimal import Decimal, getcontext, ROUND_DOWN >>> getcontext().rounding = ROUND_DOWN >>> round(Decimal('3.75')) # arredondamento do contexto ignorado 4 >>> round(Decimal('3.5')) # arredondar-empates-para-par 4 >>> round(Decimal('3.75'), 0) # usa o arredondamento do contexto Decimal('3') >>> round(Decimal('3.75'), 1) Decimal('3.7') >>> round(Decimal('3.75'), -1) Decimal('0E+1')

source: Logical operands
pt_pt: Operandos lógicos
ru: Логические операнды

source: The :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or`, and :meth:`~Decimal.logical_xor` methods expect their arguments to be *logical operands*. A *logical operand* is a :class:`Decimal` instance whose exponent and sign are both zero, and whose digits are all either ``0`` or ``1``.
pt_pt: Os métodos :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or` e :meth:`~Decimal.logical_xor` esperam que os seus argumentos sejam *operandos lógicos*. Um *operando lógico* é uma instância :class:`Decimal` cujo expoente e sinal são ambos zero, e cujos dígitos são todos ``0`` ou ``1``.
ru: Методы :meth:`~Decimal.ological_and`, :meth:`~Decimal.ological_invert`, :meth:`~Decimal.ological_or` и :meth:`~Decimal.ological_xor` ожидают, что их аргументы будут *логическими операндами. *. *Логический операнд* — это экземпляр :class:`Decimal`, показатель степени и знак которого равны нулю, а все цифры равны либо ``0``, либо ``1``.

source: Context objects
pt_pt: Objetos de contexto
ru: контекст объекты

source: Contexts are environments for arithmetic operations. They govern precision, set rules for rounding, determine which signals are treated as exceptions, and limit the range for exponents.
pt_pt: Os contextos são ambientes para operações aritméticas. Eles governam a precisão, definem regras de arredondamento, determinam quais sinais são tratados como exceções e limitam o intervalo para expoentes.
ru: Контексты — это среды для арифметических операций. Они управляют точностью, устанавливают правила округления, определяют, какие сигналы считаются исключениями, и ограничивают диапазон показателей степени.

source: Each thread has its own current context which is accessed or changed using the :func:`getcontext` and :func:`setcontext` functions:
pt_pt: Cada thread tem o seu próprio contexto atual, que é acedido ou alterado usando as funções :func:`getcontext` e :func:`setcontext`:
ru: Каждый поток имеет свой собственный текущий контекст, доступ к которому или его изменение осуществляется с помощью функций :func:`getcontext` и :func:`setcontext`:

source: Return the current context for the active thread.
pt_pt: Retorna o contexto atual para a thread ativa.
ru: Верните текущий контекст для активного потока.

source: Set the current context for the active thread to *c*.
pt_pt: Define o contexto atual para a thread ativa como *c*.
ru: Установите текущий контекст для активного потока на *c*.

source: You can also use the :keyword:`with` statement and the :func:`localcontext` function to temporarily change the active context.
pt_pt: Também pode usar a instrução :keyword:`with` e a função :func:`localcontext` para alterar temporariamente o contexto ativo.
ru: Вы также можете использовать оператор :keyword:`with` и функцию :func:`localcontext` для временного изменения активного контекста.

source: Return a context manager that will set the current context for the active thread to a copy of *ctx* on entry to the with-statement and restore the previous context when exiting the with-statement. If no context is specified, a copy of the current context is used. The *kwargs* argument is used to set the attributes of the new context.
pt_pt: Retorna um gestor de contexto que definirá o contexto atual para a thread ativa como uma cópia de *ctx* na entrada da instrução with e restaurará o contexto anterior ao sair da instrução with. Se nenhum contexto for especificado, uma cópia do contexto atual é usada. O argumento *kwargs* é usado para definir os atributos do novo contexto.
ru: Возвращает менеджер контекста, который установит текущий контекст для активного потока в копию *ctx* при входе в оператор with и восстановит предыдущий контекст при выходе из оператора with. Если контекст не указан, используется копия текущего контекста. Аргумент *kwargs* используется для установки атрибутов нового контекста.

source: For example, the following code sets the current decimal precision to 42 places, performs a calculation, and then automatically restores the previous context::
pt_pt: Por exemplo, o seguinte código define a precisão decimal atual para 42 casas, realiza um cálculo e depois restaura automaticamente o contexto anterior::
ru: Например, следующий код устанавливает текущую десятичную точность до 42 знаков, выполняет расчет, а затем автоматически восстанавливает предыдущий контекст:

source: from decimal import localcontext with localcontext() as ctx: ctx.prec = 42 # Perform a high precision calculation s = calculate_something() s = +s # Round the final result back to the default precision
pt_pt: from decimal import localcontext with localcontext() as ctx: ctx.prec = 42 # Realizar um cálculo de alta precisão s = calculate_something() s = +s # Arredondar o resultado final de volta à precisão predefinida

source: Using keyword arguments, the code would be the following::
pt_pt: Usando argumentos de palavra-chave, o código seria o seguinte::
ru: Используя аргументы ключевого слова, код будет следующим:

source: Raises :exc:`TypeError` if *kwargs* supplies an attribute that :class:`Context` doesn't support. Raises either :exc:`TypeError` or :exc:`ValueError` if *kwargs* supplies an invalid value for an attribute.
pt_pt: Levanta :exc:`TypeError` se *kwargs* fornecer um atributo que :class:`Context` não suporta. Levanta :exc:`TypeError` ou :exc:`ValueError` se *kwargs* fornecer um valor inválido para um atributo.
ru: Вызывает :exc:`TypeError`, если *kwargs* предоставляет атрибут, который :class:`Context` не поддерживает. Вызывает либо :exc:`TypeError`, либо :exc:`ValueError`, если *kwargs* предоставляет недопустимое значение для атрибута.

source: :meth:`localcontext` now supports setting context attributes through the use of keyword arguments.
pt_pt: :meth:`localcontext` agora suporta a definição de atributos de contexto através do uso de argumentos de palavra-chave.
ru: :meth:`localcontext` теперь поддерживает настройку атрибутов контекста с помощью аргументов ключевого слова.

source: New contexts can also be created using the :class:`Context` constructor described below. In addition, the module provides three pre-made contexts:
pt_pt: Novos contextos também podem ser criados usando o construtor :class:`Context` descrito abaixo. Além disso, o módulo fornece três contextos pré-definidos:
ru: Новые контексты также можно создавать с помощью конструктора :class:`Context`, описанного ниже. Кроме того, модуль предоставляет три готовых контекста:

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_UP`. All flags are cleared. All traps are enabled (treated as exceptions) except :const:`Inexact`, :const:`Rounded`, and :const:`Subnormal`.
pt_pt: Este é um contexto padrão definido pela Especificação de Aritmética Decimal Geral. A precisão é definida para nove. O arredondamento é definido para :const:`ROUND_HALF_UP`. Todas as flags são limpas. Todas as armadilhas estão ativadas (tratadas como exceções) exceto :const:`Inexact`, :const:`Rounded` e :const:`Subnormal`.
ru: Это стандартный контекст, определенный Спецификацией общей десятичной арифметики. Точность установлена ​​на девять. Для округления установлено значение :const:`ROUND_HALF_UP`. Все флаги сброшены. Все ловушки включены (расцениваются как исключения), кроме :const:`Inexact`, :const:`Rounded` и :const:`Subnormal`.

source: Because many of the traps are enabled, this context is useful for debugging.
pt_pt: Como muitas das armadilhas estão ativadas, este contexto é útil para depuração.
ru: Поскольку многие ловушки включены, этот контекст полезен для отладки.

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_EVEN`. All flags are cleared. No traps are enabled (so that exceptions are not raised during computations).
pt_pt: Este é um contexto padrão definido pela Especificação de Aritmética Decimal Geral. A precisão é definida para nove. O arredondamento é definido para :const:`ROUND_HALF_EVEN`. Todas as flags são limpas. Nenhuma armadilha está ativada (para que exceções não sejam levantadas durante os cálculos).
ru: Это стандартный контекст, определенный Спецификацией общей десятичной арифметики. Точность установлена ​​на девять. Для округления установлено значение :const:`ROUND_HALF_EVEN`. Все флаги сброшены. Никаких ловушек не включено (чтобы во время вычислений не возникало исключений).

source: Because the traps are disabled, this context is useful for applications that prefer to have result value of ``NaN`` or ``Infinity`` instead of raising exceptions. This allows an application to complete a run in the presence of conditions that would otherwise halt the program.
pt_pt: Como as armadilhas estão desativadas, este contexto é útil para aplicações que preferem ter valores de resultado de ``NaN`` ou ``Infinity`` em vez de levantar exceções. Isto permite que uma aplicação complete uma execução na presença de condições que, de outra forma, parariam o programa.
ru: Поскольку ловушки отключены, этот контекст полезен для приложений, которые предпочитают иметь значение результата «NaN» или «Бесконечность» вместо создания исключений. Это позволяет приложению завершить работу при наличии условий, которые в противном случае остановили бы программу.

source: This context is used by the :class:`Context` constructor as a prototype for new contexts. Changing a field (such a precision) has the effect of changing the default for new contexts created by the :class:`Context` constructor.
pt_pt: Este contexto é usado pelo construtor :class:`Context` como um protótipo para novos contextos. Alterar um campo (como a precisão) tem o efeito de alterar o valor predefinido para novos contextos criados pelo construtor :class:`Context`.
ru: Этот контекст используется конструктором :class:`Context` в качестве прототипа для новых контекстов. Изменение поля (такая точность) приводит к изменению значения по умолчанию для новых контекстов, созданных конструктором :class:`Context`.

source: This context is most useful in multi-threaded environments. Changing one of the fields before threads are started has the effect of setting system-wide defaults. Changing the fields after threads have started is not recommended as it would require thread synchronization to prevent race conditions.
pt_pt: Este contexto é mais útil em ambientes multi-thread. Alterar um dos campos antes de as threads serem iniciadas tem o efeito de definir valores predefinidos em todo o sistema. Alterar os campos após as threads terem sido iniciadas não é recomendado, pois exigiria sincronização de threads para evitar condições de corrida.
ru: Этот контекст наиболее полезен в многопоточных средах. Изменение одного из полей до запуска потоков приводит к установке общесистемных значений по умолчанию. Изменение полей после запуска потоков не рекомендуется, так как для предотвращения состояний гонки потребуется синхронизация потоков.

source: In single threaded environments, it is preferable to not use this context at all. Instead, simply create contexts explicitly as described below.
pt_pt: Em ambientes de thread única, é preferível não usar este contexto de todo. Em vez disso, simplesmente crie contextos explicitamente como descrito abaixo.
ru: В однопоточных средах предпочтительно вообще не использовать этот контекст. Вместо этого просто создайте контексты явно, как описано ниже.

source: The default values are :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN`, and enabled traps for :class:`Overflow`, :class:`InvalidOperation`, and :class:`DivisionByZero`.
pt_pt: Os valores predefinidos são :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN`, e armadilhas ativadas para :class:`Overflow`, :class:`InvalidOperation` e :class:`DivisionByZero`.
ru: Значения по умолчанию: :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN` и включенные ловушки для :class:`Overflow`, :class:`InvalidOperation` и :class:`DivisionByZero`.

source: In addition to the three supplied contexts, new contexts can be created with the :class:`Context` constructor.
pt_pt: Além dos três contextos fornecidos, novos contextos podem ser criados com o construtor :class:`Context`.
ru: В дополнение к трем предоставленным контекстам, новые контексты могут быть созданы с помощью конструктора :class:`Context`.

source: Creates a new context. If a field is not specified or is :const:`None`, the default values are copied from the :const:`DefaultContext`. If the *flags* field is not specified or is :const:`None`, all flags are cleared.
pt_pt: Cria um novo contexto. Se um campo não for especificado ou for :const:`None`, os valores predefinidos são copiados do :const:`DefaultContext`. Se o campo *flags* não for especificado ou for :const:`None`, todas as flags são limpas.
ru: Создает новый контекст. Если поле не указано или имеет значение :const:`None`, значения по умолчанию копируются из :const:`DefaultContext`. Если поле *flags* не указано или имеет значение :const:`None`, все флаги очищаются.

source: An integer in the range [``1``, :const:`MAX_PREC`] that sets the precision for arithmetic operations in the context.
pt_pt: Um inteiro no intervalo [``1``, :const:`MAX_PREC`] que define a precisão para operações aritméticas no contexto.

source: One of the constants listed in the section `Rounding Modes`_.
pt_pt: Uma das constantes listadas na secção `Modos de Arredondamento`_.

source: Lists of any signals to be set. Generally, new contexts should only set traps and leave the flags clear.
pt_pt: Listas de quaisquer sinais a serem definidos. Geralmente, novos contextos devem definir apenas armadilhas e deixar as flags limpas.

source: Integers specifying the outer limits allowable for exponents. *Emin* must be in the range [:const:`MIN_EMIN`, ``0``], *Emax* in the range [``0``, :const:`MAX_EMAX`].
pt_pt: Inteiros que especificam os limites externos permitidos para expoentes. *Emin* deve estar no intervalo [:const:`MIN_EMIN`, ``0``], *Emax* no intervalo [``0``, :const:`MAX_EMAX`].

source: Either ``0`` or ``1`` (the default). If set to ``1``, exponents are printed with a capital ``E``; otherwise, a lowercase ``e`` is used: ``Decimal('6.02e+23')``.
pt_pt: Ou ``0`` ou ``1`` (o predefinido). Se definido como ``1``, os expoentes são impressos com um ``E`` maiúsculo; caso contrário, é usado um ``e`` minúsculo: ``Decimal('6.02e+23')``.

source: Either ``0`` (the default) or ``1``. If set to ``1``, the exponent ``e`` of a :class:`Decimal` instance representable in this context is strictly limited to the range ``Emin - prec + 1 <= e <= Emax - prec + 1``. If *clamp* is ``0`` then a weaker condition holds: the adjusted exponent of the :class:`Decimal` instance is at most :attr:`~Context.Emax`. When *clamp* is ``1``, a large normal number will, where possible, have its exponent reduced and a corresponding number of zeros added to its coefficient, in order to fit the exponent constraints; this preserves the value of the number but loses information about significant trailing zeros. For example::
pt_pt: Ou ``0`` (o predefinido) ou ``1``. Se definido como ``1``, o expoente ``e`` de uma instância :class:`Decimal` representável neste contexto é estritamente limitado ao intervalo ``Emin - prec + 1 <= e <= Emax - prec + 1``. Se *clamp* for ``0``, então uma condição mais fraca é mantida: o expoente ajustado da instância :class:`Decimal` é no máximo :attr:`~Context.Emax`. Quando *clamp* é ``1``, um grande número normal terá, sempre que possível, o seu expoente reduzido e um número correspondente de zeros adicionados ao seu coeficiente, a fim de se ajustar às restrições do expoente; isto preserva o valor do número, mas perde informações sobre zeros significativos à direita. Por exemplo::

source: A *clamp* value of ``1`` allows compatibility with the fixed-width decimal interchange formats specified in IEEE 754.
pt_pt: Um valor de *clamp* de ``1`` permite compatibilidade com os formatos de intercâmbio decimal de largura fixa especificados no IEEE 754.
ru: Значение *clamp*, равное ``1``, обеспечивает совместимость с десятичными форматами обмена фиксированной шириной, указанными в IEEE 754.
