Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: The behavior of Python's comparison operators can be a little surprising where a ``NaN`` is involved. A test for equality where one of the operands is a quiet or signaling ``NaN`` always returns :const:`False` (even when doing ``Decimal('NaN')==Decimal('NaN')``), while a test for inequality always returns :const:`True`. An attempt to compare two Decimals using any of the ``<``, ``<=``, ``>`` or ``>=`` operators will raise the :exc:`InvalidOperation` signal if either operand is a ``NaN``, and return :const:`False` if this signal is not trapped. Note that the General Decimal Arithmetic specification does not specify the behavior of direct comparisons; these rules for comparisons involving a ``NaN`` were taken from the IEEE 854 standard (see Table 3 in section 5.7). To ensure strict standards-compliance, use the :meth:`~Decimal.compare` and :meth:`~Decimal.compare_signal` methods instead.
pt_pt: O comportamento dos operadores de comparação do Python pode ser um pouco surpreendente quando um ``NaN`` está envolvido. Um teste de igualdade em que um dos operandos é um ``NaN`` silencioso ou de sinalização sempre retorna :const:`False` (mesmo ao fazer ``Decimal('NaN')==Decimal('NaN')``), enquanto um teste de desigualdade sempre retorna :const:`True`. Uma tentativa de comparar dois Decimals usando qualquer um dos operadores ``<``, ``<=``, ``>`` ou ``>=`` levantará o sinal :exc:`InvalidOperation` se algum dos operandos for um ``NaN``, e retornará :const:`False` se este sinal não for capturado. Note que a especificação de Aritmética Decimal Geral não especifica o comportamento de comparações diretas; estas regras para comparações envolvendo um ``NaN`` foram retiradas do padrão IEEE 854 (ver Tabela 3 na secção 5.7). Para garantir conformidade estrita com os padrões, use os métodos :meth:`~Decimal.compare` e :meth:`~Decimal.compare_signal` em vez disso.
ru: Поведение операторов сравнения Python может быть немного неожиданным, когда речь идет о NaN. Проверка на равенство, когда один из операндов является тихим или сигнальным ``NaN``, всегда возвращает :const:`False` (даже при выполнении ``Decimal('NaN')==Decimal('NaN')``) , тогда как проверка на неравенство всегда возвращает :const:`True`. Попытка сравнить два десятичных числа с помощью любого из операторов ``<``, ``<=``, ``>`` или ``>=`` вызовет сигнал :exc:`InvalidOperation`, если любой из операндов равен ``NaN`` и верните :const:`False`, если этот сигнал не перехвачен. Обратите внимание, что спецификация общей десятичной арифметики не определяет поведение прямых сравнений; эти правила сравнений с использованием NaN были взяты из стандарта IEEE 854 (см. Таблицу 3 в разделе 5.7). Чтобы обеспечить строгое соответствие стандартам, вместо этого используйте методы :meth:`~Decimal.compare` и :meth:`~Decimal.compare_signal`.

source: The signed zeros can result from calculations that underflow. They keep the sign that would have resulted if the calculation had been carried out to greater precision. Since their magnitude is zero, both positive and negative zeros are treated as equal and their sign is informational.
pt_pt: Os zeros assinados podem resultar de cálculos que sofrem underflow. Eles mantêm o sinal que teria resultado se o cálculo tivesse sido realizado com maior precisão. Uma vez que a sua magnitude é zero, tanto os zeros positivos como negativos são tratados como iguais e o seu sinal é informativo.
ru: Знаковые нули могут быть результатом вычислений, которые заканчиваются. Они сохраняют тот знак, который получился бы, если бы расчет проводился с большей точностью. Поскольку их величина равна нулю, как положительные, так и отрицательные нули считаются равными, а их знак является информационным.

source: In addition to the two signed zeros which are distinct yet equal, there are various representations of zero with differing precisions yet equivalent in value. This takes a bit of getting used to. For an eye accustomed to normalized floating-point representations, it is not immediately obvious that the following calculation returns a value equal to zero:
pt_pt: Além dos dois zeros assinados, que são distintos mas iguais, existem várias representações de zero com precisões diferentes, mas equivalentes em valor. Isto requer algum tempo para se habituar. Para um olho acostumado a representações de vírgula flutuante normalizadas, não é imediatamente óbvio que o seguinte cálculo retorna um valor igual a zero:

source: Working with threads
pt_pt: A trabalhar com threads
ru: Работа с потоками

source: The :func:`getcontext` function accesses a different :class:`Context` object for each thread. Having separate thread contexts means that threads may make changes (such as ``getcontext().prec=10``) without interfering with other threads.
pt_pt: A função :func:`getcontext` acede a um objeto :class:`Context` diferente para cada thread. Ter contextos de thread separados significa que as threads podem fazer alterações (como ``getcontext().prec=10``) sem interferir com outras threads.
ru: Функция :func:`getcontext` обращается к разным объектам :class:`Context` для каждого потока. Наличие отдельных контекстов потоков означает, что потоки могут вносить изменения (например, getcontext().prec=10), не мешая другим потокам.

source: Likewise, the :func:`setcontext` function automatically assigns its target to the current thread.
pt_pt: Da mesma forma, a função :func:`setcontext` atribui automaticamente o seu alvo à thread atual.
ru: Аналогично, функция :func:`setcontext` автоматически назначает свою цель текущему потоку.

source: # Set applicationwide defaults for all threads about to be launched DefaultContext.prec = 12 DefaultContext.rounding = ROUND_DOWN DefaultContext.traps = ExtendedContext.traps.copy() DefaultContext.traps[InvalidOperation] = 1 setcontext(DefaultContext) # Afterwards, the threads can be started t1.start() t2.start() t3.start() . . .
pt_pt: # Definir valores predefinidos para toda a aplicação para todas as threads prestes a serem lançadas DefaultContext.prec = 12 DefaultContext.rounding = ROUND_DOWN DefaultContext.traps = ExtendedContext.traps.copy() DefaultContext.traps[InvalidOperation] = 1 setcontext(DefaultContext) # Depois, as threads podem ser iniciadas t1.start() t2.start() t3.start() . . .

source: Recipes
pt_pt: Receitas
ru: Рецепты

source: Here are a few recipes that serve as utility functions and that demonstrate ways to work with the :class:`Decimal` class::
pt_pt: Aqui estão algumas receitas que servem como funções utilitárias e que demonstram formas de trabalhar com a classe :class:`Decimal`::
ru: Вот несколько рецептов, которые служат служебными функциями и демонстрируют способы работы с классом :class:`Decimal`::

source: def moneyfmt(value, places=2, curr='', sep=',', dp='.', pos='', neg='-', trailneg=''): """Convert Decimal to a money formatted string. places: required number of places after the decimal point curr: optional currency symbol before the sign (may be blank) sep: optional grouping separator (comma, period, space, or blank) dp: decimal point indicator (comma or period) only specify as blank when places is zero pos: optional sign for positive numbers: '+', space or blank neg: optional sign for negative numbers: '-', '(', space or blank trailneg:optional trailing minus indicator: '-', ')', space or blank >>> d = Decimal('-1234567.8901') >>> moneyfmt(d, curr='$') '-$1,234,567.89' >>> moneyfmt(d, places=0, sep='.', dp='', neg='', trailneg='-') '1.234.568-' >>> moneyfmt(d, curr='$', neg='(', trailneg=')') '($1,234,567.89)' >>> moneyfmt(Decimal(123456789), sep=' ') '123 456 789.00' >>> moneyfmt(Decimal('-0.02'), neg='<', trailneg='>') '<0.02>' """ q = Decimal(10) ** -places # 2 places --> '0.01' sign, digits, exp = value.quantize(q).as_tuple() result = [] digits = list(map(str, digits)) build, next = result.append, digits.pop if sign: build(trailneg) for i in range(places): build(next() if digits else '0') if places: build(dp) if not digits: build('0') i = 0 while digits: build(next()) i += 1 if i == 3 and digits: i = 0 build(sep) build(curr) build(neg if sign else pos) return ''.join(reversed(result)) def pi(): """Compute Pi to the current precision. >>> print(pi()) 3.141592653589793238462643383 """ getcontext().prec += 2 # extra digits for intermediate steps three = Decimal(3) # substitute "three=3.0" for regular floats lasts, t, s, n, na, d, da = 0, three, 3, 1, 0, 0, 24 while s != lasts: lasts = s n, na = n+na, na+8 d, da = d+da, da+32 t = (t * n) / d s += t getcontext().prec -= 2 return +s # unary plus applies the new precision def exp(x): """Return e raised to the power of x. Result type matches input type. >>> print(exp(Decimal(1))) 2.718281828459045235360287471 >>> print(exp(Decimal(2))) 7.389056098930650227230427461 >>> print(exp(2.0)) 7.38905609893 >>> print(exp(2+0j)) (7.38905609893+0j) """ getcontext().prec += 2 i, lasts, s, fact, num = 0, 0, 1, 1, 1 while s != lasts: lasts = s i += 1 fact *= i num *= x s += num / fact getcontext().prec -= 2 return +s def cos(x): """Return the cosine of x as measured in radians. The Taylor series approximation works best for a small value of x. For larger values, first compute x = x % (2 * pi). >>> print(cos(Decimal('0.5'))) 0.8775825618903727161162815826 >>> print(cos(0.5)) 0.87758256189 >>> print(cos(0.5+0j)) (0.87758256189+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 0, 0, 1, 1, 1, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s def sin(x): """Return the sine of x as measured in radians. The Taylor series approximation works best for a small value of x. For larger values, first compute x = x % (2 * pi). >>> print(sin(Decimal('0.5'))) 0.4794255386042030002732879352 >>> print(sin(0.5)) 0.479425538604 >>> print(sin(0.5+0j)) (0.479425538604+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 1, 0, x, 1, x, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s
pt_pt: def moneyfmt(value, places=2, curr='', sep=',', dp='.', pos='', neg='-', trailneg=''): """Converte Decimal para uma string formatada como moeda. places: número necessário de casas após o ponto decimal curr: símbolo de moeda opcional antes do sinal (pode estar vazio) sep: separador de agrupamento opcional (vírgula, ponto, espaço ou vazio) dp: indicador de ponto decimal (vírgula ou ponto) só especificar como vazio quando places é zero pos: sinal opcional para números positivos: '+', espaço ou vazio neg: sinal opcional para números negativos: '-', '(', espaço ou vazio trailneg:indicador de menos à direita opcional: '-', ')', espaço ou vazio >>> d = Decimal('-1234567.8901') >>> moneyfmt(d, curr='$') '-$1,234,567.89' >>> moneyfmt(d, places=0, sep='.', dp='', neg='', trailneg='-') '1.234.568-' >>> moneyfmt(d, curr='$', neg='(', trailneg=')') '($1,234,567.89)' >>> moneyfmt(Decimal(123456789), sep=' ') '123 456 789.00' >>> moneyfmt(Decimal('-0.02'), neg='<', trailneg='>') '<0.02>' """ q = Decimal(10) ** -places # 2 casas --> '0.01' sign, digits, exp = value.quantize(q).as_tuple() result = [] digits = list(map(str, digits)) build, next = result.append, digits.pop if sign: build(trailneg) for i in range(places): build(next() if digits else '0') if places: build(dp) if not digits: build('0') i = 0 while digits: build(next()) i += 1 if i == 3 and digits: i = 0 build(sep) build(curr) build(neg if sign else pos) return ''.join(reversed(result)) def pi(): """Calcula Pi com a precisão atual. >>> print(pi()) 3.141592653589793238462643383 """ getcontext().prec += 2 # dígitos extra para passos intermédios three = Decimal(3) # substituir "three=3.0" para floats normais lasts, t, s, n, na, d, da = 0, three, 3, 1, 0, 0, 24 while s != lasts: lasts = s n, na = n+na, na+8 d, da = d+da, da+32 t = (t * n) / d s += t getcontext().prec -= 2 return +s # mais unário aplica a nova precisão def exp(x): """Retorna e elevado à potência de x. O tipo do resultado corresponde ao tipo de entrada. >>> print(exp(Decimal(1))) 2.718281828459045235360287471 >>> print(exp(Decimal(2))) 7.389056098930650227230427461 >>> print(exp(2.0)) 7.38905609893 >>> print(exp(2+0j)) (7.38905609893+0j) """ getcontext().prec += 2 i, lasts, s, fact, num = 0, 0, 1, 1, 1 while s != lasts: lasts = s i += 1 fact *= i num *= x s += num / fact getcontext().prec -= 2 return +s def cos(x): """Retorna o cosseno de x medido em radianos. A aproximação da série de Taylor funciona melhor para um valor pequeno de x. Para valores maiores, calcular primeiro x = x % (2 * pi). >>> print(cos(Decimal('0.5'))) 0.8775825618903727161162815826 >>> print(cos(0.5)) 0.87758256189 >>> print(cos(0.5+0j)) (0.87758256189+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 0, 0, 1, 1, 1, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s def sin(x): """Retorna o seno de x medido em radianos. A aproximação da série de Taylor funciona melhor para um valor pequeno de x. Para valores maiores, calcular primeiro x = x % (2 * pi). >>> print(sin(Decimal('0.5'))) 0.4794255386042030002732879352 >>> print(sin(0.5)) 0.479425538604 >>> print(sin(0.5+0j)) (0.4779425538604+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 1, 0, x, 1, x, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s

source: Decimal FAQ
pt_pt: FAQ do Decimal
ru: ЧаВо по десятичным дробям

source: Q. It is cumbersome to type ``decimal.Decimal('1234.5')``. Is there a way to minimize typing when using the interactive interpreter?
pt_pt: P. É trabalhoso digitar ``decimal.Decimal('1234.5')``. Existe uma forma de minimizar a digitação ao usar o interpretador interativo?
ru: Вопрос. Вводить ``decimal.Decimal('1234.5')`` неудобно. Есть ли способ свести к минимуму набор текста при использовании интерактивного переводчика?

source: A. Some users abbreviate the constructor to just a single letter:
pt_pt: R. Alguns utilizadores abreviam o construtor para apenas uma letra:
ru: О. Некоторые пользователи сокращают конструктор до одной буквы:

source: Q. In a fixed-point application with two decimal places, some inputs have many places and need to be rounded. Others are not supposed to have excess digits and need to be validated. What methods should be used?
pt_pt: P. Numa aplicação de ponto fixo com duas casas decimais, algumas entradas têm muitas casas e precisam de ser arredondadas. Outras não devem ter dígitos em excesso e precisam de ser validadas. Que métodos devem ser usados?
ru: Вопрос. В приложении с фиксированной запятой и двумя десятичными знаками некоторые входные данные имеют много знаков и их необходимо округлять. Другие не должны иметь лишних цифр и должны быть проверены. Какие методы следует использовать?

source: A. The :meth:`~Decimal.quantize` method rounds to a fixed number of decimal places. If the :const:`Inexact` trap is set, it is also useful for validation:
pt_pt: R. O método :meth:`~Decimal.quantize` arredonda para um número fixo de casas decimais. Se a armadilha :const:`Inexact` estiver definida, também é útil para validação:
ru: О. Метод :meth:`~Decimal.quantize` округляет до фиксированного количества десятичных знаков. Если установлена ​​ловушка :const:`Inexact`, она также полезна для проверки:

source: Q. Once I have valid two place inputs, how do I maintain that invariant throughout an application?
pt_pt: P. Uma vez que tenho entradas válidas com duas casas decimais, como mantenho esse invariante em toda a aplicação?
ru: Вопрос. Если у меня есть действительные входные данные из двух мест, как мне сохранить этот инвариант во всем приложении?

source: A. Some operations like addition, subtraction, and multiplication by an integer will automatically preserve fixed point. Others operations, like division and non-integer multiplication, will change the number of decimal places and need to be followed-up with a :meth:`~Decimal.quantize` step:
pt_pt: R. Algumas operações, como adição, subtração e multiplicação por um inteiro, preservarão automaticamente o ponto fixo. Outras operações, como divisão e multiplicação não inteira, alterarão o número de casas decimais e precisam de ser seguidas por um passo :meth:`~Decimal.quantize`:
ru: Ответ. Некоторые операции, такие как сложение, вычитание и умножение на целое число, автоматически сохраняют фиксированную точку. Другие операции, такие как деление и нецелое умножение, изменят количество десятичных знаков и должны сопровождаться шагом :meth:`~Decimal.quantize`:

source: In developing fixed-point applications, it is convenient to define functions to handle the :meth:`~Decimal.quantize` step:
pt_pt: No desenvolvimento de aplicações de ponto fixo, é conveniente definir funções para lidar com o passo :meth:`~Decimal.quantize`:
ru: При разработке приложений с фиксированной точкой удобно определять функции для обработки шага :meth:`~Decimal.quantize`:

source: Q. There are many ways to express the same value. The numbers ``200``, ``200.000``, ``2E2``, and ``.02E+4`` all have the same value at various precisions. Is there a way to transform them to a single recognizable canonical value?
pt_pt: P. Existem muitas formas de expressar o mesmo valor. Os números ``200``, ``200.000``, ``2E2`` e ``.02E+4`` têm todos o mesmo valor em várias precisões. Existe uma forma de os transformar num único valor canónico reconhecível?
ru: Вопрос. Есть много способов выразить одну и ту же ценность. Числа ``200``, ``200.000``, ``2E2`` и ``.02E+4`` имеют одно и то же значение с различной точностью. Есть ли способ преобразовать их в одно узнаваемое каноническое значение?

source: A. The :meth:`~Decimal.normalize` method maps all equivalent values to a single representative:
pt_pt: R. O método :meth:`~Decimal.normalize` mapeia todos os valores equivalentes para um único representante:
ru: А. Метод :meth:`~Decimal.normalize` сопоставляет все эквивалентные значения одному представителю:

source: Q. When does rounding occur in a computation?
pt_pt: P. Quando é que o arredondamento ocorre num cálculo?
ru: Вопрос. Когда в вычислениях происходит округление?

source: A. It occurs *after* the computation. The philosophy of the decimal specification is that numbers are considered exact and are created independent of the current context. They can even have greater precision than current context. Computations process with those exact inputs and then rounding (or other context operations) is applied to the *result* of the computation::
pt_pt: R. Ocorre *depois* do cálculo. A filosofia da especificação decimal é que os números são considerados exatos e são criados independentemente do contexto atual. Eles podem até ter maior precisão do que o contexto atual. Os cálculos processam-se com essas entradas exatas e depois o arredondamento (ou outras operações de contexto) é aplicado ao *resultado* do cálculo::
ru: Ответ. Это происходит *после* вычислений. Философия десятичной спецификации заключается в том, что числа считаются точными и создаются независимо от текущего контекста. Они могут даже иметь большую точность, чем текущий контекст. Процесс вычислений с использованием этих точных входных данных, а затем к *результату* вычислений применяется округление (или другие контекстные операции):

source: >>> getcontext().prec = 5 >>> pi = Decimal('3.1415926535') # More than 5 digits >>> pi # All digits are retained Decimal('3.1415926535') >>> pi + 0 # Rounded after an addition Decimal('3.1416') >>> pi - Decimal('0.00005') # Subtract unrounded numbers, then round Decimal('3.1415') >>> pi + 0 - Decimal('0.00005'). # Intermediate values are rounded Decimal('3.1416')
pt_pt: >>> getcontext().prec = 5 >>> pi = Decimal('3.1415926535') # Mais de 5 dígitos >>> pi # Todos os dígitos são retidos Decimal('3.1415926535') >>> pi + 0 # Arredondado após uma adição Decimal('3.1416') >>> pi - Decimal('0.00005') # Subtrair números não arredondados, depois arredondar Decimal('3.1415') >>> pi + 0 - Decimal('0.00005') # Valores intermédios são arredondados Decimal('3.1416')

source: Q. Some decimal values always print with exponential notation. Is there a way to get a non-exponential representation?
pt_pt: P. Alguns valores decimais são sempre impressos com notação exponencial. Existe uma forma de obter uma representação não exponencial?
ru: Вопрос. Некоторые десятичные значения всегда печатаются в экспоненциальном представлении. Есть ли способ получить неэкспоненциальное представление?

source: A. For some values, exponential notation is the only way to express the number of significant places in the coefficient. For example, expressing ``5.0E+3`` as ``5000`` keeps the value constant but cannot show the original's two-place significance.
pt_pt: R. Para alguns valores, a notação exponencial é a única forma de expressar o número de casas significativas no coeficiente. Por exemplo, expressar ``5.0E+3`` como ``5000`` mantém o valor constante, mas não pode mostrar a significância de duas casas do original.
ru: А. Для некоторых значений экспоненциальная запись является единственным способом выразить количество значимых мест в коэффициенте. Например, выражение ``5.0E+3`` как ``5000`` сохраняет значение постоянным, но не может показать двухзначное значение оригинала.

source: If an application does not care about tracking significance, it is easy to remove the exponent and trailing zeroes, losing significance, but keeping the value unchanged:
pt_pt: Se uma aplicação não se preocupa em rastrear a significância, é fácil remover o expoente e os zeros à direita, perdendo a significância, mas mantendo o valor inalterado:
ru: Если приложение не заботится об отслеживании значимости, можно легко удалить показатель степени и конечные нули, потеряв значимость, но сохранив значение неизменным:

source: Q. Is there a way to convert a regular float to a :class:`Decimal`?
pt_pt: P. Existe uma forma de converter um float regular para um :class:`Decimal`?
ru: Вопрос. Есть ли способ преобразовать обычное число с плавающей запятой в :class:`Decimal`?

source: A. Yes, any binary floating-point number can be exactly expressed as a Decimal though an exact conversion may take more precision than intuition would suggest:
pt_pt: R. Sim, qualquer número de vírgula flutuante binária pode ser expresso exatamente como um Decimal, embora uma conversão exata possa exigir mais precisão do que a intuição sugeriria:

source: Q. Within a complex calculation, how can I make sure that I haven't gotten a spurious result because of insufficient precision or rounding anomalies.
pt_pt: P. Dentro de um cálculo complexo, como posso ter a certeza de que não obtive um resultado espúrio devido a precisão insuficiente ou anomalias de arredondamento?
ru: Вопрос. Как я могу убедиться в том, что при сложном расчете я не получил ложный результат из-за недостаточной точности или аномалий округления?
