Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: :mod:`!decimal` --- Decimal fixed-point and floating-point arithmetic
pt_pt: :mod:`!decimal` — Aritmética decimal de ponto fixo e de vírgula flutuante

source: **Source code:** :source:`Lib/decimal.py`
pt_pt: **Código-fonte:** :source:`Lib/decimal.py`
ru: **Исходный код:** :source:`Lib/decimal.py`

source: The :mod:`decimal` module provides support for fast correctly rounded decimal floating-point arithmetic. It offers several advantages over the :class:`float` datatype:
pt_pt: O módulo :mod:`decimal` fornece suporte para aritmética decimal de vírgula flutuante rápida e corretamente arredondada. Oferece várias vantagens em relação ao tipo de dados :class:`float`:

source: Decimal "is based on a floating-point model which was designed with people in mind, and necessarily has a paramount guiding principle -- computers must provide an arithmetic that works in the same way as the arithmetic that people learn at school." -- excerpt from the decimal arithmetic specification.
pt_pt: A aritmética decimal "é baseada num modelo de vírgula flutuante que foi concebido tendo as pessoas em mente, e tem necessariamente um princípio orientador primordial — os computadores devem fornecer uma aritmética que funcione da mesma forma que a aritmética que as pessoas aprendem na escola." — excerto da especificação da aritmética decimal.
ru: Десятичная система «основана на модели с плавающей запятой, которая была разработана с учетом потребностей людей и обязательно имеет главный руководящий принцип: компьютеры должны обеспечивать арифметику, которая работает так же, как арифметика, которую люди изучают в школе». -- отрывок из спецификации десятичной арифметики.

source: Decimal numbers can be represented exactly. In contrast, numbers like ``1.1`` and ``2.2`` do not have exact representations in binary floating point. End users typically would not expect ``1.1 + 2.2`` to display as ``3.3000000000000003`` as it does with binary floating point.
pt_pt: Os números decimais podem ser representados exatamente. Em contraste, números como ``1.1`` e ``2.2`` não têm representações exatas em vírgula flutuante binária. Os utilizadores finais tipicamente não esperariam que ``1.1 + 2.2`` fosse apresentado como ``3.3000000000000003`` como acontece com a vírgula flutuante binária.
ru: Десятичные числа могут быть представлены точно. Напротив, числа типа «1.1» и «2.2» не имеют точного представления в двоичном формате с плавающей запятой. Конечные пользователи обычно не ожидают, что ``1.1 + 2.2`` будет отображаться как ``3.3000000000000003``, как это происходит с двоичной плавающей запятой.

source: The exactness carries over into arithmetic. In decimal floating point, ``0.1 + 0.1 + 0.1 - 0.3`` is exactly equal to zero. In binary floating point, the result is ``5.5511151231257827e-017``. While near to zero, the differences prevent reliable equality testing and differences can accumulate. For this reason, decimal is preferred in accounting applications which have strict equality invariants.
pt_pt: A exatidão estende-se à aritmética. Em vírgula flutuante decimal, ``0.1 + 0.1 + 0.1 - 0.3`` é exatamente igual a zero. Em vírgula flutuante binária, o resultado é ``5.5511151231257827e-017``. Embora próximo de zero, as diferenças impedem testes de igualdade fiáveis e as diferenças podem acumular-se. Por esta razão, o decimal é preferido em aplicações de contabilidade que têm invariantes de igualdade estritos.
ru: Точность переносится и на арифметику. В десятичном формате с плавающей запятой ``0,1 + 0,1 + 0,1 - 0,3`` точно равно нулю. В двоичном формате с плавающей запятой результат будет ``5.5511151231257827e-017``. Несмотря на то, что различия близки к нулю, они препятствуют надежному тестированию на равенство, и различия могут накапливаться. По этой причине десятичное число предпочтительнее в бухгалтерских приложениях, которые имеют строгие инварианты равенства.

source: The decimal module incorporates a notion of significant places so that ``1.30 + 1.20`` is ``2.50``. The trailing zero is kept to indicate significance. This is the customary presentation for monetary applications. For multiplication, the "schoolbook" approach uses all the figures in the multiplicands. For instance, ``1.3 * 1.2`` gives ``1.56`` while ``1.30 * 1.20`` gives ``1.5600``.
pt_pt: O módulo decimal incorpora uma noção de casas significativas, de modo que ``1.30 + 1.20`` é ``2.50``. O zero à direita é mantido para indicar significância. Esta é a apresentação habitual para aplicações monetárias. Para a multiplicação, a abordagem "escolar" usa todas as figuras nos multiplicandos. Por exemplo, ``1.3 * 1.2`` dá ``1.56`` enquanto ``1.30 * 1.20`` dá ``1.5600``.
ru: Десятичный модуль включает в себя понятие значащих знаков, так что «1,30 + 1,20» равно «2,50». Конечный ноль сохраняется для обозначения значимости. Это обычное представление денежных приложений. Для умножения в «учебном» подходе используются все числа множимого. Например, «1,3 * 1,2» дает «1,56», а «1,30 * 1,20» дает «1,5600».

source: Unlike hardware based binary floating point, the decimal module has a user alterable precision (defaulting to 28 places) which can be as large as needed for a given problem:
pt_pt: Ao contrário da vírgula flutuante binária baseada em hardware, o módulo decimal tem uma precisão alterável pelo utilizador (predefinida para 28 casas) que pode ser tão grande quanto necessário para um dado problema:
ru: В отличие от аппаратного двоичного числа с плавающей запятой, десятичный модуль имеет изменяемую пользователем точность (по умолчанию 28 знаков), которая может быть настолько большой, насколько это необходимо для конкретной задачи:

source: Both binary and decimal floating point are implemented in terms of published standards. While the built-in float type exposes only a modest portion of its capabilities, the decimal module exposes all required parts of the standard. When needed, the programmer has full control over rounding and signal handling. This includes an option to enforce exact arithmetic by using exceptions to block any inexact operations.
pt_pt: Tanto a vírgula flutuante binária como a decimal são implementadas em termos de padrões publicados. Embora o tipo float integrado exponha apenas uma parte modesta das suas capacidades, o módulo decimal expõe todas as partes necessárias do padrão. Quando necessário, o programador tem controle total sobre o arredondamento e o tratamento de sinais. Isto inclui uma opção para impor aritmética exata usando exceções para bloquear quaisquer operações inexatas.
ru: Как двоичные, так и десятичные числа с плавающей запятой реализованы в соответствии с опубликованными стандартами. В то время как встроенный тип float предоставляет лишь скромную часть своих возможностей, модуль decimal предоставляет все необходимые части стандарта. При необходимости программист имеет полный контроль над округлением и обработкой сигналов. Сюда входит возможность обеспечить точную арифметику с помощью исключений для блокировки любых неточных операций.

source: The decimal module was designed to support "without prejudice, both exact unrounded decimal arithmetic (sometimes called fixed-point arithmetic) and rounded floating-point arithmetic." -- excerpt from the decimal arithmetic specification.
pt_pt: O módulo decimal foi concebido para suportar "sem prejuízo, tanto a aritmética decimal exata não arredondada (por vezes chamada aritmética de ponto fixo) como a aritmética de vírgula flutuante arredondada." — excerto da especificação da aritmética decimal.
ru: Модуль decimal был разработан для поддержки «без ущерба как точной неокругленной десятичной арифметики (иногда называемой арифметикой с фиксированной запятой), так и округленной арифметики с плавающей запятой». -- отрывок из спецификации десятичной арифметики.

source: The module design is centered around three concepts: the decimal number, the context for arithmetic, and signals.
pt_pt: O design do módulo está centrado em três conceitos: o número decimal, o contexto para aritmética e os sinais.
ru: Дизайн модуля основан на трех концепциях: десятичном числе, контексте арифметики и сигналах.

source: A decimal number is immutable. It has a sign, coefficient digits, and an exponent. To preserve significance, the coefficient digits do not truncate trailing zeros. Decimals also include special values such as ``Infinity``, ``-Infinity``, and ``NaN``. The standard also differentiates ``-0`` from ``+0``.
pt_pt: Um número decimal é imutável. Tem um sinal, dígitos de coeficiente e um expoente. Para preservar a significância, os dígitos do coeficiente não truncam zeros à direita. Os decimais também incluem valores especiais como ``Infinity``, ``-Infinity`` e ``NaN``. O padrão também diferencia ``-0`` de ``+0``.
ru: Десятичное число неизменно. Он имеет знак, цифры коэффициента и показатель степени. Чтобы сохранить значимость, цифры коэффициента не обрезают конечные нули. Десятичные числа также включают специальные значения, такие как «Бесконечность», «-Бесконечность» и «NaN». Стандарт также отличает ``-0`` от ``+0``.

source: The context for arithmetic is an environment specifying precision, rounding rules, limits on exponents, flags indicating the results of operations, and trap enablers which determine whether signals are treated as exceptions. Rounding options include :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP`, and :const:`ROUND_05UP`.
pt_pt: O contexto para aritmética é um ambiente que especifica precisão, regras de arredondamento, limites nos expoentes, flags que indicam os resultados das operações e ativadores de armadilhas que determinam se os sinais são tratados como exceções. As opções de arredondamento incluem :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP` e :const:`ROUND_05UP`.
ru: Контекстом для арифметических операций является среда, определяющая точность, правила округления, ограничения на показатели степени, флаги, указывающие результаты операций, и активаторы ловушек, которые определяют, рассматриваются ли сигналы как исключения. Параметры округления включают :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP` ` и :const:`ROUND_05UP`.

source: Signals are groups of exceptional conditions arising during the course of computation. Depending on the needs of the application, signals may be ignored, considered as informational, or treated as exceptions. The signals in the decimal module are: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` and :const:`FloatOperation`.
pt_pt: Os sinais são grupos de condições excecionais que surgem durante o curso da computação. Dependendo das necessidades da aplicação, os sinais podem ser ignorados, considerados informativos ou tratados como exceções. Os sinais no módulo decimal são: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` e :const:`FloatOperation`.
ru: Сигналы — это группы исключительных условий, возникающих в ходе вычислений. В зависимости от потребностей приложения сигналы могут игнорироваться, рассматриваться как информационные или рассматриваться как исключения. Сигналы в десятичном модуле: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` и :const:`FloatOperation`.

source: For each signal there is a flag and a trap enabler. When a signal is encountered, its flag is set to one, then, if the trap enabler is set to one, an exception is raised. Flags are sticky, so the user needs to reset them before monitoring a calculation.
pt_pt: Para cada sinal, existe uma flag e um ativador de armadilha. Quando um sinal é encontrado, a sua flag é definida para um, depois, se o ativador de armadilha for definido para um, uma exceção é levantada. As flags são persistentes, por isso o utilizador precisa de as redefinir antes de monitorizar um cálculo.
ru: Для каждого сигнала есть флаг и активатор ловушки. При обнаружении сигнала его флаг устанавливается в единицу, затем, если для активатора ловушки установлено значение 1, возникает исключение. Флаги закреплены, поэтому пользователю необходимо сбросить их перед наблюдением за расчетом.

source: IBM's General Decimal Arithmetic Specification, `The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_.
pt_pt: Especificação de Aritmética Decimal Geral da IBM, `The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_.
ru: Общая спецификация десятичной арифметики IBM, `Общая спецификация десятичной арифметики <https://speleotrove.com/decimal/decarith.html>`_.

source: Quick-start tutorial
pt_pt: Tutorial de início rápido

source: The usual start to using decimals is importing the module, viewing the current context with :func:`getcontext` and, if necessary, setting new values for precision, rounding, or enabled traps::
pt_pt: O início habitual para usar decimais é importar o módulo, visualizar o contexto atual com :func:`getcontext` e, se necessário, definir novos valores para precisão, arredondamento ou armadilhas ativadas::
ru: Обычное начало использования десятичных дробей — это импорт модуля, просмотр текущего контекста с помощью :func:`getcontext` и, при необходимости, установка новых значений точности, округления или включенных ловушек::

source: >>> from decimal import * >>> getcontext() Context(prec=28, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capitals=1, clamp=0, flags=[], traps=[Overflow, DivisionByZero, InvalidOperation]) >>> getcontext().prec = 7 # Set a new precision
pt_pt: >>> from decimal import * >>> getcontext() Context(prec=28, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capitals=1, clamp=0, flags=[], traps=[Overflow, DivisionByZero, InvalidOperation]) >>> getcontext().prec = 7 # Definir uma nova precisão

source: Decimal instances can be constructed from integers, strings, floats, or tuples. Construction from an integer or a float performs an exact conversion of the value of that integer or float. Decimal numbers include special values such as ``NaN`` which stands for "Not a number", positive and negative ``Infinity``, and ``-0``::
pt_pt: Instâncias decimais podem ser construídas a partir de inteiros, strings, floats ou tuplos. A construção a partir de um inteiro ou float realiza uma conversão exata do valor desse inteiro ou float. Os números decimais incluem valores especiais como ``NaN`` que significa "Não é um número", ``Infinity`` positivo e negativo e ``-0``::
ru: Десятичные экземпляры могут быть созданы из целых чисел, строк, чисел с плавающей запятой или кортежей. Конструкция из целого числа или числа с плавающей запятой выполняет точное преобразование значения этого целого числа или числа с плавающей запятой. Десятичные числа включают специальные значения, такие как ``NaN``, что означает «Не число», положительные и отрицательные ``Бесконечность`` и ``-0``::

source: If the :exc:`FloatOperation` signal is trapped, accidental mixing of decimals and floats in constructors or ordering comparisons raises an exception::
pt_pt: Se o sinal :exc:`FloatOperation` for capturado, a mistura acidental de decimais e floats em construtores ou comparações de ordenação levanta uma exceção::
ru: Если сигнал :exc:`FloatOperation` перехвачен, случайное смешивание десятичных чисел и чисел с плавающей запятой в конструкторах или сравнениях порядка вызывает исключение::

source: The significance of a new Decimal is determined solely by the number of digits input. Context precision and rounding only come into play during arithmetic operations.
pt_pt: A significância de um novo Decimal é determinada unicamente pelo número de dígitos introduzidos. A precisão e o arredondamento do contexto só entram em jogo durante operações aritméticas.
ru: Значение новой десятичной дроби определяется исключительно количеством введенных цифр. Контекстная точность и округление играют роль только во время арифметических операций.

source: If the internal limits of the C version are exceeded, constructing a decimal raises :class:`InvalidOperation`::
pt_pt: Se os limites internos da versão C forem excedidos, a construção de um decimal levanta :class:`InvalidOperation`::
ru: Если внутренние ограничения версии C превышены, при построении десятичной дроби возникает :class:`InvalidOperation`::

source: Decimals interact well with much of the rest of Python. Here is a small decimal floating-point flying circus:
pt_pt: Os decimais interagem bem com grande parte do resto do Python. Aqui está um pequeno circo voador de vírgula flutuante decimal:

source: And some mathematical functions are also available to Decimal:
pt_pt: E algumas funções matemáticas também estão disponíveis para Decimal:
ru: И некоторые математические функции также доступны для Decimal:

source: The :meth:`~Decimal.quantize` method rounds a number to a fixed exponent. This method is useful for monetary applications that often round results to a fixed number of places:
pt_pt: O método :meth:`~Decimal.quantize` arredonda um número para um expoente fixo. Este método é útil para aplicações monetárias que frequentemente arredondam resultados para um número fixo de casas decimais:
ru: Метод :meth:`~Decimal.quantize` округляет число до фиксированной степени. Этот метод полезен для денежных приложений, которые часто округляют результаты до фиксированного количества знаков:

source: As shown above, the :func:`getcontext` function accesses the current context and allows the settings to be changed. This approach meets the needs of most applications.
pt_pt: Como mostrado acima, a função :func:`getcontext` acede ao contexto atual e permite que as definições sejam alteradas. Esta abordagem satisfaz as necessidades da maioria das aplicações.
ru: Как показано выше, функция :func:`getcontext` получает доступ к текущему контексту и позволяет изменять настройки. Этот подход удовлетворяет потребностям большинства приложений.

source: In accordance with the standard, the :mod:`decimal` module provides two ready to use standard contexts, :const:`BasicContext` and :const:`ExtendedContext`. The former is especially useful for debugging because many of the traps are enabled:
pt_pt: De acordo com o padrão, o módulo :mod:`decimal` fornece dois contextos padrão prontos a usar, :const:`BasicContext` e :const:`ExtendedContext`. O primeiro é especialmente útil para depuração porque muitas das armadilhas estão ativadas:
ru: В соответствии со стандартом модуль :mod:`decimal` предоставляет два готовых к использованию стандартных контекста: :const:`BasicContext` и :const:`ExtendedContext`. Первое особенно полезно для отладки, поскольку включены многие ловушки:

source: Contexts also have signal flags for monitoring exceptional conditions encountered during computations. The flags remain set until explicitly cleared, so it is best to clear the flags before each set of monitored computations by using the :meth:`~Context.clear_flags` method. ::
pt_pt: Os contextos também têm flags de sinal para monitorizar condições excecionais encontradas durante os cálculos. As flags permanecem definidas até serem explicitamente limpas, por isso é melhor limpar as flags antes de cada conjunto de cálculos monitorizados usando o método :meth:`~Context.clear_flags`. ::
ru: Контексты также имеют сигнальные флаги для мониторинга исключительных условий, возникающих во время вычислений. Флаги остаются установленными до тех пор, пока они не будут явно очищены, поэтому лучше всего очищать флаги перед каждым набором отслеживаемых вычислений, используя метод :meth:`~Context.clear_flags`. ::

source: The *flags* entry shows that the rational approximation to pi was rounded (digits beyond the context precision were thrown away) and that the result is inexact (some of the discarded digits were non-zero).
pt_pt: A entrada *flags* mostra que a aproximação racional de pi foi arredondada (dígitos além da precisão do contexto foram descartados) e que o resultado é inexato (alguns dos dígitos descartados eram não-zero).
ru: Запись *flags* показывает, что рациональное приближение числа «пи» было округлено (цифры, выходящие за рамки контекстной точности, были отброшены) и что результат неточен (некоторые из отброшенных цифр были ненулевыми).

source: Individual traps are set using the dictionary in the :attr:`~Context.traps` attribute of a context:
pt_pt: As armadilhas individuais são definidas usando o dicionário no atributo :attr:`~Context.traps` de um contexto:
ru: Отдельные ловушки устанавливаются с использованием словаря в атрибуте :attr:`~Context.traps` контекста:

source: Most programs adjust the current context only once, at the beginning of the program. And, in many applications, data is converted to :class:`Decimal` with a single cast inside a loop. With context set and decimals created, the bulk of the program manipulates the data no differently than with other Python numeric types.
pt_pt: A maioria dos programas ajusta o contexto atual apenas uma vez, no início do programa. E, em muitas aplicações, os dados são convertidos para :class:`Decimal` com um único cast dentro de um ciclo. Com o contexto definido e os decimais criados, a maior parte do programa manipula os dados de forma não diferente de outros tipos numéricos do Python.
ru: Большинство программ корректируют текущий контекст только один раз, в начале программы. И во многих приложениях данные преобразуются в :class:`Decimal` с помощью одного приведения внутри цикла. С установленным контекстом и созданными десятичными дробями основная часть программы манипулирует данными так же, как и с другими числовыми типами Python.

source: Decimal objects
pt_pt: Objetos Decimal
ru: Десятичные объекты

source: Construct a new :class:`Decimal` object based from *value*.
pt_pt: Constrói um novo objeto :class:`Decimal` com base em *value*.
ru: Создайте новый объект :class:`Decimal` на основе *value*.

source: *value* can be an integer, string, tuple, :class:`float`, or another :class:`Decimal` object. If no *value* is given, returns ``Decimal('0')``. If *value* is a string, it should conform to the decimal numeric string syntax after leading and trailing whitespace characters, as well as underscores throughout, are removed::
pt_pt: *value* pode ser um inteiro, string, tuplo, :class:`float` ou outro objeto :class:`Decimal`. Se nenhum *value* for dado, retorna ``Decimal('0')``. Se *value* for uma string, deve estar conforme a sintaxe de string numérica decimal após a remoção de caracteres de espaço em branco à esquerda e à direita, bem como sublinhados em todo o lado::
ru: *значение* может быть целым числом, строкой, кортежем, :class:`float` или другим :class:`Decimal` объектом. Если *значение* не указано, возвращается ``Decimal('0')``. Если *value* является строкой, она должна соответствовать синтаксису десятичной числовой строки после удаления начальных и конечных пробельных символов, а также символов подчеркивания::
