Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: pt_pt, ru

source: The :class:`Context` class defines several general purpose methods as well as a large number of methods for doing arithmetic directly in a given context. In addition, for each of the :class:`Decimal` methods described above (with the exception of the :meth:`~Decimal.adjusted` and :meth:`~Decimal.as_tuple` methods) there is a corresponding :class:`Context` method. For example, for a :class:`Context` instance ``C`` and :class:`Decimal` instance ``x``, ``C.exp(x)`` is equivalent to ``x.exp(context=C)``. Each :class:`Context` method accepts a Python integer (an instance of :class:`int`) anywhere that a Decimal instance is accepted.
pt_pt: A classe :class:`Context` define vários métodos de propósito geral, bem como um grande número de métodos para fazer aritmética diretamente num dado contexto. Além disso, para cada um dos métodos :class:`Decimal` descritos acima (com exceção dos métodos :meth:`~Decimal.adjusted` e :meth:`~Decimal.as_tuple`), existe um método correspondente :class:`Context`. Por exemplo, para uma instância :class:`Context` ``C`` e uma instância :class:`Decimal` ``x``, ``C.exp(x)`` é equivalente a ``x.exp(context=C)``. Cada método :class:`Context` aceita um inteiro Python (uma instância de :class:`int`) em qualquer lugar onde uma instância Decimal é aceita.
ru: Класс :class:`Context` определяет несколько методов общего назначения, а также большое количество методов для выполнения арифметических действий непосредственно в заданном контексте. Кроме того, для каждого из описанных выше методов :class:`Decimal` (за исключением методов :meth:`~Decimal.adjusted` и :meth:`~Decimal.as_tuple`) существует соответствующий :class: Метод «Контекст». Например, для экземпляра :class:`Context` ``C`` и :class:`Decimal` экземпляра ``x``, ``C.exp(x)`` эквивалентен ``x.exp( контекст=C)``. Каждый метод :class:`Context` принимает целое число Python (экземпляр :class:`int`) везде, где принимается экземпляр Decimal.

source: Resets all of the flags to ``0``.
pt_pt: Redefine todas as flags para ``0``.
ru: Сбрасывает все флаги в «0».

source: Resets all of the traps to ``0``.
pt_pt: Redefine todas as armadilhas para ``0``.
ru: Сбрасывает все ловушки в «0».

source: Return a duplicate of the context.
pt_pt: Retorna uma duplicata do contexto.
ru: Вернуть дубликат контекста.

source: Return a copy of the Decimal instance num.
pt_pt: Retorna uma cópia da instância Decimal num.
ru: Вернуть копию номера экземпляра Decimal.

source: Creates a new Decimal instance from *num* but using *self* as context. Unlike the :class:`Decimal` constructor, the context precision, rounding method, flags, and traps are applied to the conversion.
pt_pt: Cria uma nova instância Decimal a partir de *num*, mas usando *self* como contexto. Ao contrário do construtor :class:`Decimal`, a precisão do contexto, o método de arredondamento, as flags e as armadilhas são aplicadas à conversão.
ru: Создает новый экземпляр Decimal из *num*, но используя *self* в качестве контекста. В отличие от конструктора :class:`Decimal`, при преобразовании применяются точность контекста, метод округления, флаги и ловушки.

source: This is useful because constants are often given to a greater precision than is needed by the application. Another benefit is that rounding immediately eliminates unintended effects from digits beyond the current precision. In the following example, using unrounded inputs means that adding zero to a sum can change the result:
pt_pt: Isto é útil porque as constantes são frequentemente dadas com uma precisão maior do que a necessária pela aplicação. Outro benefício é que o arredondamento elimina imediatamente efeitos não intencionais de dígitos além da precisão atual. No exemplo seguinte, usar entradas não arredondadas significa que adicionar zero a uma soma pode alterar o resultado:
ru: Это полезно, поскольку константам часто присваивается более высокая точность, чем требуется приложению. Еще одним преимуществом является то, что округление немедленно устраняет непреднамеренные эффекты цифр, выходящих за рамки текущей точности. В следующем примере использование неокругленных входных данных означает, что добавление нуля к сумме может изменить результат:

source: This method implements the to-number operation of the IBM specification. If the argument is a string, no leading or trailing whitespace or underscores are permitted.
pt_pt: Este método implementa a operação to-number da especificação IBM. Se o argumento for uma string, não são permitidos espaços em branco ou sublinhados à esquerda ou à direita.
ru: Этот метод реализует операцию to-number спецификации IBM. Если аргумент является строкой, никакие начальные или конечные пробелы или символы подчеркивания не допускаются.

source: Creates a new Decimal instance from a float *f* but rounding using *self* as the context. Unlike the :meth:`Decimal.from_float` class method, the context precision, rounding method, flags, and traps are applied to the conversion.
pt_pt: Cria uma nova instância Decimal a partir de um float *f*, mas arredondando usando *self* como contexto. Ao contrário do método de classe :meth:`Decimal.from_float`, a precisão do contexto, o método de arredondamento, as flags e as armadilhas são aplicadas à conversão.
ru: Создает новый экземпляр Decimal из числа с плавающей запятой *f*, но округляет его, используя *self* в качестве контекста. В отличие от метода класса :meth:`Decimal.from_float`, при преобразовании применяются точность контекста, метод округления, флаги и ловушки.

source: Returns a value equal to ``Emin - prec + 1`` which is the minimum exponent value for subnormal results. When underflow occurs, the exponent is set to :const:`Etiny`.
pt_pt: Retorna um valor igual a ``Emin - prec + 1``, que é o valor mínimo do expoente para resultados subnormais. Quando ocorre underflow, o expoente é definido para :const:`Etiny`.
ru: Возвращает значение, равное ``Emin - prec + 1``, ​​которое является минимальным значением показателя степени для ненормальных результатов. Когда происходит опустошение, экспонента устанавливается на :const:`Etiny`.

source: Returns a value equal to ``Emax - prec + 1``.
pt_pt: Retorna um valor igual a ``Emax - prec + 1``.
ru: Возвращает значение, равное ``Emax - prec + 1``.

source: The usual approach to working with decimals is to create :class:`Decimal` instances and then apply arithmetic operations which take place within the current context for the active thread. An alternative approach is to use context methods for calculating within a specific context. The methods are similar to those for the :class:`Decimal` class and are only briefly recounted here.
pt_pt: A abordagem habitual para trabalhar com decimais é criar instâncias :class:`Decimal` e depois aplicar operações aritméticas que ocorrem dentro do contexto atual para a thread ativa. Uma abordagem alternativa é usar métodos de contexto para calcular dentro de um contexto específico. Os métodos são semelhantes aos da classe :class:`Decimal` e são apenas brevemente recontados aqui.
ru: Обычный подход к работе с десятичными числами заключается в создании экземпляров :class:`Decimal` и последующем применении арифметических операций, которые происходят в текущем контексте активного потока. Альтернативный подход — использовать контекстные методы для вычислений в конкретном контексте. Методы аналогичны методам класса :class:`Decimal` и здесь описаны лишь вкратце.

source: Returns the absolute value of *x*.
pt_pt: Retorna o valor absoluto de *x*.
ru: Возвращает абсолютное значение *x*.

source: Return the sum of *x* and *y*.
pt_pt: Retorna a soma de *x* e *y*.
ru: Вернуть сумму *x* и *y*.

source: Returns the same Decimal object *x*.
pt_pt: Retorna o mesmo objeto Decimal *x*.
ru: Возвращает тот же объект Decimal *x*.

source: Compares *x* and *y* numerically.
pt_pt: Compara *x* e *y* numericamete.
ru: Сравнивает *x* и *y* численно.

source: Compares the values of the two operands numerically.
pt_pt: Compara os valores dos dois operandos numericamete.
ru: Сравнивает значения двух операндов численно.

source: Compares two operands using their abstract representation.
pt_pt: Compara dois operandos usando a sua representação abstrata.
ru: Сравнивает два операнда, используя их абстрактное представление.

source: Compares two operands using their abstract representation, ignoring sign.
pt_pt: Compara dois operandos usando a sua representação abstrata, ignorando o sinal.
ru: Сравнивает два операнда, используя их абстрактное представление, игнорируя знак.

source: Returns a copy of *x* with the sign set to 0.
pt_pt: Retorna uma cópia de *x* com o sinal definido para 0.
ru: Возвращает копию *x* со знаком, равным 0.

source: Returns a copy of *x* with the sign inverted.
pt_pt: Retorna uma cópia de *x* com o sinal invertido.
ru: Возвращает копию *x* с инвертированным знаком.

source: Copies the sign from *y* to *x*.
pt_pt: Copia o sinal de *y* para *x*.
ru: Копирует знак из *y* в *x*.

source: Return *x* divided by *y*.
pt_pt: Retorna *x* dividido por *y*.
ru: Верните *x*, разделенное на *y*.

source: Return *x* divided by *y*, truncated to an integer.
pt_pt: Retorna *x* dividido por *y*, truncado para um inteiro.
ru: Возвращает *x*, разделенное на *y*, усеченное до целого числа.

source: Divides two numbers and returns the integer part of the result.
pt_pt: Divide dois números e retorna a parte inteira do resultado.
ru: Делит два числа и возвращает целую часть результата.

source: Returns ``e ** x``.
pt_pt: Retorna ``e ** x``.
ru: Возвращает ``e ** x``.

source: Returns *x* multiplied by *y*, plus *z*.
pt_pt: Retorna *x* multiplicado por *y*, mais *z*.
ru: Возвращает *x*, умноженное на *y* плюс *z*.

source: Returns ``True`` if *x* is canonical; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for canónico; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* является каноническим; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is finite; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for finito; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* конечно; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is infinite; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for infinito; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* бесконечно; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is a qNaN or sNaN; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for um qNaN ou sNaN; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* является qNaN или sNaN; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is a normal number; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for um número normal; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* — обычное число; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is a quiet NaN; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for um NaN silencioso; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* является молчаливым NaN; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is negative; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for negativo; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* отрицательное значение; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is a signaling NaN; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for um NaN de sinalização; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* является сигнальным NaN; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is subnormal; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for subnormal; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* ненормально; в противном случае возвращается ``False``.

source: Returns ``True`` if *x* is a zero; otherwise returns ``False``.
pt_pt: Retorna ``True`` se *x* for um zero; caso contrário, retorna ``False``.
ru: Возвращает ``True``, если *x* — ноль; в противном случае возвращается ``False``.

source: Returns the natural (base e) logarithm of *x*.
pt_pt: Retorna o logaritmo natural (base e) de *x*.
ru: Возвращает натуральный логарифм (по основанию e) числа *x*.

source: Returns the base 10 logarithm of *x*.
pt_pt: Retorna o logaritmo de base 10 de *x*.
ru: Возвращает десятичный логарифм числа *x*.

source: Returns the exponent of the magnitude of the operand's MSD.
pt_pt: Retorna o expoente da magnitude do MSD do operando.
ru: Возвращает показатель степени MSD операнда.

source: Applies the logical operation *and* between each operand's digits.
pt_pt: Aplica a operação lógica *and* entre cada dígito dos operandos.
ru: Применяет логическую операцию *и* между цифрами каждого операнда.

source: Invert all the digits in *x*.
pt_pt: Inverte todos os dígitos em *x*.
ru: Инвертируйте все цифры в *x*.

source: Applies the logical operation *or* between each operand's digits.
pt_pt: Aplica a operação lógica *or* entre cada dígito dos operandos.
ru: Применяет логическую операцию *или* между цифрами каждого операнда.

source: Applies the logical operation *xor* between each operand's digits.
pt_pt: Aplica a operação lógica *xor* entre cada dígito dos operandos.
ru: Применяет логическую операцию *xor* между цифрами каждого операнда.

source: Compares two values numerically and returns the maximum.
pt_pt: Compara dois valores numericamete e retorna o máximo.
ru: Сравнивает два значения численно и возвращает максимальное значение.

source: Compares the values numerically with their sign ignored.
pt_pt: Compara os valores numericamete ignorando o seu sinal.
ru: Сравнивает значения численно, их знак игнорируется.

source: Compares two values numerically and returns the minimum.
pt_pt: Compara dois valores numericamete e retorna o mínimo.
ru: Сравнивает два значения численно и возвращает минимум.

source: Minus corresponds to the unary prefix minus operator in Python.
pt_pt: Menos corresponde ao operador unário de prefixo menos em Python.
ru: Минус соответствует унарному префиксному оператору минус в Python.

source: Return the product of *x* and *y*.
pt_pt: Retorna o produto de *x* e *y*.
ru: Вернуть произведение *x* и *y*.

source: Returns the largest representable number smaller than *x*.
pt_pt: Retorna o maior número representável menor que *x*.
ru: Возвращает наибольшее представимое число, меньшее *x*.

source: Returns the smallest representable number larger than *x*.
pt_pt: Retorna o menor número representável maior que *x*.
ru: Возвращает наименьшее представимое число, большее *x*.

source: Returns the number closest to *x*, in direction towards *y*.
pt_pt: Retorna o número mais próximo de *x*, na direção de *y*.
ru: Возвращает число, ближайшее к *x*, в направлении *y*.

source: Reduces *x* to its simplest form.
pt_pt: Reduz *x* à sua forma mais simples.
ru: Приводит *x* к простейшей форме.

source: Returns an indication of the class of *x*.
pt_pt: Retorna uma indicação da classe de *x*.
ru: Возвращает указание класса *x*.

source: Plus corresponds to the unary prefix plus operator in Python. This operation applies the context precision and rounding, so it is *not* an identity operation.
pt_pt: Mais corresponde ao operador unário de prefixo mais em Python. Esta operação aplica a precisão e o arredondamento do contexto, por isso *não* é uma operação de identidade.
ru: Плюс соответствует унарному префиксу оператора плюс в Python. Эта операция применяет точность и округление контекста, поэтому она *не* является операцией идентификации.

source: Return ``x`` to the power of ``y``, reduced modulo ``modulo`` if given.
pt_pt: Retorna ``x`` elevado à potência de ``y``, reduzido módulo ``modulo``, se fornecido.
ru: Возвратите ``x`` в степень ``y``, уменьшенную по модулю ``modulo``, если задано.

source: With two arguments, compute ``x**y``. If ``x`` is negative then ``y`` must be integral. The result will be inexact unless ``y`` is integral and the result is finite and can be expressed exactly in 'precision' digits. The rounding mode of the context is used. Results are always correctly rounded in the Python version.
pt_pt: Com dois argumentos, calcula ``x**y``. Se ``x`` for negativo, então ``y`` deve ser integral. O resultado será inexato a menos que ``y`` seja integral e o resultado seja finito e possa ser expresso exatamente em 'precision' dígitos. O modo de arredondamento do contexto é usado. Os resultados são sempre corretamente arredondados na versão Python.
ru: С двумя аргументами вычислите ``x**y``. Если «x» отрицательно, то «y» должно быть целым. Результат будет неточным, если только ``y`` не является целым, а результат конечен и не может быть точно выражен в «точных» цифрах. Используется режим округления контекста. Результаты всегда правильно округляются в версии Python.

source: ``Decimal(0) ** Decimal(0)`` results in ``InvalidOperation``, and if ``InvalidOperation`` is not trapped, then results in ``Decimal('NaN')``.
pt_pt: ``Decimal(0) ** Decimal(0)`` resulta em ``InvalidOperation``, e se ``InvalidOperation`` não for capturado, então resulta em ``Decimal('NaN')``.
ru: ``Decimal(0) ** Decimal(0)`` приводит к ``InvalidOperation``, и если ``InvalidOperation`` не перехватывается, тогда получается ``Decimal('NaN')``.

source: The C module computes :meth:`power` in terms of the correctly rounded :meth:`exp` and :meth:`ln` functions. The result is well-defined but only "almost always correctly rounded".
pt_pt: O módulo C calcula :meth:`power` em termos das funções :meth:`exp` e :meth:`ln` corretamente arredondadas. O resultado é bem definido, mas apenas "quase sempre corretamente arredondado".
ru: Модуль C вычисляет :meth:`power` с помощью правильно округленных функций :meth:`exp` и :meth:`ln`. Результат четко определен, но только «почти всегда правильно округлен».

source: With three arguments, compute ``(x**y) % modulo``. For the three argument form, the following restrictions on the arguments hold:
pt_pt: Com três argumentos, calcula ``(x**y) % modulo``. Para a forma de três argumentos, as seguintes restrições aos argumentos aplicam-se:
ru: С тремя аргументами вычислите ``(x**y) % по модулю``. Для формы с тремя аргументами действуют следующие ограничения на аргументы:

source: all three arguments must be integral
pt_pt: todos os três argumentos devem ser integrais
ru: Все три аргумента должны быть целочисленными

source: ``y`` must be nonnegative
pt_pt: ``y`` deve ser não negativo
ru: ``y`` должно быть неотрицательным

source: at least one of ``x`` or ``y`` must be nonzero
pt_pt: pelo menos um de ``x`` ou ``y`` deve ser não zero
ru: хотя бы один из ``x`` или ``y`` должен быть ненулевым

source: ``modulo`` must be nonzero and have at most 'precision' digits
pt_pt: ``modulo`` deve ser não zero e ter no máximo 'precision' dígitos
ru: ``modulo`` должен быть ненулевым и содержать не более "точных" цифр.

source: The value resulting from ``Context.power(x, y, modulo)`` is equal to the value that would be obtained by computing ``(x**y) % modulo`` with unbounded precision, but is computed more efficiently. The exponent of the result is zero, regardless of the exponents of ``x``, ``y`` and ``modulo``. The result is always exact.
pt_pt: O valor resultante de ``Context.power(x, y, modulo)`` é igual ao valor que seria obtido calculando ``(x**y) % modulo`` com precisão ilimitada, mas é calculado de forma mais eficiente. O expoente do resultado é zero, independentemente dos expoentes de ``x``, ``y`` e ``modulo``. O resultado é sempre exato.
ru: Значение, полученное из ``Context.power(x, y, modulo)``, равно значению, которое было бы получено путем вычисления ``(x**y) % по модулю`` с неограниченной точностью, но вычисляется более эффективно. . Показатель степени результата равен нулю, независимо от показателей ``x``, ``y`` и ``по модулю``. Результат всегда точен.

source: Returns a value equal to *x* (rounded), having the exponent of *y*.
pt_pt: Retorna um valor igual a *x* (arredondado), tendo o expoente de *y*.
ru: Возвращает значение, равное *x* (округленное), с показателем степени *y*.

source: Just returns 10, as this is Decimal, :)
pt_pt: Apenas retorna 10, já que isto é Decimal, :)
ru: Просто возвращает 10, так как это десятичное число :)

source: Returns the remainder from integer division.
pt_pt: Retorna o resto da divisão inteira.
ru: Возвращает остаток от целочисленного деления.

source: The sign of the result, if non-zero, is the same as that of the original dividend.
pt_pt: O sinal do resultado, se não zero, é o mesmo que o do dividendo original.
ru: Знак результата, если он ненулевой, тот же, что и у исходного делимого.

source: Returns ``x - y * n``, where *n* is the integer nearest the exact value of ``x / y`` (if the result is 0 then its sign will be the sign of *x*).
pt_pt: Retorna ``x - y * n``, onde *n* é o inteiro mais próximo do valor exato de ``x / y`` (se o resultado for 0, então o seu sinal será o sinal de *x*).
ru: Возвращает ``x - y * n``, где *n* — целое число, ближайшее к точному значению ``x ​​/ y`` (если результат равен 0, то его знак будет знаком *x*).

source: Returns a rotated copy of *x*, *y* times.
pt_pt: Retorna uma cópia rotacionada de *x*, *y* vezes.
ru: Возвращает повернутую копию *x*, *y* раз.

source: Returns ``True`` if the two operands have the same exponent.
pt_pt: Retorna ``True`` se os dois operandos tiverem o mesmo expoente.
ru: Возвращает ``True``, если два операнда имеют одинаковую степень.

source: Returns the first operand after adding the second value its exp.
pt_pt: Retorna o primeiro operando após adicionar o segundo valor ao seu expoente.
ru: Возвращает первый операнд после добавления второго значения к его значению exp.

source: Returns a shifted copy of *x*, *y* times.
pt_pt: Retorna uma cópia deslocada de *x*, *y* vezes.
ru: Возвращает сдвинутую копию *x*, *y* раз.

source: Square root of a non-negative number to context precision.
pt_pt: Raiz quadrada de um número não negativo com a precisão do contexto.
ru: Квадратный корень из неотрицательного числа для точности контекста.

source: Return the difference between *x* and *y*.
pt_pt: Retorna a diferença entre *x* e *y*.
ru: Возвращает разницу между *x* и *y*.

source: Rounds to an integer.
pt_pt: Arredonda para um inteiro.
ru: Округляет до целого числа.

source: Converts a number to a string using scientific notation.
pt_pt: Converte um número para uma string usando notação científica.
ru: Преобразует число в строку, используя экспоненциальную запись.

source: Constants
pt_pt: Constantes
ru: Константы

source: The constants in this section are only relevant for the C module. They are also included in the pure Python version for compatibility.
pt_pt: As constantes nesta secção são relevantes apenas para o módulo C. Também estão incluídas na versão pura Python para compatibilidade.
ru: Константы в этом разделе относятся только к модулю C. Они также включены в чистую версию Python для совместимости.

source: The value is ``True``. Deprecated, because Python now always has threads.
pt_pt: O valor é ``True``. Obsoleto, porque o Python agora sempre tem threads.
ru: Значение ``True``. Устарело, поскольку в Python теперь всегда есть потоки.
