Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/dialog.po
Languages: sv

source: Tkinter Dialogs
sv: Tkinter-dialogrutor

source: :mod:`tkinter.simpledialog` --- Standard Tkinter input dialogs
sv: :mod:`tkinter.simpledialog` --- Tkinters standardinmatningsdialoger

source: **Source code:** :source:`Lib/tkinter/simpledialog.py`
sv: **Källkod:** :source:`Lib/tkinter/simpledialog.py`

source: The :mod:`tkinter.simpledialog` module contains convenience classes and functions for creating simple modal dialogs to get a value from the user.
sv: Modulen :mod:`tkinter.simpledialog` innehåller bekvämlighetsklasser och funktioner för att skapa enkla modala dialogrutor för att få ett värde från användaren.

source: The above three functions provide dialogs that prompt the user to enter a value of the desired type.
sv: De tre ovanstående funktionerna ger dialogrutor som uppmanar användaren att ange ett värde av önskad typ.

source: The base class for custom dialogs.
sv: Basklass för anpassade dialogrutor.

source: Override to construct the dialog's interface and return the widget that should have initial focus.
sv: Överstyrning för att konstruera dialogrutans gränssnitt och returnera den widget som ska ha första fokus.

source: Default behaviour adds OK and Cancel buttons. Override for custom button layouts.
sv: Standardbeteende lägger till OK- och Avbryt-knappar. Åsidosätt för anpassade knapplayouter.

source: :mod:`tkinter.filedialog` --- File selection dialogs
sv: :mod:`tkinter.filedialog` --- Dialogrutor för filval

source: **Source code:** :source:`Lib/tkinter/filedialog.py`
sv: **Källkod:** :source:`Lib/tkinter/filedialog.py`

source: The :mod:`tkinter.filedialog` module provides classes and factory functions for creating file/directory selection windows.
sv: Modulen :mod:`tkinter.filedialog` tillhandahåller klasser och fabriksfunktioner för att skapa fönster för val av filer och kataloger.

source: Native Load/Save Dialogs
sv: Inbyggda dialogrutor för ladda/spara

source: The following classes and functions provide file dialog windows that combine a native look-and-feel with configuration options to customize behaviour. The following keyword arguments are applicable to the classes and functions listed below:
sv: Följande klasser och funktioner tillhandahåller fildialogfönster som kombinerar ett inbyggt utseende och en inbyggd funktion med konfigurationsalternativ för att anpassa beteendet. Följande nyckelordsargument är tillämpliga på klasserna och funktionerna som listas nedan:

source: *parent* - the window to place the dialog on top of
sv: *parent* - fönstret som dialogrutan ska placeras ovanpå

source: *title* - the title of the window
sv: *title* - titeln på fönstret

source: *initialdir* - the directory that the dialog starts in
sv: *initialdir* - den katalog som dialogrutan startar i

source: *initialfile* - the file selected upon opening of the dialog
sv: *initialfile* - den fil som väljs när dialogrutan öppnas

source: *filetypes* - a sequence of (label, pattern) tuples, '*' wildcard is allowed
sv: *filetypes* - en sekvens av (label, pattern)-tupler, jokertecken "*" är tillåtet

source: *defaultextension* - default extension to append to file (save dialogs)
sv: *defaultextension* - standardtillägg att lägga till i filen (spara dialogrutor)

source: *multiple* - when true, selection of multiple items is allowed
sv: *multiple* - när true, är det tillåtet att välja flera objekt

source: **Static factory functions**
sv: **Statiska fabriksfunktioner**

source: The below functions when called create a modal, native look-and-feel dialog, wait for the user's selection, then return the selected value(s) or ``None`` to the caller.
sv: Nedanstående funktioner skapar en modal dialogruta med inbyggt utseende och känsla, väntar på användarens val och returnerar sedan det/de valda värdena eller ``None`` till den som anropar.

source: The above two functions create an :class:`Open` dialog and return the opened file object(s) in read-only mode.
sv: De två ovanstående funktionerna skapar en :class:`Open`\-dialogruta och returnerar det/de öppnade filobjekten i skrivskyddat läge.

source: Create a :class:`SaveAs` dialog and return a file object opened in write-only mode.
sv: Skapa en :class:`SaveAs`\-dialogruta och returnera ett filobjekt som öppnats i skrivskyddat läge.

source: The above two functions create an :class:`Open` dialog and return the selected filename(s) that correspond to existing file(s).
sv: Ovanstående två funktioner skapar en :class:`Open`\-dialogruta och returnerar det eller de valda filnamn som motsvarar befintliga filer.

source: Create a :class:`SaveAs` dialog and return the selected filename.
sv: Skapa en :class:`SaveAs`\-dialogruta och returnera det valda filnamnet.

source: Prompt user to select a directory.
sv: Fråga användaren om att välja en katalog.

source: Additional keyword option:
sv: Ytterligare sökordsalternativ:

source: *mustexist* - determines if selection must be an existing directory.
sv: *mustexist* - avgör om urvalet måste vara en befintlig katalog.

source: The above two classes provide native dialog windows for saving and loading files.
sv: De två ovanstående klasserna tillhandahåller inbyggda dialogfönster för att spara och ladda filer.

source: **Convenience classes**
sv: **Bekvämlighetskurser**

source: The below classes are used for creating file/directory windows from scratch. These do not emulate the native look-and-feel of the platform.
sv: Nedanstående klasser används för att skapa fil-/katalogfönster från grunden. Dessa emulerar inte plattformens ursprungliga utseende och känsla.

source: Create a dialog prompting the user to select a directory.
sv: Skapa en dialogruta där användaren uppmanas att välja en katalog.

source: The *FileDialog* class should be subclassed for custom event handling and behaviour.
sv: Klassen *FileDialog* bör underklassificeras för anpassad händelsehantering och beteende.

source: Create a basic file selection dialog.
sv: Skapa en enkel dialogruta för filval.

source: Trigger the termination of the dialog window.
sv: Utlös avslutning av dialogfönstret.

source: Event handler for double-click event on directory.
sv: Händelsehanterare för dubbelklick på katalog.

source: Event handler for click event on directory.
sv: Händelsehanterare för klickhändelse på katalog.

source: Event handler for double-click event on file.
sv: Händelsehanterare för dubbelklick på fil.

source: Event handler for single-click event on file.
sv: Händelsehanterare för enkelklickshändelse på fil.

source: Filter the files by directory.
sv: Filtrera filerna efter katalog.

source: Retrieve the file filter currently in use.
sv: Hämta det filfilter som används för närvarande.

source: Retrieve the currently selected item.
sv: Hämta det objekt som för tillfället är valt.

source: Render dialog and start event loop.
sv: Rendera dialogrutan och starta händelseslingan.

source: Exit dialog returning current selection.
sv: Avsluta dialogrutan och returnera aktuellt val.

source: Exit dialog returning filename, if any.
sv: Avsluta dialogrutan och returnera filnamnet, om det finns något.

source: Set the file filter.
sv: Ställ in filfiltret.

source: Update the current file selection to *file*.
sv: Uppdatera det aktuella filvalet till *fil*.

source: A subclass of FileDialog that creates a dialog window for selecting an existing file.
sv: En subklass av FileDialog som skapar ett dialogfönster för att välja en befintlig fil.

source: Test that a file is provided and that the selection indicates an already existing file.
sv: Testa att en fil tillhandahålls och att valet indikerar en redan befintlig fil.

source: A subclass of FileDialog that creates a dialog window for selecting a destination file.
sv: En subklass av FileDialog som skapar ett dialogfönster för att välja en destinationsfil.

source: Test whether or not the selection points to a valid file that is not a directory. Confirmation is required if an already existing file is selected.
sv: Testa om markeringen pekar på en giltig fil som inte är en katalog. Bekräftelse krävs om en redan befintlig fil väljs.

source: :mod:`tkinter.commondialog` --- Dialog window templates
sv: :mod:`tkinter.commondialog` --- Mallar för dialogfönster

source: **Source code:** :source:`Lib/tkinter/commondialog.py`
sv: **Källkod:** :source:`Lib/tkinter/commondialog.py`

source: The :mod:`tkinter.commondialog` module provides the :class:`Dialog` class that is the base class for dialogs defined in other supporting modules.
sv: Modulen :mod:`tkinter.commondialog` tillhandahåller klassen :class:`Dialog` som är basklass för dialogrutor som definieras i andra stödmoduler.

source: Render the Dialog window.
sv: Rendera dialogfönstret.

source: Modules :mod:`tkinter.messagebox`, :ref:`tut-files`
sv: Moduler :mod:`tkinter.messagebox`, :ref:`tut-files`
