Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/email.headerregistry.po
Languages: pt_pt, ru

source: :mod:`email.headerregistry`: Custom Header Objects
ru: :mod:`email.headerregistry`: Объекты пользовательских заголовков

source: **Source code:** :source:`Lib/email/headerregistry.py`
pt_pt: **Código-fonte:** :source:`Lib/email/headerregistry.py`
ru: **Исходный код:** :source:`Lib/email/headerregistry.py`

source: Headers are represented by customized subclasses of :class:`str`. The particular class used to represent a given header is determined by the :attr:`~email.policy.EmailPolicy.header_factory` of the :mod:`~email.policy` in effect when the headers are created. This section documents the particular ``header_factory`` implemented by the email package for handling :RFC:`5322` compliant email messages, which not only provides customized header objects for various header types, but also provides an extension mechanism for applications to add their own custom header types.
pt_pt: Os cabeçalhos são representados por subclasses personalizadas de :class:`str`. A classe específica usada para representar um determinado cabeçalho é determinada pelo :attr:`~email.policy.EmailPolicy.header_factory` da política :mod:`~email.policy` em vigor quando os cabeçalhos são criados. Esta secção documenta a ``header_factory`` específica implementada pelo pacote de email para lidar com mensagens de email compatíveis com :RFC:`5322`, que não só fornece objetos de cabeçalho personalizados para vários tipos de cabeçalhos, mas também fornece um mecanismo de extensão para que as aplicações possam adicionar os seus próprios tipos de cabeçalhos personalizados.
ru: Заголовки представлены настраиваемыми подклассами :class:`str`. Конкретный класс, используемый для представления данного заголовка, определяется :attr:`~email.policy.EmailPolicy.header_factory` :mod:`~email.policy`, действующим при создании заголовков. В этом разделе описывается конкретная ``header_factory``, реализованная в пакете электронной почты для обработки сообщений электронной почты, соответствующих :RFC:`5322`, которая не только предоставляет настраиваемые объекты заголовков для различных типов заголовков, но также предоставляет механизм расширения, позволяющий приложениям добавлять свои собственные типы заголовков.

source: When using any of the policy objects derived from :data:`~email.policy.EmailPolicy`, all headers are produced by :class:`.HeaderRegistry` and have :class:`.BaseHeader` as their last base class. Each header class has an additional base class that is determined by the type of the header. For example, many headers have the class :class:`.UnstructuredHeader` as their other base class. The specialized second class for a header is determined by the name of the header, using a lookup table stored in the :class:`.HeaderRegistry`. All of this is managed transparently for the typical application program, but interfaces are provided for modifying the default behavior for use by more complex applications.
pt_pt: Ao usar qualquer um dos objetos de política derivados de :data:`~email.policy.EmailPolicy`, todos os cabeçalhos são produzidos por :class:`.HeaderRegistry` e têm :class:`.BaseHeader` como a sua última classe base. Cada classe de cabeçalho tem uma classe base adicional que é determinada pelo tipo de cabeçalho. Por exemplo, muitos cabeçalhos têm a classe :class:`.UnstructuredHeader` como a sua outra classe base. A segunda classe especializada para um cabeçalho é determinada pelo nome do cabeçalho, usando uma tabela de pesquisa armazenada no :class:`.HeaderRegistry`. Tudo isto é gerido de forma transparente para o programa de aplicação típico, mas são fornecidas interfaces para modificar o comportamento predefinido para uso por aplicações mais complexas.
ru: При использовании любого из объектов политики, производных от :data:`~email.policy.EmailPolicy`, все заголовки создаются :class:`.HeaderRegistry` и имеют :class:`.BaseHeader` в качестве последнего базового класса. Каждый класс заголовка имеет дополнительный базовый класс, который определяется типом заголовка. Например, многие заголовки имеют класс :class:`.UnstructuredHeader` в качестве другого базового класса. Специализированный второй класс заголовка определяется именем заголовка с использованием таблицы поиска, хранящейся в :class:`.HeaderRegistry`. Все это прозрачно управляется для типичной прикладной программы, но предусмотрены интерфейсы для изменения поведения по умолчанию для использования более сложными приложениями.

source: The sections below first document the header base classes and their attributes, followed by the API for modifying the behavior of :class:`.HeaderRegistry`, and finally the support classes used to represent the data parsed from structured headers.
pt_pt: As secções abaixo documentam primeiro as classes base de cabeçalho e os seus atributos, seguidas pela API para modificar o comportamento do :class:`.HeaderRegistry`, e finalmente as classes de suporte usadas para representar os dados analisados de cabeçalhos estruturados.
ru: В разделах ниже сначала описаны базовые классы заголовков и их атрибуты, затем API для изменения поведения :class:`.HeaderRegistry` и, наконец, вспомогательные классы, используемые для представления данных, анализируемых из структурированных заголовков.

source: *name* and *value* are passed to ``BaseHeader`` from the :attr:`~email.policy.EmailPolicy.header_factory` call. The string value of any header object is the *value* fully decoded to unicode.
pt_pt: *name* e *value* são passados para ``BaseHeader`` a partir da chamada :attr:`~email.policy.EmailPolicy.header_factory`. O valor de string de qualquer objeto de cabeçalho é o *value* totalmente descodificado para unicode.
ru: *name* и *value* передаются в BaseHeader из вызова :attr:`~email.policy.EmailPolicy.header_factory`. Строковое значение любого объекта заголовка — это *значение*, полностью декодированное в Юникод.

source: This base class defines the following read-only properties:
pt_pt: Esta classe base define as seguintes propriedades de apenas leitura:
ru: Этот базовый класс определяет следующие свойства, доступные только для чтения:

source: The name of the header (the portion of the field before the ':'). This is exactly the value passed in the :attr:`~email.policy.EmailPolicy.header_factory` call for *name*; that is, case is preserved.
pt_pt: O nome do cabeçalho (a parte do campo antes do ':'). Isto é exatamente o valor passado na chamada :attr:`~email.policy.EmailPolicy.header_factory` para *name*; ou seja, a capitalização é preservada.
ru: Имя заголовка (часть поля перед «:»). Это именно то значение, которое передается в вызове :attr:`~email.policy.EmailPolicy.header_factory` для *name*; то есть регистр сохраняется.

source: A tuple of :exc:`~email.errors.HeaderDefect` instances reporting any RFC compliance problems found during parsing. The email package tries to be complete about detecting compliance issues. See the :mod:`~email.errors` module for a discussion of the types of defects that may be reported.
pt_pt: Um tuplo de instâncias :exc:`~email.errors.HeaderDefect` que relatam quaisquer problemas de conformidade com RFC encontrados durante a análise. O pacote de email tenta ser completo na deteção de problemas de conformidade. Consulte o módulo :mod:`~email.errors` para uma discussão sobre os tipos de defeitos que podem ser relatados.
ru: Кортеж экземпляров :exc:`~email.errors.HeaderDefect`, сообщающих о любых проблемах с соответствием RFC, обнаруженных во время анализа. Пакет электронной почты пытается обеспечить полное обнаружение проблем с соблюдением требований. См. модуль :mod:`~email.errors` для обсуждения типов дефектов, о которых можно сообщить.

source: The maximum number of headers of this type that can have the same ``name``. A value of ``None`` means unlimited. The ``BaseHeader`` value for this attribute is ``None``; it is expected that specialized header classes will override this value as needed.
pt_pt: O número máximo de cabeçalhos deste tipo que podem ter o mesmo ``name``. Um valor de ``None`` significa ilimitado. O valor ``BaseHeader`` para este atributo é ``None``; espera-se que as classes de cabeçalho especializadas substituam este valor conforme necessário.
ru: Максимальное количество заголовков этого типа, которые могут иметь одно и то же имя. Значение «Нет» означает неограниченное количество. Значением BaseHeader для этого атрибута является None; ожидается, что специализированные классы заголовков будут переопределять это значение по мере необходимости.

source: ``BaseHeader`` also provides the following method, which is called by the email library code and should not in general be called by application programs:
pt_pt: ``BaseHeader`` também fornece o seguinte método, que é chamado pelo código da biblioteca de email e não deve, em geral, ser chamado por programas de aplicação:
ru: ``BaseHeader`` также предоставляет следующий метод, который вызывается кодом библиотеки электронной почты и обычно не должен вызываться прикладными программами:

source: Return a string containing :attr:`~email.policy.Policy.linesep` characters as required to correctly fold the header according to *policy*. A :attr:`~email.policy.Policy.cte_type` of ``8bit`` will be treated as if it were ``7bit``, since headers may not contain arbitrary binary data. If :attr:`~email.policy.EmailPolicy.utf8` is ``False``, non-ASCII data will be :rfc:`2047` encoded.
pt_pt: Devolve uma string contendo caracteres :attr:`~email.policy.Policy.linesep` conforme necessário para dobrar corretamente o cabeçalho de acordo com *policy*. Um :attr:`~email.policy.Policy.cte_type` de ``8bit`` será tratado como se fosse ``7bit``, uma vez que os cabeçalhos não podem conter dados binários arbitrários. Se :attr:`~email.policy.EmailPolicy.utf8` for ``False``, os dados não-ASCII serão codificados de acordo com :rfc:`2047`.
ru: Возвращает строку, содержащую символы :attr:`~email.policy.Policy.linesep`, необходимые для правильного свертывания заголовка в соответствии с *policy*. :attr:`~email.policy.Policy.cte_type` ``8bit`` будет обрабатываться так, как если бы он был ``7bit``, поскольку заголовки не могут содержать произвольные двоичные данные. Если :attr:`~email.policy.EmailPolicy.utf8` имеет значение ``False``, данные, отличные от ASCII, будут закодированы :rfc:`2047`.

source: ``BaseHeader`` by itself cannot be used to create a header object. It defines a protocol that each specialized header cooperates with in order to produce the header object. Specifically, ``BaseHeader`` requires that the specialized class provide a :func:`classmethod` named ``parse``. This method is called as follows::
pt_pt: ``BaseHeader`` por si só não pode ser usado para criar um objeto de cabeçalho. Define um protocolo com o qual cada cabeçalho especializado coopera para produzir o objeto de cabeçalho. Especificamente, ``BaseHeader`` exige que a classe especializada forneça um :func:`classmethod` chamado ``parse``. Este método é chamado da seguinte forma:
ru: ``BaseHeader`` сам по себе не может использоваться для создания объекта заголовка. Он определяет протокол, с которым взаимодействует каждый специализированный заголовок для создания объекта заголовка. В частности, BaseHeader требует, чтобы специализированный класс предоставлял метод класса с именем parse. Этот метод вызывается следующим образом:

source: ``kwds`` is a dictionary containing one pre-initialized key, ``defects``. ``defects`` is an empty list. The parse method should append any detected defects to this list. On return, the ``kwds`` dictionary *must* contain values for at least the keys ``decoded`` and ``defects``. ``decoded`` should be the string value for the header (that is, the header value fully decoded to unicode). The parse method should assume that *string* may contain content-transfer-encoded parts, but should correctly handle all valid unicode characters as well so that it can parse un-encoded header values.
pt_pt: ``kwds`` é um dicionário contendo uma chave pré-inicializada, ``defects``. ``defects`` é uma lista vazia. O método parse deve anexar quaisquer defeitos detetados a esta lista. Ao retornar, o dicionário ``kwds`` *deve* conter valores para pelo menos as chaves ``decoded`` e ``defects``. ``decoded`` deve ser o valor de string para o cabeçalho (ou seja, o valor do cabeçalho totalmente descodificado para unicode). O método parse deve assumir que *string* pode conter partes codificadas por transferência de conteúdo, mas deve lidar corretamente com todos os caracteres unicode válidos para que possa analisar valores de cabeçalho não codificados.
ru: ``kwds`` — это словарь, содержащий один предварительно инициализированный ключ ``defects``. ``дефекты`` — пустой список. Метод анализа должен добавлять в этот список все обнаруженные дефекты. При возврате словарь ``kwds`` *должен* содержать значения как минимум для ключей ``decoded`` и ``defects``. ``decoded`` должно быть строковым значением заголовка (то есть значение заголовка, полностью декодированное в Юникод). Метод анализа должен предполагать, что *string* может содержать части, закодированные при передаче контента, но также должен правильно обрабатывать все допустимые символы Юникода, чтобы он мог анализировать незакодированные значения заголовка.

source: ``BaseHeader``'s ``__new__`` then creates the header instance, and calls its ``init`` method. The specialized class only needs to provide an ``init`` method if it wishes to set additional attributes beyond those provided by ``BaseHeader`` itself. Such an ``init`` method should look like this::
pt_pt: O ``__new__`` de ``BaseHeader`` cria então a instância do cabeçalho e chama o seu método ``init``. A classe especializada só precisa fornecer um método ``init`` se desejar definir atributos adicionais além daqueles fornecidos pelo próprio ``BaseHeader``. Um método ``init`` desse tipo deve ser assim:
ru: Затем ``__new__`` BaseHeader создает экземпляр заголовка и вызывает его метод ``init``. Специализированный класс должен предоставить метод init только в том случае, если он хочет установить дополнительные атрибуты помимо тех, которые предоставляются самим BaseHeader. Такой метод ``init`` должен выглядеть следующим образом:

source: That is, anything extra that the specialized class puts in to the ``kwds`` dictionary should be removed and handled, and the remaining contents of ``kw`` (and ``args``) passed to the ``BaseHeader`` ``init`` method.
pt_pt: Ou seja, qualquer coisa extra que a classe especializada coloque no dicionário ``kwds`` deve ser removida e tratada, e o conteúdo restante de ``kw`` (e ``args``) deve ser passado para o método ``init`` de ``BaseHeader``.
ru: То есть все лишнее, что специализированный класс помещает в словарь ``kwds``, должно быть удалено и обработано, а оставшееся содержимое ``kw`` (и ``args``) должно быть передано в ``BaseHeader`. ```init`` метод.

source: An "unstructured" header is the default type of header in :rfc:`5322`. Any header that does not have a specified syntax is treated as unstructured. The classic example of an unstructured header is the :mailheader:`Subject` header.
pt_pt: Um cabeçalho "não estruturado" é o tipo de cabeçalho predefinido em :rfc:`5322`. Qualquer cabeçalho que não tenha uma sintaxe especificada é tratado como não estruturado. O exemplo clássico de um cabeçalho não estruturado é o cabeçalho :mailheader:`Subject`.
ru: «Неструктурированный» заголовок — это тип заголовка по умолчанию в :rfc:`5322`. Любой заголовок, не имеющий определенного синтаксиса, считается неструктурированным. Классическим примером неструктурированного заголовка является заголовок :mailheader:`Subject`.

source: In :rfc:`5322`, an unstructured header is a run of arbitrary text in the ASCII character set. :rfc:`2047`, however, has an :rfc:`5322` compatible mechanism for encoding non-ASCII text as ASCII characters within a header value. When a *value* containing encoded words is passed to the constructor, the ``UnstructuredHeader`` parser converts such encoded words into unicode, following the :rfc:`2047` rules for unstructured text. The parser uses heuristics to attempt to decode certain non-compliant encoded words. Defects are registered in such cases, as well as defects for issues such as invalid characters within the encoded words or the non-encoded text.
pt_pt: Em :rfc:`5322`, um cabeçalho não estruturado é uma sequência de texto arbitrário no conjunto de caracteres ASCII. No entanto, :rfc:`2047` tem um mecanismo compatível com :rfc:`5322` para codificar texto não-ASCII como caracteres ASCII dentro de um valor de cabeçalho. Quando um *value* contendo palavras codificadas é passado para o construtor, o analisador ``UnstructuredHeader`` converte essas palavras codificadas em unicode, seguindo as regras :rfc:`2047` para texto não estruturado. O analisador usa heurísticas para tentar descodificar certas palavras codificadas não conformes. Defeitos são registados nesses casos, bem como defeitos para problemas como caracteres inválidos dentro das palavras codificadas ou no texto não codificado.
ru: В :rfc:`5322` неструктурированный заголовок представляет собой произвольный текст в наборе символов ASCII. Однако :rfc:`2047` имеет механизм, совместимый с :rfc:`5322`, для кодирования текста, отличного от ASCII, как символов ASCII внутри значения заголовка. Когда конструктору передается *значение*, содержащее закодированные слова, анализатор UnstructuredHeader преобразует такие закодированные слова в Юникод, следуя правилам :rfc:`2047` для неструктурированного текста. Анализатор использует эвристику, чтобы попытаться декодировать определенные несовместимые закодированные слова. В таких случаях регистрируются дефекты, а также дефекты, связанные с такими проблемами, как недопустимые символы в закодированных словах или незакодированном тексте.

source: This header type provides no additional attributes.
pt_pt: Este tipo de cabeçalho não fornece atributos adicionais.
ru: Этот тип заголовка не предоставляет дополнительных атрибутов.

source: :rfc:`5322` specifies a very specific format for dates within email headers. The ``DateHeader`` parser recognizes that date format, as well as recognizing a number of variant forms that are sometimes found "in the wild".
pt_pt: O :rfc:`5322` especifica um formato muito específico para datas nos cabeçalhos de email. O analisador ``DateHeader`` reconhece esse formato de data, bem como reconhece várias formas variantes que às vezes são encontradas "na natureza".
ru: :rfc:`5322` определяет очень специфический формат дат в заголовках электронных писем. Анализатор DateHeader распознает этот формат даты, а также распознает ряд вариантов форм, которые иногда встречаются «в дикой природе».

source: This header type provides the following additional attributes:
pt_pt: Este tipo de cabeçalho fornece os seguintes atributos adicionais:
ru: Этот тип заголовка предоставляет следующие дополнительные атрибуты:

source: If the header value can be recognized as a valid date of one form or another, this attribute will contain a :class:`~datetime.datetime` instance representing that date. If the timezone of the input date is specified as ``-0000`` (indicating it is in UTC but contains no information about the source timezone), then :attr:`.datetime` will be a naive :class:`~datetime.datetime`. If a specific timezone offset is found (including ``+0000``), then :attr:`.datetime` will contain an aware ``datetime`` that uses :class:`datetime.timezone` to record the timezone offset.
pt_pt: Se o valor do cabeçalho puder ser reconhecido como uma data válida de uma forma ou de outra, este atributo conterá uma instância :class:`~datetime.datetime` que representa essa data. Se o fuso horário da data de entrada for especificado como ``-0000`` (indicando que está em UTC, mas não contém informações sobre o fuso horário de origem), então :attr:`.datetime` será um :class:`~datetime.datetime` ingénuo. Se for encontrado um deslocamento de fuso horário específico (incluindo ``+0000``), então :attr:`.datetime` conterá um ``datetime`` consciente que usa :class:`datetime.timezone` para registar o deslocamento do fuso horário.
ru: Если значение заголовка можно распознать как допустимую дату той или иной формы, этот атрибут будет содержать экземпляр :class:`~datetime.datetime`, представляющий эту дату. Если часовой пояс входной даты указан как ``-0000`` (указывает, что он находится в формате UTC, но не содержит информации об исходном часовом поясе), то :attr:`.datetime` будет наивным :class:`~datetime .датавремя`. Если обнаружено определенное смещение часового пояса (включая ``+0000``), то :attr:`.datetime` будет содержать известное ``datetime``, которое использует :class:`datetime.timezone` для записи смещения часового пояса.

source: The ``decoded`` value of the header is determined by formatting the ``datetime`` according to the :rfc:`5322` rules; that is, it is set to::
pt_pt: O valor ``decoded`` do cabeçalho é determinado formatando o ``datetime`` de acordo com as regras :rfc:`5322`; ou seja, é definido como:
ru: Декодированное значение заголовка определяется форматированием даты и времени в соответствии с правилами :rfc:`5322`; то есть установлено::

source: When creating a ``DateHeader``, *value* may be :class:`~datetime.datetime` instance. This means, for example, that the following code is valid and does what one would expect::
pt_pt: Ao criar um ``DateHeader``, *value* pode ser uma instância :class:`~datetime.datetime`. Isto significa, por exemplo, que o seguinte código é válido e faz o que se esperaria:
ru: При создании DateHeader *value* может быть экземпляром :class:`~datetime.datetime`. Это означает, например, что следующий код действителен и делает то, что и следовало ожидать:

source: Because this is a naive ``datetime`` it will be interpreted as a UTC timestamp, and the resulting value will have a timezone of ``-0000``. Much more useful is to use the :func:`~email.utils.localtime` function from the :mod:`~email.utils` module::
pt_pt: Como este é um ``datetime`` ingénuo, será interpretado como um carimbo de tempo UTC, e o valor resultante terá um fuso horário de ``-0000``. Muito mais útil é usar a função :func:`~email.utils.localtime` do módulo :mod:`~email.utils`:
ru: Поскольку это простое ``datetime``, оно будет интерпретироваться как временная метка UTC, а полученное значение будет иметь часовой пояс ``-0000``. Гораздо полезнее использовать функцию :func:`~email.utils.localtime` из модуля :mod:`~email.utils`::

source: This example sets the date header to the current time and date using the current timezone offset.
pt_pt: Este exemplo define o cabeçalho de data para a hora e data atuais usando o deslocamento do fuso horário atual.
ru: В этом примере в заголовке даты задается текущее время и дата с использованием текущего смещения часового пояса.

source: Address headers are one of the most complex structured header types. The ``AddressHeader`` class provides a generic interface to any address header.
pt_pt: Os cabeçalhos de endereço são um dos tipos de cabeçalhos estruturados mais complexos. A classe ``AddressHeader`` fornece uma interface genérica para qualquer cabeçalho de endereço.
ru: Заголовки адресов — один из наиболее сложных структурированных типов заголовков. Класс AddressHeader предоставляет общий интерфейс для любого заголовка адреса.
