Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/email.headerregistry.po
Languages: pt_pt, ru

source: A tuple of :class:`.Group` objects encoding the addresses and groups found in the header value. Addresses that are not part of a group are represented in this list as single-address ``Groups`` whose :attr:`~.Group.display_name` is ``None``.
pt_pt: Um tuplo de objetos :class:`.Group` que codificam os endereços e grupos encontrados no valor do cabeçalho. Endereços que não fazem parte de um grupo são representados nesta lista como ``Groups`` de endereço único cujo :attr:`~.Group.display_name` é ``None``.
ru: Кортеж объектов :class:`.Group`, кодирующий адреса и группы, найденные в значении заголовка. Адреса, не являющиеся частью группы, представлены в этом списке как одноадресные ``Группы``, у которых :attr:`~.Group.display_name` имеет значение ``None``.

source: A tuple of :class:`.Address` objects encoding all of the individual addresses from the header value. If the header value contains any groups, the individual addresses from the group are included in the list at the point where the group occurs in the value (that is, the list of addresses is "flattened" into a one dimensional list).
pt_pt: Um tuplo de objetos :class:`.Address` que codificam todos os endereços individuais do valor do cabeçalho. Se o valor do cabeçalho contiver algum grupo, os endereços individuais do grupo são incluídos na lista no ponto onde o grupo ocorre no valor (ou seja, a lista de endereços é "achatada" numa lista unidimensional).
ru: Кортеж объектов :class:`.Address`, кодирующий все отдельные адреса из значения заголовка. Если значение заголовка содержит какие-либо группы, отдельные адреса из группы включаются в список в той точке, где группа встречается в значении (то есть список адресов «сглаживается» в одномерный список).

source: A list of :class:`.Address` and :class:`.Group` objects in any combination may be used to set the value of an address header. ``Group`` objects whose ``display_name`` is ``None`` will be interpreted as single addresses, which allows an address list to be copied with groups intact by using the list obtained from the ``groups`` attribute of the source header.
pt_pt: Uma lista de objetos :class:`.Address` e :class:`.Group` em qualquer combinação pode ser usada para definir o valor de um cabeçalho de endereço. Objetos ``Group`` cujo ``display_name`` é ``None`` serão interpretados como endereços únicos, o que permite que uma lista de endereços seja copiada com grupos intactos usando a lista obtida do atributo ``groups`` do cabeçalho de origem.
ru: Список объектов :class:`.Address` и :class:`.Group` в любой комбинации может использоваться для установки значения заголовка адреса. Объекты ``Group``, ``display_name`` которых имеют значение ``None``, будут интерпретироваться как отдельные адреса, что позволяет копировать список адресов с неповрежденными группами, используя список, полученный из атрибута ``groups`` исходный заголовок.

source: A subclass of :class:`.AddressHeader` that adds one additional attribute:
pt_pt: Uma subclasse de :class:`.AddressHeader` que adiciona um atributo adicional:
ru: Подкласс :class:`.AddressHeader`, который добавляет один дополнительный атрибут:

source: The single address encoded by the header value. If the header value actually contains more than one address (which would be a violation of the RFC under the default :mod:`~email.policy`), accessing this attribute will result in a :exc:`ValueError`.
pt_pt: O único endereço codificado pelo valor do cabeçalho. Se o valor do cabeçalho contiver na verdade mais do que um endereço (o que seria uma violação da RFC sob a política :mod:`~email.policy` predefinida), o acesso a este atributo resultará numa exceção :exc:`ValueError`.
ru: Одиночный адрес, закодированный значением заголовка. Если значение заголовка на самом деле содержит более одного адреса (что было бы нарушением RFC по умолчанию :mod:`~email.policy`), доступ к этому атрибуту приведет к :exc:`ValueError`.

source: Many of the above classes also have a ``Unique`` variant (for example, ``UniqueUnstructuredHeader``). The only difference is that in the ``Unique`` variant, :attr:`~.BaseHeader.max_count` is set to 1.
pt_pt: Muitas das classes acima também têm uma variante ``Unique`` (por exemplo, ``UniqueUnstructuredHeader``). A única diferença é que na variante ``Unique``, :attr:`~.BaseHeader.max_count` é definido como 1.
ru: Многие из вышеперечисленных классов также имеют вариант «Unique» (например, «UniqueUnstructuredHeader»). Единственное отличие состоит в том, что в варианте Unique для :attr:`~.BaseHeader.max_count` установлено значение 1.

source: There is really only one valid value for the :mailheader:`MIME-Version` header, and that is ``1.0``. For future proofing, this header class supports other valid version numbers. If a version number has a valid value per :rfc:`2045`, then the header object will have non-``None`` values for the following attributes:
pt_pt: Na verdade, há apenas um valor válido para o cabeçalho :mailheader:`MIME-Version`, que é ``1.0``. Para garantir compatibilidade futura, esta classe de cabeçalho suporta outros números de versão válidos. Se um número de versão tiver um valor válido de acordo com :rfc:`2045`, então o objeto de cabeçalho terá valores não-``None`` para os seguintes atributos:
ru: На самом деле существует только одно допустимое значение для заголовка :mailheader:`MIME-Version`, и это ``1.0``. Для будущей проверки этот класс заголовка поддерживает другие допустимые номера версий. Если номер версии имеет допустимое значение для :rfc:`2045`, то объект заголовка будет иметь значения, отличные от ``None``, для следующих атрибутов:

source: The version number as a string, with any whitespace and/or comments removed.
pt_pt: O número da versão como uma string, com qualquer espaço em branco e/ou comentários removidos.
ru: Номер версии в виде строки с удаленными пробелами и/или комментариями.

source: The major version number as an integer
pt_pt: O número da versão principal como um inteiro
ru: Основной номер версии в качестве целого числа

source: The minor version number as an integer
pt_pt: O número da versão secundária como um inteiro
ru: Младший номер версии в качестве целого числа

source: MIME headers all start with the prefix 'Content-'. Each specific header has a certain value, described under the class for that header. Some can also take a list of supplemental parameters, which have a common format. This class serves as a base for all the MIME headers that take parameters.
pt_pt: Os cabeçalhos MIME começam todos com o prefixo 'Content-'. Cada cabeçalho específico tem um certo valor, descrito na classe para esse cabeçalho. Alguns também podem ter uma lista de parâmetros suplementares, que têm um formato comum. Esta classe serve como base para todos os cabeçalhos MIME que aceitam parâmetros.
ru: Все заголовки MIME начинаются с префикса «Content-». Каждый конкретный заголовок имеет определенное значение, описанное в классе этого заголовка. Некоторые также могут принимать список дополнительных параметров, имеющих общий формат. Этот класс служит основой для всех заголовков MIME, принимающих параметры.

source: A dictionary mapping parameter names to parameter values.
pt_pt: Um dicionário que mapeia nomes de parâmetros para valores de parâmetros.
ru: Словарь, сопоставляющий имена параметров со значениями параметров.

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Type` header.
pt_pt: Uma classe :class:`ParameterizedMIMEHeader` que lida com o cabeçalho :mailheader:`Content-Type`.
ru: Класс :class:`ParameterizedMIMEHeader`, который обрабатывает заголовок :mailheader:`Content-Type`.

source: The content type string, in the form ``maintype/subtype``.
pt_pt: A string do tipo de conteúdo, no formato ``maintype/subtype``.
ru: Строка типа контента в форме «основной тип/подтип».

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Disposition` header.
pt_pt: Uma classe :class:`ParameterizedMIMEHeader` que lida com o cabeçalho :mailheader:`Content-Disposition`.
ru: Класс :class:`ParameterizedMIMEHeader`, который обрабатывает заголовок :mailheader:`Content-Disposition`.

source: ``inline`` and ``attachment`` are the only valid values in common use.
pt_pt: ``inline`` e ``attachment`` são os únicos valores válidos de uso comum.
ru: ``inline`` и ``attachment`` — единственные общеупотребительные допустимые значения.

source: Handles the :mailheader:`Content-Transfer-Encoding` header.
pt_pt: Lida com o cabeçalho :mailheader:`Content-Transfer-Encoding`.
ru: Обрабатывает заголовок :mailheader:`Content-Transfer-Encoding`.

source: Valid values are ``7bit``, ``8bit``, ``base64``, and ``quoted-printable``. See :rfc:`2045` for more information.
pt_pt: Valores válidos são ``7bit``, ``8bit``, ``base64`` e ``quoted-printable``. Consulte :rfc:`2045` para mais informações.
ru: Допустимые значения: 7bit, 8bit, base64 иquoted-printable. См. :rfc:`2045` для получения дополнительной информации.

source: The default mappings are:
pt_pt: Os mapeamentos predefinidos são:
ru: По умолчанию используются следующие сопоставления:

source: subject
pt_pt: assunto
ru: предмет

source: date
pt_pt: data
ru: дата

source: resent-date
ru: дата повторной отправки

source: orig-date
ru: первоначальная дата

source: sender
pt_pt: remetente
ru: отправитель

source: resent-sender
ru: отправитель повторного сообщения

source: to
pt_pt: para
ru: к

source: resent-to
ru: повторно отправить

source: from
pt_pt: de
ru: от

source: reply-to
pt_pt: responder-para
ru: ответ на

source: mime-version
ru: mime-версия

source: content-type
ru: тип содержимого

source: content-disposition
ru: содержание-расположение

source: content-transfer-encoding
ru: передача контента кодирование

source: message-id
ru: идентификатор сообщения

source: ``HeaderRegistry`` has the following methods:
pt_pt: ``HeaderRegistry`` tem os seguintes métodos:
ru: ``HeaderRegistry`` имеет следующие методы:

source: *name* is the name of the header to be mapped. It will be converted to lower case in the registry. *cls* is the specialized class to be used, along with *base_class*, to create the class used to instantiate headers that match *name*.
pt_pt: *name* é o nome do cabeçalho a ser mapeado. Será convertido para minúsculas no registo. *cls* é a classe especializada a ser usada, juntamente com *base_class*, para criar a classe usada para instanciar cabeçalhos que correspondam a *name*.
ru: *name* — имя заголовка, который необходимо сопоставить. В реестре он будет преобразован в нижний регистр. *cls* — это специализированный класс, который будет использоваться вместе с *base_class* для создания класса, используемого для создания экземпляров заголовков, соответствующих *name*.

source: Construct and return a class to handle creating a *name* header.
pt_pt: Constrói e devolve uma classe para lidar com a criação de um cabeçalho *name*.
ru: Создайте и верните класс для обработки создания заголовка *name*.

source: Retrieves the specialized header associated with *name* from the registry (using *default_class* if *name* does not appear in the registry) and composes it with *base_class* to produce a class, calls the constructed class's constructor, passing it the same argument list, and finally returns the class instance created thereby.
pt_pt: Recupera o cabeçalho especializado associado a *name* do registo (usando *default_class* se *name* não aparecer no registo) e compõe-o com *base_class* para produzir uma classe, chama o construtor da classe construída, passando-lhe a mesma lista de argumentos, e finalmente devolve a instância da classe criada dessa forma.
ru: Извлекает специализированный заголовок, связанный с *name*, из реестра (используя *default_class*, если *name* не отображается в реестре) и объединяет его с *base_class* для создания класса, вызывает конструктор созданного класса, передавая ему то же самое список аргументов и, наконец, возвращает созданный таким образом экземпляр класса.

source: The following classes are the classes used to represent data parsed from structured headers and can, in general, be used by an application program to construct structured values to assign to specific headers.
pt_pt: As classes seguintes são as classes usadas para representar dados analisados de cabeçalhos estruturados e podem, em geral, ser usadas por um programa de aplicação para construir valores estruturados para atribuir a cabeçalhos específicos.
ru: Следующие классы представляют собой классы, используемые для представления данных, анализируемых из структурированных заголовков, и, как правило, могут использоваться прикладной программой для создания структурированных значений для присвоения определенным заголовкам.

source: The class used to represent an email address. The general form of an address is::
pt_pt: A classe usada para representar um endereço de email. A forma geral de um endereço é:
ru: Класс, используемый для представления адреса электронной почты. Общая форма адреса:

source: or::
pt_pt: ou:
ru: или::

source: where each part must conform to specific syntax rules spelled out in :rfc:`5322`.
pt_pt: onde cada parte deve estar em conformidade com regras de sintaxe específicas descritas em :rfc:`5322`.
ru: где каждая часть должна соответствовать определенным синтаксическим правилам, изложенным в :rfc:`5322`.

source: As a convenience *addr_spec* can be specified instead of *username* and *domain*, in which case *username* and *domain* will be parsed from the *addr_spec*. An *addr_spec* must be a properly RFC quoted string; if it is not ``Address`` will raise an error. Unicode characters are allowed and will be property encoded when serialized. However, per the RFCs, unicode is *not* allowed in the username portion of the address.
pt_pt: Por conveniência, *addr_spec* pode ser especificado em vez de *username* e *domain*, caso em que *username* e *domain* serão analisados a partir de *addr_spec*. Um *addr_spec* deve ser uma string devidamente citada de acordo com RFC; se não for, ``Address`` levantará um erro. Caracteres Unicode são permitidos e serão codificados corretamente quando serializados. No entanto, de acordo com as RFCs, unicode *não* é permitido na parte *username* do endereço.
ru: Для удобства вместо *username* и *domain* можно указать *addr_spec*, в этом случае *username* и *domain* будут анализироваться из *addr_spec*. *addr_spec* должен быть строкой, заключенной в кавычки RFC; если это не «Адрес», возникнет ошибка. Символы Юникода разрешены и будут закодированы свойством при сериализации. Однако, согласно RFC, юникод *не* разрешен в части адреса, посвященной имени пользователя.

source: The display name portion of the address, if any, with all quoting removed. If the address does not have a display name, this attribute will be an empty string.
pt_pt: A parte do nome de apresentação do endereço, se existir, com todas as aspas removidas. Se o endereço não tiver um nome de apresentação, este atributo será uma string vazia.
ru: Отображаемая часть адреса, если таковая имеется, без кавычек. Если у адреса нет отображаемого имени, этот атрибут будет пустой строкой.

source: The ``username`` portion of the address, with all quoting removed.
pt_pt: A parte ``username`` do endereço, com todas as aspas removidas.
ru: Часть адреса ``имя пользователя``, все кавычки удалены.

source: The ``domain`` portion of the address.
pt_pt: A parte ``domain`` do endereço.
ru: ``domain`` часть адреса.

source: The ``username@domain`` portion of the address, correctly quoted for use as a bare address (the second form shown above). This attribute is not mutable.
pt_pt: A parte ``username@domain`` do endereço, corretamente citada para uso como um endereço simples (a segunda forma mostrada acima). Este atributo não é mutável.
ru: Часть адреса ``username@domain``, правильно заключенная в кавычки для использования в качестве простого адреса (вторая форма показана выше). Этот атрибут не является изменяемым.

source: The ``str`` value of the object is the address quoted according to :rfc:`5322` rules, but with no Content Transfer Encoding of any non-ASCII characters.
pt_pt: O valor ``str`` do objeto é o endereço citado de acordo com as regras :rfc:`5322`, mas sem codificação de transferência de conteúdo de quaisquer caracteres não-ASCII.
ru: Значение ``str`` объекта — это адрес, указанный в соответствии с правилами :rfc:`5322`, но без кодирования передачи контента для любых символов, отличных от ASCII.

source: To support SMTP (:rfc:`5321`), ``Address`` handles one special case: if ``username`` and ``domain`` are both the empty string (or ``None``), then the string value of the ``Address`` is ``<>``.
pt_pt: Para suportar SMTP (:rfc:`5321`), ``Address`` lida com um caso especial: se ``username`` e ``domain`` forem ambos strings vazias (ou ``None``), então o valor de string do ``Address`` é ``<>``.
ru: Для поддержки SMTP (:rfc:`5321`) ``Address`` обрабатывает один особый случай: если ``username`` и ``domain`` оба являются пустой строкой (или ``None``), то Строковое значение ``Адрес`` равно ``<>``.

source: The class used to represent an address group. The general form of an address group is::
pt_pt: A classe usada para representar um grupo de endereços. A forma geral de um grupo de endereços é:
ru: Класс, используемый для представления группы адресов. Общая форма адресной группы:

source: As a convenience for processing lists of addresses that consist of a mixture of groups and single addresses, a ``Group`` may also be used to represent single addresses that are not part of a group by setting *display_name* to ``None`` and providing a list of the single address as *addresses*.
pt_pt: Por conveniência no processamento de listas de endereços que consistem numa mistura de grupos e endereços únicos, um ``Group`` também pode ser usado para representar endereços únicos que não fazem parte de um grupo, definindo *display_name* como ``None`` e fornecendo uma lista do endereço único como *addresses*.
ru: Для удобства обработки списков адресов, состоящих из группы и отдельных адресов, можно также использовать группу для представления отдельных адресов, не входящих в группу, установив для *display_name* значение «Нет». ` и предоставление списка отдельных адресов в виде *адресов*.

source: The ``display_name`` of the group. If it is ``None`` and there is exactly one ``Address`` in ``addresses``, then the ``Group`` represents a single address that is not in a group.
pt_pt: O ``display_name`` do grupo. Se for ``None`` e houver exatamente um ``Address`` em ``addresses``, então o ``Group`` representa um único endereço que não está num grupo.
ru: ``display_name`` группы. Если это «Нет» и в «адресах» есть ровно один «Адрес», то «Группа» представляет собой одиночный адрес, которого нет в группе.

source: A possibly empty tuple of :class:`.Address` objects representing the addresses in the group.
pt_pt: Um tuplo possivelmente vazio de objetos :class:`.Address` que representam os endereços no grupo.
ru: Возможно, пустой кортеж объектов :class:`.Address`, представляющих адреса в группе.

source: The ``str`` value of a ``Group`` is formatted according to :rfc:`5322`, but with no Content Transfer Encoding of any non-ASCII characters. If ``display_name`` is none and there is a single ``Address`` in the ``addresses`` list, the ``str`` value will be the same as the ``str`` of that single ``Address``.
pt_pt: O valor ``str`` de um ``Group`` é formatado de acordo com :rfc:`5322`, mas sem codificação de transferência de conteúdo de quaisquer caracteres não-ASCII. Se ``display_name`` for none e houver um único ``Address`` na lista ``addresses``, o valor ``str`` será o mesmo que o ``str`` desse único ``Address``.
ru: Значение ``str`` для ``Group`` форматируется в соответствии с :rfc:`5322`, но без кодирования передачи контента для каких-либо символов, отличных от ASCII. Если ``display_name`` отсутствует и в списке ``адресов`` есть один ``Адрес``, значение ``str`` будет таким же, как ``str`` этого единственного `` Адрес``.

source: Footnotes
pt_pt: Notas de rodapé
ru: Сноски

source: Originally added in 3.3 as a :term:`provisional module <provisional package>`
pt_pt: Adicionado originalmente na versão 3.3 como um :term:`módulo provisório <provisional package>`
ru: Первоначально добавлен в версии 3.3 как :term:`previsional Module <provisional package>`

source: The ``decoded`` value of the header will have all encoded words decoded to unicode. :class:`~encodings.idna` encoded domain names are also decoded to unicode. The ``decoded`` value is set by :ref:`joining <meth-str-join>` the :class:`str` value of the elements of the ``groups`` attribute with ``', '``.
pt_pt: O valor ``decoded`` do cabeçalho terá todas as palavras codificadas descodificadas para unicode. Os nomes de domínio codificados :class:`~encodings.idna` também são descodificados para unicode. O valor ``decoded`` é definido ao :ref:`unir <meth-str-join>` o valor :class:`str` dos elementos do atributo ``groups`` com ``', '``.
