Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/email.iterators.po
Languages: ru

source: :mod:`!email.iterators`: Iterators
ru: :mod:`!email.iterators`: Итераторы

source: **Source code:** :source:`Lib/email/iterators.py`
ru: **Исходный код:** :source:`Lib/email/iterators.py`

source: Iterating over a message object tree is fairly easy with the :meth:`Message.walk <email.message.Message.walk>` method. The :mod:`email.iterators` module provides some useful higher level iterations over message object trees.
ru: Перебирать дерево объектов сообщений довольно легко с помощью метода :meth:`Message.walk <email.message.Message.walk>`. Модуль :mod:`email.iterators` обеспечивает несколько полезных итераций более высокого уровня над деревьями объектов сообщений.

source: This iterates over all the payloads in all the subparts of *msg*, returning the string payloads line-by-line. It skips over all the subpart headers, and it skips over any subpart with a payload that isn't a Python string. This is somewhat equivalent to reading the flat text representation of the message from a file using :meth:`~io.TextIOBase.readline`, skipping over all the intervening headers.
ru: Это перебирает все полезные данные во всех подразделах *msg*, возвращая строковые полезные данные построчно. Он пропускает все заголовки подразделов, а также любой подраздел, полезная нагрузка которого не является строкой Python. Это в некоторой степени эквивалентно чтению плоского текстового представления сообщения из файла с использованием :meth:`~io.TextIOBase.readline`, пропуская все промежуточные заголовки.

source: Optional *decode* is passed through to :meth:`Message.get_payload <email.message.Message.get_payload>`.
ru: Необязательный *decode* передается в :meth:`Message.get_payload <email.message.Message.get_payload>`.

source: This iterates over all the subparts of *msg*, returning only those subparts that match the MIME type specified by *maintype* and *subtype*.
ru: При этом выполняются итерации по всем частям *msg*, возвращая только те части, которые соответствуют типу MIME, указанному в *maintype* и *subtype*.

source: Note that *subtype* is optional; if omitted, then subpart MIME type matching is done only with the main type. *maintype* is optional too; it defaults to :mimetype:`text`.
ru: Обратите внимание, что *subtype* не является обязательным; если этот параметр опущен, то сопоставление типов MIME подразделов выполняется только с основным типом. *maintype* также не является обязательным; по умолчанию это :mimetype:`text`.

source: Thus, by default :func:`typed_subpart_iterator` returns each subpart that has a MIME type of :mimetype:`text/\*`.
ru: Таким образом, по умолчанию :func:`typed_subpart_iterator` возвращает каждую подчасть, имеющую MIME-тип :mimetype:`text/\*`.

source: The following function has been added as a useful debugging tool. It should *not* be considered part of the supported public interface for the package.
ru: Следующая функция была добавлена ​​как полезный инструмент отладки. Его *не* следует считать частью поддерживаемого общедоступного интерфейса пакета.

source: Prints an indented representation of the content types of the message object structure. For example:
ru: Печатает представление типов контента структуры объекта сообщения с отступом. Например:

source: Optional *fp* is a file-like object to print the output to. It must be suitable for Python's :func:`print` function. *level* is used internally. *include_default*, if true, prints the default type as well.
ru: Необязательный *fp* — это файлоподобный объект, в который можно распечатать выходные данные. Он должен подходить для функции Python :func:`print`. *level* используется внутри. *include_default*, если true, также печатает тип по умолчанию.
