Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ensurepip.po
Languages: sv

source: **Source code:** :source:`Lib/ensurepip`
sv: **Källkod:** :source:`Lib/ensurepip`

source: The :mod:`ensurepip` package provides support for bootstrapping the ``pip`` installer into an existing Python installation or virtual environment. This bootstrapping approach reflects the fact that ``pip`` is an independent project with its own release cycle, and the latest available stable version is bundled with maintenance and feature releases of the CPython reference interpreter.
sv: Paketet :mod:`ensurepip` ger stöd för att starta upp installationsprogrammet för ``pip`` i en befintlig Python-installation eller virtuell miljö. Denna uppstartsmetod återspeglar det faktum att ``pip`` är ett oberoende projekt med sin egen utgivningscykel, och den senaste tillgängliga stabila versionen levereras med underhålls- och funktionsutgåvor av CPython-referenstolken.

source: In most cases, end users of Python shouldn't need to invoke this module directly (as ``pip`` should be bootstrapped by default), but it may be needed if installing ``pip`` was skipped when installing Python (or when creating a virtual environment) or after explicitly uninstalling ``pip``.
sv: I de flesta fall bör slutanvändare av Python inte behöva anropa denna modul direkt (eftersom ``pip`` bör startas upp som standard), men det kan behövas om installationen av ``pip`` hoppades över när Python installerades (eller när en virtuell miljö skapades) eller efter att ``pip`` uttryckligen avinstallerats.

source: This module *does not* access the internet. All of the components needed to bootstrap ``pip`` are included as internal parts of the package.
sv: Denna modul har *inte* tillgång till internet. Alla komponenter som behövs för att starta upp ``pip`` ingår som interna delar av paketet.

source: The end user guide for installing Python packages
sv: Slutanvändarhandboken för installation av Python-paket

source: :pep:`453`: Explicit bootstrapping of pip in Python installations
sv: :pep:`453`: Explicit bootstrapping av pip i Python-installationer

source: The original rationale and specification for this module.
sv: Den ursprungliga motiveringen och specifikationen för denna modul.

source: Command line interface
sv: Kommandoradsgränssnitt

source: The command line interface is invoked using the interpreter's ``-m`` switch.
sv: Kommandoradsgränssnittet anropas med hjälp av tolkens ``\-m``\-switch.

source: The simplest possible invocation is::
sv: Den enklaste möjliga anropet är::

source: This invocation will install ``pip`` if it is not already installed, but otherwise does nothing. To ensure the installed version of ``pip`` is at least as recent as the one available in ``ensurepip``, pass the ``--upgrade`` option::
sv: Detta anrop kommer att installera ``pip`` om det inte redan är installerat, men gör annars ingenting. För att säkerställa att den installerade versionen av ``pip`` är minst lika ny som den som finns tillgänglig i ``ensurepip``, skicka alternativet ``\--upgrade``::

source: By default, ``pip`` is installed into the current virtual environment (if one is active) or into the system site packages (if there is no active virtual environment). The installation location can be controlled through two additional command line options:
sv: Som standard installeras ``pip`` i den aktuella virtuella miljön (om en sådan är aktiv) eller i systempaketet (om det inte finns någon aktiv virtuell miljö). Installationsplatsen kan styras med hjälp av ytterligare två kommandoradsalternativ:

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the version of Python used to invoke ``ensurepip``). The scripts installed can be controlled through two additional command line options:
sv: Som standard kommer skripten ``pipX`` och ``pipX.Y`` att installeras (där X.Y står för den version av Python som används för att anropa ``ensurepip``). De skript som installeras kan styras med hjälp av ytterligare två kommandoradsalternativ:

source: Providing both of the script selection options will trigger an exception.
sv: Om du anger båda alternativen för skriptval kommer ett undantag att utlösas.

source: Module API
sv: Modul API

source: :mod:`ensurepip` exposes two functions for programmatic use:
sv: :mod:`ensurepip` exponerar två funktioner för programmatisk användning:

source: Returns a string specifying the available version of pip that will be installed when bootstrapping an environment.
sv: Returnerar en sträng som anger den tillgängliga versionen av pip som ska installeras när en miljö startas upp.

source: Bootstraps ``pip`` into the current or designated environment.
sv: Bootstrappar ``pip`` till den aktuella eller angivna miljön.

source: *root* specifies an alternative root directory to install relative to. If *root* is ``None``, then installation uses the default install location for the current environment.
sv: *root* anger en alternativ rotkatalog att installera i förhållande till. Om *root* är ``None`` använder installationen standardinstallationsplatsen för den aktuella miljön.

source: *upgrade* indicates whether or not to upgrade an existing installation of an earlier version of ``pip`` to the available version.
sv: *upgrade* anger om en befintlig installation av en tidigare version av ``pip`` ska uppgraderas till den tillgängliga versionen eller inte.

source: *user* indicates whether to use the user scheme rather than installing globally.
sv: *user* anger om användarsystemet ska användas i stället för att installera globalt.

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the current version of Python).
sv: Som standard kommer skripten ``pipX`` och ``pipX.Y`` att installeras (där X.Y står för den aktuella versionen av Python).

source: If *altinstall* is set, then ``pipX`` will *not* be installed.
sv: Om *altinstall* är inställt kommer ``pipX`` *inte* att installeras.

source: If *default_pip* is set, then ``pip`` will be installed in addition to the two regular scripts.
sv: Om *default_pip* är inställt kommer ``pip`` att installeras utöver de två vanliga skripten.

source: Setting both *altinstall* and *default_pip* will trigger :exc:`ValueError`.
sv: Att ställa in både *altinstall* och *default_pip* kommer att utlösa :exc:`ValueError`.

source: *verbosity* controls the level of output to :data:`sys.stdout` from the bootstrapping operation.
sv: *verbosity* styr nivån på utdata till :data:`sys.stdout` från bootstrapping-operationen.

source: Raises an :ref:`auditing event <auditing>` ``ensurepip.bootstrap`` with argument ``root``.
sv: Utlöser en :ref:`auditing event <auditing>` ``ensurepip.bootstrap`` med argument ``root``.

source: The bootstrapping process has side effects on both ``sys.path`` and ``os.environ``. Invoking the command line interface in a subprocess instead allows these side effects to be avoided.
sv: Bootstrapping-processen har bieffekter på både ``sys.path`` och ``os.environ``. Genom att istället anropa kommandoradsgränssnittet i en underprocess kan dessa bieffekter undvikas.

source: The bootstrapping process may install additional modules required by ``pip``, but other software should not assume those dependencies will always be present by default (as the dependencies may be removed in a future version of ``pip``).
sv: Bootstrapping-processen kan installera ytterligare moduler som krävs av ``pip``, men annan programvara bör inte förutsätta att dessa beroenden alltid kommer att finnas som standard (eftersom beroendena kan tas bort i en framtida version av ``pip``).
