Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/exceptions.po
Languages: pt_pt, ru

source: The nesting structure of the current exception is preserved in the result, as are the values of its :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields. Empty nested groups are omitted from the result.
pt_pt: A estrutura de aninhamento da exceção atual é preservada no resultado, assim como os valores dos seus campos :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` e :attr:`~BaseException.__notes__`. Grupos aninhados vazios são omitidos do resultado.

source: The condition is checked for all exceptions in the nested exception group, including the top-level and any nested exception groups. If the condition is true for such an exception group, it is included in the result in full.
pt_pt: A condição é verificada para todas as exceções no grupo de exceções aninhado, incluindo o nível superior e quaisquer grupos de exceções aninhados. Se a condição for verdadeira para tal grupo de exceções, ele é incluído no resultado na íntegra.

source: Like :meth:`subgroup`, but returns the pair ``(match, rest)`` where ``match`` is ``subgroup(condition)`` and ``rest`` is the remaining non-matching part.
pt_pt: Semelhante a :meth:`subgroup`, mas retorna o par ``(match, rest)`` onde ``match`` é ``subgroup(condition)`` e ``rest`` é a parte restante não correspondente.

source: Returns an exception group with the same :attr:`message`, but which wraps the exceptions in ``excs``.
pt_pt: Retorna um grupo de exceções com a mesma :attr:`message`, mas que envolve as exceções em ``excs``.

source: :meth:`subgroup` and :meth:`split` copy the :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields from the original exception group to the one returned by :meth:`derive`, so these fields do not need to be updated by :meth:`derive`.
pt_pt: :meth:`subgroup` e :meth:`split` copiam os campos :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` e :attr:`~BaseException.__notes__` do grupo de exceções original para o retornado por :meth:`derive`, pelo que estes campos não precisam de ser atualizados por :meth:`derive`.

source: Like :exc:`ExceptionGroup`, any subclass of :exc:`BaseExceptionGroup` which is also a subclass of :exc:`Exception` can only wrap instances of :exc:`Exception`.
pt_pt: Semelhante a :exc:`ExceptionGroup`, qualquer subclasse de :exc:`BaseExceptionGroup` que também seja uma subclasse de :exc:`Exception` só pode envolver instâncias de :exc:`Exception`.

source: Exception hierarchy
pt_pt: Hierarquia de exceções
ru: Иерархия исключений

source: The class hierarchy for built-in exceptions is:
pt_pt: A hierarquia de classes para exceções incorporadas é:
ru: Иерархия классов для встроенных исключений такова:

source: statement
pt_pt: instrução

source: exception
pt_pt: exceção

source: chaining
pt_pt: encadeamento

source: __cause__ (exception attribute)
pt_pt: __cause__ (atributo de exceção)

source: __context__ (exception attribute)
pt_pt: __context__ (atributo de exceção)

source: __suppress_context__ (exception attribute)
pt_pt: __suppress_context__ (atributo de exceção)

source: module
pt_pt: módulo

source: The :attr:`name` and :attr:`obj` attributes can be set using keyword-only arguments to the constructor. When set they represent the name of the attribute that was attempted to be accessed and the object that was accessed for said attribute, respectively.
ru: Атрибуты :attr:`name` и :attr:`obj` могут быть установлены с использованием аргументов конструктора, содержащих только ключевые слова. Если они установлены, они представляют имя атрибута, к которому была предпринята попытка доступа, и объекта, к которому был осуществлен доступ для указанного атрибута, соответственно.

source: Raised when the :func:`input` function hits an end-of-file condition (EOF) without reading any data. (N.B.: the :meth:`io.IOBase.read` and :meth:`io.IOBase.readline` methods return an empty string when they hit EOF.)
ru: Возникает, когда функция :func:`input` достигает состояния конца файла (EOF) без чтения каких-либо данных. (Примечание: методы :meth:`io.IOBase.read` и :meth:`io.IOBase.readline` возвращают пустую строку при достижении EOF.)

source: The :attr:`name` attribute can be set using a keyword-only argument to the constructor. When set it represent the name of the variable that was attempted to be accessed.
ru: Атрибут :attr:`name` может быть установлен с использованием аргумента конструктора, содержащего только ключевые слова. Если он установлен, он представляет имя переменной, к которой была предпринята попытка доступа.

source: The corresponding error message, as provided by the operating system. It is formatted by the C functions :c:func:`perror` under POSIX, and :c:func:`FormatMessage` under Windows.
ru: Соответствующее сообщение об ошибке, предоставленное операционной системой. Он форматируется функциями C :c:func:`perror` в POSIX и :c:func:`FormatMessage` в Windows.

source: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` and :exc:`mmap.error` have been merged into :exc:`OSError`, and the constructor may return a subclass.
ru: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` и :exc:`mmap.error` были объединены в :exc:`OSError`, и конструктор может вернуть подкласс.

source: Raised when the interpreter finds an internal error, but the situation does not look so serious to cause it to abandon all hope. The associated value is a string indicating what went wrong (in low-level terms).
ru: Возникает, когда интерпретатор обнаруживает внутреннюю ошибку, но ситуация не выглядит настолько серьезной, чтобы заставить его отказаться от всякой надежды. Связанное значение представляет собой строку, указывающую, что пошло не так (в терминах низкого уровня).

source: You should report this to the author or maintainer of your Python interpreter. Be sure to report the version of the Python interpreter (``sys.version``; it is also printed at the start of an interactive Python session), the exact error message (the exception's associated value) and if possible the source of the program that triggered the error.
ru: Вы должны сообщить об этом автору или сопровождающему вашего интерпретатора Python. Обязательно сообщите версию интерпретатора Python («sys.version»; она также выводится в начале интерактивного сеанса Python), точное сообщение об ошибке (значение, связанное с исключением) и, если возможно, источник программа, вызвавшая ошибку.

source: This exception is raised by the :func:`sys.exit` function. It inherits from :exc:`BaseException` instead of :exc:`Exception` so that it is not accidentally caught by code that catches :exc:`Exception`. This allows the exception to properly propagate up and cause the interpreter to exit. When it is not handled, the Python interpreter exits; no stack traceback is printed. The constructor accepts the same optional argument passed to :func:`sys.exit`. If the value is an integer, it specifies the system exit status (passed to C's :c:func:`exit` function); if it is ``None``, the exit status is zero; if it has another type (such as a string), the object's value is printed and the exit status is one.
ru: Это исключение вызывается функцией :func:`sys.exit`. Он наследуется от :exc:`BaseException` вместо :exc:`Exception`, чтобы случайно не перехватиться кодом, который перехватывает :exc:`Exception`. Это позволяет исключению правильно распространяться и вызывать завершение работы интерпретатора. Если он не обработан, интерпретатор Python завершает работу; обратная трассировка стека не печатается. Конструктор принимает тот же необязательный аргумент, который передается в :func:`sys.exit`. Если значение является целым числом, оно определяет статус выхода системы (передается в функцию C :c:func:`exit`); если это ``None``, статус выхода равен нулю; если он имеет другой тип (например, строку), значение объекта печатается, и статус выхода равен единице.
