Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/exceptions.po
Languages: pt_pt, ru

source: Built-in Exceptions
pt_pt: Exceções Incorporadas
ru: Встроенные исключения

source: In Python, all exceptions must be instances of a class that derives from :class:`BaseException`. In a :keyword:`try` statement with an :keyword:`except` clause that mentions a particular class, that clause also handles any exception classes derived from that class (but not exception classes from which *it* is derived). Two exception classes that are not related via subclassing are never equivalent, even if they have the same name.
pt_pt: Em Python, todas as exceções devem ser instâncias de uma classe que deriva de :class:`BaseException`. Numa instrução :keyword:`try` com uma cláusula :keyword:`except` que menciona uma classe específica, essa cláusula também trata quaisquer classes de exceção derivadas dessa classe (mas não classes de exceção das quais *ela* é derivada). Duas classes de exceção que não estão relacionadas através de subclasses nunca são equivalentes, mesmo que tenham o mesmo nome.
ru: В Python все исключения должны быть экземплярами класса, производного от :class:`BaseException`. В операторе :keyword:`try` с предложением :keyword:`Exception`, в котором упоминается конкретный класс, это предложение также обрабатывает любые классы исключений, производные от этого класса (но не классы исключений, из которых *он* является производным). Два класса исключений, не связанные созданием подклассов, никогда не являются эквивалентными, даже если они имеют одно и то же имя.

source: The built-in exceptions listed in this chapter can be generated by the interpreter or built-in functions. Except where mentioned, they have an "associated value" indicating the detailed cause of the error. This may be a string or a tuple of several items of information (e.g., an error code and a string explaining the code). The associated value is usually passed as arguments to the exception class's constructor.
pt_pt: As exceções incorporadas listadas neste capítulo podem ser geradas pelo interpretador ou por funções incorporadas. Exceto onde mencionado, elas têm um "valor associado" que indica a causa detalhada do erro. Isto pode ser uma string ou um tuplo com vários itens de informação (por exemplo, um código de erro e uma string que explica o código). O valor associado é geralmente passado como argumentos para o construtor da classe de exceção.

source: User code can raise built-in exceptions. This can be used to test an exception handler or to report an error condition "just like" the situation in which the interpreter raises the same exception; but beware that there is nothing to prevent user code from raising an inappropriate error.
pt_pt: O código do utilizador pode levantar exceções incorporadas. Isto pode ser utilizado para testar um manipulador de exceções ou para reportar uma condição de erro "exatamente como" a situação em que o interpretador levanta a mesma exceção; mas tenha em atenção que não há nada que impeça o código do utilizador de levantar um erro inadequado.
ru: Пользовательский код может вызывать встроенные исключения. Это можно использовать для проверки обработчика исключений или для сообщения об ошибке, «точно так же, как» ситуация, в которой интерпретатор вызывает то же исключение; но помните, что нет ничего, что могло бы помешать пользовательскому коду вызвать недопустимую ошибку.

source: The built-in exception classes can be subclassed to define new exceptions; programmers are encouraged to derive new exceptions from the :exc:`Exception` class or one of its subclasses, and not from :exc:`BaseException`. More information on defining exceptions is available in the Python Tutorial under :ref:`tut-userexceptions`.
pt_pt: As classes de exceção incorporadas podem ser subclassificadas para definir novas exceções; os programadores são incentivados a derivar novas exceções da classe :exc:`Exception` ou de uma das suas subclasses, e não de :exc:`BaseException`. Mais informações sobre a definição de exceções estão disponíveis no Tutorial Python em :ref:`tut-userexceptions`.
ru: Встроенные классы исключений могут быть разделены на подклассы для определения новых исключений; программистам рекомендуется создавать новые исключения из класса :exc:`Exception` или одного из его подклассов, а не из :exc:`BaseException`. Дополнительную информацию об определении исключений можно найти в руководстве по Python в разделе :ref:`tut-userExceptions`.

source: Exception context
pt_pt: Contexto da Exceção
ru: Контекст исключения

source: Three attributes on exception objects provide information about the context in which the exception was raised:
pt_pt: Três atributos nos objetos de exceção fornecem informações sobre o contexto em que a exceção foi levantada:

source: When raising a new exception while another exception is already being handled, the new exception's :attr:`!__context__` attribute is automatically set to the handled exception. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used.
pt_pt: Ao levantar uma nova exceção enquanto outra exceção já está a ser tratada, o atributo :attr:`!__context__` da nova exceção é automaticamente definido para a exceção tratada. Uma exceção pode ser tratada quando uma cláusula :keyword:`except` ou :keyword:`finally`, ou uma instrução :keyword:`with`, é utilizada.

source: This implicit exception context can be supplemented with an explicit cause by using :keyword:`!from` with :keyword:`raise`::
pt_pt: Este contexto de exceção implícito pode ser complementado com uma causa explícita utilizando :keyword:`!from` com :keyword:`raise`::
ru: Этот контекст неявного исключения можно дополнить явной причиной, используя :keyword:`!from` с :keyword:`raise`::

source: The expression following :keyword:`from<raise>` must be an exception or ``None``. It will be set as :attr:`!__cause__` on the raised exception. Setting :attr:`!__cause__` also implicitly sets the :attr:`!__suppress_context__` attribute to ``True``, so that using ``raise new_exc from None`` effectively replaces the old exception with the new one for display purposes (e.g. converting :exc:`KeyError` to :exc:`AttributeError`), while leaving the old exception available in :attr:`!__context__` for introspection when debugging.
pt_pt: A expressão após :keyword:`from<raise>` deve ser uma exceção ou ``None``. Será definida como :attr:`!__cause__` na exceção levantada. Definir :attr:`!__cause__` também define implicitamente o atributo :attr:`!__suppress_context__` para ``True``, de modo que utilizar ``raise new_exc from None`` substitui efetivamente a exceção antiga pela nova para fins de exibição (por exemplo, converter :exc:`KeyError` em :exc:`AttributeError`), enquanto mantém a exceção antiga disponível em :attr:`!__context__` para introspeção durante a depuração.

source: The default traceback display code shows these chained exceptions in addition to the traceback for the exception itself. An explicitly chained exception in :attr:`!__cause__` is always shown when present. An implicitly chained exception in :attr:`!__context__` is shown only if :attr:`!__cause__` is :const:`None` and :attr:`!__suppress_context__` is false.
pt_pt: O código de exibição de traceback predefinido mostra estas exceções encadeadas além do traceback para a própria exceção. Uma exceção encadeada explicitamente em :attr:`!__cause__` é sempre mostrada quando presente. Uma exceção encadeada implicitamente em :attr:`!__context__` é mostrada apenas se :attr:`!__cause__` for :const:`None` e :attr:`!__suppress_context__` for falso.

source: In either case, the exception itself is always shown after any chained exceptions so that the final line of the traceback always shows the last exception that was raised.
pt_pt: Em qualquer caso, a própria exceção é sempre mostrada após quaisquer exceções encadeadas, de modo que a última linha do traceback sempre mostra a última exceção que foi levantada.
ru: В любом случае само исключение всегда отображается после любых связанных исключений, поэтому последняя строка обратной трассировки всегда показывает последнее возникшее исключение.

source: Inheriting from built-in exceptions
pt_pt: Herança de Exceções Incorporadas
ru: Наследование от встроенных исключений

source: User code can create subclasses that inherit from an exception type. It's recommended to only subclass one exception type at a time to avoid any possible conflicts between how the bases handle the ``args`` attribute, as well as due to possible memory layout incompatibilities.
pt_pt: O código do utilizador pode criar subclasses que herdam de um tipo de exceção. Recomenda-se subclassificar apenas um tipo de exceção de cada vez para evitar possíveis conflitos entre a forma como as bases tratam o atributo ``args``, bem como devido a possíveis incompatibilidades de layout de memória.
ru: Пользовательский код может создавать подклассы, наследуемые от типа исключения. Рекомендуется одновременно создавать подкласс только одного типа исключения, чтобы избежать любых возможных конфликтов между тем, как базы обрабатывают атрибут args, а также из-за возможной несовместимости структуры памяти.

source: Most built-in exceptions are implemented in C for efficiency, see: :source:`Objects/exceptions.c`. Some have custom memory layouts which makes it impossible to create a subclass that inherits from multiple exception types. The memory layout of a type is an implementation detail and might change between Python versions, leading to new conflicts in the future. Therefore, it's recommended to avoid subclassing multiple exception types altogether.
pt_pt: A maioria das exceções incorporadas são implementadas em C por eficiência, veja: :source:`Objects/exceptions.c`. Algumas têm layouts de memória personalizados, o que torna impossível criar uma subclasse que herda de vários tipos de exceção. O layout de memória de um tipo é um detalhe de implementação e pode mudar entre versões do Python, levando a novos conflitos no futuro. Portanto, recomenda-se evitar subclassificar vários tipos de exceção.
ru: Большинство встроенных исключений для повышения эффективности реализованы на языке C, см.: :source:`Objects/Exceptions.c`. Некоторые из них имеют собственную структуру памяти, что делает невозможным создание подкласса, наследуемого от нескольких типов исключений. Расположение памяти типа является деталью реализации и может меняться в разных версиях Python, что приведет к новым конфликтам в будущем. Поэтому рекомендуется вообще избегать создания подклассов нескольких типов исключений.

source: Base classes
pt_pt: Classes Base
ru: Базовые классы

source: The following exceptions are used mostly as base classes for other exceptions.
pt_pt: As seguintes exceções são usadas principalmente como classes base para outras exceções.
ru: Следующие исключения используются в основном как базовые классы для других исключений.

source: The base class for all built-in exceptions. It is not meant to be directly inherited by user-defined classes (for that, use :exc:`Exception`). If :func:`str` is called on an instance of this class, the representation of the argument(s) to the instance are returned, or the empty string when there were no arguments.
pt_pt: A classe base para todas as exceções incorporadas. Não é destinada a ser herdada diretamente por classes definidas pelo utilizador (para isso, utilize :exc:`Exception`). Se :func:`str` for chamada numa instância desta classe, a representação do(s) argumento(s) passados à instância é retornada, ou uma string vazia quando não houver argumentos.
ru: Базовый класс для всех встроенных исключений. Он не предназначен для прямого наследования определяемыми пользователем классами (для этого используйте :exc:`Exception`). Если :func:`str` вызывается для экземпляра этого класса, возвращается представление аргумента(ов) экземпляра или пустая строка, если аргументов нет.

source: The tuple of arguments given to the exception constructor. Some built-in exceptions (like :exc:`OSError`) expect a certain number of arguments and assign a special meaning to the elements of this tuple, while others are usually called only with a single string giving an error message.
pt_pt: O tuplo de argumentos passados ao construtor da exceção. Algumas exceções incorporadas (como :exc:`OSError`) esperam um certo número de argumentos e atribuem um significado especial aos elementos deste tuplo, enquanto outras são geralmente chamadas apenas com uma única string que fornece uma mensagem de erro.
ru: Кортеж аргументов, передаваемых конструктору исключения. Некоторые встроенные исключения (например, :exc:`OSError`) ожидают определенное количество аргументов и присваивают особое значение элементам этого кортежа, в то время как другие обычно вызываются только с одной строкой, дающей сообщение об ошибке.

source: This method sets *tb* as the new traceback for the exception and returns the exception object. It was more commonly used before the exception chaining features of :pep:`3134` became available. The following example shows how we can convert an instance of ``SomeException`` into an instance of ``OtherException`` while preserving the traceback. Once raised, the current frame is pushed onto the traceback of the ``OtherException``, as would have happened to the traceback of the original ``SomeException`` had we allowed it to propagate to the caller. ::
pt_pt: Este método define *tb* como o novo traceback para a exceção e retorna o objeto de exceção. Era mais comumente utilizado antes das funcionalidades de encadeamento de exceções da :pep:`3134` estarem disponíveis. O exemplo seguinte mostra como podemos converter uma instância de ``SomeException`` numa instância de ``OtherException`` enquanto preservamos o traceback. Uma vez levantada, a frame atual é adicionada ao traceback da ``OtherException``, como teria acontecido ao traceback da ``SomeException`` original se a tivéssemos deixado propagar para o chamador. ::
ru: Этот метод устанавливает *tb* в качестве новой трассировки исключения и возвращает объект исключения. Он чаще использовался до того, как стали доступны функции цепочки исключений :pep:`3134`. В следующем примере показано, как мы можем преобразовать экземпляр SomeException в экземпляр OtherException, сохраняя при этом обратную трассировку. После возникновения текущий кадр помещается в обратную трассировку OtherException, как это произошло бы с обратной трассировкой исходного SomeException, если бы мы позволили ему распространиться на вызывающую сторону. ::

source: A writable field that holds the :ref:`traceback object <traceback-objects>` associated with this exception. See also: :ref:`raise`.
pt_pt: Um campo gravável que contém o :ref:`objeto traceback <traceback-objects>` associado a esta exceção. Veja também: :ref:`raise`.

source: Add the string ``note`` to the exception's notes which appear in the standard traceback after the exception string. A :exc:`TypeError` is raised if ``note`` is not a string.
pt_pt: Adiciona a string ``note`` às notas da exceção, que aparecem no traceback padrão após a string da exceção. Uma :exc:`TypeError` é levantada se ``note`` não for uma string.

source: A list of the notes of this exception, which were added with :meth:`add_note`. This attribute is created when :meth:`add_note` is called.
pt_pt: Uma lista das notas desta exceção, que foram adicionadas com :meth:`add_note`. Este atributo é criado quando :meth:`add_note` é chamado.

source: All built-in, non-system-exiting exceptions are derived from this class. All user-defined exceptions should also be derived from this class.
pt_pt: Todas as exceções incorporadas que não terminam o sistema são derivadas desta classe. Todas as exceções definidas pelo utilizador também devem ser derivadas desta classe.
ru: Все встроенные исключения, не выходящие из системы, являются производными от этого класса. Все определяемые пользователем исключения также должны быть производными от этого класса.

source: The base class for those built-in exceptions that are raised for various arithmetic errors: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.
pt_pt: A classe base para aquelas exceções incorporadas que são levantadas para vários erros aritméticos: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.
ru: Базовый класс для встроенных исключений, возникающих при различных арифметических ошибках: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.

source: Raised when a :ref:`buffer <bufferobjects>` related operation cannot be performed.
pt_pt: Levantada quando uma operação relacionada com :ref:`buffer <bufferobjects>` não pode ser executada.
ru: Возникает, когда операция, связанная с :ref:`buffer <bufferobjects>`, не может быть выполнена.

source: The base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid: :exc:`IndexError`, :exc:`KeyError`. This can be raised directly by :func:`codecs.lookup`.
pt_pt: A classe base para as exceções que são levantadas quando uma chave ou índice utilizado num mapeamento ou sequência é inválido: :exc:`IndexError`, :exc:`KeyError`. Isto pode ser levantado diretamente por :func:`codecs.lookup`.
ru: Базовый класс для исключений, которые возникают, когда ключ или индекс, используемые в сопоставлении или последовательности, недействительны: :exc:`IndexError`, :exc:`KeyError`. Его можно вызвать непосредственно с помощью :func:`codecs.lookup`.

source: Concrete exceptions
pt_pt: Exceções Concretas
ru: Конкретные исключения

source: The following exceptions are the exceptions that are usually raised.
pt_pt: As seguintes exceções são as exceções que são geralmente levantadas.
ru: Следующие исключения представляют собой исключения, которые обычно возникают.

source: Raised when an :keyword:`assert` statement fails.
pt_pt: Levantada quando uma instrução :keyword:`assert` falha.
ru: Возникает, когда оператор :keyword:`assert` не работает.

source: Raised when an attribute reference (see :ref:`attribute-references`) or assignment fails. (When an object does not support attribute references or attribute assignments at all, :exc:`TypeError` is raised.)
pt_pt: Levantada quando uma referência de atributo (veja :ref:`attribute-references`) ou atribuição falha. (Quando um objeto não suporta referências de atributo ou atribuições de atributo, :exc:`TypeError` é levantada.)
ru: Возникает, когда ссылка на атрибут (см. :ref:`attribute-references`) или присвоение завершаются неудачно. (Когда объект вообще не поддерживает ссылки на атрибуты или назначения атрибутов, возникает :exc:`TypeError`.)

source: Added the :attr:`name` and :attr:`obj` attributes.
pt_pt: Adicionados os atributos :attr:`name` e :attr:`obj`.
ru: Добавлены атрибуты :attr:`name` и :attr:`obj`.

source: Not currently used.
pt_pt: Atualmente não utilizada.
ru: В настоящее время не используется.

source: Raised when a :term:`generator` or :term:`coroutine` is closed; see :meth:`generator.close` and :meth:`coroutine.close`. It directly inherits from :exc:`BaseException` instead of :exc:`Exception` since it is technically not an error.
pt_pt: Levantada quando um :term:`gerador` ou :term:`coroutine` é fechado; veja :meth:`generator.close` e :meth:`coroutine.close`. Herda diretamente de :exc:`BaseException` em vez de :exc:`Exception`, uma vez que, tecnicamente, não é um erro.
ru: Возникает, когда закрывается :term:`generator` или :term:`coroutine`; см. :meth:`generator.close` и :meth:`coroutine.close`. Он напрямую наследуется от :exc:`BaseException` вместо :exc:`Exception`, поскольку технически это не ошибка.

source: Raised when the :keyword:`import` statement has troubles trying to load a module. Also raised when the "from list" in ``from ... import`` has a name that cannot be found.
pt_pt: Levantada quando a instrução :keyword:`import` tem problemas ao tentar carregar um módulo. Também levantada quando a "lista from" em ``from ... import`` tem um nome que não pode ser encontrado.
ru: Возникает, когда у оператора :keyword:`import` возникают проблемы при загрузке модуля. Также возникает, когда имя «from list» в ``from ... import`` не может быть найдено.

source: The optional *name* and *path* keyword-only arguments set the corresponding attributes:
pt_pt: Os argumentos opcionais *name* e *path* apenas por palavra-chave definem os atributos correspondentes:

source: The name of the module that was attempted to be imported.
pt_pt: O nome do módulo que foi tentado importar.

source: The path to any file which triggered the exception.
pt_pt: O caminho para qualquer ficheiro que desencadeou a exceção.

source: Added the :attr:`name` and :attr:`path` attributes.
pt_pt: Adicionados os atributos :attr:`name` e :attr:`path`.
ru: Добавлены атрибуты :attr:`name` и :attr:`path`.

source: A subclass of :exc:`ImportError` which is raised by :keyword:`import` when a module could not be located. It is also raised when ``None`` is found in :data:`sys.modules`.
pt_pt: Uma subclasse de :exc:`ImportError` que é levantada por :keyword:`import` quando um módulo não pode ser localizado. Também é levantada quando ``None`` é encontrado em :data:`sys.modules`.
ru: Подкласс :exc:`ImportError`, который вызывается :keyword:`import`, когда модуль не может быть найден. Он также возникает, когда в :data:`sys.modules` обнаружено ``None``.

source: Raised when a sequence subscript is out of range. (Slice indices are silently truncated to fall in the allowed range; if an index is not an integer, :exc:`TypeError` is raised.)
pt_pt: Levantada quando um subíndice de sequência está fora do intervalo. (Os índices de fatia são silenciosamente truncados para cair no intervalo permitido; se um índice não for um inteiro, :exc:`TypeError` é levantada.)
ru: Возникает, когда индекс последовательности выходит за пределы допустимого диапазона. (Индексы срезов автоматически усекаются, чтобы попасть в разрешенный диапазон; если индекс не является целым числом, возникает :exc:`TypeError`.)

source: Raised when a mapping (dictionary) key is not found in the set of existing keys.
pt_pt: Levantada quando uma chave de mapeamento (dicionário) não é encontrada no conjunto de chaves existentes.
ru: Возникает, когда ключ сопоставления (словаря) не найден в наборе существующих ключей.

source: Raised when the user hits the interrupt key (normally :kbd:`Control-C` or :kbd:`Delete`). During execution, a check for interrupts is made regularly. The exception inherits from :exc:`BaseException` so as to not be accidentally caught by code that catches :exc:`Exception` and thus prevent the interpreter from exiting.
pt_pt: Levantada quando o utilizador pressiona a tecla de interrupção (normalmente :kbd:`Control-C` ou :kbd:`Delete`). Durante a execução, é feita regularmente uma verificação de interrupções. A exceção herda de :exc:`BaseException` para não ser acidentalmente capturada por código que captura :exc:`Exception` e, assim, evitar que o interpretador termine.
ru: Вызывается, когда пользователь нажимает клавишу прерывания (обычно :kbd:`Control-C` или :kbd:`Delete`). Во время выполнения регулярно производится проверка на прерывания. Исключение наследуется от :exc:`BaseException`, чтобы случайно не быть перехваченным кодом, который перехватывает :exc:`Exception` и тем самым предотвратить выход интерпретатора.
