Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/exceptions.po
Languages: pt_pt, ru

source: This exception may be raised by user code to indicate that an attempted operation on an object is not supported, and is not meant to be. If an object is meant to support a given operation but has not yet provided an implementation, :exc:`NotImplementedError` is the proper exception to raise.
pt_pt: Esta exceção pode ser levantada pelo código do utilizador para indicar que uma operação tentada num objeto não é suportada, e não é destinada a ser. Se um objeto é destinado a suportar uma determinada operação, mas ainda não forneceu uma implementação, :exc:`NotImplementedError` é a exceção adequada a levantar.
ru: Это исключение может быть вызвано пользовательским кодом, чтобы указать, что попытка операции с объектом не поддерживается и не должна поддерживаться. Если объект предназначен для поддержки данной операции, но еще не предоставил реализацию, подходящим исключением является исключение :exc:`NotImplementedError`.

source: Passing arguments of the wrong type (e.g. passing a :class:`list` when an :class:`int` is expected) should result in a :exc:`TypeError`, but passing arguments with the wrong value (e.g. a number outside expected boundaries) should result in a :exc:`ValueError`.
pt_pt: Passar argumentos do tipo errado (por exemplo, passar uma :class:`list` quando é esperado um :class:`int`) deve resultar numa :exc:`TypeError`, mas passar argumentos com o valor errado (por exemplo, um número fora dos limites esperados) deve resultar numa :exc:`ValueError`.
ru: Передача аргументов неправильного типа (например, передача :class:`list`, когда ожидается :class:`int`) должна привести к :exc:`TypeError`, но передача аргументов с неправильным значением (например, числом вне ожидаемые границы) должно привести к ошибке :exc:`ValueError`.

source: Raised when a reference is made to a local variable in a function or method, but no value has been bound to that variable. This is a subclass of :exc:`NameError`.
pt_pt: Levantada quando é feita uma referência a uma variável local numa função ou método, mas nenhum valor foi associado a essa variável. Esta é uma subclasse de :exc:`NameError`.
ru: Возникает, когда делается ссылка на локальную переменную в функции или методе, но к этой переменной не привязано никакое значение. Это подкласс :exc:`NameError`.

source: Raised when a Unicode-related encoding or decoding error occurs. It is a subclass of :exc:`ValueError`.
pt_pt: Levantada quando ocorre um erro de codificação ou descodificação relacionado com Unicode. É uma subclasse de :exc:`ValueError`.
ru: Возникает при возникновении ошибки кодирования или декодирования, связанной с Unicode. Это подкласс :exc:`ValueError`.

source: :exc:`UnicodeError` has attributes that describe the encoding or decoding error. For example, ``err.object[err.start:err.end]`` gives the particular invalid input that the codec failed on.
pt_pt: :exc:`UnicodeError` tem atributos que descrevem o erro de codificação ou descodificação. Por exemplo, ``err.object[err.start:err.end]`` fornece a entrada inválida específica em que o codec falhou.
ru: :exc:`UnicodeError` имеет атрибуты, описывающие ошибку кодирования или декодирования. Например, ``err.object[err.start:err.end]`` дает конкретный недопустимый входной сигнал, с которым произошел сбой кодека.

source: The name of the encoding that raised the error.
pt_pt: O nome da codificação que levantou o erro.
ru: Название кодировки, из-за которой возникла ошибка.

source: A string describing the specific codec error.
pt_pt: Uma string que descreve o erro específico do codec.
ru: Строка, описывающая конкретную ошибку кодека.

source: The object the codec was attempting to encode or decode.
pt_pt: O objeto que o codec estava a tentar codificar ou descodificar.
ru: Объект, который кодек пытался закодировать или декодировать.

source: The first index of invalid data in :attr:`object`.
pt_pt: O primeiro índice de dados inválidos em :attr:`object`.
ru: Первый индекс недопустимых данных в :attr:`object`.

source: The index after the last invalid data in :attr:`object`.
pt_pt: O índice após os últimos dados inválidos em :attr:`object`.
ru: Индекс после последних недопустимых данных в :attr:`object`.

source: Raised when a Unicode-related error occurs during encoding. It is a subclass of :exc:`UnicodeError`.
pt_pt: Levantada quando ocorre um erro relacionado com Unicode durante a codificação. É uma subclasse de :exc:`UnicodeError`.
ru: Возникает, когда во время кодирования возникает ошибка, связанная с Unicode. Это подкласс :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during decoding. It is a subclass of :exc:`UnicodeError`.
pt_pt: Levantada quando ocorre um erro relacionado com Unicode durante a descodificação. É uma subclasse de :exc:`UnicodeError`.
ru: Возникает, когда во время декодирования возникает ошибка, связанная с Unicode. Это подкласс :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during translating. It is a subclass of :exc:`UnicodeError`.
pt_pt: Levantada quando ocorre um erro relacionado com Unicode durante a tradução. É uma subclasse de :exc:`UnicodeError`.
ru: Возникает, когда во время перевода возникает ошибка, связанная с Unicode. Это подкласс :exc:`UnicodeError`.

source: Raised when an operation or function receives an argument that has the right type but an inappropriate value, and the situation is not described by a more precise exception such as :exc:`IndexError`.
pt_pt: Levantada quando uma operação ou função recebe um argumento que tem o tipo correto, mas um valor inapropriado, e a situação não é descrita por uma exceção mais precisa, como :exc:`IndexError`.
ru: Возникает, когда операция или функция получает аргумент правильного типа, но неподходящего значения, и ситуация не описывается более точным исключением, например :exc:`IndexError`.

source: Raised when the second argument of a division or modulo operation is zero. The associated value is a string indicating the type of the operands and the operation.
pt_pt: Levantada quando o segundo argumento de uma operação de divisão ou módulo é zero. O valor associado é uma string que indica o tipo dos operandos e a operação.
ru: Возникает, когда второй аргумент операции деления или по модулю равен нулю. Связанное значение представляет собой строку, указывающую тип операндов и операцию.

source: The following exceptions are kept for compatibility with previous versions; starting from Python 3.3, they are aliases of :exc:`OSError`.
pt_pt: As seguintes exceções são mantidas para compatibilidade com versões anteriores; a partir do Python 3.3, são aliases de :exc:`OSError`.
ru: Следующие исключения сохранены для совместимости с предыдущими версиями; начиная с Python 3.3, они являются псевдонимами :exc:`OSError`.

source: Only available on Windows.
pt_pt: Disponível apenas no Windows.
ru: Доступно только в Windows.

source: OS exceptions
pt_pt: Exceções do Sistema Operativo
ru: Исключения операционной системы

source: The following exceptions are subclasses of :exc:`OSError`, they get raised depending on the system error code.
pt_pt: As seguintes exceções são subclasses de :exc:`OSError`; são levantadas dependendo do código de erro do sistema.
ru: Следующие исключения являются подклассами :exc:`OSError`, они возникают в зависимости от кода системной ошибки.

source: Raised when an operation would block on an object (e.g. socket) set for non-blocking operation. Corresponds to :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` and :py:const:`~errno.EINPROGRESS`.
pt_pt: Levantada quando uma operação bloquearia num objeto (por exemplo, um socket) definido para operação não bloqueante. Corresponde a :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` e :py:const:`~errno.EINPROGRESS`.

source: In addition to those of :exc:`OSError`, :exc:`BlockingIOError` can have one more attribute:
pt_pt: Além dos atributos de :exc:`OSError`, :exc:`BlockingIOError` pode ter mais um atributo:
ru: В дополнение к атрибутам :exc:`OSError`, :exc:`BlockingIOError` может иметь еще один атрибут:

source: An integer containing the number of characters written to the stream before it blocked. This attribute is available when using the buffered I/O classes from the :mod:`io` module.
pt_pt: Um inteiro que contém o número de caracteres escritos para o fluxo antes de este bloquear. Este atributo está disponível ao utilizar as classes de I/O bufferizadas do módulo :mod:`io`.
ru: Целое число, содержащее количество символов, записанных в поток до его блокировки. Этот атрибут доступен при использовании буферизованных классов ввода-вывода из модуля :mod:`io`.

source: Raised when an operation on a child process failed. Corresponds to :c:data:`errno` :py:const:`~errno.ECHILD`.
pt_pt: Levantada quando uma operação num processo filho falha. Corresponde a :c:data:`errno` :py:const:`~errno.ECHILD`.

source: A base class for connection-related issues.
pt_pt: Uma classe base para problemas relacionados com ligações.
ru: Базовый класс для проблем, связанных с подключением.

source: Subclasses are :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` and :exc:`ConnectionResetError`.
pt_pt: Subclasses são :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` e :exc:`ConnectionResetError`.
ru: Подклассами являются :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` и :exc:`ConnectionResetError`.

source: A subclass of :exc:`ConnectionError`, raised when trying to write on a pipe while the other end has been closed, or trying to write on a socket which has been shutdown for writing. Corresponds to :c:data:`errno` :py:const:`~errno.EPIPE` and :py:const:`~errno.ESHUTDOWN`.
pt_pt: Uma subclasse de :exc:`ConnectionError`, levantada ao tentar escrever numa pipe enquanto a outra extremidade foi fechada, ou ao tentar escrever num socket que foi desligado para escrita. Corresponde a :c:data:`errno` :py:const:`~errno.EPIPE` e :py:const:`~errno.ESHUTDOWN`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is aborted by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNABORTED`.
pt_pt: Uma subclasse de :exc:`ConnectionError`, levantada quando uma tentativa de ligação é abortada pelo par. Corresponde a :c:data:`errno` :py:const:`~errno.ECONNABORTED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is refused by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.
pt_pt: Uma subclasse de :exc:`ConnectionError`, levantada quando uma tentativa de ligação é recusada pelo par. Corresponde a :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection is reset by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNRESET`.
pt_pt: Uma subclasse de :exc:`ConnectionError`, levantada quando uma ligação é redefinida pelo par. Corresponde a :c:data:`errno` :py:const:`~errno.ECONNRESET`.

source: Raised when trying to create a file or directory which already exists. Corresponds to :c:data:`errno` :py:const:`~errno.EEXIST`.
pt_pt: Levantada ao tentar criar um ficheiro ou diretório que já existe. Corresponde a :c:data:`errno` :py:const:`~errno.EEXIST`.

source: Raised when a file or directory is requested but doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ENOENT`.
pt_pt: Levantada quando um ficheiro ou diretório é solicitado, mas não existe. Corresponde a :c:data:`errno` :py:const:`~errno.ENOENT`.

source: Raised when a system call is interrupted by an incoming signal. Corresponds to :c:data:`errno` :py:const:`~errno.EINTR`.
pt_pt: Levantada quando uma chamada de sistema é interrompida por um sinal recebido. Corresponde a :c:data:`errno` :py:const:`~errno.EINTR`.

source: Python now retries system calls when a syscall is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
pt_pt: O Python agora tenta novamente chamadas de sistema quando uma syscall é interrompida por um sinal, exceto se o manipulador de sinal levantar uma exceção (veja :pep:`475` para a justificação), em vez de levantar :exc:`InterruptedError`.
ru: Python теперь повторяет системные вызовы, когда системный вызов прерывается сигналом, за исключением случаев, когда обработчик сигнала вызывает исключение (обоснование см. в :pep:`475`), вместо вызова :exc:`InterruptedError`.

source: Raised when a file operation (such as :func:`os.remove`) is requested on a directory. Corresponds to :c:data:`errno` :py:const:`~errno.EISDIR`.
pt_pt: Levantada quando uma operação de ficheiro (como :func:`os.remove`) é solicitada num diretório. Corresponde a :c:data:`errno` :py:const:`~errno.EISDIR`.

source: Raised when a directory operation (such as :func:`os.listdir`) is requested on something which is not a directory. On most POSIX platforms, it may also be raised if an operation attempts to open or traverse a non-directory file as if it were a directory. Corresponds to :c:data:`errno` :py:const:`~errno.ENOTDIR`.
pt_pt: Levantada quando uma operação de diretório (como :func:`os.listdir`) é solicitada em algo que não é um diretório. Na maioria das plataformas POSIX, também pode ser levantada se uma operação tentar abrir ou percorrer um ficheiro não diretório como se fosse um diretório. Corresponde a :c:data:`errno` :py:const:`~errno.ENOTDIR`.

source: Raised when trying to run an operation without the adequate access rights - for example filesystem permissions. Corresponds to :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM`, and :py:const:`~errno.ENOTCAPABLE`.
pt_pt: Levantada ao tentar executar uma operação sem os direitos de acesso adequados — por exemplo, permissões do sistema de ficheiros. Corresponde a :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM`, e :py:const:`~errno.ENOTCAPABLE`.

source: WASI's :py:const:`~errno.ENOTCAPABLE` is now mapped to :exc:`PermissionError`.
pt_pt: O :py:const:`~errno.ENOTCAPABLE` do WASI é agora mapeado para :exc:`PermissionError`.

source: Raised when a given process doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ESRCH`.
pt_pt: Levantada quando um determinado processo não existe. Corresponde a :c:data:`errno` :py:const:`~errno.ESRCH`.

source: Raised when a system function timed out at the system level. Corresponds to :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.
pt_pt: Levantada quando uma função do sistema expira no nível do sistema. Corresponde a :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.

source: All the above :exc:`OSError` subclasses were added.
pt_pt: Todas as subclasses :exc:`OSError` acima foram adicionadas.
ru: Были добавлены все вышеперечисленные подклассы :exc:`OSError`.

source: :pep:`3151` - Reworking the OS and IO exception hierarchy
pt_pt: :pep:`3151` — Reestruturação da hierarquia de exceções de SO e I/O
ru: :pep:`3151` - Переработка иерархии исключений ОС и ввода-вывода.

source: Warnings
pt_pt: Avisos
ru: Предупреждения

source: The following exceptions are used as warning categories; see the :ref:`warning-categories` documentation for more details.
pt_pt: As seguintes exceções são usadas como categorias de aviso; veja a documentação :ref:`warning-categories` para mais detalhes.
ru: Следующие исключения используются в качестве категорий предупреждений; дополнительную информацию см. в документации :ref:`warning-categories`.

source: Base class for warning categories.
pt_pt: Classe base para categorias de aviso.
ru: Базовый класс для категорий предупреждений.

source: Base class for warnings generated by user code.
pt_pt: Classe base para avisos gerados por código do utilizador.
ru: Базовый класс для предупреждений, генерируемых пользовательским кодом.

source: Base class for warnings about deprecated features when those warnings are intended for other Python developers.
pt_pt: Classe base para avisos sobre funcionalidades obsoletas quando esses avisos são destinados a outros programadores Python.
ru: Базовый класс для предупреждений об устаревших функциях, если эти предупреждения предназначены для других разработчиков Python.

source: Ignored by the default warning filters, except in the ``__main__`` module (:pep:`565`). Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
pt_pt: Ignorado pelos filtros de aviso predefinidos, exceto no módulo ``__main__`` (:pep:`565`). Ativar o :ref:`Modo de Desenvolvimento Python <devmode>` mostra este aviso.
ru: Игнорируется фильтрами предупреждений по умолчанию, за исключением модуля ``__main__`` (:pep:`565`). Включение :ref:`Режима разработки Python <devmode>` отображает это предупреждение.

source: The deprecation policy is described in :pep:`387`.
pt_pt: A política de obsolescência está descrita em :pep:`387`.
ru: Политика прекращения поддержки описана в :pep:`387`.

source: Base class for warnings about features which are obsolete and expected to be deprecated in the future, but are not deprecated at the moment.
pt_pt: Classe base para avisos sobre funcionalidades que estão obsoletas e são esperadas para serem obsoletas no futuro, mas que ainda não estão obsoletas.
ru: Базовый класс для предупреждений об устаревших функциях, которые, как ожидается, станут устаревшими в будущем, но не устарели в данный момент.

source: This class is rarely used as emitting a warning about a possible upcoming deprecation is unusual, and :exc:`DeprecationWarning` is preferred for already active deprecations.
pt_pt: Esta classe é raramente usada, uma vez que emitir um aviso sobre uma possível obsolescência futura é incomum, e :exc:`DeprecationWarning` é preferível para obsolescências já ativas.
ru: Этот класс используется редко, поскольку выдача предупреждения о возможном предстоящем прекращении поддержки является необычной, и :exc:`DeprecationWarning` предпочтительнее для уже активных исключений.

source: Ignored by the default warning filters. Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
pt_pt: Ignorado pelos filtros de aviso predefinidos. Ativar o :ref:`Modo de Desenvolvimento Python <devmode>` mostra este aviso.
ru: Игнорируется фильтрами предупреждений по умолчанию. Включение :ref:`Режима разработки Python <devmode>` отображает это предупреждение.

source: Base class for warnings about dubious syntax.
pt_pt: Classe base para avisos sobre sintaxe duvidosa.
ru: Базовый класс для предупреждений о сомнительном синтаксисе.

source: Base class for warnings about dubious runtime behavior.
pt_pt: Classe base para avisos sobre comportamento duvidoso em tempo de execução.
ru: Базовый класс для предупреждений о сомнительном поведении во время выполнения.

source: Base class for warnings about deprecated features when those warnings are intended for end users of applications that are written in Python.
pt_pt: Classe base para avisos sobre funcionalidades obsoletas quando esses avisos são destinados a utilizadores finais de aplicações escritas em Python.
ru: Базовый класс для предупреждений об устаревших функциях, если эти предупреждения предназначены для конечных пользователей приложений, написанных на Python.

source: Base class for warnings about probable mistakes in module imports.
pt_pt: Classe base para avisos sobre possíveis erros em importações de módulos.
ru: Базовый класс для предупреждений о возможных ошибках при импорте модулей.

source: Base class for warnings related to Unicode.
pt_pt: Classe base para avisos relacionados com Unicode.
ru: Базовый класс для предупреждений, связанных с Unicode.

source: Base class for warnings related to encodings.
pt_pt: Classe base para avisos relacionados com codificações.
ru: Базовый класс для предупреждений, связанных с кодировками.

source: See :ref:`io-encoding-warning` for details.
pt_pt: Veja :ref:`io-encoding-warning` para detalhes.
ru: Подробности см. в :ref:`io-encoding-warning`.

source: Base class for warnings related to :class:`bytes` and :class:`bytearray`.
pt_pt: Classe base para avisos relacionados com :class:`bytes` e :class:`bytearray`.
ru: Базовый класс для предупреждений, связанных с :class:`bytes` и :class:`bytearray`.

source: Base class for warnings related to resource usage.
pt_pt: Classe base para avisos relacionados com a utilização de recursos.
ru: Базовый класс для предупреждений, связанных с использованием ресурсов.

source: Exception groups
pt_pt: Grupos de exceções

source: The following are used when it is necessary to raise multiple unrelated exceptions. They are part of the exception hierarchy so they can be handled with :keyword:`except` like all other exceptions. In addition, they are recognised by :keyword:`except*<except_star>`, which matches their subgroups based on the types of the contained exceptions.
pt_pt: Os seguintes são usados quando é necessário levantar múltiplas exceções não relacionadas. Fazem parte da hierarquia de exceções, pelo que podem ser tratadas com :keyword:`except` como todas as outras exceções. Além disso, são reconhecidos por :keyword:`except*<except_star>`, que corresponde aos seus subgrupos com base nos tipos das exceções contidas.

source: Both of these exception types wrap the exceptions in the sequence ``excs``. The ``msg`` parameter must be a string. The difference between the two classes is that :exc:`BaseExceptionGroup` extends :exc:`BaseException` and it can wrap any exception, while :exc:`ExceptionGroup` extends :exc:`Exception` and it can only wrap subclasses of :exc:`Exception`. This design is so that ``except Exception`` catches an :exc:`ExceptionGroup` but not :exc:`BaseExceptionGroup`.
pt_pt: Ambos os tipos de exceção envolvem as exceções na sequência ``excs``. O parâmetro ``msg`` deve ser uma string. A diferença entre as duas classes é que :exc:`BaseExceptionGroup` estende :exc:`BaseException` e pode envolver qualquer exceção, enquanto :exc:`ExceptionGroup` estende :exc:`Exception` e só pode envolver subclasses de :exc:`Exception`. Este desenho permite que ``except Exception`` capture um :exc:`ExceptionGroup`, mas não um :exc:`BaseExceptionGroup`.

source: The :exc:`BaseExceptionGroup` constructor returns an :exc:`ExceptionGroup` rather than a :exc:`BaseExceptionGroup` if all contained exceptions are :exc:`Exception` instances, so it can be used to make the selection automatic. The :exc:`ExceptionGroup` constructor, on the other hand, raises a :exc:`TypeError` if any contained exception is not an :exc:`Exception` subclass.
pt_pt: O construtor :exc:`BaseExceptionGroup` retorna um :exc:`ExceptionGroup` em vez de um :exc:`BaseExceptionGroup` se todas as exceções contidas forem instâncias de :exc:`Exception`, pelo que pode ser usado para tornar a seleção automática. O construtor :exc:`ExceptionGroup`, por outro lado, levanta um :exc:`TypeError` se alguma exceção contida não for uma subclasse de :exc:`Exception`.

source: The ``msg`` argument to the constructor. This is a read-only attribute.
pt_pt: O argumento ``msg`` do construtor. Este é um atributo de apenas leitura.

source: A tuple of the exceptions in the ``excs`` sequence given to the constructor. This is a read-only attribute.
pt_pt: Um tuplo das exceções na sequência ``excs`` passada ao construtor. Este é um atributo de apenas leitura.

source: Returns an exception group that contains only the exceptions from the current group that match *condition*, or ``None`` if the result is empty.
pt_pt: Retorna um grupo de exceções que contém apenas as exceções do grupo atual que correspondem a *condition*, ou ``None`` se o resultado estiver vazio.
