Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/exceptions.po
Languages: pt_pt, ru

source: Catching a :exc:`KeyboardInterrupt` requires special consideration. Because it can be raised at unpredictable points, it may, in some circumstances, leave the running program in an inconsistent state. It is generally best to allow :exc:`KeyboardInterrupt` to end the program as quickly as possible or avoid raising it entirely. (See :ref:`handlers-and-exceptions`.)
pt_pt: Capturar uma :exc:`KeyboardInterrupt` requer consideração especial. Como pode ser levantada em pontos imprevisíveis, pode, em algumas circunstâncias, deixar o programa em execução num estado inconsistente. Em geral, é melhor permitir que :exc:`KeyboardInterrupt` termine o programa o mais rapidamente possível ou evitar levantá-la completamente. (Veja :ref:`handlers-and-exceptions`.)
ru: Перехват :exc:`KeyboardInterrupt` требует особого внимания. Поскольку его можно вызвать в непредсказуемые моменты, в некоторых случаях он может привести работающую программу в несогласованное состояние. Обычно лучше разрешить :exc:`KeyboardInterrupt` завершать программу как можно быстрее или вообще избегать ее запуска. (См. :ref:`обработчики-и-исключения`.)

source: Raised when an operation runs out of memory but the situation may still be rescued (by deleting some objects). The associated value is a string indicating what kind of (internal) operation ran out of memory. Note that because of the underlying memory management architecture (C's :c:func:`malloc` function), the interpreter may not always be able to completely recover from this situation; it nevertheless raises an exception so that a stack traceback can be printed, in case a run-away program was the cause.
pt_pt: Levantada quando uma operação fica sem memória, mas a situação ainda pode ser recuperada (eliminando alguns objetos). O valor associado é uma string que indica que tipo de operação (interna) ficou sem memória. Note que, devido à arquitetura de gestão de memória subjacente (a função C :c:func:`malloc`), o interpretador pode não ser sempre capaz de recuperar completamente desta situação; no entanto, levanta uma exceção para que um traceback possa ser impresso, caso um programa descontrolado tenha sido a causa.
ru: Возникает, когда операции не хватает памяти, но ситуацию еще можно спасти (путем удаления некоторых объектов). Соответствующее значение представляет собой строку, указывающую, для какой (внутренней) операции закончилась память. Обратите внимание, что из-за базовой архитектуры управления памятью (функция C :c:func:`malloc`) интерпретатор не всегда может полностью выйти из этой ситуации; тем не менее, он вызывает исключение, чтобы можно было напечатать обратную трассировку стека, если причиной была вышедшая из-под контроля программа.

source: Raised when a local or global name is not found. This applies only to unqualified names. The associated value is an error message that includes the name that could not be found.
pt_pt: Levantada quando um nome local ou global não é encontrado. Isto aplica-se apenas a nomes não qualificados. O valor associado é uma mensagem de erro que inclui o nome que não pôde ser encontrado.
ru: Возникает, когда локальное или глобальное имя не найдено. Это относится только к неполным именам. Связанное значение представляет собой сообщение об ошибке, включающее имя, которое не удалось найти.

source: Added the :attr:`name` attribute.
pt_pt: Adicionado o atributo :attr:`name`.
ru: Добавлен атрибут :attr:`name`.

source: This exception is derived from :exc:`RuntimeError`. In user defined base classes, abstract methods should raise this exception when they require derived classes to override the method, or while the class is being developed to indicate that the real implementation still needs to be added.
pt_pt: Esta exceção é derivada de :exc:`RuntimeError`. Em classes base definidas pelo utilizador, métodos abstratos devem levantar esta exceção quando exigem que as classes derivadas substituam o método, ou enquanto a classe está a ser desenvolvida para indicar que a implementação real ainda precisa de ser adicionada.
ru: Это исключение является производным от :exc:`RuntimeError`. В определяемых пользователем базовых классах абстрактные методы должны вызывать это исключение, когда они требуют, чтобы производные классы переопределяли метод, или пока класс разрабатывается, чтобы указать, что реальную реализацию все еще необходимо добавить.

source: It should not be used to indicate that an operator or method is not meant to be supported at all -- in that case either leave the operator / method undefined or, if a subclass, set it to :data:`None`.
pt_pt: Não deve ser utilizada para indicar que um operador ou método não é destinado a ser suportado de todo — nesse caso, deixe o operador/método indefinido ou, se for uma subclasse, defina-o para :data:`None`.
ru: Его не следует использовать для указания того, что оператор или метод вообще не должен поддерживаться — в этом случае либо оставьте оператор/метод неопределенным, либо, если это подкласс, установите для него значение :data:`None`.

source: This exception is raised when a system function returns a system-related error, including I/O failures such as "file not found" or "disk full" (not for illegal argument types or other incidental errors).
pt_pt: Esta exceção é levantada quando uma função do sistema retorna um erro relacionado com o sistema, incluindo falhas de I/O como "ficheiro não encontrado" ou "disco cheio" (não para tipos de argumentos ilegais ou outros erros incidentais).
ru: Это исключение возникает, когда системная функция возвращает системную ошибку, включая сбои ввода-вывода, такие как «файл не найден» или «диск заполнен» (не для недопустимых типов аргументов или других случайных ошибок).

source: The second form of the constructor sets the corresponding attributes, described below. The attributes default to :const:`None` if not specified. For backwards compatibility, if three arguments are passed, the :attr:`~BaseException.args` attribute contains only a 2-tuple of the first two constructor arguments.
pt_pt: A segunda forma do construtor define os atributos correspondentes, descritos abaixo. Os atributos são definidos para :const:`None` se não forem especificados. Para compatibilidade com versões anteriores, se três argumentos forem passados, o atributo :attr:`~BaseException.args` contém apenas um tuplo de 2 elementos com os dois primeiros argumentos do construtor.
ru: Вторая форма конструктора устанавливает соответствующие атрибуты, описанные ниже. Атрибуты по умолчанию имеют значение :const:`None`, если не указаны. В целях обратной совместимости, если передаются три аргумента, атрибут :attr:`~BaseException.args` содержит только кортеж из двух первых двух аргументов конструктора.

source: The constructor often actually returns a subclass of :exc:`OSError`, as described in `OS exceptions`_ below. The particular subclass depends on the final :attr:`.errno` value. This behaviour only occurs when constructing :exc:`OSError` directly or via an alias, and is not inherited when subclassing.
pt_pt: O construtor frequentemente retorna na verdade uma subclasse de :exc:`OSError`, como descrito em `OS exceptions`_ abaixo. A subclasse específica depende do valor final de :attr:`.errno`. Este comportamento ocorre apenas ao construir :exc:`OSError` diretamente ou através de um alias, e não é herdado ao subclassificar.
ru: Конструктор часто фактически возвращает подкласс :exc:`OSError`, как описано ниже в разделе `Исключения ОС`_. Конкретный подкласс зависит от конечного значения :attr:`.errno`. Такое поведение возникает только при создании :exc:`OSError` напрямую или через псевдоним и не наследуется при создании подклассов.

source: A numeric error code from the C variable :c:data:`errno`.
pt_pt: Um código de erro numérico da variável C :c:data:`errno`.
ru: Числовой код ошибки из переменной C :c:data:`errno`.

source: Under Windows, this gives you the native Windows error code. The :attr:`.errno` attribute is then an approximate translation, in POSIX terms, of that native error code.
pt_pt: No Windows, isto fornece o código de erro nativo do Windows. O atributo :attr:`.errno` é então uma tradução aproximada, em termos POSIX, desse código de erro nativo.
ru: В Windows это дает вам собственный код ошибки Windows. Атрибут :attr:`.errno` представляет собой приблизительный перевод в терминах POSIX этого собственного кода ошибки.

source: Under Windows, if the *winerror* constructor argument is an integer, the :attr:`.errno` attribute is determined from the Windows error code, and the *errno* argument is ignored. On other platforms, the *winerror* argument is ignored, and the :attr:`winerror` attribute does not exist.
pt_pt: No Windows, se o argumento *winerror* do construtor for um inteiro, o atributo :attr:`.errno` é determinado a partir do código de erro do Windows, e o argumento *errno* é ignorado. Noutras plataformas, o argumento *winerror* é ignorado, e o atributo :attr:`winerror` não existe.
ru: В Windows, если аргумент конструктора *winerror* является целым числом, атрибут :attr:`.errno` определяется по коду ошибки Windows, а аргумент *errno* игнорируется. На других платформах аргумент *winerror* игнорируется, а атрибут :attr:`winerror` не существует.

source: For exceptions that involve a file system path (such as :func:`open` or :func:`os.unlink`), :attr:`filename` is the file name passed to the function. For functions that involve two file system paths (such as :func:`os.rename`), :attr:`filename2` corresponds to the second file name passed to the function.
pt_pt: Para exceções que envolvem um caminho do sistema de ficheiros (como :func:`open` ou :func:`os.unlink`), :attr:`filename` é o nome do ficheiro passado para a função. Para funções que envolvem dois caminhos do sistema de ficheiros (como :func:`os.rename`), :attr:`filename2` corresponde ao segundo nome de ficheiro passado para a função.
ru: Для исключений, связанных с путем к файловой системе (например, :func:`open` или :func:`os.unlink`), :attr:`filename` — это имя файла, передаваемое функции. Для функций, которые используют два пути файловой системы (например, :func:`os.rename`), :attr:`filename2` соответствует второму имени файла, переданному функции.

source: The :attr:`filename` attribute is now the original file name passed to the function, instead of the name encoded to or decoded from the :term:`filesystem encoding and error handler`. Also, the *filename2* constructor argument and attribute was added.
pt_pt: O atributo :attr:`filename` é agora o nome original do ficheiro passado para a função, em vez do nome codificado ou descodificado a partir da codificação do sistema de ficheiros e do manipulador de erros. Além disso, o argumento construtor *filename2* e o atributo foram adicionados.
ru: Атрибут :attr:`filename` теперь является исходным именем файла, передаваемым в функцию, а не именем, закодированным или декодированным из :term:`кодирования файловой системы и обработчика ошибок`. Кроме того, были добавлены аргумент и атрибут конструктора *filename2*.

source: This exception is derived from :exc:`RuntimeError`. It is raised when the interpreter detects that the maximum recursion depth (see :func:`sys.getrecursionlimit`) is exceeded.
pt_pt: Esta exceção é derivada de :exc:`RuntimeError`. É levantada quando o interpretador deteta que a profundidade máxima de recursão (veja :func:`sys.getrecursionlimit`) é excedida.
ru: Это исключение является производным от :exc:`RuntimeError`. Он возникает, когда интерпретатор обнаруживает, что максимальная глубина рекурсии (см. :func:`sys.getrecursionlimit`) превышена.

source: Previously, a plain :exc:`RuntimeError` was raised.
pt_pt: Anteriormente, era levantada uma simples :exc:`RuntimeError`.
ru: Ранее возникало простое сообщение :exc:`RuntimeError`.

source: This exception is raised when a weak reference proxy, created by the :func:`weakref.proxy` function, is used to access an attribute of the referent after it has been garbage collected. For more information on weak references, see the :mod:`weakref` module.
pt_pt: Esta exceção é levantada quando um proxy de referência fraca, criado pela função :func:`weakref.proxy`, é utilizado para aceder a um atributo do referente após este ter sido recolhido pelo garbage collector. Para mais informações sobre referências fracas, veja o módulo :mod:`weakref`.
ru: Это исключение возникает, когда слабый ссылочный прокси, созданный функцией :func:`weakref.proxy`, используется для доступа к атрибуту референта после его сборки мусора. Дополнительную информацию о слабых ссылках см. в модуле :mod:`weakref`.

source: Raised when an error is detected that doesn't fall in any of the other categories. The associated value is a string indicating what precisely went wrong.
pt_pt: Levantada quando é detetado um erro que não se enquadra em nenhuma das outras categorias. O valor associado é uma string que indica o que correu mal.
ru: Возникает при обнаружении ошибки, не подпадающей ни под одну из других категорий. Соответствующее значение представляет собой строку, указывающую, что именно пошло не так.

source: Raised by built-in function :func:`next` and an :term:`iterator`\'s :meth:`~iterator.__next__` method to signal that there are no further items produced by the iterator.
pt_pt: Levantada pela função incorporada :func:`next` e pelo método :meth:`~iterator.__next__` de um :term:`iterador` para sinalizar que não há mais itens produzidos pelo iterador.
ru: Вызывается встроенной функцией :func:`next` и методом :term:`iterator`\ :meth:`~iterator.__next__`, чтобы сигнализировать о том, что итератор больше не создает элементов.

source: The exception object has a single attribute :attr:`!value`, which is given as an argument when constructing the exception, and defaults to :const:`None`.
pt_pt: O objeto de exceção tem um único atributo :attr:`!value`, que é fornecido como argumento ao construir a exceção, e por predefinição é :const:`None`.

source: When a :term:`generator` or :term:`coroutine` function returns, a new :exc:`StopIteration` instance is raised, and the value returned by the function is used as the :attr:`value` parameter to the constructor of the exception.
pt_pt: Quando uma função :term:`gerador` ou :term:`coroutine` retorna, uma nova instância de :exc:`StopIteration` é levantada, e o valor retornado pela função é utilizado como o parâmetro :attr:`value` para o construtor da exceção.
ru: Когда функция :term:`generator` или :term:`coroutine` возвращает значение, создается новый экземпляр :exc:`StopIteration`, и значение, возвращаемое функцией, используется в качестве параметра :attr:`value` для конструктор исключения.

source: If a generator code directly or indirectly raises :exc:`StopIteration`, it is converted into a :exc:`RuntimeError` (retaining the :exc:`StopIteration` as the new exception's cause).
pt_pt: Se um código de gerador levantar diretamente ou indiretamente :exc:`StopIteration`, esta é convertida numa :exc:`RuntimeError` (retaindo a :exc:`StopIteration` como a causa da nova exceção).
ru: Если код генератора прямо или косвенно вызывает :exc:`StopIteration`, он преобразуется в :exc:`RuntimeError` (сохраняя :exc:`StopIteration` как причину нового исключения).

source: Added ``value`` attribute and the ability for generator functions to use it to return a value.
pt_pt: Adicionado o atributo ``value`` e a capacidade das funções geradoras o utilizarem para retornar um valor.
ru: Добавлен атрибут value и возможность функций-генераторов использовать его для возврата значения.

source: Introduced the RuntimeError transformation via ``from __future__ import generator_stop``, see :pep:`479`.
pt_pt: Introduziu a transformação RuntimeError através de ``from __future__ import generator_stop``, veja :pep:`479`.
ru: Введено преобразование RuntimeError через ``from __future__ importgenerator_stop``, см. :pep:`479`.

source: Enable :pep:`479` for all code by default: a :exc:`StopIteration` error raised in a generator is transformed into a :exc:`RuntimeError`.
pt_pt: Ativar :pep:`479` para todo o código por predefinição: um erro :exc:`StopIteration` levantado num gerador é transformado numa :exc:`RuntimeError`.
ru: Включите :pep:`479` для всего кода по умолчанию: ошибка :exc:`StopIteration`, возникающая в генераторе, преобразуется в :exc:`RuntimeError`.

source: Must be raised by :meth:`~object.__anext__` method of an :term:`asynchronous iterator` object to stop the iteration.
pt_pt: Deve ser levantada pelo método :meth:`~object.__anext__` de um objeto :term:`iterador assíncrono` para parar a iteração.

source: Raised when the parser encounters a syntax error. This may occur in an :keyword:`import` statement, in a call to the built-in functions :func:`compile`, :func:`exec`, or :func:`eval`, or when reading the initial script or standard input (also interactively).
pt_pt: Levantada quando o analisador encontra um erro de sintaxe. Isto pode ocorrer numa instrução :keyword:`import`, numa chamada às funções incorporadas :func:`compile`, :func:`exec`, ou :func:`eval`, ou ao ler o script inicial ou a entrada padrão (também interativamente).
ru: Возникает, когда синтаксический анализатор обнаруживает синтаксическую ошибку. Это может произойти в операторе :keyword:`import`, при вызове встроенных функций :func:`compile`, :func:`exec` или :func:`eval` или при чтении исходного скрипта. или стандартный ввод (также в интерактивном режиме).

source: The :func:`str` of the exception instance returns only the error message. Details is a tuple whose members are also available as separate attributes.
pt_pt: A :func:`str` da instância da exceção retorna apenas a mensagem de erro. Os detalhes são um tuplo cujos membros também estão disponíveis como atributos separados.
ru: :func:`str` экземпляра исключения возвращает только сообщение об ошибке. Details — это кортеж, члены которого также доступны как отдельные атрибуты.

source: The name of the file the syntax error occurred in.
pt_pt: O nome do ficheiro onde ocorreu o erro de sintaxe.
ru: Имя файла, в котором произошла синтаксическая ошибка.

source: Which line number in the file the error occurred in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
pt_pt: O número da linha no ficheiro onde ocorreu o erro. Isto é indexado a 1: a primeira linha no ficheiro tem um ``lineno`` de 1.
ru: В каком номере строки в файле произошла ошибка. Индексируется 1: первая строка в файле имеет ``lineno``, равный 1.

source: The column in the line where the error occurred. This is 1-indexed: the first character in the line has an ``offset`` of 1.
pt_pt: A coluna na linha onde ocorreu o erro. Isto é indexado a 1: o primeiro caractere na linha tem um ``offset`` de 1.
ru: Столбец в строке, в которой произошла ошибка. Это индекс 1: первый символ в строке имеет смещение, равное 1.

source: The source code text involved in the error.
pt_pt: O texto do código-fonte envolvido no erro.
ru: Текст исходного кода, связанный с ошибкой.

source: Which line number in the file the error occurred ends in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
pt_pt: O número da linha no ficheiro onde o erro termina. Isto é indexado a 1: a primeira linha no ficheiro tem um ``lineno`` de 1.
ru: На каком номере строки в файле заканчивается ошибка. Это индекс 1: первая строка в файле имеет ``lineno``, равный 1.

source: The column in the end line where the error occurred finishes. This is 1-indexed: the first character in the line has an ``offset`` of 1.
pt_pt: A coluna na linha final onde o erro termina. Isto é indexado a 1: o primeiro caractere na linha tem um ``offset`` de 1.
ru: Столбец в конечной строке, в котором произошла ошибка, заканчивается. Это индекс 1: первый символ в строке имеет смещение, равное 1.

source: For errors in f-string fields, the message is prefixed by "f-string: " and the offsets are offsets in a text constructed from the replacement expression. For example, compiling f'Bad {a b} field' results in this args attribute: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).
pt_pt: Para erros em campos de f-strings, a mensagem é prefixada por "f-string: " e os offsets são offsets num texto construído a partir da expressão de substituição. Por exemplo, compilar f'Bad {a b} field' resulta neste atributo args: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).
ru: В случае ошибок в полях f-строки сообщение начинается с префикса «f-строка:», а смещения представляют собой смещения в тексте, созданном на основе выражения замены. Например, компиляция поля f'Bad {ab}' приводит к следующему атрибуту args: ('f-string: ...', ('', 1, 2, '(ab)\n', 1, 5)) .

source: Added the :attr:`end_lineno` and :attr:`end_offset` attributes.
pt_pt: Adicionados os atributos :attr:`end_lineno` e :attr:`end_offset`.
ru: Добавлены атрибуты :attr:`end_lineno` и :attr:`end_offset`.

source: Base class for syntax errors related to incorrect indentation. This is a subclass of :exc:`SyntaxError`.
pt_pt: Classe base para erros de sintaxe relacionados com indentação incorreta. Esta é uma subclasse de :exc:`SyntaxError`.
ru: Базовый класс для синтаксических ошибок, связанных с неправильным отступом. Это подкласс :exc:`SyntaxError`.

source: Raised when indentation contains an inconsistent use of tabs and spaces. This is a subclass of :exc:`IndentationError`.
pt_pt: Levantada quando a indentação contém um uso inconsistente de tabulações e espaços. Esta é uma subclasse de :exc:`IndentationError`.
ru: Возникает, когда отступ содержит непоследовательное использование табуляции и пробелов. Это подкласс :exc:`IndentationError`.

source: A call to :func:`sys.exit` is translated into an exception so that clean-up handlers (:keyword:`finally` clauses of :keyword:`try` statements) can be executed, and so that a debugger can execute a script without running the risk of losing control. The :func:`os._exit` function can be used if it is absolutely positively necessary to exit immediately (for example, in the child process after a call to :func:`os.fork`).
pt_pt: Uma chamada a :func:`sys.exit` é traduzida numa exceção para que os manipuladores de limpeza (cláusulas :keyword:`finally` de instruções :keyword:`try`) possam ser executados, e para que um depurador possa executar um script sem o risco de perder o controlo. A função :func:`os._exit` pode ser utilizada se for absolutamente necessário sair imediatamente (por exemplo, no processo filho após uma chamada a :func:`os.fork`).
ru: Вызов :func:`sys.exit` преобразуется в исключение, чтобы можно было выполнить обработчики очистки (предложения :keyword:`finally` операторов :keyword:`try`) и чтобы отладчик мог выполнить сценарий без риска потери контроля. Функцию :func:`os._exit` можно использовать, если абсолютно необходимо немедленно завершить работу (например, в дочернем процессе после вызова :func:`os.fork`).

source: The exit status or error message that is passed to the constructor. (Defaults to ``None``.)
pt_pt: O estado de saída ou mensagem de erro que é passado ao construtor. (Por predefinição é ``None``.)
ru: Статус завершения или сообщение об ошибке, передаваемое конструктору. (По умолчанию «Нет».)

source: Raised when an operation or function is applied to an object of inappropriate type. The associated value is a string giving details about the type mismatch.
pt_pt: Levantada quando uma operação ou função é aplicada a um objeto de tipo inapropriado. O valor associado é uma string que fornece detalhes sobre a incompatibilidade de tipos.
ru: Возникает, когда операция или функция применяется к объекту неподходящего типа. Связанное значение представляет собой строку, предоставляющую подробную информацию о несоответствии типов.
