Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/formatter.po
Languages: uk

source: :mod:`formatter` --- Generic output formatting
uk: :mod:`formatter` --- Загальне форматування виводу

source: Due to lack of usage, the formatter module has been deprecated.
uk: Через відсутність використання модуль форматування застарів.

source: This module supports two interface definitions, each with multiple implementations: The *formatter* interface, and the *writer* interface which is required by the formatter interface.
uk: Цей модуль підтримує два визначення інтерфейсу, кожен з яких має декілька реалізацій: інтерфейс *formatter* та інтерфейс *writer*, який потрібен інтерфейсу formatter.

source: Formatter objects transform an abstract flow of formatting events into specific output events on writer objects. Formatters manage several stack structures to allow various properties of a writer object to be changed and restored; writers need not be able to handle relative changes nor any sort of "change back" operation. Specific writer properties which may be controlled via formatter objects are horizontal alignment, font, and left margin indentations. A mechanism is provided which supports providing arbitrary, non-exclusive style settings to a writer as well. Additional interfaces facilitate formatting events which are not reversible, such as paragraph separation.
uk: Об’єкти форматувальника перетворюють абстрактний флоу подій форматування в конкретні вихідні події об’єктів запису. Форматери керують декількома структурами стеків, щоб дозволити змінювати та відновлювати різні властивості об’єкта запису; автори не здатні обробляти відносні зміни або будь-яку операцію "змінити назад". Спеціальними властивостями запису, якими можна керувати за допомогою об’єктів форматування, є горизонтальне вирівнювання, шрифт і відступи лівого поля. Існує механізм, який також підтримує надання довільних, невиключних налаштувань стилів для автора. Додаткові інтерфейси полегшують форматування подій, які не можна оборотити, наприклад розділення абзаців.

source: Writer objects encapsulate device interfaces. Abstract devices, such as file formats, are supported as well as physical devices. The provided implementations all work with abstract devices. The interface makes available mechanisms for setting the properties which formatter objects manage and inserting data into the output.
uk: Об’єкти автора інкапсулюють інтерфейси пристроїв. Абстрактні пристрої, як-от формати файлів, підтримуються так само добре як і фізичні пристрої. Усі надані реалізації працюють з абстрактними пристроями. Інтерфейс надає доступні механізми для встановлення властивостей, якими керують об’єкти форматування і додають у вихідні дані.

source: The Formatter Interface
uk: Інтерфейс форматувальника

source: Interfaces to create formatters are dependent on the specific formatter class being instantiated. The interfaces described below are the required interfaces which all formatters must support once initialized.
uk: Інтерфейси для створення форматувальників залежать від конкретного класу форматувальника, який створюється. Інтерфейси, описані нижче, є обов’язковими інтерфейсами, які всі форматувальники мають підтримувати після ініціалізації.

source: One data element is defined at the module level:
uk: Один елемент даних визначається на рівні модуля:

source: Value which can be used in the font specification passed to the ``push_font()`` method described below, or as the new value to any other ``push_property()`` method. Pushing the ``AS_IS`` value allows the corresponding ``pop_property()`` method to be called without having to track whether the property was changed.
uk: Значення, яке можна використовувати в специфікації шрифту, передане методу ``push_font()``, описаному нижче, або як нове значення до будь-якого іншого методу ``push_property()``. Додавання значення ``AS_IS`` дозволяє викликати відповідний метод ``pop_property()`` без необхідності відстежувати, чи було змінено властивість.

source: The following attributes are defined for formatter instance objects:
uk: Наступні атрибути визначено для об’єктів екземпляра засобу для форматування:

source: The writer instance with which the formatter interacts.
uk: Екземпляр запису, з яким взаємодіє засіб форматування.

source: Close any open paragraphs and insert at least *blanklines* before the next paragraph.
uk: Закрийте всі відкриті абзаци та вставте принаймні *порожні рядки* перед наступним абзацом.

source: Add a hard line break if one does not already exist. This does not break the logical paragraph.
uk: Додайте розрив рядка, якщо він ще не існує. Це не порушує логічний абзац.

source: Insert a horizontal rule in the output. A hard break is inserted if there is data in the current paragraph, but the logical paragraph is not broken. The arguments and keywords are passed on to the writer's :meth:`send_line_break` method.
uk: Вставте горизонтальну лінію у вихідні дані. Жорсткий розрив вставляється, якщо в поточному абзаці є дані, але логічний абзац не розірвано. Аргументи та ключові слова передаються до методу автора :meth:`send_line_break`.

source: Provide data which should be formatted with collapsed whitespace. Whitespace from preceding and successive calls to :meth:`add_flowing_data` is considered as well when the whitespace collapse is performed. The data which is passed to this method is expected to be word-wrapped by the output device. Note that any word-wrapping still must be performed by the writer object due to the need to rely on device and font information.
uk: Надані дані, які мають бути відформатовані зі згорнутими пробілами. Пробіли від попередніх і наступних викликів :meth:`add_flowing_data` також враховуються, коли виконується згортання пробілів. Очікується, що дані, які передаються в цей метод, будуть перенесені по словах на пристрої виводу. Зауважте, що будь-яке перенесення слів все одно має виконуватися об’єктом writer через необхідність покладатися на інформацію про пристрій і шрифт.

source: Provide data which should be passed to the writer unchanged. Whitespace, including newline and tab characters, are considered legal in the value of *data*.
uk: Надайте дані, які слід передати автору без змін. Пробіли, включаючи символи нового рядка та табуляції, вважаються допустимими значеннями *data*.

source: Restore the previous alignment.
uk: Відновити попереднє вирівнювання.

source: Change some or all font properties of the writer object. Properties which are not set to :const:`AS_IS` are set to the values passed in while others are maintained at their current settings. The writer's :meth:`new_font` method is called with the fully resolved font specification.
uk: Змініть деякі або всі властивості шрифту об’єкта writer. Для властивостей, для яких не встановлено значення :const:`AS_IS`, встановлюються передані значення, а для інших зберігаються поточні налаштування. Метод автора :meth:`new_font` викликається з повністю визначеною специфікацією шрифту.

source: Restore the previous font.
uk: Відновити попередній шрифт.

source: Increase the number of left margin indentations by one, associating the logical tag *margin* with the new indentation. The initial margin level is ``0``. Changed values of the logical tag must be true values; false values other than :const:`AS_IS` are not sufficient to change the margin.
uk: Збільште кількість відступів лівого поля на один, пов’язавши логічний тег *margin* із новим відступом. Початковий рівень відступу ``0`` Змінені значення логічного тегу мають бути true; значення false, окрім :const:`AS_IS`, недостатньо для зміни поля.

source: Restore the previous margin.
uk: Відновити попередній відступ.

source: Push any number of arbitrary style specifications. All styles are pushed onto the styles stack in order. A tuple representing the entire stack, including :const:`AS_IS` values, is passed to the writer's :meth:`new_styles` method.
uk: Введіть будь-яку кількість довільних стилів. Усі вони поміщаються в стек стилів по порядку. Кортеж, що представляє весь стек, включаючи значення :const:`AS_IS`, передається у метод :meth:`new_styles` автора.

source: Pop the last *n* style specifications passed to :meth:`push_style`. A tuple representing the revised stack, including :const:`AS_IS` values, is passed to the writer's :meth:`new_styles` method.
uk: Витягнути останні *n* специфікації стилю, передані в :meth:`push_style`. Кортеж, що представляє виправлений стек, включаючи значення :const:`AS_IS`, передається в метод :meth:`new_styles` автора.

source: Set the spacing style for the writer.
uk: Установіть стиль інтервалів для автора.

source: Inform the formatter that data has been added to the current paragraph out-of-band. This should be used when the writer has been manipulated directly. The optional *flag* argument can be set to false if the writer manipulations produced a hard line break at the end of the output.
uk: Повідомте форматувальник, що дані додано до поточного абзацу поза смугою. Це слід використовувати, коли автором безпосередньо маніпулювали. Необов’язковий аргумент *flag* може бути встановлений на false, якщо маніпуляції з програмою запису призвели до розриву рядка в кінці виводу.

source: Formatter Implementations
uk: Реалізації форматера

source: Two implementations of formatter objects are provided by this module. Most applications may use one of these classes without modification or subclassing.
uk: Цей модуль забезпечує дві реалізації об’єктів форматування. Більшість програм можуть використовувати один із цих класів без модифікації чи створення підкласів.

source: A formatter which does nothing. If *writer* is omitted, a :class:`NullWriter` instance is created. No methods of the writer are called by :class:`NullFormatter` instances. Implementations should inherit from this class if implementing a writer interface but don't need to inherit any implementation.
uk: Форматувальник, який нічого не робить. Якщо *writer* опущено, створюється екземпляр :class:`NullWriter`. Жодні методи записувача не викликаються екземплярами :class:`NullFormatter`. Реалізації повинні успадковувати цей клас, якщо реалізовано інтерфейс запису, але не потрібно успадковувати будь-яку реалізацію.

source: The standard formatter. This implementation has demonstrated wide applicability to many writers, and may be used directly in most circumstances. It has been used to implement a full-featured World Wide Web browser.
uk: Стандартний форматувальник. Ця реалізація продемонструвала широку застосовність для багатьох авторів і може використовуватися в більшості випадків. Він був використаний щоб реалізувати повнофункціонального браузера World Wide Web.

source: Flush any buffered output or device control events.
uk: Очистити будь-який буферизований вивід або події керування пристроєм.

source: Set the margin level to the integer *level* and the logical tag to *margin*. Interpretation of the logical tag is at the writer's discretion; the only restriction on the value of the logical tag is that it not be a false value for non-zero values of *level*.
uk: Вказати значення відступу як ціле число *level* і логічний тег на *margin*. Вибір значень для логічного тегу на розсуд автора; єдине обмеження полягає в тому, щоб воно не було значенням false для ненульових значень *level*.

source: Set the spacing style to *spacing*.
uk: Встановити стиль інтервалів на *інтервал*.

source: Set additional styles. The *styles* value is a tuple of arbitrary values; the value :const:`AS_IS` should be ignored. The *styles* tuple may be interpreted either as a set or as a stack depending on the requirements of the application and writer implementation.
uk: Встановити додаткові стилі. Значення *styles* — це кортеж довільних значень; значення :const:`AS_IS` слід ігнорувати. Кортеж *styles* може інтерпретуватися або як набір, або як стек, залежно від вимог програми та реалізації програми.

source: Break the current line.
uk: Розірвати поточний рядок.

source: Writer Implementations
uk: Реалізація автора

source: Three implementations of the writer object interface are provided as examples by this module. Most applications will need to derive new writer classes from the :class:`NullWriter` class.
uk: Цей модуль надає приклади трьох реалізацій інтерфейсу об’єкта автора. Більшості додатків потрібно буде отримати нові класи запису з класу :class:`NullWriter`.

source: A writer which only provides the interface definition; no actions are taken on any methods. This should be the base class for all writers which do not need to inherit any implementation methods.
uk: Автор, який надає лише визначення інтерфейсу; ніяких дій не відбувається з жодним із методів. Це має бути базовий клас для всіх авторів, яким не потрібно успадковувати жодних методів реалізації.

source: A writer which can be used in debugging formatters, but not much else. Each method simply announces itself by printing its name and arguments on standard output.
uk: Автор, який можна використовувати для налагодження програм форматування, але не для чогось іншого. Кожен метод просто повідомляє про себе, друкуючи своє ім’я та аргументи на стандартному виводі.

source: Simple writer class which writes output on the :term:`file object` passed in as *file* or, if *file* is omitted, on standard output. The output is simply word-wrapped to the number of columns specified by *maxcol*. This class is suitable for reflowing a sequence of paragraphs.
uk: Простий клас запису, який записує вихідні дані в об’єкт :term:`file`, який передається як *file* або, якщо *file* пропущено, у стандартний вивід. Вивід просто переноситься на кількість стовпців, указану *maxcol*. Цей клас підходить для перекомпонування послідовності абзаців.
