Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/gettext.po
Languages: pt_pt

source: Look up the *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id, and a fallback has been set, the look up is forwarded to the fallback's :meth:`~NullTranslations.gettext` method. Otherwise, the *message* id is returned.
pt_pt: Procura o ID de *mensagem* no catálogo e retorna a string de mensagem correspondente, como uma string Unicode. Se não houver entrada no catálogo para o ID de *mensagem* e um fallback tiver sido definido, a pesquisa é encaminhada para o método :meth:`~NullTranslations.gettext` do fallback. Caso contrário, o ID de *mensagem* é retornado.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use. The returned message string is a Unicode string.
pt_pt: Realiza uma pesquisa de formas plurais de um ID de mensagem. *singular* é usado como o ID de mensagem para fins de pesquisa no catálogo, enquanto *n* é usado para determinar qual forma plural usar. A string de mensagem retornada é uma string Unicode.

source: If the message id is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`~NullTranslations.ngettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
pt_pt: Se o ID da mensagem não for encontrado no catálogo e um fallback for especificado, o pedido é encaminhado para o método :meth:`~NullTranslations.ngettext` do fallback. Caso contrário, quando *n* é 1, *singular* é retornado e *plural* é retornado em todos os outros casos.

source: Here is an example::
pt_pt: Aqui está um exemplo::

source: n = len(os.listdir('.')) cat = GNUTranslations(somefile) message = cat.ngettext( 'There is %(num)d file in this directory', 'There are %(num)d files in this directory', n) % {'num': n}
pt_pt: n = len(os.listdir('.')) cat = GNUTranslations(somefile) message = cat.ngettext( 'Existe %(num)d ficheiro neste diretório', 'Existem %(num)d ficheiros neste diretório', n) % {'num': n}

source: Look up the *context* and *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id and *context*, and a fallback has been set, the look up is forwarded to the fallback's :meth:`pgettext` method. Otherwise, the *message* id is returned.
pt_pt: Procura o *contexto* e o ID de *mensagem* no catálogo e retorna a string de mensagem correspondente, como uma string Unicode. Se não houver entrada no catálogo para o ID de *mensagem* e *contexto*, e um fallback tiver sido definido, a pesquisa é encaminhada para o método :meth:`pgettext` do fallback. Caso contrário, o ID de *mensagem* é retornado.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use.
pt_pt: Realiza uma pesquisa de formas plurais de um ID de mensagem. *singular* é usado como o ID de mensagem para fins de pesquisa no catálogo, enquanto *n* é usado para determinar qual forma plural usar.

source: If the message id for *context* is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`npgettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
pt_pt: Se o ID da mensagem para *contexto* não for encontrado no catálogo e um fallback for especificado, o pedido é encaminhado para o método :meth:`npgettext` do fallback. Caso contrário, quando *n* é 1, *singular* é retornado e *plural* é retornado em todos os outros casos.

source: Solaris message catalog support
pt_pt: Suporte para catálogo de mensagens Solaris

source: The Solaris operating system defines its own binary :file:`.mo` file format, but since no documentation can be found on this format, it is not supported at this time.
pt_pt: O sistema operativo Solaris define o seu próprio formato de ficheiro binário :file:`.mo`, mas como não foi encontrada documentação sobre este formato, não é suportado neste momento.

source: The Catalog constructor
pt_pt: O construtor Catalog

source: GNOME uses a version of the :mod:`gettext` module by James Henstridge, but this version has a slightly different API. Its documented usage was::
pt_pt: O GNOME usa uma versão do módulo :mod:`gettext` de James Henstridge, mas esta versão tem uma API ligeiramente diferente. A sua utilização documentada era::

source: import gettext cat = gettext.Catalog(domain, localedir) _ = cat.gettext print(_('hello world'))
pt_pt: import gettext cat = gettext.Catalog(domain, localedir) _ = cat.gettext print(_('olá mundo'))

source: For compatibility with this older module, the function :func:`!Catalog` is an alias for the :func:`translation` function described above.
pt_pt: Para compatibilidade com este módulo mais antigo, a função :func:`!Catalog` é um alias para a função :func:`translation` descrita acima.

source: One difference between this module and Henstridge's: his catalog objects supported access through a mapping API, but this appears to be unused and so is not currently supported.
pt_pt: Uma diferença entre este módulo e o de Henstridge: os seus objetos de catálogo suportavam acesso através de uma API de mapeamento, mas isto parece não ser usado e, portanto, não é atualmente suportado.

source: Internationalizing your programs and modules
pt_pt: Internacionalizar os seus programas e módulos

source: Internationalization (I18N) refers to the operation by which a program is made aware of multiple languages. Localization (L10N) refers to the adaptation of your program, once internationalized, to the local language and cultural habits. In order to provide multilingual messages for your Python programs, you need to take the following steps:
pt_pt: Internacionalização (I18N) refere-se à operação pela qual um programa é tornado consciente de múltiplas línguas. Localização (L10N) refere-se à adaptação do seu programa, uma vez internacionalizado, à língua local e hábitos culturais. Para fornecer mensagens multilíngues para os seus programas Python, precisa de seguir os seguintes passos:

source: prepare your program or module by specially marking translatable strings
pt_pt: preparar o seu programa ou módulo marcando especialmente as strings traduzíveis

source: run a suite of tools over your marked files to generate raw messages catalogs
pt_pt: executar um conjunto de ferramentas sobre os seus ficheiros marcados para gerar catálogos de mensagens brutos

source: create language-specific translations of the message catalogs
pt_pt: criar traduções específicas de língua dos catálogos de mensagens

source: use the :mod:`gettext` module so that message strings are properly translated
pt_pt: usar o módulo :mod:`gettext` para que as strings de mensagem sejam devidamente traduzidas

source: In order to prepare your code for I18N, you need to look at all the strings in your files. Any string that needs to be translated should be marked by wrapping it in ``_('...')`` --- that is, a call to the function :func:`_ <gettext>`. For example::
pt_pt: Para preparar o seu código para I18N, precisa de analisar todas as strings nos seus ficheiros. Qualquer string que precise de ser traduzida deve ser marcada envolvendo-a em ``_('...')`` --- isto é, uma chamada à função :func:`_ <gettext>`. Por exemplo::

source: filename = 'mylog.txt' message = _('writing a log message') with open(filename, 'w') as fp: fp.write(message)
pt_pt: filename = 'mylog.txt' message = _('a escrever uma mensagem de registo') with open(filename, 'w') as fp: fp.write(message)

source: In this example, the string ``'writing a log message'`` is marked as a candidate for translation, while the strings ``'mylog.txt'`` and ``'w'`` are not.
pt_pt: Neste exemplo, a string ``'writing a log message'`` é marcada como candidata à tradução, enquanto as strings ``'mylog.txt'`` e ``'w'`` não são.

source: There are a few tools to extract the strings meant for translation. The original GNU :program:`gettext` only supported C or C++ source code but its extended version :program:`xgettext` scans code written in a number of languages, including Python, to find strings marked as translatable. `Babel <https://babel.pocoo.org/>`__ is a Python internationalization library that includes a :file:`pybabel` script to extract and compile message catalogs. François Pinard's program called :program:`xpot` does a similar job and is available as part of his `po-utils package <https://github.com/pinard/po-utils>`__.
pt_pt: Existem algumas ferramentas para extrair as strings destinadas à tradução. O GNU :program:`gettext` original suportava apenas código-fonte C ou C++, mas a sua versão estendida :program:`xgettext` analisa código escrito em várias línguas, incluindo Python, para encontrar strings marcadas como traduzíveis. `Babel <https://babel.pocoo.org/>`__ é uma biblioteca de internacionalização Python que inclui um script :file:`pybabel` para extrair e compilar catálogos de mensagens. O programa de François Pinard chamado :program:`xpot` faz um trabalho semelhante e está disponível como parte do seu `pacote po-utils <https://github.com/pinard/po-utils>`__.

source: (Python also includes pure-Python versions of these programs, called :program:`pygettext.py` and :program:`msgfmt.py`; some Python distributions will install them for you. :program:`pygettext.py` is similar to :program:`xgettext`, but only understands Python source code and cannot handle other programming languages such as C or C++. :program:`pygettext.py` supports a command-line interface similar to :program:`xgettext`; for details on its use, run ``pygettext.py --help``. :program:`msgfmt.py` is binary compatible with GNU :program:`msgfmt`. With these two programs, you may not need the GNU :program:`gettext` package to internationalize your Python applications.)
pt_pt: (Python também inclui versões puras em Python destes programas, chamadas :program:`pygettext.py` e :program:`msgfmt.py`; algumas distribuições Python irão instalá-los para si. :program:`pygettext.py` é semelhante a :program:`xgettext`, mas só entende código-fonte Python e não pode lidar com outras linguagens de programação como C ou C++. :program:`pygettext.py` suporta uma interface de linha de comando semelhante a :program:`xgettext`; para detalhes sobre o seu uso, execute ``pygettext.py --help``. :program:`msgfmt.py` é compatível binariamente com GNU :program:`msgfmt`. Com estes dois programas, pode não precisar do pacote GNU :program:`gettext` para internacionalizar as suas aplicações Python.)

source: :program:`xgettext`, :program:`pygettext`, and similar tools generate :file:`.po` files that are message catalogs. They are structured human-readable files that contain every marked string in the source code, along with a placeholder for the translated versions of these strings.
pt_pt: :program:`xgettext`, :program:`pygettext` e ferramentas semelhantes geram ficheiros :file:`.po` que são catálogos de mensagens. São ficheiros estruturados legíveis por humanos que contêm todas as strings marcadas no código-fonte, juntamente com um espaço reservado para as versões traduzidas destas strings.

source: Copies of these :file:`.po` files are then handed over to the individual human translators who write translations for every supported natural language. They send back the completed language-specific versions as a :file:`<language-name>.po` file that's compiled into a machine-readable :file:`.mo` binary catalog file using the :program:`msgfmt` program. The :file:`.mo` files are used by the :mod:`gettext` module for the actual translation processing at run-time.
pt_pt: Cópias destes ficheiros :file:`.po` são então entregues aos tradutores humanos individuais que escrevem traduções para cada língua natural suportada. Eles enviam de volta as versões específicas da língua concluídas como um ficheiro :file:`<language-name>.po` que é compilado num ficheiro de catálogo binário :file:`.mo` legível por máquina usando o programa :program:`msgfmt`. Os ficheiros :file:`.mo` são usados pelo módulo :mod:`gettext` para o processamento real da tradução em tempo de execução.

source: How you use the :mod:`gettext` module in your code depends on whether you are internationalizing a single module or your entire application. The next two sections will discuss each case.
pt_pt: Como usa o módulo :mod:`gettext` no seu código depende de estar a internacionalizar um único módulo ou toda a sua aplicação. As próximas duas secções irão discutir cada caso.

source: Localizing your module
pt_pt: Localizar o seu módulo

source: If you are localizing your module, you must take care not to make global changes, e.g. to the built-in namespace. You should not use the GNU :program:`gettext` API but instead the class-based API.
pt_pt: Se estiver a localizar o seu módulo, deve ter cuidado para não fazer alterações globais, por exemplo, ao espaço de nomes integrado. Não deve usar a API GNU :program:`gettext`, mas sim a API baseada em classes.

source: Let's say your module is called "spam" and the module's various natural language translation :file:`.mo` files reside in :file:`/usr/share/locale` in GNU :program:`gettext` format. Here's what you would put at the top of your module::
pt_pt: Suponha que o seu módulo se chama "spam" e que os vários ficheiros de tradução :file:`.mo` do módulo em língua natural residem em :file:`/usr/share/locale` no formato GNU :program:`gettext`. Aqui está o que colocaria no topo do seu módulo::

source: Localizing your application
pt_pt: Localizar a sua aplicação

source: If you are localizing your application, you can install the :func:`!_` function globally into the built-in namespace, usually in the main driver file of your application. This will let all your application-specific files just use ``_('...')`` without having to explicitly install it in each file.
pt_pt: Se estiver a localizar a sua aplicação, pode instalar a função :func:`!_` globalmente no espaço de nomes integrado, geralmente no ficheiro principal da sua aplicação. Isto permitirá que todos os ficheiros específicos da sua aplicação usem simplesmente ``_('...')`` sem ter de a instalar explicitamente em cada ficheiro.

source: In the simple case then, you need only add the following bit of code to the main driver file of your application::
pt_pt: No caso simples, então, só precisa de adicionar o seguinte trecho de código ao ficheiro principal da sua aplicação::

source: If you need to set the locale directory, you can pass it into the :func:`install` function::
pt_pt: Se precisar de definir o diretório de localidade, pode passá-lo para a função :func:`install`::

source: Changing languages on the fly
pt_pt: Mudar línguas em tempo de execução

source: If your program needs to support many languages at the same time, you may want to create multiple translation instances and then switch between them explicitly, like so::
pt_pt: Se o seu programa precisar de suportar muitas línguas ao mesmo tempo, pode querer criar várias instâncias de tradução e depois alternar entre elas explicitamente, como segue::

source: import gettext lang1 = gettext.translation('myapplication', languages=['en']) lang2 = gettext.translation('myapplication', languages=['fr']) lang3 = gettext.translation('myapplication', languages=['de']) # start by using language1 lang1.install() # ... time goes by, user selects language 2 lang2.install() # ... more time goes by, user selects language 3 lang3.install()
pt_pt: import gettext lang1 = gettext.translation('myapplication', languages=['en']) lang2 = gettext.translation('myapplication', languages=['fr']) lang3 = gettext.translation('myapplication', languages=['de']) # começar usando language1 lang1.install() # ... o tempo passa, o utilizador seleciona a língua 2 lang2.install() # ... passa mais tempo, o utilizador seleciona a língua 3 lang3.install()

source: Deferred translations
pt_pt: Traduções adiada

source: In most coding situations, strings are translated where they are coded. Occasionally however, you need to mark strings for translation, but defer actual translation until later. A classic example is::
pt_pt: Na maioria das situações de codificação, as strings são traduzidas onde são codificadas. No entanto, ocasionalmente, precisa de marcar strings para tradução, mas adiar a tradução real até mais tarde. Um exemplo clássico é::

source: animals = ['mollusk', 'albatross', 'rat', 'penguin', 'python', ] # ... for a in animals: print(a)
pt_pt: animals = ['molusco', 'albatroz', 'rato', 'pinguim', 'python', ] # ... for a in animals: print(a)

source: Here, you want to mark the strings in the ``animals`` list as being translatable, but you don't actually want to translate them until they are printed.
pt_pt: Aqui, deseja marcar as strings na lista ``animals`` como sendo traduzíveis, mas não quer realmente traduzir até que sejam impressas.

source: Here is one way you can handle this situation::
pt_pt: Aqui está uma forma de lidar com esta situação::

source: def _(message): return message animals = [_('mollusk'), _('albatross'), _('rat'), _('penguin'), _('python'), ] del _ # ... for a in animals: print(_(a))
pt_pt: def _(message): return message animals = [_('molusco'), _('albatroz'), _('rato'), _('pinguim'), _('python'), ] del _ # ... for a in animals: print(_(a))

source: This works because the dummy definition of :func:`!_` simply returns the string unchanged. And this dummy definition will temporarily override any definition of :func:`!_` in the built-in namespace (until the :keyword:`del` command). Take care, though if you have a previous definition of :func:`!_` in the local namespace.
pt_pt: Isto funciona porque a definição fictícia de :func:`!_` simplesmente retorna a string inalterada. E esta definição fictícia substituirá temporariamente qualquer definição de :func:`!_` no espaço de nomes integrado (até ao comando :keyword:`del`). Tenha cuidado, no entanto, se tiver uma definição anterior de :func:`!_` no espaço de nomes local.

source: Note that the second use of :func:`!_` will not identify "a" as being translatable to the :program:`gettext` program, because the parameter is not a string literal.
pt_pt: Note que o segundo uso de :func:`!_` não identificará "a" como sendo traduzível para o programa :program:`gettext`, porque o parâmetro não é um literal de string.

source: Another way to handle this is with the following example::
pt_pt: Outra forma de lidar com isto é com o seguinte exemplo::

source: def N_(message): return message animals = [N_('mollusk'), N_('albatross'), N_('rat'), N_('penguin'), N_('python'), ] # ... for a in animals: print(_(a))
pt_pt: def N_(message): return message animals = [N_('molusco'), N_('albatroz'), N_('rato'), N_('pinguim'), N_('python'), ] # ... for a in animals: print(_(a))

source: In this case, you are marking translatable strings with the function :func:`!N_`, which won't conflict with any definition of :func:`!_`. However, you will need to teach your message extraction program to look for translatable strings marked with :func:`!N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract``, and :program:`xpot` all support this through the use of the :option:`!-k` command-line switch. The choice of :func:`!N_` here is totally arbitrary; it could have just as easily been :func:`!MarkThisStringForTranslation`.
pt_pt: Neste caso, está a marcar strings traduzíveis com a função :func:`!N_`, que não entrará em conflito com qualquer definição de :func:`!_`. No entanto, terá de ensinar o seu programa de extração de mensagens a procurar strings traduzíveis marcadas com :func:`!N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract`` e :program:`xpot` suportam isto através do uso da opção de linha de comandos :option:`!-k`. A escolha de :func:`!N_` aqui é totalmente arbitrária; poderia ter sido facilmente :func:`!MarkThisStringForTranslation`.

source: Acknowledgements
pt_pt: Agradecimentos

source: The following people contributed code, feedback, design suggestions, previous implementations, and valuable experience to the creation of this module:
pt_pt: As seguintes pessoas contribuíram com código, feedback, sugestões de design, implementações anteriores e experiência valiosa para a criação deste módulo:

source: Footnotes
pt_pt: Notas de rodapé

source: The default locale directory is system dependent; for example, on Red Hat Linux it is :file:`/usr/share/locale`, but on Solaris it is :file:`/usr/lib/locale`. The :mod:`!gettext` module does not try to support these system dependent defaults; instead its default is :file:`{sys.base_prefix}/share/locale` (see :data:`sys.base_prefix`). For this reason, it is always best to call :func:`bindtextdomain` with an explicit absolute path at the start of your application.
pt_pt: O diretório de localidade padrão é dependente do sistema; por exemplo, no Red Hat Linux é :file:`/usr/share/locale`, mas no Solaris é :file:`/usr/lib/locale`. O módulo :mod:`!gettext` não tenta suportar estes padrões dependentes do sistema; em vez disso, o seu padrão é :file:`{sys.base_prefix}/share/locale` (ver :data:`sys.base_prefix`). Por esta razão, é sempre melhor chamar :func:`bindtextdomain` com um caminho absoluto explícito no início da sua aplicação.

source: See the footnote for :func:`bindtextdomain` above.
pt_pt: Ver a nota de rodapé para :func:`bindtextdomain` acima.

source: _ (underscore)
pt_pt: _ (sublinhado)
