Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/gettext.po
Languages: pt_pt

source: :mod:`!gettext` --- Multilingual internationalization services
pt_pt: :mod:`!gettext` --- Serviços de internacionalização multilíngue

source: **Source code:** :source:`Lib/gettext.py`
pt_pt: **Código-fonte:** :source:`Lib/gettext.py`

source: The :mod:`gettext` module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. It supports both the GNU :program:`gettext` message catalog API and a higher level, class-based API that may be more appropriate for Python files. The interface described below allows you to write your module and application messages in one natural language, and provide a catalog of translated messages for running under different natural languages.
pt_pt: O módulo :mod:`gettext` fornece serviços de internacionalização (I18N) e localização (L10N) para os seus módulos e aplicações Python. Suporta tanto a API de catálogo de mensagens GNU :program:`gettext` como uma API de nível superior, baseada em classes, que pode ser mais adequada para ficheiros Python. A interface descrita abaixo permite-lhe escrever as mensagens do seu módulo e aplicação numa língua natural e fornecer um catálogo de mensagens traduzidas para execução em diferentes línguas naturais.

source: Some hints on localizing your Python modules and applications are also given.
pt_pt: Também são dadas algumas dicas sobre a localização dos seus módulos e aplicações Python.

source: GNU :program:`gettext` API
pt_pt: API GNU :program:`gettext`

source: The :mod:`gettext` module defines the following API, which is very similar to the GNU :program:`gettext` API. If you use this API you will affect the translation of your entire application globally. Often this is what you want if your application is monolingual, with the choice of language dependent on the locale of your user. If you are localizing a Python module, or if your application needs to switch languages on the fly, you probably want to use the class-based API instead.
pt_pt: O módulo :mod:`gettext` define a seguinte API, que é muito semelhante à API GNU :program:`gettext`. Se usar esta API, afetará a tradução de toda a sua aplicação globalmente. Muitas vezes, é isto que deseja se a sua aplicação for monolingue, com a escolha da língua dependente da localidade do seu utilizador. Se estiver a localizar um módulo Python, ou se a sua aplicação precisar de mudar de línguas em tempo de execução, provavelmente desejará usar a API baseada em classes.

source: Bind the *domain* to the locale directory *localedir*. More concretely, :mod:`gettext` will look for binary :file:`.mo` files for the given domain using the path (on Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, where *language* is searched for in the environment variables :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG` respectively.
pt_pt: Associa o *domínio* ao diretório de localidade *localedir*. Mais concretamente, o :mod:`gettext` procurará ficheiros binários :file:`.mo` para o domínio dado usando o caminho (em Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, onde *language* é procurado nas variáveis de ambiente :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` e :envvar:`LANG`, respetivamente.

source: If *localedir* is omitted or ``None``, then the current binding for *domain* is returned. [#]_
pt_pt: Se *localedir* for omitido ou ``None``, então a ligação atual para *domain* é retornada. [#]_

source: Change or query the current global domain. If *domain* is ``None``, then the current global domain is returned, otherwise the global domain is set to *domain*, which is returned.
pt_pt: Alterar ou consultar o domínio global atual. Se *domain* for ``None``, então o domínio global atual é retornado; caso contrário, o domínio global é definido para *domain*, que é retornado.

source: Return the localized translation of *message*, based on the current global domain, language, and locale directory. This function is usually aliased as :func:`!_` in the local namespace (see examples below).
pt_pt: Retorna a tradução localizada de *message*, com base no domínio global atual, língua e diretório de localidade. Esta função é geralmente usada como alias para :func:`!_` no espaço de nomes local (ver exemplos abaixo).

source: Like :func:`.gettext`, but look the message up in the specified *domain*.
pt_pt: Semelhante a :func:`.gettext`, mas procura a mensagem no *domínio* especificado.

source: Like :func:`.gettext`, but consider plural forms. If a translation is found, apply the plural formula to *n*, and return the resulting message (some languages have more than two plural forms). If no translation is found, return *singular* if *n* is 1; return *plural* otherwise.
pt_pt: Semelhante a :func:`.gettext`, mas considera formas plurais. Se uma tradução for encontrada, aplica a fórmula plural a *n* e retorna a mensagem resultante (algumas línguas têm mais de duas formas plurais). Se nenhuma tradução for encontrada, retorna *singular* se *n* for 1; retorna *plural* caso contrário.

source: The Plural formula is taken from the catalog header. It is a C or Python expression that has a free variable *n*; the expression evaluates to the index of the plural in the catalog. See `the GNU gettext documentation <https://www.gnu.org/software/gettext/manual/gettext.html>`__ for the precise syntax to be used in :file:`.po` files and the formulas for a variety of languages.
pt_pt: A fórmula plural é retirada do cabeçalho do catálogo. É uma expressão C ou Python que tem uma variável livre *n*; a expressão avalia para o índice do plural no catálogo. Consulte a `documentação GNU gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`__ para a sintaxe precisa a ser usada em ficheiros :file:`.po` e as fórmulas para uma variedade de línguas.

source: Like :func:`ngettext`, but look the message up in the specified *domain*.
pt_pt: Semelhante a :func:`ngettext`, mas procura a mensagem no *domínio* especificado.

source: Similar to the corresponding functions without the ``p`` in the prefix (that is, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), but the translation is restricted to the given message *context*.
pt_pt: Semelhante às funções correspondentes sem o ``p`` no prefixo (isto é, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), mas a tradução é restrita ao *contexto* da mensagem dado.

source: Note that GNU :program:`gettext` also defines a :func:`!dcgettext` method, but this was deemed not useful and so it is currently unimplemented.
pt_pt: Note que o GNU :program:`gettext` também define um método :func:`!dcgettext`, mas este foi considerado não útil e, portanto, atualmente não está implementado.

source: Here's an example of typical usage for this API::
pt_pt: Aqui está um exemplo de uso típico para esta API::

source: import gettext gettext.bindtextdomain('myapplication', '/path/to/my/language/directory') gettext.textdomain('myapplication') _ = gettext.gettext # ... print(_('This is a translatable string.'))
pt_pt: import gettext gettext.bindtextdomain('myapplication', '/caminho/para/o/meu/diretório/de/linguagem') gettext.textdomain('myapplication') _ = gettext.gettext # ... print(_('Esta é uma string traduzível.'))

source: Class-based API
pt_pt: API baseada em classes

source: The class-based API of the :mod:`gettext` module gives you more flexibility and greater convenience than the GNU :program:`gettext` API. It is the recommended way of localizing your Python applications and modules. :mod:`!gettext` defines a :class:`GNUTranslations` class which implements the parsing of GNU :file:`.mo` format files, and has methods for returning strings. Instances of this class can also install themselves in the built-in namespace as the function :func:`!_`.
pt_pt: A API baseada em classes do módulo :mod:`gettext` oferece-lhe mais flexibilidade e maior conveniência do que a API GNU :program:`gettext`. É a forma recomendada de localizar as suas aplicações e módulos Python. O :mod:`!gettext` define uma classe :class:`GNUTranslations` que implementa a análise de ficheiros de formato GNU :file:`.mo` e tem métodos para retornar strings. Instâncias desta classe também podem instalar-se no espaço de nomes integrado como a função :func:`!_`.

source: This function implements the standard :file:`.mo` file search algorithm. It takes a *domain*, identical to what :func:`textdomain` takes. Optional *localedir* is as in :func:`bindtextdomain`. Optional *languages* is a list of strings, where each string is a language code.
pt_pt: Esta função implementa o algoritmo de pesquisa de ficheiros :file:`.mo` padrão. Aceita um *domínio*, idêntico ao que :func:`textdomain` aceita. O *localedir* opcional é como em :func:`bindtextdomain`. O *languages* opcional é uma lista de strings, onde cada string é um código de língua.

source: If *localedir* is not given, then the default system locale directory is used. [#]_ If *languages* is not given, then the following environment variables are searched: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG`. The first one returning a non-empty value is used for the *languages* variable. The environment variables should contain a colon separated list of languages, which will be split on the colon to produce the expected list of language code strings.
pt_pt: Se *localedir* não for fornecido, então o diretório de localidade padrão do sistema é usado. [#]_ Se *languages* não for fornecido, então as seguintes variáveis de ambiente são pesquisadas: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` e :envvar:`LANG`. A primeira que retornar um valor não vazio é usada para a variável *languages*. As variáveis de ambiente devem conter uma lista de línguas separadas por dois pontos, que será dividida nos dois pontos para produzir a lista esperada de strings de código de língua.

source: :func:`find` then expands and normalizes the languages, and then iterates through them, searching for an existing file built of these components:
pt_pt: :func:`find` então expande e normaliza as línguas e, em seguida, itera através delas, procurando por um ficheiro existente construído a partir destes componentes:

source: The first such file name that exists is returned by :func:`find`. If no such file is found, then ``None`` is returned. If *all* is given, it returns a list of all file names, in the order in which they appear in the languages list or the environment variables.
pt_pt: O primeiro nome de ficheiro que existir é retornado por :func:`find`. Se nenhum ficheiro for encontrado, então ``None`` é retornado. Se *all* for fornecido, retorna uma lista de todos os nomes de ficheiros, na ordem em que aparecem na lista de línguas ou nas variáveis de ambiente.

source: Return a ``*Translations`` instance based on the *domain*, *localedir*, and *languages*, which are first passed to :func:`find` to get a list of the associated :file:`.mo` file paths. Instances with identical :file:`.mo` file names are cached. The actual class instantiated is *class_* if provided, otherwise :class:`GNUTranslations`. The class's constructor must take a single :term:`file object` argument.
pt_pt: Retorna uma instância ``*Translations`` baseada no *domínio*, *localedir* e *languages*, que são primeiro passados para :func:`find` para obter uma lista dos caminhos de ficheiros :file:`.mo` associados. Instâncias com nomes de ficheiros :file:`.mo` idênticos são armazenadas em cache. A classe realmente instanciada é *class_* se fornecida, caso contrário :class:`GNUTranslations`. O construtor da classe deve aceitar um único argumento :term:`file object`.

source: If multiple files are found, later files are used as fallbacks for earlier ones. To allow setting the fallback, :func:`copy.copy` is used to clone each translation object from the cache; the actual instance data is still shared with the cache.
pt_pt: Se forem encontrados vários ficheiros, os ficheiros posteriores são usados como fallback para os anteriores. Para permitir a definição do fallback, :func:`copy.copy` é usado para clonar cada objeto de tradução do cache; os dados reais da instância ainda são partilhados com o cache.

source: If no :file:`.mo` file is found, this function raises :exc:`OSError` if *fallback* is false (which is the default), and returns a :class:`NullTranslations` instance if *fallback* is true.
pt_pt: Se nenhum ficheiro :file:`.mo` for encontrado, esta função levanta :exc:`OSError` se *fallback* for falso (que é o padrão) e retorna uma instância :class:`NullTranslations` se *fallback* for verdadeiro.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
pt_pt: :exc:`IOError` costumava ser levantado, agora é um alias de :exc:`OSError`.

source: *codeset* parameter is removed.
pt_pt: O parâmetro *codeset* foi removido.

source: This installs the function :func:`!_` in Python's builtins namespace, based on *domain* and *localedir* which are passed to the function :func:`translation`.
pt_pt: Isto instala a função :func:`!_` no espaço de nomes integrado do Python, com base em *domain* e *localedir* que são passados para a função :func:`translation`.

source: For the *names* parameter, please see the description of the translation object's :meth:`~NullTranslations.install` method.
pt_pt: Para o parâmetro *names*, consulte a descrição do método :meth:`~NullTranslations.install` do objeto de tradução.

source: As seen below, you usually mark the strings in your application that are candidates for translation, by wrapping them in a call to the :func:`!_` function, like this::
pt_pt: Como visto abaixo, normalmente marca as strings na sua aplicação que são candidatas à tradução, envolvendo-as numa chamada à função :func:`!_`, como isto::

source: print(_('This string will be translated.'))
pt_pt: print(_('Esta string será traduzida.'))

source: For convenience, you want the :func:`!_` function to be installed in Python's builtins namespace, so it is easily accessible in all modules of your application.
pt_pt: Por conveniência, deseja que a função :func:`!_` seja instalada no espaço de nomes integrado do Python, para que seja facilmente acessível em todos os módulos da sua aplicação.

source: *names* is now a keyword-only parameter.
pt_pt: *names* é agora um parâmetro apenas por palavra-chave.

source: The :class:`NullTranslations` class
pt_pt: A classe :class:`NullTranslations`

source: Translation classes are what actually implement the translation of original source file message strings to translated message strings. The base class used by all translation classes is :class:`NullTranslations`; this provides the basic interface you can use to write your own specialized translation classes. Here are the methods of :class:`!NullTranslations`:
pt_pt: As classes de tradução são o que realmente implementa a tradução de strings de mensagens de ficheiros de origem para strings de mensagens traduzidas. A classe base usada por todas as classes de tradução é :class:`NullTranslations`; esta fornece a interface básica que pode usar para escrever as suas próprias classes de tradução especializadas. Aqui estão os métodos de :class:`!NullTranslations`:

source: Takes an optional :term:`file object` *fp*, which is ignored by the base class. Initializes "protected" instance variables *_info* and *_charset* which are set by derived classes, as well as *_fallback*, which is set through :meth:`add_fallback`. It then calls ``self._parse(fp)`` if *fp* is not ``None``.
pt_pt: Aceita um :term:`file object` opcional *fp*, que é ignorado pela classe base. Inicializa as variáveis de instância "protegidas" *_info* e *_charset* que são definidas por classes derivadas, bem como *_fallback*, que é definido através de :meth:`add_fallback`. Em seguida, chama ``self._parse(fp)`` se *fp* não for ``None``.

source: No-op in the base class, this method takes file object *fp*, and reads the data from the file, initializing its message catalog. If you have an unsupported message catalog file format, you should override this method to parse your format.
pt_pt: Sem operação na classe base, este método aceita o objeto de ficheiro *fp* e lê os dados do ficheiro, inicializando o seu catálogo de mensagens. Se tiver um formato de ficheiro de catálogo de mensagens não suportado, deve substituir este método para analisar o seu formato.

source: Add *fallback* as the fallback object for the current translation object. A translation object should consult the fallback if it cannot provide a translation for a given message.
pt_pt: Adiciona *fallback* como o objeto de fallback para o objeto de tradução atual. Um objeto de tradução deve consultar o fallback se não puder fornecer uma tradução para uma mensagem dada.

source: If a fallback has been set, forward :meth:`!gettext` to the fallback. Otherwise, return *message*. Overridden in derived classes.
pt_pt: Se um fallback tiver sido definido, encaminha :meth:`!gettext` para o fallback. Caso contrário, retorna *message*. Substituído em classes derivadas.

source: If a fallback has been set, forward :meth:`!ngettext` to the fallback. Otherwise, return *singular* if *n* is 1; return *plural* otherwise. Overridden in derived classes.
pt_pt: Se um fallback tiver sido definido, encaminha :meth:`!ngettext` para o fallback. Caso contrário, retorna *singular* se *n* for 1; retorna *plural* caso contrário. Substituído em classes derivadas.

source: If a fallback has been set, forward :meth:`pgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
pt_pt: Se um fallback tiver sido definido, encaminha :meth:`pgettext` para o fallback. Caso contrário, retorna a mensagem traduzida. Substituído em classes derivadas.

source: If a fallback has been set, forward :meth:`npgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
pt_pt: Se um fallback tiver sido definido, encaminha :meth:`npgettext` para o fallback. Caso contrário, retorna a mensagem traduzida. Substituído em classes derivadas.

source: Return a dictionary containing the metadata found in the message catalog file.
pt_pt: Retorna um dicionário contendo os metadados encontrados no ficheiro de catálogo de mensagens.

source: Return the encoding of the message catalog file.
pt_pt: Retorna a codificação do ficheiro de catálogo de mensagens.

source: This method installs :meth:`.gettext` into the built-in namespace, binding it to ``_``.
pt_pt: Este método instala :meth:`.gettext` no espaço de nomes integrado, associando-o a ``_``.

source: If the *names* parameter is given, it must be a sequence containing the names of functions you want to install in the builtins namespace in addition to :func:`!_`. Supported names are ``'gettext'``, ``'ngettext'``, ``'pgettext'``, and ``'npgettext'``.
pt_pt: Se o parâmetro *names* for fornecido, deve ser uma sequência contendo os nomes das funções que deseja instalar no espaço de nomes integrado, além de :func:`!_`. Os nomes suportados são ``'gettext'``, ``'ngettext'``, ``'pgettext'`` e ``'npgettext'``.

source: Note that this is only one way, albeit the most convenient way, to make the :func:`!_` function available to your application. Because it affects the entire application globally, and specifically the built-in namespace, localized modules should never install :func:`!_`. Instead, they should use this code to make :func:`!_` available to their module::
pt_pt: Note que esta é apenas uma forma, embora a mais conveniente, de tornar a função :func:`!_` disponível para a sua aplicação. Porque afeta toda a aplicação globalmente, e especificamente o espaço de nomes integrado, os módulos localizados nunca devem instalar :func:`!_`. Em vez disso, devem usar este código para tornar :func:`!_` disponível para o seu módulo::

source: This puts :func:`!_` only in the module's global namespace and so only affects calls within this module.
pt_pt: Isto coloca :func:`!_` apenas no espaço de nomes global do módulo e, portanto, afeta apenas as chamadas dentro deste módulo.

source: Added ``'pgettext'`` and ``'npgettext'``.
pt_pt: Adicionado ``'pgettext'`` e ``'npgettext'``.

source: The :class:`GNUTranslations` class
pt_pt: A classe :class:`GNUTranslations`

source: The :mod:`!gettext` module provides one additional class derived from :class:`NullTranslations`: :class:`GNUTranslations`. This class overrides :meth:`!_parse` to enable reading GNU :program:`gettext` format :file:`.mo` files in both big-endian and little-endian format.
pt_pt: O módulo :mod:`!gettext` fornece uma classe adicional derivada de :class:`NullTranslations`: :class:`GNUTranslations`. Esta classe substitui :meth:`!_parse` para permitir a leitura de ficheiros :file:`.mo` no formato GNU :program:`gettext` tanto em formato big-endian como little-endian.

source: :class:`GNUTranslations` parses optional metadata out of the translation catalog. It is convention with GNU :program:`gettext` to include metadata as the translation for the empty string. This metadata is in :rfc:`822`\ -style ``key: value`` pairs, and should contain the ``Project-Id-Version`` key. If the key ``Content-Type`` is found, then the ``charset`` property is used to initialize the "protected" :attr:`!_charset` instance variable, defaulting to ``None`` if not found. If the charset encoding is specified, then all message ids and message strings read from the catalog are converted to Unicode using this encoding, else ASCII is assumed.
pt_pt: :class:`GNUTranslations` analisa metadados opcionais do catálogo de tradução. É convenção com GNU :program:`gettext` incluir metadados como a tradução para a string vazia. Estes metadados estão em pares ``key: value`` no estilo :rfc:`822`, e devem conter a chave ``Project-Id-Version``. Se a chave ``Content-Type`` for encontrada, então a propriedade ``charset`` é usada para inicializar a variável de instância "protegida" :attr:`!_charset`, com o valor padrão ``None`` se não for encontrada. Se a codificação do charset for especificada, então todos os IDs de mensagem e strings de mensagem lidos do catálogo são convertidos para Unicode usando esta codificação, caso contrário, assume-se ASCII.

source: Since message ids are read as Unicode strings too, all ``*gettext()`` methods will assume message ids as Unicode strings, not byte strings.
pt_pt: Como os IDs de mensagem também são lidos como strings Unicode, todos os métodos ``*gettext()`` assumirão IDs de mensagem como strings Unicode, não strings de bytes.

source: The entire set of key/value pairs are placed into a dictionary and set as the "protected" :attr:`!_info` instance variable.
pt_pt: O conjunto completo de pares chave/valor é colocado num dicionário e definido como a variável de instância "protegida" :attr:`!_info`.

source: If the :file:`.mo` file's magic number is invalid, the major version number is unexpected, or if other problems occur while reading the file, instantiating a :class:`GNUTranslations` class can raise :exc:`OSError`.
pt_pt: Se o número mágico do ficheiro :file:`.mo` for inválido, o número da versão principal for inesperado, ou se outros problemas ocorrerem durante a leitura do ficheiro, a instanciar uma classe :class:`GNUTranslations` pode levantar :exc:`OSError`.

source: The following methods are overridden from the base class implementation:
pt_pt: Os seguintes métodos são substituídos da implementação da classe base:
