Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/hashlib.po
Languages: pt_pt, ru

source: The string *hash_name* is the desired name of the hash digest algorithm for HMAC, e.g. 'sha1' or 'sha256'. *password* and *salt* are interpreted as buffers of bytes. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
pt_pt: A string *hash_name* é o nome desejado do algoritmo de digest de hash para HMAC, por exemplo, 'sha1' ou 'sha256'. *password* e *salt* são interpretados como buffers de bytes. As aplicações e bibliotecas devem limitar *password* a um comprimento razoável (por exemplo, 1024). *salt* deve ser cerca de 16 ou mais bytes de uma fonte adequada, por exemplo, :func:`os.urandom`.
ru: Строка *hash_name* — это желаемое имя алгоритма хеш-дайджеста для HMAC, например «sha1» или «sha256». *password* и *salt* интерпретируются как буферы байтов. Приложения и библиотеки должны ограничивать *пароль* разумной длиной (например, 1024). Размер *salt* должен составлять около 16 или более байт из надлежащего источника, например :func:`os.urandom`.

source: The number of *iterations* should be chosen based on the hash algorithm and computing power. As of 2022, hundreds of thousands of iterations of SHA-256 are suggested. For rationale as to why and how to choose what is best for your application, read *Appendix A.2.2* of NIST-SP-800-132_. The answers on the `stackexchange pbkdf2 iterations question`_ explain in detail.
pt_pt: O número de *iterations* deve ser escolhido com base no algoritmo de hash e no poder de computação. Em 2022, são sugeridas centenas de milhares de iterações de SHA-256. Para a racionalidade sobre o porquê e como escolher o que é melhor para a sua aplicação, leia *Appendix A.2.2* de NIST-SP-800-132_. As respostas na `questão de iterações pbkdf2 do stackexchange`_ explicam em detalhe.
ru: Количество *итераций* должно выбираться на основе алгоритма хеширования и вычислительной мощности. По состоянию на 2022 год предлагаются сотни тысяч итераций SHA-256. Для обоснования того, почему и как выбрать то, что лучше всего подходит для вашего применения, прочтите *Приложение A.2.2* NIST-SP-800-132_. Ответы на вопрос об итерациях stackexchange pbkdf2 объясняют подробно.

source: *dklen* is the length of the derived key in bytes. If *dklen* is ``None`` then the digest size of the hash algorithm *hash_name* is used, e.g. 64 for SHA-512.
pt_pt: *dklen* é o comprimento da chave derivada em bytes. Se *dklen* for ``None``, então é usado o tamanho do digest do algoritmo de hash *hash_name*, por exemplo, 64 para SHA-512.

source: Function only available when Python is compiled with OpenSSL.
pt_pt: Função disponível apenas quando o Python é compilado com OpenSSL.

source: Function now only available when Python is built with OpenSSL. The slow pure Python implementation has been removed.
pt_pt: Função agora disponível apenas quando o Python é construído com OpenSSL. A implementação pura e lenta em Python foi removida.

source: The function provides scrypt password-based key derivation function as defined in :rfc:`7914`.
pt_pt: A função fornece a função de derivação de chave baseada em palavra-passe scrypt conforme definido em :rfc:`7914`.
ru: Эта функция обеспечивает функцию получения ключей на основе пароля, как определено в :rfc:`7914`.

source: *password* and *salt* must be :term:`bytes-like objects <bytes-like object>`. Applications and libraries should limit *password* to a sensible length (e.g. 1024). *salt* should be about 16 or more bytes from a proper source, e.g. :func:`os.urandom`.
pt_pt: *password* e *salt* devem ser :term:`objetos do tipo bytes <bytes-like object>`. As aplicações e bibliotecas devem limitar *password* a um comprimento razoável (por exemplo, 1024). *salt* deve ser cerca de 16 ou mais bytes de uma fonte adequada, por exemplo, :func:`os.urandom`.
ru: *пароль* и *salt* должны быть :term:`байтоподобными объектами <байтоподобный объект>`. Приложения и библиотеки должны ограничивать *пароль* разумной длиной (например, 1024). Размер *salt* должен составлять около 16 или более байт из надлежащего источника, например :func:`os.urandom`.

source: *n* is the CPU/Memory cost factor, *r* the block size, *p* parallelization factor and *maxmem* limits memory (OpenSSL 1.1.0 defaults to 32 MiB). *dklen* is the length of the derived key in bytes.
pt_pt: *n* é o fator de custo de CPU/Memória, *r* é o tamanho do bloco, *p* é o fator de paralelização e *maxmem* limita a memória (OpenSSL 1.1.0 predefinido para 32 MiB). *dklen* é o comprimento da chave derivada em bytes.

source: BLAKE2_ is a cryptographic hash function defined in :rfc:`7693` that comes in two flavors:
pt_pt: BLAKE2_ é uma função de hash criptográfica definida em :rfc:`7693` que vem em duas variantes:
ru: BLAKE2_ — это криптографическая хеш-функция, определенная в :rfc:`7693`, которая существует в двух вариантах:

source: **BLAKE2b**, optimized for 64-bit platforms and produces digests of any size between 1 and 64 bytes,
pt_pt: **BLAKE2b**, otimizado para plataformas de 64 bits e produz digests de qualquer tamanho entre 1 e 64 bytes,
ru: **BLAKE2b** оптимизирован для 64-битных платформ и создает дайджесты любого размера от 1 до 64 байт.

source: **BLAKE2s**, optimized for 8- to 32-bit platforms and produces digests of any size between 1 and 32 bytes.
pt_pt: **BLAKE2s**, otimizado para plataformas de 8 a 32 bits e produz digests de qualquer tamanho entre 1 e 32 bytes.
ru: **BLAKE2s** оптимизирован для 8-32-битных платформ и создает дайджесты любого размера от 1 до 32 байт.

source: BLAKE2 supports **keyed mode** (a faster and simpler replacement for HMAC_), **salted hashing**, **personalization**, and **tree hashing**.
pt_pt: BLAKE2 suporta **modo com chave** (uma substituição mais rápida e simples para HMAC_), **hashing com salt**, **personalização** e **hashing em árvore**.
ru: BLAKE2 поддерживает **режим с ключами** (более быстрая и простая замена HMAC_), **соленое хеширование**, **персонализацию** и **хеширование дерева**.

source: Hash objects from this module follow the API of standard library's :mod:`hashlib` objects.
pt_pt: Os objetos hash deste módulo seguem a API dos objetos :mod:`hashlib` da biblioteca padrão.
ru: Хэш-объекты из этого модуля соответствуют API объектов :mod:`hashlib` стандартной библиотеки.

source: Creating hash objects
pt_pt: Criar objetos hash
ru: Создание хэш-объектов

source: New hash objects are created by calling constructor functions:
pt_pt: Novos objetos hash são criados chamando funções construtoras:
ru: Новые хэш-объекты создаются путем вызова функций-конструкторов:

source: These functions return the corresponding hash objects for calculating BLAKE2b or BLAKE2s. They optionally take these general parameters:
pt_pt: Estas funções devolvem os objetos hash correspondentes para calcular BLAKE2b ou BLAKE2s. Opcionalmente, aceitam estes parâmetros gerais:
ru: Эти функции возвращают соответствующие хэш-объекты для вычисления BLAKE2b или BLAKE2. Они опционально принимают следующие общие параметры:

source: *data*: initial chunk of data to hash, which must be :term:`bytes-like object`. It can be passed only as positional argument.
pt_pt: *data*: pedaço inicial de dados para hash, que deve ser um :term:`objeto do tipo bytes`. Só pode ser passado como argumento posicional.
ru: *data*: начальный фрагмент данных для хеширования, который должен быть :term:`байтоподобным объектом`. Его можно передать только как позиционный аргумент.

source: *digest_size*: size of output digest in bytes.
pt_pt: *digest_size*: tamanho do digest de saída em bytes.
ru: *digest_size*: размер выходного дайджеста в байтах.

source: *key*: key for keyed hashing (up to 64 bytes for BLAKE2b, up to 32 bytes for BLAKE2s).
pt_pt: *key*: chave para hashing com chave (até 64 bytes para BLAKE2b, até 32 bytes para BLAKE2s).
ru: *key*: ключ для хеширования с ключом (до 64 байт для BLAKE2b, до 32 байт для BLAKE2).

source: *salt*: salt for randomized hashing (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
pt_pt: *salt*: salt para hashing aleatorizado (até 16 bytes para BLAKE2b, até 8 bytes para BLAKE2s).
ru: *salt*: соль для рандомизированного хеширования (до 16 байт для BLAKE2b, до 8 байт для BLAKE2).

source: *person*: personalization string (up to 16 bytes for BLAKE2b, up to 8 bytes for BLAKE2s).
pt_pt: *person*: string de personalização (até 16 bytes para BLAKE2b, até 8 bytes para BLAKE2s).
ru: *person*: строка персонализации (до 16 байт для BLAKE2b, до 8 байт для BLAKE2).

source: The following table shows limits for general parameters (in bytes):
pt_pt: A tabela seguinte mostra os limites para os parâmetros gerais (em bytes):
ru: В следующей таблице приведены ограничения для общих параметров (в байтах).:

source: BLAKE2 specification defines constant lengths for salt and personalization parameters, however, for convenience, this implementation accepts byte strings of any size up to the specified length. If the length of the parameter is less than specified, it is padded with zeros, thus, for example, ``b'salt'`` and ``b'salt\x00'`` is the same value. (This is not the case for *key*.)
pt_pt: A especificação BLAKE2 define comprimentos constantes para os parâmetros de salt e personalização, no entanto, por conveniência, esta implementação aceita strings de bytes de qualquer tamanho até ao comprimento especificado. Se o comprimento do parâmetro for menor que o especificado, é preenchido com zeros, assim, por exemplo, ``b'salt'`` e ``b'salt\x00'`` são o mesmo valor. (Isto não se aplica a *key*.)
ru: Спецификация BLAKE2 определяет постоянную длину для соли и параметров персонализации, однако для удобства эта реализация принимает строки байтов любого размера до указанной длины. Если длина параметра меньше указанной, он дополняется нулями, таким образом, например, ``b'salt'`` и ``b'salt\x00'`` имеют одно и то же значение. (Это не относится к *key*.)

source: These sizes are available as module `constants`_ described below.
pt_pt: Estes tamanhos estão disponíveis como `constants`_ do módulo descritas abaixo.
ru: Эти размеры доступны как константы модуля, описанные ниже.

source: Constructor functions also accept the following tree hashing parameters:
pt_pt: As funções construtoras também aceitam os seguintes parâmetros de hashing em árvore:
ru: Функции конструктора также принимают следующие параметры хеширования дерева:

source: *fanout*: fanout (0 to 255, 0 if unlimited, 1 in sequential mode).
pt_pt: *fanout*: fanout (0 a 255, 0 se ilimitado, 1 em modo sequencial).
ru: *fanout*: разветвление (от 0 до 255, 0, если неограниченно, 1 в последовательном режиме).

source: *depth*: maximal depth of tree (1 to 255, 255 if unlimited, 1 in sequential mode).
pt_pt: *depth*: profundidade máxima da árvore (1 a 255, 255 se ilimitado, 1 em modo sequencial).
ru: *глубина*: максимальная глубина дерева (от 1 до 255, 255, если неограниченно, 1 в последовательном режиме).

source: *leaf_size*: maximal byte length of leaf (0 to ``2**32-1``, 0 if unlimited or in sequential mode).
pt_pt: *leaf_size*: comprimento máximo de bytes da folha (0 a ``2**32-1``, 0 se ilimitado ou em modo sequencial).
ru: *leaf_size*: максимальная длина листа в байтах (от 0 до ``2**32-1``, 0, если неограниченно или в последовательном режиме).

source: *node_offset*: node offset (0 to ``2**64-1`` for BLAKE2b, 0 to ``2**48-1`` for BLAKE2s, 0 for the first, leftmost, leaf, or in sequential mode).
pt_pt: *node_offset*: deslocamento do nó (0 a ``2**64-1`` para BLAKE2b, 0 a ``2**48-1`` para BLAKE2s, 0 para a primeira folha mais à esquerda, ou em modo sequencial).
ru: *node_offset*: смещение узла (от 0 до ``2**64-1`` для BLAKE2b, от 0 до ``2**48-1`` для BLAKE2, 0 для первого, крайнего левого, листового или в последовательном режиме. ).

source: *node_depth*: node depth (0 to 255, 0 for leaves, or in sequential mode).
pt_pt: *node_depth*: profundidade do nó (0 a 255, 0 para folhas, ou em modo sequencial).
ru: *node_глубина*: глубина узла (от 0 до 255, 0 для листьев или в последовательном режиме).

source: *inner_size*: inner digest size (0 to 64 for BLAKE2b, 0 to 32 for BLAKE2s, 0 in sequential mode).
pt_pt: *inner_size*: tamanho do digest interno (0 a 64 para BLAKE2b, 0 a 32 para BLAKE2s, 0 em modo sequencial).
ru: *inner_size*: размер внутреннего дайджеста (от 0 до 64 для BLAKE2b, от 0 до 32 для BLAKE2, 0 в последовательном режиме).

source: *last_node*: boolean indicating whether the processed node is the last one (``False`` for sequential mode).
pt_pt: *last_node*: booleano que indica se o nó processado é o último (``False`` para modo sequencial).
ru: *last_node*: логическое значение, указывающее, является ли обработанный узел последним («False» для последовательного режима).

source: Explanation of tree mode parameters.
pt_pt: Explicação dos parâmetros do modo árvore.
ru: Пояснения к параметрам режима дерева.

source: See section 2.10 in `BLAKE2 specification <https://www.blake2.net/blake2_20130129.pdf>`_ for comprehensive review of tree hashing.
pt_pt: Veja a secção 2.10 em `Especificação BLAKE2 <https://www.blake2.net/blake2_20130129.pdf>`_ para uma revisão abrangente do hashing em árvore.
ru: См. раздел 2.10 в `Спецификации BLAKE2 <https://www.blake2.net/blake2_20130129.pdf>`_ для подробного обзора хеширования дерева.

source: Constants
pt_pt: Constantes
ru: Константы

source: Salt length (maximum length accepted by constructors).
pt_pt: Comprimento do salt (comprimento máximo aceite pelos construtores).
ru: Длина соли (максимальная длина, принятая конструкторами).

source: Personalization string length (maximum length accepted by constructors).
pt_pt: Comprimento da string de personalização (comprimento máximo aceite pelos construtores).
ru: Длина строки персонализации (максимальная длина, принимаемая конструкторами).

source: Maximum key size.
pt_pt: Tamanho máximo da chave.
ru: Максимальный размер ключа.

source: Maximum digest size that the hash function can output.
pt_pt: Tamanho máximo do digest que a função de hash pode produzir.
ru: Максимальный размер дайджеста, который может вывести хеш-функция.

source: Examples
pt_pt: Exemplos
ru: Примеры

source: Simple hashing
pt_pt: Hashing simples
ru: Простое хэширование

source: To calculate hash of some data, you should first construct a hash object by calling the appropriate constructor function (:func:`blake2b` or :func:`blake2s`), then update it with the data by calling :meth:`~hash.update` on the object, and, finally, get the digest out of the object by calling :meth:`~hash.digest` (or :meth:`~hash.hexdigest` for hex-encoded string).
pt_pt: Para calcular o hash de alguns dados, deve primeiro construir um objeto hash chamando a função construtora apropriada (:func:`blake2b` ou :func:`blake2s`), depois atualizá-lo com os dados chamando :meth:`~hash.update` no objeto e, finalmente, obter o digest do objeto chamando :meth:`~hash.digest` (ou :meth:`~hash.hexdigest` para uma string codificada em hexadecimal).
ru: Чтобы вычислить хэш некоторых данных, вам следует сначала создать хэш-объект, вызвав соответствующую функцию-конструктор (:func:`blake2b` или :func:`blake2s`), а затем обновить его данными, вызвав :meth:`~hash .update` объекта и, наконец, получите дайджест объекта, вызвав :meth:`~hash.digest` (или :meth:`~hash.hexdigest` для строки в шестнадцатеричном формате).

source: As a shortcut, you can pass the first chunk of data to update directly to the constructor as the positional argument:
pt_pt: Como atalho, pode passar o primeiro pedaço de dados para atualizar diretamente para o construtor como argumento posicional:
ru: В качестве ярлыка вы можете передать первый фрагмент данных для обновления непосредственно конструктору в качестве позиционного аргумента:

source: You can call :meth:`hash.update` as many times as you need to iteratively update the hash:
pt_pt: Pode chamar :meth:`hash.update` quantas vezes precisar para atualizar iterativamente o hash:
ru: Вы можете вызывать :meth:`hash.update` столько раз, сколько вам нужно, чтобы итеративно обновить хэш:

source: Using different digest sizes
pt_pt: Usar diferentes tamanhos de digest
ru: Использование разных размеров дайджеста

source: BLAKE2 has configurable size of digests up to 64 bytes for BLAKE2b and up to 32 bytes for BLAKE2s. For example, to replace SHA-1 with BLAKE2b without changing the size of output, we can tell BLAKE2b to produce 20-byte digests:
pt_pt: BLAKE2 tem tamanho configurável de digests até 64 bytes para BLAKE2b e até 32 bytes para BLAKE2s. Por exemplo, para substituir SHA-1 por BLAKE2b sem alterar o tamanho da saída, podemos dizer ao BLAKE2b para produzir digests de 20 bytes:
ru: BLAKE2 имеет настраиваемый размер дайджестов до 64 байтов для BLAKE2b и до 32 байтов для BLAKE2. Например, чтобы заменить SHA-1 на BLAKE2b без изменения размера вывода, мы можем указать BLAKE2b создавать 20-байтовые дайджесты:

source: Hash objects with different digest sizes have completely different outputs (shorter hashes are *not* prefixes of longer hashes); BLAKE2b and BLAKE2s produce different outputs even if the output length is the same:
pt_pt: Objetos hash com diferentes tamanhos de digest têm saídas completamente diferentes (hashes mais curtos *não* são prefixos de hashes mais longos); BLAKE2b e BLAKE2s produzem saídas diferentes mesmo que o comprimento da saída seja o mesmo:
ru: Хэш-объекты с разными размерами дайджеста имеют совершенно разные выходные данные (более короткие хэши *не* являются префиксами более длинных хэшей); BLAKE2b и BLAKE2 выдают разные выходные данные, даже если длина выходных данных одинакова:

source: Keyed hashing
pt_pt: Hashing com chave
ru: Хеширование с ключом

source: Keyed hashing can be used for authentication as a faster and simpler replacement for `Hash-based message authentication code <https://en.wikipedia.org/wiki/HMAC>`_ (HMAC). BLAKE2 can be securely used in prefix-MAC mode thanks to the indifferentiability property inherited from BLAKE.
pt_pt: O hashing com chave pode ser usado para autenticação como uma substituição mais rápida e simples para o `código de autenticação de mensagem baseado em hash <https://en.wikipedia.org/wiki/HMAC>`_ (HMAC). O BLAKE2 pode ser usado de forma segura no modo prefix-MAC graças à propriedade de indiferenciabilidade herdada do BLAKE.
ru: Хеширование с ключом можно использовать для аутентификации как более быструю и простую замену «кода аутентификации сообщения на основе хэша <https://en.wikipedia.org/wiki/HMAC>»_ (HMAC). BLAKE2 можно безопасно использовать в режиме префикса-MAC благодаря свойству недифференцируемости, унаследованному от BLAKE.

source: This example shows how to get a (hex-encoded) 128-bit authentication code for message ``b'message data'`` with key ``b'pseudorandom key'``::
pt_pt: Este exemplo mostra como obter um código de autenticação de 128 bits (codificado em hexadecimal) para a mensagem ``b'message data'`` com a chave ``b'pseudorandom key'``::
ru: В этом примере показано, как получить (шестнадцатеричный) 128-битный код аутентификации для сообщения ``b'message data'`` с ключом ``b'pseudorandom key'``::

source: As a practical example, a web application can symmetrically sign cookies sent to users and later verify them to make sure they weren't tampered with::
pt_pt: Como exemplo prático, uma aplicação web pode assinar simetricamente cookies enviados aos utilizadores e verificá-los mais tarde para garantir que não foram adulterados::
ru: В качестве практического примера веб-приложение может симметрично подписывать файлы cookie, отправленные пользователям, а затем проверять их, чтобы убедиться, что они не были подделаны:

source: Even though there's a native keyed hashing mode, BLAKE2 can, of course, be used in HMAC construction with :mod:`hmac` module::
pt_pt: Embora exista um modo de hashing com chave nativo, o BLAKE2 pode, claro, ser usado na construção HMAC com o módulo :mod:`hmac`::
ru: Несмотря на то, что существует собственный режим хеширования с ключом, BLAKE2, конечно, можно использовать в построении HMAC с модулем :mod:`hmac`::

source: Randomized hashing
pt_pt: Hashing aleatorizado
ru: Рандомизированное хэширование

source: By setting *salt* parameter users can introduce randomization to the hash function. Randomized hashing is useful for protecting against collision attacks on the hash function used in digital signatures.
pt_pt: Ao definir o parâmetro *salt*, os utilizadores podem introduzir aleatoriedade na função de hash. O hashing aleatorizado é útil para proteger contra ataques de colisão na função de hash usada em assinaturas digitais.
ru: Установив параметр *salt*, пользователи могут ввести рандомизацию в хеш-функцию. Рандомизированное хеширование полезно для защиты от коллизионных атак на хеш-функцию, используемую в цифровых подписях.
