Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/hashlib.po
Languages: pt_pt, ru

source: :mod:`!hashlib` --- Secure hashes and message digests
pt_pt: :mod:`!hashlib` --- Hashes seguros e resumos de mensagem

source: **Source code:** :source:`Lib/hashlib.py`
pt_pt: **Código-fonte:** :source:`Lib/hashlib.py`
ru: **Исходный код:** :source:`Lib/hashlib.py`

source: This module implements a common interface to many different hash algorithms. Included are the FIPS secure hash algorithms SHA224, SHA256, SHA384, SHA512, (defined in `the FIPS 180-4 standard`_), the SHA-3 series (defined in `the FIPS 202 standard`_) as well as the legacy algorithms SHA1 (`formerly part of FIPS`_) and the MD5 algorithm (defined in internet :rfc:`1321`).
pt_pt: Este módulo implementa uma interface comum para muitos algoritmos de hash diferentes. Inclui os algoritmos de hash seguros FIPS SHA224, SHA256, SHA384, SHA512 (definidos no `padrão FIPS 180-4`_), a série SHA-3 (definida no `padrão FIPS 202`_), bem como os algoritmos legados SHA1 (`anteriormente parte do FIPS`_) e o algoritmo MD5 (definido no :rfc:`1321` da Internet).

source: If you want the adler32 or crc32 hash functions, they are available in the :mod:`zlib` module.
pt_pt: Se pretender as funções de hash adler32 ou crc32, estão disponíveis no módulo :mod:`zlib`.
ru: Если вам нужны хеш-функции adler32 или crc32, они доступны в модуле :mod:`zlib`.

source: Hash algorithms
pt_pt: Algoritmos de hash
ru: Алгоритмы хэширования

source: There is one constructor method named for each type of :dfn:`hash`. All return a hash object with the same simple interface. For example: use :func:`sha256` to create a SHA-256 hash object. You can now feed this object with :term:`bytes-like objects <bytes-like object>` (normally :class:`bytes`) using the :meth:`update<hash.update>` method. At any point you can ask it for the :dfn:`digest` of the concatenation of the data fed to it so far using the :meth:`digest()<hash.digest>` or :meth:`hexdigest()<hash.hexdigest>` methods.
pt_pt: Existe um método construtor nomeado para cada tipo de :dfn:`hash`. Todos devolvem um objeto hash com a mesma interface simples. Por exemplo: use :func:`sha256` para criar um objeto hash SHA-256. Pode agora alimentar este objeto com :term:`objetos do tipo bytes <bytes-like object>` (normalmente :class:`bytes`) usando o método :meth:`update<hash.update>`. Em qualquer momento, pode pedir o :dfn:`digest` da concatenação dos dados fornecidos até agora usando os métodos :meth:`digest()<hash.digest>` ou :meth:`hexdigest()<hash.hexdigest>`.
ru: Для каждого типа :dfn:`hash` назван один метод-конструктор. Все они возвращают хэш-объект с одним и тем же простым интерфейсом. Например: используйте :func:`sha256` для создания хеш-объекта SHA-256. Теперь вы можете передать этому объекту :term:`bytes-like object <bytes-like object>` (обычно :class:`bytes`), используя метод :meth:`update<hash.update>`. В любой момент вы можете запросить у него :dfn:`digest` объединения переданных ему данных, используя :meth:`digest()<hash.digest>` или :meth:`hexdigest()< методы hash.hexdigest>`.

source: To allow multithreading, the Python :term:`GIL` is released while computing a hash supplied more than 2047 bytes of data at once in its constructor or :meth:`.update<hash.update>` method.
pt_pt: Para permitir multithreading, o :term:`GIL` do Python é libertado enquanto calcula um hash fornecido com mais de 2047 bytes de dados de uma vez no seu construtor ou método :meth:`.update<hash.update>`.
ru: Чтобы обеспечить многопоточность, Python :term:`GIL` высвобождается при вычислении хеша, предоставляющего более 2047 байтов данных одновременно в его конструкторе или методе :meth:`.update<hash.update>`.

source: Constructors for hash algorithms that are always present in this module are :func:`sha1`, :func:`sha224`, :func:`sha256`, :func:`sha384`, :func:`sha512`, :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`, :func:`blake2b`, and :func:`blake2s`. :func:`md5` is normally available as well, though it may be missing or blocked if you are using a rare "FIPS compliant" build of Python. These correspond to :data:`algorithms_guaranteed`.
pt_pt: Os construtores para algoritmos de hash que estão sempre presentes neste módulo são :func:`sha1`, :func:`sha224`, :func:`sha256`, :func:`sha384`, :func:`sha512`, :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`, :func:`blake2b` e :func:`blake2s`. :func:`md5` também está normalmente disponível, embora possa estar em falta ou bloqueado se estiver a usar uma versão rara "FIPS compliant" do Python. Estes correspondem a :data:`algorithms_guaranteed`.
ru: Конструкторы для хэш-алгоритмов, которые всегда присутствуют в этом модуле: :func:`sha1`, :func:`sha224`, :func:`sha256`, :func:`sha384`, :func:`sha512`, :func: `sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`, :func:`blake2b` и :func: `blake2s`. :func:`md5` обычно также доступен, хотя он может отсутствовать или блокироваться, если вы используете редкую сборку Python, совместимую с FIPS. Они соответствуют :data:`algorithms_guarantee`.

source: Additional algorithms may also be available if your Python distribution's :mod:`hashlib` was linked against a build of OpenSSL that provides others. Others *are not guaranteed available* on all installations and will only be accessible by name via :func:`new`. See :data:`algorithms_available`.
pt_pt: Algoritmos adicionais também podem estar disponíveis se o :mod:`hashlib` da sua distribuição Python estiver ligado a uma versão do OpenSSL que forneça outros. Outros *não são garantidamente disponíveis* em todas as instalações e só serão acessíveis pelo nome através de :func:`new`. Veja :data:`algorithms_available`.
ru: Дополнительные алгоритмы также могут быть доступны, если :mod:`hashlib` вашего дистрибутива Python был связан со сборкой OpenSSL, которая предоставляет другие. Другие *не гарантированно доступны* во всех установках и будут доступны только по имени через :func:`new`. См. :data:`algorithms_available`.

source: Some algorithms have known hash collision weaknesses (including MD5 and SHA1). Refer to `Attacks on cryptographic hash algorithms`_ and the `hashlib-seealso`_ section at the end of this document.
pt_pt: Alguns algoritmos têm fraquezas conhecidas de colisão de hash (incluindo MD5 e SHA1). Consulte `Attacks on cryptographic hash algorithms`_ e a secção `hashlib-seealso`_ no final deste documento.
ru: Некоторые алгоритмы имеют известные недостатки коллизий хэшей (включая MD5 и SHA1). Обратитесь к разделу «Атаки на криптографические алгоритмы хэширования» и разделу «hashlib-seealso» в конце этого документа.

source: SHA3 (Keccak) and SHAKE constructors :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256` were added. :func:`blake2b` and :func:`blake2s` were added.
pt_pt: Foram adicionados os construtores SHA3 (Keccak) e SHAKE :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`. Foram adicionados :func:`blake2b` e :func:`blake2s`.
ru: Добавлены конструкторы SHA3 (Keccak) и SHAKE :func:`sha3_224`, :func:`sha3_256`, :func:`sha3_384`, :func:`sha3_512`, :func:`shake_128`, :func:`shake_256`. . Были добавлены :func:`blake2b` и :func:`blake2s`.

source: All hashlib constructors take a keyword-only argument *usedforsecurity* with default value ``True``. A false value allows the use of insecure and blocked hashing algorithms in restricted environments. ``False`` indicates that the hashing algorithm is not used in a security context, e.g. as a non-cryptographic one-way compression function.
pt_pt: Todos os construtores do hashlib aceitam um argumento apenas por palavra-chave *usedforsecurity* com valor predefinido ``True``. Um valor falso permite o uso de algoritmos de hash inseguros e bloqueados em ambientes restritos. ``False`` indica que o algoritmo de hash não é usado num contexto de segurança, por exemplo, como uma função de compressão unidirecional não criptográfica.
ru: Все конструкторы hashlib принимают аргумент, содержащий только ключевые слова *usedforsecurity* со значением по умолчанию ``True``. Ложное значение позволяет использовать небезопасные и заблокированные алгоритмы хеширования в средах с ограниченным доступом. «False» указывает, что алгоритм хеширования не используется в контексте безопасности, например, как некриптографическая односторонняя функция сжатия.

source: Hashlib now uses SHA3 and SHAKE from OpenSSL if it provides it.
pt_pt: Hashlib agora usa SHA3 e SHAKE do OpenSSL se este os fornecer.
ru: Hashlib теперь использует SHA3 и SHAKE из OpenSSL, если он их предоставляет.

source: For any of the MD5, SHA1, SHA2, or SHA3 algorithms that the linked OpenSSL does not provide we fall back to a verified implementation from the `HACL\* project`_.
pt_pt: Para qualquer um dos algoritmos MD5, SHA1, SHA2 ou SHA3 que o OpenSSL ligado não forneça, recuamos para uma implementação verificada do `HACL\* project`_.

source: Usage
pt_pt: Utilização
ru: Использование

source: To obtain the digest of the byte string ``b"Nobody inspects the spammish repetition"``::
pt_pt: Para obter o digest da string de bytes ``b"Nobody inspects the spammish repetition"``::
ru: Чтобы получить дайджест байтовой строки ``b"Никто не проверяет повторение спама"``::

source: More condensed:
pt_pt: Mais condensado:
ru: Более сжато:

source: Constructors
pt_pt: Construtores
ru: Конструкторы

source: Is a generic constructor that takes the string *name* of the desired algorithm as its first parameter. It also exists to allow access to the above listed hashes as well as any other algorithms that your OpenSSL library may offer.
pt_pt: É um construtor genérico que recebe a string *name* do algoritmo desejado como seu primeiro parâmetro. Também existe para permitir o acesso aos hashes listados acima, bem como a quaisquer outros algoritmos que a sua biblioteca OpenSSL possa oferecer.
ru: Это универсальный конструктор, который принимает строку *имя* желаемого алгоритма в качестве первого параметра. Он также существует для обеспечения доступа к перечисленным выше хешам, а также к любым другим алгоритмам, которые может предложить ваша библиотека OpenSSL.

source: Using :func:`new` with an algorithm name:
pt_pt: Usar :func:`new` com um nome de algoritmo:
ru: Использование :func:`new` с именем алгоритма:

source: Named constructors such as these are faster than passing an algorithm name to :func:`new`.
pt_pt: Construtores nomeados como estes são mais rápidos do que passar um nome de algoritmo para :func:`new`.
ru: Именованные конструкторы, подобные этим, работают быстрее, чем передача имени алгоритма в :func:`new`.

source: Attributes
pt_pt: Atributos
ru: Атрибуты

source: Hashlib provides the following constant module attributes:
pt_pt: Hashlib fornece os seguintes atributos de módulo constantes:
ru: Hashlib предоставляет следующие постоянные атрибуты модуля:

source: A set containing the names of the hash algorithms guaranteed to be supported by this module on all platforms. Note that 'md5' is in this list despite some upstream vendors offering an odd "FIPS compliant" Python build that excludes it.
pt_pt: Um conjunto contendo os nomes dos algoritmos de hash garantidamente suportados por este módulo em todas as plataformas. Note que 'md5' está nesta lista apesar de alguns fornecedores upstream oferecerem uma versão estranha "FIPS compliant" do Python que o exclui.
ru: Набор, содержащий названия алгоритмов хеширования, которые гарантированно поддерживаются этим модулем на всех платформах. Обратите внимание, что «md5» присутствует в этом списке, несмотря на то, что некоторые поставщики исходного кода предлагают странную «совместимую с FIPS» сборку Python, которая исключает его.

source: A set containing the names of the hash algorithms that are available in the running Python interpreter. These names will be recognized when passed to :func:`new`. :attr:`algorithms_guaranteed` will always be a subset. The same algorithm may appear multiple times in this set under different names (thanks to OpenSSL).
pt_pt: Um conjunto contendo os nomes dos algoritmos de hash que estão disponíveis no interpretador Python em execução. Estes nomes serão reconhecidos quando passados para :func:`new`. :attr:`algorithms_guaranteed` será sempre um subconjunto. O mesmo algoritmo pode aparecer várias vezes neste conjunto com nomes diferentes (graças ao OpenSSL).
ru: Набор, содержащий имена хеш-алгоритмов, доступных в работающем интерпретаторе Python. Эти имена будут распознаны при передаче в :func:`new`. :attr:`algorithms_guarantee` всегда будет подмножеством. Один и тот же алгоритм может появляться в этом наборе несколько раз под разными именами (спасибо OpenSSL).

source: Hash Objects
pt_pt: Objetos Hash
ru: Хэш-объекты

source: The following values are provided as constant attributes of the hash objects returned by the constructors:
pt_pt: Os seguintes valores são fornecidos como atributos constantes dos objetos hash devolvidos pelos construtores:
ru: Следующие значения предоставляются как постоянные атрибуты хеш-объектов, возвращаемых конструкторами:

source: The size of the resulting hash in bytes.
pt_pt: O tamanho do hash resultante em bytes.
ru: Размер полученного хеша в байтах.

source: The internal block size of the hash algorithm in bytes.
pt_pt: O tamanho interno do bloco do algoritmo de hash em bytes.
ru: Размер внутреннего блока хэш-алгоритма в байтах.

source: A hash object has the following attributes:
pt_pt: Um objeto hash tem os seguintes atributos:
ru: Хэш-объект имеет следующие атрибуты:

source: The canonical name of this hash, always lowercase and always suitable as a parameter to :func:`new` to create another hash of this type.
pt_pt: O nome canónico deste hash, sempre em minúsculas e sempre adequado como parâmetro para :func:`new` para criar outro hash deste tipo.
ru: Каноническое имя этого хеша, всегда в нижнем регистре и всегда подходящее в качестве параметра :func:`new` для создания другого хеша этого типа.

source: The name attribute has been present in CPython since its inception, but until Python 3.4 was not formally specified, so may not exist on some platforms.
pt_pt: O atributo name está presente no CPython desde o seu início, mas até ao Python 3.4 não estava formalmente especificado, pelo que pode não existir em algumas plataformas.
ru: Атрибут name присутствовал в CPython с момента его создания, но до версии Python 3.4 он не был официально определен, поэтому может не существовать на некоторых платформах.

source: A hash object has the following methods:
pt_pt: Um objeto hash tem os seguintes métodos:
ru: Хэш-объект имеет следующие методы:

source: Update the hash object with the :term:`bytes-like object`. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a+b)``.
pt_pt: Atualiza o objeto hash com o :term:`objeto do tipo bytes`. Chamadas repetidas são equivalentes a uma única chamada com a concatenação de todos os argumentos: ``m.update(a); m.update(b)`` é equivalente a ``m.update(a+b)``.
ru: Обновите хеш-объект, добавив в него :term:`bytes-like object`. Повторные вызовы эквивалентны одному вызову с объединением всех аргументов: ``m.update(a); m.update(b)`` эквивалентен ``m.update(a+b)``.

source: Return the digest of the data passed to the :meth:`update` method so far. This is a bytes object of size :attr:`digest_size` which may contain bytes in the whole range from 0 to 255.
pt_pt: Devolve o digest dos dados passados ao método :meth:`update` até agora. Isto é um objeto bytes de tamanho :attr:`digest_size` que pode conter bytes em toda a gama de 0 a 255.
ru: Возвращает дайджест данных, переданных в метод :meth:`update`. Это байтовый объект размером :attr:`digest_size`, который может содержать байты во всем диапазоне от 0 до 255.

source: Like :meth:`digest` except the digest is returned as a string object of double length, containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
pt_pt: Semelhante a :meth:`digest`, exceto que o digest é devolvido como um objeto string de comprimento duplo, contendo apenas dígitos hexadecimais. Isto pode ser usado para trocar o valor com segurança em email ou outros ambientes não binários.
ru: Аналогично :meth:`digest`, за исключением того, что дайджест возвращается в виде строкового объекта двойной длины, содержащего только шестнадцатеричные цифры. Это можно использовать для безопасного обмена значениями по электронной почте или в других недвоичных средах.

source: Return a copy ("clone") of the hash object. This can be used to efficiently compute the digests of data sharing a common initial substring.
pt_pt: Devolve uma cópia ("clone") do objeto hash. Isto pode ser usado para calcular eficientemente os digests de dados que partilham uma substring inicial comum.
ru: Вернуть копию («клон») хэш-объекта. Это можно использовать для эффективного вычисления дайджестов данных, имеющих общую начальную подстроку.

source: SHAKE variable length digests
pt_pt: Digests de comprimento variável SHAKE
ru: Дайджесты SHAKE переменной длины

source: The :func:`shake_128` and :func:`shake_256` algorithms provide variable length digests with length_in_bits//2 up to 128 or 256 bits of security. As such, their digest methods require a length. Maximum length is not limited by the SHAKE algorithm.
pt_pt: Os algoritmos :func:`shake_128` e :func:`shake_256` fornecem digests de comprimento variável com length_in_bits//2 até 128 ou 256 bits de segurança. Como tal, os seus métodos digest requerem um comprimento. O comprimento máximo não é limitado pelo algoritmo SHAKE.
ru: Алгоритмы :func:`shake_128` и :func:`shake_256` обеспечивают дайджесты переменной длины с length_in_bits//2 до 128 или 256 бит безопасности. Таким образом, их методы дайджеста требуют длины. Максимальная длина не ограничена алгоритмом SHAKE.

source: Return the digest of the data passed to the :meth:`~hash.update` method so far. This is a bytes object of size *length* which may contain bytes in the whole range from 0 to 255.
pt_pt: Devolve o digest dos dados passados ao método :meth:`~hash.update` até agora. Isto é um objeto bytes de tamanho *length* que pode conter bytes em toda a gama de 0 a 255.
ru: Возвращает дайджест данных, переданных в метод :meth:`~hash.update`. Это байтовый объект размером *длина*, который может содержать байты во всем диапазоне от 0 до 255.

source: Like :meth:`digest` except the digest is returned as a string object of double length, containing only hexadecimal digits. This may be used to exchange the value in email or other non-binary environments.
pt_pt: Semelhante a :meth:`digest`, exceto que o digest é devolvido como um objeto string de comprimento duplo, contendo apenas dígitos hexadecimais. Isto pode ser usado para trocar o valor em email ou outros ambientes não binários.
ru: Аналогично :meth:`digest`, за исключением того, что дайджест возвращается в виде строкового объекта двойной длины, содержащего только шестнадцатеричные цифры. Это можно использовать для обмена значением по электронной почте или в других недвоичных средах.

source: Example use:
pt_pt: Exemplo de uso:
ru: Пример использования:

source: File hashing
pt_pt: Hashing de ficheiros
ru: Хеширование файлов

source: The hashlib module provides a helper function for efficient hashing of a file or file-like object.
pt_pt: O módulo hashlib fornece uma função auxiliar para hashing eficiente de um ficheiro ou objeto semelhante a um ficheiro.
ru: Модуль hashlib предоставляет вспомогательную функцию для эффективного хеширования файла или файловоподобного объекта.

source: Return a digest object that has been updated with contents of file object.
pt_pt: Devolve um objeto digest que foi atualizado com o conteúdo do objeto ficheiro.
ru: Возвращает объект дайджеста, который был обновлен содержимым файлового объекта.

source: *fileobj* must be a file-like object opened for reading in binary mode. It accepts file objects from builtin :func:`open`, :class:`~io.BytesIO` instances, SocketIO objects from :meth:`socket.socket.makefile`, and similar. *fileobj* must be opened in blocking mode, otherwise a :exc:`BlockingIOError` may be raised.
pt_pt: *fileobj* deve ser um objeto semelhante a um ficheiro aberto para leitura em modo binário. Aceita objetos de ficheiro de :func:`open` integrado, instâncias de :class:`~io.BytesIO`, objetos SocketIO de :meth:`socket.socket.makefile`, e similares. *fileobj* deve ser aberto em modo de bloqueio, caso contrário, pode ser levantada uma exceção :exc:`BlockingIOError`.

source: The function may bypass Python's I/O and use the file descriptor from :meth:`~io.IOBase.fileno` directly. *fileobj* must be assumed to be in an unknown state after this function returns or raises. It is up to the caller to close *fileobj*.
pt_pt: A função pode contornar a I/O do Python e usar o descritor de ficheiro de :meth:`~io.IOBase.fileno` diretamente. *fileobj* deve ser assumido como estando num estado desconhecido após esta função retornar ou levantar uma exceção. Cabe ao chamador fechar *fileobj*.

source: *digest* must either be a hash algorithm name as a *str*, a hash constructor, or a callable that returns a hash object.
pt_pt: *digest* deve ser um nome de algoritmo de hash como uma *str*, um construtor de hash, ou um objeto chamável que devolve um objeto hash.
ru: *digest* должно быть либо именем алгоритма хэширования в виде *str*, либо конструктором хэша, либо вызываемым объектом, который возвращает хэш-объект.

source: Example:
pt_pt: Exemplo:
ru: Пример:

source: Now raises a :exc:`BlockingIOError` if the file is opened in non-blocking mode. Previously, spurious null bytes were added to the digest.
pt_pt: Agoras levanta uma exceção :exc:`BlockingIOError` se o ficheiro for aberto em modo não bloqueante. Anteriormente, bytes nulos espúrios eram adicionados ao digest.

source: Key derivation
pt_pt: Derivação de chave
ru: Ключевое происхождение

source: Key derivation and key stretching algorithms are designed for secure password hashing. Naive algorithms such as ``sha1(password)`` are not resistant against brute-force attacks. A good password hashing function must be tunable, slow, and include a `salt <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_.
pt_pt: Os algoritmos de derivação de chave e de alongamento de chave são concebidos para hashing seguro de palavras-passe. Algoritmos ingénuos como ``sha1(password)`` não são resistentes a ataques de força bruta. Uma boa função de hashing de palavras-passe deve ser ajustável, lenta e incluir um `salt <https://en.wikipedia.org/wiki/Salt_%28cryptography%29>`_.
ru: Алгоритмы получения и растяжения ключей предназначены для безопасного хеширования паролей. Наивные алгоритмы, такие как «sha1(password)», не устойчивы к атакам методом перебора. Хорошая функция хеширования паролей должна быть настраиваемой, медленной и включать «соль» <https://en.wikipedia.org/wiki/Salt_. %28c ryptography%29>`_.

source: The function provides PKCS#5 password-based key derivation function 2. It uses HMAC as pseudorandom function.
pt_pt: A função fornece a função de derivação de chave baseada em palavra-passe PKCS#5 2. Usa HMAC como função pseudoaleatória.
ru: Функция обеспечивает функцию получения ключа на основе пароля PKCS#5 2. Она использует HMAC в качестве псевдослучайной функции.
