Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/hashlib.po
Languages: pt_pt, ru

source: Randomized hashing is designed for situations where one party, the message preparer, generates all or part of a message to be signed by a second party, the message signer. If the message preparer is able to find cryptographic hash function collisions (i.e., two messages producing the same hash value), then they might prepare meaningful versions of the message that would produce the same hash value and digital signature, but with different results (e.g., transferring $1,000,000 to an account, rather than $10). Cryptographic hash functions have been designed with collision resistance as a major goal, but the current concentration on attacking cryptographic hash functions may result in a given cryptographic hash function providing less collision resistance than expected. Randomized hashing offers the signer additional protection by reducing the likelihood that a preparer can generate two or more messages that ultimately yield the same hash value during the digital signature generation process --- even if it is practical to find collisions for the hash function. However, the use of randomized hashing may reduce the amount of security provided by a digital signature when all portions of the message are prepared by the signer.
pt_pt: O hashing aleatorizado é concebido para situações em que uma parte, o preparador da mensagem, gera toda ou parte de uma mensagem a ser assinada por uma segunda parte, o signatário da mensagem. Se o preparador da mensagem for capaz de encontrar colisões na função de hash criptográfica (ou seja, duas mensagens que produzem o mesmo valor de hash), então poderá preparar versões significativas da mensagem que produziriam o mesmo valor de hash e assinatura digital, mas com resultados diferentes (por exemplo, transferir $1.000.000 para uma conta, em vez de $10). As funções de hash criptográficas foram concebidas com a resistência a colisões como um objetivo principal, mas a atual concentração em ataques a funções de hash criptográficas pode resultar numa dada função de hash criptográfica fornecer menos resistência a colisões do que o esperado. O hashing aleatorizado oferece ao signatário proteção adicional, reduzindo a probabilidade de um preparador poder gerar duas ou mais mensagens que, em última análise, produzam o mesmo valor de hash durante o processo de geração da assinatura digital — mesmo que seja prático encontrar colisões para a função de hash. No entanto, o uso de hashing aleatorizado pode reduzir a quantidade de segurança fornecida por uma assinatura digital quando todas as porções da mensagem são preparadas pelo signatário.
ru: Рандомизированное хеширование предназначено для ситуаций, когда одна сторона, составитель сообщения, генерирует все или часть сообщения, которое должно быть подписано второй стороной, подписывающей стороной сообщения. Если составитель сообщения способен обнаружить коллизии криптографических хеш-функций (т. е. два сообщения, производящие одно и то же значение хеш-функции), тогда он может подготовить значимые версии сообщения, которые будут создавать одно и то же значение хеш-функции и цифровую подпись, но с разными результатами (например, , переведя на счет 1 000 000 долларов США, а не 10 долларов США). Криптографические хэш-функции были разработаны с учетом устойчивости к коллизиям в качестве основной цели, но текущая концентрация на атаках на криптографические хэш-функции может привести к тому, что данная криптографическая хеш-функция будет обеспечивать меньшую устойчивость к коллизиям, чем ожидалось. Рандомизированное хеширование обеспечивает подписавшему дополнительную защиту, уменьшая вероятность того, что составитель сможет сгенерировать два или более сообщений, которые в конечном итоге дадут одно и то же значение хеш-функции в процессе генерации цифровой подписи, даже если практически возможно найти коллизии для хеш-функции. Однако использование рандомизированного хеширования может снизить уровень безопасности, обеспечиваемый цифровой подписью, когда все части сообщения подготовлены подписывающим лицом.

source: (`NIST SP-800-106 "Randomized Hashing for Digital Signatures" <https://csrc.nist.gov/pubs/sp/800/106/final>`_)
pt_pt: (NIST SP-800-106 "Hashing Aleatorizado para Assinaturas Digitais" <https://csrc.nist.gov/pubs/sp/800/106/final>`_)

source: In BLAKE2 the salt is processed as a one-time input to the hash function during initialization, rather than as an input to each compression function.
pt_pt: No BLAKE2, o salt é processado como uma entrada única para a função de hash durante a inicialização, em vez de ser uma entrada para cada função de compressão.
ru: В BLAKE2 соль обрабатывается как одноразовый входной сигнал хэш-функции во время инициализации, а не как входной сигнал для каждой функции сжатия.

source: *Salted hashing* (or just hashing) with BLAKE2 or any other general-purpose cryptographic hash function, such as SHA-256, is not suitable for hashing passwords. See `BLAKE2 FAQ <https://www.blake2.net/#qa>`_ for more information.
pt_pt: *Hashing com salt* (ou simplesmente hashing) com BLAKE2 ou qualquer outra função de hash criptográfica de uso geral, como SHA-256, não é adequado para hashing de palavras-passe. Veja `FAQ do BLAKE2 <https://www.blake2.net/#qa>`_ para mais informações.
ru: *Соленое хеширование* (или просто хеширование) с помощью BLAKE2 или любой другой криптографической хэш-функции общего назначения, такой как SHA-256, не подходит для хеширования паролей. Дополнительную информацию см. в разделе «Часто задаваемые вопросы по BLAKE2 <https://www.blake2.net/#qa>».

source: Personalization
pt_pt: Personalização
ru: Персонализация

source: Sometimes it is useful to force hash function to produce different digests for the same input for different purposes. Quoting the authors of the Skein hash function:
pt_pt: Às vezes é útil forçar a função de hash a produzir digests diferentes para a mesma entrada para diferentes propósitos. Citando os autores da função de hash Skein:
ru: Иногда полезно заставить хэш-функцию создавать разные дайджесты для одного и того же ввода для разных целей. Цитируем авторов хеш-функции Skein:

source: We recommend that all application designers seriously consider doing this; we have seen many protocols where a hash that is computed in one part of the protocol can be used in an entirely different part because two hash computations were done on similar or related data, and the attacker can force the application to make the hash inputs the same. Personalizing each hash function used in the protocol summarily stops this type of attack.
pt_pt: Recomendamos que todos os projetistas de aplicações considerem seriamente fazer isto; vimos muitos protocolos onde um hash que é calculado numa parte do protocolo pode ser usado numa parte completamente diferente porque duas computações de hash foram feitas em dados semelhantes ou relacionados, e o atacante pode forçar a aplicação a tornar as entradas de hash iguais. Personalizar cada função de hash usada no protocolo interrompe sumariamente este tipo de ataque.
ru: Мы рекомендуем всем разработчикам приложений серьезно подумать об этом; мы видели много протоколов, в которых хэш, вычисленный в одной части протокола, может использоваться в совершенно другой части, поскольку два хеш-вычисления были выполнены для аналогичных или связанных данных, и злоумышленник может заставить приложение сделать хэш-входы такой же. Персонализация каждой хеш-функции, используемой в протоколе, полностью останавливает этот тип атаки.

source: (`The Skein Hash Function Family <https://www.schneier.com/wp-content/uploads/2016/02/skein.pdf>`_, p. 21)
pt_pt: (A Família de Funções de Hash Skein <https://www.schneier.com/wp-content/uploads/2016/02/skein.pdf>`_, p. 21)
ru: (`Семейство хеш-функций Skein <https://www.schneier.com/wp-content/uploads/2016/02/skein.pdf>`_, стр. 21)

source: BLAKE2 can be personalized by passing bytes to the *person* argument::
pt_pt: O BLAKE2 pode ser personalizado passando bytes para o argumento *person*::
ru: BLAKE2 можно персонализировать, передав байты в аргумент *person*::

source: Personalization together with the keyed mode can also be used to derive different keys from a single one.
pt_pt: A personalização, juntamente com o modo com chave, também pode ser usada para derivar diferentes chaves de uma única.
ru: Персонализация вместе с режимом с ключами также может использоваться для получения разных ключей из одного.

source: Tree mode
pt_pt: Modo árvore
ru: Режим дерева

source: Here's an example of hashing a minimal tree with two leaf nodes::
pt_pt: Aqui está um exemplo de hashing de uma árvore mínima com dois nós folha::
ru: Вот пример хеширования минимального дерева с двумя листовыми узлами:

source: This example uses 64-byte internal digests, and returns the 32-byte final digest::
pt_pt: Este exemplo usa digests internos de 64 bytes e devolve o digest final de 32 bytes::
ru: В этом примере используются 64-байтовые внутренние дайджесты и возвращается 32-байтовый окончательный дайджест:

source: >>> from hashlib import blake2b >>> >>> FANOUT = 2 >>> DEPTH = 2 >>> LEAF_SIZE = 4096 >>> INNER_SIZE = 64 >>> >>> buf = bytearray(6000) >>> >>> # Left leaf ... h00 = blake2b(buf[0:LEAF_SIZE], fanout=FANOUT, depth=DEPTH, ... leaf_size=LEAF_SIZE, inner_size=INNER_SIZE, ... node_offset=0, node_depth=0, last_node=False) >>> # Right leaf ... h01 = blake2b(buf[LEAF_SIZE:], fanout=FANOUT, depth=DEPTH, ... leaf_size=LEAF_SIZE, inner_size=INNER_SIZE, ... node_offset=1, node_depth=0, last_node=True) >>> # Root node ... h10 = blake2b(digest_size=32, fanout=FANOUT, depth=DEPTH, ... leaf_size=LEAF_SIZE, inner_size=INNER_SIZE, ... node_offset=0, node_depth=1, last_node=True) >>> h10.update(h00.digest()) >>> h10.update(h01.digest()) >>> h10.hexdigest() '3ad2a9b37c6070e374c7a8c508fe20ca86b6ed54e286e93a0318e95e881db5aa'
pt_pt: >>> from hashlib import blake2b >>> >>> FANOUT = 2 >>> DEPTH = 2 >>> LEAF_SIZE = 4096 >>> INNER_SIZE = 64 >>> >>> buf = bytearray(6000) >>> >>> # Folha esquerda ... h00 = blake2b(buf[0:LEAF_SIZE], fanout=FANOUT, depth=DEPTH, ... leaf_size=LEAF_SIZE, inner_size=INNER_SIZE, ... node_offset=0, node_depth=0, last_node=False) >>> # Folha direita ... h01 = blake2b(buf[LEAF_SIZE:], fanout=FANOUT, depth=DEPTH, ... leaf_size=LEAF_SIZE, inner_size=INNER_SIZE, ... node_offset=1, node_depth=0, last_node=True) >>> # Nó raiz ... h10 = blake2b(digest_size=32, fanout=FANOUT, depth=DEPTH, ... leaf_size=LEAF_SIZE, inner_size=INNER_SIZE, ... node_offset=0, node_depth=1, last_node=True) >>> h10.update(h00.digest()) >>> h10.update(h01.digest()) >>> h10.hexdigest() '3ad2a9b37c6070e374c7a8c508fe20ca86b6ed54e286e93a0318e95e881db5aa'

source: Credits
pt_pt: Créditos
ru: Авторы

source: BLAKE2_ was designed by *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn*, and *Christian Winnerlein* based on SHA-3_ finalist BLAKE_ created by *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier*, and *Raphael C.-W. Phan*.
pt_pt: BLAKE2_ foi concebido por *Jean-Philippe Aumasson*, *Samuel Neves*, *Zooko Wilcox-O'Hearn* e *Christian Winnerlein* com base no finalista SHA-3_ BLAKE_, criado por *Jean-Philippe Aumasson*, *Luca Henzen*, *Willi Meier* e *Raphael C.-W. Phan*.
ru: BLAKE2_ был разработан *Жаном-Филиппом Омассоном*, *Сэмюэлем Невесом*, *Зуко Уилкокс-О'Хирном* и *Кристианом Виннерляйном* на основе финалиста SHA-3_ BLAKE_, созданного *Жан-Филиппом Омассоном*, *Лука Хензен* , *Вилли Мейер* и *Рафаэль К.-В. Фан*.

source: It uses core algorithm from ChaCha_ cipher designed by *Daniel J. Bernstein*.
pt_pt: Utiliza o algoritmo principal do cifrador ChaCha_, concebido por *Daniel J. Bernstein*.
ru: Он использует основной алгоритм шифра ChaCha_, разработанный *Дэниелом Дж. Бернштейном*.

source: The stdlib implementation is based on pyblake2_ module. It was written by *Dmitry Chestnykh* based on C implementation written by *Samuel Neves*. The documentation was copied from pyblake2_ and written by *Dmitry Chestnykh*.
pt_pt: A implementação da biblioteca padrão é baseada no módulo pyblake2_. Foi escrita por *Dmitry Chestnykh* com base na implementação em C escrita por *Samuel Neves*. A documentação foi copiada do pyblake2_ e escrita por *Dmitry Chestnykh*.
ru: Реализация stdlib основана на модуле pyblake2_. Он был написан *Дмитрием Честных* на основе реализации C, написанной *Сэмюэлем Невесом*. Документация была скопирована с pyblake2_ и написана *Дмитрием Честных*.

source: The C code was partly rewritten for Python by *Christian Heimes*.
pt_pt: O código C foi parcialmente reescrito para Python por *Christian Heimes*.
ru: Код C был частично переписан для Python *Кристианом Хеймсом*.

source: The following public domain dedication applies for both C hash function implementation, extension code, and this documentation:
pt_pt: A seguinte dedicação ao domínio público aplica-se tanto à implementação da função de hash em C, ao código de extensão e a esta documentação:
ru: Следующее общедоступное определение применимо как к реализации хэш-функции C, коду расширения, так и к этой документации:

source: To the extent possible under law, the author(s) have dedicated all copyright and related and neighboring rights to this software to the public domain worldwide. This software is distributed without any warranty.
pt_pt: Na medida do possível de acordo com a lei, o(s) autor(es) dedicaram todos os direitos de autor e direitos relacionados e vizinhos deste software ao domínio público em todo o mundo. Este software é distribuído sem qualquer garantia.
ru: В той мере, в какой это возможно по закону, автор(ы) передали все авторские и смежные права на это программное обеспечение в общественное достояние по всему миру. Это программное обеспечение распространяется без каких-либо гарантий.

source: You should have received a copy of the CC0 Public Domain Dedication along with this software. If not, see https://creativecommons.org/publicdomain/zero/1.0/.
pt_pt: Deve ter recebido uma cópia da Dedicatória ao Domínio Público CC0 juntamente com este software. Se não, veja https://creativecommons.org/publicdomain/zero/1.0/.
ru: Вместе с этим программным обеспечением вы должны были получить копию Посвящения CC0 Public Domain. Если нет, см. https://creativecommons.org/publicdomain/zero/1.0/.

source: The following people have helped with development or contributed their changes to the project and the public domain according to the Creative Commons Public Domain Dedication 1.0 Universal:
pt_pt: As seguintes pessoas ajudaram no desenvolvimento ou contribuíram com as suas alterações para o projeto e para o domínio público de acordo com a Dedicatória ao Domínio Público da Creative Commons 1.0 Universal:
ru: Следующие люди помогали в разработке или вносили свои изменения в проект и общественное достояние в соответствии с лицензией Creative Commons Public Domain Dedication 1.0 Universal:

source: Module :mod:`hmac`
pt_pt: Módulo :mod:`hmac`
ru: Модуль :mod:`hmac`

source: A module to generate message authentication codes using hashes.
pt_pt: Um módulo para gerar códigos de autenticação de mensagem usando hashes.
ru: Модуль для генерации кодов аутентификации сообщений с использованием хэшей.

source: Module :mod:`base64`
pt_pt: Módulo :mod:`base64`
ru: Модуль :mod:`base64`

source: Another way to encode binary hashes for non-binary environments.
pt_pt: Outra forma de codificar hashes binários para ambientes não binários.
ru: Еще один способ кодирования двоичных хэшей для недвоичных сред.

source: The FIPS 180-4 publication on Secure Hash Algorithms.
pt_pt: A publicação FIPS 180-4 sobre Algoritmos de Hash Seguros.
ru: Публикация FIPS 180-4 по алгоритмам безопасного хеширования.

source: The FIPS 202 publication on the SHA-3 Standard.
pt_pt: A publicação FIPS 202 sobre o Padrão SHA-3.
ru: Публикация FIPS 202 по стандарту SHA-3.

source: Official BLAKE2 website.
pt_pt: Website oficial do BLAKE2.
ru: Официальный сайт BLAKE2.

source: Wikipedia article with information on which algorithms have known issues and what that means regarding their use.
pt_pt: Artigo da Wikipedia com informações sobre quais algoritmos têm problemas conhecidos e o que isso significa em relação ao seu uso.
ru: Статья в Википедии с информацией о том, какие алгоритмы имеют известные проблемы и что это означает в отношении их использования.

source: PKCS #5: Password-Based Cryptography Specification Version 2.1
pt_pt: PKCS #5: Especificação de Criptografia Baseada em Palavra-passe Versão 2.1
ru: PKCS #5: Спецификация шифрования на основе паролей, версия 2.1

source: NIST Recommendation for Password-Based Key Derivation.
pt_pt: Recomendação NIST para Derivação de Chave Baseada em Palavra-passe.
ru: Рекомендации NIST по получению ключей на основе пароля.

source: message digest, MD5
pt_pt: resumo de mensagem, MD5
ru: дайджест сообщения, MD5

source: secure hash algorithm, SHA1, SHA2, SHA224, SHA256, SHA384, SHA512, SHA3, Shake, Blake2
pt_pt: algoritmo de hash seguro, SHA1, SHA2, SHA224, SHA256, SHA384, SHA512, SHA3, Shake, Blake2
ru: алгоритм безопасного хеширования, SHA1, SHA2, SHA224, SHA256, SHA384, SHA512, SHA3, Shake, Blake2

source: (use in module hashlib)
pt_pt: (uso no módulo hashlib)
ru: (используйте в хеш-библиотеке модуля)

source: This module implements a common interface to many different secure hash and message digest algorithms. Included are the FIPS secure hash algorithms SHA1, SHA224, SHA256, SHA384, SHA512, (defined in `the FIPS 180-4 standard`_), the SHA-3 series (defined in `the FIPS 202 standard`_) as well as RSA's MD5 algorithm (defined in internet :rfc:`1321`). The terms "secure hash" and "message digest" are interchangeable. Older algorithms were called message digests. The modern term is secure hash.
ru: Этот модуль реализует общий интерфейс для множества различных алгоритмов безопасного хеширования и дайджеста сообщений. Включены безопасные алгоритмы хеширования FIPS SHA1, SHA224, SHA256, SHA384, SHA512 (определенные в «стандарте FIPS 180-4»), серия SHA-3 (определенная в «стандарте FIPS 202»_), а также Алгоритм RSA MD5 (определен в Интернете:rfc:`1321`). Термины «безопасный хэш» и «дайджест сообщения» взаимозаменяемы. Старые алгоритмы назывались дайджестами сообщений. Современный термин — безопасный хэш.

source: *fileobj* must be a file-like object opened for reading in binary mode. It accepts file objects from builtin :func:`open`, :class:`~io.BytesIO` instances, SocketIO objects from :meth:`socket.socket.makefile`, and similar. The function may bypass Python's I/O and use the file descriptor from :meth:`~io.IOBase.fileno` directly. *fileobj* must be assumed to be in an unknown state after this function returns or raises. It is up to the caller to close *fileobj*.
ru: *fileobj* должен быть файлоподобным объектом, открытым для чтения в двоичном режиме. Он принимает файловые объекты из встроенных экземпляров :func:`open`, :class:`~io.BytesIO`, объекты SocketIO из :meth:`socket.socket.makefile` и т.п. Функция может обходить ввод-вывод Python и напрямую использовать дескриптор файла из :meth:`~io.IOBase.fileno`. Предполагается, что *fileobj* находится в неизвестном состоянии после того, как эта функция вернет или вызовет вызов. Вызывающая сторона должна закрыть *fileobj*.

source: *Alexandr Sokolovskiy*
ru: *Александр Соколовский*
