Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/heapq.po
Languages: ko, ru

source: :mod:`!heapq` --- Heap queue algorithm
ru: :mod:`!heapq` --- Алгоритм очереди в куче

source: **Source code:** :source:`Lib/heapq.py`
ko: **Kod źródłowy:** :source:`Lib/heapq.py`
ru: **Исходный код:** :source:`Lib/heapq.py`

source: This module provides an implementation of the heap queue algorithm, also known as the priority queue algorithm.
ko: Ten moduł zawiera implementację algorytmu kolejki kopcowej, znanego również jako algorytm kolejki priorytetowej.
ru: Этот модуль обеспечивает реализацию алгоритма очереди кучи, также известного как алгоритм очереди с приоритетами.

source: Heaps are binary trees for which every parent node has a value less than or equal to any of its children. We refer to this condition as the heap invariant.
ru: Кучи — это двоичные деревья, в которых каждый родительский узел имеет значение, меньшее или равное любому из его дочерних узлов. Мы называем это условие инвариантом кучи.

source: This implementation uses arrays for which ``heap[k] <= heap[2*k+1]`` and ``heap[k] <= heap[2*k+2]`` for all *k*, counting elements from zero. For the sake of comparison, non-existing elements are considered to be infinite. The interesting property of a heap is that its smallest element is always the root, ``heap[0]``.
ru: В этой реализации используются массивы, для которых ``heap[k] <= heap[2*k+1]`` и ``heap[k] <= heap[2*k+2]`` для всех *k*, считая элементы с нуля. Для сравнения несуществующие элементы считаются бесконечными. Интересное свойство кучи заключается в том, что ее наименьший элемент всегда является корнем, ``куча[0]``.

source: The API below differs from textbook heap algorithms in two aspects: (a) We use zero-based indexing. This makes the relationship between the index for a node and the indexes for its children slightly less obvious, but is more suitable since Python uses zero-based indexing. (b) Our pop method returns the smallest item, not the largest (called a "min heap" in textbooks; a "max heap" is more common in texts because of its suitability for in-place sorting).
ru: API ниже отличается от алгоритмов кучи учебника в двух аспектах: (a) Мы используем индексацию с нуля. Это делает связь между индексом для узла и индексами для его потомков немного менее очевидной, но более подходящей, поскольку Python использует индексацию с нуля. (b) Наш метод pop возвращает наименьший элемент, а не наибольший (называемый «min heap» в учебниках; «max heap» чаще встречается в текстах из-за его пригодности для сортировки на месте).

source: These two make it possible to view the heap as a regular Python list without surprises: ``heap[0]`` is the smallest item, and ``heap.sort()`` maintains the heap invariant!
ru: Эти два параметра позволяют без сюрпризов рассматривать кучу как обычный список Python: «heap[0]» — это самый маленький элемент, а «heap.sort()» сохраняет инвариант кучи!

source: To create a heap, use a list initialized to ``[]``, or you can transform a populated list into a heap via function :func:`heapify`.
ru: Чтобы создать кучу, используйте список, инициализированный как ``[]``, или вы можете преобразовать заполненный список в кучу с помощью функции :func:`heapify`.

source: The following functions are provided:
ru: Предусмотрены следующие функции:

source: Push the value *item* onto the *heap*, maintaining the heap invariant.
ru: Помещаем значение *item* в *кучу*, сохраняя кучность инвариантной.

source: Pop and return the smallest item from the *heap*, maintaining the heap invariant. If the heap is empty, :exc:`IndexError` is raised. To access the smallest item without popping it, use ``heap[0]``.
ru: Извлеките и верните самый маленький элемент из *кучи*, сохраняя инвариант кучи. Если куча пуста, возникает :exc:`IndexError`. Чтобы получить доступ к самому маленькому элементу, не извлекая его, используйте heap[0]``.

source: Push *item* on the heap, then pop and return the smallest item from the *heap*. The combined action runs more efficiently than :func:`heappush` followed by a separate call to :func:`heappop`.
ko: Натисніть *item* на купу, а потім витягніть і поверніть найменший елемент із *купи*. Комбінована дія працює ефективніше, ніж :func:`heappush`, після якого слід окремий виклик :func:`heappop`.
ru: Нажмите *item* в куче, затем извлеките и верните самый маленький элемент из *кучи*. Комбинированное действие выполняется более эффективно, чем :func:`heappush`, за которым следует отдельный вызов :func:`heappop`.

source: Transform list *x* into a heap, in-place, in linear time.
ru: Преобразовать список *x* в кучу на месте за линейное время.

source: Pop and return the smallest item from the *heap*, and also push the new *item*. The heap size doesn't change. If the heap is empty, :exc:`IndexError` is raised.
ko: Витягніть і поверніть найменший предмет із *купи*, а також натисніть новий *предмет*. Розмір купи не змінюється. Якщо купа порожня, виникає :exc:`IndexError`.
ru: Извлеките и верните самый маленький элемент из *кучи*, а также нажмите новый *элемент*. Размер кучи не меняется. Если куча пуста, возникает :exc:`IndexError`.

source: This one step operation is more efficient than a :func:`heappop` followed by :func:`heappush` and can be more appropriate when using a fixed-size heap. The pop/push combination always returns an element from the heap and replaces it with *item*.
ko: Ця одноетапна операція є ефективнішою, ніж :func:`heappop`, за якою слідує :func:`heappush`, і може бути більш доцільною, якщо використовується купа фіксованого розміру. Комбінація pop/push завжди повертає елемент із купи та замінює його на *item*.
ru: Эта одношаговая операция более эффективна, чем :func:`heappop`, за которой следует :func:`heappush`, и может быть более подходящей при использовании кучи фиксированного размера. Комбинация pop/push всегда возвращает элемент из кучи и заменяет его на *item*.

source: The value returned may be larger than the *item* added. If that isn't desired, consider using :func:`heappushpop` instead. Its push/pop combination returns the smaller of the two values, leaving the larger value on the heap.
ko: Повернене значення може бути більшим за доданий *елемент*. Якщо це небажано, подумайте про використання замість цього :func:`heappushpop`. Його комбінація push/pop повертає менше з двох значень, залишаючи більше значення в купі.
ru: Возвращенное значение может быть больше, чем добавленный *элемент*. Если это нежелательно, рассмотрите возможность использования вместо этого :func:`heappushpop`. Его комбинация push/pop возвращает меньшее из двух значений, оставляя большее значение в куче.

source: The module also offers three general purpose functions based on heaps.
ko: Модуль також пропонує три функції загального призначення, засновані на купах.
ru: Модуль также предлагает три функции общего назначения на основе куч.

source: Merge multiple sorted inputs into a single sorted output (for example, merge timestamped entries from multiple log files). Returns an :term:`iterator` over the sorted values.
ko: Об’єднайте кілька відсортованих вхідних даних в один відсортований вихід (наприклад, об’єднайте записи з мітками часу з кількох файлів журналу). Повертає :term:`iterator` над відсортованими значеннями.
ru: Объединить несколько отсортированных входов в один отсортированный выход (например, объединить записи с метками времени из нескольких файлов журнала). Возвращает :term:`iterator` по отсортированным значениям.

source: Similar to ``sorted(itertools.chain(*iterables))`` but returns an iterable, does not pull the data into memory all at once, and assumes that each of the input streams is already sorted (smallest to largest).
ko: Подібно до ``sorted(itertools.chain(*iterables))``, але повертає iterable, не затягує дані в пам’ять усі одночасно та передбачає, що кожен із вхідних потоків уже відсортовано (від найменшого до найбільшого).
ru: Похож на ``sorted(itertools.chain(*iterables))``, но возвращает итерируемый объект, не извлекает данные в память сразу и предполагает, что каждый из входных потоков уже отсортирован (от меньшего к большему).

source: Has two optional arguments which must be specified as keyword arguments.
ko: Posiada dwa opcjonalne argumenty, które muszą być określone jako argument nazwany.
ru: Имеет два необязательных аргумента, которые должны быть указаны как именованные аргументы.

source: *key* specifies a :term:`key function` of one argument that is used to extract a comparison key from each input element. The default value is ``None`` (compare the elements directly).
ko: *key* визначає :term:`key function` одного аргументу, який використовується для отримання ключа порівняння з кожного вхідного елемента. Значення за замовчуванням – ``None`` (пряме порівняння елементів).
ru: *key* определяет :term:`ключевую функцию` с одним аргументом, которая используется для извлечения ключа сравнения из каждого входного элемента. Значение по умолчанию — None (сравнивать элементы напрямую).

source: *reverse* is a boolean value. If set to ``True``, then the input elements are merged as if each comparison were reversed. To achieve behavior similar to ``sorted(itertools.chain(*iterables), reverse=True)``, all iterables must be sorted from largest to smallest.
ko: *reverse* — це логічне значення. Якщо встановлено значення ``True``, то вхідні елементи об’єднуються так, ніби кожне порівняння було зворотним. Щоб досягти поведінки, подібної до ``sorted(itertools.chain(*iterables), reverse=True)``, усі ітератори мають бути відсортовані від найбільшого до найменшого.
ru: *reverse* — логическое значение. Если установлено значение «True», то входные элементы объединяются, как если бы каждое сравнение было обратным. Чтобы добиться поведения, аналогичного sorted(itertools.chain(*iterables),verse=True)``, все итерации должны быть отсортированы от наибольшего к наименьшему.

source: Added the optional *key* and *reverse* parameters.
ko: Додано додаткові параметри *key* і *reverse*.
ru: Добавлены необязательные параметры *key* и *reverse*.

source: Return a list with the *n* largest elements from the dataset defined by *iterable*. *key*, if provided, specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). Equivalent to: ``sorted(iterable, key=key, reverse=True)[:n]``.
ko: Повертає список із *n* найбільшими елементами з набору даних, визначеного *iterable*. *key*, якщо надається, визначає функцію одного аргументу, який використовується для отримання ключа порівняння з кожного елемента в *iterable* (наприклад, ``key=str.lower``). Еквівалент: ``sorted(iterable, key=key, reverse=True)[:n]``.
ru: Возвращает список с *n* самыми большими элементами из набора данных, определенного *iterable*. *key*, если он указан, определяет функцию одного аргумента, которая используется для извлечения ключа сравнения из каждого элемента в *iterable* (например, ``key=str.lower``). Эквивалентно: ``sorted(iterable, key=key,verse=True)[:n]``.

source: Return a list with the *n* smallest elements from the dataset defined by *iterable*. *key*, if provided, specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). Equivalent to: ``sorted(iterable, key=key)[:n]``.
ko: Повертає список із *n* найменшими елементами з набору даних, визначеного *iterable*. *key*, якщо надається, визначає функцію одного аргументу, який використовується для отримання ключа порівняння з кожного елемента в *iterable* (наприклад, ``key=str.lower``). Еквівалент: ``sorted(iterable, key=key)[:n]``.
ru: Возвращает список с *n* наименьшими элементами из набора данных, определенного *iterable*. *key*, если он указан, определяет функцию одного аргумента, которая используется для извлечения ключа сравнения из каждого элемента в *iterable* (например, ``key=str.lower``). Эквивалентно: ``sorted(iterable, key=key)[:n]``.

source: The latter two functions perform best for smaller values of *n*. For larger values, it is more efficient to use the :func:`sorted` function. Also, when ``n==1``, it is more efficient to use the built-in :func:`min` and :func:`max` functions. If repeated usage of these functions is required, consider turning the iterable into an actual heap.
ko: Дві останні функції працюють найкраще для менших значень *n*. Для більших значень ефективніше використовувати функцію :func:`sorted`. Крім того, коли ``n==1``, ефективніше використовувати вбудовані функції :func:`min` і :func:`max`. Якщо потрібне повторне використання цих функцій, подумайте про те, щоб перетворити iterable на справжню купу.
ru: Последние две функции лучше всего работают при меньших значениях *n*. Для больших значений более эффективно использовать функцию :func:`sorted`. Кроме того, когда ``n==1``, более эффективно использовать встроенные функции :func:`min` и :func:`max`. Если требуется повторное использование этих функций, рассмотрите возможность превращения итерации в настоящую кучу.

source: Basic Examples
ko: Podstawowe przykłady
ru: Основные примеры

source: A `heapsort <https://en.wikipedia.org/wiki/Heapsort>`_ can be implemented by pushing all values onto a heap and then popping off the smallest values one at a time::
ko: `heapsort <https://en.wikipedia.org/wiki/Heapsort>`_ може бути реалізовано шляхом переміщення всіх значень у купу, а потім вилучення найменших значень по одному:
ru: `Кучная сортировка <https://en.wikipedia.org/wiki/Heapsort>`_ может быть реализована путем помещения всех значений в кучу и последующего извлечения наименьших значений по одному::

source: This is similar to ``sorted(iterable)``, but unlike :func:`sorted`, this implementation is not stable.
ko: Це схоже на ``sorted(iterable)``, але на відміну від :func:`sorted`, ця реалізація не є стабільною.
ru: Это похоже на sorted(iterable), но в отличие от :func:sorted эта реализация не стабильна.

source: Heap elements can be tuples. This is useful for assigning comparison values (such as task priorities) alongside the main record being tracked::
ko: Елементи купи можуть бути кортежами. Це корисно для призначення порівняльних значень (наприклад, пріоритетів завдань) поряд із основним записом, який відстежується:
ru: Элементы кучи могут быть кортежами. Это полезно для назначения значений сравнения (например, приоритетов задач) рядом с основной отслеживаемой записью:

source: Priority Queue Implementation Notes
ko: Примітки щодо реалізації пріоритетної черги
ru: Замечания по реализации очереди приоритетов

source: A `priority queue <https://en.wikipedia.org/wiki/Priority_queue>`_ is common use for a heap, and it presents several implementation challenges:
ko: `Пріоритетна черга <https://en.wikipedia.org/wiki/Priority_queue>`_ зазвичай використовується для купи, і це створює кілька проблем реалізації:
ru: `Очередь с приоритетами <https://en.wikipedia.org/wiki/Priority_queue>`_ обычно используется для кучи и создает несколько проблем реализации:

source: Sort stability: how do you get two tasks with equal priorities to be returned in the order they were originally added?
ko: Стабільність сортування: як повернути два завдання з однаковими пріоритетами в тому порядку, в якому вони були спочатку додані?
ru: Стабильность сортировки: как добиться того, чтобы две задачи с одинаковым приоритетом возвращались в том порядке, в котором они были изначально добавлены?

source: Tuple comparison breaks for (priority, task) pairs if the priorities are equal and the tasks do not have a default comparison order.
ko: Порівняння кортежу розривається для пар (пріоритет, завдання), якщо пріоритети рівні, а завдання не мають порядку порівняння за замовчуванням.
ru: Сравнение кортежей прерывается для пар (приоритет, задача), если приоритеты равны и задачи не имеют порядка сравнения по умолчанию.

source: If the priority of a task changes, how do you move it to a new position in the heap?
ko: Якщо пріоритет завдання змінюється, як перемістити його на нове місце в купі?
ru: Если приоритет задачи изменится, как переместить ее на новую позицию в куче?

source: Or if a pending task needs to be deleted, how do you find it and remove it from the queue?
ko: Або якщо завдання, що очікує на виконання, потрібно видалити, як його знайти та видалити з черги?
ru: Или, если ожидающую задачу необходимо удалить, как ее найти и удалить из очереди?

source: A solution to the first two challenges is to store entries as 3-element list including the priority, an entry count, and the task. The entry count serves as a tie-breaker so that two tasks with the same priority are returned in the order they were added. And since no two entry counts are the same, the tuple comparison will never attempt to directly compare two tasks.
ko: Рішенням перших двох проблем є збереження записів у вигляді списку з 3 елементів, включаючи пріоритет, кількість записів і завдання. Підрахунок записів служить вирішальним, щоб два завдання з однаковим пріоритетом поверталися в порядку їх додавання. А оскільки немає двох однакових підрахунків записів, порівняння кортежів ніколи не намагатиметься безпосередньо порівняти два завдання.
ru: Решением первых двух проблем является хранение записей в виде списка из трех элементов, включая приоритет, количество записей и задачу. Счетчик записей служит для разрешения конфликтов, поэтому две задачи с одинаковым приоритетом возвращаются в том порядке, в котором они были добавлены. А поскольку не существует двух одинаковых значений количества записей, сравнение кортежей никогда не будет пытаться напрямую сравнить две задачи.

source: Another solution to the problem of non-comparable tasks is to create a wrapper class that ignores the task item and only compares the priority field::
ko: Іншим вирішенням проблеми непорівнюваних завдань є створення класу-оболонки, який ігнорує елемент завдання та порівнює лише поле пріоритету:
ru: Другим решением проблемы несопоставимых задач является создание класса-обертки, который игнорирует элемент задачи и сравнивает только поле приоритета::

source: The remaining challenges revolve around finding a pending task and making changes to its priority or removing it entirely. Finding a task can be done with a dictionary pointing to an entry in the queue.
ko: Проблеми, що залишилися, пов’язані з пошуком незавершеного завдання та внесенням змін до його пріоритету або його повним видаленням. Знайти завдання можна за допомогою словника, який вказує на запис у черзі.
ru: Остальные проблемы связаны с поиском ожидающей задачи и изменением ее приоритета или полным ее удалением. Найти задачу можно с помощью словаря, указывающего на запись в очереди.

source: Removing the entry or changing its priority is more difficult because it would break the heap structure invariants. So, a possible solution is to mark the entry as removed and add a new entry with the revised priority::
ko: Видалити запис або змінити його пріоритет складніше, оскільки це порушить інваріанти структури купи. Отже, можливим рішенням є позначення запису як видаленого та додавання нового запису зі зміненим пріоритетом::
ru: Удаление записи или изменение ее приоритета сложнее, поскольку это нарушит инварианты структуры кучи. Итак, возможное решение — пометить запись как удаленную и добавить новую запись с измененным приоритетом:

source: Theory
ko: Teoria
ru: Теория

source: Heaps are arrays for which ``a[k] <= a[2*k+1]`` and ``a[k] <= a[2*k+2]`` for all *k*, counting elements from 0. For the sake of comparison, non-existing elements are considered to be infinite. The interesting property of a heap is that ``a[0]`` is always its smallest element.
ko: Купи — це масиви, для яких ``a[k] <= a[2*k+1]`` і ``a[k] <= a[2*k+2]`` для всіх *k*, підрахунок елементів від 0. Для порівняння, неіснуючі елементи вважаються нескінченними. Цікавою властивістю купи є те, що ``a[0]`` завжди є її найменшим елементом.
ru: Кучи — это массивы, для которых ``a[k] <= a[2*k+1]`` и ``a[k] <= a[2*k+2]`` для всех *k*, считая элементы от 0. Для сравнения несуществующие элементы считаются бесконечными. Интересное свойство кучи заключается в том, что ``a[0]`` всегда является ее наименьшим элементом.

source: The strange invariant above is meant to be an efficient memory representation for a tournament. The numbers below are *k*, not ``a[k]``::
ko: Дивний інваріант вище призначений для ефективного представлення пам’яті для турніру. Цифри нижче *k*, а не ``a[k]``::
ru: Странный инвариант, приведенный выше, предназначен для эффективного представления памяти для турнира. Числа ниже — *k*, а не ``a[k]``::

source: In the tree above, each cell *k* is topping ``2*k+1`` and ``2*k+2``. In a usual binary tournament we see in sports, each cell is the winner over the two cells it tops, and we can trace the winner down the tree to see all opponents s/he had. However, in many computer applications of such tournaments, we do not need to trace the history of a winner. To be more memory efficient, when a winner is promoted, we try to replace it by something else at a lower level, and the rule becomes that a cell and the two cells it tops contain three different items, but the top cell "wins" over the two topped cells.
ko: У наведеному вище дереві кожна комірка *k* є вершиною ``2*k+1`` і ``2*k+2``. У звичайному бінарному турнірі, який ми бачимо у спорті, кожна клітина є переможцем над двома клітинками, які вона очолює, і ми можемо відстежити переможця вниз по дереву, щоб побачити всіх суперників, які він/вона мали. Однак у багатьох комп’ютерних програмах таких турнірів нам не потрібно відстежувати історію переможця. Щоб підвищити ефективність пам’яті, коли переможець підвищується, ми намагаємося замінити його чимось іншим на нижчому рівні, і правило стає таким, що клітинка та дві верхні клітинки містять три різні елементи, але верхня клітинка "перемагає". над двома верхніми клітинами.
ru: В дереве выше каждая ячейка *k* является вершиной ``2*k+1`` и ``2*k+2``. В обычном бинарном турнире, который мы видим в спорте, каждая ячейка является победителем над двумя ячейками, которые она возглавляет, и мы можем проследить победителя вниз по дереву, чтобы увидеть всех противников, которые у него были. Однако во многих компьютерных приложениях таких турниров нам не нужно отслеживать историю победителя. Чтобы повысить эффективность использования памяти, когда победитель повышается, мы пытаемся заменить его чем-то другим на более низком уровне, и правило становится таким, что ячейка и две ячейки, которые она возглавляет, содержат три разных элемента, но верхняя ячейка «побеждает». над двумя верхними ячейками.

source: If this heap invariant is protected at all time, index 0 is clearly the overall winner. The simplest algorithmic way to remove it and find the "next" winner is to move some loser (let's say cell 30 in the diagram above) into the 0 position, and then percolate this new 0 down the tree, exchanging values, until the invariant is re-established. This is clearly logarithmic on the total number of items in the tree. By iterating over all items, you get an *O*\ (*n* log *n*) sort.
ru: Если этот инвариант кучи всегда защищен, индекс 0 явно будет абсолютным победителем. Самый простой алгоритмический способ удалить его и найти «следующего» победителя — переместить какого-нибудь проигравшего (скажем, ячейку 30 на диаграмме выше) в позицию 0, а затем просачивать этот новый 0 вниз по дереву, меняя значения, пока не будет найден инвариант восстанавливается. Это явно логарифмическая зависимость от общего количества элементов в дереве. Перебирая все элементы, вы получаете сортировку *O*\ (*n* log *n*).
