Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/heapq.po
Languages: ko, ru

source: A nice feature of this sort is that you can efficiently insert new items while the sort is going on, provided that the inserted items are not "better" than the last 0'th element you extracted. This is especially useful in simulation contexts, where the tree holds all incoming events, and the "win" condition means the smallest scheduled time. When an event schedules other events for execution, they are scheduled into the future, so they can easily go into the heap. So, a heap is a good structure for implementing schedulers (this is what I used for my MIDI sequencer :-).
ko: Приємною особливістю цього сортування є те, що ви можете ефективно вставляти нові елементи під час сортування, за умови, що вставлені елементи не "кращі", ніж останній нульовий елемент, який ви витягли. Це особливо корисно в контекстах симуляції, де дерево містить усі вхідні події, а умова "виграш" означає найменший запланований час. Коли подія планує інші події для виконання, вони плануються в майбутньому, тому їх можна легко перемістити в купу. Отже, купа є хорошою структурою для реалізації планувальників (це те, що я використовував для свого MIDI-секвенсора :-).
ru: Приятной особенностью такого рода является то, что вы можете эффективно вставлять новые элементы во время сортировки, при условии, что вставленные элементы не "лучше", чем последний 0-й элемент, который вы извлекли. Это особенно полезно в контекстах моделирования, где дерево содержит все входящие события, а условие "победы" означает наименьшее запланированное время. Когда событие планирует другие события для выполнения, они планируются на будущее, поэтому их можно легко поместить в кучу. Таким образом, куча является хорошей структурой для реализации планировщиков (это то, что я использовал для своего MIDI-секвенсора :-).

source: Various structures for implementing schedulers have been extensively studied, and heaps are good for this, as they are reasonably speedy, the speed is almost constant, and the worst case is not much different than the average case. However, there are other representations which are more efficient overall, yet the worst cases might be terrible.
ko: Різноманітні структури для реалізації планувальників були ретельно вивчені, і для цього добре підійдуть купи, оскільки вони досить швидкі, швидкість майже постійна, а найгірший випадок не сильно відрізняється від середнього випадку. Однак існують інші представлення, які в цілому є більш ефективними, але найгірші випадки можуть бути жахливими.
ru: Различные структуры для реализации планировщиков были тщательно изучены, и кучи хороши для этого, поскольку они достаточно быстры, скорость почти постоянна, и худший случай не сильно отличается от среднего. Однако есть и другие представления, которые в целом более эффективны, но худшие случаи могут быть ужасными.

source: Heaps are also very useful in big disk sorts. You most probably all know that a big sort implies producing "runs" (which are pre-sorted sequences, whose size is usually related to the amount of CPU memory), followed by a merging passes for these runs, which merging is often very cleverly organised [#]_. It is very important that the initial sort produces the longest runs possible. Tournaments are a good way to achieve that. If, using all the memory available to hold a tournament, you replace and percolate items that happen to fit the current run, you'll produce runs which are twice the size of the memory for random input, and much better for input fuzzily ordered.
ko: Купи також дуже корисні для сортування великих дисків. Напевно, ви всі знаєте, що велике сортування передбачає створення "запусків" (це попередньо відсортовані послідовності, розмір яких зазвичай пов’язаний з обсягом пам’яті процесора), після чого слід об’єднання проходів для цих запусків, яке часто є дуже спритним. організовано [#]_. Дуже важливо, щоб початкове сортування створювало якнайдовші серії. Хорошим способом досягти цього є турніри. Якщо, використовуючи всю пам’ять, доступну для проведення турніру, ви замінюєте та просочуєте елементи, які випадково відповідають поточному циклу, ви створите цикли, які вдвічі перевищують розмір пам’яті для випадкового введення, і набагато краще для нечітко впорядкованого введення.
ru: Кучи также очень полезны при сортировке больших дисков. Вы, скорее всего, все знаете, что большая сортировка подразумевает создание «прогонов» (которые представляют собой предварительно отсортированные последовательности, размер которых обычно зависит от объема памяти процессора), за которым следуют проходы слияния для этих прогонов, причем слияние часто выполняется очень умно. организованный [#]_ . Очень важно, чтобы первоначальная сортировка давала как можно более длинные прогоны. Турниры – хороший способ добиться этого. Если, используя всю доступную память для проведения турнира, вы замените и просеиваете элементы, которые соответствуют текущему прогону, вы создадите прогоны, которые в два раза превышают размер памяти для случайного ввода и намного лучше для ввода нечетко упорядоченных.

source: Moreover, if you output the 0'th item on disk and get an input which may not fit in the current tournament (because the value "wins" over the last output value), it cannot fit in the heap, so the size of the heap decreases. The freed memory could be cleverly reused immediately for progressively building a second heap, which grows at exactly the same rate the first heap is melting. When the first heap completely vanishes, you switch heaps and start a new run. Clever and quite effective!
ko: Більше того, якщо ви виведете 0-й елемент на диску та отримаєте вхідні дані, які можуть не відповідати поточному турніру (оскільки значення "перемагає" над останнім вихідним значенням), воно не може поміститися у купу, тому розмір купа зменшується. Звільнену пам’ять можна негайно використати повторно для поступового створення другої купи, яка росте з тією ж швидкістю, що й перша купа тане. Коли перша купа повністю зникає, ви змінюєте купи та починаєте новий запуск. Розумно і досить ефективно!
ru: Более того, если вы выводите 0-й элемент на диск и получаете входные данные, которые могут не поместиться в текущем турнире (потому что значение "выигрывает" над последним выходным значением), оно не может поместиться в кучу, поэтому размер кучи уменьшается. Освобожденную память можно было бы ловко использовать повторно немедленно для постепенного построения второй кучи, которая растет точно с той же скоростью, с которой тает первая куча. Когда первая куча полностью исчезает, вы переключаете кучи и начинаете новый запуск. Умно и довольно эффективно!

source: In a word, heaps are useful memory structures to know. I use them in a few applications, and I think it is good to keep a 'heap' module around. :-)
ko: Одним словом, купи - це корисні структури пам'яті, які слід знати. Я використовую їх у кількох програмах, і я вважаю, що добре тримати модуль "купи". :-)
ru: Одним словом, кучи — это полезные структуры памяти, которые нужно знать. Я использую их в нескольких приложениях, и я думаю, что хорошо иметь модуль «кучи» поблизости. :-)

source: Footnotes
ko: 각주
ru: Сноски

source: The disk balancing algorithms which are current, nowadays, are more annoying than clever, and this is a consequence of the seeking capabilities of the disks. On devices which cannot seek, like big tape drives, the story was quite different, and one had to be very clever to ensure (far in advance) that each tape movement will be the most effective possible (that is, will best participate at "progressing" the merge). Some tapes were even able to read backwards, and this was also used to avoid the rewinding time. Believe me, real good tape sorts were quite spectacular to watch! From all times, sorting has always been a Great Art! :-)
ko: Сучасні алгоритми балансування дисків радше дратують, ніж розумні, і це є наслідком можливостей пошуку дисків. На пристроях, які не можуть шукати, як-от великі стрічкові накопичувачі, історія була зовсім іншою, і потрібно було бути дуже кмітливим, щоб переконатися (заздалегідь), що кожен рух стрічки буде максимально ефективним (тобто найкраще братиме участь у " просувається" злиття). Деякі стрічки навіть могли читати назад, і це також використовувалося, щоб уникнути перемотування часу. Повірте, дивитися справді гарні стрічки було дуже вражаюче! З усіх часів сортування завжди було Великим Мистецтвом! :-)
ru: Алгоритмы балансировки дисков, которые сейчас актуальны, скорее раздражают, чем умны, и это следствие возможностей поиска дисков. На устройствах, которые не могут искать, таких как большие ленточные накопители, история была совсем другой, и нужно было быть очень умным, чтобы гарантировать (задолго до этого), что каждое движение ленты будет максимально эффективным (то есть будет наилучшим образом участвовать в «продвижении» слияния). Некоторые ленты даже могли читать в обратном направлении, и это также использовалось, чтобы избежать времени перемотки. Поверьте мне, действительно хорошие сортировки лент были довольно захватывающими! Во все времена сортировка всегда была Великим Искусством! :-)
