Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/html.parser.po
Languages: ru, sv

source: :mod:`!html.parser` --- Simple HTML and XHTML parser
ru: :mod:`!html.parser` --- Простой парсер HTML и XHTML.
sv: :mod:`!html.parser` --- Enkel HTML- och XHTML-parser

source: **Source code:** :source:`Lib/html/parser.py`
ru: **Исходный код:** :source:`Lib/html/parser.py`
sv: **Källkod:** :source:`Lib/html/parser.py`

source: This module defines a class :class:`HTMLParser` which serves as the basis for parsing text files formatted in HTML (HyperText Mark-up Language) and XHTML.
ru: Этот модуль определяет класс :class:`HTMLParser`, который служит основой для анализа текстовых файлов, отформатированных в HTML (язык гипертекстовой разметки) и XHTML.
sv: Den här modulen definierar en klass :class:`HTMLParser` som fungerar som bas för parsning av textfiler formaterade i HTML (HyperText Mark-up Language) och XHTML.

source: Create a parser instance able to parse invalid markup.
ru: Создайте экземпляр синтаксического анализатора, способный анализировать недопустимую разметку.
sv: Skapa en parserinstans som kan parsa ogiltig markup.

source: If *convert_charrefs* is ``True`` (the default), all character references (except the ones in ``script``/``style`` elements) are automatically converted to the corresponding Unicode characters.
ru: Если *convert_charrefs* имеет значение True (по умолчанию), все ссылки на символы (кроме тех, которые находятся в элементах script/style) автоматически преобразуются в соответствующие символы Юникода.

source: An :class:`.HTMLParser` instance is fed HTML data and calls handler methods when start tags, end tags, text, comments, and other markup elements are encountered. The user should subclass :class:`.HTMLParser` and override its methods to implement the desired behavior.
ru: Экземпляр :class:`.HTMLParser` получает данные HTML и вызывает методы-обработчики при обнаружении начальных тегов, конечных тегов, текста, комментариев и других элементов разметки. Пользователь должен создать подкласс :class:`.HTMLParser` и переопределить его методы для реализации желаемого поведения.
sv: En instans av :class:`.HTMLParser` matas med HTML-data och anropar hanteringsmetoder när starttaggar, sluttaggar, text, kommentarer och andra markeringselement påträffas. Användaren bör subklassa :class:`.HTMLParser` och åsidosätta dess metoder för att implementera önskat beteende.

source: This parser does not check that end tags match start tags or call the end-tag handler for elements which are closed implicitly by closing an outer element.
ru: Этот синтаксический анализатор не проверяет соответствие конечных тегов начальным тегам и не вызывает обработчик конечного тега для элементов, которые закрываются неявно путем закрытия внешнего элемента.
sv: Denna parser kontrollerar inte att sluttaggar matchar starttaggar eller anropar sluttagghanteraren för element som stängs implicit genom att stänga ett yttre element.

source: *convert_charrefs* keyword argument added.
ru: Добавлен аргумент ключевого слова *convert_charrefs*.
sv: *convert_charrefs* nyckelordsargument tillagt.

source: The default value for argument *convert_charrefs* is now ``True``.
ru: Значением по умолчанию для аргумента *convert_charrefs* теперь является ``True``.
sv: Standardvärdet för argumentet *convert_charrefs* är nu ``True``.

source: Example HTML Parser Application
ru: Пример приложения HTML-парсера
sv: Exempel på HTML Parser-applikation

source: As a basic example, below is a simple HTML parser that uses the :class:`HTMLParser` class to print out start tags, end tags, and data as they are encountered::
ru: В качестве базового примера ниже приведен простой анализатор HTML, который использует класс :class:`HTMLParser` для вывода начальных тегов, конечных тегов и данных по мере их появления:

source: The output will then be:
ru: Результатом будет:
sv: Utgången kommer då att vara:

source: Encountered a start tag: html Encountered a start tag: head Encountered a start tag: title Encountered some data : Test Encountered an end tag : title Encountered an end tag : head Encountered a start tag: body Encountered a start tag: h1 Encountered some data : Parse me! Encountered an end tag : h1 Encountered an end tag : body Encountered an end tag : html
ru: Обнаружен начальный тег: html. Обнаружен начальный тег: head Обнаружен начальный тег: title Обнаружены некоторые данные: Тест Обнаружен конечный тег: заголовок. Обнаружен конечный тег: head Обнаружен начальный тег: body Обнаружен начальный тег: h1. Обнаружены некоторые данные: Разберите меня! Обнаружен закрывающий тег: h1. Обнаружен конечный тег: тело Обнаружен закрывающий тег: html.

source: :class:`.HTMLParser` Methods
ru: Методы :class:`.HTMLParser`
sv: :class:`.HTMLParser` Metoder

source: :class:`HTMLParser` instances have the following methods:
ru: Экземпляры :class:`HTMLParser` имеют следующие методы:
sv: :class:`HTMLParser`\-instanser har följande metoder:

source: Feed some text to the parser. It is processed insofar as it consists of complete elements; incomplete data is buffered until more data is fed or :meth:`close` is called. *data* must be :class:`str`.
ru: Подайте некоторый текст в парсер. Он обрабатывается постольку, поскольку состоит из целостных элементов; неполные данные буферизуются до тех пор, пока не будут переданы дополнительные данные или не будет вызван :meth:`close`. *данные* должны быть :class:`str`.
sv: Mata in text till parsern. Den bearbetas i den mån den består av fullständiga element; ofullständiga data buffras tills mer data matas in eller :meth:`close` anropas. *data* måste vara :class:`str`.

source: Force processing of all buffered data as if it were followed by an end-of-file mark. This method may be redefined by a derived class to define additional processing at the end of the input, but the redefined version should always call the :class:`HTMLParser` base class method :meth:`close`.
ru: Принудительная обработка всех буферизованных данных, как если бы за ними следовала метка конца файла. Этот метод может быть переопределен производным классом для определения дополнительной обработки в конце ввода, но переопределенная версия всегда должна вызывать метод базового класса :class:`HTMLParser` :meth:`close`.
sv: Tvingar fram bearbetning av alla buffrade data som om de följdes av en markering för slutet av filen. Denna metod kan omdefinieras av en härledd klass för att definiera ytterligare bearbetning i slutet av inmatningen, men den omdefinierade versionen bör alltid anropa basklassmetoden :meth:`close` i :class:`HTMLParser`.

source: Reset the instance. Loses all unprocessed data. This is called implicitly at instantiation time.
ru: Сбросьте экземпляр. Теряет все необработанные данные. Это вызывается неявно во время создания экземпляра.
sv: Återställer instansen. Förlorar alla obearbetade data. Detta anropas implicit vid instantieringstillfället.

source: Return current line number and offset.
ru: Возвращает текущий номер строки и смещение.
sv: Returnerar aktuellt radnummer och offset.

source: Return the text of the most recently opened start tag. This should not normally be needed for structured processing, but may be useful in dealing with HTML "as deployed" or for re-generating input with minimal changes (whitespace between attributes can be preserved, etc.).
ru: Возвращает текст последнего открытого начального тега. Обычно это не требуется для структурированной обработки, но может быть полезно при работе с HTML «в том виде, в котором он развернут» или для повторного создания входных данных с минимальными изменениями (можно сохранить пробелы между атрибутами и т. д.).
sv: Returnerar texten i den senast öppnade starttaggen. Detta bör normalt inte behövas för strukturerad bearbetning, men kan vara användbart för att hantera HTML "som den är distribuerad" eller för att återskapa indata med minimala ändringar (blanksteg mellan attribut kan bevaras etc.).

source: The following methods are called when data or markup elements are encountered and they are meant to be overridden in a subclass. The base class implementations do nothing (except for :meth:`~HTMLParser.handle_startendtag`):
ru: Следующие методы вызываются при обнаружении элементов данных или разметки и предназначены для переопределения в подклассе. Реализации базового класса ничего не делают (за исключением :meth:`~HTMLParser.handle_startendtag`):
sv: Följande metoder anropas när data- eller markeringselement påträffas och de är avsedda att åsidosättas i en underklass. Basklassens implementationer gör ingenting (förutom :meth:`~HTMLParser.handle_startendtag`):

source: This method is called to handle the start tag of an element (e.g. ``<div id="main">``).
ru: Этот метод вызывается для обработки начального тега элемента (например, ``<div id="main">``).
sv: Denna metod anropas för att hantera starttaggen för ett element (t.ex. ``<div id="main">``).

source: The *tag* argument is the name of the tag converted to lower case. The *attrs* argument is a list of ``(name, value)`` pairs containing the attributes found inside the tag's ``<>`` brackets. The *name* will be translated to lower case, and quotes in the *value* have been removed, and character and entity references have been replaced.
ru: Аргумент *tag* — это имя тега, преобразованное в нижний регистр. Аргумент *attrs* представляет собой список пар ``(имя, значение)``, содержащих атрибуты, находящиеся внутри скобок тега ``<>``. *имя* будет переведено в нижний регистр, кавычки в *значении* будут удалены, а ссылки на символы и сущности заменены.
sv: Argumentet *tag* är namnet på taggen konverterat till gemener. Argumentet *attrs* är en lista med paren ``(namn, värde)`` som innehåller de attribut som finns inom taggens ``<>``\-parenteser. *name* översätts till gemener och citattecken i *value* har tagits bort, och tecken- och entitetsreferenser har ersatts.

source: For instance, for the tag ``<A HREF="https://www.cwi.nl/">``, this method would be called as ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.
ru: Например, для тега ``<A HREF="https://www.cwi.nl/">`` этот метод будет вызываться как ``handle_starttag('a', [('href', 'https ://www.cwi.nl/')])``.
sv: För taggen ``<A HREF="https://www.cwi.nl/">`` skulle den här metoden till exempel anropas som ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.

source: All entity references from :mod:`html.entities` are replaced in the attribute values.
ru: Все ссылки на сущности из :mod:`html.entities` заменяются в значениях атрибутов.
sv: Alla entitetsreferenser från :mod:`html.entities` ersätts i attributvärdena.

source: This method is called to handle the end tag of an element (e.g. ``</div>``).
ru: Этот метод вызывается для обработки конечного тега элемента (например, ``</div>``).
sv: Denna metod anropas för att hantera sluttaggen för ett element (t.ex. ``</div>``).

source: The *tag* argument is the name of the tag converted to lower case.
ru: Аргумент *tag* — это имя тега, преобразованное в нижний регистр.
sv: Argumentet *tag* är namnet på taggen konverterat till gemener.

source: Similar to :meth:`handle_starttag`, but called when the parser encounters an XHTML-style empty tag (``<img ... />``). This method may be overridden by subclasses which require this particular lexical information; the default implementation simply calls :meth:`handle_starttag` and :meth:`handle_endtag`.
ru: Похож на :meth:`handle_starttag`, но вызывается, когда парсер обнаруживает пустой тег в стиле XHTML (``<img ... />``). Этот метод может быть переопределен подклассами, которым требуется эта конкретная лексическая информация; реализация по умолчанию просто вызывает :meth:`handle_starttag` и :meth:`handle_endtag`.
sv: Liknar :meth:`handle_starttag`, men anropas när parsern stöter på en tom tagg i XHTML-stil (``<img ... />``). Denna metod kan åsidosättas av underklasser som kräver denna speciella lexikala information; standardimplementationen anropar helt enkelt :meth:`handle_starttag` och :meth:`handle_endtag`.

source: This method is called to process arbitrary data (e.g. text nodes and the content of ``<script>...</script>`` and ``<style>...</style>``).
ru: Этот метод вызывается для обработки произвольных данных (например, текстовых узлов и содержимого ``<script>...</script>`` и ``<style>...</style>``).

source: This method is called to process a named character reference of the form ``&name;`` (e.g. ``&gt;``), where *name* is a general entity reference (e.g. ``'gt'``). This method is never called if *convert_charrefs* is ``True``.
ru: Этот метод вызывается для обработки именованной ссылки на символ в форме ``&name;`` (например, ``>``), где *name* — это общая ссылка на объект (например, ``'gt'``). Этот метод никогда не вызывается, если *convert_charrefs* имеет значение True.

source: This method is called to process decimal and hexadecimal numeric character references of the form :samp:`&#{NNN};` and :samp:`&#x{NNN};`. For example, the decimal equivalent for ``&gt;`` is ``&#62;``, whereas the hexadecimal is ``&#x3E;``; in this case the method will receive ``'62'`` or ``'x3E'``. This method is never called if *convert_charrefs* is ``True``.
ru: Этот метод вызывается для обработки десятичных и шестнадцатеричных числовых ссылок на символы вида :samp:`&#{NNN};` и :samp:`&#x{NNN};`. Например, десятичный эквивалент ``>`` — это ``&#62;``, тогда как шестнадцатеричный эквивалент ``&#x3E;``; в этом случае метод получит ``'62'`` или ``'x3E'``. Этот метод никогда не вызывается, если *convert_charrefs* имеет значение True.

source: This method is called when a comment is encountered (e.g. ``<!--comment-->``).
ru: Этот метод вызывается при обнаружении комментария (например, ``<!--comment-->``).
sv: Denna metod anropas när en kommentar påträffas (t.ex. ``<!--comment-->``).

source: For example, the comment ``<!-- comment -->`` will cause this method to be called with the argument ``' comment '``.
ru: Например, комментарий ``<!-- comment -->`` приведет к вызову этого метода с аргументом ``' comment '``.
sv: Exempelvis kommer kommentaren ``<!-- comment -->`` att leda till att denna metod anropas med argumentet ``' comment '``.

source: The content of Internet Explorer conditional comments (condcoms) will also be sent to this method, so, for ``<!--[if IE 9]>IE9-specific content<![endif]-->``, this method will receive ``'[if IE 9]>IE9-specific content<![endif]'``.
ru: Содержимое условных комментариев Internet Explorer (condcoms) также будет отправлено в этот метод, поэтому для ``<!--[if IE 9]>контента, специфичного для IE9<![endif]-->``, этот метод получит ``'[if IE 9]>контент, специфичный для IE9<![endif]'``.
sv: Innehållet i Internet Explorer villkorliga kommentarer (condcoms) kommer också att skickas till denna metod, så för ``<!--[om IE 9]>IE9-specifikt innehåll<![endif]-->`` kommer denna metod att få ``'[om IE 9]>IE9-specifikt innehåll<![endif]'``.

source: This method is called to handle an HTML doctype declaration (e.g. ``<!DOCTYPE html>``).
ru: Этот метод вызывается для обработки объявления типа документа HTML (например, ``<!DOCTYPE html>``).
sv: Denna metod anropas för att hantera en HTML-doktypdeklaration (t.ex. ``<!DOCTYPE html>``).

source: The *decl* parameter will be the entire contents of the declaration inside the ``<!...>`` markup (e.g. ``'DOCTYPE html'``).
ru: Параметр *decl* будет всем содержимым объявления внутри разметки ``<!...>`` (например, ``'DOCTYPE html'``).
sv: Parametern *decl* kommer att vara hela innehållet i deklarationen inuti ``<!...>``\-markeringen (t.ex. ``'DOCTYPE html'``).

source: Method called when a processing instruction is encountered. The *data* parameter will contain the entire processing instruction. For example, for the processing instruction ``<?proc color='red'>``, this method would be called as ``handle_pi("proc color='red'")``. It is intended to be overridden by a derived class; the base class implementation does nothing.
ru: Метод вызывается при обнаружении инструкции обработки. Параметр *data* будет содержать всю инструкцию обработки. Например, для инструкции обработки ``<?proc color='red'>`` этот метод будет вызываться как ``handle_pi("proc color='red'")``. Он предназначен для переопределения производным классом; реализация базового класса ничего не делает.
sv: Metod som anropas när en bearbetningsinstruktion påträffas. Parametern *data* kommer att innehålla hela bearbetningsinstruktionen. Till exempel, för bearbetningsinstruktionen ``<?proc color='red'>``, skulle denna metod anropas som ``handle_pi("proc color='red'")``. Den är avsedd att åsidosättas av en härledd klass; basklassens implementering gör ingenting.

source: The :class:`HTMLParser` class uses the SGML syntactic rules for processing instructions. An XHTML processing instruction using the trailing ``'?'`` will cause the ``'?'`` to be included in *data*.
ru: Класс :class:`HTMLParser` использует синтаксические правила SGML для обработки инструкций. Инструкция обработки XHTML, использующая завершающий ``'?'``, приведет к включению ``'?'`` в *data*.
sv: Klassen :class:`HTMLParser` använder SGML:s syntaktiska regler för bearbetningsinstruktioner. En XHTML-bearbetningsinstruktion som använder den efterföljande ``'?'`` kommer att leda till att ``'?'`` inkluderas i *data*.

source: This method is called when an unrecognized declaration is read by the parser.
ru: Этот метод вызывается, когда синтаксический анализатор читает нераспознанное объявление.
sv: Denna metod anropas när en oigenkänd deklaration läses av parsern.

source: The *data* parameter will be the entire contents of the declaration inside the ``<![...]>`` markup. It is sometimes useful to be overridden by a derived class. The base class implementation does nothing.
ru: Параметр *data* будет всем содержимым объявления внутри разметки ``<![...]>``. Иногда бывает полезно переопределить производный класс. Реализация базового класса ничего не делает.
sv: Parametern *data* kommer att vara hela innehållet i deklarationen inuti ``<![...]>``\-markeringen. Det är ibland användbart att åsidosättas av en härledd klass. Basklassens implementation gör ingenting.

source: Examples
ru: Примеры
sv: Exempel

source: The following class implements a parser that will be used to illustrate more examples::
ru: Следующий класс реализует синтаксический анализатор, который будет использоваться для иллюстрации дополнительных примеров:

source: Parsing a doctype::
ru: Анализ типа документа::

source: Parsing an element with a few attributes and a title::
ru: Разбор элемента с несколькими атрибутами и заголовком::

source: The content of ``script`` and ``style`` elements is returned as is, without further parsing::
ru: Содержимое элементов ``script`` и ``style`` возвращается как есть, без дальнейшего анализа:

source: Parsing comments::
ru: Разбор комментариев::

source: Parsing named and numeric character references and converting them to the correct char (note: these 3 references are all equivalent to ``'>'``)::
ru: Анализ именованных и числовых ссылок на символы и преобразование их в правильный символ (примечание: все эти 3 ссылки эквивалентны ``'>'``)::

source: Feeding incomplete chunks to :meth:`~HTMLParser.feed` works, but :meth:`~HTMLParser.handle_data` might be called more than once (unless *convert_charrefs* is set to ``True``)::
ru: Передача неполных фрагментов в :meth:`~HTMLParser.feed` работает, но :meth:`~HTMLParser.handle_data` может вызываться более одного раза (если для параметра *convert_charrefs* установлено значение ``True``)::

source: Parsing invalid HTML (e.g. unquoted attributes) also works::
ru: Анализ недопустимого HTML (например, атрибутов без кавычек) также работает::

source: As a basic example, below is a simple HTML parser that uses the :class:`HTMLParser` class to print out start tags, end tags, and data as they are encountered:
sv: Som ett grundläggande exempel visas nedan en enkel HTML-parser som använder klassen :class:`HTMLParser` för att skriva ut starttaggar, sluttaggar och data när de påträffas:

source: The following class implements a parser that will be used to illustrate more examples:
sv: Följande klass implementerar en parser som kommer att användas för att illustrera fler exempel:

source: Parsing a doctype:
sv: Parsning av en doctype:

source: Parsing an element with a few attributes and a title:
sv: Parsning av ett element med några attribut och en titel:

source: Parsing comments:
sv: Analyserar kommentarer:

source: Parsing named and numeric character references and converting them to the correct char (note: these 3 references are all equivalent to ``'>'``):
sv: Parsning av namngivna och numeriska teckenreferenser och konvertering av dem till rätt tecken (notera: dessa 3 referenser är alla likvärdiga med ``'>'``):

source: Parsing invalid HTML (e.g. unquoted attributes) also works:
sv: Parsning av ogiltig HTML (t.ex. attribut som inte citeras) fungerar också:
