Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/http.cookies.po
Languages: ru

source: **Source code:** :source:`Lib/http/cookies.py`
ru: **Исходный код:** :source:`Lib/http/cookies.py`

source: The :mod:`http.cookies` module defines classes for abstracting the concept of cookies, an HTTP state management mechanism. It supports both simple string-only cookies, and provides an abstraction for having any serializable data-type as cookie value.
ru: Модуль :mod:`http.cookies` определяет классы для абстрагирования концепции файлов cookie, механизма управления состоянием HTTP. Он поддерживает как простые файлы cookie только для строк, так и предоставляет абстракцию для использования любого сериализуемого типа данных в качестве значения файла cookie.

source: The module formerly strictly applied the parsing rules described in the :rfc:`2109` and :rfc:`2068` specifications. It has since been discovered that MSIE 3.0x didn't follow the character rules outlined in those specs; many current-day browsers and servers have also relaxed parsing rules when it comes to cookie handling. As a result, this module now uses parsing rules that are a bit less strict than they once were.
ru: Раньше модуль строго применял правила синтаксического анализа, описанные в спецификациях :rfc:`2109` и :rfc:`2068`. С тех пор было обнаружено, что MSIE 3.0x не соответствует правилам символов, изложенным в этих спецификациях; многие современные браузеры и серверы также смягчили правила синтаксического анализа, когда дело доходит до обработки файлов cookie. В результате этот модуль теперь использует несколько менее строгие правила синтаксического анализа, чем раньше.

source: The character set, :data:`string.ascii_letters`, :data:`string.digits` and ``!#$%&'*+-.^_`|~:`` denote the set of valid characters allowed by this module in a cookie name (as :attr:`~Morsel.key`).
ru: Набор символов :data:`string.ascii_letters`, :data:`string.digits` и ``!# $ %&'*+-.^_`|~:`` обозначают набор допустимых символов, разрешенных этот модуль в имени файла cookie (например, :attr:`~Morsel.key`).

source: Allowed ':' as a valid cookie name character.
ru: Разрешен символ «:» в качестве допустимого символа имени файла cookie.

source: On encountering an invalid cookie, :exc:`CookieError` is raised, so if your cookie data comes from a browser you should always prepare for invalid data and catch :exc:`CookieError` on parsing.
ru: При обнаружении недействительного файла cookie возникает :exc:`CookieError`, поэтому, если данные вашего файла cookie поступают из браузера, вам всегда следует быть готовым к недействительным данным и перехватывать :exc:`CookieError` при анализе.

source: Exception failing because of :rfc:`2109` invalidity: incorrect attributes, incorrect :mailheader:`Set-Cookie` header, etc.
ru: Исключение не удалось из-за недопустимости :rfc:`2109`: неверных атрибутов, неправильного заголовка :mailheader:`Set-Cookie` и т. д.

source: This class is a dictionary-like object whose keys are strings and whose values are :class:`Morsel` instances. Note that upon setting a key to a value, the value is first converted to a :class:`Morsel` containing the key and the value.
ru: Этот класс представляет собой объект, подобный словарю, ключами которого являются строки, а значениями — экземпляры :class:`Morsel`. Обратите внимание, что после присвоения ключу значения значение сначала преобразуется в :class:`Morsel`, содержащий ключ и значение.

source: If *input* is given, it is passed to the :meth:`load` method.
ru: Если задан *input*, он передается методу :meth:`load`.

source: This class derives from :class:`BaseCookie` and overrides :meth:`~BaseCookie.value_decode` and :meth:`~BaseCookie.value_encode`. :class:`!SimpleCookie` supports strings as cookie values. When setting the value, :class:`!SimpleCookie` calls the builtin :func:`str` to convert the value to a string. Values received from HTTP are kept as strings.
ru: Этот класс является производным от :class:`BaseCookie` и переопределяет :meth:`~BaseCookie.value_decode` и :meth:`~BaseCookie.value_encode`. :class:`!SimpleCookie` поддерживает строки в качестве значений cookie. При установке значения :class:`!SimpleCookie` вызывает встроенную функцию :func:`str` для преобразования значения в строку. Значения, полученные по HTTP, сохраняются в виде строк.

source: Module :mod:`http.cookiejar`
ru: Модуль :mod:`http.cookiejar`

source: HTTP cookie handling for web *clients*. The :mod:`http.cookiejar` and :mod:`http.cookies` modules do not depend on each other.
ru: Обработка файлов cookie HTTP для веб-клиентов. Модули :mod:`http.cookiejar` и :mod:`http.cookies` не зависят друг от друга.

source: :rfc:`2109` - HTTP State Management Mechanism
ru: :rfc:`2109` - Механизм управления состоянием HTTP

source: This is the state management specification implemented by this module.
ru: Это спецификация управления состоянием, реализованная данным модулем.

source: Cookie Objects
ru: Объекты cookie-файлов

source: Return a tuple ``(real_value, coded_value)`` from a string representation. ``real_value`` can be any type. This method does no decoding in :class:`BaseCookie` --- it exists so it can be overridden.
ru: Возврат кортежа ``(real_value, coded_value)`` из строкового представления. ``real_value`` может быть любого типа. Этот метод не выполняет декодирование в :class:`BaseCookie` --- он существует и его можно переопределить.

source: Return a tuple ``(real_value, coded_value)``. *val* can be any type, but ``coded_value`` will always be converted to a string. This method does no encoding in :class:`BaseCookie` --- it exists so it can be overridden.
ru: Вернуть кортеж ``(real_value, coded_value)``. *val* может быть любого типа, но ``coded_value`` всегда будет преобразовано в строку. Этот метод не выполняет кодировку в :class:`BaseCookie` --- он существует, поэтому его можно переопределить.

source: In general, it should be the case that :meth:`value_encode` and :meth:`value_decode` are inverses on the range of *value_decode*.
ru: В общем, должно быть так, что :meth:`value_encode` и :meth:`value_decode` являются инверсиями в диапазоне *value_decode*.

source: Return a string representation suitable to be sent as HTTP headers. *attrs* and *header* are sent to each :class:`Morsel`'s :meth:`output` method. *sep* is used to join the headers together, and is by default the combination ``'\r\n'`` (CRLF).
ru: Возвращает строковое представление, подходящее для отправки в виде заголовков HTTP. *attrs* и *header* отправляются в каждый метод :meth:`output` :class:`Morsel`. *sep* используется для объединения заголовков и по умолчанию представляет собой комбинацию ``'\r\n'`` (CRLF).

source: Return an embeddable JavaScript snippet, which, if run on a browser which supports JavaScript, will act the same as if the HTTP headers was sent.
ru: Возвращает встраиваемый фрагмент JavaScript, который при запуске в браузере, поддерживающем JavaScript, будет действовать так же, как если бы были отправлены заголовки HTTP.

source: The meaning for *attrs* is the same as in :meth:`output`.
ru: Значение *attrs* такое же, как и в :meth:`output`.

source: If *rawdata* is a string, parse it as an ``HTTP_COOKIE`` and add the values found there as :class:`Morsel`\ s. If it is a dictionary, it is equivalent to::
ru: Если *rawdata* — это строка, проанализируйте ее как ``HTTP_COOKIE`` и добавьте найденные там значения как :class:`Morsel`\ s. Если это словарь, он эквивалентен::

source: Morsel Objects
ru: Мелкие объекты

source: Abstract a key/value pair, which has some :rfc:`2109` attributes.
ru: Абстрагируйте пару ключ/значение, которая имеет некоторые атрибуты :rfc:`2109`.

source: Morsels are dictionary-like objects, whose set of keys is constant --- the valid :rfc:`2109` attributes, which are:
ru: Морсели — это объекты, подобные словарю, набор ключей которых является постоянным — допустимые атрибуты :rfc:`2109`, а именно:

source: The attribute :attr:`httponly` specifies that the cookie is only transferred in HTTP requests, and is not accessible through JavaScript. This is intended to mitigate some forms of cross-site scripting.
ru: Атрибут :attr:`httponly` указывает, что файл cookie передается только в HTTP-запросах и недоступен через JavaScript. Это предназначено для смягчения некоторых форм межсайтового скриптинга.

source: The attribute :attr:`samesite` specifies that the browser is not allowed to send the cookie along with cross-site requests. This helps to mitigate CSRF attacks. Valid values for this attribute are "Strict" and "Lax".
ru: Атрибут :attr:`samesite` указывает, что браузеру не разрешено отправлять файлы cookie вместе с межсайтовыми запросами. Это помогает смягчить атаки CSRF. Допустимые значения для этого атрибута: «Строгий» и «Слабый».

source: The keys are case-insensitive and their default value is ``''``.
ru: Ключи нечувствительны к регистру, и их значение по умолчанию — ``''``.

source: :meth:`!__eq__` now takes :attr:`~Morsel.key` and :attr:`~Morsel.value` into account.
ru: :meth:`!__eq__` теперь учитывает :attr:`~Morsel.key` и :attr:`~Morsel.value`.

source: Attributes :attr:`~Morsel.key`, :attr:`~Morsel.value` and :attr:`~Morsel.coded_value` are read-only. Use :meth:`~Morsel.set` for setting them.
ru: Атрибуты :attr:`~Morsel.key`, :attr:`~Morsel.value` и :attr:`~Morsel.coded_value` доступны только для чтения. Используйте :meth:`~Morsel.set` для их установки.

source: Added support for the :attr:`samesite` attribute.
ru: Добавлена ​​поддержка атрибута :attr:`samesite`.

source: The value of the cookie.
ru: значение из cookie.

source: The encoded value of the cookie --- this is what should be sent.
ru: Закодированное значение файла cookie — это то, что следует отправить.

source: The name of the cookie.
ru: Имя cookie.

source: Set the *key*, *value* and *coded_value* attributes.
ru: Установите атрибуты *key*, *value* и *coded_value*.

source: Whether *K* is a member of the set of keys of a :class:`Morsel`.
ru: Является ли *K* членом набора ключей :class:`Morsel`.

source: Return a string representation of the Morsel, suitable to be sent as an HTTP header. By default, all the attributes are included, unless *attrs* is given, in which case it should be a list of attributes to use. *header* is by default ``"Set-Cookie:"``.
ru: Возвращает строковое представление Morsel, подходящее для отправки в виде заголовка HTTP. По умолчанию включены все атрибуты, если не указано *attrs*; в этом случае это должен быть список используемых атрибутов. *header* по умолчанию имеет значение ``"Set-Cookie:"``.

source: Return an embeddable JavaScript snippet, which, if run on a browser which supports JavaScript, will act the same as if the HTTP header was sent.
ru: Возвращает встраиваемый фрагмент JavaScript, который при запуске в браузере, поддерживающем JavaScript, будет действовать так же, как если бы был отправлен HTTP-заголовок.

source: Return a string representing the Morsel, without any surrounding HTTP or JavaScript.
ru: Возвращает строку, представляющую Morsel, без какого-либо окружения HTTP или JavaScript.

source: Update the values in the Morsel dictionary with the values in the dictionary *values*. Raise an error if any of the keys in the *values* dict is not a valid :rfc:`2109` attribute.
ru: Обновите значения в словаре Morsel значениями из словаря *values*. Вызовите ошибку, если какой-либо из ключей в словаре *values* не является допустимым атрибутом :rfc:`2109`.

source: an error is raised for invalid keys.
ru: выдается ошибка для неверных ключей.

source: Return a shallow copy of the Morsel object.
ru: Верните неглубокую копию объекта Morsel.

source: return a Morsel object instead of a dict.
ru: вернуть объект Morsel вместо dict.

source: Raise an error if key is not a valid :rfc:`2109` attribute, otherwise behave the same as :meth:`dict.setdefault`.
ru: Выдает ошибку, если ключ не является допустимым атрибутом :rfc:`2109`, в противном случае ведет себя так же, как :meth:`dict.setdefault`.

source: Example
ru: Пример

source: The following example demonstrates how to use the :mod:`http.cookies` module.
ru: В следующем примере показано, как использовать модуль :mod:`http.cookies`.
