Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/http.cookiejar.po
Languages: pt_pt

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.extract_cookies`.
pt_pt: *cookie* é uma instância de :class:`Cookie`. *request* é um objeto que implementa a interface definida pela documentação para :meth:`CookieJar.extract_cookies`.

source: Return boolean value indicating whether cookie should be returned to server.
pt_pt: Devolve um valor booleano que indica se o *cookie* deve ser devolvido ao servidor.

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.add_cookie_header`.
pt_pt: *cookie* é uma instância de :class:`Cookie`. *request* é um objeto que implementa a interface definida pela documentação para :meth:`CookieJar.add_cookie_header`.

source: Return ``False`` if cookies should not be returned, given cookie domain.
pt_pt: Devolve ``False`` se os *cookies* não devem ser devolvidos, dado o domínio do *cookie*.

source: This method is an optimization. It removes the need for checking every cookie with a particular domain (which might involve reading many files). Returning true from :meth:`domain_return_ok` and :meth:`path_return_ok` leaves all the work to :meth:`return_ok`.
pt_pt: Este método é uma otimização. Remove a necessidade de verificar cada *cookie* com um domínio específico (o que pode envolver a leitura de muitos ficheiros). Devolver verdadeiro em :meth:`domain_return_ok` e :meth:`path_return_ok` deixa todo o trabalho para :meth:`return_ok`.

source: If :meth:`domain_return_ok` returns true for the cookie domain, :meth:`path_return_ok` is called for the cookie path. Otherwise, :meth:`path_return_ok` and :meth:`return_ok` are never called for that cookie domain. If :meth:`path_return_ok` returns true, :meth:`return_ok` is called with the :class:`Cookie` object itself for a full check. Otherwise, :meth:`return_ok` is never called for that cookie path.
pt_pt: Se :meth:`domain_return_ok` devolver verdadeiro para o domínio do *cookie*, :meth:`path_return_ok` é chamado para o caminho do *cookie*. Caso contrário, :meth:`path_return_ok` e :meth:`return_ok` nunca são chamados para esse domínio de *cookie*. Se :meth:`path_return_ok` devolver verdadeiro, :meth:`return_ok` é chamado com o próprio objeto :class:`Cookie` para uma verificação completa. Caso contrário, :meth:`return_ok` nunca é chamado para esse caminho de *cookie*.

source: Note that :meth:`domain_return_ok` is called for every *cookie* domain, not just for the *request* domain. For example, the function might be called with both ``".example.com"`` and ``"www.example.com"`` if the request domain is ``"www.example.com"``. The same goes for :meth:`path_return_ok`.
pt_pt: Note que :meth:`domain_return_ok` é chamado para cada domínio de *cookie*, não apenas para o domínio do *request*. Por exemplo, a função pode ser chamada com ``".example.com"`` e ``"www.example.com"`` se o domínio do pedido for ``"www.example.com"``. O mesmo aplica-se a :meth:`path_return_ok`.

source: The *request* argument is as documented for :meth:`return_ok`.
pt_pt: O argumento *request* está documentado em :meth:`return_ok`.

source: Return ``False`` if cookies should not be returned, given cookie path.
pt_pt: Devolve ``False`` se os *cookies* não devem ser devolvidos, dado o caminho do *cookie*.

source: See the documentation for :meth:`domain_return_ok`.
pt_pt: Consulte a documentação de :meth:`domain_return_ok`.

source: In addition to implementing the methods above, implementations of the :class:`CookiePolicy` interface must also supply the following attributes, indicating which protocols should be used, and how. All of these attributes may be assigned to.
pt_pt: Além de implementar os métodos acima, as implementações da interface :class:`CookiePolicy` devem também fornecer os seguintes atributos, que indicam quais os protocolos a utilizar e como. Todos estes atributos podem ser atribuídos.

source: Implement Netscape protocol.
pt_pt: Implementa o protocolo Netscape.

source: Implement :rfc:`2965` protocol.
pt_pt: Implementa o protocolo :rfc:`2965`.

source: Don't add :mailheader:`Cookie2` header to requests (the presence of this header indicates to the server that we understand :rfc:`2965` cookies).
pt_pt: Não adiciona o cabeçalho :mailheader:`Cookie2` aos pedidos (a presença deste cabeçalho indica ao servidor que compreendemos *cookies* :rfc:`2965`).

source: The most useful way to define a :class:`CookiePolicy` class is by subclassing from :class:`DefaultCookiePolicy` and overriding some or all of the methods above. :class:`CookiePolicy` itself may be used as a 'null policy' to allow setting and receiving any and all cookies (this is unlikely to be useful).
pt_pt: A forma mais útil de definir uma classe :class:`CookiePolicy` é através da subclasse de :class:`DefaultCookiePolicy` e substituindo alguns ou todos os métodos acima. A própria classe :class:`CookiePolicy` pode ser utilizada como uma "política nula" para permitir a definição e receção de quaisquer *cookies* (o que é improvável de ser útil).

source: DefaultCookiePolicy Objects
pt_pt: Objetos DefaultCookiePolicy

source: Implements the standard rules for accepting and returning cookies.
pt_pt: Implementa as regras padrão para aceitar e devolver *cookies*.

source: Both :rfc:`2965` and Netscape cookies are covered. RFC 2965 handling is switched off by default.
pt_pt: São abrangidos *cookies* :rfc:`2965` e Netscape. A gestão de RFC 2965 está desativada por predefinição.

source: The easiest way to provide your own policy is to override this class and call its methods in your overridden implementations before adding your own additional checks::
pt_pt: A forma mais fácil de fornecer a sua própria política é substituir esta classe e chamar os seus métodos nas suas implementações substituídas antes de adicionar as suas próprias verificações adicionais:

source: In addition to the features required to implement the :class:`CookiePolicy` interface, this class allows you to block and allow domains from setting and receiving cookies. There are also some strictness switches that allow you to tighten up the rather loose Netscape protocol rules a little bit (at the cost of blocking some benign cookies).
pt_pt: Além das funcionalidades necessárias para implementar a interface :class:`CookiePolicy`, esta classe permite bloquear e permitir domínios de definir e receber *cookies*. Existem também alguns interruptores de rigor que permitem apertar um pouco as regras do protocolo Netscape (à custa de bloquear alguns *cookies* benignos).

source: A domain blocklist and allowlist is provided (both off by default). Only domains not in the blocklist and present in the allowlist (if the allowlist is active) participate in cookie setting and returning. Use the *blocked_domains* constructor argument, and :meth:`blocked_domains` and :meth:`set_blocked_domains` methods (and the corresponding argument and methods for *allowed_domains*). If you set an allowlist, you can turn it off again by setting it to :const:`None`.
pt_pt: É fornecida uma lista de bloqueio e uma lista de permissão de domínios (ambas desativadas por predefinição). Apenas os domínios que não estejam na lista de bloqueio e estejam na lista de permissão (se a lista de permissão estiver ativa) participam na definição e devolução de *cookies*. Utilize o argumento do construtor *blocked_domains* e os métodos :meth:`blocked_domains` e :meth:`set_blocked_domains` (e o argumento e métodos correspondentes para *allowed_domains*). Se definir uma lista de permissão, pode desativá-la novamente definindo-a para :const:`None`.

source: Domains in block or allow lists that do not start with a dot must equal the cookie domain to be matched. For example, ``"example.com"`` matches a blocklist entry of ``"example.com"``, but ``"www.example.com"`` does not. Domains that do start with a dot are matched by more specific domains too. For example, both ``"www.example.com"`` and ``"www.coyote.example.com"`` match ``".example.com"`` (but ``"example.com"`` itself does not). IP addresses are an exception, and must match exactly. For example, if blocked_domains contains ``"192.168.1.2"`` and ``".168.1.2"``, 192.168.1.2 is blocked, but 193.168.1.2 is not.
pt_pt: Os domínios nas listas de bloqueio ou permissão que não começam com um ponto devem ser iguais ao domínio do *cookie* para serem correspondidos. Por exemplo, ``"example.com"`` corresponde a uma entrada na lista de bloqueio de ``"example.com"``, mas ``"www.example.com"`` não. Domínios que começam com um ponto são correspondidos por domínios mais específicos. Por exemplo, tanto ``"www.example.com"`` como ``"www.coyote.example.com"`` correspondem a ``".example.com"`` (mas ``"example.com"`` em si não corresponde). Os endereços IP são uma exceção e devem corresponder exatamente. Por exemplo, se *blocked_domains* contiver ``"192.168.1.2"`` e ``".168.1.2"``, 192.168.1.2 é bloqueado, mas 193.168.1.2 não é.

source: :class:`DefaultCookiePolicy` implements the following additional methods:
pt_pt: A classe :class:`DefaultCookiePolicy` implementa os seguintes métodos adicionais:

source: Return the sequence of blocked domains (as a tuple).
pt_pt: Devolve a sequência de domínios bloqueados (como um tuplo).

source: Set the sequence of blocked domains.
pt_pt: Define a sequência de domínios bloqueados.

source: Return ``True`` if *domain* is on the blocklist for setting or receiving cookies.
pt_pt: Devolve ``True`` se *domain* estiver na lista de bloqueio para definir ou receber *cookies*.

source: Return :const:`None`, or the sequence of allowed domains (as a tuple).
pt_pt: Devolve :const:`None`, ou a sequência de domínios permitidos (como um tuplo).

source: Set the sequence of allowed domains, or :const:`None`.
pt_pt: Define a sequência de domínios permitidos, ou :const:`None`.

source: Return ``True`` if *domain* is not on the allowlist for setting or receiving cookies.
pt_pt: Devolve ``True`` se *domain* não estiver na lista de permissão para definir ou receber *cookies*.

source: :class:`DefaultCookiePolicy` instances have the following attributes, which are all initialised from the constructor arguments of the same name, and which may all be assigned to.
pt_pt: As instâncias de :class:`DefaultCookiePolicy` têm os seguintes atributos, que são todos inicializados a partir dos argumentos do construtor com o mesmo nome, e que podem todos ser atribuídos.

source: If true, request that the :class:`CookieJar` instance downgrade :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) to Netscape cookies by setting the version attribute of the :class:`Cookie` instance to 0. The default value is :const:`None`, in which case RFC 2109 cookies are downgraded if and only if :rfc:`2965` handling is turned off. Therefore, RFC 2109 cookies are downgraded by default.
pt_pt: Se verdadeiro, solicita que a instância :class:`CookieJar` rebaixe os *cookies* :rfc:`2109` (ou seja, *cookies* recebidos num cabeçalho :mailheader:`Set-Cookie` com um atributo *cookie* de versão igual a 1) para *cookies* Netscape, definindo o atributo de versão da instância :class:`Cookie` para 0. O valor predefinido é :const:`None`, caso em que os *cookies* RFC 2109 são rebaixados se e somente se a gestão de :rfc:`2965` estiver desativada. Portanto, os *cookies* RFC 2109 são rebaixados por predefinição.

source: General strictness switches:
pt_pt: Interruptores gerais de rigor:

source: Don't allow sites to set two-component domains with country-code top-level domains like ``.co.uk``, ``.gov.uk``, ``.co.nz``.etc. This is far from perfect and isn't guaranteed to work!
pt_pt: Não permite que os *sites* definam domínios de dois componentes com domínios de nível superior de código de país, como ``.co.uk``, ``.gov.uk``, ``.co.nz``, etc. Isto está longe de ser perfeito e não é garantido que funcione!

source: :rfc:`2965` protocol strictness switches:
pt_pt: Interruptores de rigor do protocolo :rfc:`2965`:

source: Follow :rfc:`2965` rules on unverifiable transactions (usually, an unverifiable transaction is one resulting from a redirect or a request for an image hosted on another site). If this is false, cookies are *never* blocked on the basis of verifiability
pt_pt: Seguir as regras :rfc:`2965` para transações não verificáveis (normalmente, uma transação não verificável é aquela que resulta de um redirecionamento ou de um pedido para uma imagem alojada noutro *site*). Se isto for falso, os *cookies* **nunca** são bloqueados com base na verificabilidade.

source: Netscape protocol strictness switches:
pt_pt: Interruptores de rigor do protocolo Netscape:

source: Apply :rfc:`2965` rules on unverifiable transactions even to Netscape cookies.
pt_pt: Aplicar as regras :rfc:`2965` para transações não verificáveis mesmo aos *cookies* Netscape.

source: Flags indicating how strict to be with domain-matching rules for Netscape cookies. See below for acceptable values.
pt_pt: Flags que indicam o rigor a aplicar nas regras de correspondência de domínio para *cookies* Netscape. Consulte abaixo os valores aceitáveis.

source: Ignore cookies in Set-Cookie: headers that have names starting with ``'$'``.
pt_pt: Ignorar *cookies* nos cabeçalhos Set-Cookie: cujos nomes comecem com ``'$'``.

source: Don't allow setting cookies whose path doesn't path-match request URI.
pt_pt: Não permitir a definição de *cookies* cujo caminho não corresponda ao URI do pedido.

source: When setting cookies, the 'host prefix' must not contain a dot (eg. ``www.foo.bar.com`` can't set a cookie for ``.bar.com``, because ``www.foo`` contains a dot).
pt_pt: Ao definir *cookies*, o 'prefixo do *host*' não pode conter um ponto (por exemplo, ``www.foo.bar.com`` não pode definir um *cookie* para ``.bar.com``, porque ``www.foo`` contém um ponto).

source: Cookies that did not explicitly specify a ``domain`` cookie-attribute can only be returned to a domain equal to the domain that set the cookie (eg. ``spam.example.com`` won't be returned cookies from ``example.com`` that had no ``domain`` cookie-attribute).
pt_pt: Os *cookies* que não especificaram explicitamente um atributo ``domain`` só podem ser devolvidos a um domínio igual ao domínio que definiu o *cookie* (por exemplo, ``spam.example.com`` não receberá *cookies* de ``example.com`` que não tinham um atributo ``domain``).

source: When setting cookies, require a full :rfc:`2965` domain-match.
pt_pt: Ao definir *cookies*, requer uma correspondência completa de domínio :rfc:`2965`.

source: The following attributes are provided for convenience, and are the most useful combinations of the above flags:
pt_pt: Os seguintes atributos são fornecidos por conveniência e são as combinações mais úteis das *flags* acima:

source: Equivalent to 0 (ie. all of the above Netscape domain strictness flags switched off).
pt_pt: Equivalente a 0 (ou seja, todas as *flags* de rigor de domínio Netscape acima estão desativadas).

source: Equivalent to ``DomainStrictNoDots|DomainStrictNonDomain``.
pt_pt: Equivalente a ``DomainStrictNoDots|DomainStrictNonDomain``.

source: Cookie Objects
pt_pt: Objetos Cookie

source: :class:`Cookie` instances have Python attributes roughly corresponding to the standard cookie-attributes specified in the various cookie standards. The correspondence is not one-to-one, because there are complicated rules for assigning default values, because the ``max-age`` and ``expires`` cookie-attributes contain equivalent information, and because :rfc:`2109` cookies may be 'downgraded' by :mod:`http.cookiejar` from version 1 to version 0 (Netscape) cookies.
pt_pt: As instâncias de :class:`Cookie` têm atributos Python que correspondem, de forma aproximada, aos atributos padrão de *cookies* especificados nos vários padrões de *cookies*. A correspondência não é um-para-um, porque existem regras complicadas para atribuir valores predefinidos, porque os atributos ``max-age`` e ``expires`` contêm informações equivalentes, e porque os *cookies* :rfc:`2109` podem ser 'rebaixados' pelo módulo :mod:`http.cookiejar` da versão 1 para a versão 0 (Netscape).

source: Assignment to these attributes should not be necessary other than in rare circumstances in a :class:`CookiePolicy` method. The class does not enforce internal consistency, so you should know what you're doing if you do that.
pt_pt: A atribuição a estes atributos não deve ser necessária, exceto em raras circunstâncias, num método :class:`CookiePolicy`. A classe não impõe consistência interna, por isso deve saber o que está a fazer se o fizer.

source: Integer or :const:`None`. Netscape cookies have :attr:`version` 0. :rfc:`2965` and :rfc:`2109` cookies have a ``version`` cookie-attribute of 1. However, note that :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
pt_pt: Inteiro ou :const:`None`. Os *cookies* Netscape têm :attr:`version` 0. Os *cookies* :rfc:`2965` e :rfc:`2109` têm um atributo ``version`` igual a 1. No entanto, note que o módulo :mod:`http.cookiejar` pode 'rebaixar' os *cookies* RFC 2109 para *cookies* Netscape, caso em que :attr:`version` é 0.

source: Cookie name (a string).
pt_pt: Nome do *cookie* (uma *string*).

source: Cookie value (a string), or :const:`None`.
pt_pt: Valor do *cookie* (uma *string*), ou :const:`None`.

source: String representing a port or a set of ports (eg. '80', or '80,8080'), or :const:`None`.
pt_pt: *String* que representa uma porta ou um conjunto de portas (por exemplo, '80' ou '80,8080'), ou :const:`None`.

source: Cookie domain (a string).
pt_pt: Domínio do *cookie* (uma *string*).

source: Cookie path (a string, eg. ``'/acme/rocket_launchers'``).
pt_pt: Caminho do *cookie* (uma *string*, por exemplo, ``'/acme/rocket_launchers'``).

source: ``True`` if cookie should only be returned over a secure connection.
pt_pt: ``True`` se o *cookie* só deve ser devolvido através de uma ligação segura.

source: Integer expiry date in seconds since epoch, or :const:`None`. See also the :meth:`is_expired` method.
pt_pt: Data de expiração (em segundos desde a época) ou :const:`None`. Consulte também o método :meth:`is_expired`.

source: ``True`` if this is a session cookie.
pt_pt: ``True`` se este for um *cookie* de sessão.

source: String comment from the server explaining the function of this cookie, or :const:`None`.
pt_pt: Comentário do servidor (uma *string*) que explica a função deste *cookie*, ou :const:`None`.

source: URL linking to a comment from the server explaining the function of this cookie, or :const:`None`.
pt_pt: URL que liga a um comentário do servidor que explica a função deste *cookie*, ou :const:`None`.

source: ``True`` if this cookie was received as an :rfc:`2109` cookie (ie. the cookie arrived in a :mailheader:`Set-Cookie` header, and the value of the Version cookie-attribute in that header was 1). This attribute is provided because :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
pt_pt: ``True`` se este *cookie* foi recebido como um *cookie* :rfc:`2109` (ou seja, o *cookie* chegou num cabeçalho :mailheader:`Set-Cookie`, e o valor do atributo *cookie* Version nesse cabeçalho era 1). Este atributo é fornecido porque o módulo :mod:`http.cookiejar` pode 'rebaixar' *cookies* RFC 2109 para *cookies* Netscape, caso em que :attr:`version` é 0.

source: ``True`` if a port or set of ports was explicitly specified by the server (in the :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2` header).
pt_pt: ``True`` se uma porta ou conjunto de portas foi explicitamente especificado pelo servidor (no cabeçalho :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2`).

source: ``True`` if a domain was explicitly specified by the server.
pt_pt: ``True`` se um domínio foi explicitamente especificado pelo servidor.

source: ``True`` if the domain explicitly specified by the server began with a dot (``'.'``).
pt_pt: ``True`` se o domínio explicitamente especificado pelo servidor começou com um ponto (``'.'``).

source: Cookies may have additional non-standard cookie-attributes. These may be accessed using the following methods:
pt_pt: Os *cookies* podem ter atributos adicionais não padrão. Estes podem ser acedidos usando os seguintes métodos:

source: Return ``True`` if cookie has the named cookie-attribute.
pt_pt: Devolve ``True`` se o *cookie* tiver o atributo nomeado.

source: If cookie has the named cookie-attribute, return its value. Otherwise, return *default*.
pt_pt: Se o *cookie* tiver o atributo nomeado, devolve o seu valor. Caso contrário, devolve *default*.

source: Set the value of the named cookie-attribute.
pt_pt: Define o valor do atributo nomeado do *cookie*.

source: The :class:`Cookie` class also defines the following method:
pt_pt: A classe :class:`Cookie` também define o seguinte método:

source: ``True`` if cookie has passed the time at which the server requested it should expire. If *now* is given (in seconds since the epoch), return whether the cookie has expired at the specified time.
pt_pt: ``True`` se o *cookie* ultrapassou o tempo em que o servidor solicitou que expirasse. Se *now* for fornecido (em segundos desde a época), devolve se o *cookie* expirou no tempo especificado.

source: Examples
pt_pt: Exemplos

source: The first example shows the most common usage of :mod:`http.cookiejar`::
pt_pt: O primeiro exemplo mostra a utilização mais comum de :mod:`http.cookiejar`:

source: This example illustrates how to open a URL using your Netscape, Mozilla, or Lynx cookies (assumes Unix/Netscape convention for location of the cookies file)::
pt_pt: Este exemplo ilustra como abrir um URL usando os seus *cookies* do Netscape, Mozilla ou Lynx (assume a convenção Unix/Netscape para a localização do ficheiro de *cookies*):

source: The next example illustrates the use of :class:`DefaultCookiePolicy`. Turn on :rfc:`2965` cookies, be more strict about domains when setting and returning Netscape cookies, and block some domains from setting cookies or having them returned::
pt_pt: O exemplo seguinte ilustra a utilização de :class:`DefaultCookiePolicy`. Ativa os *cookies* :rfc:`2965`, é mais rigoroso com os domínios ao definir e devolver *cookies* Netscape, e bloqueia alguns domínios de definir *cookies* ou de os receber de volta:
