Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/http.server.po
Languages: pt_pt

source: **Source code:** :source:`Lib/http/server.py`
pt_pt: **Código-fonte:** :source:`Lib/http/server.py`

source: This module defines classes for implementing HTTP servers.
pt_pt: Este módulo define classes para implementar servidores HTTP.

source: :mod:`http.server` is not recommended for production. It only implements :ref:`basic security checks <http.server-security>`.
pt_pt: O :mod:`http.server` não é recomendado para produção. Implementa apenas :ref:`verificações básicas de segurança <http.server-security>`.

source: One class, :class:`HTTPServer`, is a :class:`socketserver.TCPServer` subclass. It creates and listens at the HTTP socket, dispatching the requests to a handler. Code to create and run the server looks like this::
pt_pt: Uma classe, :class:`HTTPServer`, é uma subclasse de :class:`socketserver.TCPServer`. Cria e escuta no socket HTTP, despachando os pedidos para um manipulador. O código para criar e executar o servidor é assim::

source: This class builds on the :class:`~socketserver.TCPServer` class by storing the server address as instance variables named :attr:`server_name` and :attr:`server_port`. The server is accessible by the handler, typically through the handler's :attr:`server` instance variable.
pt_pt: Esta classe baseia-se na classe :class:`~socketserver.TCPServer` armazenando o endereço do servidor como variáveis de instância chamadas :attr:`server_name` e :attr:`server_port`. O servidor é acessível pelo manipulador, tipicamente através da variável de instância :attr:`server` do manipulador.

source: This class is identical to HTTPServer but uses threads to handle requests by using the :class:`~socketserver.ThreadingMixIn`. This is useful to handle web browsers pre-opening sockets, on which :class:`HTTPServer` would wait indefinitely.
pt_pt: Esta classe é idêntica a HTTPServer, mas usa threads para lidar com pedidos usando :class:`~socketserver.ThreadingMixIn`. Isto é útil para lidar com navegadores web que pré-abrem sockets, nos quais :class:`HTTPServer` esperaria indefinidamente.

source: This class is used to handle the HTTP requests that arrive at the server. By itself, it cannot respond to any actual HTTP requests; it must be subclassed to handle each request method (e.g. GET or POST). :class:`BaseHTTPRequestHandler` provides a number of class and instance variables, and methods for use by subclasses.
pt_pt: Esta classe é usada para lidar com os pedidos HTTP que chegam ao servidor. Por si só, não pode responder a quaisquer pedidos HTTP reais; deve ser subclassificada para lidar com cada método de pedido (por exemplo, GET ou POST). A :class:`BaseHTTPRequestHandler` fornece um número de variáveis de classe e instância, e métodos para uso por subclasses.

source: The handler will parse the request and the headers, then call a method specific to the request type. The method name is constructed from the request. For example, for the request method ``SPAM``, the :meth:`!do_SPAM` method will be called with no arguments. All of the relevant information is stored in instance variables of the handler. Subclasses should not need to override or extend the :meth:`!__init__` method.
pt_pt: O manipulador analisará o pedido e os cabeçalhos, e depois chamará um método específico para o tipo de pedido. O nome do método é construído a partir do pedido. Por exemplo, para o método de pedido ``SPAM``, o método :meth:`!do_SPAM` será chamado sem argumentos. Toda a informação relevante é armazenada em variáveis de instância do manipulador. As subclasses não devem precisar de substituir ou estender o método :meth:`!__init__`.

source: :class:`BaseHTTPRequestHandler` has the following instance variables:
pt_pt: A :class:`BaseHTTPRequestHandler` tem as seguintes variáveis de instância:

source: Contains a tuple of the form ``(host, port)`` referring to the client's address.
pt_pt: Contém um tuplo da forma ``(host, port)`` referente ao endereço do cliente.

source: Contains the server instance.
pt_pt: Contém a instância do servidor.

source: Boolean that should be set before :meth:`handle_one_request` returns, indicating if another request may be expected, or if the connection should be shut down.
pt_pt: Booleano que deve ser definido antes de :meth:`handle_one_request` retornar, indicando se outro pedido pode ser esperado, ou se a ligação deve ser encerrada.

source: Contains the string representation of the HTTP request line. The terminating CRLF is stripped. This attribute should be set by :meth:`handle_one_request`. If no valid request line was processed, it should be set to the empty string.
pt_pt: Contém a representação em string da linha de pedido HTTP. O CRLF de terminação é removido. Este atributo deve ser definido por :meth:`handle_one_request`. Se nenhuma linha de pedido válida foi processada, deve ser definido para a string vazia.

source: Contains the command (request type). For example, ``'GET'``.
pt_pt: Contém o comando (tipo de pedido). Por exemplo, ``'GET'``.

source: Contains the request path. If query component of the URL is present, then ``path`` includes the query. Using the terminology of :rfc:`3986`, ``path`` here includes ``hier-part`` and the ``query``.
pt_pt: Contém o caminho do pedido. Se o componente de consulta da URL estiver presente, então ``path`` inclui a consulta. Usando a terminologia de :rfc:`3986`, ``path`` aqui inclui ``hier-part`` e a ``query``.

source: Contains the version string from the request. For example, ``'HTTP/1.0'``.
pt_pt: Contém a string de versão do pedido. Por exemplo, ``'HTTP/1.0'``.

source: An :class:`io.BufferedIOBase` input stream, ready to read from the start of the optional input data.
pt_pt: Um fluxo de entrada :class:`io.BufferedIOBase`, pronto para ler a partir do início dos dados de entrada opcionais.

source: Contains the output stream for writing a response back to the client. Proper adherence to the HTTP protocol must be used when writing to this stream in order to achieve successful interoperation with HTTP clients.
pt_pt: Contém o fluxo de saída para escrever uma resposta de volta ao cliente. A adesão adequada ao protocolo HTTP deve ser usada ao escrever neste fluxo para alcançar uma interoperação bem-sucedida com clientes HTTP.

source: This is an :class:`io.BufferedIOBase` stream.
pt_pt: Este é um fluxo :class:`io.BufferedIOBase`.

source: :class:`BaseHTTPRequestHandler` has the following attributes:
pt_pt: A :class:`BaseHTTPRequestHandler` tem os seguintes atributos:

source: Specifies the server software version. You may want to override this. The format is multiple whitespace-separated strings, where each string is of the form name[/version]. For example, ``'BaseHTTP/0.2'``.
pt_pt: Especifica a versão do software do servidor. Pode querer substituir isto. O formato é várias strings separadas por espaços em branco, onde cada string é da forma nome[/versão]. Por exemplo, ``'BaseHTTP/0.2'``.

source: Contains the Python system version, in a form usable by the :attr:`version_string` method and the :attr:`server_version` class variable. For example, ``'Python/1.4'``.
pt_pt: Contém a versão do sistema Python, numa forma utilizável pelo método :attr:`version_string` e a variável de classe :attr:`server_version`. Por exemplo, ``'Python/1.4'``.

source: Specifies a format string that should be used by :meth:`send_error` method for building an error response to the client. The string is filled by default with variables from :attr:`responses` based on the status code that passed to :meth:`send_error`.
pt_pt: Especifica uma string de formato que deve ser usada pelo método :meth:`send_error` para construir uma resposta de erro para o cliente. A string é preenchida por defeito com variáveis de :attr:`responses` com base no código de estado que é passado para :meth:`send_error`.

source: Specifies the Content-Type HTTP header of error responses sent to the client. The default value is ``'text/html'``.
pt_pt: Especifica o cabeçalho HTTP Content-Type das respostas de erro enviadas ao cliente. O valor padrão é ``'text/html'``.

source: Specifies the HTTP version to which the server is conformant. It is sent in responses to let the client know the server's communication capabilities for future requests. If set to ``'HTTP/1.1'``, the server will permit HTTP persistent connections; however, your server *must* then include an accurate ``Content-Length`` header (using :meth:`send_header`) in all of its responses to clients. For backwards compatibility, the setting defaults to ``'HTTP/1.0'``.
pt_pt: Especifica a versão HTTP à qual o servidor está conforme. É enviada nas respostas para informar o cliente sobre as capacidades de comunicação do servidor para pedidos futuros. Se definido para ``'HTTP/1.1'``, o servidor permitirá ligações persistentes HTTP; no entanto, o seu servidor *deve* então incluir um cabeçalho ``Content-Length`` preciso (usando :meth:`send_header`) em todas as suas respostas aos clientes. Por compatibilidade com versões anteriores, a definição padrão é ``'HTTP/1.0'``.

source: Specifies an :class:`email.message.Message`\ -like class to parse HTTP headers. Typically, this is not overridden, and it defaults to :class:`http.client.HTTPMessage`.
pt_pt: Especifica uma classe semelhante a :class:`email.message.Message` para analisar cabeçalhos HTTP. Normalmente, isto não é substituído, e o padrão é :class:`http.client.HTTPMessage`.

source: This attribute contains a mapping of error code integers to two-element tuples containing a short and long message. For example, ``{code: (shortmessage, longmessage)}``. The *shortmessage* is usually used as the *message* key in an error response, and *longmessage* as the *explain* key. It is used by :meth:`send_response_only` and :meth:`send_error` methods.
pt_pt: Este atributo contém um mapeamento de inteiros de código de erro para tuplos de dois elementos contendo uma mensagem curta e longa. Por exemplo, ``{code: (shortmessage, longmessage)}``. A *shortmessage* é normalmente usada como a chave *message* numa resposta de erro, e a *longmessage* como a chave *explain*. É usado pelos métodos :meth:`send_response_only` e :meth:`send_error`.

source: A :class:`BaseHTTPRequestHandler` instance has the following methods:
pt_pt: Uma instância :class:`BaseHTTPRequestHandler` tem os seguintes métodos:

source: Calls :meth:`handle_one_request` once (or, if persistent connections are enabled, multiple times) to handle incoming HTTP requests. You should never need to override it; instead, implement appropriate :meth:`!do_\*` methods.
pt_pt: Chama :meth:`handle_one_request` uma vez (ou, se as ligações persistentes estiverem ativadas, várias vezes) para lidar com pedidos HTTP recebidos. Nunca deve precisar de substituí-lo; em vez disso, implemente métodos :meth:`!do_\*` apropriados.

source: This method will parse and dispatch the request to the appropriate :meth:`!do_\*` method. You should never need to override it.
pt_pt: Este método analisará e despachará o pedido para o método :meth:`!do_\*` apropriado. Nunca deve precisar de substituí-lo.

source: When an HTTP/1.1 conformant server receives an ``Expect: 100-continue`` request header it responds back with a ``100 Continue`` followed by ``200 OK`` headers. This method can be overridden to raise an error if the server does not want the client to continue. For e.g. server can choose to send ``417 Expectation Failed`` as a response header and ``return False``.
pt_pt: Quando um servidor conforme HTTP/1.1 recebe um cabeçalho de pedido ``Expect: 100-continue``, responde com um ``100 Continue`` seguido de cabeçalhos ``200 OK``. Este método pode ser substituído para levantar um erro se o servidor não quiser que o cliente continue. Por exemplo, o servidor pode optar por enviar ``417 Expectation Failed`` como um cabeçalho de resposta e ``return False``.

source: Sends and logs a complete error reply to the client. The numeric *code* specifies the HTTP error code, with *message* as an optional, short, human readable description of the error. The *explain* argument can be used to provide more detailed information about the error; it will be formatted using the :attr:`error_message_format` attribute and emitted, after a complete set of headers, as the response body. The :attr:`responses` attribute holds the default values for *message* and *explain* that will be used if no value is provided; for unknown codes the default value for both is the string ``???``. The body will be empty if the method is HEAD or the response code is one of the following: :samp:`1{xx}`, ``204 No Content``, ``205 Reset Content``, ``304 Not Modified``.
pt_pt: Envía e regista uma resposta de erro completa ao cliente. O código numérico *code* especifica o código de erro HTTP, com *message* como uma descrição curta e legível do erro. O argumento *explain* pode ser usado para fornecer informações mais detalhadas sobre o erro; será formatado usando o atributo :attr:`error_message_format` e emitido, após um conjunto completo de cabeçalhos, como o corpo da resposta. O atributo :attr:`responses` contém os valores padrão para *message* e *explain* que serão usados se nenhum valor for fornecido; para códigos desconhecidos, o valor padrão para ambos é a string ``???``. O corpo estará vazio se o método for HEAD ou se o código de resposta for um dos seguintes: :samp:`1{xx}`, ``204 No Content``, ``205 Reset Content``, ``304 Not Modified``.

source: The error response includes a Content-Length header. Added the *explain* argument.
pt_pt: A resposta de erro inclui um cabeçalho Content-Length. Adicionado o argumento *explain*.

source: Adds a response header to the headers buffer and logs the accepted request. The HTTP response line is written to the internal buffer, followed by *Server* and *Date* headers. The values for these two headers are picked up from the :meth:`version_string` and :meth:`date_time_string` methods, respectively. If the server does not intend to send any other headers using the :meth:`send_header` method, then :meth:`send_response` should be followed by an :meth:`end_headers` call.
pt_pt: Adiciona um cabeçalho de resposta ao buffer de cabeçalhos e regista o pedido aceite. A linha de resposta HTTP é escrita no buffer interno, seguida pelos cabeçalhos *Server* e *Date*. Os valores para estes dois cabeçalhos são obtidos dos métodos :meth:`version_string` e :meth:`date_time_string`, respetivamente. Se o servidor não pretender enviar quaisquer outros cabeçalhos usando o método :meth:`send_header`, então :meth:`send_response` deve ser seguido por uma chamada a :meth:`end_headers`.

source: Headers are stored to an internal buffer and :meth:`end_headers` needs to be called explicitly.
pt_pt: Os cabeçalhos são armazenados num buffer interno e :meth:`end_headers` precisa de ser chamado explicitamente.

source: Adds the HTTP header to an internal buffer which will be written to the output stream when either :meth:`end_headers` or :meth:`flush_headers` is invoked. *keyword* should specify the header keyword, with *value* specifying its value. Note that, after the send_header calls are done, :meth:`end_headers` MUST BE called in order to complete the operation.
pt_pt: Adiciona o cabeçalho HTTP a um buffer interno que será escrito no fluxo de saída quando :meth:`end_headers` ou :meth:`flush_headers` for invocado. *keyword* deve especificar a palavra-chave do cabeçalho, com *value* a especificar o seu valor. Note que, após as chamadas send_header serem feitas, :meth:`end_headers` DEVE SER chamado para completar a operação.

source: Headers are stored in an internal buffer.
pt_pt: Os cabeçalhos são armazenados num buffer interno.

source: Sends the response header only, used for the purposes when ``100 Continue`` response is sent by the server to the client. The headers not buffered and sent directly the output stream.If the *message* is not specified, the HTTP message corresponding the response *code* is sent.
pt_pt: Envía apenas o cabeçalho de resposta, usado para os fins em que a resposta ``100 Continue`` é enviada pelo servidor ao cliente. Os cabeçalhos não são armazenados em buffer e são enviados diretamente para o fluxo de saída. Se a *message* não for especificada, a mensagem HTTP correspondente ao código de resposta *code* é enviada.

source: The buffered headers are written to the output stream.
pt_pt: Os cabeçalhos em buffer são escritos no fluxo de saída.

source: Finally send the headers to the output stream and flush the internal headers buffer.
pt_pt: Finalmente, envia os cabeçalhos para o fluxo de saída e limpa o buffer interno de cabeçalhos.

source: Logs an accepted (successful) request. *code* should specify the numeric HTTP code associated with the response. If a size of the response is available, then it should be passed as the *size* parameter.
pt_pt: Regista um pedido aceite (bem-sucedido). *code* deve especificar o código numérico HTTP associado à resposta. Se um tamanho da resposta estiver disponível, então deve ser passado como o parâmetro *size*.

source: Logs an error when a request cannot be fulfilled. By default, it passes the message to :meth:`log_message`, so it takes the same arguments (*format* and additional values).
pt_pt: Regista um erro quando um pedido não pode ser cumprido. Por defeito, passa a mensagem para :meth:`log_message`, por isso aceita os mesmos argumentos (*format* e valores adicionais).

source: Logs an arbitrary message to ``sys.stderr``. This is typically overridden to create custom error logging mechanisms. The *format* argument is a standard printf-style format string, where the additional arguments to :meth:`log_message` are applied as inputs to the formatting. The client ip address and current date and time are prefixed to every message logged.
pt_pt: Regista uma mensagem arbitrária para ``sys.stderr``. Isto é tipicamente substituído para criar mecanismos de registo de erros personalizados. O argumento *format* é uma string de formato padrão no estilo printf, onde os argumentos adicionais para :meth:`log_message` são aplicados como entradas para a formatação. O endereço IP do cliente e a data e hora atuais são prefixados a cada mensagem registada.

source: Returns the server software's version string. This is a combination of the :attr:`server_version` and :attr:`sys_version` attributes.
pt_pt: Retorna a string de versão do software do servidor. Isto é uma combinação dos atributos :attr:`server_version` e :attr:`sys_version`.

source: Returns the date and time given by *timestamp* (which must be ``None`` or in the format returned by :func:`time.time`), formatted for a message header. If *timestamp* is omitted, it uses the current date and time.
pt_pt: Retorna a data e hora dadas por *timestamp* (que deve ser ``None`` ou no formato retornado por :func:`time.time`), formatadas para um cabeçalho de mensagem. Se *timestamp* for omitido, usa a data e hora atuais.

source: The result looks like ``'Sun, 06 Nov 1994 08:49:37 GMT'``.
pt_pt: O resultado parece-se com ``'Sun, 06 Nov 1994 08:49:37 GMT'``.

source: Returns the current date and time, formatted for logging.
pt_pt: Retorna a data e hora atuais, formatadas para registo.

source: Returns the client address.
pt_pt: Retorna o endereço do cliente.

source: Previously, a name lookup was performed. To avoid name resolution delays, it now always returns the IP address.
pt_pt: Anteriormente, era realizada uma pesquisa de nome. Para evitar atrasos na resolução de nomes, agora retorna sempre o endereço IP.

source: This class serves files from the directory *directory* and below, or the current directory if *directory* is not provided, directly mapping the directory structure to HTTP requests.
pt_pt: Esta classe serve ficheiros a partir do diretório *directory* e abaixo, ou do diretório atual se *directory* não for fornecido, mapeando diretamente a estrutura do diretório para pedidos HTTP.

source: Added the *directory* parameter.
pt_pt: Adicionado o parâmetro *directory*.

source: The *directory* parameter accepts a :term:`path-like object`.
pt_pt: O parâmetro *directory* aceita um :term:`objeto tipo caminho`.

source: A lot of the work, such as parsing the request, is done by the base class :class:`BaseHTTPRequestHandler`. This class implements the :func:`do_GET` and :func:`do_HEAD` functions.
pt_pt: Grande parte do trabalho, como analisar o pedido, é feito pela classe base :class:`BaseHTTPRequestHandler`. Esta classe implementa as funções :func:`do_GET` e :func:`do_HEAD`.

source: The following are defined as class-level attributes of :class:`SimpleHTTPRequestHandler`:
pt_pt: Os seguintes são definidos como atributos de nível de classe de :class:`SimpleHTTPRequestHandler`:

source: This will be ``"SimpleHTTP/" + __version__``, where ``__version__`` is defined at the module level.
pt_pt: Isto será ``"SimpleHTTP/" + __version__``, onde ``__version__`` é definido ao nível do módulo.

source: A dictionary mapping suffixes into MIME types, contains custom overrides for the default system mappings. The mapping is used case-insensitively, and so should contain only lower-cased keys.
pt_pt: Um dicionário que mapeia sufixos para tipos MIME, contém substituições personalizadas para os mapeamentos padrão do sistema. O mapeamento é usado de forma insensível a maiúsculas e minúsculas, e por isso deve conter apenas chaves em minúsculas.

source: This dictionary is no longer filled with the default system mappings, but only contains overrides.
pt_pt: Este dicionário já não é preenchido com os mapeamentos padrão do sistema, mas contém apenas substituições.

source: The :class:`SimpleHTTPRequestHandler` class defines the following methods:
pt_pt: A classe :class:`SimpleHTTPRequestHandler` define os seguintes métodos:

source: This method serves the ``'HEAD'`` request type: it sends the headers it would send for the equivalent ``GET`` request. See the :meth:`do_GET` method for a more complete explanation of the possible headers.
pt_pt: Este método serve o tipo de pedido ``'HEAD'``: envia os cabeçalhos que enviaria para o pedido ``GET`` equivalente. Consulte o método :meth:`do_GET` para uma explicação mais completa dos cabeçalhos possíveis.

source: The request is mapped to a local file by interpreting the request as a path relative to the current working directory.
pt_pt: O pedido é mapeado para um ficheiro local interpretando o pedido como um caminho relativo ao diretório de trabalho atual.

source: If the request was mapped to a directory, the directory is checked for a file named ``index.html`` or ``index.htm`` (in that order). If found, the file's contents are returned; otherwise a directory listing is generated by calling the :meth:`list_directory` method. This method uses :func:`os.listdir` to scan the directory, and returns a ``404`` error response if the :func:`~os.listdir` fails.
pt_pt: Se o pedido foi mapeado para um diretório, o diretório é verificado quanto a um ficheiro chamado ``index.html`` ou ``index.htm`` (por essa ordem). Se encontrado, o conteúdo do ficheiro é retornado; caso contrário, é gerada uma listagem de diretório chamando o método :meth:`list_directory`. Este método usa :func:`os.listdir` para analisar o diretório e retorna uma resposta de erro ``404`` se :func:`~os.listdir` falhar.

source: A ``'Content-type:'`` header with the guessed content type is output, followed by a ``'Content-Length:'`` header with the file's size and a ``'Last-Modified:'`` header with the file's modification time.
pt_pt: Um cabeçalho ``'Content-type:'`` com o tipo de conteúdo adivinhado é produzido, seguido de um cabeçalho ``'Content-Length:'`` com o tamanho do ficheiro e um cabeçalho ``'Last-Modified:'`` com a hora de modificação do ficheiro.
