Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/http.cookiejar.po
Languages: pt_pt

source: **Source code:** :source:`Lib/http/cookiejar.py`
pt_pt: **Código-fonte:** :source:`Lib/http/cookiejar.py`

source: Both the regular Netscape cookie protocol and the protocol defined by :rfc:`2965` are handled. RFC 2965 handling is switched off by default. :rfc:`2109` cookies are parsed as Netscape cookies and subsequently treated either as Netscape or RFC 2965 cookies according to the 'policy' in effect. Note that the great majority of cookies on the internet are Netscape cookies. :mod:`http.cookiejar` attempts to follow the de-facto Netscape cookie protocol (which differs substantially from that set out in the original Netscape specification), including taking note of the ``max-age`` and ``port`` cookie-attributes introduced with RFC 2965.
pt_pt: São suportados o protocolo de *cookies* Netscape e o protocolo definido pela :rfc:`2965`. A gestão de RFC 2965 está desativada por predefinição. Os *cookies* :rfc:`2109` são analisados como *cookies* Netscape e tratados posteriormente como *cookies* Netscape ou RFC 2965, conforme a política em vigência. Note que a grande maioria dos *cookies* na Internet são *cookies* Netscape. O módulo :mod:`http.cookiejar` tenta seguir o protocolo de facto de *cookies* Netscape (que difere substancialmente do especificado na documentação original da Netscape), incluindo a consideração dos atributos ``max-age`` e ``port`` introduzidos com a RFC 2965.

source: The various named parameters found in :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers (eg. ``domain`` and ``expires``) are conventionally referred to as :dfn:`attributes`. To distinguish them from Python attributes, the documentation for this module uses the term :dfn:`cookie-attribute` instead.
pt_pt: Os vários parâmetros nomeados encontrados nos cabeçalhos :mailheader:`Set-Cookie` e :mailheader:`Set-Cookie2` (por exemplo, ``domain`` e ``expires``) são convencionalmente designados por :dfn:`atributos`. Para os distinguir dos atributos Python, a documentação deste módulo utiliza o termo :dfn:`atributo-*cookie*`.

source: The module defines the following exception:
pt_pt: O módulo define a seguinte exceção:

source: Instances of :class:`FileCookieJar` raise this exception on failure to load cookies from a file. :exc:`LoadError` is a subclass of :exc:`OSError`.
pt_pt: As instâncias de :class:`FileCookieJar` levantam esta exceção em caso de falha ao carregar *cookies* de um ficheiro. :exc:`LoadError` é uma subclasse de :exc:`OSError`.

source: :exc:`LoadError` used to be a subtype of :exc:`IOError`, which is now an alias of :exc:`OSError`.
pt_pt: :exc:`LoadError` costumava ser um subtipo de :exc:`IOError`, que agora é um alias de :exc:`OSError`.

source: The following classes are provided:
pt_pt: As seguintes classes são fornecidas:

source: *policy* is an object implementing the :class:`CookiePolicy` interface.
pt_pt: *policy* é um objeto que implementa a interface :class:`CookiePolicy`.

source: The :class:`CookieJar` class stores HTTP cookies. It extracts cookies from HTTP requests, and returns them in HTTP responses. :class:`CookieJar` instances automatically expire contained cookies when necessary. Subclasses are also responsible for storing and retrieving cookies from a file or database.
pt_pt: A classe :class:`CookieJar` armazena *cookies* HTTP. Extrai *cookies* de pedidos HTTP e devolve-os em respostas HTTP. As instâncias de :class:`CookieJar` expiram automaticamente os *cookies* contidos quando necessário. As subclasses são também responsáveis por armazenar e recuperar *cookies* de um ficheiro ou base de dados.

source: *policy* is an object implementing the :class:`CookiePolicy` interface. For the other arguments, see the documentation for the corresponding attributes.
pt_pt: *policy* é um objeto que implementa a interface :class:`CookiePolicy`. Para os restantes argumentos, consulte a documentação dos atributos correspondentes.

source: A :class:`CookieJar` which can load cookies from, and perhaps save cookies to, a file on disk. Cookies are **NOT** loaded from the named file until either the :meth:`load` or :meth:`revert` method is called. Subclasses of this class are documented in section :ref:`file-cookie-jar-classes`.
pt_pt: Um :class:`CookieJar` que pode carregar *cookies* de um ficheiro e, eventualmente, guardar *cookies* num ficheiro em disco. Os *cookies* **NÃO** são carregados do ficheiro nomeado até que o método :meth:`load` ou :meth:`revert` seja chamado. As subclasses desta classe estão documentadas na secção :ref:`file-cookie-jar-classes`.

source: This should not be initialized directly – use its subclasses below instead.
pt_pt: Isto não deve ser inicializado diretamente — utilize as suas subclasses em vez disso.

source: The filename parameter supports a :term:`path-like object`.
pt_pt: O parâmetro *filename* suporta um :term:`objeto tipo caminho`.

source: This class is responsible for deciding whether each cookie should be accepted from / returned to the server.
pt_pt: Esta classe é responsável por decidir se cada *cookie* deve ser aceite do servidor/devolvido ao servidor.

source: Constructor arguments should be passed as keyword arguments only. *blocked_domains* is a sequence of domain names that we never accept cookies from, nor return cookies to. *allowed_domains* if not :const:`None`, this is a sequence of the only domains for which we accept and return cookies. *secure_protocols* is a sequence of protocols for which secure cookies can be added to. By default *https* and *wss* (secure websocket) are considered secure protocols. For all other arguments, see the documentation for :class:`CookiePolicy` and :class:`DefaultCookiePolicy` objects.
pt_pt: Os argumentos do construtor devem ser passados apenas como argumentos nomeados. *blocked_domains* é uma sequência de nomes de domínios dos quais nunca aceitamos *cookies* nem devolvemos *cookies*. *allowed_domains*, se não for :const:`None`, é uma sequência dos únicos domínios para os quais aceitamos e devolvemos *cookies*. *secure_protocols* é uma sequência de protocolos para os quais *cookies* seguros podem ser adicionados. Por predefinição, *https* e *wss* (websocket seguro) são considerados protocolos seguros. Para todos os outros argumentos, consulte a documentação dos objetos :class:`CookiePolicy` e :class:`DefaultCookiePolicy`.

source: :class:`DefaultCookiePolicy` implements the standard accept / reject rules for Netscape and :rfc:`2965` cookies. By default, :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) are treated according to the RFC 2965 rules. However, if RFC 2965 handling is turned off or :attr:`rfc2109_as_netscape` is ``True``, RFC 2109 cookies are 'downgraded' by the :class:`CookieJar` instance to Netscape cookies, by setting the :attr:`version` attribute of the :class:`Cookie` instance to 0. :class:`DefaultCookiePolicy` also provides some parameters to allow some fine-tuning of policy.
pt_pt: A classe :class:`DefaultCookiePolicy` implementa as regras padrão de aceitação / rejeição para *cookies* Netscape e :rfc:`2965`. Por predefinição, os *cookies* :rfc:`2109` (ou seja, *cookies* recebidos num cabeçalho :mailheader:`Set-Cookie` com um atributo *cookie* de versão igual a 1) são tratados de acordo com as regras da RFC 2965. No entanto, se a gestão de RFC 2965 estiver desativada ou se :attr:`rfc2109_as_netscape` for ``True``, os *cookies* RFC 2109 são "rebaixados" pela instância de :class:`CookieJar` para *cookies* Netscape, definindo o atributo :attr:`version` da instância :class:`Cookie` para 0. A classe :class:`DefaultCookiePolicy` também fornece alguns parâmetros para permitir um ajuste fino da política.

source: This class represents Netscape, :rfc:`2109` and :rfc:`2965` cookies. It is not expected that users of :mod:`http.cookiejar` construct their own :class:`Cookie` instances. Instead, if necessary, call :meth:`make_cookies` on a :class:`CookieJar` instance.
pt_pt: Esta classe representa *cookies* Netscape, :rfc:`2109` e :rfc:`2965`. Não é esperado que os utilizadores de :mod:`http.cookiejar` criem as suas próprias instâncias de :class:`Cookie`. Em vez disso, se necessário, chame :meth:`make_cookies` numa instância de :class:`CookieJar`.

source: Module :mod:`urllib.request`
pt_pt: Módulo :mod:`urllib.request`

source: URL opening with automatic cookie handling.
pt_pt: Abertura de URLs com gestão automática de *cookies*.

source: Module :mod:`http.cookies`
pt_pt: Módulo :mod:`http.cookies`

source: HTTP cookie classes, principally useful for server-side code. The :mod:`http.cookiejar` and :mod:`http.cookies` modules do not depend on each other.
pt_pt: Classes de *cookies* HTTP, principalmente úteis para código do lado do servidor. Os módulos :mod:`http.cookiejar` e :mod:`http.cookies` não dependem um do outro.

source: The specification of the original Netscape cookie protocol. Though this is still the dominant protocol, the 'Netscape cookie protocol' implemented by all the major browsers (and :mod:`http.cookiejar`) only bears a passing resemblance to the one sketched out in ``cookie_spec.html``.
pt_pt: A especificação do protocolo original de *cookies* Netscape. Embora este ainda seja o protocolo dominante, o "protocolo de *cookies* Netscape" implementado por todos os principais navegadores (e :mod:`http.cookiejar`) apenas tem uma semelhança passageira com o esboçado em ``cookie_spec.html``.

source: :rfc:`2109` - HTTP State Management Mechanism
pt_pt: :rfc:`2109` - Mecanismo de Gestão de Estado HTTP

source: Obsoleted by :rfc:`2965`. Uses :mailheader:`Set-Cookie` with version=1.
pt_pt: Obsoleto por :rfc:`2965`. Utiliza :mailheader:`Set-Cookie` com version=1.

source: :rfc:`2965` - HTTP State Management Mechanism
pt_pt: :rfc:`2965` - Mecanismo de Gestão de Estado HTTP

source: The Netscape protocol with the bugs fixed. Uses :mailheader:`Set-Cookie2` in place of :mailheader:`Set-Cookie`. Not widely used.
pt_pt: O protocolo Netscape com os erros corrigidos. Utiliza :mailheader:`Set-Cookie2` em vez de :mailheader:`Set-Cookie`. Não é amplamente utilizado.

source: Unfinished errata to :rfc:`2965`.
pt_pt: Erratas não concluídas para :rfc:`2965`.

source: :rfc:`2964` - Use of HTTP State Management
pt_pt: :rfc:`2964` - Utilização do Mecanismo de Gestão de Estado HTTP

source: CookieJar and FileCookieJar Objects
pt_pt: Objetos CookieJar e FileCookieJar

source: :class:`CookieJar` objects support the :term:`iterator` protocol for iterating over contained :class:`Cookie` objects.
pt_pt: Os objetos :class:`CookieJar` suportam o protocolo :term:`iterador` para iterar sobre os objetos :class:`Cookie` contidos.

source: :class:`CookieJar` has the following methods:
pt_pt: A classe :class:`CookieJar` tem os seguintes métodos:

source: Add correct :mailheader:`Cookie` header to *request*.
pt_pt: Adiciona o cabeçalho :mailheader:`Cookie` correto ao *request*.

source: If policy allows (ie. the :attr:`rfc2965` and :attr:`hide_cookie2` attributes of the :class:`CookieJar`'s :class:`CookiePolicy` instance are true and false respectively), the :mailheader:`Cookie2` header is also added when appropriate.
pt_pt: Se a política permitir (ou seja, os atributos :attr:`rfc2965` e :attr:`hide_cookie2` da instância :class:`CookiePolicy` do :class:`CookieJar` forem True e False, respetivamente), o cabeçalho :mailheader:`Cookie2` também é adicionado quando apropriado.

source: The *request* object (usually a :class:`urllib.request.Request` instance) must support the methods :meth:`get_full_url`, :meth:`has_header`, :meth:`get_header`, :meth:`header_items`, :meth:`add_unredirected_header` and the attributes :attr:`host`, :attr:`!type`, :attr:`unverifiable` and :attr:`origin_req_host` as documented by :mod:`urllib.request`.
pt_pt: O objeto *request* (normalmente uma instância de :class:`urllib.request.Request`) deve suportar os métodos :meth:`get_full_url`, :meth:`has_header`, :meth:`get_header`, :meth:`header_items`, :meth:`add_unredirected_header` e os atributos :attr:`host`, :attr:`!type`, :attr:`unverifiable` e :attr:`origin_req_host`, conforme documentado por :mod:`urllib.request`.

source: *request* object needs :attr:`origin_req_host` attribute. Dependency on a deprecated method :meth:`get_origin_req_host` has been removed.
pt_pt: O objeto *request* necessita do atributo :attr:`origin_req_host`. A dependência do método obsoleto :meth:`get_origin_req_host` foi removida.

source: Extract cookies from HTTP *response* and store them in the :class:`CookieJar`, where allowed by policy.
pt_pt: Extrai *cookies* da resposta HTTP *response* e armazena-os no :class:`CookieJar`, quando permitido pela política.

source: The :class:`CookieJar` will look for allowable :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers in the *response* argument, and store cookies as appropriate (subject to the :meth:`CookiePolicy.set_ok` method's approval).
pt_pt: O :class:`CookieJar` procurará cabeçalhos :mailheader:`Set-Cookie` e :mailheader:`Set-Cookie2` permitidos no argumento *response* e armazenará os *cookies* conforme apropriado (sujeito à aprovação do método :meth:`CookiePolicy.set_ok`).

source: The *response* object (usually the result of a call to :meth:`urllib.request.urlopen`, or similar) should support an :meth:`info` method, which returns an :class:`email.message.Message` instance.
pt_pt: O objeto *response* (normalmente o resultado de uma chamada a :meth:`urllib.request.urlopen`, ou similar) deve suportar um método :meth:`info`, que devolve uma instância de :class:`email.message.Message`.

source: The *request* object (usually a :class:`urllib.request.Request` instance) must support the method :meth:`get_full_url` and the attributes :attr:`host`, :attr:`unverifiable` and :attr:`origin_req_host`, as documented by :mod:`urllib.request`. The request is used to set default values for cookie-attributes as well as for checking that the cookie is allowed to be set.
pt_pt: O objeto *request* (normalmente uma instância de :class:`urllib.request.Request`) deve suportar o método :meth:`get_full_url` e os atributos :attr:`host`, :attr:`unverifiable` e :attr:`origin_req_host`, conforme documentado por :mod:`urllib.request`. O pedido é utilizado para definir valores predefinidos para os atributos de *cookie*, bem como para verificar se o *cookie* pode ser definido.

source: Set the :class:`CookiePolicy` instance to be used.
pt_pt: Define a instância :class:`CookiePolicy` a ser utilizada.

source: Return sequence of :class:`Cookie` objects extracted from *response* object.
pt_pt: Devolve uma sequência de objetos :class:`Cookie` extraídos do objeto *response*.

source: See the documentation for :meth:`extract_cookies` for the interfaces required of the *response* and *request* arguments.
pt_pt: Consulte a documentação de :meth:`extract_cookies` para as interfaces requeridas pelos argumentos *response* e *request*.

source: Set a :class:`Cookie` if policy says it's OK to do so.
pt_pt: Define um :class:`Cookie` se a política permitir.

source: Set a :class:`Cookie`, without checking with policy to see whether or not it should be set.
pt_pt: Define um :class:`Cookie`, sem verificar com a política se deve ser definido.

source: Clear some cookies.
pt_pt: Limpa alguns *cookies*.

source: If invoked without arguments, clear all cookies. If given a single argument, only cookies belonging to that *domain* will be removed. If given two arguments, cookies belonging to the specified *domain* and URL *path* are removed. If given three arguments, then the cookie with the specified *domain*, *path* and *name* is removed.
pt_pt: Se invocado sem argumentos, limpa todos os *cookies*. Se for fornecido um único argumento, apenas os *cookies* pertencentes a esse *domain* serão removidos. Se forem fornecidos dois argumentos, os *cookies* pertencentes ao *domain* e caminho URL (*path*) especificados são removidos. Se forem fornecidos três argumentos, o *cookie* com o *domain*, *path* e *name* especificados é removido.

source: Raises :exc:`KeyError` if no matching cookie exists.
pt_pt: Levanta :exc:`KeyError` se não existir nenhum *cookie* correspondente.

source: Discard all session cookies.
pt_pt: Descarta todos os *cookies* de sessão.

source: Discards all contained cookies that have a true :attr:`discard` attribute (usually because they had either no ``max-age`` or ``expires`` cookie-attribute, or an explicit ``discard`` cookie-attribute). For interactive browsers, the end of a session usually corresponds to closing the browser window.
pt_pt: Descarta todos os *cookies* contidos que tenham um atributo :attr:`discard` verdadeiro (normalmente porque não tinham um atributo ``max-age`` ou ``expires``, ou tinham um atributo ``discard`` explícito). Para navegadores interativos, o fim de uma sessão corresponde geralmente ao fecho da janela do navegador.

source: Note that the :meth:`save` method won't save session cookies anyway, unless you ask otherwise by passing a true *ignore_discard* argument.
pt_pt: Note que o método :meth:`save` não guardará *cookies* de sessão de qualquer forma, a menos que peça o contrário, passando um argumento *ignore_discard* verdadeiro.

source: :class:`FileCookieJar` implements the following additional methods:
pt_pt: A classe :class:`FileCookieJar` implementa os seguintes métodos adicionais:

source: Save cookies to a file.
pt_pt: Guarda *cookies* num ficheiro.

source: This base class raises :exc:`NotImplementedError`. Subclasses may leave this method unimplemented.
pt_pt: Esta classe base levanta :exc:`NotImplementedError`. As subclasses podem deixar este método não implementado.

source: *filename* is the name of file in which to save cookies. If *filename* is not specified, :attr:`self.filename` is used (whose default is the value passed to the constructor, if any); if :attr:`self.filename` is :const:`None`, :exc:`ValueError` is raised.
pt_pt: *filename* é o nome do ficheiro no qual guardar os *cookies*. Se *filename* não for especificado, é utilizado :attr:`self.filename` (cujo valor predefinido é o valor passado ao construtor, se houver); se :attr:`self.filename` for :const:`None`, é levantado :exc:`ValueError`.

source: *ignore_discard*: save even cookies set to be discarded. *ignore_expires*: save even cookies that have expired
pt_pt: *ignore_discard*: guarda mesmo *cookies* definidos para serem descartados. *ignore_expires*: guarda mesmo *cookies* que tenham expirado.

source: The file is overwritten if it already exists, thus wiping all the cookies it contains. Saved cookies can be restored later using the :meth:`load` or :meth:`revert` methods.
pt_pt: O ficheiro é sobrescrito se já existir, apagando assim todos os *cookies* que contém. Os *cookies* guardados podem ser restaurados mais tarde usando os métodos :meth:`load` ou :meth:`revert`.

source: Load cookies from a file.
pt_pt: Carrega *cookies* de um ficheiro.

source: Old cookies are kept unless overwritten by newly loaded ones.
pt_pt: Os *cookies* antigos são mantidos, a menos que sejam sobrescritos pelos novos carregados.

source: Arguments are as for :meth:`save`.
pt_pt: Os argumentos são os mesmos que para :meth:`save`.

source: The named file must be in the format understood by the class, or :exc:`LoadError` will be raised. Also, :exc:`OSError` may be raised, for example if the file does not exist.
pt_pt: O ficheiro nomeado deve estar no formato compreendido pela classe, ou :exc:`LoadError` será levantado. Também pode ser levantado :exc:`OSError`, por exemplo, se o ficheiro não existir.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
pt_pt: :exc:`IOError` costumava ser levantado, agora é um alias de :exc:`OSError`.

source: Clear all cookies and reload cookies from a saved file.
pt_pt: Limpa todos os *cookies* e recarrega *cookies* de um ficheiro guardado.

source: :meth:`revert` can raise the same exceptions as :meth:`load`. If there is a failure, the object's state will not be altered.
pt_pt: :meth:`revert` pode levantar as mesmas exceções que :meth:`load`. Em caso de falha, o estado do objeto não será alterado.

source: :class:`FileCookieJar` instances have the following public attributes:
pt_pt: As instâncias de :class:`FileCookieJar` têm os seguintes atributos públicos:

source: Filename of default file in which to keep cookies. This attribute may be assigned to.
pt_pt: Nome do ficheiro predefinido no qual guardar os *cookies*. Este atributo pode ser atribuído.

source: If true, load cookies lazily from disk. This attribute should not be assigned to. This is only a hint, since this only affects performance, not behaviour (unless the cookies on disk are changing). A :class:`CookieJar` object may ignore it. None of the :class:`FileCookieJar` classes included in the standard library lazily loads cookies.
pt_pt: Se verdadeiro, carrega *cookies* de forma preguiçosa a partir do disco. Este atributo não deve ser atribuído. Isto é apenas uma sugestão, uma vez que afeta apenas o desempenho, não o comportamento (a menos que os *cookies* no disco estejam a mudar). Um objeto :class:`CookieJar` pode ignorá-lo. Nenhuma das classes :class:`FileCookieJar` incluídas na biblioteca padrão carrega *cookies* de forma preguiçosa.

source: FileCookieJar subclasses and co-operation with web browsers
pt_pt: Subclasses de FileCookieJar e cooperação com navegadores *web*

source: The following :class:`CookieJar` subclasses are provided for reading and writing.
pt_pt: As seguintes subclasses de :class:`CookieJar` são fornecidas para leitura e escrita.

source: A :class:`FileCookieJar` that can load from and save cookies to disk in the Mozilla ``cookies.txt`` file format (which is also used by curl and the Lynx and Netscape browsers).
pt_pt: Um :class:`FileCookieJar` que pode carregar e guardar *cookies* em disco no formato de ficheiro ``cookies.txt`` do Mozilla (que também é utilizado pelo curl e pelos navegadores Lynx e Netscape).

source: This loses information about :rfc:`2965` cookies, and also about newer or non-standard cookie-attributes such as ``port``.
pt_pt: Isto perde informação sobre *cookies* :rfc:`2965`, bem como sobre atributos de *cookies* mais recentes ou não padrão, como ``port``.

source: Back up your cookies before saving if you have cookies whose loss / corruption would be inconvenient (there are some subtleties which may lead to slight changes in the file over a load / save round-trip).
pt_pt: Faça uma cópia de segurança dos seus *cookies* antes de guardar se tiver *cookies* cuja perda/corrupção seria inconveniente (existem algumas subtilezas que podem levar a pequenas alterações no ficheiro durante um ciclo de carregamento/guarda).

source: Also note that cookies saved while Mozilla is running will get clobbered by Mozilla.
pt_pt: Note também que os *cookies* guardados enquanto o Mozilla está em execução serão sobrescritos pelo Mozilla.

source: A :class:`FileCookieJar` that can load from and save cookies to disk in format compatible with the libwww-perl library's ``Set-Cookie3`` file format. This is convenient if you want to store cookies in a human-readable file.
pt_pt: Um :class:`FileCookieJar` que pode carregar e guardar *cookies* em disco no formato de ficheiro ``Set-Cookie3`` compatível com a biblioteca libwww-perl. Isto é conveniente se pretender armazenar *cookies* num ficheiro legível por humanos.

source: CookiePolicy Objects
pt_pt: Objetos CookiePolicy

source: Objects implementing the :class:`CookiePolicy` interface have the following methods:
pt_pt: Os objetos que implementam a interface :class:`CookiePolicy` têm os seguintes métodos:

source: Return boolean value indicating whether cookie should be accepted from server.
pt_pt: Devolve um valor booleano que indica se o *cookie* deve ser aceite do servidor.
