Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/http.server.po
Languages: pt_pt

source: For example usage, see the implementation of the ``test`` function in :source:`Lib/http/server.py`.
pt_pt: Para um exemplo de uso, consulte a implementação da função ``test`` em :source:`Lib/http/server.py`.

source: Support of the ``'If-Modified-Since'`` header.
pt_pt: Suporte do cabeçalho ``'If-Modified-Since'``.

source: The :class:`SimpleHTTPRequestHandler` class can be used in the following manner in order to create a very basic webserver serving files relative to the current directory::
pt_pt: A classe :class:`SimpleHTTPRequestHandler` pode ser usada da seguinte forma para criar um servidor web muito básico que serve ficheiros relativos ao diretório atual::

source: The server listens to port 8000 by default. The default can be overridden by passing the desired port number as an argument::
pt_pt: O servidor escuta na porta 8000 por defeito. O padrão pode ser substituído passando o número de porta desejado como um argumento::

source: Support IPv6 in the ``--bind`` option.
pt_pt: Suporte IPv6 na opção ``--bind``.

source: This class is used to serve either files or output of CGI scripts from the current directory and below. Note that mapping HTTP hierarchic structure to local directory structure is exactly as in :class:`SimpleHTTPRequestHandler`.
pt_pt: Esta classe é usada para servir ficheiros ou a saída de scripts CGI a partir do diretório atual e abaixo. Note que o mapeamento da estrutura hierárquica HTTP para a estrutura de diretório local é exatamente como em :class:`SimpleHTTPRequestHandler`.

source: CGI scripts run by the :class:`CGIHTTPRequestHandler` class cannot execute redirects (HTTP code 302), because code 200 (script output follows) is sent prior to execution of the CGI script. This pre-empts the status code.
pt_pt: Os scripts CGI executados pela classe :class:`CGIHTTPRequestHandler` não podem executar redirecionamentos (código HTTP 302), porque o código 200 (a saída do script segue) é enviado antes da execução do script CGI. Isto preempta o código de estado.

source: The class will however, run the CGI script, instead of serving it as a file, if it guesses it to be a CGI script. Only directory-based CGI are used --- the other common server configuration is to treat special extensions as denoting CGI scripts.
pt_pt: A classe, no entanto, executará o script CGI, em vez de servi-lo como um ficheiro, se adivinhar que é um script CGI. Apenas CGI baseados em diretório são usados --- a outra configuração comum do servidor é tratar extensões especiais como denotando scripts CGI.

source: The :func:`do_GET` and :func:`do_HEAD` functions are modified to run CGI scripts and serve the output, instead of serving files, if the request leads to somewhere below the ``cgi_directories`` path.
pt_pt: As funções :func:`do_GET` e :func:`do_HEAD` são modificadas para executar scripts CGI e servir a saída, em vez de servir ficheiros, se o pedido levar a algum lugar abaixo do caminho ``cgi_directories``.

source: The :class:`CGIHTTPRequestHandler` defines the following data member:
pt_pt: A :class:`CGIHTTPRequestHandler` define o seguinte membro de dados:

source: This defaults to ``['/cgi-bin', '/htbin']`` and describes directories to treat as containing CGI scripts.
pt_pt: Isto tem como padrão ``['/cgi-bin', '/htbin']`` e descreve diretórios a tratar como contendo scripts CGI.

source: The :class:`CGIHTTPRequestHandler` defines the following method:
pt_pt: A :class:`CGIHTTPRequestHandler` define o seguinte método:

source: This method serves the ``'POST'`` request type, only allowed for CGI scripts. Error 501, "Can only POST to CGI scripts", is output when trying to POST to a non-CGI url.
pt_pt: Este método serve o tipo de pedido ``'POST'``, permitido apenas para scripts CGI. O erro 501, "Apenas pode POST para scripts CGI", é produzido ao tentar POST para uma URL não-CGI.

source: Note that CGI scripts will be run with UID of user nobody, for security reasons. Problems with the CGI script will be translated to error 403.
pt_pt: Note que os scripts CGI serão executados com o UID do utilizador nobody, por razões de segurança. Problemas com o script CGI serão traduzidos para o erro 403.

source: :class:`CGIHTTPRequestHandler` can be enabled in the command line by passing the ``--cgi`` option::
pt_pt: A :class:`CGIHTTPRequestHandler` pode ser ativada na linha de comandos passando a opção ``--cgi``::

source: Security Considerations
pt_pt: Considerações de Segurança

source: :class:`SimpleHTTPRequestHandler` will follow symbolic links when handling requests, this makes it possible for files outside of the specified directory to be served.
pt_pt: A :class:`SimpleHTTPRequestHandler` seguirá ligações simbólicas ao lidar com pedidos, o que torna possível servir ficheiros fora do diretório especificado.

source: Earlier versions of Python did not scrub control characters from the log messages emitted to stderr from ``python -m http.server`` or the default :class:`BaseHTTPRequestHandler` ``.log_message`` implementation. This could allow remote clients connecting to your server to send nefarious control codes to your terminal.
pt_pt: Versões anteriores do Python não removiam caracteres de controlo das mensagens de registo emitidas para stderr a partir de ``python -m http.server`` ou da implementação padrão de ``.log_message`` de :class:`BaseHTTPRequestHandler`. Isto poderia permitir que clientes remotos que se ligam ao seu servidor enviassem códigos de controlo nefarios para o seu terminal.

source: Control characters are scrubbed in stderr logs.
pt_pt: Os caracteres de controlo são removidos dos registos stderr.

source: server
pt_pt: servidor

source: protocol
pt_pt: protocolo

source: security
pt_pt: segurança
