Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/imaplib.po
Languages: pt_pt, ru, sv

source: :mod:`!imaplib` --- IMAP4 protocol client
pt_pt: :mod:`!imaplib` --- Cliente do protocolo IMAP4

source: **Source code:** :source:`Lib/imaplib.py`
pt_pt: **Código-fonte:** :source:`Lib/imaplib.py`
ru: **Исходный код:** :source:`Lib/imaplib.py`
sv: **Källkod:** :source:`Lib/imaplib.py`

source: This module defines three classes, :class:`IMAP4`, :class:`IMAP4_SSL` and :class:`IMAP4_stream`, which encapsulate a connection to an IMAP4 server and implement a large subset of the IMAP4rev1 client protocol as defined in :rfc:`2060`. It is backward compatible with IMAP4 (:rfc:`1730`) servers, but note that the ``STATUS`` command is not supported in IMAP4.
pt_pt: Este módulo define três classes, :class:`IMAP4`, :class:`IMAP4_SSL` e :class:`IMAP4_stream`, que encapsulam uma ligação a um servidor IMAP4 e implementam um grande subconjunto do protocolo de cliente IMAP4rev1, conforme definido em :rfc:`2060`. É compatível com servidores IMAP4 (:rfc:`1730`), mas note que o comando ``STATUS`` não é suportado em IMAP4.
ru: Этот модуль определяет три класса: :class:`IMAP4`, :class:`IMAP4_SSL` и :class:`IMAP4_stream`, которые инкапсулируют соединение с сервером IMAP4 и реализуют большое подмножество клиентского протокола IMAP4rev1, как определено в :rfc. :`2060`. Он обратно совместим с серверами IMAP4 (:rfc:`1730`), но учтите, что команда STATUS не поддерживается в IMAP4.
sv: Denna modul definierar tre klasser, :class:`IMAP4`, :class:`IMAP4_SSL` och :class:`IMAP4_stream`, som kapslar in en anslutning till en IMAP4-server och implementerar en stor del av IMAP4rev1-klientprotokollet enligt definitionen i :rfc:`2060`. Den är bakåtkompatibel med IMAP4 (:rfc:`1730`) servrar, men observera att kommandot ``STATUS`` inte stöds i IMAP4.

source: Availability
pt_pt: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_pt: Este módulo não funciona ou não está disponível em WebAssembly. Consulte :ref:`wasm-availability` para mais informações.

source: Three classes are provided by the :mod:`imaplib` module, :class:`IMAP4` is the base class:
pt_pt: O módulo :mod:`imaplib` fornece três classes, sendo :class:`IMAP4` a classe base:
ru: Модуль :mod:`imaplib` предоставляет три класса, :class:`IMAP4` — базовый класс:
sv: Tre klasser tillhandahålls av modulen :mod:`imaplib`, varav :class:`IMAP4` är basklassen:

source: This class implements the actual IMAP4 protocol. The connection is created and protocol version (IMAP4 or IMAP4rev1) is determined when the instance is initialized. If *host* is not specified, ``''`` (the local host) is used. If *port* is omitted, the standard IMAP4 port (143) is used. The optional *timeout* parameter specifies a timeout in seconds for the connection attempt. If timeout is not given or is ``None``, the global default socket timeout is used.
pt_pt: Esta classe implementa o protocolo IMAP4. A ligação é criada e a versão do protocolo (IMAP4 ou IMAP4rev1) é determinada quando a instância é inicializada. Se *host* não for especificado, ``''`` (o host local) é usado. Se *port* for omitido, a porta padrão IMAP4 (143) é usada. O parâmetro opcional *timeout* especifica um tempo limite em segundos para a tentativa de ligação. Se o tempo limite não for fornecido ou for ``None``, o tempo limite padrão global do socket é usado.

source: The :class:`IMAP4` class supports the :keyword:`with` statement. When used like this, the IMAP4 ``LOGOUT`` command is issued automatically when the :keyword:`!with` statement exits. E.g.::
pt_pt: A classe :class:`IMAP4` suporta a instrução :keyword:`with`. Quando usada desta forma, o comando IMAP4 ``LOGOUT`` é emitido automaticamente quando a instrução :keyword:`!with` termina. Por exemplo::
ru: Класс :class:`IMAP4` поддерживает оператор :keyword:`with`. При таком использовании команда IMAP4 ``LOGOUT`` выдается автоматически при выходе из оператора :keyword:`!with`. Например::
sv: Klassen :class:`IMAP4` har stöd för :keyword:`with`\-satsen. När det används på detta sätt utfärdas IMAP4-kommandot ``LOGOUT`` automatiskt när :keyword:`!with`\-satsen avslutas. T.ex.::

source: >>> from imaplib import IMAP4 >>> with IMAP4("domain.org") as M: ... M.noop() ... ('OK', [b'Nothing Accomplished. d25if65hy903weo.87'])
pt_pt: >>> from imaplib import IMAP4 >>> with IMAP4("domínio.org") as M: ... M.noop() ... ('OK', [b'Nothing Accomplished. d25if65hy903weo.87'])

source: Support for the :keyword:`with` statement was added.
pt_pt: Foi adicionado suporte para a instrução :keyword:`with`.
ru: Добавлена ​​поддержка оператора :keyword:`with`.
sv: Stöd för :keyword:`with` statement har lagts till.

source: The optional *timeout* parameter was added.
pt_pt: Foi adicionado o parâmetro opcional *timeout*.
ru: Добавлен необязательный параметр *timeout*.
sv: Den valfria parametern *timeout* har lagts till.

source: Three exceptions are defined as attributes of the :class:`IMAP4` class:
pt_pt: Três exceções são definidas como atributos da classe :class:`IMAP4`:
ru: Три исключения определены как атрибуты класса :class:`IMAP4`:
sv: Tre undantag är definierade som attribut för klassen :class:`IMAP4`:

source: Exception raised on any errors. The reason for the exception is passed to the constructor as a string.
pt_pt: Exceção levantada em caso de erros. A razão para a exceção é passada ao construtor como uma string.
ru: Исключение возникает при любых ошибках. Причина исключения передается конструктору в виде строки.
sv: Undantag som uppstår vid eventuella fel. Anledningen till undantaget skickas till konstruktören som en sträng.

source: IMAP4 server errors cause this exception to be raised. This is a sub-class of :exc:`IMAP4.error`. Note that closing the instance and instantiating a new one will usually allow recovery from this exception.
pt_pt: Erros do servidor IMAP4 fazem com que esta exceção seja levantada. Esta é uma subclasse de :exc:`IMAP4.error`. Note que fechar a instância e instanciar uma nova geralmente permite a recuperação desta exceção.
ru: Ошибки сервера IMAP4 приводят к возникновению этого исключения. Это подкласс :exc:`IMAP4.error`. Обратите внимание, что закрытие экземпляра и создание нового экземпляра обычно позволяет восстановить это исключение.
sv: Fel i IMAP4-servern orsakar att detta undantag tas upp. Detta är en subklass av :exc:`IMAP4.error`. Observera att om du stänger instansen och instansierar en ny, kommer du vanligtvis att kunna återhämta dig från detta undantag.

source: This exception is raised when a writable mailbox has its status changed by the server. This is a sub-class of :exc:`IMAP4.error`. Some other client now has write permission, and the mailbox will need to be re-opened to re-obtain write permission.
pt_pt: Esta exceção é levantada quando uma caixa de correio gravável tem o seu estado alterado pelo servidor. Esta é uma subclasse de :exc:`IMAP4.error`. Outro cliente tem agora permissão de escrita, e a caixa de correio terá de ser reaberta para obter novamente permissão de escrita.
ru: Это исключение возникает, когда сервер изменяет статус доступного для записи почтового ящика. Это подкласс :exc:`IMAP4.error`. У какого-то другого клиента теперь есть разрешение на запись, и для повторного получения разрешения на запись почтовый ящик необходимо будет открыть повторно.
sv: Detta undantag uppstår när en skrivbar brevlåda har fått sin status ändrad av servern. Detta är en underklass till :exc:`IMAP4.error`. Någon annan klient har nu skrivbehörighet och brevlådan måste öppnas på nytt för att återfå skrivbehörighet.

source: There's also a subclass for secure connections:
pt_pt: Existe também uma subclasse para ligações seguras:
ru: Также существует подкласс для безопасных соединений:
sv: Det finns också en underklass för säkra anslutningar:

source: This is a subclass derived from :class:`IMAP4` that connects over an SSL encrypted socket (to use this class you need a socket module that was compiled with SSL support). If *host* is not specified, ``''`` (the local host) is used. If *port* is omitted, the standard IMAP4-over-SSL port (993) is used. *ssl_context* is a :class:`ssl.SSLContext` object which allows bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure. Please read :ref:`ssl-security` for best practices.
pt_pt: Esta é uma subclasse derivada de :class:`IMAP4` que se liga através de um socket encriptado com SSL (para usar esta classe, precisa de um módulo socket que foi compilado com suporte SSL). Se *host* não for especificado, ``''`` (o host local) é usado. Se *port* for omitido, a porta padrão IMAP4-over-SSL (993) é usada. *ssl_context* é um objeto :class:`ssl.SSLContext` que permite agrupar opções de configuração SSL, certificados e chaves privadas numa única estrutura (potencialmente de longa duração). Por favor, leia :ref:`ssl-security` para as melhores práticas.
ru: Это подкласс, производный от :class:`IMAP4`, который подключается через зашифрованный сокет SSL (для использования этого класса вам нужен модуль сокета, скомпилированный с поддержкой SSL). Если *host* не указан, используется ``''`` (локальный хост). Если *port* опущен, используется стандартный порт IMAP4-over-SSL (993). *ssl_context* — это объект :class:`ssl.SSLContext`, который позволяет объединять параметры конфигурации SSL, сертификаты и закрытые ключи в единую (потенциально долгоживущую) структуру. Пожалуйста, прочтите :ref:`ssl-security` для получения лучших практик.
sv: Detta är en underklass till :class:`IMAP4` som ansluter via en SSL-krypterad socket (för att använda den här klassen behöver du en socketmodul som kompilerats med SSL-stöd). Om *host* inte anges används ``''`` (den lokala värden). Om *port* utelämnas används standardporten för IMAP4-over-SSL (993). *ssl_context* är ett :class:`ssl.SSLContext`\-objekt som gör det möjligt att samla SSL-konfigurationsalternativ, certifikat och privata nycklar i en enda (potentiellt långlivad) struktur. Läs :ref:`ssl-security` för bästa praxis.

source: The optional *timeout* parameter specifies a timeout in seconds for the connection attempt. If timeout is not given or is ``None``, the global default socket timeout is used.
pt_pt: O parâmetro opcional *timeout* especifica um tempo limite em segundos para a tentativa de ligação. Se o tempo limite não for fornecido ou for ``None``, o tempo limite padrão global do socket é usado.

source: *ssl_context* parameter was added.
pt_pt: Foi adicionado o parâmetro *ssl_context*.
ru: Добавлен параметр *ssl_context*.
sv: *parametern ssl_context* har lagts till.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
pt_pt: A classe agora suporta verificação de nome de host com :attr:`ssl.SSLContext.check_hostname` e *Indicação de Nome de Servidor* (ver :const:`ssl.HAS_SNI`).
ru: Класс теперь поддерживает проверку имени хоста с помощью :attr:`ssl.SSLContext.check_hostname` и *Индикации имени сервера* (см. :const:`ssl.HAS_SNI`).
sv: Klassen stöder nu kontroll av värdnamn med :attr:`ssl.SSLContext.check_hostname` och *Server Name Indication* (se :const:`ssl.HAS_SNI`).

source: The deprecated *keyfile* and *certfile* parameters have been removed.
pt_pt: Os parâmetros obsoletos *keyfile* e *certfile* foram removidos.

source: The second subclass allows for connections created by a child process:
pt_pt: A segunda subclasse permite ligações criadas por um processo filho:
ru: Второй подкласс допускает соединения, созданные дочерним процессом:
sv: Den andra underklassen tillåter anslutningar som skapas av en underordnad process:

source: This is a subclass derived from :class:`IMAP4` that connects to the ``stdin/stdout`` file descriptors created by passing *command* to ``subprocess.Popen()``.
pt_pt: Esta é uma subclasse derivada de :class:`IMAP4` que se liga aos descritores de ficheiros ``stdin/stdout`` criados ao passar *command* para ``subprocess.Popen()``.
ru: Это подкласс, производный от :class:`IMAP4`, который подключается к файловым дескрипторам ``stdin/stdout``, созданным путем передачи *command* в ``subprocess.Popen()``.
sv: Detta är en underklass som härrör från :class:`IMAP4` som ansluter till filbeskrivarna ``stdin/stdout`` som skapas genom att skicka *command* till ``subprocess.Popen()``.

source: The following utility functions are defined:
pt_pt: As seguintes funções utilitárias estão definidas:
ru: Определены следующие служебные функции:
sv: Följande nyttofunktioner definieras:

source: Parse an IMAP4 ``INTERNALDATE`` string and return corresponding local time. The return value is a :class:`time.struct_time` tuple or ``None`` if the string has wrong format.
pt_pt: Analisar uma string ``INTERNALDATE`` IMAP4 e retornar a hora local correspondente. O valor de retorno é uma tupla :class:`time.struct_time` ou ``None`` se a string tiver um formato incorreto.
ru: Разберите строку INTERNALDATE IMAP4 и верните соответствующее местное время. Возвращаемое значение представляет собой кортеж :class:`time.struct_time` или ``None``, если строка имеет неверный формат.
sv: Analyserar en IMAP4 ``INTERNALDATE``\-sträng och returnerar motsvarande lokal tid. Returvärdet är en tupel av :class:`time.struct_time` eller ``None`` om strängen har fel format.

source: Converts an integer into a bytes representation using characters from the set [``A`` .. ``P``].
pt_pt: Converte um inteiro numa representação de bytes usando caracteres do conjunto [``A`` .. ``P``].
ru: Преобразует целое число в байтовое представление, используя символы из набора [``A`` .. ``P``].
sv: Konverterar ett heltal till en bytesrepresentation med hjälp av tecken från uppsättningen [``A`` .. ``P``].

source: Converts an IMAP4 ``FLAGS`` response to a tuple of individual flags.
pt_pt: Converte uma resposta ``FLAGS`` IMAP4 numa tupla de flags individuais.
ru: Преобразует ответ IMAP4 ``FLAGS`` в кортеж отдельных флагов.
sv: Konverterar ett IMAP4 ``FLAGS``\-svar till en tupel av individuella flaggor.

source: Convert *date_time* to an IMAP4 ``INTERNALDATE`` representation. The return value is a string in the form: ``"DD-Mmm-YYYY HH:MM:SS +HHMM"`` (including double-quotes). The *date_time* argument can be a number (int or float) representing seconds since epoch (as returned by :func:`time.time`), a 9-tuple representing local time an instance of :class:`time.struct_time` (as returned by :func:`time.localtime`), an aware instance of :class:`datetime.datetime`, or a double-quoted string. In the last case, it is assumed to already be in the correct format.
pt_pt: Converter *date_time* para uma representação ``INTERNALDATE`` IMAP4. O valor de retorno é uma string no formato: ``"DD-Mmm-YYYY HH:MM:SS +HHMM"`` (incluindo aspas duplas). O argumento *date_time* pode ser um número (int ou float) representando segundos desde a época (como retornado por :func:`time.time`), uma tupla de 9 elementos representando a hora local, uma instância de :class:`time.struct_time` (como retornado por :func:`time.localtime`), uma instância consciente de :class:`datetime.datetime`, ou uma string entre aspas duplas. Neste último caso, assume-se que já está no formato correto.
ru: Преобразуйте *date_time* в представление INTERNALDATE IMAP4. Возвращаемое значение представляет собой строку в формате: ``"ДД-Ммм-ГГГГ ЧЧ:ММ:СС +ЧЧММ"`` (включая двойные кавычки). Аргумент *date_time* может быть числом (int или float), представляющим секунды с начала эпохи (как возвращается :func:`time.time`), кортежем из 9 чисел, представляющим местное время, экземпляром :class:`time.struct_time` (как возвращается :func:`time.localtime`), известный экземпляр :class:`datetime.datetime` или строка в двойных кавычках. В последнем случае предполагается, что он уже имеет правильный формат.
sv: Konverterar *date_time* till en IMAP4 ``INTERNALDATE`` representation. Returvärdet är en sträng i formen: ``"DD-Mmm-YYYY HH:MM:SS +HHMM"`` (inklusive dubbla citattecken). Argumentet *date_time* kan vara ett tal (int eller float) som representerar sekunder sedan epok (som returneras av :func:`time.time`), en 9-tupel som representerar lokal tid, en instans av :class:`time.struct_time` (som returneras av :func:`time.localtime`), en medveten instans av :class:`datetime.datetime` eller en sträng med dubbla citattecken. I det sista fallet antas den redan vara i rätt format.

source: Note that IMAP4 message numbers change as the mailbox changes; in particular, after an ``EXPUNGE`` command performs deletions the remaining messages are renumbered. So it is highly advisable to use UIDs instead, with the UID command.
pt_pt: Note que os números das mensagens IMAP4 mudam à medida que a caixa de correio muda; em particular, após um comando ``EXPUNGE`` realizar eliminações, as mensagens restantes são renumeradas. Portanto, é altamente aconselhável usar UIDs em vez disso, com o comando UID.
ru: Обратите внимание, что номера сообщений IMAP4 изменяются при изменении почтового ящика; в частности, после того, как команда EXPUNGE выполняет удаление, оставшиеся сообщения перенумеровываются. Поэтому настоятельно рекомендуется вместо этого использовать UID с помощью команды UID.
sv: Observera att IMAP4-meddelandenumren ändras när brevlådan ändras; i synnerhet efter att ett ``EXPUNGE``\-kommando har raderat meddelanden numreras de återstående meddelandena om. Det är därför mycket lämpligt att använda UID:er i stället, med kommandot UID.

source: At the end of the module, there is a test section that contains a more extensive example of usage.
pt_pt: No final do módulo, há uma secção de teste que contém um exemplo mais extenso de utilização.
ru: В конце модуля есть тестовый раздел, содержащий более подробный пример использования.
sv: I slutet av modulen finns ett testavsnitt som innehåller ett mer omfattande exempel på användning.

source: Documents describing the protocol, sources for servers implementing it, by the University of Washington's IMAP Information Center can all be found at (**Source Code**) https://github.com/uw-imap/imap (**Not Maintained**).
pt_pt: Documentos que descrevem o protocolo, fontes para servidores que o implementam, pelo Centro de Informação IMAP da Universidade de Washington podem ser encontrados em (**Código-Fonte**) https://github.com/uw-imap/imap (**Não Mantido**).
ru: Документы, описывающие протокол, источники для реализующих его серверов Информационного центра IMAP Вашингтонского университета, можно найти по адресу (**Исходный код**) https://github.com/uw-imap/imap (**Не поддерживается). **).
sv: Dokument som beskriver protokollet, källor för servrar som implementerar det, från University of Washingtons IMAP Information Center finns alla på (**Source Code**) https://github.com/uw-imap/imap (**Not Maintained**).

source: IMAP4 Objects
pt_pt: Objetos IMAP4
ru: Объекты IMAP4
sv: IMAP4-objekt

source: All IMAP4rev1 commands are represented by methods of the same name, either uppercase or lowercase.
pt_pt: Todos os comandos IMAP4rev1 são representados por métodos com o mesmo nome, maiúsculos ou minúsculos.

source: All arguments to commands are converted to strings, except for ``AUTHENTICATE``, and the last argument to ``APPEND`` which is passed as an IMAP4 literal. If necessary (the string contains IMAP4 protocol-sensitive characters and isn't enclosed with either parentheses or double quotes) each string is quoted. However, the *password* argument to the ``LOGIN`` command is always quoted. If you want to avoid having an argument string quoted (eg: the *flags* argument to ``STORE``) then enclose the string in parentheses (eg: ``r'(\Deleted)'``).
pt_pt: Todos os argumentos para comandos são convertidos em strings, exceto para ``AUTHENTICATE`` e o último argumento para ``APPEND``, que é passado como um literal IMAP4. Se necessário (a string contém caracteres sensíveis ao protocolo IMAP4 e não está envolvida por parênteses ou aspas duplas), cada string é colocada entre aspas. No entanto, o argumento *password* para o comando ``LOGIN`` é sempre colocado entre aspas. Se quiser evitar que uma string de argumento seja colocada entre aspas (por exemplo, o argumento *flags* para ``STORE``), envolva a string em parênteses (por exemplo: ``r'(\Deleted)'``).
ru: Все аргументы команд преобразуются в строки, за исключением AUTHENTICATE и последнего аргумента APPEND, который передается как литерал IMAP4. При необходимости (строка содержит символы, чувствительные к протоколу IMAP4 и не заключена в круглые скобки или двойные кавычки) каждая строка заключается в кавычки. Однако аргумент *пароль* команды LOGIN всегда заключается в кавычки. Если вы хотите избежать заключения строки аргумента в кавычки (например, аргумент *flags* для ``STORE``), заключите строку в круглые скобки (например: ``r'(\Deleted)'``).
sv: Alla argument till kommandon konverteras till strängar, utom för ``AUTHENTICATE`` och det sista argumentet till ``APPEND`` som skickas som en IMAP4-litteral. Om det behövs (strängen innehåller IMAP4-protokollkänsliga tecken och är inte omsluten av parenteser eller dubbla citattecken) citeras varje sträng. Argumentet *password* till kommandot ``LOGIN`` är dock alltid citerat. Om du vill undvika att en argumentsträng citeras (t.ex. argumentet *flags* i kommandot ``STORE``) ska du sätta strängen inom parentes (t.ex. ``r'(\Deleted)'``).

source: The *message_set* options to commands below is a string specifying one or more messages to be acted upon. It may be a simple message number (``'1'``), a range of message numbers (``'2:4'``), or a group of non-contiguous ranges separated by commas (``'1:3,6:9'``). A range can contain an asterisk to indicate an infinite upper bound (``'3:*'``).
pt_pt: As opções *message_set* para os comandos abaixo são uma string que especifica uma ou mais mensagens a serem atuadas. Pode ser um número de mensagem simples (``'1'``), um intervalo de números de mensagem (``'2:4'``), ou um grupo de intervalos não contíguos separados por vírgulas (``'1:3,6:9'``). Um intervalo pode conter um asterisco para indicar um limite superior infinito (``'3:*'``).
ru: Опции *message_set* для приведенных ниже команд представляют собой строку, определяющую одно или несколько сообщений, над которыми необходимо действовать. Это может быть простой номер сообщения (``'1'``, диапазон номеров сообщений (``'2:4'``) или группа несмежных диапазонов, разделенных запятыми (``'1 :3,6:9'``). Диапазон может содержать звездочку, обозначающую бесконечную верхнюю границу (``'3:*'``).
sv: Alternativen *message_set* till kommandona nedan är en sträng som anger ett eller flera meddelanden som ska åtgärdas. Det kan vara ett enkelt meddelandenummer (``'1'``), ett intervall av meddelandenummer (``'2:4'``) eller en grupp av icke sammanhängande intervall separerade med kommatecken (``'1:3,6:9'``). Ett intervall kan innehålla en asterisk för att ange en oändlig övre gräns (``'3:*'``).

source: An :class:`IMAP4` instance has the following methods:
pt_pt: Uma instância :class:`IMAP4` tem os seguintes métodos:
ru: Экземпляр :class:`IMAP4` имеет следующие методы:
sv: En instans av :class:`IMAP4` har följande metoder:

source: Append *message* to named mailbox.
pt_pt: Anexar *message* à caixa de correio nomeada.
ru: Добавить *сообщение* к указанному почтовому ящику.
sv: Lägg till *meddelande* i en namngiven brevlåda.

source: Authenticate command --- requires response processing.
pt_pt: Comando de autenticação --- requer processamento de resposta.
ru: Команда аутентификации --- требует обработки ответа.
sv: Autentiseringskommando --- kräver svarsbehandling.
