Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/imaplib.po
Languages: pt_pt, ru, sv

source: Close connection established in ``open``. This method is implicitly called by :meth:`IMAP4.logout`. You may override this method.
pt_pt: Fechar a ligação estabelecida em ``open``. Este método é chamado implicitamente por :meth:`IMAP4.logout`. Pode substituir este método.
ru: Закрытое соединение установлено в режиме «открыто». Этот метод неявно вызывается :meth:`IMAP4.logout`. Вы можете переопределить этот метод.
sv: Stäng anslutningen som upprättades i ``open``. Den här metoden anropas implicit av :meth:`IMAP4.logout`. Du kan åsidosätta den här metoden.

source: Returns socket instance used to connect to server.
pt_pt: Retorna a instância de socket usada para conectar ao servidor.
ru: Возвращает экземпляр сокета, используемый для подключения к серверу.
sv: Returnerar den socket-instans som används för att ansluta till servern.

source: The ``sort`` command is a variant of ``search`` with sorting semantics for the results. Returned data contains a space separated list of matching message numbers.
pt_pt: O comando ``sort`` é uma variante de ``search`` com semântica de ordenação para os resultados. Os dados retornados contêm uma lista separada por espaços de números de mensagens correspondentes.
ru: Команда sort представляет собой вариант поиска с семантикой сортировки результатов. Возвращенные данные содержат разделенный пробелами список совпадающих номеров сообщений.
sv: Kommandot ``ort`` är en variant av ``search`` med sorteringssemantik för resultaten. Returnerade data innehåller en mellanslagsseparerad lista över matchande meddelandenummer.

source: Sort has two arguments before the *search_criterion* argument(s); a parenthesized list of *sort_criteria*, and the searching *charset*. Note that unlike ``search``, the searching *charset* argument is mandatory. There is also a ``uid sort`` command which corresponds to ``sort`` the way that ``uid search`` corresponds to ``search``. The ``sort`` command first searches the mailbox for messages that match the given searching criteria using the charset argument for the interpretation of strings in the searching criteria. It then returns the numbers of matching messages.
pt_pt: Sort tem dois argumentos antes do(s) argumento(s) *search_criterion*: uma lista entre parênteses de *sort_criteria* e o *charset* de pesquisa. Note que, ao contrário de ``search``, o argumento *charset* de pesquisa é obrigatório. Há também um comando ``uid sort`` que corresponde a ``sort`` da mesma forma que ``uid search`` corresponde a ``search``. O comando ``sort`` primeiro pesquisa a caixa de correio por mensagens que correspondam aos critérios de pesquisa dados, usando o argumento *charset* para a interpretação de strings nos critérios de pesquisa. Em seguida, retorna os números das mensagens correspondentes.
ru: Сортировка имеет два аргумента перед аргументом(ами) *search_criterion*; список *sort_criteria* в скобках* и *кодировка* поиска. Обратите внимание, что в отличие от ``search`` аргумент поиска *charset* является обязательным. Существует также команда ``uid sort``, которая соответствует ``sort`` так же, как ``uid search`` соответствует ``search``. Команда ``sort`` сначала ищет в почтовом ящике сообщения, соответствующие заданным критериям поиска, используя аргумент charset для интерпретации строк в критериях поиска. Затем он возвращает количество совпадающих сообщений.
sv: Sort har två argument före *search_criterion*-argumenten: en lista med *sort_criteria* inom parentes och den sökta *charset*. Observera att till skillnad från ``search`` är argumentet *charset* obligatoriskt. Det finns också ett ``uid sort``\-kommando som motsvarar ``ort`` på samma sätt som ``uid search`` motsvarar ``search``. Kommandot ``ort`` söker först igenom brevlådan efter meddelanden som matchar de angivna sökkriterierna med hjälp av argumentet charset för tolkning av strängar i sökkriterierna. Därefter returneras antalet matchande meddelanden.

source: This is an ``IMAP4rev1`` extension command.
pt_pt: Este é um comando de extensão ``IMAP4rev1``.
ru: Это команда расширения IMAP4rev1.
sv: Detta är ett tilläggskommando till ``IMAP4rev1``.

source: Send a ``STARTTLS`` command. The *ssl_context* argument is optional and should be a :class:`ssl.SSLContext` object. This will enable encryption on the IMAP connection. Please read :ref:`ssl-security` for best practices.
pt_pt: Enviar um comando ``STARTTLS``. O argumento *ssl_context* é opcional e deve ser um objeto :class:`ssl.SSLContext`. Isto ativará a encriptação na ligação IMAP. Por favor, leia :ref:`ssl-security` para as melhores práticas.
ru: Отправьте команду ``STARTTLS``. Аргумент *ssl_context* не является обязательным и должен быть объектом :class:`ssl.SSLContext`. Это включит шифрование соединения IMAP. Пожалуйста, прочтите :ref:`ssl-security` для получения лучших практик.
sv: Skicka ett ``STARTTLS``\-kommando. Argumentet *ssl_context* är valfritt och bör vara ett :class:`ssl.SSLContext`\-objekt. Detta aktiverar kryptering på IMAP-anslutningen. Läs :ref:`ssl-security` för bästa praxis.

source: The method now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
pt_pt: O método agora suporta verificação de nome de host com :attr:`ssl.SSLContext.check_hostname` e *Indicação de Nome de Servidor* (ver :const:`ssl.HAS_SNI`).
ru: Этот метод теперь поддерживает проверку имени хоста с помощью :attr:`ssl.SSLContext.check_hostname` и *Индикации имени сервера* (см. :const:`ssl.HAS_SNI`).
sv: Metoden stöder nu kontroll av värdnamn med :attr:`ssl.SSLContext.check_hostname` och *Server Name Indication* (se :const:`ssl.HAS_SNI`).

source: Request named status conditions for *mailbox*.
pt_pt: Solicitar condições de estado nomeadas para *mailbox*.
ru: Запросить именованные условия статуса для *mailbox*.
sv: Begär namngivna statusvillkor för *mailbox*.

source: Alters flag dispositions for messages in mailbox. *command* is specified by section 6.4.6 of :rfc:`2060` as being one of "FLAGS", "+FLAGS", or "-FLAGS", optionally with a suffix of ".SILENT".
pt_pt: Altera as disposições de flag para mensagens na caixa de correio. *command* é especificado pela secção 6.4.6 de :rfc:`2060` como sendo um de "FLAGS", "+FLAGS", ou "-FLAGS", opcionalmente com um sufixo de ".SILENT".
ru: Изменяет расположение флагов для сообщений в почтовом ящике. *команда* указана в разделе 6.4.6 документа :rfc:`2060` как одна из «FLAGS», «+FLAGS» или «-FLAGS», опционально с суффиксом «.SILENT».
sv: Ändrar flaggdispositioner för meddelanden i brevlådan. *command* anges i avsnitt 6.4.6 i :rfc:`2060` som ett av "FLAGS", "+FLAGS" eller "-FLAGS", eventuellt med suffixet ".SILENT".

source: For example, to set the delete flag on all messages::
pt_pt: Por exemplo, para definir a flag de eliminação em todas as mensagens::
ru: Например, чтобы установить флаг удаления для всех сообщений:
sv: Till exempel, för att sätta raderingsflaggan på alla meddelanden::

source: Creating flags containing ']' (for example: "[test]") violates :rfc:`3501` (the IMAP protocol). However, imaplib has historically allowed creation of such tags, and popular IMAP servers, such as Gmail, accept and produce such flags. There are non-Python programs which also create such tags. Although it is an RFC violation and IMAP clients and servers are supposed to be strict, imaplib still continues to allow such tags to be created for backward compatibility reasons, and as of Python 3.6, handles them if they are sent from the server, since this improves real-world compatibility.
pt_pt: A criação de flags contendo ']' (por exemplo: "[test]") viola :rfc:`3501` (o protocolo IMAP). No entanto, o imaplib permitiu historicamente a criação de tais etiquetas, e servidores IMAP populares, como o Gmail, aceitam e produzem tais flags. Existem programas não-Python que também criam tais etiquetas. Embora seja uma violação da RFC e os clientes e servidores IMAP devam ser rigorosos, o imaplib ainda continua a permitir que tais etiquetas sejam criadas por razões de compatibilidade retroativa, e a partir do Python 3.6, lida com elas se forem enviadas do servidor, uma vez que isto melhora a compatibilidade no mundo real.

source: Subscribe to new mailbox.
pt_pt: Subscrever uma nova caixa de correio.
ru: Подпишитесь на новый почтовый ящик.
sv: Prenumerera på ny brevlåda.

source: The ``thread`` command is a variant of ``search`` with threading semantics for the results. Returned data contains a space separated list of thread members.
pt_pt: O comando ``thread`` é uma variante de ``search`` com semântica de encadeamento para os resultados. Os dados retornados contêm uma lista separada por espaços de membros de thread.
ru: Команда ``thread`` представляет собой вариант ``поиска`` с семантикой потоков для получения результатов. Возвращенные данные содержат разделенный пробелами список участников потока.
sv: Kommandot ``thread`` är en variant av ``search`` med trådningssemantik för resultaten. Data som returneras innehåller en mellanslagsseparerad lista över trådmedlemmar.

source: Thread members consist of zero or more messages numbers, delimited by spaces, indicating successive parent and child.
pt_pt: Os membros de thread consistem em zero ou mais números de mensagens, delimitados por espaços, indicando pais e filhos sucessivos.
ru: Члены потока состоят из нуля или более номеров сообщений, разделенных пробелами, обозначающих последовательных родительских и дочерних элементов.
sv: Trådmedlemmar består av noll eller flera meddelandenummer, avgränsade av mellanslag, som anger successiv förälder och barn.

source: Thread has two arguments before the *search_criterion* argument(s); a *threading_algorithm*, and the searching *charset*. Note that unlike ``search``, the searching *charset* argument is mandatory. There is also a ``uid thread`` command which corresponds to ``thread`` the way that ``uid search`` corresponds to ``search``. The ``thread`` command first searches the mailbox for messages that match the given searching criteria using the *charset* argument for the interpretation of strings in the searching criteria. It then returns the matching messages threaded according to the specified threading algorithm.
pt_pt: Thread tem dois argumentos antes do(s) argumento(s) *search_criterion*: um *threading_algorithm* e o *charset* de pesquisa. Note que, ao contrário de ``search``, o argumento *charset* de pesquisa é obrigatório. Há também um comando ``uid thread`` que corresponde a ``thread`` da mesma forma que ``uid search`` corresponde a ``search``. O comando ``thread`` primeiro pesquisa a caixa de correio por mensagens que correspondam aos critérios de pesquisa dados, usando o argumento *charset* para a interpretação de strings nos critérios de pesquisa. Em seguida, retorna as mensagens correspondentes encadeadas de acordo com o algoritmo de encadeamento especificado.

source: Execute command args with messages identified by UID, rather than message number. Returns response appropriate to command. At least one argument must be supplied; if none are provided, the server will return an error and an exception will be raised.
pt_pt: Executar argumentos de comando com mensagens identificadas por UID, em vez de número de mensagem. Retorna a resposta apropriada ao comando. Pelo menos um argumento deve ser fornecido; se nenhum for fornecido, o servidor retornará um erro e uma exceção será levantada.
ru: Выполнять аргументы команды с сообщениями, идентифицируемыми по UID, а не по номеру сообщения. Возвращает ответ, соответствующий команде. Должен быть указан хотя бы один аргумент; если ничего не указано, сервер вернет ошибку и возникнет исключение.
sv: Utför kommandot med meddelanden som identifieras med UID i stället för meddelandenummer. Returnerar svar som är lämpligt för kommandot. Minst ett argument måste anges; om inget anges kommer servern att returnera ett fel och ett undantag kommer att tas upp.

source: Unsubscribe from old mailbox.
pt_pt: Cancelar a subscrição da caixa de correio antiga.
ru: Отписаться от старого почтового ящика.
sv: Avregistrera dig från gammal brevlåda.

source: :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox.
pt_pt: :meth:`imaplib.IMAP4.unselect` libera os recursos do servidor associados à caixa de correio selecionada e retorna o servidor ao estado autenticado. Este comando executa as mesmas ações que :meth:`imaplib.IMAP4.close`, exceto que nenhuma mensagem é permanentemente removida da caixa de correio atualmente selecionada.
ru: :meth:`imaplib.IMAP4.unselect` освобождает ресурсы сервера, связанные с выбранным почтовым ящиком, и возвращает сервер в состояние аутентификации. Эта команда выполняет те же действия, что и :meth:`imaplib.IMAP4.close`, за исключением того, что никакие сообщения не удаляются навсегда из текущего выбранного почтового ящика.
sv: :meth:`imaplib.IMAP4.unselect` frigör serverns resurser som är associerade med den valda brevlådan och återställer servern till det autentiserade tillståndet. Det här kommandot utför samma åtgärder som :meth:`imaplib.IMAP4.close`, förutom att inga meddelanden tas bort permanent från den valda brevlådan.

source: Allow simple extension commands notified by server in ``CAPABILITY`` response.
pt_pt: Permitir comandos de extensão simples notificados pelo servidor na resposta ``CAPABILITY``.
ru: Разрешить простые команды расширения, о которых сервер сообщает в ответе CAPABILITY.
sv: Tillåt enkla tilläggskommandon som meddelas av servern i ``CAPABILITY``\-svaret.

source: The following attributes are defined on instances of :class:`IMAP4`:
pt_pt: Os seguintes atributos são definidos em instâncias de :class:`IMAP4`:
ru: Следующие атрибуты определены в экземплярах :class:`IMAP4`:
sv: Följande attribut är definierade för instanser av :class:`IMAP4`:

source: The most recent supported protocol in the ``CAPABILITY`` response from the server.
pt_pt: O protocolo mais recente suportado na resposta ``CAPABILITY`` do servidor.
ru: Самый последний поддерживаемый протокол в ответе CAPABILITY от сервера.
sv: Det senaste protokoll som stöds i svaret ``CAPABILITY`` från servern.

source: Integer value to control debugging output. The initialize value is taken from the module variable ``Debug``. Values greater than three trace each command.
pt_pt: Valor inteiro para controlar a saída de depuração. O valor de inicialização é obtido da variável de módulo ``Debug``. Valores maiores que três rastreiam cada comando.
ru: Целочисленное значение для управления выводом отладки. Значение инициализации берется из переменной модуля Debug. Значения больше трех отслеживают каждую команду.
sv: Heltalsvärde för att styra felsökningsutmatningen. Initialiseringsvärdet hämtas från modulvariabeln ``Debug``. Värden större än tre spårar varje kommando.

source: Boolean value that is normally ``False``, but is set to ``True`` if an :meth:`enable` command is successfully issued for the ``UTF8=ACCEPT`` capability.
pt_pt: Valor booleano que é normalmente ``False``, mas é definido como ``True`` se um comando :meth:`enable` for emitido com sucesso para a capacidade ``UTF8=ACCEPT``.
ru: Логическое значение, обычно равное ``False``, но устанавливается в ``True``, если команда :meth:`enable` успешно выдана для возможности ``UTF8=ACCEPT``.
sv: Booleskt värde som normalt är ``False``, men som sätts till ``True`` om ett :meth:`enable`\-kommando framgångsrikt utfärdas för egenskapen ``UTF8=ACCEPT``.

source: IMAP4 Example
pt_pt: Exemplo IMAP4
ru: Пример IMAP4
sv: IMAP4-exempel

source: Here is a minimal example (without error checking) that opens a mailbox and retrieves and prints all messages::
pt_pt: Aqui está um exemplo mínimo (sem verificação de erros) que abre uma caixa de correio e recupera e imprime todas as mensagens::
ru: Вот минимальный пример (без проверки ошибок), который открывает почтовый ящик, извлекает и печатает все сообщения:
sv: Här är ett minimalt exempel (utan felkontroll) som öppnar en brevlåda och hämtar och skriver ut alla meddelanden::

source: import getpass, imaplib M = imaplib.IMAP4(host='example.org') M.login(getpass.getuser(), getpass.getpass()) M.select() typ, data = M.search(None, 'ALL') for num in data[0].split(): typ, data = M.fetch(num, '(RFC822)') print('Message %s\n%s\n' % (num, data[0][1])) M.close() M.logout()
pt_pt: import getpass, imaplib M = imaplib.IMAP4(host='exemplo.org') M.login(getpass.getuser(), getpass.getpass()) M.select() typ, data = M.search(None, 'ALL') for num in data[0].split(): typ, data = M.fetch(num, '(RFC822)') print('Mensagem %s\n%s\n' % (num, data[0][1])) M.close() M.logout()

source: protocol
pt_pt: protocolo
ru: протокол
sv: protokoll

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.

source: Each command returns a tuple: ``(type, [data, ...])`` where *type* is usually ``'OK'`` or ``'NO'``, and *data* is either the text from the command response, or mandated results from the command. Each *data* is either a ``bytes``, or a tuple. If a tuple, then the first part is the header of the response, and the second part contains the data (ie: 'literal' value).
ru: Каждая команда возвращает кортеж: ``(type, [data, ...])``, где *type* обычно равен ``'OK'`` или ``'NO'``, а *data* — это либо текст из ответа на команду или обязательные результаты команды. Каждые *данные* представляют собой либо ``байты``, либо кортеж. Если кортеж, то первая часть — это заголовок ответа, а вторая часть содержит данные (т. е. «литеральное» значение).

source: Creating flags containing ']' (for example: "[test]") violates :rfc:`3501` (the IMAP protocol). However, imaplib has historically allowed creation of such tags, and popular IMAP servers, such as Gmail, accept and produce such flags. There are non-Python programs which also create such tags. Although it is an RFC violation and IMAP clients and servers are supposed to be strict, imaplib nonetheless continues to allow such tags to be created for backward compatibility reasons, and as of Python 3.6, handles them if they are sent from the server, since this improves real-world compatibility.
ru: Создание флагов, содержащих ']' (например: "[test]"), нарушает :rfc:`3501` (протокол IMAP). Однако imaplib исторически позволял создавать такие теги, а популярные серверы IMAP, такие как Gmail, принимают и создают такие теги. Существуют программы, отличные от Python, которые также создают такие теги. Хотя это является нарушением RFC, а клиенты и серверы IMAP должны быть строгими, imaplib, тем не менее, продолжает разрешать создание таких тегов из соображений обратной совместимости и, начиная с Python 3.6, обрабатывает их, если они отправляются с сервера, поскольку это улучшает совместимость с реальным миром.
