Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/imaplib.po
Languages: pt_pt, ru, sv

source: *mechanism* specifies which authentication mechanism is to be used - it should appear in the instance variable ``capabilities`` in the form ``AUTH=mechanism``.
pt_pt: *mechanism* especifica qual mecanismo de autenticação deve ser usado --- deve aparecer na variável de instância ``capabilities`` na forma ``AUTH=mechanism``.
ru: *mechanism* указывает, какой механизм аутентификации будет использоваться — он должен появиться в переменной экземпляра ``capabilities`` в форме ``AUTH=mechanism``.
sv: *mechanism* anger vilken autentiseringsmekanism som ska användas - den ska finnas i instansvariabeln ``capabilities`` i formen ``AUTH=mechanism``.

source: *authobject* must be a callable object::
pt_pt: *authobject* deve ser um objeto chamável::
ru: *authobject* должен быть вызываемым объектом::
sv: *authobject* måste vara ett anropsbart objekt::

source: It will be called to process server continuation responses; the *response* argument it is passed will be ``bytes``. It should return ``bytes`` *data* that will be base64 encoded and sent to the server. It should return ``None`` if the client abort response ``*`` should be sent instead.
pt_pt: Será chamado para processar respostas de continuação do servidor; o argumento *response* que é passado será ``bytes``. Deve retornar ``bytes`` *data* que será codificado em base64 e enviado para o servidor. Deve retornar ``None`` se a resposta de aborto do cliente ``*`` deve ser enviada em vez disso.
ru: Он будет вызван для обработки ответов продолжения сервера; передаваемый аргумент *response* будет иметь размер ``bytes``. Он должен возвращать ``байты`` *данных*, которые будут закодированы в base64 и отправлены на сервер. Он должен вернуть None, если вместо этого должен быть отправлен ответ на прерывание клиента ``*``.
sv: Den kommer att anropas för att bearbeta serverns fortsättningssvar; argumentet *response* som den får är ``bytes``. Den bör returnera ``bytes`` *data* som kommer att base64-kodas och skickas till servern. Den ska returnera ``None`` om klientens avbrottssvar ``*`` ska skickas istället.

source: string usernames and passwords are now encoded to ``utf-8`` instead of being limited to ASCII.
pt_pt: strings de usernames e passwords são agora codificadas para ``utf-8`` em vez de serem limitadas a ASCII.
ru: Строковые имена пользователей и пароли теперь кодируются ``utf-8``, а не ограничиваются ASCII.
sv: stränganvändarnamn och lösenord kodas nu till ``utf-8`` istället för att begränsas till ASCII.

source: Checkpoint mailbox on server.
pt_pt: Fazer checkpoint da caixa de correio no servidor.
ru: Проверить почтовый ящик на сервере.
sv: Checkpoint-brevlåda på server.

source: Close currently selected mailbox. Deleted messages are removed from writable mailbox. This is the recommended command before ``LOGOUT``.
pt_pt: Fechar a caixa de correio atualmente selecionada. Mensagens eliminadas são removidas da caixa de correio gravável. Este é o comando recomendado antes de ``LOGOUT``.
ru: Закрыть выбранный почтовый ящик. Удаленные сообщения удаляются из доступного для записи почтового ящика. Это рекомендуемая команда перед ``LOGOUT``.
sv: Stäng aktuell vald brevlåda. Raderade meddelanden tas bort från den skrivbara brevlådan. Detta är det rekommenderade kommandot före ``LOGOUT``.

source: Copy *message_set* messages onto end of *new_mailbox*.
pt_pt: Copiar mensagens *message_set* para o final de *new_mailbox*.
ru: Копировать сообщения *message_set* в конец *new_mailbox*.
sv: Kopiera *message_set* meddelanden till slutet av *new_mailbox*.

source: Create new mailbox named *mailbox*.
pt_pt: Criar uma nova caixa de correio chamada *mailbox*.
ru: Создайте новый почтовый ящик с именем *mailbox*.
sv: Skapa en ny brevlåda med namnet *brevlåda*.

source: Delete old mailbox named *mailbox*.
pt_pt: Eliminar a caixa de correio antiga chamada *mailbox*.
ru: Удалить старый почтовый ящик с именем *mailbox*.
sv: Ta bort en gammal brevlåda med namnet *brevlåda*.

source: Delete the ACLs (remove any rights) set for who on mailbox.
pt_pt: Eliminar as ACLs (remover quaisquer direitos) definidas para quem na caixa de correio.
ru: Удалите списки контроля доступа (удалите все права), установленные для пользователя почтового ящика.
sv: Ta bort de ACL:er (ta bort alla rättigheter) som angetts för vem i brevlådan.

source: Enable *capability* (see :rfc:`5161`). Most capabilities do not need to be enabled. Currently only the ``UTF8=ACCEPT`` capability is supported (see :RFC:`6855`).
pt_pt: Ativar *capability* (ver :rfc:`5161`). A maioria das capacidades não precisa de ser ativada. Atualmente, apenas a capacidade ``UTF8=ACCEPT`` é suportada (ver :RFC:`6855`).
ru: Включите *возможность* (см. :rfc:`5161`). Большинство возможностей не требуют включения. В настоящее время поддерживается только возможность UTF8=ACCEPT (см. :RFC:`6855`).
sv: Aktivera *funktion* (se :rfc:`5161`). De flesta funktioner behöver inte aktiveras. För närvarande stöds endast ``UTF8=ACCEPT``\-funktionen (se :RFC:`6855`).

source: The :meth:`enable` method itself, and :RFC:`6855` support.
pt_pt: O método :meth:`enable` em si, e o suporte :RFC:`6855`.
ru: Сам метод :meth:`enable` и поддержка :RFC:`6855`.
sv: Själva metoden :meth:`enable` och stöd för :RFC:`6855`.

source: Permanently remove deleted items from selected mailbox. Generates an ``EXPUNGE`` response for each deleted message. Returned data contains a list of ``EXPUNGE`` message numbers in order received.
pt_pt: Remover permanentemente itens eliminados da caixa de correio selecionada. Gera uma resposta ``EXPUNGE`` para cada mensagem eliminada. Os dados retornados contêm uma lista de números de mensagem ``EXPUNGE`` na ordem recebida.
ru: Безвозвратно удалить удаленные элементы из выбранного почтового ящика. Генерирует ответ EXPUNGE для каждого удаленного сообщения. Возвращенные данные содержат список номеров сообщений EXPUNGE в порядке их получения.
sv: Ta bort raderade objekt permanent från vald brevlåda. Genererar ett ``EXPUNGE``\-svar för varje borttaget meddelande. Returnerade data innehåller en lista över meddelandenumren för ``EXPUNGE`` i den ordning de mottagits.

source: Fetch (parts of) messages. *message_parts* should be a string of message part names enclosed within parentheses, eg: ``"(UID BODY[TEXT])"``. Returned data are tuples of message part envelope and data.
pt_pt: Buscar (partes de) mensagens. *message_parts* deve ser uma string de nomes de partes de mensagem dentro de parênteses, por exemplo: ``"(UID BODY[TEXT])"``. Os dados retornados são tuplos de envelope de parte de mensagem e dados.
ru: Извлечь (части) сообщений. *message_parts* должна быть строкой имен частей сообщения, заключенной в скобки, например: ``"(UID BODY[TEXT])"``. Возвращаемые данные представляют собой кортежи конверта части сообщения и данных.
sv: Hämta (delar av) meddelanden. *message_parts* ska vara en sträng med namn på meddelandedelar inom parentes, t.ex.: ``"(UID BODY[TEXT])"``. Data som returneras är tupler av kuvert och data för meddelandedelar.

source: Get the ``ACL``\ s for *mailbox*. The method is non-standard, but is supported by the ``Cyrus`` server.
pt_pt: Obter as ``ACL``\s para *mailbox*. O método não é padrão, mas é suportado pelo servidor ``Cyrus``.
ru: Получите ``ACL``\ для *mailbox*. Метод нестандартный, но поддерживается сервером Cyrus.
sv: Hämta ``ACL`` för *mailbox*. Metoden är inte standard, men stöds av ``Cyrus``\-servern.

source: Retrieve the specified ``ANNOTATION``\ s for *mailbox*. The method is non-standard, but is supported by the ``Cyrus`` server.
pt_pt: Recuperar as ``ANNOTATION``\s especificadas para *mailbox*. O método não é padrão, mas é suportado pelo servidor ``Cyrus``.
ru: Получить указанные ``ANNOTATION``\ для *mailbox*. Метод нестандартный, но поддерживается сервером Cyrus.
sv: Hämtar angivna ``ANNOTATION`` för *mailbox*. Metoden är inte standard, men stöds av ``Cyrus``\-servern.

source: Get the ``quota`` *root*'s resource usage and limits. This method is part of the IMAP4 QUOTA extension defined in rfc2087.
pt_pt: Obter a utilização de recursos e limites da ``quota`` *root*. Este método faz parte da extensão IMAP4 QUOTA definida em rfc2087.
ru: Получите информацию об использовании и ограничениях ресурсов ``quota`` *root*. Этот метод является частью расширения QUOTA IMAP4, определенного в rfc2087.
sv: Hämta ``quota`` *root*:s resursanvändning och begränsningar. Den här metoden är en del av IMAP4 QUOTA-tillägget som definieras i rfc2087.

source: Get the list of ``quota`` ``roots`` for the named *mailbox*. This method is part of the IMAP4 QUOTA extension defined in rfc2087.
pt_pt: Obter a lista de ``quota`` ``roots`` para a *mailbox* nomeada. Este método faz parte da extensão IMAP4 QUOTA definida em rfc2087.
ru: Получите список корневых квот для именованного *mailbox*. Этот метод является частью расширения QUOTA IMAP4, определенного в rfc2087.
sv: Hämta listan över ``quota`` ``roots`` för den namngivna *mailbox*. Denna metod är en del av IMAP4 QUOTA-tillägget som definieras i rfc2087.

source: List mailbox names in *directory* matching *pattern*. *directory* defaults to the top-level mail folder, and *pattern* defaults to match anything. Returned data contains a list of ``LIST`` responses.
pt_pt: Listar nomes de caixas de correio em *directory* que correspondam a *pattern*. *directory* por defeito é a pasta de correio de nível superior, e *pattern* por defeito corresponde a qualquer coisa. Os dados retornados contêm uma lista de respostas ``LIST``.
ru: Список имен почтовых ящиков в *directory*, соответствующих *pattern*. *directory* по умолчанию соответствует почтовой папке верхнего уровня, а *pattern* по умолчанию соответствует чему угодно. Возвращаемые данные содержат список ``LIST`` ответов.
sv: Lista namn på brevlådor i *katalog* som matchar *mönster*. *directory* är som standard e-postmappen på högsta nivån och *pattern* är som standard att matcha vad som helst. Returnerade data innehåller en lista med ``LIST``\-svar.

source: Identify the client using a plaintext password. The *password* will be quoted.
pt_pt: Identificar o cliente usando uma palavra-passe em texto simples. A *password* será colocada entre aspas.
ru: Идентифицируйте клиента, используя открытый текстовый пароль. *Пароль* будет взят в кавычки.
sv: Identifiera klienten med hjälp av ett lösenord i klartext. Lösenordet kommer att citeras.

source: Force use of ``CRAM-MD5`` authentication when identifying the client to protect the password. Will only work if the server ``CAPABILITY`` response includes the phrase ``AUTH=CRAM-MD5``.
pt_pt: Forçar o uso de autenticação ``CRAM-MD5`` ao identificar o cliente para proteger a palavra-passe. Só funcionará se a resposta ``CAPABILITY`` do servidor incluir a frase ``AUTH=CRAM-MD5``.
ru: Принудительно использовать аутентификацию CRAM-MD5 при идентификации клиента для защиты пароля. Будет работать только в том случае, если ответ сервера CAPABILITY включает фразу AUTH=CRAM-MD5.
sv: Tvinga fram användning av ``CRAM-MD5``\-autentisering när klienten identifieras för att skydda lösenordet. Fungerar endast om serverns ``CAPABILITY``\-svar innehåller frasen ``AUTH=CRAM-MD5``.

source: An :exc:`IMAP4.error` is raised if MD5 support is not available.
pt_pt: Uma exceção :exc:`IMAP4.error` é levantada se o suporte MD5 não estiver disponível.

source: Shutdown connection to server. Returns server ``BYE`` response.
pt_pt: Encerrar a ligação ao servidor. Retorna a resposta ``BYE`` do servidor.
ru: Отключение соединения с сервером. Возвращает ответ сервера ``BYE``.
sv: Stänger av anslutningen till servern. Returnerar serverns ``BYE``\-svar.

source: The method no longer ignores silently arbitrary exceptions.
pt_pt: O método já não ignora silenciosamente exceções arbitrárias.
ru: Метод больше не игнорирует молчаливые произвольные исключения.
sv: Metoden ignorerar inte längre godtyckliga undantag i tysthet.

source: List subscribed mailbox names in directory matching pattern. *directory* defaults to the top level directory and *pattern* defaults to match any mailbox. Returned data are tuples of message part envelope and data.
pt_pt: Listar nomes de caixas de correio subscritas no diretório que correspondam ao padrão. *directory* por defeito é o diretório de nível superior e *pattern* por defeito corresponde a qualquer caixa de correio. Os dados retornados são tuplos de envelope de parte de mensagem e dados.
ru: Список имен подписанных почтовых ящиков в шаблоне соответствия каталогу. *directory* по умолчанию соответствует каталогу верхнего уровня, а *pattern* по умолчанию соответствует любому почтовому ящику. Возвращаемые данные представляют собой кортежи конверта части сообщения и данных.
sv: Lista namn på prenumererade brevlådor i en katalog som matchar ett mönster. *directory* är standard för katalogen på högsta nivån och *pattern* är standard för att matcha alla brevlådor. Returnerade data är tupler av meddelandedel kuvert och data.

source: Show my ACLs for a mailbox (i.e. the rights that I have on mailbox).
pt_pt: Mostrar as minhas ACLs para uma caixa de correio (ou seja, os direitos que tenho na caixa de correio).
ru: Показать мои списки контроля доступа (ACL) для почтового ящика (т. е. права, которые у меня есть для почтового ящика).
sv: Visa mina ACL:er för en brevlåda (dvs. de rättigheter som jag har för brevlådan).

source: Returns IMAP namespaces as defined in :rfc:`2342`.
pt_pt: Retorna os espaços de nome IMAP conforme definido em :rfc:`2342`.
ru: Возвращает пространства имен IMAP, определенные в :rfc:`2342`.
sv: Returnerar IMAP-namnrymder enligt definitionen i :rfc:`2342`.

source: Send ``NOOP`` to server.
pt_pt: Enviar ``NOOP`` para o servidor.
ru: Отправьте ``NOOP`` на сервер.
sv: Skicka ``NOOP`` till servern.

source: Opens socket to *port* at *host*. The optional *timeout* parameter specifies a timeout in seconds for the connection attempt. If timeout is not given or is ``None``, the global default socket timeout is used. Also note that if the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to reject creating a non-blocking socket. This method is implicitly called by the :class:`IMAP4` constructor. The connection objects established by this method will be used in the :meth:`IMAP4.read`, :meth:`IMAP4.readline`, :meth:`IMAP4.send`, and :meth:`IMAP4.shutdown` methods. You may override this method.
pt_pt: Abre um socket para *port* em *host*. O parâmetro opcional *timeout* especifica um tempo limite em segundos para a tentativa de ligação. Se o tempo limite não for fornecido ou for ``None``, o tempo limite padrão global do socket é usado. Note também que se o parâmetro *timeout* for definido como zero, levantará um :class:`ValueError` para rejeitar a criação de um socket não bloqueante. Este método é chamado implicitamente pelo construtor :class:`IMAP4`. Os objetos de ligação estabelecidos por este método serão usados nos métodos :meth:`IMAP4.read`, :meth:`IMAP4.readline`, :meth:`IMAP4.send`, e :meth:`IMAP4.shutdown`. Pode substituir este método.

source: Raises an :ref:`auditing event <auditing>` ``imaplib.open`` with arguments ``self``, ``host``, ``port``.
pt_pt: Levanta um evento de :ref:`auditoria <auditing>` ``imaplib.open`` com argumentos ``self``, ``host``, ``port``.
ru: Вызывает :ref:`событие аудита <auditing>` ``imaplib.open`` с аргументами ``self``, ``host``, ``port``.
sv: Utlöser en :ref:`auditing event <auditing>` ``imaplib.open`` med argumenten ``self``, ``host``, ``port``.

source: The *timeout* parameter was added.
pt_pt: O parâmetro *timeout* foi adicionado.
ru: Добавлен параметр *timeout*.
sv: Parametern *timeout* har lagts till.

source: Fetch truncated part of a message. Returned data is a tuple of message part envelope and data.
pt_pt: Buscar parte truncada de uma mensagem. Os dados retornados são um tuplo de envelope de parte de mensagem e dados.
ru: Получить усеченную часть сообщения. Возвращенные данные представляют собой кортеж из конверта части сообщения и данных.
sv: Hämtar en avkortad del av ett meddelande. Returnerade data är en tupel av meddelandets delkuvert och data.

source: Assume authentication as *user*. Allows an authorised administrator to proxy into any user's mailbox.
pt_pt: Assumir autenticação como *user*. Permite que um administrador autorizado faça proxy para a caixa de correio de qualquer utilizador.
ru: Предположим, что аутентификация осуществляется как *пользователь*. Позволяет авторизованному администратору подключаться к почтовому ящику любого пользователя через прокси.
sv: Anta autentisering som *användare*. Tillåter en behörig administratör att använda proxy för att komma åt en användares brevlåda.

source: Reads *size* bytes from the remote server. You may override this method.
pt_pt: Lê *size* bytes do servidor remoto. Pode substituir este método.
ru: Считывает *size* байты с удаленного сервера. Вы можете переопределить этот метод.
sv: Läser *storlek* byte från fjärrservern. Du kan åsidosätta den här metoden.

source: Reads one line from the remote server. You may override this method.
pt_pt: Lê uma linha do servidor remoto. Pode substituir este método.
ru: Считывает одну строку с удаленного сервера. Вы можете переопределить этот метод.
sv: Läser en rad från fjärrservern. Du kan åsidosätta den här metoden.

source: Prompt server for an update. Returned data is ``None`` if no new messages, else value of ``RECENT`` response.
pt_pt: Solicitar ao servidor uma atualização. Os dados retornados são ``None`` se não houver novas mensagens, caso contrário, o valor da resposta ``RECENT``.
ru: Запросить сервер для обновления. Возвращаемые данные — «None», если нет новых сообщений, в противном случае значение ответа «RECENT».
sv: Frågar servern om en uppdatering. Returnerad data är ``None`` om inga nya meddelanden, annars värdet av ``RECENT`` svaret.

source: Rename mailbox named *oldmailbox* to *newmailbox*.
pt_pt: Renomear a caixa de correio chamada *oldmailbox* para *newmailbox*.
ru: Переименуйте почтовый ящик с именем *oldmailbox* в *newmailbox*.
sv: Byt namn på brevlådan *oldmailbox* till *newmailbox*.

source: Return data for response *code* if received, or ``None``. Returns the given code, instead of the usual type.
pt_pt: Retorna dados para a resposta *code* se recebida, ou ``None``. Retorna o código dado, em vez do tipo habitual.
ru: Возвращать данные для ответа *код*, если он получен, или ``Нет``. Возвращает заданный код вместо обычного типа.
sv: Returnerar data för svaret *code* om det mottagits, eller ``None``. Returnerar den angivna koden, istället för den vanliga typen.

source: Search mailbox for matching messages. *charset* may be ``None``, in which case no ``CHARSET`` will be specified in the request to the server. The IMAP protocol requires that at least one criterion be specified; an exception will be raised when the server returns an error. *charset* must be ``None`` if the ``UTF8=ACCEPT`` capability was enabled using the :meth:`enable` command.
pt_pt: Procurar na caixa de correio por mensagens correspondentes. *charset* pode ser ``None``, caso em que nenhum ``CHARSET`` será especificado no pedido ao servidor. O protocolo IMAP requer que pelo menos um critério seja especificado; uma exceção será levantada quando o servidor retornar um erro. *charset* deve ser ``None`` se a capacidade ``UTF8=ACCEPT`` foi ativada usando o comando :meth:`enable`.
ru: Найдите в почтовом ящике соответствующие сообщения. *charset* может быть ``None``, и в этом случае ``CHARSET`` не будет указан в запросе к серверу. Протокол IMAP требует указания хотя бы одного критерия; исключение будет вызвано, когда сервер вернет ошибку. *charset* должен быть ``None``, если возможность ``UTF8=ACCEPT`` была включена с помощью команды :meth:`enable`.
sv: Sök efter matchande meddelanden i brevlådan. *charset* kan vara ``None``, i vilket fall ingen ``CHARSET`` kommer att anges i begäran till servern. IMAP-protokollet kräver att minst ett kriterium anges; ett undantag kommer att göras om servern returnerar ett fel. *charset* måste vara ``None`` om funktionen ``UTF8=ACCEPT`` aktiverades med kommandot :meth:`enable`.

source: Example::
pt_pt: Exemplo::
ru: Пример::
sv: Exempel::

source: # M is a connected IMAP4 instance... typ, msgnums = M.search(None, 'FROM', '"LDJ"') # or: typ, msgnums = M.search(None, '(FROM "LDJ")')
pt_pt: # M é uma instância IMAP4 conectada... typ, msgnums = M.search(None, 'FROM', '"LDJ"') # ou: typ, msgnums = M.search(None, '(FROM "LDJ")')

source: Select a mailbox. Returned data is the count of messages in *mailbox* (``EXISTS`` response). The default *mailbox* is ``'INBOX'``. If the *readonly* flag is set, modifications to the mailbox are not allowed.
pt_pt: Selecionar uma caixa de correio. Os dados retornados são a contagem de mensagens em *mailbox* (resposta ``EXISTS``). A *mailbox* padrão é ``'INBOX'``. Se a flag *readonly* estiver definida, as modificações na caixa de correio não são permitidas.
ru: Выберите почтовый ящик. Возвращаемые данные — это количество сообщений в *mailbox* (ответ EXISTS). По умолчанию *почтовый ящик* — ``'INBOX'``. Если установлен флаг *readonly*, изменения в почтовом ящике не допускаются.
sv: Välj en brevlåda. Data som returneras är antalet meddelanden i *mailbox* (svar ``EXISTS``). Standardvärdet för *brevlåda* är ``'INBOX'``. Om flaggan *readonly* är inställd är det inte tillåtet att ändra i brevlådan.

source: Sends ``data`` to the remote server. You may override this method.
pt_pt: Envía ``data`` para o servidor remoto. Pode substituir este método.
ru: Отправляет ``данные`` на удаленный сервер. Вы можете переопределить этот метод.
sv: Skickar ``data`` till fjärrservern. Du kan åsidosätta den här metoden.

source: Raises an :ref:`auditing event <auditing>` ``imaplib.send`` with arguments ``self``, ``data``.
pt_pt: Levanta um evento de :ref:`auditoria <auditing>` ``imaplib.send`` com argumentos ``self``, ``data``.
ru: Вызывает :ref:`событие аудита <auditing>` ``imaplib.send`` с аргументами ``self``, ``data``.
sv: Utlöser en :ref:`auditing event <auditing>` ``imaplib.send`` med argumenten ``self``, ``data``.

source: Set an ``ACL`` for *mailbox*. The method is non-standard, but is supported by the ``Cyrus`` server.
pt_pt: Definir uma ``ACL`` para *mailbox*. O método não é padrão, mas é suportado pelo servidor ``Cyrus``.
ru: Установите ``ACL`` для *mailbox*. Метод нестандартный, но поддерживается сервером Cyrus.
sv: Ställ in en ``ACL`` för *mailbox*. Metoden är inte standard, men stöds av ``Cyrus``\-servern.

source: Set ``ANNOTATION``\ s for *mailbox*. The method is non-standard, but is supported by the ``Cyrus`` server.
pt_pt: Definir ``ANNOTATION``\s para *mailbox*. O método não é padrão, mas é suportado pelo servidor ``Cyrus``.
ru: Установите ``ANNOTATION``\ для *mailbox*. Метод нестандартный, но поддерживается сервером Cyrus.
sv: Ställ in ``ANNOTATION`` för *brevlåda*. Metoden är inte standard, men stöds av ``Cyrus``\-servern.

source: Set the ``quota`` *root*'s resource *limits*. This method is part of the IMAP4 QUOTA extension defined in rfc2087.
pt_pt: Definir os *limits* de recursos da ``quota`` *root*. Este método faz parte da extensão IMAP4 QUOTA definida em rfc2087.
ru: Установите *пределы* ресурса ``quota`` *root*. Этот метод является частью расширения QUOTA IMAP4, определенного в rfc2087.
sv: Ställ in resursbegränsningarna för *root* ``quota``. Denna metod är en del av IMAP4 QUOTA-tillägget som definieras i rfc2087.
