Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.po
Languages: pt_pt, ru

source: Create a new module based on **spec** and :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>`.
pt_pt: Cria um novo módulo com base em **spec** e :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>`.
ru: Создайте новый модуль на основе **spec** и :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>`.

source: If :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>` does not return ``None``, then any pre-existing attributes will not be reset. Also, no :exc:`AttributeError` will be raised if triggered while accessing **spec** or setting an attribute on the module.
pt_pt: Se :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>` não retornar ``None``, então quaisquer atributos pré-existentes não serão redefinidos. Além disso, nenhum :exc:`AttributeError` será levantado se desencadeado ao aceder a **spec** ou ao definir um atributo no módulo.
ru: Если :meth:`spec.loader.create_module <importlib.abc.Loader.create_module>` не возвращает ``None``, то любые ранее существовавшие атрибуты не будут сброшены. Кроме того, :exc:`AttributeError` не будет возникать, если он срабатывает при доступе к **spec** или установке атрибута в модуле.

source: This function is preferred over using :class:`types.ModuleType` to create a new module as **spec** is used to set as many import-controlled attributes on the module as possible.
pt_pt: Esta função é preferível ao uso de :class:`types.ModuleType` para criar um novo módulo, uma vez que **spec** é usado para definir o maior número possível de atributos controlados por importação no módulo.
ru: Эта функция предпочтительнее использования :class:`types.ModuleType` для создания нового модуля, поскольку **spec** используется для установки как можно большего количества атрибутов, контролируемых импортом, в модуле.

source: A factory function for creating a :class:`~importlib.machinery.ModuleSpec` instance based on a loader. The parameters have the same meaning as they do for ModuleSpec. The function uses available :term:`loader` APIs, such as :meth:`InspectLoader.is_package`, to fill in any missing information on the spec.
pt_pt: Uma função de fábrica para criar uma instância de :class:`~importlib.machinery.ModuleSpec` com base num *loader*. Os parâmetros têm o mesmo significado que para ModuleSpec. A função usa APIs disponíveis do :term:`loader`, como :meth:`InspectLoader.is_package`, para preencher quaisquer informações em falta na especificação.
ru: Фабричная функция для создания экземпляра :class:`~importlib.machinery.ModuleSpec` на основе загрузчика. Параметры имеют то же значение, что и для ModuleSpec. Функция использует доступные API-интерфейсы :term:`loader`, такие как :meth:`InspectLoader.is_package`, для заполнения любой недостающей информации в спецификации.

source: A factory function for creating a :class:`~importlib.machinery.ModuleSpec` instance based on the path to a file. Missing information will be filled in on the spec by making use of loader APIs and by the implication that the module will be file-based.
pt_pt: Uma função de fábrica para criar uma instância de :class:`~importlib.machinery.ModuleSpec` com base no caminho para um ficheiro. As informações em falta serão preenchidas na especificação através do uso de APIs do *loader* e pela implicação de que o módulo será baseado em ficheiros.
ru: Фабричная функция для создания экземпляра :class:`~importlib.machinery.ModuleSpec` на основе пути к файлу. Недостающая информация будет заполнена в спецификации за счет использования API-интерфейсов загрузчика и подразумевая, что модуль будет основан на файлах.

source: Return the hash of *source_bytes* as bytes. A hash-based ``.pyc`` file embeds the :func:`source_hash` of the corresponding source file's contents in its header.
pt_pt: Retorna o hash de *source_bytes* como bytes. Um ficheiro ``.pyc`` baseado em hash incorpora o :func:`source_hash` do conteúdo do ficheiro de origem correspondente no seu cabeçalho.
ru: Верните хеш *source_bytes* в виде байтов. Файл ``.pyc``, основанный на хеше, встраивает :func:`source_hash` содержимого соответствующего исходного файла в свой заголовок.

source: A context manager that can temporarily skip the compatibility check for extension modules. By default the check is enabled and will fail when a single-phase init module is imported in a subinterpreter. It will also fail for a multi-phase init module that doesn't explicitly support a per-interpreter GIL, when imported in an interpreter with its own GIL.
pt_pt: Um gestor de contexto que pode ignorar temporariamente a verificação de compatibilidade para módulos de extensão. Por predefinição, a verificação está ativada e falhará quando um módulo de inicialização de fase única for importado num subinterpretador. Também falhará para um módulo de inicialização em várias fases que não suporte explicitamente um GIL por interpretador, quando importado num interpretador com o seu próprio GIL.
ru: Контекстный менеджер, который может временно пропустить проверку совместимости модулей расширения. По умолчанию проверка включена и завершится неудачно, если однофазный модуль инициализации импортируется в субинтерпретатор. Он также не будет работать для модуля многофазной инициализации, который явно не поддерживает GIL для каждого интерпретатора, при импорте в интерпретатор с собственным GIL.

source: Note that this function is meant to accommodate an unusual case; one which is likely to eventually go away. There's is a pretty good chance this is not what you were looking for.
pt_pt: Note que esta função destina-se a acomodar um caso invulgar; um que provavelmente desaparecerá eventualmente. Há uma boa probabilidade de isto não ser o que procurava.
ru: Обратите внимание, что эта функция предназначена для необычных случаев; тот, который, вероятно, в конечном итоге исчезнет. Вполне вероятно, что это не то, что вы искали.

source: You can get the same effect as this function by implementing the basic interface of multi-phase init (:pep:`489`) and lying about support for multiple interpreters (or per-interpreter GIL).
pt_pt: Pode obter o mesmo efeito desta função implementando a interface básica de inicialização em várias fases (:pep:`489`) e mentindo sobre o suporte para múltiplos interpretadores (ou GIL por interpretador).
ru: Вы можете получить тот же эффект, что и эта функция, реализовав базовый интерфейс многофазной инициализации (:pep:`489`) и солгав о поддержке нескольких интерпретаторов (или GIL для каждого интерпретатора).

source: Using this function to disable the check can lead to unexpected behavior and even crashes. It should only be used during extension module development.
pt_pt: Usar esta função para desativar a verificação pode levar a comportamentos inesperados e até falhas. Deve ser usada apenas durante o desenvolvimento de módulos de extensão.
ru: Использование этой функции для отключения проверки может привести к неожиданному поведению и даже сбоям. Его следует использовать только во время разработки модуля расширения.

source: A class which postpones the execution of the loader of a module until the module has an attribute accessed.
pt_pt: Uma classe que adia a execução do *loader* de um módulo até que um atributo do módulo seja acedido.
ru: Класс, который откладывает выполнение загрузчика модуля до тех пор, пока модуль не получит доступ к атрибуту.

source: This class **only** works with loaders that define :meth:`~importlib.abc.Loader.exec_module` as control over what module type is used for the module is required. For those same reasons, the loader's :meth:`~importlib.abc.Loader.create_module` method must return ``None`` or a type for which its ``__class__`` attribute can be mutated along with not using :term:`slots <__slots__>`. Finally, modules which substitute the object placed into :data:`sys.modules` will not work as there is no way to properly replace the module references throughout the interpreter safely; :exc:`ValueError` is raised if such a substitution is detected.
pt_pt: Esta classe **apenas** funciona com *loaders* que definem :meth:`~importlib.abc.Loader.exec_module`, uma vez que é necessário controlo sobre o tipo de módulo usado para o módulo. Pelas mesmas razões, o método :meth:`~importlib.abc.Loader.create_module` do *loader* deve retornar ``None`` ou um tipo para o qual o seu atributo ``__class__`` possa ser mutado, além de não usar :term:`slots <__slots__>`. Finalmente, módulos que substituem o objeto colocado em :data:`sys.modules` não funcionarão, uma vez que não há forma de substituir corretamente as referências do módulo em todo o interpretador de forma segura; :exc:`ValueError` é levantado se tal substituição for detetada.
ru: Этот класс **только** работает с загрузчиками, которые определяют :meth:`~importlib.abc.Loader.exec_module`, поскольку требуется контроль над тем, какой тип модуля используется для модуля. По тем же причинам метод :meth:`~importlib.abc.Loader.create_module` загрузчика должен возвращать ``None`` или тип, для которого его атрибут ``__class__`` может быть изменен без использования :term: `слоты <__slots__>`. Наконец, модули, которые заменяют объект, помещенный в :data:`sys.modules`, не будут работать, поскольку не существует способа безопасно заменить ссылки на модули во всем интерпретаторе; :exc:`ValueError` возникает, если обнаружена такая замена.

source: For projects where startup time is critical, this class allows for potentially minimizing the cost of loading a module if it is never used. For projects where startup time is not essential then use of this class is **heavily** discouraged due to error messages created during loading being postponed and thus occurring out of context.
pt_pt: Para projetos em que o tempo de arranque é crítico, esta classe permite potencialmente minimizar o custo de carregar um módulo se este nunca for usado. Para projetos em que o tempo de arranque não é essencial, o uso desta classe é **fortemente** desencorajado, uma vez que as mensagens de erro criadas durante o carregamento são adiadas e, portanto, ocorrem fora de contexto.
ru: Для проектов, где время запуска имеет решающее значение, этот класс позволяет потенциально минимизировать стоимость загрузки модуля, если он никогда не используется. Для проектов, где время запуска не является существенным, использование этого класса **крайне** не рекомендуется из-за того, что сообщения об ошибках, создаваемые во время загрузки, откладываются и, таким образом, происходят вне контекста.

source: Began calling :meth:`~importlib.abc.Loader.create_module`, removing the compatibility warning for :class:`importlib.machinery.BuiltinImporter` and :class:`importlib.machinery.ExtensionFileLoader`.
pt_pt: Começou a chamar :meth:`~importlib.abc.Loader.create_module`, removendo o aviso de compatibilidade para :class:`importlib.machinery.BuiltinImporter` e :class:`importlib.machinery.ExtensionFileLoader`.
ru: Начал вызывать :meth:`~importlib.abc.Loader.create_module`, удалив предупреждение совместимости для :class:`importlib.machinery.BuiltinImporter` и :class:`importlib.machinery.ExtensionFileLoader`.

source: A class method which returns a callable that creates a lazy loader. This is meant to be used in situations where the loader is passed by class instead of by instance. ::
pt_pt: Um método de classe que retorna um chamável que cria um *loader* preguiçoso. Isto destina-se a ser usado em situações em que o *loader* é passado por classe em vez de por instância. ::
ru: Метод класса, который возвращает вызываемый объект, создающий ленивый загрузчик. Это предназначено для использования в ситуациях, когда загрузчик передается по классу, а не по экземпляру. ::

source: Examples
pt_pt: Exemplos
ru: Примеры

source: Importing programmatically
pt_pt: Importar programaticamente
ru: Программный импорт

source: To programmatically import a module, use :func:`importlib.import_module`. ::
pt_pt: Para importar um módulo programaticamente, use :func:`importlib.import_module`. :
ru: Чтобы программно импортировать модуль, используйте :func:`importlib.import_module`. ::

source: Checking if a module can be imported
pt_pt: Verificar se um módulo pode ser importado
ru: Проверка возможности импорта модуля

source: If you need to find out if a module can be imported without actually doing the import, then you should use :func:`importlib.util.find_spec`.
pt_pt: Se precisar de saber se um módulo pode ser importado sem realmente fazer a importação, deve usar :func:`importlib.util.find_spec`.
ru: Если вам нужно выяснить, можно ли импортировать модуль без фактического импорта, вам следует использовать :func:`importlib.util.find_spec`.

source: Note that if ``name`` is a submodule (contains a dot), :func:`importlib.util.find_spec` will import the parent module. ::
pt_pt: Note que se ``name`` for um submódulo (contém um ponto), :func:`importlib.util.find_spec` importará o módulo pai. :
ru: Обратите внимание: если ``name`` является подмодулем (содержит точку), :func:`importlib.util.find_spec` импортирует родительский модуль. ::

source: Importing a source file directly
pt_pt: Importar um ficheiro de origem diretamente
ru: Импорт исходного файла напрямую

source: This recipe should be used with caution: it is an approximation of an import statement where the file path is specified directly, rather than :data:`sys.path` being searched. Alternatives should first be considered first, such as modifying :data:`sys.path` when a proper module is required, or using :func:`runpy.run_path` when the global namespace resulting from running a Python file is appropriate.
pt_pt: Esta receita deve ser usada com cautela: é uma aproximação de uma instrução de importação em que o caminho do ficheiro é especificado diretamente, em vez de :data:`sys.path` ser pesquisado. Alternativas devem ser consideradas primeiro, como modificar :data:`sys.path` quando um módulo adequado é necessário, ou usar :func:`runpy.run_path` quando o espaço de nomes global resultante da execução de um ficheiro Python é apropriado.
ru: Этот рецепт следует использовать с осторожностью: это приближение к оператору импорта, в котором путь к файлу указывается напрямую, а не выполняется поиск по :data:`sys.path`. В первую очередь следует рассмотреть альтернативы, такие как изменение :data:`sys.path`, когда требуется соответствующий модуль, или использование :func:`runpy.run_path`, когда подходящее глобальное пространство имен, полученное в результате запуска файла Python, является подходящим.

source: To import a Python source file directly from a path, use the following recipe::
pt_pt: Para importar um ficheiro de origem Python diretamente a partir de um caminho, use a seguinte receita::
ru: Чтобы импортировать исходный файл Python непосредственно по пути, используйте следующий рецепт:

source: Implementing lazy imports
pt_pt: Implementar importações preguiçosas
ru: Реализация отложенного импорта

source: The example below shows how to implement lazy imports::
pt_pt: O exemplo abaixo mostra como implementar importações preguiçosas::
ru: В примере ниже показано, как реализовать отложенный импорт:

source: Setting up an importer
pt_pt: Configurar um importador
ru: Настройка импортера

source: For deep customizations of import, you typically want to implement an :term:`importer`. This means managing both the :term:`finder` and :term:`loader` side of things. For finders there are two flavours to choose from depending on your needs: a :term:`meta path finder` or a :term:`path entry finder`. The former is what you would put on :data:`sys.meta_path` while the latter is what you create using a :term:`path entry hook` on :data:`sys.path_hooks` which works with :data:`sys.path` entries to potentially create a finder. This example will show you how to register your own importers so that import will use them (for creating an importer for yourself, read the documentation for the appropriate classes defined within this package)::
pt_pt: Para personalizações profundas da importação, geralmente deseja implementar um :term:`importador`. Isto significa gerir tanto o lado :term:`finder` como o lado :term:`loader`. Para *finders*, há dois tipos para escolher, dependendo das suas necessidades: um :term:`meta path finder` ou um :term:`path entry finder`. O primeiro é o que colocaria em :data:`sys.meta_path`, enquanto o último é o que cria usando um :term:`path entry hook` em :data:`sys.path_hooks`, que funciona com entradas de :data:`sys.path` para potencialmente criar um *finder*. Este exemplo mostrará como registar os seus próprios importadores para que a importação os utilize (para criar um importador para si, leia a documentação das classes apropriadas definidas dentro deste pacote)::
ru: Для глубокой настройки импорта обычно требуется реализовать :term:`importer`. Это означает управление как :term:`finder`, так и :term:`loader`. Для поиска есть два варианта на выбор в зависимости от ваших потребностей: :term:`мета-поиск пути` или :term:`поиск записей пути`. Первое — это то, что вы бы поместили в :data:`sys.meta_path`, а второе — это то, что вы создаёте с помощью :term:`path входного хука` в :data:`sys.path_hooks`, который работает с :data:`sys. Записи .path` для потенциального создания средства поиска. Этот пример покажет вам, как зарегистрировать ваши собственные импортеры, чтобы импорт мог использовать их (для создания импортера для себя прочитайте документацию для соответствующих классов, определенных в этом пакете)::

source: Approximating :func:`importlib.import_module`
pt_pt: Aproximar :func:`importlib.import_module`
ru: Приближение :func:`importlib.import_module`

source: Import itself is implemented in Python code, making it possible to expose most of the import machinery through importlib. The following helps illustrate the various APIs that importlib exposes by providing an approximate implementation of :func:`importlib.import_module`::
pt_pt: A própria importação é implementada em código Python, o que torna possível expor a maior parte da maquinaria de importação através do importlib. O seguinte ajuda a ilustrar as várias APIs que o importlib expõe, fornecendo uma implementação aproximada de :func:`importlib.import_module`::
ru: Сам импорт реализован в коде Python, что позволяет использовать большую часть механизмов импорта через importlib. Следующее помогает проиллюстрировать различные API, которые предоставляет importlib, предоставляя приблизительную реализацию :func:`importlib.import_module`::

source: universal newlines
pt_pt: novas linhas universais
ru: универсальные переводы строк

source: importlib.abc.InspectLoader.get_source method
pt_pt: método importlib.abc.InspectLoader.get_source
ru: importlib.abc.InspectLoader.get_source метод

source: Returns ``True`` if the file path points to a package's ``__init__`` module based on :const:`EXTENSION_SUFFIXES`.
pt_pt: Retorna ``True`` se o caminho do ficheiro apontar para um módulo ``__init__`` de um pacote com base em :const:`EXTENSION_SUFFIXES`.

source: import importlib.util import sys # For illustrative purposes. name = 'itertools' if name in sys.modules: print(f"{name!r} already in sys.modules") elif (spec := importlib.util.find_spec(name)) is not None: # If you chose to perform the actual import ... module = importlib.util.module_from_spec(spec) sys.modules[name] = module spec.loader.exec_module(module) print(f"{name!r} has been imported") else: print(f"can't find the {name!r} module")
pt_pt: import importlib.util import sys # Apenas para fins ilustrativos. name = 'itertools' if name in sys.modules: print(f"{name!r} já está em sys.modules") elif (spec := importlib.util.find_spec(name)) is not None: # Se optar por realizar a importação real... module = importlib.util.module_from_spec(spec) sys.modules[name] = module spec.loader.exec_module(module) print(f"{name!r} foi importado") else: print(f"não é possível encontrar o módulo {name!r}")

source: import importlib.util import sys def import_from_path(module_name, file_path): spec = importlib.util.spec_from_file_location(module_name, file_path) module = importlib.util.module_from_spec(spec) sys.modules[module_name] = module spec.loader.exec_module(module) return module # For illustrative purposes only (use of `json` is arbitrary). import json file_path = json.__file__ module_name = json.__name__ # Similar outcome as `import json`. json = import_from_path(module_name, file_path)
pt_pt: import importlib.util import sys def import_from_path(module_name, file_path): spec = importlib.util.spec_from_file_location(module_name, file_path) module = importlib.util.module_from_spec(spec) sys.modules[module_name] = module spec.loader.exec_module(module) return module # Apenas para fins ilustrativos (o uso de `json` é arbitrário). import json file_path = json.__file__ module_name = json.__name__ # Resultado semelhante a `import json`. json = import_from_path(module_name, file_path)

source: >>> import importlib.util >>> import sys >>> def lazy_import(name): ... spec = importlib.util.find_spec(name) ... loader = importlib.util.LazyLoader(spec.loader) ... spec.loader = loader ... module = importlib.util.module_from_spec(spec) ... sys.modules[name] = module ... loader.exec_module(module) ... return module ... >>> lazy_typing = lazy_import("typing") >>> #lazy_typing is a real module object, >>> #but it is not loaded in memory yet. >>> lazy_typing.TYPE_CHECKING False
pt_pt: >>> import importlib.util >>> import sys >>> def lazy_import(name): ... spec = importlib.util.find_spec(name) ... loader = importlib.util.LazyLoader(spec.loader) ... spec.loader = loader ... module = importlib.util.module_from_spec(spec) ... sys.modules[name] = module ... loader.exec_module(module) ... return module ... >>> lazy_typing = lazy_import("typing") >>> # lazy_typing é um objeto de módulo real, >>> # mas ainda não está carregado na memória. >>> lazy_typing.TYPE_CHECKING False

source: import importlib.machinery import sys # For illustrative purposes only. SpamMetaPathFinder = importlib.machinery.PathFinder SpamPathEntryFinder = importlib.machinery.FileFinder loader_details = (importlib.machinery.SourceFileLoader, importlib.machinery.SOURCE_SUFFIXES) # Setting up a meta path finder. # Make sure to put the finder in the proper location in the list in terms of # priority. sys.meta_path.append(SpamMetaPathFinder) # Setting up a path entry finder. # Make sure to put the path hook in the proper location in the list in terms # of priority. sys.path_hooks.append(SpamPathEntryFinder.path_hook(loader_details))
pt_pt: import importlib.machinery import sys # Apenas para fins ilustrativos. SpamMetaPathFinder = importlib.machinery.PathFinder SpamPathEntryFinder = importlib.machinery.FileFinder loader_details = (importlib.machinery.SourceFileLoader, importlib.machinery.SOURCE_SUFFIXES) # Configurar um meta path finder. # Certifique-se de colocar o finder na posição correta na lista em termos de # prioridade. sys.meta_path.append(SpamMetaPathFinder) # Configurar um path entry finder. # Certifique-se de colocar o path hook na posição correta na lista em termos # de prioridade. sys.path_hooks.append(SpamPathEntryFinder.path_hook(loader_details))
