Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.metadata.po
Languages: pt_pt, sv

source: :mod:`!importlib.metadata` -- Accessing package metadata
pt_pt: :mod:`!importlib.metadata` — Aceder aos metadados de pacotes
sv: :mod:`!importlib.metadata` -- Tillgång till metadata för paket

source: ``importlib.metadata`` is no longer provisional.
pt_pt: ``importlib.metadata`` já não é provisório.
sv: ``importlib.metadata`` är inte längre provisorisk.

source: **Source code:** :source:`Lib/importlib/metadata/__init__.py`
pt_pt: **Código-fonte:** :source:`Lib/importlib/metadata/__init__.py`
sv: **Källkod:** :source:`Lib/importlib/metadata/__init__.py`

source: ``importlib.metadata`` is a library that provides access to the metadata of an installed `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, such as its entry points or its top-level names (`Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_\s, modules, if any). Built in part on Python's import system, this library intends to replace similar functionality in the `entry point API`_ and `metadata API`_ of ``pkg_resources``. Along with :mod:`importlib.resources`, this package can eliminate the need to use the older and less efficient ``pkg_resources`` package.
sv: ``importlib.metadata`` är ett bibliotek som ger tillgång till metadata för ett installerat `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, såsom dess ingångspunkter eller dess toppnivånamn (`Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_\s, moduler, om sådana finns). Det här biblioteket bygger delvis på Pythons importsystem och avser att ersätta liknande funktionalitet i `entry point API`_ och `metadata API`_ i ``pkg_resources``. Tillsammans med :mod:`importlib.resources` kan detta paket eliminera behovet av att använda det äldre och mindre effektiva paketet ``pkg_resources``.

source: ``importlib.metadata`` operates on third-party *distribution packages* installed into Python's ``site-packages`` directory via tools such as :pypi:`pip`. Specifically, it works with distributions with discoverable ``dist-info`` or ``egg-info`` directories, and metadata defined by the `Core metadata specifications <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_.
pt_pt: ``importlib.metadata`` opera em pacotes de distribuição de terceiros instalados no diretório ``site-packages`` do Python através de ferramentas como :pypi:`pip`. Especificamente, funciona com distribuições com diretórios ``dist-info`` ou ``egg-info`` detetáveis, e metadados definidos pelas `Especificações de metadados principais <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_.
sv: ``importlib.metadata`` fungerar på tredjeparts *distributionspaket* som installeras i Pythons ``site-packages``-katalog via verktyg som :pypi:`pip`. Specifikt fungerar det med distributioner med upptäckbara ``dist-info`` eller ``egg-info``-kataloger och metadata som definieras av `Core metadata specifications <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_.

source: These are *not* necessarily equivalent to or correspond 1:1 with the top-level *import package* names that can be imported inside Python code. One *distribution package* can contain multiple *import packages* (and single modules), and one top-level *import package* may map to multiple *distribution packages* if it is a namespace package. You can use :ref:`packages_distributions() <package-distributions>` to get a mapping between them.
sv: Dessa är *inte* nödvändigtvis likvärdiga med eller motsvarar 1:1 de *importpaket*-namn på toppnivå som kan importeras i Python-kod. Ett *distributionspaket* kan innehålla flera *importpaket* (och enstaka moduler), och ett *importpaket* på toppnivå kan mappa till flera *distributionspaket* om det är ett namnrymdspaket. Du kan använda :ref:`packages_distributions() <package-distributions>` för att få en mappning mellan dem.

source: By default, distribution metadata can live on the file system or in zip archives on :data:`sys.path`. Through an extension mechanism, the metadata can live almost anywhere.
sv: Som standard kan distributionsmetadata finnas i filsystemet eller i zip-arkiv på :data:`sys.path`. Genom en tilläggsmekanism kan metadata lagras nästan var som helst.

source: The documentation for ``importlib_metadata``, which supplies a backport of ``importlib.metadata``. This includes an `API reference <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ for this module's classes and functions, as well as a `migration guide <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ for existing users of ``pkg_resources``.
pt_pt: A documentação para ``importlib_metadata``, que fornece um backport de ``importlib.metadata``. Isto inclui uma `referência de API <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ para as classes e funções deste módulo, bem como um `guia de migração <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ para utilizadores existentes de ``pkg_resources``.
sv: Dokumentationen för ``importlib_metadata``, som tillhandahåller en backport av ``importlib.metadata``. Detta inkluderar en `API-referens <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ för den här modulens klasser och funktioner, samt en `migreringsguide <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ för befintliga användare av ``pkg_resources``.

source: Overview
pt_pt: Visão Geral
sv: Översikt

source: Let's say you wanted to get the version string for a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ you've installed using ``pip``. We start by creating a virtual environment and installing something into it:
sv: Låt oss säga att du vill få fram versionssträngen för ett `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ som du har installerat med hjälp av ``pip``. Vi börjar med att skapa en virtuell miljö och installerar något i den:

source: You can get the version string for ``wheel`` by running the following:
pt_pt: Pode obter a string de versão para ``wheel`` executando o seguinte:
sv: Du kan få fram versionssträngen för ``wheel`` genom att köra följande:

source: You can also get a collection of entry points selectable by properties of the EntryPoint (typically 'group' or 'name'), such as ``console_scripts``, ``distutils.commands`` and others. Each group contains a collection of :ref:`EntryPoint <entry-points>` objects.
sv: Du kan också få en samling ingångspunkter som kan väljas genom egenskaper hos EntryPoint (vanligtvis 'group' eller 'name'), t.ex. ``console_scripts``, ``distutils.commands`` och andra. Varje grupp innehåller en samling av :ref:`EntryPoint <entry-points>`` objekt.

source: You can get the :ref:`metadata for a distribution <metadata>`::
pt_pt: Pode obter os :ref:`metadados para uma distribuição <metadata>`::
sv: Du kan få :ref:`metadata för en distribution <metadata>`::

source: You can also get a :ref:`distribution's version number <version>`, list its :ref:`constituent files <files>`, and get a list of the distribution's :ref:`requirements`.
pt_pt: Também pode obter o :ref:`número de versão de uma distribuição <version>`, listar os seus :ref:`ficheiros constituintes <files>`, e obter uma lista dos :ref:`requirements`.
sv: Du kan också få en :ref:`distributions versionsnummer <version>`, lista dess :ref:`beståndsdelar <files>` och få en lista över distributionens :ref:`krav`.

source: Subclass of :class:`ModuleNotFoundError` raised by several functions in this module when queried for a distribution package which is not installed in the current Python environment.
pt_pt: Subclasse de :class:`ModuleNotFoundError` levantada por várias funções neste módulo quando questionada por um pacote de distribuição que não está instalado no ambiente Python atual.
sv: Underklass till :class:`ModuleNotFoundError` som orsakas av flera funktioner i denna modul när de frågar efter ett distributionspaket som inte är installerat i den aktuella Python-miljön.

source: Functional API
pt_pt: API Funcional
sv: Funktionellt API

source: This package provides the following functionality via its public API.
pt_pt: Este pacote fornece a seguinte funcionalidade através da sua API pública.
sv: Detta paket tillhandahåller följande funktionalitet via sitt publika API.

source: Entry points
pt_pt: Pontos de entrada
sv: Ingångspunkter

source: Returns a :class:`EntryPoints` instance describing entry points for the current environment. Any given keyword parameters are passed to the :meth:`!select` method for comparison to the attributes of the individual entry point definitions.
pt_pt: Retorna uma instância :class:`EntryPoints` que descreve pontos de entrada para o ambiente atual. Quaisquer parâmetros de palavra-chave fornecidos são passados para o método :meth:`!select` para comparação com os atributos das definições individuais de pontos de entrada.
sv: Returnerar en :class:`EntryPoints`-instans som beskriver entry points för den aktuella miljön. Eventuella nyckelordsparametrar skickas till :meth:`!select`-metoden för jämförelse med attributen i de enskilda entry point-definitionerna.

source: Note: it is not currently possible to query for entry points based on their :attr:`!EntryPoint.dist` attribute (as different :class:`!Distribution` instances do not currently compare equal, even if they have the same attributes)
pt_pt: Nota: atualmente não é possível consultar pontos de entrada com base no seu atributo :attr:`!EntryPoint.dist` (uma vez que diferentes instâncias de :class:`!Distribution` atualmente não são comparadas como iguais, mesmo que tenham os mesmos atributos).
sv: Obs: det är för närvarande inte möjligt att fråga efter entry points baserat på deras :attr:`!EntryPoint.dist`-attribut (eftersom olika :class:`!Distribution`-instanser för närvarande inte jämförs lika, även om de har samma attribut)

source: Details of a collection of installed entry points.
pt_pt: Detalhes de uma coleção de pontos de entrada instalados.
sv: Detaljer om en samling installerade inmatningspunkter.

source: Also provides a ``.groups`` attribute that reports all identified entry point groups, and a ``.names`` attribute that reports all identified entry point names.
pt_pt: Também fornece um atributo ``.groups`` que reporta todos os grupos de pontos de entrada identificados, e um atributo ``.names`` que reporta todos os nomes de pontos de entrada identificados.
sv: Innehåller även attributet ``.groups`` som rapporterar alla identifierade grupper av entrépunkter och attributet ``.names`` som rapporterar alla identifierade namn på entrépunkter.

source: Details of an installed entry point.
pt_pt: Detalhes de um ponto de entrada instalado.
sv: Detaljer om en installerad ingångspunkt.

source: Each :class:`!EntryPoint` instance has ``.name``, ``.group``, and ``.value`` attributes and a ``.load()`` method to resolve the value. There are also ``.module``, ``.attr``, and ``.extras`` attributes for getting the components of the ``.value`` attribute, and ``.dist`` for obtaining information regarding the distribution package that provides the entry point.
pt_pt: Cada instância :class:`!EntryPoint` tem atributos ``.name``, ``.group``, e ``.value`` e um método ``.load()`` para resolver o valor. Também existem atributos ``.module``, ``.attr``, e ``.extras`` para obter os componentes do atributo ``.value``, e ``.dist`` para obter informações sobre o pacote de distribuição que fornece o ponto de entrada.
sv: Varje :class:`!EntryPoint`-instans har attributen ``.name``, ``.group`` och ``.value`` och en ``.load()``-metod för att lösa upp värdet. Det finns också attributen ``.module``, ``.attr`` och ``.extras`` för att hämta komponenterna i attributet ``.value`` och ``.dist`` för att hämta information om det distributionspaket som tillhandahåller entrypointen.

source: Query all entry points::
pt_pt: Consultar todos os pontos de entrada::
sv: Fråga alla inmatningspunkter::

source: The :func:`!entry_points` function returns a :class:`!EntryPoints` object, a collection of all :class:`!EntryPoint` objects with ``names`` and ``groups`` attributes for convenience::
pt_pt: A função :func:`!entry_points` retorna um objeto :class:`!EntryPoints`, uma coleção de todos os objetos :class:`!EntryPoint` com atributos ``names`` e ``groups`` para conveniência::
sv: Funktionen :func:`!entry_points` returnerar ett :class:`!EntryPoints`\-objekt, en samling av alla :class:`!EntryPoint`\-objekt med attributen ``names`` och ``groups`` för enkelhetens skull::

source: :class:`!EntryPoints` has a :meth:`!select` method to select entry points matching specific properties. Select entry points in the ``console_scripts`` group::
pt_pt: :class:`!EntryPoints` tem um método :meth:`!select` para selecionar pontos de entrada que correspondem a propriedades específicas. Selecione pontos de entrada no grupo ``console_scripts``::
sv: :class:`!EntryPoints` har en :meth:`!select`-metod för att välja entrypunkter som matchar specifika egenskaper. Välj ingångspunkter i gruppen ``console_scripts``::

source: Equivalently, since :func:`!entry_points` passes keyword arguments through to select::
pt_pt: Equivalentemente, uma vez que :func:`!entry_points` passa argumentos de palavra-chave para select::
sv: På motsvarande sätt, eftersom :func:`!entry_points` skickar nyckelordsargument vidare till select::

source: Pick out a specific script named "wheel" (found in the wheel project)::
pt_pt: Selecionar um script específico chamado "wheel" (encontrado no projeto wheel)::
sv: Välj ut ett specifikt skript som heter "wheel" (finns i wheel-projektet)::

source: Equivalently, query for that entry point during selection::
pt_pt: Equivalentemente, consultar esse ponto de entrada durante a seleção::
sv: På motsvarande sätt, fråga efter den ingångspunkten under urvalet::

source: Inspect the resolved entry point::
pt_pt: Inspecionar o ponto de entrada resolvido::
sv: Inspektera den lösta ingångspunkten::

source: The ``group`` and ``name`` are arbitrary values defined by the package author and usually a client will wish to resolve all entry points for a particular group. Read `the setuptools docs <https://setuptools.pypa.io/en/latest/userguide/entry_point.html>`_ for more information on entry points, their definition, and usage.
sv: ``group`` och ``name`` är godtyckliga värden som definieras av paketets författare och vanligtvis kommer en klient att vilja lösa alla ingångspunkter för en viss grupp. Läs `the setuptools docs <https://setuptools.pypa.io/en/latest/userguide/entry_point.html>`_ för mer information om ingångspunkter, deras definition och användning.

source: The "selectable" entry points were introduced in ``importlib_metadata`` 3.6 and Python 3.10. Prior to those changes, ``entry_points`` accepted no parameters and always returned a dictionary of entry points, keyed by group. With ``importlib_metadata`` 5.0 and Python 3.12, ``entry_points`` always returns an ``EntryPoints`` object. See :pypi:`backports.entry_points_selectable` for compatibility options.
pt_pt: Os pontos de entrada "selecionáveis" foram introduzidos em ``importlib_metadata`` 3.6 e Python 3.10. Antes dessas alterações, ``entry_points`` não aceitava parâmetros e sempre retornava um dicionário de pontos de entrada, indexado por grupo. Com ``importlib_metadata`` 5.0 e Python 3.12, ``entry_points`` sempre retorna um objeto ``EntryPoints``. Veja :pypi:`backports.entry_points_selectable` para opções de compatibilidade.
sv: De "valbara" ingångspunkterna introducerades i ``importlib_metadata`` 3.6 och Python 3.10. Före dessa ändringar accepterade ``entry_points`` inga parametrar och returnerade alltid en ordbok med ingångspunkter, med grupp som nyckel. Med ``importlib_metadata`` 5.0 och Python 3.12 returnerar ``entry_points`` alltid ett ``EntryPoints``\-objekt. Se :pypi:`backports.entry_points_selectable` för kompatibilitetsalternativ.

source: ``EntryPoint`` objects no longer present a tuple-like interface (:meth:`~object.__getitem__`).
sv: ``EntryPoint``\-objekt har inte längre ett tuple-liknande gränssnitt (:meth:`~object.__getitem__`).

source: Distribution metadata
pt_pt: Metadados de distribuição
sv: Metadata för distribution

source: Return the distribution metadata corresponding to the named distribution package as a :class:`PackageMetadata` instance.
pt_pt: Retorna os metadados de distribuição correspondentes ao pacote de distribuição nomeado como uma instância :class:`PackageMetadata`.
sv: Returnerar distributionsmetadata som motsvarar det angivna distributionspaketet som en instans av :class:`PackageMetadata`.

source: Raises :exc:`PackageNotFoundError` if the named distribution package is not installed in the current Python environment.
pt_pt: Levanta :exc:`PackageNotFoundError` se o pacote de distribuição nomeado não estiver instalado no ambiente Python atual.
sv: Utlöser :exc:`PackageNotFoundError` om det angivna distributionspaketet inte är installerat i den aktuella Python-miljön.

source: A concrete implementation of the `PackageMetadata protocol <https://importlib-metadata.readthedocs.io/en/latest/api.html#importlib_metadata.PackageMetadata>`_.
pt_pt: Uma implementação concreta do `protocolo PackageMetadata <https://importlib-metadata.readthedocs.io/en/latest/api.html#importlib_metadata.PackageMetadata>`_.
sv: En konkret implementering av `PackageMetadata-protokollet <https://importlib-metadata.readthedocs.io/en/latest/api.html#importlib_metadata.PackageMetadata>`_.

source: In addition to providing the defined protocol methods and attributes, subscripting the instance is equivalent to calling the :meth:`!get` method.
pt_pt: Além de fornecer os métodos e atributos definidos pelo protocolo, a indexação da instância é equivalente a chamar o método :meth:`!get`.
sv: Förutom att tillhandahålla de definierade protokollmetoderna och -attributen, motsvarar subskription av instansen anrop av metoden :meth:`!get`.

source: Every `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ includes some metadata, which you can extract using the :func:`!metadata` function::
pt_pt: Todo o `Pacote de Distribuição <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ inclui alguns metadados, que pode extrair usando a função :func:`!metadata`::
sv: Varje `Distributionspaket <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ innehåller en del metadata, som du kan extrahera med hjälp av funktionen :func:`!metadata`::

source: The keys of the returned data structure name the metadata keywords, and the values are returned unparsed from the distribution metadata::
pt_pt: As chaves da estrutura de dados retornada nomeiam as palavras-chave de metadados, e os valores são retornados não analisados dos metadados de distribuição::
sv: Nycklarna i den returnerade datastrukturen namnger nyckelorden i metadata och värdena returneras oanalyserade från distributionsmetadata::

source: :class:`PackageMetadata` also presents a :attr:`!json` attribute that returns all the metadata in a JSON-compatible form per :PEP:`566`::
pt_pt: :class:`PackageMetadata` também apresenta um atributo :attr:`!json` que retorna todos os metadados numa forma compatível com JSON de acordo com :PEP:`566`::
sv: :class:`PackageMetadata` har också ett :attr:`!json`-attribut som returnerar alla metadata i JSON-kompatibel form enligt :PEP:`566`::

source: The full set of available metadata is not described here. See the PyPA `Core metadata specification <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_ for additional details.
pt_pt: O conjunto completo de metadados disponíveis não é descrito aqui. Consulte a especificação de metadados principais do PyPA <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_ para detalhes adicionais.
sv: Den fullständiga uppsättningen tillgängliga metadata beskrivs inte här. Se PyPA:s `Core metadata specification <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_ för ytterligare detaljer.

source: The ``Description`` is now included in the metadata when presented through the payload. Line continuation characters have been removed.
pt_pt: A ``Description`` agora está incluída nos metadados quando apresentada através da carga útil. Os caracteres de continuação de linha foram removidos.
sv: ``Description`` ingår nu i metadata när den presenteras genom nyttolasten. Radernas fortsättningstecken har tagits bort.

source: The ``json`` attribute was added.
pt_pt: O atributo ``json`` foi adicionado.
sv: Attributet ``json`` har lagts till.

source: Distribution versions
pt_pt: Versões de distribuição
sv: Distribution av versioner

source: Return the installed distribution package `version <https://packaging.python.org/en/latest/specifications/core-metadata/#version>`__ for the named distribution package.
pt_pt: Retorna a `versão <https://packaging.python.org/en/latest/specifications/core-metadata/#version>`__ do pacote de distribuição instalado para o pacote de distribuição nomeado.
sv: Returnerar det installerade distributionspaketet `version <https://packaging.python.org/en/latest/specifications/core-metadata/#version>`__ för det angivna distributionspaketet.

source: The :func:`!version` function is the quickest way to get a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_'s version number, as a string::
pt_pt: A função :func:`!version` é a forma mais rápida de obter o número de versão de um `Pacote de Distribuição <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, como uma string::
sv: Funktionen :func:`!version` är det snabbaste sättet att få ett `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_:s versionsnummer, som en sträng::

source: Distribution files
pt_pt: Ficheiros de distribuição
sv: Distributionsfiler

source: Return the full set of files contained within the named distribution package.
pt_pt: Retorna o conjunto completo de ficheiros contidos no pacote de distribuição nomeado.
sv: Returnerar den fullständiga uppsättningen filer som ingår i det namngivna distributionspaketet.

source: Returns :const:`None` if the distribution is found but the installation database records reporting the files associated with the distribution package are missing.
sv: Returnerar :const:`None` om distributionen hittas men installationsdatabasen rapporterar att de filer som är associerade med distributionspaketet saknas.

source: A :class:`pathlib.PurePath` derived object with additional ``dist``, ``size``, and ``hash`` properties corresponding to the distribution package's installation metadata for that file.
pt_pt: Um objeto derivado de :class:`pathlib.PurePath` com propriedades adicionais ``dist``, ``size``, e ``hash`` correspondentes aos metadados de instalação do pacote de distribuição para esse ficheiro.
sv: Ett :class:`pathlib.PurePath`-deriverat objekt med ytterligare ``dist``-, ``size``- och ``hash``-egenskaper som motsvarar distributionspaketets installationsmetadata för den filen.
