Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.po
Languages: pt_pt, ru

source: Reads *path* as a binary file and returns the bytes from it.
pt_pt: Lê *path* como um ficheiro binário e retorna os bytes do mesmo.
ru: Считывает *path* как двоичный файл и возвращает из него байты.

source: An abstract base class for implementing source (and optionally bytecode) file loading. The class inherits from both :class:`ResourceLoader` and :class:`ExecutionLoader`, requiring the implementation of:
pt_pt: Uma classe base abstrata para implementar o carregamento de ficheiros de origem (e opcionalmente bytecode). A classe herda de :class:`ResourceLoader` e :class:`ExecutionLoader`, exigindo a implementação de:
ru: Абстрактный базовый класс для реализации загрузки исходного файла (и, возможно, байт-кода). Класс наследует как :class:`ResourceLoader`, так и :class:`ExecutionLoader`, что требует реализации:

source: Should only return the path to the source file; sourceless loading is not supported.
pt_pt: Deve retornar apenas o caminho para o ficheiro de origem; o carregamento sem origem não é suportado.
ru: Должен возвращать только путь к исходному файлу; Загрузка без исходного кода не поддерживается.

source: The abstract methods defined by this class are to add optional bytecode file support. Not implementing these optional methods (or causing them to raise :exc:`NotImplementedError`) causes the loader to only work with source code. Implementing the methods allows the loader to work with source *and* bytecode files; it does not allow for *sourceless* loading where only bytecode is provided. Bytecode files are an optimization to speed up loading by removing the parsing step of Python's compiler, and so no bytecode-specific API is exposed.
pt_pt: Os métodos abstratos definidos por esta classe são para adicionar suporte opcional a ficheiros de bytecode. Não implementar estes métodos opcionais (ou fazê-los levantar :exc:`NotImplementedError`) faz com que o *loader* funcione apenas com código-fonte. Implementar os métodos permite que o *loader* trabalhe com ficheiros de origem *e* bytecode; não permite carregamento *sem origem* onde apenas bytecode é fornecido. Os ficheiros de bytecode são uma otimização para acelerar o carregamento, removendo a etapa de análise do compilador do Python, e, portanto, nenhuma API específica de bytecode é exposta.
ru: Абстрактные методы, определенные этим классом, предназначены для добавления дополнительной поддержки файлов байт-кода. Если не реализовать эти необязательные методы (или заставить их вызвать :exc:`NotImplementedError`), загрузчик будет работать только с исходным кодом. Реализация методов позволяет загрузчику работать с исходными *и* файлами байт-кода; он не позволяет загружать *без исходного кода*, где предоставляется только байт-код. Файлы байт-кода представляют собой оптимизацию для ускорения загрузки за счет удаления этапа анализа компилятора Python, поэтому API, специфичный для байт-кода, не предоставляется.

source: Optional abstract method which returns a :class:`dict` containing metadata about the specified path. Supported dictionary keys are:
pt_pt: Método abstrato opcional que retorna um :class:`dict` contendo metadados sobre o caminho especificado. As chaves suportadas no dicionário são:
ru: Необязательный абстрактный метод, который возвращает :class:`dict`, содержащий метаданные об указанном пути. Поддерживаемые ключи словаря:

source: ``'mtime'`` (mandatory): an integer or floating-point number representing the modification time of the source code;
pt_pt: ``'mtime'`` (obrigatório): um número inteiro ou de ponto flutuante que representa o tempo de modificação do código-fonte;
ru: ``'mtime'`` (обязательный): целое число или число с плавающей запятой, представляющее время модификации исходного кода;

source: ``'size'`` (optional): the size in bytes of the source code.
pt_pt: ``'size'`` (opcional): o tamanho em bytes do código-fonte.
ru: ``'размер'`` (необязательно): размер исходного кода в байтах.

source: Any other keys in the dictionary are ignored, to allow for future extensions. If the path cannot be handled, :exc:`OSError` is raised.
pt_pt: Quaisquer outras chaves no dicionário são ignoradas, para permitir extensões futuras. Se o caminho não puder ser tratado, :exc:`OSError` é levantado.
ru: Любые другие ключи в словаре игнорируются, чтобы обеспечить возможность будущих расширений. Если путь не может быть обработан, возникает :exc:`OSError`.

source: Raise :exc:`OSError` instead of :exc:`NotImplementedError`.
pt_pt: Levanta :exc:`OSError` em vez de :exc:`NotImplementedError`.
ru: Поднимите :exc:`OSError` вместо :exc:`NotImplementedError`.

source: Optional abstract method which returns the modification time for the specified path.
pt_pt: Método abstrato opcional que retorna o tempo de modificação para o caminho especificado.
ru: Необязательный абстрактный метод, который возвращает время изменения указанного пути.

source: This method is deprecated in favour of :meth:`path_stats`. You don't have to implement it, but it is still available for compatibility purposes. Raise :exc:`OSError` if the path cannot be handled.
pt_pt: Este método está obsoleto em favor de :meth:`path_stats`. Não precisa de o implementar, mas ainda está disponível por razões de compatibilidade. Levante :exc:`OSError` se o caminho não puder ser tratado.
ru: Этот метод устарел в пользу :meth:`path_stats`. Вам не обязательно его реализовывать, но он все равно доступен в целях совместимости. Поднимите :exc:`OSError`, если путь не может быть обработан.

source: Optional abstract method which writes the specified bytes to a file path. Any intermediate directories which do not exist are to be created automatically.
pt_pt: Método abstrato opcional que escreve os bytes especificados para um caminho de ficheiro. Quaisquer diretórios intermédios que não existam devem ser criados automaticamente.
ru: Необязательный абстрактный метод, который записывает указанные байты в путь к файлу. Все несуществующие промежуточные каталоги должны создаваться автоматически.

source: When writing to the path fails because the path is read-only (:const:`errno.EACCES`/:exc:`PermissionError`), do not propagate the exception.
pt_pt: Quando a escrita para o caminho falha porque o caminho é de apenas leitura (:const:`errno.EACCES`/:exc:`PermissionError`), não propague a exceção.
ru: Если запись по пути не удалась, поскольку путь доступен только для чтения (:const:`errno.EACCES`/:exc:`PermissionError`), не распространяйте исключение.

source: No longer raises :exc:`NotImplementedError` when called.
pt_pt: Já não levanta :exc:`NotImplementedError` quando chamado.
ru: Больше не вызывает :exc:`NotImplementedError` при вызове.

source: Concrete implementation of :meth:`InspectLoader.get_code`.
pt_pt: Implementação concreta de :meth:`InspectLoader.get_code`.
ru: Конкретная реализация :meth:`InspectLoader.get_code`.

source: Concrete implementation of :meth:`Loader.exec_module`.
pt_pt: Implementação concreta de :meth:`Loader.exec_module`.
ru: Конкретная реализация :meth:`Loader.exec_module`.

source: Concrete implementation of :meth:`Loader.load_module`.
pt_pt: Implementação concreta de :meth:`Loader.load_module`.
ru: Конкретная реализация :meth:`Loader.load_module`.

source: Use :meth:`exec_module` instead.
pt_pt: Use :meth:`exec_module` em vez disso.
ru: Вместо этого используйте :meth:`exec_module`.

source: Concrete implementation of :meth:`InspectLoader.get_source`.
pt_pt: Implementação concreta de :meth:`InspectLoader.get_source`.
ru: Конкретная реализация :meth:`InspectLoader.get_source`.

source: Concrete implementation of :meth:`InspectLoader.is_package`. A module is determined to be a package if its file path (as provided by :meth:`ExecutionLoader.get_filename`) is a file named ``__init__`` when the file extension is removed **and** the module name itself does not end in ``__init__``.
pt_pt: Implementação concreta de :meth:`InspectLoader.is_package`. Um módulo é determinado como sendo um pacote se o seu caminho de ficheiro (conforme fornecido por :meth:`ExecutionLoader.get_filename`) for um ficheiro chamado ``__init__`` quando a extensão do ficheiro é removida **e** o nome do módulo em si não terminar em ``__init__``.
ru: Конкретная реализация :meth:`InspectLoader.is_package`. Модуль определяется как пакет, если его путь к файлу (как предоставлено :meth:`ExecutionLoader.get_filename`) представляет собой файл с именем ``__init__``, когда расширение файла удалено **и** само имя модуля не заканчиваться на ``__init__``.

source: An :term:`abstract base class` to provide the ability to read *resources*.
pt_pt: Uma :term:`classe base abstrata` para fornecer a capacidade de ler *recursos*.
ru: :term:`абстрактный базовый класс`, обеспечивающий возможность чтения *ресурсов*.

source: From the perspective of this ABC, a *resource* is a binary artifact that is shipped within a package. Typically this is something like a data file that lives next to the ``__init__.py`` file of the package. The purpose of this class is to help abstract out the accessing of such data files so that it does not matter if the package and its data file(s) are stored e.g. in a zip file versus on the file system.
pt_pt: Na perspetiva desta ABC, um *recurso* é um artefacto binário que é distribuído dentro de um pacote. Tipicamente, isto é algo como um ficheiro de dados que reside ao lado do ficheiro ``__init__.py`` do pacote. O propósito desta classe é ajudar a abstrair o acesso a tais ficheiros de dados, de modo que não importa se o pacote e os seus ficheiros de dados estão armazenados, por exemplo, num ficheiro zip ou no sistema de ficheiros.
ru: :term:`абстрактный базовый класс`, обеспечивающий возможность чтения *ресурсов*.

source: For any of methods of this class, a *resource* argument is expected to be a :term:`path-like object` which represents conceptually just a file name. This means that no subdirectory paths should be included in the *resource* argument. This is because the location of the package the reader is for, acts as the "directory". Hence the metaphor for directories and file names is packages and resources, respectively. This is also why instances of this class are expected to directly correlate to a specific package (instead of potentially representing multiple packages or a module).
pt_pt: Para qualquer um dos métodos desta classe, espera-se que o argumento *resource* seja um :term:`objeto tipo caminho` que representa conceitualmente apenas um nome de ficheiro. Isto significa que não devem ser incluídos caminhos de subdiretórios no argumento *resource*. Isto porque a localização do pacote para o qual o leitor é destinado atua como o "diretório". Daí que a metáfora para diretórios e nomes de ficheiros são pacotes e recursos, respetivamente. É também por isso que se espera que as instâncias desta classe se correlacionem diretamente com um pacote específico (em vez de potencialmente representar vários pacotes ou um módulo).
ru: Для любого метода этого класса ожидается, что аргумент *resource* будет объектом, похожим на путь, который концептуально представляет собой просто имя файла. Это означает, что в аргумент *resource* не следует включать пути к подкаталогам. Это связано с тем, что местоположение пакета, для которого предназначено устройство чтения, действует как «каталог». Следовательно, метафорой имен каталогов и файлов являются пакеты и ресурсы соответственно. Именно поэтому ожидается, что экземпляры этого класса будут напрямую соотноситься с конкретным пакетом (вместо того, чтобы потенциально представлять несколько пакетов или модуля).

source: Loaders that wish to support resource reading are expected to provide a method called ``get_resource_reader(fullname)`` which returns an object implementing this ABC's interface. If the module specified by fullname is not a package, this method should return :const:`None`. An object compatible with this ABC should only be returned when the specified module is a package.
pt_pt: Os *loaders* que pretendem suportar a leitura de recursos devem fornecer um método chamado ``get_resource_reader(fullname)`` que retorna um objeto que implementa a interface desta ABC. Se o módulo especificado por *fullname* não for um pacote, este método deve retornar :const:`None`. Um objeto compatível com esta ABC só deve ser retornado quando o módulo especificado for um pacote.
ru: Ожидается, что загрузчики, желающие поддерживать чтение ресурсов, предоставят метод get_resource_reader(fullname), который возвращает объект, реализующий этот интерфейс ABC. Если модуль, указанный полным именем, не является пакетом, этот метод должен вернуть :const:`None`. Объект, совместимый с этим ABC, должен быть возвращен только в том случае, если указанный модуль является пакетом.

source: Use :class:`importlib.resources.abc.TraversableResources` instead.
pt_pt: Use :class:`importlib.resources.abc.TraversableResources` em vez disso.
ru: Вместо этого используйте :class:`importlib.resources.abc.TraversableResources`.

source: Returns an opened, :term:`file-like object` for binary reading of the *resource*.
pt_pt: Retorna um objeto :term:`tipo ficheiro` aberto para leitura binária do *recurso*.
ru: Возвращает открытый :term:`файлоподобный объект` для двоичного чтения *ресурса*.

source: If the resource cannot be found, :exc:`FileNotFoundError` is raised.
pt_pt: Se o recurso não puder ser encontrado, :exc:`FileNotFoundError` é levantado.
ru: Если ресурс не может быть найден, возникает :exc:`FileNotFoundError`.

source: Returns the file system path to the *resource*.
pt_pt: Retorna o caminho do sistema de ficheiros para o *recurso*.
ru: Возвращает путь файловой системы к *ресурсу*.

source: If the resource does not concretely exist on the file system, raise :exc:`FileNotFoundError`.
pt_pt: Se o recurso não existir concretamente no sistema de ficheiros, levante :exc:`FileNotFoundError`.
ru: Если ресурс конкретно не существует в файловой системе, поднимите :exc:`FileNotFoundError`.

source: Returns ``True`` if the named *name* is considered a resource. :exc:`FileNotFoundError` is raised if *name* does not exist.
pt_pt: Retorna ``True`` se o *name* nomeado for considerado um recurso. :exc:`FileNotFoundError` é levantado se *name* não existir.
ru: Возвращает ``True``, если именованное *имя* считается ресурсом. :exc:`FileNotFoundError` возникает, если *name* не существует.

source: Returns an :term:`iterable` of strings over the contents of the package. Do note that it is not required that all names returned by the iterator be actual resources, e.g. it is acceptable to return names for which :meth:`is_resource` would be false.
pt_pt: Retorna um :term:`iterável` de strings sobre os conteúdos do pacote. Note que não é obrigatório que todos os nomes retornados pelo iterador sejam recursos reais, por exemplo, é aceitável retornar nomes para os quais :meth:`is_resource` seria falso.
ru: Возвращает :term:`iterable` строк по содержимому пакета. Обратите внимание, что не обязательно, чтобы все имена, возвращаемые итератором, были реальными ресурсами, например, допустимо возвращать имена, для которых :meth:`is_resource` будет ложным.

source: Allowing non-resource names to be returned is to allow for situations where how a package and its resources are stored are known a priori and the non-resource names would be useful. For instance, returning subdirectory names is allowed so that when it is known that the package and resources are stored on the file system then those subdirectory names can be used directly.
pt_pt: Permitir que nomes não-recurso sejam retornados é para permitir situações em que a forma como um pacote e os seus recursos são armazenados são conhecidos *a priori* e os nomes não-recurso seriam úteis. Por exemplo, retornar nomes de subdiretórios é permitido para que, quando se sabe que o pacote e os recursos estão armazenados no sistema de ficheiros, esses nomes de subdiretórios possam ser usados diretamente.
ru: Разрешить возврат имен, не являющихся ресурсами, необходимо для ситуаций, когда способ хранения пакета и его ресурсов известен априори и имена, не относящиеся к ресурсам, могут оказаться полезными. Например, разрешен возврат имен подкаталогов, чтобы, когда известно, что пакет и ресурсы хранятся в файловой системе, эти имена подкаталогов можно было использовать напрямую.

source: The abstract method returns an iterable of no items.
pt_pt: O método abstrato retorna um iterável sem itens.
ru: Абстрактный метод возвращает итерацию без элементов.

source: An object with a subset of :class:`pathlib.Path` methods suitable for traversing directories and opening files.
pt_pt: Um objeto com um subconjunto de métodos :class:`pathlib.Path` adequados para percorrer diretórios e abrir ficheiros.
ru: Объект с подмножеством методов :class:`pathlib.Path`, подходящих для перемещения по каталогам и открытия файлов.

source: For a representation of the object on the file-system, use :meth:`importlib.resources.as_file`.
pt_pt: Para uma representação do objeto no sistema de ficheiros, use :meth:`importlib.resources.as_file`.
ru: Для представления объекта в файловой системе используйте :meth:`importlib.resources.as_file`.

source: Use :class:`importlib.resources.abc.Traversable` instead.
pt_pt: Use :class:`importlib.resources.abc.Traversable` em vez disso.
ru: Вместо этого используйте :class:`importlib.resources.abc.Traversable`.

source: Abstract. The base name of this object without any parent references.
pt_pt: Abstrato. O nome base deste objeto sem quaisquer referências pai.
ru: Абстрактный. Базовое имя этого объекта без каких-либо родительских ссылок.

source: Yield ``Traversable`` objects in ``self``.
pt_pt: Produz objetos ``Traversable`` em ``self``.
ru: Выдавать ``Traversable`` объекты в ``self``.

source: Return ``True`` if ``self`` is a directory.
pt_pt: Retorna ``True`` se ``self`` for um diretório.
ru: Верните True, если self — это каталог.

source: Return ``True`` if ``self`` is a file.
pt_pt: Retorna ``True`` se ``self`` for um ficheiro.
ru: Верните True, если self — это файл.

source: Return Traversable child in ``self``.
pt_pt: Retorna o filho Traversable em ``self``.
ru: Вернуть проходимого дочернего элемента в ``self``.

source: Return ``Traversable`` child in ``self``.
pt_pt: Retorna o filho ``Traversable`` em ``self``.
ru: Вернуть дочерний элемент «Traversable» в «self».

source: *mode* may be 'r' or 'rb' to open as text or binary. Return a handle suitable for reading (same as :attr:`pathlib.Path.open`).
pt_pt: *mode* pode ser 'r' ou 'rb' para abrir como texto ou binário. Retorna uma manipulação adequada para leitura (igual a :attr:`pathlib.Path.open`).
ru: *mode* может иметь значение «r» или «rb», чтобы открыть его в текстовом или двоичном виде. Возвращает дескриптор, подходящий для чтения (аналогично :attr:`pathlib.Path.open`).

source: When opening as text, accepts encoding parameters such as those accepted by :class:`io.TextIOWrapper`.
pt_pt: Ao abrir como texto, aceita parâmetros de codificação como os aceites por :class:`io.TextIOWrapper`.
ru: При открытии в виде текста принимает параметры кодирования, подобные тем, которые принимаются :class:`io.TextIOWrapper`.

source: Read contents of ``self`` as bytes.
pt_pt: Lê o conteúdo de ``self`` como bytes.
ru: Считайте содержимое ``self`` в байтах.

source: Read contents of ``self`` as text.
pt_pt: Lê o conteúdo de ``self`` como texto.
ru: Прочитайте содержимое ``self`` как текст.

source: An abstract base class for resource readers capable of serving the :meth:`importlib.resources.files` interface. Subclasses :class:`importlib.resources.abc.ResourceReader` and provides concrete implementations of the :class:`importlib.resources.abc.ResourceReader`'s abstract methods. Therefore, any loader supplying :class:`importlib.abc.TraversableResources` also supplies ResourceReader.
pt_pt: Uma classe base abstrata para leitores de recursos capazes de servir a interface :meth:`importlib.resources.files`. As subclasses de :class:`importlib.resources.abc.ResourceReader` fornecem implementações concretas dos métodos abstratos de :class:`importlib.resources.abc.ResourceReader`. Portanto, qualquer *loader* que forneça :class:`importlib.abc.TraversableResources` também fornece ResourceReader.
ru: Абстрактный базовый класс для чтения ресурсов, способный обслуживать интерфейс :meth:`importlib.resources.files`. Подклассы :class:`importlib.resources.abc.ResourceReader` и предоставляют конкретные реализации абстрактных методов :class:`importlib.resources.abc.ResourceReader`. Следовательно, любой загрузчик, предоставляющий :class:`importlib.abc.TraversableResources`, также предоставляет ResourceReader.

source: Loaders that wish to support resource reading are expected to implement this interface.
pt_pt: Os *loaders* que pretendem suportar a leitura de recursos devem implementar esta interface.
ru: Ожидается, что загрузчики, желающие поддерживать чтение ресурсов, реализуют этот интерфейс.

source: Returns a :class:`importlib.resources.abc.Traversable` object for the loaded package.
pt_pt: Retorna um objeto :class:`importlib.resources.abc.Traversable` para o pacote carregado.
ru: Возвращает объект :class:`importlib.resources.abc.Traversable` для загруженного пакета.

source: :mod:`importlib.machinery` -- Importers and path hooks
pt_pt: :mod:`importlib.machinery` — Importadores e ganchos de caminho
ru: :mod:`importlib.machinery` -- Импортеры и перехватчики пути

source: **Source code:** :source:`Lib/importlib/machinery.py`
pt_pt: **Código-fonte:** :source:`Lib/importlib/machinery.py`
ru: **Исходный код:** :source:`Lib/importlib/machinery.py`

source: This module contains the various objects that help :keyword:`import` find and load modules.
pt_pt: Este módulo contém vários objetos que ajudam :keyword:`import` a encontrar e carregar módulos.
ru: Этот модуль содержит различные объекты, которые помогают :keyword:`import` находить и загружать модули.

source: A list of strings representing the recognized file suffixes for source modules.
pt_pt: Uma lista de strings que representam os sufixos de ficheiros reconhecidos para módulos de origem.
ru: Список строк, представляющих распознанные суффиксы файлов для исходных модулей.

source: A list of strings representing the file suffixes for non-optimized bytecode modules.
pt_pt: Uma lista de strings que representam os sufixos de ficheiros para módulos de bytecode não otimizados.
ru: Список строк, представляющих суффиксы файлов для неоптимизированных модулей байт-кода.

source: Use :const:`BYTECODE_SUFFIXES` instead.
pt_pt: Use :const:`BYTECODE_SUFFIXES` em vez disso.
ru: Вместо этого используйте :const:`BYTECODE_SUFFIXES`.

source: A list of strings representing the file suffixes for optimized bytecode modules.
pt_pt: Uma lista de strings que representam os sufixos de ficheiros para módulos de bytecode otimizados.
ru: Список строк, представляющих суффиксы файлов для оптимизированных модулей байт-кода.

source: A list of strings representing the recognized file suffixes for bytecode modules (including the leading dot).
pt_pt: Uma lista de strings que representam os sufixos de ficheiros reconhecidos para módulos de bytecode (incluindo o ponto inicial).
ru: Список строк, представляющих распознанные суффиксы файлов для модулей байт-кода (включая начальную точку).

source: The value is no longer dependent on ``__debug__``.
pt_pt: O valor já não depende de ``__debug__``.
ru: Значение больше не зависит от ``__debug__``.

source: A list of strings representing the recognized file suffixes for extension modules.
pt_pt: Uma lista de strings que representam os sufixos de ficheiros reconhecidos para módulos de extensão.
ru: Список строк, представляющих распознанные суффиксы файлов для модулей расширения.
