Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.po
Languages: pt_pt, ru

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. If this is a top-level import, *path* will be ``None``. Otherwise, this is a search for a subpackage or module and *path* will be the value of :attr:`~module.__path__` from the parent package. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``MetaPathFinders``.
pt_pt: Um método abstrato para encontrar uma :term:`especificação <module spec>` para o módulo especificado. Se esta for uma importação de nível superior, *path* será ``None``. Caso contrário, esta é uma pesquisa por um subpacote ou módulo e *path* será o valor de :attr:`~module.__path__` do pacote pai. Se uma especificação não puder ser encontrada, ``None`` é retornado. Quando passado, ``target`` é um objeto módulo que o *finder* pode usar para fazer uma suposição mais informada sobre que especificação retornar. :func:`importlib.util.spec_from_loader` pode ser útil para implementar ``MetaPathFinders`` concretos.
ru: Абстрактный метод для поиска :term:`spec <module spec>` для указанного модуля. Если это импорт верхнего уровня, *path* будет ``None``. В противном случае это поиск подпакета или модуля, и *path* будет значением :attr:`~module.__path__` из родительского пакета. Если спецификация не может быть найдена, возвращается None. При передаче ``target`` представляет собой объект модуля, который искатель может использовать, чтобы сделать более обоснованное предположение о том, какую спецификацию вернуть. :func:`importlib.util.spec_from_loader` может быть полезен для реализации конкретных ``MetaPathFinders``.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :func:`importlib.invalidate_caches` when invalidating the caches of all finders on :data:`sys.meta_path`.
pt_pt: Um método opcional que, quando chamado, deve invalidar qualquer cache interna usada pelo *finder*. Usado por :func:`importlib.invalidate_caches` ao invalidar as caches de todos os *finders* em :data:`sys.meta_path`.
ru: Необязательный метод, который при вызове должен аннулировать любой внутренний кеш, используемый искателем. Используется :func:`importlib.invalidate_caches` при аннулировании кешей всех средств поиска в :data:`sys.meta_path`.

source: Returns ``None`` when called instead of :data:`NotImplemented`.
pt_pt: Retorna ``None`` quando chamado em vez de :data:`NotImplemented`.
ru: Возвращает None при вызове вместо :data:`NotImplemented`.

source: An abstract base class representing a :term:`path entry finder`. Though it bears some similarities to :class:`MetaPathFinder`, ``PathEntryFinder`` is meant for use only within the path-based import subsystem provided by :class:`importlib.machinery.PathFinder`.
pt_pt: Uma classe base abstrata que representa um :term:`path entry finder`. Embora tenha algumas semelhanças com :class:`MetaPathFinder`, ``PathEntryFinder`` é destinado a ser usado apenas no subsistema de importação baseado em caminho fornecido por :class:`importlib.machinery.PathFinder`.
ru: Абстрактный базовый класс, представляющий :term:`поиск записей пути`. Хотя он имеет некоторое сходство с :class:`MetaPathFinder`, ``PathEntryFinder`` предназначен для использования только в подсистеме импорта на основе пути, предоставляемой :class:`importlib.machinery.PathFinder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. The finder will search for the module only within the :term:`path entry` to which it is assigned. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``PathEntryFinders``.
pt_pt: Um método abstrato para encontrar uma :term:`especificação <module spec>` para o módulo especificado. O *finder* pesquisará o módulo apenas dentro da :term:`entrada de caminho` a que está atribuído. Se uma especificação não puder ser encontrada, ``None`` é retornado. Quando passado, ``target`` é um objeto módulo que o *finder* pode usar para fazer uma suposição mais informada sobre que especificação retornar. :func:`importlib.util.spec_from_loader` pode ser útil para implementar ``PathEntryFinders`` concretos.
ru: Абстрактный метод для поиска :term:`spec <module spec>` для указанного модуля. Средство поиска будет искать модуль только в пределах записи пути, которой он назначен. Если спецификация не может быть найдена, возвращается None. При передаче ``target`` представляет собой объект модуля, который искатель может использовать, чтобы сделать более обоснованное предположение о том, какую спецификацию вернуть. :func:`importlib.util.spec_from_loader` может быть полезен для реализации конкретных ``PathEntryFinders``.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :meth:`importlib.machinery.PathFinder.invalidate_caches` when invalidating the caches of all cached finders.
pt_pt: Um método opcional que, quando chamado, deve invalidar qualquer cache interna usada pelo *finder*. Usado por :meth:`importlib.machinery.PathFinder.invalidate_caches` ao invalidar as caches de todos os *finders* em cache.
ru: Необязательный метод, который при вызове должен аннулировать любой внутренний кеш, используемый искателем. Используется :meth:`importlib.machinery.PathFinder.invalidate_caches` при аннулировании кешей всех кэшированных средств поиска.

source: An abstract base class for a :term:`loader`. See :pep:`302` for the exact definition for a loader.
pt_pt: Uma classe base abstrata para um :term:`loader`. Consulte :pep:`302` para a definição exata de um *loader*.
ru: Абстрактный базовый класс для :term:`loader`. См. :pep:`302` для точного определения загрузчика.

source: Loaders that wish to support resource reading should implement a :meth:`get_resource_reader` method as specified by :class:`importlib.resources.abc.ResourceReader`.
pt_pt: Os *loaders* que pretendem suportar a leitura de recursos devem implementar um método :meth:`get_resource_reader` conforme especificado por :class:`importlib.resources.abc.ResourceReader`.
ru: Загрузчики, которые хотят поддерживать чтение ресурсов, должны реализовать метод :meth:`get_resource_reader`, как указано в :class:`importlib.resources.abc.ResourceReader`.

source: Introduced the optional :meth:`get_resource_reader` method.
pt_pt: Introduziu o método opcional :meth:`get_resource_reader`.
ru: Представлен дополнительный метод :meth:`get_resource_reader`.

source: A method that returns the module object to use when importing a module. This method may return ``None``, indicating that default module creation semantics should take place.
pt_pt: Um método que retorna o objeto módulo a usar ao importar um módulo. Este método pode retornar ``None``, indicando que as semânticas de criação de módulo predefinidas devem ser aplicadas.
ru: Метод, возвращающий объект модуля, который будет использоваться при импорте модуля. Этот метод может возвращать None, указывая, что должна быть выполнена семантика создания модуля по умолчанию.

source: This method is no longer optional when :meth:`exec_module` is defined.
pt_pt: Este método já não é opcional quando :meth:`exec_module` está definido.
ru: Этот метод больше не является необязательным, если определен :meth:`exec_module`.

source: An abstract method that executes the module in its own namespace when a module is imported or reloaded. The module should already be initialized when :meth:`exec_module` is called. When this method exists, :meth:`create_module` must be defined.
pt_pt: Um método abstrato que executa o módulo no seu próprio espaço de nomes quando um módulo é importado ou recarregado. O módulo deve já estar inicializado quando :meth:`exec_module` é chamado. Quando este método existe, :meth:`create_module` deve ser definido.
ru: Абстрактный метод, который выполняет модуль в его собственном пространстве имен при импорте или перезагрузке модуля. Модуль уже должен быть инициализирован при вызове :meth:`exec_module`. Если этот метод существует, необходимо определить :meth:`create_module`.

source: :meth:`create_module` must also be defined.
pt_pt: :meth:`create_module` também deve ser definido.
ru: :meth:`create_module` также должен быть определен.

source: A legacy method for loading a module. If the module cannot be loaded, :exc:`ImportError` is raised, otherwise the loaded module is returned.
pt_pt: Um método legado para carregar um módulo. Se o módulo não puder ser carregado, :exc:`ImportError` é levantado, caso contrário, o módulo carregado é retornado.
ru: Устаревший метод загрузки модуля. Если модуль не может быть загружен, выдается :exc:`ImportError`, в противном случае возвращается загруженный модуль.

source: If the requested module already exists in :data:`sys.modules`, that module should be used and reloaded. Otherwise the loader should create a new module and insert it into :data:`sys.modules` before any loading begins, to prevent recursion from the import. If the loader inserted a module and the load fails, it must be removed by the loader from :data:`sys.modules`; modules already in :data:`sys.modules` before the loader began execution should be left alone.
pt_pt: Se o módulo solicitado já existir em :data:`sys.modules`, esse módulo deve ser usado e recarregado. Caso contrário, o *loader* deve criar um novo módulo e inseri-lo em :data:`sys.modules` antes de qualquer carregamento começar, para evitar recursão da importação. Se o *loader* inseriu um módulo e o carregamento falhar, este deve ser removido pelo *loader* de :data:`sys.modules`; os módulos já em :data:`sys.modules` antes do início da execução do *loader* devem ser deixados como estão.
ru: Если запрошенный модуль уже существует в :data:`sys.modules`, этот модуль следует использовать и перезагрузить. В противном случае загрузчик должен создать новый модуль и вставить его в :data:`sys.modules` до начала загрузки, чтобы предотвратить рекурсию импорта. Если загрузчик вставил модуль и загрузка не удалась, загрузчик должен удалить его из :data:`sys.modules`; модули, уже находящиеся в :data:`sys.modules` до того, как загрузчик начал выполнение, следует оставить в покое.

source: The loader should set several attributes on the module (note that some of these attributes can change when a module is reloaded):
pt_pt: O *loader* deve definir vários atributos no módulo (note que alguns destes atributos podem mudar quando um módulo é recarregado):
ru: Загрузчик должен установить для модуля несколько атрибутов (обратите внимание, что некоторые из этих атрибутов могут измениться при перезагрузке модуля):

source: :attr:`module.__cached__` *(deprecated)*
ru: :attr:`module.__cached__` *(устарело)*

source: :attr:`module.__package__` *(deprecated)*
ru: :attr:`module.__package__` *(устарело)*

source: :attr:`module.__loader__` *(deprecated)*
pt_pt: :attr:`module.__loader__` *(obsoleto)*
ru: :attr:`module.__loader__` *(устарело)*

source: When :meth:`exec_module` is available then backwards-compatible functionality is provided.
pt_pt: Quando :meth:`exec_module` está disponível, a funcionalidade retrocompatível é fornecida.
ru: Когда доступен :meth:`exec_module`, обеспечивается обратно совместимая функциональность.

source: Raise :exc:`ImportError` when called instead of :exc:`NotImplementedError`. Functionality provided when :meth:`exec_module` is available.
pt_pt: Levanta :exc:`ImportError` quando chamado em vez de :exc:`NotImplementedError`. Funcionalidade fornecida quando :meth:`exec_module` está disponível.
ru: Вызовите :exc:`ImportError` при вызове вместо :exc:`NotImplementedError`. Функциональность предоставляется, когда доступен :meth:`exec_module`.

source: The recommended API for loading a module is :meth:`exec_module` (and :meth:`create_module`). Loaders should implement it instead of :meth:`load_module`. The import machinery takes care of all the other responsibilities of :meth:`load_module` when :meth:`exec_module` is implemented.
pt_pt: A API recomendada para carregar um módulo é :meth:`exec_module` (e :meth:`create_module`). Os *loaders* devem implementá-la em vez de :meth:`load_module`. A maquinaria de importação trata de todas as outras responsabilidades de :meth:`load_module` quando :meth:`exec_module` é implementado.
ru: Рекомендуемый API для загрузки модуля — :meth:`exec_module` (и :meth:`create_module`). Загрузчики должны реализовать его вместо :meth:`load_module`. Механизм импорта берет на себя все остальные обязанности :meth:`load_module` при реализации :meth:`exec_module`.

source: *Superseded by TraversableResources*
pt_pt: *Substituído por TraversableResources*
ru: *Заменено TraversableResources*

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loading arbitrary resources from the storage back-end.
pt_pt: Uma classe base abstrata para um :term:`loader` que implementa o protocolo opcional :pep:`302` para carregar recursos arbitrários do backend de armazenamento.
ru: Абстрактный базовый класс для :term:`loader`, который реализует дополнительный :pep:`302` протокол для загрузки произвольных ресурсов из серверной части хранилища.

source: An abstract method to return the bytes for the data located at *path*. Loaders that have a file-like storage back-end that allows storing arbitrary data can implement this abstract method to give direct access to the data stored. :exc:`OSError` is to be raised if the *path* cannot be found. The *path* is expected to be constructed using a module's :attr:`~module.__file__` attribute or an item from a package's :attr:`~module.__path__`.
pt_pt: Um método abstrato para retornar os bytes dos dados localizados em *path*. Os *loaders* que têm um backend de armazenamento tipo ficheiro que permite armazenar dados arbitrários podem implementar este método abstrato para dar acesso direto aos dados armazenados. :exc:`OSError` deve ser levantado se o *path* não puder ser encontrado. Espera-se que o *path* seja construído usando o atributo :attr:`~module.__file__` de um módulo ou um item de :attr:`~module.__path__` de um pacote.
ru: Абстрактный метод для возврата байтов данных, расположенных по адресу *path*. Загрузчики, имеющие файловое хранилище, позволяющее хранить произвольные данные, могут реализовать этот абстрактный метод, чтобы предоставить прямой доступ к хранимым данным. :exc:`OSError` вызывается, если *путь* не найден. Ожидается, что *path* будет создан с использованием атрибута :attr:`~module.__file__` модуля или элемента из :attr:`~module.__path__` пакета.

source: Raises :exc:`OSError` instead of :exc:`NotImplementedError`.
pt_pt: Levanta :exc:`OSError` em vez de :exc:`NotImplementedError`.
ru: Вызывает :exc:`OSError` вместо :exc:`NotImplementedError`.

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loaders that inspect modules.
pt_pt: Uma classe base abstrata para um :term:`loader` que implementa o protocolo opcional :pep:`302` para *loaders* que inspecionam módulos.
ru: Абстрактный базовый класс для :term:`loader`, который реализует дополнительный протокол :pep:`302` для загрузчиков, проверяющих модули.

source: Return the code object for a module, or ``None`` if the module does not have a code object (as would be the case, for example, for a built-in module). Raise an :exc:`ImportError` if loader cannot find the requested module.
pt_pt: Retorna o objeto código para um módulo, ou ``None`` se o módulo não tiver um objeto código (como seria o caso, por exemplo, de um módulo integrado). Levanta um :exc:`ImportError` se o *loader* não conseguir encontrar o módulo solicitado.
ru: Возвращает объект кода для модуля или None, если у модуля нет объекта кода (как, например, в случае встроенного модуля). Вызовите :exc:`ImportError`, если загрузчик не может найти запрошенный модуль.

source: While the method has a default implementation, it is suggested that it be overridden if possible for performance.
pt_pt: Embora o método tenha uma implementação predefinida, é sugerido que seja substituído, se possível, por razões de desempenho.
ru: Хотя у метода есть реализация по умолчанию, рекомендуется по возможности переопределить ее для повышения производительности.

source: No longer abstract and a concrete implementation is provided.
pt_pt: Já não é abstrato e uma implementação concreta é fornecida.
ru: Больше не абстрактно, а конкретная реализация.

source: An abstract method to return the source of a module. It is returned as a text string using :term:`universal newlines`, translating all recognized line separators into ``'\n'`` characters. Returns ``None`` if no source is available (e.g. a built-in module). Raises :exc:`ImportError` if the loader cannot find the module specified.
pt_pt: Um método abstrato para retornar a origem de um módulo. É retornado como uma string de texto usando :term:`universal newlines`, traduzindo todos os separadores de linha reconhecidos em caracteres ``'\n'``. Retorna ``None`` se não houver origem disponível (por exemplo, um módulo integrado). Levanta :exc:`ImportError` se o *loader* não conseguir encontrar o módulo especificado.
ru: Абстрактный метод для возврата исходного кода модуля. Он возвращается в виде текстовой строки с использованием :term:`универсальных символов новой строки`, переводя все распознаваемые разделители строк в символы ``'\n'``. Возвращает None, если источник недоступен (например, встроенный модуль). Вызывает :exc:`ImportError`, если загрузчик не может найти указанный модуль.

source: Raises :exc:`ImportError` instead of :exc:`NotImplementedError`.
pt_pt: Levanta :exc:`ImportError` em vez de :exc:`NotImplementedError`.
ru: Вызывает :exc:`ImportError` вместо :exc:`NotImplementedError`.

source: An optional method to return a true value if the module is a package, a false value otherwise. :exc:`ImportError` is raised if the :term:`loader` cannot find the module.
pt_pt: Um método opcional para retornar um valor verdadeiro se o módulo for um pacote, um valor falso caso contrário. :exc:`ImportError` é levantado se o :term:`loader` não conseguir encontrar o módulo.
ru: Необязательный метод для возврата истинного значения, если модуль является пакетом, и ложного значения в противном случае. :exc:`ImportError` возникает, если :term:`loader` не может найти модуль.

source: Create a code object from Python source.
pt_pt: Criar um objeto código a partir de código-fonte Python.
ru: Создайте объект кода из исходного кода Python.

source: The *data* argument can be whatever the :func:`compile` function supports (i.e. string or bytes). The *path* argument should be the "path" to where the source code originated from, which can be an abstract concept (e.g. location in a zip file).
pt_pt: O argumento *data* pode ser qualquer coisa que a função :func:`compile` suporta (ou seja, string ou bytes). O argumento *path* deve ser o "caminho" de onde o código-fonte se originou, o que pode ser um conceito abstrato (por exemplo, localização num ficheiro zip).
ru: Аргумент *data* может быть любым, что поддерживает функция :func:`compile` (например, строка или байты). Аргумент *path* должен быть «путем» к источнику исходного кода, что может быть абстрактным понятием (например, расположение в zip-файле).

source: With the subsequent code object one can execute it in a module by running ``exec(code, module.__dict__)``.
pt_pt: Com o objeto código subsequente, pode executá-lo num módulo executando ``exec(code, module.__dict__)``.
ru: С последующим объектом кода его можно выполнить в модуле, запустив ``exec(code, Module.__dict__)``.

source: Made the method static.
pt_pt: Tornou o método estático.
ru: Сделал метод статическим.

source: Implementation of :meth:`Loader.exec_module`.
pt_pt: Implementação de :meth:`Loader.exec_module`.
ru: Реализация :meth:`Loader.exec_module`.

source: Implementation of :meth:`Loader.load_module`.
pt_pt: Implementação de :meth:`Loader.load_module`.
ru: реализация :meth:`Loader.load_module`.

source: use :meth:`exec_module` instead.
pt_pt: use :meth:`exec_module` em vez disso.
ru: вместо этого используйте :meth:`exec_module`.

source: An abstract base class which inherits from :class:`InspectLoader` that, when implemented, helps a module to be executed as a script. The ABC represents an optional :pep:`302` protocol.
pt_pt: Uma classe base abstrata que herda de :class:`InspectLoader` que, quando implementada, ajuda um módulo a ser executado como um script. A ABC representa um protocolo opcional :pep:`302`.
ru: Абстрактный базовый класс, который наследуется от :class:`InspectLoader`, который при реализации помогает выполнять модуль как скрипт. ABC представляет собой дополнительный протокол :pep:`302`.

source: An abstract method that is to return the value of :attr:`~module.__file__` for the specified module. If no path is available, :exc:`ImportError` is raised.
pt_pt: Um método abstrato que deve retornar o valor de :attr:`~module.__file__` para o módulo especificado. Se não houver caminho disponível, :exc:`ImportError` é levantado.
ru: Абстрактный метод, возвращающий значение :attr:`~module.__file__` для указанного модуля. Если путь недоступен, возникает :exc:`ImportError`.

source: If source code is available, then the method should return the path to the source file, regardless of whether a bytecode was used to load the module.
pt_pt: Se o código-fonte estiver disponível, então o método deve retornar o caminho para o ficheiro de origem, independentemente de um bytecode ter sido usado para carregar o módulo.
ru: Если исходный код доступен, то метод должен вернуть путь к исходному файлу независимо от того, использовался ли байт-код для загрузки модуля.

source: An abstract base class which inherits from :class:`ResourceLoader` and :class:`ExecutionLoader`, providing concrete implementations of :meth:`ResourceLoader.get_data` and :meth:`ExecutionLoader.get_filename`.
pt_pt: Uma classe base abstrata que herda de :class:`ResourceLoader` e :class:`ExecutionLoader`, fornecendo implementações concretas de :meth:`ResourceLoader.get_data` e :meth:`ExecutionLoader.get_filename`.
ru: Абстрактный базовый класс, который наследуется от :class:`ResourceLoader` и :class:`ExecutionLoader`, предоставляя конкретные реализации :meth:`ResourceLoader.get_data` и :meth:`ExecutionLoader.get_filename`.

source: The *fullname* argument is a fully resolved name of the module the loader is to handle. The *path* argument is the path to the file for the module.
pt_pt: O argumento *fullname* é um nome totalmente resolvido do módulo que o *loader* deve tratar. O argumento *path* é o caminho para o ficheiro do módulo.
ru: Аргумент *fullname* — это полностью разрешенное имя модуля, который должен обрабатывать загрузчик. Аргумент *path* — это путь к файлу модуля.

source: The name of the module the loader can handle.
pt_pt: O nome do módulo que o *loader* pode tratar.
ru: Имя модуля, который может обрабатывать загрузчик.

source: Path to the file of the module.
pt_pt: Caminho para o ficheiro do módulo.
ru: Путь к файлу модуля.

source: Calls super's ``load_module()``.
pt_pt: Chama ``load_module()`` da superclasse.
ru: Вызывает супер-модуль load_module().

source: Use :meth:`Loader.exec_module` instead.
pt_pt: Use :meth:`Loader.exec_module` em vez disso.
ru: Вместо этого используйте :meth:`Loader.exec_module`.

source: Returns :attr:`path`.
pt_pt: Retorna :attr:`path`.
ru: Возвращает :attr:`path`.
