Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.po
Languages: pt_pt, ru

source: :mod:`!importlib` --- The implementation of :keyword:`!import`
pt_pt: :mod:`!importlib` --- A implementação de :keyword:`!import`
ru: :mod:`!importlib` --- Реализация :keyword:`!import`

source: **Source code:** :source:`Lib/importlib/__init__.py`
pt_pt: **Código-fonte:** :source:`Lib/importlib/__init__.py`
ru: **Исходный код:** :source:`Lib/importlib/__init__.py`

source: Introduction
pt_pt: Introdução
ru: Введение

source: The purpose of the :mod:`importlib` package is three-fold.
pt_pt: O propósito do pacote :mod:`importlib` é triplo.
ru: Пакет :mod:`importlib` имеет три цели.

source: One is to provide the implementation of the :keyword:`import` statement (and thus, by extension, the :func:`__import__` function) in Python source code. This provides an implementation of :keyword:`!import` which is portable to any Python interpreter. This also provides an implementation which is easier to comprehend than one implemented in a programming language other than Python.
pt_pt: Um é fornecer a implementação da instrução :keyword:`import` (e, por extensão, da função :func:`__import__`) em código-fonte Python. Isto fornece uma implementação de :keyword:`!import` que é portátil para qualquer interpretador Python. Também fornece uma implementação que é mais fácil de compreender do que uma implementada noutra linguagem de programação que não Python.
ru: Один из них — обеспечить реализацию оператора :keyword:`import` (и, следовательно, функции :func:`__import__`) в исходном коде Python. Это обеспечивает реализацию :keyword:`!import`, которую можно переносить в любой интерпретатор Python. Это также обеспечивает реализацию, которую легче понять, чем реализацию на другом языке программирования, кроме Python.

source: Two, the components to implement :keyword:`import` are exposed in this package, making it easier for users to create their own custom objects (known generically as an :term:`importer`) to participate in the import process.
pt_pt: Dois, os componentes para implementar :keyword:`import` estão expostos neste pacote, facilitando aos utilizadores a criação dos seus próprios objetos personalizados (conhecidos genericamente como :term:`importer`) para participar no processo de importação.
ru: Во-вторых, в этом пакете представлены компоненты для реализации :keyword:`import`, что упрощает пользователям создание собственных объектов (известных в общем как :term:`importer`) для участия в процессе импорта.

source: Three, the package contains modules exposing additional functionality for managing aspects of Python packages:
pt_pt: Três, o pacote contém módulos que expõem funcionalidades adicionais para gerir aspetos dos pacotes Python:
ru: В-третьих, пакет содержит модули, предоставляющие дополнительные функции для управления аспектами пакетов Python:

source: :mod:`importlib.metadata` presents access to metadata from third-party distributions.
pt_pt: :mod:`importlib.metadata` fornece acesso a metadados de distribuições de terceiros.
ru: :mod:`importlib.metadata` предоставляет доступ к метаданным из сторонних дистрибутивов.

source: :mod:`importlib.resources` provides routines for accessing non-code "resources" from Python packages.
pt_pt: :mod:`importlib.resources` fornece rotinas para aceder a "recursos" não-código de pacotes Python.
ru: :mod:`importlib.resources` предоставляет процедуры для доступа к некодовым «ресурсам» из пакетов Python.

source: The language reference for the :keyword:`import` statement.
pt_pt: A referência da linguagem para a instrução :keyword:`import`.
ru: Ссылка на язык для оператора :keyword:`import`.

source: `Packages specification <https://www.python.org/doc/essays/packages/>`__
pt_pt: `Especificação de pacotes <https://www.python.org/doc/essays/packages/>`__
ru: `Спецификация пакетов <https://www.python.org/doc/essays/packages/>`__

source: Original specification of packages. Some semantics have changed since the writing of this document (e.g. redirecting based on ``None`` in :data:`sys.modules`).
pt_pt: Especificação original de pacotes. Algumas semânticas foram alteradas desde a escrita deste documento (por exemplo, redirecionamento baseado em ``None`` em :data:`sys.modules`).
ru: Оригинальная спецификация пакетов. Некоторая семантика изменилась с момента написания этого документа (например, перенаправление на основе None в :data:`sys.modules`).

source: The :func:`.__import__` function
pt_pt: A função :func:`.__import__`
ru: Функция :func:`.__import__`

source: The :keyword:`import` statement is syntactic sugar for this function.
pt_pt: A instrução :keyword:`import` é açúcar sintático para esta função.
ru: Оператор :keyword:`import` является синтаксическим сахаром для этой функции.

source: The initialization of :data:`sys.path`.
pt_pt: A inicialização de :data:`sys.path`.
ru: Инициализация :data:`sys.path`.

source: Import on Case-Insensitive Platforms
pt_pt: Importação em plataformas insensíveis a maiúsculas/minúsculas
ru: Импорт на платформах, не чувствительных к регистру

source: Defining Python Source Code Encodings
pt_pt: Definir codificações de código-fonte Python
ru: Определение кодировки исходного кода Python

source: New Import Hooks
pt_pt: Novos ganchos de importação
ru: Новые крючки импорта

source: Imports: Multi-Line and Absolute/Relative
pt_pt: Importações: Multi-linha e absolutas/relativas
ru: Импорт: многострочный и абсолютный/относительный

source: Main module explicit relative imports
pt_pt: Importações relativas explícitas no módulo principal
ru: Явный относительный импорт основного модуля

source: Implicit namespace packages
pt_pt: Pacotes de namespace implícitos
ru: Неявные пакеты пространства имен

source: A ModuleSpec Type for the Import System
pt_pt: Um tipo ModuleSpec para o sistema de importação
ru: Тип ModuleSpec для системы импорта

source: Elimination of PYO files
pt_pt: Eliminação de ficheiros PYO
ru: Удаление файлов PYO

source: Multi-phase extension module initialization
pt_pt: Inicialização de módulos de extensão em várias fases
ru: Инициализация многофазного модуля расширения

source: Deterministic pycs
pt_pt: Ficheiros pyc determinísticos
ru: Детерминированные фото

source: Using UTF-8 as the Default Source Encoding
pt_pt: Utilizar UTF-8 como codificação de origem padrão
ru: Использование UTF-8 в качестве исходной кодировки по умолчанию

source: PYC Repository Directories
pt_pt: Diretórios de repositório PYC
ru: Каталоги репозитория PYC

source: Functions
pt_pt: Funções
ru: Функции

source: An implementation of the built-in :func:`__import__` function.
pt_pt: Uma implementação da função integrada :func:`__import__`.
ru: Реализация встроенной функции :func:`__import__`.

source: Programmatic importing of modules should use :func:`import_module` instead of this function.
pt_pt: A importação programática de módulos deve usar :func:`import_module` em vez desta função.
ru: Программный импорт модулей должен использовать :func:`import_module` вместо этой функции.

source: Import a module. The *name* argument specifies what module to import in absolute or relative terms (e.g. either ``pkg.mod`` or ``..mod``). If the name is specified in relative terms, then the *package* argument must be set to the name of the package which is to act as the anchor for resolving the package name (e.g. ``import_module('..mod', 'pkg.subpkg')`` will import ``pkg.mod``).
pt_pt: Importa um módulo. O argumento *name* especifica que módulo importar em termos absolutos ou relativos (por exemplo, ``pkg.mod`` ou ``..mod``). Se o nome for especificado em termos relativos, então o argumento *package* deve ser definido para o nome do pacote que servirá como âncora para resolver o nome do pacote (por exemplo, ``import_module('..mod', 'pkg.subpkg')`` importará ``pkg.mod``).
ru: Импортируйте модуль. Аргумент *name* указывает, какой модуль импортировать в абсолютном или относительном выражении (например, ``pkg.mod`` или ``..mod``). Если имя указано в относительных терминах, то аргумент *package* должен быть установлен в имя пакета, который будет действовать как привязка для разрешения имени пакета (например, ``import_module('..mod', 'pkg .subpkg')`` импортирует ``pkg.mod``).

source: The :func:`import_module` function acts as a simplifying wrapper around :func:`importlib.__import__`. This means all semantics of the function are derived from :func:`importlib.__import__`. The most important difference between these two functions is that :func:`import_module` returns the specified package or module (e.g. ``pkg.mod``), while :func:`__import__` returns the top-level package or module (e.g. ``pkg``).
pt_pt: A função :func:`import_module` atua como um invólucro simplificador em torno de :func:`importlib.__import__`. Isto significa que todas as semânticas da função são derivadas de :func:`importlib.__import__`. A diferença mais importante entre estas duas funções é que :func:`import_module` devolve o pacote ou módulo especificado (por exemplo, ``pkg.mod``), enquanto :func:`__import__` devolve o pacote ou módulo de nível superior (por exemplo, ``pkg``).
ru: Функция :func:`import_module` действует как упрощающая оболочка вокруг :func:`importlib.__import__`. Это означает, что вся семантика функции получена из :func:`importlib.__import__`. Наиболее важное различие между этими двумя функциями заключается в том, что :func:`import_module` возвращает указанный пакет или модуль (например, ``pkg.mod``), а :func:`__import__` возвращает пакет или модуль верхнего уровня (например, ``упаковка``).

source: If you are dynamically importing a module that was created since the interpreter began execution (e.g., created a Python source file), you may need to call :func:`invalidate_caches` in order for the new module to be noticed by the import system.
pt_pt: Se estiver a importar dinamicamente um módulo que foi criado desde que o interpretador iniciou a execução (por exemplo, criou um ficheiro de código Python), poderá ser necessário chamar :func:`invalidate_caches` para que o novo módulo seja notado pelo sistema de importação.
ru: Если вы динамически импортируете модуль, который был создан с момента начала выполнения интерпретатора (например, после создания исходного файла Python), вам может потребоваться вызвать :func:`invalidate_caches`, чтобы новый модуль был обнаружен системой импорта.

source: Parent packages are automatically imported.
pt_pt: Os pacotes pai são importados automaticamente.
ru: Родительские пакеты импортируются автоматически.

source: Invalidate the internal caches of finders stored at :data:`sys.meta_path`. If a finder implements ``invalidate_caches()`` then it will be called to perform the invalidation. This function should be called if any modules are created/installed while your program is running to guarantee all finders will notice the new module's existence.
pt_pt: Invalidar as caches internas dos *finders* armazenadas em :data:`sys.meta_path`. Se um *finder* implementar ``invalidate_caches()``, este será chamado para realizar a invalidação. Esta função deve ser chamada se algum módulo for criado/instalado enquanto o seu programa estiver a correr, para garantir que todos os *finders* notam a existência do novo módulo.
ru: Сделайте недействительными внутренние кеши средств поиска, хранящиеся в :data:`sys.meta_path`. Если средство поиска реализует invalidate_caches(), то оно будет вызвано для аннулирования. Эту функцию следует вызывать, если какие-либо модули создаются/устанавливаются во время работы вашей программы, чтобы гарантировать, что все искатели заметят существование нового модуля.

source: Namespace packages created/installed in a different :data:`sys.path` location after the same namespace was already imported are noticed.
pt_pt: Pacotes de namespace criados/instalados numa localização diferente de :data:`sys.path` após o mesmo namespace já ter sido importado são notados.
ru: Пакеты пространства имен, созданные/установленные в другом месте :data:`sys.path` после того, как то же пространство имен уже было импортировано, учитываются.

source: Reload a previously imported *module*. The argument must be a module object, so it must have been successfully imported before. This is useful if you have edited the module source file using an external editor and want to try out the new version without leaving the Python interpreter. The return value is the module object (which can be different if re-importing causes a different object to be placed in :data:`sys.modules`).
pt_pt: Recarrega um *módulo* previamente importado. O argumento deve ser um objeto módulo, pelo que deve ter sido importado com sucesso anteriormente. Isto é útil se editou o ficheiro de origem do módulo usando um editor externo e pretende experimentar a nova versão sem sair do interpretador Python. O valor de retorno é o objeto módulo (que pode ser diferente se a reimportação colocar um objeto diferente em :data:`sys.modules`).
ru: Перезагрузите ранее импортированный *модуль*. Аргумент должен быть объектом модуля, поэтому он должен быть успешно импортирован ранее. Это полезно, если вы отредактировали исходный файл модуля с помощью внешнего редактора и хотите опробовать новую версию, не выходя из интерпретатора Python. Возвращаемое значение — это объект модуля (который может быть другим, если при повторном импорте в :data:`sys.modules` будет помещен другой объект).

source: When :func:`reload` is executed:
pt_pt: Quando :func:`reload` é executado:
ru: Когда выполняется :func:`reload`:

source: Python module's code is recompiled and the module-level code re-executed, defining a new set of objects which are bound to names in the module's dictionary by reusing the :term:`loader` which originally loaded the module. The ``init`` function of extension modules is not called a second time.
pt_pt: O código do módulo Python é recompilado e o código ao nível do módulo é reexecutado, definindo um novo conjunto de objetos que são associados a nomes no dicionário do módulo, reutilizando o :term:`loader` que originalmente carregou o módulo. A função ``init`` de módulos de extensão não é chamada uma segunda vez.
ru: Код модуля Python перекомпилируется, и код уровня модуля повторно выполняется, определяя новый набор объектов, которые привязаны к именам в словаре модуля, путем повторного использования :term:`loader`, который первоначально загрузил модуль. Функция init модулей расширения не вызывается второй раз.

source: As with all other objects in Python the old objects are only reclaimed after their reference counts drop to zero.
pt_pt: Como com todos os outros objetos em Python, os objetos antigos só são recuperados após as suas contagens de referência chegarem a zero.
ru: Как и все другие объекты в Python, старые объекты восстанавливаются только после того, как их счетчик ссылок упадет до нуля.

source: The names in the module namespace are updated to point to any new or changed objects.
pt_pt: Os nomes no espaço de nomes do módulo são atualizados para apontar para quaisquer novos objetos ou objetos alterados.
ru: Имена в пространстве имен модуля обновляются, чтобы указывать на любые новые или измененные объекты.

source: Other references to the old objects (such as names external to the module) are not rebound to refer to the new objects and must be updated in each namespace where they occur if that is desired.
pt_pt: Outras referências aos objetos antigos (como nomes externos ao módulo) não são reassociadas para referir os novos objetos e devem ser atualizadas em cada espaço de nomes onde ocorrem, se assim for desejado.
ru: Другие ссылки на старые объекты (например, имена, внешние по отношению к модулю) не переназначаются для ссылки на новые объекты и должны обновляться в каждом пространстве имен, где они встречаются, если это желательно.

source: There are a number of other caveats:
pt_pt: Existem várias outras advertências:
ru: Есть еще ряд предостережений:

source: When a module is reloaded, its dictionary (containing the module's global variables) is retained. Redefinitions of names will override the old definitions, so this is generally not a problem. If the new version of a module does not define a name that was defined by the old version, the old definition remains. This feature can be used to the module's advantage if it maintains a global table or cache of objects --- with a :keyword:`try` statement it can test for the table's presence and skip its initialization if desired::
pt_pt: Quando um módulo é recarregado, o seu dicionário (que contém as variáveis globais do módulo) é retido. Redefinições de nomes substituirão as definições antigas, pelo que isto geralmente não é um problema. Se a nova versão de um módulo não definir um nome que foi definido pela versão antiga, a definição antiga permanece. Esta funcionalidade pode ser usada em vantagem do módulo se este mantiver uma tabela global ou cache de objetos — com uma instrução :keyword:`try`, pode testar a presença da tabela e ignorar a sua inicialização, se desejado::
ru: Когда модуль перезагружается, его словарь (содержащий глобальные переменные модуля) сохраняется. Переопределения имен переопределяют старые определения, поэтому обычно это не проблема. Если новая версия модуля не определяет имя, определенное в старой версии, старое определение остается. Эту функцию можно использовать в интересах модуля, если он поддерживает глобальную таблицу или кеш объектов --- с помощью оператора :keyword:`try` он может проверить наличие таблицы и при желании пропустить ее инициализацию::

source: It is generally not very useful to reload built-in or dynamically loaded modules. Reloading :mod:`sys`, :mod:`__main__`, :mod:`builtins` and other key modules is not recommended. In many cases extension modules are not designed to be initialized more than once, and may fail in arbitrary ways when reloaded.
pt_pt: Geralmente, não é muito útil recarregar módulos integrados ou carregados dinamicamente. Não é recomendado recarregar :mod:`sys`, :mod:`__main__`, :mod:`builtins` e outros módulos-chave. Em muitos casos, os módulos de extensão não são concebidos para serem inicializados mais do que uma vez e podem falhar de formas arbitrárias quando recarregados.
ru: Обычно перезагружать встроенные или динамически загружаемые модули не очень полезно. Перезагрузка :mod:`sys`, :mod:`__main__`, :mod:`builtins` и других ключевых модулей не рекомендуется. Во многих случаях модули расширения не предназначены для многократной инициализации и могут по каким-либо причинам выйти из строя при перезагрузке.

source: If a module imports objects from another module using :keyword:`from` ... :keyword:`import` ..., calling :func:`reload` for the other module does not redefine the objects imported from it --- one way around this is to re-execute the :keyword:`!from` statement, another is to use :keyword:`!import` and qualified names (*module.name*) instead.
pt_pt: Se um módulo importa objetos de outro módulo usando :keyword:`from` ... :keyword:`import` ..., chamar :func:`reload` para o outro módulo não redefine os objetos importados dele — uma forma de contornar isto é reexecutar a instrução :keyword:`!from`, outra é usar :keyword:`!import` e nomes qualificados (*module.name*) em vez disso.
ru: Если модуль импортирует объекты из другого модуля, используя :keyword:`from` ... :keyword:`import` ..., вызов :func:`reload` для другого модуля не переопределяет объекты, импортированные из него --- Один из способов решения этой проблемы — повторное выполнение оператора :keyword:`!from`, другой — вместо этого использовать :keyword:`!import` и квалифицированные имена (*module.name*).

source: If a module instantiates instances of a class, reloading the module that defines the class does not affect the method definitions of the instances --- they continue to use the old class definition. The same is true for derived classes.
pt_pt: Se um módulo instancia instâncias de uma classe, recarregar o módulo que define a classe não afeta as definições de métodos das instâncias — estas continuam a usar a definição antiga da classe. O mesmo é verdadeiro para classes derivadas.
ru: Если модуль создает экземпляры класса, перезагрузка модуля, определяющего класс, не влияет на определения методов экземпляров — они продолжают использовать старое определение класса. То же самое справедливо и для производных классов.

source: :exc:`ModuleNotFoundError` is raised when the module being reloaded lacks a :class:`~importlib.machinery.ModuleSpec`.
pt_pt: :exc:`ModuleNotFoundError` é levantado quando o módulo a ser recarregado não tem um :class:`~importlib.machinery.ModuleSpec`.
ru: :exc:`ModuleNotFoundError` возникает, когда в перезагружаемом модуле отсутствует :class:`~importlib.machinery.ModuleSpec`.

source: :mod:`importlib.abc` -- Abstract base classes related to import
pt_pt: :mod:`importlib.abc` — Classes base abstratas relacionadas com importação
ru: :mod:`importlib.abc` -- Абстрактные базовые классы, связанные с импортом

source: **Source code:** :source:`Lib/importlib/abc.py`
pt_pt: **Código-fonte:** :source:`Lib/importlib/abc.py`
ru: **Исходный код:** :source:`Lib/importlib/abc.py`

source: The :mod:`importlib.abc` module contains all of the core abstract base classes used by :keyword:`import`. Some subclasses of the core abstract base classes are also provided to help in implementing the core ABCs.
pt_pt: O módulo :mod:`importlib.abc` contém todas as classes base abstratas principais usadas por :keyword:`import`. Algumas subclasses das classes base abstratas principais também são fornecidas para ajudar na implementação das ABCs principais.
ru: Модуль :mod:`importlib.abc` содержит все основные абстрактные базовые классы, используемые :keyword:`import`. Некоторые подклассы основных абстрактных базовых классов также предоставляются для помощи в реализации основных ABC.

source: ABC hierarchy::
pt_pt: Hierarquia de ABCs::
ru: Иерархия ABC::

source: An abstract base class representing a :term:`meta path finder`.
pt_pt: Uma classe base abstrata que representa um :term:`meta path finder`.
ru: Абстрактный базовый класс, представляющий средство поиска метапутей.

source: No longer a subclass of :class:`!Finder`.
pt_pt: Já não é uma subclasse de :class:`!Finder`.
ru: Больше не является подклассом :class:`!Finder`.
