Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.po
Languages: pt_pt, ru

source: The :term:`loader` used to load the module (see :attr:`module.__loader__`). The :term:`finder` should always set this attribute.
pt_pt: O :term:`loader` usado para carregar o módulo (ver :attr:`module.__loader__`). O :term:`finder` deve sempre definir este atributo.
ru: :term:`loader`, используемый для загрузки модуля (см. :attr:`module.__loader__`). :term:`finder` всегда должен устанавливать этот атрибут.

source: The location the :term:`loader` should use to load the module (see :attr:`module.__file__`). For example, for modules loaded from a ``.py`` file this is the filename. The :term:`finder` should always set this attribute to a meaningful value for the :term:`loader` to use. In the uncommon case that there is not one (like for namespace packages), it should be set to ``None``.
pt_pt: A localização que o :term:`loader` deve usar para carregar o módulo (ver :attr:`module.__file__`). Por exemplo, para módulos carregados a partir de um ficheiro ``.py``, este é o nome do ficheiro. O :term:`finder` deve sempre definir este atributo para um valor significativo para o :term:`loader` usar. No caso incomum de não haver um (como para pacotes de namespace), deve ser definido como ``None``.
ru: Местоположение, которое :term:`loader` должен использовать для загрузки модуля (см. :attr:`module.__file__`). Например, для модулей, загруженных из файла ``.py``, это имя файла. :term:`finder` всегда должен устанавливать для этого атрибута значимое значение, чтобы :term:`loader` мог его использовать. В редких случаях, когда его нет (например, для пакетов пространства имен), для него должно быть установлено значение «Нет».

source: A (possibly empty) :term:`sequence` of strings enumerating the locations in which a package's submodules will be found (see :attr:`module.__path__`). Most of the time there will only be a single directory in this list.
pt_pt: Uma :term:`sequência` (possivelmente vazia) de strings que enumera as localizações onde os submódulos de um pacote serão encontrados (ver :attr:`module.__path__`). Na maioria das vezes, haverá apenas um diretório nesta lista.
ru: (Возможно, пустая) :term:`последовательность` строк, перечисляющих местоположения, в которых будут найдены подмодули пакета (см. :attr:`module.__path__`). В большинстве случаев в этом списке будет только один каталог.

source: The :term:`finder` should set this attribute to a sequence, even an empty one, to indicate to the import system that the module is a package. It should be set to ``None`` for non-package modules. It is set automatically later to a special object for namespace packages.
pt_pt: O :term:`finder` deve definir este atributo para uma sequência, mesmo que vazia, para indicar ao sistema de importação que o módulo é um pacote. Deve ser definido como ``None`` para módulos que não são pacotes. É definido automaticamente mais tarde para um objeto especial para pacotes de namespace.
ru: :term:`finder` должен установить этот атрибут в последовательность, даже пустую, чтобы указать системе импорта, что модуль является пакетом. Для непакетных модулей должно быть установлено значение «Нет». Позже он автоматически устанавливается в специальный объект для пакетов пространства имен.

source: The :term:`finder` may set this attribute to an object containing additional, module-specific data to use when loading the module. Otherwise it should be set to ``None``.
pt_pt: O :term:`finder` pode definir este atributo para um objeto contendo dados adicionais específicos do módulo a usar ao carregar o módulo. Caso contrário, deve ser definido como ``None``.
ru: :term:`finder` может установить этот атрибут для объекта, содержащего дополнительные, специфичные для модуля данные, которые будут использоваться при загрузке модуля. В противном случае следует установить значение «Нет».

source: The filename of a compiled version of the module's code (see :attr:`module.__cached__`). The :term:`finder` should always set this attribute but it may be ``None`` for modules that do not need compiled code stored.
pt_pt: O nome do ficheiro de uma versão compilada do código do módulo (ver :attr:`module.__cached__`). O :term:`finder` deve sempre definir este atributo, mas pode ser ``None`` para módulos que não precisam de código compilado armazenado.
ru: Имя файла скомпилированной версии кода модуля (см. :attr:`module.__cached__`). :term:`finder` всегда должен устанавливать этот атрибут, но он может быть ``None`` для модулей, которым не требуется сохранение скомпилированного кода.

source: (Read-only) The fully qualified name of the package the module is in (or the empty string for a top-level module). See :attr:`module.__package__`. If the module is a package then this is the same as :attr:`name`.
pt_pt: (Apenas leitura) O nome totalmente qualificado do pacote em que o módulo está (ou a string vazia para um módulo de nível superior). Ver :attr:`module.__package__`. Se o módulo for um pacote, então isto é o mesmo que :attr:`name`.
ru: (Только для чтения) Полное имя пакета, в котором находится модуль (или пустая строка для модуля верхнего уровня). См. :attr:`module.__package__`. Если модуль является пакетом, то это то же самое, что и :attr:`name`.

source: ``True`` if the spec's :attr:`origin` refers to a loadable location, ``False`` otherwise. This value impacts how :attr:`!origin` is interpreted and how the module's :attr:`~module.__file__` is populated.
pt_pt: ``True`` se o :attr:`origin` da especificação se referir a uma localização carregável, ``False`` caso contrário. Este valor afeta como :attr:`!origin` é interpretado e como o :attr:`~module.__file__` do módulo é preenchido.
ru: ``True``, если :attr:`origin` спецификации относится к загружаемому местоположению, ``False`` в противном случае. Это значение влияет на то, как интерпретируется :attr:`!origin` и как заполняется :attr:`~module.__file__` модуля.

source: A specialization of :class:`importlib.machinery.ExtensionFileLoader` that is able to load extension modules in Framework format.
ru: Специализация :class:`importlib.machinery.ExtensionFileLoader`, которая способна загружать модули расширения в формате Framework.

source: For compatibility with the iOS App Store, *all* binary modules in an iOS app must be dynamic libraries, contained in a framework with appropriate metadata, stored in the ``Frameworks`` folder of the packaged app. There can be only a single binary per framework, and there can be no executable binary material outside the Frameworks folder.
ru: Для совместимости с iOS App Store *все* бинарные модули в приложении iOS должны быть динамическими библиотеками, содержащимися в фреймворке с соответствующими метаданными, хранящимися в папке ``Frameworks`` упакованного приложения. Для каждой платформы может быть только один двоичный файл, и за пределами папки Frameworks не может быть исполняемого двоичного материала.

source: To accommodate this requirement, when running on iOS, extension module binaries are *not* packaged as ``.so`` files on ``sys.path``, but as individual standalone frameworks. To discover those frameworks, this loader is be registered against the ``.fwork`` file extension, with a ``.fwork`` file acting as a placeholder in the original location of the binary on ``sys.path``. The ``.fwork`` file contains the path of the actual binary in the ``Frameworks`` folder, relative to the app bundle. To allow for resolving a framework-packaged binary back to the original location, the framework is expected to contain a ``.origin`` file that contains the location of the ``.fwork`` file, relative to the app bundle.
ru: Чтобы удовлетворить этому требованию, при работе на iOS двоичные файлы модулей расширения *не* упаковываются как файлы ``.so`` в ``sys.path``, а как отдельные автономные платформы. Чтобы обнаружить эти платформы, этот загрузчик должен быть зарегистрирован с расширением файла ``.fwork``, при этом файл ``.fwork`` действует как заполнитель в исходном местоположении двоичного файла в ``sys.path``. Файл ``.fwork`` содержит путь к фактическому двоичному файлу в папке ``Frameworks`` относительно пакета приложения. Чтобы разрешить преобразование двоичного файла, упакованного в платформу, обратно в исходное местоположение, ожидается, что платформа будет содержать файл ``.origin``, который содержит местоположение файла ``.fwork`` относительно пакета приложения.

source: For example, consider the case of an import ``from foo.bar import _whiz``, where ``_whiz`` is implemented with the binary module ``sources/foo/bar/_whiz.abi3.so``, with ``sources`` being the location registered on ``sys.path``, relative to the application bundle. This module *must* be distributed as ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (creating the framework name from the full import path of the module), with an ``Info.plist`` file in the ``.framework`` directory identifying the binary as a framework. The ``foo.bar._whiz`` module would be represented in the original location with a ``sources/foo/bar/_whiz.abi3.fwork`` marker file, containing the path ``Frameworks/foo.bar._whiz/foo.bar._whiz``. The framework would also contain ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, containing the path to the ``.fwork`` file.
ru: Например, рассмотрим случай импорта ``из foo.bar import _whiz``, где ``_whiz`` реализуется с помощью двоичного модуля ``sources/foo/bar/_whiz.abi3.so``, с `` `sources`` — это местоположение, зарегистрированное в ``sys.path`` относительно пакета приложения. Этот модуль *должен* распространяться как ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (имя платформы создается из полного пути импорта модуля) с ``Info.plist` `файл в каталоге ``.framework``, идентифицирующий двоичный файл как фреймворк. Модуль ``foo.bar._whiz`` будет представлен в исходном месте с помощью файла маркера ``sources/foo/bar/_whiz.abi3.fwork``, содержащего путь ``Frameworks/foo.bar._whiz``. /foo.bar._whiz``. Фреймворк также будет содержать ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, содержащий путь к файлу ``.fwork``.

source: The Xcode project building the app is responsible for converting any ``.so`` files from wherever they exist in the ``PYTHONPATH`` into frameworks in the ``Frameworks`` folder (including stripping extensions from the module file, the addition of framework metadata, and signing the resulting framework), and creating the ``.fwork`` and ``.origin`` files. This will usually be done with a build step in the Xcode project; see the iOS documentation for details on how to construct this build step.
ru: Проект Xcode, создающий приложение, отвечает за преобразование любых файлов ``.so``, где бы они ни находились в ``PYTHONPATH``, в фреймворки в папке ``Frameworks`` (включая удаление расширений из файла модуля, добавление метаданных платформы и подписание полученной структуры), а также создание файлов ``.fwork`` и ``.origin``. Обычно это делается на этапе сборки в проекте Xcode; подробную информацию о том, как построить этот этап сборки, см. в документации iOS.

source: Availability
ru: Доступность

source: Path to the ``.fwork`` file for the extension module.
ru: Путь к файлу ``.fwork`` для модуля расширения.

source: :mod:`importlib.util` -- Utility code for importers
pt_pt: :mod:`importlib.util` — Código utilitário para importadores
ru: :mod:`importlib.util` -- Утилитный код для импортеров

source: **Source code:** :source:`Lib/importlib/util.py`
pt_pt: **Código-fonte:** :source:`Lib/importlib/util.py`
ru: **Исходный код:** :source:`Lib/importlib/util.py`

source: This module contains the various objects that help in the construction of an :term:`importer`.
pt_pt: Este módulo contém vários objetos que ajudam na construção de um :term:`importador`.
ru: Этот модуль содержит различные объекты, которые помогают в создании :term:`importer`.

source: The bytes which represent the bytecode version number. If you need help with loading/writing bytecode then consider :class:`importlib.abc.SourceLoader`.
pt_pt: Os bytes que representam o número de versão do bytecode. Se precisar de ajuda com o carregamento/escrita de bytecode, considere :class:`importlib.abc.SourceLoader`.
ru: Байты, представляющие номер версии байт-кода. Если вам нужна помощь с загрузкой/записью байт-кода, рассмотрите :class:`importlib.abc.SourceLoader`.

source: Return the :pep:`3147`/:pep:`488` path to the byte-compiled file associated with the source *path*. For example, if *path* is ``/foo/bar/baz.py`` the return value would be ``/foo/bar/__pycache__/baz.cpython-32.pyc`` for Python 3.2. The ``cpython-32`` string comes from the current magic tag (see :func:`get_tag`; if :attr:`sys.implementation.cache_tag` is not defined then :exc:`NotImplementedError` will be raised).
pt_pt: Retorna o caminho :pep:`3147`/:pep:`488` para o ficheiro compilado em bytecode associado ao *path* de origem. Por exemplo, se *path* for ``/foo/bar/baz.py``, o valor retornado seria ``/foo/bar/__pycache__/baz.cpython-32.pyc`` para Python 3.2. A string ``cpython-32`` vem da etiqueta mágica atual (ver :func:`get_tag`; se :attr:`sys.implementation.cache_tag` não estiver definido, então :exc:`NotImplementedError` será levantado).
ru: Верните путь :pep:`3147`/:pep:`488` к скомпилированному побайтно файлу, связанному с исходным *path*. Например, если *path* равен ``/foo/bar/baz.py``, возвращаемое значение будет ``/foo/bar/__pycache__/baz.cpython-32.pyc`` для Python 3.2. Строка ``cpython-32`` берется из текущего магического тега (см. :func:`get_tag`; если :attr:`sys.implementation.cache_tag` не определен, то :exc:`NotImplementedError` будет поднято).

source: The *optimization* parameter is used to specify the optimization level of the bytecode file. An empty string represents no optimization, so ``/foo/bar/baz.py`` with an *optimization* of ``''`` will result in a bytecode path of ``/foo/bar/__pycache__/baz.cpython-32.pyc``. ``None`` causes the interpreter's optimization level to be used. Any other value's string representation is used, so ``/foo/bar/baz.py`` with an *optimization* of ``2`` will lead to the bytecode path of ``/foo/bar/__pycache__/baz.cpython-32.opt-2.pyc``. The string representation of *optimization* can only be alphanumeric, else :exc:`ValueError` is raised.
pt_pt: O parâmetro *optimization* é usado para especificar o nível de otimização do ficheiro de bytecode. Uma string vazia representa nenhuma otimização, então ``/foo/bar/baz.py`` com uma *optimization* de ``''`` resultará num caminho de bytecode de ``/foo/bar/__pycache__/baz.cpython-32.pyc``. ``None`` faz com que o nível de otimização do interpretador seja usado. A representação em string de qualquer outro valor é usada, então ``/foo/bar/baz.py`` com uma *optimization* de ``2`` levará ao caminho de bytecode de ``/foo/bar/__pycache__/baz.cpython-32.opt-2.pyc``. A representação em string de *optimization* só pode ser alfanumérica, caso contrário, :exc:`ValueError` é levantado.
ru: Параметр *optimization* используется для указания уровня оптимизации файла байт-кода. Пустая строка означает отсутствие оптимизации, поэтому ``/foo/bar/baz.py`` с *оптимизацией* ``''`` приведет к пути байт-кода ``/foo/bar/__pycache__/baz. cpython-32.pyc``. ``None`` приводит к использованию уровня оптимизации интерпретатора. Используется строковое представление любого другого значения, поэтому ``/foo/bar/baz.py`` с *оптимизацией* ``2`` приведет к пути байт-кода ``/foo/bar/__pycache__/baz. cpython-32.opt-2.pyc``. Строковое представление *оптимизации* может быть только буквенно-цифровым, иначе выдается :exc:`ValueError`.

source: The *debug_override* parameter is deprecated and can be used to override the system's value for ``__debug__``. A ``True`` value is the equivalent of setting *optimization* to the empty string. A ``False`` value is the same as setting *optimization* to ``1``. If both *debug_override* an *optimization* are not ``None`` then :exc:`TypeError` is raised.
pt_pt: O parâmetro *debug_override* está obsoleto e pode ser usado para substituir o valor do sistema para ``__debug__``. Um valor ``True`` é equivalente a definir *optimization* para a string vazia. Um valor ``False`` é o mesmo que definir *optimization* para ``1``. Se ambos *debug_override* e *optimization* não forem ``None``, então :exc:`TypeError` é levantado.
ru: Параметр *debug_override* устарел и может использоваться для переопределения системного значения ``__debug__``. Значение True эквивалентно установке *оптимизации* пустой строки. Значение «False» аналогично установке для *optimization* значения «1». Если оба параметра *debug_override* и *optimization* не равны None, то возникает :exc:`TypeError`.

source: The *optimization* parameter was added and the *debug_override* parameter was deprecated.
pt_pt: O parâmetro *optimization* foi adicionado e o parâmetro *debug_override* foi tornado obsoleto.
ru: Был добавлен параметр *optimization*, а параметр *debug_override* признан устаревшим.

source: Accepts a :term:`path-like object`.
pt_pt: Aceita um :term:`objeto semelhante a um caminho`.
ru: Принимает :term:`объект, похожий на путь`.

source: Given the *path* to a :pep:`3147` file name, return the associated source code file path. For example, if *path* is ``/foo/bar/__pycache__/baz.cpython-32.pyc`` the returned path would be ``/foo/bar/baz.py``. *path* need not exist, however if it does not conform to :pep:`3147` or :pep:`488` format, a :exc:`ValueError` is raised. If :attr:`sys.implementation.cache_tag` is not defined, :exc:`NotImplementedError` is raised.
pt_pt: Dado o *path* para um nome de ficheiro :pep:`3147`, retorna o caminho do ficheiro de código-fonte associado. Por exemplo, se *path* for ``/foo/bar/__pycache__/baz.cpython-32.pyc``, o caminho retornado seria ``/foo/bar/baz.py``. *path* não precisa de existir, no entanto, se não conformar com o formato :pep:`3147` ou :pep:`488`, um :exc:`ValueError` é levantado. Se :attr:`sys.implementation.cache_tag` não estiver definido, :exc:`NotImplementedError` é levantado.
ru: Учитывая *путь* к имени файла :pep:`3147`, верните соответствующий путь к файлу исходного кода. Например, если *path* равен ``/foo/bar/__pycache__/baz.cpython-32.pyc``, возвращаемый путь будет ``/foo/bar/baz.py``. *path* не обязательно должен существовать, однако, если он не соответствует формату :pep:`3147` или :pep:`488`, выдается ошибка :exc:`ValueError`. Если :attr:`sys.implementation.cache_tag` не определен, возникает :exc:`NotImplementedError`.

source: Decode the given bytes representing source code and return it as a string with universal newlines (as required by :meth:`importlib.abc.InspectLoader.get_source`).
pt_pt: Decodifica os bytes dados que representam código-fonte e retorna-os como uma string com novas linhas universais (como exigido por :meth:`importlib.abc.InspectLoader.get_source`).
ru: Декодируйте данные байты, представляющие исходный код, и верните их в виде строки с универсальными символами новой строки (как того требует :meth:`importlib.abc.InspectLoader.get_source`).

source: Resolve a relative module name to an absolute one.
pt_pt: Resolve um nome de módulo relativo para um absoluto.
ru: Преобразуйте относительное имя модуля в абсолютное.

source: If **name** has no leading dots, then **name** is simply returned. This allows for usage such as ``importlib.util.resolve_name('sys', __spec__.parent)`` without doing a check to see if the **package** argument is needed.
pt_pt: Se **name** não tiver pontos iniciais, então **name** é simplesmente retornado. Isto permite o uso como ``importlib.util.resolve_name('sys', __spec__.parent)`` sem verificar se o argumento **package** é necessário.
ru: Если в **name** нет начальных точек, то просто возвращается **name**. Это позволяет использовать, например, ``importlib.util.resolve_name('sys', __spec__.parent)`` без проверки необходимости аргумента **package**.

source: :exc:`ImportError` is raised if **name** is a relative module name but **package** is a false value (e.g. ``None`` or the empty string). :exc:`ImportError` is also raised if a relative name would escape its containing package (e.g. requesting ``..bacon`` from within the ``spam`` package).
pt_pt: :exc:`ImportError` é levantado se **name** for um nome de módulo relativo, mas **package** for um valor falso (por exemplo, ``None`` ou a string vazia). :exc:`ImportError` também é levantado se um nome relativo escapar do seu pacote contêiner (por exemplo, solicitar ``..bacon`` a partir do pacote ``spam``).
ru: :exc:`ImportError` возникает, если **name** — относительное имя модуля, а **package** — ложное значение (например, ``None`` или пустая строка). :exc:`ImportError` также возникает, если относительное имя выходит за рамки содержащего его пакета (например, запрос ``..bacon`` из пакета ``spam``).

source: To improve consistency with import statements, raise :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts.
pt_pt: Para melhorar a consistência com as instruções de importação, levanta :exc:`ImportError` em vez de :exc:`ValueError` para tentativas de importação relativa inválidas.
ru: Чтобы улучшить согласованность с операторами импорта, вызовите :exc:`ImportError` вместо :exc:`ValueError` для недопустимых относительных попыток импорта.

source: Find the :term:`spec <module spec>` for a module, optionally relative to the specified **package** name. If the module is in :data:`sys.modules`, then ``sys.modules[name].__spec__`` is returned (unless the spec would be ``None`` or is not set, in which case :exc:`ValueError` is raised). Otherwise a search using :data:`sys.meta_path` is done. ``None`` is returned if no spec is found.
pt_pt: Encontra a :term:`especificação <module spec>` para um módulo, opcionalmente relativo ao nome do **package** especificado. Se o módulo estiver em :data:`sys.modules`, então ``sys.modules[name].__spec__`` é retornado (a menos que a especificação seja ``None`` ou não esteja definida, caso em que :exc:`ValueError` é levantado). Caso contrário, é feita uma pesquisa usando :data:`sys.meta_path`. ``None`` é retornado se nenhuma especificação for encontrada.
ru: Найдите :term:`spec <module spec>` для модуля, при необходимости относительно указанного имени **package**. Если модуль находится в :data:`sys.modules`, то возвращается ``sys.modules[name].__spec__`` (если только спецификация не будет ``None`` или не установлена, в этом случае :exc :`ValueError` возникает). В противном случае выполняется поиск с использованием :data:`sys.meta_path`. ``None`` возвращается, если спецификация не найдена.

source: If **name** is for a submodule (contains a dot), the parent module is automatically imported.
pt_pt: Se **name** for para um submódulo (contém um ponto), o módulo pai é automaticamente importado.
ru: Если **имя** относится к подмодулю (содержит точку), родительский модуль импортируется автоматически.

source: **name** and **package** work the same as for :func:`import_module`.
pt_pt: **name** e **package** funcionam da mesma forma que para :func:`import_module`.
ru: **имя** и **пакет** работают так же, как и для :func:`import_module`.

source: Raises :exc:`ModuleNotFoundError` instead of :exc:`AttributeError` if **package** is in fact not a package (i.e. lacks a :attr:`~module.__path__` attribute).
pt_pt: Levanta :exc:`ModuleNotFoundError` em vez de :exc:`AttributeError` se **package** não for de facto um pacote (ou seja, não tem um atributo :attr:`~module.__path__`).
ru: Вызывает :exc:`ModuleNotFoundError` вместо :exc:`AttributeError`, если **package** на самом деле не является пакетом (т. е. не имеет атрибута :attr:`~module.__path__`).
