Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.metadata.po
Languages: pt_pt, sv

source: The :func:`!files` function takes a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ name and returns all of the files installed by this distribution. Each file is reported as a :class:`PackagePath` instance. For example::
pt_pt: A função :func:`!files` recebe um nome de `Pacote de Distribuição <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ e retorna todos os ficheiros instalados por esta distribuição. Cada ficheiro é reportado como uma instância :class:`PackagePath`. Por exemplo::
sv: Funktionen :func:`!files` tar ett namn på `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ och returnerar alla filer som installerats av denna distribution. Varje fil rapporteras som en instans av :class:`PackagePath`. Till exempel::

source: Once you have the file, you can also read its contents::
pt_pt: Uma vez que tem o ficheiro, também pode ler o seu conteúdo::
sv: När du har filen kan du också läsa dess innehåll::

source: You can also use the :meth:`!locate` method to get the absolute path to the file::
pt_pt: Também pode usar o método :meth:`!locate` para obter o caminho absoluto para o ficheiro::
sv: Du kan också använda metoden :meth:`!locate` för att få den absoluta sökvägen till filen::

source: In the case where the metadata file listing files (``RECORD`` or ``SOURCES.txt``) is missing, :func:`!files` will return :const:`None`. The caller may wish to wrap calls to :func:`!files` in `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ or otherwise guard against this condition if the target distribution is not known to have the metadata present.
pt_pt: No caso em que o ficheiro de metadados que lista os ficheiros (``RECORD`` ou ``SOURCES.txt``) está em falta, :func:`!files` retornará :const:`None`. O chamador pode desejar envolver chamadas a :func:`!files` em `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ ou, de outra forma, proteger-se contra esta condição se a distribuição alvo não for conhecida por ter os metadados presentes.
sv: I fallet där metadatafilen som listar filer (``RECORD`` eller ``SOURCES.txt``) saknas, kommer :func:`!files` att returnera :const:`None`. Den som anropar kan vilja linda in anrop till :func:`!files` i `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ eller på annat sätt skydda sig mot detta villkor om det inte är känt att måldistributionen har metadata närvarande.

source: Distribution requirements
pt_pt: Requisitos de distribuição
sv: Krav på distribution

source: Return the declared dependency specifiers for the named distribution package.
pt_pt: Retorna os especificadores de dependência declarados para o pacote de distribuição nomeado.
sv: Returnerar de deklarerade beroendespecifikationerna för det namngivna distributionspaketet.

source: To get the full set of requirements for a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, use the :func:`!requires` function::
pt_pt: Para obter o conjunto completo de requisitos para um `Pacote de Distribuição <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, use a função :func:`!requires`::
sv: För att få den fullständiga uppsättningen krav för ett `Distributionspaket <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, använd funktionen :func:`!requires`::

source: Mapping import to distribution packages
pt_pt: Mapeamento de importação para pacotes de distribuição
sv: Mappning av import till distributionspaket

source: Return a mapping from the top level module and import package names found via :data:`sys.meta_path` to the names of the distribution packages (if any) that provide the corresponding files.
pt_pt: Retorna um mapeamento dos nomes de módulos e pacotes de importação de nível superior encontrados através de :data:`sys.meta_path` para os nomes dos pacotes de distribuição (se houver) que fornecem os ficheiros correspondentes.
sv: Returnerar en mappning från toppnivåmodulen och importpaketnamnen som hittas via :data:`sys.meta_path` till namnen på distributionspaketen (om sådana finns) som tillhandahåller motsvarande filer.

source: To allow for namespace packages (which may have members provided by multiple distribution packages), each top level import name maps to a list of distribution names rather than mapping directly to a single name.
pt_pt: Para permitir pacotes de namespace (que podem ter membros fornecidos por vários pacotes de distribuição), cada nome de importação de nível superior mapeia para uma lista de nomes de distribuição em vez de mapear diretamente para um único nome.
sv: För att möjliggöra namnrymdspaket (som kan ha medlemmar som tillhandahålls av flera distributionspaket) mappas varje importnamn på högsta nivån till en lista med distributionsnamn i stället för att mappas direkt till ett enda namn.

source: A convenience method to resolve the `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ name (or names, in the case of a namespace package) that provide each importable top-level Python module or `Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::
pt_pt: Um método de conveniência para resolver o nome do `Pacote de Distribuição <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ (ou nomes, no caso de um pacote de namespace) que fornece cada módulo Python de nível superior importável ou `Pacote de Importação <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::
sv: En bekvämlighetsmetod för att lösa `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_-namnet (eller namnen, i fallet med ett namnrymdspaket) som tillhandahåller varje importerbar Python-modul på högsta nivån eller `Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::

source: Some editable installs, `do not supply top-level names <https://github.com/pypa/packaging-problems/issues/609>`_, and thus this function is not reliable with such installs.
pt_pt: Algumas instalações editáveis `não fornecem nomes de nível superior <https://github.com/pypa/packaging-problems/issues/609>`_, e assim esta função não é fiável com tais instalações.
sv: Vissa redigerbara installationer, `levererar inte toppnamn <https://github.com/pypa/packaging-problems/issues/609>`_, och därför är denna funktion inte tillförlitlig med sådana installationer.

source: Distributions
pt_pt: Distribuições
sv: Utdelningar

source: Return a :class:`Distribution` instance describing the named distribution package.
pt_pt: Retorna uma instância :class:`Distribution` que descreve o pacote de distribuição nomeado.
sv: Returnerar en :class:`Distribution`-instans som beskriver det namngivna distributionspaketet.

source: Details of an installed distribution package.
pt_pt: Detalhes de um pacote de distribuição instalado.
sv: Detaljer om ett installerat distributionspaket.

source: Note: different :class:`!Distribution` instances do not currently compare equal, even if they relate to the same installed distribution and accordingly have the same attributes.
pt_pt: Nota: diferentes instâncias de :class:`!Distribution` atualmente não são comparadas como iguais, mesmo que se refiram à mesma distribuição instalada e, consequentemente, tenham os mesmos atributos.
sv: Observera: olika :class:`!Distribution`-instanser jämförs för närvarande inte på samma sätt, även om de hänför sig till samma installerade distribution och därmed har samma attribut.

source: While the module level API described above is the most common and convenient usage, you can get all of that information from the :class:`!Distribution` class. :class:`!Distribution` is an abstract object that represents the metadata for a Python `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_. You can get the concrete :class:`!Distribution` subclass instance for an installed distribution package by calling the :func:`distribution` function::
pt_pt: Embora a API de nível de módulo descrita acima seja a utilização mais comum e conveniente, pode obter todas essas informações a partir da classe :class:`!Distribution`. :class:`!Distribution` é um objeto abstrato que representa os metadados para um `Pacote de Distribuição do Python <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_. Pode obter a instância da subclasse concreta :class:`!Distribution` para um pacote de distribuição instalado chamando a função :func:`distribution`::
sv: Även om API:et på modulnivå som beskrivs ovan är den vanligaste och mest praktiska användningen, kan du få all denna information från klassen :class:`!Distribution`. :class:`!Distribution` är ett abstrakt objekt som representerar metadata för ett Python `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_. Du kan få den konkreta :class:`!Distribution`-underklassinstansen för ett installerat distributionspaket genom att anropa :func:`distribution`-funktionen::

source: Thus, an alternative way to get the version number is through the :class:`!Distribution` instance::
pt_pt: Assim, uma forma alternativa de obter o número de versão é através da instância :class:`!Distribution`::
sv: Ett alternativt sätt att få versionsnumret är alltså genom :class:`!Distribution`-instansen::

source: There are all kinds of additional metadata available on :class:`!Distribution` instances::
pt_pt: Existem todo o tipo de metadados adicionais disponíveis em instâncias :class:`!Distribution`::
sv: Det finns alla typer av ytterligare metadata tillgängliga för :class:`!Distribution`-instanser::

source: For editable packages, an ``origin`` property may present :pep:`610` metadata::
sv: För redigerbara paket kan en egenskap ``origin`` presentera :pep:`610`` metadata::

source: The ``.origin`` property was added.
sv: Egenskapen ``.origin`` har lagts till.

source: By default, this package provides built-in support for discovery of metadata for file system and zip file `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_\s. This metadata finder search defaults to ``sys.path``, but varies slightly in how it interprets those values from how other import machinery does. In particular:
pt_pt: Por defeito, este pacote fornece suporte integrado para a descoberta de metadados para sistemas de ficheiros e ficheiros zip de `Pacotes de Distribuição <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_. A pesquisa de metadados por defeito é ``sys.path``, mas varia ligeiramente na forma como interpreta esses valores em relação a outras máquinas de importação. Em particular:
sv: Som standard ger det här paketet inbyggt stöd för sökning av metadata för filsystem och zip-filer `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_\s. Denna metadatasökning använder som standard ``sys.path``, men skiljer sig något i hur den tolkar dessa värden från hur andra importmaskiner gör. I synnerhet:

source: ``importlib.metadata`` does not honor :class:`bytes` objects on ``sys.path``.
pt_pt: ``importlib.metadata`` não honra objetos :class:`bytes` em ``sys.path``.
sv: ``importlib.metadata`` respekterar inte :class:`bytes`\-objekt på ``sys.path``.

source: ``importlib.metadata`` will incidentally honor :py:class:`pathlib.Path` objects on ``sys.path`` even though such values will be ignored for imports.
pt_pt: ``importlib.metadata`` honrará incidentalmente objetos :py:class:`pathlib.Path` em ``sys.path``, embora tais valores sejam ignorados para importações.
sv: ``importlib.metadata`` kommer av en händelse att hedra :py:class:`pathlib.Path`\-objekt på ``sys.path`` även om sådana värden kommer att ignoreras för import.

source: Implementing Custom Providers
sv: Implementering av anpassade providers

source: ``importlib.metadata`` address two API surfaces, one for *consumers* and another for *providers*. Most users are consumers, consuming metadata provided by the packages. There are other use-cases, however, where users wish to expose metadata through some other mechanism, such as alongside a custom importer. Such a use case calls for a *custom provider*.
sv: ``importlib.metadata`` adresserar två API-ytor, en för *konsumenter* och en annan för *leverantörer*. De flesta användare är konsumenter och konsumerar metadata som tillhandahålls av paketen. Det finns dock andra användningsfall där användare vill exponera metadata genom någon annan mekanism, t.ex. tillsammans med en anpassad importör. Ett sådant användningsfall kräver en *custom provider*.

source: Because `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ metadata is not available through :data:`sys.path` searches, or package loaders directly, the metadata for a distribution is found through import system :ref:`finders <finders-and-loaders>`. To find a distribution package's metadata, ``importlib.metadata`` queries the list of :term:`meta path finders <meta path finder>` on :data:`sys.meta_path`.
sv: Eftersom metadata för `Distributionspaket &lt;https://packaging.python.org/en/latest/glossary/#term-Distribution-Package&gt;`_ inte är tillgängliga via :data:`sys.path`-sökningar eller paketladdare direkt, hittas metadata för en distribution via importsystemets :ref:`finders <finders-and-loaders>`. För att hitta metadata för ett distributionspaket frågar ``importlib.metadata`` listan över :term:`meta path finders <meta path finder>` på :data:`sys.meta_path`.

source: The implementation has hooks integrated into the ``PathFinder``, serving metadata for distribution packages found on the file system.
sv: Implementeringen har hooks integrerade i ``PathFinder``, som serverar metadata för distributionspaket som finns i filsystemet.

source: The abstract class :py:class:`importlib.abc.MetaPathFinder` defines the interface expected of finders by Python's import system. ``importlib.metadata`` extends this protocol by looking for an optional ``find_distributions`` callable on the finders from :data:`sys.meta_path` and presents this extended interface as the ``DistributionFinder`` abstract base class, which defines this abstract method::
pt_pt: A classe abstrata :py:class:`importlib.abc.MetaPathFinder` define a interface esperada dos finders pelo sistema de importação do Python. ``importlib.metadata`` estende este protocolo procurando por um ``find_distributions`` chamável opcional nos finders de :data:`sys.meta_path` e apresenta esta interface estendida como a classe base abstrata ``DistributionFinder``, que define este método abstrato::
sv: Den abstrakta klassen :py:class:`importlib.abc.MetaPathFinder` definierar det gränssnitt som Pythons importsystem förväntar sig av sökare. ``importlib.metadata`` utökar detta protokoll genom att leta efter en valfri ``find_distributions`` anropbar på sökarna från :data:`sys.meta_path` och presenterar detta utökade gränssnitt som den abstrakta basklassen ``DistributionFinder``, som definierar denna abstrakta metod::

source: The ``DistributionFinder.Context`` object provides ``.path`` and ``.name`` properties indicating the path to search and name to match and may supply other relevant context sought by the consumer.
sv: Objektet ``DistributionFinder.Context`` tillhandahåller egenskaperna ``.path`` och ``.name`` som anger sökvägen som ska sökas och namnet som ska matchas och kan tillhandahålla annan relevant kontext som efterfrågas av konsumenten.

source: In practice, to support finding distribution package metadata in locations other than the file system, subclass ``Distribution`` and implement the abstract methods. Then from a custom finder, return instances of this derived ``Distribution`` in the ``find_distributions()`` method.
sv: I praktiken, för att stödja sökning av metadata för distributionspaket på andra platser än filsystemet, kan du underordna dig ``Distribution`` och implementera de abstrakta metoderna. Sedan från en anpassad sökare, returnera instanser av denna härledda ``Distribution`` i metoden ``find_distributions()``.

source: Example
sv: Exempel

source: Imagine a custom finder that loads Python modules from a database::
sv: Tänk dig en anpassad sökare som laddar Python-moduler från en databas::

source: That importer now presumably provides importable modules from a database, but it provides no metadata or entry points. For this custom importer to provide metadata, it would also need to implement ``DistributionFinder``::
sv: Den importören tillhandahåller nu antagligen importerbara moduler från en databas, men den tillhandahåller inga metadata eller ingångspunkter. För att denna anpassade importör ska kunna tillhandahålla metadata skulle den också behöva implementera ``DistributionFinder``::

source: In this way, ``query_distributions`` would return records for each distribution served by the database matching the query. For example, if ``requests-1.0`` is in the database, ``find_distributions`` would yield a ``DatabaseDistribution`` for ``Context(name='requests')`` or ``Context(name=None)``.
sv: På detta sätt skulle ``query_distributions`` returnera poster för varje distribution som betjänas av den databas som matchar frågan. Om till exempel ``requests-1.0`` finns i databasen, skulle ``find_distributions`` ge en ``DatabaseDistribution`` för ``Context(name='requests')`` eller ``Context(name=None)``.

source: For the sake of simplicity, this example ignores ``context.path``\. The ``path`` attribute defaults to ``sys.path`` and is the set of import paths to be considered in the search. A ``DatabaseImporter`` could potentially function without any concern for a search path. Assuming the importer does no partitioning, the "path" would be irrelevant. In order to illustrate the purpose of ``path``, the example would need to illustrate a more complex ``DatabaseImporter`` whose behavior varied depending on ``sys.path``/``PYTHONPATH``. In that case, the ``find_distributions`` should honor the ``context.path`` and only yield ``Distribution``\ s pertinent to that path.
sv: För enkelhetens skull ignorerar detta exempel ``context.path``\. Attributet ``path`` är som standard ``sys.path`` och är den uppsättning importvägar som ska beaktas i sökningen. En ``DatabaseImporter`` skulle potentiellt kunna fungera utan att behöva ta hänsyn till någon sökväg. Om importören inte gör någon partitionering skulle ”path” vara irrelevant. För att illustrera syftet med ``path`` skulle exemplet behöva illustrera en mer komplex ``DatabaseImporter`` vars beteende varierar beroende på ``sys.path``/``PYTHONPATH``. I det fallet bör ``find_distributions`` respektera ``context.path`` och endast ge ``Distribution``\s som är relevanta för den sökvägen.

source: ``DatabaseDistribution``, then, would look something like::
sv: ``DatabaseDistribution`` skulle då se ut ungefär som::

source: This basic implementation should provide metadata and entry points for packages served by the ``DatabaseImporter``, assuming that the ``record`` supplies suitable ``.name``, ``.version``, and ``.entry_points`` attributes.
sv: Denna grundläggande implementering bör tillhandahålla metadata och ingångspunkter för paket som betjänas av ``DatabaseImporter``, förutsatt att ``record`` tillhandahåller lämpliga attribut för ``.name``, ``.version`` och ``.entry_points``.

source: The ``DatabaseDistribution`` may also provide other metadata files, like ``RECORD`` (required for ``Distribution.files``) or override the implementation of ``Distribution.files``. See the source for more inspiration.
sv: ``DatabaseDistribution`` kan också tillhandahålla andra metadatafiler, som ``RECORD`` (krävs för ``Distribution.files``) eller åsidosätta implementeringen av ``Distribution.files``. Se källan för mer inspiration.

source: $ python -m venv example $ source example/bin/activate (example) $ python -m pip install wheel
pt_pt: $ python -m venv exemplo $ source exemplo/bin/activate (exemplo) $ python -m pip install wheel

source: (example) $ python >>> from importlib.metadata import version >>> version('wheel') '0.32.3'
pt_pt: (exemplo) $ python >>> from importlib.metadata import version >>> version('wheel') '0.32.3'

source: >>> list(metadata('wheel')) ['Metadata-Version', 'Name', 'Version', 'Summary', 'Home-page', 'Author', 'Author-email', 'Maintainer', 'Maintainer-email', 'License', 'Project-URL', 'Project-URL', 'Project-URL', 'Keywords', 'Platform', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Classifier', 'Requires-Python', 'Provides-Extra', 'Requires-Dist', 'Requires-Dist']
pt_pt: >>> list(metadata('wheel')) ['Versão-Metadados', 'Nome', 'Versão', 'Resumo', 'Página inicial', 'Autor', 'Email do autor', 'Responsável', 'Email do responsável', 'Licença', 'URL do projeto', 'URL do projeto', 'URL do projeto', 'Palavras-chave', 'Plataforma', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Classificador', 'Requer-Python', 'Fornece-Extra', 'Requer-Dist', 'Requer-Dist']

source: >>> sorted(eps.groups) ['console_scripts', 'distutils.commands', 'distutils.setup_keywords', 'egg_info.writers', 'setuptools.installation']
pt_pt: >>> sorted(eps.groups) ['scripts_consola', 'distutils.commands', 'distutils.setup_keywords', 'egg_info.writers', 'setuptools.installation']

source: >>> wheel_metadata['Requires-Python'] '>=2.7, !=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*'
pt_pt: >>> wheel_metadata['Requer-Python'] '>=2.7, !=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*'

source: >>> util.locate() PosixPath('/home/gustav/example/lib/site-packages/wheel/util.py')
pt_pt: >>> util.locate() PosixPath('/home/gustav/exemplo/lib/site-packages/wheel/util.py')

source: >>> dist.metadata['Requires-Python'] '>=2.7, !=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*' >>> dist.metadata['License'] 'MIT'
pt_pt: >>> dist.metadata['Requer-Python'] '>=2.7, !=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*' >>> dist.metadata['Licença'] 'MIT'

source: Distribution Discovery
pt_pt: Descoberta de distribuição
