Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/importlib.po
Languages: pt_pt, ru

source: Returns a combined list of strings representing all file suffixes for modules recognized by the standard import machinery. This is a helper for code which simply needs to know if a filesystem path potentially refers to a module without needing any details on the kind of module (for example, :func:`inspect.getmodulename`).
pt_pt: Retorna uma lista combinada de strings que representam todos os sufixos de ficheiros para módulos reconhecidos pela maquinaria de importação padrão. Isto é um auxiliar para código que simplesmente precisa de saber se um caminho no sistema de ficheiros refere-se potencialmente a um módulo sem precisar de quaisquer detalhes sobre o tipo de módulo (por exemplo, :func:`inspect.getmodulename`).
ru: Возвращает объединенный список строк, представляющих все суффиксы файлов для модулей, распознаваемых стандартным механизмом импорта. Это помощник для кода, которому просто нужно знать, потенциально ли путь файловой системы относится к модулю, без необходимости каких-либо подробностей о типе модуля (например, :func:`inspect.getmodulename`).

source: An :term:`importer` for built-in modules. All known built-in modules are listed in :data:`sys.builtin_module_names`. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
pt_pt: Um :term:`importador` para módulos integrados. Todos os módulos integrados conhecidos estão listados em :data:`sys.builtin_module_names`. Esta classe implementa as ABCs :class:`importlib.abc.MetaPathFinder` e :class:`importlib.abc.InspectLoader`.
ru: :term:`импортер` для встроенных модулей. Все известные встроенные модули перечислены в :data:`sys.builtin_module_names`. Этот класс реализует ABC :class:`importlib.abc.MetaPathFinder` и :class:`importlib.abc.InspectLoader`.

source: Only class methods are defined by this class to alleviate the need for instantiation.
pt_pt: Apenas métodos de classe são definidos por esta classe para evitar a necessidade de instanciar.
ru: В этом классе определяются только методы класса, чтобы избежать необходимости создания экземпляров.

source: As part of :pep:`489`, the builtin importer now implements :meth:`Loader.create_module` and :meth:`Loader.exec_module`
pt_pt: Como parte da :pep:`489`, o importador integrado agora implementa :meth:`Loader.create_module` e :meth:`Loader.exec_module`.
ru: В составе :pep:`489` встроенный импортер теперь реализует :meth:`Loader.create_module` и :meth:`Loader.exec_module`

source: An :term:`importer` for frozen modules. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
pt_pt: Um :term:`importador` para módulos congelados. Esta classe implementa as ABCs :class:`importlib.abc.MetaPathFinder` e :class:`importlib.abc.InspectLoader`.
ru: :term:`импортер` для замороженных модулей. Этот класс реализует ABC :class:`importlib.abc.MetaPathFinder` и :class:`importlib.abc.InspectLoader`.

source: Gained :meth:`~Loader.create_module` and :meth:`~Loader.exec_module` methods.
pt_pt: Obteve os métodos :meth:`~Loader.create_module` e :meth:`~Loader.exec_module`.
ru: Получены методы :meth:`~Loader.create_module` и :meth:`~Loader.exec_module`.

source: :term:`Finder <finder>` for modules declared in the Windows registry. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
pt_pt: :term:`Finder <finder>` para módulos declarados no registo do Windows. Esta classe implementa a ABC :class:`importlib.abc.MetaPathFinder`.
ru: :term:`Finder <finder>` для модулей, объявленных в реестре Windows. Этот класс реализует :class:`importlib.abc.MetaPathFinder` ABC.

source: Use :mod:`site` configuration instead. Future versions of Python may not enable this finder by default.
pt_pt: Use a configuração :mod:`site` em vez disso. Versões futuras do Python podem não ativar este *finder* por predefinição.
ru: Вместо этого используйте конфигурацию :mod:`site`. Будущие версии Python могут не включать этот механизм поиска по умолчанию.

source: A :term:`Finder <finder>` for :data:`sys.path` and package ``__path__`` attributes. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
pt_pt: Um :term:`Finder <finder>` para :data:`sys.path` e atributos ``__path__`` de pacotes. Esta classe implementa a ABC :class:`importlib.abc.MetaPathFinder`.
ru: :term:`Finder <finder>` для атрибутов :data:`sys.path` и пакета ``__path__``. Этот класс реализует :class:`importlib.abc.MetaPathFinder` ABC.

source: Class method that attempts to find a :term:`spec <module spec>` for the module specified by *fullname* on :data:`sys.path` or, if defined, on *path*. For each path entry that is searched, :data:`sys.path_importer_cache` is checked. If a non-false object is found then it is used as the :term:`path entry finder` to look for the module being searched for. If no entry is found in :data:`sys.path_importer_cache`, then :data:`sys.path_hooks` is searched for a finder for the path entry and, if found, is stored in :data:`sys.path_importer_cache` along with being queried about the module. If no finder is ever found then ``None`` is both stored in the cache and returned.
pt_pt: Método de classe que tenta encontrar uma :term:`especificação <module spec>` para o módulo especificado por *fullname* em :data:`sys.path` ou, se definido, em *path*. Para cada entrada de caminho pesquisada, :data:`sys.path_importer_cache` é verificado. Se for encontrado um objeto não falso, este é usado como :term:`path entry finder` para procurar o módulo em questão. Se nenhuma entrada for encontrada em :data:`sys.path_importer_cache`, então :data:`sys.path_hooks` é pesquisado por um *finder* para a entrada de caminho e, se encontrado, é armazenado em :data:`sys.path_importer_cache` e consultado sobre o módulo. Se nenhum *finder* for encontrado, ``None`` é armazenado na cache e retornado.
ru: Метод класса, который пытается найти :term:`spec <module spec>` для модуля, указанного *fullname* в :data:`sys.path` или, если определено, в *path*. Для каждой искомой записи пути проверяется :data:`sys.path_importer_cache`. Если найден неложный объект, то он используется в качестве :term:`поиска записи пути` для поиска искомого модуля. Если запись не найдена в :data:`sys.path_importer_cache`, то :data:`sys.path_hooks` ищет поисковик для записи пути и, если найден, сохраняется в :data:`sys.path_importer_cache` вместе с с запросом о модуле. Если искатель не найден, то ``None`` сохраняется в кеше и возвращается.

source: If the current working directory -- represented by an empty string -- is no longer valid then ``None`` is returned but no value is cached in :data:`sys.path_importer_cache`.
pt_pt: Se o diretório de trabalho atual — representado por uma string vazia — já não for válido, então ``None`` é retornado, mas nenhum valor é armazenado em cache em :data:`sys.path_importer_cache`.
ru: Если текущий рабочий каталог, представленный пустой строкой, больше не действителен, то возвращается None, но никакое значение не кэшируется в :data:`sys.path_importer_cache`.

source: Calls :meth:`importlib.abc.PathEntryFinder.invalidate_caches` on all finders stored in :data:`sys.path_importer_cache` that define the method. Otherwise entries in :data:`sys.path_importer_cache` set to ``None`` are deleted.
pt_pt: Chama :meth:`importlib.abc.PathEntryFinder.invalidate_caches` em todos os *finders* armazenados em :data:`sys.path_importer_cache` que definem o método. Caso contrário, as entradas em :data:`sys.path_importer_cache` definidas para ``None`` são eliminadas.
ru: Вызывает :meth:`importlib.abc.PathEntryFinder.invalidate_caches` для всех средств поиска, хранящихся в :data:`sys.path_importer_cache`, которые определяют метод. В противном случае записи в :data:`sys.path_importer_cache`, для которых установлено значение ``None``, удаляются.

source: Entries of ``None`` in :data:`sys.path_importer_cache` are deleted.
pt_pt: As entradas de ``None`` em :data:`sys.path_importer_cache` são eliminadas.
ru: Записи ``None`` в :data:`sys.path_importer_cache` удаляются.

source: Calls objects in :data:`sys.path_hooks` with the current working directory for ``''`` (i.e. the empty string).
pt_pt: Chama objetos em :data:`sys.path_hooks` com o diretório de trabalho atual para ``''`` (ou seja, a string vazia).
ru: Вызывает объекты в :data:`sys.path_hooks` с текущим рабочим каталогом для ``''`` (т.е. пустая строка).

source: A concrete implementation of :class:`importlib.abc.PathEntryFinder` which caches results from the file system.
pt_pt: Uma implementação concreta de :class:`importlib.abc.PathEntryFinder` que armazenar em cache os resultados do sistema de ficheiros.
ru: Конкретная реализация :class:`importlib.abc.PathEntryFinder`, которая кэширует результаты из файловой системы.

source: The *path* argument is the directory for which the finder is in charge of searching.
pt_pt: O argumento *path* é o diretório pelo qual o *finder* é responsável por pesquisar.
ru: Аргумент *path* — это каталог, в котором искатель отвечает за поиск.

source: The *loader_details* argument is a variable number of 2-item tuples each containing a loader and a sequence of file suffixes the loader recognizes. The loaders are expected to be callables which accept two arguments of the module's name and the path to the file found.
pt_pt: O argumento *loader_details* é um número variável de tuplos de 2 itens, cada um contendo um *loader* e uma sequência de sufixos de ficheiros que o *loader* reconhece. Espera-se que os *loaders* sejam chamáveis que aceitem dois argumentos: o nome do módulo e o caminho para o ficheiro encontrado.
ru: Аргумент *loader_details* представляет собой переменное количество кортежей из двух элементов, каждый из которых содержит загрузчик и последовательность файловых суффиксов, распознаваемых загрузчиком. Ожидается, что загрузчики будут вызываемыми объектами, которые принимают два аргумента: имя модуля и путь к найденному файлу.

source: The finder will cache the directory contents as necessary, making stat calls for each module search to verify the cache is not outdated. Because cache staleness relies upon the granularity of the operating system's state information of the file system, there is a potential race condition of searching for a module, creating a new file, and then searching for the module the new file represents. If the operations happen fast enough to fit within the granularity of stat calls, then the module search will fail. To prevent this from happening, when you create a module dynamically, make sure to call :func:`importlib.invalidate_caches`.
pt_pt: O *finder* armazenará em cache os conteúdos do diretório conforme necessário, fazendo chamadas de estatísticas para cada pesquisa de módulo para verificar se a cache não está desatualizada. Como a desatualização da cache depende da granularidade das informações de estado do sistema operativo sobre o sistema de ficheiros, existe uma potencial condição de corrida ao pesquisar um módulo, criar um novo ficheiro e, em seguida, pesquisar o módulo que o novo ficheiro representa. Se as operações acontecerem rapidamente o suficiente para caber na granularidade das chamadas de estatísticas, então a pesquisa do módulo falhará. Para evitar que isto aconteça, ao criar um módulo dinamicamente, certifique-se de chamar :func:`importlib.invalidate_caches`.
ru: Средство поиска будет кэшировать содержимое каталога по мере необходимости, выполняя статистические вызовы для каждого поиска модуля, чтобы убедиться, что кеш не устарел. Поскольку устаревание кэша зависит от детализации информации о состоянии файловой системы операционной системы, существует потенциальное состояние гонки при поиске модуля, создании нового файла, а затем поиске модуля, который представляет новый файл. Если операции выполняются достаточно быстро, чтобы соответствовать степени детализации вызовов статистики, поиск модуля завершится неудачно. Чтобы этого не произошло, при динамическом создании модуля обязательно вызывайте :func:`importlib.invalidate_caches`.

source: The path the finder will search in.
pt_pt: O caminho que o *finder* pesquisará.
ru: Путь, по которому будет искать искатель.

source: Attempt to find the spec to handle *fullname* within :attr:`path`.
pt_pt: Tenta encontrar a especificação para tratar *fullname* dentro de :attr:`path`.
ru: Попытайтесь найти спецификацию для обработки *fullname* в :attr:`path`.

source: Clear out the internal cache.
pt_pt: Limpa a cache interna.
ru: Очистите внутренний кэш.

source: A class method which returns a closure for use on :data:`sys.path_hooks`. An instance of :class:`FileFinder` is returned by the closure using the path argument given to the closure directly and *loader_details* indirectly.
pt_pt: Um método de classe que retorna uma closure para uso em :data:`sys.path_hooks`. Uma instância de :class:`FileFinder` é retornada pela closure usando o argumento de caminho dado diretamente à closure e *loader_details* indiretamente.
ru: Метод класса, который возвращает замыкание для использования в :data:`sys.path_hooks`. Экземпляр :class:`FileFinder` возвращается замыканием с использованием аргумента пути, заданного замыканию напрямую, и *loader_details* косвенно.

source: If the argument to the closure is not an existing directory, :exc:`ImportError` is raised.
pt_pt: Se o argumento para a closure não for um diretório existente, :exc:`ImportError` é levantado.
ru: Если аргумент закрытия не является существующим каталогом, возникает :exc:`ImportError`.

source: A concrete implementation of :class:`importlib.abc.SourceLoader` by subclassing :class:`importlib.abc.FileLoader` and providing some concrete implementations of other methods.
pt_pt: Uma implementação concreta de :class:`importlib.abc.SourceLoader` através da subclasse :class:`importlib.abc.FileLoader` e fornecendo algumas implementações concretas de outros métodos.
ru: Конкретная реализация :class:`importlib.abc.SourceLoader` путем создания подкласса :class:`importlib.abc.FileLoader` и предоставления некоторых конкретных реализаций других методов.

source: The name of the module that this loader will handle.
pt_pt: O nome do módulo que este *loader* tratará.
ru: Имя модуля, который будет обрабатывать этот загрузчик.

source: The path to the source file.
pt_pt: O caminho para o ficheiro de origem.
ru: Путь к исходному файлу.

source: Return ``True`` if :attr:`path` appears to be for a package.
pt_pt: Retorna ``True`` se :attr:`path` parecer ser de um pacote.
ru: Возвращайте ``True``, если :attr:`path` принадлежит пакету.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.path_stats`.
pt_pt: Implementação concreta de :meth:`importlib.abc.SourceLoader.path_stats`.
ru: Конкретная реализация :meth:`importlib.abc.SourceLoader.path_stats`.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.set_data`.
pt_pt: Implementação concreta de :meth:`importlib.abc.SourceLoader.set_data`.
ru: Конкретная реализация :meth:`importlib.abc.SourceLoader.set_data`.

source: Concrete implementation of :meth:`importlib.abc.Loader.load_module` where specifying the name of the module to load is optional.
pt_pt: Implementação concreta de :meth:`importlib.abc.Loader.load_module` onde especificar o nome do módulo a carregar é opcional.
ru: Конкретная реализация :meth:`importlib.abc.Loader.load_module`, где указание имени загружаемого модуля не является обязательным.

source: Use :meth:`importlib.abc.Loader.exec_module` instead.
pt_pt: Use :meth:`importlib.abc.Loader.exec_module` em vez disso.
ru: Вместо этого используйте :meth:`importlib.abc.Loader.exec_module`.

source: A concrete implementation of :class:`importlib.abc.FileLoader` which can import bytecode files (i.e. no source code files exist).
pt_pt: Uma implementação concreta de :class:`importlib.abc.FileLoader` que pode importar ficheiros de bytecode (ou seja, não existem ficheiros de código-fonte).
ru: Конкретная реализация :class:`importlib.abc.FileLoader`, которая может импортировать файлы байт-кода (т.е. файлы исходного кода не существуют).

source: Please note that direct use of bytecode files (and thus not source code files) inhibits your modules from being usable by all Python implementations or new versions of Python which change the bytecode format.
pt_pt: Note que o uso direto de ficheiros de bytecode (e, portanto, não de ficheiros de código-fonte) impede que os seus módulos sejam utilizáveis por todas as implementações do Python ou por novas versões do Python que alteram o formato do bytecode.
ru: Обратите внимание, что прямое использование файлов байт-кода (и, следовательно, не файлов исходного кода) препятствует использованию ваших модулей всеми реализациями Python или новыми версиями Python, которые меняют формат байт-кода.

source: The name of the module the loader will handle.
pt_pt: O nome do módulo que o *loader* tratará.
ru: Имя модуля, который будет обрабатывать загрузчик.

source: The path to the bytecode file.
pt_pt: O caminho para o ficheiro de bytecode.
ru: Путь к файлу байт-кода.

source: Determines if the module is a package based on :attr:`path`.
pt_pt: Determina se o módulo é um pacote com base em :attr:`path`.
ru: Определяет, является ли модуль пакетом на основе :attr:`path`.

source: Returns the code object for :attr:`name` created from :attr:`path`.
pt_pt: Retorna o objeto código para :attr:`name` criado a partir de :attr:`path`.
ru: Возвращает объект кода для :attr:`name`, созданный из :attr:`path`.

source: Returns ``None`` as bytecode files have no source when this loader is used.
pt_pt: Retorna ``None`` porque os ficheiros de bytecode não têm origem quando este *loader* é usado.
ru: Возвращает None, поскольку файлы байт-кода не имеют источника при использовании этого загрузчика.

source: A concrete implementation of :class:`importlib.abc.ExecutionLoader` for extension modules.
pt_pt: Uma implementação concreta de :class:`importlib.abc.ExecutionLoader` para módulos de extensão.
ru: Конкретная реализация :class:`importlib.abc.ExecutionLoader` для модулей расширения.

source: The *fullname* argument specifies the name of the module the loader is to support. The *path* argument is the path to the extension module's file.
pt_pt: O argumento *fullname* especifica o nome do módulo que o *loader* deve suportar. O argumento *path* é o caminho para o ficheiro do módulo de extensão.
ru: Аргумент *fullname* указывает имя модуля, который должен поддерживать загрузчик. Аргумент *path* — это путь к файлу модуля расширения.

source: Note that, by default, importing an extension module will fail in subinterpreters if it doesn't implement multi-phase init (see :pep:`489`), even if it would otherwise import successfully.
pt_pt: Note que, por predefinição, a importação de um módulo de extensão falhará em subinterpretadores se não implementar a inicialização em várias fases (ver :pep:`489`), mesmo que, de outra forma, fosse importado com sucesso.
ru: Обратите внимание, что по умолчанию импорт модуля расширения завершится неудачей в подинтерпретаторах, если он не реализует многофазную инициализацию (см. :pep:`489`), даже если в противном случае импорт будет успешным.

source: Multi-phase init is now required for use in subinterpreters.
pt_pt: A inicialização em várias fases é agora necessária para uso em subinterpretadores.
ru: Многофазная инициализация теперь требуется для использования в субинтерпретаторах.

source: Name of the module the loader supports.
pt_pt: Nome do módulo que o *loader* suporta.
ru: Имя модуля, который поддерживает загрузчик.

source: Path to the extension module.
pt_pt: Caminho para o módulo de extensão.
ru: Путь к модулю расширения.

source: Creates the module object from the given specification in accordance with :pep:`489`.
pt_pt: Cria o objeto módulo a partir da especificação dada de acordo com :pep:`489`.
ru: Создает объект модуля из заданной спецификации в соответствии с :pep:`489`.

source: Initializes the given module object in accordance with :pep:`489`.
pt_pt: Inicializa o objeto módulo dado de acordo com :pep:`489`.
ru: Инициализирует данный объект модуля в соответствии с :pep:`489`.

source: Returns ``None`` as extension modules lack a code object.
pt_pt: Retorna ``None`` porque os módulos de extensão não têm um objeto código.
ru: Возвращает None, поскольку в модулях расширения отсутствует объект кода.

source: Returns ``None`` as extension modules do not have source code.
pt_pt: Retorna ``None`` porque os módulos de extensão não têm código-fonte.
ru: Возвращает None, поскольку модули расширения не имеют исходного кода.

source: A concrete implementation of :class:`importlib.abc.InspectLoader` for namespace packages. This is an alias for a private class and is only made public for introspecting the ``__loader__`` attribute on namespace packages::
pt_pt: Uma implementação concreta de :class:`importlib.abc.InspectLoader` para pacotes de namespace. Isto é um alias para uma classe privada e é tornado público apenas para introspeção do atributo ``__loader__`` em pacotes de namespace::
ru: Конкретная реализация :class:`importlib.abc.InspectLoader` для пакетов пространства имен. Это псевдоним частного класса, который публикуется только для анализа атрибута ``__loader__`` в пакетах пространства имен::

source: A specification for a module's import-system-related state. This is typically exposed as the module's :attr:`~module.__spec__` attribute. Many of these attributes are also available directly on a module: for example, ``module.__spec__.origin == module.__file__``. Note, however, that while the *values* are usually equivalent, they can differ since there is no synchronization between the two objects. For example, it is possible to update the module's :attr:`~module.__file__` at runtime and this will not be automatically reflected in the module's :attr:`__spec__.origin <ModuleSpec.origin>`, and vice versa.
pt_pt: Uma especificação para o estado relacionado com o sistema de importação de um módulo. Isto é tipicamente exposto como o atributo :attr:`~module.__spec__` do módulo. Muitos destes atributos também estão disponíveis diretamente num módulo: por exemplo, ``module.__spec__.origin == module.__file__``. No entanto, note que, embora os *valores* sejam geralmente equivalentes, podem diferir, uma vez que não há sincronização entre os dois objetos. Por exemplo, é possível atualizar o :attr:`~module.__file__` do módulo em tempo de execução e isto não será automaticamente refletido no :attr:`__spec__.origin <ModuleSpec.origin>` do módulo, e vice-versa.
ru: Спецификация состояния модуля, связанного с системой импорта. Обычно это указывается как атрибут :attr:`~module.__spec__` модуля. Многие из этих атрибутов также доступны непосредственно в модуле: например, ``module.__spec__.origin == module.__file__``. Однако обратите внимание, что хотя *значения* обычно эквивалентны, они могут различаться, поскольку между двумя объектами нет синхронизации. Например, можно обновить :attr:`~module.__file__` модуля во время выполнения, и это не будет автоматически отражено в :attr:`__spec__.origin <ModuleSpec.origin>` модуля, и наоборот.

source: The module's fully qualified name (see :attr:`module.__name__`). The :term:`finder` should always set this attribute to a non-empty string.
pt_pt: O nome totalmente qualificado do módulo (ver :attr:`module.__name__`). O :term:`finder` deve sempre definir este atributo para uma string não vazia.
ru: Полное имя модуля (см. :attr:`module.__name__`). :term:`finder` всегда должен устанавливать для этого атрибута непустую строку.
