Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/locale.po
Languages: ru

source: :mod:`!locale` --- Internationalization services
ru: :mod:`!locale` --- Службы интернационализации

source: **Source code:** :source:`Lib/locale.py`
ru: **Исходный код:** :source:`Lib/locale.py`

source: The :mod:`locale` module opens access to the POSIX locale database and functionality. The POSIX locale mechanism allows programmers to deal with certain cultural issues in an application, without requiring the programmer to know all the specifics of each country where the software is executed.
ru: Модуль :mod:`locale` открывает доступ к базе данных и функциям локали POSIX. Механизм локали POSIX позволяет программистам решать определенные культурные проблемы в приложении, не требуя от программиста знания всех особенностей каждой страны, в которой выполняется программное обеспечение.

source: The :mod:`locale` module is implemented on top of the :mod:`!_locale` module, which in turn uses an ANSI C locale implementation if available.
ru: Модуль :mod:`locale` реализован поверх модуля :mod:`!_locale`, который, в свою очередь, использует реализацию локали ANSI C, если она доступна.

source: The :mod:`locale` module defines the following exception and functions:
ru: Модуль :mod:`locale` определяет следующее исключение и функции:

source: Exception raised when the locale passed to :func:`setlocale` is not recognized.
ru: Исключение возникает, когда локаль, переданная в :func:`setlocale`, не распознается.

source: If *locale* is omitted or ``None``, the current setting for *category* is returned.
ru: Если *locale* опущено или ``None``, возвращается текущая настройка для *category*.

source: Example::
ru: Пример::

source: This sets the locale for all categories to the user's default setting (typically specified in the :envvar:`LANG` environment variable). If the locale is not changed thereafter, using multithreading should not cause problems.
ru: При этом для всех категорий устанавливается языковой стандарт, заданный пользователем по умолчанию (обычно указанный в переменной среды :envvar:`LANG`). Если после этого локаль не изменится, использование многопоточности не должно вызвать проблем.

source: Returns the database of the local conventions as a dictionary. This dictionary has the following strings as keys:
ru: Возвращает базу данных локальных соглашений в виде словаря. Этот словарь имеет следующие строки в качестве ключей:

source: Category
ru: Категория

source: Key
ru: Клавиша

source: Meaning
ru: Значение

source: Decimal point character.
ru: Символ десятичной точки.

source: Sequence of numbers specifying which relative positions the ``'thousands_sep'`` is expected. If the sequence is terminated with :const:`CHAR_MAX`, no further grouping is performed. If the sequence terminates with a ``0``, the last group size is repeatedly used.
ru: Последовательность чисел, определяющая, в каких относительных позициях ожидается "thousands_sep". Если последовательность завершается :const:`CHAR_MAX`, дальнейшая группировка не выполняется. Если последовательность заканчивается цифрой «0», повторно используется последний размер группы.

source: Character used between groups.
ru: Символ, используемый между группами.

source: International currency symbol.
ru: Символ международной валюты.

source: Local currency symbol.
ru: Символ местной валюты.

source: Whether the currency symbol precedes the value (for positive resp. negative values).
ru: Предшествует ли символ валюты значению (для положительных или отрицательных значений).

source: Whether the currency symbol is separated from the value by a space (for positive resp. negative values).
ru: Отделяется ли символ валюты от значения пробелом (для положительных или отрицательных значений).

source: Decimal point used for monetary values.
ru: Десятичная точка, используемая для денежных значений.

source: Number of fractional digits used in local formatting of monetary values.
ru: Количество дробных цифр, используемых в локальном форматировании денежных значений.

source: Number of fractional digits used in international formatting of monetary values.
ru: Количество дробных цифр, используемых в международном форматировании денежных значений.

source: Group separator used for monetary values.
ru: Разделитель групп, используемый для денежных значений.

source: Equivalent to ``'grouping'``, used for monetary values.
ru: Эквивалент «группировки», используемой для денежных значений.

source: Symbol used to annotate a positive monetary value.
ru: Символ, используемый для обозначения положительной денежной стоимости.

source: Symbol used to annotate a negative monetary value.
ru: Символ, используемый для обозначения отрицательной денежной стоимости.

source: The position of the sign (for positive resp. negative values), see below.
ru: Положение знака (для положительных и отрицательных значений) см. ниже.

source: All numeric values can be set to :const:`CHAR_MAX` to indicate that there is no value specified in this locale.
ru: Для всех числовых значений можно установить значение :const:`CHAR_MAX`, чтобы указать, что в этой локали не указано никакого значения.

source: The possible values for ``'p_sign_posn'`` and ``'n_sign_posn'`` are given below.
ru: Возможные значения для ``'p_sign_posn'`` и ``'n_sign_posn'`` приведены ниже.

source: Value
ru: Значение

source: Explanation
ru: Пояснение

source: Currency and value are surrounded by parentheses.
ru: Валюта и стоимость заключаются в круглые скобки.

source: The sign should precede the value and currency symbol.
ru: Знак должен предшествовать значению и символу валюты.

source: The sign should follow the value and currency symbol.
ru: Знак должен следовать за символом стоимости и валюты.

source: The sign should immediately precede the value.
ru: Знак должен непосредственно предшествовать значению.

source: The sign should immediately follow the value.
ru: Знак должен следовать сразу за значением.

source: Nothing is specified in this locale.
ru: В этой локали ничего не указано.

source: The function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale or the ``LC_MONETARY`` locale if locales are different and numeric or monetary strings are non-ASCII. This temporary change affects other threads.
ru: Функция временно устанавливает для локали ``LC_CTYPE`` локаль ``LC_NUMERIC`` или локаль ``LC_MONETARY``, если локали различаются, а числовые или денежные строки не являются ASCII. Это временное изменение влияет на другие потоки.

source: The function now temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
ru: В некоторых случаях функция теперь временно устанавливает локаль LC_CTYPE на локаль LC_NUMERIC.

source: Return some locale-specific information as a string. This function is not available on all systems, and the set of possible options might also vary across platforms. The possible argument values are numbers, for which symbolic constants are available in the locale module.
ru: Возвращает некоторую информацию о локали в виде строки. Эта функция доступна не во всех системах, а набор возможных опций также может различаться в зависимости от платформы. Возможные значения аргументов — числа, для которых в модуле локали доступны символические константы.

source: The :func:`nl_langinfo` function accepts one of the following keys. Most descriptions are taken from the corresponding description in the GNU C library.
ru: Функция :func:`nl_langinfo` принимает один из следующих ключей. Большинство описаний взято из соответствующего описания в библиотеке GNU C.

source: Get a string with the name of the character encoding used in the selected locale.
ru: Получите строку с именем кодировки символов, используемой в выбранной локали.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent date and time in a locale-specific way.
ru: Получите строку, которую можно использовать в качестве строки формата для :func:`time.strftime` для представления даты и времени в зависимости от локали.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a date in a locale-specific way.
ru: Получите строку, которую можно использовать в качестве строки формата для :func:`time.strftime` для представления даты в зависимости от локали.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a time in a locale-specific way.
ru: Получите строку, которую можно использовать в качестве строки формата для :func:`time.strftime` для представления времени в зависимости от локали.

source: Get a format string for :func:`time.strftime` to represent time in the am/pm format.
ru: Получите строку формата для :func:`time.strftime`, чтобы представить время в формате am/pm.

source: Get the name of the n-th day of the week.
ru: Получить название n-го дня недели.

source: This follows the US convention of :const:`DAY_1` being Sunday, not the international convention (ISO 8601) that Monday is the first day of the week.
ru: Это соответствует американскому соглашению о том, что :const:`DAY_1` означает воскресенье, а не международному соглашению (ISO 8601), согласно которому понедельник является первым днем ​​недели.

source: Get the abbreviated name of the n-th day of the week.
ru: Получите сокращенное название n-го дня недели.

source: Get the name of the n-th month.
ru: Получите название n-го месяца.

source: Get the abbreviated name of the n-th month.
ru: Получите сокращенное название n-го месяца.

source: Get the radix character (decimal dot, decimal comma, etc.).
ru: Получите символ системы счисления (десятичная точка, десятичная запятая и т. д.).

source: Get the separator character for thousands (groups of three digits).
ru: Получите символ-разделитель тысяч (группы из трех цифр).

source: Get a regular expression that can be used with the regex function to recognize a positive response to a yes/no question.
ru: Получите регулярное выражение, которое можно использовать с функцией регулярного выражения для распознавания положительного ответа на вопрос «да/нет».

source: Get a regular expression that can be used with the ``regex(3)`` function to recognize a negative response to a yes/no question.
ru: Получите регулярное выражение, которое можно использовать с функцией ``regex(3)`` для распознавания отрицательного ответа на вопрос да/нет.

source: The regular expressions for :const:`YESEXPR` and :const:`NOEXPR` use syntax suitable for the ``regex`` function from the C library, which might differ from the syntax used in :mod:`re`.
ru: Регулярные выражения для :const:`YESEXPR` и :const:`NOEXPR` используют синтаксис, подходящий для функции ``regex`` из библиотеки C, который может отличаться от синтаксиса, используемого в :mod:`re`.

source: Get the currency symbol, preceded by "-" if the symbol should appear before the value, "+" if the symbol should appear after the value, or "." if the symbol should replace the radix character.
ru: Получите символ валюты, которому предшествует «-», если символ должен появиться перед значением, «+», если символ должен появиться после значения, или «.» если символ должен заменить символ системы счисления.

source: Get a string which describes how years are counted and displayed for each era in a locale.
ru: Получите строку, описывающую, как подсчитываются и отображаются годы для каждой эпохи в языковом стандарте.

source: Most locales do not define this value. An example of a locale which does define this value is the Japanese one. In Japan, the traditional representation of dates includes the name of the era corresponding to the then-emperor's reign.
ru: Большинство локалей не определяют это значение. Примером локали, которая определяет это значение, является японский. В Японии традиционное представление дат включает название эпохи, соответствующей правлению тогдашнего императора.

source: Normally it should not be necessary to use this value directly. Specifying the ``E`` modifier in their format strings causes the :func:`time.strftime` function to use this information. The format of the returned string is specified in *The Open Group Base Specifications Issue 8*, paragraph `7.3.5.2 LC_TIME C-Language Access <https://pubs.opengroup.org/onlinepubs/9799919799/basedefs/V1_chap07.html#tag_07_03_05_02>`_.
ru: Обычно нет необходимости использовать это значение напрямую. Указание модификатора ``E`` в строках формата заставляет функцию :func:`time.strftime` использовать эту информацию. Формат возвращаемой строки указан в *Базовых спецификациях открытой группы, выпуск 8*, параграф `7.3.5.2 LC_TIME Доступ к языку C <https://pubs.opengroup.org/onlinepubs/9799919799/basedefs/V1_chap07.html# tag_07_03_05_02>`_.

source: Get a format string for :func:`time.strftime` to represent date and time in a locale-specific era-based way.
ru: Получите строку формата для :func:`time.strftime`, чтобы представить дату и время в соответствии с эпохой, зависящей от локали.

source: Get a format string for :func:`time.strftime` to represent a date in a locale-specific era-based way.
ru: Получите строку формата для :func:`time.strftime`, чтобы представить дату в зависимости от эпохи в зависимости от локали.

source: Get a format string for :func:`time.strftime` to represent a time in a locale-specific era-based way.
ru: Получите строку формата для :func:`time.strftime`, чтобы представить время в соответствии с эпохой, зависящей от локали.

source: Get a string consisting of up to 100 semicolon-separated symbols used to represent the values 0 to 99 in a locale-specific way. In most locales this is an empty string.
ru: Получите строку, содержащую до 100 символов, разделенных точкой с запятой, которые используются для представления значений от 0 до 99 в зависимости от языкового стандарта. В большинстве локалей это пустая строка.

source: Tries to determine the default locale settings and returns them as a tuple of the form ``(language code, encoding)``.
ru: Пытается определить настройки локали по умолчанию и возвращает их в виде кортежа в форме ``(код языка, кодировка)``.

source: According to POSIX, a program which has not called ``setlocale(LC_ALL, '')`` runs using the portable ``'C'`` locale. Calling ``setlocale(LC_ALL, '')`` lets it use the default locale as defined by the :envvar:`LANG` variable. Since we do not want to interfere with the current locale setting we thus emulate the behavior in the way described above.
ru: Согласно POSIX, программа, которая не вызвала ``setlocale(LC_ALL, '')``, работает с использованием переносимой локали ``'C'``. Вызов ``setlocale(LC_ALL, '')`` позволяет использовать локаль по умолчанию, определенную переменной :envvar:`LANG`. Поскольку мы не хотим вмешиваться в текущие настройки локали, мы эмулируем поведение, как описано выше.

source: To maintain compatibility with other platforms, not only the :envvar:`LANG` variable is tested, but a list of variables given as envvars parameter. The first found to be defined will be used. *envvars* defaults to the search path used in GNU gettext; it must always contain the variable name ``'LANG'``. The GNU gettext search path contains ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` and ``'LANGUAGE'``, in that order.
ru: Для обеспечения совместимости с другими платформами проверяется не только переменная :envvar:`LANG`, но и список переменных, заданный в качестве параметра envvars. Будет использоваться первое найденное определение. *envvars* по умолчанию соответствует пути поиска, используемому в GNU gettext; он всегда должен содержать имя переменной ``'LANG'``. Путь поиска gettext GNU содержит ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` и ``'LANGUAGE'`` в указанном порядке.

source: Return the :term:`locale encoding` used for text data, according to user preferences. User preferences are expressed differently on different systems, and might not be available programmatically on some systems, so this function only returns a guess.
ru: Возвращает кодировку локали, используемую для текстовых данных, в соответствии с предпочтениями пользователя. Предпочтения пользователя выражаются по-разному в разных системах и могут быть недоступны программно в некоторых системах, поэтому эта функция возвращает только предположение.

source: On some systems, it is necessary to invoke :func:`setlocale` to obtain the user preferences, so this function is not thread-safe. If invoking setlocale is not necessary or desired, *do_setlocale* should be set to ``False``.
ru: В некоторых системах необходимо вызвать :func:`setlocale` для получения пользовательских настроек, поэтому эта функция не является потокобезопасной. Если вызов setlocale не является необходимым или нежелательным, для *do_setlocale* должно быть установлено значение «False».

source: On Android or if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, always return ``'utf-8'``, the :term:`locale encoding` and the *do_setlocale* argument are ignored.
ru: На Android или если включен режим Python UTF-8 <utf8-mode>, всегда возвращайте ``'utf-8'``, кодировка :term:`locale` и аргумент *do_setlocale* имеют значение игнорируется.

source: The :ref:`Python preinitialization <c-preinit>` configures the LC_CTYPE locale. See also the :term:`filesystem encoding and error handler`.
ru: :ref:`Предварительная инициализация Python <c-preinit>` настраивает локаль LC_CTYPE. См. также :term:`кодирование файловой системы и обработчик ошибок`.

source: The function now always returns ``"utf-8"`` on Android or if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled.
ru: Функция теперь всегда возвращает ``"utf-8"`` на Android или если включен режим Python UTF-8 <utf8-mode>`.

source: Get the current :term:`locale encoding`:
ru: Получите текущую :term:`кодировку локали`:

source: On Android and VxWorks, return ``"utf-8"``.
ru: В Android и VxWorks верните ``"utf-8"``.

source: On Unix, return the encoding of the current :data:`LC_CTYPE` locale. Return ``"utf-8"`` if ``nl_langinfo(CODESET)`` returns an empty string: for example, if the current LC_CTYPE locale is not supported.
ru: В Unix верните кодировку текущей локали :data:`LC_CTYPE`. Верните ``"utf-8"``, если ``nl_langinfo(CODESET)`` возвращает пустую строку: например, если текущая локаль LC_CTYPE не поддерживается.

source: On Windows, return the ANSI code page.
ru: В Windows верните кодовую страницу ANSI.

source: This function is similar to :func:`getpreferredencoding(False) <getpreferredencoding>` except this function ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
ru: Эта функция аналогична :func:`getpreferredencoding(False) <getpreferredencoding>` за исключением того, что эта функция игнорирует :ref:`Python UTF-8 Mode <utf8-mode>`.

source: Returns a normalized locale code for the given locale name. The returned locale code is formatted for use with :func:`setlocale`. If normalization fails, the original name is returned unchanged.
ru: Возвращает нормализованный код локали для данного имени локали. Возвращенный код локали отформатирован для использования с :func:`setlocale`. Если нормализация не удалась, исходное имя возвращается без изменений.

source: If the given encoding is not known, the function defaults to the default encoding for the locale code just like :func:`setlocale`.
ru: Если данная кодировка неизвестна, функция по умолчанию использует кодировку по умолчанию для кода локали, как и :func:`setlocale`.

source: Compares two strings according to the current :const:`LC_COLLATE` setting. As any other compare function, returns a negative, or a positive value, or ``0``, depending on whether *string1* collates before or after *string2* or is equal to it.
ru: Сравнивает две строки в соответствии с текущей настройкой :const:`LC_COLLATE`. Как и любая другая функция сравнения, возвращает отрицательное или положительное значение или ``0``, в зависимости от того, сравнивается ли *string1* до или после *string2* или равна ей.

source: Transforms a string to one that can be used in locale-aware comparisons. For example, ``strxfrm(s1) < strxfrm(s2)`` is equivalent to ``strcoll(s1, s2) < 0``. This function can be used when the same string is compared repeatedly, e.g. when collating a sequence of strings.
ru: Преобразует строку в строку, которую можно использовать в сравнениях с учетом локали. Например, ``strxfrm(s1) < strxfrm(s2)`` эквивалентно ``strcoll(s1, s2) < 0``. Эту функцию можно использовать, когда одна и та же строка сравнивается неоднократно, например, при сопоставлении последовательности строк.

source: Formats a number *val* according to the current :const:`LC_NUMERIC` setting. The format follows the conventions of the ``%`` operator. For floating-point values, the decimal point is modified if appropriate. If *grouping* is ``True``, also takes the grouping into account.
ru: Форматирует число *val* в соответствии с текущей настройкой :const:`LC_NUMERIC`. Формат соответствует соглашениям оператора ``%``. Для значений с плавающей запятой десятичная точка изменяется, если это необходимо. Если *grouping* имеет значение True, группировка также учитывается.

source: If *monetary* is true, the conversion uses monetary thousands separator and grouping strings.
ru: Если *monetary* имеет значение true, при преобразовании используются разделитель тысяч в денежном выражении и строки группировки.

source: Processes formatting specifiers as in ``format % val``, but takes the current locale settings into account.
ru: Обрабатывает спецификаторы форматирования, как в ``format % val``, но принимает во внимание текущие настройки локали.

source: The *monetary* keyword parameter was added.
ru: Был добавлен параметр ключевого слова *monetary*.

source: Formats a number *val* according to the current :const:`LC_MONETARY` settings.
ru: Форматирует число *val* в соответствии с текущими настройками :const:`LC_MONETARY`.

source: The returned string includes the currency symbol if *symbol* is true, which is the default. If *grouping* is ``True`` (which is not the default), grouping is done with the value. If *international* is ``True`` (which is not the default), the international currency symbol is used.
ru: Возвращаемая строка включает символ валюты, если *symbol* имеет значение true (это значение по умолчанию). Если *grouping* имеет значение True (что не является значением по умолчанию), группировка выполняется по значению. Если *international* имеет значение True (что не является значением по умолчанию), используется символ международной валюты.

source: This function will not work with the 'C' locale, so you have to set a locale via :func:`setlocale` first.
ru: Эта функция не будет работать с локалью «C», поэтому сначала вам необходимо установить локаль с помощью :func:`setlocale`.

source: Formats a floating-point number using the same format as the built-in function ``str(float)``, but takes the decimal point into account.
ru: Форматирует число с плавающей запятой, используя тот же формат, что и встроенная функция str(float), но учитывает десятичную точку.

source: Converts a string into a normalized number string, following the :const:`LC_NUMERIC` settings.
ru: Преобразует строку в нормализованную числовую строку в соответствии с настройками :const:`LC_NUMERIC`.

source: Converts a normalized number string into a formatted string following the :const:`LC_NUMERIC` settings.
ru: Преобразует нормализованную числовую строку в форматированную строку в соответствии с настройками :const:`LC_NUMERIC`.

source: Converts a string to a number, following the :const:`LC_NUMERIC` settings, by calling *func* on the result of calling :func:`delocalize` on *string*.
ru: Преобразует строку в число в соответствии с настройками :const:`LC_NUMERIC`, вызывая *func* в результате вызова :func:`delocalize` для *string*.

source: Converts a string to an integer, following the :const:`LC_NUMERIC` conventions.
ru: Преобразует строку в целое число, следуя соглашениям :const:`LC_NUMERIC`.
