Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/locale.po
Languages: ru

source: Locale category for the character type functions. Most importantly, this category defines the text encoding, i.e. how bytes are interpreted as Unicode codepoints. See :pep:`538` and :pep:`540` for how this variable might be automatically coerced to ``C.UTF-8`` to avoid issues created by invalid settings in containers or incompatible settings passed over remote SSH connections.
ru: Категория локали для функций типа символов. Самое главное, эта категория определяет кодировку текста, то есть то, как байты интерпретируются как кодовые точки Unicode. См. :pep:`538` и :pep:`540`, чтобы узнать, как эта переменная может быть автоматически приведена к ``C.UTF-8``, чтобы избежать проблем, создаваемых недопустимыми настройками в контейнерах или несовместимыми настройками, передаваемыми через удаленные соединения SSH.

source: Locale category for sorting strings. The functions :func:`strcoll` and :func:`strxfrm` of the :mod:`locale` module are affected.
ru: Категория локали для сортировки строк. Затрагиваются функции :func:`strcoll` и :func:`strxfrm` модуля :mod:`locale`.

source: Locale category for the formatting of time. The function :func:`time.strftime` follows these conventions.
ru: Категория локали для форматирования времени. Функция :func:`time.strftime` следует этим соглашениям.

source: Locale category for formatting of monetary values. The available options are available from the :func:`localeconv` function.
ru: Категория локали для форматирования денежных значений. Доступные параметры доступны из функции :func:`localeconv`.

source: Locale category for message display. Python currently does not support application specific locale-aware messages. Messages displayed by the operating system, like those returned by :func:`os.strerror` might be affected by this category.
ru: Категория локали для отображения сообщений. Python в настоящее время не поддерживает сообщения, зависящие от локали приложения. Эта категория может влиять на сообщения, отображаемые операционной системой, например, возвращаемые :func:`os.strerror`.

source: This value may not be available on operating systems not conforming to the POSIX standard, most notably Windows.
ru: Это значение может быть недоступно в операционных системах, не соответствующих стандарту POSIX, особенно в Windows.

source: Locale category for formatting numbers. The functions :func:`format_string`, :func:`atoi`, :func:`atof` and :func:`.str` of the :mod:`locale` module are affected by that category. All other numeric formatting operations are not affected.
ru: Категория локали для форматирования чисел. Эта категория влияет на функции :func:`format_string`, :func:`atoi`, :func:`atof` и :func:`.str` модуля :mod:`locale`. Все остальные операции числового форматирования не затрагиваются.

source: Combination of all locale settings. If this flag is used when the locale is changed, setting the locale for all categories is attempted. If that fails for any category, no category is changed at all. When the locale is retrieved using this flag, a string indicating the setting for all categories is returned. This string can be later used to restore the settings.
ru: Комбинация всех настроек локали. Если этот флаг используется при изменении языкового стандарта, предпринимается попытка установить языковой стандарт для всех категорий. Если это не удается для какой-либо категории, ни одна категория не изменяется вообще. Когда локаль извлекается с использованием этого флага, возвращается строка, указывающая настройку для всех категорий. Эту строку позже можно использовать для восстановления настроек.

source: This is a symbolic constant used for different values returned by :func:`localeconv`.
ru: Это символическая константа, используемая для различных значений, возвращаемых :func:`localeconv`.

source: Background, details, hints, tips and caveats
ru: Предыстория, подробности, подсказки, подсказки и предостережения

source: The C standard defines the locale as a program-wide property that may be relatively expensive to change. On top of that, some implementations are broken in such a way that frequent locale changes may cause core dumps. This makes the locale somewhat painful to use correctly.
ru: Стандарт C определяет локаль как общепрограммное свойство, изменение которого может оказаться относительно дорогостоящим. Кроме того, некоторые реализации сломаны таким образом, что частые изменения локали могут привести к дампам ядра. Это делает использование локали несколько болезненным.

source: Initially, when a program is started, the locale is the ``C`` locale, no matter what the user's preferred locale is. There is one exception: the :data:`LC_CTYPE` category is changed at startup to set the current locale encoding to the user's preferred locale encoding. The program must explicitly say that it wants the user's preferred locale settings for other categories by calling ``setlocale(LC_ALL, '')``.
ru: Первоначально, когда программа запускается, локалью является локаль C, независимо от того, какую локаль предпочитает пользователь. Есть одно исключение: категория :data:`LC_CTYPE` изменяется при запуске, чтобы установить текущую кодировку локали на предпочтительную кодировку локали пользователя. Программа должна явно указать, что ей нужны предпочтительные настройки локали пользователя для других категорий, вызвав ``setlocale(LC_ALL, '')``.

source: It is generally a bad idea to call :func:`setlocale` in some library routine, since as a side effect it affects the entire program. Saving and restoring it is almost as bad: it is expensive and affects other threads that happen to run before the settings have been restored.
ru: Как правило, вызывать :func:`setlocale` в какой-либо библиотечной процедуре - плохая идея, поскольку в качестве побочного эффекта это влияет на всю программу. Сохранять и восстанавливать его почти так же плохо: это дорого и влияет на другие потоки, которые выполняются до восстановления настроек.

source: If, when coding a module for general use, you need a locale independent version of an operation that is affected by the locale (such as certain formats used with :func:`time.strftime`), you will have to find a way to do it without using the standard library routine. Even better is convincing yourself that using locale settings is okay. Only as a last resort should you document that your module is not compatible with non-\ ``C`` locale settings.
ru: Если при кодировании модуля для общего использования вам нужна независимая от локали версия операции, на которую влияет локаль (например, определенные форматы, используемые с :func:`time.strftime`), вам придется найти способ сделайте это, не используя стандартную библиотечную процедуру. Еще лучше убедить себя, что использовать настройки локали — это нормально. Только в крайнем случае вам следует задокументировать, что ваш модуль несовместим с настройками локали, отличными от ``C``.

source: The only way to perform numeric operations according to the locale is to use the special functions defined by this module: :func:`atof`, :func:`atoi`, :func:`format_string`, :func:`.str`.
ru: Единственный способ выполнять числовые операции в соответствии с локалью — использовать специальные функции, определенные в этом модуле: :func:`atof`, :func:`atoi`, :func:`format_string`, :func:`.str` .

source: There is no way to perform case conversions and character classifications according to the locale. For (Unicode) text strings these are done according to the character value only, while for byte strings, the conversions and classifications are done according to the ASCII value of the byte, and bytes whose high bit is set (i.e., non-ASCII bytes) are never converted or considered part of a character class such as letter or whitespace.
ru: Невозможно выполнить преобразование регистра и классификацию символов в соответствии с языковым стандартом. Для текстовых строк (Unicode) это выполняется только в соответствии со значением символа, тогда как для байтовых строк преобразования и классификации выполняются в соответствии со значением ASCII байта и байтами, у которых установлен старший бит (т. е. байты, отличные от ASCII). ) никогда не преобразуются и не считаются частью класса символов, такого как буквы или пробелы.

source: For extension writers and programs that embed Python
ru: Для разработчиков расширений и программ, встраивающих Python

source: Extension modules should never call :func:`setlocale`, except to find out what the current locale is. But since the return value can only be used portably to restore it, that is not very useful (except perhaps to find out whether or not the locale is ``C``).
ru: Модули расширения никогда не должны вызывать :func:`setlocale`, кроме как для того, чтобы узнать текущую локаль. Но поскольку возвращаемое значение можно использовать только для его переноса, это не очень полезно (за исключением, возможно, выяснения того, является ли локаль ``C``).

source: When Python code uses the :mod:`locale` module to change the locale, this also affects the embedding application. If the embedding application doesn't want this to happen, it should remove the :mod:`!_locale` extension module (which does all the work) from the table of built-in modules in the :file:`config.c` file, and make sure that the :mod:`!_locale` module is not accessible as a shared library.
ru: Когда код Python использует модуль :mod:`locale` для изменения языкового стандарта, это также влияет на приложение для внедрения. Если приложение для внедрения не хочет, чтобы это произошло, оно должно удалить модуль расширения :mod:`!_locale` (который выполняет всю работу) из таблицы встроенных модулей в :file:`config.c` файл и убедитесь, что модуль :mod:`!_locale` недоступен как общая библиотека.

source: Access to message catalogs
ru: Доступ к каталогам сообщений

source: The locale module exposes the C library's gettext interface on systems that provide this interface. It consists of the functions :func:`gettext`, :func:`dgettext`, :func:`dcgettext`, :func:`textdomain`, :func:`bindtextdomain`, and :func:`bind_textdomain_codeset`. These are similar to the same functions in the :mod:`gettext` module, but use the C library's binary format for message catalogs, and the C library's search algorithms for locating message catalogs.
ru: Модуль локали предоставляет интерфейс gettext библиотеки C в системах, которые предоставляют этот интерфейс. Он состоит из функций :func:`gettext`, :func:`dgettext`, :func:`dcgettext`, :func:`textdomain`, :func:`bindtextdomain` и :func:`bind_textdomain_codeset`. Они аналогичны тем же функциям в модуле :mod:`gettext`, но используют двоичный формат библиотеки C для каталогов сообщений и алгоритмы поиска библиотеки C для поиска каталогов сообщений.

source: Python applications should normally find no need to invoke these functions, and should use :mod:`gettext` instead. A known exception to this rule are applications that link with additional C libraries which internally invoke C functions ``gettext`` or ``dcgettext``. For these applications, it may be necessary to bind the text domain, so that the libraries can properly locate their message catalogs.
ru: Приложения Python обычно не должны испытывать необходимости вызывать эти функции и вместо этого должны использовать :mod:`gettext`. Известным исключением из этого правила являются приложения, которые компонуются с дополнительными библиотеками C, которые внутренне вызывают функции C ``gettext`` или ``dcgettext``. Для этих приложений может потребоваться привязка текстового домена, чтобы библиотеки могли правильно найти свои каталоги сообщений.

source: module
ru: модуль
