Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/lzma.po
Languages: pt_pt, sv

source: :mod:`!lzma` --- Compression using the LZMA algorithm
pt_pt: :mod:`!lzma` --- Compressão usando o algoritmo LZMA
sv: :mod:`!lzma` --- Komprimering med hjälp av LZMA-algoritmen

source: **Source code:** :source:`Lib/lzma.py`
pt_pt: **Código-fonte:** :source:`Lib/lzma.py`
sv: **Källkod:** :source:`Lib/lzma.py`

source: This module provides classes and convenience functions for compressing and decompressing data using the LZMA compression algorithm. Also included is a file interface supporting the ``.xz`` and legacy ``.lzma`` file formats used by the :program:`xz` utility, as well as raw compressed streams.
pt_pt: Este módulo fornece classes e funções de conveniência para comprimir e descomprimir dados usando o algoritmo de compressão LZMA. Também está incluída uma interface de ficheiro que suporta os formatos de ficheiro ``.xz`` e o legado ``.lzma`` usados pela utilidade :program:`xz`, bem como fluxos comprimidos em bruto.
sv: Denna modul innehåller klasser och bekvämlighetsfunktioner för komprimering och dekomprimering av data med hjälp av LZMA-komprimeringsalgoritmen. Dessutom ingår ett filgränssnitt som stöder filformaten ``.xz`` och ``.lzma`` som används av verktyget :program:`xz`, samt råkomprimerade strömmar.

source: The interface provided by this module is very similar to that of the :mod:`bz2` module. Note that :class:`LZMAFile` and :class:`bz2.BZ2File` are *not* thread-safe, so if you need to use a single :class:`LZMAFile` instance from multiple threads, it is necessary to protect it with a lock.
pt_pt: A interface fornecida por este módulo é muito semelhante à do módulo :mod:`bz2`. Note que :class:`LZMAFile` e :class:`bz2.BZ2File` *não* são seguros para *threads*, pelo que, se precisar de usar uma única instância de :class:`LZMAFile` a partir de múltiplas *threads*, é necessário protegê-la com um bloqueio.
sv: Gränssnittet som tillhandahålls av denna modul är mycket likt det i modulen :mod:`bz2`. Observera att :class:`LZMAFile` och :class:`bz2.BZ2File` är *inte* trådsäkra, så om du behöver använda en enda :class:`LZMAFile`\-instans från flera trådar, är det nödvändigt att skydda den med ett lås.

source: This is an :term:`optional module`. If it is missing from your copy of CPython, look for documentation from your distributor (that is, whoever provided Python to you). If you are the distributor, see :ref:`optional-module-requirements`.
pt_pt: Este é um :term:`módulo opcional`. Se estiver em falta na sua cópia do CPython, procure documentação junto do seu distribuidor (ou seja, quem lhe forneceu o Python). Se for o distribuidor, veja :ref:`optional-module-requirements`.

source: This exception is raised when an error occurs during compression or decompression, or while initializing the compressor/decompressor state.
pt_pt: Esta exceção é lançada quando ocorre um erro durante a compressão ou descompressão, ou durante a inicialização do estado do compressor/descompressor.
sv: Detta undantag uppstår när ett fel inträffar under komprimering eller dekomprimering, eller under initiering av kompressor/dekompressortillståndet.

source: Reading and writing compressed files
pt_pt: Leitura e escrita de ficheiros comprimidos
sv: Läsa och skriva komprimerade filer

source: Open an LZMA-compressed file in binary or text mode, returning a :term:`file object`.
pt_pt: Abre um ficheiro comprimido com LZMA em modo binário ou de texto, devolvendo um objeto :term:`ficheiro`.
sv: Öppna en LZMA-komprimerad fil i binär- eller textläge och returnera ett :term:`file object`.

source: The *filename* argument can be either an actual file name (given as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object), in which case the named file is opened, or it can be an existing file object to read from or write to.
pt_pt: O argumento *filename* pode ser um nome de ficheiro real (dado como um :class:`str`, :class:`bytes` ou um objeto :term:`semelhante a um caminho` (path-like)), caso em que o ficheiro nomeado é aberto, ou pode ser um objeto de ficheiro existente para ler ou escrever.
sv: Argumentet *filnamn* kan antingen vara ett faktiskt filnamn (givet som ett :class:`str`, :class:`bytes` eller :term:`path-like <path-like object>`\-objekt), i vilket fall den namngivna filen öppnas, eller ett befintligt filobjekt att läsa från eller skriva till.

source: The *mode* argument can be any of ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` or ``"ab"`` for binary mode, or ``"rt"``, ``"wt"``, ``"xt"``, or ``"at"`` for text mode. The default is ``"rb"``.
pt_pt: O argumento *mode* pode ser qualquer um dos seguintes: ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` ou ``"ab"`` para modo binário, ou ``"rt"``, ``"wt"``, ``"xt"`` ou ``"at"`` para modo de texto. O predefinido é ``"rb"``.
sv: Argumentet *mode* kan vara något av ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` eller ``"ab"`` för binärt läge, eller ``"rt"``, ``"wt"``, ``"xt"`` eller ``"at"`` för textläge. Standardvärdet är ``"rb"``.

source: When opening a file for reading, the *format* and *filters* arguments have the same meanings as for :class:`LZMADecompressor`. In this case, the *check* and *preset* arguments should not be used.
pt_pt: Ao abrir um ficheiro para leitura, os argumentos *format* e *filters* têm os mesmos significados que para :class:`LZMADecompressor`. Neste caso, os argumentos *check* e *preset* não devem ser usados.
sv: När en fil öppnas för läsning har argumenten *format* och *filters* samma innebörd som för :class:`LZMADecompressor`. I det här fallet ska argumenten *check* och *preset* inte användas.

source: When opening a file for writing, the *format*, *check*, *preset* and *filters* arguments have the same meanings as for :class:`LZMACompressor`.
pt_pt: Ao abrir um ficheiro para escrita, os argumentos *format*, *check*, *preset* e *filters* têm os mesmos significados que para :class:`LZMACompressor`.
sv: När en fil öppnas för skrivning har argumenten *format*, *check*, *preset* och *filters* samma innebörd som för :class:`LZMACompressor`.

source: For binary mode, this function is equivalent to the :class:`LZMAFile` constructor: ``LZMAFile(filename, mode, ...)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
pt_pt: Para o modo binário, esta função é equivalente ao construtor :class:`LZMAFile`: ``LZMAFile(filename, mode, ...)``. Neste caso, os argumentos *encoding*, *errors* e *newline* não devem ser fornecidos.
sv: För binärt läge är denna funktion likvärdig med :class:`LZMAFile`\-konstruktören: ``LZMAFile(filnamn, läge, ...)``. I detta fall får argumenten *encoding*, *errors* och *newline* inte anges.

source: For text mode, a :class:`LZMAFile` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
pt_pt: Para o modo de texto, é criado um objeto :class:`LZMAFile` e envolvido numa instância :class:`io.TextIOWrapper` com a codificação, comportamento de tratamento de erros e terminação de linha(s) especificados.
sv: För textläge skapas ett :class:`LZMAFile`\-objekt och omsluts av en :class:`io.TextIOWrapper`\-instans med angiven kodning, felhanteringsbeteende och radavslutning(ar).

source: Added support for the ``"x"``, ``"xb"`` and ``"xt"`` modes.
pt_pt: Adicionado suporte para os modos ``"x"``, ``"xb"`` e ``"xt"``.
sv: Lagt till stöd för lägena ``"x"``, ``"xb"`` och ``"xt"``.

source: Accepts a :term:`path-like object`.
pt_pt: Aceita um objeto :term:`semelhante a um caminho`.
sv: Accepterar en :term:`path-like object`.

source: Open an LZMA-compressed file in binary mode.
pt_pt: Abre um ficheiro comprimido com LZMA em modo binário.
sv: Öppna en LZMA-komprimerad fil i binärt läge.

source: An :class:`LZMAFile` can wrap an already-open :term:`file object`, or operate directly on a named file. The *filename* argument specifies either the file object to wrap, or the name of the file to open (as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object). When wrapping an existing file object, the wrapped file will not be closed when the :class:`LZMAFile` is closed.
pt_pt: Um :class:`LZMAFile` pode envolver um objeto de ficheiro já aberto ou operar diretamente num ficheiro nomeado. O argumento *filename* especifica o objeto de ficheiro a envolver ou o nome do ficheiro a abrir (como um :class:`str`, :class:`bytes` ou objeto :term:`semelhante a um caminho`). Ao envolver um objeto de ficheiro existente, o ficheiro envolvido não será fechado quando o :class:`LZMAFile` for fechado.
sv: En :class:`LZMAFile` kan omsluta ett redan öppet :term:`file object`, eller arbeta direkt på en namngiven fil. Argumentet *filnamn* anger antingen filobjektet som ska omslutas eller namnet på filen som ska öppnas (som ett :class:`str`, :class:`bytes` eller :term:`path-like <path-like object>`\ -objekt). När ett befintligt filobjekt paketeras kommer den paketerade filen inte att stängas när :class:`LZMAFile` stängs.

source: The *mode* argument can be either ``"r"`` for reading (default), ``"w"`` for overwriting, ``"x"`` for exclusive creation, or ``"a"`` for appending. These can equivalently be given as ``"rb"``, ``"wb"``, ``"xb"`` and ``"ab"`` respectively.
pt_pt: O argumento *mode* pode ser ``"r"`` para leitura (predefinido), ``"w"`` para sobrescrita, ``"x"`` para criação exclusiva ou ``"a"`` para anexar. Estes podem ser equivalentes a ``"rb"``, ``"wb"``, ``"xb"`` e ``"ab"``, respetivamente.
sv: Argumentet *mode* kan vara antingen ``"r"`` för läsning (standard), ``"w"`` för överskrivning, ``"x"`` för exklusivt skapande eller ``"a"`` för tillägg. Dessa kan på motsvarande sätt anges som ``"rb"``, ``"wb"``, ``"xb"`` respektive ``"ab"``.

source: If *filename* is a file object (rather than an actual file name), a mode of ``"w"`` does not truncate the file, and is instead equivalent to ``"a"``.
pt_pt: Se *filename* for um objeto de ficheiro (em vez de um nome de ficheiro real), um modo de ``"w"`` não trunca o ficheiro e é, em vez disso, equivalente a ``"a"``.
sv: Om *filnamn* är ett filobjekt (snarare än ett faktiskt filnamn), trunkeras inte filen i läget ``"w"``, utan motsvarar i stället ``"a"``.

source: When opening a file for reading, the input file may be the concatenation of multiple separate compressed streams. These are transparently decoded as a single logical stream.
pt_pt: Ao abrir um ficheiro para leitura, o ficheiro de entrada pode ser a concatenação de vários fluxos comprimidos separados. Estes são descodificados transparentes como um único fluxo lógico.
sv: När du öppnar en fil för läsning kan inmatningsfilen vara en sammankoppling av flera separata komprimerade strömmar. Dessa avkodas på ett transparent sätt som en enda logisk ström.

source: :class:`LZMAFile` supports all the members specified by :class:`io.BufferedIOBase`, except for :meth:`~io.BufferedIOBase.detach` and :meth:`~io.IOBase.truncate`. Iteration and the :keyword:`with` statement are supported.
pt_pt: :class:`LZMAFile` suporta todos os membros especificados por :class:`io.BufferedIOBase`, exceto :meth:`~io.BufferedIOBase.detach` e :meth:`~io.IOBase.truncate`. A iteração e a instrução :keyword:`with` são suportadas.
sv: :class:`LZMAFile` stöder alla medlemmar som specificeras av :class:`io.BufferedIOBase`, förutom :meth:`~io.BufferedIOBase.detach` och :meth:`~io.IOBase.truncate`. Iteration och :keyword:`with`\-satsen stöds.

source: The following method and attributes are also provided:
pt_pt: Os seguintes métodos e atributos também são fornecidos:
sv: Följande metod och attribut tillhandahålls också:

source: Return buffered data without advancing the file position. At least one byte of data will be returned, unless EOF has been reached. The exact number of bytes returned is unspecified (the *size* argument is ignored).
pt_pt: Devolve dados em buffer sem avançar a posição do ficheiro. Pelo menos um byte de dados será devolvido, a menos que o EOF tenha sido atingido. O número exato de bytes devolvidos não está especificado (o argumento *size* é ignorado).
sv: Returnerar buffrade data utan att flytta fram filpositionen. Minst en byte data kommer att returneras, såvida inte EOF har uppnåtts. Det exakta antalet bytes som returneras är ospecificerat (argumentet *size* ignoreras).

source: While calling :meth:`peek` does not change the file position of the :class:`LZMAFile`, it may change the position of the underlying file object (e.g. if the :class:`LZMAFile` was constructed by passing a file object for *filename*).
pt_pt: Embora chamar :meth:`peek` não altere a posição do ficheiro do :class:`LZMAFile`, pode alterar a posição do objeto de ficheiro subjacente (por exemplo, se o :class:`LZMAFile` foi construído passando um objeto de ficheiro para *filename*).
sv: Även om anrop av :meth:`peek` inte ändrar filpositionen för :class:`LZMAFile`, kan det ändra positionen för det underliggande filobjektet (t.ex. om :class:`LZMAFile` konstruerades genom att skicka ett filobjekt för *filnamn*).

source: ``'rb'`` for reading and ``'wb'`` for writing.
pt_pt: ``'rb'`` para leitura e ``'wb'`` para escrita.
sv: ``'rb'`` för läsning och ``'wb'`` för skrivning.

source: The lzma file name. Equivalent to the :attr:`~io.FileIO.name` attribute of the underlying :term:`file object`.
pt_pt: O nome do ficheiro lzma. Equivalente ao atributo :attr:`~io.FileIO.name` do objeto :term:`ficheiro` subjacente.
sv: Namnet på lzma-filen. Motsvarar attributet :attr:`~io.FileIO.name` för det underliggande :term:`file object`.

source: Added support for the ``"x"`` and ``"xb"`` modes.
pt_pt: Adicionado suporte para os modos ``"x"`` e ``"xb"``.
sv: Lagt till stöd för lägena ``"x"`` och ``"xb"``.

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
pt_pt: O método :meth:`~io.BufferedIOBase.read` agora aceita um argumento de ``None``.
sv: Metoden :meth:`~io.BufferedIOBase.read` accepterar nu ett argument på ``None``.

source: Compressing and decompressing data in memory
pt_pt: Compressão e descompressão de dados em memória
sv: Komprimering och dekomprimering av data i minnet

source: Create a compressor object, which can be used to compress data incrementally.
pt_pt: Cria um objeto compressor, que pode ser usado para comprimir dados de forma incremental.
sv: Skapa ett kompressorobjekt som kan användas för att komprimera data stegvis.

source: For a more convenient way of compressing a single chunk of data, see :func:`compress`.
pt_pt: Para uma forma mais conveniente de comprimir um único bloco de dados, veja :func:`compress`.
sv: För ett bekvämare sätt att komprimera en enda bit data, se :func:`compress`.

source: The *format* argument specifies what container format should be used. Possible values are:
pt_pt: O argumento *format* especifica qual o formato de contentor a ser usado. Os valores possíveis são:
sv: Argumentet *format* anger vilket containerformat som ska användas. Möjliga värden är:

source: :const:`FORMAT_XZ`: The ``.xz`` container format.
pt_pt: :const:`FORMAT_XZ`: O formato de contentor ``.xz``.
sv: :const:`FORMAT_XZ`: Containerformatet ``.xz``.

source: This is the default format.
pt_pt: Este é o formato predefinido.
sv: Detta är standardformatet.

source: :const:`FORMAT_ALONE`: The legacy ``.lzma`` container format.
pt_pt: :const:`FORMAT_ALONE`: O formato de contentor legado ``.lzma``.
sv: :const:`FORMAT_ALONE`: Det äldre containerformatet ``.lzma``.

source: This format is more limited than ``.xz`` -- it does not support integrity checks or multiple filters.
pt_pt: Este formato é mais limitado do que ``.xz`` — não suporta verificações de integridade nem múltiplos filtros.
sv: Detta format är mer begränsat än ``.xz`` - det stöder inte integritetskontroller eller flera filter.

source: :const:`FORMAT_RAW`: A raw data stream, not using any container format.
pt_pt: :const:`FORMAT_RAW`: Um fluxo de dados bruto, não usando qualquer formato de contentor.
sv: :const:`FORMAT_RAW`: En rå dataström som inte använder något containerformat.

source: This format specifier does not support integrity checks, and requires that you always specify a custom filter chain (for both compression and decompression). Additionally, data compressed in this manner cannot be decompressed using :const:`FORMAT_AUTO` (see :class:`LZMADecompressor`).
pt_pt: Este especificador de formato não suporta verificações de integridade e requer que especifique sempre uma cadeia de filtros personalizada (para compressão e descompressão). Além disso, os dados comprimidos desta forma não podem ser descomprimidos usando :const:`FORMAT_AUTO` (veja :class:`LZMADecompressor`).
sv: Den här formatspecificeraren stöder inte integritetskontroller och kräver att du alltid anger en anpassad filterkedja (för både komprimering och dekomprimering). Dessutom kan data som komprimerats på detta sätt inte dekomprimeras med :const:`FORMAT_AUTO` (se :class:`LZMADecompressor`).

source: The *check* argument specifies the type of integrity check to include in the compressed data. This check is used when decompressing, to ensure that the data has not been corrupted. Possible values are:
pt_pt: O argumento *check* especifica o tipo de verificação de integridade a incluir nos dados comprimidos. Esta verificação é usada durante a descompressão para garantir que os dados não foram corrompidos. Os valores possíveis são:
sv: Argumentet *check* anger vilken typ av integritetskontroll som ska inkluderas i de komprimerade data. Denna kontroll används vid dekomprimering för att säkerställa att data inte har korrumperats. Möjliga värden är:

source: :const:`CHECK_NONE`: No integrity check. This is the default (and the only acceptable value) for :const:`FORMAT_ALONE` and :const:`FORMAT_RAW`.
pt_pt: :const:`CHECK_NONE`: Sem verificação de integridade. Este é o predefinido (e o único valor aceitável) para :const:`FORMAT_ALONE` e :const:`FORMAT_RAW`.
sv: :const:`CHECK_NONE`: Ingen integritetskontroll. Detta är standardvärdet (och det enda godtagbara värdet) för :const:`FORMAT_ALONE` och :const:`FORMAT_RAW`.

source: :const:`CHECK_CRC32`: 32-bit Cyclic Redundancy Check.
pt_pt: :const:`CHECK_CRC32`: Verificação de Redundância Cíclica de 32 bits.
sv: :const:`CHECK_CRC32`: 32-bitars kontroll av cyklisk redundans.

source: :const:`CHECK_CRC64`: 64-bit Cyclic Redundancy Check. This is the default for :const:`FORMAT_XZ`.
pt_pt: :const:`CHECK_CRC64`: Verificação de Redundância Cíclica de 64 bits. Este é o predefinido para :const:`FORMAT_XZ`.
sv: :const:`CHECK_CRC64`: 64-bitars kontroll av cyklisk redundans. Detta är standardinställningen för :const:`FORMAT_XZ`.

source: :const:`CHECK_SHA256`: 256-bit Secure Hash Algorithm.
pt_pt: :const:`CHECK_SHA256`: Algoritmo de Hash Seguro de 256 bits.
sv: :const:`CHECK_SHA256`: 256-bitars säker hashalgoritm.

source: If the specified check is not supported, an :class:`LZMAError` is raised.
pt_pt: Se a verificação especificada não for suportada, é lançada uma :class:`LZMAError`.
sv: Om den angivna kontrollen inte stöds, genereras ett :class:`LZMAError`.

source: The compression settings can be specified either as a preset compression level (with the *preset* argument), or in detail as a custom filter chain (with the *filters* argument).
pt_pt: As definições de compressão podem ser especificadas como um nível de compressão predefinido (com o argumento *preset*) ou em detalhe como uma cadeia de filtros personalizada (com o argumento *filters*).
sv: Komprimeringsinställningarna kan anges antingen som en förinställd komprimeringsnivå (med argumentet *preset*) eller i detalj som en anpassad filterkedja (med argumentet *filters*).

source: The *preset* argument (if provided) should be an integer between ``0`` and ``9`` (inclusive), optionally OR-ed with the constant :const:`PRESET_EXTREME`. If neither *preset* nor *filters* are given, the default behavior is to use :const:`PRESET_DEFAULT` (preset level ``6``). Higher presets produce smaller output, but make the compression process slower.
pt_pt: O argumento *preset* (se fornecido) deve ser um inteiro entre ``0`` e ``9`` (inclusive), opcionalmente OR-ed com a constante :const:`PRESET_EXTREME`. Se nem *preset* nem *filters* forem fornecidos, o comportamento predefinido é usar :const:`PRESET_DEFAULT` (nível de pré-definição ``6``). Pré-definições mais elevadas produzem saída menor, mas tornam o processo de compressão mais lento.
sv: Argumentet *preset* (om det anges) bör vara ett heltal mellan ``0`` och ``9`` (inklusive), eventuellt OR-at med konstanten :const:`PRESET_EXTREME`. Om varken *preset* eller *filters* anges är standardbeteendet att använda :const:`PRESET_DEFAULT` (förinställningsnivå ``6``). Högre förinställningar ger mindre utdata, men gör komprimeringsprocessen långsammare.

source: In addition to being more CPU-intensive, compression with higher presets also requires much more memory (and produces output that needs more memory to decompress). With preset ``9`` for example, the overhead for an :class:`LZMACompressor` object can be as high as 800 MiB. For this reason, it is generally best to stick with the default preset.
pt_pt: Além de ser mais intensivo em CPU, a compressão com pré-definições mais altas também requer muito mais memória (e produz saída que necessita de mais memória para descomprimir). Com a pré-definição ``9``, por exemplo, a sobrecarga para um objeto :class:`LZMACompressor` pode ser tão alta como 800 MiB. Por esta razão, é geralmente melhor manter a pré-definição predefinida.
sv: Förutom att vara mer CPU-intensiv kräver komprimering med högre förinställningar också mycket mer minne (och producerar utdata som behöver mer minne för att dekomprimeras). Med förinställningen ``9`` till exempel, kan overhead för ett :class:`LZMACompressor`\-objekt vara så högt som 800 MiB. Av denna anledning är det i allmänhet bäst att hålla sig till standardinställningen.

source: The *filters* argument (if provided) should be a filter chain specifier. See :ref:`filter-chain-specs` for details.
pt_pt: O argumento *filters* (se fornecido) deve ser um especificador de cadeia de filtros. Veja :ref:`filter-chain-specs` para mais detalhes.
sv: Argumentet *filters* (om det anges) bör vara en specifikation av en filterkedja. Se :ref:`filter-chain-specs` för detaljer.

source: Compress *data* (a :class:`bytes` object), returning a :class:`bytes` object containing compressed data for at least part of the input. Some of *data* may be buffered internally, for use in later calls to :meth:`compress` and :meth:`flush`. The returned data should be concatenated with the output of any previous calls to :meth:`compress`.
pt_pt: Comprime *data* (um objeto :class:`bytes`), devolvendo um objeto :class:`bytes` contendo dados comprimidos para pelo menos parte da entrada. Alguns dos *data* podem ser armazenados em buffer internamente, para uso em chamadas posteriores a :meth:`compress` e :meth:`flush`. Os dados devolvidos devem ser concatenados com a saída de quaisquer chamadas anteriores a :meth:`compress`.
sv: Komprimerar *data* (ett :class:`bytes`\-objekt) och returnerar ett :class:`bytes`\-objekt som innehåller komprimerade data för åtminstone en del av indata. En del av *data* kan buffras internt, för användning i senare anrop till :meth:`compress` och :meth:`flush`. De returnerade data bör sammankopplas med utdata från eventuella tidigare anrop till :meth:`compress`.

source: Finish the compression process, returning a :class:`bytes` object containing any data stored in the compressor's internal buffers.
pt_pt: Termina o processo de compressão, devolvendo um objeto :class:`bytes` que contém quaisquer dados armazenados nos buffers internos do compressor.
sv: Avslutar komprimeringsprocessen och returnerar ett :class:`bytes`\-objekt som innehåller all data som lagrats i kompressorns interna buffertar.
