Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/lzma.po
Languages: pt_pt, sv

source: The compressor cannot be used after this method has been called.
pt_pt: O compressor não pode ser usado após este método ter sido chamado.
sv: Kompressorn kan inte användas efter att denna metod har anropats.

source: Create a decompressor object, which can be used to decompress data incrementally.
pt_pt: Cria um objeto descompressor, que pode ser usado para descomprimir dados de forma incremental.
sv: Skapa ett dekompressorobjekt som kan användas för att dekomprimera data stegvis.

source: For a more convenient way of decompressing an entire compressed stream at once, see :func:`decompress`.
pt_pt: Para uma forma mais conveniente de descomprimir um fluxo comprimido inteiro de uma só vez, veja :func:`decompress`.
sv: För ett mer bekvämt sätt att dekomprimera en hel komprimerad ström på en gång, se :func:`decompress`.

source: The *format* argument specifies the container format that should be used. The default is :const:`FORMAT_AUTO`, which can decompress both ``.xz`` and ``.lzma`` files. Other possible values are :const:`FORMAT_XZ`, :const:`FORMAT_ALONE`, and :const:`FORMAT_RAW`.
pt_pt: O argumento *format* especifica o formato de contentor a ser usado. O predefinido é :const:`FORMAT_AUTO`, que pode descomprimir ficheiros ``.xz`` e ``.lzma``. Outros valores possíveis são :const:`FORMAT_XZ`, :const:`FORMAT_ALONE` e :const:`FORMAT_RAW`.
sv: Argumentet *format* anger vilket containerformat som ska användas. Standardvärdet är :const:`FORMAT_AUTO`, som kan dekomprimera både ``.xz`` och ``.lzma``\-filer. Andra möjliga värden är :const:`FORMAT_XZ`, :const:`FORMAT_ALONE` och :const:`FORMAT_RAW`.

source: The *memlimit* argument specifies a limit (in bytes) on the amount of memory that the decompressor can use. When this argument is used, decompression will fail with an :class:`LZMAError` if it is not possible to decompress the input within the given memory limit.
pt_pt: O argumento *memlimit* especifica um limite (em bytes) na quantidade de memória que o descompressor pode usar. Quando este argumento é usado, a descompressão falhará com uma :class:`LZMAError` se não for possível descomprimir a entrada dentro do limite de memória dado.
sv: Argumentet *memlimit* anger en gräns (i byte) för hur mycket minne som dekomprimeraren kan använda. När detta argument används kommer dekomprimeringen att misslyckas med ett :class:`LZMAError` om det inte är möjligt att dekomprimera indata inom den angivna minnesgränsen.

source: The *filters* argument specifies the filter chain that was used to create the stream being decompressed. This argument is required if *format* is :const:`FORMAT_RAW`, but should not be used for other formats. See :ref:`filter-chain-specs` for more information about filter chains.
pt_pt: O argumento *filters* especifica a cadeia de filtros que foi usada para criar o fluxo a ser descomprimido. Este argumento é necessário se *format* for :const:`FORMAT_RAW`, mas não deve ser usado para outros formatos. Veja :ref:`filter-chain-specs` para mais informações sobre cadeias de filtros.
sv: Argumentet *filters* anger den filterkedja som användes för att skapa den ström som dekomprimeras. Detta argument krävs om *format* är :const:`FORMAT_RAW`, men ska inte användas för andra format. Se :ref:`filter-chain-specs` för mer information om filterkedjor.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`LZMAFile`. To decompress a multi-stream input with :class:`LZMADecompressor`, you must create a new decompressor for each stream.
pt_pt: Esta classe não trata transparentes entradas contendo múltiplos fluxos comprimidos, ao contrário de :func:`decompress` e :class:`LZMAFile`. Para descomprimir uma entrada multi-fluxo com :class:`LZMADecompressor`, deve criar um novo descompressor para cada fluxo.
sv: Den här klassen hanterar inte på ett transparent sätt indata som innehåller flera komprimerade strömmar, till skillnad från :func:`decompress` och :class:`LZMAFile`. För att dekomprimera en inmatning med flera strömmar med :class:`LZMADecompressor` måste du skapa en ny dekompressor för varje ström.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
pt_pt: Descomprime *data* (um objeto :term:`semelhante a bytes`), devolvendo dados descomprimidos como bytes. Alguns dos *data* podem ser armazenados em buffer internamente, para uso em chamadas posteriores a :meth:`decompress`. Os dados devolvidos devem ser concatenados com a saída de quaisquer chamadas anteriores a :meth:`decompress`.
sv: Dekomprimerar *data* (ett :term:`bytesliknande objekt`) och returnerar okomprimerad data som bytes. En del av *data* kan buffras internt, för användning i senare anrop till :meth:`decompress`. Den returnerade datan bör sammanfogas med resultatet från eventuella tidigare anrop till :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
pt_pt: Se *max_length* for não negativo, devolve no máximo *max_length* bytes de dados descomprimidos. Se este limite for atingido e mais saída puder ser produzida, o atributo :attr:`~.needs_input` será definido como ``False``. Neste caso, a próxima chamada a :meth:`~.decompress` pode fornecer *data* como ``b''`` para obter mais saída.
sv: Om *max_length* är icke-negativ, returneras högst *max_length* byte av dekomprimerade data. Om denna gräns nås och ytterligare utdata kan produceras, kommer attributet :attr:`~.needs_input` att sättas till ``False``. I detta fall kan nästa anrop till :meth:`~.decompress` ge *data* som ``b''`` för att få mer av utdata.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
pt_pt: Se todos os dados de entrada tiverem sido descomprimidos e devolvidos (seja porque eram menos do que *max_length* bytes, ou porque *max_length* era negativo), o atributo :attr:`~.needs_input` será definido como ``True``.
sv: Om alla indata dekomprimerades och returnerades (antingen för att de var mindre än *max_length* bytes eller för att *max_length* var negativ), kommer attributet :attr:`~.needs_input` att sättas till ``True``.

source: Attempting to decompress data after the end of stream is reached raises an :exc:`EOFError`. Any data found after the end of the stream is ignored and saved in the :attr:`~.unused_data` attribute.
pt_pt: Tentar descomprimir dados após o final do fluxo ser atingido lança uma :exc:`EOFError`. Quaisquer dados encontrados após o final do fluxo são ignorados e guardados no atributo :attr:`~.unused_data`.
sv: Försök att dekomprimera data efter att slutet på strömmen har nåtts ger upphov till ett :exc:`EOFError`. Alla data som hittas efter slutet av strömmen ignoreras och sparas i attributet :attr:`~.unused_data`.

source: Added the *max_length* parameter.
pt_pt: Adicionado o parâmetro *max_length*.
sv: Parametern *max_length* har lagts till.

source: The ID of the integrity check used by the input stream. This may be :const:`CHECK_UNKNOWN` until enough of the input has been decoded to determine what integrity check it uses.
pt_pt: O ID da verificação de integridade usada pelo fluxo de entrada. Isto pode ser :const:`CHECK_UNKNOWN` até que uma parte suficiente da entrada tenha sido descodificada para determinar que verificação de integridade usa.
sv: ID för den integritetskontroll som används av indataströmmen. Detta kan vara :const:`CHECK_UNKNOWN` tills tillräckligt mycket av inmatningen har avkodats för att avgöra vilken integritetskontroll som används.

source: ``True`` if the end-of-stream marker has been reached.
pt_pt: ``True`` se o marcador de fim de fluxo tiver sido atingido.
sv: ``True`` om markören för slutet av flödet har nåtts.

source: Data found after the end of the compressed stream.
pt_pt: Dados encontrados após o final do fluxo comprimido.
sv: Data som hittas efter slutet av den komprimerade strömmen.

source: Before the end of the stream is reached, this will be ``b""``.
pt_pt: Antes do final do fluxo ser atingido, isto será ``b""``.
sv: Innan slutet av strömmen nås kommer detta att vara ``b""``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
pt_pt: ``False`` se o método :meth:`.decompress` puder fornecer mais dados descomprimidos antes de necessitar de nova entrada não comprimida.
sv: ``False`` om metoden :meth:`.decompress`` kan tillhandahålla mer dekomprimerad data innan den kräver ny okomprimerad inmatning.

source: Compress *data* (a :class:`bytes` object), returning the compressed data as a :class:`bytes` object.
pt_pt: Comprime *data* (um objeto :class:`bytes`), devolvendo os dados comprimidos como um objeto :class:`bytes`.
sv: Komprimera *data* (ett :class:`bytes`\-objekt) och returnera den komprimerade datan som ett :class:`bytes`\-objekt.

source: See :class:`LZMACompressor` above for a description of the *format*, *check*, *preset* and *filters* arguments.
pt_pt: Veja :class:`LZMACompressor` acima para uma descrição dos argumentos *format*, *check*, *preset* e *filters*.
sv: Se :class:`LZMACompressor` ovan för en beskrivning av argumenten *format*, *check*, *preset* och *filters*.

source: Decompress *data* (a :class:`bytes` object), returning the uncompressed data as a :class:`bytes` object.
pt_pt: Descomprime *data* (um objeto :class:`bytes`), devolvendo os dados descomprimidos como um objeto :class:`bytes`.
sv: Dekomprimera *data* (ett :class:`bytes`\-objekt) och returnera okomprimerad data som ett :class:`bytes`\-objekt.

source: If *data* is the concatenation of multiple distinct compressed streams, decompress all of these streams, and return the concatenation of the results.
pt_pt: Se *data* for a concatenação de múltiplos fluxos comprimidos distintos, descomprime todos estes fluxos e devolve a concatenação dos resultados.
sv: Om *data* är en sammankoppling av flera olika komprimerade flöden, dekomprimera alla dessa flöden och returnera sammankopplingen av resultaten.

source: See :class:`LZMADecompressor` above for a description of the *format*, *memlimit* and *filters* arguments.
pt_pt: Veja :class:`LZMADecompressor` acima para uma descrição dos argumentos *format*, *memlimit* e *filters*.
sv: Se :class:`LZMADecompressor` ovan för en beskrivning av argumenten *format*, *memlimit* och *filters*.

source: Miscellaneous
pt_pt: Diversos
sv: Diverse

source: Return ``True`` if the given integrity check is supported on this system.
pt_pt: Devolve ``True`` se a verificação de integridade dada for suportada neste sistema.
sv: Returnerar ``True`` om den angivna integritetskontrollen stöds på detta system.

source: :const:`CHECK_NONE` and :const:`CHECK_CRC32` are always supported. :const:`CHECK_CRC64` and :const:`CHECK_SHA256` may be unavailable if you are using a version of :program:`liblzma` that was compiled with a limited feature set.
pt_pt: :const:`CHECK_NONE` e :const:`CHECK_CRC32` são sempre suportados. :const:`CHECK_CRC64` e :const:`CHECK_SHA256` podem não estar disponíveis se estiver a usar uma versão de :program:`liblzma` que foi compilada com um conjunto de funcionalidades limitado.
sv: :const:`CHECK_NONE` och :const:`CHECK_CRC32` stöds alltid. :const:`CHECK_CRC64` och :const:`CHECK_SHA256` kanske inte är tillgängliga om du använder en version av :program:`liblzma` som kompilerades med en begränsad funktionsuppsättning.

source: Specifying custom filter chains
pt_pt: Especificação de cadeias de filtros personalizadas
sv: Ange anpassade filterkedjor

source: A filter chain specifier is a sequence of dictionaries, where each dictionary contains the ID and options for a single filter. Each dictionary must contain the key ``"id"``, and may contain additional keys to specify filter-dependent options. Valid filter IDs are as follows:
pt_pt: Um especificador de cadeia de filtros é uma sequência de dicionários, onde cada dicionário contém o ID e as opções para um único filtro. Cada dicionário deve conter a chave ``"id"`` e pode conter chaves adicionais para especificar opções dependentes do filtro. Os IDs de filtro válidos são os seguintes:
sv: En filterkedjespecifikation är en sekvens av ordböcker, där varje ordbok innehåller ID och alternativ för ett enda filter. Varje ordbok måste innehålla nyckeln ``"id"`` och kan innehålla ytterligare nycklar för att ange filterberoende alternativ. Giltiga filter-ID är följande:

source: Compression filters:
pt_pt: Filtros de compressão:
sv: Kompressionsfilter:

source: :const:`FILTER_LZMA1` (for use with :const:`FORMAT_ALONE`)
pt_pt: :const:`FILTER_LZMA1` (para uso com :const:`FORMAT_ALONE`)
sv: :const:`FILTER_LZMA1` (för användning med :const:`FORMAT_ALONE`)

source: :const:`FILTER_LZMA2` (for use with :const:`FORMAT_XZ` and :const:`FORMAT_RAW`)
pt_pt: :const:`FILTER_LZMA2` (para uso com :const:`FORMAT_XZ` e :const:`FORMAT_RAW`)
sv: :const:`FILTER_LZMA2` (för användning med :const:`FORMAT_XZ` och :const:`FORMAT_RAW`)

source: Delta filter:
pt_pt: Filtro Delta:

source: Branch-Call-Jump (BCJ) filters:
pt_pt: Filtros Branch-Call-Jump (BCJ):
sv: BCJ-filter (Branch-Call-Jump):

source: A filter chain can consist of up to 4 filters, and cannot be empty. The last filter in the chain must be a compression filter, and any other filters must be delta or BCJ filters.
pt_pt: Uma cadeia de filtros pode consistir em até 4 filtros e não pode estar vazia. O último filtro na cadeia deve ser um filtro de compressão e quaisquer outros filtros devem ser filtros delta ou BCJ.
sv: En filterkedja kan bestå av upp till 4 filter och kan inte vara tom. Det sista filtret i kedjan måste vara ett kompressionsfilter och alla andra filter måste vara delta- eller BCJ-filter.

source: Compression filters support the following options (specified as additional entries in the dictionary representing the filter):
pt_pt: Os filtros de compressão suportam as seguintes opções (especificadas como entradas adicionais no dicionário que representa o filtro):
sv: Komprimeringsfilter har stöd för följande alternativ (anges som ytterligare poster i den ordbok som representerar filtret):

source: ``preset``: A compression preset to use as a source of default values for options that are not specified explicitly.
pt_pt: ``preset``: Uma pré-definição de compressão a usar como fonte de valores predefinidos para opções que não são especificadas explicitamente.
sv: ``preset``: En förinställning för komprimering som ska användas som källa för standardvärden för alternativ som inte anges explicit.

source: ``dict_size``: Dictionary size in bytes. This should be between 4 KiB and 1.5 GiB (inclusive).
pt_pt: ``dict_size``: Tamanho do dicionário em bytes. Isto deve estar entre 4 KiB e 1.5 GiB (inclusive).
sv: ``dict_size``: Ordbokens storlek i byte. Den bör ligga mellan 4 KiB och 1,5 GiB (inklusive).

source: ``lc``: Number of literal context bits.
pt_pt: ``lc``: Número de bits de contexto literal.
sv: ``lc``: Antal bitar för bokstavskontext.

source: ``lp``: Number of literal position bits. The sum ``lc + lp`` must be at most 4.
pt_pt: ``lp``: Número de bits de posição literal. A soma ``lc + lp`` deve ser no máximo 4.
sv: ``lp``: Antal bitar för bokstavsposition. Summan ``lc + lp`` måste vara högst 4.

source: ``pb``: Number of position bits; must be at most 4.
pt_pt: ``pb``: Número de bits de posição; deve ser no máximo 4.
sv: ``pb``: Antal positionsbitar; får vara högst 4.

source: ``mode``: :const:`MODE_FAST` or :const:`MODE_NORMAL`.
pt_pt: ``mode``: :const:`MODE_FAST` ou :const:`MODE_NORMAL`.
sv: ``mode``: :const:`MODE_FAST` eller :const:`MODE_NORMAL`.

source: ``nice_len``: What should be considered a "nice length" for a match. This should be 273 or less.
pt_pt: ``nice_len``: O que deve ser considerado um "comprimento bom" para uma correspondência. Isto deve ser 273 ou menos.
sv: ``nice_len``: Vad som ska anses vara en "fin längd" för en match. Detta bör vara 273 eller mindre.

source: ``mf``: What match finder to use -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3`, or :const:`MF_BT4`.
pt_pt: ``mf``: Que *match finder* usar — :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3` ou :const:`MF_BT4`.
sv: ``mf``: Vilken matchningssökare som ska användas -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3`, eller :const:`MF_BT4`.

source: ``depth``: Maximum search depth used by match finder. 0 (default) means to select automatically based on other filter options.
pt_pt: ``depth``: Profundidade de pesquisa máxima usada pelo *match finder*. 0 (predefinido) significa selecionar automaticamente com base em outras opções do filtro.
sv: ``depth``: Maximalt sökdjup som används av matchningshittaren. 0 (standard) innebär att du väljer automatiskt baserat på andra filteralternativ.

source: The delta filter stores the differences between bytes, producing more repetitive input for the compressor in certain circumstances. It supports one option, ``dist``. This indicates the distance between bytes to be subtracted. The default is 1, i.e. take the differences between adjacent bytes.
pt_pt: O filtro delta armazena as diferenças entre bytes, produzindo entrada mais repetitiva para o compressor em certas circunstâncias. Suporta uma opção, ``dist``. Isto indica a distância entre bytes a serem subtraídos. O predefinido é 1, ou seja, tomar as diferenças entre bytes adjacentes.
sv: Deltafiltret lagrar skillnaderna mellan byte, vilket under vissa omständigheter ger mer repetitiv indata till kompressorn. Det har stöd för ett alternativ, ``dist``. Detta anger avståndet mellan byte som ska subtraheras. Standardvärdet är 1, d.v.s. skillnaden mellan intilliggande bytes tas med.

source: The BCJ filters are intended to be applied to machine code. They convert relative branches, calls and jumps in the code to use absolute addressing, with the aim of increasing the redundancy that can be exploited by the compressor. These filters support one option, ``start_offset``. This specifies the address that should be mapped to the beginning of the input data. The default is 0.
pt_pt: Os filtros BCJ são destinados a ser aplicados a código de máquina. Convertem ramificações, chamadas e saltos relativos no código para usar endereçamento absoluto, com o objetivo de aumentar a redundância que pode ser explorada pelo compressor. Estes filtros suportam uma opção, ``start_offset``. Isto especifica o endereço que deve ser mapeado para o início dos dados de entrada. O predefinido é 0.
sv: BCJ-filtren är avsedda att tillämpas på maskinkod. De konverterar relativa grenar, anrop och hopp i koden så att absolut adressering används, i syfte att öka den redundans som kan utnyttjas av kompressorn. Dessa filter har stöd för ett alternativ, ``start_offset``. Detta anger vilken adress som ska mappas till början av indata. Standardvärdet är 0.

source: Examples
pt_pt: Exemplos
sv: Exempel

source: Reading in a compressed file::
pt_pt: Ler um ficheiro comprimido::
sv: Läsa in en komprimerad fil::

source: Creating a compressed file::
pt_pt: Criar um ficheiro comprimido::
sv: Skapa en komprimerad fil::

source: Compressing data in memory::
pt_pt: Comprimir dados em memória::
sv: Komprimering av data i minnet::

source: Incremental compression::
pt_pt: Compressão incremental::
sv: Inkrementell komprimering::

source: import lzma lzc = lzma.LZMACompressor() out1 = lzc.compress(b"Some data\n") out2 = lzc.compress(b"Another piece of data\n") out3 = lzc.compress(b"Even more data\n") out4 = lzc.flush() # Concatenate all the partial results: result = b"".join([out1, out2, out3, out4])
pt_pt: import lzma lzc = lzma.LZMACompressor() out1 = lzc.compress(b"Some data\n") out2 = lzc.compress(b"Another piece of data\n") out3 = lzc.compress(b"Even more data\n") out4 = lzc.flush() # Concatenar todos os resultados parciais: result = b"".join([out1, out2, out3, out4])

source: Writing compressed data to an already-open file::
pt_pt: Escrever dados comprimidos num ficheiro já aberto::
sv: Skriva komprimerad data till en redan öppen fil::

source: Creating a compressed file using a custom filter chain::
pt_pt: Criar um ficheiro comprimido usando uma cadeia de filtros personalizada::
sv: Skapa en komprimerad fil med hjälp av en anpassad filterkedja::
