Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/mailbox.po
Languages: pt_pt, ru

source: A subclass of :class:`Mailbox` for mailboxes in Babyl format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`BabylMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
pt_pt: Uma subclasse de :class:`Mailbox` para caixas de correio no formato Babyl. O parâmetro *factory* é um objeto chamável que aceita uma representação de mensagem semelhante a um ficheiro (que se comporta como se estivesse aberta em modo binário) e retorna uma representação personalizada. Se *factory* for ``None``, :class:`BabylMessage` é usado como a representação de mensagem predefinida. Se *create* for ``True``, a caixa de correio é criada se não existir.
ru: Подкласс :class:`Mailbox` для почтовых ящиков в формате Babyl. Параметр *factory* — это вызываемый объект, который принимает файловое представление сообщения (которое ведет себя так, как если бы оно было открыто в двоичном режиме) и возвращает пользовательское представление. Если *factory* имеет значение None, :class:`BabylMessage` используется в качестве представления сообщения по умолчанию. Если *create* имеет значение True, почтовый ящик создается, если он не существует.

source: Babyl is a single-file mailbox format used by the Rmail mail user agent included with Emacs. The beginning of a message is indicated by a line containing the two characters Control-Underscore (``'\037'``) and Control-L (``'\014'``). The end of a message is indicated by the start of the next message or, in the case of the last message, a line containing a Control-Underscore (``'\037'``) character.
pt_pt: Babyl é um formato de caixa de correio de ficheiro único usado pelo agente de utilizador de correio Rmail incluído com o Emacs. O início de uma mensagem é indicado por uma linha contendo os dois caracteres Control-Underscore (``'\037'``) e Control-L (``'\014'``). O fim de uma mensagem é indicado pelo início da próxima mensagem ou, no caso da última mensagem, por uma linha contendo um carácter Control-Underscore (``'\037'``).
ru: Babyl — это формат однофайлового почтового ящика, используемый почтовым пользовательским агентом Rmail, включенным в Emacs. Начало сообщения обозначается строкой, содержащей два символа Control-Underscore (``'\037'``) и Control-L (``'\014'``). Конец сообщения обозначается началом следующего сообщения или, в случае последнего сообщения, строкой, содержащей символ Control-Underscore (``'\037'``).

source: Messages in a Babyl mailbox have two sets of headers, original headers and so-called visible headers. Visible headers are typically a subset of the original headers that have been reformatted or abridged to be more attractive. Each message in a Babyl mailbox also has an accompanying list of :dfn:`labels`, or short strings that record extra information about the message, and a list of all user-defined labels found in the mailbox is kept in the Babyl options section.
pt_pt: As mensagens numa caixa de correio Babyl têm dois conjuntos de cabeçalhos: cabeçalhos originais e os chamados cabeçalhos visíveis. Os cabeçalhos visíveis são tipicamente um subconjunto dos cabeçalhos originais que foram reformatados ou abreviados para serem mais atraentes. Cada mensagem numa caixa de correio Babyl também tem uma lista acompanhante de :dfn:`etiquetas`, ou strings curtas que registam informações extras sobre a mensagem, e uma lista de todas as etiquetas definidas pelo utilizador encontradas na caixa de correio é mantida na secção de opções Babyl.
ru: Сообщения в почтовом ящике Babyl имеют два набора заголовков: оригинальные заголовки и так называемые видимые заголовки. Видимые заголовки обычно представляют собой подмножество исходных заголовков, которые были переформатированы или сокращены, чтобы сделать их более привлекательными. Каждое сообщение в почтовом ящике Babyl также имеет сопроводительный список :dfn:`labels` или коротких строк, которые записывают дополнительную информацию о сообщении, а список всех пользовательских меток, найденных в почтовом ящике, хранится в разделе параметров Babyl. .

source: :class:`!Babyl` instances have all of the methods of :class:`Mailbox` in addition to the following:
pt_pt: As instâncias :class:`!Babyl` têm todos os métodos de :class:`Mailbox`, além dos seguintes:
ru: Экземпляры :class:`!Babyl` имеют все методы :class:`Mailbox` в дополнение к следующим:

source: Return a list of the names of all user-defined labels used in the mailbox.
pt_pt: Retorna uma lista com os nomes de todas as etiquetas definidas pelo utilizador usadas na caixa de correio.
ru: Возвращает список имен всех определяемых пользователем меток, используемых в почтовом ящике.

source: The actual messages are inspected to determine which labels exist in the mailbox rather than consulting the list of labels in the Babyl options section, but the Babyl section is updated whenever the mailbox is modified.
pt_pt: As mensagens reais são inspecionadas para determinar quais etiquetas existem na caixa de correio em vez de consultar a lista de etiquetas na secção de opções Babyl, mas a secção Babyl é atualizada sempre que a caixa de correio é modificada.
ru: Фактические сообщения проверяются, чтобы определить, какие метки существуют в почтовом ящике, а не сверяются со списком меток в разделе параметров Babyl, но раздел Babyl обновляется при каждом изменении почтового ящика.

source: Some :class:`Mailbox` methods implemented by :class:`!Babyl` deserve special remarks:
pt_pt: Alguns métodos :class:`Mailbox` implementados por :class:`!Babyl` merecem comentários especiais:
ru: Некоторые методы :class:`Mailbox`, реализованные :class:`!Babyl`, заслуживают особого внимания:

source: In Babyl mailboxes, the headers of a message are not stored contiguously with the body of the message. To generate a file-like representation, the headers and body are copied together into an :class:`io.BytesIO` instance, which has an API identical to that of a file. As a result, the file-like object is truly independent of the underlying mailbox but does not save memory compared to a string representation.
pt_pt: Nas caixas de correio Babyl, os cabeçalhos de uma mensagem não são armazenados contiguamente com o corpo da mensagem. Para gerar uma representação semelhante a um ficheiro, os cabeçalhos e o corpo são copiados juntos para uma instância :class:`io.BytesIO`, que tem uma API idêntica à de um ficheiro. Como resultado, o objeto semelhante a um ficheiro é verdadeiramente independente da caixa de correio subjacente, mas não poupa memória em comparação com uma representação em string.
ru: В почтовых ящиках Babyl заголовки сообщения не хранятся рядом с телом сообщения. Чтобы создать файловое представление, заголовки и тело копируются вместе в экземпляр :class:`io.BytesIO`, который имеет API, идентичный API-интерфейсу файла. В результате объект, подобный файлу, действительно независим от базового почтового ящика, но не экономит память по сравнению со строковым представлением.

source: `Format of Version 5 Babyl Files <https://quimby.gnus.org/notes/BABYL>`_
pt_pt: `Formato dos Ficheiros Babyl Versão 5 <https://quimby.gnus.org/notes/BABYL>`_
ru: `Формат файлов Babyl версии 5 <https://quimby.gnus.org/notes/BABYL>`_

source: A specification of the Babyl format.
pt_pt: Uma especificação do formato Babyl.
ru: Спецификация формата Babyl.

source: `Reading Mail with Rmail <https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html>`_
pt_pt: `Ler Correio com Rmail <https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html>`_
ru: `Чтение почты с помощью Rmail <https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html>`_

source: The Rmail manual, with some information on Babyl semantics.
pt_pt: O manual do Rmail, com algumas informações sobre a semântica Babyl.
ru: Руководство по Rmail с некоторой информацией о семантике Babyl.

source: :class:`!MMDF` objects
pt_pt: Objetos :class:`!MMDF`
ru: :class:`!MMDF` объекты

source: A subclass of :class:`Mailbox` for mailboxes in MMDF format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MMDFMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
pt_pt: Uma subclasse de :class:`Mailbox` para caixas de correio no formato MMDF. O parâmetro *factory* é um objeto chamável que aceita uma representação de mensagem semelhante a um ficheiro (que se comporta como se estivesse aberta em modo binário) e retorna uma representação personalizada. Se *factory* for ``None``, :class:`MMDFMessage` é usado como a representação de mensagem predefinida. Se *create* for ``True``, a caixa de correio é criada se não existir.
ru: Подкласс :class:`Mailbox` для почтовых ящиков в формате MMDF. Параметр *factory* — это вызываемый объект, который принимает файловое представление сообщения (которое ведет себя так, как если бы оно было открыто в двоичном режиме) и возвращает пользовательское представление. Если *factory* имеет значение None, в качестве представления сообщения по умолчанию используется :class:`MMDFMessage`. Если *create* имеет значение True, почтовый ящик создается, если он не существует.

source: MMDF is a single-file mailbox format invented for the Multichannel Memorandum Distribution Facility, a mail transfer agent. Each message is in the same form as an mbox message but is bracketed before and after by lines containing four Control-A (``'\001'``) characters. As with the mbox format, the beginning of each message is indicated by a line whose first five characters are "From ", but additional occurrences of "From " are not transformed to ">From " when storing messages because the extra message separator lines prevent mistaking such occurrences for the starts of subsequent messages.
pt_pt: MMDF é um formato de caixa de correio de ficheiro único inventado para o Multichannel Memorandum Distribution Facility, um agente de transferência de correio. Cada mensagem está na mesma forma que uma mensagem mbox, mas é delimitada antes e depois por linhas contendo quatro caracteres Control-A (``'\001'``). Tal como no formato mbox, o início de cada mensagem é indicado por uma linha cujos primeiros cinco caracteres são "From ", mas ocorrências adicionais de "From " não são transformadas em ">From " ao armazenar mensagens, porque as linhas separadoras de mensagem adicionais impedem que tais ocorrências sejam confundidas com os inícios de mensagens subsequentes.
ru: MMDF — это формат однофайлового почтового ящика, изобретенный для Multichannel Memorandum Distribution Facility, агента передачи почты. Каждое сообщение имеет ту же форму, что и сообщение mbox, но до и после него заключено в квадратные скобки строками, содержащими четыре символа Control-A (``'\001'``). Как и в формате mbox, начало каждого сообщения обозначается строкой, первые пять символов которой — «От», но дополнительные вхождения «От» не преобразуются в «>От» при сохранении сообщений, поскольку дополнительные строки-разделители сообщений не позволяют ошибочно принимают такие события за начало последующих сообщений.

source: Some :class:`Mailbox` methods implemented by :class:`!MMDF` deserve special remarks:
pt_pt: Alguns métodos :class:`Mailbox` implementados por :class:`!MMDF` merecem comentários especiais:
ru: Некоторые методы :class:`Mailbox`, реализованные :class:`!MMDF`, заслуживают особого внимания:

source: Using the file after calling :meth:`~Mailbox.flush` or :meth:`~Mailbox.close` on the :class:`!MMDF` instance may yield unpredictable results or raise an exception.
pt_pt: Usar o ficheiro após chamar :meth:`~Mailbox.flush` ou :meth:`~Mailbox.close` na instância :class:`!MMDF` pode produzir resultados imprevisíveis ou levantar uma exceção.
ru: Использование файла после вызова :meth:`~Mailbox.flush` или :meth:`~Mailbox.close` в экземпляре :class:`!MMDF` может привести к непредсказуемым результатам или вызвать исключение.

source: `mmdf man page from tin <http://www.tin.org/bin/man.cgi?section=5&topic=mmdf>`_
pt_pt: `Página de manual mmdf do tin <http://www.tin.org/bin/man.cgi?section=5&topic=mmdf>`_
ru: `Справочная страница mmdf из Tin <http://www.tin.org/bin/man.cgi?section=5&topic=mmdf>`_

source: A specification of MMDF format from the documentation of tin, a newsreader.
pt_pt: Uma especificação do formato MMDF da documentação do tin, um leitor de notícias.
ru: Спецификация формата MMDF из документации жести, читалки.

source: A Wikipedia article describing the Multichannel Memorandum Distribution Facility.
pt_pt: Um artigo da Wikipedia que descreve o Multichannel Memorandum Distribution Facility.
ru: Статья в Википедии, описывающая механизм многоканального распространения меморандумов.

source: :class:`!Message` objects
pt_pt: Objetos :class:`!Message`
ru: :class:`!Message` объекты

source: A subclass of the :mod:`email.message` module's :class:`~email.message.Message`. Subclasses of :class:`!mailbox.Message` add mailbox-format-specific state and behavior.
pt_pt: Uma subclasse do módulo :mod:`email.message` :class:`~email.message.Message`. As subclasses de :class:`!mailbox.Message` adicionam estado e comportamento específicos do formato da caixa de correio.
ru: Подкласс модуля :mod:`email.message` :class:`~email.message.Message`. Подклассы :class:`!mailbox.Message` добавляют состояние и поведение, зависящие от формата почтового ящика.

source: If *message* is omitted, the new instance is created in a default, empty state. If *message* is an :class:`email.message.Message` instance, its contents are copied; furthermore, any format-specific information is converted insofar as possible if *message* is a :class:`!Message` instance. If *message* is a string, a byte string, or a file, it should contain an :rfc:`2822`\ -compliant message, which is read and parsed. Files should be open in binary mode, but text mode files are accepted for backward compatibility.
ru: Если *message* опущено, новый экземпляр создается в пустом состоянии по умолчанию. Если *message* является экземпляром :class:`email.message.Message`, его содержимое копируется; кроме того, любая информация, специфичная для формата, преобразуется, насколько это возможно, если *message* является экземпляром :class:`!Message`. Если *message* представляет собой строку, байтовую строку или файл, оно должно содержать сообщение, совместимое с :rfc:`2822`\, которое читается и анализируется. Файлы должны открываться в двоичном режиме, но файлы в текстовом режиме принимаются для обратной совместимости.

source: The format-specific state and behaviors offered by subclasses vary, but in general it is only the properties that are not specific to a particular mailbox that are supported (although presumably the properties are specific to a particular mailbox format). For example, file offsets for single-file mailbox formats and file names for directory-based mailbox formats are not retained, because they are only applicable to the original mailbox. But state such as whether a message has been read by the user or marked as important is retained, because it applies to the message itself.
pt_pt: O estado e comportamentos específicos do formato oferecidos pelas subclasses variam, mas em geral apenas as propriedades que não são específicas de uma determinada caixa de correio são suportadas (embora presumivelmente as propriedades sejam específicas de um determinado formato de caixa de correio). Por exemplo, deslocamentos de ficheiro para formatos de caixa de correio de ficheiro único e nomes de ficheiros para formatos de caixa de correio baseados em diretórios não são retidos, porque só são aplicáveis à caixa de correio original. Mas o estado, como se uma mensagem foi lida pelo utilizador ou marcada como importante, é retido, porque se aplica à mensagem em si.
ru: Состояние и поведение, зависящие от формата, предлагаемые подклассами, различаются, но в целом поддерживаются только свойства, не специфичные для конкретного почтового ящика (хотя предположительно свойства специфичны для конкретного формата почтового ящика). Например, смещения файлов для однофайловых форматов почтовых ящиков и имена файлов для форматов почтовых ящиков на основе каталога не сохраняются, поскольку они применимы только к исходному почтовому ящику. Но состояние, например, было ли сообщение прочитано пользователем или отмечено как важное, сохраняется, поскольку оно применяется к самому сообщению.

source: There is no requirement that :class:`!Message` instances be used to represent messages retrieved using :class:`Mailbox` instances. In some situations, the time and memory required to generate :class:`!Message` representations might not be acceptable. For such situations, :class:`!Mailbox` instances also offer string and file-like representations, and a custom message factory may be specified when a :class:`!Mailbox` instance is initialized.
pt_pt: Não há exigência de que as instâncias :class:`!Message` sejam usadas para representar mensagens recuperadas usando instâncias :class:`Mailbox`. Em algumas situações, o tempo e a memória necessários para gerar representações :class:`!Message` podem não ser aceitáveis. Para tais situações, as instâncias :class:`!Mailbox` também oferecem representações em string e semelhantes a ficheiros, e uma fábrica de mensagens personalizada pode ser especificada quando uma instância :class:`!Mailbox` é inicializada.
ru: Нет требования, чтобы экземпляры :class:`!Message` использовались для представления сообщений, полученных с помощью экземпляров :class:`Mailbox`. В некоторых ситуациях время и память, необходимые для создания представлений :class:`!Message`, могут оказаться неприемлемыми. Для таких ситуаций экземпляры :class:`!Mailbox` также предлагают строковые и файловые представления, а при инициализации экземпляра :class:`!Mailbox` можно указать собственную фабрику сообщений.

source: :class:`!MaildirMessage` objects
pt_pt: Objetos :class:`!MaildirMessage`
ru: :class:`!MaildirMessage` объекты

source: A message with Maildir-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
pt_pt: Uma mensagem com comportamentos específicos do Maildir. O parâmetro *message* tem o mesmo significado que no construtor :class:`Message`.
ru: Сообщение с поведением, специфичным для Maildir. Параметр *message* имеет то же значение, что и конструктор :class:`Message`.

source: Typically, a mail user agent application moves all of the messages in the :file:`new` subdirectory to the :file:`cur` subdirectory after the first time the user opens and closes the mailbox, recording that the messages are old whether or not they've actually been read. Each message in :file:`cur` has an "info" section added to its file name to store information about its state. (Some mail readers may also add an "info" section to messages in :file:`new`.) The "info" section may take one of two forms: it may contain "2," followed by a list of standardized flags (e.g., "2,FR") or it may contain "1," followed by so-called experimental information. Standard flags for Maildir messages are as follows:
pt_pt: Tipicamente, uma aplicação de agente de utilizador de correio move todas as mensagens no subdiretório :file:`new` para o subdiretório :file:`cur` após a primeira vez que o utilizador abre e fecha a caixa de correio, registando que as mensagens são antigas, independentemente de terem sido realmente lidas. Cada mensagem em :file:`cur` tem uma secção "info" adicionada ao seu nome de ficheiro para armazenar informações sobre o seu estado. (Alguns leitores de correio também podem adicionar uma secção "info" às mensagens em :file:`new`.) A secção "info" pode tomar uma de duas formas: pode conter "2," seguido de uma lista de flags padronizadas (por exemplo, "2,FR") ou pode conter "1," seguido de informações experimentais. As flags padrão para mensagens Maildir são as seguintes:
ru: Обычно приложение почтового пользовательского агента перемещает все сообщения из подкаталога :file:`new` в подкаталог :file:`cur` после того, как пользователь впервые открывает и закрывает почтовый ящик, фиксируя, что сообщения старые, вне зависимости от того, являются ли сообщения устаревшими. нет, они на самом деле были прочитаны. К каждому сообщению в :file:`cur` к имени файла добавляется раздел «информация» для хранения информации о его состоянии. (Некоторые программы чтения почты могут также добавлять раздел «информация» к сообщениям в :file:`new`.) Раздел «информация» может принимать одну из двух форм: он может содержать цифру «2», за которой следует список стандартизированных флагов ( например, «2,FR») или может содержать «1», за которой следует так называемая экспериментальная информация. Стандартные флаги для сообщений Maildir следующие:

source: Flag
ru: Флаг

source: Meaning
pt_pt: Significado
ru: Значение

source: Explanation
pt_pt: Explicação
ru: Пояснение

source: Draft
pt_pt: Rascunho
ru: Проект

source: Under composition
pt_pt: Em composição
ru: В составе

source: Flagged
pt_pt: Marcado
ru: Помечено

source: Marked as important
pt_pt: Marcado como importante
ru: Отмечено как важное

source: Passed
pt_pt: Reencaminhado
ru: Прошедший

source: Forwarded, resent, or bounced
pt_pt: Reencaminhado, reenviado ou devolvido
ru: Переадресовано, повторно отправлено или отклонено

source: Replied
pt_pt: Respondido
ru: Ответил

source: Replied to
pt_pt: Respondido
ru: Ответил на

source: Seen
pt_pt: Visto
ru: Видимый

source: Read
pt_pt: Lido
ru: Читать

source: Trashed
pt_pt: Lixo
ru: Выброшен

source: Marked for subsequent deletion
pt_pt: Marcado para eliminação subsequente
ru: Отмечено для последующего удаления

source: :class:`!MaildirMessage` instances offer the following methods:
pt_pt: As instâncias :class:`!MaildirMessage` oferecem os seguintes métodos:
ru: Экземпляры :class:`!MaildirMessage` предлагают следующие методы:

source: Return either "new" (if the message should be stored in the :file:`new` subdirectory) or "cur" (if the message should be stored in the :file:`cur` subdirectory).
pt_pt: Retorna "new" (se a mensagem deve ser armazenada no subdiretório :file:`new`) ou "cur" (se a mensagem deve ser armazenada no subdiretório :file:`cur`).
ru: Возвращает либо «new» (если сообщение должно храниться в подкаталоге :file:`new`), либо «cur» (если сообщение должно храниться в подкаталоге :file:`cur`).

source: A message is typically moved from :file:`new` to :file:`cur` after its mailbox has been accessed, whether or not the message has been read. A message ``msg`` has been read if ``"S" in msg.get_flags()`` is ``True``.
ru: Сообщение обычно перемещается из :file:`new` в :file:`cur` после того, как был осуществлен доступ к его почтовому ящику, независимо от того, было ли сообщение прочитано. Сообщение ``msg`` было прочитано, если ``S' в msg.get_flags()`` имеет значение ``True``.

source: Set the subdirectory the message should be stored in. Parameter *subdir* must be either "new" or "cur".
pt_pt: Define o subdiretório onde a mensagem deve ser armazenada. O parâmetro *subdir* deve ser "new" ou "cur".
ru: Установите подкаталог, в котором должно храниться сообщение. Параметр *subdir* должен быть либо «new», либо «cur».
