Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/mailbox.po
Languages: pt_pt, ru

source: By default, Rmail displays only visible headers. The :class:`!BabylMessage` class, though, uses the original headers because they are more complete. Visible headers may be accessed explicitly if desired.
pt_pt: Por predefinição, o Rmail mostra apenas os cabeçalhos visíveis. A classe :class:`!BabylMessage`, no entanto, usa os cabeçalhos originais porque são mais completos. Os cabeçalhos visíveis podem ser acedidos explicitamente, se desejado.
ru: По умолчанию Rmail отображает только видимые заголовки. Однако класс :class:`!BabylMessage` использует исходные заголовки, поскольку они более полны. При желании к видимым заголовкам можно получить доступ явным образом.

source: :class:`!BabylMessage` instances offer the following methods:
pt_pt: As instâncias :class:`!BabylMessage` oferecem os seguintes métodos:
ru: Экземпляры :class:`!BabylMessage` предлагают следующие методы:

source: Return a list of labels on the message.
pt_pt: Retorna uma lista de etiquetas na mensagem.
ru: Возвращает список меток сообщения.

source: Set the list of labels on the message to *labels*.
pt_pt: Define a lista de etiquetas na mensagem para *labels*.
ru: Установите для списка меток сообщения значение *labels*.

source: Add *label* to the list of labels on the message.
pt_pt: Adiciona *label* à lista de etiquetas na mensagem.
ru: Добавьте *label* в список ярлыков сообщения.

source: Remove *label* from the list of labels on the message.
pt_pt: Remove *label* da lista de etiquetas na mensagem.
ru: Удалите *label* из списка ярлыков сообщения.

source: Return a :class:`Message` instance whose headers are the message's visible headers and whose body is empty.
pt_pt: Retorna uma instância :class:`Message` cujos cabeçalhos são os cabeçalhos visíveis da mensagem e cujo corpo está vazio.
ru: Возвращает экземпляр :class:`Message`, заголовки которого являются видимыми заголовками сообщения, а тело пусто.

source: Set the message's visible headers to be the same as the headers in *message*. Parameter *visible* should be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, or a file-like object (which should be open in text mode).
pt_pt: Define os cabeçalhos visíveis da mensagem para serem os mesmos que os cabeçalhos em *message*. O parâmetro *visible* deve ser uma instância :class:`Message`, uma instância :class:`email.message.Message`, uma string ou um objeto semelhante a um ficheiro (que deve estar aberto em modo de texto).
ru: Установите видимые заголовки сообщения такими же, как заголовки в *message*. Параметр *visible* должен быть экземпляром :class:`Message`, экземпляром :class:`email.message.Message`, строкой или файлоподобным объектом (который должен быть открыт в текстовом режиме).

source: When a :class:`!BabylMessage` instance's original headers are modified, the visible headers are not automatically modified to correspond. This method updates the visible headers as follows: each visible header with a corresponding original header is set to the value of the original header, each visible header without a corresponding original header is removed, and any of :mailheader:`Date`, :mailheader:`From`, :mailheader:`Reply-To`, :mailheader:`To`, :mailheader:`CC`, and :mailheader:`Subject` that are present in the original headers but not the visible headers are added to the visible headers.
pt_pt: Quando os cabeçalhos originais de uma instância :class:`!BabylMessage` são modificados, os cabeçalhos visíveis não são automaticamente modificados para corresponder. Este método atualiza os cabeçalhos visíveis da seguinte forma: cada cabeçalho visível com um cabeçalho original correspondente é definido para o valor do cabeçalho original, cada cabeçalho visível sem um cabeçalho original correspondente é removido, e quaisquer dos seguintes que estejam presentes nos cabeçalhos originais, mas não nos cabeçalhos visíveis, são adicionados aos cabeçalhos visíveis: :mailheader:`Date`, :mailheader:`From`, :mailheader:`Reply-To`, :mailheader:`To`, :mailheader:`CC` e :mailheader:`Subject`.
ru: Когда исходные заголовки экземпляра :class:`!BabylMessage` изменяются, видимые заголовки не изменяются автоматически для соответствия. Этот метод обновляет видимые заголовки следующим образом: каждому видимому заголовку с соответствующим исходным заголовком присваивается значение исходного заголовка, каждый видимый заголовок без соответствующего исходного заголовка удаляется, и любой из :mailheader:`Date`, :mailheader :`From`, :mailheader:`Reply-To`, :mailheader:`To`, :mailheader:`CC` и :mailheader:`Subject`, которые присутствуют в исходных заголовках, но не добавляются видимые заголовки. видимые заголовки.

source: When a :class:`!BabylMessage` instance is created based upon a :class:`MaildirMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!BabylMessage` é criada com base numa instância :class:`MaildirMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!BabylMessage` создается на основе экземпляра :class:`MaildirMessage`, происходят следующие преобразования:

source: "forwarded" label
pt_pt: Etiqueta "forwarded"
ru: метка "forwarded"

source: When a :class:`!BabylMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
pt_pt: Quando uma instância :class:`!BabylMessage` é criada com base numa instância :class:`mboxMessage` ou :class:`MMDFMessage`, os cabeçalhos :mailheader:`Status` e :mailheader:`X-Status` são omitidos e as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!BabylMessage` создается на основе экземпляра :class:`mboxMessage` или :class:`MMDFMessage`, заголовки :mailheader:`Status` и :mailheader:`X-Status` опускаются и происходят следующие преобразования:

source: When a :class:`!BabylMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!BabylMessage` é criada com base numa instância :class:`MHMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!BabylMessage` создается на основе экземпляра :class:`MHMessage`, происходят следующие преобразования:

source: :class:`!MMDFMessage` objects
pt_pt: Objetos :class:`!MMDFMessage`
ru: :class:`!MMDFMessage` объекты

source: A message with MMDF-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
pt_pt: Uma mensagem com comportamentos específicos do MMDF. O parâmetro *message* tem o mesmo significado que no construtor :class:`Message`.
ru: Сообщение с поведением, специфичным для MMDF. Параметр *message* имеет то же значение, что и конструктор :class:`Message`.

source: As with message in an mbox mailbox, MMDF messages are stored with the sender's address and the delivery date in an initial line beginning with "From ". Likewise, flags that indicate the state of the message are typically stored in :mailheader:`Status` and :mailheader:`X-Status` headers.
pt_pt: Tal como as mensagens numa caixa de correio mbox, as mensagens MMDF são armazenadas com o endereço do remetente e a data de entrega numa linha inicial que começa com "From ". Da mesma forma, as flags que indicam o estado da mensagem são tipicamente armazenadas nos cabeçalhos :mailheader:`Status` e :mailheader:`X-Status`.
ru: Как и сообщение в почтовом ящике mbox, сообщения MMDF хранятся с адресом отправителя и датой доставки в начальной строке, начинающейся с «От». Аналогично, флаги, указывающие состояние сообщения, обычно хранятся в заголовках :mailheader:`Status` и :mailheader:`X-Status`.

source: Conventional flags for MMDF messages are identical to those of mbox message and are as follows:
pt_pt: As flags convencionais para mensagens MMDF são idênticas às das mensagens mbox e são as seguintes:
ru: Обычные флаги для сообщений MMDF идентичны флагам сообщения mbox и имеют следующий вид:

source: :class:`!MMDFMessage` instances offer the following methods, which are identical to those offered by :class:`mboxMessage`:
pt_pt: As instâncias :class:`!MMDFMessage` oferecem os seguintes métodos, que são idênticos aos oferecidos por :class:`mboxMessage`:
ru: Экземпляры :class:`!MMDFMessage` предлагают следующие методы, идентичные тем, которые предлагает :class:`mboxMessage`:

source: When an :class:`!MMDFMessage` instance is created based upon a :class:`MaildirMessage` instance, a "From " line is generated based upon the :class:`MaildirMessage` instance's delivery date, and the following conversions take place:
pt_pt: Quando uma instância :class:`!MMDFMessage` é criada com base numa instância :class:`MaildirMessage`, uma linha "From " é gerada com base na data de entrega da instância :class:`MaildirMessage`, e as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MMDFMessage` создается на основе экземпляра :class:`MaildirMessage`, строка «От» генерируется на основе даты доставки экземпляра :class:`MaildirMessage`, и происходят следующие преобразования:

source: When an :class:`!MMDFMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!MMDFMessage` é criada com base numa instância :class:`MHMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MMDFMessage` создается на основе экземпляра :class:`MHMessage`, происходят следующие преобразования:

source: When an :class:`!MMDFMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!MMDFMessage` é criada com base numa instância :class:`BabylMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MMDFMessage` создается на основе экземпляра :class:`BabylMessage`, происходят следующие преобразования:

source: When an :class:`!MMDFMessage` instance is created based upon an :class:`mboxMessage` instance, the "From " line is copied and all flags directly correspond:
pt_pt: Quando uma instância :class:`!MMDFMessage` é criada com base numa instância :class:`mboxMessage`, a linha "From " é copiada e todas as flags correspondem diretamente:
ru: Когда экземпляр :class:`!MMDFMessage` создается на основе экземпляра :class:`mboxMessage`, копируется строка "From" и все флаги напрямую соответствуют:

source: :class:`mboxMessage` state
pt_pt: Estado :class:`mboxMessage`
ru: Статус :class:`mboxMessage`

source: Exceptions
pt_pt: Exceções
ru: Исключения

source: The following exception classes are defined in the :mod:`!mailbox` module:
pt_pt: As seguintes classes de exceção são definidas no módulo :mod:`!mailbox`:
ru: Следующие классы исключений определены в модуле :mod:`!mailbox`:

source: The based class for all other module-specific exceptions.
pt_pt: A classe base para todas as outras exceções específicas do módulo.
ru: Базовый класс для всех других исключений, специфичных для модуля.

source: Raised when a mailbox is expected but is not found, such as when instantiating a :class:`Mailbox` subclass with a path that does not exist (and with the *create* parameter set to ``False``), or when opening a folder that does not exist.
pt_pt: Levantada quando uma caixa de correio é esperada mas não é encontrada, como ao instanciar uma subclasse :class:`Mailbox` com um caminho que não existe (e com o parâmetro *create* definido como ``False``), ou ao abrir uma pasta que não existe.
ru: Возникает, когда почтовый ящик ожидается, но не найден, например, при создании экземпляра подкласса :class:`Mailbox` с несуществующим путем (и с параметром *create*, установленным в ``False``), или при открытии папка, которой нет.

source: Raised when a mailbox is not empty but is expected to be, such as when deleting a folder that contains messages.
pt_pt: Levantada quando uma caixa de correio não está vazia, mas é esperado que esteja, como ao apagar uma pasta que contém mensagens.
ru: Возникает, когда почтовый ящик не пуст, но ожидается, что он будет пустым, например, при удалении папки, содержащей сообщения.

source: Raised when some mailbox-related condition beyond the control of the program causes it to be unable to proceed, such as when failing to acquire a lock that another program already holds a lock, or when a uniquely generated file name already exists.
pt_pt: Levantada quando alguma condição relacionada com a caixa de correio, fora do controle do programa, faz com que não possa prosseguir, como ao falhar na aquisição de um bloqueio que outro programa já possui, ou quando um nome de ficheiro gerado de forma única já existe.
ru: Возникает, когда какое-либо состояние, связанное с почтовым ящиком, не зависящее от программы, приводит к невозможности продолжения работы, например, когда не удается получить блокировку, которую уже удерживает другая программа, или когда уже существует уникально сгенерированное имя файла.

source: Raised when the data in a file cannot be parsed, such as when an :class:`MH` instance attempts to read a corrupted :file:`.mh_sequences` file.
pt_pt: Levantada quando os dados num ficheiro não podem ser analisados, como quando uma instância :class:`MH` tenta ler um ficheiro :file:`.mh_sequences` corrompido.
ru: Возникает, когда данные в файле не могут быть проанализированы, например, когда экземпляр :class:`MH` пытается прочитать поврежденный файл :file:`.mh_sequences`.

source: Examples
pt_pt: Exemplos
ru: Примеры

source: A simple example of printing the subjects of all messages in a mailbox that seem interesting::
pt_pt: Um exemplo simples de impressão dos assuntos de todas as mensagens numa caixa de correio que parecem interessantes::
ru: Простой пример печати тем всех сообщений в почтовом ящике, которые кажутся интересными:

source: To copy all mail from a Babyl mailbox to an MH mailbox, converting all of the format-specific information that can be converted::
pt_pt: Para copiar todo o correio de uma caixa de correio Babyl para uma caixa de correio MH, convertendo toda a informação específica do formato que pode ser convertida::
ru: Чтобы скопировать всю почту из почтового ящика Babyl в почтовый ящик MH, преобразуя всю информацию, специфичную для формата, которую можно преобразовать:

source: This example sorts mail from several mailing lists into different mailboxes, being careful to avoid mail corruption due to concurrent modification by other programs, mail loss due to interruption of the program, or premature termination due to malformed messages in the mailbox::
pt_pt: Este exemplo classifica o correio de várias listas de distribuição em diferentes caixas de correio, tendo o cuidado de evitar a corrupção do correio devido à modificação concorrente por outros programas, perda de correio devido à interrupção do programa, ou terminação prematura devido a mensagens malformadas na caixa de correio::
ru: В этом примере почта из нескольких списков рассылки сортируется по разным почтовым ящикам, стараясь избежать повреждения почты из-за одновременного изменения другими программами, потери почты из-за прерывания работы программы или преждевременного завершения из-за неверных сообщений в почтовом ящике:

source: import mailbox for message in mailbox.mbox('~/mbox'): subject = message['subject'] # Could possibly be None. if subject and 'python' in subject.lower(): print(subject)
pt_pt: import mailbox for message in mailbox.mbox('~/mbox'): subject = message['subject'] # Pode possivelmente ser None. if subject and 'python' in subject.lower(): print(subject)

source: import mailbox import email.errors list_names = ('python-list', 'python-dev', 'python-bugs') boxes = {name: mailbox.mbox('~/email/%s' % name) for name in list_names} inbox = mailbox.Maildir('~/Maildir', factory=None) for key in inbox.iterkeys(): try: message = inbox[key] except email.errors.MessageParseError: continue # The message is malformed. Just leave it. for name in list_names: list_id = message['list-id'] if list_id and name in list_id: # Get mailbox to use box = boxes[name] # Write copy to disk before removing original. # If there's a crash, you might duplicate a message, but # that's better than losing a message completely. box.lock() box.add(message) box.flush() box.unlock() # Remove original message inbox.lock() inbox.discard(key) inbox.flush() inbox.unlock() break # Found destination, so stop looking. for box in boxes.itervalues(): box.close()
pt_pt: import mailbox import email.errors list_names = ('python-list', 'python-dev', 'python-bugs') boxes = {name: mailbox.mbox('~/email/%s' % name) for name in list_names} inbox = mailbox.Maildir('~/Maildir', factory=None) for key in inbox.iterkeys(): try: message = inbox[key] except email.errors.MessageParseError: continue # A mensagem está malformada. Deixe-a. for name in list_names: list_id = message['list-id'] if list_id and name in list_id: # Obter a caixa de correio a usar box = boxes[name] # Escrever cópia no disco antes de remover o original. # Se houver uma falha, pode duplicar uma mensagem, mas # isso é melhor do que perder uma mensagem completamente. box.lock() box.add(message) box.flush() box.unlock() # Remover mensagem original inbox.lock() inbox.discard(key) inbox.flush() inbox.unlock() break # Encontrou o destino, então pare de procurar. for box in boxes.itervalues(): box.close()
