Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/mailbox.po
Languages: pt_pt, ru

source: The file object really is a :term:`binary file`; previously it was incorrectly returned in text mode. Also, the :term:`file-like object` now supports the :term:`context manager` protocol: you can use a :keyword:`with` statement to automatically close it.
pt_pt: O objeto de ficheiro é realmente um :term:`ficheiro binário`; anteriormente era incorretamente retornado em modo de texto. Além disso, o :term:`objeto semelhante a um ficheiro` agora suporta o protocolo :term:`gestor de contexto`: pode usar uma instrução :keyword:`with` para o fechar automaticamente.
ru: Файловый объект на самом деле является :term:`двоичным файлом`; ранее он неправильно возвращался в текстовом режиме. Кроме того, объект :term:`файлоподобный` теперь поддерживает протокол :term:`контекстного менеджера`: вы можете использовать оператор :keyword:`with` для его автоматического закрытия.

source: Unlike other representations of messages, :term:`file-like <file-like object>` representations are not necessarily independent of the :class:`!Mailbox` instance that created them or of the underlying mailbox. More specific documentation is provided by each subclass.
pt_pt: Ao contrário de outras representações de mensagens, as representações :term:`semelhantes a um ficheiro <file-like object>` não são necessariamente independentes da instância :class:`!Mailbox` que as criou ou da caixa de correio subjacente. Documentação mais específica é fornecida por cada subclasse.
ru: В отличие от других представлений сообщений, представления :term:`file-like <файлоподобный объект>` не обязательно независимы от экземпляра :class:`!Mailbox`, который их создал, или от базового почтового ящика. Более конкретная документация предоставляется каждым подклассом.

source: Return ``True`` if *key* corresponds to a message, ``False`` otherwise.
pt_pt: Retorna ``True`` se *key* corresponder a uma mensagem, ``False`` caso contrário.
ru: Возвращайте ``True``, если *key* соответствует сообщению, ``False`` в противном случае.

source: Return a count of messages in the mailbox.
pt_pt: Retorna uma contagem de mensagens na caixa de correio.
ru: Возвращает количество сообщений в почтовом ящике.

source: Delete all messages from the mailbox.
pt_pt: Apaga todas as mensagens da caixa de correio.
ru: Удалить все сообщения из почтового ящика.

source: Return a representation of the message corresponding to *key* and delete the message. If no such message exists, return *default*. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`!Mailbox` instance was initialized.
pt_pt: Retorna uma representação da mensagem correspondente a *key* e apaga a mensagem. Se não existir tal mensagem, retorna *default*. A mensagem é representada como uma instância da subclasse :class:`Message` específica do formato adequado, a menos que uma fábrica de mensagens personalizada tenha sido especificada quando a instância :class:`!Mailbox` foi inicializada.
ru: Верните представление сообщения, соответствующее *key*, и удалите сообщение. Если такого сообщения не существует, верните *default*. Сообщение представляется как экземпляр соответствующего подкласса :class:`Message`, специфичного для формата, если при инициализации экземпляра :class:`!Mailbox` не была указана пользовательская фабрика сообщений.

source: Return an arbitrary (*key*, *message*) pair, where *key* is a key and *message* is a message representation, and delete the corresponding message. If the mailbox is empty, raise a :exc:`KeyError` exception. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`!Mailbox` instance was initialized.
pt_pt: Retorna um par arbitrário (*chave*, *mensagem*), onde *chave* é uma chave e *mensagem* é uma representação de mensagem, e apaga a mensagem correspondente. Se a caixa de correio estiver vazia, levanta uma exceção :exc:`KeyError`. A mensagem é representada como uma instância da subclasse :class:`Message` específica do formato adequado, a menos que uma fábrica de mensagens personalizada tenha sido especificada quando a instância :class:`!Mailbox` foi inicializada.
ru: Верните произвольную пару (*key*, *message*), где *key* — это ключ, а *message* — представление сообщения, и удалите соответствующее сообщение. Если почтовый ящик пуст, вызовите исключение :exc:`KeyError`. Сообщение представляется как экземпляр соответствующего подкласса :class:`Message`, специфичного для формата, если при инициализации экземпляра :class:`!Mailbox` не была указана пользовательская фабрика сообщений.

source: Parameter *arg* should be a *key*-to-*message* mapping or an iterable of (*key*, *message*) pairs. Updates the mailbox so that, for each given *key* and *message*, the message corresponding to *key* is set to *message* as if by using :meth:`__setitem__`. As with :meth:`__setitem__`, each *key* must already correspond to a message in the mailbox or else a :exc:`KeyError` exception will be raised, so in general it is incorrect for *arg* to be a :class:`!Mailbox` instance.
pt_pt: O parâmetro *arg* deve ser um mapeamento de *chave* para *mensagem* ou um iterável de pares (*chave*, *mensagem*). Atualiza a caixa de correio de forma que, para cada *chave* e *mensagem* fornecidas, a mensagem correspondente a *chave* é definida como *mensagem*, como se fosse usado :meth:`__setitem__`. Tal como com :meth:`__setitem__`, cada *chave* deve já corresponder a uma mensagem na caixa de correio, caso contrário será levantada uma exceção :exc:`KeyError`, por isso, em geral, é incorreto que *arg* seja uma instância :class:`!Mailbox`.
ru: Параметр *arg* должен быть сопоставлением *ключ* с *сообщением* или итерацией пар (*ключ*, *сообщение*). Обновляет почтовый ящик так, что для каждого данного *ключа* и *сообщения* сообщение, соответствующее *ключу*, устанавливается в *message*, как если бы с помощью :meth:`__setitem__`. Как и в случае с :meth:`__setitem__`, каждый *key* уже должен соответствовать сообщению в почтовом ящике, иначе будет возбуждено исключение :exc:`KeyError`, поэтому в целом неправильно, чтобы *arg* был : class:`!Mailbox` экземпляр.

source: Unlike with dictionaries, keyword arguments are not supported.
pt_pt: Ao contrário dos dicionários, argumentos de palavra-chave não são suportados.
ru: В отличие от словарей, аргументы ключевых слов не поддерживаются.

source: Write any pending changes to the filesystem. For some :class:`Mailbox` subclasses, changes are always written immediately and :meth:`!flush` does nothing, but you should still make a habit of calling this method.
pt_pt: Escreve quaisquer alterações pendentes no sistema de ficheiros. Para algumas subclasses de :class:`Mailbox`, as alterações são sempre escritas imediatamente e :meth:`!flush` não faz nada, mas deve tornar-se um hábito chamar este método.
ru: Запишите все ожидающие изменения в файловую систему. Для некоторых подклассов :class:`Mailbox` изменения всегда записываются немедленно, а :meth:`!flush` ничего не делает, но вам все равно следует выработать привычку вызывать этот метод.

source: Acquire an exclusive advisory lock on the mailbox so that other processes know not to modify it. An :exc:`ExternalClashError` is raised if the lock is not available. The particular locking mechanisms used depend upon the mailbox format. You should *always* lock the mailbox before making any modifications to its contents.
pt_pt: Adquire um bloqueio consultivo exclusivo na caixa de correio para que outros processos saibam que não a devem modificar. Uma exceção :exc:`ExternalClashError` é levantada se o bloqueio não estiver disponível. Os mecanismos de bloqueio particulares usados dependem do formato da caixa de correio. Deve *sempre* bloquear a caixa de correio antes de fazer quaisquer modificações no seu conteúdo.
ru: Получите эксклюзивную рекомендательную блокировку почтового ящика, чтобы другие процессы не могли его изменить. Если блокировка недоступна, выдается сообщение :exc:`ExternalClashError`. Конкретные используемые механизмы блокировки зависят от формата почтового ящика. Вам следует *всегда* блокировать почтовый ящик перед внесением каких-либо изменений в его содержимое.

source: Release the lock on the mailbox, if any.
pt_pt: Liberta o bloqueio na caixa de correio, se existir algum.
ru: Снимите блокировку почтового ящика, если таковая имеется.

source: Flush the mailbox, unlock it if necessary, and close any open files. For some :class:`!Mailbox` subclasses, this method does nothing.
pt_pt: Escreve as alterações na caixa de correio, desbloqueia-a se necessário e fecha quaisquer ficheiros abertos. Para algumas subclasses de :class:`!Mailbox`, este método não faz nada.
ru: Очистите почтовый ящик, при необходимости разблокируйте его и закройте все открытые файлы. Для некоторых подклассов :class:`!Mailbox` этот метод ничего не делает.

source: :class:`!Maildir` objects
pt_pt: Objetos :class:`!Maildir`
ru: :class:`!Maildir` объекты

source: A subclass of :class:`Mailbox` for mailboxes in Maildir format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MaildirMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
pt_pt: Uma subclasse de :class:`Mailbox` para caixas de correio no formato Maildir. O parâmetro *factory* é um objeto chamável que aceita uma representação de mensagem semelhante a um ficheiro (que se comporta como se estivesse aberta em modo binário) e retorna uma representação personalizada. Se *factory* for ``None``, :class:`MaildirMessage` é usado como a representação de mensagem predefinida. Se *create* for ``True``, a caixa de correio é criada se não existir.
ru: Подкласс :class:`Mailbox` для почтовых ящиков в формате Maildir. Параметр *factory* — это вызываемый объект, который принимает файловое представление сообщения (которое ведет себя так, как если бы оно было открыто в двоичном режиме) и возвращает пользовательское представление. Если *factory* имеет значение None, :class:`MaildirMessage` используется как представление сообщения по умолчанию. Если *create* имеет значение True, почтовый ящик создается, если он не существует.

source: If *create* is ``True`` and the *dirname* path exists, it will be treated as an existing maildir without attempting to verify its directory layout.
pt_pt: Se *create* for ``True`` e o caminho *dirname* existir, será tratado como uma maildir existente sem tentar verificar o seu layout de diretório.
ru: Если *create* имеет значение True и путь *dirname* существует, он будет рассматриваться как существующий почтовый каталог без попытки проверить структуру его каталога.

source: It is for historical reasons that *dirname* is named as such rather than *path*.
pt_pt: Por razões históricas, *dirname* é assim chamado em vez de *path*.
ru: По историческим причинам *dirname* назван так, а не *path*.

source: Maildir is a directory-based mailbox format invented for the qmail mail transfer agent and now widely supported by other programs. Messages in a Maildir mailbox are stored in separate files within a common directory structure. This design allows Maildir mailboxes to be accessed and modified by multiple unrelated programs without data corruption, so file locking is unnecessary.
pt_pt: Maildir é um formato de caixa de correio baseado em diretórios inventado para o agente de transferência de correio qmail e agora amplamente suportado por outros programas. As mensagens numa caixa de correio Maildir são armazenadas em ficheiros separados dentro de uma estrutura de diretórios comum. Este design permite que as caixas de correio Maildir sejam acedidas e modificadas por vários programas não relacionados sem corrupção de dados, por isso o bloqueio de ficheiros é desnecessário.
ru: Maildir — это формат почтовых ящиков на основе каталогов, изобретенный для агента передачи почты qmail и теперь широко поддерживаемый другими программами. Сообщения в почтовом ящике Maildir хранятся в отдельных файлах в общей структуре каталогов. Такая конструкция позволяет нескольким несвязанным программам получать доступ к почтовым ящикам Maildir и изменять их без повреждения данных, поэтому блокировка файлов не требуется.

source: Maildir mailboxes contain three subdirectories, namely: :file:`tmp`, :file:`new`, and :file:`cur`. Messages are created momentarily in the :file:`tmp` subdirectory and then moved to the :file:`new` subdirectory to finalize delivery. A mail user agent may subsequently move the message to the :file:`cur` subdirectory and store information about the state of the message in a special "info" section appended to its file name.
pt_pt: As caixas de correio Maildir contêm três subdiretórios, nomeadamente: :file:`tmp`, :file:`new` e :file:`cur`. As mensagens são criadas momentaneamente no subdiretório :file:`tmp` e depois movidas para o subdiretório :file:`new` para finalizar a entrega. Um agente de utilizador de correio pode posteriormente mover a mensagem para o subdiretório :file:`cur` e armazenar informações sobre o estado da mensagem numa secção especial "info" anexada ao seu nome de ficheiro.
ru: Почтовые ящики Maildir содержат три подкаталога, а именно: :file:`tmp`, :file:`new` и :file:`cur`. Сообщения на мгновение создаются в подкаталоге :file:`tmp`, а затем перемещаются в подкаталог :file:`new` для завершения доставки. Почтовый агент пользователя может впоследствии переместить сообщение в подкаталог :file:`cur` и сохранить информацию о состоянии сообщения в специальном разделе «info», добавленном к его имени файла.

source: Folders of the style introduced by the Courier mail transfer agent are also supported. Any subdirectory of the main mailbox is considered a folder if ``'.'`` is the first character in its name. Folder names are represented by :class:`!Maildir` without the leading ``'.'``. Each folder is itself a Maildir mailbox but should not contain other folders. Instead, a logical nesting is indicated using ``'.'`` to delimit levels, e.g., "Archived.2005.07".
pt_pt: Pastas do estilo introduzido pelo agente de transferência de correio Courier também são suportadas. Qualquer subdiretório da caixa de correio principal é considerado uma pasta se ``'.'`` for o primeiro carácter no seu nome. Os nomes das pastas são representados por :class:`!Maildir` sem o ``'.'`` inicial. Cada pasta é ela própria uma caixa de correio Maildir, mas não deve conter outras pastas. Em vez disso, um aninhamento lógico é indicado usando ``'.'`` para delimitar níveis, por exemplo, "Arquivado.2005.07".
ru: Также поддерживаются папки в стиле, представленном агентом передачи почты Courier. Любой подкаталог основного почтового ящика считается папкой, если ``'.'`` является первым символом в его имени. Имена папок представлены :class:`!Maildir` без начального ``'.'``. Каждая папка сама по себе является почтовым ящиком Maildir, но не должна содержать других папок. Вместо этого логическая вложенность обозначается с помощью ``'.'`` для разделения уровней, например, "Архив.2005.07".

source: The Maildir specification requires the use of a colon (``':'``) in certain message file names. However, some operating systems do not permit this character in file names, If you wish to use a Maildir-like format on such an operating system, you should specify another character to use instead. The exclamation point (``'!'``) is a popular choice. For example::
pt_pt: A especificação Maildir requer o uso de dois pontos (``':'``) em certos nomes de ficheiros de mensagem. No entanto, alguns sistemas operativos não permitem este caractere em nomes de ficheiros. Se desejar usar um formato semelhante ao Maildir num sistema operativo desse tipo, deve especificar outro caractere para usar em vez disso. O ponto de exclamação (``'!'``) é uma escolha popular. Por exemplo::
ru: Спецификация Maildir требует использования двоеточия (``':'``) в некоторых именах файлов сообщений. Однако некоторые операционные системы не допускают использования этого символа в именах файлов. Если вы хотите использовать в такой операционной системе формат, подобный Maildir, вам следует указать вместо него другой символ. Восклицательный знак (``'!'``) является популярным выбором. Например::

source: The :attr:`!colon` attribute may also be set on a per-instance basis.
pt_pt: O atributo :attr:`!colon` também pode ser definido por instância.
ru: Атрибут :attr:`!colon` также может быть установлен для каждого экземпляра.

source: :class:`Maildir` now ignores files with a leading dot.
ru: :class:`Maildir` теперь игнорирует файлы с точкой в ​​начале.

source: :class:`!Maildir` instances have all of the methods of :class:`Mailbox` in addition to the following:
pt_pt: As instâncias :class:`!Maildir` têm todos os métodos de :class:`Mailbox`, além dos seguintes:
ru: Экземпляры :class:`!Maildir` имеют все методы :class:`Mailbox` в дополнение к следующим:

source: Return a list of the names of all folders.
pt_pt: Retorna uma lista com os nomes de todas as pastas.
ru: Вернуть список названий всех папок.

source: Return a :class:`!Maildir` instance representing the folder whose name is *folder*. A :exc:`NoSuchMailboxError` exception is raised if the folder does not exist.
pt_pt: Retorna uma instância :class:`!Maildir` que representa a pasta cujo nome é *folder*. Uma exceção :exc:`NoSuchMailboxError` é levantada se a pasta não existir.
ru: Возвращает экземпляр :class:`!Maildir`, представляющий папку с именем *folder*. Исключение :exc:`NoSuchMailboxError` возникает, если папка не существует.

source: Create a folder whose name is *folder* and return a :class:`!Maildir` instance representing it.
pt_pt: Cria uma pasta cujo nome é *folder* e retorna uma instância :class:`!Maildir` que a representa.
ru: Создайте папку с именем *folder* и верните представляющий ее экземпляр :class:`!Maildir`.

source: Delete the folder whose name is *folder*. If the folder contains any messages, a :exc:`NotEmptyError` exception will be raised and the folder will not be deleted.
pt_pt: Apaga a pasta cujo nome é *folder*. Se a pasta contiver alguma mensagem, uma exceção :exc:`NotEmptyError` será levantada e a pasta não será apagada.
ru: Удалите папку с именем *folder*. Если папка содержит какие-либо сообщения, будет выдано исключение :exc:`NotEmptyError` и папка не будет удалена.

source: Delete temporary files from the mailbox that have not been accessed in the last 36 hours. The Maildir specification says that mail-reading programs should do this occasionally.
pt_pt: Apaga ficheiros temporários da caixa de correio que não tenham sido acedidos nas últimas 36 horas. A especificação Maildir diz que os programas de leitura de correio devem fazer isto ocasionalmente.
ru: Удалите из почтового ящика временные файлы, к которым не было доступа в течение последних 36 часов. В спецификации Maildir говорится, что программы чтения почты должны делать это время от времени.

source: Return as a string the flags that are set on the message corresponding to *key*. This is the same as ``get_message(key).get_flags()`` but much faster, because it does not open the message file. Use this method when iterating over the keys to determine which messages are interesting to get.
ru: Возвращает в виде строки флаги, установленные в сообщении, соответствующем *key*. Это то же самое, что и get_message(key).get_flags(), но гораздо быстрее, поскольку файл сообщения не открывается. Используйте этот метод при переборе ключей, чтобы определить, какие сообщения интересно получить.

source: If you do have a :class:`MaildirMessage` object, use its :meth:`~MaildirMessage.get_flags` method instead, because changes made by the message's :meth:`~MaildirMessage.set_flags`, :meth:`~MaildirMessage.add_flag` and :meth:`~MaildirMessage.remove_flag` methods are not reflected here until the mailbox's :meth:`__setitem__` method is called.
ru: Если у вас есть объект :class:`MaildirMessage`, используйте вместо него его метод :meth:`~MaildirMessage.get_flags`, поскольку изменения, внесенные :meth:`~MaildirMessage.set_flags`, :meth:`~MaildirMessage сообщения. Методы add_flag` и :meth:`~MaildirMessage.remove_flag` не отображаются здесь до тех пор, пока не будет вызван метод почтового ящика :meth:`__setitem__`.

source: On the message corresponding to *key*, set the flags specified by *flags* and unset all others. Calling ``some_mailbox.set_flags(key, flags)`` is similar to ::
ru: В сообщении, соответствующем *key*, установите флаги, указанные *flags*, и отключите все остальные. Вызов ``some_mailbox.set_flags(key, flags)`` аналогичен::

source: but faster, because it does not open the message file.
ru: но быстрее, потому что файл сообщения не открывается.

source: If you do have a :class:`MaildirMessage` object, use its :meth:`~MaildirMessage.set_flags` method instead, because changes made with this mailbox method will not be visible to the message object's method, :meth:`~MaildirMessage.get_flags`.
ru: Если у вас есть объект :class:`MaildirMessage`, используйте вместо него его метод :meth:`~MaildirMessage.set_flags`, поскольку изменения, сделанные с помощью этого метода почтового ящика, не будут видны методу объекта сообщения, :meth:`~MaildirMessage .get_flags`.

source: On the message corresponding to *key*, set the flags specified by *flag* without changing other flags. To add more than one flag at a time, *flag* may be a string of more than one character.
ru: В сообщении, соответствующем *key*, установите флаги, указанные *flag*, не меняя другие флаги. Чтобы добавить более одного флага одновременно, *flag* может быть строкой, состоящей из более чем одного символа.

source: Considerations for using this method versus the message object's :meth:`~MaildirMessage.add_flag` method are similar to those for :meth:`set_flags`; see the discussion there.
ru: Рекомендации по использованию этого метода по сравнению с методом :meth:`~MaildirMessage.add_flag` объекта сообщения аналогичны таковым для :meth:`set_flags`; посмотри обсуждение там.

source: On the message corresponding to *key*, unset the flags specified by *flag* without changing other flags. To remove more than one flag at a time, *flag* may be a string of more than one character.
ru: В сообщении, соответствующем *key*, снимите флаги, указанные *flag*, не меняя другие флаги. Чтобы удалить более одного флага одновременно, *flag* может быть строкой, состоящей из более чем одного символа.

source: Considerations for using this method versus the message object's :meth:`~MaildirMessage.remove_flag` method are similar to those for :meth:`set_flags`; see the discussion there.
ru: Рекомендации по использованию этого метода по сравнению с методом :meth:`~MaildirMessage.remove_flag` объекта сообщения аналогичны тем, которые используются для :meth:`set_flags`; посмотри обсуждение там.

source: Return a string containing the info for the message corresponding to *key*. This is the same as ``get_message(key).get_info()`` but much faster, because it does not open the message file. Use this method when iterating over the keys to determine which messages are interesting to get.
ru: Возвращает строку, содержащую информацию о сообщении, соответствующем *key*. Это то же самое, что и get_message(key).get_info(), но гораздо быстрее, поскольку файл сообщения не открывается. Используйте этот метод при переборе ключей, чтобы определить, какие сообщения интересно получить.
