Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/mailbox.po
Languages: pt_pt, ru

source: Return a string specifying the flags that are currently set. If the message complies with the standard Maildir format, the result is the concatenation in alphabetical order of zero or one occurrence of each of ``'D'``, ``'F'``, ``'P'``, ``'R'``, ``'S'``, and ``'T'``. The empty string is returned if no flags are set or if "info" contains experimental semantics.
pt_pt: Retorna uma string que especifica as flags atualmente definidas. Se a mensagem estiver em conformidade com o formato padrão Maildir, o resultado é a concatenação em ordem alfabética de zero ou uma ocorrência de cada um dos seguintes: ``'D'``, ``'F'``, ``'P'``, ``'R'``, ``'S'`` e ``'T'``. A string vazia é retornada se nenhuma flag estiver definida ou se "info" contiver semântica experimental.
ru: Возвращает строку, определяющую флаги, которые установлены в данный момент. Если сообщение соответствует стандартному формату Maildir, результатом является объединение в алфавитном порядке нуля или одного вхождения каждого из ``'D'``, ``'F'``, ``'P'``, ``'R'``, ``'S'`` и ``'T'``. Пустая строка возвращается, если флаги не установлены или если «информация» содержит экспериментальную семантику.

source: Set the flags specified by *flags* and unset all others.
pt_pt: Define as flags especificadas por *flags* e desmarca todas as outras.
ru: Установите флаги, указанные *flags*, и отключите все остальные.

source: Set the flag(s) specified by *flag* without changing other flags. To add more than one flag at a time, *flag* may be a string of more than one character. The current "info" is overwritten whether or not it contains experimental information rather than flags.
pt_pt: Define a(s) flag(s) especificada(s) por *flag* sem alterar outras flags. Para adicionar mais do que uma flag de cada vez, *flag* pode ser uma string com mais do que um carácter. A "info" atual é sobrescrita, independentemente de conter informação experimental em vez de flags.
ru: Установите флаг(и), указанные в *flag*, не меняя другие флаги. Чтобы добавить более одного флага одновременно, *flag* может быть строкой, состоящей из более чем одного символа. Текущая «информация» перезаписывается независимо от того, содержит ли она экспериментальную информацию, а не флаги.

source: Unset the flag(s) specified by *flag* without changing other flags. To remove more than one flag at a time, *flag* maybe a string of more than one character. If "info" contains experimental information rather than flags, the current "info" is not modified.
pt_pt: Desmarca a(s) flag(s) especificada(s) por *flag* sem alterar outras flags. Para remover mais do que uma flag de cada vez, *flag* pode ser uma string com mais do que um carácter. Se "info" contiver informação experimental em vez de flags, a "info" atual não é modificada.
ru: Снимите флаг(и), указанные в *flag*, не меняя другие флаги. Чтобы удалить более одного флага одновременно, *flag* может быть строкой, состоящей из более чем одного символа. Если «информация» содержит экспериментальную информацию, а не флаги, текущая «информация» не изменяется.

source: Return the delivery date of the message as a floating-point number representing seconds since the epoch.
pt_pt: Retorna a data de entrega da mensagem como um número de ponto flutuante que representa segundos desde a época.
ru: Возвращает дату доставки сообщения в виде числа с плавающей запятой, представляющего секунды с начала эпохи.

source: Set the delivery date of the message to *date*, a floating-point number representing seconds since the epoch.
pt_pt: Define a data de entrega da mensagem para *date*, um número de ponto flutuante que representa segundos desde a época.
ru: Установите дату доставки сообщения в *date* — число с плавающей запятой, представляющее секунды с начала эпохи.

source: Return a string containing the "info" for a message. This is useful for accessing and modifying "info" that is experimental (i.e., not a list of flags).
pt_pt: Retorna uma string contendo a "info" de uma mensagem. Isto é útil para aceder e modificar "info" que é experimental (ou seja, não uma lista de flags).
ru: Возвращает строку, содержащую информацию о сообщении. Это полезно для доступа и изменения экспериментальной «информации» (т. е. не списка флагов).

source: Set "info" to *info*, which should be a string.
pt_pt: Define "info" para *info*, que deve ser uma string.
ru: Установите для параметра «info» значение *info*, которое должно быть строкой.

source: When a :class:`!MaildirMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
pt_pt: Quando uma instância :class:`!MaildirMessage` é criada com base numa instância :class:`mboxMessage` ou :class:`MMDFMessage`, os cabeçalhos :mailheader:`Status` e :mailheader:`X-Status` são omitidos e as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MaildirMessage` создается на основе экземпляра :class:`mboxMessage` или :class:`MMDFMessage`, заголовки :mailheader:`Status` и :mailheader:`X-Status` опускаются и происходят следующие преобразования:

source: Resulting state
pt_pt: Estado resultante
ru: Результирующий статус

source: :class:`mboxMessage` or :class:`MMDFMessage` state
pt_pt: Estado :class:`mboxMessage` ou :class:`MMDFMessage`
ru: Состояние :class:`mboxMessage` или :class:`MMDFMessage`

source: "cur" subdirectory
pt_pt: Subdiretório "cur"
ru: Подкаталог "cur"

source: O flag
pt_pt: Flag O
ru: Флаг O

source: F flag
pt_pt: Flag F
ru: Флаг F

source: R flag
pt_pt: Flag R
ru: R флаг

source: A flag
pt_pt: Flag A
ru: Флаг A

source: S flag
pt_pt: Flag S
ru: Флаг S

source: T flag
pt_pt: Flag T
ru: T флаг

source: D flag
pt_pt: Flag D
ru: D флаг

source: When a :class:`!MaildirMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!MaildirMessage` é criada com base numa instância :class:`MHMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MaildirMessage` создается на основе экземпляра :class:`MHMessage`, происходят следующие преобразования:

source: :class:`MHMessage` state
pt_pt: Estado :class:`MHMessage`
ru: Статус :class:`MHMessage`

source: "unseen" sequence
pt_pt: Sequência "unseen"
ru: «невидимая» последовательность

source: "cur" subdirectory and S flag
pt_pt: Subdiretório "cur" e flag S
ru: Подкаталог «cur» и флаг S

source: no "unseen" sequence
pt_pt: Sem sequência "unseen"
ru: никакой "невидимой" последовательности

source: "flagged" sequence
pt_pt: Sequência "flagged"
ru: "отмеченная" последовательность

source: "replied" sequence
pt_pt: Sequência "replied"
ru: последовательность "ответов"

source: When a :class:`!MaildirMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!MaildirMessage` é criada com base numa instância :class:`BabylMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MaildirMessage` создается на основе экземпляра :class:`BabylMessage`, происходят следующие преобразования:

source: :class:`BabylMessage` state
pt_pt: Estado :class:`BabylMessage`
ru: Статус :class:`BabylMessage`

source: "unseen" label
pt_pt: Etiqueta "unseen"
ru: «невидимая» этикетка

source: no "unseen" label
pt_pt: Sem etiqueta "unseen"
ru: нет "невидимой" этикетки

source: P flag
pt_pt: Flag P
ru: Флаг P

source: "forwarded" or "resent" label
pt_pt: Etiqueta "forwarded" ou "resent"
ru: Метка «переадресовано» или «повторно отправлено»

source: "answered" label
pt_pt: Etiqueta "answered"
ru: метка "ответил"

source: "deleted" label
pt_pt: Etiqueta "deleted"
ru: "удаленный" ярлык

source: :class:`!mboxMessage` objects
pt_pt: Objetos :class:`!mboxMessage`
ru: :class:`!mboxMessage` объекты

source: A message with mbox-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
pt_pt: Uma mensagem com comportamentos específicos do mbox. O parâmetro *message* tem o mesmo significado que no construtor :class:`Message`.
ru: Сообщение с поведением, специфичным для mbox. Параметр *message* имеет то же значение, что и конструктор :class:`Message`.

source: Messages in an mbox mailbox are stored together in a single file. The sender's envelope address and the time of delivery are typically stored in a line beginning with "From " that is used to indicate the start of a message, though there is considerable variation in the exact format of this data among mbox implementations. Flags that indicate the state of the message, such as whether it has been read or marked as important, are typically stored in :mailheader:`Status` and :mailheader:`X-Status` headers.
pt_pt: As mensagens numa caixa de correio mbox são armazenadas juntas num único ficheiro. O endereço de envelope do remetente e a hora de entrega são tipicamente armazenados numa linha que começa com "From " que é usada para indicar o início de uma mensagem, embora haja uma considerável variação no formato exato destes dados entre implementações mbox. Flags que indicam o estado da mensagem, como se foi lida ou marcada como importante, são tipicamente armazenadas nos cabeçalhos :mailheader:`Status` e :mailheader:`X-Status`.
ru: Сообщения в почтовом ящике mbox хранятся вместе в одном файле. Адрес конверта отправителя и время доставки обычно хранятся в строке, начинающейся с «От», которая используется для обозначения начала сообщения, хотя в разных реализациях mbox существуют значительные различия в точном формате этих данных. Флаги, указывающие состояние сообщения, например, было ли оно прочитано или отмечено как важное, обычно хранятся в заголовках :mailheader:`Status` и :mailheader:`X-Status`.

source: Conventional flags for mbox messages are as follows:
pt_pt: As flags convencionais para mensagens mbox são as seguintes:
ru: Обычные флаги для сообщений mbox следующие:

source: Old
pt_pt: Antigo
ru: Старый

source: Previously detected by MUA
pt_pt: Previamente detetado pelo MUA
ru: Ранее обнаружено MUA

source: Deleted
pt_pt: Eliminado
ru: Удалено

source: Answered
pt_pt: Respondido
ru: Ответил

source: The "R" and "O" flags are stored in the :mailheader:`Status` header, and the "D", "F", and "A" flags are stored in the :mailheader:`X-Status` header. The flags and headers typically appear in the order mentioned.
pt_pt: As flags "R" e "O" são armazenadas no cabeçalho :mailheader:`Status`, e as flags "D", "F" e "A" são armazenadas no cabeçalho :mailheader:`X-Status`. As flags e cabeçalhos aparecem tipicamente na ordem mencionada.
ru: Флаги «R» и «O» хранятся в заголовке :mailheader:`Status`, а флаги «D», «F» и «A» хранятся в заголовке :mailheader:`X-Status`. Флаги и заголовки обычно появляются в указанном порядке.

source: :class:`!mboxMessage` instances offer the following methods:
pt_pt: As instâncias :class:`!mboxMessage` oferecem os seguintes métodos:
ru: Экземпляры :class:`!mboxMessage` предлагают следующие методы:

source: Return a string representing the "From " line that marks the start of the message in an mbox mailbox. The leading "From " and the trailing newline are excluded.
pt_pt: Retorna uma string que representa a linha "From " que marca o início da mensagem numa caixa de correio mbox. O "From " inicial e a nova linha final são excluídos.
ru: Возвращает строку, представляющую строку «От», которая отмечает начало сообщения в почтовом ящике mbox. Ведущий «От» и завершающий символ новой строки исключаются.

source: Set the "From " line to *from_*, which should be specified without a leading "From " or trailing newline. For convenience, *time_* may be specified and will be formatted appropriately and appended to *from_*. If *time_* is specified, it should be a :class:`time.struct_time` instance, a tuple suitable for passing to :func:`time.strftime`, or ``True`` (to use :func:`time.gmtime`).
pt_pt: Define a linha "From " para *from_*, que deve ser especificado sem um "From " inicial ou nova linha final. Por conveniência, *time_* pode ser especificado e será formatado adequadamente e anexado a *from_*. Se *time_* for especificado, deve ser uma instância :class:`time.struct_time`, um tuplo adequado para passar para :func:`time.strftime`, ou ``True`` (para usar :func:`time.gmtime`).
ru: Установите для строки «От» значение *from_*, которое должно быть указано без начального «От» или завершающего символа новой строки. Для удобства можно указать *time_*, которое будет отформатировано соответствующим образом и добавлено к *from_*. Если указано *time_*, это должен быть экземпляр :class:`time.struct_time`, кортеж, подходящий для передачи в :func:`time.strftime`, или ``True`` (для использования :func:`time .gmtime`).

source: Return a string specifying the flags that are currently set. If the message complies with the conventional format, the result is the concatenation in the following order of zero or one occurrence of each of ``'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.
pt_pt: Retorna uma string que especifica as flags atualmente definidas. Se a mensagem estiver em conformidade com o formato convencional, o resultado é a concatenação na seguinte ordem de zero ou uma ocorrência de cada um dos seguintes: ``'R'``, ``'O'``, ``'D'``, ``'F'`` e ``'A'``.
ru: Возвращает строку, определяющую флаги, которые установлены в данный момент. Если сообщение соответствует обычному формату, результатом является объединение в следующем порядке нуля или одного вхождения каждого из ``'R'``, ``'O'``, ``'D'``, ``'F'`` и ``'A'``.

source: Set the flags specified by *flags* and unset all others. Parameter *flags* should be the concatenation in any order of zero or more occurrences of each of ``'R'``, ``'O'``, ``'D'``, ``'F'``, and ``'A'``.
pt_pt: Define as flags especificadas por *flags* e desmarca todas as outras. O parâmetro *flags* deve ser a concatenação em qualquer ordem de zero ou mais ocorrências de cada um dos seguintes: ``'R'``, ``'O'``, ``'D'``, ``'F'`` e ``'A'``.
ru: Установите флаги, указанные *flags*, и отключите все остальные. Параметр *flags* должен быть конкатенацией в любом порядке нуля или более вхождений каждого из ``'R'``, ``'O'``, ``'D'``, ``'F'`` и ``'А'``.

source: Set the flag(s) specified by *flag* without changing other flags. To add more than one flag at a time, *flag* may be a string of more than one character.
pt_pt: Define a(s) flag(s) especificada(s) por *flag* sem alterar outras flags. Para adicionar mais do que uma flag de cada vez, *flag* pode ser uma string com mais do que um carácter.
ru: Установите флаг(и), указанные в *flag*, не меняя другие флаги. Чтобы добавить более одного флага одновременно, *flag* может быть строкой, состоящей из более чем одного символа.

source: Unset the flag(s) specified by *flag* without changing other flags. To remove more than one flag at a time, *flag* maybe a string of more than one character.
pt_pt: Desmarca a(s) flag(s) especificada(s) por *flag* sem alterar outras flags. Para remover mais do que uma flag de cada vez, *flag* pode ser uma string com mais do que um carácter.
ru: Снимите флаг(и), указанные в *flag*, не меняя другие флаги. Чтобы удалить более одного флага одновременно, *flag* может быть строкой, состоящей из более чем одного символа.

source: When an :class:`!mboxMessage` instance is created based upon a :class:`MaildirMessage` instance, a "From " line is generated based upon the :class:`MaildirMessage` instance's delivery date, and the following conversions take place:
pt_pt: Quando uma instância :class:`!mboxMessage` é criada com base numa instância :class:`MaildirMessage`, uma linha "From " é gerada com base na data de entrega da instância :class:`MaildirMessage`, e as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!mboxMessage` создается на основе экземпляра :class:`MaildirMessage`, строка «От» генерируется на основе даты доставки экземпляра :class:`MaildirMessage`, и происходят следующие преобразования:

source: :class:`MaildirMessage` state
pt_pt: Estado :class:`MaildirMessage`
ru: Статус :class:`MaildirMessage`

source: When an :class:`!mboxMessage` instance is created based upon an :class:`MHMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!mboxMessage` é criada com base numa instância :class:`MHMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!mboxMessage` создается на основе экземпляра :class:`MHMessage`, происходят следующие преобразования:

source: R flag and O flag
pt_pt: Flag R e flag O
ru: Флаг R и флаг O

source: When an :class:`!mboxMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!mboxMessage` é criada com base numa instância :class:`BabylMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!mboxMessage` создается на основе экземпляра :class:`BabylMessage`, происходят следующие преобразования:

source: When a :class:`!mboxMessage` instance is created based upon an :class:`MMDFMessage` instance, the "From " line is copied and all flags directly correspond:
pt_pt: Quando uma instância :class:`!mboxMessage` é criada com base numa instância :class:`MMDFMessage`, a linha "From " é copiada e todas as flags correspondem diretamente:
ru: Когда экземпляр :class:`!mboxMessage` создается на основе экземпляра :class:`MMDFMessage`, строка «От» копируется, и все флаги напрямую соответствуют:

source: :class:`MMDFMessage` state
pt_pt: Estado :class:`MMDFMessage`
ru: Статус :class:`MMDFMessage`

source: :class:`!MHMessage` objects
pt_pt: Objetos :class:`!MHMessage`
ru: :class:`!MHMessage` объекты

source: A message with MH-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
pt_pt: Uma mensagem com comportamentos específicos do MH. O parâmetro *message* tem o mesmo significado que no construtor :class:`Message`.
ru: Сообщение с поведением, специфичным для MH. Параметр *message* имеет то же значение, что и конструктор :class:`Message`.

source: MH messages do not support marks or flags in the traditional sense, but they do support sequences, which are logical groupings of arbitrary messages. Some mail reading programs (although not the standard :program:`mh` and :program:`nmh`) use sequences in much the same way flags are used with other formats, as follows:
pt_pt: As mensagens MH não suportam marcas ou flags no sentido tradicional, mas suportam sequências, que são agrupamentos lógicos de mensagens arbitrárias. Alguns programas de leitura de correio (embora não o :program:`mh` e :program:`nmh` padrão) usam sequências de forma muito semelhante às flags usadas com outros formatos, da seguinte forma:
ru: Сообщения MH не поддерживают метки или флаги в традиционном смысле, но поддерживают последовательности, которые представляют собой логические группы произвольных сообщений. Некоторые программы чтения почты (кроме стандартных :program:`mh` и :program:`nmh`) используют последовательности почти так же, как флаги используются в других форматах, а именно:

source: Sequence
pt_pt: Sequência
ru: Последовательность

source: unseen
pt_pt: não visto
ru: невидимый

source: Not read, but previously detected by MUA
pt_pt: Não lido, mas previamente detetado pelo MUA
ru: Не прочитано, но ранее обнаружено MUA

source: replied
pt_pt: respondido
ru: ответил

source: flagged
pt_pt: marcado
ru: помеченный

source: :class:`!MHMessage` instances offer the following methods:
pt_pt: As instâncias :class:`!MHMessage` oferecem os seguintes métodos:
ru: Экземпляры :class:`!MHMessage` предлагают следующие методы:

source: Return a list of the names of sequences that include this message.
pt_pt: Retorna uma lista com os nomes das sequências que incluem esta mensagem.
ru: Верните список имен последовательностей, которые включают это сообщение.

source: Set the list of sequences that include this message.
pt_pt: Define a lista de sequências que incluem esta mensagem.
ru: Установите список последовательностей, включающих это сообщение.

source: Add *sequence* to the list of sequences that include this message.
pt_pt: Adiciona *sequence* à lista de sequências que incluem esta mensagem.
ru: Добавьте *последовательность* в список последовательностей, содержащих это сообщение.

source: Remove *sequence* from the list of sequences that include this message.
pt_pt: Remove *sequence* da lista de sequências que incluem esta mensagem.
ru: Удалите *sequence* из списка последовательностей, содержащих это сообщение.

source: When an :class:`!MHMessage` instance is created based upon a :class:`MaildirMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!MHMessage` é criada com base numa instância :class:`MaildirMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MHMessage` создается на основе экземпляра :class:`MaildirMessage`, происходят следующие преобразования:

source: no S flag
pt_pt: Sem flag S
ru: нет флага S

source: When an :class:`!MHMessage` instance is created based upon an :class:`mboxMessage` or :class:`MMDFMessage` instance, the :mailheader:`Status` and :mailheader:`X-Status` headers are omitted and the following conversions take place:
pt_pt: Quando uma instância :class:`!MHMessage` é criada com base numa instância :class:`mboxMessage` ou :class:`MMDFMessage`, os cabeçalhos :mailheader:`Status` e :mailheader:`X-Status` são omitidos e as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MHMessage` создается на основе экземпляра :class:`mboxMessage` или :class:`MMDFMessage`, заголовки :mailheader:`Status` и :mailheader:`X-Status` опускаются и происходят следующие преобразования:

source: no R flag
pt_pt: Sem flag R
ru: нет флага R

source: When an :class:`!MHMessage` instance is created based upon a :class:`BabylMessage` instance, the following conversions take place:
pt_pt: Quando uma instância :class:`!MHMessage` é criada com base numa instância :class:`BabylMessage`, as seguintes conversões ocorrem:
ru: Когда экземпляр :class:`!MHMessage` создается на основе экземпляра :class:`BabylMessage`, происходят следующие преобразования:

source: :class:`!BabylMessage` objects
pt_pt: Objetos :class:`!BabylMessage`
ru: :class:`!BabylMessage` объекты

source: A message with Babyl-specific behaviors. Parameter *message* has the same meaning as with the :class:`Message` constructor.
pt_pt: Uma mensagem com comportamentos específicos do Babyl. O parâmetro *message* tem o mesmo significado que no construtor :class:`Message`.
ru: Сообщение со специфичным для Babyl поведением. Параметр *message* имеет то же значение, что и конструктор :class:`Message`.

source: Certain message labels, called :dfn:`attributes`, are defined by convention to have special meanings. The attributes are as follows:
pt_pt: Certas etiquetas de mensagem, chamadas :dfn:`atributos`, são definidas por convenção para terem significados especiais. Os atributos são os seguintes:
ru: Определенные метки сообщений, называемые :dfn:`attributes`, по соглашению имеют особое значение. Атрибуты следующие:

source: Label
pt_pt: Etiqueta
ru: Этикетка

source: deleted
pt_pt: eliminado
ru: удалено

source: filed
pt_pt: arquivado
ru: поданный

source: Copied to another file or mailbox
pt_pt: Copiado para outro ficheiro ou caixa de correio
ru: Скопировано в другой файл или почтовый ящик.

source: answered
pt_pt: respondido
ru: ответил

source: forwarded
pt_pt: reencaminhado
ru: перенаправлено

source: Forwarded
pt_pt: Reencaminhado
ru: Переадресовано

source: edited
pt_pt: editado
ru: отредактировано

source: Modified by the user
pt_pt: Modificado pelo utilizador
ru: Изменено пользователем

source: resent
pt_pt: reenviado
ru: отправить

source: Resent
pt_pt: Reenviado
ru: Отправить повторно
