Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/mailbox.po
Languages: pt_pt, ru

source: If you do have a :class:`MaildirMessage` object, use its :meth:`~MaildirMessage.get_info` method instead, because changes made by the message's :meth:`~MaildirMessage.set_info` method are not reflected here until the mailbox's :meth:`__setitem__` method is called.
ru: Если у вас есть объект :class:`MaildirMessage`, используйте вместо него его метод :meth:`~MaildirMessage.get_info`, поскольку изменения, внесенные методом :meth:`~MaildirMessage.set_info` сообщения, не отражаются здесь до тех пор, пока почтовый ящик не будет Вызывается метод :meth:`__setitem__`.

source: Set the info of the message corresponding to *key* to *info*. Calling ``some_mailbox.set_info(key, flags)`` is similar to ::
ru: Установите для информации сообщения, соответствующего *key*, значение *info*. Вызов ``some_mailbox.set_info(key, flags)`` аналогичен::

source: If you do have a :class:`MaildirMessage` object, use its :meth:`~MaildirMessage.set_info` method instead, because changes made with this mailbox method will not be visible to the message object's method, :meth:`~MaildirMessage.get_info`.
ru: Если у вас есть объект :class:`MaildirMessage`, используйте вместо него его метод :meth:`~MaildirMessage.set_info`, поскольку изменения, сделанные с помощью этого метода почтового ящика, не будут видны методу объекта сообщения, :meth:`~MaildirMessage .get_info`.

source: Some :class:`Mailbox` methods implemented by :class:`!Maildir` deserve special remarks:
pt_pt: Alguns métodos :class:`Mailbox` implementados por :class:`!Maildir` merecem comentários especiais:
ru: Некоторые методы :class:`Mailbox`, реализованные :class:`!Maildir`, заслуживают особого внимания:

source: These methods generate unique file names based upon the current process ID. When using multiple threads, undetected name clashes may occur and cause corruption of the mailbox unless threads are coordinated to avoid using these methods to manipulate the same mailbox simultaneously.
pt_pt: Estes métodos geram nomes de ficheiros únicos com base no ID do processo atual. Ao usar múltiplas threads, podem ocorrer conflitos de nomes não detetados e causar corrupção da caixa de correio, a menos que as threads sejam coordenadas para evitar o uso destes métodos para manipular a mesma caixa de correio simultaneamente.
ru: Эти методы генерируют уникальные имена файлов на основе текущего идентификатора процесса. При использовании нескольких потоков могут возникнуть необнаруженные конфликты имен, которые могут привести к повреждению почтового ящика, если только потоки не скоординированы, чтобы избежать использования этих методов для одновременного управления одним и тем же почтовым ящиком.

source: All changes to Maildir mailboxes are immediately applied, so this method does nothing.
pt_pt: Todas as alterações às caixas de correio Maildir são aplicadas imediatamente, por isso este método não faz nada.
ru: Все изменения в почтовых ящиках Maildir применяются немедленно, поэтому этот метод ничего не делает.

source: Maildir mailboxes do not support (or require) locking, so these methods do nothing.
pt_pt: As caixas de correio Maildir não suportam (nem requerem) bloqueio, por isso estes métodos não fazem nada.
ru: Почтовые ящики Maildir не поддерживают (или не требуют) блокировку, поэтому эти методы ничего не делают.

source: :class:`!Maildir` instances do not keep any open files and the underlying mailboxes do not support locking, so this method does nothing.
pt_pt: As instâncias :class:`!Maildir` não mantêm quaisquer ficheiros abertos e as caixas de correio subjacentes não suportam bloqueio, por isso este método não faz nada.
ru: Экземпляры :class:`!Maildir` не сохраняют открытых файлов, а базовые почтовые ящики не поддерживают блокировку, поэтому этот метод ничего не делает.

source: Depending upon the host platform, it may not be possible to modify or remove the underlying message while the returned file remains open.
pt_pt: Dependendo da plataforma hospedeira, pode não ser possível modificar ou remover a mensagem subjacente enquanto o ficheiro retornado permanecer aberto.
ru: В зависимости от хост-платформы может оказаться невозможным изменить или удалить основное сообщение, пока возвращенный файл остается открытым.

source: `maildir man page from Courier <https://www.courier-mta.org/maildir.html>`_
pt_pt: `Página de manual maildir do Courier <https://www.courier-mta.org/maildir.html>`_
ru: `Справочная страница maildir от Courier <https://www.courier-mta.org/maildir.html>`_

source: A specification of the format. Describes a common extension for supporting folders.
pt_pt: Uma especificação do formato. Descreve uma extensão comum para suportar pastas.
ru: Спецификация формата. Описывает общее расширение для поддержки папок.

source: `Using maildir format <https://cr.yp.to/proto/maildir.html>`_
pt_pt: `Usar formato maildir <https://cr.yp.to/proto/maildir.html>`_
ru: `Использование формата maildir <https://cr.yp.to/proto/maildir.html>`_

source: Notes on Maildir by its inventor. Includes an updated name-creation scheme and details on "info" semantics.
pt_pt: Notas sobre Maildir pelo seu inventor. Inclui um esquema atualizado de criação de nomes e detalhes sobre a semântica de "info".
ru: Заметки о Maildir от его изобретателя. Включает обновленную схему создания имен и подробную информацию о семантике слова «информация».

source: :class:`!mbox` objects
pt_pt: Objetos :class:`!mbox`
ru: :class:`!mbox` объекты

source: A subclass of :class:`Mailbox` for mailboxes in mbox format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`mboxMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
pt_pt: Uma subclasse de :class:`Mailbox` para caixas de correio no formato mbox. O parâmetro *factory* é um objeto chamável que aceita uma representação de mensagem semelhante a um ficheiro (que se comporta como se estivesse aberta em modo binário) e retorna uma representação personalizada. Se *factory* for ``None``, :class:`mboxMessage` é usado como a representação de mensagem predefinida. Se *create* for ``True``, a caixa de correio é criada se não existir.
ru: Подкласс :class:`Mailbox` для почтовых ящиков в формате mbox. Параметр *factory* — это вызываемый объект, который принимает файловое представление сообщения (которое ведет себя так, как если бы оно было открыто в двоичном режиме) и возвращает пользовательское представление. Если *factory* имеет значение None, :class:`mboxMessage` используется как представление сообщения по умолчанию. Если *create* имеет значение True, почтовый ящик создается, если он не существует.

source: The mbox format is the classic format for storing mail on Unix systems. All messages in an mbox mailbox are stored in a single file with the beginning of each message indicated by a line whose first five characters are "From ".
pt_pt: O formato mbox é o formato clássico para armazenar correio em sistemas Unix. Todas as mensagens numa caixa de correio mbox são armazenadas num único ficheiro, com o início de cada mensagem indicado por uma linha cujos primeiros cinco caracteres são "From ".
ru: Формат mbox — это классический формат хранения почты в системах Unix. Все сообщения в почтовом ящике mbox хранятся в одном файле, причем начало каждого сообщения обозначается строкой, первые пять символов которой — «От».

source: Several variations of the mbox format exist to address perceived shortcomings in the original. In the interest of compatibility, :class:`!mbox` implements the original format, which is sometimes referred to as :dfn:`mboxo`. This means that the :mailheader:`Content-Length` header, if present, is ignored and that any occurrences of "From " at the beginning of a line in a message body are transformed to ">From " when storing the message, although occurrences of ">From " are not transformed to "From " when reading the message.
pt_pt: Existem várias variações do formato mbox para abordar deficiências percebidas no original. No interesse da compatibilidade, :class:`!mbox` implementa o formato original, que às vezes é referido como :dfn:`mboxo`. Isto significa que o cabeçalho :mailheader:`Content-Length`, se presente, é ignorado e que quaisquer ocorrências de "From " no início de uma linha no corpo da mensagem são transformadas em ">From " ao armazenar a mensagem, embora as ocorrências de ">From " não sejam transformadas em "From " ao ler a mensagem.
ru: Существует несколько вариантов формата mbox для устранения очевидных недостатков оригинала. В целях совместимости :class:`!mbox` реализует исходный формат, который иногда называют :dfn:`mboxo`. Это означает, что заголовок :mailheader:`Content-Length`, если он присутствует, игнорируется и что любые вхождения «From» в начале строки в теле сообщения преобразуются в «>From» при сохранении сообщения, хотя вхождения «>От» не преобразуются в «От» при чтении сообщения.

source: Some :class:`Mailbox` methods implemented by :class:`!mbox` deserve special remarks:
pt_pt: Alguns métodos :class:`Mailbox` implementados por :class:`!mbox` merecem comentários especiais:
ru: Некоторые методы :class:`Mailbox`, реализованные :class:`!mbox`, заслуживают особого внимания:

source: Note: This method has an extra parameter (*from_*) compared with other classes. The first line of an mbox file entry is the Unix "From " line. If *from_* is False, the first line of the file is dropped.
pt_pt: Nota: Este método tem um parâmetro extra (*from_*) em comparação com outras classes. A primeira linha de uma entrada de ficheiro mbox é a linha Unix "From ".Se *from_* for False, a primeira linha do ficheiro é descartada.
ru: Примечание: Этот метод имеет дополнительный параметр (*from_*) по сравнению с другими классами. Первая строка записи файла mbox — это строка Unix "From". Если *from_* — False, первая строка файла отбрасывается.

source: Using the file after calling :meth:`~Mailbox.flush` or :meth:`~Mailbox.close` on the :class:`!mbox` instance may yield unpredictable results or raise an exception.
pt_pt: Usar o ficheiro após chamar :meth:`~Mailbox.flush` ou :meth:`~Mailbox.close` na instância :class:`!mbox` pode produzir resultados imprevisíveis ou levantar uma exceção.
ru: Использование файла после вызова :meth:`~Mailbox.flush` или :meth:`~Mailbox.close` в экземпляре :class:`!mbox` может привести к непредсказуемым результатам или вызвать исключение.

source: Three locking mechanisms are used---dot locking and, if available, the :c:func:`!flock` and :c:func:`!lockf` system calls.
pt_pt: São usados três mecanismos de bloqueio — bloqueio por ponto e, se disponíveis, as chamadas de sistema :c:func:`!flock` e :c:func:`!lockf`.
ru: Используются три механизма блокировки — точечная блокировка и, если доступно, системные вызовы :c:func:`!flock` и :c:func:`!lockf`.

source: `mbox man page from tin <http://www.tin.org/bin/man.cgi?section=5&topic=mbox>`_
pt_pt: `Página de manual mbox do tin <http://www.tin.org/bin/man.cgi?section=5&topic=mbox>`_
ru: `Справочная страница mbox из Tin <http://www.tin.org/bin/man.cgi?section=5&topic=mbox>`_

source: A specification of the format, with details on locking.
pt_pt: Uma especificação do formato, com detalhes sobre bloqueio.
ru: Спецификация формата с подробностями о блокировке.

source: `Configuring Netscape Mail on Unix: Why The Content-Length Format is Bad <https://www.jwz.org/doc/content-length.html>`_
pt_pt: `Configurar o Correio Netscape em Unix: Por que o Formato Content-Length é Mau <https://www.jwz.org/doc/content-length.html>`_
ru: `Настройка Netscape Mail в Unix: почему формат Content-Length плох <https://www.jwz.org/doc/content-length.html>`_

source: An argument for using the original mbox format rather than a variation.
pt_pt: Um argumento para usar o formato mbox original em vez de uma variação.
ru: Аргумент в пользу использования исходного формата mbox, а не его вариации.

source: `"mbox" is a family of several mutually incompatible mailbox formats <https://www.loc.gov/preservation/digital/formats/fdd/fdd000383.shtml>`_
pt_pt: `"mbox" é uma família de vários formatos de caixa de correio mutuamente incompatíveis <https://www.loc.gov/preservation/digital/formats/fdd/fdd000383.shtml>`_
ru: `"mbox" — это семейство нескольких взаимно несовместимых форматов почтовых ящиков <https://www.loc.gov/preservation/digital/formats/fdd/fdd000383.shtml>`_

source: A history of mbox variations.
pt_pt: Um histórico de variações de mbox.
ru: История вариаций mbox.

source: :class:`!MH` objects
pt_pt: Objetos :class:`!MH`
ru: :class:`!MH` объекты

source: A subclass of :class:`Mailbox` for mailboxes in MH format. Parameter *factory* is a callable object that accepts a file-like message representation (which behaves as if opened in binary mode) and returns a custom representation. If *factory* is ``None``, :class:`MHMessage` is used as the default message representation. If *create* is ``True``, the mailbox is created if it does not exist.
pt_pt: Uma subclasse de :class:`Mailbox` para caixas de correio no formato MH. O parâmetro *factory* é um objeto chamável que aceita uma representação de mensagem semelhante a um ficheiro (que se comporta como se estivesse aberta em modo binário) e retorna uma representação personalizada. Se *factory* for ``None``, :class:`MHMessage` é usado como a representação de mensagem predefinida. Se *create* for ``True``, a caixa de correio é criada se não existir.
ru: Подкласс :class:`Mailbox` для почтовых ящиков в формате MH. Параметр *factory* — это вызываемый объект, который принимает файловое представление сообщения (которое ведет себя так, как если бы оно было открыто в двоичном режиме) и возвращает пользовательское представление. Если *factory* имеет значение None, :class:`MHMessage` используется в качестве представления сообщения по умолчанию. Если *create* имеет значение True, почтовый ящик создается, если он не существует.

source: MH is a directory-based mailbox format invented for the MH Message Handling System, a mail user agent. Each message in an MH mailbox resides in its own file. An MH mailbox may contain other MH mailboxes (called :dfn:`folders`) in addition to messages. Folders may be nested indefinitely. MH mailboxes also support :dfn:`sequences`, which are named lists used to logically group messages without moving them to sub-folders. Sequences are defined in a file called :file:`.mh_sequences` in each folder.
pt_pt: MH é um formato de caixa de correio baseado em diretórios inventado para o Sistema de Manipulação de Mensagens MH, um agente de utilizador de correio. Cada mensagem numa caixa de correio MH reside no seu próprio ficheiro. Uma caixa de correio MH pode conter outras caixas de correio MH (chamadas :dfn:`pastas`) além de mensagens. As pastas podem ser aninhadas indefinidamente. As caixas de correio MH também suportam :dfn:`sequências`, que são listas nomeadas usadas para agrupar logicamente mensagens sem as mover para sub-pastas. As sequências são definidas num ficheiro chamado :file:`.mh_sequences` em cada pasta.
ru: MH — это формат почтовых ящиков на основе каталогов, разработанный для системы обработки сообщений MH, почтового пользовательского агента. Каждое сообщение в почтовом ящике MH хранится в отдельном файле. Почтовый ящик MH может содержать другие почтовые ящики MH (называемые :dfn:`folders`) в дополнение к сообщениям. Папки могут быть вложены бесконечно. Почтовые ящики MH также поддерживают :dfn:`sequences`, именованные списки, используемые для логической группировки сообщений без перемещения их в подпапки. Последовательности определяются в файле с именем :file:`.mh_sequences` в каждой папке.

source: The :class:`!MH` class manipulates MH mailboxes, but it does not attempt to emulate all of :program:`mh`'s behaviors. In particular, it does not modify and is not affected by the :file:`context` or :file:`.mh_profile` files that are used by :program:`mh` to store its state and configuration.
pt_pt: A classe :class:`!MH` manipula caixas de correio MH, mas não tenta emular todos os comportamentos de :program:`mh`. Em particular, não modifica nem é afetada pelos ficheiros :file:`context` ou :file:`.mh_profile` que são usados por :program:`mh` para armazenar o seu estado e configuração.
ru: Класс :class:`!MH` управляет почтовыми ящиками MH, но не пытается эмулировать все поведение :program:`mh`. В частности, он не модифицируется и не подвергается воздействию файлов :file:`context` или :file:`.mh_profile`, которые используются :program:`mh` для хранения его состояния и конфигурации.

source: :class:`!MH` instances have all of the methods of :class:`Mailbox` in addition to the following:
pt_pt: As instâncias :class:`!MH` têm todos os métodos de :class:`Mailbox`, além dos seguintes:
ru: Экземпляры :class:`!MH` имеют все методы :class:`Mailbox` в дополнение к следующим:

source: Supported folders that don't contain a :file:`.mh_sequences` file.
ru: Поддерживаемые папки, не содержащие файла :file:`.mh_sequences`.

source: Return an :class:`!MH` instance representing the folder whose name is *folder*. A :exc:`NoSuchMailboxError` exception is raised if the folder does not exist.
pt_pt: Retorna uma instância :class:`!MH` que representa a pasta cujo nome é *folder*. Uma exceção :exc:`NoSuchMailboxError` é levantada se a pasta não existir.
ru: Возвращает экземпляр :class:`!MH`, представляющий папку с именем *folder*. Исключение :exc:`NoSuchMailboxError` возникает, если папка не существует.

source: Create a folder whose name is *folder* and return an :class:`!MH` instance representing it.
pt_pt: Cria uma pasta cujo nome é *folder* e retorna uma instância :class:`!MH` que a representa.
ru: Создайте папку с именем *folder* и верните представляющий ее экземпляр :class:`!MH`.

source: Return a dictionary of sequence names mapped to key lists. If there are no sequences, the empty dictionary is returned.
pt_pt: Retorna um dicionário de nomes de sequências mapeados para listas de chaves. Se não houver sequências, o dicionário vazio é retornado.
ru: Возвращает словарь имен последовательностей, сопоставленных со списками ключей. Если последовательностей нет, возвращается пустой словарь.

source: Re-define the sequences that exist in the mailbox based upon *sequences*, a dictionary of names mapped to key lists, like returned by :meth:`get_sequences`.
pt_pt: Redefine as sequências que existem na caixa de correio com base em *sequences*, um dicionário de nomes mapeados para listas de chaves, como retornado por :meth:`get_sequences`.
ru: Переопределите последовательности, существующие в почтовом ящике, на основе *sequences*, словаря имен, сопоставленных со списками ключей, например, возвращаемых :meth:`get_sequences`.

source: Rename messages in the mailbox as necessary to eliminate gaps in numbering. Entries in the sequences list are updated correspondingly.
pt_pt: Renomeia mensagens na caixa de correio conforme necessário para eliminar lacunas na numeração. As entradas na lista de sequências são atualizadas correspondentemente.
ru: Переименовывайте сообщения в почтовом ящике по мере необходимости, чтобы устранить пробелы в нумерации. Записи в списке последовательностей обновляются соответствующим образом.

source: Already-issued keys are invalidated by this operation and should not be subsequently used.
pt_pt: As chaves já emitidas são invalidadas por esta operação e não devem ser usadas posteriormente.
ru: Уже выданные ключи в результате этой операции становятся недействительными и не должны использоваться в дальнейшем.

source: Some :class:`Mailbox` methods implemented by :class:`!MH` deserve special remarks:
pt_pt: Alguns métodos :class:`Mailbox` implementados por :class:`!MH` merecem comentários especiais:
ru: Некоторые методы :class:`Mailbox`, реализованные :class:`!MH`, заслуживают особого внимания:

source: These methods immediately delete the message. The MH convention of marking a message for deletion by prepending a comma to its name is not used.
pt_pt: Estes métodos apagam imediatamente a mensagem. A convenção MH de marcar uma mensagem para eliminação prefixando uma vírgula ao seu nome não é usada.
ru: Эти методы немедленно удаляют сообщение. Соглашение MH о пометке сообщения для удаления путем добавления запятой к его имени не используется.

source: Three locking mechanisms are used---dot locking and, if available, the :c:func:`!flock` and :c:func:`!lockf` system calls. For MH mailboxes, locking the mailbox means locking the :file:`.mh_sequences` file and, only for the duration of any operations that affect them, locking individual message files.
pt_pt: São usados três mecanismos de bloqueio — bloqueio por ponto e, se disponíveis, as chamadas de sistema :c:func:`!flock` e :c:func:`!lockf`. Para caixas de correio MH, bloquear a caixa de correio significa bloquear o ficheiro :file:`.mh_sequences` e, apenas durante a duração de quaisquer operações que os afetem, bloquear ficheiros de mensagem individuais.
ru: Используются три механизма блокировки — точечная блокировка и, если доступно, системные вызовы :c:func:`!flock` и :c:func:`!lockf`. Для почтовых ящиков MH блокировка почтового ящика означает блокировку файла :file:`.mh_sequences` и, только на время любых влияющих на них операций, блокировку отдельных файлов сообщений.

source: Depending upon the host platform, it may not be possible to remove the underlying message while the returned file remains open.
pt_pt: Dependendo da plataforma hospedeira, pode não ser possível remover a mensagem subjacente enquanto o ficheiro retornado permanecer aberto.
ru: В зависимости от хост-платформы удаление основного сообщения может оказаться невозможным, пока возвращенный файл остается открытым.

source: All changes to MH mailboxes are immediately applied, so this method does nothing.
pt_pt: Todas as alterações às caixas de correio MH são aplicadas imediatamente, por isso este método não faz nada.
ru: Все изменения в почтовых ящиках MH применяются немедленно, поэтому этот метод ничего не делает.

source: :class:`!MH` instances do not keep any open files, so this method is equivalent to :meth:`unlock`.
pt_pt: As instâncias :class:`!MH` não mantêm quaisquer ficheiros abertos, por isso este método é equivalente a :meth:`unlock`.
ru: Экземпляры :class:`!MH` не сохраняют открытых файлов, поэтому этот метод эквивалентен :meth:`unlock`.

source: `nmh - Message Handling System <https://www.nongnu.org/nmh/>`_
pt_pt: `nmh - Sistema de Manipulação de Mensagens <https://www.nongnu.org/nmh/>`_
ru: `nmh — система обработки сообщений <https://www.nongnu.org/nmh/>`_

source: Home page of :program:`nmh`, an updated version of the original :program:`mh`.
pt_pt: Página inicial do :program:`nmh`, uma versão atualizada do original :program:`mh`.
ru: Домашняя страница :program:`nmh`, обновленной версии оригинальной :program:`mh`.

source: `MH & nmh: Email for Users & Programmers <https://rand-mh.sourceforge.io/book/>`_
pt_pt: `MH & nmh: Correio Eletrónico para Utilizadores e Programadores <https://rand-mh.sourceforge.io/book/>`_
ru: `MH & nmh: электронная почта для пользователей и программистов <https://rand-mh.sourceforge.io/book/>`_

source: A GPL-licensed book on :program:`mh` and :program:`nmh`, with some information on the mailbox format.
pt_pt: Um livro com licença GPL sobre :program:`mh` e :program:`nmh`, com algumas informações sobre o formato da caixa de correio.
ru: Книга под лицензией GPL по :program:`mh` и :program:`nmh`, с некоторой информацией о формате почтового ящика.

source: :class:`!Babyl` objects
pt_pt: Objetos :class:`!Babyl`
ru: :class:`!Babyl` объекты
