Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/mailbox.po
Languages: pt_pt, ru

source: :mod:`!mailbox` --- Manipulate mailboxes in various formats
pt_pt: :mod:`!mailbox` --- Manipular caixas de correio em vários formatos
ru: :mod:`!mailbox` --- Управление почтовыми ящиками в различных форматах.

source: **Source code:** :source:`Lib/mailbox.py`
pt_pt: **Código-fonte:** :source:`Lib/mailbox.py`
ru: **Исходный код** :source:`Lib/mailbox.py`

source: This module defines two classes, :class:`Mailbox` and :class:`Message`, for accessing and manipulating on-disk mailboxes and the messages they contain. :class:`!Mailbox` offers a dictionary-like mapping from keys to messages. :class:`!Message` extends the :mod:`email.message` module's :class:`~email.message.Message` class with format-specific state and behavior. Supported mailbox formats are Maildir, mbox, MH, Babyl, and MMDF.
pt_pt: Este módulo define duas classes, :class:`Mailbox` e :class:`Message`, para aceder e manipular caixas de correio em disco e as mensagens que contêm. :class:`!Mailbox` oferece um mapeamento semelhante a um dicionário de chaves para mensagens. :class:`!Message` estende a classe :class:`~email.message.Message` do módulo :mod:`email.message` com estado e comportamento específicos do formato. Os formatos de caixa de correio suportados são Maildir, mbox, MH, Babyl e MMDF.
ru: Этот модуль определяет два класса: :class:`Mailbox` и :class:`Message`, для доступа и управления почтовыми ящиками на диске и сообщениями, которые они содержат. :class:`!Mailbox` предлагает сопоставление ключей с сообщениями, подобное словарю. :class:`!Message` расширяет класс :class:`~email.message.Message` модуля :mod:`email.message` с состоянием и поведением, зависящим от формата. Поддерживаемые форматы почтовых ящиков: Maildir, mbox, MH, Babyl и MMDF.

source: Module :mod:`email`
pt_pt: Módulo :mod:`email`
ru: Модуль :mod:`email`

source: Represent and manipulate messages.
pt_pt: Representar e manipular mensagens.
ru: Представление и манипуляция сообщениями

source: :class:`!Mailbox` objects
pt_pt: Objetos :class:`!Mailbox`
ru: :class:`!Mailbox` объекты

source: A mailbox, which may be inspected and modified.
pt_pt: Uma caixa de correio, que pode ser inspecionada e modificada.
ru: Почтовый ящик, может быть изменен и модифицирован

source: The :class:`!Mailbox` class defines an interface and is not intended to be instantiated. Instead, format-specific subclasses should inherit from :class:`!Mailbox` and your code should instantiate a particular subclass.
pt_pt: A classe :class:`!Mailbox` define uma interface e não é destinada a ser instanciada. Em vez disso, subclasses específicas do formato devem herdar de :class:`!Mailbox` e o seu código deve instanciar uma subclasse específica.
ru: Класс :class:`!Mailbox` определяет интерфейс и не предназначен для создания экземпляров. Вместо этого подклассы, специфичные для формата, должны наследовать от :class:`!Mailbox`, а ваш код должен создавать экземпляр определенного подкласса.

source: The :class:`!Mailbox` interface is dictionary-like, with small keys corresponding to messages. Keys are issued by the :class:`!Mailbox` instance with which they will be used and are only meaningful to that :class:`!Mailbox` instance. A key continues to identify a message even if the corresponding message is modified, such as by replacing it with another message.
pt_pt: A interface :class:`!Mailbox` é semelhante a um dicionário, com chaves pequenas correspondentes a mensagens. As chaves são emitidas pela instância :class:`!Mailbox` com a qual serão usadas e só são significativas para essa instância :class:`!Mailbox`. Uma chave continua a identificar uma mensagem mesmo que a mensagem correspondente seja modificada, como por exemplo substituindo-a por outra mensagem.
ru: Интерфейс :class:`!Mailbox` похож на словарь, с маленькими клавишами, соответствующими сообщениям. Ключи выдаются экземпляром :class:`!Mailbox`, с которым они будут использоваться, и имеют смысл только для этого экземпляра :class:`!Mailbox`. Ключ продолжает идентифицировать сообщение, даже если соответствующее сообщение изменено, например, путем замены его другим сообщением.

source: Messages may be added to a :class:`!Mailbox` instance using the set-like method :meth:`add` and removed using a ``del`` statement or the set-like methods :meth:`remove` and :meth:`discard`.
pt_pt: As mensagens podem ser adicionadas a uma instância :class:`!Mailbox` usando o método semelhante a um conjunto :meth:`add` e removidas usando uma instrução ``del`` ou os métodos semelhantes a conjuntos :meth:`remove` e :meth:`discard`.
ru: Сообщения могут быть добавлены в экземпляр :class:`!Mailbox` с помощью метода set-подобного :meth:`add` и удалены с помощью оператора ``del`` или методов set-подобных :meth:`remove` и : мет:`отбросить`.

source: :class:`!Mailbox` interface semantics differ from dictionary semantics in some noteworthy ways. Each time a message is requested, a new representation (typically a :class:`Message` instance) is generated based upon the current state of the mailbox. Similarly, when a message is added to a :class:`!Mailbox` instance, the provided message representation's contents are copied. In neither case is a reference to the message representation kept by the :class:`!Mailbox` instance.
pt_pt: A semântica da interface :class:`!Mailbox` difere da semântica do dicionário de algumas formas notáveis. Sempre que uma mensagem é solicitada, uma nova representação (normalmente uma instância :class:`Message`) é gerada com base no estado atual da caixa de correio. Da mesma forma, quando uma mensagem é adicionada a uma instância :class:`!Mailbox`, o conteúdo da representação da mensagem fornecida é copiado. Em nenhum dos casos é mantida uma referência à representação da mensagem pela instância :class:`!Mailbox`.
ru: Семантика интерфейса :class:`!Mailbox` отличается от семантики словаря некоторыми примечательными моментами. Каждый раз, когда запрашивается сообщение, создается новое представление (обычно экземпляр :class:`Message`) на основе текущего состояния почтового ящика. Аналогично, когда сообщение добавляется в экземпляр :class:`!Mailbox`, содержимое предоставленного представления сообщения копируется. Ни в одном случае ссылка на представление сообщения не сохраняется в экземпляре :class:`!Mailbox`.

source: The default :class:`!Mailbox` :term:`iterator` iterates over message representations, not keys as the default :class:`dictionary <dict>` iterator does. Moreover, modification of a mailbox during iteration is safe and well-defined. Messages added to the mailbox after an iterator is created will not be seen by the iterator. Messages removed from the mailbox before the iterator yields them will be silently skipped, though using a key from an iterator may result in a :exc:`KeyError` exception if the corresponding message is subsequently removed.
pt_pt: O iterador :term:`iterator` predefinido de :class:`!Mailbox` itera sobre representações de mensagens, não chaves como o iterador :class:`dicionário <dict>` predefinido faz. Além disso, a modificação de uma caixa de correio durante a iteração é segura e bem definida. Mensagens adicionadas à caixa de correio após a criação de um iterador não serão vistas pelo iterador. Mensagens removidas da caixa de correio antes de o iterador as produzir serão silenciosamente ignoradas, embora o uso de uma chave de um iterador pode resultar numa exceção :exc:`KeyError` se a mensagem correspondente for posteriormente removida.
ru: По умолчанию :class:`!Mailbox` :term:`iterator` перебирает представления сообщений, а не ключи, как это делает итератор :class:`dictionary <dict>` по умолчанию. Более того, модификация почтового ящика во время итерации безопасна и четко определена. Сообщения, добавленные в почтовый ящик после создания итератора, не будут видны ему. Сообщения, удаленные из почтового ящика до того, как итератор выдаст их, будут автоматически пропущены, хотя использование ключа из итератора может привести к исключению :exc:`KeyError`, если соответствующее сообщение впоследствии будет удалено.

source: Be very cautious when modifying mailboxes that might be simultaneously changed by some other process. The safest mailbox format to use for such tasks is :class:`Maildir`; try to avoid using single-file formats such as :class:`mbox` for concurrent writing. If you're modifying a mailbox, you *must* lock it by calling the :meth:`lock` and :meth:`unlock` methods *before* reading any messages in the file or making any changes by adding or deleting a message. Failing to lock the mailbox runs the risk of losing messages or corrupting the entire mailbox.
pt_pt: Tenha muito cuidado ao modificar caixas de correio que possam ser simultaneamente alteradas por outro processo. O formato de caixa de correio mais seguro para tais tarefas é :class:`Maildir`; tente evitar o uso de formatos de ficheiro único como :class:`mbox` para escrita concorrente. Se estiver a modificar uma caixa de correio, *deve* bloqueá-la chamando os métodos :meth:`lock` e :meth:`unlock` *antes* de ler quaisquer mensagens no ficheiro ou fazer quaisquer alterações adicionando ou apagando uma mensagem. Não bloquear a caixa de correio corre o risco de perder mensagens ou corromper toda a caixa de correio.
ru: Будьте очень осторожны при изменении почтовых ящиков, которые могут быть одновременно изменены каким-либо другим процессом. Самый безопасный формат почтового ящика для таких задач — :class:`Maildir`; старайтесь избегать использования однофайловых форматов, таких как :class:`mbox`, для одновременной записи. Если вы изменяете почтовый ящик, вы *должны* заблокировать его, вызвав методы :meth:`lock` и :meth:`unlock` *перед* чтением любых сообщений в файле или внесением каких-либо изменений путем добавления или удаления сообщения. . Если не заблокировать почтовый ящик, существует риск потери сообщений или повреждения всего почтового ящика.

source: :class:`!Mailbox` instances have the following methods:
pt_pt: As instâncias :class:`!Mailbox` têm os seguintes métodos:
ru: Экземпляры :class:`!Mailbox` имеют следующие методы:

source: Add *message* to the mailbox and return the key that has been assigned to it.
pt_pt: Adiciona *message* à caixa de correio e retorna a chave que lhe foi atribuída.
ru: Добавьте *сообщение* в почтовый ящик и верните назначенный ему ключ.

source: Parameter *message* may be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, a byte string, or a file-like object (which should be open in binary mode). If *message* is an instance of the appropriate format-specific :class:`Message` subclass (e.g., if it's an :class:`mboxMessage` instance and this is an :class:`mbox` instance), its format-specific information is used. Otherwise, reasonable defaults for format-specific information are used.
pt_pt: O parâmetro *message* pode ser uma instância :class:`Message`, uma instância :class:`email.message.Message`, uma string, uma string de bytes, ou um objeto semelhante a um ficheiro (que deve estar aberto em modo binário). Se *message* for uma instância da subclasse :class:`Message` específica do formato adequado (por exemplo, se for uma instância :class:`mboxMessage` e esta for uma instância :class:`mbox`), a sua informação específica do formato é usada. Caso contrário, são usados valores predefinidos razoáveis para a informação específica do formato.
ru: Параметр *message* может быть экземпляром :class:`Message`, экземпляром :class:`email.message.Message`, строкой, байтовой строкой или файлоподобным объектом (который должен быть открыт в двоичном режиме). . Если *message* является экземпляром соответствующего подкласса :class:`Message`, специфичного для формата (например, если это экземпляр :class:`mboxMessage`, а это экземпляр :class:`mbox`), его специфичный для формата используется информация. В противном случае используются разумные значения по умолчанию для информации, специфичной для формата.

source: Support for binary input was added.
pt_pt: Foi adicionado suporte para entrada binária.
ru: Добавлена ​​поддержка двоичного ввода.

source: Delete the message corresponding to *key* from the mailbox.
pt_pt: Apaga a mensagem correspondente a *key* da caixa de correio.
ru: Удалите сообщение, соответствующее *key*, из почтового ящика.

source: If no such message exists, a :exc:`KeyError` exception is raised if the method was called as :meth:`remove` or :meth:`__delitem__` but no exception is raised if the method was called as :meth:`discard`. The behavior of :meth:`discard` may be preferred if the underlying mailbox format supports concurrent modification by other processes.
pt_pt: Se não existir tal mensagem, uma exceção :exc:`KeyError` é levantada se o método foi chamado como :meth:`remove` ou :meth:`__delitem__`, mas nenhuma exceção é levantada se o método foi chamado como :meth:`discard`. O comportamento de :meth:`discard` pode ser preferível se o formato da caixa de correio subjacente suportar modificação concorrente por outros processos.
ru: Если такого сообщения не существует, возникает исключение :exc:`KeyError`, если метод был вызван как :meth:`remove` или :meth:`__delitem__`, но исключение не создается, если метод был вызван как :meth:` отбросить`. Поведение :meth:`discard` может быть предпочтительным, если базовый формат почтового ящика поддерживает одновременную модификацию другими процессами.

source: Replace the message corresponding to *key* with *message*. Raise a :exc:`KeyError` exception if no message already corresponds to *key*.
pt_pt: Substitui a mensagem correspondente a *key* por *message*. Levanta uma exceção :exc:`KeyError` se nenhuma mensagem corresponder já a *key*.
ru: Замените сообщение, соответствующее *key*, на *message*. Вызовите исключение :exc:`KeyError`, если ни одно сообщение уже не соответствует *key*.

source: As with :meth:`add`, parameter *message* may be a :class:`Message` instance, an :class:`email.message.Message` instance, a string, a byte string, or a file-like object (which should be open in binary mode). If *message* is an instance of the appropriate format-specific :class:`Message` subclass (e.g., if it's an :class:`mboxMessage` instance and this is an :class:`mbox` instance), its format-specific information is used. Otherwise, the format-specific information of the message that currently corresponds to *key* is left unchanged.
pt_pt: Tal como com :meth:`add`, o parâmetro *message* pode ser uma instância :class:`Message`, uma instância :class:`email.message.Message`, uma string, uma string de bytes, ou um objeto semelhante a um ficheiro (que deve estar aberto em modo binário). Se *message* for uma instância da subclasse :class:`Message` específica do formato adequado (por exemplo, se for uma instância :class:`mboxMessage` e esta for uma instância :class:`mbox`), a sua informação específica do formato é usada. Caso contrário, a informação específica do formato da mensagem que atualmente corresponde a *key* permanece inalterada.
ru: Как и в случае с :meth:`add`, параметр *message* может быть экземпляром :class:`Message`, экземпляром :class:`email.message.Message`, строкой, байтовой строкой или файловым объектом. (который должен быть открыт в двоичном режиме). Если *message* является экземпляром соответствующего подкласса :class:`Message`, специфичного для формата (например, если это экземпляр :class:`mboxMessage`, а это экземпляр :class:`mbox`), его специфичный для формата используется информация. В противном случае информация о формате сообщения, которая в данный момент соответствует *key*, остается неизменной.

source: Return an :term:`iterator` over all keys
pt_pt: Retorna um :term:`iterador` sobre todas as chaves
ru: Вернуть :term:`итератор` по всем ключам

source: The same as :meth:`iterkeys`, except that a :class:`list` is returned rather than an :term:`iterator`
pt_pt: O mesmo que :meth:`iterkeys`, exceto que uma :class:`list` é retornada em vez de um :term:`iterador`
ru: То же, что и :meth:`iterkeys`, за исключением того, что возвращается :class:`list`, а не :term:`iterator`

source: Return an :term:`iterator` over representations of all messages. The messages are represented as instances of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`!Mailbox` instance was initialized.
pt_pt: Retorna um :term:`iterador` sobre representações de todas as mensagens. As mensagens são representadas como instâncias da subclasse :class:`Message` específica do formato adequado, a menos que uma fábrica de mensagens personalizada tenha sido especificada quando a instância :class:`!Mailbox` foi inicializada.
ru: Возвращает :term:`итератор` для представлений всех сообщений. Сообщения представлены как экземпляры соответствующего подкласса :class:`Message`, специфичного для формата, если при инициализации экземпляра :class:`!Mailbox` не была указана пользовательская фабрика сообщений.

source: The behavior of :meth:`__iter__` is unlike that of dictionaries, which iterate over keys.
pt_pt: O comportamento de :meth:`__iter__` é diferente do dos dicionários, que iteram sobre chaves.
ru: Поведение :meth:`__iter__` отличается от поведения словарей, которые перебирают ключи.

source: The same as :meth:`itervalues`, except that a :class:`list` is returned rather than an :term:`iterator`
pt_pt: O mesmo que :meth:`itervalues`, exceto que uma :class:`list` é retornada em vez de um :term:`iterador`
ru: То же, что :meth:`itervalues`, за исключением того, что возвращается :class:`list`, а не :term:`iterator`

source: Return an :term:`iterator` over (*key*, *message*) pairs, where *key* is a key and *message* is a message representation. The messages are represented as instances of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`!Mailbox` instance was initialized.
pt_pt: Retorna um :term:`iterador` sobre pares (*chave*, *mensagem*), onde *chave* é uma chave e *mensagem* é uma representação de mensagem. As mensagens são representadas como instâncias da subclasse :class:`Message` específica do formato adequado, a menos que uma fábrica de mensagens personalizada tenha sido especificada quando a instância :class:`!Mailbox` foi inicializada.
ru: Возвращает :term:`iterator` для пар (*key*, *message*), где *key* — это ключ, а *message* — представление сообщения. Сообщения представлены как экземпляры соответствующего подкласса :class:`Message`, специфичного для формата, если при инициализации экземпляра :class:`!Mailbox` не была указана пользовательская фабрика сообщений.

source: The same as :meth:`iteritems`, except that a :class:`list` of pairs is returned rather than an :term:`iterator` of pairs.
pt_pt: O mesmo que :meth:`iteritems`, exceto que uma :class:`list` de pares é retornada em vez de um :term:`iterador` de pares.
ru: То же, что и :meth:`iteritems`, за исключением того, что возвращается :class:`list` пар, а не :term:`iterator` пар.

source: Return a representation of the message corresponding to *key*. If no such message exists, *default* is returned if the method was called as :meth:`get` and a :exc:`KeyError` exception is raised if the method was called as :meth:`!__getitem__`. The message is represented as an instance of the appropriate format-specific :class:`Message` subclass unless a custom message factory was specified when the :class:`!Mailbox` instance was initialized.
pt_pt: Retorna uma representação da mensagem correspondente a *key*. Se não existir tal mensagem, *default* é retornado se o método foi chamado como :meth:`get` e uma exceção :exc:`KeyError` é levantada se o método foi chamado como :meth:`!__getitem__`. A mensagem é representada como uma instância da subclasse :class:`Message` específica do formato adequado, a menos que uma fábrica de mensagens personalizada tenha sido especificada quando a instância :class:`!Mailbox` foi inicializada.
ru: Возвращает представление сообщения, соответствующее *key*. Если такого сообщения не существует, возвращается *default*, если метод был вызван как :meth:`get`, и возникает исключение :exc:`KeyError`, если метод был вызван как :meth:`!__getitem__`. Сообщение представляется как экземпляр соответствующего подкласса :class:`Message`, специфичного для формата, если при инициализации экземпляра :class:`!Mailbox` не была указана пользовательская фабрика сообщений.

source: Return a representation of the message corresponding to *key* as an instance of the appropriate format-specific :class:`Message` subclass, or raise a :exc:`KeyError` exception if no such message exists.
pt_pt: Retorna uma representação da mensagem correspondente a *key* como uma instância da subclasse :class:`Message` específica do formato adequado, ou levanta uma exceção :exc:`KeyError` se não existir tal mensagem.
ru: Возвращает представление сообщения, соответствующего *key*, как экземпляр соответствующего подкласса :class:`Message`, специфичного для формата, или вызывает исключение :exc:`KeyError`, если такого сообщения не существует.

source: Return a byte representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists.
pt_pt: Retorna uma representação em bytes da mensagem correspondente a *key*, ou levanta uma exceção :exc:`KeyError` se não existir tal mensagem.
ru: Возвращает байтовое представление сообщения, соответствующее *key*, или вызывает исключение :exc:`KeyError`, если такого сообщения не существует.

source: Return a string representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists. The message is processed through :class:`email.message.Message` to convert it to a 7bit clean representation.
pt_pt: Retorna uma representação em string da mensagem correspondente a *key*, ou levanta uma exceção :exc:`KeyError` se não existir tal mensagem. A mensagem é processada através de :class:`email.message.Message` para convertê-la numa representação limpa de 7 bits.
ru: Возвращает строковое представление сообщения, соответствующего *key*, или вызывает исключение :exc:`KeyError`, если такого сообщения не существует. Сообщение обрабатывается через :class:`email.message.Message` для преобразования его в 7-битное чистое представление.

source: Return a :term:`file-like <file-like object>` representation of the message corresponding to *key*, or raise a :exc:`KeyError` exception if no such message exists. The file-like object behaves as if open in binary mode. This file should be closed once it is no longer needed.
pt_pt: Retorna uma representação :term:`semelhante a um ficheiro <file-like object>` da mensagem correspondente a *key*, ou levanta uma exceção :exc:`KeyError` se não existir tal mensagem. O objeto semelhante a um ficheiro comporta-se como se estivesse aberto em modo binário. Este ficheiro deve ser fechado assim que não for mais necessário.
ru: Возвращает :term:`file-like <файлоподобный объект>` представление сообщения, соответствующего *key*, или вызывает исключение :exc:`KeyError`, если такого сообщения не существует. Файлоподобный объект ведет себя так, как если бы он был открыт в двоичном режиме. Этот файл следует закрыть, как только он больше не понадобится.
