Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/msvcrt.po
Languages: sv

source: :mod:`!msvcrt` --- Useful routines from the MS VC++ runtime
sv: :mod:`!msvcrt` --- Användbara rutiner från MS VC++ runtime

source: These functions provide access to some useful capabilities on Windows platforms. Some higher-level modules use these functions to build the Windows implementations of their services. For example, the :mod:`getpass` module uses this in the implementation of the :func:`getpass` function.
sv: Dessa funktioner ger tillgång till en del användbara funktioner på Windows-plattformar. Vissa moduler på högre nivå använder dessa funktioner för att bygga Windows-implementationer av sina tjänster. Modulen :mod:`getpass` använder till exempel detta i implementeringen av funktionen :func:`getpass`.

source: Further documentation on these functions can be found in the Platform API documentation.
sv: Mer information om dessa funktioner finns i dokumentationen för Platform API.

source: The module implements both the normal and wide char variants of the console I/O api. The normal API deals only with ASCII characters and is of limited use for internationalized applications. The wide char API should be used where ever possible.
sv: Modulen implementerar både den normala varianten och wide char-varianten av konsolens I/O-api. Det normala API:et hanterar endast ASCII-tecken och är av begränsad nytta för internationaliserade applikationer. API:et för breda tecken bör användas när det är möjligt.

source: Availability
sv: Tillgänglighet

source: Operations in this module now raise :exc:`OSError` where :exc:`IOError` was raised.
sv: Operationer i denna modul ger nu upphov till :exc:`OSError` där :exc:`IOError` tidigare gav upphov till.

source: File Operations
sv: Filoperationer

source: Lock part of a file based on file descriptor *fd* from the C runtime. Raises :exc:`OSError` on failure. The locked region of the file extends from the current file position for *nbytes* bytes, and may continue beyond the end of the file. *mode* must be one of the :const:`!LK_\*` constants listed below. Multiple regions in a file may be locked at the same time, but may not overlap. Adjacent regions are not merged; they must be unlocked individually.
sv: Låser en del av en fil baserat på filbeskrivaren *fd* från C-körtiden. Utlöser :exc:`OSError` om det misslyckas. Den låsta delen av filen sträcker sig från den aktuella filpositionen i *nbytes* bytes och kan fortsätta längre än till slutet av filen. *mode* måste vara en av de :const:`!LK_\*`\-konstanter som listas nedan. Flera regioner i en fil kan låsas samtidigt, men de får inte överlappa varandra. Angränsande regioner slås inte samman, utan måste låsas upp var för sig.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.locking`` with arguments ``fd``, ``mode``, ``nbytes``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``msvcrt.locking`` med argumenten ``fd``, ``mode``, ``nbytes``.

source: Locks the specified bytes. If the bytes cannot be locked, the program immediately tries again after 1 second. If, after 10 attempts, the bytes cannot be locked, :exc:`OSError` is raised.
sv: Låser de angivna bytena. Om bytena inte kan låsas försöker programmet omedelbart igen efter 1 sekund. Om bytena inte kan låsas efter 10 försök utlöses :exc:`OSError`.

source: Locks the specified bytes. If the bytes cannot be locked, :exc:`OSError` is raised.
sv: Låser de angivna byte. Om byte inte kan låsas kommer :exc:`OSError` att uppstå.

source: Unlocks the specified bytes, which must have been previously locked.
sv: Låser upp de angivna bytena, som måste ha varit låsta tidigare.

source: Set the line-end translation mode for the file descriptor *fd*. To set it to text mode, *flags* should be :const:`os.O_TEXT`; for binary, it should be :const:`os.O_BINARY`.
sv: Ställer in översättningsläget för radavslut för filbeskrivaren *fd*. För att ställa in det till textläge bör *flags* vara :const:`os.O_TEXT`; för binärt bör det vara :const:`os.O_BINARY`.

source: Create a C runtime file descriptor from the file handle *handle*. The *flags* parameter should be a bitwise OR of :const:`os.O_APPEND`, :const:`os.O_RDONLY`, :const:`os.O_TEXT` and :const:`os.O_NOINHERIT`. The returned file descriptor may be used as a parameter to :func:`os.fdopen` to create a file object.
sv: Skapa en C runtime file descriptor från filhandtaget *handle*. Parametern *flags* bör vara ett bitvis ELLER av :const:`os.O_APPEND`, :const:`os.O_RDONLY`, :const:`os.O_TEXT` och :const:`os.O_NOINHERIT`. Den returnerade filbeskrivaren kan användas som en parameter till :func:`os.fdopen` för att skapa ett filobjekt.

source: The file descriptor is inheritable by default. Pass :const:`os.O_NOINHERIT` flag to make it non inheritable.
sv: Filbeskrivaren är ärftlig som standard. Passera :const:`os.O_NOINHERIT` flagga för att göra den icke ärftlig.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.open_osfhandle`` with arguments ``handle``, ``flags``.
sv: Utlöser en :ref:`auditing event <auditing>` ``msvcrt.open_osfhandle`` med argumenten ``handle``, ``flags``.

source: Return the file handle for the file descriptor *fd*. Raises :exc:`OSError` if *fd* is not recognized.
sv: Returnerar filhandtaget för filbeskrivaren *fd*. Utlöser :exc:`OSError` om *fd* inte känns igen.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.get_osfhandle`` with argument ``fd``.
sv: Utlöser en :ref:`auditing event <auditing>` ``msvcrt.get_osfhandle`` med argument ``fd``.

source: Console I/O
sv: Konsol I/O

source: Returns a nonzero value if a keypress is waiting to be read. Otherwise, return 0.
sv: Returnerar ett värde som inte är noll om en knapptryckning väntar på att läsas. I annat fall returneras 0.

source: Read a keypress and return the resulting character as a byte string. Nothing is echoed to the console. This call will block if a keypress is not already available, but will not wait for :kbd:`Enter` to be pressed. If the pressed key was a special function key, this will return ``'\000'`` or ``'\xe0'``; the next call will return the keycode. The :kbd:`Control-C` keypress cannot be read with this function.
sv: Läser en tangenttryckning och returnerar det resulterande tecknet som en byte-sträng. Ingenting ekas till konsolen. Detta anrop blockeras om en tangenttryckning inte redan är tillgänglig, men väntar inte på att :kbd:`Enter` ska tryckas. Om den nedtryckta tangenten var en speciell funktionstangent kommer detta att returnera ``'\000'`` eller ``'\xe0'``; nästa anrop kommer att returnera tangentkoden. Tangenttryckningen :kbd:`Control-C` kan inte läsas med denna funktion.

source: Wide char variant of :func:`getch`, returning a Unicode value.
sv: Wide char-variant av :func:`getch`, returnerar ett Unicode-värde.

source: Similar to :func:`getch`, but the keypress will be echoed if it represents a printable character.
sv: Liknar :func:`getch`, men tangenttryckningen ekas om den representerar ett skrivbart tecken.

source: Wide char variant of :func:`getche`, returning a Unicode value.
sv: Wide char-variant av :func:`getche`, returnerar ett Unicode-värde.

source: Print the byte string *char* to the console without buffering.
sv: Skriv ut byte-strängen *char* till konsolen utan buffring.

source: Wide char variant of :func:`putch`, accepting a Unicode value.
sv: Wide char-variant av :func:`putch`, som accepterar ett Unicode-värde.

source: Cause the byte string *char* to be "pushed back" into the console buffer; it will be the next character read by :func:`getch` or :func:`getche`.
sv: Byte-strängen *char* "skjuts tillbaka" till konsolbufferten; den blir nästa tecken som läses av :func:`getch` eller :func:`getche`.

source: Wide char variant of :func:`ungetch`, accepting a Unicode value.
sv: Wide char-variant av :func:`ungetch`, som accepterar ett Unicode-värde.

source: Other Functions
sv: Övriga funktioner

source: Force the :c:func:`malloc` heap to clean itself up and return unused blocks to the operating system. On failure, this raises :exc:`OSError`.
sv: Tvingar heapen :c:func:`malloc` att rensa upp sig själv och returnera oanvända block till operativsystemet. Om detta misslyckas uppstår :exc:`OSError`.

source: Changes the location where the C runtime writes an error message for an error that might end the program. *mode* must be one of the :const:`!OUT_\*` constants listed below or :const:`REPORT_ERRMODE`. Returns the old setting or -1 if an error occurs. Only available in :ref:`debug build of Python <debug-build>`.
sv: Ändrar platsen där C-körtiden skriver ett felmeddelande för ett fel som kan avsluta programmet. *mode* måste vara en av :const:`!OUT_\*`\-konstanterna som listas nedan eller :const:`REPORT_ERRMODE`. Returnerar den gamla inställningen eller -1 om ett fel inträffar. Endast tillgängligt i :ref:`debug build av Python <debug-build>`.

source: Error sink is determined by the app's type. Only available in :ref:`debug build of Python <debug-build>`.
sv: Felsänkningen bestäms av appens typ. Endast tillgänglig i :ref:`debug build av Python <debug-build>`.

source: Error sink is a standard error. Only available in :ref:`debug build of Python <debug-build>`.
sv: Error sink är ett standardfel. Endast tillgängligt i :ref:`debug build av Python <debug-build>`.

source: Error sink is a message box. Only available in :ref:`debug build of Python <debug-build>`.
sv: Error sink är en meddelanderuta. Endast tillgänglig i :ref:`debug build av Python <debug-build>`.

source: Report the current error mode value. Only available in :ref:`debug build of Python <debug-build>`.
sv: Rapportera det aktuella värdet för felläget. Endast tillgängligt i :ref:`debug build av Python <debug-build>`.

source: Specifies the destination or destinations for a specific report type generated by :c:func:`!_CrtDbgReport` in the MS VC++ runtime. *type* must be one of the :const:`!CRT_\*` constants listed below. *mode* must be one of the :const:`!CRTDBG_\*` constants listed below. Only available in :ref:`debug build of Python <debug-build>`.
sv: Anger destinationen eller destinationerna för en viss rapporttyp som genereras av :c:func:`!_CrtDbgReport` i MS VC++ runtime. *type* måste vara en av de :const:`!CRT_\*`\-konstanter som listas nedan. *mode* måste vara en av de :const:`!CRTDBG_\*`\-konstanter som anges nedan. Endast tillgänglig i :ref:`debug build av Python <debug-build>`.

source: After you use :func:`CrtSetReportMode` to specify :const:`CRTDBG_MODE_FILE`, you can specify the file handle to receive the message text. *type* must be one of the :const:`!CRT_\*` constants listed below. *file* should be the file handle your want specified. Only available in :ref:`debug build of Python <debug-build>`.
sv: När du har använt :func:`CrtSetReportMode` för att ange :const:`CRTDBG_MODE_FILE`, kan du ange filhandtaget för att ta emot meddelandetexten. *type* måste vara en av de :const:`!CRT_\*`\-konstanter som listas nedan. *file* bör vara det filhandtag som du vill ha angivet. Endast tillgängligt i :ref:`debug build av Python <debug-build>`.

source: Warnings, messages, and information that doesn't need immediate attention.
sv: Varningar, meddelanden och information som inte kräver omedelbar uppmärksamhet.

source: Errors, unrecoverable problems, and issues that require immediate attention.
sv: Fel, problem som inte går att åtgärda och problem som kräver omedelbar åtgärd.

source: Assertion failures.
sv: Felaktiga påståenden.

source: Writes the message to the debugger's output window.
sv: Skriver meddelandet till debuggarens utdatafönster.

source: Writes the message to a user-supplied file handle. :func:`CrtSetReportFile` should be called to define the specific file or stream to use as the destination.
sv: Skriver meddelandet till ett filhandtag som användaren angett. :func:`CrtSetReportFile` bör anropas för att definiera den specifika fil eller ström som ska användas som destination.

source: Creates a message box to display the message along with the ``Abort``, ``Retry``, and ``Ignore`` buttons.
sv: Skapar en meddelanderuta för att visa meddelandet tillsammans med knapparna "Avbryt", "Återgå" och "Ignorera".

source: Returns current *mode* for the specified *type*.
sv: Returnerar aktuellt *läge* för den angivna *typen*.

source: The CRT Assembly version, from the :file:`crtassem.h` header file.
sv: CRT Assembly-versionen, från huvudfilen :file:`crtassem.h`.

source: The VC Assembly public key token, from the :file:`crtassem.h` header file.
sv: VC Assembly offentliga nyckeltoken, från huvudfilen :file:`crtassem.h`.

source: The Libraries Assembly name prefix, from the :file:`crtassem.h` header file.
sv: Prefixet för Libraries Assembly-namnet, från huvudfilen :file:`crtassem.h`.
