Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/nntplib.po
Languages: ru

source: :mod:`nntplib` --- NNTP protocol client
ru: :mod:`nntplib` --- Клиент протокола NNTP

source: **Source code:** :source:`Lib/nntplib.py`
ru: **Исходный код:** :source:`Lib/nntplib.py`

source: The :mod:`nntplib` module is deprecated (see :pep:`594` for details).
ru: Модуль :mod:`nntplib` устарел (подробности см. в :pep:`594`).

source: This module defines the class :class:`NNTP` which implements the client side of the Network News Transfer Protocol. It can be used to implement a news reader or poster, or automated news processors. It is compatible with :rfc:`3977` as well as the older :rfc:`977` and :rfc:`2980`.
ru: Этот модуль определяет класс :class:`NNTP`, который реализует клиентскую часть протокола передачи сетевых новостей. Его можно использовать для реализации программы чтения новостей или плаката, а также для автоматизированных обработчиков новостей. Он совместим с :rfc:`3977`, а также с более старыми :rfc:`977` и :rfc:`2980`.

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.

source: Here are two small examples of how it can be used. To list some statistics about a newsgroup and print the subjects of the last 10 articles::
ru: Вот два небольших примера того, как его можно использовать. Чтобы вывести некоторую статистику о группе новостей и распечатать темы последних 10 статей:

source: To post an article from a binary file (this assumes that the article has valid headers, and that you have right to post on the particular newsgroup)::
ru: Чтобы опубликовать статью из двоичного файла (предполагается, что статья имеет допустимые заголовки и что у вас есть право публиковать сообщения в определенной группе новостей):

source: The module itself defines the following classes:
ru: Сам модуль определяет следующие классы:

source: Return a new :class:`NNTP` object, representing a connection to the NNTP server running on host *host*, listening at port *port*. An optional *timeout* can be specified for the socket connection. If the optional *user* and *password* are provided, or if suitable credentials are present in :file:`/.netrc` and the optional flag *usenetrc* is true, the ``AUTHINFO USER`` and ``AUTHINFO PASS`` commands are used to identify and authenticate the user to the server. If the optional flag *readermode* is true, then a ``mode reader`` command is sent before authentication is performed. Reader mode is sometimes necessary if you are connecting to an NNTP server on the local machine and intend to call reader-specific commands, such as ``group``. If you get unexpected :exc:`NNTPPermanentError`\ s, you might need to set *readermode*. The :class:`NNTP` class supports the :keyword:`with` statement to unconditionally consume :exc:`OSError` exceptions and to close the NNTP connection when done, e.g.:
ru: Возвращает новый объект :class:`NNTP`, представляющий соединение с NNTP-сервером, работающим на хосте *host* и прослушивающим порт *port*. Для соединения через сокет можно указать необязательный *тайм-аут*. Если указаны необязательные *user* и *password* или если подходящие учетные данные присутствуют в :file:`/.netrc` и необязательный флаг *usenetrc* имеет значение true, ``AUTHINFO USER`` и ``AUTHINFO PASS` `` Команды используются для идентификации и аутентификации пользователя на сервере. Если необязательный флаг *readermode* имеет значение true, то перед выполнением аутентификации отправляется команда ``mode Reader``. Режим чтения иногда необходим, если вы подключаетесь к NNTP-серверу на локальном компьютере и собираетесь вызывать команды, специфичные для чтения, такие как «группа». Если вы получаете неожиданные сообщения :exc:`NNTPPermanentError`\, вам может потребоваться установить *readermode*. Класс :class:`NNTP` поддерживает оператор :keyword:`with` для безусловного использования исключений :exc:`OSError` и закрытия NNTP-соединения после завершения, например:

source: Raises an :ref:`auditing event <auditing>` ``nntplib.connect`` with arguments ``self``, ``host``, ``port``.
ru: Вызывает событие аудита <auditing>` nntplib.connect`` с аргументами ``self``, ``host``, ``port``.

source: All commands will raise an :ref:`auditing event <auditing>` ``nntplib.putline`` with arguments ``self`` and ``line``, where ``line`` is the bytes about to be sent to the remote host.
ru: Все команды вызовут событие аудита <auditing>` nntplib.putline`` с аргументами ``self`` и ``line``, где ``line`` — это байты, которые будут отправлены в удаленный хост.

source: *usenetrc* is now ``False`` by default.
ru: *usenetrc* теперь по умолчанию имеет значение False.

source: Support for the :keyword:`with` statement was added.
ru: Добавлена ​​поддержка оператора :keyword:`with`.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket.
ru: Если параметр *timeout* установлен в нулевое значение, он вызовет :class:`ValueError`, чтобы предотвратить создание неблокирующего сокета.

source: Return a new :class:`NNTP_SSL` object, representing an encrypted connection to the NNTP server running on host *host*, listening at port *port*. :class:`NNTP_SSL` objects have the same methods as :class:`NNTP` objects. If *port* is omitted, port 563 (NNTPS) is used. *ssl_context* is also optional, and is a :class:`~ssl.SSLContext` object. Please read :ref:`ssl-security` for best practices. All other parameters behave the same as for :class:`NNTP`.
ru: Возвращает новый объект :class:`NNTP_SSL`, представляющий зашифрованное соединение с NNTP-сервером, работающим на хосте *host* и прослушивающим порт *port*. Объекты :class:`NNTP_SSL` имеют те же методы, что и объекты :class:`NNTP`. Если *port* опущен, используется порт 563 (NNTPS). *ssl_context* также не является обязательным и представляет собой объект :class:`~ssl.SSLContext`. Пожалуйста, прочтите :ref:`ssl-security` для получения лучших практик. Все остальные параметры ведут себя так же, как и для :class:`NNTP`.

source: Note that SSL-on-563 is discouraged per :rfc:`4642`, in favor of STARTTLS as described below. However, some servers only support the former.
ru: Обратите внимание, что использование SSL-on-563 не рекомендуется согласно :rfc:`4642` в пользу STARTTLS, как описано ниже. Однако некоторые серверы поддерживают только первое.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :data:`ssl.HAS_SNI`).
ru: Класс теперь поддерживает проверку имени хоста с помощью :attr:`ssl.SSLContext.check_hostname` и *Индикации имени сервера* (см. :data:`ssl.HAS_SNI`).

source: Derived from the standard exception :exc:`Exception`, this is the base class for all exceptions raised by the :mod:`nntplib` module. Instances of this class have the following attribute:
ru: Созданный из стандартного исключения :exc:`Exception`, это базовый класс для всех исключений, вызываемых модулем :mod:`nntplib`. Экземпляры этого класса имеют следующий атрибут:

source: The response of the server if available, as a :class:`str` object.
ru: Ответ сервера, если он доступен, в виде объекта :class:`str`.

source: Exception raised when an unexpected reply is received from the server.
ru: Исключение возникает при получении неожиданного ответа от сервера.

source: Exception raised when a response code in the range 400--499 is received.
ru: Исключение возникает при получении кода ответа в диапазоне 400–499.

source: Exception raised when a response code in the range 500--599 is received.
ru: Исключение возникает при получении кода ответа в диапазоне 500–599.

source: Exception raised when a reply is received from the server that does not begin with a digit in the range 1--5.
ru: Исключение возникает, когда от сервера получен ответ, который не начинается с цифры в диапазоне 1–5.

source: Exception raised when there is some error in the response data.
ru: Исключение возникает, когда в данных ответа есть ошибка.

source: NNTP Objects
ru: Объекты NNTP

source: When connected, :class:`NNTP` and :class:`NNTP_SSL` objects support the following methods and attributes.
ru: При подключении объекты :class:`NNTP` и :class:`NNTP_SSL` поддерживают следующие методы и атрибуты.

source: Attributes
ru: Атрибуты

source: An integer representing the version of the NNTP protocol supported by the server. In practice, this should be ``2`` for servers advertising :rfc:`3977` compliance and ``1`` for others.
ru: Целое число, представляющее версию протокола NNTP, поддерживаемую сервером. На практике это должно быть ``2`` для серверов, рекламирующих соответствие :rfc:`3977`, и ``1`` для остальных.

source: A string describing the software name and version of the NNTP server, or :const:`None` if not advertised by the server.
ru: Строка, описывающая имя программного обеспечения и версию NNTP-сервера или :const:`None`, если она не объявлена ​​сервером.

source: Methods
ru: Методы

source: The *response* that is returned as the first item in the return tuple of almost all methods is the server's response: a string beginning with a three-digit code. If the server's response indicates an error, the method raises one of the above exceptions.
ru: *Ответ*, который возвращается в качестве первого элемента в возвращаемом кортеже почти всех методов, является ответом сервера: строкой, начинающейся с трехзначного кода. Если ответ сервера указывает на ошибку, метод вызывает одно из вышеуказанных исключений.

source: Many of the following methods take an optional keyword-only argument *file*. When the *file* argument is supplied, it must be either a :term:`file object` opened for binary writing, or the name of an on-disk file to be written to. The method will then write any data returned by the server (except for the response line and the terminating dot) to the file; any list of lines, tuples or objects that the method normally returns will be empty.
ru: Многие из следующих методов принимают необязательный аргумент, содержащий только ключевое слово *file*. Когда указан аргумент *file*, он должен быть либо файловым объектом, открытым для двоичной записи, либо именем файла на диске, в который будет производиться запись. Затем метод запишет в файл любые данные, возвращаемые сервером (за исключением строки ответа и завершающей точки); любой список строк, кортежей или объектов, которые обычно возвращает метод, будет пустым.

source: Many of the following methods have been reworked and fixed, which makes them incompatible with their 3.1 counterparts.
ru: Многие из следующих методов были переработаны и исправлены, что делает их несовместимыми с аналогами из версии 3.1.

source: Send a ``QUIT`` command and close the connection. Once this method has been called, no other methods of the NNTP object should be called.
ru: Отправьте команду ``QUIT`` и закройте соединение. После вызова этого метода не следует вызывать никакие другие методы объекта NNTP.

source: Return the welcome message sent by the server in reply to the initial connection. (This message sometimes contains disclaimers or help information that may be relevant to the user.)
ru: Вернуть приветственное сообщение, отправленное сервером в ответ на первоначальное соединение. (Это сообщение иногда содержит заявления об отказе от ответственности или справочную информацию, которая может быть полезна пользователю.)

source: Return the :rfc:`3977` capabilities advertised by the server, as a :class:`dict` instance mapping capability names to (possibly empty) lists of values. On legacy servers which don't understand the ``CAPABILITIES`` command, an empty dictionary is returned instead.
ru: Возвращает возможности :rfc:`3977`, объявленные сервером, в виде имен возможностей сопоставления экземпляров :class:`dict` с (возможно, пустыми) списками значений. На устаревших серверах, которые не понимают команду CAPABILITIES, вместо этого возвращается пустой словарь.

source: Send ``AUTHINFO`` commands with the user name and password. If *user* and *password* are ``None`` and *usenetrc* is true, credentials from ``~/.netrc`` will be used if possible.
ru: Отправьте команды ``AUTHINFO`` с именем пользователя и паролем. Если *user* и *password* равны ``None`` и *usenetrc* имеет значение true, по возможности будут использоваться учетные данные из ``~/.netrc``.

source: Unless intentionally delayed, login is normally performed during the :class:`NNTP` object initialization and separately calling this function is unnecessary. To force authentication to be delayed, you must not set *user* or *password* when creating the object, and must set *usenetrc* to False.
ru: Если не было намеренной задержки, вход в систему обычно выполняется во время инициализации объекта :class:`NNTP`, и отдельный вызов этой функции не требуется. Чтобы принудительно отложить аутентификацию, вы не должны устанавливать *user* или *password* при создании объекта и должны установить для *usenetrc* значение False.

source: Send a ``STARTTLS`` command. This will enable encryption on the NNTP connection. The *context* argument is optional and should be a :class:`ssl.SSLContext` object. Please read :ref:`ssl-security` for best practices.
ru: Отправьте команду ``STARTTLS``. Это включит шифрование соединения NNTP. Аргумент *context* не является обязательным и должен быть объектом :class:`ssl.SSLContext`. Пожалуйста, прочтите :ref:`ssl-security` для получения лучших практик.

source: Note that this may not be done after authentication information has been transmitted, and authentication occurs by default if possible during a :class:`NNTP` object initialization. See :meth:`NNTP.login` for information on suppressing this behavior.
ru: Обратите внимание, что это невозможно сделать после того, как информация аутентификации была передана, и аутентификация происходит по умолчанию, если это возможно, во время инициализации объекта :class:`NNTP`. См. :meth:`NNTP.login` для получения информации о подавлении такого поведения.

source: The method now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :data:`ssl.HAS_SNI`).
ru: Этот метод теперь поддерживает проверку имени хоста с помощью :attr:`ssl.SSLContext.check_hostname` и *Индикации имени сервера* (см. :data:`ssl.HAS_SNI`).

source: Send a ``NEWGROUPS`` command. The *date* argument should be a :class:`datetime.date` or :class:`datetime.datetime` object. Return a pair ``(response, groups)`` where *groups* is a list representing the groups that are new since the given *date*. If *file* is supplied, though, then *groups* will be empty.
ru: Отправьте команду ``NEWGROUPS``. Аргумент *date* должен быть объектом :class:`datetime.date` или :class:`datetime.datetime`. Возвращает пару ``(response, groups)``, где *groups* — это список, представляющий группы, новые с указанной *даты*. Однако если указан *file*, *groups* будет пустым.

source: Send a ``NEWNEWS`` command. Here, *group* is a group name or ``'*'``, and *date* has the same meaning as for :meth:`newgroups`. Return a pair ``(response, articles)`` where *articles* is a list of message ids.
ru: Отправьте команду ``NEWNEWS``. Здесь *group* — это имя группы или ``'*'``, а *date* имеет то же значение, что и :meth:`newgroups`. Возвращает пару ``(ответ, статьи)``, где *articles* — это список идентификаторов сообщений.

source: This command is frequently disabled by NNTP server administrators.
ru: Эта команда часто отключается администраторами NNTP-серверов.

source: Send a ``LIST`` or ``LIST ACTIVE`` command. Return a pair ``(response, list)`` where *list* is a list of tuples representing all the groups available from this NNTP server, optionally matching the pattern string *group_pattern*. Each tuple has the form ``(group, last, first, flag)``, where *group* is a group name, *last* and *first* are the last and first article numbers, and *flag* usually takes one of these values:
ru: Отправьте команду LIST или LIST ACTIVE. Возвращает пару ``(response, list)``, где *list* — это список кортежей, представляющих все группы, доступные на этом NNTP-сервере, необязательно соответствующие строке шаблона *group_pattern*. Каждый кортеж имеет форму ``(group, Last, First, Flag)``, где *group* — имя группы, *last* и *first* — номера последней и первой статьи, а *flag* обычно принимает один из этих значений:

source: ``y``: Local postings and articles from peers are allowed.
ru: ``y``: разрешены локальные публикации и статьи от коллег.

source: ``m``: The group is moderated and all postings must be approved.
ru: ``m``: Группа модерируется, и все сообщения должны быть одобрены.

source: ``n``: No local postings are allowed, only articles from peers.
ru: ``n``: локальные публикации запрещены, только статьи от коллег.

source: ``j``: Articles from peers are filed in the junk group instead.
ru: ``j``: вместо этого статьи от коллег сохраняются в группе нежелательной почты.

source: ``x``: No local postings, and articles from peers are ignored.
ru: ``x``: локальные публикации не принимаются, а статьи от коллег игнорируются.

source: ``=foo.bar``: Articles are filed in the ``foo.bar`` group instead.
ru: ``=foo.bar``: вместо этого статьи сохраняются в группе ``foo.bar``.

source: If *flag* has another value, then the status of the newsgroup should be considered unknown.
ru: Если *flag* имеет другое значение, то статус группы новостей следует считать неизвестным.

source: This command can return very large results, especially if *group_pattern* is not specified. It is best to cache the results offline unless you really need to refresh them.
ru: Эта команда может возвращать очень большие результаты, особенно если не указан *group_pattern*. Лучше всего кэшировать результаты в автономном режиме, если вам действительно не нужно их обновлять.

source: *group_pattern* was added.
ru: Был добавлен *group_pattern*.

source: Send a ``LIST NEWSGROUPS`` command, where *grouppattern* is a wildmat string as specified in :rfc:`3977` (it's essentially the same as DOS or UNIX shell wildcard strings). Return a pair ``(response, descriptions)``, where *descriptions* is a dictionary mapping group names to textual descriptions.
ru: Отправьте команду LIST NEWSGROUPS, где *grouppattern* — это подстановочная строка, как указано в :rfc:`3977` (по сути, это то же самое, что и подстановочные строки оболочки DOS или UNIX). Возвращает пару ``(ответ, описания)``, где *descriptions* — это словарь, сопоставляющий имена групп с текстовыми описаниями.

source: Get a description for a single group *group*. If more than one group matches (if 'group' is a real wildmat string), return the first match. If no group matches, return an empty string.
ru: Получите описание для одной группы *group*. Если совпадает более одной группы (если «группа» является настоящей строкой подстановочного знака), верните первое совпадение. Если ни одна группа не соответствует, верните пустую строку.

source: This elides the response code from the server. If the response code is needed, use :meth:`descriptions`.
ru: Это исключает код ответа с сервера. Если необходим код ответа, используйте :meth:`descriptions`.

source: Send a ``GROUP`` command, where *name* is the group name. The group is selected as the current group, if it exists. Return a tuple ``(response, count, first, last, name)`` where *count* is the (estimated) number of articles in the group, *first* is the first article number in the group, *last* is the last article number in the group, and *name* is the group name.
ru: Отправьте команду GROUP, где *name* — имя группы. Группа выбирается в качестве текущей группы, если она существует. Возвращает кортеж ``(response, count, first, Last, name)``, где *count* — это (оценочное) количество статей в группе, *first* — это первый номер статьи в группе, *last* — это последний номер товара в группе, а *имя* — это имя группы.

source: Send an ``OVER`` command, or an ``XOVER`` command on legacy servers. *message_spec* can be either a string representing a message id, or a ``(first, last)`` tuple of numbers indicating a range of articles in the current group, or a ``(first, None)`` tuple indicating a range of articles starting from *first* to the last article in the current group, or :const:`None` to select the current article in the current group.
ru: Отправьте команду OVER или команду XOVER на устаревших серверах. *message_spec* может быть либо строкой, представляющей идентификатор сообщения, либо кортежем чисел ``(first, Last)``, указывающим диапазон статей в текущей группе, либо кортежем ``(first, None)``, указывающим диапазон статей, начиная с *первой* до последней статьи в текущей группе, или :const:`None`, чтобы выбрать текущую статью в текущей группе.

source: Return a pair ``(response, overviews)``. *overviews* is a list of ``(article_number, overview)`` tuples, one for each article selected by *message_spec*. Each *overview* is a dictionary with the same number of items, but this number depends on the server. These items are either message headers (the key is then the lower-cased header name) or metadata items (the key is then the metadata name prepended with ``":"``). The following items are guaranteed to be present by the NNTP specification:
ru: Верните пару ``(ответ, обзоры)``. *overviews* — это список кортежей ``(article_number, review)``, по одному для каждой статьи, выбранной *message_spec*. Каждый *обзор* представляет собой словарь с одинаковым количеством элементов, но это количество зависит от сервера. Эти элементы представляют собой либо заголовки сообщений (в этом случае ключ представляет собой имя заголовка в нижнем регистре), либо элементы метаданных (в этом случае ключ представляет собой имя метаданных, к которому добавляется ``":"``). Спецификация NNTP гарантирует наличие следующих элементов:

source: the ``subject``, ``from``, ``date``, ``message-id`` and ``references`` headers
ru: заголовки ``subject``, ``from``, ``date``, ``message-id`` и ``references``

source: the ``:bytes`` metadata: the number of bytes in the entire raw article (including headers and body)
ru: метаданные ``:bytes``: количество байтов во всей необработанной статье (включая заголовки и тело)

source: the ``:lines`` metadata: the number of lines in the article body
ru: метаданные ``:lines``: количество строк в теле статьи.

source: The value of each item is either a string, or :const:`None` if not present.
ru: Значением каждого элемента является либо строка, либо :const:`None`, если оно отсутствует.

source: It is advisable to use the :func:`decode_header` function on header values when they may contain non-ASCII characters::
ru: Целесообразно использовать функцию :func:`decode_header` для значений заголовков, если они могут содержать символы, отличные от ASCII:

source: Send a ``HELP`` command. Return a pair ``(response, list)`` where *list* is a list of help strings.
ru: Отправьте команду ``HELP``. Возвращает пару ``(response, list)``, где *list* — это список справочных строк.
