Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/nntplib.po
Languages: ru

source: Send a ``STAT`` command, where *message_spec* is either a message id (enclosed in ``'<'`` and ``'>'``) or an article number in the current group. If *message_spec* is omitted or :const:`None`, the current article in the current group is considered. Return a triple ``(response, number, id)`` where *number* is the article number and *id* is the message id.
ru: Отправьте команду ``STAT``, где *message_spec* — это либо идентификатор сообщения (заключенный в ``'<'`` и ``'>'``), либо номер статьи в текущей группе. Если *message_spec* опущено или :const:`None`, учитывается текущая статья в текущей группе. Возвращает тройку ``(ответ, номер, идентификатор)``, где *number* — номер статьи, а *id* — идентификатор сообщения.

source: Send a ``NEXT`` command. Return as for :meth:`.stat`.
ru: Отправьте команду ``NEXT``. Возврат как для :meth:`.stat`.

source: Send a ``LAST`` command. Return as for :meth:`.stat`.
ru: Отправьте команду ``LAST``. Возврат как для :meth:`.stat`.

source: Send an ``ARTICLE`` command, where *message_spec* has the same meaning as for :meth:`.stat`. Return a tuple ``(response, info)`` where *info* is a :class:`~collections.namedtuple` with three attributes *number*, *message_id* and *lines* (in that order). *number* is the article number in the group (or 0 if the information is not available), *message_id* the message id as a string, and *lines* a list of lines (without terminating newlines) comprising the raw message including headers and body.
ru: Отправьте команду ``ARTICLE``, где *message_spec* имеет то же значение, что и :meth:`.stat`. Возвращает кортеж ``(response, info)``, где *info* — это :class:`~collections.namedtuple` с тремя атрибутами *number*, *message_id* и *lines* (в указанном порядке). *number* — это номер статьи в группе (или 0, если информация недоступна), *message_id* идентификатор сообщения в виде строки и *lines* список строк (без завершающих символов новой строки), содержащих необработанное сообщение, включая заголовки. и тело.

source: Same as :meth:`article`, but sends a ``HEAD`` command. The *lines* returned (or written to *file*) will only contain the message headers, not the body.
ru: То же, что :meth:`article`, но отправляет команду ``HEAD``. Возвращенные *строки* (или записанные в *файл*) будут содержать только заголовки сообщений, а не тело.

source: Same as :meth:`article`, but sends a ``BODY`` command. The *lines* returned (or written to *file*) will only contain the message body, not the headers.
ru: То же, что и :meth:`article`, но отправляет команду ``BODY``. Возвращенные *строки* (или записанные в *файл*) будут содержать только тело сообщения, а не заголовки.

source: Post an article using the ``POST`` command. The *data* argument is either a :term:`file object` opened for binary reading, or any iterable of bytes objects (representing raw lines of the article to be posted). It should represent a well-formed news article, including the required headers. The :meth:`post` method automatically escapes lines beginning with ``.`` and appends the termination line.
ru: Опубликуйте статью с помощью команды POST. Аргумент *data* представляет собой либо файловый объект, открытый для двоичного чтения, либо любой итерируемый байтовый объект (представляющий необработанные строки публикуемой статьи). Он должен представлять собой правильно оформленную новостную статью, включая необходимые заголовки. Метод :meth:`post` автоматически экранирует строки, начинающиеся с ``.``, и добавляет строку завершения.

source: If the method succeeds, the server's response is returned. If the server refuses posting, a :class:`NNTPReplyError` is raised.
ru: Если метод успешен, возвращается ответ сервера. Если сервер отказывается отправлять сообщения, возникает ошибка :class:`NNTPReplyError`.

source: Send an ``IHAVE`` command. *message_id* is the id of the message to send to the server (enclosed in ``'<'`` and ``'>'``). The *data* parameter and the return value are the same as for :meth:`post`.
ru: Отправьте команду ``IHAVE``. *message_id* — это идентификатор сообщения, которое необходимо отправить на сервер (заключенный в ``'<'`` и ``'>'``). Параметр *data* и возвращаемое значение такие же, как и для :meth:`post`.

source: Return a pair ``(response, date)``. *date* is a :class:`~datetime.datetime` object containing the current date and time of the server.
ru: Верните пару ``(ответ, дата)``. *date* — это объект :class:`~datetime.datetime`, содержащий текущую дату и время сервера.

source: Send a ``SLAVE`` command. Return the server's *response*.
ru: Отправьте команду ``SLAVE``. Верните *ответ* сервера.

source: Set the instance's debugging level. This controls the amount of debugging output printed. The default, ``0``, produces no debugging output. A value of ``1`` produces a moderate amount of debugging output, generally a single line per request or response. A value of ``2`` or higher produces the maximum amount of debugging output, logging each line sent and received on the connection (including message text).
ru: Установите уровень отладки экземпляра. Это контролирует количество выводимых отладочных данных. Значение по умолчанию, ``0``, не выдает никаких отладочных данных. Значение «1» создает умеренный объем отладочной информации, обычно одну строку на запрос или ответ. Значение ``2`` или выше обеспечивает максимальный объем отладочной информации, регистрируя каждую строку, отправленную и полученную по соединению (включая текст сообщения).

source: The following are optional NNTP extensions defined in :rfc:`2980`. Some of them have been superseded by newer commands in :rfc:`3977`.
ru: Ниже приведены дополнительные расширения NNTP, определенные в :rfc:`2980`. Некоторые из них были заменены новыми командами в :rfc:`3977`.

source: Send an ``XHDR`` command. The *hdr* argument is a header keyword, e.g. ``'subject'``. The *str* argument should have the form ``'first-last'`` where *first* and *last* are the first and last article numbers to search. Return a pair ``(response, list)``, where *list* is a list of pairs ``(id, text)``, where *id* is an article number (as a string) and *text* is the text of the requested header for that article. If the *file* parameter is supplied, then the output of the ``XHDR`` command is stored in a file. If *file* is a string, then the method will open a file with that name, write to it then close it. If *file* is a :term:`file object`, then it will start calling :meth:`write` on it to store the lines of the command output. If *file* is supplied, then the returned *list* is an empty list.
ru: Отправьте команду XHDR. Аргумент *hdr* является ключевым словом заголовка, например ``'subject'``. Аргумент *str* должен иметь форму ``'first-last'``, где *first* и *last* — это первый и последний номера статей для поиска. Возвращает пару ``(response, list)``, где *list* — это список пар ``(id, text)``, где *id* – номер статьи (в виде строки), а *text* – это текст запрошенного заголовка для этой статьи. Если указан параметр *file*, то выходные данные команды XHDR сохраняются в файле. Если *file* — это строка, метод откроет файл с таким именем, запишет в него запись и закроет. Если *file* является :term:`файловым объектом`, то он начнет вызывать :meth:`write` для сохранения строк вывода команды. Если указан *file*, то возвращаемый *list* является пустым списком.

source: Send an ``XOVER`` command. *start* and *end* are article numbers delimiting the range of articles to select. The return value is the same of for :meth:`over`. It is recommended to use :meth:`over` instead, since it will automatically use the newer ``OVER`` command if available.
ru: Отправьте команду ``XOVER``. *start* и *end* — номера статей, ограничивающие диапазон выбираемых статей. Возвращаемое значение такое же, как и для :meth:`over`. Вместо этого рекомендуется использовать :meth:`over`, поскольку он автоматически будет использовать более новую команду ``OVER``, если она доступна.

source: Utility functions
ru: Функции полезности

source: The module also defines the following utility function:
ru: Модуль также определяет следующую служебную функцию:

source: Decode a header value, un-escaping any escaped non-ASCII characters. *header_str* must be a :class:`str` object. The unescaped value is returned. Using this function is recommended to display some headers in a human readable form::
ru: Декодируйте значение заголовка, не экранируя любые экранированные символы, отличные от ASCII. *header_str* должен быть объектом :class:`str`. Возвращается неэкранированное значение. Использование этой функции рекомендуется для отображения некоторых заголовков в удобочитаемой форме::

source: protocol
ru: протокол

source: Network News Transfer Protocol
ru: Протокол передачи сетевых новостей
