Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/os.path.po
Languages: pt_pt, sv

source: This function approximates rules for reserved paths on most Windows systems. These rules change over time in various Windows releases. This function may be updated in future Python releases as changes to the rules become broadly available.
pt_pt: Esta função aproxima as regras para caminhos reservados na maioria dos sistemas Windows. Estas regras mudam ao longo do tempo em várias versões do Windows. Esta função pode ser atualizada em futuras versões do Python à medida que as alterações às regras se tornem amplamente disponíveis.

source: Availability
pt_pt: Disponibilidade

source: Accepts a :term:`path-like object` for *path* and *paths*.
pt_pt: Aceita um :term:`objeto semelhante a um caminho` para *path* e *paths*.
sv: Accepterar en :term:`path-like object` för *path* och *paths*.

source: Normalize the case of a pathname. On Windows, convert all characters in the pathname to lowercase, and also convert forward slashes to backward slashes. On other operating systems, return the path unchanged.
pt_pt: Normaliza a capitalização de um caminho. No Windows, converte todos os caracteres do caminho para minúsculas e também converte barras para a frente em barras invertidas. Noutros sistemas operativos, devolve o caminho inalterado.
sv: Normalisera versalerna i ett sökvägsnamn. I Windows konverterar du alla tecken i sökvägsnamnet till gemener och konverterar även snedstreck framåt till snedstreck bakåt. På andra operativsystem returneras sökvägen oförändrad.

source: Normalize a pathname by collapsing redundant separators and up-level references so that ``A//B``, ``A/B/``, ``A/./B`` and ``A/foo/../B`` all become ``A/B``. This string manipulation may change the meaning of a path that contains symbolic links. On Windows, it converts forward slashes to backward slashes. To normalize case, use :func:`normcase`.
pt_pt: Normaliza um caminho, eliminando separadores redundantes e referências a níveis superiores, de modo que ``A//B``, ``A/B/``, ``A/./B`` e ``A/foo/../B`` se tornem ``A/B``. Esta manipulação de strings pode alterar o significado de um caminho que contenha ligações simbólicas. No Windows, converte barras para a frente em barras invertidas. Para normalizar a capitalização, use :func:`normcase`.
sv: Normalisera ett sökvägsnamn genom att kollapsa överflödiga separatorer och referenser på högre nivåer så att ``A//B``, ``A/B/``, ``A/./B`` och ``A/foo/../B`` alla blir ``A/B``. Denna strängmanipulation kan ändra betydelsen av en sökväg som innehåller symboliska länkar. I Windows konverteras snedstreck framåt till snedstreck bakåt. Använd :func:`normcase` om du vill normalisera teckenföljden.

source: On POSIX systems, in accordance with `IEEE Std 1003.1 2013 Edition; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_, if a pathname begins with exactly two slashes, the first component following the leading characters may be interpreted in an implementation-defined manner, although more than two leading characters shall be treated as a single character.
pt_pt: Nos sistemas POSIX, de acordo com `IEEE Std 1003.1 2013 Edition; 4.13 Resolução de Caminhos <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_, se um caminho começar com exatamente duas barras, o primeiro componente a seguir aos caracteres iniciais pode ser interpretado de uma forma definida pela implementação, embora mais de duas barras iniciais devam ser tratadas como um único caracter.
sv: På POSIX-system, i enlighet med `IEEE Std 1003.1 2013 Edition; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_, om ett sökvägsnamn börjar med exakt två snedstreck, kan den första komponenten efter de inledande tecknen tolkas på ett implementationsdefinierat sätt, även om mer än två inledande tecken ska behandlas som ett enda tecken.

source: Return the canonical path of the specified filename, eliminating any symbolic links encountered in the path (if they are supported by the operating system). On Windows, this function will also resolve MS-DOS (also called 8.3) style names such as ``C:\\PROGRA~1`` to ``C:\\Program Files``.
pt_pt: Devolve o caminho canónico do nome de ficheiro especificado, eliminando quaisquer ligações simbólicas encontradas no caminho (se forem suportadas pelo sistema operativo). No Windows, esta função também resolve nomes no estilo MS-DOS (também chamados 8.3) como ``C:\\PROGRA~1`` para ``C:\\Program Files``.

source: By default, the path is evaluated up to the first component that does not exist, is a symlink loop, or whose evaluation raises :exc:`OSError`. All such components are appended unchanged to the existing part of the path.
pt_pt: Por predefinição, o caminho é avaliado até ao primeiro componente que não exista, seja um ciclo de ligação simbólica, ou cuja avaliação lance :exc:`OSError`. Todos esses componentes são anexados inalterados à parte existente do caminho.
sv: Som standard utvärderas sökvägen fram till den första komponent som inte finns, som är en symlänk-loop eller vars utvärdering ger upphov till :exc:`OSError`. Alla sådana komponenter läggs till oförändrade till den befintliga delen av sökvägen.

source: Some errors that are handled this way include "access denied", "not a directory", or "bad argument to internal function". Thus, the resulting path may be missing or inaccessible, may still contain links or loops, and may traverse non-directories.
pt_pt: Alguns erros tratados desta forma incluem "acesso negado", "não é um diretório" ou "argumento inválido para função interna". Assim, o caminho resultante pode estar em falta ou ser inacessível, pode ainda conter ligações ou ciclos e pode atravessar não-diretórios.
sv: Några fel som hanteras på det här sättet är "åtkomst nekad", "inte en katalog" eller "dåligt argument till intern funktion". Den resulterande sökvägen kan alltså saknas eller vara otillgänglig, kan fortfarande innehålla länkar eller loopar och kan korsa icke-kataloger.

source: This behavior can be modified by keyword arguments:
pt_pt: Este comportamento pode ser modificado por argumentos de palavra-chave:
sv: Detta beteende kan ändras med hjälp av nyckelordsargument:

source: If *strict* is ``True``, the first error encountered when evaluating the path is re-raised. In particular, :exc:`FileNotFoundError` is raised if *path* does not exist, or another :exc:`OSError` if it is otherwise inaccessible.
pt_pt: Se *strict* for ``True``, o primeiro erro encontrado ao avaliar o caminho é relançado. Em particular, :exc:`FileNotFoundError` é lançado se *path* não existir, ou outro :exc:`OSError` se for de outra forma inacessível.
sv: Om *strict* är ``True``, kommer det första felet som uppstår när sökvägen utvärderas att visas igen. I synnerhet :exc:`FileNotFoundError` om *sökväg* inte finns, eller ett annat :exc:`OSError` om den på annat sätt är otillgänglig.

source: If *strict* is :py:data:`os.path.ALLOW_MISSING`, errors other than :exc:`FileNotFoundError` are re-raised (as with ``strict=True``). Thus, the returned path will not contain any symbolic links, but the named file and some of its parent directories may be missing.
pt_pt: Se *strict* for :py:data:`os.path.ALLOW_MISSING`, erros diferentes de :exc:`FileNotFoundError` são relançados (como com ``strict=True``). Assim, o caminho devolvido não conterá ligações simbólicas, mas o ficheiro nomeado e alguns dos seus diretórios pai podem estar em falta.
sv: Om *strict* är :py:data:`os.path.ALLOW_MISSING`, kommer andra fel än :exc:`FileNotFoundError` att visas igen (som med ``strict=True``). Den returnerade sökvägen kommer alltså inte att innehålla några symboliska länkar, men den namngivna filen och några av dess överordnade kataloger kan saknas.

source: This function emulates the operating system's procedure for making a path canonical, which differs slightly between Windows and UNIX with respect to how links and subsequent path components interact.
pt_pt: Esta função emula o procedimento do sistema operativo para tornar um caminho canónico, que difere ligeiramente entre Windows e UNIX no que diz respeito a como as ligações e os componentes subsequentes do caminho interagem.
sv: Den här funktionen emulerar operativsystemets procedur för att göra en sökväg kanonisk, som skiljer sig något mellan Windows och UNIX när det gäller hur länkar och efterföljande sökvägskomponenter interagerar.

source: Operating system APIs make paths canonical as needed, so it's not normally necessary to call this function.
pt_pt: As APIs do sistema operativo tornam os caminhos canónicos conforme necessário, por isso não é normalmente necessário chamar esta função.
sv: Operativsystemets API:er gör sökvägar kanoniska efter behov, så det är normalt inte nödvändigt att anropa den här funktionen.

source: Symbolic links and junctions are now resolved on Windows.
pt_pt: Ligações simbólicas e junções são agora resolvidas no Windows.
sv: Symboliska länkar och korsningar löses nu i Windows.

source: The *strict* parameter was added.
pt_pt: O parâmetro *strict* foi adicionado.
sv: Parametern *strict* lades till.

source: The :py:data:`~os.path.ALLOW_MISSING` value for the *strict* parameter was added.
pt_pt: O valor :py:data:`~os.path.ALLOW_MISSING` para o parâmetro *strict* foi adicionado.
sv: Värdet :py:data:`~os.path.ALLOW_MISSING` för parametern *strict* har lagts till.

source: Special value used for the *strict* argument in :func:`realpath`.
pt_pt: Valor especial usado para o argumento *strict* em :func:`realpath`.
sv: Specialvärde som används för *strict*-argumentet i :func:`realpath`.

source: Return a relative filepath to *path* either from the current directory or from an optional *start* directory. This is a path computation: the filesystem is not accessed to confirm the existence or nature of *path* or *start*. On Windows, :exc:`ValueError` is raised when *path* and *start* are on different drives.
pt_pt: Devolve um caminho de ficheiro relativo para *path*, a partir do diretório atual ou de um diretório *start* opcional. Isto é um cálculo de caminho: o sistema de ficheiros não é acedido para confirmar a existência ou natureza de *path* ou *start*. No Windows, :exc:`ValueError` é lançado quando *path* e *start* estão em unidades diferentes.
sv: Returnerar en relativ filväg till *väg* antingen från den aktuella katalogen eller från en valfri *start*-katalog. Detta är en sökvägsberäkning: filsystemet används inte för att bekräfta existensen av eller typen av *sökväg* eller *start*. I Windows genereras :exc:`ValueError` när *sökväg* och *start* finns på olika enheter.

source: *start* defaults to :data:`os.curdir`.
pt_pt: *start* por predefinição é :data:`os.curdir`.
sv: *start* är standardvärdet för :data:`os.curdir`.

source: Return ``True`` if both pathname arguments refer to the same file or directory. This is determined by the device number and i-node number and raises an exception if an :func:`os.stat` call on either pathname fails.
pt_pt: Devolve ``True`` se ambos os argumentos de caminho se referirem ao mesmo ficheiro ou diretório. Isto é determinado pelo número do dispositivo e número do i-nó, e lança uma exceção se uma chamada :func:`os.stat` em qualquer um dos caminhos falhar.
sv: Returnerar ``True`` om båda sökvägsargumenten hänvisar till samma fil eller katalog. Detta bestäms av enhetsnumret och i-nod-numret och ger upphov till ett undantag om ett :func:`os.stat`\-anrop på något av sökvägsnamnen misslyckas.

source: Added Windows support.
pt_pt: Adicionado suporte para Windows.
sv: Stöd för Windows har lagts till.

source: Windows now uses the same implementation as all other platforms.
pt_pt: O Windows agora usa a mesma implementação que todas as outras plataformas.
sv: Windows använder nu samma implementering som alla andra plattformar.

source: Return ``True`` if the file descriptors *fp1* and *fp2* refer to the same file.
pt_pt: Devolve ``True`` se os descritores de ficheiro *fp1* e *fp2* se referirem ao mesmo ficheiro.
sv: Returnerar ``True`` om filbeskrivarna *fp1* och *fp2* hänvisar till samma fil.

source: Return ``True`` if the stat tuples *stat1* and *stat2* refer to the same file. These structures may have been returned by :func:`os.fstat`, :func:`os.lstat`, or :func:`os.stat`. This function implements the underlying comparison used by :func:`samefile` and :func:`sameopenfile`.
pt_pt: Devolve ``True`` se os tuplos *stat1* e *stat2* se referirem ao mesmo ficheiro. Estas estruturas podem ter sido devolvidas por :func:`os.fstat`, :func:`os.lstat` ou :func:`os.stat`. Esta função implementa a comparação subjacente usada por :func:`samefile` e :func:`sameopenfile`.
sv: Returnerar ``True`` om stat-tuplerna *stat1* och *stat2* refererar till samma fil. Dessa strukturer kan ha returnerats av :func:`os.fstat`, :func:`os.lstat`, eller :func:`os.stat`. Denna funktion implementerar den underliggande jämförelse som används av :func:`samefile` och :func:`sameopenfile`.

source: Split the pathname *path* into a pair ``(drive, tail)`` where *drive* is either a mount point or the empty string. On systems which do not use drive specifications, *drive* will always be the empty string. In all cases, ``drive + tail`` will be the same as *path*.
pt_pt: Divide o caminho *path* num par ``(drive, tail)``, onde *drive* é um ponto de montagem ou uma string vazia. Em sistemas que não usam especificações de unidade, *drive* será sempre uma string vazia. Em todos os casos, ``drive + tail`` será o mesmo que *path*.
sv: Dela upp sökvägsnamnet *path* i ett par ``(drive, tail)`` där *drive* antingen är en monteringspunkt eller den tomma strängen. På system som inte använder enhetsspecifikationer kommer *drive* alltid att vara den tomma strängen. I samtliga fall kommer ``drive + tail`` att vara samma sak som *path*.

source: On Windows, splits a pathname into drive/UNC sharepoint and relative path.
pt_pt: No Windows, divide um caminho em unidade/ponto de partilha UNC e caminho relativo.
sv: I Windows delas ett söknamn upp i enhet/UNC sharepoint och relativ sökväg.

source: If the path contains a drive letter, drive will contain everything up to and including the colon::
pt_pt: Se o caminho contiver uma letra de unidade, *drive* conterá tudo até e incluindo os dois pontos::
sv: Om sökvägen innehåller en enhetsbeteckning kommer enheten att innehålla allt till och med kolon::

source: If the path contains a UNC path, drive will contain the host name and share::
pt_pt: Se o caminho contiver um caminho UNC, *drive* conterá o nome do anfitrião e a partilha::

source: Split the pathname *path* into a 3-item tuple ``(drive, root, tail)`` where *drive* is a device name or mount point, *root* is a string of separators after the drive, and *tail* is everything after the root. Any of these items may be the empty string. In all cases, ``drive + root + tail`` will be the same as *path*.
pt_pt: Divide o caminho *path* num tuplo de 3 itens ``(drive, root, tail)``, onde *drive* é um nome de dispositivo ou ponto de montagem, *root* é uma string de separadores após a unidade, e *tail* é tudo após a raiz. Qualquer um destes itens pode ser uma string vazia. Em todos os casos, ``drive + root + tail`` será o mesmo que *path*.

source: On POSIX systems, *drive* is always empty. The *root* may be empty (if *path* is relative), a single forward slash (if *path* is absolute), or two forward slashes (implementation-defined per `IEEE Std 1003.1-2017; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_.) For example::
pt_pt: Nos sistemas POSIX, *drive* está sempre vazio. A *root* pode estar vazia (se *path* for relativo), ser uma barra para a frente única (se *path* for absoluto), ou duas barras para a frente (definido pela implementação de acordo com `IEEE Std 1003.1-2017; 4.13 Resolução de Caminhos <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_). Por exemplo::

source: On Windows, *drive* may be empty, a drive-letter name, a UNC share, or a device name. The *root* may be empty, a forward slash, or a backward slash. For example::
pt_pt: No Windows, *drive* pode estar vazio, ser um nome de letra de unidade, uma partilha UNC ou um nome de dispositivo. A *root* pode estar vazia, ser uma barra para a frente ou uma barra invertida. Por exemplo::

source: Split the pathname *path* into a pair ``(root, ext)`` such that ``root + ext == path``, and the extension, *ext*, is empty or begins with a period and contains at most one period.
pt_pt: Divide o caminho *path* num par ``(root, ext)``, de modo que ``root + ext == path``, e a extensão, *ext*, está vazia ou começa com um ponto e contém no máximo um ponto.
sv: Dela upp sökvägsnamnet *sökväg* i ett par ``(rot, ext)`` så att ``rot + ext == sökväg``, och tillägget, *ext*, är tomt eller börjar med en punkt och innehåller högst en punkt.

source: If the path contains no extension, *ext* will be ``''``::
pt_pt: Se o caminho não contiver extensão, *ext* será ``''``::
sv: Om sökvägen inte innehåller något tillägg kommer *ext* att vara ``''``::

source: If the path contains an extension, then *ext* will be set to this extension, including the leading period. Note that previous periods will be ignored::
pt_pt: Se o caminho contiver uma extensão, então *ext* será definido para essa extensão, incluindo o ponto inicial. Note que os pontos anteriores serão ignorados::
sv: Om sökvägen innehåller en förlängning, kommer *ext* att sättas till denna förlängning, inklusive den inledande punkten. Observera att tidigare perioder ignoreras::

source: Leading periods of the last component of the path are considered to be part of the root::
pt_pt: Os pontos iniciais do último componente do caminho são considerados parte da raiz::
sv: Ledande perioder av den sista komponenten i sökvägen anses vara en del av roten::

source: ``True`` if arbitrary Unicode strings can be used as file names (within limitations imposed by the file system).
pt_pt: ``True`` se strings Unicode arbitrárias podem ser usadas como nomes de ficheiros (dentro dos limites impostos pelo sistema de ficheiros).
sv: ``True`` om godtyckliga Unicode-strängar kan användas som filnamn (inom de begränsningar som gäller för filsystemet).

source: path
pt_pt: caminho

source: operations
pt_pt: operações

source: ~ (tilde)
pt_pt: ~ (til)

source: home directory expansion
pt_pt: expansão do diretório *home*
sv: utökning av hemkatalog

source: module
pt_pt: módulo

source: $ (dollar)
pt_pt: $ (dólar)

source: environment variables expansion
pt_pt: expansão de variáveis de ambiente
sv: miljövariabler expansion

source: % (percent)
pt_pt: % (percentagem)
sv: % (procent)

source: environment variables expansion (Windows)
pt_pt: expansão de variáveis de ambiente (Windows)
sv: utökning av miljövariabler (Windows)

source: Return a normalized absolutized version of the pathname *path*. On most platforms, this is equivalent to calling the function :func:`normpath` as follows: ``normpath(join(os.getcwd(), path))``.
sv: Returnerar en normaliserad absolutiserad version av sökvägsnamnet *path*. På de flesta plattformar är detta likvärdigt med att anropa funktionen :func:`normpath` enligt följande: ``normpath(join(os.getcwd(), path))``.

source: Join one or more path segments intelligently. The return value is the concatenation of *path* and all members of *\*paths*, with exactly one directory separator following each non-empty part, except the last. That is, the result will only end in a separator if the last part is either empty or ends in a separator. If a segment is an absolute path (which on Windows requires both a drive and a root), then all previous segments are ignored and joining continues from the absolute path segment.
sv: Sammanfoga ett eller flera sökvägssegment på ett intelligent sätt. Returvärdet är sammankopplingen av *path* och alla medlemmar av *\*paths*, med exakt en katalogseparator efter varje icke-tom del, utom den sista. Det vill säga att resultatet bara slutar med en separator om den sista delen antingen är tom eller slutar med en separator. Om ett segment är en absolut sökväg (vilket i Windows kräver både en enhet och en rot) ignoreras alla tidigare segment och sammanfogningen fortsätter från det absoluta sökvägssegmentet.

source: On Windows, the drive is not reset when a rooted path segment (e.g., ``r'\foo'``) is encountered. If a segment is on a different drive or is an absolute path, all previous segments are ignored and the drive is reset. Note that since there is a current directory for each drive, ``os.path.join("c:", "foo")`` represents a path relative to the current directory on drive :file:`C:` (:file:`c:foo`), not :file:`c:\\foo`.
sv: I Windows återställs inte enheten när ett rotat sökvägssegment (t.ex. ``r'\foo'``) påträffas. Om ett segment ligger på en annan enhet eller är en absolut sökväg ignoreras alla tidigare segment och enheten återställs. Observera att eftersom det finns en aktuell katalog för varje enhet, representerar ``os.path.join("c:", "foo")`` en sökväg relativt till den aktuella katalogen på enheten :file:`C:` (:file:`c:foo`), inte :file:`c:\\foo`.

source: Split the pathname *path* into a pair, ``(head, tail)`` where *tail* is the last pathname component and *head* is everything leading up to that. The *tail* part will never contain a slash; if *path* ends in a slash, *tail* will be empty. If there is no slash in *path*, *head* will be empty. If *path* is empty, both *head* and *tail* are empty. Trailing slashes are stripped from *head* unless it is the root (one or more slashes only). In all cases, ``join(head, tail)`` returns a path to the same location as *path* (but the strings may differ). Also see the functions :func:`dirname` and :func:`basename`.
sv: Dela upp sökvägsnamnet *sökväg* i ett par, ``(huvud, svans)`` där *svans* är den sista sökvägskomponenten och *huvud* är allt som leder fram till den. *tail*-delen kommer aldrig att innehålla ett snedstreck; om *path* slutar med ett snedstreck kommer *tail* att vara tomt. Om det inte finns något snedstreck i *path* kommer *head* att vara tom. Om *sökväg* är tom, är både *huvud* och *svans* tomma. Efterföljande snedstreck tas bort från *head* om det inte är roten (endast ett eller flera snedstreck). I samtliga fall returnerar ``join(head, tail)`` en sökväg till samma plats som *path* (men strängarna kan skilja sig åt). Se även funktionerna :func:`dirname` och :func:`basename`.
