Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/os.path.po
Languages: pt_pt, sv

source: :mod:`!os.path` --- Common pathname manipulations
pt_pt: :mod:`!os.path` --- Manipulações comuns de caminhos

source: **Source code:** :source:`Lib/genericpath.py`, :source:`Lib/posixpath.py` (for POSIX) and :source:`Lib/ntpath.py` (for Windows).
pt_pt: **Código-fonte:** :source:`Lib/genericpath.py`, :source:`Lib/posixpath.py` (para POSIX) e :source:`Lib/ntpath.py` (para Windows).

source: This module implements some useful functions on pathnames. To read or write files see :func:`open`, and for accessing the filesystem see the :mod:`os` module. The path parameters can be passed as strings, or bytes, or any object implementing the :class:`os.PathLike` protocol.
pt_pt: Este módulo implementa algumas funções úteis para manipular caminhos. Para ler ou escrever ficheiros, consulte :func:`open`, e para aceder ao sistema de ficheiros, consulte o módulo :mod:`os`. Os parâmetros de caminho podem ser passados como strings, bytes, ou qualquer objeto que implemente o protocolo :class:`os.PathLike`.
sv: Den här modulen implementerar några användbara funktioner för sökvägsnamn. För att läsa eller skriva filer se :func:`open`, och för åtkomst till filsystemet se :mod:`os`\-modulen. Sökvägsparametrarna kan skickas som strängar, bytes eller objekt som implementerar :class:`os.PathLike`\-protokollet.

source: Unlike a Unix shell, Python does not do any *automatic* path expansions. Functions such as :func:`expanduser` and :func:`expandvars` can be invoked explicitly when an application desires shell-like path expansion. (See also the :mod:`glob` module.)
pt_pt: Ao contrário de uma *shell* Unix, o Python não faz expansões de caminho *automáticas*. Funções como :func:`expanduser` e :func:`expandvars` podem ser invocadas explicitamente quando uma aplicação necessita de expansão de caminho semelhante à *shell*. (Consulte também o módulo :mod:`glob`.)
sv: Till skillnad från ett Unix-shell gör Python inga *automatiska* sökvägsexpansioner. Funktioner som :func:`expanduser` och :func:`expandvars` kan anropas explicit när ett program önskar shell-liknande sökvägsexpansion. (Se även modulen :mod:`glob`.)

source: The :mod:`pathlib` module offers high-level path objects.
pt_pt: O módulo :mod:`pathlib` oferece objetos de caminho de alto nível.
sv: Modulen :mod:`pathlib` erbjuder sökvägsobjekt på hög nivå.

source: All of these functions accept either only bytes or only string objects as their parameters. The result is an object of the same type, if a path or file name is returned.
pt_pt: Todas estas funções aceitam apenas objetos do tipo bytes ou strings como parâmetros. O resultado é um objeto do mesmo tipo, se um caminho ou nome de ficheiro for devolvido.
sv: Alla dessa funktioner accepterar antingen bara bytes eller bara strängobjekt som sina parametrar. Resultatet är ett objekt av samma typ om en sökväg eller ett filnamn returneras.

source: Since different operating systems have different path name conventions, there are several versions of this module in the standard library. The :mod:`os.path` module is always the path module suitable for the operating system Python is running on, and therefore usable for local paths. However, you can also import and use the individual modules if you want to manipulate a path that is *always* in one of the different formats. They all have the same interface:
pt_pt: Como diferentes sistemas operativos têm convenções diferentes para nomes de caminhos, existem várias versões deste módulo na biblioteca padrão. O módulo :mod:`os.path` é sempre o módulo de caminho adequado para o sistema operativo onde o Python está a ser executado, sendo, portanto, utilizável para caminhos locais. No entanto, também pode importar e usar os módulos individuais se pretender manipular um caminho que esteja *sempre* num dos diferentes formatos. Todos eles têm a mesma interface:
sv: Eftersom olika operativsystem har olika konventioner för sökvägsnamn finns det flera versioner av denna modul i standardbiblioteket. Modulen :mod:`os.path` är alltid den sökvägsmodul som är lämplig för det operativsystem som Python körs på, och kan därför användas för lokala sökvägar. Men du kan också importera och använda de enskilda modulerna om du vill manipulera en sökväg som *alltid* är i ett av de olika formaten. De har alla samma gränssnitt:

source: :mod:`!posixpath` for UNIX-style paths
pt_pt: :mod:`!posixpath` para caminhos no estilo UNIX

source: :mod:`!ntpath` for Windows paths
pt_pt: :mod:`!ntpath` para caminhos Windows

source: :func:`exists`, :func:`lexists`, :func:`isdir`, :func:`isfile`, :func:`islink`, and :func:`ismount` now return ``False`` instead of raising an exception for paths that contain characters or bytes unrepresentable at the OS level.
pt_pt: As funções :func:`exists`, :func:`lexists`, :func:`isdir`, :func:`isfile`, :func:`islink` e :func:`ismount` agora devolvem ``False`` em vez de lançar uma exceção para caminhos que contenham caracteres ou bytes não representáveis ao nível do sistema operativo.
sv: :func:`exists`, :func:`lexists`, :func:`isdir`, :func:`isfile`, :func:`islink` och :func:`ismount` returnerar nu ``False`` istället för att skapa ett undantag för sökvägar som innehåller tecken eller byte som inte kan representeras på OS-nivå.

source: Accepts a :term:`path-like object`.
pt_pt: Aceita um :term:`objeto semelhante a um caminho`.
sv: Accepterar en :term:`path-like object`.

source: Return the base name of pathname *path*. This is the second element of the pair returned by passing *path* to the function :func:`split`. Note that the result of this function is different from the Unix :program:`basename` program; where :program:`basename` for ``'/foo/bar/'`` returns ``'bar'``, the :func:`basename` function returns an empty string (``''``).
pt_pt: Devolve o nome base do caminho *path*. Este é o segundo elemento do par devolvido pela função :func:`split` quando *path* é passado. Note que o resultado desta função é diferente do programa Unix :program:`basename`; enquanto :program:`basename` para ``'/foo/bar/'`` devolve ``'bar'``, a função :func:`basename` devolve uma string vazia (``''``).
sv: Returnerar basnamnet för sökvägsnamnet *sökväg*. Detta är det andra elementet i det par som returneras genom att skicka *path* till funktionen :func:`split`. Observera att resultatet av denna funktion skiljer sig från Unix :program:`basename`\-program; där :program:`basename` för ``'/foo/bar/'`` returnerar ``'bar'``, returnerar :func:`basename`\-funktionen en tom sträng (``''``).

source: Return the longest common sub-path of each pathname in the iterable *paths*. Raise :exc:`ValueError` if *paths* contain both absolute and relative pathnames, if *paths* are on different drives, or if *paths* is empty. Unlike :func:`commonprefix`, this returns a valid path.
pt_pt: Devolve o sub-caminho comum mais longo de cada caminho no iterável *paths*. Lança :exc:`ValueError` se *paths* contiver caminhos absolutos e relativos, se *paths* estiverem em unidades diferentes, ou se *paths* estiver vazio. Ao contrário de :func:`commonprefix`, isto devolve um caminho válido.

source: Accepts a sequence of :term:`path-like objects <path-like object>`.
pt_pt: Aceita uma sequência de :term:`objetos semelhantes a caminhos <path-like object>`.
sv: Accepterar en sekvens av :term:`path-liknande objekt <path-like object>`.

source: Any iterable can now be passed, rather than just sequences.
pt_pt: Agora pode ser passado qualquer iterável, não apenas sequências.

source: Return the longest path prefix (taken character-by-character) that is a prefix of all paths in *list*. If *list* is empty, return the empty string (``''``).
pt_pt: Devolve o prefixo de caminho mais longo (caracter a caracter) que é um prefixo de todos os caminhos em *list*. Se *list* estiver vazio, devolve uma string vazia (``''``).
sv: Returnerar det längsta sökvägsprefixet (taget tecken för tecken) som är ett prefix för alla sökvägar i *list*. Om *list* är tom returneras den tomma strängen (``''``).

source: This function may return invalid paths because it works a character at a time. To obtain a valid path, see :func:`commonpath`.
pt_pt: Esta função pode devolver caminhos inválidos porque trabalha caracter a caracter. Para obter um caminho válido, consulte :func:`commonpath`.
sv: Denna funktion kan returnera ogiltiga sökvägar eftersom den arbetar med ett tecken i taget. För att få en giltig sökväg, se :func:`commonpath`.

source: Return the directory name of pathname *path*. This is the first element of the pair returned by passing *path* to the function :func:`split`.
pt_pt: Devolve o nome do diretório do caminho *path*. Este é o primeiro elemento do par devolvido pela função :func:`split` quando *path* é passado.
sv: Returnerar katalognamnet för sökvägsnamnet *sökväg*. Detta är det första elementet i det par som returneras när *path* skickas till funktionen :func:`split`.

source: Return ``True`` if *path* refers to an existing path or an open file descriptor. Returns ``False`` for broken symbolic links. On some platforms, this function may return ``False`` if permission is not granted to execute :func:`os.stat` on the requested file, even if the *path* physically exists.
pt_pt: Devolve ``True`` se *path* se referir a um caminho existente ou a um descritor de ficheiro aberto. Devolve ``False`` para ligações simbólicas partidas. Em algumas plataformas, esta função pode devolver ``False`` se não for concedida permissão para executar :func:`os.stat` no ficheiro solicitado, mesmo que o *path* exista fisicamente.
sv: Returnerar ``True`` om *path* hänvisar till en befintlig sökväg eller en öppen filbeskrivare. Returnerar ``False`` för brutna symboliska länkar. På vissa plattformar kan denna funktion returnera ``False`` om tillstånd inte ges för att köra :func:`os.stat` på den begärda filen, även om *sökvägen* fysiskt existerar.

source: *path* can now be an integer: ``True`` is returned if it is an open file descriptor, ``False`` otherwise.
pt_pt: *path* agora pode ser um inteiro: ``True`` é devolvido se for um descritor de ficheiro aberto, ``False`` caso contrário.
sv: *path* kan nu vara ett heltal: ``True`` returneras om det är en öppen filbeskrivare, ``False`` annars.

source: Return ``True`` if *path* refers to an existing path, including broken symbolic links. Equivalent to :func:`exists` on platforms lacking :func:`os.lstat`.
pt_pt: Devolve ``True`` se *path* se referir a um caminho existente, incluindo ligações simbólicas partidas. Equivalente a :func:`exists` em plataformas sem :func:`os.lstat`.

source: On Unix and Windows, return the argument with an initial component of ``~`` or ``~user`` replaced by that *user*'s home directory.
pt_pt: Em Unix e Windows, devolve o argumento com um componente inicial ``~`` ou ``~user`` substituído pelo diretório *home* desse *user*.
sv: På Unix och Windows returneras argumentet med en initial komponent av ``~`` eller ``~user`` ersatt av den *användarens* hemkatalog.

source: On Unix, an initial ``~`` is replaced by the environment variable :envvar:`HOME` if it is set; otherwise the current user's home directory is looked up in the password directory through the built-in module :mod:`pwd`. An initial ``~user`` is looked up directly in the password directory.
pt_pt: Em Unix, um ``~`` inicial é substituído pela variável de ambiente :envvar:`HOME` se estiver definida; caso contrário, o diretório *home* do utilizador atual é procurado no diretório de passwords através do módulo integrado :mod:`pwd`. Um ``~user`` inicial é procurado diretamente no diretório de passwords.
sv: På Unix ersätts en initial ``~`` av miljövariabeln :envvar:`HOME` om den är inställd; annars söks den aktuella användarens hemkatalog upp i lösenordskatalogen genom den inbyggda modulen :mod:`pwd`. En första ``~``användare`` söks upp direkt i lösenordskatalogen.

source: On Windows, :envvar:`USERPROFILE` will be used if set, otherwise a combination of :envvar:`HOMEPATH` and :envvar:`HOMEDRIVE` will be used. An initial ``~user`` is handled by checking that the last directory component of the current user's home directory matches :envvar:`USERNAME`, and replacing it if so.
pt_pt: No Windows, :envvar:`USERPROFILE` será usado se estiver definido; caso contrário, será usada uma combinação de :envvar:`HOMEPATH` e :envvar:`HOMEDRIVE`. Um ``~user`` inicial é tratado verificando se o último componente do diretório *home* do utilizador atual corresponde a :envvar:`USERNAME`, substituindo-o se for o caso.
sv: I Windows kommer :envvar:`USERPROFILE` att användas om den är angiven, annars kommer en kombination av :envvar:`HOMEPATH` och :envvar:`HOMEDRIVE` att användas. En första ``~user`` hanteras genom att kontrollera att den sista katalogkomponenten i den aktuella användarens hemkatalog matchar :envvar:`USERNAME`, och ersätta den om så är fallet.

source: If the expansion fails or if the path does not begin with a tilde, the path is returned unchanged.
pt_pt: Se a expansão falhar ou se o caminho não começar com um til, o caminho é devolvido inalterado.
sv: Om expansionen misslyckas eller om sökvägen inte börjar med en tilde, returneras sökvägen oförändrad.

source: No longer uses :envvar:`HOME` on Windows.
pt_pt: Já não usa :envvar:`HOME` no Windows.
sv: Använder inte längre :envvar:`HOME` på Windows.

source: Return the argument with environment variables expanded. Substrings of the form ``$name`` or ``${name}`` are replaced by the value of environment variable *name*. Malformed variable names and references to non-existing variables are left unchanged.
pt_pt: Devolve o argumento com as variáveis de ambiente expandidas. Substrings da forma ``$name`` ou ``${name}`` são substituídas pelo valor da variável de ambiente *name*. Nomes de variáveis malformados e referências a variáveis inexistentes permanecem inalterados.
sv: Returnerar argumentet med miljövariablerna expanderade. Substrängar av formen ``$name`` eller ``${name}`` ersätts av värdet på miljövariabeln *name*. Missbildade variabelnamn och referenser till icke-existerande variabler lämnas oförändrade.

source: On Windows, ``%name%`` expansions are supported in addition to ``$name`` and ``${name}``.
pt_pt: No Windows, as expansões ``%name%`` são suportadas além de ``$name`` e ``${name}``.
sv: I Windows stöds ``%name%``\-expansioner utöver ``$name`` och ``${name}``.

source: Return the time of last access of *path*. The return value is a floating-point number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_pt: Devolve a hora do último acesso a *path*. O valor devolvido é um número de ponto flutuante que indica o número de segundos desde a época (consulte o módulo :mod:`time`). Lança :exc:`OSError` se o ficheiro não existir ou for inacessível.

source: Return the time of last modification of *path*. The return value is a floating-point number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_pt: Devolve a hora da última modificação de *path*. O valor devolvido é um número de ponto flutuante que indica o número de segundos desde a época (consulte o módulo :mod:`time`). Lança :exc:`OSError` se o ficheiro não existir ou for inacessível.

source: Return the system's ctime which, on some systems (like Unix) is the time of the last metadata change, and, on others (like Windows), is the creation time for *path*. The return value is a number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_pt: Devolve o *ctime* do sistema, que em alguns sistemas (como Unix) é a hora da última alteração dos metadados, e noutros (como Windows) é a hora de criação de *path*. O valor devolvido é um número que indica o número de segundos desde a época (consulte o módulo :mod:`time`). Lança :exc:`OSError` se o ficheiro não existir ou for inacessível.
sv: Returnerar systemets ctime, som på vissa system (t.ex. Unix) är tidpunkten för den senaste metadataförändringen och på andra (t.ex. Windows) är skapelsetiden för *path*. Returvärdet är ett tal som anger antalet sekunder sedan epoken (se modulen :mod:`time`). Utlöser :exc:`OSError` om filen inte finns eller är otillgänglig.

source: Return the size, in bytes, of *path*. Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_pt: Devolve o tamanho, em bytes, de *path*. Lança :exc:`OSError` se o ficheiro não existir ou for inacessível.
sv: Returnerar storleken, i byte, på *path*. Ger :exc:`OSError` om filen inte finns eller är otillgänglig.

source: Return ``True`` if *path* is an absolute pathname. On Unix, that means it begins with a slash, on Windows that it begins with two (back)slashes, or a drive letter, colon, and (back)slash together.
pt_pt: Devolve ``True`` se *path* for um caminho absoluto. Em Unix, isso significa que começa com uma barra; no Windows, que começa com duas barras invertidas, ou uma letra de unidade, dois pontos e uma barra invertida.

source: On Windows, returns ``False`` if the given path starts with exactly one (back)slash.
pt_pt: No Windows, devolve ``False`` se o caminho dado começar com exatamente uma barra invertida.

source: Return ``True`` if *path* is an :func:`existing <exists>` regular file. This follows symbolic links, so both :func:`islink` and :func:`isfile` can be true for the same path.
pt_pt: Devolve ``True`` se *path* for um ficheiro regular :func:`existente <exists>`. Isto segue ligações simbólicas, por isso tanto :func:`islink` como :func:`isfile` podem ser verdadeiros para o mesmo caminho.
sv: Returnerar ``True`` om *sökväg* är en :func:`existerande <exists>` vanlig fil. Detta följer symboliska länkar, så både :func:`islink` och :func:`isfile` kan vara true för samma sökväg.

source: Return ``True`` if *path* is an :func:`existing <exists>` directory. This follows symbolic links, so both :func:`islink` and :func:`isdir` can be true for the same path.
pt_pt: Devolve ``True`` se *path* for um diretório :func:`existente <exists>`. Isto segue ligações simbólicas, por isso tanto :func:`islink` como :func:`isdir` podem ser verdadeiros para o mesmo caminho.
sv: Returnerar ``True`` om *sökväg* är en :func:`existerande <exists>` katalog. Detta följer symboliska länkar, så både :func:`islink` och :func:`isdir` kan vara true för samma sökväg.

source: Return ``True`` if *path* refers to an :func:`existing <lexists>` directory entry that is a junction. Always return ``False`` if junctions are not supported on the current platform.
pt_pt: Devolve ``True`` se *path* se referir a uma entrada de diretório :func:`existente <lexists>` que seja uma junção. Devolve sempre ``False`` se as junções não forem suportadas na plataforma atual.

source: Return ``True`` if *path* refers to an :func:`existing <exists>` directory entry that is a symbolic link. Always ``False`` if symbolic links are not supported by the Python runtime.
pt_pt: Devolve ``True`` se *path* se referir a uma entrada de diretório :func:`existente <exists>` que seja uma ligação simbólica. Sempre ``False`` se ligações simbólicas não forem suportadas pelo ambiente de execução do Python.
sv: Returnerar ``True`` om *path* refererar till en :func:`existerande <exists>` katalogpost som är en symbolisk länk. Alltid ``False`` om symboliska länkar inte stöds av Pythons runtime.

source: Return ``True`` if pathname *path* is a :dfn:`mount point`: a point in a file system where a different file system has been mounted. On POSIX, the function checks whether *path*'s parent, :file:`{path}/..`, is on a different device than *path*, or whether :file:`{path}/..` and *path* point to the same i-node on the same device --- this should detect mount points for all Unix and POSIX variants. It is not able to reliably detect bind mounts on the same filesystem. On Linux systems, it will always return ``True`` for btrfs subvolumes, even if they aren't mount points. On Windows, a drive letter root and a share UNC are always mount points, and for any other path ``GetVolumePathName`` is called to see if it is different from the input path.
pt_pt: Devolve ``True`` se o caminho *path* for um :dfn:`ponto de montagem`: um ponto num sistema de ficheiros onde outro sistema de ficheiros foi montado. No POSIX, a função verifica se o pai de *path*, :file:`{path}/..`, está num dispositivo diferente de *path*, ou se :file:`{path}/..` e *path* apontam para o mesmo i-nó no mesmo dispositivo — isto deve detetar pontos de montagem para todas as variantes Unix e POSIX. Não é capaz de detetar confiavelmente *bind mounts* no mesmo sistema de ficheiros. Em sistemas Linux, devolverá sempre ``True`` para subvolumes btrfs, mesmo que não sejam pontos de montagem. No Windows, uma raiz de letra de unidade e um UNC de partilha são sempre pontos de montagem, e para qualquer outro caminho, ``GetVolumePathName`` é chamado para verificar se é diferente do caminho de entrada.

source: Added support for detecting non-root mount points on Windows.
pt_pt: Adicionado suporte para detetar pontos de montagem não-raiz no Windows.

source: Return ``True`` if pathname *path* is located on a Windows Dev Drive. A Dev Drive is optimized for developer scenarios, and offers faster performance for reading and writing files. It is recommended for use for source code, temporary build directories, package caches, and other IO-intensive operations.
pt_pt: Devolve ``True`` se o caminho *path* estiver localizado numa *Dev Drive* do Windows. Uma *Dev Drive* é otimizada para cenários de desenvolvimento e oferece melhor desempenho para leitura e escrita de ficheiros. É recomendada para código-fonte, diretórios de construção temporários, caches de pacotes e outras operações intensivas de E/S.

source: May raise an error for an invalid path, for example, one without a recognizable drive, but returns ``False`` on platforms that do not support Dev Drives. See `the Windows documentation <https://learn.microsoft.com/windows/dev-drive/>`_ for information on enabling and creating Dev Drives.
pt_pt: Pode lançar um erro para um caminho inválido, por exemplo, um sem uma unidade reconhecível, mas devolve ``False`` em plataformas que não suportam *Dev Drives*. Consulte a `documentação do Windows <https://learn.microsoft.com/windows/dev-drive/>`_ para obter informações sobre como ativar e criar *Dev Drives*.

source: The function is now available on all platforms, and will always return ``False`` on those that have no support for Dev Drives
pt_pt: A função está agora disponível em todas as plataformas e devolverá sempre ``False`` naquelas que não suportam *Dev Drives*.

source: Return ``True`` if *path* is a reserved pathname on the current system.
pt_pt: Devolve ``True`` se *path* for um caminho reservado no sistema atual.

source: On Windows, reserved filenames include those that end with a space or dot; those that contain colons (i.e. file streams such as "name:stream"), wildcard characters (i.e. ``'*?"<>'``), pipe, or ASCII control characters; as well as DOS device names such as "NUL", "CON", "CONIN$", "CONOUT$", "AUX", "PRN", "COM1", and "LPT1".
pt_pt: No Windows, os nomes de ficheiros reservados incluem aqueles que terminam com um espaço ou ponto; aqueles que contêm dois pontos (por exemplo, fluxos de ficheiros como "name:stream"), caracteres curinga (por exemplo, ``'*?"<>'``), pipe, ou caracteres de controlo ASCII; bem como nomes de dispositivos DOS como "NUL", "CON", "CONIN$", "CONOUT$", "AUX", "PRN", "COM1" e "LPT1".
