Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ossaudiodev.po
Languages: ru

source: :mod:`ossaudiodev` --- Access to OSS-compatible audio devices
ru: :mod:`ossaudiodev` --- Доступ к OSS-совместимым аудиоустройствам

source: The :mod:`ossaudiodev` module is deprecated (see :pep:`PEP 594 <594#ossaudiodev>` for details).
ru: Модуль :mod:`ossaudiodev` устарел (подробности см. в :pep:`PEP 594 <594#ossaudiodev>`).

source: This module allows you to access the OSS (Open Sound System) audio interface. OSS is available for a wide range of open-source and commercial Unices, and is the standard audio interface for Linux and recent versions of FreeBSD.
ru: Этот модуль позволяет получить доступ к аудиоинтерфейсу OSS (Open Sound System). OSS доступен для широкого спектра коммерческих Unix с открытым исходным кодом и является стандартным аудиоинтерфейсом для Linux и последних версий FreeBSD.

source: Operations in this module now raise :exc:`OSError` where :exc:`IOError` was raised.
ru: Операции в этом модуле теперь вызывают :exc:`OSError` там, где было вызвано :exc:`IOError`.

source: `Open Sound System Programmer's Guide <http://www.opensound.com/pguide/oss.pdf>`_
ru: `Руководство программиста Open Sound System <http://www.opensound.com/pguide/oss.pdf>`_

source: the official documentation for the OSS C API
ru: официальная документация для OSS C API

source: The module defines a large number of constants supplied by the OSS device driver; see ``<sys/soundcard.h>`` on either Linux or FreeBSD for a listing.
ru: Модуль определяет большое количество констант, предоставляемых драйвером устройства OSS; список см. в ``<sys/soundcard.h>`` в Linux или FreeBSD.

source: :mod:`ossaudiodev` defines the following variables and functions:
ru: :mod:`ossaudiodev` определяет следующие переменные и функции:

source: This exception is raised on certain errors. The argument is a string describing what went wrong.
ru: Это исключение возникает при определенных ошибках. Аргумент представляет собой строку, описывающую, что пошло не так.

source: (If :mod:`ossaudiodev` receives an error from a system call such as :c:func:`open`, :c:func:`write`, or :c:func:`ioctl`, it raises :exc:`OSError`. Errors detected directly by :mod:`ossaudiodev` result in :exc:`OSSAudioError`.)
ru: (Если :mod:`ossaudiodev` получает ошибку от системного вызова, такого как :c:func:`open`, :c:func:`write` или :c:func:`ioctl`, он вызывает :exc: `OSError`. Ошибки, обнаруженные непосредственно :mod:`ossaudiodev`, приводят к :exc:`OSSAudioError`.)

source: (For backwards compatibility, the exception class is also available as ``ossaudiodev.error``.)
ru: (Для обратной совместимости класс исключений также доступен как ossaudiodev.error.)

source: Open an audio device and return an OSS audio device object. This object supports many file-like methods, such as :meth:`read`, :meth:`write`, and :meth:`fileno` (although there are subtle differences between conventional Unix read/write semantics and those of OSS audio devices). It also supports a number of audio-specific methods; see below for the complete list of methods.
ru: Откройте аудиоустройство и верните объект аудиоустройства OSS. Этот объект поддерживает множество файловых методов, таких как :meth:`read`, :meth:`write` и :meth:`fileno` (хотя существуют тонкие различия между обычной семантикой чтения/записи Unix и семантикой аудио OSS). устройства). Он также поддерживает ряд методов, специфичных для звука; Полный список методов см. ниже.

source: *device* is the audio device filename to use. If it is not specified, this module first looks in the environment variable :envvar:`AUDIODEV` for a device to use. If not found, it falls back to :file:`/dev/dsp`.
ru: *device* — имя файла аудиоустройства, которое нужно использовать. Если он не указан, этот модуль сначала ищет в переменной среды :envvar:`AUDIODEV` устройство, которое можно использовать. Если он не найден, он возвращается к :file:`/dev/dsp`.

source: *mode* is one of ``'r'`` for read-only (record) access, ``'w'`` for write-only (playback) access and ``'rw'`` for both. Since many sound cards only allow one process to have the recorder or player open at a time, it is a good idea to open the device only for the activity needed. Further, some sound cards are half-duplex: they can be opened for reading or writing, but not both at once.
ru: *mode* является одним из ``'r'`` для доступа только для чтения (записи), ``'w'`` для доступа только для записи (воспроизведения) и ``'rw'`` для обоих. Поскольку многие звуковые карты позволяют одновременно открывать диктофон или проигрыватель только одному процессу, рекомендуется открывать устройство только для необходимых действий. Кроме того, некоторые звуковые карты являются полудуплексными: их можно открыть для чтения или записи, но не для того и другого одновременно.

source: Note the unusual calling syntax: the *first* argument is optional, and the second is required. This is a historical artifact for compatibility with the older :mod:`linuxaudiodev` module which :mod:`ossaudiodev` supersedes.
ru: Обратите внимание на необычный синтаксис вызова: *первый* аргумент является необязательным, а второй является обязательным. Это исторический артефакт для совместимости со старым модулем :mod:`linuxaudiodev`, который заменяет :mod:`ossaudiodev`.

source: Open a mixer device and return an OSS mixer device object. *device* is the mixer device filename to use. If it is not specified, this module first looks in the environment variable :envvar:`MIXERDEV` for a device to use. If not found, it falls back to :file:`/dev/mixer`.
ru: Откройте устройство микшера и верните объект устройства микшера OSS. *device* — имя файла устройства микшера, которое нужно использовать. Если он не указан, этот модуль сначала ищет в переменной среды :envvar:`MIXERDEV` устройство, которое можно использовать. Если он не найден, он возвращается к :file:`/dev/mixer`.

source: Audio Device Objects
ru: Объекты аудиоустройств

source: Before you can write to or read from an audio device, you must call three methods in the correct order:
ru: Прежде чем вы сможете записывать или читать аудиоустройство, вы должны вызвать три метода в правильном порядке:

source: :meth:`setfmt` to set the output format
ru: :meth:`setfmt` для установки формата вывода

source: :meth:`channels` to set the number of channels
ru: :meth:`channels` для установки количества каналов

source: :meth:`speed` to set the sample rate
ru: :meth:`speed` для установки частоты дискретизации

source: Alternately, you can use the :meth:`setparameters` method to set all three audio parameters at once. This is more convenient, but may not be as flexible in all cases.
ru: Альтернативно, вы можете использовать метод :meth:`setparameters`, чтобы установить все три аудиопараметра одновременно. Это более удобно, но не во всех случаях может быть столь гибким.

source: The audio device objects returned by :func:`.open` define the following methods and (read-only) attributes:
ru: Объекты аудиоустройств, возвращаемые :func:`.open`, определяют следующие методы и атрибуты (только для чтения):

source: Explicitly close the audio device. When you are done writing to or reading from an audio device, you should explicitly close it. A closed device cannot be used again.
ru: Явно закройте аудиоустройство. Когда вы закончите запись или чтение с аудиоустройства, вам следует явно закрыть его. Закрытое устройство нельзя использовать повторно.

source: Return the file descriptor associated with the device.
ru: Верните дескриптор файла, связанный с устройством.

source: Read *size* bytes from the audio input and return them as a Python string. Unlike most Unix device drivers, OSS audio devices in blocking mode (the default) will block :func:`read` until the entire requested amount of data is available.
ru: Считайте *size* байты с аудиовхода и верните их в виде строки Python. В отличие от большинства драйверов устройств Unix, аудиоустройства OSS в режиме блокировки (по умолчанию) будут блокировать :func:`read` до тех пор, пока не будет доступен весь запрошенный объем данных.

source: Write a :term:`bytes-like object` *data* to the audio device and return the number of bytes written. If the audio device is in blocking mode (the default), the entire data is always written (again, this is different from usual Unix device semantics). If the device is in non-blocking mode, some data may not be written---see :meth:`writeall`.
ru: Запишите :term:`байтовый объект` *данные* на аудиоустройство и верните количество записанных байтов. Если аудиоустройство находится в режиме блокировки (по умолчанию), всегда записываются все данные (опять же, это отличается от обычной семантики устройства Unix). Если устройство находится в неблокирующем режиме, некоторые данные могут быть не записаны — см. :meth:`writeall`.

source: Writable :term:`bytes-like object` is now accepted.
ru: Доступный для записи :term:`байтовый объект` теперь принимается.

source: Write a :term:`bytes-like object` *data* to the audio device: waits until the audio device is able to accept data, writes as much data as it will accept, and repeats until *data* has been completely written. If the device is in blocking mode (the default), this has the same effect as :meth:`write`; :meth:`writeall` is only useful in non-blocking mode. Has no return value, since the amount of data written is always equal to the amount of data supplied.
ru: Записать :term:`байтовый объект` *data* на аудиоустройство: ждет, пока аудиоустройство сможет принять данные, записывает столько данных, сколько оно может принять, и повторяет до тех пор, пока *данные* не будут полностью записаны. Если устройство находится в режиме блокировки (по умолчанию), это имеет тот же эффект, что и :meth:`write`; :meth:`writeall` полезен только в неблокирующем режиме. Не имеет возвращаемого значения, поскольку объем записанных данных всегда равен объему предоставленных данных.

source: Audio device objects also support the context management protocol, i.e. they can be used in a :keyword:`with` statement.
ru: Объекты аудиоустройств также поддерживают протокол управления контекстом, т.е. их можно использовать в операторе :keyword:`with`.

source: The following methods each map to exactly one :c:func:`ioctl` system call. The correspondence is obvious: for example, :meth:`setfmt` corresponds to the ``SNDCTL_DSP_SETFMT`` ioctl, and :meth:`sync` to ``SNDCTL_DSP_SYNC`` (this can be useful when consulting the OSS documentation). If the underlying :c:func:`ioctl` fails, they all raise :exc:`OSError`.
ru: Каждый из следующих методов соответствует ровно одному системному вызову :c:func:`ioctl`. Соответствие очевидно: например, :meth:`setfmt` соответствует ioctl ``SNDCTL_DSP_SETFMT``, а :meth:`sync` - ``SNDCTL_DSP_SYNC`` (это может быть полезно при обращении к документации OSS). Если базовая :c:func:`ioctl` дает сбой, все они вызывают :exc:`OSError`.

source: Put the device into non-blocking mode. Once in non-blocking mode, there is no way to return it to blocking mode.
ru: Переведите устройство в неблокирующий режим. Попав в неблокирующий режим, невозможно вернуть его в режим блокировки.

source: Return a bitmask of the audio output formats supported by the soundcard. Some of the formats supported by OSS are:
ru: Возвращает битовую маску форматов вывода звука, поддерживаемых звуковой картой. Некоторые из форматов, поддерживаемых OSS:

source: Format
ru: Формат

source: Description
ru: Описание

source: a logarithmic encoding (used by Sun ``.au`` files and :file:`/dev/audio`)
ru: логарифмическая кодировка (используется файлами Sun ``.au`` и :file:`/dev/audio`)

source: a logarithmic encoding
ru: логарифмическая кодировка

source: a 4:1 compressed format defined by the Interactive Multimedia Association
ru: формат сжатия 4:1, определенный Ассоциацией интерактивного мультимедиа.

source: Unsigned, 8-bit audio
ru: Беззнаковое, 8-битное аудио

source: Signed, 16-bit audio, little-endian byte order (as used by Intel processors)
ru: 16-битный звук со знаком, прямой порядок байтов (используется процессорами Intel).

source: Signed, 16-bit audio, big-endian byte order (as used by 68k, PowerPC, Sparc)
ru: 16-битный звук со знаком, обратный порядок байтов (используется в 68k, PowerPC, Sparc)

source: Consult the OSS documentation for a full list of audio formats, and note that most devices support only a subset of these formats. Some older devices only support :const:`AFMT_U8`; the most common format used today is :const:`AFMT_S16_LE`.
ru: Полный список аудиоформатов см. в документации OSS и обратите внимание, что большинство устройств поддерживают только часть этих форматов. Некоторые старые устройства поддерживают только :const:`AFMT_U8`; наиболее распространенный формат, используемый сегодня, — :const:`AFMT_S16_LE`.

source: Try to set the current audio format to *format*---see :meth:`getfmts` for a list. Returns the audio format that the device was set to, which may not be the requested format. May also be used to return the current audio format---do this by passing an "audio format" of :const:`AFMT_QUERY`.
ru: Попробуйте установить текущий аудиоформат на *format* — список см. в :meth:`getfmts`. Возвращает аудиоформат, установленный на устройстве, который может не совпадать с запрошенным форматом. Также может использоваться для возврата текущего аудиоформата — для этого передайте «аудиоформат» :const:`AFMT_QUERY`.

source: Set the number of output channels to *nchannels*. A value of 1 indicates monophonic sound, 2 stereophonic. Some devices may have more than 2 channels, and some high-end devices may not support mono. Returns the number of channels the device was set to.
ru: Установите количество выходных каналов на *nchannels*. Значение 1 указывает на монофонический звук, 2 — на стереофонический. Некоторые устройства могут иметь более двух каналов, а некоторые устройства высокого класса могут не поддерживать моно. Возвращает количество каналов, на которые было настроено устройство.

source: Try to set the audio sampling rate to *samplerate* samples per second. Returns the rate actually set. Most sound devices don't support arbitrary sampling rates. Common rates are:
ru: Попробуйте установить частоту дискретизации звука *выборку* выборок в секунду. Возвращает фактически установленную ставку. Большинство звуковых устройств не поддерживают произвольные частоты дискретизации. Общие тарифы:

source: Rate
ru: Ставка

source: default rate for :file:`/dev/audio`
ru: скорость по умолчанию для :file:`/dev/audio`

source: speech recording
ru: запись речи

source: CD quality audio (at 16 bits/sample and 2 channels)
ru: Звук CD-качества (16 бит/сэмпл и 2 канала)

source: DVD quality audio (at 24 bits/sample)
ru: Звук DVD-качества (24 бита на выборку)

source: Wait until the sound device has played every byte in its buffer. (This happens implicitly when the device is closed.) The OSS documentation recommends closing and re-opening the device rather than using :meth:`sync`.
ru: Подождите, пока звуковое устройство не воспроизведет каждый байт своего буфера. (Это происходит неявно, когда устройство закрывается.) Документация OSS рекомендует закрывать и повторно открывать устройство, а не использовать :meth:`sync`.

source: Immediately stop playing or recording and return the device to a state where it can accept commands. The OSS documentation recommends closing and re-opening the device after calling :meth:`reset`.
ru: Немедленно прекратите воспроизведение или запись и верните устройство в состояние, в котором оно может принимать команды. Документация OSS рекомендует закрывать и снова открывать устройство после вызова :meth:`reset`.

source: Tell the driver that there is likely to be a pause in the output, making it possible for the device to handle the pause more intelligently. You might use this after playing a spot sound effect, before waiting for user input, or before doing disk I/O.
ru: Сообщите драйверу, что в выводе, вероятно, будет пауза, что позволит устройству более разумно обработать паузу. Вы можете использовать это после воспроизведения точечного звукового эффекта, перед ожиданием ввода пользователя или перед выполнением дискового ввода-вывода.

source: The following convenience methods combine several ioctls, or one ioctl and some simple calculations.
ru: Следующие удобные методы сочетают в себе несколько ioctl или один ioctl и несколько простых вычислений.

source: Set the key audio sampling parameters---sample format, number of channels, and sampling rate---in one method call. *format*, *nchannels*, and *samplerate* should be as specified in the :meth:`setfmt`, :meth:`channels`, and :meth:`speed` methods. If *strict* is true, :meth:`setparameters` checks to see if each parameter was actually set to the requested value, and raises :exc:`OSSAudioError` if not. Returns a tuple (*format*, *nchannels*, *samplerate*) indicating the parameter values that were actually set by the device driver (i.e., the same as the return values of :meth:`setfmt`, :meth:`channels`, and :meth:`speed`).
ru: Установите ключевые параметры дискретизации звука — формат сэмпла, количество каналов и частоту дискретизации — в одном вызове метода. *format*, *nchannels* и *samplerate* должны быть такими, как указано в методах :meth:`setfmt`, :meth:`channels` и :meth:`speed`. Если *strict* имеет значение true, :meth:`setparameters` проверяет, действительно ли каждому параметру присвоено запрошенное значение, и вызывает :exc:`OSSAudioError`, если нет. Возвращает кортеж (*format*, *nchannels*, *samplerate*), указывающий значения параметров, которые фактически были установлены драйвером устройства (т. е. те же, что и возвращаемые значения :meth:`setfmt`, :meth:`channels `, и :meth:`скорость`).

source: For example, ::
ru: Например, ::

source: is equivalent to ::
ru: эквивалентно::

source: Returns the size of the hardware buffer, in samples.
ru: Возвращает размер аппаратного буфера в выборках.

source: Returns the number of samples that are in the hardware buffer yet to be played.
ru: Возвращает количество сэмплов, находящихся в аппаратном буфере, которые еще предстоит воспроизвести.

source: Returns the number of samples that could be queued into the hardware buffer to be played without blocking.
ru: Возвращает количество сэмплов, которые можно поставить в очередь в аппаратный буфер для воспроизведения без блокировки.

source: Audio device objects also support several read-only attributes:
ru: Объекты аудиоустройств также поддерживают несколько атрибутов, доступных только для чтения:

source: Boolean indicating whether the device has been closed.
ru: Логическое значение, указывающее, было ли закрыто устройство.

source: String containing the name of the device file.
ru: Строка, содержащая имя файла устройства.

source: The I/O mode for the file, either ``"r"``, ``"rw"``, or ``"w"``.
ru: Режим ввода-вывода для файла: ``"r"``, ``"rw"`` или ``"w"``.

source: Mixer Device Objects
ru: Объекты микшерного устройства

source: The mixer object provides two file-like methods:
ru: Объект микшера предоставляет два файловых метода:

source: This method closes the open mixer device file. Any further attempts to use the mixer after this file is closed will raise an :exc:`OSError`.
ru: Этот метод закрывает открытый файл устройства микшера. Любые дальнейшие попытки использовать микшер после закрытия этого файла вызовут ошибку :exc:`OSError`.

source: Returns the file handle number of the open mixer device file.
ru: Возвращает номер дескриптора открытого файла устройства микшера.

source: Mixer objects also support the context management protocol.
ru: Объекты микшера также поддерживают протокол управления контекстом.

source: The remaining methods are specific to audio mixing:
ru: Остальные методы предназначены только для микширования звука:

source: This method returns a bitmask specifying the available mixer controls ("Control" being a specific mixable "channel", such as :const:`SOUND_MIXER_PCM` or :const:`SOUND_MIXER_SYNTH`). This bitmask indicates a subset of all available mixer controls---the :const:`SOUND_MIXER_\*` constants defined at module level. To determine if, for example, the current mixer object supports a PCM mixer, use the following Python code::
ru: Этот метод возвращает битовую маску, определяющую доступные элементы управления микшером («Управление» представляет собой конкретный микшируемый «канал», например :const:`SOUND_MIXER_PCM` или :const:`SOUND_MIXER_SYNTH`). Эта битовая маска указывает подмножество всех доступных элементов управления микшером — константы :const:`SOUND_MIXER_\*`, определенные на уровне модуля. Например, чтобы определить, поддерживает ли текущий объект микшера микшер PCM, используйте следующий код Python:

source: For most purposes, the :const:`SOUND_MIXER_VOLUME` (master volume) and :const:`SOUND_MIXER_PCM` controls should suffice---but code that uses the mixer should be flexible when it comes to choosing mixer controls. On the Gravis Ultrasound, for example, :const:`SOUND_MIXER_VOLUME` does not exist.
ru: Для большинства целей элементов управления :const:`SOUND_MIXER_VOLUME` (основная громкость) и :const:`SOUND_MIXER_PCM` должно быть достаточно, но код, использующий микшер, должен быть гибким, когда дело доходит до выбора элементов управления микшером. Например, в Gravis Ultrasound :const:`SOUND_MIXER_VOLUME` не существует.

source: Returns a bitmask indicating stereo mixer controls. If a bit is set, the corresponding control is stereo; if it is unset, the control is either monophonic or not supported by the mixer (use in combination with :meth:`controls` to determine which).
ru: Возвращает битовую маску, указывающую элементы управления стереомикшером. Если бит установлен, соответствующий элемент управления является стереофоническим; если он не установлен, то элемент управления либо монофонический, либо не поддерживается микшером (используйте в сочетании с :meth:`controls`, чтобы определить, какой именно).

source: See the code example for the :meth:`controls` function for an example of getting data from a bitmask.
ru: См. пример кода функции :meth:`controls` для примера получения данных из битовой маски.

source: Returns a bitmask specifying the mixer controls that may be used to record. See the code example for :meth:`controls` for an example of reading from a bitmask.
ru: Возвращает битовую маску, определяющую элементы управления микшером, которые можно использовать для записи. См. пример кода для :meth:`controls` для примера чтения из битовой маски.

source: Returns the volume of a given mixer control. The returned volume is a 2-tuple ``(left_volume,right_volume)``. Volumes are specified as numbers from 0 (silent) to 100 (full volume). If the control is monophonic, a 2-tuple is still returned, but both volumes are the same.
ru: Возвращает громкость данного элемента управления микшером. Возвращаемый том представляет собой двухкортежный элемент (left_volume,right_volume)``. Громкость указывается цифрами от 0 (тихо) до 100 (полная громкость). Если элемент управления является однотонным, кортеж из двух элементов все равно возвращается, но оба тома одинаковы.

source: Raises :exc:`OSSAudioError` if an invalid control is specified, or :exc:`OSError` if an unsupported control is specified.
ru: Вызывает :exc:`OSSAudioError`, если указан недопустимый элемент управления, или :exc:`OSError`, если указан неподдерживаемый элемент управления.
