Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ossaudiodev.po
Languages: ru

source: Sets the volume for a given mixer control to ``(left,right)``. ``left`` and ``right`` must be ints and between 0 (silent) and 100 (full volume). On success, the new volume is returned as a 2-tuple. Note that this may not be exactly the same as the volume specified, because of the limited resolution of some soundcard's mixers.
ru: Устанавливает громкость для данного элемента управления микшером на ``(left,right)``. ``left`` и ``right`` должны быть целыми числами и находиться в диапазоне от 0 (тихо) до 100 (полная громкость). В случае успеха новый том возвращается как кортеж из двух частей. Обратите внимание, что это значение может не совпадать с указанным значением из-за ограниченного разрешения микшеров некоторых звуковых карт.

source: Raises :exc:`OSSAudioError` if an invalid mixer control was specified, or if the specified volumes were out-of-range.
ru: Вызывает :exc:`OSSAudioError`, если был указан недопустимый элемент управления микшером или если указанные тома находились вне диапазона.

source: This method returns a bitmask indicating which control(s) are currently being used as a recording source.
ru: Этот метод возвращает битовую маску, указывающую, какие элементы управления в данный момент используются в качестве источника записи.

source: Call this function to specify a recording source. Returns a bitmask indicating the new recording source (or sources) if successful; raises :exc:`OSError` if an invalid source was specified. To set the current recording source to the microphone input::
ru: Вызовите эту функцию, чтобы указать источник записи. Возвращает битовую маску, указывающую новый источник записи (или источники) в случае успеха; вызывает :exc:`OSError`, если указан неверный источник. Чтобы установить текущий источник записи на вход микрофона:
