Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: pt_pt

source: :mod:`!pickle` --- Python object serialization
pt_pt: :mod:`!pickle` — Serialização de objetos Python

source: **Source code:** :source:`Lib/pickle.py`
pt_pt: **Código-fonte:** :source:`Lib/pickle.py`

source: The :mod:`pickle` module implements binary protocols for serializing and de-serializing a Python object structure. *"Pickling"* is the process whereby a Python object hierarchy is converted into a byte stream, and *"unpickling"* is the inverse operation, whereby a byte stream (from a :term:`binary file` or :term:`bytes-like object`) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as "serialization", "marshalling," [#]_ or "flattening"; however, to avoid confusion, the terms used here are "pickling" and "unpickling".
pt_pt: O módulo :mod:`pickle` implementa protocolos binários para serializar e desserializar uma estrutura de objetos Python. *"Pickling"* é o processo pelo qual uma hierarquia de objetos Python é convertida num fluxo de bytes, e *"unpickling"* é a operação inversa, pela qual um fluxo de bytes (de um :term:`ficheiro binário` ou :term:`objeto tipo bytes`) é convertido de volta numa hierarquia de objetos. Pickling (e unpickling) também é conhecido como "serialização", "marshalling", [#]_ ou "achatamento"; no entanto, para evitar confusão, os termos usados aqui são "pickling" e "unpickling".

source: The ``pickle`` module **is not secure**. Only unpickle data you trust.
pt_pt: O módulo ``pickle`` **não é seguro**. Apenas faça unpickle de dados em que confia.

source: It is possible to construct malicious pickle data which will **execute arbitrary code during unpickling**. Never unpickle data that could have come from an untrusted source, or that could have been tampered with.
pt_pt: É possível construir dados pickle maliciosos que **executarão código arbitrário durante o unpickling**. Nunca faça unpickle de dados que possam ter vindo de uma fonte não confiável, ou que possam ter sido adulterados.

source: Consider signing data with :mod:`hmac` if you need to ensure that it has not been tampered with.
pt_pt: Considere assinar os dados com :mod:`hmac` se precisar de garantir que não foram adulterados.

source: Safer serialization formats such as :mod:`json` may be more appropriate if you are processing untrusted data. See :ref:`comparison-with-json`.
pt_pt: Formatos de serialização mais seguros, como :mod:`json`, podem ser mais apropriados se estiver a processar dados não confiáveis. Consulte :ref:`comparison-with-json`.

source: Relationship to other Python modules
pt_pt: Relação com outros módulos Python

source: Comparison with ``marshal``
pt_pt: Comparação com ``marshal``

source: Python has a more primitive serialization module called :mod:`marshal`, but in general :mod:`pickle` should always be the preferred way to serialize Python objects. :mod:`marshal` exists primarily to support Python's :file:`.pyc` files.
pt_pt: O Python tem um módulo de serialização mais primitivo chamado :mod:`marshal`, mas, em geral, :mod:`pickle` deve ser sempre a forma preferida de serializar objetos Python. :mod:`marshal` existe principalmente para suportar os ficheiros :file:`.pyc` do Python.

source: The :mod:`pickle` module differs from :mod:`marshal` in several significant ways:
pt_pt: O módulo :mod:`pickle` difere do :mod:`marshal` de várias formas significativas:

source: The :mod:`pickle` module keeps track of the objects it has already serialized, so that later references to the same object won't be serialized again. :mod:`marshal` doesn't do this.
pt_pt: O módulo :mod:`pickle` mantém o registo dos objetos que já serializou, de modo que referências posteriores ao mesmo objeto não serão serializadas novamente. :mod:`marshal` não faz isto.

source: This has implications both for recursive objects and object sharing. Recursive objects are objects that contain references to themselves. These are not handled by marshal, and in fact, attempting to marshal recursive objects will crash your Python interpreter. Object sharing happens when there are multiple references to the same object in different places in the object hierarchy being serialized. :mod:`pickle` stores such objects only once, and ensures that all other references point to the master copy. Shared objects remain shared, which can be very important for mutable objects.
pt_pt: Isto tem implicações tanto para objetos recursivos como para partilha de objetos. Objetos recursivos são objetos que contêm referências a si próprios. Estes não são tratados por marshal, e de facto, tentar serializar objetos recursivos com marshal fará com que o interpretador Python falhe. A partilha de objetos ocorre quando existem várias referências ao mesmo objeto em diferentes locais na hierarquia de objetos a ser serializada. :mod:`pickle` armazena esses objetos apenas uma vez e garante que todas as outras referências apontam para a cópia principal. Objetos partilhados permanecem partilhados, o que pode ser muito importante para objetos mutáveis.

source: :mod:`marshal` cannot be used to serialize user-defined classes and their instances. :mod:`pickle` can save and restore class instances transparently, however the class definition must be importable and live in the same module as when the object was stored.
pt_pt: :mod:`marshal` não pode ser usado para serializar classes definidas pelo utilizador e as suas instâncias. :mod:`pickle` pode guardar e restaurar instâncias de classes de forma transparente, no entanto, a definição da classe deve ser importável e estar no mesmo módulo que quando o objeto foi guardado.

source: The :mod:`marshal` serialization format is not guaranteed to be portable across Python versions. Because its primary job in life is to support :file:`.pyc` files, the Python implementers reserve the right to change the serialization format in non-backwards compatible ways should the need arise. The :mod:`pickle` serialization format is guaranteed to be backwards compatible across Python releases provided a compatible pickle protocol is chosen and pickling and unpickling code deals with Python 2 to Python 3 type differences if your data is crossing that unique breaking change language boundary.
pt_pt: O formato de serialização :mod:`marshal` não é garantido como portável entre versões do Python. Como a sua função principal é suportar ficheiros :file:`.pyc`, os implementadores do Python reservam o direito de alterar o formato de serialização de formas não retrocompatíveis, se necessário. O formato de serialização :mod:`pickle` é garantido como retrocompatível entre versões do Python, desde que seja escolhido um protocolo pickle compatível e o código de pickling e unpickling lide com as diferenças de tipo entre Python 2 e Python 3, se os seus dados atravessarem essa fronteira única de alteração.

source: Comparison with ``json``
pt_pt: Comparação com ``json``

source: There are fundamental differences between the pickle protocols and `JSON (JavaScript Object Notation) <https://json.org>`_:
pt_pt: Existem diferenças fundamentais entre os protocolos pickle e `JSON (JavaScript Object Notation) <https://json.org>`_:

source: JSON is a text serialization format (it outputs unicode text, although most of the time it is then encoded to ``utf-8``), while pickle is a binary serialization format;
pt_pt: JSON é um formato de serialização de texto (produz texto unicode, embora a maior parte do tempo seja depois codificado para ``utf-8``), enquanto pickle é um formato de serialização binário;

source: JSON is human-readable, while pickle is not;
pt_pt: JSON é legível por humanos, enquanto pickle não é;

source: JSON is interoperable and widely used outside of the Python ecosystem, while pickle is Python-specific;
pt_pt: JSON é interoperável e amplamente utilizado fora do ecossistema Python, enquanto pickle é específico do Python;

source: JSON, by default, can only represent a subset of the Python built-in types, and no custom classes; pickle can represent an extremely large number of Python types (many of them automatically, by clever usage of Python's introspection facilities; complex cases can be tackled by implementing :ref:`specific object APIs <pickle-inst>`);
pt_pt: JSON, por predefinição, só pode representar um subconjunto dos tipos integrados do Python, e nenhuma classe personalizada; pickle pode representar um número extremamente grande de tipos Python (muitos deles automaticamente, através do uso inteligente das facilidades de introspeção do Python; casos complexos podem ser abordados implementando :ref:`APIs específicas de objetos <pickle-inst>`);

source: Unlike pickle, deserializing untrusted JSON does not in itself create an arbitrary code execution vulnerability.
pt_pt: Ao contrário de pickle, desserializar JSON não confiável não cria, por si só, uma vulnerabilidade de execução de código arbitrário.

source: The :mod:`json` module: a standard library module allowing JSON serialization and deserialization.
pt_pt: O módulo :mod:`json`: um módulo da biblioteca padrão que permite serialização e desserialização JSON.

source: Data stream format
pt_pt: Formato do fluxo de dados

source: The data format used by :mod:`pickle` is Python-specific. This has the advantage that there are no restrictions imposed by external standards such as JSON (which can't represent pointer sharing); however it means that non-Python programs may not be able to reconstruct pickled Python objects.
pt_pt: O formato de dados usado por :mod:`pickle` é específico do Python. Isto tem a vantagem de não haver restrições impostas por padrões externos como JSON (que não pode representar partilha de ponteiros); no entanto, significa que programas não-Python podem não ser capazes de reconstruir objetos Python serializados.

source: By default, the :mod:`pickle` data format uses a relatively compact binary representation. If you need optimal size characteristics, you can efficiently :doc:`compress <archiving>` pickled data.
pt_pt: Por predefinição, o formato de dados :mod:`pickle` usa uma representação binária relativamente compacta. Se precisar de características de tamanho ótimas, pode :doc:`comprimir <archiving>` dados serializados de forma eficiente.

source: The module :mod:`pickletools` contains tools for analyzing data streams generated by :mod:`pickle`. :mod:`pickletools` source code has extensive comments about opcodes used by pickle protocols.
pt_pt: O módulo :mod:`pickletools` contém ferramentas para analisar fluxos de dados gerados por :mod:`pickle`. O código-fonte de :mod:`pickletools` tem comentários extensivos sobre os opcodes usados pelos protocolos pickle.

source: There are currently 6 different protocols which can be used for pickling. The higher the protocol used, the more recent the version of Python needed to read the pickle produced.
pt_pt: Atualmente, existem 6 protocolos diferentes que podem ser usados para pickling. Quanto mais alto for o protocolo usado, mais recente será a versão do Python necessária para ler o pickle produzido.

source: Protocol version 0 is the original "human-readable" protocol and is backwards compatible with earlier versions of Python.
pt_pt: A versão 0 do protocolo é o protocolo original "legível por humanos" e é retrocompatível com versões anteriores do Python.

source: Protocol version 1 is an old binary format which is also compatible with earlier versions of Python.
pt_pt: A versão 1 do protocolo é um formato binário antigo que também é compatível com versões anteriores do Python.

source: Protocol version 2 was introduced in Python 2.3. It provides much more efficient pickling of :term:`new-style classes <new-style class>`. Refer to :pep:`307` for information about improvements brought by protocol 2.
pt_pt: A versão 2 do protocolo foi introduzida no Python 2.3. Fornece uma serialização muito mais eficiente de :term:`novas classes <new-style class>`. Consulte :pep:`307` para informações sobre as melhorias trazidas pelo protocolo 2.

source: Protocol version 3 was added in Python 3.0. It has explicit support for :class:`bytes` objects and cannot be unpickled by Python 2.x. This was the default protocol in Python 3.0--3.7.
pt_pt: A versão 3 do protocolo foi adicionada no Python 3.0. Tem suporte explícito para objetos :class:`bytes` e não pode ser desserializada pelo Python 2.x. Este foi o protocolo predefinido no Python 3.0--3.7.

source: Serialization is a more primitive notion than persistence; although :mod:`pickle` reads and writes file objects, it does not handle the issue of naming persistent objects, nor the (even more complicated) issue of concurrent access to persistent objects. The :mod:`pickle` module can transform a complex object into a byte stream and it can transform the byte stream into an object with the same internal structure. Perhaps the most obvious thing to do with these byte streams is to write them onto a file, but it is also conceivable to send them across a network or store them in a database. The :mod:`shelve` module provides a simple interface to pickle and unpickle objects on DBM-style database files.
pt_pt: A serialização é um conceito mais primitivo do que a persistência; embora :mod:`pickle` leia e escreva objetos de ficheiros, não trata da questão de nomear objetos persistentes, nem da questão (ainda mais complicada) de acesso concorrente a objetos persistentes. O módulo :mod:`pickle` pode transformar um objeto complexo num fluxo de bytes e pode transformar o fluxo de bytes num objeto com a mesma estrutura interna. Talvez a coisa mais óbvia a fazer com estes fluxos de bytes seja escrevê-los num ficheiro, mas também é concebível enviá-los através de uma rede ou armazená-los numa base de dados. O módulo :mod:`shelve` fornece uma interface simples para serializar e desserializar objetos em ficheiros de base de dados do tipo DBM.

source: Module Interface
pt_pt: Interface do Módulo

source: To serialize an object hierarchy, you simply call the :func:`dumps` function. Similarly, to de-serialize a data stream, you call the :func:`loads` function. However, if you want more control over serialization and de-serialization, you can create a :class:`Pickler` or an :class:`Unpickler` object, respectively.
pt_pt: Para serializar uma hierarquia de objetos, basta chamar a função :func:`dumps`. Da mesma forma, para desserializar um fluxo de dados, chama a função :func:`loads`. No entanto, se quiser mais controlo sobre a serialização e desserialização, pode criar um objeto :class:`Pickler` ou :class:`Unpickler`, respetivamente.

source: The :mod:`pickle` module provides the following constants:
pt_pt: O módulo :mod:`pickle` fornece as seguintes constantes:

source: An integer, the highest :ref:`protocol version <pickle-protocols>` available. This value can be passed as a *protocol* value to functions :func:`dump` and :func:`dumps` as well as the :class:`Pickler` constructor.
pt_pt: Um inteiro, a versão mais alta do :ref:`protocolo <pickle-protocols>` disponível. Este valor pode ser passado como um valor de *protocolo* para as funções :func:`dump` e :func:`dumps`, bem como para o construtor :class:`Pickler`.

source: The default protocol is 3.
pt_pt: O protocolo predefinido é 3.

source: The default protocol is 4.
pt_pt: O protocolo predefinido é 4.

source: The :mod:`pickle` module provides the following functions to make the pickling process more convenient:
pt_pt: O módulo :mod:`pickle` fornece as seguintes funções para tornar o processo de pickling mais conveniente:

source: Write the pickled representation of the object *obj* to the open :term:`file object` *file*. This is equivalent to ``Pickler(file, protocol).dump(obj)``.
pt_pt: Escreve a representação serializada do objeto *obj* no objeto :term:`ficheiro` aberto *file*. Isto é equivalente a ``Pickler(file, protocol).dump(obj)``.

source: Arguments *file*, *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
pt_pt: Os argumentos *file*, *protocol*, *fix_imports* e *buffer_callback* têm o mesmo significado que no construtor :class:`Pickler`.

source: The *buffer_callback* argument was added.
pt_pt: O argumento *buffer_callback* foi adicionado.

source: Return the pickled representation of the object *obj* as a :class:`bytes` object, instead of writing it to a file.
pt_pt: Devolve a representação serializada do objeto *obj* como um objeto :class:`bytes`, em vez de o escrever num ficheiro.

source: Arguments *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
pt_pt: Os argumentos *protocol*, *fix_imports* e *buffer_callback* têm o mesmo significado que no construtor :class:`Pickler`.

source: Read the pickled representation of an object from the open :term:`file object` *file* and return the reconstituted object hierarchy specified therein. This is equivalent to ``Unpickler(file).load()``.
pt_pt: Lê a representação serializada de um objeto do objeto :term:`ficheiro` aberto *file* e devolve a hierarquia de objetos reconstituída especificada nele. Isto é equivalente a ``Unpickler(file).load()``.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed. Bytes past the pickled representation of the object are ignored.
pt_pt: A versão do protocolo do pickle é detetada automaticamente, por isso não é necessário nenhum argumento de protocolo. Os bytes após a representação serializada do objeto são ignorados.

source: Arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
pt_pt: Os argumentos *file*, *fix_imports*, *encoding*, *errors*, *strict* e *buffers* têm o mesmo significado que no construtor :class:`Unpickler`.

source: The *buffers* argument was added.
pt_pt: O argumento *buffers* foi adicionado.

source: Return the reconstituted object hierarchy of the pickled representation *data* of an object. *data* must be a :term:`bytes-like object`.
pt_pt: Devolve a hierarquia de objetos reconstituída da representação serializada *data* de um objeto. *data* deve ser um :term:`objeto tipo bytes`.

source: Arguments *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
pt_pt: Os argumentos *fix_imports*, *encoding*, *errors*, *strict* e *buffers* têm o mesmo significado que no construtor :class:`Unpickler`.

source: The :mod:`pickle` module defines three exceptions:
pt_pt: O módulo :mod:`pickle` define três exceções:

source: Common base class for the other pickling exceptions. It inherits from :exc:`Exception`.
pt_pt: Classe base comum para as outras exceções de pickling. Herda de :exc:`Exception`.

source: Error raised when an unpicklable object is encountered by :class:`Pickler`. It inherits from :exc:`PickleError`.
pt_pt: Erro levantado quando um objeto não serializável é encontrado por :class:`Pickler`. Herda de :exc:`PickleError`.

source: Refer to :ref:`pickle-picklable` to learn what kinds of objects can be pickled.
pt_pt: Consulte :ref:`pickle-picklable` para saber que tipos de objetos podem ser serializados.

source: Error raised when there is a problem unpickling an object, such as a data corruption or a security violation. It inherits from :exc:`PickleError`.
pt_pt: Erro levantado quando há um problema ao desserializar um objeto, como corrupção de dados ou violação de segurança. Herda de :exc:`PickleError`.

source: Note that other exceptions may also be raised during unpickling, including (but not necessarily limited to) AttributeError, EOFError, ImportError, and IndexError.
pt_pt: Note que outras exceções também podem ser levantadas durante a desserialização, incluindo (mas não necessariamente limitadas a) AttributeError, EOFError, ImportError e IndexError.

source: The :mod:`pickle` module exports three classes, :class:`Pickler`, :class:`Unpickler` and :class:`PickleBuffer`:
pt_pt: O módulo :mod:`pickle` exporta três classes, :class:`Pickler`, :class:`Unpickler` e :class:`PickleBuffer`:

source: This takes a binary file for writing a pickle data stream.
pt_pt: Isto recebe um ficheiro binário para escrever um fluxo de dados pickle.

source: The optional *protocol* argument, an integer, tells the pickler to use the given protocol; supported protocols are 0 to :data:`HIGHEST_PROTOCOL`. If not specified, the default is :data:`DEFAULT_PROTOCOL`. If a negative number is specified, :data:`HIGHEST_PROTOCOL` is selected.
pt_pt: O argumento opcional *protocol*, um inteiro, indica ao pickler para usar o protocolo dado; os protocolos suportados são de 0 a :data:`HIGHEST_PROTOCOL`. Se não for especificado, o predefinido é :data:`DEFAULT_PROTOCOL`. Se for especificado um número negativo, é selecionado :data:`HIGHEST_PROTOCOL`.

source: The *file* argument must have a write() method that accepts a single bytes argument. It can thus be an on-disk file opened for binary writing, an :class:`io.BytesIO` instance, or any other custom object that meets this interface.
pt_pt: O argumento *file* deve ter um método write() que aceite um único argumento de bytes. Pode, portanto, ser um ficheiro em disco aberto para escrita binária, uma instância de :class:`io.BytesIO`, ou qualquer outro objeto personalizado que cumpra esta interface.

source: If *fix_imports* is true and *protocol* is less than 3, pickle will try to map the new Python 3 names to the old module names used in Python 2, so that the pickle data stream is readable with Python 2.
pt_pt: Se *fix_imports* for verdadeiro e *protocol* for menor que 3, pickle tentará mapear os novos nomes do Python 3 para os antigos nomes de módulos usados no Python 2, de modo que o fluxo de dados pickle seja legível com Python 2.

source: If *buffer_callback* is ``None`` (the default), buffer views are serialized into *file* as part of the pickle stream.
pt_pt: Se *buffer_callback* for ``None`` (predefinição), as vistas de buffer são serializadas para *file* como parte do fluxo pickle.

source: If *buffer_callback* is not ``None``, then it can be called any number of times with a buffer view. If the callback returns a false value (such as ``None``), the given buffer is :ref:`out-of-band <pickle-oob>`; otherwise the buffer is serialized in-band, i.e. inside the pickle stream.
pt_pt: Se *buffer_callback* não for ``None``, então pode ser chamado qualquer número de vezes com uma vista de buffer. Se o callback devolver um valor falso (como ``None``), o buffer dado é :ref:`fora de banda <pickle-oob>`; caso contrário, o buffer é serializado em banda, ou seja, dentro do fluxo pickle.

source: It is an error if *buffer_callback* is not ``None`` and *protocol* is ``None`` or smaller than 5.
pt_pt: É um erro se *buffer_callback* não for ``None`` e *protocol* for ``None`` ou menor que 5.

source: Write the pickled representation of *obj* to the open file object given in the constructor.
pt_pt: Escreve a representação serializada de *obj* no objeto de ficheiro aberto dado no construtor.

source: Do nothing by default. This exists so a subclass can override it.
pt_pt: Não faz nada por predefinição. Isto existe para que uma subclasse possa substituí-lo.
