Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: pt_pt

source: For a class that has :attr:`~object.__slots__` and no instance :attr:`~object.__dict__`, the default state is a tuple whose first item is ``None`` and whose second item is a dictionary mapping slot names to slot values described in the previous bullet.
pt_pt: Para uma classe que tem :attr:`~object.__slots__` e nenhum :attr:`~object.__dict__` de instância, o estado predefinido é um tuplo cujo primeiro item é ``None`` e cujo segundo item é um dicionário que mapeia nomes de slots para valores de slots, conforme descrito no ponto anterior.

source: Added the default implementation of the ``__getstate__()`` method in the :class:`object` class.
pt_pt: Adicionada a implementação predefinida do método ``__getstate__()`` na classe :class:`object`.

source: Upon unpickling, if the class defines :meth:`__setstate__`, it is called with the unpickled state. In that case, there is no requirement for the state object to be a dictionary. Otherwise, the pickled state must be a dictionary and its items are assigned to the new instance's dictionary.
pt_pt: Durante a desserialização, se a classe definir :meth:`__setstate__`, este é chamado com o estado desserializado. Nesse caso, não há requisito para que o objeto de estado seja um dicionário. Caso contrário, o estado serializado deve ser um dicionário e os seus itens são atribuídos ao dicionário da nova instância.

source: If :meth:`__reduce__` returns a state with value ``None`` at pickling, the :meth:`__setstate__` method will not be called upon unpickling.
pt_pt: Se :meth:`__reduce__` devolver um estado com valor ``None`` durante a serialização, o método :meth:`__setstate__` não será chamado durante a desserialização.

source: Refer to the section :ref:`pickle-state` for more information about how to use the methods :meth:`~object.__getstate__` and :meth:`~object.__setstate__`.
pt_pt: Consulte a secção :ref:`pickle-state` para mais informações sobre como usar os métodos :meth:`~object.__getstate__` e :meth:`~object.__setstate__`.

source: At unpickling time, some methods like :meth:`~object.__getattr__`, :meth:`~object.__getattribute__`, or :meth:`~object.__setattr__` may be called upon the instance. In case those methods rely on some internal invariant being true, the type should implement :meth:`~object.__new__` to establish such an invariant, as :meth:`~object.__init__` is not called when unpickling an instance.
pt_pt: Durante a desserialização, alguns métodos como :meth:`~object.__getattr__`, :meth:`~object.__getattribute__`, ou :meth:`~object.__setattr__` podem ser chamados na instância. Caso esses métodos dependam de algum invariante interno ser verdadeiro, o tipo deve implementar :meth:`~object.__new__` para estabelecer tal invariante, uma vez que :meth:`~object.__init__` não é chamado durante a desserialização de uma instância.

source: As we shall see, pickle does not use directly the methods described above. In fact, these methods are part of the copy protocol which implements the :meth:`~object.__reduce__` special method. The copy protocol provides a unified interface for retrieving the data necessary for pickling and copying objects. [#]_
pt_pt: Como veremos, pickle não usa diretamente os métodos descritos acima. Na verdade, estes métodos fazem parte do protocolo de cópia que implementa o método especial :meth:`~object.__reduce__`. O protocolo de cópia fornece uma interface unificada para recuperar os dados necessários para serializar e copiar objetos. [#]_

source: Although powerful, implementing :meth:`~object.__reduce__` directly in your classes is error prone. For this reason, class designers should use the high-level interface (i.e., :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` and :meth:`~object.__setstate__`) whenever possible. We will show, however, cases where using :meth:`!__reduce__` is the only option or leads to more efficient pickling or both.
pt_pt: Embora poderoso, implementar :meth:`~object.__reduce__` diretamente nas suas classes é propenso a erros. Por esta razão, os designers de classes devem usar a interface de alto nível (ou seja, :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` e :meth:`~object.__setstate__`) sempre que possível. No entanto, mostraremos casos em que o uso de :meth:`!__reduce__` é a única opção ou leva a uma serialização mais eficiente, ou ambos.

source: The interface is currently defined as follows. The :meth:`__reduce__` method takes no argument and shall return either a string or preferably a tuple (the returned object is often referred to as the "reduce value").
pt_pt: A interface está atualmente definida da seguinte forma. O método :meth:`__reduce__` não recebe argumentos e deve devolver uma string ou, preferencialmente, um tuplo (o objeto devolvido é frequentemente referido como o "valor de redução").

source: If a string is returned, the string should be interpreted as the name of a global variable. It should be the object's local name relative to its module; the pickle module searches the module namespace to determine the object's module. This behaviour is typically useful for singletons.
pt_pt: Se for devolvida uma string, esta deve ser interpretada como o nome de uma variável global. Deve ser o nome local do objeto em relação ao seu módulo; o módulo pickle pesquisa o namespace do módulo para determinar o módulo do objeto. Este comportamento é tipicamente útil para singletons.

source: When a tuple is returned, it must be between two and six items long. Optional items can either be omitted, or ``None`` can be provided as their value. The semantics of each item are in order:
pt_pt: Quando é devolvido um tuplo, este deve ter entre dois e seis itens. Itens opcionais podem ser omitidos ou pode ser fornecido ``None`` como seu valor. A semântica de cada item é, por ordem:

source: A callable object that will be called to create the initial version of the object.
pt_pt: Um objeto chamável que será chamado para criar a versão inicial do objeto.

source: A tuple of arguments for the callable object. An empty tuple must be given if the callable does not accept any argument.
pt_pt: Um tuplo de argumentos para o objeto chamável. Um tuplo vazio deve ser fornecido se o objeto chamável não aceitar nenhum argumento.

source: Optionally, the object's state, which will be passed to the object's :meth:`__setstate__` method as previously described. If the object has no such method then, the value must be a dictionary and it will be added to the object's :attr:`~object.__dict__` attribute.
pt_pt: Opcionalmente, o estado do objeto, que será passado para o método :meth:`__setstate__` do objeto, como descrito anteriormente. Se o objeto não tiver esse método, o valor deve ser um dicionário e será adicionado ao atributo :attr:`~object.__dict__` do objeto.

source: Optionally, an iterator (and not a sequence) yielding successive items. These items will be appended to the object either using ``obj.append(item)`` or, in batch, using ``obj.extend(list_of_items)``. This is primarily used for list subclasses, but may be used by other classes as long as they have :meth:`~sequence.append` and :meth:`~sequence.extend` methods with the appropriate signature. (Whether :meth:`!append` or :meth:`!extend` is used depends on which pickle protocol version is used as well as the number of items to append, so both must be supported.)
pt_pt: Opcionalmente, um iterador (e não uma sequência) que produz itens sucessivos. Estes itens serão adicionados ao objeto usando ``obj.append(item)`` ou, em lote, usando ``obj.extend(list_of_items)``. Isto é usado principalmente para subclasses de listas, mas pode ser usado por outras classes, desde que tenham os métodos :meth:`~sequence.append` e :meth:`~sequence.extend` com a assinatura apropriada. (Se é usado :meth:`!append` ou :meth:`!extend` depende da versão do protocolo de *pickle* e do número de itens a adicionar, pelo que ambos devem ser suportados.)

source: Optionally, an iterator (not a sequence) yielding successive key-value pairs. These items will be stored to the object using ``obj[key] = value``. This is primarily used for dictionary subclasses, but may be used by other classes as long as they implement :meth:`__setitem__`.
pt_pt: Opcionalmente, um iterador (não uma sequência) que produz pares chave-valor sucessivos. Estes itens serão armazenados no objeto usando ``obj[key] = value``. Isto é usado principalmente para subclasses de dicionários, mas pode ser usado por outras classes, desde que implementem :meth:`__setitem__`.

source: Optionally, a callable with a ``(obj, state)`` signature. This callable allows the user to programmatically control the state-updating behavior of a specific object, instead of using ``obj``'s static :meth:`__setstate__` method. If not ``None``, this callable will have priority over ``obj``'s :meth:`__setstate__`.
pt_pt: Opcionalmente, um objeto invocável com a assinatura ``(obj, state)``. Este objeto invocável permite ao utilizador controlar programaticamente o comportamento de atualização de estado de um objeto específico, em vez de usar o método estático :meth:`__setstate__` de ``obj``. Se não for ``None``, este objeto invocável terá prioridade sobre o :meth:`__setstate__` de ``obj``.

source: The optional sixth tuple item, ``(obj, state)``, was added.
pt_pt: O sexto item opcional do tuplo, ``(obj, state)``, foi adicionado.

source: Alternatively, a :meth:`__reduce_ex__` method may be defined. The only difference is this method should take a single integer argument, the protocol version. When defined, pickle will prefer it over the :meth:`__reduce__` method. In addition, :meth:`__reduce__` automatically becomes a synonym for the extended version. The main use for this method is to provide backwards-compatible reduce values for older Python releases.
pt_pt: Alternativamente, pode ser definido um método :meth:`__reduce_ex__`. A única diferença é que este método deve aceitar um único argumento inteiro, a versão do protocolo. Quando definido, o *pickle* preferirá este método em relação ao :meth:`__reduce__`. Além disso, :meth:`__reduce__` torna-se automaticamente um sinónimo da versão estendida. O principal uso deste método é fornecer valores de redução retrocompatíveis para versões mais antigas do Python.

source: Persistence of External Objects
pt_pt: Persistência de Objetos Externos

source: For the benefit of object persistence, the :mod:`pickle` module supports the notion of a reference to an object outside the pickled data stream. Such objects are referenced by a persistent ID, which should be either a string of alphanumeric characters (for protocol 0) [#]_ or just an arbitrary object (for any newer protocol).
pt_pt: Para benefício da persistência de objetos, o módulo :mod:`pickle` suporta a noção de uma referência a um objeto fora do fluxo de dados *pickled*. Estes objetos são referenciados por um ID persistente, que deve ser uma *string* de caracteres alfanuméricos (para o protocolo 0) [#]_ ou simplesmente um objeto arbitrário (para qualquer protocolo mais recente).

source: The resolution of such persistent IDs is not defined by the :mod:`pickle` module; it will delegate this resolution to the user-defined methods on the pickler and unpickler, :meth:`~Pickler.persistent_id` and :meth:`~Unpickler.persistent_load` respectively.
pt_pt: A resolução destes IDs persistentes não é definida pelo módulo :mod:`pickle`; esta resolução é delegada aos métodos definidos pelo utilizador no *pickler* e no *unpickler*, :meth:`~Pickler.persistent_id` e :meth:`~Unpickler.persistent_load`, respetivamente.

source: To pickle objects that have an external persistent ID, the pickler must have a custom :meth:`~Pickler.persistent_id` method that takes an object as an argument and returns either ``None`` or the persistent ID for that object. When ``None`` is returned, the pickler simply pickles the object as normal. When a persistent ID string is returned, the pickler will pickle that object, along with a marker so that the unpickler will recognize it as a persistent ID.
pt_pt: Para *picklar* objetos que têm um ID persistente externo, o *pickler* deve ter um método personalizado :meth:`~Pickler.persistent_id` que aceita um objeto como argumento e retorna ``None`` ou o ID persistente para esse objeto. Quando é retornado ``None``, o *pickler* *pickla* o objeto normalmente. Quando é retornada uma *string* de ID persistente, o *pickler* vai *picklar* esse objeto, juntamente com um marcador para que o *unpickler* o reconheça como um ID persistente.

source: To unpickle external objects, the unpickler must have a custom :meth:`~Unpickler.persistent_load` method that takes a persistent ID object and returns the referenced object.
pt_pt: Para *unpicklar* objetos externos, o *unpickler* deve ter um método personalizado :meth:`~Unpickler.persistent_load` que aceita um objeto de ID persistente e retorna o objeto referenciado.

source: Here is a comprehensive example presenting how persistent ID can be used to pickle external objects by reference.
pt_pt: Segue-se um exemplo abrangente que demonstra como o ID persistente pode ser usado para *picklar* objetos externos por referência.

source: Dispatch Tables
pt_pt: Tabelas de Despacho

source: If one wants to customize pickling of some classes without disturbing any other code which depends on pickling, then one can create a pickler with a private dispatch table.
pt_pt: Se se pretender personalizar o *pickling* de algumas classes sem afetar outro código que dependa do *pickling*, pode-se criar um *pickler* com uma tabela de despacho privada.

source: The global dispatch table managed by the :mod:`copyreg` module is available as :data:`!copyreg.dispatch_table`. Therefore, one may choose to use a modified copy of :data:`!copyreg.dispatch_table` as a private dispatch table.
pt_pt: A tabela de despacho global gerida pelo módulo :mod:`copyreg` está disponível como :data:`!copyreg.dispatch_table`. Portanto, pode-se optar por usar uma cópia modificada de :data:`!copyreg.dispatch_table` como tabela de despacho privada.

source: For example ::
pt_pt: Por exemplo:

source: creates an instance of :class:`pickle.Pickler` with a private dispatch table which handles the ``SomeClass`` class specially. Alternatively, the code ::
pt_pt: cria uma instância de :class:`pickle.Pickler` com uma tabela de despacho privada que trata a classe ``SomeClass`` de forma especial. Alternativamente, o código:

source: does the same but all instances of ``MyPickler`` will by default share the private dispatch table. On the other hand, the code ::
pt_pt: faz o mesmo, mas todas as instâncias de ``MyPickler`` partilharão, por predefinição, a tabela de despacho privada. Por outro lado, o código:

source: modifies the global dispatch table shared by all users of the :mod:`copyreg` module.
pt_pt: modifica a tabela de despacho global partilhada por todos os utilizadores do módulo :mod:`copyreg`.

source: Handling Stateful Objects
pt_pt: Tratamento de Objetos com Estado

source: Here's an example that shows how to modify pickling behavior for a class. The :class:`!TextReader` class below opens a text file, and returns the line number and line contents each time its :meth:`!readline` method is called. If a :class:`!TextReader` instance is pickled, all attributes *except* the file object member are saved. When the instance is unpickled, the file is reopened, and reading resumes from the last location. The :meth:`!__setstate__` and :meth:`!__getstate__` methods are used to implement this behavior. ::
pt_pt: Segue-se um exemplo que mostra como modificar o comportamento de *pickling* para uma classe. A classe :class:`!TextReader` abaixo abre um ficheiro de texto e retorna o número da linha e o conteúdo da linha cada vez que o seu método :meth:`!readline` é chamado. Se uma instância de :class:`!TextReader` for *picklada*, todos os atributos, exceto o membro do objeto ficheiro, são guardados. Quando a instância é *unpicklada*, o ficheiro é reaberto e a leitura retoma a partir da última localização. Os métodos :meth:`!__setstate__` e :meth:`!__getstate__` são usados para implementar este comportamento.

source: class TextReader: """Print and number lines in a text file.""" def __init__(self, filename): self.filename = filename self.file = open(filename) self.lineno = 0 def readline(self): self.lineno += 1 line = self.file.readline() if not line: return None if line.endswith('\n'): line = line[:-1] return "%i: %s" % (self.lineno, line) def __getstate__(self): # Copy the object's state from self.__dict__ which contains # all our instance attributes. Always use the dict.copy() # method to avoid modifying the original state. state = self.__dict__.copy() # Remove the unpicklable entries. del state['file'] return state def __setstate__(self, state): # Restore instance attributes (i.e., filename and lineno). self.__dict__.update(state) # Restore the previously opened file's state. To do so, we need to # reopen it and read from it until the line count is restored. file = open(self.filename) for _ in range(self.lineno): file.readline() # Finally, save the file. self.file = file
pt_pt: class TextReader: """Imprime e numera linhas num ficheiro de texto.""" def __init__(self, filename): self.filename = filename self.file = open(filename) self.lineno = 0 def readline(self): self.lineno += 1 line = self.file.readline() if not line: return None if line.endswith('\n'): line = line[:-1] return "%i: %s" % (self.lineno, line) def __getstate__(self): # Copia o estado do objeto a partir de self.__dict__, que contém # todos os atributos da instância. Usar sempre o método dict.copy() # para evitar modificar o estado original. state = self.__dict__.copy() # Remove as entradas não *pickláveis*. del state['file'] return state def __setstate__(self, state): # Restaura os atributos da instância (ou seja, filename e lineno). self.__dict__.update(state) # Restaura o estado do ficheiro previamente aberto. Para tal, é necessário # reabri-lo e ler a partir dele até que a contagem de linhas seja restaurada. file = open(self.filename) for _ in range(self.lineno): file.readline() # Finalmente, guarda o ficheiro. self.file = file

source: A sample usage might be something like this::
pt_pt: Um exemplo de utilização pode ser algo como:

source: >>> reader = TextReader("hello.txt") >>> reader.readline() '1: Hello world!' >>> reader.readline() '2: I am line number two.' >>> new_reader = pickle.loads(pickle.dumps(reader)) >>> new_reader.readline() '3: Goodbye!'
pt_pt: >>> reader = TextReader("hello.txt") >>> reader.readline() '1: Olá mundo!' >>> reader.readline() '2: Sou a linha número dois.' >>> new_reader = pickle.loads(pickle.dumps(reader)) >>> new_reader.readline() '3: Adeus!'

source: Custom Reduction for Types, Functions, and Other Objects
pt_pt: Redução Personalizada para Tipos, Funções e Outros Objetos

source: Sometimes, :attr:`~Pickler.dispatch_table` may not be flexible enough. In particular we may want to customize pickling based on another criterion than the object's type, or we may want to customize the pickling of functions and classes.
pt_pt: Por vezes, :attr:`~Pickler.dispatch_table` pode não ser suficientemente flexível. Em particular, podemos querer personalizar o *pickling* com base noutro critério que não o tipo do objeto, ou podemos querer personalizar o *pickling* de funções e classes.

source: For those cases, it is possible to subclass from the :class:`Pickler` class and implement a :meth:`~Pickler.reducer_override` method. This method can return an arbitrary reduction tuple (see :meth:`~object.__reduce__`). It can alternatively return :data:`NotImplemented` to fallback to the traditional behavior.
pt_pt: Para esses casos, é possível criar uma subclasse da classe :class:`Pickler` e implementar um método :meth:`~Pickler.reducer_override`. Este método pode retornar um tuplo de redução arbitrário (ver :meth:`~object.__reduce__`). Alternativamente, pode retornar :data:`NotImplemented` para reverter para o comportamento tradicional.

source: If both the :attr:`~Pickler.dispatch_table` and :meth:`~Pickler.reducer_override` are defined, then :meth:`~Pickler.reducer_override` method takes priority.
pt_pt: Se tanto :attr:`~Pickler.dispatch_table` como :meth:`~Pickler.reducer_override` estiverem definidos, então o método :meth:`~Pickler.reducer_override` tem prioridade.

source: For performance reasons, :meth:`~Pickler.reducer_override` may not be called for the following objects: ``None``, ``True``, ``False``, and exact instances of :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` and :class:`tuple`.
pt_pt: Por razões de desempenho, :meth:`~Pickler.reducer_override` pode não ser chamado para os seguintes objetos: ``None``, ``True``, ``False``, e instâncias exatas de :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` e :class:`tuple`.

source: Here is a simple example where we allow pickling and reconstructing a given class::
pt_pt: Segue-se um exemplo simples em que permitimos *picklar* e reconstruir uma classe dada:

source: import io import pickle class MyClass: my_attribute = 1 class MyPickler(pickle.Pickler): def reducer_override(self, obj): """Custom reducer for MyClass.""" if getattr(obj, "__name__", None) == "MyClass": return type, (obj.__name__, obj.__bases__, {'my_attribute': obj.my_attribute}) else: # For any other object, fallback to usual reduction return NotImplemented f = io.BytesIO() p = MyPickler(f) p.dump(MyClass) del MyClass unpickled_class = pickle.loads(f.getvalue()) assert isinstance(unpickled_class, type) assert unpickled_class.__name__ == "MyClass" assert unpickled_class.my_attribute == 1
pt_pt: import io import pickle class MyClass: my_attribute = 1 class MyPickler(pickle.Pickler): def reducer_override(self, obj): """Redutor personalizado para MyClass.""" if getattr(obj, "__name__", None) == "MyClass": return type, (obj.__name__, obj.__bases__, {'my_attribute': obj.my_attribute}) else: # Para qualquer outro objeto, reverter para a redução habitual return NotImplemented f = io.BytesIO() p = MyPickler(f) p.dump(MyClass) del MyClass unpickled_class = pickle.loads(f.getvalue()) assert isinstance(unpickled_class, type) assert unpickled_class.__name__ == "MyClass" assert unpickled_class.my_attribute == 1

source: Out-of-band Buffers
pt_pt: Buffers Fora de Banda

source: In some contexts, the :mod:`pickle` module is used to transfer massive amounts of data. Therefore, it can be important to minimize the number of memory copies, to preserve performance and resource consumption. However, normal operation of the :mod:`pickle` module, as it transforms a graph-like structure of objects into a sequential stream of bytes, intrinsically involves copying data to and from the pickle stream.
pt_pt: Em alguns contextos, o módulo :mod:`pickle` é usado para transferir grandes quantidades de dados. Portanto, pode ser importante minimizar o número de cópias de memória, para preservar o desempenho e o consumo de recursos. No entanto, a operação normal do módulo :mod:`pickle`, ao transformar uma estrutura de objetos em forma de grafo num fluxo sequencial de bytes, envolve intrinsecamente a cópia de dados para e a partir do fluxo *pickle*.
