Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: pt_pt

source: This constraint can be eschewed if both the *provider* (the implementation of the object types to be transferred) and the *consumer* (the implementation of the communications system) support the out-of-band transfer facilities provided by pickle protocol 5 and higher.
pt_pt: Esta restrição pode ser contornada se tanto o *fornecedor* (a implementação dos tipos de objetos a transferir) como o *consumidor* (a implementação do sistema de comunicações) suportarem as funcionalidades de transferência fora de banda fornecidas pelo protocolo *pickle* 5 e superiores.

source: Provider API
pt_pt: API do Fornecedor

source: The large data objects to be pickled must implement a :meth:`~object.__reduce_ex__` method specialized for protocol 5 and higher, which returns a :class:`PickleBuffer` instance (instead of e.g. a :class:`bytes` object) for any large data.
pt_pt: Os objetos de dados grandes a serem *picklados* devem implementar um método :meth:`~object.__reduce_ex__` especializado para o protocolo 5 e superiores, que retorna uma instância de :class:`PickleBuffer` (em vez de, por exemplo, um objeto :class:`bytes`) para quaisquer dados grandes.

source: A :class:`PickleBuffer` object *signals* that the underlying buffer is eligible for out-of-band data transfer. Those objects remain compatible with normal usage of the :mod:`pickle` module. However, consumers can also opt-in to tell :mod:`pickle` that they will handle those buffers by themselves.
pt_pt: Um objeto :class:`PickleBuffer` *sinaliza* que o buffer subjacente é elegível para transferência de dados fora de banda. Esses objetos permanecem compatíveis com o uso normal do módulo :mod:`pickle`. No entanto, os consumidores também podem optar por informar o :mod:`pickle` de que tratarão esses buffers por si próprios.

source: Consumer API
pt_pt: API do Consumidor

source: A communications system can enable custom handling of the :class:`PickleBuffer` objects generated when serializing an object graph.
pt_pt: Um sistema de comunicações pode permitir o tratamento personalizado dos objetos :class:`PickleBuffer` gerados durante a serialização de um grafo de objetos.

source: On the sending side, it needs to pass a *buffer_callback* argument to :class:`Pickler` (or to the :func:`dump` or :func:`dumps` function), which will be called with each :class:`PickleBuffer` generated while pickling the object graph. Buffers accumulated by the *buffer_callback* will not see their data copied into the pickle stream, only a cheap marker will be inserted.
pt_pt: Do lado do remetente, é necessário passar um argumento *buffer_callback* para :class:`Pickler` (ou para a função :func:`dump` ou :func:`dumps`), que será chamado com cada :class:`PickleBuffer` gerado durante o *pickling* do grafo de objetos. Os buffers acumulados pelo *buffer_callback* não terão os seus dados copiados para o fluxo *pickle*; apenas um marcador económico será inserido.

source: On the receiving side, it needs to pass a *buffers* argument to :class:`Unpickler` (or to the :func:`load` or :func:`loads` function), which is an iterable of the buffers which were passed to *buffer_callback*. That iterable should produce buffers in the same order as they were passed to *buffer_callback*. Those buffers will provide the data expected by the reconstructors of the objects whose pickling produced the original :class:`PickleBuffer` objects.
pt_pt: Do lado do recetor, é necessário passar um argumento *buffers* para :class:`Unpickler` (ou para a função :func:`load` ou :func:`loads`), que é um iterável dos buffers que foram passados para *buffer_callback*. Esse iterável deve produzir buffers na mesma ordem em que foram passados para *buffer_callback*. Esses buffers fornecerão os dados esperados pelos reconstrutores dos objetos cujo *pickling* produziu os objetos :class:`PickleBuffer` originais.

source: Between the sending side and the receiving side, the communications system is free to implement its own transfer mechanism for out-of-band buffers. Potential optimizations include the use of shared memory or datatype-dependent compression.
pt_pt: Entre o lado do remetente e o lado do recetor, o sistema de comunicações pode implementar o seu próprio mecanismo de transferência para buffers fora de banda. Potenciais otimizações incluem o uso de memória partilhada ou compressão dependente do tipo de dados.

source: Example
pt_pt: Exemplo

source: Here is a trivial example where we implement a :class:`bytearray` subclass able to participate in out-of-band buffer pickling::
pt_pt: Segue-se um exemplo trivial em que implementamos uma subclasse de :class:`bytearray` capaz de participar no *pickling* de buffers fora de banda:

source: class ZeroCopyByteArray(bytearray): def __reduce_ex__(self, protocol): if protocol >= 5: return type(self)._reconstruct, (PickleBuffer(self),), None else: # PickleBuffer is forbidden with pickle protocols <= 4. return type(self)._reconstruct, (bytearray(self),) @classmethod def _reconstruct(cls, obj): with memoryview(obj) as m: # Get a handle over the original buffer object obj = m.obj if type(obj) is cls: # Original buffer object is a ZeroCopyByteArray, return it # as-is. return obj else: return cls(obj)
pt_pt: class ZeroCopyByteArray(bytearray): def __reduce_ex__(self, protocol): if protocol >= 5: return type(self)._reconstruct, (PickleBuffer(self),), None else: # PickleBuffer é proibido com protocolos *pickle* <= 4. return type(self)._reconstruct, (bytearray(self),) @classmethod def _reconstruct(cls, obj): with memoryview(obj) as m: # Obtém uma referência ao objeto buffer original obj = m.obj if type(obj) is cls: # O objeto buffer original é um ZeroCopyByteArray, retorna-o # como está. return obj else: return cls(obj)

source: The reconstructor (the ``_reconstruct`` class method) returns the buffer's providing object if it has the right type. This is an easy way to simulate zero-copy behaviour on this toy example.
pt_pt: O reconstrutor (o método de classe ``_reconstruct``) retorna o objeto que fornece o buffer se este tiver o tipo correto. Esta é uma forma simples de simular comportamento de cópia zero neste exemplo trivial.

source: On the consumer side, we can pickle those objects the usual way, which when unserialized will give us a copy of the original object::
pt_pt: Do lado do consumidor, podemos *picklar* esses objetos da forma habitual, o que, quando desserializado, nos dará uma cópia do objeto original:

source: b = ZeroCopyByteArray(b"abc") data = pickle.dumps(b, protocol=5) new_b = pickle.loads(data) print(b == new_b) # True print(b is new_b) # False: a copy was made
pt_pt: b = ZeroCopyByteArray(b"abc") data = pickle.dumps(b, protocol=5) new_b = pickle.loads(data) print(b == new_b) # True print(b is new_b) # False: foi feita uma cópia

source: But if we pass a *buffer_callback* and then give back the accumulated buffers when unserializing, we are able to get back the original object::
pt_pt: Mas se passarmos um *buffer_callback* e depois devolvemos os buffers acumulados durante a desserialização, conseguimos recuperar o objeto original:

source: b = ZeroCopyByteArray(b"abc") buffers = [] data = pickle.dumps(b, protocol=5, buffer_callback=buffers.append) new_b = pickle.loads(data, buffers=buffers) print(b == new_b) # True print(b is new_b) # True: no copy was made
pt_pt: b = ZeroCopyByteArray(b"abc") buffers = [] data = pickle.dumps(b, protocol=5, buffer_callback=buffers.append) new_b = pickle.loads(data, buffers=buffers) print(b == new_b) # True print(b is new_b) # True: não foi feita cópia

source: This example is limited by the fact that :class:`bytearray` allocates its own memory: you cannot create a :class:`bytearray` instance that is backed by another object's memory. However, third-party datatypes such as NumPy arrays do not have this limitation, and allow use of zero-copy pickling (or making as few copies as possible) when transferring between distinct processes or systems.
pt_pt: Este exemplo está limitado pelo facto de :class:`bytearray` alocar a sua própria memória: não é possível criar uma instância de :class:`bytearray` que seja suportada pela memória de outro objeto. No entanto, tipos de dados de terceiros, como *arrays* NumPy, não têm esta limitação e permitem o uso de *pickling* sem cópia (ou fazendo o menor número de cópias possível) ao transferir entre processos ou sistemas distintos.

source: :pep:`574` -- Pickle protocol 5 with out-of-band data
pt_pt: :pep:`574` -- Protocolo *pickle* 5 com dados fora de banda

source: Restricting Globals
pt_pt: Restrição de Globais

source: By default, unpickling will import any class or function that it finds in the pickle data. For many applications, this behaviour is unacceptable as it permits the unpickler to import and invoke arbitrary code. Just consider what this hand-crafted pickle data stream does when loaded::
pt_pt: Por predefinição, o *unpickling* importará qualquer classe ou função que encontre nos dados *pickle*. Para muitas aplicações, este comportamento é inaceitável, pois permite que o *unpickler* importe e invoque código arbitrário. Basta considerar o que este fluxo de dados *pickle* feito à mão faz quando carregado:

source: In this example, the unpickler imports the :func:`os.system` function and then apply the string argument "echo hello world". Although this example is inoffensive, it is not difficult to imagine one that could damage your system.
pt_pt: Neste exemplo, o *unpickler* importa a função :func:`os.system` e depois aplica o argumento de *string* "echo hello world". Embora este exemplo seja inofensivo, não é difícil imaginar um que poderia danificar o sistema.

source: For this reason, you may want to control what gets unpickled by customizing :meth:`Unpickler.find_class`. Unlike its name suggests, :meth:`Unpickler.find_class` is called whenever a global (i.e., a class or a function) is requested. Thus it is possible to either completely forbid globals or restrict them to a safe subset.
pt_pt: Por esta razão, pode querer controlar o que é *unpicklado* personalizando :meth:`Unpickler.find_class`. Ao contrário do que o nome sugere, :meth:`Unpickler.find_class` é chamado sempre que um global (ou seja, uma classe ou uma função) é solicitado. Assim, é possível proibir completamente os globais ou restringi-los a um subconjunto seguro.

source: Here is an example of an unpickler allowing only few safe classes from the :mod:`builtins` module to be loaded::
pt_pt: Segue-se um exemplo de um *unpickler* que permite apenas que algumas classes seguras do módulo :mod:`builtins` sejam carregadas:

source: import builtins import io import pickle safe_builtins = { 'range', 'complex', 'set', 'frozenset', 'slice', } class RestrictedUnpickler(pickle.Unpickler): def find_class(self, module, name): # Only allow safe classes from builtins. if module == "builtins" and name in safe_builtins: return getattr(builtins, name) # Forbid everything else. raise pickle.UnpicklingError("global '%s.%s' is forbidden" % (module, name)) def restricted_loads(s): """Helper function analogous to pickle.loads().""" return RestrictedUnpickler(io.BytesIO(s)).load()
pt_pt: import builtins import io import pickle safe_builtins = { 'range', 'complex', 'set', 'frozenset', 'slice', } class RestrictedUnpickler(pickle.Unpickler): def find_class(self, module, name): # Permite apenas classes seguras de builtins. if module == "builtins" and name in safe_builtins: return getattr(builtins, name) # Proíbe tudo o resto. raise pickle.UnpicklingError("global '%s.%s' é proibido" % (module, name)) def restricted_loads(s): """Função auxiliar análoga a pickle.loads().""" return RestrictedUnpickler(io.BytesIO(s)).load()

source: A sample usage of our unpickler working as intended::
pt_pt: Um exemplo de utilização do nosso *unpickler* a funcionar como pretendido:

source: >>> restricted_loads(pickle.dumps([1, 2, range(15)])) [1, 2, range(0, 15)] >>> restricted_loads(b"cos\nsystem\n(S'echo hello world'\ntR.") Traceback (most recent call last): ... pickle.UnpicklingError: global 'os.system' is forbidden >>> restricted_loads(b'cbuiltins\neval\n' ... b'(S\'getattr(__import__("os"), "system")' ... b'("echo hello world")\'\ntR.') Traceback (most recent call last): ... pickle.UnpicklingError: global 'builtins.eval' is forbidden
pt_pt: >>> restricted_loads(pickle.dumps([1, 2, range(15)])) [1, 2, range(0, 15)] >>> restricted_loads(b"cos\nsystem\n(S'echo hello world'\ntR.") Traceback (most recent call last): ... pickle.UnpicklingError: global 'os.system' é proibido >>> restricted_loads(b'cbuiltins\neval\n' ... b'(S\'getattr(__import__("os"), "system")' ... b'("echo hello world")\'\ntR.') Traceback (most recent call last): ... pickle.UnpicklingError: global 'builtins.eval' é proibido

source: As our examples shows, you have to be careful with what you allow to be unpickled. Therefore if security is a concern, you may want to consider alternatives such as the marshalling API in :mod:`xmlrpc.client` or third-party solutions.
pt_pt: Como os nossos exemplos mostram, deve ter cuidado com o que permite ser *unpicklado*. Portanto, se a segurança for uma preocupação, pode querer considerar alternativas como a API de *marshalling* em :mod:`xmlrpc.client` ou soluções de terceiros.

source: Performance
pt_pt: Desempenho

source: Recent versions of the pickle protocol (from protocol 2 and upwards) feature efficient binary encodings for several common features and built-in types. Also, the :mod:`pickle` module has a transparent optimizer written in C.
pt_pt: As versões recentes do protocolo *pickle* (a partir do protocolo 2) apresentam codificações binárias eficientes para várias funcionalidades comuns e tipos integrados. Além disso, o módulo :mod:`pickle` possui um otimizador transparente escrito em C.

source: Examples
pt_pt: Exemplos

source: For the simplest code, use the :func:`dump` and :func:`load` functions. ::
pt_pt: Para o código mais simples, use as funções :func:`dump` e :func:`load`:

source: import pickle # An arbitrary collection of objects supported by pickle. data = { 'a': [1, 2.0, 3+4j], 'b': ("character string", b"byte string"), 'c': {None, True, False} } with open('data.pickle', 'wb') as f: # Pickle the 'data' dictionary using the highest protocol available. pickle.dump(data, f, pickle.HIGHEST_PROTOCOL)
pt_pt: import pickle # Uma coleção arbitrária de objetos suportados por pickle. data = { 'a': [1, 2.0, 3+4j], 'b': ("string de caracteres", b"string de bytes"), 'c': {None, True, False} } with open('data.pickle', 'wb') as f: # Faz *pickle* do dicionário 'data' usando o protocolo mais alto disponível. pickle.dump(data, f, pickle.HIGHEST_PROTOCOL)

source: The following example reads the resulting pickled data. ::
pt_pt: O exemplo seguinte lê os dados *picklados* resultantes:

source: import pickle with open('data.pickle', 'rb') as f: # The protocol version used is detected automatically, so we do not # have to specify it. data = pickle.load(f)
pt_pt: import pickle with open('data.pickle', 'rb') as f: # A versão do protocolo usada é detetada automaticamente, pelo que não # é necessário especificá-la. data = pickle.load(f)

source: Module :mod:`copyreg`
pt_pt: Módulo :mod:`copyreg`

source: Pickle interface constructor registration for extension types.
pt_pt: Registo de construtores de interface *pickle* para tipos de extensão.

source: Module :mod:`pickletools`
pt_pt: Módulo :mod:`pickletools`

source: Tools for working with and analyzing pickled data.
pt_pt: Ferramentas para trabalhar e analisar dados *picklados*.

source: Module :mod:`shelve`
pt_pt: Módulo :mod:`shelve`

source: Indexed databases of objects; uses :mod:`pickle`.
pt_pt: Bases de dados indexadas de objetos; usa :mod:`pickle`.

source: Module :mod:`copy`
pt_pt: Módulo :mod:`copy`

source: Shallow and deep object copying.
pt_pt: Cópia superficial e profunda de objetos.

source: Module :mod:`marshal`
pt_pt: Módulo :mod:`marshal`

source: High-performance serialization of built-in types.
pt_pt: Serialização de alto desempenho de tipos integrados.

source: Footnotes
pt_pt: Notas de rodapé

source: Don't confuse this with the :mod:`marshal` module
pt_pt: Não confundir com o módulo :mod:`marshal`

source: This is why :keyword:`lambda` functions cannot be pickled: all :keyword:`!lambda` functions share the same name: ``<lambda>``.
pt_pt: É por isto que as funções :keyword:`lambda` não podem ser *pickladas*: todas as funções :keyword:`!lambda` partilham o mesmo nome: ``<lambda>``.

source: The exception raised will likely be an :exc:`ImportError` or an :exc:`AttributeError` but it could be something else.
pt_pt: A exceção levantada será provavelmente um :exc:`ImportError` ou um :exc:`AttributeError`, mas pode ser outra coisa.

source: The :mod:`copy` module uses this protocol for shallow and deep copying operations.
pt_pt: O módulo :mod:`copy` usa este protocolo para operações de cópia superficial e profunda.

source: The limitation on alphanumeric characters is due to the fact that persistent IDs in protocol 0 are delimited by the newline character. Therefore if any kind of newline characters occurs in persistent IDs, the resulting pickled data will become unreadable.
pt_pt: A limitação a caracteres alfanuméricos deve-se ao facto de os IDs persistentes no protocolo 0 serem delimitados pelo carácter de nova linha. Portanto, se algum tipo de carácter de nova linha ocorrer em IDs persistentes, os dados *picklados* resultantes tornar-se-ão ilegíveis.

source: persistence
pt_pt: persistência

source: persistent
pt_pt: persistente

source: objects
pt_pt: objetos

source: serializing
pt_pt: serialização

source: flattening
pt_pt: achatamento

source: External Data Representation
pt_pt: Representação Externa de Dados

source: protocol
pt_pt: protocolo

source: persistent_id (pickle protocol)
pt_pt: persistent_id (protocolo *pickle*)

source: persistent_load (pickle protocol)
pt_pt: persistent_load (protocolo *pickle*)

source: __getstate__() (copy protocol)
pt_pt: __getstate__() (protocolo de cópia)

source: __setstate__() (copy protocol)
pt_pt: __setstate__() (protocolo de cópia)

source: find_class() (pickle protocol)
pt_pt: find_class() (protocolo *pickle*)
