Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: pt_pt

source: If :meth:`persistent_id` returns ``None``, *obj* is pickled as usual. Any other value causes :class:`Pickler` to emit the returned value as a persistent ID for *obj*. The meaning of this persistent ID should be defined by :meth:`Unpickler.persistent_load`. Note that the value returned by :meth:`persistent_id` cannot itself have a persistent ID.
pt_pt: Se :meth:`persistent_id` devolver ``None``, *obj* é serializado como habitual. Qualquer outro valor faz com que :class:`Pickler` emita o valor devolvido como um ID persistente para *obj*. O significado deste ID persistente deve ser definido por :meth:`Unpickler.persistent_load`. Note que o valor devolvido por :meth:`persistent_id` não pode ele próprio ter um ID persistente.

source: See :ref:`pickle-persistent` for details and examples of uses.
pt_pt: Consulte :ref:`pickle-persistent` para detalhes e exemplos de uso.

source: Add the default implementation of this method in the C implementation of :class:`!Pickler`.
pt_pt: Adiciona a implementação predefinida deste método na implementação C de :class:`!Pickler`.

source: A pickler object's dispatch table is a registry of *reduction functions* of the kind which can be declared using :func:`copyreg.pickle`. It is a mapping whose keys are classes and whose values are reduction functions. A reduction function takes a single argument of the associated class and should conform to the same interface as a :meth:`~object.__reduce__` method.
pt_pt: A tabela de despacho de um objeto pickler é um registo de *funções de redução* do tipo que pode ser declarado usando :func:`copyreg.pickle`. É um mapeamento cujas chaves são classes e cujos valores são funções de redução. Uma função de redução recebe um único argumento da classe associada e deve conformar-se à mesma interface que um método :meth:`~object.__reduce__`.

source: By default, a pickler object will not have a :attr:`dispatch_table` attribute, and it will instead use the global dispatch table managed by the :mod:`copyreg` module. However, to customize the pickling for a specific pickler object one can set the :attr:`dispatch_table` attribute to a dict-like object. Alternatively, if a subclass of :class:`Pickler` has a :attr:`dispatch_table` attribute then this will be used as the default dispatch table for instances of that class.
pt_pt: Por predefinição, um objeto pickler não terá um atributo :attr:`dispatch_table`, e em vez disso usará a tabela de despacho global gerida pelo módulo :mod:`copyreg`. No entanto, para personalizar o pickling para um objeto pickler específico, pode definir o atributo :attr:`dispatch_table` para um objeto tipo dicionário. Alternativamente, se uma subclasse de :class:`Pickler` tiver um atributo :attr:`dispatch_table`, este será usado como a tabela de despacho predefinida para instâncias dessa classe.

source: See :ref:`pickle-dispatch` for usage examples.
pt_pt: Consulte :ref:`pickle-dispatch` para exemplos de uso.

source: Special reducer that can be defined in :class:`Pickler` subclasses. This method has priority over any reducer in the :attr:`dispatch_table`. It should conform to the same interface as a :meth:`~object.__reduce__` method, and can optionally return :data:`NotImplemented` to fallback on :attr:`dispatch_table`-registered reducers to pickle ``obj``.
pt_pt: Redutor especial que pode ser definido em subclasses de :class:`Pickler`. Este método tem prioridade sobre qualquer redutor na :attr:`dispatch_table`. Deve conformar-se à mesma interface que um método :meth:`~object.__reduce__`, e pode opcionalmente devolver :data:`NotImplemented` para recuar para redutores registados na :attr:`dispatch_table` para serializar ``obj``.

source: For a detailed example, see :ref:`reducer_override`.
pt_pt: Para um exemplo detalhado, consulte :ref:`reducer_override`.

source: Deprecated. Enable fast mode if set to a true value. The fast mode disables the usage of memo, therefore speeding the pickling process by not generating superfluous PUT opcodes. It should not be used with self-referential objects, doing otherwise will cause :class:`Pickler` to recurse infinitely.
pt_pt: Obsoleto. Ativa o modo rápido se definido para um valor verdadeiro. O modo rápido desativa o uso de memo, acelerando assim o processo de pickling ao não gerar opcodes PUT supérfluos. Não deve ser usado com objetos auto-referenciais, caso contrário fará com que :class:`Pickler` recurse infinitamente.

source: Use :func:`pickletools.optimize` if you need more compact pickles.
pt_pt: Use :func:`pickletools.optimize` se precisar de pickles mais compactos.

source: This takes a binary file for reading a pickle data stream.
pt_pt: Isto recebe um ficheiro binário para ler um fluxo de dados pickle.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed.
pt_pt: A versão do protocolo do pickle é detetada automaticamente, por isso não é necessário nenhum argumento de protocolo.

source: The argument *file* must have three methods, a read() method that takes an integer argument, a readinto() method that takes a buffer argument and a readline() method that requires no arguments, as in the :class:`io.BufferedIOBase` interface. Thus *file* can be an on-disk file opened for binary reading, an :class:`io.BytesIO` object, or any other custom object that meets this interface.
pt_pt: O argumento *file* deve ter três métodos: um método read() que recebe um argumento inteiro, um método readinto() que recebe um argumento de buffer e um método readline() que não requer argumentos, como na interface :class:`io.BufferedIOBase`. Assim, *file* pode ser um ficheiro em disco aberto para leitura binária, um objeto :class:`io.BytesIO`, ou qualquer outro objeto personalizado que cumpra esta interface.

source: The optional arguments *fix_imports*, *encoding* and *errors* are used to control compatibility support for pickle stream generated by Python 2. If *fix_imports* is true, pickle will try to map the old Python 2 names to the new names used in Python 3. The *encoding* and *errors* tell pickle how to decode 8-bit string instances pickled by Python 2; these default to 'ASCII' and 'strict', respectively. The *encoding* can be 'bytes' to read these 8-bit string instances as bytes objects. Using ``encoding='latin1'`` is required for unpickling NumPy arrays and instances of :class:`~datetime.datetime`, :class:`~datetime.date` and :class:`~datetime.time` pickled by Python 2.
pt_pt: Os argumentos opcionais *fix_imports*, *encoding* e *errors* são usados para controlar o suporte de compatibilidade para fluxos pickle gerados pelo Python 2. Se *fix_imports* for verdadeiro, pickle tentará mapear os antigos nomes do Python 2 para os novos nomes usados no Python 3. *encoding* e *errors* indicam ao pickle como decodificar instâncias de strings de 8 bits serializadas pelo Python 2; estes são predefinidos para 'ASCII' e 'strict', respetivamente. *encoding* pode ser 'bytes' para ler estas instâncias de strings de 8 bits como objetos de bytes. Usar ``encoding='latin1'`` é necessário para desserializar arrays NumPy e instâncias de :class:`~datetime.datetime`, :class:`~datetime.date` e :class:`~datetime.time` serializados pelo Python 2.

source: If *buffers* is ``None`` (the default), then all data necessary for deserialization must be contained in the pickle stream. This means that the *buffer_callback* argument was ``None`` when a :class:`Pickler` was instantiated (or when :func:`dump` or :func:`dumps` was called).
pt_pt: Se *buffers* for ``None`` (predefinição), então todos os dados necessários para desserialização devem estar contidos no fluxo pickle. Isto significa que o argumento *buffer_callback* era ``None`` quando um :class:`Pickler` foi instanciado (ou quando :func:`dump` ou :func:`dumps` foi chamado).

source: If *buffers* is not ``None``, it should be an iterable of buffer-enabled objects that is consumed each time the pickle stream references an :ref:`out-of-band <pickle-oob>` buffer view. Such buffers have been given in order to the *buffer_callback* of a Pickler object.
pt_pt: Se *buffers* não for ``None``, deve ser um iterável de objetos com buffer que é consumido cada vez que o fluxo pickle referencia uma vista de buffer :ref:`fora de banda <pickle-oob>`. Esses buffers foram dados, por ordem, ao *buffer_callback* de um objeto Pickler.

source: Read the pickled representation of an object from the open file object given in the constructor, and return the reconstituted object hierarchy specified therein. Bytes past the pickled representation of the object are ignored.
pt_pt: Lê a representação serializada de um objeto do objeto de ficheiro aberto dado no construtor e devolve a hierarquia de objetos reconstituída especificada nele. Os bytes após a representação serializada do objeto são ignorados.

source: Raise an :exc:`UnpicklingError` by default.
pt_pt: Levanta uma :exc:`UnpicklingError` por predefinição.

source: If defined, :meth:`persistent_load` should return the object specified by the persistent ID *pid*. If an invalid persistent ID is encountered, an :exc:`UnpicklingError` should be raised.
pt_pt: Se definido, :meth:`persistent_load` deve devolver o objeto especificado pelo ID persistente *pid*. Se for encontrado um ID persistente inválido, deve ser levantada uma :exc:`UnpicklingError`.

source: Add the default implementation of this method in the C implementation of :class:`!Unpickler`.
pt_pt: Adiciona a implementação predefinida deste método na implementação C de :class:`!Unpickler`.

source: Import *module* if necessary and return the object called *name* from it, where the *module* and *name* arguments are :class:`str` objects. Note, unlike its name suggests, :meth:`find_class` is also used for finding functions.
pt_pt: Importa *module* se necessário e devolve o objeto chamado *name* a partir dele, onde os argumentos *module* e *name* são objetos :class:`str`. Note que, ao contrário do que o nome sugere, :meth:`find_class` também é usado para encontrar funções.

source: Subclasses may override this to gain control over what type of objects and how they can be loaded, potentially reducing security risks. Refer to :ref:`pickle-restrict` for details.
pt_pt: As subclasses podem substituir isto para ganhar controlo sobre que tipo de objetos e como podem ser carregados, reduzindo potencialmente riscos de segurança. Consulte :ref:`pickle-restrict` para detalhes.

source: Raises an :ref:`auditing event <auditing>` ``pickle.find_class`` with arguments ``module``, ``name``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``pickle.find_class`` com argumentos ``module``, ``name``.

source: A wrapper for a buffer representing picklable data. *buffer* must be a :ref:`buffer-providing <bufferobjects>` object, such as a :term:`bytes-like object` or a N-dimensional array.
pt_pt: Um invólucro para um buffer que representa dados serializáveis. *buffer* deve ser um objeto :ref:`fornecedor de buffer <bufferobjects>`, como um :term:`objeto tipo bytes` ou um array N-dimensional.

source: :class:`PickleBuffer` is itself a buffer provider, therefore it is possible to pass it to other APIs expecting a buffer-providing object, such as :class:`memoryview`.
pt_pt: :class:`PickleBuffer` é ele próprio um fornecedor de buffer, por isso é possível passá-lo a outras APIs que esperam um objeto fornecedor de buffer, como :class:`memoryview`.

source: :class:`PickleBuffer` objects can only be serialized using pickle protocol 5 or higher. They are eligible for :ref:`out-of-band serialization <pickle-oob>`.
pt_pt: Os objetos :class:`PickleBuffer` só podem ser serializados usando o protocolo pickle 5 ou superior. São elegíveis para :ref:`serialização fora de banda <pickle-oob>`.

source: Return a :class:`memoryview` of the memory area underlying this buffer. The returned object is a one-dimensional, C-contiguous memoryview with format ``B`` (unsigned bytes). :exc:`BufferError` is raised if the buffer is neither C- nor Fortran-contiguous.
pt_pt: Devolve uma :class:`memoryview` da área de memória subjacente a este buffer. O objeto devolvido é uma memoryview unidimensional, contígua em C, com formato ``B`` (bytes sem sinal). É levantada uma :exc:`BufferError` se o buffer não for contíguo em C nem em Fortran.

source: Release the underlying buffer exposed by the PickleBuffer object.
pt_pt: Liberta o buffer subjacente exposto pelo objeto PickleBuffer.

source: What can be pickled and unpickled?
pt_pt: O que pode ser serializado e desserializado?

source: The following types can be pickled:
pt_pt: Os seguintes tipos podem ser serializados:

source: built-in constants (``None``, ``True``, ``False``, ``Ellipsis``, and :data:`NotImplemented`);
pt_pt: constantes integradas (``None``, ``True``, ``False``, ``Ellipsis``, e :data:`NotImplemented`);

source: integers, floating-point numbers, complex numbers;
pt_pt: inteiros, números de vírgula flutuante, números complexos;

source: tuples, lists, sets, and dictionaries containing only picklable objects;
pt_pt: tuplos, listas, conjuntos e dicionários contendo apenas objetos serializáveis;

source: functions (built-in and user-defined) accessible from the top level of a module (using :keyword:`def`, not :keyword:`lambda`);
pt_pt: funções (integradas e definidas pelo utilizador) acessíveis a partir do nível superior de um módulo (usando :keyword:`def`, não :keyword:`lambda`);

source: classes accessible from the top level of a module;
pt_pt: classes acessíveis a partir do nível superior de um módulo;

source: instances of such classes whose the result of calling :meth:`~object.__getstate__` is picklable (see section :ref:`pickle-inst` for details).
pt_pt: instâncias de tais classes cujo resultado da chamada de :meth:`~object.__getstate__` é serializável (consulte a secção :ref:`pickle-inst` para detalhes).

source: Attempts to pickle unpicklable objects will raise the :exc:`PicklingError` exception; when this happens, an unspecified number of bytes may have already been written to the underlying file. Trying to pickle a highly recursive data structure may exceed the maximum recursion depth, a :exc:`RecursionError` will be raised in this case. You can carefully raise this limit with :func:`sys.setrecursionlimit`.
pt_pt: Tentativas de serializar objetos não serializáveis levantarão a exceção :exc:`PicklingError`; quando isto acontece, um número não especificado de bytes pode já ter sido escrito no ficheiro subjacente. Tentar serializar uma estrutura de dados altamente recursiva pode exceder a profundidade máxima de recursão, uma :exc:`RecursionError` será levantada neste caso. Pode aumentar cuidadosamente este limite com :func:`sys.setrecursionlimit`.

source: Note that functions (built-in and user-defined) are pickled by fully :term:`qualified name`, not by value. [#]_ This means that only the function name is pickled, along with the name of the containing module and classes. Neither the function's code, nor any of its function attributes are pickled. Thus the defining module must be importable in the unpickling environment, and the module must contain the named object, otherwise an exception will be raised. [#]_
pt_pt: Note que as funções (integradas e definidas pelo utilizador) são serializadas pelo seu :term:`nome qualificado`, não por valor. [#]_ Isto significa que apenas o nome da função é serializado, juntamente com o nome do módulo e das classes que a contêm. Nem o código da função, nem quaisquer dos seus atributos de função são serializados. Assim, o módulo de definição deve ser importável no ambiente de desserialização, e o módulo deve conter o objeto nomeado, caso contrário será levantada uma exceção. [#]_

source: Similarly, classes are pickled by fully qualified name, so the same restrictions in the unpickling environment apply. Note that none of the class's code or data is pickled, so in the following example the class attribute ``attr`` is not restored in the unpickling environment::
pt_pt: Da mesma forma, as classes são serializadas pelo nome totalmente qualificado, por isso as mesmas restrições no ambiente de desserialização se aplicam. Note que nenhum do código ou dados da classe é serializado, por isso no exemplo seguinte o atributo de classe ``attr`` não é restaurado no ambiente de desserialização:

source: class Foo: attr = 'A class attribute' picklestring = pickle.dumps(Foo)
pt_pt: class Foo: attr = 'Um atributo de classe' picklestring = pickle.dumps(Foo)

source: These restrictions are why picklable functions and classes must be defined at the top level of a module.
pt_pt: Estas restrições são a razão pela qual funções e classes serializáveis devem ser definidas no nível superior de um módulo.

source: Similarly, when class instances are pickled, their class's code and data are not pickled along with them. Only the instance data are pickled. This is done on purpose, so you can fix bugs in a class or add methods to the class and still load objects that were created with an earlier version of the class. If you plan to have long-lived objects that will see many versions of a class, it may be worthwhile to put a version number in the objects so that suitable conversions can be made by the class's :meth:`~object.__setstate__` method.
pt_pt: Da mesma forma, quando instâncias de classes são serializadas, o código e os dados da sua classe não são serializados juntamente com elas. Apenas os dados da instância são serializados. Isto é feito de propósito, para que possa corrigir bugs numa classe ou adicionar métodos à classe e ainda assim carregar objetos que foram criados com uma versão anterior da classe. Se planeia ter objetos de longa duração que verão muitas versões de uma classe, pode valer a pena colocar um número de versão nos objetos para que conversões adequadas possam ser feitas pelo método :meth:`~object.__setstate__` da classe.

source: Pickling Class Instances
pt_pt: Serialização de Instâncias de Classes

source: In this section, we describe the general mechanisms available to you to define, customize, and control how class instances are pickled and unpickled.
pt_pt: Nesta secção, descrevemos os mecanismos gerais disponíveis para definir, personalizar e controlar como as instâncias de classes são serializadas e desserializadas.

source: In most cases, no additional code is needed to make instances picklable. By default, pickle will retrieve the class and the attributes of an instance via introspection. When a class instance is unpickled, its :meth:`~object.__init__` method is usually *not* invoked. The default behaviour first creates an uninitialized instance and then restores the saved attributes. The following code shows an implementation of this behaviour::
pt_pt: Na maioria dos casos, não é necessário código adicional para tornar as instâncias serializáveis. Por predefinição, pickle irá recuperar a classe e os atributos de uma instância através de introspeção. Quando uma instância de classe é desserializada, o seu método :meth:`~object.__init__` geralmente *não* é invocado. O comportamento predefinido cria primeiro uma instância não inicializada e depois restaura os atributos guardados. O código seguinte mostra uma implementação deste comportamento:

source: Classes can alter the default behaviour by providing one or several special methods:
pt_pt: As classes podem alterar o comportamento predefinido fornecendo um ou vários métodos especiais:

source: In protocols 2 and newer, classes that implements the :meth:`__getnewargs_ex__` method can dictate the values passed to the :meth:`__new__` method upon unpickling. The method must return a pair ``(args, kwargs)`` where *args* is a tuple of positional arguments and *kwargs* a dictionary of named arguments for constructing the object. Those will be passed to the :meth:`__new__` method upon unpickling.
pt_pt: Nos protocolos 2 e mais recentes, as classes que implementam o método :meth:`__getnewargs_ex__` podem ditar os valores passados ao método :meth:`__new__` durante a desserialização. O método deve devolver um par ``(args, kwargs)`` onde *args* é um tuplo de argumentos posicionais e *kwargs* é um dicionário de argumentos nomeados para construir o objeto. Estes serão passados ao método :meth:`__new__` durante a desserialização.

source: You should implement this method if the :meth:`__new__` method of your class requires keyword-only arguments. Otherwise, it is recommended for compatibility to implement :meth:`__getnewargs__`.
pt_pt: Deve implementar este método se o método :meth:`__new__` da sua classe requer argumentos apenas de palavra-chave. Caso contrário, é recomendado, para compatibilidade, implementar :meth:`__getnewargs__`.

source: :meth:`__getnewargs_ex__` is now used in protocols 2 and 3.
pt_pt: :meth:`__getnewargs_ex__` é agora usado nos protocolos 2 e 3.

source: This method serves a similar purpose as :meth:`__getnewargs_ex__`, but supports only positional arguments. It must return a tuple of arguments ``args`` which will be passed to the :meth:`__new__` method upon unpickling.
pt_pt: Este método serve um propósito semelhante a :meth:`__getnewargs_ex__`, mas suporta apenas argumentos posicionais. Deve devolver um tuplo de argumentos ``args`` que serão passados ao método :meth:`__new__` durante a desserialização.

source: :meth:`__getnewargs__` will not be called if :meth:`__getnewargs_ex__` is defined.
pt_pt: :meth:`__getnewargs__` não será chamado se :meth:`__getnewargs_ex__` estiver definido.

source: Before Python 3.6, :meth:`__getnewargs__` was called instead of :meth:`__getnewargs_ex__` in protocols 2 and 3.
pt_pt: Antes do Python 3.6, :meth:`__getnewargs__` era chamado em vez de :meth:`__getnewargs_ex__` nos protocolos 2 e 3.

source: Classes can further influence how their instances are pickled by overriding the method :meth:`__getstate__`. It is called and the returned object is pickled as the contents for the instance, instead of a default state. There are several cases:
pt_pt: As classes podem influenciar ainda mais como as suas instâncias são serializadas substituindo o método :meth:`__getstate__`. É chamado e o objeto devolvido é serializado como o conteúdo para a instância, em vez de um estado predefinido. Existem vários casos:

source: For a class that has no instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``None``.
pt_pt: Para uma classe que não tem :attr:`~object.__dict__` de instância e nenhum :attr:`~object.__slots__`, o estado predefinido é ``None``.

source: For a class that has an instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``self.__dict__``.
pt_pt: Para uma classe que tem um :attr:`~object.__dict__` de instância e nenhum :attr:`~object.__slots__`, o estado predefinido é ``self.__dict__``.

source: For a class that has an instance :attr:`~object.__dict__` and :attr:`~object.__slots__`, the default state is a tuple consisting of two dictionaries: ``self.__dict__``, and a dictionary mapping slot names to slot values. Only slots that have a value are included in the latter.
pt_pt: Para uma classe que tem um :attr:`~object.__dict__` de instância e :attr:`~object.__slots__`, o estado predefinido é um tuplo constituído por dois dicionários: ``self.__dict__`` e um dicionário que mapeia nomes de slots para valores de slots. Apenas os slots que têm um valor são incluídos neste último.
