Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pkgutil.po
Languages: ru, sv

source: :mod:`!pkgutil` --- Package extension utility
ru: :mod:`!pkgutil` --- Утилита расширения пакета

source: **Source code:** :source:`Lib/pkgutil.py`
ru: **Исходный код:** :source:`Lib/pkgutil.py`
sv: **Källkod:** :source:`Lib/pkgutil.py`

source: This module provides utilities for the import system, in particular package support.
ru: Этот модуль предоставляет утилиты для системы импорта, в частности поддержку пакетов.
sv: Denna modul innehåller verktyg för importsystemet, i synnerhet paketstöd.

source: A namedtuple that holds a brief summary of a module's info.
ru: Именованный кортеж, содержащий краткую информацию о модуле.
sv: En namntuple som innehåller en kort sammanfattning av en moduls information.

source: Extend the search path for the modules which comprise a package. Intended use is to place the following code in a package's :file:`__init__.py`::
ru: Расширьте путь поиска модулей, входящих в пакет. Предполагаемое использование — поместить следующий код в :file:`__init__.py`::
sv: Utöka sökvägen för de moduler som ingår i ett paket. Avsedd användning är att placera följande kod i ett pakets :file:`__init__.py`::

source: For each directory on :data:`sys.path` that has a subdirectory that matches the package name, add the subdirectory to the package's :attr:`~module.__path__`. This is useful if one wants to distribute different parts of a single logical package as multiple directories.
ru: Для каждого каталога в :data:`sys.path`, у которого есть подкаталог, соответствующий имени пакета, добавьте подкаталог в :attr:`~module.__path__` пакета. Это полезно, если вы хотите распределить разные части одного логического пакета по нескольким каталогам.

source: It also looks for :file:`\*.pkg` files beginning where ``*`` matches the *name* argument. This feature is similar to :file:`\*.pth` files (see the :mod:`site` module for more information), except that it doesn't special-case lines starting with ``import``. A :file:`\*.pkg` file is trusted at face value: apart from skipping blank lines and ignoring comments, all entries found in a :file:`\*.pkg` file are added to the path, regardless of whether they exist on the filesystem (this is a feature).
ru: Он также ищет файлы :file:`\*.pkg`, начинающиеся с которых ``*`` соответствует аргументу *name*. Эта функция аналогична файлам :file:`\*.pth` (дополнительную информацию см. в модуле :mod:`site`), за исключением того, что в ней нет специальных строк, начинающихся с ``import``. Файлу :file:`\*.pkg` доверяют по номинальной стоимости: помимо пропуска пустых строк и игнорирования комментариев, все записи, найденные в файле :file:`\*.pkg`, добавляются к пути, независимо от того, они существуют в файловой системе (это особенность).

source: If the input path is not a list (as is the case for frozen packages) it is returned unchanged. The input path is not modified; an extended copy is returned. Items are only appended to the copy at the end.
ru: Если входной путь не является списком (как в случае с замороженными пакетами), он возвращается без изменений. Путь ввода не изменяется; возвращается расширенная копия. Элементы добавляются к копии только в конце.
sv: Om indatasökvägen inte är en lista (vilket är fallet för frysta paket) returneras den oförändrad. Inmatningsvägen ändras inte; en utökad kopia returneras. Objekten läggs bara till i kopian i slutet.

source: It is assumed that :data:`sys.path` is a sequence. Items of :data:`sys.path` that are not strings referring to existing directories are ignored. Unicode items on :data:`sys.path` that cause errors when used as filenames may cause this function to raise an exception (in line with :func:`os.path.isdir` behavior).
ru: Предполагается, что :data:`sys.path` представляет собой последовательность. Элементы :data:`sys.path`, которые не являются строками, ссылающимися на существующие каталоги, игнорируются. Элементы Unicode в :data:`sys.path`, которые вызывают ошибки при использовании в качестве имен файлов, могут привести к тому, что эта функция вызовет исключение (в соответствии с поведением :func:`os.path.isdir`).
sv: Det antas att :data:`sys.path` är en sekvens. Element i :data:`sys.path` som inte är strängar som hänvisar till befintliga kataloger ignoreras. Unicode-objekt i :data:`sys.path` som orsakar fel när de används som filnamn kan leda till att denna funktion ger upphov till ett undantag (i linje med :func:`os.path.isdir`\-beteendet).

source: Retrieve a module :term:`loader` for the given *fullname*.
ru: Получить модуль :term:`loader` для данного *полного имени*.

source: This is a backwards compatibility wrapper around :func:`importlib.util.find_spec` that converts most failures to :exc:`ImportError` and only returns the loader rather than the full :class:`importlib.machinery.ModuleSpec`.
ru: Это оболочка обратной совместимости вокруг :func:`importlib.util.find_spec`, которая преобразует большинство ошибок в :exc:`ImportError` и возвращает только загрузчик, а не полный :class:`importlib.machinery.ModuleSpec`.

source: Updated to be based directly on :mod:`importlib` rather than relying on the package internal :pep:`302` import emulation.
ru: Обновлен, чтобы основываться непосредственно на :mod:`importlib`, а не полагаться на внутреннюю эмуляцию импорта :pep:`302` пакета.
sv: Uppdaterad för att baseras direkt på :mod:`importlib` snarare än att förlita sig på paketets interna :pep:`302` import-emulering.

source: Updated to be based on :pep:`451`
ru: Обновлено на основе :pep:`451`

source: Use :func:`importlib.util.find_spec` instead.
ru: Вместо этого используйте :func:`importlib.util.find_spec`.

source: Retrieve a :term:`finder` for the given *path_item*.
ru: Получите :term:`finder` для данного *path_item*.
sv: Hämta en :term:`finder` för den angivna *path_item*.

source: The returned finder is cached in :data:`sys.path_importer_cache` if it was newly created by a path hook.
ru: Возвращенный искатель кэшируется в :data:`sys.path_importer_cache`, если он был вновь создан с помощью перехватчика пути.
sv: Den returnerade sökaren cachelagras i :data:`sys.path_importer_cache` om den nyligen skapades av en sökvägs-hook.

source: The cache (or part of it) can be cleared manually if a rescan of :data:`sys.path_hooks` is necessary.
ru: Кэш (или его часть) можно очистить вручную, если необходимо повторное сканирование :data:`sys.path_hooks`.
sv: Cachen (eller en del av den) kan tömmas manuellt om en ny sökning av :data:`sys.path_hooks` är nödvändig.

source: Get a :term:`loader` object for *module_or_name*.
ru: Получите объект :term:`loader` для *module_or_name*.

source: If the module or package is accessible via the normal import mechanism, a wrapper around the relevant part of that machinery is returned. Returns ``None`` if the module cannot be found or imported. If the named module is not already imported, its containing package (if any) is imported, in order to establish the package ``__path__``.
ru: Если модуль или пакет доступен через обычный механизм импорта, возвращается оболочка соответствующей части этого механизма. Возвращает None, если модуль не может быть найден или импортирован. Если указанный модуль еще не импортирован, импортируется содержащий его пакет (если таковой имеется), чтобы установить пакет ``__path__``.

source: Yield :term:`finder` objects for the given module name.
ru: Возвращает объекты :term:`finder` для данного имени модуля.
sv: Ger :term:`finder`\-objekt för det angivna modulnamnet.

source: If fullname contains a ``'.'``, the finders will be for the package containing fullname, otherwise they will be all registered top level finders (i.e. those on both :data:`sys.meta_path` and :data:`sys.path_hooks`).
ru: Если полное имя содержит ``'.'``, средства поиска будут относиться к пакету, содержащему полное имя, в противном случае все они будут зарегистрированными средствами поиска верхнего уровня (т. е. как в :data:`sys.meta_path`, так и в :data:`sys). .path_hooks`).

source: If the named module is in a package, that package is imported as a side effect of invoking this function.
ru: Если указанный модуль находится в пакете, этот пакет импортируется как побочный эффект вызова этой функции.
sv: Om den namngivna modulen ingår i ett paket importeras paketet som en bieffekt av att funktionen anropas.

source: If no module name is specified, all top level finders are produced.
ru: Если имя модуля не указано, создаются все средства поиска верхнего уровня.
sv: Om inget modulnamn anges produceras alla sökare på högsta nivån.

source: Yields :class:`ModuleInfo` for all submodules on *path*, or, if *path* is ``None``, all top-level modules on :data:`sys.path`.
ru: Возвращает :class:`ModuleInfo` для всех подмодулей в *path* или, если *path* имеет значение ``None``, для всех модулей верхнего уровня в :data:`sys.path`.
sv: Ger :class:`ModuleInfo` för alla undermoduler på *path*, eller, om *path* är ``None``, alla moduler på högsta nivån på :data:`sys.path`.

source: *path* should be either ``None`` or a list of paths to look for modules in.
ru: *path* должно быть либо ``None``, либо списком путей для поиска модулей.
sv: *path* ska vara antingen ``None`` eller en lista med sökvägar där moduler ska sökas.

source: *prefix* is a string to output on the front of every module name on output.
ru: *префикс* — это строка, которая выводится перед каждым именем модуля при выводе.
sv: *prefix* är en sträng som ska skrivas ut i början av varje modulnamn vid utmatning.

source: Only works for a :term:`finder` which defines an ``iter_modules()`` method. This interface is non-standard, so the module also provides implementations for :class:`importlib.machinery.FileFinder` and :class:`zipimport.zipimporter`.
ru: Работает только для :term:`finder`, который определяет метод ``iter_modules()``. Этот интерфейс нестандартен, поэтому модуль также предоставляет реализации для :class:`importlib.machinery.FileFinder` и :class:`zipimport.zipimporter`.
sv: Fungerar endast för en :term:`finder` som definierar en metod ``iter_modules()``. Detta gränssnitt är inte standard, så modulen tillhandahåller även implementeringar för :class:`importlib.machinery.FileFinder` och :class:`zipimport.zipimporter`.

source: Yields :class:`ModuleInfo` for all modules recursively on *path*, or, if *path* is ``None``, all accessible modules.
ru: Возвращает :class:`ModuleInfo` для всех модулей рекурсивно по *path* или, если *path* имеет значение ``None``, для всех доступных модулей.
sv: Ger :class:`ModuleInfo` för alla moduler rekursivt på *path*, eller, om *path* är ``None``, alla tillgängliga moduler.

source: Note that this function must import all *packages* (*not* all modules!) on the given *path*, in order to access the ``__path__`` attribute to find submodules.
ru: Обратите внимание, что эта функция должна импортировать все *пакеты* (*не* все модули!) по заданному *пути*, чтобы получить доступ к атрибуту ``__path__`` для поиска подмодулей.
sv: Observera att denna funktion måste importera alla *paket* (*inte* alla moduler!) på den angivna *vägen* för att kunna komma åt attributet ``__path__`` och hitta undermoduler.

source: *onerror* is a function which gets called with one argument (the name of the package which was being imported) if any exception occurs while trying to import a package. If no *onerror* function is supplied, :exc:`ImportError`\s are caught and ignored, while all other exceptions are propagated, terminating the search.
ru: *onerror* — это функция, которая вызывается с одним аргументом (имя импортируемого пакета), если при попытке импортировать пакет возникает какое-либо исключение. Если функция *onerror* не указана, ошибки :exc:`ImportError`\ перехватываются и игнорируются, в то время как все остальные исключения распространяются, прекращая поиск.
sv: *onerror* är en funktion som anropas med ett argument (namnet på det paket som importerades) om något undantag inträffar när du försöker importera ett paket. Om ingen *onerror*-funktion tillhandahålls fångas och ignoreras :exc:`ImportError`, medan alla andra undantag sprids och avslutar sökningen.

source: Examples::
ru: Примеры::
sv: Exempel::

source: Get a resource from a package.
ru: Получить ресурс из пакета.
sv: Hämta en resurs från ett paket.

source: This is a wrapper for the :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>` API. The *package* argument should be the name of a package, in standard module format (``foo.bar``). The *resource* argument should be in the form of a relative filename, using ``/`` as the path separator. The parent directory name ``..`` is not allowed, and nor is a rooted name (starting with a ``/``).
ru: Это оболочка для API :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>`. Аргумент *package* должен быть именем пакета в стандартном формате модуля (``foo.bar``). Аргумент *resource* должен быть в форме относительного имени файла с использованием ``/`` в качестве разделителя пути. Имя родительского каталога ``..`` не допускается, а также не является корневым именем (начинающимся с ``/``).
sv: Detta är en omslagslösning för API:et :term:`loader` :meth:`get_data <importlib.abc.ResourceLoader.get_data>`. Argumentet *package* ska vara namnet på ett paket, i standardmodulformat (``foo.bar``). Argumentet *resource* ska vara i form av ett relativt filnamn, med ``/`` som sökvägsavgränsare. Det överordnade katalognamnet ``..`` är inte tillåtet, och inte heller ett rotat namn (som börjar med ``/``).

source: The function returns a binary string that is the contents of the specified resource.
ru: Функция возвращает двоичную строку, которая является содержимым указанного ресурса.
sv: Funktionen returnerar en binär sträng som är innehållet i den angivna resursen.

source: For packages located in the filesystem, which have already been imported, this is the rough equivalent of::
ru: Для пакетов, расположенных в файловой системе и уже импортированных, это грубый эквивалент:
sv: För paket som finns i filsystemet och som redan har importerats är detta den ungefärliga motsvarigheten till::

source: If the package cannot be located or loaded, or it uses a :term:`loader` which does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, then ``None`` is returned. In particular, the :term:`loader` for :term:`namespace packages <namespace package>` does not support :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.
ru: Если пакет не может быть найден или загружен, или он использует :term:`loader`, который не поддерживает :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, то возвращается ``None``. В частности, :term:`loader` для :term:`namespace packages <namespace package>` не поддерживает :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.
sv: Om paketet inte kan hittas eller laddas, eller om det använder en :term:`loader` som inte stöder :meth:`get_data <importlib.abc.ResourceLoader.get_data>`, returneras ``None``. I synnerhet har :term:`loader` för :term:`namespace packages <namespace package>` inte stöd för :meth:`get_data <importlib.abc.ResourceLoader.get_data>`.

source: Resolve a name to an object.
ru: Сопоставить имя с объектом.
sv: Återkopplar ett namn till ett objekt.

source: This functionality is used in numerous places in the standard library (see :issue:`12915`) - and equivalent functionality is also in widely used third-party packages such as setuptools, Django and Pyramid.
ru: Эта функциональность используется во многих местах стандартной библиотеки (см. :issue:`12915`), а эквивалентная функциональность также имеется в широко используемых сторонних пакетах, таких как setuptools, Django и Pyramid.
sv: Denna funktionalitet används på många ställen i standardbiblioteket (se :issue:`12915`) - och motsvarande funktionalitet finns också i allmänt använda tredjepartspaket som setuptools, Django och Pyramid.

source: It is expected that *name* will be a string in one of the following formats, where W is shorthand for a valid Python identifier and dot stands for a literal period in these pseudo-regexes:
ru: Ожидается, что *name* будет строкой в ​​одном из следующих форматов, где W — сокращение допустимого идентификатора Python, а точка — буквальная точка в этих псевдорегулярных выражениях:
sv: Det förväntas att *namn* är en sträng i något av följande format, där W är en kortform för en giltig Python-identifierare och punkt står för en bokstavlig punkt i dessa pseudo-regexer:

source: The first form is intended for backward compatibility only. It assumes that some part of the dotted name is a package, and the rest is an object somewhere within that package, possibly nested inside other objects. Because the place where the package stops and the object hierarchy starts can't be inferred by inspection, repeated attempts to import must be done with this form.
ru: Первая форма предназначена только для обратной совместимости. Предполагается, что некоторая часть точечного имени представляет собой пакет, а остальная часть — это объект где-то внутри этого пакета, возможно, вложенный в другие объекты. Поскольку место, где заканчивается пакет и начинается иерархия объектов, невозможно определить путем проверки, повторные попытки импорта необходимо выполнять с помощью этой формы.
sv: Den första formen är endast avsedd för bakåtkompatibilitet. Den förutsätter att en del av det prickade namnet är ett paket och att resten är ett objekt någonstans i paketet, eventuellt nästlat inuti andra objekt. Eftersom platsen där paketet slutar och objekthierarkin börjar inte kan utläsas genom inspektion, måste upprepade försök att importera göras med den här formen.

source: In the second form, the caller makes the division point clear through the provision of a single colon: the dotted name to the left of the colon is a package to be imported, and the dotted name to the right is the object hierarchy within that package. Only one import is needed in this form. If it ends with the colon, then a module object is returned.
ru: Во второй форме вызывающий объект четко указывает точку разделения, ставя одно двоеточие: имя с точкой слева от двоеточия — это пакет, который нужно импортировать, а имя с точкой справа — это иерархия объектов внутри этого пакета. . В этой форме необходим только один импорт. Если он заканчивается двоеточием, возвращается объект модуля.
sv: I det andra formuläret klargör den som ringer upp uppdelningen genom att använda ett enda kolon: det prickade namnet till vänster om kolon är ett paket som ska importeras och det prickade namnet till höger är objekthierarkin inom det paketet. Endast en import behövs i denna form. Om den slutar med ett kolon returneras ett modulobjekt.

source: The function will return an object (which might be a module), or raise one of the following exceptions:
ru: Функция вернет объект (который может быть модулем) или вызовет одно из следующих исключений:
sv: Funktionen kommer att returnera ett objekt (som kan vara en modul) eller ge upphov till något av följande undantag:

source: :exc:`ValueError` -- if *name* isn't in a recognised format.
ru: :exc:`ValueError` -- если *имя* не имеет распознаваемого формата.
sv: :exc:`ValueError` -- om *namn* inte är i ett erkänt format.

source: :exc:`ImportError` -- if an import failed when it shouldn't have.
ru: :exc:`ImportError` — если импорт не удался, хотя этого быть не должно.
sv: :exc:`ImportError` -- om en import misslyckades när den inte borde ha gjort det.

source: :exc:`AttributeError` -- If a failure occurred when traversing the object hierarchy within the imported package to get to the desired object.
ru: :exc:`AttributeError` -- Если произошел сбой при обходе иерархии объектов внутри импортированного пакета для достижения нужного объекта.
sv: :exc:`AttributeError` -- Om ett fel uppstod när objekthierarkin i det importerade paketet genomkorsades för att komma till det önskade objektet.
