Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/platform.po
Languages: pt_pt, sv

source: :mod:`!platform` --- Access to underlying platform's identifying data
pt_pt: :mod:`!platform` — Acesso aos dados de identificação da plataforma subjacente
sv: :mod:`!platform` --- Tillgång till underliggande plattforms identifieringsdata

source: **Source code:** :source:`Lib/platform.py`
pt_pt: **Código-fonte:** :source:`Lib/platform.py`
sv: **Källkod:** :source:`Lib/platform.py`

source: Specific platforms listed alphabetically, with Linux included in the Unix section.
pt_pt: Plataformas específicas listadas por ordem alfabética, com o Linux incluído na secção Unix.
sv: Specifika plattformar listas i alfabetisk ordning, med Linux inkluderat i Unix-avsnittet.

source: Cross platform
pt_pt: Multiplataforma
sv: Plattformsoberoende

source: Queries the given executable (defaults to the Python interpreter binary) for various architecture information.
pt_pt: Consulta o executável indicado (por predefinição, o binário do interpretador Python) para obter várias informações de arquitetura.
sv: Frågar den angivna körbara filen (standard är Python-tolkens binärfil) efter olika arkitekturinformation.

source: Returns a tuple ``(bits, linkage)`` which contain information about the bit architecture and the linkage format used for the executable. Both values are returned as strings.
pt_pt: Devolve um tuplo ``(bits, linkage)`` que contém informações sobre a arquitetura de bits e o formato de ligação usado para o executável. Ambos os valores são devolvidos como *strings*.
sv: Returnerar en tupel ``(bits, linkage)`` som innehåller information om bitarkitekturen och länkningsformatet som används för den körbara filen. Båda värdena returneras som strängar.

source: Values that cannot be determined are returned as given by the parameter presets. If bits is given as ``''``, the ``sizeof(pointer)`` (or ``sizeof(long)`` on Python version < 1.5.2) is used as indicator for the supported pointer size.
pt_pt: Valores que não possam ser determinados são devolvidos conforme os valores predefinidos dos parâmetros. Se *bits* for indicado como ``''``, o ``sizeof(pointer)`` (ou ``sizeof(long)`` em versões Python < 1.5.2) é usado como indicador para o tamanho do ponteiro suportado.
sv: Värden som inte kan bestämmas returneras enligt parameterns förinställningar. Om bits anges som ``''``, används ``sizeof(pointer)`` (eller ``sizeof(long)`` på Python-version < 1.5.2) som indikator för den pekarstorlek som stöds.

source: The function relies on the system's :file:`file` command to do the actual work. This is available on most if not all Unix platforms and some non-Unix platforms and then only if the executable points to the Python interpreter. Reasonable defaults are used when the above needs are not met.
pt_pt: A função depende do comando :file:`file` do sistema para realizar o trabalho real. Isto está disponível na maioria, senão todas, as plataformas Unix e em algumas plataformas não-Unix, mas apenas se o executável apontar para o interpretador Python. Valores predefinidos razoáveis são usados quando as necessidades acima não são satisfeitas.
sv: Funktionen förlitar sig på systemets :file:`file`\-kommando för att göra det faktiska arbetet. Detta är tillgängligt på de flesta om inte alla Unix-plattformar och vissa icke-Unix-plattformar och då endast om den körbara filen pekar på Python-tolken. Rimliga standardvärden används när ovanstående behov inte uppfylls.

source: On macOS (and perhaps other platforms), executable files may be universal files containing multiple architectures.
pt_pt: No macOS (e possivelmente noutras plataformas), os ficheiros executáveis podem ser ficheiros universais contendo múltiplas arquiteturas.
sv: På macOS (och kanske andra plattformar) kan körbara filer vara universella filer som innehåller flera arkitekturer.

source: To get at the "64-bitness" of the current interpreter, it is more reliable to query the :data:`sys.maxsize` attribute::
pt_pt: Para obter a informação de "64 bits" do interpretador atual, é mais fiável consultar o atributo :data:`sys.maxsize`::
sv: För att få reda på den aktuella tolkens "64-bitness" är det mer tillförlitligt att fråga :data:`sys.maxsize`\-attributet::

source: is_64bits = sys.maxsize > 2**32
sv: is_64bits = sys.maxstorlek > 2**32

source: Returns the machine type, e.g. ``'AMD64'``. An empty string is returned if the value cannot be determined.
pt_pt: Devolve o tipo de máquina, por exemplo, ``'AMD64'``. Uma *string* vazia é devolvida se o valor não puder ser determinado.
sv: Returnerar maskintypen, t.ex. ``'AMD64'``. En tom sträng returneras om värdet inte kan bestämmas.

source: Returns the computer's network name (may not be fully qualified!). An empty string is returned if the value cannot be determined.
pt_pt: Devolve o nome de rede do computador (pode não estar totalmente qualificado!). Uma *string* vazia é devolvida se o valor não puder ser determinado.
sv: Returnerar datorns nätverksnamn (får inte vara fullständigt kvalificerat!). En tom sträng returneras om värdet inte kan fastställas.

source: Returns a single string identifying the underlying platform with as much useful information as possible.
pt_pt: Devolve uma *string* única que identifica a plataforma subjacente com o máximo de informações úteis possível.
sv: Returnerar en enda sträng som identifierar den underliggande plattformen med så mycket användbar information som möjligt.

source: The output is intended to be *human readable* rather than machine parseable. It may look different on different platforms and this is intended.
pt_pt: A saída destina-se a ser *legível por humanos* em vez de analisável por máquinas. Pode parecer diferente em diferentes plataformas, e isto é intencional.
sv: Utdata är avsedda att vara *mänskligt läsbara* snarare än maskinläsbara. Den kan se annorlunda ut på olika plattformar och det är meningen.

source: If *aliased* is true, the function will use aliases for various platforms that report system names which differ from their common names, for example SunOS will be reported as Solaris. The :func:`system_alias` function is used to implement this.
pt_pt: Se *aliased* for verdadeiro, a função usará *aliases* para várias plataformas que reportam nomes de sistema diferentes dos seus nomes comuns, por exemplo, SunOS será reportado como Solaris. A função :func:`system_alias` é usada para implementar isto.
sv: Om *aliased* är true kommer funktionen att använda alias för olika plattformar som rapporterar systemnamn som skiljer sig från deras vanliga namn, t.ex. kommer SunOS att rapporteras som Solaris. Funktionen :func:`system_alias` används för att implementera detta.

source: Setting *terse* to true causes the function to return only the absolute minimum information needed to identify the platform.
pt_pt: Definir *terse* como verdadeiro faz com que a função devolva apenas a informação mínima absoluta necessária para identificar a plataforma.
sv: Om *terse* sätts till true returnerar funktionen endast den absolut minsta information som behövs för att identifiera plattformen.

source: On macOS, the function now uses :func:`mac_ver`, if it returns a non-empty release string, to get the macOS version rather than the darwin version.
pt_pt: No macOS, a função usa agora :func:`mac_ver`, se esta devolver uma *string* de versão não vazia, para obter a versão do macOS em vez da versão do Darwin.
sv: På macOS använder funktionen nu :func:`mac_ver`, om den returnerar en icke-tom release-sträng, för att få macOS-versionen i stället för darwin-versionen.

source: Returns the (real) processor name, e.g. ``'amdk6'``.
pt_pt: Devolve o nome (real) do processador, por exemplo, ``'amdk6'``.
sv: Returnerar det (riktiga) processornamnet, t.ex. ``'amdk6'``.

source: An empty string is returned if the value cannot be determined. Note that many platforms do not provide this information or simply return the same value as for :func:`machine`. NetBSD does this.
pt_pt: Uma *string* vazia é devolvida se o valor não puder ser determinado. Note que muitas plataformas não fornecem esta informação ou simplesmente devolvem o mesmo valor que para :func:`machine`. O NetBSD faz isto.
sv: En tom sträng returneras om värdet inte kan bestämmas. Observera att många plattformar inte ger denna information eller helt enkelt returnerar samma värde som för :func:`machine`. NetBSD gör detta.

source: Returns a tuple ``(buildno, builddate)`` stating the Python build number and date as strings.
pt_pt: Devolve um tuplo ``(buildno, builddate)`` indicando o número e a data da compilação do Python como *strings*.
sv: Returnerar en tupel ``(buildno, builddate)`` som anger Python-byggnummer och -datum som strängar.

source: Returns a string identifying the compiler used for compiling Python.
pt_pt: Devolve uma *string* que identifica o compilador usado para compilar o Python.
sv: Returnerar en sträng som identifierar den kompilator som används för att kompilera Python.

source: Returns a string identifying the Python implementation SCM branch.
pt_pt: Devolve uma *string* que identifica o ramo SCM da implementação do Python.
sv: Returnerar en sträng som identifierar SCM-grenen för Python-implementeringen.

source: Returns a string identifying the Python implementation. Possible return values are: 'CPython', 'IronPython', 'Jython', 'PyPy'.
pt_pt: Devolve uma *string* que identifica a implementação do Python. Os valores possíveis de retorno são: 'CPython', 'IronPython', 'Jython', 'PyPy'.
sv: Returnerar en sträng som identifierar Python-implementationen. Möjliga returvärden är: 'CPython', 'IronPython', 'Jython', 'PyPy'.

source: Returns a string identifying the Python implementation SCM revision.
pt_pt: Devolve uma *string* que identifica a revisão SCM da implementação do Python.
sv: Returnerar en sträng som identifierar Python-implementationens SCM-revision.

source: Returns the Python version as string ``'major.minor.patchlevel'``.
pt_pt: Devolve a versão do Python como *string* ``'major.minor.patchlevel'``.
sv: Returnerar Python-versionen som strängen ``'major.minor.patchlevel'``.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to 0).
pt_pt: Note que, ao contrário do ``sys.version`` do Python, o valor devolvido incluirá sempre o nível de *patch* (por predefinição, 0).
sv: Observera att till skillnad från Pythons ``sys.version`` kommer det returnerade värdet alltid att innehålla patchlevel (standardvärdet är 0).

source: Returns the Python version as tuple ``(major, minor, patchlevel)`` of strings.
pt_pt: Devolve a versão do Python como um tuplo ``(major, minor, patchlevel)`` de *strings*.
sv: Returnerar Python-versionen som en tupel ``(major, minor, patchlevel)`` av strängar.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to ``'0'``).
pt_pt: Note que, ao contrário do ``sys.version`` do Python, o valor devolvido incluirá sempre o nível de *patch* (por predefinição, ``'0'``).
sv: Observera att till skillnad från Pythons ``sys.version`` kommer det returnerade värdet alltid att innehålla patchlevel (standardvärdet är ``'0'``).

source: Returns the system's release, e.g. ``'2.2.0'`` or ``'NT'``. An empty string is returned if the value cannot be determined.
pt_pt: Devolve a versão do sistema, por exemplo, ``'2.2.0'`` ou ``'NT'``. Uma *string* vazia é devolvida se o valor não puder ser determinado.
sv: Returnerar systemets release, t.ex. ``'2.2.0'`` eller ``'NT'``. En tom sträng returneras om värdet inte kan bestämmas.

source: Returns the system/OS name, such as ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. An empty string is returned if the value cannot be determined.
pt_pt: Devolve o nome do sistema/OS, como ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. Uma *string* vazia é devolvida se o valor não puder ser determinado.
sv: Returnerar system/OS-namnet, till exempel ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. En tom sträng returneras om värdet inte kan bestämmas.

source: On iOS and Android, this returns the user-facing OS name (i.e, ``'iOS``, ``'iPadOS'`` or ``'Android'``). To obtain the kernel name (``'Darwin'`` or ``'Linux'``), use :func:`os.uname`.
pt_pt: No iOS e Android, isto devolve o nome do OS apresentado ao utilizador (ou seja, ``'iOS``, ``'iPadOS'`` ou ``'Android'``). Para obter o nome do kernel (``'Darwin'`` ou ``'Linux'``), utilize :func:`os.uname`.
sv: På iOS och Android returnerar detta namnet på det operativsystem som vänder sig till användaren (dvs. ``'iOS``, ``'iPadOS'`` eller ``'Android'``). För att få kärnans namn (``'Darwin'`` eller ``'Linux'``), använd :func:`os.uname`.

source: Returns ``(system, release, version)`` aliased to common marketing names used for some systems. It also does some reordering of the information in some cases where it would otherwise cause confusion.
pt_pt: Devolve ``(system, release, version)`` com aliases para nomes de marketing comuns usados para alguns sistemas. Também faz alguma reordenação da informação em alguns casos onde, de outra forma, poderia causar confusão.
sv: Returnerar ``(system, release, version)`` med alias till vanliga marknadsföringsnamn som används för vissa system. Den gör också en viss omordning av informationen i vissa fall där den annars skulle orsaka förvirring.

source: Returns the system's release version, e.g. ``'#3 on degas'``. An empty string is returned if the value cannot be determined.
pt_pt: Devolve a versão de *release* do sistema, por exemplo, ``'#3 on degas'``. Uma *string* vazia é devolvida se o valor não puder ser determinado.
sv: Returnerar systemets releaseversion, t.ex. ``'#3 on degas'``. En tom sträng returneras om värdet inte kan bestämmas.

source: On iOS and Android, this is the user-facing OS version. To obtain the Darwin or Linux kernel version, use :func:`os.uname`.
pt_pt: No iOS e Android, esta é a versão do OS apresentada ao utilizador. Para obter a versão do *kernel* Darwin ou Linux, utilize :func:`os.uname`.
sv: På iOS och Android är detta den OS-version som möter användaren. För att få Darwin- eller Linux-kärnversionen, använd :func:`os.uname`.

source: Fairly portable uname interface. Returns a :func:`~collections.namedtuple` containing six attributes: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine`, and :attr:`processor`.
pt_pt: Interface *uname* bastante portável. Devolve um :func:`~collections.namedtuple` contendo seis atributos: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine` e :attr:`processor`.
sv: Ganska portabelt uname-gränssnitt. Returnerar en :func:`~collections.namedtuple` som innehåller sex attribut: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine` och :attr:`processor`.

source: :attr:`processor` is resolved late, on demand.
pt_pt: :attr:`processor` é resolvido mais tarde, quando necessário.
sv: :attr:`processor` löses sent, på begäran.

source: Note: the first two attribute names differ from the names presented by :func:`os.uname`, where they are named :attr:`!sysname` and :attr:`!nodename`.
pt_pt: Nota: os nomes dos dois primeiros atributos diferem dos nomes apresentados por :func:`os.uname`, onde são chamados :attr:`!sysname` e :attr:`!nodename`.
sv: Observera: De två första attributnamnen skiljer sig från de namn som presenteras av :func:`os.uname`, där de heter :attr:`!sysname` och :attr:`!nodename`.

source: Entries which cannot be determined are set to ``''``.
pt_pt: Entradas que não possam ser determinadas são definidas como ``''``.
sv: Poster som inte kan bestämmas sätts till ``''``.

source: Result changed from a tuple to a :func:`~collections.namedtuple`.
pt_pt: O resultado mudou de um tuplo para um :func:`~collections.namedtuple`.
sv: Resultatet ändrades från en tuple till en :func:`~collections.namedtuple`.

source: :attr:`processor` is resolved late instead of immediately.
pt_pt: :attr:`processor` é resolvido mais tarde em vez de imediatamente.
sv: :attr:`processor` löses sent istället för omedelbart.

source: Java platform
pt_pt: Plataforma Java
sv: Java-plattform

source: Version interface for Jython.
pt_pt: Interface de versão para Jython.
sv: Versionsgränssnitt för Jython.

source: Returns a tuple ``(release, vendor, vminfo, osinfo)`` with *vminfo* being a tuple ``(vm_name, vm_release, vm_vendor)`` and *osinfo* being a tuple ``(os_name, os_version, os_arch)``. Values which cannot be determined are set to the defaults given as parameters (which all default to ``''``).
pt_pt: Devolve um tuplo ``(release, vendor, vminfo, osinfo)``, onde *vminfo* é um tuplo ``(vm_name, vm_release, vm_vendor)`` e *osinfo* é um tuplo ``(os_name, os_version, os_arch)``. Valores que não possam ser determinados são definidos para os valores predefinidos dados como parâmetros (todos predefinidos para ``''``).
sv: Returnerar en tupel ``(release, vendor, vminfo, osinfo)`` där *vminfo* är en tupel ``(vm_name, vm_release, vm_vendor)`` och *osinfo* är en tupel ``(os_name, os_version, os_arch)``. Värden som inte kan bestämmas sätts till de standardvärden som anges som parametrar (som alla har ``''`` som standard).

source: It was largely untested, had a confusing API, and was only useful for Jython support.
pt_pt: Era em grande parte não testado, tinha uma API confusa e era útil apenas para suporte ao Jython.
sv: Det var i stort sett otestat, hade ett förvirrande API och var bara användbart för Jython-stöd.

source: Windows platform
pt_pt: Plataforma Windows
sv: Windows-plattform

source: Get additional version information from the Windows Registry and return a tuple ``(release, version, csd, ptype)`` referring to OS release, version number, CSD level (service pack) and OS type (multi/single processor). Values which cannot be determined are set to the defaults given as parameters (which all default to an empty string).
pt_pt: Obtém informações adicionais de versão do Registo do Windows e devolve um tuplo ``(release, version, csd, ptype)`` referente à versão do OS, número de versão, nível CSD (*service pack*) e tipo de OS (multi/single processador). Valores que não possam ser determinados são definidos para os valores predefinidos dados como parâmetros (todos predefinidos para uma *string* vazia).
sv: Hämta ytterligare versionsinformation från Windows Registry och returnera en tupel ``(release, version, csd, ptype)`` som hänvisar till OS-version, versionsnummer, CSD-nivå (service pack) och OS-typ (multi/single processor). Värden som inte kan bestämmas sätts till de standardvärden som anges som parametrar (som alla har en tom sträng som standard).

source: As a hint: *ptype* is ``'Uniprocessor Free'`` on single processor NT machines and ``'Multiprocessor Free'`` on multi processor machines. The ``'Free'`` refers to the OS version being free of debugging code. It could also state ``'Checked'`` which means the OS version uses debugging code, i.e. code that checks arguments, ranges, etc.
pt_pt: Como dica: *ptype* é ``'Uniprocessor Free'`` em máquinas NT de processador único e ``'Multiprocessor Free'`` em máquinas de múltiplos processadores. O ``'Free'`` refere-se à versão do OS estar livre de código de depuração. Também pode indicar ``'Checked'``, o que significa que a versão do OS usa código de depuração, ou seja, código que verifica argumentos, intervalos, etc.
sv: Som en ledtråd: *ptype* är ``'Uniprocessor Free'`` på NT-maskiner med en processor och ``'Multiprocessor Free'`` på maskiner med flera processorer. ``'Free'`` hänvisar till att OS-versionen är fri från felsökningskod. Det kan också stå ``'Checked'`` vilket betyder att OS-versionen använder felsökningskod, dvs. kod som kontrollerar argument, intervall etc.

source: Returns a string representing the current Windows edition, or ``None`` if the value cannot be determined. Possible values include but are not limited to ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'``, and ``'nanoserver'``.
pt_pt: Devolve uma *string* que representa a edição atual do Windows, ou ``None`` se o valor não puder ser determinado. Valores possíveis incluem, mas não estão limitados a, ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'`` e ``'nanoserver'``.
sv: Returnerar en sträng som representerar den aktuella Windows-utgåvan, eller ``None`` om värdet inte kan fastställas. Möjliga värden inkluderar men är inte begränsade till ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'`` och ``'nanoserver'``.

source: Return ``True`` if the Windows edition returned by :func:`win32_edition` is recognized as an IoT edition.
pt_pt: Devolve ``True`` se a edição do Windows devolvida por :func:`win32_edition` for reconhecida como uma edição IoT.
sv: Returnerar ``True`` om Windows-utgåvan som returneras av :func:`win32_edition` känns igen som en IoT-utgåva.

source: macOS platform
pt_pt: Plataforma macOS
sv: macOS-plattform

source: Get macOS version information and return it as tuple ``(release, versioninfo, machine)`` with *versioninfo* being a tuple ``(version, dev_stage, non_release_version)``.
pt_pt: Obtém informações da versão do macOS e devolve-as como um tuplo ``(release, versioninfo, machine)``, onde *versioninfo* é um tuplo ``(version, dev_stage, non_release_version)``.
sv: Hämta MacOS-versioninformation och returnera den som tuple ``(release, versioninfo, machine)`` med *versioninfo* som är en tuple ``(version, dev_stage, non_release_version)``.

source: Entries which cannot be determined are set to ``''``. All tuple entries are strings.
pt_pt: Entradas que não possam ser determinadas são definidas como ``''``. Todas as entradas do tuplo são *strings*.
sv: Poster som inte kan bestämmas sätts till ``''``. Alla tuple-poster är strängar.

source: iOS platform
pt_pt: Plataforma iOS
sv: iOS-plattform

source: Get iOS version information and return it as a :func:`~collections.namedtuple` with the following attributes:
pt_pt: Obtém informações da versão do iOS e devolve-as como um :func:`~collections.namedtuple` com os seguintes atributos:
sv: Hämta iOS-versionsinformation och returnera den som en :func:`~collections.namedtuple` med följande attribut:

source: ``system`` is the OS name; either ``'iOS'`` or ``'iPadOS'``.
pt_pt: ``system`` é o nome do OS; ou ``'iOS'`` ou ``'iPadOS'``.
sv: ``system`` är namnet på operativsystemet; antingen ``'iOS'`` eller ``'iPadOS'``.

source: ``release`` is the iOS version number as a string (e.g., ``'17.2'``).
pt_pt: ``release`` é o número da versão do iOS como uma *string* (por exemplo, ``'17.2'``).
sv: ``release`` är iOS-versionens nummer som en sträng (t.ex. ``'17.2'``).

source: ``model`` is the device model identifier; this will be a string like ``'iPhone13,2'`` for a physical device, or ``'iPhone'`` on a simulator.
pt_pt: ``model`` é o identificador do modelo do dispositivo; isto será uma *string* como ``'iPhone13,2'`` para um dispositivo físico, ou ``'iPhone'`` num simulador.
sv: ``model`` är identifieraren för enhetsmodellen; detta kommer att vara en sträng som ``'iPhone13,2'`` för en fysisk enhet, eller ``'iPhone'`` för en simulator.

source: ``is_simulator`` is a boolean describing if the app is running on a simulator or a physical device.
pt_pt: ``is_simulator`` é um booleano que indica se a aplicação está a correr num simulador ou num dispositivo físico.
sv: ``is_simulator`` är en boolean som beskriver om appen körs på en simulator eller en fysisk enhet.

source: Entries which cannot be determined are set to the defaults given as parameters.
pt_pt: Entradas que não possam ser determinadas são definidas para os valores predefinidos dados como parâmetros.
sv: Poster som inte kan bestämmas sätts till de standardvärden som anges som parametrar.

source: Unix platforms
pt_pt: Plataformas Unix
sv: Unix-plattformar
