Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/platform.po
Languages: pt_pt, sv

source: Tries to determine the libc version against which the file executable (defaults to the Python interpreter) is linked. Returns a tuple of strings ``(lib, version)`` which default to the given parameters in case the lookup fails.
pt_pt: Tenta determinar a versão da *libc* contra a qual o ficheiro executável (por predefinição, o interpretador Python) está ligado. Devolve um tuplo de *strings* ``(lib, version)`` que, em caso de falha na pesquisa, assume os valores dos parâmetros indicados.
sv: Försöker fastställa vilken libc-version som filens körbara (standard är Python-tolken) är länkad mot. Returnerar en tupel av strängarna ``(lib, version)`` som har de angivna parametrarna som standard om sökningen misslyckas.

source: Note that this function has intimate knowledge of how different libc versions add symbols to the executable is probably only usable for executables compiled using :program:`gcc`.
pt_pt: Note que esta função tem conhecimento detalhado de como diferentes versões da *libc* adicionam símbolos ao executável e é provavelmente apenas utilizável para executáveis compilados usando :program:`gcc`.
sv: Observera att denna funktion har intima kunskaper om hur olika libc-versioner lägger till symboler i den exekverbara filen är förmodligen endast användbar för exekverbara filer som kompilerats med :program:`gcc`.

source: The file is read and scanned in chunks of *chunksize* bytes.
pt_pt: O ficheiro é lido e analisado em blocos de *chunksize* *bytes*.
sv: Filen läses och skannas i bitar om *chunksize* bytes.

source: Linux platforms
pt_pt: Plataformas Linux
sv: Linux-plattformar

source: Get operating system identification from ``os-release`` file and return it as a dict. The ``os-release`` file is a `freedesktop.org standard <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ and is available in most Linux distributions. A noticeable exception is Android and Android-based distributions.
pt_pt: Obtém a identificação do sistema operativo do ficheiro ``os-release`` e devolve-a como um dicionário. O ficheiro ``os-release`` é um padrão `freedesktop.org <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ e está disponível na maioria das distribuições Linux. Uma exceção notável é o Android e distribuições baseadas em Android.
sv: Hämta identifiering av operativsystem från filen ``os-release`` och returnera den som en dict. Filen ``os-release`` är en `freedesktop.org standard <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ och finns tillgänglig i de flesta Linux-distributioner. Ett märkbart undantag är Android och Android-baserade distributioner.

source: Raises :exc:`OSError` or subclass when neither ``/etc/os-release`` nor ``/usr/lib/os-release`` can be read.
pt_pt: Levanta uma exceção :exc:`OSError` ou subclasse quando nem ``/etc/os-release`` nem ``/usr/lib/os-release`` puderem ser lidos.
sv: Utlöser :exc:`OSError` eller underklass när varken ``/etc/os-release`` eller ``/usr/lib/os-release`` kan läsas.

source: On success, the function returns a dictionary where keys and values are strings. Values have their special characters like ``"`` and ``$`` unquoted. The fields ``NAME``, ``ID``, and ``PRETTY_NAME`` are always defined according to the standard. All other fields are optional. Vendors may include additional fields.
pt_pt: Em caso de sucesso, a função devolve um dicionário onde as chaves e valores são *strings*. Os valores têm os seus caracteres especiais, como ``"`` e ``$``, sem aspas. Os campos ``NAME``, ``ID`` e ``PRETTY_NAME`` estão sempre definidos de acordo com o padrão. Todos os outros campos são opcionais. Os fornecedores podem incluir campos adicionais.
sv: Om funktionen lyckas returnerar den en ordbok där nycklar och värden är strängar. Värden har sina specialtecken som ``"`` och ``$`` ociterade. Fälten ``NAME``, ``ID`` och ``PRETTY_NAME`` är alltid definierade enligt standarden. Alla andra fält är valfria. Leverantörer kan inkludera ytterligare fält.

source: Note that fields like ``NAME``, ``VERSION``, and ``VARIANT`` are strings suitable for presentation to users. Programs should use fields like ``ID``, ``ID_LIKE``, ``VERSION_ID``, or ``VARIANT_ID`` to identify Linux distributions.
pt_pt: Note que campos como ``NAME``, ``VERSION`` e ``VARIANT`` são *strings* adequadas para apresentação aos utilizadores. Os programas devem usar campos como ``ID``, ``ID_LIKE``, ``VERSION_ID`` ou ``VARIANT_ID`` para identificar distribuições Linux.
sv: Observera att fält som ``NAME``, ``VERSION`` och ``VARIANT`` är strängar som lämpar sig för presentation för användare. Program bör använda fält som ``ID``, ``ID_LIKE``, ``VERSION_ID`` eller ``VARIANT_ID`` för att identifiera Linux-distributioner.

source: Example::
pt_pt: Exemplo::
sv: Exempel::

source: def get_like_distro(): info = platform.freedesktop_os_release() ids = [info["ID"]] if "ID_LIKE" in info: # ids are space separated and ordered by precedence ids.extend(info["ID_LIKE"].split()) return ids
pt_pt: def get_like_distro(): info = platform.freedesktop_os_release() ids = [info["ID"]] if "ID_LIKE" in info: # os ids estão separados por espaços e ordenados por precedência ids.extend(info["ID_LIKE"].split()) return ids
sv: def get_like_distro(): info = plattform.freedesktop_os_release() ids = [info["ID"]]] if "ID_LIKE" in info: # ids är mellanslagsseparerade och ordnade efter företräde ids.extend(info["ID_LIKE"].split()) returnera ids

source: Android platform
pt_pt: Plataforma Android
sv: Android-plattform

source: Get Android device information. Returns a :func:`~collections.namedtuple` with the following attributes. Values which cannot be determined are set to the defaults given as parameters.
pt_pt: Obtém informações do dispositivo Android. Devolve um :func:`~collections.namedtuple` com os seguintes atributos. Valores que não possam ser determinados são definidos para os valores predefinidos dados como parâmetros.
sv: Hämta information om Android-enheter. Returnerar en :func:`~collections.namedtuple` med följande attribut. Värden som inte kan bestämmas sätts till de standardvärden som anges som parametrar.

source: ``release`` - Android version, as a string (e.g. ``"14"``).
pt_pt: ``release`` - Versão do Android, como uma *string* (por exemplo, ``"14"``).
sv: ``release`` - Android-version, som en sträng (t.ex. ``"14"``).

source: ``api_level`` - API level of the running device, as an integer (e.g. ``34`` for Android 14). To get the API level which Python was built against, see :func:`sys.getandroidapilevel`.
pt_pt: ``api_level`` - Nível de API do dispositivo em execução, como um inteiro (por exemplo, ``34`` para Android 14). Para obter o nível de API contra o qual o Python foi compilado, consulte :func:`sys.getandroidapilevel`.
sv: ``api_level`` - API-nivå för den enhet som körs, som ett heltal (t.ex. ``34`` för Android 14). För att få API-nivån som Python byggdes mot, se :func:`sys.getandroidapilevel`.

source: ``manufacturer`` - `Manufacturer name <https://developer.android.com/reference/android/os/Build#MANUFACTURER>`__.
pt_pt: ``manufacturer`` - `Nome do fabricante <https://developer.android.com/reference/android/os/Build#MANUFACTURER>`__.
sv: ``manufacturer`` - `Tillverkarens namn <https://developer.android.com/reference/android/os/Build#MANUFACTURER>`__.

source: ``model`` - `Model name <https://developer.android.com/reference/android/os/Build#MODEL>`__ – typically the marketing name or model number.
pt_pt: ``model`` - `Nome do modelo <https://developer.android.com/reference/android/os/Build#MODEL>`__ – tipicamente o nome de marketing ou número do modelo.
sv: ``model`` - `Modellnamn <https://developer.android.com/reference/android/os/Build#MODEL>`__ - vanligtvis marknadsföringsnamn eller modellnummer.

source: ``device`` - `Device name <https://developer.android.com/reference/android/os/Build#DEVICE>`__ – typically the model number or a codename.
pt_pt: ``device`` - `Nome do dispositivo <https://developer.android.com/reference/android/os/Build#DEVICE>`__ – tipicamente o número do modelo ou um nome de código.
sv: ``enhet`` - `enhetens namn <https://developer.android.com/reference/android/os/Build#DEVICE>`__ - vanligtvis modellnumret eller ett kodnamn.

source: ``is_emulator`` - ``True`` if the device is an emulator; ``False`` if it's a physical device.
pt_pt: ``is_emulator`` - ``True`` se o dispositivo for um emulador; ``False`` se for um dispositivo físico.
sv: ``is_emulator`` - ``True`` om enheten är en emulator; ``False`` om det är en fysisk enhet.

source: Google maintains a `list of known model and device names <https://storage.googleapis.com/play_public/supported_devices.html>`__.
pt_pt: A Google mantém uma `lista de nomes de modelos e dispositivos conhecidos <https://storage.googleapis.com/play_public/supported_devices.html>`__.
sv: Google upprätthåller en `lista över kända modell- och enhetsnamn <https://storage.googleapis.com/play_public/supported_devices.html>`__.

source: Command-line usage
pt_pt: Utilização na linha de comandos
sv: Användning av kommandoraden

source: :mod:`platform` can also be invoked directly using the :option:`-m` switch of the interpreter::
pt_pt: O módulo :mod:`platform` também pode ser invocado diretamente usando a opção :option:`-m` do interpretador::
sv: :mod:`platform` kan också anropas direkt med hjälp av :option:`\-m` i tolken::

source: python -m platform [--terse] [--nonaliased] [{nonaliased,terse} ...]
sv: python -m plattform [--terse] [--nonaliased] [{nonaliased,terse} ...]

source: The following options are accepted:
pt_pt: As seguintes opções são aceites:
sv: Följande alternativ accepteras:

source: Print terse information about the platform. This is equivalent to calling :func:`platform.platform` with the *terse* argument set to ``True``.
pt_pt: Imprime informações resumidas sobre a plataforma. Isto é equivalente a chamar :func:`platform.platform` com o argumento *terse* definido como ``True``.
sv: Skriver ut kortfattad information om plattformen. Detta motsvarar att anropa :func:`platform.platform` med *terse*-argumentet satt till ``True``.

source: Print platform information without system/OS name aliasing. This is equivalent to calling :func:`platform.platform` with the *aliased* argument set to ``True``.
pt_pt: Imprime informações da plataforma sem *aliases* de nomes de sistema/OS. Isto é equivalente a chamar :func:`platform.platform` com o argumento *aliased* definido como ``True``.
sv: Skriv ut plattformsinformation utan aliasing av system/OS-namn. Detta motsvarar att anropa :func:`platform.platform` med argumentet *aliased* satt till ``True``.

source: You can also pass one or more positional arguments (``terse``, ``nonaliased``) to explicitly control the output format. These behave similarly to their corresponding options.
pt_pt: Também pode passar um ou mais argumentos posicionais (``terse``, ``nonaliased``) para controlar explicitamente o formato da saída. Estes comportam-se de forma semelhante às suas opções correspondentes.
sv: Du kan också skicka ett eller flera positionella argument (``terse``, ``nonaliased``) för att uttryckligen styra utdataformatet. Dessa beter sig på samma sätt som motsvarande alternativ.

source: The output is platform-dependent and may differ in casing and naming conventions.
pt_pt: A saída depende da plataforma e pode diferir em maiúsculas/minúsculas e convenções de nomenclatura.
