Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/profile.po
Languages: pt_pt, ru

source: With :mod:`cProfile`, each caller is preceded by three numbers: the number of times this specific call was made, and the total and cumulative times spent in the current function while it was invoked by this specific caller.
pt_pt: Com :mod:`cProfile`, cada chamador é precedido por três números: o número de vezes que esta chamada específica foi feita, e os tempos total e cumulativo gastos na função atual enquanto foi invocada por este chamador específico.
ru: В :mod:`cProfile` каждому вызывающему объекту предшествуют три числа: количество раз, когда был выполнен этот конкретный вызов, а также общее и совокупное время, проведенное в текущей функции, пока она была вызвана этим конкретным вызывающим объектом.

source: This method for the :class:`Stats` class prints a list of all function that were called by the indicated function. Aside from this reversal of direction of calls (re: called vs was called by), the arguments and ordering are identical to the :meth:`~pstats.Stats.print_callers` method.
pt_pt: Este método da classe :class:`Stats` imprime uma lista de todas as funções que foram chamadas pela função indicada. Além desta inversão da direção das chamadas (re: chamada vs chamada por), os argumentos e a ordenação são idênticos ao método :meth:`~pstats.Stats.print_callers`.
ru: Этот метод класса :class:`Stats` печатает список всех функций, которые были вызваны указанной функцией. Помимо этого изменения направления вызовов (re: вызванный vs был вызван), аргументы и порядок идентичны методу :meth:`~pstats.Stats.print_callers`.

source: This method returns an instance of StatsProfile, which contains a mapping of function names to instances of FunctionProfile. Each FunctionProfile instance holds information related to the function's profile such as how long the function took to run, how many times it was called, etc...
pt_pt: Este método devolve uma instância de StatsProfile, que contém um mapeamento de nomes de funções para instâncias de FunctionProfile. Cada instância de FunctionProfile contém informações relacionadas com o perfil da função, como o tempo que a função demorou a executar, quantas vezes foi chamada, etc...
ru: Этот метод возвращает экземпляр StatsProfile, который содержит сопоставление имен функций с экземплярами FunctionProfile. Каждый экземпляр FunctionProfile содержит информацию, связанную с профилем функции, например, сколько времени потребовалось для выполнения функции, сколько раз она вызывалась и т. д.

source: Added the following dataclasses: StatsProfile, FunctionProfile. Added the following function: get_stats_profile.
pt_pt: Adicionadas as seguintes dataclasses: StatsProfile, FunctionProfile. Adicionada a seguinte função: get_stats_profile.
ru: Добавлены следующие классы данных: StatsProfile, FunctionProfile. Добавлена ​​следующая функция: get_stats_profile.

source: What Is Deterministic Profiling?
pt_pt: O que é Perfilação Determinística?
ru: Что такое детерминированное профилирование?

source: :dfn:`Deterministic profiling` is meant to reflect the fact that all *function call*, *function return*, and *exception* events are monitored, and precise timings are made for the intervals between these events (during which time the user's code is executing). In contrast, :dfn:`statistical profiling` (which is not done by this module) randomly samples the effective instruction pointer, and deduces where time is being spent. The latter technique traditionally involves less overhead (as the code does not need to be instrumented), but provides only relative indications of where time is being spent.
pt_pt: A :dfn:`perfilação determinística` destina-se a refletir o facto de que todos os eventos de *chamada de função*, *retorno de função* e *exceção* são monitorizados, e são feitas medições precisas dos intervalos entre estes eventos (durante os quais o código do utilizador está a ser executado). Em contraste, a :dfn:`perfilação estatística` (que não é feita por este módulo) amostra aleatoriamente o ponteiro de instrução efetivo e deduz onde o tempo está a ser gasto. Esta última técnica envolve tradicionalmente menos sobrecarga (já que o código não precisa de ser instrumentado), mas fornece apenas indicações relativas de onde o tempo está a ser gasto.
ru: :dfn:`Детерминированное профилирование` предназначено для отражения того факта, что все события *вызова функции*, *возврата функции* и *исключения* отслеживаются, а для интервалов между этими событиями устанавливается точное время (в течение которого пользователь код выполняется). Напротив, статистическое профилирование (которое не выполняется в этом модуле) случайным образом выбирает эффективный указатель инструкции и определяет, на что тратится время. Последний метод традиционно предполагает меньшие накладные расходы (поскольку код не требует инструментирования), но обеспечивает лишь относительные показатели того, на что тратится время.

source: In Python, since there is an interpreter active during execution, the presence of instrumented code is not required in order to do deterministic profiling. Python automatically provides a :dfn:`hook` (optional callback) for each event. In addition, the interpreted nature of Python tends to add so much overhead to execution, that deterministic profiling tends to only add small processing overhead in typical applications. The result is that deterministic profiling is not that expensive, yet provides extensive run time statistics about the execution of a Python program.
pt_pt: Em Python, uma vez que há um interpretador ativo durante a execução, a presença de código instrumentado não é necessária para realizar perfilação determinística. O Python fornece automaticamente um :dfn:`gancho` (callback opcional) para cada evento. Além disso, a natureza interpretada do Python tende a adicionar tanta sobrecarga à execução, que a perfilação determinística tende a adicionar apenas uma pequena sobrecarga de processamento em aplicações típicas. O resultado é que a perfilação determinística não é tão dispendiosa, mas fornece estatísticas extensas de tempo de execução sobre a execução de um programa Python.
ru: В Python, поскольку во время выполнения активен интерпретатор, наличие инструментированного кода не требуется для выполнения детерминированного профилирования. Python автоматически предоставляет :dfn:`hook` (необязательный обратный вызов) для каждого события. Кроме того, интерпретируемая природа Python имеет тенденцию добавлять столько накладных расходов на выполнение, что детерминированное профилирование имеет тенденцию добавлять лишь небольшие накладные расходы на обработку в типичных приложениях. В результате детерминированное профилирование обходится не так дорого, но обеспечивает обширную статистику времени выполнения программы Python.

source: Call count statistics can be used to identify bugs in code (surprising counts), and to identify possible inline-expansion points (high call counts). Internal time statistics can be used to identify "hot loops" that should be carefully optimized. Cumulative time statistics should be used to identify high level errors in the selection of algorithms. Note that the unusual handling of cumulative times in this profiler allows statistics for recursive implementations of algorithms to be directly compared to iterative implementations.
pt_pt: As estatísticas de contagem de chamadas podem ser usadas para identificar bugs no código (contagens surpreendentes) e para identificar possíveis pontos de expansão em linha (contagens de chamadas elevadas). As estatísticas de tempo interno podem ser usadas para identificar "loops quentes" que devem ser cuidadosamente otimizados. As estatísticas de tempo cumulativo devem ser usadas para identificar erros de alto nível na seleção de algoritmos. Note que o tratamento incomum dos tempos cumulativos neste perfilador permite que as estatísticas para implementações recursivas de algoritmos sejam diretamente comparadas com implementações iterativas.
ru: Статистику количества вызовов можно использовать для выявления ошибок в коде (неожиданное количество вызовов) и для выявления возможных точек встроенного расширения (большое количество вызовов). Внутреннюю статистику времени можно использовать для выявления «горячих петель», которые следует тщательно оптимизировать. Для выявления ошибок высокого уровня при выборе алгоритмов следует использовать совокупную временную статистику. Обратите внимание, что необычная обработка совокупного времени в этом профилировщике позволяет напрямую сравнивать статистику рекурсивных реализаций алгоритмов с итеративными реализациями.

source: Limitations
pt_pt: Limitações
ru: Ограничения

source: One limitation has to do with accuracy of timing information. There is a fundamental problem with deterministic profilers involving accuracy. The most obvious restriction is that the underlying "clock" is only ticking at a rate (typically) of about .001 seconds. Hence no measurements will be more accurate than the underlying clock. If enough measurements are taken, then the "error" will tend to average out. Unfortunately, removing this first error induces a second source of error.
pt_pt: Uma limitação tem a ver com a precisão das informações de temporização. Há um problema fundamental com os perfiladores determinísticos que envolve a precisão. A restrição mais óbvia é que o "relógio" subjacente está apenas a contar a uma taxa (tipicamente) de cerca de 0,001 segundos. Portanto, nenhuma medição será mais precisa do que o relógio subjacente. Se forem feitas medições suficientes, então o "erro" tenderá a ser compensado. Infelizmente, remover este primeiro erro induz uma segunda fonte de erro.
ru: Одно из ограничений связано с точностью временной информации. Существует фундаментальная проблема с детерминированными профилировщиками, связанная с точностью. Наиболее очевидным ограничением является то, что базовые «часы» тикают со скоростью (обычно) около 0,001 секунды. Следовательно, никакие измерения не будут более точными, чем базовые часы. Если проведено достаточно измерений, то «ошибка» будет иметь тенденцию к усреднению. К сожалению, удаление этой первой ошибки приводит к появлению второго источника ошибок.

source: The second problem is that it "takes a while" from when an event is dispatched until the profiler's call to get the time actually *gets* the state of the clock. Similarly, there is a certain lag when exiting the profiler event handler from the time that the clock's value was obtained (and then squirreled away), until the user's code is once again executing. As a result, functions that are called many times, or call many functions, will typically accumulate this error. The error that accumulates in this fashion is typically less than the accuracy of the clock (less than one clock tick), but it *can* accumulate and become very significant.
pt_pt: O segundo problema é que "demora algum tempo" desde que um evento é despachado até que a chamada do perfilador para obter o tempo realmente *obtenha* o estado do relógio. Da mesma forma, há um certo atraso ao sair do gestor de eventos do perfilador desde o momento em que o valor do relógio foi obtido (e depois guardado), até que o código do utilizador esteja novamente a ser executado. Como resultado, funções que são chamadas muitas vezes, ou que chamam muitas funções, acumularão tipicamente este erro. O erro que se acumula desta forma é tipicamente menor do que a precisão do relógio (menos do que um tick do relógio), mas *pode* acumular-se e tornar-se muito significativo.
ru: Вторая проблема заключается в том, что с момента отправки события до момента вызова профилировщика для получения времени «проходит некоторое время» фактически *получение* состояния часов. Аналогичным образом, при выходе из обработчика событий профилировщика существует определенная задержка с момента получения значения часов (а затем его сохранения) до повторного выполнения пользовательского кода. В результате функции, которые вызываются много раз или вызывают множество функций, обычно накапливают эту ошибку. Ошибка, которая накапливается таким образом, обычно меньше точности часов (менее одного такта), но она *может* накапливаться и становиться очень значительной.

source: The problem is more important with :mod:`profile` than with the lower-overhead :mod:`cProfile`. For this reason, :mod:`profile` provides a means of calibrating itself for a given platform so that this error can be probabilistically (on the average) removed. After the profiler is calibrated, it will be more accurate (in a least square sense), but it will sometimes produce negative numbers (when call counts are exceptionally low, and the gods of probability work against you :-). ) Do *not* be alarmed by negative numbers in the profile. They should *only* appear if you have calibrated your profiler, and the results are actually better than without calibration.
pt_pt: O problema é mais importante com :mod:`profile` do que com o :mod:`cProfile` de menor sobrecarga. Por esta razão, o :mod:`profile` fornece um meio de se calibrar para uma plataforma dada, de modo a que este erro possa ser removido probabilisticamente (em média). Após o perfilador ser calibrado, será mais preciso (no sentido dos mínimos quadrados), mas às vezes produzirá números negativos (quando as contagens de chamadas são excepcionalmente baixas, e os deuses da probabilidade trabalham contra si :-). ) *Não* se alarme com números negativos no perfil. Eles só devem aparecer se calibrou o seu perfilador, e os resultados são na verdade melhores do que sem calibração.
ru: Проблема более серьезна с :mod:`profile`, чем с более низкими издержками :mod:`cProfile`. По этой причине :mod:`profile` предоставляет средства калибровки для данной платформы, чтобы эту ошибку можно было вероятностно (в среднем) устранить. После калибровки профилировщика он станет более точным (в смысле наименьших квадратов), но иногда будет выдавать отрицательные числа (когда количество вызовов исключительно мало и боги вероятности работают против вас :-). ) *Не* пугайтесь отрицательных цифр в профиле. Они должны появиться *только* в том случае, если вы откалибровали свой профилировщик, и результаты на самом деле лучше, чем без калибровки.

source: Calibration
pt_pt: Calibração
ru: Калибровка

source: The profiler of the :mod:`profile` module subtracts a constant from each event handling time to compensate for the overhead of calling the time function, and socking away the results. By default, the constant is 0. The following procedure can be used to obtain a better constant for a given platform (see :ref:`profile-limitations`). ::
pt_pt: O perfilador do módulo :mod:`profile` subtrai uma constante de cada tempo de tratamento de evento para compensar a sobrecarga de chamar a função de tempo, e guardar os resultados. Por predefinição, a constante é 0. O seguinte procedimento pode ser usado para obter uma constante melhor para uma plataforma dada (veja :ref:`profile-limitations`). :
ru: Профилировщик модуля :mod:`profile` вычитает константу из времени обработки каждого события, чтобы компенсировать накладные расходы на вызов функции времени и удаление результатов. По умолчанию константа равна 0. Для получения лучшей константы для данной платформы можно использовать следующую процедуру (см. :ref:`profile-limitations`). ::

source: The method executes the number of Python calls given by the argument, directly and again under the profiler, measuring the time for both. It then computes the hidden overhead per profiler event, and returns that as a float. For example, on a 1.8Ghz Intel Core i5 running macOS, and using Python's time.process_time() as the timer, the magical number is about 4.04e-6.
pt_pt: O método executa o número de chamadas Python dado pelo argumento, diretamente e novamente sob o perfilador, medindo o tempo para ambos. Em seguida, calcula a sobrecarga oculta por evento do perfilador e devolve isso como um float. Por exemplo, num Intel Core i5 a 1,8Ghz a executar macOS, e usando time.process_time() do Python como temporizador, o número mágico é cerca de 4,04e-6.
ru: Метод выполняет количество вызовов Python, заданное аргументом, непосредственно и снова под профилировщиком, измеряя время для обоих. Затем он вычисляет скрытые издержки для каждого события профилировщика и возвращает их в виде числа с плавающей запятой. Например, на процессоре Intel Core i5 с тактовой частотой 1,8 ГГц под управлением macOS и использовании Python time.process_time() в качестве таймера магическое число составляет около 4.04e-6.

source: The object of this exercise is to get a fairly consistent result. If your computer is *very* fast, or your timer function has poor resolution, you might have to pass 100000, or even 1000000, to get consistent results.
pt_pt: O objetivo deste exercício é obter um resultado razoavelmente consistente. Se o seu computador for *muito* rápido, ou se a sua função de temporização tiver baixa resolução, pode ter de passar 100000, ou mesmo 1000000, para obter resultados consistentes.
ru: Цель этого упражнения — получить достаточно стабильный результат. Если ваш компьютер *очень* быстр или ваша функция таймера имеет низкое разрешение, вам, возможно, придется передать 100000 или даже 1000000, чтобы получить последовательные результаты.

source: When you have a consistent answer, there are three ways you can use it::
pt_pt: Quando tiver uma resposta consistente, há três formas de a usar:
ru: Если у вас есть последовательный ответ, вы можете использовать его тремя способами:

source: import profile # 1. Apply computed bias to all Profile instances created hereafter. profile.Profile.bias = your_computed_bias # 2. Apply computed bias to a specific Profile instance. pr = profile.Profile() pr.bias = your_computed_bias # 3. Specify computed bias in instance constructor. pr = profile.Profile(bias=your_computed_bias)
pt_pt: import profile # 1. Aplicar o enviesamento calculado a todas as instâncias de Profile criadas a partir de agora. profile.Profile.bias = your_computed_bias # 2. Aplicar o enviesamento calculado a uma instância específica de Profile. pr = profile.Profile() pr.bias = your_computed_bias # 3. Especificar o enviesamento calculado no construtor da instância. pr = profile.Profile(bias=your_computed_bias)

source: If you have a choice, you are better off choosing a smaller constant, and then your results will "less often" show up as negative in profile statistics.
pt_pt: Se tiver escolha, é melhor escolher uma constante menor, e então os seus resultados aparecerão "menos frequentemente" como negativos nas estatísticas de perfil.
ru: Если у вас есть выбор, лучше выбрать меньшую константу, и тогда ваши результаты «реже» будут отображаться как отрицательные в статистике профиля.

source: Using a custom timer
pt_pt: A usar um temporizador personalizado
ru: Использование пользовательского таймера

source: If you want to change how current time is determined (for example, to force use of wall-clock time or elapsed process time), pass the timing function you want to the :class:`Profile` class constructor::
pt_pt: Se quiser alterar a forma como o tempo atual é determinado (por exemplo, para forçar a utilização do tempo de relógio de parede ou do tempo de processo decorrido), passe a função de temporização que deseja para o construtor da classe :class:`Profile`:
ru: Если вы хотите изменить способ определения текущего времени (например, чтобы принудительно использовать время настенных часов или прошедшее время процесса), передайте нужную функцию синхронизации в конструктор класса :class:`Profile`::

source: The resulting profiler will then call ``your_time_func``. Depending on whether you are using :class:`profile.Profile` or :class:`cProfile.Profile`, ``your_time_func``'s return value will be interpreted differently:
pt_pt: O perfilador resultante chamará então ``your_time_func``. Dependendo de estar a usar :class:`profile.Profile` ou :class:`cProfile.Profile`, o valor de retorno de ``your_time_func`` será interpretado de forma diferente:
ru: Результирующий профилировщик затем вызовет ``your_time_func``. В зависимости от того, используете ли вы :class:`profile.Profile` или :class:`cProfile.Profile`, возвращаемое значение ``your_time_func`` будет интерпретироваться по-разному:

source: ``your_time_func`` should return a single number, or a list of numbers whose sum is the current time (like what :func:`os.times` returns). If the function returns a single time number, or the list of returned numbers has length 2, then you will get an especially fast version of the dispatch routine.
pt_pt: ``your_time_func`` deve devolver um único número, ou uma lista de números cuja soma é o tempo atual (como o que :func:`os.times` devolve). Se a função devolver um único número de tempo, ou a lista de números devolvidos tiver comprimento 2, então obterá uma versão especialmente rápida da rotina de despacho.
ru: ``your_time_func`` должен возвращать одно число или список чисел, сумма которых равна текущему времени (например, что возвращает :func:`os.times`). Если функция возвращает одно числовое значение или список возвращаемых чисел имеет длину 2, то вы получите особенно быструю версию процедуры отправки.

source: Be warned that you should calibrate the profiler class for the timer function that you choose (see :ref:`profile-calibration`). For most machines, a timer that returns a lone integer value will provide the best results in terms of low overhead during profiling. (:func:`os.times` is *pretty* bad, as it returns a tuple of floating-point values). If you want to substitute a better timer in the cleanest fashion, derive a class and hardwire a replacement dispatch method that best handles your timer call, along with the appropriate calibration constant.
pt_pt: Tenha em atenção que deve calibrar a classe do perfilador para a função de temporização que escolher (veja :ref:`profile-calibration`). Para a maioria das máquinas, um temporizador que devolve um único valor inteiro fornecerá os melhores resultados em termos de baixa sobrecarga durante a perfilagem. (:func:`os.times` é *muito* mau, já que devolve um tuplo de valores de vírgula flutuante). Se quiser substituir um temporizador melhor da forma mais limpa, derive uma classe e codifique uma rotina de despacho de substituição que melhor lide com a sua chamada de temporizador, juntamente com a constante de calibração apropriada.

source: ``your_time_func`` should return a single number. If it returns integers, you can also invoke the class constructor with a second argument specifying the real duration of one unit of time. For example, if ``your_integer_time_func`` returns times measured in thousands of seconds, you would construct the :class:`Profile` instance as follows::
pt_pt: ``your_time_func`` deve devolver um único número. Se devolver inteiros, pode também invocar o construtor da classe com um segundo argumento que especifica a duração real de uma unidade de tempo. Por exemplo, se ``your_integer_time_func`` devolver tempos medidos em milhares de segundos, criaria a instância :class:`Profile` da seguinte forma:
ru: ``your_time_func`` должен возвращать одно число. Если он возвращает целые числа, вы также можете вызвать конструктор класса со вторым аргументом, указывающим реальную продолжительность одной единицы времени. Например, если ``your_integer_time_func`` возвращает время, измеряемое в тысячах секунд, вы должны создать экземпляр :class:`Profile` следующим образом:
