Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/profile.po
Languages: pt_pt, ru

source: Directly using the :class:`Profile` class allows formatting profile results without writing the profile data to a file::
pt_pt: Usar diretamente a classe :class:`Profile` permite formatar resultados de perfilagem sem escrever os dados de perfilagem num ficheiro:
ru: Непосредственное использование класса :class:`Profile` позволяет форматировать результаты профиля без записи данных профиля в файл::

source: import cProfile, pstats, io from pstats import SortKey pr = cProfile.Profile() pr.enable() # ... do something ... pr.disable() s = io.StringIO() sortby = SortKey.CUMULATIVE ps = pstats.Stats(pr, stream=s).sort_stats(sortby) ps.print_stats() print(s.getvalue())
pt_pt: import cProfile, pstats, io from pstats import SortKey pr = cProfile.Profile() pr.enable() # ... fazer algo ... pr.disable() s = io.StringIO() sortby = SortKey.CUMULATIVE ps = pstats.Stats(pr, stream=s).sort_stats(sortby) ps.print_stats() print(s.getvalue())

source: The :class:`Profile` class can also be used as a context manager (supported only in :mod:`cProfile` module. see :ref:`typecontextmanager`)::
pt_pt: A classe :class:`Profile` também pode ser usada como um gestor de contexto (suportado apenas no módulo :mod:`cProfile`. veja :ref:`typecontextmanager`):
ru: Класс :class:`Profile` также можно использовать в качестве менеджера контекста (поддерживается только в модуле :mod:`cProfile`. см. :ref:`typecontextmanager`)::

source: import cProfile with cProfile.Profile() as pr: # ... do something ... pr.print_stats()
pt_pt: import cProfile with cProfile.Profile() as pr: # ... fazer algo ... pr.print_stats()

source: Added context manager support.
pt_pt: Suporte para gestor de contexto adicionado.
ru: Добавлена ​​поддержка контекстного менеджера.

source: Start collecting profiling data. Only in :mod:`cProfile`.
pt_pt: Iniciar a recolha de dados de perfilagem. Apenas em :mod:`cProfile`.
ru: Начните собирать данные для профилирования. Только в :mod:`cProfile`.

source: Stop collecting profiling data. Only in :mod:`cProfile`.
pt_pt: Parar de recolher dados de perfilagem. Apenas em :mod:`cProfile`.
ru: Прекратите сбор данных профилирования. Только в :mod:`cProfile`.

source: Stop collecting profiling data and record the results internally as the current profile.
pt_pt: Parar de recolher dados de perfilagem e registar os resultados internamente como o perfil atual.
ru: Прекратите сбор данных профилирования и запишите результаты внутри компании как текущий профиль.

source: Create a :class:`~pstats.Stats` object based on the current profile and print the results to stdout.
pt_pt: Criar um objeto :class:`~pstats.Stats` baseado no perfil atual e imprimir os resultados para stdout.
ru: Создайте объект :class:`~pstats.Stats` на основе текущего профиля и выведите результаты на стандартный вывод.

source: Write the results of the current profile to *filename*.
pt_pt: Escreve os resultados do perfil atual para *filename*.
ru: Запишите результаты текущего профиля в *filename*.

source: Profile the cmd via :func:`exec`.
pt_pt: Perfila o comando via :func:`exec`.
ru: Профилируйте cmd через :func:`exec`.

source: Profile the cmd via :func:`exec` with the specified global and local environment.
pt_pt: Perfila o comando via :func:`exec` com o ambiente global e local especificado.
ru: Профилируйте cmd через :func:`exec` с указанной глобальной и локальной средой.

source: Profile ``func(*args, **kwargs)``
pt_pt: Perfila ``func(*args, **kwargs)``
ru: Профиль ``func(*args, **kwargs)``

source: Note that profiling will only work if the called command/function actually returns. If the interpreter is terminated (e.g. via a :func:`sys.exit` call during the called command/function execution) no profiling results will be printed.
pt_pt: Note que a perfilagem só funcionará se o comando/função chamada realmente retornar. Se o interpretador for terminado (por exemplo, através de uma chamada :func:`sys.exit` durante a execução do comando/função chamado), não serão impressos resultados de perfilagem.
ru: Обратите внимание, что профилирование будет работать только в том случае, если вызванная команда/функция действительно возвращает результат. Если интерпретатор завершается (например, посредством вызова :func:`sys.exit` во время выполнения вызванной команды/функции), результаты профилирования не будут напечатаны.

source: The :class:`Stats` Class
pt_pt: A classe :class:`Stats`
ru: Класс :class:`Stats`

source: Analysis of the profiler data is done using the :class:`~pstats.Stats` class.
pt_pt: A análise dos dados do perfilador é feita usando a classe :class:`~pstats.Stats`.
ru: Анализ данных профилировщика выполняется с использованием класса :class:`~pstats.Stats`.

source: This class constructor creates an instance of a "statistics object" from a *filename* (or list of filenames) or from a :class:`Profile` instance. Output will be printed to the stream specified by *stream*.
pt_pt: Este construtor de classe cria uma instância de um "objeto de estatísticas" a partir de um *filename* (ou lista de nomes de ficheiros) ou de uma instância :class:`Profile`. A saída será impressa para o fluxo especificado por *stream*.
ru: Этот конструктор класса создает экземпляр «статистического объекта» из *имя_файла* (или списка имен файлов) или из экземпляра :class:`Profile`. Вывод будет напечатан в поток, указанный *stream*.

source: The file selected by the above constructor must have been created by the corresponding version of :mod:`profile` or :mod:`cProfile`. To be specific, there is *no* file compatibility guaranteed with future versions of this profiler, and there is no compatibility with files produced by other profilers, or the same profiler run on a different operating system. If several files are provided, all the statistics for identical functions will be coalesced, so that an overall view of several processes can be considered in a single report. If additional files need to be combined with data in an existing :class:`~pstats.Stats` object, the :meth:`~pstats.Stats.add` method can be used.
pt_pt: O ficheiro selecionado pelo construtor acima deve ter sido criado pela versão correspondente de :mod:`profile` ou :mod:`cProfile`. Para ser específico, não há garantia de compatibilidade de ficheiros com versões futuras deste perfilador, e não há compatibilidade com ficheiros produzidos por outros perfiladores, ou pelo mesmo perfilador executado num sistema operativo diferente. Se forem fornecidos vários ficheiros, todas as estatísticas para funções idênticas serão fundidas, de modo que uma visão geral de vários processos possa ser considerada num único relatório. Se forem necessários combinar ficheiros adicionais com dados num objeto :class:`~pstats.Stats` existente, pode ser usado o método :meth:`~pstats.Stats.add`.
ru: Файл, выбранный указанным выше конструктором, должен быть создан соответствующей версией :mod:`profile` или :mod:`cProfile`. Точнее, *нет* совместимости файлов с будущими версиями этого профилировщика, а также нет совместимости с файлами, созданными другими профилировщиками, или с тем же профилировщиком, работающим в другой операционной системе. Если предоставлено несколько файлов, вся статистика по одинаковым функциям будет объединена, так что общее представление о нескольких процессах можно будет рассмотреть в одном отчете. Если дополнительные файлы необходимо объединить с данными в существующем объекте :class:`~pstats.Stats`, можно использовать метод :meth:`~pstats.Stats.add`.

source: Instead of reading the profile data from a file, a :class:`cProfile.Profile` or :class:`profile.Profile` object can be used as the profile data source.
pt_pt: Em vez de ler os dados de perfil a partir de um ficheiro, um objeto :class:`cProfile.Profile` ou :class:`profile.Profile` pode ser usado como a fonte de dados de perfil.
ru: Вместо чтения данных профиля из файла в качестве источника данных профиля можно использовать объект :class:`cProfile.Profile` или :class:`profile.Profile`.

source: :class:`Stats` objects have the following methods:
pt_pt: Os objetos :class:`Stats` têm os seguintes métodos:
ru: Объекты :class:`Stats` имеют следующие методы:

source: This method for the :class:`Stats` class removes all leading path information from file names. It is very useful in reducing the size of the printout to fit within (close to) 80 columns. This method modifies the object, and the stripped information is lost. After performing a strip operation, the object is considered to have its entries in a "random" order, as it was just after object initialization and loading. If :meth:`~pstats.Stats.strip_dirs` causes two function names to be indistinguishable (they are on the same line of the same filename, and have the same function name), then the statistics for these two entries are accumulated into a single entry.
pt_pt: Este método da classe :class:`Stats` remove toda a informação de caminho inicial dos nomes de ficheiros. É muito útil para reduzir o tamanho da impressão para caber (perto de) 80 colunas. Este método modifica o objeto, e a informação removida é perdida. Após realizar uma operação de remoção, o objeto é considerado como tendo as suas entradas numa ordem "aleatória", como estava logo após a inicialização e carregamento do objeto. Se :meth:`~pstats.Stats.strip_dirs` fizer com que dois nomes de funções sejam indistinguíveis (estão na mesma linha do mesmo nome de ficheiro e têm o mesmo nome de função), então as estatísticas para estas duas entradas são acumuladas numa única entrada.
ru: Этот метод для класса :class:`Stats` удаляет всю начальную информацию о пути из имен файлов. Это очень полезно для уменьшения размера распечатки до (около) 80 столбцов. Этот метод изменяет объект, и удаленная информация теряется. После выполнения операции удаления считается, что объект имеет свои записи в «случайном» порядке, как это было сразу после инициализации и загрузки объекта. Если :meth:`~pstats.Stats.strip_dirs` приводит к тому, что имена двух функций становятся неразличимыми (они находятся в одной строке с одним и тем же именем файла и имеют одно и то же имя функции), то статистика для этих двух записей накапливается в одиночная запись.

source: This method of the :class:`Stats` class accumulates additional profiling information into the current profiling object. Its arguments should refer to filenames created by the corresponding version of :func:`profile.run` or :func:`cProfile.run`. Statistics for identically named (re: file, line, name) functions are automatically accumulated into single function statistics.
pt_pt: Este método da classe :class:`Stats` acumula informações adicionais de perfilagem no objeto de perfilagem atual. Os seus argumentos devem referir nomes de ficheiros criados pela versão correspondente de :func:`profile.run` ou :func:`cProfile.run`. As estatísticas para funções com o mesmo nome (re: ficheiro, linha, nome) são automaticamente acumuladas em estatísticas de função única.
ru: Этот метод класса :class:`Stats` накапливает дополнительную информацию о профилировании в текущем объекте профилирования. Его аргументы должны ссылаться на имена файлов, созданные соответствующей версией :func:`profile.run` или :func:`cProfile.run`. Статистика для функций с одинаковыми именами (например, файл, строка, имя) автоматически накапливается в статистику одной функции.

source: Save the data loaded into the :class:`Stats` object to a file named *filename*. The file is created if it does not exist, and is overwritten if it already exists. This is equivalent to the method of the same name on the :class:`profile.Profile` and :class:`cProfile.Profile` classes.
pt_pt: Guarda os dados carregados no objeto :class:`Stats` num ficheiro chamado *filename*. O ficheiro é criado se não existir, e é sobrescrito se já existir. Isto é equivalente ao método com o mesmo nome nas classes :class:`profile.Profile` e :class:`cProfile.Profile`.
ru: Сохраните данные, загруженные в объект :class:`Stats`, в файл с именем *filename*. Файл создается, если он не существует, и перезаписывается, если он уже существует. Это эквивалентно одноименному методу в классах :class:`profile.Profile` и :class:`cProfile.Profile`.

source: This method modifies the :class:`Stats` object by sorting it according to the supplied criteria. The argument can be either a string or a SortKey enum identifying the basis of a sort (example: ``'time'``, ``'name'``, ``SortKey.TIME`` or ``SortKey.NAME``). The SortKey enums argument have advantage over the string argument in that it is more robust and less error prone.
pt_pt: Este método modifica o objeto :class:`Stats` ordenando-o de acordo com os critérios fornecidos. O argumento pode ser uma string ou um enum SortKey que identifica a base de uma ordenação (exemplo: ``'time'``, ``'name'``, ``SortKey.TIME`` ou ``SortKey.NAME``). O argumento enum SortKey tem vantagem sobre o argumento string por ser mais robusto e menos propenso a erros.
ru: Этот метод изменяет объект :class:`Stats`, сортируя его в соответствии с предоставленными критериями. Аргументом может быть либо строка, либо перечисление SortKey, определяющее основу сортировки (пример: ``'time'``, ``'name'``, ``SortKey.TIME`` или ``SortKey.NAME`` `). Аргумент перечислений SortKey имеет преимущество перед строковым аргументом, поскольку он более надежен и менее подвержен ошибкам.

source: When more than one key is provided, then additional keys are used as secondary criteria when there is equality in all keys selected before them. For example, ``sort_stats(SortKey.NAME, SortKey.FILE)`` will sort all the entries according to their function name, and resolve all ties (identical function names) by sorting by file name.
pt_pt: Quando mais do que uma chave é fornecida, então as chaves adicionais são usadas como critérios secundários quando há igualdade em todas as chaves selecionadas antes delas. Por exemplo, ``sort_stats(SortKey.NAME, SortKey.FILE)`` ordenará todas as entradas de acordo com o seu nome de função, e resolverá todos os empates (nomes de função idênticos) ordenando por nome de ficheiro.
ru: Если предоставлено более одного ключа, дополнительные ключи используются в качестве вторичных критериев, когда все ключи, выбранные перед ними, равны. Например, sort_stats(SortKey.NAME, SortKey.FILE) сортирует все записи по имени их функции и разрешает все связи (идентичные имена функций) путем сортировки по имени файла.

source: For the string argument, abbreviations can be used for any key names, as long as the abbreviation is unambiguous.
pt_pt: Para o argumento string, podem ser usadas abreviaturas para quaisquer nomes de chaves, desde que a abreviatura seja não ambígua.
ru: В качестве строкового аргумента можно использовать сокращения для любых имен ключей, если сокращение является однозначным.

source: The following are the valid string and SortKey:
pt_pt: Os seguintes são os argumentos string e SortKey válidos:
ru: Ниже приведены допустимые строка и SortKey:

source: Valid String Arg
pt_pt: Argumento String Válido
ru: Действительная строка Arg

source: Valid enum Arg
pt_pt: Argumento Enum Válido
ru: Допустимое перечисление Arg

source: Meaning
pt_pt: Significado
ru: Значение

source: call count
pt_pt: contagem de chamadas
ru: счётчик вызовов

source: cumulative time
pt_pt: tempo cumulativo
ru: суммарное время

source: N/A
pt_pt: N/D

source: file name
pt_pt: nome do ficheiro
ru: имя файла

source: primitive call count
pt_pt: contagem de chamadas primitivas
ru: количество примитивных вызовов

source: line number
pt_pt: número de linha
ru: номер строки

source: function name
pt_pt: nome da função
ru: название функции

source: name/file/line
pt_pt: nome/ficheiro/linha

source: standard name
pt_pt: nome padrão
ru: стандартное название

source: internal time
pt_pt: tempo interno
ru: внутреннее время

source: Note that all sorts on statistics are in descending order (placing most time consuming items first), where as name, file, and line number searches are in ascending order (alphabetical). The subtle distinction between ``SortKey.NFL`` and ``SortKey.STDNAME`` is that the standard name is a sort of the name as printed, which means that the embedded line numbers get compared in an odd way. For example, lines 3, 20, and 40 would (if the file names were the same) appear in the string order 20, 3 and 40. In contrast, ``SortKey.NFL`` does a numeric compare of the line numbers. In fact, ``sort_stats(SortKey.NFL)`` is the same as ``sort_stats(SortKey.NAME, SortKey.FILENAME, SortKey.LINE)``.
pt_pt: Note que todas as ordenações de estatísticas são em ordem descendente (colocando os itens que consomem mais tempo primeiro), enquanto que as pesquisas por nome, ficheiro e número de linha estão em ordem ascendente (alfabética). A distinção subtil entre ``SortKey.NFL`` e ``SortKey.STDNAME`` é que o nome padrão é uma ordenação do nome como impresso, o que significa que os números de linha incorporados são comparados de uma forma estranha. Por exemplo, as linhas 3, 20 e 40 apareceriam (se os nomes dos ficheiros fossem os mesmos) na ordem de string 20, 3 e 40. Em contraste, ``SortKey.NFL`` faz uma comparação numérica dos números de linha. De facto, ``sort_stats(SortKey.NFL)`` é o mesmo que ``sort_stats(SortKey.NAME, SortKey.FILENAME, SortKey.LINE)``.
ru: Обратите внимание, что все виды статистики расположены в порядке убывания (наиболее трудоемкие элементы размещаются первыми), тогда как поиск по имени, файлу и номеру строки осуществляется в порядке возрастания (в алфавитном порядке). Тонкое различие между SortKey.NFL и SortKey.STDNAME заключается в том, что стандартное имя является разновидностью напечатанного имени, а это означает, что встроенные номера строк сравниваются нечетным образом. Например, строки 3, 20 и 40 (если бы имена файлов были одинаковыми) отображались бы в порядке строк 20, 3 и 40. Напротив, SortKey.NFL выполняет числовое сравнение номеров строк. Фактически, ``sort_stats(SortKey.NFL)`` — это то же самое, что ``sort_stats(SortKey.NAME, SortKey.FILENAME, SortKey.LINE)``.

source: For backward-compatibility reasons, the numeric arguments ``-1``, ``0``, ``1``, and ``2`` are permitted. They are interpreted as ``'stdname'``, ``'calls'``, ``'time'``, and ``'cumulative'`` respectively. If this old style format (numeric) is used, only one sort key (the numeric key) will be used, and additional arguments will be silently ignored.
pt_pt: Por razões de retrocompatibilidade, os argumentos numéricos ``-1``, ``0``, ``1`` e ``2`` são permitidos. São interpretados como ``'stdname'``, ``'calls'``, ``'time'`` e ``'cumulative'`` respetivamente. Se este formato antigo (numérico) for usado, apenas uma chave de ordenação (a chave numérica) será usada, e argumentos adicionais serão ignorados silenciosamente.
ru: По соображениям обратной совместимости разрешены числовые аргументы ``-1``, ``0``, ``1`` и ``2``. Они интерпретируются как ``'stdname'``, ``'calls'``, ``'time'`` и ``'cumulative'`` соответственно. Если используется этот старый формат (числовой), будет использоваться только один ключ сортировки (числовой ключ), а дополнительные аргументы будут игнорироваться.

source: Added the SortKey enum.
pt_pt: Adicionado o enum SortKey.
ru: Добавлено перечисление SortKey.

source: This method for the :class:`Stats` class reverses the ordering of the basic list within the object. Note that by default ascending vs descending order is properly selected based on the sort key of choice.
pt_pt: Este método da classe :class:`Stats` inverte a ordenação da lista básica dentro do objeto. Note que, por predefinição, a ordem ascendente vs descendente é selecionada corretamente com base na chave de ordenação escolhida.
ru: Этот метод класса :class:`Stats` меняет порядок основного списка внутри объекта. Обратите внимание, что по умолчанию порядок сортировки по возрастанию или убыванию выбирается правильно в зависимости от выбранного ключа сортировки.

source: This method for the :class:`Stats` class prints out a report as described in the :func:`profile.run` definition.
pt_pt: Este método da classe :class:`Stats` imprime um relatório como descrito na definição de :func:`profile.run`.
ru: Этот метод класса :class:`Stats` распечатывает отчет, как описано в определении :func:`profile.run`.

source: The order of the printing is based on the last :meth:`~pstats.Stats.sort_stats` operation done on the object (subject to caveats in :meth:`~pstats.Stats.add` and :meth:`~pstats.Stats.strip_dirs`).
pt_pt: A ordem da impressão é baseada na última operação :meth:`~pstats.Stats.sort_stats` feita no objeto (sujeita a advertências em :meth:`~pstats.Stats.add` e :meth:`~pstats.Stats.strip_dirs`).
ru: Порядок печати зависит от последней операции :meth:`~pstats.Stats.sort_stats`, выполненной над объектом (с учетом оговорок в :meth:`~pstats.Stats.add` и :meth:`~pstats. Stats.strip_dirs`).

source: would first limit the printing to first 10% of list, and then only print functions that were part of filename :file:`.\*foo:`. In contrast, the command::
pt_pt: limitava primeiro a impressão aos primeiros 10% da lista, e depois apenas imprimia funções que faziam parte do nome de ficheiro :file:`.\*foo:`. Em contraste, o comando:
ru: сначала ограничит печать первыми 10% списка, а затем распечатает только функции, которые были частью имени файла :file:`.\*foo:`. Напротив, команда::

source: would limit the list to all functions having file names :file:`.\*foo:`, and then proceed to only print the first 10% of them.
pt_pt: limitava a lista a todas as funções com nomes de ficheiro :file:`.\*foo:`, e depois procedia a imprimir apenas os primeiros 10% delas.
ru: ограничит список всеми функциями, имеющими имена файлов :file:`.\*foo:`, а затем продолжит печатать только первые 10% из них.

source: This method for the :class:`Stats` class prints a list of all functions that called each function in the profiled database. The ordering is identical to that provided by :meth:`~pstats.Stats.print_stats`, and the definition of the restricting argument is also identical. Each caller is reported on its own line. The format differs slightly depending on the profiler that produced the stats:
pt_pt: Este método da classe :class:`Stats` imprime uma lista de todas as funções que chamaram cada função na base de dados perfilada. A ordenação é idêntica à fornecida por :meth:`~pstats.Stats.print_stats`, e a definição do argumento restritivo também é idêntica. Cada chamador é reportado na sua própria linha. O formato difere ligeiramente dependendo do perfilador que produziu as estatísticas:
ru: Этот метод класса :class:`Stats` печатает список всех функций, которые вызывали каждую функцию в профилируемой базе данных. Порядок идентичен тому, который обеспечивает :meth:`~pstats.Stats.print_stats`, и определение ограничивающего аргумента также идентично. О каждом звонящем сообщается по отдельной линии. Формат немного отличается в зависимости от профилировщика, создавшего статистику:

source: With :mod:`profile`, a number is shown in parentheses after each caller to show how many times this specific call was made. For convenience, a second non-parenthesized number repeats the cumulative time spent in the function at the right.
pt_pt: Com :mod:`profile`, um número é mostrado entre parênteses após cada chamador para mostrar quantas vezes esta chamada específica foi feita. Para conveniência, um segundo número não entre parênteses repete o tempo cumulativo gasto na função à direita.
ru: В :mod:`profile` число отображается в скобках после каждого вызывающего абонента, чтобы показать, сколько раз был сделан этот конкретный вызов. Для удобства второе число без скобок повторяет совокупное время, потраченное на функцию справа.
