Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/profile.po
Languages: pt_pt, ru

source: As the :class:`cProfile.Profile` class cannot be calibrated, custom timer functions should be used with care and should be as fast as possible. For the best results with a custom timer, it might be necessary to hard-code it in the C source of the internal :mod:`!_lsprof` module.
pt_pt: Como a classe :class:`cProfile.Profile` não pode ser calibrada, as funções de temporizador personalizadas devem ser usadas com cuidado e devem ser o mais rápidas possível. Para obter os melhores resultados com um temporizador personalizado, pode ser necessário codificá-lo no código-fonte C do módulo interno :mod:`!_lsprof`.

source: Python 3.3 adds several new functions in :mod:`time` that can be used to make precise measurements of process or wall-clock time. For example, see :func:`time.perf_counter`.
pt_pt: O Python 3.3 adiciona várias novas funções em :mod:`time` que podem ser usadas para fazer medições precisas de tempo de processo ou de relógio de parede. Por exemplo, veja :func:`time.perf_counter`.
ru: Python 3.3 добавляет несколько новых функций в :mod:`time`, которые можно использовать для точных измерений времени процесса или настенных часов. Например, см. :func:`time.perf_counter`.

source: deterministic profiling
pt_pt: perfilação determinística
ru: детерминированное профилирование

source: profiling, deterministic
pt_pt: perfilação, determinística
ru: профилирование, детерминированный

source: ``-o`` writes the profile results to a file instead of to stdout
ru: ``-o`` записывает результаты профиля в файл, а не в стандартный вывод

source: ``-s`` specifies one of the :func:`~pstats.Stats.sort_stats` sort values to sort the output by. This only applies when ``-o`` is not supplied.
ru: ``-s`` задает одно из значений сортировки :func:`~pstats.Stats.sort_stats` для сортировки вывода. Это применимо только в том случае, если не указан ``-o``.

source: ``-m`` specifies that a module is being profiled instead of a script.
ru: ``-m`` указывает, что профилируется модуль, а не скрипт.

source: This function is similar to :func:`run`, with added arguments to supply the globals and locals dictionaries for the *command* string. This routine executes::
ru: Эта функция аналогична :func:`run`, с добавленными аргументами для предоставления словарей глобальных и локальных переменных для строки *command*. Эта процедура выполняет::

source: The arguments provided (if any) can be used to limit the list down to the significant entries. Initially, the list is taken to be the complete set of profiled functions. Each restriction is either an integer (to select a count of lines), or a decimal fraction between 0.0 and 1.0 inclusive (to select a percentage of lines), or a string that will interpreted as a regular expression (to pattern match the standard name that is printed). If several restrictions are provided, then they are applied sequentially. For example::
ru: Предоставленные аргументы (если таковые имеются) можно использовать для ограничения списка значимыми записями. Изначально за список принимается полный набор профилируемых функций. Каждое ограничение представляет собой либо целое число (для выбора количества строк), либо десятичную дробь от 0,0 до 1,0 включительно (для выбора процента строк), либо строку, которая будет интерпретироваться как регулярное выражение (чтобы шаблон соответствовал стандартному имени). то, что напечатано). Если предусмотрено несколько ограничений, то они применяются последовательно. Например::
