Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/profile.po
Languages: pt_pt, ru

source: The Python Profilers
pt_pt: Os Perfiladores do Python
ru: Профилировщики Python

source: **Source code:** :source:`Lib/profile.py` and :source:`Lib/pstats.py`
pt_pt: **Código fonte:** :source:`Lib/profile.py` e :source:`Lib/pstats.py`
ru: **Исходный код:** :source:`Lib/profile.py`

source: Introduction to the profilers
pt_pt: Introdução aos perfiladores
ru: Знакомство с профайлерами

source: :mod:`cProfile` and :mod:`profile` provide :dfn:`deterministic profiling` of Python programs. A :dfn:`profile` is a set of statistics that describes how often and for how long various parts of the program executed. These statistics can be formatted into reports via the :mod:`pstats` module.
pt_pt: Os módulos :mod:`cProfile` e :mod:`profile` fornecem :dfn:`perfilação determinística` de programas Python. Um :dfn:`perfil` é um conjunto de estatísticas que descreve com que frequência e por quanto tempo várias partes do programa foram executadas. Estas estatísticas podem ser formatadas em relatórios através do módulo :mod:`pstats`.
ru: :mod:`cProfile` и :mod:`profile` обеспечивают :dfn:`детерминированное профилирование` программ Python. :dfn:`profile` — это набор статистических данных, описывающих, как часто и как долго выполняются различные части программы. Эту статистику можно форматировать в отчеты с помощью модуля :mod:`pstats`.

source: The Python standard library provides two different implementations of the same profiling interface:
pt_pt: A biblioteca padrão do Python fornece duas implementações diferentes da mesma interface de perfilação:
ru: Стандартная библиотека Python предоставляет две разные реализации одного и того же интерфейса профилирования:

source: :mod:`cProfile` is recommended for most users; it's a C extension with reasonable overhead that makes it suitable for profiling long-running programs. Based on :mod:`lsprof`, contributed by Brett Rosen and Ted Czotter.
pt_pt: O :mod:`cProfile` é recomendado para a maioria dos utilizadores; é uma extensão em C com sobrecarga razoável que o torna adequado para perfilagem de programas de longa duração. Baseado em :mod:`lsprof`, contribuído por Brett Rosen e Ted Czotter.
ru: :mod:`cProfile` рекомендуется большинству пользователей; это расширение C с разумными накладными расходами, что делает его подходящим для профилирования долго выполняющихся программ. На основе :mod:`lsprof`, предоставленного Бреттом Розеном и Тедом Чоттером.

source: :mod:`profile`, a pure Python module whose interface is imitated by :mod:`cProfile`, but which adds significant overhead to profiled programs. If you're trying to extend the profiler in some way, the task might be easier with this module. Originally designed and written by Jim Roskind.
pt_pt: O :mod:`profile` é um módulo em Python puro cuja interface é imitada pelo :mod:`cProfile`, mas que adiciona uma sobrecarga significativa aos programas perfilados. Se estiver a tentar estender o perfilador de alguma forma, a tarefa pode ser mais fácil com este módulo. Originalmente concebido e escrito por Jim Roskind.
ru: :mod:`profile`, модуль на чистом Python, интерфейс которого имитирует :mod:`cProfile`, но который добавляет значительные накладные расходы к профилируемым программам. Если вы пытаетесь каким-либо образом расширить профилировщик, с помощью этого модуля задача может быть проще. Первоначально разработан и написан Джимом Роскиндом.

source: The profiler modules are designed to provide an execution profile for a given program, not for benchmarking purposes (for that, there is :mod:`timeit` for reasonably accurate results). This particularly applies to benchmarking Python code against C code: the profilers introduce overhead for Python code, but not for C-level functions, and so the C code would seem faster than any Python one.
pt_pt: Os módulos de perfilagem são concebidos para fornecer um perfil de execução para um programa dado, não para fins de benchmarking (para isso, existe o :mod:`timeit` para resultados razoavelmente precisos). Isto aplica-se particularmente ao benchmarking de código Python contra código C: os perfiladores introduzem sobrecarga para o código Python, mas não para funções de nível C, e assim o código C pareceria mais rápido do que qualquer código Python.
ru: Модули профилировщика предназначены для предоставления профиля выполнения данной программы, а не для целей тестирования (для этого существует :mod:`timeit` для получения достаточно точных результатов). Это особенно относится к сравнению кода Python с кодом C: профилировщики вносят накладные расходы для кода Python, но не для функций уровня C, и поэтому код C будет казаться быстрее, чем любой код Python.

source: Instant User's Manual
pt_pt: Manual Rápido do Utilizador
ru: Мгновенное руководство пользователя

source: This section is provided for users that "don't want to read the manual." It provides a very brief overview, and allows a user to rapidly perform profiling on an existing application.
pt_pt: Esta secção é fornecida para utilizadores que "não querem ler o manual". Fornece uma visão geral muito breve e permite que um utilizador realize rapidamente a perfilagem numa aplicação existente.
ru: Этот раздел предназначен для пользователей, которые «не хотят читать руководство». Он предоставляет очень краткий обзор и позволяет пользователю быстро выполнить профилирование существующего приложения.

source: To profile a function that takes a single argument, you can do::
pt_pt: Para perfilhar uma função que recebe um único argumento, pode fazer:
ru: Чтобы профилировать функцию, которая принимает один аргумент, вы можете сделать::

source: (Use :mod:`profile` instead of :mod:`cProfile` if the latter is not available on your system.)
pt_pt: (Use :mod:`profile` em vez de :mod:`cProfile` se este último não estiver disponível no seu sistema.)
ru: (Используйте :mod:`profile` вместо :mod:`cProfile`, если последний недоступен в вашей системе.)

source: The above action would run :func:`re.compile` and print profile results like the following::
pt_pt: A ação acima executaria :func:`re.compile` e imprimiria resultados de perfilagem como os seguintes:
ru: Вышеуказанное действие запустит :func:`re.compile` и распечатает результаты профиля, подобные следующим:

source: 214 function calls (207 primitive calls) in 0.002 seconds Ordered by: cumulative time ncalls tottime percall cumtime percall filename:lineno(function) 1 0.000 0.000 0.002 0.002 {built-in method builtins.exec} 1 0.000 0.000 0.001 0.001 <string>:1(<module>) 1 0.000 0.000 0.001 0.001 __init__.py:250(compile) 1 0.000 0.000 0.001 0.001 __init__.py:289(_compile) 1 0.000 0.000 0.000 0.000 _compiler.py:759(compile) 1 0.000 0.000 0.000 0.000 _parser.py:937(parse) 1 0.000 0.000 0.000 0.000 _compiler.py:598(_code) 1 0.000 0.000 0.000 0.000 _parser.py:435(_parse_sub)
pt_pt: 214 chamadas de função (207 chamadas primitivas) em 0.002 segundos Ordenado por: tempo cumulativo ncalls tottime percall cumtime percall filename:lineno(function) 1 0.000 0.000 0.002 0.002 {método integrado builtins.exec} 1 0.000 0.000 0.001 0.001 <string>:1(<module>) 1 0.000 0.000 0.001 0.001 __init__.py:250(compile) 1 0.000 0.000 0.001 0.001 __init__.py:289(_compile) 1 0.000 0.000 0.000 0.000 _compiler.py:759(compile) 1 0.000 0.000 0.000 0.000 _parser.py:937(parse) 1 0.000 0.000 0.000 0.000 _compiler.py:598(_code) 1 0.000 0.000 0.000 0.000 _parser.py:435(_parse_sub)

source: The first line indicates that 214 calls were monitored. Of those calls, 207 were :dfn:`primitive`, meaning that the call was not induced via recursion. The next line: ``Ordered by: cumulative time`` indicates the output is sorted by the ``cumtime`` values. The column headings include:
pt_pt: A primeira linha indica que 214 chamadas foram monitorizadas. Dessas chamadas, 207 foram :dfn:`primitivas`, o que significa que a chamada não foi induzida por recursão. A linha seguinte: ``Ordered by: cumulative time`` indica que a saída está ordenada pelos valores ``cumtime``. Os cabeçalhos das colunas incluem:
ru: В первой строке указано, что было прослежено 214 звонков. Из этих вызовов 207 были :dfn:`примитивными`, что означает, что вызов не был вызван рекурсией. Следующая строка: ``Упорядочено по: совокупному времени`` указывает, что выходные данные отсортированы по значениям ``cumtime``. Заголовки столбцов включают в себя:

source: for the number of calls.
pt_pt: para o número de chamadas.
ru: за количество звонков.

source: for the total time spent in the given function (and excluding time made in calls to sub-functions)
pt_pt: para o tempo total gasto na função dada (e excluindo o tempo gasto em chamadas para sub-funções)
ru: за общее время, проведенное в данной функции (без учета времени, потраченного на вызовы подфункций)

source: is the quotient of ``tottime`` divided by ``ncalls``
pt_pt: é o quociente de ``tottime`` dividido por ``ncalls``
ru: это частное общего времени, разделенное на ncalls.

source: is the cumulative time spent in this and all subfunctions (from invocation till exit). This figure is accurate *even* for recursive functions.
pt_pt: é o tempo cumulativo gasto nesta função e em todas as subfunções (desde a invocação até à saída). Este valor é preciso *mesmo* para funções recursivas.
ru: — совокупное время, затраченное на эту и все подфункции (от вызова до выхода). Эта цифра точна *даже* для рекурсивных функций.

source: is the quotient of ``cumtime`` divided by primitive calls
pt_pt: é o quociente de ``cumtime`` dividido por chamadas primitivas
ru: это частное от ``cumtime``, разделенное на примитивные вызовы

source: provides the respective data of each function
pt_pt: fornece os dados respetivos de cada função
ru: предоставляет соответствующие данные каждой функции

source: When there are two numbers in the first column (for example ``3/1``), it means that the function recursed. The second value is the number of primitive calls and the former is the total number of calls. Note that when the function does not recurse, these two values are the same, and only the single figure is printed.
pt_pt: Quando há dois números na primeira coluna (por exemplo, ``3/1``), significa que a função foi recursiva. O segundo valor é o número de chamadas primitivas e o primeiro é o número total de chamadas. Note que quando a função não é recursiva, estes dois valores são os mesmos, e apenas o número único é impresso.
ru: Когда в первом столбце два числа (например, ``3/1``), это означает, что функция рекурсивна. Второе значение — это количество вызовов примитивов, а первое — общее количество вызовов. Обратите внимание: когда функция не рекурсивна, эти два значения одинаковы, и печатается только одна цифра.

source: Instead of printing the output at the end of the profile run, you can save the results to a file by specifying a filename to the :func:`run` function::
pt_pt: Em vez de imprimir a saída no final da execução do perfil, pode guardar os resultados num ficheiro, especificando um nome de ficheiro para a função :func:`run`:
ru: Вместо того, чтобы печатать выходные данные в конце запуска профиля, вы можете сохранить результаты в файл, указав имя файла для функции :func:`run`::

source: The :class:`pstats.Stats` class reads profile results from a file and formats them in various ways.
pt_pt: A classe :class:`pstats.Stats` lê resultados de perfilagem de um ficheiro e formata-os de várias maneiras.
ru: Класс :class:`pstats.Stats` считывает результаты профиля из файла и форматирует их различными способами.

source: The files :mod:`cProfile` and :mod:`profile` can also be invoked as a script to profile another script. For example::
pt_pt: Os ficheiros :mod:`cProfile` e :mod:`profile` também podem ser invocados como um script para perfilhar outro script. Por exemplo:
ru: Файлы :mod:`cProfile` и :mod:`profile` также можно использовать как скрипт для профилирования другого скрипта. Например::

source: Writes the profile results to a file instead of to stdout.
pt_pt: Escreve os resultados do perfil num ficheiro em vez de stdout.

source: Specifies one of the :func:`~pstats.Stats.sort_stats` sort values to sort the output by. This only applies when :option:`-o <cProfile -o>` is not supplied.
pt_pt: Especifica um dos valores de ordenação :func:`~pstats.Stats.sort_stats` para ordenar a saída. Isto aplica-se apenas quando :option:`-o <cProfile -o>` não é fornecido.

source: Specifies that a module is being profiled instead of a script.
pt_pt: Especifica que um módulo está a ser perfilado em vez de um script.

source: Added the ``-m`` option to :mod:`cProfile`.
pt_pt: Adicionada a opção ``-m`` ao :mod:`cProfile`.
ru: Добавлена ​​опция ``-m`` в :mod:`cProfile`.

source: Added the ``-m`` option to :mod:`profile`.
pt_pt: Adicionada a opção ``-m`` ao :mod:`profile`.
ru: Добавлена ​​опция ``-m`` в :mod:`profile`.

source: The :mod:`pstats` module's :class:`~pstats.Stats` class has a variety of methods for manipulating and printing the data saved into a profile results file::
pt_pt: A classe :class:`~pstats.Stats` do módulo :mod:`pstats` tem uma variedade de métodos para manipular e imprimir os dados guardados num ficheiro de resultados de perfilagem:
ru: Класс :class:`~pstats.Stats` модуля :mod:`pstats` имеет множество методов для манипулирования и печати данных, сохраненных в файле результатов профиля:

source: The :meth:`~pstats.Stats.strip_dirs` method removed the extraneous path from all the module names. The :meth:`~pstats.Stats.sort_stats` method sorted all the entries according to the standard module/line/name string that is printed. The :meth:`~pstats.Stats.print_stats` method printed out all the statistics. You might try the following sort calls::
pt_pt: O método :meth:`~pstats.Stats.strip_dirs` removeu o caminho extra de todos os nomes de módulos. O método :meth:`~pstats.Stats.sort_stats` ordenou todas as entradas de acordo com a string padrão módulo/linha/nome que é impressa. O método :meth:`~pstats.Stats.print_stats` imprimiu todas as estatísticas. Pode tentar as seguintes chamadas de ordenação:
ru: Метод :meth:`~pstats.Stats.strip_dirs` удалил посторонний путь из всех имен модулей. Метод :meth:`~pstats.Stats.sort_stats` сортирует все записи в соответствии со стандартной выводимой строкой модуля/строки/имени. Метод :meth:`~pstats.Stats.print_stats` распечатал всю статистику. Вы можете попробовать следующие вызовы сортировки::

source: The first call will actually sort the list by function name, and the second call will print out the statistics. The following are some interesting calls to experiment with::
pt_pt: A primeira chamada ordenará realmente a lista por nome de função, e a segunda chamada imprimirá as estatísticas. As seguintes são algumas chamadas interessantes para experimentar:
ru: Первый вызов фактически отсортирует список по имени функции, а второй вызов распечатает статистику. Ниже приведены некоторые интересные вызовы для экспериментов:

source: This sorts the profile by cumulative time in a function, and then only prints the ten most significant lines. If you want to understand what algorithms are taking time, the above line is what you would use.
pt_pt: Isto ordena o perfil por tempo cumulativo numa função, e depois imprime apenas as dez linhas mais significativas. Se quiser entender que algoritmos estão a consumir tempo, a linha acima é o que usaria.
ru: При этом профиль сортируется по совокупному времени в функции, а затем печатаются только десять наиболее важных строк. Если вы хотите понять, какие алгоритмы требуют времени, вам следует использовать приведенную выше строку.

source: If you were looking to see what functions were looping a lot, and taking a lot of time, you would do::
pt_pt: Se estivesse à procura de funções que estão em loop muitas vezes e a consumir muito tempo, faria:
ru: Если бы вы хотели увидеть, какие функции часто зацикливаются и занимают много времени, вы бы сделали:

source: to sort according to time spent within each function, and then print the statistics for the top ten functions.
pt_pt: para ordenar de acordo com o tempo gasto dentro de cada função, e depois imprimir as estatísticas para as dez funções principais.
ru: для сортировки по времени, затраченному на каждую функцию, а затем распечатки статистики для десяти самых популярных функций.

source: You might also try::
pt_pt: Também pode tentar:
ru: Вы также можете попробовать::

source: This will sort all the statistics by file name, and then print out statistics for only the class init methods (since they are spelled with ``__init__`` in them). As one final example, you could try::
pt_pt: Isto ordenará todas as estatísticas por nome de ficheiro, e depois imprimirá estatísticas apenas para os métodos de inicialização de classe (já que são escritos com ``__init__`` neles). Como exemplo final, pode tentar:
ru: Это отсортирует всю статистику по имени файла, а затем распечатает статистику только для методов инициализации класса (поскольку они пишутся с помощью ``__init__``). В качестве последнего примера вы можете попробовать:

source: This line sorts statistics with a primary key of time, and a secondary key of cumulative time, and then prints out some of the statistics. To be specific, the list is first culled down to 50% (re: ``.5``) of its original size, then only lines containing ``init`` are maintained, and that sub-sub-list is printed.
pt_pt: Esta linha ordena as estatísticas com uma chave primária de tempo, e uma chave secundária de tempo cumulativo, e depois imprime algumas das estatísticas. Especificamente, a lista é primeiro reduzida a 50% (re: ``.5``) do seu tamanho original, depois apenas as linhas que contêm ``init`` são mantidas, e essa sub-sublista é impressa.
ru: Эта строка сортирует статистику по первичному ключу времени и вторичному ключу совокупного времени, а затем распечатывает часть статистики. Точнее, список сначала сокращается до 50 % (re: ``.5``) от его исходного размера, затем сохраняются только строки, содержащие ``init``, и этот под-подсписок печатается.

source: If you wondered what functions called the above functions, you could now (``p`` is still sorted according to the last criteria) do::
pt_pt: Se se questionou que funções chamaram as funções acima, pode agora (``p`` ainda está ordenado de acordo com o último critério) fazer:
ru: Если вам интересно, какие функции называются вышеуказанными функциями, вы можете теперь (``p`` все еще сортируется по последнему критерию) сделать::

source: and you would get a list of callers for each of the listed functions.
pt_pt: e obteria uma lista de chamadores para cada uma das funções listadas.
ru: и вы получите список вызывающих абонентов для каждой из перечисленных функций.

source: If you want more functionality, you're going to have to read the manual, or guess what the following functions do::
pt_pt: Se quiser mais funcionalidade, vai ter de ler o manual, ou adivinhar o que as seguintes funções fazem:
ru: Если вам нужно больше функциональности, вам придется прочитать руководство или угадать, что делают следующие функции:

source: Invoked as a script, the :mod:`pstats` module is a statistics browser for reading and examining profile dumps. It has a simple line-oriented interface (implemented using :mod:`cmd`) and interactive help.
pt_pt: Invocado como um script, o módulo :mod:`pstats` é um navegador de estatísticas para ler e examinar dumps de perfilagem. Tem uma interface simples orientada a linhas (implementada usando :mod:`cmd`) e ajuda interativa.
ru: Модуль :mod:`pstats`, вызываемый как скрипт, представляет собой браузер статистики для чтения и проверки дампов профилей. Он имеет простой линейно-ориентированный интерфейс (реализованный с помощью :mod:`cmd`) и интерактивную справку.

source: :mod:`profile` and :mod:`cProfile` Module Reference
pt_pt: Referência dos Módulos :mod:`profile` e :mod:`cProfile`
ru: :mod:`profile` и :mod:`cProfile` Справочник по модулям

source: Both the :mod:`profile` and :mod:`cProfile` modules provide the following functions:
pt_pt: Tanto os módulos :mod:`profile` como :mod:`cProfile` fornecem as seguintes funções:
ru: :mod:`profile` и :mod:`cProfile` Справочник по модулям

source: This function takes a single argument that can be passed to the :func:`exec` function, and an optional file name. In all cases this routine executes::
pt_pt: Esta função recebe um único argumento que pode ser passado à função :func:`exec`, e um nome de ficheiro opcional. Em todos os casos, esta rotina executa:
ru: Эта функция принимает один аргумент, который можно передать в функцию :func:`exec`, и необязательное имя файла. Во всех случаях эта процедура выполняется:

source: and gathers profiling statistics from the execution. If no file name is present, then this function automatically creates a :class:`~pstats.Stats` instance and prints a simple profiling report. If the sort value is specified, it is passed to this :class:`~pstats.Stats` instance to control how the results are sorted.
pt_pt: e recolhe estatísticas de perfilagem da execução. Se nenhum nome de ficheiro estiver presente, então esta função cria automaticamente uma instância :class:`~pstats.Stats` e imprime um relatório de perfilagem simples. Se o valor de ordenação for especificado, é passado a esta instância :class:`~pstats.Stats` para controlar como os resultados são ordenados.
ru: и собирает профилирующую статистику выполнения. Если имя файла отсутствует, эта функция автоматически создает экземпляр :class:`~pstats.Stats` и печатает простой отчет о профилировании. Если указано значение сортировки, оно передается этому экземпляру :class:`~pstats.Stats` для управления сортировкой результатов.

source: and gathers profiling statistics as in the :func:`run` function above.
pt_pt: e recolhe estatísticas de perfilagem como na função :func:`run` acima.
ru: и собирает статистику профилирования, как в функции :func:`run` выше.

source: This class is normally only used if more precise control over profiling is needed than what the :func:`cProfile.run` function provides.
pt_pt: Esta classe é normalmente usada apenas se for necessário um controlo mais preciso sobre a perfilagem do que o fornecido pela função :func:`cProfile.run`.
ru: Этот класс обычно используется только в том случае, если требуется более точный контроль над профилированием, чем тот, который обеспечивает функция :func:`cProfile.run`.

source: A custom timer can be supplied for measuring how long code takes to run via the *timer* argument. This must be a function that returns a single number representing the current time. If the number is an integer, the *timeunit* specifies a multiplier that specifies the duration of each unit of time. For example, if the timer returns times measured in thousands of seconds, the time unit would be ``.001``.
pt_pt: Um temporizador personalizado pode ser fornecido para medir quanto tempo o código demora a executar através do argumento *timer*. Isto deve ser uma função que retorna um único número representando o tempo atual. Se o número for um inteiro, o *timeunit* especifica um multiplicador que especifica a duração de cada unidade de tempo. Por exemplo, se o temporizador retornar tempos medidos em milhares de segundos, a unidade de tempo seria ``.001``.
ru: Можно предоставить собственный таймер для измерения времени выполнения кода с помощью аргумента *timer*. Это должна быть функция, возвращающая одно число, представляющее текущее время. Если число является целым числом, *timeunit* указывает множитель, определяющий продолжительность каждой единицы времени. Например, если таймер возвращает время, измеряемое в тысячах секунд, единицей времени будет ``.001``.
