Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pyclbr.po
Languages: ru, sv, zh

source: :mod:`!pyclbr` --- Python module browser support
sv: :mod:`!pyclbr` --- Stöd för Python-modulbläddrare

source: **Source code:** :source:`Lib/pyclbr.py`
ru: **Исходный код:** :source:`Lib/pyclbr.py`
sv: **Källkod:** :source:`Lib/pyclbr.py`
zh: **Kod źródłowy:** :source:`Lib/pyclbr.py`

source: The :mod:`pyclbr` module provides limited information about the functions, classes, and methods defined in a Python-coded module. The information is sufficient to implement a module browser. The information is extracted from the Python source code rather than by importing the module, so this module is safe to use with untrusted code. This restriction makes it impossible to use this module with modules not implemented in Python, including all standard and optional extension modules.
ru: Модуль :mod:`pyclbr` предоставляет ограниченную информацию о функциях, классах и методах, определенных в модуле, написанном на Python. Информации достаточно для реализации модуля браузера. Информация извлекается из исходного кода Python, а не путем импорта модуля, поэтому этот модуль можно безопасно использовать с ненадежным кодом. Это ограничение делает невозможным использование этого модуля с модулями, не реализованными в Python, включая все стандартные и дополнительные модули расширения.
sv: Modulen :mod:`pyclbr` ger begränsad information om de funktioner, klasser och metoder som definieras i en Python-kodad modul. Informationen är tillräcklig för att implementera en modulbläddrare. Informationen hämtas från Python-källkoden i stället för genom att importera modulen, så den här modulen är säker att använda med opålitlig kod. Denna restriktion gör det omöjligt att använda denna modul med moduler som inte är implementerade i Python, inklusive alla standardmoduler och valfria tilläggsmoduler.
zh: Модуль :mod:`pyclbr` надає обмежену інформацію про функції, класи та методи, визначені в модулі, кодованому на Python. Інформації достатньо для впровадження браузера модулів. Інформація витягується з вихідного коду Python, а не шляхом імпорту модуля, тому цей модуль безпечно використовувати з ненадійним кодом. Це обмеження унеможливлює використання цього модуля з модулями, не реалізованими в Python, включаючи всі стандартні та додаткові модулі розширення.

source: Return a dictionary mapping module-level class names to class descriptors. If possible, descriptors for imported base classes are included. Parameter *module* is a string with the name of the module to read; it may be the name of a module within a package. If given, *path* is a sequence of directory paths prepended to ``sys.path``, which is used to locate the module source code.
ru: Возвращает имена классов уровня модуля словаря, сопоставляющие дескрипторы классов. Если возможно, включаются дескрипторы импортированных базовых классов. Параметр *module* — это строка с именем считываемого модуля; это может быть имя модуля внутри пакета. Если задано, *path* представляет собой последовательность путей к каталогам, добавленную к ``sys.path``, которая используется для поиска исходного кода модуля.
sv: Returnerar en ordbok som mappar klassnamn på modulnivå till klassdeskriptorer. Om möjligt inkluderas deskriptorer för importerade basklasser. Parameter *module* är en sträng med namnet på den modul som ska läsas; det kan vara namnet på en modul inom ett paket. Om *path* anges är det en sekvens av katalogsökvägar som föregås av ``sys.path``, som används för att hitta modulens källkod.
zh: Повертає словник, що відображає імена класів на рівні модуля на дескриптори класів. Якщо можливо, включено дескриптори для імпортованих базових класів. Параметр *module* — це рядок із назвою модуля для читання; це може бути назва модуля в пакеті. Якщо задано, *path* — це послідовність шляхів до каталогу, доданих до ``sys.path``, який використовується для пошуку вихідного коду модуля.

source: This function is the original interface and is only kept for back compatibility. It returns a filtered version of the following.
ru: Эта функция является исходным интерфейсом и сохранена только для обратной совместимости. Он возвращает отфильтрованную версию следующего.
sv: Denna funktion är det ursprungliga gränssnittet och behålls endast för bakåtkompatibilitet. Den returnerar en filtrerad version av följande.
zh: Ця функція є оригінальним інтерфейсом і зберігається лише для зворотної сумісності. Він повертає відфільтровану версію наступного.

source: Return a dictionary-based tree containing a function or class descriptors for each function and class defined in the module with a ``def`` or ``class`` statement. The returned dictionary maps module-level function and class names to their descriptors. Nested objects are entered into the children dictionary of their parent. As with readmodule, *module* names the module to be read and *path* is prepended to sys.path. If the module being read is a package, the returned dictionary has a key ``'__path__'`` whose value is a list containing the package search path.
ru: Возвращает дерево на основе словаря, содержащее дескрипторы функций или классов для каждой функции и класса, определенных в модуле, с помощью оператора def или class. Возвращенный словарь сопоставляет функции уровня модуля и имена классов с их дескрипторами. Вложенные объекты вводятся в дочерний словарь своего родителя. Как и в случае с readmodule, *module* называет модуль, который нужно прочитать, а *path* добавляется к sys.path. Если считываемый модуль является пакетом, возвращаемый словарь имеет ключ ``'__path__'``, значением которого является список, содержащий путь поиска пакета.
sv: Returnerar ett ordboksbaserat träd som innehåller en funktion eller klassdeskriptorer för varje funktion och klass som definieras i modulen med ett ``def``\- eller ``class``\-uttryck. Den returnerade ordlistan mappar modulnivåfunktioner och klassnamn till deras deskriptorer. Nästlade objekt läggs in i underordnade ordlistan för deras överordnade. Precis som med readmodule namnger *module* modulen som ska läsas och *path* läggs till i början av sys.path. Om modulen som läses är ett paket har den returnerade ordlistan en nyckel ``'__path__'`` vars värde är en lista som innehåller paketets sökväg.
zh: Повертає дерево на основі словника, що містить дескриптори функції або класу для кожної функції та класу, визначених у модулі, за допомогою оператора ``def`` або ``class``. Повернений словник відображає назви функцій і класів рівня модуля на їхні дескриптори. Вкладені об’єкти вводяться до дочірнього словника їх батьків. Як і для readmodule, *module* називає модуль, який потрібно прочитати, а *path* додається до sys.path. Якщо модуль, який читається, є пакетом, повернутий словник має ключ ``'__path__''``, значенням якого є список, що містить шлях пошуку пакета.

source: Descriptors for nested definitions. They are accessed through the new children attribute. Each has a new parent attribute.
ru: Дескрипторы для вложенных определений. Доступ к ним осуществляется через новый атрибут Children. У каждого есть новый родительский атрибут.
sv: Deskriptorer för nästlade definitioner. De nås via det nya attributet children. Var och en har ett nytt parent-attribut.
zh: Дескриптори для вкладених визначень. Доступ до них здійснюється через атрибут new children. Кожен має новий батьківський атрибут.

source: The descriptors returned by these functions are instances of Function and Class classes. Users are not expected to create instances of these classes.
ru: Дескрипторы, возвращаемые этими функциями, являются экземплярами классов Function и Class. От пользователей не ожидается создания экземпляров этих классов.
sv: De deskriptorer som returneras av dessa funktioner är instanser av klasserna Function och Class. Användare förväntas inte skapa instanser av dessa klasser.
zh: Дескриптори, які повертаються цими функціями, є екземплярами класів Function і Class. Користувачі не повинні створювати екземпляри цих класів.

source: Function Objects
ru: Функциональные объекты
sv: Funktionsobjekt
zh: Obiekty Funkcja

source: Class :class:`!Function` instances describe functions defined by def statements. They have the following attributes:
ru: Экземпляры класса :class:`!Function` описывают функции, определенные операторами def. Они имеют следующие атрибуты:
sv: Class :class:`!Function`\-instanser beskriver funktioner som definieras av def-satser. De har följande attribut:
zh: Экземпляры класса :class:`!Function` описывают функции, определенные операторами def. Они имеют следующие атрибуты:

source: Name of the file in which the function is defined.
ru: Имя файла, в котором определена функция.
sv: Namn på den fil där funktionen definieras.
zh: Ім'я файлу, в якому визначена функція.

source: The name of the module defining the function described.
ru: Имя модуля, определяющего описываемую функцию.
sv: Namnet på den modul som definierar den funktion som beskrivs.
zh: Назва модуля, що визначає описану функцію.

source: The name of the function.
ru: Имя функции.
sv: Namnet på funktionen.
zh: Ім'я функції.

source: The line number in the file where the definition starts.
ru: Номер строки в файле, с которой начинается определение.
sv: Radnumret i filen där definitionen börjar.
zh: Номер рядка у файлі, з якого починається визначення.

source: For top-level functions, ``None``. For nested functions, the parent.
ru: Для функций верхнего уровня — None. Для вложенных функций родительский.
sv: För funktioner på högsta nivån, ``None``. För nästlade funktioner, den överordnade.
zh: Для функций верхнего уровня — None. Для вложенных функций родительский.

source: A :class:`dictionary <dict>` mapping names to descriptors for nested functions and classes.
ru: :class:`dictionary <dict>` сопоставляет имена с дескрипторами вложенных функций и классов.
sv: En :class:`dictionary <dict>` som mappar namn till deskriptorer för nästlade funktioner och klasser.
zh: :class:`dictionary <dict>` сопоставляет имена с дескрипторами вложенных функций и классов.

source: ``True`` for functions that are defined with the :keyword:`async <async def>` prefix, ``False`` otherwise.
ru: ``True`` для функций, которые определены с префиксом :keyword:`async <async def>`, ``False`` в противном случае.
sv: ``True`` för funktioner som definieras med prefixet :keyword:`async <async def>`, annars ``False``.
zh: ``True`` для функций, которые определены с префиксом :keyword:`async <async def>`, ``False`` в противном случае.

source: Class Objects
ru: Классы
sv: Klassobjekt
zh: Obiekty klas

source: Class :class:`!Class` instances describe classes defined by class statements. They have the same attributes as :class:`Functions <Function>` and two more.
ru: Экземпляры класса :class:`!Class` описывают классы, определенные операторами класса. Они имеют те же атрибуты, что и :class:`Functions <Function>` и еще два.
sv: Class :class:`!Class`\-instanser beskriver klasser som definieras av class-satser. De har samma egenskaper som :class:`Functions <Function>` och två till.
zh: Экземпляры класса :class:`!Class` описывают классы, определенные операторами класса. Они имеют те же атрибуты, что и :class:`Functions <Function>` и еще два.

source: Name of the file in which the class is defined.
ru: Имя файла, в котором определен класс.
sv: Namn på den fil där klassen definieras.
zh: Ім'я файлу, в якому визначено клас.

source: The name of the module defining the class described.
ru: Имя модуля, определяющего описываемый класс.
sv: Namnet på den modul som definierar den klass som beskrivs.
zh: Назва модуля, що визначає описуваний клас.

source: The name of the class.
ru: Имя класса.
sv: Namnet på klassen.
zh: Назва класу.

source: For top-level classes, ``None``. For nested classes, the parent.
sv: För klasser på högsta nivån, ``None``. För nästlade klasser, den överordnade.

source: A dictionary mapping names to descriptors for nested functions and classes.
ru: Словарь, сопоставляющий имена с дескрипторами вложенных функций и классов.
sv: En ordbok som mappar namn till deskriptorer för nästlade funktioner och klasser.
zh: Словник, що зіставляє імена з дескрипторами для вкладених функцій і класів.

source: A list of :class:`!Class` objects which describe the immediate base classes of the class being described. Classes which are named as superclasses but which are not discoverable by :func:`readmodule_ex` are listed as a string with the class name instead of as :class:`!Class` objects.
ru: Список объектов :class:`!Class`, которые описывают непосредственные базовые классы описываемого класса. Классы, которые называются суперклассами, но не могут быть обнаружены с помощью :func:`readmodule_ex`, перечислены в виде строки с именем класса, а не как объекты :class:`!Class`.
sv: En lista med :class:`!Class`\-objekt som beskriver de omedelbara basklasserna för den klass som beskrivs. Klasser som namnges som superklasser men som inte kan hittas med :func:`readmodule_ex` listas som en sträng med klassnamnet istället för som :class:`!Class`\-objekt.
zh: Список объектов :class:`!Class`, которые описывают непосредственные базовые классы описываемого класса. Классы, которые называются суперклассами, но не могут быть обнаружены с помощью :func:`readmodule_ex`, перечислены в виде строки с именем класса, а не как объекты :class:`!Class`.

source: A :class:`dictionary <dict>` mapping method names to line numbers. This can be derived from the newer :attr:`children` dictionary, but remains for back-compatibility.
ru: :class:`dictionary <dict>` отображает имена методов на номера строк. Его можно получить из более нового словаря :attr:`children`, но он остается для обратной совместимости.
sv: En :class:`dictionary <dict>` som mappar metodnamn till radnummer. Detta kan härledas från den nyare :attr:`children`\-ordlistan, men finns kvar för bakåtkompatibilitet.
zh: :class:`dictionary <dict>` отображает имена методов на номера строк. Его можно получить из более нового словаря :attr:`children`, но он остается для обратной совместимости.
