Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pyexpat.po
Languages: pt_pt, ru

source: Setting this to true causes the :class:`xmlparser` object to buffer textual content returned by Expat to avoid multiple calls to the :meth:`CharacterDataHandler` callback whenever possible. This can improve performance substantially since Expat normally breaks character data into chunks at every line ending. This attribute is false by default, and may be changed at any time. Note that when it is false, data that does not contain newlines may be chunked too.
ru: Установка этого значения в true приводит к тому, что объект :class:`xmlparser` буферизует текстовое содержимое, возвращаемое Expat, чтобы избежать множественных вызовов обратного вызова :meth:`CharacterDataHandler`, когда это возможно. Это может существенно повысить производительность, поскольку Expat обычно разбивает символьные данные на фрагменты в конце каждой строки. По умолчанию этот атрибут имеет значение false и может быть изменен в любое время. Обратите внимание: если это значение ложно, данные, не содержащие символов новой строки, также могут быть разбиты на фрагменты.

source: Called for character data. This will be called for normal character data, CDATA marked content, and ignorable whitespace. Applications which must distinguish these cases can use the :attr:`StartCdataSectionHandler`, :attr:`EndCdataSectionHandler`, and :attr:`ElementDeclHandler` callbacks to collect the required information. Note that the character data may be chunked even if it is short and so you may receive more than one call to :meth:`CharacterDataHandler`. Set the :attr:`buffer_text` instance attribute to ``True`` to avoid that.
ru: Вызывается для получения символьных данных. Это будет вызываться для обычных символьных данных, содержимого с пометкой CDATA и игнорируемых пробелов. Приложения, которые должны различать эти случаи, могут использовать обратные вызовы :attr:`StartCdataSectionHandler`, :attr:`EndCdataSectionHandler` и :attr:`ElementDeclHandler` для сбора необходимой информации. Обратите внимание, что символьные данные могут быть разбиты на части, даже если они короткие, поэтому вы можете получить более одного вызова :meth:`CharacterDataHandler`. Чтобы избежать этого, установите для атрибута экземпляра :attr:`buffer_text` значение ``True``.

source: An attempt was made to undeclare reserved namespace prefix ``xml`` or to bind it to another namespace URI.
ru: Была предпринята попытка отменить объявление зарезервированного префикса пространства имен ``xml`` или привязать его к другому URI пространства имен.

source: An attempt was made to declare or undeclare reserved namespace prefix ``xmlns``.
ru: Была предпринята попытка объявить или отменить объявление префикса зарезервированного пространства имен ``xmlns``.

source: An attempt was made to bind the URI of one the reserved namespace prefixes ``xml`` and ``xmlns`` to another namespace prefix.
ru: Была предпринята попытка связать URI одного из зарезервированных префиксов пространства имен ``xml`` и ``xmlns`` с другим префиксом пространства имен.

source: The limit on input amplification factor (from DTD and entities) has been breached.
ru: Превышен лимит входного коэффициента усиления (от DTD и объектов).

source: module
ru: модуль
