Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pyexpat.po
Languages: pt_pt, ru

source: The :mod:`xml.parsers.expat` module is a Python interface to the Expat non-validating XML parser. The module provides a single extension type, :class:`xmlparser`, that represents the current state of an XML parser. After an :class:`xmlparser` object has been created, various attributes of the object can be set to handler functions. When an XML document is then fed to the parser, the handler functions are called for the character data and markup in the XML document.
pt_pt: O módulo :mod:`xml.parsers.expat` é uma interface Python para o analisador XML não validante Expat. O módulo fornece um único tipo de extensão, :class:`xmlparser`, que representa o estado atual de um analisador XML. Depois de um objeto :class:`xmlparser` ser criado, vários atributos do objeto podem ser definidos para funções de tratamento. Quando um documento XML é fornecido ao analisador, as funções de tratamento são chamadas para os dados de caracteres e marcação no documento XML.
ru: Модуль :mod:`xml.parsers.expat` представляет собой интерфейс Python для непроверяющего XML-парсера Expat. Модуль предоставляет один тип расширения :class:`xmlparser`, который представляет текущее состояние синтаксического анализатора XML. После создания объекта :class:`xmlparser` различные атрибуты объекта могут быть установлены для функций-обработчиков. Когда XML-документ затем передается в анализатор, функции-обработчики вызываются для символьных данных и разметки в XML-документе.

source: This module uses the :mod:`pyexpat` module to provide access to the Expat parser. Direct use of the :mod:`pyexpat` module is deprecated.
pt_pt: Este módulo usa o módulo :mod:`pyexpat` para fornecer acesso ao analisador Expat. A utilização direta do módulo :mod:`pyexpat` está obsoleta.
ru: Этот модуль использует модуль :mod:`pyexpat` для предоставления доступа к парсеру Expat. Прямое использование модуля :mod:`pyexpat` устарело.

source: This module provides one exception and one type object:
pt_pt: Este módulo fornece uma exceção e um objeto de tipo:
ru: Этот модуль предоставляет одно исключение и один объект типа:

source: The exception raised when Expat reports an error. See section :ref:`expaterror-objects` for more information on interpreting Expat errors.
pt_pt: A exceção levantada quando o Expat reporta um erro. Consulte a secção :ref:`expaterror-objects` para obter mais informações sobre a interpretação de erros do Expat.
ru: Исключение возникает, когда Expat сообщает об ошибке. См. раздел :ref:`expaterror-objects` для получения дополнительной информации об интерпретации ошибок Expat.

source: Alias for :exc:`ExpatError`.
pt_pt: Alias para :exc:`ExpatError`.
ru: Псевдоним для :exc:`ExpatError`.

source: The type of the return values from the :func:`ParserCreate` function.
pt_pt: O tipo dos valores de retorno da função :func:`ParserCreate`.
ru: Тип возвращаемых значений функции :func:`ParserCreate`.

source: The :mod:`xml.parsers.expat` module contains two functions:
pt_pt: O módulo :mod:`xml.parsers.expat` contém duas funções:
ru: Модуль :mod:`xml.parsers.expat` содержит две функции:

source: Returns an explanatory string for a given error number *errno*.
pt_pt: Devolve uma *string* explicativa para um número de erro *errno* fornecido.
ru: Возвращает пояснительную строку для заданного номера ошибки *errno*.

source: Creates and returns a new :class:`xmlparser` object. *encoding*, if specified, must be a string naming the encoding used by the XML data. Expat doesn't support as many encodings as Python does, and its repertoire of encodings can't be extended; it supports UTF-8, UTF-16, ISO-8859-1 (Latin1), and ASCII. If *encoding* [1]_ is given it will override the implicit or explicit encoding of the document.
pt_pt: Cria e devolve um novo objeto :class:`xmlparser`. Se *encoding* for especificado, deve ser uma *string* que nomeia a codificação usada pelos dados XML. O Expat não suporta tantas codificações quanto o Python e o seu repertório de codificações não pode ser estendido; suporta UTF-8, UTF-16, ISO-8859-1 (Latin1) e ASCII. Se *encoding* [1]_ for fornecido, substituirá a codificação implícita ou explícita do documento.
ru: Создает и возвращает новый объект :class:`xmlparser`. *кодировка*, если она указана, должна быть строкой, обозначающей кодировку, используемую данными XML. Expat не поддерживает столько кодировок, сколько Python, и его набор кодировок не может быть расширен; он поддерживает UTF-8, UTF-16, ISO-8859-1 (Latin1) и ASCII. Если *кодировка* [1]_ задан, он переопределит неявное или явное кодирование документа.

source: Parsers created through :func:`!ParserCreate` are called "root" parsers, in the sense that they do not have any parent parser attached. Non-root parsers are created by :meth:`parser.ExternalEntityParserCreate <xmlparser.ExternalEntityParserCreate>`.
pt_pt: Os analisadores criados através de :func:`!ParserCreate` são chamados de "raiz", no sentido de não terem nenhum analisador pai anexado. Os analisadores não-raiz são criados por :meth:`parser.ExternalEntityParserCreate <xmlparser.ExternalEntityParserCreate>`.

source: Expat can optionally do XML namespace processing for you, enabled by providing a value for *namespace_separator*. The value must be a one-character string; a :exc:`ValueError` will be raised if the string has an illegal length (``None`` is considered the same as omission). When namespace processing is enabled, element type names and attribute names that belong to a namespace will be expanded. The element name passed to the element handlers :attr:`StartElementHandler` and :attr:`EndElementHandler` will be the concatenation of the namespace URI, the namespace separator character, and the local part of the name. If the namespace separator is a zero byte (``chr(0)``) then the namespace URI and the local part will be concatenated without any separator.
pt_pt: O Expat pode, opcionalmente, processar espaços de nome XML para si, ativado ao fornecer um valor para *namespace_separator*. O valor deve ser uma *string* de um carácter; uma exceção :exc:`ValueError` será levantada se a *string* tiver um comprimento inválido (``None`` é considerado o mesmo que omissão). Quando o processamento de espaço de nome está ativado, os nomes de tipos de elementos e nomes de atributos que pertencem a um espaço de nome serão expandidos. O nome do elemento passado para os manipuladores de elementos :attr:`StartElementHandler` e :attr:`EndElementHandler` será a concatenação do URI do espaço de nome, o carácter separador do espaço de nome e a parte local do nome. Se o separador do espaço de nome for um byte zero (``chr(0)``), então o URI do espaço de nome e a parte local serão concatenados sem qualquer separador.
ru: Expat может дополнительно выполнить за вас обработку пространства имен XML, что включается путем предоставления значения *namespace_separator*. Значение должно быть строкой из одного символа; :exc:`ValueError` будет вызван, если строка имеет недопустимую длину (``None`` считается пропуском). Если обработка пространства имен включена, имена типов элементов и имена атрибутов, принадлежащие пространству имен, будут расширены. Имя элемента, передаваемое обработчикам элементов :attr:`StartElementHandler` и :attr:`EndElementHandler`, будет представлять собой объединение URI пространства имен, символа-разделителя пространства имен и локальной части имени. Если разделителем пространства имен является нулевой байт («chr(0)»), то URI пространства имен и локальная часть будут объединены без какого-либо разделителя.

source: For example, if *namespace_separator* is set to a space character (``' '``) and the following document is parsed:
pt_pt: Por exemplo, se *namespace_separator* for definido como um carácter de espaço (``' '``) e o seguinte documento for analisado:
ru: Например, если для *namespace_separator* установлен пробел (``' '``) и анализируется следующий документ:

source: :attr:`StartElementHandler` will receive the following strings for each element::
pt_pt: :attr:`StartElementHandler` receberá as seguintes *strings* para cada elemento:
ru: :attr:`StartElementHandler` получит следующие строки для каждого элемента::

source: Due to limitations in the ``Expat`` library used by :mod:`pyexpat`, the :class:`xmlparser` instance returned can only be used to parse a single XML document. Call ``ParserCreate`` for each document to provide unique parser instances.
pt_pt: Devido a limitações na biblioteca ``Expat`` usada por :mod:`pyexpat`, a instância :class:`xmlparser` devolvida só pode ser usada para analisar um único documento XML. Chame ``ParserCreate`` para cada documento para fornecer instâncias únicas do analisador.
ru: Из-за ограничений библиотеки Expat, используемой :mod:`pyexpat`, возвращаемый экземпляр :class:`xmlparser` может использоваться только для анализа одного XML-документа. Вызовите ParserCreate для каждого документа, чтобы предоставить уникальные экземпляры синтаксического анализатора.

source: `The Expat XML Parser <http://www.libexpat.org/>`_
pt_pt: O analisador XML Expat <http://www.libexpat.org/>`_
ru: `Парсер Expat XML <http://www.libexpat.org/>`_

source: Home page of the Expat project.
pt_pt: Página inicial do projeto Expat.
ru: Домашняя страница проекта Expat.

source: XMLParser Objects
pt_pt: Objetos XMLParser
ru: Объекты XMLParser

source: :class:`xmlparser` objects have the following methods:
pt_pt: Os objetos :class:`xmlparser` têm os seguintes métodos:
ru: Объекты :class:`xmlparser` имеют следующие методы:

source: Parses the contents of the string *data*, calling the appropriate handler functions to process the parsed data. *isfinal* must be true on the final call to this method; it allows the parsing of a single file in fragments, not the submission of multiple files. *data* can be the empty string at any time.
pt_pt: Analisa o conteúdo da *string* *data*, chamando as funções de tratamento apropriadas para processar os dados analisados. *isfinal* deve ser verdadeiro na chamada final a este método; permite a análise de um único ficheiro em fragmentos, não a submissão de vários ficheiros. *data* pode ser uma *string* vazia em qualquer altura.
ru: Анализирует содержимое строки *data*, вызывая соответствующие функции-обработчики для обработки анализируемых данных. *isfinal* должно иметь значение true при последнем вызове этого метода; он позволяет анализировать один файл по фрагментам, а не отправлять несколько файлов. *data* может быть пустой строкой в ​​любое время.

source: Parse XML data reading from the object *file*. *file* only needs to provide the ``read(nbytes)`` method, returning the empty string when there's no more data.
pt_pt: Analisa dados XML lendo do objeto *file*. *file* só precisa de fornecer o método ``read(nbytes)``, devolvendo uma *string* vazia quando não houver mais dados.
ru: Разобрать чтение XML-данных из объекта *файл*. *file* необходимо предоставить только метод ``read(nbytes)``, возвращающий пустую строку, когда данных больше нет.

source: Sets the base to be used for resolving relative URIs in system identifiers in declarations. Resolving relative identifiers is left to the application: this value will be passed through as the *base* argument to the :func:`ExternalEntityRefHandler`, :func:`NotationDeclHandler`, and :func:`UnparsedEntityDeclHandler` functions.
pt_pt: Define a base a ser usada para resolver URIs relativos em identificadores de sistema em declarações. A resolução de identificadores relativos é deixada à aplicação: este valor será passado como argumento *base* para as funções :func:`ExternalEntityRefHandler`, :func:`NotationDeclHandler` e :func:`UnparsedEntityDeclHandler`.
ru: Устанавливает базу, которая будет использоваться для разрешения относительных URI в системных идентификаторах в объявлениях. Разрешение относительных идентификаторов остается на усмотрение приложения: это значение будет передано в качестве аргумента *base* в функции :func:`ExternalEntityRefHandler`, :func:`NotationDeclHandler` и :func:`UnparsedEntityDeclHandler`.

source: Returns a string containing the base set by a previous call to :meth:`SetBase`, or ``None`` if :meth:`SetBase` hasn't been called.
pt_pt: Devolve uma *string* contendo a base definida por uma chamada anterior a :meth:`SetBase`, ou ``None`` se :meth:`SetBase` não tiver sido chamado.
ru: Возвращает строку, содержащую базовый набор, полученный в результате предыдущего вызова :meth:`SetBase`, или ``None``, если :meth:`SetBase` не вызывался.

source: Returns the input data that generated the current event as a string. The data is in the encoding of the entity which contains the text. When called while an event handler is not active, the return value is ``None``.
pt_pt: Devolve os dados de entrada que geraram o evento atual como uma *string*. Os dados estão na codificação da entidade que contém o texto. Quando chamado enquanto um manipulador de eventos não está ativo, o valor de retorno é ``None``.
ru: Возвращает входные данные, которые сгенерировали текущее событие, в виде строки. Данные находятся в кодировке объекта, содержащего текст. При вызове, когда обработчик событий не активен, возвращаемое значение — None.

source: Create a "child" parser which can be used to parse an external parsed entity referred to by content parsed by the parent parser. The *context* parameter should be the string passed to the :meth:`ExternalEntityRefHandler` handler function, described below. The child parser is created with the :attr:`ordered_attributes` and :attr:`specified_attributes` set to the values of this parser.
pt_pt: Cria um analisador "filho" que pode ser usado para analisar uma entidade externa analisada referenciada pelo conteúdo analisado pelo analisador pai. O parâmetro *context* deve ser a *string* passada para a função manipuladora :meth:`ExternalEntityRefHandler`, descrita abaixo. O analisador filho é criado com :attr:`ordered_attributes` e :attr:`specified_attributes` definidos para os valores deste analisador.
ru: Создайте «дочерний» анализатор, который можно использовать для анализа внешнего анализируемого объекта, на который ссылается контент, анализируемый родительским анализатором. Параметр *context* должен быть строкой, передаваемой в функцию-обработчик :meth:`ExternalEntityRefHandler`, описанную ниже. Дочерний парсер создается со значениями :attr:`ordered_attributes` и :attr:`specified_attributes`, установленными в значения этого парсера.

source: Control parsing of parameter entities (including the external DTD subset). Possible *flag* values are :const:`XML_PARAM_ENTITY_PARSING_NEVER`, :const:`XML_PARAM_ENTITY_PARSING_UNLESS_STANDALONE` and :const:`XML_PARAM_ENTITY_PARSING_ALWAYS`. Return true if setting the flag was successful.
pt_pt: Controla a análise de entidades de parâmetro (incluindo o subconjunto DTD externo). Os valores possíveis para *flag* são :const:`XML_PARAM_ENTITY_PARSING_NEVER`, :const:`XML_PARAM_ENTITY_PARSING_UNLESS_STANDALONE` e :const:`XML_PARAM_ENTITY_PARSING_ALWAYS`. Devolve verdadeiro se a definição da flag foi bem-sucedida.
ru: Управляйте анализом объектов параметров (включая подмножество внешнего DTD). Возможные значения *flag*: :const:`XML_PARAM_ENTITY_PARSING_NEVER`, :const:`XML_PARAM_ENTITY_PARSING_UNLESS_STANDALONE` и :const:`XML_PARAM_ENTITY_PARSING_ALWAYS`. Верните true, если установка флага прошла успешно.

source: Calling this with a true value for *flag* (the default) will cause Expat to call the :attr:`ExternalEntityRefHandler` with :const:`None` for all arguments to allow an alternate DTD to be loaded. If the document does not contain a document type declaration, the :attr:`ExternalEntityRefHandler` will still be called, but the :attr:`StartDoctypeDeclHandler` and :attr:`EndDoctypeDeclHandler` will not be called.
pt_pt: Chamar isto com um valor verdadeiro para *flag* (o predefinido) fará com que o Expat chame o :attr:`ExternalEntityRefHandler` com :const:`None` para todos os argumentos para permitir que um DTD alternativo seja carregado. Se o documento não contiver uma declaração de tipo de documento, o :attr:`ExternalEntityRefHandler` ainda será chamado, mas o :attr:`StartDoctypeDeclHandler` e :attr:`EndDoctypeDeclHandler` não serão chamados.
ru: Вызов этого с истинным значением *flag* (по умолчанию) приведет к тому, что Expat вызовет :attr:`ExternalEntityRefHandler` с :const:`None` для всех аргументов, чтобы разрешить загрузку альтернативного DTD. Если документ не содержит объявления типа документа, :attr:`ExternalEntityRefHandler` все равно будет вызываться, но :attr:`StartDoctypeDeclHandler` и :attr:`EndDoctypeDeclHandler` не будут вызываться.

source: Passing a false value for *flag* will cancel a previous call that passed a true value, but otherwise has no effect.
pt_pt: Passar um valor falso para *flag* cancelará uma chamada anterior que passou um valor verdadeiro, mas não terá outro efeito.
ru: Передача ложного значения для *flag* отменит предыдущий вызов, передавший истинное значение, но в остальном не имеет никакого эффекта.

source: This method can only be called before the :meth:`Parse` or :meth:`ParseFile` methods are called; calling it after either of those have been called causes :exc:`ExpatError` to be raised with the :attr:`code` attribute set to ``errors.codes[errors.XML_ERROR_CANT_CHANGE_FEATURE_ONCE_PARSING]``.
pt_pt: Este método só pode ser chamado antes dos métodos :meth:`Parse` ou :meth:`ParseFile` serem chamados; chamá-lo depois de qualquer um deles ter sido chamado faz com que :exc:`ExpatError` seja levantado com o atributo :attr:`code` definido para ``errors.codes[errors.XML_ERROR_CANT_CHANGE_FEATURE_ONCE_PARSING]``.
ru: Этот метод можно вызвать только до вызова методов :meth:`Parse` или :meth:`ParseFile`; вызов его после вызова любого из них приводит к возникновению :exc:`ExpatError` с атрибутом :attr:`code`, установленным в ``errors.codes[errors.XML_ERROR_CANT_CHANGE_FEATURE_ONCE_PARSING]``.

source: Calling ``SetReparseDeferralEnabled(False)`` has security implications, as detailed below; please make sure to understand these consequences prior to using the ``SetReparseDeferralEnabled`` method.
pt_pt: Chamar ``SetReparseDeferralEnabled(False)`` tem implicações de segurança, como detalhado abaixo; certifique-se de que compreende estas consequências antes de usar o método ``SetReparseDeferralEnabled``.
ru: Вызов SetReparseDeferralEnabled(False) имеет последствия для безопасности, как подробно описано ниже; пожалуйста, убедитесь, что вы понимаете эти последствия, прежде чем использовать метод SetReparseDeferralEnabled.

source: Note that :meth:`SetReparseDeferralEnabled` has been backported to some prior releases of CPython as a security fix. Check for availability of :meth:`SetReparseDeferralEnabled` using :func:`hasattr` if used in code running across a variety of Python versions.
pt_pt: Note que :meth:`SetReparseDeferralEnabled` foi retroportado para algumas versões anteriores do CPython como uma correção de segurança. Verifique a disponibilidade de :meth:`SetReparseDeferralEnabled` usando :func:`hasattr` se usado em código que é executado em várias versões do Python.
ru: Обратите внимание, что :meth:`SetReparseDeferralEnabled` был перенесен в некоторые предыдущие выпуски CPython в качестве исправления безопасности. Проверьте доступность :meth:`SetReparseDeferralEnabled` с помощью :func:`hasattr`, если он используется в коде, работающем в различных версиях Python.

source: Returns whether reparse deferral is currently enabled for the given Expat parser instance.
pt_pt: Devolve se o adiamento de reanálise está atualmente ativado para a instância do analisador Expat fornecida.
ru: Возвращает, включена ли в данный момент отсрочка повторной обработки для данного экземпляра парсера Expat.

source: :class:`!xmlparser` objects have the following methods to mitigate some common XML vulnerabilities.
pt_pt: Os objetos :class:`!xmlparser` têm os seguintes métodos para mitigar algumas vulnerabilidades comuns de XML.

source: Sets the number of allocated bytes of dynamic memory needed to activate protection against disproportionate use of RAM.
pt_pt: Define o número de bytes alocados de memória dinâmica necessários para ativar a proteção contra o uso desproporcionado de RAM.

source: By default, parser objects have an allocation activation threshold of 64 MiB, or equivalently 67,108,864 bytes.
pt_pt: Por predefinição, os objetos analisadores têm um limite de ativação de alocação de 64 MiB, ou equivalentemente 67.108.864 bytes.

source: An :exc:`ExpatError` is raised if this method is called on a |xml-non-root-parser| parser. The corresponding :attr:`~ExpatError.lineno` and :attr:`~ExpatError.offset` should not be used as they may have no special meaning.
pt_pt: Uma exceção :exc:`ExpatError` é levantada se este método for chamado num analisador |xml-non-root-parser|. Os atributos correspondentes :attr:`~ExpatError.lineno` e :attr:`~ExpatError.offset` não devem ser usados, pois podem não ter significado especial.

source: Sets the maximum amplification factor between direct input and bytes of dynamic memory allocated.
pt_pt: Define o fator de amplificação máximo entre a entrada direta e os bytes de memória dinâmica alocados.

source: The amplification factor is calculated as ``allocated / direct`` while parsing, where ``direct`` is the number of bytes read from the primary document in parsing and ``allocated`` is the number of bytes of dynamic memory allocated in the parser hierarchy.
pt_pt: O fator de amplificação é calculado como ``allocated / direct`` durante a análise, onde ``direct`` é o número de bytes lidos do documento principal na análise e ``allocated`` é o número de bytes de memória dinâmica alocados na hierarquia do analisador.

source: The *max_factor* value must be a non-NaN :class:`float` value greater than or equal to 1.0. Amplification factors greater than 100.0 can be observed near the start of parsing even with benign files in practice. In particular, the activation threshold should be carefully chosen to avoid false positives.
pt_pt: O valor *max_factor* deve ser um valor :class:`float` não-NaN maior ou igual a 1.0. Fatores de amplificação superiores a 100.0 podem ser observados perto do início da análise, mesmo com ficheiros benignos na prática. Em particular, o limite de ativação deve ser escolhido cuidadosamente para evitar falsos positivos.

source: By default, parser objects have a maximum amplification factor of 100.0.
pt_pt: Por predefinição, os objetos analisadores têm um fator de amplificação máximo de 100.0.

source: An :exc:`ExpatError` is raised if this method is called on a |xml-non-root-parser| parser or if *max_factor* is outside the valid range. The corresponding :attr:`~ExpatError.lineno` and :attr:`~ExpatError.offset` should not be used as they may have no special meaning.
pt_pt: Uma exceção :exc:`ExpatError` é levantada se este método for chamado num analisador |xml-non-root-parser| ou se *max_factor* estiver fora do intervalo válido. Os atributos correspondentes :attr:`~ExpatError.lineno` e :attr:`~ExpatError.offset` não devem ser usados, pois podem não ter significado especial.

source: The maximum amplification factor is only considered if the threshold that can be adjusted by :meth:`.SetAllocTrackerActivationThreshold` is exceeded.
pt_pt: O fator de amplificação máximo só é considerado se o limite que pode ser ajustado por :meth:`.SetAllocTrackerActivationThreshold` for excedido.

source: :class:`xmlparser` objects have the following attributes:
pt_pt: Os objetos :class:`xmlparser` têm os seguintes atributos:
ru: Объекты :class:`xmlparser` имеют следующие атрибуты:
