Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pyexpat.po
Languages: pt_pt, ru

source: The size of the buffer used when :attr:`buffer_text` is true. A new buffer size can be set by assigning a new integer value to this attribute. When the size is changed, the buffer will be flushed.
pt_pt: O tamanho do buffer usado quando :attr:`buffer_text` é verdadeiro. Um novo tamanho de buffer pode ser definido atribuindo um novo valor inteiro a este atributo. Quando o tamanho é alterado, o buffer será limpo.
ru: Размер буфера, используемого, когда :attr:`buffer_text` имеет значение true. Новый размер буфера можно установить, присвоив этому атрибуту новое целочисленное значение. При изменении размера буфер будет очищен.

source: If :attr:`buffer_text` is enabled, the number of bytes stored in the buffer. These bytes represent UTF-8 encoded text. This attribute has no meaningful interpretation when :attr:`buffer_text` is false.
pt_pt: Se :attr:`buffer_text` estiver ativado, o número de bytes armazenados no buffer. Estes bytes representam texto codificado em UTF-8. Este atributo não tem uma interpretação significativa quando :attr:`buffer_text` é falso.
ru: Если :attr:`buffer_text` включен, количество байтов, хранящихся в буфере. Эти байты представляют текст в кодировке UTF-8. Этот атрибут не имеет значимой интерпретации, если :attr:`buffer_text` имеет значение false.

source: Setting this attribute to a non-zero integer causes the attributes to be reported as a list rather than a dictionary. The attributes are presented in the order found in the document text. For each attribute, two list entries are presented: the attribute name and the attribute value. (Older versions of this module also used this format.) By default, this attribute is false; it may be changed at any time.
pt_pt: Definir este atributo para um inteiro não-zero faz com que os atributos sejam relatados como uma lista em vez de um dicionário. Os atributos são apresentados na ordem encontrada no texto do documento. Para cada atributo, são apresentadas duas entradas na lista: o nome do atributo e o valor do atributo. (Versões mais antigas deste módulo também usavam este formato.) Por predefinição, este atributo é falso; pode ser alterado a qualquer momento.
ru: Установка для этого атрибута целого числа, отличного от нуля, приводит к тому, что атрибуты отображаются в виде списка, а не словаря. Атрибуты представлены в порядке, указанном в тексте документа. Для каждого атрибута представлены две записи списка: имя атрибута и значение атрибута. (Более старые версии этого модуля также использовали этот формат.) По умолчанию этот атрибут имеет значение false; его можно изменить в любое время.

source: If set to a non-zero integer, the parser will report only those attributes which were specified in the document instance and not those which were derived from attribute declarations. Applications which set this need to be especially careful to use what additional information is available from the declarations as needed to comply with the standards for the behavior of XML processors. By default, this attribute is false; it may be changed at any time.
pt_pt: Se definido para um inteiro não-zero, o analisador relatará apenas os atributos que foram especificados na instância do documento e não aqueles que foram derivados de declarações de atributos. As aplicações que definem isto precisam de ser especialmente cuidadosas para usar a informação adicional disponível a partir das declarações, conforme necessário, para cumprir os padrões para o comportamento dos processadores XML. Por predefinição, este atributo é falso; pode ser alterado a qualquer momento.
ru: Если установлено ненулевое целое число, синтаксический анализатор будет сообщать только о тех атрибутах, которые были указаны в экземпляре документа, а не о тех, которые были получены из объявлений атрибутов. Приложения, которые устанавливают это, должны быть особенно осторожны, чтобы использовать дополнительную информацию, доступную из объявлений, необходимую для соответствия стандартам поведения процессоров XML. По умолчанию этот атрибут имеет значение false; его можно изменить в любое время.

source: The following attributes contain values relating to the most recent error encountered by an :class:`xmlparser` object, and will only have correct values once a call to :meth:`Parse` or :meth:`ParseFile` has raised an :exc:`xml.parsers.expat.ExpatError` exception.
pt_pt: Os seguintes atributos contêm valores relacionados com o erro mais recente encontrado por um objeto :class:`xmlparser` e só terão valores corretos depois de uma chamada a :meth:`Parse` ou :meth:`ParseFile` ter levantado uma exceção :exc:`xml.parsers.expat.ExpatError`.
ru: Следующие атрибуты содержат значения, относящиеся к самой последней ошибке, обнаруженной объектом :class:`xmlparser`, и будут иметь правильные значения только после того, как вызов :meth:`Parse` или :meth:`ParseFile` вызовет :exc Исключение :`xml.parsers.expat.ExpatError`.

source: Byte index at which an error occurred.
pt_pt: Índice de byte no qual ocorreu um erro.
ru: Индекс байта, в котором произошла ошибка.

source: Numeric code specifying the problem. This value can be passed to the :func:`ErrorString` function, or compared to one of the constants defined in the ``errors`` object.
pt_pt: Código numérico que especifica o problema. Este valor pode ser passado para a função :func:`ErrorString` ou comparado com uma das constantes definidas no objeto ``errors``.
ru: Числовой код, указывающий проблему. Это значение можно передать в функцию :func:`ErrorString` или сравнить с одной из констант, определенных в объекте ``errors``.

source: Column number at which an error occurred.
pt_pt: Número da coluna na qual ocorreu um erro.
ru: Номер столбца, в котором произошла ошибка.

source: Line number at which an error occurred.
pt_pt: Número da linha na qual ocorreu um erro.
ru: Номер строки, в которой произошла ошибка.

source: The following attributes contain values relating to the current parse location in an :class:`xmlparser` object. During a callback reporting a parse event they indicate the location of the first of the sequence of characters that generated the event. When called outside of a callback, the position indicated will be just past the last parse event (regardless of whether there was an associated callback).
pt_pt: Os seguintes atributos contêm valores relacionados com a localização atual da análise num objeto :class:`xmlparser`. Durante um *callback* que reporta um evento de análise, indicam a localização do primeiro da sequência de caracteres que gerou o evento. Quando chamado fora de um *callback*, a posição indicada será logo após o último evento de análise (independentemente de ter havido um *callback* associado).
ru: Следующие атрибуты содержат значения, относящиеся к текущему местоположению синтаксического анализа в объекте :class:`xmlparser`. Во время обратного вызова, сообщающего о событии синтаксического анализа, они указывают местоположение первого из последовательности символов, сгенерировавшей событие. При вызове вне обратного вызова указанная позиция будет сразу после последнего события синтаксического анализа (независимо от того, был ли связанный обратный вызов).

source: Current byte index in the parser input.
pt_pt: Índice de byte atual na entrada do analisador.
ru: Текущий индекс байта во входных данных анализатора.

source: Current column number in the parser input.
pt_pt: Número da coluna atual na entrada do analisador.
ru: Текущий номер столбца во входных данных анализатора.

source: Current line number in the parser input.
pt_pt: Número da linha atual na entrada do analisador.
ru: Текущий номер строки во входных данных парсера.

source: Here is the list of handlers that can be set. To set a handler on an :class:`xmlparser` object *o*, use ``o.handlername = func``. *handlername* must be taken from the following list, and *func* must be a callable object accepting the correct number of arguments. The arguments are all strings, unless otherwise stated.
pt_pt: Aqui está a lista de manipuladores que podem ser definidos. Para definir um manipulador num objeto :class:`xmlparser` *o*, use ``o.handlername = func``. *handlername* deve ser selecionado da lista seguinte, e *func* deve ser um objeto chamável que aceite o número correto de argumentos. Os argumentos são todos *strings*, a menos que seja indicado o contrário.
ru: Вот список обработчиков, которые можно установить. Чтобы установить обработчик для объекта :class:`xmlparser` *o*, используйте ``o.handlername = func``. *handlername* должно быть взято из следующего списка, а *func* должен быть вызываемым объектом, принимающим правильное количество аргументов. Все аргументы являются строками, если не указано иное.

source: Called when the XML declaration is parsed. The XML declaration is the (optional) declaration of the applicable version of the XML recommendation, the encoding of the document text, and an optional "standalone" declaration. *version* and *encoding* will be strings, and *standalone* will be ``1`` if the document is declared standalone, ``0`` if it is declared not to be standalone, or ``-1`` if the standalone clause was omitted. This is only available with Expat version 1.95.0 or newer.
pt_pt: Chamado quando a declaração XML é analisada. A declaração XML é a declaração (opcional) da versão aplicável da recomendação XML, a codificação do texto do documento e uma declaração opcional "standalone". *version* e *encoding* serão *strings*, e *standalone* será ``1`` se o documento for declarado como standalone, ``0`` se for declarado como não standalone, ou ``-1`` se a cláusula standalone for omitida. Isto só está disponível com a versão 1.95.0 ou mais recente do Expat.
ru: Вызывается при анализе объявления XML. Декларация XML — это (необязательное) объявление применимой версии рекомендации XML, кодировки текста документа и необязательное «автономное» объявление. *version* и *encoding* будут строками, а *standalone* будет иметь значение ``1``, если документ объявлен как автономный, ``0``, если он объявлен как неавтономный, или ``-1`` если отдельное предложение было опущено. Это доступно только в Expat версии 1.95.0 или новее.

source: Called when Expat begins parsing the document type declaration (``<!DOCTYPE ...``). The *doctypeName* is provided exactly as presented. The *systemId* and *publicId* parameters give the system and public identifiers if specified, or ``None`` if omitted. *has_internal_subset* will be true if the document contains and internal document declaration subset. This requires Expat version 1.2 or newer.
pt_pt: Chamado quando o Expat começa a analisar a declaração de tipo de documento (``<!DOCTYPE ...``). O *doctypeName* é fornecido exatamente como apresentado. Os parâmetros *systemId* e *publicId* fornecem os identificadores de sistema e público, se especificados, ou ``None`` se omitidos. *has_internal_subset* será verdadeiro se o documento contiver um subconjunto de declaração de documento interno. Isto requer a versão 1.2 ou mais recente do Expat.
ru: Вызывается, когда Expat начинает анализ объявления типа документа (``<!DOCTYPE ...``). *doctypeName* предоставляется точно так, как представлено. Параметры *systemId* и *publicId* указывают системный и общедоступный идентификаторы, если они указаны, или ``None``, если они опущены. *has_internal_subset* будет иметь значение true, если документ содержит подмножество объявлений внутреннего документа. Для этого требуется Expat версии 1.2 или новее.

source: Called when Expat is done parsing the document type declaration. This requires Expat version 1.2 or newer.
pt_pt: Chamado quando o Expat termina de analisar a declaração de tipo de documento. Isto requer a versão 1.2 ou mais recente do Expat.
ru: Вызывается, когда Expat завершает анализ объявления типа документа. Для этого требуется Expat версии 1.2 или новее.

source: Called once for each element type declaration. *name* is the name of the element type, and *model* is a representation of the content model.
pt_pt: Chamado uma vez para cada declaração de tipo de elemento. *name* é o nome do tipo de elemento, e *model* é uma representação do modelo de conteúdo.
ru: Вызывается один раз для каждого объявления типа элемента. *name* — это имя типа элемента, а *model* — это представление модели контента.

source: Called for each declared attribute for an element type. If an attribute list declaration declares three attributes, this handler is called three times, once for each attribute. *elname* is the name of the element to which the declaration applies and *attname* is the name of the attribute declared. The attribute type is a string passed as *type*; the possible values are ``'CDATA'``, ``'ID'``, ``'IDREF'``, ... *default* gives the default value for the attribute used when the attribute is not specified by the document instance, or ``None`` if there is no default value (``#IMPLIED`` values). If the attribute is required to be given in the document instance, *required* will be true. This requires Expat version 1.95.0 or newer.
pt_pt: Chamado para cada atributo declarado para um tipo de elemento. Se uma declaração de lista de atributos declarar três atributos, este manipulador é chamado três vezes, uma vez para cada atributo. *elname* é o nome do elemento ao qual a declaração se aplica e *attname* é o nome do atributo declarado. O tipo de atributo é uma *string* passada como *type*; os valores possíveis são ``'CDATA'``, ``'ID'``, ``'IDREF'``, ... *default* fornece o valor predefinido para o atributo usado quando o atributo não é especificado pela instância do documento, ou ``None`` se não houver valor predefinido (valores ``#IMPLIED``). Se o atributo for obrigatório na instância do documento, *required* será verdadeiro. Isto requer a versão 1.95.0 ou mais recente do Expat.
ru: Вызывается для каждого объявленного атрибута типа элемента. Если объявление списка атрибутов объявляет три атрибута, этот обработчик вызывается три раза, по одному для каждого атрибута. *elname* — это имя элемента, к которому применяется объявление, а *attname* — имя объявленного атрибута. Тип атрибута — это строка, передаваемая как *type*; возможные значения: ``'CDATA'``, ``'ID'``, ``'IDREF'``, ... *default* дает значение по умолчанию для атрибута, используемого, когда атрибут не указан в экземпляр документа или ``None``, если нет значения по умолчанию (значения ``#IMPLIED``). Если атрибут необходимо указать в экземпляре документа, *required* будет иметь значение true. Для этого требуется Expat версии 1.95.0 или новее.

source: Called for the start of every element. *name* is a string containing the element name, and *attributes* is the element attributes. If :attr:`ordered_attributes` is true, this is a list (see :attr:`ordered_attributes` for a full description). Otherwise it's a dictionary mapping names to values.
pt_pt: Chamado para o início de cada elemento. *name* é uma *string* contendo o nome do elemento, e *attributes* são os atributos do elemento. Se :attr:`ordered_attributes` for verdadeiro, isto é uma lista (consulte :attr:`ordered_attributes` para uma descrição completa). Caso contrário, é um dicionário que mapeia nomes para valores.
ru: Вызывается для начала каждого элемента. *name* — это строка, содержащая имя элемента, а *attributes* — атрибуты элемента. Если :attr:`ordered_attributes` имеет значение true, это список (полное описание см. в :attr:`ordered_attributes`). В противном случае это словарь, сопоставляющий имена со значениями.

source: Called for the end of every element.
pt_pt: Chamado para o fim de cada elemento.
ru: Вызывается для завершения каждого элемента.

source: Called for every processing instruction.
pt_pt: Chamado para cada instrução de processamento.
ru: Вызывается для каждой инструкции обработки.

source: Called for unparsed (NDATA) entity declarations. This is only present for version 1.2 of the Expat library; for more recent versions, use :attr:`EntityDeclHandler` instead. (The underlying function in the Expat library has been declared obsolete.)
pt_pt: Chamado para declarações de entidades não analisadas (NDATA). Isto só está presente na versão 1.2 da biblioteca Expat; para versões mais recentes, use :attr:`EntityDeclHandler` em vez disso. (A função subjacente na biblioteca Expat foi declarada obsoleta.)
ru: Вызывается для неанализируемых объявлений объектов (NDATA). Это присутствует только в версии 1.2 библиотеки Expat; для более поздних версий вместо этого используйте :attr:`EntityDeclHandler`. (Базовая функция в библиотеке Expat объявлена ​​устаревшей.)

source: Called for all entity declarations. For parameter and internal entities, *value* will be a string giving the declared contents of the entity; this will be ``None`` for external entities. The *notationName* parameter will be ``None`` for parsed entities, and the name of the notation for unparsed entities. *is_parameter_entity* will be true if the entity is a parameter entity or false for general entities (most applications only need to be concerned with general entities). This is only available starting with version 1.95.0 of the Expat library.
pt_pt: Chamado para todas as declarações de entidades. Para entidades de parâmetro e internas, *value* será uma *string* que fornece o conteúdo declarado da entidade; isto será ``None`` para entidades externas. O parâmetro *notationName* será ``None`` para entidades analisadas e o nome da notação para entidades não analisadas. *is_parameter_entity* será verdadeiro se a entidade for uma entidade de parâmetro ou falso para entidades gerais (a maioria das aplicações só precisa de se preocupar com entidades gerais). Isto só está disponível a partir da versão 1.95.0 da biblioteca Expat.
ru: Вызывается для всех объявлений сущностей. Для параметров и внутренних сущностей *value* будет строкой, содержащей объявленное содержимое сущности; для внешних объектов это будет значение None. Параметр *notationName* будет иметь значение None для анализируемых сущностей и имя нотации для неанализируемых сущностей. *is_parameter_entity* будет иметь значение true, если объект является объектом параметра, или false для общих объектов (большинство приложений должны иметь дело только с общими объектами). Это доступно только начиная с версии 1.95.0 библиотеки Expat.

source: Called for notation declarations. *notationName*, *base*, and *systemId*, and *publicId* are strings if given. If the public identifier is omitted, *publicId* will be ``None``.
pt_pt: Chamado para declarações de notação. *notationName*, *base*, *systemId* e *publicId* são *strings* se fornecidos. Se o identificador público for omitido, *publicId* será ``None``.
ru: Вызывается для объявлений нотации. *notationName*, *base*, *systemId* и *publicId* являются строками, если они указаны. Если общедоступный идентификатор опущен, *publicId* будет иметь значение None.

source: Called when an element contains a namespace declaration. Namespace declarations are processed before the :attr:`StartElementHandler` is called for the element on which declarations are placed.
pt_pt: Chamado quando um elemento contém uma declaração de espaço de nome. As declarações de espaço de nome são processadas antes de :attr:`StartElementHandler` ser chamado para o elemento no qual as declarações são colocadas.
ru: Вызывается, когда элемент содержит объявление пространства имен. Объявления пространства имен обрабатываются до вызова :attr:`StartElementHandler` для элемента, в котором размещаются объявления.

source: Called when the closing tag is reached for an element that contained a namespace declaration. This is called once for each namespace declaration on the element in the reverse of the order for which the :attr:`StartNamespaceDeclHandler` was called to indicate the start of each namespace declaration's scope. Calls to this handler are made after the corresponding :attr:`EndElementHandler` for the end of the element.
pt_pt: Chamado quando a etiqueta de fecho é atingida para um elemento que continha uma declaração de espaço de nome. Isto é chamado uma vez para cada declaração de espaço de nome no elemento, na ordem inversa àquela pela qual o :attr:`StartNamespaceDeclHandler` foi chamado para indicar o início do âmbito de cada declaração de espaço de nome. As chamadas para este manipulador são feitas após o :attr:`EndElementHandler` correspondente para o fim do elemento.
ru: Вызывается при достижении закрывающего тега для элемента, содержащего объявление пространства имен. Это вызывается один раз для каждого объявления пространства имен для элемента в порядке, обратном тому, для которого был вызван :attr:`StartNamespaceDeclHandler`, чтобы указать начало области каждого объявления пространства имен. Вызовы этого обработчика выполняются после соответствующего :attr:`EndElementHandler` для конца элемента.

source: Called for comments. *data* is the text of the comment, excluding the leading ``'<!-``\ ``-'`` and trailing ``'-``\ ``->'``.
pt_pt: Chamado para comentários. *data* é o texto do comentário, excluindo o ``'<!-`` e o ``-'`` inicial e o ``'-`` e ``->'`` final.
ru: Позвонил, чтобы получить комментарии. *data* — это текст комментария, исключая начальный ``'<!-``\ ``-'`` и конечный ``'-``\ ``->'``.

source: Called at the start of a CDATA section. This and :attr:`EndCdataSectionHandler` are needed to be able to identify the syntactical start and end for CDATA sections.
pt_pt: Chamado no início de uma secção CDATA. Isto e :attr:`EndCdataSectionHandler` são necessários para identificar o início e o fim sintático das secções CDATA.
ru: Вызывается в начале раздела CDATA. Это и :attr:`EndCdataSectionHandler` необходимы для определения синтаксического начала и конца разделов CDATA.

source: Called at the end of a CDATA section.
pt_pt: Chamado no fim de uma secção CDATA.
ru: Вызывается в конце раздела CDATA.

source: Called for any characters in the XML document for which no applicable handler has been specified. This means characters that are part of a construct which could be reported, but for which no handler has been supplied.
pt_pt: Chamado para quaisquer caracteres no documento XML para os quais nenhum manipulador aplicável foi especificado. Isto significa caracteres que fazem parte de uma construção que poderia ser reportada, mas para a qual nenhum manipulador foi fornecido.
ru: Вызывается для любых символов в XML-документе, для которых не указан подходящий обработчик. Это означает, что символы являются частью конструкции, о которой можно сообщить, но для которой не указан обработчик.

source: This is the same as the :func:`DefaultHandler`, but doesn't inhibit expansion of internal entities. The entity reference will not be passed to the default handler.
pt_pt: Isto é o mesmo que :func:`DefaultHandler`, mas não inibe a expansão de entidades internas. A referência à entidade não será passada para o manipulador predefinido.
ru: Это то же самое, что и :func:`DefaultHandler`, но не запрещает расширение внутренних объектов. Ссылка на сущность не будет передана обработчику по умолчанию.
