Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/pyexpat.po
Languages: pt_pt, ru

source: Called if the XML document hasn't been declared as being a standalone document. This happens when there is an external subset or a reference to a parameter entity, but the XML declaration does not set standalone to ``yes`` in an XML declaration. If this handler returns ``0``, then the parser will raise an :const:`XML_ERROR_NOT_STANDALONE` error. If this handler is not set, no exception is raised by the parser for this condition.
pt_pt: Chamado se o documento XML não tiver sido declarado como um documento autónomo. Isto acontece quando há um subconjunto externo ou uma referência a uma entidade de parâmetro, mas a declaração XML não define standalone como ``yes`` numa declaração XML. Se este manipulador devolver ``0``, então o analisador levantará um erro :const:`XML_ERROR_NOT_STANDALONE`. Se este manipulador não estiver definido, nenhuma exceção é levantada pelo analisador para esta condição.
ru: Вызывается, если XML-документ не был объявлен как отдельный документ. Это происходит, когда существует внешнее подмножество или ссылка на объект параметра, но объявление XML не устанавливает для автономного значения «да» в объявлении XML. Если этот обработчик возвращает ``0``, то синтаксический анализатор выдаст ошибку :const:`XML_ERROR_NOT_STANDALONE`. Если этот обработчик не установлен, синтаксический анализатор не создает исключения для этого условия.

source: Called for references to external entities. *base* is the current base, as set by a previous call to :meth:`SetBase`. The public and system identifiers, *systemId* and *publicId*, are strings if given; if the public identifier is not given, *publicId* will be ``None``. The *context* value is opaque and should only be used as described below.
pt_pt: Chamado para referências a entidades externas. *base* é a base atual, conforme definido por uma chamada anterior a :meth:`SetBase`. Os identificadores público e de sistema, *systemId* e *publicId*, são *strings* se fornecidos; se o identificador público não for fornecido, *publicId* será ``None``. O valor *context* é opaco e só deve ser usado conforme descrito abaixo.
ru: Вызывается для ссылок на внешние сущности. *base* — текущая база, установленная предыдущим вызовом :meth:`SetBase`. Публичные и системные идентификаторы *systemId* и *publicId*, если они указаны, являются строками; если общедоступный идентификатор не указан, *publicId* будет иметь значение None. Значение *context* непрозрачно и должно использоваться только так, как описано ниже.

source: For external entities to be parsed, this handler must be implemented. It is responsible for creating the sub-parser using ``ExternalEntityParserCreate(context)``, initializing it with the appropriate callbacks, and parsing the entity. This handler should return an integer; if it returns ``0``, the parser will raise an :const:`XML_ERROR_EXTERNAL_ENTITY_HANDLING` error, otherwise parsing will continue.
pt_pt: Para que as entidades externas sejam analisadas, este manipulador deve ser implementado. É responsável por criar o sub-analisador usando ``ExternalEntityParserCreate(context)``, inicializá-lo com os *callbacks* apropriados e analisar a entidade. Este manipulador deve devolver um inteiro; se devolver ``0``, o analisador levantará um erro :const:`XML_ERROR_EXTERNAL_ENTITY_HANDLING`, caso contrário, a análise continuará.
ru: Для анализа внешних объектов этот обработчик должен быть реализован. Он отвечает за создание субпарсера с использованием «ExternalEntityParserCreate(context)», его инициализацию с помощью соответствующих обратных вызовов и анализ объекта. Этот обработчик должен возвращать целое число; если он возвращает ``0``, синтаксический анализатор выдаст ошибку :const:`XML_ERROR_EXTERNAL_ENTITY_HANDLING`, в противном случае синтаксический анализ продолжится.

source: If this handler is not provided, external entities are reported by the :attr:`DefaultHandler` callback, if provided.
pt_pt: Se este manipulador não for fornecido, as entidades externas são reportadas pelo *callback* :attr:`DefaultHandler`, se fornecido.
ru: Если этот обработчик не указан, о внешних объектах сообщает обратный вызов :attr:`DefaultHandler`, если он предусмотрен.

source: ExpatError Exceptions
pt_pt: Exceções ExpatError
ru: Исключения ExpatError

source: :exc:`ExpatError` exceptions have a number of interesting attributes:
pt_pt: As exceções :exc:`ExpatError` têm vários atributos interessantes:
ru: Исключения :exc:`ExpatError` имеют ряд интересных свойств:

source: Expat's internal error number for the specific error. The :data:`errors.messages <xml.parsers.expat.errors.messages>` dictionary maps these error numbers to Expat's error messages. For example::
pt_pt: O número de erro interno do Expat para o erro específico. O dicionário :data:`errors.messages <xml.parsers.expat.errors.messages>` mapeia estes números de erro para as mensagens de erro do Expat. Por exemplo:
ru: Внутренний номер ошибки Expat для конкретной ошибки. Словарь :data:`errors.messages <xml.parsers.expat.errors.messages>` сопоставляет эти номера ошибок с сообщениями об ошибках Expat. Например::

source: The :mod:`~xml.parsers.expat.errors` module also provides error message constants and a dictionary :data:`~xml.parsers.expat.errors.codes` mapping these messages back to the error codes, see below.
pt_pt: O módulo :mod:`~xml.parsers.expat.errors` também fornece constantes de mensagens de erro e um dicionário :data:`~xml.parsers.expat.errors.codes` que mapeia estas mensagens de volta aos códigos de erro, consulte abaixo.
ru: Модуль :mod:`~xml.parsers.expat.errors` также предоставляет константы сообщений об ошибках и словарь :data:`~xml.parsers.expat.errors.codes`, отображающий эти сообщения обратно в коды ошибок, см. ниже.

source: Line number on which the error was detected. The first line is numbered ``1``.
pt_pt: Número da linha na qual o erro foi detetado. A primeira linha é numerada como ``1``.
ru: Номер строки, в которой была обнаружена ошибка. Первая строка имеет номер ``1``.

source: Character offset into the line where the error occurred. The first column is numbered ``0``.
pt_pt: Deslocamento do carácter na linha onde o erro ocorreu. A primeira coluna é numerada como ``0``.
ru: Смещение символов в строке, где произошла ошибка. Первый столбец имеет номер «0».

source: Example
pt_pt: Exemplo
ru: Пример

source: The following program defines three handlers that just print out their arguments. ::
pt_pt: O seguinte programa define três manipuladores que simplesmente imprimem os seus argumentos:
ru: Следующая программа определяет три обработчика, которые просто распечатывают свои аргументы. ::

source: The output from this program is::
pt_pt: A saída deste programa é:
ru: Результатом этой программы является:

source: Content Model Descriptions
pt_pt: Descrições de Modelos de Conteúdo
ru: Описания моделей содержимого

source: Content models are described using nested tuples. Each tuple contains four values: the type, the quantifier, the name, and a tuple of children. Children are simply additional content model descriptions.
pt_pt: Os modelos de conteúdo são descritos usando tuplos aninhados. Cada tuplo contém quatro valores: o tipo, o quantificador, o nome e um tuplo de filhos. Os filhos são simplesmente descrições adicionais de modelos de conteúdo.
ru: Модели контента описываются с помощью вложенных кортежей. Каждый кортеж содержит четыре значения: тип, квантификатор, имя и кортеж дочерних элементов. Дочерние элементы — это просто дополнительные описания модели контента.

source: The values of the first two fields are constants defined in the :mod:`xml.parsers.expat.model` module. These constants can be collected in two groups: the model type group and the quantifier group.
pt_pt: Os valores dos dois primeiros campos são constantes definidas no módulo :mod:`xml.parsers.expat.model`. Estas constantes podem ser agrupadas em dois grupos: o grupo de tipo de modelo e o grupo de quantificadores.
ru: Значения первых двух полей являются константами, определенными в модуле :mod:`xml.parsers.expat.model`. Эти константы можно объединить в две группы: группу типов модели и группу кванторов.

source: The constants in the model type group are:
pt_pt: As constantes no grupo de tipo de modelo são:
ru: Константы в группе типов модели:

source: The element named by the model name was declared to have a content model of ``ANY``.
pt_pt: O elemento nomeado pelo nome do modelo foi declarado como tendo um modelo de conteúdo de ``ANY``.
ru: Было объявлено, что элемент, названный по имени модели, имеет модель содержимого «ЛЮБАЯ».

source: The named element allows a choice from a number of options; this is used for content models such as ``(A | B | C)``.
pt_pt: O elemento nomeado permite uma escolha entre várias opções; isto é usado para modelos de conteúdo como ``(A | B | C)``.
ru: Именованный элемент позволяет выбирать из нескольких вариантов; это используется для моделей контента, таких как ``(A | B | C)``.

source: Elements which are declared to be ``EMPTY`` have this model type.
pt_pt: Elementos que são declarados como ``EMPTY`` têm este tipo de modelo.
ru: Элементы, объявленные как EMPTY, имеют этот тип модели.

source: Models which represent a series of models which follow one after the other are indicated with this model type. This is used for models such as ``(A, B, C)``.
pt_pt: Modelos que representam uma série de modelos que seguem um após o outro são indicados com este tipo de modelo. Isto é usado para modelos como ``(A, B, C)``.
ru: Этим типом модели обозначаются модели, представляющие собой серию моделей, следующих друг за другом. Это используется для таких моделей, как ``(A, B, C)``.

source: The constants in the quantifier group are:
pt_pt: As constantes no grupo de quantificadores são:
ru: Константы в группе кванторов:

source: No modifier is given, so it can appear exactly once, as for ``A``.
pt_pt: Nenhum modificador é dado, por isso pode aparecer exatamente uma vez, como em ``A``.
ru: Модификатор не указан, поэтому он может появиться ровно один раз, как и ``A``.

source: The model is optional: it can appear once or not at all, as for ``A?``.
pt_pt: O modelo é opcional: pode aparecer uma vez ou não aparecer, como em ``A?``.
ru: Модель необязательна: она может появиться один раз или не появиться вообще, как в случае с ``A?``.

source: The model must occur one or more times (like ``A+``).
pt_pt: O modelo deve ocorrer uma ou mais vezes (como em ``A+``).
ru: Модель должна встречаться один или несколько раз (например, ``A+``).

source: The model must occur zero or more times, as for ``A*``.
pt_pt: O modelo deve ocorrer zero ou mais vezes, como em ``A*``.
ru: Модель должна встречаться ноль или более раз, как и для ``A*``.

source: Expat error constants
pt_pt: Constantes de erro do Expat
ru: Константы ошибок Expat

source: The following constants are provided in the :mod:`xml.parsers.expat.errors` module. These constants are useful in interpreting some of the attributes of the :exc:`ExpatError` exception objects raised when an error has occurred. Since for backwards compatibility reasons, the constants' value is the error *message* and not the numeric error *code*, you do this by comparing its :attr:`code` attribute with :samp:`errors.codes[errors.XML_ERROR_{CONSTANT_NAME}]`.
pt_pt: As seguintes constantes são fornecidas no módulo :mod:`xml.parsers.expat.errors`. Estas constantes são úteis na interpretação de alguns dos atributos dos objetos de exceção :exc:`ExpatError` levantados quando ocorre um erro. Por razões de compatibilidade retroativa, o valor das constantes é a mensagem de erro e não o código de erro numérico, pelo que faz isto comparando o seu atributo :attr:`code` com :samp:`errors.codes[errors.XML_ERROR_{CONSTANT_NAME}]`.
ru: Следующие константы предоставляются в модуле :mod:`xml.parsers.expat.errors`. Эти константы полезны при интерпретации некоторых атрибутов объектов исключений :exc:`ExpatError`, возникающих при возникновении ошибки. Поскольку по соображениям обратной совместимости значением констант является *сообщение* ошибки, а не числовой *код* ошибки, вы делаете это, сравнивая ее атрибут :attr:`code` с :samp:`errors.codes[errors.XML_ERROR_ {CONSTANT_NAME}]`.

source: The ``errors`` module has the following attributes:
pt_pt: O módulo ``errors`` tem os seguintes atributos:
ru: Модуль ``errors`` имеет следующие атрибуты:

source: A dictionary mapping string descriptions to their error codes.
pt_pt: Um dicionário que mapeia descrições de *strings* para os seus códigos de erro.
ru: Словарь, сопоставляющий описания строк с их кодами ошибок.

source: A dictionary mapping numeric error codes to their string descriptions.
pt_pt: Um dicionário que mapeia códigos de erro numéricos para as suas descrições de *strings*.
ru: Словарь, сопоставляющий числовые коды ошибок с их строковыми описаниями.

source: An entity reference in an attribute value referred to an external entity instead of an internal entity.
pt_pt: Uma referência de entidade num valor de atributo referiu-se a uma entidade externa em vez de uma entidade interna.
ru: Ссылка на сущность в значении атрибута относится к внешней сущности, а не к внутренней сущности.

source: A character reference referred to a character which is illegal in XML (for example, character ``0``, or '``&#0;``').
pt_pt: Uma referência de carácter referiu-se a um carácter que é ilegal em XML (por exemplo, o carácter ``0``, ou '``&#0;``').
ru: Ссылка на символ ссылается на символ, который является недопустимым в XML (например, символ ``0`` или ```&#0;``').

source: An entity reference referred to an entity which was declared with a notation, so cannot be parsed.
pt_pt: Uma referência de entidade referiu-se a uma entidade que foi declarada com uma notação, por isso não pode ser analisada.
ru: Ссылка на сущность ссылается на сущность, которая была объявлена ​​с нотацией, поэтому не может быть проанализирована.

source: An attribute was used more than once in a start tag.
pt_pt: Um atributo foi usado mais do que uma vez numa etiqueta de início.
ru: Атрибут использовался в начальном теге более одного раза.

source: Raised when an input byte could not properly be assigned to a character; for example, a NUL byte (value ``0``) in a UTF-8 input stream.
pt_pt: Levantado quando um byte de entrada não pode ser atribuído corretamente a um carácter; por exemplo, um byte NUL (valor ``0``) num fluxo de entrada UTF-8.
ru: Возникает, когда входной байт не может быть правильно назначен символу; например, NUL-байт (значение ``0``) во входном потоке UTF-8.

source: Something other than whitespace occurred after the document element.
pt_pt: Algo diferente de espaço em branco ocorreu após o elemento do documento.
ru: После элемента документа произошло что-то кроме пробелов.

source: An XML declaration was found somewhere other than the start of the input data.
pt_pt: Uma declaração XML foi encontrada noutro local que não o início dos dados de entrada.
ru: Объявление XML было найдено где-то кроме начала входных данных.

source: The document contains no elements (XML requires all documents to contain exactly one top-level element)..
pt_pt: O documento não contém elementos (o XML requer que todos os documentos contenham exatamente um elemento de nível superior).
ru: Документ не содержит элементов (XML требует, чтобы все документы содержали ровно один элемент верхнего уровня).

source: Expat was not able to allocate memory internally.
pt_pt: O Expat não conseguiu alocar memória internamente.
ru: Expat не смог выделить внутреннюю память.

source: A parameter entity reference was found where it was not allowed.
pt_pt: Foi encontrada uma referência de entidade de parâmetro onde não era permitida.
ru: Ссылка на объект параметра обнаружена там, где это запрещено.

source: An incomplete character was found in the input.
pt_pt: Foi encontrado um carácter incompleto na entrada.
ru: Во входных данных обнаружен неполный символ.

source: An entity reference contained another reference to the same entity; possibly via a different name, and possibly indirectly.
pt_pt: Uma referência de entidade continha outra referência para a mesma entidade; possivelmente através de um nome diferente e possivelmente de forma indireta.
ru: Ссылка на объект содержала другую ссылку на тот же объект; возможно, через другое имя, а возможно, и косвенно.

source: Some unspecified syntax error was encountered.
pt_pt: Foi encontrado algum erro de sintaxe não especificado.
ru: Обнаружена некоторая неуказанная синтаксическая ошибка.

source: An end tag did not match the innermost open start tag.
pt_pt: Uma etiqueta de fim não correspondeu à etiqueta de início aberta mais interna.
ru: Конечный тег не соответствует самому внутреннему открытому начальному тегу.

source: Some token (such as a start tag) was not closed before the end of the stream or the next token was encountered.
pt_pt: Algum token (como uma etiqueta de início) não foi fechado antes do fim do fluxo ou antes de ser encontrado o próximo token.
ru: Некоторые токены (например, открывающий тег) не были закрыты до конца потока или до обнаружения следующего токена.

source: A reference was made to an entity which was not defined.
pt_pt: Foi feita uma referência a uma entidade que não foi definida.
ru: Была сделана ссылка на сущность, которая не была определена.

source: The document encoding is not supported by Expat.
pt_pt: A codificação do documento não é suportada pelo Expat.
ru: Кодировка документа не поддерживается Expat.

source: A CDATA marked section was not closed.
pt_pt: Uma secção marcada como CDATA não foi fechada.
ru: Раздел с пометкой CDATA не был закрыт.

source: The parser determined that the document was not "standalone" though it declared itself to be in the XML declaration, and the :attr:`NotStandaloneHandler` was set and returned ``0``.
pt_pt: O analisador determinou que o documento não era "autónomo", embora tenha declarado ser na declaração XML, e o :attr:`NotStandaloneHandler` foi definido e devolveu ``0``.
ru: Анализатор определил, что документ не является «автономным», хотя он заявил о себе в декларации XML, а :attr:`NotStandaloneHandler` был установлен и вернул ``0``.

source: An operation was requested that requires DTD support to be compiled in, but Expat was configured without DTD support. This should never be reported by a standard build of the :mod:`xml.parsers.expat` module.
pt_pt: Foi solicitada uma operação que requer suporte para DTD compilado, mas o Expat foi configurado sem suporte para DTD. Isto nunca deve ser reportado por uma compilação padrão do módulo :mod:`xml.parsers.expat`.
ru: Была запрошена операция, требующая компиляции поддержки DTD, но Expat был настроен без поддержки DTD. Об этом никогда не должна сообщать стандартная сборка модуля :mod:`xml.parsers.expat`.

source: A behavioral change was requested after parsing started that can only be changed before parsing has started. This is (currently) only raised by :meth:`UseForeignDTD`.
pt_pt: Foi solicitada uma alteração de comportamento após o início da análise que só pode ser alterada antes do início da análise. Isto é (atualmente) apenas levantado por :meth:`UseForeignDTD`.
ru: После начала анализа было запрошено изменение поведения, которое можно изменить только до начала анализа. Это (в настоящее время) вызывается только :meth:`UseForeignDTD`.

source: An undeclared prefix was found when namespace processing was enabled.
pt_pt: Foi encontrado um prefixo não declarado quando o processamento de espaço de nome estava ativado.
ru: При включенной обработке пространства имен был обнаружен необъявленный префикс.

source: The document attempted to remove the namespace declaration associated with a prefix.
pt_pt: O documento tentou remover a declaração de espaço de nome associada a um prefixo.
ru: В документе предпринята попытка удалить объявление пространства имен, связанное с префиксом.

source: A parameter entity contained incomplete markup.
pt_pt: Uma entidade de parâmetro continha marcação incompleta.
ru: Сущность параметра содержала неполную разметку.

source: The document contained no document element at all.
pt_pt: O documento não continha nenhum elemento de documento.
ru: Документ вообще не содержал элементов документа.

source: There was an error parsing a text declaration in an external entity.
pt_pt: Ocorreu um erro ao analisar uma declaração de texto numa entidade externa.
ru: Произошла ошибка при синтаксическом анализе текстового объявления во внешнем объекте.

source: Characters were found in the public id that are not allowed.
pt_pt: Foram encontrados caracteres no ID público que não são permitidos.
ru: В публичном идентификаторе были обнаружены запрещенные символы.

source: The requested operation was made on a suspended parser, but isn't allowed. This includes attempts to provide additional input or to stop the parser.
pt_pt: A operação solicitada foi feita num analisador suspenso, mas não é permitida. Isto inclui tentativas de fornecer entrada adicional ou de parar o analisador.
ru: Запрошенная операция была выполнена на приостановленном парсере, но не разрешена. Сюда входят попытки предоставить дополнительные данные или остановить анализатор.

source: An attempt to resume the parser was made when the parser had not been suspended.
pt_pt: Foi feita uma tentativa de retomar o analisador quando o analisador não tinha sido suspenso.
ru: Была предпринята попытка возобновить работу парсера, хотя работа парсера не была приостановлена.

source: This should not be reported to Python applications.
pt_pt: Isto não deve ser reportado a aplicações Python.
ru: Об этом не следует сообщать приложениям Python.

source: The requested operation was made on a parser which was finished parsing input, but isn't allowed. This includes attempts to provide additional input or to stop the parser.
pt_pt: A operação solicitada foi feita num analisador que terminou de analisar a entrada, mas não é permitida. Isto inclui tentativas de fornecer entrada adicional ou de parar o analisador.
ru: Запрошенная операция была выполнена на анализаторе, который завершил анализ входных данных, но не разрешен. Сюда входят попытки предоставить дополнительные данные или остановить анализатор.

source: Footnotes
pt_pt: Notas de rodapé
ru: Сноски

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
pt_pt: A *string* de codificação incluída na saída XML deve estar em conformidade com os padrões apropriados. Por exemplo, "UTF-8" é válido, mas "UTF8" não. Consulte https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl e https://www.iana.org/assignments/character-sets/character-sets.xhtml.
ru: Строка кодирования, включенная в выходные данные XML, должна соответствовать соответствующим стандартам. Например, «UTF-8» допустим, а «UTF8» — нет. См. https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl и https://www.iana.org/assignments/character-sets/character-sets.xhtml.

source: The :mod:`pyexpat` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
ru: Модуль :mod:`pyexpat` не защищен от вредоносно созданных данных. Если вам нужно проанализировать ненадежные или неаутентифицированные данные, см. :ref:`xml-vulnerabilities`.
