Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/quopri.po
Languages: es_es

source: :mod:`!quopri` --- Encode and decode MIME quoted-printable data
es_es: :mod:`!quopri` --- Кодирование и декодирование MIME-данных для печати в кавычках

source: **Source code:** :source:`Lib/quopri.py`
es_es: **Вихідний код:** :source:`Lib/quopri.py`

source: This module performs quoted-printable transport encoding and decoding, as defined in :rfc:`1521`: "MIME (Multipurpose Internet Mail Extensions) Part One: Mechanisms for Specifying and Describing the Format of Internet Message Bodies". The quoted-printable encoding is designed for data where there are relatively few nonprintable characters; the base64 encoding scheme available via the :mod:`base64` module is more compact if there are many such characters, as when sending a graphics file.
es_es: Цей модуль виконує транспортне кодування та декодування з можливістю друку в лапках, як визначено в :rfc:`1521`: "MIME (багатоцільові розширення Інтернет-пошти) Частина перша: Механізми визначення та опису формату тіл Інтернет-повідомлень". Кодування для друку в лапках призначене для даних, де є відносно мало недрукованих символів; схема кодування base64, доступна через модуль :mod:`base64`, є більш компактною, якщо таких символів багато, наприклад, під час надсилання графічного файлу.

source: Decode the contents of the *input* file and write the resulting decoded binary data to the *output* file. *input* and *output* must be :term:`binary file objects <file object>`. If the optional argument *header* is present and true, underscore will be decoded as space. This is used to decode "Q"-encoded headers as described in :rfc:`1522`: "MIME (Multipurpose Internet Mail Extensions) Part Two: Message Header Extensions for Non-ASCII Text".
es_es: Декодуйте вміст *вхідного* файлу та запишіть отримані декодовані двійкові дані у *вихідний* файл. *вхід* і *вихід* мають бути :term:`бінарними файловими об’єктами <file object>`. Якщо необов’язковий аргумент *header* присутній і вірний, підкреслення буде розшифровано як пробіл. Це використовується для декодування заголовків у кодуванні "Q", як описано в :rfc:`1522`: "MIME (багатоцільові розширення Інтернет-пошти) Частина друга: Розширення заголовків повідомлень для тексту, відмінного від ASCII".

source: Encode the contents of the *input* file and write the resulting quoted-printable data to the *output* file. *input* and *output* must be :term:`binary file objects <file object>`. *quotetabs*, a non-optional flag which controls whether to encode embedded spaces and tabs; when true it encodes such embedded whitespace, and when false it leaves them unencoded. Note that spaces and tabs appearing at the end of lines are always encoded, as per :rfc:`1521`. *header* is a flag which controls if spaces are encoded as underscores as per :rfc:`1522`.
es_es: Закодуйте вміст *вхідного* файлу та запишіть отримані цитовані дані для друку у *вихідний* файл. *вхід* і *вихід* мають бути :term:`бінарними файловими об’єктами <file object>`. *quotetabs*, необов’язковий прапорець, який контролює, чи потрібно кодувати вбудовані пробіли та табуляції; коли true, він кодує такі вбудовані пробіли, а коли false, залишає їх незакодованими. Зверніть увагу, що пробіли та табуляції в кінці рядків завжди кодуються відповідно до :rfc:`1521`. *header* — це позначка, яка контролює, чи кодуються пробіли як підкреслення відповідно до :rfc:`1522`.

source: Like :func:`decode`, except that it accepts a source :class:`bytes` and returns the corresponding decoded :class:`bytes`.
es_es: Подібно до :func:`decode`, за винятком того, що він приймає вихідні :class:`bytes` і повертає відповідні декодовані :class:`bytes`.

source: Like :func:`encode`, except that it accepts a source :class:`bytes` and returns the corresponding encoded :class:`bytes`. By default, it sends a ``False`` value to *quotetabs* parameter of the :func:`encode` function.
es_es: Подібно до :func:`encode`, за винятком того, що він приймає вихідні :class:`bytes` і повертає відповідні закодовані :class:`bytes`. За замовчуванням він надсилає значення ``False`` до параметра *quotetabs* функції :func:`encode`.

source: Module :mod:`base64`
es_es: Модуль :mod:`base64`

source: Encode and decode MIME base64 data
es_es: Кодування та декодування даних MIME base64

source: encoding
es_es: кодування

source: quoted-printable encoding
es_es: кодировка для печати в кавычках
