Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/random.po
Languages: sv

source: :mod:`!random` --- Generate pseudo-random numbers
sv: :mod:`!random` --- Generera pseudoslumpmässiga tal

source: **Source code:** :source:`Lib/random.py`
sv: **Källkod:** :source:`Lib/random.py`

source: This module implements pseudo-random number generators for various distributions.
sv: Denna modul implementerar pseudoslumpmässiga nummergeneratorer för olika distributioner.

source: For integers, there is uniform selection from a range. For sequences, there is uniform selection of a random element, a function to generate a random permutation of a list in-place, and a function for random sampling without replacement.
sv: För heltal finns ett enhetligt urval från ett intervall. För sekvenser finns det ett enhetligt urval av ett slumpmässigt element, en funktion för att generera en slumpmässig permutation av en lista på plats och en funktion för slumpmässigt urval utan ersättning.

source: On the real line, there are functions to compute uniform, normal (Gaussian), lognormal, negative exponential, gamma, and beta distributions. For generating distributions of angles, the von Mises distribution is available.
sv: På den reella linjen finns det funktioner för att beräkna uniforma, normala (gaussiska), lognormala, negativa exponentiella, gamma- och betafördelningar. För att generera fördelningar av vinklar finns von Mises-fördelningen tillgänglig.

source: Almost all module functions depend on the basic function :func:`.random`, which generates a random float uniformly in the half-open range ``0.0 <= X < 1.0``. Python uses the Mersenne Twister as the core generator. It produces 53-bit precision floats and has a period of 2\*\*19937-1. The underlying implementation in C is both fast and threadsafe. The Mersenne Twister is one of the most extensively tested random number generators in existence. However, being completely deterministic, it is not suitable for all purposes, and is completely unsuitable for cryptographic purposes.
sv: Nästan alla modulfunktioner är beroende av den grundläggande funktionen :func:`.random`, som genererar en slumpmässig flottör enhetligt i det halvöppna intervallet ``0,0 <= X < 1,0``. Python använder Mersenne Twister som kärngenerator. Den producerar flyttal med 53-bitars precision och har en period på 2\*\*19937-1. Den underliggande implementationen i C är både snabb och trådsäker. Mersenne Twister är en av de mest omfattande slumptalsgeneratorer som finns. Eftersom den är helt deterministisk är den dock inte lämplig för alla ändamål, och den är helt olämplig för kryptografiska ändamål.

source: The functions supplied by this module are actually bound methods of a hidden instance of the :class:`random.Random` class. You can instantiate your own instances of :class:`Random` to get generators that don't share state.
sv: De funktioner som tillhandahålls av denna modul är faktiskt bundna metoder för en dold instans av klassen :class:`random.Random`. Du kan instansiera dina egna instanser av :class:`Random` för att få generatorer som inte delar tillstånd.

source: Class :class:`Random` can also be subclassed if you want to use a different basic generator of your own devising: see the documentation on that class for more details.
sv: Klassen :class:`Random` kan också underklassificeras om du vill använda en annan grundläggande generator som du själv har skapat: se dokumentationen för den klassen för mer information.

source: The :mod:`random` module also provides the :class:`SystemRandom` class which uses the system function :func:`os.urandom` to generate random numbers from sources provided by the operating system.
sv: Modulen :mod:`random` innehåller även klassen :class:`SystemRandom` som använder systemfunktionen :func:`os.urandom` för att generera slumptal från källor som tillhandahålls av operativsystemet.

source: The pseudo-random generators of this module should not be used for security purposes. For security or cryptographic uses, see the :mod:`secrets` module.
sv: Pseudoslumpgeneratorerna i denna modul bör inte användas för säkerhetsändamål. För säkerhet eller kryptografisk användning, se modulen :mod:`secrets`.

source: M. Matsumoto and T. Nishimura, "Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator", ACM Transactions on Modeling and Computer Simulation Vol. 8, No. 1, January pp.3--30 1998.
sv: M. Matsumoto och T. Nishimura, "Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator", ACM Transactions on Modeling and Computer Simulation Vol. 8, No. 1, January pp.3--30 1998.

source: `Complementary-Multiply-with-Carry recipe <https://code.activestate.com/recipes/576707-long-period-random-number-generator/>`_ for a compatible alternative random number generator with a long period and comparatively simple update operations.
sv: `Complementary-Multiply-with-Carry recipe <https://code.activestate.com/recipes/576707-long-period-random-number-generator/>`_ för en kompatibel alternativ slumptalsgenerator med lång period och jämförelsevis enkla uppdateringsoperationer.

source: The global random number generator and instances of :class:`Random` are thread-safe. However, in the free-threaded build, concurrent calls to the global generator or to the same instance of :class:`Random` may encounter contention and poor performance. Consider using separate instances of :class:`Random` per thread instead.
sv: Den globala slumptalsgeneratorn och instanser av :class:`Random` är trådsäkra. I den frittrådade versionen kan dock samtidiga anrop till den globala generatorn eller till samma instans av :class:`Random` leda till konflikter och dålig prestanda. Överväg att använda separata instanser av :class:`Random` per tråd istället.

source: Bookkeeping functions
sv: Bokföringsfunktioner

source: Initialize the random number generator.
sv: Initialisera slumptalsgeneratorn.

source: If *a* is omitted or ``None``, the current system time is used. If randomness sources are provided by the operating system, they are used instead of the system time (see the :func:`os.urandom` function for details on availability).
sv: Om *a* utelämnas eller ``None``, används den aktuella systemtiden. Om slumpmässiga källor tillhandahålls av operativsystemet används de i stället för systemtiden (se funktionen :func:`os.urandom` för information om tillgänglighet).

source: If *a* is an int, it is used directly.
sv: Om *a* är en int används den direkt.

source: With version 2 (the default), a :class:`str`, :class:`bytes`, or :class:`bytearray` object gets converted to an :class:`int` and all of its bits are used.
sv: Med version 2 (standard) konverteras ett :class:`str`\-, :class:`bytes`\- eller :class:`bytearray`\-objekt till ett :class:`int`\-objekt och alla dess bitar används.

source: With version 1 (provided for reproducing random sequences from older versions of Python), the algorithm for :class:`str` and :class:`bytes` generates a narrower range of seeds.
sv: Med version 1 (som tillhandahålls för att återskapa slumpmässiga sekvenser från äldre versioner av Python) genererar algoritmen för :class:`str` och :class:`bytes` ett smalare urval av frön.

source: Moved to the version 2 scheme which uses all of the bits in a string seed.
sv: Flyttat till version 2-schemat som använder alla bitar i en strängfrö.

source: The *seed* must be one of the following types: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
sv: *Seed* måste vara en av följande typer: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, eller :class:`bytearray`.

source: Return an object capturing the current internal state of the generator. This object can be passed to :func:`setstate` to restore the state.
sv: Returnerar ett objekt som fångar generatorns nuvarande interna tillstånd. Detta objekt kan skickas till :func:`setstate` för att återställa tillståndet.

source: *state* should have been obtained from a previous call to :func:`getstate`, and :func:`setstate` restores the internal state of the generator to what it was at the time :func:`getstate` was called.
sv: *state* bör ha erhållits från ett tidigare anrop till :func:`getstate`, och :func:`setstate` återställer generatorns interna tillstånd till vad det var när :func:`getstate` anropades.

source: Functions for bytes
sv: Funktioner för bytes

source: Generate *n* random bytes.
sv: Generera *n* slumpmässiga byte.

source: This method should not be used for generating security tokens. Use :func:`secrets.token_bytes` instead.
sv: Denna metod bör inte användas för att generera säkerhetstoken. Använd :func:`secrets.token_bytes` istället.

source: Functions for integers
sv: Funktioner för heltal

source: Return a randomly selected element from ``range(start, stop, step)``.
sv: Returnerar ett slumpmässigt valt element från ``range(start, stop, step)``.

source: This is roughly equivalent to ``choice(range(start, stop, step))`` but supports arbitrarily large ranges and is optimized for common cases.
sv: Detta motsvarar i stort sett ``choice(range(start, stop, step))`` men stöder godtyckligt stora intervall och är optimerat för vanliga fall.

source: The positional argument pattern matches the :func:`range` function.
sv: Det positionella argumentmönstret matchar funktionen :func:`range`.

source: Keyword arguments should not be used because they can be interpreted in unexpected ways. For example ``randrange(start=100)`` is interpreted as ``randrange(0, 100, 1)``.
sv: Nyckelord som argument bör inte användas eftersom de kan tolkas på oväntade sätt. Till exempel tolkas ``randrange(start=100)`` som ``randrange(0, 100, 1)``.

source: :meth:`randrange` is more sophisticated about producing equally distributed values. Formerly it used a style like ``int(random()*n)`` which could produce slightly uneven distributions.
sv: :meth:`randrange` är mer sofistikerad när det gäller att producera jämnt fördelade värden. Tidigare användes en stil som ``int(random()*n)`` som kunde ge något ojämna fördelningar.

source: Automatic conversion of non-integer types is no longer supported. Calls such as ``randrange(10.0)`` and ``randrange(Fraction(10, 1))`` now raise a :exc:`TypeError`.
sv: Automatisk konvertering av typer som inte är heltal stöds inte längre. Anrop som ``randrange(10.0)`` och ``randrange(Fraction(10, 1))`` ger nu upphov till ett :exc:`TypeError`.

source: Return a random integer *N* such that ``a <= N <= b``. Alias for ``randrange(a, b+1)``.
sv: Returnerar ett slumpmässigt heltal *N* så att ``a <= N <= b``. Alias för ``randrange(a, b+1)``.

source: Returns a non-negative Python integer with *k* random bits. This method is supplied with the Mersenne Twister generator and some other generators may also provide it as an optional part of the API. When available, :meth:`getrandbits` enables :meth:`randrange` to handle arbitrarily large ranges.
sv: Returnerar ett icke-negativt Python-heltal med *k* slumpmässiga bitar. Denna metod levereras med Mersenne Twister-generatorn och vissa andra generatorer kan också tillhandahålla den som en valfri del av API:et. När den är tillgänglig gör :meth:`getrandbits` det möjligt för :meth:`randrange` att hantera godtyckligt stora intervall.

source: This method now accepts zero for *k*.
sv: Denna metod accepterar nu noll för *k*.

source: Functions for sequences
sv: Funktioner för sekvenser

source: Return a random element from the non-empty sequence *seq*. If *seq* is empty, raises :exc:`IndexError`.
sv: Returnerar ett slumpmässigt element från den icke-tomma sekvensen *seq*. Om *seq* är tom, uppstår :exc:`IndexError`.

source: Return a *k* sized list of elements chosen from the *population* with replacement. If the *population* is empty, raises :exc:`IndexError`.
sv: Returnerar en *k* stor lista med element som valts från *populationen* med ersättning. Om *populationen* är tom, uppstår :exc:`IndexError`.

source: If a *weights* sequence is specified, selections are made according to the relative weights. Alternatively, if a *cum_weights* sequence is given, the selections are made according to the cumulative weights (perhaps computed using :func:`itertools.accumulate`). For example, the relative weights ``[10, 5, 30, 5]`` are equivalent to the cumulative weights ``[10, 15, 45, 50]``. Internally, the relative weights are converted to cumulative weights before making selections, so supplying the cumulative weights saves work.
sv: Om en *weights*-sekvens anges görs urvalen enligt de relativa vikterna. Alternativt, om en *cum_weights*-sekvens anges, görs urvalen enligt de kumulativa vikterna (kanske beräknade med :func:`itertools.accumulate`). Till exempel är de relativa vikterna ``[10, 5, 30, 5]`` likvärdiga med de kumulativa vikterna ``[10, 15, 45, 50]``. Internt konverteras de relativa vikterna till kumulativa vikter innan urval görs, så det sparar arbete att ange de kumulativa vikterna.

source: If neither *weights* nor *cum_weights* are specified, selections are made with equal probability. If a weights sequence is supplied, it must be the same length as the *population* sequence. It is a :exc:`TypeError` to specify both *weights* and *cum_weights*.
sv: Om varken *weights* eller *cum_weights* anges görs urvalen med lika stor sannolikhet. Om en sekvens med vikter anges måste den vara lika lång som sekvensen *population*. Det är ett :exc:`TypeError` att ange både *weights* och *cum_weights*.

source: The *weights* or *cum_weights* can use any numeric type that interoperates with the :class:`float` values returned by :func:`random` (that includes integers, floats, and fractions but excludes decimals). Weights are assumed to be non-negative and finite. A :exc:`ValueError` is raised if all weights are zero.
sv: I *weights* eller *cum_weights* kan du använda vilken numerisk typ som helst som fungerar med :class:`float`\-värdena som returneras av :func:`random` (vilket inkluderar heltal, flyttal och fraktioner men inte decimaler). Vikter antas vara icke-negativa och ändliga. Ett :exc:`ValueError` uppstår om alla vikter är noll.

source: For a given seed, the :func:`choices` function with equal weighting typically produces a different sequence than repeated calls to :func:`choice`. The algorithm used by :func:`choices` uses floating-point arithmetic for internal consistency and speed. The algorithm used by :func:`choice` defaults to integer arithmetic with repeated selections to avoid small biases from round-off error.
sv: För ett visst frö ger funktionen :func:`choices` med lika viktning vanligtvis en annan sekvens än upprepade anrop till :func:`choice`. Algoritmen som används av :func:`choices` använder flyttalsaritmetik för intern konsistens och snabbhet. Algoritmen som används av :func:`choice` använder som standard heltalsaritmetik med upprepade val för att undvika små förskjutningar från avrundningsfel.

source: Raises a :exc:`ValueError` if all weights are zero.
sv: Utlöser ett :exc:`ValueError` om alla vikter är noll.

source: Shuffle the sequence *x* in place.
sv: Blanda sekvensen *x* på plats.

source: To shuffle an immutable sequence and return a new shuffled list, use ``sample(x, k=len(x))`` instead.
sv: Om du vill blanda en oföränderlig sekvens och returnera en ny blandad lista använder du ``sample(x, k=len(x))`` istället.

source: Note that even for small ``len(x)``, the total number of permutations of *x* can quickly grow larger than the period of most random number generators. This implies that most permutations of a long sequence can never be generated. For example, a sequence of length 2080 is the largest that can fit within the period of the Mersenne Twister random number generator.
sv: Observera att även för små ``len(x)`` kan det totala antalet permutationer av *x* snabbt bli större än perioden för de flesta slumptalsgeneratorer. Detta innebär att de flesta permutationer av en lång sekvens aldrig kan genereras. Till exempel är en sekvens med längden 2080 den största som kan rymmas inom perioden för slumptalsgeneratorn Mersenne Twister.

source: Removed the optional parameter *random*.
sv: Den valfria parametern *random* har tagits bort.

source: Return a *k* length list of unique elements chosen from the population sequence. Used for random sampling without replacement.
sv: Returnerar en *k* lång lista med unika element som valts från populationssekvensen. Används för slumpmässig provtagning utan ersättning.

source: Returns a new list containing elements from the population while leaving the original population unchanged. The resulting list is in selection order so that all sub-slices will also be valid random samples. This allows raffle winners (the sample) to be partitioned into grand prize and second place winners (the subslices).
sv: Returnerar en ny lista som innehåller element från populationen medan den ursprungliga populationen lämnas oförändrad. Den resulterande listan är i urvalsordning så att alla delskivor också kommer att vara giltiga slumpmässiga urval. Detta gör det möjligt att dela upp lotterivinnare (urvalet) i vinnare av förstapriset och andraplatsen (underskivorna).

source: Members of the population need not be :term:`hashable` or unique. If the population contains repeats, then each occurrence is a possible selection in the sample.
sv: Medlemmarna i populationen behöver inte vara :term:`hashable` eller unika. Om populationen innehåller upprepningar är varje förekomst ett möjligt urval i urvalet.

source: Repeated elements can be specified one at a time or with the optional keyword-only *counts* parameter. For example, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` is equivalent to ``sample(['red', 'red', 'red', 'red', 'blue', 'blue'], k=5)``.
sv: Upprepade element kan anges ett i taget eller med den valfria parametern *counts* som endast innehåller nyckelord. Exempelvis är ``sample(['red', 'blue'], counts=[4, 2], k=5)`` likvärdigt med ``sample(['red', 'red', 'red', 'red', 'blue', 'blue'], k=5)``.

source: To choose a sample from a range of integers, use a :func:`range` object as an argument. This is especially fast and space efficient for sampling from a large population: ``sample(range(10000000), k=60)``.
sv: Om du vill välja ett urval från ett intervall av heltal använder du ett :func:`range`\-objekt som argument. Detta är särskilt snabbt och utrymmeseffektivt för provtagning från en stor population: ``sample(range(10000000), k=60)``.

source: If the sample size is larger than the population size, a :exc:`ValueError` is raised.
sv: Om urvalsstorleken är större än populationsstorleken uppstår ett :exc:`ValueError`.

source: Added the *counts* parameter.
sv: Lagt till parametern *counts*.

source: The *population* must be a sequence. Automatic conversion of sets to lists is no longer supported.
sv: *Population* måste vara en sekvens. Automatisk konvertering av sets till listor stöds inte längre.

source: Discrete distributions
sv: Diskreta fördelningar

source: The following function generates a discrete distribution.
sv: Följande funktion genererar en diskret fördelning.

source: `Binomial distribution <https://mathworld.wolfram.com/BinomialDistribution.html>`_. Return the number of successes for *n* independent trials with the probability of success in each trial being *p*:
sv: `Binomialfördelning <https://mathworld.wolfram.com/BinomialDistribution.html>`_. Returnera antalet lyckade försök för *n* oberoende försök där sannolikheten för att lyckas i varje försök är *p*:

source: Mathematically equivalent to::
sv: Matematiskt likvärdig med::

source: sum(random() < p for i in range(n))
sv: sum(random() < p för i i intervallet(n))

source: The number of trials *n* should be a non-negative integer. The probability of success *p* should be between ``0.0 <= p <= 1.0``. The result is an integer in the range ``0 <= X <= n``.
sv: Antalet försök *n* ska vara ett icke-negativt heltal. Sannolikheten för framgång *p* ska ligga mellan ``0,0 <= p <= 1,0``. Resultatet är ett heltal i intervallet ``0 <= X <= n``.

source: Real-valued distributions
sv: Realvärdesdistributioner

source: The following functions generate specific real-valued distributions. Function parameters are named after the corresponding variables in the distribution's equation, as used in common mathematical practice; most of these equations can be found in any statistics text.
sv: Följande funktioner genererar specifika realvärdesfördelningar. Funktionsparametrarna är namngivna efter motsvarande variabler i fördelningens ekvation, som används i vanlig matematisk praxis; de flesta av dessa ekvationer kan hittas i vilken statistiktext som helst.

source: Return the next random floating-point number in the range ``0.0 <= X < 1.0``
sv: Returnerar nästa slumpmässiga flyttal i intervallet ``0,0 <= X < 1,0``

source: Return a random floating-point number *N* such that ``a <= N <= b`` for ``a <= b`` and ``b <= N <= a`` for ``b < a``.
sv: Returnerar ett slumpmässigt flyttal *N* så att ``a <= N <= b`` för ``a <= b`` och ``b <= N <= a`` för ``b < a``.

source: The end-point value ``b`` may or may not be included in the range depending on floating-point rounding in the expression ``a + (b-a) * random()``.
sv: Slutpunktsvärdet ``b`` kan ingå eller inte ingå i intervallet beroende på avrundningen av flyttal i uttrycket ``a + (b-a) * random()``.

source: Return a random floating-point number *N* such that ``low <= N <= high`` and with the specified *mode* between those bounds. The *low* and *high* bounds default to zero and one. The *mode* argument defaults to the midpoint between the bounds, giving a symmetric distribution.
sv: Returnerar ett slumpmässigt flyttal *N* så att ``låg <= N <= hög`` och med det angivna *läget* mellan dessa gränser. Gränserna *low* och *high* är som standard noll och ett. Argumentet *mode* är som standard mittpunkten mellan gränserna, vilket ger en symmetrisk fördelning.

source: Beta distribution. Conditions on the parameters are ``alpha > 0`` and ``beta > 0``. Returned values range between 0 and 1.
sv: Betafördelning. Villkoren för parametrarna är ``alpha > 0`` och ``beta > 0``. Returnerade värden varierar mellan 0 och 1.

source: Exponential distribution. *lambd* is 1.0 divided by the desired mean. It should be nonzero. (The parameter would be called "lambda", but that is a reserved word in Python.) Returned values range from 0 to positive infinity if *lambd* is positive, and from negative infinity to 0 if *lambd* is negative.
sv: Exponentiell fördelning. *lambd* är 1,0 dividerat med önskat medelvärde. Det bör vara ett värde som inte är noll. (Parametern skulle kallas "lambda", men det är ett reserverat ord i Python) Returnerade värden sträcker sig från 0 till positiv oändlighet om *lambd* är positiv, och från negativ oändlighet till 0 om *lambd* är negativ.

source: Added the default value for ``lambd``.
sv: Lagt till standardvärde för ``lambd``.

source: Gamma distribution. (*Not* the gamma function!) The shape and scale parameters, *alpha* and *beta*, must have positive values. (Calling conventions vary and some sources define 'beta' as the inverse of the scale).
sv: Gammafördelning. (*Inte* gammafunktionen!) Parametrarna för form och skala, *alpha* och *beta*, måste ha positiva värden. (Benämningskonventionerna varierar och vissa källor definierar "beta" som skalans invers).

source: The probability distribution function is::
sv: Sannolikhetsfördelningsfunktionen är::

source: x ** (alpha - 1) * math.exp(-x / beta) pdf(x) = -------------------------------------- math.gamma(alpha) * beta ** alpha
sv: x ** (alfa - 1) * math.exp(-x / beta) pdf(x) = -------------------------------------- math.gamma(alfa) * beta ** alfa
