Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/random.po
Languages: sv

source: Normal distribution, also called the Gaussian distribution. *mu* is the mean, and *sigma* is the standard deviation. This is slightly faster than the :func:`normalvariate` function defined below.
sv: Normalfördelning, även kallad gaussisk fördelning. *mu* är medelvärdet och *sigma* är standardavvikelsen. Detta är något snabbare än funktionen :func:`normalvariate` som definieras nedan.

source: Multithreading note: When two threads call this function simultaneously, it is possible that they will receive the same return value. This can be avoided in three ways. 1) Have each thread use a different instance of the random number generator. 2) Put locks around all calls. 3) Use the slower, but thread-safe :func:`normalvariate` function instead.
sv: Notering om multithreading: När två trådar anropar denna funktion samtidigt är det möjligt att de får samma returvärde. Detta kan undvikas på tre sätt. 1) Låt varje tråd använda en annan instans av slumptalsgeneratorn. 2) Sätt lås runt alla anrop. 3) Använd den långsammare men trådsäkra funktionen :func:`normalvariate` istället.

source: *mu* and *sigma* now have default arguments.
sv: *mu* och *sigma* har nu standardargument.

source: Log normal distribution. If you take the natural logarithm of this distribution, you'll get a normal distribution with mean *mu* and standard deviation *sigma*. *mu* can have any value, and *sigma* must be greater than zero.
sv: Logaritmisk normalfördelning. Om du tar den naturliga logaritmen av den här fördelningen får du en normalfördelning med medelvärde *mu* och standardavvikelse *sigma*. *mu* kan ha vilket värde som helst och *sigma* måste vara större än noll.

source: Normal distribution. *mu* is the mean, and *sigma* is the standard deviation.
sv: Normalfördelning. *mu* är medelvärdet och *sigma* är standardavvikelsen.

source: *mu* is the mean angle, expressed in radians between 0 and 2\*\ *pi*, and *kappa* is the concentration parameter, which must be greater than or equal to zero. If *kappa* is equal to zero, this distribution reduces to a uniform random angle over the range 0 to 2\*\ *pi*.
sv: *mu* är medelvinkeln, uttryckt i radianer mellan 0 och 2\*\ *pi*, och *kappa* är koncentrationsparametern, som måste vara större än eller lika med noll. Om *kappa* är lika med noll reduceras denna fördelning till en enhetlig slumpmässig vinkel över intervallet 0 till 2\*\ *pi*.

source: Pareto distribution. *alpha* is the shape parameter.
sv: Pareto-fördelning. *alpha* är formparametern.

source: Weibull distribution. *alpha* is the scale parameter and *beta* is the shape parameter.
sv: Weibullfördelning. *alpha* är skalparametern och *beta* är formparametern.

source: Alternative Generator
sv: Alternativ generator

source: Class that implements the default pseudo-random number generator used by the :mod:`random` module.
sv: Klass som implementerar standardgeneratorn för pseudoslumptal som används av modulen :mod:`random`.

source: Formerly the *seed* could be any hashable object. Now it is limited to: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
sv: Tidigare kunde *seed* vara vilket hashbart objekt som helst. Nu är det begränsat till: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, eller :class:`bytearray`.

source: Subclasses of :class:`!Random` should override the following methods if they wish to make use of a different basic generator:
sv: Subklasser av :class:`!Random` bör åsidosätta följande metoder om de vill använda en annan grundläggande generator:

source: Override this method in subclasses to customise the :meth:`~random.seed` behaviour of :class:`!Random` instances.
sv: Åsidosätt denna metod i underklasser för att anpassa :meth:`~random.seed`\-beteendet för :class:`!Random`\-instanser.

source: Override this method in subclasses to customise the :meth:`~random.getstate` behaviour of :class:`!Random` instances.
sv: Åsidosätt denna metod i underklasser för att anpassa :meth:`~random.getstate`\-beteendet för :class:`!Random`\-instanser.

source: Override this method in subclasses to customise the :meth:`~random.setstate` behaviour of :class:`!Random` instances.
sv: Åsidosätt denna metod i underklasser för att anpassa :meth:`~random.setstate`\-beteendet för :class:`!Random`\-instanser.

source: Override this method in subclasses to customise the :meth:`~random.random` behaviour of :class:`!Random` instances.
sv: Åsidosätt denna metod i underklasser för att anpassa :meth:`~random.random`\-beteendet för :class:`!Random`\-instanser.

source: Optionally, a custom generator subclass can also supply the following method:
sv: Alternativt kan en underklass till en anpassad generator också tillhandahålla följande metod:

source: Override this method in subclasses to customise the :meth:`~random.getrandbits` behaviour of :class:`!Random` instances.
sv: Åsidosätt denna metod i underklasser för att anpassa :meth:`~random.getrandbits`\-beteendet för :class:`!Random`\-instanser.

source: Override this method in subclasses to customise the :meth:`~random.randbytes` behaviour of :class:`!Random` instances.
sv: Åsidosätt denna metod i underklasser för att anpassa :meth:`~random.randbytes`\-beteendet hos :class:`!Random`\-instanser.

source: Class that uses the :func:`os.urandom` function for generating random numbers from sources provided by the operating system. Not available on all systems. Does not rely on software state, and sequences are not reproducible. Accordingly, the :meth:`seed` method has no effect and is ignored. The :meth:`getstate` and :meth:`setstate` methods raise :exc:`NotImplementedError` if called.
sv: Klass som använder funktionen :func:`os.urandom` för att generera slumptal från källor som tillhandahålls av operativsystemet. Finns inte tillgänglig på alla system. Förlitar sig inte på programvarutillstånd och sekvenser är inte reproducerbara. Följaktligen har metoden :meth:`seed` ingen effekt och ignoreras. Metoderna :meth:`getstate` och :meth:`setstate` ger upphov till :exc:`NotImplementedError` om de anropas.

source: Notes on Reproducibility
sv: Anteckningar om reproducerbarhet

source: Sometimes it is useful to be able to reproduce the sequences given by a pseudo-random number generator. By reusing a seed value, the same sequence should be reproducible from run to run as long as multiple threads are not running.
sv: Ibland är det bra att kunna reproducera de sekvenser som ges av en pseudoslumpmässig nummergenerator. Genom att återanvända ett seed-värde bör samma sekvens kunna reproduceras från körning till körning så länge inte flera trådar körs.

source: Most of the random module's algorithms and seeding functions are subject to change across Python versions, but two aspects are guaranteed not to change:
sv: De flesta av slumpmodulens algoritmer och såddfunktioner kan ändras i olika Python-versioner, men två aspekter kommer garanterat inte att ändras:

source: If a new seeding method is added, then a backward compatible seeder will be offered.
sv: Om en ny såningsmetod läggs till kommer en bakåtkompatibel såmaskin att erbjudas.

source: The generator's :meth:`~Random.random` method will continue to produce the same sequence when the compatible seeder is given the same seed.
sv: Generatorns metod :meth:`~Random.random` kommer att fortsätta att producera samma sekvens när den kompatibla såningsmaskinen får samma frö.

source: Examples
sv: Exempel

source: Basic examples::
sv: Grundläggande exempel::

source: Simulations::
sv: Simuleringar::

source: Example of `statistical bootstrapping <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ using resampling with replacement to estimate a confidence interval for the mean of a sample::
sv: Exempel på `statistisk bootstrapping <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ där man använder omsampling med ersättning för att skatta ett konfidensintervall för medelvärdet i ett urval::

source: Example of a `resampling permutation test <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ to determine the statistical significance or `p-value <https://en.wikipedia.org/wiki/P-value>`_ of an observed difference between the effects of a drug versus a placebo::
sv: Exempel på ett `resampling permutationstest <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ för att fastställa den statistiska signifikansen eller `p-värdet <https://en.wikipedia.org/wiki/P-value>`_ för en observerad skillnad mellan effekterna av ett läkemedel och placebo::

source: Simulation of arrival times and service deliveries for a multiserver queue::
sv: Simulering av ankomsttider och serviceleveranser för en multiserver-kö::

source: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ a video tutorial by `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ on statistical analysis using just a few fundamental concepts including simulation, sampling, shuffling, and cross-validation.
sv: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ en videohandledning av `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ om statistisk analys med hjälp av några få grundläggande begrepp, bland annat simulering, provtagning, blandning och korsvalidering.

source: `Economics Simulation <https://nbviewer.org/url/norvig.com/ipython/Economics.ipynb>`_ a simulation of a marketplace by `Peter Norvig <https://norvig.com/bio.html>`_ that shows effective use of many of the tools and distributions provided by this module (gauss, uniform, sample, betavariate, choice, triangular, and randrange).
sv: `Economics Simulation <https://nbviewer.org/url/norvig.com/ipython/Economics.ipynb>`_ en simulering av en marknadsplats av `Peter Norvig <https://norvig.com/bio.html>`_ som visar effektiv användning av många av de verktyg och fördelningar som tillhandahålls av denna modul (gauss, uniform, sample, betavariate, choice, triangular och randrange).

source: `A Concrete Introduction to Probability (using Python) <https://nbviewer.org/url/norvig.com/ipython/Probability.ipynb>`_ a tutorial by `Peter Norvig <https://norvig.com/bio.html>`_ covering the basics of probability theory, how to write simulations, and how to perform data analysis using Python.
sv: `A Concrete Introduction to Probability (using Python) <https://nbviewer.org/url/norvig.com/ipython/Probability.ipynb>`_ en handledning av `Peter Norvig <https://norvig.com/bio.html>`_ som täcker grunderna i sannolikhetsteori, hur man skriver simuleringar och hur man utför dataanalys med Python.

source: Recipes
sv: Recept

source: These recipes show how to efficiently make random selections from the combinatoric iterators in the :mod:`itertools` module:
sv: Dessa recept visar hur man på ett effektivt sätt gör slumpmässiga urval från de kombinatoriska iteratorerna i modulen :mod:`itertools`:

source: def random_product(*args, repeat=1): "Random selection from itertools.product(*args, **kwds)" pools = [tuple(pool) for pool in args] * repeat return tuple(map(random.choice, pools)) def random_permutation(iterable, r=None): "Random selection from itertools.permutations(iterable, r)" pool = tuple(iterable) r = len(pool) if r is None else r return tuple(random.sample(pool, r)) def random_combination(iterable, r): "Random selection from itertools.combinations(iterable, r)" pool = tuple(iterable) n = len(pool) indices = sorted(random.sample(range(n), r)) return tuple(pool[i] for i in indices) def random_combination_with_replacement(iterable, r): "Choose r elements with replacement. Order the result to match the iterable." # Result will be in set(itertools.combinations_with_replacement(iterable, r)). pool = tuple(iterable) n = len(pool) indices = sorted(random.choices(range(n), k=r)) return tuple(pool[i] for i in indices)
sv: def random_product(*args, repeat=1): "Slumpmässigt urval från itertools.product(*args, **kwds)" pooler = [tuple(pool) for pool in args] * repeat return tuple(map(slumpmässigt.val, pooler)) def random_permutation(iterabel, r=None): "Slumpmässigt urval från itertools.permutations(iterable, r)" pool = tupel(iterabel) r = len(pool) if r is None else r return tuple(slumpmässigt.urval(pool, r)) def slumpmässig_kombination(iterabel, r): "Slumpmässigt urval från itertools.combinations(iterable, r)" pool = tupel(iterabel) n = len(pool) index = sorterad(slumpmässigt.urval(intervall(n), r)) return tuple(pool[i] for i in index) def random_combination_with_replacement(iterable, r): "Välj r element med ersättning. Ordna resultatet så att det matchar iterabeln." # Resultatet kommer att finnas i set(itertools.combinations_with_replacement(iterable, r)). pool = tupel(iterabel) n = len(pool) index = sorterad(random.choices(range(n), k=r)) return tuple(pool[i] for i in index)

source: The default :func:`.random` returns multiples of 2⁻⁵³ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced and are exactly representable as Python floats. However, many other representable floats in that interval are not possible selections. For example, ``0.05954861408025609`` isn't an integer multiple of 2⁻⁵³.
sv: Standardvärdet :func:`.random` returnerar multiplar av 2-⁵³ i intervallet *0,0 ≤ x < 1,0*. Alla sådana tal är jämnt fördelade och är exakt representerbara som Python-flottor. Många andra representativa flyttal i det intervallet är dock inte möjliga val. Till exempel är ``0,05954861408025609`` inte en heltalsmultipel av 2-⁵³.

source: The following recipe takes a different approach. All floats in the interval are possible selections. The mantissa comes from a uniform distribution of integers in the range *2⁵² ≤ mantissa < 2⁵³*. The exponent comes from a geometric distribution where exponents smaller than *-53* occur half as often as the next larger exponent.
sv: I följande recept används ett annat tillvägagångssätt. Alla flyttal i intervallet är möjliga val. Mantissan kommer från en enhetlig fördelning av heltal i intervallet *2⁵² ≤ mantissa < 2⁵³*. Exponenten kommer från en geometrisk fördelning där exponenter som är mindre än *-53* förekommer hälften så ofta som den nästa större exponenten.

source: All :ref:`real valued distributions <real-valued-distributions>` in the class will use the new method::
sv: Alla :ref:`realvärdesdistributioner <real-valued-distributions>` i klassen kommer att använda den nya metoden::

source: The recipe is conceptually equivalent to an algorithm that chooses from all the multiples of 2⁻¹⁰⁷⁴ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced, but most have to be rounded down to the nearest representable Python float. (The value 2⁻¹⁰⁷⁴ is the smallest positive unnormalized float and is equal to ``math.ulp(0.0)``.)
sv: Receptet är konceptuellt likvärdigt med en algoritm som väljer bland alla multiplar av 2-¹⁰⁷⁴ i intervallet *0,0 ≤ x < 1,0*. Alla sådana tal är jämnt fördelade, men de flesta måste avrundas nedåt till närmaste representativa Python-flat. (Värdet 2-¹⁰⁷⁴ är den minsta positiva onormaliserade flottören och är lika med ``math.ulp(0.0)``.)

source: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ a paper by Allen B. Downey describing ways to generate more fine-grained floats than normally generated by :func:`.random`.
sv: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ en artikel av Allen B. Downey som beskriver sätt att generera mer finkorniga flyttal än vad som normalt genereras av :func:`.random`.

source: Command-line usage
sv: Användning av kommandoraden

source: The :mod:`!random` module can be executed from the command line.
sv: Modulen :mod:`!random` kan köras från kommandoraden.

source: python -m random [-h] [-c CHOICE [CHOICE ...] | -i N | -f N] [input ...]
sv: python -m random [-h] [-c CHOICE [CHOICE ...] | -i N | -f N] [inmatning ...]

source: The following options are accepted:
sv: Följande alternativ accepteras:

source: Show the help message and exit.
sv: Visa hjälpmeddelandet och avsluta.

source: Print a random choice, using :meth:`choice`.
sv: Skriv ut ett slumpmässigt val med hjälp av :meth:`choice`.

source: Print a random integer between 1 and N inclusive, using :meth:`randint`.
sv: Skriv ut ett slumpmässigt heltal mellan 1 och N inklusive, med :meth:`randint`.

source: Print a random floating-point number between 0 and N inclusive, using :meth:`uniform`.
sv: Skriv ut ett slumpmässigt flyttal mellan 0 och N inklusive, med hjälp av :meth:`uniform`.

source: If no options are given, the output depends on the input:
sv: Om inga alternativ anges beror utdata på indata:

source: String or multiple: same as :option:`--choice`.
sv: Sträng eller multipel: samma som :option:`\--choice`.

source: Integer: same as :option:`--integer`.
sv: Integer: samma som :option:`\--integer`.

source: Float: same as :option:`--float`.
sv: Float: samma som :option:`\--float`.

source: Command-line example
sv: Exempel på kommandorad

source: Here are some examples of the :mod:`!random` command-line interface:
sv: Här följer några exempel på kommandoradsgränssnittet :mod:`!random`:

source: $ # Choose one at random $ python -m random egg bacon sausage spam "Lobster Thermidor aux crevettes with a Mornay sauce" Lobster Thermidor aux crevettes with a Mornay sauce $ # Random integer $ python -m random 6 6 $ # Random floating-point number $ python -m random 1.8 1.7080016272295635 $ # With explicit arguments $ python -m random --choice egg bacon sausage spam "Lobster Thermidor aux crevettes with a Mornay sauce" egg $ python -m random --integer 6 3 $ python -m random --float 1.8 1.5666339105010318 $ python -m random --integer 6 5 $ python -m random --float 6 3.1942323316565915
sv: $ # Välj en slumpmässigt $ python -m slumpmässigt ägg bacon korv spam "Hummer Thermidor aux crevettes med en Mornay-sås" Hummer Thermidor aux crevettes med Mornay-sås $ # Slumpmässigt heltal $ python -m slumpmässigt 6 6 $ # Slumpmässigt flyttal $ python -m slumpmässigt 1,8 1.7080016272295635 $ # Med uttryckliga argument $ python -m random --choice ägg bacon korv spam "Hummer Thermidor aux crevettes med en Mornay-sås" ägg $ python -m slumpmässig --integer 6 3 $ python -m slumpmässig -flata 1,8 1.5666339105010318 $ python -m slumpmässig --integer 6 5 $ python -m slumpmässig -flata 6 3.1942323316565915
