Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sched.po
Languages: ru

source: **Source code:** :source:`Lib/sched.py`
ru: **Исходный код:** :source:`Lib/sched.py`

source: The :mod:`sched` module defines a class which implements a general purpose event scheduler:
ru: Модуль :mod:`sched` определяет класс, который реализует планировщик событий общего назначения:

source: The :class:`scheduler` class defines a generic interface to scheduling events. It needs two functions to actually deal with the "outside world" --- *timefunc* should be callable without arguments, and return a number (the "time", in any units whatsoever). The *delayfunc* function should be callable with one argument, compatible with the output of *timefunc*, and should delay that many time units. *delayfunc* will also be called with the argument ``0`` after each event is run to allow other threads an opportunity to run in multi-threaded applications.
ru: Класс :class:`scheduler` определяет общий интерфейс для планирования событий. Для работы с «внешним миром» необходимы две функции --- *timefunc* должна вызываться без аргументов и возвращать число («время» в любых единицах измерения). Функция *delayfunc* должна вызываться с одним аргументом, совместимой с выводом *timefunc*, и должна задерживать такое же количество единиц времени. *delayfunc* также будет вызываться с аргументом ``0`` после запуска каждого события, чтобы дать возможность другим потокам работать в многопоточных приложениях.

source: *timefunc* and *delayfunc* parameters are optional.
ru: Параметры *timefunc* и *delayfunc* являются необязательными.

source: :class:`scheduler` class can be safely used in multi-threaded environments.
ru: Класс :class:`scheduler` можно безопасно использовать в многопоточных средах.

source: Example::
ru: Пример::

source: Scheduler Objects
ru: Объекты планировщика

source: :class:`scheduler` instances have the following methods and attributes:
ru: Экземпляры :class:`scheduler` имеют следующие методы и атрибуты:

source: Schedule a new event. The *time* argument should be a numeric type compatible with the return value of the *timefunc* function passed to the constructor. Events scheduled for the same *time* will be executed in the order of their *priority*. A lower number represents a higher priority.
ru: Запланируйте новое мероприятие. Аргумент *time* должен иметь числовой тип, совместимый с возвращаемым значением функции *timefunc*, передаваемой конструктору. События, запланированные на одно и то же *время*, будут выполняться в порядке их *приоритета*. Меньшее число соответствует более высокому приоритету.

source: Executing the event means executing ``action(*argument, **kwargs)``. *argument* is a sequence holding the positional arguments for *action*. *kwargs* is a dictionary holding the keyword arguments for *action*.
ru: Выполнение события означает выполнение ``action(*argument, **kwargs)``. *аргумент* — это последовательность, содержащая позиционные аргументы для *действия*. *kwargs* — это словарь, содержащий аргументы ключевых слов для *action*.

source: Return value is an event which may be used for later cancellation of the event (see :meth:`cancel`).
ru: Возвращаемое значение — это событие, которое можно использовать для последующей отмены события (см. :meth:`cancel`).

source: *argument* parameter is optional.
ru: Параметр *аргумент* является необязательным.

source: *kwargs* parameter was added.
ru: Добавлен параметр *kwargs*.

source: Schedule an event for *delay* more time units. Other than the relative time, the other arguments, the effect and the return value are the same as those for :meth:`enterabs`.
ru: Запланируйте событие на *задержку* большего количества единиц времени. За исключением относительного времени, остальные аргументы, эффект и возвращаемое значение такие же, как и для :meth:`enterabs`.

source: Remove the event from the queue. If *event* is not an event currently in the queue, this method will raise a :exc:`ValueError`.
ru: Удалить событие из очереди. Если *event* не является событием, находящимся в настоящее время в очереди, этот метод вызовет :exc:`ValueError`.

source: Return ``True`` if the event queue is empty.
ru: Верните True, если очередь событий пуста.

source: If *blocking* is false executes the scheduled events due to expire soonest (if any) and then return the deadline of the next scheduled call in the scheduler (if any).
ru: Если *blocking* имеет значение false, выполняются запланированные события, срок действия которых истекает раньше всего (если таковые имеются), а затем возвращается крайний срок следующего запланированного вызова в планировщике (если таковой имеется).

source: Either *action* or *delayfunc* can raise an exception. In either case, the scheduler will maintain a consistent state and propagate the exception. If an exception is raised by *action*, the event will not be attempted in future calls to :meth:`run`.
ru: Исключение может вызвать либо *action*, либо *delayfunc*. В любом случае планировщик будет поддерживать согласованное состояние и распространять исключение. Если *действие* вызывает исключение, событие не будет повторяться при будущих вызовах :meth:`run`.

source: If a sequence of events takes longer to run than the time available before the next event, the scheduler will simply fall behind. No events will be dropped; the calling code is responsible for canceling events which are no longer pertinent.
ru: Если последовательность событий занимает больше времени, чем время, доступное до следующего события, планировщик просто отстанет. Никакие события не будут удалены; вызывающий код отвечает за отмену событий, которые больше не актуальны.

source: *blocking* parameter was added.
ru: Добавлен параметр *blocking*.

source: Read-only attribute returning a list of upcoming events in the order they will be run. Each event is shown as a :term:`named tuple` with the following fields: time, priority, action, argument, kwargs.
ru: Атрибут только для чтения, возвращающий список предстоящих событий в том порядке, в котором они будут выполняться. Каждое событие отображается как именованный кортеж со следующими полями: время, приоритет, действие, аргумент, kwargs.
