Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/select.po
Languages: pt_pt, ru, sv

source: Close the file descriptor of the polling object.
pt_pt: Fecha o descritor de ficheiro do objeto de sondagem.
ru: Закройте файловый дескриптор объекта опроса.
sv: Stäng fildeskriptorn för polling-objektet.

source: ``True`` if the polling object is closed.
pt_pt: ``True`` se o objeto de sondagem estiver fechado.
ru: ``True``, если объект опроса закрыт.
sv: ``True`` om polling-objektet är stängt.

source: Return the file descriptor number of the polling object.
pt_pt: Retorna o número do descritor de ficheiro do objeto de sondagem.
ru: Возвращает номер файлового дескриптора объекта опроса.
sv: Returnera filbeskrivningsnumret för polling-objektet.

source: Register a file descriptor with the polling object. Future calls to the :meth:`poll` method will then check whether the file descriptor has any pending I/O events. *fd* can be either an integer, or an object with a :meth:`~io.IOBase.fileno` method that returns an integer. File objects implement :meth:`!fileno`, so they can also be used as the argument.
pt_pt: Regista um descritor de ficheiro com o objeto de sondagem. Chamadas futuras ao método :meth:`poll` verificarão então se o descritor de ficheiro tem algum evento de E/S pendente. *fd* pode ser um inteiro ou um objeto com um método :meth:`~io.IOBase.fileno` que retorna um inteiro. Objetos de ficheiro implementam :meth:`!fileno`, por isso também podem ser usados como argumento.
ru: Зарегистрируйте дескриптор файла с объектом опроса. Будущие вызовы метода :meth:`poll` будут проверять, есть ли в файловом дескрипторе какие-либо ожидающие события ввода-вывода. *fd* может быть либо целым числом, либо объектом с методом :meth:`~io.IOBase.fileno`, который возвращает целое число. Файловые объекты реализуют :meth:`!fileno`, поэтому их также можно использовать в качестве аргумента.
sv: Registrera en filbeskrivare med polling-objektet. Framtida anrop till metoden :meth:`poll` kommer sedan att kontrollera om filbeskrivaren har några väntande I/O-händelser. *fd* kan antingen vara ett heltal eller ett objekt med en :meth:`~io.IOBase.fileno`\-metod som returnerar ett heltal. Filobjekt implementerar :meth:`!fileno`, så de kan också användas som argument.

source: *eventmask* is an optional bitmask describing the type of events you want to check for. The constants are the same that with :c:func:`!poll` object. The default value is a combination of the constants :const:`POLLIN`, :const:`POLLPRI`, and :const:`POLLOUT`.
pt_pt: *eventmask* é uma máscara de bits opcional que descreve o tipo de eventos que deseja verificar. As constantes são as mesmas que as do objeto :c:func:`!poll`. O valor predefinido é uma combinação das constantes :const:`POLLIN`, :const:`POLLPRI` e :const:`POLLOUT`.
ru: *eventmask* — необязательная битовая маска, описывающая тип событий, которые вы хотите проверить. Константы такие же, как и в объекте :c:func:`!poll`. Значение по умолчанию представляет собой комбинацию констант :const:`POLLIN`, :const:`POLLPRI` и :const:`POLLOUT`.
sv: *eventmask* är en valfri bitmask som beskriver vilken typ av händelser du vill söka efter. Konstanterna är desamma som för objektet :c:func:`!poll`. Standardvärdet är en kombination av konstanterna :const:`POLLIN`, :const:`POLLPRI` och :const:`POLLOUT`.

source: Registering a file descriptor that's already registered is not an error, but the result is undefined. The appropriate action is to unregister or modify it first. This is an important difference compared with :c:func:`!poll`.
pt_pt: Registar um descritor de ficheiro que já está registado não é um erro, mas o resultado é indefinido. A ação apropriada é cancelar o registo ou modificá-lo primeiro. Esta é uma diferença importante em comparação com :c:func:`!poll`.
ru: Регистрация уже зарегистрированного файлового дескриптора не является ошибкой, но результат не определен. Соответствующее действие — сначала отменить регистрацию или изменить его. Это важное отличие от :c:func:`!poll`.
sv: Att registrera en filbeskrivare som redan är registrerad är inte ett fel, men resultatet är odefinierat. Den lämpliga åtgärden är att avregistrera eller modifiera den först. Detta är en viktig skillnad jämfört med :c:func:`!poll`.

source: This method does an :meth:`unregister` followed by a :meth:`register`. It is (a bit) more efficient that doing the same explicitly.
pt_pt: Este método faz um :meth:`unregister` seguido de um :meth:`register`. É (um pouco) mais eficiente do que fazer o mesmo explicitamente.
ru: Этот метод выполняет :meth:`unregister`, за которым следует :meth:`register`. Это (немного) более эффективно, чем делать то же самое явно.
sv: Denna metod gör en :meth:`unregister` följt av en :meth:`register`. Det är (lite) mer effektivt än att göra samma sak explicit.

source: Remove a file descriptor being tracked by a polling object. Just like the :meth:`register` method, *fd* can be an integer or an object with a :meth:`~io.IOBase.fileno` method that returns an integer.
pt_pt: Remove um descritor de ficheiro que está a ser rastreado por um objeto de sondagem. Assim como o método :meth:`register`, *fd* pode ser um inteiro ou um objeto com um método :meth:`~io.IOBase.fileno` que retorna um inteiro.
ru: Удалить дескриптор файла, отслеживаемый объектом опроса. Как и метод :meth:`register`, *fd* может быть целым числом или объектом с методом :meth:`~io.IOBase.fileno`, который возвращает целое число.
sv: Ta bort en filbeskrivare som spåras av ett polling-objekt. Precis som metoden :meth:`register` kan *fd* vara ett heltal eller ett objekt med en metod :meth:`~io.IOBase.fileno` som returnerar ett heltal.

source: Attempting to remove a file descriptor that was never registered is safely ignored.
pt_pt: Tentar remover um descritor de ficheiro que nunca foi registado é ignorado com segurança.
ru: Попытка удалить файловый дескриптор, который никогда не был зарегистрирован, игнорируется.
sv: Försök att ta bort en filbeskrivning som aldrig registrerats ignoreras på ett säkert sätt.

source: Polls the set of registered file descriptors, and returns a possibly empty list containing ``(fd, event)`` 2-tuples for the descriptors that have events or errors to report. *fd* is the file descriptor, and *event* is a bitmask with bits set for the reported events for that descriptor --- :const:`POLLIN` for waiting input, :const:`POLLOUT` to indicate that the descriptor can be written to, and so forth. An empty list indicates that the call timed out and no file descriptors had any events to report. If *timeout* is given, it specifies the length of time in milliseconds which the system will wait for events before returning. If *timeout* is omitted, -1, or :const:`None`, the call will block until there is an event for this poll object.
pt_pt: Sonda o conjunto de descritores de ficheiros registados e retorna uma lista possivelmente vazia contendo tuplos ``(fd, event)`` para os descritores que têm eventos ou erros para reportar. *fd* é o descritor de ficheiro e *event* é uma máscara de bits com bits definidos para os eventos reportados para esse descritor --- :const:`POLLIN` para entrada em espera, :const:`POLLOUT` para indicar que o descritor pode ser escrito, e assim por diante. Uma lista vazia indica que a chamada expirou e nenhum descritor de ficheiro tinha eventos para reportar. Se *timeout* for fornecido, especifica o comprimento do tempo em milissegundos que o sistema aguardará por eventos antes de retornar. Se *timeout* for omitido, -1, ou :const:`None`, a chamada bloqueará até que haja um evento para este objeto de sondagem.
ru: Опрашивает набор зарегистрированных файловых дескрипторов и возвращает, возможно, пустой список, содержащий двухкортежи ``(fd, event)`` для дескрипторов, у которых есть события или ошибки, о которых необходимо сообщить. *fd* — это дескриптор файла, а *event* — это битовая маска с битами, установленными для сообщаемых событий для этого дескриптора --- :const:`POLLIN` для ожидания ввода, :const:`POLLOUT` для указания того, что дескриптор может быть записанным и так далее. Пустой список означает, что время ожидания вызова истекло и ни у одного файлового дескриптора не было событий, о которых можно было бы сообщить. Если задано значение *timeout*, оно определяет продолжительность времени в миллисекундах, в течение которого система будет ожидать событий перед возвратом. Если *timeout* опущен, -1 или :const:`None`, вызов будет блокироваться до тех пор, пока не произойдет событие для этого объекта опроса.
sv: Undersöker uppsättningen av registrerade filbeskrivare och returnerar en eventuellt tom lista som innehåller ``(fd, event)`` 2-tuples för de beskrivare som har händelser eller fel att rapportera. *fd* är filbeskrivaren, och *event* är en bitmask med bitar inställda för de rapporterade händelserna för den beskrivaren --- :const:`POLLIN` för väntande inmatning, :const:`POLLOUT` för att ange att beskrivaren kan skrivas till, och så vidare. En tom lista indikerar att anropet timade ut och att inga filbeskrivare hade några händelser att rapportera. Om *timeout* anges, specificeras den tid i millisekunder som systemet ska vänta på händelser innan det återvänder. Om *timeout* utelämnas, -1, eller :const:`None`, kommer anropet att blockeras tills det finns en händelse för detta poll-objekt.

source: Edge and Level Trigger Polling (epoll) Objects
pt_pt: Objetos de Sondagem de Disparo de Borda e Nível (epoll)
ru: Объекты опроса триггеров по краям и уровням (epoll)
sv: Objekt för pollning av kant- och nivåtrigger (epoll)

source: Constant
pt_pt: Constante
ru: Константа
sv: Konstant

source: Meaning
pt_pt: Significado
ru: Значение
sv: Betydelse

source: Available for read
pt_pt: Disponível para leitura
ru: Доступно для чтения
sv: Tillgänglig för läsning

source: Available for write
pt_pt: Disponível para escrita
ru: Доступен для записи
sv: Tillgänglig för skrivning

source: Urgent data for read
pt_pt: Dados urgentes para leitura
ru: Срочные данные для чтения
sv: Brådskande data för läsning

source: Error condition happened on the assoc. fd
pt_pt: Condição de erro ocorreu no fd associado
ru: Зависание произошло на assoc. fd
sv: Feltillstånd inträffade på assoc. fd

source: Hang up happened on the assoc. fd
pt_pt: Desligar ocorreu no fd associado
ru: Зависание произошло на assoc. fd
sv: Lägg på luren hände på assoc. fd

source: Set Edge Trigger behavior, the default is Level Trigger behavior
pt_pt: Define o comportamento de Disparo de Borda, o predefinido é o comportamento de Disparo de Nível
ru: Установите поведение Edge Trigger, по умолчанию используется поведение Level Trigger.
sv: Ställ in Edge Trigger-beteende, standard är Level Trigger-beteende

source: Set one-shot behavior. After one event is pulled out, the fd is internally disabled
pt_pt: Define o comportamento de um único disparo. Após um evento ser retirado, o fd é internamente desativado
ru: Установите одноразовое поведение. После извлечения одного события fd внутренне отключается.
sv: Ställ in one-shot-beteende. Efter att en händelse har dragits ut är fd internt inaktiverad

source: Wake only one epoll object when the associated fd has an event. The default (if this flag is not set) is to wake all epoll objects polling on a fd.
pt_pt: Acorda apenas um objeto epoll quando o fd associado tem um evento. O predefinido (se esta flag não estiver definida) é acordar todos os objetos epoll a sondar num fd.
ru: Пробуждайте только один объект epoll, когда связанный с ним fd имеет событие. По умолчанию (если этот флаг не установлен) пробуждается опрос всех объектов epoll на fd.
sv: Väck bara ett epoll-objekt när den associerade fd:n har en händelse. Standardinställningen (om denna flagga inte är inställd) är att väcka alla epoll-objekt som pollar på en fd.

source: Stream socket peer closed connection or shut down writing half of connection.
pt_pt: Par de socket de fluxo fechou a ligação ou desligou a metade de escrita da ligação.
ru: Одноранговый узел сокета потока закрыл соединение или завершил запись половины соединения.
sv: Stream socket peer stängde anslutningen eller stängde av skrivande halva av anslutningen.

source: Equivalent to :const:`EPOLLIN`
pt_pt: Equivalente a :const:`EPOLLIN`
ru: Эквивалент :const:`EPOLLIN`
sv: Motsvarar :const:`EPOLLIN`

source: Priority data band can be read.
pt_pt: Banda de dados prioritários pode ser lida.
ru: Полоса приоритетных данных может быть прочитана.
sv: Prioriterat databand kan läsas.

source: Equivalent to :const:`EPOLLOUT`
pt_pt: Equivalente a :const:`EPOLLOUT`
ru: Эквивалент :const:`EPOLLOUT`
sv: Motsvarar :const:`EPOLLOUT`

source: Priority data may be written.
pt_pt: Dados prioritários podem ser escritos.
ru: Могут быть записаны приоритетные данные.
sv: Prioriterad data kan skrivas.

source: Ignored.
pt_pt: Ignorado.
ru: Игнорируется.
sv: Ignorerad.

source: Prevents sleep during event waiting.
pt_pt: Impede o sono durante a espera de eventos.
sv: Förhindrar sömn under väntan på händelse.

source: :const:`EPOLLEXCLUSIVE` was added. It's only supported by Linux Kernel 4.5 or later.
pt_pt: :const:`EPOLLEXCLUSIVE` foi adicionado. É suportado apenas pelo Kernel Linux 4.5 ou posterior.
ru: :const:`EPOLLEXCLUSIVE` был добавлен. Он поддерживается только Linux Kernel 4.5 или более поздней версии.
sv: :const:`EPOLLEXCLUSIVE` lades till. Det stöds endast av Linux Kernel 4.5 eller senare.

source: :const:`EPOLLWAKEUP` was added. It's only supported by Linux Kernel 3.5 or later.
pt_pt: :const:`EPOLLWAKEUP` foi adicionado. É suportado apenas pelo Kernel Linux 3.5 ou posterior.
sv: :const:`EPOLLWAKEUP` har lagts till. Det stöds endast av Linux Kernel 3.5 eller senare.

source: Close the control file descriptor of the epoll object.
pt_pt: Fecha o descritor de ficheiro de controlo do objeto epoll.
ru: Закройте дескриптор управляющего файла объекта epoll.
sv: Stäng kontrollfilens deskriptor för epoll-objektet.

source: ``True`` if the epoll object is closed.
pt_pt: ``True`` se o objeto epoll estiver fechado.
ru: ``True``, если объект epoll закрыт.
sv: ``True`` om epoll-objektet är stängt.

source: Return the file descriptor number of the control fd.
pt_pt: Retorna o número do descritor de ficheiro do fd de controlo.
ru: Возвращает номер файлового дескриптора управляющего fd.
sv: Returnera filbeskrivningsnumret för kontrollen fd.

source: Create an epoll object from a given file descriptor.
pt_pt: Cria um objeto epoll a partir de um descritor de ficheiro dado.
ru: Создайте объект epoll из заданного файлового дескриптора.
sv: Skapa ett epoll-objekt från en given filbeskrivare.

source: Register a fd descriptor with the epoll object.
pt_pt: Regista um descritor fd com o objeto epoll.
ru: Зарегистрируйте дескриптор fd с объектом epoll.
sv: Registrera en fd-descriptor med epoll-objektet.

source: Modify a registered file descriptor.
pt_pt: Modifica um descritor de ficheiro registado.
ru: Измените зарегистрированный дескриптор файла.
sv: Ändra en registrerad filbeskrivare.

source: Remove a registered file descriptor from the epoll object.
pt_pt: Remove um descritor de ficheiro registado do objeto epoll.
ru: Удалите зарегистрированный файловый дескриптор из объекта epoll.
sv: Ta bort en registrerad filbeskrivare från epoll-objektet.

source: The method no longer ignores the :data:`~errno.EBADF` error.
pt_pt: O método já não ignora o erro :data:`~errno.EBADF`.
ru: Метод больше не игнорирует ошибку :data:`~errno.EBADF`.
sv: Metoden ignorerar inte längre :data:`~errno.EBADF`\-felet.

source: Wait for events. timeout in seconds (float)
pt_pt: Aguarda por eventos. tempo limite em segundos (float)
ru: Ждите событий. таймаут в секундах (с плавающей запятой)
sv: Vänta på händelser. timeout i sekunder (float)

source: Polling Objects
pt_pt: Objetos de Sondagem
ru: Объекты опроса
sv: Avstämningsobjekt

source: The :c:func:`!poll` system call, supported on most Unix systems, provides better scalability for network servers that service many, many clients at the same time. :c:func:`!poll` scales better because the system call only requires listing the file descriptors of interest, while :c:func:`!select` builds a bitmap, turns on bits for the fds of interest, and then afterward the whole bitmap has to be linearly scanned again. :c:func:`!select` is *O*\ (*highest file descriptor*), while :c:func:`!poll` is *O*\ (*number of file descriptors*).
pt_pt: A chamada de sistema :c:func:`!poll`, suportada na maioria dos sistemas Unix, fornece melhor escalabilidade para servidores de rede que servem muitos clientes ao mesmo tempo. :c:func:`!poll` escala melhor porque a chamada de sistema requer apenas a listagem dos descritores de ficheiros de interesse, enquanto :c:func:`!select` constrói um bitmap, ativa bits para os fds de interesse, e depois todo o bitmap tem de ser novamente analisado linearmente. :c:func:`!select` é *O*\ (*descritor de ficheiro mais alto*), enquanto :c:func:`!poll` é *O*\ (*número de descritores de ficheiros*).
ru: Системный вызов :c:func:`!poll`, поддерживаемый большинством систем Unix, обеспечивает лучшую масштабируемость сетевых серверов, которые обслуживают множество клиентов одновременно. :c:func:`!poll` масштабируется лучше, потому что системный вызов требует только перечисления интересующих файловых дескрипторов, а :c:func:`!select` строит растровое изображение, включает биты для интересующих файловых файлов, а затем после этого все растровое изображение необходимо снова линейно сканировать. :c:func:`!select` — это *O*\ (*самый высокий файловый дескриптор*), а :c:func:`!poll` — это *O*\ (*количество файловых дескрипторов*).
sv: Systemanropet :c:func:`!poll`, som stöds av de flesta Unix-system, ger bättre skalbarhet för nätverksservrar som betjänar många, många klienter samtidigt. :c:func:`!poll` skalar bättre eftersom systemanropet bara behöver lista de filbeskrivare som är av intresse, medan :c:func:`!select` bygger upp en bitmapp, slår på bitar för de intressanta filerna och sedan måste hela bitmappen skannas linjärt igen. :c:func:`!select` är *O*\ (*högsta filbeskrivare*), medan :c:func:`!poll` är *O*\ (*antal filbeskrivare*).

source: *eventmask* is an optional bitmask describing the type of events you want to check for, and can be a combination of the constants :const:`POLLIN`, :const:`POLLPRI`, and :const:`POLLOUT`, described in the table below. If not specified, the default value used will check for all 3 types of events.
pt_pt: *eventmask* é uma máscara de bits opcional que descreve o tipo de eventos que deseja verificar e pode ser uma combinação das constantes :const:`POLLIN`, :const:`POLLPRI` e :const:`POLLOUT`, descritas na tabela abaixo. Se não for especificado, o valor predefinido usado verificará os 3 tipos de eventos.
ru: *eventmask* — это необязательная битовая маска, описывающая тип событий, которые вы хотите проверить, и может представлять собой комбинацию констант :const:`POLLIN`, :const:`POLLPRI` и :const:`POLLOUT`, описанных в разделе таблицу ниже. Если не указано, используемое значение по умолчанию будет проверять все три типа событий.
sv: *eventmask* är en valfri bitmask som beskriver vilken typ av händelser du vill kontrollera för och kan vara en kombination av konstanterna :const:`POLLIN`, :const:`POLLPRI` och :const:`POLLOUT`, som beskrivs i tabellen nedan. Om inget anges kommer standardvärdet att användas för att kontrollera alla 3 typerna av händelser.

source: There is data to read
pt_pt: Existem dados para ler
ru: Есть данные для чтения
sv: Det finns data att läsa

source: There is urgent data to read
pt_pt: Existem dados urgentes para ler
ru: Есть данные для чтения
sv: Det finns brådskande uppgifter att läsa

source: Ready for output: writing will not block
pt_pt: Pronto para saída: a escrita não bloqueará
ru: Готово к выводу: запись не будет блокироваться
sv: Klar för utmatning: skrivning blockeras inte

source: Error condition of some sort
pt_pt: Condição de erro de algum tipo
ru: Какая-то ошибка
sv: Feltillstånd av något slag

source: Hung up
pt_pt: Desligado
sv: Hängde upp

source: Stream socket peer closed connection, or shut down writing half of connection
pt_pt: Par de socket de fluxo fechou a ligação ou desligou a metade de escrita da ligação
ru: Одноранговый узел сокета потока закрыл соединение или отключил запись половины соединения
sv: Stream socket peer stängde anslutningen, eller stängde av skrivande halva av anslutningen

source: Invalid request: descriptor not open
pt_pt: Pedido inválido: descritor não aberto
ru: Неверный запрос: дескриптор не открыт
sv: Ogiltig begäran: descriptorn är inte öppen

source: Registering a file descriptor that's already registered is not an error, and has the same effect as registering the descriptor exactly once.
pt_pt: Registar um descritor de ficheiro que já está registado não é um erro e tem o mesmo efeito que registar o descritor exatamente uma vez.
ru: Регистрация уже зарегистрированного дескриптора файла не является ошибкой и имеет тот же эффект, что и регистрация дескриптора ровно один раз.
sv: Att registrera en filbeskrivare som redan är registrerad är inte ett fel, och har samma effekt som att registrera beskrivaren exakt en gång.

source: Modifies an already registered fd. This has the same effect as ``register(fd, eventmask)``. Attempting to modify a file descriptor that was never registered causes an :exc:`OSError` exception with errno :const:`ENOENT` to be raised.
pt_pt: Modifica um fd já registado. Isto tem o mesmo efeito que ``register(fd, eventmask)``. Tentar modificar um descritor de ficheiro que nunca foi registado causa uma exceção :exc:`OSError` com errno :const:`ENOENT` a ser levantada.
ru: Изменяет уже зарегистрированный fd. Это имеет тот же эффект, что и ``register(fd, eventmask)``. Попытка изменить файловый дескриптор, который никогда не был зарегистрирован, приводит к возникновению исключения :exc:`OSError` с ошибкой :const:`ENOENT`.
sv: Ändrar en redan registrerad fd. Detta har samma effekt som ``register(fd, eventmask)``. Försök att modifiera en filbeskrivare som aldrig registrerats orsakar ett :exc:`OSError` undantag med errno :const:`ENOENT`.

source: Attempting to remove a file descriptor that was never registered causes a :exc:`KeyError` exception to be raised.
pt_pt: Tentar remover um descritor de ficheiro que nunca foi registado causa uma exceção :exc:`KeyError` a ser levantada.
ru: Попытка удалить файловый дескриптор, который никогда не был зарегистрирован, приводит к возникновению исключения :exc:`KeyError`.
sv: Försök att ta bort en filbeskrivare som aldrig registrerats orsakar ett :exc:`KeyError` undantag.
