Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/select.po
Languages: pt_pt, ru, sv

source: :mod:`!select` --- Waiting for I/O completion
pt_pt: :mod:`!select` --- Aguardar a conclusão de E/S
sv: :mod:`!select` --- Väntar på att I/O ska slutföras

source: This module provides access to the :c:func:`!select` and :c:func:`!poll` functions available in most operating systems, :c:func:`!devpoll` available on Solaris and derivatives, :c:func:`!epoll` available on Linux 2.5+ and :c:func:`!kqueue` available on most BSD. Note that on Windows, it only works for sockets; on other operating systems, it also works for other file types (in particular, on Unix, it works on pipes). It cannot be used on regular files to determine whether a file has grown since it was last read.
pt_pt: Este módulo fornece acesso às funções :c:func:`!select` e :c:func:`!poll` disponíveis na maioria dos sistemas operativos, :c:func:`!devpoll` disponível no Solaris e derivados, :c:func:`!epoll` disponível no Linux 2.5+ e :c:func:`!kqueue` disponível na maioria dos BSD. Note que no Windows, funciona apenas para sockets; noutros sistemas operativos, também funciona para outros tipos de ficheiros (em particular, no Unix, funciona em pipes). Não pode ser usado em ficheiros regulares para determinar se um ficheiro cresceu desde a última leitura.
ru: Этот модуль обеспечивает доступ к функциям :c:func:`!select` и :c:func:`!poll`, доступным в большинстве операционных систем, :c:func:`!devpoll`, доступным в Solaris и его производных, :c: func:`!epoll` доступен в Linux 2.5+ и :c:func:`!kqueue` доступен в большинстве BSD. Обратите внимание, что в Windows это работает только для сокетов; в других операционных системах он также работает и для других типов файлов (в частности, в Unix он работает с каналами). Его нельзя использовать для обычных файлов, чтобы определить, увеличился ли файл с момента его последнего чтения.
sv: Den här modulen ger tillgång till funktionerna :c:func:`!select` och :c:func:`!poll` som finns i de flesta operativsystem, :c:func:`!devpoll` som finns på Solaris och derivat, :c:func:`!epoll` som finns på Linux 2.5+ och :c:func:`!kqueue` som finns på de flesta BSD. Observera att på Windows fungerar det bara för sockets; på andra operativsystem fungerar det även för andra filtyper (i synnerhet på Unix fungerar det på pipes). Det kan inte användas på vanliga filer för att avgöra om en fil har vuxit sedan den senast lästes.

source: The :mod:`selectors` module allows high-level and efficient I/O multiplexing, built upon the :mod:`select` module primitives. Users are encouraged to use the :mod:`selectors` module instead, unless they want precise control over the OS-level primitives used.
pt_pt: O módulo :mod:`selectors` permite multiplexação de E/S de alto nível e eficiente, construída sobre os primitivos do módulo :mod:`select`. Os utilizadores são incentivados a usar o módulo :mod:`selectors` em vez disso, a menos que pretendam um controlo preciso sobre as primitivas de nível de SO usadas.
ru: Модуль :mod:`selectors` обеспечивает высокоуровневое и эффективное мультиплексирование ввода-вывода, основанное на примитивах модуля :mod:`select`. Пользователям рекомендуется использовать вместо этого модуль :mod:`selectors`, если только им не нужен точный контроль над используемыми примитивами уровня ОС.
sv: Modulen :mod:`selectors` möjliggör effektiv I/O-multiplexering på hög nivå och bygger på primitiverna i modulen :mod:`select`. Användare uppmanas att använda modulen :mod:`selectors` i stället, om de inte vill ha exakt kontroll över de primitiver på OS-nivå som används.

source: Availability
pt_pt: Disponibilidade
sv: Tillgänglighet

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_pt: Este módulo não funciona ou não está disponível em WebAssembly. Consulte :ref:`wasm-availability` para mais informações.
sv: Den här modulen fungerar inte eller är inte tillgänglig på WebAssembly. Se :ref:`wasm-availability` för mer information.

source: The module defines the following:
pt_pt: O módulo define o seguinte:
ru: Модуль определяет следующее:
sv: Modulen definierar följande:

source: A deprecated alias of :exc:`OSError`.
pt_pt: Um alias obsoleto de :exc:`OSError`.
ru: Устаревший псевдоним :exc:`OSError`.
sv: Ett föråldrat alias för :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
pt_pt: Seguindo a :pep:`3151`, esta classe tornou-se um alias de :exc:`OSError`.
ru: После :pep:`3151` этому классу был присвоен псевдоним :exc:`OSError`.
sv: Efter :pep:`3151` gjordes denna klass till ett alias för :exc:`OSError`.

source: (Only supported on Solaris and derivatives.) Returns a ``/dev/poll`` polling object; see section :ref:`devpoll-objects` below for the methods supported by devpoll objects.
pt_pt: (Apenas suportado no Solaris e derivados.) Retorna um objeto de sondagem ``/dev/poll``; consulte a secção :ref:`devpoll-objects` abaixo para os métodos suportados pelos objetos devpoll.
ru: (Поддерживается только в Solaris и его производных.) Возвращает объект опроса ``/dev/poll``; см. раздел :ref:`devpoll-objects` ниже для получения информации о методах, поддерживаемых объектами devpoll.
sv: (Stöds endast på Solaris och derivat.) Returnerar ett ``/dev/poll`` polling-objekt; se avsnitt :ref:`devpoll-objects` nedan för de metoder som stöds av devpoll-objekt.

source: :c:func:`!devpoll` objects are linked to the number of file descriptors allowed at the time of instantiation. If your program reduces this value, :c:func:`!devpoll` will fail. If your program increases this value, :c:func:`!devpoll` may return an incomplete list of active file descriptors.
pt_pt: Os objetos :c:func:`!devpoll` estão ligados ao número de descritores de ficheiros permitidos no momento da instanciação. Se o seu programa reduzir este valor, :c:func:`!devpoll` falhará. Se o seu programa aumentar este valor, :c:func:`!devpoll` pode retornar uma lista incompleta de descritores de ficheiros ativos.
ru: Объекты :c:func:`!devpoll` связаны с количеством файловых дескрипторов, разрешенных на момент создания экземпляра. Если ваша программа уменьшит это значение, :c:func:`!devpoll` завершится ошибкой. Если ваша программа увеличивает это значение, :c:func:`!devpoll` может вернуть неполный список активных файловых дескрипторов.
sv: :c:func:`!devpoll`\-objekt är kopplade till det antal filbeskrivare som är tillåtna vid instantiering. Om ditt program minskar detta värde kommer :c:func:`!devpoll` att misslyckas. Om ditt program ökar detta värde kan :c:func:`!devpoll` returnera en ofullständig lista över aktiva filbeskrivare.

source: The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
pt_pt: O novo descritor de ficheiro é :ref:`não herdável <fd_inheritance>`.
ru: Новый файловый дескриптор :ref:`non-inheritable <fd_inheritance>`.
sv: Den nya filbeskrivaren är :ref:`icke-ärftlig <fd_inheritance>`.

source: The new file descriptor is now non-inheritable.
pt_pt: O novo descritor de ficheiro é agora não herdável.
ru: Новый дескриптор файла теперь не наследуется.
sv: Den nya filbeskrivaren är nu inte ärftlig.

source: (Only supported on Linux 2.5.44 and newer.) Return an edge polling object, which can be used as Edge or Level Triggered interface for I/O events.
pt_pt: (Apenas suportado no Linux 2.5.44 e mais recente.) Retorna um objeto de sondagem de borda, que pode ser usado como interface Edge ou Level Triggered para eventos de E/S.
ru: (Поддерживается только в Linux 2.5.44 и более поздних версиях.) Возвращает объект опроса Edge, который можно использовать в качестве интерфейса Edge или Level Triggered для событий ввода-вывода.
sv: (Stöds endast av Linux 2.5.44 och senare.) Returnerar ett Edge Polling-objekt, som kan användas som Edge- eller Level Triggered-gränssnitt för I/O-händelser.

source: *sizehint* informs epoll about the expected number of events to be registered. It must be positive, or ``-1`` to use the default. It is only used on older systems where :c:func:`!epoll_create1` is not available; otherwise it has no effect (though its value is still checked).
pt_pt: *sizehint* informa o epoll sobre o número esperado de eventos a serem registados. Deve ser positivo, ou ``-1`` para usar o predefinido. É usado apenas em sistemas mais antigos onde :c:func:`!epoll_create1` não está disponível; caso contrário, não tem efeito (embora o seu valor ainda seja verificado).
ru: *sizehint* сообщает epoll об ожидаемом количестве событий, которые необходимо зарегистрировать. Оно должно быть положительным или ``-1``, чтобы использовать значение по умолчанию. Он используется только в старых системах, где :c:func:`!epoll_create1` недоступен; в противном случае он не имеет никакого эффекта (хотя его значение все равно проверяется).
sv: *sizehint* informerar epoll om det förväntade antalet händelser som ska registreras. Den måste vara positiv, eller ``\-1`` för att använda standardvärdet. Den används endast på äldre system där :c:func:`!epoll_create1` inte är tillgänglig; annars har den ingen effekt (även om dess värde fortfarande kontrolleras).

source: *flags* is deprecated and completely ignored. However, when supplied, its value must be ``0`` or ``select.EPOLL_CLOEXEC``, otherwise ``OSError`` is raised.
pt_pt: *flags* está obsoleto e é completamente ignorado. No entanto, quando fornecido, o seu valor deve ser ``0`` ou ``select.EPOLL_CLOEXEC``, caso contrário, é levantado um ``OSError``.
ru: *flags* устарел и полностью игнорируется. Однако, если оно указано, его значение должно быть ``0`` или ``select.EPOLL_CLOEXEC``, в противном случае возникает ``OSError``.
sv: *flags* är föråldrad och ignoreras helt. Men när den anges måste dess värde vara ``0`` eller ``select.EPOLL_CLOEXEC``, annars uppstår ``OSError``.

source: See the :ref:`epoll-objects` section below for the methods supported by epolling objects.
pt_pt: Consulte a secção :ref:`epoll-objects` abaixo para os métodos suportados pelos objetos epoll.
ru: См. раздел :ref:`epoll-objects` ниже, где описаны методы, поддерживаемые объектами epoll.
sv: Se avsnittet :ref:`epoll-objects` nedan för de metoder som stöds av epolling-objekt.

source: ``epoll`` objects support the context management protocol: when used in a :keyword:`with` statement, the new file descriptor is automatically closed at the end of the block.
pt_pt: Os objetos ``epoll`` suportam o protocolo de gestão de contexto: quando usados numa instrução :keyword:`with`, o novo descritor de ficheiro é fechado automaticamente no final do bloco.
ru: Объекты ``epoll`` поддерживают протокол управления контекстом: при использовании в операторе :keyword:`with` новый дескриптор файла автоматически закрывается в конце блока.
sv: ``epoll``\ -objekt stöder protokollet för kontexthantering: när de används i en :keyword:`with`\-sats stängs den nya filbeskrivaren automatiskt i slutet av blocket.

source: Added the *flags* parameter.
pt_pt: Adicionado o parâmetro *flags*.
ru: Добавлен параметр *flags*.
sv: Parametern *flags* har lagts till.

source: Support for the :keyword:`with` statement was added. The new file descriptor is now non-inheritable.
pt_pt: Foi adicionado suporte para a instrução :keyword:`with`. O novo descritor de ficheiro é agora não herdável.
ru: Добавлена ​​поддержка оператора :keyword:`with`. Новый дескриптор файла теперь не наследуется.
sv: Stöd för :keyword:`with`\-satsen har lagts till. Den nya filbeskrivaren är nu inte ärftlig.

source: The *flags* parameter. ``select.EPOLL_CLOEXEC`` is used by default now. Use :func:`os.set_inheritable` to make the file descriptor inheritable.
pt_pt: O parâmetro *flags*. ``select.EPOLL_CLOEXEC`` é usado por predefinição agora. Use :func:`os.set_inheritable` para tornar o descritor de ficheiro herdável.
ru: Параметр *flags*. ``select.EPOLL_CLOEXEC`` теперь используется по умолчанию. Используйте :func:`os.set_inheritable`, чтобы сделать дескриптор файла наследуемым.
sv: Parametern *flags*. ``select.EPOLL_CLOEXEC`` används som standard nu. Använd :func:`os.set_inheritable` för att göra filbeskrivaren ärftlig.

source: (Not supported by all operating systems.) Returns a polling object, which supports registering and unregistering file descriptors, and then polling them for I/O events; see section :ref:`poll-objects` below for the methods supported by polling objects.
pt_pt: (Não suportado por todos os sistemas operativos.) Retorna um objeto de sondagem, que suporta o registo e cancelamento de registo de descritores de ficheiros, e depois a sondagem destes para eventos de E/S; consulte a secção :ref:`poll-objects` abaixo para os métodos suportados pelos objetos de sondagem.
ru: (Поддерживается не всеми операционными системами.) Возвращает объект опроса, который поддерживает регистрацию и отмену регистрации файловых дескрипторов, а затем опрос их на предмет событий ввода-вывода; см. раздел :ref:`poll-objects` ниже, чтобы узнать о методах, поддерживаемых объектами опроса.
sv: (Stöds inte av alla operativsystem.) Returnerar ett polling-objekt, som stöder registrering och avregistrering av filbeskrivare och sedan polling av dem för I/O-händelser; se avsnitt :ref:`poll-objects` nedan för de metoder som stöds av polling-objekt.

source: (Only supported on BSD.) Returns a kernel queue object; see section :ref:`kqueue-objects` below for the methods supported by kqueue objects.
pt_pt: (Apenas suportado em BSD.) Retorna um objeto de fila do kernel; consulte a secção :ref:`kqueue-objects` abaixo para os métodos suportados pelos objetos kqueue.
ru: (Поддерживается только в BSD.) Возвращает объект очереди ядра; см. раздел :ref:`kqueue-objects` ниже, чтобы узнать о методах, поддерживаемых объектами kqueue.
sv: (Stöds endast på BSD.) Returnerar ett kernel queue-objekt; se avsnitt :ref:`kqueue-objects` nedan för de metoder som stöds av kqueue-objekt.

source: (Only supported on BSD.) Returns a kernel event object; see section :ref:`kevent-objects` below for the methods supported by kevent objects.
pt_pt: (Apenas suportado em BSD.) Retorna um objeto de evento do kernel; consulte a secção :ref:`kevent-objects` abaixo para os métodos suportados pelos objetos kevent.
ru: (Поддерживается только в BSD.) Возвращает объект события ядра; см. раздел :ref:`kevent-objects` ниже, чтобы узнать о методах, поддерживаемых объектами kevent.
sv: (Stöds endast på BSD.) Returnerar ett kernel event-objekt; se avsnitt :ref:`kevent-objects` nedan för de metoder som stöds av kevent-objekt.

source: This is a straightforward interface to the Unix :c:func:`!select` system call. The first three arguments are iterables of 'waitable objects': either integers representing file descriptors or objects with a parameterless method named :meth:`~io.IOBase.fileno` returning such an integer:
pt_pt: Esta é uma interface direta para a chamada de sistema Unix :c:func:`!select`. Os três primeiros argumentos são iteráveis de 'objetos aguardáveis': ou inteiros representando descritores de ficheiros ou objetos com um método sem parâmetros chamado :meth:`~io.IOBase.fileno` que retorna tal inteiro:
ru: Это простой интерфейс к системному вызову Unix :c:func:`!select`. Первые три аргумента являются итерациями «ожидаемых объектов»: либо целыми числами, представляющими файловые дескрипторы, либо объектами с методом без параметров с именем :meth:`~io.IOBase.fileno`, возвращающим такое целое число:
sv: Detta är ett enkelt gränssnitt till Unix :c:func:`!select` systemanrop. De tre första argumenten är iterabler av "väntande objekt": antingen heltal som representerar filbeskrivare eller objekt med en parameterlös metod med namnet :meth:`~io.IOBase.fileno` som returnerar ett sådant heltal:

source: *rlist*: wait until ready for reading
pt_pt: *rlist*: aguardar até estar pronto para leitura
ru: *rlist*: подождите, пока будете готовы к чтению
sv: *rlist*: vänta tills den är klar för läsning

source: *wlist*: wait until ready for writing
pt_pt: *wlist*: aguardar até estar pronto para escrita
ru: *wlist*: подожди, пока будешь готов к написанию
sv: *wlist*: vänta tills den är klar för skrivning

source: *xlist*: wait for an "exceptional condition" (see the manual page for what your system considers such a condition)
pt_pt: *xlist*: aguardar por uma "condição excepcional" (consulte a página do manual para saber o que o seu sistema considera como tal condição)
ru: *xlist*: дождитесь «исключительного состояния» (см. страницу руководства, чтобы узнать, что ваша система считает таким условием)
sv: *xlist*: vänta på ett "exceptionellt tillstånd" (se manualsidan för vad ditt system anser vara ett sådant tillstånd)

source: The return value is a triple of lists of objects that are ready: subsets of the first three arguments. When the time-out is reached without a file descriptor becoming ready, three empty lists are returned.
pt_pt: O valor de retorno é um triplo de listas de objetos que estão prontos: subconjuntos dos três primeiros argumentos. Quando o tempo limite é atingido sem que nenhum descritor de ficheiro fique pronto, três listas vazias são retornadas.
ru: Возвращаемое значение представляет собой тройку списков готовых объектов: подмножества первых трех аргументов. Когда тайм-аут истекает, а файловый дескриптор не готов, возвращаются три пустых списка.
sv: Returvärdet är en trippel av listor med objekt som är klara: delmängder av de tre första argumenten. När tidsgränsen nås utan att en filbeskrivare har blivit klar returneras tre tomma listor.

source: Among the acceptable object types in the iterables are Python :term:`file objects <file object>` (e.g. ``sys.stdin``, or objects returned by :func:`open` or :func:`os.popen`), socket objects returned by :func:`socket.socket`. You may also define a :dfn:`wrapper` class yourself, as long as it has an appropriate :meth:`~io.IOBase.fileno` method (that really returns a file descriptor, not just a random integer).
pt_pt: Entre os tipos de objetos aceitáveis nos iteráveis estão os objetos :term:`ficheiro <file object>` do Python (por exemplo, ``sys.stdin``, ou objetos retornados por :func:`open` ou :func:`os.popen`), objetos socket retornados por :func:`socket.socket`. Também pode definir uma classe :dfn:`wrapper` você mesmo, desde que tenha um método :meth:`~io.IOBase.fileno` apropriado (que realmente retorne um descritor de ficheiro, não apenas um inteiro aleatório).
ru: Среди допустимых типов объектов в итерациях есть Python :term:`file object <file object>` (например, ``sys.stdin`` или объекты, возвращаемые :func:`open` или :func:`os.popen` ), объекты сокетов, возвращаемые :func:`socket.socket`. Вы также можете определить класс :dfn:`wrapper` самостоятельно, если у него есть соответствующий метод :meth:`~io.IOBase.fileno` (который действительно возвращает дескриптор файла, а не просто случайное целое число).
sv: Bland de acceptabla objekttyperna i iterablerna finns Python :term:`filobjekt <file object>` (t.ex. ``sys.stdin``, eller objekt som returneras av :func:`open` eller :func:`os.popen`), socketobjekt som returneras av :func:`socket.socket`. Du kan också definiera en :dfn:`wrapper`\-klass själv, så länge den har en lämplig :meth:`~io.IOBase.fileno`\-metod (som verkligen returnerar en filbeskrivare, inte bara ett slumpmässigt heltal).

source: File objects on Windows are not acceptable, but sockets are. On Windows, the underlying :c:func:`!select` function is provided by the WinSock library, and does not handle file descriptors that don't originate from WinSock.
pt_pt: Objetos de ficheiro no Windows não são aceitáveis, mas sockets são. No Windows, a função subjacente :c:func:`!select` é fornecida pela biblioteca WinSock, e não lida com descritores de ficheiros que não se originam do WinSock.
ru: Файловые объекты в Windows неприемлемы, а сокеты — допустимы. В Windows базовая функция :c:func:`!select` предоставляется библиотекой WinSock и не обрабатывает дескрипторы файлов, не происходящие из WinSock.
sv: Filobjekt på Windows är inte acceptabla, men sockets är det. I Windows tillhandahålls den underliggande funktionen :c:func:`!select` av WinSock-biblioteket och hanterar inte filbeskrivare som inte kommer från WinSock.

source: The function is now retried with a recomputed timeout when interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
pt_pt: A função é agora repetida com um tempo limite recalculado quando interrompida por um sinal, exceto se o manipulador de sinal levantar uma exceção (consulte :pep:`475` para a justificação), em vez de levantar :exc:`InterruptedError`.
ru: Функция теперь повторяется с перерасчетным таймаутом при прерывании сигналом, за исключением случаев, когда обработчик сигнала вызывает исключение (обоснование см. в :pep:`475`), вместо вызова :exc:`InterruptedError`.
sv: Funktionen försöker nu igen med en omräknad timeout när den avbryts av en signal, utom om signalhanteraren gör ett undantag (se :pep:`475` för motiveringen), istället för att göra :exc:`InterruptedError`.

source: The minimum number of bytes which can be written without blocking to a pipe when the pipe has been reported as ready for writing by :func:`~select.select`, :func:`!poll` or another interface in this module. This doesn't apply to other kind of file-like objects such as sockets.
pt_pt: O número mínimo de bytes que podem ser escritos sem bloqueio para um pipe quando o pipe foi reportado como pronto para escrita por :func:`~select.select`, :func:`!poll` ou outra interface neste módulo. Isto não se aplica a outros tipos de objetos tipo ficheiro, como sockets.
ru: Минимальное количество байтов, которые могут быть записаны в канал без блокировки, когда канал сообщается о готовности к записи с помощью :func:`~select.select`, :func:`!poll` или другого интерфейса в этом модуле. Это не относится к другим типам файловых объектов, таким как сокеты.
sv: Det minsta antalet byte som kan skrivas utan blockering till en pipe när pipen har rapporterats som klar för skrivning av :func:`~select.select`, :func:`!poll` eller ett annat gränssnitt i denna modul. Detta gäller inte för andra filliknande objekt som t.ex. sockets.

source: This value is guaranteed by POSIX to be at least 512.
pt_pt: Este valor é garantido pelo POSIX como sendo pelo menos 512.
ru: POSIX гарантирует, что это значение будет не ниже 512.
sv: Detta värde är garanterat av POSIX att vara minst 512.

source: ``/dev/poll`` Polling Objects
pt_pt: Objetos de Sondagem ``/dev/poll``
ru: Объекты опроса ``/dev/poll``

source: Solaris and derivatives have ``/dev/poll``. While :c:func:`!select` is *O*\ (*highest file descriptor*) and :c:func:`!poll` is *O*\ (*number of file descriptors*), ``/dev/poll`` is *O*\ (*active file descriptors*).
pt_pt: O Solaris e derivados têm ``/dev/poll``. Enquanto :c:func:`!select` é *O*\ (*descritor de ficheiro mais alto*) e :c:func:`!poll` é *O*\ (*número de descritores de ficheiros*), ``/dev/poll`` é *O*\ (*descritores de ficheiros ativos*).
ru: Solaris и его производные имеют ``/dev/poll``. В то время как :c:func:`!select` имеет значение *O*\ (*самый высокий файловый дескриптор*), а :c:func:`!poll` имеет значение *O*\ (*количество файловых дескрипторов*), ``/dev /poll`` — это *O*\ (*активные файловые дескрипторы*).
sv: Solaris och dess derivat har ``/dev/poll``. Medan :c:func:`!select` är *O*\ (*högsta filbeskrivare*) och :c:func:`!poll` är *O*\ (*antal filbeskrivare*), är ``/dev/poll`` *O*\ (*aktiva filbeskrivare*).

source: ``/dev/poll`` behaviour is very close to the standard :c:func:`!poll` object.
pt_pt: O comportamento de ``/dev/poll`` é muito próximo do objeto :c:func:`!poll` padrão.
ru: Поведение ``/dev/poll`` очень близко к стандартному объекту :c:func:`!poll`.
sv: ``/dev/poll`` beteende är mycket nära standard :c:func:`!poll` objektet.
