Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/select.po
Languages: pt_pt, ru, sv

source: Polls the set of registered file descriptors, and returns a possibly empty list containing ``(fd, event)`` 2-tuples for the descriptors that have events or errors to report. *fd* is the file descriptor, and *event* is a bitmask with bits set for the reported events for that descriptor --- :const:`POLLIN` for waiting input, :const:`POLLOUT` to indicate that the descriptor can be written to, and so forth. An empty list indicates that the call timed out and no file descriptors had any events to report. If *timeout* is given, it specifies the length of time in milliseconds which the system will wait for events before returning. If *timeout* is omitted, negative, or :const:`None`, the call will block until there is an event for this poll object.
pt_pt: Sonda o conjunto de descritores de ficheiros registados e retorna uma lista possivelmente vazia contendo tuplos ``(fd, event)`` para os descritores que têm eventos ou erros para reportar. *fd* é o descritor de ficheiro e *event* é uma máscara de bits com bits definidos para os eventos reportados para esse descritor --- :const:`POLLIN` para entrada em espera, :const:`POLLOUT` para indicar que o descritor pode ser escrito, e assim por diante. Uma lista vazia indica que a chamada expirou e nenhum descritor de ficheiro tinha eventos para reportar. Se *timeout* for fornecido, especifica o comprimento do tempo em milissegundos que o sistema aguardará por eventos antes de retornar. Se *timeout* for omitido, negativo, ou :const:`None`, a chamada bloqueará até que haja um evento para este objeto de sondagem.
ru: Опрашивает набор зарегистрированных файловых дескрипторов и возвращает, возможно, пустой список, содержащий двухкортежи ``(fd, event)`` для дескрипторов, у которых есть события или ошибки, о которых необходимо сообщить. *fd* — это дескриптор файла, а *event* — это битовая маска с битами, установленными для сообщаемых событий для этого дескриптора --- :const:`POLLIN` для ожидания ввода, :const:`POLLOUT` для указания того, что дескриптор может быть записанным и так далее. Пустой список означает, что время ожидания вызова истекло и ни у одного файлового дескриптора не было событий, о которых можно было бы сообщить. Если задано значение *timeout*, оно определяет продолжительность времени в миллисекундах, в течение которого система будет ожидать событий перед возвратом. Если *timeout* опущен, имеет отрицательное значение или :const:`None`, вызов будет блокироваться до тех пор, пока не произойдет событие для этого объекта опроса.
sv: Undersöker uppsättningen av registrerade filbeskrivare och returnerar en eventuellt tom lista som innehåller ``(fd, event)`` 2-tuples för de beskrivare som har händelser eller fel att rapportera. *fd* är filbeskrivaren, och *event* är en bitmask med bitar inställda för de rapporterade händelserna för den beskrivaren --- :const:`POLLIN` för väntande inmatning, :const:`POLLOUT` för att ange att beskrivaren kan skrivas till, och så vidare. En tom lista indikerar att anropet timade ut och att inga filbeskrivare hade några händelser att rapportera. Om *timeout* anges, specificeras den tid i millisekunder som systemet ska vänta på händelser innan det återvänder. Om *timeout* utelämnas, är negativ eller :const:`None`, kommer anropet att blockeras tills det finns en händelse för detta poll-objekt.

source: Kqueue Objects
pt_pt: Objetos Kqueue
ru: Объекты Kqueue
sv: Kqueue-objekt

source: Close the control file descriptor of the kqueue object.
pt_pt: Fecha o descritor de ficheiro de controlo do objeto kqueue.
ru: Закройте дескриптор управляющего файла объекта kqueue.
sv: Stäng kontrollfilens deskriptor för kqueue-objektet.

source: ``True`` if the kqueue object is closed.
pt_pt: ``True`` se o objeto kqueue estiver fechado.
ru: ``True``, если объект kqueue закрыт.
sv: ``True`` om kqueue-objektet är stängt.

source: Create a kqueue object from a given file descriptor.
pt_pt: Cria um objeto kqueue a partir de um descritor de ficheiro dado.
ru: Создайте объект kqueue из заданного файлового дескриптора.
sv: Skapa ett kqueue-objekt från en given filbeskrivning.

source: Low level interface to kevent
pt_pt: Interface de baixo nível para kevent
ru: Низкоуровневый интерфейс для kevent
sv: Lågnivågränssnitt till kevent

source: changelist must be an iterable of kevent objects or ``None``
pt_pt: changelist deve ser um iterável de objetos kevent ou ``None``
ru: список изменений должен быть итерируемым объектом kevent или ``None``
sv: changelist måste vara en iterabel av kevent-objekt eller ``None``

source: max_events must be 0 or a positive integer
pt_pt: max_events deve ser 0 ou um inteiro positivo
ru: max_events должно быть 0 или положительное целое число.
sv: max_events måste vara 0 eller ett positivt heltal

source: timeout in seconds (floats possible); the default is ``None``, to wait forever
pt_pt: tempo limite em segundos (flutuantes possíveis); o predefinido é ``None``, para esperar para sempre
ru: таймаут в секундах (возможны плавающие значения); по умолчанию установлено значение «Нет», ждать вечно.
sv: timeout i sekunder (flytande värden är möjliga); standardvärdet är ``None``, att vänta för evigt

source: Kevent Objects
pt_pt: Objetos Kevent
ru: Объекты Kevent
sv: Kevent-objekt

source: Value used to identify the event. The interpretation depends on the filter but it's usually the file descriptor. In the constructor ident can either be an int or an object with a :meth:`~io.IOBase.fileno` method. kevent stores the integer internally.
pt_pt: Valor usado para identificar o evento. A interpretação depende do filtro, mas geralmente é o descritor de ficheiro. No construtor, ident pode ser um int ou um objeto com um método :meth:`~io.IOBase.fileno`. kevent armazena o inteiro internamente.
ru: Значение, используемое для идентификации события. Интерпретация зависит от фильтра, но обычно это дескриптор файла. В конструкторе ident может быть либо int, либо объектом с методом :meth:`~io.IOBase.fileno`. kevent хранит целое число внутри себя.
sv: Värde som används för att identifiera händelsen. Tolkningen beror på filtret men det är vanligtvis filbeskrivaren. I konstruktorn kan ident antingen vara en int eller ett objekt med en :meth:`~io.IOBase.fileno`\-metod. kevent lagrar heltalet internt.

source: Name of the kernel filter.
pt_pt: Nome do filtro do kernel.
ru: Имя фильтра ядра.
sv: Namn på kernelfiltret.

source: Takes a descriptor and returns whenever there is data available to read
pt_pt: Recebe um descritor e retorna sempre que houver dados disponíveis para leitura
ru: Принимает дескриптор и возвращает всякий раз, когда есть данные, доступные для чтения.
sv: Tar en descriptor och returnerar när det finns data tillgängliga att läsa

source: Takes a descriptor and returns whenever there is data available to write
pt_pt: Recebe um descritor e retorna sempre que houver dados disponíveis para escrita
ru: Принимает дескриптор и возвращает всякий раз, когда есть данные, доступные для записи.
sv: Tar en descriptor och returnerar när det finns data tillgängliga att skriva

source: AIO requests
pt_pt: Pedidos AIO
ru: Запросы AIO
sv: AIO-förfrågningar

source: Returns when one or more of the requested events watched in *fflag* occurs
pt_pt: Retorna quando um ou mais dos eventos solicitados observados em *fflag* ocorre
ru: Возвращается, когда происходит одно или несколько запрошенных событий, наблюдаемых в *fflag*.
sv: Returnerar när en eller flera av de begärda händelserna som bevakas i *fflag* inträffar

source: Watch for events on a process id
pt_pt: Observar eventos num id de processo
ru: Следите за событиями по идентификатору процесса
sv: Se efter händelser på ett process-ID

source: Watch for events on a network device [not available on macOS]
pt_pt: Observar eventos num dispositivo de rede [não disponível no macOS]
ru: Следите за событиями на сетевом устройстве [недоступно в macOS]
sv: Håll utkik efter händelser på en nätverksenhet [inte tillgängligt på macOS]

source: Returns whenever the watched signal is delivered to the process
pt_pt: Retorna sempre que o sinal observado é entregue ao processo
ru: Возвращается всякий раз, когда отслеживаемый сигнал доставляется в процесс.
sv: Returnerar när den bevakade signalen levereras till processen

source: Establishes an arbitrary timer
pt_pt: Estabelece um temporizador arbitrário
ru: Устанавливает произвольный таймер
sv: Upprättar en godtycklig timer

source: Filter action.
pt_pt: Ação do filtro.
ru: Действие фильтра.
sv: Filteråtgärd.

source: Adds or modifies an event
pt_pt: Adiciona ou modifica um evento
ru: Добавляет или изменяет событие
sv: Lägger till eller ändrar en händelse

source: Removes an event from the queue
pt_pt: Remove um evento da fila
ru: Удаляет событие из очереди
sv: Tar bort en händelse från kön

source: Permitscontrol() to returns the event
pt_pt: Permite que control() retorne o evento
ru: Permitscontrol() возвращает событие
sv: Tillåtercontrol() att returnera händelsen

source: Disablesevent
pt_pt: Desativa evento
ru: Отключить событие
sv: Avaktiverar händelse

source: Removes event after first occurrence
pt_pt: Remove evento após a primeira ocorrência
ru: Удаляет событие после первого появления
sv: Tar bort händelse efter första förekomsten

source: Reset the state after an event is retrieved
pt_pt: Reinicia o estado após um evento ser recuperado
ru: Сброс состояния после получения события
sv: Återställ tillståndet efter att en händelse har hämtats

source: internal event
pt_pt: evento interno
ru: внутреннее событие
sv: intern händelse

source: Filter specific EOF condition
pt_pt: Condição EOF específica do filtro
ru: Фильтровать определенное условие EOF
sv: Filterspecifikt EOF-tillstånd

source: See return values
pt_pt: Consulte os valores de retorno
ru: Посмотреть возвращаемые значения
sv: Se returvärden

source: Filter specific flags.
pt_pt: Flags específicas do filtro.
ru: Фильтровать определенные флаги.
sv: Filtrera specifika flaggor.

source: :const:`KQ_FILTER_READ` and :const:`KQ_FILTER_WRITE` filter flags:
pt_pt: Flags de filtro :const:`KQ_FILTER_READ` e :const:`KQ_FILTER_WRITE`:
ru: Флаги фильтра :const:`KQ_FILTER_READ` и :const:`KQ_FILTER_WRITE`:
sv: :const:`KQ_FILTER_READ` och :const:`KQ_FILTER_WRITE` filterflaggor:

source: low water mark of a socket buffer
pt_pt: marca de água baixa de um buffer de socket
ru: нижняя граница буфера сокета
sv: lågvattenmärke för en socketbuffert

source: :const:`KQ_FILTER_VNODE` filter flags:
pt_pt: Flags de filtro :const:`KQ_FILTER_VNODE`:
ru: Флаги фильтра :const:`KQ_FILTER_VNODE`
sv: :const:`KQ_FILTER_VNODE` filterflaggor:

source: *unlink()* was called
pt_pt: *unlink()* foi chamado
ru: Была вызвана функция *unlink()*.
sv: *unlink()* anropades

source: a write occurred
pt_pt: ocorreu uma escrita
ru: произошла запись
sv: en skrivning inträffade

source: the file was extended
pt_pt: o ficheiro foi estendido
ru: файл был расширен
sv: filen förlängdes

source: an attribute was changed
pt_pt: um atributo foi alterado
ru: атрибут был изменен
sv: ett attribut har ändrats

source: the link count has changed
pt_pt: a contagem de ligações foi alterada
ru: количество ссылок изменилось
sv: länkantalet har ändrats

source: the file was renamed
pt_pt: o ficheiro foi renomeado
ru: файл был переименован
sv: filen döptes om

source: access to the file was revoked
pt_pt: o acesso ao ficheiro foi revogado
ru: доступ к файлу закрыт
sv: åtkomst till filen återkallades

source: :const:`KQ_FILTER_PROC` filter flags:
pt_pt: Flags de filtro :const:`KQ_FILTER_PROC`:
ru: Флаги фильтра :const:`KQ_FILTER_PROC`:
sv: :const:`KQ_FILTER_PROC` filterflaggor:

source: the process has exited
pt_pt: o processo terminou
ru: процесс завершился
sv: processen har avslutats

source: the process has called *fork()*
pt_pt: o processo chamou *fork()*
ru: процесс вызвал *fork()*
sv: processen har anropat *fork()*

source: the process has executed a new process
pt_pt: o processo executou um novo processo
ru: процесс выполнил новый процесс
sv: processen har exekverat en ny process

source: internal filter flag
pt_pt: flag interna do filtro
ru: флаг внутреннего фильтра
sv: intern filterflagga

source: follow a process across *fork()*
pt_pt: seguir um processo através de *fork()*
ru: следовать процессу через *fork()*
sv: följa en process över *fork()*

source: returned on the child process for *NOTE_TRACK*
pt_pt: retornado no processo filho para *NOTE_TRACK*
ru: возвращается в дочернем процессе для *NOTE_TRACK*
sv: returneras på barnprocessen för *NOTE_TRACK*

source: unable to attach to a child
pt_pt: incapaz de anexar a um filho
ru: не могу привязаться к ребенку
sv: inte kan knyta an till ett barn

source: :const:`KQ_FILTER_NETDEV` filter flags (not available on macOS):
pt_pt: Flags de filtro :const:`KQ_FILTER_NETDEV` (não disponível no macOS):
ru: :const:`KQ_FILTER_NETDEV` флаги фильтра (недоступно в macOS):
sv: :const:`KQ_FILTER_NETDEV` filterflaggor (inte tillgängligt på macOS):

source: link is up
pt_pt: ligação está ativa
ru: ссылка открыта
sv: länken är uppe

source: link is down
pt_pt: ligação está inativa
ru: ссылка не работает
sv: länken är nere

source: link state is invalid
pt_pt: estado da ligação é inválido
ru: состояние ссылки недействительно
sv: länkstatus är ogiltig

source: Filter specific data.
pt_pt: Dados específicos do filtro.
ru: Фильтровать определенные данные.
sv: Filtrera specifika data.

source: User defined value.
pt_pt: Valor definido pelo utilizador.
ru: Значение, определяемое пользователем.
sv: Användardefinierat värde.

source: socket() (in module socket)
pt_pt: socket() (no módulo socket)
ru: сокет() (в сокете модуля)
sv: socket() (i modul socket)

source: popen() (in module os)
pt_pt: popen() (no módulo os)
sv: popen() (i modul os)

source: Empty iterables are allowed, but acceptance of three empty iterables is platform-dependent. (It is known to work on Unix but not on Windows.) The optional *timeout* argument specifies a time-out as a floating-point number in seconds. When the *timeout* argument is omitted the function blocks until at least one file descriptor is ready. A time-out value of zero specifies a poll and never blocks.
sv: Tomma iterabler är tillåtna, men acceptansen av tre tomma iterabler är plattformsberoende. (Det är känt att den fungerar på Unix men inte på Windows.) Det valfria argumentet *timeout* anger en timeout som ett flyttal i sekunder. När argumentet *timeout* utelämnas blockerar funktionen tills minst en filbeskrivare är klar. Ett timeout-värde på noll anger en poll och blockerar aldrig.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.
