Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shelve.po
Languages: ru

source: :mod:`!shelve` --- Python object persistence
ru: :mod:`!shelve` --- Сохранение объектов Python

source: **Source code:** :source:`Lib/shelve.py`
ru: **Исходный код:** :source:`Lib/shelve.py`

source: A "shelf" is a persistent, dictionary-like object. The difference with "dbm" databases is that the values (not the keys!) in a shelf can be essentially arbitrary Python objects --- anything that the :mod:`pickle` module can handle. This includes most class instances, recursive data types, and objects containing lots of shared sub-objects. The keys are ordinary strings.
ru: «Полка» — это постоянный объект, подобный словарю. Разница с базами данных «dbm» заключается в том, что значения (а не ключи!) на полке могут быть по существу произвольными объектами Python — всем, что может обрабатывать модуль :mod:`pickle`. Сюда входят большинство экземпляров классов, рекурсивные типы данных и объекты, содержащие множество общих подобъектов. Ключи представляют собой обычные струны.

source: Open a persistent dictionary. The filename specified is the base filename for the underlying database. As a side-effect, an extension may be added to the filename and more than one file may be created. By default, the underlying database file is opened for reading and writing. The optional *flag* parameter has the same interpretation as the *flag* parameter of :func:`dbm.open`.
ru: Откройте постоянный словарь. Указанное имя файла является базовым именем файла базовой базы данных. В качестве побочного эффекта к имени файла может быть добавлено расширение и может быть создано более одного файла. По умолчанию базовый файл базы данных открыт для чтения и записи. Необязательный параметр *flag* имеет ту же интерпретацию, что и параметр *flag* в :func:`dbm.open`.

source: By default, pickles created with :const:`pickle.DEFAULT_PROTOCOL` are used to serialize values. The version of the pickle protocol can be specified with the *protocol* parameter.
ru: По умолчанию пикли, созданные с помощью :const:`pickle.DEFAULT_PROTOCOL`, используются для сериализации значений. Версию протокола Pickle можно указать с помощью параметра *protocol*.

source: Because of Python semantics, a shelf cannot know when a mutable persistent-dictionary entry is modified. By default modified objects are written *only* when assigned to the shelf (see :ref:`shelve-example`). If the optional *writeback* parameter is set to ``True``, all entries accessed are also cached in memory, and written back on :meth:`~Shelf.sync` and :meth:`~Shelf.close`; this can make it handier to mutate mutable entries in the persistent dictionary, but, if many entries are accessed, it can consume vast amounts of memory for the cache, and it can make the close operation very slow since all accessed entries are written back (there is no way to determine which accessed entries are mutable, nor which ones were actually mutated).
ru: Из-за семантики Python полка не может знать, когда изменяется изменяемая запись постоянного словаря. По умолчанию измененные объекты записываются *только* при назначении на полку (см. :ref:`shelve-example`). Если для дополнительного параметра *writeback* установлено значение ``True``, все записи, к которым осуществляется доступ, также кэшируются в памяти и записываются обратно в :meth:`~Shelf.sync` и :meth:`~Shelf.close`; это может сделать более удобным изменение изменяемых записей в постоянном словаре, но если осуществляется доступ ко многим записям, это может занимать огромные объемы памяти для кеша и может сделать операцию закрытия очень медленной, поскольку все записи, к которым осуществляется доступ, записываются обратно ( невозможно определить, какие записи, к которым осуществляется доступ, являются изменяемыми, а какие действительно были изменены).

source: :const:`pickle.DEFAULT_PROTOCOL` is now used as the default pickle protocol.
ru: :const:`pickle.DEFAULT_PROTOCOL` теперь используется в качестве протокола травления по умолчанию.

source: Accepts :term:`path-like object` for filename.
ru: Принимает :term:`путеподобный объект` в качестве имени файла.

source: Do not rely on the shelf being closed automatically; always call :meth:`~Shelf.close` explicitly when you don't need it any more, or use :func:`shelve.open` as a context manager::
ru: Не полагайтесь на автоматическое закрытие полки; всегда вызывайте :meth:`~Shelf.close` явно, если он вам больше не нужен, или используйте :func:`shelve.open` в качестве менеджера контекста::

source: Because the :mod:`shelve` module is backed by :mod:`pickle`, it is insecure to load a shelf from an untrusted source. Like with pickle, loading a shelf can execute arbitrary code.
ru: Поскольку модуль :mod:`shelve` поддерживается :mod:`pickle`, загружать полку из ненадежного источника небезопасно. Как и в случае с рассолом, загрузка полки может выполнить произвольный код.

source: Shelf objects support most of methods and operations supported by dictionaries (except copying, constructors and operators ``|`` and ``|=``). This eases the transition from dictionary based scripts to those requiring persistent storage.
ru: Объекты полки поддерживают большинство методов и операций, поддерживаемых словарями (кроме копирования, конструкторов и операторов ``|``` и ``|=``). Это упрощает переход от сценариев на основе словаря к сценариям, требующим постоянного хранения.

source: Two additional methods are supported:
ru: Поддерживаются два дополнительных метода:

source: Write back all entries in the cache if the shelf was opened with *writeback* set to :const:`True`. Also empty the cache and synchronize the persistent dictionary on disk, if feasible. This is called automatically when the shelf is closed with :meth:`close`.
ru: Запишите обратно все записи в кэше, если полка была открыта с параметром *writeback*, установленным в :const:`True`. Также очистите кеш и синхронизируйте постоянный словарь на диске, если это возможно. Это вызывается автоматически, когда полка закрывается с помощью :meth:`close`.

source: Synchronize and close the persistent *dict* object. Operations on a closed shelf will fail with a :exc:`ValueError`.
ru: Синхронизируйте и закройте постоянный объект *dict*. Операции на закрытой полке завершатся ошибкой с ошибкой :exc:`ValueError`.

source: `Persistent dictionary recipe <https://code.activestate.com/recipes/576642-persistent-dict-with-multiple-standard-file-format/>`_ with widely supported storage formats and having the speed of native dictionaries.
ru: `Рецепт постоянного словаря <https://code.activestate.com/recipes/576642-persistent-dict-with-multiple-standard-file-format/>`_ с широко поддерживаемыми форматами хранения и скоростью собственных словарей.

source: Restrictions
ru: Ограничения

source: The choice of which database package will be used (such as :mod:`dbm.ndbm` or :mod:`dbm.gnu`) depends on which interface is available. Therefore it is not safe to open the database directly using :mod:`dbm`. The database is also (unfortunately) subject to the limitations of :mod:`dbm`, if it is used --- this means that (the pickled representation of) the objects stored in the database should be fairly small, and in rare cases key collisions may cause the database to refuse updates.
ru: Выбор того, какой пакет базы данных будет использоваться (например, :mod:`dbm.ndbm` или :mod:`dbm.gnu`), зависит от того, какой интерфейс доступен. Поэтому открывать базу данных напрямую с помощью :mod:`dbm` небезопасно. База данных также (к сожалению) подвержена ограничениям :mod:`dbm`, если она используется --- это означает, что (маринованное представление) объектов, хранящихся в базе данных, должно быть довольно небольшим, и в редких случаях коллизии ключей могут привести к тому, что база данных откажется от обновлений.

source: The :mod:`shelve` module does not support *concurrent* read/write access to shelved objects. (Multiple simultaneous read accesses are safe.) When a program has a shelf open for writing, no other program should have it open for reading or writing. Unix file locking can be used to solve this, but this differs across Unix versions and requires knowledge about the database implementation used.
ru: Модуль :mod:`shelve` не поддерживает *одновременный* доступ для чтения/записи к объектам на полках. (Множественные одновременные доступы для чтения безопасны.) Если в программе есть полка, открытая для записи, ни одна другая программа не должна открывать ее для чтения или записи. Для решения этой проблемы можно использовать блокировку файлов Unix, но она различается в разных версиях Unix и требует знаний об используемой реализации базы данных.

source: On macOS :mod:`dbm.ndbm` can silently corrupt the database file on updates, which can cause hard crashes when trying to read from the database.
ru: В macOS :mod:`dbm.ndbm` может незаметно повредить файл базы данных при обновлениях, что может привести к серьезным сбоям при попытке чтения из базы данных.

source: A subclass of :class:`collections.abc.MutableMapping` which stores pickled values in the *dict* object.
ru: Подкласс :class:`collections.abc.MutableMapping`, который хранит маринованные значения в объекте *dict*.

source: By default, pickles created with :const:`pickle.DEFAULT_PROTOCOL` are used to serialize values. The version of the pickle protocol can be specified with the *protocol* parameter. See the :mod:`pickle` documentation for a discussion of the pickle protocols.
ru: По умолчанию пикли, созданные с помощью :const:`pickle.DEFAULT_PROTOCOL`, используются для сериализации значений. Версию протокола Pickle можно указать с помощью параметра *protocol*. См. документацию :mod:`pickle` для обсуждения протоколов Pickle.

source: If the *writeback* parameter is ``True``, the object will hold a cache of all entries accessed and write them back to the *dict* at sync and close times. This allows natural operations on mutable entries, but can consume much more memory and make sync and close take a long time.
ru: Если параметр *writeback* имеет значение «True», объект будет хранить кеш всех записей, к которым был осуществлен доступ, и записывать их обратно в *dict* во время синхронизации и закрытия. Это позволяет выполнять естественные операции с изменяемыми записями, но может потреблять гораздо больше памяти, а синхронизация и закрытие будут занимать много времени.

source: The *keyencoding* parameter is the encoding used to encode keys before they are used with the underlying dict.
ru: Параметр *keyencoding* — это кодировка, используемая для кодирования ключей перед их использованием с базовым словарем.

source: A :class:`Shelf` object can also be used as a context manager, in which case it will be automatically closed when the :keyword:`with` block ends.
ru: Объект :class:`Shelf` также можно использовать в качестве менеджера контекста, и в этом случае он будет автоматически закрыт, когда блок :keyword:`with` закончится.

source: Added the *keyencoding* parameter; previously, keys were always encoded in UTF-8.
ru: Добавлен параметр *keyencoding*; ранее ключи всегда кодировались в UTF-8.

source: Added context manager support.
ru: Добавлена ​​поддержка контекстного менеджера.

source: A subclass of :class:`Shelf` which exposes :meth:`!first`, :meth:`!next`, :meth:`!previous`, :meth:`!last` and :meth:`!set_location` methods. These are available in the third-party :mod:`!bsddb` module from `pybsddb <https://www.jcea.es/programacion/pybsddb.htm>`_ but not in other database modules. The *dict* object passed to the constructor must support those methods. This is generally accomplished by calling one of :func:`!bsddb.hashopen`, :func:`!bsddb.btopen` or :func:`!bsddb.rnopen`. The optional *protocol*, *writeback*, and *keyencoding* parameters have the same interpretation as for the :class:`Shelf` class.
ru: Подкласс :class:`Shelf`, который предоставляет :meth:`!first`, :meth:`!next`, :meth:`!previous`, :meth:`!last` и :meth:`!set_location` методы. Они доступны в стороннем модуле :mod:`!bsddb` из `pybsddb <https://www.jcea.es/programacion/pybsddb.htm>`_, но не в других модулях базы данных. Объект *dict*, передаваемый конструктору, должен поддерживать эти методы. Обычно это достигается путем вызова одной из :func:`!bsddb.hashopen`, :func:`!bsddb.btopen` или :func:`!bsddb.rnopen`. Необязательные параметры *protocol*, *writeback* и *keyencoding* имеют ту же интерпретацию, что и для класса :class:`Shelf`.

source: A subclass of :class:`Shelf` which accepts a *filename* instead of a dict-like object. The underlying file will be opened using :func:`dbm.open`. By default, the file will be created and opened for both read and write. The optional *flag* parameter has the same interpretation as for the :func:`.open` function. The optional *protocol* and *writeback* parameters have the same interpretation as for the :class:`Shelf` class.
ru: Подкласс :class:`Shelf`, который принимает *имя файла* вместо объекта типа dict. Базовый файл будет открыт с помощью :func:`dbm.open`. По умолчанию файл будет создан и открыт как для чтения, так и для записи. Необязательный параметр *flag* имеет ту же интерпретацию, что и функция :func:`.open`. Необязательные параметры *protocol* и *writeback* имеют ту же интерпретацию, что и класс :class:`Shelf`.

source: Example
ru: Пример

source: To summarize the interface (``key`` is a string, ``data`` is an arbitrary object)::
ru: Подводя итог интерфейсу (ключ — это строка, данные — произвольный объект):

source: Module :mod:`dbm`
ru: Модуль :mod:`dbm`

source: Generic interface to ``dbm``-style databases.
ru: Общий интерфейс для баз данных в стиле dbm.

source: Module :mod:`pickle`
ru: Модуль :mod:`pickle`

source: Object serialization used by :mod:`shelve`.
ru: Сериализация объектов, используемая :mod:`shelve`.

source: module
ru: модуль
