Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shlex.po
Languages: ru, sv

source: Characters that will be considered as escape. This will be only used in POSIX mode, and includes just ``'\'`` by default.
ru: Персонажи, которые будут рассматриваться как побег. Он будет использоваться только в режиме POSIX и по умолчанию включает только ``'\'``.
sv: Tecken som kommer att betraktas som escape. Detta kommer endast att användas i POSIX-läge, och inkluderar bara ``'\'`` som standard.

source: Characters that will be considered string quotes. The token accumulates until the same quote is encountered again (thus, different quote types protect each other as in the shell.) By default, includes ASCII single and double quotes.
ru: Символы, которые будут считаться строковыми кавычками. Токен накапливается до тех пор, пока та же кавычка не встретится снова (таким образом, разные типы кавычек защищают друг друга, как и в оболочке). По умолчанию включает одинарные и двойные кавычки ASCII.
sv: Tecken som kommer att betraktas som strängcitat. Token ackumuleras tills samma citattecken påträffas igen (olika citattyper skyddar alltså varandra som i skalet.) Som standard ingår ASCII enkla och dubbla citattecken.

source: Characters in :attr:`quotes` that will interpret escape characters defined in :attr:`escape`. This is only used in POSIX mode, and includes just ``'"'`` by default.
ru: Символы в :attr:`quotes`, которые будут интерпретировать escape-символы, определенные в :attr:`escape`. Он используется только в режиме POSIX и по умолчанию включает только ``'''``.
sv: Tecken i :attr:`quotes` som kommer att tolka escape-tecken definierade i :attr:`escape`. Detta används endast i POSIX-läge och inkluderar bara ``'"'`` som standard.

source: If ``True``, tokens will only be split in whitespaces. This is useful, for example, for parsing command lines with :class:`~shlex.shlex`, getting tokens in a similar way to shell arguments. When used in combination with :attr:`punctuation_chars`, tokens will be split on whitespace in addition to those characters.
ru: Если ``True``, токены будут разделяться только пробелами. Это полезно, например, для анализа командных строк с помощью :class:`~shlex.shlex` и получения токенов аналогично аргументам оболочки. При использовании в сочетании с :attr:`punctuation_chars` токены будут разделены на пробелы в дополнение к этим символам.
sv: Om ``True``, kommer tokens endast att delas upp i blanksteg. Detta är användbart, till exempel, för att analysera kommandorader med :class:`~shlex.shlex`, och få tokens på ett liknande sätt som skalargument. När det används i kombination med :attr:`punctuation_chars`, kommer tokens att delas upp på blanksteg utöver dessa tecken.

source: The :attr:`punctuation_chars` attribute was made compatible with the :attr:`whitespace_split` attribute.
ru: Атрибут :attr:`punctuation_chars` стал совместимым с атрибутом :attr:`whitespace_split`.
sv: Attributet :attr:`punctuation_chars` har gjorts kompatibelt med attributet :attr:`whitespace_split`.

source: The name of the current input file, as initially set at class instantiation time or stacked by later source requests. It may be useful to examine this when constructing error messages.
ru: Имя текущего входного файла, первоначально установленное во время создания экземпляра класса или сложенное более поздними запросами источника. Это может быть полезно изучить при построении сообщений об ошибках.
sv: Namnet på den aktuella indatafilen, som ursprungligen ställdes in vid klassens instantiering eller staplades av senare källförfrågningar. Det kan vara användbart att undersöka detta när man konstruerar felmeddelanden.

source: The input stream from which this :class:`~shlex.shlex` instance is reading characters.
ru: Входной поток, из которого этот экземпляр :class:`~shlex.shlex` читает символы.
sv: Den inmatningsström från vilken denna :class:`~shlex.shlex`-instans läser tecken.

source: This attribute is ``None`` by default. If you assign a string to it, that string will be recognized as a lexical-level inclusion request similar to the ``source`` keyword in various shells. That is, the immediately following token will be opened as a filename and input will be taken from that stream until EOF, at which point the :meth:`~io.IOBase.close` method of that stream will be called and the input source will again become the original input stream. Source requests may be stacked any number of levels deep.
ru: По умолчанию этот атрибут имеет значение «Нет». Если вы присвоите ему строку, эта строка будет распознана как запрос на включение на лексическом уровне, аналогичный ключевому слову ``source`` в различных оболочках. То есть, следующий токен будет открыт как имя файла, и входные данные будут приниматься из этого потока до конца EOF, после чего будет вызван метод :meth:`~io.IOBase.close` этого потока и источник входных данных. снова станет исходным входным потоком. Исходные запросы могут быть уложены на любое количество уровней.
sv: Detta attribut är ``None`` som standard. Om du tilldelar det en sträng kommer den strängen att tolkas som en inkluderingsbegäran på lexikal nivå, på samma sätt som nyckelordet ``ource`` i olika skal. Det vill säga, den omedelbart följande token öppnas som ett filnamn och indata tas från den strömmen till EOF, varvid :meth:`~io.IOBase.close`-metoden för den strömmen anropas och indatakällan åter blir den ursprungliga indataströmmen. Källförfrågningar kan staplas på valfritt antal nivåer.

source: If this attribute is numeric and ``1`` or more, a :class:`~shlex.shlex` instance will print verbose progress output on its behavior. If you need to use this, you can read the module source code to learn the details.
ru: Если этот атрибут числовой и имеет ``1`` или больше, экземпляр :class:`~shlex.shlex` будет печатать подробный вывод о ходе выполнения своего поведения. Если вам нужно это использовать, вы можете прочитать исходный код модуля, чтобы узнать подробности.
sv: Om det här attributet är numeriskt och ``1`` eller mer, kommer en :class:`~shlex.shlex`-instans att skriva ut utförliga förloppsdata om sitt beteende. Om du behöver använda detta kan du läsa modulens källkod för att få mer information.

source: Source line number (count of newlines seen so far plus one).
ru: Номер исходной строки (количество просмотренных новых строк плюс один).
sv: Källans radnummer (antal nya rader som hittills setts plus ett).

source: The token buffer. It may be useful to examine this when catching exceptions.
ru: Буфер токена. Это может быть полезно изучить при перехвате исключений.
sv: Buffert för token. Det kan vara användbart att undersöka detta när man fångar upp undantag.

source: Token used to determine end of file. This will be set to the empty string (``''``), in non-POSIX mode, and to ``None`` in POSIX mode.
ru: Токен, используемый для определения конца файла. Будет установлена ​​пустая строка (``''``) в режиме, отличном от POSIX, и значение ``None`` в режиме POSIX.
sv: Token som används för att avgöra slutet på filen. Detta kommer att sättas till den tomma strängen (``''``) i icke-POSIX-läge och till ``None`` i POSIX-läge.

source: Parsing Rules
ru: Правила синтаксического анализа
sv: Parsing-regler

source: When operating in non-POSIX mode, :class:`~shlex.shlex` will try to obey to the following rules.
ru: При работе в режиме, отличном от POSIX, :class:`~shlex.shlex` попытается подчиняться следующим правилам.
sv: Vid drift i icke-POSIX-läge kommer :class:`~shlex.shlex` att försöka följa följande regler.

source: Quote characters are not recognized within words (``Do"Not"Separate`` is parsed as the single word ``Do"Not"Separate``);
ru: Символы кавычек не распознаются внутри слов (``Do"Not"Separate`` анализируется как одно слово ``Do"Not"Separate``);
sv: Citationstecken identifieras inte inom ord (``Do"Not"Separate`` tolkas som det enskilda ordet ``Do"Not"Separate``);

source: Escape characters are not recognized;
ru: Escape-символы не распознаются;
sv: Escape-tecken identifieras inte;

source: Enclosing characters in quotes preserve the literal value of all characters within the quotes;
ru: Заключение символов в кавычки сохраняет буквальное значение всех символов в кавычках;
sv: Om tecken omsluts av citattecken bevaras det bokstavliga värdet av alla tecken inom citattecknen;

source: Closing quotes separate words (``"Do"Separate`` is parsed as ``"Do"`` and ``Separate``);
ru: Закрывающие кавычки - отдельные слова (``"Do"Separate`` анализируется как ``"Do"`` и ``Separate``);
sv: Avslutande citat separerar ord (``"Do"Separate`` tolkas som ``"Do"`` och ``Separate``);

source: If :attr:`~shlex.whitespace_split` is ``False``, any character not declared to be a word character, whitespace, or a quote will be returned as a single-character token. If it is ``True``, :class:`~shlex.shlex` will only split words in whitespaces;
ru: Если :attr:`~shlex.whitespace_split` имеет значение ``False``, любой символ, не объявленный как символ слова, пробел или кавычка, будет возвращен как односимвольный токен. Если это ``True``, :class:`~shlex.shlex` будет разделять слова только пробелами;
sv: Om :attr:`~shlex.whitespace_split` är ``False``, kommer alla tecken som inte är deklarerade som ordtecken, blanksteg eller citat att returneras som en token med ett tecken. Om det är ``True``, kommer :class:`~shlex.shlex` endast att dela ord i blanksteg;

source: EOF is signaled with an empty string (``''``);
ru: EOF сигнализируется пустой строкой (``''``);
sv: EOF signaleras med en tom sträng (``''``);

source: It's not possible to parse empty strings, even if quoted.
ru: Невозможно анализировать пустые строки, даже если они заключены в кавычки.
sv: Det är inte möjligt att analysera tomma strängar, inte ens om de är citerade.

source: When operating in POSIX mode, :class:`~shlex.shlex` will try to obey to the following parsing rules.
ru: При работе в режиме POSIX :class:`~shlex.shlex` попытается подчиняться следующим правилам синтаксического анализа.
sv: I POSIX-läge kommer :class:`~shlex.shlex` att försöka följa följande parsingregler.

source: Quotes are stripped out, and do not separate words (``"Do"Not"Separate"`` is parsed as the single word ``DoNotSeparate``);
ru: Кавычки удаляются и не разделяют слова («Do»Not»Separate» анализируется как одно слово «DoNotSeparate»);
sv: Citationstecken tas bort och separerar inte ord (``"Do"Not"Separate"`` tolkas som det enskilda ordet ``DoNotSeparate``);

source: Non-quoted escape characters (e.g. ``'\'``) preserve the literal value of the next character that follows;
ru: Escape-символы, не заключенные в кавычки (например, ``'\'``), сохраняют буквальное значение следующего за ним символа;
sv: Icke-citerade escape-tecken (t.ex. ``'\'``) bevarar det bokstavliga värdet av nästa tecken som följer;

source: Enclosing characters in quotes which are not part of :attr:`~shlex.escapedquotes` (e.g. ``"'"``) preserve the literal value of all characters within the quotes;
ru: Заключение символов в кавычки, которые не являются частью :attr:`~shlex.escapedquotes` (например, ``"'"``), сохраняет буквальное значение всех символов в кавычках;
sv: Om tecken omsluts av citattecken som inte ingår i :attr:`~shlex.escapedquotes` (t.ex. ``"'"``) bevaras det bokstavliga värdet av alla tecken inom citattecknen;

source: Enclosing characters in quotes which are part of :attr:`~shlex.escapedquotes` (e.g. ``'"'``) preserves the literal value of all characters within the quotes, with the exception of the characters mentioned in :attr:`~shlex.escape`. The escape characters retain its special meaning only when followed by the quote in use, or the escape character itself. Otherwise the escape character will be considered a normal character.
ru: Заключение символов в кавычки, которые являются частью :attr:`~shlex.escapedquotes` (например, ``'"'``), сохраняет буквальное значение всех символов в кавычках, за исключением символов, упомянутых в :attr:` ~shlex.escape`. escape-символы сохраняют свое особое значение только тогда, когда за ними следует используемая кавычка или сам escape-символ. В противном случае escape-символ будет считаться обычным символом.
sv: Om tecken omsluts av citattecken som ingår i :attr:`~shlex.escapedquotes` (t.ex. ``'"'``) bevaras det bokstavliga värdet av alla tecken inom citattecknen, med undantag för de tecken som nämns i :attr:`~shlex.escape`. Escape-tecknen behåller sin speciella betydelse endast när de följs av det använda citatet eller själva escape-tecknet. I annat fall betraktas escape-tecknet som ett normalt tecken.

source: EOF is signaled with a :const:`None` value;
ru: EOF сигнализируется значением :const:`None`;
sv: EOF signaleras med ett :const:`None`-värde;

source: Quoted empty strings (``''``) are allowed.
ru: Допускаются пустые строки в кавычках (``''``).
sv: Kvoterade tomma strängar (``''``) är tillåtna.

source: Improved Compatibility with Shells
ru: Улучшенная совместимость с оболочками
sv: Förbättrad kompatibilitet med skal

source: The :class:`shlex` class provides compatibility with the parsing performed by common Unix shells like ``bash``, ``dash``, and ``sh``. To take advantage of this compatibility, specify the ``punctuation_chars`` argument in the constructor. This defaults to ``False``, which preserves pre-3.6 behaviour. However, if it is set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters is returned as a single token. While this is short of a full parser for shells (which would be out of scope for the standard library, given the multiplicity of shells out there), it does allow you to perform processing of command lines more easily than you could otherwise. To illustrate, you can see the difference in the following snippet:
ru: Класс :class:`shlex` обеспечивает совместимость с синтаксическим анализом, выполняемым обычными оболочками Unix, такими как ``bash``, ``dash`` и ``sh``. Чтобы воспользоваться преимуществами этой совместимости, укажите в конструкторе аргумент punctuation_chars. По умолчанию установлено значение «False», что сохраняет поведение до версии 3.6. Однако, если для него установлено значение «True», то синтаксический анализ символов «();<>|&» изменяется: любая серия этих символов возвращается как один токен. Хотя этого недостаточно для полноценного синтаксического анализатора оболочек (который вышел бы за рамки стандартной библиотеки, учитывая множество существующих оболочек), он позволяет вам выполнять обработку командных строк более легко, чем вы могли бы в противном случае. Для иллюстрации вы можете увидеть разницу в следующем фрагменте:
sv: Klassen :class:`shlex` ger kompatibilitet med den parsning som utförs av vanliga Unix-skal som ``bash``, ``dash`` och ``sh``. För att dra nytta av denna kompatibilitet, ange argumentet ``punctuation_chars`` i konstruktören. Standardvärdet är ``False``, vilket bevarar beteendet före 3.6. Om det sätts till ``True`` ändras dock parsningen av tecknen ``();<>|&``: varje serie av dessa tecken returneras som en enda token. Även om detta inte är en fullständig parser för skal (vilket skulle vara utanför ramen för standardbiblioteket, med tanke på den mångfald av skal som finns), gör det att du kan utföra bearbetning av kommandorader enklare än du annars skulle kunna. För att illustrera kan du se skillnaden i följande utdrag:

source: Of course, tokens will be returned which are not valid for shells, and you'll need to implement your own error checks on the returned tokens.
ru: Конечно, будут возвращены токены, которые недействительны для оболочек, и вам придется реализовать собственные проверки ошибок в возвращаемых токенах.
sv: Naturligtvis kommer tokens att returneras som inte är giltiga för skal, och du måste implementera dina egna felkontroller på de returnerade tokens.

source: Instead of passing ``True`` as the value for the punctuation_chars parameter, you can pass a string with specific characters, which will be used to determine which characters constitute punctuation. For example::
ru: Вместо передачи True в качестве значения параметра punctuation_chars вы можете передать строку с определенными символами, которая будет использоваться для определения того, какие символы составляют пунктуацию. Например::
sv: I stället för att skicka ``True`` som värde för parametern punctuation_chars kan du skicka en sträng med specifika tecken som används för att avgöra vilka tecken som utgör skiljetecken. Till exempel::

source: When ``punctuation_chars`` is specified, the :attr:`~shlex.wordchars` attribute is augmented with the characters ``~-./*?=``. That is because these characters can appear in file names (including wildcards) and command-line arguments (e.g. ``--color=auto``). Hence::
ru: Если указан ``punctuation_chars``, атрибут :attr:`~shlex.wordchars` дополняется символами ``~-./*?=``. Это связано с тем, что эти символы могут появляться в именах файлов (включая подстановочные знаки) и аргументах командной строки (например, ``--color=auto``). Следовательно::
sv: När ``punctuation_chars`` anges, utökas attributet :attr:`~shlex.wordchars` med tecknen ``~-./*?=``. Det beror på att dessa tecken kan förekomma i filnamn (inklusive jokertecken) och kommandoradsargument (t.ex. ``--color=auto``). Därav::

source: However, to match the shell as closely as possible, it is recommended to always use ``posix`` and :attr:`~shlex.whitespace_split` when using :attr:`~shlex.punctuation_chars`, which will negate :attr:`~shlex.wordchars` entirely.
ru: Однако, чтобы максимально точно соответствовать оболочке, рекомендуется всегда использовать ``posix`` и :attr:`~shlex.whitespace_split` при использовании :attr:`~shlex.punctuation_chars`, что будет отрицать :attr: `~shlex.wordchars` полностью.
sv: För att matcha skalet så nära som möjligt rekommenderas dock att man alltid använder ``posix`` och :attr:`~shlex.whitespace_split` när man använder :attr:`~shlex.punctuation_chars`, vilket gör att :attr:`~shlex.wordchars` helt försvinner.

source: For best effect, ``punctuation_chars`` should be set in conjunction with ``posix=True``. (Note that ``posix=False`` is the default for :class:`~shlex.shlex`.)
ru: Для достижения наилучшего эффекта ``punctuation_chars`` следует устанавливать вместе с ``posix=True``. (Обратите внимание, что ``posix=False`` является значением по умолчанию для :class:`~shlex.shlex`.)
sv: För bästa effekt bör ``punctuation_chars`` ställas in tillsammans med ``posix=True``. (Observera att ``posix=False`` är standard för :class:`~shlex.shlex`)

source: A read-only property. Characters that will be considered punctuation. Runs of punctuation characters will be returned as a single token. However, note that no semantic validity checking will be performed: for example, '>>>' could be returned as a token, even though it may not be recognised as such by shells.
ru: Свойство, доступное только для чтения. Символы, которые будут считаться пунктуационными. Наборы знаков препинания будут возвращены как один токен. Однако обратите внимание, что проверка семантической достоверности выполняться не будет: например, '>>>' может быть возвращено как токен, даже если оболочки не распознают его как таковой.
