Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shlex.po
Languages: ru, sv

source: :mod:`!shlex` --- Simple lexical analysis
sv: :mod:`!shlex` --- Enkel lexikal analys

source: **Source code:** :source:`Lib/shlex.py`
ru: **Исходный код:** :source:`Lib/shlex.py`
sv: **Källkod:** :source:`Lib/shlex.py`

source: The :class:`~shlex.shlex` class makes it easy to write lexical analyzers for simple syntaxes resembling that of the Unix shell. This will often be useful for writing minilanguages, (for example, in run control files for Python applications) or for parsing quoted strings.
ru: Класс :class:`~shlex.shlex` позволяет легко писать лексические анализаторы для простых синтаксисов, напоминающих синтаксис оболочки Unix. Это часто бывает полезно для написания мини-языков (например, в файлах управления запуском приложений Python) или для анализа строк в кавычках.
sv: Klassen :class:`~shlex.shlex` gör det enkelt att skriva lexikala analysatorer för enkla syntaxer som liknar den i Unix-skalet. Detta är ofta användbart för att skriva minilanguages (till exempel i körkontrollfiler för Python-program) eller för att analysera citerade strängar.

source: The :mod:`shlex` module defines the following functions:
ru: Модуль :mod:`shlex` определяет следующие функции:
sv: Modulen :mod:`shlex` definierar följande funktioner:

source: Split the string *s* using shell-like syntax. If *comments* is :const:`False` (the default), the parsing of comments in the given string will be disabled (setting the :attr:`~shlex.commenters` attribute of the :class:`~shlex.shlex` instance to the empty string). This function operates in POSIX mode by default, but uses non-POSIX mode if the *posix* argument is false.
ru: Разделите строку *s*, используя синтаксис оболочки. Если *comments* имеет значение :const:`False` (по умолчанию), анализ комментариев в данной строке будет отключен (установка атрибута :attr:`~shlex.commenters` файла :class:`~shlex.shlex `экземпляр для пустой строки). По умолчанию эта функция работает в режиме POSIX, но использует режим, отличный от POSIX, если аргумент *posix* имеет значение false.
sv: Dela upp strängen *s* med shell-liknande syntax. Om *comments* är :const:`False` (standard), inaktiveras tolkningen av kommentarer i den angivna strängen (attributet :attr:`~shlex.commenters` i :class:`~shlex.shlex`-instansen sätts till den tomma strängen). Denna funktion arbetar i POSIX-läge som standard, men använder icke-POSIX-läge om argumentet *posix* är falskt.

source: Passing ``None`` for *s* argument now raises an exception, rather than reading :data:`sys.stdin`.
sv: Att ange ``None`` för *s*-argumentet ger nu upphov till ett undantag, istället för att läsa :data:`sys.stdin`.

source: Concatenate the tokens of the list *split_command* and return a string. This function is the inverse of :func:`split`.
ru: Объедините токены списка *split_command* и верните строку. Эта функция является обратной функцией :func:`split`.
sv: Sammanfoga symbolerna i listan *split_command* och returnera en sträng. Denna funktion är inversen av :func:`split`.

source: The returned value is shell-escaped to protect against injection vulnerabilities (see :func:`quote`).
ru: Возвращаемое значение экранируется оболочкой для защиты от уязвимостей внедрения (см. :func:`quote`).
sv: Det returnerade värdet är shell-escaped för att skydda mot injektionssårbarheter (se :func:`quote`).

source: Return a shell-escaped version of the string *s*. The returned value is a string that can safely be used as one token in a shell command line, for cases where you cannot use a list.
ru: Возвращает экранированную оболочкой версию строки *s*. Возвращаемое значение представляет собой строку, которую можно безопасно использовать как один токен в командной строке оболочки в тех случаях, когда вы не можете использовать список.
sv: Returnerar en shell-escaped version av strängen *s*. Det returnerade värdet är en sträng som säkert kan användas som en token i en kommandorad i ett skal, i de fall där du inte kan använda en lista.

source: The ``shlex`` module is **only designed for Unix shells**.
ru: Модуль shlex **разработан только для оболочек Unix**.
sv: Modulen ``shlex`` är **endast avsedd för Unix-skal**.

source: The :func:`quote` function is not guaranteed to be correct on non-POSIX compliant shells or shells from other operating systems such as Windows. Executing commands quoted by this module on such shells can open up the possibility of a command injection vulnerability.
ru: Не гарантируется корректность функции :func:`quote` в оболочках, не совместимых с POSIX, или в оболочках других операционных систем, таких как Windows. Выполнение команд, указанных в этом модуле, в таких оболочках может открыть возможность уязвимости внедрения команд.
sv: Funktionen :func:`quote` garanteras inte vara korrekt i skal som inte är kompatibla med POSIX eller i skal från andra operativsystem, t.ex. Windows. Om kommandon som citeras av den här modulen körs i sådana skal kan det leda till en sårbarhet genom kommandoinjektion.

source: Consider using functions that pass command arguments with lists such as :func:`subprocess.run` with ``shell=False``.
ru: Рассмотрите возможность использования функций, которые передают аргументы команды со списками, например :func:`subprocess.run` с ``shell=False``.
sv: Överväg att använda funktioner som skickar kommandoparametrar med listor, t.ex. :func:`subprocess.run` med ``shell=False``.

source: This idiom would be unsafe:
ru: Эта идиома была бы небезопасной:
sv: Detta idiom skulle vara osäkert:

source: :func:`quote` lets you plug the security hole:
ru: :func:`quote` позволяет закрыть дыру в безопасности:
sv: :func:`quote` låter dig täppa till säkerhetshålet:

source: The quoting is compatible with UNIX shells and with :func:`split`:
ru: Цитирование совместимо с оболочками UNIX и с :func:`split`:
sv: Citeringen är kompatibel med UNIX-shell och med :func:`split`:

source: The :mod:`shlex` module defines the following class:
ru: Модуль :mod:`shlex` определяет следующий класс:
sv: Modulen :mod:`shlex` definierar följande klass:

source: A :class:`~shlex.shlex` instance or subclass instance is a lexical analyzer object. The initialization argument, if present, specifies where to read characters from. It must be a file-/stream-like object with :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` methods, or a string. If no argument is given, input will be taken from ``sys.stdin``. The second optional argument is a filename string, which sets the initial value of the :attr:`~shlex.infile` attribute. If the *instream* argument is omitted or equal to ``sys.stdin``, this second argument defaults to "stdin". The *posix* argument defines the operational mode: when *posix* is not true (default), the :class:`~shlex.shlex` instance will operate in compatibility mode. When operating in POSIX mode, :class:`~shlex.shlex` will try to be as close as possible to the POSIX shell parsing rules. The *punctuation_chars* argument provides a way to make the behaviour even closer to how real shells parse. This can take a number of values: the default value, ``False``, preserves the behaviour seen under Python 3.5 and earlier. If set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters (considered punctuation characters) is returned as a single token. If set to a non-empty string of characters, those characters will be used as the punctuation characters. Any characters in the :attr:`wordchars` attribute that appear in *punctuation_chars* will be removed from :attr:`wordchars`. See :ref:`improved-shell-compatibility` for more information. *punctuation_chars* can be set only upon :class:`~shlex.shlex` instance creation and can't be modified later.
ru: Экземпляр или подкласс :class:`~shlex.shlex` является объектом лексического анализатора. Аргумент инициализации, если он присутствует, указывает, откуда читать символы. Это должен быть объект, подобный файлу/потоку, с методами :meth:`~io.TextIOBase.read` и :meth:`~io.TextIOBase.readline`, или строка. Если аргумент не указан, входные данные будут взяты из ``sys.stdin``. Второй необязательный аргумент — это строка имени файла, которая устанавливает начальное значение атрибута :attr:`~shlex.infile`. Если аргумент *instream* опущен или равен ``sys.stdin``, этот второй аргумент по умолчанию равен «stdin». Аргумент *posix* определяет рабочий режим: если значение *posix* неверно (по умолчанию), экземпляр :class:`~shlex.shlex` будет работать в режиме совместимости. При работе в режиме POSIX :class:`~shlex.shlex` будет стараться быть как можно ближе к правилам синтаксического анализа оболочки POSIX. Аргумент *punctuation_chars* позволяет еще больше приблизить поведение к тому, как анализируются реальные оболочки. Оно может принимать несколько значений: значение по умолчанию «False» сохраняет поведение, наблюдаемое в Python 3.5 и более ранних версиях. Если установлено значение ``True``, то синтаксический анализ символов ``();<>|&`` изменяется: любая серия этих символов (считающихся знаками пунктуации) возвращается как один токен. Если задана непустая строка символов, эти символы будут использоваться в качестве знаков пунктуации. Любые символы в атрибуте :attr:`wordchars`, которые появляются в *punctuation_chars*, будут удалены из :attr:`wordchars`. Дополнительную информацию смотрите в разделе :ref:`improved-shell-compatibility`. *punctuation_chars* может быть установлен только при создании экземпляра :class:`~shlex.shlex` и не может быть изменен позже.
sv: En :class:`~shlex.shlex`-instans eller underklass-instans är ett lexikaliskt analysobjekt. Initialiseringsargumentet, om det finns, anger varifrån tecken ska läsas. Det måste vara ett fil-/strömliknande objekt med metoderna :meth:`~io.TextIOBase.read` och :meth:`~io.TextIOBase.readline`, eller en sträng. Om inget argument anges kommer indata att hämtas från ``sys.stdin``. Det andra valfria argumentet är en filnamnssträng som anger det initiala värdet för attributet :attr:`~shlex.infile`. Om argumentet *instream* utelämnas eller är lika med ``sys.stdin``, är detta andra argument standardvärdet "stdin". Argumentet *posix* definierar driftläget: när *posix* inte är sant (standard), kommer :class:`~shlex.shlex`-instansen att fungera i kompatibilitetsläge. I POSIX-läge kommer :class:`~shlex.shlex` att försöka ligga så nära POSIX-skalets parsningsregler som möjligt. Argumentet *punctuation_chars* ger ett sätt att göra beteendet ännu närmare hur riktiga skal parsar. Detta kan anta ett antal värden: standardvärdet, ``False``, bevarar det beteende som ses under Python 3.5 och tidigare. Om det sätts till ``True``, ändras tolkningen av tecknen ``();<>|&``: varje serie av dessa tecken (som betraktas som skiljetecken) returneras som en enda token. Om den är inställd på en icke-tom sträng av tecken, kommer dessa tecken att användas som skiljetecken. Alla tecken i attributet :attr:`wordchars` som förekommer i *punctuation_chars* kommer att tas bort från :attr:`wordchars`. Se :ref:`improved-shell-compatibility` för mer information. *punctuation_chars* kan endast ställas in när :class:`~shlex.shlex` instansen skapas och kan inte ändras senare.

source: The *punctuation_chars* parameter was added.
ru: Добавлен параметр *punctuation_chars*.
sv: Parametern *punctuation_chars* har lagts till.

source: Module :mod:`configparser`
ru: Модуль :mod:`configparser`
sv: Modul :mod:`configparser`

source: Parser for configuration files similar to the Windows :file:`.ini` files.
ru: Анализатор файлов конфигурации, похожих на файлы Windows :file:`.ini`.
sv: Parser för konfigurationsfiler som liknar Windows :file:`.ini`-filer.

source: shlex Objects
ru: Объекты shlex
sv: shlex Objekt

source: A :class:`~shlex.shlex` instance has the following methods:
ru: Экземпляр :class:`~shlex.shlex` имеет следующие методы:
sv: En :class:`~shlex.shlex`-instans har följande metoder:

source: Return a token. If tokens have been stacked using :meth:`push_token`, pop a token off the stack. Otherwise, read one from the input stream. If reading encounters an immediate end-of-file, :attr:`eof` is returned (the empty string (``''``) in non-POSIX mode, and ``None`` in POSIX mode).
ru: Вернуть жетон. Если токены были сложены с помощью :meth:`push_token`, извлеките токен из стека. В противном случае прочитайте его из входного потока. Если при чтении обнаруживается немедленный конец файла, возвращается :attr:`eof` (пустая строка (``''``) в режиме, отличном от POSIX, и ``None`` в режиме POSIX).
sv: Returnerar en token. Om tokens har staplats med hjälp av :meth:`push_token`, plocka en token från stapeln. I annat fall, läs en från inmatningsströmmen. Om läsningen stöter på ett omedelbart filslut returneras :attr:`eof` (den tomma strängen (``''``) i icke-POSIX-läge och ``None`` i POSIX-läge).

source: Push the argument onto the token stack.
ru: Поместите аргумент в стек токенов.
sv: Lägg argumentet på token-stacken.

source: Read a raw token. Ignore the pushback stack, and do not interpret source requests. (This is not ordinarily a useful entry point, and is documented here only for the sake of completeness.)
ru: Прочитайте необработанный токен. Игнорируйте стек возвратов и не интерпретируйте запросы источника. (Обычно это не очень полезная точка входа, и она описана здесь только для полноты картины.)
sv: Läs en rå token. Ignorera pushback-stacken och tolka inte källförfrågningar. (Detta är normalt inte en användbar ingångspunkt och dokumenteras här endast för fullständighetens skull)

source: When :class:`~shlex.shlex` detects a source request (see :attr:`source` below) this method is given the following token as argument, and expected to return a tuple consisting of a filename and an open file-like object.
ru: Когда :class:`~shlex.shlex` обнаруживает запрос источника (см. :attr:`source` ниже), этому методу в качестве аргумента передается следующий токен, и ожидается, что он вернет кортеж, состоящий из имени файла и открытого файла, подобного объект.
sv: När :class:`~shlex.shlex` upptäcker en källa (se :attr:`source` nedan) får denna metod följande token som argument, och förväntas returnera en tupel bestående av ett filnamn och ett öppet filliknande objekt.

source: Normally, this method first strips any quotes off the argument. If the result is an absolute pathname, or there was no previous source request in effect, or the previous source was a stream (such as ``sys.stdin``), the result is left alone. Otherwise, if the result is a relative pathname, the directory part of the name of the file immediately before it on the source inclusion stack is prepended (this behavior is like the way the C preprocessor handles ``#include "file.h"``).
ru: Обычно этот метод сначала удаляет все кавычки из аргумента. Если результатом является абсолютный путь, или предыдущий запрос источника не действовал, или предыдущий источник был потоком (например, ``sys.stdin``), результат остается в покое. В противном случае, если результатом является относительный путь, к началу добавляется часть каталога имени файла непосредственно перед ним в стеке включения источника (это поведение аналогично тому, как препроцессор C обрабатывает ``#include "file.h"` `).
sv: Normalt tar den här metoden först bort alla citattecken från argumentet. Om resultatet är ett absolut sökvägsnamn, eller om det inte fanns någon tidigare källbegäran, eller om den tidigare källan var en ström (t.ex. ``sys.stdin``), lämnas resultatet i fred. I annat fall, om resultatet är ett relativt sökvägsnamn, läggs katalogdelen av namnet på filen omedelbart före det i källinkluderingsstapeln till (detta beteende liknar det sätt på vilket C-förprocessorn hanterar ``#include "file.h"``).

source: The result of the manipulations is treated as a filename, and returned as the first component of the tuple, with :func:`open` called on it to yield the second component. (Note: this is the reverse of the order of arguments in instance initialization!)
ru: Результат манипуляций обрабатывается как имя файла и возвращается как первый компонент кортежа с вызовом :func:`open` для получения второго компонента. (Примечание: это обратный порядок аргументов при инициализации экземпляра!)
sv: Resultatet av manipuleringarna behandlas som ett filnamn och returneras som den första komponenten i tupeln, med :func:`open` anropad för att ge den andra komponenten. (Obs: detta är omvänd ordning på argumenten vid initiering av instanser!)

source: This hook is exposed so that you can use it to implement directory search paths, addition of file extensions, and other namespace hacks. There is no corresponding 'close' hook, but a shlex instance will call the :meth:`~io.IOBase.close` method of the sourced input stream when it returns EOF.
ru: Этот хук доступен для того, чтобы вы могли использовать его для реализации путей поиска в каталогах, добавления расширений файлов и других хаков пространства имен. Соответствующего хука close нет, но экземпляр shlex вызовет метод :meth:`~io.IOBase.close` исходного входного потока, когда он возвращает EOF.
sv: Denna hook är exponerad så att du kan använda den för att implementera katalogsökvägar, tillägg av filändelser och andra namnrymdshack. Det finns ingen motsvarande "close"-hook, men en shlex-instans kommer att anropa :meth:`~io.IOBase.close`-metoden för den hämtade inmatningsströmmen när den returnerar EOF.

source: For more explicit control of source stacking, use the :meth:`push_source` and :meth:`pop_source` methods.
ru: Для более явного управления стеком исходного кода используйте методы :meth:`push_source` и :meth:`pop_source`.
sv: För mer explicit kontroll av källans stapling, använd metoderna :meth:`push_source` och :meth:`pop_source`.

source: Push an input source stream onto the input stack. If the filename argument is specified it will later be available for use in error messages. This is the same method used internally by the :meth:`sourcehook` method.
ru: Поместите входной исходный поток во входной стек. Если указан аргумент имени файла, позже он будет доступен для использования в сообщениях об ошибках. Это тот же метод, который используется внутри метода :meth:`sourcehook`.
sv: Skjuter upp en inmatningskällström på inmatningsstapeln. Om filnamnsargumentet anges kommer det senare att vara tillgängligt för användning i felmeddelanden. Detta är samma metod som används internt av metoden :meth:`sourcehook`.

source: Pop the last-pushed input source from the input stack. This is the same method used internally when the lexer reaches EOF on a stacked input stream.
ru: Извлеките последний загруженный источник входного сигнала из стека входных данных. Это тот же метод, который используется внутри, когда лексер достигает EOF в составном входном потоке.
sv: Plocka bort den senast inmatade källan från inmatningsstapeln. Detta är samma metod som används internt när lexaren når EOF på en staplad inmatningsström.

source: This method generates an error message leader in the format of a Unix C compiler error label; the format is ``'"%s", line %d: '``, where the ``%s`` is replaced with the name of the current source file and the ``%d`` with the current input line number (the optional arguments can be used to override these).
ru: Этот метод генерирует заголовок сообщения об ошибке в формате метки ошибки компилятора Unix C; формат ``'" %s ", линия %д : '``, где `` %s `` заменяется именем текущего исходного файла и `` %д `` с текущим номером входной строки (необязательные аргументы можно использовать для их переопределения).
sv: Denna metod genererar en felmeddelandeledare i formatet för en Unix C-kompilators feletikett; formatet är ``'"%s", rad %d: '``, där ``%s`` ersätts med namnet på den aktuella källfilen och ``%d`` med det aktuella radnumret för inmatningen (de valfria argumenten kan användas för att åsidosätta dessa).

source: This convenience is provided to encourage :mod:`shlex` users to generate error messages in the standard, parseable format understood by Emacs and other Unix tools.
ru: Это удобство сделано для того, чтобы побудить пользователей :mod:`shlex` генерировать сообщения об ошибках в стандартном, поддающемся синтаксическому анализу формате, понятном Emacs и другим инструментам Unix.
sv: Detta är ett sätt att uppmuntra :mod:`shlex`-användare att generera felmeddelanden i ett standardformat som kan tolkas av Emacs och andra Unix-verktyg.

source: Instances of :class:`~shlex.shlex` subclasses have some public instance variables which either control lexical analysis or can be used for debugging:
ru: Экземпляры подклассов :class:`~shlex.shlex` имеют некоторые общедоступные переменные экземпляра, которые либо управляют лексическим анализом, либо могут использоваться для отладки:
sv: Instanser av underklasserna :class:`~shlex.shlex` har några offentliga instansvariabler som antingen styr den lexikala analysen eller kan användas för felsökning:

source: The string of characters that are recognized as comment beginners. All characters from the comment beginner to end of line are ignored. Includes just ``'#'`` by default.
ru: Строка символов, которые распознаются как комментарии начинающих. Все символы от начала комментария до конца строки игнорируются. По умолчанию включает только ``'#'``.
sv: Den teckensträng som identifieras som början på en kommentar. Alla tecken från kommentarens början till slutet av raden ignoreras. Inkluderar bara ``'#'`` som standard.

source: The string of characters that will accumulate into multi-character tokens. By default, includes all ASCII alphanumerics and underscore. In POSIX mode, the accented characters in the Latin-1 set are also included. If :attr:`punctuation_chars` is not empty, the characters ``~-./*?=``, which can appear in filename specifications and command line parameters, will also be included in this attribute, and any characters which appear in ``punctuation_chars`` will be removed from ``wordchars`` if they are present there. If :attr:`whitespace_split` is set to ``True``, this will have no effect.
ru: Строка символов, которая будет накапливаться в многосимвольные токены. По умолчанию включает все буквы и цифры ASCII и подчеркивание. В режиме POSIX также включаются символы с диакритическими знаками из набора Latin-1. Если :attr:`punctuation_chars` не пуст, в этот атрибут также будут включены символы ``~-./*?=``, которые могут встречаться в спецификациях имени файла и параметрах командной строки, а также любые символы, которые появляются в ``punctuation_chars`` будет удален из ``wordchars``, если они там присутствуют. Если для :attr:`whitespace_split` установлено значение ``True``, это не будет иметь никакого эффекта.
sv: Den teckensträng som kommer att ackumuleras till flerteckentokens. Som standard ingår alla alfanumeriska ASCII-tecken och understreck. I POSIX-läge ingår även de accentuerade tecknen i Latin-1-uppsättningen. Om :attr:`punctuation_chars` inte är tomt, kommer tecknen ``~-./*?=``, som kan förekomma i filnamnsspecifikationer och kommandoradsparametrar, också att inkluderas i detta attribut, och alla tecken som förekommer i ``punctuation_chars`` kommer att tas bort från ``wordchars`` om de förekommer där. Om :attr:`whitespace_split` är satt till ``True``, kommer detta inte att ha någon effekt.

source: Characters that will be considered whitespace and skipped. Whitespace bounds tokens. By default, includes space, tab, linefeed and carriage-return.
ru: Символы, которые будут считаться пробелами и пропускаться. Пробелы ограничивают токены. По умолчанию включает пробел, табуляцию, перевод строки и возврат каретки.
sv: Tecken som ska betraktas som blanksteg och hoppas över. Blanksteg avgränsar tokens. Som standard ingår mellanslag, tabb, radmatning och carriage-return.
