Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shutil.po
Languages: pt_pt, ru, sv

source: Copies the file *src* to the file or directory *dst*. *src* and *dst* should be :term:`path-like objects <path-like object>` or strings. If *dst* specifies a directory, the file will be copied into *dst* using the base filename from *src*. If *dst* specifies a file that already exists, it will be replaced. Returns the path to the newly created file.
pt_pt: Copiar o ficheiro *src* para o ficheiro ou diretório *dst*. *src* e *dst* devem ser :term:`objetos semelhantes a caminhos <path-like object>` ou strings. Se *dst* especificar um diretório, o ficheiro será copiado para *dst* usando o nome base de *src*. Se *dst* especificar um ficheiro que já existe, será substituído. Retorna o caminho para o ficheiro recém-criado.
ru: Копирует файл *src* в файл или каталог *dst*. *src* и *dst* должны быть :term:`объектами, похожими на путь <объект, похожий на путь>` или строками. Если *dst* указывает каталог, файл будет скопирован в *dst* с использованием базового имени файла из *src*. Если *dst* указывает на уже существующий файл, он будет заменен. Возвращает путь к вновь созданному файлу.
sv: Kopierar filen *src* till filen eller katalogen *dst*. *src* och *dst* bör vara :term:`path-liknande objekt <path-like object>` eller strängar. Om *dst* anger en katalog kommer filen att kopieras till *dst* med hjälp av basfilnamnet från *src*. Om *dst* anger en fil som redan finns kommer den att ersättas. Returnerar sökvägen till den nyskapade filen.

source: If *follow_symlinks* is false, and *src* is a symbolic link, *dst* will be created as a symbolic link. If *follow_symlinks* is true and *src* is a symbolic link, *dst* will be a copy of the file *src* refers to.
pt_pt: Se *follow_symlinks* for falso e *src* for uma ligação simbólica, *dst* será criado como uma ligação simbólica. Se *follow_symlinks* for verdadeiro e *src* for uma ligação simbólica, *dst* será uma cópia do ficheiro para o qual *src* aponta.
ru: Если *follow_symlinks* имеет значение false, а *src* является символической ссылкой, *dst* будет создан как символическая ссылка. Если *follow_symlinks* имеет значение true и *src* является символической ссылкой, *dst* будет копией файла, на который ссылается *src*.
sv: Om *follow_symlinks* är false och *src* är en symbolisk länk kommer *dst* att skapas som en symbolisk länk. Om *follow_symlinks* är true och *src* är en symbolisk länk, blir *dst* en kopia av den fil som *src* hänvisar till.

source: :func:`~shutil.copy` copies the file data and the file's permission mode (see :func:`os.chmod`). Other metadata, like the file's creation and modification times, is not preserved. To preserve all file metadata from the original, use :func:`~shutil.copy2` instead.
pt_pt: :func:`~shutil.copy` copia os dados do ficheiro e o modo de permissão do ficheiro (veja :func:`os.chmod`). Outros metadados, como as horas de criação e modificação do ficheiro, não são preservados. Para preservar todos os metadados do ficheiro original, use :func:`~shutil.copy2` em vez disso.
ru: :func:`~shutil.copy` копирует данные файла и режим разрешений файла (см. :func:`os.chmod`). Другие метаданные, например время создания и изменения файла, не сохраняются. Чтобы сохранить все метаданные файла из оригинала, используйте вместо этого :func:`~shutil.copy2`.
sv: :func:`~shutil.copy` kopierar filinformationen och filens behörighetsläge (se :func:`os.chmod`). Andra metadata, t.ex. filens skapelse- och ändringstid, bevaras inte. Om du vill bevara alla filmetadata från originalet använder du istället :func:`~shutil.copy2`.

source: Added *follow_symlinks* argument. Now returns path to the newly created file.
pt_pt: Adicionado o argumento *follow_symlinks*. Agora retorna o caminho para o ficheiro recém-criado.
ru: Добавлен аргумент *follow_symlinks*. Теперь возвращает путь к вновь созданному файлу.
sv: Lagt till argumentet *follow_symlinks*. Returnerar nu sökvägen till den nyskapade filen.

source: Identical to :func:`~shutil.copy` except that :func:`copy2` also attempts to preserve file metadata.
pt_pt: Idêntico a :func:`~shutil.copy`, exceto que :func:`copy2` também tenta preservar os metadados do ficheiro.
ru: Идентичен :func:`~shutil.copy`, за исключением того, что :func:`copy2` также пытается сохранить метаданные файла.
sv: Identisk med :func:`~shutil.copy` förutom att :func:`copy2` också försöker bevara metadata för filer.

source: When *follow_symlinks* is false, and *src* is a symbolic link, :func:`copy2` attempts to copy all metadata from the *src* symbolic link to the newly created *dst* symbolic link. However, this functionality is not available on all platforms. On platforms where some or all of this functionality is unavailable, :func:`copy2` will preserve all the metadata it can; :func:`copy2` never raises an exception because it cannot preserve file metadata.
pt_pt: Quando *follow_symlinks* é falso e *src* é uma ligação simbólica, :func:`copy2` tenta copiar todos os metadados da ligação simbólica *src* para a ligação simbólica *dst* recém-criada. No entanto, esta funcionalidade não está disponível em todas as plataformas. Em plataformas onde alguma ou toda esta funcionalidade não está disponível, :func:`copy2` preservará todos os metadados que puder; :func:`copy2` nunca levanta uma exceção porque não pode preservar os metadados do ficheiro.
ru: Когда *follow_symlinks* имеет значение false, а *src* является символической ссылкой, :func:`copy2` пытается скопировать все метаданные из символической ссылки *src* во вновь созданную символическую ссылку *dst*. Однако эта функция доступна не на всех платформах. На платформах, где некоторые или все эти функции недоступны, :func:`copy2` сохранит все возможные метаданные; :func:`copy2` никогда не вызывает исключение, поскольку не может сохранить метаданные файла.
sv: När *follow_symlinks* är false och *src* är en symbolisk länk försöker :func:`copy2` att kopiera alla metadata från den symboliska länken *src* till den nyskapade symboliska länken *dst*. Denna funktion är dock inte tillgänglig på alla plattformar. På plattformar där hela eller delar av denna funktionalitet inte är tillgänglig kommer :func:`copy2` att bevara alla metadata den kan; :func:`copy2` ger aldrig upphov till ett undantag för att den inte kan bevara filmetadata.

source: :func:`copy2` uses :func:`copystat` to copy the file metadata. Please see :func:`copystat` for more information about platform support for modifying symbolic link metadata.
pt_pt: :func:`copy2` usa :func:`copystat` para copiar os metadados do ficheiro. Consulte :func:`copystat` para mais informações sobre o suporte da plataforma para modificar metadados de ligações simbólicas.
ru: :func:`copy2` использует :func:`copystat` для копирования метаданных файла. Пожалуйста, обратитесь к :func:`copystat` для получения дополнительной информации о поддержке платформой изменения метаданных символических ссылок.
sv: :func:`copy2` använder :func:`copystat` för att kopiera filens metadata. Se :func:`copystat` för mer information om plattformsstöd för modifiering av metadata för symboliska länkar.

source: Added *follow_symlinks* argument, try to copy extended file system attributes too (currently Linux only). Now returns path to the newly created file.
pt_pt: Adicionado o argumento *follow_symlinks*, tenta também copiar atributos estendidos do sistema de ficheiros (atualmente apenas Linux). Agora retorna o caminho para o ficheiro recém-criado.
ru: Добавлен аргумент *follow_symlinks*, попробуйте также скопировать атрибуты расширенной файловой системы (на данный момент только для Linux). Теперь возвращает путь к вновь созданному файлу.
sv: Lagt till *follow_symlinks*-argument, försök att kopiera utökade filsystemattribut också (för närvarande endast Linux). Returnerar nu sökvägen till den nyskapade filen.

source: This factory function creates a function that can be used as a callable for :func:`copytree`\'s *ignore* argument, ignoring files and directories that match one of the glob-style *patterns* provided. See the example below.
pt_pt: Esta função de fábrica cria uma função que pode ser usada como um objeto chamável para o argumento *ignore* de :func:`copytree`, ignorando ficheiros e diretórios que correspondam a um dos *patterns* fornecidos no estilo glob. Veja o exemplo abaixo.
ru: Эта фабричная функция создает функцию, которую можно использовать в качестве вызываемой для аргумента *ignore* :func:`copytree`\, игнорируя файлы и каталоги, соответствующие одному из предоставленных *шаблонов* в стиле glob. См. пример ниже.
sv: Denna fabriksfunktion skapar en funktion som kan användas som en anropbar funktion för :func:`copytree`'s *ignore*-argument, och ignorerar filer och kataloger som matchar ett av de *mönster* i glob-stil som anges. Se exemplet nedan.

source: Recursively copy an entire directory tree rooted at *src* to a directory named *dst* and return the destination directory. All intermediate directories needed to contain *dst* will also be created by default.
pt_pt: Copiar recursivamente uma árvore de diretórios inteira enraizada em *src* para um diretório nomeado *dst* e retornar o diretório de destino. Todos os diretórios intermédios necessários para conter *dst* também serão criados por predefinição.
ru: Рекурсивно скопируйте все дерево каталогов с корнем *src* в каталог с именем *dst* и верните каталог назначения. Все промежуточные каталоги, которые должны содержать *dst*, также будут созданы по умолчанию.
sv: Kopiera rekursivt ett helt katalogträd med rot i *src* till en katalog med namnet *dst* och returnera destinationskatalogen. Alla mellanliggande kataloger som behövs för att innehålla *dst* kommer också att skapas som standard.

source: Permissions and times of directories are copied with :func:`copystat`, individual files are copied using :func:`~shutil.copy2`.
pt_pt: As permissões e horas dos diretórios são copiadas com :func:`copystat`, os ficheiros individuais são copiados usando :func:`~shutil.copy2`.
ru: Разрешения и время каталогов копируются с помощью :func:`copystat`, отдельные файлы копируются с помощью :func:`~shutil.copy2`.
sv: Behörigheter och tider för kataloger kopieras med :func:`copystat`, enskilda filer kopieras med :func:`~shutil.copy2`.

source: If *symlinks* is true, symbolic links in the source tree are represented as symbolic links in the new tree and the metadata of the original links will be copied as far as the platform allows; if false or omitted, the contents and metadata of the linked files are copied to the new tree.
pt_pt: Se *symlinks* for verdadeiro, as ligações simbólicas na árvore de origem são representadas como ligações simbólicas na nova árvore e os metadados das ligações originais serão copiados tanto quanto a plataforma permitir; se for falso ou omitido, o conteúdo e os metadados dos ficheiros ligados são copiados para a nova árvore.
ru: Если *symlinks* имеет значение true, символические ссылки в исходном дереве представлены как символические ссылки в новом дереве, а метаданные исходных ссылок будут скопированы, насколько это позволяет платформа; если значение false или опущено, содержимое и метаданные связанных файлов копируются в новое дерево.
sv: Om *symlinks* är true representeras symboliska länkar i källträdet som symboliska länkar i det nya trädet och metadata för de ursprungliga länkarna kopieras så långt som plattformen tillåter; om false eller utelämnas kopieras innehållet och metadata för de länkade filerna till det nya trädet.

source: When *symlinks* is false, if the file pointed to by the symlink doesn't exist, an exception will be added in the list of errors raised in an :exc:`Error` exception at the end of the copy process. You can set the optional *ignore_dangling_symlinks* flag to true if you want to silence this exception. Notice that this option has no effect on platforms that don't support :func:`os.symlink`.
pt_pt: Quando *symlinks* é falso, se o ficheiro apontado pela ligação simbólica não existir, uma exceção será adicionada à lista de erros levantados numa exceção :exc:`Error` no final do processo de cópia. Pode definir a flag opcional *ignore_dangling_symlinks* como verdadeira se pretender silenciar esta exceção. Note que esta opção não tem efeito em plataformas que não suportam :func:`os.symlink`.
ru: Когда *symlinks* имеет значение false и файл, на который указывает символическая ссылка, не существует, исключение будет добавлено в список ошибок, возникающих в исключении :exc:`Error` в конце процесса копирования. Вы можете установить необязательный флаг *ignore_dangling_symlinks* в значение true, если хотите отключить это исключение. Обратите внимание, что эта опция не влияет на платформы, которые не поддерживают :func:`os.symlink`.
sv: När *symlinks* är false, om filen som symlänken pekar på inte finns, kommer ett undantag att läggas till i listan över fel som tas upp i ett :exc:`Error`\-undantag i slutet av kopieringsprocessen. Du kan sätta den valfria flaggan *ignore_dangling_symlinks* till true om du vill tysta detta undantag. Observera att det här alternativet inte har någon effekt på plattformar som inte stöder :func:`os.symlink`.

source: If *ignore* is given, it must be a callable that will receive as its arguments the directory being visited by :func:`copytree`, and a list of its contents, as returned by :func:`os.listdir`. Since :func:`copytree` is called recursively, the *ignore* callable will be called once for each directory that is copied. The callable must return a sequence of directory and file names relative to the current directory (i.e. a subset of the items in its second argument); these names will then be ignored in the copy process. :func:`ignore_patterns` can be used to create such a callable that ignores names based on glob-style patterns.
pt_pt: Se *ignore* for fornecido, deve ser um objeto chamável que receberá como seus argumentos o diretório que está a ser visitado por :func:`copytree` e uma lista do seu conteúdo, conforme retornado por :func:`os.listdir`. Uma vez que :func:`copytree` é chamado recursivamente, o objeto chamável *ignore* será chamado uma vez para cada diretório que é copiado. O objeto chamável deve retornar uma sequência de nomes de diretórios e ficheiros relativos ao diretório atual (ou seja, um subconjunto dos itens no seu segundo argumento); estes nomes serão então ignorados no processo de cópia. :func:`ignore_patterns` pode ser usado para criar um objeto chamável que ignore nomes com base em padrões no estilo glob.
ru: Если указано *ignore*, это должен быть вызываемый объект, который получит в качестве аргументов каталог, который посещает :func:`copytree`, и список его содержимого, возвращаемый :func:`os.listdir`. Поскольку :func:`copytree` вызывается рекурсивно, вызываемая функция *ignore* будет вызываться один раз для каждого копируемого каталога. Вызываемый объект должен возвращать последовательность имен каталогов и файлов относительно текущего каталога (т. е. подмножество элементов в его втором аргументе); эти имена затем будут игнорироваться в процессе копирования. :func:`ignore_patterns` можно использовать для создания такого вызываемого объекта, который игнорирует имена на основе шаблонов в стиле glob.
sv: Om *ignore* anges, måste det vara en anropbar funktion som får som argument den katalog som besöks av :func:`copytree`, och en lista över dess innehåll, som returneras av :func:`os.listdir`. Eftersom :func:`copytree` anropas rekursivt, kommer anropet *ignore* att anropas en gång för varje katalog som kopieras. Anropet måste returnera en sekvens av katalog- och filnamn i förhållande till den aktuella katalogen (dvs. en delmängd av objekten i dess andra argument); dessa namn kommer sedan att ignoreras i kopieringsprocessen. :func:`ignore_patterns` kan användas för att skapa ett sådant anrop som ignorerar namn baserade på glob-liknande mönster.

source: If exception(s) occur, an :exc:`Error` is raised with a list of reasons.
pt_pt: Se ocorrerem exceção(ões), uma :exc:`Error` é levantada com uma lista de razões.
ru: Если возникают исключения, выдается сообщение :exc:`Error` со списком причин.
sv: Om ett eller flera undantag inträffar genereras ett :exc:`Error` med en lista över orsaker.

source: If *copy_function* is given, it must be a callable that will be used to copy each file. It will be called with the source path and the destination path as arguments. By default, :func:`~shutil.copy2` is used, but any function that supports the same signature (like :func:`~shutil.copy`) can be used.
pt_pt: Se *copy_function* for fornecido, deve ser um objeto chamável que será usado para copiar cada ficheiro. Será chamado com o caminho de origem e o caminho de destino como argumentos. Por predefinição, :func:`~shutil.copy2` é usado, mas qualquer função que suporte a mesma assinatura (como :func:`~shutil.copy`) pode ser usada.
ru: Если задана *copy_function*, это должен быть вызываемый объект, который будет использоваться для копирования каждого файла. Он будет вызываться с исходным путем и путем назначения в качестве аргументов. По умолчанию используется :func:`~shutil.copy2`, но можно использовать любую функцию, поддерживающую ту же сигнатуру (например, :func:`~shutil.copy`).
sv: Om *copy_function* anges måste det vara en anropsbar funktion som används för att kopiera varje fil. Den kommer att anropas med källsökvägen och destinationssökvägen som argument. Som standard används :func:`~shutil.copy2`, men alla funktioner som stöder samma signatur (som :func:`~shutil.copy`) kan användas.

source: If *dirs_exist_ok* is false (the default) and *dst* already exists, a :exc:`FileExistsError` is raised. If *dirs_exist_ok* is true, the copying operation will continue if it encounters existing directories, and files within the *dst* tree will be overwritten by corresponding files from the *src* tree.
pt_pt: Se *dirs_exist_ok* for falso (predefinição) e *dst* já existir, é levantado um :exc:`FileExistsError`. Se *dirs_exist_ok* for verdadeiro, a operação de cópia continuará se encontrar diretórios existentes, e os ficheiros dentro da árvore *dst* serão substituídos pelos ficheiros correspondentes da árvore *src*.
ru: Если *dirs_exist_ok* имеет значение false (по умолчанию) и *dst* уже существует, возникает ошибка :exc:`FileExistsError`. Если *dirs_exist_ok* имеет значение true, операция копирования продолжится, если она встретит существующие каталоги, и файлы в дереве *dst* будут перезаписаны соответствующими файлами из дерева *src*.
sv: Om *dirs_exist_ok* är false (standard) och *dst* redan existerar, uppstår ett :exc:`FileExistsError`. Om *dirs_exist_ok* är true fortsätter kopieringen om den stöter på befintliga kataloger, och filer i *dst*-trädet skrivs över av motsvarande filer från *src*-trädet.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copytree`` with arguments ``src``, ``dst``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copytree`` com os argumentos ``src``, ``dst``.
ru: Вызывает событие аудита <auditing>`shutil.copytree`` с аргументами ``src``, ``dst``.
sv: Utlöser en :ref:`auditing event <auditing>` ``shutil.copytree`` med argumenten ``src``, ``dst``.

source: Added the *copy_function* argument to be able to provide a custom copy function. Added the *ignore_dangling_symlinks* argument to silence dangling symlinks errors when *symlinks* is false.
pt_pt: Adicionado o argumento *copy_function* para permitir fornecer uma função de cópia personalizada. Adicionado o argumento *ignore_dangling_symlinks* para silenciar erros de ligações simbólicas pendentes quando *symlinks* é falso.
ru: Добавлен аргумент *copy_function*, позволяющий предоставить пользовательскую функцию копирования. Добавлен аргумент *ignore_dangling_symlinks* для отключения ошибок висячих символических ссылок, когда *symlinks* имеет значение false.
sv: Lagt till argumentet *copy_function* för att kunna tillhandahålla en anpassad kopieringsfunktion. Lagt till argumentet *ignore_dangling_symlinks* för att dämpa fel med dinglande symlänkar när *symlinks* är false.

source: Copy metadata when *symlinks* is false. Now returns *dst*.
pt_pt: Copiar metadados quando *symlinks* é falso. Agora retorna *dst*.
ru: Копировать метаданные, если *symlinks* имеет значение false. Теперь возвращает *dst*.
sv: Kopiera metadata när *symlinks* är false. Returnerar nu *dst*.

source: Added the *dirs_exist_ok* parameter.
pt_pt: Adicionado o parâmetro *dirs_exist_ok*.
ru: Добавлен параметр *dirs_exist_ok*.
sv: Parametern *dirs_exist_ok* har lagts till.

source: Delete an entire directory tree; *path* must point to a directory (but not a symbolic link to a directory). If *ignore_errors* is true, errors resulting from failed removals will be ignored; if false or omitted, such errors are handled by calling a handler specified by *onexc* or *onerror* or, if both are omitted, exceptions are propagated to the caller.
pt_pt: Apagar uma árvore de diretórios inteira; *path* deve apontar para um diretório (mas não para uma ligação simbólica para um diretório). Se *ignore_errors* for verdadeiro, os erros resultantes de remoções falhadas serão ignorados; se for falso ou omitido, esses erros são tratados chamando um manipulador especificado por *onexc* ou *onerror* ou, se ambos forem omitidos, as exceções são propagadas para o chamador.
ru: Удалить все дерево каталогов; *путь* должен указывать на каталог (но не на символическую ссылку на каталог). Если *ignore_errors* имеет значение true, ошибки, возникающие в результате неудачного удаления, будут игнорироваться; если false или опущено, такие ошибки обрабатываются путем вызова обработчика, указанного *onexc* или *onerror*, или, если оба опущены, исключения передаются вызывающей стороне.
sv: Ta bort ett helt katalogträd; *path* måste peka på en katalog (men inte på en symbolisk länk till en katalog). Om *ignore_errors* är true ignoreras fel som uppstår vid misslyckade borttagningar; om false eller utelämnas hanteras sådana fel genom att anropa en hanterare som specificeras av *onexc* eller *onerror* eller, om båda utelämnas, sprids undantag till den som anropar.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>`.
pt_pt: Esta função pode suportar :ref:`caminhos relativos a descritores de diretório <dir_fd>`.
ru: Эта функция может поддерживать пути относительно дескрипторов каталогов. `.
sv: Den här funktionen kan stödja :ref:`sökvägar som är relativa till katalogbeskrivare <dir_fd>`.
