Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shutil.po
Languages: pt_pt, ru, sv

source: *function* is the callable that will be used to unpack archives. The callable will receive the *base_name* of the file to create, followed by the *base_dir* (which defaults to :data:`os.curdir`) to start archiving from. Further arguments are passed as keyword arguments: *owner*, *group*, *dry_run* and *logger* (as passed in :func:`make_archive`).
pt_pt: *function* é o objeto chamável que será usado para descompactar arquivos. O objeto chamável receberá o *base_name* do ficheiro a criar, seguido do *base_dir* (que por predefinição é :data:`os.curdir`) para iniciar o arquivamento. Outros argumentos são passados como argumentos de palavra-chave: *owner*, *group*, *dry_run* e *logger* (como passados em :func:`make_archive`).
ru: *функция* — это вызываемая функция, которая будет использоваться для распаковки архивов. Вызываемый объект получит *base_name* создаваемого файла, за которым следует *base_dir* (по умолчанию это :data:`os.curdir`), с которого нужно начать архивирование. Дальнейшие аргументы передаются как аргументы ключевых слов: *owner*, *group*, *dry_run* и *logger* (как передано в :func:`make_archive`).
sv: *function* är den anropbara funktion som kommer att användas för att packa upp arkiv. Anropsfunktionen tar emot *base_name* för filen som ska skapas, följt av *base_dir* (som standard är :data:`os.curdir`) för att starta arkiveringen från. Ytterligare argument skickas som nyckelordsargument: *owner*, *group*, *dry_run* och *logger* (som skickas i :func:`make_archive`).

source: If *function* has the custom attribute ``function.supports_root_dir`` set to ``True``, the *root_dir* argument is passed as a keyword argument. Otherwise the current working directory of the process is temporarily changed to *root_dir* before calling *function*. In this case :func:`make_archive` is not thread-safe.
pt_pt: Se *function* tiver o atributo personalizado ``function.supports_root_dir`` definido como ``True``, o argumento *root_dir* é passado como um argumento de palavra-chave. Caso contrário, o diretório de trabalho atual do processo é temporariamente alterado para *root_dir* antes de chamar *function*. Neste caso, :func:`make_archive` não é seguro para threads.
ru: Если *function* имеет пользовательский атрибут function.supports_root_dir, установленный в True, аргумент *root_dir* передается как аргумент ключевого слова. В противном случае текущий рабочий каталог процесса временно изменяется на *root_dir* перед вызовом *function*. В этом случае :func:`make_archive` не является потокобезопасным.
sv: Om *function* har det anpassade attributet ``function.supports_root_dir`` inställt på ``True``, skickas *root_dir*-argumentet som ett nyckelordsargument. Annars ändras processens aktuella arbetskatalog tillfälligt till *root_dir* innan *function* anropas. I det här fallet är :func:`make_archive` inte trådsäker.

source: If given, *extra_args* is a sequence of ``(name, value)`` pairs that will be used as extra keywords arguments when the archiver callable is used.
pt_pt: Se fornecido, *extra_args* é uma sequência de pares ``(name, value)`` que serão usados como argumentos nomeados adicionais quando o objeto chamável do arquivador for usado.
ru: Если задано, *extra_args* представляет собой последовательность пар ``(имя, значение)``, которые будут использоваться в качестве дополнительных аргументов ключевых слов при использовании вызываемого архиватора.
sv: Om *extra_args* anges är det en sekvens av par av ``(namn, värde)`` som kommer att användas som extra nyckelordsargument när arkiverarens anropsbarhet används.

source: *description* is used by :func:`get_archive_formats` which returns the list of archivers. Defaults to an empty string.
pt_pt: *description* é usado por :func:`get_archive_formats`, que retorna a lista de arquivadores. Por predefinição, é uma string vazia.
ru: *описание* используется функцией :func:`get_archive_formats`, которая возвращает список архиваторов. По умолчанию пустая строка.
sv: *description* används av :func:`get_archive_formats` som returnerar en lista över arkivbildare. Standardvärdet är en tom sträng.

source: Added support for functions supporting the *root_dir* argument.
pt_pt: Adicionado suporte para funções que suportam o argumento *root_dir*.
ru: Добавлена ​​поддержка функций, поддерживающих аргумент *root_dir*.
sv: Lagt till stöd för funktioner som stöder argumentet *root_dir*.

source: Remove the archive format *name* from the list of supported formats.
pt_pt: Remover o formato de arquivo *name* da lista de formatos suportados.
ru: Удалите формат архива *имя* из списка поддерживаемых форматов.
sv: Ta bort arkivformatet *name* från listan över format som stöds.

source: Unpack an archive. *filename* is the full path of the archive.
pt_pt: Descompactar um arquivo. *filename* é o caminho completo do arquivo.
ru: Распаковать архив. *имя_файла* — полный путь к архиву.
sv: Packa upp ett arkiv. *filnamn* är den fullständiga sökvägen till arkivet.

source: *extract_dir* is the name of the target directory where the archive is unpacked. If not provided, the current working directory is used.
pt_pt: *extract_dir* é o nome do diretório de destino onde o arquivo é descompactado. Se não for fornecido, é usado o diretório de trabalho atual.
ru: *extract_dir* — имя целевой директории, в которую распакован архив. Если не указано, используется текущий рабочий каталог.
sv: *extract_dir* är namnet på den målkatalog där arkivet ska packas upp. Om det inte anges används den aktuella arbetskatalogen.

source: *format* is the archive format: one of "zip", "tar", "gztar", "bztar", "xztar", or "zstdtar". Or any other format registered with :func:`register_unpack_format`. If not provided, :func:`unpack_archive` will use the archive file name extension and see if an unpacker was registered for that extension. In case none is found, a :exc:`ValueError` is raised.
pt_pt: *format* é o formato do arquivo: um de "zip", "tar", "gztar", "bztar", "xztar", ou "zstdtar". Ou qualquer outro formato registado com :func:`register_unpack_format`. Se não for fornecido, :func:`unpack_archive` usará a extensão do nome do ficheiro do arquivo e verificará se um descompactador foi registado para essa extensão. Caso nenhum seja encontrado, é levantada uma :exc:`ValueError`.

source: The keyword-only *filter* argument is passed to the underlying unpacking function. For zip files, *filter* is not accepted. For tar files, it is recommended to use ``'data'`` (default since Python 3.14), unless using features specific to tar and UNIX-like filesystems. (See :ref:`tarfile-extraction-filter` for details.)
pt_pt: O argumento *filter*, apenas de palavra-chave, é passado para a função de descompactação subjacente. Para ficheiros zip, *filter* não é aceite. Para ficheiros tar, é recomendado usar ``'data'`` (predefinição desde o Python 3.14), a menos que esteja a usar funcionalidades específicas do tar e de sistemas de ficheiros tipo UNIX. (Veja :ref:`tarfile-extraction-filter` para mais detalhes.)

source: Raises an :ref:`auditing event <auditing>` ``shutil.unpack_archive`` with arguments ``filename``, ``extract_dir``, ``format``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.unpack_archive`` com os argumentos ``filename``, ``extract_dir``, ``format``.
ru: Вызывает :ref:`событие аудита <auditing>` ``shutil.unpack_archive`` с аргументами ``filename``, ``extract_dir``, ``format``.
sv: Utlöser en :ref:`auditing event <auditing>` ``shutil.unpack_archive`` med argumenten ``filename``, ``extract_dir``, ``format``.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of the path specified in the *extract_dir* argument, e.g. members that have absolute filenames starting with "/" or filenames with two dots "..".
pt_pt: Nunca extraia arquivos de fontes não confiáveis sem inspeção prévia. É possível que ficheiros sejam criados fora do caminho especificado no argumento *extract_dir*, por exemplo, membros que tenham nomes de ficheiros absolutos começando com "/" ou nomes de ficheiros com dois pontos "..".
ru: Никогда не извлекайте архивы из ненадежных источников без предварительной проверки. Возможно, что файлы создаются за пределами пути, указанного в аргументе *extract_dir*, например, члены, абсолютные имена которых начинаются с «/», или имена файлов с двумя точками «..».
sv: Extrahera aldrig arkiv från otillförlitliga källor utan föregående inspektion. Det är möjligt att filer skapas utanför den sökväg som anges i argumentet *extract_dir*, t.ex. medlemmar som har absoluta filnamn som börjar med "/" eller filnamn med två punkter "...".

source: Since Python 3.14, the defaults for both built-in formats (zip and tar files) will prevent the most dangerous of such security issues, but will not prevent *all* unintended behavior. Read the :ref:`tarfile-further-verification` section for tar-specific details.
pt_pt: Desde o Python 3.14, as predefinições para ambos os formatos incorporados (ficheiros zip e tar) prevenirão os problemas de segurança mais perigosos, mas não prevenirão *todo* o comportamento não intencional. Leia a secção :ref:`tarfile-further-verification` para detalhes específicos do tar.

source: Accepts a :term:`path-like object` for *filename* and *extract_dir*.
pt_pt: Aceita um :term:`objeto semelhante a caminho` para *filename* e *extract_dir*.
ru: Принимает :term:`объект, подобный пути` для *filename* и *extract_dir*.
sv: Accepterar en :term:`path-like object` för *filename* och *extract_dir*.

source: Added the *filter* argument.
pt_pt: Adicionado o argumento *filter*.
ru: Добавлен аргумент *filter*.
sv: Lagt till argumentet *filter*.

source: Registers an unpack format. *name* is the name of the format and *extensions* is a list of extensions corresponding to the format, like ``.zip`` for Zip files.
pt_pt: Regista um formato de descompactação. *name* é o nome do formato e *extensions* é uma lista de extensões correspondentes ao formato, como ``.zip`` para ficheiros Zip.
ru: Регистрирует формат распаковки. *имя* — это имя формата, а *расширения* — это список расширений, соответствующих формату, например «.zip» для Zip-файлов.
sv: Registrerar ett uppackningsformat. *name* är namnet på formatet och *extensions* är en lista med tillägg som motsvarar formatet, t.ex. ``.zip`` för Zip-filer.

source: *function* is the callable that will be used to unpack archives. The callable will receive:
pt_pt: *function* é o objeto chamável que será usado para descompactar arquivos. O objeto chamável receberá:
ru: *функция* — это вызываемая функция, которая будет использоваться для распаковки архивов. Вызываемый получит:
sv: *function* är den anropbara funktion som kommer att användas för att packa upp arkiv. Den anropsbara funktionen kommer att ta emot:

source: the path of the archive, as a positional argument;
pt_pt: o caminho do arquivo, como um argumento posicional;
ru: путь к архиву, как позиционный аргумент;
sv: sökvägen till arkivet, som ett positionellt argument;

source: the directory the archive must be extracted to, as a positional argument;
pt_pt: o diretório para o qual o arquivo deve ser extraído, como um argumento posicional;
ru: каталог, в который должен быть распакован архив, в качестве позиционного аргумента;
sv: den katalog som arkivet måste extraheras till, som ett positionellt argument;

source: possibly a *filter* keyword argument, if it was given to :func:`unpack_archive`;
pt_pt: possivelmente um argumento de palavra-chave *filter*, se foi fornecido a :func:`unpack_archive`;
ru: возможно, аргумент ключевого слова *filter*, если он был передан :func:`unpack_archive`;
sv: eventuellt ett *filter* nyckelordsargument, om det gavs till :func:`unpack_archive`;

source: additional keyword arguments, specified by *extra_args* as a sequence of ``(name, value)`` tuples.
pt_pt: argumentos nomeados adicionais, especificados por *extra_args* como uma sequência de tuplos ``(name, value)``.
ru: дополнительные аргументы ключевого слова, указанные *extra_args* как последовательность кортежей ``(имя, значение)``.
sv: ytterligare nyckelordsargument, specificerade av *extra_args* som en sekvens av ``(namn, värde)``\-tupler.

source: *description* can be provided to describe the format, and will be returned by the :func:`get_unpack_formats` function.
pt_pt: *description* pode ser fornecido para descrever o formato e será retornado pela função :func:`get_unpack_formats`.
ru: *description* может быть предоставлено для описания формата и будет возвращено функцией :func:`get_unpack_formats`.
sv: *description* kan anges för att beskriva formatet och kommer att returneras av funktionen :func:`get_unpack_formats`.

source: Unregister an unpack format. *name* is the name of the format.
pt_pt: Remover o registo de um formato de descompactação. *name* é o nome do formato.
ru: Отмените регистрацию формата распаковки. *имя* — это имя формата.
sv: Avregistrera ett uppackningsformat. *name* är namnet på formatet.

source: Return a list of all registered formats for unpacking. Each element of the returned sequence is a tuple ``(name, extensions, description)``.
pt_pt: Retorna uma lista de todos os formatos registados para descompactação. Cada elemento da sequência retornada é um tuplo ``(name, extensions, description)``.
ru: Возвращает список всех зарегистрированных форматов для распаковки. Каждый элемент возвращаемой последовательности представляет собой кортеж ``(имя, расширения, описание)``.
sv: Returnerar en lista över alla registrerade format för uppackning. Varje element i den returnerade sekvensen är en tupel ``(name, extensions, description)``.

source: *zip*: ZIP file (unpacking compressed files works only if the corresponding module is available).
pt_pt: *zip*: Ficheiro ZIP (a descompactação de ficheiros comprimidos funciona apenas se o módulo correspondente estiver disponível).
ru: *zip*: ZIP-файл (распаковка сжатых файлов работает только при наличии соответствующего модуля).
sv: *zip*: ZIP-fil (uppackning av komprimerade filer fungerar endast om motsvarande modul finns tillgänglig).

source: *tar*: uncompressed tar file.
pt_pt: *tar*: ficheiro tar não comprimido.
ru: *tar*: несжатый файл tar.
sv: *tar*: okomprimerad tar-fil.

source: You can register new formats or provide your own unpacker for any existing formats, by using :func:`register_unpack_format`.
pt_pt: Pode registar novos formatos ou fornecer o seu próprio descompactador para quaisquer formatos existentes, usando :func:`register_unpack_format`.
ru: Вы можете зарегистрировать новые форматы или предоставить свой собственный распаковщик для любых существующих форматов, используя :func:`register_unpack_format`.
sv: Du kan registrera nya format eller tillhandahålla din egen uppackare för befintliga format genom att använda :func:`register_unpack_format`.

source: Archiving example
pt_pt: Exemplo de arquivamento
ru: Пример архивации
sv: Exempel på arkivering

source: In this example, we create a gzip'ed tar-file archive containing all files found in the :file:`.ssh` directory of the user::
pt_pt: Neste exemplo, criamos um arquivo tar comprimido com gzip contendo todos os ficheiros encontrados no diretório :file:`.ssh` do utilizador::
ru: В этом примере мы создаем архив tar-файлов в формате gzip, содержащий все файлы, найденные в каталоге :file:`.ssh` пользователя::
sv: I det här exemplet skapar vi ett gzip-komprimerat tar-filarkiv som innehåller alla filer som finns i :file:`.ssh`\-katalogen för användaren::

source: The resulting archive contains:
pt_pt: O arquivo resultante contém:
ru: Полученный архив содержит:
sv: Det resulterande arkivet innehåller:

source: Archiving example with *base_dir*
pt_pt: Exemplo de arquivamento com *base_dir*
ru: Пример архивирования с помощью *base_dir*
sv: Exempel på arkivering med *base_dir*

source: In this example, similar to the `one above <shutil-archiving-example_>`_, we show how to use :func:`make_archive`, but this time with the usage of *base_dir*. We now have the following directory structure:
pt_pt: Neste exemplo, semelhante ao `acima <shutil-archiving-example_>`_, mostramos como usar :func:`make_archive`, mas desta vez com o uso de *base_dir*. Temos agora a seguinte estrutura de diretórios:
ru: В этом примере, аналогичном приведенному выше <shutil-archiving-example_>`_, мы показываем, как использовать :func:`make_archive`, но на этот раз с использованием *base_dir*. Теперь у нас есть следующая структура каталогов:
sv: I det här exemplet, som liknar `exemplet ovan <shutil-archiving-example_>`_, visar vi hur man använder :func:`make_archive`, men den här gången med *base_dir*. Vi har nu följande katalogstruktur:

source: In the final archive, :file:`please_add.txt` should be included, but :file:`do_not_add.txt` should not. Therefore we use the following::
pt_pt: No arquivo final, :file:`please_add.txt` deve ser incluído, mas :file:`do_not_add.txt` não deve. Portanto, usamos o seguinte::
ru: В финальный архив должен быть включен :file:`please_add.txt`, а :file:`do_not_add.txt` — нет. Поэтому мы используем следующее:
sv: I det slutliga arkivet ska :file:`please_add.txt` ingå, men :file:`do_not_add.txt` ska inte ingå. Därför använder vi följande::

source: Listing the files in the resulting archive gives us:
pt_pt: Listar os ficheiros no arquivo resultante dá-nos:
ru: Листинг файлов в полученном архиве дает нам:
sv: En lista över filerna i det resulterande arkivet ger oss:

source: Querying the size of the output terminal
pt_pt: Consultar o tamanho do terminal de saída
ru: Запрос размера выходного терминала
sv: Fråga om storleken på utdataterminalen

source: Get the size of the terminal window.
pt_pt: Obter o tamanho da janela do terminal.
ru: Получите размер окна терминала.
sv: Hämta storleken på terminalfönstret.

source: For each of the two dimensions, the environment variable, ``COLUMNS`` and ``LINES`` respectively, is checked. If the variable is defined and the value is a positive integer, it is used.
pt_pt: Para cada uma das duas dimensões, a variável de ambiente, ``COLUMNS`` e ``LINES`` respetivamente, é verificada. Se a variável estiver definida e o valor for um inteiro positivo, é usado.
ru: Для каждого из двух измерений проверяется переменная среды COLUMNS и LINES соответственно. Если переменная определена и ее значение является положительным целым числом, она используется.
sv: För var och en av de två dimensionerna kontrolleras miljövariabeln ``COLUMNS`` respektive ``LINES``. Om variabeln är definierad och värdet är ett positivt heltal används den.

source: When ``COLUMNS`` or ``LINES`` is not defined, which is the common case, the terminal connected to :data:`sys.__stdout__` is queried by invoking :func:`os.get_terminal_size`.
pt_pt: Quando ``COLUMNS`` ou ``LINES`` não estiverem definidas, o que é o caso comum, o terminal ligado a :data:`sys.__stdout__` é consultado invocando :func:`os.get_terminal_size`.
ru: Когда COLUMNS или LINES не определены, что является распространенным случаем, терминал, подключенный к :data:`sys.__stdout__`, опрашивается путем вызова :func:`os.get_terminal_size`.
sv: När ``COLUMNS`` eller ``LINES`` inte är definierade, vilket är det vanliga fallet, frågas terminalen som är ansluten till :data:`sys.__stdout__` genom att anropa :func:`os.get_terminal_size`.

source: If the terminal size cannot be successfully queried, either because the system doesn't support querying, or because we are not connected to a terminal, the value given in ``fallback`` parameter is used. ``fallback`` defaults to ``(80, 24)`` which is the default size used by many terminal emulators.
pt_pt: Se o tamanho do terminal não puder ser consultado com sucesso, seja porque o sistema não suporta a consulta, ou porque não estamos ligados a um terminal, é usado o valor fornecido no parâmetro ``fallback``. ``fallback`` tem como predefinição ``(80, 24)``, que é o tamanho predefinido usado por muitos emuladores de terminal.
ru: Если размер терминала не может быть успешно запрошен либо потому, что система не поддерживает запросы, либо потому, что мы не подключены к терминалу, используется значение, указанное в параметре «fallback». ``fallback`` по умолчанию имеет значение ``(80, 24)``, которое является размером по умолчанию, используемым многими эмуляторами терминала.
sv: Om det inte går att fråga efter terminalstorleken, antingen för att systemet inte stöder en sådan fråga eller för att vi inte är anslutna till en terminal, används det värde som anges i parametern ``fallback``. standardvärdet för ``fallback`` är ``(80, 24)``, vilket är den standardstorlek som används av många terminalemulatorer.

source: The value returned is a named tuple of type :class:`os.terminal_size`.
pt_pt: O valor retornado é um tuplo nomeado do tipo :class:`os.terminal_size`.
ru: Возвращаемое значение представляет собой именованный кортеж типа :class:`os.terminal_size`.
sv: Det värde som returneras är en namngiven tupel av typen :class:`os.terminal_size`.

source: See also: The Single UNIX Specification, Version 2, `Other Environment Variables`_.
pt_pt: Veja também: The Single UNIX Specification, Versão 2, `Outras Variáveis de Ambiente`_.
ru: См. также: Единая спецификация UNIX, версия 2, «Другие переменные среды».
sv: Se även: The Single UNIX Specification, Version 2, `Other Environment Variables`_.

source: The ``fallback`` values are also used if :func:`os.get_terminal_size` returns zeroes.
pt_pt: Os valores ``fallback`` também são usados se :func:`os.get_terminal_size` retornar zeros.
ru: Значения ``fallback`` также используются, если :func:`os.get_terminal_size` возвращает нули.
sv: ``fallback``\-värdena används också om :func:`os.get_terminal_size` returnerar noll.

source: file
pt_pt: ficheiro
ru: файл
sv: fil

source: copying
pt_pt: cópia
ru: копирование
sv: kopiering

source: copying files
pt_pt: copiar ficheiros
ru: копирование файлов
sv: kopiering av filer

source: directory
pt_pt: diretório
ru: каталог

source: deleting
pt_pt: apagar
ru: удаление
sv: radering

source: This function is not thread-safe when custom archivers registered with :func:`register_archive_format` do not support the *root_dir* argument. In this case it temporarily changes the current working directory of the process to *root_dir* to perform archiving.
ru: Эта функция не является потокобезопасной, если пользовательские архиваторы, зарегистрированные с помощью :func:`register_archive_format`, не поддерживают аргумент *root_dir*. В этом случае он временно меняет текущий рабочий каталог процесса на *root_dir* для выполнения архивирования.
sv: Den här funktionen är inte trådsäker när anpassade arkiverare som registrerats med :func:`register_archive_format` inte stöder argumentet *root_dir*. I så fall ändras processens aktuella arbetskatalog tillfälligt till *root_dir* för att utföra arkivering.
