Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shutil.po
Languages: pt_pt, ru, sv

source: On platforms that support the necessary fd-based functions a symlink attack resistant version of :func:`rmtree` is used by default. On other platforms, the :func:`rmtree` implementation is susceptible to a symlink attack: given proper timing and circumstances, attackers can manipulate symlinks on the filesystem to delete files they wouldn't be able to access otherwise. Applications can use the :data:`rmtree.avoids_symlink_attacks` function attribute to determine which case applies.
pt_pt: Em plataformas que suportam as funções necessárias baseadas em fd, uma versão de :func:`rmtree` resistente a ataques de ligação simbólica é usada por predefinição. Noutras plataformas, a implementação de :func:`rmtree` é susceptível a um ataque de ligação simbólica: dado o timing e as circunstâncias adequadas, os atacantes podem manipular ligações simbólicas no sistema de ficheiros para apagar ficheiros aos quais não teriam acesso de outra forma. As aplicações podem usar o atributo de função :data:`rmtree.avoids_symlink_attacks` para determinar qual caso se aplica.
ru: На платформах, поддерживающих необходимые функции на основе fd, по умолчанию используется устойчивая к атакам символических ссылок версия :func:`rmtree`. На других платформах реализация :func:`rmtree` подвержена атаке по символическим ссылкам: при правильном выборе времени и обстоятельствах злоумышленники могут манипулировать символическими ссылками в файловой системе, чтобы удалить файлы, к которым в противном случае они не смогли бы получить доступ. Приложения могут использовать атрибут функции :data:`rmtree.avoids_symlink_attacks`, чтобы определить, какой случай применим.
sv: På plattformar som stöder de nödvändiga fd-baserade funktionerna används som standard en version av :func:`rmtree` som är motståndskraftig mot symlänkattacker. På andra plattformar är implementeringen av :func:`rmtree` känslig för en symlänk-attack: med rätt timing och omständigheter kan angripare manipulera symlinks i filsystemet för att radera filer som de annars inte skulle ha tillgång till. Program kan använda funktionsattributet :data:`rmtree.avoids_symlink_attacks` för att avgöra vilket fall som gäller.

source: If *onexc* is provided, it must be a callable that accepts three parameters: *function*, *path*, and *excinfo*.
pt_pt: Se *onexc* for fornecido, deve ser um objeto chamável que aceite três parâmetros: *function*, *path* e *excinfo*.
ru: Если указан *onexc*, это должен быть вызываемый объект, принимающий три параметра: *function*, *path* и *excinfo*.
sv: Om *onexc* anges måste det vara en callable som accepterar tre parametrar: *funktion*, *sökväg* och *excinfo*.

source: The first parameter, *function*, is the function which raised the exception; it depends on the platform and implementation. The second parameter, *path*, will be the path name passed to *function*. The third parameter, *excinfo*, is the exception that was raised. Exceptions raised by *onexc* will not be caught.
pt_pt: O primeiro parâmetro, *function*, é a função que levantou a exceção; depende da plataforma e da implementação. O segundo parâmetro, *path*, será o nome do caminho passado para *function*. O terceiro parâmetro, *excinfo*, é a exceção que foi levantada. Exceções levantadas por *onexc* não serão capturadas.
ru: Первый параметр, *function*, — это функция, вызвавшая исключение; это зависит от платформы и реализации. Второй параметр, *path*, будет именем пути, передаваемым в *function*. Третий параметр, *excinfo*, является возникшим исключением. Исключения, вызванные *onexc*, не будут перехвачены.
sv: Den första parametern, *function*, är den funktion som orsakade undantaget; den beror på plattform och implementering. Den andra parametern, *path*, är det sökvägsnamn som skickas till *function*. Den tredje parametern, *excinfo*, är det undantag som uppstod. Undantag som orsakas av *onexc* kommer inte att fångas upp.

source: The deprecated *onerror* is similar to *onexc*, except that the third parameter it receives is the tuple returned from :func:`sys.exc_info`.
pt_pt: O *onerror* obsoleto é semelhante a *onexc*, exceto que o terceiro parâmetro que recebe é o tuplo retornado de :func:`sys.exc_info`.
ru: Устаревший *onerror* аналогичен *onexc*, за исключением того, что третий параметр, который он получает, — это кортеж, возвращаемый из :func:`sys.exc_info`.
sv: Den föråldrade *onerror* liknar *onexc*, förutom att den tredje parametern den tar emot är den tupel som returneras från :func:`sys.exc_info`.

source: :ref:`shutil-rmtree-example` for an example of handling the removal of a directory tree that contains read-only files.
pt_pt: :ref:`shutil-rmtree-example` para um exemplo de como lidar com a remoção de uma árvore de diretórios que contém ficheiros de apenas leitura.
sv: :ref:`shutil-rmtree-example` för ett exempel på hur man hanterar borttagningen av ett katalogträd som innehåller skrivskyddade filer.

source: Raises an :ref:`auditing event <auditing>` ``shutil.rmtree`` with arguments ``path``, ``dir_fd``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.rmtree`` com os argumentos ``path``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита <auditing>``shutil.rmtree`` с аргументами ``path``, ``dir_fd``.
sv: Utlöser en :ref:`auditing event <auditing>` ``shutil.rmtree`` med argumenten ``path``, ``dir_fd``.

source: Added a symlink attack resistant version that is used automatically if platform supports fd-based functions.
pt_pt: Adicionada uma versão resistente a ataques de ligação simbólica que é usada automaticamente se a plataforma suportar funções baseadas em fd.
ru: Добавлена ​​версия, устойчивая к атакам по символическим ссылкам, которая используется автоматически, если платформа поддерживает функции на основе fd.
sv: Lagt till en version som är motståndskraftig mot symlink-attacker och som används automatiskt om plattformen stöder fd-baserade funktioner.

source: On Windows, will no longer delete the contents of a directory junction before removing the junction.
pt_pt: No Windows, já não apagará o conteúdo de uma junção de diretório antes de remover a junção.
ru: В Windows больше не будет удаляться содержимое соединения каталогов перед удалением соединения.
sv: I Windows tas inte längre innehållet i en katalogövergång bort innan övergången tas bort.

source: Added the *dir_fd* parameter.
pt_pt: Adicionado o parâmetro *dir_fd*.
ru: Добавлен параметр *dir_fd*.
sv: Parametern *dir_fd* har lagts till.

source: Added the *onexc* parameter, deprecated *onerror*.
pt_pt: Adicionado o parâmetro *onexc*, *onerror* obsoleto.
ru: Добавлен параметр *onexc*, устаревший *onerror*.
sv: Parametern *onexc* tillagd, *onerror* borttagen.

source: :func:`!rmtree` now ignores :exc:`FileNotFoundError` exceptions for all but the top-level path. Exceptions other than :exc:`OSError` and subclasses of :exc:`!OSError` are now always propagated to the caller.
pt_pt: :func:`!rmtree` agora ignora exceções :exc:`FileNotFoundError` para todos os caminhos exceto o de nível superior. Exceções que não sejam :exc:`OSError` e subclasses de :exc:`!OSError` são agora sempre propagadas para o chamador.
ru: :func:`!rmtree` теперь игнорирует исключения :exc:`FileNotFoundError` для всех путей, кроме пути верхнего уровня. Исключения, кроме :exc:`OSError` и подклассов :exc:`!OSError`, теперь всегда передаются вызывающей стороне.
sv: :func:`!rmtree` ignorerar nu :exc:`FileNotFoundError`\-undantag för alla utom sökvägen på högsta nivån. Andra undantag än :exc:`OSError` och underklasser till :exc:`!OSError` sprids nu alltid till den som anropar.

source: Indicates whether the current platform and implementation provides a symlink attack resistant version of :func:`rmtree`. Currently this is only true for platforms supporting fd-based directory access functions.
pt_pt: Indica se a plataforma e implementação atuais fornecem uma versão de :func:`rmtree` resistente a ataques de ligação simbólica. Atualmente, isto só é verdadeiro para plataformas que suportam funções de acesso a diretórios baseadas em fd.
ru: Указывает, предоставляет ли текущая платформа и реализация устойчивую к атакам символических ссылок версию :func:`rmtree`. В настоящее время это справедливо только для платформ, поддерживающих функции доступа к каталогам на основе fd.
sv: Anger om den aktuella plattformen och implementationen tillhandahåller en version av :func:`rmtree` som är motståndskraftig mot symlink-attacker. För närvarande gäller detta endast för plattformar som stöder fd-baserade funktioner för katalogåtkomst.

source: Recursively move a file or directory (*src*) to another location and return the destination.
pt_pt: Mover recursivamente um ficheiro ou diretório (*src*) para outro local e retornar o destino.
ru: Рекурсивно переместите файл или каталог (*src*) в другое место и верните место назначения.
sv: Flytta rekursivt en fil eller katalog (*src*) till en annan plats och returnera destinationen.

source: If *dst* is an existing directory or a symlink to a directory, then *src* is moved inside that directory. The destination path in that directory must not already exist.
pt_pt: Se *dst* for um diretório existente ou uma ligação simbólica para um diretório, então *src* é movido para dentro desse diretório. O caminho de destino nesse diretório não deve já existir.
ru: Если *dst* — существующий каталог или символическая ссылка на каталог, то *src* перемещается внутрь этого каталога. Путь назначения в этом каталоге еще не должен существовать.
sv: Om *dst* är en befintlig katalog eller en symlänk till en katalog, flyttas *src* till den katalogen. Målsökvägen i den katalogen får inte redan existera.

source: If *dst* already exists but is not a directory, it may be overwritten depending on :func:`os.rename` semantics.
pt_pt: Se *dst* já existir, mas não for um diretório, pode ser substituído, dependendo da semântica de :func:`os.rename`.
ru: Если *dst* уже существует, но не является каталогом, он может быть перезаписан в зависимости от семантики :func:`os.rename`.
sv: Om *dst* redan finns men inte är en katalog kan den komma att skrivas över beroende på :func:`os.rename` semantik.

source: If the destination is on the current filesystem, then :func:`os.rename` is used. Otherwise, *src* is copied to the destination using *copy_function* and then removed. In case of symlinks, a new symlink pointing to the target of *src* will be created as the destination and *src* will be removed.
pt_pt: Se o destino estiver no sistema de ficheiros atual, então :func:`os.rename` é usado. Caso contrário, *src* é copiado para o destino usando *copy_function* e depois removido. No caso de ligações simbólicas, uma nova ligação simbólica apontando para o alvo de *src* será criada como destino e *src* será removido.
ru: Если место назначения находится в текущей файловой системе, то используется :func:`os.rename`. В противном случае *src* копируется в место назначения с помощью *copy_function*, а затем удаляется. В случае символических ссылок в качестве места назначения будет создана новая символическая ссылка, указывающая на цель *src*, а *src* будет удален.
sv: Om destinationen finns i det aktuella filsystemet används :func:`os.rename`. Annars kopieras *src* till destinationen med hjälp av *copy_function* och tas sedan bort. Om det gäller symlinks skapas en ny symlink som pekar på målet för *src* som destination och *src* tas bort.

source: If *copy_function* is given, it must be a callable that takes two arguments, *src* and the destination, and will be used to copy *src* to the destination if :func:`os.rename` cannot be used. If the source is a directory, :func:`copytree` is called, passing it the *copy_function*. The default *copy_function* is :func:`copy2`. Using :func:`~shutil.copy` as the *copy_function* allows the move to succeed when it is not possible to also copy the metadata, at the expense of not copying any of the metadata.
pt_pt: Se *copy_function* for fornecido, deve ser um objeto chamável que aceite dois argumentos, *src* e o destino, e será usado para copiar *src* para o destino se :func:`os.rename` não puder ser usado. Se a origem for um diretório, :func:`copytree` é chamado, passando-lhe a *copy_function*. A *copy_function* predefinida é :func:`copy2`. Usar :func:`~shutil.copy` como *copy_function* permite que a movimentação tenha sucesso quando não for possível copiar também os metadados, à custa de não copiar quaisquer metadados.
ru: Если указана *copy_function*, она должна быть вызываемой функцией, которая принимает два аргумента: *src* и пункт назначения, и будет использоваться для копирования *src* в пункт назначения, если :func:`os.rename` не может быть использована. Если источником является каталог, вызывается :func:`copytree`, передавая ему *copy_function*. По умолчанию *copy_function* — :func:`copy2`. Использование :func:`~shutil.copy` в качестве *copy_function* позволяет успешному перемещению, когда невозможно также скопировать метаданные, за счет отсутствия копирования каких-либо метаданных.
sv: Om *copy_function* anges måste det vara en anropsbar funktion som tar två argument, *src* och destinationen, och som kommer att användas för att kopiera *src* till destinationen om :func:`os.rename` inte kan användas. Om källan är en katalog anropas :func:`copytree` som får *copy_function*. Standard *copy_function* är :func:`copy2`. Genom att använda :func:`~shutil.copy` som *copy_function* kan flytten lyckas när det inte är möjligt att även kopiera metadata, på bekostnad av att inga metadata kopieras.

source: Raises an :ref:`auditing event <auditing>` ``shutil.move`` with arguments ``src``, ``dst``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.move`` com os argumentos ``src``, ``dst``.
ru: Вызывает событие аудита <auditing>`shutil.move`` с аргументами ``src``, ``dst``.
sv: Utlöser en :ref:`auditing event <auditing>` ``shutil.move`` med argumenten ``src``, ``dst``.

source: Added explicit symlink handling for foreign filesystems, thus adapting it to the behavior of GNU's :program:`mv`. Now returns *dst*.
pt_pt: Adicionado tratamento explícito de ligações simbólicas para sistemas de ficheiros estrangeiros, adaptando-o assim ao comportamento do :program:`mv` do GNU. Agora retorna *dst*.
ru: Добавлена ​​явная обработка символических ссылок для сторонних файловых систем, таким образом адаптируя ее к поведению программы GNU :program:`mv`. Теперь возвращает *dst*.
sv: Lade till explicit symlänkhantering för utländska filsystem och anpassade den därmed till beteendet i GNU:s :program:`mv`. Returnerar nu *dst*.

source: Added the *copy_function* keyword argument.
pt_pt: Adicionado o argumento de palavra-chave *copy_function*.
ru: Добавлен аргумент ключевого слова *copy_function*.
sv: Lagt till nyckelordsargumentet *copy_function*.

source: Accepts a :term:`path-like object` for both *src* and *dst*.
pt_pt: Aceita um :term:`objeto semelhante a caminho` para *src* e *dst*.
ru: Принимает объект, похожий на путь, как для *src*, так и для *dst*.
sv: Accepterar en :term:`path-like object` för både *src* och *dst*.

source: Return disk usage statistics about the given path as a :term:`named tuple` with the attributes *total*, *used* and *free*, which are the amount of total, used and free space, in bytes. *path* may be a file or a directory.
pt_pt: Retornar estatísticas de utilização do disco sobre o caminho dado como um :term:`tuplo nomeado` com os atributos *total*, *used* e *free*, que são a quantidade de espaço total, usado e livre, em bytes. *path* pode ser um ficheiro ou um diretório.
ru: Возвращает статистику использования диска по заданному пути в виде :term:`именованного кортежа` с атрибутами *total*, *used* и *free*, которые представляют собой объем общего, использованного и свободного пространства в байтах. *path* может быть файлом или каталогом.
sv: Returnerar diskanvändningsstatistik för den angivna sökvägen som en :term:`named tuple` med attributen *total*, *used* och *free*, som är mängden totalt, använt och ledigt utrymme i byte. *path* kan vara en fil eller en katalog.

source: On Unix filesystems, *path* must point to a path within a **mounted** filesystem partition. On those platforms, CPython doesn't attempt to retrieve disk usage information from non-mounted filesystems.
pt_pt: Nos sistemas de ficheiros Unix, *path* deve apontar para um caminho dentro de uma partição de sistema de ficheiros **montada**. Nessas plataformas, o CPython não tenta recuperar informações de utilização do disco de sistemas de ficheiros não montados.
ru: В файловых системах Unix *path* должен указывать на путь внутри **смонтированного** раздела файловой системы. На этих платформах CPython не пытается получить информацию об использовании диска из несмонтированных файловых систем.
sv: På Unix-filsystem måste *path* peka på en sökväg inom en **monterad** filsystemspartition. På dessa plattformar försöker CPython inte att hämta information om diskanvändning från icke monterade filsystem.

source: On Windows, *path* can now be a file or directory.
pt_pt: No Windows, *path* pode agora ser um ficheiro ou diretório.
ru: В Windows *path* теперь может быть файлом или каталогом.
sv: I Windows kan *path* nu vara en fil eller katalog.

source: Availability
pt_pt: Disponibilidade
ru: Доступность
sv: Tillgänglighet

source: Change owner *user* and/or *group* of the given *path*.
pt_pt: Alterar o proprietário *user* e/ou *group* do *path* dado.
ru: Измените владельца *пользователя* и/или *группу* данного *пути*.
sv: Ändra ägare *user* och/eller *group* för den angivna *path*.

source: *user* can be a system user name or a uid; the same applies to *group*. At least one argument is required.
pt_pt: *user* pode ser um nome de utilizador do sistema ou um uid; o mesmo se aplica a *group*. Pelo menos um argumento é necessário.
ru: *user* может быть именем системного пользователя или идентификатором пользователя; то же самое относится и к *группе*. Требуется хотя бы один аргумент.
sv: *user* kan vara ett systemanvändarnamn eller ett uid; samma sak gäller för *group*. Minst ett argument krävs.

source: See also :func:`os.chown`, the underlying function.
pt_pt: Veja também :func:`os.chown`, a função subjacente.
ru: См. также :func:`os.chown`, базовую функцию.
sv: Se även :func:`os.chown`, den underliggande funktionen.

source: Raises an :ref:`auditing event <auditing>` ``shutil.chown`` with arguments ``path``, ``user``, ``group``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.chown`` com os argumentos ``path``, ``user``, ``group``.
ru: Вызывает :ref:`событие аудита <auditing>``shutil.chown`` с аргументами ``path``, ``user``, ``group``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``shutil.chown`` med argumenten ``path``, ``user``, ``group``.

source: Added *dir_fd* and *follow_symlinks* parameters.
pt_pt: Adicionados os parâmetros *dir_fd* e *follow_symlinks*.
ru: Добавлены параметры *dir_fd* и *follow_symlinks*.
sv: Parametrarna *dir_fd* och *follow_symlinks* har lagts till.

source: Return the path to an executable which would be run if the given *cmd* was called. If no *cmd* would be called, return ``None``.
pt_pt: Retornar o caminho para um executável que seria executado se o *cmd* dado fosse chamado. Se nenhum *cmd* fosse chamado, retornar ``None``.
ru: Возвращает путь к исполняемому файлу, который будет запущен, если будет вызван данный *cmd*. Если *cmd* не будет вызываться, верните ``None``.
sv: Returnerar sökvägen till en körbar fil som skulle köras om den angivna *cmd* anropades. Om ingen *cmd* skulle anropas returneras ``None``.

source: *mode* is a permission mask passed to :func:`os.access`, by default determining if the file exists and is executable.
pt_pt: *mode* é uma máscara de permissão passada a :func:`os.access`, por predefinição, determinando se o ficheiro existe e é executável.
ru: *mode* — это маска разрешений, передаваемая в :func:`os.access`, по умолчанию определяющая, существует ли файл и является ли он исполняемым.
sv: *mode* är en behörighetsmask som skickas till :func:`os.access`, som standard avgör den om filen finns och är körbar.

source: *path* is a "``PATH`` string" specifying the directories to look in, delimited by :data:`os.pathsep`. When no *path* is specified, the :envvar:`PATH` environment variable is read from :data:`os.environ`, falling back to :data:`os.defpath` if it is not set.
pt_pt: *path* é uma string "``PATH``" que especifica os diretórios a procurar, delimitados por :data:`os.pathsep`. Quando nenhum *path* é especificado, a variável de ambiente :envvar:`PATH` é lida de :data:`os.environ`, recuando para :data:`os.defpath` se não estiver definida.
ru: *path* — это строка ``PATH``, определяющая каталоги для поиска, разделенная :data:`os.pathsep`. Если *path* не указан, переменная среды :envvar:`PATH` считывается из :data:`os.environ`, возвращаясь к :data:`os.defpath`, если она не установлена.
sv: *path* är en "``PATH``\-sträng" som anger de kataloger som ska sökas i, avgränsad av :data:`os.pathsep`. Om ingen *path* anges, läses miljövariabeln :envvar:`PATH` från :data:`os.environ`, och faller tillbaka till :data:`os.defpath` om den inte är inställd.

source: If *cmd* contains a directory component, :func:`!which` only checks the specified path directly and does not search the directories listed in *path* or in the system's :envvar:`PATH` environment variable.
pt_pt: Se *cmd* contiver um componente de diretório, :func:`!which` verifica apenas o caminho especificado diretamente e não procura nos diretórios listados em *path* ou na variável de ambiente :envvar:`PATH` do sistema.
sv: Om *cmd* innehåller en katalogkomponent kontrollerar :func:`!which` endast den angivna sökvägen direkt och söker inte i de kataloger som anges i *path* eller i systemets miljövariabel :envvar:`PATH`.

source: On Windows, the current directory is prepended to the *path* if *mode* does not include ``os.X_OK``. When the *mode* does include ``os.X_OK``, the Windows API ``NeedCurrentDirectoryForExePathW`` will be consulted to determine if the current directory should be prepended to *path*. To avoid consulting the current working directory for executables: set the environment variable ``NoDefaultCurrentDirectoryInExePath``.
pt_pt: No Windows, o diretório atual é adicionado ao início de *path* se *mode* não incluir ``os.X_OK``. Quando o *mode* incluir ``os.X_OK``, a API do Windows ``NeedCurrentDirectoryForExePathW`` será consultada para determinar se o diretório atual deve ser adicionado ao início de *path*. Para evitar consultar o diretório de trabalho atual para executáveis: defina a variável de ambiente ``NoDefaultCurrentDirectoryInExePath``.
ru: В Windows текущий каталог добавляется к *path*, если *mode* не включает ``os.X_OK``. Когда *mode* включает ``os.X_OK``, Windows API ``NeedCurrentDirectoryForExePathW`` будет обращаться к нему, чтобы определить, следует ли добавлять текущий каталог к ​​*path*. Чтобы избежать обращения к текущему рабочему каталогу для исполняемых файлов: установите переменную среды NoDefaultCurrentDirectoryInExePath.
sv: I Windows prependlas den aktuella katalogen till *path* om *mode* inte innehåller ``os.X_OK``. När *mode* innehåller ``os.X_OK``, kommer Windows API ``NeedCurrentDirectoryForExePathW`` att konsulteras för att avgöra om den aktuella katalogen ska läggas till *path*. För att undvika att den aktuella arbetskatalogen konsulteras för körbara filer: ställ in miljövariabeln ``NoDefaultCurrentDirectoryInExePath``.
