Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shutil.po
Languages: pt_pt, ru, sv

source: Also on Windows, the :envvar:`PATHEXT` environment variable is used to resolve commands that may not already include an extension. For example, if you call ``shutil.which("python")``, :func:`which` will search ``PATHEXT`` to know that it should look for ``python.exe`` within the *path* directories. For example, on Windows::
pt_pt: Também no Windows, a variável de ambiente :envvar:`PATHEXT` é usada para resolver comandos que podem não incluir já uma extensão. Por exemplo, se chamar ``shutil.which("python")``, :func:`which` procurará em ``PATHEXT`` para saber que deve procurar ``python.exe`` dentro dos diretórios *path*. Por exemplo, no Windows::
ru: Также в Windows переменная среды :envvar:`PATHEXT` используется для разрешения команд, которые, возможно, еще не содержат расширения. Например, если вы вызываете ``shutil.that("python")``, :func:`который` будет искать ``PATHEXT``, чтобы знать, что он должен искать ``python.exe`` в *path * каталоги. Например, в Windows::
sv: I Windows används även miljövariabeln :envvar:`PATHEXT` för att lösa kommandon som kanske inte redan innehåller ett tillägg. Om du till exempel anropar ``shutil.which("python")``, kommer :func:`which` att söka i ``PATHEXT`` för att veta att den ska leta efter ``python.exe`` i katalogerna *path*. Till exempel på Windows::

source: This is also applied when *cmd* is a path that contains a directory component::
pt_pt: Isto também é aplicado quando *cmd* é um caminho que contém um componente de diretório::
ru: Это также применяется, когда *cmd* — это путь, содержащий компонент каталога::
sv: Detta gäller även när *cmd* är en sökväg som innehåller en katalogkomponent::

source: The :class:`bytes` type is now accepted. If *cmd* type is :class:`bytes`, the result type is also :class:`bytes`.
pt_pt: O tipo :class:`bytes` é agora aceite. Se o tipo de *cmd* for :class:`bytes`, o tipo do resultado também é :class:`bytes`.
ru: Тип :class:`bytes` теперь принят. Если тип *cmd* равен :class:`bytes`, тип результата также будет :class:`bytes`.
sv: Typen :class:`bytes` accepteras nu. Om *cmd*-typen är :class:`bytes`, är resultattypen också :class:`bytes`.

source: On Windows, the current directory is no longer prepended to the search path if *mode* includes ``os.X_OK`` and WinAPI ``NeedCurrentDirectoryForExePathW(cmd)`` is false, else the current directory is prepended even if it is already in the search path; ``PATHEXT`` is used now even when *cmd* includes a directory component or ends with an extension that is in ``PATHEXT``; and filenames that have no extension can now be found.
pt_pt: No Windows, o diretório atual já não é adicionado ao início do caminho de procura se *mode* incluir ``os.X_OK`` e WinAPI ``NeedCurrentDirectoryForExePathW(cmd)`` for falso; caso contrário, o diretório atual é adicionado ao início, mesmo que já esteja no caminho de procura; ``PATHEXT`` é agora usado mesmo quando *cmd* inclui um componente de diretório ou termina com uma extensão que está em ``PATHEXT``; e nomes de ficheiros que não têm extensão podem agora ser encontrados.
ru: В Windows текущий каталог больше не добавляется к пути поиска, если *mode* включает ``os.X_OK`` и WinAPI ``NeedCurrentDirectoryForExePathW(cmd)`` имеет значение false, в противном случае текущий каталог добавляется в начало, даже если он уже есть. в пути поиска; ``PATHEXT`` теперь используется, даже если *cmd* включает компонент каталога или заканчивается расширением, которое находится в ``PATHEXT``; и теперь можно найти имена файлов без расширения.
sv: I Windows läggs inte längre den aktuella katalogen till i sökvägen om *mode* innehåller ``os.X_OK`` och WinAPI ``NeedCurrentDirectoryForExePathW(cmd)`` är false, annars läggs den aktuella katalogen till även om den redan finns i sökvägen; ``PATHEXT`` används nu även när *cmd* innehåller en katalogkomponent eller slutar med ett tillägg som finns i ``PATHEXT``; och filnamn som inte har något tillägg kan nu hittas.

source: This exception collects exceptions that are raised during a multi-file operation. For :func:`copytree`, the exception argument is a list of 3-tuples (*srcname*, *dstname*, *exception*).
pt_pt: Esta exceção coleciona exceções que são levantadas durante uma operação de múltiplos ficheiros. Para :func:`copytree`, o argumento da exceção é uma lista de 3-tuplos (*srcname*, *dstname*, *exception*).
ru: Это исключение собирает исключения, возникающие во время операции с несколькими файлами. Для :func:`copytree` аргументом исключения является список из трёх кортежей (*srcname*, *dstname*, *Exception*).
sv: Detta undantag samlar in undantag som uppstår under en operation med flera filer. För :func:`copytree` är undantagsargumentet en lista med 3-tuples (*srcname*, *dstname*, *exception*).

source: Platform-dependent efficient copy operations
pt_pt: Operações de cópia eficientes dependentes da plataforma
ru: Платформозависимые эффективные операции копирования
sv: Plattformsberoende effektiva kopieringsoperationer

source: Starting from Python 3.8, all functions involving a file copy (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree`, and :func:`move`) may use platform-specific "fast-copy" syscalls in order to copy the file more efficiently (see :issue:`33671`). "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``".
pt_pt: A partir do Python 3.8, todas as funções que envolvem uma cópia de ficheiro (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree` e :func:`move`) podem usar chamadas de sistema "fast-copy" específicas da plataforma para copiar o ficheiro de forma mais eficiente (veja :issue:`33671`). "fast-copy" significa que a operação de cópia ocorre dentro do núcleo, evitando o uso de buffers no espaço do utilizador em Python, como em "``outfd.write(infd.read())``".
ru: Начиная с Python 3.8, все функции, связанные с копированием файла (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree` и :func:`move` ) может использовать специфичные для платформы системные вызовы «быстрого копирования» для более эффективного копирования файла (см. :issue:`33671`). «быстрое копирование» означает, что операция копирования происходит внутри ядра, избегая использования буферов пользовательского пространства в Python, как в «``outfd.write(infd.read())``».
sv: Från och med Python 3.8 kan alla funktioner som involverar en filkopiering (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree`, och :func:`move`) använda plattformsspecifika "fast-copy" syscalls för att kopiera filen mer effektivt (se :issue:`33671`). "Fast-copy" innebär att kopieringsoperationen sker i kärnan, vilket undviker användning av userspace-buffertar i Python som i "``outfd.write(infd.read())``".

source: On macOS `fcopyfile`_ is used to copy the file content (not metadata).
pt_pt: No macOS, `fcopyfile`_ é usado para copiar o conteúdo do ficheiro (não os metadados).
ru: В macOS `fcopyfile`_ используется для копирования содержимого файла (а не метаданных).
sv: På macOS används `fcopyfile`_ för att kopiera filinnehållet (inte metadata).

source: On Linux :func:`os.copy_file_range` or :func:`os.sendfile` is used.
pt_pt: No Linux, :func:`os.copy_file_range` ou :func:`os.sendfile` é usado.

source: On Solaris :func:`os.sendfile` is used.
pt_pt: No Solaris, :func:`os.sendfile` é usado.

source: On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 64 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used.
pt_pt: No Windows, :func:`shutil.copyfile` usa um tamanho de buffer predefinido maior (1 MiB em vez de 64 KiB) e uma variante de :func:`shutil.copyfileobj` baseada em :func:`memoryview` é usada.
ru: В Windows :func:`shutil.copyfile` использует больший размер буфера по умолчанию (1 МиБ вместо 64 КиБ) и используется вариант :func:`shutil.copyfileobj` на основе :func:`memoryview`.
sv: I Windows använder :func:`shutil.copyfile` en större standardbuffertstorlek (1 MiB istället för 64 KiB) och en :func:`memoryview`\-baserad variant av :func:`shutil.copyfileobj` används.

source: If the fast-copy operation fails and no data was written in the destination file then shutil will silently fallback on using less efficient :func:`copyfileobj` function internally.
pt_pt: Se a operação de cópia rápida falhar e nenhum dado tiver sido escrito no ficheiro de destino, então shutil recuará silenciosamente para usar a função :func:`copyfileobj` menos eficiente internamente.
ru: Если операция быстрого копирования не удалась и в целевой файл не было записано никаких данных, то Shutil автоматически перейдет к использованию менее эффективной внутренней функции :func:`copyfileobj`.
sv: Om snabbkopieringen misslyckas och inga data skrevs i målfilen kommer shutil att tyst fallbacka till att använda den mindre effektiva :func:`copyfileobj`\-funktionen internt.

source: Solaris now uses :func:`os.sendfile`.
pt_pt: O Solaris agora usa :func:`os.sendfile`.

source: Copy-on-write or server-side copy may be used internally via :func:`os.copy_file_range` on supported Linux filesystems.
pt_pt: A cópia na escrita ou a cópia do lado do servidor pode ser usada internamente através de :func:`os.copy_file_range` em sistemas de ficheiros Linux suportados.

source: copytree example
pt_pt: Exemplo de copytree
ru: пример копирования дерева
sv: exempel på copytree

source: An example that uses the :func:`ignore_patterns` helper::
pt_pt: Um exemplo que usa o auxiliar :func:`ignore_patterns`::
ru: Пример использования помощника :func:`ignore_patterns`::
sv: Ett exempel som använder hjälpen :func:`ignore_patterns`::

source: This will copy everything except ``.pyc`` files and files or directories whose name starts with ``tmp``.
pt_pt: Isto copiará tudo exceto ficheiros ``.pyc`` e ficheiros ou diretórios cujo nome começa com ``tmp``.
ru: При этом будет скопировано все, кроме файлов ``.pyc`` и файлов или каталогов, имена которых начинаются с ``tmp``.
sv: Detta kopierar allt utom ``.pyc``\-filer och filer eller kataloger vars namn börjar med ``tmp``.

source: Another example that uses the *ignore* argument to add a logging call::
pt_pt: Outro exemplo que usa o argumento *ignore* para adicionar uma chamada de registo::
ru: Другой пример, в котором используется аргумент *ignore* для добавления вызова журнала::
sv: Ett annat exempel som använder *ignore*-argumentet för att lägga till ett loggningsanrop::

source: from shutil import copytree import logging def _logpath(path, names): logging.info('Working in %s', path) return [] # nothing will be ignored copytree(source, destination, ignore=_logpath)
pt_pt: from shutil import copytree import logging def _logpath(path, names): logging.info('A trabalhar em %s', path) return [] # nada será ignorado copytree(source, destination, ignore=_logpath)

source: rmtree example
pt_pt: Exemplo de rmtree
ru: Пример rmtree
sv: exempel på rmtree

source: This example shows how to remove a directory tree on Windows where some of the files have their read-only bit set. It uses the onexc callback to clear the readonly bit and reattempt the remove. Any subsequent failure will propagate. ::
pt_pt: Este exemplo mostra como remover uma árvore de diretórios no Windows onde alguns dos ficheiros têm o bit de apenas leitura definido. Usa o callback onexc para limpar o bit de apenas leitura e tentar novamente a remoção. Qualquer falha subsequente será propagada. ::
ru: В этом примере показано, как удалить дерево каталогов в Windows, где для некоторых файлов установлен бит «только для чтения». Он использует обратный вызов onexc, чтобы очистить бит только для чтения и повторить попытку удаления. Любой последующий сбой будет распространяться. ::
sv: Det här exemplet visar hur man tar bort ett katalogträd i Windows där vissa av filerna har skrivskyddad bit inställd. Det använder onexc callback för att rensa den skrivskyddade biten och göra ett nytt försök att ta bort. Eventuella efterföljande fel kommer att sprida sig. ::

source: import os, stat import shutil def remove_readonly(func, path, _): "Clear the readonly bit and reattempt the removal" os.chmod(path, stat.S_IWRITE) func(path) shutil.rmtree(directory, onexc=remove_readonly)
pt_pt: import os, stat import shutil def remove_readonly(func, path, _): "Limpar o bit de apenas leitura e tentar novamente a remoção" os.chmod(path, stat.S_IWRITE) func(path) shutil.rmtree(directory, onexc=remove_readonly)

source: Archiving operations
pt_pt: Operações de arquivamento
ru: Операции архивирования
sv: Arkiveringsverksamhet

source: Added support for the *xztar* format.
pt_pt: Adicionado suporte para o formato *xztar*.
ru: Добавлена ​​поддержка формата *xztar*.
sv: Stöd för formatet *xztar* har lagts till.

source: High-level utilities to create and read compressed and archived files are also provided. They rely on the :mod:`zipfile` and :mod:`tarfile` modules.
pt_pt: Utilitários de alto nível para criar e ler ficheiros comprimidos e arquivados também são fornecidos. Eles dependem dos módulos :mod:`zipfile` e :mod:`tarfile`.
ru: Также предоставляются утилиты высокого уровня для создания и чтения сжатых и архивированных файлов. Они полагаются на модули :mod:`zipfile` и :mod:`tarfile`.
sv: Verktyg på hög nivå för att skapa och läsa komprimerade och arkiverade filer tillhandahålls också. De förlitar sig på modulerna :mod:`zipfile` och :mod:`tarfile`.

source: Create an archive file (such as zip or tar) and return its name.
pt_pt: Criar um ficheiro de arquivo (como zip ou tar) e retornar o seu nome.
ru: Создайте файл архива (например, zip или tar) и верните его имя.
sv: Skapa en arkivfil (t.ex. zip eller tar) och ange dess namn.

source: *base_name* is the name of the file to create, including the path, minus any format-specific extension.
pt_pt: *base_name* é o nome do ficheiro a criar, incluindo o caminho, menos qualquer extensão específica do formato.
ru: *base_name* — это имя создаваемого файла, включая путь, за вычетом расширения, специфичного для формата.
sv: *base_name* är namnet på den fil som ska skapas, inklusive sökvägen, minus eventuella formatspecifika tillägg.

source: *format* is the archive format: one of "zip" (if the :mod:`zlib` module is available), "tar", "gztar" (if the :mod:`zlib` module is available), "bztar" (if the :mod:`bz2` module is available), "xztar" (if the :mod:`lzma` module is available), or "zstdtar" (if the :mod:`compression.zstd` module is available).
pt_pt: *format* é o formato do arquivo: um de "zip" (se o módulo :mod:`zlib` estiver disponível), "tar", "gztar" (se o módulo :mod:`zlib` estiver disponível), "bztar" (se o módulo :mod:`bz2` estiver disponível), "xztar" (se o módulo :mod:`lzma` estiver disponível), ou "zstdtar" (se o módulo :mod:`compression.zstd` estiver disponível).

source: *root_dir* is a directory that will be the root directory of the archive, all paths in the archive will be relative to it; for example, we typically chdir into *root_dir* before creating the archive.
pt_pt: *root_dir* é um diretório que será o diretório raiz do arquivo; todos os caminhos no arquivo serão relativos a ele; por exemplo, normalmente fazemos chdir para *root_dir* antes de criar o arquivo.
ru: *root_dir* — каталог, который будет корневым каталогом архива, все пути в архиве будут относительно него; например, перед созданием архива мы обычно выполняем chdir в *root_dir*.
sv: *root_dir* är en katalog som kommer att vara arkivets rotkatalog, alla sökvägar i arkivet kommer att vara relativa till den; vi brukar t.ex. chdir:a till *root_dir* innan vi skapar arkivet.

source: *base_dir* is the directory where we start archiving from; i.e. *base_dir* will be the common prefix of all files and directories in the archive. *base_dir* must be given relative to *root_dir*. See :ref:`shutil-archiving-example-with-basedir` for how to use *base_dir* and *root_dir* together.
pt_pt: *base_dir* é o diretório a partir do qual começamos a arquivar; ou seja, *base_dir* será o prefixo comum de todos os ficheiros e diretórios no arquivo. *base_dir* deve ser fornecido em relação a *root_dir*. Veja :ref:`shutil-archiving-example-with-basedir` para saber como usar *base_dir* e *root_dir* em conjunto.
ru: *base_dir* — каталог, из которого мы начинаем архивирование; т.е. *base_dir* будет общим префиксом всех файлов и каталогов в архиве. *base_dir* должен быть указан относительно *root_dir*. См. :ref:`shutil-archiving-example-with-basedir`, чтобы узнать, как использовать *base_dir* и *root_dir* вместе.
sv: *base_dir* är den katalog där vi börjar arkivera från, dvs. *base_dir* kommer att vara det gemensamma prefixet för alla filer och kataloger i arkivet. *base_dir* måste anges i förhållande till *root_dir*. Se :ref:`shutil-archiving-example-with-basedir` för hur man använder *base_dir* och *root_dir* tillsammans.

source: *root_dir* and *base_dir* both default to the current directory.
pt_pt: *root_dir* e *base_dir* têm ambos como predefinição o diretório atual.
ru: *root_dir* и *base_dir* по умолчанию относятся к текущему каталогу.
sv: *root_dir* och *base_dir* är båda förvalda till den aktuella katalogen.

source: If *dry_run* is true, no archive is created, but the operations that would be executed are logged to *logger*.
pt_pt: Se *dry_run* for verdadeiro, nenhum arquivo é criado, mas as operações que seriam executadas são registadas em *logger*.
ru: Если *dry_run* имеет значение true, архив не создается, но выполняемые операции записываются в *logger*.
sv: Om *dry_run* är true skapas inget arkiv, men de operationer som skulle ha utförts loggas i *logger*.

source: *owner* and *group* are used when creating a tar archive. By default, uses the current owner and group.
pt_pt: *owner* e *group* são usados ao criar um arquivo tar. Por predefinição, usa o proprietário e grupo atuais.
ru: *owner* и *group* используются при создании tar-архива. По умолчанию используется текущий владелец и группа.
sv: *owner* och *group* används när ett tar-arkiv skapas. Som standard används den aktuella ägaren och gruppen.

source: *logger* must be an object compatible with :pep:`282`, usually an instance of :class:`logging.Logger`.
pt_pt: *logger* deve ser um objeto compatível com :pep:`282`, normalmente uma instância de :class:`logging.Logger`.
ru: *logger* должен быть объектом, совместимым с :pep:`282`, обычно экземпляром :class:`logging.Logger`.
sv: *logger* måste vara ett objekt som är kompatibelt med :pep:`282`, vanligtvis en instans av :class:`logging.Logger`.

source: The *verbose* argument is unused and deprecated.
pt_pt: O argumento *verbose* não é usado e está obsoleto.
ru: Аргумент *verbose* не используется и устарел.
sv: Argumentet *verbose* är oanvänt och föråldrat.

source: Raises an :ref:`auditing event <auditing>` ``shutil.make_archive`` with arguments ``base_name``, ``format``, ``root_dir``, ``base_dir``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.make_archive`` com os argumentos ``base_name``, ``format``, ``root_dir``, ``base_dir``.
ru: Вызывает :ref:`событие аудита <auditing>``shutil.make_archive`` с аргументами ``base_name``, ``format``, ``root_dir``, ``base_dir``.
sv: Utlöser en :ref:`auditing-händelse <auditing>` ``shutil.make_archive`` med argumenten ``base_name``, ``format``, ``root_dir``, ``base_dir``.

source: The modern pax (POSIX.1-2001) format is now used instead of the legacy GNU format for archives created with ``format="tar"``.
pt_pt: O formato moderno pax (POSIX.1-2001) é agora usado em vez do formato legado GNU para arquivos criados com ``format="tar"``.
ru: Современный формат pax (POSIX.1-2001) теперь используется вместо устаревшего формата GNU для архивов, созданных с помощью ``format="tar"``.
sv: Det moderna pax-formatet (POSIX.1-2001) används nu i stället för det äldre GNU-formatet för arkiv som skapats med ``format="tar"``.

source: This function is now made thread-safe during creation of standard ``.zip`` and tar archives.
pt_pt: Esta função é agora segura para threads durante a criação de arquivos ``.zip`` e tar padrão.
ru: Эта функция теперь стала потокобезопасной при создании стандартных архивов .zip и tar.
sv: Denna funktion är nu trådsäker under skapandet av standardarkiv av typen ``.zip`` och tar.

source: Return a list of supported formats for archiving. Each element of the returned sequence is a tuple ``(name, description)``.
pt_pt: Retorna uma lista de formatos suportados para arquivamento. Cada elemento da sequência retornada é um tuplo ``(name, description)``.
ru: Вернуть список поддерживаемых форматов для архивирования. Каждый элемент возвращаемой последовательности представляет собой кортеж ``(имя, описание)``.
sv: Returnerar en lista över format som stöds för arkivering. Varje element i den returnerade sekvensen är en tupel ``(namn, beskrivning)``.

source: By default :mod:`shutil` provides these formats:
pt_pt: Por predefinição, o :mod:`shutil` fornece estes formatos:
ru: По умолчанию :mod:`shutil` предоставляет эти форматы.
sv: Som standard tillhandahåller :mod:`shutil` dessa format:

source: *zip*: ZIP file (if the :mod:`zlib` module is available).
pt_pt: *zip*: Ficheiro ZIP (se o módulo :mod:`zlib` estiver disponível).
ru: *zip*: ZIP-файл (если доступен модуль :mod:`zlib`).
sv: *zip*: ZIP-fil (om modulen :mod:`zlib` är tillgänglig).

source: *tar*: Uncompressed tar file. Uses POSIX.1-2001 pax format for new archives.
pt_pt: *tar*: Ficheiro tar não comprimido. Usa o formato pax POSIX.1-2001 para novos arquivos.
ru: *tar*: Несжатый файл tar. Использует формат POSIX.1-2001 pax для новых архивов.
sv: *tar*: Okomprimerad tar-fil. Använder POSIX.1-2001 pax-format för nya arkiv.

source: *gztar*: gzip'ed tar-file (if the :mod:`zlib` module is available).
pt_pt: *gztar*: Ficheiro tar comprimido com gzip (se o módulo :mod:`zlib` estiver disponível).
ru: *gztar*: сжатый tar-файл (если доступен модуль :mod:`zlib`).
sv: *gztar*: gzip'ed tar-fil (om modulen :mod:`zlib` är tillgänglig).

source: *bztar*: bzip2'ed tar-file (if the :mod:`bz2` module is available).
pt_pt: *bztar*: Ficheiro tar comprimido com bzip2 (se o módulo :mod:`bz2` estiver disponível).
ru: *bztar*: tar-файл в формате bzip2 (если доступен модуль :mod:`bz2`).
sv: *bztar*: bzip2-behandlad tar-fil (om modulen :mod:`bz2` är tillgänglig).

source: *xztar*: xz'ed tar-file (if the :mod:`lzma` module is available).
pt_pt: *xztar*: Ficheiro tar comprimido com xz (se o módulo :mod:`lzma` estiver disponível).
ru: *xztar*: tar-файл с расширением xz (если доступен модуль :mod:`lzma`).
sv: *xztar*: xz'ed tar-fil (om modulen :mod:`lzma` är tillgänglig).

source: *zstdtar*: Zstandard compressed tar-file (if the :mod:`compression.zstd` module is available).
pt_pt: *zstdtar*: Ficheiro tar comprimido com Zstandard (se o módulo :mod:`compression.zstd` estiver disponível).

source: You can register new formats or provide your own archiver for any existing formats, by using :func:`register_archive_format`.
pt_pt: Pode registar novos formatos ou fornecer o seu próprio arquivador para quaisquer formatos existentes, usando :func:`register_archive_format`.
ru: Вы можете зарегистрировать новые форматы или предоставить свой собственный архиватор для любых существующих форматов, используя :func:`register_archive_format`.
sv: Du kan registrera nya format eller tillhandahålla din egen arkiverare för befintliga format genom att använda :func:`register_archive_format`.

source: Register an archiver for the format *name*.
pt_pt: Registar um arquivador para o formato *name*.
ru: Зарегистрируйте архиватор для формата *имя*.
sv: Registrera en arkiverare för formatet *namn*.
