Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/shutil.po
Languages: pt_pt, ru, sv

source: :mod:`!shutil` --- High-level file operations
pt_pt: :mod:`!shutil` — Operações de alto nível com ficheiros
ru: :mod:`!shutil` --- Высокоуровневые файловые операции
sv: :mod:`!shutil` --- Filoperationer på hög nivå

source: **Source code:** :source:`Lib/shutil.py`
pt_pt: **Código-fonte:** :source:`Lib/shutil.py`
ru: **Исходный код:** :source:`Lib/shutil.py`
sv: **Källkod:** :source:`Lib/shutil.py`

source: The :mod:`shutil` module offers a number of high-level operations on files and collections of files. In particular, functions are provided which support file copying and removal. For operations on individual files, see also the :mod:`os` module.
pt_pt: O módulo :mod:`shutil` oferece um número de operações de alto nível em ficheiros e coleções de ficheiros. Em particular, são fornecidas funções que suportam a cópia e remoção de ficheiros. Para operações em ficheiros individuais, veja também o módulo :mod:`os`.
ru: Модуль :mod:`shutil` предлагает ряд высокоуровневых операций над файлами и коллекциями файлов. В частности, предусмотрены функции, поддерживающие копирование и удаление файлов. Для операций с отдельными файлами см. также модуль :mod:`os`.
sv: Modulen :mod:`shutil` erbjuder ett antal funktioner på hög nivå för filer och samlingar av filer. I synnerhet finns funktioner som stöder kopiering och borttagning av filer. För operationer på enskilda filer, se även modulen :mod:`os`.

source: Even the higher-level file copying functions (:func:`shutil.copy`, :func:`shutil.copy2`) cannot copy all file metadata.
pt_pt: Mesmo as funções de cópia de ficheiros de nível superior (:func:`shutil.copy`, :func:`shutil.copy2`) não conseguem copiar todos os metadados do ficheiro.
ru: Даже функции копирования файлов более высокого уровня (:func:`shutil.copy`, :func:`shutil.copy2`) не могут скопировать все метаданные файла.
sv: Inte ens filkopieringsfunktionerna på högre nivå (:func:`shutil.copy`, :func:`shutil.copy2`) kan kopiera alla filmetadata.

source: On POSIX platforms, this means that file owner and group are lost as well as ACLs. On Mac OS, the resource fork and other metadata are not used. This means that resources will be lost and file type and creator codes will not be correct. On Windows, file owners, ACLs and alternate data streams are not copied.
pt_pt: Nas plataformas POSIX, isto significa que o proprietário e o grupo do ficheiro são perdidos, bem como as ACLs. No Mac OS, o fork de recursos e outros metadados não são usados. Isto significa que os recursos serão perdidos e os códigos de tipo e criador do ficheiro não estarão corretos. No Windows, os proprietários de ficheiros, ACLs e fluxos de dados alternativos não são copiados.
ru: На платформах POSIX это означает, что владелец файла и группа теряются, а также списки ACL. В Mac OS ветвь ресурса и другие метаданные не используются. Это означает, что ресурсы будут потеряны, а тип файла и коды создателя будут неверными. В Windows владельцы файлов, списки управления доступом и альтернативные потоки данных не копируются.
sv: På POSIX-plattformar innebär detta att filägare och grupp försvinner, liksom ACL:er. På Mac OS används inte resursgaffeln och andra metadata. Det innebär att resurser går förlorade och att filtyp och skaparkod inte blir korrekta. På Windows kopieras inte filägare, ACL:er och alternativa dataströmmar.

source: Directory and files operations
pt_pt: Operações de diretórios e ficheiros
ru: Операции с каталогами и файлами
sv: Katalog- och filoperationer

source: Copy the contents of the :term:`file-like object <file object>` *fsrc* to the file-like object *fdst*. The integer *length*, if given, is the buffer size. In particular, a negative *length* value means to copy the data without looping over the source data in chunks; by default the data is read in chunks to avoid uncontrolled memory consumption. Note that if the current file position of the *fsrc* object is not 0, only the contents from the current file position to the end of the file will be copied.
pt_pt: Copiar o conteúdo do objeto :term:`semelhante a ficheiro <file object>` *fsrc* para o objeto semelhante a ficheiro *fdst*. O inteiro *length*, se fornecido, é o tamanho do buffer. Em particular, um valor *length* negativo significa copiar os dados sem percorrer os dados de origem em blocos; por predefinição, os dados são lidos em blocos para evitar consumo descontrolado de memória. Note que, se a posição atual do ficheiro do objeto *fsrc* não for 0, apenas o conteúdo desde a posição atual do ficheiro até ao fim do ficheiro será copiado.
ru: Скопируйте содержимое :term:`файлоподобного объекта <файловый объект>` *fsrc* в файловоподобный объект *fdst*. Целое число *длина*, если оно указано, представляет собой размер буфера. В частности, отрицательное значение *длины* означает копирование данных без циклического перебора исходных данных частями; по умолчанию данные считываются порциями, чтобы избежать неконтролируемого потребления памяти. Обратите внимание: если текущая позиция объекта *fsrc* в файле не равна 0, будет скопировано только содержимое от текущей позиции до конца файла.
sv: Kopierar innehållet i :term:`filliknande objekt <file object>` *fsrc* till det filliknande objektet *fdst*. Heltalet *length*, om det anges, är buffertstorleken. Ett negativt *length*-värde innebär att data kopieras utan att källdata loopas i bitar; som standard läses data i bitar för att undvika okontrollerad minnesförbrukning. Observera att om den aktuella filpositionen för *fsrc*-objektet inte är 0, kommer endast innehållet från den aktuella filpositionen till slutet av filen att kopieras.

source: :func:`copyfileobj` will *not* guarantee that the destination stream has been flushed on completion of the copy. If you want to read from the destination at the completion of the copy operation (for example, reading the contents of a temporary file that has been copied from a HTTP stream), you must ensure that you have called :func:`~io.IOBase.flush` or :func:`~io.IOBase.close` on the file-like object before attempting to read the destination file.
pt_pt: A função :func:`copyfileobj` *não* garante que o fluxo de destino tenha sido descarregado após a conclusão da cópia. Se pretender ler a partir do destino após a conclusão da operação de cópia (por exemplo, ler o conteúdo de um ficheiro temporário que foi copiado a partir de um fluxo HTTP), deve garantir que chamou :func:`~io.IOBase.flush` ou :func:`~io.IOBase.close` no objeto semelhante a ficheiro antes de tentar ler o ficheiro de destino.

source: Copy the contents (no metadata) of the file named *src* to a file named *dst* and return *dst* in the most efficient way possible. *src* and *dst* are :term:`path-like objects <path-like object>` or path names given as strings.
pt_pt: Copiar o conteúdo (sem metadados) do ficheiro nomeado *src* para um ficheiro nomeado *dst* e retornar *dst* da forma mais eficiente possível. *src* e *dst* são :term:`objetos semelhantes a caminhos <path-like object>` ou nomes de caminhos fornecidos como strings.
ru: Скопируйте содержимое (без метаданных) файла с именем *src* в файл с именем *dst* и верните *dst* наиболее эффективным способом. *src* и *dst* — это :term:`объекты, подобные пути <объект, подобный пути>` или имена путей, заданные в виде строк.
sv: Kopiera innehållet (inga metadata) i filen med namnet *src* till en fil med namnet *dst* och returnera *dst* på effektivast möjliga sätt. *src* och *dst* är :term:`sökvägsliknande objekt <path-like object>` eller sökvägsnamn angivna som strängar.

source: *dst* must be the complete target file name; look at :func:`~shutil.copy` for a copy that accepts a target directory path. If *src* and *dst* specify the same file, :exc:`SameFileError` is raised.
pt_pt: *dst* deve ser o nome completo do ficheiro de destino; veja :func:`~shutil.copy` para uma cópia que aceita um caminho de diretório de destino. Se *src* e *dst* especificarem o mesmo ficheiro, é levantada uma exceção :exc:`SameFileError`.
ru: *dst* должно быть полным именем целевого файла; посмотрите :func:`~shutil.copy` на наличие копии, которая принимает путь к целевому каталогу. Если *src* и *dst* указывают один и тот же файл, возникает :exc:`SameFileError`.
sv: *dst* måste vara det fullständiga målfilsnamnet; se :func:`~shutil.copy` för en kopiering som accepterar en målkatalogsökväg. Om *src* och *dst* anger samma fil, uppstår :exc:`SameFileError`.

source: The destination location must be writable; otherwise, an :exc:`OSError` exception will be raised. If *dst* already exists, it will be replaced. Special files such as character or block devices and pipes cannot be copied with this function.
pt_pt: O local de destino deve ser gravável; caso contrário, será levantada uma exceção :exc:`OSError`. Se *dst* já existir, será substituído. Ficheiros especiais, como dispositivos de caracteres ou blocos e pipes, não podem ser copiados com esta função.
ru: Местоположение назначения должно быть доступно для записи; в противном случае будет выдано исключение :exc:`OSError`. Если *dst* уже существует, оно будет заменено. Специальные файлы, такие как символьные или блочные устройства и каналы, не могут быть скопированы с помощью этой функции.
sv: Destinationsplatsen måste vara skrivbar, annars kommer ett :exc:`OSError` undantag att uppstå. Om *dst* redan finns kommer den att ersättas. Specialfiler som tecken- eller blockenheter och pipes kan inte kopieras med den här funktionen.

source: If *follow_symlinks* is false and *src* is a symbolic link, a new symbolic link will be created instead of copying the file *src* points to.
pt_pt: Se *follow_symlinks* for falso e *src* for uma ligação simbólica, será criada uma nova ligação simbólica em vez de copiar o ficheiro para o qual *src* aponta.
ru: Если *follow_symlinks* имеет значение false и *src* является символической ссылкой, вместо копирования файла, на который указывает *src*, будет создана новая символическая ссылка.
sv: Om *follow_symlinks* är false och *src* är en symbolisk länk, skapas en ny symbolisk länk i stället för att kopiera filen som *src* pekar på.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copyfile`` with arguments ``src``, ``dst``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copyfile`` com os argumentos ``src``, ``dst``.
ru: Вызывает событие аудита <auditing>`shutil.copyfile`` с аргументами ``src``, ``dst``.
sv: Utlöser en :ref:`auditing event <auditing>` ``shutil.copyfile`` med argumenten ``src``, ``dst``.

source: :exc:`IOError` used to be raised instead of :exc:`OSError`. Added *follow_symlinks* argument. Now returns *dst*.
pt_pt: Anteriormente, era levantada uma :exc:`IOError` em vez de :exc:`OSError`. Adicionado o argumento *follow_symlinks*. Agora retorna *dst*.
ru: :exc:`IOError` раньше вызывался вместо :exc:`OSError`. Добавлен аргумент *follow_symlinks*. Теперь возвращает *dst*.
sv: :exc:`IOError` brukade visas istället för :exc:`OSError`. Argumentet *follow_symlinks* lades till. Returnerar nu *dst*.

source: Raise :exc:`SameFileError` instead of :exc:`Error`. Since the former is a subclass of the latter, this change is backward compatible.
pt_pt: Levanta :exc:`SameFileError` em vez de :exc:`Error`. Uma vez que a primeira é uma subclasse da última, esta alteração é retrocompatível.
ru: Поднимите :exc:`SameFileError` вместо :exc:`Error`. Поскольку первый является подклассом второго, это изменение обратно совместимо.
sv: Utlös :exc:`SameFileError` istället för :exc:`Error`. Eftersom den förra är en subklass av den senare är denna ändring bakåtkompatibel.

source: Platform-specific fast-copy syscalls may be used internally in order to copy the file more efficiently. See :ref:`shutil-platform-dependent-efficient-copy-operations` section.
pt_pt: Chamadas de sistema de cópia rápida específicas da plataforma podem ser usadas internamente para copiar o ficheiro de forma mais eficiente. Veja a secção :ref:`shutil-platform-dependent-efficient-copy-operations`.
ru: Для более эффективного копирования файла можно использовать системные вызовы быстрого копирования, зависящие от платформы. См. раздел «shutil-платформо-зависимые-эффективные-операции копирования».
sv: Plattformsspecifika syscalls för snabbkopiering kan användas internt för att kopiera filen mer effektivt. Se avsnittet :ref:`shutil-platform-dependent-efficient-copy-operations`.

source: This exception is raised when :func:`copyfile` or :func:`copytree` attempt to copy a named pipe.
pt_pt: Esta exceção é levantada quando :func:`copyfile` ou :func:`copytree` tentam copiar um pipe nomeado.

source: This exception is raised if source and destination in :func:`copyfile` are the same file.
pt_pt: Esta exceção é levantada se a origem e o destino em :func:`copyfile` forem o mesmo ficheiro.
ru: Это исключение возникает, если источник и место назначения в :func:`copyfile` являются одним и тем же файлом.
sv: Detta undantag uppstår om källan och destinationen i :func:`copyfile` är samma fil.

source: Copy the permission bits from *src* to *dst*. The file contents, owner, and group are unaffected. *src* and *dst* are :term:`path-like objects <path-like object>` or path names given as strings. If *follow_symlinks* is false, and both *src* and *dst* are symbolic links, :func:`copymode` will attempt to modify the mode of *dst* itself (rather than the file it points to). This functionality is not available on every platform; please see :func:`copystat` for more information. If :func:`copymode` cannot modify symbolic links on the local platform, and it is asked to do so, it will do nothing and return.
pt_pt: Copiar os bits de permissão de *src* para *dst*. O conteúdo do ficheiro, o proprietário e o grupo não são afetados. *src* e *dst* são :term:`objetos semelhantes a caminhos <path-like object>` ou nomes de caminhos fornecidos como strings. Se *follow_symlinks* for falso e tanto *src* como *dst* forem ligações simbólicas, :func:`copymode` tentará modificar o modo de *dst* em si (em vez do ficheiro para o qual aponta). Esta funcionalidade não está disponível em todas as plataformas; consulte :func:`copystat` para mais informações. Se :func:`copymode` não puder modificar ligações simbólicas na plataforma local e for solicitado a fazê-lo, não fará nada e retornará.
ru: Скопируйте биты разрешений из *src* в *dst*. Содержимое файла, владелец и группа не затрагиваются. *src* и *dst* — это :term:`объекты, подобные пути <объект, подобный пути>` или имена путей, заданные в виде строк. Если *follow_symlinks* имеет значение false, и оба *src* и *dst* являются символическими ссылками, :func:`copymode` попытается изменить режим самого *dst* (а не файла, на который он указывает). Эта функция доступна не на каждой платформе; пожалуйста, смотрите :func:`copystat` для получения дополнительной информации. Если :func:`copymode` не может изменить символические ссылки на локальной платформе, и его попросят это сделать, он ничего не сделает и вернется.
sv: Kopiera behörighetsbitarna från *src* till *dst*. Filens innehåll, ägare och grupp påverkas inte. *src* och *dst* är :term:`sökvägsliknande objekt <path-like object>` eller sökvägsnamn angivna som strängar. Om *follow_symlinks* är false och både *src* och *dst* är symboliska länkar, kommer :func:`copymode` att försöka ändra läget för *dst* själv (snarare än filen den pekar på). Denna funktion är inte tillgänglig på alla plattformar; se :func:`copystat` för mer information. Om :func:`copymode` inte kan modifiera symboliska länkar på den lokala plattformen, och den ombeds att göra det, kommer den inte att göra någonting och returnera.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copymode`` with arguments ``src``, ``dst``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copymode`` com os argumentos ``src``, ``dst``.
ru: Вызывает :ref:`событие аудита <auditing>``shutil.copymode`` с аргументами ``src``, ``dst``.
sv: Utlöser en :ref:`auditing event <auditing>` ``shutil.copymode`` med argumenten ``src``, ``dst``.

source: Added *follow_symlinks* argument.
pt_pt: Adicionado o argumento *follow_symlinks*.
ru: Добавлен аргумент *follow_symlinks*.
sv: Lagt till argumentet *follow_symlinks*.

source: Copy the permission bits, last access time, last modification time, and flags from *src* to *dst*. On Linux, :func:`copystat` also copies the "extended attributes" where possible. The file contents, owner, and group are unaffected. *src* and *dst* are :term:`path-like objects <path-like object>` or path names given as strings.
pt_pt: Copiar os bits de permissão, a hora do último acesso, a hora da última modificação e as flags de *src* para *dst*. No Linux, :func:`copystat` também copia os "atributos estendidos" onde possível. O conteúdo do ficheiro, o proprietário e o grupo não são afetados. *src* e *dst* são :term:`objetos semelhantes a caminhos <path-like object>` ou nomes de caminhos fornecidos como strings.
ru: Скопируйте биты разрешений, время последнего доступа, время последнего изменения и флаги из *src* в *dst*. В Linux :func:`copystat` также копирует «расширенные атрибуты», где это возможно. Содержимое файла, владелец и группа не затрагиваются. *src* и *dst* — это :term:`объекты, подобные пути <объект, подобный пути>` или имена путей, заданные в виде строк.
sv: Kopierar behörighetsbitar, senaste åtkomsttid, senaste ändringstid och flaggor från *src* till *dst*. På Linux kopierar :func:`copystat` även de "utökade attributen" där så är möjligt. Filinnehåll, ägare och grupp påverkas inte. *src* och *dst* är :term:`sökvägsliknande objekt <path-like object>` eller sökvägsnamn angivna som strängar.

source: If *follow_symlinks* is false, and *src* and *dst* both refer to symbolic links, :func:`copystat` will operate on the symbolic links themselves rather than the files the symbolic links refer to—reading the information from the *src* symbolic link, and writing the information to the *dst* symbolic link.
pt_pt: Se *follow_symlinks* for falso e *src* e *dst* se referirem ambos a ligações simbólicas, :func:`copystat` operará nas próprias ligações simbólicas em vez dos ficheiros para os quais as ligações simbólicas apontam — lendo as informações da ligação simbólica *src* e escrevendo as informações na ligação simbólica *dst*.
ru: Если *follow_symlinks* имеет значение false, а *src* и *dst* относятся к символическим ссылкам, :func:`copystat` будет работать с самими символическими ссылками, а не с файлами, на которые ссылаются символические ссылки, читая информацию из * src* и запись информации в символическую ссылку *dst*.
sv: Om *follow_symlinks* är false, och *src* och *dst* båda hänvisar till symboliska länkar, kommer :func:`copystat` att arbeta med de symboliska länkarna själva snarare än med de filer som de symboliska länkarna hänvisar till - läsa informationen från den symboliska länken *src* och skriva informationen till den symboliska länken *dst*.

source: Not all platforms provide the ability to examine and modify symbolic links. Python itself can tell you what functionality is locally available.
pt_pt: Nem todas as plataformas fornecem a capacidade de examinar e modificar ligações simbólicas. O próprio Python pode informá-lo sobre que funcionalidades estão disponíveis localmente.
ru: Не все платформы предоставляют возможность проверять и изменять символические ссылки. Сам Python может рассказать вам, какие функции доступны локально.
sv: Det är inte alla plattformar som ger möjlighet att undersöka och ändra symboliska länkar. Python själv kan berätta vilken funktionalitet som är lokalt tillgänglig.

source: If ``os.chmod in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the permission bits of a symbolic link.
pt_pt: Se ``os.chmod in os.supports_follow_symlinks`` for ``True``, :func:`copystat` pode modificar os bits de permissão de uma ligação simbólica.
ru: Если ``os.chmod в os.supports_follow_symlinks`` имеет значение ``True``, :func:`copystat` может изменить биты разрешения символической ссылки.
sv: Om ``os.chmod in os.supports_follow_symlinks`` är ``True``, kan :func:`copystat` ändra behörighetsbitarna för en symbolisk länk.

source: If ``os.utime in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the last access and modification times of a symbolic link.
pt_pt: Se ``os.utime in os.supports_follow_symlinks`` for ``True``, :func:`copystat` pode modificar as horas do último acesso e modificação de uma ligação simbólica.
ru: Если ``os.utime в os.supports_follow_symlinks`` имеет значение ``True``, :func:`copystat` может изменить время последнего доступа и изменения символической ссылки.
sv: Om ``os.utime in os.supports_follow_symlinks`` är ``True``, kan :func:`copystat` ändra den senaste åtkomst- och ändringstiden för en symbolisk länk.

source: If ``os.chflags in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the flags of a symbolic link. (``os.chflags`` is not available on all platforms.)
pt_pt: Se ``os.chflags in os.supports_follow_symlinks`` for ``True``, :func:`copystat` pode modificar as flags de uma ligação simbólica. (``os.chflags`` não está disponível em todas as plataformas.)
ru: Если ``os.chflags в os.supports_follow_symlinks`` имеет значение ``True``, :func:`copystat` может изменять флаги символической ссылки. (``os.chflags`` доступен не на всех платформах.)
sv: Om ``os.chflags in os.supports_follow_symlinks`` är ``True`` kan :func:`copystat` ändra flaggorna för en symbolisk länk. (``os.chflags`` är inte tillgänglig på alla plattformar)

source: On platforms where some or all of this functionality is unavailable, when asked to modify a symbolic link, :func:`copystat` will copy everything it can. :func:`copystat` never returns failure.
pt_pt: Em plataformas onde alguma ou toda esta funcionalidade não está disponível, quando solicitado para modificar uma ligação simbólica, :func:`copystat` copiará tudo o que puder. :func:`copystat` nunca retorna falha.
ru: На платформах, где некоторые или все эти функции недоступны, при запросе на изменение символической ссылки :func:`copystat` скопирует все, что может. :func:`copystat` никогда не возвращает ошибку.
sv: På plattformar där en del av eller all denna funktionalitet inte är tillgänglig, kommer :func:`copystat` att kopiera allt den kan när den ombeds att ändra en symbolisk länk. :func:`copystat` returnerar aldrig fel.

source: Please see :data:`os.supports_follow_symlinks` for more information.
pt_pt: Consulte :data:`os.supports_follow_symlinks` para mais informações.
ru: Дополнительную информацию см. в разделе :data:`os.supports_follow_symlinks`.
sv: Se :data:`os.supports_follow_symlinks` för mer information.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copystat`` with arguments ``src``, ``dst``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copystat`` com os argumentos ``src``, ``dst``.
ru: Вызывает событие аудита <auditing>`shutil.copystat`` с аргументами ``src``, ``dst``.
sv: Utlöser en :ref:`auditing event <auditing>` ``shutil.copystat`` med argumenten ``src``, ``dst``.

source: Added *follow_symlinks* argument and support for Linux extended attributes.
pt_pt: Adicionado o argumento *follow_symlinks* e suporte para atributos estendidos do Linux.
ru: Добавлен аргумент *follow_symlinks* и поддержка расширенных атрибутов Linux.
sv: Argumentet *follow_symlinks* och stöd för Linux utökade attribut har lagts till.
