Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/signal.po
Languages: ru, sv

source: :mod:`!signal` --- Set handlers for asynchronous events
sv: :mod:`!signal` --- Ställ in hanterare för asynkrona händelser

source: **Source code:** :source:`Lib/signal.py`
ru: **Исходный код:** :source:`Lib/signal.py`
sv: **Källkod:** :source:`Lib/signal.py`

source: This module provides mechanisms to use signal handlers in Python.
ru: Этот модуль предоставляет механизмы для использования обработчиков сигналов в Python.
sv: Denna modul tillhandahåller mekanismer för att använda signalhanterare i Python.

source: General rules
ru: Общие правила
sv: Allmänna regler

source: The :func:`signal.signal` function allows defining custom handlers to be executed when a signal is received. A small number of default handlers are installed: :const:`SIGPIPE` is ignored (so write errors on pipes and sockets can be reported as ordinary Python exceptions) and :const:`SIGINT` is translated into a :exc:`KeyboardInterrupt` exception if the parent process has not changed it.
ru: Функция :func:`signal.signal` позволяет определить пользовательские обработчики, которые будут выполняться при получении сигнала. Устанавливается небольшое количество обработчиков по умолчанию: :const:`SIGPIPE` игнорируется (поэтому ошибки записи в каналах и сокетах могут сообщаться как обычные исключения Python), а :const:`SIGINT` преобразуется в :exc:`KeyboardInterrupt` исключение, если родительский процесс не изменил его.
sv: Funktionen :func:`signal.signal` gör det möjligt att definiera anpassade hanterare som ska köras när en signal tas emot. Ett litet antal standardhanterare är installerade: :const:`SIGPIPE` ignoreras (så att skrivfel på pipes och sockets kan rapporteras som vanliga Python-undantag) och :const:`SIGINT` översätts till ett :exc:`KeyboardInterrupt`\-undantag om den överordnade processen inte har ändrat det.

source: A handler for a particular signal, once set, remains installed until it is explicitly reset (Python emulates the BSD style interface regardless of the underlying implementation), with the exception of the handler for :const:`SIGCHLD`, which follows the underlying implementation.
ru: Обработчик для определенного сигнала, однажды установленный, остается установленным до тех пор, пока он не будет явно сброшен (Python эмулирует интерфейс стиля BSD независимо от базовой реализации), за исключением обработчика :const:`SIGCHLD`, который следует базовой реализации. .
sv: En hanterare för en viss signal, när den väl är inställd, förblir installerad tills den uttryckligen återställs (Python emulerar BSD-stilgränssnittet oavsett den underliggande implementeringen), med undantag för hanteraren för :const:`SIGCHLD`, som följer den underliggande implementeringen.

source: On WebAssembly platforms, signals are emulated and therefore behave differently. Several functions and signals are not available on these platforms.
sv: På WebAssembly-plattformar är signaler emulerade och beter sig därför annorlunda. Flera funktioner och signaler är inte tillgängliga på dessa plattformar.

source: Execution of Python signal handlers
ru: Выполнение обработчиков сигналов Python
sv: Exekvering av Python-signalhanterare

source: A Python signal handler does not get executed inside the low-level (C) signal handler. Instead, the low-level signal handler sets a flag which tells the :term:`virtual machine` to execute the corresponding Python signal handler at a later point(for example at the next :term:`bytecode` instruction). This has consequences:
ru: Обработчик сигналов Python не выполняется внутри обработчика сигналов низкого уровня (C). Вместо этого обработчик сигнала низкого уровня устанавливает флаг, который указывает виртуальной машине выполнить соответствующий обработчик сигнала Python на более позднем этапе (например, при следующей инструкции :term:`bytecode`). Это имеет последствия:
sv: En Python-signalhanterare exekveras inte inuti lågnivåsignalhanteraren (C). Istället sätter signalhanteraren på låg nivå en flagga som talar om för :term:`virtual machine` att exekvera motsvarande Python-signalhanterare vid ett senare tillfälle (till exempel vid nästa :term:`bytecode`\-instruktion). Detta har konsekvenser:

source: It makes little sense to catch synchronous errors like :const:`SIGFPE` or :const:`SIGSEGV` that are caused by an invalid operation in C code. Python will return from the signal handler to the C code, which is likely to raise the same signal again, causing Python to apparently hang. From Python 3.3 onwards, you can use the :mod:`faulthandler` module to report on synchronous errors.
ru: Нет смысла ловить синхронные ошибки, такие как :const:`SIGFPE` или :const:`SIGSEGV`, которые вызваны недопустимой операцией в коде C. Python вернется из обработчика сигнала в код C, который, скорее всего, снова выдаст тот же сигнал, что, по-видимому, приведет к зависанию Python. Начиная с Python 3.3, вы можете использовать модуль :mod:`faulthandler` для сообщения о синхронных ошибках.
sv: Det är meningslöst att fånga synkrona fel som :const:`SIGFPE` eller :const:`SIGSEGV` som orsakas av en ogiltig operation i C-koden. Python kommer att återvända från signalhanteraren till C-koden, som sannolikt kommer att ge upphov till samma signal igen, vilket gör att Python uppenbarligen hänger sig. Från och med Python 3.3 och framåt kan du använda modulen :mod:`faulthandler` för att rapportera synkrona fel.

source: A long-running calculation implemented purely in C (such as regular expression matching on a large body of text) may run uninterrupted for an arbitrary amount of time, regardless of any signals received. The Python signal handlers will be called when the calculation finishes.
ru: Длительные вычисления, реализованные исключительно на C (например, сопоставление регулярных выражений с большим объемом текста), могут выполняться непрерывно в течение произвольного периода времени, независимо от каких-либо полученных сигналов. Обработчики сигналов Python будут вызваны после завершения расчета.
sv: En långdragen beräkning som implementeras enbart i C (t.ex. matchning av reguljära uttryck i en stor textmassa) kan köras oavbrutet under godtycklig tid, oavsett vilka signaler som tas emot. Pythons signalhanterare kommer att anropas när beräkningen är klar.

source: If the handler raises an exception, it will be raised "out of thin air" in the main thread. See the :ref:`note below <handlers-and-exceptions>` for a discussion.
ru: Если обработчик вызывает исключение, оно будет вызвано «из воздуха» в основном потоке. См. обсуждение в примечании ниже <handlers-and-Exceptions>.
sv: Om hanteraren skapar ett undantag kommer det att skapas "ur tomma intet" i huvudtråden. Se :ref:`noten nedan <handlers-and-exceptions>` för en diskussion.

source: Signals and threads
ru: Сигналы и потоки
sv: Signaler och trådar

source: Python signal handlers are always executed in the main Python thread of the main interpreter, even if the signal was received in another thread. This means that signals can't be used as a means of inter-thread communication. You can use the synchronization primitives from the :mod:`threading` module instead.
ru: Обработчики сигналов Python всегда выполняются в основном потоке Python основного интерпретатора, даже если сигнал был получен в другом потоке. Это означает, что сигналы не могут использоваться в качестве средства межпотоковой связи. Вместо этого вы можете использовать примитивы синхронизации из модуля :mod:`threading`.
sv: Pythons signalhanterare exekveras alltid i huvudtolkens Python-tråd, även om signalen mottogs i en annan tråd. Detta innebär att signaler inte kan användas som ett medel för kommunikation mellan trådar. Du kan använda synkroniseringsprimitiven från modulen :mod:`threading` istället.

source: Besides, only the main thread of the main interpreter is allowed to set a new signal handler.
ru: Кроме того, только основному потоку основного интерпретатора разрешено устанавливать новый обработчик сигнала.
sv: Dessutom är det bara huvudtråden i huvudtolken som får ställa in en ny signalhanterare.

source: Module contents
ru: Содержимое модуля
sv: Modulens innehåll

source: signal (SIG*), handler (:const:`SIG_DFL`, :const:`SIG_IGN`) and sigmask (:const:`SIG_BLOCK`, :const:`SIG_UNBLOCK`, :const:`SIG_SETMASK`) related constants listed below were turned into :class:`enums <enum.IntEnum>` (:class:`Signals`, :class:`Handlers` and :class:`Sigmasks` respectively). :func:`getsignal`, :func:`pthread_sigmask`, :func:`sigpending` and :func:`sigwait` functions return human-readable :class:`enums <enum.IntEnum>` as :class:`Signals` objects.
ru: сигнал (SIG*), обработчик (:const:`SIG_DFL`, :const:`SIG_IGN`) и сигмаска (:const:`SIG_BLOCK`, :const:`SIG_UNBLOCK`, :const:`SIG_SETMASK`), связанные константы, перечисленные ниже были преобразованы в :class:`enums <enum.IntEnum>` (:class:`Signals`, :class:`Handlers` и :class:`Sigmasks` соответственно). Функции :func:`getsignal`, :func:`pthread_sigmask`, :func:`sigpending` и :func:`sigwait` возвращают удобочитаемые для человека :class:`enums <enum.IntEnum>` как :class:`Signals` объекты.
sv: signal (SIG*), hanterare (:const:`SIG_DFL`, :const:`SIG_IGN`) och sigmask (:const:`SIG_BLOCK`, :const:`SIG_UNBLOCK`, :const:`SIG_SETMASK`) relaterade konstanter listade nedan omvandlades till :class:`enums <enum.IntEnum>` (:class:`Signals`, :class:`Handlers` respektive :class:`Sigmasks`). funktionerna :func:`getsignal`, :func:`pthread_sigmask`, :func:`sigpending` och :func:`sigwait` returnerar mänskligt läsbara :class:`enums <enum.IntEnum>` som :class:`Signals`\-objekt.

source: The signal module defines three enums:
ru: Модуль сигнала определяет три перечисления:
sv: Signalmodulen definierar tre enumer:

source: :class:`enum.IntEnum` collection of SIG* constants and the CTRL_* constants.
ru: :class:`enum.IntEnum` коллекция констант SIG* и констант CTRL_*.
sv: :class:`enum.IntEnum` samling av SIG*-konstanter och CTRL_*-konstanter.

source: :class:`enum.IntEnum` collection the constants :const:`SIG_DFL` and :const:`SIG_IGN`.
ru: :class:`enum.IntEnum` собирает константы :const:`SIG_DFL` и :const:`SIG_IGN`.
sv: :class:`enum.IntEnum` samlar in konstanterna :const:`SIG_DFL` och :const:`SIG_IGN`.

source: :class:`enum.IntEnum` collection the constants :const:`SIG_BLOCK`, :const:`SIG_UNBLOCK` and :const:`SIG_SETMASK`.
ru: :class:`enum.IntEnum` собирает константы :const:`SIG_BLOCK`, :const:`SIG_UNBLOCK` и :const:`SIG_SETMASK`.
sv: :class:`enum.IntEnum` samlar konstanterna :const:`SIG_BLOCK`, :const:`SIG_UNBLOCK` och :const:`SIG_SETMASK`.

source: Availability
ru: Доступность
sv: Tillgänglighet

source: See the man page :manpage:`sigprocmask(2)` and :manpage:`pthread_sigmask(3)` for further information.
ru: Дополнительную информацию смотрите на страницах руководства :manpage:`sigprocmask(2)` и :manpage:`pthread_sigmask(3)`.
sv: Se man-sidorna :manpage:`sigprocmask(2)` och :manpage:`pthread_sigmask(3)` för ytterligare information.

source: The variables defined in the :mod:`signal` module are:
ru: Переменные, определенные в модуле :mod:`signal`:
sv: De variabler som definieras i modulen :mod:`signal` är:

source: This is one of two standard signal handling options; it will simply perform the default function for the signal. For example, on most systems the default action for :const:`SIGQUIT` is to dump core and exit, while the default action for :const:`SIGCHLD` is to simply ignore it.
ru: Это один из двух стандартных вариантов обработки сигналов; он просто выполнит функцию по умолчанию для сигнала. Например, в большинстве систем действием по умолчанию для :const:`SIGQUIT` является сброс ядра и выход, тогда как действием по умолчанию для :const:`SIGCHLD` является просто игнорировать его.
sv: Detta är ett av två standardalternativ för signalhantering; det kommer helt enkelt att utföra standardfunktionen för signalen. På de flesta system är till exempel standardåtgärden för :const:`SIGQUIT` att dumpa kärnan och avsluta, medan standardåtgärden för :const:`SIGCHLD` är att helt enkelt ignorera den.

source: This is another standard signal handler, which will simply ignore the given signal.
ru: Это еще один стандартный обработчик сигналов, который просто игнорирует данный сигнал.
sv: Detta är en annan standardsignalhanterare, som helt enkelt ignorerar den givna signalen.

source: Abort signal from :manpage:`abort(3)`.
ru: Сигнал прерывания из :manpage:`abort(3)`.
sv: Avbrottssignal från :manpage:`abort(3)`.

source: Timer signal from :manpage:`alarm(2)`.
ru: Сигнал таймера из :manpage:`alarm(2)`.
sv: Timersignal från :manpage:`alarm(2)`.

source: Interrupt from keyboard (CTRL + BREAK).
ru: Прерывание с клавиатуры (CTRL+BREAK).
sv: Avbrott från tangentbordet (CTRL + BREAK).

source: Bus error (bad memory access).
ru: Ошибка шины (плохой доступ к памяти).
sv: Bussfel (dålig minnesåtkomst).

source: Child process stopped or terminated.
ru: Дочерний процесс остановлен или завершен.
sv: Barnprocessen stoppades eller avslutades.

source: Alias to :data:`SIGCHLD`.
ru: Псевдоним :data:`SIGCHLD`.
sv: Alias till :data:`SIGCHLD`.

source: Continue the process if it is currently stopped
ru: Продолжить процесс, если он в данный момент остановлен
sv: Fortsätt processen om den för närvarande är stoppad

source: Floating-point exception. For example, division by zero.
ru: Исключение с плавающей запятой. Например, деление на ноль.
sv: Undantag för flyttal. Till exempel division med noll.

source: :exc:`ZeroDivisionError` is raised when the second argument of a division or modulo operation is zero.
ru: :exc:`ZeroDivisionError` возникает, когда второй аргумент операции деления или деления по модулю равен нулю.
sv: :exc:`ZeroDivisionError` uppstår när det andra argumentet i en divisions- eller modulooperation är noll.

source: Hangup detected on controlling terminal or death of controlling process.
ru: Обнаружено зависание на управляющем терминале или прекращение процесса управления.
sv: Upphängning upptäckt på styrande terminal eller död i styrande process.

source: Illegal instruction.
ru: Нелегальный инструкция.
sv: Olaglig instruktion.

source: Interrupt from keyboard (CTRL + C).
ru: Прерывание с клавиатуры (CTRL+C).
sv: Avbrott från tangentbordet (CTRL + C).

source: Default action is to raise :exc:`KeyboardInterrupt`.
ru: Действием по умолчанию является вызов :exc:`KeyboardInterrupt`.
sv: Standardåtgärden är att skapa :exc:`KeyboardInterrupt`.

source: Kill signal.
ru: Сигнал убийства.
sv: Dödssignal.

source: It cannot be caught, blocked, or ignored.
ru: Его невозможно перехватить, заблокировать или проигнорировать.
sv: Den kan inte fångas, blockeras eller ignoreras.

source: Broken pipe: write to pipe with no readers.
ru: Сломанный канал: запись в канал без читателей.
sv: Trasigt rör: skriv till ett rör utan läsare.

source: Default action is to ignore the signal.
ru: Действие по умолчанию — игнорировать сигнал.
sv: Standardåtgärden är att ignorera signalen.

source: Segmentation fault: invalid memory reference.
ru: Ошибка сегментации: неверная ссылка на память.
sv: Segmenteringsfel: ogiltig minnesreferens.

source: Stack fault on coprocessor. The Linux kernel does not raise this signal: it can only be raised in user space.
ru: Ошибка стека сопроцессора. Ядро Linux не выдает этот сигнал: он может быть поднят только в пользовательском пространстве.
sv: Stapelfel på coprocessor. Linuxkärnan ger inte ut den här signalen: den kan bara ges ut i användarutrymmet.

source: On architectures where the signal is available. See the man page :manpage:`signal(7)` for further information.
ru: На архитектурах, где сигнал доступен. Дополнительную информацию смотрите на странице руководства :manpage:`signal(7)`.
sv: På arkitekturer där signalen är tillgänglig. Se man-sidan :manpage:`signal(7)` för ytterligare information.

source: Termination signal.
ru: Сигнал завершения.
sv: Signal för avslutning.

source: User-defined signal 1.
ru: Определяемый пользователем сигнал 1.
sv: Användardefinierad signal 1.

source: User-defined signal 2.
ru: Определяемый пользователем сигнал 2.
sv: Användardefinierad signal 2.

source: Window resize signal.
ru: Сигнал изменения размера окна.
sv: Signal för ändring av fönsterstorlek.

source: All the signal numbers are defined symbolically. For example, the hangup signal is defined as :const:`signal.SIGHUP`; the variable names are identical to the names used in C programs, as found in ``<signal.h>``. The Unix man page for ':c:func:`signal`' lists the existing signals (on some systems this is :manpage:`signal(2)`, on others the list is in :manpage:`signal(7)`). Note that not all systems define the same set of signal names; only those names defined by the system are defined by this module.
ru: Все номера сигналов определены символически. Например, сигнал зависания определяется как :const:`signal.SIGHUP`; имена переменных идентичны именам, используемым в программах на языке C, как показано в ``<signal.h>``. На странице руководства Unix для ':c:func:`signal`' перечислены существующие сигналы (в некоторых системах это :manpage:`signal(2)`, в других список находится в :manpage:`signal(7)` ). Обратите внимание, что не все системы определяют один и тот же набор имен сигналов; только те имена, которые определены системой, определяются этим модулем.
sv: Alla signalnummer är symboliskt definierade. Till exempel definieras hangup-signalen som :const:`signal.SIGHUP`; variabelnamnen är identiska med de namn som används i C-program och som finns i ``<signal.h>``. Unix man page för ':c:func:`signal`' listar de befintliga signalerna (på vissa system är detta :manpage:`signal(2)`, på andra finns listan i :manpage:`signal(7)`). Observera att inte alla system definierar samma uppsättning signalnamn; endast de namn som definieras av systemet definieras av den här modulen.

source: The signal corresponding to the :kbd:`Ctrl+C` keystroke event. This signal can only be used with :func:`os.kill`.
ru: Сигнал, соответствующий событию нажатия клавиши :kbd:`Ctrl+C`. Этот сигнал можно использовать только с :func:`os.kill`.
sv: Den signal som motsvarar händelsen :kbd:`Ctrl+C` tangenttryckning. Denna signal kan endast användas med :func:`os.kill`.

source: The signal corresponding to the :kbd:`Ctrl+Break` keystroke event. This signal can only be used with :func:`os.kill`.
ru: Сигнал, соответствующий событию нажатия клавиши :kbd:`Ctrl+Break`. Этот сигнал можно использовать только с :func:`os.kill`.
sv: Den signal som motsvarar händelsen :kbd:`Ctrl+Break` tangenttryckning. Denna signal kan endast användas med :func:`os.kill`.

source: One more than the number of the highest signal number. Use :func:`valid_signals` to get valid signal numbers.
ru: На единицу больше, чем номер наивысшего номера сигнала. Используйте :func:`valid_signals` для получения действительных номеров сигналов.
sv: Ett mer än numret på det högsta signalnumret. Använd :func:`valid_signals` för att få giltiga signalnummer.

source: Decrements interval timer in real time, and delivers :const:`SIGALRM` upon expiration.
ru: Уменьшает интервальный таймер в реальном времени и доставляет :const:`SIGALRM` по истечении срока действия.
sv: Minskar intervalltimern i realtid och levererar :const:`SIGALRM` när den löper ut.

source: Decrements interval timer only when the process is executing, and delivers SIGVTALRM upon expiration.
ru: Уменьшает интервальный таймер только во время выполнения процесса и доставляет SIGVTALRM по истечении срока действия.
sv: Minskar intervalltimern endast när processen körs och levererar SIGVTALRM när den löper ut.

source: Decrements interval timer both when the process executes and when the system is executing on behalf of the process. Coupled with ITIMER_VIRTUAL, this timer is usually used to profile the time spent by the application in user and kernel space. SIGPROF is delivered upon expiration.
ru: Уменьшает интервальный таймер как при выполнении процесса, так и при выполнении системы от имени процесса. В сочетании с ITIMER_VIRTUAL этот таймер обычно используется для профилирования времени, проведенного приложением в пространстве пользователя и ядра. SIGPROF поставляется по истечении срока годности.
sv: Minskar intervalltimern både när processen körs och när systemet körs på uppdrag av processen. Tillsammans med ITIMER_VIRTUAL används den här timern vanligtvis för att profilera den tid som programmet spenderar i användar- och kärnutrymmet. SIGPROF levereras när den löper ut.

source: A possible value for the *how* parameter to :func:`pthread_sigmask` indicating that signals are to be blocked.
ru: Возможное значение параметра *how* для :func:`pthread_sigmask`, указывающее, что сигналы должны быть заблокированы.
sv: Ett möjligt värde för parametern *how* i :func:`pthread_sigmask` som anger att signaler ska blockeras.

source: A possible value for the *how* parameter to :func:`pthread_sigmask` indicating that signals are to be unblocked.
ru: Возможное значение параметра *how* для :func:`pthread_sigmask`, указывающее, что сигналы должны быть разблокированы.
sv: Ett möjligt värde för *how*-parametern till :func:`pthread_sigmask` som anger att signaler ska avblockeras.

source: A possible value for the *how* parameter to :func:`pthread_sigmask` indicating that the signal mask is to be replaced.
ru: Возможное значение параметра *how* для :func:`pthread_sigmask`, указывающее, что маска сигнала должна быть заменена.
sv: Ett möjligt värde för *how*-parametern till :func:`pthread_sigmask` som anger att signalmasken ska ersättas.

source: The :mod:`signal` module defines one exception:
ru: Модуль :mod:`signal` определяет одно исключение:
sv: Modulen :mod:`signal` definierar ett undantag:

source: Raised to signal an error from the underlying :func:`setitimer` or :func:`getitimer` implementation. Expect this error if an invalid interval timer or a negative time is passed to :func:`setitimer`. This error is a subtype of :exc:`OSError`.
ru: Вызывается, чтобы сигнализировать об ошибке базовой реализации :func:`setitimer` или :func:`getitimer`. Эту ошибку следует ожидать, если в :func:`setitimer` передан неверный интервальный таймер или отрицательное время. Эта ошибка является подтипом :exc:`OSError`.
sv: Utlöses för att signalera ett fel från den underliggande :func:`setitimer` eller :func:`getitimer` implementationen. Förvänta dig detta fel om en ogiltig intervalltimer eller en negativ tid skickas till :func:`setitimer`. Detta fel är en subtyp av :exc:`OSError`.

source: This error used to be a subtype of :exc:`IOError`, which is now an alias of :exc:`OSError`.
ru: Раньше эта ошибка была подтипом :exc:`IOError`, который теперь является псевдонимом :exc:`OSError`.
sv: Detta fel var tidigare en subtyp av :exc:`IOError`, som nu är ett alias av :exc:`OSError`.

source: The :mod:`signal` module defines the following functions:
ru: Модуль :mod:`signal` определяет следующие функции:
sv: Modulen :mod:`signal` definierar följande funktioner:
