Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/signal.po
Languages: ru, sv

source: If *time* is non-zero, this function requests that a :const:`SIGALRM` signal be sent to the process in *time* seconds. Any previously scheduled alarm is canceled (only one alarm can be scheduled at any time). The returned value is then the number of seconds before any previously set alarm was to have been delivered. If *time* is zero, no alarm is scheduled, and any scheduled alarm is canceled. If the return value is zero, no alarm is currently scheduled.
ru: Если *time* не равно нулю, эта функция запрашивает отправку сигнала :const:`SIGALRM` процессу через *time* секунд. Любой ранее запланированный сигнал тревоги отменяется (в любой момент времени можно запланировать только один сигнал тревоги). Возвращаемое значение представляет собой количество секунд до того, как должен был быть доставлен какой-либо ранее установленный сигнал тревоги. Если *время* равно нулю, будильник не запланирован, и любой запланированный будильник отменяется. Если возвращаемое значение равно нулю, в настоящее время тревога не запланирована.
sv: Om *time* inte är noll, begär denna funktion att en :const:`SIGALRM`\-signal skickas till processen om *time* sekunder. Eventuella tidigare schemalagda larm avbryts (endast ett larm kan schemaläggas åt gången). Det returnerade värdet är då antalet sekunder innan något tidigare inställt larm skulle ha levererats. Om *time* är noll är inget larm schemalagt och ett eventuellt schemalagt larm avbryts. Om returvärdet är noll är inget larm för närvarande schemalagt.

source: See the man page :manpage:`alarm(2)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`alarm(2)`.
sv: Se manualsidan :manpage:`alarm(2)` för ytterligare information.

source: Return the current signal handler for the signal *signalnum*. The returned value may be a callable Python object, or one of the special values :const:`signal.SIG_IGN`, :const:`signal.SIG_DFL` or :const:`None`. Here, :const:`signal.SIG_IGN` means that the signal was previously ignored, :const:`signal.SIG_DFL` means that the default way of handling the signal was previously in use, and ``None`` means that the previous signal handler was not installed from Python.
ru: Возвращает текущий обработчик сигнала *signalnum*. Возвращаемое значение может быть вызываемым объектом Python или одним из специальных значений :const:`signal.SIG_IGN`, :const:`signal.SIG_DFL` или :const:`None`. Здесь :const:`signal.SIG_IGN` означает, что сигнал ранее игнорировался, :const:`signal.SIG_DFL` означает, что ранее использовался способ обработки сигнала по умолчанию, а ``None`` означает, что предыдущий обработчик сигнала не был установлен из Python.
sv: Returnerar den aktuella signalhanteraren för signalen *signalnum*. Det returnerade värdet kan vara ett anropbart Python-objekt eller ett av specialvärdena :const:`signal.SIG_IGN`, :const:`signal.SIG_DFL` eller :const:`None`. Här betyder :const:`signal.SIG_IGN` att signalen tidigare ignorerades, :const:`signal.SIG_DFL` betyder att standardmetoden för att hantera signalen tidigare användes och ``None`` betyder att den tidigare signalhanteraren inte installerades från Python.

source: Returns the description of signal *signalnum*, such as "Interrupt" for :const:`SIGINT`. Returns :const:`None` if *signalnum* has no description. Raises :exc:`ValueError` if *signalnum* is invalid.
ru: Возвращает описание сигнала *signalnum*, например «Прерывание» для :const:`SIGINT`. Возвращает :const:`None`, если *signalnum* не имеет описания. Вызывает :exc:`ValueError`, если *signalnum* недействителен.
sv: Returnerar beskrivningen av signalen *signalnum*, t.ex. "Interrupt" för :const:`SIGINT`. Returnerar :const:`None` om *signalnum* inte har någon beskrivning. Utlöser :exc:`ValueError` om *signalnum* är ogiltig.

source: Return the set of valid signal numbers on this platform. This can be less than ``range(1, NSIG)`` if some signals are reserved by the system for internal use.
ru: Верните набор действительных номеров сигналов на этой платформе. Это может быть меньше, чем «диапазон(1, NSIG)», если некоторые сигналы зарезервированы системой для внутреннего использования.
sv: Returnerar uppsättningen av giltiga signalnummer på denna plattform. Detta kan vara mindre än ``range(1, NSIG)`` om vissa signaler är reserverade av systemet för internt bruk.

source: Cause the process to sleep until a signal is received; the appropriate handler will then be called. Returns nothing.
ru: Приостановить процесс до тех пор, пока не будет получен сигнал; затем будет вызван соответствующий обработчик. Ничего не возвращает.
sv: Får processen att sova tills en signal tas emot; lämplig hanterare kommer då att anropas. Returnerar ingenting.

source: See the man page :manpage:`signal(2)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`signal(2)`.
sv: Se man-sidan :manpage:`signal(2)` för ytterligare information.

source: See also :func:`sigwait`, :func:`sigwaitinfo`, :func:`sigtimedwait` and :func:`sigpending`.
ru: См. также :func:`sigwait`, :func:`sigwaitinfo`, :func:`sigtimedwait` и :func:`sigpending`.
sv: Se även :func:`sigwait`, :func:`sigwaitinfo`, :func:`sigtimedwait` och :func:`sigpending`.

source: Sends a signal to the calling process. Returns nothing.
ru: Отправляет сигнал вызывающему процессу. Ничего не возвращает.
sv: Skickar en signal till den anropande processen. Returnerar ingenting.

source: Send signal *sig* to the process referred to by file descriptor *pidfd*. Python does not currently support the *siginfo* parameter; it must be ``None``. The *flags* argument is provided for future extensions; no flag values are currently defined.
ru: Отправьте сигнал *sig* процессу, указанному файловым дескриптором *pidfd*. Python в настоящее время не поддерживает параметр *siginfo*; это должно быть ``Нет``. Аргумент *flags* предоставляется для будущих расширений; значения флагов в настоящее время не определены.
sv: Skicka signalen *sig* till den process som filbeskrivaren *pidfd* refererar till. Python har för närvarande inte stöd för parametern *siginfo*; den måste vara ``None``. Argumentet *flags* tillhandahålls för framtida tillägg; inga flaggvärden är för närvarande definierade.

source: See the :manpage:`pidfd_send_signal(2)` man page for more information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`pidfd_send_signal(2)`.
sv: Se :manpage:`pidfd_send_signal(2)` man page för mer information.

source: Send the signal *signalnum* to the thread *thread_id*, another thread in the same process as the caller. The target thread can be executing any code (Python or not). However, if the target thread is executing the Python interpreter, the Python signal handlers will be :ref:`executed by the main thread of the main interpreter <signals-and-threads>`. Therefore, the only point of sending a signal to a particular Python thread would be to force a running system call to fail with :exc:`InterruptedError`.
ru: Отправьте сигнал *signalnum* в поток *thread_id*, другой поток в том же процессе, что и вызывающий. Целевой поток может выполнять любой код (Python или нет). Однако, если целевой поток выполняет интерпретатор Python, обработчики сигналов Python будут :ref:`исполняться основным потоком основного интерпретатора <signals-and-threads>`. Следовательно, единственным способом отправки сигнала в конкретный поток Python будет принудительное завершение работающего системного вызова с помощью :exc:`InterruptedError`.
sv: Skicka signalen *signalnum* till tråden *thread_id*, en annan tråd i samma process som anroparen. Måltråden kan exekvera vilken kod som helst (Python eller inte). Men om måltråden exekverar Python-tolken kommer Python-signalhanterarna att :ref:`exekveras av huvudtråden i huvudtolken <signals-and-threads>`. Därför skulle den enda poängen med att skicka en signal till en viss Python-tråd vara att tvinga ett pågående systemanrop att misslyckas med :exc:`InterruptedError`.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
ru: Используйте :func:`threading.get_ident` или атрибут :attr:`~threading.Thread.ident` объектов :class:`threading.Thread`, чтобы получить подходящее значение для *thread_id*.
sv: Använd :func:`threading.get_ident` eller attributet :attr:`~threading.Thread.ident` i :class:`threading.Thread`\-objekt för att få ett lämpligt värde för *thread_id*.

source: If *signalnum* is 0, then no signal is sent, but error checking is still performed; this can be used to check if the target thread is still running.
ru: Если *signalnum* равен 0, сигнал не отправляется, но проверка ошибок все равно выполняется; это можно использовать для проверки, работает ли целевой поток.
sv: Om *signalnum* är 0 skickas ingen signal, men felkontroll utförs ändå; detta kan användas för att kontrollera om måltråden fortfarande körs.

source: Raises an :ref:`auditing event <auditing>` ``signal.pthread_kill`` with arguments ``thread_id``, ``signalnum``.
ru: Вызывает :ref:`событие аудита <auditing>``signal.pthread_kill`` с аргументами ``thread_id``, ``signalnum``.
sv: Utlöser en :ref:`auditing event <auditing>` ``signal.pthread_kill`` med argumenten ``thread_id``, ``signalnum``.

source: See the man page :manpage:`pthread_kill(3)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`pthread_kill(3)`.
sv: Se man-sidan :manpage:`pthread_kill(3)` för ytterligare information.

source: See also :func:`os.kill`.
ru: См. также :func:`os.kill`.
sv: Se även :func:`os.kill`.

source: Fetch and/or change the signal mask of the calling thread. The signal mask is the set of signals whose delivery is currently blocked for the caller. Return the old signal mask as a set of signals.
ru: Получите и/или измените маску сигнала вызывающего потока. Маска сигнала — это набор сигналов, доставка которых в данный момент заблокирована для вызывающего абонента. Верните старую маску сигнала как набор сигналов.
sv: Hämta och/eller ändra signalmasken för den anropande tråden. Signalmasken är den uppsättning signaler vars leverans för närvarande är blockerad för den anropande tråden. Returnera den gamla signalmasken som en uppsättning signaler.

source: The behavior of the call is dependent on the value of *how*, as follows.
ru: Поведение вызова зависит от значения *how* следующим образом.
sv: Anropets beteende är beroende av värdet på *how*, enligt följande.

source: :data:`SIG_BLOCK`: The set of blocked signals is the union of the current set and the *mask* argument.
ru: :data:`SIG_BLOCK`: Набор заблокированных сигналов представляет собой объединение текущего набора и аргумента *маска*.
sv: :data:`SIG_BLOCK`: Uppsättningen av blockerade signaler är en förening av den aktuella uppsättningen och argumentet *mask*.

source: :data:`SIG_UNBLOCK`: The signals in *mask* are removed from the current set of blocked signals. It is permissible to attempt to unblock a signal which is not blocked.
ru: :data:`SIG_UNBLOCK`: Сигналы в *маске* удаляются из текущего набора заблокированных сигналов. Разрешается попытаться разблокировать незаблокированный сигнал.
sv: :data:`SIG_UNBLOCK`: Signalerna i *mask* tas bort från den aktuella uppsättningen av blockerade signaler. Det är tillåtet att försöka avblockera en signal som inte är blockerad.

source: :data:`SIG_SETMASK`: The set of blocked signals is set to the *mask* argument.
ru: :data:`SIG_SETMASK`: Набор заблокированных сигналов устанавливается в аргумент *mask*.
sv: :data:`SIG_SETMASK`: Uppsättningen av blockerade signaler ställs in till argumentet *mask*.

source: *mask* is a set of signal numbers (e.g. {:const:`signal.SIGINT`, :const:`signal.SIGTERM`}). Use :func:`~signal.valid_signals` for a full mask including all signals.
ru: *маска* — это набор номеров сигналов (например, {:const:`signal.SIGINT`, :const:`signal.SIGTERM`}). Используйте :func:`~signal.valid_signals` для полной маски, включающей все сигналы.
sv: *mask* är en uppsättning signalnummer (t.ex. {:const:`signal.SIGINT`, :const:`signal.SIGTERM`}). Använd :func:`~signal.valid_signals` för en fullständig mask som inkluderar alla signaler.

source: For example, ``signal.pthread_sigmask(signal.SIG_BLOCK, [])`` reads the signal mask of the calling thread.
ru: Например, ``signal.pthread_sigmask(signal.SIG_BLOCK, [])`` считывает маску сигнала вызывающего потока.
sv: Till exempel läser ``signal.pthread_sigmask(signal.SIG_BLOCK, [])`` signalmasken för den anropande tråden.

source: :data:`SIGKILL` and :data:`SIGSTOP` cannot be blocked.
ru: :data:`SIGKILL` и :data:`SIGSTOP` не могут быть заблокированы.
sv: :data:`SIGKILL` och :data:`SIGSTOP` kan inte blockeras.

source: See also :func:`pause`, :func:`sigpending` and :func:`sigwait`.
ru: См. также :func:`pause`, :func:`sigpending` и :func:`sigwait`.
sv: Se även :func:`pause`, :func:`sigpending` och :func:`sigwait`.

source: Sets given interval timer (one of :const:`signal.ITIMER_REAL`, :const:`signal.ITIMER_VIRTUAL` or :const:`signal.ITIMER_PROF`) specified by *which* to fire after *seconds* (float is accepted, different from :func:`alarm`) and after that every *interval* seconds (if *interval* is non-zero). The interval timer specified by *which* can be cleared by setting *seconds* to zero.
ru: Устанавливает заданный интервальный таймер (один из :const:`signal.ITIMER_REAL`, :const:`signal.ITIMER_VIRTUAL` или :const:`signal.ITIMER_PROF`), указанный в параметре *который* срабатывать через *секунды* (допустимо число с плавающей запятой, отличается от :func:`alarm`) и после этого каждые *интервал* секунд (если *интервал* не равен нулю). Интервальный таймер, указанный *который*, можно очистить, установив *секунды* на ноль.
sv: Ställer in en given intervalltimer (en av :const:`signal.ITIMER_REAL`, :const:`signal.ITIMER_VIRTUAL` eller :const:`signal.ITIMER_PROF`) specificerad av *which* att starta efter *seconds* (float accepteras, skiljer sig från :func:`alarm`) och därefter var *intervall* sekund (om *intervall* inte är noll). Intervalltimern som anges av *which* kan rensas genom att *seconds* sätts till noll.

source: When an interval timer fires, a signal is sent to the process. The signal sent is dependent on the timer being used; :const:`signal.ITIMER_REAL` will deliver :const:`SIGALRM`, :const:`signal.ITIMER_VIRTUAL` sends :const:`SIGVTALRM`, and :const:`signal.ITIMER_PROF` will deliver :const:`SIGPROF`.
ru: Когда срабатывает интервальный таймер, процессу отправляется сигнал. Отправляемый сигнал зависит от используемого таймера; :const:`signal.ITIMER_REAL` доставит :const:`SIGALRM`, :const:`signal.ITIMER_VIRTUAL` отправит :const:`SIGVTALRM`, а :const:`signal.ITIMER_PROF` доставит :const:`SIGPROF` .
sv: När en intervalltimer startar skickas en signal till processen. Signalen som skickas beror på vilken timer som används; :const:`signal.ITIMER_REAL` kommer att leverera :const:`SIGALRM`, :const:`signal.ITIMER_VIRTUAL` skickar :const:`SIGVTALRM`, och :const:`signal.ITIMER_PROF` kommer att leverera :const:`SIGPROF`.

source: The old values are returned as a tuple: (delay, interval).
ru: Старые значения возвращаются в виде кортежа: (задержка, интервал).
sv: De gamla värdena returneras som en tupel: (delay, interval).

source: Attempting to pass an invalid interval timer will cause an :exc:`ItimerError`.
ru: Попытка передать неверный интервальный таймер приведет к ошибке :exc:`ItimerError`.
sv: Försök att skicka en ogiltig intervalltimer kommer att orsaka ett :exc:`ItimerError`.

source: Returns current value of a given interval timer specified by *which*.
ru: Возвращает текущее значение заданного интервального таймера, указанного *который*.
sv: Returnerar aktuellt värde för en given intervalltimer som specificeras av *which*.

source: Set the wakeup file descriptor to *fd*. When a signal your program has registered a signal handler for is received, the signal number is written as a single byte into the fd. If you haven't registered a signal handler for the signals you care about, then nothing will be written to the wakeup fd. This can be used by a library to wakeup a poll or select call, allowing the signal to be fully processed.
sv: Ställ in wakeup-filens deskriptor till *fd*. När en signal som ditt program har registrerat en signalhanterare för tas emot, skrivs signalnumret som en enda byte till fd. Om du inte har registrerat en signalhanterare för de signaler du bryr dig om, skrivs ingenting till wakeup fd. Detta kan användas av ett bibliotek för att väcka ett poll- eller select-anrop, så att signalen kan bearbetas fullständigt.

source: The old wakeup fd is returned (or -1 if file descriptor wakeup was not enabled). If *fd* is -1, file descriptor wakeup is disabled. If not -1, *fd* must be non-blocking. It is up to the library to remove any bytes from *fd* before calling poll or select again.
ru: Возвращается старый файл пробуждения (или -1, если пробуждение файлового дескриптора не было включено). Если *fd* равно -1, пробуждение файлового дескриптора отключено. Если не -1, *fd* должен быть неблокирующим. Библиотека должна удалить все байты из *fd* перед вызовом опроса или повторным выбором.
sv: Den gamla wakeup fd returneras (eller -1 om wakeup för filbeskrivare inte var aktiverad). Om *fd* är -1 inaktiveras väckning av filbeskrivare. Om *fd* inte är -1 måste den vara icke-blockerande. Det är upp till biblioteket att ta bort eventuella byte från *fd* innan poll eller select anropas igen.

source: When threads are enabled, this function can only be called from :ref:`the main thread of the main interpreter <signals-and-threads>`; attempting to call it from other threads will cause a :exc:`ValueError` exception to be raised.
ru: Когда потоки включены, эту функцию можно вызвать только из :ref:`основного потока главного интерпретатора <signals-and-threads>`; попытка вызвать его из других потоков приведет к возникновению исключения :exc:`ValueError`.
sv: När trådar är aktiverade kan den här funktionen endast anropas från :ref:`huvudtråden i huvudtolken <signals-and-threads>`; om du försöker anropa den från andra trådar kommer ett :exc:`ValueError`\-undantag att uppstå.

source: There are two common ways to use this function. In both approaches, you use the fd to wake up when a signal arrives, but then they differ in how they determine *which* signal or signals have arrived.
ru: Есть два распространенных способа использования этой функции. В обоих подходах вы используете fd для пробуждения при поступлении сигнала, но они различаются тем, как определяют *какой* сигнал или сигналы поступили.
sv: Det finns två vanliga sätt att använda den här funktionen. I båda fallen använder man fd för att vakna när en signal kommer, men sedan skiljer de sig åt i hur de avgör *vilken* signal eller vilka signaler som har kommit.

source: In the first approach, we read the data out of the fd's buffer, and the byte values give you the signal numbers. This is simple, but in rare cases it can run into a problem: generally the fd will have a limited amount of buffer space, and if too many signals arrive too quickly, then the buffer may become full, and some signals may be lost. If you use this approach, then you should set ``warn_on_full_buffer=True``, which will at least cause a warning to be printed to stderr when signals are lost.
ru: В первом подходе мы считываем данные из буфера fd, а значения байтов дают вам номера сигналов. Это просто, но в редких случаях может возникнуть проблема: обычно fd будет иметь ограниченный объем буферного пространства, и если слишком много сигналов поступает слишком быстро, то буфер может переполниться, и некоторые сигналы могут быть потеряны. Если вы используете этот подход, вам следует установить ``warn_on_full_buffer=True``, что, по крайней мере, приведет к выводу предупреждения в stderr при потере сигналов.
sv: I den första metoden läser vi ut data ur fd:ns buffert, och bytevärdena ger dig signalnumren. Det här är enkelt, men i sällsynta fall kan det uppstå problem: i allmänhet har fd en begränsad mängd buffertutrymme, och om för många signaler kommer för snabbt kan bufferten bli full och vissa signaler kan gå förlorade. Om du använder det här tillvägagångssättet bör du ställa in ``warn_on_full_buffer=True``, vilket åtminstone kommer att leda till att en varning skrivs ut till stderr när signaler går förlorade.

source: In the second approach, we use the wakeup fd *only* for wakeups, and ignore the actual byte values. In this case, all we care about is whether the fd's buffer is empty or non-empty; a full buffer doesn't indicate a problem at all. If you use this approach, then you should set ``warn_on_full_buffer=False``, so that your users are not confused by spurious warning messages.
ru: Во втором подходе мы используем пробуждение *только* для пробуждения и игнорируем фактические значения байтов. В этом случае нас волнует только то, пуст ли буфер fd или непуст; полный буфер вообще не указывает на проблему. Если вы используете этот подход, вам следует установить ``warn_on_full_buffer=False``, чтобы ваши пользователи не были сбиты с толку ложными предупреждающими сообщениями.
sv: I det andra tillvägagångssättet använder vi wakeup fd *endast* för väckningar och ignorerar de faktiska bytevärdena. I det här fallet är allt vi bryr oss om huruvida fd:s buffert är tom eller inte; en full buffert indikerar inte alls något problem. Om du använder det här tillvägagångssättet bör du ställa in ``warn_on_full_buffer=False``, så att dina användare inte förvirras av falska varningsmeddelanden.

source: On Windows, the function now also supports socket handles.
ru: В Windows эта функция теперь также поддерживает дескрипторы сокетов.
sv: I Windows stöder funktionen nu även socket-handtag.

source: Added ``warn_on_full_buffer`` parameter.
ru: Добавлен параметр ``warn_on_full_buffer``.
sv: Lagt till parametern ``warn_on_full_buffer``.

source: Change system call restart behaviour: if *flag* is :const:`False`, system calls will be restarted when interrupted by signal *signalnum*, otherwise system calls will be interrupted. Returns nothing.
ru: Изменить поведение перезапуска системного вызова: если *flag* имеет значение :const:`False`, системные вызовы будут перезапущены при прерывании сигналом *signalnum*, в противном случае системные вызовы будут прерваны. Ничего не возвращает.
sv: Ändra beteende för omstart av systemanrop: om *flag* är :const:`False`, kommer systemanrop att startas om när de avbryts av signal *signalnum*, annars kommer systemanrop att avbrytas. Returnerar ingenting.

source: See the man page :manpage:`siginterrupt(3)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`siginterrupt(3)`.
sv: Se manualsidan :manpage:`siginterrupt(3)` för ytterligare information.

source: Note that installing a signal handler with :func:`signal` will reset the restart behaviour to interruptible by implicitly calling :c:func:`!siginterrupt` with a true *flag* value for the given signal.
ru: Обратите внимание, что установка обработчика сигнала с помощью :func:`signal` сбросит режим перезапуска на прерываемый путем неявного вызова :c:func:`!siginterrupt` с истинным значением *flag* для данного сигнала.
sv: Observera att installation av en signalhanterare med :func:`signal` kommer att återställa omstartbeteendet till avbrytbart genom att implicit anropa :c:func:`!siginterrupt` med ett sant *flagg*-värde för den givna signalen.
