Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/signal.po
Languages: ru, sv

source: Set the handler for signal *signalnum* to the function *handler*. *handler* can be a callable Python object taking two arguments (see below), or one of the special values :const:`signal.SIG_IGN` or :const:`signal.SIG_DFL`. The previous signal handler will be returned (see the description of :func:`getsignal` above). (See the Unix man page :manpage:`signal(2)` for further information.)
ru: Установите обработчик сигнала *signalnum* на функцию *handler*. *handler* может быть вызываемым объектом Python, принимающим два аргумента (см. ниже) или одно из специальных значений :const:`signal.SIG_IGN` или :const:`signal.SIG_DFL`. Будет возвращен предыдущий обработчик сигнала (см. описание :func:`getsignal` выше). (Для получения дополнительной информации см. справочную страницу Unix :manpage:`signal(2)`.)
sv: Ställ in hanteraren för signalen *signalnum* till funktionen *handler*. *handler* kan vara ett anropbart Python-objekt som tar två argument (se nedan), eller ett av specialvärdena :const:`signal.SIG_IGN` eller :const:`signal.SIG_DFL`. Den föregående signalhanteraren kommer att returneras (se beskrivningen av :func:`getsignal` ovan). (Se Unix man page :manpage:`signal(2)` för ytterligare information)

source: The *handler* is called with two arguments: the signal number and the current stack frame (``None`` or a frame object; for a description of frame objects, see the :ref:`description in the type hierarchy <frame-objects>` or see the attribute descriptions in the :mod:`inspect` module).
ru: *Обработчик* вызывается с двумя аргументами: номером сигнала и текущим кадром стека («None» или объектом кадра; описание объектов кадра см. в описании в иерархии типов <frame- объекты>` или посмотрите описания атрибутов в модуле :mod:`inspect`).
sv: *Handler* anropas med två argument: signalnumret och den aktuella stackramen (``None`` eller ett ramobjekt; för en beskrivning av ramobjekt, se :ref:`description i typhierarkin <frame-objects>` eller se attributbeskrivningarna i modulen :mod:`inspect`).

source: On Windows, :func:`signal` can only be called with :const:`SIGABRT`, :const:`SIGFPE`, :const:`SIGILL`, :const:`SIGINT`, :const:`SIGSEGV`, :const:`SIGTERM`, or :const:`SIGBREAK`. A :exc:`ValueError` will be raised in any other case. Note that not all systems define the same set of signal names; an :exc:`AttributeError` will be raised if a signal name is not defined as ``SIG*`` module level constant.
ru: В Windows :func:`signal` можно вызвать только с помощью :const:`SIGABRT`, :const:`SIGFPE`, :const:`SIGILL`, :const:`SIGINT`, :const:`SIGSEGV`, : const:`SIGTERM` или :const:`SIGBREAK`. В любом другом случае будет выдано :exc:`ValueError`. Обратите внимание, что не все системы определяют один и тот же набор имен сигналов; :exc:`AttributeError` будет вызвано, если имя сигнала не определено как константа уровня модуля ``SIG*``.
sv: I Windows kan :func:`signal` endast anropas med :const:`SIGABRT`, :const:`SIGFPE`, :const:`SIGILL`, :const:`SIGINT`, :const:`SIGSEGV`, :const:`SIGTERM` eller :const:`SIGBREAK`. Ett :exc:`ValueError` kommer att uppstå i alla andra fall. Observera att inte alla system definierar samma uppsättning signalnamn; ett :exc:`AttributeError` kommer att uppstå om ett signalnamn inte är definierat som ``SIG*`` konstant på modulnivå.

source: Examine the set of signals that are pending for delivery to the calling thread (i.e., the signals which have been raised while blocked). Return the set of the pending signals.
ru: Проверьте набор сигналов, ожидающих доставки в вызывающий поток (т. е. сигналы, которые были созданы во время блокировки). Возвращает набор ожидающих сигналов.
sv: Undersök uppsättningen signaler som väntar på att levereras till den anropande tråden (dvs. de signaler som har skapats medan de blockerats). Returnera uppsättningen av de väntande signalerna.

source: See the man page :manpage:`sigpending(2)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`sigpending(2)`.
sv: Se manualsidan :manpage:`sigpending(2)` för ytterligare information.

source: See also :func:`pause`, :func:`pthread_sigmask` and :func:`sigwait`.
ru: См. также :func:`pause`, :func:`pthread_sigmask` и :func:`sigwait`.
sv: Se även :func:`pause`, :func:`pthread_sigmask` och :func:`sigwait`.

source: Suspend execution of the calling thread until the delivery of one of the signals specified in the signal set *sigset*. The function accepts the signal (removes it from the pending list of signals), and returns the signal number.
ru: Приостановить выполнение вызывающего потока до доставки одного из сигналов, указанных в наборе сигналов *sigset*. Функция принимает сигнал (удаляет его из списка ожидающих сигналов) и возвращает номер сигнала.
sv: Avbryter exekveringen av den anropande tråden tills en av de signaler som anges i signaluppsättningen *sigset* har levererats. Funktionen accepterar signalen (tar bort den från listan över väntande signaler) och returnerar signalnumret.

source: See the man page :manpage:`sigwait(3)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`sigwait(3)`.
sv: Se manualsidan :manpage:`sigwait(3)` för ytterligare information.

source: See also :func:`pause`, :func:`pthread_sigmask`, :func:`sigpending`, :func:`sigwaitinfo` and :func:`sigtimedwait`.
ru: См. также :func:`pause`, :func:`pthread_sigmask`, :func:`sigpending`, :func:`sigwaitinfo` и :func:`sigtimedwait`.
sv: Se även :func:`pause`, :func:`pthread_sigmask`, :func:`sigpending`, :func:`sigwaitinfo` och :func:`sigtimedwait`.

source: Suspend execution of the calling thread until the delivery of one of the signals specified in the signal set *sigset*. The function accepts the signal and removes it from the pending list of signals. If one of the signals in *sigset* is already pending for the calling thread, the function will return immediately with information about that signal. The signal handler is not called for the delivered signal. The function raises an :exc:`InterruptedError` if it is interrupted by a signal that is not in *sigset*.
ru: Приостановить выполнение вызывающего потока до доставки одного из сигналов, указанных в наборе сигналов *sigset*. Функция принимает сигнал и удаляет его из списка ожидающих сигналов. Если один из сигналов в *sigset* уже ожидает вызывающего потока, функция немедленно вернет информацию об этом сигнале. Обработчик сигнала не вызывается для доставленного сигнала. Функция вызывает :exc:`InterruptedError`, если она прерывается сигналом, которого нет в *sigset*.
sv: Avbryt exekveringen av den anropande tråden tills en av de signaler som anges i signaluppsättningen *sigset* har levererats. Funktionen accepterar signalen och tar bort den från listan över väntande signaler. Om en av signalerna i *sigset* redan är väntande för den anropande tråden, kommer funktionen att returnera omedelbart med information om den signalen. Signalhanteraren anropas inte för den levererade signalen. Funktionen ger upphov till ett :exc:`InterruptedError` om den avbryts av en signal som inte finns i *sigset*.

source: The return value is an object representing the data contained in the :c:type:`siginfo_t` structure, namely: :attr:`si_signo`, :attr:`si_code`, :attr:`si_errno`, :attr:`si_pid`, :attr:`si_uid`, :attr:`si_status`, :attr:`si_band`.
ru: Возвращаемое значение — это объект, представляющий данные, содержащиеся в структуре :c:type:`siginfo_t`, а именно: :attr:`si_signo`, :attr:`si_code`, :attr:`si_errno`, :attr:`si_pid `, :attr:`si_uid`, :attr:`si_status`, :attr:`si_band`.
sv: Returvärdet är ett objekt som representerar de data som finns i strukturen :c:type:`siginfo_t`, nämligen: :attr:`si_signo`, :attr:`si_code`, :attr:`si_errno`, :attr:`si_pid`, :attr:`si_uid`, :attr:`si_status`, :attr:`si_band`.

source: See the man page :manpage:`sigwaitinfo(2)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`sigwaitinfo(2)`.
sv: Se manualsidan :manpage:`sigwaitinfo(2)` för ytterligare information.

source: See also :func:`pause`, :func:`sigwait` and :func:`sigtimedwait`.
ru: См. также :func:`pause`, :func:`sigwait` и :func:`sigtimedwait`.
sv: Se även :func:`pause`, :func:`sigwait` och :func:`sigtimedwait`.

source: The function is now retried if interrupted by a signal not in *sigset* and the signal handler does not raise an exception (see :pep:`475` for the rationale).
ru: Функция теперь повторяется, если она прерывается сигналом, которого нет в *sigset*, и обработчик сигнала не вызывает исключение (обоснование см. в :pep:`475`).
sv: Funktionen prövas nu igen om den avbryts av en signal som inte finns i *sigset* och signalhanteraren inte ger upphov till ett undantag (se :pep:`475` för motivering).

source: Like :func:`sigwaitinfo`, but takes an additional *timeout* argument specifying a timeout. If *timeout* is specified as ``0``, a poll is performed. Returns :const:`None` if a timeout occurs.
ru: Аналогично :func:`sigwaitinfo`, но принимает дополнительный аргумент *timeout*, определяющий время ожидания. Если для *timeout* указано ``0``, выполняется опрос. Возвращает :const:`None`, если произошел тайм-аут.
sv: Som :func:`sigwaitinfo`, men tar ytterligare ett *timeout*-argument som anger en timeout. Om *timeout* anges som ``0`` utförs en pollning. Returnerar :const:`None` om en timeout inträffar.

source: See the man page :manpage:`sigtimedwait(2)` for further information.
ru: Дополнительную информацию смотрите на странице руководства :manpage:`sigtimedwait(2)`.
sv: Se manualsidan :manpage:`sigtimedwait(2)` för ytterligare information.

source: See also :func:`pause`, :func:`sigwait` and :func:`sigwaitinfo`.
ru: См. также :func:`pause`, :func:`sigwait` и :func:`sigwaitinfo`.
sv: Se även :func:`pause`, :func:`sigwait` och :func:`sigwaitinfo`.

source: The function is now retried with the recomputed *timeout* if interrupted by a signal not in *sigset* and the signal handler does not raise an exception (see :pep:`475` for the rationale).
ru: Функция теперь повторяется с пересчитанным *тайм-аутом*, если она прерывается сигналом, не входящим в *sigset*, и обработчик сигнала не вызывает исключение (обоснование см. в :pep:`475`).
sv: Funktionen försöker nu igen med den omräknade *timeout* om den avbryts av en signal som inte finns i *sigset* och signalhanteraren inte gör ett undantag (se :pep:`475` för motivering).

source: Examples
ru: Примеры
sv: Exempel

source: Here is a minimal example program. It uses the :func:`alarm` function to limit the time spent waiting to open a file; this is useful if the file is for a serial device that may not be turned on, which would normally cause the :func:`os.open` to hang indefinitely. The solution is to set a 5-second alarm before opening the file; if the operation takes too long, the alarm signal will be sent, and the handler raises an exception. ::
ru: Вот минимальный пример программы. Он использует функцию :func:`alarm` для ограничения времени ожидания открытия файла; это полезно, если файл предназначен для последовательного устройства, которое может быть не включено, что обычно приводит к зависанию :func:`os.open` на неопределенный срок. Решение — установить 5-секундный сигнал перед открытием файла; если операция занимает слишком много времени, будет отправлен сигнал тревоги, и обработчик вызовет исключение. ::
sv: Här är ett minimalt exempelprogram. Det använder funktionen :func:`alarm` för att begränsa väntetiden för att öppna en fil; detta är användbart om filen är för en seriell enhet som kanske inte är påslagen, vilket normalt skulle få :func:`os.open` att hänga sig på obestämd tid. Lösningen är att ställa in ett 5-sekunders alarm innan filen öppnas; om operationen tar för lång tid skickas alarmsignalen och hanteraren gör ett undantag. ::

source: Note on SIGPIPE
ru: Заметка о SIGPIPE
sv: Anmärkning om SIGPIPE

source: Piping output of your program to tools like :manpage:`head(1)` will cause a :const:`SIGPIPE` signal to be sent to your process when the receiver of its standard output closes early. This results in an exception like :code:`BrokenPipeError: [Errno 32] Broken pipe`. To handle this case, wrap your entry point to catch this exception as follows::
ru: Передача вывода вашей программы по каналам в такие инструменты, как :manpage:`head(1)`, приведет к отправке сигнала :const:`SIGPIPE` в ваш процесс, когда приемник его стандартного вывода закрывается раньше времени. Это приводит к исключению типа :code:`BrokenPipeError: [Errno 32] Broken Pipe`. Чтобы обработать этот случай, оберните точку входа, чтобы перехватить это исключение, следующим образом:
sv: Att pipa utdata från ditt program till verktyg som :manpage:`head(1)` kommer att orsaka att en :const:`SIGPIPE`\-signal skickas till din process när mottagaren av dess standardutdata stängs tidigt. Detta resulterar i ett undantag som :code:`BrokenPipeError: [Errno 32] Broken pipe`. För att hantera det här fallet, linda in din ingångspunkt för att fånga det här undantaget enligt följande::

source: Do not set :const:`SIGPIPE`'s disposition to :const:`SIG_DFL` in order to avoid :exc:`BrokenPipeError`. Doing that would cause your program to exit unexpectedly whenever any socket connection is interrupted while your program is still writing to it.
ru: Не устанавливайте расположение :const:`SIGPIPE` в :const:`SIG_DFL`, чтобы избежать :exc:`BrokenPipeError`. Это приведет к неожиданному завершению вашей программы всякий раз, когда какое-либо соединение с сокетом прерывается, пока ваша программа все еще записывает в него данные.
sv: Ställ inte in :const:`SIGPIPE` disposition till :const:`SIG_DFL` för att undvika :exc:`BrokenPipeError`. Om du gör det kommer ditt program att avslutas oväntat när en socketanslutning avbryts medan ditt program fortfarande skriver till den.

source: Note on Signal Handlers and Exceptions
ru: Примечание об обработчиках сигналов и исключениях
sv: Anmärkning om signalhanterare och undantag

source: If a signal handler raises an exception, the exception will be propagated to the main thread and may be raised after any :term:`bytecode` instruction. Most notably, a :exc:`KeyboardInterrupt` may appear at any point during execution. Most Python code, including the standard library, cannot be made robust against this, and so a :exc:`KeyboardInterrupt` (or any other exception resulting from a signal handler) may on rare occasions put the program in an unexpected state.
ru: Если обработчик сигнала вызывает исключение, оно будет передано в основной поток и может быть вызвано после любой инструкции :term:`bytecode`. В частности, :exc:`KeyboardInterrupt` может появиться в любой момент во время выполнения. Большую часть кода Python, включая стандартную библиотеку, невозможно сделать устойчивым к этому, поэтому :exc:`KeyboardInterrupt` (или любое другое исключение, возникающее из-за обработчика сигнала) может в редких случаях перевести программу в неожиданное состояние.
sv: Om en signalhanterare ger upphov till ett undantag, kommer undantaget att spridas till huvudtråden och kan ges upphov till efter varje :term:`bytecode`\-instruktion. Mest anmärkningsvärt är att ett :exc:`KeyboardInterrupt` kan dyka upp när som helst under exekveringen. Den mesta Python-koden, inklusive standardbiblioteket, kan inte göras robust mot detta, och därför kan ett :exc:`KeyboardInterrupt` (eller något annat undantag som härrör från en signalhanterare) vid sällsynta tillfällen försätta programmet i ett oväntat tillstånd.

source: To illustrate this issue, consider the following code::
ru: Чтобы проиллюстрировать эту проблему, рассмотрим следующий код:
sv: För att illustrera detta problem kan du titta på följande kod::

source: For many programs, especially those that merely want to exit on :exc:`KeyboardInterrupt`, this is not a problem, but applications that are complex or require high reliability should avoid raising exceptions from signal handlers. They should also avoid catching :exc:`KeyboardInterrupt` as a means of gracefully shutting down. Instead, they should install their own :const:`SIGINT` handler. Below is an example of an HTTP server that avoids :exc:`KeyboardInterrupt`::
ru: Для многих программ, особенно тех, которые просто хотят завершить работу по :exc:`KeyboardInterrupt`, это не проблема, но приложениям, которые сложны или требуют высокой надежности, следует избегать вызова исключений из обработчиков сигналов. Им также следует избегать перехвата :exc:`KeyboardInterrupt` как средства корректного завершения работы. Вместо этого им следует установить собственный обработчик :const:`SIGINT`. Ниже приведен пример HTTP-сервера, который избегает :exc:`KeyboardInterrupt`::
sv: För många program, speciellt de som bara vill avsluta på :exc:`KeyboardInterrupt`, är detta inget problem, men applikationer som är komplexa eller kräver hög tillförlitlighet bör undvika att skapa undantag från signalhanterare. De bör också undvika att fånga :exc:`KeyboardInterrupt` som ett sätt att stänga av på ett elegant sätt. Istället bör de installera sin egen :const:`SIGINT`\-hanterare. Nedan följer ett exempel på en HTTP-server som undviker :exc:`KeyboardInterrupt`::

source: On WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``, signals are emulated and therefore behave differently. Several functions and signals are not available on these platforms.
ru: На платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi» сигналы эмулируются и поэтому ведут себя по-разному. Некоторые функции и сигналы недоступны на этих платформах.

source: Set the wakeup file descriptor to *fd*. When a signal is received, the signal number is written as a single byte into the fd. This can be used by a library to wakeup a poll or select call, allowing the signal to be fully processed.
ru: Установите дескриптор файла пробуждения на *fd*. Когда сигнал получен, номер сигнала записывается в виде одного байта в fd. Это может использоваться библиотекой для запуска опроса или выбора вызова, что позволяет полностью обработать сигнал.
