Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/smtplib.po
Languages: pt_pt

source: *msg* may be a string containing characters in the ASCII range, or a byte string. A string is encoded to bytes using the ascii codec, and lone ``\r`` and ``\n`` characters are converted to ``\r\n`` characters. A byte string is not modified.
pt_pt: *msg* pode ser uma string contendo caracteres na gama ASCII, ou uma string de bytes. Uma string é codificada para bytes usando o codec ascii, e caracteres ``\r`` e ``\n`` solitários são convertidos para caracteres ``\r\n``. Uma string de bytes não é modificada.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. If the server does ESMTP, message size and each of the specified options will be passed to it (if the option is in the feature set the server advertises). If ``EHLO`` fails, ``HELO`` will be tried and ESMTP options suppressed.
pt_pt: Se não houve nenhum comando ``EHLO`` ou ``HELO`` anterior nesta sessão, este método tenta primeiro ESMTP ``EHLO``. Se o servidor suportar ESMTP, o tamanho da mensagem e cada uma das opções especificadas serão passadas para ele (se a opção estiver no conjunto de funcionalidades que o servidor anuncia). Se ``EHLO`` falhar, ``HELO`` será tentado e as opções ESMTP serão suprimidas.

source: This method will return normally if the mail is accepted for at least one recipient. Otherwise it will raise an exception. That is, if this method does not raise an exception, then someone should get your mail. If this method does not raise an exception, it returns a dictionary, with one entry for each recipient that was refused. Each entry contains a tuple of the SMTP error code and the accompanying error message sent by the server.
pt_pt: Este método retornará normalmente se o correio for aceite para pelo menos um destinatário. Caso contrário, levantará uma exceção. Ou seja, se este método não levantar uma exceção, então alguém deve receber o seu correio. Se este método não levantar uma exceção, retorna um dicionário, com uma entrada para cada destinatário que foi recusado. Cada entrada contém um tuplo do código de erro SMTP e a mensagem de erro acompanhante enviada pelo servidor.

source: If ``SMTPUTF8`` is included in *mail_options*, and the server supports it, *from_addr* and *to_addrs* may contain non-ASCII characters.
pt_pt: Se ``SMTPUTF8`` estiver incluído em *mail_options* e o servidor o suportar, *from_addr* e *to_addrs* podem conter caracteres não-ASCII.

source: This method may raise the following exceptions:
pt_pt: Este método pode levantar as seguintes exceções:

source: The server didn't accept the *from_addr*.
pt_pt: O servidor não aceitou o *from_addr*.

source: The server replied with an unexpected error code (other than a refusal of a recipient).
pt_pt: O servidor respondeu com um código de erro inesperado (diferente de uma recusa de um destinatário).

source: ``SMTPUTF8`` was given in the *mail_options* but is not supported by the server.
pt_pt: ``SMTPUTF8`` foi dado em *mail_options*, mas não é suportado pelo servidor.

source: Unless otherwise noted, the connection will be open even after an exception is raised.
pt_pt: A menos que seja indicado o contrário, a ligação permanecerá aberta mesmo após uma exceção ser levantada.

source: *msg* may be a byte string.
pt_pt: *msg* pode ser uma string de bytes.

source: ``SMTPUTF8`` support added, and :exc:`SMTPNotSupportedError` may be raised if ``SMTPUTF8`` is specified but the server does not support it.
pt_pt: Suporte ``SMTPUTF8`` adicionado, e :exc:`SMTPNotSupportedError` pode ser levantado se ``SMTPUTF8`` for especificado, mas o servidor não o suportar.

source: This is a convenience method for calling :meth:`sendmail` with the message represented by an :class:`email.message.Message` object. The arguments have the same meaning as for :meth:`sendmail`, except that *msg* is a ``Message`` object.
pt_pt: Este é um método de conveniência para chamar :meth:`sendmail` com a mensagem representada por um objeto :class:`email.message.Message`. Os argumentos têm o mesmo significado que para :meth:`sendmail`, exceto que *msg* é um objeto ``Message``.

source: If *from_addr* is ``None`` or *to_addrs* is ``None``, ``send_message`` fills those arguments with addresses extracted from the headers of *msg* as specified in :rfc:`5322`\: *from_addr* is set to the :mailheader:`Sender` field if it is present, and otherwise to the :mailheader:`From` field. *to_addrs* combines the values (if any) of the :mailheader:`To`, :mailheader:`Cc`, and :mailheader:`Bcc` fields from *msg*. If exactly one set of :mailheader:`Resent-*` headers appear in the message, the regular headers are ignored and the :mailheader:`Resent-*` headers are used instead. If the message contains more than one set of :mailheader:`Resent-*` headers, a :exc:`ValueError` is raised, since there is no way to unambiguously detect the most recent set of :mailheader:`Resent-` headers.
pt_pt: Se *from_addr* for ``None`` ou *to_addrs* for ``None``, ``send_message`` preenche esses argumentos com endereços extraídos dos cabeçalhos de *msg* como especificado em :rfc:`5322`\: *from_addr* é definido para o campo :mailheader:`Sender` se estiver presente, e caso contrário para o campo :mailheader:`From`. *to_addrs* combina os valores (se houver) dos campos :mailheader:`To`, :mailheader:`Cc` e :mailheader:`Bcc` de *msg*. Se exatamente um conjunto de cabeçalhos :mailheader:`Resent-*` aparecer na mensagem, os cabeçalhos regulares são ignorados e os cabeçalhos :mailheader:`Resent-*` são usados em vez disso. Se a mensagem contiver mais do que um conjunto de cabeçalhos :mailheader:`Resent-*`, uma exceção :exc:`ValueError` é levantada, uma vez que não há forma de detetar de forma inequívoca o conjunto mais recente de cabeçalhos :mailheader:`Resent-`.

source: Support for internationalized addresses (``SMTPUTF8``).
pt_pt: Suporte para endereços internacionalizados (``SMTPUTF8``).

source: Terminate the SMTP session and close the connection. Return the result of the SMTP ``QUIT`` command.
pt_pt: Termina a sessão SMTP e fecha a ligação. Retorna o resultado do comando SMTP ``QUIT``.

source: Low-level methods corresponding to the standard SMTP/ESMTP commands ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT``, and ``DATA`` are also supported. Normally these do not need to be called directly, so they are not documented here. For details, consult the module code.
pt_pt: Métodos de baixo nível correspondentes aos comandos SMTP/ESMTP padrão ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT`` e ``DATA`` também são suportados. Normalmente, estes não precisam de ser chamados diretamente, por isso não estão documentados aqui. Para detalhes, consulte o código do módulo.

source: SMTP Example
pt_pt: Exemplo SMTP

source: In general, you will want to use the :mod:`email` package's features to construct an email message, which you can then send via :meth:`~smtplib.SMTP.send_message`; see :ref:`email-examples`.
pt_pt: Em geral, vai querer usar as funcionalidades do pacote :mod:`email` para construir uma mensagem de email, que pode então enviar através de :meth:`~smtplib.SMTP.send_message`; veja :ref:`email-examples`.

source: protocol
pt_pt: protocolo

source: Simple Mail Transfer Protocol
pt_pt: Protocolo Simples de Transferência de Correio
