Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/smtplib.po
Languages: pt_pt

source: **Source code:** :source:`Lib/smtplib.py`
pt_pt: **Código-fonte:** :source:`Lib/smtplib.py`

source: The :mod:`smtplib` module defines an SMTP client session object that can be used to send mail to any internet machine with an SMTP or ESMTP listener daemon. For details of SMTP and ESMTP operation, consult :rfc:`821` (Simple Mail Transfer Protocol) and :rfc:`1869` (SMTP Service Extensions).
pt_pt: O módulo :mod:`smtplib` define um objeto de sessão cliente SMTP que pode ser usado para enviar correio para qualquer máquina na internet com um daemon ouvinte SMTP ou ESMTP. Para detalhes sobre a operação SMTP e ESMTP, consulte :rfc:`821` (Protocolo Simples de Transferência de Correio) e :rfc:`1869` (Extensões de Serviço SMTP).

source: An :class:`SMTP` instance encapsulates an SMTP connection. It has methods that support a full repertoire of SMTP and ESMTP operations. If the optional *host* and *port* parameters are given, the SMTP :meth:`connect` method is called with those parameters during initialization. If specified, *local_hostname* is used as the FQDN of the local host in the HELO/EHLO command. Otherwise, the local hostname is found using :func:`socket.getfqdn`. If the :meth:`connect` call returns anything other than a success code, an :exc:`SMTPConnectError` is raised. The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). If the timeout expires, :exc:`TimeoutError` is raised. The optional *source_address* parameter allows binding to some specific source address in a machine with multiple network interfaces, and/or to some specific source TCP port. It takes a 2-tuple ``(host, port)``, for the socket to bind to as its source address before connecting. If omitted (or if *host* or *port* are ``''`` and/or ``0`` respectively) the OS default behavior will be used.
pt_pt: Uma instância :class:`SMTP` encapsula uma ligação SMTP. Tem métodos que suportam um repertório completo de operações SMTP e ESMTP. Se os parâmetros opcionais *host* e *port* forem fornecidos, o método :meth:`connect` é chamado com esses parâmetros durante a inicialização. Se especificado, *local_hostname* é usado como o FQDN do host local no comando HELO/EHLO. Caso contrário, o nome do host local é encontrado usando :func:`socket.getfqdn`. Se a chamada :meth:`connect` retornar algo diferente de um código de sucesso, uma exceção :exc:`SMTPConnectError` é levantada. O parâmetro opcional *timeout* especifica um tempo limite em segundos para operações bloqueantes como a tentativa de ligação (se não for especificado, a configuração de tempo limite global padrão será usada). Se o tempo limite expirar, :exc:`TimeoutError` é levantado. O parâmetro opcional *source_address* permite a ligação a um endereço de origem específico numa máquina com várias interfaces de rede e/ou a uma porta TCP de origem específica. Aceita um tuplo de 2 elementos ``(host, port)``, para o socket se ligar como endereço de origem antes de se conectar. Se omitido (ou se *host* ou *port* forem ``''`` e/ou ``0``, respetivamente), o comportamento padrão do sistema operativo será usado.

source: For normal use, you should only require the initialization/connect, :meth:`sendmail`, and :meth:`SMTP.quit` methods. An example is included below.
pt_pt: Para uso normal, só deve precisar dos métodos de inicialização/conexão, :meth:`sendmail` e :meth:`SMTP.quit`. Um exemplo está incluído abaixo.

source: The :class:`SMTP` class supports the :keyword:`with` statement. When used like this, the SMTP ``QUIT`` command is issued automatically when the :keyword:`!with` statement exits. E.g.::
pt_pt: A classe :class:`SMTP` suporta a instrução :keyword:`with`. Quando usada desta forma, o comando SMTP ``QUIT`` é emitido automaticamente quando a instrução :keyword:`!with` termina. Por exemplo::

source: All commands will raise an :ref:`auditing event <auditing>` ``smtplib.SMTP.send`` with arguments ``self`` and ``data``, where ``data`` is the bytes about to be sent to the remote host.
pt_pt: Todos os comandos irão levantar um :ref:`evento de auditoria <auditing>` ``smtplib.SMTP.send`` com argumentos ``self`` e ``data``, onde ``data`` são os bytes prestes a ser enviados para o host remoto.

source: Support for the :keyword:`with` statement was added.
pt_pt: Foi adicionado suporte para a instrução :keyword:`with`.

source: The SMTPUTF8 extension (:rfc:`6531`) is now supported.
pt_pt: A extensão SMTPUTF8 (:rfc:`6531`) é agora suportada.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket
pt_pt: Se o parâmetro *timeout* for definido como zero, levantará uma exceção :class:`ValueError` para evitar a criação de um socket não bloqueante.

source: *context* was added.
pt_pt: O parâmetro *context* foi adicionado.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
pt_pt: A classe agora suporta verificação de nome de host com :attr:`ssl.SSLContext.check_hostname` e *Indicação de Nome de Servidor* (ver :const:`ssl.HAS_SNI`).

source: Authentication is supported, using the regular SMTP mechanism. When using a Unix socket, LMTP generally don't support or require any authentication, but your mileage might vary.
pt_pt: A autenticação é suportada, usando o mecanismo SMTP regular. Ao usar um socket Unix, o LMTP geralmente não suporta ou requer qualquer autenticação, mas os resultados podem variar.

source: The optional *timeout* parameter was added.
pt_pt: Foi adicionado o parâmetro opcional *timeout*.

source: A nice selection of exceptions is defined as well:
pt_pt: Também está definida uma boa seleção de exceções:

source: Subclass of :exc:`OSError` that is the base exception class for all the other exceptions provided by this module.
pt_pt: Subclasse de :exc:`OSError` que é a classe base de exceção para todas as outras exceções fornecidas por este módulo.

source: SMTPException became subclass of :exc:`OSError`
pt_pt: SMTPException tornou-se subclasse de :exc:`OSError`.

source: This exception is raised when the server unexpectedly disconnects, or when an attempt is made to use the :class:`SMTP` instance before connecting it to a server.
pt_pt: Esta exceção é levantada quando o servidor desconecta inesperadamente, ou quando é feita uma tentativa de usar a instância :class:`SMTP` antes de a conectar a um servidor.

source: Sender address refused. In addition to the attributes set by on all :exc:`SMTPResponseException` exceptions, this sets 'sender' to the string that the SMTP server refused.
pt_pt: Endereço do remetente recusado. Além dos atributos definidos em todas as exceções :exc:`SMTPResponseException`, isto define 'sender' para a string que o servidor SMTP recusou.

source: The SMTP server refused to accept the message data.
pt_pt: O servidor SMTP recusou-se a aceitar os dados da mensagem.

source: Error occurred during establishment of a connection with the server.
pt_pt: Ocorreu um erro durante o estabelecimento de uma ligação com o servidor.

source: The server refused our ``HELO`` message.
pt_pt: O servidor recusou a nossa mensagem ``HELO``.

source: The command or option attempted is not supported by the server.
pt_pt: O comando ou opção tentada não é suportada pelo servidor.

source: SMTP authentication went wrong. Most probably the server didn't accept the username/password combination provided.
pt_pt: A autenticação SMTP correu mal. Muito provavelmente, o servidor não aceitou a combinação de nome de utilizador/senha fornecida.

source: :rfc:`821` - Simple Mail Transfer Protocol
pt_pt: :rfc:`821` - Protocolo Simples de Transferência de Correio

source: Protocol definition for SMTP. This document covers the model, operating procedure, and protocol details for SMTP.
pt_pt: Definição do protocolo para SMTP. Este documento cobre o modelo, procedimento operacional e detalhes do protocolo para SMTP.

source: :rfc:`1869` - SMTP Service Extensions
pt_pt: :rfc:`1869` - Extensões de Serviço SMTP

source: Definition of the ESMTP extensions for SMTP. This describes a framework for extending SMTP with new commands, supporting dynamic discovery of the commands provided by the server, and defines a few additional commands.
pt_pt: Definição das extensões ESMTP para SMTP. Isto descreve uma estrutura para estender o SMTP com novos comandos, suportando a descoberta dinâmica dos comandos fornecidos pelo servidor, e define alguns comandos adicionais.

source: SMTP Objects
pt_pt: Objetos SMTP

source: An :class:`SMTP` instance has the following methods:
pt_pt: Uma instância :class:`SMTP` tem os seguintes métodos:

source: Set the debug output level. A value of 1 or ``True`` for *level* results in debug messages for connection and for all messages sent to and received from the server. A value of 2 for *level* results in these messages being timestamped.
pt_pt: Define o nível de saída de depuração. Um valor de 1 ou ``True`` para *level* resulta em mensagens de depuração para a ligação e para todas as mensagens enviadas e recebidas do servidor. Um valor de 2 para *level* resulta nestas mensagens serem carimbadas com data e hora.

source: Added debuglevel 2.
pt_pt: Foi adicionado o nível de depuração 2.

source: Send a command *cmd* to the server. The optional argument *args* is simply concatenated to the command, separated by a space.
pt_pt: Envie um comando *cmd* para o servidor. O argumento opcional *args* é simplesmente concatenado ao comando, separado por um espaço.

source: This returns a 2-tuple composed of a numeric response code and the actual response line (multiline responses are joined into one long line.)
pt_pt: Isto retorna um tuplo de 2 elementos composto por um código de resposta numérico e a linha de resposta real (respostas de várias linhas são unidas numa linha longa).

source: In normal operation it should not be necessary to call this method explicitly. It is used to implement other methods and may be useful for testing private extensions.
pt_pt: Em operação normal, não deve ser necessário chamar este método explicitamente. É usado para implementar outros métodos e pode ser útil para testar extensões privadas.

source: If the connection to the server is lost while waiting for the reply, :exc:`SMTPServerDisconnected` will be raised.
pt_pt: Se a ligação ao servidor for perdida enquanto se aguarda pela resposta, :exc:`SMTPServerDisconnected` será levantada.

source: Connect to a host on a given port. The defaults are to connect to the local host at the standard SMTP port (25). If the hostname ends with a colon (``':'``) followed by a number, that suffix will be stripped off and the number interpreted as the port number to use. This method is automatically invoked by the constructor if a host is specified during instantiation. Returns a 2-tuple of the response code and message sent by the server in its connection response.
pt_pt: Conectar a um host numa porta dada. Os valores predefinidos são para conectar ao host local na porta SMTP padrão (25). Se o nome do host terminar com dois pontos (``':'``) seguidos de um número, esse sufixo será removido e o número interpretado como o número da porta a usar. Este método é invocado automaticamente pelo construtor se um host for especificado durante a instanciação. Retorna um tuplo de 2 elementos com o código de resposta e a mensagem enviada pelo servidor na sua resposta de ligação.

source: Raises an :ref:`auditing event <auditing>` ``smtplib.connect`` with arguments ``self``, ``host``, ``port``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``smtplib.connect`` com argumentos ``self``, ``host``, ``port``.

source: Identify yourself to the SMTP server using ``HELO``. The hostname argument defaults to the fully qualified domain name of the local host. The message returned by the server is stored as the :attr:`helo_resp` attribute of the object.
pt_pt: Identifique-se ao servidor SMTP usando ``HELO``. O argumento hostname é, por defeito, o nome de domínio totalmente qualificado do host local. A mensagem retornada pelo servidor é armazenada como o atributo :attr:`helo_resp` do objeto.

source: In normal operation it should not be necessary to call this method explicitly. It will be implicitly called by the :meth:`sendmail` when necessary.
pt_pt: Em operação normal, não deve ser necessário chamar este método explicitamente. Será chamado implicitamente por :meth:`sendmail` quando necessário.

source: Identify yourself to an ESMTP server using ``EHLO``. The hostname argument defaults to the fully qualified domain name of the local host. Examine the response for ESMTP option and store them for use by :meth:`has_extn`. Also sets several informational attributes: the message returned by the server is stored as the :attr:`ehlo_resp` attribute, :attr:`does_esmtp` is set to ``True`` or ``False`` depending on whether the server supports ESMTP, and :attr:`esmtp_features` will be a dictionary containing the names of the SMTP service extensions this server supports, and their parameters (if any).
pt_pt: Identifique-se a um servidor ESMTP usando ``EHLO``. O argumento hostname é, por defeito, o nome de domínio totalmente qualificado do host local. Examine a resposta para opções ESMTP e armazene-as para uso por :meth:`has_extn`. Também define vários atributos informativos: a mensagem retornada pelo servidor é armazenada como o atributo :attr:`ehlo_resp`, :attr:`does_esmtp` é definido como ``True`` ou ``False`` dependendo se o servidor suporta ESMTP, e :attr:`esmtp_features` será um dicionário contendo os nomes das extensões de serviço SMTP que este servidor suporta, e os seus parâmetros (se houver).

source: Unless you wish to use :meth:`has_extn` before sending mail, it should not be necessary to call this method explicitly. It will be implicitly called by :meth:`sendmail` when necessary.
pt_pt: A menos que pretenda usar :meth:`has_extn` antes de enviar correio, não deve ser necessário chamar este método explicitamente. Será chamado implicitamente por :meth:`sendmail` quando necessário.

source: This method calls :meth:`ehlo` and/or :meth:`helo` if there has been no previous ``EHLO`` or ``HELO`` command this session. It tries ESMTP ``EHLO`` first.
pt_pt: Este método chama :meth:`ehlo` e/ou :meth:`helo` se não houve nenhum comando ``EHLO`` ou ``HELO`` anterior nesta sessão. Tenta primeiro o ESMTP ``EHLO``.

source: The server didn't reply properly to the ``HELO`` greeting.
pt_pt: O servidor não respondeu corretamente à saudação ``HELO``.

source: Return :const:`True` if *name* is in the set of SMTP service extensions returned by the server, :const:`False` otherwise. Case is ignored.
pt_pt: Retorna :const:`True` se *name* estiver no conjunto de extensões de serviço SMTP retornadas pelo servidor, :const:`False` caso contrário. A distinção entre maiúsculas e minúsculas é ignorada.

source: Check the validity of an address on this server using SMTP ``VRFY``. Returns a tuple consisting of code 250 and a full :rfc:`822` address (including human name) if the user address is valid. Otherwise returns an SMTP error code of 400 or greater and an error string.
pt_pt: Verifica a validade de um endereço neste servidor usando SMTP ``VRFY``. Retorna um tuplo consistindo no código 250 e um endereço :rfc:`822` completo (incluindo nome humano) se o endereço do utilizador for válido. Caso contrário, retorna um código de erro SMTP de 400 ou superior e uma string de erro.

source: Many sites disable SMTP ``VRFY`` in order to foil spammers.
pt_pt: Muitos sites desativam SMTP ``VRFY`` para dificultar a vida aos spammers.

source: Log in on an SMTP server that requires authentication. The arguments are the username and the password to authenticate with. If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. This method will return normally if the authentication was successful, or may raise the following exceptions:
pt_pt: Inicia sessão num servidor SMTP que requer autenticação. Os argumentos são o nome de utilizador e a senha para autenticar. Se não houve nenhum comando ``EHLO`` ou ``HELO`` anterior nesta sessão, este método tenta primeiro ESMTP ``EHLO``. Este método retornará normalmente se a autenticação for bem-sucedida, ou pode levantar as seguintes exceções:

source: The server didn't accept the username/password combination.
pt_pt: O servidor não aceitou a combinação de nome de utilizador/senha.

source: The ``AUTH`` command is not supported by the server.
pt_pt: O comando ``AUTH`` não é suportado pelo servidor.

source: No suitable authentication method was found.
pt_pt: Nenhum método de autenticação adequado foi encontrado.

source: Each of the authentication methods supported by :mod:`smtplib` are tried in turn if they are advertised as supported by the server. See :meth:`auth` for a list of supported authentication methods. *initial_response_ok* is passed through to :meth:`auth`.
pt_pt: Cada um dos métodos de autenticação suportados por :mod:`smtplib` são tentados por sua vez se forem anunciados como suportados pelo servidor. Veja :meth:`auth` para uma lista de métodos de autenticação suportados. *initial_response_ok* é passado para :meth:`auth`.

source: Optional keyword argument *initial_response_ok* specifies whether, for authentication methods that support it, an "initial response" as specified in :rfc:`4954` can be sent along with the ``AUTH`` command, rather than requiring a challenge/response.
pt_pt: O argumento opcional de palavra-chave *initial_response_ok* especifica se, para métodos de autenticação que o suportam, uma "resposta inicial" como especificado em :rfc:`4954` pode ser enviada juntamente com o comando ``AUTH``, em vez de exigir um desafio/resposta.

source: Issue an ``SMTP`` ``AUTH`` command for the specified authentication *mechanism*, and handle the challenge response via *authobject*.
pt_pt: Emite um comando ``SMTP`` ``AUTH`` para o *mecanismo* de autenticação especificado e lida com a resposta de desafio através de *authobject*.

source: *mechanism* specifies which authentication mechanism is to be used as argument to the ``AUTH`` command; the valid values are those listed in the ``auth`` element of :attr:`esmtp_features`.
pt_pt: *mechanism* especifica qual o mecanismo de autenticação a ser usado como argumento para o comando ``AUTH``; os valores válidos são aqueles listados no elemento ``auth`` de :attr:`esmtp_features`.

source: If optional keyword argument *initial_response_ok* is true, ``authobject()`` will be called first with no argument. It can return the :rfc:`4954` "initial response" ASCII ``str`` which will be encoded and sent with the ``AUTH`` command as below. If the ``authobject()`` does not support an initial response (e.g. because it requires a challenge), it should return ``None`` when called with ``challenge=None``. If *initial_response_ok* is false, then ``authobject()`` will not be called first with ``None``.
pt_pt: Se o argumento opcional de palavra-chave *initial_response_ok* for verdadeiro, ``authobject()`` será chamado primeiro sem argumentos. Pode retornar a "resposta inicial" ASCII ``str`` :rfc:`4954` que será codificada e enviada com o comando ``AUTH`` como abaixo. Se ``authobject()`` não suportar uma resposta inicial (por exemplo, porque requer um desafio), deve retornar ``None`` quando chamado com ``challenge=None``. Se *initial_response_ok* for falso, então ``authobject()`` não será chamado primeiro com ``None``.

source: If the initial response check returns ``None``, or if *initial_response_ok* is false, ``authobject()`` will be called to process the server's challenge response; the *challenge* argument it is passed will be a ``bytes``. It should return ASCII ``str`` *data* that will be base64 encoded and sent to the server.
pt_pt: Se a verificação da resposta inicial retornar ``None``, ou se *initial_response_ok* for falso, ``authobject()`` será chamado para processar a resposta de desafio do servidor; o argumento *challenge* que é passado será um ``bytes``. Deve retornar dados ASCII ``str`` que serão codificados em base64 e enviados para o servidor.

source: The ``SMTP`` class provides ``authobjects`` for the ``CRAM-MD5``, ``PLAIN``, and ``LOGIN`` mechanisms; they are named ``SMTP.auth_cram_md5``, ``SMTP.auth_plain``, and ``SMTP.auth_login`` respectively. They all require that the ``user`` and ``password`` properties of the ``SMTP`` instance are set to appropriate values.
pt_pt: A classe ``SMTP`` fornece ``authobjects`` para os mecanismos ``CRAM-MD5``, ``PLAIN`` e ``LOGIN``; são chamados ``SMTP.auth_cram_md5``, ``SMTP.auth_plain`` e ``SMTP.auth_login`` respetivamente. Todos exigem que as propriedades ``user`` e ``password`` da instância ``SMTP`` estejam definidas com valores apropriados.

source: User code does not normally need to call ``auth`` directly, but can instead call the :meth:`login` method, which will try each of the above mechanisms in turn, in the order listed. ``auth`` is exposed to facilitate the implementation of authentication methods not (or not yet) supported directly by :mod:`smtplib`.
pt_pt: O código do utilizador normalmente não precisa de chamar ``auth`` diretamente, mas pode em vez disso chamar o método :meth:`login`, que tentará cada um dos mecanismos acima por sua vez, na ordem listada. ``auth`` é exposto para facilitar a implementação de métodos de autenticação não (ou ainda não) suportados diretamente por :mod:`smtplib`.

source: Put the SMTP connection in TLS (Transport Layer Security) mode. All SMTP commands that follow will be encrypted. You should then call :meth:`ehlo` again.
pt_pt: Coloca a ligação SMTP em modo TLS (Transport Layer Security). Todos os comandos SMTP que se seguirem serão encriptados. Deve chamar :meth:`ehlo` novamente.

source: If *keyfile* and *certfile* are provided, they are used to create an :class:`ssl.SSLContext`.
pt_pt: Se *keyfile* e *certfile* forem fornecidos, são usados para criar um :class:`ssl.SSLContext`.

source: Optional *context* parameter is an :class:`ssl.SSLContext` object; This is an alternative to using a keyfile and a certfile and if specified both *keyfile* and *certfile* should be ``None``.
pt_pt: O parâmetro opcional *context* é um objeto :class:`ssl.SSLContext`; isto é uma alternativa ao uso de um keyfile e um certfile e, se especificado, ambos *keyfile* e *certfile* devem ser ``None``.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first.
pt_pt: Se não houve nenhum comando ``EHLO`` ou ``HELO`` anterior nesta sessão, este método tenta primeiro ESMTP ``EHLO``.

source: The server does not support the STARTTLS extension.
pt_pt: O servidor não suporta a extensão STARTTLS.

source: SSL/TLS support is not available to your Python interpreter.
pt_pt: O suporte SSL/TLS não está disponível para o seu interpretador Python.

source: The error raised for lack of STARTTLS support is now the :exc:`SMTPNotSupportedError` subclass instead of the base :exc:`SMTPException`.
pt_pt: O erro levantado por falta de suporte STARTTLS é agora a subclasse :exc:`SMTPNotSupportedError` em vez da exceção base :exc:`SMTPException`.

source: The *from_addr* and *to_addrs* parameters are used to construct the message envelope used by the transport agents. ``sendmail`` does not modify the message headers in any way.
pt_pt: Os parâmetros *from_addr* e *to_addrs* são usados para construir o envelope da mensagem usado pelos agentes de transporte. ``sendmail`` não modifica os cabeçalhos da mensagem de nenhuma forma.
