Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/socketserver.po
Languages: pt_pt

source: :mod:`!socketserver` --- A framework for network servers
pt_pt: :mod:`!socketserver` --- Uma estrutura para servidores de rede

source: **Source code:** :source:`Lib/socketserver.py`
pt_pt: **Código-fonte:** :source:`Lib/socketserver.py`

source: The :mod:`socketserver` module simplifies the task of writing network servers.
pt_pt: O módulo :mod:`socketserver` simplifica a tarefa de escrever servidores de rede.

source: Availability
pt_pt: Disponibilidade

source: There are four basic concrete server classes:
pt_pt: Existem quatro classes de servidor concretas básicas:

source: This uses the internet TCP protocol, which provides for continuous streams of data between the client and server. If *bind_and_activate* is true, the constructor automatically attempts to invoke :meth:`~BaseServer.server_bind` and :meth:`~BaseServer.server_activate`. The other parameters are passed to the :class:`BaseServer` base class.
pt_pt: Usa o protocolo TCP da Internet, que fornece fluxos contínuos de dados entre o cliente e o servidor. Se *bind_and_activate* for verdadeiro, o construtor tenta automaticamente invocar :meth:`~BaseServer.server_bind` e :meth:`~BaseServer.server_activate`. Os outros parâmetros são passados para a classe base :class:`BaseServer`.

source: This uses datagrams, which are discrete packets of information that may arrive out of order or be lost while in transit. The parameters are the same as for :class:`TCPServer`.
pt_pt: Usa datagramas, que são pacotes discretos de informação que podem chegar fora de ordem ou serem perdidos durante o trânsito. Os parâmetros são os mesmos que para :class:`TCPServer`.

source: These more infrequently used classes are similar to the TCP and UDP classes, but use Unix domain sockets; they're not available on non-Unix platforms. The parameters are the same as for :class:`TCPServer`.
pt_pt: Estas classes menos frequentemente usadas são semelhantes às classes TCP e UDP, mas usam sockets de domínio Unix; não estão disponíveis em plataformas não Unix. Os parâmetros são os mesmos que para :class:`TCPServer`.

source: These four classes process requests :dfn:`synchronously`; each request must be completed before the next request can be started. This isn't suitable if each request takes a long time to complete, because it requires a lot of computation, or because it returns a lot of data which the client is slow to process. The solution is to create a separate process or thread to handle each request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` mix-in classes can be used to support asynchronous behaviour.
pt_pt: Estas quatro classes processam pedidos :dfn:`sincronamente`; cada pedido deve ser concluído antes que o próximo possa ser iniciado. Isto não é adequado se cada pedido demorar muito tempo a ser concluído, porque requer muito processamento, ou porque devolve muitos dados que o cliente demora a processar. A solução é criar um processo ou thread separado para lidar com cada pedido; as classes de mistura :class:`ForkingMixIn` e :class:`ThreadingMixIn` podem ser usadas para suportar comportamento assíncrono.

source: Creating a server requires several steps. First, you must create a request handler class by subclassing the :class:`BaseRequestHandler` class and overriding its :meth:`~BaseRequestHandler.handle` method; this method will process incoming requests. Second, you must instantiate one of the server classes, passing it the server's address and the request handler class. It is recommended to use the server in a :keyword:`with` statement. Then call the :meth:`~BaseServer.handle_request` or :meth:`~BaseServer.serve_forever` method of the server object to process one or many requests. Finally, call :meth:`~BaseServer.server_close` to close the socket (unless you used a :keyword:`!with` statement).
pt_pt: A criação de um servidor requer vários passos. Primeiro, deve criar uma classe de manipulador de pedidos, subclassificando a classe :class:`BaseRequestHandler` e substituindo o seu método :meth:`~BaseRequestHandler.handle`; este método processará os pedidos recebidos. Segundo, deve instanciar uma das classes de servidor, passando-lhe o endereço do servidor e a classe de manipulador de pedidos. É recomendado usar o servidor numa instrução :keyword:`with`. Depois, chame o método :meth:`~BaseServer.handle_request` ou :meth:`~BaseServer.serve_forever` do objeto servidor para processar um ou vários pedidos. Finalmente, chame :meth:`~BaseServer.server_close` para fechar o socket (a menos que tenha usado uma instrução :keyword:`!with`).

source: When inheriting from :class:`ThreadingMixIn` for threaded connection behavior, you should explicitly declare how you want your threads to behave on an abrupt shutdown. The :class:`ThreadingMixIn` class defines an attribute *daemon_threads*, which indicates whether or not the server should wait for thread termination. You should set the flag explicitly if you would like threads to behave autonomously; the default is :const:`False`, meaning that Python will not exit until all threads created by :class:`ThreadingMixIn` have exited.
pt_pt: Ao herdar de :class:`ThreadingMixIn` para comportamento de ligação com threads, deve declarar explicitamente como deseja que as suas threads se comportem em caso de encerramento abrupto. A classe :class:`ThreadingMixIn` define um atributo *daemon_threads*, que indica se o servidor deve ou não esperar pela terminação das threads. Deve definir explicitamente a flag se desejar que as threads se comportem autonomamente; o valor predefinido é :const:`False`, o que significa que o Python não sairá até que todas as threads criadas por :class:`ThreadingMixIn` tenham terminado.

source: Server classes have the same external methods and attributes, no matter what network protocol they use.
pt_pt: As classes de servidor têm os mesmos métodos e atributos externos, independentemente do protocolo de rede que usam.

source: Server Creation Notes
pt_pt: Notas sobre a Criação de Servidores

source: There are five classes in an inheritance diagram, four of which represent synchronous servers of four types::
pt_pt: Existem cinco classes num diagrama de herança, quatro das quais representam servidores síncronos de quatro tipos:

source: Note that :class:`UnixDatagramServer` derives from :class:`UDPServer`, not from :class:`UnixStreamServer` --- the only difference between an IP and a Unix server is the address family.
pt_pt: Note que :class:`UnixDatagramServer` deriva de :class:`UDPServer`, não de :class:`UnixStreamServer` --- a única diferença entre um servidor IP e um servidor Unix é a família de endereços.

source: Forking and threading versions of each type of server can be created using these mix-in classes. For instance, :class:`ThreadingUDPServer` is created as follows::
pt_pt: Versões com forking e threading de cada tipo de servidor podem ser criadas usando estas classes de mistura. Por exemplo, :class:`ThreadingUDPServer` é criado da seguinte forma:

source: The mix-in class comes first, since it overrides a method defined in :class:`UDPServer`. Setting the various attributes also changes the behavior of the underlying server mechanism.
pt_pt: A classe de mistura vem primeiro, já que substitui um método definido em :class:`UDPServer`. A definição dos vários atributos também altera o comportamento do mecanismo do servidor subjacente.

source: :class:`ForkingMixIn` and the Forking classes mentioned below are only available on POSIX platforms that support :func:`~os.fork`.
pt_pt: :class:`ForkingMixIn` e as classes de Forking mencionadas abaixo estão apenas disponíveis em plataformas POSIX que suportam :func:`~os.fork`.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` waits until all child processes complete, except if :attr:`block_on_close` attribute is ``False``.
pt_pt: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` espera até que todos os processos filhos sejam concluídos, exceto se o atributo :attr:`block_on_close` for ``False``.

source: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` waits until all non-daemon threads complete, except if :attr:`block_on_close` attribute is ``False``.
pt_pt: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` espera até que todas as threads não-daemon sejam concluídas, exceto se o atributo :attr:`block_on_close` for ``False``.

source: For :class:`ThreadingMixIn` use daemonic threads by setting :data:`ThreadingMixIn.daemon_threads <daemon_threads>` to ``True`` to not wait until threads complete.
pt_pt: Para :class:`ThreadingMixIn`, use threads daemon definindo :data:`ThreadingMixIn.daemon_threads <daemon_threads>` para ``True`` para não esperar até que as threads sejam concluídas.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` and :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` now waits until all child processes and non-daemonic threads complete. Add a new :attr:`ForkingMixIn.block_on_close <block_on_close>` class attribute to opt-in for the pre-3.7 behaviour.
pt_pt: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` e :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` agora esperam até que todos os processos filhos e threads não-daemon sejam concluídos. Adicione um novo atributo de classe :attr:`ForkingMixIn.block_on_close <block_on_close>` para optar pelo comportamento pré-3.7.

source: These classes are pre-defined using the mix-in classes.
pt_pt: Estas classes são pré-definidas usando as classes de mistura.

source: The ``ForkingUnixStreamServer`` and ``ForkingUnixDatagramServer`` classes were added.
pt_pt: As classes ``ForkingUnixStreamServer`` e ``ForkingUnixDatagramServer`` foram adicionadas.

source: To implement a service, you must derive a class from :class:`BaseRequestHandler` and redefine its :meth:`~BaseRequestHandler.handle` method. You can then run various versions of the service by combining one of the server classes with your request handler class. The request handler class must be different for datagram or stream services. This can be hidden by using the handler subclasses :class:`StreamRequestHandler` or :class:`DatagramRequestHandler`.
pt_pt: Para implementar um serviço, deve derivar uma classe de :class:`BaseRequestHandler` e redefinir o seu método :meth:`~BaseRequestHandler.handle`. Depois, pode executar várias versões do serviço combinando uma das classes de servidor com a sua classe de manipulador de pedidos. A classe de manipulador de pedidos deve ser diferente para serviços de datagrama ou de fluxo. Isto pode ser ocultado usando as subclasses de manipulador :class:`StreamRequestHandler` ou :class:`DatagramRequestHandler`.

source: Of course, you still have to use your head! For instance, it makes no sense to use a forking server if the service contains state in memory that can be modified by different requests, since the modifications in the child process would never reach the initial state kept in the parent process and passed to each child. In this case, you can use a threading server, but you will probably have to use locks to protect the integrity of the shared data.
pt_pt: Claro, ainda tem de usar a cabeça! Por exemplo, não faz sentido usar um servidor com forking se o serviço contiver estado em memória que possa ser modificado por diferentes pedidos, já que as modificações no processo filho nunca chegarão ao estado inicial mantido no processo pai e passado a cada filho. Neste caso, pode usar um servidor com threading, mas provavelmente terá de usar bloqueios para proteger a integridade dos dados partilhados.

source: On the other hand, if you are building an HTTP server where all data is stored externally (for instance, in the file system), a synchronous class will essentially render the service "deaf" while one request is being handled -- which may be for a very long time if a client is slow to receive all the data it has requested. Here a threading or forking server is appropriate.
pt_pt: Por outro lado, se estiver a construir um servidor HTTP onde todos os dados são armazenados externamente (por exemplo, no sistema de ficheiros), uma classe síncrona tornará essencialmente o serviço "surdo" enquanto um pedido está a ser processado — o que pode ser por muito tempo se um cliente for lento a receber todos os dados que solicitou. Neste caso, um servidor com threading ou forking é apropriado.

source: In some cases, it may be appropriate to process part of a request synchronously, but to finish processing in a forked child depending on the request data. This can be implemented by using a synchronous server and doing an explicit fork in the request handler class :meth:`~BaseRequestHandler.handle` method.
pt_pt: Em alguns casos, pode ser apropriado processar parte de um pedido sincronamente, mas terminar o processamento num filho com forking, dependendo dos dados do pedido. Isto pode ser implementado usando um servidor síncrono e fazendo um forking explícito no método :meth:`~BaseRequestHandler.handle` da classe de manipulador de pedidos.

source: Another approach to handling multiple simultaneous requests in an environment that supports neither threads nor :func:`~os.fork` (or where these are too expensive or inappropriate for the service) is to maintain an explicit table of partially finished requests and to use :mod:`selectors` to decide which request to work on next (or whether to handle a new incoming request). This is particularly important for stream services where each client can potentially be connected for a long time (if threads or subprocesses cannot be used).
pt_pt: Outra abordagem para lidar com vários pedidos simultâneos num ambiente que não suporta threads nem :func:`~os.fork` (ou onde estas são demasiado dispendiosas ou inadequadas para o serviço) é manter uma tabela explícita de pedidos parcialmente concluídos e usar :mod:`selectors` para decidir qual pedido trabalhar a seguir (ou se deve lidar com um novo pedido recebido). Isto é particularmente importante para serviços de fluxo onde cada cliente pode potencialmente estar ligado durante muito tempo (se threads ou subprocessos não puderem ser usados).

source: Server Objects
pt_pt: Objetos de Servidor

source: This is the superclass of all Server objects in the module. It defines the interface, given below, but does not implement most of the methods, which is done in subclasses. The two parameters are stored in the respective :attr:`server_address` and :attr:`RequestHandlerClass` attributes.
pt_pt: Esta é a superclasse de todos os objetos de Servidor no módulo. Define a interface, dada abaixo, mas não implementa a maioria dos métodos, o que é feito nas subclasses. Os dois parâmetros são armazenados nos atributos :attr:`server_address` e :attr:`RequestHandlerClass`, respetivamente.

source: Return an integer file descriptor for the socket on which the server is listening. This function is most commonly passed to :mod:`selectors`, to allow monitoring multiple servers in the same process.
pt_pt: Devolve um descritor de ficheiro inteiro para o socket no qual o servidor está à escuta. Esta função é mais comumente passada para :mod:`selectors`, para permitir monitorizar vários servidores no mesmo processo.

source: Process a single request. This function calls the following methods in order: :meth:`get_request`, :meth:`verify_request`, and :meth:`process_request`. If the user-provided :meth:`~BaseRequestHandler.handle` method of the handler class raises an exception, the server's :meth:`handle_error` method will be called. If no request is received within :attr:`timeout` seconds, :meth:`handle_timeout` will be called and :meth:`handle_request` will return.
pt_pt: Processa um único pedido. Esta função chama os seguintes métodos por ordem: :meth:`get_request`, :meth:`verify_request` e :meth:`process_request`. Se o método :meth:`~BaseRequestHandler.handle` fornecido pelo utilizador da classe de manipulador lançar uma exceção, o método :meth:`handle_error` do servidor será chamado. Se nenhum pedido for recebido dentro de :attr:`timeout` segundos, :meth:`handle_timeout` será chamado e :meth:`handle_request` retornará.

source: Handle requests until an explicit :meth:`shutdown` request. Poll for shutdown every *poll_interval* seconds. Ignores the :attr:`timeout` attribute. It also calls :meth:`service_actions`, which may be used by a subclass or mixin to provide actions specific to a given service. For example, the :class:`ForkingMixIn` class uses :meth:`service_actions` to clean up zombie child processes.
pt_pt: Lida com pedidos até que um pedido explícito de :meth:`shutdown` seja feito. Verifica o shutdown a cada *poll_interval* segundos. Ignora o atributo :attr:`timeout`. Também chama :meth:`service_actions`, que pode ser usado por uma subclasse ou mixin para fornecer ações específicas de um determinado serviço. Por exemplo, a classe :class:`ForkingMixIn` usa :meth:`service_actions` para limpar processos filhos zumbis.

source: Added ``service_actions`` call to the ``serve_forever`` method.
pt_pt: Adicionada chamada ``service_actions`` ao método ``serve_forever``.

source: This is called in the :meth:`serve_forever` loop. This method can be overridden by subclasses or mixin classes to perform actions specific to a given service, such as cleanup actions.
pt_pt: Isto é chamado no ciclo :meth:`serve_forever`. Este método pode ser substituído por subclasses ou classes de mistura para realizar ações específicas de um determinado serviço, como ações de limpeza.

source: Tell the :meth:`serve_forever` loop to stop and wait until it does. :meth:`shutdown` must be called while :meth:`serve_forever` is running in a different thread otherwise it will deadlock.
pt_pt: Diz ao ciclo :meth:`serve_forever` para parar e espera até que o faça. :meth:`shutdown` deve ser chamado enquanto :meth:`serve_forever` está a ser executado numa thread diferente, caso contrário, ocorrerá um impasse.

source: Clean up the server. May be overridden.
pt_pt: Limpa o servidor. Pode ser substituído.

source: The family of protocols to which the server's socket belongs. Common examples are :const:`socket.AF_INET`, :const:`socket.AF_INET6`, and :const:`socket.AF_UNIX`. Subclass the TCP or UDP server classes in this module with class attribute ``address_family = AF_INET6`` set if you want IPv6 server classes.
pt_pt: A família de protocolos a que o socket do servidor pertence. Exemplos comuns são :const:`socket.AF_INET`, :const:`socket.AF_INET6` e :const:`socket.AF_UNIX`. Subclasse as classes de servidor TCP ou UDP neste módulo com o atributo de classe ``address_family = AF_INET6`` definido se desejar classes de servidor IPv6.

source: The user-provided request handler class; an instance of this class is created for each request.
pt_pt: A classe de manipulador de pedidos fornecida pelo utilizador; uma instância desta classe é criada para cada pedido.

source: The address on which the server is listening. The format of addresses varies depending on the protocol family; see the documentation for the :mod:`socket` module for details. For internet protocols, this is a tuple containing a string giving the address, and an integer port number: ``('127.0.0.1', 80)``, for example.
pt_pt: O endereço no qual o servidor está à escuta. O formato dos endereços varia consoante a família de protocolos; consulte a documentação do módulo :mod:`socket` para mais detalhes. Para protocolos de Internet, isto é um tuplo que contém uma string com o endereço e um número de porta inteiro: por exemplo, ``('127.0.0.1', 80)``.

source: The socket object on which the server will listen for incoming requests.
pt_pt: O objeto socket no qual o servidor escutará por pedidos recebidos.

source: The server classes support the following class variables:
pt_pt: As classes de servidor suportam as seguintes variáveis de classe:

source: Whether the server will allow the reuse of an address. This defaults to :const:`False`, and can be set in subclasses to change the policy.
pt_pt: Se o servidor permitirá a reutilização de um endereço. O valor predefinido é :const:`False`, e pode ser definido em subclasses para alterar a política.

source: The size of the request queue. If it takes a long time to process a single request, any requests that arrive while the server is busy are placed into a queue, up to :attr:`request_queue_size` requests. Once the queue is full, further requests from clients will get a "Connection denied" error. The default value is usually 5, but this can be overridden by subclasses.
pt_pt: O tamanho da fila de pedidos. Se demorar muito tempo a processar um único pedido, quaisquer pedidos que cheguem enquanto o servidor está ocupado são colocados numa fila, até :attr:`request_queue_size` pedidos. Uma vez que a fila está cheia, pedidos adicionais dos clientes receberão um erro "Ligação recusada". O valor predefinido é normalmente 5, mas isto pode ser substituído por subclasses.

source: The type of socket used by the server; :const:`socket.SOCK_STREAM` and :const:`socket.SOCK_DGRAM` are two common values.
pt_pt: O tipo de socket usado pelo servidor; :const:`socket.SOCK_STREAM` e :const:`socket.SOCK_DGRAM` são dois valores comuns.

source: Timeout duration, measured in seconds, or :const:`None` if no timeout is desired. If :meth:`handle_request` receives no incoming requests within the timeout period, the :meth:`handle_timeout` method is called.
pt_pt: Duração do timeout, medida em segundos, ou :const:`None` se nenhum timeout for desejado. Se :meth:`handle_request` não receber pedidos recebidos dentro do período de timeout, o método :meth:`handle_timeout` é chamado.

source: There are various server methods that can be overridden by subclasses of base server classes like :class:`TCPServer`; these methods aren't useful to external users of the server object.
pt_pt: Existem vários métodos de servidor que podem ser substituídos por subclasses de classes de servidor base como :class:`TCPServer`; estes métodos não são úteis para utilizadores externos do objeto servidor.

source: Actually processes the request by instantiating :attr:`RequestHandlerClass` and calling its :meth:`~BaseRequestHandler.handle` method.
pt_pt: Processa realmente o pedido instanciando :attr:`RequestHandlerClass` e chamando o seu método :meth:`~BaseRequestHandler.handle`.

source: Must accept a request from the socket, and return a 2-tuple containing the *new* socket object to be used to communicate with the client, and the client's address.
pt_pt: Deve aceitar um pedido do socket e devolver um tuplo de 2 elementos contendo o objeto socket *novo* a ser usado para comunicar com o cliente e o endereço do cliente.

source: This function is called if the :meth:`~BaseRequestHandler.handle` method of a :attr:`RequestHandlerClass` instance raises an exception. The default action is to print the traceback to standard error and continue handling further requests.
pt_pt: Esta função é chamada se o método :meth:`~BaseRequestHandler.handle` de uma instância :attr:`RequestHandlerClass` lançar uma exceção. A ação predefinida é imprimir o traceback para o erro padrão e continuar a lidar com pedidos adicionais.

source: Now only called for exceptions derived from the :exc:`Exception` class.
pt_pt: Apenas chamado agora para exceções derivadas da classe :exc:`Exception`.
