Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/socketserver.po
Languages: pt_pt

source: This function is called when the :attr:`timeout` attribute has been set to a value other than :const:`None` and the timeout period has passed with no requests being received. The default action for forking servers is to collect the status of any child processes that have exited, while in threading servers this method does nothing.
pt_pt: Esta função é chamada quando o atributo :attr:`timeout` foi definido para um valor diferente de :const:`None` e o período de timeout passou sem que qualquer pedido tenha sido recebido. A ação predefinida para servidores com forking é recolher o estado de quaisquer processos filhos que tenham terminado, enquanto que em servidores com threading esta função não faz nada.

source: Calls :meth:`finish_request` to create an instance of the :attr:`RequestHandlerClass`. If desired, this function can create a new process or thread to handle the request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` classes do this.
pt_pt: Chama :meth:`finish_request` para criar uma instância de :attr:`RequestHandlerClass`. Se desejado, esta função pode criar um novo processo ou thread para lidar com o pedido; as classes :class:`ForkingMixIn` e :class:`ThreadingMixIn` fazem isto.

source: Called by the server's constructor to activate the server. The default behavior for a TCP server just invokes :meth:`~socket.socket.listen` on the server's socket. May be overridden.
pt_pt: Chamado pelo construtor do servidor para ativar o servidor. O comportamento predefinido para um servidor TCP apenas invoca :meth:`~socket.socket.listen` no socket do servidor. Pode ser substituído.

source: Called by the server's constructor to bind the socket to the desired address. May be overridden.
pt_pt: Chamado pelo construtor do servidor para ligar o socket ao endereço desejado. Pode ser substituído.

source: Must return a Boolean value; if the value is :const:`True`, the request will be processed, and if it's :const:`False`, the request will be denied. This function can be overridden to implement access controls for a server. The default implementation always returns :const:`True`.
pt_pt: Deve devolver um valor booleano; se o valor for :const:`True`, o pedido será processado, e se for :const:`False`, o pedido será recusado. Esta função pode ser substituída para implementar controlo de acesso para um servidor. A implementação predefinida devolve sempre :const:`True`.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`server_close`.
pt_pt: Foi adicionado suporte para o protocolo :term:`gestor de contexto`. Sair do gestor de contexto é equivalente a chamar :meth:`server_close`.

source: Request Handler Objects
pt_pt: Objetos de Manipulador de Pedidos

source: This is the superclass of all request handler objects. It defines the interface, given below. A concrete request handler subclass must define a new :meth:`handle` method, and can override any of the other methods. A new instance of the subclass is created for each request.
pt_pt: Esta é a superclasse de todos os objetos de manipulador de pedidos. Define a interface, dada abaixo. Uma subclasse concreta de manipulador de pedidos deve definir um novo método :meth:`handle` e pode substituir qualquer um dos outros métodos. Uma nova instância da subclasse é criada para cada pedido.

source: Called before the :meth:`handle` method to perform any initialization actions required. The default implementation does nothing.
pt_pt: Chamado antes do método :meth:`handle` para realizar quaisquer ações de inicialização necessárias. A implementação predefinida não faz nada.

source: This function must do all the work required to service a request. The default implementation does nothing. Several instance attributes are available to it; the request is available as :attr:`request`; the client address as :attr:`client_address`; and the server instance as :attr:`server`, in case it needs access to per-server information.
pt_pt: Esta função deve fazer todo o trabalho necessário para servir um pedido. A implementação predefinida não faz nada. Vários atributos de instância estão disponíveis para ela; o pedido está disponível como :attr:`request`; o endereço do cliente como :attr:`client_address`; e a instância do servidor como :attr:`server`, caso precise de aceder a informações por servidor.

source: The type of :attr:`request` is different for datagram or stream services. For stream services, :attr:`request` is a socket object; for datagram services, :attr:`request` is a pair of string and socket.
pt_pt: O tipo de :attr:`request` é diferente para serviços de datagrama ou de fluxo. Para serviços de fluxo, :attr:`request` é um objeto socket; para serviços de datagrama, :attr:`request` é um par de string e socket.

source: Called after the :meth:`handle` method to perform any clean-up actions required. The default implementation does nothing. If :meth:`setup` raises an exception, this function will not be called.
pt_pt: Chamado após o método :meth:`handle` para realizar quaisquer ações de limpeza necessárias. A implementação predefinida não faz nada. Se :meth:`setup` lançar uma exceção, esta função não será chamada.

source: The *new* :class:`socket.socket` object to be used to communicate with the client.
pt_pt: O objeto *novo* :class:`socket.socket` a ser usado para comunicar com o cliente.

source: Client address returned by :meth:`BaseServer.get_request`.
pt_pt: Endereço do cliente devolvido por :meth:`BaseServer.get_request`.

source: :class:`BaseServer` object used for handling the request.
pt_pt: Objeto :class:`BaseServer` usado para lidar com o pedido.

source: These :class:`BaseRequestHandler` subclasses override the :meth:`~BaseRequestHandler.setup` and :meth:`~BaseRequestHandler.finish` methods, and provide :attr:`rfile` and :attr:`wfile` attributes.
pt_pt: Estas subclasses de :class:`BaseRequestHandler` substituem os métodos :meth:`~BaseRequestHandler.setup` e :meth:`~BaseRequestHandler.finish`, e fornecem os atributos :attr:`rfile` e :attr:`wfile`.

source: A file object from which receives the request is read. Support the :class:`io.BufferedIOBase` readable interface.
pt_pt: Um objeto de ficheiro a partir do qual o pedido recebido é lido. Suporta a interface legível :class:`io.BufferedIOBase`.

source: A file object to which the reply is written. Support the :class:`io.BufferedIOBase` writable interface
pt_pt: Um objeto de ficheiro para o qual a resposta é escrita. Suporta a interface gravável :class:`io.BufferedIOBase`.

source: :attr:`wfile` also supports the :class:`io.BufferedIOBase` writable interface.
pt_pt: :attr:`wfile` também suporta a interface gravável :class:`io.BufferedIOBase`.

source: Examples
pt_pt: Exemplos

source: :class:`socketserver.TCPServer` Example
pt_pt: Exemplo de :class:`socketserver.TCPServer`

source: This is the server side::
pt_pt: Este é o lado do servidor:

source: import socketserver class MyTCPHandler(socketserver.BaseRequestHandler): """ The request handler class for our server. It is instantiated once per connection to the server, and must override the handle() method to implement communication to the client. """ def handle(self): # self.request is the TCP socket connected to the client pieces = [b''] total = 0 while b'\n' not in pieces[-1] and total < 10_000: pieces.append(self.request.recv(2000)) total += len(pieces[-1]) self.data = b''.join(pieces) print(f"Received from {self.client_address[0]}:") print(self.data.decode("utf-8")) # just send back the same data, but upper-cased self.request.sendall(self.data.upper()) # after we return, the socket will be closed. if __name__ == "__main__": HOST, PORT = "localhost", 9999 # Create the server, binding to localhost on port 9999 with socketserver.TCPServer((HOST, PORT), MyTCPHandler) as server: # Activate the server; this will keep running until you # interrupt the program with Ctrl-C server.serve_forever()
pt_pt: import socketserver class MyTCPHandler(socketserver.BaseRequestHandler): """ A classe de manipulador de pedidos para o nosso servidor. É instanciada uma vez por ligação ao servidor, e deve substituir o método handle() para implementar a comunicação com o cliente. """ def handle(self): # self.request é o socket TCP ligado ao cliente pieces = [b''] total = 0 while b'\n' not in pieces[-1] and total < 10_000: pieces.append(self.request.recv(2000)) total += len(pieces[-1]) self.data = b''.join(pieces) print(f"Recebido de {self.client_address[0]}:") print(self.data.decode("utf-8")) # apenas envia de volta os mesmos dados, mas em maiúsculas self.request.sendall(self.data.upper()) # depois de retornarmos, o socket será fechado. if __name__ == "__main__": HOST, PORT = "localhost", 9999 # Cria o servidor, ligando ao localhost na porta 9999 with socketserver.TCPServer((HOST, PORT), MyTCPHandler) as server: # Ativa o servidor; isto continuará a correr até que # interrompa o programa com Ctrl-C server.serve_forever()

source: An alternative request handler class that makes use of streams (file-like objects that simplify communication by providing the standard file interface)::
pt_pt: Uma classe de manipulador de pedidos alternativa que faz uso de fluxos (objetos semelhantes a ficheiros que simplificam a comunicação fornecendo a interface de ficheiro padrão):

source: class MyTCPHandler(socketserver.StreamRequestHandler): def handle(self): # self.rfile is a file-like object created by the handler. # We can now use e.g. readline() instead of raw recv() calls. # We limit ourselves to 10000 bytes to avoid abuse by the sender. self.data = self.rfile.readline(10000).rstrip() print(f"{self.client_address[0]} wrote:") print(self.data.decode("utf-8")) # Likewise, self.wfile is a file-like object used to write back # to the client self.wfile.write(self.data.upper())
pt_pt: class MyTCPHandler(socketserver.StreamRequestHandler): def handle(self): # self.rfile é um objeto semelhante a um ficheiro criado pelo manipulador. # Podemos agora usar, por exemplo, readline() em vez de chamadas recv() brutas. # Limitamo-nos a 10000 bytes para evitar abusos por parte do remetente. self.data = self.rfile.readline(10000).rstrip() print(f"{self.client_address[0]} escreveu:") print(self.data.decode("utf-8")) # Da mesma forma, self.wfile é um objeto semelhante a um ficheiro usado para escrever de volta # para o cliente self.wfile.write(self.data.upper())

source: This is the client side::
pt_pt: Este é o lado do cliente:

source: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # Create a socket (SOCK_STREAM means a TCP socket) with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: # Connect to server and send data sock.connect((HOST, PORT)) sock.sendall(bytes(data, "utf-8")) sock.sendall(b"\n") # Receive data from the server and shut down received = str(sock.recv(1024), "utf-8") print("Sent: ", data) print("Received:", received)
pt_pt: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # Cria um socket (SOCK_STREAM significa um socket TCP) with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: # Liga ao servidor e envia dados sock.connect((HOST, PORT)) sock.sendall(bytes(data, "utf-8")) sock.sendall(b"\n") # Recebe dados do servidor e termina received = str(sock.recv(1024), "utf-8") print("Enviado: ", data) print("Recebido:", received)

source: The output of the example should look something like this:
pt_pt: A saída do exemplo deve ser algo como isto:

source: Server:
pt_pt: Servidor:

source: $ python TCPServer.py 127.0.0.1 wrote: b'hello world with TCP' 127.0.0.1 wrote: b'python is nice'
pt_pt: $ python TCPServer.py 127.0.0.1 escreveu: b'hello world with TCP' 127.0.0.1 escreveu: b'python is nice'

source: Client:
pt_pt: Cliente:

source: $ python TCPClient.py hello world with TCP Sent: hello world with TCP Received: HELLO WORLD WITH TCP $ python TCPClient.py python is nice Sent: python is nice Received: PYTHON IS NICE
pt_pt: $ python TCPClient.py hello world with TCP Enviado: hello world with TCP Recebido: HELLO WORLD WITH TCP $ python TCPClient.py python is nice Enviado: python is nice Recebido: PYTHON IS NICE

source: :class:`socketserver.UDPServer` Example
pt_pt: Exemplo de :class:`socketserver.UDPServer`

source: import socketserver class MyUDPHandler(socketserver.BaseRequestHandler): """ This class works similar to the TCP handler class, except that self.request consists of a pair of data and client socket, and since there is no connection the client address must be given explicitly when sending data back via sendto(). """ def handle(self): data = self.request[0].strip() socket = self.request[1] print(f"{self.client_address[0]} wrote:") print(data) socket.sendto(data.upper(), self.client_address) if __name__ == "__main__": HOST, PORT = "localhost", 9999 with socketserver.UDPServer((HOST, PORT), MyUDPHandler) as server: server.serve_forever()
pt_pt: import socketserver class MyUDPHandler(socketserver.BaseRequestHandler): """ Esta classe funciona de forma semelhante à classe de manipulador TCP, exceto que self.request consiste num par de dados e socket do cliente, e uma vez que não há ligação, o endereço do cliente deve ser dado explicitamente ao enviar dados de volta via sendto(). """ def handle(self): data = self.request[0].strip() socket = self.request[1] print(f"{self.client_address[0]} escreveu:") print(data) socket.sendto(data.upper(), self.client_address) if __name__ == "__main__": HOST, PORT = "localhost", 9999 with socketserver.UDPServer((HOST, PORT), MyUDPHandler) as server: server.serve_forever()

source: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # SOCK_DGRAM is the socket type to use for UDP sockets sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM) # As you can see, there is no connect() call; UDP has no connections. # Instead, data is directly sent to the recipient via sendto(). sock.sendto(bytes(data + "\n", "utf-8"), (HOST, PORT)) received = str(sock.recv(1024), "utf-8") print("Sent: ", data) print("Received:", received)
pt_pt: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # SOCK_DGRAM é o tipo de socket a usar para sockets UDP sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM) # Como pode ver, não há chamada connect(); UDP não tem ligações. # Em vez disso, os dados são enviados diretamente para o destinatário via sendto(). sock.sendto(bytes(data + "\n", "utf-8"), (HOST, PORT)) received = str(sock.recv(1024), "utf-8") print("Enviado: ", data) print("Recebido:", received)

source: The output of the example should look exactly like for the TCP server example.
pt_pt: A saída do exemplo deve ser exatamente como no exemplo do servidor TCP.

source: Asynchronous Mixins
pt_pt: Mixins Assíncronos

source: To build asynchronous handlers, use the :class:`ThreadingMixIn` and :class:`ForkingMixIn` classes.
pt_pt: Para construir manipuladores assíncronos, use as classes :class:`ThreadingMixIn` e :class:`ForkingMixIn`.

source: An example for the :class:`ThreadingMixIn` class::
pt_pt: Um exemplo para a classe :class:`ThreadingMixIn`:

source: import socket import threading import socketserver class ThreadedTCPRequestHandler(socketserver.BaseRequestHandler): def handle(self): data = str(self.request.recv(1024), 'ascii') cur_thread = threading.current_thread() response = bytes("{}: {}".format(cur_thread.name, data), 'ascii') self.request.sendall(response) class ThreadedTCPServer(socketserver.ThreadingMixIn, socketserver.TCPServer): pass def client(ip, port, message): with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: sock.connect((ip, port)) sock.sendall(bytes(message, 'ascii')) response = str(sock.recv(1024), 'ascii') print("Received: {}".format(response)) if __name__ == "__main__": # Port 0 means to select an arbitrary unused port HOST, PORT = "localhost", 0 server = ThreadedTCPServer((HOST, PORT), ThreadedTCPRequestHandler) with server: ip, port = server.server_address # Start a thread with the server -- that thread will then start one # more thread for each request server_thread = threading.Thread(target=server.serve_forever) # Exit the server thread when the main thread terminates server_thread.daemon = True server_thread.start() print("Server loop running in thread:", server_thread.name) client(ip, port, "Hello World 1") client(ip, port, "Hello World 2") client(ip, port, "Hello World 3") server.shutdown()
pt_pt: import socket import threading import socketserver class ThreadedTCPRequestHandler(socketserver.BaseRequestHandler): def handle(self): data = str(self.request.recv(1024), 'ascii') cur_thread = threading.current_thread() response = bytes("{}: {}".format(cur_thread.name, data), 'ascii') self.request.sendall(response) class ThreadedTCPServer(socketserver.ThreadingMixIn, socketserver.TCPServer): pass def client(ip, port, message): with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: sock.connect((ip, port)) sock.sendall(bytes(message, 'ascii')) response = str(sock.recv(1024), 'ascii') print("Recebido: {}".format(response)) if __name__ == "__main__": # Porta 0 significa selecionar uma porta não utilizada arbitrária HOST, PORT = "localhost", 0 server = ThreadedTCPServer((HOST, PORT), ThreadedTCPRequestHandler) with server: ip, port = server.server_address # Inicia uma thread com o servidor -- essa thread iniciará então mais uma # thread para cada pedido server_thread = threading.Thread(target=server.serve_forever) # Termina a thread do servidor quando a thread principal termina server_thread.daemon = True server_thread.start() print("Ciclo do servidor a correr na thread:", server_thread.name) client(ip, port, "Hello World 1") client(ip, port, "Hello World 2") client(ip, port, "Hello World 3") server.shutdown()

source: $ python ThreadedTCPServer.py Server loop running in thread: Thread-1 Received: Thread-2: Hello World 1 Received: Thread-3: Hello World 2 Received: Thread-4: Hello World 3
pt_pt: $ python ThreadedTCPServer.py Ciclo do servidor a correr na thread: Thread-1 Recebido: Thread-2: Hello World 1 Recebido: Thread-3: Hello World 2 Recebido: Thread-4: Hello World 3

source: The :class:`ForkingMixIn` class is used in the same way, except that the server will spawn a new process for each request. Available only on POSIX platforms that support :func:`~os.fork`.
pt_pt: A classe :class:`ForkingMixIn` é usada da mesma forma, exceto que o servidor criará um novo processo para cada pedido. Disponível apenas em plataformas POSIX que suportam :func:`~os.fork`.
