Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sqlite3.po
Languages: pt_pt

source: The default "timestamp" converter ignores UTC offsets in the database and always returns a naive :class:`datetime.datetime` object. To preserve UTC offsets in timestamps, either leave converters disabled, or register an offset-aware converter with :func:`register_converter`.
pt_pt: O conversor "timestamp" predefinido ignora os deslocamentos UTC na base de dados e sempre devolve um objeto :class:`datetime.datetime` ingénuo. Para preservar os deslocamentos UTC nos timestamps, ou deixe os conversores desativados, ou registe um conversor consciente de deslocamento com :func:`register_converter`.

source: Command-line interface
pt_pt: Interface de linha de comandos

source: The :mod:`!sqlite3` module can be invoked as a script, using the interpreter's :option:`-m` switch, in order to provide a simple SQLite shell. The argument signature is as follows::
pt_pt: O módulo :mod:`!sqlite3` pode ser invocado como um script, usando a opção :option:`-m` do interpretador, para fornecer uma shell SQLite simples. A assinatura do argumento é a seguinte::

source: python -m sqlite3 [-h] [-v] [filename] [sql]
pt_pt: python -m sqlite3 [-h] [-v] [nome_do_ficheiro] [sql]

source: Type ``.quit`` or CTRL-D to exit the shell.
pt_pt: Escreva ``.quit`` ou CTRL-D para sair da shell.

source: Print CLI help.
pt_pt: Mostra ajuda da CLI.

source: Print underlying SQLite library version.
pt_pt: Mostra a versão da biblioteca SQLite subjacente.

source: How-to guides
pt_pt: Guias práticos

source: How to use placeholders to bind values in SQL queries
pt_pt: Como usar placeholders para ligar valores em consultas SQL

source: SQL operations usually need to use values from Python variables. However, beware of using Python's string operations to assemble queries, as they are vulnerable to `SQL injection attacks`_. For example, an attacker can simply close the single quote and inject ``OR TRUE`` to select all rows::
pt_pt: As operações SQL geralmente precisam de usar valores de variáveis Python. No entanto, tenha cuidado ao usar operações de strings do Python para montar consultas, pois são vulneráveis a `ataques de injeção SQL`_. Por exemplo, um atacante pode simplesmente fechar a aspa simples e injetar ``OR TRUE`` para selecionar todas as linhas::

source: >>> # Never do this -- insecure! >>> symbol = input() ' OR TRUE; -- >>> sql = "SELECT * FROM stocks WHERE symbol = '%s'" % symbol >>> print(sql) SELECT * FROM stocks WHERE symbol = '' OR TRUE; --' >>> cur.execute(sql)
pt_pt: >>> # Nunca faça isto -- inseguro! >>> simbolo = input() ' OR TRUE; -- >>> sql = "SELECT * FROM acoes WHERE simbolo = '%s'" % simbolo >>> print(sql) SELECT * FROM acoes WHERE simbolo = '' OR TRUE; --' >>> cur.execute(sql)

source: Instead, use the DB-API's parameter substitution. To insert a variable into a query string, use a placeholder in the string, and substitute the actual values into the query by providing them as a :class:`tuple` of values to the second argument of the cursor's :meth:`~Cursor.execute` method.
pt_pt: Em vez disso, use a substituição de parâmetros da DB-API. Para inserir uma variável numa string de consulta, use um placeholder na string e substitua os valores reais na consulta fornecendo-os como um :class:`tuple` de valores para o segundo argumento do método :meth:`~Cursor.execute` do cursor.

source: An SQL statement may use one of two kinds of placeholders: question marks (qmark style) or named placeholders (named style). For the qmark style, *parameters* must be a :term:`sequence` whose length must match the number of placeholders, or a :exc:`ProgrammingError` is raised. For the named style, *parameters* must be an instance of a :class:`dict` (or a subclass), which must contain keys for all named parameters; any extra items are ignored. Here's an example of both styles:
pt_pt: Uma declaração SQL pode usar um de dois tipos de placeholders: pontos de interrogação (estilo qmark) ou placeholders nomeados (estilo nomeado). Para o estilo qmark, *parameters* deve ser uma :term:`sequência` cujo comprimento deve corresponder ao número de placeholders, ou um :exc:`ProgrammingError` é lançado. Para o estilo nomeado, *parameters* deve ser uma instância de um :class:`dict` (ou uma subclasse), que deve conter chaves para todos os parâmetros nomeados; quaisquer itens extra são ignorados. Aqui está um exemplo de ambos os estilos:

source: con = sqlite3.connect(":memory:") cur = con.execute("CREATE TABLE lang(name, first_appeared)") # This is the named style used with executemany(): data = ( {"name": "C", "year": 1972}, {"name": "Fortran", "year": 1957}, {"name": "Python", "year": 1991}, {"name": "Go", "year": 2009}, ) cur.executemany("INSERT INTO lang VALUES(:name, :year)", data) # This is the qmark style used in a SELECT query: params = (1972,) cur.execute("SELECT * FROM lang WHERE first_appeared = ?", params) print(cur.fetchall()) con.close()
pt_pt: con = sqlite3.connect(":memory:") cur = con.execute("CREATE TABLE lingua(nome, primeira_aparicao)") # Este é o estilo nomeado usado com executemany(): data = ( {"nome": "C", "ano": 1972}, {"nome": "Fortran", "ano": 1957}, {"nome": "Python", "ano": 1991}, {"nome": "Go", "ano": 2009}, ) cur.executemany("INSERT INTO lingua VALUES(:nome, :ano)", data) # Este é o estilo qmark usado numa consulta SELECT: params = (1972,) cur.execute("SELECT * FROM lingua WHERE primeira_aparicao = ?", params) print(cur.fetchall()) con.close()

source: :pep:`249` numeric placeholders are *not* supported. If used, they will be interpreted as named placeholders.
pt_pt: Os placeholders numéricos :pep:`249` *não* são suportados. Se usados, serão interpretados como placeholders nomeados.

source: How to adapt custom Python types to SQLite values
pt_pt: Como adaptar tipos Python personalizados para valores SQLite

source: SQLite supports only a limited set of data types natively. To store custom Python types in SQLite databases, *adapt* them to one of the :ref:`Python types SQLite natively understands <sqlite3-types>`.
pt_pt: O SQLite suporta apenas um conjunto limitado de tipos de dados nativamente. Para armazenar tipos Python personalizados em bases de dados SQLite, *adapte*-os para um dos :ref:`tipos Python que o SQLite entende nativamente <sqlite3-types>`.

source: There are two ways to adapt Python objects to SQLite types: letting your object adapt itself, or using an *adapter callable*. The latter will take precedence above the former. For a library that exports a custom type, it may make sense to enable that type to adapt itself. As an application developer, it may make more sense to take direct control by registering custom adapter functions.
pt_pt: Existem duas formas de adaptar objetos Python para tipos SQLite: deixar que o seu objeto se adapte a si mesmo ou usar um *adaptador chamável*. Este último terá precedência sobre o primeiro. Para uma biblioteca que exporta um tipo personalizado, pode fazer sentido permitir que esse tipo se adapte a si mesmo. Como desenvolvedor de aplicações, pode fazer mais sentido tomar o controlo direto registando funções de adaptador personalizadas.

source: How to write adaptable objects
pt_pt: Como escrever objetos adaptáveis

source: Suppose we have a :class:`!Point` class that represents a pair of coordinates, ``x`` and ``y``, in a Cartesian coordinate system. The coordinate pair will be stored as a text string in the database, using a semicolon to separate the coordinates. This can be implemented by adding a ``__conform__(self, protocol)`` method which returns the adapted value. The object passed to *protocol* will be of type :class:`PrepareProtocol`.
pt_pt: Suponhamos que temos uma classe :class:`!Point` que representa um par de coordenadas, ``x`` e ``y``, num sistema de coordenadas cartesianas. O par de coordenadas será armazenado como uma string de texto na base de dados, usando um ponto e vírgula para separar as coordenadas. Isto pode ser implementado adicionando um método ``__conform__(self, protocol)`` que devolve o valor adaptado. O objeto passado para *protocol* será do tipo :class:`PrepareProtocol`.

source: class Point: def __init__(self, x, y): self.x, self.y = x, y def __conform__(self, protocol): if protocol is sqlite3.PrepareProtocol: return f"{self.x};{self.y}" con = sqlite3.connect(":memory:") cur = con.cursor() cur.execute("SELECT ?", (Point(4.0, -3.2),)) print(cur.fetchone()[0]) con.close()
pt_pt: class Ponto: def __init__(self, x, y): self.x, self.y = x, y def __conform__(self, protocol): if protocol is sqlite3.PrepareProtocol: return f"{self.x};{self.y}" con = sqlite3.connect(":memory:") cur = con.cursor() cur.execute("SELECT ?", (Ponto(4.0, -3.2),)) print(cur.fetchone()[0]) con.close()

source: How to register adapter callables
pt_pt: Como registar adaptadores chamáveis

source: The other possibility is to create a function that converts the Python object to an SQLite-compatible type. This function can then be registered using :func:`register_adapter`.
pt_pt: A outra possibilidade é criar uma função que converte o objeto Python para um tipo compatível com SQLite. Esta função pode então ser registada usando :func:`register_adapter`.

source: class Point: def __init__(self, x, y): self.x, self.y = x, y def adapt_point(point): return f"{point.x};{point.y}" sqlite3.register_adapter(Point, adapt_point) con = sqlite3.connect(":memory:") cur = con.cursor() cur.execute("SELECT ?", (Point(1.0, 2.5),)) print(cur.fetchone()[0]) con.close()
pt_pt: class Ponto: def __init__(self, x, y): self.x, self.y = x, y def adaptar_ponto(ponto): return f"{ponto.x};{ponto.y}" sqlite3.register_adapter(Ponto, adaptar_ponto) con = sqlite3.connect(":memory:") cur = con.cursor() cur.execute("SELECT ?", (Ponto(1.0, 2.5),)) print(cur.fetchone()[0]) con.close()

source: How to convert SQLite values to custom Python types
pt_pt: Como converter valores SQLite para tipos Python personalizados

source: Writing an adapter lets you convert *from* custom Python types *to* SQLite values. To be able to convert *from* SQLite values *to* custom Python types, we use *converters*.
pt_pt: Escrever um adaptador permite-lhe converter *de* tipos Python personalizados *para* valores SQLite. Para poder converter *de* valores SQLite *para* tipos Python personalizados, usamos *conversores*.

source: Let's go back to the :class:`!Point` class. We stored the x and y coordinates separated via semicolons as strings in SQLite.
pt_pt: Vamos voltar à classe :class:`!Point`. Armazenámos as coordenadas x e y separadas por ponto e vírgula como strings no SQLite.

source: First, we'll define a converter function that accepts the string as a parameter and constructs a :class:`!Point` object from it.
pt_pt: Primeiro, vamos definir uma função conversora que aceita a string como parâmetro e constrói um objeto :class:`!Point` a partir dela.

source: Converter functions are **always** passed a :class:`bytes` object, no matter the underlying SQLite data type.
pt_pt: As funções conversoras recebem **sempre** um objeto :class:`bytes`, independentemente do tipo de dados SQLite subjacente.

source: def convert_point(s): x, y = map(float, s.split(b";")) return Point(x, y)
pt_pt: def converter_ponto(s): x, y = map(float, s.split(b";")) return Ponto(x, y)

source: We now need to tell :mod:`!sqlite3` when it should convert a given SQLite value. This is done when connecting to a database, using the *detect_types* parameter of :func:`connect`. There are three options:
pt_pt: Agora precisamos de dizer ao :mod:`!sqlite3` quando deve converter um dado valor SQLite. Isto é feito ao ligar a uma base de dados, usando o parâmetro *detect_types* de :func:`connect`. Existem três opções:

source: Implicit: set *detect_types* to :const:`PARSE_DECLTYPES`
pt_pt: Implícito: defina *detect_types* para :const:`PARSE_DECLTYPES`

source: Explicit: set *detect_types* to :const:`PARSE_COLNAMES`
pt_pt: Explícito: defina *detect_types* para :const:`PARSE_COLNAMES`

source: Both: set *detect_types* to ``sqlite3.PARSE_DECLTYPES | sqlite3.PARSE_COLNAMES``. Column names take precedence over declared types.
pt_pt: Ambos: defina *detect_types* para ``sqlite3.PARSE_DECLTYPES | sqlite3.PARSE_COLNAMES``. Os nomes das colunas têm precedência sobre os tipos declarados.

source: The following example illustrates the implicit and explicit approaches:
pt_pt: O exemplo seguinte ilustra as abordagens implícita e explícita:

source: class Point: def __init__(self, x, y): self.x, self.y = x, y def __repr__(self): return f"Point({self.x}, {self.y})" def adapt_point(point): return f"{point.x};{point.y}" def convert_point(s): x, y = list(map(float, s.split(b";"))) return Point(x, y) # Register the adapter and converter sqlite3.register_adapter(Point, adapt_point) sqlite3.register_converter("point", convert_point) # 1) Parse using declared types p = Point(4.0, -3.2) con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_DECLTYPES) cur = con.execute("CREATE TABLE test(p point)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute("SELECT p FROM test") print("with declared types:", cur.fetchone()[0]) cur.close() con.close() # 2) Parse using column names con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_COLNAMES) cur = con.execute("CREATE TABLE test(p)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute('SELECT p AS "p [point]" FROM test') print("with column names:", cur.fetchone()[0]) cur.close() con.close()
pt_pt: class Ponto: def __init__(self, x, y): self.x, self.y = x, y def __repr__(self): return f"Ponto({self.x}, {self.y})" def adaptar_ponto(ponto): return f"{ponto.x};{ponto.y}" def converter_ponto(s): x, y = list(map(float, s.split(b";"))) return Ponto(x, y) # Registar o adaptador e o conversor sqlite3.register_adapter(Ponto, adaptar_ponto) sqlite3.register_converter("ponto", converter_ponto) # 1) Analisar usando tipos declarados p = Ponto(4.0, -3.2) con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_DECLTYPES) cur = con.execute("CREATE TABLE test(p ponto)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute("SELECT p FROM test") print("com tipos declarados:", cur.fetchone()[0]) cur.close() con.close() # 2) Analisar usando nomes de colunas con = sqlite3.connect(":memory:", detect_types=sqlite3.PARSE_COLNAMES) cur = con.execute("CREATE TABLE test(p)") cur.execute("INSERT INTO test(p) VALUES(?)", (p,)) cur.execute('SELECT p AS "p [ponto]" FROM test') print("com nomes de colunas:", cur.fetchone()[0]) cur.close() con.close()

source: Adapter and converter recipes
pt_pt: Receitas de adaptadores e conversores

source: This section shows recipes for common adapters and converters.
pt_pt: Esta secção mostra receitas para adaptadores e conversores comuns.

source: How to use connection shortcut methods
pt_pt: Como usar métodos de atalho de ligação

source: Using the :meth:`~Connection.execute`, :meth:`~Connection.executemany`, and :meth:`~Connection.executescript` methods of the :class:`Connection` class, your code can be written more concisely because you don't have to create the (often superfluous) :class:`Cursor` objects explicitly. Instead, the :class:`Cursor` objects are created implicitly and these shortcut methods return the cursor objects. This way, you can execute a ``SELECT`` statement and iterate over it directly using only a single call on the :class:`Connection` object.
pt_pt: Usando os métodos :meth:`~Connection.execute`, :meth:`~Connection.executemany` e :meth:`~Connection.executescript` da classe :class:`Connection`, o seu código pode ser escrito de forma mais concisa porque não precisa de criar explicitamente os objetos :class:`Cursor` (muitas vezes supérfluos). Em vez disso, os objetos :class:`Cursor` são criados implicitamente e estes métodos de atalho devolvem os objetos cursor. Desta forma, pode executar uma declaração ``SELECT`` e iterar sobre ela diretamente usando apenas uma única chamada no objeto :class:`Connection`.

source: # Create and fill the table. con = sqlite3.connect(":memory:") con.execute("CREATE TABLE lang(name, first_appeared)") data = [ ("C++", 1985), ("Objective-C", 1984), ] con.executemany("INSERT INTO lang(name, first_appeared) VALUES(?, ?)", data) # Print the table contents for row in con.execute("SELECT name, first_appeared FROM lang"): print(row) print("I just deleted", con.execute("DELETE FROM lang").rowcount, "rows") # close() is not a shortcut method and it's not called automatically; # the connection object should be closed manually con.close()
pt_pt: # Criar e preencher a tabela. con = sqlite3.connect(":memory:") con.execute("CREATE TABLE lingua(nome, primeira_aparicao)") data = [ ("C++", 1985), ("Objective-C", 1984), ] con.executemany("INSERT INTO lingua(nome, primeira_aparicao) VALUES(?, ?)", data) # Imprimir o conteúdo da tabela for row in con.execute("SELECT nome, primeira_aparicao FROM lingua"): print(row) print("Acabei de apagar", con.execute("DELETE FROM lingua").rowcount, "linhas") # close() não é um método de atalho e não é chamado automaticamente; # o objeto de ligação deve ser fechado manualmente con.close()

source: How to use the connection context manager
pt_pt: Como usar o gestor de contexto de ligação

source: A :class:`Connection` object can be used as a context manager that automatically commits or rolls back open transactions when leaving the body of the context manager. If the body of the :keyword:`with` statement finishes without exceptions, the transaction is committed. If this commit fails, or if the body of the ``with`` statement raises an uncaught exception, the transaction is rolled back. If :attr:`~Connection.autocommit` is ``False``, a new transaction is implicitly opened after committing or rolling back.
pt_pt: Um objeto :class:`Connection` pode ser usado como um gestor de contexto que confirma ou reverte automaticamente transações abertas ao sair do corpo do gestor de contexto. Se o corpo da declaração :keyword:`with` terminar sem exceções, a transação é confirmada. Se esta confirmação falhar, ou se o corpo da declaração ``with`` lançar uma exceção não capturada, a transação é revertida. Se :attr:`~Connection.autocommit` for ``False``, uma nova transação é implicitamente aberta após confirmar ou reverter.

source: If there is no open transaction upon leaving the body of the ``with`` statement, or if :attr:`~Connection.autocommit` is ``True``, the context manager does nothing.
pt_pt: Se não houver nenhuma transação aberta ao sair do corpo da declaração ``with``, ou se :attr:`~Connection.autocommit` for ``True``, o gestor de contexto não faz nada.

source: The context manager neither implicitly opens a new transaction nor closes the connection. If you need a closing context manager, consider using :meth:`contextlib.closing`.
pt_pt: O gestor de contexto não abre implicitamente uma nova transação nem fecha a ligação. Se precisar de um gestor de contexto que feche, considere usar :meth:`contextlib.closing`.

source: con = sqlite3.connect(":memory:") con.execute("CREATE TABLE lang(id INTEGER PRIMARY KEY, name VARCHAR UNIQUE)") # Successful, con.commit() is called automatically afterwards with con: con.execute("INSERT INTO lang(name) VALUES(?)", ("Python",)) # con.rollback() is called after the with block finishes with an exception, # the exception is still raised and must be caught try: with con: con.execute("INSERT INTO lang(name) VALUES(?)", ("Python",)) except sqlite3.IntegrityError: print("couldn't add Python twice") # Connection object used as context manager only commits or rollbacks transactions, # so the connection object should be closed manually con.close()
pt_pt: con = sqlite3.connect(":memory:") con.execute("CREATE TABLE lingua(id INTEGER PRIMARY KEY, nome VARCHAR UNIQUE)") # Bem-sucedido, con.commit() é chamado automaticamente depois with con: con.execute("INSERT INTO lingua(nome) VALUES(?)", ("Python",)) # con.rollback() é chamado depois do bloco with terminar com uma exceção, # a exceção ainda é lançada e deve ser capturada try: with con: con.execute("INSERT INTO lingua(nome) VALUES(?)", ("Python",)) except sqlite3.IntegrityError: print("não foi possível adicionar Python duas vezes") # O objeto de ligação usado como gestor de contexto apenas confirma ou reverte transações, # por isso o objeto de ligação deve ser fechado manualmente con.close()

source: How to work with SQLite URIs
pt_pt: Como trabalhar com URIs do SQLite

source: Some useful URI tricks include:
pt_pt: Alguns truques úteis de URI incluem:

source: Open a database in read-only mode:
pt_pt: Abrir uma base de dados em modo de apenas leitura:

source: >>> con = sqlite3.connect("file:tutorial.db?mode=ro", uri=True) >>> con.execute("CREATE TABLE readonly(data)") Traceback (most recent call last): OperationalError: attempt to write a readonly database >>> con.close()
pt_pt: >>> con = sqlite3.connect("file:tutorial.db?mode=ro", uri=True) >>> con.execute("CREATE TABLE so_leitura(dados)") Traceback (most recent call last): OperationalError: tentativa de escrever numa base de dados de apenas leitura >>> con.close()

source: Do not implicitly create a new database file if it does not already exist; will raise :exc:`~sqlite3.OperationalError` if unable to create a new file:
pt_pt: Não criar implicitamente um novo ficheiro de base de dados se este não existir; lançará :exc:`~sqlite3.OperationalError` se não for possível criar um novo ficheiro:

source: >>> con = sqlite3.connect("file:nosuchdb.db?mode=rw", uri=True) Traceback (most recent call last): OperationalError: unable to open database file
pt_pt: >>> con = sqlite3.connect("file:naoexistedb.db?mode=rw", uri=True) Traceback (most recent call last): OperationalError: não foi possível abrir o ficheiro da base de dados

source: Create a shared named in-memory database:
pt_pt: Criar uma base de dados em memória partilhada com nome:

source: db = "file:mem1?mode=memory&cache=shared" con1 = sqlite3.connect(db, uri=True) con2 = sqlite3.connect(db, uri=True) with con1: con1.execute("CREATE TABLE shared(data)") con1.execute("INSERT INTO shared VALUES(28)") res = con2.execute("SELECT data FROM shared") assert res.fetchone() == (28,) con1.close() con2.close()
pt_pt: db = "file:mem1?mode=memory&cache=shared" con1 = sqlite3.connect(db, uri=True) con2 = sqlite3.connect(db, uri=True) with con1: con1.execute("CREATE TABLE partilhado(dados)") con1.execute("INSERT INTO partilhado VALUES(28)") res = con2.execute("SELECT dados FROM partilhado") assert res.fetchone() == (28,) con1.close() con2.close()

source: More information about this feature, including a list of parameters, can be found in the `SQLite URI documentation`_.
pt_pt: Mais informações sobre esta funcionalidade, incluindo uma lista de parâmetros, podem ser encontradas na `documentação de URI do SQLite`_.

source: How to create and use row factories
pt_pt: Como criar e usar fábricas de linhas

source: By default, :mod:`!sqlite3` represents each row as a :class:`tuple`. If a :class:`!tuple` does not suit your needs, you can use the :class:`sqlite3.Row` class or a custom :attr:`~Cursor.row_factory`.
pt_pt: Por predefinição, :mod:`!sqlite3` representa cada linha como um :class:`tuple`. Se um :class:`!tuple` não se adequar às suas necessidades, pode usar a classe :class:`sqlite3.Row` ou uma :attr:`~Cursor.row_factory` personalizada.

source: While :attr:`!row_factory` exists as an attribute both on the :class:`Cursor` and the :class:`Connection`, it is recommended to set :class:`Connection.row_factory`, so all cursors created from the connection will use the same row factory.
pt_pt: Embora :attr:`!row_factory` exista como atributo tanto no :class:`Cursor` como na :class:`Connection`, recomenda-se definir :class:`Connection.row_factory`, para que todos os cursores criados a partir da ligação usem a mesma fábrica de linhas.
