Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sqlite3.po
Languages: pt_pt

source: A single SQL DML statement.
pt_pt: Uma única declaração SQL DML.

source: An :term:`!iterable` of parameters to bind with the placeholders in *sql*. See :ref:`sqlite3-placeholders`.
pt_pt: Um :term:`!iterable` de parâmetros para ligar com os placeholders em *sql*. Veja :ref:`sqlite3-placeholders`.

source: rows = [ ("row1",), ("row2",), ] # cur is an sqlite3.Cursor object cur.executemany("INSERT INTO data VALUES(?)", rows)
pt_pt: rows = [ ("linha1",), ("linha2",), ] # cur é um objeto sqlite3.Cursor cur.executemany("INSERT INTO data VALUES(?)", rows)

source: Any resulting rows are discarded, including DML statements with `RETURNING clauses`_.
pt_pt: Quaisquer linhas resultantes são descartadas, incluindo declarações DML com `cláusulas RETURNING`_.

source: Execute the SQL statements in *sql_script*. If the :attr:`~Connection.autocommit` is :data:`LEGACY_TRANSACTION_CONTROL` and there is a pending transaction, an implicit ``COMMIT`` statement is executed first. No other implicit transaction control is performed; any transaction control must be added to *sql_script*.
pt_pt: Executa as declarações SQL em *sql_script*. Se :attr:`~Connection.autocommit` for :data:`LEGACY_TRANSACTION_CONTROL` e houver uma transação pendente, uma declaração ``COMMIT`` implícita é executada primeiro. Nenhum outro controlo de transação implícito é realizado; qualquer controlo de transação deve ser adicionado a *sql_script*.

source: *sql_script* must be a :class:`string <str>`.
pt_pt: *sql_script* deve ser uma :class:`string <str>`.

source: # cur is an sqlite3.Cursor object cur.executescript(""" BEGIN; CREATE TABLE person(firstname, lastname, age); CREATE TABLE book(title, author, published); CREATE TABLE publisher(name, address); COMMIT; """)
pt_pt: # cur é um objeto sqlite3.Cursor cur.executescript(""" BEGIN; CREATE TABLE person(firstname, lastname, age); CREATE TABLE book(title, author, published); CREATE TABLE publisher(name, address); COMMIT; """)

source: If :attr:`~Cursor.row_factory` is ``None``, return the next row query result set as a :class:`tuple`. Else, pass it to the row factory and return its result. Return ``None`` if no more data is available.
pt_pt: Se :attr:`~Cursor.row_factory` for ``None``, devolve o próximo conjunto de resultados da consulta como um :class:`tuple`. Caso contrário, passa-o para a fábrica de linhas e devolve o seu resultado. Devolve ``None`` se não houver mais dados disponíveis.

source: Return the next set of rows of a query result as a :class:`list`. Return an empty list if no more rows are available.
pt_pt: Devolve o próximo conjunto de linhas de um resultado de consulta como uma :class:`list`. Devolve uma lista vazia se não houver mais linhas disponíveis.

source: The number of rows to fetch per call is specified by the *size* parameter. If *size* is not given, :attr:`arraysize` determines the number of rows to be fetched. If fewer than *size* rows are available, as many rows as are available are returned.
pt_pt: O número de linhas a buscar por chamada é especificado pelo parâmetro *size*. Se *size* não for fornecido, :attr:`arraysize` determina o número de linhas a buscar. Se houver menos linhas do que *size*, são devolvidas todas as linhas disponíveis.

source: Note there are performance considerations involved with the *size* parameter. For optimal performance, it is usually best to use the arraysize attribute. If the *size* parameter is used, then it is best for it to retain the same value from one :meth:`fetchmany` call to the next.
pt_pt: Note que existem considerações de desempenho envolvidas com o parâmetro *size*. Para um desempenho ideal, é geralmente melhor usar o atributo arraysize. Se o parâmetro *size* for usado, é melhor que mantenha o mesmo valor de uma chamada :meth:`fetchmany` para a seguinte.

source: Return all (remaining) rows of a query result as a :class:`list`. Return an empty list if no rows are available. Note that the :attr:`arraysize` attribute can affect the performance of this operation.
pt_pt: Devolve todas as (restantes) linhas de um resultado de consulta como uma :class:`list`. Devolve uma lista vazia se não houver linhas disponíveis. Note que o atributo :attr:`arraysize` pode afetar o desempenho desta operação.

source: Close the cursor now (rather than whenever ``__del__`` is called).
pt_pt: Fecha o cursor agora (em vez de quando ``__del__`` for chamado).

source: The cursor will be unusable from this point forward; a :exc:`ProgrammingError` exception will be raised if any operation is attempted with the cursor.
pt_pt: O cursor não poderá ser usado a partir deste ponto; uma exceção :exc:`ProgrammingError` será lançada se alguma operação for tentada com o cursor.

source: Required by the DB-API. Does nothing in :mod:`!sqlite3`.
pt_pt: Requerido pela DB-API. Não faz nada em :mod:`!sqlite3`.

source: Read/write attribute that controls the number of rows returned by :meth:`fetchmany`. The default value is 1 which means a single row would be fetched per call.
pt_pt: Atributo de leitura/escrita que controla o número de linhas devolvidas por :meth:`fetchmany`. O valor predefinido é 1, o que significa que uma única linha seria buscada por chamada.

source: Read-only attribute that provides the SQLite database :class:`Connection` belonging to the cursor. A :class:`Cursor` object created by calling :meth:`con.cursor() <Connection.cursor>` will have a :attr:`connection` attribute that refers to *con*:
pt_pt: Atributo de apenas leitura que fornece a ligação :class:`Connection` à base de dados SQLite pertencente ao cursor. Um objeto :class:`Cursor` criado chamando :meth:`con.cursor() <Connection.cursor>` terá um atributo :attr:`connection` que se refere a *con*:

source: Read-only attribute that provides the column names of the last query. To remain compatible with the Python DB API, it returns a 7-tuple for each column where the last six items of each tuple are ``None``.
pt_pt: Atributo de apenas leitura que fornece os nomes das colunas da última consulta. Para permanecer compatível com a API de Base de Dados do Python, devolve um 7-tuplo para cada coluna, onde os últimos seis itens de cada tuplo são ``None``.

source: It is set for ``SELECT`` statements without any matching rows as well.
pt_pt: Também é definido para declarações ``SELECT`` sem quaisquer linhas correspondentes.

source: Read-only attribute that provides the row id of the last inserted row. It is only updated after successful ``INSERT`` or ``REPLACE`` statements using the :meth:`execute` method. For other statements, after :meth:`executemany` or :meth:`executescript`, or if the insertion failed, the value of ``lastrowid`` is left unchanged. The initial value of ``lastrowid`` is ``None``.
pt_pt: Atributo de apenas leitura que fornece o ID da última linha inserida. Só é atualizado após declarações ``INSERT`` ou ``REPLACE`` bem-sucedidas usando o método :meth:`execute`. Para outras declarações, após :meth:`executemany` ou :meth:`executescript`, ou se a inserção falhou, o valor de ``lastrowid`` permanece inalterado. O valor inicial de ``lastrowid`` é ``None``.

source: Inserts into ``WITHOUT ROWID`` tables are not recorded.
pt_pt: Inserções em tabelas ``WITHOUT ROWID`` não são registadas.

source: Added support for the ``REPLACE`` statement.
pt_pt: Adicionado suporte para a declaração ``REPLACE``.

source: Read-only attribute that provides the number of modified rows for ``INSERT``, ``UPDATE``, ``DELETE``, and ``REPLACE`` statements; is ``-1`` for other statements, including :abbr:`CTE (Common Table Expression)` queries. It is only updated by the :meth:`execute` and :meth:`executemany` methods, after the statement has run to completion. This means that any resulting rows must be fetched in order for :attr:`!rowcount` to be updated.
pt_pt: Atributo de apenas leitura que fornece o número de linhas modificadas para declarações ``INSERT``, ``UPDATE``, ``DELETE`` e ``REPLACE``; é ``-1`` para outras declarações, incluindo consultas :abbr:`CTE (Common Table Expression)`. Só é atualizado pelos métodos :meth:`execute` e :meth:`executemany`, após a declaração ter sido executada até ao fim. Isto significa que quaisquer linhas resultantes devem ser buscadas para que :attr:`!rowcount` seja atualizado.

source: Control how a row fetched from this :class:`!Cursor` is represented. If ``None``, a row is represented as a :class:`tuple`. Can be set to the included :class:`sqlite3.Row`; or a :term:`callable` that accepts two arguments, a :class:`Cursor` object and the :class:`!tuple` of row values, and returns a custom object representing an SQLite row.
pt_pt: Controla como uma linha buscada a partir deste :class:`!Cursor` é representada. Se ``None``, uma linha é representada como um :class:`tuple`. Pode ser definido para o :class:`sqlite3.Row` incluído; ou um :term:`chamável` que aceita dois argumentos, um objeto :class:`Cursor` e o :class:`!tuple` de valores da linha, e devolve um objeto personalizado que representa uma linha SQLite.

source: Defaults to what :attr:`Connection.row_factory` was set to when the :class:`!Cursor` was created. Assigning to this attribute does not affect :attr:`Connection.row_factory` of the parent connection.
pt_pt: Por predefinição, é o que :attr:`Connection.row_factory` estava definido quando o :class:`!Cursor` foi criado. Atribuir a este atributo não afeta :attr:`Connection.row_factory` da ligação pai.

source: Row objects
pt_pt: Objetos Row

source: A :class:`!Row` instance serves as a highly optimized :attr:`~Connection.row_factory` for :class:`Connection` objects. It supports iteration, equality testing, :func:`len`, and :term:`mapping` access by column name and index.
pt_pt: Uma instância :class:`!Row` serve como uma fábrica de linhas :attr:`~Connection.row_factory` altamente otimizada para objetos :class:`Connection`. Suporta iteração, teste de igualdade, :func:`len` e acesso de :term:`mapeamento` por nome de coluna e índice.

source: Two :class:`!Row` objects compare equal if they have identical column names and values.
pt_pt: Dois objetos :class:`!Row` são considerados iguais se tiverem nomes de colunas e valores idênticos.

source: Return a :class:`list` of column names as :class:`strings <str>`. Immediately after a query, it is the first member of each tuple in :attr:`Cursor.description`.
pt_pt: Devolve uma :class:`list` de nomes de colunas como :class:`strings <str>`. Imediatamente após uma consulta, é o primeiro membro de cada tuplo em :attr:`Cursor.description`.

source: Added support of slicing.
pt_pt: Adicionado suporte para fatiamento.

source: Blob objects
pt_pt: Objetos Blob

source: A :class:`Blob` instance is a :term:`file-like object` that can read and write data in an SQLite :abbr:`BLOB (Binary Large OBject)`. Call :func:`len(blob) <len>` to get the size (number of bytes) of the blob. Use indices and :term:`slices <slice>` for direct access to the blob data.
pt_pt: Uma instância :class:`Blob` é um :term:`objeto tipo ficheiro` que pode ler e escrever dados num :abbr:`BLOB (Binary Large OBject)` do SQLite. Chame :func:`len(blob) <len>` para obter o tamanho (número de bytes) do blob. Use índices e :term:`fatias <slice>` para acesso direto aos dados do blob.

source: Use the :class:`Blob` as a :term:`context manager` to ensure that the blob handle is closed after use.
pt_pt: Use o :class:`Blob` como um :term:`gestor de contexto` para garantir que o identificador do blob é fechado após o uso.

source: con = sqlite3.connect(":memory:") con.execute("CREATE TABLE test(blob_col blob)") con.execute("INSERT INTO test(blob_col) VALUES(zeroblob(13))") # Write to our blob, using two write operations: with con.blobopen("test", "blob_col", 1) as blob: blob.write(b"hello, ") blob.write(b"world.") # Modify the first and last bytes of our blob blob[0] = ord("H") blob[-1] = ord("!") # Read the contents of our blob with con.blobopen("test", "blob_col", 1) as blob: greeting = blob.read() print(greeting) # outputs "b'Hello, world!'" con.close()
pt_pt: con = sqlite3.connect(":memory:") con.execute("CREATE TABLE test(blob_col blob)") con.execute("INSERT INTO test(blob_col) VALUES(zeroblob(13))") # Escrever no nosso blob, usando duas operações de escrita: with con.blobopen("test", "blob_col", 1) as blob: blob.write(b"olá, ") blob.write(b"mundo.") # Modificar o primeiro e o último byte do nosso blob blob[0] = ord("O") blob[-1] = ord("!") # Ler o conteúdo do nosso blob with con.blobopen("test", "blob_col", 1) as blob: saudacao = blob.read() print(saudacao) # produz "b'Olá, mundo!'" con.close()

source: Close the blob.
pt_pt: Fecha o blob.

source: The blob will be unusable from this point onward. An :class:`~sqlite3.Error` (or subclass) exception will be raised if any further operation is attempted with the blob.
pt_pt: O blob não poderá ser usado a partir deste ponto. Uma exceção :class:`~sqlite3.Error` (ou uma subclasse) será lançada se alguma operação adicional for tentada com o blob.

source: Read *length* bytes of data from the blob at the current offset position. If the end of the blob is reached, the data up to :abbr:`EOF (End of File)` will be returned. When *length* is not specified, or is negative, :meth:`~Blob.read` will read until the end of the blob.
pt_pt: Lê *length* bytes de dados do blob na posição atual de deslocamento. Se o final do blob for atingido, os dados até :abbr:`EOF (End of File)` serão devolvidos. Quando *length* não for especificado, ou for negativo, :meth:`~Blob.read` lerá até ao final do blob.

source: Write *data* to the blob at the current offset. This function cannot change the blob length. Writing beyond the end of the blob will raise :exc:`ValueError`.
pt_pt: Escreve *data* no blob na posição atual de deslocamento. Esta função não pode alterar o comprimento do blob. Escrever além do final do blob lançará :exc:`ValueError`.

source: Return the current access position of the blob.
pt_pt: Devolve a posição atual de acesso do blob.

source: Set the current access position of the blob to *offset*. The *origin* argument defaults to :const:`os.SEEK_SET` (absolute blob positioning). Other values for *origin* are :const:`os.SEEK_CUR` (seek relative to the current position) and :const:`os.SEEK_END` (seek relative to the blob’s end).
pt_pt: Define a posição atual de acesso do blob para *offset*. O argumento *origin* tem como predefinição :const:`os.SEEK_SET` (posicionamento absoluto do blob). Outros valores para *origin* são :const:`os.SEEK_CUR` (deslocamento relativo à posição atual) e :const:`os.SEEK_END` (deslocamento relativo ao final do blob).

source: PrepareProtocol objects
pt_pt: Objetos PrepareProtocol

source: The PrepareProtocol type's single purpose is to act as a :pep:`246` style adaption protocol for objects that can :ref:`adapt themselves <sqlite3-conform>` to :ref:`native SQLite types <sqlite3-types>`.
pt_pt: O único propósito do tipo PrepareProtocol é atuar como um protocolo de adaptação no estilo :pep:`246` para objetos que podem :ref:`adaptar-se a si mesmos <sqlite3-conform>` para :ref:`tipos nativos do SQLite <sqlite3-types>`.

source: Exceptions
pt_pt: Exceções

source: The exception hierarchy is defined by the DB-API 2.0 (:pep:`249`).
pt_pt: A hierarquia de exceções é definida pela DB-API 2.0 (:pep:`249`).

source: This exception is not currently raised by the :mod:`!sqlite3` module, but may be raised by applications using :mod:`!sqlite3`, for example if a user-defined function truncates data while inserting. ``Warning`` is a subclass of :exc:`Exception`.
pt_pt: Esta exceção não é atualmente lançada pelo módulo :mod:`!sqlite3`, mas pode ser lançada por aplicações que usam :mod:`!sqlite3`, por exemplo, se uma função definida pelo utilizador truncar dados durante a inserção. ``Warning`` é uma subclasse de :exc:`Exception`.

source: The base class of the other exceptions in this module. Use this to catch all errors with one single :keyword:`except` statement. ``Error`` is a subclass of :exc:`Exception`.
pt_pt: A classe base das outras exceções neste módulo. Use isto para capturar todos os erros com uma única declaração :keyword:`except`. ``Error`` é uma subclasse de :exc:`Exception`.

source: If the exception originated from within the SQLite library, the following two attributes are added to the exception:
pt_pt: Se a exceção teve origem dentro da biblioteca SQLite, os seguintes dois atributos são adicionados à exceção:

source: The numeric error code from the `SQLite API <https://sqlite.org/rescode.html>`_
pt_pt: O código de erro numérico da `API SQLite <https://sqlite.org/rescode.html>`_

source: The symbolic name of the numeric error code from the `SQLite API <https://sqlite.org/rescode.html>`_
pt_pt: O nome simbólico do código de erro numérico da `API SQLite <https://sqlite.org/rescode.html>`_

source: Exception raised for misuse of the low-level SQLite C API. In other words, if this exception is raised, it probably indicates a bug in the :mod:`!sqlite3` module. ``InterfaceError`` is a subclass of :exc:`Error`.
pt_pt: Exceção lançada por uso incorreto da API C de baixo nível do SQLite. Em outras palavras, se esta exceção for lançada, provavelmente indica um bug no módulo :mod:`!sqlite3`. ``InterfaceError`` é uma subclasse de :exc:`Error`.

source: Exception raised for errors that are related to the database. This serves as the base exception for several types of database errors. It is only raised implicitly through the specialised subclasses. ``DatabaseError`` is a subclass of :exc:`Error`.
pt_pt: Exceção lançada para erros relacionados com a base de dados. Isto serve como a exceção base para vários tipos de erros de base de dados. É lançada implicitamente através das subclasses especializadas. ``DatabaseError`` é uma subclasse de :exc:`Error`.

source: Exception raised for errors caused by problems with the processed data, like numeric values out of range, and strings which are too long. ``DataError`` is a subclass of :exc:`DatabaseError`.
pt_pt: Exceção lançada para erros causados por problemas com os dados processados, como valores numéricos fora do intervalo e strings demasiado longas. ``DataError`` é uma subclasse de :exc:`DatabaseError`.

source: Exception raised for errors that are related to the database's operation, and not necessarily under the control of the programmer. For example, the database path is not found, or a transaction could not be processed. ``OperationalError`` is a subclass of :exc:`DatabaseError`.
pt_pt: Exceção lançada para erros relacionados com a operação da base de dados, e não necessariamente sob o controlo do programador. Por exemplo, o caminho da base de dados não é encontrado, ou uma transação não pode ser processada. ``OperationalError`` é uma subclasse de :exc:`DatabaseError`.

source: Exception raised when the relational integrity of the database is affected, e.g. a foreign key check fails. It is a subclass of :exc:`DatabaseError`.
pt_pt: Exceção lançada quando a integridade relacional da base de dados é afetada, por exemplo, uma verificação de chave estrangeira falha. É uma subclasse de :exc:`DatabaseError`.

source: Exception raised when SQLite encounters an internal error. If this is raised, it may indicate that there is a problem with the runtime SQLite library. ``InternalError`` is a subclass of :exc:`DatabaseError`.
pt_pt: Exceção lançada quando o SQLite encontra um erro interno. Se isto for lançado, pode indicar que há um problema com a biblioteca SQLite em tempo de execução. ``InternalError`` é uma subclasse de :exc:`DatabaseError`.

source: Exception raised for :mod:`!sqlite3` API programming errors, for example supplying the wrong number of bindings to a query, or trying to operate on a closed :class:`Connection`. ``ProgrammingError`` is a subclass of :exc:`DatabaseError`.
pt_pt: Exceção lançada para erros de programação da API :mod:`!sqlite3`, por exemplo, fornecer o número errado de ligações a uma consulta, ou tentar operar numa :class:`Connection` fechada. ``ProgrammingError`` é uma subclasse de :exc:`DatabaseError`.

source: Exception raised in case a method or database API is not supported by the underlying SQLite library. For example, setting *deterministic* to ``True`` in :meth:`~Connection.create_function`, if the underlying SQLite library does not support deterministic functions. ``NotSupportedError`` is a subclass of :exc:`DatabaseError`.
pt_pt: Exceção lançada caso um método ou API de base de dados não seja suportado pela biblioteca SQLite subjacente. Por exemplo, definir *deterministic* como ``True`` em :meth:`~Connection.create_function`, se a biblioteca SQLite subjacente não suportar funções determinísticas. ``NotSupportedError`` é uma subclasse de :exc:`DatabaseError`.

source: SQLite and Python types
pt_pt: Tipos SQLite e Python

source: SQLite natively supports the following types: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.
pt_pt: O SQLite suporta nativamente os seguintes tipos: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.

source: The following Python types can thus be sent to SQLite without any problem:
pt_pt: Os seguintes tipos Python podem, portanto, ser enviados para o SQLite sem qualquer problema:

source: Python type
pt_pt: tipo Python

source: SQLite type
pt_pt: Tipo SQLite

source: This is how SQLite types are converted to Python types by default:
pt_pt: Esta é a forma como os tipos SQLite são convertidos para tipos Python por predefinição:

source: depends on :attr:`~Connection.text_factory`, :class:`str` by default
pt_pt: depende de :attr:`~Connection.text_factory`, :class:`str` por predefinição

source: The type system of the :mod:`!sqlite3` module is extensible in two ways: you can store additional Python types in an SQLite database via :ref:`object adapters <sqlite3-adapters>`, and you can let the :mod:`!sqlite3` module convert SQLite types to Python types via :ref:`converters <sqlite3-converters>`.
pt_pt: O sistema de tipos do módulo :mod:`!sqlite3` é extensível de duas formas: pode armazenar tipos Python adicionais numa base de dados SQLite através de :ref:`adaptadores de objetos <sqlite3-adapters>`, e pode deixar que o módulo :mod:`!sqlite3` converta tipos SQLite para tipos Python através de :ref:`conversores <sqlite3-converters>`.

source: Default adapters and converters (deprecated)
pt_pt: Adaptadores e conversores predefinidos (obsoletos)

source: The default adapters and converters are deprecated as of Python 3.12. Instead, use the :ref:`sqlite3-adapter-converter-recipes` and tailor them to your needs.
pt_pt: Os adaptadores e conversores predefinidos estão obsoletos a partir do Python 3.12. Em vez disso, use as :ref:`sqlite3-adapter-converter-recipes` e adapte-as às suas necessidades.

source: The deprecated default adapters and converters consist of:
pt_pt: Os adaptadores e conversores predefinidos obsoletos consistem em:

source: An adapter for :class:`datetime.date` objects to :class:`strings <str>` in `ISO 8601`_ format.
pt_pt: Um adaptador para objetos :class:`datetime.date` para :class:`strings <str>` no formato `ISO 8601`_.

source: An adapter for :class:`datetime.datetime` objects to strings in ISO 8601 format.
pt_pt: Um adaptador para objetos :class:`datetime.datetime` para strings no formato ISO 8601.

source: A converter for :ref:`declared <sqlite3-converters>` "date" types to :class:`datetime.date` objects.
pt_pt: Um conversor para tipos "date" :ref:`declarados <sqlite3-converters>` para objetos :class:`datetime.date`.

source: A converter for declared "timestamp" types to :class:`datetime.datetime` objects. Fractional parts will be truncated to 6 digits (microsecond precision).
pt_pt: Um conversor para tipos "timestamp" declarados para objetos :class:`datetime.datetime`. As partes fracionárias serão truncadas para 6 dígitos (precisão de microsegundos).
