Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sqlite3.po
Languages: pt_pt

source: CREATE TABLE test( i integer primary key, ! will look up a converter named "integer" p point, ! will look up a converter named "point" n number(10) ! will look up a converter named "number" )
pt_pt: CREATE TABLE test( i integer primary key, ! procurará um conversor chamado "integer" p point, ! procurará um conversor chamado "point" n number(10) ! procurará um conversor chamado "number" )

source: This flag may be combined with :const:`PARSE_COLNAMES` using the ``|`` (bitwise or) operator.
pt_pt: Esta flag pode ser combinada com :const:`PARSE_COLNAMES` usando o operador ``|`` (ou bit a bit).

source: Generated fields (for example ``MAX(p)``) are returned as :class:`str`. Use :const:`!PARSE_COLNAMES` to enforce types for such queries.
pt_pt: Campos gerados (por exemplo ``MAX(p)``) são devolvidos como :class:`str`. Use :const:`!PARSE_COLNAMES` para impor tipos para tais consultas.

source: Pass this flag value to the *detect_types* parameter of :func:`connect` to look up a converter function by using the type name, parsed from the query column name, as the converter dictionary key. The query column name must be wrapped in double quotes (``"``) and the type name must be wrapped in square brackets (``[]``).
pt_pt: Passe este valor de flag para o parâmetro *detect_types* de :func:`connect` para procurar uma função de conversão usando o nome do tipo, analisado a partir do nome da coluna da consulta, como a chave do dicionário de conversores. O nome da coluna da consulta deve estar envolvido em aspas duplas (``"``) e o nome do tipo deve estar envolvido em parênteses retos (``[]``).

source: SELECT MAX(p) as "p [point]" FROM test; ! will look up converter "point"
pt_pt: SELECT MAX(p) as "p [point]" FROM test; ! procurará o conversor "point"

source: This flag may be combined with :const:`PARSE_DECLTYPES` using the ``|`` (bitwise or) operator.
pt_pt: Esta flag pode ser combinada com :const:`PARSE_DECLTYPES` usando o operador ``|`` (ou bit a bit).

source: Flags that should be returned by the *authorizer_callback* :term:`callable` passed to :meth:`Connection.set_authorizer`, to indicate whether:
pt_pt: Flags que devem ser devolvidos pelo *authorizer_callback* :term:`chamável` passado para :meth:`Connection.set_authorizer`, para indicar se:

source: Access is allowed (:const:`!SQLITE_OK`),
pt_pt: O acesso é permitido (:const:`!SQLITE_OK`),

source: The SQL statement should be aborted with an error (:const:`!SQLITE_DENY`)
pt_pt: A declaração SQL deve ser abortada com um erro (:const:`!SQLITE_DENY`)

source: The column should be treated as a ``NULL`` value (:const:`!SQLITE_IGNORE`)
pt_pt: A coluna deve ser tratada como um valor ``NULL`` (:const:`!SQLITE_IGNORE`)

source: String constant stating the supported DB-API level. Required by the DB-API. Hard-coded to ``"2.0"``.
pt_pt: Constante de string indicando o nível DB-API suportado. Requerido pela DB-API. Codificado como ``"2.0"``.

source: String constant stating the type of parameter marker formatting expected by the :mod:`!sqlite3` module. Required by the DB-API. Hard-coded to ``"qmark"``.
pt_pt: Constante de string indicando o tipo de formatação de marcador de parâmetro esperado pelo módulo :mod:`!sqlite3`. Requerido pela DB-API. Codificado como ``"qmark"``.

source: The ``named`` DB-API parameter style is also supported.
pt_pt: O estilo de parâmetro DB-API ``named`` também é suportado.

source: Version number of the runtime SQLite library as a :class:`string <str>`.
pt_pt: Número da versão da biblioteca SQLite em tempo de execução como uma :class:`string <str>`.

source: Version number of the runtime SQLite library as a :class:`tuple` of :class:`integers <int>`.
pt_pt: Número da versão da biblioteca SQLite em tempo de execução como um :class:`tuple` de :class:`integers <int>`.

source: Integer constant required by the DB-API 2.0, stating the level of thread safety the :mod:`!sqlite3` module supports. This attribute is set based on the default `threading mode <https://sqlite.org/threadsafe.html>`_ the underlying SQLite library is compiled with. The SQLite threading modes are:
pt_pt: Constante inteira requerida pela DB-API 2.0, indicando o nível de segurança de threads que o módulo :mod:`!sqlite3` suporta. Este atributo é definido com base no modo de threading predefinido `modo de threading <https://sqlite.org/threadsafe.html>`_ com o qual a biblioteca SQLite subjacente é compilada. Os modos de threading do SQLite são:

source: **Single-thread**: In this mode, all mutexes are disabled and SQLite is unsafe to use in more than a single thread at once.
pt_pt: **Single-thread**: Neste modo, todos os mutexes estão desativados e o SQLite não é seguro para usar em mais do que uma thread de cada vez.

source: **Multi-thread**: In this mode, SQLite can be safely used by multiple threads provided that no single database connection is used simultaneously in two or more threads.
pt_pt: **Multi-thread**: Neste modo, o SQLite pode ser usado com segurança por múltiplas threads, desde que nenhuma ligação única à base de dados seja usada simultaneamente em duas ou mais threads.

source: **Serialized**: In serialized mode, SQLite can be safely used by multiple threads with no restriction.
pt_pt: **Serialized**: No modo serializado, o SQLite pode ser usado com segurança por múltiplas threads sem restrições.

source: The mappings from SQLite threading modes to DB-API 2.0 threadsafety levels are as follows:
pt_pt: Os mapeamentos dos modos de threading do SQLite para os níveis de segurança de threads da DB-API 2.0 são os seguintes:

source: SQLite threading mode
pt_pt: Modo de threading do SQLite

source: DB-API 2.0 meaning
pt_pt: Significado da DB-API 2.0

source: Threads may not share the module
pt_pt: As threads não podem partilhar o módulo

source: Threads may share the module, but not connections
pt_pt: As threads podem partilhar o módulo, mas não as ligações

source: serialized
pt_pt: serializado

source: Threads may share the module, connections and cursors
pt_pt: As threads podem partilhar o módulo, ligações e cursores

source: Set *threadsafety* dynamically instead of hard-coding it to ``1``.
pt_pt: Defina *threadsafety* dinamicamente em vez de o codificar como ``1``.

source: These constants are used for the :meth:`Connection.setconfig` and :meth:`~Connection.getconfig` methods.
pt_pt: Estas constantes são usadas para os métodos :meth:`Connection.setconfig` e :meth:`~Connection.getconfig`.

source: The availability of these constants varies depending on the version of SQLite Python was compiled with.
pt_pt: A disponibilidade destas constantes varia dependendo da versão do SQLite com a qual o Python foi compilado.

source: SQLite docs: Database Connection Configuration Options
pt_pt: Documentação do SQLite: Opções de Configuração de Ligação à Base de Dados

source: Connection objects
pt_pt: Objetos de ligação

source: Each open SQLite database is represented by a ``Connection`` object, which is created using :func:`sqlite3.connect`. Their main purpose is creating :class:`Cursor` objects, and :ref:`sqlite3-controlling-transactions`.
pt_pt: Cada base de dados SQLite aberta é representada por um objeto ``Connection``, que é criado usando :func:`sqlite3.connect`. O seu principal propósito é criar objetos :class:`Cursor` e :ref:`sqlite3-controlling-transactions`.

source: An SQLite database connection has the following attributes and methods:
pt_pt: Uma ligação a uma base de dados SQLite tem os seguintes atributos e métodos:

source: Create and return a :class:`Cursor` object. The cursor method accepts a single optional parameter *factory*. If supplied, this must be a :term:`callable` returning an instance of :class:`Cursor` or its subclasses.
pt_pt: Cria e devolve um objeto :class:`Cursor`. O método cursor aceita um único parâmetro opcional *factory*. Se fornecido, este deve ser um :term:`chamável` que devolve uma instância de :class:`Cursor` ou das suas subclasses.

source: Open a :class:`Blob` handle to an existing :abbr:`BLOB (Binary Large OBject)`.
pt_pt: Abre um :class:`Blob` para um :abbr:`BLOB (Binary Large OBject)` existente.

source: The name of the table where the blob is located.
pt_pt: O nome da tabela onde o blob está localizado.

source: The name of the column where the blob is located.
pt_pt: O nome da coluna onde o blob está localizado.

source: Set to ``True`` if the blob should be opened without write permissions. Defaults to ``False``.
pt_pt: Definido como ``True`` se o blob deve ser aberto sem permissões de escrita. Predefinição é ``False``.

source: The name of the database where the blob is located. Defaults to ``"main"``.
pt_pt: O nome da base de dados onde o blob está localizado. Predefinição é ``"main"``.

source: Raises
pt_pt: Lança

source: When trying to open a blob in a ``WITHOUT ROWID`` table.
pt_pt: Ao tentar abrir um blob numa tabela ``WITHOUT ROWID``.

source: The blob size cannot be changed using the :class:`Blob` class. Use the SQL function ``zeroblob`` to create a blob with a fixed size.
pt_pt: O tamanho do blob não pode ser alterado usando a classe :class:`Blob`. Use a função SQL ``zeroblob`` para criar um blob com um tamanho fixo.

source: Commit any pending transaction to the database. If :attr:`autocommit` is ``True``, or there is no open transaction, this method does nothing. If :attr:`!autocommit` is ``False``, a new transaction is implicitly opened if a pending transaction was committed by this method.
pt_pt: Confirma qualquer transação pendente na base de dados. Se :attr:`autocommit` for ``True``, ou não houver nenhuma transação aberta, este método não faz nada. Se :attr:`!autocommit` for ``False``, uma nova transação é implicitamente aberta se uma transação pendente foi confirmada por este método.

source: Roll back to the start of any pending transaction. If :attr:`autocommit` is ``True``, or there is no open transaction, this method does nothing. If :attr:`!autocommit` is ``False``, a new transaction is implicitly opened if a pending transaction was rolled back by this method.
pt_pt: Reverte para o início de qualquer transação pendente. Se :attr:`autocommit` for ``True``, ou não houver nenhuma transação aberta, este método não faz nada. Se :attr:`!autocommit` for ``False``, uma nova transação é implicitamente aberta se uma transação pendente foi revertida por este método.

source: Close the database connection. If :attr:`autocommit` is ``False``, any pending transaction is implicitly rolled back. If :attr:`!autocommit` is ``True`` or :data:`LEGACY_TRANSACTION_CONTROL`, no implicit transaction control is executed. Make sure to :meth:`commit` before closing to avoid losing pending changes.
pt_pt: Fecha a ligação à base de dados. Se :attr:`autocommit` for ``False``, qualquer transação pendente é implicitamente revertida. Se :attr:`!autocommit` for ``True`` ou :data:`LEGACY_TRANSACTION_CONTROL`, nenhum controlo de transação implícito é executado. Certifique-se de :meth:`commit` antes de fechar para evitar perder alterações pendentes.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.execute` on it with the given *sql* and *parameters*. Return the new cursor object.
pt_pt: Cria um novo objeto :class:`Cursor` e chama :meth:`~Cursor.execute` nele com o *sql* e *parameters* dados. Devolve o novo objeto cursor.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executemany` on it with the given *sql* and *parameters*. Return the new cursor object.
pt_pt: Cria um novo objeto :class:`Cursor` e chama :meth:`~Cursor.executemany` nele com o *sql* e *parameters* dados. Devolve o novo objeto cursor.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executescript` on it with the given *sql_script*. Return the new cursor object.
pt_pt: Cria um novo objeto :class:`Cursor` e chama :meth:`~Cursor.executescript` nele com o *sql_script* dado. Devolve o novo objeto cursor.

source: Create or remove a user-defined SQL function.
pt_pt: Cria ou remove uma função SQL definida pelo utilizador.

source: The name of the SQL function.
pt_pt: O nome da função SQL.

source: The number of arguments the SQL function can accept. If ``-1``, it may take any number of arguments.
pt_pt: O número de argumentos que a função SQL pode aceitar. Se ``-1``, pode aceitar qualquer número de argumentos.

source: A :term:`callable` that is called when the SQL function is invoked. The callable must return :ref:`a type natively supported by SQLite <sqlite3-types>`. Set to ``None`` to remove an existing SQL function.
pt_pt: Um :term:`chamável` que é chamado quando a função SQL é invocada. O chamável deve devolver :ref:`um tipo nativamente suportado pelo SQLite <sqlite3-types>`. Defina como ``None`` para remover uma função SQL existente.

source: If ``True``, the created SQL function is marked as `deterministic <https://sqlite.org/deterministic.html>`_, which allows SQLite to perform additional optimizations.
pt_pt: Se ``True``, a função SQL criada é marcada como `determinística <https://sqlite.org/deterministic.html>`_, o que permite ao SQLite realizar otimizações adicionais.

source: Added the *deterministic* parameter.
pt_pt: Adicionado o parâmetro *deterministic*.

source: Example:
pt_pt: Exemplo:

source: Create or remove a user-defined SQL aggregate function.
pt_pt: Cria ou remove uma função agregada SQL definida pelo utilizador.

source: The name of the SQL aggregate function.
pt_pt: O nome da função agregada SQL.

source: The number of arguments the SQL aggregate function can accept. If ``-1``, it may take any number of arguments.
pt_pt: O número de argumentos que a função agregada SQL pode aceitar. Se ``-1``, pode aceitar qualquer número de argumentos.

source: A class must implement the following methods: * ``step()``: Add a row to the aggregate. * ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`. The number of arguments that the ``step()`` method must accept is controlled by *n_arg*. Set to ``None`` to remove an existing SQL aggregate function.
pt_pt: Uma classe deve implementar os seguintes métodos: * ``step()``: Adiciona uma linha ao agregado. * ``finalize()``: Devolve o resultado final do agregado como :ref:`um tipo nativamente suportado pelo SQLite <sqlite3-types>`. O número de argumentos que o método ``step()`` deve aceitar é controlado por *n_arg*. Defina como ``None`` para remover uma função agregada SQL existente.

source: The number of arguments that the ``step()`` method must accept is controlled by *n_arg*.
pt_pt: O número de argumentos que o método ``step()`` deve aceitar é controlado por *n_arg*.

source: Set to ``None`` to remove an existing SQL aggregate function.
pt_pt: Defina como ``None`` para remover uma função agregada SQL existente.

source: Create or remove a user-defined aggregate window function.
pt_pt: Cria ou remove uma função agregada de janela definida pelo utilizador.

source: The name of the SQL aggregate window function to create or remove.
pt_pt: O nome da função agregada de janela SQL a criar ou remover.

source: The number of arguments the SQL aggregate window function can accept. If ``-1``, it may take any number of arguments.
pt_pt: O número de argumentos que a função agregada de janela SQL pode aceitar. Se ``-1``, pode aceitar qualquer número de argumentos.

source: A class that must implement the following methods: * ``step()``: Add a row to the current window. * ``value()``: Return the current value of the aggregate. * ``inverse()``: Remove a row from the current window. * ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`. The number of arguments that the ``step()`` and ``value()`` methods must accept is controlled by *num_params*. Set to ``None`` to remove an existing SQL aggregate window function.
pt_pt: Uma classe que deve implementar os seguintes métodos: * ``step()``: Adiciona uma linha à janela atual. * ``value()``: Devolve o valor atual do agregado. * ``inverse()``: Remove uma linha da janela atual. * ``finalize()``: Devolve o resultado final do agregado como :ref:`um tipo nativamente suportado pelo SQLite <sqlite3-types>`. O número de argumentos que os métodos ``step()`` e ``value()`` devem aceitar é controlado por *num_params*. Defina como ``None`` para remover uma função agregada de janela SQL existente.

source: A class that must implement the following methods:
pt_pt: Uma classe que deve implementar os seguintes métodos:

source: ``step()``: Add a row to the current window.
pt_pt: ``step()``: Adiciona uma linha à janela atual.

source: ``value()``: Return the current value of the aggregate.
pt_pt: ``value()``: Devolve o valor atual do agregado.

source: ``inverse()``: Remove a row from the current window.
pt_pt: ``inverse()``: Remove uma linha da janela atual.

source: The number of arguments that the ``step()`` and ``value()`` methods must accept is controlled by *num_params*.
pt_pt: O número de argumentos que os métodos ``step()`` e ``value()`` devem aceitar é controlado por *num_params*.

source: Set to ``None`` to remove an existing SQL aggregate window function.
pt_pt: Defina como ``None`` para remover uma função agregada de janela SQL existente.

source: If used with a version of SQLite older than 3.25.0, which does not support aggregate window functions.
pt_pt: Se usado com uma versão do SQLite anterior à 3.25.0, que não suporta funções agregadas de janela.

source: # Example taken from https://www.sqlite.org/windowfunctions.html#udfwinfunc class WindowSumInt: def __init__(self): self.count = 0 def step(self, value): """Add a row to the current window.""" self.count += value def value(self): """Return the current value of the aggregate.""" return self.count def inverse(self, value): """Remove a row from the current window.""" self.count -= value def finalize(self): """Return the final value of the aggregate. Any clean-up actions should be placed here. """ return self.count con = sqlite3.connect(":memory:") cur = con.execute("CREATE TABLE test(x, y)") values = [ ("a", 4), ("b", 5), ("c", 3), ("d", 8), ("e", 1), ] cur.executemany("INSERT INTO test VALUES(?, ?)", values) con.create_window_function("sumint", 1, WindowSumInt) cur.execute(""" SELECT x, sumint(y) OVER ( ORDER BY x ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING ) AS sum_y FROM test ORDER BY x """) print(cur.fetchall()) con.close()
pt_pt: # Exemplo retirado de https://www.sqlite.org/windowfunctions.html#udfwinfunc class WindowSumInt: def __init__(self): self.count = 0 def step(self, value): """Adiciona uma linha à janela atual.""" self.count += value def value(self): """Devolve o valor atual do agregado.""" return self.count def inverse(self, value): """Remove uma linha da janela atual.""" self.count -= value def finalize(self): """Devolve o valor final do agregado. Quaisquer ações de limpeza devem ser colocadas aqui. """ return self.count con = sqlite3.connect(":memory:") cur = con.execute("CREATE TABLE test(x, y)") values = [ ("a", 4), ("b", 5), ("c", 3), ("d", 8), ("e", 1), ] cur.executemany("INSERT INTO test VALUES(?, ?)", values) con.create_window_function("sumint", 1, WindowSumInt) cur.execute(""" SELECT x, sumint(y) OVER ( ORDER BY x ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING ) AS sum_y FROM test ORDER BY x """) print(cur.fetchall()) con.close()

source: Create a collation named *name* using the collating function *callable*. *callable* is passed two :class:`string <str>` arguments, and it should return an :class:`integer <int>`:
pt_pt: Cria uma colação com o nome *name* usando a função de colação *callable*. *callable* recebe dois argumentos :class:`string <str>`, e deve devolver um :class:`integer <int>`:

source: ``1`` if the first is ordered higher than the second
pt_pt: ``1`` se o primeiro for ordenado acima do segundo

source: ``-1`` if the first is ordered lower than the second
pt_pt: ``-1`` se o primeiro for ordenado abaixo do segundo

source: ``0`` if they are ordered equal
pt_pt: ``0`` se forem ordenados como iguais

source: The following example shows a reverse sorting collation:
pt_pt: O seguinte exemplo mostra uma colação de ordenação inversa:

source: Remove a collation function by setting *callable* to ``None``.
pt_pt: Remove uma função de colação definindo *callable* como ``None``.

source: The collation name can contain any Unicode character. Earlier, only ASCII characters were allowed.
pt_pt: O nome da colação pode conter qualquer carácter Unicode. Anteriormente, apenas caracteres ASCII eram permitidos.

source: Call this method from a different thread to abort any queries that might be executing on the connection. Aborted queries will raise an :exc:`OperationalError`.
pt_pt: Chame este método a partir de uma thread diferente para abortar quaisquer consultas que possam estar a ser executadas na ligação. As consultas abortadas lançarão um :exc:`OperationalError`.

source: Register :term:`callable` *authorizer_callback* to be invoked for each attempt to access a column of a table in the database. The callback should return one of :const:`SQLITE_OK`, :const:`SQLITE_DENY`, or :const:`SQLITE_IGNORE` to signal how access to the column should be handled by the underlying SQLite library.
pt_pt: Regista um :term:`chamável` *authorizer_callback* para ser invocado em cada tentativa de aceder a uma coluna de uma tabela na base de dados. O callback deve devolver um de :const:`SQLITE_OK`, :const:`SQLITE_DENY`, ou :const:`SQLITE_IGNORE` para sinalizar como o acesso à coluna deve ser tratado pela biblioteca SQLite subjacente.

source: Please consult the SQLite documentation about the possible values for the first argument and the meaning of the second and third argument depending on the first one. All necessary constants are available in the :mod:`!sqlite3` module.
pt_pt: Consulte a documentação do SQLite sobre os valores possíveis para o primeiro argumento e o significado do segundo e terceiro argumentos dependendo do primeiro. Todas as constantes necessárias estão disponíveis no módulo :mod:`!sqlite3`.

source: Passing ``None`` as *authorizer_callback* will disable the authorizer.
pt_pt: Passar ``None`` como *authorizer_callback* desativará o autorizador.

source: Added support for disabling the authorizer using ``None``.
pt_pt: Adicionado suporte para desativar o autorizador usando ``None``.

source: Register :term:`callable` *progress_handler* to be invoked for every *n* instructions of the SQLite virtual machine. This is useful if you want to get called from SQLite during long-running operations, for example to update a GUI.
pt_pt: Regista um :term:`chamável` *progress_handler* para ser invocado a cada *n* instruções da máquina virtual SQLite. Isto é útil se quiser ser chamado a partir do SQLite durante operações de longa duração, por exemplo, para atualizar uma GUI.

source: If you want to clear any previously installed progress handler, call the method with ``None`` for *progress_handler*.
pt_pt: Se quiser limpar qualquer gestor de progresso previamente instalado, chame o método com ``None`` para *progress_handler*.

source: Returning a non-zero value from the handler function will terminate the currently executing query and cause it to raise a :exc:`DatabaseError` exception.
pt_pt: Devolver um valor não zero a partir da função do gestor terminará a consulta atualmente em execução e fará com que lance uma exceção :exc:`DatabaseError`.

source: Register :term:`callable` *trace_callback* to be invoked for each SQL statement that is actually executed by the SQLite backend.
pt_pt: Regista um :term:`chamável` *trace_callback* para ser invocado para cada declaração SQL que é realmente executada pelo backend SQLite.
