Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sqlite3.po
Languages: pt_pt

source: :mod:`!sqlite3` --- DB-API 2.0 interface for SQLite databases
pt_pt: :mod:`!sqlite3` --- Interface DB-API 2.0 para bases de dados SQLite

source: **Source code:** :source:`Lib/sqlite3/`
pt_pt: **Código-fonte:** :source:`Lib/sqlite3/`

source: SQLite is a C library that provides a lightweight disk-based database that doesn't require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It's also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.
pt_pt: SQLite é uma biblioteca C que fornece uma base de dados baseada em disco leve que não requer um processo de servidor separado e permite aceder à base de dados usando uma variante não padrão da linguagem de consulta SQL. Algumas aplicações podem usar SQLite para armazenamento interno de dados. Também é possível prototipar uma aplicação usando SQLite e depois portar o código para uma base de dados maior, como PostgreSQL ou Oracle.

source: This document includes four main sections:
pt_pt: Este documento inclui quatro secções principais:

source: :ref:`sqlite3-tutorial` teaches how to use the :mod:`!sqlite3` module.
pt_pt: :ref:`sqlite3-tutorial` ensina como usar o módulo :mod:`!sqlite3`.

source: :ref:`sqlite3-reference` describes the classes and functions this module defines.
pt_pt: :ref:`sqlite3-reference` descreve as classes e funções que este módulo define.

source: :ref:`sqlite3-howtos` details how to handle specific tasks.
pt_pt: :ref:`sqlite3-howtos` detalha como lidar com tarefas específicas.

source: :ref:`sqlite3-explanation` provides in-depth background on transaction control.
pt_pt: :ref:`sqlite3-explanation` fornece informações detalhadas sobre o controlo de transações.

source: The SQLite web page; the documentation describes the syntax and the available data types for the supported SQL dialect.
pt_pt: A página web do SQLite; a documentação descreve a sintaxe e os tipos de dados disponíveis para o dialeto SQL suportado.

source: Tutorial, reference and examples for learning SQL syntax.
pt_pt: Tutorial, referência e exemplos para aprender a sintaxe SQL.

source: :pep:`249` - Database API Specification 2.0
pt_pt: :pep:`249` - Especificação da API de Base de Dados 2.0

source: PEP written by Marc-André Lemburg.
pt_pt: PEP escrita por Marc-André Lemburg.

source: In this tutorial, you will create a database of Monty Python movies using basic :mod:`!sqlite3` functionality. It assumes a fundamental understanding of database concepts, including `cursors`_ and `transactions`_.
pt_pt: Neste tutorial, irá criar uma base de dados de filmes Monty Python usando a funcionalidade básica do :mod:`!sqlite3`. Assume um entendimento fundamental de conceitos de bases de dados, incluindo `cursors`_ e `transactions`_.

source: First, we need to create a new database and open a database connection to allow :mod:`!sqlite3` to work with it. Call :func:`sqlite3.connect` to create a connection to the database :file:`tutorial.db` in the current working directory, implicitly creating it if it does not exist:
pt_pt: Primeiro, precisamos de criar uma nova base de dados e abrir uma ligação à base de dados para permitir que o :mod:`!sqlite3` trabalhe com ela. Chame :func:`sqlite3.connect` para criar uma ligação à base de dados :file:`tutorial.db` no diretório de trabalho atual, criando-a implicitamente se não existir:

source: The returned :class:`Connection` object ``con`` represents the connection to the on-disk database.
pt_pt: O objeto :class:`Connection` devolvido ``con`` representa a ligação à base de dados em disco.

source: In order to execute SQL statements and fetch results from SQL queries, we will need to use a database cursor. Call :meth:`con.cursor() <Connection.cursor>` to create the :class:`Cursor`:
pt_pt: Para executar declarações SQL e obter resultados de consultas SQL, precisaremos de usar um cursor de base de dados. Chame :meth:`con.cursor() <Connection.cursor>` para criar o :class:`Cursor`:

source: Now that we've got a database connection and a cursor, we can create a database table ``movie`` with columns for title, release year, and review score. For simplicity, we can just use column names in the table declaration -- thanks to the `flexible typing`_ feature of SQLite, specifying the data types is optional. Execute the ``CREATE TABLE`` statement by calling :meth:`cur.execute(...) <Cursor.execute>`:
pt_pt: Ahora que temos uma ligação à base de dados e um cursor, podemos criar uma tabela de base de dados ``movie`` com colunas para título, ano de lançamento e pontuação de revisão. Por simplicidade, podemos simplesmente usar nomes de colunas na declaração da tabela — graças à funcionalidade `flexible typing`_ do SQLite, especificar os tipos de dados é opcional. Execute a declaração ``CREATE TABLE`` chamando :meth:`cur.execute(...) <Cursor.execute>`:

source: We can verify that the new table has been created by querying the ``sqlite_master`` table built-in to SQLite, which should now contain an entry for the ``movie`` table definition (see `The Schema Table`_ for details). Execute that query by calling :meth:`cur.execute(...) <Cursor.execute>`, assign the result to ``res``, and call :meth:`res.fetchone() <Cursor.fetchone>` to fetch the resulting row:
pt_pt: Podemos verificar que a nova tabela foi criada consultando a tabela ``sqlite_master`` integrada no SQLite, que agora deve conter uma entrada para a definição da tabela ``movie`` (veja `The Schema Table`_ para detalhes). Execute essa consulta chamando :meth:`cur.execute(...) <Cursor.execute>`, atribua o resultado a ``res`` e chame :meth:`res.fetchone() <Cursor.fetchone>` para buscar a linha resultante:

source: We can see that the table has been created, as the query returns a :class:`tuple` containing the table's name. If we query ``sqlite_master`` for a non-existent table ``spam``, :meth:`!res.fetchone` will return ``None``:
pt_pt: Podemos ver que a tabela foi criada, pois a consulta devolve um :class:`tuple` contendo o nome da tabela. Se consultarmos ``sqlite_master`` por uma tabela inexistente ``spam``, :meth:`!res.fetchone` devolverá ``None``:

source: Now, add two rows of data supplied as SQL literals by executing an ``INSERT`` statement, once again by calling :meth:`cur.execute(...) <Cursor.execute>`:
pt_pt: Agora, adicione duas linhas de dados fornecidas como literais SQL executando uma declaração ``INSERT``, mais uma vez chamando :meth:`cur.execute(...) <Cursor.execute>`:

source: The ``INSERT`` statement implicitly opens a transaction, which needs to be committed before changes are saved in the database (see :ref:`sqlite3-controlling-transactions` for details). Call :meth:`con.commit() <Connection.commit>` on the connection object to commit the transaction:
pt_pt: A declaração ``INSERT`` abre implicitamente uma transação, que precisa de ser confirmada antes que as alterações sejam guardadas na base de dados (veja :ref:`sqlite3-controlling-transactions` para detalhes). Chame :meth:`con.commit() <Connection.commit>` no objeto de ligação para confirmar a transação:

source: We can verify that the data was inserted correctly by executing a ``SELECT`` query. Use the now-familiar :meth:`cur.execute(...) <Cursor.execute>` to assign the result to ``res``, and call :meth:`res.fetchall() <Cursor.fetchall>` to return all resulting rows:
pt_pt: Podemos verificar que os dados foram inseridos corretamente executando uma consulta ``SELECT``. Use o agora familiar :meth:`cur.execute(...) <Cursor.execute>` para atribuir o resultado a ``res`` e chame :meth:`res.fetchall() <Cursor.fetchall>` para devolver todas as linhas resultantes:

source: The result is a :class:`list` of two :class:`!tuple`\s, one per row, each containing that row's ``score`` value.
pt_pt: O resultado é uma :class:`list` de dois :class:`!tuple`\s, um por linha, cada um contendo o valor ``score`` dessa linha.

source: Now, insert three more rows by calling :meth:`cur.executemany(...) <Cursor.executemany>`:
pt_pt: Agora, insira mais três linhas chamando :meth:`cur.executemany(...) <Cursor.executemany>`:

source: data = [ ("Monty Python Live at the Hollywood Bowl", 1982, 7.9), ("Monty Python's The Meaning of Life", 1983, 7.5), ("Monty Python's Life of Brian", 1979, 8.0), ] cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data) con.commit() # Remember to commit the transaction after executing INSERT.
pt_pt: data = [ ("Monty Python Live at the Hollywood Bowl", 1982, 7.9), ("Monty Python's The Meaning of Life", 1983, 7.5), ("Monty Python's Life of Brian", 1979, 8.0), ] cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data) con.commit() # Lembre-se de confirmar a transação após executar INSERT.

source: Notice that ``?`` placeholders are used to bind ``data`` to the query. Always use placeholders instead of :ref:`string formatting <tut-formatting>` to bind Python values to SQL statements, to avoid `SQL injection attacks`_ (see :ref:`sqlite3-placeholders` for more details).
pt_pt: Note que os placeholders ``?`` são usados para ligar ``data`` à consulta. Use sempre placeholders em vez de :ref:`formatação de strings <tut-formatting>` para ligar valores Python a declarações SQL, para evitar `ataques de injeção SQL`_ (veja :ref:`sqlite3-placeholders` para mais detalhes).

source: We can verify that the new rows were inserted by executing a ``SELECT`` query, this time iterating over the results of the query:
pt_pt: Podemos verificar que as novas linhas foram inseridas executando uma consulta ``SELECT``, desta vez iterando sobre os resultados da consulta:

source: Each row is a two-item :class:`tuple` of ``(year, title)``, matching the columns selected in the query.
pt_pt: Cada linha é um :class:`tuple` de dois itens de ``(year, title)``, correspondendo às colunas selecionadas na consulta.

source: Finally, verify that the database has been written to disk by calling :meth:`con.close() <Connection.close>` to close the existing connection, opening a new one, creating a new cursor, then querying the database:
pt_pt: Finalmente, verifique que a base de dados foi escrita em disco chamando :meth:`con.close() <Connection.close>` para fechar a ligação existente, abrindo uma nova, criando um novo cursor e depois consultando a base de dados:

source: >>> con.close() >>> new_con = sqlite3.connect("tutorial.db") >>> new_cur = new_con.cursor() >>> res = new_cur.execute("SELECT title, year FROM movie ORDER BY score DESC") >>> title, year = res.fetchone() >>> print(f'The highest scoring Monty Python movie is {title!r}, released in {year}') The highest scoring Monty Python movie is 'Monty Python and the Holy Grail', released in 1975 >>> new_con.close()
pt_pt: >>> con.close() >>> new_con = sqlite3.connect("tutorial.db") >>> new_cur = new_con.cursor() >>> res = new_cur.execute("SELECT title, year FROM movie ORDER BY score DESC") >>> title, year = res.fetchone() >>> print(f'O filme Monty Python com maior pontuação é {title!r}, lançado em {year}') The highest scoring Monty Python movie is 'Monty Python and the Holy Grail', released in 1975 >>> new_con.close()

source: You've now created an SQLite database using the :mod:`!sqlite3` module, inserted data and retrieved values from it in multiple ways.
pt_pt: Agora criou uma base de dados SQLite usando o módulo :mod:`!sqlite3`, inseriu dados e recuperou valores dela de várias formas.

source: :ref:`sqlite3-howtos` for further reading:
pt_pt: :ref:`sqlite3-howtos` para leitura adicional:

source: :ref:`sqlite3-explanation` for in-depth background on transaction control.
pt_pt: :ref:`sqlite3-explanation` para informações detalhadas sobre o controlo de transações.

source: Reference
pt_pt: Referência

source: Module functions
pt_pt: Funções do módulo

source: Open a connection to an SQLite database.
pt_pt: Abre uma ligação a uma base de dados SQLite.

source: Parameters
pt_pt: Parâmetros

source: The path to the database file to be opened. You can pass ``":memory:"`` to create an `SQLite database existing only in memory <https://sqlite.org/inmemorydb.html>`_, and open a connection to it.
pt_pt: O caminho para o ficheiro da base de dados a ser aberto. Pode passar ``":memory:"`` para criar uma `base de dados SQLite que existe apenas em memória <https://sqlite.org/inmemorydb.html>`_, e abrir uma ligação a ela.

source: How many seconds the connection should wait before raising an :exc:`OperationalError` when a table is locked. If another connection opens a transaction to modify a table, that table will be locked until the transaction is committed. Default five seconds.
pt_pt: Quantos segundos a ligação deve esperar antes de lançar um :exc:`OperationalError` quando uma tabela está bloqueada. Se outra ligação abrir uma transação para modificar uma tabela, essa tabela ficará bloqueada até que a transação seja confirmada. Predefinição de cinco segundos.

source: Control whether and how data types not :ref:`natively supported by SQLite <sqlite3-types>` are looked up to be converted to Python types, using the converters registered with :func:`register_converter`. Set it to any combination (using ``|``, bitwise or) of :const:`PARSE_DECLTYPES` and :const:`PARSE_COLNAMES` to enable this. Column names takes precedence over declared types if both flags are set. By default (``0``), type detection is disabled.
pt_pt: Controla se e como os tipos de dados não :ref:`nativamente suportados pelo SQLite <sqlite3-types>` são procurados para serem convertidos em tipos Python, usando os conversores registados com :func:`register_converter`. Defina-o para qualquer combinação (usando ``|``, ou bit a bit) de :const:`PARSE_DECLTYPES` e :const:`PARSE_COLNAMES` para ativar isto. Os nomes das colunas têm precedência sobre os tipos declarados se ambas as flags estiverem definidas. Por predefinição (``0``), a deteção de tipos está desativada.

source: Control legacy transaction handling behaviour. See :attr:`Connection.isolation_level` and :ref:`sqlite3-transaction-control-isolation-level` for more information. Can be ``"DEFERRED"`` (default), ``"EXCLUSIVE"`` or ``"IMMEDIATE"``; or ``None`` to disable opening transactions implicitly. Has no effect unless :attr:`Connection.autocommit` is set to :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL` (the default).
pt_pt: Controla o comportamento de manipulação de transações legado. Veja :attr:`Connection.isolation_level` e :ref:`sqlite3-transaction-control-isolation-level` para mais informações. Pode ser ``"DEFERRED"`` (predefinição), ``"EXCLUSIVE"`` ou ``"IMMEDIATE"``; ou ``None`` para desativar a abertura de transações implicitamente. Não tem efeito a menos que :attr:`Connection.autocommit` esteja definido para :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL` (a predefinição).

source: If ``True`` (default), :exc:`ProgrammingError` will be raised if the database connection is used by a thread other than the one that created it. If ``False``, the connection may be accessed in multiple threads; write operations may need to be serialized by the user to avoid data corruption. See :attr:`threadsafety` for more information.
pt_pt: Se ``True`` (predefinição), :exc:`ProgrammingError` será lançado se a ligação à base de dados for usada por uma thread diferente da que a criou. Se ``False``, a ligação pode ser acedida em múltiplas threads; operações de escrita podem precisar de ser serializadas pelo utilizador para evitar corrupção de dados. Veja :attr:`threadsafety` para mais informações.

source: A custom subclass of :class:`Connection` to create the connection with, if not the default :class:`Connection` class.
pt_pt: Uma subclasse personalizada de :class:`Connection` para criar a ligação, se não for a classe :class:`Connection` predefinida.

source: The number of statements that :mod:`!sqlite3` should internally cache for this connection, to avoid parsing overhead. By default, 128 statements.
pt_pt: O número de declarações que o :mod:`!sqlite3` deve armazenar em cache internamente para esta ligação, para evitar sobrecarga de análise. Por predefinição, 128 declarações.

source: If set to ``True``, *database* is interpreted as a :abbr:`URI (Uniform Resource Identifier)` with a file path and an optional query string. The scheme part *must* be ``"file:"``, and the path can be relative or absolute. The query string allows passing parameters to SQLite, enabling various :ref:`sqlite3-uri-tricks`.
pt_pt: Se definido como ``True``, *database* é interpretado como um :abbr:`URI (Uniform Resource Identifier)` com um caminho de ficheiro e uma string de consulta opcional. A parte do esquema *deve* ser ``"file:"``, e o caminho pode ser relativo ou absoluto. A string de consulta permite passar parâmetros para o SQLite, ativando vários :ref:`sqlite3-uri-tricks`.

source: Control :pep:`249` transaction handling behaviour. See :attr:`Connection.autocommit` and :ref:`sqlite3-transaction-control-autocommit` for more information. *autocommit* currently defaults to :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL`. The default will change to ``False`` in a future Python release.
pt_pt: Controla o comportamento de manipulação de transações :pep:`249`. Veja :attr:`Connection.autocommit` e :ref:`sqlite3-transaction-control-autocommit` para mais informações. *autocommit* atualmente tem como predefinição :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL`. A predefinição mudará para ``False`` numa futura versão do Python.

source: Return type
pt_pt: Tipo de retorno

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect`` with argument ``database``.
pt_pt: Gera um :ref:`evento de auditoria <auditing>` ``sqlite3.connect`` com o argumento ``database``.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect/handle`` with argument ``connection_handle``.
pt_pt: Gera um :ref:`evento de auditoria <auditing>` ``sqlite3.connect/handle`` com o argumento ``connection_handle``.

source: Added the *uri* parameter.
pt_pt: Adicionado o parâmetro *uri*.

source: *database* can now also be a :term:`path-like object`, not only a string.
pt_pt: *database* agora também pode ser um :term:`objeto tipo caminho`, não apenas uma string.

source: Added the ``sqlite3.connect/handle`` auditing event.
pt_pt: Adicionado o evento de auditoria ``sqlite3.connect/handle``.

source: Added the *autocommit* parameter.
pt_pt: Adicionado o parâmetro *autocommit*.

source: Return ``True`` if the string *statement* appears to contain one or more complete SQL statements. No syntactic verification or parsing of any kind is performed, other than checking that there are no unclosed string literals and the statement is terminated by a semicolon.
pt_pt: Devolve ``True`` se a string *statement* parecer conter uma ou mais declarações SQL completas. Não é realizada nenhuma verificação sintática ou análise de qualquer tipo, além de verificar que não há literais de string não fechados e que a declaração é terminada por um ponto e vírgula.

source: For example:
pt_pt: Por exemplo:

source: This function may be useful during command-line input to determine if the entered text seems to form a complete SQL statement, or if additional input is needed before calling :meth:`~Cursor.execute`.
pt_pt: Esta função pode ser útil durante a entrada de linha de comando para determinar se o texto inserido parece formar uma declaração SQL completa, ou se é necessária entrada adicional antes de chamar :meth:`~Cursor.execute`.

source: See :func:`!runsource` in :source:`Lib/sqlite3/__main__.py` for real-world use.
pt_pt: Veja :func:`!runsource` em :source:`Lib/sqlite3/__main__.py` para uso no mundo real.

source: Enable or disable callback tracebacks. By default you will not get any tracebacks in user-defined functions, aggregates, converters, authorizer callbacks etc. If you want to debug them, you can call this function with *flag* set to ``True``. Afterwards, you will get tracebacks from callbacks on :data:`sys.stderr`. Use ``False`` to disable the feature again.
pt_pt: Ativar ou desativar tracebacks de callback. Por predefinição, não obterá tracebacks em funções definidas pelo utilizador, agregados, conversores, callbacks de autorização, etc. Se quiser depurá-los, pode chamar esta função com *flag* definido como ``True``. Depois, obterá tracebacks de callbacks em :data:`sys.stderr`. Use ``False`` para desativar a funcionalidade novamente.

source: Errors in user-defined function callbacks are logged as unraisable exceptions. Use an :func:`unraisable hook handler <sys.unraisablehook>` for introspection of the failed callback.
pt_pt: Erros em callbacks de funções definidas pelo utilizador são registados como exceções não lançáveis. Use um :func:`gestor de hook não lançável <sys.unraisablehook>` para introspeção do callback falhado.

source: Register an *adapter* :term:`callable` to adapt the Python type *type* into an SQLite type. The adapter is called with a Python object of type *type* as its sole argument, and must return a value of a :ref:`type that SQLite natively understands <sqlite3-types>`.
pt_pt: Regista um *adapter* :term:`chamável` para adaptar o tipo Python *type* num tipo SQLite. O adaptador é chamado com um objeto Python do tipo *type* como seu único argumento e deve devolver um valor de um :ref:`tipo que o SQLite entende nativamente <sqlite3-types>`.

source: Register the *converter* :term:`callable` to convert SQLite objects of type *typename* into a Python object of a specific type. The converter is invoked for all SQLite values of type *typename*; it is passed a :class:`bytes` object and should return an object of the desired Python type. Consult the parameter *detect_types* of :func:`connect` for information regarding how type detection works.
pt_pt: Regista o *conversor* :term:`chamável` para converter objetos SQLite do tipo *typename* num objeto Python de um tipo específico. O conversor é invocado para todos os valores SQLite do tipo *typename*; recebe um objeto :class:`bytes` e deve devolver um objeto do tipo Python desejado. Consulte o parâmetro *detect_types* de :func:`connect` para informações sobre como funciona a deteção de tipos.

source: Note: *typename* and the name of the type in your query are matched case-insensitively.
pt_pt: Nota: *typename* e o nome do tipo na sua consulta são comparados sem distinção entre maiúsculas e minúsculas.

source: Module constants
pt_pt: Constantes do módulo

source: Set :attr:`~Connection.autocommit` to this constant to select old style (pre-Python 3.12) transaction control behaviour. See :ref:`sqlite3-transaction-control-isolation-level` for more information.
pt_pt: Defina :attr:`~Connection.autocommit` para esta constante para selecionar o comportamento antigo de controlo de transações (pré-Python 3.12). Veja :ref:`sqlite3-transaction-control-isolation-level` para mais informações.

source: Pass this flag value to the *detect_types* parameter of :func:`connect` to look up a converter function using the declared types for each column. The types are declared when the database table is created. :mod:`!sqlite3` will look up a converter function using the first word of the declared type as the converter dictionary key. For example:
pt_pt: Passe este valor de flag para o parâmetro *detect_types* de :func:`connect` para procurar uma função de conversão usando os tipos declarados para cada coluna. Os tipos são declarados quando a tabela da base de dados é criada. :mod:`!sqlite3` procurará uma função de conversão usando a primeira palavra do tipo declarado como a chave do dicionário de conversores. Por exemplo:
