Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sqlite3.po
Languages: pt_pt

source: The only argument passed to the callback is the statement (as :class:`str`) that is being executed. The return value of the callback is ignored. Note that the backend does not only run statements passed to the :meth:`Cursor.execute` methods. Other sources include the :ref:`transaction management <sqlite3-controlling-transactions>` of the :mod:`!sqlite3` module and the execution of triggers defined in the current database.
pt_pt: O único argumento passado ao callback é a declaração (como :class:`str`) que está a ser executada. O valor de retorno do callback é ignorado. Note que o backend não executa apenas declarações passadas aos métodos :meth:`Cursor.execute`. Outras fontes incluem a :ref:`gestão de transações <sqlite3-controlling-transactions>` do módulo :mod:`!sqlite3` e a execução de gatilhos definidos na base de dados atual.

source: Passing ``None`` as *trace_callback* will disable the trace callback.
pt_pt: Passar ``None`` como *trace_callback* desativará o callback de rastreamento.

source: Exceptions raised in the trace callback are not propagated. As a development and debugging aid, use :meth:`~sqlite3.enable_callback_tracebacks` to enable printing tracebacks from exceptions raised in the trace callback.
pt_pt: Exceções lançadas no callback de rastreamento não são propagadas. Como auxílio de desenvolvimento e depuração, use :meth:`~sqlite3.enable_callback_tracebacks` para ativar a impressão de tracebacks de exceções lançadas no callback de rastreamento.

source: Enable the SQLite engine to load SQLite extensions from shared libraries if *enabled* is ``True``; else, disallow loading SQLite extensions. SQLite extensions can define new functions, aggregates or whole new virtual table implementations. One well-known extension is the fulltext-search extension distributed with SQLite.
pt_pt: Permite que o motor SQLite carregue extensões SQLite a partir de bibliotecas partilhadas se *enabled* for ``True``; caso contrário, impede o carregamento de extensões SQLite. As extensões SQLite podem definir novas funções, agregados ou implementações inteiras de novas tabelas virtuais. Uma extensão bem conhecida é a extensão de pesquisa de texto completo distribuída com o SQLite.

source: The :mod:`!sqlite3` module is not built with loadable extension support by default, because some platforms (notably macOS) have SQLite libraries which are compiled without this feature. To get loadable extension support, you must pass the :option:`--enable-loadable-sqlite-extensions` option to :program:`configure`.
pt_pt: O módulo :mod:`!sqlite3` não é construído com suporte para extensões carregáveis por predefinição, porque algumas plataformas (notavelmente macOS) têm bibliotecas SQLite que são compiladas sem esta funcionalidade. Para obter suporte para extensões carregáveis, deve passar a opção :option:`--enable-loadable-sqlite-extensions` para :program:`configure`.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.enable_load_extension`` with arguments ``connection``, ``enabled``.
pt_pt: Gera um :ref:`evento de auditoria <auditing>` ``sqlite3.enable_load_extension`` com argumentos ``connection``, ``enabled``.

source: Added the ``sqlite3.enable_load_extension`` auditing event.
pt_pt: Adicionado o evento de auditoria ``sqlite3.enable_load_extension``.

source: con.enable_load_extension(True) # Load the fulltext search extension con.execute("select load_extension('./fts3.so')") # alternatively you can load the extension using an API call: # con.load_extension("./fts3.so") # disable extension loading again con.enable_load_extension(False) # example from SQLite wiki con.execute("CREATE VIRTUAL TABLE recipe USING fts3(name, ingredients)") con.executescript(""" INSERT INTO recipe (name, ingredients) VALUES('broccoli stew', 'broccoli peppers cheese tomatoes'); INSERT INTO recipe (name, ingredients) VALUES('pumpkin stew', 'pumpkin onions garlic celery'); INSERT INTO recipe (name, ingredients) VALUES('broccoli pie', 'broccoli cheese onions flour'); INSERT INTO recipe (name, ingredients) VALUES('pumpkin pie', 'pumpkin sugar flour butter'); """) for row in con.execute("SELECT rowid, name, ingredients FROM recipe WHERE name MATCH 'pie'"): print(row)
pt_pt: con.enable_load_extension(True) # Carregar a extensão de pesquisa de texto completo con.execute("select load_extension('./fts3.so')") # alternativamente pode carregar a extensão usando uma chamada de API: # con.load_extension("./fts3.so") # desativar o carregamento de extensões novamente con.enable_load_extension(False) # exemplo da wiki do SQLite con.execute("CREATE VIRTUAL TABLE recipe USING fts3(name, ingredients)") con.executescript(""" INSERT INTO recipe (name, ingredients) VALUES('broccoli stew', 'broccoli peppers cheese tomatoes'); INSERT INTO recipe (name, ingredients) VALUES('pumpkin stew', 'pumpkin onions garlic celery'); INSERT INTO recipe (name, ingredients) VALUES('broccoli pie', 'broccoli cheese onions flour'); INSERT INTO recipe (name, ingredients) VALUES('pumpkin pie', 'pumpkin sugar flour butter'); """) for row in con.execute("SELECT rowid, name, ingredients FROM recipe WHERE name MATCH 'pie'"): print(row)

source: Load an SQLite extension from a shared library. Enable extension loading with :meth:`enable_load_extension` before calling this method.
pt_pt: Carrega uma extensão SQLite a partir de uma biblioteca partilhada. Ative o carregamento de extensões com :meth:`enable_load_extension` antes de chamar este método.

source: The path to the SQLite extension.
pt_pt: O caminho para a extensão SQLite.

source: Entry point name. If ``None`` (the default), SQLite will come up with an entry point name of its own; see the SQLite docs `Loading an Extension`_ for details.
pt_pt: Nome do ponto de entrada. Se ``None`` (predefinição), o SQLite criará um nome de ponto de entrada próprio; veja a documentação do SQLite `Loading an Extension`_ para detalhes.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.load_extension`` with arguments ``connection``, ``path``.
pt_pt: Gera um :ref:`evento de auditoria <auditing>` ``sqlite3.load_extension`` com argumentos ``connection``, ``path``.

source: Added the ``sqlite3.load_extension`` auditing event.
pt_pt: Adicionado o evento de auditoria ``sqlite3.load_extension``.

source: Added the *entrypoint* parameter.
pt_pt: Adicionado o parâmetro *entrypoint*.

source: Return an :term:`iterator` to dump the database as SQL source code. Useful when saving an in-memory database for later restoration. Similar to the ``.dump`` command in the :program:`sqlite3` shell.
pt_pt: Devolve um :term:`iterador` para despejar a base de dados como código-fonte SQL. Útil ao guardar uma base de dados em memória para restauração posterior. Semelhante ao comando ``.dump`` na shell :program:`sqlite3`.

source: # Convert file example.db to SQL dump file dump.sql con = sqlite3.connect('example.db') with open('dump.sql', 'w') as f: for line in con.iterdump(): f.write('%s\n' % line) con.close()
pt_pt: # Converter ficheiro example.db para ficheiro de despejo SQL dump.sql con = sqlite3.connect('example.db') with open('dump.sql', 'w') as f: for line in con.iterdump(): f.write('%s\n' % line) con.close()

source: Create a backup of an SQLite database.
pt_pt: Cria uma cópia de segurança de uma base de dados SQLite.

source: Works even if the database is being accessed by other clients or concurrently by the same connection.
pt_pt: Funciona mesmo se a base de dados estiver a ser acedida por outros clientes ou concorrentemente pela mesma ligação.

source: The database connection to save the backup to.
pt_pt: A ligação à base de dados para onde salvar a cópia de segurança.

source: The number of pages to copy at a time. If equal to or less than ``0``, the entire database is copied in a single step. Defaults to ``-1``.
pt_pt: O número de páginas a copiar de cada vez. Se igual ou inferior a ``0``, toda a base de dados é copiada num único passo. Predefinição é ``-1``.

source: If set to a :term:`callable`, it is invoked with three integer arguments for every backup iteration: the *status* of the last iteration, the *remaining* number of pages still to be copied, and the *total* number of pages. Defaults to ``None``.
pt_pt: Se definido como um :term:`chamável`, é invocado com três argumentos inteiros para cada iteração de cópia de segurança: o *status* da última iteração, o número *remaining* de páginas ainda a copiar, e o número *total* de páginas. Predefinição é ``None``.

source: The name of the database to back up. Either ``"main"`` (the default) for the main database, ``"temp"`` for the temporary database, or the name of a custom database as attached using the ``ATTACH DATABASE`` SQL statement.
pt_pt: O nome da base de dados para fazer cópia de segurança. Ou ``"main"`` (predefinição) para a base de dados principal, ``"temp"`` para a base de dados temporária, ou o nome de uma base de dados personalizada como anexada usando a declaração SQL ``ATTACH DATABASE``.

source: The number of seconds to sleep between successive attempts to back up remaining pages.
pt_pt: O número de segundos a dormir entre tentativas sucessivas para fazer cópia de segurança das páginas restantes.

source: Example 1, copy an existing database into another:
pt_pt: Exemplo 1, copiar uma base de dados existente para outra:

source: def progress(status, remaining, total): print(f'Copied {total-remaining} of {total} pages...') src = sqlite3.connect('example.db') dst = sqlite3.connect('backup.db') with dst: src.backup(dst, pages=1, progress=progress) dst.close() src.close()
pt_pt: def progress(status, remaining, total): print(f'Copiadas {total-remaining} de {total} páginas...') src = sqlite3.connect('example.db') dst = sqlite3.connect('backup.db') with dst: src.backup(dst, pages=1, progress=progress) dst.close() src.close()

source: Example 2, copy an existing database into a transient copy:
pt_pt: Exemplo 2, copiar uma base de dados existente para uma cópia transitória:

source: Get a connection runtime limit.
pt_pt: Obtém um limite de tempo de execução de uma ligação.

source: The `SQLite limit category`_ to be queried.
pt_pt: A `categoria de limite SQLite`_ a ser consultada.

source: If *category* is not recognised by the underlying SQLite library.
pt_pt: Se *category* não for reconhecida pela biblioteca SQLite subjacente.

source: Example, query the maximum length of an SQL statement for :class:`Connection` ``con`` (the default is 1000000000):
pt_pt: Exemplo, consultar o comprimento máximo de uma declaração SQL para :class:`Connection` ``con`` (a predefinição é 1000000000):

source: Set a connection runtime limit. Attempts to increase a limit above its hard upper bound are silently truncated to the hard upper bound. Regardless of whether or not the limit was changed, the prior value of the limit is returned.
pt_pt: Define um limite de tempo de execução de uma ligação. Tentativas de aumentar um limite acima do seu limite superior rígido são silenciosamente truncadas para o limite superior rígido. Independentemente de o limite ter sido alterado ou não, o valor anterior do limite é devolvido.

source: The `SQLite limit category`_ to be set.
pt_pt: A `categoria de limite SQLite`_ a ser definida.

source: The value of the new limit. If negative, the current limit is unchanged.
pt_pt: O valor do novo limite. Se negativo, o limite atual permanece inalterado.

source: Example, limit the number of attached databases to 1 for :class:`Connection` ``con`` (the default limit is 10):
pt_pt: Exemplo, limitar o número de bases de dados anexadas a 1 para :class:`Connection` ``con`` (o limite predefinido é 10):

source: Query a boolean connection configuration option.
pt_pt: Consulta uma opção de configuração booleana de ligação.

source: A :ref:`SQLITE_DBCONFIG code <sqlite3-dbconfig-constants>`.
pt_pt: Um :ref:`código SQLITE_DBCONFIG <sqlite3-dbconfig-constants>`.

source: Set a boolean connection configuration option.
pt_pt: Define uma opção de configuração booleana de ligação.

source: ``True`` if the configuration option should be enabled (default); ``False`` if it should be disabled.
pt_pt: ``True`` se a opção de configuração deve ser ativada (predefinição); ``False`` se deve ser desativada.

source: Serialize a database into a :class:`bytes` object. For an ordinary on-disk database file, the serialization is just a copy of the disk file. For an in-memory database or a "temp" database, the serialization is the same sequence of bytes which would be written to disk if that database were backed up to disk.
pt_pt: Serializa uma base de dados num objeto :class:`bytes`. Para um ficheiro de base de dados em disco normal, a serialização é apenas uma cópia do ficheiro em disco. Para uma base de dados em memória ou uma base de dados "temp", a serialização é a mesma sequência de bytes que seria escrita em disco se essa base de dados fosse guardada em disco.

source: The database name to be serialized. Defaults to ``"main"``.
pt_pt: O nome da base de dados a ser serializada. Predefinição é ``"main"``.

source: This method is only available if the underlying SQLite library has the serialize API.
pt_pt: Este método só está disponível se a biblioteca SQLite subjacente tiver a API serialize.

source: Deserialize a :meth:`serialized <serialize>` database into a :class:`Connection`. This method causes the database connection to disconnect from database *name*, and reopen *name* as an in-memory database based on the serialization contained in *data*.
pt_pt: Desserializa uma base de dados :meth:`serializada <serialize>` numa :class:`Connection`. Este método faz com que a ligação à base de dados se desconecte da base de dados *name* e reabra *name* como uma base de dados em memória baseada na serialização contida em *data*.

source: A serialized database.
pt_pt: Uma base de dados serializada.

source: The database name to deserialize into. Defaults to ``"main"``.
pt_pt: O nome da base de dados para desserializar. Predefinição é ``"main"``.

source: If the database connection is currently involved in a read transaction or a backup operation.
pt_pt: Se a ligação à base de dados estiver atualmente envolvida numa transação de leitura ou numa operação de cópia de segurança.

source: If *data* does not contain a valid SQLite database.
pt_pt: Se *data* não contiver uma base de dados SQLite válida.

source: If :func:`len(data) <len>` is larger than ``2**63 - 1``.
pt_pt: Se :func:`len(data) <len>` for maior que ``2**63 - 1``.

source: This method is only available if the underlying SQLite library has the deserialize API.
pt_pt: Este método só está disponível se a biblioteca SQLite subjacente tiver a API deserialize.

source: This attribute controls :pep:`249`-compliant transaction behaviour. :attr:`!autocommit` has three allowed values:
pt_pt: Este atributo controla o comportamento de transações compatível com :pep:`249`. :attr:`!autocommit` tem três valores permitidos:

source: ``False``: Select :pep:`249`-compliant transaction behaviour, implying that :mod:`!sqlite3` ensures a transaction is always open. Use :meth:`commit` and :meth:`rollback` to close transactions.
pt_pt: ``False``: Seleciona o comportamento de transações compatível com :pep:`249`, implicando que :mod:`!sqlite3` garante que uma transação está sempre aberta. Use :meth:`commit` e :meth:`rollback` para fechar transações.

source: This is the recommended value of :attr:`!autocommit`.
pt_pt: Este é o valor recomendado de :attr:`!autocommit`.

source: ``True``: Use SQLite's `autocommit mode`_. :meth:`commit` and :meth:`rollback` have no effect in this mode.
pt_pt: ``True``: Usa o `modo autocommit`_ do SQLite. :meth:`commit` e :meth:`rollback` não têm efeito neste modo.

source: :data:`LEGACY_TRANSACTION_CONTROL`: Pre-Python 3.12 (non-:pep:`249`-compliant) transaction control. See :attr:`isolation_level` for more details.
pt_pt: :data:`LEGACY_TRANSACTION_CONTROL`: Controlo de transações pré-Python 3.12 (não compatível com :pep:`249`). Veja :attr:`isolation_level` para mais detalhes.

source: This is currently the default value of :attr:`!autocommit`.
pt_pt: Este é atualmente o valor predefinido de :attr:`!autocommit`.

source: Changing :attr:`!autocommit` to ``False`` will open a new transaction, and changing it to ``True`` will commit any pending transaction.
pt_pt: Alterar :attr:`!autocommit` para ``False`` abrirá uma nova transação, e alterá-lo para ``True`` confirmará qualquer transação pendente.

source: See :ref:`sqlite3-transaction-control-autocommit` for more details.
pt_pt: Veja :ref:`sqlite3-transaction-control-autocommit` para mais detalhes.

source: The :attr:`isolation_level` attribute has no effect unless :attr:`autocommit` is :data:`LEGACY_TRANSACTION_CONTROL`.
pt_pt: O atributo :attr:`isolation_level` não tem efeito a menos que :attr:`autocommit` seja :data:`LEGACY_TRANSACTION_CONTROL`.

source: This read-only attribute corresponds to the low-level SQLite `autocommit mode`_.
pt_pt: Este atributo de apenas leitura corresponde ao modo autocommit de baixo nível do SQLite.

source: ``True`` if a transaction is active (there are uncommitted changes), ``False`` otherwise.
pt_pt: ``True`` se uma transação estiver ativa (há alterações não confirmadas), ``False`` caso contrário.

source: Controls the :ref:`legacy transaction handling mode <sqlite3-transaction-control-isolation-level>` of :mod:`!sqlite3`. If set to ``None``, transactions are never implicitly opened. If set to one of ``"DEFERRED"``, ``"IMMEDIATE"``, or ``"EXCLUSIVE"``, corresponding to the underlying `SQLite transaction behaviour`_, :ref:`implicit transaction management <sqlite3-transaction-control-isolation-level>` is performed.
pt_pt: Controla o :ref:`modo de manipulação de transações legado <sqlite3-transaction-control-isolation-level>` do :mod:`!sqlite3`. Se definido como ``None``, as transações nunca são abertas implicitamente. Se definido como um de ``"DEFERRED"``, ``"IMMEDIATE"``, ou ``"EXCLUSIVE"``, correspondendo ao comportamento de transação subjacente `SQLite transaction behaviour`_, é realizada a :ref:`gestão implícita de transações <sqlite3-transaction-control-isolation-level>`.

source: If not overridden by the *isolation_level* parameter of :func:`connect`, the default is ``""``, which is an alias for ``"DEFERRED"``.
pt_pt: Se não for substituído pelo parâmetro *isolation_level* de :func:`connect`, a predefinição é ``""``, que é um alias para ``"DEFERRED"``.

source: Using :attr:`autocommit` to control transaction handling is recommended over using :attr:`!isolation_level`. :attr:`!isolation_level` has no effect unless :attr:`autocommit` is set to :data:`LEGACY_TRANSACTION_CONTROL` (the default).
pt_pt: Recomenda-se o uso de :attr:`autocommit` para controlar a manipulação de transações em vez de usar :attr:`!isolation_level`. :attr:`!isolation_level` não tem efeito a menos que :attr:`autocommit` esteja definido para :data:`LEGACY_TRANSACTION_CONTROL` (a predefinição).

source: The initial :attr:`~Cursor.row_factory` for :class:`Cursor` objects created from this connection. Assigning to this attribute does not affect the :attr:`!row_factory` of existing cursors belonging to this connection, only new ones. Is ``None`` by default, meaning each row is returned as a :class:`tuple`.
pt_pt: A :attr:`~Cursor.row_factory` inicial para objetos :class:`Cursor` criados a partir desta ligação. Atribuir a este atributo não afeta a :attr:`!row_factory` de cursores existentes pertencentes a esta ligação, apenas os novos. É ``None`` por predefinição, o que significa que cada linha é devolvida como um :class:`tuple`.

source: See :ref:`sqlite3-howto-row-factory` for more details.
pt_pt: Veja :ref:`sqlite3-howto-row-factory` para mais detalhes.

source: A :term:`callable` that accepts a :class:`bytes` parameter and returns a text representation of it. The callable is invoked for SQLite values with the ``TEXT`` data type. By default, this attribute is set to :class:`str`.
pt_pt: Um :term:`chamável` que aceita um parâmetro :class:`bytes` e devolve uma representação de texto do mesmo. O chamável é invocado para valores SQLite com o tipo de dados ``TEXT``. Por predefinição, este atributo está definido para :class:`str`.

source: See :ref:`sqlite3-howto-encoding` for more details.
pt_pt: Veja :ref:`sqlite3-howto-encoding` para mais detalhes.

source: Return the total number of database rows that have been modified, inserted, or deleted since the database connection was opened.
pt_pt: Devolve o número total de linhas de base de dados que foram modificadas, inseridas ou eliminadas desde que a ligação à base de dados foi aberta.

source: Cursor objects
pt_pt: Objetos Cursor

source: A ``Cursor`` object represents a `database cursor`_ which is used to execute SQL statements, and manage the context of a fetch operation. Cursors are created using :meth:`Connection.cursor`, or by using any of the :ref:`connection shortcut methods <sqlite3-connection-shortcuts>`.
pt_pt: Um objeto ``Cursor`` representa um `cursor de base de dados`_ que é usado para executar declarações SQL e gerir o contexto de uma operação de busca. Os cursores são criados usando :meth:`Connection.cursor`, ou usando qualquer um dos :ref:`métodos de atalho de ligação <sqlite3-connection-shortcuts>`.

source: Cursor objects are :term:`iterators <iterator>`, meaning that if you :meth:`~Cursor.execute` a ``SELECT`` query, you can simply iterate over the cursor to fetch the resulting rows:
pt_pt: Os objetos Cursor são :term:`iteradores <iterator>`, o que significa que se executar uma consulta ``SELECT`` com :meth:`~Cursor.execute`, pode simplesmente iterar sobre o cursor para buscar as linhas resultantes:

source: A :class:`Cursor` instance has the following attributes and methods.
pt_pt: Uma instância :class:`Cursor` tem os seguintes atributos e métodos.

source: Execute a single SQL statement, optionally binding Python values using :ref:`placeholders <sqlite3-placeholders>`.
pt_pt: Executa uma única declaração SQL, opcionalmente ligando valores Python usando :ref:`placeholders <sqlite3-placeholders>`.

source: A single SQL statement.
pt_pt: Uma única declaração SQL.

source: Python values to bind to placeholders in *sql*. A :class:`!dict` if named placeholders are used. A :term:`!sequence` if unnamed placeholders are used. See :ref:`sqlite3-placeholders`.
pt_pt: Valores Python para ligar a placeholders em *sql*. Um :class:`!dict` se forem usados placeholders nomeados. Uma :term:`!sequence` se forem usados placeholders não nomeados. Veja :ref:`sqlite3-placeholders`.

source: If :attr:`~Connection.autocommit` is :data:`LEGACY_TRANSACTION_CONTROL`, :attr:`~Connection.isolation_level` is not ``None``, *sql* is an ``INSERT``, ``UPDATE``, ``DELETE``, or ``REPLACE`` statement, and there is no open transaction, a transaction is implicitly opened before executing *sql*.
pt_pt: Se :attr:`~Connection.autocommit` for :data:`LEGACY_TRANSACTION_CONTROL`, :attr:`~Connection.isolation_level` não for ``None``, *sql* for uma declaração ``INSERT``, ``UPDATE``, ``DELETE``, ou ``REPLACE``, e não houver nenhuma transação aberta, uma transação é implicitamente aberta antes de executar *sql*.

source: Use :meth:`executescript` to execute multiple SQL statements.
pt_pt: Use :meth:`executescript` para executar múltiplas declarações SQL.

source: For every item in *parameters*, repeatedly execute the :ref:`parameterized <sqlite3-placeholders>` :abbr:`DML (Data Manipulation Language)` SQL statement *sql*.
pt_pt: Para cada item em *parameters*, execute repetidamente a declaração SQL :abbr:`DML (Data Manipulation Language)` :ref:`parametrizada <sqlite3-placeholders>` *sql*.

source: Uses the same implicit transaction handling as :meth:`~Cursor.execute`.
pt_pt: Usa o mesmo manuseamento implícito de transações que :meth:`~Cursor.execute`.
