Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sqlite3.po
Languages: pt_pt

source: :class:`!Row` provides indexed and case-insensitive named access to columns, with minimal memory overhead and performance impact over a :class:`!tuple`. To use :class:`!Row` as a row factory, assign it to the :attr:`!row_factory` attribute:
pt_pt: :class:`!Row` fornece acesso indexado e nomeado (sem distinção de maiúsculas/minúsculas) às colunas, com sobrecarga mínima de memória e impacto de desempenho sobre um :class:`!tuple`. Para usar :class:`!Row` como fábrica de linhas, atribua-o ao atributo :attr:`!row_factory`:

source: Queries now return :class:`!Row` objects:
pt_pt: As consultas agora devolvem objetos :class:`!Row`:

source: >>> res = con.execute("SELECT 'Earth' AS name, 6378 AS radius") >>> row = res.fetchone() >>> row.keys() ['name', 'radius'] >>> row[0] # Access by index. 'Earth' >>> row["name"] # Access by name. 'Earth' >>> row["RADIUS"] # Column names are case-insensitive. 6378 >>> con.close()
pt_pt: >>> res = con.execute("SELECT 'Terra' AS nome, 6378 AS raio") >>> linha = res.fetchone() >>> linha.keys() ['nome', 'raio'] >>> linha[0] # Acesso por índice. 'Terra' >>> linha["nome"] # Acesso por nome. 'Terra' >>> linha["RAIO"] # Os nomes das colunas não distinguem maiúsculas de minúsculas. 6378 >>> con.close()

source: The ``FROM`` clause can be omitted in the ``SELECT`` statement, as in the above example. In such cases, SQLite returns a single row with columns defined by expressions, e.g. literals, with the given aliases ``expr AS alias``.
pt_pt: A cláusula ``FROM`` pode ser omitida na declaração ``SELECT``, como no exemplo acima. Nesses casos, o SQLite devolve uma única linha com colunas definidas por expressões, por exemplo, literais, com os alias dados ``expr AS alias``.

source: You can create a custom :attr:`~Cursor.row_factory` that returns each row as a :class:`dict`, with column names mapped to values:
pt_pt: Pode criar uma :attr:`~Cursor.row_factory` personalizada que devolve cada linha como um :class:`dict`, com os nomes das colunas mapeados para os valores:

source: def dict_factory(cursor, row): fields = [column[0] for column in cursor.description] return {key: value for key, value in zip(fields, row)}
pt_pt: def fabrica_dict(cursor, linha): campos = [coluna[0] for coluna in cursor.description] return {chave: valor for chave, valor in zip(campos, linha)}

source: Using it, queries now return a :class:`!dict` instead of a :class:`!tuple`:
pt_pt: Usando-a, as consultas agora devolvem um :class:`!dict` em vez de um :class:`!tuple`:

source: >>> con = sqlite3.connect(":memory:") >>> con.row_factory = dict_factory >>> for row in con.execute("SELECT 1 AS a, 2 AS b"): ... print(row) {'a': 1, 'b': 2} >>> con.close()
pt_pt: >>> con = sqlite3.connect(":memory:") >>> con.row_factory = fabrica_dict >>> for linha in con.execute("SELECT 1 AS a, 2 AS b"): ... print(linha) {'a': 1, 'b': 2} >>> con.close()

source: The following row factory returns a :term:`named tuple`:
pt_pt: A seguinte fábrica de linhas devolve um :term:`tuplo nomeado`:

source: from collections import namedtuple def namedtuple_factory(cursor, row): fields = [column[0] for column in cursor.description] cls = namedtuple("Row", fields) return cls._make(row)
pt_pt: from collections import namedtuple def fabrica_namedtuple(cursor, linha): campos = [coluna[0] for coluna in cursor.description] cls = namedtuple("Linha", campos) return cls._make(linha)

source: :func:`!namedtuple_factory` can be used as follows:
pt_pt: :func:`!namedtuple_factory` pode ser usada da seguinte forma:

source: >>> con = sqlite3.connect(":memory:") >>> con.row_factory = namedtuple_factory >>> cur = con.execute("SELECT 1 AS a, 2 AS b") >>> row = cur.fetchone() >>> row Row(a=1, b=2) >>> row[0] # Indexed access. 1 >>> row.b # Attribute access. 2 >>> con.close()
pt_pt: >>> con = sqlite3.connect(":memory:") >>> con.row_factory = fabrica_namedtuple >>> cur = con.execute("SELECT 1 AS a, 2 AS b") >>> linha = cur.fetchone() >>> linha Linha(a=1, b=2) >>> linha[0] # Acesso por índice. 1 >>> linha.b # Acesso por atributo. 2 >>> con.close()

source: With some adjustments, the above recipe can be adapted to use a :class:`~dataclasses.dataclass`, or any other custom class, instead of a :class:`~collections.namedtuple`.
pt_pt: Com alguns ajustes, a receita acima pode ser adaptada para usar uma :class:`~dataclasses.dataclass`, ou qualquer outra classe personalizada, em vez de um :class:`~collections.namedtuple`.

source: How to handle non-UTF-8 text encodings
pt_pt: Como lidar com codificações de texto não UTF-8

source: By default, :mod:`!sqlite3` uses :class:`str` to adapt SQLite values with the ``TEXT`` data type. This works well for UTF-8 encoded text, but it might fail for other encodings and invalid UTF-8. You can use a custom :attr:`~Connection.text_factory` to handle such cases.
pt_pt: Por predefinição, :mod:`!sqlite3` usa :class:`str` para adaptar valores SQLite com o tipo de dados ``TEXT``. Isto funciona bem para texto codificado em UTF-8, mas pode falhar para outras codificações e UTF-8 inválido. Pode usar uma :attr:`~Connection.text_factory` personalizada para lidar com tais casos.

source: Because of SQLite's `flexible typing`_, it is not uncommon to encounter table columns with the ``TEXT`` data type containing non-UTF-8 encodings, or even arbitrary data. To demonstrate, let's assume we have a database with ISO-8859-2 (Latin-2) encoded text, for example a table of Czech-English dictionary entries. Assuming we now have a :class:`Connection` instance :py:data:`!con` connected to this database, we can decode the Latin-2 encoded text using this :attr:`~Connection.text_factory`:
pt_pt: Devido à `tipagem flexível`_ do SQLite, não é incomum encontrar colunas de tabelas com o tipo de dados ``TEXT`` contendo codificações não UTF-8, ou mesmo dados arbitrários. Para demonstrar, vamos assumir que temos uma base de dados com texto codificado em ISO-8859-2 (Latin-2), por exemplo, uma tabela de entradas de dicionário Checo-Inglês. Assumindo que agora temos uma instância :class:`Connection` :py:data:`!con` ligada a esta base de dados, podemos decodificar o texto codificado em Latin-2 usando esta :attr:`~Connection.text_factory`:

source: For invalid UTF-8 or arbitrary data in stored in ``TEXT`` table columns, you can use the following technique, borrowed from the :ref:`unicode-howto`:
pt_pt: Para dados UTF-8 inválidos ou arbitrários armazenados em colunas de tabelas ``TEXT``, pode usar a seguinte técnica, retirada do :ref:`unicode-howto`:

source: The :mod:`!sqlite3` module API does not support strings containing surrogates.
pt_pt: A API do módulo :mod:`!sqlite3` não suporta strings contendo substitutos.

source: Explanation
pt_pt: Explicação

source: Transaction control
pt_pt: Controlo de transações

source: :mod:`!sqlite3` offers multiple methods of controlling whether, when and how database transactions are opened and closed. :ref:`sqlite3-transaction-control-autocommit` is recommended, while :ref:`sqlite3-transaction-control-isolation-level` retains the pre-Python 3.12 behaviour.
pt_pt: :mod:`!sqlite3` oferece vários métodos de controlar quando e como as transações de base de dados são abertas e fechadas. :ref:`sqlite3-transaction-control-autocommit` é recomendado, enquanto :ref:`sqlite3-transaction-control-isolation-level` mantém o comportamento pré-Python 3.12.

source: Transaction control via the ``autocommit`` attribute
pt_pt: Controlo de transações através do atributo ``autocommit``

source: The recommended way of controlling transaction behaviour is through the :attr:`Connection.autocommit` attribute, which should preferably be set using the *autocommit* parameter of :func:`connect`.
pt_pt: A forma recomendada de controlar o comportamento de transações é através do atributo :attr:`Connection.autocommit`, que deve ser definido preferencialmente usando o parâmetro *autocommit* de :func:`connect`.

source: It is suggested to set *autocommit* to ``False``, which implies :pep:`249`-compliant transaction control. This means:
pt_pt: É sugerido definir *autocommit* como ``False``, o que implica controlo de transações compatível com :pep:`249`. Isto significa:

source: :mod:`!sqlite3` ensures that a transaction is always open, so :func:`connect`, :meth:`Connection.commit`, and :meth:`Connection.rollback` will implicitly open a new transaction (immediately after closing the pending one, for the latter two). :mod:`!sqlite3` uses ``BEGIN DEFERRED`` statements when opening transactions.
pt_pt: :mod:`!sqlite3` garante que uma transação está sempre aberta, por isso :func:`connect`, :meth:`Connection.commit` e :meth:`Connection.rollback` abrirão implicitamente uma nova transação (imediatamente após fechar a pendente, para as duas últimas). :mod:`!sqlite3` usa declarações ``BEGIN DEFERRED`` ao abrir transações.

source: Transactions should be committed explicitly using :meth:`!commit`.
pt_pt: As transações devem ser confirmadas explicitamente usando :meth:`!commit`.

source: Transactions should be rolled back explicitly using :meth:`!rollback`.
pt_pt: As transações devem ser revertidas explicitamente usando :meth:`!rollback`.

source: An implicit rollback is performed if the database is :meth:`~Connection.close`-ed with pending changes.
pt_pt: Uma reversão implícita é realizada se a base de dados for :meth:`~Connection.close` com alterações pendentes.

source: Set *autocommit* to ``True`` to enable SQLite's `autocommit mode`_. In this mode, :meth:`Connection.commit` and :meth:`Connection.rollback` have no effect. Note that SQLite's autocommit mode is distinct from the :pep:`249`-compliant :attr:`Connection.autocommit` attribute; use :attr:`Connection.in_transaction` to query the low-level SQLite autocommit mode.
pt_pt: Defina *autocommit* como ``True`` para ativar o `modo autocommit`_ do SQLite. Neste modo, :meth:`Connection.commit` e :meth:`Connection.rollback` não têm efeito. Note que o modo autocommit do SQLite é distinto do atributo :pep:`249`-compatível :attr:`Connection.autocommit`; use :attr:`Connection.in_transaction` para consultar o modo autocommit de baixo nível do SQLite.

source: Set *autocommit* to :data:`LEGACY_TRANSACTION_CONTROL` to leave transaction control behaviour to the :attr:`Connection.isolation_level` attribute. See :ref:`sqlite3-transaction-control-isolation-level` for more information.
pt_pt: Defina *autocommit* para :data:`LEGACY_TRANSACTION_CONTROL` para deixar o comportamento de controlo de transações ao atributo :attr:`Connection.isolation_level`. Veja :ref:`sqlite3-transaction-control-isolation-level` para mais informações.

source: Transaction control via the ``isolation_level`` attribute
pt_pt: Controlo de transações através do atributo ``isolation_level``

source: The recommended way of controlling transactions is via the :attr:`~Connection.autocommit` attribute. See :ref:`sqlite3-transaction-control-autocommit`.
pt_pt: A forma recomendada de controlar transações é através do atributo :attr:`~Connection.autocommit`. Veja :ref:`sqlite3-transaction-control-autocommit`.

source: If :attr:`Connection.autocommit` is set to :data:`LEGACY_TRANSACTION_CONTROL` (the default), transaction behaviour is controlled using the :attr:`Connection.isolation_level` attribute. Otherwise, :attr:`!isolation_level` has no effect.
pt_pt: Se :attr:`Connection.autocommit` estiver definido para :data:`LEGACY_TRANSACTION_CONTROL` (predefinição), o comportamento da transação é controlado usando o atributo :attr:`Connection.isolation_level`. Caso contrário, :attr:`!isolation_level` não tem efeito.

source: If the connection attribute :attr:`~Connection.isolation_level` is not ``None``, new transactions are implicitly opened before :meth:`~Cursor.execute` and :meth:`~Cursor.executemany` executes ``INSERT``, ``UPDATE``, ``DELETE``, or ``REPLACE`` statements; for other statements, no implicit transaction handling is performed. Use the :meth:`~Connection.commit` and :meth:`~Connection.rollback` methods to respectively commit and roll back pending transactions. You can choose the underlying `SQLite transaction behaviour`_ — that is, whether and what type of ``BEGIN`` statements :mod:`!sqlite3` implicitly executes – via the :attr:`~Connection.isolation_level` attribute.
pt_pt: Se o atributo de ligação :attr:`~Connection.isolation_level` não for ``None``, novas transações são implicitamente abertas antes de :meth:`~Cursor.execute` e :meth:`~Cursor.executemany` executarem declarações ``INSERT``, ``UPDATE``, ``DELETE`` ou ``REPLACE``; para outras declarações, nenhum manuseamento implícito de transações é realizado. Use os métodos :meth:`~Connection.commit` e :meth:`~Connection.rollback` para confirmar e reverter, respetivamente, transações pendentes. Pode escolher o comportamento de transação subjacente `SQLite transaction behaviour`_ — ou seja, se e que tipo de declarações ``BEGIN`` o :mod:`!sqlite3` executa implicitamente — através do atributo :attr:`~Connection.isolation_level`.

source: If :attr:`~Connection.isolation_level` is set to ``None``, no transactions are implicitly opened at all. This leaves the underlying SQLite library in `autocommit mode`_, but also allows the user to perform their own transaction handling using explicit SQL statements. The underlying SQLite library autocommit mode can be queried using the :attr:`~Connection.in_transaction` attribute.
pt_pt: Se :attr:`~Connection.isolation_level` estiver definido como ``None``, nenhuma transação é implicitamente aberta. Isto deixa a biblioteca SQLite subjacente em `modo autocommit`_, mas também permite ao utilizador realizar o seu próprio manuseamento de transações usando declarações SQL explícitas. O modo autocommit da biblioteca SQLite subjacente pode ser consultado usando o atributo :attr:`~Connection.in_transaction`.

source: The :meth:`~Cursor.executescript` method implicitly commits any pending transaction before execution of the given SQL script, regardless of the value of :attr:`~Connection.isolation_level`.
pt_pt: O método :meth:`~Cursor.executescript` confirma implicitamente qualquer transação pendente antes da execução do script SQL dado, independentemente do valor de :attr:`~Connection.isolation_level`.

source: :mod:`!sqlite3` used to implicitly commit an open transaction before DDL statements. This is no longer the case.
pt_pt: :mod:`!sqlite3` costumava confirmar implicitamente uma transação aberta antes de declarações DDL. Isto já não acontece.

source: The recommended way of controlling transactions is now via the :attr:`~Connection.autocommit` attribute.
pt_pt: A forma recomendada de controlar transações é agora através do atributo :attr:`~Connection.autocommit`.

source: ? (question mark)
pt_pt: ? (ponto de interrogação)

source: in SQL statements
pt_pt: em declarações SQL

source: : (colon)
pt_pt: : (dois pontos)
