Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: When a client connects, you'll call :meth:`accept` on the socket to get the new socket from the other end, and use the context's :meth:`SSLContext.wrap_socket` method to create a server-side SSL socket for the connection::
pt_pt: Quando um cliente se liga, chamará :meth:`accept` no socket para obter o novo socket da outra extremidade e usará o método :meth:`SSLContext.wrap_socket` do contexto para criar um socket SSL do lado do servidor para a ligação::

source: Then you'll read data from the ``connstream`` and do something with it till you are finished with the client (or the client is finished with you)::
pt_pt: Depois, lerá dados de ``connstream`` e fará algo com eles até terminar com o cliente (ou o cliente terminar consigo)::

source: def deal_with_client(connstream): data = connstream.recv(1024) # empty data means the client is finished with us while data: if not do_something(connstream, data): # we'll assume do_something returns False # when we're finished with client break data = connstream.recv(1024) # finished with client
pt_pt: def deal_with_client(connstream): data = connstream.recv(1024) # dados vazios significam que o cliente terminou connosco while data: if not do_something(connstream, data): # assumiremos que do_something retorna False # quando terminarmos com o cliente break data = connstream.recv(1024) # terminado com o cliente

source: And go back to listening for new client connections (of course, a real server would probably handle each client connection in a separate thread, or put the sockets in :ref:`non-blocking mode <ssl-nonblocking>` and use an event loop).
pt_pt: E volte a escutar por novas ligações de clientes (claro que um servidor real provavelmente trataria cada ligação de cliente numa thread separada, ou colocaria os sockets em :ref:`modo não bloqueante <ssl-nonblocking>` e usaria um ciclo de eventos).

source: Notes on non-blocking sockets
pt_pt: Notas sobre sockets não bloqueantes

source: SSL sockets behave slightly different than regular sockets in non-blocking mode. When working with non-blocking sockets, there are thus several things you need to be aware of:
pt_pt: Os sockets SSL comportam-se ligeiramente de forma diferente dos sockets normais em modo não bloqueante. Ao trabalhar com sockets não bloqueantes, há várias coisas que precisa de ter em conta:

source: Most :class:`SSLSocket` methods will raise either :exc:`SSLWantWriteError` or :exc:`SSLWantReadError` instead of :exc:`BlockingIOError` if an I/O operation would block. :exc:`SSLWantReadError` will be raised if a read operation on the underlying socket is necessary, and :exc:`SSLWantWriteError` for a write operation on the underlying socket. Note that attempts to *write* to an SSL socket may require *reading* from the underlying socket first, and attempts to *read* from the SSL socket may require a prior *write* to the underlying socket.
pt_pt: A maioria dos métodos :class:`SSLSocket` levantará :exc:`SSLWantWriteError` ou :exc:`SSLWantReadError` em vez de :exc:`BlockingIOError` se uma operação de I/O bloquear. :exc:`SSLWantReadError` será levantado se uma operação de leitura no socket subjacente for necessária, e :exc:`SSLWantWriteError` para uma operação de escrita no socket subjacente. Note que as tentativas de *escrever* num socket SSL podem exigir *ler* primeiro do socket subjacente, e as tentativas de *ler* de um socket SSL podem exigir uma *escrita* prévia no socket subjacente.

source: In earlier Python versions, the :meth:`!SSLSocket.send` method returned zero instead of raising :exc:`SSLWantWriteError` or :exc:`SSLWantReadError`.
pt_pt: Em versões anteriores do Python, o método :meth:`!SSLSocket.send` retornava zero em vez de levantar :exc:`SSLWantWriteError` ou :exc:`SSLWantReadError`.

source: Calling :func:`~select.select` tells you that the OS-level socket can be read from (or written to), but it does not imply that there is sufficient data at the upper SSL layer. For example, only part of an SSL frame might have arrived. Therefore, you must be ready to handle :meth:`SSLSocket.recv` and :meth:`SSLSocket.send` failures, and retry after another call to :func:`~select.select`.
pt_pt: Chamar :func:`~select.select` indica que o socket a nível do sistema operativo pode ser lido (ou escrito), mas não implica que haja dados suficientes na camada SSL superior. Por exemplo, apenas parte de um quadro SSL pode ter chegado. Portanto, deve estar preparado para lidar com falhas em :meth:`SSLSocket.recv` e :meth:`SSLSocket.send`, e tentar novamente após outra chamada a :func:`~select.select`.

source: Conversely, since the SSL layer has its own framing, a SSL socket may still have data available for reading without :func:`~select.select` being aware of it. Therefore, you should first call :meth:`SSLSocket.recv` to drain any potentially available data, and then only block on a :func:`~select.select` call if still necessary.
pt_pt: Por outro lado, uma vez que a camada SSL tem a sua própria estruturação, um socket SSL pode ainda ter dados disponíveis para leitura sem que :func:`~select.select` esteja ciente disso. Portanto, deve primeiro chamar :meth:`SSLSocket.recv` para esgotar quaisquer dados potencialmente disponíveis e só depois bloquear numa chamada :func:`~select.select`, se ainda for necessário.

source: (of course, similar provisions apply when using other primitives such as :func:`~select.poll`, or those in the :mod:`selectors` module)
pt_pt: (claro, disposições semelhantes aplicam-se ao usar outras primitivas como :func:`~select.poll`, ou aquelas no módulo :mod:`selectors`)

source: The SSL handshake itself will be non-blocking: the :meth:`SSLSocket.do_handshake` method has to be retried until it returns successfully. Here is a synopsis using :func:`~select.select` to wait for the socket's readiness::
pt_pt: O próprio handshake SSL será não bloqueante: o método :meth:`SSLSocket.do_handshake` tem de ser repetido até que retorne com sucesso. Aqui está um resumo usando :func:`~select.select` para esperar pela prontidão do socket::

source: The :mod:`asyncio` module supports :ref:`non-blocking SSL sockets <ssl-nonblocking>` and provides a higher level :ref:`Streams API <asyncio-streams>`. It polls for events using the :mod:`selectors` module and handles :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` and :exc:`BlockingIOError` exceptions. It runs the SSL handshake asynchronously as well.
pt_pt: O módulo :mod:`asyncio` suporta :ref:`sockets SSL não bloqueantes <ssl-nonblocking>` e fornece uma API de nível superior :ref:`Streams <asyncio-streams>`. Faz polling de eventos usando o módulo :mod:`selectors` e lida com as exceções :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` e :exc:`BlockingIOError`. Também executa o handshake SSL de forma assíncrona.

source: Memory BIO Support
pt_pt: Suporte para Memory BIO

source: Ever since the SSL module was introduced in Python 2.6, the :class:`SSLSocket` class has provided two related but distinct areas of functionality:
pt_pt: Desde que o módulo SSL foi introduzido no Python 2.6, a classe :class:`SSLSocket` tem fornecido duas áreas de funcionalidade relacionadas, mas distintas:

source: SSL protocol handling
pt_pt: Manipulação do protocolo SSL

source: Network IO
pt_pt: I/O de rede

source: The network IO API is identical to that provided by :class:`socket.socket`, from which :class:`SSLSocket` also inherits. This allows an SSL socket to be used as a drop-in replacement for a regular socket, making it very easy to add SSL support to an existing application.
pt_pt: A API de I/O de rede é idêntica à fornecida por :class:`socket.socket`, da qual :class:`SSLSocket` também herda. Isto permite que um socket SSL seja usado como um substituto direto para um socket normal, tornando muito fácil adicionar suporte SSL a uma aplicação existente.

source: Combining SSL protocol handling and network IO usually works well, but there are some cases where it doesn't. An example is async IO frameworks that want to use a different IO multiplexing model than the "select/poll on a file descriptor" (readiness based) model that is assumed by :class:`socket.socket` and by the internal OpenSSL socket IO routines. This is mostly relevant for platforms like Windows where this model is not efficient. For this purpose, a reduced scope variant of :class:`SSLSocket` called :class:`SSLObject` is provided.
pt_pt: Combinar a manipulação do protocolo SSL e I/O de rede geralmente funciona bem, mas há alguns casos em que não funciona. Um exemplo são os frameworks de I/O assíncrona que querem usar um modelo de multiplexação de I/O diferente do modelo "select/poll num descritor de ficheiro" (baseado em prontidão) que é assumido por :class:`socket.socket` e pelas rotinas internas de I/O de socket do OpenSSL. Isto é principalmente relevante para plataformas como o Windows, onde este modelo não é eficiente. Para este propósito, é fornecida uma variante de âmbito reduzido de :class:`SSLSocket` chamada :class:`SSLObject`.

source: A reduced-scope variant of :class:`SSLSocket` representing an SSL protocol instance that does not contain any network IO methods. This class is typically used by framework authors that want to implement asynchronous IO for SSL through memory buffers.
pt_pt: Uma variante de âmbito reduzido de :class:`SSLSocket` que representa uma instância de protocolo SSL que não contém quaisquer métodos de I/O de rede. Esta classe é tipicamente usada por autores de frameworks que desejam implementar I/O assíncrona para SSL através de buffers de memória.

source: This class implements an interface on top of a low-level SSL object as implemented by OpenSSL. This object captures the state of an SSL connection but does not provide any network IO itself. IO needs to be performed through separate "BIO" objects which are OpenSSL's IO abstraction layer.
pt_pt: Esta classe implementa uma interface sobre um objeto SSL de baixo nível, conforme implementado pelo OpenSSL. Este objeto captura o estado de uma ligação SSL, mas não fornece qualquer I/O de rede por si só. A I/O precisa de ser realizada através de objetos "BIO" separados, que são a camada de abstração de I/O do OpenSSL.

source: This class has no public constructor. An :class:`SSLObject` instance must be created using the :meth:`~SSLContext.wrap_bio` method. This method will create the :class:`SSLObject` instance and bind it to a pair of BIOs. The *incoming* BIO is used to pass data from Python to the SSL protocol instance, while the *outgoing* BIO is used to pass data the other way around.
pt_pt: Esta classe não tem um construtor público. Uma instância de :class:`SSLObject` deve ser criada usando o método :meth:`~SSLContext.wrap_bio`. Este método criará a instância :class:`SSLObject` e associá-la-á a um par de BIOs. O BIO *incoming* é usado para passar dados de Python para a instância do protocolo SSL, enquanto o BIO *outgoing* é usado para passar dados na outra direção.

source: The following methods are available:
pt_pt: Os seguintes métodos estão disponíveis:

source: When compared to :class:`SSLSocket`, this object lacks the following features:
pt_pt: Em comparação com :class:`SSLSocket`, este objeto não possui as seguintes funcionalidades:

source: Any form of network IO; ``recv()`` and ``send()`` read and write only to the underlying :class:`MemoryBIO` buffers.
pt_pt: Qualquer forma de I/O de rede; ``recv()`` e ``send()`` leem e escrevem apenas para os buffers :class:`MemoryBIO` subjacentes.

source: There is no *do_handshake_on_connect* machinery. You must always manually call :meth:`~SSLSocket.do_handshake` to start the handshake.
pt_pt: Não existe maquinaria *do_handshake_on_connect*. Deve sempre chamar manualmente :meth:`~SSLSocket.do_handshake` para iniciar o handshake.

source: There is no handling of *suppress_ragged_eofs*. All end-of-file conditions that are in violation of the protocol are reported via the :exc:`SSLEOFError` exception.
pt_pt: Não existe tratamento de *suppress_ragged_eofs*. Todas as condições de fim-de-ficheiro que violam o protocolo são reportadas através da exceção :exc:`SSLEOFError`.

source: The method :meth:`~SSLSocket.unwrap` call does not return anything, unlike for an SSL socket where it returns the underlying socket.
pt_pt: A chamada ao método :meth:`~SSLSocket.unwrap` não retorna nada, ao contrário de um socket SSL, onde retorna o socket subjacente.

source: The *server_name_callback* callback passed to :meth:`SSLContext.set_servername_callback` will get an :class:`SSLObject` instance instead of a :class:`SSLSocket` instance as its first parameter.
pt_pt: A função de retorno de chamada *server_name_callback* passada para :meth:`SSLContext.set_servername_callback` receberá uma instância de :class:`SSLObject` em vez de uma instância de :class:`SSLSocket` como seu primeiro parâmetro.

source: Some notes related to the use of :class:`SSLObject`:
pt_pt: Algumas notas relacionadas com o uso de :class:`SSLObject`:

source: All IO on an :class:`SSLObject` is :ref:`non-blocking <ssl-nonblocking>`. This means that for example :meth:`~SSLSocket.read` will raise an :exc:`SSLWantReadError` if it needs more data than the incoming BIO has available.
pt_pt: Todo o I/O num :class:`SSLObject` é :ref:`não bloqueante <ssl-nonblocking>`. Isto significa que, por exemplo, :meth:`~SSLSocket.read` levantará um :exc:`SSLWantReadError` se precisar de mais dados do que os disponíveis no BIO de entrada.

source: :class:`SSLObject` instances must be created with :meth:`~SSLContext.wrap_bio`. In earlier versions, it was possible to create instances directly. This was never documented or officially supported.
pt_pt: As instâncias de :class:`SSLObject` devem ser criadas com :meth:`~SSLContext.wrap_bio`. Em versões anteriores, era possível criar instâncias diretamente. Isto nunca foi documentado nem oficialmente suportado.

source: An SSLObject communicates with the outside world using memory buffers. The class :class:`MemoryBIO` provides a memory buffer that can be used for this purpose. It wraps an OpenSSL memory BIO (Basic IO) object:
pt_pt: Um SSLObject comunica com o mundo exterior usando buffers de memória. A classe :class:`MemoryBIO` fornece um buffer de memória que pode ser usado para este propósito. Envolve um objeto OpenSSL memory BIO (Basic IO):

source: A memory buffer that can be used to pass data between Python and an SSL protocol instance.
pt_pt: Um buffer de memória que pode ser usado para passar dados entre Python e uma instância de protocolo SSL.

source: Return the number of bytes currently in the memory buffer.
pt_pt: Retorna o número de bytes atualmente no buffer de memória.

source: A boolean indicating whether the memory BIO is current at the end-of-file position.
pt_pt: Um booleano que indica se o BIO de memória está atualmente na posição de fim-de-ficheiro.

source: Read up to *n* bytes from the memory buffer. If *n* is not specified or negative, all bytes are returned.
pt_pt: Lê até *n* bytes do buffer de memória. Se *n* não for especificado ou for negativo, todos os bytes são retornados.

source: Write the bytes from *buf* to the memory BIO. The *buf* argument must be an object supporting the buffer protocol.
pt_pt: Escreve os bytes de *buf* para o BIO de memória. O argumento *buf* deve ser um objeto que suporte o protocolo de buffer.

source: The return value is the number of bytes written, which is always equal to the length of *buf*.
pt_pt: O valor de retorno é o número de bytes escritos, que é sempre igual ao comprimento de *buf*.

source: Write an EOF marker to the memory BIO. After this method has been called, it is illegal to call :meth:`~MemoryBIO.write`. The attribute :attr:`eof` will become true after all data currently in the buffer has been read.
pt_pt: Escreve um marcador de EOF no BIO de memória. Depois de este método ter sido chamado, é ilegal chamar :meth:`~MemoryBIO.write`. O atributo :attr:`eof` tornar-se-á verdadeiro depois de todos os dados atualmente no buffer terem sido lidos.

source: SSL session
pt_pt: Sessão SSL

source: Session object used by :attr:`~SSLSocket.session`.
pt_pt: Objeto de sessão usado por :attr:`~SSLSocket.session`.

source: Security considerations
pt_pt: Considerações de segurança

source: Best defaults
pt_pt: Melhores predefinições

source: For **client use**, if you don't have any special requirements for your security policy, it is highly recommended that you use the :func:`create_default_context` function to create your SSL context. It will load the system's trusted CA certificates, enable certificate validation and hostname checking, and try to choose reasonably secure protocol and cipher settings.
pt_pt: Para **uso do cliente**, se não tiver requisitos especiais para a sua política de segurança, é altamente recomendado que utilize a função :func:`create_default_context` para criar o seu contexto SSL. Esta carregará os certificados CA confiáveis do sistema, ativará a validação de certificados e a verificação de nomes de host, e tentará escolher configurações de protocolo e cifras razoavelmente seguras.

source: For example, here is how you would use the :class:`smtplib.SMTP` class to create a trusted, secure connection to a SMTP server::
pt_pt: Por exemplo, aqui está como usaria a classe :class:`smtplib.SMTP` para criar uma ligação segura e confiável a um servidor SMTP::

source: If a client certificate is needed for the connection, it can be added with :meth:`SSLContext.load_cert_chain`.
pt_pt: Se um certificado de cliente for necessário para a ligação, pode ser adicionado com :meth:`SSLContext.load_cert_chain`.

source: By contrast, if you create the SSL context by calling the :class:`SSLContext` constructor yourself, it will not have certificate validation nor hostname checking enabled by default. If you do so, please read the paragraphs below to achieve a good security level.
pt_pt: Por outro lado, se criar o contexto SSL chamando o construtor :class:`SSLContext` você mesmo, não terá validação de certificados nem verificação de nomes de host ativadas por predefinição. Se o fizer, leia os parágrafos abaixo para alcançar um bom nível de segurança.

source: Manual settings
pt_pt: Configurações manuais

source: Verifying certificates
pt_pt: Verificação de certificados

source: When calling the :class:`SSLContext` constructor directly, :const:`CERT_NONE` is the default. Since it does not authenticate the other peer, it can be insecure, especially in client mode where most of the time you would like to ensure the authenticity of the server you're talking to. Therefore, when in client mode, it is highly recommended to use :const:`CERT_REQUIRED`. However, it is in itself not sufficient; you also have to check that the server certificate, which can be obtained by calling :meth:`SSLSocket.getpeercert`, matches the desired service. For many protocols and applications, the service can be identified by the hostname. This common check is automatically performed when :attr:`SSLContext.check_hostname` is enabled.
pt_pt: Ao chamar diretamente o construtor :class:`SSLContext`, :const:`CERT_NONE` é o predefinido. Uma vez que não autentica o outro par, pode ser inseguro, especialmente no modo cliente, onde a maior parte do tempo gostaria de garantir a autenticidade do servidor com o qual está a comunicar. Portanto, quando no modo cliente, é altamente recomendado usar :const:`CERT_REQUIRED`. No entanto, por si só não é suficiente; também tem de verificar se o certificado do servidor, que pode ser obtido chamando :meth:`SSLSocket.getpeercert`, corresponde ao serviço desejado. Para muitos protocolos e aplicações, o serviço pode ser identificado pelo nome de host. Esta verificação comum é realizada automaticamente quando :attr:`SSLContext.check_hostname` está ativado.

source: Hostname matchings is now performed by OpenSSL. Python no longer uses :func:`!match_hostname`.
pt_pt: A correspondência de nomes de host é agora realizada pelo OpenSSL. O Python já não usa :func:`!match_hostname`.

source: In server mode, if you want to authenticate your clients using the SSL layer (rather than using a higher-level authentication mechanism), you'll also have to specify :const:`CERT_REQUIRED` and similarly check the client certificate.
pt_pt: Em modo servidor, se quiser autenticar os seus clientes usando a camada SSL (em vez de usar um mecanismo de autenticação de nível superior), também terá de especificar :const:`CERT_REQUIRED` e verificar de forma semelhante o certificado do cliente.

source: Protocol versions
pt_pt: Versões de protocolo

source: SSL versions 2 and 3 are considered insecure and are therefore dangerous to use. If you want maximum compatibility between clients and servers, it is recommended to use :const:`PROTOCOL_TLS_CLIENT` or :const:`PROTOCOL_TLS_SERVER` as the protocol version. SSLv2 and SSLv3 are disabled by default.
pt_pt: As versões SSL 2 e 3 são consideradas inseguras e, portanto, perigosas de usar. Se pretender a máxima compatibilidade entre clientes e servidores, é recomendado usar :const:`PROTOCOL_TLS_CLIENT` ou :const:`PROTOCOL_TLS_SERVER` como a versão do protocolo. SSLv2 e SSLv3 estão desativados por predefinição.

source: The SSL context created above will only allow TLSv1.3 and later (if supported by your system) connections to a server. :const:`PROTOCOL_TLS_CLIENT` implies certificate validation and hostname checks by default. You have to load certificates into the context.
pt_pt: O contexto SSL criado acima permitirá apenas ligações TLSv1.3 e posteriores (se suportado pelo seu sistema) a um servidor. :const:`PROTOCOL_TLS_CLIENT` implica validação de certificados e verificações de nome de host por predefinição. Tem de carregar certificados no contexto.

source: Cipher selection
pt_pt: Seleção de cifras

source: If you have advanced security requirements, fine-tuning of the ciphers enabled when negotiating a SSL session is possible through the :meth:`SSLContext.set_ciphers` method. Starting from Python 3.2.3, the ssl module disables certain weak ciphers by default, but you may want to further restrict the cipher choice. Be sure to read OpenSSL's documentation about the `cipher list format <https://docs.openssl.org/1.1.1/man1/ciphers/#cipher-list-format>`_. If you want to check which ciphers are enabled by a given cipher list, use :meth:`SSLContext.get_ciphers` or the ``openssl ciphers`` command on your system.
pt_pt: Se tiver requisitos avançados de segurança, o ajuste fino das cifras ativadas ao negociar uma sessão SSL é possível através do método :meth:`SSLContext.set_ciphers`. A partir do Python 3.2.3, o módulo ssl desativa certas cifras fracas por predefinição, mas pode querer restringir ainda mais a escolha de cifras. Certifique-se de ler a documentação do OpenSSL sobre o `formato da lista de cifras <https://docs.openssl.org/1.1.1/man1/ciphers/#cipher-list-format>`_. Se quiser verificar quais cifras estão ativadas por uma determinada lista de cifras, use :meth:`SSLContext.get_ciphers` ou o comando ``openssl ciphers`` no seu sistema.

source: Multi-processing
pt_pt: Multiprocessamento
