Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: Requests post-handshake authentication (PHA) from a TLS 1.3 client. PHA can only be initiated for a TLS 1.3 connection from a server-side socket, after the initial TLS handshake and with PHA enabled on both sides, see :attr:`SSLContext.post_handshake_auth`.
pt_pt: Solicita autenticação pós-handshake (PHA) de um cliente TLS 1.3. A PHA só pode ser iniciada para uma ligação TLS 1.3 a partir de um socket do lado do servidor, após o handshake TLS inicial e com PHA ativada em ambos os lados; consulte :attr:`SSLContext.post_handshake_auth`.

source: The method does not perform a cert exchange immediately. The server-side sends a CertificateRequest during the next write event and expects the client to respond with a certificate on the next read event.
pt_pt: O método não executa uma troca de certificados imediatamente. O lado do servidor envia um CertificateRequest durante o próximo evento de escrita e espera que o cliente responda com um certificado no próximo evento de leitura.

source: If any precondition isn't met (e.g. not TLS 1.3, PHA not enabled), an :exc:`SSLError` is raised.
pt_pt: Se qualquer pré-condição não for cumprida (por exemplo, não é TLS 1.3, PHA não ativada), é levantado um :exc:`SSLError`.

source: Only available with OpenSSL 1.1.1 and TLS 1.3 enabled. Without TLS 1.3 support, the method raises :exc:`NotImplementedError`.
pt_pt: Disponível apenas com OpenSSL 1.1.1 e TLS 1.3 ativado. Sem suporte para TLS 1.3, o método levanta :exc:`NotImplementedError`.

source: Return the actual SSL protocol version negotiated by the connection as a string, or ``None`` if no secure connection is established. As of this writing, possible return values include ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` and ``"TLSv1.2"``. Recent OpenSSL versions may define more return values.
pt_pt: Retorna a versão do protocolo SSL negociada pela ligação como uma string, ou ``None`` se nenhuma ligação segura estiver estabelecida. Atualmente, os valores de retorno possíveis incluem ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` e ``"TLSv1.2"``. Versões recentes do OpenSSL podem definir mais valores de retorno.

source: Returns the number of already decrypted bytes available for read, pending on the connection.
pt_pt: Retorna o número de bytes já desencriptados disponíveis para leitura, pendentes na ligação.

source: The :class:`SSLContext` object this SSL socket is tied to.
pt_pt: O objeto :class:`SSLContext` ao qual este socket SSL está associado.

source: A boolean which is ``True`` for server-side sockets and ``False`` for client-side sockets.
pt_pt: Um booleano que é ``True`` para sockets do lado do servidor e ``False`` para sockets do lado do cliente.

source: Hostname of the server: :class:`str` type, or ``None`` for server-side socket or if the hostname was not specified in the constructor.
pt_pt: Nome de host do servidor: tipo :class:`str`, ou ``None`` para socket do lado do servidor ou se o nome de host não tiver sido especificado no construtor.

source: The attribute is now always ASCII text. When ``server_hostname`` is an internationalized domain name (IDN), this attribute now stores the A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``).
pt_pt: O atributo é agora sempre texto ASCII. Quando ``server_hostname`` é um nome de domínio internacionalizado (IDN), este atributo armazena agora a forma A-label (``"xn--pythn-mua.org"``), em vez da forma U-label (``"pythön.org"``).

source: The :class:`SSLSession` for this SSL connection. The session is available for client and server side sockets after the TLS handshake has been performed. For client sockets the session can be set before :meth:`~SSLSocket.do_handshake` has been called to reuse a session.
pt_pt: A :class:`SSLSession` para esta ligação SSL. A sessão está disponível para sockets do lado do cliente e do servidor após o handshake TLS ter sido executado. Para sockets do cliente, a sessão pode ser definida antes de :meth:`~SSLSocket.do_handshake` ser chamada para reutilizar uma sessão.

source: SSL Contexts
pt_pt: Contexto SSL

source: An SSL context holds various data longer-lived than single SSL connections, such as SSL configuration options, certificate(s) and private key(s). It also manages a cache of SSL sessions for server-side sockets, in order to speed up repeated connections from the same clients.
pt_pt: Um contexto SSL contém vários dados com uma vida útil maior do que ligações SSL individuais, como opções de configuração SSL, certificado(s) e chave(s) privada(s). Também gere uma cache de sessões SSL para sockets do lado do servidor, a fim de acelerar ligações repetidas dos mesmos clientes.

source: Create a new SSL context. You may pass *protocol* which must be one of the ``PROTOCOL_*`` constants defined in this module. The parameter specifies which version of the SSL protocol to use. Typically, the server chooses a particular protocol version, and the client must adapt to the server's choice. Most of the versions are not interoperable with the other versions. If not specified, the default is :data:`PROTOCOL_TLS`; it provides the most compatibility with other versions.
pt_pt: Cria um novo contexto SSL. Pode passar *protocol*, que deve ser uma das constantes ``PROTOCOL_*`` definidas neste módulo. O parâmetro especifica qual a versão do protocolo SSL a usar. Normalmente, o servidor escolhe uma versão específica do protocolo, e o cliente deve adaptar-se à escolha do servidor. A maioria das versões não é interoperável com as outras versões. Se não for especificado, o predefinido é :data:`PROTOCOL_TLS`; fornece a maior compatibilidade com outras versões.

source: Here's a table showing which versions in a client (down the side) can connect to which versions in a server (along the top):
pt_pt: Aqui está uma tabela mostrando quais versões num cliente (no lado) podem ligar-se a quais versões num servidor (no topo):

source: *client* / **server**
pt_pt: *cliente* / **servidor**

source: yes
pt_pt: sim

source: no
pt_pt: não

source: no [1]_
pt_pt: não [1]_

source: no [2]_
pt_pt: não [2]_

source: Footnotes
pt_pt: Notas de rodapé

source: :class:`SSLContext` disables SSLv2 with :data:`OP_NO_SSLv2` by default.
pt_pt: :class:`SSLContext` desativa SSLv2 com :data:`OP_NO_SSLv2` por predefinição.

source: :class:`SSLContext` disables SSLv3 with :data:`OP_NO_SSLv3` by default.
pt_pt: :class:`SSLContext` desativa SSLv3 com :data:`OP_NO_SSLv3` por predefinição.

source: TLS 1.3 protocol will be available with :data:`PROTOCOL_TLS` in OpenSSL >= 1.1.1. There is no dedicated PROTOCOL constant for just TLS 1.3.
pt_pt: O protocolo TLS 1.3 estará disponível com :data:`PROTOCOL_TLS` em OpenSSL >= 1.1.1. Não existe uma constante PROTOCOL dedicada apenas para TLS 1.3.

source: :func:`create_default_context` lets the :mod:`ssl` module choose security settings for a given purpose.
pt_pt: :func:`create_default_context` permite que o módulo :mod:`ssl` escolha as configurações de segurança para um determinado propósito.

source: The context is created with secure default values. The options :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2`, and :data:`OP_NO_SSLv3` (except for :data:`PROTOCOL_SSLv3`) are set by default. The initial cipher suite list contains only ``HIGH`` ciphers, no ``NULL`` ciphers and no ``MD5`` ciphers.
pt_pt: O contexto é criado com valores predefinidos seguros. As opções :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2` e :data:`OP_NO_SSLv3` (exceto para :data:`PROTOCOL_SSLv3`) são definidas por predefinição. A lista inicial de suites de cifras contém apenas cifras ``HIGH``, sem cifras ``NULL`` e sem cifras ``MD5``.

source: :class:`SSLContext` without protocol argument is deprecated. The context class will either require :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol in the future.
pt_pt: :class:`SSLContext` sem argumento de protocolo está obsoleto. A classe de contexto irá requerer o protocolo :data:`PROTOCOL_TLS_CLIENT` ou :data:`PROTOCOL_TLS_SERVER` no futuro.

source: The default cipher suites now include only secure AES and ChaCha20 ciphers with forward secrecy and security level 2. RSA and DH keys with less than 2048 bits and ECC keys with less than 224 bits are prohibited. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT`, and :data:`PROTOCOL_TLS_SERVER` use TLS 1.2 as minimum TLS version.
pt_pt: As suites de cifras predefinidas incluem agora apenas cifras AES e ChaCha20 seguras com confidencialidade futura e nível de segurança 2. Chaves RSA e DH com menos de 2048 bits e chaves ECC com menos de 224 bits são proibidas. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT` e :data:`PROTOCOL_TLS_SERVER` usam TLS 1.2 como versão mínima do TLS.

source: :class:`SSLContext` only supports limited mutation once it has been used by a connection. Adding new certificates to the internal trust store is allowed, but changing ciphers, verification settings, or mTLS certificates may result in surprising behavior.
pt_pt: :class:`SSLContext` suporta apenas mutação limitada depois de ter sido usado por uma ligação. Adicionar novos certificados à loja de confiança interna é permitido, mas alterar cifras, configurações de verificação ou certificados mTLS pode resultar em comportamento surpreendente.

source: :class:`SSLContext` is designed to be shared and used by multiple connections. Thus, it is thread-safe as long as it is not reconfigured after being used by a connection.
pt_pt: :class:`SSLContext` é concebido para ser partilhado e usado por várias ligações. Assim, é seguro para threads desde que não seja reconfigurado após ser usado por uma ligação.

source: :class:`SSLContext` objects have the following methods and attributes:
pt_pt: Os objetos :class:`SSLContext` têm os seguintes métodos e atributos:

source: Get statistics about quantities of loaded X.509 certificates, count of X.509 certificates flagged as CA certificates and certificate revocation lists as dictionary.
pt_pt: Obtém estatísticas sobre quantidades de certificados X.509 carregados, contagem de certificados X.509 marcados como certificados CA e listas de revogação de certificados como dicionário.

source: Example for a context with one CA cert and one other cert::
pt_pt: Exemplo para um contexto com um certificado CA e outro certificado::

source: Load a private key and the corresponding certificate. The *certfile* string must be the path to a single file in PEM format containing the certificate as well as any number of CA certificates needed to establish the certificate's authenticity. The *keyfile* string, if present, must point to a file containing the private key. Otherwise the private key will be taken from *certfile* as well. See the discussion of :ref:`ssl-certificates` for more information on how the certificate is stored in the *certfile*.
pt_pt: Carrega uma chave privada e o certificado correspondente. A string *certfile* deve ser o caminho para um único ficheiro em formato PEM contendo o certificado, bem como qualquer número de certificados CA necessários para estabelecer a autenticidade do certificado. A string *keyfile*, se presente, deve apontar para um ficheiro contendo a chave privada. Caso contrário, a chave privada será obtida de *certfile*. Consulte a discussão de :ref:`ssl-certificates` para mais informações sobre como o certificado é armazenado no *certfile*.

source: The *password* argument may be a function to call to get the password for decrypting the private key. It will only be called if the private key is encrypted and a password is necessary. It will be called with no arguments, and it should return a string, bytes, or bytearray. If the return value is a string it will be encoded as UTF-8 before using it to decrypt the key. Alternatively a string, bytes, or bytearray value may be supplied directly as the *password* argument. It will be ignored if the private key is not encrypted and no password is needed.
pt_pt: O argumento *password* pode ser uma função a chamar para obter a palavra-passe para desencriptar a chave privada. Só será chamada se a chave privada estiver encriptada e uma palavra-passe for necessária. Será chamada sem argumentos e deve retornar uma string, bytes ou bytearray. Se o valor de retorno for uma string, será codificado como UTF-8 antes de ser usado para desencriptar a chave. Alternativamente, um valor de string, bytes ou bytearray pode ser fornecido diretamente como argumento *password*. Será ignorado se a chave privada não estiver encriptada e nenhuma palavra-passe for necessária.

source: If the *password* argument is not specified and a password is required, OpenSSL's built-in password prompting mechanism will be used to interactively prompt the user for a password.
pt_pt: Se o argumento *password* não for especificado e uma palavra-passe for necessária, o mecanismo integrado de solicitação de palavra-passe do OpenSSL será usado para solicitar interativamente a palavra-passe ao utilizador.

source: An :class:`SSLError` is raised if the private key doesn't match with the certificate.
pt_pt: É levantado um :class:`SSLError` se a chave privada não corresponder ao certificado.

source: New optional argument *password*.
pt_pt: Novo argumento opcional *password*.

source: Load a set of default "certification authority" (CA) certificates from default locations. On Windows it loads CA certs from the ``CA`` and ``ROOT`` system stores. On all systems it calls :meth:`SSLContext.set_default_verify_paths`. In the future the method may load CA certificates from other locations, too.
pt_pt: Carrega um conjunto de certificados de "autoridade de certificação" (CA) predefinidos a partir de locais predefinidos. No Windows, carrega certificados CA das lojas de sistema ``CA`` e ``ROOT``. Em todos os sistemas, chama :meth:`SSLContext.set_default_verify_paths`. No futuro, o método pode carregar certificados CA de outros locais também.

source: The *purpose* flag specifies what kind of CA certificates are loaded. The default settings :const:`Purpose.SERVER_AUTH` loads certificates, that are flagged and trusted for TLS web server authentication (client side sockets). :const:`Purpose.CLIENT_AUTH` loads CA certificates for client certificate verification on the server side.
pt_pt: A flag *purpose* especifica que tipo de certificados CA são carregados. As configurações predefinidas :const:`Purpose.SERVER_AUTH` carregam certificados que estão marcados e são confiáveis para autenticação de servidores web TLS (sockets do lado do cliente). :const:`Purpose.CLIENT_AUTH` carrega certificados CA para verificação de certificados de cliente no lado do servidor.

source: Load a set of "certification authority" (CA) certificates used to validate other peers' certificates when :data:`verify_mode` is other than :data:`CERT_NONE`. At least one of *cafile* or *capath* must be specified.
pt_pt: Carrega um conjunto de certificados de "autoridade de certificação" (CA) usados para validar certificados de outros pares quando :data:`verify_mode` é diferente de :data:`CERT_NONE`. Pelo menos um de *cafile* ou *capath* deve ser especificado.

source: This method can also load certification revocation lists (CRLs) in PEM or DER format. In order to make use of CRLs, :attr:`SSLContext.verify_flags` must be configured properly.
pt_pt: Este método também pode carregar listas de revogação de certificados (CRLs) em formato PEM ou DER. Para utilizar CRLs, :attr:`SSLContext.verify_flags` deve ser configurado corretamente.

source: The *cafile* string, if present, is the path to a file of concatenated CA certificates in PEM format. See the discussion of :ref:`ssl-certificates` for more information about how to arrange the certificates in this file.
pt_pt: A string *cafile*, se presente, é o caminho para um ficheiro de certificados CA concatenados em formato PEM. Consulte a discussão de :ref:`ssl-certificates` para mais informações sobre como organizar os certificados neste ficheiro.

source: The *capath* string, if present, is the path to a directory containing several CA certificates in PEM format, following an `OpenSSL specific layout <https://docs.openssl.org/master/man3/SSL_CTX_load_verify_locations/>`_.
pt_pt: A string *capath*, se presente, é o caminho para um diretório contendo vários certificados CA em formato PEM, seguindo um `layout específico do OpenSSL <https://docs.openssl.org/master/man3/SSL_CTX_load_verify_locations/>`_.

source: The *cadata* object, if present, is either an ASCII string of one or more PEM-encoded certificates or a :term:`bytes-like object` of DER-encoded certificates. Like with *capath* extra lines around PEM-encoded certificates are ignored but at least one certificate must be present.
pt_pt: O objeto *cadata*, se presente, é uma string ASCII de um ou mais certificados codificados em PEM ou um objeto :term:`bytes-like` de certificados codificados em DER. Tal como com *capath*, linhas extra em torno de certificados codificados em PEM são ignoradas, mas pelo menos um certificado deve estar presente.

source: New optional argument *cadata*
pt_pt: Novo argumento opcional *cadata*

source: Get a list of loaded "certification authority" (CA) certificates. If the ``binary_form`` parameter is :const:`False` each list entry is a dict like the output of :meth:`SSLSocket.getpeercert`. Otherwise the method returns a list of DER-encoded certificates. The returned list does not contain certificates from *capath* unless a certificate was requested and loaded by a SSL connection.
pt_pt: Obtém uma lista de certificados de "autoridade de certificação" (CA) carregados. Se o parâmetro ``binary_form`` for :const:`False`, cada entrada da lista é um dicionário como a saída de :meth:`SSLSocket.getpeercert`. Caso contrário, o método retorna uma lista de certificados codificados em DER. A lista retornada não contém certificados de *capath* a menos que um certificado tenha sido solicitado e carregado por uma ligação SSL.

source: Certificates in a capath directory aren't loaded unless they have been used at least once.
pt_pt: Os certificados num diretório capath não são carregados a menos que tenham sido usados pelo menos uma vez.

source: Get a list of enabled ciphers. The list is in order of cipher priority. See :meth:`SSLContext.set_ciphers`.
pt_pt: Obtém uma lista de cifras ativadas. A lista está por ordem de prioridade de cifras. Consulte :meth:`SSLContext.set_ciphers`.

source: Load a set of default "certification authority" (CA) certificates from a filesystem path defined when building the OpenSSL library. Unfortunately, there's no easy way to know whether this method succeeds: no error is returned if no certificates are to be found. When the OpenSSL library is provided as part of the operating system, though, it is likely to be configured properly.
pt_pt: Carrega um conjunto de certificados de "autoridade de certificação" (CA) predefinidos a partir de um caminho do sistema de ficheiros definido ao construir a biblioteca OpenSSL. Infelizmente, não há uma forma fácil de saber se este método tem sucesso: nenhum erro é retornado se não forem encontrados certificados. Quando a biblioteca OpenSSL é fornecida como parte do sistema operativo, é provável que esteja configurada corretamente.

source: Set the available ciphers for sockets created with this context. It should be a string in the `OpenSSL cipher list format <https://docs.openssl.org/master/man1/ciphers/>`_. If no cipher can be selected (because compile-time options or other configuration forbids use of all the specified ciphers), an :class:`SSLError` will be raised.
pt_pt: Define as cifras disponíveis para sockets criados com este contexto. Deve ser uma string no `formato da lista de cifras do OpenSSL <https://docs.openssl.org/master/man1/ciphers/>`_. Se nenhuma cifra puder ser selecionada (porque opções de tempo de compilação ou outra configuração proibem o uso de todas as cifras especificadas), será levantado um :class:`SSLError`.

source: when connected, the :meth:`SSLSocket.cipher` method of SSL sockets will give the currently selected cipher.
pt_pt: quando ligado, o método :meth:`SSLSocket.cipher` dos sockets SSL dará a cifra atualmente selecionada.

source: TLS 1.3 cipher suites cannot be disabled with :meth:`~SSLContext.set_ciphers`.
pt_pt: As suites de cifras TLS 1.3 não podem ser desativadas com :meth:`~SSLContext.set_ciphers`.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of ASCII strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to :rfc:`7301`. After a successful handshake, the :meth:`SSLSocket.selected_alpn_protocol` method will return the agreed-upon protocol.
pt_pt: Especifica quais protocolos o socket deve anunciar durante o handshake SSL/TLS. Deve ser uma lista de strings ASCII, como ``['http/1.1', 'spdy/2']``, ordenada por preferência. A seleção de um protocolo acontecerá durante o handshake e será executada de acordo com :rfc:`7301`. Após um handshake bem-sucedido, o método :meth:`SSLSocket.selected_alpn_protocol` retornará o protocolo acordado.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_ALPN` is ``False``.
pt_pt: Este método levantará :exc:`NotImplementedError` se :data:`HAS_ALPN` for ``False``.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to the `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. After a successful handshake, the :meth:`SSLSocket.selected_npn_protocol` method will return the agreed-upon protocol.
pt_pt: Especifica quais protocolos o socket deve anunciar durante o handshake SSL/TLS. Deve ser uma lista de strings, como ``['http/1.1', 'spdy/2']``, ordenada por preferência. A seleção de um protocolo acontecerá durante o handshake e será executada de acordo com a `Negociação de Protocolo de Camada de Aplicação <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. Após um handshake bem-sucedido, o método :meth:`SSLSocket.selected_npn_protocol` retornará o protocolo acordado.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_NPN` is ``False``.
pt_pt: Este método levantará :exc:`NotImplementedError` se :data:`HAS_NPN` for ``False``.

source: Register a callback function that will be called after the TLS Client Hello handshake message has been received by the SSL/TLS server when the TLS client specifies a server name indication. The server name indication mechanism is specified in :rfc:`6066` section 3 - Server Name Indication.
pt_pt: Regista uma função de retorno de chamada que será chamada após a mensagem de handshake TLS Client Hello ter sido recebida pelo servidor SSL/TLS quando o cliente TLS especifica uma indicação de nome de servidor. O mecanismo de indicação de nome de servidor está especificado na secção 3 - Indicação de Nome de Servidor do :rfc:`6066`.

source: Only one callback can be set per ``SSLContext``. If *sni_callback* is set to ``None`` then the callback is disabled. Calling this function a subsequent time will disable the previously registered callback.
pt_pt: Apenas uma função de retorno de chamada pode ser definida por ``SSLContext``. Se *sni_callback* for definido como ``None``, a função de retorno de chamada é desativada. Chamar esta função posteriormente desativará a função de retorno de chamada previamente registada.
