Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: Given a certificate as an ASCII PEM string, returns a DER-encoded sequence of bytes for that same certificate.
pt_pt: Dado um certificado como uma string ASCII PEM, retorna uma sequência de bytes codificada em DER para esse mesmo certificado.

source: Returns a named tuple with paths to OpenSSL's default cafile and capath. The paths are the same as used by :meth:`SSLContext.set_default_verify_paths`. The return value is a :term:`named tuple` ``DefaultVerifyPaths``:
pt_pt: Retorna um tuplo nomeado com caminhos para o cafile e capath predefinidos do OpenSSL. Os caminhos são os mesmos usados por :meth:`SSLContext.set_default_verify_paths`. O valor de retorno é um :term:`named tuple` ``DefaultVerifyPaths``:

source: :attr:`cafile` - resolved path to cafile or ``None`` if the file doesn't exist,
pt_pt: :attr:`cafile` - caminho resolvido para cafile ou ``None`` se o ficheiro não existir,

source: :attr:`capath` - resolved path to capath or ``None`` if the directory doesn't exist,
pt_pt: :attr:`capath` - caminho resolvido para capath ou ``None`` se o diretório não existir,

source: :attr:`openssl_cafile_env` - OpenSSL's environment key that points to a cafile,
pt_pt: :attr:`openssl_cafile_env` - chave de ambiente do OpenSSL que aponta para um cafile,

source: :attr:`openssl_cafile` - hard coded path to a cafile,
pt_pt: :attr:`openssl_cafile` - caminho codificado para um cafile,

source: :attr:`openssl_capath_env` - OpenSSL's environment key that points to a capath,
pt_pt: :attr:`openssl_capath_env` - chave de ambiente do OpenSSL que aponta para um capath,

source: :attr:`openssl_capath` - hard coded path to a capath directory
pt_pt: :attr:`openssl_capath` - caminho codificado para um diretório capath

source: Retrieve certificates from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
pt_pt: Recupera certificados da loja de certificados do sistema Windows. *store_name* pode ser um de ``CA``, ``ROOT`` ou ``MY``. O Windows pode fornecer lojas de certificados adicionais também.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data. Trust specifies the purpose of the certificate as a set of OIDS or exactly ``True`` if the certificate is trustworthy for all purposes.
pt_pt: A função retorna uma lista de tuplos (cert_bytes, encoding_type, trust). O encoding_type especifica a codificação de cert_bytes. É :const:`x509_asn` para dados X.509 ASN.1 ou :const:`pkcs_7_asn` para dados PKCS#7 ASN.1. Trust especifica o propósito do certificado como um conjunto de OIDs ou exatamente ``True`` se o certificado for confiável para todos os propósitos.

source: Example::
pt_pt: Exemplo::

source: >>> ssl.enum_certificates("CA") [(b'data...', 'x509_asn', {'1.3.6.1.5.5.7.3.1', '1.3.6.1.5.5.7.3.2'}), (b'data...', 'x509_asn', True)]
pt_pt: >>> ssl.enum_certificates("CA") [(b'dados...', 'x509_asn', {'1.3.6.1.5.5.7.3.1', '1.3.6.1.5.5.7.3.2'}), (b'dados...', 'x509_asn', True)]

source: Retrieve CRLs from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
pt_pt: Recupera CRLs da loja de certificados do sistema Windows. *store_name* pode ser um de ``CA``, ``ROOT`` ou ``MY``. O Windows pode fornecer lojas de certificados adicionais também.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data.
pt_pt: A função retorna uma lista de tuplos (cert_bytes, encoding_type, trust). O encoding_type especifica a codificação de cert_bytes. É :const:`x509_asn` para dados X.509 ASN.1 ou :const:`pkcs_7_asn` para dados PKCS#7 ASN.1.

source: Constants
pt_pt: Constantes

source: All constants are now :class:`enum.IntEnum` or :class:`enum.IntFlag` collections.
pt_pt: Todas as constantes são agora coleções :class:`enum.IntEnum` ou :class:`enum.IntFlag`.

source: Possible value for :attr:`SSLContext.verify_mode`. Except for :const:`PROTOCOL_TLS_CLIENT`, it is the default mode. With client-side sockets, just about any cert is accepted. Validation errors, such as untrusted or expired cert, are ignored and do not abort the TLS/SSL handshake.
pt_pt: Valor possível para :attr:`SSLContext.verify_mode`. Exceto para :const:`PROTOCOL_TLS_CLIENT`, é o modo predefinido. Com sockets do lado do cliente, quase qualquer certificado é aceite. Erros de validação, como certificados não confiáveis ou expirados, são ignorados e não abortam o handshake TLS/SSL.

source: In server mode, no certificate is requested from the client, so the client does not send any for client cert authentication.
pt_pt: Em modo servidor, nenhum certificado é solicitado ao cliente, pelo que o cliente não envia nenhum para autenticação de certificado de cliente.

source: See the discussion of :ref:`ssl-security` below.
pt_pt: Consulte a discussão de :ref:`ssl-security` abaixo.

source: Possible value for :attr:`SSLContext.verify_mode`. In client mode, :const:`CERT_OPTIONAL` has the same meaning as :const:`CERT_REQUIRED`. It is recommended to use :const:`CERT_REQUIRED` for client-side sockets instead.
pt_pt: Valor possível para :attr:`SSLContext.verify_mode`. Em modo cliente, :const:`CERT_OPTIONAL` tem o mesmo significado que :const:`CERT_REQUIRED`. É recomendado usar :const:`CERT_REQUIRED` para sockets do lado do cliente.

source: In server mode, a client certificate request is sent to the client. The client may either ignore the request or send a certificate in order perform TLS client cert authentication. If the client chooses to send a certificate, it is verified. Any verification error immediately aborts the TLS handshake.
pt_pt: Em modo servidor, um pedido de certificado de cliente é enviado ao cliente. O cliente pode ignorar o pedido ou enviar um certificado para realizar a autenticação de certificado de cliente TLS. Se o cliente escolher enviar um certificado, ele é verificado. Qualquer erro de verificação aborta imediatamente o handshake TLS.

source: Use of this setting requires a valid set of CA certificates to be passed to :meth:`SSLContext.load_verify_locations`.
pt_pt: O uso desta configuração requer que um conjunto válido de certificados CA seja passado para :meth:`SSLContext.load_verify_locations`.

source: Possible value for :attr:`SSLContext.verify_mode`. In this mode, certificates are required from the other side of the socket connection; an :class:`SSLError` will be raised if no certificate is provided, or if its validation fails. This mode is **not** sufficient to verify a certificate in client mode as it does not match hostnames. :attr:`~SSLContext.check_hostname` must be enabled as well to verify the authenticity of a cert. :const:`PROTOCOL_TLS_CLIENT` uses :const:`CERT_REQUIRED` and enables :attr:`~SSLContext.check_hostname` by default.
pt_pt: Valor possível para :attr:`SSLContext.verify_mode`. Neste modo, são necessários certificados do outro lado da ligação do socket; um :class:`SSLError` será levantado se nenhum certificado for fornecido, ou se a sua validação falhar. Este modo **não** é suficiente para verificar um certificado em modo cliente, uma vez que não verifica os nomes de host. :attr:`~SSLContext.check_hostname` também deve ser ativado para verificar a autenticidade de um certificado. :const:`PROTOCOL_TLS_CLIENT` usa :const:`CERT_REQUIRED` e ativa :attr:`~SSLContext.check_hostname` por predefinição.

source: With server socket, this mode provides mandatory TLS client cert authentication. A client certificate request is sent to the client and the client must provide a valid and trusted certificate.
pt_pt: Com socket de servidor, este modo fornece autenticação obrigatória de certificado de cliente TLS. Um pedido de certificado de cliente é enviado ao cliente e o cliente deve fornecer um certificado válido e confiável.

source: :class:`enum.IntEnum` collection of CERT_* constants.
pt_pt: :class:`enum.IntEnum` coleção de constantes CERT_*.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, certificate revocation lists (CRLs) are not checked. By default OpenSSL does neither require nor verify CRLs.
pt_pt: Valor possível para :attr:`SSLContext.verify_flags`. Neste modo, as listas de revogação de certificados (CRLs) não são verificadas. Por predefinição, o OpenSSL não exige nem verifica CRLs.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, only the peer cert is checked but none of the intermediate CA certificates. The mode requires a valid CRL that is signed by the peer cert's issuer (its direct ancestor CA). If no proper CRL has been loaded with :attr:`SSLContext.load_verify_locations`, validation will fail.
pt_pt: Valor possível para :attr:`SSLContext.verify_flags`. Neste modo, apenas o certificado do par é verificado, mas nenhum dos certificados CA intermédios. O modo requer uma CRL válida que seja assinada pelo emissor do certificado do par (a sua CA ancestral direta). Se nenhuma CRL adequada tiver sido carregada com :attr:`SSLContext.load_verify_locations`, a validação falhará.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, CRLs of all certificates in the peer cert chain are checked.
pt_pt: Valor possível para :attr:`SSLContext.verify_flags`. Neste modo, as CRLs de todos os certificados na cadeia de certificados do par são verificadas.

source: Possible value for :attr:`SSLContext.verify_flags` to disable workarounds for broken X.509 certificates.
pt_pt: Valor possível para :attr:`SSLContext.verify_flags` para desativar soluções alternativas para certificados X.509 quebrados.

source: Possible value for :attr:`SSLContext.verify_flags` to enables proxy certificate verification.
pt_pt: Valor possível para :attr:`SSLContext.verify_flags` para ativar a verificação de certificados proxy.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to prefer trusted certificates when building the trust chain to validate a certificate. This flag is enabled by default.
pt_pt: Valor possível para :attr:`SSLContext.verify_flags`. Instrui o OpenSSL a preferir certificados confiáveis ao construir a cadeia de confiança para validar um certificado. Esta flag está ativada por predefinição.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to accept intermediate CAs in the trust store to be treated as trust-anchors, in the same way as the self-signed root CA certificates. This makes it possible to trust certificates issued by an intermediate CA without having to trust its ancestor root CA.
pt_pt: Valor possível para :attr:`SSLContext.verify_flags`. Instrui o OpenSSL a aceitar CAs intermédias na loja de confiança para serem tratadas como âncoras de confiança, da mesma forma que os certificados CA raiz autoassinados. Isto torna possível confiar em certificados emitidos por uma CA intermédia sem ter de confiar na sua CA raiz ancestral.

source: :class:`enum.IntFlag` collection of VERIFY_* constants.
pt_pt: :class:`enum.IntFlag` coleção de constantes VERIFY_*.

source: Selects the highest protocol version that both the client and server support. Despite the name, this option can select both "SSL" and "TLS" protocols.
pt_pt: Selecciona a versão de protocolo mais alta suportada tanto pelo cliente como pelo servidor. Apesar do nome, esta opção pode selecionar tanto protocolos "SSL" como "TLS".

source: TLS clients and servers require different default settings for secure communication. The generic TLS protocol constant is deprecated in favor of :data:`PROTOCOL_TLS_CLIENT` and :data:`PROTOCOL_TLS_SERVER`.
pt_pt: Clientes e servidores TLS requerem configurações predefinidas diferentes para comunicação segura. A constante de protocolo TLS genérica está obsoleta em favor de :data:`PROTOCOL_TLS_CLIENT` e :data:`PROTOCOL_TLS_SERVER`.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context client-side connections. The protocol enables :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` by default.
pt_pt: Negocia automaticamente a versão de protocolo mais alta suportada tanto pelo cliente como pelo servidor, e configura as ligações do lado do cliente do contexto. O protocolo ativa :data:`CERT_REQUIRED` e :attr:`~SSLContext.check_hostname` por predefinição.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context server-side connections.
pt_pt: Negocia automaticamente a versão de protocolo mais alta suportada tanto pelo cliente como pelo servidor, e configura as ligações do lado do servidor do contexto.

source: Alias for :data:`PROTOCOL_TLS`.
pt_pt: Alias para :data:`PROTOCOL_TLS`.

source: Use :data:`PROTOCOL_TLS` instead.
pt_pt: Use :data:`PROTOCOL_TLS` em vez disso.

source: Selects SSL version 3 as the channel encryption protocol.
pt_pt: Selecciona a versão SSL 3 como protocolo de encriptação do canal.

source: This protocol is not available if OpenSSL is compiled with the ``no-ssl3`` option.
pt_pt: Este protocolo não está disponível se o OpenSSL for compilado com a opção ``no-ssl3``.

source: SSL version 3 is insecure. Its use is highly discouraged.
pt_pt: A versão SSL 3 é insegura. O seu uso é altamente desencorajado.

source: OpenSSL has deprecated all version specific protocols. Use the default protocol :data:`PROTOCOL_TLS_SERVER` or :data:`PROTOCOL_TLS_CLIENT` with :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
pt_pt: O OpenSSL descontinuou todos os protocolos específicos de versão. Use o protocolo predefinido :data:`PROTOCOL_TLS_SERVER` ou :data:`PROTOCOL_TLS_CLIENT` com :attr:`SSLContext.minimum_version` e :attr:`SSLContext.maximum_version` em vez disso.

source: Selects TLS version 1.0 as the channel encryption protocol.
pt_pt: Selecciona a versão TLS 1.0 como protocolo de encriptação do canal.

source: OpenSSL has deprecated all version specific protocols.
pt_pt: O OpenSSL descontinuou todos os protocolos específicos de versão.

source: Selects TLS version 1.1 as the channel encryption protocol. Available only with openssl version 1.0.1+.
pt_pt: Selecciona a versão TLS 1.1 como protocolo de encriptação do canal. Disponível apenas com a versão openssl 1.0.1+.

source: Selects TLS version 1.2 as the channel encryption protocol. Available only with openssl version 1.0.1+.
pt_pt: Selecciona a versão TLS 1.2 como protocolo de encriptação do canal. Disponível apenas com a versão openssl 1.0.1+.

source: Enables workarounds for various bugs present in other SSL implementations. This option is set by default. It does not necessarily set the same flags as OpenSSL's ``SSL_OP_ALL`` constant.
pt_pt: Ativa soluções alternativas para vários bugs presentes em outras implementações SSL. Esta opção está definida por predefinição. Não define necessariamente as mesmas flags que a constante ``SSL_OP_ALL`` do OpenSSL.

source: Prevents an SSLv2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv2 as the protocol version.
pt_pt: Impede uma ligação SSLv2. Esta opção é apenas aplicável em conjunto com :const:`PROTOCOL_TLS`. Impede que os pares escolham SSLv2 como a versão do protocolo.

source: SSLv2 is deprecated
pt_pt: SSLv2 está obsoleto

source: Prevents an SSLv3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv3 as the protocol version.
pt_pt: Impede uma ligação SSLv3. Esta opção é apenas aplicável em conjunto com :const:`PROTOCOL_TLS`. Impede que os pares escolham SSLv3 como a versão do protocolo.

source: SSLv3 is deprecated
pt_pt: SSLv3 está obsoleto

source: Prevents a TLSv1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1 as the protocol version.
pt_pt: Impede uma ligação TLSv1. Esta opção é apenas aplicável em conjunto com :const:`PROTOCOL_TLS`. Impede que os pares escolham TLSv1 como a versão do protocolo.

source: The option is deprecated since OpenSSL 1.1.0, use the new :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
pt_pt: A opção está obsoleta desde o OpenSSL 1.1.0, use os novos :attr:`SSLContext.minimum_version` e :attr:`SSLContext.maximum_version` em vez disso.

source: Prevents a TLSv1.1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.1 as the protocol version. Available only with openssl version 1.0.1+.
pt_pt: Impede uma ligação TLSv1.1. Esta opção é apenas aplicável em conjunto com :const:`PROTOCOL_TLS`. Impede que os pares escolham TLSv1.1 como a versão do protocolo. Disponível apenas com a versão openssl 1.0.1+.

source: The option is deprecated since OpenSSL 1.1.0.
pt_pt: A opção está obsoleta desde o OpenSSL 1.1.0.

source: Prevents a TLSv1.2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.2 as the protocol version. Available only with openssl version 1.0.1+.
pt_pt: Impede uma ligação TLSv1.2. Esta opção é apenas aplicável em conjunto com :const:`PROTOCOL_TLS`. Impede que os pares escolham TLSv1.2 como a versão do protocolo. Disponível apenas com a versão openssl 1.0.1+.

source: Prevents a TLSv1.3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.3 as the protocol version. TLS 1.3 is available with OpenSSL 1.1.1 or later. When Python has been compiled against an older version of OpenSSL, the flag defaults to *0*.
pt_pt: Impede uma ligação TLSv1.3. Esta opção é apenas aplicável em conjunto com :const:`PROTOCOL_TLS`. Impede que os pares escolham TLSv1.3 como a versão do protocolo. TLS 1.3 está disponível com OpenSSL 1.1.1 ou posterior. Quando o Python é compilado contra uma versão mais antiga do OpenSSL, a flag é predefinida para *0*.

source: The option is deprecated since OpenSSL 1.1.0. It was added to 2.7.15 and 3.6.3 for backwards compatibility with OpenSSL 1.0.2.
pt_pt: A opção está obsoleta desde o OpenSSL 1.1.0. Foi adicionada às versões 2.7.15 e 3.6.3 para compatibilidade com versões anteriores do OpenSSL 1.0.2.

source: Disable all renegotiation in TLSv1.2 and earlier. Do not send HelloRequest messages, and ignore renegotiation requests via ClientHello.
pt_pt: Desativa toda a renegociação em TLSv1.2 e anteriores. Não envia mensagens HelloRequest e ignora pedidos de renegociação via ClientHello.

source: This option is only available with OpenSSL 1.1.0h and later.
pt_pt: Esta opção está disponível apenas com OpenSSL 1.1.0h e posterior.

source: Use the server's cipher ordering preference, rather than the client's. This option has no effect on client sockets and SSLv2 server sockets.
pt_pt: Usa a preferência de ordenação de cifras do servidor, em vez da do cliente. Esta opção não tem efeito em sockets de cliente e sockets de servidor SSLv2.

source: Prevents reuse of the same DH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
pt_pt: Impede a reutilização da mesma chave DH para sessões SSL distintas. Isto melhora a confidencialidade futura, mas requer mais recursos computacionais. Esta opção aplica-se apenas a sockets de servidor.

source: Prevents reuse of the same ECDH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
pt_pt: Impede a reutilização da mesma chave ECDH para sessões SSL distintas. Isto melhora a confidencialidade futura, mas requer mais recursos computacionais. Esta opção aplica-se apenas a sockets de servidor.

source: Send dummy Change Cipher Spec (CCS) messages in TLS 1.3 handshake to make a TLS 1.3 connection look more like a TLS 1.2 connection.
pt_pt: Envie mensagens Change Cipher Spec (CCS) fictícias no handshake TLS 1.3 para fazer com que uma ligação TLS 1.3 pareça mais uma ligação TLS 1.2.

source: This option is only available with OpenSSL 1.1.1 and later.
pt_pt: Esta opção está disponível apenas com OpenSSL 1.1.1 e posterior.

source: Disable compression on the SSL channel. This is useful if the application protocol supports its own compression scheme.
pt_pt: Desativa a compressão no canal SSL. Isto é útil se o protocolo da aplicação suportar o seu próprio esquema de compressão.

source: :class:`enum.IntFlag` collection of OP_* constants.
pt_pt: :class:`enum.IntFlag` coleção de constantes OP_*.

source: Prevent client side from requesting a session ticket.
pt_pt: Impede que o lado do cliente solicite um bilhete de sessão.

source: Ignore unexpected shutdown of TLS connections.
pt_pt: Ignorar o encerramento inesperado de ligações TLS.

source: This option is only available with OpenSSL 3.0.0 and later.
pt_pt: Esta opção está disponível apenas com OpenSSL 3.0.0 e posterior.

source: Enable the use of the kernel TLS. To benefit from the feature, OpenSSL must have been compiled with support for it, and the negotiated cipher suites and extensions must be supported by it (a list of supported ones may vary by platform and kernel version).
pt_pt: Ativa o uso do TLS do kernel. Para beneficiar desta funcionalidade, o OpenSSL deve ter sido compilado com suporte para ela, e as suites de cifras e extensões negociadas devem ser suportadas por ela (uma lista das suportadas pode variar por plataforma e versão do kernel).

source: Note that with enabled kernel TLS some cryptographic operations are performed by the kernel directly and not via any available OpenSSL Providers. This might be undesirable if, for example, the application requires all cryptographic operations to be performed by the FIPS provider.
pt_pt: Note que com o TLS do kernel ativado, algumas operações criptográficas são realizadas diretamente pelo kernel e não através de quaisquer Provedores OpenSSL disponíveis. Isto pode ser indesejável se, por exemplo, a aplicação exigir que todas as operações criptográficas sejam realizadas pelo provedor FIPS.

source: Allow legacy insecure renegotiation between OpenSSL and unpatched servers only.
pt_pt: Permitir renegociação insegura legada apenas entre OpenSSL e servidores não corrigidos.

source: Whether the OpenSSL library has built-in support for the SSL 2.0 protocol.
pt_pt: Indica se a biblioteca OpenSSL tem suporte integrado para o protocolo SSL 2.0.

source: Whether the OpenSSL library has built-in support for the SSL 3.0 protocol.
pt_pt: Indica se a biblioteca OpenSSL tem suporte integrado para o protocolo SSL 3.0.

source: Whether the OpenSSL library has built-in support for the TLS 1.0 protocol.
pt_pt: Indica se a biblioteca OpenSSL tem suporte integrado para o protocolo TLS 1.0.

source: Whether the OpenSSL library has built-in support for the TLS 1.1 protocol.
pt_pt: Indica se a biblioteca OpenSSL tem suporte integrado para o protocolo TLS 1.1.

source: Whether the OpenSSL library has built-in support for the TLS 1.2 protocol.
pt_pt: Indica se a biblioteca OpenSSL tem suporte integrado para o protocolo TLS 1.2.

source: Whether the OpenSSL library has built-in support for the TLS 1.3 protocol.
pt_pt: Indica se a biblioteca OpenSSL tem suporte integrado para o protocolo TLS 1.3.

source: Whether the OpenSSL library has built-in support for TLS-PSK.
pt_pt: Indica se a biblioteca OpenSSL tem suporte integrado para TLS-PSK.
