Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: The callback function will be called with three arguments; the first being the :class:`ssl.SSLSocket`, the second is a string that represents the server name that the client is intending to communicate (or :const:`None` if the TLS Client Hello does not contain a server name) and the third argument is the original :class:`SSLContext`. The server name argument is text. For internationalized domain name, the server name is an IDN A-label (``"xn--pythn-mua.org"``).
pt_pt: A função de retorno de chamada será chamada com três argumentos; o primeiro é o :class:`ssl.SSLSocket`, o segundo é uma string que representa o nome do servidor com o qual o cliente pretende comunicar (ou :const:`None` se o TLS Client Hello não contiver um nome de servidor) e o terceiro argumento é o :class:`SSLContext` original. O argumento do nome do servidor é texto. Para nomes de domínio internacionalizados, o nome do servidor é um IDN A-label (``"xn--pythn-mua.org"``).

source: A typical use of this callback is to change the :class:`ssl.SSLSocket`'s :attr:`SSLSocket.context` attribute to a new object of type :class:`SSLContext` representing a certificate chain that matches the server name.
pt_pt: Uma utilização típica desta função de retorno de chamada é alterar o atributo :attr:`SSLSocket.context` do :class:`ssl.SSLSocket` para um novo objeto do tipo :class:`SSLContext` que representa uma cadeia de certificados que corresponde ao nome do servidor.

source: Due to the early negotiation phase of the TLS connection, only limited methods and attributes are usable like :meth:`SSLSocket.selected_alpn_protocol` and :attr:`SSLSocket.context`. The :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.get_verified_chain`, :meth:`SSLSocket.get_unverified_chain` :meth:`SSLSocket.cipher` and :meth:`SSLSocket.compression` methods require that the TLS connection has progressed beyond the TLS Client Hello and therefore will not return meaningful values nor can they be called safely.
pt_pt: Devido à fase inicial de negociação da ligação TLS, apenas métodos e atributos limitados são utilizáveis, como :meth:`SSLSocket.selected_alpn_protocol` e :attr:`SSLSocket.context`. Os métodos :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.get_verified_chain`, :meth:`SSLSocket.get_unverified_chain`, :meth:`SSLSocket.cipher` e :meth:`SSLSocket.compression` requerem que a ligação TLS tenha progredido além do TLS Client Hello e, portanto, não retornarão valores significativos nem podem ser chamados com segurança.

source: The *sni_callback* function must return ``None`` to allow the TLS negotiation to continue. If a TLS failure is required, a constant :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>` can be returned. Other return values will result in a TLS fatal error with :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.
pt_pt: A função *sni_callback* deve retornar ``None`` para permitir que a negociação TLS continue. Se for necessário um falha TLS, pode ser retornada uma constante :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>`. Outros valores de retorno resultarão num erro fatal TLS com :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.

source: If an exception is raised from the *sni_callback* function the TLS connection will terminate with a fatal TLS alert message :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.
pt_pt: Se uma exceção for levantada a partir da função *sni_callback*, a ligação TLS terminará com uma mensagem de alerta fatal TLS :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.

source: This method will raise :exc:`NotImplementedError` if the OpenSSL library had OPENSSL_NO_TLSEXT defined when it was built.
pt_pt: Este método levantará :exc:`NotImplementedError` se a biblioteca OpenSSL tiver sido construída com OPENSSL_NO_TLSEXT definido.

source: This is a legacy API retained for backwards compatibility. When possible, you should use :attr:`sni_callback` instead. The given *server_name_callback* is similar to *sni_callback*, except that when the server hostname is an IDN-encoded internationalized domain name, the *server_name_callback* receives a decoded U-label (``"pythön.org"``).
pt_pt: Esta é uma API legada mantida para compatibilidade retroativa. Sempre que possível, deve usar :attr:`sni_callback` em vez disso. A função *server_name_callback* dada é semelhante a *sni_callback*, exceto que, quando o nome do servidor é um nome de domínio internacionalizado codificado em IDN, o *server_name_callback* recebe um U-label descodificado (``"pythön.org"``).

source: If there is a decoding error on the server name, the TLS connection will terminate with an :const:`ALERT_DESCRIPTION_INTERNAL_ERROR` fatal TLS alert message to the client.
pt_pt: Se houver um erro de descodificação no nome do servidor, a ligação TLS terminará com uma mensagem de alerta fatal TLS :const:`ALERT_DESCRIPTION_INTERNAL_ERROR` para o cliente.

source: Load the key generation parameters for Diffie-Hellman (DH) key exchange. Using DH key exchange improves forward secrecy at the expense of computational resources (both on the server and on the client). The *dhfile* parameter should be the path to a file containing DH parameters in PEM format.
pt_pt: Carrega os parâmetros de geração de chaves para a troca de chaves Diffie-Hellman (DH). O uso da troca de chaves DH melhora a confidencialidade futura à custa de recursos computacionais (tanto no servidor como no cliente). O parâmetro *dhfile* deve ser o caminho para um ficheiro contendo parâmetros DH em formato PEM.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_DH_USE` option to further improve security.
pt_pt: Esta configuração não se aplica a sockets de cliente. Também pode usar a opção :data:`OP_SINGLE_DH_USE` para melhorar ainda mais a segurança.

source: Set the curve name for Elliptic Curve-based Diffie-Hellman (ECDH) key exchange. ECDH is significantly faster than regular DH while arguably as secure. The *curve_name* parameter should be a string describing a well-known elliptic curve, for example ``prime256v1`` for a widely supported curve.
pt_pt: Define o nome da curva para a troca de chaves Diffie-Hellman baseada em Curvas Elípticas (ECDH). O ECDH é significativamente mais rápido do que o DH regular, sendo igualmente seguro. O parâmetro *curve_name* deve ser uma string que descreve uma curva elíptica bem conhecida, por exemplo, ``prime256v1`` para uma curva amplamente suportada.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_ECDH_USE` option to further improve security.
pt_pt: Esta configuração não se aplica a sockets de cliente. Também pode usar a opção :data:`OP_SINGLE_ECDH_USE` para melhorar ainda mais a segurança.

source: This method is not available if :data:`HAS_ECDH` is ``False``.
pt_pt: Este método não está disponível se :data:`HAS_ECDH` for ``False``.

source: `SSL/TLS & Perfect Forward Secrecy <https://vincent.bernat.ch/en/blog/2011-ssl-perfect-forward-secrecy>`_
pt_pt: `SSL/TLS & Confidencialidade Perfeita Futura <https://vincent.bernat.ch/en/blog/2011-ssl-perfect-forward-secrecy>`_

source: Wrap an existing Python socket *sock* and return an instance of :attr:`SSLContext.sslsocket_class` (default :class:`SSLSocket`). The returned SSL socket is tied to the context, its settings and certificates. *sock* must be a :const:`~socket.SOCK_STREAM` socket; other socket types are unsupported.
pt_pt: Envolve um socket Python existente *sock* e retorna uma instância de :attr:`SSLContext.sslsocket_class` (predefinido :class:`SSLSocket`). O socket SSL retornado está associado ao contexto, às suas configurações e certificados. *sock* deve ser um socket :const:`~socket.SOCK_STREAM`; outros tipos de socket não são suportados.

source: The parameter ``server_side`` is a boolean which identifies whether server-side or client-side behavior is desired from this socket.
pt_pt: O parâmetro ``server_side`` é um booleano que identifica se o comportamento desejado para este socket é do lado do servidor ou do lado do cliente.

source: For client-side sockets, the context construction is lazy; if the underlying socket isn't connected yet, the context construction will be performed after :meth:`connect` is called on the socket. For server-side sockets, if the socket has no remote peer, it is assumed to be a listening socket, and the server-side SSL wrapping is automatically performed on client connections accepted via the :meth:`accept` method. The method may raise :exc:`SSLError`.
pt_pt: Para sockets do lado do cliente, a construção do contexto é preguiçosa; se o socket subjacente ainda não estiver ligado, a construção do contexto será realizada após :meth:`connect` ser chamado no socket. Para sockets do lado do servidor, se o socket não tiver um par remoto, assume-se que é um socket de escuta, e o envolvimento SSL do lado do servidor é realizado automaticamente em ligações de clientes aceites através do método :meth:`accept`. O método pode levantar :exc:`SSLError`.

source: On client connections, the optional parameter *server_hostname* specifies the hostname of the service which we are connecting to. This allows a single server to host multiple SSL-based services with distinct certificates, quite similarly to HTTP virtual hosts. Specifying *server_hostname* will raise a :exc:`ValueError` if *server_side* is true.
pt_pt: Nas ligações do cliente, o parâmetro opcional *server_hostname* especifica o nome do host do serviço ao qual nos estamos a ligar. Isto permite que um único servidor aloje vários serviços baseados em SSL com certificados distintos, de forma bastante semelhante aos hosts virtuais HTTP. Especificar *server_hostname* levantará um :exc:`ValueError` se *server_side* for verdadeiro.

source: The parameter ``do_handshake_on_connect`` specifies whether to do the SSL handshake automatically after doing a :meth:`socket.connect`, or whether the application program will call it explicitly, by invoking the :meth:`SSLSocket.do_handshake` method. Calling :meth:`SSLSocket.do_handshake` explicitly gives the program control over the blocking behavior of the socket I/O involved in the handshake.
pt_pt: O parâmetro ``do_handshake_on_connect`` especifica se deve ser feito o handshake SSL automaticamente após um :meth:`socket.connect`, ou se o programa de aplicação o chamará explicitamente, invocando o método :meth:`SSLSocket.do_handshake`. Chamar :meth:`SSLSocket.do_handshake` explicitamente dá ao programa controlo sobre o comportamento de bloqueio do I/O do socket envolvido no handshake.

source: The parameter ``suppress_ragged_eofs`` specifies how the :meth:`SSLSocket.recv` method should signal unexpected EOF from the other end of the connection. If specified as :const:`True` (the default), it returns a normal EOF (an empty bytes object) in response to unexpected EOF errors raised from the underlying socket; if :const:`False`, it will raise the exceptions back to the caller.
pt_pt: O parâmetro ``suppress_ragged_eofs`` especifica como o método :meth:`SSLSocket.recv` deve sinalizar um EOF inesperado da outra extremidade da ligação. Se especificado como :const:`True` (predefinição), retorna um EOF normal (um objeto bytes vazio) em resposta a erros de EOF inesperados levantados a partir do socket subjacente; se :const:`False`, levantará as exceções de volta para o chamador.

source: *session*, see :attr:`~SSLSocket.session`.
pt_pt: *session*, consulte :attr:`~SSLSocket.session`.

source: To wrap an :class:`SSLSocket` in another :class:`SSLSocket`, use :meth:`SSLContext.wrap_bio`.
pt_pt: Para envolver um :class:`SSLSocket` noutro :class:`SSLSocket`, use :meth:`SSLContext.wrap_bio`.

source: Always allow a server_hostname to be passed, even if OpenSSL does not have SNI.
pt_pt: Permitir sempre que um server_hostname seja passado, mesmo que o OpenSSL não tenha SNI.

source: *session* argument was added.
pt_pt: O argumento *session* foi adicionado.

source: The method returns an instance of :attr:`SSLContext.sslsocket_class` instead of hard-coded :class:`SSLSocket`.
pt_pt: O método retorna uma instância de :attr:`SSLContext.sslsocket_class` em vez de :class:`SSLSocket` codificado.

source: The return type of :meth:`SSLContext.wrap_socket`, defaults to :class:`SSLSocket`. The attribute can be assigned to on instances of :class:`SSLContext` in order to return a custom subclass of :class:`SSLSocket`.
pt_pt: O tipo de retorno de :meth:`SSLContext.wrap_socket`, predefinido para :class:`SSLSocket`. O atributo pode ser atribuído a instâncias de :class:`SSLContext` para retornar uma subclasse personalizada de :class:`SSLSocket`.

source: Wrap the BIO objects *incoming* and *outgoing* and return an instance of :attr:`SSLContext.sslobject_class` (default :class:`SSLObject`). The SSL routines will read input data from the incoming BIO and write data to the outgoing BIO.
pt_pt: Envolve os objetos BIO *incoming* e *outgoing* e retorna uma instância de :attr:`SSLContext.sslobject_class` (predefinido :class:`SSLObject`). As rotinas SSL lerão dados de entrada do BIO de entrada e escreverão dados no BIO de saída.

source: The *server_side*, *server_hostname* and *session* parameters have the same meaning as in :meth:`SSLContext.wrap_socket`.
pt_pt: Os parâmetros *server_side*, *server_hostname* e *session* têm o mesmo significado que em :meth:`SSLContext.wrap_socket`.

source: The method returns an instance of :attr:`SSLContext.sslobject_class` instead of hard-coded :class:`SSLObject`.
pt_pt: O método retorna uma instância de :attr:`SSLContext.sslobject_class` em vez de :class:`SSLObject` codificado.

source: The return type of :meth:`SSLContext.wrap_bio`, defaults to :class:`SSLObject`. The attribute can be overridden on instance of class in order to return a custom subclass of :class:`SSLObject`.
pt_pt: O tipo de retorno de :meth:`SSLContext.wrap_bio`, predefinido para :class:`SSLObject`. O atributo pode ser substituído na instância da classe para retornar uma subclasse personalizada de :class:`SSLObject`.

source: Get statistics about the SSL sessions created or managed by this context. A dictionary is returned which maps the names of each `piece of information <https://docs.openssl.org/1.1.1/man3/SSL_CTX_sess_number/>`_ to their numeric values. For example, here is the total number of hits and misses in the session cache since the context was created::
pt_pt: Obtém estatísticas sobre as sessões SSL criadas ou geridas por este contexto. É retornado um dicionário que mapeia os nomes de cada `peça de informação <https://docs.openssl.org/1.1.1/man3/SSL_CTX_sess_number/>`_ para os seus valores numéricos. Por exemplo, aqui está o número total de acertos e falhas na cache de sessão desde que o contexto foi criado::

source: Whether to match the peer cert's hostname in :meth:`SSLSocket.do_handshake`. The context's :attr:`~SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, and you must pass *server_hostname* to :meth:`~SSLContext.wrap_socket` in order to match the hostname. Enabling hostname checking automatically sets :attr:`~SSLContext.verify_mode` from :data:`CERT_NONE` to :data:`CERT_REQUIRED`. It cannot be set back to :data:`CERT_NONE` as long as hostname checking is enabled. The :data:`PROTOCOL_TLS_CLIENT` protocol enables hostname checking by default. With other protocols, hostname checking must be enabled explicitly.
pt_pt: Se deve corresponder ao nome de host do certificado do par em :meth:`SSLSocket.do_handshake`. O :attr:`~SSLContext.verify_mode` do contexto deve ser definido para :data:`CERT_OPTIONAL` ou :data:`CERT_REQUIRED`, e deve passar *server_hostname* para :meth:`~SSLContext.wrap_socket` para corresponder ao nome de host. Ativar a verificação de nome de host define automaticamente :attr:`~SSLContext.verify_mode` de :data:`CERT_NONE` para :data:`CERT_REQUIRED`. Não pode ser redefinido para :data:`CERT_NONE` enquanto a verificação de nome de host estiver ativada. O protocolo :data:`PROTOCOL_TLS_CLIENT` ativa a verificação de nome de host por predefinição. Com outros protocolos, a verificação de nome de host deve ser ativada explicitamente.

source: :attr:`~SSLContext.verify_mode` is now automatically changed to :data:`CERT_REQUIRED` when hostname checking is enabled and :attr:`~SSLContext.verify_mode` is :data:`CERT_NONE`. Previously the same operation would have failed with a :exc:`ValueError`.
pt_pt: :attr:`~SSLContext.verify_mode` é agora automaticamente alterado para :data:`CERT_REQUIRED` quando a verificação de nome de host está ativada e :attr:`~SSLContext.verify_mode` é :data:`CERT_NONE`. Anteriormente, a mesma operação teria falhado com um :exc:`ValueError`.

source: Write TLS keys to a keylog file, whenever key material is generated or received. The keylog file is designed for debugging purposes only. The file format is specified by NSS and used by many traffic analyzers such as Wireshark. The log file is opened in append-only mode. Writes are synchronized between threads, but not between processes.
pt_pt: Escreve chaves TLS num ficheiro de registo de chaves, sempre que material de chave é gerado ou recebido. O ficheiro de registo de chaves é concebido apenas para fins de depuração. O formato do ficheiro é especificado pelo NSS e é usado por muitos analisadores de tráfego, como o Wireshark. O ficheiro de registo é aberto em modo de anexação. As escritas são sincronizadas entre threads, mas não entre processos.

source: A :class:`TLSVersion` enum member representing the highest supported TLS version. The value defaults to :attr:`TLSVersion.MAXIMUM_SUPPORTED`. The attribute is read-only for protocols other than :const:`PROTOCOL_TLS`, :const:`PROTOCOL_TLS_CLIENT`, and :const:`PROTOCOL_TLS_SERVER`.
pt_pt: Um membro :class:`TLSVersion` enum que representa a versão TLS mais alta suportada. O valor predefinido é :attr:`TLSVersion.MAXIMUM_SUPPORTED`. O atributo é de apenas leitura para protocolos diferentes de :const:`PROTOCOL_TLS`, :const:`PROTOCOL_TLS_CLIENT` e :const:`PROTOCOL_TLS_SERVER`.

source: The attributes :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` and :attr:`SSLContext.options` all affect the supported SSL and TLS versions of the context. The implementation does not prevent invalid combination. For example a context with :attr:`OP_NO_TLSv1_2` in :attr:`~SSLContext.options` and :attr:`~SSLContext.maximum_version` set to :attr:`TLSVersion.TLSv1_2` will not be able to establish a TLS 1.2 connection.
pt_pt: Os atributos :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` e :attr:`SSLContext.options` afetam todas as versões SSL e TLS suportadas pelo contexto. A implementação não impede combinações inválidas. Por exemplo, um contexto com :attr:`OP_NO_TLSv1_2` em :attr:`~SSLContext.options` e :attr:`~SSLContext.maximum_version` definido para :attr:`TLSVersion.TLSv1_2` não será capaz de estabelecer uma ligação TLS 1.2.

source: Like :attr:`SSLContext.maximum_version` except it is the lowest supported version or :attr:`TLSVersion.MINIMUM_SUPPORTED`.
pt_pt: Semelhante a :attr:`SSLContext.maximum_version`, exceto que é a versão mínima suportada ou :attr:`TLSVersion.MINIMUM_SUPPORTED`.

source: Control the number of TLS 1.3 session tickets of a :const:`PROTOCOL_TLS_SERVER` context. The setting has no impact on TLS 1.0 to 1.2 connections.
pt_pt: Controla o número de bilhetes de sessão TLS 1.3 de um contexto :const:`PROTOCOL_TLS_SERVER`. A configuração não tem impacto nas ligações TLS 1.0 a 1.2.

source: An integer representing the set of SSL options enabled on this context. The default value is :data:`OP_ALL`, but you can specify other options such as :data:`OP_NO_SSLv2` by ORing them together.
pt_pt: Um inteiro que representa o conjunto de opções SSL ativadas neste contexto. O valor predefinido é :data:`OP_ALL`, mas pode especificar outras opções, como :data:`OP_NO_SSLv2`, combinando-as com OR.

source: :attr:`SSLContext.options` returns :class:`Options` flags:
pt_pt: :attr:`SSLContext.options` retorna flags :class:`Options`:

source: All ``OP_NO_SSL*`` and ``OP_NO_TLS*`` options have been deprecated since Python 3.7. Use :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
pt_pt: Todas as opções ``OP_NO_SSL*`` e ``OP_NO_TLS*`` estão obsoletas desde o Python 3.7. Use :attr:`SSLContext.minimum_version` e :attr:`SSLContext.maximum_version` em vez disso.

source: Enable TLS 1.3 post-handshake client authentication. Post-handshake auth is disabled by default and a server can only request a TLS client certificate during the initial handshake. When enabled, a server may request a TLS client certificate at any time after the handshake.
pt_pt: Ativa a autenticação de cliente pós-handshake TLS 1.3. A autenticação pós-handshake está desativada por predefinição e um servidor só pode solicitar um certificado de cliente TLS durante o handshake inicial. Quando ativada, um servidor pode solicitar um certificado de cliente TLS a qualquer momento após o handshake.

source: When enabled on client-side sockets, the client signals the server that it supports post-handshake authentication.
pt_pt: Quando ativado em sockets do lado do cliente, o cliente sinaliza ao servidor que suporta autenticação pós-handshake.

source: When enabled on server-side sockets, :attr:`SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, too. The actual client cert exchange is delayed until :meth:`SSLSocket.verify_client_post_handshake` is called and some I/O is performed.
pt_pt: Quando ativado em sockets do lado do servidor, :attr:`SSLContext.verify_mode` também deve ser definido para :data:`CERT_OPTIONAL` ou :data:`CERT_REQUIRED`. A troca real de certificados de cliente é adiada até que :meth:`SSLSocket.verify_client_post_handshake` seja chamado e algum I/O seja realizado.

source: The protocol version chosen when constructing the context. This attribute is read-only.
pt_pt: A versão do protocolo escolhida ao construir o contexto. Este atributo é de apenas leitura.

source: Whether :attr:`~SSLContext.check_hostname` falls back to verify the cert's subject common name in the absence of a subject alternative name extension (default: true).
pt_pt: Se :attr:`~SSLContext.check_hostname` recorre à verificação do nome comum do assunto do certificado na ausência de uma extensão de nome alternativo do assunto (predefinição: verdadeiro).

source: The flag had no effect with OpenSSL before version 1.1.1l. Python 3.8.9, 3.9.3, and 3.10 include workarounds for previous versions.
pt_pt: A flag não teve efeito com o OpenSSL antes da versão 1.1.1l. O Python 3.8.9, 3.9.3 e 3.10 incluem soluções alternativas para versões anteriores.

source: An integer representing the `security level <https://docs.openssl.org/master/man3/SSL_CTX_get_security_level/>`_ for the context. This attribute is read-only.
pt_pt: Um inteiro que representa o `nível de segurança <https://docs.openssl.org/master/man3/SSL_CTX_get_security_level/>`_ para o contexto. Este atributo é de apenas leitura.

source: The flags for certificate verification operations. You can set flags like :data:`VERIFY_CRL_CHECK_LEAF` by ORing them together. By default OpenSSL does neither require nor verify certificate revocation lists (CRLs).
pt_pt: As flags para operações de verificação de certificados. Pode definir flags como :data:`VERIFY_CRL_CHECK_LEAF` combinando-as com OR. Por predefinição, o OpenSSL não exige nem verifica listas de revogação de certificados (CRLs).

source: :attr:`SSLContext.verify_flags` returns :class:`VerifyFlags` flags:
pt_pt: :attr:`SSLContext.verify_flags` retorna flags :class:`VerifyFlags`:
