Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: :mod:`!ssl` --- TLS/SSL wrapper for socket objects
pt_pt: :mod:`!ssl` --- Envoltório TLS/SSL para objetos socket

source: **Source code:** :source:`Lib/ssl.py`
pt_pt: **Código fonte:** :source:`Lib/ssl.py`

source: This module provides access to Transport Layer Security (often known as "Secure Sockets Layer") encryption and peer authentication facilities for network sockets, both client-side and server-side. This module uses the OpenSSL library. It is available on all modern Unix systems, Windows, macOS, and probably additional platforms, as long as OpenSSL is installed on that platform.
pt_pt: Este módulo fornece acesso à encriptação Transport Layer Security (muitas vezes conhecida como "Secure Sockets Layer") e às facilidades de autenticação de pares para sockets de rede, tanto do lado do cliente como do lado do servidor. Este módulo usa a biblioteca OpenSSL. Está disponível em todos os sistemas Unix modernos, Windows, macOS, e provavelmente em plataformas adicionais, desde que o OpenSSL esteja instalado nessa plataforma.

source: Some behavior may be platform dependent, since calls are made to the operating system socket APIs. The installed version of OpenSSL may also cause variations in behavior. For example, TLSv1.3 comes with OpenSSL version 1.1.1.
pt_pt: Alguns comportamentos podem ser dependentes da plataforma, uma vez que são feitas chamadas às APIs de socket do sistema operativo. A versão instalada do OpenSSL também pode causar variações no comportamento. Por exemplo, o TLSv1.3 está disponível com a versão 1.1.1 do OpenSSL.

source: Don't use this module without reading the :ref:`ssl-security`. Doing so may lead to a false sense of security, as the default settings of the ssl module are not necessarily appropriate for your application.
pt_pt: Não utilize este módulo sem ler :ref:`ssl-security`. Fazê-lo pode levar a uma falsa sensação de segurança, uma vez que as configurações predefinidas do módulo ssl podem não ser apropriadas para a sua aplicação.

source: Availability
pt_pt: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_pt: Este módulo não funciona ou não está disponível em WebAssembly. Consulte :ref:`wasm-availability` para mais informações.

source: This section documents the objects and functions in the ``ssl`` module; for more general information about TLS, SSL, and certificates, the reader is referred to the documents in the "See Also" section at the bottom.
pt_pt: Esta secção documenta os objetos e funções no módulo ``ssl``; para informações mais gerais sobre TLS, SSL e certificados, o leitor é remetido para os documentos na secção "Veja Também" no final.

source: This module provides a class, :class:`ssl.SSLSocket`, which is derived from the :class:`socket.socket` type, and provides a socket-like wrapper that also encrypts and decrypts the data going over the socket with SSL. It supports additional methods such as :meth:`getpeercert`, which retrieves the certificate of the other side of the connection, :meth:`cipher`, which retrieves the cipher being used for the secure connection or :meth:`get_verified_chain`, :meth:`get_unverified_chain` which retrieves certificate chain.
pt_pt: Este módulo fornece uma classe, :class:`ssl.SSLSocket`, que é derivada do tipo :class:`socket.socket`, e fornece um envoltório semelhante a um socket que também encripta e desencripta os dados que passam pelo socket com SSL. Suporta métodos adicionais como :meth:`getpeercert`, que recupera o certificado do outro lado da ligação, :meth:`cipher`, que recupera a cifra usada para a ligação segura, ou :meth:`get_verified_chain`, :meth:`get_unverified_chain` que recupera a cadeia de certificados.

source: For more sophisticated applications, the :class:`ssl.SSLContext` class helps manage settings and certificates, which can then be inherited by SSL sockets created through the :meth:`SSLContext.wrap_socket` method.
pt_pt: Para aplicações mais sofisticadas, a classe :class:`ssl.SSLContext` ajuda a gerir configurações e certificados, que podem então ser herdados por sockets SSL criados através do método :meth:`SSLContext.wrap_socket`.

source: Updated to support linking with OpenSSL 1.1.0
pt_pt: Atualizado para suportar ligação com OpenSSL 1.1.0

source: OpenSSL 0.9.8, 1.0.0 and 1.0.1 are deprecated and no longer supported. In the future the ssl module will require at least OpenSSL 1.0.2 or 1.1.0.
pt_pt: OpenSSL 0.9.8, 1.0.0 e 1.0.1 estão obsoleto e já não são suportados. No futuro, o módulo ssl irá requerer pelo menos OpenSSL 1.0.2 ou 1.1.0.

source: :pep:`644` has been implemented. The ssl module requires OpenSSL 1.1.1 or newer.
pt_pt: :pep:`644` foi implementado. O módulo ssl requer OpenSSL 1.1.1 ou mais recente.

source: Use of deprecated constants and functions result in deprecation warnings.
pt_pt: O uso de constantes e funções obsoletas resulta em avisos de obsolescência.

source: Functions, Constants, and Exceptions
pt_pt: Funções, constantes e exceções

source: Socket creation
pt_pt: Criação de socket

source: Instances of :class:`SSLSocket` must be created using the :meth:`SSLContext.wrap_socket` method. The helper function :func:`create_default_context` returns a new context with secure default settings.
pt_pt: Instâncias de :class:`SSLSocket` devem ser criadas usando o método :meth:`SSLContext.wrap_socket`. A função auxiliar :func:`create_default_context` retorna um novo contexto com configurações seguras predefinidas.

source: Client socket example with default context and IPv4/IPv6 dual stack::
pt_pt: Exemplo de socket cliente com contexto predefinido e pilha dupla IPv4/IPv6::

source: Client socket example with custom context and IPv4::
pt_pt: Exemplo de socket cliente com contexto personalizado e IPv4::

source: hostname = 'www.python.org' # PROTOCOL_TLS_CLIENT requires valid cert chain and hostname context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.load_verify_locations('path/to/cabundle.pem') with socket.socket(socket.AF_INET, socket.SOCK_STREAM, 0) as sock: with context.wrap_socket(sock, server_hostname=hostname) as ssock: print(ssock.version())
pt_pt: hostname = 'www.python.org' # PROTOCOL_TLS_CLIENT requer cadeia de certificados válida e nome de host context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.load_verify_locations('path/to/cabundle.pem') with socket.socket(socket.AF_INET, socket.SOCK_STREAM, 0) as sock: with context.wrap_socket(sock, server_hostname=hostname) as ssock: print(ssock.version())

source: Server socket example listening on localhost IPv4::
pt_pt: Exemplo de socket servidor à escuta em localhost IPv4::

source: Context creation
pt_pt: Criação de contexto

source: A convenience function helps create :class:`SSLContext` objects for common purposes.
pt_pt: Uma função de conveniência ajuda a criar objetos :class:`SSLContext` para fins comuns.

source: Return a new :class:`SSLContext` object with default settings for the given *purpose*. The settings are chosen by the :mod:`ssl` module, and usually represent a higher security level than when calling the :class:`SSLContext` constructor directly.
pt_pt: Retorna um novo objeto :class:`SSLContext` com configurações predefinidas para o *purpose* dado. As configurações são escolhidas pelo módulo :mod:`ssl`, e geralmente representam um nível de segurança mais elevado do que ao chamar diretamente o construtor :class:`SSLContext`.

source: *cafile*, *capath*, *cadata* represent optional CA certificates to trust for certificate verification, as in :meth:`SSLContext.load_verify_locations`. If all three are :const:`None`, this function can choose to trust the system's default CA certificates instead.
pt_pt: *cafile*, *capath*, *cadata* representam certificados CA opcionais para confiar na verificação de certificados, como em :meth:`SSLContext.load_verify_locations`. Se todos os três forem :const:`None`, esta função pode escolher confiar nos certificados CA predefinidos do sistema.

source: The settings are: :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2`, and :data:`OP_NO_SSLv3` with high encryption cipher suites without RC4 and without unauthenticated cipher suites. Passing :const:`~Purpose.SERVER_AUTH` as *purpose* sets :data:`~SSLContext.verify_mode` to :data:`CERT_REQUIRED` and either loads CA certificates (when at least one of *cafile*, *capath* or *cadata* is given) or uses :meth:`SSLContext.load_default_certs` to load default CA certificates.
pt_pt: As configurações são: :data:`PROTOCOL_TLS_CLIENT` ou :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2`, e :data:`OP_NO_SSLv3` com suites de cifras de encriptação forte sem RC4 e sem suites de cifras não autenticadas. Passar :const:`~Purpose.SERVER_AUTH` como *purpose* define :data:`~SSLContext.verify_mode` para :data:`CERT_REQUIRED` e carrega certificados CA (quando pelo menos um de *cafile*, *capath* ou *cadata* é fornecido) ou usa :meth:`SSLContext.load_default_certs` para carregar certificados CA predefinidos.

source: When :attr:`~SSLContext.keylog_filename` is supported and the environment variable :envvar:`SSLKEYLOGFILE` is set, :func:`create_default_context` enables key logging.
pt_pt: Quando :attr:`~SSLContext.keylog_filename` é suportado e a variável de ambiente :envvar:`SSLKEYLOGFILE` está definida, :func:`create_default_context` ativa o registo de chaves.

source: The default settings for this context include :data:`VERIFY_X509_PARTIAL_CHAIN` and :data:`VERIFY_X509_STRICT`. These make the underlying OpenSSL implementation behave more like a conforming implementation of :rfc:`5280`, in exchange for a small amount of incompatibility with older X.509 certificates.
pt_pt: As configurações predefinidas para este contexto incluem :data:`VERIFY_X509_PARTIAL_CHAIN` e :data:`VERIFY_X509_STRICT`. Estas fazem com que a implementação subjacente do OpenSSL se comporte mais como uma implementação conforme de :rfc:`5280`, em troca de uma pequena quantidade de incompatibilidade com certificados X.509 mais antigos.

source: The protocol, options, cipher and other settings may change to more restrictive values anytime without prior deprecation. The values represent a fair balance between compatibility and security.
pt_pt: O protocolo, opções, cifras e outras configurações podem mudar para valores mais restritivos a qualquer momento sem aviso prévio de obsolescência. Os valores representam um equilíbrio justo entre compatibilidade e segurança.

source: If your application needs specific settings, you should create a :class:`SSLContext` and apply the settings yourself.
pt_pt: Se a sua aplicação necessitar de configurações específicas, deve criar um :class:`SSLContext` e aplicar as configurações você mesmo.

source: If you find that when certain older clients or servers attempt to connect with a :class:`SSLContext` created by this function that they get an error stating "Protocol or cipher suite mismatch", it may be that they only support SSL3.0 which this function excludes using the :data:`OP_NO_SSLv3`. SSL3.0 is widely considered to be `completely broken <https://en.wikipedia.org/wiki/POODLE>`_. If you still wish to continue to use this function but still allow SSL 3.0 connections you can re-enable them using::
pt_pt: Se descobrir que quando certos clientes ou servidores mais antigos tentam ligar-se com um :class:`SSLContext` criado por esta função obtêm um erro indicando "Protocol or cipher suite mismatch", pode ser que eles só suportem SSL3.0, que esta função exclui usando :data:`OP_NO_SSLv3`. O SSL3.0 é amplamente considerado `completamente quebrado <https://en.wikipedia.org/wiki/POODLE>`_. Se ainda assim desejar continuar a usar esta função, mas ainda permitir ligações SSL 3.0, pode reativá-las usando::

source: This context enables :data:`VERIFY_X509_STRICT` by default, which may reject pre-:rfc:`5280` or malformed certificates that the underlying OpenSSL implementation otherwise would accept. While disabling this is not recommended, you can do so using::
pt_pt: Este contexto ativa :data:`VERIFY_X509_STRICT` por predefinição, o que pode rejeitar certificados pré-:rfc:`5280` ou malformados que a implementação subjacente do OpenSSL aceitaria de outra forma. Embora desativar isto não seja recomendado, pode fazê-lo usando::

source: RC4 was dropped from the default cipher string.
pt_pt: RC4 foi removido da string de cifras predefinida.

source: ChaCha20/Poly1305 was added to the default cipher string.
pt_pt: ChaCha20/Poly1305 foi adicionado à string de cifras predefinida.

source: 3DES was dropped from the default cipher string.
pt_pt: 3DES foi removido da string de cifras predefinida.

source: Support for key logging to :envvar:`SSLKEYLOGFILE` was added.
pt_pt: Suporte para registo de chaves em :envvar:`SSLKEYLOGFILE` foi adicionado.

source: The context now uses :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol instead of generic :data:`PROTOCOL_TLS`.
pt_pt: O contexto agora usa o protocolo :data:`PROTOCOL_TLS_CLIENT` ou :data:`PROTOCOL_TLS_SERVER` em vez do protocolo genérico :data:`PROTOCOL_TLS`.

source: The context now uses :data:`VERIFY_X509_PARTIAL_CHAIN` and :data:`VERIFY_X509_STRICT` in its default verify flags.
pt_pt: O contexto agora usa :data:`VERIFY_X509_PARTIAL_CHAIN` e :data:`VERIFY_X509_STRICT` nas suas flags de verificação predefinidas.

source: Exceptions
pt_pt: Exceções

source: Raised to signal an error from the underlying SSL implementation (currently provided by the OpenSSL library). This signifies some problem in the higher-level encryption and authentication layer that's superimposed on the underlying network connection. This error is a subtype of :exc:`OSError`. The error code and message of :exc:`SSLError` instances are provided by the OpenSSL library.
pt_pt: Levantada para sinalizar um erro da implementação SSL subjacente (atualmente fornecida pela biblioteca OpenSSL). Isto significa algum problema na camada de encriptação e autenticação de nível superior que é sobreposta à ligação de rede subjacente. Este erro é um subtipo de :exc:`OSError`. O código de erro e mensagem das instâncias :exc:`SSLError` são fornecidos pela biblioteca OpenSSL.

source: :exc:`SSLError` used to be a subtype of :exc:`socket.error`.
pt_pt: :exc:`SSLError` costumava ser um subtipo de :exc:`socket.error`.

source: A string mnemonic designating the OpenSSL submodule in which the error occurred, such as ``SSL``, ``PEM`` or ``X509``. The range of possible values depends on the OpenSSL version.
pt_pt: Uma string mnemónica que designa o submódulo OpenSSL no qual o erro ocorreu, como ``SSL``, ``PEM`` ou ``X509``. A gama de valores possíveis depende da versão do OpenSSL.

source: A string mnemonic designating the reason this error occurred, for example ``CERTIFICATE_VERIFY_FAILED``. The range of possible values depends on the OpenSSL version.
pt_pt: Uma string mnemónica que designa a razão pela qual este erro ocorreu, por exemplo, ``CERTIFICATE_VERIFY_FAILED``. A gama de valores possíveis depende da versão do OpenSSL.

source: A subclass of :exc:`SSLError` raised when trying to read or write and the SSL connection has been closed cleanly. Note that this doesn't mean that the underlying transport (read TCP) has been closed.
pt_pt: Uma subclasse de :exc:`SSLError` levantada ao tentar ler ou escrever e a ligação SSL ter sido fechada de forma limpa. Note que isto não significa que o transporte subjacente (leia-se TCP) tenha sido fechado.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be received on the underlying TCP transport before the request can be fulfilled.
pt_pt: Uma subclasse de :exc:`SSLError` levantada por um :ref:`socket SSL não bloqueante <ssl-nonblocking>` ao tentar ler ou escrever dados, mas mais dados precisam de ser recebidos no transporte TCP subjacente antes que o pedido possa ser cumprido.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be sent on the underlying TCP transport before the request can be fulfilled.
pt_pt: Uma subclasse de :exc:`SSLError` levantada por um :ref:`socket SSL não bloqueante <ssl-nonblocking>` ao tentar ler ou escrever dados, mas mais dados precisam de ser enviados no transporte TCP subjacente antes que o pedido possa ser cumprido.

source: A subclass of :exc:`SSLError` raised when a system error was encountered while trying to fulfill an operation on a SSL socket. Unfortunately, there is no easy way to inspect the original errno number.
pt_pt: Uma subclasse de :exc:`SSLError` levantada quando um erro de sistema foi encontrado ao tentar cumprir uma operação num socket SSL. Infelizmente, não há uma forma fácil de inspecionar o número errno original.

source: A subclass of :exc:`SSLError` raised when the SSL connection has been terminated abruptly. Generally, you shouldn't try to reuse the underlying transport when this error is encountered.
pt_pt: Uma subclasse de :exc:`SSLError` levantada quando a ligação SSL foi terminada abruptamente. Geralmente, não deve tentar reutilizar o transporte subjacente quando este erro é encontrado.

source: A subclass of :exc:`SSLError` raised when certificate validation has failed.
pt_pt: Uma subclasse de :exc:`SSLError` levantada quando a validação de certificado falhou.

source: A numeric error number that denotes the verification error.
pt_pt: Um número de erro numérico que denota o erro de verificação.

source: A human readable string of the verification error.
pt_pt: Uma string legível do erro de verificação.

source: An alias for :exc:`SSLCertVerificationError`.
pt_pt: Um alias para :exc:`SSLCertVerificationError`.

source: The exception is now an alias for :exc:`SSLCertVerificationError`.
pt_pt: A exceção é agora um alias para :exc:`SSLCertVerificationError`.

source: Random generation
pt_pt: Geração aleatória

source: Return *num* cryptographically strong pseudo-random bytes. Raises an :class:`SSLError` if the PRNG has not been seeded with enough data or if the operation is not supported by the current RAND method. :func:`RAND_status` can be used to check the status of the PRNG and :func:`RAND_add` can be used to seed the PRNG.
pt_pt: Retorna *num* bytes pseudo-aleatórios criptograficamente fortes. Levanta um :class:`SSLError` se o PRNG não tiver sido inicializado com dados suficientes ou se a operação não for suportada pelo método RAND atual. :func:`RAND_status` pode ser usado para verificar o estado do PRNG e :func:`RAND_add` pode ser usado para inicializar o PRNG.

source: For almost all applications :func:`os.urandom` is preferable.
pt_pt: Para quase todas as aplicações, :func:`os.urandom` é preferível.

source: Read the Wikipedia article, `Cryptographically secure pseudorandom number generator (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>`_, to get the requirements of a cryptographically strong generator.
pt_pt: Leia o artigo da Wikipedia, `Gerador de números pseudo-aleatórios criptograficamente seguro (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>`_, para obter os requisitos de um gerador criptograficamente forte.

source: Return ``True`` if the SSL pseudo-random number generator has been seeded with 'enough' randomness, and ``False`` otherwise. You can use :func:`ssl.RAND_egd` and :func:`ssl.RAND_add` to increase the randomness of the pseudo-random number generator.
pt_pt: Retorna ``True`` se o gerador de números pseudo-aleatórios SSL tiver sido inicializado com 'suficiente' aleatoriedade, e ``False`` caso contrário. Pode usar :func:`ssl.RAND_egd` e :func:`ssl.RAND_add` para aumentar a aleatoriedade do gerador de números pseudo-aleatórios.

source: Mix the given *bytes* into the SSL pseudo-random number generator. The parameter *entropy* (a float) is a lower bound on the entropy contained in string (so you can always use ``0.0``). See :rfc:`1750` for more information on sources of entropy.
pt_pt: Mistura os *bytes* dados no gerador de números pseudo-aleatórios SSL. O parâmetro *entropy* (um float) é um limite inferior da entropia contida na string (portanto, pode sempre usar ``0.0``). Consulte :rfc:`1750` para mais informações sobre fontes de entropia.

source: Writable :term:`bytes-like object` is now accepted.
pt_pt: Objeto :term:`bytes-like` gravável é agora aceite.

source: Certificate handling
pt_pt: Manipulação de certificados

source: Return the time in seconds since the Epoch, given the ``cert_time`` string representing the "notBefore" or "notAfter" date from a certificate in ``"%b %d %H:%M:%S %Y %Z"`` strptime format (C locale).
pt_pt: Retorna o tempo em segundos desde a Época, dada a string ``cert_time`` que representa a data "notBefore" ou "notAfter" de um certificado no formato ``"%b %d %H:%M:%S %Y %Z"`` strptime (localidade C).

source: Here's an example:
pt_pt: Aqui está um exemplo:

source: "notBefore" or "notAfter" dates must use GMT (:rfc:`5280`).
pt_pt: As datas "notBefore" ou "notAfter" devem usar GMT (:rfc:`5280`).

source: Interpret the input time as a time in UTC as specified by 'GMT' timezone in the input string. Local timezone was used previously. Return an integer (no fractions of a second in the input format)
pt_pt: Interpreta o tempo de entrada como um tempo em UTC conforme especificado pela zona horária 'GMT' na string de entrada. A zona horária local era usada anteriormente. Retorna um inteiro (sem frações de segundo no formato de entrada).

source: Given the address ``addr`` of an SSL-protected server, as a (*hostname*, *port-number*) pair, fetches the server's certificate, and returns it as a PEM-encoded string. If ``ssl_version`` is specified, uses that version of the SSL protocol to attempt to connect to the server. If *ca_certs* is specified, it should be a file containing a list of root certificates, the same format as used for the *cafile* parameter in :meth:`SSLContext.load_verify_locations`. The call will attempt to validate the server certificate against that set of root certificates, and will fail if the validation attempt fails. A timeout can be specified with the ``timeout`` parameter.
pt_pt: Dado o endereço ``addr`` de um servidor protegido por SSL, como um par (*hostname*, *port-number*), obtém o certificado do servidor e retorna-o como uma string codificada em PEM. Se ``ssl_version`` for especificado, usa essa versão do protocolo SSL para tentar ligar-se ao servidor. Se *ca_certs* for especificado, deve ser um ficheiro contendo uma lista de certificados raiz, no mesmo formato usado para o parâmetro *cafile* em :meth:`SSLContext.load_verify_locations`. A chamada tentará validar o certificado do servidor contra esse conjunto de certificados raiz e falhará se a tentativa de validação falhar. Um tempo limite pode ser especificado com o parâmetro ``timeout``.

source: This function is now IPv6-compatible.
pt_pt: Esta função é agora compatível com IPv6.

source: The default *ssl_version* is changed from :data:`PROTOCOL_SSLv3` to :data:`PROTOCOL_TLS` for maximum compatibility with modern servers.
pt_pt: A versão predefinida *ssl_version* foi alterada de :data:`PROTOCOL_SSLv3` para :data:`PROTOCOL_TLS` para máxima compatibilidade com servidores modernos.

source: The *timeout* parameter was added.
pt_pt: O parâmetro *timeout* foi adicionado.

source: Given a certificate as a DER-encoded blob of bytes, returns a PEM-encoded string version of the same certificate.
pt_pt: Dado um certificado como um blob de bytes codificado em DER, retorna uma versão em string codificada em PEM do mesmo certificado.
