Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: Whether to try to verify other peers' certificates and how to behave if verification fails. This attribute must be one of :data:`CERT_NONE`, :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`.
pt_pt: Se deve tentar verificar os certificados de outros pares e como se comportar se a verificação falhar. Este atributo deve ser um de :data:`CERT_NONE`, :data:`CERT_OPTIONAL` ou :data:`CERT_REQUIRED`.

source: :attr:`SSLContext.verify_mode` returns :class:`VerifyMode` enum:
pt_pt: :attr:`SSLContext.verify_mode` retorna enum :class:`VerifyMode`:

source: Enables TLS-PSK (pre-shared key) authentication on a client-side connection.
pt_pt: Ativa a autenticação TLS-PSK (chave pré-compartilhada) numa ligação do lado do cliente.

source: In general, certificate based authentication should be preferred over this method.
pt_pt: Em geral, a autenticação baseada em certificados deve ser preferida em relação a este método.

source: The parameter ``callback`` is a callable object with the signature: ``def callback(hint: str | None) -> tuple[str | None, bytes]``. The ``hint`` parameter is an optional identity hint sent by the server. The return value is a tuple in the form (client-identity, psk). Client-identity is an optional string which may be used by the server to select a corresponding PSK for the client. The string must be less than or equal to ``256`` octets when UTF-8 encoded. PSK is a :term:`bytes-like object` representing the pre-shared key. Return a zero length PSK to reject the connection.
pt_pt: O parâmetro ``callback`` é um objeto chamável com a assinatura: ``def callback(hint: str | None) -> tuple[str | None, bytes]``. O parâmetro ``hint`` é uma sugestão de identidade opcional enviada pelo servidor. O valor de retorno é um tuplo na forma (client-identity, psk). Client-identity é uma string opcional que pode ser usada pelo servidor para selecionar uma PSK correspondente para o cliente. A string deve ter menos ou igual a ``256`` octetos quando codificada em UTF-8. PSK é um objeto :term:`bytes-like` que representa a chave pré-compartilhada. Retorne uma PSK de comprimento zero para rejeitar a ligação.

source: Setting ``callback`` to :const:`None` removes any existing callback.
pt_pt: Definir ``callback`` para :const:`None` remove qualquer função de retorno de chamada existente.

source: When using TLS 1.3:
pt_pt: Ao usar TLS 1.3:

source: the ``hint`` parameter is always :const:`None`.
pt_pt: o parâmetro ``hint`` é sempre :const:`None`.

source: client-identity must be a non-empty string.
pt_pt: client-identity deve ser uma string não vazia.

source: Example usage::
pt_pt: Exemplo de utilização::

source: context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.check_hostname = False context.verify_mode = ssl.CERT_NONE context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # A simple lambda: psk = bytes.fromhex('c0ffee') context.set_psk_client_callback(lambda hint: (None, psk)) # A table using the hint from the server: psk_table = { 'ServerId_1': bytes.fromhex('c0ffee'), 'ServerId_2': bytes.fromhex('facade') } def callback(hint): return 'ClientId_1', psk_table.get(hint, b'') context.set_psk_client_callback(callback)
pt_pt: context = ssl.SSLContext(ssl.PROTOCOL_TLS_CLIENT) context.check_hostname = False context.verify_mode = ssl.CERT_NONE context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # Uma lambda simples: psk = bytes.fromhex('c0ffee') context.set_psk_client_callback(lambda hint: (None, psk)) # Uma tabela usando a sugestão do servidor: psk_table = { 'ServerId_1': bytes.fromhex('c0ffee'), 'ServerId_2': bytes.fromhex('facade') } def callback(hint): return 'ClientId_1', psk_table.get(hint, b'') context.set_psk_client_callback(callback)

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_PSK` is ``False``.
pt_pt: Este método levantará :exc:`NotImplementedError` se :data:`HAS_PSK` for ``False``.

source: Enables TLS-PSK (pre-shared key) authentication on a server-side connection.
pt_pt: Ativa a autenticação TLS-PSK (chave pré-compartilhada) numa ligação do lado do servidor.

source: The parameter ``callback`` is a callable object with the signature: ``def callback(identity: str | None) -> bytes``. The ``identity`` parameter is an optional identity sent by the client which can be used to select a corresponding PSK. The return value is a :term:`bytes-like object` representing the pre-shared key. Return a zero length PSK to reject the connection.
pt_pt: O parâmetro ``callback`` é um objeto chamável com a assinatura: ``def callback(identity: str | None) -> bytes``. O parâmetro ``identity`` é uma identidade opcional enviada pelo cliente que pode ser usada para selecionar uma PSK correspondente. O valor de retorno é um objeto :term:`bytes-like` que representa a chave pré-compartilhada. Retorne uma PSK de comprimento zero para rejeitar a ligação.

source: The parameter ``identity_hint`` is an optional identity hint string sent to the client. The string must be less than or equal to ``256`` octets when UTF-8 encoded.
pt_pt: O parâmetro ``identity_hint`` é uma string de sugestão de identidade opcional enviada ao cliente. A string deve ter menos ou igual a ``256`` octetos quando codificada em UTF-8.

source: When using TLS 1.3 the ``identity_hint`` parameter is not sent to the client.
pt_pt: Ao usar TLS 1.3, o parâmetro ``identity_hint`` não é enviado ao cliente.

source: context = ssl.SSLContext(ssl.PROTOCOL_TLS_SERVER) context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # A simple lambda: psk = bytes.fromhex('c0ffee') context.set_psk_server_callback(lambda identity: psk) # A table using the identity of the client: psk_table = { 'ClientId_1': bytes.fromhex('c0ffee'), 'ClientId_2': bytes.fromhex('facade') } def callback(identity): return psk_table.get(identity, b'') context.set_psk_server_callback(callback, 'ServerId_1')
pt_pt: context = ssl.SSLContext(ssl.PROTOCOL_TLS_SERVER) context.maximum_version = ssl.TLSVersion.TLSv1_2 context.set_ciphers('PSK') # Uma lambda simples: psk = bytes.fromhex('c0ffee') context.set_psk_server_callback(lambda identity: psk) # Uma tabela usando a identidade do cliente: psk_table = { 'ClientId_1': bytes.fromhex('c0ffee'), 'ClientId_2': bytes.fromhex('facade') } def callback(identity): return psk_table.get(identity, b'') context.set_psk_server_callback(callback, 'ServerId_1')

source: Certificates
pt_pt: Certificados

source: Certificates in general are part of a public-key / private-key system. In this system, each *principal*, (which may be a machine, or a person, or an organization) is assigned a unique two-part encryption key. One part of the key is public, and is called the *public key*; the other part is kept secret, and is called the *private key*. The two parts are related, in that if you encrypt a message with one of the parts, you can decrypt it with the other part, and **only** with the other part.
pt_pt: Os certificados, em geral, fazem parte de um sistema de chave pública/chave privada. Neste sistema, cada *entidade* (que pode ser uma máquina, uma pessoa ou uma organização) é atribuída uma chave de encriptação única de duas partes. Uma parte da chave é pública e é chamada de *chave pública*; a outra parte é mantida secreta e é chamada de *chave privada*. As duas partes estão relacionadas, no sentido de que, se encriptar uma mensagem com uma das partes, pode desencriptá-la com a outra parte, e **apenas** com a outra parte.

source: A certificate contains information about two principals. It contains the name of a *subject*, and the subject's public key. It also contains a statement by a second principal, the *issuer*, that the subject is who they claim to be, and that this is indeed the subject's public key. The issuer's statement is signed with the issuer's private key, which only the issuer knows. However, anyone can verify the issuer's statement by finding the issuer's public key, decrypting the statement with it, and comparing it to the other information in the certificate. The certificate also contains information about the time period over which it is valid. This is expressed as two fields, called "notBefore" and "notAfter".
pt_pt: Um certificado contém informações sobre duas entidades. Contém o nome de um *assunto* e a chave pública do assunto. Também contém uma declaração de uma segunda entidade, o *emissor*, de que o assunto é quem afirma ser, e de que esta é, de facto, a chave pública do assunto. A declaração do emissor é assinada com a chave privada do emissor, que apenas o emissor conhece. No entanto, qualquer pessoa pode verificar a declaração do emissor encontrando a chave pública do emissor, desencriptando a declaração com ela e comparando-a com as outras informações no certificado. O certificado também contém informações sobre o período de tempo durante o qual é válido. Isto é expresso como dois campos, chamados "notBefore" e "notAfter".

source: In the Python use of certificates, a client or server can use a certificate to prove who they are. The other side of a network connection can also be required to produce a certificate, and that certificate can be validated to the satisfaction of the client or server that requires such validation. The connection attempt can be set to raise an exception if the validation fails. Validation is done automatically, by the underlying OpenSSL framework; the application need not concern itself with its mechanics. But the application does usually need to provide sets of certificates to allow this process to take place.
pt_pt: Na utilização de certificados em Python, um cliente ou servidor pode usar um certificado para provar quem são. O outro lado de uma ligação de rede também pode ser obrigado a apresentar um certificado, e esse certificado pode ser validado para satisfação do cliente ou servidor que exige tal validação. A tentativa de ligação pode ser configurada para levantar uma exceção se a validação falhar. A validação é feita automaticamente pela estrutura subjacente OpenSSL; a aplicação não precisa preocupar-se com os seus mecanismos. No entanto, a aplicação geralmente precisa fornecer conjuntos de certificados para permitir que este processo ocorra.

source: Python uses files to contain certificates. They should be formatted as "PEM" (see :rfc:`1422`), which is a base-64 encoded form wrapped with a header line and a footer line::
pt_pt: O Python usa ficheiros para conter certificados. Devem estar formatados como "PEM" (consulte :rfc:`1422`), que é uma forma codificada em base-64 envolvida por uma linha de cabeçalho e uma linha de rodapé::

source: -----BEGIN CERTIFICATE----- ... (certificate in base64 PEM encoding) ... -----END CERTIFICATE-----
pt_pt: -----BEGIN CERTIFICATE----- ... (certificado em codificação base64 PEM) ... -----END CERTIFICATE-----

source: Certificate chains
pt_pt: Cadeias de certificados

source: The Python files which contain certificates can contain a sequence of certificates, sometimes called a *certificate chain*. This chain should start with the specific certificate for the principal who "is" the client or server, and then the certificate for the issuer of that certificate, and then the certificate for the issuer of *that* certificate, and so on up the chain till you get to a certificate which is *self-signed*, that is, a certificate which has the same subject and issuer, sometimes called a *root certificate*. The certificates should just be concatenated together in the certificate file. For example, suppose we had a three certificate chain, from our server certificate to the certificate of the certification authority that signed our server certificate, to the root certificate of the agency which issued the certification authority's certificate::
pt_pt: Os ficheiros Python que contêm certificados podem conter uma sequência de certificados, por vezes chamada de *cadeia de certificados*. Esta cadeia deve começar com o certificado específico para a entidade que "é" o cliente ou servidor, seguido do certificado para o emissor desse certificado, e depois o certificado para o emissor desse certificado, e assim por diante até chegar a um certificado que é *autoassinado*, ou seja, um certificado que tem o mesmo assunto e emissor, por vezes chamado de *certificado raiz*. Os certificados devem ser simplesmente concatenados no ficheiro de certificados. Por exemplo, suponha que temos uma cadeia de três certificados, do nosso certificado de servidor para o certificado da autoridade de certificação que assinou o nosso certificado de servidor, até ao certificado raiz da agência que emitiu o certificado da autoridade de certificação::

source: -----BEGIN CERTIFICATE----- ... (certificate for your server)... -----END CERTIFICATE----- -----BEGIN CERTIFICATE----- ... (the certificate for the CA)... -----END CERTIFICATE----- -----BEGIN CERTIFICATE----- ... (the root certificate for the CA's issuer)... -----END CERTIFICATE-----
pt_pt: -----BEGIN CERTIFICATE----- ... (certificado para o seu servidor)... -----END CERTIFICATE----- -----BEGIN CERTIFICATE----- ... (o certificado para a CA)... -----END CERTIFICATE----- -----BEGIN CERTIFICATE----- ... (o certificado raiz para o emissor da CA)... -----END CERTIFICATE-----

source: CA certificates
pt_pt: Certificados CA

source: If you are going to require validation of the other side of the connection's certificate, you need to provide a "CA certs" file, filled with the certificate chains for each issuer you are willing to trust. Again, this file just contains these chains concatenated together. For validation, Python will use the first chain it finds in the file which matches. The platform's certificates file can be used by calling :meth:`SSLContext.load_default_certs`, this is done automatically with :func:`.create_default_context`.
pt_pt: Se pretender exigir a validação do certificado do outro lado da ligação, precisa de fornecer um ficheiro de "certificados CA", preenchido com as cadeias de certificados para cada emissor em que está disposto a confiar. Mais uma vez, este ficheiro contém apenas estas cadeias concatenadas. Para validação, o Python usará a primeira cadeia que encontrar no ficheiro que corresponda. O ficheiro de certificados da plataforma pode ser usado chamando :meth:`SSLContext.load_default_certs`; isto é feito automaticamente com :func:`.create_default_context`.

source: Combined key and certificate
pt_pt: Chave e certificado combinados

source: Often the private key is stored in the same file as the certificate; in this case, only the ``certfile`` parameter to :meth:`SSLContext.load_cert_chain` needs to be passed. If the private key is stored with the certificate, it should come before the first certificate in the certificate chain::
pt_pt: Muitas vezes, a chave privada é armazenada no mesmo ficheiro que o certificado; neste caso, apenas o parâmetro ``certfile`` para :meth:`SSLContext.load_cert_chain` precisa de ser passado. Se a chave privada for armazenada com o certificado, deve vir antes do primeiro certificado na cadeia de certificados::

source: -----BEGIN RSA PRIVATE KEY----- ... (private key in base64 encoding) ... -----END RSA PRIVATE KEY----- -----BEGIN CERTIFICATE----- ... (certificate in base64 PEM encoding) ... -----END CERTIFICATE-----
pt_pt: -----BEGIN RSA PRIVATE KEY----- ... (chave privada em codificação base64) ... -----END RSA PRIVATE KEY----- -----BEGIN CERTIFICATE----- ... (certificado em codificação base64 PEM) ... -----END CERTIFICATE-----

source: Self-signed certificates
pt_pt: Certificados autoassinados

source: If you are going to create a server that provides SSL-encrypted connection services, you will need to acquire a certificate for that service. There are many ways of acquiring appropriate certificates, such as buying one from a certification authority. Another common practice is to generate a self-signed certificate. The simplest way to do this is with the OpenSSL package, using something like the following::
pt_pt: Se pretender criar um servidor que forneça serviços de ligação encriptados com SSL, precisará de adquirir um certificado para esse serviço. Existem muitas formas de adquirir certificados apropriados, como comprar um de uma autoridade de certificação. Outra prática comum é gerar um certificado autoassinado. A forma mais simples de fazer isto é com o pacote OpenSSL, usando algo como o seguinte::

source: % openssl req -new -x509 -days 365 -nodes -out cert.pem -keyout cert.pem Generating a 1024 bit RSA private key .......++++++ .............................++++++ writing new private key to 'cert.pem' ----- You are about to be asked to enter information that will be incorporated into your certificate request. What you are about to enter is what is called a Distinguished Name or a DN. There are quite a few fields but you can leave some blank For some fields there will be a default value, If you enter '.', the field will be left blank. ----- Country Name (2 letter code) [AU]:US State or Province Name (full name) [Some-State]:MyState Locality Name (eg, city) []:Some City Organization Name (eg, company) [Internet Widgits Pty Ltd]:My Organization, Inc. Organizational Unit Name (eg, section) []:My Group Common Name (eg, YOUR name) []:myserver.mygroup.myorganization.com Email Address []:ops@myserver.mygroup.myorganization.com %
pt_pt: % openssl req -new -x509 -days 365 -nodes -out cert.pem -keyout cert.pem A gerar uma chave privada RSA de 1024 bits .......++++++ .............................++++++ A escrever nova chave privada em 'cert.pem' ----- Ser-lhe-á pedido que introduza informações que serão incorporadas no seu pedido de certificado. Aquilo que vai introduzir é chamado de Nome Distinto ou DN. Existem vários campos, mas pode deixar alguns em branco Para alguns campos haverá um valor predefinido, Se introduzir '.', o campo será deixado em branco. ----- Nome do País (código de 2 letras) [AU]:PT Nome do Estado ou Província (nome completo) [Some-State]:MeuEstado Nome da Localidade (ex., cidade) []:Minha Cidade Nome da Organização (ex., empresa) [Internet Widgits Pty Ltd]:Minha Organização, Lda. Nome da Unidade Organizacional (ex., secção) []:Meu Grupo Nome Comum (ex., o seu nome) []:meuservidor.meugrupo.minhaorganização.pt Endereço de Email []:ops@meuservidor.meugrupo.minhaorganização.pt %

source: The disadvantage of a self-signed certificate is that it is its own root certificate, and no one else will have it in their cache of known (and trusted) root certificates.
pt_pt: A desvantagem de um certificado autoassinado é que ele é o seu próprio certificado raiz, e mais ninguém o terá na sua cache de certificados raiz conhecidos (e confiáveis).

source: Examples
pt_pt: Exemplos

source: Testing for SSL support
pt_pt: Testar suporte SSL

source: To test for the presence of SSL support in a Python installation, user code should use the following idiom::
pt_pt: Para testar a presença de suporte SSL numa instalação Python, o código do utilizador deve usar o seguinte idioma::

source: try: import ssl except ImportError: pass else: ... # do something that requires SSL support
pt_pt: try: import ssl except ImportError: pass else: ... # fazer algo que requer suporte SSL

source: Client-side operation
pt_pt: Operação do lado do cliente

source: This example creates a SSL context with the recommended security settings for client sockets, including automatic certificate verification::
pt_pt: Este exemplo cria um contexto SSL com as configurações de segurança recomendadas para sockets de cliente, incluindo verificação automática de certificados::

source: If you prefer to tune security settings yourself, you might create a context from scratch (but beware that you might not get the settings right)::
pt_pt: Se preferir ajustar as configurações de segurança você mesmo, pode criar um contexto do zero (mas tenha cuidado para não errar nas configurações)::

source: (this snippet assumes your operating system places a bundle of all CA certificates in ``/etc/ssl/certs/ca-bundle.crt``; if not, you'll get an error and have to adjust the location)
pt_pt: (este excerto assume que o seu sistema operativo coloca um pacote de todos os certificados CA em ``/etc/ssl/certs/ca-bundle.crt``; se não, obterá um erro e terá de ajustar a localização)

source: The :data:`PROTOCOL_TLS_CLIENT` protocol configures the context for cert validation and hostname verification. :attr:`~SSLContext.verify_mode` is set to :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` is set to ``True``. All other protocols create SSL contexts with insecure defaults.
pt_pt: O protocolo :data:`PROTOCOL_TLS_CLIENT` configura o contexto para validação de certificados e verificação de nome de host. :attr:`~SSLContext.verify_mode` é definido para :data:`CERT_REQUIRED` e :attr:`~SSLContext.check_hostname` é definido para ``True``. Todos os outros protocolos criam contextos SSL com predefinições inseguras.

source: When you use the context to connect to a server, :const:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` validate the server certificate: it ensures that the server certificate was signed with one of the CA certificates, checks the signature for correctness, and verifies other properties like validity and identity of the hostname::
pt_pt: Quando usa o contexto para se ligar a um servidor, :const:`CERT_REQUIRED` e :attr:`~SSLContext.check_hostname` validam o certificado do servidor: garantem que o certificado do servidor foi assinado com um dos certificados CA, verificam a assinatura quanto à correção e verificam outras propriedades, como validade e identidade do nome de host::

source: You may then fetch the certificate::
pt_pt: Pode então obter o certificado::

source: Visual inspection shows that the certificate does identify the desired service (that is, the HTTPS host ``www.python.org``)::
pt_pt: Uma inspeção visual mostra que o certificado identifica o serviço desejado (ou seja, o host HTTPS ``www.python.org``)::

source: Now the SSL channel is established and the certificate verified, you can proceed to talk with the server::
pt_pt: Agora que o canal SSL está estabelecido e o certificado verificado, pode prosseguir para comunicar com o servidor::

source: Server-side operation
pt_pt: Operação do lado do servidor

source: For server operation, typically you'll need to have a server certificate, and private key, each in a file. You'll first create a context holding the key and the certificate, so that clients can check your authenticity. Then you'll open a socket, bind it to a port, call :meth:`listen` on it, and start waiting for clients to connect::
pt_pt: Para a operação do lado do servidor, normalmente precisará de ter um certificado de servidor e uma chave privada, cada um num ficheiro. Primeiro, criará um contexto que contém a chave e o certificado, para que os clientes possam verificar a sua autenticidade. Depois, abrirá um socket, associá-lo-á a uma porta, chamará :meth:`listen` nele e começará a esperar que os clientes se liguem::

source: import socket, ssl context = ssl.create_default_context(ssl.Purpose.CLIENT_AUTH) context.load_cert_chain(certfile="mycertfile", keyfile="mykeyfile") bindsocket = socket.socket() bindsocket.bind(('myaddr.example.com', 10023)) bindsocket.listen(5)
pt_pt: import socket, ssl context = ssl.create_default_context(ssl.Purpose.CLIENT_AUTH) context.load_cert_chain(certfile="meucertificado", keyfile="minhachave") bindsocket = socket.socket() bindsocket.bind(('meuendereco.exemplo.com', 10023)) bindsocket.listen(5)
