Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: If using this module as part of a multi-processed application (using, for example the :mod:`multiprocessing` or :mod:`concurrent.futures` modules), be aware that OpenSSL's internal random number generator does not properly handle forked processes. Applications must change the PRNG state of the parent process if they use any SSL feature with :func:`os.fork`. Any successful call of :func:`~ssl.RAND_add` or :func:`~ssl.RAND_bytes` is sufficient.
pt_pt: Se estiver a usar este módulo como parte de uma aplicação multiprocessada (usando, por exemplo, os módulos :mod:`multiprocessing` ou :mod:`concurrent.futures`), tenha em conta que o gerador interno de números aleatórios do OpenSSL não lida corretamente com processos bifurcados. As aplicações devem alterar o estado do PRNG do processo pai se usarem qualquer funcionalidade SSL com :func:`os.fork`. Qualquer chamada bem-sucedida de :func:`~ssl.RAND_add` ou :func:`~ssl.RAND_bytes` é suficiente.

source: The TLS 1.3 protocol behaves slightly differently than previous version of TLS/SSL. Some new TLS 1.3 features are not yet available.
pt_pt: O protocolo TLS 1.3 comporta-se ligeiramente de forma diferente das versões anteriores de TLS/SSL. Algumas novas funcionalidades do TLS 1.3 ainda não estão disponíveis.

source: TLS 1.3 uses a disjunct set of cipher suites. All AES-GCM and ChaCha20 cipher suites are enabled by default. The method :meth:`SSLContext.set_ciphers` cannot enable or disable any TLS 1.3 ciphers yet, but :meth:`SSLContext.get_ciphers` returns them.
pt_pt: O TLS 1.3 usa um conjunto disjunto de suites de cifras. Todas as suites de cifras AES-GCM e ChaCha20 estão ativadas por predefinição. O método :meth:`SSLContext.set_ciphers` ainda não pode ativar ou desativar quaisquer cifras TLS 1.3, mas :meth:`SSLContext.get_ciphers` retorna-as.

source: Session tickets are no longer sent as part of the initial handshake and are handled differently. :attr:`SSLSocket.session` and :class:`SSLSession` are not compatible with TLS 1.3.
pt_pt: Os bilhetes de sessão já não são enviados como parte do handshake inicial e são tratados de forma diferente. :attr:`SSLSocket.session` e :class:`SSLSession` não são compatíveis com TLS 1.3.

source: Client-side certificates are also no longer verified during the initial handshake. A server can request a certificate at any time. Clients process certificate requests while they send or receive application data from the server.
pt_pt: Os certificados do lado do cliente também já não são verificados durante o handshake inicial. Um servidor pode solicitar um certificado a qualquer momento. Os clientes processam pedidos de certificados enquanto enviam ou recebem dados de aplicação do servidor.

source: TLS 1.3 features like early data, deferred TLS client cert request, signature algorithm configuration, and rekeying are not supported yet.
pt_pt: Funcionalidades do TLS 1.3 como dados iniciais, pedido diferido de certificado de cliente TLS, configuração de algoritmo de assinatura e re-chaveamento ainda não são suportadas.

source: Class :class:`socket.socket`
pt_pt: Classe :class:`socket.socket`

source: Documentation of underlying :mod:`socket` class
pt_pt: Documentação da classe subjacente :mod:`socket`

source: `SSL/TLS Strong Encryption: An Introduction <https://httpd.apache.org/docs/trunk/en/ssl/ssl_intro.html>`_
pt_pt: `Introdução à Encriptação Forte SSL/TLS <https://httpd.apache.org/docs/trunk/en/ssl/ssl_intro.html>`_

source: Intro from the Apache HTTP Server documentation
pt_pt: Introdução da documentação do servidor HTTP Apache

source: :rfc:`RFC 1422: Privacy Enhancement for Internet Electronic Mail: Part II: Certificate-Based Key Management <1422>`
pt_pt: :rfc:`RFC 1422: Melhoria de Privacidade para Correio Eletrónico na Internet: Parte II: Gestão de Chaves Baseada em Certificados <1422>`

source: :rfc:`RFC 4086: Randomness Requirements for Security <4086>`
pt_pt: :rfc:`RFC 4086: Requisitos de Aleatoriedade para Segurança <4086>`

source: :rfc:`RFC 5280: Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile <5280>`
pt_pt: :rfc:`RFC 5280: Perfil de Infraestrutura de Chave Pública X.509 da Internet e Lista de Revogação de Certificados (CRL) <5280>`

source: :rfc:`RFC 5246: The Transport Layer Security (TLS) Protocol Version 1.2 <5246>`
pt_pt: :rfc:`RFC 5246: O Protocolo de Segurança da Camada de Transporte (TLS) Versão 1.2 <5246>`

source: :rfc:`RFC 6066: Transport Layer Security (TLS) Extensions <6066>`
pt_pt: :rfc:`RFC 6066: Extensões de Segurança da Camada de Transporte (TLS) <6066>`

source: `IANA TLS: Transport Layer Security (TLS) Parameters <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml>`_
pt_pt: `IANA TLS: Parâmetros de Segurança da Camada de Transporte (TLS) <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml>`_

source: :rfc:`RFC 7525: Recommendations for Secure Use of Transport Layer Security (TLS) and Datagram Transport Layer Security (DTLS) <7525>`
pt_pt: :rfc:`RFC 7525: Recomendações para Uso Seguro de Segurança da Camada de Transporte (TLS) e Segurança da Camada de Transporte de Datagramas (DTLS) <7525>`

source: `Mozilla's Server Side TLS recommendations <https://wiki.mozilla.org/Security/Server_Side_TLS>`_
pt_pt: `Recomendações do lado do servidor TLS da Mozilla <https://wiki.mozilla.org/Security/Server_Side_TLS>`_

source: (use in module ssl)
pt_pt: (usado no módulo ssl)

source: Transport Layer Security
pt_pt: Segurança da Camada de Transporte

source: Secure Sockets Layer
pt_pt: Camada de Sockets Segura

source: certificates
pt_pt: certificados

source: X509 certificate
pt_pt: certificado X509
