Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: pt_pt

source: List of supported TLS channel binding types. Strings in this list can be used as arguments to :meth:`SSLSocket.get_channel_binding`.
pt_pt: Lista de tipos de ligação de canal TLS suportados. As strings nesta lista podem ser usadas como argumentos para :meth:`SSLSocket.get_channel_binding`.

source: The version string of the OpenSSL library loaded by the interpreter::
pt_pt: A string de versão da biblioteca OpenSSL carregada pelo interpretador::

source: A tuple of five integers representing version information about the OpenSSL library::
pt_pt: Um tuplo de cinco inteiros representando informações de versão sobre a biblioteca OpenSSL::

source: The raw version number of the OpenSSL library, as a single integer::
pt_pt: O número de versão bruto da biblioteca OpenSSL, como um único inteiro::

source: Alert Descriptions from :rfc:`5246` and others. The `IANA TLS Alert Registry <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ contains this list and references to the RFCs where their meaning is defined.
pt_pt: Descrições de alerta de :rfc:`5246` e outros. O `Registo de Alertas TLS da IANA <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ contém esta lista e referências aos RFCs onde o seu significado é definido.

source: Used as the return value of the callback function in :meth:`SSLContext.set_servername_callback`.
pt_pt: Usado como o valor de retorno da função de retorno de chamada em :meth:`SSLContext.set_servername_callback`.

source: :class:`enum.IntEnum` collection of ALERT_DESCRIPTION_* constants.
pt_pt: :class:`enum.IntEnum` coleção de constantes ALERT_DESCRIPTION_*.

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web servers (therefore, it will be used to create client-side sockets).
pt_pt: Opção para :func:`create_default_context` e :meth:`SSLContext.load_default_certs`. Este valor indica que o contexto pode ser usado para autenticar servidores web (portanto, será usado para criar sockets do lado do cliente).

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web clients (therefore, it will be used to create server-side sockets).
pt_pt: Opção para :func:`create_default_context` e :meth:`SSLContext.load_default_certs`. Este valor indica que o contexto pode ser usado para autenticar clientes web (portanto, será usado para criar sockets do lado do servidor).

source: :class:`enum.IntEnum` collection of SSL_ERROR_* constants.
pt_pt: :class:`enum.IntEnum` coleção de constantes SSL_ERROR_*.

source: :class:`enum.IntEnum` collection of SSL and TLS versions for :attr:`SSLContext.maximum_version` and :attr:`SSLContext.minimum_version`.
pt_pt: :class:`enum.IntEnum` coleção de versões SSL e TLS para :attr:`SSLContext.maximum_version` e :attr:`SSLContext.minimum_version`.

source: The minimum or maximum supported SSL or TLS version. These are magic constants. Their values don't reflect the lowest and highest available TLS/SSL versions.
pt_pt: A versão mínima ou máxima suportada de SSL ou TLS. Estas são constantes mágicas. Os seus valores não refletem as versões mais baixas e mais altas disponíveis de TLS/SSL.

source: SSL 3.0 to TLS 1.3.
pt_pt: SSL 3.0 a TLS 1.3.

source: All :class:`TLSVersion` members except :attr:`TLSVersion.TLSv1_2` and :attr:`TLSVersion.TLSv1_3` are deprecated.
pt_pt: Todos os membros de :class:`TLSVersion`, exceto :attr:`TLSVersion.TLSv1_2` e :attr:`TLSVersion.TLSv1_3`, estão obsoletos.

source: SSL Sockets
pt_pt: Sockets SSL

source: SSL sockets provide the following methods of :ref:`socket-objects`:
pt_pt: Os sockets SSL fornecem os seguintes métodos de :ref:`socket-objects`:

source: :meth:`~socket.socket.recv`, :meth:`~socket.socket.recv_into` (but passing a non-zero ``flags`` argument is not allowed)
pt_pt: :meth:`~socket.socket.recv`, :meth:`~socket.socket.recv_into` (mas passar um argumento ``flags`` não nulo não é permitido)

source: :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall` (with the same limitation)
pt_pt: :meth:`~socket.socket.send`, :meth:`~socket.socket.sendall` (com a mesma limitação)

source: :meth:`~socket.socket.sendfile` (but :mod:`os.sendfile` will be used for plain-text sockets only, else :meth:`~socket.socket.send` will be used)
pt_pt: :meth:`~socket.socket.sendfile` (mas :mod:`os.sendfile` será usado apenas para sockets de texto simples, caso contrário :meth:`~socket.socket.send` será usado)

source: However, since the SSL (and TLS) protocol has its own framing atop of TCP, the SSL sockets abstraction can, in certain respects, diverge from the specification of normal, OS-level sockets. See especially the :ref:`notes on non-blocking sockets <ssl-nonblocking>`.
pt_pt: No entanto, uma vez que o protocolo SSL (e TLS) tem a sua própria estruturação sobre TCP, a abstração de sockets SSL pode, em certos aspetos, divergir da especificação de sockets normais, a nível do sistema operativo. Consulte especialmente as :ref:`notas sobre sockets não bloqueantes <ssl-nonblocking>`.

source: Instances of :class:`SSLSocket` must be created using the :meth:`SSLContext.wrap_socket` method.
pt_pt: Instâncias de :class:`SSLSocket` devem ser criadas usando o método :meth:`SSLContext.wrap_socket`.

source: The :meth:`sendfile` method was added.
pt_pt: O método :meth:`sendfile` foi adicionado.

source: The :meth:`shutdown` does not reset the socket timeout each time bytes are received or sent. The socket timeout is now the maximum total duration of the shutdown.
pt_pt: O :meth:`shutdown` não redefine o tempo limite do socket cada vez que bytes são recebidos ou enviados. O tempo limite do socket é agora a duração total máxima do encerramento.

source: It is deprecated to create a :class:`SSLSocket` instance directly, use :meth:`SSLContext.wrap_socket` to wrap a socket.
pt_pt: Está obsoleto criar uma instância de :class:`SSLSocket` diretamente; use :meth:`SSLContext.wrap_socket` para envolver um socket.

source: :class:`SSLSocket` instances must to created with :meth:`~SSLContext.wrap_socket`. In earlier versions, it was possible to create instances directly. This was never documented or officially supported.
pt_pt: As instâncias de :class:`SSLSocket` devem ser criadas com :meth:`~SSLContext.wrap_socket`. Em versões anteriores, era possível criar instâncias diretamente. Isto nunca foi documentado nem oficialmente suportado.

source: Python now uses ``SSL_read_ex`` and ``SSL_write_ex`` internally. The functions support reading and writing of data larger than 2 GB. Writing zero-length data no longer fails with a protocol violation error.
pt_pt: O Python agora usa internamente ``SSL_read_ex`` e ``SSL_write_ex``. As funções suportam a leitura e escrita de dados maiores que 2 GB. A escrita de dados de comprimento zero já não falha com um erro de violação de protocolo.

source: SSL sockets also have the following additional methods and attributes:
pt_pt: Os sockets SSL também têm os seguintes métodos e atributos adicionais:

source: Read up to *len* bytes of data from the SSL socket and return the result as a ``bytes`` instance. If *buffer* is specified, then read into the buffer instead, and return the number of bytes read.
pt_pt: Lê até *len* bytes de dados do socket SSL e retorna o resultado como uma instância ``bytes``. Se *buffer* for especificado, então lê para o buffer, e retorna o número de bytes lidos.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the read would block.
pt_pt: Levanta :exc:`SSLWantReadError` ou :exc:`SSLWantWriteError` se o socket for :ref:`não bloqueante <ssl-nonblocking>` e a leitura bloqueasse.

source: As at any time a re-negotiation is possible, a call to :meth:`read` can also cause write operations.
pt_pt: Como a qualquer momento uma renegociação é possível, uma chamada a :meth:`read` também pode causar operações de escrita.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration to read up to *len* bytes.
pt_pt: O tempo limite do socket já não é redefinido cada vez que bytes são recebidos ou enviados. O tempo limite do socket é agora a duração total máxima para ler até *len* bytes.

source: Use :meth:`~SSLSocket.recv` instead of :meth:`~SSLSocket.read`.
pt_pt: Use :meth:`~SSLSocket.recv` em vez de :meth:`~SSLSocket.read`.

source: Write *data* to the SSL socket and return the number of bytes written. The *data* argument must be an object supporting the buffer interface.
pt_pt: Escreve *data* no socket SSL e retorna o número de bytes escritos. O argumento *data* deve ser um objeto que suporte a interface de buffer.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the write would block.
pt_pt: Levanta :exc:`SSLWantReadError` ou :exc:`SSLWantWriteError` se o socket for :ref:`não bloqueante <ssl-nonblocking>` e a escrita bloqueasse.

source: As at any time a re-negotiation is possible, a call to :meth:`write` can also cause read operations.
pt_pt: Como a qualquer momento uma renegociação é possível, uma chamada a :meth:`write` também pode causar operações de leitura.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration to write *data*.
pt_pt: O tempo limite do socket já não é redefinido cada vez que bytes são recebidos ou enviados. O tempo limite do socket é agora a duração total máxima para escrever *data*.

source: Use :meth:`~SSLSocket.send` instead of :meth:`~SSLSocket.write`.
pt_pt: Use :meth:`~SSLSocket.send` em vez de :meth:`~SSLSocket.write`.

source: The :meth:`~SSLSocket.read` and :meth:`~SSLSocket.write` methods are the low-level methods that read and write unencrypted, application-level data and decrypt/encrypt it to encrypted, wire-level data. These methods require an active SSL connection, i.e. the handshake was completed and :meth:`SSLSocket.unwrap` was not called.
pt_pt: Os métodos :meth:`~SSLSocket.read` e :meth:`~SSLSocket.write` são os métodos de baixo nível que leem e escrevem dados não encriptados, a nível de aplicação, e os desencriptam/encriptam para dados encriptados, a nível de linha. Estes métodos requerem uma ligação SSL ativa, ou seja, o handshake foi concluído e :meth:`SSLSocket.unwrap` não foi chamado.

source: Normally you should use the socket API methods like :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` instead of these methods.
pt_pt: Normalmente, deve usar os métodos da API de socket como :meth:`~socket.socket.recv` e :meth:`~socket.socket.send` em vez destes métodos.

source: Perform the SSL setup handshake.
pt_pt: Executa o handshake de configuração SSL.

source: If *block* is true and the timeout obtained by :meth:`~socket.socket.gettimeout` is zero, the socket is set in blocking mode until the handshake is performed.
pt_pt: Se *block* for verdadeiro e o tempo limite obtido por :meth:`~socket.socket.gettimeout` for zero, o socket é definido em modo bloqueante até que o handshake seja executado.

source: The handshake method also performs :func:`!match_hostname` when the :attr:`~SSLContext.check_hostname` attribute of the socket's :attr:`~SSLSocket.context` is true.
pt_pt: O método handshake também executa :func:`!match_hostname` quando o atributo :attr:`~SSLContext.check_hostname` do contexto do socket :attr:`~SSLSocket.context` for verdadeiro.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration of the handshake.
pt_pt: O tempo limite do socket já não é redefinido cada vez que bytes são recebidos ou enviados. O tempo limite do socket é agora a duração total máxima do handshake.

source: Hostname or IP address is matched by OpenSSL during handshake. The function :func:`!match_hostname` is no longer used. In case OpenSSL refuses a hostname or IP address, the handshake is aborted early and a TLS alert message is sent to the peer.
pt_pt: O nome de host ou endereço IP é verificado pelo OpenSSL durante o handshake. A função :func:`!match_hostname` já não é usada. Caso o OpenSSL recuse um nome de host ou endereço IP, o handshake é abortado precocemente e uma mensagem de alerta TLS é enviada para o par.

source: If there is no certificate for the peer on the other end of the connection, return ``None``. If the SSL handshake hasn't been done yet, raise :exc:`ValueError`.
pt_pt: Se não houver certificado para o par na outra extremidade da ligação, retorna ``None``. Se o handshake SSL ainda não tiver sido feito, levanta :exc:`ValueError`.

source: If the ``binary_form`` parameter is :const:`False`, and a certificate was received from the peer, this method returns a :class:`dict` instance. If the certificate was not validated, the dict is empty. If the certificate was validated, it returns a dict with several keys, amongst them ``subject`` (the principal for which the certificate was issued) and ``issuer`` (the principal issuing the certificate). If a certificate contains an instance of the *Subject Alternative Name* extension (see :rfc:`3280`), there will also be a ``subjectAltName`` key in the dictionary.
pt_pt: Se o parâmetro ``binary_form`` for :const:`False` e um certificado tiver sido recebido do par, este método retorna uma instância :class:`dict`. Se o certificado não tiver sido validado, o dicionário está vazio. Se o certificado tiver sido validado, retorna um dicionário com várias chaves, entre elas ``subject`` (o principal para o qual o certificado foi emitido) e ``issuer`` (o principal que emite o certificado). Se um certificado contiver uma instância da extensão *Subject Alternative Name* (consulte :rfc:`3280`), também haverá uma chave ``subjectAltName`` no dicionário.

source: The ``subject`` and ``issuer`` fields are tuples containing the sequence of relative distinguished names (RDNs) given in the certificate's data structure for the respective fields, and each RDN is a sequence of name-value pairs. Here is a real-world example::
pt_pt: Os campos ``subject`` e ``issuer`` são tuplos contendo a sequência de nomes distintos relativos (RDNs) dados na estrutura de dados do certificado para os respetivos campos, e cada RDN é uma sequência de pares nome-valor. Aqui está um exemplo real::

source: {'issuer': ((('countryName', 'IL'),), (('organizationName', 'StartCom Ltd.'),), (('organizationalUnitName', 'Secure Digital Certificate Signing'),), (('commonName', 'StartCom Class 2 Primary Intermediate Server CA'),)), 'notAfter': 'Nov 22 08:15:19 2013 GMT', 'notBefore': 'Nov 21 03:09:52 2011 GMT', 'serialNumber': '95F0', 'subject': ((('description', '571208-SLe257oHY9fVQ07Z'),), (('countryName', 'US'),), (('stateOrProvinceName', 'California'),), (('localityName', 'San Francisco'),), (('organizationName', 'Electronic Frontier Foundation, Inc.'),), (('commonName', '*.eff.org'),), (('emailAddress', 'hostmaster@eff.org'),)), 'subjectAltName': (('DNS', '*.eff.org'), ('DNS', 'eff.org')), 'version': 3}
pt_pt: {'issuer': ((('countryName', 'IL'),), (('organizationName', 'StartCom Ltd.'),), (('organizationalUnitName', 'Assinatura Digital Segura'),), (('commonName', 'StartCom Class 2 Primary Intermediate Server CA'),)), 'notAfter': 'Nov 22 08:15:19 2013 GMT', 'notBefore': 'Nov 21 03:09:52 2011 GMT', 'serialNumber': '95F0', 'subject': ((('description', '571208-SLe257oHY9fVQ07Z'),), (('countryName', 'US'),), (('stateOrProvinceName', 'California'),), (('localityName', 'San Francisco'),), (('organizationName', 'Electronic Frontier Foundation, Inc.'),), (('commonName', '*.eff.org'),), (('emailAddress', 'hostmaster@eff.org'),)), 'subjectAltName': (('DNS', '*.eff.org'), ('DNS', 'eff.org')), 'version': 3}

source: If the ``binary_form`` parameter is :const:`True`, and a certificate was provided, this method returns the DER-encoded form of the entire certificate as a sequence of bytes, or :const:`None` if the peer did not provide a certificate. Whether the peer provides a certificate depends on the SSL socket's role:
pt_pt: Se o parâmetro ``binary_form`` for :const:`True` e um certificado tiver sido fornecido, este método retorna a forma codificada em DER de todo o certificado como uma sequência de bytes, ou :const:`None` se o par não forneceu um certificado. Se o par fornece um certificado depende do papel do socket SSL:

source: for a client SSL socket, the server will always provide a certificate, regardless of whether validation was required;
pt_pt: para um socket SSL do cliente, o servidor fornecerá sempre um certificado, independentemente de a validação ser necessária;

source: for a server SSL socket, the client will only provide a certificate when requested by the server; therefore :meth:`getpeercert` will return :const:`None` if you used :const:`CERT_NONE` (rather than :const:`CERT_OPTIONAL` or :const:`CERT_REQUIRED`).
pt_pt: para um socket SSL do servidor, o cliente fornecerá um certificado apenas quando solicitado pelo servidor; portanto, :meth:`getpeercert` retornará :const:`None` se tiver usado :const:`CERT_NONE` (em vez de :const:`CERT_OPTIONAL` ou :const:`CERT_REQUIRED`).

source: See also :attr:`SSLContext.check_hostname`.
pt_pt: Veja também :attr:`SSLContext.check_hostname`.

source: The returned dictionary includes additional items such as ``issuer`` and ``notBefore``.
pt_pt: O dicionário retornado inclui itens adicionais como ``issuer`` e ``notBefore``.

source: :exc:`ValueError` is raised when the handshake isn't done. The returned dictionary includes additional X509v3 extension items such as ``crlDistributionPoints``, ``caIssuers`` and ``OCSP`` URIs.
pt_pt: :exc:`ValueError` é levantado quando o handshake não está feito. O dicionário retornado inclui itens adicionais de extensão X509v3, como ``crlDistributionPoints``, ``caIssuers`` e URIs ``OCSP``.

source: IPv6 address strings no longer have a trailing new line.
pt_pt: As strings de endereço IPv6 já não têm uma nova linha no final.

source: Returns verified certificate chain provided by the other end of the SSL channel as a list of DER-encoded bytes. If certificate verification was disabled method acts the same as :meth:`~SSLSocket.get_unverified_chain`.
pt_pt: Retorna a cadeia de certificados verificada fornecida pela outra extremidade do canal SSL como uma lista de bytes codificados em DER. Se a verificação de certificados estiver desativada, o método atua da mesma forma que :meth:`~SSLSocket.get_unverified_chain`.

source: Returns raw certificate chain provided by the other end of the SSL channel as a list of DER-encoded bytes.
pt_pt: Retorna a cadeia de certificados bruta fornecida pela outra extremidade do canal SSL como uma lista de bytes codificados em DER.

source: Returns a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used. If no connection has been established, returns ``None``.
pt_pt: Retorna um tuplo de três valores contendo o nome da cifra em uso, a versão do protocolo SSL que define o seu uso e o número de bits secretos em uso. Se nenhuma ligação tiver sido estabelecida, retorna ``None``.

source: Return the list of ciphers available in both the client and server. Each entry of the returned list is a three-value tuple containing the name of the cipher, the version of the SSL protocol that defines its use, and the number of secret bits the cipher uses. :meth:`~SSLSocket.shared_ciphers` returns ``None`` if no connection has been established or the socket is a client socket.
pt_pt: Retorna a lista de cifras disponíveis tanto no cliente como no servidor. Cada entrada da lista retornada é um tuplo de três valores contendo o nome da cifra, a versão do protocolo SSL que define o seu uso e o número de bits secretos que a cifra usa. :meth:`~SSLSocket.shared_ciphers` retorna ``None`` se nenhuma ligação tiver sido estabelecida ou se o socket for um socket do cliente.

source: Return the compression algorithm being used as a string, or ``None`` if the connection isn't compressed.
pt_pt: Retorna o algoritmo de compressão em uso como uma string, ou ``None`` se a ligação não estiver comprimida.

source: If the higher-level protocol supports its own compression mechanism, you can use :data:`OP_NO_COMPRESSION` to disable SSL-level compression.
pt_pt: Se o protocolo de nível superior suportar o seu próprio mecanismo de compressão, pode usar :data:`OP_NO_COMPRESSION` para desativar a compressão a nível SSL.

source: Get channel binding data for current connection, as a bytes object. Returns ``None`` if not connected or the handshake has not been completed.
pt_pt: Obtém dados de ligação de canal para a ligação atual, como um objeto bytes. Retorna ``None`` se não estiver ligado ou se o handshake não tiver sido concluído.

source: The *cb_type* parameter allow selection of the desired channel binding type. Valid channel binding types are listed in the :data:`CHANNEL_BINDING_TYPES` list. Currently only the 'tls-unique' channel binding, defined by :rfc:`5929`, is supported. :exc:`ValueError` will be raised if an unsupported channel binding type is requested.
pt_pt: O parâmetro *cb_type* permite a seleção do tipo de ligação de canal desejado. Os tipos de ligação de canal válidos estão listados na lista :data:`CHANNEL_BINDING_TYPES`. Atualmente, apenas a ligação de canal 'tls-unique', definida por :rfc:`5929`, é suportada. :exc:`ValueError` será levantado se for solicitado um tipo de ligação de canal não suportado.

source: Return the protocol that was selected during the TLS handshake. If :meth:`SSLContext.set_alpn_protocols` was not called, if the other party does not support ALPN, if this socket does not support any of the client's proposed protocols, or if the handshake has not happened yet, ``None`` is returned.
pt_pt: Retorna o protocolo que foi selecionado durante o handshake TLS. Se :meth:`SSLContext.set_alpn_protocols` não tiver sido chamado, se a outra parte não suportar ALPN, se este socket não suportar nenhum dos protocolos propostos pelo cliente, ou se o handshake ainda não tiver ocorrido, ``None`` é retornado.

source: Return the higher-level protocol that was selected during the TLS/SSL handshake. If :meth:`SSLContext.set_npn_protocols` was not called, or if the other party does not support NPN, or if the handshake has not yet happened, this will return ``None``.
pt_pt: Retorna o protocolo de nível superior que foi selecionado durante o handshake TLS/SSL. Se :meth:`SSLContext.set_npn_protocols` não tiver sido chamado, ou se a outra parte não suportar NPN, ou se o handshake ainda não tiver ocorrido, isto retornará ``None``.

source: NPN has been superseded by ALPN
pt_pt: NPN foi substituído por ALPN

source: Performs the SSL shutdown handshake, which removes the TLS layer from the underlying socket, and returns the underlying socket object. This can be used to go from encrypted operation over a connection to unencrypted. The returned socket should always be used for further communication with the other side of the connection, rather than the original socket.
pt_pt: Executa o handshake de encerramento SSL, que remove a camada TLS do socket subjacente e retorna o objeto socket subjacente. Isto pode ser usado para passar de uma operação encriptada numa ligação para não encriptada. O socket retornado deve ser sempre usado para comunicação adicional com o outro lado da ligação, em vez do socket original.
