Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ja, pt_pt, sv

source: Return the population standard deviation (the square root of the population variance). See :func:`pvariance` for arguments and other details.
ja: 母標準偏差 (母分散の平方根) を返します。引数や詳細は :func:`pvariance` を参照してください。
pt_pt: Devolve o desvio padrão populacional (a raiz quadrada da variância populacional). Veja :func:`pvariance` para argumentos e outros detalhes.
sv: Returnerar populationens standardavvikelse (kvadratroten av populationens varians). Se :func:`pvariance` för argument och andra detaljer.

source: Return the population variance of *data*, a non-empty sequence or iterable of real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
ja: *data* の母分散を返します。*data* は実数の空でないシーケンスまたはイテラブルです。分散、すなわち2次の中心化モーメントはデータの散らばり具合の測度です。分散が大きいデータはばらつきが大きく、分散が小さいデータは平均値のまわりに固まっています。
pt_pt: Devolve a variância populacional de *data*, uma sequência ou iterável não vazia de números reais. A variância, ou segundo momento em relação à média, é uma medida da variabilidade (dispersão) dos dados. Uma grande variância indica que os dados estão dispersos; uma pequena variância indica que estão agrupados perto da média.
sv: Returnerar populationsvariansen för *data*, en icke-tom sekvens eller iterabel av realvärdesberäknade tal. Varians, eller andra momentet kring medelvärdet, är ett mått på variabiliteten (spridningen) i data. En stor varians indikerar att data är utspridda; en liten varians indikerar att de är grupperade tätt runt medelvärdet.

source: If the optional second argument *mu* is given, it should be the *population* mean of the *data*. It can also be used to compute the second moment around a point that is not the mean. If it is missing or ``None`` (the default), the arithmetic mean is automatically calculated.
pt_pt: Se o segundo argumento opcional *mu* for fornecido, deve ser a média populacional dos *data*. Também pode ser usado para calcular o segundo momento em relação a um ponto que não seja a média. Se estiver em falta ou for ``None`` (o predefinido), a média aritmética é calculada automaticamente.
sv: Om det valfria andra argumentet *mu* anges bör det vara *populationens* medelvärde för *data*. Det kan också användas för att beräkna det andra momentet runt en punkt som inte är medelvärdet. Om det saknas eller är ``None`` (standard) beräknas det aritmetiska medelvärdet automatiskt.

source: Use this function to calculate the variance from the entire population. To estimate the variance from a sample, the :func:`variance` function is usually a better choice.
ja: 母集団全体から分散を計算する場合に用いてください。標本から分散を推定する場合は :func:`variance` を使いましょう。
pt_pt: Use esta função para calcular a variância a partir de toda a população. Para estimar a variância a partir de uma amostra, a função :func:`variance` é geralmente uma melhor escolha.
sv: Använd denna funktion för att beräkna variansen från hela populationen. För att uppskatta variansen från ett urval är funktionen :func:`variance` vanligtvis ett bättre val.

source: Raises :exc:`StatisticsError` if *data* is empty.
ja: *data* が空の場合 :exc:`StatisticsError` を送出します。
pt_pt: Levanta :exc:`StatisticsError` se *data* estiver vazio.
sv: Utlöser :exc:`StatisticsError` om *data* är tomt.

source: Examples:
ja: 例:
pt_pt: Exemplos:
sv: Exempel:

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *mu* to avoid recalculation:
ja: 既にデータの平均値を計算している場合、それを第2引数 *mu* に渡して再計算を避けることが出来ます:
pt_pt: Se já calculou a média dos seus dados, pode passá-la como segundo argumento opcional *mu* para evitar recalcular:
sv: Om du redan har beräknat medelvärdet för dina data kan du skicka det som det valfria andra argumentet *mu* för att undvika omberäkning:

source: Decimals and Fractions are supported:
ja: Decimal と Fraction がサポートされています:
pt_pt: Decimais e Frações são suportados:
sv: Decimaler och bråk stöds:

source: When called with the entire population, this gives the population variance σ². When called on a sample instead, this is the biased sample variance s², also known as variance with N degrees of freedom.
ja: 母集団全体で呼んだ場合は母分散 σ² を返します。代わりに標本で呼んだ場合は biased variance s²、すなわち自由度 N の分散を返します。
pt_pt: Quando chamada com toda a população, isto dá a variância populacional σ². Quando chamada com uma amostra, isto é a variância amostral enviesada s², também conhecida como variância com N graus de liberdade.
sv: När detta kallas med hela populationen ger det populationsvariansen σ². När det i stället gäller ett urval är detta den partiska urvalsvariansen s², även känd som varians med N frihetsgrader.

source: If you somehow know the true population mean μ, you may use this function to calculate the variance of a sample, giving the known population mean as the second argument. Provided the data points are a random sample of the population, the result will be an unbiased estimate of the population variance.
ja: Якщо ви якимось чином знаєте справжнє середнє значення сукупності μ, ви можете використати цю функцію для обчислення дисперсії вибірки, вказавши відоме середнє значення сукупності як другий аргумент. За умови, що точки даних є випадковою вибіркою сукупності, результатом буде неупереджена оцінка дисперсії генеральної сукупності.
pt_pt: Se de alguma forma souber a média populacional verdadeira μ, pode usar esta função para calcular a variância de uma amostra, dando a média populacional conhecida como segundo argumento. Desde que os pontos de dados sejam uma amostra aleatória da população, o resultado será uma estimativa não enviesada da variância populacional.
sv: Om du på något sätt känner till det sanna populationsmedelvärdet μ, kan du använda denna funktion för att beräkna variansen för ett urval, med det kända populationsmedelvärdet som andra argument. Förutsatt att datapunkterna är ett slumpmässigt urval av populationen blir resultatet en väntevärdesriktig skattning av populationsvariansen.

source: Return the sample standard deviation (the square root of the sample variance). See :func:`variance` for arguments and other details.
ja: 標本標準偏差 (標本分散の平方根) を返します。引数や詳細は :func:`variance` を参照してください。
pt_pt: Devolve o desvio padrão amostral (a raiz quadrada da variância amostral). Veja :func:`variance` para argumentos e outros detalhes.
sv: Returnerar standardavvikelsen för urvalet (kvadratroten av variansen för urvalet). Se :func:`variance` för argument och andra detaljer.

source: Return the sample variance of *data*, an iterable of at least two real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
ja: *data* の標本分散を返します。*data* は少なくとも2つの実数の iterable です。分散、すなわち2次の中心化モーメントはデータの散らばり具合の測度です。分散が大きいデータはばらつきが大きく、分散が小さいデータは平均値のまわりに固まっています。
pt_pt: Devolve a variância amostral de *data*, um iterável de pelo menos dois números reais. A variância, ou segundo momento em relação à média, é uma medida da variabilidade (dispersão) dos dados. Uma grande variância indica que os dados estão dispersos; uma pequena variância indica que estão agrupados perto da média.
sv: Returnerar urvalsvariansen för *data*, en iterabel med minst två realvärdestal. Varians, eller andra momentet kring medelvärdet, är ett mått på variabiliteten (spridningen) i data. En stor varians indikerar att data är utspridda, medan en liten varians indikerar att de är grupperade tätt kring medelvärdet.

source: If the optional second argument *xbar* is given, it should be the *sample* mean of *data*. If it is missing or ``None`` (the default), the mean is automatically calculated.
pt_pt: Se o segundo argumento opcional *xbar* for fornecido, deve ser a média amostral dos *data*. Se estiver em falta ou for ``None`` (o predefinido), a média é calculada automaticamente.
sv: Om det valfria andra argumentet *xbar* anges bör det vara medelvärdet för *data* för *provet*. Om det saknas eller är ``None`` (standard) beräknas medelvärdet automatiskt.

source: Use this function when your data is a sample from a population. To calculate the variance from the entire population, see :func:`pvariance`.
ja: データが母集団の標本であるときに用いてください。母集団全体から分散を計算するには :func:`pvariance` を参照してください。
pt_pt: Use esta função quando os seus dados são uma amostra de uma população. Para calcular a variância de toda a população, veja :func:`pvariance`.
sv: Använd den här funktionen när dina data är ett urval från en population. För att beräkna variansen från hela populationen, se :func:`pvariance`.

source: Raises :exc:`StatisticsError` if *data* has fewer than two values.
ja: *data* の値が2より少ない場合 :exc:`StatisticsError` を送出します。
pt_pt: Levanta :exc:`StatisticsError` se *data* tiver menos de dois valores.
sv: Utlöser :exc:`StatisticsError` om *data* har färre än två värden.

source: If you have already calculated the sample mean of your data, you can pass it as the optional second argument *xbar* to avoid recalculation:
pt_pt: Se já calculou a média amostral dos seus dados, pode passá-la como segundo argumento opcional *xbar* para evitar recalcular:
sv: Om du redan har beräknat urvalsmedelvärdet för dina data kan du skicka det som det valfria andra argumentet *xbar* för att undvika omräkning:

source: This function does not attempt to verify that you have passed the actual mean as *xbar*. Using arbitrary values for *xbar* can lead to invalid or impossible results.
ja: この関数は引数として渡した *xbar* が実際の平均値かどうかチェックしません。任意の値を *xbar* に渡すと無効な結果やありえない結果が返ることがあります。
pt_pt: Esta função não tenta verificar se passou a média real como *xbar*. Usar valores arbitrários para *xbar* pode levar a resultados inválidos ou impossíveis.
sv: Denna funktion försöker inte verifiera att du har angett det faktiska medelvärdet som *xbar*. Om du använder godtyckliga värden för *xbar* kan det leda till ogiltiga eller omöjliga resultat.

source: Decimal and Fraction values are supported:
ja: Decimal と Fraction がサポートされています:
pt_pt: Valores Decimais e Frações são suportados:
sv: Decimal- och fraktionsvärden stöds:

source: This is the sample variance s² with Bessel's correction, also known as variance with N-1 degrees of freedom. Provided that the data points are representative (e.g. independent and identically distributed), the result should be an unbiased estimate of the true population variance.
ja: Bessel 補正済みの標本分散 s²、すなわち自由度 N-1 の分散です。与えられたデータ点が代表的 (たとえば独立で均等に分布) な場合、戻り値は母分散の不偏推定量になります。
pt_pt: Esta é a variância amostral s² com a correção de Bessel, também conhecida como variância com N-1 graus de liberdade. Desde que os pontos de dados sejam representativos (por exemplo, independentes e identicamente distribuídos), o resultado deve ser uma estimativa não enviesada da variância populacional verdadeira.
sv: Detta är urvalsvariansen s² med Bessels korrigering, även känd som varians med N-1 frihetsgrader. Förutsatt att datapunkterna är representativa (t.ex. oberoende och identiskt fördelade) bör resultatet vara en väntevärdesriktig skattning av den verkliga populationsvariansen.

source: If you somehow know the actual population mean μ you should pass it to the :func:`pvariance` function as the *mu* parameter to get the variance of a sample.
ja: 何らかの方法で真の母平均 μ を知っている場合、それを :func:`pvariance` の引数 *mu* に渡して標本の分散を計算することが出来ます。
pt_pt: Se de alguma forma souber a média populacional real μ, deve passá-la para a função :func:`pvariance` como o parâmetro *mu* para obter a variância de uma amostra.
sv: Om du på något sätt känner till det faktiska populationsmedelvärdet μ bör du skicka det till funktionen :func:`pvariance` som parametern *mu* för att få variansen för ett urval.

source: Divide *data* into *n* continuous intervals with equal probability. Returns a list of ``n - 1`` cut points separating the intervals.
ja: Розділіть *дані* на *n* безперервних інтервалів з рівною ймовірністю. Повертає список ``n - 1`` точок розрізу, що розділяють інтервали.
pt_pt: Divide *data* em *n* intervalos contínuos com probabilidade igual. Devolve uma lista de ``n - 1`` pontos de corte que separam os intervalos.
sv: Dela upp *data* i *n* kontinuerliga intervall med samma sannolikhet. Returnerar en lista med ``n - 1`` skärningspunkter som separerar intervallen.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate *data* into 100 equal sized groups. Raises :exc:`StatisticsError` if *n* is not least 1.
ja: Встановіть *n* на 4 для квартилів (за замовчуванням). Встановіть *n* на 10 для децилів. Встановіть *n* на 100 для процентилів, що дає 99 точок розрізу, які розділяють *дані* на 100 груп однакового розміру. Викликає :exc:`StatisticsError`, якщо *n* не менше 1.
pt_pt: Defina *n* como 4 para quartis (predefinição). Defina *n* como 10 para decis. Defina *n* como 100 para percentis, o que fornece os 99 pontos de corte que separam *data* em 100 grupos de tamanho igual. Levanta :exc:`StatisticsError` se *n* for menor que 1.
sv: Ställ in *n* på 4 för kvartiler (standard). Ställ in *n* till 10 för deciler. Ställ in *n* på 100 för percentiler, vilket ger de 99 snittpunkter som delar in *data* i 100 lika stora grupper. Utlöser :exc:`StatisticsError` om *n* inte är minst 1.

source: The *data* can be any iterable containing sample data. For meaningful results, the number of data points in *data* should be larger than *n*. Raises :exc:`StatisticsError` if there is not at least one data point.
pt_pt: Os *data* podem ser qualquer iterável que contenha dados amostrais. Para resultados significativos, o número de pontos de dados em *data* deve ser maior que *n*. Levanta :exc:`StatisticsError` se não houver pelo menos um ponto de dados.
sv: *data* kan vara vilken iterabel som helst som innehåller exempeldata. För meningsfulla resultat bör antalet datapunkter i *data* vara större än *n*. Utlöser :exc:`StatisticsError` om det inte finns minst en datapunkt.

source: The cut points are linearly interpolated from the two nearest data points. For example, if a cut point falls one-third of the distance between two sample values, ``100`` and ``112``, the cut-point will evaluate to ``104``.
ja: Точки розрізу лінійно інтерполюються з двох найближчих точок даних. Наприклад, якщо точка зрізу падає на одну третину відстані між двома значеннями вибірки, ``100`` і ``112``, точка зрізу буде оцінена як ``104``.
pt_pt: Os pontos de corte são interpolados linearmente a partir dos dois pontos de dados mais próximos. Por exemplo, se um ponto de corte cair a um terço da distância entre dois valores amostrais, ``100`` e ``112``, o ponto de corte será avaliado como ``104``.
sv: Skärningspunkterna interpoleras linjärt från de två närmaste datapunkterna. Om en skärningspunkt t.ex. ligger en tredjedel av avståndet mellan två provvärden, ``100`` och ``112``, kommer skärningspunkten att utvärderas till ``104``.

source: The *method* for computing quantiles can be varied depending on whether the *data* includes or excludes the lowest and highest possible values from the population.
ja: *Метод* для обчислення квантилів може варіюватися залежно від того, чи *дані* включають чи виключають найнижчі та найвищі можливі значення з сукупності.
pt_pt: O *method* para calcular quantis pode variar dependendo se os *data* incluem ou excluem os valores mais baixos e mais altos possíveis da população.
sv: *Metoden* för att beräkna kvantiler kan varieras beroende på om *data* inkluderar eller exkluderar de lägsta och högsta möjliga värdena från populationen.

source: The default *method* is "exclusive" and is used for data sampled from a population that can have more extreme values than found in the samples. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``i / (m + 1)``. Given nine sample values, the method sorts them and assigns the following percentiles: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.
ja: *Метод* за замовчуванням є "ексклюзивним" і використовується для даних, відібраних із сукупності, яка може мати більш екстремальні значення, ніж у вибірках. Частка генеральної сукупності, яка знаходиться нижче *i-ї* з *m* відсортованих точок даних, обчислюється як ``i / (m + 1)``. Маючи дев’ять значень вибірки, метод сортує їх і призначає наступні процентилі: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.
pt_pt: O *method* predefinido é "exclusive" e é usado para dados amostrados de uma população que pode ter valores mais extremos do que os encontrados nas amostras. A porção da população que cai abaixo do *i-ésimo* de *m* pontos de dados ordenados é calculada como ``i / (m + 1)``. Dados nove valores amostrais, o método ordena-os e atribui os seguintes percentis: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.
sv: Standardmetoden *method* är "exclusive" och används för data som samlats in från en population som kan ha mer extrema värden än vad som finns i urvalet. Den del av populationen som faller under *i-th* av *m* sorterade datapunkter beräknas som ``i / (m + 1)``. Med nio urvalsvärden sorterar metoden dem och tilldelar följande percentiler: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.

source: Setting the *method* to "inclusive" is used for describing population data or for samples that are known to include the most extreme values from the population. The minimum value in *data* is treated as the 0th percentile and the maximum value is treated as the 100th percentile. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``(i - 1) / (m - 1)``. Given 11 sample values, the method sorts them and assigns the following percentiles: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.
ja: Встановлення *методу* на "включно" використовується для опису даних сукупності або для вибірок, які, як відомо, включають найбільш екстремальні значення сукупності. Мінімальне значення в *даних* розглядається як 0-й процентиль, а максимальне значення розглядається як 100-й процентиль. Частка генеральної сукупності, що опускається нижче *i-ї* з *m* відсортованих точок даних, обчислюється як ``(i - 1) / (m - 1)``. Враховуючи 11 значень вибірки, метод сортує їх і призначає наступні процентилі: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.
pt_pt: Definir o *method* como "inclusive" é usado para descrever dados populacionais ou para amostras que são conhecidas por incluir os valores mais extremos da população. O valor mínimo em *data* é tratado como o percentil 0 e o valor máximo é tratado como o percentil 100. A porção da população que cai abaixo do *i-ésimo* de *m* pontos de dados ordenados é calculada como ``(i - 1) / (m - 1)``. Dados 11 valores amostrais, o método ordena-os e atribui os seguintes percentis: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.
sv: Om *method* är inställd på "inclusive" används den för att beskriva populationsdata eller för stickprov som man vet innehåller de mest extrema värdena från populationen. Minimivärdet i *data* behandlas som den 0:e percentilen och maximivärdet behandlas som den 100:e percentilen. Den del av populationen som faller under *i-th* av *m* sorterade datapunkter beräknas som ``(i - 1) / (m - 1)``. Givet 11 provvärden sorterar metoden dem och tilldelar följande percentiler: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.

source: # Decile cut points for empirically sampled data >>> data = [105, 129, 87, 86, 111, 111, 89, 81, 108, 92, 110, ... 100, 75, 105, 103, 109, 76, 119, 99, 91, 103, 129, ... 106, 101, 84, 111, 74, 87, 86, 103, 103, 106, 86, ... 111, 75, 87, 102, 121, 111, 88, 89, 101, 106, 95, ... 103, 107, 101, 81, 109, 104] >>> [round(q, 1) for q in quantiles(data, n=10)] [81.0, 86.2, 89.0, 99.4, 102.5, 103.6, 106.0, 109.8, 111.0]
pt_pt: # Pontos de corte para decis de dados amostrados empiricamente >>> data = [105, 129, 87, 86, 111, 111, 89, 81, 108, 92, 110, ... 100, 75, 105, 103, 109, 76, 119, 99, 91, 103, 129, ... 106, 101, 84, 111, 74, 87, 86, 103, 103, 106, 86, ... 111, 75, 87, 102, 121, 111, 88, 89, 101, 106, 95, ... 103, 107, 101, 81, 109, 104] >>> [round(q, 1) for q in quantiles(data, n=10)] [81.0, 86.2, 89.0, 99.4, 102.5, 103.6, 106.0, 109.8, 111.0]

source: No longer raises an exception for an input with only a single data point. This allows quantile estimates to be built up one sample point at a time becoming gradually more refined with each new data point.
pt_pt: Já não levanta uma exceção para uma entrada com apenas um ponto de dados. Isto permite que as estimativas de quantis sejam construídas ponto a ponto, tornando-se gradualmente mais refinadas com cada novo ponto de dados.
sv: Det uppstår inte längre något undantag för en indata med endast en enda datapunkt. Detta gör att kvantilskattningar kan byggas upp med en provpunkt i taget och gradvis bli mer förfinade med varje ny datapunkt.

source: Return the sample covariance of two inputs *x* and *y*. Covariance is a measure of the joint variability of two inputs.
ja: Повертає зразкову коваріацію двох вхідних даних *x* і *y*. Коваріація є мірою спільної мінливості двох вхідних даних.
pt_pt: Devolve a covariância amostral de duas entradas *x* e *y*. A covariância é uma medida da variabilidade conjunta de duas entradas.
sv: Returnerar sampelkovariansen för två indata *x* och *y*. Kovarians är ett mått på den gemensamma variabiliteten hos två indata.

source: Both inputs must be of the same length (no less than two), otherwise :exc:`StatisticsError` is raised.
ja: Обидва входи мають бути однакової довжини (не менше двох), інакше виникає :exc:`StatisticsError`.
pt_pt: Ambas as entradas devem ter o mesmo comprimento (não menos que dois), caso contrário, é levantado :exc:`StatisticsError`.
sv: Båda inmatningarna måste vara lika långa (inte mindre än två), annars :exc:`StatisticsError` tas upp.

source: Return the `Pearson's correlation coefficient <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ for two inputs. Pearson's correlation coefficient *r* takes values between -1 and +1. It measures the strength and direction of a linear relationship.
pt_pt: Devolve o `coeficiente de correlação de Pearson <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ para duas entradas. O coeficiente de correlação de Pearson *r* assume valores entre -1 e +1. Medida da força e direção de uma relação linear.
sv: Returnerar `Pearsons korrelationskoefficient <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ för två indata. Pearsons korrelationskoefficient *r* tar värden mellan -1 och +1. Den mäter styrkan och riktningen i ett linjärt förhållande.

source: If *method* is "ranked", computes `Spearman's rank correlation coefficient <https://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient>`_ for two inputs. The data is replaced by ranks. Ties are averaged so that equal values receive the same rank. The resulting coefficient measures the strength of a monotonic relationship.
pt_pt: Se *method* for "ranked", calcula o `coeficiente de correlação de postos de Spearman <https://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient>`_ para duas entradas. Os dados são substituídos por postos. Os empates são médios, de modo que valores iguais recebem o mesmo posto. O coeficiente resultante mede a força de uma relação monótona.
sv: Om *method* är "ranked", beräknas `Spearmans rangkorrelationskoefficient <https://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient>`_ för två indata. Data ersätts av rangordningar. Oavgjorda värden får ett genomsnitt så att lika värden får samma rangordning. Den resulterande koefficienten mäter styrkan i ett monotont förhållande.
