Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ja, pt_pt, sv

source: :exc:`StatisticsError` is raised if *data* is empty, any element is less than zero, or if the weighted sum isn't positive.
ja: :exc:`StatisticsError` виникає, якщо *data* порожні, будь-який елемент менше нуля або якщо зважена сума не додатна.
pt_pt: É levantado :exc:`StatisticsError` se *data* estiver vazio, se algum elemento for menor que zero, ou se a soma ponderada não for positiva.
sv: :exc:`StatisticsError` uppstår om *data* är tomt, om något element är mindre än noll eller om den viktade summan inte är positiv.

source: The current algorithm has an early-out when it encounters a zero in the input. This means that the subsequent inputs are not tested for validity. (This behavior may change in the future.)
ja: Поточний алгоритм має ранній вихід, коли він зустрічає нуль у вхідних даних. Це означає, що наступні вхідні дані не перевіряються на дійсність. (Ця поведінка може змінитися в майбутньому.)
pt_pt: O algoritmo atual tem uma saída antecipada quando encontra um zero na entrada. Isto significa que as entradas subsequentes não são testadas quanto à validade. (Este comportamento pode mudar no futuro.)
sv: Den nuvarande algoritmen har en tidig utgång när den stöter på en nolla i indata. Detta innebär att de efterföljande inmatningarna inte testas för giltighet. (Detta beteende kan komma att ändras i framtiden)

source: `Kernel Density Estimation (KDE) <https://www.itm-conferences.org/articles/itmconf/pdf/2018/08/itmconf_sam2018_00037.pdf>`_: Create a continuous probability density function or cumulative distribution function from discrete samples.
pt_pt: `Estimação de Densidade do Núcleo (KDE) <https://www.itm-conferences.org/articles/itmconf/pdf/2018/08/itmconf_sam2018_00037.pdf>`_: Cria uma função de densidade de probabilidade contínua ou uma função de distribuição cumulativa a partir de amostras discretas.
sv: `Kernel Density Estimation (KDE) <https://www.itm-conferences.org/articles/itmconf/pdf/2018/08/itmconf_sam2018_00037.pdf>`_: Skapa en kontinuerlig sannolikhetstäthetsfunktion eller kumulativ fördelningsfunktion från diskreta prov.

source: The basic idea is to smooth the data using `a kernel function <https://en.wikipedia.org/wiki/Kernel_(statistics)>`_. to help draw inferences about a population from a sample.
pt_pt: A ideia básica é suavizar os dados usando `uma função núcleo <https://en.wikipedia.org/wiki/Kernel_(statistics)>`_ para ajudar a tirar inferências sobre uma população a partir de uma amostra.
sv: Grundtanken är att jämna ut data med hjälp av `en kärnfunktion <https://en.wikipedia.org/wiki/Kernel_(statistics)>`_. för att hjälpa till att dra slutsatser om en population från ett urval.

source: The degree of smoothing is controlled by the scaling parameter *h* which is called the bandwidth. Smaller values emphasize local features while larger values give smoother results.
pt_pt: O grau de suavização é controlado pelo parâmetro de escala *h*, chamado largura de banda. Valores menores enfatizam características locais, enquanto valores maiores dão resultados mais suaves.
sv: Graden av utjämning styrs av skalningsparametern *h*, som kallas bandbredd. Mindre värden framhäver lokala särdrag medan större värden ger ett jämnare resultat.

source: The *kernel* determines the relative weights of the sample data points. Generally, the choice of kernel shape does not matter as much as the more influential bandwidth smoothing parameter.
pt_pt: O *kernel* determina os pesos relativos dos pontos de dados da amostra. Geralmente, a escolha da forma do núcleo não é tão importante quanto o parâmetro de suavização da largura de banda, mais influente.
sv: *Kärnan* bestämmer de relativa vikterna för datapunkterna i urvalet. I allmänhet har valet av kärnform inte lika stor betydelse som den mer inflytelserika parametern för utjämning av bandbredd.

source: Kernels that give some weight to every sample point include *normal* (*gauss*), *logistic*, and *sigmoid*.
pt_pt: Núcleos que atribuem algum peso a cada ponto da amostra incluem *normal* (*gauss*), *logístico* e *sigmoide*.
sv: Kärnor som ger viss vikt åt varje provpunkt inkluderar *normal* (*gauss*), *logistisk* och *sigmoid*.

source: Kernels that only give weight to sample points within the bandwidth include *rectangular* (*uniform*), *triangular*, *parabolic* (*epanechnikov*), *quartic* (*biweight*), *triweight*, and *cosine*.
pt_pt: Núcleos que atribuem peso apenas a pontos da amostra dentro da largura de banda incluem *retangular* (*uniform*), *triangular*, *parabólico* (*epanechnikov*), *quártico* (*biweight*), *triweight* e *coseno*.
sv: Kärnor som bara ger vikt åt provpunkter inom bandbredden inkluderar *rektangulär* (*uniform*), *triangulär*, *parabolisk* (*epanechnikov*), *kvadratisk* (*bivikt*), *trivikt* och *cosinus*.

source: If *cumulative* is true, will return a cumulative distribution function.
pt_pt: Se *cumulative* for verdadeiro, devolverá uma função de distribuição cumulativa.
sv: Om *cumulative* är true, returneras en kumulativ fördelningsfunktion.

source: A :exc:`StatisticsError` will be raised if the *data* sequence is empty.
pt_pt: Será levantado um :exc:`StatisticsError` se a sequência *data* estiver vazia.
sv: Ett :exc:`StatisticsError` kommer att uppstå om *data*-sekvensen är tom.

source: `Wikipedia has an example <https://en.wikipedia.org/wiki/Kernel_density_estimation#Example>`_ where we can use :func:`kde` to generate and plot a probability density function estimated from a small sample:
pt_pt: `A Wikipedia tem um exemplo <https://en.wikipedia.org/wiki/Kernel_density_estimation#Example>`_ onde podemos usar :func:`kde` para gerar e traçar uma função de densidade de probabilidade estimada a partir de uma pequena amostra:
sv: `Wikipedia har ett exempel <https://en.wikipedia.org/wiki/Kernel_density_estimation#Example>`_ där vi kan använda :func:`kde` för att generera och plotta en sannolikhetstäthetsfunktion som uppskattats från ett litet urval:

source: The points in ``xarr`` and ``yarr`` can be used to make a PDF plot:
pt_pt: Os pontos em ``xarr`` e ``yarr`` podem ser usados para criar um gráfico PDF:
sv: Punkterna i ``xarr`` och ``yarr`` kan användas för att göra en PDF-plott:

source: Scatter plot of the estimated probability density function.
pt_pt: Gráfico de dispersão da função de densidade de probabilidade estimada.
sv: Spridningsdiagram över den uppskattade sannolikhetstäthetsfunktionen.

source: Return a function that makes a random selection from the estimated probability density function produced by ``kde(data, h, kernel)``.
pt_pt: Devolve uma função que faz uma seleção aleatória a partir da função de densidade de probabilidade estimada produzida por ``kde(data, h, kernel)``.
sv: Returnerar en funktion som gör ett slumpmässigt urval från den skattade sannolikhetstäthetsfunktionen som produceras av ``kde(data, h, kernel)``.

source: Providing a *seed* allows reproducible selections. In the future, the values may change slightly as more accurate kernel inverse CDF estimates are implemented. The seed may be an integer, float, str, or bytes.
pt_pt: Fornecer uma *seed* permite seleções reprodutíveis. No futuro, os valores podem mudar ligeiramente à medida que estimativas mais precisas da CDF inversa do núcleo forem implementadas. A *seed* pode ser um inteiro, float, str ou bytes.
sv: Genom att tillhandahålla ett *frö* möjliggörs reproducerbara urval. I framtiden kan värdena ändras något i takt med att mer exakta inversa CDF-estimat för kärnor implementeras. Seed kan vara ett heltal, float, str eller bytes.

source: Continuing the example for :func:`kde`, we can use :func:`kde_random` to generate new random selections from an estimated probability density function:
pt_pt: Continuando o exemplo para :func:`kde`, podemos usar :func:`kde_random` para gerar novas seleções aleatórias a partir de uma função de densidade de probabilidade estimada:
sv: Om vi fortsätter med exemplet för :func:`kde` kan vi använda :func:`kde_random` för att generera nya slumpmässiga val från en uppskattad sannolikhetstäthetsfunktion:

source: Return the median (middle value) of numeric data, using the common "mean of middle two" method. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
ja: 一般的な「中央2つの平均をとる」方法を使用して、数値データの中央値（中間値）を返します。もし *data* が空の場合、例外 :exc:`StatisticsError` が送出されます。*data* はシーケンス型またはイテラブルにもなれます。
pt_pt: Devolve a mediana (valor médio) de dados numéricos, usando o método comum de "média dos dois do meio". Se *data* estiver vazio, é levantado :exc:`StatisticsError`. *data* pode ser uma sequência ou iterável.
sv: Returnerar medianen (mittvärdet) för numeriska data med hjälp av den vanliga metoden "medelvärdet av de två mittersta". Om *data* är tomt kommer :exc:`StatisticsError` att returneras. *data* kan vara en sekvens eller en iterabel.

source: The median is a robust measure of central location and is less affected by the presence of outliers. When the number of data points is odd, the middle data point is returned:
ja: 中央値は外れ値の影響を受けにくいため、中心位置のロバストな測度です。データ数が奇数の場合は中央の値を返します:
pt_pt: A mediana é uma medida robusta de localização central e é menos afetada pela presença de valores atípicos. Quando o número de pontos de dados é ímpar, o ponto de dados do meio é devolvido:
sv: Medianen är ett robust mått på central placering och påverkas mindre av förekomsten av avvikande värden. När antalet datapunkter är udda returneras den mittersta datapunkten:

source: When the number of data points is even, the median is interpolated by taking the average of the two middle values:
ja: データ数が偶数の場合は、中央値は中央に最も近い2値の算術平均で補間されます:
pt_pt: Quando o número de pontos de dados é par, a mediana é interpolada tomando a média dos dois valores do meio:
sv: När antalet datapunkter är jämnt interpoleras medianen genom att ta medelvärdet av de två mellersta värdena:

source: This is suited for when your data is discrete, and you don't mind that the median may not be an actual data point.
ja: データが離散的で、中央値がデータ点にない値でも構わない場合に適しています。
pt_pt: Isto é adequado quando os seus dados são discretos e não se importa que a mediana possa não ser um ponto de dados real.
sv: Detta är lämpligt när dina data är diskreta och du inte bryr dig om att medianen kanske inte är en faktisk datapunkt.

source: If the data is ordinal (supports order operations) but not numeric (doesn't support addition), consider using :func:`median_low` or :func:`median_high` instead.
ja: もしあなたのデータが（注文操作をサポートする）序数で、（追加操作をサポートしない）数値でないならば、代わりに :func:`median_low` または :func:`median_high` の使用を検討してください。
pt_pt: Se os dados forem ordinais (suportam operações de ordem) mas não numéricos (não suportam adição), considere usar :func:`median_low` ou :func:`median_high` em vez disso.
sv: Om data är ordinala (stöder orderoperationer) men inte numeriska (stöder inte addition) kan du överväga att använda :func:`median_low` eller :func:`median_high` i stället.

source: Return the low median of numeric data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
ja: 数値データの小さい方の中央値(low median)を返します。もし *data* が空の場合、:exc:`StatisticsError` が送出されます。*data* はシーケンス型またはイテラブルにもなれます。
pt_pt: Devolve a mediana baixa de dados numéricos. Se *data* estiver vazio, é levantado :exc:`StatisticsError`. *data* pode ser uma sequência ou iterável.
sv: Returnerar den låga medianen för numeriska data. Om *data* är tomt kommer :exc:`StatisticsError` att returneras. *data* kan vara en sekvens eller en iterabel.

source: The low median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the smaller of the two middle values is returned.
ja: low median は必ずデータに含まれています。データ数が奇数の場合は中央の値を返し、偶数の場合は中央の2値の小さい方を返します。
pt_pt: A mediana baixa é sempre um membro do conjunto de dados. Quando o número de pontos de dados é ímpar, o valor do meio é devolvido. Quando é par, o menor dos dois valores do meio é devolvido.
sv: Den låga medianen ingår alltid i datauppsättningen. När antalet datapunkter är udda returneras det mittersta värdet. Om det är jämnt returneras det minsta av de två mittvärdena.

source: Use the low median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
ja: データが離散的で、中央値が補間値よりもデータ点にある値の方が良い場合に用いてください。
pt_pt: Use a mediana baixa quando os seus dados são discretos e prefere que a mediana seja um ponto de dados real em vez de interpolado.
sv: Använd den låga medianen när dina data är diskreta och du föredrar att medianen är en faktisk datapunkt snarare än interpolerad.

source: Return the high median of data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
ja: データの大きい方の中央値(high median)を返します。もし *data* が空の場合、:exc:`StatisticsError` が送出されます。 *data* はシーケンス型やイテラブルにもなれます。
pt_pt: Devolve a mediana alta dos dados. Se *data* estiver vazio, é levantado :exc:`StatisticsError`. *data* pode ser uma sequência ou iterável.
sv: Returnerar den höga medianen för data. Om *data* är tomt, :exc:`StatisticsError` tas upp. *data* kan vara en sekvens eller en iterabel.

source: The high median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the larger of the two middle values is returned.
ja: high median は必ずデータに含まれています。データ数が奇数の場合は中央の値を返し、偶数の場合は中央の2値の大きい方を返します。
pt_pt: A mediana alta é sempre um membro do conjunto de dados. Quando o número de pontos de dados é ímpar, o valor do meio é devolvido. Quando é par, o maior dos dois valores do meio é devolvido.
sv: Den höga medianen ingår alltid i datauppsättningen. När antalet datapunkter är udda returneras det mittersta värdet. Om det är jämnt returneras det största av de två mittvärdena.

source: Use the high median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
ja: データが離散的で、中央値が補間値よりもデータ点にある値の方が良い場合に用いてください。
pt_pt: Use a mediana alta quando os seus dados são discretos e prefere que a mediana seja um ponto de dados real em vez de interpolado.
sv: Använd den höga medianen när dina data är diskreta och du föredrar att medianen är en faktisk datapunkt snarare än interpolerad.

source: Estimates the median for numeric data that has been `grouped or binned <https://en.wikipedia.org/wiki/Data_binning>`_ around the midpoints of consecutive, fixed-width intervals.
pt_pt: Estima a mediana para dados numéricos que foram `agrupados ou colocados em contentores <https://en.wikipedia.org/wiki/Data_binning>`_ em torno dos pontos médios de intervalos consecutivos de largura fixa.
sv: Beräknar medianen för numeriska data som har `grupperats eller binnats <https://en.wikipedia.org/wiki/Data_binning>`_ runt mittpunkterna i på varandra följande intervall med fast bredd.

source: The *data* can be any iterable of numeric data with each value being exactly the midpoint of a bin. At least one value must be present.
pt_pt: Os *data* podem ser qualquer iterável de dados numéricos, com cada valor a ser exatamente o ponto médio de um contentor. Pelo menos um valor deve estar presente.
sv: *Data* kan vara vilken iterabel som helst av numeriska data där varje värde är exakt mittpunkten i en bin. Åtminstone ett värde måste finnas.

source: The *interval* is the width of each bin.
pt_pt: O *interval* é a largura de cada contentor.
sv: *Intervall* är bredden på varje bin.

source: For example, demographic information may have been summarized into consecutive ten-year age groups with each group being represented by the 5-year midpoints of the intervals:
pt_pt: Por exemplo, informações demográficas podem ter sido resumidas em grupos etários consecutivos de dez anos, com cada grupo representado pelos pontos médios de cinco anos dos intervalos:
sv: Demografisk information kan t.ex. ha sammanfattats i på varandra följande tioåriga åldersgrupper där varje grupp representeras av intervallens 5-åriga mittpunkter:

source: The 50th percentile (median) is the 536th person out of the 1071 member cohort. That person is in the 30 to 40 year old age group.
pt_pt: O percentil 50 (mediana) é a 536ª pessoa de um grupo de 1071 membros. Essa pessoa está no grupo etário de 30 a 40 anos.
sv: Den 50:e percentilen (medianen) är den 536:e personen av de 1071 medlemmarna i kohorten. Den personen är i åldersgruppen 30 till 40 år.

source: The regular :func:`median` function would assume that everyone in the tricenarian age group was exactly 35 years old. A more tenable assumption is that the 484 members of that age group are evenly distributed between 30 and 40. For that, we use :func:`median_grouped`:
pt_pt: A função :func:`median` normal assumiria que todos no grupo etário de 30 anos tinham exatamente 35 anos. Uma suposição mais sustentável é que os 484 membros desse grupo etário estão uniformemente distribuídos entre 30 e 40. Para isso, usamos :func:`median_grouped`:
sv: Den vanliga funktionen :func:`median` skulle anta att alla i åldersgruppen tricenarianer var exakt 35 år gamla. Ett mer hållbart antagande är att de 484 medlemmarna i den åldersgruppen är jämnt fördelade mellan 30 och 40. För det använder vi :func:`median_grouped`:

source: The caller is responsible for making sure the data points are separated by exact multiples of *interval*. This is essential for getting a correct result. The function does not check this precondition.
pt_pt: O chamador é responsável por garantir que os pontos de dados estejam separados por múltiplos exatos de *interval*. Isto é essencial para obter um resultado correto. A função não verifica esta pré-condição.
sv: Anroparen ansvarar för att datapunkterna är åtskilda med exakta multiplar av *intervall*. Detta är viktigt för att få ett korrekt resultat. Funktionen kontrollerar inte detta förhandsvillkor.

source: Inputs may be any numeric type that can be coerced to a float during the interpolation step.
pt_pt: As entradas podem ser de qualquer tipo numérico que possa ser convertido para um float durante a etapa de interpolação.
sv: Ingångarna kan vara av vilken numerisk typ som helst som kan omvandlas till en float under interpoleringssteget.

source: Return the single most common data point from discrete or nominal *data*. The mode (when it exists) is the most typical value and serves as a measure of central location.
ja: Повертає єдину найпоширенішу точку даних із дискретних або номінальних *даних*. Режим (якщо він існує) є найбільш типовим значенням і служить мірою центрального розташування.
pt_pt: Devolve o ponto de dados mais comum de dados discretos ou nominais *data*. A moda (quando existe) é o valor mais típico e serve como uma medida de localização central.
sv: Returnerar den enskilt vanligaste datapunkten från diskreta eller nominella *data*. Läget (när det finns) är det mest typiska värdet och fungerar som ett mått på central placering.

source: If there are multiple modes with the same frequency, returns the first one encountered in the *data*. If the smallest or largest of those is desired instead, use ``min(multimode(data))`` or ``max(multimode(data))``. If the input *data* is empty, :exc:`StatisticsError` is raised.
ja: Якщо є кілька режимів з однаковою частотою, повертає перший, який зустрічається в *даних*. Якщо натомість потрібне найменше або найбільше з них, використовуйте ``min(multimode(data))`` або ``max(multimode(data))``. Якщо введення *data* порожнє, виникає :exc:`StatisticsError`.
pt_pt: Se houver várias modas com a mesma frequência, devolve a primeira encontrada nos *data*. Se a menor ou a maior dessas for desejada, use ``min(multimode(data))`` ou ``max(multimode(data))``. Se os *data* de entrada estiverem vazios, é levantado :exc:`StatisticsError`.
sv: Om det finns flera lägen med samma frekvens returneras det första som påträffas i *data*. Om den minsta eller största av dessa önskas istället, använd ``min(multimode(data))`` eller ``max(multimode(data))``. Om indata *data* är tomt, kommer :exc:`StatisticsError` att visas.

source: ``mode`` assumes discrete data and returns a single value. This is the standard treatment of the mode as commonly taught in schools:
ja: ``mode`` は離散データであることを想定していて、1つの値を返します。これは学校で教わるような最頻値の標準的な取扱いです:
pt_pt: ``mode`` assume dados discretos e devolve um único valor. Este é o tratamento padrão da moda, como comumente ensinado nas escolas:
sv: ``mode`` förutsätter diskreta data och returnerar ett enda värde. Detta är standardbehandlingen av mode som vanligtvis lärs ut i skolorna:

source: The mode is unique in that it is the only statistic in this package that also applies to nominal (non-numeric) data:
ja: Режим унікальний тим, що це єдина статистика в цьому пакеті, яка також застосовується до номінальних (нечислових) даних:
pt_pt: A moda é única, pois é a única estatística neste pacote que também se aplica a dados nominais (não numéricos):
sv: Mode är unikt eftersom det är den enda statistiken i det här paketet som även gäller för nominella (icke-numeriska) data:

source: >>> mode(["red", "blue", "blue", "red", "green", "red", "red"]) 'red'
pt_pt: >>> mode(["vermelho", "azul", "azul", "vermelho", "verde", "vermelho", "vermelho"]) 'vermelho'

source: Only hashable inputs are supported. To handle type :class:`set`, consider casting to :class:`frozenset`. To handle type :class:`list`, consider casting to :class:`tuple`. For mixed or nested inputs, consider using this slower quadratic algorithm that only depends on equality tests: ``max(data, key=data.count)``.
pt_pt: Apenas entradas *hashable* são suportadas. Para lidar com o tipo :class:`set`, considere converter para :class:`frozenset`. Para lidar com o tipo :class:`list`, considere converter para :class:`tuple`. Para entradas mistas ou aninhadas, considere usar este algoritmo quadrático mais lento que depende apenas de testes de igualdade: ``max(data, key=data.count)``.
sv: Endast hashbara indata stöds. För att hantera typen :class:`set`, överväg att casta till :class:`frozenset`. För att hantera typen :class:`list`, överväg att casta till :class:`tuple`. För blandade eller nästlade indata kan du överväga att använda den här långsammare kvadratiska algoritmen som bara beror på likhetstester: ``max(data, key=data.count)``.

source: Now handles multimodal datasets by returning the first mode encountered. Formerly, it raised :exc:`StatisticsError` when more than one mode was found.
ja: Тепер обробляє мультимодальні набори даних, повертаючи перший зустрічається режим. Раніше він викликав :exc:`StatisticsError`, коли було знайдено більше ніж один режим.
pt_pt: Agora lida com conjuntos de dados multimodais devolvendo a primeira moda encontrada. Anteriormente, levantava :exc:`StatisticsError` quando mais do que uma moda era encontrada.
sv: Hanterar nu multimodala dataset genom att returnera det första läget som påträffas. Tidigare gav den :exc:`StatisticsError` när mer än ett läge hittades.

source: Return a list of the most frequently occurring values in the order they were first encountered in the *data*. Will return more than one result if there are multiple modes or an empty list if the *data* is empty:
ja: Повертає список значень, які найчастіше зустрічаються, у тому порядку, в якому вони були вперше зустрінуті в *даних*. Поверне більше одного результату, якщо існує кілька режимів, або порожній список, якщо *дані* порожні:
pt_pt: Devolve uma lista dos valores mais frequentemente ocorridos, pela ordem em que foram encontrados nos *data*. Devolverá mais do que um resultado se houver múltiplas modas ou uma lista vazia se os *data* estiverem vazios:
sv: Returnerar en lista med de mest frekvent förekommande värdena i den ordning de först påträffades i *data*. Returnerar mer än ett resultat om det finns flera lägen eller en tom lista om *data* är tom:
