Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ja, pt_pt, sv

source: To estimate the distribution for a model than isn't easy to solve analytically, :class:`NormalDist` can generate input samples for a `Monte Carlo simulation <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
ja: Щоб оцінити розподіл для моделі, яку нелегко розв’язати аналітично, :class:`NormalDist` може генерувати вхідні зразки для `симуляції Монте-Карло <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
