Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ja, pt_pt, sv

source: Spearman's correlation coefficient is appropriate for ordinal data or for continuous data that doesn't meet the linear proportion requirement for Pearson's correlation coefficient.
pt_pt: O coeficiente de correlação de Spearman é apropriado para dados ordinais ou para dados contínuos que não cumprem o requisito de proporção linear para o coeficiente de correlação de Pearson.
sv: Spearmans korrelationskoefficient är lämplig för ordinaldata eller för kontinuerliga data som inte uppfyller kravet på linjär proportion för Pearsons korrelationskoefficient.

source: Both inputs must be of the same length (no less than two), and need not to be constant, otherwise :exc:`StatisticsError` is raised.
ja: Обидва вхідні дані мають бути однакової довжини (не менше двох) і не повинні бути постійними, інакше виникає :exc:`StatisticsError`.
pt_pt: Ambas as entradas devem ter o mesmo comprimento (não menos que dois) e não devem ser constantes, caso contrário, é levantado :exc:`StatisticsError`.
sv: Båda indata måste vara lika långa (minst två), och behöver inte vara konstanta, annars :exc:`StatisticsError` tas upp.

source: Example with `Kepler's laws of planetary motion <https://en.wikipedia.org/wiki/Kepler's_laws_of_planetary_motion>`_:
pt_pt: Exemplo com as `leis de Kepler do movimento planetário <https://en.wikipedia.org/wiki/Kepler's_laws_of_planetary_motion>`_:
sv: Exempel med `Kepler's lagar för planetrörelse <https://en.wikipedia.org/wiki/Kepler's_laws_of_planetary_motion>`_:

source: >>> # Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune >>> orbital_period = [88, 225, 365, 687, 4331, 10_756, 30_687, 60_190] # days >>> dist_from_sun = [58, 108, 150, 228, 778, 1_400, 2_900, 4_500] # million km >>> # Show that a perfect monotonic relationship exists >>> correlation(orbital_period, dist_from_sun, method='ranked') 1.0 >>> # Observe that a linear relationship is imperfect >>> round(correlation(orbital_period, dist_from_sun), 4) 0.9882 >>> # Demonstrate Kepler's third law: There is a linear correlation >>> # between the square of the orbital period and the cube of the >>> # distance from the sun. >>> period_squared = [p * p for p in orbital_period] >>> dist_cubed = [d * d * d for d in dist_from_sun] >>> round(correlation(period_squared, dist_cubed), 4) 1.0
pt_pt: >>> # Mercúrio, Vénus, Terra, Marte, Júpiter, Saturno, Urano e Neptuno >>> orbital_period = [88, 225, 365, 687, 4331, 10_756, 30_687, 60_190] # dias >>> dist_from_sun = [58, 108, 150, 228, 778, 1_400, 2_900, 4_500] # milhões de km >>> # Mostra que existe uma relação monótona perfeita >>> correlation(orbital_period, dist_from_sun, method='ranked') 1.0 >>> # Observa que uma relação linear é imperfeita >>> round(correlation(orbital_period, dist_from_sun), 4) 0.9882 >>> # Demonstra a terceira lei de Kepler: Existe uma correlação linear >>> # entre o quadrado do período orbital e o cubo da >>> # distância ao sol. >>> period_squared = [p * p for p in orbital_period] >>> dist_cubed = [d * d * d for d in dist_from_sun] >>> round(correlation(period_squared, dist_cubed), 4) 1.0

source: Added support for Spearman's rank correlation coefficient.
pt_pt: Adicionado suporte para o coeficiente de correlação de postos de Spearman.
sv: Stöd för Spearmans rangkorrelationskoefficient har lagts till.

source: Return the slope and intercept of `simple linear regression <https://en.wikipedia.org/wiki/Simple_linear_regression>`_ parameters estimated using ordinary least squares. Simple linear regression describes the relationship between an independent variable *x* and a dependent variable *y* in terms of this linear function:
ja: Повертає нахил і відрізок параметрів `простої лінійної регресії <https://en.wikipedia.org/wiki/Simple_linear_regression>`_, оцінених за допомогою звичайних методів найменших квадратів. Проста лінійна регресія описує зв’язок між незалежною змінною *x* і залежною змінною *y* в термінах цієї лінійної функції:
pt_pt: Devolve o declive e a interceção dos parâmetros de `regressão linear simples <https://en.wikipedia.org/wiki/Simple_linear_regression>`_ estimados usando mínimos quadrados ordinários. A regressão linear simples descreve a relação entre uma variável independente *x* e uma variável dependente *y* em termos desta função linear:
sv: Returnerar lutningen och interceptet för `parametrar för enkel linjär regression <https://en.wikipedia.org/wiki/Simple_linear_regression>`_ som uppskattats med hjälp av vanliga minsta kvadratmetoden. Enkel linjär regression beskriver förhållandet mellan en oberoende variabel *x* och en beroende variabel *y* i termer av denna linjära funktion:

source: *y = slope \* x + intercept + noise*
ja: *y = нахил \* x + перехоплення + шум*
pt_pt: *y = declive \* x + interceção + ruído*
sv: *y = lutning \* x + intercept + brus*

source: where ``slope`` and ``intercept`` are the regression parameters that are estimated, and ``noise`` represents the variability of the data that was not explained by the linear regression (it is equal to the difference between predicted and actual values of the dependent variable).
ja: де ``нахил`` і ``перетин`` є параметрами регресії, які оцінюються, а ``шум`` представляє мінливість даних, яка не була пояснена лінійною регресією (він дорівнює різниці між прогнозованим і фактичні значення залежної змінної).
pt_pt: onde ``slope`` e ``intercept`` são os parâmetros de regressão que são estimados, e ``noise`` representa a variabilidade dos dados que não foi explicada pela regressão linear (é igual à diferença entre os valores previstos e reais da variável dependente).
sv: där ``slope`` och ``intercept`` är de regressionsparametrar som uppskattas, och ``noise`` representerar variationen i data som inte förklaras av den linjära regressionen (det är lika med skillnaden mellan förutsagda och faktiska värden för den beroende variabeln).

source: Both inputs must be of the same length (no less than two), and the independent variable *x* cannot be constant; otherwise a :exc:`StatisticsError` is raised.
ja: Обидва входи повинні мати однакову довжину (не менше двох), а незалежна змінна *x* не може бути постійною; інакше виникає :exc:`StatisticsError`.
pt_pt: Ambas as entradas devem ter o mesmo comprimento (não menos que dois), e a variável independente *x* não pode ser constante; caso contrário, é levantado :exc:`StatisticsError`.
sv: Båda indata måste vara lika långa (minst två) och den oberoende variabeln *x* får inte vara konstant, annars uppstår ett :exc:`StatisticsError`.

source: For example, we can use the `release dates of the Monty Python films <https://en.wikipedia.org/wiki/Monty_Python#Films>`_ to predict the cumulative number of Monty Python films that would have been produced by 2019 assuming that they had kept the pace.
ja: Наприклад, ми можемо використати `дати виходу фільмів Монті Пайтона <https://en.wikipedia.org/wiki/Monty_Python#Films>`_, щоб передбачити загальну кількість фільмів Монті Пайтона, які були б створені до 2019 року, якщо припустити, що вони тримали темп.
pt_pt: Por exemplo, podemos usar as `datas de lançamento dos filmes Monty Python <https://en.wikipedia.org/wiki/Monty_Python#Films>`_ para prever o número cumulativo de filmes Monty Python que teriam sido produzidos até 2019, assumindo que tivessem mantido o ritmo.
sv: Vi kan till exempel använda `premiärdatum för Monty Python-filmerna <https://en.wikipedia.org/wiki/Monty_Python#Films>`_" för att förutsäga det kumulativa antalet Monty Python-filmer som skulle ha producerats fram till 2019, förutsatt att de hade hållit samma takt.

source: If *proportional* is true, the independent variable *x* and the dependent variable *y* are assumed to be directly proportional. The data is fit to a line passing through the origin. Since the *intercept* will always be 0.0, the underlying linear function simplifies to:
pt_pt: Se *proportional* for verdadeiro, assume-se que a variável independente *x* e a variável dependente *y* são diretamente proporcionais. Os dados são ajustados a uma linha que passa pela origem. Uma vez que a *interceção* será sempre 0.0, a função linear subjacente simplifica-se para:
sv: Om *proportional* är sant antas den oberoende variabeln *x* och den beroende variabeln *y* vara direkt proportionella. Data anpassas till en linje som går genom origo. Eftersom *skärningspunkten* alltid kommer att vara 0,0 förenklas den underliggande linjära funktionen till:

source: *y = slope \* x + noise*
pt_pt: *y = declive \* x + ruído*
sv: *y = lutning \* x + brus*

source: Continuing the example from :func:`correlation`, we look to see how well a model based on major planets can predict the orbital distances for dwarf planets:
pt_pt: Continuando o exemplo de :func:`correlation`, observamos quão bem um modelo baseado em planetas principais pode prever as distâncias orbitais para planetas anões:
sv: Vi fortsätter med exemplet från :func:`correlation` och undersöker hur väl en modell som baseras på större planeter kan förutsäga omloppsavståndet för dvärgplaneter:

source: >>> model = linear_regression(period_squared, dist_cubed, proportional=True) >>> slope = model.slope >>> # Dwarf planets: Pluto, Eris, Makemake, Haumea, Ceres >>> orbital_periods = [90_560, 204_199, 111_845, 103_410, 1_680] # days >>> predicted_dist = [math.cbrt(slope * (p * p)) for p in orbital_periods] >>> list(map(round, predicted_dist)) [5912, 10166, 6806, 6459, 414] >>> [5_906, 10_152, 6_796, 6_450, 414] # actual distance in million km [5906, 10152, 6796, 6450, 414]
pt_pt: >>> model = linear_regression(period_squared, dist_cubed, proportional=True) >>> slope = model.slope >>> # Planetas anões: Plutão, Éris, Makemake, Haumea, Ceres >>> orbital_periods = [90_560, 204_199, 111_845, 103_410, 1_680] # dias >>> predicted_dist = [math.cbrt(slope * (p * p)) for p in orbital_periods] >>> list(map(round, predicted_dist)) [5912, 10166, 6806, 6459, 414] >>> [5_906, 10_152, 6_796, 6_450, 414] # distância real em milhões de km [5906, 10152, 6796, 6450, 414]

source: Added support for *proportional*.
pt_pt: Adicionado suporte para *proportional*.
sv: Stöd för *proportionell* har lagts till.

source: Exceptions
ja: 例外
pt_pt: Exceções
sv: Undantag

source: A single exception is defined:
ja: 例外が1つ定義されています:
pt_pt: Uma única exceção é definida:
sv: Ett enda undantag definieras:

source: Subclass of :exc:`ValueError` for statistics-related exceptions.
ja: 統計関係の例外。:exc:`ValueError` の派生クラス。
pt_pt: Subclasse de :exc:`ValueError` para exceções relacionadas com estatísticas.
sv: Underklass till :exc:`ValueError` för statistikrelaterade undantag.

source: :class:`NormalDist` objects
ja: :class:`NormalDist` オブジェクト
pt_pt: Objetos :class:`NormalDist`
sv: :class:`NormalDist` objekt

source: :class:`NormalDist` is a tool for creating and manipulating normal distributions of a `random variable <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. It is a class that treats the mean and standard deviation of data measurements as a single entity.
ja: :class:`NormalDist` — це інструмент для створення та керування нормальними розподілами `випадкової змінної <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. Це клас, який розглядає середнє значення та стандартне відхилення вимірювань даних як єдине ціле.
pt_pt: :class:`NormalDist` é uma ferramenta para criar e manipular distribuições normais de uma `variável aleatória <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. É uma classe que trata a média e o desvio padrão das medições de dados como uma única entidade.
sv: :class:`NormalDist` är ett verktyg för att skapa och manipulera normalfördelningar av en `slumpmässig variabel <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. Det är en klass som behandlar medelvärdet och standardavvikelsen för datamätningar som en enda enhet.

source: Normal distributions arise from the `Central Limit Theorem <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ and have a wide range of applications in statistics.
ja: Нормальні розподіли випливають із `Центральної граничної теореми <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ і мають широкий спектр застосувань у статистиці.
pt_pt: As distribuições normais surgem do `Teorema do Limite Central <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ e têm uma vasta gama de aplicações em estatística.
sv: Normalfördelningar härrör från `Central Limit Theorem <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ och har ett brett spektrum av tillämpningar inom statistik.

source: Returns a new *NormalDist* object where *mu* represents the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ and *sigma* represents the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_.
ja: Повертає новий об’єкт *NormalDist*, де *mu* представляє `середнє арифметичне <https://en.wikipedia.org/wiki/Arithmetic_mean>`_, а *sigma* являє собою `стандартне відхилення <https://en.wikipedia.org/wiki/Standard_deviation>`_.
pt_pt: Devolve um novo objeto *NormalDist* onde *mu* representa a `média aritmética <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ e *sigma* representa o `desvio padrão <https://en.wikipedia.org/wiki/Standard_deviation>`_.
sv: Returnerar ett nytt *NormalDist*-objekt där *mu* representerar det `aritmetiska medelvärdet <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ och *sigma* representerar `standardavvikelsen <https://en.wikipedia.org/wiki/Standard_deviation>`_.

source: If *sigma* is negative, raises :exc:`StatisticsError`.
ja: *sigma* が負の数の場合 :exc:`StatisticsError` を送出します。
pt_pt: Se *sigma* for negativo, levanta :exc:`StatisticsError`.
sv: Om *sigma* är negativ, uppstår :exc:`StatisticsError`.

source: A read-only property for the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ of a normal distribution.
ja: Властивість лише для читання для `середнього арифметичного <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ нормального розподілу.
pt_pt: Uma propriedade de apenas leitura para a `média aritmética <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ de uma distribuição normal.
sv: En skrivskyddad egenskap för det `aritmetiska medelvärdet <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ för en normalfördelning.

source: A read-only property for the `median <https://en.wikipedia.org/wiki/Median>`_ of a normal distribution.
ja: Властивість лише для читання для `медіани <https://en.wikipedia.org/wiki/Median>`_ нормального розподілу.
pt_pt: Uma propriedade de apenas leitura para a `mediana <https://en.wikipedia.org/wiki/Median>`_ de uma distribuição normal.
sv: En skrivskyddad egenskap för `median <https://en.wikipedia.org/wiki/Median>`_ för en normalfördelning.

source: A read-only property for the `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ of a normal distribution.
ja: Властивість лише для читання для `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ нормального розподілу.
pt_pt: Uma propriedade de apenas leitura para a `moda <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ de uma distribuição normal.
sv: En skrivskyddad egenskap för `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ för en normalfördelning.

source: A read-only property for the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_ of a normal distribution.
ja: Властивість лише для читання для `стандартного відхилення <https://en.wikipedia.org/wiki/Standard_deviation>`_ нормального розподілу.
pt_pt: Uma propriedade de apenas leitura para o `desvio padrão <https://en.wikipedia.org/wiki/Standard_deviation>`_ de uma distribuição normal.
sv: En skrivskyddad egenskap för `standardavvikelsen <https://en.wikipedia.org/wiki/Standard_deviation>`_ för en normalfördelning.

source: A read-only property for the `variance <https://en.wikipedia.org/wiki/Variance>`_ of a normal distribution. Equal to the square of the standard deviation.
ja: Властивість лише для читання для `variance <https://en.wikipedia.org/wiki/Variance>`_ нормального розподілу. Дорівнює квадрату стандартного відхилення.
pt_pt: Uma propriedade de apenas leitura para a `variância <https://en.wikipedia.org/wiki/Variance>`_ de uma distribuição normal. Igual ao quadrado do desvio padrão.
sv: En skrivskyddad egenskap för `variansen <https://en.wikipedia.org/wiki/Variance>`_ i en normalfördelning. Lika med kvadraten på standardavvikelsen.

source: Makes a normal distribution instance with *mu* and *sigma* parameters estimated from the *data* using :func:`fmean` and :func:`stdev`.
ja: Створює звичайний екземпляр розподілу з параметрами *mu* і *sigma*, оціненими з *data* за допомогою :func:`fmean` і :func:`stdev`.
pt_pt: Cria uma instância de distribuição normal com parâmetros *mu* e *sigma* estimados a partir dos *data* usando :func:`fmean` e :func:`stdev`.
sv: Skapar en normalfördelningsinstans med parametrarna *mu* och *sigma* uppskattade från *data* med hjälp av :func:`fmean` och :func:`stdev`.

source: The *data* can be any :term:`iterable` and should consist of values that can be converted to type :class:`float`. If *data* does not contain at least two elements, raises :exc:`StatisticsError` because it takes at least one point to estimate a central value and at least two points to estimate dispersion.
ja: *Data* може бути будь-яким :term:`iterable` і має складатися зі значень, які можна перетворити на тип :class:`float`. Якщо *data* не містить принаймні двох елементів, виникає :exc:`StatisticsError`, оскільки для оцінки центрального значення потрібна принаймні одна точка, а для оцінки дисперсії — принаймні дві точки.
pt_pt: Os *data* podem ser qualquer :term:`iterável` e devem consistir em valores que possam ser convertidos para o tipo :class:`float`. Se *data* não contiver pelo menos dois elementos, levanta :exc:`StatisticsError`, porque é necessário pelo menos um ponto para estimar um valor central e pelo menos dois pontos para estimar a dispersão.
sv: *data* kan vara valfri :term:`iterable` och bör bestå av värden som kan konverteras till typen :class:`float`. Om *data* inte innehåller minst två element, uppstår :exc:`StatisticsError` eftersom det krävs minst en punkt för att skatta ett centralt värde och minst två punkter för att skatta spridningen.

source: Generates *n* random samples for a given mean and standard deviation. Returns a :class:`list` of :class:`float` values.
ja: Генерує *n* випадкових вибірок для заданого середнього значення та стандартного відхилення. Повертає :class:`list` значень :class:`float`.
pt_pt: Gera *n* amostras aleatórias para uma média e desvio padrão dados. Devolve uma :class:`list` de valores :class:`float`.
sv: Genererar *n* slumpmässiga stickprov för ett givet medelvärde och standardavvikelse. Returnerar en :class:`list` av :class:`float`\-värden.

source: If *seed* is given, creates a new instance of the underlying random number generator. This is useful for creating reproducible results, even in a multi-threading context.
ja: Якщо задано *seed*, створюється новий екземпляр основного генератора випадкових чисел. Це корисно для створення відтворюваних результатів, навіть у багатопоточному контексті.
pt_pt: Se *seed* for fornecido, cria uma nova instância do gerador de números aleatórios subjacente. Isto é útil para criar resultados reprodutíveis, mesmo num contexto de multi-threading.
sv: Om *seed* anges skapas en ny instans av den underliggande slumptalsgeneratorn. Detta är användbart för att skapa reproducerbara resultat, även i ett sammanhang med flera trådar.

source: Switched to a faster algorithm. To reproduce samples from previous versions, use :func:`random.seed` and :func:`random.gauss`.
pt_pt: Mudou para um algoritmo mais rápido. Para reproduzir amostras de versões anteriores, use :func:`random.seed` e :func:`random.gauss`.
sv: Bytte till en snabbare algoritm. För att återskapa exempel från tidigare versioner, använd :func:`random.seed` och :func:`random.gauss`.

source: Using a `probability density function (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, compute the relative likelihood that a random variable *X* will be near the given value *x*. Mathematically, it is the limit of the ratio ``P(x <= X < x+dx) / dx`` as *dx* approaches zero.
ja: Використовуючи `функцію щільності ймовірності (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, обчисліть відносну ймовірність того, що випадкова змінна *X* буде близько заданого значення *x*. Математично, це межа відношення ``P(x <= X < x+dx) / dx``, коли *dx* наближається до нуля.
pt_pt: Usando uma `função de densidade de probabilidade (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, calcula a probabilidade relativa de que uma variável aleatória *X* esteja próxima do valor dado *x*. Matematicamente, é o limite da razão ``P(x <= X < x+dx) / dx`` à medida que *dx* se aproxima de zero.
sv: Med hjälp av en `sannolikhetstäthetsfunktion (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, beräkna den relativa sannolikheten för att en slumpmässig variabel *X* kommer att ligga nära det givna värdet *x*. Matematiskt sett är det gränsen för förhållandet ``P(x <= X < x+dx) / dx`` när *dx* närmar sig noll.

source: The relative likelihood is computed as the probability of a sample occurring in a narrow range divided by the width of the range (hence the word "density"). Since the likelihood is relative to other points, its value can be greater than ``1.0``.
ja: Относительная вероятность рассчитывается как вероятность попадания выборки в узкий диапазон, деленная на ширину диапазона (отсюда и слово «плотность»). Поскольку вероятность определяется относительно других точек, ее значение может быть больше, чем «1,0».
pt_pt: A probabilidade relativa é calculada como a probabilidade de uma amostra ocorrer numa faixa estreita dividida pela largura da faixa (daí a palavra "densidade"). Uma vez que a probabilidade é relativa a outros pontos, o seu valor pode ser maior que ``1.0``.
sv: Den relativa sannolikheten beräknas som sannolikheten för att ett prov förekommer inom ett smalt område dividerat med områdets bredd (därav ordet "densitet"). Eftersom sannolikheten är relativ i förhållande till andra punkter kan dess värde vara större än "1,0".

source: Using a `cumulative distribution function (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, compute the probability that a random variable *X* will be less than or equal to *x*. Mathematically, it is written ``P(X <= x)``.
ja: Використовуючи `кумулятивну функцію розподілу (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, обчисліть імовірність того, що випадкова змінна *X* буде меншою або дорівнює *x*. Математично це пишеться як ``P(X <= x)``.
pt_pt: Usando uma `função de distribuição cumulativa (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, calcula a probabilidade de que uma variável aleatória *X* seja menor ou igual a *x*. Matematicamente, é escrito como ``P(X <= x)``.
sv: Med hjälp av en `cumulative distribution function (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, beräkna sannolikheten för att en slumpmässig variabel *X* kommer att vara mindre än eller lika med *x*. Matematiskt skrivs det ``P(X <= x)``.
