Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ja, pt_pt, sv

source: :mod:`!statistics` --- Mathematical statistics functions
pt_pt: :mod:`!statistics` --- Funções de estatística matemática
sv: :mod:`!statistics` --- Matematiska statistikfunktioner

source: **Source code:** :source:`Lib/statistics.py`
ja: **ソースコード:** :source:`Lib/statistics.py`
pt_pt: **Código-fonte:** :source:`Lib/statistics.py`
sv: **Källkod:** :source:`Lib/statistics.py`

source: This module provides functions for calculating mathematical statistics of numeric (:class:`~numbers.Real`-valued) data.
ja: このモジュールは、数値 (:class:`~numbers.Real` 型) データを数学的に統計計算するための関数を提供します。
pt_pt: Este módulo fornece funções para calcular estatísticas matemáticas de dados numéricos (com valores :class:`~numbers.Real`).
sv: Denna modul innehåller funktioner för att beräkna matematisk statistik för numeriska (:class:`~numbers.Real`\-värderade) data.

source: The module is not intended to be a competitor to third-party libraries such as `NumPy <https://numpy.org>`_, `SciPy <https://scipy.org/>`_, or proprietary full-featured statistics packages aimed at professional statisticians such as Minitab, SAS and Matlab. It is aimed at the level of graphing and scientific calculators.
pt_pt: Este módulo não é destinado a competir com bibliotecas de terceiros como `NumPy <https://numpy.org>`_, `SciPy <https://scipy.org/>`_, ou pacotes estatísticos completos e proprietários destinados a estatísticos profissionais, como Minitab, SAS e Matlab. É direcionado para o nível de gráficos e calculadoras científicas.
sv: Modulen är inte avsedd att vara en konkurrent till tredjepartsbibliotek som `NumPy <https://numpy.org>`_, `SciPy <https://scipy.org/>`_, eller egenutvecklade statistikpaket med fullständiga funktioner som riktar sig till professionella statistiker som Minitab, SAS och Matlab. Programmet är anpassat för grafräknare och vetenskapliga räknare.

source: Unless explicitly noted, these functions support :class:`int`, :class:`float`, :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Behaviour with other types (whether in the numeric tower or not) is currently unsupported. Collections with a mix of types are also undefined and implementation-dependent. If your input data consists of mixed types, you may be able to use :func:`map` to ensure a consistent result, for example: ``map(float, input_data)``.
ja: 特に明記しない限り、これらの関数は :class:`int`, :class:`float`, :class:`~decimal.Decimal` そして :class:`~fractions.Fraction` をサポートします。他の型 (算術型及びそれ以外) は現在サポートされていません。型が混ざったコレクションも未定義で実装依存です。入力データが複数の型からなる場合、:func:`map` を使用すると正しい結果が得られるでしょう。 例: ``map(float, input_data)``。
pt_pt: A menos que seja explicitamente indicado, estas funções suportam :class:`int`, :class:`float`, :class:`~decimal.Decimal` e :class:`~fractions.Fraction`. O comportamento com outros tipos (sejam ou não da torre numérica) não é atualmente suportado. Coleções com uma mistura de tipos também são indefinidas e dependentes da implementação. Se os seus dados de entrada forem compostos por tipos mistos, pode usar :func:`map` para garantir um resultado consistente, por exemplo: ``map(float, input_data)``.
sv: Om inte annat uttryckligen anges, stöder dessa funktioner :class:`int`, :class:`float`, :class:`~decimal.Decimal` och :class:`~fractions.Fraction`. Beteende med andra typer (oavsett om de finns i det numeriska tornet eller inte) stöds för närvarande inte. Samlingar med en blandning av typer är också odefinierade och beroende av implementering. Om dina indata består av blandade typer kan du kanske använda :func:`map` för att säkerställa ett konsekvent resultat, till exempel: ``map(float, input_data)``.

source: Some datasets use ``NaN`` (not a number) values to represent missing data. Since NaNs have unusual comparison semantics, they cause surprising or undefined behaviors in the statistics functions that sort data or that count occurrences. The functions affected are ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()``, and ``quantiles()``. The ``NaN`` values should be stripped before calling these functions::
ja: あるデータセットでは欠損値を表すために ``NaN`` (not a number) を使います。 NaNは通常と異なる比較セマンティクスを持つため、ソートやカウントを行う統計関数では、驚きや未定義の振る舞いを引き起こします。 影響を受ける関数は ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()``, そして ``quantiles()`` です。 これらの関数を呼ぶ前に、 ``NaN`` 値を取り除く必要があります::
pt_pt: Alguns conjuntos de dados usam valores ``NaN`` (*not a number*) para representar dados em falta. Uma vez que os NaNs têm semânticas de comparação invulgares, causam comportamentos surpreendentes ou indefinidos nas funções estatísticas que ordenam dados ou contam ocorrências. As funções afetadas são ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()``, e ``quantiles()``. Os valores ``NaN`` devem ser removidos antes de chamar estas funções:
sv: I vissa dataset används NaN-värden (not a number) för att representera saknade data. Eftersom NaN-värden har en ovanlig jämförelsesemantik orsakar de överraskande eller odefinierade beteenden i statistikfunktioner som sorterar data eller räknar förekomster. De funktioner som påverkas är ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()`` och ``quantiles()``. ``NaN``\-värdena bör tas bort innan du anropar dessa funktioner::

source: >>> from statistics import median >>> from math import isnan >>> from itertools import filterfalse >>> data = [20.7, float('NaN'),19.2, 18.3, float('NaN'), 14.4] >>> sorted(data) # This has surprising behavior [20.7, nan, 14.4, 18.3, 19.2, nan] >>> median(data) # This result is unexpected 16.35 >>> sum(map(isnan, data)) # Number of missing values 2 >>> clean = list(filterfalse(isnan, data)) # Strip NaN values >>> clean [20.7, 19.2, 18.3, 14.4] >>> sorted(clean) # Sorting now works as expected [14.4, 18.3, 19.2, 20.7] >>> median(clean) # This result is now well defined 18.75
pt_pt: >>> from statistics import median >>> from math import isnan >>> from itertools import filterfalse >>> data = [20.7, float('NaN'), 19.2, 18.3, float('NaN'), 14.4] >>> sorted(data) # Este comportamento é surpreendente [20.7, nan, 14.4, 18.3, 19.2, nan] >>> median(data) # Este resultado é inesperado 16.35 >>> sum(map(isnan, data)) # Número de valores em falta 2 >>> clean = list(filterfalse(isnan, data)) # Remove valores NaN >>> clean [20.7, 19.2, 18.3, 14.4] >>> sorted(clean) # A ordenação agora funciona como esperado [14.4, 18.3, 19.2, 20.7] >>> median(clean) # Este resultado está agora bem definido 18.75

source: Averages and measures of central location
ja: 平均及び中心位置の測度
pt_pt: Médias e medidas de localização central
sv: Medelvärden och mått på centralt läge

source: These functions calculate an average or typical value from a population or sample.
ja: これらの関数は母集団または標本の平均値や標準値を計算します。
pt_pt: Estas funções calculam uma média ou valor típico a partir de uma população ou amostra.
sv: Dessa funktioner beräknar ett genomsnittligt eller typiskt värde från en population eller ett urval.

source: Arithmetic mean ("average") of data.
ja: データの算術平均 (いわゆる「平均」) 。
pt_pt: Média aritmética ("média") dos dados.
sv: Aritmetiskt medelvärde ("average") av data.

source: Fast, floating-point arithmetic mean, with optional weighting.
pt_pt: Média aritmética rápida em vírgula flutuante, com ponderação opcional.
sv: Snabbt aritmetiskt medelvärde med flyttal, med valfri viktning.

source: Geometric mean of data.
ja: データの幾何平均。
pt_pt: Média geométrica dos dados.
sv: Geometriskt medelvärde av data.

source: Harmonic mean of data.
ja: データの調和平均。
pt_pt: Média harmónica dos dados.
sv: Harmoniskt medelvärde av data.

source: Estimate the probability density distribution of the data.
pt_pt: Estima a distribuição de densidade de probabilidade dos dados.
sv: Uppskatta sannolikhetstäthetsfördelningen för data.

source: Random sampling from the PDF generated by kde().
pt_pt: Amostragem aleatória da PDF gerada por kde().
sv: Slumpmässigt urval från den PDF som genereras av kde().

source: Median (middle value) of data.
ja: データのメジアン(中央値)。
pt_pt: Mediana (valor médio) dos dados.
sv: Median (medelvärde) av data.

source: Low median of data.
ja: データの low median。
pt_pt: Mediana baixa dos dados.
sv: Låg median av data.

source: High median of data.
ja: データの high median。
pt_pt: Mediana alta dos dados.
sv: Hög median av data.

source: Median (50th percentile) of grouped data.
pt_pt: Mediana (percentil 50) de dados agrupados.
sv: Median (50:e percentilen) för grupperade data.

source: Single mode (most common value) of discrete or nominal data.
ja: 離散/名義尺度データの最頻値 (single mode) 。
pt_pt: Moda única (valor mais comum) de dados discretos ou nominais.
sv: Single mode (vanligaste värdet) av diskreta eller nominella data.

source: List of modes (most common values) of discrete or nominal data.
ja: 離散/名義尺度データの最頻値 (list of modes) 。
pt_pt: Lista de modas (valores mais comuns) de dados discretos ou nominais.
sv: Lista över lägen (de vanligaste värdena) för diskreta eller nominella data.

source: Divide data into intervals with equal probability.
ja: データの等確率での分割。
pt_pt: Divide os dados em intervalos com probabilidade igual.
sv: Dela in data i intervall med lika stor sannolikhet.

source: Measures of spread
ja: 分散の測度
pt_pt: Medidas de dispersão
sv: Mått på spridning

source: These functions calculate a measure of how much the population or sample tends to deviate from the typical or average values.
ja: これらの関数は母集団または標本が標準値や平均値からどれくらい離れているかについて計算します。
pt_pt: Estas funções calculam uma medida de quanto a população ou amostra tende a desviar-se dos valores típicos ou médios.
sv: Dessa funktioner beräknar ett mått på hur mycket populationen eller urvalet tenderar att avvika från de typiska eller genomsnittliga värdena.

source: Population standard deviation of data.
ja: データの母標準偏差。
pt_pt: Desvio padrão populacional dos dados.
sv: Standardavvikelse för data i populationen.

source: Population variance of data.
ja: データの母分散。
pt_pt: Variância populacional dos dados.
sv: Populationsvarians för data.

source: Sample standard deviation of data.
ja: データの標本標準偏差。
pt_pt: Desvio padrão amostral dos dados.
sv: Standardavvikelse för data.

source: Sample variance of data.
ja: データの標本標準分散。
pt_pt: Variância amostral dos dados.
sv: Provvarians av data.

source: Statistics for relations between two inputs
ja: 2入力間の関係の統計
pt_pt: Estatísticas para relações entre duas entradas
sv: Statistik för relationer mellan två inmatningar

source: These functions calculate statistics regarding relations between two inputs.
ja: これらの関数は、2つの入力間の関係について統計量を計算します。
pt_pt: Estas funções calculam estatísticas relativas a relações entre duas entradas.
sv: Dessa funktioner beräknar statistik avseende relationer mellan två indata.

source: Sample covariance for two variables.
ja: 2変数の標本共分散。
pt_pt: Covariância amostral para duas variáveis.
sv: Provkovarians för två variabler.

source: Pearson and Spearman's correlation coefficients.
pt_pt: Coeficientes de correlação de Pearson e Spearman.
sv: Pearson och Spearmans korrelationskoefficienter.

source: Slope and intercept for simple linear regression.
ja: 単回帰の傾きと切片。
pt_pt: Declive e interceção para regressão linear simples.
sv: Lutning och intercept för enkel linjär regression.

source: Function details
ja: 関数の詳細
pt_pt: Detalhes das funções
sv: Funktionsdetaljer

source: Note: The functions do not require the data given to them to be sorted. However, for reading convenience, most of the examples show sorted sequences.
ja: 註釈: 関数の引数となるデータをソートしておく必要はありません。例の多くがソートされているのは見やすさのためです。
pt_pt: Nota: As funções não exigem que os dados fornecidos estejam ordenados. No entanto, por conveniência de leitura, a maioria dos exemplos mostra sequências ordenadas.
sv: Observera: Funktionerna kräver inte att de data som ges till dem är sorterade. För att underlätta läsningen visas dock sorterade sekvenser i de flesta exemplen.

source: Return the sample arithmetic mean of *data* which can be a sequence or iterable.
ja: シーケンス型またはイテラブルになり得る *data* の標本算術平均を返します。
pt_pt: Devolve a média aritmética amostral de *data*, que pode ser uma sequência ou iterável.
sv: Returnerar det aritmetiska medelvärdet för *data* som kan vara en sekvens eller iterabel.

source: The arithmetic mean is the sum of the data divided by the number of data points. It is commonly called "the average", although it is only one of many different mathematical averages. It is a measure of the central location of the data.
ja: 算術平均はデータの総和をデータ数で除したものです。単に「平均」と呼ばれることも多いですが、数学における平均の一種に過ぎません。データの中心位置の測度の一つです。
pt_pt: A média aritmética é a soma dos dados dividida pelo número de pontos de dados. É comumente chamada de "média", embora seja apenas uma das muitas médias matemáticas diferentes. É uma medida da localização central dos dados.
sv: Det aritmetiska medelvärdet är summan av data dividerat med antalet datapunkter. Det kallas ofta för "genomsnittet", även om det bara är ett av många olika matematiska genomsnitt. Det är ett mått på den centrala placeringen av data.

source: If *data* is empty, :exc:`StatisticsError` will be raised.
ja: *data* が空の場合 :exc:`StatisticsError` を送出します。
pt_pt: Se *data* estiver vazio, será levantado :exc:`StatisticsError`.
sv: Om *data* är tom, kommer :exc:`StatisticsError` att uppstå.

source: Some examples of use:
ja: 使用例:
pt_pt: Alguns exemplos de utilização:
sv: Några exempel på användning:

source: The mean is strongly affected by `outliers <https://en.wikipedia.org/wiki/Outlier>`_ and is not necessarily a typical example of the data points. For a more robust, although less efficient, measure of `central tendency <https://en.wikipedia.org/wiki/Central_tendency>`_, see :func:`median`.
ja: mean は `外れ値 <https://ja.wikipedia.org/wiki/外れ値>`_ (`outliers <https://en.wikipedia.org/wiki/Outlier>`_) の影響を強く受け、必ずしもデータ点の典型例とはなりません。効率が悪いものの、より堅牢な、 中心的な傾向 (`central tendency <https://en.wikipedia.org/wiki/Central_tendency>`_) の尺度については、 :func:`median` を参照してください。
pt_pt: A média é fortemente afetada por `valores atípicos <https://en.wikipedia.org/wiki/Outlier>`_ e não é necessariamente um exemplo típico dos pontos de dados. Para uma medida mais robusta, embora menos eficiente, de `tendência central <https://en.wikipedia.org/wiki/Central_tendency>`_, veja :func:`median`.
sv: Medelvärdet påverkas starkt av `extremvärden <https://en.wikipedia.org/wiki/Outlier>`_ och är inte nödvändigtvis ett typiskt exempel på datapunkterna. För ett mer robust, men mindre effektivt, mått på `central tendens <https://en.wikipedia.org/wiki/Central_tendency>`_, se :func:`median`.

source: The sample mean gives an unbiased estimate of the true population mean, so that when taken on average over all the possible samples, ``mean(sample)`` converges on the true mean of the entire population. If *data* represents the entire population rather than a sample, then ``mean(data)`` is equivalent to calculating the true population mean μ.
ja: 標本平均は真の母平均の不偏推定量のため、出来る限り多くの標本から平均を求めると、``mean(sample)`` は真の母平均に収束します (訳注: 大数の法則)。*data* が標本ではなく母集団全体の場合、``mean(data)`` は真の母平均 μ を計算することと等価です。
pt_pt: A média amostral fornece uma estimativa não enviesada da média populacional verdadeira, de modo que, quando considerada em média sobre todas as amostras possíveis, ``mean(sample)`` converge para a média verdadeira de toda a população. Se *data* representar toda a população em vez de uma amostra, então ``mean(data)`` é equivalente a calcular a média populacional verdadeira μ.
sv: Medelvärdet för urvalet ger en opartisk uppskattning av det sanna populationsmedelvärdet, så att när det tas som ett genomsnitt över alla möjliga urval, konvergerar ``mean(sample)`` mot det sanna medelvärdet för hela populationen. Om *data* representerar hela populationen snarare än ett urval, är ``mean(data)`` likvärdigt med att beräkna det sanna populationsmedelvärdet μ.

source: Convert *data* to floats and compute the arithmetic mean.
ja: *data* を float に変換し、算術平均を計算します。
pt_pt: Converte *data* para floats e calcula a média aritmética.
sv: Konvertera *data* till flyttal och beräkna det aritmetiska medelvärdet.

source: This runs faster than the :func:`mean` function and it always returns a :class:`float`. The *data* may be a sequence or iterable. If the input dataset is empty, raises a :exc:`StatisticsError`.
ja: Це працює швидше, ніж функція :func:`mean`, і завжди повертає :class:`float`. *Дані* можуть бути послідовністю або ітерованими. Якщо вхідний набір даних порожній, виникає :exc:`StatisticsError`.
pt_pt: Esta função é mais rápida do que a função :func:`mean` e sempre devolve um :class:`float`. Os *data* podem ser uma sequência ou iterável. Se o conjunto de dados de entrada estiver vazio, levanta um :exc:`StatisticsError`.
sv: Detta går snabbare än funktionen :func:`mean` och returnerar alltid en :class:`float`. *Data* kan vara en sekvens eller iterabel. Om indatauppsättningen är tom, returneras ett :exc:`StatisticsError`.

source: Optional weighting is supported. For example, a professor assigns a grade for a course by weighting quizzes at 20%, homework at 20%, a midterm exam at 30%, and a final exam at 30%:
pt_pt: É suportada ponderação opcional. Por exemplo, um professor atribui uma nota para um curso ponderando os questionários em 20%, os trabalhos de casa em 20%, um exame intermédio em 30% e um exame final em 30%:
sv: Valfri viktning stöds. En professor kan till exempel sätta betyg på en kurs genom att vikta frågesporter med 20 %, hemuppgifter med 20 %, en halvtidstentamen med 30 % och en sluttentamen med 30 %:

source: If *weights* is supplied, it must be the same length as the *data* or a :exc:`ValueError` will be raised.
pt_pt: Se *weights* for fornecido, deve ter o mesmo comprimento que *data*, ou será levantado um :exc:`ValueError`.
sv: Om *weights* anges måste den vara lika lång som *data*, annars uppstår ett :exc:`ValueError`.

source: Added support for *weights*.
ja: *weights* のサポートが追加されました。
pt_pt: Adicionado suporte para *weights*.
sv: Lagt till stöd för *vikter*.

source: Convert *data* to floats and compute the geometric mean.
ja: Перетворіть *дані* на числа з плаваючою точкою та обчисліть середнє геометричне.
pt_pt: Converte *data* para floats e calcula a média geométrica.
sv: Konvertera *data* till flyttal och beräkna det geometriska medelvärdet.

source: The geometric mean indicates the central tendency or typical value of the *data* using the product of the values (as opposed to the arithmetic mean which uses their sum).
ja: Середнє геометричне вказує на центральну тенденцію або типове значення *даних* за допомогою добутку значень (на відміну від середнього арифметичного, яке використовує їх суму).
pt_pt: A média geométrica indica a tendência central ou valor típico dos *data* usando o produto dos valores (em oposição à média aritmética, que usa a sua soma).
sv: Det geometriska medelvärdet anger den centrala tendensen eller det typiska värdet för *data* genom att använda produkten av värdena (i motsats till det aritmetiska medelvärdet som använder summan av värdena).

source: Raises a :exc:`StatisticsError` if the input dataset is empty, if it contains a zero, or if it contains a negative value. The *data* may be a sequence or iterable.
ja: Викликає :exc:`StatisticsError`, якщо вхідний набір даних порожній, містить нуль або містить від’ємне значення. *Дані* можуть бути послідовністю або ітерованими.
pt_pt: Levanta um :exc:`StatisticsError` se o conjunto de dados de entrada estiver vazio, se contiver um zero ou se contiver um valor negativo. Os *data* podem ser uma sequência ou iterável.
sv: Utlöser ett :exc:`StatisticsError` om indatadatasetet är tomt, om det innehåller en nolla eller om det innehåller ett negativt värde. *Data* kan vara en sekvens eller iterabel.

source: No special efforts are made to achieve exact results. (However, this may change in the future.)
ja: Особливих зусиль для досягнення точних результатів не докладається. (Однак це може змінитися в майбутньому.)
pt_pt: Não são feitos esforços especiais para obter resultados exatos. (No entanto, isto pode mudar no futuro.)
sv: Inga särskilda ansträngningar görs för att uppnå exakta resultat. (Detta kan dock komma att ändras i framtiden.)

source: Return the harmonic mean of *data*, a sequence or iterable of real-valued numbers. If *weights* is omitted or ``None``, then equal weighting is assumed.
pt_pt: Devolve a média harmónica de *data*, uma sequência ou iterável de números reais. Se *weights* for omitido ou ``None``, assume-se ponderação igual.
sv: Returnerar det harmoniska medelvärdet av *data*, en sekvens eller iterabel av realvärdesberäknade tal. Om *weights* utelämnas eller ``None``, antas lika viktning.

source: The harmonic mean is the reciprocal of the arithmetic :func:`mean` of the reciprocals of the data. For example, the harmonic mean of three values *a*, *b* and *c* will be equivalent to ``3/(1/a + 1/b + 1/c)``. If one of the values is zero, the result will be zero.
ja: 調和平均（harmonic mean）は、データの逆数の算術平均 :func:`mean` の逆数です。例えば、3つの値 *a*, *b*, *c* の調和平均は``3/(1/a + 1/b + 1/c)`` になります。いずれかの値が0の場合、結果は0になります。
pt_pt: A média harmónica é o inverso da média aritmética (:func:`mean`) dos inversos dos dados. Por exemplo, a média harmónica de três valores *a*, *b* e *c* será equivalente a ``3/(1/a + 1/b + 1/c)``. Se um dos valores for zero, o resultado será zero.
sv: Det harmoniska medelvärdet är reciprokvärdet av det aritmetiska :func:`mean` av de reciproka värdena i data. Till exempel kommer det harmoniska medelvärdet av tre värden *a*, *b* och *c* att motsvara ``3/(1/a + 1/b + 1/c)``. Om ett av värdena är noll blir resultatet noll.

source: The harmonic mean is a type of average, a measure of the central location of the data. It is often appropriate when averaging ratios or rates, for example speeds.
ja: 調和平均は平均の一種で、データの中心位置の測度です。速度のような比(ratios)や率(rates)を平均するときにしばしば適切です。
pt_pt: A média harmónica é um tipo de média, uma medida da localização central dos dados. É frequentemente apropriada ao calcular médias de rácios ou taxas, por exemplo, velocidades.
sv: Det harmoniska medelvärdet är en typ av medelvärde, ett mått på den centrala platsen för data. Det är ofta lämpligt vid medelvärdesberäkning av förhållanden eller hastigheter, t.ex. hastigheter.

source: Suppose a car travels 10 km at 40 km/hr, then another 10 km at 60 km/hr. What is the average speed?
ja: Припустимо, автомобіль проїжджає 10 км зі швидкістю 40 км/год, потім ще 10 км зі швидкістю 60 км/год. Яка середня швидкість?
pt_pt: Suponha que um carro viaja 10 km a 40 km/h e depois mais 10 km a 60 km/h. Qual é a velocidade média?
sv: Antag att en bil färdas 10 km i 40 km/tim och sedan ytterligare 10 km i 60 km/tim. Vad är medelhastigheten?

source: Suppose a car travels 40 km/hr for 5 km, and when traffic clears, speeds-up to 60 km/hr for the remaining 30 km of the journey. What is the average speed?
ja: Припустімо, що автомобіль їде зі швидкістю 40 км/год протягом 5 км, а коли рух припиниться, розвиває швидкість до 60 км/год протягом решти 30 км шляху. Яка середня швидкість?
pt_pt: Suponha que um carro viaja a 40 km/h durante 5 km e, quando o trânsito desimpede, acelera para 60 km/h durante os restantes 30 km da viagem. Qual é a velocidade média?
sv: Antag att en bil kör 40 km/tim i 5 km och när trafiken släpper ökar hastigheten till 60 km/tim under de återstående 30 km av färden. Vad är den genomsnittliga hastigheten?
