Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ja, pt_pt, sv

source: Compute the inverse cumulative distribution function, also known as the `quantile function <https://en.wikipedia.org/wiki/Quantile_function>`_ or the `percent-point <https://web.archive.org/web/20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_ function. Mathematically, it is written ``x : P(X <= x) = p``.
ja: Вычислите обратную кумулятивную функцию распределения, также известную как `функция квантиля <https://en.wikipedia.org/wiki/Quantile_function>`_ или `процентная точка <https://web.archive.org/web/ 20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_ функция. Математически это записывается ``x : P(X <= x) = p``.
pt_pt: Calcula a função de distribuição cumulativa inversa, também conhecida como `função quantil <https://en.wikipedia.org/wiki/Quantile_function>`_ ou a `função percentil <https://web.archive.org/web/20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_. Matematicamente, é escrita como ``x : P(X <= x) = p``.
sv: Beräkna den inversa kumulativa fördelningsfunktionen, även känd som `kvantielfunktionen <https://en.wikipedia.org/wiki/Quantile_function>`_ eller `procentpunktsfunktionen <https://web.archive.org/web/20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_. Matematiskt skrivs den ``x : P(X <= x) = p``.

source: Finds the value *x* of the random variable *X* such that the probability of the variable being less than or equal to that value equals the given probability *p*.
ja: Знаходить таке значення *x* випадкової змінної *X*, що ймовірність того, що змінна буде меншою або дорівнює цьому значенню, дорівнює заданій ймовірності *p*.
pt_pt: Encontra o valor *x* da variável aleatória *X* de tal forma que a probabilidade da variável ser menor ou igual a esse valor seja igual à probabilidade dada *p*.
sv: Tar reda på värdet *x* för den slumpmässiga variabeln *X* så att sannolikheten för att variabeln är mindre än eller lika med detta värde är lika med den givna sannolikheten *p*.

source: Measures the agreement between two normal probability distributions. Returns a value between 0.0 and 1.0 giving `the overlapping area for the two probability density functions <https://www.rasch.org/rmt/rmt101r.htm>`_.
ja: Вимірює узгодженість між двома нормальними розподілами ймовірностей. Повертає значення від 0,0 до 1,0, що дає `область перекриття для двох функцій щільності ймовірності <https://www.rasch.org/rmt/rmt101r.htm>`_.
pt_pt: Medida da concordância entre duas distribuições de probabilidade normal. Devolve um valor entre 0.0 e 1.0 que dá `a área de sobreposição para as duas funções de densidade de probabilidade <https://www.rasch.org/rmt/rmt101r.htm>`_.
sv: Mäter överensstämmelsen mellan två normala sannolikhetsfördelningar. Returnerar ett värde mellan 0,0 och 1,0 som anger `överlappningsområdet för de två sannolikhetstäthetsfunktionerna <https://www.rasch.org/rmt/rmt101r.htm>`_.

source: Divide the normal distribution into *n* continuous intervals with equal probability. Returns a list of (n - 1) cut points separating the intervals.
ja: Розділіть нормальний розподіл на *n* безперервних інтервалів з рівною ймовірністю. Повертає список (n - 1) точок розрізу, що розділяють інтервали.
pt_pt: Divide a distribuição normal em *n* intervalos contínuos com probabilidade igual. Devolve uma lista de (n - 1) pontos de corte que separam os intervalos.
sv: Dela upp normalfördelningen i *n* kontinuerliga intervall med samma sannolikhet. Returnerar en lista med (n - 1) skärningspunkter som separerar intervallen.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate the normal distribution into 100 equal sized groups.
ja: Встановіть *n* на 4 для квартилів (за замовчуванням). Встановіть *n* на 10 для децилів. Встановіть *n* на 100 для процентилів, що дає 99 точок розсічення, які поділяють нормальний розподіл на 100 груп однакового розміру.
pt_pt: Defina *n* como 4 para quartis (predefinição). Defina *n* como 10 para decis. Defina *n* como 100 para percentis, o que fornece os 99 pontos de corte que separam a distribuição normal em 100 grupos de tamanho igual.
sv: Ställ in *n* på 4 för kvartiler (standard). Ställ in *n* till 10 för deciler. Ställ in *n* på 100 för percentiler, vilket ger de 99 skärningspunkter som delar upp normalfördelningen i 100 lika stora grupper.

source: Compute the `Standard Score <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_ describing *x* in terms of the number of standard deviations above or below the mean of the normal distribution: ``(x - mean) / stdev``.
ja: Обчисліть `Стандартну оцінку <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_, що описує *x* у термінах кількості стандартних відхилень вище або нижче середнього нормального розподілу: ``(x - середнє) / стандартне відхилення``.
pt_pt: Calcula o `Standard Score <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_ descrevendo *x* em termos do número de desvios padrão acima ou abaixo da média da distribuição normal: ``(x - mean) / stdev``.
sv: Beräkna `Standardpoäng <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_ som beskriver *x* i termer av antalet standardavvikelser över eller under normalfördelningens medelvärde: ``(x - mean) / stdev``.

source: Instances of :class:`NormalDist` support addition, subtraction, multiplication and division by a constant. These operations are used for translation and scaling. For example:
ja: Екземпляри :class:`NormalDist` підтримують додавання, віднімання, множення та ділення на константу. Ці операції використовуються для перекладу та масштабування. Наприклад:
pt_pt: Instâncias de :class:`NormalDist` suportam adição, subtração, multiplicação e divisão por uma constante. Estas operações são usadas para translação e escalonamento. Por exemplo:
sv: Instanser av :class:`NormalDist` stöder addition, subtraktion, multiplikation och division med en konstant. Dessa operationer används för översättning och skalning. Ett exempel:

source: Dividing a constant by an instance of :class:`NormalDist` is not supported because the result wouldn't be normally distributed.
ja: Ділення константи на екземпляр :class:`NormalDist` не підтримується, оскільки результат не розподілятиметься нормально.
pt_pt: A divisão de uma constante por uma instância de :class:`NormalDist` não é suportada porque o resultado não seria normalmente distribuído.
sv: Att dividera en konstant med en instans av :class:`NormalDist` stöds inte eftersom resultatet inte skulle vara normalfördelat.

source: Since normal distributions arise from additive effects of independent variables, it is possible to `add and subtract two independent normally distributed random variables <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ represented as instances of :class:`NormalDist`. For example:
ja: Оскільки нормальний розподіл виникає внаслідок адитивних ефектів незалежних змінних, можна `додавати та віднімати дві незалежні нормально розподілені випадкові змінні <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_, представлені як екземпляри :class:`NormalDist`. Наприклад:
pt_pt: Uma vez que as distribuições normais surgem de efeitos aditivos de variáveis independentes, é possível `adicionar e subtrair duas variáveis aleatórias normalmente distribuídas e independentes <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_, representadas como instâncias de :class:`NormalDist`. Por exemplo:
sv: Eftersom normalfördelningar uppstår genom additiva effekter av oberoende variabler, är det möjligt att `addera och subtrahera två oberoende normalfördelade slumpmässiga variabler <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ representerade som instanser av :class:`NormalDist`. Till exempel:

source: Examples and Recipes
pt_pt: Exemplos e Receitas
sv: Exempel och recept

source: Classic probability problems
pt_pt: Problemas clássicos de probabilidade
sv: Klassiska sannolikhetsproblem

source: :class:`NormalDist` readily solves classic probability problems.
ja: :class:`NormalDist` легко вирішує класичні ймовірнісні проблеми.
pt_pt: :class:`NormalDist` resolve facilmente problemas clássicos de probabilidade.
sv: :class:`NormalDist` löser enkelt klassiska sannolikhetsproblem.

source: For example, given `historical data for SAT exams <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ showing that scores are normally distributed with a mean of 1060 and a standard deviation of 195, determine the percentage of students with test scores between 1100 and 1200, after rounding to the nearest whole number:
ja: Наприклад, враховуючи `історичні дані для іспитів SAT <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_, які показують, що бали зазвичай розподіляються із середнім значенням 1060 і стандартним відхиленням 195, визначте відсоток студентів із тестовими балами між 1100 і 1200 після округлення до найближчого цілого номер:
pt_pt: Por exemplo, dados os `dados históricos dos exames SAT <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_, que mostram que as pontuações são normalmente distribuídas com uma média de 1060 e um desvio padrão de 195, determine a percentagem de alunos com pontuações de teste entre 1100 e 1200, após arredondamento para o número inteiro mais próximo:
sv: Om du till exempel har `historiska data för SAT-prov <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ som visar att resultaten är normalfördelade med ett medelvärde på 1060 och en standardavvikelse på 195, kan du bestämma andelen elever med provresultat mellan 1100 och 1200, efter avrundning till närmaste heltal:

source: Find the `quartiles <https://en.wikipedia.org/wiki/Quartile>`_ and `deciles <https://en.wikipedia.org/wiki/Decile>`_ for the SAT scores:
ja: Знайдіть `квартилі <https://en.wikipedia.org/wiki/Quartile>`_ і `децилі <https://en.wikipedia.org/wiki/Decile>`_ для результатів SAT:
pt_pt: Encontre os `quartis <https://en.wikipedia.org/wiki/Quartile>`_ e `decis <https://en.wikipedia.org/wiki/Decile>`_ para as pontuações do SAT:
sv: Hitta `kvartilerna <https://en.wikipedia.org/wiki/Quartile>`_ och `decilerna <https://en.wikipedia.org/wiki/Decile>`_ för SAT-poängen:

source: Monte Carlo inputs for simulations
pt_pt: Entradas Monte Carlo para simulações
sv: Monte Carlo-ingångar för simuleringar

source: To estimate the distribution for a model that isn't easy to solve analytically, :class:`NormalDist` can generate input samples for a `Monte Carlo simulation <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
pt_pt: Para estimar a distribuição para um modelo que não é fácil de resolver analiticamente, :class:`NormalDist` pode gerar amostras de entrada para uma `simulação de Monte Carlo <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
sv: För att uppskatta fördelningen för en modell som inte är lätt att lösa analytiskt kan :class:`NormalDist` generera indataprov för en `Monte Carlo-simulering <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:

source: Approximating binomial distributions
pt_pt: Aproximação de distribuições binomiais
sv: Approximation av binomialfördelningar

source: Normal distributions can be used to approximate `Binomial distributions <https://mathworld.wolfram.com/BinomialDistribution.html>`_ when the sample size is large and when the probability of a successful trial is near 50%.
ja: Нормальные распределения можно использовать для аппроксимации `Биномиальных распределений <https://mathworld.wolfram.com/BinomialDistribution.html>`_, когда размер выборки велик и когда вероятность успешного испытания составляет около 50%.
pt_pt: As distribuições normais podem ser usadas para aproximar `distribuições binomiais <https://mathworld.wolfram.com/BinomialDistribution.html>`_ quando o tamanho da amostra é grande e quando a probabilidade de um ensaio bem-sucedido está perto de 50%.
sv: Normalfördelningar kan användas för att approximera `binomialfördelningar <https://mathworld.wolfram.com/BinomialDistribution.html>`_ när urvalsstorleken är stor och när sannolikheten för ett lyckat försök är nära 50%.

source: For example, an open source conference has 750 attendees and two rooms with a 500 person capacity. There is a talk about Python and another about Ruby. In previous conferences, 65% of the attendees preferred to listen to Python talks. Assuming the population preferences haven't changed, what is the probability that the Python room will stay within its capacity limits?
ja: Наприклад, конференція з відкритим кодом має 750 учасників і дві кімнати на 500 осіб. Є розмова про Python, а інша про Ruby. На попередніх конференціях 65% відвідувачів воліли слухати доповіді на Python. Якщо припустити, що переваги населення не змінилися, яка ймовірність того, що кімната Python залишиться в межах своїх можливостей?
pt_pt: Por exemplo, uma conferência de código aberto tem 750 participantes e duas salas com capacidade para 500 pessoas. Há uma palestra sobre Python e outra sobre Ruby. Em conferências anteriores, 65% dos participantes preferiram ouvir palestras sobre Python. Assumindo que as preferências da população não mudaram, qual é a probabilidade de que a sala de Python permaneça dentro dos seus limites de capacidade?
sv: Till exempel har en konferens om öppen källkod 750 deltagare och två rum med en kapacitet på 500 personer. Det finns ett föredrag om Python och ett annat om Ruby. Vid tidigare konferenser föredrog 65% of av deltagarna att lyssna på Python-samtal. Om vi antar att deltagarnas preferenser inte har ändrats, hur stor är sannolikheten att Python-rummet håller sig inom kapacitetsgränserna?

source: >>> n = 750 # Sample size >>> p = 0.65 # Preference for Python >>> q = 1.0 - p # Preference for Ruby >>> k = 500 # Room capacity >>> # Approximation using the cumulative normal distribution >>> from math import sqrt >>> round(NormalDist(mu=n*p, sigma=sqrt(n*p*q)).cdf(k + 0.5), 4) 0.8402 >>> # Exact solution using the cumulative binomial distribution >>> from math import comb, fsum >>> round(fsum(comb(n, r) * p**r * q**(n-r) for r in range(k+1)), 4) 0.8402 >>> # Approximation using a simulation >>> from random import seed, binomialvariate >>> seed(8675309) >>> mean(binomialvariate(n, p) <= k for i in range(10_000)) 0.8406
pt_pt: >>> n = 750 # Tamanho da amostra >>> p = 0.65 # Preferência por Python >>> q = 1.0 - p # Preferência por Ruby >>> k = 500 # Capacidade da sala >>> # Aproximação usando a distribuição normal cumulativa >>> from math import sqrt >>> round(NormalDist(mu=n*p, sigma=sqrt(n*p*q)).cdf(k + 0.5), 4) 0.8402 >>> # Solução exata usando a distribuição binomial cumulativa >>> from math import comb, fsum >>> round(fsum(comb(n, r) * p**r * q**(n-r) for r in range(k+1)), 4) 0.8402 >>> # Aproximação usando uma simulação >>> from random import seed, binomialvariate >>> seed(8675309) >>> mean(binomialvariate(n, p) <= k for i in range(10_000)) 0.8406

source: Naive bayesian classifier
pt_pt: Classificador Naive Bayes
sv: Naiv bayesiansk klassificerare

source: Normal distributions commonly arise in machine learning problems.
ja: Нормальний розподіл зазвичай виникає в задачах машинного навчання.
pt_pt: Distribuições normais surgem comumente em problemas de aprendizagem automática.
sv: Normalfördelningar är vanligt förekommande i maskininlärningsproblem.

source: Wikipedia has a `nice example of a Naive Bayesian Classifier <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>`_. The challenge is to predict a person's gender from measurements of normally distributed features including height, weight, and foot size.
ja: В Википедии есть «хороший пример наивного байесовского классификатора <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>». Задача состоит в том, чтобы предсказать пол человека на основе измерений нормально распределенных характеристик, включая рост, вес и размер стопы.
pt_pt: A Wikipedia tem um `bom exemplo de um Classificador Naive Bayes <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>`_. O desafio é prever o género de uma pessoa a partir de medições de características normalmente distribuídas, incluindo altura, peso e tamanho do pé.
sv: Wikipedia har ett `trevligt exempel på en Naive Bayesian Classifier <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>`_. Utmaningen är att förutsäga en persons kön från mätningar av normalfördelade egenskaper, inklusive längd, vikt och fotstorlek.

source: We're given a training dataset with measurements for eight people. The measurements are assumed to be normally distributed, so we summarize the data with :class:`NormalDist`:
ja: Нам надається навчальний набір даних із вимірюваннями для восьми осіб. Припускається, що вимірювання мають нормальний розподіл, тому ми підсумовуємо дані за допомогою :class:`NormalDist`:
pt_pt: É-nos fornecido um conjunto de dados de treino com medições para oito pessoas. As medições são assumidas como normalmente distribuídas, por isso resumimos os dados com :class:`NormalDist`:
sv: Vi får en träningsdatauppsättning med mätningar för åtta personer. Måtten antas vara normalfördelade, så vi sammanfattar data med :class:`NormalDist`:

source: Next, we encounter a new person whose feature measurements are known but whose gender is unknown:
ja: Далі ми зустрічаємо нову людину, характеристики якої відомі, але стать невідома:
pt_pt: De seguida, encontramos uma nova pessoa cujas medições das características são conhecidas, mas cujo género é desconhecido:
sv: Därefter möter vi en ny person vars funktionsmätningar är kända men vars kön är okänt:

source: >>> ht = 6.0 # height >>> wt = 130 # weight >>> fs = 8 # foot size
pt_pt: >>> ht = 6.0 # altura >>> wt = 130 # peso >>> fs = 8 # tamanho do pé

source: Starting with a 50% `prior probability <https://en.wikipedia.org/wiki/Prior_probability>`_ of being male or female, we compute the posterior as the prior times the product of likelihoods for the feature measurements given the gender:
ja: Починаючи з 50% `попередньої ймовірності <https://en.wikipedia.org/wiki/Prior_probability>`_ бути чоловіком чи жінкою, ми обчислюємо апостеріор як попередній час добуток ймовірностей для вимірювань ознаки з урахуванням статі:
pt_pt: Começando com uma probabilidade `a priori <https://en.wikipedia.org/wiki/Prior_probability>`_ de 50% de ser masculino ou feminino, calculamos a probabilidade a posteriori como a probabilidade a priori vezes o produto das probabilidades para as medições das características dado o género:
sv: Med utgångspunkt från en 50% `prior sannolikhet <https://en.wikipedia.org/wiki/Prior_probability>`_ för att vara man eller kvinna, beräknar vi posterior som prior gånger produkten av sannolikheter för funktionsmätningarna med tanke på kön:

source: The final prediction goes to the largest posterior. This is known as the `maximum a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ or MAP:
ja: Остаточне передбачення йде до найбільшого заднього. Це відомо як `maximum a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ або MAP:
pt_pt: A previsão final vai para a maior probabilidade a posteriori. Isto é conhecido como `máxima a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ ou MAP:
sv: Den slutliga prediktionen går till den största posterior. Detta kallas för `maximal a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ eller MAP:

source: >>> 'male' if posterior_male > posterior_female else 'female' 'female'
pt_pt: >>> 'masculino' if posterior_male > posterior_female else 'feminino' 'feminino'

source: :func:`mean`
sv: :func:`medelvärde`

source: :mod:`statistics` --- Mathematical statistics functions
ja: :mod:`statistics` --- 数理統計関数

source: Median, or 50th percentile, of grouped data.
ja: grouped data の中央値、すなわち50パーセンタイル。

source: Return the harmonic mean of *data*, a sequence or iterable of real-valued numbers. If *weights* is omitted or *None*, then equal weighting is assumed.
ja: Повертає середнє гармонічне *даних*, послідовності чи ітерації дійсних чисел. Якщо *weights* пропущено або *None*, тоді передбачається однакове зважування.

source: Return the median of grouped continuous data, calculated as the 50th percentile, using interpolation. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
ja: 補間を使用して、50番目のパーセンタイルとして計算されたグループ化された連続データの中央値を返します。もし *data* が空の場合、:exc:`StatisticsError` が送出されます。*data* はシーケンス型やイテラブルにもなれます。

source: In the following example, the data are rounded, so that each value represents the midpoint of data classes, e.g. 1 is the midpoint of the class 0.5--1.5, 2 is the midpoint of 1.5--2.5, 3 is the midpoint of 2.5--3.5, etc. With the data given, the middle value falls somewhere in the class 3.5--4.5, and interpolation is used to estimate it:
ja: 次の例ではデータは丸められているため、各値はデータの中間です。例えば 1 は 0.5 と 1.5 の中間、2 は 1.5 と 2.5 の中間、3 は 2.5 と 3.5 の中間です。例では中央の値は 3.5 から 4.5 で、補間により推定されます:

source: Optional argument *interval* represents the class interval, and defaults to 1. Changing the class interval naturally will change the interpolation:
ja: *interval* は間隔を表します。デフォルトは1です。間隔を変えると当然補間値は変わります:

source: This function does not check whether the data points are at least *interval* apart.
ja: この関数はデータ点が少なくとも *interval* だけ差があるかどうかチェックしません。

source: Under some circumstances, :func:`median_grouped` may coerce data points to floats. This behaviour is likely to change in the future.
ja: 環境によっては :func:`median_grouped` はデータ点を強制的に浮動小数点に変換します。この挙動はいずれ変更されるでしょう。

source: If the optional second argument *mu* is given, it is typically the mean of the *data*. It can also be used to compute the second moment around a point that is not the mean. If it is missing or ``None`` (the default), the arithmetic mean is automatically calculated.
ja: Якщо задано необов’язковий другий аргумент *mu*, зазвичай це середнє значення *data*. Його також можна використовувати для обчислення другого моменту навколо точки, яка не є середнім. Якщо воно відсутнє або ``None`` (за замовчуванням), автоматично обчислюється середнє арифметичне.

source: If the optional second argument *xbar* is given, it should be the mean of *data*. If it is missing or ``None`` (the default), the mean is automatically calculated.
ja: 第2引数 *xbar* に値を渡す場合は *data* の平均値でなくてはなりません。*xbar* が与えられない場合や ``None`` の場合 (デフォルト)、平均値は自動的に計算されます。

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *xbar* to avoid recalculation:
ja: 既にデータの平均値を計算している場合、それを第2引数 *xbar* に渡して再計算を避けることが出来ます:

source: The *data* can be any iterable containing sample data. For meaningful results, the number of data points in *data* should be larger than *n*. Raises :exc:`StatisticsError` if there are not at least two data points.
ja: *data* може бути будь-яким iterable, що містить вибіркові дані. Для значущих результатів кількість точок даних у *data* має бути більшою за *n*. Викликає :exc:`StatisticsError`, якщо немає принаймні двох точок даних.

source: :class:`NormalDist` Examples and Recipes
ja: :class:`NormalDist` の例とレシピ
