Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: A range object will be empty if ``r[0]`` does not meet the value constraint. Ranges do support negative indices, but these are interpreted as indexing from the end of the sequence determined by the positive indices.
pt_pt: Um objeto de intervalo estará vazio se ``r[0]`` não cumprir a restrição de valor. Os intervalos suportam índices negativos, mas estes são interpretados como indexação a partir do final da sequência determinada pelos índices positivos.
sv: Ett intervallobjekt är tomt om ``r[0]`` inte uppfyller värdebegränsningen. Ranges har stöd för negativa index, men dessa tolkas som indexering från slutet av den sekvens som bestäms av de positiva indexen.

source: Ranges containing absolute values larger than :data:`sys.maxsize` are permitted but some features (such as :func:`len`) may raise :exc:`OverflowError`.
pt_pt: Intervalos que contêm valores absolutos maiores que :data:`sys.maxsize` são permitidos, mas algumas funcionalidades (como :func:`len`) podem lançar uma exceção :exc:`OverflowError`.
sv: Intervall som innehåller absoluta värden som är större än :data:`sys.maxsize` är tillåtna men vissa funktioner (t.ex. :func:`len`) kan ge upphov till :exc:`OverflowError`.

source: Range examples::
pt_pt: Exemplos de intervalos:
sv: Exempel på intervall::

source: >>> list(range(10)) [0, 1, 2, 3, 4, 5, 6, 7, 8, 9] >>> list(range(1, 11)) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] >>> list(range(0, 30, 5)) [0, 5, 10, 15, 20, 25] >>> list(range(0, 10, 3)) [0, 3, 6, 9] >>> list(range(0, -10, -1)) [0, -1, -2, -3, -4, -5, -6, -7, -8, -9] >>> list(range(0)) [] >>> list(range(1, 0)) []
sv: >>> lista(intervall(10)) [0, 1, 2, 3, 4, 5, 6, 7, 8, 9] >>> lista(intervall(1, 11)) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] >>> lista(intervall(0, 30, 5)) [0, 5, 10, 15, 20, 25] >>> lista(intervall(0, 10, 3)) [0, 3, 6, 9] >>> lista(intervall(0, -10, -1)) [0, -1, -2, -3, -4, -5, -6, -7, -8, -9] >>> lista(intervall(0)) [] >>> list(intervall(1, 0)) []

source: Ranges implement all of the :ref:`common <typesseq-common>` sequence operations except concatenation and repetition (due to the fact that range objects can only represent sequences that follow a strict pattern and repetition and concatenation will usually violate that pattern).
pt_pt: Os intervalos implementam todas as :ref:`operações comuns <typesseq-common>` de sequência, exceto concatenação e repetição (devido ao facto de os objetos de intervalo só poderem representar sequências que seguem um padrão estrito e a repetição e concatenação geralmente violam esse padrão).
sv: Ranges implementerar alla :ref:``common <typesseq-common>` sekvensoperationer utom konkatenering och repetition (på grund av att range-objekt endast kan representera sekvenser som följer ett strikt mönster och repetition och konkatenering bryter vanligtvis mot detta mönster).

source: The value of the *start* parameter (or ``0`` if the parameter was not supplied)
pt_pt: O valor do parâmetro *start* (ou ``0`` se o parâmetro não foi fornecido)
sv: Värdet på parametern *start* (eller ``0`` om parametern inte har angetts)

source: The value of the *stop* parameter
pt_pt: O valor do parâmetro *stop*
sv: Värdet på parametern *stop*

source: The value of the *step* parameter (or ``1`` if the parameter was not supplied)
pt_pt: O valor do parâmetro *step* (ou ``1`` se o parâmetro não foi fornecido)
sv: Värdet på parametern *step* (eller ``1`` om parametern inte har angetts)

source: The advantage of the :class:`range` type over a regular :class:`list` or :class:`tuple` is that a :class:`range` object will always take the same (small) amount of memory, no matter the size of the range it represents (as it only stores the ``start``, ``stop`` and ``step`` values, calculating individual items and subranges as needed).
pt_pt: A vantagem do tipo :class:`range` sobre uma :class:`list` ou :class:`tuple` regular é que um objeto :class:`range` ocupará sempre a mesma (pequena) quantidade de memória, independentemente do tamanho do intervalo que representa (uma vez que armazena apenas os valores ``start``, ``stop`` e ``step``, calculando itens individuais e subintervalos conforme necessário).
sv: Fördelen med typen :class:`range` jämfört med en vanlig :class:`list` eller :class:`tuple` är att ett :class:`range`-objekt alltid tar samma (lilla) mängd minne i anspråk, oavsett storleken på det intervall det representerar (eftersom det bara lagrar värdena ``start``, ``stop`` och ``step`` och beräknar enskilda objekt och delintervall efter behov).

source: Range objects implement the :class:`collections.abc.Sequence` ABC, and provide features such as containment tests, element index lookup, slicing and support for negative indices (see :ref:`typesseq`):
pt_pt: Os objetos de intervalo implementam a ABC :class:`collections.abc.Sequence` e fornecem funcionalidades como testes de contenção, pesquisa de índice de elemento, fatiamento e suporte para índices negativos (consulte :ref:`typesseq`):
sv: Range-objekt implementerar :class:`collections.abc.Sequence` ABC, och tillhandahåller funktioner som inneslutningstest, elementindexuppslagning, skivning och stöd för negativa index (se :ref:`typesseq`):

source: Testing range objects for equality with ``==`` and ``!=`` compares them as sequences. That is, two range objects are considered equal if they represent the same sequence of values. (Note that two range objects that compare equal might have different :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes, for example ``range(0) == range(2, 1, 3)`` or ``range(0, 3, 2) == range(0, 4, 2)``.)
pt_pt: Testar objetos de intervalo para igualdade com ``==`` e ``!=`` compara-os como sequências. Ou seja, dois objetos de intervalo são considerados iguais se representarem a mesma sequência de valores. (Note que dois objetos de intervalo que comparam igual podem ter atributos :attr:`~range.start`, :attr:`~range.stop` e :attr:`~range.step` diferentes, por exemplo ``range(0) == range(2, 1, 3)`` ou ``range(0, 3, 2) == range(0, 4, 2)``.)
sv: När intervallobjekt testas för likhet med ``==`` och ``!=`` jämförs de som sekvenser. Det innebär att två intervallobjekt anses vara lika om de representerar samma sekvens av värden. (Observera att två intervallobjekt som jämförs lika kan ha olika attribut :attr:`~range.start`, :attr:`~range.stop` och :attr:`~range.step`, till exempel ``range(0) == range(2, 1, 3)`` eller ``range(0, 3, 2) == range(0, 4, 2)``.)

source: Implement the Sequence ABC. Support slicing and negative indices. Test :class:`int` objects for membership in constant time instead of iterating through all items.
pt_pt: Implementa a ABC de Sequência. Suporta fatiamento e índices negativos. Testa objetos :class:`int` para pertencerem em tempo constante em vez de iterar por todos os itens.
sv: Implementera sekvensen ABC. Stödjer skivning och negativa index. Testa :class:`int`-objekt för medlemskap i konstant tid istället för att iterera genom alla objekt.

source: Define '==' and '!=' to compare range objects based on the sequence of values they define (instead of comparing based on object identity).
pt_pt: Define '==' e '!=' para comparar objetos de intervalo com base na sequência de valores que definem (em vez de comparar com base na identidade do objeto).
sv: Definiera '==' och '!=' för att jämföra intervallobjekt baserat på den sekvens av värden som de definierar (istället för att jämföra baserat på objektets identitet).

source: Added the :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes.
pt_pt: Adicionados os atributos :attr:`~range.start`, :attr:`~range.stop` e :attr:`~range.step`.
sv: Lagt till attributen :attr:`~range.start`, :attr:`~range.stop` och :attr:`~range.step`.

source: The `linspace recipe <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ shows how to implement a lazy version of range suitable for floating-point applications.
pt_pt: A `receita linspace <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ mostra como implementar uma versão preguiçosa de intervalo adequada para aplicações de ponto flutuante.
sv: I `linspace-receptet <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ visas hur man implementerar en lat version av range som är lämplig för flyttalsapplikationer.

source: Text and Binary Sequence Type Methods Summary
sv: Metoder för text- och binära sekvenstyper Sammanfattning

source: The following table summarizes the text and binary sequence types methods by category.
sv: I följande tabell sammanfattas metoderna för text- och binära sekvenstyper per kategori.

source: Category
sv: Kategori

source: :class:`str` methods
sv: :klass:`str` metoder

source: :class:`bytes` and :class:`bytearray` methods
sv: metoderna :class:`bytes` och :class:`bytearray

source: Formatting
sv: Formaterar

source: :ref:`f-strings`
sv: :ref:`f-strängar`

source: :ref:`old-string-formatting`
sv: :ref:`gammal strängformatering`

source: :ref:`bytes-formatting`
sv: :ref:`bytesformatering`

source: Searching and Replacing
sv: Sökning och byte

source: Splitting and Joining
sv: Delning och sammanfogning

source: String Classification
sv: Klassificering av strängar

source: Case Manipulation
sv: Manipulation av ärenden

source: :meth:`bytes.lower`
sv: :meth:`bytes.lägre`

source: :meth:`str.upper`
sv: :meth:`str.övre`

source: :meth:`bytes.upper`
sv: :meth:`bytes.övre`

source: :meth:`bytes.title`
sv: :meth:`bytes.titel`

source: Padding and Stripping
sv: Stoppning och strippning

source: Translation and Encoding
sv: Översättning och kodning

source: :meth:`bytes.decode`
sv: :meth:`bytes.avkodning`

source: Text Sequence Type --- :class:`str`
pt_pt: Tipo de sequência de texto --- :class:`str`
sv: Textsekvenstyp --- :class:`str`

source: Textual data in Python is handled with :class:`str` objects, or :dfn:`strings`. Strings are immutable :ref:`sequences <typesseq>` of Unicode code points. String literals are written in a variety of ways:
pt_pt: Os dados textuais em Python são manipulados com objetos :class:`str`, ou :dfn:`strings`. As *strings* são sequências :ref:`imutáveis <typesseq>` de pontos de código Unicode. Os literais de *string* são escritos de várias formas:
sv: Textdata i Python hanteras med :class:`str`-objekt, eller :dfn:`strings`. Strängar är oföränderliga :ref:`sekvenser <typesseq>` av Unicode-kodpunkter. Stränglitteraler skrivs på en mängd olika sätt:

source: Single quotes: ``'allows embedded "double" quotes'``
pt_pt: Aspas simples: ``'allows embedded "double" quotes'``
sv: Enkla citattecken: ``'tillåter inbäddade "dubbla" citationstecken'```

source: Double quotes: ``"allows embedded 'single' quotes"``
pt_pt: Aspas duplas: ``"allows embedded 'single' quotes"``
sv: Dubbla citattecken: ``"tillåter inbäddade 'enkla' citationstecken"``

source: Triple quoted: ``'''Three single quotes'''``, ``"""Three double quotes"""``
pt_pt: Triplas aspas: ``'''Three single quotes'''``, ``"""Three double quotes"""``
sv: Trippelcitat: ``"""Tre enkla citattecken"""``, ``"""Tre dubbla citattecken"""``

source: Triple quoted strings may span multiple lines - all associated whitespace will be included in the string literal.
pt_pt: As *strings* com aspas triplas podem abrangem várias linhas - todo o espaço em branco associado será incluído no literal da *string*.
sv: Strängar med trippelcitat kan sträcka sig över flera rader - alla tillhörande blanksteg kommer att inkluderas i strängens bokstav.

source: String literals that are part of a single expression and have only whitespace between them will be implicitly converted to a single string literal. That is, ``("spam " "eggs") == "spam eggs"``.
pt_pt: Literais de *string* que fazem parte de uma única expressão e têm apenas espaços em branco entre eles serão implicitamente convertidos num único literal de *string*. Ou seja, ``("spam " "eggs") == "spam eggs"``.
sv: Stränglitteraler som är en del av ett enda uttryck och som bara har blanksteg mellan sig konverteras implicit till en enda stränglitteral. Det vill säga ``("spam " "ägg") == "spam ägg"``.

source: See :ref:`strings` for more about the various forms of string literal, including supported :ref:`escape sequences <escape-sequences>`, and the ``r`` ("raw") prefix that disables most escape sequence processing.
pt_pt: Consulte :ref:`strings` para mais informações sobre as várias formas de literais de *string*, incluindo :ref:`sequências de escape <escape-sequences>`, e o prefixo ``r`` ("raw") que desativa a maior parte do processamento de sequências de escape.
sv: Se :ref:`strings` för mer information om de olika formerna av strängbokstäver, inklusive stöd för :ref:`escape-sekvenser <escape-sequences>`, och prefixet ``r`` ("raw") som inaktiverar den mesta bearbetningen av escape-sekvenser.

source: Strings may also be created from other objects using the :class:`str` constructor.
pt_pt: As *strings* também podem ser criadas a partir de outros objetos usando o construtor :class:`str`.
sv: Strängar kan också skapas från andra objekt med hjälp av :class:`str`-konstruktören.

source: Since there is no separate "character" type, indexing a string produces strings of length 1. That is, for a non-empty string *s*, ``s[0] == s[0:1]``.
pt_pt: Como não existe um tipo "caractere" separado, indexar uma *string* produz *strings* de comprimento 1. Ou seja, para uma *string* não vazia *s*, ``s[0] == s[0:1]``.
sv: Eftersom det inte finns någon separat "tecken"-typ, ger indexering av en sträng strängar med längden 1. Det vill säga, för en icke-tom sträng *s*, ``s[0] == s[0:1]``.

source: There is also no mutable string type, but :meth:`str.join` or :class:`io.StringIO` can be used to efficiently construct strings from multiple fragments.
pt_pt: Também não existe um tipo de *string* mutável, mas :meth:`str.join` ou :class:`io.StringIO` podem ser usados para construir *strings* de forma eficiente a partir de múltiplos fragmentos.
sv: Det finns inte heller någon mutabel strängtyp, men :meth:`str.join` eller :class:`io.StringIO` kan användas för att effektivt konstruera strängar från flera fragment.

source: For backwards compatibility with the Python 2 series, the ``u`` prefix is once again permitted on string literals. It has no effect on the meaning of string literals and cannot be combined with the ``r`` prefix.
pt_pt: Para compatibilidade com a série Python 2, o prefixo ``u`` é novamente permitido em literais de *string*. Não tem efeito no significado dos literais de *string* e não pode ser combinado com o prefixo ``r``.
sv: För bakåtkompatibilitet med Python 2-serien är prefixet ``u`` återigen tillåtet för stränglitteraler. Det har ingen effekt på betydelsen av stränglitteraler och kan inte kombineras med prefixet ``r``.

source: Return a :ref:`string <textseq>` version of *object*. If *object* is not provided, returns the empty string. Otherwise, the behavior of ``str()`` depends on whether *encoding* or *errors* is given, as follows.
pt_pt: Retorna uma versão :ref:`string <textseq>` de *object*. Se *object* não for fornecido, retorna a *string* vazia. Caso contrário, o comportamento de ``str()`` depende de *encoding* ou *errors* serem fornecidos, como se segue.
sv: Returnerar en :ref:`sträng <textseq>`-version av *objekt*. Om *object* inte anges, returneras den tomma strängen. Annars beror beteendet hos ``str()`` på om *encoding* eller *errors* anges, enligt följande.

source: If neither *encoding* nor *errors* is given, ``str(object)`` returns :meth:`type(object).__str__(object) <object.__str__>`, which is the "informal" or nicely printable string representation of *object*. For string objects, this is the string itself. If *object* does not have a :meth:`~object.__str__` method, then :func:`str` falls back to returning :func:`repr(object) <repr>`.
pt_pt: Se nem *encoding* nem *errors* forem fornecidos, ``str(object)`` retorna :meth:`type(object).__str__(object) <object.__str__>`, que é a representação de *string* "informal" ou bem imprimível de *object*. Para objetos de *string*, esta é a própria *string*. Se *object* não tiver um método :meth:`~object.__str__`, então :func:`str` recorre a retornar :func:`repr(object) <repr>`.
sv: Om varken *encoding* eller *errors* anges returnerar ``str(object)`` :meth:`type(object).__str__(object) <object.__str__>`, vilket är den "informella" eller snyggt utskrivbara strängrepresentationen av *object*. För strängobjekt är detta själva strängen. Om *object* inte har en :meth:`~object.__str__`-metod, faller :func:`str` tillbaka till att returnera :func:`repr(object) <repr>`.

source: If at least one of *encoding* or *errors* is given, *object* should be a :term:`bytes-like object` (e.g. :class:`bytes` or :class:`bytearray`). In this case, if *object* is a :class:`bytes` (or :class:`bytearray`) object, then ``str(bytes, encoding, errors)`` is equivalent to :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Otherwise, the bytes object underlying the buffer object is obtained before calling :meth:`bytes.decode`. See :ref:`binaryseq` and :ref:`bufferobjects` for information on buffer objects.
pt_pt: Se pelo menos um de *encoding* ou *errors* for fornecido, *object* deve ser um :term:`objeto do tipo bytes` (por exemplo, :class:`bytes` ou :class:`bytearray`). Neste caso, se *object* for um objeto :class:`bytes` (ou :class:`bytearray`), então ``str(bytes, encoding, errors)`` é equivalente a :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Caso contrário, o objeto de bytes subjacente ao objeto de buffer é obtido antes de chamar :meth:`bytes.decode`. Consulte :ref:`binaryseq` e :ref:`bufferobjects` para informações sobre objetos de buffer.
sv: Om minst en av *encoding* eller *errors* anges, bör *object* vara ett :term:`bytes-liknande objekt` (t.ex. :class:`bytes` eller :class:`bytearray`). I det här fallet, om *objekt* är ett :class:`bytes` (eller :class:`bytearray`) objekt, så är ``str(bytes, encoding, errors)`` ekvivalent med :meth:`bytes.decode(encoding, errors) <bytes.decode>`. I annat fall erhålls bytesobjektet som ligger under buffertobjektet innan :meth:`bytes.decode` anropas. Se :ref:`binaryseq` och :ref:`bufferobjects` för information om buffertobjekt.

source: Passing a :class:`bytes` object to :func:`str` without the *encoding* or *errors* arguments falls under the first case of returning the informal string representation (see also the :option:`-b` command-line option to Python). For example::
pt_pt: Passar um objeto :class:`bytes` para :func:`str` sem os argumentos *encoding* ou *errors* enquadra-se no primeiro caso de retorno da representação informal de *string* (consulte também a opção de linha de comandos :option:`-b` do Python). Por exemplo:
sv: Att skicka ett :class:`bytes`-objekt till :func:`str` utan argumenten *encoding* eller *errors* faller under det första fallet av att returnera den informella strängrepresentationen (se även kommandoradsalternativet :option:`-b` till Python). Till exempel::

source: For more information on the ``str`` class and its methods, see :ref:`textseq` and the :ref:`string-methods` section below. To output formatted strings, see the :ref:`f-strings` and :ref:`formatstrings` sections. In addition, see the :ref:`stringservices` section.
pt_pt: Para mais informações sobre a classe ``str`` e os seus métodos, consulte :ref:`textseq` e a secção :ref:`string-methods` abaixo. Para produzir *strings* formatadas, consulte as secções :ref:`f-strings` e :ref:`formatstrings`. Além disso, consulte a secção :ref:`stringservices`.
sv: Mer information om klassen ``str`` och dess metoder finns i avsnitten :ref:`textseq` och :ref:`string-methods` nedan. För att skriva ut formaterade strängar, se avsnitten :ref:`f-strings` och :ref:`formatstrings`. Dessutom, se avsnittet :ref:`stringservices`.

source: String Methods
pt_pt: Métodos de *string*
sv: Strängmetoder

source: Strings implement all of the :ref:`common <typesseq-common>` sequence operations, along with the additional methods described below.
pt_pt: As *strings* implementam todas as :ref:`operações comuns <typesseq-common>` de sequência, juntamente com os métodos adicionais descritos abaixo.
sv: Strängar implementerar alla :ref:`common <typesseq-common>` sekvensoperationer, tillsammans med de ytterligare metoder som beskrivs nedan.

source: Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (see :meth:`str.format`, :ref:`formatstrings` and :ref:`string-formatting`) and the other based on C ``printf`` style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle (:ref:`old-string-formatting`).
pt_pt: As *strings* também suportam dois estilos de formatação de *strings*, um que fornece um grande grau de flexibilidade e personalização (consulte :meth:`str.format`, :ref:`formatstrings` e :ref:`string-formatting`) e outro baseado na formatação no estilo C ``printf``, que lida com uma gama mais estreita de tipos e é um pouco mais difícil de usar corretamente, mas é geralmente mais rápido para os casos que pode lidar (:ref:`old-string-formatting`).
sv: Strängar har också stöd för två typer av strängformatering, en som ger stor flexibilitet och möjlighet till anpassning (se :meth:`str.format`, :ref:`formatstrings` och :ref:`string-formatting`) och en som baseras på C ``printf``-stilformatering som hanterar ett smalare urval av typer och är något svårare att använda korrekt, men som ofta är snabbare i de fall den kan hantera (:ref:`old-string-formatting`).

source: The :ref:`textservices` section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the :mod:`re` module).
pt_pt: A secção :ref:`textservices` da biblioteca padrão abrange vários outros módulos que fornecem várias utilidades relacionadas com texto (incluindo suporte para expressões regulares no módulo :mod:`re`).
sv: Avsnittet :ref:`textservices` i standardbiblioteket omfattar ett antal andra moduler som tillhandahåller olika textrelaterade verktyg (inklusive stöd för reguljära uttryck i modulen :mod:`re`).

source: Return a copy of the string with its first character capitalized and the rest lowercased.
pt_pt: Retorna uma cópia da *string* com o primeiro caractere em maiúscula e o resto em minúsculas.
sv: Returnerar en kopia av strängen med första tecknet i versaler och resten i gemener.

source: The first character is now put into titlecase rather than uppercase. This means that characters like digraphs will only have their first letter capitalized, instead of the full character.
pt_pt: O primeiro caractere é agora colocado em título em vez de maiúscula. Isto significa que caracteres como dígrafos terão apenas a sua primeira letra maiúscula, em vez de todo o caractere.
sv: Det första tecknet sätts nu i titelbokstäver i stället för versaler. Detta innebär att tecken som digrafer endast får sin första bokstav versaliserad, istället för hela tecknet.

source: Return a casefolded copy of the string. Casefolded strings may be used for caseless matching.
pt_pt: Retorna uma cópia da *string* em *casefold*. *Strings* em *casefold* podem ser usadas para correspondência sem distinção de maiúsculas/minúsculas.
sv: Returnerar en casefoldad kopia av strängen. Casefoldade strängar kan användas för caseless matchning.
