Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format string, or a single mapping object (for example, a dictionary).
pt_pt: Se *format* requer um único argumento, *values* pode ser um objeto não-tuplo. [5]_ Caso contrário, *values* deve ser um tuplo com exatamente o número de itens especificado pela *string* de formato, ou um único objeto de mapeamento (por exemplo, um dicionário).
sv: Om *format* kräver ett enda argument kan *values* vara ett enda objekt som inte är en tupel. [5]_ Annars måste *values* vara en tupel med exakt det antal objekt som anges i formatsträngen, eller ett enda mappningsobjekt (t.ex. en ordbok).

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
pt_pt: Um especificador de conversão contém dois ou mais caracteres e tem os seguintes componentes, que devem ocorrer nesta ordem:
sv: En konverteringsspecifikator innehåller två eller flera tecken och har följande komponenter, som måste förekomma i denna ordning:

source: The ``'%'`` character, which marks the start of the specifier.
pt_pt: O caractere ``'%'``, que marca o início do especificador.
sv: Tecknet ``'%'``, som markerar början på specifikationen.

source: Mapping key (optional), consisting of a parenthesised sequence of characters (for example, ``(somename)``).
pt_pt: Chave de mapeamento (opcional), consistindo numa sequência de caracteres entre parênteses (por exemplo, ``(somename)``).
sv: Mappningsnyckel (valfri) som består av en sekvens av tecken inom parentes (t.ex. ``(somename)``).

source: Conversion flags (optional), which affect the result of some conversion types.
pt_pt: Flags de conversão (opcionais), que afetam o resultado de alguns tipos de conversão.
sv: Konverteringsflaggor (valfritt), som påverkar resultatet av vissa konverteringstyper.

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is read from the next element of the tuple in *values*, and the object to convert comes after the minimum field width and optional precision.
pt_pt: Largura mínima do campo (opcional). Se especificado como ``'*'`` (asterisco), a largura real é lida do próximo elemento do tuplo em *values*, e o objeto a converter vem depois da largura mínima do campo e da precisão opcional.
sv: Minsta fältbredd (valfritt). Om den anges som en ``'*'`` (asterisk) läses den faktiska bredden från nästa element i tupeln i *values*, och objektet som ska konverteras kommer efter den minsta fältbredden och den valfria precisionen.

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is read from the next element of the tuple in *values*, and the value to convert comes after the precision.
pt_pt: Precisão (opcional), dada como um ``'.'`` (ponto) seguido da precisão. Se especificado como ``'*'`` (um asterisco), a precisão real é lida do próximo elemento do tuplo em *values*, e o valor a converter vem depois da precisão.
sv: Precision (valfri), anges som en ``'.'`` (punkt) följt av precisionen. Om den anges som ``'*'`` (en asterisk) läses den faktiska precisionen från nästa element i tupeln i *values*, och värdet som ska konverteras kommer efter precisionen.

source: Length modifier (optional).
pt_pt: Modificador de comprimento (opcional).
sv: Längdmodifierare (valfritt).

source: Conversion type.
pt_pt: Tipo de conversão.
sv: Typ av konvertering.

source: When the right argument is a dictionary (or other mapping type), then the formats in the string *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
pt_pt: Quando o argumento da direita é um dicionário (ou outro tipo de mapeamento), então os formatos na *string* *devem* incluir uma chave de mapeamento entre parênteses para esse dicionário inserida imediatamente após o caractere ``'%'``. A chave de mapeamento seleciona o valor a ser formatado a partir do mapeamento. Por exemplo:
sv: När det högra argumentet är en ordbok (eller annan mappningstyp), måste formaten i strängen *inkludera* en parentetisk mappningsnyckel till ordboken som infogas omedelbart efter tecknet ``'%'``. Mappningsnyckeln väljer det värde som ska formateras från mappningen. Till exempel

source: In this case no ``*`` specifiers may occur in a format (since they require a sequential parameter list).
pt_pt: Neste caso, não podem ocorrer especificadores ``*`` num formato (uma vez que requerem uma lista de parâmetros sequencial).
sv: I detta fall får inga ``*``-specifikatorer förekomma i ett format (eftersom de kräver en sekventiell parameterlista).

source: The conversion flag characters are:
pt_pt: Os caracteres de flag de conversão são:
sv: Konverteringens flaggtecken är:

source: Flag
sv: Flagga

source: The value conversion will use the "alternate form" (where defined below).
pt_pt: A conversão de valor usará a "forma alternativa" (onde definida abaixo).
sv: Värdeomvandlingen kommer att använda den "alternativa formen" (enligt definitionen nedan).

source: The conversion will be zero padded for numeric values.
pt_pt: A conversão será preenchida com zeros para valores numéricos.
sv: Omvandlingen kommer att nollställas för numeriska värden.

source: The converted value is left adjusted (overrides the ``'0'`` conversion if both are given).
pt_pt: O valor convertido é alinhado à esquerda (substitui a conversão ``'0'`` se ambos forem fornecidos).
sv: Det konverterade värdet lämnas justerat (åsidosätter konverteringen ``'0'`` om båda anges).

source: (a space) A blank should be left before a positive number (or empty string) produced by a signed conversion.
pt_pt: (um espaço) Um espaço em branco deve ser deixado antes de um número positivo (ou *string* vazia) produzido por uma conversão com sinal.
sv: (ett mellanslag) Ett mellanslag ska lämnas före ett positivt tal (eller en tom sträng) som produceras genom en signerad konvertering.

source: A sign character (``'+'`` or ``'-'``) will precede the conversion (overrides a "space" flag).
pt_pt: Um caractere de sinal (``'+'`` ou ``'-'``) precederá a conversão (substitui uma flag de "espaço").
sv: Ett tecken (``'+'`` eller ``'-'``) kommer att föregå konverteringen (åsidosätter en "mellanslagsflagga").

source: A length modifier (``h``, ``l``, or ``L``) may be present, but is ignored as it is not necessary for Python -- so e.g. ``%ld`` is identical to ``%d``.
pt_pt: Um modificador de comprimento (``h``, ``l`` ou ``L``) pode estar presente, mas é ignorado, uma vez que não é necessário para Python -- por exemplo, ``%ld`` é idêntico a ``%d``.
sv: En längdmodifierare (``h``, ``l`` eller ``L``) kan förekomma, men ignoreras eftersom den inte är nödvändig för Python - så t.ex. ``%ld`` är identisk med ``%d``.

source: The conversion types are:
pt_pt: Os tipos de conversão são:
sv: Konverteringstyperna är:

source: Signed integer decimal.
pt_pt: Decimal inteiro com sinal.
sv: Decimalt heltal med tecken.

source: Signed octal value.
pt_pt: Valor octal com sinal.
sv: Sekvenserat oktalt värde.

source: Obsolete type -- it is identical to ``'d'``.
pt_pt: Tipo obsoleto -- é idêntico a ``'d'``.
sv: Föråldrad typ - identisk med ``'d'``.

source: Signed hexadecimal (lowercase).
pt_pt: Hexadecimal com sinal (minúsculas).
sv: Signerad hexadecimal (gemener).

source: Signed hexadecimal (uppercase).
pt_pt: Hexadecimal com sinal (maiúsculas).
sv: Signerad hexadecimal (versaler).

source: Floating-point exponential format (lowercase).
pt_pt: Formato exponencial de ponto flutuante (minúsculas).
sv: Exponentiellt format för flyttal (små bokstäver).

source: Floating-point exponential format (uppercase).
pt_pt: Formato exponencial de ponto flutuante (maiúsculas).
sv: Exponentiellt format för flyttal (versaler).

source: Floating-point decimal format.
pt_pt: Formato decimal de ponto flutuante.
sv: Decimalformat för flyttal.

source: Floating-point format. Uses lowercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
pt_pt: Formato de ponto flutuante. Usa formato exponencial minúsculo se o expoente for menor que -4 ou não for menor que a precisão, formato decimal caso contrário.
sv: Flyttalsformat. Använder exponentiellt format med gemener om exponenten är mindre än -4 eller inte mindre än precision, annars decimalformat.

source: Floating-point format. Uses uppercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
pt_pt: Formato de ponto flutuante. Usa formato exponencial maiúsculo se o expoente for menor que -4 ou não for menor que a precisão, formato decimal caso contrário.
sv: Flyttalsformat. Använder exponentiellt format med versaler om exponenten är mindre än -4 eller inte mindre än precision, annars decimalformat.

source: Single character (accepts integer or single character string).
pt_pt: Caractere único (aceita inteiro ou *string* de caractere único).
sv: Enstaka tecken (accepterar heltal eller sträng med enstaka tecken).

source: String (converts any Python object using :func:`repr`).
pt_pt: *String* (converte qualquer objeto Python usando :func:`repr`).
sv: String (konverterar valfritt Python-objekt med :func:`repr`).

source: String (converts any Python object using :func:`str`).
pt_pt: *String* (converte qualquer objeto Python usando :func:`str`).
sv: String (konverterar valfritt Python-objekt med :func:`str`).

source: String (converts any Python object using :func:`ascii`).
pt_pt: *String* (converte qualquer objeto Python usando :func:`ascii`).
sv: String (konverterar valfritt Python-objekt med :func:`ascii`).

source: No argument is converted, results in a ``'%'`` character in the result.
pt_pt: Nenhum argumento é convertido, resulta num caractere ``'%'`` no resultado.
sv: Inget argument konverteras, vilket resulterar i ett ``'%'``-tecken i resultatet.

source: The alternate form causes a leading octal specifier (``'0o'``) to be inserted before the first digit.
pt_pt: A forma alternativa faz com que um especificador octal inicial (``'0o'``) seja inserido antes do primeiro dígito.
sv: Den alternativa formen innebär att en ledande oktalspecifikator (``'0o'``) infogas före den första siffran.

source: The alternate form causes a leading ``'0x'`` or ``'0X'`` (depending on whether the ``'x'`` or ``'X'`` format was used) to be inserted before the first digit.
pt_pt: A forma alternativa faz com que um ``'0x'`` ou ``'0X'`` inicial (dependendo de se o formato ``'x'`` ou ``'X'`` foi usado) seja inserido antes do primeiro dígito.
sv: Den alternativa formen gör att en inledande ``'0x'`` eller ``'0X'`` (beroende på om formatet ``'x'`` eller ``'X'`` användes) infogas före den första siffran.

source: The alternate form causes the result to always contain a decimal point, even if no digits follow it.
pt_pt: A forma alternativa faz com que o resultado contenha sempre um ponto decimal, mesmo que não haja dígitos a seguir.
sv: Den alternativa formen gör att resultatet alltid innehåller en decimalpunkt, även om inga siffror följer efter den.

source: The precision determines the number of digits after the decimal point and defaults to 6.
pt_pt: A precisão determina o número de dígitos após o ponto decimal e o valor predefinido é 6.
sv: Precisionen bestämmer antalet siffror efter decimaltecknet och är som standard 6.

source: The alternate form causes the result to always contain a decimal point, and trailing zeroes are not removed as they would otherwise be.
pt_pt: A forma alternativa faz com que o resultado contenha sempre um ponto decimal, e os zeros finais não são removidos como seriam de outra forma.
sv: Den alternativa formen gör att resultatet alltid innehåller en decimalpunkt och att efterföljande nollor inte tas bort som de annars skulle ha gjort.

source: The precision determines the number of significant digits before and after the decimal point and defaults to 6.
pt_pt: A precisão determina o número de dígitos significativos antes e depois do ponto decimal e o valor predefinido é 6.
sv: Precisionen bestämmer antalet signifikanta siffror före och efter decimaltecknet och är som standard 6.

source: If precision is ``N``, the output is truncated to ``N`` characters.
pt_pt: Se a precisão for ``N``, a saída é truncada para ``N`` caracteres.
sv: Om precision är ``N`` trunkeras utdata till ``N`` tecken.

source: See :pep:`237`.
pt_pt: Consulte :pep:`237`.
sv: Se :pep:`237`.

source: Since Python strings have an explicit length, ``%s`` conversions do not assume that ``'\0'`` is the end of the string.
pt_pt: Como as *strings* Python têm um comprimento explícito, as conversões ``%s`` não assumem que ``'\0'`` é o fim da *string*.
sv: Eftersom Python-strängar har en explicit längd, antar inte ``%s``-konverteringar att ``'\0'`` är slutet på strängen.

source: ``%f`` conversions for numbers whose absolute value is over 1e50 are no longer replaced by ``%g`` conversions.
pt_pt: As conversões ``%f`` para números cujo valor absoluto é superior a 1e50 já não são substituídas por conversões ``%g``.
sv: ``%f``-konverteringar för tal vars absoluta värde är över 1e50 ersätts inte längre av ``%g``-konverteringar.

source: Binary Sequence Types --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
pt_pt: Tipos de sequências binárias --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
sv: Binära sekvenstyper --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`

source: The core built-in types for manipulating binary data are :class:`bytes` and :class:`bytearray`. They are supported by :class:`memoryview` which uses the :ref:`buffer protocol <bufferobjects>` to access the memory of other binary objects without needing to make a copy.
pt_pt: Os tipos incorporados principais para manipular dados binários são :class:`bytes` e :class:`bytearray`. Estes são suportados por :class:`memoryview`, que usa o :ref:`protocolo de buffer <bufferobjects>` para aceder à memória de outros objetos binários sem necessidade de fazer uma cópia.
sv: De viktigaste inbyggda typerna för att manipulera binära data är :class:`bytes` och :class:`bytearray`. De stöds av :class:`memoryview` som använder :ref:`buffer protocol <bufferobjects>` för att komma åt minnet hos andra binära objekt utan att behöva göra en kopia.

source: The :mod:`array` module supports efficient storage of basic data types like 32-bit integers and IEEE754 double-precision floating values.
pt_pt: O módulo :mod:`array` suporta armazenamento eficiente de tipos de dados básicos, como inteiros de 32 bits e valores de ponto flutuante de dupla precisão IEEE754.
sv: Modulen :mod:`array` stöder effektiv lagring av grundläggande datatyper som 32-bitars heltal och flytande värden med dubbel precision enligt IEEE754.

source: Bytes Objects
pt_pt: Objetos bytes
sv: Bytes-objekt

source: Bytes objects are immutable sequences of single bytes. Since many major binary protocols are based on the ASCII text encoding, bytes objects offer several methods that are only valid when working with ASCII compatible data and are closely related to string objects in a variety of other ways.
pt_pt: Os objetos bytes são sequências imutáveis de bytes individuais. Uma vez que muitos protocolos binários principais são baseados na codificação de texto ASCII, os objetos bytes oferecem vários métodos que são válidos apenas ao trabalhar com dados compatíveis com ASCII e estão intimamente relacionados com objetos *string* de várias outras formas.
sv: Bytesobjekt är oföränderliga sekvenser av enstaka bytes. Eftersom många större binära protokoll baseras på ASCII-textkodningen erbjuder bytesobjekt flera metoder som endast är giltiga när man arbetar med ASCII-kompatibla data och är nära besläktade med strängobjekt på en mängd andra sätt.

source: Firstly, the syntax for bytes literals is largely the same as that for string literals, except that a ``b`` prefix is added:
pt_pt: Primeiramente, a sintaxe para literais bytes é em grande parte a mesma que para literais *string*, exceto que é adicionado um prefixo ``b``:
sv: För det första är syntaxen för bytes-litteraler i stort sett densamma som för sträng-litteraler, förutom att prefixet ``b`` läggs till:

source: Single quotes: ``b'still allows embedded "double" quotes'``
pt_pt: Aspas simples: ``b'still allows embedded "double" quotes'``
sv: Enkla citattecken: ``b'tillåter fortfarande inbäddade "dubbla" citationstecken'```

source: Double quotes: ``b"still allows embedded 'single' quotes"``
pt_pt: Aspas duplas: ``b"still allows embedded 'single' quotes"``
sv: Dubbla citattecken: ``b"tillåter fortfarande inbäddade 'enkla' citattecken"```

source: Triple quoted: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
pt_pt: Aspas triplas: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
sv: Tredubbla citat: ``b"''3 enkla citattecken'''``, ``b""'3 dubbla citattecken'""``

source: Only ASCII characters are permitted in bytes literals (regardless of the declared source code encoding). Any binary values over 127 must be entered into bytes literals using the appropriate escape sequence.
pt_pt: Apenas caracteres ASCII são permitidos em literais bytes (independentemente da codificação declarada do código-fonte). Quaisquer valores binários acima de 127 devem ser inseridos em literais bytes usando a sequência de escape apropriada.
sv: Endast ASCII-tecken är tillåtna i byteslitteraler (oavsett den deklarerade källkodskodningen). Alla binära värden över 127 måste anges i byteslitteraler med hjälp av lämplig escape-sekvens.

source: As with string literals, bytes literals may also use a ``r`` prefix to disable processing of escape sequences. See :ref:`strings` for more about the various forms of bytes literal, including supported escape sequences.
pt_pt: Tal como com literais *string*, literais bytes também podem usar um prefixo ``r`` para desativar o processamento de sequências de escape. Consulte :ref:`strings` para mais informações sobre as várias formas de literais bytes, incluindo sequências de escape suportadas.
sv: Precis som med stränglitteraler kan byteslitteraler också använda prefixet ``r`` för att inaktivera bearbetning av escape-sekvenser. Se :ref:`strings` för mer information om de olika formerna av bytes-litteraler, inklusive escape-sekvenser som stöds.

source: While bytes literals and representations are based on ASCII text, bytes objects actually behave like immutable sequences of integers, with each value in the sequence restricted such that ``0 <= x < 256`` (attempts to violate this restriction will trigger :exc:`ValueError`). This is done deliberately to emphasise that while many binary formats include ASCII based elements and can be usefully manipulated with some text-oriented algorithms, this is not generally the case for arbitrary binary data (blindly applying text processing algorithms to binary data formats that are not ASCII compatible will usually lead to data corruption).
pt_pt: Embora literais e representações bytes sejam baseadas em texto ASCII, os objetos bytes comportam-se na verdade como sequências imutáveis de inteiros, com cada valor na sequência restrito de modo que ``0 <= x < 256`` (tentativas de violar esta restrição irão desencadear :exc:`ValueError`). Isto é feito deliberadamente para enfatizar que, embora muitos formatos binários incluam elementos baseados em ASCII e possam ser manipulados de forma útil com alguns algoritmos orientados a texto, este não é geralmente o caso para dados binários arbitrários (aplicar cegamente algoritmos de processamento de texto a formatos de dados binários que não são compatíveis com ASCII geralmente levará à corrupção de dados).
sv: Medan bytes literaler och representationer är baserade på ASCII-text, beter sig bytes objekt faktiskt som oföränderliga sekvenser av heltal, med varje värde i sekvensen begränsat så att ``0 <= x < 256`` (försök att bryta mot denna begränsning kommer att utlösa :exc:`ValueError`). Detta görs avsiktligt för att betona att även om många binära format innehåller ASCII-baserade element och kan manipuleras med vissa textorienterade algoritmer, så är detta inte generellt fallet för godtyckliga binära data (att blint tillämpa textbehandlingsalgoritmer på binära dataformat som inte är ASCII-kompatibla leder vanligtvis till att data korrumperas).

source: In addition to the literal forms, bytes objects can be created in a number of other ways:
pt_pt: Além das formas literais, os objetos bytes podem ser criados de várias outras formas:
sv: Förutom de bokstavliga formerna kan bytesobjekt skapas på ett antal andra sätt:

source: A zero-filled bytes object of a specified length: ``bytes(10)``
pt_pt: Um objeto bytes preenchido com zeros de um comprimento especificado: ``bytes(10)``
sv: Ett nollfyllt bytesobjekt med en angiven längd: ``bytes(10)``

source: From an iterable of integers: ``bytes(range(20))``
pt_pt: A partir de um iterável de inteiros: ``bytes(range(20))``
sv: Från en iterabel av heltal: ``bytes(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytes(obj)``
pt_pt: Copiando dados binários existentes através do protocolo de buffer: ``bytes(obj)``
sv: Kopiering av befintliga binära data via buffertprotokollet: ``bytes(obj)```

source: Also see the :ref:`bytes <func-bytes>` built-in.
pt_pt: Consulte também a função incorporada :ref:`bytes <func-bytes>`....
sv: Se även den inbyggda :ref:`bytes <func-bytes>`.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytes type has an additional class method to read data in that format:
pt_pt: Uma vez que 2 dígitos hexadecimais correspondem precisamente a um único byte, números hexadecimais são um formato comumente usado para descrever dados binários. Consequentemente, o tipo bytes tem um método de classe adicional para ler dados nesse formato:
sv: Eftersom 2 hexadecimala siffror exakt motsvarar en enda byte är hexadecimala tal ett vanligt format för att beskriva binära data. Bytes-typen har därför en extra klassmetod för att läsa data i det formatet:

source: This :class:`bytes` class method returns a bytes object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
pt_pt: Este método de classe :class:`bytes` retorna um objeto bytes, decodificando o objeto *string* fornecido. A *string* deve conter dois dígitos hexadecimais por byte, com espaços em branco ASCII sendo ignorados.
sv: Denna klassmetod :class:`bytes` returnerar ett bytes-objekt som avkodar det givna strängobjektet. Strängen måste innehålla två hexadecimala siffror per byte, med ASCII-teckensnitt som ignoreras.

source: :meth:`bytes.fromhex` now skips all ASCII whitespace in the string, not just spaces.
pt_pt: :meth:`bytes.fromhex` agora ignora todos os espaços em branco ASCII na *string*, não apenas espaços.
sv: :meth:`bytes.fromhex` hoppar nu över alla ASCII-teckensnitt i strängen, inte bara mellanslag.

source: :meth:`bytes.fromhex` now accepts ASCII :class:`bytes` and :term:`bytes-like objects <bytes-like object>` as input.
sv: :meth:`bytes.fromhex` accepterar nu ASCII :class:`bytes` och :term:`bytesliknande objekt <bytes-like object>` som indata.

source: A reverse conversion function exists to transform a bytes object into its hexadecimal representation.
pt_pt: Existe uma função de conversão inversa para transformar um objeto bytes na sua representação hexadecimal.
sv: En omvänd konverteringsfunktion finns för att omvandla ett bytesobjekt till dess hexadecimala representation.
