Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Return a bytes or bytearray object which is the concatenation of the binary data sequences in *iterable*. A :exc:`TypeError` will be raised if there are any values in *iterable* that are not :term:`bytes-like objects <bytes-like object>`, including :class:`str` objects. The separator between elements is the contents of the bytes or bytearray object providing this method.
pt_pt: Retorna um objeto bytes ou bytearray que é a concatenação das sequências de dados binários em *iterable*. Uma exceção :exc:`TypeError` será lançada se houver valores em *iterable* que não sejam :term:`objetos semelhantes a bytes <bytes-like object>`, incluindo objetos :class:`str`. O separador entre elementos é o conteúdo do objeto bytes ou bytearray que fornece este método.
sv: Returnerar ett bytes- eller bytearray-objekt som är sammankopplingen av de binära datasekvenserna i *iterable*. Ett :exc:`TypeError` kommer att tas upp om det finns några värden i *iterable* som inte är :term:`bytesliknande objekt <bytes-like object>`, inklusive :class:`str`-objekt. Separatorn mellan elementen är innehållet i bytes- eller bytearray-objektet som tillhandahåller denna metod.

source: This static method returns a translation table usable for :meth:`bytes.translate` that will map each character in *from* into the character at the same position in *to*; *from* and *to* must both be :term:`bytes-like objects <bytes-like object>` and have the same length.
pt_pt: Este método estático retorna uma tabela de tradução utilizável para :meth:`bytes.translate` que mapeará cada caractere em *from* para o caractere na mesma posição em *to*; *from* e *to* devem ser ambos :term:`objetos semelhantes a bytes <bytes-like object>` e ter o mesmo comprimento.
sv: Denna statiska metod returnerar en översättningstabell användbar för :meth:`bytes.translate` som mappar varje tecken i *from* till tecknet på samma position i *to*; *from* och *to* måste båda vara :term:`bytes-like objects <bytes-like object>` och ha samma längd.

source: Split the sequence at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing a copy of the original sequence, followed by two empty bytes or bytearray objects.
pt_pt: Divide a sequência na primeira ocorrência de *sep* e retorna um 3-tuplo contendo a parte antes do separador, o separador em si ou a sua cópia bytearray, e a parte após o separador. Se o separador não for encontrado, retorna um 3-tuplo contendo uma cópia da sequência original, seguida por dois objetos bytes ou bytearray vazios.
sv: Dela sekvensen vid den första förekomsten av *sep* och returnera en 3-tupel som innehåller delen före separatorn, själva separatorn eller dess bytearray-kopia och delen efter separatorn. Om separatorn inte hittas returneras en 3-tupel som innehåller en kopia av den ursprungliga sekvensen, följt av två tomma bytes eller bytearray-objekt.

source: The separator to search for may be any :term:`bytes-like object`.
pt_pt: O separador a procurar pode ser qualquer :term:`objeto semelhante a bytes`.
sv: Separatorn att söka efter kan vara valfri :term:`bytesliknande objekt`.

source: Return a copy of the sequence with all occurrences of subsequence *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
pt_pt: Retorna uma cópia da sequência com todas as ocorrências da subsequência *old* substituídas por *new*. Se o argumento opcional *count* for fornecido, apenas as primeiras *count* ocorrências são substituídas.
sv: Returnerar en kopia av sekvensen med alla förekomster av undersekvensen *old* ersatta av *new*. Om det valfria argumentet *count* anges, ersätts endast de första *count* förekomsterna.

source: The subsequence to search for and its replacement may be any :term:`bytes-like object`.
pt_pt: A subsequência a procurar e a sua substituição podem ser qualquer :term:`objeto semelhante a bytes`.
sv: Den undersekvens som ska sökas och dess ersättning kan vara valfri :term:`bytesliknande objekt`.

source: Return the highest index in the sequence where the subsequence *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
pt_pt: Retorna o índice mais alto na sequência onde a subsequência *sub* é encontrada, de modo que *sub* esteja contida em ``s[start:end]``. Os argumentos opcionais *start* e *end* são interpretados como na notação de fatia. Retorna ``-1`` em caso de falha.
sv: Returnerar det högsta indexet i sekvensen där undersekvensen *sub* finns, så att *sub* ingår i ``s[start:end]``. De valfria argumenten *start* och *end* tolkas som i slice-notation. Returnerar ``-1`` om den misslyckas.

source: Like :meth:`~bytes.rfind` but raises :exc:`ValueError` when the subsequence *sub* is not found.
pt_pt: Semelhante a :meth:`~bytes.rfind`, mas lança :exc:`ValueError` quando a subsequência *sub* não for encontrada.
sv: Som :meth:`~bytes.rfind` men ger upphov till :exc:`ValueError` när undersekvensen *sub* inte hittas.

source: Split the sequence at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty bytes or bytearray objects, followed by a copy of the original sequence.
pt_pt: Divide a sequência na última ocorrência de *sep* e retorna um 3-tuplo contendo a parte antes do separador, o separador em si ou a sua cópia bytearray, e a parte após o separador. Se o separador não for encontrado, retorna um 3-tuplo contendo dois objetos bytes ou bytearray vazios, seguidos por uma cópia da sequência original.
sv: Dela sekvensen vid den sista förekomsten av *sep*, och returnera en 3-tupel som innehåller delen före separatorn, själva separatorn eller dess bytearray-kopia, och delen efter separatorn. Om separatorn inte hittas returneras en 3-tupel som innehåller två tomma bytes eller bytearray-objekt, följt av en kopia av den ursprungliga sekvensen.

source: Return ``True`` if the binary data starts with the specified *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
pt_pt: Retorna ``True`` se os dados binários começarem com o *prefix* especificado, caso contrário retorna ``False``. *prefix* também pode ser um tuplo de prefixos a procurar. Com *start* opcional, teste a partir dessa posição. Com *end* opcional, pare de comparar nessa posição.
sv: Returnerar ``True`` om de binära data börjar med det angivna *prefixet*, annars returneras ``False``. *prefix* kan också vara en tupel av prefix att leta efter. Med valfri *start* börjar testet vid den positionen. Med valfri *end*, sluta jämföra vid den positionen.

source: The prefix(es) to search for may be any :term:`bytes-like object`.
pt_pt: O(s) prefixo(s) a procurar pode(m) ser qualquer :term:`objeto semelhante a bytes`.
sv: Prefixet/prefixen att söka efter kan vara valfri :term:`bytesliknande objekt`.

source: Return a copy of the bytes or bytearray object where all bytes occurring in the optional argument *delete* are removed, and the remaining bytes have been mapped through the given translation table, which must be a bytes object of length 256.
pt_pt: Retorna uma cópia do objeto bytes ou bytearray onde todos os bytes que ocorrem no argumento opcional *delete* são removidos, e os bytes restantes foram mapeados através da tabela de tradução fornecida, que deve ser um objeto bytes de comprimento 256.
sv: Returnerar en kopia av bytes- eller bytearray-objektet där alla bytes som förekommer i det valfria argumentet *delete* har tagits bort, och de återstående bytesen har mappats genom den angivna översättningstabellen, som måste vara ett bytes-objekt med längden 256.

source: You can use the :func:`bytes.maketrans` method to create a translation table.
pt_pt: Pode usar o método :func:`bytes.maketrans` para criar uma tabela de tradução.
sv: Du kan använda metoden :func:`bytes.maketrans` för att skapa en översättningstabell.

source: Set the *table* argument to ``None`` for translations that only delete characters::
sv: Sätt argumentet *table* till ``None`` för översättningar som bara tar bort tecken::

source: >>> b'read this short text'.translate(None, b'aeiou') b'rd ths shrt txt'
sv: >>> b'läs denna korta text'.translate(None, b'aeiou') b'rd ths shrt txt'

source: *delete* is now supported as a keyword argument.
pt_pt: *delete* é agora suportado como argumento nomeado.
sv: *delete* stöds nu som ett nyckelordsargument.

source: The following methods on bytes and bytearray objects have default behaviours that assume the use of ASCII compatible binary formats, but can still be used with arbitrary binary data by passing appropriate arguments. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
pt_pt: Os seguintes métodos em objetos bytes e bytearray têm comportamentos predefinidos que assumem o uso de formatos binários compatíveis com ASCII, mas ainda podem ser usados com dados binários arbitrários, passando argumentos apropriados. Note que todos os métodos bytearray nesta secção *não* operam no local, e em vez disso produzem novos objetos.
sv: Följande metoder för bytes och bytearray-objekt har standardbeteenden som förutsätter användning av ASCII-kompatibla binära format, men kan ändå användas med godtyckliga binära data genom att lämpliga argument anges. Observera att alla bytearray-metoder i det här avsnittet *inte* fungerar på plats, utan istället producerar nya objekt.

source: Return a copy of the object centered in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
pt_pt: Retorna uma cópia do objeto centrado numa sequência de comprimento *width*. O preenchimento é feito usando o *fillbyte* especificado (o predefinido é um espaço ASCII). Para objetos :class:`bytes`, a sequência original é retornada se *width* for menor ou igual a ``len(s)``.
sv: Returnerar en kopia av objektet centrerat i en sekvens med längden *width*. Utfyllnad görs med hjälp av den angivna *fillbyte* (standard är ett ASCII-utrymme). För :class:`bytes`-objekt returneras originalsekvensen om *width* är mindre än eller lika med ``len(s)``.

source: Return a copy of the object left justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
pt_pt: Retorna uma cópia do objeto alinhado à esquerda numa sequência de comprimento *width*. O preenchimento é feito usando o *fillbyte* especificado (o predefinido é um espaço ASCII). Para objetos :class:`bytes`, a sequência original é retornada se *width* for menor ou igual a ``len(s)``.
sv: Returnerar en kopia av objektet vänsterjusterat i en sekvens med längden *bredd*. Utfyllnad görs med hjälp av den angivna *fillbyte* (standard är ett ASCII-utrymme). För :class:`bytes`-objekt returneras originalsekvensen om *width* är mindre än eller lika med ``len(s)``.

source: Return a copy of the sequence with specified leading bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
sv: Returnerar en kopia av sekvensen med angivna inledande byte borttagna. Argumentet *chars* är en binär sekvens som anger den uppsättning bytevärden som ska tas bort - namnet hänvisar till att denna metod vanligtvis används med ASCII-tecken. Om *chars*-argumentet utelämnas eller ``None``, tas ASCII-teckenspråk bort som standard. Argumentet *chars* är inte ett prefix, utan alla kombinationer av dess värden tas bort::

source: >>> b' spacious '.lstrip() b'spacious ' >>> b'www.example.com'.lstrip(b'cmowz.') b'example.com'
sv: >>> b' rymlig '.lstrip() b'rymlig ' >>> b'www.example.com'.lstrip(b'cmowz.') b'exempel.com'

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
pt_pt: A sequência binária de valores de bytes a remover pode ser qualquer :term:`objeto semelhante a bytes`. Consulte :meth:`~bytes.removeprefix` para um método que remove uma única *string* de prefixo em vez de todos os caracteres de um conjunto. Por exemplo:
sv: Den binära sekvensen av bytevärden som ska tas bort kan vara valfri :term:`bytesliknande objekt`. Se :meth:`~bytes.removeprefix` för en metod som tar bort en enda prefixsträng i stället för alla tecken i en uppsättning. Till exempel::

source: >>> b'Arthur: three!'.lstrip(b'Arthur: ') b'ee!' >>> b'Arthur: three!'.removeprefix(b'Arthur: ') b'three!'
sv: >>> b'Arthur: tre!'.lstrip(b'Arthur: ') b'ee!' >>> b'Arthur: tre!'.removeprefix(b'Arthur: ') b'tre!'

source: Return a copy of the object right justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
pt_pt: Retorna uma cópia do objeto alinhado à direita numa sequência de comprimento *width*. O preenchimento é feito usando o *fillbyte* especificado (o predefinido é um espaço ASCII). Para objetos :class:`bytes`, a sequência original é retornada se *width* for menor ou igual a ``len(s)``.
sv: Returnerar en kopia av objektet högerställd i en sekvens med längd *bredd*. Utfyllnad görs med hjälp av den angivna *fillbyte* (standard är ett ASCII-utrymme). För :class:`bytes`-objekt returneras originalsekvensen om *width* är mindre än eller lika med ``len(s)``.

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any subsequence consisting solely of ASCII whitespace is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
pt_pt: Divide a sequência binária em subsequências do mesmo tipo, usando *sep* como a *string* delimitadora. Se *maxsplit* for fornecido, no máximo *maxsplit* divisões são feitas, as mais à *direita*. Se *sep* não for especificado ou for ``None``, qualquer subsequência composta apenas por espaços em branco ASCII é um separador. Exceto pela divisão a partir da direita, :meth:`rsplit` comporta-se como :meth:`split`, que é descrita em detalhe abaixo.
sv: Dela upp den binära sekvensen i undersekvenser av samma typ, med *sep* som avgränsningssträng. Om *maxsplit* anges görs högst *maxsplit* uppdelningar, de *högst till höger*. Om *sep* inte specificeras eller om ``None``, är varje delsekvens som enbart består av ASCII-teckensnitt en separator. Förutom att dela upp från höger, beter sig :meth:`rsplit` som :meth:`split` som beskrivs i detalj nedan.

source: Return a copy of the sequence with specified trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
sv: Returnerar en kopia av sekvensen med angivna efterföljande byte borttagna. Argumentet *chars* är en binär sekvens som anger den uppsättning bytevärden som ska tas bort - namnet hänvisar till att denna metod vanligtvis används med ASCII-tecken. Om argumentet *chars* utelämnas eller ``None``, tas ASCII-teckensnitt bort som standard. Argumentet *chars* är inte ett suffix, utan alla kombinationer av dess värden tas bort::

source: >>> b' spacious '.rstrip() b' spacious' >>> b'mississippi'.rstrip(b'ipz') b'mississ'
sv: >>> b' rymlig '.rstrip() b' rymlig' >>> b'mississippi'.rstrip(b'ipz') b'mississ'

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
pt_pt: A sequência binária de valores de bytes a remover pode ser qualquer :term:`objeto semelhante a bytes`. Consulte :meth:`~bytes.removesuffix` para um método que remove uma única *string* de sufixo em vez de todos os caracteres de um conjunto. Por exemplo:
sv: Den binära sekvensen av bytevärden som ska tas bort kan vara valfritt :term:`bytesliknande objekt`. Se :meth:`~bytes.removesuffix` för en metod som tar bort en enda suffixsträng i stället för alla tecken i en uppsättning. Till exempel::

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given and non-negative, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or is ``-1``, then there is no limit on the number of splits (all possible splits are made).
pt_pt: Divide a sequência binária em subsequências do mesmo tipo, usando *sep* como a *string* delimitadora. Se *maxsplit* for fornecido e não negativo, no máximo *maxsplit* divisões são feitas (assim, a lista terá no máximo ``maxsplit+1`` elementos). Se *maxsplit* não for especificado ou for ``-1``, não há limite no número de divisões (todas as divisões possíveis são feitas).
sv: Dela upp den binära sekvensen i undersekvenser av samma typ, med *sep* som avgränsningssträng. Om *maxsplit* anges och är icke-negativ görs högst *maxsplit* uppdelningar (listan kommer alltså att ha högst ``maxsplit+1`` element). Om *maxsplit* inte anges eller är ``-1`` finns det ingen begränsning av antalet uppdelningar (alla möjliga uppdelningar görs).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty subsequences (for example, ``b'1,,2'.split(b',')`` returns ``[b'1', b'', b'2']``). The *sep* argument may consist of a multibyte sequence as a single delimiter. Splitting an empty sequence with a specified separator returns ``[b'']`` or ``[bytearray(b'')]`` depending on the type of object being split. The *sep* argument may be any :term:`bytes-like object`.
pt_pt: Se *sep* for fornecido, delimitadores consecutivos não são agrupados e são considerados como delimitadores de subsequências vazias (por exemplo, ``b'1,,2'.split(b',')`` retorna ``[b'1', b'', b'2']``). O argumento *sep* pode consistir numa sequência de vários bytes como um único delimitador. Dividir uma sequência vazia com um separador especificado retorna ``[b'']`` ou ``[bytearray(b'')]`` dependendo do tipo de objeto a ser dividido. O argumento *sep* pode ser qualquer :term:`objeto semelhante a bytes`.
sv: Om *sep* anges grupperas inte på varandra följande avgränsare och de anses avgränsa tomma undersekvenser (t.ex. ``b'1,,2'.split(b','')`` ger ``[b'1', b'', b'2']``). Argumentet *sep* kan bestå av en multibyte-sekvens som en enda avgränsare. Om en tom sekvens delas med en angiven separator returneras ``[b'']`` eller ``[bytearray(b'')]`` beroende på vilken typ av objekt som delas. Argumentet *sep* kan vara valfri :term:`bytesliknande objekt`.

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive ASCII whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the sequence has leading or trailing whitespace. Consequently, splitting an empty sequence or a sequence consisting solely of ASCII whitespace without a specified separator returns ``[]``.
pt_pt: Se *sep* não for especificado ou for ``None``, um algoritmo de divisão diferente é aplicado: sequências consecutivas de espaços em branco ASCII são consideradas como um único separador, e o resultado não conterá sequências vazias no início ou no fim se a sequência tiver espaços em branco iniciais ou finais. Consequentemente, dividir uma sequência vazia ou uma sequência composta apenas por espaços em branco ASCII sem um separador especificado retorna ``[]``.
sv: Om *sep* inte anges eller är ``None``, används en annan delningsalgoritm: sekvenser av på varandra följande ASCII-teckensnitt betraktas som en enda separator, och resultatet innehåller inga tomma strängar i början eller slutet om sekvensen har inledande eller avslutande teckensnitt. Följaktligen returneras ``[]`` när en tom sekvens eller en sekvens som endast består av ASCII-teckensnitt utan en angiven separator delas.

source: >>> b'1 2 3'.split() [b'1', b'2', b'3'] >>> b'1 2 3'.split(maxsplit=1) [b'1', b'2 3'] >>> b' 1 2 3 '.split() [b'1', b'2', b'3']
sv: >>> b'1 2 3'.split() [b'1', b'2', b'3'] >>> b'1 2 3'.split(maxsplit=1) [b'1', b'2 3'] >>> b' 1 2 3 '.split() [b'1', b'2', b'3'] >>> b' 1 2 3 '.split()

source: Return a copy of the sequence with specified leading and trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
sv: Returnerar en kopia av sekvensen med angivna inledande och avslutande byte borttagna. Argumentet *chars* är en binär sekvens som anger den uppsättning bytevärden som ska tas bort - namnet hänvisar till att denna metod vanligtvis används med ASCII-tecken. Om argumentet *chars* utelämnas eller ``None``, tas ASCII-teckensnitt bort som standard. Argumentet *chars* är inte ett prefix eller suffix, utan alla kombinationer av dess värden tas bort::

source: >>> b' spacious '.strip() b'spacious' >>> b'www.example.com'.strip(b'cmowz.') b'example'
sv: >>> b' rymlig '.strip() b'rymlig' >>> b'www.example.com'.strip(b'cmowz.') b'exempel'

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`.
pt_pt: A sequência binária de valores de bytes a remover pode ser qualquer :term:`objeto semelhante a bytes`.
sv: Den binära sekvensen av bytevärden som skall tas bort kan vara valfri :term:`bytesliknande objekt`.

source: The following methods on bytes and bytearray objects assume the use of ASCII compatible binary formats and should not be applied to arbitrary binary data. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
pt_pt: Os seguintes métodos em objetos bytes e bytearray assumem o uso de formatos binários compatíveis com ASCII e não devem ser aplicados a dados binários arbitrários. Note que todos os métodos bytearray nesta secção *não* operam no local, e em vez disso produzem novos objetos.
sv: Följande metoder för bytes och bytearray-objekt förutsätter användning av ASCII-kompatibla binära format och bör inte tillämpas på godtyckliga binära data. Observera att alla bytearray-metoder i detta avsnitt *inte* arbetar på plats, utan istället producerar nya objekt.
