Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Note, the non-operator versions of the :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, and :meth:`symmetric_difference_update` methods will accept any iterable as an argument.
sv: Observera att de icke-operatoriska versionerna av metoderna :meth:`update`, :meth:`intersection_update`, :meth:`difference_update` och :meth:`symmetric_difference_update` accepterar vilken iterabel som helst som argument.

source: Note, the *elem* argument to the :meth:`~object.__contains__`, :meth:`remove`, and :meth:`discard` methods may be a set. To support searching for an equivalent frozenset, a temporary one is created from *elem*.
sv: Observera att argumentet *elem* till metoderna :meth:`~object.__contains__`, :meth:`remove` och :meth:`discard` kan vara en uppsättning. För att underlätta sökningen efter en motsvarande frozenset skapas en tillfällig sådan från *elem*.

source: Mapping Types --- :class:`dict`
pt_pt: Tipos de mapeamento --- :class:`dict`
sv: Mappningstyper --- :class:`dict`

source: A :term:`mapping` object maps :term:`hashable` values to arbitrary objects. Mappings are mutable objects. There is currently only one standard mapping type, the :dfn:`dictionary`. (For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, and the :mod:`collections` module.)
pt_pt: Um objeto :term:`mapping` mapeia valores :term:`hashable` para objetos arbitrários. Os mapeamentos são objetos mutáveis. Atualmente, existe apenas um tipo de mapeamento padrão, o :dfn:`dicionário`. (Para outros contentores, consulte as classes incorporadas :class:`list`, :class:`set` e :class:`tuple`, e o módulo :mod:`collections`.)
sv: Ett :term:`mapping`-objekt mappar :term:`hashable`-värden till godtyckliga objekt. Mappningar är muterbara objekt. Det finns för närvarande bara en standardmappningstyp, :dfn:`dictionary`. (För andra behållare se de inbyggda klasserna :class:`list`, :class:`set` och :class:`tuple` samt modulen :mod:`collections`)

source: A dictionary's keys are *almost* arbitrary values. Values that are not :term:`hashable`, that is, values containing lists, dictionaries or other mutable types (that are compared by value rather than by object identity) may not be used as keys. Values that compare equal (such as ``1``, ``1.0``, and ``True``) can be used interchangeably to index the same dictionary entry.
pt_pt: As chaves de um dicionário são valores *quase* arbitrários. Valores que não são :term:`hashable`, ou seja, valores que contêm listas, dicionários ou outros tipos mutáveis (que são comparados por valor em vez de por identidade de objeto) não podem ser usados como chaves. Valores que são iguais na comparação (como ``1``, ``1.0`` e ``True``) podem ser usados indistintamente para indexar a mesma entrada do dicionário.
sv: En dictionaries nycklar är *nästan* godtyckliga värden. Värden som inte är :term:`hashable`, det vill säga värden som innehåller listor, dictionaries eller andra föränderliga typer (som jämförs med värde snarare än med objektidentitet) får inte användas som nycklar. Värden som jämför lika (t.ex. ``1``, ``1.0`` och ``True``) kan användas omväxlande för att indexera samma ordbokspost.

source: Return a new dictionary initialized from an optional positional argument and a possibly empty set of keyword arguments.
pt_pt: Retorna um novo dicionário inicializado a partir de um argumento posicional opcional e um conjunto possivelmente vazio de argumentos nomeados.
sv: Returnerar en ny ordbok som initierats från ett valfritt positionsargument och en eventuellt tom uppsättning nyckelordsargument.

source: Dictionaries can be created by several means:
pt_pt: Os dicionários podem ser criados de várias formas:
sv: Ordböcker kan skapas på flera olika sätt:

source: Use a comma-separated list of ``key: value`` pairs within braces: ``{'jack': 4098, 'sjoerd': 4127}`` or ``{4098: 'jack', 4127: 'sjoerd'}``
pt_pt: Use uma lista de pares ``key: value`` separados por vírgulas dentro de chavetas: ``{'jack': 4098, 'sjoerd': 4127}`` ou ``{4098: 'jack', 4127: 'sjoerd'}``
sv: Använd en kommaseparerad lista med ``nyckel: värde``-par inom hakparenteser: ``{'jack': 4098, 'sjoerd': 4127}`` eller ``{4098: 'jack', 4127: 'sjoerd'}``

source: Use a dict comprehension: ``{}``, ``{x: x ** 2 for x in range(10)}``
pt_pt: Use uma compreensão de dicionário: ``{}``, ``{x: x ** 2 for x in range(10)}``
sv: Använd en dict-förståelse: ``{}``, ``{x: x ** 2 for x in range(10)}``

source: Use the type constructor: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``
pt_pt: Use o construtor de tipo: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``
sv: Använd typkonstruktören: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``

source: If no positional argument is given, an empty dictionary is created. If a positional argument is given and it defines a ``keys()`` method, a dictionary is created by calling :meth:`~object.__getitem__` on the argument with each returned key from the method. Otherwise, the positional argument must be an :term:`iterable` object. Each item in the iterable must itself be an iterable with exactly two elements. The first element of each item becomes a key in the new dictionary, and the second element the corresponding value. If a key occurs more than once, the last value for that key becomes the corresponding value in the new dictionary.
pt_pt: Se nenhum argumento posicional for fornecido, um dicionário vazio é criado. Se um argumento posicional for fornecido e definir um método ``keys()``, um dicionário é criado chamando :meth:`~object.__getitem__` no argumento com cada chave retornada do método. Caso contrário, o argumento posicional deve ser um objeto :term:`iterável`. Cada item no iterável deve ser ele próprio um iterável com exatamente dois elementos. O primeiro elemento de cada item torna-se uma chave no novo dicionário, e o segundo elemento torna-se o valor correspondente. Se uma chave ocorrer mais do que uma vez, o último valor para essa chave torna-se o valor correspondente no novo dicionário.
sv: Om inget positionsargument anges skapas en tom ordbok. Om ett positionsargument anges och det definierar en ``keys()``-metod, skapas en ordbok genom att anropa :meth:`~object.__getitem__` på argumentet med varje nyckel som returneras från metoden. Annars måste det positionella argumentet vara ett :term:`iterable`-objekt. Varje objekt i iterabeln måste själv vara en iterabel med exakt två element. Det första elementet i varje objekt blir en nyckel i den nya ordboken och det andra elementet blir motsvarande värde. Om en nyckel förekommer mer än en gång blir det sista värdet för den nyckeln motsvarande värde i den nya ordboken.

source: If keyword arguments are given, the keyword arguments and their values are added to the dictionary created from the positional argument. If a key being added is already present, the value from the keyword argument replaces the value from the positional argument.
pt_pt: Se argumentos nomeados forem fornecidos, os argumentos nomeados e os seus valores são adicionados ao dicionário criado a partir do argumento posicional. Se uma chave a ser adicionada já estiver presente, o valor do argumento nomeado substitui o valor do argumento posicional.
sv: Om nyckelordsargument anges läggs nyckelordsargumenten och deras värden till i den ordbok som skapats utifrån positionsargumentet. Om en nyckel som läggs till redan finns, ersätter värdet från nyckelordsargumentet värdet från positionsargumentet.

source: Providing keyword arguments as in the first example only works for keys that are valid Python identifiers. Otherwise, any valid keys can be used.
pt_pt: Fornecer argumentos nomeados como no primeiro exemplo só funciona para chaves que são identificadores Python válidos. Caso contrário, quaisquer chaves válidas podem ser usadas.
sv: Att ange nyckelordsargument som i det första exemplet fungerar bara för nycklar som är giltiga Python-identifierare. Annars kan alla giltiga nycklar användas.

source: Dictionaries compare equal if and only if they have the same ``(key, value)`` pairs (regardless of ordering). Order comparisons ('<', '<=', '>=', '>') raise :exc:`TypeError`. To illustrate dictionary creation and equality, the following examples all return a dictionary equal to ``{"one": 1, "two": 2, "three": 3}``::
pt_pt: Os dicionários são iguais se e somente se tiverem os mesmos pares ``(key, value)`` (independentemente da ordem). Comparações de ordem ('<', '<=', '>=', ' >') lançam :exc:`TypeError`. Para ilustrar a criação e igualdade de dicionários, os seguintes exemplos retornam todos um dicionário igual a ``{"one": 1, "two": 2, "three": 3}``:
sv: Dictionaries jämförs lika om och endast om de har samma ``(nyckel, värde)``-par (oavsett ordning). Orderjämförelser ('<', '<=', '>=', '>') ger upphov till :exc:`TypeError`. För att illustrera skapande av ordlistor och likhet returnerar följande exempel alla en ordlista som är lika med ``{"one": 1, "two": 2, "three": 3}``::

source: >>> a = dict(one=1, two=2, three=3) >>> b = {'one': 1, 'two': 2, 'three': 3} >>> c = dict(zip(['one', 'two', 'three'], [1, 2, 3])) >>> d = dict([('two', 2), ('one', 1), ('three', 3)]) >>> e = dict({'three': 3, 'one': 1, 'two': 2}) >>> f = dict({'one': 1, 'three': 3}, two=2) >>> a == b == c == d == e == f True
sv: >>> a = dict(ett=1, två=2, tre=3) >>> b = {'ett': 1, 'två': 2, 'tre': 3} >>> c = dict(zip(['ett', 'två', 'tre'], [1, 2, 3])) >>> d = dict([('two', 2), ('one', 1), ('three', 3)]) >>> e = dict({'tre': 3, 'ett': 1, 'två': 2}) >>> f = dict({'ett': 1, 'tre': 3}, två=2) >>> a == b == c == d == e == f Sant

source: Dictionaries preserve insertion order. Note that updating a key does not affect the order. Keys added after deletion are inserted at the end. ::
pt_pt: Os dicionários preservam a ordem de inserção. Note que atualizar uma chave não afeta a ordem. Chaves adicionadas após a eliminação são inseridas no fim:
sv: Ordböcker bevarar inmatningsordningen. Observera att uppdatering av en nyckel inte påverkar ordningen. Nycklar som läggs till efter radering infogas i slutet. ::

source: >>> d = {"one": 1, "two": 2, "three": 3, "four": 4} >>> d {'one': 1, 'two': 2, 'three': 3, 'four': 4} >>> list(d) ['one', 'two', 'three', 'four'] >>> list(d.values()) [1, 2, 3, 4] >>> d["one"] = 42 >>> d {'one': 42, 'two': 2, 'three': 3, 'four': 4} >>> del d["two"] >>> d["two"] = None >>> d {'one': 42, 'three': 3, 'four': 4, 'two': None}
sv: >>> d = {"ett": 1, "två": 2, "tre": 3, "fyra": 4} >>> d {"ett": 1, "två": 2, "tre": 3, 'four': 4} >>> list(d) ['ett', 'två', 'tre', 'fyra'] >>> list(d.värden()) [1, 2, 3, 4] >>> d["ett"] = 42 >>> d {"ett": 42, "två": 2, "tre": 3, 'fyra': 4} >>> del d["två"] >>> d["två"] = Ingen >>> d {"ett": 42, "tre": 3, 'fyra': 4, 'two': None}

source: Dictionary order is guaranteed to be insertion order. This behavior was an implementation detail of CPython from 3.6.
pt_pt: A ordem do dicionário é garantida como sendo a ordem de inserção. Este comportamento era um detalhe de implementação do CPython desde a versão 3.6.
sv: Ordningsföljden i ordboken är garanterad att vara insättningsordning. Detta beteende var en implementationsdetalj i CPython från 3.6.

source: These are the operations that dictionaries support (and therefore, custom mapping types should support too):
pt_pt: Estas são as operações que os dicionários suportam (e, portanto, os tipos de mapeamento personalizados também devem suportar):
sv: Det här är de operationer som ordböcker stöder (och därför bör anpassade mappningstyper också stödja):

source: Return a list of all the keys used in the dictionary *d*.
pt_pt: Retorna uma lista de todas as chaves usadas no dicionário *d*.
sv: Returnerar en lista med alla nycklar som används i ordlistan *d*.

source: Return the number of items in the dictionary *d*.
pt_pt: Retorna o número de itens no dicionário *d*.
sv: Returnerar antalet objekt i ordlistan *d*.

source: Return the item of *d* with key *key*. Raises a :exc:`KeyError` if *key* is not in the map.
pt_pt: Retorna o item de *d* com a chave *key*. Lança uma exceção :exc:`KeyError` se *key* não estiver no mapeamento.
sv: Returnerar objektet i *d* med nyckel *key*. Utlöser ett :exc:`KeyError` om *nyckel* inte finns i kartan.

source: If a subclass of dict defines a method :meth:`__missing__` and *key* is not present, the ``d[key]`` operation calls that method with the key *key* as argument. The ``d[key]`` operation then returns or raises whatever is returned or raised by the ``__missing__(key)`` call. No other operations or methods invoke :meth:`__missing__`. If :meth:`__missing__` is not defined, :exc:`KeyError` is raised. :meth:`__missing__` must be a method; it cannot be an instance variable::
sv: Om en subklass av dict definierar en metod :meth:`__missing__` och *key* inte finns, anropar operationen ``d[key]`` den metoden med nyckeln *key* som argument. Operationen ``d[key]`` returnerar eller väcker sedan det som returneras eller väcks av anropet ``__missing__(key)``. Inga andra operationer eller metoder anropar :meth:`__missing__`. Om :meth:`__missing__` inte är definierad, uppstår :exc:`KeyError`. :meth:`__missing__` måste vara en metod; den kan inte vara en instansvariabel::

source: >>> class Counter(dict): ... def __missing__(self, key): ... return 0 ... >>> c = Counter() >>> c['red'] 0 >>> c['red'] += 1 >>> c['red'] 1
sv: >>> klass Counter(dict): ... def __missing__(self, key): ... return 0 ... >>> c = Räknare() >>> c['röd'] 0 >>> c['röd'] += 1 >>> c['röd'] 1

source: The example above shows part of the implementation of :class:`collections.Counter`. A different ``__missing__`` method is used by :class:`collections.defaultdict`.
sv: Exemplet ovan visar en del av implementationen av :class:`collections.Counter`. En annan ``__missing__`` metod används av :class:`collections.defaultdict`.

source: Set ``d[key]`` to *value*.
pt_pt: Define ``d[key]`` para *value*.
sv: Sätt ``d[key]`` till *värde*.

source: Remove ``d[key]`` from *d*. Raises a :exc:`KeyError` if *key* is not in the map.
pt_pt: Remove ``d[key]`` de *d*. Lança uma exceção :exc:`KeyError` se *key* não estiver no mapeamento.
sv: Tar bort ``d[nyckel]`` från *d*. Utlöser ett :exc:`KeyError` om *key* inte finns i kartan.

source: Return ``True`` if *d* has a key *key*, else ``False``.
pt_pt: Retorna ``True`` se *d* tiver uma chave *key*, caso contrário ``False``.
sv: Returnerar ``True`` om *d* har en nyckel *key*, annars ``False``.

source: Equivalent to ``not key in d``.
pt_pt: Equivalente a ``not key in d``.
sv: Motsvarar ``inte nyckel i d``.

source: Return an iterator over the keys of the dictionary. This is a shortcut for ``iter(d.keys())``.
pt_pt: Retorna um iterador sobre as chaves do dicionário. Isto é um atalho para ``iter(d.keys())``.
sv: Returnerar en iterator över nycklarna i ordlistan. Detta är en genväg till ``iter(d.keys())``.

source: Remove all items from the dictionary.
pt_pt: Remove todos os itens do dicionário.
sv: Ta bort alla objekt från ordlistan.

source: Return a shallow copy of the dictionary.
pt_pt: Retorna uma cópia superficial do dicionário.
sv: Returnerar en ytlig kopia av ordlistan.

source: Create a new dictionary with keys from *iterable* and values set to *value*.
pt_pt: Cria um novo dicionário com chaves de *iterable* e valores definidos para *value*.
sv: Skapa en ny ordbok med nycklar från *iterable* och värden satta till *value*.

source: :meth:`fromkeys` is a class method that returns a new dictionary. *value* defaults to ``None``. All of the values refer to just a single instance, so it generally doesn't make sense for *value* to be a mutable object such as an empty list. To get distinct values, use a :ref:`dict comprehension <dict>` instead.
pt_pt: :meth:`fromkeys` é um método de classe que retorna um novo dicionário. *value* é ``None`` por predefinição. Todos os valores referem-se a apenas uma única instância, por isso geralmente não faz sentido que *value* seja um objeto mutável como uma lista vazia. Para obter valores distintos, use uma :ref:`compreensão de dicionário <dict>`.
sv: :meth:`fromkeys` är en klassmetod som returnerar en ny ordbok. *value* är som standard ``None``. Alla värden hänvisar bara till en enda instans, så det är i allmänhet inte meningsfullt att *värde* är ett föränderligt objekt, t.ex. en tom lista. För att få distinkta värden, använd en :ref:`dict comprehension <dict>` istället.

source: Return the value for *key* if *key* is in the dictionary, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
pt_pt: Retorna o valor para *key* se *key* estiver no dicionário, caso contrário *default*. Se *default* não for fornecido, é ``None`` por predefinição, por isso este método nunca lança uma exceção :exc:`KeyError`.
sv: Returnerar värdet för *key* om *key* finns i ordlistan, annars *default*. Om *default* inte anges är standardvärdet ``None``, så att den här metoden aldrig ger upphov till ett :exc:`KeyError`.

source: Return a new view of the dictionary's items (``(key, value)`` pairs). See the :ref:`documentation of view objects <dict-views>`.
pt_pt: Retorna uma nova vista dos itens do dicionário (pares ``(key, value)``). Consulte a :ref:`documentação dos objetos de vista <dict-views>`.
sv: Returnerar en ny vy av ordbokens objekt (``(nyckel, värde)``-par). Se :ref:`dokumentation av view-objekt <dict-views>`.

source: Return a new view of the dictionary's keys. See the :ref:`documentation of view objects <dict-views>`.
pt_pt: Retorna uma nova vista das chaves do dicionário. Consulte a :ref:`documentação dos objetos de vista <dict-views>`.
sv: Returnerar en ny vy av nycklarna i ordlistan. Se :ref:`dokumentation av view-objekt <dict-views>`.

source: If *key* is in the dictionary, remove it and return its value, else return *default*. If *default* is not given and *key* is not in the dictionary, a :exc:`KeyError` is raised.
pt_pt: Se *key* estiver no dicionário, remove-o e retorna o seu valor, caso contrário retorna *default*. Se *default* não for fornecido e *key* não estiver no dicionário, é lançada uma exceção :exc:`KeyError`.
sv: Om *key* finns i ordlistan, ta bort den och returnera dess värde, annars returneras *default*. Om *default* inte anges och *key* inte finns i ordlistan, uppstår ett :exc:`KeyError`.

source: Remove and return a ``(key, value)`` pair from the dictionary. Pairs are returned in :abbr:`LIFO (last-in, first-out)` order.
pt_pt: Remove e retorna um par ``(key, value)`` do dicionário. Os pares são retornados por ordem :abbr:`LIFO (último a entrar, primeiro a sair)`.
sv: Tar bort och returnerar ett ``(nyckel, värde)``-par från ordlistan. Paren returneras i :abbr:`LIFO (sist in, först ut)`-ordning.

source: :meth:`popitem` is useful to destructively iterate over a dictionary, as often used in set algorithms. If the dictionary is empty, calling :meth:`popitem` raises a :exc:`KeyError`.
pt_pt: :meth:`popitem` é útil para iterar de forma destrutiva sobre um dicionário, como é frequentemente usado em algoritmos de conjuntos. Se o dicionário estiver vazio, chamar :meth:`popitem` lança uma exceção :exc:`KeyError`.
sv: :meth:`popitem` är användbart för att destruktivt iterera över en ordbok, vilket ofta används i set-algoritmer. Om ordlistan är tom ger anrop av :meth:`popitem` upphov till ett :exc:`KeyError`.

source: LIFO order is now guaranteed. In prior versions, :meth:`popitem` would return an arbitrary key/value pair.
pt_pt: A ordem LIFO é agora garantida. Em versões anteriores, :meth:`popitem` retornava um par chave/valor arbitrário.
sv: LIFO-ordning är nu garanterad. I tidigare versioner kunde :meth:`popitem` returnera ett godtyckligt nyckel/värde-par.

source: Return a reverse iterator over the keys of the dictionary. This is a shortcut for ``reversed(d.keys())``.
pt_pt: Retorna um iterador reverso sobre as chaves do dicionário. Isto é um atalho para ``reversed(d.keys())``.
sv: Returnerar en omvänd iterator över nycklarna i ordlistan. Detta är en genväg till ``reversed(d.keys())``.

source: If *key* is in the dictionary, return its value. If not, insert *key* with a value of *default* and return *default*. *default* defaults to ``None``.
pt_pt: Se *key* estiver no dicionário, retorna o seu valor. Se não, insere *key* com um valor de *default* e retorna *default*. *default* é ``None`` por predefinição.
sv: Om *key* finns i ordlistan returneras dess värde. Om inte, infoga *key* med ett värde av *default* och returnera *default*. *default* är som standard ``None``.

source: Update the dictionary with the key/value pairs from *other*, overwriting existing keys. Return ``None``.
sv: Uppdaterar ordlistan med nyckel/värde-paren från *other* och skriver över befintliga nycklar. Returnerar ``None``.

source: :meth:`update` accepts either another object with a ``keys()`` method (in which case :meth:`~object.__getitem__` is called with every key returned from the method) or an iterable of key/value pairs (as tuples or other iterables of length two). If keyword arguments are specified, the dictionary is then updated with those key/value pairs: ``d.update(red=1, blue=2)``.
pt_pt: :meth:`update` aceita outro objeto com um método ``keys()`` (caso em que :meth:`~object.__getitem__` é chamado com cada chave retornada do método) ou um iterável de pares chave/valor (como tuplos ou outros iteráveis de comprimento dois). Se argumentos nomeados forem especificados, o dicionário é então atualizado com esses pares chave/valor: ``d.update(red=1, blue=2)``.
sv: :meth:`update` accepterar antingen ett annat objekt med en ``keys()``-metod (i vilket fall :meth:`~object.__getitem__` anropas med varje nyckel som returneras från metoden) eller en iterabel med nyckel/värde-par (som tupler eller andra iterabler av längd två). Om nyckelordsargument anges uppdateras sedan ordlistan med dessa nyckel/värde-par: ``d.update(red=1, blue=2)``.

source: Return a new view of the dictionary's values. See the :ref:`documentation of view objects <dict-views>`.
pt_pt: Retorna uma nova vista dos valores do dicionário. Consulte a :ref:`documentação dos objetos de vista <dict-views>`.
sv: Returnerar en ny vy av ordbokens värden. Se :ref:`dokumentation av view-objekt <dict-views>`.

source: An equality comparison between one ``dict.values()`` view and another will always return ``False``. This also applies when comparing ``dict.values()`` to itself::
pt_pt: Uma comparação de igualdade entre uma vista ``dict.values()`` e outra sempre retornará ``False``. Isto também se aplica ao comparar ``dict.values()`` consigo próprio:
sv: En jämlikhetsjämförelse mellan en ``dict.values()`` vy och en annan kommer alltid att returnera ``False``. Detta gäller även när man jämför ``dict.values()`` med sig själv::

source: >>> d = {'a': 1} >>> d.values() == d.values() False
sv: >>> d = {'a': 1} >>> d.värden() == d.värden() Falskt

source: Create a new dictionary with the merged keys and values of *d* and *other*, which must both be dictionaries. The values of *other* take priority when *d* and *other* share keys.
pt_pt: Cria um novo dicionário com as chaves e valores fundidos de *d* e *other*, que devem ser ambos dicionários. Os valores de *other* têm prioridade quando *d* e *other* partilham chaves.
sv: Skapa en ny ordbok med de sammanslagna nycklarna och värdena i *d* och *other*, som båda måste vara ordböcker. Värdena i *other* prioriteras när *d* och *other* delar nycklar.
