Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: >>> b = bytearray(b'xyz') >>> m = memoryview(b) >>> m.obj is b True
sv: >>> b = bytearray(b'xyz') >>> m = minnesvy(b) >>> m.obj är b Sant

source: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. This is the amount of space in bytes that the array would use in a contiguous representation. It is not necessarily equal to ``len(m)``::
pt_pt: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. Esta é a quantidade de espaço em bytes que o array usaria numa representação contígua. Não é necessariamente igual a ``len(m)``:
sv: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. Detta är den mängd utrymme i bytes som matrisen skulle använda i en sammanhängande representation. Det är inte nödvändigtvis lika med ``len(m)``::

source: >>> import array >>> a = array.array('i', [1,2,3,4,5]) >>> m = memoryview(a) >>> len(m) 5 >>> m.nbytes 20 >>> y = m[::2] >>> len(y) 3 >>> y.nbytes 12 >>> len(y.tobytes()) 12
sv: >>> importera array >>> a = array.array('i', [1,2,3,4,5]) >>> m = minnesvy(a) >>> len(m) 5 >>> m.nbytes 20 >>> y = m[::2] >>> len(y) 3 >>> y.nbytes 12 >>> len(y.tobytes()) 12

source: Multi-dimensional arrays::
pt_pt: Arrays multidimensionais:
sv: Flerdimensionella matriser::

source: >>> import struct >>> buf = struct.pack("d"*12, *[1.5*x for x in range(12)]) >>> x = memoryview(buf) >>> y = x.cast('d', shape=[3,4]) >>> y.tolist() [[0.0, 1.5, 3.0, 4.5], [6.0, 7.5, 9.0, 10.5], [12.0, 13.5, 15.0, 16.5]] >>> len(y) 3 >>> y.nbytes 96
sv: >>> import struct >>> buf = struct.pack("d"*12, *[1,5*x för x i intervall(12)]) >>> x = minnesvy(buf) >>> y = x.cast('d', shape=[3,4]) >>> y.tolist() [[0.0, 1.5, 3.0, 4.5], [6.0, 7.5, 9.0, 10.5], [12.0, 13.5, 15.0, 16.5]] >>> len(y) 3 >>> y.nbytes 96

source: A bool indicating whether the memory is read only.
pt_pt: Um booleano que indica se a memória é apenas de leitura.
sv: En bool som anger om minnet är skrivskyddat.

source: A string containing the format (in :mod:`struct` module style) for each element in the view. A memoryview can be created from exporters with arbitrary format strings, but some methods (e.g. :meth:`tolist`) are restricted to native single element formats.
pt_pt: Uma *string* contendo o formato (no estilo do módulo :mod:`struct`) para cada elemento na vista. Uma memoryview pode ser criada a partir de exportadores com *strings* de formato arbitrárias, mas alguns métodos (por exemplo, :meth:`tolist`) estão restritos a formatos de elemento único nativos.
sv: En sträng som innehåller formatet (i :mod:`struct`-modulstil) för varje element i vyn. En minnesvy kan skapas från exportörer med godtyckliga formatsträngar, men vissa metoder (t.ex. :meth:`tolist`) är begränsade till ursprungliga format för enstaka element.

source: format ``'B'`` is now handled according to the struct module syntax. This means that ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
pt_pt: O formato ``'B'`` é agora tratado de acordo com a sintaxe do módulo struct. Isto significa que ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
sv: formatet ``'B'`` hanteras nu enligt struct-modulens syntax. Detta innebär att ``memoryview(b'abc')[0] == b'abc'[0] == 97``.

source: The size in bytes of each element of the memoryview::
pt_pt: O tamanho em bytes de cada elemento da memoryview:
sv: Storleken i bytes för varje element i minnesvyn::

source: >>> import array, struct >>> m = memoryview(array.array('H', [32000, 32001, 32002])) >>> m.itemsize 2 >>> m[0] 32000 >>> struct.calcsize('H') == m.itemsize True
sv: >>> import matris, struktur >>> m = memoryview(array.array('H', [32000, 32001, 32002])) >>> m.itemsize 2 >>> m[0] 32000 >>> struct.calcsize('H') == m.itemsize Sant

source: An integer indicating how many dimensions of a multi-dimensional array the memory represents.
pt_pt: Um inteiro que indica quantas dimensões de um array multidimensional a memória representa.
sv: Ett heltal som anger hur många dimensioner av en flerdimensionell array som minnet representerar.

source: A tuple of integers the length of :attr:`ndim` giving the shape of the memory as an N-dimensional array.
pt_pt: Um tuplo de inteiros com o comprimento de :attr:`ndim` que dá a forma da memória como um array N-dimensional.
sv: En tupel av heltal med längden :attr:`ndim` som ger formen på minnet som en N-dimensionell array.

source: An empty tuple instead of ``None`` when ndim = 0.
pt_pt: Um tuplo vazio em vez de ``None`` quando ndim = 0.
sv: En tom tupel i stället för ``None`` när ndim = 0.

source: A tuple of integers the length of :attr:`ndim` giving the size in bytes to access each element for each dimension of the array.
pt_pt: Um tuplo de inteiros com o comprimento de :attr:`ndim` que dá o tamanho em bytes para aceder a cada elemento de cada dimensão do array.
sv: En tupel av heltal med längden :attr:`ndim` som anger storleken i bytes för att komma åt varje element för varje dimension i matrisen.

source: Used internally for PIL-style arrays. The value is informational only.
pt_pt: Usado internamente para arrays no estilo PIL. O valor é apenas informativo.
sv: Används internt för matriser av PIL-typ. Värdet är endast informativt.

source: A bool indicating whether the memory is C-:term:`contiguous`.
pt_pt: Um booleano que indica se a memória é :term:`contígua` em C.
sv: En bool som anger om minnet är C-:term:`contiguous`.

source: A bool indicating whether the memory is Fortran :term:`contiguous`.
pt_pt: Um booleano que indica se a memória é :term:`contígua` em Fortran.
sv: En bool som anger om minnet är Fortran :term:`contiguous`.

source: A bool indicating whether the memory is :term:`contiguous`.
pt_pt: Um booleano que indica se a memória é :term:`contígua`.
sv: En bool som anger om minnet är :term:`sammenhängande`.

source: Set Types --- :class:`set`, :class:`frozenset`
pt_pt: Tipos de conjuntos --- :class:`set`, :class:`frozenset`
sv: Set-typer --- :class:`set`, :class:`frozenset`

source: A :dfn:`set` object is an unordered collection of distinct :term:`hashable` objects. Common uses include membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference. (For other containers see the built-in :class:`dict`, :class:`list`, and :class:`tuple` classes, and the :mod:`collections` module.)
pt_pt: Um objeto :dfn:`set` é uma coleção não ordenada de objetos distintos :term:`hashable`. Usos comuns incluem teste de pertença, remoção de duplicados de uma sequência e cálculo de operações matemáticas como interseção, união, diferença e diferença simétrica. (Para outros contentores, consulte as classes incorporadas :class:`dict`, :class:`list` e :class:`tuple`, e o módulo :mod:`collections`.)
sv: Ett :dfn:`set`-objekt är en oordnad samling av distinkta :term:`hashable`-objekt. Vanliga användningsområden är medlemskapstestning, borttagning av dubbletter från en sekvens och beräkning av matematiska operationer som intersektion, union, differens och symmetrisk differens. (För andra behållare se de inbyggda klasserna :class:`dict`, :class:`list` och :class:`tuple` samt modulen :mod:`collections`)

source: Like other collections, sets support ``x in set``, ``len(set)``, and ``for x in set``. Being an unordered collection, sets do not record element position or order of insertion. Accordingly, sets do not support indexing, slicing, or other sequence-like behavior.
pt_pt: Tal como outras coleções, os conjuntos suportam ``x in set``, ``len(set)`` e ``for x in set``. Sendo uma coleção não ordenada, os conjuntos não registam a posição dos elementos ou a ordem de inserção. Consequentemente, os conjuntos não suportam indexação, fatiamento ou outro comportamento semelhante a sequências.
sv: Liksom andra samlingar stöder set ``x in set``, ``len(set)`` och ``for x in set``. Eftersom set är en oordnad samling registreras inte elementens position eller inmatningsordning. Följaktligen stöder inte set indexering, skivning eller annat sekvensliknande beteende.

source: There are currently two built-in set types, :class:`set` and :class:`frozenset`. The :class:`set` type is mutable --- the contents can be changed using methods like :meth:`~set.add` and :meth:`~set.remove`. Since it is mutable, it has no hash value and cannot be used as either a dictionary key or as an element of another set. The :class:`frozenset` type is immutable and :term:`hashable` --- its contents cannot be altered after it is created; it can therefore be used as a dictionary key or as an element of another set.
pt_pt: Atualmente, existem dois tipos de conjuntos incorporados, :class:`set` e :class:`frozenset`. O tipo :class:`set` é mutável --- o conteúdo pode ser alterado usando métodos como :meth:`~set.add` e :meth:`~set.remove`. Uma vez que é mutável, não tem valor de hash e não pode ser usado como chave de dicionário ou como elemento de outro conjunto. O tipo :class:`frozenset` é imutável e :term:`hashable` --- o seu conteúdo não pode ser alterado após a sua criação; pode, portanto, ser usado como chave de dicionário ou como elemento de outro conjunto.
sv: Det finns för närvarande två inbyggda set-typer, :class:`set` och :class:`frozenset`. Typen :class:`set` är mutabel --- innehållet kan ändras med hjälp av metoder som :meth:`~set.add` och :meth:`~set.remove`. Eftersom den är föränderlig har den inget hashvärde och kan inte användas som vare sig nyckel i en ordbok eller som element i en annan uppsättning. Typen :class:`frozenset` är oföränderlig och :term:`hashable` --- dess innehåll kan inte ändras efter att den skapats; den kan därför användas som en ordboksnyckel eller som ett element i en annan uppsättning.

source: Non-empty sets (not frozensets) can be created by placing a comma-separated list of elements within braces, for example: ``{'jack', 'sjoerd'}``, in addition to the :class:`set` constructor.
pt_pt: Conjuntos não vazios (não frozensets) podem ser criados colocando uma lista de elementos separados por vírgulas dentro de chavetas, por exemplo: ``{'jack', 'sjoerd'}``, além do construtor :class:`set`.
sv: Icke-tomma mängder (inte frozensets) kan skapas genom att placera en kommaseparerad lista med element inom hakparenteser, till exempel: ``{'jack', 'sjoerd'}``, utöver konstruktören :class:`set`.

source: The constructors for both classes work the same:
pt_pt: Os construtores para ambas as classes funcionam da mesma forma:
sv: Konstruktörerna för båda klasserna fungerar på samma sätt:

source: Return a new set or frozenset object whose elements are taken from *iterable*. The elements of a set must be :term:`hashable`. To represent sets of sets, the inner sets must be :class:`frozenset` objects. If *iterable* is not specified, a new empty set is returned.
pt_pt: Retorna um novo objeto set ou frozenset cujos elementos são obtidos de *iterable*. Os elementos de um conjunto devem ser :term:`hashable`. Para representar conjuntos de conjuntos, os conjuntos internos devem ser objetos :class:`frozenset`. Se *iterable* não for especificado, um novo conjunto vazio é retornado.
sv: Returnerar ett nytt set eller frozenset-objekt vars element är hämtade från *iterable*. Elementen i en uppsättning måste vara :term:`hashable`. För att representera mängder av mängder måste de inre mängderna vara :class:`frozenset`-objekt. Om *iterable* inte anges returneras en ny tom uppsättning.

source: Sets can be created by several means:
pt_pt: Os conjuntos podem ser criados de várias formas:
sv: Uppsättningar kan skapas på flera sätt:

source: Use a comma-separated list of elements within braces: ``{'jack', 'sjoerd'}``
pt_pt: Use uma lista de elementos separados por vírgulas dentro de chavetas: ``{'jack', 'sjoerd'}``
sv: Använd en kommaseparerad lista med element inom hakparenteser: ``{'jack', 'sjoerd'}``

source: Use a set comprehension: ``{c for c in 'abracadabra' if c not in 'abc'}``
pt_pt: Use uma compreensão de conjunto: ``{c for c in 'abracadabra' if c not in 'abc'}``
sv: Använd en set-förståelse: ``{c för c i 'abracadabra' om c inte finns i 'abc'}``

source: Use the type constructor: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``
pt_pt: Use o construtor de tipo: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``
sv: Använd typkonstruktören: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``

source: Instances of :class:`set` and :class:`frozenset` provide the following operations:
pt_pt: As instâncias de :class:`set` e :class:`frozenset` fornecem as seguintes operações:
sv: Instanser av :class:`set` och :class:`frozenset` tillhandahåller följande operationer:

source: Return the number of elements in set *s* (cardinality of *s*).
pt_pt: Retorna o número de elementos no conjunto *s* (cardinalidade de *s*).
sv: Returnera antalet element i uppsättningen *s* (kardinalitet för *s*).

source: Test *x* for membership in *s*.
pt_pt: Testa se *x* é membro de *s*.
sv: Testa *x* för medlemskap i *s*.

source: Test *x* for non-membership in *s*.
pt_pt: Testa se *x* não é membro de *s*.
sv: Testa *x* för icke-medlemskap i *s*.

source: Return ``True`` if the set has no elements in common with *other*. Sets are disjoint if and only if their intersection is the empty set.
pt_pt: Retorna ``True`` se o conjunto não tiver elementos em comum com *other*. Os conjuntos são disjuntos se e somente se a sua interseção for o conjunto vazio.
sv: Returnerar ``True`` om mängden inte har några element gemensamma med *andra*. Mängder är disjunkta om och endast om deras intersektion är den tomma mängden.

source: Test whether every element in the set is in *other*.
pt_pt: Testa se todos os elementos do conjunto estão em *other*.
sv: Testa om varje element i uppsättningen finns i *other*.

source: Test whether the set is a proper subset of *other*, that is, ``set <= other and set != other``.
pt_pt: Testa se o conjunto é um subconjunto próprio de *other*, ou seja, ``set <= other and set != other``.
sv: Testa om mängden är en korrekt delmängd av *annan*, dvs. ``mängd <= annan och mängd != annan``.

source: Test whether every element in *other* is in the set.
pt_pt: Testa se todos os elementos de *other* estão no conjunto.
sv: Testa om alla element i *other* finns med i uppsättningen.

source: Test whether the set is a proper superset of *other*, that is, ``set >= other and set != other``.
pt_pt: Testa se o conjunto é um superconjunto próprio de *other*, ou seja, ``set >= other and set != other``.
sv: Testa om mängden är en korrekt övermängd av *annan*, det vill säga ``mängd >= annan och mängd != annan``.

source: Return a new set with elements from the set and all others.
pt_pt: Retorna um novo conjunto com elementos do conjunto e de todos os outros.
sv: Returnera en ny uppsättning med element från uppsättningen och alla andra.

source: Return a new set with elements common to the set and all others.
pt_pt: Retorna um novo conjunto com elementos comuns ao conjunto e a todos os outros.
sv: Returnerar en ny uppsättning med element som är gemensamma för uppsättningen och alla andra.

source: Return a new set with elements in the set that are not in the others.
pt_pt: Retorna um novo conjunto com elementos no conjunto que não estão nos outros.
sv: Returnera en ny uppsättning med element i uppsättningen som inte finns i de andra.

source: Return a new set with elements in either the set or *other* but not both.
pt_pt: Retorna um novo conjunto com elementos no conjunto ou em *other*, mas não em ambos.
sv: Returnerar en ny uppsättning med element i antingen uppsättningen eller *annan* men inte båda.

source: Return a shallow copy of the set.
pt_pt: Retorna uma cópia superficial do conjunto.
sv: Returnerar en ytlig kopia av uppsättningen.

source: Note, the non-operator versions of :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset`, and :meth:`issuperset` methods will accept any iterable as an argument. In contrast, their operator based counterparts require their arguments to be sets. This precludes error-prone constructions like ``set('abc') & 'cbs'`` in favor of the more readable ``set('abc').intersection('cbs')``.
sv: Observera att icke-operatorversionerna av metoderna :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset` och :meth:`issuperset` accepterar vilken iterabel som helst som argument. Däremot kräver deras operatorbaserade motsvarigheter att deras argument är mängder. Detta utesluter felbenägna konstruktioner som ``set('abc') & 'cbs'`` till förmån för det mer läsbara ``set('abc').intersection('cbs')``.

source: Both :class:`set` and :class:`frozenset` support set to set comparisons. Two sets are equal if and only if every element of each set is contained in the other (each is a subset of the other). A set is less than another set if and only if the first set is a proper subset of the second set (is a subset, but is not equal). A set is greater than another set if and only if the first set is a proper superset of the second set (is a superset, but is not equal).
pt_pt: Tanto :class:`set` como :class:`frozenset` suportam comparações conjunto a conjunto. Dois conjuntos são iguais se e somente se cada elemento de cada conjunto estiver contido no outro (cada um é um subconjunto do outro). Um conjunto é menor que outro conjunto se e somente se o primeiro conjunto for um subconjunto próprio do segundo conjunto (é um subconjunto, mas não é igual). Um conjunto é maior que outro conjunto se e somente se o primeiro conjunto for um superconjunto próprio do segundo conjunto (é um superconjunto, mas não é igual).
sv: Både :class:`set` och :class:`frozenset` stöder jämförelser mellan mängder. Två mängder är lika om och endast om varje element i varje mängd ingår i den andra (varje mängd är en delmängd av den andra). En mängd är mindre än en annan mängd om och endast om den första mängden är en riktig delmängd av den andra mängden (är en delmängd, men inte lika). En mängd är större än en annan mängd om och endast om den första mängden är en korrekt övermängd av den andra mängden (är en övermängd, men inte lika).

source: Instances of :class:`set` are compared to instances of :class:`frozenset` based on their members. For example, ``set('abc') == frozenset('abc')`` returns ``True`` and so does ``set('abc') in set([frozenset('abc')])``.
pt_pt: Instâncias de :class:`set` são comparadas com instâncias de :class:`frozenset` com base nos seus membros. Por exemplo, ``set('abc') == frozenset('abc')`` retorna ``True`` e o mesmo acontece com ``set('abc') in set([frozenset('abc')])``.
sv: Instanser av :class:`set` jämförs med instanser av :class:`frozenset` baserat på deras medlemmar. Till exempel returnerar ``set('abc') == frozenset('abc')`` ``True`` och det gör även ``set('abc') in set([frozenset('abc')])``.

source: The subset and equality comparisons do not generalize to a total ordering function. For example, any two nonempty disjoint sets are not equal and are not subsets of each other, so *all* of the following return ``False``: ``a<b``, ``a==b``, or ``a>b``.
pt_pt: As comparações de subconjunto e igualdade não generalizam para uma função de ordenação total. Por exemplo, quaisquer dois conjuntos disjuntos não vazios não são iguais e não são subconjuntos um do outro, então *todos* os seguintes retornam ``False``: ``a<b``, ``a==b`` ou ``a>b``.
sv: Jämförelserna mellan delmängder och likheter kan inte generaliseras till en total ordningsfunktion. Till exempel, två icke-tomma disjunkta mängder är inte lika och är inte delmängder av varandra, så *alla* av följande returnerar ``False``: ``a<b``, ``a==b``, eller ``a>b``.

source: Since sets only define partial ordering (subset relationships), the output of the :meth:`list.sort` method is undefined for lists of sets.
pt_pt: Uma vez que os conjuntos definem apenas ordenação parcial (relações de subconjunto), a saída do método :meth:`list.sort` é indefinida para listas de conjuntos.
sv: Eftersom mängder endast definierar partiell ordning (relationer mellan delmängder) är resultatet av metoden :meth:`list.sort` odefinierat för listor med mängder.

source: Set elements, like dictionary keys, must be :term:`hashable`.
pt_pt: Os elementos de um conjunto, tal como as chaves de um dicionário, devem ser :term:`hashable`.
sv: Set-element måste, precis som nycklar i ordböcker, vara :term:`hashable`.

source: Binary operations that mix :class:`set` instances with :class:`frozenset` return the type of the first operand. For example: ``frozenset('ab') | set('bc')`` returns an instance of :class:`frozenset`.
pt_pt: Operações binárias que misturam instâncias de :class:`set` com :class:`frozenset` retornam o tipo do primeiro operando. Por exemplo: ``frozenset('ab') | set('bc')`` retorna uma instância de :class:`frozenset`.
sv: Binära operationer som blandar :class:`set`-instanser med :class:`frozenset` returnerar typen av den första operanden. Till exempel: ```frozenset('ab') | set('bc')`` returnerar en instans av :class:`frozenset`.

source: The following table lists operations available for :class:`set` that do not apply to immutable instances of :class:`frozenset`:
pt_pt: A tabela seguinte lista operações disponíveis para :class:`set` que não se aplicam a instâncias imutáveis de :class:`frozenset`:
sv: Följande tabell listar operationer som är tillgängliga för :class:`set` och som inte gäller för oföränderliga instanser av :class:`frozenset`:

source: Update the set, adding elements from all others.
pt_pt: Atualiza o conjunto, adicionando elementos de todos os outros.
sv: Uppdatera uppsättningen genom att lägga till element från alla andra.

source: Update the set, keeping only elements found in it and all others.
pt_pt: Atualiza o conjunto, mantendo apenas elementos encontrados nele e em todos os outros.
sv: Uppdatera uppsättningen och behåll endast de element som finns i den och alla andra.

source: Update the set, removing elements found in others.
pt_pt: Atualiza o conjunto, removendo elementos encontrados nos outros.
sv: Uppdatera uppsättningen och ta bort element som finns i andra.

source: Update the set, keeping only elements found in either set, but not in both.
pt_pt: Atualiza o conjunto, mantendo apenas elementos encontrados em qualquer conjunto, mas não em ambos.
sv: Uppdatera uppsättningen och behåll endast element som finns i endera uppsättningen, men inte i båda.

source: Add element *elem* to the set.
pt_pt: Adiciona o elemento *elem* ao conjunto.
sv: Lägg till element *elem* i uppsättningen.

source: Remove element *elem* from the set. Raises :exc:`KeyError` if *elem* is not contained in the set.
pt_pt: Remove o elemento *elem* do conjunto. Lança :exc:`KeyError` se *elem* não estiver contido no conjunto.
sv: Tar bort elementet *elem* från uppsättningen. Utlöser :exc:`KeyError` om *elem* inte finns med i uppsättningen.

source: Remove element *elem* from the set if it is present.
pt_pt: Remove o elemento *elem* do conjunto, se estiver presente.
sv: Ta bort elementet *elem* från uppsättningen om det finns där.

source: Remove and return an arbitrary element from the set. Raises :exc:`KeyError` if the set is empty.
pt_pt: Remove e retorna um elemento arbitrário do conjunto. Lança :exc:`KeyError` se o conjunto estiver vazio.
sv: Tar bort och returnerar ett godtyckligt element från uppsättningen. Utlöser :exc:`KeyError` om uppsättningen är tom.

source: Remove all elements from the set.
pt_pt: Remove todos os elementos do conjunto.
sv: Ta bort alla element från uppsättningen.
