Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Update the dictionary *d* with keys and values from *other*, which may be either a :term:`mapping` or an :term:`iterable` of key/value pairs. The values of *other* take priority when *d* and *other* share keys.
pt_pt: Atualiza o dicionário *d* com chaves e valores de *other*, que pode ser um :term:`mapeamento` ou um :term:`iterável` de pares chave/valor. Os valores de *other* têm prioridade quando *d* e *other* partilham chaves.
sv: Uppdaterar ordlistan *d* med nycklar och värden från *other*, som kan vara antingen en :term:`mappning` eller en :term:`iterabel` av nyckel/värde-par. Värdena i *other* prioriteras när *d* och *other* delar nycklar.

source: Dictionaries and dictionary views are reversible. ::
pt_pt: Dicionários e vistas de dicionário são reversíveis:
sv: Ordböcker och ordboksvyer är reversibla ::

source: >>> d = {"one": 1, "two": 2, "three": 3, "four": 4} >>> d {'one': 1, 'two': 2, 'three': 3, 'four': 4} >>> list(reversed(d)) ['four', 'three', 'two', 'one'] >>> list(reversed(d.values())) [4, 3, 2, 1] >>> list(reversed(d.items())) [('four', 4), ('three', 3), ('two', 2), ('one', 1)]
sv: >>> d = {"ett": 1, "två": 2, "tre": 3, "fyra": 4} >>> d {"ett": 1, "två": 2, "tre": 3, 'four': 4} >>> list(reversed(d)) ['fyra', 'tre', 'två', 'ett'] >>> list(reversed(d.values()))) [4, 3, 2, 1] >>> list(reversed(d.items())) [('fyra', 4), ('tre', 3), ('två', 2), ('ett', 1)]

source: Dictionaries are now reversible.
pt_pt: Os dicionários são agora reversíveis.
sv: Ordböcker är nu reversibla.

source: :class:`types.MappingProxyType` can be used to create a read-only view of a :class:`dict`.
pt_pt: :class:`types.MappingProxyType` pode ser usado para criar uma vista apenas de leitura de um :class:`dict`.
sv: :class:`types.MappingProxyType` kan användas för att skapa en skrivskyddad vy av en :class:`dict`.

source: Dictionary view objects
pt_pt: Objetos de vista de dicionário
sv: Objekt för ordboksvisning

source: The objects returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` are *view objects*. They provide a dynamic view on the dictionary's entries, which means that when the dictionary changes, the view reflects these changes.
pt_pt: Os objetos retornados por :meth:`dict.keys`, :meth:`dict.values` e :meth:`dict.items` são *objetos de vista*. Eles fornecem uma vista dinâmica nas entradas do dicionário, o que significa que quando o dicionário muda, a vista reflete essas mudanças.
sv: De objekt som returneras av :meth:`dict.keys`, :meth:`dict.values` och :meth:`dict.items` är *vyobjekt*. De ger en dynamisk vy över ordbokens poster, vilket innebär att när ordboken ändras återspeglas dessa ändringar i vyn.

source: Dictionary views can be iterated over to yield their respective data, and support membership tests:
pt_pt: As vistas de dicionário podem ser iteradas para produzir os seus dados respetivos e suportam testes de pertença:
sv: Dictionary-vyer kan itereras för att få fram sina respektive data och stödja medlemskapstester:

source: Return the number of entries in the dictionary.
pt_pt: Retorna o número de entradas no dicionário.
sv: Returnerar antalet poster i ordlistan.

source: Return an iterator over the keys, values or items (represented as tuples of ``(key, value)``) in the dictionary.
pt_pt: Retorna um iterador sobre as chaves, valores ou itens (representados como tuplos de ``(key, value)``) no dicionário.
sv: Returnerar en iterator över nycklar, värden eller objekt (representerade som tupler av ``(nyckel, värde)``) i ordlistan.

source: Keys and values are iterated over in insertion order. This allows the creation of ``(value, key)`` pairs using :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Another way to create the same list is ``pairs = [(v, k) for (k, v) in d.items()]``.
pt_pt: As chaves e valores são iterados por ordem de inserção. Isto permite a criação de pares ``(value, key)`` usando :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Outra forma de criar a mesma lista é ``pairs = [(v, k) for (k, v) in d.items()]``.
sv: Nycklar och värden itereras över i insättningsordning. Detta gör det möjligt att skapa ``(värde, nyckel)``-par med hjälp av :func:`zip`: ``par = zip(d.values(), d.keys())``. Ett annat sätt att skapa samma lista är ``par = [(v, k) for (k, v) in d.items()]``.

source: Iterating views while adding or deleting entries in the dictionary may raise a :exc:`RuntimeError` or fail to iterate over all entries.
pt_pt: Iterar vistas enquanto se adicionam ou eliminam entradas no dicionário pode lançar uma exceção :exc:`RuntimeError` ou falhar ao iterar sobre todas as entradas.
sv: Om du itererar vyer medan du lägger till eller tar bort poster i ordlistan kan det leda till ett :exc:`RuntimeError` eller att du inte kan iterera över alla poster.

source: Dictionary order is guaranteed to be insertion order.
pt_pt: A ordem do dicionário é garantida como sendo a ordem de inserção.
sv: Ordboksordning är garanterad att vara insättningsordning.

source: Return ``True`` if *x* is in the underlying dictionary's keys, values or items (in the latter case, *x* should be a ``(key, value)`` tuple).
pt_pt: Retorna ``True`` se *x* estiver nas chaves, valores ou itens do dicionário subjacente (no último caso, *x* deve ser um tuplo ``(key, value)``).
sv: Returnerar ``True`` om *x* finns i den underliggande ordbokens nycklar, värden eller objekt (i det senare fallet bör *x* vara en ``(nyckel, värde)``-tupel).

source: Return a reverse iterator over the keys, values or items of the dictionary. The view will be iterated in reverse order of the insertion.
pt_pt: Retorna um iterador reverso sobre as chaves, valores ou itens do dicionário. A vista será iterada por ordem inversa da inserção.
sv: Returnerar en omvänd iterator över nycklar, värden eller objekt i ordlistan. Vyn kommer att itereras i omvänd ordning efter införandet.

source: Dictionary views are now reversible.
pt_pt: As vistas de dicionário são agora reversíveis.
sv: Ordboksvyerna är nu reversibla.

source: Return a :class:`types.MappingProxyType` that wraps the original dictionary to which the view refers.
pt_pt: Retorna um :class:`types.MappingProxyType` que encapsula o dicionário original ao qual a vista se refere.
sv: Returnerar en :class:`types.MappingProxyType` som omsluter den ursprungliga ordlistan som vyn refererar till.

source: Keys views are set-like since their entries are unique and :term:`hashable`. Items views also have set-like operations since the (key, value) pairs are unique and the keys are hashable. If all values in an items view are hashable as well, then the items view can interoperate with other sets. (Values views are not treated as set-like since the entries are generally not unique.) For set-like views, all of the operations defined for the abstract base class :class:`collections.abc.Set` are available (for example, ``==``, ``<``, or ``^``). While using set operators, set-like views accept any iterable as the other operand, unlike sets which only accept sets as the input.
pt_pt: As vistas de chaves são semelhantes a conjuntos, uma vez que as suas entradas são únicas e :term:`hashable`. As vistas de itens também têm operações semelhantes a conjuntos, uma vez que os pares (chave, valor) são únicos e as chaves são hashable. Se todos os valores numa vista de itens também forem hashable, então a vista de itens pode interoperar com outros conjuntos. (As vistas de valores não são tratadas como semelhantes a conjuntos, uma vez que as entradas geralmente não são únicas.) Para vistas semelhantes a conjuntos, todas as operações definidas para a classe base abstrata :class:`collections.abc.Set` estão disponíveis (por exemplo, ``==``, ``<`` ou ``^``). Ao usar operadores de conjunto, vistas semelhantes a conjuntos aceitam qualquer iterável como o outro operando, ao contrário dos conjuntos, que só aceitam conjuntos como entrada.
sv: Keys-vyer är set-liknande eftersom deras poster är unika och :term:`hashable`. Objektvyer har också set-liknande operationer eftersom (nyckel, värde)-paren är unika och nycklarna är hashbara. Om alla värden i en items-vy också är hashbara kan items-vyn samverka med andra set. (Värdevyer behandlas inte som set-liknande eftersom posterna i allmänhet inte är unika) För set-liknande vyer är alla operationer som definieras för den abstrakta basklassen :class:`collections.abc.Set` tillgängliga (t.ex. ``==``, ``<`` eller ``^``). Vid användning av set-operatorer accepterar set-liknande vyer alla iterabla som den andra operanden, till skillnad från sets som endast accepterar sets som indata.

source: An example of dictionary view usage::
pt_pt: Um exemplo de uso de vistas de dicionário:
sv: Ett exempel på användning av ordboksvy::

source: >>> dishes = {'eggs': 2, 'sausage': 1, 'bacon': 1, 'spam': 500} >>> keys = dishes.keys() >>> values = dishes.values() >>> # iteration >>> n = 0 >>> for val in values: ... n += val ... >>> print(n) 504 >>> # keys and values are iterated over in the same order (insertion order) >>> list(keys) ['eggs', 'sausage', 'bacon', 'spam'] >>> list(values) [2, 1, 1, 500] >>> # view objects are dynamic and reflect dict changes >>> del dishes['eggs'] >>> del dishes['sausage'] >>> list(keys) ['bacon', 'spam'] >>> # set operations >>> keys & {'eggs', 'bacon', 'salad'} {'bacon'} >>> keys ^ {'sausage', 'juice'} == {'juice', 'sausage', 'bacon', 'spam'} True >>> keys | ['juice', 'juice', 'juice'] == {'bacon', 'spam', 'juice'} True >>> # get back a read-only proxy for the original dictionary >>> values.mapping mappingproxy({'bacon': 1, 'spam': 500}) >>> values.mapping['spam'] 500
pt_pt: >>> dishes = {'eggs': 2, 'sausage': 1, 'bacon': 1, 'spam': 500} >>> keys = dishes.keys() >>> values = dishes.values() >>> # iteração >>> n = 0 >>> for val in values: ... n += val ... >>> print(n) 504 >>> # chaves e valores são iterados na mesma ordem (ordem de inserção) >>> list(keys) ['eggs', 'sausage', 'bacon', 'spam'] >>> list(values) [2, 1, 1, 500] >>> # objetos de vista são dinâmicos e refletem alterações no dicionário >>> del dishes['eggs'] >>> del dishes['sausage'] >>> list(keys) ['bacon', 'spam'] >>> # operações de conjunto >>> keys & {'eggs', 'bacon', 'salad'} {'bacon'} >>> keys ^ {'sausage', 'juice'} == {'juice', 'sausage', 'bacon', 'spam'} True >>> keys | ['juice', 'juice', 'juice'] == {'bacon', 'spam', 'juice'} True >>> # obter um proxy apenas de leitura para o dicionário original >>> values.mapping mappingproxy({'bacon': 1, 'spam': 500}) >>> values.mapping['spam'] 500
sv: >>> rätter = {'ägg': 2, 'korv': 1, 'bacon': 1, 'spam': 500} >>> nycklar = rätter.nycklar() >>> värden = rätter.värden() >>> # iteration >>> n = 0 >>> för val i värden: ... n += val ... >>> print(n) 504 >>> # nycklar och värden itereras över i samma ordning (insättningsordning) >>> list(nycklar) ['ägg', 'korv', 'bacon', 'spam'] >>> list(värden) [2, 1, 1, 500] >>> # visningsobjekt är dynamiska och återspeglar diktatändringar >>> del rätter['ägg'] >>> del rätter['korv'] >>> list(nycklar) ['bacon', 'spam'] >>> # ställa in operationer >>> nycklar & {'ägg', 'bacon', 'sallad'} {'bacon'} >>> nycklar ^ {'korv', 'juice'} == {'juice', 'korv', 'bacon', 'spam'} Sant >>> nycklar | ['juice', 'juice', 'juice'] == {'bacon', 'spam', 'juice'} Sant >>> # få tillbaka en skrivskyddad proxy för den ursprungliga ordlistan >>> värden.mappning mappningsproxy({'bacon': 1, 'spam': 500}) >>> värden.mappning['spam'] 500

source: Context Manager Types
pt_pt: Tipos de Gestor de Contexto
sv: Typer av kontexthanterare

source: Python's :keyword:`with` statement supports the concept of a runtime context defined by a context manager. This is implemented using a pair of methods that allow user-defined classes to define a runtime context that is entered before the statement body is executed and exited when the statement ends:
pt_pt: A instrução :keyword:`with` do Python suporta o conceito de um contexto de execução definido por um gestor de contexto. Isto é implementado usando um par de métodos que permitem que classes definidas pelo utilizador definam um contexto de execução que é iniciado antes da execução do corpo da instrução e terminado quando a instrução termina:
sv: Pythons :keyword:`with`-sats stöder konceptet med en körtidskontext som definieras av en kontexthanterare. Detta implementeras med hjälp av ett par metoder som gör det möjligt för användardefinierade klasser att definiera en körtidskontext som anges innan satsens kropp exekveras och avslutas när satsen avslutas:

source: Enter the runtime context and return either this object or another object related to the runtime context. The value returned by this method is bound to the identifier in the :keyword:`!as` clause of :keyword:`with` statements using this context manager.
pt_pt: Inicia o contexto de execução e retorna este objeto ou outro objeto relacionado com o contexto de execução. O valor retornado por este método é associado ao identificador na cláusula :keyword:`!as` das instruções :keyword:`with` que usam este gestor de contexto.
sv: Anger körtidskontexten och returnerar antingen detta objekt eller ett annat objekt som är relaterat till körtidskontexten. Det värde som returneras av denna metod är bundet till identifieraren i :keyword:`!as`-klausulen i :keyword:`with`-satser med hjälp av denna kontexthanterare.

source: An example of a context manager that returns itself is a :term:`file object`. File objects return themselves from __enter__() to allow :func:`open` to be used as the context expression in a :keyword:`with` statement.
pt_pt: Um exemplo de um gestor de contexto que retorna a si próprio é um objeto :term:`ficheiro`. Os objetos de ficheiro retornam a si próprios de __enter__() para permitir que :func:`open` seja usado como a expressão de contexto numa instrução :keyword:`with`.
sv: Ett exempel på en kontexthanterare som returnerar sig själv är ett :term:`file-objekt`. Filobjekt returnerar sig själva från __enter__() så att :func:`open` kan användas som kontextuttryck i en :keyword:`with`-sats.

source: An example of a context manager that returns a related object is the one returned by :func:`decimal.localcontext`. These managers set the active decimal context to a copy of the original decimal context and then return the copy. This allows changes to be made to the current decimal context in the body of the :keyword:`with` statement without affecting code outside the :keyword:`!with` statement.
pt_pt: Um exemplo de um gestor de contexto que retorna um objeto relacionado é o retornado por :func:`decimal.localcontext`. Estes gestores definem o contexto decimal ativo para uma cópia do contexto decimal original e depois retornam a cópia. Isto permite que sejam feitas alterações ao contexto decimal atual no corpo da instrução :keyword:`with` sem afetar o código fora da instrução :keyword:`!with`.
sv: Ett exempel på en kontexthanterare som returnerar ett relaterat objekt är den som returneras av :func:`decimal.localcontext`. Dessa hanterare sätter den aktiva decimalkontexten till en kopia av den ursprungliga decimalkontexten och returnerar sedan kopian. Detta gör att ändringar kan göras i den aktuella decimalkontexten i :keyword:`with`-satsen utan att påverka koden utanför :keyword:`!with`-satsen.

source: Exit the runtime context and return a Boolean flag indicating if any exception that occurred should be suppressed. If an exception occurred while executing the body of the :keyword:`with` statement, the arguments contain the exception type, value and traceback information. Otherwise, all three arguments are ``None``.
pt_pt: Sai do contexto de execução e retorna um sinalizador booleano que indica se qualquer exceção que tenha ocorrido deve ser suprimida. Se uma exceção ocorreu durante a execução do corpo da instrução :keyword:`with`, os argumentos contêm o tipo de exceção, valor e informações de traceback. Caso contrário, os três argumentos são ``None``.
sv: Avslutar körtidskontexten och returnerar en boolesk flagga som anger om ett eventuellt undantag som inträffat ska undertryckas. Om ett undantag inträffade under exekveringen av :keyword:`with`-satsen, innehåller argumenten undantagstyp, värde och spårningsinformation. Annars är alla tre argumenten ``None``.

source: Returning a true value from this method will cause the :keyword:`with` statement to suppress the exception and continue execution with the statement immediately following the :keyword:`!with` statement. Otherwise the exception continues propagating after this method has finished executing. Exceptions that occur during execution of this method will replace any exception that occurred in the body of the :keyword:`!with` statement.
sv: Om ett sant värde returneras från den här metoden kommer :keyword:`with`-satsen att undertrycka undantaget och fortsätta exekveringen med den sats som följer omedelbart efter :keyword:`!with`-satsen. Annars fortsätter undantaget att spridas efter att den här metoden har avslutats. Undantag som inträffar under exekveringen av denna metod kommer att ersätta alla undantag som inträffade i :keyword:`!with`-satsens kropp.

source: The exception passed in should never be reraised explicitly - instead, this method should return a false value to indicate that the method completed successfully and does not want to suppress the raised exception. This allows context management code to easily detect whether or not an :meth:`~object.__exit__` method has actually failed.
pt_pt: A exceção passada não deve ser relançada explicitamente - em vez disso, este método deve retornar um valor falso para indicar que o método foi concluído com sucesso e não deseja suprimir a exceção lançada. Isto permite que o código de gestão de contexto detete facilmente se um método :meth:`~object.__exit__` falhou ou não.
sv: Det undantag som skickas in bör aldrig återställas explicit - i stället bör denna metod returnera ett falskt värde för att ange att metoden slutfördes framgångsrikt och inte vill undertrycka det undantag som återställts. Detta gör det möjligt för kontexthanteringskod att enkelt upptäcka om en :meth:`~object.__exit__`-metod faktiskt har misslyckats eller inte.

source: Python defines several context managers to support easy thread synchronisation, prompt closure of files or other objects, and simpler manipulation of the active decimal arithmetic context. The specific types are not treated specially beyond their implementation of the context management protocol. See the :mod:`contextlib` module for some examples.
pt_pt: O Python define vários gestores de contexto para suportar sincronização fácil de threads, fechamento imediato de ficheiros ou outros objetos, e manipulação mais simples do contexto aritmético decimal ativo. Os tipos específicos não são tratados de forma especial além da sua implementação do protocolo de gestão de contexto. Consulte o módulo :mod:`contextlib` para alguns exemplos.
sv: Python definierar flera kontexthanterare för att stödja enkel trådsynkronisering, snabb stängning av filer eller andra objekt och enklare hantering av den aktiva decimala aritmetiska kontexten. De specifika typerna behandlas inte speciellt utöver deras implementering av kontexthanteringsprotokollet. Se modulen :mod:`contextlib` för några exempel.

source: Python's :term:`generator`\s and the :class:`contextlib.contextmanager` decorator provide a convenient way to implement these protocols. If a generator function is decorated with the :class:`contextlib.contextmanager` decorator, it will return a context manager implementing the necessary :meth:`~contextmanager.__enter__` and :meth:`~contextmanager.__exit__` methods, rather than the iterator produced by an undecorated generator function.
pt_pt: Os :term:`geradores` do Python e o decorador :class:`contextlib.contextmanager` fornecem uma forma conveniente de implementar estes protocolos. Se uma função geradora for decorada com o decorador :class:`contextlib.contextmanager`, retornará um gestor de contexto que implementa os métodos necessários :meth:`~contextmanager.__enter__` e :meth:`~contextmanager.__exit__`, em vez do iterador produzido por uma função geradora não decorada.
sv: Pythons :term:`generator` och :class:`contextlib.contextmanager`-dekoratorn ger ett bekvämt sätt att implementera dessa protokoll. Om en generatorfunktion dekoreras med dekoratorn :class:`contextlib.contextmanager` kommer den att returnera en kontexthanterare som implementerar de nödvändiga metoderna :meth:`~contextmanager.__enter__` och :meth:`~contextmanager.__exit__`, snarare än den iterator som produceras av en odekorerad generatorfunktion.

source: Note that there is no specific slot for any of these methods in the type structure for Python objects in the Python/C API. Extension types wanting to define these methods must provide them as a normal Python accessible method. Compared to the overhead of setting up the runtime context, the overhead of a single class dictionary lookup is negligible.
pt_pt: Note que não existe um slot específico para qualquer um destes métodos na estrutura de tipo para objetos Python na API Python/C. Tipos de extensão que pretendam definir estes métodos devem fornecê-los como um método Python acessível normal. Comparado com o overhead de configuração do contexto de execução, o overhead de uma única pesquisa no dicionário de classe é negligenciável.
sv: Observera att det inte finns någon specifik plats för någon av dessa metoder i typstrukturen för Python-objekt i Python/C API. Tilläggstyper som vill definiera dessa metoder måste tillhandahålla dem som en normal Python-åtkomlig metod. Jämfört med omkostnaderna för att konfigurera körtidskontexten är omkostnaderna för en enda klassordboksuppslagning försumbara.

source: Type Annotation Types --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`
pt_pt: Tipos de Anotação de Tipo --- :ref:`Alias Genérico <types-genericalias>`, :ref:`União <types-union>`
sv: Typ Annotation Types --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`

source: The core built-in types for :term:`type annotations <annotation>` are :ref:`Generic Alias <types-genericalias>` and :ref:`Union <types-union>`.
pt_pt: Os tipos incorporados principais para :term:`anotações de tipo <annotation>` são :ref:`Alias Genérico <types-genericalias>` e :ref:`União <types-union>`.
sv: De inbyggda kärntyperna för :term:`type annotations <annotation>` är :ref:`Generic Alias <types-genericalias>` och :ref:`Union <types-union>`.

source: Generic Alias Type
pt_pt: Tipo Alias Genérico
sv: Generiskt alias Typ
