Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: def square(number: int | float) -> int | float: return number ** 2
pt_pt: def quadrado(número: int | float) -> int | float: return número ** 2
sv: def square(number: int | float) -> int | float: returnerar nummer ** 2

source: The ``|`` operand cannot be used at runtime to define unions where one or more members is a forward reference. For example, ``int | "Foo"``, where ``"Foo"`` is a reference to a class not yet defined, will fail at runtime. For unions which include forward references, present the whole expression as a string, e.g. ``"int | Foo"``.
pt_pt: O operando ``|`` não pode ser usado em tempo de execução para definir uniões onde um ou mais membros é uma referência antecipada. Por exemplo, ``int | "Foo"``, onde ``"Foo"`` é uma referência a uma classe ainda não definida, falhará em tempo de execução. Para uniões que incluem referências antecipadas, apresente toda a expressão como uma *string*, por exemplo, ``"int | Foo"``.
sv: Operanden ``|`` kan inte användas vid körning för att definiera unioner där en eller flera medlemmar är en framåtriktad referens. Till exempel kommer ``int | "Foo"``, där ``"Foo"`` är en referens till en klass som ännu inte definierats, att misslyckas vid körning. För unioner som innehåller framåtriktade referenser ska hela uttrycket presenteras som en sträng, t.ex. ``"int | Foo"``.

source: Union objects can be tested for equality with other union objects. Details:
pt_pt: Os objetos união podem ser testados para igualdade com outros objetos união. Detalhes:
sv: Unionsobjekt kan testas för jämlikhet med andra unionsobjekt. Detaljerad information:

source: Unions of unions are flattened::
pt_pt: Uniões de uniões são achatadas:
sv: Unioner av unioner är tillplattade::

source: Redundant types are removed::
pt_pt: Tipos redundantes são removidos:
sv: Överflödiga typer tas bort::

source: When comparing unions, the order is ignored::
pt_pt: Ao comparar uniões, a ordem é ignorada:
sv: Vid jämförelse av fackföreningar ignoreras ordningen::

source: It creates instances of :class:`typing.Union`::
sv: Den skapar instanser av :class:`typing.Union`::

source: int | str == typing.Union[int, str] type(int | str) is typing.Union
sv: int | str == typing.Union[int, str] typ(int | str) är typing.union

source: Optional types can be spelled as a union with ``None``::
pt_pt: Tipos opcionais podem ser escritos como uma união com ``None``:
sv: Valfria typer kan stavas som en union med ``None``::

source: Calls to :func:`isinstance` and :func:`issubclass` are also supported with a union object::
pt_pt: Chamadas a :func:`isinstance` e :func:`issubclass` também são suportadas com um objeto união:
sv: Anrop till :func:`isinstance` och :func:`issubclass` stöds också med ett unionsobjekt::

source: >>> isinstance("", int | str) True
sv: >>> isinstance("", int | str) Sant

source: However, :ref:`parameterized generics <types-genericalias>` in union objects cannot be checked::
pt_pt: No entanto, :ref:`genéricos parametrizados <types-genericalias>` em objetos união não podem ser verificados:
sv: Däremot kan :ref:`parameterized generics <types-genericalias>` i unionsobjekt inte kontrolleras::

source: >>> isinstance(1, int | list[int]) # short-circuit evaluation True >>> isinstance([1], int | list[int]) Traceback (most recent call last): ... TypeError: isinstance() argument 2 cannot be a parameterized generic
pt_pt: >>> isinstance(1, int | list[int]) # avaliação de curto-circuito True >>> isinstance([1], int | list[int]) Traceback (most recent call last): ... TypeError: isinstance() argumento 2 não pode ser um genérico parametrizado
sv: >>> isinstance(1, int | list[int]) # kortslutningsutvärdering Sant >>> isinstans([1], int | lista[int]) Traceback (senaste anropet senast): ... TypeError: isinstance() argument 2 kan inte vara en parameteriserad generisk

source: The user-exposed type for the union object can be accessed from :class:`typing.Union` and used for :func:`isinstance` checks::
sv: Den användardefinierade typen för union-objektet kan hämtas från :class:`typing.Union` och användas för :func:`isinstance`-kontroller::

source: >>> import typing >>> isinstance(int | str, typing.Union) True >>> typing.Union() Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: cannot create 'typing.Union' instances
sv: &gt;&gt;&gt; import typning &gt;&gt;&gt; isinstance(int | str, typing.Union) Sant &gt;&gt;&gt; typing.union() Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: kan inte skapa 'typing.Union'-instanser

source: The :meth:`!__or__` method for type objects was added to support the syntax ``X | Y``. If a metaclass implements :meth:`!__or__`, the Union may override it:
pt_pt: O método :meth:`!__or__` para objetos de tipo foi adicionado para suportar a sintaxe ``X | Y``. Se uma metaclasse implementar :meth:`!__or__`, a União pode substituí-lo:
sv: Metoden :meth:`!__or__` för typobjekt har lagts till för att stödja syntaxen ``X | Y``. Om en metaklass implementerar :meth:`!__or__` kan unionen åsidosätta den:

source: >>> class M(type): ... def __or__(self, other): ... return "Hello" ... >>> class C(metaclass=M): ... pass ... >>> C | int 'Hello' >>> int | C int | C
pt_pt: >>> class M(type): ... def __or__(self, other): ... return "Olá" ... >>> class C(metaclass=M): ... pass ... >>> C | int 'Olá' >>> int | C int | C
sv: >>> klass M(typ): ... def __or__(self, other): ... return "Hej" ... >>> klass C(metaklass=M): ... pass ... >>> C | int 'Hej' >>> int | C int | C

source: :pep:`604` -- PEP proposing the ``X | Y`` syntax and the Union type.
pt_pt: :pep:`604` -- PEP que propõe a sintaxe ``X | Y`` e o tipo União.
sv: :pep:`604` -- PEP föreslår syntaxen ``X | Y`` och Union-typen.

source: Union objects are now instances of :class:`typing.Union`. Previously, they were instances of :class:`types.UnionType`, which remains an alias for :class:`typing.Union`.
sv: Union-objekt är nu instanser av :class:`typing.Union`. Tidigare var de instanser av :class:`types.UnionType`, som fortfarande är ett alias för :class:`typing.Union`.

source: Other Built-in Types
pt_pt: Outros Tipos Incorporados
sv: Andra inbyggda typer

source: The interpreter supports several other kinds of objects. Most of these support only one or two operations.
pt_pt: O interpretador suporta vários outros tipos de objetos. A maioria destes suporta apenas uma ou duas operações.
sv: Tolken har stöd för flera andra typer av objekt. De flesta av dessa stöder endast en eller två operationer.

source: Modules
pt_pt: Módulos
sv: Moduler

source: The only special operation on a module is attribute access: ``m.name``, where *m* is a module and *name* accesses a name defined in *m*'s symbol table. Module attributes can be assigned to. (Note that the :keyword:`import` statement is not, strictly speaking, an operation on a module object; ``import foo`` does not require a module object named *foo* to exist, rather it requires an (external) *definition* for a module named *foo* somewhere.)
pt_pt: A única operação especial num módulo é o acesso a atributos: ``m.name``, onde *m* é um módulo e *name* acede a um nome definido na tabela de símbolos de *m*. Os atributos do módulo podem ser atribuídos. (Note que a instrução :keyword:`import` não é, estritamente falando, uma operação num objeto de módulo; ``import foo`` não requer que exista um objeto de módulo chamado *foo*, mas sim uma *definição* (externa) para um módulo chamado *foo* em algum lugar.)
sv: Den enda speciella operationen på en modul är attributåtkomst: ``m.name``, där *m* är en modul och *name* ger åtkomst till ett namn som definieras i *m*:s symboltabell. Modulattribut kan tilldelas till. (Observera att :keyword:`import` inte i strikt mening är en operation på ett modulobjekt; ``import foo`` kräver inte att ett modulobjekt med namnet *foo* existerar, utan snarare att det finns en (extern) *definition* för en modul med namnet *foo* någonstans)

source: A special attribute of every module is :attr:`~object.__dict__`. This is the dictionary containing the module's symbol table. Modifying this dictionary will actually change the module's symbol table, but direct assignment to the :attr:`~object.__dict__` attribute is not possible (you can write ``m.__dict__['a'] = 1``, which defines ``m.a`` to be ``1``, but you can't write ``m.__dict__ = {}``). Modifying :attr:`~object.__dict__` directly is not recommended.
pt_pt: Um atributo especial de cada módulo é :attr:`~object.__dict__`. Este é o dicionário que contém a tabela de símbolos do módulo. Modificar este dicionário alterará efetivamente a tabela de símbolos do módulo, mas a atribuição direta ao atributo :attr:`~object.__dict__` não é possível (pode escrever ``m.__dict__['a'] = 1``, que define ``m.a`` como ``1``, mas não pode escrever ``m.__dict__ = {}``). Modificar :attr:`~object.__dict__` diretamente não é recomendado.
sv: Ett speciellt attribut för varje modul är :attr:`~object.__dict__`. Detta är den ordbok som innehåller modulens symboltabell. Modifiering av denna dictionary kommer faktiskt att ändra modulens symboltabell, men direkt tilldelning till attributet :attr:`~object.__dict__` är inte möjligt (du kan skriva ``m.__dict__['a'] = 1``, vilket definierar ``m.a`` till att vara ``1``, men du kan inte skriva ``m.__dict__ = {}``). Att ändra :attr:`~object.__dict__` direkt är inte rekommenderat.

source: Modules built into the interpreter are written like this: ``<module 'sys' (built-in)>``. If loaded from a file, they are written as ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.
pt_pt: Os módulos incorporados no interpretador são escritos assim: ``<module 'sys' (built-in)>``. Se carregados a partir de um ficheiro, são escritos como ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.
sv: Moduler som är inbyggda i tolken skrivs på följande sätt: ``<modulen 'sys' (inbyggd)>``. Om de laddas från en fil skrivs de som ``<modulen 'os' från '/usr/local/lib/pythonX.Y/os.pyc'>``.

source: Classes and Class Instances
pt_pt: Classes e Instâncias de Classe
sv: Klasser och klassinstanser

source: See :ref:`objects` and :ref:`class` for these.
pt_pt: Consulte :ref:`objects` e :ref:`class` para mais informações.
sv: Se :ref:`objects` och :ref:`class` för dessa.

source: Functions
pt_pt: Funções
sv: Funktioner

source: Function objects are created by function definitions. The only operation on a function object is to call it: ``func(argument-list)``.
pt_pt: Os objetos função são criados por definições de função. A única operação num objeto função é chamá-lo: ``func(argument-list)``.
sv: Funktionsobjekt skapas av funktionsdefinitioner. Den enda operationen på ett funktionsobjekt är att anropa det: ``func(argument-list)``.

source: There are really two flavors of function objects: built-in functions and user-defined functions. Both support the same operation (to call the function), but the implementation is different, hence the different object types.
pt_pt: Existem realmente dois tipos de objetos função: funções incorporadas e funções definidas pelo utilizador. Ambas suportam a mesma operação (chamar a função), mas a implementação é diferente, daí os diferentes tipos de objeto.
sv: Det finns egentligen två olika typer av funktionsobjekt: inbyggda funktioner och användardefinierade funktioner. Båda stöder samma operation (att anropa funktionen), men implementeringen är olika, därav de olika objekttyperna.

source: See :ref:`function` for more information.
pt_pt: Consulte :ref:`function` para mais informações.
sv: Se :ref:`function` för mer information.

source: Methods
pt_pt: Métodos
sv: Metoder

source: Methods are functions that are called using the attribute notation. There are two flavors: :ref:`built-in methods <builtin-methods>` (such as :meth:`append` on lists) and :ref:`class instance method <instance-methods>`. Built-in methods are described with the types that support them.
sv: Metoder är funktioner som anropas med hjälp av attributnotationen. Det finns två varianter: :ref:`inbyggda metoder <builtin-methods>` (t.ex. :meth:`append` på listor) och :ref:`klassinstansmetod <instance-methods>`. Inbyggda metoder beskrivs med de typer som stöder dem.

source: If you access a method (a function defined in a class namespace) through an instance, you get a special object: a :dfn:`bound method` (also called :ref:`instance method <instance-methods>`) object. When called, it will add the ``self`` argument to the argument list. Bound methods have two special read-only attributes: :attr:`m.__self__ <method.__self__>` is the object on which the method operates, and :attr:`m.__func__ <method.__func__>` is the function implementing the method. Calling ``m(arg-1, arg-2, ..., arg-n)`` is completely equivalent to calling ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
pt_pt: Se aceder a um método (uma função definida num espaço de nomes de classe) através de uma instância, obtém um objeto especial: um objeto :dfn:`método ligado` (também chamado de :ref:`método de instância <instance-methods>`). Quando chamado, adicionará o argumento ``self`` à lista de argumentos. Os métodos ligados têm dois atributos especiais apenas de leitura: :attr:`m.__self__ <method.__self__>` é o objeto no qual o método opera, e :attr:`m.__func__ <method.__func__>` é a função que implementa o método. Chamar ``m(arg-1, arg-2, ..., arg-n)`` é completamente equivalente a chamar ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
sv: Om du anropar en metod (en funktion som definieras i en klassnamnrymd) via en instans får du ett speciellt objekt: ett :dfn:`bound method`-objekt (även kallat :ref:`instance method <instance-methods>`). När den anropas kommer den att lägga till argumentet ``self`` i argumentlistan. Bound methods har två speciella skrivskyddade attribut: :attr:`m.__self__ <method.__self__>` är det objekt som metoden verkar på, och :attr:`m.__func__ <method.__func__>` är den funktion som implementerar metoden. Anrop av ``m(arg-1, arg-2, ..., arg-n)`` är helt likvärdigt med anrop av ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.

source: Like :ref:`function objects <user-defined-funcs>`, bound method objects support getting arbitrary attributes. However, since method attributes are actually stored on the underlying function object (:attr:`method.__func__`), setting method attributes on bound methods is disallowed. Attempting to set an attribute on a method results in an :exc:`AttributeError` being raised. In order to set a method attribute, you need to explicitly set it on the underlying function object:
pt_pt: Tal como os :ref:`objetos função <user-defined-funcs>`, os objetos método ligado suportam a obtenção de atributos arbitrários. No entanto, uma vez que os atributos do método são realmente armazenados no objeto função subjacente (:attr:`method.__func__`), a definição de atributos do método em métodos ligados não é permitida. Tentar definir um atributo num método resulta no lançamento de uma exceção :exc:`AttributeError`. Para definir um atributo de método, é necessário defini-lo explicitamente no objeto função subjacente:
sv: Liksom :ref:`funktionsobjekt <user-defined-funcs>`, stöder bundna metodobjekt att få godtyckliga attribut. Men eftersom metodattribut faktiskt lagras på det underliggande funktionsobjektet (:attr:`method.__func__`) är det inte tillåtet att ställa in metodattribut på bundna metoder. Försök att sätta ett attribut på en metod resulterar i ett :exc:`AttributeError`. För att kunna ställa in ett metodattribut måste du uttryckligen ställa in det på det underliggande funktionsobjektet:

source: >>> class C: ... def method(self): ... pass ... >>> c = C() >>> c.method.whoami = 'my name is method' # can't set on the method Traceback (most recent call last): File "<stdin>", line 1, in <module> AttributeError: 'method' object has no attribute 'whoami' >>> c.method.__func__.whoami = 'my name is method' >>> c.method.whoami 'my name is method'
pt_pt: >>> class C: ... def method(self): ... pass ... >>> c = C() >>> c.method.whoami = 'my name is method' # não é possível definir no método Traceback (most recent call last): File "<stdin>", line 1, in <module> AttributeError: o objeto 'method' não tem o atributo 'whoami' >>> c.method.__func__.whoami = 'my name is method' >>> c.method.whoami 'my name is method'
sv: &gt;&gt;&gt; klass C: ... def method(self): ... pass ... &gt;&gt;&gt; c = C() &gt;&gt;&gt; c.method.whoami = 'mitt namn är method' # kan inte ställas in på metoden Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> AttributeError: Objektet 'method' har inget attribut 'whoami' &gt;&gt;&gt; c.method.__func__.whoami = 'mitt namn är metod' &gt;&gt;&gt; c.method.whoami "mitt namn är metod

source: See :ref:`instance-methods` for more information.
pt_pt: Consulte :ref:`instance-methods` para mais informações.
sv: Se :ref:`instance-methods` för mer information.

source: Code Objects
pt_pt: Objetos código
sv: Kodobjekt

source: Code objects are used by the implementation to represent "pseudo-compiled" executable Python code such as a function body. They differ from function objects because they don't contain a reference to their global execution environment. Code objects are returned by the built-in :func:`compile` function and can be extracted from function objects through their :attr:`~function.__code__` attribute. See also the :mod:`code` module.
pt_pt: Os objetos código são usados pela implementação para representar código Python "pseudo-compilado" executável, como o corpo de uma função. Diferem dos objetos função porque não contêm uma referência ao seu ambiente de execução global. Os objetos código são retornados pela função incorporada :func:`compile` e podem ser extraídos de objetos função através do seu atributo :attr:`~function.__code__`. Consulte também o módulo :mod:`code`.
sv: Kodobjekt används av implementationen för att representera "pseudokompilerad" körbar Python-kod, t.ex. en funktionskropp. De skiljer sig från funktionsobjekt eftersom de inte innehåller någon referens till sin globala exekveringsmiljö. Kodobjekt returneras av den inbyggda :func:`compile`-funktionen och kan extraheras från funktionsobjekt genom deras :attr:`~function.__code__`-attribut. Se även modulen :mod:`code`.

source: A code object can be executed or evaluated by passing it (instead of a source string) to the :func:`exec` or :func:`eval` built-in functions.
pt_pt: Um objeto código pode ser executado ou avaliado passando-o (em vez de uma *string* de origem) às funções incorporadas :func:`exec` ou :func:`eval`.
sv: Ett kodobjekt kan exekveras eller utvärderas genom att skicka det (i stället för en källsträng) till de inbyggda funktionerna :func:`exec` eller :func:`eval`.

source: See :ref:`types` for more information.
pt_pt: Consulte :ref:`types` para mais informações.
sv: Se :ref:`types` för mer information.

source: Type Objects
pt_pt: Objetos Tipo
sv: Typ av objekt

source: Type objects represent the various object types. An object's type is accessed by the built-in function :func:`type`. There are no special operations on types. The standard module :mod:`types` defines names for all standard built-in types.
pt_pt: Os objetos tipo representam os vários tipos de objetos. O tipo de um objeto é acedido pela função incorporada :func:`type`. Não existem operações especiais em tipos. O módulo padrão :mod:`types` define nomes para todos os tipos incorporados padrão.
sv: Typobjekt representerar de olika objekttyperna. Ett objekts typ nås med den inbyggda funktionen :func:`type`. Det finns inga speciella operationer på typer. Standardmodulen :mod:`types` definierar namn för alla inbyggda standardtyper.

source: Types are written like this: ``<class 'int'>``.
pt_pt: Os tipos são escritos assim: ``<class 'int'>``.
sv: Typer skrivs på detta sätt: ``<klass 'int'>``.

source: The Null Object
pt_pt: O Objeto Nulo
sv: Null-objektet

source: This object is returned by functions that don't explicitly return a value. It supports no special operations. There is exactly one null object, named ``None`` (a built-in name). ``type(None)()`` produces the same singleton.
pt_pt: Este objeto é retornado por funções que não retornam explicitamente um valor. Não suporta operações especiais. Existe exatamente um objeto nulo, chamado ``None`` (um nome incorporado). ``type(None)()`` produz o mesmo singleton.
sv: Detta objekt returneras av funktioner som inte uttryckligen returnerar ett värde. Det stöder inga speciella operationer. Det finns exakt ett null-objekt, med namnet ``None`` (ett inbyggt namn). ``type(None)()`` producerar samma singleton.

source: It is written as ``None``.
pt_pt: É escrito como ``None``.
sv: Det är skrivet som ``None``.

source: The Ellipsis Object
pt_pt: O Objeto Reticências
sv: Ellipsis-objektet

source: This object is commonly used by slicing (see :ref:`slicings`). It supports no special operations. There is exactly one ellipsis object, named :const:`Ellipsis` (a built-in name). ``type(Ellipsis)()`` produces the :const:`Ellipsis` singleton.
sv: Detta objekt används vanligen vid skivning (se :ref:`slicings`). Det stöder inga speciella operationer. Det finns exakt ett ellipsis-objekt, med namnet :const:`Ellipsis` (ett inbyggt namn). ``type(Ellipsis)()`` producerar :const:`Ellipsis` singleton.

source: It is written as ``Ellipsis`` or ``...``.
pt_pt: É escrito como ``Ellipsis`` ou ``...``.
sv: Det skrivs som ``Ellipsis`` eller ``...``.

source: The NotImplemented Object
pt_pt: O Objeto NotImplemented
sv: Det icke implementerade objektet

source: This object is returned from comparisons and binary operations when they are asked to operate on types they don't support. See :ref:`comparisons` for more information. There is exactly one :data:`NotImplemented` object. :code:`type(NotImplemented)()` produces the singleton instance.
pt_pt: Este objeto é retornado de comparações e operações binárias quando são solicitadas a operar em tipos que não suportam. Consulte :ref:`comparisons` para mais informações. Existe exatamente um objeto :data:`NotImplemented`. :code:`type(NotImplemented)()` produz a instância singleton.
sv: Detta objekt returneras från jämförelser och binära operationer när de ombeds att använda typer som de inte stöder. Se :ref:`comparisons` för mer information. Det finns exakt ett :data:`NotImplemented`-objekt. :code:`type(NotImplemented)()` producerar singleton-instansen.

source: It is written as :code:`NotImplemented`.
pt_pt: É escrito como :code:`NotImplemented`.
sv: Den är skriven som :code:`NotImplemented`.

source: Internal Objects
pt_pt: Objetos Internos
sv: Interna objekt

source: See :ref:`types` for this information. It describes :ref:`stack frame objects <frame-objects>`, :ref:`traceback objects <traceback-objects>`, and slice objects.
pt_pt: Consulte :ref:`types` para esta informação. Descreve :ref:`objetos de quadro de pilha <frame-objects>`, :ref:`objetos de traceback <traceback-objects>`, e objetos de fatia.
sv: Se :ref:`types` för denna information. Den beskriver :ref:``stack frame objects <frame-objects>`, :ref:``traceback objects <traceback-objects>`, och slice objects.

source: Special Attributes
pt_pt: Atributos Especiais
sv: Särskilda egenskaper

source: The implementation adds a few special read-only attributes to several object types, where they are relevant. Some of these are not reported by the :func:`dir` built-in function.
pt_pt: A implementação adiciona alguns atributos especiais apenas de leitura a vários tipos de objetos, onde são relevantes. Alguns destes não são reportados pela função incorporada :func:`dir`.
sv: Implementationen lägger till några speciella skrivskyddade attribut till flera objekttyper, där de är relevanta. Vissa av dessa rapporteras inte av den inbyggda funktionen :func:`dir`.
