Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: In the table *s* is an instance of a mutable sequence type, *t* is any iterable object and *x* is an arbitrary object that meets any type and value restrictions imposed by *s* (for example, :class:`bytearray` only accepts integers that meet the value restriction ``0 <= x <= 255``).
pt_pt: Na tabela, *s* é uma instância de um tipo de sequência mutável, *t* é qualquer objeto iterável e *x* é um objeto arbitrário que cumpre quaisquer restrições de tipo e valor impostas por *s* (por exemplo, :class:`bytearray` só aceita inteiros que cumprem a restrição de valor ``0 <= x <= 255``).
sv: I tabellen är *s* en instans av en föränderlig sekvenstyp, *t* är ett itererbart objekt och *x* är ett godtyckligt objekt som uppfyller alla typ- och värdebegränsningar som *s* ställer (till exempel accepterar :class:`bytearray` endast heltal som uppfyller värdebegränsningen ``0 <= x <= 255``).

source: item *i* of *s* is replaced by *x*
pt_pt: o item *i* de *s* é substituído por *x*
sv: post *i* i *s* ska ersättas med *x*

source: removes item *i* of *s*
pt_pt: remove o item *i* de *s*
sv: tar bort objekt *i* av *s*

source: slice of *s* from *i* to *j* is replaced by the contents of the iterable *t*
pt_pt: a fatia de *s* de *i* a *j* é substituída pelo conteúdo do iterável *t*
sv: slice av *s* från *i* till *j* ersätts av innehållet i iterabeln *t*

source: removes the elements of ``s[i:j]`` from the list (same as ``s[i:j] = []``)
pt_pt: remove os elementos de ``s[i:j]`` da lista (igual a ``s[i:j] = []``)
sv: tar bort elementen i ``s[i:j]`` från listan (samma som ``s[i:j] = []``)

source: the elements of ``s[i:j:k]`` are replaced by those of *t*
pt_pt: os elementos de ``s[i:j:k]`` são substituídos pelos de *t*
sv: elementen i ``s[i:j:k]`` ersätts med elementen i *t*

source: removes the elements of ``s[i:j:k]`` from the list
pt_pt: remove os elementos de ``s[i:j:k]`` da lista
sv: tar bort elementen i ``s[i:j:k]`` från listan

source: appends *x* to the end of the sequence (same as ``s[len(s):len(s)] = [x]``)
sv: lägger till *x* i slutet av sekvensen (samma som ``s[len(s):len(s)] = [x]``)

source: removes all items from *s* (same as ``del s[:]``)
sv: tar bort alla objekt från *s* (samma som ``del s[:]``)

source: creates a shallow copy of *s* (same as ``s[:]``)
sv: skapar en ytlig kopia av *s* (samma som ``s[:]``)

source: ``s.extend(t)`` or ``s += t``
sv: ``s.extend(t)`` eller ``s += t``

source: extends *s* with the contents of *t* (for the most part the same as ``s[len(s):len(s)] = t``)
pt_pt: estende *s* com o conteúdo de *t* (na maior parte igual a ``s[len(s):len(s)] = t``)
sv: utökar *s* med innehållet i *t* (till största delen samma sak som ``s[len(s):len(s)] = t``)

source: updates *s* with its contents repeated *n* times
pt_pt: atualiza *s* com o seu conteúdo repetido *n* vezes
sv: uppdaterar *s* med dess innehåll upprepade *n* gånger

source: inserts *x* into *s* at the index given by *i* (same as ``s[i:i] = [x]``)
sv: infogar *x* i *s* vid det index som anges av *i* (samma som ``s[i:i] = [x]``)

source: ``s.pop()`` or ``s.pop(i)``
sv: ``s.pop()`` eller ``s.pop(i)``

source: retrieves the item at *i* and also removes it from *s*
sv: hämtar objektet på *i* och tar även bort det från *s*

source: removes the first item from *s* where ``s[i]`` is equal to *x*
sv: tar bort det första objektet från *s* där ``s[i]`` är lika med *x*

source: reverses the items of *s* in place
sv: vänder posterna av *s* på plats

source: If *k* is not equal to ``1``, *t* must have the same length as the slice it is replacing.
pt_pt: Se *k* não for igual a ``1``, *t* deve ter o mesmo comprimento que a fatia que está a substituir.
sv: Om *k* inte är lika med ``1``, måste *t* ha samma längd som den skiva den ersätter.

source: The optional argument *i* defaults to ``-1``, so that by default the last item is removed and returned.
sv: Det valfria argumentet *i* är som standard ``-1``, så att det sista objektet som standard tas bort och returneras.

source: :meth:`remove` raises :exc:`ValueError` when *x* is not found in *s*.
sv: :meth:`remove` ger upphov till :exc:`ValueError` när *x* inte finns i *s*.

source: The :meth:`reverse` method modifies the sequence in place for economy of space when reversing a large sequence. To remind users that it operates by side effect, it does not return the reversed sequence.
sv: Metoden :meth:`reverse` modifierar sekvensen på plats för att spara utrymme vid omkastning av en stor sekvens. För att påminna användarna om att den fungerar som en bieffekt returnerar den inte den omvända sekvensen.

source: :meth:`clear` and :meth:`!copy` are included for consistency with the interfaces of mutable containers that don't support slicing operations (such as :class:`dict` and :class:`set`). :meth:`!copy` is not part of the :class:`collections.abc.MutableSequence` ABC, but most concrete mutable sequence classes provide it.
sv: :meth:`clear` och :meth:`!copy` ingår för att vara konsekventa med gränssnitten för mutabla behållare som inte stöder skivningsoperationer (t.ex. :class:`dict` och :class:`set`). :meth:`!copy` är inte en del av :class:``collections.abc.MutableSequence` ABC, men de flesta konkreta klasser för mutabla sekvenser har det.

source: :meth:`clear` and :meth:`!copy` methods.
sv: metoderna :meth:`clear` och :meth:`!copy`.

source: The value *n* is an integer, or an object implementing :meth:`~object.__index__`. Zero and negative values of *n* clear the sequence. Items in the sequence are not copied; they are referenced multiple times, as explained for ``s * n`` under :ref:`typesseq-common`.
pt_pt: O valor *n* é um inteiro, ou um objeto que implementa :meth:`~object.__index__`. Valores zero e negativos de *n* limpam a sequência. Os itens na sequência não são copiados; são referenciados várias vezes, como explicado para ``s * n`` em :ref:`typesseq-common`.
sv: Värdet *n* är ett heltal eller ett objekt som implementerar :meth:`~object.__index__`. Noll och negativa värden på *n* rensar sekvensen. Objekten i sekvensen kopieras inte; de refereras flera gånger, vilket förklaras för ``s * n`` under :ref:`typesseq-common`.

source: Lists
pt_pt: Listas
sv: Listor

source: Lists are mutable sequences, typically used to store collections of homogeneous items (where the precise degree of similarity will vary by application).
pt_pt: As listas são sequências mutáveis, tipicamente usadas para armazenar coleções de itens homogéneos (onde o grau preciso de semelhança variará conforme a aplicação).
sv: Listor är föränderliga sekvenser som vanligtvis används för att lagra samlingar av homogena objekt (där den exakta graden av likhet varierar beroende på tillämpning).

source: Lists may be constructed in several ways:
pt_pt: As listas podem ser construídas de várias formas:
sv: Listor kan byggas upp på flera olika sätt:

source: Using a pair of square brackets to denote the empty list: ``[]``
pt_pt: Usando um par de parênteses retos para denotar a lista vazia: ``[]``
sv: Använd ett par hakparenteser för att beteckna den tomma listan: ``[]``

source: Using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
pt_pt: Usando parênteses retos, separando itens com vírgulas: ``[a]``, ``[a, b, c]``
sv: Använd hakparenteser och separera objekt med kommatecken: ``[a]``, ``[a, b, c]``

source: Using a list comprehension: ``[x for x in iterable]``
pt_pt: Usando uma *list comprehension*: ``[x for x in iterable]``
sv: Använda en listförståelse: ``[x for x in iterable]``

source: Using the type constructor: ``list()`` or ``list(iterable)``
pt_pt: Usando o construtor de tipo: ``list()`` ou ``list(iterable)``
sv: Använda typkonstruktören: ``list()`` eller ``list(iterable)``

source: The constructor builds a list whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a list, a copy is made and returned, similar to ``iterable[:]``. For example, ``list('abc')`` returns ``['a', 'b', 'c']`` and ``list( (1, 2, 3) )`` returns ``[1, 2, 3]``. If no argument is given, the constructor creates a new empty list, ``[]``.
pt_pt: O construtor cria uma lista cujos itens são os mesmos e na mesma ordem que os itens de *iterable*. *iterable* pode ser uma sequência, um contentor que suporta iteração, ou um objeto iterador. Se *iterable* já for uma lista, é feita uma cópia e retornada, semelhante a ``iterable[:]``. Por exemplo, ``list('abc')`` retorna ``['a', 'b', 'c']`` e ``list( (1, 2, 3) )`` retorna ``[1, 2, 3]``. Se nenhum argumento for fornecido, o construtor cria uma nova lista vazia, ``[]``.
sv: Konstruktorn bygger en lista vars objekt är desamma och i samma ordning som *iterable*:s objekt. *iterable* kan vara antingen en sekvens, en behållare som stöder iteration eller ett iteratorobjekt. Om *iterable* redan är en lista görs en kopia och returneras, på samma sätt som ``iterable[:]``. Till exempel returnerar ``list('abc')`` ``['a', 'b', 'c']`` och ``list( (1, 2, 3) )`` returnerar ``[1, 2, 3]``. Om inget argument anges skapar konstruktören en ny tom lista, ``[]``.

source: Many other operations also produce lists, including the :func:`sorted` built-in.
pt_pt: Muitas outras operações também produzem listas, incluindo a função integrada :func:`sorted`.
sv: Många andra operationer producerar också listor, inklusive den inbyggda :func:`sorted`.

source: Lists implement all of the :ref:`common <typesseq-common>` and :ref:`mutable <typesseq-mutable>` sequence operations. Lists also provide the following additional method:
pt_pt: As listas implementam todas as operações de sequência :ref:`comuns <typesseq-common>` e :ref:`mutáveis <typesseq-mutable>`. As listas também fornecem o seguinte método adicional:
sv: Listor implementerar alla :ref:`common <typesseq-common>` och :ref:`mutable <typesseq-mutable>` sekvensoperationer. Listor tillhandahåller också följande ytterligare metod:

source: This method sorts the list in place, using only ``<`` comparisons between items. Exceptions are not suppressed - if any comparison operations fail, the entire sort operation will fail (and the list will likely be left in a partially modified state).
pt_pt: Este método ordena a lista *in-place*, usando apenas comparações ``<`` entre itens. As exceções não são suprimidas - se alguma operação de comparação falhar, toda a operação de ordenação falhará (e a lista provavelmente ficará num estado parcialmente modificado).
sv: Den här metoden sorterar listan på plats och använder endast ``<``-jämförelser mellan objekten. Undantag undertrycks inte - om någon jämförelseoperation misslyckas, kommer hela sorteringsoperationen att misslyckas (och listan kommer sannolikt att lämnas i ett delvis modifierat tillstånd).

source: :meth:`sort` accepts two arguments that can only be passed by keyword (:ref:`keyword-only arguments <keyword-only_parameter>`):
pt_pt: :meth:`sort` aceita dois argumentos que só podem ser passados por palavra-chave (:ref:`argumentos apenas por palavra-chave <keyword-only_parameter>`):
sv: :meth:`sort` accepterar två argument som endast kan skickas med nyckelord (:ref:`keyword-only arguments <keyword-only_parameter>`):

source: *key* specifies a function of one argument that is used to extract a comparison key from each list element (for example, ``key=str.lower``). The key corresponding to each item in the list is calculated once and then used for the entire sorting process. The default value of ``None`` means that list items are sorted directly without calculating a separate key value.
pt_pt: *key* especifica uma função de um argumento que é usada para extrair uma chave de comparação de cada elemento da lista (por exemplo, ``key=str.lower``). A chave correspondente a cada item na lista é calculada uma vez e depois usada para todo o processo de ordenação. O valor predefinido ``None`` significa que os itens da lista são ordenados diretamente sem calcular um valor de chave separado.
sv: *key* anger en funktion med ett argument som används för att extrahera en jämförelsenyckel från varje listelement (t.ex. ``key=str.lower``). Den nyckel som motsvarar varje objekt i listan beräknas en gång och används sedan för hela sorteringsprocessen. Standardvärdet ``None`` innebär att listobjekten sorteras direkt utan att ett separat nyckelvärde beräknas.

source: The :func:`functools.cmp_to_key` utility is available to convert a 2.x style *cmp* function to a *key* function.
pt_pt: A utilidade :func:`functools.cmp_to_key` está disponível para converter uma função *cmp* no estilo 2.x para uma função *key*.
sv: Verktyget :func:`functools.cmp_to_key` är tillgängligt för att konvertera en *cmp*-funktion i 2.x-stil till en *key*-funktion.

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
pt_pt: *reverse* é um valor booleano. Se definido como ``True``, os elementos da lista são ordenados como se cada comparação fosse invertida.
sv: *reverse* är ett booleanskt värde. Om värdet är satt till ``True`` sorteras listelementen som om varje jämförelse vore omvänd.

source: This method modifies the sequence in place for economy of space when sorting a large sequence. To remind users that it operates by side effect, it does not return the sorted sequence (use :func:`sorted` to explicitly request a new sorted list instance).
pt_pt: Este método modifica a sequência *in-place* para economizar espaço ao ordenar uma grande sequência. Para lembrar os utilizadores de que opera por efeito lateral, não retorna a sequência ordenada (use :func:`sorted` para solicitar explicitamente uma nova instância de lista ordenada).
sv: Denna metod modifierar sekvensen på plats för att spara utrymme vid sortering av en stor sekvens. För att påminna användarna om att den fungerar som en bieffekt returneras inte den sorterade sekvensen (använd :func:`sorted` för att uttryckligen begära en ny instans av en sorterad lista).

source: The :meth:`sort` method is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
pt_pt: O método :meth:`sort` é garantidamente estável. Uma ordenação é estável se garantir não alterar a ordem relativa de elementos que comparam igual --- isto é útil para ordenação em múltiplas passagens (por exemplo, ordenar por departamento, depois por nível salarial).
sv: Metoden :meth:`sort` är garanterat stabil. En sortering är stabil om den garanterar att den inte ändrar den relativa ordningen på element som jämförs lika --- detta är användbart för sortering i flera omgångar (t.ex. sortera efter avdelning, sedan efter lönegrad).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
pt_pt: Para exemplos de ordenação e um breve tutorial sobre ordenação, consulte :ref:`sortinghowto`.
sv: För sorteringsexempel och en kort sorteringshandledning, se :ref:`sortinghowto`.

source: While a list is being sorted, the effect of attempting to mutate, or even inspect, the list is undefined. The C implementation of Python makes the list appear empty for the duration, and raises :exc:`ValueError` if it can detect that the list has been mutated during a sort.
pt_pt: Enquanto uma lista está a ser ordenada, o efeito de tentar mutar, ou mesmo inspecionar, a lista é indefinido. A implementação C do Python faz com que a lista pareça vazia durante a operação, e lança :exc:`ValueError` se conseguir detetar que a lista foi mutada durante a ordenação.
sv: När en lista sorteras är effekten av att försöka mutera, eller till och med inspektera, listan odefinierad. C-implementeringen av Python gör att listan ser tom ut under tiden och ger :exc:`ValueError` om den kan upptäcka att listan har muterats under en sortering.

source: Tuples
pt_pt: Tuplos
sv: Tupler

source: Tuples are immutable sequences, typically used to store collections of heterogeneous data (such as the 2-tuples produced by the :func:`enumerate` built-in). Tuples are also used for cases where an immutable sequence of homogeneous data is needed (such as allowing storage in a :class:`set` or :class:`dict` instance).
pt_pt: Os tuplos são sequências imutáveis, tipicamente usadas para armazenar coleções de dados heterogéneos (como os 2-tuplos produzidos pela função integrada :func:`enumerate`). Os tuplos também são usados em casos onde é necessária uma sequência imutável de dados homogéneos (como permitir armazenamento numa instância :class:`set` ou :class:`dict`).
sv: Tupler är oföränderliga sekvenser som vanligtvis används för att lagra samlingar av heterogena data (t.ex. de 2-tupler som produceras av den inbyggda :func:`enumerate`). Tuples används också i fall där en oföränderlig sekvens av homogena data behövs (t.ex. för att tillåta lagring i en :class:`set`- eller :class:`dict`-instans).

source: Tuples may be constructed in a number of ways:
pt_pt: Os tuplos podem ser construídos de várias formas:
sv: Tupler kan konstrueras på ett antal olika sätt:

source: Using a pair of parentheses to denote the empty tuple: ``()``
pt_pt: Usando um par de parênteses para denotar o tuplo vazio: ``()``
sv: Använda ett par parenteser för att beteckna den tomma tupeln: ``()``

source: Using a trailing comma for a singleton tuple: ``a,`` or ``(a,)``
pt_pt: Usando uma vírgula final para um tuplo singular: ``a,`` ou ``(a,)``
sv: Använda ett efterföljande kommatecken för en singleton-tupel: ``a,`` eller ``(a,)``

source: Separating items with commas: ``a, b, c`` or ``(a, b, c)``
pt_pt: Separando itens com vírgulas: ``a, b, c`` ou ``(a, b, c)``
sv: Separera objekt med kommatecken: ``a, b, c`` eller ``(a, b, c)``

source: Using the :func:`tuple` built-in: ``tuple()`` or ``tuple(iterable)``
pt_pt: Usando a função integrada :func:`tuple`: ``tuple()`` ou ``tuple(iterable)``
sv: Använda den inbyggda :func:`tuple`: ``tuple()`` eller ``tuple(iterable)``

source: The constructor builds a tuple whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a tuple, it is returned unchanged. For example, ``tuple('abc')`` returns ``('a', 'b', 'c')`` and ``tuple( [1, 2, 3] )`` returns ``(1, 2, 3)``. If no argument is given, the constructor creates a new empty tuple, ``()``.
pt_pt: O construtor cria um tuplo cujos itens são os mesmos e na mesma ordem que os itens de *iterable*. *iterable* pode ser uma sequência, um contentor que suporta iteração, ou um objeto iterador. Se *iterable* já for um tuplo, é retornado inalterado. Por exemplo, ``tuple('abc')`` retorna ``('a', 'b', 'c')`` e ``tuple( [1, 2, 3] )`` retorna ``(1, 2, 3)``. Se nenhum argumento for fornecido, o construtor cria um novo tuplo vazio, ``()``.
sv: Konstruktorn bygger en tupel vars poster är desamma och i samma ordning som *iterable*s poster. *iterable* kan vara antingen en sekvens, en behållare som stöder iteration eller ett iteratorobjekt. Om *iterable* redan är en tupel returneras den oförändrad. Till exempel returnerar ``tuple('abc')`` ``('a', 'b', 'c')`` och ``tuple( [1, 2, 3] )`` returnerar ``(1, 2, 3)``. Om inget argument anges skapar konstruktören en ny tom tupel, ``()``.

source: Note that it is actually the comma which makes a tuple, not the parentheses. The parentheses are optional, except in the empty tuple case, or when they are needed to avoid syntactic ambiguity. For example, ``f(a, b, c)`` is a function call with three arguments, while ``f((a, b, c))`` is a function call with a 3-tuple as the sole argument.
pt_pt: Note que é na verdade a vírgula que cria um tuplo, não os parênteses. Os parênteses são opcionais, exceto no caso do tuplo vazio, ou quando são necessários para evitar ambiguidade sintática. Por exemplo, ``f(a, b, c)`` é uma chamada de função com três argumentos, enquanto ``f((a, b, c))`` é uma chamada de função com um 3-tuplo como argumento único.
sv: Observera att det faktiskt är kommatecknet som skapar en tupel, inte parentesen. Parenteserna är valfria, utom i fallet med en tom tupel, eller när de behövs för att undvika syntaktisk tvetydighet. Till exempel är ``f(a, b, c)`` ett funktionsanrop med tre argument, medan ``f((a, b, c))`` är ett funktionsanrop med en 3-tupel som enda argument.

source: Tuples implement all of the :ref:`common <typesseq-common>` sequence operations.
pt_pt: Os tuplos implementam todas as :ref:`operações comuns <typesseq-common>` de sequência.
sv: Tupler implementerar alla :ref:`common <typesseq-common>` sekvensoperationer.

source: For heterogeneous collections of data where access by name is clearer than access by index, :func:`collections.namedtuple` may be a more appropriate choice than a simple tuple object.
pt_pt: Para coleções heterogéneas de dados onde o acesso por nome é mais claro do que o acesso por índice, :func:`collections.namedtuple` pode ser uma escolha mais apropriada do que um simples objeto tuplo.
sv: För heterogena samlingar av data där åtkomst via namn är tydligare än åtkomst via index kan :func:`collections.namedtuple` vara ett lämpligare val än ett enkelt tuple-objekt.

source: Ranges
pt_pt: Intervalos
sv: Intervaller

source: The :class:`range` type represents an immutable sequence of numbers and is commonly used for looping a specific number of times in :keyword:`for` loops.
pt_pt: O tipo :class:`range` representa uma sequência imutável de números e é comumente usado para iterar um número específico de vezes em ciclos :keyword:`for`.
sv: Typen :class:`range` representerar en oföränderlig sekvens av tal och används ofta för att loopa ett visst antal gånger i :keyword:`for`-loopar.

source: The arguments to the range constructor must be integers (either built-in :class:`int` or any object that implements the :meth:`~object.__index__` special method). If the *step* argument is omitted, it defaults to ``1``. If the *start* argument is omitted, it defaults to ``0``. If *step* is zero, :exc:`ValueError` is raised.
pt_pt: Os argumentos para o construtor de intervalo devem ser inteiros (ou o :class:`int` integrado ou qualquer objeto que implemente o método especial :meth:`~object.__index__`). Se o argumento *step* for omitido, o valor predefinido é ``1``. Se o argumento *start* for omitido, o valor predefinido é ``0``. Se *step* for zero, é lançada uma exceção :exc:`ValueError`.
sv: Argumenten till intervallkonstruktören måste vara heltal (antingen inbyggd :class:`int` eller något objekt som implementerar specialmetoden :meth:`~object.__index__`). Om argumentet *step* utelämnas är standardvärdet ``1``. Om argumentet *start* utelämnas är standardvärdet ``0``. Om *step* är noll genereras :exc:`ValueError`.

source: For a positive *step*, the contents of a range ``r`` are determined by the formula ``r[i] = start + step*i`` where ``i >= 0`` and ``r[i] < stop``.
pt_pt: Para um *step* positivo, o conteúdo de um intervalo ``r`` é determinado pela fórmula ``r[i] = start + step*i`` onde ``i >= 0`` e ``r[i] < stop``.
sv: För ett positivt *steg* bestäms innehållet i ett intervall ``r`` av formeln ``r[i] = start + steg*i`` där ``i >= 0`` och ``r[i] < stopp``.

source: For a negative *step*, the contents of the range are still determined by the formula ``r[i] = start + step*i``, but the constraints are ``i >= 0`` and ``r[i] > stop``.
pt_pt: Para um *step* negativo, o conteúdo do intervalo ainda é determinado pela fórmula ``r[i] = start + step*i``, mas as restrições são ``i >= 0`` e ``r[i] > stop``.
sv: För ett negativt *steg* bestäms innehållet i intervallet fortfarande av formeln ``r[i] = start + steg*i``, men begränsningarna är ``i >= 0`` och ``r[i] > stopp``.
