Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: float also accepts the strings "nan" and "inf" with an optional prefix "+" or "-" for Not a Number (NaN) and positive or negative infinity.
pt_pt: float também aceita as *strings* "nan" e "inf" com um prefixo opcional "+" ou "-" para Not a Number (NaN) e infinito positivo ou negativo.
sv: float accepterar också strängarna "nan" och "inf" med ett valfritt prefix "+" eller "-" för Not a Number (NaN) och positiv eller negativ oändlighet.

source: Python defines ``pow(0, 0)`` and ``0 ** 0`` to be ``1``, as is common for programming languages.
pt_pt: O Python define ``pow(0, 0)`` e ``0 ** 0`` como ``1``, como é comum em linguagens de programação.
sv: Python definierar ``pow(0, 0)`` och ``0 ** 0`` som ``1``, vilket är vanligt för programmeringsspråk.

source: The numeric literals accepted include the digits ``0`` to ``9`` or any Unicode equivalent (code points with the ``Nd`` property).
pt_pt: Os literais numéricos aceites incluem os dígitos ``0`` a ``9`` ou qualquer equivalente Unicode (pontos de código com a propriedade ``Nd``).
sv: De numeriska literaler som accepteras inkluderar siffrorna ``0`` till ``9`` eller någon Unicode-ekvivalent (kodpunkter med egenskapen ``Nd``).

source: See `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ for a complete list of code points with the ``Nd`` property.
pt_pt: Consulte `o Padrão Unicode <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ para uma lista completa de pontos de código com a propriedade ``Nd``.
sv: Se `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ för en fullständig lista över kodpunkter med egenskapen ``Nd``.

source: All :class:`numbers.Real` types (:class:`int` and :class:`float`) also include the following operations:
pt_pt: Todos os tipos :class:`numbers.Real` (:class:`int` e :class:`float`) também incluem as seguintes operações:
sv: Alla :class:`numbers.Real`-typer (:class:`int` och :class:`float`) innehåller också följande operationer:

source: *x* truncated to :class:`~numbers.Integral`
pt_pt: *x* truncado para :class:`~numbers.Integral`
sv: *x* trunkerad till :class:`~numbers.Integral`

source: *x* rounded to *n* digits, rounding half to even. If *n* is omitted, it defaults to 0.
pt_pt: *x* arredondado a *n* dígitos, arredondando metade para par. Se *n* for omitido, o valor predefinido é 0.
sv: *x* avrundat till *n* siffror, avrundning hälften till jämnt. Om *n* utelämnas är standardvärdet 0.

source: the greatest :class:`~numbers.Integral` <= *x*
pt_pt: o maior :class:`~numbers.Integral` <= *x*
sv: den största :class:`~numbers.Integral` <= *x*

source: the least :class:`~numbers.Integral` >= *x*
pt_pt: o menor :class:`~numbers.Integral` >= *x*
sv: den minsta :class:`~numbers.Integral` >= *x*

source: For additional numeric operations see the :mod:`math` and :mod:`cmath` modules.
pt_pt: Para operações numéricas adicionais, consulte os módulos :mod:`math` e :mod:`cmath`.
sv: För ytterligare numeriska operationer, se modulerna :mod:`math` och :mod:`cmath`.

source: Bitwise Operations on Integer Types
pt_pt: Operações bit a bit em tipos inteiros
sv: Bitvisa operationer på heltalstyper

source: Bitwise operations only make sense for integers. The result of bitwise operations is calculated as though carried out in two's complement with an infinite number of sign bits.
pt_pt: As operações bit a bit só fazem sentido para inteiros. O resultado das operações bit a bit é calculado como se fosse realizado em complemento para dois com um número infinito de bits de sinal.
sv: Bitvisa operationer är bara meningsfulla för heltal. Resultatet av bitvisa operationer beräknas som om de utförts i tvåkomplement med ett oändligt antal teckenbitar.

source: The priorities of the binary bitwise operations are all lower than the numeric operations and higher than the comparisons; the unary operation ``~`` has the same priority as the other unary numeric operations (``+`` and ``-``).
pt_pt: As prioridades das operações bit a bit binárias são todas inferiores às operações numéricas e superiores às comparações; a operação unária ``~`` tem a mesma prioridade que as outras operações numéricas unárias (``+`` e ``-``).
sv: Prioriteringarna för de binära bitvisa operationerna är alla lägre än de numeriska operationerna och högre än jämförelserna; den unära operationen ``~`` har samma prioritet som de andra unära numeriska operationerna (``+`` och ``-``).

source: This table lists the bitwise operations sorted in ascending priority:
pt_pt: Esta tabela lista as operações bit a bit ordenadas por prioridade ascendente:
sv: I denna tabell listas de bitvisa operationerna sorterade i stigande prioritetsordning:

source: bitwise :dfn:`or` of *x* and *y*
pt_pt: OR bit a bit de *x* e *y*
sv: bitvis :dfn:`or` av *x* och *y*

source: bitwise :dfn:`exclusive or` of *x* and *y*
pt_pt: XOR bit a bit de *x* e *y*
sv: bitvis :dfn:`exklusivt eller` av *x* och *y*

source: bitwise :dfn:`and` of *x* and *y*
pt_pt: AND bit a bit de *x* e *y*
sv: bitvis :dfn:`och` av *x* och *y*

source: *x* shifted left by *n* bits
pt_pt: *x* deslocado à esquerda por *n* bits
sv: *x* vänsterförskjutet med *n* bitar

source: *x* shifted right by *n* bits
pt_pt: *x* deslocado à direita por *n* bits
sv: *x* högerförskjutet med *n* bitar

source: the bits of *x* inverted
pt_pt: os bits de *x* invertidos
sv: bitarna i *x* inverterade

source: Negative shift counts are illegal and cause a :exc:`ValueError` to be raised.
pt_pt: Contagens de deslocamento negativas são ilegais e causam uma exceção :exc:`ValueError`.
sv: Negativa skifträkningar är olagliga och orsakar ett :exc:`ValueError`.

source: A left shift by *n* bits is equivalent to multiplication by ``pow(2, n)``.
pt_pt: Um deslocamento à esquerda por *n* bits é equivalente à multiplicação por ``pow(2, n)``.
sv: En vänsterförskjutning med *n* bitar är likvärdig med multiplikation med ``pow(2, n)``.

source: A right shift by *n* bits is equivalent to floor division by ``pow(2, n)``.
pt_pt: Um deslocamento à direita por *n* bits é equivalente à divisão inteira por ``pow(2, n)``.
sv: En högerförskjutning med *n* bitar motsvarar en vågdivision med ``pow(2, n)``.

source: Performing these calculations with at least one extra sign extension bit in a finite two's complement representation (a working bit-width of ``1 + max(x.bit_length(), y.bit_length())`` or more) is sufficient to get the same result as if there were an infinite number of sign bits.
pt_pt: Realizar estes cálculos com pelo menos um bit extra de extensão de sinal numa representação finita de complemento para dois (uma largura de bits de trabalho de ``1 + max(x.bit_length(), y.bit_length())`` ou mais) é suficiente para obter o mesmo resultado como se houvesse um número infinito de bits de sinal.
sv: Att utföra dessa beräkningar med minst en extra teckenförlängningsbit i en ändlig tvåkomplementrepresentation (en fungerande bitbredd på ``1 + max(x.bit_length(), y.bit_length())`` eller mer) är tillräckligt för att få samma resultat som om det fanns ett oändligt antal teckenbitar.

source: Additional Methods on Integer Types
pt_pt: Métodos adicionais em tipos inteiros
sv: Ytterligare metoder för heltalstyper

source: The int type implements the :class:`numbers.Integral` :term:`abstract base class`. In addition, it provides a few more methods:
pt_pt: O tipo int implementa a :class:`numbers.Integral` :term:`classe base abstrata`. Além disso, fornece alguns métodos adicionais:
sv: Typen int implementerar :class:`numbers.Integral` :term:`abstrakt basklass`. Dessutom tillhandahåller den några fler metoder:

source: Return the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros::
pt_pt: Retorna o número de bits necessários para representar um inteiro em binário, excluindo o sinal e os zeros à esquerda:
sv: Returnerar det antal bitar som krävs för att representera ett heltal i binär form, exklusive tecken och inledande nollor::

source: >>> n = -37 >>> bin(n) '-0b100101' >>> n.bit_length() 6
sv: >>> n = -37 >>> bin(n) '-0b100101' >>> n.bit_längd() 6

source: More precisely, if ``x`` is nonzero, then ``x.bit_length()`` is the unique positive integer ``k`` such that ``2**(k-1) <= abs(x) < 2**k``. Equivalently, when ``abs(x)`` is small enough to have a correctly rounded logarithm, then ``k = 1 + int(log(abs(x), 2))``. If ``x`` is zero, then ``x.bit_length()`` returns ``0``.
pt_pt: Mais precisamente, se ``x`` não for zero, então ``x.bit_length()`` é o único inteiro positivo ``k`` tal que ``2**(k-1) <= abs(x) < 2**k``. De forma equivalente, quando ``abs(x)`` é suficientemente pequeno para ter um logaritmo corretamente arredondado, então ``k = 1 + int(log(abs(x), 2))``. Se ``x`` for zero, então ``x.bit_length()`` retorna ``0``.
sv: Närmare bestämt, om ``x`` inte är noll, så är ``x.bit_length()`` det unika positiva heltalet ``k`` så att ``2**(k-1) <= abs(x) < 2**k``. På motsvarande sätt gäller att när ``abs(x)`` är tillräckligt litet för att ha en korrekt avrundad logaritm, så är ``k = 1 + int(log(abs(x), 2))``. Om ``x`` är noll, så returnerar ``x.bit_length()`` ``0``.

source: Equivalent to::
pt_pt: Equivalente a::
sv: Motsvarar::

source: def bit_length(self): s = bin(self) # binary representation: bin(-37) --> '-0b100101' s = s.lstrip('-0b') # remove leading zeros and minus sign return len(s) # len('100101') --> 6
pt_pt: def bit_length(self): s = bin(self) # representação binária: bin(-37) --> '-0b100101' s = s.lstrip('-0b') # remove zeros à esquerda e sinal de menos return len(s) # len('100101') --> 6
sv: def bit_längd(self): s = bin(self) # binär representation: bin(-37) --> '-0b100101' s = s.lstrip('-0b') # ta bort ledande nollor och minustecken return len(s) # len('100101') --> 6

source: Return the number of ones in the binary representation of the absolute value of the integer. This is also known as the population count. Example::
pt_pt: Retorna o número de uns na representação binária do valor absoluto do inteiro. Isto também é conhecido como contagem de população. Exemplo:
sv: Returnerar antalet ettor i den binära representationen av heltalets absoluta värde. Detta är också känt som populationsantalet. Exempel::

source: >>> n = 19 >>> bin(n) '0b10011' >>> n.bit_count() 3 >>> (-n).bit_count() 3
sv: >>> n = 19 >>> bin(n) '0b10011' >>> n.bit_räkning() 3 >>> (-n).bit_count() 3

source: Return an array of bytes representing an integer.
pt_pt: Retorna um *array* de bytes que representa um inteiro.
sv: Returnerar en array av bytes som representerar ett heltal.

source: The integer is represented using *length* bytes, and defaults to 1. An :exc:`OverflowError` is raised if the integer is not representable with the given number of bytes.
pt_pt: O inteiro é representado usando *length* bytes, e o valor predefinido é 1. Uma exceção :exc:`OverflowError` é lançada se o inteiro não for representável com o número dado de bytes.
sv: Heltalet representeras med *längd* byte och standardvärdet är 1. Ett :exc:`OverflowError` uppstår om heltalet inte kan representeras med det givna antalet byte.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array.
pt_pt: O argumento *byteorder* determina a ordem dos bytes usada para representar o inteiro, e o valor predefinido é ``"big"``. Se *byteorder* for ``"big"``, o byte mais significativo está no início do *array* de bytes. Se *byteorder* for ``"little"``, o byte mais significativo está no final do *array* de bytes.
sv: Argumentet *byteorder* bestämmer den byteordning som används för att representera heltalet, och standardvärdet är ``"big"``. Om *byteorder* är ``"big"`` ligger den mest signifikanta byten i början av bytearrayen. Om *byteorder* är ``"little"`` ligger den mest signifikanta byten i slutet av bytearrayen.

source: The *signed* argument determines whether two's complement is used to represent the integer. If *signed* is ``False`` and a negative integer is given, an :exc:`OverflowError` is raised. The default value for *signed* is ``False``.
pt_pt: O argumento *signed* determina se o complemento para dois é usado para representar o inteiro. Se *signed* for ``False`` e for fornecido um inteiro negativo, é lançada uma exceção :exc:`OverflowError`. O valor predefinido para *signed* é ``False``.
sv: Argumentet *signed* avgör om tvåkomplement används för att representera heltalet. Om *signed* är ``False`` och ett negativt heltal anges, uppstår ett :exc:`OverflowError`. Standardvärdet för *signed* är ``False``.

source: The default values can be used to conveniently turn an integer into a single byte object::
pt_pt: Os valores predefinidos podem ser usados para converter convenientemente um inteiro num objeto de byte único:
sv: Standardvärdena kan användas för att enkelt omvandla ett heltal till ett objekt med en byte::

source: However, when using the default arguments, don't try to convert a value greater than 255 or you'll get an :exc:`OverflowError`.
pt_pt: No entanto, ao usar os argumentos predefinidos, não tente converter um valor maior que 255 ou obterá uma exceção :exc:`OverflowError`.
sv: När du använder standardargumenten ska du dock inte försöka konvertera ett värde som är större än 255, för då får du ett :exc:`OverflowError`.

source: def to_bytes(n, length=1, byteorder='big', signed=False): if byteorder == 'little': order = range(length) elif byteorder == 'big': order = reversed(range(length)) else: raise ValueError("byteorder must be either 'little' or 'big'") return bytes((n >> i*8) & 0xff for i in order)
sv: def to_bytes(n, length=1, byteorder='big', signed=False): om byteorder == 'liten': order = intervall(längd) elif byteorder == 'stor': ordning = omvänd(intervall(längd)) else: raise ValueError("byteorder måste vara antingen 'liten' eller 'stor'") return bytes((n >> i*8) & 0xff for i in order)

source: Added default argument values for ``length`` and ``byteorder``.
pt_pt: Adicionados valores de argumento predefinidos para ``length`` e ``byteorder``.
sv: Lagt till standardargumentvärden för ``length`` och ``byteorder``.

source: Return the integer represented by the given array of bytes.
pt_pt: Retorna o inteiro representado pelo *array* de bytes fornecido.
sv: Returnerar det heltal som representeras av den givna arrayen av bytes.

source: The argument *bytes* must either be a :term:`bytes-like object` or an iterable producing bytes.
pt_pt: O argumento *bytes* deve ser um :term:`objeto do tipo bytes` ou um iterável que produz bytes.
sv: Argumentet *bytes* måste antingen vara ett :term:`bytesliknande objekt` eller en iterabel som producerar bytes.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array. To request the native byte order of the host system, use :data:`sys.byteorder` as the byte order value.
pt_pt: O argumento *byteorder* determina a ordem dos bytes usada para representar o inteiro, e o valor predefinido é ``"big"``. Se *byteorder* for ``"big"``, o byte mais significativo está no início do *array* de bytes. Se *byteorder* for ``"little"``, o byte mais significativo está no final do *array* de bytes. Para solicitar a ordem de bytes nativa do sistema hospedeiro, use :data:`sys.byteorder` como o valor da ordem de bytes.
sv: Argumentet *byteorder* bestämmer den byteordning som används för att representera heltalet, och standardvärdet är ``"big"``. Om *byteorder* är ``"big"`` ligger den mest signifikanta byten i början av bytearrayen. Om *byteorder* är ``"little"`` ligger den mest betydelsefulla byten i slutet av bytearrayen. Om du vill begära värdsystemets inbyggda byteordning använder du :data:`sys.byteorder` som värde för byteordningen.

source: The *signed* argument indicates whether two's complement is used to represent the integer.
pt_pt: O argumento *signed* indica se o complemento para dois é usado para representar o inteiro.
sv: Argumentet *signed* anger om tvåkomplement ska användas för att representera heltalet.

source: def from_bytes(bytes, byteorder='big', signed=False): if byteorder == 'little': little_ordered = list(bytes) elif byteorder == 'big': little_ordered = list(reversed(bytes)) else: raise ValueError("byteorder must be either 'little' or 'big'") n = sum(b << i*8 for i, b in enumerate(little_ordered)) if signed and little_ordered and (little_ordered[-1] & 0x80): n -= 1 << 8*len(little_ordered) return n
sv: def from_bytes(bytes, byteorder='big', signed=False): if byteorder == 'little': little_ordered = list(byte) elif byteorder == 'big': little_ordered = list(reversed(bytes)) else: raise ValueError("byteorder måste vara antingen 'liten' eller 'stor'") n = sum(b << i*8 for i, b in enumerate(little_ordered)) om signerad och little_ordered och (little_ordered[-1] & 0x80): n -= 1 << 8*len(little_ordered) returnera n

source: Added default argument value for ``byteorder``.
pt_pt: Adicionado valor de argumento predefinido para ``byteorder``.
sv: Lagt till standardargumentvärde för ``byteorder``.

source: Return a pair of integers whose ratio is equal to the original integer and has a positive denominator. The integer ratio of integers (whole numbers) is always the integer as the numerator and ``1`` as the denominator.
pt_pt: Retorna um par de inteiros cuja razão é igual ao inteiro original e tem um denominador positivo. A razão inteira de inteiros (números inteiros) é sempre o inteiro como numerador e ``1`` como denominador.
sv: Returnerar ett par heltal vars kvot är lika med det ursprungliga heltalet och har en positiv nämnare. Heltalsförhållandet mellan heltal (hela tal) är alltid heltalet i täljaren och ``1`` i nämnaren.

source: Returns ``True``. Exists for duck type compatibility with :meth:`float.is_integer`.
pt_pt: Retorna ``True``. Existe para compatibilidade de tipo pato com :meth:`float.is_integer`.
sv: Returnerar ``True``. Existerar för kompatibilitet med :meth:`float.is_integer`.

source: Additional Methods on Float
pt_pt: Métodos adicionais em Float
sv: Ytterligare metoder på Float

source: The float type implements the :class:`numbers.Real` :term:`abstract base class`. float also has the following additional methods.
pt_pt: O tipo float implementa a :class:`numbers.Real` :term:`classe base abstrata`. float também tem os seguintes métodos adicionais.
sv: Typen float implementerar :class:`numbers.Real` :term:`abstrakt basklass`. float har också följande ytterligare metoder.

source: Class method to return a floating-point number constructed from a number *x*.
sv: Klassmetod för att returnera ett flyttal konstruerat från ett tal *x*.

source: If the argument is an integer or a floating-point number, a floating-point number with the same value (within Python's floating-point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
sv: Om argumentet är ett heltal eller ett flyttal, returneras ett flyttal med samma värde (inom Pythons flyttalsprecision). Om argumentet ligger utanför intervallet för en Python-flottör, kommer ett :exc:`OverflowError` att uppstå.

source: For a general Python object ``x``, ``float.from_number(x)`` delegates to ``x.__float__()``. If :meth:`~object.__float__` is not defined then it falls back to :meth:`~object.__index__`.
sv: För ett allmänt Python-objekt ``x`` delegerar ``float.from_number(x)`` till ``x.__float__()``. Om :meth:`~object.__float__` inte är definierad faller den tillbaka till :meth:`~object.__index__`.

source: Return a pair of integers whose ratio is exactly equal to the original float. The ratio is in lowest terms and has a positive denominator. Raises :exc:`OverflowError` on infinities and a :exc:`ValueError` on NaNs.
pt_pt: Retorna um par de inteiros cuja razão é exatamente igual ao float original. A razão está nos termos mais baixos e tem um denominador positivo. Lança :exc:`OverflowError` em infinitos e :exc:`ValueError` em NaNs.
sv: Returnerar ett par heltal vars kvot är exakt lika med den ursprungliga floaten. Kvoten är i lägsta termer och har en positiv nämnare. Utlöser :exc:`OverflowError` på oändligheter och ett :exc:`ValueError` på NaNs.

source: Return ``True`` if the float instance is finite with integral value, and ``False`` otherwise::
pt_pt: Retorna ``True`` se a instância float for finita com valor integral, e ``False`` caso contrário:
sv: Returnerar ``True`` om float-instansen är finit med integrerat värde, och ``False`` annars::

source: >>> (-2.0).is_integer() True >>> (3.2).is_integer() False
sv: >>> (-2.0).is_integer() Sant >>> (3,2).is_integer() Falskt

source: Two methods support conversion to and from hexadecimal strings. Since Python's floats are stored internally as binary numbers, converting a float to or from a *decimal* string usually involves a small rounding error. In contrast, hexadecimal strings allow exact representation and specification of floating-point numbers. This can be useful when debugging, and in numerical work.
pt_pt: Dois métodos suportam conversão para e a partir de *strings* hexadecimais. Como os floats do Python são armazenados internamente como números binários, converter um float para ou a partir de uma *string* decimal geralmente envolve um pequeno erro de arredondamento. Em contraste, as *strings* hexadecimais permitem representação e especificação exatas de números de ponto flutuante. Isto pode ser útil na depuração e em trabalho numérico.
sv: Två metoder stöder konvertering till och från hexadecimala strängar. Eftersom Pythons flyttal lagras internt som binära tal innebär konvertering av ett flyttal till eller från en *decimal* sträng vanligtvis ett litet avrundningsfel. Däremot tillåter hexadecimala strängar exakt representation och specifikation av flyttal. Detta kan vara användbart vid felsökning och i numeriskt arbete.

source: Return a representation of a floating-point number as a hexadecimal string. For finite floating-point numbers, this representation will always include a leading ``0x`` and a trailing ``p`` and exponent.
pt_pt: Retorna uma representação de um número de ponto flutuante como uma *string* hexadecimal. Para números de ponto flutuante finitos, esta representação incluirá sempre um ``0x`` inicial e um ``p`` final e expoente.
sv: Returnerar en representation av ett flyttal som en hexadecimal sträng. För finita flyttal kommer denna representation alltid att innehålla en inledande ``0x`` och en efterföljande ``p`` och exponent.

source: Class method to return the float represented by a hexadecimal string *s*. The string *s* may have leading and trailing whitespace.
pt_pt: Método de classe para retornar o float representado por uma *string* hexadecimal *s*. A *string* *s* pode ter espaços em branco iniciais e finais.
sv: Klassmetod för att returnera den flottör som representeras av en hexadecimal sträng *s*. Strängen *s* kan ha inledande och avslutande blanksteg.

source: Note that :meth:`float.hex` is an instance method, while :meth:`float.fromhex` is a class method.
pt_pt: Note que :meth:`float.hex` é um método de instância, enquanto :meth:`float.fromhex` é um método de classe.
sv: Observera att :meth:`float.hex` är en instansmetod, medan :meth:`float.fromhex` är en klassmetod.

source: A hexadecimal string takes the form::
pt_pt: Uma *string* hexadecimal tem a forma:
sv: En hexadecimal sträng har formen::
