Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: [sign] ['0x'] integer ['.' fraction] ['p' exponent]
pt_pt: [sinal] ['0x'] inteiro ['.' fração] ['p' expoente]
sv: [tecken] ['0x'] heltal ['.' bråk] ['p' exponent]

source: where the optional ``sign`` may by either ``+`` or ``-``, ``integer`` and ``fraction`` are strings of hexadecimal digits, and ``exponent`` is a decimal integer with an optional leading sign. Case is not significant, and there must be at least one hexadecimal digit in either the integer or the fraction. This syntax is similar to the syntax specified in section 6.4.4.2 of the C99 standard, and also to the syntax used in Java 1.5 onwards. In particular, the output of :meth:`float.hex` is usable as a hexadecimal floating-point literal in C or Java code, and hexadecimal strings produced by C's ``%a`` format character or Java's ``Double.toHexString`` are accepted by :meth:`float.fromhex`.
pt_pt: onde o ``sign`` opcional pode ser ``+`` ou ``-``, ``integer`` e ``fraction`` são *strings* de dígitos hexadecimais, e ``exponent`` é um inteiro decimal com um sinal inicial opcional. A caixa não é significativa, e deve haver pelo menos um dígito hexadecimal no inteiro ou na fração. Esta sintaxe é semelhante à sintaxe especificada na secção 6.4.4.2 do padrão C99, e também à sintaxe usada no Java 1.5 e posteriores. Em particular, a saída de :meth:`float.hex` pode ser usada como um literal de ponto flutuante hexadecimal em código C ou Java, e as *strings* hexadecimais produzidas pelo carácter de formato ``%a`` do C ou pelo ``Double.toHexString`` do Java são aceites por :meth:`float.fromhex`.
sv: där det valfria ``tecknet`` kan vara antingen ``+`` eller ``-``, ``integer`` och ``fraction`` är strängar av hexadecimala siffror, och ``exponent`` är ett decimalt heltal med ett valfritt inledande tecken. Versaler är oviktiga och det måste finnas minst en hexadecimal siffra i antingen heltalet eller bråket. Denna syntax liknar den syntax som anges i avsnitt 6.4.4.2 i C99-standarden, och även den syntax som används i Java 1.5 och framåt. I synnerhet kan resultatet från :meth:`float.hex` användas som en hexadecimal flyttalslitteral i C- eller Java-kod, och hexadecimala strängar som produceras av C:s ``%a`` formattecken eller Javas ``Double.toHexString`` accepteras av :meth:`float.fromhex`.

source: Note that the exponent is written in decimal rather than hexadecimal, and that it gives the power of 2 by which to multiply the coefficient. For example, the hexadecimal string ``0x3.a7p10`` represents the floating-point number ``(3 + 10./16 + 7./16**2) * 2.0**10``, or ``3740.0``::
pt_pt: Note que o expoente é escrito em decimal em vez de hexadecimal, e que indica a potência de 2 pela qual multiplicar o coeficiente. Por exemplo, a *string* hexadecimal ``0x3.a7p10`` representa o número de ponto flutuante ``(3 + 10./16 + 7./16**2) * 2.0**10``, ou ``3740.0``:
sv: Observera att exponenten skrivs i decimalform i stället för hexadecimalform och att den anger med vilken potens 2 koefficienten ska multipliceras. Till exempel representerar den hexadecimala strängen ``0x3.a7p10`` flyttalstalet ``(3 + 10./16 + 7./16**2) * 2,0**10``, eller ``3740,0``::

source: Applying the reverse conversion to ``3740.0`` gives a different hexadecimal string representing the same number::
pt_pt: Aplicar a conversão inversa a ``3740.0`` dá uma *string* hexadecimal diferente que representa o mesmo número:
sv: Genom att tillämpa den omvända konverteringen på ``3740.0`` får man en annan hexadecimal sträng som representerar samma nummer::

source: Additional Methods on Complex
sv: Ytterligare metoder för komplexa

source: The :class:`!complex` type implements the :class:`numbers.Complex` :term:`abstract base class`. :class:`!complex` also has the following additional methods.
sv: Typen :class:`!complex` implementerar :class:`numbers.Complex` :term:`abstrakt basklass`. :class:`!complex` har även följande ytterligare metoder.

source: Class method to convert a number to a complex number.
sv: Klassmetod för att konvertera ett tal till ett komplext tal.

source: For a general Python object ``x``, ``complex.from_number(x)`` delegates to ``x.__complex__()``. If :meth:`~object.__complex__` is not defined then it falls back to :meth:`~object.__float__`. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`.
sv: För ett allmänt Python-objekt ``x`` delegerar ``complex.from_number(x)`` till ``x.__complex__()``. Om :meth:`~object.__complex__` inte är definierad så faller den tillbaka till :meth:`~object.__float__`. Om :meth:`!__float__` inte är definierat faller det tillbaka till :meth:`~object.__index__`.

source: Hashing of numeric types
pt_pt: Hashing de tipos numéricos
sv: Hashning av numeriska typer

source: For numbers ``x`` and ``y``, possibly of different types, it's a requirement that ``hash(x) == hash(y)`` whenever ``x == y`` (see the :meth:`~object.__hash__` method documentation for more details). For ease of implementation and efficiency across a variety of numeric types (including :class:`int`, :class:`float`, :class:`decimal.Decimal` and :class:`fractions.Fraction`) Python's hash for numeric types is based on a single mathematical function that's defined for any rational number, and hence applies to all instances of :class:`int` and :class:`fractions.Fraction`, and all finite instances of :class:`float` and :class:`decimal.Decimal`. Essentially, this function is given by reduction modulo ``P`` for a fixed prime ``P``. The value of ``P`` is made available to Python as the :attr:`~sys.hash_info.modulus` attribute of :data:`sys.hash_info`.
pt_pt: Para números ``x`` e ``y``, possivelmente de tipos diferentes, é um requisito que ``hash(x) == hash(y)`` sempre que ``x == y`` (consulte a documentação do método :meth:`~object.__hash__` para mais detalhes). Para facilitar a implementação e a eficiência em vários tipos numéricos (incluindo :class:`int`, :class:`float`, :class:`decimal.Decimal` e :class:`fractions.Fraction`), o *hash* do Python para tipos numéricos é baseado numa única função matemática que é definida para qualquer número racional, e portanto aplica-se a todas as instâncias de :class:`int` e :class:`fractions.Fraction`, e a todas as instâncias finitas de :class:`float` e :class:`decimal.Decimal`. Essencialmente, esta função é dada pela redução módulo ``P`` para um primo fixo ``P``. O valor de ``P`` é disponibilizado ao Python como o atributo :attr:`~sys.hash_info.modulus` de :data:`sys.hash_info`.
sv: För talen ``x`` och ``y``, eventuellt av olika typer, är det ett krav att ``hash(x) == hash(y)`` när ``x == y`` (se :meth:`~object.__hash__` metoddokumentation för mer information). För att underlätta implementering och effektivitet över en mängd olika numeriska typer (inklusive :class:`int`, :class:`float`, :class:`decimal.Decimal` och :class:`fractions.Fraction`) Pythons hash för numeriska typer baseras på en enda matematisk funktion som är definierad för alla rationella tal, och gäller därför för alla instanser av :class:`int` och :class:`fractions.Fraction`, och alla ändliga instanser av :class:`float` och :class:`decimal.Decimal`. I huvudsak ges denna funktion genom reduktion modulo ``P`` för ett fast primtal ``P``. Värdet av ``P`` görs tillgängligt för Python som attributet :attr:`~sys.hash_info.modulus` av :data:`sys.hash_info`.

source: Currently, the prime used is ``P = 2**31 - 1`` on machines with 32-bit C longs and ``P = 2**61 - 1`` on machines with 64-bit C longs.
pt_pt: Atualmente, o primo usado é ``P = 2**31 - 1`` em máquinas com *longs* C de 32 bits e ``P = 2**61 - 1`` em máquinas com *longs* C de 64 bits.
sv: För närvarande används primtalet ``P = 2**31 - 1`` på maskiner med 32-bitars C-längder och ``P = 2**61 - 1`` på maskiner med 64-bitars C-längder.

source: Here are the rules in detail:
pt_pt: Aqui estão as regras em detalhe:
sv: Här är reglerna i detalj:

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is not divisible by ``P``, define ``hash(x)`` as ``m * invmod(n, P) % P``, where ``invmod(n, P)`` gives the inverse of ``n`` modulo ``P``.
pt_pt: Se ``x = m / n`` for um número racional não negativo e ``n`` não for divisível por ``P``, defina ``hash(x)`` como ``m * invmod(n, P) % P``, onde ``invmod(n, P)`` dá o inverso de ``n`` módulo ``P``.
sv: Om ``x = m / n`` är ett nonnegativt rationellt tal och ``n`` inte är delbart med ``P``, definiera ``hash(x)`` som ``m * invmod(n, P) % P``, där ``invmod(n, P)`` anger inversen av ``n`` modulo ``P``.

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is divisible by ``P`` (but ``m`` is not) then ``n`` has no inverse modulo ``P`` and the rule above doesn't apply; in this case define ``hash(x)`` to be the constant value ``sys.hash_info.inf``.
pt_pt: Se ``x = m / n`` for um número racional não negativo e ``n`` for divisível por ``P`` (mas ``m`` não for), então ``n`` não tem inverso módulo ``P`` e a regra acima não se aplica; neste caso, defina ``hash(x)`` como o valor constante ``sys.hash_info.inf``.
sv: Om ``x = m / n`` är ett nonnegativt rationellt tal och ``n`` är delbart med ``P`` (men ``m`` inte är det) så har ``n`` ingen invers modulo ``P`` och regeln ovan gäller inte; i detta fall definieras ``hash(x)`` som det konstanta värdet ``sys.hash_info.inf``.

source: If ``x = m / n`` is a negative rational number define ``hash(x)`` as ``-hash(-x)``. If the resulting hash is ``-1``, replace it with ``-2``.
pt_pt: Se ``x = m / n`` for um número racional negativo, defina ``hash(x)`` como ``-hash(-x)``. Se o *hash* resultante for ``-1``, substitua-o por ``-2``.
sv: Om ``x = m / n`` är ett negativt rationellt tal, definiera ``hash(x)`` som ``-hash(-x)``. Om den resulterande hashen är ``-1``, ersätt den med ``-2``.

source: The particular values ``sys.hash_info.inf`` and ``-sys.hash_info.inf`` are used as hash values for positive infinity or negative infinity (respectively).
pt_pt: Os valores específicos ``sys.hash_info.inf`` e ``-sys.hash_info.inf`` são usados como valores de *hash* para infinito positivo ou negativo (respetivamente).
sv: De särskilda värdena ``sys.hash_info.inf`` och ``-sys.hash_info.inf`` används som hashvärden för positiv oändlighet respektive negativ oändlighet.

source: For a :class:`complex` number ``z``, the hash values of the real and imaginary parts are combined by computing ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reduced modulo ``2**sys.hash_info.width`` so that it lies in ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Again, if the result is ``-1``, it's replaced with ``-2``.
pt_pt: Para um número :class:`complex` ``z``, os valores de *hash* das partes real e imaginária são combinados calculando ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reduzido módulo ``2**sys.hash_info.width`` de modo a que esteja no intervalo ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Novamente, se o resultado for ``-1``, é substituído por ``-2``.
sv: För ett :class:`complex`-tal ``z`` kombineras hashvärdena för de reella och imaginära delarna genom att beräkna ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reducerat modulo ``2**sys.hash_info.width`` så att det ligger i ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Återigen, om resultatet är ``-1`` ersätts det med ``-2``.

source: To clarify the above rules, here's some example Python code, equivalent to the built-in hash, for computing the hash of a rational number, :class:`float`, or :class:`complex`::
pt_pt: Para clarificar as regras acima, aqui está algum código Python de exemplo, equivalente ao *hash* integrado, para calcular o *hash* de um número racional, :class:`float`, ou :class:`complex`:
sv: För att klargöra ovanstående regler följer här ett exempel på Python-kod, motsvarande den inbyggda hashen, för att beräkna hashen för ett rationellt tal, :class:`float`, eller :class:`complex`::

source: import sys, math def hash_fraction(m, n): """Compute the hash of a rational number m / n. Assumes m and n are integers, with n positive. Equivalent to hash(fractions.Fraction(m, n)). """ P = sys.hash_info.modulus # Remove common factors of P. (Unnecessary if m and n already coprime.) while m % P == n % P == 0: m, n = m // P, n // P if n % P == 0: hash_value = sys.hash_info.inf else: # Fermat's Little Theorem: pow(n, P-1, P) is 1, so # pow(n, P-2, P) gives the inverse of n modulo P. hash_value = (abs(m) % P) * pow(n, P - 2, P) % P if m < 0: hash_value = -hash_value if hash_value == -1: hash_value = -2 return hash_value def hash_float(x): """Compute the hash of a float x.""" if math.isnan(x): return object.__hash__(x) elif math.isinf(x): return sys.hash_info.inf if x > 0 else -sys.hash_info.inf else: return hash_fraction(*x.as_integer_ratio()) def hash_complex(z): """Compute the hash of a complex number z.""" hash_value = hash_float(z.real) + sys.hash_info.imag * hash_float(z.imag) # do a signed reduction modulo 2**sys.hash_info.width M = 2**(sys.hash_info.width - 1) hash_value = (hash_value & (M - 1)) - (hash_value & M) if hash_value == -1: hash_value = -2 return hash_value
pt_pt: import sys, math def hash_fraction(m, n): """Calcula o *hash* de um número racional m / n. Assume que m e n são inteiros, com n positivo. Equivalente a hash(fractions.Fraction(m, n)). """ P = sys.hash_info.modulus # Remove fatores comuns de P. (Desnecessário se m e n já forem primos entre si.) while m % P == n % P == 0: m, n = m // P, n // P if n % P == 0: hash_value = sys.hash_info.inf else: # Teorema de Fermat: pow(n, P-1, P) é 1, por isso # pow(n, P-2, P) dá o inverso de n módulo P. hash_value = (abs(m) % P) * pow(n, P - 2, P) % P if m < 0: hash_value = -hash_value if hash_value == -1: hash_value = -2 return hash_value def hash_float(x): """Calcula o *hash* de um float x.""" if math.isnan(x): return object.__hash__(x) elif math.isinf(x): return sys.hash_info.inf if x > 0 else -sys.hash_info.inf else: return hash_fraction(*x.as_integer_ratio()) def hash_complex(z): """Calcula o *hash* de um número complexo z.""" hash_value = hash_float(z.real) + sys.hash_info.imag * hash_float(z.imag) # faz uma redução com sinal módulo 2**sys.hash_info.width M = 2**(sys.hash_info.width - 1) hash_value = (hash_value & (M - 1)) - (hash_value & M) if hash_value == -1: hash_value = -2 return hash_value
sv: import sys, matematik def hash_fraktion(m, n): """Beräkna hashvärdet av ett rationellt tal m / n. Antar att m och n är heltal, med n positivt. Likvärdig med hash(fractions.Fraction(m, n)). """ P = sys.hash_info.modulus # Ta bort gemensamma faktorer i P. (Onödigt om m och n redan är coprime.) while m % P == n % P == 0: m, n = m // P, n // P om n % P == 0: hash_värde = sys.hash_info.inf else: # Fermats lilla sats: pow(n, P-1, P) är 1, så # pow(n, P-2, P) ger inversen av n modulo P. hash_value = (abs(m) % P) * pow(n, P - 2, P) % P om m < 0: hash_värde = -hash_värde om hash_value == -1: hash_värde = -2 returnera hash_värde def hash_float(x): """Beräkna hashvärdet för en float x.""" om math.isnan(x): returnera objekt.__hash__(x) elif math.isinf(x): return sys.hash_info.inf if x > 0 else -sys.hash_info.inf annat: return hash_fraction(*x.as_integer_ratio()) def hash_komplex(z): """Beräkna hashvärdet för ett komplext tal z.""" hash_value = hash_float(z.real) + sys.hash_info.imag * hash_float(z.imag) # gör en signerad reduktion modulo 2**sys.hash_info.width M = 2**(sys.hash_info.width - 1) hash_värde = (hash_värde & (M - 1)) - (hash_värde & M) om hash_value == -1: hash_värde = -2 returnera hash_värde

source: Boolean Type - :class:`bool`
pt_pt: Tipo booleano - :class:`bool`
sv: Booleansk typ - :class:`bool`

source: Booleans represent truth values. The :class:`bool` type has exactly two constant instances: ``True`` and ``False``.
pt_pt: Os booleanos representam valores de verdade. O tipo :class:`bool` tem exatamente duas instâncias constantes: ``True`` e ``False``.
sv: Booleaner representerar sanningsvärden. Typen :class:`bool` har exakt två konstanta instanser: ``True`` och ``False``.

source: The built-in function :func:`bool` converts any value to a boolean, if the value can be interpreted as a truth value (see section :ref:`truth` above).
pt_pt: A função integrada :func:`bool` converte qualquer valor para um booleano, se o valor puder ser interpretado como um valor de verdade (consulte a secção :ref:`truth` acima).
sv: Den inbyggda funktionen :func:`bool` konverterar ett värde till en boolean, om värdet kan tolkas som ett sanningsvärde (se avsnitt :ref:`truth` ovan).

source: For logical operations, use the :ref:`boolean operators <boolean>` ``and``, ``or`` and ``not``. When applying the bitwise operators ``&``, ``|``, ``^`` to two booleans, they return a bool equivalent to the logical operations "and", "or", "xor". However, the logical operators ``and``, ``or`` and ``!=`` should be preferred over ``&``, ``|`` and ``^``.
pt_pt: Para operações lógicas, use os :ref:`operadores booleanos <boolean>` ``and``, ``or`` e ``not``. Ao aplicar os operadores bit a bit ``&``, ``|``, ``^`` a dois booleanos, retornam um booleano equivalente às operações lógicas "and", "or", "xor". No entanto, os operadores lógicos ``and``, ``or`` e ``!=`` devem ser preferidos em relação a ``&``, ``|`` e ``^``.
sv: För logiska operationer, använd :ref:`booleska operatorer <boolean>` ``and``, ``or`` och ``not``. När man använder de bitvisa operatorerna ``&amp;``, ``|``, ``^`` på två booleaner returnerar de en bool som motsvarar de logiska operationerna "and", "or", "xor". De logiska operatorerna ``och``, ``eller`` och ``!=`` bör dock föredras framför ``&amp;``, ``|`` och ``^``.

source: The use of the bitwise inversion operator ``~`` is deprecated and will raise an error in Python 3.16.
pt_pt: O uso do operador de inversão bit a bit ``~`` está obsoleto e lançará um erro no Python 3.16.
sv: Användningen av den bitvisa inversionsoperatorn ``~`` är föråldrad och kommer att ge upphov till ett fel i Python 3.16.

source: :class:`bool` is a subclass of :class:`int` (see :ref:`typesnumeric`). In many numeric contexts, ``False`` and ``True`` behave like the integers 0 and 1, respectively. However, relying on this is discouraged; explicitly convert using :func:`int` instead.
pt_pt: :class:`bool` é uma subclasse de :class:`int` (consulte :ref:`typesnumeric`). Em muitos contextos numéricos, ``False`` e ``True`` comportam-se como os inteiros 0 e 1, respetivamente. No entanto, confiar nisto é desencorajado; converta explicitamente usando :func:`int`.
sv: :class:`bool` är en underklass till :class:`int` (se :ref:`typesnumeric`). I många numeriska sammanhang beter sig ``False`` och ``True`` som heltalen 0 respektive 1. Det är dock inte rekommenderat att förlita sig på detta; konvertera explicit med :func:`int` istället.

source: Iterator Types
pt_pt: Tipos de iterador
sv: Iterator-typer

source: Python supports a concept of iteration over containers. This is implemented using two distinct methods; these are used to allow user-defined classes to support iteration. Sequences, described below in more detail, always support the iteration methods.
pt_pt: O Python suporta o conceito de iteração sobre contentores. Isto é implementado usando dois métodos distintos; estes são usados para permitir que classes definidas pelo utilizador suportem iteração. As sequências, descritas abaixo com mais detalhe, suportam sempre os métodos de iteração.
sv: Python stöder ett koncept för iteration över behållare. Detta implementeras med hjälp av två olika metoder; dessa används för att låta användardefinierade klasser stödja iteration. Sekvenser, som beskrivs mer i detalj nedan, stöder alltid iterationsmetoderna.

source: One method needs to be defined for container objects to provide :term:`iterable` support:
pt_pt: Um método precisa de ser definido para objetos contentor para fornecer suporte :term:`iterável`:
sv: En metod måste definieras för containerobjekt för att ge stöd för :term:`iterable`:

source: Return an :term:`iterator` object. The object is required to support the iterator protocol described below. If a container supports different types of iteration, additional methods can be provided to specifically request iterators for those iteration types. (An example of an object supporting multiple forms of iteration would be a tree structure which supports both breadth-first and depth-first traversal.) This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
pt_pt: Retorna um objeto :term:`iterador`. O objeto é obrigado a suportar o protocolo de iterador descrito abaixo. Se um contentor suportar diferentes tipos de iteração, podem ser fornecidos métodos adicionais para solicitar especificamente iteradores para esses tipos de iteração. (Um exemplo de um objeto que suporta múltiplas formas de iteração seria uma estrutura de árvore que suporta travessia em largura e em profundidade.) Este método corresponde ao slot :c:member:`~PyTypeObject.tp_iter` da estrutura de tipo para objetos Python na API Python/C.
sv: Returnerar ett :term:`iterator`-objekt. Objektet måste ha stöd för iteratorprotokollet som beskrivs nedan. Om en container stöder olika typer av iteration kan ytterligare metoder tillhandahållas för att specifikt begära iteratorer för dessa iterationstyper. (Ett exempel på ett objekt som stöder flera former av iteration är en trädstruktur som stöder både bredd-först- och djup-först-traversering) Denna metod motsvarar :c:member:`~PyTypeObject.tp_iter` slot i typstrukturen för Python-objekt i Python/C API.

source: The iterator objects themselves are required to support the following two methods, which together form the :dfn:`iterator protocol`:
pt_pt: Os objetos iteradores em si são obrigados a suportar os seguintes dois métodos, que juntos formam o :dfn:`protocolo de iterador`:
sv: Själva iteratorobjekten måste stödja följande två metoder, som tillsammans utgör :dfn:`iteratorprotokollet`:

source: Return the :term:`iterator` object itself. This is required to allow both containers and iterators to be used with the :keyword:`for` and :keyword:`in` statements. This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
pt_pt: Retorna o próprio objeto :term:`iterador`. Isto é necessário para permitir que tanto contentores como iteradores sejam usados com as instruções :keyword:`for` e :keyword:`in`. Este método corresponde ao slot :c:member:`~PyTypeObject.tp_iter` da estrutura de tipo para objetos Python na API Python/C.
sv: Returnerar själva :term:`iterator`-objektet. Detta krävs för att både containers och iteratorer ska kunna användas med :keyword:`for` och :keyword:`in` satserna. Denna metod motsvarar :c:member:`~PyTypeObject.tp_iter`-platsen i typstrukturen för Python-objekt i Python/C API.

source: Return the next item from the :term:`iterator`. If there are no further items, raise the :exc:`StopIteration` exception. This method corresponds to the :c:member:`~PyTypeObject.tp_iternext` slot of the type structure for Python objects in the Python/C API.
pt_pt: Retorna o próximo item do :term:`iterador`. Se não houver mais itens, lança a exceção :exc:`StopIteration`. Este método corresponde ao slot :c:member:`~PyTypeObject.tp_iternext` da estrutura de tipo para objetos Python na API Python/C.
sv: Returnerar nästa objekt från :term:`iterator`. Om det inte finns några fler objekt, utlöses undantaget :exc:`StopIteration`. Denna metod motsvarar :c:member:`~PyTypeObject.tp_iternext`-platsen i typstrukturen för Python-objekt i Python/C API.
