Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Return a string object containing two hexadecimal digits for each byte in the instance.
pt_pt: Retorna um objeto *string* contendo dois dígitos hexadecimais para cada byte na instância.
sv: Returnerar ett strängobjekt som innehåller två hexadecimala siffror för varje byte i instansen.

source: If you want to make the hex string easier to read, you can specify a single character separator *sep* parameter to include in the output. By default, this separator will be included between each byte. A second optional *bytes_per_sep* parameter controls the spacing. Positive values calculate the separator position from the right, negative values from the left.
pt_pt: Se quiser tornar a *string* hexadecimal mais fácil de ler, pode especificar um parâmetro de separador de caractere único *sep* para incluir na saída. Por predefinição, este separador será incluído entre cada byte. Um segundo parâmetro opcional *bytes_per_sep* controla o espaçamento. Valores positivos calculam a posição do separador a partir da direita, valores negativos a partir da esquerda.
sv: Om du vill göra hexsträngen mer lättläst kan du ange en parameter för en teckenseparator *sep* som ska inkluderas i utdata. Som standard kommer denna separator att inkluderas mellan varje byte. En andra valfri parameter *bytes_per_sep* styr avståndet. Positiva värden beräknar separatorns position från höger, negativa värden från vänster.

source: :meth:`bytes.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
pt_pt: :meth:`bytes.hex` agora suporta parâmetros opcionais *sep* e *bytes_per_sep* para inserir separadores entre bytes na saída hexadecimal.
sv: :meth:`bytes.hex` har nu stöd för de valfria parametrarna *sep* och *bytes_per_sep* för att infoga separatorer mellan byte i hex-utdata.

source: Since bytes objects are sequences of integers (akin to a tuple), for a bytes object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytes object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
pt_pt: Uma vez que os objetos bytes são sequências de inteiros (semelhantes a um tuplo), para um objeto bytes *b*, ``b[0]`` será um inteiro, enquanto ``b[0:1]`` será um objeto bytes de comprimento 1. (Isto contrasta com *strings* de texto, onde tanto a indexação como a fatiação produzirão uma *string* de comprimento 1)
sv: Eftersom bytesobjekt är sekvenser av heltal (liknande en tupel), för ett bytesobjekt *b*, kommer ``b[0]`` att vara ett heltal, medan ``b[0:1]`` kommer att vara ett bytesobjekt av längd 1. (Detta står i kontrast till textsträngar, där både indexering och skivning kommer att producera en sträng av längd 1)

source: The representation of bytes objects uses the literal format (``b'...'``) since it is often more useful than e.g. ``bytes([46, 46, 46])``. You can always convert a bytes object into a list of integers using ``list(b)``.
pt_pt: A representação de objetos bytes usa o formato literal (``b'...'``), uma vez que é frequentemente mais útil do que, por exemplo, ``bytes([46, 46, 46])``. Pode sempre converter um objeto bytes numa lista de inteiros usando ``list(b)``.
sv: Representationen av bytes-objekt använder det bokstavliga formatet (``b'...'``) eftersom det ofta är mer användbart än t.ex. ``bytes([46, 46, 46])``. Du kan alltid konvertera ett bytesobjekt till en lista med heltal med hjälp av ``list(b)``.

source: Bytearray Objects
pt_pt: Objetos bytearray
sv: Bytearray-objekt

source: :class:`bytearray` objects are a mutable counterpart to :class:`bytes` objects.
pt_pt: Os objetos :class:`bytearray` são uma contraparte mutável dos objetos :class:`bytes`.
sv: :class:`bytearray`-objekt är en föränderlig motsvarighet till :class:`bytes`-objekt.

source: There is no dedicated literal syntax for bytearray objects, instead they are always created by calling the constructor:
pt_pt: Não existe uma sintaxe literal dedicada para objetos bytearray; em vez disso, estes são sempre criados chamando o construtor:
sv: Det finns ingen särskild litteral syntax för bytearray-objekt, utan de skapas alltid genom att anropa konstruktören:

source: Creating an empty instance: ``bytearray()``
pt_pt: Criar uma instância vazia: ``bytearray()``
sv: Skapa en tom instans: ``bytearray()``

source: Creating a zero-filled instance with a given length: ``bytearray(10)``
pt_pt: Criar uma instância preenchida com zeros de um comprimento dado: ``bytearray(10)``
sv: Skapa en nollfylld instans med en given längd: ``bytearray(10)``

source: From an iterable of integers: ``bytearray(range(20))``
pt_pt: A partir de um iterável de inteiros: ``bytearray(range(20))``
sv: Från en iterabel av heltal: ``bytearray(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytearray(b'Hi!')``
pt_pt: Copiar dados binários existentes através do protocolo de buffer: ``bytearray(b'Hi!')``
sv: Kopiering av befintliga binära data via buffertprotokollet: ``bytearray(b'Hej!')``

source: As bytearray objects are mutable, they support the :ref:`mutable <typesseq-mutable>` sequence operations in addition to the common bytes and bytearray operations described in :ref:`bytes-methods`.
pt_pt: Como os objetos bytearray são mutáveis, suportam as operações de sequência :ref:`mutável <typesseq-mutable>` além das operações comuns de bytes e bytearray descritas em :ref:`bytes-methods`.
sv: Eftersom bytearray-objekt är mutabla stöder de :ref:`mutable <typesseq-mutable>` sekvensoperationer utöver de vanliga bytes- och bytearray-operationer som beskrivs i :ref:`bytes-methods`.

source: Also see the :ref:`bytearray <func-bytearray>` built-in.
pt_pt: Consulte também a função incorporada :ref:`bytearray <func-bytearray>`.
sv: Se även den inbyggda :ref:`bytearray <func-bytearray>`.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytearray type has an additional class method to read data in that format:
pt_pt: Uma vez que 2 dígitos hexadecimais correspondem precisamente a um único byte, números hexadecimais são um formato comumente usado para descrever dados binários. Consequentemente, o tipo bytearray tem um método de classe adicional para ler dados nesse formato:
sv: Eftersom 2 hexadecimala siffror exakt motsvarar en enda byte är hexadecimala tal ett vanligt format för att beskriva binära data. Följaktligen har bytearray-typen en extra klassmetod för att läsa data i det formatet:

source: This :class:`bytearray` class method returns bytearray object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
pt_pt: Este método de classe :class:`bytearray` retorna um objeto bytearray, decodificando o objeto *string* fornecido. A *string* deve conter dois dígitos hexadecimais por byte, com espaços em branco ASCII sendo ignorados.
sv: Denna :class:`bytearray`-klassmetod returnerar bytearray-objekt, som avkodar det givna strängobjektet. Strängen måste innehålla två hexadecimala siffror per byte, med ASCII-teckensnitt som ignoreras.

source: :meth:`bytearray.fromhex` now skips all ASCII whitespace in the string, not just spaces.
pt_pt: :meth:`bytearray.fromhex` agora ignora todos os espaços em branco ASCII na *string*, não apenas espaços.
sv: :meth:`bytearray.fromhex` hoppar nu över alla ASCII-teckensnitt i strängen, inte bara mellanslag.

source: :meth:`bytearray.fromhex` now accepts ASCII :class:`bytes` and :term:`bytes-like objects <bytes-like object>` as input.
sv: :meth:`bytearray.fromhex` accepterar nu ASCII :class:`bytes` och :term:`bytesliknande objekt <bytes-like object>` som indata.

source: A reverse conversion function exists to transform a bytearray object into its hexadecimal representation.
pt_pt: Existe uma função de conversão inversa para transformar um objeto bytearray na sua representação hexadecimal.
sv: En omvänd konverteringsfunktion finns för att omvandla ett bytearray-objekt till dess hexadecimala representation.

source: Similar to :meth:`bytes.hex`, :meth:`bytearray.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
pt_pt: Semelhante a :meth:`bytes.hex`, :meth:`bytearray.hex` agora suporta parâmetros opcionais *sep* e *bytes_per_sep* para inserir separadores entre bytes na saída hexadecimal.
sv: I likhet med :meth:`bytes.hex` har :meth:`bytearray.hex` nu stöd för de valfria parametrarna *sep* och *bytes_per_sep* för att infoga separatorer mellan byte i hex-utdata.

source: Resize the :class:`bytearray` to contain *size* bytes. *size* must be greater than or equal to 0.
sv: Ändra storlek på :class:`bytearray` så att den innehåller *size* bytes. *size* måste vara större än eller lika med 0.

source: If the :class:`bytearray` needs to shrink, bytes beyond *size* are truncated.
sv: Om :class:`bytearray` behöver krympas, trunkeras byte som är större än *size*.

source: If the :class:`bytearray` needs to grow, all new bytes, those beyond *size*, will be set to null bytes.
sv: Om :class:`bytearray` behöver växa kommer alla nya bytes, de som överstiger *size*, att sättas till null bytes.

source: This is equivalent to:
sv: Detta är likvärdigt med:

source: Examples:
sv: Exempel:

source: Since bytearray objects are sequences of integers (akin to a list), for a bytearray object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytearray object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
pt_pt: Uma vez que os objetos bytearray são sequências de inteiros (semelhantes a uma lista), para um objeto bytearray *b*, ``b[0]`` será um inteiro, enquanto ``b[0:1]`` será um objeto bytearray de comprimento 1. (Isto contrasta com *strings* de texto, onde tanto a indexação como a fatiação produzirão uma *string* de comprimento 1)
sv: Eftersom bytearray-objekt är sekvenser av heltal (i likhet med en lista), kommer ``b[0]`` för ett bytearray-objekt *b* att vara ett heltal, medan ``b[0:1]`` kommer att vara ett bytearray-objekt med längden 1. (Detta står i kontrast till textsträngar, där både indexering och skivning kommer att producera en sträng med längden 1)

source: The representation of bytearray objects uses the bytes literal format (``bytearray(b'...')``) since it is often more useful than e.g. ``bytearray([46, 46, 46])``. You can always convert a bytearray object into a list of integers using ``list(b)``.
pt_pt: A representação de objetos bytearray usa o formato literal de bytes (``bytearray(b'...')``), uma vez que é frequentemente mais útil do que, por exemplo, ``bytearray([46, 46, 46])``. Pode sempre converter um objeto bytearray numa lista de inteiros usando ``list(b)``.
sv: Representationen av bytearray-objekt använder bytes literal-formatet (``bytearray(b'...')``) eftersom det ofta är mer användbart än t.ex. ``bytearray([46, 46, 46])``. Du kan alltid konvertera ett bytearray-objekt till en lista med heltal med hjälp av ``list(b)``.

source: Bytes and Bytearray Operations
pt_pt: Operações com bytes e bytearray
sv: Bytes- och bytearrayoperationer

source: Both bytes and bytearray objects support the :ref:`common <typesseq-common>` sequence operations. They interoperate not just with operands of the same type, but with any :term:`bytes-like object`. Due to this flexibility, they can be freely mixed in operations without causing errors. However, the return type of the result may depend on the order of operands.
pt_pt: Tanto os objetos bytes como bytearray suportam as :ref:`operações comuns <typesseq-common>` de sequência. Eles interoperam não apenas com operandos do mesmo tipo, mas com qualquer :term:`objeto semelhante a bytes`. Devido a esta flexibilidade, podem ser misturados livremente em operações sem causar erros. No entanto, o tipo de retorno do resultado pode depender da ordem dos operandos.
sv: Både bytes och bytearray-objekt stöder :ref:``common <typesseq-common>` sekvensoperationer. De fungerar inte bara med operander av samma typ, utan med alla :term:`bytesliknande objekt`. På grund av denna flexibilitet kan de blandas fritt i operationer utan att orsaka fel. Returtypen för resultatet kan dock bero på ordningen på operanderna.

source: The methods on bytes and bytearray objects don't accept strings as their arguments, just as the methods on strings don't accept bytes as their arguments. For example, you have to write::
pt_pt: Os métodos em objetos bytes e bytearray não aceitam *strings* como seus argumentos, assim como os métodos em *strings* não aceitam bytes como seus argumentos. Por exemplo, tem de escrever:
sv: Metoderna för bytes och bytearray-objekt accepterar inte strängar som argument, precis som metoderna för strängar inte accepterar bytes som argument. Till exempel måste du skriva::

source: and::
pt_pt: e:
sv: och::

source: Some bytes and bytearray operations assume the use of ASCII compatible binary formats, and hence should be avoided when working with arbitrary binary data. These restrictions are covered below.
pt_pt: Algumas operações com bytes e bytearray assumem o uso de formatos binários compatíveis com ASCII e, portanto, devem ser evitadas ao trabalhar com dados binários arbitrários. Estas restrições são abordadas abaixo.
sv: Vissa bytes- och bytearrayoperationer förutsätter användning av ASCII-kompatibla binära format och bör därför undvikas när man arbetar med godtyckliga binära data. Dessa begränsningar beskrivs nedan.

source: Using these ASCII based operations to manipulate binary data that is not stored in an ASCII based format may lead to data corruption.
pt_pt: Usar estas operações baseadas em ASCII para manipular dados binários que não estejam armazenados num formato baseado em ASCII pode levar à corrupção de dados.
sv: Om dessa ASCII-baserade operationer används för att manipulera binära data som inte lagras i ett ASCII-baserat format kan det leda till att data korrumperas.

source: The following methods on bytes and bytearray objects can be used with arbitrary binary data.
pt_pt: Os seguintes métodos em objetos bytes e bytearray podem ser usados com dados binários arbitrários.
sv: Följande metoder för bytes och bytearray-objekt kan användas med godtyckliga binära data.

source: Return the number of non-overlapping occurrences of subsequence *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
pt_pt: Retorna o número de ocorrências não sobrepostas da subsequência *sub* no intervalo [*start*, *end*]. Os argumentos opcionais *start* e *end* são interpretados como na notação de fatia.
sv: Returnerar antalet icke-överlappande förekomster av undersekvensen *sub* i intervallet [*start*, *slut*]. De valfria argumenten *start* och *slut* tolkas som i slice-notation.

source: The subsequence to search for may be any :term:`bytes-like object` or an integer in the range 0 to 255.
pt_pt: A subsequência a procurar pode ser qualquer :term:`objeto semelhante a bytes` ou um inteiro no intervalo 0 a 255.
sv: Den undersekvens som ska sökas kan vara valfri :term:`bytesliknande objekt` eller ett heltal i intervallet 0 till 255.

source: If *sub* is empty, returns the number of empty slices between characters which is the length of the bytes object plus one.
pt_pt: Se *sub* estiver vazia, retorna o número de fatias vazias entre caracteres, que é o comprimento do objeto bytes mais um.
sv: Om *sub* är tomt, returneras antalet tomma delar mellan tecken, vilket är bytesobjektets längd plus ett.

source: Also accept an integer in the range 0 to 255 as the subsequence.
pt_pt: Também aceita um inteiro no intervalo 0 a 255 como a subsequência.
sv: Acceptera också ett heltal i intervallet 0 till 255 som undersekvens.

source: If the binary data starts with the *prefix* string, return ``bytes[len(prefix):]``. Otherwise, return a copy of the original binary data::
pt_pt: Se os dados binários começarem com a *string* *prefix*, retorna ``bytes[len(prefix):]``. Caso contrário, retorna uma cópia dos dados binários originais:
sv: Om de binära data börjar med strängen *prefix*, returneras ``bytes[len(prefix):]``. I annat fall returneras en kopia av den ursprungliga binära datan::

source: The *prefix* may be any :term:`bytes-like object`.
pt_pt: O *prefix* pode ser qualquer :term:`objeto semelhante a bytes`.
sv: *prefixet* kan vara valfri :term:`bytesliknande objekt`.

source: The bytearray version of this method does *not* operate in place - it always produces a new object, even if no changes were made.
pt_pt: A versão bytearray deste método *não* opera no local - sempre produz um novo objeto, mesmo que nenhuma alteração tenha sido feita.
sv: Bytearray-versionen av den här metoden fungerar *inte* på plats - den producerar alltid ett nytt objekt, även om inga ändringar har gjorts.

source: If the binary data ends with the *suffix* string and that *suffix* is not empty, return ``bytes[:-len(suffix)]``. Otherwise, return a copy of the original binary data::
pt_pt: Se os dados binários terminarem com a *string* *suffix* e esse *suffix* não estiver vazio, retorna ``bytes[:-len(suffix)]``. Caso contrário, retorna uma cópia dos dados binários originais:
sv: Om de binära data slutar med strängen *suffix* och *suffix* inte är tomt, returneras ``bytes[:-len(suffix)]``. I annat fall returneras en kopia av de ursprungliga binära data::

source: The *suffix* may be any :term:`bytes-like object`.
pt_pt: O *suffix* pode ser qualquer :term:`objeto semelhante a bytes`.
sv: *Suffix* kan vara valfri :term:`bytesliknande objekt`.

source: Return the bytes decoded to a :class:`str`.
pt_pt: Retorna os bytes decodificados para uma :class:`str`.
sv: Returnera byte som avkodats till en :class:`str`.

source: *errors* controls how decoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
pt_pt: *errors* controla como os erros de decodificação são tratados. Se for ``'strict'`` (o valor predefinido), é lançada uma exceção :exc:`UnicodeError`. Outros valores possíveis são ``'ignore'``, ``'replace'``, e qualquer outro nome registado através de :func:`codecs.register_error`. Consulte :ref:`error-handlers` para mais detalhes.
sv: *errors* styr hur avkodningsfel ska hanteras. Om ``'strict'`` (standard), kommer ett :exc:`UnicodeError` undantag att skapas. Andra möjliga värden är ``'ignore'``, ``'replace'``, och alla andra namn som registreras via :func:`codecs.register_error`. Se :ref:`error-handlers` för detaljer.

source: For performance reasons, the value of *errors* is not checked for validity unless a decoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
pt_pt: Por razões de desempenho, o valor de *errors* não é verificado quanto à validade a menos que ocorra um erro de decodificação, :ref:`devmode` esteja ativado ou uma :ref:`compilação de depuração <debug-build>` seja usada.
sv: Av prestandaskäl kontrolleras inte värdet på *errors* om inte ett avkodningsfel faktiskt inträffar, :ref:`devmode` är aktiverat eller en :ref:`debug build <debug-build>` används.

source: Passing the *encoding* argument to :class:`str` allows decoding any :term:`bytes-like object` directly, without needing to make a temporary :class:`!bytes` or :class:`!bytearray` object.
pt_pt: Passar o argumento *encoding* para :class:`str` permite decodificar qualquer :term:`objeto semelhante a bytes` diretamente, sem necessidade de criar um objeto temporário :class:`!bytes` ou :class:`!bytearray`.
sv: Genom att skicka argumentet *encoding* till :class:`str` kan man avkoda alla :term:`bytes-liknande objekt` direkt, utan att behöva skapa ett tillfälligt :class:`!bytes`- eller :class:`!bytearray`-objekt.

source: Return ``True`` if the binary data ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
pt_pt: Retorna ``True`` se os dados binários terminarem com o *suffix* especificado, caso contrário retorna ``False``. *suffix* também pode ser um tuplo de sufixos a procurar. Com *start* opcional, teste a partir dessa posição. Com *end* opcional, pare de comparar nessa posição.
sv: Returnerar ``True`` om binärdata slutar med det angivna *suffixet*, annars returneras ``False``. *suffix* kan också vara en tupel av suffix att leta efter. Med valfri *start* börjar testet vid den positionen. Med valfri *end*, sluta jämföra vid den positionen.

source: The suffix(es) to search for may be any :term:`bytes-like object`.
pt_pt: O(s) sufixo(s) a procurar pode(m) ser qualquer :term:`objeto semelhante a bytes`.
sv: Suffixet (suffixen) som skall sökas efter kan vara valfri :term:`bytesliknande objekt`.

source: Return the lowest index in the data where the subsequence *sub* is found, such that *sub* is contained in the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
pt_pt: Retorna o índice mais baixo nos dados onde a subsequência *sub* é encontrada, de modo que *sub* esteja contida na fatia ``s[start:end]``. Os argumentos opcionais *start* e *end* são interpretados como na notação de fatia. Retorna ``-1`` se *sub* não for encontrada.
sv: Returnerar det lägsta indexet i data där undersekvensen *sub* finns, så att *sub* finns i skivan ``s[start:end]``. De valfria argumenten *start* och *end* tolkas som i slice-notation. Returnerar ``-1`` om *sub* inte hittas.

source: The :meth:`~bytes.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
pt_pt: O método :meth:`~bytes.find` deve ser usado apenas se precisar de saber a posição de *sub*. Para verificar se *sub* é uma subsequência ou não, use o operador :keyword:`in`:
sv: Metoden :meth:`~bytes.find` bör endast användas om du behöver veta positionen för *sub*. Om du vill kontrollera om *sub* är en delsträng eller inte använder du operatorn :keyword:`in`::

source: >>> b'Py' in b'Python' True
sv: >>> b'Py' i b'Python' Sant

source: Like :meth:`~bytes.find`, but raise :exc:`ValueError` when the subsequence is not found.
pt_pt: Semelhante a :meth:`~bytes.find`, mas lança :exc:`ValueError` quando a subsequência não for encontrada.
sv: Som :meth:`~bytes.find`, men ger upphov till :exc:`ValueError` när undersekvensen inte hittas.
