Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Unlike :meth:`~str.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
pt_pt: Ao contrário de :meth:`~str.split` quando uma *string* delimitadora *sep* é fornecida, este método retorna uma lista vazia para a *string* vazia, e uma quebra de linha terminal não resulta numa linha extra:
sv: Till skillnad från :meth:`~str.split` när en avgränsningssträng *sep* anges, returnerar den här metoden en tom lista för den tomma strängen, och en terminal radbrytning resulterar inte i en extra rad::

source: >>> "".splitlines() [] >>> "One line\n".splitlines() ['One line']
sv: >>> "".splitlines() [] >>> "En rad\n".splitlines() ['En rad']

source: For comparison, ``split('\n')`` gives::
pt_pt: Para comparação, ``split('\n')`` dá:
sv: Som jämförelse ger ``split('\n')``::

source: >>> ''.split('\n') [''] >>> 'Two lines\n'.split('\n') ['Two lines', '']
sv: >>> ''.split('\n') [''] >>> 'Två linjer\n'.split('\n') ['Två rader', '']

source: Return ``True`` if string starts with the *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test string beginning at that position. With optional *end*, stop comparing string at that position.
pt_pt: Retorna ``True`` se a *string* começar com o *prefix*, caso contrário retorna ``False``. *prefix* também pode ser um tuplo de prefixos a procurar. Com *start* opcional, testa a *string* a partir dessa posição. Com *end* opcional, para de comparar a *string* nessa posição.
sv: Returnerar ``True`` om strängen börjar med *prefixet*, annars returneras ``False``. *prefix* kan också vara en tupel av prefix att leta efter. Med valfri *start*, testa strängen som börjar vid den positionen. Med valfri *end*, sluta jämföra strängen vid den positionen.

source: Return a copy of the string with the leading and trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
pt_pt: Retorna uma cópia da *string* com os caracteres iniciais e finais removidos. O argumento *chars* é uma *string* que especifica o conjunto de caracteres a serem removidos. Se for omitido ou ``None``, o argumento *chars* remove espaços em branco por predefinição. O argumento *chars* não é um prefixo ou sufixo; em vez disso, todas as combinações dos seus valores são removidas:
sv: Returnerar en kopia av strängen med de inledande och avslutande tecknen borttagna. Argumentet *chars* är en sträng som anger den uppsättning tecken som ska tas bort. Om det utelämnas eller ``None``, är *chars*-argumentet standard för att ta bort blanksteg. Argumentet *chars* är inte ett prefix eller suffix, utan alla kombinationer av dess värden tas bort::

source: >>> ' spacious '.strip() 'spacious' >>> 'www.example.com'.strip('cmowz.') 'example'
sv: >>> ' rymlig '.strip() 'rymlig' >>> 'www.example.com'.strip('cmowz.') 'exempel'

source: The outermost leading and trailing *chars* argument values are stripped from the string. Characters are removed from the leading end until reaching a string character that is not contained in the set of characters in *chars*. A similar action takes place on the trailing end. For example::
pt_pt: Os valores mais externos de *chars* nos extremos inicial e final são removidos da *string*. Os caracteres são removidos do início até encontrar um caractere da *string* que não esteja contido no conjunto de caracteres em *chars*. Uma ação semelhante ocorre no extremo final. Por exemplo:
sv: De yttersta inledande och avslutande *chars*-argumentvärdena tas bort från strängen. Tecken tas bort från den främre änden tills man når ett strängtecken som inte ingår i teckenuppsättningen i *chars*. En liknande åtgärd sker i den bakre änden. Till exempel::

source: >>> comment_string = '#....... Section 3.2.1 Issue #32 .......' >>> comment_string.strip('.#! ') 'Section 3.2.1 Issue #32'
sv: >>> kommentar_sträng = '#....... Avsnitt 3.2.1 Utgåva #32 .......' >>> kommentar_sträng.strip('.#! ') 'Avsnitt 3.2.1 Utgåva #32'

source: Return a copy of the string with uppercase characters converted to lowercase and vice versa. Note that it is not necessarily true that ``s.swapcase().swapcase() == s``.
pt_pt: Retorna uma cópia da *string* com caracteres maiúsculos convertidos para minúsculos e vice-versa. Note que não é necessariamente verdade que ``s.swapcase().swapcase() == s``.
sv: Returnerar en kopia av strängen med versaler omvandlade till gemener och vice versa. Observera att det inte nödvändigtvis är sant att ``s.swapcase().swapcase() == s``.

source: Return a titlecased version of the string where words start with an uppercase character and the remaining characters are lowercase.
pt_pt: Retorna uma versão da *string* em que as palavras começam com um caractere maiúsculo e os restantes caracteres são minúsculos.
sv: Returnerar en titelanpassad version av strängen där orden börjar med en versal och övriga tecken är gemener.

source: >>> 'Hello world'.title() 'Hello World'
sv: >>> 'Hej världen'.title() 'Hej världen'

source: The algorithm uses a simple language-independent definition of a word as groups of consecutive letters. The definition works in many contexts but it means that apostrophes in contractions and possessives form word boundaries, which may not be the desired result::
pt_pt: O algoritmo usa uma definição simples e independente de linguagem de uma palavra como grupos de letras consecutivas. A definição funciona em muitos contextos, mas significa que apóstrofos em contrações e possessivos formam limites de palavras, o que pode não ser o resultado desejado:
sv: Algoritmen använder en enkel språkoberoende definition av ett ord som grupper av på varandra följande bokstäver. Definitionen fungerar i många sammanhang men innebär att apostrofer i sammandragningar och possessiver bildar ordgränser, vilket kanske inte är det önskade resultatet::

source: >>> "they're bill's friends from the UK".title() "They'Re Bill'S Friends From The Uk"
sv: >>> "de är Bills vänner från Storbritannien".title() "De är Bills vänner från Storbritannien"

source: The :func:`string.capwords` function does not have this problem, as it splits words on spaces only.
pt_pt: A função :func:`string.capwords` não tem este problema, pois divide as palavras apenas por espaços.
sv: Funktionen :func:`string.capwords` har inte detta problem, eftersom den endast delar upp ord efter mellanslag.

source: Alternatively, a workaround for apostrophes can be constructed using regular expressions::
pt_pt: Alternativamente, uma solução alternativa para apóstrofos pode ser construída usando expressões regulares:
sv: Alternativt kan en lösning för apostrofer konstrueras med hjälp av reguljära uttryck::

source: >>> import re >>> def titlecase(s): ... return re.sub(r"[A-Za-z]+('[A-Za-z]+)?", ... lambda mo: mo.group(0).capitalize(), ... s) ... >>> titlecase("they're bill's friends.") "They're Bill's Friends."
sv: >>> import re >>> def titlecase(s): ... return re.sub(r"[A-Za-z]+('[A-Za-z]+)?", ... lambda mo: mo.group(0).capitalize(), ... s) ... >>> titlecase("de är Bills vänner.") "De är Bills vänner."

source: Return a copy of the string in which each character has been mapped through the given translation table. The table must be an object that implements indexing via :meth:`~object.__getitem__`, typically a :term:`mapping` or :term:`sequence`. When indexed by a Unicode ordinal (an integer), the table object can do any of the following: return a Unicode ordinal or a string, to map the character to one or more other characters; return ``None``, to delete the character from the return string; or raise a :exc:`LookupError` exception, to map the character to itself.
pt_pt: Retorna uma cópia da *string* em que cada caractere foi mapeado através da tabela de tradução fornecida. A tabela deve ser um objeto que implemente a indexação via :meth:`~object.__getitem__`, tipicamente um :term:`mapeamento` ou :term:`sequência`. Quando indexado por um ordinal Unicode (um inteiro), o objeto tabela pode fazer uma das seguintes ações: retornar um ordinal Unicode ou uma *string*, para mapear o caractere para um ou mais outros caracteres; retornar ``None``, para remover o caractere da *string* de retorno; ou lançar uma exceção :exc:`LookupError`, para mapear o caractere para si mesmo.
sv: Returnerar en kopia av strängen där varje tecken har mappats genom den angivna översättningstabellen. Tabellen måste vara ett objekt som implementerar indexering via :meth:`~object.__getitem__`, vanligtvis en :term:`mapping` eller :term:`sequence`. När tabellen indexeras med en Unicode-ordinal (ett heltal) kan tabellobjektet göra något av följande: returnera en Unicode-ordinal eller en sträng, för att mappa tecknet till ett eller flera andra tecken; returnera ``None``, för att ta bort tecknet från retursträngen; eller skapa ett :exc:`LookupError`-undantag, för att mappa tecknet till sig själv.

source: You can use :meth:`str.maketrans` to create a translation map from character-to-character mappings in different formats.
pt_pt: Pode usar :meth:`str.maketrans` para criar um mapa de tradução a partir de mapeamentos de caractere para caractere em diferentes formatos.
sv: Du kan använda :meth:`str.maketrans` för att skapa en översättningsmappning från tecken-till-tecken-mappningar i olika format.

source: See also the :mod:`codecs` module for a more flexible approach to custom character mappings.
pt_pt: Consulte também o módulo :mod:`codecs` para uma abordagem mais flexível a mapeamentos de caracteres personalizados.
sv: Se även modulen :mod:`codecs` för en mer flexibel metod för anpassade teckenmappningar.

source: Return a copy of the string with all the cased characters [4]_ converted to uppercase. Note that ``s.upper().isupper()`` might be ``False`` if ``s`` contains uncased characters or if the Unicode category of the resulting character(s) is not "Lu" (Letter, uppercase), but e.g. "Lt" (Letter, titlecase).
pt_pt: Retorna uma cópia da *string* com todos os caracteres com caixa [4]_ convertidos para maiúsculas. Note que ``s.upper().isupper()`` pode ser ``False`` se ``s`` contiver caracteres sem caixa ou se a categoria Unicode dos caracteres resultantes não for "Lu" (Letra, maiúscula), mas por exemplo "Lt" (Letra, título).
sv: Returnerar en kopia av strängen med alla tecken med versaler [4]_ konverterade till versaler. Observera att ``s.upper().isupper()`` kan vara ``False`` om ``s`` innehåller obehandlade tecken eller om Unicode-kategorin för de resulterande tecknen inte är "Lu" (Letter, uppercase), utan t.ex. "Lt" (Letter, titlecase).

source: The uppercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.
sv: Den uppercasing-algoritm som används beskrivs i avsnitt 3.13 "Default Case Folding" i Unicode-standarden <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.

source: Return a copy of the string left filled with ASCII ``'0'`` digits to make a string of length *width*. A leading sign prefix (``'+'``/``'-'``) is handled by inserting the padding *after* the sign character rather than before. The original string is returned if *width* is less than or equal to ``len(s)``.
pt_pt: Retorna uma cópia da *string* preenchida à esquerda com dígitos ASCII ``'0'`` para criar uma *string* de comprimento *width*. Um prefixo de sinal inicial (``'+'``/``'-'``) é tratado inserindo o preenchimento *depois* do caractere de sinal em vez de antes. A *string* original é retornada se *width* for menor ou igual a ``len(s)``.
sv: Returnerar en kopia av strängen som fyllts med ASCII ``'0'`` siffror för att skapa en sträng med längden *bredd*. Ett ledande teckenprefix (``'+'``/``'-'``) hanteras genom att utfyllnaden infogas *efter* tecknet i stället för före. Den ursprungliga strängen returneras om *width* är mindre än eller lika med ``len(s)``.

source: Formatted String Literals (f-strings)
pt_pt: Literais de *string* formatadas (f-strings)
sv: Formaterade strängbokstäver (f-strängar)

source: The :keyword:`await` and :keyword:`async for` can be used in expressions within f-strings.
pt_pt: Os operadores :keyword:`await` e :keyword:`async for` podem ser usados em expressões dentro de f-strings.
sv: Nyckelorden :`await` och :keyword:`async for` kan användas i uttryck inom f-strängar.

source: Added the debugging operator (``=``)
pt_pt: Adicionado o operador de depuração (``=``)
sv: Lagt till felsökningsoperatorn (``=``)

source: Many restrictions on expressions within f-strings have been removed. Notably, nested strings, comments, and backslashes are now permitted.
pt_pt: Muitas restrições em expressões dentro de f-strings foram removidas. Notavelmente, *strings* aninhadas, comentários e barras invertidas são agora permitidos.
sv: Många restriktioner för uttryck inom f-strängar har tagits bort. Bland annat är nästlade strängar, kommentarer och backslash nu tillåtna.

source: An :dfn:`f-string` (formally a :dfn:`formatted string literal`) is a string literal that is prefixed with ``f`` or ``F``. This type of string literal allows embedding arbitrary Python expressions within *replacement fields*, which are delimited by curly brackets (``{}``). These expressions are evaluated at runtime, similarly to :meth:`str.format`, and are converted into regular :class:`str` objects. For example:
pt_pt: Uma :dfn:`f-string` (formalmente um :dfn:`literal de *string* formatada`) é um literal de *string* que é prefixado com ``f`` ou ``F``. Este tipo de literal de *string* permite incorporar expressões Python arbitrárias dentro de *campos de substituição*, que são delimitados por chavetas (``{}``). Estas expressões são avaliadas em tempo de execução, de forma semelhante a :meth:`str.format`, e são convertidas em objetos :class:`str` regulares. Por exemplo:
sv: En :dfn:`f-string` (formellt en :dfn:`formatted string literal`) är en stränglitual som har prefixet ``f`` eller ``F``. Den här typen av stränglital möjliggör inbäddning av godtyckliga Python-uttryck i *ersättningsfält*, som avgränsas av hakparenteser (``{}``). Dessa uttryck utvärderas vid körning, på liknande sätt som :meth:`str.format`, och konverteras till vanliga :class:`str`-objekt. Ett exempel:

source: >>> who = 'nobody' >>> nationality = 'Spanish' >>> f'{who.title()} expects the {nationality} Inquisition!' 'Nobody expects the Spanish Inquisition!'
sv: >>> vem = 'ingen' >>> nationalitet = 'spansk' >>> f'{who.title()} förväntar sig {nationality} inkvisitionen!' "Ingen förväntar sig den spanska inkvisitionen!

source: It is also possible to use a multi line f-string:
pt_pt: Também é possível usar uma f-string de várias linhas:
sv: Det är också möjligt att använda en f-sträng med flera linjer:

source: >>> f'''This is a string ... on two lines''' 'This is a string\non two lines'
sv: >>> f'''Detta är en sträng ... på två rader''' "Det här är en sträng på två rader

source: A single opening curly bracket, ``'{'``, marks a *replacement field* that can contain any Python expression:
pt_pt: Uma única chaveta de abertura, ``'{'``, marca um *campo de substituição* que pode conter qualquer expressão Python:
sv: En enda öppnande hakparentes, ``'{'``, markerar ett *ersättningsfält* som kan innehålla vilket Python-uttryck som helst:

source: >>> nationality = 'Spanish' >>> f'The {nationality} Inquisition!' 'The Spanish Inquisition!'
sv: >>> nationalitet = 'spansk' >>> f'Inkvisitionen {nationality}!' "Den spanska inkvisitionen!

source: To include a literal ``{`` or ``}``, use a double bracket:
pt_pt: Para incluir uma chaveta literal ``{`` ou ``}``, use chavetas duplas:
sv: För att inkludera en bokstavlig ``{`` eller ``}``, använd en dubbelparentes:

source: >>> x = 42 >>> f'{{x}} is {x}' '{x} is 42'
sv: >>> x = 42 >>> f'{{x}} är {x}' '{x} är 42'

source: Functions can also be used, and :ref:`format specifiers <formatstrings>`:
pt_pt: Funções também podem ser usadas, e :ref:`especificadores de formato <formatstrings>`:
sv: Funktioner kan också användas och :ref:`formatangivelser <formatstrings>`:

source: >>> from math import sqrt >>> f'√2 \N{ALMOST EQUAL TO} {sqrt(2):.5f}' '√2 ≈ 1.41421'
sv: >>> från math importera sqrt >>> f'√2 \N{Nästan lika med} {sqrt(2):.5f}' '√2 ≈ 1.41421'

source: Any non-string expression is converted using :func:`str`, by default:
pt_pt: Qualquer expressão não-*string* é convertida usando :func:`str`, por predefinição:
sv: Alla uttryck som inte är strängar konverteras som standard med :func:`str`:

source: >>> from fractions import Fraction >>> f'{Fraction(1, 3)}' '1/3'
sv: >>> from fractions import Fraktion >>> f'{Fraktion(1, 3)}' '1/3'

source: To use an explicit conversion, use the ``!`` (exclamation mark) operator, followed by any of the valid formats, which are:
pt_pt: Para usar uma conversão explícita, use o operador ``!`` (ponto de exclamação), seguido por qualquer um dos formatos válidos, que são:
sv: För att använda en explicit konvertering, använd operatorn ``!`` (utropstecken), följt av något av de giltiga formaten, vilka är:

source: Conversion
pt_pt: Conversão
sv: Konvertering

source: For example:
pt_pt: Por exemplo:
sv: Till exempel:

source: >>> from fractions import Fraction >>> f'{Fraction(1, 3)!s}' '1/3' >>> f'{Fraction(1, 3)!r}' 'Fraction(1, 3)' >>> question = '¿Dónde está el Presidente?' >>> print(f'{question!a}') '\xbfD\xf3nde est\xe1 el Presidente?'
sv: >>> from fractions import Fraktion >>> f'{Fraktion(1, 3)!s}' '1/3' >>> f'{Fraktion(1, 3)!r}' 'Fraktion(1, 3)' >>> fråga = '¿Dónde está el Presidente?' >>> print(f'{question!a}') '\xbfD\xf3nde est\xe1 el Presidente?'

source: While debugging it may be helpful to see both the expression and its value, by using the equals sign (``=``) after the expression. This preserves spaces within the brackets, and can be used with a converter. By default, the debugging operator uses the :func:`repr` (``!r``) conversion. For example:
pt_pt: Durante a depuração, pode ser útil ver tanto a expressão como o seu valor, usando o sinal de igual (``=``) após a expressão. Isto preserva os espaços dentro das chavetas e pode ser usado com um conversor. Por predefinição, o operador de depuração usa a conversão :func:`repr` (``!r``). Por exemplo:
sv: Vid felsökning kan det vara till hjälp att se både uttrycket och dess värde genom att använda likhetstecknet (``=``) efter uttrycket. Detta bevarar mellanslag inom parenteserna och kan användas med en konverterare. Som standard använder debugging-operatorn konverteringen :func:`repr` (``!r``). Till exempel

source: >>> from fractions import Fraction >>> calculation = Fraction(1, 3) >>> f'{calculation=}' 'calculation=Fraction(1, 3)' >>> f'{calculation = }' 'calculation = Fraction(1, 3)' >>> f'{calculation = !s}' 'calculation = 1/3'
sv: >>> from fractions import Fraktion >>> beräkning = Fraktion(1, 3) >>> f'{calculation=}' 'beräkning=Fraktion(1, 3)' >>> f'{beräkning = }' 'beräkning = Fraktion(1, 3)' >>> f'{beräkning = !s}' 'beräkning = 1/3'

source: Once the output has been evaluated, it can be formatted using a :ref:`format specifier <formatstrings>` following a colon (``':'``). After the expression has been evaluated, and possibly converted to a string, the :meth:`!__format__` method of the result is called with the format specifier, or the empty string if no format specifier is given. The formatted result is then used as the final value for the replacement field. For example:
pt_pt: Depois de a saída ter sido avaliada, pode ser formatada usando um :ref:`format specifier <formatstrings>` após um dois pontos (``':'``). Depois de a expressão ter sido avaliada, e possivelmente convertida para uma *string*, o método :meth:`!__format__` do resultado é chamado com o especificador de formato, ou a *string* vazia se nenhum especificador de formato for fornecido. O resultado formatado é então usado como o valor final para o campo de substituição. Por exemplo:
sv: När utdata har utvärderats kan de formateras med hjälp av :ref:`formatspecificerare <formatstrings>` efter ett kolon (``':'``). När uttrycket har utvärderats och eventuellt konverterats till en sträng anropas resultatets :meth:`!__format__`-metod med formatangivaren, eller den tomma strängen om ingen formatangivelse anges. Det formaterade resultatet används sedan som det slutliga värdet för ersättningsfältet. Till exempel

source: >>> from fractions import Fraction >>> f'{Fraction(1, 7):.6f}' '0.142857' >>> f'{Fraction(1, 7):_^+10}' '___+1/7___'
sv: >>> from fractions import Fraktion >>> f'{Fraktion(1, 7):.6f}' '0.142857' >>> f'{Fraktion(1, 7):_^+10}' '___+1/7___'

source: ``printf``-style String Formatting
pt_pt: Formatação de *string* no estilo ``printf``
sv: strängformatering i stil med ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). Using the newer :ref:`formatted string literals <f-strings>`, the :meth:`str.format` interface, or :ref:`template strings ($-strings) <template-strings-pep292>` may help avoid these errors. Each of these alternatives provides their own trade-offs and benefits of simplicity, flexibility, and/or extensibility.
sv: De formateringsoperationer som beskrivs här uppvisar en rad olika egenheter som leder till ett antal vanliga fel (t.ex. att tuples och ordböcker inte visas korrekt). Genom att använda den nyare :ref:`formatted string literals <f-strings>`, gränssnittet :meth:`str.format` eller :ref:`template strings ($-strings) <template-strings-pep292>` kan dessa fel undvikas. Vart och ett av dessa alternativ ger sina egna kompromisser och fördelar i form av enkelhet, flexibilitet och/eller utbyggbarhet.

source: String objects have one unique built-in operation: the ``%`` operator (modulo). This is also known as the string *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` function in the C language. For example:
pt_pt: Os objetos *string* têm uma operação incorporada única: o operador ``%`` (módulo). Isto também é conhecido como o operador de *formatação* ou *interpolação* de *string*. Dado ``format % values`` (onde *format* é uma *string*), as especificações de conversão ``%`` em *format* são substituídas por zero ou mais elementos de *values*. O efeito é semelhante ao uso da função :c:func:`sprintf` na linguagem C. Por exemplo:
sv: Strängobjekt har en unik inbyggd operation: operatorn ``%`` (modulo). Den är också känd som strängens *formatering* eller *interpolering*-operator. Givet ``format % värden`` (där *format* är en sträng), ersätts ``%`` konverteringsspecifikationer i *format* med noll eller flera element i *värden*. Effekten liknar användningen av funktionen :c:func:`sprintf` i C-språket. Ett exempel:

source: >>> print('%s has %d quote types.' % ('Python', 2)) Python has 2 quote types.
sv: >>> print('%s har %d citattyper.' % ('Python', 2)) Python har 2 citattyper.
