Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: objects
pt_pt: objetos
sv: objekt

source: comparing
pt_pt: comparando
sv: jämförelse

source: __eq__() (instance method)
pt_pt: __eq__() (método de instância)
sv: __eq__() (instansmetod)

source: __ne__() (instance method)
pt_pt: __ne__() (método de instância)
sv: __ne__() (instansmetod)

source: __lt__() (instance method)
pt_pt: __lt__() (método de instância)
sv: __lt__() (instansmetod)

source: __le__() (instance method)
pt_pt: __le__() (método de instância)
sv: __le__() (instansmetod)

source: __gt__() (instance method)
pt_pt: __gt__() (método de instância)
sv: __gt__() (instansmetod)

source: __ge__() (instance method)
pt_pt: __ge__() (método de instância)
sv: __ge__() (instansmetod)

source: in
pt_pt: em
sv: i

source: not in
pt_pt: não em
sv: inte i

source: integer
pt_pt: inteiro
sv: heltal

source: floating-point
pt_pt: ponto flutuante
sv: flyttal

source: complex number
pt_pt: número complexo
sv: komplext tal

source: language
pt_pt: linguagem
sv: språk

source: literals
pt_pt: literais
sv: bokstäver

source: octal
sv: oktal

source: binary
pt_pt: binário
sv: binär

source: arithmetic
pt_pt: aritmética
sv: aritmetisk

source: built-in function
pt_pt: função incorporada
sv: inbyggd funktion

source: float
sv: flyt

source: complex
sv: komplex

source: unary operator
pt_pt: operador unário
sv: unär operator

source: binary operator
pt_pt: operador binário
sv: binär operatör

source: / (slash)
pt_pt: / (barra)
sv: / (snedstreck)

source: % (percent)
pt_pt: % (percentagem)
sv: % (procent)

source: operations on
pt_pt: operações em
sv: operationer på

source: conjugate() (complex number method)
pt_pt: conjugate() (método de número complexo)
sv: conjugate() (metod för komplexa tal)

source: module
pt_pt: módulo
sv: modul

source: math
sv: matematik

source: floor() (in module math)
pt_pt: floor() (no módulo math)
sv: floor() (i modul math)

source: ceil() (in module math)
pt_pt: ceil() (no módulo math)
sv: ceil() (i modul math)

source: trunc() (in module math)
pt_pt: trunc() (no módulo math)
sv: trunc() (i modul matematik)

source: conversions
pt_pt: conversões
sv: konverteringar

source: bitwise
pt_pt: bit a bit
sv: bitvis

source: shifting
pt_pt: deslocamento
sv: förskjutning

source: masking
pt_pt: mascaramento
sv: maskering

source: | (vertical bar)
pt_pt: | (barra vertical)
sv: | (vertikal stapel)

source: values
pt_pt: valores
sv: värden

source: iterator protocol
pt_pt: protocolo de iterador
sv: iteratorprotokoll

source: protocol
pt_pt: protocolo
sv: protokoll

source: sequence
pt_pt: sequência
sv: sekvens

source: container
pt_pt: contentor
sv: behållare

source: iteration over
pt_pt: iteração sobre
sv: iteration över

source: concatenation
pt_pt: concatenação
sv: sammanfogning

source: operation
pt_pt: operação
sv: drift

source: repetition
pt_pt: repetição
sv: upprepning

source: subscript
pt_pt: índice
sv: index

source: slice
pt_pt: fatia
sv: skiva

source: count() (sequence method)
sv: count() (sekvensmetod)

source: index() (sequence method)
sv: index() (sekvensmetod)

source: over mutable sequence
pt_pt: sobre sequência mutável
sv: över muterbar sekvens

source: mutable sequence
pt_pt: sequência mutável
sv: muterbar sekvens

source: loop over
pt_pt: ciclo sobre
sv: loopa över

source: immutable
pt_pt: imutável
sv: oföränderlig

source: tuple
pt_pt: tupla
sv: tupel

source: mutable
pt_pt: mutável
sv: föränderlig

source: list
pt_pt: lista
sv: lista

source: type
pt_pt: tipo
sv: typ

source: assignment
pt_pt: atribuição
sv: uppgift

source: del
sv: rad

source: append() (sequence method)
sv: append() (sekvensmetod)

source: clear() (sequence method)
sv: clear() (sekvensmetod)

source: copy() (sequence method)
sv: copy() (sekvensmetod)

source: extend() (sequence method)
sv: extend() (sekvensmetod)

source: insert() (sequence method)
sv: insert() (sekvensmetod)

source: pop() (sequence method)
sv: pop() (sekvensmetod)

source: remove() (sequence method)
sv: remove() (sekvensmetod)

source: reverse() (sequence method)
sv: reverse() (sekvensmetod)

source: range
pt_pt: intervalo
sv: intervall

source: string
sv: sträng

source: text sequence type
pt_pt: tipo de sequência de texto
sv: text sekvens typ

source: str (built-in class)
pt_pt: str (classe incorporada)
sv: str (inbyggd klass)

source: (see also string)
pt_pt: (ver também string)
sv: (se även sträng)

source: buffer protocol
pt_pt: protocolo de buffer
sv: buffertprotokoll

source: bytes
sv: byte

source: methods
pt_pt: métodos
sv: metoder

source: universal newlines
pt_pt: novas linhas universais
sv: universella nya rader

source: str.splitlines method
pt_pt: método str.splitlines
sv: str.splitlines-metoden

source: ! formatted string literal
pt_pt: literal de string formatada
sv: ! formaterad sträng bokstavlig

source: formatted string literals
pt_pt: literais de string formatadas
sv: formaterade stränglitteraler

source: ! f-string
sv: ! f-sträng

source: f-strings
sv: f-strängar

source: fstring
sv: fsträng

source: interpolated string literal
pt_pt: literal de string interpolada
sv: interpolerad sträng bokstavlig

source: formatted literal
pt_pt: literal formatada
sv: formaterad bokstav

source: interpolated literal
pt_pt: literal interpolada
sv: interpolerad bokstavlig

source: {} (curly brackets)
pt_pt: {} (chavetas)
sv: {} (inom hakparentes)

source: in formatted string literal
pt_pt: em literal de string formatada
sv: i formaterad sträng bokstavlig

source: ! (exclamation mark)
pt_pt: ! (ponto de exclamação)
sv: ! (utropstecken)

source: : (colon)
pt_pt: : (dois pontos)
sv: : (kolon)

source: = (equals)
pt_pt: = (igual)
sv: = (lika med)

source: for help in debugging using string literals
pt_pt: para ajuda na depuração usando literais de string
sv: för hjälp med felsökning med hjälp av stränglitteraler

source: formatting, string (%)
pt_pt: formatação, string (%)
sv: formatering, sträng (%)

source: interpolation, string (%)
pt_pt: interpolação, string (%)
sv: interpolation, sträng (%)

source: formatting, printf
pt_pt: formatação, printf
sv: formatering, printf

source: printf-style formatting
pt_pt: formatação estilo printf
sv: formatering i printf-stil

source: sprintf-style formatting
pt_pt: formatação estilo sprintf
sv: formatering i sprintf-stil

source: () (parentheses)
pt_pt: () (parênteses)
sv: () (inom parentes)

source: in printf-style formatting
pt_pt: em formatação estilo printf
sv: i formatering i printf-stil

source: . (dot)
pt_pt: . (ponto)
sv: . (punkt)

source: space
pt_pt: espaço
sv: tid

source: binary sequence types
pt_pt: tipos de sequências binárias
sv: binära sekvenstyper

source: memoryview
sv: minnesvy

source: bytes.splitlines method
pt_pt: método bytes.splitlines
sv: bytes.splitlines-metoden

source: bytearray.splitlines method
pt_pt: método bytearray.splitlines
sv: bytearray.splitlines-metoden

source: formatting
pt_pt: formatação
sv: formatering

source: bytes (%)
sv: byte (%)

source: interpolation
pt_pt: interpolação
sv: interpolering

source: mapping
pt_pt: mapeamento
sv: kartläggning

source: dictionary
pt_pt: dicionário
sv: ordbok

source: context manager
pt_pt: gestor de contexto
sv: kontexthanterare

source: context management protocol
pt_pt: protocolo de gestão de contexto
sv: protokoll för kontexthantering

source: context management
pt_pt: gestão de contexto
sv: hantering av sammanhang

source: annotation
pt_pt: anotação
sv: anteckning

source: type annotation; type hint
pt_pt: anotação de tipo; dica de tipo
sv: typ anteckning; typ ledtråd

source: GenericAlias
sv: GeneriskAlias

source: Generic
pt_pt: Genérico
sv: Allmän

source: Union
pt_pt: União
sv: Förening

source: union
pt_pt: união
sv: forbund

source: method
pt_pt: método
sv: metod

source: code
pt_pt: código
sv: kod

source: code object
pt_pt: objeto código
sv: kodobjekt

source: compile
sv: sammanställa

source: __code__ (function object attribute)
pt_pt: __code__ (atributo de objeto função)
sv: __code__ (funktion objektattribut)

source: exec
sv: avrättning

source: ellipsis literal
pt_pt: literal de reticências
sv: ellips bokstavlig

source: Operation
pt_pt: Operação

source: Sequence Methods
pt_pt: Métodos de sequência

source: Sequence types also support the following methods:
pt_pt: Os tipos de sequência também suportam os seguintes métodos:

source: Return the total number of occurrences of *value* in *sequence*.
pt_pt: Retorna o número total de ocorrências de *value* em *sequence*.

source: Return the index of the first occurrence of *value* in *sequence*.
pt_pt: Retorna o índice da primeira ocorrência de *value* em *sequence*.

source: Raises :exc:`ValueError` if *value* is not found in *sequence*.
pt_pt: Lança :exc:`ValueError` se *value* não for encontrado em *sequence*.

source: The *start* or *stop* arguments allow for efficient searching of subsections of the sequence, beginning at *start* and ending at *stop*. This is roughly equivalent to ``start + sequence[start:stop].index(value)``, only without copying any data.
pt_pt: Os argumentos *start* ou *stop* permitem uma pesquisa eficiente de subsecções da sequência, começando em *start* e terminando em *stop*. Isto é aproximadamente equivalente a ``start + sequence[start:stop].index(value)``, mas sem copiar quaisquer dados.

source: Not all sequence types support passing the *start* and *stop* arguments.
pt_pt: Nem todos os tipos de sequência suportam a passagem dos argumentos *start* e *stop*.

source: Mutable Sequence Methods
pt_pt: Métodos de sequência mutável

source: Mutable sequence types also support the following methods:
pt_pt: Os tipos de sequência mutável também suportam os seguintes métodos:

source: Append *value* to the end of the sequence This is equivalent to writing ``seq[len(seq):len(seq)] = [value]``.
pt_pt: Acrescenta *value* ao final da sequência. Isto é equivalente a escrever ``seq[len(seq):len(seq)] = [value]``.

source: Remove all items from *sequence*. This is equivalent to writing ``del sequence[:]``.
pt_pt: Remove todos os itens de *sequence*. Isto é equivalente a escrever ``del sequence[:]``.

source: Create a shallow copy of *sequence*. This is equivalent to writing ``sequence[:]``.
pt_pt: Cria uma cópia superficial de *sequence*. Isto é equivalente a escrever ``sequence[:]``.

source: The :meth:`!copy` method is not part of the :class:`~collections.abc.MutableSequence` :class:`~abc.ABC`, but most concrete mutable sequence types provide it.
pt_pt: O método :meth:`!copy` não faz parte da :class:`~collections.abc.MutableSequence` :class:`~abc.ABC`, mas a maioria dos tipos de sequência mutável concretos fornecem-no.

source: Extend *sequence* with the contents of *iterable*. For the most part, this is the same as writing ``seq[len(seq):len(seq)] = iterable``.
pt_pt: Estende *sequence* com o conteúdo de *iterable*. Na maior parte, isto é o mesmo que escrever ``seq[len(seq):len(seq)] = iterable``.

source: Insert *value* into *sequence* at the given *index*. This is equivalent to writing ``sequence[index:index] = [value]``.
pt_pt: Insere *value* em *sequence* no *index* dado. Isto é equivalente a escrever ``sequence[index:index] = [value]``.

source: Retrieve the item at *index* and also removes it from *sequence*. By default, the last item in *sequence* is removed and returned.
pt_pt: Recupera o item em *index* e também o remove de *sequence*. Por predefinição, o último item em *sequence* é removido e retornado.

source: Remove the first item from *sequence* where ``sequence[i] == value``.
pt_pt: Remove o primeiro item de *sequence* onde ``sequence[i] == value``.

source: Reverse the items of *sequence* in place. This method maintains economy of space when reversing a large sequence. To remind users that it operates by side-effect, it returns ``None``.
pt_pt: Inverte os itens de *sequence* *in-place*. Este método mantém a economia de espaço ao inverter uma grande sequência. Para lembrar os utilizadores de que opera por efeito lateral, retorna ``None``.

source: Return the lowest index in the string where substring *sub* is found within the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found. For example::
pt_pt: Retorna o índice mais baixo na *string* onde a substring *sub* é encontrada dentro da fatia ``s[start:end]``. Os argumentos opcionais *start* e *end* são interpretados como na notação de fatia. Retorna ``-1`` se *sub* não for encontrada. Por exemplo:

source: See also :meth:`rfind` and :meth:`index`.
pt_pt: Consulte também :meth:`rfind` e :meth:`index`.

source: If there are two arguments, they must be strings of equal length, and in the resulting dictionary, each character in *from* will be mapped to the character at the same position in *to*. If there is a third argument, it must be a string, whose characters will be mapped to ``None`` in the result.
pt_pt: Se houver dois argumentos, devem ser *strings* de comprimento igual, e no dicionário resultante, cada caractere em *from* será mapeado para o caractere na mesma posição em *to*. Se houver um terceiro argumento, deve ser uma *string*, cujos caracteres serão mapeados para ``None`` no resultado.

source: Representation
pt_pt: Representação

source: See also :meth:`istitle`.
pt_pt: Consulte também :meth:`istitle`.

source: Return a copy of the sequence with specified leading bytes removed. The *bytes* argument is a binary sequence specifying the set of byte values to be removed. If omitted or ``None``, the *bytes* argument defaults to removing ASCII whitespace. The *bytes* argument is not a prefix; rather, all combinations of its values are stripped::
pt_pt: Retorna uma cópia da sequência com os bytes iniciais especificados removidos. O argumento *bytes* é uma sequência binária que especifica o conjunto de valores de bytes a serem removidos. Se omitido ou ``None``, o argumento *bytes* remove espaços em branco ASCII por predefinição. O argumento *bytes* não é um prefixo; em vez disso, todas as combinações dos seus valores são removidas:

source: Return a copy of the sequence with specified trailing bytes removed. The *bytes* argument is a binary sequence specifying the set of byte values to be removed. If omitted or ``None``, the *bytes* argument defaults to removing ASCII whitespace. The *bytes* argument is not a suffix; rather, all combinations of its values are stripped::
pt_pt: Retorna uma cópia da sequência com os bytes finais especificados removidos. O argumento *bytes* é uma sequência binária que especifica o conjunto de valores de bytes a serem removidos. Se omitido ou ``None``, o argumento *bytes* remove espaços em branco ASCII por predefinição. O argumento *bytes* não é um sufixo; em vez disso, todas as combinações dos seus valores são removidas:

source: Return a copy of the sequence with specified leading and trailing bytes removed. The *bytes* argument is a binary sequence specifying the set of byte values to be removed. If omitted or ``None``, the *bytes* argument defaults to removing ASCII whitespace. The *bytes* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
pt_pt: Retorna uma cópia da sequência com os bytes iniciais e finais especificados removidos. O argumento *bytes* é uma sequência binária que especifica o conjunto de valores de bytes a serem removidos. Se omitido ou ``None``, o argumento *bytes* remove espaços em branco ASCII por predefinição. O argumento *bytes* não é um prefixo ou sufixo; em vez disso, todas as combinações dos seus valores são removidas:

source: If a subclass of dict defines a method :meth:`~object.__missing__` and *key* is not present, the ``d[key]`` operation calls that method with the key *key* as argument. The ``d[key]`` operation then returns or raises whatever is returned or raised by the ``__missing__(key)`` call. No other operations or methods invoke :meth:`~object.__missing__`. If :meth:`~object.__missing__` is not defined, :exc:`KeyError` is raised. :meth:`~object.__missing__` must be a method; it cannot be an instance variable::
pt_pt: Se uma subclasse de dict definir um método :meth:`~object.__missing__` e *key* não estiver presente, a operação ``d[key]`` chama esse método com a chave *key* como argumento. A operação ``d[key]`` retorna ou lança o que for retornado ou lançado pela chamada ``__missing__(key)``. Nenhuma outra operação ou método invoca :meth:`~object.__missing__`. Se :meth:`~object.__missing__` não for definido, é lançada uma exceção :exc:`KeyError`. :meth:`~object.__missing__` deve ser um método; não pode ser uma variável de instância:

source: The example above shows part of the implementation of :class:`collections.Counter`. A different :meth:`!__missing__` method is used by :class:`collections.defaultdict`.
pt_pt: O exemplo acima mostra parte da implementação de :class:`collections.Counter`. Um método :meth:`!__missing__` diferente é usado por :class:`collections.defaultdict`.

source: Update the dictionary with the key/value pairs from *mapping* or *iterable* and *kwargs*, overwriting existing keys. Return ``None``.
pt_pt: Atualiza o dicionário com os pares chave/valor de *mapping* ou *iterable* e *kwargs*, sobrescrevendo chaves existentes. Retorna ``None``.

source: def send_post_request(url: str, body: dict[str, int]) -> None: ...
pt_pt: def enviar_pedido_post(url: str, corpo: dict[str, int]) -> None: ...

source: Methods are functions that are called using the attribute notation. There are two flavors: :ref:`built-in methods <builtin-methods>` (such as :meth:`~list.append` on lists) and :ref:`class instance method <instance-methods>`. Built-in methods are described with the types that support them.
pt_pt: Os métodos são funções que são chamadas usando a notação de atributo. Existem dois tipos: :ref:`métodos incorporados <builtin-methods>` (como :meth:`~list.append` em listas) e :ref:`métodos de instância de classe <instance-methods>`. Os métodos incorporados são descritos com os tipos que os suportam.

source: Accessing :attr:`~function.__code__` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"__code__"``.
pt_pt: Aceder a :attr:`~function.__code__` lança um :ref:`evento de auditoria <auditing>` ``object.__getattr__`` com os argumentos ``obj`` e ``"__code__"``.

source: This object is commonly used to indicate that something is omitted. It supports no special operations. There is exactly one ellipsis object, named :const:`Ellipsis` (a built-in name). ``type(Ellipsis)()`` produces the :const:`Ellipsis` singleton.
pt_pt: Este objeto é comumente usado para indicar que algo foi omitido. Não suporta operações especiais. Existe exatamente um objeto reticências, chamado :const:`Ellipsis` (um nome incorporado). ``type(Ellipsis)()`` produz o singleton :const:`Ellipsis`.

source: In typical use, ``...`` as the ``Ellipsis`` object appears in a few different places, for instance:
pt_pt: Em uso típico, ``...`` como o objeto ``Ellipsis`` aparece em alguns lugares diferentes, por exemplo:

source: In type annotations, such as :ref:`callable arguments <annotating-callables>` or :ref:`tuple elements <annotating-tuples>`.
pt_pt: Em anotações de tipo, como :ref:`argumentos chamáveis <annotating-callables>` ou :ref:`elementos de tuplo <annotating-tuples>`.

source: As the body of a function instead of a :ref:`pass statement <tut-pass>`.
pt_pt: Como o corpo de uma função em vez de uma :ref:`instrução pass <tut-pass>`.

source: In third-party libraries, such as `Numpy's slicing and striding <https://numpy.org/doc/stable/user/basics.indexing.html#slicing-and-striding>`_.
pt_pt: Em bibliotecas de terceiros, como `fatiamento e passos do Numpy <https://numpy.org/doc/stable/user/basics.indexing.html#slicing-and-striding>`_.

source: Python also uses three dots in ways that are not ``Ellipsis`` objects, for instance:
pt_pt: O Python também usa três pontos de formas que não são objetos ``Ellipsis``, por exemplo:

source: Doctest's :const:`ELLIPSIS <doctest.ELLIPSIS>`, as a pattern for missing content.
pt_pt: :const:`ELLIPSIS <doctest.ELLIPSIS>` do Doctest, como um padrão para conteúdo em falta.

source: The default Python prompt of the :term:`interactive` shell when partial input is incomplete.
pt_pt: O prompt padrão do Python na :term:`shell interativa` quando a entrada parcial está incompleta.

source: Lastly, the Python documentation often uses three dots in conventional English usage to mean omitted content, even in code examples that also use them as the ``Ellipsis``.
pt_pt: Por fim, a documentação do Python muitas vezes usa três pontos no uso convencional do inglês para significar conteúdo omitido, mesmo em exemplos de código que também os usam como ``Ellipsis``.

source: Boolean
pt_pt: Booleano

source: + (plus)
pt_pt: + (mais)

source: - (minus)
pt_pt: - (menos)

source: * (asterisk)
pt_pt: * (asterisco)

source: ^ (caret)
pt_pt: ^ (acento circunflexo)

source: & (ampersand)
pt_pt: & (e comercial)

source: ~ (tilde)
pt_pt: ~ (til)

source: iterator
pt_pt: iterador

source: iteration
pt_pt: iteração

source: min
pt_pt: mínimo

source: max
pt_pt: máximo

source: loop
pt_pt: ciclo

source: interpolation, printf
pt_pt: interpolação, printf

source: # (hash)
pt_pt: # (cerquilha)

source: set
pt_pt: conjunto
