Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Create a :class:`memoryview` that references *object*. *object* must support the buffer protocol. Built-in objects that support the buffer protocol include :class:`bytes` and :class:`bytearray`.
pt_pt: Cria uma :class:`memoryview` que referencia *object*. *object* deve suportar o protocolo de buffer. Objetos incorporados que suportam o protocolo de buffer incluem :class:`bytes` e :class:`bytearray`.
sv: Skapa en :class:`memoryview` som refererar till *object*. *object* måste stödja buffertprotokollet. Inbyggda objekt som stöder buffertprotokollet inkluderar :class:`bytes` och :class:`bytearray`.

source: A :class:`memoryview` has the notion of an *element*, which is the atomic memory unit handled by the originating *object*. For many simple types such as :class:`bytes` and :class:`bytearray`, an element is a single byte, but other types such as :class:`array.array` may have bigger elements.
pt_pt: Uma :class:`memoryview` tem a noção de um *elemento*, que é a unidade de memória atómica manipulada pelo *object* de origem. Para muitos tipos simples, como :class:`bytes` e :class:`bytearray`, um elemento é um único byte, mas outros tipos, como :class:`array.array`, podem ter elementos maiores.
sv: En :class:`memoryview` har begreppet *element*, som är den atomära minnesenhet som hanteras av det ursprungliga *objektet*. För många enkla typer som :class:`bytes` och :class:`bytearray` är ett element en enda byte, men andra typer som :class:`array.array` kan ha större element.

source: ``len(view)`` is equal to the length of :class:`~memoryview.tolist`, which is the nested list representation of the view. If ``view.ndim = 1``, this is equal to the number of elements in the view.
pt_pt: ``len(view)`` é igual ao comprimento de :class:`~memoryview.tolist`, que é a representação de lista aninhada da vista. Se ``view.ndim = 1``, isto é igual ao número de elementos na vista.
sv: ``len(view)`` är lika med längden på :class:`~memoryview.tolist`, som är den nästlade listrepresentationen av vyn. Om ``view.ndim = 1`` är detta lika med antalet element i vyn.

source: If ``view.ndim == 0``, ``len(view)`` now raises :exc:`TypeError` instead of returning 1.
pt_pt: Se ``view.ndim == 0``, ``len(view)`` agora lança :exc:`TypeError` em vez de retornar 1.
sv: Om ``view.ndim == 0``, ``len(view)`` ger nu :exc:`TypeError` istället för att returnera 1.

source: The :class:`~memoryview.itemsize` attribute will give you the number of bytes in a single element.
pt_pt: O atributo :class:`~memoryview.itemsize` dar-lhe-á o número de bytes num único elemento.
sv: Attributet :class:`~memoryview.itemsize` ger dig antalet byte i ett enda element.

source: A :class:`memoryview` supports slicing and indexing to expose its data. One-dimensional slicing will result in a subview::
pt_pt: Uma :class:`memoryview` suporta fatiamento e indexação para expor os seus dados. O fatiamento unidimensional resultará numa subvista:
sv: En :class:`memoryview` stöder skivning och indexering för att exponera sina data. Endimensionell skivning kommer att resultera i en undervy::

source: >>> v = memoryview(b'abcefg') >>> v[1] 98 >>> v[-1] 103 >>> v[1:4] <memory at 0x7f3ddc9f4350> >>> bytes(v[1:4]) b'bce'
sv: &gt;&gt;&gt; v = minnesvy(b'abcefg') &gt;&gt;&gt; v[1] 98 &gt;&gt;&gt; v[-1] 103 &gt;&gt;&gt; v[1:4] <memory at 0x7f3ddc9f4350> &gt;&gt;&gt; bytes(v[1:4]) b'bce'

source: If :class:`~memoryview.format` is one of the native format specifiers from the :mod:`struct` module, indexing with an integer or a tuple of integers is also supported and returns a single *element* with the correct type. One-dimensional memoryviews can be indexed with an integer or a one-integer tuple. Multi-dimensional memoryviews can be indexed with tuples of exactly *ndim* integers where *ndim* is the number of dimensions. Zero-dimensional memoryviews can be indexed with the empty tuple.
pt_pt: Se :class:`~memoryview.format` for um dos especificadores de formato nativos do módulo :mod:`struct`, a indexação com um inteiro ou um tuplo de inteiros também é suportada e retorna um único *elemento* com o tipo correto. Vistas de memória unidimensionais podem ser indexadas com um inteiro ou um tuplo de um inteiro. Vistas de memória multidimensionais podem ser indexadas com tuplos de exatamente *ndim* inteiros, onde *ndim* é o número de dimensões. Vistas de memória zero-dimensionais podem ser indexadas com o tuplo vazio.
sv: Om :class:`~memoryview.format` är en av de ursprungliga formatspecifikationerna från modulen :mod:`struct` stöds även indexering med ett heltal eller en tupel av heltal och returnerar ett enda *element* med rätt typ. Endimensionella minnesvyer kan indexeras med ett heltal eller en tupel med ett heltal. Flerdimensionella minnesvyer kan indexeras med tupler av exakt *ndim* heltal där *ndim* är antalet dimensioner. Nolldimensionella minnesvyer kan indexeras med den tomma tupeln.

source: Here is an example with a non-byte format::
pt_pt: Aqui está um exemplo com um formato não-byte:
sv: Här är ett exempel med ett format som inte är byte::

source: >>> import array >>> a = array.array('l', [-11111111, 22222222, -33333333, 44444444]) >>> m = memoryview(a) >>> m[0] -11111111 >>> m[-1] 44444444 >>> m[::2].tolist() [-11111111, -33333333]
sv: >>> importera array >>> a = array.array('l', [-11111111, 22222222, -33333333, 44444444]) >>> m = minnesvy(a) >>> m[0] -11111111 >>> m[-1] 44444444 >>> m[::2].tolist() [-11111111, -33333333]

source: If the underlying object is writable, the memoryview supports one-dimensional slice assignment. Resizing is not allowed::
pt_pt: Se o objeto subjacente for gravável, a memoryview suporta atribuição de fatia unidimensional. O redimensionamento não é permitido:
sv: Om det underliggande objektet är skrivbart stöder minnesvyn endimensionell tilldelning av skivor. Storleksändring är inte tillåtet::

source: >>> data = bytearray(b'abcefg') >>> v = memoryview(data) >>> v.readonly False >>> v[0] = ord(b'z') >>> data bytearray(b'zbcefg') >>> v[1:4] = b'123' >>> data bytearray(b'z123fg') >>> v[2:3] = b'spam' Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: memoryview assignment: lvalue and rvalue have different structures >>> v[2:6] = b'spam' >>> data bytearray(b'z1spam')
sv: &gt;&gt;&gt; data = bytearray(b'abcefg') &gt;&gt;&gt; v = minnesvy(data) &gt;&gt;&gt; v.readonly Falsk &gt;&gt;&gt; v[0] = ord(b'z') &gt;&gt;&gt; data bytearray(b'zbcefg') &gt;&gt;&gt; v[1:4] = b'123' &gt;&gt;&gt; data bytearray(b'z123fg') &gt;&gt;&gt; v[2:3] = b'spam' Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> ValueError: minnesvytilldelning: lvärde och rvärde har olika strukturer &gt;&gt;&gt; v[2:6] = b'spam' &gt;&gt;&gt; data bytearray(b'z1spam')

source: One-dimensional memoryviews of :term:`hashable` (read-only) types with formats 'B', 'b' or 'c' are also hashable. The hash is defined as ``hash(m) == hash(m.tobytes())``::
pt_pt: Vistas de memória unidimensionais de tipos :term:`hashable` (apenas leitura) com formatos 'B', 'b' ou 'c' também são hashable. O hash é definido como ``hash(m) == hash(m.tobytes())``:
sv: Endimensionella minnesvyer av :term:`hashable` (skrivskyddade) typer med formaten 'B', 'b' eller 'c' är också hashbara. Hash definieras som ``hash(m) == hash(m.tobytes())``::

source: >>> v = memoryview(b'abcefg') >>> hash(v) == hash(b'abcefg') True >>> hash(v[2:4]) == hash(b'ce') True >>> hash(v[::-2]) == hash(b'abcefg'[::-2]) True
sv: >>> v = minnesvy(b'abcefg') >>> hash(v) == hash(b'abcefg') Sant >>> hash(v[2:4]) == hash(b'ce') Sant >>> hash(v[::-2]) == hash(b'abcefg'[::-2]) Sant

source: One-dimensional memoryviews can now be sliced. One-dimensional memoryviews with formats 'B', 'b' or 'c' are now :term:`hashable`.
pt_pt: Vistas de memória unidimensionais podem agora ser fatiadas. Vistas de memória unidimensionais com formatos 'B', 'b' ou 'c' são agora :term:`hashable`.
sv: Endimensionella minnesvyer kan nu skivas. Endimensionella minnesvyer med formaten 'B', 'b' eller 'c' är nu :term:`hashable`.

source: memoryview is now registered automatically with :class:`collections.abc.Sequence`
pt_pt: memoryview é agora registada automaticamente com :class:`collections.abc.Sequence`
sv: memoryview registreras nu automatiskt med :class:`collections.abc.Sequence`

source: memoryviews can now be indexed with tuple of integers.
pt_pt: memoryviews podem agora ser indexadas com um tuplo de inteiros.
sv: minnesvyer kan nu indexeras med tupel av heltal.

source: memoryview is now a :term:`generic type`.
sv: memoryview är nu en :term:`generisk typ`.

source: :class:`memoryview` has several methods:
pt_pt: :class:`memoryview` tem vários métodos:
sv: :class:`memoryview` har flera metoder:

source: A memoryview and a :pep:`3118` exporter are equal if their shapes are equivalent and if all corresponding values are equal when the operands' respective format codes are interpreted using :mod:`struct` syntax.
pt_pt: Uma memoryview e um exportador :pep:`3118` são iguais se as suas formas forem equivalentes e se todos os valores correspondentes forem iguais quando os códigos de formato dos operandos forem interpretados usando a sintaxe :mod:`struct`.
sv: En minnesvy och en :pep:`3118` exportör är lika om deras former är likvärdiga och om alla motsvarande värden är lika när operandernas respektive formatkoder tolkas med :mod:`struct` syntax.

source: For the subset of :mod:`struct` format strings currently supported by :meth:`tolist`, ``v`` and ``w`` are equal if ``v.tolist() == w.tolist()``::
pt_pt: Para o subconjunto de *strings* de formato :mod:`struct` atualmente suportadas por :meth:`tolist`, ``v`` e ``w`` são iguais se ``v.tolist() == w.tolist()``:
sv: För den delmängd av :mod:`struct` formatsträngar som för närvarande stöds av :meth:`tolist`, är ``v`` och ``w`` lika om ``v.tolist() == w.tolist()``::

source: >>> import array >>> a = array.array('I', [1, 2, 3, 4, 5]) >>> b = array.array('d', [1.0, 2.0, 3.0, 4.0, 5.0]) >>> c = array.array('b', [5, 3, 1]) >>> x = memoryview(a) >>> y = memoryview(b) >>> x == a == y == b True >>> x.tolist() == a.tolist() == y.tolist() == b.tolist() True >>> z = y[::-2] >>> z == c True >>> z.tolist() == c.tolist() True
sv: >>> importera array >>> a = array.array('I', [1, 2, 3, 4, 5]) >>> b = array.array('d', [1,0, 2,0, 3,0, 4,0, 5,0]) >>> c = matris.matris('b', [5, 3, 1]) >>> x = minnesvy(a) >>> y = minnesvy(b) >>> x == a == y == b Sant >>> x.tolist() == a.tolist() == y.tolist() == b.tolist() Sant >>> z = y[::-2] >>> z == c Sant >>> z.tolist() == c.tolist() Sant

source: If either format string is not supported by the :mod:`struct` module, then the objects will always compare as unequal (even if the format strings and buffer contents are identical)::
pt_pt: Se qualquer *string* de formato não for suportada pelo módulo :mod:`struct`, então os objetos serão sempre comparados como desiguais (mesmo que as *strings* de formato e os conteúdos do buffer sejam idênticos):
sv: Om någon av formatsträngarna inte stöds av modulen :mod:`struct`, kommer objekten alltid att jämföras som olika (även om formatsträngarna och buffertinnehållet är identiska)::

source: >>> from ctypes import BigEndianStructure, c_long >>> class BEPoint(BigEndianStructure): ... _fields_ = [("x", c_long), ("y", c_long)] ... >>> point = BEPoint(100, 200) >>> a = memoryview(point) >>> b = memoryview(point) >>> a == point False >>> a == b False
sv: >>> från ctypes importera BigEndianStructure, c_long >>> class BEPoint(BigEndianStructure): ... _fields_ = [("x", c_long), ("y", c_long)] ... >>> punkt = BEPoint(100, 200) >>> a = minnesvy(punkt) >>> b = minnesvy(punkt) >>> a == punkt Falsk >>> a == b Falsk

source: Note that, as with floating-point numbers, ``v is w`` does *not* imply ``v == w`` for memoryview objects.
pt_pt: Note que, tal como com números de ponto flutuante, ``v is w`` *não* implica ``v == w`` para objetos memoryview.
sv: Observera att, precis som med flyttal, ``v är w`` inte *innebär* ``v == w`` för memoryview-objekt.

source: Previous versions compared the raw memory disregarding the item format and the logical array structure.
pt_pt: Versões anteriores comparavam a memória bruta, ignorando o formato do item e a estrutura lógica do array.
sv: Tidigare versioner jämförde råminnet utan att ta hänsyn till objektformatet och den logiska arraystrukturen.

source: Return the data in the buffer as a bytestring. This is equivalent to calling the :class:`bytes` constructor on the memoryview. ::
pt_pt: Retorna os dados no buffer como uma *string* de bytes. Isto é equivalente a chamar o construtor :class:`bytes` na memoryview:
sv: Returnerar data i bufferten som en bytestring. Detta är likvärdigt med att anropa :class:`bytes`-konstruktören på minnesvyn. ::

source: >>> m = memoryview(b"abc") >>> m.tobytes() b'abc' >>> bytes(m) b'abc'
sv: >>> m = minnesvy(b"abc") >>> m.tobytes() b'abc' >>> bytes(m) b'abc'

source: For non-contiguous arrays the result is equal to the flattened list representation with all elements converted to bytes. :meth:`tobytes` supports all format strings, including those that are not in :mod:`struct` module syntax.
pt_pt: Para arrays não contíguos, o resultado é igual à representação de lista achatada com todos os elementos convertidos para bytes. :meth:`tobytes` suporta todas as *strings* de formato, incluindo aquelas que não estão na sintaxe do módulo :mod:`struct`.
sv: För icke sammanhängande matriser är resultatet lika med den tillplattade listrepresentationen med alla element konverterade till bytes. :meth:`tobytes` stöder alla formatsträngar, inklusive de som inte är i :mod:`struct`-modulsyntax.

source: *order* can be {'C', 'F', 'A'}. When *order* is 'C' or 'F', the data of the original array is converted to C or Fortran order. For contiguous views, 'A' returns an exact copy of the physical memory. In particular, in-memory Fortran order is preserved. For non-contiguous views, the data is converted to C first. *order=None* is the same as *order='C'*.
pt_pt: *order* pode ser {'C', 'F', 'A'}. Quando *order* é 'C' ou 'F', os dados do array original são convertidos para ordem C ou Fortran. Para vistas contíguas, 'A' retorna uma cópia exata da memória física. Em particular, a ordem Fortran na memória é preservada. Para vistas não contíguas, os dados são convertidos para C primeiro. *order=None* é o mesmo que *order='C'*.
sv: *order* kan vara {'C', 'F', 'A'}. När *order* är 'C' eller 'F' konverteras data från den ursprungliga matrisen till C- eller Fortran-ordning. För sammanhängande vyer returnerar 'A' en exakt kopia av det fysiska minnet. I synnerhet bevaras Fortran-ordningen i minnet. För icke-slutna vyer konverteras data först till C. *order=None* är samma sak som *order='C'*.

source: Return a string object containing two hexadecimal digits for each byte in the buffer. ::
sv: Returnerar ett strängobjekt som innehåller två hexadecimala siffror för varje byte i bufferten. ::

source: >>> m = memoryview(b"abc") >>> m.hex() '616263'
sv: >>> m = minnesvy(b"abc") >>> m.hex() '616263'

source: Similar to :meth:`bytes.hex`, :meth:`memoryview.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
sv: I likhet med :meth:`bytes.hex` har :meth:`memoryview.hex` nu stöd för de valfria parametrarna *sep* och *bytes_per_sep* för att infoga separatorer mellan byte i hex-utdata.

source: Return the data in the buffer as a list of elements. ::
sv: Returnera data i bufferten som en lista med element. ::

source: >>> memoryview(b'abc').tolist() [97, 98, 99] >>> import array >>> a = array.array('d', [1.1, 2.2, 3.3]) >>> m = memoryview(a) >>> m.tolist() [1.1, 2.2, 3.3]
sv: >>> memoryview(b'abc').tolist() [97, 98, 99] >>> importera array >>> a = array.array('d', [1,1, 2,2, 3,3]) >>> m = minnesvy(a) >>> m.tolist() [1.1, 2.2, 3.3]

source: :meth:`tolist` now supports all single character native formats in :mod:`struct` module syntax as well as multi-dimensional representations.
sv: :meth:`tolist` stöder nu alla ursprungliga format för enstaka tecken i modulsyntaxen :mod:`struct` samt flerdimensionella representationer.

source: Return a readonly version of the memoryview object. The original memoryview object is unchanged. ::
sv: Returnerar en skrivskyddad version av memoryview-objektet. Det ursprungliga memoryview-objektet är oförändrat. ::

source: >>> m = memoryview(bytearray(b'abc')) >>> mm = m.toreadonly() >>> mm.tolist() [97, 98, 99] >>> mm[0] = 42 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: cannot modify read-only memory >>> m[0] = 43 >>> mm.tolist() [43, 98, 99]
sv: &gt;&gt;&gt; m = memoryview(bytearray(b'abc')) &gt;&gt;&gt; mm = m.toreadonly() &gt;&gt;&gt; mm.tolist() [97, 98, 99] &gt;&gt;&gt; mm[0] = 42 Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: kan inte modifiera skrivskyddat minne &gt;&gt;&gt; m[0] = 43 &gt;&gt;&gt; mm.tolist() [43, 98, 99]

source: Release the underlying buffer exposed by the memoryview object. Many objects take special actions when a view is held on them (for example, a :class:`bytearray` would temporarily forbid resizing); therefore, calling release() is handy to remove these restrictions (and free any dangling resources) as soon as possible.
sv: Frigör den underliggande bufferten som exponeras av memoryview-objektet. Många objekt vidtar speciella åtgärder när en vy hålls på dem (t.ex. skulle en :class:`bytearray` tillfälligt förbjuda storleksändring); därför är det praktiskt att anropa release() för att ta bort dessa begränsningar (och frigöra eventuella hängande resurser) så snart som möjligt.

source: After this method has been called, any further operation on the view raises a :class:`ValueError` (except :meth:`release` itself which can be called multiple times)::
sv: Efter att denna metod har anropats ger alla ytterligare åtgärder på vyn upphov till ett :class:`ValueError` (utom :meth:`release` själv som kan anropas flera gånger)::

source: >>> m = memoryview(b'abc') >>> m.release() >>> m[0] Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: operation forbidden on released memoryview object
sv: &gt;&gt;&gt; m = minnesvy(b'abc') &gt;&gt;&gt; m.release() &gt;&gt;&gt; m[0] Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> ValueError: operation förbjuden på frigjort memoryview-objekt

source: The context management protocol can be used for a similar effect, using the ``with`` statement::
sv: Protokollet för kontexthantering kan användas för en liknande effekt med hjälp av ``with``-satsen::

source: >>> with memoryview(b'abc') as m: ... m[0] ... 97 >>> m[0] Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: operation forbidden on released memoryview object
sv: &gt;&gt;&gt; med memoryview(b'abc') som m: ... m[0] ... 97 &gt;&gt;&gt; m[0] Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> ValueError: operation förbjuden på frigjort memoryview-objekt

source: Cast a memoryview to a new format or shape. *shape* defaults to ``[byte_length//new_itemsize]``, which means that the result view will be one-dimensional. The return value is a new memoryview, but the buffer itself is not copied. Supported casts are 1D -> C-:term:`contiguous` and C-contiguous -> 1D.
sv: Castar en minnesvy till ett nytt format eller en ny form. *shape* är som standard ``[byte_length//new_itemsize]``, vilket innebär att resultatvyn kommer att vara endimensionell. Returvärdet är en ny minnesvy, men själva bufferten kopieras inte. Stödda casts är 1D -> C-:term:`contiguous` och C-contiguous -> 1D.

source: The destination format is restricted to a single element native format in :mod:`struct` syntax. One of the formats must be a byte format ('B', 'b' or 'c'). The byte length of the result must be the same as the original length. Note that all byte lengths may depend on the operating system.
sv: Målformatet är begränsat till ett inbyggt format med ett enda element i :mod:`struct`-syntax. Ett av formaten måste vara ett byteformat ('B', 'b' eller 'c'). Byte-längden på resultatet måste vara samma som den ursprungliga längden. Observera att alla byte-längder kan bero på operativsystemet.

source: Cast 1D/long to 1D/unsigned bytes::
sv: Cast 1D/lång till 1D/unsigned bytes::

source: >>> import array >>> a = array.array('l', [1,2,3]) >>> x = memoryview(a) >>> x.format 'l' >>> x.itemsize 8 >>> len(x) 3 >>> x.nbytes 24 >>> y = x.cast('B') >>> y.format 'B' >>> y.itemsize 1 >>> len(y) 24 >>> y.nbytes 24
sv: >>> importera array >>> a = array.array('l', [1,2,3]) >>> x = minnesvy(a) >>> x.format 'l' >>> x.objektstorlek 8 >>> len(x) 3 >>> x.nbytes 24 >>> y = x.cast('B') >>> y.format 'B' >>> y.itemsize 1 >>> len(y) 24 >>> y.nbytes 24

source: Cast 1D/unsigned bytes to 1D/char::
sv: Casta 1D/unsigned bytes till 1D/char::

source: >>> b = bytearray(b'zyz') >>> x = memoryview(b) >>> x[0] = b'a' Traceback (most recent call last): ... TypeError: memoryview: invalid type for format 'B' >>> y = x.cast('c') >>> y[0] = b'a' >>> b bytearray(b'ayz')
sv: >>> b = bytearray(b'zyz') >>> x = minnesvy(b) >>> x[0] = b'a' Traceback (senaste anropet senast): ... TypeError: memoryview: ogiltig typ för formatet 'B' >>> y = x.cast('c') >>> y[0] = b'a' >>> b bytearray(b'ayz')

source: Cast 1D/bytes to 3D/ints to 1D/signed char::
pt_pt: Conversão de 1D/bytes para 3D/ints para 1D/char com sinal::
sv: Cast 1D/bytes till 3D/ints till 1D/signed char::

source: >>> import struct >>> buf = struct.pack("i"*12, *list(range(12))) >>> x = memoryview(buf) >>> y = x.cast('i', shape=[2,2,3]) >>> y.tolist() [[[0, 1, 2], [3, 4, 5]], [[6, 7, 8], [9, 10, 11]]] >>> y.format 'i' >>> y.itemsize 4 >>> len(y) 2 >>> y.nbytes 48 >>> z = y.cast('b') >>> z.format 'b' >>> z.itemsize 1 >>> len(z) 48 >>> z.nbytes 48
sv: >>> import struct >>> buf = struct.pack("i"*12, *list(intervall(12))) >>> x = minnesvy(buf) >>> y = x.cast('i', shape=[2,2,3]) >>> y.tolist() [[[0, 1, 2], [3, 4, 5]], [[6, 7, 8], [9, 10, 11]]] >>> y.format 'i' >>> y.objektstorlek 4 >>> len(y) 2 >>> y.nbytes 48 >>> z = y.cast('b') >>> z.format 'b' >>> z.objektstorlek 1 >>> len(z) 48 >>> z.nbytes 48

source: Cast 1D/unsigned long to 2D/unsigned long::
pt_pt: Conversão de 1D/long sem sinal para 2D/long sem sinal::
sv: Cast 1D/unsigned long till 2D/unsigned long::

source: >>> buf = struct.pack("L"*6, *list(range(6))) >>> x = memoryview(buf) >>> y = x.cast('L', shape=[2,3]) >>> len(y) 2 >>> y.nbytes 48 >>> y.tolist() [[0, 1, 2], [3, 4, 5]]
sv: >>> buf = struct.pack("L"*6, *list(intervall(6))) >>> x = minnesvy(buf) >>> y = x.cast('L', shape=[2,3]) >>> len(y) 2 >>> y.nbytes 48 >>> y.tolist() [[0, 1, 2], [3, 4, 5]]

source: The source format is no longer restricted when casting to a byte view.
pt_pt: O formato de origem já não está restrito ao converter para uma vista de byte.
sv: Källformatet är inte längre begränsat vid casting till en bytevy.

source: Count the number of occurrences of *value*.
sv: Räkna antalet förekomster av *värde*.

source: Return the index of the first occurrence of *value* (at or after index *start* and before index *stop*).
sv: Returnerar index för den första förekomsten av *värde* (vid eller efter index *start* och före index *stop*).

source: Raises a :exc:`ValueError` if *value* cannot be found.
sv: Utlöser ett :exc:`ValueError` om *värde* inte kan hittas.

source: There are also several readonly attributes available:
pt_pt: Existem também vários atributos apenas de leitura disponíveis:
sv: Det finns också flera skrivskyddade attribut tillgängliga:

source: The underlying object of the memoryview::
pt_pt: O objeto subjacente da memoryview:
sv: Det underliggande objektet för minnesvyn::
