Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Built-in Types
pt_pt: Tipos integrados
sv: Inbyggda typer

source: The following sections describe the standard types that are built into the interpreter.
pt_pt: As secções seguintes descrevem os tipos padrão que estão integrados no interpretador.
sv: I följande avsnitt beskrivs de standardtyper som finns inbyggda i tolken.

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions.
pt_pt: Os principais tipos integrados são numéricos, sequências, mapeamentos, classes, instâncias e exceções.
sv: De viktigaste inbyggda typerna är numeriska, sekvenser, mappningar, klasser, instanser och undantag.

source: Some collection classes are mutable. The methods that add, subtract, or rearrange their members in place, and don't return a specific item, never return the collection instance itself but ``None``.
pt_pt: Algumas classes de coleções são mutáveis. Os métodos que adicionam, subtraem ou reorganizam os seus membros *in-place* e não retornam um item específico, nunca retornam a instância da coleção em si, mas sim ``None``.
sv: Vissa samlingsklasser är mutabla. De metoder som lägger till, subtraherar eller omorganiserar sina medlemmar på plats, och inte returnerar ett specifikt objekt, returnerar aldrig själva samlingsinstansen utan ``None``.

source: Some operations are supported by several object types; in particular, practically all objects can be compared for equality, tested for truth value, and converted to a string (with the :func:`repr` function or the slightly different :func:`str` function). The latter function is implicitly used when an object is written by the :func:`print` function.
pt_pt: Algumas operações são suportadas por vários tipos de objetos; em particular, praticamente todos os objetos podem ser comparados para igualdade, testados para valor de verdade e convertidos para uma *string* (com a função :func:`repr` ou a função ligeiramente diferente :func:`str`). Esta última função é usada implicitamente quando um objeto é escrito pela função :func:`print`.
sv: Vissa operationer stöds av flera objekttyper; i synnerhet kan praktiskt taget alla objekt jämföras med avseende på likhet, testas för sanningsvärde och konverteras till en sträng (med funktionen :func:`repr` eller den något annorlunda funktionen :func:`str`). Den senare funktionen används implicit när ett objekt skrivs ut med funktionen :func:`print`.

source: Truth Value Testing
pt_pt: Teste de valor de verdade
sv: Test av sanning och värde

source: Any object can be tested for truth value, for use in an :keyword:`if` or :keyword:`while` condition or as operand of the Boolean operations below.
pt_pt: Qualquer objeto pode ser testado para valor de verdade, para uso numa condição :keyword:`if` ou :keyword:`while` ou como operando das operações booleanas abaixo.
sv: Alla objekt kan testas för sanningsvärde, för användning i ett :keyword:`if` eller :keyword:`while` villkor eller som operand i de booleska operationerna nedan.

source: By default, an object is considered true unless its class defines either a :meth:`~object.__bool__` method that returns ``False`` or a :meth:`~object.__len__` method that returns zero, when called with the object. [1]_ Here are most of the built-in objects considered false:
pt_pt: Por predefinição, um objeto é considerado verdadeiro a menos que a sua classe defina um método :meth:`~object.__bool__` que retorne ``False`` ou um método :meth:`~object.__len__` que retorne zero, quando chamado com o objeto. [1]_ Aqui estão a maioria dos objetos integrados considerados falsos:
sv: Som standard anses ett objekt vara sant om inte dess klass definierar antingen en :meth:`~object.__bool__`-metod som returnerar ``False`` eller en :meth:`~object.__len__`-metod som returnerar noll, när den anropas med objektet. [1]_ Här är de flesta av de inbyggda objekt som anses vara falska:

source: constants defined to be false: ``None`` and ``False``
pt_pt: constantes definidas como falsas: ``None`` e ``False``
sv: konstanter som definieras som falska: ``None`` och ``False``

source: zero of any numeric type: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
pt_pt: zero de qualquer tipo numérico: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
sv: noll av valfri numerisk typ: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraktion(0, 1)``

source: empty sequences and collections: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``
pt_pt: sequências e coleções vazias: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``
sv: tomma sekvenser och samlingar: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``

source: Operations and built-in functions that have a Boolean result always return ``0`` or ``False`` for false and ``1`` or ``True`` for true, unless otherwise stated. (Important exception: the Boolean operations ``or`` and ``and`` always return one of their operands.)
pt_pt: Operações e funções integradas que têm um resultado booleano retornam sempre ``0`` ou ``False`` para falso e ``1`` ou ``True`` para verdadeiro, a menos que seja indicado o contrário. (Exceção importante: as operações booleanas ``or`` e ``and`` retornam sempre um dos seus operandos.)
sv: Operationer och inbyggda funktioner som har ett booleskt resultat returnerar alltid ``0`` eller ``False`` för false och ``1`` eller ``True`` för true, om inget annat anges. (Viktigt undantag: de booleska operationerna ``eller`` och ``och`` returnerar alltid en av sina operander)

source: Boolean Operations --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
pt_pt: Operações booleanas --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
sv: Booleska operationer --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`

source: These are the Boolean operations, ordered by ascending priority:
pt_pt: Estas são as operações booleanas, ordenadas por prioridade ascendente:
sv: Dessa är de booleska operationerna, ordnade efter stigande prioritet:

source: Result
pt_pt: Resultado
sv: Resultat

source: Notes
pt_pt: Notas
sv: Anteckningar

source: ``x or y``
sv: ``x eller y``

source: if *x* is true, then *x*, else *y*
pt_pt: se *x* for verdadeiro, então *x*, senão *y*
sv: om *x* är sant, då *x*, annars *y*

source: ``x and y``
sv: ``x och y``

source: if *x* is false, then *x*, else *y*
pt_pt: se *x* for falso, então *x*, senão *y*
sv: om *x* är falskt, då *x*, annars *y*

source: ``not x``
sv: ``inte x``

source: if *x* is false, then ``True``, else ``False``
pt_pt: se *x* for falso, então ``True``, senão ``False``
sv: om *x* är falskt, då ``True``, annars ``False``

source: Notes:
pt_pt: Notas:
sv: Anteckningar:

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is false.
pt_pt: Este é um operador de curto-circuito, por isso só avalia o segundo argumento se o primeiro for falso.
sv: Detta är en kortslutningsoperator, vilket innebär att den bara utvärderar det andra argumentet om det första är falskt.

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is true.
pt_pt: Este é um operador de curto-circuito, por isso só avalia o segundo argumento se o primeiro for verdadeiro.
sv: Detta är en kortslutningsoperator, vilket innebär att den bara utvärderar det andra argumentet om det första är sant.

source: ``not`` has a lower priority than non-Boolean operators, so ``not a == b`` is interpreted as ``not (a == b)``, and ``a == not b`` is a syntax error.
pt_pt: ``not`` tem uma prioridade inferior a operadores não booleanos, por isso ``not a == b`` é interpretado como ``not (a == b)``, e ``a == not b`` é um erro de sintaxe.
sv: ``not`` har lägre prioritet än icke booleska operatorer, så ``not a == b`` tolkas som ``not (a == b)``, och ``a == not b`` är ett syntaxfel.

source: Comparisons
pt_pt: Comparações
sv: Jämförelser

source: There are eight comparison operations in Python. They all have the same priority (which is higher than that of the Boolean operations). Comparisons can be chained arbitrarily; for example, ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that *y* is evaluated only once (but in both cases *z* is not evaluated at all when ``x < y`` is found to be false).
pt_pt: Existem oito operações de comparação em Python. Todas têm a mesma prioridade (que é superior à das operações booleanas). As comparações podem ser encadeadas arbitrariamente; por exemplo, ``x < y <= z`` é equivalente a ``x < y and y <= z``, exceto que *y* é avaliado apenas uma vez (mas em ambos os casos *z* não é avaliado se ``x < y`` for falso).
sv: Det finns åtta jämförelseoperationer i Python. De har alla samma prioritet (som är högre än den för de booleska operationerna). Jämförelser kan kedjas godtyckligt; till exempel är ``x < y <= z`` ekvivalent med ``x < y och y <= z``, förutom att *y* bara utvärderas en gång (men i båda fallen utvärderas *z* inte alls när ``x < y`` visar sig vara falskt).

source: This table summarizes the comparison operations:
pt_pt: Esta tabela resume as operações de comparação:
sv: I denna tabell sammanfattas jämförelseoperationerna:

source: Meaning
pt_pt: Significado
sv: Betydelse

source: strictly less than
pt_pt: estritamente menor que
sv: strikt mindre än

source: less than or equal
pt_pt: menor ou igual
sv: mindre än eller lika med

source: strictly greater than
pt_pt: estritamente maior que
sv: strikt större än

source: greater than or equal
pt_pt: maior ou igual
sv: större än eller lika med

source: equal
pt_pt: igual
sv: lika

source: not equal
pt_pt: não igual
sv: är inte lika med

source: ``is``
sv: ``är``

source: object identity
pt_pt: identidade de objeto
sv: objektets identitet

source: ``is not``
sv: ``är inte``

source: negated object identity
pt_pt: identidade de objeto negada
sv: förnekad objektsidentitet

source: Objects of different types, except different numeric types, never compare equal. The ``==`` operator is always defined but for some object types (for example, class objects) is equivalent to :keyword:`is`. The ``<``, ``<=``, ``>`` and ``>=`` operators are only defined where they make sense; for example, they raise a :exc:`TypeError` exception when one of the arguments is a complex number.
sv: Objekt av olika typer, utom olika numeriska typer, jämför aldrig lika. Operatorn ``==`` är alltid definierad men för vissa objekttyper (t.ex. klassobjekt) är den ekvivalent med :keyword:`is`. Operatorerna ``<``, ``<=``, ``>`` och ``>=`` definieras endast där de är meningsfulla; till exempel ger de upphov till ett :exc:`TypeError`-undantag när ett av argumenten är ett komplext tal.

source: Non-identical instances of a class normally compare as non-equal unless the class defines the :meth:`~object.__eq__` method.
pt_pt: Instâncias não idênticas de uma classe normalmente são consideradas não iguais, a menos que a classe defina o método :meth:`~object.__eq__`.
sv: Icke-identiska instanser av en klass jämförs normalt som icke-jämlika om inte klassen definierar metoden :meth:`~object.__eq__`.

source: Instances of a class cannot be ordered with respect to other instances of the same class, or other types of object, unless the class defines enough of the methods :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, and :meth:`~object.__ge__` (in general, :meth:`~object.__lt__` and :meth:`~object.__eq__` are sufficient, if you want the conventional meanings of the comparison operators).
pt_pt: Instâncias de uma classe não podem ser ordenadas em relação a outras instâncias da mesma classe, ou outros tipos de objetos, a menos que a classe defina métodos suficientes entre :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__` e :meth:`~object.__ge__` (em geral, :meth:`~object.__lt__` e :meth:`~object.__eq__` são suficientes, se pretender os significados convencionais dos operadores de comparação).
sv: Instanser av en klass kan inte ordnas med avseende på andra instanser av samma klass eller andra typer av objekt, såvida inte klassen definierar tillräckligt många av metoderna :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, och :meth:`~object.__ge__` (i allmänhet räcker det med :meth:`~object.__lt__` och :meth:`~object.__eq__`, om man vill ha de konventionella betydelserna av jämförelseoperatorerna).

source: The behavior of the :keyword:`is` and :keyword:`is not` operators cannot be customized; also they can be applied to any two objects and never raise an exception.
pt_pt: O comportamento dos operadores :keyword:`is` e :keyword:`is not` não pode ser personalizado; também podem ser aplicados a quaisquer dois objetos e nunca lançam uma exceção.
sv: Beteendet hos operatörerna :keyword:`is` och :keyword:`is not` kan inte anpassas; de kan också tillämpas på två valfria objekt och aldrig ge upphov till ett undantag.

source: Two more operations with the same syntactic priority, :keyword:`in` and :keyword:`not in`, are supported by types that are :term:`iterable` or implement the :meth:`~object.__contains__` method.
pt_pt: Duas operações adicionais com a mesma prioridade sintática, :keyword:`in` e :keyword:`not in`, são suportadas por tipos que são :term:`iteráveis` ou implementam o método :meth:`~object.__contains__`.
sv: Ytterligare två operationer med samma syntaktiska prioritet, :keyword:`in` och :keyword:`not in`, stöds av typer som är :term:`iterable` eller implementerar metoden :meth:`~object.__contains__`.

source: Numeric Types --- :class:`int`, :class:`float`, :class:`complex`
pt_pt: Tipos numéricos --- :class:`int`, :class:`float`, :class:`complex`
sv: Numeriska typer --- :class:`int`, :class:`float`, :class:`complex`

source: There are three distinct numeric types: :dfn:`integers`, :dfn:`floating-point numbers`, and :dfn:`complex numbers`. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating-point numbers are usually implemented using :c:expr:`double` in C; information about the precision and internal representation of floating-point numbers for the machine on which your program is running is available in :data:`sys.float_info`. Complex numbers have a real and imaginary part, which are each a floating-point number. To extract these parts from a complex number *z*, use ``z.real`` and ``z.imag``. (The standard library includes the additional numeric types :mod:`fractions.Fraction`, for rationals, and :mod:`decimal.Decimal`, for floating-point numbers with user-definable precision.)
pt_pt: Existem três tipos numéricos distintos: :dfn:`inteiros`, :dfn:`números de ponto flutuante` e :dfn:`números complexos`. Além disso, os booleanos são um subtipo de inteiros. Os inteiros têm precisão ilimitada. Os números de ponto flutuante são geralmente implementados usando :c:expr:`double` em C; informações sobre a precisão e representação interna dos números de ponto flutuante para a máquina na qual o programa está a ser executado estão disponíveis em :data:`sys.float_info`. Os números complexos têm uma parte real e imaginária, que são cada uma um número de ponto flutuante. Para extrair estas partes de um número complexo *z*, use ``z.real`` e ``z.imag``. (A biblioteca padrão inclui os tipos numéricos adicionais :mod:`fractions.Fraction`, para racionais, e :mod:`decimal.Decimal`, para números de ponto flutuante com precisão definível pelo utilizador.)
sv: Det finns tre olika numeriska typer: :dfn:`integrer`, :dfn:`flytande tal` och :dfn:`komplexa tal`. Dessutom är booleaner en subtyp av heltal. Heltal har obegränsad precision. Flyttal implementeras vanligtvis med :c:expr:`double` i C; information om precisionen och den interna representationen av flyttal för den maskin som ditt program körs på finns i :data:`sys.float_info`. Komplexa tal har en reell del och en imaginär del, som var och en är ett flyttal. För att extrahera dessa delar från ett komplext tal *z*, använd ``z.real`` och ``z.imag``. (Standardbiblioteket innehåller de ytterligare numeriska typerna :mod:`fractions.Fraction`, för rationella tal, och :mod:`decimal.Decimal`, för flyttal med precision som kan definieras av användaren)

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating-point numbers. Appending ``'j'`` or ``'J'`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
pt_pt: Os números são criados por literais numéricos ou como resultado de funções e operadores integrados. Literais inteiros não adornados (incluindo números hexadecimais, octais e binários) produzem inteiros. Literais numéricos que contêm um ponto decimal ou um sinal de expoente produzem números de ponto flutuante. Acrescentar ``'j'`` ou ``'J'`` a um literal numérico produz um número imaginário (um número complexo com uma parte real zero), que pode ser adicionado a um inteiro ou *float* para obter um número complexo com partes real e imaginária.
sv: Tal skapas av numeriska literaler eller som resultat av inbyggda funktioner och operatorer. Heltalslitteraler utan utsmyckning (inklusive hex-, oktal- och binära tal) ger heltal. Numeriska literaler som innehåller en decimalpunkt eller ett exponenttecken ger flyttal. Om du lägger till ``'j'`` eller ``'J'`` till en numerisk literal får du ett imaginärt tal (ett komplext tal med en reell del på noll) som du kan lägga till ett heltal eller en float för att få ett komplext tal med en reell och en imaginär del.

source: The constructors :func:`int`, :func:`float`, and :func:`complex` can be used to produce numbers of a specific type.
pt_pt: Os construtores :func:`int`, :func:`float` e :func:`complex` podem ser usados para produzir números de um tipo específico.
sv: Konstruktörerna :func:`int`, :func:`float` och :func:`complex` kan användas för att producera tal av en viss typ.

source: Python fully supports mixed arithmetic: when a binary arithmetic operator has operands of different numeric types, the operand with the "narrower" type is widened to that of the other, where integer is narrower than floating point. Arithmetic with complex and real operands is defined by the usual mathematical formula, for example::
sv: Python har fullt stöd för blandad aritmetik: när en binär aritmetisk operator har operander av olika numeriska typer, breddas operanden med den "smalare" typen till den andra, där heltal är smalare än flyttal. Aritmetik med komplexa och reella operander definieras av den vanliga matematiska formeln, till exempel::

source: x + complex(u, v) = complex(x + u, v) x * complex(u, v) = complex(x * u, x * v)
sv: x + komplex(u, v) = komplex(x + u, v) x * komplex(u, v) = komplex(x * u, x * v)

source: A comparison between numbers of different types behaves as though the exact values of those numbers were being compared. [2]_
sv: En jämförelse mellan tal av olika typer beter sig som om det var de exakta värdena för dessa tal som jämfördes. [2]_

source: All numeric types (except complex) support the following operations (for priorities of the operations, see :ref:`operator-summary`):
pt_pt: Todos os tipos numéricos (exceto complexos) suportam as seguintes operações (para prioridades das operações, consulte :ref:`operator-summary`):
sv: Alla numeriska typer (utom komplexa) stöder följande operationer (för prioriteringar av operationerna, se :ref:`operator-summary`):

source: Full documentation
pt_pt: Documentação completa
sv: Fullständig dokumentation

source: sum of *x* and *y*
pt_pt: soma de *x* e *y*
sv: summan av *x* och *y*

source: difference of *x* and *y*
pt_pt: diferença entre *x* e *y*
sv: skillnaden mellan *x* och *y*

source: product of *x* and *y*
pt_pt: produto de *x* e *y*
sv: produkten av *x* och *y*

source: quotient of *x* and *y*
pt_pt: quociente de *x* e *y*
sv: kvot av *x* och *y*

source: floored quotient of *x* and *y*
pt_pt: quociente arredondado para baixo de *x* e *y*
sv: golvad kvot av *x* och *y*

source: remainder of ``x / y``
pt_pt: resto de ``x / y``
sv: återstoden av ``x / y``

source: *x* negated
pt_pt: *x* negado
sv: *x* negerad

source: *x* unchanged
pt_pt: *x* inalterado
sv: *x* oförändrad

source: absolute value or magnitude of *x*
pt_pt: valor absoluto ou magnitude de *x*
sv: absolut värde eller magnitud av *x*

source: *x* converted to integer
pt_pt: *x* convertido para inteiro
sv: *x* omvandlad till heltal

source: ``float(x)``
sv: ``flata(x)``

source: *x* converted to floating point
pt_pt: *x* convertido para ponto flutuante
sv: *x* omvandlad till flyttal

source: :func:`float`
sv: :func:`flöde`

source: ``complex(re, im)``
sv: ``komplex(re, im)``

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
pt_pt: um número complexo com parte real *re*, parte imaginária *im*. *im* é zero por predefinição.
sv: ett komplext tal med realdel *re*, imaginärdel *im*. *im* är som standard noll.

source: :func:`complex`
sv: :func:`komplex`

source: ``c.conjugate()``
sv: ``c.konjugat()```

source: conjugate of the complex number *c*
pt_pt: conjugado do número complexo *c*
sv: konjugat av det komplexa talet *c*

source: the pair ``(x // y, x % y)``
pt_pt: o par ``(x // y, x % y)``
sv: paret ``(x // y, x % y)```

source: *x* to the power *y*
pt_pt: *x* elevado a *y*
sv: *x* till potensen *y*

source: Also referred to as integer division. For operands of type :class:`int`, the result has type :class:`int`. For operands of type :class:`float`, the result has type :class:`float`. In general, the result is a whole integer, though the result's type is not necessarily :class:`int`. The result is always rounded towards minus infinity: ``1//2`` is ``0``, ``(-1)//2`` is ``-1``, ``1//(-2)`` is ``-1``, and ``(-1)//(-2)`` is ``0``.
pt_pt: Também referido como divisão inteira. Para operandos do tipo :class:`int`, o resultado tem o tipo :class:`int`. Para operandos do tipo :class:`float`, o resultado tem o tipo :class:`float`. Em geral, o resultado é um inteiro, embora o tipo do resultado não seja necessariamente :class:`int`. O resultado é sempre arredondado para menos infinito: ``1//2`` é ``0``, ``(-1)//2`` é ``-1``, ``1//(-2)`` é ``-1``, e ``(-1)//(-2)`` é ``0``.
sv: Kallas även heltalsdivision. För operander av typen :class:`int` har resultatet typen :class:`int`. För operander av typen :class:`float` har resultatet typen :class:`float`. I allmänhet är resultatet ett helt heltal, även om resultatets typ inte nödvändigtvis är :class:`int`. Resultatet är alltid avrundat mot minus oändligheten: ``1//2`` är ``0``, ``(-1)//2`` är ``-1``, ``1//(-2)`` är ``-1`` och ``(-1)//(-2)`` är ``0``.

source: Not for complex numbers. Instead convert to floats using :func:`abs` if appropriate.
pt_pt: Não aplicável a números complexos. Em vez disso, converta para *floats* usando :func:`abs`, se apropriado.
sv: Inte för komplexa tal. Konvertera istället till flyttal med :func:`abs` om det är lämpligt.

source: Conversion from :class:`float` to :class:`int` truncates, discarding the fractional part. See functions :func:`math.floor` and :func:`math.ceil` for alternative conversions.
pt_pt: A conversão de :class:`float` para :class:`int` trunca, descartando a parte fracionária. Consulte as funções :func:`math.floor` e :func:`math.ceil` para conversões alternativas.
sv: Konvertering från :class:`float` till :class:`int` trunkerar och kastar bort bråkdelen. Se funktionerna :func:`math.floor` och :func:`math.ceil` för alternativa omvandlingar.
