Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Here "printable" means the character is suitable for :func:`repr` to use in its output; "non-printable" means that :func:`repr` on built-in types will hex-escape the character. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.
pt_pt: Aqui, "imprimível" significa que o caractere é adequado para :func:`repr` usar na sua saída; "não imprimível" significa que :func:`repr` em tipos integrados fará escape hexadecimal do caractere. Não tem qualquer influência no tratamento de *strings* escritas para :data:`sys.stdout` ou :data:`sys.stderr`.
sv: Här betyder "printable" att tecknet är lämpligt för :func:`repr` att använda i sin utdata; "non-printable" betyder att :func:`repr` på inbyggda typer kommer att hex-escape tecknet. Det har ingen betydelse för hanteringen av strängar som skrivs till :data:`sys.stdout` eller :data:`sys.stderr`.

source: The printable characters are those which in the Unicode character database (see :mod:`unicodedata`) have a general category in group Letter, Mark, Number, Punctuation, or Symbol (L, M, N, P, or S); plus the ASCII space 0x20. Nonprintable characters are those in group Separator or Other (Z or C), except the ASCII space.
pt_pt: Os caracteres imprimíveis são aqueles que, na base de dados de caracteres Unicode (consulte :mod:`unicodedata`), têm uma categoria geral no grupo Letter, Mark, Number, Punctuation ou Symbol (L, M, N, P ou S); além do espaço ASCII 0x20. Caracteres não imprimíveis são aqueles no grupo Separator ou Other (Z ou C), exceto o espaço ASCII.
sv: De tryckbara tecknen är de som i Unicodes teckendatabas (se :mod:`unicodedata`) har en allmän kategori i gruppen Letter, Mark, Number, Punctuation, or Symbol (L, M, N, P, or S); plus ASCII-rymden 0x20. Icke-tryckbara tecken är de som finns i gruppen Separator eller Annat (Z eller C), förutom ASCII-utrymmet.

source: Return ``True`` if there are only whitespace characters in the string and there is at least one character, ``False`` otherwise.
pt_pt: Retorna ``True`` se houver apenas caracteres de espaço em branco na *string* e houver pelo menos um caractere, ``False`` caso contrário.
sv: Returnerar ``True`` om det bara finns blankstegstecken i strängen och det finns minst ett tecken, ``False`` annars.

source: A character is *whitespace* if in the Unicode character database (see :mod:`unicodedata`), either its general category is ``Zs`` ("Separator, space"), or its bidirectional class is one of ``WS``, ``B``, or ``S``.
pt_pt: Um caractere é *whitespace* se, na base de dados de caracteres Unicode (consulte :mod:`unicodedata`), a sua categoria geral for ``Zs`` ("Separator, space"), ou a sua classe bidirecional for uma de ``WS``, ``B`` ou ``S``.
sv: Ett tecken är *whitespace* om det i Unicodes teckendatabas (se :mod:`unicodedata`) antingen har den allmänna kategorin ``Zs`` ("Separator, mellanslag"), eller om dess dubbelriktade klass är en av ``WS``, ``B`` eller ``S``.

source: Return ``True`` if the string is a titlecased string and there is at least one character, for example uppercase characters may only follow uncased characters and lowercase characters only cased ones. Return ``False`` otherwise.
pt_pt: Retorna ``True`` se a *string* for uma *string* em título e houver pelo menos um caractere, por exemplo, caracteres maiúsculos só podem seguir caracteres sem caixa e caracteres minúsculos só podem seguir caracteres com caixa. Retorna ``False`` caso contrário.
sv: Returnerar ``True`` om strängen är en titlecased-sträng och det finns minst ett tecken, till exempel kan versaler bara följa obokstaverade tecken och gemena tecken bara bokstaverade. Returnerar ``False`` annars.

source: Return ``True`` if all cased characters [4]_ in the string are uppercase and there is at least one cased character, ``False`` otherwise.
pt_pt: Retorna ``True`` se todos os caracteres com caixa [4]_ na *string* forem maiúsculos e houver pelo menos um caractere com caixa, ``False`` caso contrário.
sv: Returnerar ``True`` om alla tecken med versaler [4]_ i strängen är versaler och det finns minst ett tecken med versaler, ``False`` annars.

source: Return a string which is the concatenation of the strings in *iterable*. A :exc:`TypeError` will be raised if there are any non-string values in *iterable*, including :class:`bytes` objects. The separator between elements is the string providing this method.
sv: Returnerar en sträng som är en konkatenering av strängarna i *iterable*. Ett :exc:`TypeError` kommer att uppstå om det finns några värden som inte är strängar i *iterable*, inklusive :class:`bytes`-objekt. Separatorn mellan elementen är den sträng som tillhandahåller denna metod.

source: Return the string left justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
sv: Returnerar strängen vänsterställd i en sträng med längden *width*. Utfyllnad görs med det angivna *fillchar* (standard är ett ASCII-rymd). Den ursprungliga strängen returneras om *width* är mindre än eller lika med ``len(s)``.

source: Return a copy of the string with all the cased characters [4]_ converted to lowercase.
pt_pt: Retorna uma cópia da *string* com todos os caracteres com caixa [4]_ convertidos para minúsculas.
sv: Returnerar en kopia av strängen med alla tecken med versaler [4]_ konverterade till gemener.

source: The lowercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.
sv: Den algoritm för gemener som används beskrivs i avsnitt 3.13 "Default Case Folding" i Unicode-standarden <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.

source: Return a copy of the string with leading characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
pt_pt: Retorna uma cópia da *string* com os caracteres iniciais removidos. O argumento *chars* é uma *string* que especifica o conjunto de caracteres a serem removidos. Se for omitido ou ``None``, o argumento *chars* remove espaços em branco por predefinição. O argumento *chars* não é um prefixo; em vez disso, todas as combinações dos seus valores são removidas:
sv: Returnerar en kopia av strängen med inledande tecken borttagna. Argumentet *chars* är en sträng som anger den uppsättning tecken som ska tas bort. Om *chars* utelämnas eller är ``None`` är standardinställningen att ta bort blanksteg. Argumentet *chars* är inte ett prefix, utan alla kombinationer av dess värden tas bort::

source: >>> ' spacious '.lstrip() 'spacious ' >>> 'www.example.com'.lstrip('cmowz.') 'example.com'
sv: >>> ' rymlig '.lstrip() 'rymlig ' >>> 'www.example.com'.lstrip('cmowz.') 'exempel.com'

source: See :meth:`str.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
pt_pt: Consulte :meth:`str.removeprefix` para um método que removerá uma única *string* de prefixo em vez de todos os caracteres de um conjunto. Por exemplo:
sv: Se :meth:`str.removeprefix` för en metod som tar bort en enda prefixsträng i stället för alla tecken i en uppsättning. Till exempel::

source: >>> 'Arthur: three!'.lstrip('Arthur: ') 'ee!' >>> 'Arthur: three!'.removeprefix('Arthur: ') 'three!'
sv: >>> "Arthur: tre!".lstrip("Arthur: ') 'ee!' >>> 'Arthur: tre!'.removeprefix('Arthur: ') 'tre!'

source: This static method returns a translation table usable for :meth:`str.translate`.
pt_pt: Este método estático retorna uma tabela de tradução utilizável para :meth:`str.translate`.
sv: Denna statiska metod returnerar en översättningstabell som kan användas för :meth:`str.translate`.

source: If there is only one argument, it must be a dictionary mapping Unicode ordinals (integers) or characters (strings of length 1) to Unicode ordinals, strings (of arbitrary lengths) or ``None``. Character keys will then be converted to ordinals.
pt_pt: Se houver apenas um argumento, deve ser um dicionário que mapeia ordinais Unicode (inteiros) ou caracteres (*strings* de comprimento 1) para ordinais Unicode, *strings* (de comprimentos arbitrários) ou ``None``. As chaves de caractere serão então convertidas para ordinais.
sv: Om det bara finns ett argument måste det vara en ordbok som mappar Unicode-ordinaler (heltal) eller tecken (strängar av längd 1) till Unicode-ordinaler, strängar (av godtycklig längd) eller ``None``. Teckennycklar kommer då att konverteras till ordinaler.

source: If there are two arguments, they must be strings of equal length, and in the resulting dictionary, each character in x will be mapped to the character at the same position in y. If there is a third argument, it must be a string, whose characters will be mapped to ``None`` in the result.
sv: Om det finns två argument måste de vara strängar av samma längd, och i den resulterande ordlistan kommer varje tecken i x att mappas till tecknet på samma position i y. Om det finns ett tredje argument måste det vara en sträng, vars tecken kommer att mappas till ``None`` i resultatet.

source: Split the string at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing the string itself, followed by two empty strings.
pt_pt: Divide a *string* na primeira ocorrência de *sep* e retorna um 3-tuplo contendo a parte antes do separador, o separador em si e a parte após o separador. Se o separador não for encontrado, retorna um 3-tuplo contendo a própria *string*, seguida por duas *strings* vazias.
sv: Dela strängen vid den första förekomsten av *sep* och returnera en 3-tupel som innehåller delen före separatorn, själva separatorn och delen efter separatorn. Om separatorn inte hittas returneras en 3-tupel som innehåller själva strängen, följt av två tomma strängar.

source: If the string starts with the *prefix* string, return ``string[len(prefix):]``. Otherwise, return a copy of the original string::
pt_pt: Se a *string* começar com a *string* *prefix*, retorna ``string[len(prefix):]``. Caso contrário, retorna uma cópia da *string* original:
sv: Om strängen börjar med *prefix*-strängen returneras ``sträng[len(prefix):]``. Annars returneras en kopia av den ursprungliga strängen::

source: If the string ends with the *suffix* string and that *suffix* is not empty, return ``string[:-len(suffix)]``. Otherwise, return a copy of the original string::
pt_pt: Se a *string* terminar com a *string* *suffix* e esse *suffix* não estiver vazio, retorna ``string[:-len(suffix)]``. Caso contrário, retorna uma cópia da *string* original:
sv: Om strängen slutar med strängen *suffix* och *suffix* inte är tomt, returneras ``sträng[:-len(suffix)]``. Annars returneras en kopia av den ursprungliga strängen::

source: >>> 'MiscTests'.removesuffix('Tests') 'Misc' >>> 'TmpDirMixin'.removesuffix('Tests') 'TmpDirMixin'
sv: >>> 'MiscTests'.removesuffix('Tester') 'Misc' >>> 'TmpDirMixin'.removesuffix('Tester') 'TmpDirMixin'

source: Return a copy of the string with all occurrences of substring *old* replaced by *new*. If *count* is given, only the first *count* occurrences are replaced. If *count* is not specified or ``-1``, then all occurrences are replaced.
pt_pt: Retorna uma cópia da *string* com todas as ocorrências da substring *old* substituídas por *new*. Se *count* for fornecido, apenas as primeiras *count* ocorrências são substituídas. Se *count* não for especificado ou for ``-1``, então todas as ocorrências são substituídas.
sv: Returnerar en kopia av strängen med alla förekomster av delsträngen *old* ersatt av *new*. Om *count* anges ersätts endast de första *count* förekomsterna. Om *count* inte anges eller om ``-1``, ersätts alla förekomster.

source: *count* is now supported as a keyword argument.
pt_pt: *count* é agora suportado como um argumento de palavra-chave.
sv: *count* stöds nu som ett nyckelordsargument.

source: Return the highest index in the string where substring *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
pt_pt: Retorna o índice mais alto na *string* onde a substring *sub* é encontrada, de modo que *sub* esteja contida em ``s[start:end]``. Os argumentos opcionais *start* e *end* são interpretados como na notação de fatia. Retorna ``-1`` em caso de falha.
sv: Returnerar det högsta indexet i strängen där delsträngen *sub* finns, så att *sub* ingår i ``s[start:end]``. De valfria argumenten *start* och *end* tolkas som i slice-notation. Returnerar ``-1`` om den misslyckas.

source: Like :meth:`rfind` but raises :exc:`ValueError` when the substring *sub* is not found.
pt_pt: Semelhante a :meth:`rfind`, mas lança :exc:`ValueError` quando a substring *sub* não for encontrada.
sv: Som :meth:`rfind` men ger upphov till :exc:`ValueError` när delsträngen *sub* inte hittas.

source: Return the string right justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
pt_pt: Retorna a *string* alinhada à direita numa *string* de comprimento *width*. O preenchimento é feito usando o *fillchar* especificado (o valor predefinido é um espaço ASCII). A *string* original é retornada se *width* for menor ou igual a ``len(s)``.
sv: Returnerar strängen högerställd i en sträng med längden *width*. Utfyllnad görs med det angivna *fillchar* (standard är ett ASCII-rymd). Den ursprungliga strängen returneras om *width* är mindre än eller lika med ``len(s)``.

source: Split the string at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty strings, followed by the string itself.
pt_pt: Divide a *string* na última ocorrência de *sep* e retorna um 3-tuplo contendo a parte antes do separador, o separador em si e a parte após o separador. Se o separador não for encontrado, retorna um 3-tuplo contendo duas *strings* vazias, seguido da própria *string*.
sv: Dela strängen vid den sista förekomsten av *sep* och returnera en 3-tupel som innehåller delen före separatorn, själva separatorn och delen efter separatorn. Om separatorn inte hittas, returneras en 3-tupel som innehåller två tomma strängar, följt av själva strängen.

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any whitespace string is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
pt_pt: Retorna uma lista das palavras na *string*, usando *sep* como a *string* de delimitador. Se *maxsplit* for fornecido, no máximo *maxsplit* divisões são feitas, as mais à *direita*. Se *sep* não for especificado ou for ``None``, qualquer *string* de espaço em branco é um separador. Exceto pela divisão a partir da direita, :meth:`rsplit` comporta-se como :meth:`split`, que é descrita em detalhe abaixo.
sv: Returnerar en lista med orden i strängen, med *sep* som avgränsningssträng. Om *maxsplit* anges görs högst *maxsplit* uppdelningar, de *högst till höger*. Om *sep* inte anges eller om ``None``, är alla strängar med blanksteg en separator. Förutom att dela upp från höger, beter sig :meth:`rsplit` som :meth:`split` som beskrivs i detalj nedan.

source: Return a copy of the string with trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
pt_pt: Retorna uma cópia da *string* com os caracteres finais removidos. O argumento *chars* é uma *string* que especifica o conjunto de caracteres a serem removidos. Se for omitido ou ``None``, o argumento *chars* remove espaços em branco por predefinição. O argumento *chars* não é um sufixo; em vez disso, todas as combinações dos seus valores são removidas:
sv: Returnerar en kopia av strängen med borttagna efterföljande tecken. Argumentet *chars* är en sträng som anger den uppsättning tecken som ska tas bort. Om det utelämnas eller ``None``, är *chars*-argumentet standard för att ta bort blanksteg. Argumentet *chars* är inte ett suffix, utan alla kombinationer av dess värden tas bort::

source: >>> ' spacious '.rstrip() ' spacious' >>> 'mississippi'.rstrip('ipz') 'mississ'
sv: >>> ' rymlig '.rstrip() ' rymlig' >>> 'mississippi'.rstrip('ipz') 'mississ'

source: See :meth:`str.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
pt_pt: Consulte :meth:`str.removesuffix` para um método que remove uma única *string* de sufixo em vez de todos os caracteres de um conjunto. Por exemplo:
sv: Se :meth:`str.removesuffix` för en metod som tar bort en enda suffixsträng istället för alla tecken i en uppsättning. Till exempel::

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or ``-1``, then there is no limit on the number of splits (all possible splits are made).
pt_pt: Retorna uma lista das palavras na *string*, usando *sep* como a *string* de delimitador. Se *maxsplit* for fornecido, no máximo *maxsplit* divisões são feitas (assim, a lista terá no máximo ``maxsplit+1`` elementos). Se *maxsplit* não for especificado ou for ``-1``, não há limite no número de divisões (todas as divisões possíveis são feitas).
sv: Returnerar en lista med orden i strängen, med *sep* som avgränsningssträng. Om *maxsplit* anges görs högst *maxsplit* uppdelningar (listan kommer alltså att ha högst ``maxsplit+1`` element). Om *maxsplit* inte anges eller ``-1``, finns det ingen begränsning av antalet uppdelningar (alla möjliga uppdelningar görs).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty strings (for example, ``'1,,2'.split(',')`` returns ``['1', '', '2']``). The *sep* argument may consist of multiple characters as a single delimiter (to split with multiple delimiters, use :func:`re.split`). Splitting an empty string with a specified separator returns ``['']``.
pt_pt: Se *sep* for fornecido, delimitadores consecutivos não são agrupados e são considerados como delimitadores de *strings* vazias (por exemplo, ``'1,,2'.split(',')`` retorna ``['1', '', '2']``). O argumento *sep* pode consistir em vários caracteres como um único delimitador (para dividir com múltiplos delimitadores, use :func:`re.split`). Dividir uma *string* vazia com um separador especificado retorna ``['']``.
sv: Om *sep* anges grupperas inte på varandra följande avgränsare och de anses avgränsa tomma strängar (till exempel ger ``'1,,2'.split(',') ``['1', '', '2']``). Argumentet *sep* kan bestå av flera tecken som en enda avgränsare (för att dela upp med flera avgränsare, använd :func:`re.split`). Om en tom sträng delas upp med en angiven avgränsare returneras ``['']``.

source: For example::
pt_pt: Por exemplo::
sv: Till exempel::

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the string has leading or trailing whitespace. Consequently, splitting an empty string or a string consisting of just whitespace with a ``None`` separator returns ``[]``.
pt_pt: Se *sep* não for especificado ou for ``None``, um algoritmo de divisão diferente é aplicado: sequências consecutivas de espaços em branco são consideradas como um único separador, e o resultado não conterá *strings* vazias no início ou no fim se a *string* tiver espaços em branco iniciais ou finais. Consequentemente, dividir uma *string* vazia ou uma *string* composta apenas por espaços em branco com um separador ``None`` retorna ``[]``.
sv: Om *sep* inte anges eller är ``None`` används en annan delningsalgoritm: flera på varandra följande blanksteg betraktas som en enda separator, och resultatet innehåller inga tomma strängar i början eller slutet om strängen har inledande eller avslutande blanksteg. Om en tom sträng eller en sträng som bara består av blanksteg delas upp med en ``None``-separator blir följaktligen resultatet ``[]``.

source: If *sep* is not specified or is ``None`` and *maxsplit* is ``0``, only leading runs of consecutive whitespace are considered.
pt_pt: Se *sep* não for especificado ou for ``None`` e *maxsplit* for ``0``, apenas sequências iniciais de espaços em branco consecutivos são consideradas.
sv: Om *sep* inte anges eller är ``None`` och *maxsplit* är ``0``, beaktas endast ledande serier av på varandra följande blanksteg.

source: >>> "".split(None, 0) [] >>> " ".split(None, 0) [] >>> " foo ".split(maxsplit=0) ['foo ']
sv: >>> "".split(None, 0) [] >>> " ".split(Ingen, 0) [] >>> " foo ".split(maxsplit=0) ['foo ']

source: Return a list of the lines in the string, breaking at line boundaries. Line breaks are not included in the resulting list unless *keepends* is given and true.
pt_pt: Retorna uma lista das linhas na *string*, quebrando nos limites de linha. As quebras de linha não são incluídas na lista resultante, a menos que *keepends* seja fornecido e verdadeiro.
sv: Returnerar en lista över raderna i strängen, med radbrytning vid radgränser. Radbrytningar inkluderas inte i den resulterande listan om inte *keepends* anges och är true.

source: This method splits on the following line boundaries. In particular, the boundaries are a superset of :term:`universal newlines`.
pt_pt: Este método divide nos seguintes limites de linha. Em particular, os limites são um superconjunto de :term:`novas linhas universais`.
sv: Denna metod delar på följande linjegränser. I synnerhet är gränserna en övermängd av :term:`universal newlines`.

source: Description
pt_pt: Descrição
sv: Beskrivning

source: Line Feed
pt_pt: Alimentação de linha
sv: Linje matning

source: Carriage Return
pt_pt: Retorno de carro
sv: Vagnretur

source: Carriage Return + Line Feed
pt_pt: Retorno de carro + Alimentação de linha
sv: Vagnretur + radmatning

source: ``\v`` or ``\x0b``
pt_pt: ``\v`` ou ``\x0b``
sv: "v" eller "x0b

source: Line Tabulation
pt_pt: Tabulação de linha
sv: Linjetabellering

source: ``\f`` or ``\x0c``
pt_pt: ``\f`` ou ``\x0c``
sv: "f" eller "x0c

source: Form Feed
pt_pt: Alimentação de formulário
sv: Formulärmatning

source: File Separator
pt_pt: Separador de ficheiro
sv: Filavskiljare

source: Group Separator
pt_pt: Separador de grupo
sv: Gruppseparator

source: Record Separator
pt_pt: Separador de registo
sv: Skivseparator

source: Next Line (C1 Control Code)
pt_pt: Próxima linha (Código de controlo C1)
sv: Nästa rad (C1-kontrollkod)

source: Line Separator
pt_pt: Separador de linha
sv: Separatorlinje

source: Paragraph Separator
pt_pt: Separador de parágrafo
sv: Paragrafavskiljare

source: ``\v`` and ``\f`` added to list of line boundaries.
pt_pt: ``\v`` e ``\f`` adicionados à lista de limites de linha.
sv: "v" och "f" läggs till i listan över linjegränser.
