Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Python defines several iterator objects to support iteration over general and specific sequence types, dictionaries, and other more specialized forms. The specific types are not important beyond their implementation of the iterator protocol.
pt_pt: O Python define vários objetos iteradores para suportar iteração sobre tipos de sequência gerais e específicos, dicionários e outras formas mais especializadas. Os tipos específicos não são importantes além da sua implementação do protocolo de iterador.
sv: Python definierar flera iteratorobjekt för att stödja iteration över allmänna och specifika sekvenstyper, ordböcker och andra mer specialiserade former. De specifika typerna är inte viktiga utöver deras implementering av iteratorprotokollet.

source: Once an iterator's :meth:`~iterator.__next__` method raises :exc:`StopIteration`, it must continue to do so on subsequent calls. Implementations that do not obey this property are deemed broken.
pt_pt: Uma vez que o método :meth:`~iterator.__next__` de um iterador lança :exc:`StopIteration`, deve continuar a fazê-lo em chamadas subsequentes. Implementações que não obedecem a esta propriedade são consideradas defeituosas.
sv: När en iterators :meth:`~iterator.__next__`-metod ger upphov till :exc:`StopIteration`, måste den fortsätta att göra det vid efterföljande anrop. Implementationer som inte följer denna egenskap anses vara trasiga.

source: Generator Types
pt_pt: Tipos de gerador
sv: Typer av generatorer

source: Python's :term:`generator`\s provide a convenient way to implement the iterator protocol. If a container object's :meth:`~object.__iter__` method is implemented as a generator, it will automatically return an iterator object (technically, a generator object) supplying the :meth:`~iterator.__iter__` and :meth:`~generator.__next__` methods. More information about generators can be found in :ref:`the documentation for the yield expression <yieldexpr>`.
pt_pt: Os :term:`geradores` do Python fornecem uma forma conveniente de implementar o protocolo de iterador. Se o método :meth:`~object.__iter__` de um objeto contentor for implementado como um gerador, retornará automaticamente um objeto iterador (tecnicamente, um objeto gerador) que fornece os métodos :meth:`~iterator.__iter__` e :meth:`~generator.__next__`. Mais informações sobre geradores podem ser encontradas em :ref:`a documentação para a expressão yield <yieldexpr>`.
sv: Pythons :term:`generator` ger ett bekvämt sätt att implementera iteratorprotokollet. Om ett containerobjekts metod :meth:`~object.__iter__` implementeras som en generator, kommer den automatiskt att returnera ett iteratorobjekt (tekniskt sett ett generatorobjekt) som tillhandahåller metoderna :meth:`~iterator.__iter__` och :meth:`~generator.__next__`. Mer information om generatorer finns i :ref:``dokumentationen för yield-uttrycket <yieldexpr>`.

source: Sequence Types --- :class:`list`, :class:`tuple`, :class:`range`
pt_pt: Tipos de sequência --- :class:`list`, :class:`tuple`, :class:`range`
sv: Sekvenstyper --- :class:`list`, :class:`tuple`, :class:`range`

source: There are three basic sequence types: lists, tuples, and range objects. Additional sequence types tailored for processing of :ref:`binary data <binaryseq>` and :ref:`text strings <textseq>` are described in dedicated sections.
pt_pt: Existem três tipos básicos de sequência: listas, tuplos e objetos de intervalo. Tipos de sequência adicionais adaptados para processamento de :ref:`dados binários <binaryseq>` e :ref:`strings de texto <textseq>` são descritos em secções dedicadas.
sv: Det finns tre grundläggande sekvenstyper: listor, tupler och intervallobjekt. Ytterligare sekvenstyper som är skräddarsydda för bearbetning av :ref:``binärdata <binaryseq>`` och :ref:``textsträngar <textseq>`` beskrivs i särskilda avsnitt.

source: Common Sequence Operations
pt_pt: Operações comuns de sequência
sv: Vanliga sekvensoperationer

source: The operations in the following table are supported by most sequence types, both mutable and immutable. The :class:`collections.abc.Sequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
pt_pt: As operações na tabela seguinte são suportadas pela maioria dos tipos de sequência, tanto mutáveis como imutáveis. A ABC :class:`collections.abc.Sequence` é fornecida para facilitar a implementação correta destas operações em tipos de sequência personalizados.
sv: Operationerna i följande tabell stöds av de flesta sekvenstyper, både föränderliga och oföränderliga. ABC :class:`collections.abc.Sequence` tillhandahålls för att göra det enklare att korrekt implementera dessa operationer på anpassade sekvenstyper.

source: This table lists the sequence operations sorted in ascending priority. In the table, *s* and *t* are sequences of the same type, *n*, *i*, *j* and *k* are integers and *x* is an arbitrary object that meets any type and value restrictions imposed by *s*.
pt_pt: Esta tabela lista as operações de sequência ordenadas por prioridade ascendente. Na tabela, *s* e *t* são sequências do mesmo tipo, *n*, *i*, *j* e *k* são inteiros e *x* é um objeto arbitrário que cumpre quaisquer restrições de tipo e valor impostas por *s*.
sv: I denna tabell listas sekvensoperationerna sorterade i stigande prioritet. I tabellen är *s* och *t* sekvenser av samma typ, *n*, *i*, *j* och *k* är heltal och *x* är ett godtyckligt objekt som uppfyller alla typ- och värdebegränsningar som *s* ställer upp.

source: The ``in`` and ``not in`` operations have the same priorities as the comparison operations. The ``+`` (concatenation) and ``*`` (repetition) operations have the same priority as the corresponding numeric operations. [3]_
pt_pt: As operações ``in`` e ``not in`` têm as mesmas prioridades que as operações de comparação. As operações ``+`` (concatenação) e ``*`` (repetição) têm a mesma prioridade que as operações numéricas correspondentes. [3]_
sv: Operationerna ``in`` och ``not in`` har samma prioritet som jämförelseoperationerna. Operationerna ``+`` (konkatenering) och ``*`` (repetition) har samma prioritet som motsvarande numeriska operationer. [3]_

source: ``x in s``
sv: ``x i s```

source: ``True`` if an item of *s* is equal to *x*, else ``False``
pt_pt: ``True`` se um item de *s* for igual a *x*, senão ``False``
sv: ``True`` om ett objekt i *s* är lika med *x*, annars ``False``

source: ``x not in s``
sv: ``x inte i s```

source: ``False`` if an item of *s* is equal to *x*, else ``True``
pt_pt: ``False`` se um item de *s* for igual a *x*, senão ``True``
sv: ``False`` om ett objekt i *s* är lika med *x*, annars ``True``

source: the concatenation of *s* and *t*
pt_pt: a concatenação de *s* e *t*
sv: sammankopplingen av *s* och *t*

source: ``s * n`` or ``n * s``
pt_pt: ``s * n`` ou ``n * s``
sv: ``s * n`` eller ``n * s``

source: equivalent to adding *s* to itself *n* times
pt_pt: equivalente a adicionar *s* a si mesmo *n* vezes
sv: motsvarar att addera *s* till sig själv *n* gånger

source: *i*\ th item of *s*, origin 0
pt_pt: item *i* de *s*, origem 0
sv: *i*\ det tredje objektet i *s*, ursprung 0

source: slice of *s* from *i* to *j*
pt_pt: fatia de *s* de *i* a *j*
sv: skiva av *s* från *i* till *j*

source: ``s[i:j:k]``
sv: ``[i:j:k]``

source: slice of *s* from *i* to *j* with step *k*
pt_pt: fatia de *s* de *i* a *j* com passo *k*
sv: skiva av *s* från *i* till *j* med steg *k*

source: length of *s*
pt_pt: comprimento de *s*
sv: längd på *s*

source: smallest item of *s*
pt_pt: menor item de *s*
sv: minsta delen av *s*

source: largest item of *s*
pt_pt: maior item de *s*
sv: största posten av *s*

source: index of the first occurrence of *x* in *s* (at or after index *i* and before index *j*)
sv: index för den första förekomsten av *x* i *s* (vid eller efter index *i* och före index *j*)

source: total number of occurrences of *x* in *s*
sv: totalt antal förekomster av *x* i *s*

source: Sequences of the same type also support comparisons. In particular, tuples and lists are compared lexicographically by comparing corresponding elements. This means that to compare equal, every element must compare equal and the two sequences must be of the same type and have the same length. (For full details see :ref:`comparisons` in the language reference.)
pt_pt: Sequências do mesmo tipo também suportam comparações. Em particular, tuplos e listas são comparados lexicograficamente comparando elementos correspondentes. Isto significa que para serem iguais, todos os elementos devem ser iguais e as duas sequências devem ser do mesmo tipo e ter o mesmo comprimento. (Para mais detalhes, consulte :ref:`comparisons` na referência da linguagem.)
sv: Sekvenser av samma typ stöder också jämförelser. Framför allt jämförs tupler och listor lexikografiskt genom att jämföra motsvarande element. Detta innebär att för att jämföra lika måste varje element jämföra lika och de två sekvenserna måste vara av samma typ och ha samma längd. (För fullständig information se :ref:`comparisons` i språkreferensen)

source: Forward and reversed iterators over mutable sequences access values using an index. That index will continue to march forward (or backward) even if the underlying sequence is mutated. The iterator terminates only when an :exc:`IndexError` or a :exc:`StopIteration` is encountered (or when the index drops below zero).
pt_pt: Iteradores diretos e invertidos sobre sequências mutáveis acedem a valores usando um índice. Esse índice continuará a avançar (ou recuar) mesmo que a sequência subjacente seja mutada. O iterador termina apenas quando é encontrado um :exc:`IndexError` ou um :exc:`StopIteration` (ou quando o índice cai abaixo de zero).
sv: Framåtriktade och bakåtriktade iteratorer över muterbara sekvenser får tillgång till värden med hjälp av ett index. Detta index kommer att fortsätta att marschera framåt (eller bakåt) även om den underliggande sekvensen muteras. Iteratorn avslutas först när ett :exc:`IndexError` eller ett :exc:`StopIteration` inträffar (eller när indexet sjunker under noll).

source: While the ``in`` and ``not in`` operations are used only for simple containment testing in the general case, some specialised sequences (such as :class:`str`, :class:`bytes` and :class:`bytearray`) also use them for subsequence testing::
pt_pt: Embora as operações ``in`` e ``not in`` sejam usadas apenas para testes de contenção simples no caso geral, algumas sequências especializadas (como :class:`str`, :class:`bytes` e :class:`bytearray`) também as usam para testes de subsequência:
sv: Medan operationerna ``in`` och ``not in`` endast används för enkel testning av inneslutning i det allmänna fallet, använder vissa specialiserade sekvenser (t.ex. :class:`str`, :class:`bytes` och :class:`bytearray`) dem också för testning av undersekvenser::

source: >>> "gg" in "eggs" True
sv: >>> "gg" i "ägg" Sant

source: Values of *n* less than ``0`` are treated as ``0`` (which yields an empty sequence of the same type as *s*). Note that items in the sequence *s* are not copied; they are referenced multiple times. This often haunts new Python programmers; consider::
pt_pt: Valores de *n* menores que ``0`` são tratados como ``0`` (o que produz uma sequência vazia do mesmo tipo que *s*). Note que os itens na sequência *s* não são copiados; são referenciados várias vezes. Isto muitas vezes assombra programadores Python iniciantes; considere:
sv: Värden av *n* mindre än ``0`` behandlas som ``0`` (vilket ger en tom sekvens av samma typ som *s*). Observera att objekt i sekvensen *s* inte kopieras; de refereras flera gånger. Detta spökar ofta för nya Python-programmerare; tänk på::

source: >>> lists = [[]] * 3 >>> lists [[], [], []] >>> lists[0].append(3) >>> lists [[3], [3], [3]]
sv: >>> listor = [[]] * 3 >>> listor [[], [], []] >>> listor[0].append(3) >>> listor [[3], [3], [3]]

source: What has happened is that ``[[]]`` is a one-element list containing an empty list, so all three elements of ``[[]] * 3`` are references to this single empty list. Modifying any of the elements of ``lists`` modifies this single list. You can create a list of different lists this way::
pt_pt: O que aconteceu é que ``[[]]`` é uma lista de um elemento contendo uma lista vazia, por isso os três elementos de ``[[]] * 3`` são referências a esta única lista vazia. Modificar qualquer um dos elementos de ``lists`` modifica esta única lista. Pode criar uma lista de listas diferentes desta forma:
sv: Vad som har hänt är att ``[]]`` är en lista med ett element som innehåller en tom lista, så alla tre elementen i ``[]] * 3`` är referenser till denna enda tomma lista. Om du ändrar något av elementen i ``lists`` ändras denna enda lista. Du kan skapa en lista med olika listor på följande sätt::

source: >>> lists = [[] for i in range(3)] >>> lists[0].append(3) >>> lists[1].append(5) >>> lists[2].append(7) >>> lists [[3], [5], [7]]
sv: >>> lists = [[] for i in range(3)] >>> lists[0].append(3) >>> listor[0].lägg till(3) >>> listor[1].append(5) >>> listor[2].append(7) >>> listor [[3], [5], [7]]

source: Further explanation is available in the FAQ entry :ref:`faq-multidimensional-list`.
pt_pt: Mais explicações estão disponíveis na entrada da FAQ :ref:`faq-multidimensional-list`.
sv: Ytterligare förklaringar finns i FAQ-artikeln :ref:`faq-multidimensional-list`.

source: If *i* or *j* is negative, the index is relative to the end of sequence *s*: ``len(s) + i`` or ``len(s) + j`` is substituted. But note that ``-0`` is still ``0``.
pt_pt: Se *i* ou *j* for negativo, o índice é relativo ao final da sequência *s*: ``len(s) + i`` ou ``len(s) + j`` é substituído. Mas note que ``-0`` ainda é ``0``.
sv: Om *i* eller *j* är negativ, är indexet relativt slutet av sekvensen *s*: ``len(s) + i`` eller ``len(s) + j`` ersätts. Men observera att ``-0`` fortfarande är ``0``.

source: The slice of *s* from *i* to *j* is defined as the sequence of items with index *k* such that ``i <= k < j``. If *i* or *j* is greater than ``len(s)``, use ``len(s)``. If *i* is omitted or ``None``, use ``0``. If *j* is omitted or ``None``, use ``len(s)``. If *i* is greater than or equal to *j*, the slice is empty.
pt_pt: A fatia de *s* de *i* a *j* é definida como a sequência de itens com índice *k* tal que ``i <= k < j``. Se *i* ou *j* for maior que ``len(s)``, use ``len(s)``. Se *i* for omitido ou ``None``, use ``0``. Se *j* for omitido ou ``None``, use ``len(s)``. Se *i* for maior ou igual a *j*, a fatia está vazia.
sv: Slice av *s* från *i* till *j* definieras som den sekvens av objekt med index *k* som är sådan att ``i <= k < j``. Om *i* eller *j* är större än ``len(s)``, använd ``len(s)``. Om *i* är utelämnad eller ``None``, använd ``0``. Om *j* utelämnas eller ``None``, använd ``len(s)``. Om *i* är större än eller lika med *j* är skivan tom.

source: The slice of *s* from *i* to *j* with step *k* is defined as the sequence of items with index ``x = i + n*k`` such that ``0 <= n < (j-i)/k``. In other words, the indices are ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` and so on, stopping when *j* is reached (but never including *j*). When *k* is positive, *i* and *j* are reduced to ``len(s)`` if they are greater. When *k* is negative, *i* and *j* are reduced to ``len(s) - 1`` if they are greater. If *i* or *j* are omitted or ``None``, they become "end" values (which end depends on the sign of *k*). Note, *k* cannot be zero. If *k* is ``None``, it is treated like ``1``.
pt_pt: A fatia de *s* de *i* a *j* com passo *k* é definida como a sequência de itens com índice ``x = i + n*k`` tal que ``0 <= n < (j-i)/k``. Em outras palavras, os índices são ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` e assim por diante, parando quando *j* é atingido (mas nunca incluindo *j*). Quando *k* é positivo, *i* e *j* são reduzidos a ``len(s)`` se forem maiores. Quando *k* é negativo, *i* e *j* são reduzidos a ``len(s) - 1`` se forem maiores. Se *i* ou *j* forem omitidos ou ``None``, tornam-se valores "fim" (que fim depende do sinal de *k*). Note que *k* não pode ser zero. Se *k* for ``None``, é tratado como ``1``.
sv: Slice av *s* från *i* till *j* med steg *k* definieras som sekvensen av objekt med index ``x = i + n*k`` så att ``0 <= n < (j-i)/k``. Med andra ord är indexen ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` och så vidare, med stopp när *j* nås (men aldrig inklusive *j*). När *k* är positiv reduceras *i* och *j* till ``len(s)`` om de är större. När *k* är negativ reduceras *i* och *j* till ``len(s) - 1`` om de är större. Om *i* eller *j* utelämnas eller är ``None``, blir de "slut"-värden (vilket slut beror på tecknet för *k*). Observera att *k* inte kan vara noll. Om *k* är ``None`` behandlas det som ``1``.

source: Concatenating immutable sequences always results in a new object. This means that building up a sequence by repeated concatenation will have a quadratic runtime cost in the total sequence length. To get a linear runtime cost, you must switch to one of the alternatives below:
pt_pt: A concatenação de sequências imutáveis resulta sempre num novo objeto. Isto significa que construir uma sequência por concatenação repetida terá um custo de tempo de execução quadrático no comprimento total da sequência. Para obter um custo de tempo de execução linear, deve mudar para uma das alternativas abaixo:
sv: Sammankoppling av oföränderliga sekvenser resulterar alltid i ett nytt objekt. Detta innebär att uppbyggnaden av en sekvens genom upprepad konkatenering får en kvadratisk körtidskostnad i den totala sekvenslängden. För att få en linjär körtidskostnad måste du byta till något av alternativen nedan:

source: if concatenating :class:`str` objects, you can build a list and use :meth:`str.join` at the end or else write to an :class:`io.StringIO` instance and retrieve its value when complete
pt_pt: se estiver a concatenar objetos :class:`str`, pode construir uma lista e usar :meth:`str.join` no final ou escrever para uma instância :class:`io.StringIO` e recuperar o seu valor quando completo
sv: om du sammanfogar :class:`str`-objekt kan du bygga en lista och använda :meth:`str.join` i slutet eller skriva till en :class:`io.StringIO`-instans och hämta dess värde när du är klar

source: if concatenating :class:`bytes` objects, you can similarly use :meth:`bytes.join` or :class:`io.BytesIO`, or you can do in-place concatenation with a :class:`bytearray` object. :class:`bytearray` objects are mutable and have an efficient overallocation mechanism
pt_pt: se estiver a concatenar objetos :class:`bytes`, pode usar de forma semelhante :meth:`bytes.join` ou :class:`io.BytesIO`, ou pode fazer concatenação *in-place* com um objeto :class:`bytearray`. Os objetos :class:`bytearray` são mutáveis e têm um mecanismo eficiente de sobrealocação
sv: om du konkatenerar :class:`bytes`-objekt kan du på samma sätt använda :meth:`bytes.join` eller :class:`io.BytesIO`, eller så kan du göra konkatenering på plats med ett :class:`bytearray`-objekt. :class:`bytearray`-objekt är muterbara och har en effektiv mekanism för overallokering

source: if concatenating :class:`tuple` objects, extend a :class:`list` instead
pt_pt: se estiver a concatenar objetos :class:`tuple`, estenda uma :class:`list`
sv: om du konkatenerar :class:`tuple`-objekt, förläng en :class:`list` istället

source: for other types, investigate the relevant class documentation
pt_pt: para outros tipos, consulte a documentação da classe relevante
sv: för andra typer, undersök den relevanta klassdokumentationen

source: Some sequence types (such as :class:`range`) only support item sequences that follow specific patterns, and hence don't support sequence concatenation or repetition.
pt_pt: Alguns tipos de sequência (como :class:`range`) só suportam sequências de itens que seguem padrões específicos, e por isso não suportam concatenação ou repetição de sequências.
sv: Vissa sekvenstyper (t.ex. :class:`range`) stöder endast sekvenser av objekt som följer specifika mönster och stöder därför inte sammankoppling eller upprepning av sekvenser.

source: ``index`` raises :exc:`ValueError` when *x* is not found in *s*. Not all implementations support passing the additional arguments *i* and *j*. These arguments allow efficient searching of subsections of the sequence. Passing the extra arguments is roughly equivalent to using ``s[i:j].index(x)``, only without copying any data and with the returned index being relative to the start of the sequence rather than the start of the slice.
sv: ``index`` ger upphov till :exc:`ValueError` när *x* inte finns i *s*. Det är inte alla implementationer som stöder de ytterligare argumenten *i* och *j*. Dessa argument möjliggör effektiv sökning av underavsnitt av sekvensen. Att skicka de extra argumenten motsvarar i stort sett att använda ``s[i:j].index(x)``, men utan att kopiera några data och med det returnerade indexet i förhållande till början av sekvensen snarare än början av skivan.

source: An :exc:`IndexError` is raised if *i* is outside the sequence range.
pt_pt: Uma exceção :exc:`IndexError` é lançada se *i* estiver fora do intervalo da sequência.
sv: Ett :exc:`IndexError` uppstår om *i* ligger utanför sekvensintervallet.

source: Immutable Sequence Types
pt_pt: Tipos de sequência imutável
sv: Oföränderliga sekvenstyper

source: The only operation that immutable sequence types generally implement that is not also implemented by mutable sequence types is support for the :func:`hash` built-in.
pt_pt: A única operação que os tipos de sequência imutáveis geralmente implementam e que não é também implementada pelos tipos de sequência mutáveis é o suporte para a função integrada :func:`hash`.
sv: Den enda operation som oföränderliga sekvenstyper i allmänhet implementerar och som inte också implementeras av föränderliga sekvenstyper är stöd för den inbyggda :func:`hash`.

source: This support allows immutable sequences, such as :class:`tuple` instances, to be used as :class:`dict` keys and stored in :class:`set` and :class:`frozenset` instances.
pt_pt: Este suporte permite que sequências imutáveis, como instâncias :class:`tuple`, sejam usadas como chaves :class:`dict` e armazenadas em instâncias :class:`set` e :class:`frozenset`.
sv: Detta stöd gör att oföränderliga sekvenser, t.ex. :class:`tuple`-instanser, kan användas som :class:`dict`-nycklar och lagras i :class:`set`- och :class:`frozenset`-instanser.

source: Attempting to hash an immutable sequence that contains unhashable values will result in :exc:`TypeError`.
pt_pt: Tentar calcular o *hash* de uma sequência imutável que contenha valores não hasháveis resultará em :exc:`TypeError`.
sv: Försök att hasha en oföränderlig sekvens som innehåller värden som inte kan hashas kommer att resultera i :exc:`TypeError`.

source: Mutable Sequence Types
pt_pt: Tipos de sequência mutável
sv: Mutabla sekvenstyper

source: The operations in the following table are defined on mutable sequence types. The :class:`collections.abc.MutableSequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
pt_pt: As operações na tabela seguinte são definidas em tipos de sequência mutáveis. A ABC :class:`collections.abc.MutableSequence` é fornecida para facilitar a implementação correta destas operações em tipos de sequência personalizados.
sv: Operationerna i följande tabell är definierade för mutabla sekvenstyper. Klassen :`collections.abc.MutableSequence` ABC tillhandahålls för att göra det enklare att korrekt implementera dessa operationer på anpassade sekvenstyper.
