Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Return a copy of the sequence with each byte interpreted as an ASCII character, and the first byte capitalized and the rest lowercased. Non-ASCII byte values are passed through unchanged.
pt_pt: Retorna uma cópia da sequência com cada byte interpretado como um caractere ASCII, e o primeiro byte em maiúscula e o resto em minúsculas. Valores de bytes não-ASCII são passados sem alteração.
sv: Returnerar en kopia av sekvensen där varje byte tolkas som ett ASCII-tecken och den första byten skrivs med stor bokstav och resten med liten bokstav. Bytevärden som inte är ASCII-värden skickas oförändrade.

source: Return a copy of the sequence where all ASCII tab characters are replaced by one or more ASCII spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* bytes (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the sequence, the current column is set to zero and the sequence is examined byte by byte. If the byte is an ASCII tab character (``b'\t'``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the current byte is an ASCII newline (``b'\n'``) or carriage return (``b'\r'``), it is copied and the current column is reset to zero. Any other byte value is copied unchanged and the current column is incremented by one regardless of how the byte value is represented when printed::
pt_pt: Retorna uma cópia da sequência onde todos os caracteres de tabulação ASCII são substituídos por um ou mais espaços ASCII, dependendo da coluna atual e do tamanho de tabulação dado. As posições de tabulação ocorrem a cada *tabsize* bytes (o predefinido é 8, dando posições de tabulação nas colunas 0, 8, 16, etc.). Para expandir a sequência, a coluna atual é definida como zero e a sequência é examinada byte a byte. Se o byte for um caractere de tabulação ASCII (``b'\t'``), um ou mais caracteres de espaço são inseridos no resultado até que a coluna atual seja igual à próxima posição de tabulação. (O próprio caractere de tabulação não é copiado.) Se o byte atual for uma nova linha ASCII (``b'\n'``) ou retorno de carro (``b'\r'``), é copiado e a coluna atual é redefinida para zero. Qualquer outro valor de byte é copiado sem alteração e a coluna atual é incrementada em um, independentemente de como o valor do byte é representado quando impresso:
sv: Returnerar en kopia av sekvensen där alla ASCII tabbtecken ersätts av ett eller flera ASCII-rymder, beroende på aktuell kolumn och angiven tabbstorlek. Tabbpositioner förekommer varje *tabsize* byte (standard är 8, vilket ger tabbpositioner i kolumnerna 0, 8, 16 och så vidare). För att expandera sekvensen sätts den aktuella kolumnen till noll och sekvensen undersöks byte för byte. Om byten är ett ASCII-tab-tecken (``b'\t'``) infogas ett eller flera mellanslagstecken i resultatet tills den aktuella kolumnen är lika med nästa tab-position. (Tabbtecknet i sig kopieras inte.) Om den aktuella byten är en ASCII newline (``b'\n'``) eller carriage return (``b'\r'``) kopieras den och den aktuella kolumnen nollställs. Alla andra bytevärden kopieras oförändrade och den aktuella kolumnen ökas med ett oavsett hur bytevärdet representeras när det skrivs ut::

source: Return ``True`` if all bytes in the sequence are alphabetical ASCII characters or ASCII decimal digits and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
pt_pt: Retorna ``True`` se todos os bytes na sequência forem caracteres alfabéticos ASCII ou dígitos decimais ASCII e a sequência não estiver vazia, ``False`` caso contrário. Caracteres alfabéticos ASCII são aqueles valores de bytes na sequência ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Dígitos decimais ASCII são aqueles valores de bytes na sequência ``b'0123456789'``.
sv: Returnerar ``True`` om alla bytes i sekvensen är alfabetiska ASCII-tecken eller ASCIIdecimalsiffror och sekvensen inte är tom, annars ``False``. Alfabetiska ASCII-tecken är de bytevärden som finns i sekvensen ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. ASCII decimalsiffror är de bytevärden i sekvensen ``b'0123456789'``.

source: >>> b'ABCabc1'.isalnum() True >>> b'ABC abc1'.isalnum() False
sv: >>> b'ABCabc1'.isalnum() Sant >>> b'ABC abc1'.isalnum() Falsk

source: Return ``True`` if all bytes in the sequence are alphabetic ASCII characters and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
pt_pt: Retorna ``True`` se todos os bytes na sequência forem caracteres alfabéticos ASCII e a sequência não estiver vazia, ``False`` caso contrário. Caracteres alfabéticos ASCII são aqueles valores de bytes na sequência ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
sv: Returnerar ``True`` om alla bytes i sekvensen är alfabetiska ASCII-tecken och sekvensen inte är tom, annars ``False``. Alfabetiska ASCII-tecken är de bytevärden som finns i sekvensen ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.

source: >>> b'ABCabc'.isalpha() True >>> b'ABCabc1'.isalpha() False
sv: >>> b'ABCabc'.isalpha() Sant >>> b'ABCabc1'.isalpha() Falskt

source: Return ``True`` if the sequence is empty or all bytes in the sequence are ASCII, ``False`` otherwise. ASCII bytes are in the range 0-0x7F.
pt_pt: Retorna ``True`` se a sequência estiver vazia ou todos os bytes na sequência forem ASCII, ``False`` caso contrário. Bytes ASCII estão no intervalo 0-0x7F.
sv: Returnerar ``True`` om sekvensen är tom eller om alla byte i sekvensen är ASCII, annars ``False``. ASCII-bytes ligger i intervallet 0-0x7F.

source: Return ``True`` if all bytes in the sequence are ASCII decimal digits and the sequence is not empty, ``False`` otherwise. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
pt_pt: Retorna ``True`` se todos os bytes na sequência forem dígitos decimais ASCII e a sequência não estiver vazia, ``False`` caso contrário. Dígitos decimais ASCII são aqueles valores de bytes na sequência ``b'0123456789'``.
sv: Returnerar ``True`` om alla bytes i sekvensen är ASCII decimala siffror och sekvensen inte är tom, annars ``False``. ASCII decimalsiffror är de bytevärden som finns i sekvensen ``b'0123456789'``.

source: >>> b'1234'.isdigit() True >>> b'1.23'.isdigit() False
sv: >>> b'1234'.isdigit() Sant >>> b'1.23'.isdigit() Falsk

source: Return ``True`` if there is at least one lowercase ASCII character in the sequence and no uppercase ASCII characters, ``False`` otherwise.
pt_pt: Retorna ``True`` se houver pelo menos um caractere ASCII minúsculo na sequência e nenhum caractere ASCII maiúsculo, ``False`` caso contrário.
sv: Returnerar ``True`` om det finns minst ett ASCII-tecken med små bokstäver i sekvensen och inga ASCII-tecken med stora bokstäver, annars ``False``.

source: >>> b'hello world'.islower() True >>> b'Hello world'.islower() False
sv: >>> b'hello world'.islower() Sant >>> b'Hello world'.islower() Falsk

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
pt_pt: Caracteres ASCII minúsculos são aqueles valores de bytes na sequência ``b'abcdefghijklmnopqrstuvwxyz'``. Caracteres ASCII maiúsculos são aqueles valores de bytes na sequência ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
sv: ASCII-tecken med gemener är de bytevärden som ingår i sekvensen ``b'abcdefghijklmnopqrstuvwxyz'``. Versala ASCII-tecken är de bytevärden som ingår i sekvensen ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.

source: Return ``True`` if all bytes in the sequence are ASCII whitespace and the sequence is not empty, ``False`` otherwise. ASCII whitespace characters are those byte values in the sequence ``b' \t\n\r\x0b\f'`` (space, tab, newline, carriage return, vertical tab, form feed).
pt_pt: Retorna ``True`` se todos os bytes na sequência forem espaços em branco ASCII e a sequência não estiver vazia, ``False`` caso contrário. Caracteres de espaço em branco ASCII são aqueles valores de bytes na sequência ``b' \t\n\r\x0b\f'`` (espaço, tabulação, nova linha, retorno de carro, tabulação vertical, alimentação de formulário).
sv: Returnerar ``True`` om alla byte i sekvensen är ASCII blanksteg och sekvensen inte är tom, annars ``False``. ASCII-tecknen för blanksteg är de bytevärden i sekvensen ``b' \t\n\r\x0b\f'`` (mellanslag, tabb, ny rad, vagnsretur, vertikal tabb, form feed).

source: Return ``True`` if the sequence is ASCII titlecase and the sequence is not empty, ``False`` otherwise. See :meth:`bytes.title` for more details on the definition of "titlecase".
pt_pt: Retorna ``True`` se a sequência estiver em título ASCII e a sequência não estiver vazia, ``False`` caso contrário. Consulte :meth:`bytes.title` para mais detalhes sobre a definição de "titlecase".
sv: Returnerar ``True`` om sekvensen är ASCII titlecase och sekvensen inte är tom, ``False`` annars. Se :meth:`bytes.title` för mer information om definitionen av "titlecase".

source: >>> b'Hello World'.istitle() True >>> b'Hello world'.istitle() False
sv: >>> b'Hello World'.istitle() Sant >>> b'Hello world'.istitle() Falsk

source: Return ``True`` if there is at least one uppercase alphabetic ASCII character in the sequence and no lowercase ASCII characters, ``False`` otherwise.
pt_pt: Retorna ``True`` se houver pelo menos um caractere alfabético ASCII maiúsculo na sequência e nenhum caractere ASCII minúsculo, ``False`` caso contrário.
sv: Returnerar ``True`` om det finns minst ett versalt alfabetiskt ASCII-tecken i sekvensen och inga gemena ASCII-tecken, annars ``False``.

source: >>> b'HELLO WORLD'.isupper() True >>> b'Hello world'.isupper() False
sv: >>> b'HELLO WORLD'.isupper() Sant >>> b'Hello world'.isupper() False

source: Return a copy of the sequence with all the uppercase ASCII characters converted to their corresponding lowercase counterpart.
pt_pt: Retorna uma cópia da sequência com todos os caracteres ASCII maiúsculos convertidos para os seus correspondentes minúsculos.
sv: Returnerar en kopia av sekvensen med alla ASCII-tecken med versaler konverterade till motsvarande tecken med gemener.

source: >>> b'Hello World'.lower() b'hello world'
sv: >>> b'Hello World'.lower() b'hej världen'

source: Return a list of the lines in the binary sequence, breaking at ASCII line boundaries. This method uses the :term:`universal newlines` approach to splitting lines. Line breaks are not included in the resulting list unless *keepends* is given and true.
pt_pt: Retorna uma lista das linhas na sequência binária, quebrando nos limites de linha ASCII. Este método usa a abordagem :term:`novas linhas universais` para dividir linhas. As quebras de linha não são incluídas na lista resultante, a menos que *keepends* seja fornecido e verdadeiro.
sv: Returnerar en lista med raderna i den binära sekvensen, med brytning vid ASCII-radgränser. Den här metoden använder :term:`universal newlines` för att dela upp rader. Radbrytningar inkluderas inte i den resulterande listan om inte *keepends* anges och är true.

source: Unlike :meth:`~bytes.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
pt_pt: Ao contrário de :meth:`~bytes.split` quando uma *string* delimitadora *sep* é fornecida, este método retorna uma lista vazia para a *string* vazia, e uma quebra de linha terminal não resulta numa linha extra:
sv: Till skillnad från :meth:`~bytes.split` när en avgränsningssträng *sep* anges, returnerar den här metoden en tom lista för den tomma strängen, och en terminal radbrytning resulterar inte i en extra rad::

source: >>> b"".split(b'\n'), b"Two lines\n".split(b'\n') ([b''], [b'Two lines', b'']) >>> b"".splitlines(), b"One line\n".splitlines() ([], [b'One line'])
sv: >>> b"".split(b'\n'), b"Två linjer\n".split(b'\n') ([b''], [b'Två rader', b'']) >>> b"".splitlines(), b"En rad\n".splitlines() ([], [b'En rad'])

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart and vice-versa.
pt_pt: Retorna uma cópia da sequência com todos os caracteres ASCII minúsculos convertidos para os seus correspondentes maiúsculos e vice-versa.
sv: Returnerar en kopia av sekvensen med alla ASCII-tecken med gemener konverterade till motsvarande tecken med versaler och vice versa.

source: >>> b'Hello World'.swapcase() b'hELLO wORLD'
sv: >>> b'Hello World'.swapcase() b'hELLO VÄRLDEN'

source: Unlike :func:`str.swapcase`, it is always the case that ``bin.swapcase().swapcase() == bin`` for the binary versions. Case conversions are symmetrical in ASCII, even though that is not generally true for arbitrary Unicode code points.
pt_pt: Ao contrário de :func:`str.swapcase`, é sempre o caso que ``bin.swapcase().swapcase() == bin`` para as versões binárias. As conversões de caixa são simétricas em ASCII, embora isso não seja geralmente verdadeiro para pontos de código Unicode arbitrários.
sv: Till skillnad från :func:`str.swapcase` är det alltid så att ``bin.swapcase().swapcase() == bin`` för de binära versionerna. Omvandling av versaler är symmetrisk i ASCII, även om det i allmänhet inte är sant för godtyckliga Unicode-kodpunkter.

source: Return a titlecased version of the binary sequence where words start with an uppercase ASCII character and the remaining characters are lowercase. Uncased byte values are left unmodified.
pt_pt: Retorna uma versão da sequência binária em que as palavras começam com um caractere ASCII maiúsculo e os restantes caracteres são minúsculos. Valores de bytes sem caixa são deixados sem modificação.
sv: Returnerar en version med versaler av den binära sekvensen där orden börjar med ett ASCII-tecken med versaler och de återstående tecknen är gemener. Bytevärden som inte är versaler lämnas oförändrade.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. All other byte values are uncased.
pt_pt: Caracteres ASCII minúsculos são aqueles valores de bytes na sequência ``b'abcdefghijklmnopqrstuvwxyz'``. Caracteres ASCII maiúsculos são aqueles valores de bytes na sequência ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Todos os outros valores de bytes são sem caixa.
sv: ASCII-tecken med gemener är de bytevärden som ingår i sekvensen ``b'abcdefghijklmnopqrstuvwxyz'``. Versala ASCII-tecken är de bytevärden i sekvensen ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Alla andra bytevärden är okommaterade.

source: >>> b"they're bill's friends from the UK".title() b"They'Re Bill'S Friends From The Uk"
sv: >>> b"de är Bills vänner från Storbritannien".title() b"De är Bills vänner från Storbritannien"

source: A workaround for apostrophes can be constructed using regular expressions::
pt_pt: Uma solução alternativa para apóstrofos pode ser construída usando expressões regulares:
sv: En lösning för apostrofer kan konstrueras med hjälp av reguljära uttryck::

source: >>> import re >>> def titlecase(s): ... return re.sub(rb"[A-Za-z]+('[A-Za-z]+)?", ... lambda mo: mo.group(0)[0:1].upper() + ... mo.group(0)[1:].lower(), ... s) ... >>> titlecase(b"they're bill's friends.") b"They're Bill's Friends."
sv: >>> import re >>> def titlecase(s): ... return re.sub(rb"[A-Za-z]+('[A-Za-z]+)?", ... lambda mo: mo.group(0)[0:1].upper() + ... mo.group(0)[1:].lower(), ... s) ... >>> titlecase(b"de är Bills vänner.") b"De är Bills vänner."

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart.
pt_pt: Retorna uma cópia da sequência com todos os caracteres ASCII minúsculos convertidos para os seus correspondentes maiúsculos.
sv: Returnerar en kopia av sekvensen med alla ASCII-tecken med gemener konverterade till motsvarande tecken med versaler.

source: Return a copy of the sequence left filled with ASCII ``b'0'`` digits to make a sequence of length *width*. A leading sign prefix (``b'+'``/ ``b'-'``) is handled by inserting the padding *after* the sign character rather than before. For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(seq)``.
pt_pt: Retorna uma cópia da sequência preenchida à esquerda com dígitos ASCII ``b'0'`` para criar uma sequência de comprimento *width*. Um prefixo de sinal inicial (``b'+'``/ ``b'-'``) é tratado inserindo o preenchimento *depois* do caractere de sinal em vez de antes. Para objetos :class:`bytes`, a sequência original é retornada se *width* for menor ou igual a ``len(seq)``.
sv: Returnerar en kopia av den sekvens som lämnats fylld med ASCII ``b'0'`` siffror för att skapa en sekvens med längden *bredd*. Ett ledande teckenprefix (``b'+'``/ ``b'-'``) hanteras genom att utfyllnaden infogas *efter* tecknet istället för före. För :class:`bytes`-objekt returneras den ursprungliga sekvensen om *width* är mindre än eller lika med ``len(seq)``.

source: ``printf``-style Bytes Formatting
pt_pt: Formatação de bytes no estilo ``printf``
sv: byteformatering i stil med ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). If the value being printed may be a tuple or dictionary, wrap it in a tuple.
pt_pt: As operações de formatação descritas aqui apresentam várias particularidades que levam a vários erros comuns (como falhar ao exibir tuplos e dicionários corretamente). Se o valor a ser impresso puder ser um tuplo ou dicionário, encapsule-o num tuplo.
sv: De formateringsoperationer som beskrivs här uppvisar en rad olika egenheter som leder till ett antal vanliga fel (t.ex. att tuplar och ordböcker inte visas korrekt). Om det värde som skrivs ut kan vara en tupel eller en ordbok ska det paketeras i en tupel.

source: Bytes objects (``bytes``/``bytearray``) have one unique built-in operation: the ``%`` operator (modulo). This is also known as the bytes *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a bytes object), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
pt_pt: Os objetos bytes (``bytes``/``bytearray``) têm uma operação incorporada única: o operador ``%`` (módulo). Isto também é conhecido como o operador de *formatação* ou *interpolação* de bytes. Dado ``format % values`` (onde *format* é um objeto bytes), as especificações de conversão ``%`` em *format* são substituídas por zero ou mais elementos de *values*. O efeito é semelhante ao uso da função :c:func:`sprintf` na linguagem C.
sv: Bytesobjekt (``bytes``/`bytearray``) har en unik inbyggd operation: operatorn ``%`` (modulo). Detta är också känt som bytes *formatering* eller *interpolation*-operator. Givet ``format % values`` (där *format* är ett bytesobjekt), ersätts ``%`` konverteringsspecifikationer i *format* med noll eller flera element i *values*. Effekten liknar användningen av :c:func:`sprintf` i C-språket.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format bytes object, or a single mapping object (for example, a dictionary).
pt_pt: Se *format* requer um único argumento, *values* pode ser um objeto não-tuplo. [5]_ Caso contrário, *values* deve ser um tuplo com exatamente o número de itens especificado pelo objeto bytes de formato, ou um único objeto de mapeamento (por exemplo, um dicionário).
sv: Om *format* kräver ett enda argument kan *values* vara ett enda objekt som inte är en tupel. [5]_ Annars måste *values* vara en tupel med exakt det antal objekt som anges av formatbytesobjektet, eller ett enda mappningsobjekt (t.ex. en ordbok).

source: When the right argument is a dictionary (or other mapping type), then the formats in the bytes object *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
pt_pt: Quando o argumento da direita é um dicionário (ou outro tipo de mapeamento), então os formatos no objeto bytes *devem* incluir uma chave de mapeamento entre parênteses para esse dicionário inserida imediatamente após o caractere ``'%'``. A chave de mapeamento seleciona o valor a ser formatado a partir do mapeamento. Por exemplo:
sv: När det högra argumentet är en ordbok (eller annan mappningstyp), måste formaten i bytesobjektet *inkludera* en parentetisk mappningsnyckel till ordboken som infogas omedelbart efter tecknet ``'%'``. Mappningsnyckeln väljer det värde som ska formateras från mappningen. Exempelvis

source: Single byte (accepts integer or single byte objects).
pt_pt: Byte único (aceita inteiro ou objetos de byte único).
sv: Single byte (accepterar objekt med heltal eller single byte).

source: Bytes (any object that follows the :ref:`buffer protocol <bufferobjects>` or has :meth:`~object.__bytes__`).
pt_pt: Bytes (qualquer objeto que segue o :ref:`protocolo de buffer <bufferobjects>` ou tem :meth:`~object.__bytes__`).
sv: Bytes (alla objekt som följer :ref:`buffer protocol <bufferobjects>` eller har :meth:`~object.__bytes__`).

source: ``'s'`` is an alias for ``'b'`` and should only be used for Python2/3 code bases.
pt_pt: ``'s'`` é um alias para ``'b'`` e deve ser usado apenas para bases de código Python2/3.
sv: ``'s'`` är ett alias för ``'b'`` och bör endast användas för Python2/3-kodbaser.

source: Bytes (converts any Python object using ``repr(obj).encode('ascii', 'backslashreplace')``).
pt_pt: Bytes (converte qualquer objeto Python usando ``repr(obj).encode('ascii', 'backslashreplace')``).
sv: Bytes (konverterar valfritt Python-objekt med ``repr(obj).encode('ascii', 'backslashreplace')``).

source: ``'r'`` is an alias for ``'a'`` and should only be used for Python2/3 code bases.
pt_pt: ``'r'`` é um alias para ``'a'`` e deve ser usado apenas para bases de código Python2/3.
sv: ``'r'`` är ett alias för ``'a'`` och bör endast användas för Python2/3-kodbaser.

source: ``b'%s'`` is deprecated, but will not be removed during the 3.x series.
pt_pt: ``b'%s'`` está obsoleto, mas não será removido durante a série 3.x.
sv: ``b'%s'`` är föråldrad, men kommer inte att tas bort under 3.x-serien.

source: ``b'%r'`` is deprecated, but will not be removed during the 3.x series.
pt_pt: ``b'%r'`` está obsoleto, mas não será removido durante a série 3.x.
sv: ``b'%r'`` är föråldrad, men kommer inte att tas bort under 3.x-serien.

source: :pep:`461` - Adding % formatting to bytes and bytearray
pt_pt: :pep:`461` - Adicionar formatação % a bytes e bytearray
sv: :pep:`461` - Lägga till % formatering till bytes och bytearray

source: Memory Views
pt_pt: Vistas de memória
sv: Minnesvy

source: :class:`memoryview` objects allow Python code to access the internal data of an object that supports the :ref:`buffer protocol <bufferobjects>` without copying.
pt_pt: Os objetos :class:`memoryview` permitem que o código Python aceda aos dados internos de um objeto que suporta o :ref:`protocolo de buffer <bufferobjects>` sem copiar.
sv: :class:`memoryview`-objekt gör det möjligt för Python-kod att komma åt interna data i ett objekt som stöder :ref:`buffer protocol <bufferobjects>` utan kopiering.
