Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: ``GenericAlias`` objects are generally created by :ref:`subscripting <subscriptions>` a class. They are most often used with :ref:`container classes <sequence-types>`, such as :class:`list` or :class:`dict`. For example, ``list[int]`` is a ``GenericAlias`` object created by subscripting the ``list`` class with the argument :class:`int`. ``GenericAlias`` objects are intended primarily for use with :term:`type annotations <annotation>`.
pt_pt: Os objetos ``GenericAlias`` são geralmente criados por :ref:`subscrito <subscriptions>` de uma classe. São mais frequentemente usados com :ref:`classes de contentores <sequence-types>`, como :class:`list` ou :class:`dict`. Por exemplo, ``list[int]`` é um objeto ``GenericAlias`` criado ao subscrever a classe ``list`` com o argumento :class:`int`. Os objetos ``GenericAlias`` são destinados principalmente para uso com :term:`anotações de tipo <annotation>`.
sv: objekt av typen ``GenericAlias`` skapas i allmänhet genom :ref:`subscripting <subscriptions>` av en klass. De används oftast med :ref:``container classes <sequence-types>`, såsom :class:`list` eller :class:`dict`. Till exempel är ``list[int]`` ett ``GenericAlias``-objekt som skapas genom att subskribera klassen ``list`` med argumentet :class:`int`. ``GenericAlias``-objekt är främst avsedda att användas med :term:`type annotations <annotation>`.

source: It is generally only possible to subscript a class if the class implements the special method :meth:`~object.__class_getitem__`.
pt_pt: É geralmente possível subscrever uma classe apenas se a classe implementar o método especial :meth:`~object.__class_getitem__`.
sv: Det är i allmänhet bara möjligt att subskribera en klass om klassen implementerar den speciella metoden :meth:`~object.__class_getitem__`.

source: A ``GenericAlias`` object acts as a proxy for a :term:`generic type`, implementing *parameterized generics*.
pt_pt: Um objeto ``GenericAlias`` atua como um proxy para um :term:`tipo genérico`, implementando *genéricos parametrizados*.
sv: Ett ``GenericAlias``-objekt fungerar som en proxy för en :term:`generisk typ` och implementerar *parameteriserade generiska typer*.

source: For a container class, the argument(s) supplied to a :ref:`subscription <subscriptions>` of the class may indicate the type(s) of the elements an object contains. For example, ``set[bytes]`` can be used in type annotations to signify a :class:`set` in which all the elements are of type :class:`bytes`.
pt_pt: Para uma classe de contentor, o(s) argumento(s) fornecido(s) a um :ref:`subscrito <subscriptions>` da classe pode(m) indicar o(s) tipo(s) dos elementos que um objeto contém. Por exemplo, ``set[bytes]`` pode ser usado em anotações de tipo para significar um :class:`set` em que todos os elementos são do tipo :class:`bytes`.
sv: För en containerklass kan det eller de argument som anges i en :ref:`subscription <subscriptions>` av klassen ange typen eller typerna av de element som ett objekt innehåller. Till exempel kan ``set[bytes]`` användas i typannoteringar för att beteckna en :class:`set` där alla element är av typen :class:`bytes`.

source: For a class which defines :meth:`~object.__class_getitem__` but is not a container, the argument(s) supplied to a subscription of the class will often indicate the return type(s) of one or more methods defined on an object. For example, :mod:`regular expressions <re>` can be used on both the :class:`str` data type and the :class:`bytes` data type:
pt_pt: Para uma classe que define :meth:`~object.__class_getitem__` mas não é um contentor, o(s) argumento(s) fornecido(s) a um subscrito da classe indicará(ão) frequentemente o(s) tipo(s) de retorno de um ou mais métodos definidos num objeto. Por exemplo, :mod:`expressões regulares <re>` podem ser usadas tanto no tipo de dados :class:`str` como no tipo de dados :class:`bytes`:
sv: För en klass som definierar :meth:`~object.__class_getitem__` men som inte är en container, kommer argumentet/argumenten till en prenumeration av klassen ofta att ange returtypen/returtyperna för en eller flera metoder som definieras på ett objekt. Exempelvis kan :mod:``regular expressions <re>`` användas på både datatypen :class:`str` och datatypen :class:`bytes`:

source: If ``x = re.search('foo', 'foo')``, ``x`` will be a :ref:`re.Match <match-objects>` object where the return values of ``x.group(0)`` and ``x[0]`` will both be of type :class:`str`. We can represent this kind of object in type annotations with the ``GenericAlias`` ``re.Match[str]``.
pt_pt: Se ``x = re.search('foo', 'foo')``, ``x`` será um objeto :ref:`re.Match <match-objects>` onde os valores de retorno de ``x.group(0)`` e ``x[0]`` serão ambos do tipo :class:`str`. Podemos representar este tipo de objeto em anotações de tipo com o ``GenericAlias`` ``re.Match[str]``.
sv: Om ``x = re.search('foo', 'foo')``, kommer ``x`` att vara ett :ref:`re.Match <match-objects>`-objekt där returvärdena för ``x.group(0)`` och ``x[0]`` båda kommer att vara av typen :class:`str`. Vi kan representera den här typen av objekt i typannoteringar med ``GenericAlias`` ``re.Match[str]``.

source: If ``y = re.search(b'bar', b'bar')``, (note the ``b`` for :class:`bytes`), ``y`` will also be an instance of ``re.Match``, but the return values of ``y.group(0)`` and ``y[0]`` will both be of type :class:`bytes`. In type annotations, we would represent this variety of :ref:`re.Match <match-objects>` objects with ``re.Match[bytes]``.
pt_pt: Se ``y = re.search(b'bar', b'bar')``, (note o ``b`` para :class:`bytes`), ``y`` também será uma instância de ``re.Match``, mas os valores de retorno de ``y.group(0)`` e ``y[0]`` serão ambos do tipo :class:`bytes`. Em anotações de tipo, representaríamos esta variedade de objetos :ref:`re.Match <match-objects>` com ``re.Match[bytes]``.
sv: Om ``y = re.search(b'bar', b'bar')``, (notera ``b`` för :class:`bytes`), kommer ``y`` också att vara en instans av ``re.Match``, men returvärdena för ``y.group(0)`` och ``y[0]`` kommer båda att vara av typen :class:`bytes`. I typannoteringar skulle vi representera denna variation av :ref:`re.Match <match-objects>` objekt med ``re.Match[bytes]``.

source: ``GenericAlias`` objects are instances of the class :class:`types.GenericAlias`, which can also be used to create ``GenericAlias`` objects directly.
pt_pt: Os objetos ``GenericAlias`` são instâncias da classe :class:`types.GenericAlias`, que também pode ser usada para criar objetos ``GenericAlias`` diretamente.
sv: ``GenericAlias``-objekt är instanser av klassen :class:`types.GenericAlias`, som också kan användas för att skapa ``GenericAlias``-objekt direkt.

source: Creates a ``GenericAlias`` representing a type ``T`` parameterized by types *X*, *Y*, and more depending on the ``T`` used. For example, a function expecting a :class:`list` containing :class:`float` elements::
pt_pt: Cria um ``GenericAlias`` que representa um tipo ``T`` parametrizado pelos tipos *X*, *Y*, e mais, dependendo do ``T`` usado. Por exemplo, uma função que espera uma :class:`list` contendo elementos :class:`float`:
sv: Skapar en ``GenericAlias`` som representerar en typ ``T`` parametriserad av typerna *X*, *Y*, och mer beroende på vilken ``T`` som används. Till exempel en funktion som förväntar sig en :class:`list` som innehåller :class:`float`-element::

source: def average(values: list[float]) -> float: return sum(values) / len(values)
pt_pt: def média(valores: list[float]) -> float: return sum(valores) / len(valores)
sv: def average(värden: lista[float]) -> float: return sum(värden) / len(värden)

source: Another example for :term:`mapping` objects, using a :class:`dict`, which is a generic type expecting two type parameters representing the key type and the value type. In this example, the function expects a ``dict`` with keys of type :class:`str` and values of type :class:`int`::
pt_pt: Outro exemplo para objetos :term:`mapeamento`, usando um :class:`dict`, que é um tipo genérico que espera dois parâmetros de tipo representando o tipo de chave e o tipo de valor. Neste exemplo, a função espera um ``dict`` com chaves do tipo :class:`str` e valores do tipo :class:`int`:
sv: Ett annat exempel för :term:`mapping`-objekt, med :class:`dict`, som är en generisk typ som förväntar sig två typparametrar som representerar nyckeltypen och värdetypen. I detta exempel förväntar sig funktionen en ``dict`` med nycklar av typen :class:`str` och värden av typen :class:`int`::

source: The builtin functions :func:`isinstance` and :func:`issubclass` do not accept ``GenericAlias`` types for their second argument::
pt_pt: As funções incorporadas :func:`isinstance` e :func:`issubclass` não aceitam tipos ``GenericAlias`` para o seu segundo argumento:
sv: De inbyggda funktionerna :func:`isinstance` och :func:`issubclass` accepterar inte ``GenericAlias``-typer för sitt andra argument::

source: >>> isinstance([1, 2], list[str]) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: isinstance() argument 2 cannot be a parameterized generic
pt_pt: >>> isinstance([1, 2], list[str]) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: isinstance() argumento 2 não pode ser um genérico parametrizado
sv: &gt;&gt;&gt; isinstance([1, 2], lista[str]) Traceback (senaste anropet senast): Fil "<stdin>", rad 1, i <module> TypeError: isinstance() argument 2 kan inte vara en parameteriserad generisk

source: The Python runtime does not enforce :term:`type annotations <annotation>`. This extends to generic types and their type parameters. When creating a container object from a ``GenericAlias``, the elements in the container are not checked against their type. For example, the following code is discouraged, but will run without errors::
pt_pt: O ambiente de execução do Python não impõe :term:`anotações de tipo <annotation>`. Isto aplica-se a tipos genéricos e aos seus parâmetros de tipo. Ao criar um objeto contentor a partir de um ``GenericAlias``, os elementos no contentor não são verificados em relação ao seu tipo. Por exemplo, o seguinte código é desencorajado, mas será executado sem erros:
sv: Pythons runtime upprätthåller inte :term:`typannoteringar <annotation>`. Detta gäller även generiska typer och deras typparametrar. När du skapar ett containerobjekt från en ``GenericAlias`` kontrolleras inte elementen i containern mot deras typ. Till exempel, följande kod är inte rekommenderad, men kommer att köras utan fel::

source: >>> t = list[str] >>> t([1, 2, 3]) [1, 2, 3]
sv: >>> t = lista[str] >>> t([1, 2, 3]) [1, 2, 3]

source: Furthermore, parameterized generics erase type parameters during object creation::
pt_pt: Além disso, os genéricos parametrizados apagam os parâmetros de tipo durante a criação do objeto:
sv: Dessutom raderar parametriserade generika typparametrar när objektet skapas::

source: >>> t = list[str] >>> type(t) <class 'types.GenericAlias'> >>> l = t() >>> type(l) <class 'list'>
sv: >>> t = lista[str] >>> typ(t) <class 'typer.generiska alias'> >>> l = t() >>> typ(l) <klass 'lista'>

source: Calling :func:`repr` or :func:`str` on a generic shows the parameterized type::
pt_pt: Chamar :func:`repr` ou :func:`str` num genérico mostra o tipo parametrizado:
sv: Anrop av :func:`repr` eller :func:`str` på en generisk visar den parametriserade typen::

source: >>> repr(list[int]) 'list[int]' >>> str(list[int]) 'list[int]'
sv: >>> repr(list[int]) 'lista[int]' >>> str(lista[int]) "lista[int]

source: The :meth:`~object.__getitem__` method of generic containers will raise an exception to disallow mistakes like ``dict[str][str]``::
pt_pt: O método :meth:`~object.__getitem__` de contentores genéricos lançará uma exceção para evitar erros como ``dict[str][str]``:
sv: Metoden :meth:`~object.__getitem__` för generiska behållare kommer att ge upphov till ett undantag för att förhindra misstag som ``dict[str][str]``::

source: >>> dict[str][str] Traceback (most recent call last): ... TypeError: dict[str] is not a generic class
pt_pt: >>> dict[str][str] Traceback (most recent call last): ... TypeError: dict[str] não é uma classe genérica
sv: >>> dict[str][str] Traceback (senaste anropet senast): ... TypeError: dict[str] är inte en generisk klass

source: However, such expressions are valid when :ref:`type variables <generics>` are used. The index must have as many elements as there are type variable items in the ``GenericAlias`` object's :attr:`~genericalias.__args__`. ::
pt_pt: No entanto, tais expressões são válidas quando são usadas :ref:`variáveis de tipo <generics>`. O índice deve ter tantos elementos quantos os itens de variável de tipo no atributo :attr:`~genericalias.__args__` do objeto ``GenericAlias``:
sv: Sådana uttryck är dock giltiga när :ref:``typvariabler <generics>`` används. Indexet måste ha lika många element som det finns typvariabler i ``GenericAlias``-objektets :attr:`~genericalias.__args__`. ::

source: >>> from typing import TypeVar >>> Y = TypeVar('Y') >>> dict[str, Y][int] dict[str, int]
sv: >>> från typing import TypeVar >>> Y = TypeVar('Y') >>> dict[str, Y][int] dict[str, int]

source: Standard Generic Classes
pt_pt: Classes Genéricas Padrão
sv: Generiska standardklasser

source: The following standard library classes support parameterized generics. This list is non-exhaustive.
pt_pt: As seguintes classes da biblioteca padrão suportam genéricos parametrizados. Esta lista não é exaustiva.
sv: Följande klasser i standardbiblioteket stöder parametriserade generiker. Denna lista är inte uttömmande.

source: :class:`tuple`
sv: :klass:`tuple`

source: :class:`list`
sv: :klass:`lista`

source: :class:`dict`
sv: :klass:`dict`

source: :class:`set`
sv: :klass:`set`

source: :class:`frozenset`
sv: :klass:`frozenset`

source: :class:`type`
sv: :klass:`typ`

source: :class:`asyncio.Future`
sv: :klass:`asyncio.Future`

source: :class:`asyncio.Task`
sv: :klass:`asyncio.Task`

source: :class:`collections.deque`
sv: :klass:`samlingar.deque`

source: :class:`collections.defaultdict`
sv: :klass:`samlingar.defaultdict`

source: :class:`collections.OrderedDict`
sv: :klass:`samlingar.OrderedDict`

source: :class:`collections.Counter`
sv: :klass:`samlingar.Räknare`

source: :class:`collections.ChainMap`
sv: :klass:`samlingar.ChainMap`

source: :class:`collections.abc.Awaitable`
sv: :klass:`samlingar.abc.Awaitable`

source: :class:`collections.abc.Coroutine`
sv: :klass:`samlingar.abc.Coroutine`

source: :class:`collections.abc.AsyncIterable`
sv: :class:`samlingar.abc.AsyncIterable`

source: :class:`collections.abc.AsyncIterator`
sv: :klass:`samlingar.abc.AsyncIterator`

source: :class:`collections.abc.AsyncGenerator`
sv: :klass:``kollektioner.abc.AsyncGenerator``

source: :class:`collections.abc.Iterable`
sv: :klass:`samlingar.abc.Iterable`

source: :class:`collections.abc.Iterator`
sv: :klass:`samlingar.abc.Iterator`

source: :class:`collections.abc.Generator`
sv: :klass:`samlingar.abc.Generator`

source: :class:`collections.abc.Reversible`
sv: :klass:``samlingar.abc.Reversibel``

source: :class:`collections.abc.Container`
sv: :klass:``samlingar.abc.container``

source: :class:`collections.abc.Collection`
sv: :klass:`collections.abc.Collection`

source: :class:`collections.abc.Callable`
sv: :klass:`samlingar.abc.Callable`

source: :class:`collections.abc.Set`
sv: :klass:``samlingar.abc.Set``

source: :class:`collections.abc.MutableSet`
sv: :klass:``samlingar.abc.MutableSet``

source: :class:`collections.abc.Mapping`
sv: :klass:``samlingar.abc.Mapping``

source: :class:`collections.abc.MutableMapping`
sv: :klass:`samlingar.abc.MutableMapping`

source: :class:`collections.abc.Sequence`
sv: :klass:``samlingar.abc.sekvens``

source: :class:`collections.abc.MutableSequence`
sv: :class:`samlingar.abc.MutableSequence`

source: :class:`collections.abc.MappingView`
sv: :class:`samlingar.abc.MappingView`

source: :class:`collections.abc.KeysView`
sv: :klass:`samlingar.abc.KeysView`

source: :class:`collections.abc.ItemsView`
sv: :klass:`collections.abc.ItemsView`

source: :class:`collections.abc.ValuesView`
sv: :class:`kollektioner.abc.ValuesView`

source: :class:`contextlib.AbstractContextManager`
sv: :klass:`contextlib.AbstractContextManager`

source: :class:`contextlib.AbstractAsyncContextManager`
sv: :klass:`contextlib.AbstractAsyncContextManager`

source: :class:`dataclasses.Field`
sv: :klass:`dataklasser.fält`

source: :class:`functools.cached_property`
sv: :klass:`functools.cached_property`

source: :class:`functools.partialmethod`
sv: :klass:`functools.partialmethod`

source: :class:`os.PathLike`
sv: :klass:`os.PathLike`

source: :class:`queue.LifoQueue`
sv: :klass:`queue.LifoQueue`

source: :class:`queue.Queue`
sv: :klass:`queue.Queue`

source: :class:`queue.PriorityQueue`
sv: :klass:`queue.PriorityQueue`

source: :class:`queue.SimpleQueue`
sv: :klass:`queue.SimpleQueue`

source: :ref:`re.Pattern <re-objects>`
sv: :ref:`re.mönster <re-objects>`

source: :class:`shelve.BsdDbShelf`
sv: :klass:`shelve.BsdDbShelf`

source: :class:`shelve.DbfilenameShelf`
sv: :klass:`shelve.DbfilenameShelf`

source: :class:`shelve.Shelf`
sv: :klass:`shelve.Shelf`

source: :class:`types.MappingProxyType`
sv: :klass:`types.MappingProxyType`

source: :class:`weakref.WeakKeyDictionary`
sv: :klass:`weakref.WeakKeyDictionary`

source: :class:`weakref.WeakMethod`
sv: :klass:`weakref.WeakMethod`

source: :class:`weakref.WeakSet`
sv: :klass:`weakref.WeakSet`

source: :class:`weakref.WeakValueDictionary`
sv: :klass:`weakref.WeakValueDictionary`

source: Special Attributes of ``GenericAlias`` objects
pt_pt: Atributos Especiais de objetos ``GenericAlias``
sv: Särskilda egenskaper för objekt av typen ``GenericAlias

source: All parameterized generics implement special read-only attributes.
pt_pt: Todos os genéricos parametrizados implementam atributos especiais apenas de leitura.
sv: Alla parametriserade generics implementerar speciella skrivskyddade attribut.

source: This attribute points at the non-parameterized generic class::
pt_pt: Este atributo aponta para a classe genérica não parametrizada:
sv: Detta attribut pekar på den icke-parameteriserade generiska klassen::

source: >>> list[int].__origin__ <class 'list'>
sv: >>> list[int].__origin__ <klass 'lista'>

source: This attribute is a :class:`tuple` (possibly of length 1) of generic types passed to the original :meth:`~object.__class_getitem__` of the generic class::
pt_pt: Este atributo é um :class:`tuple` (possivelmente de comprimento 1) de tipos genéricos passados ao :meth:`~object.__class_getitem__` original da classe genérica:
sv: Detta attribut är en :class:`tuple` (eventuellt av längd 1) av generiska typer som skickas till den ursprungliga :meth:`~object.__class_getitem__` av den generiska klassen::

source: >>> dict[str, list[int]].__args__ (<class 'str'>, list[int])
sv: >>> dict[str, list[int]].__args__ (<klass 'str'>, lista[int])

source: This attribute is a lazily computed tuple (possibly empty) of unique type variables found in ``__args__``::
pt_pt: Este atributo é um tuplo calculado de forma preguiçosa (possivelmente vazio) de variáveis de tipo únicas encontradas em ``__args__``:
sv: Detta attribut är en latent beräknad tupel (eventuellt tom) av unika typvariabler som finns i ``__args__``::

source: >>> from typing import TypeVar >>> T = TypeVar('T') >>> list[T].__parameters__ (~T,)
sv: >>> från typing import TypeVar >>> T = TypeVar('T') >>> lista[T].__parametrar__ (~T,)

source: A ``GenericAlias`` object with :class:`typing.ParamSpec` parameters may not have correct ``__parameters__`` after substitution because :class:`typing.ParamSpec` is intended primarily for static type checking.
pt_pt: Um objeto ``GenericAlias`` com parâmetros :class:`typing.ParamSpec` pode não ter ``__parameters__`` corretos após a substituição porque :class:`typing.ParamSpec` é destinado principalmente para verificação de tipo estática.
sv: Ett ``GenericAlias``-objekt med :class:`typing.ParamSpec`-parametrar kanske inte har korrekta ``__parameters__`` efter substitution eftersom :class:`typing.ParamSpec` främst är avsedd för statisk typkontroll.

source: A boolean that is true if the alias has been unpacked using the ``*`` operator (see :data:`~typing.TypeVarTuple`).
pt_pt: Um booleano que é verdadeiro se o alias tiver sido desempacotado usando o operador ``*`` (consulte :data:`~typing.TypeVarTuple`).
sv: En boolean som är sann om aliaset har packats upp med operatorn ``*`` (se :data:`~typing.TypeVarTuple`).

source: :pep:`484` - Type Hints
pt_pt: :pep:`484` - Dicas de Tipo
sv: :pep:`484` - Tips om typ

source: Introducing Python's framework for type annotations.
pt_pt: Introdução ao framework do Python para anotações de tipo.
sv: Introduktion till Pythons ramverk för typannoteringar.

source: :pep:`585` - Type Hinting Generics In Standard Collections
pt_pt: :pep:`585` - Dicas de Tipo para Genéricos em Coleções Padrão
sv: :pep:`585` - Typhintning av generiska gener i standardsamlingar

source: Introducing the ability to natively parameterize standard-library classes, provided they implement the special class method :meth:`~object.__class_getitem__`.
pt_pt: Introdução da capacidade de parametrizar nativamente classes da biblioteca padrão, desde que implementem o método especial de classe :meth:`~object.__class_getitem__`.
sv: Introducerar möjligheten att naturligt parametrisera standardbiblioteksklasser, förutsatt att de implementerar den speciella klassmetoden :meth:`~object.__class_getitem__`.

source: :ref:`Generics`, :ref:`user-defined generics <user-defined-generics>` and :class:`typing.Generic`
pt_pt: :ref:`Generics`, :ref:`genéricos definidos pelo utilizador <user-defined-generics>` e :class:`typing.Generic`
sv: :ref:`Generics`, :ref:`användardefinierad generik <user-defined-generics>` och :class:`typing.Generic`

source: Documentation on how to implement generic classes that can be parameterized at runtime and understood by static type-checkers.
pt_pt: Documentação sobre como implementar classes genéricas que podem ser parametrizadas em tempo de execução e compreendidas por verificadores de tipo estáticos.
sv: Dokumentation om hur man implementerar generiska klasser som kan parametriseras vid körning och förstås av statiska typkontrollanter.

source: Union Type
pt_pt: Tipo União
sv: Typ av fackförening

source: A union object holds the value of the ``|`` (bitwise or) operation on multiple :ref:`type objects <bltin-type-objects>`. These types are intended primarily for :term:`type annotations <annotation>`. The union type expression enables cleaner type hinting syntax compared to subscripting :class:`typing.Union`.
sv: Ett union-objekt innehåller värdet av ``|``-operationen (bitvis eller) på flera :ref:`type-objekt <bltin-type-objects>`. Dessa typer är främst avsedda för :term:`type annotations <annotation>`. Uttrycket unionstyp möjliggör en renare syntax för typhinting jämfört med subskription av :class:`typing.Union`.

source: Defines a union object which holds types *X*, *Y*, and so forth. ``X | Y`` means either X or Y. It is equivalent to ``typing.Union[X, Y]``. For example, the following function expects an argument of type :class:`int` or :class:`float`::
pt_pt: Define um objeto união que contém os tipos *X*, *Y*, e assim por diante. ``X | Y`` significa X ou Y. É equivalente a ``typing.Union[X, Y]``. Por exemplo, a seguinte função espera um argumento do tipo :class:`int` ou :class:`float`:
sv: Definierar ett union-objekt som innehåller typerna *X*, *Y*, och så vidare. ``X | Y`` betyder antingen X eller Y. Det är ekvivalent med ``typing.Union[X, Y]``. Till exempel förväntar sig följande funktion ett argument av typen :class:`int` eller :class:`float`::
