Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: The name of the class, function, method, descriptor, or generator instance.
pt_pt: O nome da classe, função, método, descritor ou instância de gerador.
sv: Namnet på klassen, funktionen, metoden, deskriptorn eller generatorinstansen.

source: The :term:`qualified name` of the class, function, method, descriptor, or generator instance.
pt_pt: O :term:`nome qualificado` da classe, função, método, descritor ou instância de gerador.
sv: Klassens, funktionens, metodens, deskriptorns eller generatorinstansens :term:`kvalificerade namn`.

source: The name of the module in which a class or function was defined.
pt_pt: O nome do módulo no qual uma classe ou função foi definida.
sv: Namnet på den modul i vilken en klass eller funktion definierades.

source: The documentation string of a class or function, or ``None`` if undefined.
pt_pt: A *string* de documentação de uma classe ou função, ou ``None`` se não estiver definida.
sv: Dokumentationssträngen för en klass eller funktion, eller ``None`` om den är odefinierad.

source: The :ref:`type parameters <type-params>` of generic classes, functions, and :ref:`type aliases <type-aliases>`. For classes and functions that are not generic, this will be an empty tuple.
pt_pt: Os :ref:`parâmetros de tipo <type-params>` de classes genéricas, funções e :ref:`alias de tipo <type-aliases>`. Para classes e funções que não são genéricas, isto será um tuplo vazio.
sv: :ref:`typ-parametrarna <type-params>` för generiska klasser, funktioner och :ref:`typ-alias <type-aliases>`. För klasser och funktioner som inte är generiska kommer detta att vara en tom tupel.

source: Integer string conversion length limitation
pt_pt: Limitação de comprimento de conversão de *string* para inteiro
sv: Längdbegränsning för konvertering av heltalssträngar

source: CPython has a global limit for converting between :class:`int` and :class:`str` to mitigate denial of service attacks. This limit *only* applies to decimal or other non-power-of-two number bases. Hexadecimal, octal, and binary conversions are unlimited. The limit can be configured.
pt_pt: O CPython tem um limite global para conversão entre :class:`int` e :class:`str` para mitigar ataques de negação de serviço. Este limite aplica-se *apenas* a bases numéricas decimais ou outras que não sejam potências de dois. As conversões hexadecimal, octal e binária são ilimitadas. O limite pode ser configurado.
sv: CPython har en global gräns för konvertering mellan :class:`int` och :class:`str` för att motverka överbelastningsattacker. Denna gräns gäller *endast* för decimaltal eller andra talbaser som inte har två potenser. Hexadecimala, oktala och binära konverteringar är obegränsade. Gränsen kan konfigureras.

source: The :class:`int` type in CPython is an arbitrary length number stored in binary form (commonly known as a "bignum"). There exists no algorithm that can convert a string to a binary integer or a binary integer to a string in linear time, *unless* the base is a power of 2. Even the best known algorithms for base 10 have sub-quadratic complexity. Converting a large value such as ``int('1' * 500_000)`` can take over a second on a fast CPU.
pt_pt: O tipo :class:`int` no CPython é um número de comprimento arbitrário armazenado em forma binária (comumente conhecido como "bignum"). Não existe nenhum algoritmo que possa converter uma *string* para um inteiro binário ou um inteiro binário para uma *string* em tempo linear, *a menos que* a base seja uma potência de 2. Mesmo os melhores algoritmos conhecidos para a base 10 têm complexidade sub-quadrática. Converter um valor grande como ``int('1' * 500_000)`` pode demorar mais de um segundo num CPU rápido.
sv: Typen :class:`int` i CPython är ett tal av godtycklig längd som lagras i binär form (allmänt känt som ett "bignum"). Det finns ingen algoritm som kan konvertera en sträng till ett binärt heltal eller ett binärt heltal till en sträng i linjär tid, *om inte* basen är en potens av 2. Även de mest kända algoritmerna för bas 10 har subkvadratisk komplexitet. Att konvertera ett stort värde som ``int('1' * 500_000)`` kan ta över en sekund på en snabb CPU.

source: Limiting conversion size offers a practical way to avoid :cve:`2020-10735`.
pt_pt: Limitar o tamanho da conversão oferece uma forma prática de evitar :cve:`2020-10735`.
sv: Att begränsa konverteringsstorleken är ett praktiskt sätt att undvika :cve:`2020-10735`.

source: The limit is applied to the number of digit characters in the input or output string when a non-linear conversion algorithm would be involved. Underscores and the sign are not counted towards the limit.
pt_pt: O limite é aplicado ao número de caracteres de dígitos na *string* de entrada ou saída quando um algoritmo de conversão não linear estiver envolvido. Os underscores e o sinal não são contados para o limite.
sv: Gränsen tillämpas på antalet siffertecken i in- eller utdatasträngen när en icke-linjär konverteringsalgoritm skulle vara inblandad. Underscorer och tecknet räknas inte med i begränsningen.

source: When an operation would exceed the limit, a :exc:`ValueError` is raised:
pt_pt: Quando uma operação exceder o limite, é lançada uma exceção :exc:`ValueError`:
sv: När en operation skulle överskrida gränsen genereras ett :exc:`ValueError`:

source: >>> import sys >>> sys.set_int_max_str_digits(4300) # Illustrative, this is the default. >>> _ = int('2' * 5432) Traceback (most recent call last): ... ValueError: Exceeds the limit (4300 digits) for integer string conversion: value has 5432 digits; use sys.set_int_max_str_digits() to increase the limit >>> i = int('2' * 4300) >>> len(str(i)) 4300 >>> i_squared = i*i >>> len(str(i_squared)) Traceback (most recent call last): ... ValueError: Exceeds the limit (4300 digits) for integer string conversion; use sys.set_int_max_str_digits() to increase the limit >>> len(hex(i_squared)) 7144 >>> assert int(hex(i_squared), base=16) == i*i # Hexadecimal is unlimited.
pt_pt: >>> import sys >>> sys.set_int_max_str_digits(4300) # Ilustrativo, este é o valor predefinido. >>> _ = int('2' * 5432) Traceback (most recent call last): ... ValueError: Excede o limite (4300 dígitos) para conversão de *string* para inteiro: o valor tem 5432 dígitos; use sys.set_int_max_str_digits() para aumentar o limite >>> i = int('2' * 4300) >>> len(str(i)) 4300 >>> i_squared = i*i >>> len(str(i_squared)) Traceback (most recent call last): ... ValueError: Excede o limite (4300 dígitos) para conversão de *string* para inteiro; use sys.set_int_max_str_digits() para aumentar o limite >>> len(hex(i_squared)) 7144 >>> assert int(hex(i_squared), base=16) == i*i # Hexadecimal é ilimitado.
sv: >>> import sys >>> sys.set_int_max_str_digits(4300) # Illustrativt, detta är standard. >>> _ = int('2' * 5432) Traceback (senaste anropet senast): ... ValueError (värdefel): Överskrider gränsen (4300 siffror) för omvandling av heltalssträngar: värdet har 5432 siffror; använd sys.set_int_max_str_digits() för att öka gränsen >>> i = int('2' * 4300) >>> len(str(i)) 4300 >>> i_squared = i*i >>> len(str(i_squared)) Traceback (senaste anropet senast): ... ValueError (värdefel): Överskrider gränsen (4300 siffror) för omvandling av heltalssträngar; använd sys.set_int_max_str_digits() för att öka gränsen >>> len(hex(i_squared)) 7144 >>> assert int(hex(i_squared), base=16) == i*i # Hexadecimal är obegränsad.

source: The default limit is 4300 digits as provided in :data:`sys.int_info.default_max_str_digits <sys.int_info>`. The lowest limit that can be configured is 640 digits as provided in :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.
pt_pt: O limite predefinido é de 4300 dígitos, conforme fornecido em :data:`sys.int_info.default_max_str_digits <sys.int_info>`. O limite mais baixo que pode ser configurado é de 640 dígitos, conforme fornecido em :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.
sv: Standardgränsen är 4300 siffror enligt :data:`sys.int_info.default_max_str_digits <sys.int_info>`. Den lägsta gräns som kan konfigureras är 640 siffror enligt :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.

source: Verification:
pt_pt: Verificação:
sv: Verifiering:

source: >>> import sys >>> assert sys.int_info.default_max_str_digits == 4300, sys.int_info >>> assert sys.int_info.str_digits_check_threshold == 640, sys.int_info >>> msg = int('578966293710682886880994035146873798396722250538762761564' ... '9252925514383915483333812743580549779436104706260696366600' ... '571186405732').to_bytes(53, 'big') ...
sv: >>> importera sys >>> assert sys.int_info.default_max_str_digits == 4300, sys.int_info >>> assert sys.int_info.str_digits_check_threshold == 640, sys.int_info >>> msg = int('578966293710682886880994035146873798396722250538762761564' ... '9252925514383915483333812743580549779436104706260696366600' ... '571186405732').to_bytes(53, 'big') ...

source: Affected APIs
pt_pt: APIs Afetadas
sv: Berörda API:er

source: The limitation only applies to potentially slow conversions between :class:`int` and :class:`str` or :class:`bytes`:
pt_pt: A limitação aplica-se apenas a conversões potencialmente lentas entre :class:`int` e :class:`str` ou :class:`bytes`:
sv: Begränsningen gäller endast potentiellt långsamma konverteringar mellan :class:`int` och :class:`str` eller :class:`bytes`:

source: ``int(string)`` with default base 10.
pt_pt: ``int(string)`` com base predefinida 10.
sv: ``int(sträng)`` med standardbas 10.

source: ``int(string, base)`` for all bases that are not a power of 2.
pt_pt: ``int(string, base)`` para todas as bases que não são potências de 2.
sv: ``int(string, base)`` för alla baser som inte är en potens av 2.

source: ``str(integer)``.
sv: ``str(heltal)``.

source: ``repr(integer)``.
sv: ``repr(heltal)``.

source: any other string conversion to base 10, for example ``f"{integer}"``, ``"{}".format(integer)``, or ``b"%d" % integer``.
pt_pt: qualquer outra conversão de *string* para base 10, por exemplo ``f"{integer}"``, ``"{}".format(integer)``, ou ``b"%d" % integer``.
sv: någon annan strängkonvertering till bas 10, till exempel ``f"{integer}"``, ``"{}".format(integer)``, eller ``b"%d" % integer``.

source: The limitations do not apply to functions with a linear algorithm:
pt_pt: As limitações não se aplicam a funções com um algoritmo linear:
sv: Begränsningarna gäller inte för funktioner med en linjär algoritm:

source: ``int(string, base)`` with base 2, 4, 8, 16, or 32.
pt_pt: ``int(string, base)`` com base 2, 4, 8, 16 ou 32.
sv: ``int(sträng, bas)`` med bas 2, 4, 8, 16 eller 32.

source: :func:`int.from_bytes` and :func:`int.to_bytes`.
pt_pt: :func:`int.from_bytes` e :func:`int.to_bytes`.
sv: :func:`int.from_bytes` och :func:`int.to_bytes`.

source: :ref:`formatspec` for hex, octal, and binary numbers.
pt_pt: :ref:`formatspec` para números hexadecimais, octais e binários.
sv: :ref:`formatspec` för hex-, oktal- och binära tal.

source: :class:`str` to :class:`float`.
pt_pt: :class:`str` para :class:`float`.
sv: :class:`str` till :class:`float`.

source: :class:`str` to :class:`decimal.Decimal`.
pt_pt: :class:`str` para :class:`decimal.Decimal`.
sv: :class:`str` till :class:`decimal.Decimal`.

source: Configuring the limit
pt_pt: Configurar o limite
sv: Konfigurera gränsvärdet

source: Before Python starts up you can use an environment variable or an interpreter command line flag to configure the limit:
pt_pt: Antes do Python iniciar, pode usar uma variável de ambiente ou uma flag de linha de comandos do interpretador para configurar o limite:
sv: Innan Python startar kan du använda en miljövariabel eller en kommandoradsflagga för tolken för att konfigurera gränsen:

source: :envvar:`PYTHONINTMAXSTRDIGITS`, e.g. ``PYTHONINTMAXSTRDIGITS=640 python3`` to set the limit to 640 or ``PYTHONINTMAXSTRDIGITS=0 python3`` to disable the limitation.
pt_pt: :envvar:`PYTHONINTMAXSTRDIGITS`, por exemplo, ``PYTHONINTMAXSTRDIGITS=640 python3`` para definir o limite para 640 ou ``PYTHONINTMAXSTRDIGITS=0 python3`` para desativar a limitação.
sv: :envvar:`PYTHONINTMAXSTRDIGITS`, t.ex. ``PYTHONINTMAXSTRDIGITS=640 python3`` för att sätta gränsen till 640 eller ``PYTHONINTMAXSTRDIGITS=0 python3`` för att inaktivera begränsningen.

source: :option:`-X int_max_str_digits <-X>`, e.g. ``python3 -X int_max_str_digits=640``
pt_pt: :option:`-X int_max_str_digits <-X>`, por exemplo, ``python3 -X int_max_str_digits=640``
sv: :option:`-X int_max_str_digits <-X>`, t.ex. ``python3 -X int_max_str_digits=640```

source: :data:`sys.flags.int_max_str_digits` contains the value of :envvar:`PYTHONINTMAXSTRDIGITS` or :option:`-X int_max_str_digits <-X>`. If both the env var and the ``-X`` option are set, the ``-X`` option takes precedence. A value of *-1* indicates that both were unset, thus a value of :data:`sys.int_info.default_max_str_digits` was used during initialization.
pt_pt: :data:`sys.flags.int_max_str_digits` contém o valor de :envvar:`PYTHONINTMAXSTRDIGITS` ou :option:`-X int_max_str_digits <-X>`. Se tanto a variável de ambiente como a opção ``-X`` estiverem definidas, a opção ``-X`` tem precedência. Um valor de *-1* indica que ambas não foram definidas, portanto, um valor de :data:`sys.int_info.default_max_str_digits` foi usado durante a inicialização.
sv: :data:`sys.flags.int_max_str_digits` innehåller värdet av :envvar:`PYTHONINTMAXSTRDIGITS` eller :option:`-X int_max_str_digits <-X>`. Om både env var och alternativet ``-X`` är inställda, har alternativet ``-X`` företräde. Ett värde på *-1* indikerar att båda var oinställda, vilket innebär att ett värde på :data:`sys.int_info.default_max_str_digits` användes under initialiseringen.

source: From code, you can inspect the current limit and set a new one using these :mod:`sys` APIs:
pt_pt: No código, pode inspecionar o limite atual e definir um novo usando estas APIs do :mod:`sys`:
sv: Från kod kan du inspektera den aktuella gränsen och sätta en ny med hjälp av dessa :mod:`sys` API:er:

source: :func:`sys.get_int_max_str_digits` and :func:`sys.set_int_max_str_digits` are a getter and setter for the interpreter-wide limit. Subinterpreters have their own limit.
pt_pt: :func:`sys.get_int_max_str_digits` e :func:`sys.set_int_max_str_digits` são um *getter* e um *setter* para o limite em todo o interpretador. Os subinterpretadores têm o seu próprio limite.
sv: :func:`sys.get_int_max_str_digits` och :func:`sys.set_int_max_str_digits` är en getter och setter för den tolkningsomfattande gränsen. Undertolkare har sin egen gräns.

source: Information about the default and minimum can be found in :data:`sys.int_info`:
pt_pt: Informações sobre o predefinido e o mínimo podem ser encontradas em :data:`sys.int_info`:
sv: Information om standard- och minimivärden finns i :data:`sys.int_info`:

source: :data:`sys.int_info.default_max_str_digits <sys.int_info>` is the compiled-in default limit.
pt_pt: :data:`sys.int_info.default_max_str_digits <sys.int_info>` é o limite predefinido compilado.
sv: :data:`sys.int_info.default_max_str_digits <sys.int_info>` är den kompilerade standardgränsen.

source: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` is the lowest accepted value for the limit (other than 0 which disables it).
pt_pt: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` é o valor mínimo aceite para o limite (exceto 0, que o desativa).
sv: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` är det lägsta accepterade värdet för gränsen (annat än 0 som inaktiverar den).

source: Setting a low limit *can* lead to problems. While rare, code exists that contains integer constants in decimal in their source that exceed the minimum threshold. A consequence of setting the limit is that Python source code containing decimal integer literals longer than the limit will encounter an error during parsing, usually at startup time or import time or even at installation time - anytime an up to date ``.pyc`` does not already exist for the code. A workaround for source that contains such large constants is to convert them to ``0x`` hexadecimal form as it has no limit.
pt_pt: Definir um limite baixo *pode* levar a problemas. Embora raro, existe código que contém constantes inteiras em decimal na sua origem que excedem o limite mínimo. Uma consequência de definir o limite é que o código-fonte Python contendo literais inteiros decimais mais longos do que o limite encontrará um erro durante a análise, geralmente na inicialização, no momento da importação ou até mesmo no momento da instalação - sempre que um ``.pyc`` atualizado não existir para o código. Uma solução alternativa para código-fonte que contém tais constantes grandes é convertê-las para a forma hexadecimal ``0x``, pois não tem limite.
sv: Att sätta en låg gräns *kan* leda till problem. Även om det är sällsynt finns det kod som innehåller heltalskonstanter i decimal i sin källa som överskrider minimigränsen. En konsekvens av att sätta gränsen är att Python-källkod som innehåller decimala heltalslitteraler som är längre än gränsen kommer att stöta på ett fel under parsning, vanligtvis vid starttid eller importtid eller till och med vid installationstid - när som helst en uppdaterad ``.pyc`` inte redan finns för koden. En lösning för källkod som innehåller så stora konstanter är att konvertera dem till hexadecimal form ``0x`` eftersom den inte har någon gräns.

source: Test your application thoroughly if you use a low limit. Ensure your tests run with the limit set early via the environment or flag so that it applies during startup and even during any installation step that may invoke Python to precompile ``.py`` sources to ``.pyc`` files.
pt_pt: Teste a sua aplicação minuciosamente se usar um limite baixo. Certifique-se de que os seus testes são executados com o limite definido cedo através da variável de ambiente ou flag, de modo a que se aplique durante a inicialização e até mesmo durante qualquer passo de instalação que possa invocar o Python para pré-compilar ficheiros ``.py`` para ficheiros ``.pyc``.
sv: Testa din applikation noggrant om du använder en låg gräns. Se till att dina tester körs med gränsen inställd tidigt via miljön eller flaggan så att den gäller under uppstart och även under alla installationssteg som kan anropa Python för att förkompilera ``.py``-källor till ``.pyc``-filer.

source: Recommended configuration
pt_pt: Configuração recomendada
sv: Rekommenderad konfiguration

source: The default :data:`sys.int_info.default_max_str_digits` is expected to be reasonable for most applications. If your application requires a different limit, set it from your main entry point using Python version agnostic code as these APIs were added in security patch releases in versions before 3.12.
pt_pt: O valor predefinido :data:`sys.int_info.default_max_str_digits` é esperado ser razoável para a maioria das aplicações. Se a sua aplicação necessitar de um limite diferente, defina-o a partir do seu ponto de entrada principal usando código agnóstico à versão do Python, uma vez que estas APIs foram adicionadas em lançamentos de patches de segurança em versões anteriores à 3.12.
sv: Standardvärdet :data:`sys.int_info.default_max_str_digits` förväntas vara rimligt för de flesta applikationer. Om ditt program kräver en annan gräns, ställ in den från din huvudingångspunkt med Python-version agnostisk kod eftersom dessa API:er lades till i säkerhetsuppdateringar i versioner före 3.12.

source: Example::
pt_pt: Exemplo::
sv: Exempel::

source: >>> import sys >>> if hasattr(sys, "set_int_max_str_digits"): ... upper_bound = 68000 ... lower_bound = 4004 ... current_limit = sys.get_int_max_str_digits() ... if current_limit == 0 or current_limit > upper_bound: ... sys.set_int_max_str_digits(upper_bound) ... elif current_limit < lower_bound: ... sys.set_int_max_str_digits(lower_bound)
pt_pt: >>> import sys >>> if hasattr(sys, "set_int_max_str_digits"): ... limite_superior = 68000 ... limite_inferior = 4004 ... limite_atual = sys.get_int_max_str_digits() ... if limite_atual == 0 or limite_atual > limite_superior: ... sys.set_int_max_str_digits(limite_superior) ... elif limite_atual < limite_inferior: ... sys.set_int_max_str_digits(limite_inferior)
sv: >>> import sys >>> if hasattr(sys, "set_int_max_str_digits"): ... övre_gräns = 68000 ... lägre_gräns = 4004 ... current_limit = sys.get_int_max_str_digits() ... om current_limit == 0 eller current_limit > upper_bound: ... sys.set_int_max_str_digits(övre_gräns) ... elif current_limit < lower_bound: ... sys.set_int_max_str_digits(lower_bound)

source: If you need to disable it entirely, set it to ``0``.
pt_pt: Se precisar de desativá-lo completamente, defina-o para ``0``.
sv: Om du behöver inaktivera det helt, ställ in det på ``0``.

source: Footnotes
pt_pt: Notas de rodapé
sv: Fotnoter

source: Additional information on these special methods may be found in the Python Reference Manual (:ref:`customization`).
pt_pt: Informações adicionais sobre estes métodos especiais podem ser encontradas no Manual de Referência do Python (:ref:`customization`).
sv: Ytterligare information om dessa specialmetoder finns i Pythons referensmanual (:ref:`customization`).

source: As a consequence, the list ``[1, 2]`` is considered equal to ``[1.0, 2.0]``, and similarly for tuples.
pt_pt: Como consequência, a lista ``[1, 2]`` é considerada igual a ``[1.0, 2.0]``, e o mesmo aplica-se a tuplos.
sv: Som en följd av detta betraktas listan ``[1, 2]`` som lika med ``[1.0, 2.0]``, och på samma sätt för tupler.

source: They must have since the parser can't tell the type of the operands.
pt_pt: Devem tê-los, uma vez que o analisador não consegue determinar o tipo dos operandos.
sv: Det måste de ha gjort eftersom parsern inte kan avgöra typen av operander.

source: Cased characters are those with general category property being one of "Lu" (Letter, uppercase), "Ll" (Letter, lowercase), or "Lt" (Letter, titlecase).
pt_pt: Caracteres com caixa são aqueles cuja propriedade de categoria geral é uma de "Lu" (Letra, maiúscula), "Ll" (Letra, minúscula) ou "Lt" (Letra, título).
sv: Bokstäver med versaler är tecken som har en allmän kategoriegenskap som är en av "Lu" (bokstav, versal), "Ll" (bokstav, gemen) eller "Lt" (bokstav, titelbokstav).

source: To format only a tuple you should therefore provide a singleton tuple whose only element is the tuple to be formatted.
pt_pt: Para formatar apenas um tuplo, deve, portanto, fornecer um tuplo singleton cujo único elemento seja o tuplo a ser formatado.
sv: För att formatera endast en tupel bör du därför tillhandahålla en singleton-tupel vars enda element är den tupel som ska formateras.

source: built-in
pt_pt: incorporado
sv: inbyggd

source: types
sv: typer

source: statement
pt_pt: instrução
sv: uttalande

source: if
pt_pt: se
sv: om

source: while
pt_pt: enquanto
sv: medan

source: truth
pt_pt: verdade
sv: sanning

source: value
pt_pt: valor
sv: värde

source: operations
pt_pt: operações
sv: verksamhet

source: false
pt_pt: falso
sv: falskt

source: true
pt_pt: verdadeiro
sv: sant

source: None (Built-in object)
pt_pt: None (Objeto incorporado)
sv: Ingen (inbyggt objekt)

source: False (Built-in object)
pt_pt: False (Objeto incorporado)
sv: False (Inbyggt objekt)

source: operator
sv: operatör

source: or
pt_pt: ou
sv: eller

source: and
pt_pt: e
sv: och

source: False
pt_pt: Falso
sv: Falskt

source: True
pt_pt: Verdadeiro
sv: Sant

source: not
pt_pt: não
sv: inte

source: chaining
pt_pt: encadeamento
sv: kedja

source: comparisons
pt_pt: comparações
sv: jämförelser

source: comparison
pt_pt: comparação
sv: jämförelse

source: < (less)
pt_pt: < (menor)
sv: < (mindre)

source: > (greater)
pt_pt: > (maior)
sv: > (större)

source: is
pt_pt: é
sv: är

source: is not
pt_pt: não é
sv: är inte

source: object
pt_pt: objeto
sv: objekt

source: numeric
pt_pt: numérico
sv: numeriska
