Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: pt_pt, sv

source: Casefolding is similar to lowercasing but more aggressive because it is intended to remove all case distinctions in a string. For example, the German lowercase letter ``'ß'`` is equivalent to ``"ss"``. Since it is already lowercase, :meth:`lower` would do nothing to ``'ß'``; :meth:`casefold` converts it to ``"ss"``.
pt_pt: *Casefold* é semelhante a converter para minúsculas, mas mais agressivo, porque destina-se a remover todas as distinções de maiúsculas/minúsculas numa *string*. Por exemplo, a letra minúscula alemã ``'ß'`` é equivalente a ``"ss"``. Como já está em minúscula, :meth:`lower` não faria nada a ``'ß'``; :meth:`casefold` converte-a para ``"ss"``.
sv: Casefolding liknar lowercasing men är mer aggressivt eftersom det är avsett att ta bort alla skillnader i versaler i en sträng. Till exempel är den tyska gemena bokstaven ``'ß'`` likvärdig med ``"ss"``. Eftersom den redan är gemen skulle :meth:`lower` inte göra något med ``'ß'``; :meth:`casefold` konverterar den till ``"ss"``.

source: The casefolding algorithm is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.
sv: Algoritmen för casefolding beskrivs i avsnitt 3.13 "Default Case Folding" i Unicode-standarden <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.

source: Return centered in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``. For example::
pt_pt: Retorna centrado numa *string* de comprimento *width*. O preenchimento é feito usando o *fillchar* especificado (o valor predefinido é um espaço ASCII). A *string* original é retornada se *width* for menor ou igual a ``len(s)``. Por exemplo:
sv: Returnerar centrerad i en sträng av längden *bredd*. Utfyllnad görs med hjälp av det angivna *fillchar* (standard är ett ASCII-rymd). Den ursprungliga strängen returneras om *width* är mindre än eller lika med ``len(s)``. Till exempel::

source: >>> 'Python'.center(10) ' Python ' >>> 'Python'.center(10, '-') '--Python--' >>> 'Python'.center(4) 'Python'
sv: >>> 'Python'.center(10) ' Python ' >>> 'Python'.center(10, '-') '--Python--' >>> 'Python'.centrum(4) "Python

source: Return the number of non-overlapping occurrences of substring *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
pt_pt: Retorna o número de ocorrências não sobrepostas da substring *sub* no intervalo [*start*, *end*]. Os argumentos opcionais *start* e *end* são interpretados como na notação de fatia.
sv: Returnerar antalet icke-överlappande förekomster av substring *sub* i intervallet [*start*, *slut*]. De valfria argumenten *start* och *slut* tolkas som i slice-notation.

source: If *sub* is empty, returns the number of empty strings between characters which is the length of the string plus one. For example::
pt_pt: Se *sub* estiver vazia, retorna o número de *strings* vazias entre caracteres, que é o comprimento da *string* mais um. Por exemplo:
sv: Om *sub* är tom, returneras antalet tomma strängar mellan tecknen, vilket är strängens längd plus ett. Till exempel::

source: >>> 'spam, spam, spam'.count('spam') 3 >>> 'spam, spam, spam'.count('spam', 5) 2 >>> 'spam, spam, spam'.count('spam', 5, 10) 1 >>> 'spam, spam, spam'.count('eggs') 0 >>> 'spam, spam, spam'.count('') 17
sv: >>> 'spam, spam, spam'.count('spam') 3 >>> 'skräppost, skräppost, skräppost'.count('skräppost', 5) 2 >>> 'spam, spam, spam'.count('spam', 5, 10) 1 >>> 'spam, spam, spam'.count('ägg') 0 >>> 'spam, spam, spam'.count('') 17

source: Return the string encoded to :class:`bytes`.
pt_pt: Retorna a *string* codificada para :class:`bytes`.
sv: Returnerar strängen kodad till :class:`bytes`.

source: *encoding* defaults to ``'utf-8'``; see :ref:`standard-encodings` for possible values.
pt_pt: *encoding* é ``'utf-8'`` por predefinição; consulte :ref:`standard-encodings` para valores possíveis.
sv: *encoding* är som standard ``'utf-8'``; se :ref:`standard-encodings` för möjliga värden.

source: *errors* controls how encoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
pt_pt: *errors* controla como os erros de codificação são tratados. Se for ``'strict'`` (o valor predefinido), é lançada uma exceção :exc:`UnicodeError`. Outros valores possíveis são ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` e qualquer outro nome registado através de :func:`codecs.register_error`. Consulte :ref:`error-handlers` para mais detalhes.
sv: *errors* styr hur kodningsfel ska hanteras. Om ``'strict'`` (standard), kommer ett :exc:`UnicodeError` undantag att uppstå. Andra möjliga värden är ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` och alla andra namn som registreras via :func:`codecs.register_error`. Se :ref:`error-handlers` för detaljer.

source: For performance reasons, the value of *errors* is not checked for validity unless an encoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used. For example::
pt_pt: Por razões de desempenho, o valor de *errors* não é verificado quanto à validade a menos que ocorra um erro de codificação, :ref:`devmode` esteja ativado ou uma :ref:`compilação de depuração <debug-build>` seja usada. Por exemplo:
sv: Av prestandaskäl kontrolleras inte värdet på *errors* om inte ett kodningsfel faktiskt inträffar, :ref:`devmode` är aktiverat eller en :ref:`debug build <debug-build>` används. Till exempel::

source: >>> encoded_str_to_bytes = 'Python'.encode() >>> type(encoded_str_to_bytes) <class 'bytes'> >>> encoded_str_to_bytes b'Python'
sv: >>> kodad_str_to_bytes = 'Python'.encode() >>> typ(kodad_str_to_bytes) <klass 'bytes'> >>> kodad_str_till_bytes >>> kodad_str_till_bytes b'Python'

source: Added support for keyword arguments.
pt_pt: Adicionado suporte para argumentos de palavra-chave.
sv: Stöd för nyckelordsargument har lagts till.

source: The value of the *errors* argument is now checked in :ref:`devmode` and in :ref:`debug mode <debug-build>`.
pt_pt: O valor do argumento *errors* é agora verificado em :ref:`devmode` e em :ref:`modo de depuração <debug-build>`.
sv: Värdet på *errors*-argumentet kontrolleras nu i :ref:`devmode` och i :ref:`debug mode <debug-build>`.

source: Return ``True`` if the string ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position. Using *start* and *end* is equivalent to ``str[start:end].endswith(suffix)``. For example::
pt_pt: Retorna ``True`` se a *string* terminar com o *suffix* especificado, caso contrário retorna ``False``. *suffix* também pode ser um tuplo de sufixos a procurar. Com *start* opcional, teste a partir dessa posição. Com *end* opcional, pare de comparar nessa posição. Usar *start* e *end* é equivalente a ``str[start:end].endswith(suffix)``. Por exemplo:
sv: Returnerar ``True`` om strängen slutar med det angivna *suffixet*, annars returneras ``False``. *suffix* kan också vara en tupel av suffix att leta efter. Med valfri *start* börjar testet vid den positionen. Med valfri *end*, sluta jämföra vid den positionen. Att använda *start* och *end* är likvärdigt med ``str[start:end].endswith(suffix)``. Till exempel::

source: >>> 'Python'.endswith('on') True >>> 'a tuple of suffixes'.endswith(('at', 'in')) False >>> 'a tuple of suffixes'.endswith(('at', 'es')) True >>> 'Python is amazing'.endswith('is', 0, 9) True
sv: >>> 'Python'.endswith('on') Sant >>> 'en tupel av suffix'.endswith(('at', 'in')) Falsk >>> 'en tupel av suffix'.endswith(('at', 'es')) Sant >>> 'Python är fantastiskt'.endswith('is', 0, 9) Sant

source: See also :meth:`startswith` and :meth:`removesuffix`.
pt_pt: Consulte também :meth:`startswith` e :meth:`removesuffix`.
sv: Se även :meth:`startswith` och :meth:`removesuffix`.

source: Return a copy of the string where all tab characters are replaced by one or more spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* characters (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the string, the current column is set to zero and the string is examined character by character. If the character is a tab (``\t``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the character is a newline (``\n``) or return (``\r``), it is copied and the current column is reset to zero. Any other character is copied unchanged and the current column is incremented by one regardless of how the character is represented when printed. For example::
pt_pt: Retorna uma cópia da *string* onde todos os caracteres de tabulação são substituídos por um ou mais espaços, dependendo da coluna atual e do tamanho de tabulação dado. As posições de tabulação ocorrem a cada *tabsize* caracteres (o valor predefinido é 8, dando posições de tabulação nas colunas 0, 8, 16, etc.). Para expandir a *string*, a coluna atual é definida como zero e a *string* é examinada caractere a caractere. Se o caractere for uma tabulação (``\t``), um ou mais caracteres de espaço são inseridos no resultado até que a coluna atual seja igual à próxima posição de tabulação. (O próprio caractere de tabulação não é copiado.) Se o caractere for uma nova linha (``\n``) ou retorno (``\r``), é copiado e a coluna atual é redefinida para zero. Qualquer outro caractere é copiado inalterado e a coluna atual é incrementada em um, independentemente de como o caractere é representado quando impresso. Por exemplo:
sv: Returnerar en kopia av strängen där alla tabbtecken ersatts av ett eller flera mellanslag, beroende på aktuell kolumn och angiven tabbstorlek. Tabbpositioner uppstår varje *tabsize* tecken (standard är 8, vilket ger tabbpositioner i kolumnerna 0, 8, 16 och så vidare). För att expandera strängen sätts den aktuella kolumnen till noll och strängen granskas tecken för tecken. Om tecknet är en tabb (``t``) infogas ett eller flera mellanslagstecken i resultatet tills den aktuella kolumnen är lika med nästa tabbposition. (Tabbtecknet i sig kopieras inte.) Om tecknet är en ny rad (``\n``) eller en retur (``\r``) kopieras det och den aktuella kolumnen nollställs. Alla andra tecken kopieras oförändrade och den aktuella kolumnen ökas med ett oavsett hur tecknet representeras när det skrivs ut. Till exempel::

source: Return the lowest index in the string where substring *sub* is found within the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
sv: Returnerar det lägsta indexet i strängen där delsträngen *sub* finns inom skivan ``s[start:end]``. De valfria argumenten *start* och *end* tolkas som i slice-notation. Returnerar ``-1`` om *sub* inte hittas.

source: The :meth:`~str.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
pt_pt: O método :meth:`~str.find` deve ser usado apenas se precisar de saber a posição de *sub*. Para verificar se *sub* é uma substring ou não, use o operador :keyword:`in`:
sv: Metoden :meth:`~str.find` bör endast användas om du behöver veta positionen för *sub*. Om du vill kontrollera om *sub* är en delsträng eller inte använder du operatorn :keyword:`in`::

source: >>> 'Py' in 'Python' True
sv: >>> 'Py' i 'Python' Sant

source: Perform a string formatting operation. The string on which this method is called can contain literal text or replacement fields delimited by braces ``{}``. Each replacement field contains either the numeric index of a positional argument, or the name of a keyword argument. Returns a copy of the string where each replacement field is replaced with the string value of the corresponding argument.
sv: Utför en strängformateringsoperation. Strängen som den här metoden anropas på kan innehålla bokstavlig text eller ersättningsfält som avgränsas av hakparenteser ``{}``. Varje ersättningsfält innehåller antingen det numeriska indexet för ett positionsargument eller namnet på ett nyckelordsargument. Returnerar en kopia av strängen där varje ersättningsfält ersätts med strängvärdet för motsvarande argument.

source: See :ref:`formatstrings` for a description of the various formatting options that can be specified in format strings.
pt_pt: Consulte :ref:`formatstrings` para uma descrição das várias opções de formatação que podem ser especificadas em *strings* de formato.
sv: Se :ref:`formatsträngar` för en beskrivning av de olika formateringsalternativ som kan anges i formatsträngar.

source: When formatting a number (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` and subclasses) with the ``n`` type (ex: ``'{:n}'.format(1234)``), the function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale to decode ``decimal_point`` and ``thousands_sep`` fields of :c:func:`localeconv` if they are non-ASCII or longer than 1 byte, and the ``LC_NUMERIC`` locale is different than the ``LC_CTYPE`` locale. This temporary change affects other threads.
pt_pt: Ao formatar um número (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` e subclasses) com o tipo ``n`` (ex: ``'{:n}'.format(1234)``), a função define temporariamente a localização ``LC_CTYPE`` para a localização ``LC_NUMERIC`` para descodificar os campos ``decimal_point`` e ``thousands_sep`` de :c:func:`localeconv` se forem não-ASCII ou maiores que 1 byte, e a localização ``LC_NUMERIC`` for diferente da localização ``LC_CTYPE``. Esta alteração temporária afeta outras *threads*.
sv: Vid formatering av ett tal (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` och underklasser) med typen ``n`` (ex: ``'{:n}'.format(1234)``), ställer funktionen temporärt in ``LC_CTYPE`` locale till ``LC_NUMERIC`` locale för att avkoda ``decimal_point`` och ``thousands_sep`` fälten i :c:func:`localeconv` om de är icke-ASCII eller längre än 1 byte, och ``LC_NUMERIC`` locale är annorlunda än ``LC_CTYPE`` locale. Denna tillfälliga ändring påverkar andra trådar.

source: When formatting a number with the ``n`` type, the function sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
pt_pt: Ao formatar um número com o tipo ``n``, a função define temporariamente a localização ``LC_CTYPE`` para a localização ``LC_NUMERIC`` em alguns casos.
sv: Vid formatering av ett tal med typen ``n`` ställer funktionen i vissa fall tillfälligt in ``LC_CTYPE`` locale till ``LC_NUMERIC`` locale.

source: Similar to ``str.format(**mapping)``, except that ``mapping`` is used directly and not copied to a :class:`dict`. This is useful if for example ``mapping`` is a dict subclass:
pt_pt: Semelhante a ``str.format(**mapping)``, exceto que ``mapping`` é usado diretamente e não é copiado para um :class:`dict`. Isto é útil se, por exemplo, ``mapping`` for uma subclasse de dicionário:
sv: Liknar ``str.format(**mapping)``, förutom att ``mapping`` används direkt och inte kopieras till en :class:`dict`. Detta är användbart om till exempel ``mapping`` är en dict-underklass:

source: Like :meth:`~str.find`, but raise :exc:`ValueError` when the substring is not found.
sv: Som :meth:`~str.find`, men ger upphov till :exc:`ValueError` när delsträngen inte hittas.

source: Return ``True`` if all characters in the string are alphanumeric and there is at least one character, ``False`` otherwise. A character ``c`` is alphanumeric if one of the following returns ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, or ``c.isnumeric()``.
pt_pt: Retorna ``True`` se todos os caracteres na *string* forem alfanuméricos e houver pelo menos um caractere, ``False`` caso contrário. Um caractere ``c`` é alfanumérico se uma das seguintes funções retornar ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()`` ou ``c.isnumeric()``.
sv: Returnerar ``True`` om alla tecken i strängen är alfanumeriska och det finns minst ett tecken, annars ``False``. Ett tecken ``c`` är alfanumeriskt om något av följande returnerar ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, eller ``c.isnumeric()``.

source: Return ``True`` if all characters in the string are alphabetic and there is at least one character, ``False`` otherwise. Alphabetic characters are those characters defined in the Unicode character database as "Letter", i.e., those with general category property being one of "Lm", "Lt", "Lu", "Ll", or "Lo". Note that this is different from the `Alphabetic property defined in the section 4.10 'Letters, Alphabetic, and Ideographic' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-4/#G91002>`_.
sv: Returnerar ``True`` om alla tecken i strängen är alfabetiska och det finns minst ett tecken, ``False`` annars. Alfabetiska tecken är de tecken som i Unicodes teckendatabas definieras som "Letter", dvs. de som har en allmän kategoriegenskap som är en av "Lm", "Lt", "Lu", "Ll" eller "Lo". Observera att detta skiljer sig från egenskapen `Alphabetic som definieras i avsnitt 4.10 'Letters, Alphabetic, and Ideographic' i Unicode-standarden <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-4/#G91002>`_.

source: Return ``True`` if the string is empty or all characters in the string are ASCII, ``False`` otherwise. ASCII characters have code points in the range U+0000-U+007F.
sv: Returnerar ``True`` om strängen är tom eller om alla tecken i strängen är ASCII, annars ``False``. ASCII-tecken har kodpunkter i intervallet U+0000-U+007F.

source: Return ``True`` if all characters in the string are decimal characters and there is at least one character, ``False`` otherwise. Decimal characters are those that can be used to form numbers in base 10, e.g. U+0660, ARABIC-INDIC DIGIT ZERO. Formally a decimal character is a character in the Unicode General Category "Nd".
sv: Returnerar ``True`` om alla tecken i strängen är decimala tecken och det finns minst ett tecken, annars ``False``. Decimala tecken är sådana som kan användas för att bilda tal i bas 10, t.ex. U+0660, ARABIC-INDIC DIGIT ZERO. Formellt är ett decimaltal ett tecken i Unicodes allmänna kategori "Nd".

source: Return ``True`` if all characters in the string are digits and there is at least one character, ``False`` otherwise. Digits include decimal characters and digits that need special handling, such as the compatibility superscript digits. This covers digits which cannot be used to form numbers in base 10, like the Kharosthi numbers. Formally, a digit is a character that has the property value Numeric_Type=Digit or Numeric_Type=Decimal.
pt_pt: Retorna ``True`` se todos os caracteres na *string* forem dígitos e houver pelo menos um caractere, ``False`` caso contrário. Dígitos incluem caracteres decimais e dígitos que necessitam de tratamento especial, como os dígitos sobrescritos de compatibilidade. Isto abrange dígitos que não podem ser usados para formar números em base 10, como os números Kharosthi. Formalmente, um dígito é um caractere que tem o valor de propriedade Numeric_Type=Digit ou Numeric_Type=Decimal.
sv: Returnerar ``True`` om alla tecken i strängen är siffror och det finns minst ett tecken, annars ``False``. Siffror omfattar decimala tecken och siffror som kräver särskild hantering, t.ex. upphöjda siffror för kompatibilitet. Detta omfattar siffror som inte kan användas för att bilda tal i bas 10, t.ex. Kharosthi-talen. Formellt sett är en siffra ett tecken som har egenskapsvärdet Numeric_Type=Digit eller Numeric_Type=Decimal.

source: Return ``True`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`.
pt_pt: Retorna ``True`` se a *string* for um identificador válido de acordo com a definição da linguagem, secção :ref:`identifiers`.
sv: Returnerar ``True`` om strängen är en giltig identifierare enligt språkdefinitionen, avsnitt :ref:`identifiers`.

source: :func:`keyword.iskeyword` can be used to test whether string ``s`` is a reserved identifier, such as :keyword:`def` and :keyword:`class`.
pt_pt: A função :func:`keyword.iskeyword` pode ser usada para testar se a *string* ``s`` é um identificador reservado, como :keyword:`def` e :keyword:`class`.
sv: :func:`keyword.iskeyword` kan användas för att testa om strängen ``s`` är en reserverad identifierare, t.ex. :keyword:`def` och :keyword:`class`.

source: Example: ::
pt_pt: Exemplo:
sv: Exempel: ::

source: >>> from keyword import iskeyword >>> 'hello'.isidentifier(), iskeyword('hello') (True, False) >>> 'def'.isidentifier(), iskeyword('def') (True, True)
sv: >>> från nyckelord import iskeyword >>> 'hello'.isidentifier(), iskeyword('hello') (sant, falskt) >>> 'def'.isidentifier(), iskeyword('def') (sant, sant)

source: Return ``True`` if all cased characters [4]_ in the string are lowercase and there is at least one cased character, ``False`` otherwise.
pt_pt: Retorna ``True`` se todos os caracteres com caixa [4]_ na *string* forem minúsculos e houver pelo menos um caractere com caixa, ``False`` caso contrário.
sv: Returnerar ``True`` om alla tecken med versaler [4]_ i strängen är gemener och det finns minst ett tecken med versaler, ``False`` annars.

source: Return ``True`` if all characters in the string are numeric characters, and there is at least one character, ``False`` otherwise. Numeric characters include digit characters, and all characters that have the Unicode numeric value property, e.g. U+2155, VULGAR FRACTION ONE FIFTH. Formally, numeric characters are those with the property value Numeric_Type=Digit, Numeric_Type=Decimal or Numeric_Type=Numeric.
sv: Returnerar ``True`` om alla tecken i strängen är numeriska tecken och det finns minst ett tecken, annars ``False``. Numeriska tecken inkluderar siffertecken och alla tecken som har egenskapen Unicode numeriskt värde, t.ex. U+2155, VULGAR FRACTION ONE FIFTH. Formellt är numeriska tecken de som har egenskapsvärdet Numeric_Type=Digit, Numeric_Type=Decimal eller Numeric_Type=Numeric.

source: Return ``True`` if all characters in the string are printable, ``False`` if it contains at least one non-printable character.
pt_pt: Retorna ``True`` se todos os caracteres na *string* forem imprimíveis, ``False`` se contiver pelo menos um caractere não imprimível.
sv: Returnerar ``True`` om alla tecken i strängen är utskrivbara, ``False`` om den innehåller minst ett icke-utskrivbart tecken.
