Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/struct.po
Languages: ru

source: Attempt to pack an integer which is too large for the defined field::
ru: Попытка упаковать целое число, которое слишком велико для определенного поля::

source: >>> pack(">h", 99999) Traceback (most recent call last): File "<stdin>", line 1, in <module> struct.error: 'h' format requires -32768 <= number <= 32767
ru: >>> пакет(">h", 99999) Traceback (последний вызов последний): Файл «<stdin>», строка 1, в <модуле> struct.error: для формата 'h' требуется -32768 <= число <= 32767

source: Demonstrate the difference between ``'s'`` and ``'c'`` format characters::
ru: Продемонстрируйте разницу между символами формата ``'s'`` и ``'c'``::

source: Unpacked fields can be named by assigning them to variables or by wrapping the result in a named tuple::
ru: Неупакованным полям можно дать имена, присвоив их переменным или обернув результат в именованный кортеж:

source: The ordering of format characters may have an impact on size in native mode since padding is implicit. In standard mode, the user is responsible for inserting any desired padding. Note in the first ``pack`` call below that three NUL bytes were added after the packed ``'#'`` to align the following integer on a four-byte boundary. In this example, the output was produced on a little endian machine::
ru: Порядок символов формата может влиять на размер в основном режиме, поскольку заполнение неявно. В стандартном режиме пользователь несет ответственность за вставку любого желаемого заполнения. Обратите внимание, что в первом вызове ``pack`` ниже, после упакованного ``'#'`` были добавлены три NUL-байта, чтобы выровнять следующее целое число по границе четырех байтов. В этом примере выходные данные были созданы на машине с прямым порядком байтов:

source: The following format ``'llh0l'`` results in two pad bytes being added at the end, assuming the platform's longs are aligned on 4-byte boundaries::
ru: Следующий формат ``'llh0l'`` приводит к добавлению в конце двух байтов заполнения, предполагая, что длинные длины платформы выровнены по границам 4 байтов:

source: Module :mod:`array`
ru: Модуль :mod:`array`

source: Packed binary storage of homogeneous data.
ru: Упакованное двоичное хранилище однородных данных.

source: Module :mod:`json`
ru: Модуль :mod:`json`

source: JSON encoder and decoder.
ru: Кодер и декодер JSON.

source: Module :mod:`pickle`
ru: Модуль :mod:`pickle`

source: Python object serialization.
ru: Сериализация объектов Python.

source: Applications
ru: Приложения

source: Two main applications for the :mod:`struct` module exist, data interchange between Python and C code within an application or another application compiled using the same compiler (:ref:`native formats<struct-native-formats>`), and data interchange between applications using agreed upon data layout (:ref:`standard formats<struct-standard-formats>`). Generally speaking, the format strings constructed for these two domains are distinct.
ru: Существуют два основных приложения для модуля :mod:`struct`: обмен данными между кодом Python и C внутри приложения или другого приложения, скомпилированного с использованием одного и того же компилятора (:ref:`native formats<struct-native-formats>`) и обмен данными между приложениями с использованием согласованного формата данных (:ref:`standard formats<struct-standard-formats>`). Вообще говоря, строки формата, созданные для этих двух доменов, различны.

source: Native Formats
ru: Родные форматы

source: When constructing format strings which mimic native layouts, the compiler and machine architecture determine byte ordering and padding. In such cases, the ``@`` format character should be used to specify native byte ordering and data sizes. Internal pad bytes are normally inserted automatically. It is possible that a zero-repeat format code will be needed at the end of a format string to round up to the correct byte boundary for proper alignment of consecutive chunks of data.
ru: При создании строк формата, имитирующих собственные макеты, компилятор и архитектура машины определяют порядок и заполнение байтов. В таких случаях для указания собственного порядка байтов и размеров данных следует использовать символ формата ``@``. Внутренние байты заполнения обычно вставляются автоматически. Возможно, что код формата с нулевым повторением потребуется в конце строки формата для округления до правильной границы байта и правильного выравнивания последовательных фрагментов данных.

source: Consider these two simple examples (on a 64-bit, little-endian machine)::
ru: Рассмотрим эти два простых примера (на 64-битной машине с прямым порядком байтов):

source: Data is not padded to an 8-byte boundary at the end of the second format string without the use of extra padding. A zero-repeat format code solves that problem::
ru: Данные не дополняются до 8-байтовой границы в конце второй строки формата без использования дополнительного заполнения. Код формата с нулевым повторением решает эту проблему:

source: The ``'x'`` format code can be used to specify the repeat, but for native formats it is better to use a zero-repeat format like ``'0l'``.
ru: Код формата ``'x'`` может использоваться для указания повторения, но для собственных форматов лучше использовать формат с нулевым повторением, например ``'0l'``.

source: By default, native byte ordering and alignment is used, but it is better to be explicit and use the ``'@'`` prefix character.
ru: По умолчанию используется собственный порядок и выравнивание байтов, но лучше указать явно и использовать префиксный символ ``'@'``.

source: Standard Formats
ru: Стандартные форматы

source: When exchanging data beyond your process such as networking or storage, be precise. Specify the exact byte order, size, and alignment. Do not assume they match the native order of a particular machine. For example, network byte order is big-endian, while many popular CPUs are little-endian. By defining this explicitly, the user need not care about the specifics of the platform their code is running on. The first character should typically be ``<`` or ``>`` (or ``!``). Padding is the responsibility of the programmer. The zero-repeat format character won't work. Instead, the user must explicitly add ``'x'`` pad bytes where needed. Revisiting the examples from the previous section, we have::
ru: При обмене данными, выходящим за рамки вашего процесса, например, сети или хранилища, будьте точны. Укажите точный порядок байтов, размер и выравнивание. Не думайте, что они соответствуют исходному порядку конкретной машины. Например, порядок байтов в сети — обратный порядок байтов, тогда как у многих популярных процессоров — прямой порядок байтов. Определив это явно, пользователю не нужно беспокоиться о специфике платформы, на которой работает его код. Первым символом обычно должен быть ``<`` или ``>`` (или ``!``). Заполнение является обязанностью программиста. Символ формата с нулевым повтором не будет работать. Вместо этого пользователь должен явно добавить x байтов заполнения там, где это необходимо. Возвращаясь к примерам из предыдущего раздела, мы имеем:

source: The above results (executed on a 64-bit machine) aren't guaranteed to match when executed on different machines. For example, the examples below were executed on a 32-bit machine::
ru: Приведенные выше результаты (выполненные на 64-разрядной машине) не гарантируют совпадение при выполнении на разных машинах. Например, приведенные ниже примеры были выполнены на 32-битной машине:

source: Classes
ru: Классы

source: The :mod:`struct` module also defines the following type:
ru: Модуль :mod:`struct` также определяет следующий тип:

source: Return a new Struct object which writes and reads binary data according to the format string *format*. Creating a ``Struct`` object once and calling its methods is more efficient than calling module-level functions with the same format since the format string is only compiled once.
ru: Возвращает новый объект Struct, который записывает и считывает двоичные данные в соответствии со строкой формата *format*. Создание объекта Struct один раз и вызов его методов более эффективно, чем вызов функций уровня модуля с тем же форматом, поскольку строка формата компилируется только один раз.

source: The compiled versions of the most recent format strings passed to the module-level functions are cached, so programs that use only a few format strings needn't worry about reusing a single :class:`Struct` instance.
ru: Скомпилированные версии самых последних строк формата, переданных функциям уровня модуля, кэшируются, поэтому программам, которые используют только несколько строк формата, не нужно беспокоиться о повторном использовании одного экземпляра :class:`Struct`.

source: Compiled Struct objects support the following methods and attributes:
ru: Скомпилированные объекты Struct поддерживают следующие методы и атрибуты:

source: Identical to the :func:`pack` function, using the compiled format. (``len(result)`` will equal :attr:`size`.)
ru: Идентичен функции :func:`pack`, использует скомпилированный формат. (``len(result)`` будет равен :attr:`size`.)

source: Identical to the :func:`pack_into` function, using the compiled format.
ru: Идентичен функции :func:`pack_into`, использует скомпилированный формат.

source: Identical to the :func:`unpack` function, using the compiled format. The buffer's size in bytes must equal :attr:`size`.
ru: Идентичен функции :func:`unpack`, использует скомпилированный формат. Размер буфера в байтах должен быть равен :attr:`size`.

source: Identical to the :func:`unpack_from` function, using the compiled format. The buffer's size in bytes, starting at position *offset*, must be at least :attr:`size`.
ru: Идентичен функции :func:`unpack_from`, использует скомпилированный формат. Размер буфера в байтах, начиная с позиции *offset*, должен быть не менее :attr:`size`.

source: Identical to the :func:`iter_unpack` function, using the compiled format. The buffer's size in bytes must be a multiple of :attr:`size`.
ru: Идентичен функции :func:`iter_unpack`, использует скомпилированный формат. Размер буфера в байтах должен быть кратен :attr:`size`.

source: The format string used to construct this Struct object.
ru: Строка формата, используемая для создания этого объекта Struct.

source: The format string type is now :class:`str` instead of :class:`bytes`.
ru: Тип строки формата теперь :class:`str` вместо :class:`bytes`.

source: The calculated size of the struct (and hence of the bytes object produced by the :meth:`pack` method) corresponding to :attr:`format`.
ru: Вычисленный размер структуры (и, следовательно, объекта байтов, созданного методом :meth:`pack`), соответствующего :attr:`format`.

source: structures
ru: структуры

source: packing
ru: упаковка

source: binary
ru: бинарные

source: data
ru: данные

source: in struct format strings
ru: в строках формата структуры

source: = (equals)
ru: = (равно)

source: < (less)
ru: < (меньше)

source: > (greater)
ru: > (больше)

source: ! (exclamation)
ru: ! (восклицание)

source: ? (question mark)
ru: ? (знак вопроса)
