Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/struct.po
Languages: ru

source: :mod:`!struct` --- Interpret bytes as packed binary data
ru: :mod:`!struct` --- Интерпретировать байты как упакованные двоичные данные

source: **Source code:** :source:`Lib/struct.py`
ru: **Исходный код:** :source:`Lib/struct.py`

source: This module converts between Python values and C structs represented as Python :class:`bytes` objects. Compact :ref:`format strings <struct-format-strings>` describe the intended conversions to/from Python values. The module's functions and objects can be used for two largely distinct applications, data exchange with external sources (files or network connections), or data transfer between the Python application and the C layer.
ru: Этот модуль преобразует значения Python в структуры C, представленные как объекты Python :class:`bytes`. Компактные строки формата <struct-format-strings>` описывают предполагаемые преобразования в/из значений Python. Функции и объекты модуля могут использоваться для двух совершенно разных приложений: обмена данными с внешними источниками (файлами или сетевыми подключениями) или передачи данных между приложением Python и уровнем C.

source: When no prefix character is given, native mode is the default. It packs or unpacks data based on the platform and compiler on which the Python interpreter was built. The result of packing a given C struct includes pad bytes which maintain proper alignment for the C types involved; similarly, alignment is taken into account when unpacking. In contrast, when communicating data between external sources, the programmer is responsible for defining byte ordering and padding between elements. See :ref:`struct-alignment` for details.
ru: Если префикс не указан, по умолчанию используется собственный режим. Он упаковывает или распаковывает данные на основе платформы и компилятора, на которых был построен интерпретатор Python. Результат упаковки данной структуры C включает байты заполнения, которые поддерживают правильное выравнивание для задействованных типов C; аналогично выравнивание учитывается при распаковке. Напротив, при передаче данных между внешними источниками программист отвечает за определение порядка байтов и заполнение между элементами. Подробности смотрите в :ref:`struct-alignment`.

source: Several :mod:`struct` functions (and methods of :class:`Struct`) take a *buffer* argument. This refers to objects that implement the :ref:`bufferobjects` and provide either a readable or read-writable buffer. The most common types used for that purpose are :class:`bytes` and :class:`bytearray`, but many other types that can be viewed as an array of bytes implement the buffer protocol, so that they can be read/filled without additional copying from a :class:`bytes` object.
ru: Некоторые функции :mod:`struct` (и методы :class:`Struct`) принимают аргумент *buffer*. Это относится к объектам, которые реализуют :ref:`bufferobjects` и предоставляют либо читаемый, либо читаемо-записываемый буфер. Наиболее распространенными типами, используемыми для этой цели, являются :class:`bytes` и :class:`bytearray`, но многие другие типы, которые можно рассматривать как массив байтов, реализуют протокол буфера, поэтому их можно читать/заполнять без дополнительное копирование из объекта :class:`bytes`.

source: Functions and Exceptions
ru: Функции и исключения

source: The module defines the following exception and functions:
ru: Модуль определяет следующие исключения и функции:

source: Exception raised on various occasions; argument is a string describing what is wrong.
ru: Исключение возникало в различных случаях; Аргумент — это строка, описывающая, что не так.

source: Return a bytes object containing the values *v1*, *v2*, ... packed according to the format string *format*. The arguments must match the values required by the format exactly.
ru: Возвращает объект байтов, содержащий значения *v1*, *v2*, ..., упакованный в соответствии со строкой формата *format*. Аргументы должны точно соответствовать значениям, требуемым форматом.

source: Pack the values *v1*, *v2*, ... according to the format string *format* and write the packed bytes into the writable buffer *buffer* starting at position *offset*. Note that *offset* is a required argument.
ru: Упакуйте значения *v1*, *v2*, ... в соответствии со строкой формата *format* и запишите упакованные байты в записываемый буфер *buffer*, начиная с позиции *offset*. Обратите внимание, что *offset* является обязательным аргументом.

source: Unpack from the buffer *buffer* (presumably packed by ``pack(format, ...)``) according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes must match the size required by the format, as reflected by :func:`calcsize`.
ru: Распакуйте из буфера *buffer* (предположительно упакованного с помощью ``pack(format, ...)``) в соответствии со строкой формата *format*. Результатом является кортеж, даже если он содержит ровно один элемент. Размер буфера в байтах должен соответствовать размеру, требуемому форматом, как это отражено в :func:`calcsize`.

source: Unpack from *buffer* starting at position *offset*, according to the format string *format*. The result is a tuple even if it contains exactly one item. The buffer's size in bytes, starting at position *offset*, must be at least the size required by the format, as reflected by :func:`calcsize`.
ru: Распакуйте из *buffer*, начиная с позиции *offset*, в соответствии со строкой формата *format*. Результатом является кортеж, даже если он содержит ровно один элемент. Размер буфера в байтах, начиная с позиции *offset*, должен быть не меньше размера, требуемого форматом, как это отражено в :func:`calcsize`.

source: Iteratively unpack from the buffer *buffer* according to the format string *format*. This function returns an iterator which will read equally sized chunks from the buffer until all its contents have been consumed. The buffer's size in bytes must be a multiple of the size required by the format, as reflected by :func:`calcsize`.
ru: Итеративно распаковать из буфера *buffer* в соответствии со строкой формата *format*. Эта функция возвращает итератор, который будет читать из буфера куски одинакового размера до тех пор, пока все его содержимое не будет использовано. Размер буфера в байтах должен быть кратным размеру, требуемому форматом, что отражено в :func:`calcsize`.

source: Each iteration yields a tuple as specified by the format string.
ru: Каждая итерация дает кортеж, указанный в строке формата.

source: Return the size of the struct (and hence of the bytes object produced by ``pack(format, ...)``) corresponding to the format string *format*.
ru: Возвращает размер структуры (и, следовательно, объекта байтов, созданного с помощью ``pack(format, ...)``), соответствующего строке формата *format*.

source: Format Strings
ru: Форматирование строк

source: Format strings describe the data layout when packing and unpacking data. They are built up from :ref:`format characters<format-characters>`, which specify the type of data being packed/unpacked. In addition, special characters control the :ref:`byte order, size and alignment<struct-alignment>`. Each format string consists of an optional prefix character which describes the overall properties of the data and one or more format characters which describe the actual data values and padding.
ru: Строки формата описывают расположение данных при упаковке и распаковке данных. Они состоят из :ref:`formatcharacters<format-characters>`, которые определяют тип упаковываемых/распаковываемых данных. Кроме того, специальные символы управляют порядком байтов, размером и выравниванием<struct-alignment>`. Каждая строка формата состоит из необязательного префиксного символа, который описывает общие свойства данных, и одного или нескольких символов формата, которые описывают фактические значения данных и заполнение.

source: Byte Order, Size, and Alignment
ru: Порядок байтов, размер и выравнивание

source: By default, C types are represented in the machine's native format and byte order, and properly aligned by skipping pad bytes if necessary (according to the rules used by the C compiler). This behavior is chosen so that the bytes of a packed struct correspond exactly to the memory layout of the corresponding C struct. Whether to use native byte ordering and padding or standard formats depends on the application.
ru: По умолчанию типы C представлены в собственном формате машины и порядке байтов и правильно выровнены путем пропуска дополнительных байтов, если это необходимо (в соответствии с правилами, используемыми компилятором C). Такое поведение выбрано таким образом, чтобы байты упакованной структуры точно соответствовали расположению памяти соответствующей структуры C. Использовать ли собственный порядок байтов и заполнение или стандартные форматы, зависит от приложения.

source: Alternatively, the first character of the format string can be used to indicate the byte order, size and alignment of the packed data, according to the following table:
ru: Альтернативно, первый символ строки формата может использоваться для указания порядка байтов, размера и выравнивания упакованных данных в соответствии со следующей таблицей:

source: Character
ru: Символ

source: Byte order
ru: Порядок байтов

source: Size
ru: Размер

source: Alignment
ru: Выравнивание

source: standard
ru: стандартный

source: network (= big-endian)
ru: сеть (= big-endian)

source: If the first character is not one of these, ``'@'`` is assumed.
ru: Если первый символ не является одним из этих, предполагается ``'@'``.

source: The number 1023 (``0x3ff`` in hexadecimal) has the following byte representations:
ru: Число 1023 (шестнадцатеричное 0x3ff) имеет следующие байтовые представления:

source: Python example:
ru: Пример Python:

source: Native byte order is big-endian or little-endian, depending on the host system. For example, Intel x86, AMD64 (x86-64), and Apple M1 are little-endian; IBM z and many legacy architectures are big-endian. Use :data:`sys.byteorder` to check the endianness of your system.
ru: Собственный порядок байтов — прямой или прямой, в зависимости от хост-системы. Например, Intel x86, AMD64 (x86-64) и Apple M1 имеют прямой порядок байтов; IBM z и многие устаревшие архитектуры имеют обратный порядок байтов. Используйте :data:`sys.byteorder`, чтобы проверить порядок байтов вашей системы.

source: Native size and alignment are determined using the C compiler's ``sizeof`` expression. This is always combined with native byte order.
ru: Собственный размер и выравнивание определяются с использованием выражения компилятора C sizeof. Это всегда сочетается с собственным порядком байтов.

source: Standard size depends only on the format character; see the table in the :ref:`format-characters` section.
ru: Стандартный размер зависит только от символа формата; см. таблицу в разделе :ref:`format-characters`.

source: Note the difference between ``'@'`` and ``'='``: both use native byte order, but the size and alignment of the latter is standardized.
ru: Обратите внимание на разницу между ``'@'`` и ``'='``: оба используют собственный порядок байтов, но размер и выравнивание последнего стандартизированы.

source: The form ``'!'`` represents the network byte order which is always big-endian as defined in `IETF RFC 1700 <IETF RFC 1700_>`_.
ru: Форма ``'!'`` представляет сетевой порядок байтов, который всегда имеет обратный порядок байтов, как определено в ``IETF RFC 1700 <IETF RFC 1700_>`_.

source: There is no way to indicate non-native byte order (force byte-swapping); use the appropriate choice of ``'<'`` or ``'>'``.
ru: Невозможно указать несобственный порядок байтов (принудительная замена байтов); используйте соответствующий выбор ``'<'`` или ``'>'``.

source: Notes:
ru: Примечания:

source: Padding is only automatically added between successive structure members. No padding is added at the beginning or the end of the encoded struct.
ru: Заполнение автоматически добавляется только между последовательными элементами структуры. Никакие дополнения не добавляются в начале или конце закодированной структуры.

source: No padding is added when using non-native size and alignment, e.g. with '<', '>', '=', and '!'.
ru: При использовании нестандартного размера и выравнивания, например, с '<', '>', '=' и '!', заполнение не добавляется.

source: To align the end of a structure to the alignment requirement of a particular type, end the format with the code for that type with a repeat count of zero. See :ref:`struct-examples`.
ru: Чтобы привести конец структуры в соответствие с требованиями выравнивания определенного типа, завершите формат кодом для этого типа с нулевым счетчиком повторов. См. :ref:`struct-examples`.

source: Format Characters
ru: Форматирование символов

source: Format characters have the following meaning; the conversion between C and Python values should be obvious given their types. The 'Standard size' column refers to the size of the packed value in bytes when using standard size; that is, when the format string starts with one of ``'<'``, ``'>'``, ``'!'`` or ``'='``. When using native size, the size of the packed value is platform-dependent.
ru: Символы формата имеют следующее значение; преобразование между значениями C и Python должно быть очевидным, учитывая их типы. Столбец «Стандартный размер» относится к размеру упакованного значения в байтах при использовании стандартного размера; то есть, когда строка формата начинается с одного из ``'<'``, ``'>'``, ``'!'`` или ``'='``. При использовании собственного размера размер упакованного значения зависит от платформы.

source: Format
ru: Формат

source: C Type
ru: Тип C

source: Python type
ru: Тип Python

source: Standard size
ru: Стандартный размер

source: Notes
ru: Примечания

source: pad byte
ru: байт заполнения

source: no value
ru: нет значения

source: bytes of length 1
ru: байты длиной 1

source: integer
ru: целое число

source: bytes
ru: байт

source: Added support for the ``'n'`` and ``'N'`` formats.
ru: Добавлена ​​поддержка форматов ``'n'`` и ``'N'``.

source: Added support for the ``'e'`` format.
ru: Добавлена ​​поддержка формата ``'e'``.

source: The ``'?'`` conversion code corresponds to the :c:expr:`_Bool` type defined by C standards since C99. In standard mode, it is represented by one byte.
ru: Код преобразования ``'?'`` соответствует типу :c:expr:`_Bool`, определенному стандартами C, начиная с C99. В стандартном режиме он представлен одним байтом.

source: When attempting to pack a non-integer using any of the integer conversion codes, if the non-integer has a :meth:`~object.__index__` method then that method is called to convert the argument to an integer before packing.
ru: При попытке упаковать нецелое число с использованием любого из целочисленных кодов преобразования, если нецелое число имеет метод :meth:`~object.__index__`, то этот метод вызывается для преобразования аргумента в целое число перед упаковкой.

source: Added use of the :meth:`~object.__index__` method for non-integers.
ru: Добавлено использование метода :meth:`~object.__index__` для нецелых чисел.

source: The ``'n'`` and ``'N'`` conversion codes are only available for the native size (selected as the default or with the ``'@'`` byte order character). For the standard size, you can use whichever of the other integer formats fits your application.
ru: Коды преобразования ``'n'`` и ``'N'`` доступны только для собственного размера (выбранного по умолчанию или с символом порядка байтов ``'@'``). Для стандартного размера вы можете использовать любой другой целочисленный формат, подходящий для вашего приложения.

source: For the ``'f'``, ``'d'`` and ``'e'`` conversion codes, the packed representation uses the IEEE 754 binary32, binary64 or binary16 format (for ``'f'``, ``'d'`` or ``'e'`` respectively), regardless of the floating-point format used by the platform.
ru: Для кодов преобразования ``'f'``, ``'d'`` и ``'e'`` упакованное представление использует формат IEEE 754binary32,binary64 илиbinary16 (для ``'f'`` , ``'d'`` или ``'e'`` соответственно), независимо от формата с плавающей запятой, используемого платформой.

source: The ``'P'`` format character is only available for the native byte ordering (selected as the default or with the ``'@'`` byte order character). The byte order character ``'='`` chooses to use little- or big-endian ordering based on the host system. The struct module does not interpret this as native ordering, so the ``'P'`` format is not available.
ru: Символ формата ``'P'`` доступен только для собственного порядка байтов (выбранного по умолчанию или с символом порядка байтов ``'@'``). Символ порядка байтов ``'='`` выбирает использование прямого или обратного порядка байтов в зависимости от хост-системы. Модуль struct не интерпретирует это как собственный порядок, поэтому формат P недоступен.

source: The IEEE 754 binary16 "half precision" type was introduced in the 2008 revision of the `IEEE 754 standard <ieee 754 standard_>`_. It has a sign bit, a 5-bit exponent and 11-bit precision (with 10 bits explicitly stored), and can represent numbers between approximately ``6.1e-05`` and ``6.5e+04`` at full precision. This type is not widely supported by C compilers: on a typical machine, an unsigned short can be used for storage, but not for math operations. See the Wikipedia page on the `half-precision floating-point format <half precision format_>`_ for more information.
ru: Двоичный16 тип IEEE 754 «половинной точности» был введен в версии 2008 года `_ стандарта IEEE 754 <ieee 754 Standard_>`_. Он имеет знаковый бит, 5-битную экспоненту и 11-битную точность (с явно сохраненными 10 битами) и может представлять числа примерно между ``6.1e-05`` и ``6.5e+04`` с полной точностью. . Этот тип не поддерживается широко компиляторами C: на типичной машине беззнаковое сокращение может использоваться для хранения, но не для математических операций. Дополнительную информацию см. на странице Википедии «формат с плавающей запятой половинной точности <формат половинной точности_>».

source: When packing, ``'x'`` inserts one NUL byte.
ru: При упаковке ``'x'`` вставляет один NUL-байт.

source: The ``'p'`` format character encodes a "Pascal string", meaning a short variable-length string stored in a *fixed number of bytes*, given by the count. The first byte stored is the length of the string, or 255, whichever is smaller. The bytes of the string follow. If the string passed in to :func:`pack` is too long (longer than the count minus 1), only the leading ``count-1`` bytes of the string are stored. If the string is shorter than ``count-1``, it is padded with null bytes so that exactly count bytes in all are used. Note that for :func:`unpack`, the ``'p'`` format character consumes ``count`` bytes, but that the string returned can never contain more than 255 bytes.
ru: Символ формата ``'p'`` кодирует "строку Паскаля", то есть короткую строку переменной длины, хранящуюся в *фиксированном количестве байтов*, заданном счетчиком. Первый сохраненный байт соответствует длине строки или 255, в зависимости от того, что меньше. Далее следуют байты строки. Если строка, переданная в :func:`pack`, слишком длинная (длиннее, чем count минус 1), сохраняются только ведущие байты ``count-1`` строки. Если строка короче, чем ``count-1``, она дополняется нулевыми байтами, так что всего используется ровно столько байтов. Обратите внимание, что для :func:`unpack` символ формата ``'p'`` потребляет ``count`` байтов, но возвращаемая строка никогда не может содержать более 255 байтов.

source: For the ``'s'`` format character, the count is interpreted as the length of the bytes, not a repeat count like for the other format characters; for example, ``'10s'`` means a single 10-byte string mapping to or from a single Python byte string, while ``'10c'`` means 10 separate one byte character elements (e.g., ``cccccccccc``) mapping to or from ten different Python byte objects. (See :ref:`struct-examples` for a concrete demonstration of the difference.) If a count is not given, it defaults to 1. For packing, the string is truncated or padded with null bytes as appropriate to make it fit. For unpacking, the resulting bytes object always has exactly the specified number of bytes. As a special case, ``'0s'`` means a single, empty string (while ``'0c'`` means 0 characters).
ru: Для символа формата ``'s'`` счетчик интерпретируется как длина байтов, а не как счетчик повторений, как для других символов формата; например, ``'10s'`` означает одну 10-байтовую строку, сопоставленную с одной байтовой строкой Python или из нее, а ``'10c'`` означает 10 отдельных однобайтовых символьных элементов (например, ``cccccccccc`` ) сопоставление десяти различным байтовым объектам Python или обратно. (См. :ref:`struct-examples` для конкретной демонстрации разницы.) Если счетчик не указан, по умолчанию он равен 1. Для упаковки строка усекается или дополняется нулевыми байтами, чтобы она соответствовала размеру. При распаковке результирующий объект байтов всегда содержит ровно указанное количество байтов. В частном случае ``'0s'`` означает одну пустую строку (в то время как ``'0c'`` означает 0 символов).

source: A format character may be preceded by an integral repeat count. For example, the format string ``'4h'`` means exactly the same as ``'hhhh'``.
ru: Символу формата может предшествовать целое число повторений. Например, строка формата ``'4h'`` означает то же самое, что и ``'hhhh'``.

source: Whitespace characters between formats are ignored; a count and its format must not contain whitespace though.
ru: Пробелы между форматами игнорируются; однако счетчик и его формат не должны содержать пробелов.

source: When packing a value ``x`` using one of the integer formats (``'b'``, ``'B'``, ``'h'``, ``'H'``, ``'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), if ``x`` is outside the valid range for that format then :exc:`struct.error` is raised.
ru: При упаковке значения ``x`` с использованием одного из целочисленных форматов (``'b'``, ``'B'``, ``'h'``, ``'H'``, `` 'i'``, ``'I'``, ``'l'``, ``'L'``, ``'q'``, ``'Q'``), если `` x`` находится за пределами допустимого диапазона для этого формата, тогда возникает :exc:`struct.error`.

source: Previously, some of the integer formats wrapped out-of-range values and raised :exc:`DeprecationWarning` instead of :exc:`struct.error`.
ru: Ранее некоторые целочисленные форматы переносили значения, выходящие за пределы диапазона, и вызывали :exc:`DeprecationWarning` вместо :exc:`struct.error`.

source: For the ``'?'`` format character, the return value is either :const:`True` or :const:`False`. When packing, the truth value of the argument object is used. Either 0 or 1 in the native or standard bool representation will be packed, and any non-zero value will be ``True`` when unpacking.
ru: Для символа формата ``'?'`` возвращаемое значение равно либо :const:`True`, либо :const:`False`. При упаковке используется значение истинности объекта аргумента. Будет упаковано либо 0, либо 1 в собственном или стандартном логическом представлении, а любое ненулевое значение при распаковке будет иметь значение «True».

source: Examples
ru: Примеры

source: Native byte order examples (designated by the ``'@'`` format prefix or lack of any prefix character) may not match what the reader's machine produces as that depends on the platform and compiler.
ru: Примеры собственного порядка байтов (обозначаемые префиксом формата ``'@'`` или отсутствием какого-либо префиксного символа) могут не соответствовать тому, что выдает машина чтения, поскольку это зависит от платформы и компилятора.

source: Pack and unpack integers of three different sizes, using big endian ordering::
ru: Упаковывайте и распаковывайте целые числа трёх разных размеров, используя обратный порядок байтов:
