Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: A :exc:`ValueError` will be raised if :class:`Popen` is called with invalid arguments.
ja: 不正な引数で :class:`Popen` が呼ばれた場合は :exc:`ValueError` が発生します。
pt_pt: Uma :exc:`ValueError` será levantada se :class:`Popen` for chamado com argumentos inválidos.
ru: Ошибка :exc:`ValueError` будет вызвана, если :class:`Popen` вызывается с недопустимыми аргументами.

source: :func:`check_call` and :func:`check_output` will raise :exc:`CalledProcessError` if the called process returns a non-zero return code.
ja: 呼び出されたプロセスが非ゼロのリターンコードを返した場合 :func:`check_call` や :func:`check_output` は :exc:`CalledProcessError` を送出します。
pt_pt: :func:`check_call` e :func:`check_output` levantarão :exc:`CalledProcessError` se o processo chamado retornar um código de retorno diferente de zero.
ru: :func:`check_call` и :func:`check_output` вызовут :exc:`CalledProcessError`, если вызванный процесс возвращает ненулевой код возврата.

source: All of the functions and methods that accept a *timeout* parameter, such as :func:`run` and :meth:`Popen.communicate` will raise :exc:`TimeoutExpired` if the timeout expires before the process exits.
ja: Все функции и методы, принимающие параметр *timeout*, такие как :func:`run` и :meth:`Popen.communicate`, вызовут :exc:`TimeoutExpired`, если таймаут истечет до завершения процесса.
pt_pt: Todas as funções e métodos que aceitam um parâmetro *timeout*, como :func:`run` e :meth:`Popen.communicate`, levantarão :exc:`TimeoutExpired` se o timeout expirar antes de o processo terminar.

source: Exceptions defined in this module all inherit from :exc:`SubprocessError`.
ja: このモジュールで定義されたすべての例外は :exc:`SubprocessError` を継承しています。
pt_pt: Todas as exceções definidas neste módulo herdam de :exc:`SubprocessError`.
ru: Все исключения, определенные в этом модуле, наследуются от :exc:`SubprocessError`.

source: The :exc:`SubprocessError` base class was added.
ja: :exc:`SubprocessError` 基底クラスが追加されました。
pt_pt: A classe base :exc:`SubprocessError` foi adicionada.
ru: Был добавлен базовый класс :exc:`SubprocessError`.

source: Security Considerations
ja: セキュリティで考慮すべき点
pt_pt: Considerações de Segurança
ru: Вопросы безопасности

source: Unlike some other popen functions, this library will not implicitly choose to call a system shell. This means that all characters, including shell metacharacters, can safely be passed to child processes. If the shell is invoked explicitly, via ``shell=True``, it is the application's responsibility to ensure that all whitespace and metacharacters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. On :ref:`some platforms <shlex-quote-warning>`, it is possible to use :func:`shlex.quote` for this escaping.
ja: В отличие от некоторых других функций popen, эта библиотека не будет неявно вызывать системную оболочку. Это означает, что все символы, включая метасимволы оболочки, можно безопасно передавать дочерним процессам. Если оболочка вызывается явно, через ``shell=True``, приложение несет ответственность за то, чтобы все пробелы и метасимволы были заключены в кавычки соответствующим образом, чтобы избежать `` внедрения оболочки' <https://en.wikipedia.org/wiki/Shell_injection #Shell_injection>`_ уязвимости. На :ref:`некоторых платформах <shlex-quote-warning>` для этого экранирования можно использовать :func:`shlex.quote`.
pt_pt: Ao contrário de algumas outras funções popen, esta biblioteca não escolherá implicitamente chamar uma shell do sistema. Isto significa que todos os caracteres, incluindo metacaracteres da shell, podem ser passados com segurança para processos filhos. Se a shell for invocada explicitamente, via ``shell=True``, é responsabilidade da aplicação garantir que todos os espaços em branco e metacaracteres sejam colocados entre aspas de forma adequada para evitar vulnerabilidades de `injeção de shell <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. Em :ref:`algumas plataformas <shlex-quote-warning>`, é possível usar :func:`shlex.quote` para este escape.
ru: В отличие от некоторых других функций popen, эта библиотека не будет неявно вызывать системную оболочку. Это означает, что все символы, включая метасимволы оболочки, можно безопасно передавать дочерним процессам. Если оболочка вызывается явно, через ``shell=True``, приложение несет ответственность за то, чтобы все пробелы и метасимволы были заключены в кавычки соответствующим образом, чтобы избежать `` внедрения оболочки' <https://en.wikipedia.org/wiki/Shell_injection #Shell_injection>`_ уязвимости. На :ref:`некоторых платформах <shlex-quote-warning>` для этого экранирования можно использовать :func:`shlex.quote`.

source: On Windows, batch files (:file:`*.bat` or :file:`*.cmd`) may be launched by the operating system in a system shell regardless of the arguments passed to this library. This could result in arguments being parsed according to shell rules, but without any escaping added by Python. If you are intentionally launching a batch file with arguments from untrusted sources, consider passing ``shell=True`` to allow Python to escape special characters. See :gh:`114539` for additional discussion.
ja: В Windows пакетные файлы (:file:`*.bat` или :file:`*.cmd`) могут запускаться операционной системой в системной оболочке независимо от аргументов, переданных в эту библиотеку. Это может привести к анализу аргументов в соответствии с правилами оболочки, но без какого-либо экранирования, добавленного Python. Если вы намеренно запускаете пакетный файл с аргументами из ненадежных источников, рассмотрите возможность передачи ``shell=True``, чтобы Python мог экранировать специальные символы. Дополнительную информацию см. в :gh:`114539`.
pt_pt: No Windows, ficheiros batch (:file:`*.bat` ou :file:`*.cmd`) podem ser lançados pelo sistema operativo numa shell do sistema independentemente dos argumentos passados para esta biblioteca. Isto pode resultar em argumentos sendo analisados de acordo com as regras da shell, mas sem qualquer escape adicionado pelo Python. Se estiver a lançar intencionalmente um ficheiro batch com argumentos de fontes não confiáveis, considere passar ``shell=True`` para permitir que o Python faça escape de caracteres especiais. Consulte :gh:`114539` para discussão adicional.
ru: В Windows пакетные файлы (:file:`*.bat` или :file:`*.cmd`) могут запускаться операционной системой в системной оболочке независимо от аргументов, переданных в эту библиотеку. Это может привести к анализу аргументов в соответствии с правилами оболочки, но без какого-либо экранирования, добавленного Python. Если вы намеренно запускаете пакетный файл с аргументами из ненадежных источников, рассмотрите возможность передачи ``shell=True``, чтобы Python мог экранировать специальные символы. Дополнительную информацию см. в :gh:`114539`.

source: Popen Objects
ja: Popen オブジェクト
pt_pt: Objetos Popen
ru: Открытие объектов

source: Instances of the :class:`Popen` class have the following methods:
ja: :class:`Popen` クラスのインスタンスには、以下のようなメソッドがあります:
pt_pt: Instâncias da classe :class:`Popen` têm os seguintes métodos:
ru: Экземпляры класса :class:`Popen` имеют следующие методы:

source: Check if child process has terminated. Set and return :attr:`~Popen.returncode` attribute. Otherwise, returns ``None``.
ja: 子プロセスが終了しているかどうかを調べます。 :attr:`~Popen.returncode` 属性を設定して返します。そうでなければ ``None`` を返します。
pt_pt: Verifica se o processo filho terminou. Define e retorna o atributo :attr:`~Popen.returncode`. Caso contrário, retorna ``None``.
ru: Проверьте, завершился ли дочерний процесс. Установить и вернуть атрибут :attr:`~Popen.returncode`. В противном случае возвращается ``None``.

source: Wait for child process to terminate. Set and return :attr:`~Popen.returncode` attribute.
ja: 子プロセスが終了するまで待ちます。:attr:`~Popen.returncode` 属性を設定して返します。
pt_pt: Aguarda que o processo filho termine. Define e retorna o atributo :attr:`~Popen.returncode`.
ru: Подождите, пока дочерний процесс завершится. Установить и вернуть атрибут :attr:`~Popen.returncode`.

source: If the process does not terminate after *timeout* seconds, raise a :exc:`TimeoutExpired` exception. It is safe to catch this exception and retry the wait.
ja: プロセスが *timeout* 秒後に終了してない場合、:exc:`TimeoutExpired` 例外を送出します。この例外を捕捉して wait を再試行するのは安全です。
pt_pt: Se o processo não terminar após *timeout* segundos, levanta uma exceção :exc:`TimeoutExpired`. É seguro capturar esta exceção e tentar novamente a esperar.
ru: Если процесс не завершается по истечении *timeout* секунд, вызовите исключение :exc:`TimeoutExpired`. Это исключение можно безопасно перехватить и повторить ожидание.

source: This will deadlock when using ``stdout=PIPE`` or ``stderr=PIPE`` and the child process generates enough output to a pipe such that it blocks waiting for the OS pipe buffer to accept more data. Use :meth:`Popen.communicate` when using pipes to avoid that.
ja: ``stdout=PIPE`` や ``stderr=PIPE`` を使っていて、より多くのデータを受け入れるために OS のパイプバッファーをブロックしているパイプに子プロセスが十分な出力を生成した場合、デッドロックが発生します。これを避けるには :meth:`Popen.communicate` を使用してください。
pt_pt: Isto causará um bloqueio quando usar ``stdout=PIPE`` ou ``stderr=PIPE`` e o processo filho gerar saída suficiente para um pipe de forma a que bloqueie à espera que o buffer do pipe do sistema aceite mais dados. Use :meth:`Popen.communicate` ao usar pipes para evitar isso.
ru: Это приведет к тупиковой ситуации при использовании stdout=PIPE или stderr=PIPE, и дочерний процесс генерирует достаточно выходных данных в канал, так что он блокирует ожидание, пока буфер канала ОС примет больше данных. Чтобы избежать этого, используйте :meth:`Popen.communicate` при использовании каналов.

source: When the ``timeout`` parameter is not ``None``, then (on POSIX) the function is implemented using a busy loop (non-blocking call and short sleeps). Use the :mod:`asyncio` module for an asynchronous wait: see :class:`asyncio.create_subprocess_exec`.
ja: Если параметр ``timeout`` не равен ``None``, тогда (в POSIX) функция реализуется с использованием цикла занятости (неблокирующий вызов и короткие переходы в режим ожидания). Используйте модуль :mod:`asyncio` для асинхронного ожидания: см. :class:`asyncio.create_subprocess_exec`.
pt_pt: Quando o parâmetro ``timeout`` não for ``None``, então (em POSIX) a função é implementada usando um ciclo ocupado (chamada não bloqueante e pequenos intervalos de sono). Use o módulo :mod:`asyncio` para uma espera assíncrona: veja :class:`asyncio.create_subprocess_exec`.

source: *timeout* was added.
ja: *timeout* が追加されました
pt_pt: O parâmetro *timeout* foi adicionado.
ru: *тайм-аут* был добавлен.

source: Interact with process: Send data to stdin. Read data from stdout and stderr, until end-of-file is reached. Wait for process to terminate and set the :attr:`~Popen.returncode` attribute. The optional *input* argument should be data to be sent to the child process, or ``None``, if no data should be sent to the child. If streams were opened in text mode, *input* must be a string. Otherwise, it must be bytes.
ja: Взаємодія з процесом: надсилання даних на stdin. Читання даних із stdout і stderr, доки не буде досягнуто кінця файлу. Зачекайте, поки процес завершиться, і встановіть атрибут :attr:`~Popen.returncode`. Додатковий аргумент *input* має бути даними, які надсилаються дочірньому процесу, або ``None``, якщо дані не повинні надсилатися дочірньому процесу. Якщо потоки були відкриті в текстовому режимі, *введення* має бути рядком. В іншому випадку це повинні бути байти.
pt_pt: Interage com o processo: Envia dados para stdin. Lê dados de stdout e stderr, até que o fim do ficheiro seja atingido. Aguarda que o processo termine e define o atributo :attr:`~Popen.returncode`. O argumento opcional *input* deve ser os dados a enviar para o processo filho, ou ``None``, se nenhum dado deve ser enviado para o filho. Se os fluxos foram abertos em modo de texto, *input* deve ser uma string. Caso contrário, deve ser bytes.
ru: Взаимодействие с процессом: отправка данных на стандартный ввод. Считайте данные из stdout и stderr, пока не будет достигнут конец файла. Дождитесь завершения процесса и установите атрибут :attr:`~Popen.returncode`. Необязательный аргумент *input* должен быть данными, которые будут отправлены дочернему процессу, или ``None``, если никакие данные не должны отправляться дочернему процессу. Если потоки были открыты в текстовом режиме, *input* должен быть строкой. В противном случае это должны быть байты.

source: :meth:`communicate` returns a tuple ``(stdout_data, stderr_data)``. The data will be strings if streams were opened in text mode; otherwise, bytes.
ja: :meth:`communicate` повертає кортеж ``(stdout_data, stderr_data)``. Дані будуть рядками, якщо потоки були відкриті в текстовому режимі; інакше, байти.
pt_pt: :meth:`communicate` retorna um tuplo ``(stdout_data, stderr_data)``. Os dados serão strings se os fluxos foram abertos em modo de texto; caso contrário, bytes.
ru: :meth:`communicate` возвращает кортеж ``(stdout_data, stderr_data)``. Данные будут строками, если потоки открывались в текстовом режиме; в противном случае — байты.

source: Note that if you want to send data to the process's stdin, you need to create the Popen object with ``stdin=PIPE``. Similarly, to get anything other than ``None`` in the result tuple, you need to give ``stdout=PIPE`` and/or ``stderr=PIPE`` too.
ja: 子プロセスの標準入力にデータを送りたい場合は、 Popen オブジェクトを ``stdin=PIPE`` と指定して作成しなければなりません。同じく、戻り値のタプルから ``None`` ではない値を取得するためには、 ``stdout=PIPE`` かつ/または ``stderr=PIPE`` を指定しなければなりません。
pt_pt: Note que se pretender enviar dados para o stdin do processo, precisa de criar o objeto Popen com ``stdin=PIPE``. Da mesma forma, para obter algo diferente de ``None`` no tuplo de resultado, precisa de definir ``stdout=PIPE`` e/ou ``stderr=PIPE``.
ru: Обратите внимание: если вы хотите отправить данные на стандартный ввод процесса, вам необходимо создать объект Popen с помощью ``stdin=PIPE``. Аналогично, чтобы получить в кортеже результатов что-либо, кроме None, вам необходимо также указать stdout=PIPE и/или stderr=PIPE.

source: If the process does not terminate after *timeout* seconds, a :exc:`TimeoutExpired` exception will be raised. Catching this exception and retrying communication will not lose any output.
ja: プロセスが *timeout* 秒後に終了してない場合、:exc:`TimeoutExpired` 例外が送出されます。この例外を捕捉して通信を再試行しても出力データは失われません。
pt_pt: Se o processo não terminar após *timeout* segundos, uma exceção :exc:`TimeoutExpired` será levantada. Capturar esta exceção e tentar novamente a comunicação não perderá nenhuma saída.
ru: Если процесс не завершится по истечении *timeout* секунд, будет выдано исключение :exc:`TimeoutExpired`. Перехват этого исключения и повторная попытка связи не приведут к потере результатов.

source: The child process is not killed if the timeout expires, so in order to cleanup properly a well-behaved application should kill the child process and finish communication::
ja: タイムアウトが発生した場合子プロセスは kill されません。したがって、適切にクリーンアップを行うために、正常に動作するアプリケーションは子プロセスを kill して通信を終了すべきです::
pt_pt: O processo filho não é terminado se o timeout expirar, por isso, para limpar corretamente, uma aplicação bem comportada deve terminar o processo filho e finalizar a comunicação::
ru: Дочерний процесс не уничтожается по истечении тайм-аута, поэтому для правильной очистки корректное приложение должно завершить дочерний процесс и завершить связь:

source: The data read is buffered in memory, so do not use this method if the data size is large or unlimited.
ja: 受信したデータはメモリにバッファーされます。そのため、返されるデータが大きいかあるいは制限がないような場合はこのメソッドを使うべきではありません。
pt_pt: Os dados lidos são armazenados em buffer na memória, por isso não utilize este método se o tamanho dos dados for grande ou ilimitado.
ru: Считываемые данные буферизуются в памяти, поэтому не используйте этот метод, если размер данных большой или неограниченный.

source: Sends the signal *signal* to the child.
ja: *signal* シグナルを子プロセスに送ります。
pt_pt: Envía o sinal *signal* para o processo filho.
ru: Посылает сигнал *сигнал* ребенку.

source: Do nothing if the process completed.
ja: Нічого не робити, якщо процес завершено.
pt_pt: Não faz nada se o processo já terminou.
ru: Ничего не делайте, если процесс завершен.

source: On Windows, SIGTERM is an alias for :meth:`terminate`. CTRL_C_EVENT and CTRL_BREAK_EVENT can be sent to processes started with a *creationflags* parameter which includes ``CREATE_NEW_PROCESS_GROUP``.
ja: Windows では、SIGTERM は :meth:`terminate` の別名です。CTRL_C_EVENT と CTRL_BREAK_EVENT を、``CREATE_NEW_PROCESS_GROUP`` を含む *creationflags* で始まった、プロセスに送れます。
pt_pt: No Windows, SIGTERM é um alias para :meth:`terminate`. CTRL_C_EVENT e CTRL_BREAK_EVENT podem ser enviados para processos iniciados com um parâmetro *creationflags* que inclui ``CREATE_NEW_PROCESS_GROUP``.

source: Stop the child. On POSIX OSs the method sends :py:const:`~signal.SIGTERM` to the child. On Windows the Win32 API function :c:func:`!TerminateProcess` is called to stop the child.
ja: Остановите ребенка. В ОС POSIX метод отправляет дочернему элементу :py:const:`~signal.SIGTERM`. В Windows функция Win32 API :c:func:`!TerminateProcess` вызывается для остановки дочернего процесса.
pt_pt: Para o processo filho. Em sistemas POSIX, o método envia :py:const:`~signal.SIGTERM` para o processo filho. No Windows, a função da API Win32 :c:func:`!TerminateProcess` é chamada para parar o processo filho.

source: Kills the child. On POSIX OSs the function sends SIGKILL to the child. On Windows :meth:`kill` is an alias for :meth:`terminate`.
ja: 子プロセスを kill します。POSIX OS では SIGKILL シグナルを子プロセスに送ります。Windows では、:meth:`kill` は :meth:`terminate` の別名です。
pt_pt: Termina o processo filho. Em sistemas POSIX, a função envia SIGKILL para o processo filho. No Windows, :meth:`kill` é um alias para :meth:`terminate`.
ru: Убивает ребенка. В ОС POSIX функция отправляет SIGKILL дочернему элементу. В Windows :meth:`kill` является псевдонимом для :meth:`terminate`.

source: The following attributes are also set by the class for you to access. Reassigning them to new values is unsupported:
ja: Следующие атрибуты также устанавливаются классом для доступа. Переназначение им новых значений не поддерживается:
pt_pt: Os seguintes atributos também são definidos pela classe para que possa aceder. A reatribuição para novos valores não é suportada:
ru: Следующие атрибуты также устанавливаются классом для доступа. Переназначение им новых значений не поддерживается:

source: The *args* argument as it was passed to :class:`Popen` -- a sequence of program arguments or else a single string.
ja: :class:`Popen` に渡された引数 *args* です -- プログラム引数のシーケンスまたは 1 個の文字列になります。
pt_pt: O argumento *args* como foi passado para :class:`Popen` — uma sequência de argumentos de programa ou uma única string.
ru: Аргумент *args* в том виде, в каком он был передан :class:`Popen` — последовательность аргументов программы или одна строка.

source: If the *stdin* argument was :data:`PIPE`, this attribute is a writeable stream object as returned by :func:`open`. If the *encoding* or *errors* arguments were specified or the *text* or *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stdin* argument was not :data:`PIPE`, this attribute is ``None``.
ja: Если аргумент *stdin* был :data:`PIPE`, этот атрибут является записываемым объектом потока, возвращаемым :func:`open`. Если были указаны аргументы *encoding* или *errors* или аргумент *text* или *universal_newlines* имел значение «True», поток является текстовым потоком, в противном случае это поток байтов. Если аргумент *stdin* не был :data:`PIPE`, этот атрибут имеет значение ``None``.
pt_pt: Se o argumento *stdin* foi :data:`PIPE`, este atributo é um objeto de fluxo gravável como retornado por :func:`open`. Se os argumentos *encoding* ou *errors* foram especificados ou o argumento *text* ou *universal_newlines* foi ``True``, o fluxo é um fluxo de texto, caso contrário é um fluxo de bytes. Se o argumento *stdin* não foi :data:`PIPE`, este atributo é ``None``.
ru: Если аргумент *stdin* был :data:`PIPE`, этот атрибут является записываемым объектом потока, возвращаемым :func:`open`. Если были указаны аргументы *encoding* или *errors* или аргумент *text* или *universal_newlines* имел значение «True», поток является текстовым потоком, в противном случае это поток байтов. Если аргумент *stdin* не был :data:`PIPE`, этот атрибут имеет значение ``None``.

source: If the *stdout* argument was :data:`PIPE`, this attribute is a readable stream object as returned by :func:`open`. Reading from the stream provides output from the child process. If the *encoding* or *errors* arguments were specified or the *text* or *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stdout* argument was not :data:`PIPE`, this attribute is ``None``.
ja: Если аргумент *stdout* был :data:`PIPE`, этот атрибут является читаемым объектом потока, возвращаемым :func:`open`. Чтение из потока обеспечивает вывод дочернего процесса. Если были указаны аргументы *encoding* или *errors* или аргумент *text* или *universal_newlines* имел значение «True», поток является текстовым потоком, в противном случае это поток байтов. Если аргумент *stdout* не был :data:`PIPE`, этот атрибут имеет значение ``None``.
pt_pt: Se o argumento *stdout* foi :data:`PIPE`, este atributo é um objeto de fluxo legível como retornado por :func:`open`. A leitura do fluxo fornece a saída do processo filho. Se os argumentos *encoding* ou *errors* foram especificados ou o argumento *text* ou *universal_newlines* foi ``True``, o fluxo é um fluxo de texto, caso contrário é um fluxo de bytes. Se o argumento *stdout* não foi :data:`PIPE`, este atributo é ``None``.
ru: Если аргумент *stdout* был :data:`PIPE`, этот атрибут является читаемым объектом потока, возвращаемым :func:`open`. Чтение из потока обеспечивает вывод дочернего процесса. Если были указаны аргументы *encoding* или *errors* или аргумент *text* или *universal_newlines* имел значение «True», поток является текстовым потоком, в противном случае это поток байтов. Если аргумент *stdout* не был :data:`PIPE`, этот атрибут имеет значение ``None``.
