Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not inherit its parent's console. This value cannot be used with CREATE_NEW_CONSOLE.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не успадковуватиме батьківську консоль. Це значення не можна використовувати з CREATE_NEW_CONSOLE.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo não herdará a consola do seu pai. Este valor não pode ser usado com CREATE_NEW_CONSOLE.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс не будет наследовать консоль своего родителя. Это значение нельзя использовать с CREATE_NEW_CONSOLE.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process does not inherit the error mode of the calling process. Instead, the new process gets the default error mode. This feature is particularly useful for multithreaded shell applications that run with hard errors disabled.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не успадковує режим помилки процесу, що викликає. Натомість новий процес отримує стандартний режим помилки. Ця функція особливо корисна для багатопоточних програм оболонки, які працюють із вимкненими серйозними помилками.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo não herda o modo de erro do processo chamador. Em vez disso, o novo processo obtém o modo de erro predefinido. Esta funcionalidade é particularmente útil para aplicações shell multithread que são executadas com erros graves desativados.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс не наследует режим ошибки вызывающего процесса. Вместо этого новый процесс получает режим ошибок по умолчанию. Эта функция особенно полезна для многопоточных приложений оболочки, которые работают с отключенными серьезными ошибками.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process is not associated with the job.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не пов’язаний із завданням.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo não está associado ao trabalho.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс не связан с заданием.

source: Older high-level API
ja: 古い高水準 API
pt_pt: API de alto nível mais antiga
ru: Более старый высокоуровневый API

source: Prior to Python 3.5, these three functions comprised the high level API to subprocess. You can now use :func:`run` in many cases, but lots of existing code calls these functions.
ja: Python 3.5 より前のバージョンでは、サブプロセスに対して以下の 3 つの関数からなる高水準 API が用意されていました。現在多くの場合 :func:`run` の使用で済みますが、既存の多くのコードではこれらの関数が使用されています。
pt_pt: Antes do Python 3.5, estas três funções constituíam a API de alto nível para subprocesso. Agora pode usar :func:`run` em muitos casos, mas muito código existente chama estas funções.
ru: До Python 3.5 эти три функции включали API высокого уровня для подпроцесса. Теперь вы можете использовать :func:`run` во многих случаях, но многие существующие коды вызывают эти функции.

source: Run the command described by *args*. Wait for command to complete, then return the :attr:`~Popen.returncode` attribute.
ja: *args* で指定されたコマンドを実行します。コマンドの終了を待ち、:attr:`~Popen.returncode` 属性を返します。
pt_pt: Executa o comando descrito por *args*. Aguarda que o comando seja concluído, depois retorna o atributo :attr:`~Popen.returncode`.
ru: Запустите команду, описанную *args*. Дождитесь завершения команды, затем верните атрибут :attr:`~Popen.returncode`.

source: Code needing to capture stdout or stderr should use :func:`run` instead::
ja: Код, який потребує захоплення stdout або stderr, повинен використовувати замість цього :func:`run`::
pt_pt: Código que precise de capturar stdout ou stderr deve usar :func:`run` em vez disso::
ru: Код, которому необходимо захватить stdout или stderr, должен вместо этого использовать :func:`run`::

source: To suppress stdout or stderr, supply a value of :data:`DEVNULL`.
ja: Щоб придушити stdout або stderr, укажіть значення :data:`DEVNULL`.
pt_pt: Para suprimir stdout ou stderr, forneça um valor de :data:`DEVNULL`.
ru: Чтобы подавить стандартный вывод или стандартный поток ошибок, укажите значение :data:`DEVNULL`.

source: The arguments shown above are merely some common ones. The full function signature is the same as that of the :class:`Popen` constructor - this function passes all supplied arguments other than *timeout* directly through to that interface.
ja: 上記の引数は、よく使われるものだけ示しています。関数の全使用法は :class:`Popen` コンストラクターの内容と同じになります - この関数は、このインターフェースに直接指定される *timeout* 以外は与えられた全引数を渡します。
pt_pt: Os argumentos mostrados acima são apenas alguns comuns. A assinatura completa da função é a mesma que a do construtor :class:`Popen` — esta função passa todos os argumentos fornecidos, exceto *timeout*, diretamente para essa interface.
ru: Аргументы, показанные выше, являются лишь некоторыми общими. Полная сигнатура функции такая же, как у конструктора :class:`Popen` — эта функция передает все предоставленные аргументы, кроме *timeout*, непосредственно в этот интерфейс.

source: Do not use ``stdout=PIPE`` or ``stderr=PIPE`` with this function. The child process will block if it generates enough output to a pipe to fill up the OS pipe buffer as the pipes are not being read from.
ja: この関数を使用する際は ``stdout=PIPE`` および ``stderr=PIPE`` を使用しないでください。子プロセスが OS のパイプバッファーを埋めてしまうほどの出力データを生成した場合、パイプからは読み込まれないので、子プロセスがブロックされることがあります。
pt_pt: Não utilize ``stdout=PIPE`` ou ``stderr=PIPE`` com esta função. O processo filho ficará bloqueado se gerar saída suficiente para um pipe para encher o buffer do pipe do sistema operativo, uma vez que os pipes não estão a ser lidos.
ru: Не используйте stdout=PIPE или stderr=PIPE с этой функцией. Дочерний процесс заблокируется, если он сгенерирует достаточно выходных данных в канал для заполнения буфера канала ОС, поскольку каналы не считываются.

source: Run command with arguments. Wait for command to complete. If the return code was zero then return, otherwise raise :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute. If :func:`check_call` was unable to start the process it will propagate the exception that was raised.
ja: Виконати команду з аргументами. Дочекайтеся виконання команди. Якщо код повернення дорівнює нулю, тоді повертається, інакше викликається :exc:`CalledProcessError`. Об’єкт :exc:`CalledProcessError` матиме код повернення в атрибуті :attr:`~CalledProcessError.returncode`. Якщо :func:`check_call` не вдалося запустити процес, він поширить викликану виняткову ситуацію.
pt_pt: Executa comando com argumentos. Aguarda que o comando seja concluído. Se o código de retorno for zero, retorna; caso contrário, levanta :exc:`CalledProcessError`. O objeto :exc:`CalledProcessError` terá o código de retorno no atributo :attr:`~CalledProcessError.returncode`. Se :func:`check_call` não conseguir iniciar o processo, propagará a exceção que foi levantada.
ru: Запустить команду с аргументами. Дождитесь завершения команды. Если код возврата был нулевым, вернитесь, в противном случае вызовите :exc:`CalledProcessError`. Объект :exc:`CalledProcessError` будет иметь код возврата в атрибуте :attr:`~CalledProcessError.returncode`. Если :func:`check_call` не смог запустить процесс, он распространит возникшее исключение.

source: Run command with arguments and return its output.
ja: 引数でコマンドを実行し、その出力を返します。
pt_pt: Executa comando com argumentos e retorna a sua saída.
ru: Запустите команду с аргументами и верните ее вывод.

source: If the return code was non-zero it raises a :exc:`CalledProcessError`. The :exc:`CalledProcessError` object will have the return code in the :attr:`~CalledProcessError.returncode` attribute and any output in the :attr:`~CalledProcessError.output` attribute.
ja: コマンドのリターンコードが非ゼロならば :exc:`CalledProcessError` 例外が送出されます。:exc:`CalledProcessError` オブジェクトには、リターンコードが :attr:`~CalledProcessError.returncode` 属性に、コマンドからの出力が :attr:`~CalledProcessError.output` 属性に、それぞれ格納されています。
pt_pt: Se o código de retorno for diferente de zero, levanta uma :exc:`CalledProcessError`. O objeto :exc:`CalledProcessError` terá o código de retorno no atributo :attr:`~CalledProcessError.returncode` e qualquer saída no atributo :attr:`~CalledProcessError.output`.
ru: Если код возврата не равен нулю, возникает ошибка :exc:`CalledProcessError`. Объект :exc:`CalledProcessError` будет иметь код возврата в атрибуте :attr:`~CalledProcessError.returncode` и любые выходные данные в атрибуте :attr:`~CalledProcessError.output`.

source: This is equivalent to::
ja: これは次と等価です::
pt_pt: Isto é equivalente a::
ru: Это эквивалентно::

source: The arguments shown above are merely some common ones. The full function signature is largely the same as that of :func:`run` - most arguments are passed directly through to that interface. One API deviation from :func:`run` behavior exists: passing ``input=None`` will behave the same as ``input=b''`` (or ``input=''``, depending on other arguments) rather than using the parent's standard input file handle.
ja: Аргументи, наведені вище, є лише поширеними. Повний підпис функції здебільшого такий самий, як і :func:`run` - більшість аргументів передаються безпосередньо до цього інтерфейсу. Існує одне відхилення API від поведінки :func:`run`: передача ``input=None`` поводитиметься так само, як ``input=b''`` (або ``input=''``, залежно від інших аргументів ), а не використовувати стандартний дескриптор файлу введення батьківського.
pt_pt: Os argumentos mostrados acima são apenas alguns comuns. A assinatura completa da função é em grande parte a mesma que a de :func:`run` — a maioria dos argumentos são passados diretamente para essa interface. Existe uma divergência de API em relação ao comportamento de :func:`run`: passar ``input=None`` comportar-se-á da mesma forma que ``input=b''`` (ou ``input=''``, dependendo de outros argumentos) em vez de usar o descritor de ficheiro de entrada padrão do pai.
ru: Аргументы, показанные выше, являются лишь некоторыми общими. Полная сигнатура функции во многом такая же, как и у :func:`run` — большинство аргументов передаются непосредственно в этот интерфейс. Существует одно отклонение API от поведения :func:`run`: передача ``input=None`` будет вести себя так же, как ``input=b''`` (или ``input=''``, в зависимости от других аргументов. ), а не использовать стандартный дескриптор входного файла родительского элемента.

source: By default, this function will return the data as encoded bytes. The actual encoding of the output data may depend on the command being invoked, so the decoding to text will often need to be handled at the application level.
ja: デフォルトで、この関数はデータをエンコードされたバイトとして返します。出力されたデータの実際のエンコードは起動されているコマンドに依存するため、テキストへのデコードは通常アプリケーションレベルで扱う必要があります。
pt_pt: Por predefinição, esta função retornará os dados como bytes codificados. A codificação real dos dados de saída pode depender do comando que está a ser invocado, por isso a decodificação para texto muitas vezes precisará de ser tratada ao nível da aplicação.
ru: По умолчанию эта функция возвращает данные в виде закодированных байтов. Фактическое кодирование выходных данных может зависеть от вызываемой команды, поэтому декодирование в текст часто необходимо выполнять на уровне приложения.

source: This behaviour may be overridden by setting *text*, *encoding*, *errors*, or *universal_newlines* to ``True`` as described in :ref:`frequently-used-arguments` and :func:`run`.
ja: Цю поведінку можна змінити, встановивши для *text*, *encoding*, *errors* або *universal_newlines* значення ``True``, як описано в :ref:`frequently-used-arguments` і :func:`run`.
pt_pt: Este comportamento pode ser substituído definindo *text*, *encoding*, *errors* ou *universal_newlines* como ``True``, como descrito em :ref:`frequently-used-arguments` e :func:`run`.
ru: Это поведение можно переопределить, установив для *text*, *encoding*, *errors* или *universal_newlines* значение ``True``, как описано в :ref:`frequly-used-arguments` и :func:`run`.

source: To also capture standard error in the result, use ``stderr=subprocess.STDOUT``::
ja: 標準エラー出力も結果に含めるには、``stderr=subprocess.STDOUT`` を使います::
pt_pt: Para também capturar o erro padrão no resultado, use ``stderr=subprocess.STDOUT``::
ru: Чтобы также зафиксировать стандартную ошибку в результате, используйте ``stderr=subprocess.STDOUT``::

source: >>> subprocess.check_output( ... "ls non_existent_file; exit 0", ... stderr=subprocess.STDOUT, ... shell=True) 'ls: non_existent_file: No such file or directory\n'
pt_pt: >>> subprocess.check_output( ... "ls ficheiro_inexistente; exit 0", ... stderr=subprocess.STDOUT, ... shell=True) 'ls: ficheiro_inexistente: Não existe esse ficheiro ou diretório\n'

source: Support for the *input* keyword argument was added.
ja: キーワード引数 *input* が追加されました。
pt_pt: Foi adicionado suporte para o argumento de palavra-chave *input*.
ru: Добавлена ​​поддержка аргумента ключевого слова *input*.

source: *encoding* and *errors* were added. See :func:`run` for details.
ja: Додано *кодування* та *помилки*. Перегляньте :func:`run` для деталей.
pt_pt: *encoding* e *errors* foram adicionados. Veja :func:`run` para detalhes.
ru: Добавлены *кодировка* и *ошибки*. Подробности смотрите в :func:`run`.

source: Replacing Older Functions with the :mod:`subprocess` Module
ja: 古い関数を :mod:`subprocess` モジュールで置き換える
pt_pt: Substituir Funções Mais Antigas pelo Módulo :mod:`subprocess`
ru: Замена старых функций модулем :mod:`subprocess`

source: In this section, "a becomes b" means that b can be used as a replacement for a.
ja: この節では、 "a becomes b" と書かれているものは a の代替として b が使えるということを表します。
pt_pt: Nesta secção, "a torna-se b" significa que b pode ser usado como substituto para a.
ru: В этом разделе «a становится b» означает, что b можно использовать в качестве замены a.

source: All "a" functions in this section fail (more or less) silently if the executed program cannot be found; the "b" replacements raise :exc:`OSError` instead.
ja: この節で紹介されている "a" 関数は全て、実行するプログラムが見つからないときは (おおむね) 静かに終了します。それに対して "b" 代替手段は :exc:`OSError` 例外を送出します。
pt_pt: Todas as funções "a" nesta secção falham (mais ou menos) silenciosamente se o programa executado não puder ser encontrado; as substituições "b" levantam :exc:`OSError` em vez disso.
ru: Все функции «а» в этом разделе завершаются (более или менее) незаметно, если исполняемая программа не может быть найдена; замены «b» вместо этого вызывают :exc:`OSError`.

source: In addition, the replacements using :func:`check_output` will fail with a :exc:`CalledProcessError` if the requested operation produces a non-zero return code. The output is still available as the :attr:`~CalledProcessError.output` attribute of the raised exception.
ja: また、要求された操作が非ゼロの終了コードを返した場合、:func:`check_output` を使用した置き換えは :exc:`CalledProcessError` で失敗します。その出力は、送出された例外の :attr:`~CalledProcessError.output` 属性として利用可能です。
pt_pt: Além disso, as substituições que usam :func:`check_output` falharão com uma :exc:`CalledProcessError` se a operação solicitada produzir um código de retorno diferente de zero. A saída ainda está disponível como o atributo :attr:`~CalledProcessError.output` da exceção levantada.
ru: Кроме того, замены с использованием :func:`check_output` завершится ошибкой с :exc:`CalledProcessError`, если запрошенная операция выдает ненулевой код возврата. Вывод по-прежнему доступен как атрибут :attr:`~CalledProcessError.output` возникшего исключения.

source: In the following examples, we assume that the relevant functions have already been imported from the :mod:`subprocess` module.
ja: 以下の例では、適切な関数が :mod:`subprocess` モジュールからすでにインポートされていることを前提としています。
pt_pt: Nos exemplos seguintes, assumimos que as funções relevantes já foram importadas do módulo :mod:`subprocess`.
ru: В следующих примерах мы предполагаем, что соответствующие функции уже импортированы из модуля :mod:`subprocess`.

source: Replacing :program:`/bin/sh` shell command substitution
ja: Заміна команди оболонки :program:`/bin/sh`
pt_pt: Substituir a substituição de comando shell :program:`/bin/sh`
ru: Замена команды оболочки :program:`/bin/sh`

source: becomes::
ja: これは以下のようになります::
pt_pt: torna-se::
ru: становится::

source: Replacing shell pipeline
ja: シェルのパイプラインを置き換える
pt_pt: Substituir pipeline de shell
ru: Замена скорлупового трубопровода

source: p1 = Popen(["dmesg"], stdout=PIPE) p2 = Popen(["grep", "hda"], stdin=p1.stdout, stdout=PIPE) p1.stdout.close() # Allow p1 to receive a SIGPIPE if p2 exits. output = p2.communicate()[0]
pt_pt: p1 = Popen(["dmesg"], stdout=PIPE) p2 = Popen(["grep", "hda"], stdin=p1.stdout, stdout=PIPE) p1.stdout.close() # Permitir que p1 receba um SIGPIPE se p2 terminar. output = p2.communicate()[0]

source: The ``p1.stdout.close()`` call after starting the p2 is important in order for p1 to receive a SIGPIPE if p2 exits before p1.
ja: p2 を開始した後の ``p1.stdout.close()`` の呼び出しは、p1 が p2 の前に存在した場合に、p1 が SIGPIPE を受け取るために重要です。
pt_pt: A chamada ``p1.stdout.close()`` após iniciar p2 é importante para que p1 receba um SIGPIPE se p2 terminar antes de p1.
ru: Вызов p1.stdout.close() после запуска p2 важен для того, чтобы p1 получил SIGPIPE, если p2 завершает работу раньше p1.

source: Alternatively, for trusted input, the shell's own pipeline support may still be used directly:
ja: あるいは、信頼された入力に対しては、シェル自身のパイプラインサポートを直接使用することもできます:
pt_pt: Alternativamente, para entrada confiável, o suporte de pipeline da própria shell ainda pode ser usado diretamente:
ru: Альтернативно, для доверенного ввода можно напрямую использовать поддержку собственного конвейера оболочки:

source: Replacing :func:`os.system`
ja: :func:`os.system` を置き換える
pt_pt: Substituir :func:`os.system`
ru: Замена :func:`os.system`

source: sts = os.system("mycmd" + " myarg") # becomes retcode = call("mycmd" + " myarg", shell=True)
pt_pt: sts = os.system("mycmd" + " myarg") # torna-se retcode = call("mycmd" + " myarg", shell=True)

source: Notes:
ja: 注釈:
pt_pt: Notas:
ru: Примечания:

source: Calling the program through the shell is usually not required.
ja: このプログラムは普通シェル経由で呼び出す必要はありません。
pt_pt: Chamar o programa através da shell geralmente não é necessário.
ru: Вызов программы через оболочку обычно не требуется.

source: The :func:`call` return value is encoded differently to that of :func:`os.system`.
ja: Повернене значення :func:`call` кодується інакше, ніж значення :func:`os.system`.
pt_pt: O valor de retorno de :func:`call` é codificado de forma diferente do de :func:`os.system`.
ru: Возвращаемое значение :func:`call` кодируется иначе, чем :func:`os.system`.

source: The :func:`os.system` function ignores SIGINT and SIGQUIT signals while the command is running, but the caller must do this separately when using the :mod:`subprocess` module.
ja: Функція :func:`os.system` ігнорує сигнали SIGINT і SIGQUIT під час виконання команди, але абонент, що викликає, повинен робити це окремо, коли використовується модуль :mod:`subprocess`.
pt_pt: A função :func:`os.system` ignora os sinais SIGINT e SIGQUIT enquanto o comando está a ser executado, mas o chamador deve fazer isto separadamente ao usar o módulo :mod:`subprocess`.
ru: Функция :func:`os.system` игнорирует сигналы SIGINT и SIGQUIT во время выполнения команды, но вызывающая сторона должна делать это отдельно при использовании модуля :mod:`subprocess`.

source: A more realistic example would look like this::
ja: より現実的な例ではこうなるでしょう::
pt_pt: Um exemplo mais realista seria assim::
ru: Более реалистичный пример будет выглядеть так:

source: try: retcode = call("mycmd" + " myarg", shell=True) if retcode < 0: print("Child was terminated by signal", -retcode, file=sys.stderr) else: print("Child returned", retcode, file=sys.stderr) except OSError as e: print("Execution failed:", e, file=sys.stderr)
pt_pt: try: retcode = call("mycmd" + " myarg", shell=True) if retcode < 0: print("O processo filho foi terminado por um sinal", -retcode, file=sys.stderr) else: print("O processo filho retornou", retcode, file=sys.stderr) except OSError as e: print("A execução falhou:", e, file=sys.stderr)

source: Replacing the :func:`os.spawn <os.spawnl>` family
ja: :func:`os.spawn <os.spawnl>` 関数群を置き換える
pt_pt: Substituir a família :func:`os.spawn <os.spawnl>`
ru: Замена семейства :func:`os.spawn <os.spawnl>`

source: P_NOWAIT example::
ja: P_NOWAIT の例::
pt_pt: Exemplo P_NOWAIT::
ru: Пример P_NOWAIT::

source: P_WAIT example::
ja: P_WAIT の例::
pt_pt: Exemplo P_WAIT::
ru: Пример P_WAIT::

source: Vector example::
ja: シーケンスを使った例::
pt_pt: Exemplo vetorial::
ru: Векторный пример::

source: Environment example::
ja: 環境変数を使った例::
pt_pt: Exemplo de ambiente::
ru: Пример окружающей среды::

source: Replacing :func:`os.popen`
pt_pt: Substituir :func:`os.popen`

source: Return code handling translates as follows::
ja: 終了コードハンドリングは以下のように解釈します::
pt_pt: O tratamento do código de retorno traduz-se como segue::
ru: Обработка кода возврата переводится следующим образом:

source: pipe = os.popen(cmd, 'w') ... rc = pipe.close() if rc is not None and rc >> 8: print("There were some errors") ==> process = Popen(cmd, stdin=PIPE) ... process.stdin.close() if process.wait() != 0: print("There were some errors")
pt_pt: pipe = os.popen(cmd, 'w') ... rc = pipe.close() if rc is not None and rc >> 8: print("Ocorreram alguns erros") ==> process = Popen(cmd, stdin=PIPE) ... process.stdin.close() if process.wait() != 0: print("Ocorreram alguns erros")

source: Legacy Shell Invocation Functions
ja: レガシーなシェル呼び出し関数
pt_pt: Funções de Invocação de Shell Legadas
ru: Устаревшие функции вызова оболочки

source: This module also provides the following legacy functions from the 2.x ``commands`` module. These operations implicitly invoke the system shell and none of the guarantees described above regarding security and exception handling consistency are valid for these functions.
ja: このモジュールでは、以下のような 2.x ``commands`` モジュールからのレガシー関数も提供しています。これらの操作は、暗黙的にシステムシェルを起動します。また、セキュリティに関して上述した保証や例外処理一貫性は、これらの関数では有効ではありません。
pt_pt: Este módulo também fornece as seguintes funções legadas do módulo 2.x ``commands``. Estas operações invocam implicitamente a shell do sistema e nenhuma das garantias descritas acima em relação à segurança e consistência do tratamento de exceções são válidas para estas funções.
ru: Этот модуль также предоставляет следующие устаревшие функции из модуля ``commands`` версии 2.x. Эти операции неявно вызывают системную оболочку, и ни одна из описанных выше гарантий относительно безопасности и согласованности обработки исключений недействительна для этих функций.

source: Return ``(exitcode, output)`` of executing *cmd* in a shell.
ja: シェル中の *cmd* を実行して ``(exitcode, output)`` を返します。
pt_pt: Retorna ``(exitcode, output)`` da execução de *cmd* numa shell.
ru: Возврат ``(exitcode, output)`` выполнения *cmd* в оболочке.

source: Execute the string *cmd* in a shell with :func:`check_output` and return a 2-tuple ``(exitcode, output)``. *encoding* and *errors* are used to decode output; see the notes on :ref:`frequently-used-arguments` for more details.
pt_pt: Executa a string *cmd* numa shell com :func:`check_output` e retorna um 2-tuplo ``(exitcode, output)``. *encoding* e *errors* são usados para decodificar a saída; veja as notas em :ref:`frequently-used-arguments` para mais detalhes.
