Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: If *close_fds* is true, all file descriptors except ``0``, ``1`` and ``2`` will be closed before the child process is executed. Otherwise when *close_fds* is false, file descriptors obey their inheritable flag as described in :ref:`fd_inheritance`.
ja: Если *close_fds* имеет значение true, все файловые дескрипторы, кроме ``0``, ``1`` и ``2``, будут закрыты перед выполнением дочернего процесса. В противном случае, когда *close_fds* имеет значение false, файловые дескрипторы подчиняются своему флагу наследования, как описано в :ref:`fd_inheritance`.
pt_pt: Se *close_fds* for verdadeiro, todos os descritores de ficheiro exceto ``0``, ``1`` e ``2`` serão fechados antes da execução do processo filho. Caso contrário, quando *close_fds* for falso, os descritores de ficheiro obedecem à sua flag herdável como descrito em :ref:`fd_inheritance`.

source: On Windows, if *close_fds* is true then no handles will be inherited by the child process unless explicitly passed in the ``handle_list`` element of :attr:`STARTUPINFO.lpAttributeList`, or by standard handle redirection.
ja: У Windows, якщо *close_fds* має значення true, дочірній процес не успадкує жодних дескрипторів, якщо вони явно не передані в елементі ``handle_list`` :attr:`STARTUPINFO.lpAttributeList` або за допомогою стандартного переспрямування дескриптора.
pt_pt: No Windows, se *close_fds* for verdadeiro, então nenhum *handle* será herdado pelo processo filho, a menos que seja explicitamente passado no elemento ``handle_list`` de :attr:`STARTUPINFO.lpAttributeList`, ou por redirecionamento padrão de *handles*.
ru: В Windows, если *close_fds* имеет значение true, то никакие дескрипторы не будут унаследованы дочерним процессом, если они не будут явно переданы в элементе ``handle_list`` :attr:`STARTUPINFO.lpAttributeList` или посредством стандартного перенаправления дескрипторов.

source: The default for *close_fds* was changed from :const:`False` to what is described above.
ja: *close_fds* のデフォルトは、:const:`False` から上記のものに変更されました。
pt_pt: O valor predefinido para *close_fds* foi alterado de :const:`False` para o descrito acima.
ru: Значение по умолчанию для *close_fds* было изменено с :const:`False` на то, что описано выше.

source: On Windows the default for *close_fds* was changed from :const:`False` to :const:`True` when redirecting the standard handles. It's now possible to set *close_fds* to :const:`True` when redirecting the standard handles.
ja: У Windows типове значення для *close_fds* було змінено з :const:`False` на :const:`True` під час переспрямування стандартних дескрипторів. Тепер можна встановити *close_fds* на :const:`True` під час перенаправлення стандартних дескрипторів.
pt_pt: No Windows, o valor predefinido para *close_fds* foi alterado de :const:`False` para :const:`True` ao redirecionar os *handles* padrão. Agora é possível definir *close_fds* como :const:`True` ao redirecionar os *handles* padrão.
ru: В Windows значение по умолчанию для *close_fds* было изменено с :const:`False` на :const:`True` при перенаправлении стандартных дескрипторов. Теперь можно установить для *close_fds* значение :const:`True` при перенаправлении стандартных дескрипторов.

source: *pass_fds* is an optional sequence of file descriptors to keep open between the parent and child. Providing any *pass_fds* forces *close_fds* to be :const:`True`. (POSIX only)
ja: *pass_fds* はオプションで、親と子の間で開いたままにしておくファイル記述子のシーケンスを指定します。何らかの *pass_fds* を渡した場合、*close_fds* は強制的に :const:`True` になります。(POSIXのみ)
pt_pt: *pass_fds* é uma sequência opcional de descritores de ficheiro a manter abertos entre o processo pai e filho. Fornecer quaisquer *pass_fds* obriga *close_fds* a ser :const:`True`. (Apenas POSIX)
ru: *pass_fds* — это необязательная последовательность файловых дескрипторов, которая должна оставаться открытой между родительским и дочерним файлами. Предоставление любого *pass_fds* приводит к тому, что *close_fds* становится :const:`True`. (только POSIX)

source: The *pass_fds* parameter was added.
ja: *pass_fds* 引数が追加されました。
pt_pt: O parâmetro *pass_fds* foi adicionado.
ru: Добавлен параметр *pass_fds*.

source: If *cwd* is not ``None``, the function changes the working directory to *cwd* before executing the child. *cwd* can be a string, bytes or :term:`path-like <path-like object>` object. On POSIX, the function looks for *executable* (or for the first item in *args*) relative to *cwd* if the executable path is a relative path.
ja: Якщо *cwd* не є ``None``, функція змінює робочий каталог на *cwd* перед виконанням дочірнього елемента. *cwd* може бути рядком, байтами або об’єктом :term:`path-like <path-like object>`. У POSIX функція шукає *виконуваний файл* (або перший елемент у *args*) відносно *cwd*, якщо шлях до виконуваного файлу є відносним.
pt_pt: Se *cwd* não for ``None``, a função altera o diretório de trabalho para *cwd* antes de executar o processo filho. *cwd* pode ser uma string, bytes ou um objeto :term:`semelhante a um caminho <path-like object>`. Em POSIX, a função procura por *executable* (ou pelo primeiro item em *args*) em relação a *cwd* se o caminho do executável for um caminho relativo.
ru: Если *cwd* не ``None``, функция меняет рабочий каталог на *cwd* перед выполнением дочернего процесса. *cwd* может быть строкой, байтами или :term:`path-like <path-like object>` объектом. В POSIX функция ищет *исполняемый файл* (или первый элемент в *args*) относительно *cwd*, если путь к исполняемому файлу является относительным.

source: *cwd* parameter accepts a :term:`path-like object` on POSIX.
ja: *cwd* 引数が POSIX で :term:`path-like object` を受け付けるようになりました。
pt_pt: O parâmetro *cwd* aceita um :term:`objeto semelhante a um caminho` em POSIX.
ru: Параметр *cwd* принимает объект, похожий на путь, в POSIX.

source: *cwd* parameter accepts a :term:`path-like object` on Windows.
ja: *cwd* 引数が Windows で :term:`path-like object` を受け付けるようになりました。
pt_pt: O parâmetro *cwd* aceita um :term:`objeto semelhante a um caminho` no Windows.
ru: Параметр *cwd* принимает объект, похожий на путь, в Windows.

source: *cwd* parameter accepts a bytes object on Windows.
ja: *cwd* 引数が Windows で bytes オブジェクトを受け付けるようになりました。
pt_pt: O parâmetro *cwd* aceita um objeto bytes no Windows.
ru: Параметр *cwd* принимает объект байтов в Windows.

source: If *restore_signals* is true (the default) all signals that Python has set to SIG_IGN are restored to SIG_DFL in the child process before the exec. Currently this includes the SIGPIPE, SIGXFZ and SIGXFSZ signals. (POSIX only)
ja: *restore_signals* が真の場合 (デフォルト)、Python が SIG_IGN に設定したすべてのシグナルは子プロセスが exec される前に子プロセスの SIG_DFL に格納されます。現在これには SIGPIPE, SIGXFZ および SIGXFSZ シグナルが含まれています。(POSIX のみ)
pt_pt: Se *restore_signals* for verdadeiro (o predefinido), todos os sinais que o Python definiu para SIG_IGN são restaurados para SIG_DFL no processo filho antes do exec. Atualmente, isto inclui os sinais SIGPIPE, SIGXFZ e SIGXFSZ. (Apenas POSIX)
ru: Если *restore_signals* имеет значение true (по умолчанию), все сигналы, которым Python установил значение SIG_IGN, восстанавливаются до SIG_DFL в дочернем процессе перед выполнением. В настоящее время сюда входят сигналы SIGPIPE, SIGXFZ и SIGXFSZ. (только POSIX)

source: *restore_signals* was added.
ja: *restore_signals* が追加されました。
pt_pt: O parâmetro *restore_signals* foi adicionado.
ru: *restore_signals* был добавлен.

source: If *start_new_session* is true the ``setsid()`` system call will be made in the child process prior to the execution of the subprocess.
ja: Если *start_new_session* имеет значение true, системный вызов setsid() будет выполнен в дочернем процессе перед выполнением подпроцесса.
pt_pt: Se *start_new_session* for verdadeiro, a chamada de sistema ``setsid()`` será feita no processo filho antes da execução do subprocesso.

source: *start_new_session* was added.
ja: *start_new_session* が追加されました。
pt_pt: O parâmetro *start_new_session* foi adicionado.
ru: Была добавлена функция *start_new_session*.

source: If *process_group* is a non-negative integer, the ``setpgid(0, value)`` system call will be made in the child process prior to the execution of the subprocess.
ja: Если *process_group* является неотрицательным целым числом, системный вызов ``setpgid(0, value)`` будет выполнен в дочернем процессе перед выполнением подпроцесса.
pt_pt: Se *process_group* for um inteiro não negativo, a chamada de sistema ``setpgid(0, value)`` será feita no processo filho antes da execução do subprocesso.

source: *process_group* was added.
ja: *process_group* была добавлена.
pt_pt: O parâmetro *process_group* foi adicionado.

source: If *group* is not ``None``, the setregid() system call will be made in the child process prior to the execution of the subprocess. If the provided value is a string, it will be looked up via :func:`grp.getgrnam` and the value in ``gr_gid`` will be used. If the value is an integer, it will be passed verbatim. (POSIX only)
ja: Если *group* не имеет значения None, системный вызов setregid() будет выполнен в дочернем процессе перед выполнением подпроцесса. Если предоставленное значение является строкой, оно будет найдено через :func:`grp.getgrnam` и будет использовано значение из ``gr_gid``. Если значение является целым числом, оно будет передано дословно. (только POSIX)
pt_pt: Se *group* não for ``None``, a chamada de sistema setregid() será feita no processo filho antes da execução do subprocesso. Se o valor fornecido for uma string, será procurado via :func:`grp.getgrnam` e o valor em ``gr_gid`` será usado. Se o valor for um inteiro, será passado literalmente. (Apenas POSIX)

source: If *extra_groups* is not ``None``, the setgroups() system call will be made in the child process prior to the execution of the subprocess. Strings provided in *extra_groups* will be looked up via :func:`grp.getgrnam` and the values in ``gr_gid`` will be used. Integer values will be passed verbatim. (POSIX only)
ja: Если *extra_groups* не имеет значения None, системный вызов setgroups() будет выполнен в дочернем процессе до выполнения подпроцесса. Строки, указанные в *extra_groups*, будут искаться через :func:`grp.getgrnam` и будут использоваться значения из ``gr_gid``. Целочисленные значения будут передаваться дословно. (только POSIX)
pt_pt: Se *extra_groups* não for ``None``, a chamada de sistema setgroups() será feita no processo filho antes da execução do subprocesso. Strings fornecidas em *extra_groups* serão procuradas via :func:`grp.getgrnam` e os valores em ``gr_gid`` serão usados. Valores inteiros serão passados literalmente. (Apenas POSIX)

source: If *user* is not ``None``, the setreuid() system call will be made in the child process prior to the execution of the subprocess. If the provided value is a string, it will be looked up via :func:`pwd.getpwnam` and the value in ``pw_uid`` will be used. If the value is an integer, it will be passed verbatim. (POSIX only)
ja: Если *user* не имеет значения None, системный вызов setreuid() будет выполнен в дочернем процессе перед выполнением подпроцесса. Если предоставленное значение является строкой, оно будет найдено через :func:`pwd.getpwnam` и будет использовано значение из ``pw_uid``. Если значение является целым числом, оно будет передано дословно. (только POSIX)
pt_pt: Se *user* não for ``None``, a chamada de sistema setreuid() será feita no processo filho antes da execução do subprocesso. Se o valor fornecido for uma string, será procurado via :func:`pwd.getpwnam` e o valor em ``pw_uid`` será usado. Se o valor for um inteiro, será passado literalmente. (Apenas POSIX)

source: If *umask* is not negative, the umask() system call will be made in the child process prior to the execution of the subprocess.
ja: Якщо *umask* не є негативним, системний виклик umask() буде здійснено в дочірньому процесі перед виконанням підпроцесу.
pt_pt: Se *umask* não for negativo, a chamada de sistema umask() será feita no processo filho antes da execução do subprocesso.
ru: Если *umask* не является отрицательным, системный вызов umask() будет выполнен в дочернем процессе перед выполнением подпроцесса.

source: If *env* is not ``None``, it must be a mapping that defines the environment variables for the new process; these are used instead of the default behavior of inheriting the current process' environment. This mapping can be str to str on any platform or bytes to bytes on POSIX platforms much like :data:`os.environ` or :data:`os.environb`.
ja: *env* が ``None`` 以外の場合、これは新しいプロセスでの環境変数を定義します。デフォルトでは、子プロセスは現在のプロセスの環境変数を引き継ぎます。あらゆるプラットフォームで :data:`os.environ` のように文字列から文字列へ、またPOSIX プラットフォームにおいては :data:`os.environb` のようにバイトからバイトへも、定義すること出来ます。
pt_pt: Se *env* não for ``None``, deve ser um mapeamento que define as variáveis de ambiente para o novo processo; estas são usadas em vez do comportamento predefinido de herdar o ambiente do processo atual. Este mapeamento pode ser str para str em qualquer plataforma ou bytes para bytes em plataformas POSIX, tal como :data:`os.environ` ou :data:`os.environb`.
ru: Если *env* не имеет значения None, это должно быть отображение, определяющее переменные среды для нового процесса; они используются вместо стандартного поведения при наследовании среды текущего процесса. Это сопоставление может быть строкой в ​​строку на любой платформе или байтами в байты на платформах POSIX, подобно :data:`os.environ` или :data:`os.environb`.

source: If specified, *env* must provide any variables required for the program to execute. On Windows, in order to run a `side-by-side assembly`_ the specified *env* **must** include a valid ``%SystemRoot%``.
pt_pt: Se especificado, *env* deve fornecer quaisquer variáveis necessárias para a execução do programa. No Windows, para executar um `side-by-side assembly`_, o *env* especificado **deve** incluir um ``%SystemRoot%`` válido.

source: If *encoding* or *errors* are specified, or *text* is true, the file objects *stdin*, *stdout* and *stderr* are opened in text mode with the specified *encoding* and *errors*, as described above in :ref:`frequently-used-arguments`. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
ja: Если указаны *encoding* или *errors* или *text* имеет значение true, файловые объекты *stdin*, *stdout* и *stderr* открываются в текстовом режиме с указанными *кодировкой* и *errors*, как описано. выше в разделе :ref:`часто используемые-аргументы`. Аргумент *universal_newlines* эквивалентен *text* и предоставляется для обратной совместимости. По умолчанию файловые объекты открываются в двоичном режиме.
pt_pt: Se *encoding* ou *errors* forem especificados, ou *text* for verdadeiro, os objetos de ficheiro *stdin*, *stdout* e *stderr* são abertos em modo de texto com o *encoding* e *errors* especificados, como descrito acima em :ref:`frequently-used-arguments`. O argumento *universal_newlines* é equivalente a *text* e é fornecido para compatibilidade retroativa. Por predefinição, os objetos de ficheiro são abertos em modo binário.

source: *encoding* and *errors* were added.
ja: *encoding* と *errors* が追加されました。
pt_pt: Os parâmetros *encoding* e *errors* foram adicionados.
ru: Добавлены *кодировка* и *ошибки*.

source: *text* was added as a more readable alias for *universal_newlines*.
ja: *text* が、*universal_newlines* のより読みやすい別名として追加されました。
pt_pt: O parâmetro *text* foi adicionado como um alias mais legível para *universal_newlines*.
ru: *text* был добавлен как более читаемый псевдоним для *universal_newlines*.

source: If given, *startupinfo* will be a :class:`STARTUPINFO` object, which is passed to the underlying ``CreateProcess`` function.
ja: Если задано, *startupinfo* будет объектом :class:`STARTUPINFO`, который передается базовой функции ``CreateProcess``.
pt_pt: Se fornecido, *startupinfo* será um objeto :class:`STARTUPINFO`, que é passado para a função subjacente ``CreateProcess``.

source: If given, *creationflags*, can be one or more of the following flags:
ja: Если задано, *creationflags* может быть одним или несколькими из следующих флагов:
pt_pt: Se fornecido, *creationflags* pode ser uma ou mais das seguintes flags:

source: *pipesize* can be used to change the size of the pipe when :data:`PIPE` is used for *stdin*, *stdout* or *stderr*. The size of the pipe is only changed on platforms that support this (only Linux at this time of writing). Other platforms will ignore this parameter.
ja: *pipesize* можна використовувати для зміни розміру каналу, коли :data:`PIPE` використовується для *stdin*, *stdout* або *stderr*. Розмір каналу змінюється лише на платформах, які підтримують це (лише Linux на даний момент). Інші платформи ігноруватимуть цей параметр.
pt_pt: *pipesize* pode ser usado para alterar o tamanho do pipe quando :data:`PIPE` é usado para *stdin*, *stdout* ou *stderr*. O tamanho do pipe só é alterado em plataformas que suportam isto (apenas Linux no momento da escrita). Outras plataformas ignorarão este parâmetro.
ru: *pipesize* можно использовать для изменения размера канала, когда :data:`PIPE` используется для *stdin*, *stdout* или *stderr*. Размер канала изменяется только на платформах, которые это поддерживают (на момент написания статьи только Linux). Другие платформы будут игнорировать этот параметр.

source: Added the *pipesize* parameter.
ja: Добавлен параметр *pipesize*.
pt_pt: O parâmetro *pipesize* foi adicionado.

source: Popen objects are supported as context managers via the :keyword:`with` statement: on exit, standard file descriptors are closed, and the process is waited for. ::
ja: Popen オブジェクトは :keyword:`with` 文によってコンテキストマネージャーとしてサポートされます: 終了時には標準ファイル記述子が閉じられ、プロセスを待機します::
pt_pt: Os objetos Popen são suportados como gestores de contexto através da instrução :keyword:`with`: na saída, os descritores de ficheiro padrão são fechados e o processo é aguardado. ::
ru: Объекты Popen поддерживаются в качестве менеджеров контекста с помощью оператора :keyword:`with`: при выходе стандартные файловые дескрипторы закрываются и процесс ожидает завершения. ::

source: Popen and the other functions in this module that use it raise an :ref:`auditing event <auditing>` ``subprocess.Popen`` with arguments ``executable``, ``args``, ``cwd``, and ``env``. The value for ``args`` may be a single string or a list of strings, depending on platform.
ja: Popen та інші функції в цьому модулі, які його використовують, викликають :ref:`подію аудиту <auditing>` ``subprocess.Popen`` з аргументами ``executable``, ``args``, ``cwd`` і ``env``. Значення для ``args`` може бути одним рядком або списком рядків, залежно від платформи.
pt_pt: Popen e as outras funções neste módulo que o usam levantam um :ref:`evento de auditoria <auditing>` ``subprocess.Popen`` com argumentos ``executable``, ``args``, ``cwd`` e ``env``. O valor para ``args`` pode ser uma única string ou uma lista de strings, dependendo da plataforma.
ru: Popen и другие функции в этом модуле, которые его используют, вызывают событие аудита <auditing>``subprocess.Popen`` с аргументами ``executable``, ``args``, ``cwd``, и ``окр``. Значением args может быть одна строка или список строк, в зависимости от платформы.

source: Added context manager support.
ja: コンテキストマネージャーサポートが追加されました。
pt_pt: Suporte para gestor de contexto adicionado.
ru: Добавлена ​​поддержка контекстного менеджера.

source: Popen destructor now emits a :exc:`ResourceWarning` warning if the child process is still running.
ja: Деструктор Popen тепер видає попередження :exc:`ResourceWarning`, якщо дочірній процес все ще виконується.
pt_pt: O destrutor de Popen agora emite um aviso :exc:`ResourceWarning` se o processo filho ainda estiver em execução.
ru: Деструктор Popen теперь выдает предупреждение :exc:`ResourceWarning`, если дочерний процесс все еще работает.

source: Popen can use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, Popen constructor using :func:`os.posix_spawn` no longer raise an exception on errors like missing program, but the child process fails with a non-zero :attr:`~Popen.returncode`.
ja: Popen може використовувати :func:`os.posix_spawn` у деяких випадках для кращої продуктивності. У підсистемі Windows для Linux і емуляції користувача QEMU конструктор Popen, що використовує :func:`os.posix_spawn`, більше не створює виняток у разі помилки, як-от відсутня програма, але дочірній процес завершується помилкою з ненульовим :attr:`~Popen.returncode`.
pt_pt: Popen pode usar :func:`os.posix_spawn` em alguns casos para melhor desempenho. No Windows Subsystem for Linux e na Emulação de Utilizador QEMU, o construtor Popen usando :func:`os.posix_spawn` já não levanta uma exceção em erros como programa em falta, mas o processo filho falha com um :attr:`~Popen.returncode` diferente de zero.
ru: Popen может использовать :func:`os.posix_spawn` в некоторых случаях для повышения производительности. В подсистеме Windows для Linux и пользовательской эмуляции QEMU конструктор Popen, использующий :func:`os.posix_spawn`, больше не вызывает исключение при таких ошибках, как отсутствие программы, но дочерний процесс завершается с ошибкой с ненулевым :attr:`~Popen.returncode `.

source: Exceptions
ja: 例外
pt_pt: Exceções
ru: Исключения

source: Exceptions raised in the child process, before the new program has started to execute, will be re-raised in the parent.
ja: Винятки, створені в дочірньому процесі, перш ніж нова програма почне виконуватися, будуть повторно викликані в батьківському.
pt_pt: Exceções levantadas no processo filho, antes do novo programa começar a executar, serão relançadas no processo pai.
ru: Исключения, возникшие в дочернем процессе до начала выполнения новой программы, будут повторно вызваны в родительском процессе.

source: The most common exception raised is :exc:`OSError`. This occurs, for example, when trying to execute a non-existent file. Applications should prepare for :exc:`OSError` exceptions. Note that, when ``shell=True``, :exc:`OSError` will be raised by the child only if the selected shell itself was not found. To determine if the shell failed to find the requested application, it is necessary to check the return code or output from the subprocess.
ja: Найпоширенішим винятком є :exc:`OSError`. Це відбувається, наприклад, при спробі запустити неіснуючий файл. Програми повинні підготуватися до винятків :exc:`OSError`. Зауважте, що коли ``shell=True``, :exc:`OSError` буде викликано дочірнім елементом, лише якщо саму вибрану оболонку не знайдено. Щоб визначити, чи не вдалося командній оболонці знайти запитану програму, необхідно перевірити код повернення або вихідні дані підпроцесу.
pt_pt: A exceção mais comum levantada é :exc:`OSError`. Isto ocorre, por exemplo, ao tentar executar um ficheiro inexistente. As aplicações devem estar preparadas para exceções :exc:`OSError`. Note que, quando ``shell=True``, :exc:`OSError` só será levantada pelo processo filho se a shell selecionada não for encontrada. Para determinar se a shell falhou ao encontrar a aplicação solicitada, é necessário verificar o código de retorno ou a saída do subprocesso.
ru: Наиболее частым исключением является :exc:`OSError`. Это происходит, например, при попытке выполнить несуществующий файл. Приложения должны быть готовы к исключениям :exc:`OSError`. Обратите внимание, что когда ``shell=True``, :exc:`OSError` будет вызван дочерним элементом только в том случае, если сама выбранная оболочка не была найдена. Чтобы определить, не удалось ли оболочке найти запрошенное приложение, необходимо проверить код возврата или выходные данные подпроцесса.
