Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: Resolving the path of *executable* (or the first item of *args*) is platform dependent. For POSIX, see :meth:`os.execvpe`, and note that when resolving or searching for the executable path, *cwd* overrides the current working directory and *env* can override the ``PATH`` environment variable. For Windows, see the documentation of the ``lpApplicationName`` and ``lpCommandLine`` parameters of WinAPI ``CreateProcess``, and note that when resolving or searching for the executable path with ``shell=False``, *cwd* does not override the current working directory and *env* cannot override the ``PATH`` environment variable. Using a full path avoids all of these variations.
ja: Визначення шляху *виконуваного файлу* (або першого елемента *args*) залежить від платформи. Для POSIX перегляньте :meth:`os.execvpe` і зауважте, що під час визначення або пошуку шляху до виконуваного файлу *cwd* замінює поточний робочий каталог, а *env* може замінювати змінну середовища ``PATH``. Для Windows перегляньте документацію щодо параметрів ``lpApplicationName`` і ``lpCommandLine`` WinAPI ``CreateProcess`` і зауважте, що під час визначення або пошуку шляху до виконуваного файлу за допомогою ``shell=False`` *cwd* не перевизначає поточний робочий каталог, а *env* не може перевизначати змінну середовища ``PATH``. Використання повного шляху дозволяє уникнути всіх цих варіантів.
pt_pt: A resolução do caminho de *executable* (ou do primeiro item de *args*) é dependente da plataforma. Para POSIX, consulte :meth:`os.execvpe`, e note que ao resolver ou procurar o caminho do executável, *cwd* substitui o diretório de trabalho atual e *env* pode substituir a variável de ambiente ``PATH``. Para Windows, consulte a documentação dos parâmetros ``lpApplicationName`` e ``lpCommandLine`` da WinAPI ``CreateProcess``, e note que ao resolver ou procurar o caminho do executável com ``shell=False``, *cwd* não substitui o diretório de trabalho atual e *env* não pode substituir a variável de ambiente ``PATH``. Usar um caminho completo evita todas estas variações.
ru: Разрешение пути к *исполняемому файлу* (или первому элементу *args*) зависит от платформы. Для POSIX см. :meth:`os.execvpe` и обратите внимание, что при разрешении или поиске пути к исполняемому файлу *cwd* переопределяет текущий рабочий каталог, а *env* может переопределять переменную среды ``PATH``. Для Windows см. документацию по параметрам ``lpApplicationName`` и ``lpCommandLine`` WinAPI ``CreateProcess`` и обратите внимание, что при разрешении или поиске пути к исполняемому файлу с ``shell=False``, *cwd * не переопределяет текущий рабочий каталог, а *env* не может переопределять переменную среды PATH. Использование полного пути позволяет избежать всех этих вариантов.

source: An example of passing some arguments to an external program as a sequence is::
ja: Приклад передачі деяких аргументів зовнішній програмі у вигляді послідовності:
pt_pt: Um exemplo de passar alguns argumentos para um programa externo como uma sequência é::
ru: Пример передачи некоторых аргументов внешней программе в виде последовательности:

source: Popen(["/usr/bin/git", "commit", "-m", "Fixes a bug."])
pt_pt: Popen(["/usr/bin/git", "commit", "-m", "Corrige um bug."])

source: On POSIX, if *args* is a string, the string is interpreted as the name or path of the program to execute. However, this can only be done if not passing arguments to the program.
ja: POSIX 上では、*args* が文字列の場合、その文字列は実行すべきプログラムの名前またはパスとして解釈されます。しかし、これはプログラムに引数を渡さない場合にのみ可能です。
pt_pt: Em POSIX, se *args* for uma string, a string é interpretada como o nome ou caminho do programa a executar. No entanto, isto só pode ser feito se não estiver a passar argumentos para o programa.
ru: В POSIX, если *args* является строкой, эта строка интерпретируется как имя или путь к выполняемой программе. Однако это можно сделать только в том случае, если не передавать аргументы программе.

source: It may not be obvious how to break a shell command into a sequence of arguments, especially in complex cases. :meth:`shlex.split` can illustrate how to determine the correct tokenization for *args*::
ja: Може бути неочевидним, як розбити команду оболонки на послідовність аргументів, особливо у складних випадках. :meth:`shlex.split` може проілюструвати, як визначити правильну токенізацію для *args*::
pt_pt: Pode não ser óbvio como dividir um comando de shell numa sequência de argumentos, especialmente em casos complexos. :meth:`shlex.split` pode ilustrar como determinar a tokenização correta para *args*::
ru: Может быть неочевидно, как разбить команду оболочки на последовательность аргументов, особенно в сложных случаях. :meth:`shlex.split` может проиллюстрировать, как определить правильную токенизацию для *args*::

source: Note in particular that options (such as *-input*) and arguments (such as *eggs.txt*) that are separated by whitespace in the shell go in separate list elements, while arguments that need quoting or backslash escaping when used in the shell (such as filenames containing spaces or the *echo* command shown above) are single list elements.
ja: 特に注意すべき点は、シェル内でスペースで区切られたオプション (*-input* など) と引数 (*eggs.txt* など) はリストの別々の要素になるのに対し、シェル内で (上記のスペースを含むファイル名や *echo* コマンドのように) クォーティングやバックスラッシュエスケープが必要なものは単一のリスト要素であることです。
pt_pt: Note em particular que as opções (como *-input*) e argumentos (como *eggs.txt*) que são separados por espaços na shell vão em elementos de lista separados, enquanto argumentos que necessitam de aspas ou escape de barra invertida ao serem usados na shell (como nomes de ficheiros que contêm espaços ou o comando *echo* mostrado acima) são elementos únicos da lista.
ru: Обратите внимание, в частности, что параметры (например, *-input*) и аргументы (например, *eggs.txt*), разделенные пробелами в оболочке, помещаются в отдельные элементы списка, в то время как аргументы, которые требуют экранирования кавычками или обратной косой чертой при использовании в оболочки (например, имена файлов, содержащие пробелы, или команда *echo*, показанная выше) являются отдельными элементами списка.

source: On Windows, if *args* is a sequence, it will be converted to a string in a manner described in :ref:`converting-argument-sequence`. This is because the underlying ``CreateProcess()`` operates on strings.
ja: Windows 上では、*args* がシーケンスなら :ref:`converting-argument-sequence` に記述された方法で文字列に変換されます。これは根底の ``CreateProcess()`` が文字列上で動作するからです。
pt_pt: No Windows, se *args* for uma sequência, será convertido para uma string da forma descrita em :ref:`converting-argument-sequence`. Isto porque o ``CreateProcess()`` subjacente opera em strings.
ru: В Windows, если *args* является последовательностью, она будет преобразована в строку способом, описанным в :ref:`converting-argument-sequence`. Это связано с тем, что базовый метод CreateProcess() работает со строками.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing path-like objects on POSIX.
ja: Параметр *args* приймає :term:`path-like object`, якщо *shell* має значення ``False``, і послідовність, що містить шляхові об’єкти на POSIX.
pt_pt: O parâmetro *args* aceita um :term:`objeto semelhante a um caminho` se *shell* for ``False`` e uma sequência contendo objetos semelhantes a caminhos em POSIX.
ru: Параметр *args* принимает объект, подобный пути, если *shell* имеет значение False, и последовательность, содержащую объекты, подобные пути, в POSIX.

source: *args* parameter accepts a :term:`path-like object` if *shell* is ``False`` and a sequence containing bytes and path-like objects on Windows.
ja: Параметр *args* приймає :term:`path-like object`, якщо *shell* має значення ``False``, а також послідовність, що містить байти та шляхоподібні об’єкти у Windows.
pt_pt: O parâmetro *args* aceita um :term:`objeto semelhante a um caminho` se *shell* for ``False`` e uma sequência contendo bytes e objetos semelhantes a caminhos no Windows.
ru: Параметр *args* принимает объект, подобный пути, если *shell* имеет значение False, а также последовательность, содержащую байты и объекты, подобные пути, в Windows.

source: The *shell* argument (which defaults to ``False``) specifies whether to use the shell as the program to execute. If *shell* is ``True``, it is recommended to pass *args* as a string rather than as a sequence.
ja: *shell* 引数 (デフォルトでは ``False``) は、実行するプログラムとしてシェルを使用するかどうかを指定します。 *shell* が ``True`` の場合、 *args* をシーケンスとしてではなく文字列として渡すことが推奨されます。
pt_pt: O argumento *shell* (que por predefinição é ``False``) especifica se deve ser usada a shell como o programa a executar. Se *shell* for ``True``, é recomendado passar *args* como uma string em vez de uma sequência.
ru: Аргумент *shell* (который по умолчанию имеет значение «False») указывает, следует ли использовать оболочку в качестве программы для выполнения. Если *shell* имеет значение True, рекомендуется передавать *args* как строку, а не как последовательность.

source: On POSIX with ``shell=True``, the shell defaults to :file:`/bin/sh`. If *args* is a string, the string specifies the command to execute through the shell. This means that the string must be formatted exactly as it would be when typed at the shell prompt. This includes, for example, quoting or backslash escaping filenames with spaces in them. If *args* is a sequence, the first item specifies the command string, and any additional items will be treated as additional arguments to the shell itself. That is to say, :class:`Popen` does the equivalent of::
ja: POSIX で ``shell=True`` の場合、シェルのデフォルトは :file:`/bin/sh` になります。*args* が文字列の場合、この文字列はシェルを介して実行されるコマンドを指定します。したがって、文字列は厳密にシェルプロンプトで打つ形式と一致しなければなりません。例えば、文字列の中にスペースを含むファイル名がある場合は、クォーティングやバックスラッシュエスケープが必要です。*args* がシーケンスの場合には、最初の要素はコマンド名を表わす文字列として、残りの要素は追加の引数としてシェルに渡されます。つまり、以下の :class:`Popen` と等価ということです::
pt_pt: Em POSIX com ``shell=True``, a shell predefinida é :file:`/bin/sh`. Se *args* for uma string, a string especifica o comando a executar através da shell. Isto significa que a string deve ser formatada exatamente como seria quando digitada no prompt da shell. Isto inclui, por exemplo, colocar entre aspas ou escapar com barra invertida nomes de ficheiros com espaços. Se *args* for uma sequência, o primeiro item especifica a string de comando, e quaisquer itens adicionais serão tratados como argumentos adicionais para a shell. Ou seja, :class:`Popen` faz o equivalente a::
ru: В POSIX с ``shell=True`` оболочка по умолчанию имеет значение :file:`/bin/sh`. Если *args* — это строка, она определяет команду, которую необходимо выполнить через оболочку. Это означает, что строка должна быть отформатирована точно так же, как если бы она вводилась в командной строке. Это включает, например, кавычки или обратную косую черту, экранирующую имена файлов с пробелами в них. Если *args* — это последовательность, первый элемент определяет командную строку, а любые дополнительные элементы будут рассматриваться как дополнительные аргументы самой оболочки. То есть :class:`Popen` делает эквивалент::

source: On Windows with ``shell=True``, the :envvar:`COMSPEC` environment variable specifies the default shell. The only time you need to specify ``shell=True`` on Windows is when the command you wish to execute is built into the shell (e.g. :command:`dir` or :command:`copy`). You do not need ``shell=True`` to run a batch file or console-based executable.
ja: Windows で ``shell=True`` とすると、:envvar:`COMSPEC` 環境変数がデフォルトシェルを指定します。Windows で ``shell=True`` を指定する必要があるのは、実行したいコマンドがシェルに組み込みの場合だけです (例えば :command:`dir` や :command:`copy`)。バッチファイルやコンソールベースの実行ファイルを実行するために ``shell=True`` は必要ありません。
pt_pt: No Windows com ``shell=True``, a variável de ambiente :envvar:`COMSPEC` especifica a shell predefinida. A única altura em que precisa de especificar ``shell=True`` no Windows é quando o comando que deseja executar está integrado na shell (por exemplo, :command:`dir` ou :command:`copy`). Não precisa de ``shell=True`` para executar um ficheiro batch ou um executável baseado em consola.
ru: В Windows с ``shell=True`` переменная среды :envvar:`COMSPEC` указывает оболочку по умолчанию. Единственный раз, когда вам нужно указать ``shell=True`` в Windows, это когда команда, которую вы хотите выполнить, встроена в оболочку (например, :command:`dir` или :command:`copy`). Вам не нужен ``shell=True`` для запуска командного файла или исполняемого файла на базе консоли.

source: *bufsize* will be supplied as the corresponding argument to the :func:`open` function when creating the stdin/stdout/stderr pipe file objects:
ja: *bufsize* は標準入力/標準出力/標準エラー出力パイプファイルオブジェクトを生成するときに :func:`open` 関数の対応する引数に渡されます:
pt_pt: *bufsize* será fornecido como o argumento correspondente à função :func:`open` ao criar os objetos de ficheiro de pipe stdin/stdout/stderr:
ru: *bufsize* будет предоставлен в качестве соответствующего аргумента функции :func:`open` при создании объектов файла канала stdin/stdout/stderr:

source: ``0`` means unbuffered (read and write are one system call and can return short)
ja: ``0`` означает отсутствие буферизации (чтение и запись являются одним системным вызовом и могут возвращать короткий результат)
pt_pt: ``0`` significa sem buffer (leitura e escrita são uma chamada de sistema e podem retornar curtas)

source: ``1`` means line buffered (only usable if ``text=True`` or ``universal_newlines=True``)
ja: ``1`` означает буферизацию строки (можно использовать только если ``text=True`` или ``universal_newlines=True``)
pt_pt: ``1`` significa buffer por linha (só utilizável se ``text=True`` ou ``universal_newlines=True``)

source: any other positive value means use a buffer of approximately that size
ja: それ以外の正の整数はバッファーのおよそのサイズになることを意味します。
pt_pt: qualquer outro valor positivo significa usar um buffer de aproximadamente esse tamanho
ru: любое другое положительное значение означает использование буфера примерно такого размера

source: negative bufsize (the default) means the system default of io.DEFAULT_BUFFER_SIZE will be used.
ja: 負のサイズ (デフォルト) は io.DEFAULT_BUFFER_SIZE のシステムデフォルトが使用されることを意味します。
pt_pt: bufsize negativo (o predefinido) significa que o predefinido do sistema de io.DEFAULT_BUFFER_SIZE será usado.
ru: отрицательный размер буфера (по умолчанию) означает, что будет использоваться системное значение по умолчанию io.DEFAULT_BUFFER_SIZE.

source: *bufsize* now defaults to -1 to enable buffering by default to match the behavior that most code expects. In versions prior to Python 3.2.4 and 3.3.1 it incorrectly defaulted to ``0`` which was unbuffered and allowed short reads. This was unintentional and did not match the behavior of Python 2 as most code expected.
ja: *bufsize* теперь по умолчанию имеет значение -1, чтобы включить буферизацию по умолчанию, чтобы соответствовать поведению, которое ожидает большая часть кода. В версиях до Python 3.2.4 и 3.3.1 по умолчанию по ошибке было установлено значение «0», которое не буферизовалось и допускало короткие чтения. Это было непреднамеренно и не соответствовало поведению Python 2, как ожидалось в большинстве программ.
pt_pt: *bufsize* agora tem como predefinição -1 para ativar o buffer por predefinição para corresponder ao comportamento que a maioria do código espera. Em versões anteriores ao Python 3.2.4 e 3.3.1, estava incorretamente predefinido para ``0``, que não tinha buffer e permitia leituras curtas. Isto não era intencional e não correspondia ao comportamento do Python 2 como a maioria do código esperava.

source: The *executable* argument specifies a replacement program to execute. It is very seldom needed. When ``shell=False``, *executable* replaces the program to execute specified by *args*. However, the original *args* is still passed to the program. Most programs treat the program specified by *args* as the command name, which can then be different from the program actually executed. On POSIX, the *args* name becomes the display name for the executable in utilities such as :program:`ps`. If ``shell=True``, on POSIX the *executable* argument specifies a replacement shell for the default :file:`/bin/sh`.
ja: *executable* 引数は、実行する置換プログラムを指定します。これが必要になるのは極めて稀です。``shell=False`` のときは、*executable* は *args* で指定されている実行プログラムを置換します。しかし、オリジナルの *args* は依然としてプログラムに渡されます。ほとんどのプログラムは、*args* で指定されたプログラムをコマンド名として扱います。そして、それは実際に実行されたプログラムとは異なる可能性があります。POSIX において、:program:`ps` のようなユーティリティの中では、*args* 名が実行ファイルの表示名になります。``shell=True`` の場合、POSIX において *executable* 引数はデフォルトの :file:`/bin/sh` に対する置換シェルを指定します。
pt_pt: O argumento *executable* especifica um programa de substituição para executar. É muito raramente necessário. Quando ``shell=False``, *executable* substitui o programa a executar especificado por *args*. No entanto, o *args* original ainda é passado para o programa. A maioria dos programas trata o programa especificado por *args* como o nome do comando, que pode então ser diferente do programa realmente executado. Em POSIX, o nome *args* torna-se o nome de exibição para o executável em utilitários como :program:`ps`. Se ``shell=True``, em POSIX o argumento *executable* especifica uma shell de substituição para a predefinida :file:`/bin/sh`.
ru: Аргумент *executable* указывает программу замены, которую необходимо выполнить. Это требуется очень редко. Когда ``shell=False``, *executable* заменяет программу для выполнения, указанную *args*. Однако исходные *args* по-прежнему передаются программе. Большинство программ рассматривают программу, указанную в *args*, как имя команды, которое может отличаться от фактически выполняемой программы. В POSIX имя *args* становится отображаемым именем исполняемого файла в таких утилитах, как :program:`ps`. Если ``shell=True``, в POSIX аргумент *executable* указывает оболочку, заменяющую стандартный :file:`/bin/sh`.

source: *executable* parameter accepts a :term:`path-like object` on POSIX.
ja: *executable* 引数が POSIX で :term:`path-like object` を受け付けるようになりました。
pt_pt: *executable* aceita um :term:`objeto semelhante a um caminho` em POSIX.
ru: Параметр *executable* принимает :term:`path-like object` в POSIX.

source: *executable* parameter accepts a bytes and :term:`path-like object` on Windows.
ja: *executable* 引数が Windows で :term:`path-like object` を受け付けるようになりました。
pt_pt: *executable* aceita bytes e :term:`objeto semelhante a um caminho` no Windows.
ru: Параметр *executable* принимает байты и :term:`путеподобный объект` в Windows.

source: *stdin*, *stdout* and *stderr* specify the executed program's standard input, standard output and standard error file handles, respectively. Valid values are ``None``, :data:`PIPE`, :data:`DEVNULL`, an existing file descriptor (a positive integer), and an existing :term:`file object` with a valid file descriptor. With the default settings of ``None``, no redirection will occur. :data:`PIPE` indicates that a new pipe to the child should be created. :data:`DEVNULL` indicates that the special file :data:`os.devnull` will be used. Additionally, *stderr* can be :data:`STDOUT`, which indicates that the stderr data from the applications should be captured into the same file handle as for *stdout*.
ja: *stdin*, *stdout* и *stderr* определяют стандартный ввод, стандартный вывод и стандартные дескрипторы файлов ошибок исполняемой программы соответственно. Допустимые значения: None, :data:`PIPE`, :data:`DEVNULL`, существующий файловый дескриптор (положительное целое число) и существующий :term:`файловый объект` с допустимым файловым дескриптором. При настройках по умолчанию «Нет» перенаправление не произойдет. :data:`PIPE` указывает, что должен быть создан новый канал для дочернего элемента. :data:`DEVNULL` указывает, что будет использоваться специальный файл :data:`os.devnull`. Кроме того, *stderr* может быть :data:`STDOUT`, что указывает на то, что данные stderr из приложений должны быть записаны в тот же дескриптор файла, что и для *stdout*.
pt_pt: *stdin*, *stdout* e *stderr* especificam os descritores de ficheiro de entrada padrão, saída padrão e erro padrão do programa executado, respetivamente. Os valores válidos são ``None``, :data:`PIPE`, :data:`DEVNULL`, um descritor de ficheiro existente (um inteiro positivo) e um :term:`objeto de ficheiro` existente com um descritor de ficheiro válido. Com as configurações predefinidas de ``None``, não ocorrerá redirecionamento. :data:`PIPE` indica que um novo pipe para o processo filho deve ser criado. :data:`DEVNULL` indica que o ficheiro especial :data:`os.devnull` será usado. Além disso, *stderr* pode ser :data:`STDOUT`, o que indica que os dados stderr das aplicações devem ser capturados no mesmo descritor de ficheiro que *stdout*.

source: If *preexec_fn* is set to a callable object, this object will be called in the child process just before the child is executed. (POSIX only)
ja: *preexec_fn* に呼び出し可能オブジェクトが指定されている場合、このオブジェクトは子プロセスが実行される直前 (fork されたあと、exec される直前) に子プロセス内で呼ばれます。(POSIXのみ)
pt_pt: Se *preexec_fn* for definido para um objeto chamável, este objeto será chamado no processo filho imediatamente antes da execução do filho. (Apenas POSIX)
ru: Если для *preexec_fn* установлен вызываемый объект, этот объект будет вызываться в дочернем процессе непосредственно перед его выполнением. (только POSIX)

source: The *preexec_fn* parameter is NOT SAFE to use in the presence of threads in your application. The child process could deadlock before exec is called.
ja: アプリケーション中に複数のスレッドが存在する状態で *preexec_fn* 引数を使用するのは**安全ではありません**。exec が呼ばれる前に子プロセスがデッドロックを起こすことがあります。
pt_pt: O parâmetro *preexec_fn* NÃO É SEGURO de usar na presença de threads na sua aplicação. O processo filho pode ficar bloqueado antes de exec ser chamado.

source: If you need to modify the environment for the child use the *env* parameter rather than doing it in a *preexec_fn*. The *start_new_session* and *process_group* parameters should take the place of code using *preexec_fn* to call :func:`os.setsid` or :func:`os.setpgid` in the child.
ja: Если вам нужно изменить среду для дочернего процесса, используйте параметр *env*, а не делайте это в *preexec_fn*. Параметры *start_new_session* и *process_group* должны заменять код, использующий *preexec_fn* для вызова :func:`os.setsid` или :func:`os.setpgid` в дочернем элементе.
pt_pt: Se precisar de modificar o ambiente para o processo filho, use o parâmetro *env* em vez de o fazer numa *preexec_fn*. Os parâmetros *start_new_session* e *process_group* devem substituir o código que usa *preexec_fn* para chamar :func:`os.setsid` ou :func:`os.setpgid` no processo filho.

source: The *preexec_fn* parameter is no longer supported in subinterpreters. The use of the parameter in a subinterpreter raises :exc:`RuntimeError`. The new restriction may affect applications that are deployed in mod_wsgi, uWSGI, and other embedded environments.
ja: Параметр *preexec_fn* більше не підтримується субінтерпретаторами. Використання параметра у субінтерпретаторі викликає :exc:`RuntimeError`. Нове обмеження може вплинути на програми, які розгортаються в mod_wsgi, uWSGI та інших вбудованих середовищах.
pt_pt: O parâmetro *preexec_fn* já não é suportado em subinterpretadores. O uso do parâmetro num subinterpretador levanta :exc:`RuntimeError`. A nova restrição pode afetar aplicações que são implementadas em mod_wsgi, uWSGI e outros ambientes incorporados.
ru: Параметр *preexec_fn* больше не поддерживается субинтерпретаторами. Использование параметра в субинтерпретаторе вызывает ошибку :exc:`RuntimeError`. Новое ограничение может повлиять на приложения, развернутые в mod_wsgi, uWSGI и других встроенных средах.
