Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: A trailing newline is stripped from the output. The exit code for the command can be interpreted as the return code of subprocess. Example::
ja: Кінцевий символ нового рядка видаляється з результату. Код виходу для команди можна інтерпретувати як код повернення підпроцесу. Приклад::
pt_pt: Uma nova linha final é removida da saída. O código de saída para o comando pode ser interpretado como o código de retorno do subprocesso. Exemplo::
ru: Завершающая новая строка удаляется из вывода. Код завершения команды можно интерпретировать как код возврата подпроцесса. Пример::

source: >>> subprocess.getstatusoutput('ls /bin/ls') (0, '/bin/ls') >>> subprocess.getstatusoutput('cat /bin/junk') (1, 'cat: /bin/junk: No such file or directory') >>> subprocess.getstatusoutput('/bin/junk') (127, 'sh: /bin/junk: not found') >>> subprocess.getstatusoutput('/bin/kill $$') (-15, '')
pt_pt: >>> subprocess.getstatusoutput('ls /bin/ls') (0, '/bin/ls') >>> subprocess.getstatusoutput('cat /bin/lixo') (1, 'cat: /bin/lixo: Não existe esse ficheiro ou diretório') >>> subprocess.getstatusoutput('/bin/lixo') (127, 'sh: /bin/lixo: não encontrado') >>> subprocess.getstatusoutput('/bin/kill $$') (-15, '')

source: Windows support was added.
ja: Windows のサポートが追加されました。
pt_pt: Foi adicionado suporte para Windows.
ru: Добавлена ​​поддержка Windows.

source: The function now returns (exitcode, output) instead of (status, output) as it did in Python 3.3.3 and earlier. exitcode has the same value as :attr:`~Popen.returncode`.
ja: Тепер функція повертає (код виходу, вихід) замість (статус, вихід), як це було в Python 3.3.3 і попередніх версіях. код виходу має те саме значення, що й :attr:`~Popen.returncode`.
pt_pt: A função agora retorna (exitcode, output) em vez de (status, output) como fazia no Python 3.3.3 e anteriores. exitcode tem o mesmo valor que :attr:`~Popen.returncode`.
ru: Функция теперь возвращает (код выхода, вывод) вместо (статус, вывод), как это было в Python 3.3.3 и более ранних версиях. код выхода имеет то же значение, что и :attr:`~Popen.returncode`.

source: Return output (stdout and stderr) of executing *cmd* in a shell.
ja: シェル中の *cmd* を実行して出力 (stdout と stderr) を返します。
pt_pt: Retorna a saída (stdout e stderr) da execução de *cmd* numa shell.
ru: Возвращает выходные данные (stdout и stderr) выполнения *cmd* в оболочке.

source: Like :func:`getstatusoutput`, except the exit code is ignored and the return value is a string containing the command's output. Example::
ja: :func:`getstatusoutput` に似ていますが、終了コードは無視され、コマンドの出力のみを返します。例えば::
pt_pt: Semelhante a :func:`getstatusoutput`, exceto que o código de saída é ignorado e o valor de retorno é uma string contendo a saída do comando. Exemplo::
ru: Аналогично :func:`getstatusoutput`, за исключением того, что код выхода игнорируется, а возвращаемое значение представляет собой строку, содержащую выходные данные команды. Пример::

source: Windows support added
ja: Windowsで利用可能になりました
pt_pt: Suporte para Windows adicionado
ru: Добавлена поддержка Windows

source: Notes
ja: 注釈
pt_pt: Notas
ru: Примечания

source: Timeout Behavior
ja: 超时行为
pt_pt: Comportamento de Timeout

source: When using the ``timeout`` parameter in functions like :func:`run`, :meth:`Popen.wait`, or :meth:`Popen.communicate`, users should be aware of the following behaviors:
ja: 当在 :func:`run`、:meth:`Popen.wait` 或 :meth:`Popen.communicate` 等函数中使用 ``timeout`` 形参时，用户应该注意以下行为：
pt_pt: Ao usar o parâmetro ``timeout`` em funções como :func:`run`, :meth:`Popen.wait` ou :meth:`Popen.communicate`, os utilizadores devem estar cientes dos seguintes comportamentos:

source: **Process Creation Delay**: The initial process creation itself cannot be interrupted on many platform APIs. This means that even when specifying a timeout, you are not guaranteed to see a timeout exception until at least after however long process creation takes.
ja: **进程创建延迟**：在许多平台API上，初始进程创建本身不能被中断。这意味着，即使指定了超时，也不能保证在创建进程之前看到超时异常，无论创建进程花了多长时间。
pt_pt: **Atraso na Criação do Processo**: A própria criação inicial do processo não pode ser interrompida em muitas APIs de plataforma. Isto significa que, mesmo ao especificar um timeout, não é garantido que veja uma exceção de timeout até pelo menos após o tempo que a criação do processo demorar.

source: **Extremely Small Timeout Values**: Setting very small timeout values (such as a few milliseconds) may result in almost immediate :exc:`TimeoutExpired` exceptions because process creation and system scheduling inherently require time.
ja: **非常小的超时值**: 设置非常小的超时值（比如几毫秒）可能会导致几乎立即出现 :exc:`TimeoutExpired` 异常，因为进程创建和系统调度本身就需要时间。
pt_pt: **Valores de Timeout Extremamente Pequenos**: Definir valores de timeout muito pequenos (como alguns milissegundos) pode resultar em exceções :exc:`TimeoutExpired` quase imediatas, porque a criação do processo e o agendamento do sistema inerentemente requerem tempo.

source: Converting an argument sequence to a string on Windows
ja: Windows における引数シーケンスから文字列への変換
pt_pt: Converter uma sequência de argumentos para uma string no Windows
ru: Преобразование последовательности аргументов в строку в Windows

source: On Windows, an *args* sequence is converted to a string that can be parsed using the following rules (which correspond to the rules used by the MS C runtime):
ja: Windows では、 *args* シーケンスは以下の (MS C ランタイムで使われる規則に対応する) 規則を使って解析できる文字列に変換されます:
pt_pt: No Windows, uma sequência *args* é convertida para uma string que pode ser analisada usando as seguintes regras (que correspondem às regras usadas pelo runtime MS C):
ru: В Windows последовательность *args* преобразуется в строку, которую можно анализировать с использованием следующих правил (которые соответствуют правилам, используемым средой выполнения MS C):

source: Arguments are delimited by white space, which is either a space or a tab.
ja: 引数は、スペースかタブのどちらかの空白で分けられます。
pt_pt: Os argumentos são delimitados por espaços em branco, que podem ser um espaço ou um tab.
ru: Аргументы разделяются пробелом, который представляет собой либо пробел, либо табуляцию.

source: A string surrounded by double quotation marks is interpreted as a single argument, regardless of white space contained within. A quoted string can be embedded in an argument.
ja: ダブルクオーテーションマークで囲まれた文字列は、空白が含まれていたとしても 1 つの引数として解釈されます。クオートされた文字列は引数に埋め込めます。
pt_pt: Uma string rodeada por aspas duplas é interpretada como um único argumento, independentemente dos espaços em branco contidos dentro. Uma string entre aspas pode ser incorporada num argumento.
ru: Строка, заключенная в двойные кавычки, интерпретируется как одиночный аргумент, независимо от содержащихся внутри пробелов. Строка в кавычках может быть встроена в аргумент.

source: A double quotation mark preceded by a backslash is interpreted as a literal double quotation mark.
ja: バックスラッシュに続くダブルクオーテーションマークは、リテラルのダブルクオーテーションマークと解釈されます。
pt_pt: Uma aspa dupla precedida por uma barra invertida é interpretada como uma aspa dupla literal.
ru: Двойные кавычки, которым предшествует обратная косая черта, интерпретируются как буквальные двойные кавычки.

source: Backslashes are interpreted literally, unless they immediately precede a double quotation mark.
ja: バックスラッシュは、ダブルクオーテーションが続かない限り、リテラルとして解釈されます。
pt_pt: As barras invertidas são interpretadas literalmente, a menos que precedam imediatamente uma aspa dupla.
ru: Обратная косая черта интерпретируется буквально, если только она не предшествует сразу двойной кавычке.

source: If backslashes immediately precede a double quotation mark, every pair of backslashes is interpreted as a literal backslash. If the number of backslashes is odd, the last backslash escapes the next double quotation mark as described in rule 3.
ja: 複数のバックスラッシュにダブルクオーテーションマークが続くなら、バックスラッシュ 2 つで 1 つのバックスラッシュ文字と解釈されます。バックスラッシュの数が奇数なら、最後のバックスラッシュは規則 3 に従って続くダブルクオーテーションマークをエスケープします。
pt_pt: Se barras invertidas precederem imediatamente uma aspa dupla, cada par de barras invertidas é interpretado como uma barra invertida literal. Se o número de barras invertidas for ímpar, a última barra invertida escapa a próxima aspa dupla como descrito na regra 3.
ru: Если обратная косая черта предшествует двойной кавычке, каждая пара обратной косой черты интерпретируется как буквальная обратная косая черта. Если количество обратных косых черт нечетное, последняя обратная косая черта выходит за рамки следующей двойной кавычки, как описано в правиле 3.

source: Module which provides function to parse and escape command lines.
ja: コマンドラインを解析したりエスケープしたりする関数を提供するモジュール。
pt_pt: Módulo que fornece funções para analisar e escapar linhas de comando.
ru: Модуль, предоставляющий функцию анализа и экранирования командных строк.

source: Disable use of ``posix_spawn()``
pt_pt: Desativar o uso de ``posix_spawn()``

source: On Linux, :mod:`subprocess` defaults to using the ``vfork()`` system call internally when it is safe to do so rather than ``fork()``. This greatly improves performance.
ja: В Linux :mod:`subprocess` по умолчанию использует внутренний системный вызов ``vfork()``, когда это безопасно, а не ``fork()``. Это значительно повышает производительность.
pt_pt: No Linux, :mod:`subprocess` usa por predefinição a chamada de sistema ``vfork()`` internamente quando é seguro fazê-lo em vez de ``fork()``. Isto melhora muito o desempenho.

source: subprocess._USE_POSIX_SPAWN = False # See CPython issue gh-NNNNNN.
pt_pt: subprocess._USE_POSIX_SPAWN = False # Veja o problema CPython gh-NNNNNN.

source: It is safe to set this to false on any Python version. It will have no effect on older or newer versions where unsupported. Do not assume the attribute is available to read. Despite the name, a true value does not indicate the corresponding function will be used, only that it may be.
pt_pt: É seguro definir isto como falso em qualquer versão do Python. Não terá efeito em versões mais antigas ou mais recentes onde não é suportado. Não assuma que o atributo está disponível para leitura. Apesar do nome, um valor verdadeiro não indica que a função correspondente será usada, apenas que pode ser.

source: Please file issues any time you have to use these private knobs with a way to reproduce the issue you were seeing. Link to that issue from a comment in your code.
ja: Пожалуйста, сообщайте о проблемах каждый раз, когда вам нужно использовать эти частные ручки, чтобы воспроизвести проблему, с которой вы столкнулись. Ссылка на эту проблему из комментария в вашем коде.
pt_pt: Por favor, registe problemas sempre que tiver de usar estes comandos privados com uma forma de reproduzir o problema que estava a ver. Faça link para esse problema a partir de um comentário no seu código.

source: universal newlines
pt_pt: novas linhas universais

source: subprocess module
ja: subprocess モジュール
pt_pt: módulo subprocess

source: If specified, *env* must provide any variables required for the program to execute. On Windows, in order to run a `side-by-side assembly`_ the specified *env* **must** include a valid :envvar:`SystemRoot`.
ja: *env* を指定する場合、プログラムを実行するのに必要な変数すべてを与えなければなりません。Windows で `Side-by-Side アセンブリ <side-by-side assembly_>`_ を実行するためには、*env* は正しい :envvar:`SystemRoot` を **含まなければなりません** 。
ru: Если указано, *env* должен предоставить все переменные, необходимые для выполнения программы. В Windows, чтобы запустить `параллельную сборку`_, указанный *env* **должен** включать действительный :envvar:`SystemRoot`.

source: Replacing :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`
ja: :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3` を置き換える
ru: Замена :func:`os.popen`, :func:`os.popen2`, :func:`os.popen3`

source: If the cmd argument to popen2 functions is a string, the command is executed through /bin/sh. If it is a list, the command is directly executed.
ja: popen2 関数の cmd 引数が文字列の場合、コマンドは /bin/sh によって実行されます。リストの場合、コマンドは直接実行されます。
ru: Обработка кода возврата переводится следующим образом:

source: :class:`popen2.Popen3` and :class:`popen2.Popen4` basically work as :class:`subprocess.Popen`, except that:
ja: :class:`popen2.Popen3` および :class:`popen2.Popen4` は以下の点を除けば、基本的に :class:`subprocess.Popen` と同じです:
ru: :class:`popen2.Popen3` и :class:`popen2.Popen4` в основном работают как :class:`subprocess.Popen`, за исключением того:

source: :class:`Popen` raises an exception if the execution fails.
ja: :class:`Popen` は実行が失敗した場合に例外を送出します。
ru: :class:`Popen` вызывает исключение, если выполнение завершается неудачей.

source: The *capturestderr* argument is replaced with the *stderr* argument.
ja: *capturestderr* 引数は *stderr* 引数に代わりました。
ru: Аргумент *capturestderr* заменяется аргументом *stderr*.

source: ``stdin=PIPE`` and ``stdout=PIPE`` must be specified.
ja: ``stdin=PIPE`` および ``stdout=PIPE`` を指定する必要があります。
ru: Необходимо указать ``stdin=PIPE`` и ``stdout=PIPE``.

source: popen2 closes all file descriptors by default, but you have to specify ``close_fds=True`` with :class:`Popen` to guarantee this behavior on all platforms or past Python versions.
ja: popen2 はデフォルトですべてのファイル記述子を閉じます。しかし、全てのプラットフォーム上で、あるいは過去の Python バージョンでこの挙動を保証するためには、 :class:`Popen` に対して ``close_fds=True`` を指定しなければなりません。
ru: popen2 по умолчанию закрывает все файловые дескрипторы, но вам необходимо указать ``close_fds=True`` с помощью :class:`Popen`, чтобы гарантировать такое поведение на всех платформах или в предыдущих версиях Python.

source: Execute the string *cmd* in a shell with :meth:`Popen.check_output` and return a 2-tuple ``(exitcode, output)``. *encoding* and *errors* are used to decode output; see the notes on :ref:`frequently-used-arguments` for more details.
ja: Выполните строку *cmd* в оболочке с помощью :meth:`Popen.check_output` и верните двухкортеж ``(exitcode, output)``. *кодирование* и *ошибки* используются для декодирования вывода; дополнительные сведения см. в примечаниях к :ref:`часто-используемым-аргументам`.
