Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: :mod:`!subprocess` --- Subprocess management
ja: :mod:`!subprocess` --- サブプロセス管理
pt_pt: :mod:`!subprocess` --- Gestão de subprocessos

source: **Source code:** :source:`Lib/subprocess.py`
ja: **ソースコード:** :source:`Lib/subprocess.py`
pt_pt: **Código-fonte:** :source:`Lib/subprocess.py`
ru: **Исходный код:** :source:`Lib/subprocess.py`

source: The :mod:`subprocess` module allows you to spawn new processes, connect to their input/output/error pipes, and obtain their return codes. This module intends to replace several older modules and functions::
ja: :mod:`subprocess` モジュールは新しいプロセスの開始、入力/出力/エラーパイプの接続、リターンコードの取得を可能とします。このモジュールは以下の古いモジュールや関数を置き換えることを目的としています：
pt_pt: O módulo :mod:`subprocess` permite-lhe criar novos processos, conectar-se aos seus pipes de entrada/saída/erro e obter os seus códigos de retorno. Este módulo pretende substituir vários módulos e funções mais antigos::
ru: Модуль :mod:`subprocess` позволяет вам создавать новые процессы, подключаться к их каналам ввода/вывода/ошибок и получать их коды возврата. Этот модуль предназначен для замены нескольких старых модулей и функций:

source: Information about how the :mod:`subprocess` module can be used to replace these modules and functions can be found in the following sections.
ja: これらのモジュールや関数の代わりに、:mod:`subprocess` モジュールをどのように使うかについてを以下の節で説明します。
pt_pt: Informações sobre como o módulo :mod:`subprocess` pode ser usado para substituir estes módulos e funções podem ser encontradas nas secções seguintes.
ru: Информацию о том, как модуль :mod:`subprocess` можно использовать для замены этих модулей и функций, можно найти в следующих разделах.

source: :pep:`324` -- PEP proposing the subprocess module
ja: :pep:`324` -- subprocess モジュールを提案している PEP
pt_pt: :pep:`324` -- PEP que propõe o módulo subprocess
ru: :pep:`324` -- PEP предлагает модуль подпроцесса

source: Availability
pt_pt: Disponibilidade

source: This module is not supported on :ref:`mobile platforms <mobile-availability>` or :ref:`WebAssembly platforms <wasm-availability>`.
ja: Этот модуль не поддерживается на :ref:`мобильных платформах <mobile-availability>` или :ref:`платформах WebAssembly <wasm-availability>`.
pt_pt: Este módulo não é suportado em :ref:`plataformas móveis <mobile-availability>` ou :ref:`plataformas WebAssembly <wasm-availability>`.

source: Using the :mod:`subprocess` Module
ja: :mod:`subprocess` モジュールを使う
pt_pt: Utilizar o módulo :mod:`subprocess`
ru: Использование модуля :mod:`subprocess`

source: The recommended approach to invoking subprocesses is to use the :func:`run` function for all use cases it can handle. For more advanced use cases, the underlying :class:`Popen` interface can be used directly.
ja: サブプロセスを起動するために推奨される方法は、すべての用法を扱える :func:`run` 関数を使用することです。より高度な用法では下層の :class:`Popen` インターフェースを直接使用することもできます。
pt_pt: A abordagem recomendada para invocar subprocessos é usar a função :func:`run` para todos os casos de uso que ela pode tratar. Para casos de uso mais avançados, a interface subjacente :class:`Popen` pode ser usada diretamente.
ru: Рекомендуемый подход к вызову подпроцессов — использовать функцию :func:`run` для всех случаев использования, которые она может обработать. Для более сложных случаев использования можно напрямую использовать базовый интерфейс :class:`Popen`.

source: Run the command described by *args*. Wait for command to complete, then return a :class:`CompletedProcess` instance.
ja: *args* で指定されたコマンドを実行します。コマンドの完了を待って、:class:`CompletedProcess` インスタンスを返します。
pt_pt: Executa o comando descrito por *args*. Aguarda que o comando seja concluído e, em seguida, retorna uma instância :class:`CompletedProcess`.
ru: Запустите команду, описанную *args*. Дождитесь завершения команды, затем верните экземпляр :class:`CompletedProcess`.

source: The arguments shown above are merely the most common ones, described below in :ref:`frequently-used-arguments` (hence the use of keyword-only notation in the abbreviated signature). The full function signature is largely the same as that of the :class:`Popen` constructor - most of the arguments to this function are passed through to that interface. (*timeout*, *input*, *check*, and *capture_output* are not.)
ja: 上記の引数は、もっともよく使われるものだけ示しており、後述の :ref:`frequently-used-arguments` で説明されています (そのためここではキーワード専用引数の表記に省略されています)。関数の完全な使用法を説明しても大部分が :class:`Popen` コンストラクターの内容と同じになります - この関数のほとんどの引数は :class:`Popen` インターフェイスに渡されます。(*timeout*、*input* および *check* は除く。)
pt_pt: Os argumentos mostrados acima são apenas os mais comuns, descritos abaixo em :ref:`frequently-used-arguments` (daí o uso da notação apenas de palavra-chave na assinatura abreviada). A assinatura completa da função é em grande parte a mesma da do construtor :class:`Popen` — a maioria dos argumentos desta função são passados para essa interface. (*timeout*, *input*, *check* e *capture_output* não são.)
ru: Аргументы, показанные выше, являются лишь наиболее распространенными, описанными ниже в разделе :ref:`часто-используемые-аргументы` (отсюда и использование нотации, состоящей только из ключевых слов, в сокращенной сигнатуре). Полная сигнатура функции во многом такая же, как и у конструктора :class:`Popen` — большинство аргументов этой функции передаются через этот интерфейс. (*timeout*, *input*, *check* и *capture_output* — нет.)

source: If *capture_output* is true, stdout and stderr will be captured. When used, the internal :class:`Popen` object is automatically created with *stdout* and *stderr* both set to :data:`~subprocess.PIPE`. The *stdout* and *stderr* arguments may not be supplied at the same time as *capture_output*. If you wish to capture and combine both streams into one, set *stdout* to :data:`~subprocess.PIPE` and *stderr* to :data:`~subprocess.STDOUT`, instead of using *capture_output*.
ja: Если *capture_output* имеет значение true, будут перехвачены stdout и stderr. При использовании внутренний объект :class:`Popen` автоматически создается с параметрами *stdout* и *stderr*, для которых установлено значение :data:`~subprocess.PIPE`. Аргументы *stdout* и *stderr* не могут быть переданы одновременно с *capture_output*. Если вы хотите захватить и объединить оба потока в один, установите для *stdout* значение :data:`~subprocess.PIPE` и для *stderr* значение :data:`~subprocess.STDOUT` вместо использования *capture_output*.
pt_pt: Se *capture_output* for verdadeiro, stdout e stderr serão capturados. Quando usado, o objeto interno :class:`Popen` é criado automaticamente com *stdout* e *stderr* ambos definidos para :data:`~subprocess.PIPE`. Os argumentos *stdout* e *stderr* não podem ser fornecidos ao mesmo tempo que *capture_output*. Se pretender capturar e combinar ambos os fluxos em um, defina *stdout* para :data:`~subprocess.PIPE` e *stderr* para :data:`~subprocess.STDOUT`, em vez de usar *capture_output*.

source: A *timeout* may be specified in seconds, it is internally passed on to :meth:`Popen.communicate`. If the timeout expires, the child process will be killed and waited for. The :exc:`TimeoutExpired` exception will be re-raised after the child process has terminated. The initial process creation itself cannot be interrupted on many platform APIs so you are not guaranteed to see a timeout exception until at least after however long process creation takes.
ja: *Тайм-аут* может быть указан в секундах, он передается внутри :meth:`Popen.communicate`. Если тайм-аут истечет, дочерний процесс будет завершен и будет ожидаться. Исключение :exc:`TimeoutExpired` будет повторно вызвано после завершения дочернего процесса. Само первоначальное создание процесса не может быть прервано во многих API-интерфейсах платформы, поэтому вы не гарантированно увидите исключение тайм-аута, по крайней мере, до тех пор, пока создание процесса не займет много времени.
pt_pt: Um *timeout* pode ser especificado em segundos, é passado internamente para :meth:`Popen.communicate`. Se o timeout expirar, o processo filho será terminado e aguardado. A exceção :exc:`TimeoutExpired` será relançada após o processo filho ter terminado. A própria criação inicial do processo não pode ser interrompida em muitas APIs de plataforma, pelo que não é garantido que veja uma exceção de timeout até pelo menos após o tempo que a criação do processo demorar.

source: The *input* argument is passed to :meth:`Popen.communicate` and thus to the subprocess's stdin. If used it must be a byte sequence, or a string if *encoding* or *errors* is specified or *text* is true. When used, the internal :class:`Popen` object is automatically created with *stdin* set to :data:`~subprocess.PIPE`, and the *stdin* argument may not be used as well.
ja: Аргумент *input* передается в :meth:`Popen.communicate` и, следовательно, в стандартный ввод подпроцесса. Если используется, это должна быть последовательность байтов или строка, если указано *encoding* или *errors* или *text* имеет значение true. При использовании внутренний объект :class:`Popen` автоматически создается с параметром *stdin*, установленным в :data:`~subprocess.PIPE`, и аргумент *stdin* также нельзя использовать.
pt_pt: O argumento *input* é passado para :meth:`Popen.communicate` e, assim, para o stdin do subprocesso. Se usado, deve ser uma sequência de bytes ou uma string se *encoding* ou *errors* for especificado ou se *text* for verdadeiro. Quando usado, o objeto interno :class:`Popen` é criado automaticamente com *stdin* definido para :data:`~subprocess.PIPE`, e o argumento *stdin* não pode ser usado também.

source: If *check* is true, and the process exits with a non-zero exit code, a :exc:`CalledProcessError` exception will be raised. Attributes of that exception hold the arguments, the exit code, and stdout and stderr if they were captured.
ja: *check* に真を指定した場合、プロセスが非ゼロの終了コードで終了すると :exc:`CalledProcessError` 例外が送出されます。 この例外の属性には、引数、終了コード、標準出力および標準エラー出力が捕捉できた場合に格納されます。
pt_pt: Se *check* for verdadeiro e o processo sair com um código de saída diferente de zero, uma exceção :exc:`CalledProcessError` será levantada. Os atributos dessa exceção contêm os argumentos, o código de saída, e stdout e stderr se foram capturados.
ru: Если *check* имеет значение true и процесс завершается с ненулевым кодом завершения, будет выдано исключение :exc:`CalledProcessError`. Атрибуты этого исключения содержат аргументы, код выхода, а также стандартные выходные данные и стандартный поток ошибок, если они были перехвачены.

source: If *encoding* or *errors* are specified, or *text* is true, file objects for stdin, stdout and stderr are opened in text mode using the specified *encoding* and *errors* or the :class:`io.TextIOWrapper` default. The *universal_newlines* argument is equivalent to *text* and is provided for backwards compatibility. By default, file objects are opened in binary mode.
ja: *encoding* または *errors* 引数が指定されるか、*text* 引数が true である場合、stdin, stdout および stderr のためのファイルオブジェクトはテキストモードでオープンされます。 その際には指定された *encoding* および *errors* が使われるか、デフォルトの :class:`io.TextIOWrapper` になります。*universal_newlines* 引数は *text* 引数と等価であり、後方互換性のために提供されています。そうでない場合、デフォルトでこれらのファイルオブジェクトはバイナリモードでオープンされます。
pt_pt: Se *encoding* ou *errors* forem especificados, ou *text* for verdadeiro, os objetos de ficheiro para stdin, stdout e stderr são abertos em modo de texto usando o *encoding* e *errors* especificados ou o padrão :class:`io.TextIOWrapper`. O argumento *universal_newlines* é equivalente a *text* e é fornecido para compatibilidade retroativa. Por predefinição, os objetos de ficheiro são abertos em modo binário.
ru: Если указаны *encoding* или *errors* или *text* имеет значение true, файловые объекты для stdin, stdout и stderr открываются в текстовом режиме с использованием указанных *encoding* и *errors* или :class:`io.TextIOWrapper `по умолчанию. Аргумент *universal_newlines* эквивалентен *text* и предоставляется для обратной совместимости. По умолчанию файловые объекты открываются в двоичном режиме.

source: If *env* is not ``None``, it must be a mapping that defines the environment variables for the new process; these are used instead of the default behavior of inheriting the current process' environment. It is passed directly to :class:`Popen`. This mapping can be str to str on any platform or bytes to bytes on POSIX platforms much like :data:`os.environ` or :data:`os.environb`.
ja: *env* が ``None`` 以外の場合、これは新しいプロセスでの環境変数を定義します。デフォルトでは、子プロセスは現在のプロセスの環境変数を引き継ぎます。 :class:`Popen` に直接渡されます。あらゆるプラットフォームで :data:`os.environ` のように文字列から文字列へ、またPOSIX プラットフォームにおいては :data:`os.environb` のようにバイトからバイトへも、定義すること出来ます。
pt_pt: Se *env* não for ``None``, deve ser um mapeamento que define as variáveis de ambiente para o novo processo; estas são usadas em vez do comportamento predefinido de herdar o ambiente do processo atual. É passado diretamente para :class:`Popen`. Este mapeamento pode ser str para str em qualquer plataforma ou bytes para bytes em plataformas POSIX, tal como :data:`os.environ` ou :data:`os.environb`.
ru: Если *env* не имеет значения None, это должно быть отображение, определяющее переменные среды для нового процесса; они используются вместо стандартного поведения при наследовании среды текущего процесса. Он передается непосредственно в :class:`Popen`. Это сопоставление может быть строкой в ​​строку на любой платформе или байтами в байты на платформах POSIX, подобно :data:`os.environ` или :data:`os.environb`.

source: Examples::
ja: 例::
pt_pt: Exemplos::
ru: Примеры::

source: >>> subprocess.run(["ls", "-l"]) # doesn't capture output CompletedProcess(args=['ls', '-l'], returncode=0) >>> subprocess.run("exit 1", shell=True, check=True) Traceback (most recent call last): ... subprocess.CalledProcessError: Command 'exit 1' returned non-zero exit status 1 >>> subprocess.run(["ls", "-l", "/dev/null"], capture_output=True) CompletedProcess(args=['ls', '-l', '/dev/null'], returncode=0, stdout=b'crw-rw-rw- 1 root root 1, 3 Jan 23 16:23 /dev/null\n', stderr=b'')
pt_pt: >>> subprocess.run(["ls", "-l"]) # não captura a saída CompletedProcess(args=['ls', '-l'], returncode=0) >>> subprocess.run("exit 1", shell=True, check=True) Traceback (most recent call last): ... subprocess.CalledProcessError: O comando 'exit 1' retornou um estado de saída diferente de zero 1 >>> subprocess.run(["ls", "-l", "/dev/null"], capture_output=True) CompletedProcess(args=['ls', '-l', '/dev/null'], returncode=0, stdout=b'crw-rw-rw- 1 root root 1, 3 Jan 23 16:23 /dev/null\n', stderr=b'')

source: Added *encoding* and *errors* parameters
ja: *encoding* と *error* が引数に追加されました。
pt_pt: Adicionados os parâmetros *encoding* e *errors*
ru: Добавлены параметры *encoding* и *errors*.

source: Added the *text* parameter, as a more understandable alias of *universal_newlines*. Added the *capture_output* parameter.
ja: *universal_newlines* 引数のよりわかりやすい名前として、*text* 引数が追加されました。*capture_output* 引数が追加されました。
pt_pt: Adicionado o parâmetro *text*, como um alias mais compreensível de *universal_newlines*. Adicionado o parâmetro *capture_output*.
ru: Добавлен параметр *text* как более понятный псевдоним *universal_newlines*. Добавлен параметр *capture_output*.

source: Changed Windows shell search order for ``shell=True``. The current directory and ``%PATH%`` are replaced with ``%COMSPEC%`` and ``%SystemRoot%\System32\cmd.exe``. As a result, dropping a malicious program named ``cmd.exe`` into a current directory no longer works.
ja: ``shell=True`` のときのWindowsシェル検索順序を変更しました。カレントディレクトリと ``%PATH%`` は、 ``%COMSPEC%`` と ``%SystemRoot%\System32\cmd.exe`` に置き換えられました。これにより、 ``cmd.exe`` という名前の悪意のあるプログラムをカレントディレクトリにドロップしても、動作しなくなりました。
pt_pt: Alterada a ordem de pesquisa da shell do Windows para ``shell=True``. O diretório atual e ``%PATH%`` são substituídos por ``%COMSPEC%`` e ``%SystemRoot%\System32\cmd.exe``. Como resultado, colocar um programa malicioso chamado ``cmd.exe`` num diretório atual já não funciona.
ru: Изменен порядок поиска оболочки Windows для ``shell=True``. Текущий каталог и %PATH% заменяются на %COMSPEC% и %SystemRoot%\System32\cmd.exe. В результате установка вредоносной программы с именем cmd.exe в текущий каталог больше не работает.

source: The return value from :func:`run`, representing a process that has finished.
ja: :func:`run` の戻り値。プロセスが終了したことを表します。
pt_pt: O valor de retorno de :func:`run`, representando um processo que terminou.
ru: Возвращаемое значение из :func:`run`, представляющее завершившийся процесс.

source: The arguments used to launch the process. This may be a list or a string.
ja: プロセスを起動するときに使用された引数。1 個のリストか 1 個の文字列になります。
pt_pt: Os argumentos usados para lançar o processo. Pode ser uma lista ou uma string.
ru: Аргументы, используемые для запуска процесса. Это может быть список или строка.

source: Exit status of the child process. Typically, an exit status of 0 indicates that it ran successfully.
ja: 子プロセスの終了コード。一般に、終了ステータス 0 はプロセスが正常に終了したことを示します。
pt_pt: Estado de saída do processo filho. Normalmente, um estado de saída de 0 indica que foi executado com sucesso.
ru: Статус выхода дочернего процесса. Обычно статус завершения 0 указывает на успешное выполнение.

source: A negative value ``-N`` indicates that the child was terminated by signal ``N`` (POSIX only).
ja: 負の値 ``-N`` は子プロセスがシグナル ``N`` により中止させられたことを示します (POSIX のみ)。
pt_pt: Um valor negativo ``-N`` indica que o processo filho foi terminado pelo sinal ``N`` (apenas POSIX).
ru: Отрицательное значение ``-N`` указывает, что дочерний процесс был завершен сигналом ``N`` (только POSIX).

source: Captured stdout from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stdout was not captured.
ja: 子プロセスから補足された標準出力です。バイト列、もしくは :func:`run` でエンコーディングが指定された場合、エラーの場合、text=True が指定された場合は文字列です。標準出力が補足できなかったら ``None`` になります。
pt_pt: Stdout capturado do processo filho. Uma sequência de bytes ou uma string se :func:`run` foi chamado com um encoding, erros ou text=True. ``None`` se stdout não foi capturado.
ru: Захваченный стандартный вывод дочернего процесса. Последовательность байтов или строка, если :func:`run` была вызвана с кодировкой, ошибками или текстом = True. ``None``, если стандартный вывод не был захвачен.

source: If you ran the process with ``stderr=subprocess.STDOUT``, stdout and stderr will be combined in this attribute, and :attr:`stderr` will be ``None``.
ja: プロセスが ``stderr=subprocess.STDOUT`` で実行された場合、標準出力と標準エラー出力が混合されたものがこの属性に格納され、:attr:`stderr` は ``None`` になります。
pt_pt: Se executou o processo com ``stderr=subprocess.STDOUT``, stdout e stderr serão combinados neste atributo, e :attr:`stderr` será ``None``.
ru: Если вы запустили процесс с ``stderr=subprocess.STDOUT``, stdout и stderr будут объединены в этом атрибуте, а :attr:`stderr` будет иметь значение ``None``.

source: Captured stderr from the child process. A bytes sequence, or a string if :func:`run` was called with an encoding, errors, or text=True. ``None`` if stderr was not captured.
ja: 子プロセスから補足された標準エラー出力です。バイト列、もしくは :func:`run` でエンコーディングが指定された場合、エラーの場合、text=True が指定された場合は文字列です。標準エラー出力が補足できなかったら ``None`` になります。
pt_pt: Stderr capturado do processo filho. Uma sequência de bytes ou uma string se :func:`run` foi chamado com um encoding, erros ou text=True. ``None`` se stderr não foi capturado.
ru: Захваченный stderr из дочернего процесса. Последовательность байтов или строка, если :func:`run` была вызвана с кодировкой, ошибками или текстом = True. ``None``, если stderr не был захвачен.

source: If :attr:`returncode` is non-zero, raise a :exc:`CalledProcessError`.
ja: :attr:`returncode` が非ゼロの場合、:exc:`CalledProcessError` が送出されます。
pt_pt: Se :attr:`returncode` não for zero, levanta uma :exc:`CalledProcessError`.
ru: Если :attr:`returncode` не равен нулю, вызовите :exc:`CalledProcessError`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that the special file :data:`os.devnull` will be used.
ja: :class:`Popen` の *stdin*, *stdout*, *stderr* 引数に渡して、標準入出力を :data:`os.devnull` から入出力するように指定するための特殊値です。
pt_pt: Valor especial que pode ser usado como argumento *stdin*, *stdout* ou *stderr* para :class:`Popen` e indica que o ficheiro especial :data:`os.devnull` será usado.
ru: Специальное значение, которое можно использовать в качестве аргумента *stdin*, *stdout* или *stderr* для :class:`Popen` и указывает, что будет использоваться специальный файл :data:`os.devnull`.

source: Special value that can be used as the *stdin*, *stdout* or *stderr* argument to :class:`Popen` and indicates that a pipe to the standard stream should be opened. Most useful with :meth:`Popen.communicate`.
ja: :class:`Popen` の *stdin*, *stdout*, *stderr* 引数に渡して、標準ストリームに対するパイプを開くことを指定するための特殊値です。:meth:`Popen.communicate` に非常に有用です。
pt_pt: Valor especial que pode ser usado como argumento *stdin*, *stdout* ou *stderr* para :class:`Popen` e indica que um pipe para o fluxo padrão deve ser aberto. Mais útil com :meth:`Popen.communicate`.
ru: Специальное значение, которое можно использовать в качестве аргумента *stdin*, *stdout* или *stderr* для :class:`Popen` и указывает, что должен быть открыт канал к стандартному потоку. Наиболее полезно с :meth:`Popen.communicate`.

source: Special value that can be used as the *stderr* argument to :class:`Popen` and indicates that standard error should go into the same handle as standard output.
ja: :class:`Popen` の *stderr* 引数に渡して、標準エラー出力が標準出力と同じハンドルに出力されるように指定するための特殊値です。
pt_pt: Valor especial que pode ser usado como argumento *stderr* para :class:`Popen` e indica que o erro padrão deve ir para o mesmo descritor que a saída padrão.
ru: Специальное значение, которое можно использовать в качестве аргумента *stderr* для :class:`Popen` и указывает, что стандартная ошибка должна идти в тот же дескриптор, что и стандартный вывод.

source: Base class for all other exceptions from this module.
ja: このモジュールの他のすべての例外のための基底クラスです。
pt_pt: Classe base para todas as outras exceções deste módulo.
ru: Базовый класс для всех остальных исключений из этого модуля.

source: Subclass of :exc:`SubprocessError`, raised when a timeout expires while waiting for a child process.
ja: :exc:`SubprocessError` のサブクラスです。子プロセスの終了を待機している間にタイムアウトが発生した場合に送出されます。
pt_pt: Subclasse de :exc:`SubprocessError`, levantada quando um timeout expira enquanto se aguarda por um processo filho.
ru: Подкласс :exc:`SubprocessError`, вызываемый по истечении времени ожидания дочернего процесса.

source: Command that was used to spawn the child process.
ja: 子プロセスの生成に使用されるコマンド本文。
pt_pt: Comando que foi usado para criar o processo filho.
ru: Команда, которая использовалась для создания дочернего процесса.

source: Timeout in seconds.
ja: タイムアウト秒数。
pt_pt: Timeout em segundos.
ru: Время ожидания в секундах.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``. This is always :class:`bytes` when any output was captured regardless of the ``text=True`` setting. It may remain ``None`` instead of ``b''`` when no output was observed.
ja: :func:`run` にまたは :func:`check_output` によって捕捉された場合は、子プロセスの出力となり、それ以外の場合は ``None`` となります。``text=True`` の設定に関係なく、出力が捕捉された場合は常に :class:`bytes` となります。出力がない場合は ``b''`` の代わりに``None`` のままになることがあります。
pt_pt: Saída do processo filho se foi capturada por :func:`run` ou :func:`check_output`. Caso contrário, ``None``. Isto é sempre :class:`bytes` quando alguma saída foi capturada independentemente da configuração ``text=True``. Pode permanecer ``None`` em vez de ``b''`` quando nenhuma saída foi observada.
ru: Вывод дочернего процесса, если он был захвачен :func:`run` или :func:`check_output`. В противном случае ``Нет``. Это всегда :class:`bytes`, когда любой вывод был захвачен, независимо от настройки ``text=True``. Он может оставаться «None» вместо «b», когда никакого вывода не наблюдалось.
