Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: If the *stderr* argument was :data:`PIPE`, this attribute is a readable stream object as returned by :func:`open`. Reading from the stream provides error output from the child process. If the *encoding* or *errors* arguments were specified or the *text* or *universal_newlines* argument was ``True``, the stream is a text stream, otherwise it is a byte stream. If the *stderr* argument was not :data:`PIPE`, this attribute is ``None``.
ja: Если аргумент *stderr* был :data:`PIPE`, этот атрибут является читаемым объектом потока, возвращаемым :func:`open`. Чтение из потока обеспечивает вывод ошибок дочернего процесса. Если были указаны аргументы *encoding* или *errors* или аргумент *text* или *universal_newlines* имел значение «True», поток является текстовым потоком, в противном случае это поток байтов. Если аргумент *stderr* не был :data:`PIPE`, этот атрибут имеет значение ``None``.
pt_pt: Se o argumento *stderr* foi :data:`PIPE`, este atributo é um objeto de fluxo legível como retornado por :func:`open`. A leitura do fluxo fornece a saída de erro do processo filho. Se os argumentos *encoding* ou *errors* foram especificados ou o argumento *text* ou *universal_newlines* foi ``True``, o fluxo é um fluxo de texto, caso contrário é um fluxo de bytes. Se o argumento *stderr* não foi :data:`PIPE`, este atributo é ``None``.
ru: Если аргумент *stderr* был :data:`PIPE`, этот атрибут является читаемым объектом потока, возвращаемым :func:`open`. Чтение из потока обеспечивает вывод ошибок дочернего процесса. Если были указаны аргументы *encoding* или *errors* или аргумент *text* или *universal_newlines* имел значение «True», поток является текстовым потоком, в противном случае это поток байтов. Если аргумент *stderr* не был :data:`PIPE`, этот атрибут имеет значение ``None``.

source: Use :meth:`~Popen.communicate` rather than :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` or :attr:`.stderr.read <Popen.stderr>` to avoid deadlocks due to any of the other OS pipe buffers filling up and blocking the child process.
ja: :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>`, :attr:`.stderr.read <Popen.stderr>` を利用すると、別のパイプの OS パイプバッファーがいっぱいになってデッドロックが発生する恐れがあります。これを避けるためには :meth:`~Popen.communicate` を利用してください。
pt_pt: Use :meth:`~Popen.communicate` em vez de :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` ou :attr:`.stderr.read <Popen.stderr>` para evitar bloqueios devido a qualquer um dos outros buffers de pipe do sistema operativo encher e bloquear o processo filho.
ru: Используйте :meth:`~Popen.communicate` вместо :attr:`.stdin.write <Popen.stdin>`, :attr:`.stdout.read <Popen.stdout>` или :attr:`.stderr.read <Popen.stderr>`, чтобы избежать взаимоблокировок из-за заполнения буферов других каналов ОС и блокировки дочернего процесса.

source: The process ID of the child process.
ja: 子プロセスのプロセス ID が入ります。
pt_pt: O ID do processo do processo filho.
ru: Идентификатор дочернего процесса.

source: Note that if you set the *shell* argument to ``True``, this is the process ID of the spawned shell.
ja: *shell* 引数を ``True`` に設定した場合は、生成されたシェルのプロセス ID になります。
pt_pt: Note que se definir o argumento *shell* como ``True``, este é o ID do processo da shell gerada.
ru: Обратите внимание: если вы установите для аргумента *shell* значение «True», это будет идентификатор процесса порожденной оболочки.

source: The child return code. Initially ``None``, :attr:`returncode` is set by a call to the :meth:`poll`, :meth:`wait`, or :meth:`communicate` methods if they detect that the process has terminated.
ja: Дочерний код возврата. Первоначально None, :attr:`returncode` устанавливается вызовом методов :meth:`poll`, :meth:`wait` или :meth:`communicate`, если они обнаруживают, что процесс завершился. .
pt_pt: O código de retorno do processo filho. Inicialmente ``None``, :attr:`returncode` é definido por uma chamada aos métodos :meth:`poll`, :meth:`wait` ou :meth:`communicate` se detetarem que o processo terminou.

source: A ``None`` value indicates that the process hadn't yet terminated at the time of the last method call.
ja: Значение None указывает, что процесс еще не завершился на момент последнего вызова метода.
pt_pt: Um valor ``None`` indica que o processo ainda não tinha terminado no momento da última chamada de método.

source: Windows Popen Helpers
ja: Windows Popen ヘルパー
pt_pt: Auxiliares Popen para Windows
ru: Помощники Windows Popen

source: The :class:`STARTUPINFO` class and following constants are only available on Windows.
ja: :class:`STARTUPINFO` クラスと以下の定数は、Windows のみで利用できます。
pt_pt: A classe :class:`STARTUPINFO` e as constantes seguintes estão disponíveis apenas no Windows.
ru: Класс :class:`STARTUPINFO` и следующие константы доступны только в Windows.

source: Partial support of the Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ structure is used for :class:`Popen` creation. The following attributes can be set by passing them as keyword-only arguments.
ja: Часткова підтримка структури Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ використовується для створення :class:`Popen`. Наступні атрибути можна встановити, передавши їх як аргументи лише для ключових слів.
pt_pt: Suporte parcial da estrutura Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ é usado para a criação de :class:`Popen`. Os seguintes atributos podem ser definidos passando-os como argumentos apenas de palavra-chave.
ru: Частичная поддержка структуры Windows `STARTUPINFO <https://msdn.microsoft.com/en-us/library/ms686331(v=vs.85).aspx>`__ используется для создания :class:`Popen`. Следующие атрибуты можно установить, передав их как аргументы, содержащие только ключевые слова.

source: Keyword-only argument support was added.
ja: キーワード専用引数のサポートが追加されました。
pt_pt: Foi adicionado suporte para argumentos apenas de palavra-chave.
ru: Была добавлена ​​поддержка аргументов только по ключевым словам.

source: A bit field that determines whether certain :class:`STARTUPINFO` attributes are used when the process creates a window. ::
ja: 特定の :class:`STARTUPINFO` の属性が、プロセスがウィンドウを生成するときに使われるかを決定するビットフィールドです::
pt_pt: Um campo de bits que determina se certos atributos :class:`STARTUPINFO` são usados quando o processo cria uma janela. ::
ru: Битовое поле, определяющее, используются ли определенные атрибуты :class:`STARTUPINFO`, когда процесс создает окно. ::

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard input handle for the process. If :data:`STARTF_USESTDHANDLES` is not specified, the default for standard input is the keyboard buffer.
ja: :attr:`dwFlags` が :data:`STARTF_USESTDHANDLES` を指定すれば、この属性がプロセスの標準入力処理です。:data:`STARTF_USESTDHANDLES` が指定されなければ、標準入力のデフォルトはキーボードバッファーです。
pt_pt: Se :attr:`dwFlags` especificar :data:`STARTF_USESTDHANDLES`, este atributo é o descritor de entrada padrão para o processo. Se :data:`STARTF_USESTDHANDLES` não for especificado, o predefinido para a entrada padrão é o buffer do teclado.
ru: Если :attr:`dwFlags` указывает :data:`STARTF_USESTDHANDLES`, этот атрибут является стандартным дескриптором ввода для процесса. Если :data:`STARTF_USESTDHANDLES` не указан, по умолчанию для стандартного ввода используется буфер клавиатуры.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard output handle for the process. Otherwise, this attribute is ignored and the default for standard output is the console window's buffer.
ja: :attr:`dwFlags` が :data:`STARTF_USESTDHANDLES` を指定すれば、この属性がプロセスの標準出力処理です。そうでなければ、この属性は無視され、標準出力のデフォルトはコンソールウィンドウのバッファーです。
pt_pt: Se :attr:`dwFlags` especificar :data:`STARTF_USESTDHANDLES`, este atributo é o descritor de saída padrão para o processo. Caso contrário, este atributo é ignorado e o predefinido para a saída padrão é o buffer da janela da consola.
ru: Если :attr:`dwFlags` указывает :data:`STARTF_USESTDHANDLES`, этот атрибут является стандартным дескриптором вывода для процесса. В противном случае этот атрибут игнорируется, и стандартным выводом по умолчанию является буфер окна консоли.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESTDHANDLES`, this attribute is the standard error handle for the process. Otherwise, this attribute is ignored and the default for standard error is the console window's buffer.
ja: :attr:`dwFlags` が :data:`STARTF_USESTDHANDLES` を指定すれば、この属性がプロセスの標準エラー処理です。そうでなければ、この属性は無視され、標準エラー出力のデフォルトはコンソールウィンドウのバッファーです。
pt_pt: Se :attr:`dwFlags` especificar :data:`STARTF_USESTDHANDLES`, este atributo é o descritor de erro padrão para o processo. Caso contrário, este atributo é ignorado e o predefinido para o erro padrão é o buffer da janela da consola.
ru: Если :attr:`dwFlags` указывает :data:`STARTF_USESTDHANDLES`, этот атрибут является стандартным дескриптором ошибки для процесса. В противном случае этот атрибут игнорируется, и значением по умолчанию для стандартной ошибки является буфер окна консоли.

source: If :attr:`dwFlags` specifies :data:`STARTF_USESHOWWINDOW`, this attribute can be any of the values that can be specified in the ``nCmdShow`` parameter for the `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__ function, except for ``SW_SHOWDEFAULT``. Otherwise, this attribute is ignored.
ja: :attr:`dwFlags` が :data:`STARTF_USESHOWWINDOW` を指定すれば、この属性は `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__ 関数の ``nCmdShow`` 引数で指定された値なら、 ``SW_SHOWDEFAULT`` 以外の任意のものにできます。しかし、この属性は無視されます。
pt_pt: Se :attr:`dwFlags` especificar :data:`STARTF_USESHOWWINDOW`, este atributo pode ser qualquer um dos valores que podem ser especificados no parâmetro ``nCmdShow`` para a função `ShowWindow <https://msdn.microsoft.com/en-us/library/ms633548(v=vs.85).aspx>`__, exceto ``SW_SHOWDEFAULT``. Caso contrário, este atributo é ignorado.
ru: Если :attr:`dwFlags` указывает :data:`STARTF_USESHOWWINDOW`, этот атрибут может быть любым из значений, которые могут быть указаны в параметре ``nCmdShow`` для ``ShowWindow <https://msdn.microsoft.com/ en-us/library/ms633548(v=vs.85).aspx>`__, за исключением SW_SHOWDEFAULT``. В противном случае этот атрибут игнорируется.

source: :data:`SW_HIDE` is provided for this attribute. It is used when :class:`Popen` is called with ``shell=True``.
ja: この属性には :data:`SW_HIDE` が提供されています。これは、:class:`Popen` が ``shell=True`` として呼び出されたときに使われます。
pt_pt: :data:`SW_HIDE` é fornecido para este atributo. É usado quando :class:`Popen` é chamado com ``shell=True``.
ru: Для этого атрибута предусмотрен :data:`SW_HIDE`. Он используется, когда :class:`Popen` вызывается с ``shell=True``.

source: A dictionary of additional attributes for process creation as given in ``STARTUPINFOEX``, see `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.
ja: Словник додаткових атрибутів для створення процесу, наведений у ``STARTUPINFOEX``, див. `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.
pt_pt: Um dicionário de atributos adicionais para a criação de processos como dado em ``STARTUPINFOEX``, veja `UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85).aspx>`__.
ru: Словарь дополнительных атрибутов для создания процессов, как указано в ``STARTUPINFOEX``, см. в ``UpdateProcThreadAttribute <https://msdn.microsoft.com/en-us/library/windows/desktop/ms686880(v=vs.85). aspx>`__.

source: Supported attributes:
ja: Підтримувані атрибути:
pt_pt: Atributos suportados:
ru: Поддерживаемые атрибуты:

source: Sequence of handles that will be inherited. *close_fds* must be true if non-empty.
ja: Послідовність дескрипторів, які будуть успадковані. *close_fds* має бути істинним, якщо воно не порожнє.
pt_pt: Sequência de *handles* que serão herdados. *close_fds* deve ser verdadeiro se não estiver vazio.
ru: Последовательность дескрипторов, которые будут унаследованы. *close_fds* должно иметь значение true, если не пусто.

source: The handles must be temporarily made inheritable by :func:`os.set_handle_inheritable` when passed to the :class:`Popen` constructor, else :class:`OSError` will be raised with Windows error ``ERROR_INVALID_PARAMETER`` (87).
ja: :func:`os.set_handle_inheritable` під час передачі в конструктор :class:`Popen` дескрипторів має бути тимчасово успадкованим, інакше :class:`OSError` буде викликано помилкою Windows ``ERROR_INVALID_PARAMETER`` (87).
pt_pt: Os *handles* devem ser temporariamente tornados herdáveis por :func:`os.set_handle_inheritable` quando passados para o construtor :class:`Popen`, caso contrário :class:`OSError` será levantado com o erro do Windows ``ERROR_INVALID_PARAMETER`` (87).
ru: Дескрипторы должны быть временно сделаны наследуемыми с помощью :func:`os.set_handle_inheritable` при передаче в конструктор :class:`Popen`, иначе :class:`OSError` будет вызван с ошибкой Windows ``ERROR_INVALID_PARAMETER`` (87).

source: In a multithreaded process, use caution to avoid leaking handles that are marked inheritable when combining this feature with concurrent calls to other process creation functions that inherit all handles such as :func:`os.system`. This also applies to standard handle redirection, which temporarily creates inheritable handles.
ja: У багатопотоковому процесі будьте обережні, щоб уникнути витоку дескрипторів, позначених як успадковані, коли поєднуєте цю функцію з одночасними викликами інших функцій створення процесу, які успадковують усі дескриптори, наприклад :func:`os.system`. Це також стосується стандартного перенаправлення дескрипторів, яке тимчасово створює успадковані дескриптори.
pt_pt: Num processo multithread, use cuidado para evitar vazamento de *handles* que estejam marcados como herdáveis ao combinar esta funcionalidade com chamadas concorrentes para outras funções de criação de processos que herdam todos os *handles*, como :func:`os.system`. Isto também se aplica ao redirecionamento padrão de *handles*, que cria temporariamente *handles* herdáveis.
ru: В многопоточном процессе будьте осторожны, чтобы избежать утечки дескрипторов, помеченных как наследуемые, при объединении этой функции с одновременными вызовами других функций создания процессов, которые наследуют все дескрипторы, такие как :func:`os.system`. Это также относится к стандартному перенаправлению дескрипторов, которое временно создает наследуемые дескрипторы.

source: Windows Constants
ja: Константи Windows
pt_pt: Constantes do Windows
ru: Константы Windows

source: The :mod:`subprocess` module exposes the following constants.
ja: :mod:`subprocess` モジュールは、以下の定数を公開しています。
pt_pt: O módulo :mod:`subprocess` expõe as seguintes constantes.
ru: Модуль :mod:`subprocess` предоставляет следующие константы.

source: The standard input device. Initially, this is the console input buffer, ``CONIN$``.
ja: 標準入力デバイスです。この初期値は、コンソール入力バッファ、 ``CONIN$`` です。
pt_pt: O dispositivo de entrada padrão. Inicialmente, este é o buffer de entrada da consola, ``CONIN$``.
ru: Стандартное устройство ввода. Изначально это входной буфер консоли, ``CONIN$``.

source: The standard output device. Initially, this is the active console screen buffer, ``CONOUT$``.
ja: 標準出力デバイスです。この初期値は、アクティブコンソールスクリーン、 ``CONOUT$`` です。
pt_pt: O dispositivo de saída padrão. Inicialmente, este é o buffer de ecrã da consola ativa, ``CONOUT$``.
ru: Стандартное устройство вывода. Изначально это активный экранный буфер консоли CONOUT$``.

source: The standard error device. Initially, this is the active console screen buffer, ``CONOUT$``.
ja: 標準エラーデバイスです。この初期値は、アクティブコンソールスクリーン、 ``CONOUT$`` です。
pt_pt: O dispositivo de erro padrão. Inicialmente, este é o buffer de ecrã da consola ativa, ``CONOUT$``.
ru: Устройство стандартной ошибки. Изначально это активный экранный буфер консоли CONOUT$``.

source: Hides the window. Another window will be activated.
ja: ウィンドウを隠します。別のウィンドウがアクティブになります。
pt_pt: Esconde a janela. Outra janela será ativada.
ru: Скрывает окно. Откроется другое окно.

source: Specifies that the :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput`, and :attr:`STARTUPINFO.hStdError` attributes contain additional information.
ja: 追加情報を保持する、:attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput`, および :attr:`STARTUPINFO.hStdError` 属性を指定します。
pt_pt: Especifica que os atributos :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput` e :attr:`STARTUPINFO.hStdError` contêm informação adicional.
ru: Указывает, что атрибуты :attr:`STARTUPINFO.hStdInput`, :attr:`STARTUPINFO.hStdOutput` и :attr:`STARTUPINFO.hStdError` содержат дополнительную информацию.

source: Specifies that the :attr:`STARTUPINFO.wShowWindow` attribute contains additional information.
ja: 追加情報を保持する、 :attr:`STARTUPINFO.wShowWindow` 属性を指定します。
pt_pt: Especifica que o atributo :attr:`STARTUPINFO.wShowWindow` contém informação adicional.
ru: Указывает, что атрибут :attr:`STARTUPINFO.wShowWindow` содержит дополнительную информацию.

source: A :attr:`STARTUPINFO.dwFlags` parameter to specify that the *Working in Background* mouse cursor will be displayed while a process is launching. This is the default behavior for GUI processes.
ja: Параметр :attr:`STARTUPINFO.dwFlags`, указывающий, что курсор мыши *Работа в фоновом режиме* будет отображаться во время запуска процесса. Это поведение по умолчанию для процессов с графическим интерфейсом.
pt_pt: Um parâmetro :attr:`STARTUPINFO.dwFlags` para especificar que o cursor do rato *A Trabalhar em Segundo Plano* será exibido enquanto um processo está a ser lançado. Este é o comportamento predefinido para processos GUI.

source: A :attr:`STARTUPINFO.dwFlags` parameter to specify that the mouse cursor will not be changed when launching a process.
ja: Параметр :attr:`STARTUPINFO.dwFlags`, указывающий, что курсор мыши не будет меняться при запуске процесса.
pt_pt: Um parâmetro :attr:`STARTUPINFO.dwFlags` para especificar que o cursor do rato não será alterado ao lançar um processo.

source: The new process has a new console, instead of inheriting its parent's console (the default).
ja: 新しいプロセスが、親プロセスのコンソールを継承する (デフォルト) のではなく、新しいコンソールを持ちます。
pt_pt: O novo processo tem uma nova consola, em vez de herdar a consola do seu pai (predefinição).
ru: Новый процесс имеет новую консоль вместо того, чтобы наследовать консоль своего родителя (по умолчанию).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process group will be created. This flag is necessary for using :func:`os.kill` on the subprocess.
ja: 新しいプロセスグループが生成されることを指定する :class:`Popen` ``creationflags`` パラメーターです。このフラグは、サブプロセスで :func:`os.kill` を使うのに必要です。
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo grupo de processos será criado. Esta flag é necessária para usar :func:`os.kill` no subprocesso.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что будет создана новая группа процессов. Этот флаг необходим для использования :func:`os.kill` в подпроцессе.

source: This flag is ignored if :data:`CREATE_NEW_CONSOLE` is specified.
ja: :data:`CREATE_NEW_CONSOLE` が指定されていたら、このフラグは無視されます。
pt_pt: Esta flag é ignorada se :data:`CREATE_NEW_CONSOLE` for especificado.
ru: Этот флаг игнорируется, если указан :data:`CREATE_NEW_CONSOLE`.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an above average priority.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме пріоритет вище середнього.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo terá uma prioridade acima da média.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс будет иметь приоритет выше среднего.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a below average priority.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме пріоритет нижче середнього.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo terá uma prioridade abaixo da média.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс будет иметь приоритет ниже среднего.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a high priority.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме високий пріоритет.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo terá uma prioridade alta.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс будет иметь высокий приоритет.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have an idle (lowest) priority.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме неактивний (найнижчий) пріоритет.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo terá uma prioridade ociosa (a mais baixa).
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс будет иметь приоритет ожидания (самый низкий).

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have a normal priority. (default)
ja: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс будет иметь обычный приоритет. (по умолчанию)
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo terá uma prioridade normal. (predefinição)

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will have realtime priority. You should almost never use REALTIME_PRIORITY_CLASS, because this interrupts system threads that manage mouse input, keyboard input, and background disk flushing. This class can be appropriate for applications that "talk" directly to hardware or that perform brief tasks that should have limited interruptions.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес матиме пріоритет у реальному часі. Ви майже ніколи не повинні використовувати REALTIME_PRIORITY_CLASS, оскільки це перериває системні потоки, які керують введенням даних миші, введенням даних з клавіатури та фоновим очищенням диска. Цей клас може підійти для програм, які "спілкуються" безпосередньо з обладнанням або виконують короткі завдання, які повинні мати обмежені перерви.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo terá prioridade em tempo real. Quase nunca deve usar REALTIME_PRIORITY_CLASS, porque isto interrompe threads do sistema que gerem entrada do rato, entrada do teclado e descarga de disco em segundo plano. Esta classe pode ser apropriada para aplicações que "falam" diretamente com o hardware ou que realizam tarefas breves que devem ter interrupções limitadas.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс будет иметь приоритет в реальном времени. Вам почти никогда не следует использовать REALTIME_PRIORITY_CLASS, поскольку это прерывает системные потоки, которые управляют вводом с помощью мыши, вводом с клавиатуры и фоновой очисткой диска. Этот класс может подойти для приложений, которые «общаются» напрямую с оборудованием или выполняют короткие задачи, перерывы в работе которых должны быть ограничены.

source: A :class:`Popen` ``creationflags`` parameter to specify that a new process will not create a window.
ja: Параметр :class:`Popen` ``creationflags``, щоб вказати, що новий процес не створюватиме вікно.
pt_pt: Um parâmetro ``creationflags`` de :class:`Popen` para especificar que um novo processo não criará uma janela.
ru: Параметр :class:`Popen` ``creationflags``, указывающий, что новый процесс не будет создавать окно.
