Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/subprocess.po
Languages: ja, pt_pt, ru

source: Alias for output, for symmetry with :attr:`stderr`.
ja: output の別名。:attr:`stderr` と対になります。
pt_pt: Alias para saída, para simetria com :attr:`stderr`.
ru: Псевдоним для вывода, для симметрии с :attr:`stderr`.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``. This is always :class:`bytes` when stderr output was captured regardless of the ``text=True`` setting. It may remain ``None`` instead of ``b''`` when no stderr output was observed.
ja: :func:`run` によって捕捉された場合、子プロセスの標準エラー出力が表示され、それ以外の場合は ``None`` となります。``text=True`` の設定に関係なく、標準エラー出力を捕捉した場合は常に :class:`bytes` となります。標準エラー出力がない場合は、``b''`` の代わりに ``None`` のままになることがあります。
pt_pt: Saída stderr do processo filho se foi capturada por :func:`run`. Caso contrário, ``None``. Isto é sempre :class:`bytes` quando a saída stderr foi capturada independentemente da configuração ``text=True``. Pode permanecer ``None`` em vez de ``b''`` quando nenhuma saída stderr foi observada.
ru: Вывод Stderr дочернего процесса, если он был захвачен :func:`run`. В противном случае ``Нет``. Это всегда :class:`bytes` при захвате вывода stderr, независимо от настройки ``text=True``. Он может оставаться «None» вместо «b», если вывод stderr не наблюдался.

source: *stdout* and *stderr* attributes added
ja: 属性 *stdout* および *stderr* が追加されました。
pt_pt: Atributos *stdout* e *stderr* adicionados
ru: Добавлены атрибуты *stdout* и *stderr*.

source: Subclass of :exc:`SubprocessError`, raised when a process run by :func:`check_call`, :func:`check_output`, or :func:`run` (with ``check=True``) returns a non-zero exit status.
ja: :exc:`SubprocessError` のサブクラスです。:func:`check_call` または :func:`check_output` 、 ``check=True`` であるときの :func:`run` 、によって実行されたプロセスが非ゼロの終了ステータスを返した場合に送出されます。
pt_pt: Subclasse de :exc:`SubprocessError`, levantada quando um processo executado por :func:`check_call`, :func:`check_output` ou :func:`run` (com ``check=True``) retorna um estado de saída diferente de zero.
ru: Подкласс :exc:`SubprocessError`, вызываемый, когда процесс, запущенный :func:`check_call`, :func:`check_output` или :func:`run` (с ``check=True``), возвращает не- нулевой статус выхода.

source: Exit status of the child process. If the process exited due to a signal, this will be the negative signal number.
ja: 子プロセスの終了ステータスです。もしプロセスがシグナルによって終了したなら、これは負のシグナル番号になります。
pt_pt: Estado de saída do processo filho. Se o processo terminou devido a um sinal, este será o número do sinal negativo.
ru: Статус выхода дочернего процесса. Если процесс завершился по сигналу, это будет отрицательный номер сигнала.

source: Output of the child process if it was captured by :func:`run` or :func:`check_output`. Otherwise, ``None``.
ja: :func:`run` または :func:`check_output` によって捕捉された子プロセスの出力。捕捉されなかったら ``None`` になります。
pt_pt: Saída do processo filho se foi capturada por :func:`run` ou :func:`check_output`. Caso contrário, ``None``.
ru: Вывод дочернего процесса, если он был захвачен :func:`run` или :func:`check_output`. В противном случае ``Нет``.

source: Stderr output of the child process if it was captured by :func:`run`. Otherwise, ``None``.
ja: :func:`run` によって捕捉された子プロセスの標準エラー出力。捕捉されなかったら ``None`` になります。
pt_pt: Saída stderr do processo filho se foi capturada por :func:`run`. Caso contrário, ``None``.
ru: Вывод Stderr дочернего процесса, если он был захвачен :func:`run`. В противном случае ``Нет``.

source: Frequently Used Arguments
ja: よく使われる引数
pt_pt: Argumentos Frequentemente Utilizados
ru: Часто используемые аргументы

source: To support a wide variety of use cases, the :class:`Popen` constructor (and the convenience functions) accept a large number of optional arguments. For most typical use cases, many of these arguments can be safely left at their default values. The arguments that are most commonly needed are:
ja: 幅広い使用例をサポートするために、:class:`Popen` コンストラクター (とその他の簡易関数) は、多くのオプション引数を受け付けます。一般的な用法については、これらの引数の多くはデフォルト値のままで問題ありません。通常必要とされる引数は以下の通りです:
pt_pt: Para suportar uma ampla variedade de casos de uso, o construtor :class:`Popen` (e as funções de conveniência) aceita um grande número de argumentos opcionais. Para a maioria dos casos de uso típicos, muitos destes argumentos podem ser deixados em segurança nos seus valores predefinidos. Os argumentos mais comumente necessários são:
ru: Для поддержки широкого спектра вариантов использования конструктор :class:`Popen` (и удобные функции) принимают большое количество необязательных аргументов. В большинстве типичных случаев использования многие из этих аргументов можно безопасно оставить со значениями по умолчанию. Чаще всего требуются следующие аргументы:

source: *args* is required for all calls and should be a string, or a sequence of program arguments. Providing a sequence of arguments is generally preferred, as it allows the module to take care of any required escaping and quoting of arguments (e.g. to permit spaces in file names). If passing a single string, either *shell* must be :const:`True` (see below) or else the string must simply name the program to be executed without specifying any arguments.
ja: *args* はすべての呼び出しに必要で、文字列あるいはプログラム引数のシーケンスでなければなりません。一般に、引数のシーケンスを渡す方が望ましいです。なぜなら、モジュールが必要な引数のエスケープやクオート (例えばファイル名中のスペースを許すこと) の面倒を見ることができるためです。単一の文字列を渡す場合、*shell* は :const:`True` でなければなりません (以下を参照)。もしくは、その文字列は引数を指定せずに実行される単なるプログラムの名前でなければなりません。
pt_pt: *args* é obrigatório para todas as chamadas e deve ser uma string ou uma sequência de argumentos do programa. Fornecer uma sequência de argumentos é geralmente preferível, pois permite que o módulo trate de qualquer escape e aspas necessárias nos argumentos (por exemplo, para permitir espaços em nomes de ficheiros). Se passar uma única string, ou *shell* deve ser :const:`True` (ver abaixo) ou a string deve simplesmente nomear o programa a ser executado sem especificar quaisquer argumentos.
ru: *args* требуется для всех вызовов и должен представлять собой строку или последовательность аргументов программы. Предоставление последовательности аргументов обычно является предпочтительным, поскольку оно позволяет модулю позаботиться о любом необходимом экранировании и заключении аргументов в кавычки (например, разрешить пробелы в именах файлов). При передаче одной строки либо *shell* должно быть :const:`True` (см. ниже), либо строка должна просто называть программу, которая будет выполняться, без указания каких-либо аргументов.

source: *stdin*, *stdout* and *stderr* specify the executed program's standard input, standard output and standard error file handles, respectively. Valid values are ``None``, :data:`PIPE`, :data:`DEVNULL`, an existing file descriptor (a positive integer), and an existing :term:`file object` with a valid file descriptor. With the default settings of ``None``, no redirection will occur. :data:`PIPE` indicates that a new pipe to the child should be created. :data:`DEVNULL` indicates that the special file :data:`os.devnull` will be used. Additionally, *stderr* can be :data:`STDOUT`, which indicates that the stderr data from the child process should be captured into the same file handle as for *stdout*.
ja: *stdin*, *stdout* и *stderr* определяют стандартный ввод, стандартный вывод и стандартные дескрипторы файлов ошибок исполняемой программы соответственно. Допустимые значения: None, :data:`PIPE`, :data:`DEVNULL`, существующий файловый дескриптор (положительное целое число) и существующий :term:`файловый объект` с допустимым файловым дескриптором. При настройках по умолчанию «Нет» перенаправление не произойдет. :data:`PIPE` указывает, что должен быть создан новый канал для дочернего элемента. :data:`DEVNULL` указывает, что будет использоваться специальный файл :data:`os.devnull`. Кроме того, *stderr* может быть :data:`STDOUT`, что указывает на то, что данные stderr из дочернего процесса должны быть записаны в тот же дескриптор файла, что и для *stdout*.
pt_pt: *stdin*, *stdout* e *stderr* especificam os descritores de ficheiro de entrada padrão, saída padrão e erro padrão do programa executado, respetivamente. Os valores válidos são ``None``, :data:`PIPE`, :data:`DEVNULL`, um descritor de ficheiro existente (um inteiro positivo) e um :term:`objeto de ficheiro` existente com um descritor de ficheiro válido. Com as configurações predefinidas de ``None``, não ocorrerá redirecionamento. :data:`PIPE` indica que um novo pipe para o processo filho deve ser criado. :data:`DEVNULL` indica que o ficheiro especial :data:`os.devnull` será usado. Além disso, *stderr* pode ser :data:`STDOUT`, o que indica que os dados stderr do processo filho devem ser capturados no mesmo descritor de ficheiro que *stdout*.

source: If *encoding* or *errors* are specified, or *text* (also known as *universal_newlines*) is true, the file objects *stdin*, *stdout* and *stderr* will be opened in text mode using the *encoding* and *errors* specified in the call or the defaults for :class:`io.TextIOWrapper`.
ja: Якщо вказано *кодування* або *помилки*, або *текст* (також відомий як *universal_newlines*) має значення true, файлові об’єкти *stdin*, *stdout* і *stderr* буде відкрито в текстовому режимі за допомогою *кодування* і *помилки*, указані у виклику або за замовчуванням для :class:`io.TextIOWrapper`.
pt_pt: Se *encoding* ou *errors* forem especificados, ou *text* (também conhecido como *universal_newlines*) for verdadeiro, os objetos de ficheiro *stdin*, *stdout* e *stderr* serão abertos em modo de texto usando o *encoding* e *errors* especificados na chamada ou os predefinidos para :class:`io.TextIOWrapper`.
ru: Если указаны *encoding* или *errors* или *text* (также известный как *universal_newlines*) имеет значение true, файловые объекты *stdin*, *stdout* и *stderr* будут открыты в текстовом режиме с использованием *encoding * и *errors*, указанные в вызове, или значения по умолчанию для :class:`io.TextIOWrapper`.

source: For *stdin*, line ending characters ``'\n'`` in the input will be converted to the default line separator :data:`os.linesep`. For *stdout* and *stderr*, all line endings in the output will be converted to ``'\n'``. For more information see the documentation of the :class:`io.TextIOWrapper` class when the *newline* argument to its constructor is ``None``.
ja: *stdin* については、入力での行末文字 ``'\n'`` はデフォルトの行セパレーター :data:`os.linesep` に変換されます。*stdout* と *stderr* については、出力での行末はすべて ``'\n'`` に変換されます。詳細は :class:`io.TextIOWrapper` クラスのドキュメントでコンストラクターの引数 *newline* が ``None`` である場合を参照してください。
pt_pt: Para *stdin*, os caracteres de fim de linha ``'\n'`` na entrada serão convertidos para o separador de linha predefinido :data:`os.linesep`. Para *stdout* e *stderr*, todos os fins de linha na saída serão convertidos para ``'\n'``. Para mais informações, consulte a documentação da classe :class:`io.TextIOWrapper` quando o argumento *newline* para o seu construtor é ``None``.
ru: Для *stdin* символы окончания строки ``'\n'`` во входных данных будут преобразованы в разделитель строк по умолчанию :data:`os.linesep`. Для *stdout* и *stderr* все окончания строк в выводе будут преобразованы в ``'\n'``. Для получения дополнительной информации см. документацию по классу :class:`io.TextIOWrapper`, когда аргумент *newline* его конструктора имеет значение ``None``.

source: If text mode is not used, *stdin*, *stdout* and *stderr* will be opened as binary streams. No encoding or line ending conversion is performed.
ja: Якщо текстовий режим не використовується, *stdin*, *stdout* і *stderr* будуть відкриті як бінарні потоки. Кодування або перетворення закінчення рядка не виконується.
pt_pt: Se o modo de texto não for usado, *stdin*, *stdout* e *stderr* serão abertos como fluxos binários. Não é realizada nenhuma conversão de codificação ou de fim de linha.
ru: Если текстовый режим не используется, *stdin*, *stdout* и *stderr* будут открываться как двоичные потоки. Никакое кодирование или преобразование конца строки не выполняется.

source: Added the *encoding* and *errors* parameters.
ja: Добавлены параметры *encoding* и *errors*.
pt_pt: Adicionados os parâmetros *encoding* e *errors*.

source: Added the *text* parameter as an alias for *universal_newlines*.
ja: *universal_newlines* の別名として、*text* 引数が追加されました。
pt_pt: Adicionado o parâmetro *text* como um alias para *universal_newlines*.
ru: Добавлен параметр *text* в качестве псевдонима для *universal_newlines*.

source: The newlines attribute of the file objects :attr:`Popen.stdin`, :attr:`Popen.stdout` and :attr:`Popen.stderr` are not updated by the :meth:`Popen.communicate` method.
ja: ファイルオブジェクト :attr:`Popen.stdin`、:attr:`Popen.stdout` ならびに :attr:`Popen.stderr` の改行属性は :meth:`Popen.communicate` メソッドで更新されません。
pt_pt: O atributo newlines dos objetos de ficheiro :attr:`Popen.stdin`, :attr:`Popen.stdout` e :attr:`Popen.stderr` não são atualizados pelo método :meth:`Popen.communicate`.
ru: Атрибут новой строки файловых объектов :attr:`Popen.stdin`, :attr:`Popen.stdout` и :attr:`Popen.stderr` не обновляется методом :meth:`Popen.communicate`.

source: If *shell* is ``True``, the specified command will be executed through the shell. This can be useful if you are using Python primarily for the enhanced control flow it offers over most system shells and still want convenient access to other shell features such as shell pipes, filename wildcards, environment variable expansion, and expansion of ``~`` to a user's home directory. However, note that Python itself offers implementations of many shell-like features (in particular, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser`, and :mod:`shutil`).
ja: *shell* が ``True`` なら、指定されたコマンドはシェルによって実行されます。あなたが Python を主として (ほとんどのシステムシェル以上の) 強化された制御フローのために使用していて、さらにシェルパイプ、ファイル名ワイルドカード、環境変数展開、``~`` のユーザーホームディレクトリへの展開のような他のシェル機能への簡単なアクセスを望むなら、これは有用かもしれません。しかしながら、Python 自身が多くのシェル的な機能の実装を提供していることに注意してください (特に :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser`, :mod:`shutil`)。
pt_pt: Se *shell* for ``True``, o comando especificado será executado através da shell. Isto pode ser útil se estiver a usar Python principalmente pelo controlo de fluxo melhorado que oferece sobre a maioria das shells do sistema e ainda pretender acesso conveniente a outras funcionalidades da shell, como pipes da shell, curingas de nomes de ficheiros, expansão de variáveis de ambiente e expansão de ``~`` para o diretório inicial do utilizador. No entanto, note que o próprio Python oferece implementações de muitas funcionalidades semelhantes a shell (em particular, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars`, :func:`os.path.expanduser` e :mod:`shutil`).
ru: Если *shell* имеет значение True, указанная команда будет выполнена через оболочку. Это может быть полезно, если вы используете Python в первую очередь для расширенного потока управления, который он предлагает в большинстве системных оболочек, и вам все еще нужен удобный доступ к другим функциям оболочки, таким как каналы оболочки, подстановочные знаки имен файлов, расширение переменных среды и расширение ``~`` в домашний каталог пользователя. Однако обратите внимание, что сам Python предлагает реализации многих функций оболочки (в частности, :mod:`glob`, :mod:`fnmatch`, :func:`os.walk`, :func:`os.path.expandvars `, :func:`os.path.expanduser` и :mod:`shutil`).

source: When *universal_newlines* is ``True``, the class uses the encoding :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` instead of ``locale.getpreferredencoding()``. See the :class:`io.TextIOWrapper` class for more information on this change.
ja: *universal_newlines* が ``True`` の場合、クラスはエンコーディング ``locale.getpreferredencoding()`` の代わりに :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` を使用します。この変更についての詳細は、 :class:`io.TextIOWrapper` クラスを参照してください。
pt_pt: Quando *universal_newlines* é ``True``, a classe usa a codificação :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` em vez de ``locale.getpreferredencoding()``. Consulte a classe :class:`io.TextIOWrapper` para obter mais informações sobre esta alteração.
ru: Когда *universal_newlines* имеет значение True, класс использует кодировку :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` вместо ``locale.getpreferredencoding()``. Дополнительную информацию об этом изменении смотрите в классе :class:`io.TextIOWrapper`.

source: Read the `Security Considerations`_ section before using ``shell=True``.
ja: ``shell=True`` を使う前に `セキュリティで考慮すべき点`_ を読んでください。
pt_pt: Leia a secção `Considerações de Segurança`_ antes de usar ``shell=True``.
ru: Прежде чем использовать ``shell=True``, прочтите раздел ``Вопросы безопасности``.

source: These options, along with all of the other options, are described in more detail in the :class:`Popen` constructor documentation.
ja: これらのオプションは、他のすべてのオプションとともに :class:`Popen` コンストラクターのドキュメントの中でより詳細に説明されています。
pt_pt: Estas opções, juntamente com todas as outras opções, são descritas com mais detalhe na documentação do construtor :class:`Popen`.
ru: Эти параметры, наряду со всеми другими параметрами, более подробно описаны в документации конструктора :class:`Popen`.

source: Popen Constructor
ja: Popen コンストラクター
pt_pt: Construtor Popen
ru: Открытый конструктор

source: The underlying process creation and management in this module is handled by the :class:`Popen` class. It offers a lot of flexibility so that developers are able to handle the less common cases not covered by the convenience functions.
ja: このモジュールの中で、根底のプロセス生成と管理は :class:`Popen` クラスによって扱われます。簡易関数によってカバーされないあまり一般的でないケースを開発者が扱えるように、:class:`Popen` クラスは多くの柔軟性を提供しています。
pt_pt: A criação e gestão subjacentes de processos neste módulo são tratadas pela classe :class:`Popen`. Oferece muita flexibilidade para que os programadores possam lidar com casos menos comuns não cobertos pelas funções de conveniência.
ru: Создание базового процесса и управление им в этом модуле осуществляется классом :class:`Popen`. Он предлагает большую гибкость, поэтому разработчики могут обрабатывать менее распространенные случаи, не охваченные удобными функциями.

source: Execute a child program in a new process. On POSIX, the class uses :meth:`os.execvpe`-like behavior to execute the child program. On Windows, the class uses the Windows ``CreateProcess()`` function. The arguments to :class:`Popen` are as follows.
ja: 新しいプロセスで子のプログラムを実行します。POSIX においては、子のプログラムを実行するために、このクラスは :meth:`os.execvpe` のような挙動を使用します。Windows においては、このクラスは Windows の ``CreateProcess()`` 関数を使用します。:class:`Popen` への引数は以下の通りです。
pt_pt: Executa um programa filho num novo processo. Em POSIX, a classe usa um comportamento semelhante a :meth:`os.execvpe` para executar o programa filho. No Windows, a classe usa a função ``CreateProcess()`` do Windows. Os argumentos para :class:`Popen` são os seguintes.
ru: Выполнить дочернюю программу в новом процессе. В POSIX класс использует поведение, подобное :meth:`os.execvpe`, для выполнения дочерней программы. В Windows класс использует функцию Windows CreateProcess(). Аргументы :class:`Popen` следующие.

source: *args* should be a sequence of program arguments or else a single string or :term:`path-like object`. By default, the program to execute is the first item in *args* if *args* is a sequence. If *args* is a string, the interpretation is platform-dependent and described below. See the *shell* and *executable* arguments for additional differences from the default behavior. Unless otherwise stated, it is recommended to pass *args* as a sequence.
ja: *args* はプログラム引数のシーケンスか、単一の文字列または :term:`path-like object` でなければなりません。デフォルトでは、*args* がシーケンスの場合に実行されるプログラムは *args* の最初の要素です。*args* が文字列の場合、解釈はプラットフォーム依存であり、下記に説明されます。デフォルトの挙動からの追加の違いについては *shell* および *executable* 引数を参照してください。特に明記されない限り、*args* をシーケンスとして渡すことが推奨されます。
pt_pt: *args* deve ser uma sequência de argumentos de programa ou uma única string ou :term:`objeto semelhante a um caminho`. Por predefinição, o programa a executar é o primeiro item em *args* se *args* for uma sequência. Se *args* for uma string, a interpretação é dependente da plataforma e descrita abaixo. Consulte os argumentos *shell* e *executable* para diferenças adicionais em relação ao comportamento predefinido. A menos que seja indicado o contrário, é recomendado passar *args* como uma sequência.
ru: *args* должен быть последовательностью аргументов программы или одной строкой или :term:`путеподобным объектом`. По умолчанию выполняемая программа — это первый элемент в *args*, если *args* — это последовательность. Если *args* — строка, интерпретация зависит от платформы и описана ниже. Дополнительные отличия от поведения по умолчанию см. в аргументах *shell* и *executable*. Если не указано иное, рекомендуется передавать *args* как последовательность.

source: For maximum reliability, use a fully qualified path for the executable. To search for an unqualified name on :envvar:`PATH`, use :meth:`shutil.which`. On all platforms, passing :data:`sys.executable` is the recommended way to launch the current Python interpreter again, and use the ``-m`` command-line format to launch an installed module.
ja: Для максимальной надежности используйте полный путь к исполняемому файлу. Для поиска неполного имени в :envvar:`PATH` используйте :meth:`shutil. Which`. На всех платформах рекомендуется передать :data:`sys.executable` для повторного запуска текущего интерпретатора Python и использовать формат командной строки ``-m`` для запуска установленного модуля.
pt_pt: Para máxima confiabilidade, use um caminho totalmente qualificado para o executável. Para procurar um nome não qualificado em :envvar:`PATH`, use :meth:`shutil.which`. Em todas as plataformas, passar :data:`sys.executable` é a forma recomendada de lançar novamente o interpretador Python atual, e use o formato de linha de comando ``-m`` para lançar um módulo instalado.
ru: Для максимальной надежности используйте полный путь к исполняемому файлу. Для поиска неполного имени в :envvar:`PATH` используйте :meth:`shutil. Which`. На всех платформах рекомендуется передать :data:`sys.executable` для повторного запуска текущего интерпретатора Python и использовать формат командной строки ``-m`` для запуска установленного модуля.
