Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sunau.po
Languages: ru

source: :mod:`sunau` --- Read and write Sun AU files
ru: :mod:`sunau` --- Чтение и запись файлов Sun AU.

source: **Source code:** :source:`Lib/sunau.py`
ru: **Исходный код:** :source:`Lib/sunau.py`

source: The :mod:`sunau` module is deprecated (see :pep:`PEP 594 <594#sunau>` for details).
ru: Модуль :mod:`sunau` устарел (подробности см. в :pep:`PEP 594 <594#sunau>`).

source: The :mod:`sunau` module provides a convenient interface to the Sun AU sound format. Note that this module is interface-compatible with the modules :mod:`aifc` and :mod:`wave`.
ru: Модуль :mod:`sunau` обеспечивает удобный интерфейс со звуковым форматом Sun AU. Обратите внимание, что этот модуль совместим по интерфейсу с модулями :mod:`aifc` и :mod:`wave`.

source: An audio file consists of a header followed by the data. The fields of the header are:
ru: Аудиофайл состоит из заголовка, за которым следуют данные. Поля заголовка:

source: Field
ru: Поле

source: Contents
ru: Содержание

source: magic word
ru: волшебное слово

source: The four bytes ``.snd``.
ru: Четыре байта ``.snd``.

source: header size
ru: Размер заголовка

source: Size of the header, including info, in bytes.
ru: Размер заголовка, включая информацию, в байтах.

source: data size
ru: размер данных

source: Physical size of the data, in bytes.
ru: Физический размер данных в байтах.

source: encoding
ru: кодирование

source: Indicates how the audio samples are encoded.
ru: Указывает, как кодируются аудиосэмплы.

source: sample rate
ru: частота дискретизации

source: The sampling rate.
ru: Частота дискретизации.

source: # of channels
ru: # каналов

source: The number of channels in the samples.
ru: Количество каналов в выборках.

source: info
ru: информация

source: ASCII string giving a description of the audio file (padded with null bytes).
ru: Строка ASCII, дающая описание аудиофайла (дополненная нулевыми байтами).

source: Apart from the info field, all header fields are 4 bytes in size. They are all 32-bit unsigned integers encoded in big-endian byte order.
ru: За исключением информационного поля, все поля заголовка имеют размер 4 байта. Все они представляют собой 32-битные целые числа без знака, закодированные в порядке байтов с обратным порядком байтов.

source: The :mod:`sunau` module defines the following functions:
ru: Модуль :mod:`sunau` определяет следующие функции:

source: If *file* is a string, open the file by that name, otherwise treat it as a seekable file-like object. *mode* can be any of
ru: Если *file* — это строка, откройте файл с этим именем, в противном случае рассматривайте его как объект, подобный файлу, доступный для поиска. *режим* может быть любым из

source: Read only mode.
ru: Режим "только для чтения".

source: Write only mode.
ru: Режим "только запись".

source: Note that it does not allow read/write files.
ru: Обратите внимание, что он не позволяет читать/записывать файлы.

source: A *mode* of ``'r'`` returns an :class:`AU_read` object, while a *mode* of ``'w'`` or ``'wb'`` returns an :class:`AU_write` object.
ru: *mode* ``'r'`` возвращает объект :class:`AU_read`, тогда как *mode* ``'w'`` или ``'wb'`` возвращает :class:`AU_write `объект.

source: The :mod:`sunau` module defines the following exception:
ru: Модуль :mod:`sunau` определяет следующее исключение:

source: An error raised when something is impossible because of Sun AU specs or implementation deficiency.
ru: Ошибка возникает, когда что-то невозможно из-за спецификаций Sun AU или недостатков реализации.

source: The :mod:`sunau` module defines the following data items:
ru: Модуль :mod:`sunau` определяет следующие элементы данных:

source: An integer every valid Sun AU file begins with, stored in big-endian form. This is the string ``.snd`` interpreted as an integer.
ru: Целое число, с которого начинается каждый действительный файл Sun AU, сохраненное в форме с прямым порядком байтов. Это строка ``.snd``, интерпретируемая как целое число.

source: Values of the encoding field from the AU header which are supported by this module.
ru: Значения поля кодировки из заголовка AU, которые поддерживаются этим модулем.

source: Additional known values of the encoding field from the AU header, but which are not supported by this module.
ru: Дополнительные известные значения поля кодировки из заголовка AU, но не поддерживаемые данным модулем.

source: AU_read Objects
ru: Объекты AU_read

source: AU_read objects, as returned by :func:`.open` above, have the following methods:
ru: Объекты AU_read, возвращаемые функцией :func:`.open` выше, имеют следующие методы:

source: Close the stream, and make the instance unusable. (This is called automatically on deletion.)
ru: Закройте поток и сделайте экземпляр непригодным для использования. (Это вызывается автоматически при удалении.)

source: Returns number of audio channels (1 for mono, 2 for stereo).
ru: Возвращает количество аудиоканалов (1 для моно, 2 для стерео).

source: Returns sample width in bytes.
ru: Возвращает ширину выборки в байтах.

source: Returns sampling frequency.
ru: Возвращает частоту дискретизации.

source: Returns number of audio frames.
ru: Возвращает количество аудиокадров.

source: Returns compression type. Supported compression types are ``'ULAW'``, ``'ALAW'`` and ``'NONE'``.
ru: Возвращает тип сжатия. Поддерживаемые типы сжатия: ``'ULAW'``, ``'ALAW'`` и ``'NONE'``.

source: Human-readable version of :meth:`getcomptype`. The supported types have the respective names ``'CCITT G.711 u-law'``, ``'CCITT G.711 A-law'`` and ``'not compressed'``.
ru: Удобочитаемая версия :meth:`getcomptype`. Поддерживаемые типы имеют соответствующие имена «CCITT G.711 u-law», «CCITT G.711 A-law» и «not Compressed».

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
ru: Возвращает :func:`~collections.namedtuple` ``(nchannels, sampwidth, Framerate, nframes, comptype, compname)``, эквивалентный выводу методов :meth:`get\*`.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object. The data will be returned in linear format. If the original data is in u-LAW format, it will be converted.
ru: Считывает и возвращает не более *n* кадров аудио в виде объекта :class:`bytes`. Данные будут возвращены в линейном формате. Если исходные данные имеют формат u-LAW, они будут преобразованы.

source: Rewind the file pointer to the beginning of the audio stream.
ru: Перемотайте указатель файла назад к началу аудиопотока.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
ru: Следующие два метода определяют термин «позиция», который совместим между ними и в остальном зависит от реализации.

source: Set the file pointer to the specified position. Only values returned from :meth:`tell` should be used for *pos*.
ru: Установите указатель файла в указанную позицию. Для *pos* следует использовать только значения, возвращаемые из :meth:`tell`.

source: Return current file pointer position. Note that the returned value has nothing to do with the actual position in the file.
ru: Возвращает текущую позицию указателя файла. Обратите внимание, что возвращаемое значение не имеет ничего общего с фактической позицией в файле.

source: The following two functions are defined for compatibility with the :mod:`aifc`, and don't do anything interesting.
ru: Следующие две функции определены для совместимости с :mod:`aifc` и не делают ничего интересного.

source: Returns ``None``.
ru: Возвращает ``Нет``.

source: Raise an error.
ru: Выдать ошибку.

source: AU_write Objects
ru: Объекты AU_write

source: AU_write objects, as returned by :func:`.open` above, have the following methods:
ru: Объекты AU_write, возвращаемые функцией :func:`.open` выше, имеют следующие методы:

source: Set the number of channels.
ru: Установите количество каналов.

source: Set the sample width (in bytes.)
ru: Установите ширину выборки (в байтах).

source: Added support for 24-bit samples.
ru: Добавлена ​​поддержка 24-битных сэмплов.

source: Set the frame rate.
ru: Установите частоту кадров.

source: Set the number of frames. This can be later changed, when and if more frames are written.
ru: Установите количество кадров. Позже это можно будет изменить, когда и если будет записано больше кадров.

source: Set the compression type and description. Only ``'NONE'`` and ``'ULAW'`` are supported on output.
ru: Установите тип сжатия и описание. На выходе поддерживаются только NONE и ULAW.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the :meth:`set\*` methods. Set all parameters.
ru: *Кортеж* должен быть ``(nchannels, sampwidth, Framerate, nframes, comptype, compname)`` со значениями, допустимыми для методов :meth:`set\*`. Установите все параметры.

source: Return current position in the file, with the same disclaimer for the :meth:`AU_read.tell` and :meth:`AU_read.setpos` methods.
ru: Возвращает текущую позицию в файле с тем же отказом от ответственности для методов :meth:`AU_read.tell` и :meth:`AU_read.setpos`.

source: Write audio frames, without correcting *nframes*.
ru: Записывайте аудиокадры, не исправляя *nframes*.

source: Any :term:`bytes-like object` is now accepted.
ru: Теперь принимается любой :term:`байтовый объект`.

source: Write audio frames and make sure *nframes* is correct.
ru: Запишите аудиокадры и убедитесь, что *nframes* верен.

source: Make sure *nframes* is correct, and close the file.
ru: Убедитесь, что *nframes* указан правильно, и закройте файл.

source: This method is called upon deletion.
ru: Этот метод вызывается при удалении.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`.
ru: Обратите внимание, что недопустимо устанавливать какие-либо параметры после вызова :meth:`writeframes` или :meth:`writeframesraw`.
