Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sysconfig.po
Languages: pt_pt, ru, sv, uk

source: Another possibility is a network filesystem where the name used to write to a remote directory is different from the name used to read it: for example, the Python interpreter accessed as :file:`/usr/local/bin/python` might search for modules in :file:`/usr/local/lib/python2.{X}`, but those modules would have to be installed to, say, :file:`/mnt/{@server}/export/lib/python2.{X}`.
pt_pt: Outra possibilidade é um sistema de ficheiros de rede onde o nome usado para escrever num diretório remoto é diferente do nome usado para o ler: por exemplo, o interpretador Python acedido como :file:`/usr/local/bin/python` pode procurar módulos em :file:`/usr/local/lib/python2.{X}`, mas esses módulos teriam de ser instalados em, digamos, :file:`/mnt/{@server}/export/lib/python2.{X}`.
ru: Другой возможностью является сетевая файловая система, в которой имя, используемое для записи в удаленный каталог, отличается от имени, используемого для его чтения: например, интерпретатор Python, доступный как :file:`/usr/local/bin/python`, может искать модули в :file:`/usr/local/lib/python2.{X}`, но эти модули необходимо будет установить, скажем, в :file:`/mnt/{@server}/export/lib/python2. {X}`.
sv: En annan möjlighet är ett nätverksfilsystem där det namn som används för att skriva till en fjärrkatalog skiljer sig från det namn som används för att läsa den: till exempel kan Python-tolken som nås som :file:`/usr/local/bin/python` söka efter moduler i :file:`/usr/local/lib/python2.{X}`, men dessa moduler måste installeras i till exempel :file:`/mnt/{@server}/export/lib/python2.{X}`.

source: Installation path functions
pt_pt: Funções de caminhos de instalação
ru: Функции пути установки
sv: Funktioner för installationssökväg

source: :mod:`sysconfig` provides some functions to determine these installation paths.
pt_pt: :mod:`sysconfig` fornece algumas funções para determinar estes caminhos de instalação.
ru: :mod:`sysconfig` предоставляет некоторые функции для определения этих путей установки.
sv: :mod:`sysconfig` tillhandahåller vissa funktioner för att bestämma dessa installationssökvägar.

source: Return a tuple containing all schemes currently supported in :mod:`sysconfig`.
pt_pt: Devolve um tuplo contendo todos os esquemas atualmente suportados em :mod:`sysconfig`.
ru: Возвращает кортеж, содержащий все схемы, которые в настоящее время поддерживаются в :mod:`sysconfig`.
sv: Returnerar en tupel som innehåller alla scheman som för närvarande stöds i :mod:`sysconfig`.
uk: Повертає кортеж, що містить усі схеми, які наразі підтримуються в :mod:`sysconfig`.

source: Return the default scheme name for the current platform.
pt_pt: Devolve o nome do esquema predefinido para a plataforma atual.
ru: Верните имя схемы по умолчанию для текущей платформы.
sv: Returnerar standardschemanamnet för den aktuella plattformen.
uk: Повернути назву схеми за замовчуванням для поточної платформи.

source: This function was previously named ``_get_default_scheme()`` and considered an implementation detail.
pt_pt: Esta função era anteriormente chamada ``_get_default_scheme()`` e era considerada um detalhe de implementação.
ru: Эта функция ранее называлась ``_get_default_scheme()`` и рассматривалась как деталь реализации.
sv: Denna funktion hette tidigare ``_get_default_scheme()`` och betraktades som en implementeringsdetalj.
uk: Ця функція раніше називалася ``_get_default_scheme()`` і вважалася деталлю реалізації.

source: When Python runs from a virtual environment, the *venv* scheme is returned.
pt_pt: Quando o Python é executado a partir de um ambiente virtual, o esquema *venv* é devolvido.
ru: Когда Python запускается из виртуальной среды, возвращается схема *venv*.
sv: När Python körs från en virtuell miljö returneras schemat *venv*.

source: Return a preferred scheme name for an installation layout specified by *key*.
pt_pt: Devolve um nome de esquema preferido para um layout de instalação especificado por *key*.
ru: Возвращает имя предпочтительной схемы для макета установки, указанного *key*.
sv: Returnerar ett föredraget systemnamn för en installationslayout som anges av *key*.
uk: Повертає бажану назву схеми для макета встановлення, визначеного *ключом*.

source: *key* must be either ``"prefix"``, ``"home"``, or ``"user"``.
pt_pt: *key* deve ser ``"prefix"``, ``"home"``, ou ``"user"``.
ru: *key* должен быть либо ``"prefix", ``"home"``, либо ``"user"``.
sv: *key* måste vara antingen ``"prefix"``, ``"home"`` eller ``"user"``.
uk: *key* має бути ``"prefix"``, ``"home"`` або ``"user"``.

source: The return value is a scheme name listed in :func:`get_scheme_names`. It can be passed to :mod:`sysconfig` functions that take a *scheme* argument, such as :func:`get_paths`.
pt_pt: O valor devolvido é um nome de esquema listado em :func:`get_scheme_names`. Pode ser passado para funções :mod:`sysconfig` que aceitam um argumento *scheme*, como :func:`get_paths`.
ru: Возвращаемое значение — это имя схемы, указанное в :func:`get_scheme_names`. Его можно передать функциям :mod:`sysconfig`, которые принимают аргумент *scheme*, например :func:`get_paths`.
sv: Returvärdet är ett schemanamn som listas i :func:`get_scheme_names`. Det kan skickas till :mod:`sysconfig`\-funktioner som tar ett *scheme*-argument, t.ex. :func:`get_paths`.
uk: Поверненим значенням є назва схеми, указана в :func:`get_scheme_names`. Його можна передати до функцій :mod:`sysconfig`, які приймають аргумент *scheme*, наприклад :func:`get_paths`.

source: When Python runs from a virtual environment and ``key="prefix"``, the *venv* scheme is returned.
pt_pt: Quando o Python é executado a partir de um ambiente virtual e ``key="prefix"``, o esquema *venv* é devolvido.
ru: Когда Python запускается из виртуальной среды и ``key="prefix"``, возвращается схема *venv*.
sv: När Python körs från en virtuell miljö och ``key="prefix"``, returneras *venv*-schemat.

source: Return a dict containing preferred scheme names on the current platform. Python implementers and redistributors may add their preferred schemes to the ``_INSTALL_SCHEMES`` module-level global value, and modify this function to return those scheme names, to e.g. provide different schemes for system and language package managers to use, so packages installed by either do not mix with those by the other.
pt_pt: Devolve um dicionário contendo nomes de esquemas preferidos na plataforma atual. Os implementadores e redistribuidores do Python podem adicionar os seus esquemas preferidos ao valor global de nível de módulo ``_INSTALL_SCHEMES`` e modificar esta função para devolver esses nomes de esquemas, por exemplo, para fornecer esquemas diferentes para gestores de pacotes do sistema e da linguagem usarem, de modo a que os pacotes instalados por um não se misturem com os do outro.
ru: Верните словарь, содержащий имена предпочтительных схем на текущей платформе. Разработчики и распространители Python могут добавлять свои предпочтительные схемы к глобальному значению уровня модуля ``_INSTALL_SCHEMES`` и модифицировать эту функцию, чтобы она возвращала имена этих схем, например, предоставляя различные схемы для использования менеджерами системных и языковых пакетов, чтобы пакеты, установленные либо не смешивайте с теми, что с другими.
sv: Returnerar en dict som innehåller namn på föredragna system på den aktuella plattformen. Python-implementerare och redistributörer kan lägga till sina föredragna scheman till det globala värdet ``_INSTALL_SCHEMES`` på modulnivå och modifiera denna funktion för att returnera dessa schemanamn, för att t.ex. tillhandahålla olika scheman för system- och språkpakethanterare att använda, så att paket som installeras av endera inte blandas med dem av den andra.
uk: Повертає dict, що містить бажані назви схем на поточній платформі. Розробники та розповсюджувачі Python можуть додати бажані схеми до глобального значення рівня модуля ``_INSTALL_SCHEMES`` і змінити цю функцію, щоб повернути ці назви схем, наприклад. забезпечують різні схеми для використання системними та мовними менеджерами пакунків, тому пакунки, встановлені одним із них, не змішуються з пакетами іншого.

source: End users should not use this function, but :func:`get_default_scheme` and :func:`get_preferred_scheme` instead.
pt_pt: Os utilizadores finais não devem usar esta função, mas sim :func:`get_default_scheme` e :func:`get_preferred_scheme`.
sv: Slutanvändare bör inte använda denna funktion, utan istället :func:`get_default_scheme` och :func:`get_preferred_scheme`.

source: Return a tuple containing all path names currently supported in :mod:`sysconfig`.
pt_pt: Devolve um tuplo contendo todos os nomes de caminhos atualmente suportados em :mod:`sysconfig`.
ru: Возвращает кортеж, содержащий все имена путей, которые в настоящее время поддерживаются в :mod:`sysconfig`.
sv: Returnerar en tupel som innehåller alla sökvägsnamn som för närvarande stöds i :mod:`sysconfig`.
uk: Повертає кортеж, що містить усі назви шляхів, які зараз підтримуються в :mod:`sysconfig`.

source: Return an installation path corresponding to the path *name*, from the install scheme named *scheme*.
pt_pt: Devolve um caminho de instalação correspondente ao caminho *name*, do esquema de instalação nomeado *scheme*.
ru: Возвращает путь установки, соответствующий пути *имя*, из схемы установки с именем *scheme*.
sv: Returnerar en installationssökväg som motsvarar sökvägen *name*, från installationsschemat med namnet *scheme*.
uk: Повертає шлях встановлення, що відповідає шляху *ім’я* зі схеми встановлення під назвою *схема*.

source: *name* has to be a value from the list returned by :func:`get_path_names`.
pt_pt: *name* tem de ser um valor da lista devolvida por :func:`get_path_names`.
ru: *name* должно быть значением из списка, возвращаемого :func:`get_path_names`.
sv: *name* måste vara ett värde från den lista som returneras av :func:`get_path_names`.
uk: *name* має бути значенням зі списку, який повертає :func:`get_path_names`.

source: :mod:`sysconfig` stores installation paths corresponding to each path name, for each platform, with variables to be expanded. For instance the *stdlib* path for the *nt* scheme is: ``{base}/Lib``.
pt_pt: :mod:`sysconfig` armazena caminhos de instalação correspondentes a cada nome de caminho, para cada plataforma, com variáveis a serem expandidas. Por exemplo, o caminho *stdlib* para o esquema *nt* é: ``{base}/Lib``.
ru: :mod:`sysconfig` хранит пути установки, соответствующие каждому имени пути, для каждой платформы, с переменными, которые нужно расширить. Например, путь *stdlib* для схемы *nt*: ``{base}/Lib``.
sv: :mod:`sysconfig` lagrar installationssökvägar som motsvarar varje sökvägsnamn, för varje plattform, med variabler som kan utökas. Till exempel är *stdlib*-sökvägen för *nt*-schemat: ``{base}/Lib``.
uk: :mod:`sysconfig` зберігає шляхи встановлення, що відповідають кожному імені шляху, для кожної платформи, зі змінними, які можна розширити. Наприклад, шлях *stdlib* для схеми *nt* такий: ``{base}/Lib``.

source: :func:`get_path` will use the variables returned by :func:`get_config_vars` to expand the path. All variables have default values for each platform so one may call this function and get the default value.
pt_pt: :func:`get_path` usará as variáveis devolvidas por :func:`get_config_vars` para expandir o caminho. Todas as variáveis têm valores predefinidos para cada plataforma, por isso pode-se chamar esta função e obter o valor predefinido.
ru: :func:`get_path` будет использовать переменные, возвращаемые :func:`get_config_vars`, для расширения пути. Все переменные имеют значения по умолчанию для каждой платформы, поэтому можно вызвать эту функцию и получить значение по умолчанию.
sv: :func:`get_path` kommer att använda de variabler som returneras av :func:`get_config_vars` för att expandera sökvägen. Alla variabler har standardvärden för varje plattform, så man kan anropa den här funktionen och få standardvärdet.
uk: :func:`get_path` використовуватиме змінні, які повертає :func:`get_config_vars`, щоб розширити шлях. Усі змінні мають значення за замовчуванням для кожної платформи, тому можна викликати цю функцію та отримати значення за замовчуванням.

source: If *scheme* is provided, it must be a value from the list returned by :func:`get_scheme_names`. Otherwise, the default scheme for the current platform is used.
pt_pt: Se *scheme* for fornecido, deve ser um valor da lista devolvida por :func:`get_scheme_names`. Caso contrário, é usado o esquema predefinido para a plataforma atual.
ru: Если указана *scheme*, это должно быть значение из списка, возвращаемого :func:`get_scheme_names`. В противном случае используется схема по умолчанию для текущей платформы.
sv: Om *scheme* anges måste det vara ett värde från listan som returneras av :func:`get_scheme_names`. Annars används standardschemat för den aktuella plattformen.
uk: Якщо вказано *схему*, це має бути значення зі списку, який повертає :func:`get_scheme_names`. В іншому випадку використовується схема за замовчуванням для поточної платформи.

source: If *vars* is provided, it must be a dictionary of variables that will update the dictionary returned by :func:`get_config_vars`.
pt_pt: Se *vars* for fornecido, deve ser um dicionário de variáveis que atualizará o dicionário devolvido por :func:`get_config_vars`.
ru: Если указана *vars*, это должен быть словарь переменных, который обновит словарь, возвращаемый :func:`get_config_vars`.
sv: Om *vars* anges måste det vara en ordlista med variabler som uppdaterar den ordlista som returneras av :func:`get_config_vars`.

source: If *expand* is set to ``False``, the path will not be expanded using the variables.
pt_pt: Se *expand* for definido como ``False``, o caminho não será expandido usando as variáveis.
ru: Если для *expand* установлено значение False, путь не будет расширяться с использованием переменных.
sv: Om *expand* är satt till ``False`` kommer sökvägen inte att expanderas med hjälp av variablerna.
uk: Якщо *expand* має значення ``False``, шлях не буде розгортатися за допомогою змінних.

source: If *name* is not found, raise a :exc:`KeyError`.
pt_pt: Se *name* não for encontrado, levanta um :exc:`KeyError`.
ru: Если *name* не найдено, вызовите :exc:`KeyError`.
sv: Om *name* inte hittas, utlöses ett :exc:`KeyError`.
uk: Якщо *name* не знайдено, викликайте :exc:`KeyError`.

source: Return a dictionary containing all installation paths corresponding to an installation scheme. See :func:`get_path` for more information.
pt_pt: Devolve um dicionário contendo todos os caminhos de instalação correspondentes a um esquema de instalação. Veja :func:`get_path` para mais informações.
ru: Возвращает словарь, содержащий все пути установки, соответствующие схеме установки. См. :func:`get_path` для получения дополнительной информации.
sv: Returnerar en ordbok som innehåller alla installationssökvägar som motsvarar ett installationsschema. Se :func:`get_path` för mer information.
uk: Повертає словник, що містить усі шляхи встановлення, що відповідають схемі встановлення. Дивіться :func:`get_path` для отримання додаткової інформації.

source: If *scheme* is not provided, will use the default scheme for the current platform.
pt_pt: Se *scheme* não for fornecido, será usado o esquema predefinido para a plataforma atual.
ru: Если *схема* не указана, будет использоваться схема по умолчанию для текущей платформы.
sv: Om *scheme* inte anges används standardschemat för den aktuella plattformen.
uk: Якщо *схема* не вказана, використовуватиметься схема за замовчуванням для поточної платформи.

source: If *vars* is provided, it must be a dictionary of variables that will update the dictionary used to expand the paths.
pt_pt: Se *vars* for fornecido, deve ser um dicionário de variáveis que atualizará o dicionário usado para expandir os caminhos.
ru: Если указано *vars*, это должен быть словарь переменных, который будет обновлять словарь, используемый для расширения путей.
sv: Om *vars* anges måste det vara en ordlista med variabler som uppdaterar den ordlista som används för att expandera sökvägarna.
uk: Якщо надано *vars*, це має бути словник змінних, який оновлюватиме словник, що використовується для розширення шляхів.

source: If *expand* is set to false, the paths will not be expanded.
pt_pt: Se *expand* for definido como falso, os caminhos não serão expandidos.
ru: Если для параметра *expand* установлено значение false, пути не будут расширены.
sv: Om *expand* är satt till false kommer sökvägarna inte att expanderas.
uk: Якщо *expand* має значення false, шляхи не розгортатимуться.

source: If *scheme* is not an existing scheme, :func:`get_paths` will raise a :exc:`KeyError`.
pt_pt: Se *scheme* não for um esquema existente, :func:`get_paths` levantará um :exc:`KeyError`.
ru: Если *схема* не является существующей схемой, :func:`get_paths` вызовет :exc:`KeyError`.
sv: Om *scheme* inte är ett befintligt schema kommer :func:`get_paths` att ge upphov till ett :exc:`KeyError`.
uk: Якщо *scheme* не є існуючою схемою, :func:`get_paths` викличе :exc:`KeyError`.

source: Other functions
pt_pt: Outras funções
ru: Другие функции
sv: Övriga funktioner
uk: Інші функції

source: Return the ``MAJOR.MINOR`` Python version number as a string. Similar to ``'%d.%d' % sys.version_info[:2]``.
pt_pt: Devolve o número de versão do Python no formato ``MAJOR.MINOR`` como uma string. Semelhante a ``'%d.%d' % sys.version_info[:2]``.
ru: Возвращает номер версии Python ``MAJOR.MINOR`` в виде строки. Похоже на: ``' %д . %д ' % sys.version_info[:2]``.
sv: Returnerar Pythons ``MAJOR.MINOR`` versionsnummer som en sträng. Liknar ``'%d.%d' % sys.version_info[:2]``.
uk: Повертає ``MAJOR.MINOR`` номер версії Python у вигляді рядка. Подібно до ``'%d.%d' % sys.version_info[:2]``.

source: Return a string that identifies the current platform.
pt_pt: Devolve uma string que identifica a plataforma atual.
ru: Возвращает строку, идентифицирующую текущую платформу.
sv: Returnerar en sträng som identifierar den aktuella plattformen.
uk: Повертає рядок, що ідентифікує поточну платформу.

source: This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by :func:`os.uname`), although the exact information included depends on the OS; e.g., on Linux, the kernel version isn't particularly important.
pt_pt: Isto é usado principalmente para distinguir diretórios de construção específicos da plataforma e distribuições construídas específicas da plataforma. Normalmente inclui o nome e versão do SO e a arquitetura (como fornecido por :func:`os.uname`), embora a informação exata incluída dependa do SO; por exemplo, no Linux, a versão do kernel não é particularmente importante.
sv: Detta används främst för att skilja mellan plattformsspecifika byggkataloger och plattformsspecifikt byggda distributioner. Innehåller vanligtvis operativsystemets namn och version samt arkitektur (enligt :func:`os.uname`), men exakt vilken information som ingår beror på operativsystemet; t.ex. är kärnversionen inte särskilt viktig för Linux.

source: Examples of returned values:
pt_pt: Exemplos de valores devolvidos:
ru: Примеры возвращаемых значений:
sv: Exempel på returnerade värden:
uk: Приклади повернених значень:

source: Windows will return one of:
ru: Windows вернет одно из:
sv: Windows kommer att returnera en av:
uk: Windows поверне одне з:

source: win-amd64 (64-bit Windows on AMD64, aka x86_64, Intel64, and EM64T)
pt_pt: win-amd64 (Windows de 64 bits em AMD64, também conhecido como x86_64, Intel64 e EM64T)
sv: win-amd64 (64-bitars Windows på AMD64, även känt som x86_64, Intel64 och EM64T)

source: win-arm64 (64-bit Windows on ARM64, aka AArch64)
pt_pt: win-arm64 (Windows de 64 bits em ARM64, também conhecido como AArch64)
sv: win-arm64 (64-bitars Windows på ARM64, även kallat AArch64)

source: win32 (all others - specifically, sys.platform is returned)
pt_pt: win32 (todos os outros - especificamente, sys.platform é devolvido)
ru: win32 (все остальные — в частности, возвращается sys.platform)
sv: win32 (alla andra - specifikt returneras sys.platform)
uk: win32 (усі інші - зокрема повертається sys.platform)

source: macOS can return:
ru: macOS может вернуть:
sv: macOS kan returnera:
uk: macOS може повертати:

source: For other non-POSIX platforms, currently just returns :data:`sys.platform`.
pt_pt: Para outras plataformas não-POSIX, atualmente apenas devolve :data:`sys.platform`.
ru: Для других платформ, отличных от POSIX, в настоящее время просто возвращается :data:`sys.platform`.
sv: För andra icke-POSIX-plattformar returneras för närvarande bara :data:`sys.platform`.
uk: Для інших платформ, відмінних від POSIX, наразі повертає лише :data:`sys.platform`.

source: Return ``True`` if the running Python interpreter was built from source and is being run from its built location, and not from a location resulting from e.g. running ``make install`` or installing via a binary installer.
pt_pt: Devolve ``True`` se o interpretador Python em execução foi construído a partir do código-fonte e está a ser executado a partir do seu local de construção, e não de um local resultante de, por exemplo, executar ``make install`` ou instalar através de um instalador binário.
ru: Возвращайте ``True``, если работающий интерпретатор Python был собран из исходного кода и запускается из места его сборки, а не из местоположения, полученного, например, в результате запуска ``make install`` или установки через двоичный установщик.
sv: Returnerar ``True`` om den Python-tolk som körs byggdes från källan och körs från dess byggda plats, och inte från en plats som härrör från t.ex. körning av ``make install`` eller installation via ett binärt installationsprogram.
uk: Повертає ``True``, якщо запущений інтерпретатор Python був зібраний із вихідного коду та запускається зі свого зібраного розташування, а не з розташування, яке є результатом, наприклад, запуск ``make install`` або встановлення через бінарний інсталятор.

source: Parse a :file:`config.h`\-style file.
pt_pt: Analisa um ficheiro no estilo :file:`config.h`.
ru: Разберите файл стиля :file:`config.h`\.
sv: Analysera en fil i stil med :file:`config.h`.
uk: Проаналізуйте файл у стилі :file:`config.h`\.

source: *fp* is a file-like object pointing to the :file:`config.h`\-like file.
pt_pt: *fp* é um objeto tipo ficheiro que aponta para o ficheiro do tipo :file:`config.h`.
ru: *fp* — файловоподобный объект, указывающий на файл, подобный :file:`config.h`\.
sv: *fp* är ett filliknande objekt som pekar på den :file:`config.h`\-liknande filen.
uk: *fp* — це файлоподібний об’єкт, що вказує на :file:`config.h`\подібний файл.

source: A dictionary containing name/value pairs is returned. If an optional dictionary is passed in as the second argument, it is used instead of a new dictionary, and updated with the values read in the file.
pt_pt: É devolvido um dicionário contendo pares nome/valor. Se um dicionário opcional for passado como segundo argumento, é usado em vez de um novo dicionário, e é atualizado com os valores lidos no ficheiro.
ru: Возвращается словарь, содержащий пары имя/значение. Если в качестве второго аргумента передается необязательный словарь, он используется вместо нового словаря и обновляется значениями, считанными в файле.
sv: En ordbok som innehåller namn/värde-par returneras. Om en valfri ordbok skickas in som andra argument används den i stället för en ny ordbok och uppdateras med de värden som läses in i filen.
uk: Повертається словник, що містить пари ім’я/значення. Якщо додатковий словник передається як другий аргумент, він використовується замість нового словника та оновлюється значеннями, зчитаними у файлі.
