Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sysconfig.po
Languages: pt_pt, ru, sv, uk

source: :mod:`!sysconfig` --- Provide access to Python's configuration information
pt_pt: :mod:`!sysconfig` --- Fornecer acesso à informação de configuração do Python
sv: :mod:`!sysconfig` --- Ger tillgång till Pythons konfigurationsinformation

source: **Source code:** :source:`Lib/sysconfig`
sv: **Källkod:** :source:`Lib/sysconfig`

source: The :mod:`sysconfig` module provides access to Python's configuration information like the list of installation paths and the configuration variables relevant for the current platform.
pt_pt: O módulo :mod:`sysconfig` fornece acesso à informação de configuração do Python, como a lista de caminhos de instalação e as variáveis de configuração relevantes para a plataforma atual.
ru: Модуль :mod:`sysconfig` обеспечивает доступ к информации о конфигурации Python, такой как список путей установки и переменные конфигурации, соответствующие текущей платформе.
sv: Modulen :mod:`sysconfig` ger tillgång till Pythons konfigurationsinformation, t.ex. listan över installationssökvägar och de konfigurationsvariabler som är relevanta för den aktuella plattformen.
uk: Модуль :mod:`sysconfig` надає доступ до конфігураційної інформації Python, наприклад до списку шляхів інсталяції та змінних конфігурації, що стосуються поточної платформи.

source: Configuration variables
pt_pt: Variáveis de configuração
ru: Переменные конфигурации
sv: Variabler för konfiguration
uk: Конфігураційні змінні

source: A Python distribution contains a :file:`Makefile` and a :file:`pyconfig.h` header file that are necessary to build both the Python binary itself and third-party C extensions compiled using ``setuptools``.
pt_pt: Uma distribuição Python contém um ficheiro :file:`Makefile` e um ficheiro de cabeçalho :file:`pyconfig.h` que são necessários para construir tanto o binário do Python em si como extensões C de terceiros compiladas usando ``setuptools``.
sv: En Python-distribution innehåller en :file:`Makefile` och en :file:`pyconfig.h` header-fil som är nödvändiga för att bygga både Python-binären själv och C-tillägg från tredje part som kompileras med ``setuptools``.

source: :mod:`sysconfig` puts all variables found in these files in a dictionary that can be accessed using :func:`get_config_vars` or :func:`get_config_var`.
pt_pt: :mod:`sysconfig` coloca todas as variáveis encontradas nestes ficheiros num dicionário que pode ser acedido usando :func:`get_config_vars` ou :func:`get_config_var`.
ru: :mod:`sysconfig` помещает все переменные, найденные в этих файлах, в словарь, доступ к которому можно получить с помощью :func:`get_config_vars` или :func:`get_config_var`.
sv: :mod:`sysconfig` placerar alla variabler som finns i dessa filer i en ordbok som kan nås med :func:`get_config_vars` eller :func:`get_config_var`.
uk: :mod:`sysconfig` поміщає всі змінні, знайдені в цих файлах, у словник, до якого можна отримати доступ за допомогою :func:`get_config_vars` або :func:`get_config_var`.

source: Notice that on Windows, it's a much smaller set.
pt_pt: Note que no Windows, é um conjunto muito menor.
ru: Обратите внимание, что в Windows этот набор намного меньше.
sv: Observera att på Windows är det en mycket mindre uppsättning.
uk: Зверніть увагу, що в Windows це набагато менший набір.

source: With no arguments, return a dictionary of all configuration variables relevant for the current platform.
pt_pt: Sem argumentos, devolve um dicionário de todas as variáveis de configuração relevantes para a plataforma atual.
ru: Без аргументов возвращает словарь всех переменных конфигурации, соответствующих текущей платформе.
sv: Returnerar utan argument en ordbok med alla konfigurationsvariabler som är relevanta för den aktuella plattformen.
uk: Без аргументів повертає словник усіх змінних конфігурації, що стосуються поточної платформи.

source: With arguments, return a list of values that result from looking up each argument in the configuration variable dictionary.
pt_pt: Com argumentos, devolve uma lista de valores que resultam da pesquisa de cada argumento no dicionário de variáveis de configuração.
ru: С аргументами верните список значений, полученных в результате поиска каждого аргумента в словаре переменных конфигурации.
sv: Med argument returneras en lista med värden som blir resultatet av en sökning efter varje argument i konfigurationsvariabelns ordbok.
uk: За допомогою аргументів повертає список значень, які є результатом пошуку кожного аргументу в словнику змінних конфігурації.

source: For each argument, if the value is not found, return ``None``.
pt_pt: Para cada argumento, se o valor não for encontrado, devolve ``None``.
ru: Если значение не найдено для каждого аргумента, верните None.
sv: För varje argument, om värdet inte hittas, returneras ``None``.
uk: Для кожного аргументу, якщо значення не знайдено, поверніть ``None``.

source: Return the value of a single variable *name*. Equivalent to ``get_config_vars().get(name)``.
pt_pt: Devolve o valor de uma única variável *name*. Equivalente a ``get_config_vars().get(name)``.
ru: Возвращает значение одной переменной *имя*. Эквивалентно ``get_config_vars().get(name)``.
sv: Returnerar värdet för en enskild variabel *namn*. Motsvarar ``get_config_vars().get(name)``.
uk: Повертає значення однієї змінної *name*. Еквівалент ``get_config_vars().get(name)``.

source: If *name* is not found, return ``None``.
pt_pt: Se *name* não for encontrado, devolve ``None``.
ru: Если *имя* не найдено, верните ``None``.
sv: Om *namn* inte hittas returneras ``None``.
uk: Якщо *ім’я* не знайдено, поверніть ``None``.

source: Example of usage::
pt_pt: Exemplo de utilização::
ru: Пример использования::
sv: Exempel på användning::
uk: Приклад використання::

source: Installation paths
pt_pt: Caminhos de instalação
ru: Пути установки
sv: Installationsvägar
uk: Шляхи встановлення

source: Python uses an installation scheme that differs depending on the platform and on the installation options. These schemes are stored in :mod:`sysconfig` under unique identifiers based on the value returned by :const:`os.name`. The schemes are used by package installers to determine where to copy files to.
pt_pt: O Python usa um esquema de instalação que difere dependendo da plataforma e das opções de instalação. Estes esquemas são armazenados em :mod:`sysconfig` sob identificadores únicos baseados no valor devolvido por :const:`os.name`. Os esquemas são usados pelos instaladores de pacotes para determinar onde copiar os ficheiros.
ru: Python использует схему установки, которая различается в зависимости от платформы и вариантов установки. Эти схемы хранятся в :mod:`sysconfig` под уникальными идентификаторами, основанными на значении, возвращаемом :const:`os.name`. Схемы используются установщиками пакетов для определения места копирования файлов.
sv: Python använder ett installationsschema som skiljer sig åt beroende på plattform och installationsalternativ. Dessa scheman lagras i :mod:`sysconfig` under unika identifierare baserade på det värde som returneras av :const:`os.name`. Schemana används av paketinstallatörer för att avgöra var filer ska kopieras till.

source: Python currently supports nine schemes:
pt_pt: O Python atualmente suporta nove esquemas:
ru: Python в настоящее время поддерживает девять схем:
sv: Python stöder för närvarande nio system:

source: *posix_prefix*: scheme for POSIX platforms like Linux or macOS. This is the default scheme used when Python or a component is installed.
pt_pt: *posix_prefix*: esquema para plataformas POSIX como Linux ou macOS. Este é o esquema predefinido usado quando o Python ou um componente é instalado.
ru: *posix_prefix*: схема для платформ POSIX, таких как Linux или macOS. Это схема по умолчанию, используемая при установке Python или его компонента.
sv: *posix_prefix*: schema för POSIX-plattformar som Linux eller macOS. Detta är standardschemat som används när Python eller en komponent installeras.
uk: *posix_prefix*: схема для платформ POSIX, таких як Linux або macOS. Це типова схема, яка використовується, коли встановлено Python або компонент.

source: *posix_home*: scheme for POSIX platforms, when the *home* option is used. This scheme defines paths located under a specific home prefix.
pt_pt: *posix_home*: esquema para plataformas POSIX, quando a opção *home* é usada. Este esquema define caminhos localizados sob um prefixo de diretório pessoal específico.
ru: *posix_home*: схема для платформ POSIX, когда используется опция *home*. Эта схема определяет пути, расположенные под определенным домашним префиксом.
sv: *posix_home*: schema för POSIX-plattformar, när alternativet *home* används. Detta schema definierar sökvägar som ligger under ett specifikt home-prefix.

source: *posix_user*: scheme for POSIX platforms, when the *user* option is used. This scheme defines paths located under the user's home directory (:const:`site.USER_BASE`).
pt_pt: *posix_user*: esquema para plataformas POSIX, quando a opção *user* é usada. Este esquema define caminhos localizados sob o diretório pessoal do utilizador (:const:`site.USER_BASE`).
ru: *posix_user*: схема для платформ POSIX, когда используется опция *user*. Эта схема определяет пути, расположенные в домашнем каталоге пользователя (:const:`site.USER_BASE`).
sv: *posix_user*: schema för POSIX-plattformar, när alternativet *user* används. Det här schemat definierar sökvägar som ligger under användarens hemkatalog (:const:`site.USER_BASE`).

source: *posix_venv*: scheme for :mod:`Python virtual environments <venv>` on POSIX platforms; by default it is the same as *posix_prefix*.
pt_pt: *posix_venv*: esquema para :mod:`ambientes virtuais Python <venv>` em plataformas POSIX; por predefinição é o mesmo que *posix_prefix*.
ru: *posix_venv*: схема для :mod:`виртуальных сред Python <venv>` на платформах POSIX; по умолчанию это то же самое, что *posix_prefix*.
sv: *posix_venv*: schema för :mod:`Python virtual environments <venv>` på POSIX-plattformar; som standard är det samma som *posix_prefix*.

source: *nt*: scheme for Windows. This is the default scheme used when Python or a component is installed.
pt_pt: *nt*: esquema para Windows. Este é o esquema predefinido usado quando o Python ou um componente é instalado.
ru: *nt*: схема для Windows. Это схема по умолчанию, используемая при установке Python или его компонента.
sv: *nt*: schema för Windows. Detta är standardschemat som används när Python eller en komponent installeras.

source: *nt_user*: scheme for Windows, when the *user* option is used.
pt_pt: *nt_user*: esquema para Windows, quando a opção *user* é usada.
ru: *nt_user*: схема для Windows, когда используется опция *user*.
sv: *nt_user*: schema för Windows, när alternativet *user* används.

source: *nt_venv*: scheme for :mod:`Python virtual environments <venv>` on Windows; by default it is the same as *nt*.
pt_pt: *nt_venv*: esquema para :mod:`ambientes virtuais Python <venv>` no Windows; por predefinição é o mesmo que *nt*.
ru: *nt_venv*: схема для :mod:`виртуальных сред Python <venv>` в Windows; по умолчанию это то же самое, что *nt*.
sv: *nt_venv*: schema för :mod:`Python virtuella miljöer <venv>` på Windows; som standard är det samma som *nt*.

source: *venv*: a scheme with values from either *posix_venv* or *nt_venv* depending on the platform Python runs on.
pt_pt: *venv*: um esquema com valores de *posix_venv* ou *nt_venv* dependendo da plataforma em que o Python está a ser executado.
ru: *venv*: схема со значениями из *posix_venv* или *nt_venv* в зависимости от платформы, на которой работает Python.
sv: *venv*: ett schema med värden från antingen *posix_venv* eller *nt_venv* beroende på vilken plattform Python körs på.

source: *osx_framework_user*: scheme for macOS, when the *user* option is used.
pt_pt: *osx_framework_user*: esquema para macOS, quando a opção *user* é usada.
ru: *osx_framework_user*: схема для macOS, когда используется опция *user*.
sv: *osx_framework_user*: schema för macOS, när alternativet *user* används.
uk: *osx_framework_user*: схема для macOS, коли використовується параметр *user*.

source: Each scheme is itself composed of a series of paths and each path has a unique identifier. Python currently uses eight paths:
pt_pt: Cada esquema é composto por uma série de caminhos e cada caminho tem um identificador único. O Python atualmente usa oito caminhos:
ru: Каждая схема сама по себе состоит из ряда путей, и каждый путь имеет уникальный идентификатор. Python в настоящее время использует восемь путей:
sv: Varje schema består i sin tur av en serie sökvägar och varje sökväg har en unik identifierare. Python använder för närvarande åtta sökvägar:
uk: Кожна схема сама по собі складається з серії шляхів, і кожен шлях має унікальний ідентифікатор. Зараз Python використовує вісім шляхів:

source: *stdlib*: directory containing the standard Python library files that are not platform-specific.
pt_pt: *stdlib*: diretório contendo os ficheiros da biblioteca padrão do Python que não são específicos da plataforma.
ru: *stdlib*: каталог, содержащий файлы стандартной библиотеки Python, не зависящие от платформы.
sv: *stdlib*: katalog som innehåller Pythons standardbiblioteksfiler som inte är plattformsspecifika.
uk: *stdlib*: каталог, що містить файли стандартної бібліотеки Python, які не залежать від платформи.

source: *platstdlib*: directory containing the standard Python library files that are platform-specific.
pt_pt: *platstdlib*: diretório contendo os ficheiros da biblioteca padrão do Python que são específicos da plataforma.
ru: *platstdlib*: каталог, содержащий файлы стандартной библиотеки Python, зависящие от платформы.
sv: *platstdlib*: katalog som innehåller Pythons standardbiblioteksfiler som är plattformsspecifika.
uk: *platstdlib*: каталог, що містить файли стандартної бібліотеки Python, які залежать від платформи.

source: *platlib*: directory for site-specific, platform-specific files.
pt_pt: *platlib*: diretório para ficheiros específicos do local e da plataforma.
ru: *platlib*: каталог для файлов, специфичных для сайта и платформы.
sv: *platlib*: katalog för platsspecifika, plattformsspecifika filer.
uk: *platlib*: каталог для файлів, що стосуються сайту та платформи.

source: *purelib*: directory for site-specific, non-platform-specific files ('pure' Python).
pt_pt: *purelib*: diretório para ficheiros específicos do local e não específicos da plataforma (Python 'puro').
ru: *purelib*: каталог для файлов, специфичных для сайта и не зависящих от платформы («чистый» Python).
sv: *purelib*: katalog för platsspecifika, icke-plattformsspecifika filer ('ren' Python).

source: *include*: directory for non-platform-specific header files for the Python C-API.
pt_pt: *include*: diretório para ficheiros de cabeçalho não específicos da plataforma para a Python C-API.
ru: *include*: каталог для файлов заголовков, не зависящих от платформы, для Python C-API.
sv: *include*: katalog för icke plattformsspecifika header-filer för Python C-API.

source: *platinclude*: directory for platform-specific header files for the Python C-API.
pt_pt: *platinclude*: diretório para ficheiros de cabeçalho específicos da plataforma para a Python C-API.
ru: *platinclude*: каталог для файлов заголовков для конкретной платформы для Python C-API.
sv: *platinclude*: katalog för plattformsspecifika huvudfiler för Python C-API.

source: *scripts*: directory for script files.
pt_pt: *scripts*: diretório para ficheiros de script.
ru: *scripts*: каталог для файлов сценариев.
sv: *scripts*: katalog för skriptfiler.
uk: *scripts*: каталог для файлів сценаріїв.

source: *data*: directory for data files.
pt_pt: *data*: diretório para ficheiros de dados.
ru: *data*: каталог для файлов данных.
sv: *data*: katalog för datafiler.
uk: *data*: каталог для файлів даних.

source: User scheme
pt_pt: Esquema de utilizador
ru: Схема пользователя
sv: Användarschema

source: This scheme is designed to be the most convenient solution for users that don't have write permission to the global site-packages directory or don't want to install into it.
pt_pt: Este esquema é concebido para ser a solução mais conveniente para utilizadores que não têm permissão de escrita no diretório global site-packages ou que não querem instalar nele.
ru: Эта схема разработана как наиболее удобное решение для пользователей, у которых нет разрешения на запись в глобальный каталог site-packages или которые не хотят в него устанавливаться.
sv: Detta system är utformat för att vara den mest praktiska lösningen för användare som inte har skrivbehörighet till den globala katalogen site-packages eller som inte vill installera i den.

source: Files will be installed into subdirectories of :const:`site.USER_BASE` (written as :file:`{userbase}` hereafter). This scheme installs pure Python modules and extension modules in the same location (also known as :const:`site.USER_SITE`).
pt_pt: Os ficheiros serão instalados em subdiretórios de :const:`site.USER_BASE` (escrito como :file:`{userbase}` a partir de agora). Este esquema instala módulos Python puros e módulos de extensão no mesmo local (também conhecido como :const:`site.USER_SITE`).
ru: Файлы будут установлены в подкаталоги :const:`site.USER_BASE` (далее записанные как :file:`{userbase}`). Эта схема устанавливает чистые модули Python и модули расширения в одном и том же месте (также известном как :const:`site.USER_SITE`).
sv: Filer kommer att installeras i underkataloger till :const:`site.USER_BASE` (skrivs som :file:`{userbase}` hädanefter). Detta schema installerar rena Python-moduler och tilläggsmoduler på samma plats (även känd som :const:`site.USER_SITE`).

source: Path
pt_pt: Caminho
ru: Путь
sv: Sökväg

source: Installation directory
pt_pt: Diretório de instalação
ru: Установочный каталог
sv: Installationskatalog

source: Home scheme
pt_pt: Esquema de diretório pessoal
ru: Схема дома
sv: Hemschema

source: The idea behind the "home scheme" is that you build and maintain a personal stash of Python modules. This scheme's name is derived from the idea of a "home" directory on Unix, since it's not unusual for a Unix user to make their home directory have a layout similar to :file:`/usr/` or :file:`/usr/local/`. This scheme can be used by anyone, regardless of the operating system they are installing for.
pt_pt: A ideia por trás do "esquema de diretório pessoal" é que constrói e mantém um conjunto pessoal de módulos Python. O nome deste esquema deriva da ideia de um diretório "pessoal" no Unix, uma vez que não é incomum um utilizador Unix fazer com que o seu diretório pessoal tenha um layout semelhante a :file:`/usr/` ou :file:`/usr/local/`. Este esquema pode ser usado por qualquer pessoa, independentemente do sistema operativo para o qual está a instalar.
ru: Идея «домашней схемы» заключается в том, что вы создаете и поддерживаете личный запас модулей Python. Название этой схемы происходит от идеи «домашнего» каталога в Unix, поскольку пользователь Unix нередко делает свой домашний каталог похожим на :file:`/usr/` или :file:`/usr. /локальный/`. Эту схему может использовать кто угодно, независимо от операционной системы, для которой он устанавливается.
sv: Tanken bakom "hemschemat" är att du bygger och underhåller en personlig samling Python-moduler. Namnet på detta schema härrör från idén om en "hem"-katalog på Unix, eftersom det inte är ovanligt att en Unix-användare gör sin hemkatalog med en layout som liknar :file:`/usr/` eller :file:`/usr/local/`. Det här schemat kan användas av vem som helst, oavsett vilket operativsystem man installerar för.

source: Prefix scheme
pt_pt: Esquema de prefixo
ru: Схема префикса
sv: Prefixschema

source: The "prefix scheme" is useful when you wish to use one Python installation to perform the build/install (i.e., to run the setup script), but install modules into the third-party module directory of a different Python installation (or something that looks like a different Python installation). If this sounds a trifle unusual, it is---that's why the user and home schemes come before. However, there are at least two known cases where the prefix scheme will be useful.
pt_pt: O "esquema de prefixo" é útil quando deseja usar uma instalação do Python para realizar a construção/instalação (ou seja, para executar o script de configuração), mas instalar módulos no diretório de módulos de terceiros de uma instalação diferente do Python (ou algo que parece uma instalação diferente do Python). Se isto soa um pouco incomum, é --- é por isso que os esquemas de utilizador e de diretório pessoal vêm antes. No entanto, há pelo menos dois casos conhecidos em que o esquema de prefixo será útil.
ru: «Схема префиксов» полезна, когда вы хотите использовать одну установку Python для выполнения сборки/установки (т. е. для запуска сценария установки), но устанавливаете модули в сторонний каталог модулей другой установки Python (или что-то, что похоже на другую установку Python). Если это звучит немного необычно, то именно поэтому пользовательская и домашняя схемы стоят на первом месте. Однако известно как минимум два случая, когда схема префиксов будет полезна.
sv: "Prefixschemat" är användbart när du vill använda en Python-installation för att utföra byggandet/installationen (dvs. för att köra installationsskriptet), men installera moduler i tredjeparts modulkatalogen i en annan Python-installation (eller något som ser ut som en annan Python-installation). Om det här låter lite ovanligt så är det så - det är därför user- och home-schemana kommer före. Det finns dock åtminstone två kända fall där prefixschemat kommer att vara användbart.

source: First, consider that many Linux distributions put Python in :file:`/usr`, rather than the more traditional :file:`/usr/local`. This is entirely appropriate, since in those cases Python is part of "the system" rather than a local add-on. However, if you are installing Python modules from source, you probably want them to go in :file:`/usr/local/lib/python2.{X}` rather than :file:`/usr/lib/python2.{X}`.
pt_pt: Primeiro, considere que muitas distribuições Linux colocam o Python em :file:`/usr`, em vez do mais tradicional :file:`/usr/local`. Isto é inteiramente apropriado, uma vez que nesses casos o Python faz parte do "sistema" em vez de ser um complemento local. No entanto, se estiver a instalar módulos Python a partir do código-fonte, provavelmente quer que eles vão para :file:`/usr/local/lib/python2.{X}` em vez de :file:`/usr/lib/python2.{X}`.
ru: Во-первых, учтите, что многие дистрибутивы Linux помещают Python в :file:`/usr`, а не в более традиционный :file:`/usr/local`. Это вполне уместно, поскольку в таких случаях Python является частью «системы», а не локальным дополнением. Однако, если вы устанавливаете модули Python из исходного кода, вы, вероятно, захотите, чтобы они находились в :file:`/usr/local/lib/python2.{X}`, а не в :file:`/usr/lib/python2.{X }`.
sv: Tänk först på att många Linux-distributioner placerar Python i :file:`/usr`, snarare än i den mer traditionella :file:`/usr/local`. Detta är helt i sin ordning, eftersom Python i dessa fall är en del av "systemet" snarare än ett lokalt tillägg. Men om du installerar Python-moduler från källkod vill du förmodligen att de ska hamna i :file:`/usr/local/lib/python2.{X}` snarare än :file:`/usr/lib/python2.{X}`.
