Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/sysconfig.po
Languages: pt_pt, ru, sv, uk

source: Return the path of :file:`pyconfig.h`.
pt_pt: Devolve o caminho do :file:`pyconfig.h`.
ru: Верните путь к :file:`pyconfig.h`.
sv: Returnera sökvägen till :file:`pyconfig.h`.
uk: Повертає шлях до :file:`pyconfig.h`.

source: Return the path of :file:`Makefile`.
pt_pt: Devolve o caminho do :file:`Makefile`.
ru: Верните путь к :file:`Makefile`.
sv: Returnerar sökvägen till :file:`Makefile`.
uk: Повертає шлях до :file:`Makefile`.

source: Command-line usage
sv: Användning av kommandoraden

source: You can use :mod:`sysconfig` as a script with Python's *-m* option:
pt_pt: Pode usar :mod:`sysconfig` como um script com a opção *-m* do Python:
ru: Вы можете использовать :mod:`sysconfig` как скрипт с опцией Python *-m*:
sv: Du kan använda :mod:`sysconfig` som ett skript med Pythons *-m*-alternativ:
uk: Ви можете використовувати :mod:`sysconfig` як сценарій з опцією Python *-m*:

source: This call will print in the standard output the information returned by :func:`get_platform`, :func:`get_python_version`, :func:`get_path` and :func:`get_config_vars`.
pt_pt: Esta chamada imprimirá na saída padrão a informação devolvida por :func:`get_platform`, :func:`get_python_version`, :func:`get_path` e :func:`get_config_vars`.
ru: Этот вызов выведет в стандартный вывод информацию, возвращаемую :func:`get_platform`, :func:`get_python_version`, :func:`get_path` и :func:`get_config_vars`.
sv: Detta anrop kommer att skriva ut i standardutdata den information som returneras av :func:`get_platform`, :func:`get_python_version`, :func:`get_path` och :func:`get_config_vars`.
uk: Цей виклик виводить у стандартний вихід інформацію, яку повертають :func:`get_platform`, :func:`get_python_version`, :func:`get_path` і :func:`get_config_vars`.

source: configuration information
pt_pt: informação de configuração
ru: информация о конфигурации
sv: konfigurationsinformation

source: *data*
pt_pt: *dados*
ru: *данные*

source: $ python -m sysconfig Platform: "macosx-10.4-i386" Python version: "3.2" Current installation scheme: "posix_prefix" Paths: data = "/usr/local" include = "/Users/tarek/Dev/svn.python.org/py3k/Include" platinclude = "." platlib = "/usr/local/lib/python3.2/site-packages" platstdlib = "/usr/local/lib/python3.2" purelib = "/usr/local/lib/python3.2/site-packages" scripts = "/usr/local/bin" stdlib = "/usr/local/lib/python3.2" Variables: AC_APPLE_UNIVERSAL_BUILD = "0" AIX_GENUINE_CPLUSPLUS = "0" AR = "ar" ARFLAGS = "rc" ...
pt_pt: $ python -m sysconfig Plataforma: "macosx-10.4-i386" Versão do Python: "3.2" Esquema de instalação atual: "posix_prefix" Caminhos: dados = "/usr/local" include = "/Users/tarek/Dev/svn.python.org/py3k/Include" platinclude = "." platlib = "/usr/local/lib/python3.2/site-packages" platstdlib = "/usr/local/lib/python3.2" purelib = "/usr/local/lib/python3.2/site-packages" scripts = "/usr/local/bin" stdlib = "/usr/local/lib/python3.2" Variáveis: AC_APPLE_UNIVERSAL_BUILD = "0" AIX_GENUINE_CPLUSPLUS = "0" AR = "ar" ARFLAGS = "rc" ...

source: **Source code:** :source:`Lib/sysconfig.py`
ru: **Исходный код:** :source:`Lib/sysconfig.py`
uk: **Вихідний код:** :source:`Lib/sysconfig.py`

source: *scripts*
ru: *скрипты*

source: win-amd64 (64bit Windows on AMD64, aka x86_64, Intel64, and EM64T)
ru: win-amd64 (64-битная Windows на AMD64, также известная как x86_64, Intel64 и EM64T)
uk: win-amd64 (64-розрядна Windows на AMD64, також x86_64, Intel64 і EM64T)

source: Using :mod:`sysconfig` as a script
ru: Использование :mod:`sysconfig` в качестве скрипта
uk: Використання :mod:`sysconfig` як сценарію

source: :mod:`sysconfig` --- Provide access to Python's configuration information
uk: :mod:`sysconfig` --- Надає доступ до конфігураційної інформації Python

source: A Python distribution contains a :file:`Makefile` and a :file:`pyconfig.h` header file that are necessary to build both the Python binary itself and third-party C extensions compiled using :mod:`distutils`.
uk: Дистрибутив Python містить :file:`Makefile` і файл заголовка :file:`pyconfig.h`, які необхідні для створення як самого двійкового файлу Python, так і сторонніх розширень C, скомпільованих за допомогою :mod:`distutils`.

source: Python uses an installation scheme that differs depending on the platform and on the installation options. These schemes are stored in :mod:`sysconfig` under unique identifiers based on the value returned by :const:`os.name`.
uk: Python використовує схему встановлення, яка відрізняється залежно від платформи та параметрів встановлення. Ці схеми зберігаються в :mod:`sysconfig` під унікальними ідентифікаторами на основі значення, яке повертає :const:`os.name`.

source: Every new component that is installed using :mod:`distutils` or a Distutils-based system will follow the same scheme to copy its file in the right places.
uk: Кожний новий компонент, встановлений за допомогою :mod:`distutils` або системи на основі Distutils, дотримуватиметься тієї ж схеми, щоб скопіювати свій файл у потрібних місцях.

source: *posix_home*: scheme for POSIX platforms used when a *home* option is used upon installation. This scheme is used when a component is installed through Distutils with a specific home prefix.
uk: *posix_home*: схема для платформ POSIX, яка використовується, коли під час встановлення використовується опція *home*. Ця схема використовується, коли компонент встановлюється через Distutils із певним префіксом home.

source: *posix_user*: scheme for POSIX platforms used when a component is installed through Distutils and the *user* option is used. This scheme defines paths located under the user home directory.
uk: *posix_user*: схема для платформ POSIX, яка використовується, коли компонент встановлено через Distutils і використовується параметр *user*. Ця схема визначає шляхи, розташовані в домашньому каталозі користувача.

source: *nt*: scheme for NT platforms like Windows.
uk: *nt*: схема для платформ NT, таких як Windows.

source: *nt_user*: scheme for NT platforms, when the *user* option is used.
uk: *nt_user*: схема для платформ NT, коли використовується параметр *user*.

source: *purelib*: directory for site-specific, non-platform-specific files.
uk: *purelib*: каталог для файлів, що стосуються певних сайтів і не залежать від платформи.

source: :mod:`sysconfig` provides some functions to determine these paths.
uk: :mod:`sysconfig` надає деякі функції для визначення цих шляхів.

source: End users should not use this function, but :func:`get_default_scheme` and :func:`get_preferred_scheme()` instead.
uk: Кінцеві користувачі не повинні використовувати цю функцію, а :func:`get_default_scheme` і :func:`get_preferred_scheme()` замість неї.

source: If *vars* is provided, it must be a dictionary of variables that will update the dictionary return by :func:`get_config_vars`.
uk: Якщо надано *vars*, це має бути словник змінних, який оновлюватиме словник, що повертається за допомогою :func:`get_config_vars`.

source: This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by 'os.uname()'), although the exact information included depends on the OS; e.g., on Linux, the kernel version isn't particularly important.
uk: Це використовується в основному для того, щоб розрізнити каталоги збірок для певної платформи та побудовані дистрибутиви для конкретної платформи. Зазвичай включає назву та версію ОС та архітектуру (як надає 'os.uname()'), хоча точна включена інформація залежить від ОС; наприклад, у Linux версія ядра не особливо важлива.

source: macosx-10.4-fat
uk: macosx-10.4-жир
