Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/telnetlib.po
Languages: ko, ru

source: :mod:`telnetlib` --- Telnet client
ko: :mod:`telnetlib` --- 텔넷 클라이언트
ru: :mod:`telnetlib` --- Клиент Telnet

source: **Source code:** :source:`Lib/telnetlib.py`
ko: **소스코드:** :source:`Lib/telnetlib.py`
ru: **Исходный код:** :source:`Lib/telnetlib.py`

source: The :mod:`telnetlib` module is deprecated (see :pep:`PEP 594 <594#telnetlib>` for details and alternatives).
ru: Модуль :mod:`telnetlib` устарел (подробности и альтернативы см. в :pep:`PEP 594 <594#telnetlib>`).

source: The :mod:`telnetlib` module provides a :class:`Telnet` class that implements the Telnet protocol. See :rfc:`854` for details about the protocol. In addition, it provides symbolic constants for the protocol characters (see below), and for the telnet options. The symbolic names of the telnet options follow the definitions in ``arpa/telnet.h``, with the leading ``TELOPT_`` removed. For symbolic names of options which are traditionally not included in ``arpa/telnet.h``, see the module source itself.
ko: :mod:`telnetlib` 모듈은 텔넷 프로토콜을 구현한 provides :class:`Telnet` 클래스를 제공한다. 이 프로토콜에 대한 자세한 내용은 :rfc:`854`에 있다. 덧붙여 아래에서 볼 프로토콜 문자와 텔넷 옵션에 대해 상수를 제공한다. 상수 이름은 ``arpa/telnet.h``에 정의된 것을 따르는데 앞에 ``TELOPT_``는 뗐다. 전통적으로 ``arpa/telnet.h``에서 정의되지 않은 상수는 모듈 소스에서 직접 봐야 한다.
ru: Модуль :mod:`telnetlib` предоставляет класс :class:`Telnet`, который реализует протокол Telnet. Подробную информацию о протоколе см. в :rfc:`854`. Кроме того, он предоставляет символические константы для символов протокола (см. ниже) и для параметров telnet. Символические имена опций telnet соответствуют определениям в ``arpa/telnet.h``, с удаленным начальным ``TELOPT_``. Символические имена опций, которые традиционно не включаются в ``arpa/telnet.h``, см. в исходном коде самого модуля.

source: The symbolic constants for the telnet commands are: IAC, DONT, DO, WONT, WILL, SE (Subnegotiation End), NOP (No Operation), DM (Data Mark), BRK (Break), IP (Interrupt process), AO (Abort output), AYT (Are You There), EC (Erase Character), EL (Erase Line), GA (Go Ahead), SB (Subnegotiation Begin).
ko: 텔넷 명령에 대한 상수: IAC, DONT, DO, WONT, WILL, SE (Subnegotiation End), NOP (No Operation), DM (Data Mark), BRK (Break), IP (Interrupt process), AO (Abort output), AYT (Are You There), EC (Erase Character), EL (Erase Line), GA (Go Ahead), SB (Subnegotiation Begin).
ru: Символическими константами для команд telnet являются: IAC, DONT, DO, WONT, WILL, SE (окончание подсогласования), NOP (нет операции), DM (метка данных), BRK (разрыв), IP (процесс прерывания), AO ( Прервать вывод), AYT (Вы здесь), EC (Стереть символ), EL (Стереть строку), GA (Продолжить), SB (Начать дополнительное согласование).

source: :class:`Telnet` represents a connection to a Telnet server. The instance is initially not connected by default; the :meth:`~Telnet.open` method must be used to establish a connection. Alternatively, the host name and optional port number can be passed to the constructor too, in which case the connection to the server will be established before the constructor returns. The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used).
ru: :class:`Telnet` представляет собой соединение с сервером Telnet. По умолчанию экземпляр изначально не подключен; Для установления соединения необходимо использовать метод :meth:`~Telnet.open`. Альтернативно, имя хоста и дополнительный номер порта также могут быть переданы конструктору, и в этом случае соединение с сервером будет установлено до завершения работы конструктора. Необязательный параметр *timeout* указывает тайм-аут в секундах для блокировки таких операций, как попытка подключения (если он не указан, будет использоваться глобальная настройка тайм-аута по умолчанию).

source: Do not reopen an already connected instance.
ko: 이미 연결된 객체를 다시 열지 마라.
ru: Не открывайте повторно уже подключенный экземпляр.

source: This class has many :meth:`read_\*` methods. Note that some of them raise :exc:`EOFError` when the end of the connection is read, because they can return an empty string for other reasons. See the individual descriptions below.
ko: 이 클래스에는 많은 :meth:`read_\*` 메소드가 있다. 이들 중 일부는 다른 이유로 빈 문자열을 반환할 수도 있기 때문에 연결의 끝을 읽는 경우 :exc:`EOFError`를 발생시킨다. 자세한 것은 개별 설명을 봐야 한다.
ru: Этот класс имеет множество методов :meth:`read_\*`. Обратите внимание, что некоторые из них вызывают :exc:`EOFError` при чтении конца соединения, поскольку они могут возвращать пустую строку по другим причинам. См. отдельные описания ниже.

source: A :class:`Telnet` object is a context manager and can be used in a :keyword:`with` statement. When the :keyword:`!with` block ends, the :meth:`close` method is called::
ru: Объект :class:`Telnet` является менеджером контекста и может использоваться в операторе :keyword:`with`. Когда блок :keyword:`!with` заканчивается, вызывается метод :meth:`close`::

source: Context manager support added
ko: 맥락 관리(context manager) 지원 추가
ru: Добавлена ​​поддержка контекстного менеджера.

source: :rfc:`854` - Telnet Protocol Specification
ko: :rfc:`854` - 텔넷 프로토콜 사양
ru: :rfc:`854` - Спецификация протокола Telnet

source: Definition of the Telnet protocol.
ko: 텔넷 프로토콜 정의
ru: Определение протокола Telnet.

source: Telnet Objects
ko: Telnet 객체
ru: Объекты Telnet

source: :class:`Telnet` instances have the following methods:
ko: :class:`Telnet` 인스턴스는 다음의 메소드를 가진다:
ru: Экземпляры :class:`Telnet` имеют следующие методы:

source: Read until a given byte string, *expected*, is encountered or until *timeout* seconds have passed.
ko: *expected*를 만나거나 *timeout* 초를 넘길 때까지의 바이트 문자열을 읽는다.
ru: Чтение до тех пор, пока не встретится заданная строка байтов, *expected*, или пока не пройдет *timeout* секунд.

source: When no match is found, return whatever is available instead, possibly empty bytes. Raise :exc:`EOFError` if the connection is closed and no cooked data is available.
ko: 일치하는 것이 없으면 있는 것을 다 돌려주거나 빈 바이트열일 수 있다. 연결이 닫혀서 처리할 것이 없으면 :exc:`EOFError` 예외가 발생한다.
ru: Если совпадение не найдено, вместо этого верните все доступное, возможно, пустые байты. Поднимите :exc:`EOFError`, если соединение закрыто и обработанные данные недоступны.

source: Read all data until EOF as bytes; block until connection closed.
ko: EOF까지의 모든 바이트열을 읽는다. 연결이 닫힐 때까지 잡힌다.
ru: Считайте все данные до EOF в байтах; блокировать до закрытия соединения.

source: Read at least one byte of cooked data unless EOF is hit. Return ``b''`` if EOF is hit. Block if no data is immediately available.
ko: EOF가 아니면 처리된 적어도 한 바이트를 읽고, EOF이면 ``b''``을 돌려준다. 당장 읽을 것이 없으면 잡힌다.
ru: Считайте хотя бы один байт подготовленных данных, если не достигнут EOF. Верните ``b''``, если достигнут EOF. Блокировать, если данные не доступны немедленно.

source: Read everything that can be without blocking in I/O (eager).
ko: 수신을 기다리며 대기하지 않는 선에서 최대한 열심으로 수신한 데이터를 처리해서 읽는다.
ru: Читать всё, что можно, без блокировки ввода-вывода (жажду).

source: Raise :exc:`EOFError` if connection closed and no cooked data available. Return ``b''`` if no cooked data available otherwise. Do not block unless in the midst of an IAC sequence.
ko: 가능한 처리된 데이터가 없으면 ``b''`` 빈 바이트열을 돌려주고, 연결은 닫혔고 아무것도 없으면 :exc:`EOFError`를 발생시킨다. IAC 처리 중인 게 아니라면 잡히지 않는다.
ru: Поднимите :exc:`EOFError`, если соединение закрыто и готовые данные недоступны. Верните ``b''``, если в противном случае обработанные данные недоступны. Не блокируйте, если только это не происходит в середине последовательности IAC.

source: Read readily available data.
ko: 이미 수신했거나 당장 수신되는 데이터를 처리해서 읽는다.
ru: Прочтите доступные данные.

source: Process and return data already in the queues (lazy).
ko: 이미 수신한 데이터를 처리해서 반환한다 (게으르다).
ru: Обрабатывать и возвращать данные, уже находящиеся в очередях (ленивые).

source: Raise :exc:`EOFError` if connection closed and no data available. Return ``b''`` if no cooked data available otherwise. Do not block unless in the midst of an IAC sequence.
ko: 연결은 닫혔고 가능한 데이터가 없으면 :exc:`EOFError`가 발생한다. 단지 처리된 데이터가 없은거면 ``b''``를 돌려준다. IAC 처리 중인 게 아니라면 잡히지 않는다.
ru: Вызовите :exc:`EOFError`, если соединение закрыто и данные недоступны. Верните ``b''``, если в противном случае обработанные данные недоступны. Не блокируйте, если только это не происходит в середине последовательности IAC.

source: Return any data available in the cooked queue (very lazy).
ko: 이미 처리된 데이터를 돌려준다 (아주 게으르다).
ru: Вернуть любые данные, доступные в подготовленной очереди (очень лениво).

source: Raise :exc:`EOFError` if connection closed and no data available. Return ``b''`` if no cooked data available otherwise. This method never blocks.
ko: 연결은 닫혔고 가능한 데이터가 없으면 :exc:`EOFError`가 발생한다. 단지 처리된 데이터가 없은거면 ``b''``를 돌려준다. 이 메소드는 절대로 잡히지 않는다.
ru: Вызовите :exc:`EOFError`, если соединение закрыто и данные недоступны. Верните ``b''``, если в противном случае обработанные данные недоступны. Этот метод никогда не блокируется.

source: Return the data collected between a SB/SE pair (suboption begin/end). The callback should access these data when it was invoked with a ``SE`` command. This method never blocks.
ko: SB/SE(부가옵션 시작/끝) 사이의 데이터를 돌려준다. ``SE` 명령으로 불려지면 콜백은 이 데이터에 접근해야 한다. 이 메소드는 절대 붙잡히지 않는다.
ru: Возвращает данные, собранные между парой SB/SE (подопция начало/конец). Обратный вызов должен получить доступ к этим данным, когда он был вызван с помощью команды SE. Этот метод никогда не блокируется.

source: Connect to a host. The optional second argument is the port number, which defaults to the standard Telnet port (23). The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used).
ko: 호스트에 연결한다. 두 번째 인수 포트 번호는 선택이다. 기본은 텔넷 포트(23)다. 선택 인수인 *timeout*은 연결 시도 같은 동작에 대한 초 단위의 제한 시간이다. 값을 주지 않으면 기본값이 사용된다.
ru: Подключитесь к хосту. Необязательный второй аргумент — это номер порта, который по умолчанию равен стандартному порту Telnet (23). Необязательный параметр *timeout* указывает тайм-аут в секундах для блокировки таких операций, как попытка подключения (если он не указан, будет использоваться глобальная настройка тайм-аута по умолчанию).

source: Do not try to reopen an already connected instance.
ko: 이미 연결된 인스턴스로 연결을 다시 시도하지 마라.
ru: Не пытайтесь повторно открыть уже подключенный экземпляр.

source: Raises an :ref:`auditing event <auditing>` ``telnetlib.Telnet.open`` with arguments ``self``, ``host``, ``port``.
ru: Вызывает событие аудита <auditing>` telnetlib.Telnet.open`` с аргументами ``self``, ``host``, ``port``.

source: Print a debug message when the debug level is ``>`` 0. If extra arguments are present, they are substituted in the message using the standard string formatting operator.
ko: 디버그 레벨이 ``>`` 0이면 디버그 메시지를 출력한다. 부가 인수가 주어지면 표준 문자열 형식화 처리를 통해 메시지 안에 대체돼 들어간다.
ru: Выведите отладочное сообщение, когда уровень отладки равен ``>`` 0. Если присутствуют дополнительные аргументы, они заменяются в сообщении с помощью стандартного оператора форматирования строки.

source: Set the debug level. The higher the value of *debuglevel*, the more debug output you get (on ``sys.stdout``).
ko: 디버그 레벨을 설정한다. 더 높은 값의 *debuglevel*이 더 디버그스러운 출력을 (표준출력으로) 낸다.
ru: Установите уровень отладки. Чем выше значение *debuglevel*, тем больше отладочных данных вы получите (в ``sys.stdout``).

source: Close the connection.
ko: 연결을 닫는다.
ru: Закройте соединение.

source: Return the socket object used internally.
ko: 내부적으로 사용되는 소켓 객체를 돌려준다.
ru: Верните объект сокета, используемый внутри.

source: Return the file descriptor of the socket object used internally.
ko: 내부적으로 사용되는 소켓의 파일 형태를 돌려준다.
ru: Возвращает файловый дескриптор объекта сокета, используемого внутри.

source: Write a byte string to the socket, doubling any IAC characters. This can block if the connection is blocked. May raise :exc:`OSError` if the connection is closed.
ko: 소켓에 바이트 문자열을 쓴다. IAC 문자는 두번 쓴다. 연결이 잡혀 있으면 이것도 잡힌다. 연결이 닫혔으면 :exc:`OSError`이 발생할 수 있다.
ru: Запишите в сокет строку байтов, удваивая любые символы IAC. Это может заблокировать, если соединение заблокировано. Может вызвать :exc:`OSError`, если соединение закрыто.

source: Raises an :ref:`auditing event <auditing>` ``telnetlib.Telnet.write`` with arguments ``self``, ``buffer``.
ru: Вызывает событие аудита <auditing>` telnetlib.Telnet.write`` с аргументами ``self``, ``buffer``.

source: This method used to raise :exc:`socket.error`, which is now an alias of :exc:`OSError`.
ko: 이 메소드는 :exc:`socket.error`를 발생시키는데 이건 이제 :exc:`OSError`의 별칭이다.
ru: Этот метод раньше вызывал :exc:`socket.error`, который теперь является псевдонимом :exc:`OSError`.

source: Interaction function, emulates a very dumb Telnet client.
ko: 상호작용 기능, 엄청 단순한 텔넷 클라이언트로 기능 한다. 역주) 수신된 것을 화면(stdout)에 출력하고, 입력(stdin)을 송신하는 무한루프.
ru: Функция взаимодействия эмулирует очень тупой клиент Telnet.

source: Multithreaded version of :meth:`interact`.
ko: :meth:`interact`의 다중스레드 판
ru: Многопоточная версия :meth:`interact`.

source: Read until one from a list of a regular expressions matches.
ko: 정규식 목록 중의 하나와 일치할 때까지 읽는다.
ru: Читать до тех пор, пока не совпадет одно из регулярных выражений из списка.

source: The first argument is a list of regular expressions, either compiled (:ref:`regex objects <re-objects>`) or uncompiled (byte strings). The optional second argument is a timeout, in seconds; the default is to block indefinitely.
ko: 첫 번째 인수는 컴파일된 :ref:`regex 객체나 되지 않은 바이트열 정규식 목록이다. 두 번째 선택 인수는 초 단위의 제한시간이다. 기본은 무한정 잡혀있는 거다.
ru: Первый аргумент — это список регулярных выражений, либо скомпилированных (:ref:`regex Objects <re-objects>`), либо некомпилированных (байтовые строки). Необязательный второй аргумент — это тайм-аут в секундах; по умолчанию — блокировка на неопределенный срок.

source: Return a tuple of three items: the index in the list of the first regular expression that matches; the match object returned; and the bytes read up till and including the match.
ko: 반환값은 세 항목의 튜플이다: 목록에서 일치하는 첫 정규식의 순서; 반환된 일치 객체; 일치된 항목까지를 포함하는 바이트열.
ru: Возвращает кортеж из трех элементов: индекс в списке первого совпадающего регулярного выражения; возвращен объект соответствия; и байты, прочитанные до совпадения включительно.

source: If end of file is found and no bytes were read, raise :exc:`EOFError`. Otherwise, when nothing matches, return ``(-1, None, data)`` where *data* is the bytes received so far (may be empty bytes if a timeout happened).
ko: 파일의 끝이고 읽을 것이 없으면 :exc:`EOFError`가 발생한다. 일치가 없으면 ``(-1, None, data)``을 돌려준다. 여기서 *data*는 지금까지 수신한 바이트열이다 (시간초과면 빈 바이트열일 수 있다).
ru: Если найден конец файла и ни один байт не был прочитан, вызовите :exc:`EOFError`. В противном случае, если ничего не совпадает, верните ``(-1, None, data)``, где *data* — это полученные на данный момент байты (могут быть пустыми байтами, если произошел таймаут).

source: If a regular expression ends with a greedy match (such as ``.*``) or if more than one expression can match the same input, the results are non-deterministic, and may depend on the I/O timing.
ko: 정규식이 탐욕스러운 일치(``.*`` 같은)로 끝났거나, 같은 입력에 하나 이상의 표현이 가능하다면 결과는 어찌될지 모른다. I/O의 타이밍에 의존적일 수 있다.
ru: Если регулярное выражение заканчивается жадным совпадением (например, ``.*``) или если одному и тому же входному значению может соответствовать более одного выражения, результаты недетерминированы и могут зависеть от синхронизации ввода-вывода.

source: Each time a telnet option is read on the input flow, this *callback* (if set) is called with the following parameters: callback(telnet socket, command (DO/DONT/WILL/WONT), option). No other action is done afterwards by telnetlib.
ko: 매번 입력의 흐름에서 텔넷 옵션이 읽히면 이 *callback* (주어졌다면)이 다음 인수와 함께 호출된다: callback(telnet socket, command (DO/DONT/WILL/WONT), option). 이후로 telnetlib가 뭔가 더 하지는 않는다.
ru: Каждый раз, когда опция telnet считывается во входном потоке, этот *обратный вызов* (если установлен) вызывается со следующими параметрами: callback(telnet-сокет, команда (DO/DONT/WILL/WONT), option). Никаких других действий после этого telnetlib не выполняет.

source: Telnet Example
ko: 텔넷 예제
ru: Пример Telnet

source: A simple example illustrating typical use::
ko: 일반적 사용을 표현한 텔넷 예제::
ru: Простой пример, иллюстрирующий типичное использование::
