Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tempfile.po
Languages: pt_pt, ru, sv

source: The returned object is a file-like object whose :attr:`!_file` attribute is either an :class:`io.BytesIO` or :class:`io.TextIOWrapper` object (depending on whether binary or text *mode* was specified) or a true file object, depending on whether :meth:`rollover` has been called. This file-like object can be used in a :keyword:`with` statement, just like a normal file.
pt_pt: O objeto devolvido é um objeto semelhante a um ficheiro cujo atributo :attr:`!_file` é um objeto :class:`io.BytesIO` ou :class:`io.TextIOWrapper` (dependendo se o modo binário ou de texto foi especificado) ou um objeto de ficheiro real, dependendo se :meth:`rollover` foi chamado. Este objeto semelhante a um ficheiro pode ser usado numa instrução :keyword:`with`, tal como um ficheiro normal.
ru: Возвращаемый объект представляет собой файлоподобный объект, атрибут :attr:`!_file` которого является либо объектом :class:`io.BytesIO`, либо :class:`io.TextIOWrapper` (в зависимости от того, был ли задан двоичный или текстовый режим *mode*). указан) или настоящий файловый объект, в зависимости от того, был ли вызван :meth:`rollover`. Этот файлоподобный объект можно использовать в операторе :keyword:`with`, как обычный файл.
sv: Det returnerade objektet är ett filliknande objekt vars attribut :attr:`!_file` är antingen ett :class:`io.BytesIO`- eller :class:`io.TextIOWrapper`-objekt (beroende på om binärt eller text *mode* specificerades) eller ett äkta filobjekt, beroende på om :meth:`rollover` har anropats. Detta filliknande objekt kan användas i en :keyword:`with`-sats, precis som en vanlig fil.

source: the truncate method now accepts a *size* argument.
pt_pt: o método truncate agora aceita um argumento *size*.
ru: метод truncate теперь принимает аргумент *size*.
sv: trunkeringsmetoden accepterar nu ett *size*-argument.

source: Fully implements the :class:`io.BufferedIOBase` and :class:`io.TextIOBase` abstract base classes (depending on whether binary or text *mode* was specified).
pt_pt: Implementa totalmente as classes base abstratas :class:`io.BufferedIOBase` e :class:`io.TextIOBase` (dependendo se o modo binário ou de texto foi especificado).
ru: Полностью реализует абстрактные базовые классы :class:`io.BufferedIOBase` и :class:`io.TextIOBase` (в зависимости от того, был ли указан двоичный или текстовый *режим*).
sv: Implementerar fullständigt de abstrakta basklasserna :class:`io.BufferedIOBase` och :class:`io.TextIOBase` (beroende på om binärt eller text *mode* angavs).

source: This class securely creates a temporary directory using the same rules as :func:`mkdtemp`. The resulting object can be used as a :term:`context manager` (see :ref:`tempfile-examples`). On completion of the context or destruction of the temporary directory object, the newly created temporary directory and all its contents are removed from the filesystem.
pt_pt: Esta classe cria de forma segura um diretório temporário usando as mesmas regras que :func:`mkdtemp`. O objeto resultante pode ser usado como um :term:`gestor de contexto` (consulte :ref:`tempfile-examples`). Após a conclusão do contexto ou destruição do objeto do diretório temporário, o novo diretório temporário criado e todo o seu conteúdo são removidos do sistema de ficheiros.
ru: Этот класс безопасно создает временный каталог, используя те же правила, что и :func:`mkdtemp`. Полученный объект можно использовать в качестве контекстного менеджера (см. :ref:`tempfile-examples`). По завершении контекста или уничтожения объекта временного каталога вновь созданный временный каталог и все его содержимое удаляются из файловой системы.
sv: Denna klass skapar en temporär katalog på ett säkert sätt med samma regler som :func:`mkdtemp`. Det resulterande objektet kan användas som en :term:`kontexthanterare` (se :ref:`tempfile-exempel`). När kontexten är klar eller när objektet för den temporära katalogen förstörs, tas den nyskapade temporära katalogen och allt dess innehåll bort från filsystemet.

source: The directory name can be retrieved from the :attr:`!name` attribute of the returned object. When the returned object is used as a :term:`context manager`, the :attr:`!name` will be assigned to the target of the :keyword:`!as` clause in the :keyword:`with` statement, if there is one.
pt_pt: O nome do diretório pode ser obtido a partir do atributo :attr:`!name` do objeto devolvido. Quando o objeto devolvido é usado como um :term:`gestor de contexto`, o :attr:`!name` será atribuído ao alvo da cláusula :keyword:`!as` na instrução :keyword:`with`, se existir uma.
ru: Имя каталога можно получить из атрибута :attr:`!name` возвращаемого объекта. Когда возвращаемый объект используется в качестве :term:`контекстного менеджера`, :attr:`!name` будет присвоено цели предложения :keyword:`!as` в операторе :keyword:`with`, если он есть.
sv: Katalognamnet kan hämtas från attributet :attr:`!name` i det returnerade objektet. När det returnerade objektet används som en :term:`context manager`, kommer :attr:`!name` att tilldelas målet för :keyword:`!as` klausulen i :keyword:`with` uttalandet, om det finns ett sådant.

source: The directory can be explicitly cleaned up by calling the :meth:`!cleanup` method. If *ignore_cleanup_errors* is true, any unhandled exceptions during explicit or implicit cleanup (such as a :exc:`PermissionError` removing open files on Windows) will be ignored, and the remaining removable items deleted on a "best-effort" basis. Otherwise, errors will be raised in whatever context cleanup occurs (the :meth:`!cleanup` call, exiting the context manager, when the object is garbage-collected or during interpreter shutdown).
pt_pt: O diretório pode ser limpo explicitamente chamando o método :meth:`!cleanup`. Se *ignore_cleanup_errors* for verdadeiro, quaisquer exceções não tratadas durante a limpeza explícita ou implícita (como um :exc:`PermissionError` ao remover ficheiros abertos no Windows) serão ignoradas, e os itens removíveis restantes serão eliminados numa base de "melhor esforço". Caso contrário, os erros serão levantados em qualquer contexto em que a limpeza ocorra (a chamada :meth:`!cleanup`, saída do gestor de contexto, quando o objeto é recolhido pelo *garbage collector* ou durante o encerramento do interpretador).
ru: Каталог можно очистить явно, вызвав метод :meth:`!cleanup`. Если *ignore_cleanup_errors* имеет значение true, любые необработанные исключения во время явной или неявной очистки (например, :exc:`PermissionError` при удалении открытых файлов в Windows) будут игнорироваться, а оставшиеся съемные элементы будут удалены в порядке "максимальных усилий". В противном случае при любой очистке контекста будут возникать ошибки (вызов :meth:`!cleanup`, выход из контекстного менеджера, когда объект удаляется сборщиком мусора или во время завершения работы интерпретатора).
sv: Katalogen kan uttryckligen rensas upp genom att anropa metoden :meth:`!cleanup`. Om *ignore_cleanup_errors* är true, kommer alla ohanterade undantag under explicit eller implicit rensning (t.ex. ett :exc:`PermissionError` som tar bort öppna filer i Windows) att ignoreras, och de återstående flyttbara objekten kommer att raderas på "bästa möjliga" sätt. I annat fall kommer fel att uppstå i det sammanhang där rensningen sker (anropet :meth:`!cleanup`, när kontexthanteraren avslutas, när objektet samlas in eller när tolken stängs av).

source: The *delete* parameter can be used to disable cleanup of the directory tree upon exiting the context. While it may seem unusual for a context manager to disable the action taken when exiting the context, it can be useful during debugging or when you need your cleanup behavior to be conditional based on other logic.
pt_pt: O parâmetro *delete* pode ser usado para desativar a limpeza da árvore de diretórios ao sair do contexto. Embora possa parecer incomum que um gestor de contexto desative a ação tomada ao sair do contexto, pode ser útil durante a depuração ou quando necessita que o comportamento de limpeza seja condicional com base em outra lógica.
ru: Параметр *delete* можно использовать для отключения очистки дерева каталогов при выходе из контекста. Хотя для менеджера контекста может показаться необычным отключение действия, выполняемого при выходе из контекста, это может быть полезно во время отладки или когда вам нужно, чтобы ваше поведение очистки было условным на основе другой логики.

source: Raises an :ref:`auditing event <auditing>` ``tempfile.mkdtemp`` with argument ``fullpath``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``tempfile.mkdtemp`` com o argumento ``fullpath``.
ru: Вызывает :ref:`событие аудита <auditing>``tempfile.mkdtemp`` с аргументом ``fullpath``.
sv: Utlöser en :ref:`auditing event <auditing>` ``tempfile.mkdtemp`` med argumentet ``fullpath``.

source: Added *ignore_cleanup_errors* parameter.
pt_pt: Adicionado o parâmetro *ignore_cleanup_errors*.
ru: Добавлен параметр *ignore_cleanup_errors*.
sv: Lagt till parametern *ignore_cleanup_errors*.

source: Added the *delete* parameter.
pt_pt: Adicionado o parâmetro *delete*.
ru: Добавлен параметр *delete*.

source: Creates a temporary file in the most secure manner possible. There are no race conditions in the file's creation, assuming that the platform properly implements the :const:`os.O_EXCL` flag for :func:`os.open`. The file is readable and writable only by the creating user ID. If the platform uses permission bits to indicate whether a file is executable, the file is executable by no one. The file descriptor is not inherited by child processes.
pt_pt: Cria um ficheiro temporário da forma mais segura possível. Não existem condições de corrida na criação do ficheiro, assumindo que a plataforma implementa corretamente a *flag* :const:`os.O_EXCL` para :func:`os.open`. O ficheiro é legível e gravável apenas pelo ID do utilizador que o criou. Se a plataforma usar *bits* de permissão para indicar se um ficheiro é executável, o ficheiro não é executável por ninguém. O descritor de ficheiro não é herdado por processos filhos.
ru: Создает временный файл наиболее безопасным способом. При создании файла нет условий гонки, при условии, что платформа правильно реализует флаг :const:`os.O_EXCL` для :func:`os.open`. Файл доступен для чтения и записи только создавшему его идентификатору пользователя. Если платформа использует биты разрешения, чтобы указать, является ли файл исполняемым, файл не может быть исполняемым ни для кого. Дескриптор файла не наследуется дочерними процессами.
sv: Skapar en temporär fil på det säkraste sättet som är möjligt. Det finns inga tävlingsförhållanden i skapandet av filen, förutsatt att plattformen korrekt implementerar flaggan :const:`os.O_EXCL` för :func:`os.open`. Filen är läsbar och skrivbar endast av det skapande användar-ID:t. Om plattformen använder behörighetsbitar för att ange om en fil är körbar, är filen inte körbar av någon. Filens deskriptor ärvs inte av underordnade processer.

source: Unlike :func:`TemporaryFile`, the user of :func:`mkstemp` is responsible for deleting the temporary file when done with it.
pt_pt: Ao contrário de :func:`TemporaryFile`, o utilizador de :func:`mkstemp` é responsável por eliminar o ficheiro temporário quando terminar de o usar.
ru: В отличие от :func:`TemporaryFile`, пользователь :func:`mkstemp` несет ответственность за удаление временного файла после завершения работы с ним.
sv: Till skillnad från :func:`TemporaryFile` är användaren av :func:`mkstemp` ansvarig för att radera den temporära filen när den är klar.

source: If *suffix* is not ``None``, the file name will end with that suffix, otherwise there will be no suffix. :func:`mkstemp` does not put a dot between the file name and the suffix; if you need one, put it at the beginning of *suffix*.
pt_pt: Se *suffix* não for ``None``, o nome do ficheiro terminará com esse sufixo; caso contrário, não haverá sufixo. :func:`mkstemp` não coloca um ponto entre o nome do ficheiro e o sufixo; se precisar de um, coloque-o no início de *suffix*.
ru: Если *суффикс* не равен «Нет», имя файла будет заканчиваться этим суффиксом, в противном случае суффикса не будет. :func:`mkstemp` не ставит точку между именем файла и суффиксом; если он вам нужен, поместите его в начало *суффикса*.
sv: Om *suffix* inte är ``None``, kommer filnamnet att sluta med det suffixet, annars kommer det inte att finnas något suffix. :func:`mkstemp` sätter inte en punkt mellan filnamnet och suffixet; om du behöver en, sätt den i början av *suffix*.

source: If *prefix* is not ``None``, the file name will begin with that prefix; otherwise, a default prefix is used. The default is the return value of :func:`gettempprefix` or :func:`gettempprefixb`, as appropriate.
pt_pt: Se *prefix* não for ``None``, o nome do ficheiro começará com esse prefixo; caso contrário, é usado um prefixo predefinido. O predefinido é o valor devolvido por :func:`gettempprefix` ou :func:`gettempprefixb`, conforme apropriado.
ru: Если *prefix* не равен ``None``, имя файла будет начинаться с этого префикса; в противном случае используется префикс по умолчанию. По умолчанию используется возвращаемое значение :func:`gettempprefix` или :func:`gettempprefixb`, в зависимости от ситуации.
sv: Om *prefix* inte är ``None`` kommer filnamnet att börja med det prefixet, annars används ett standardprefix. Standardvärdet är returvärdet för :func:`gettempprefix` eller :func:`gettempprefixb`, beroende på vad som är lämpligt.

source: If *dir* is not ``None``, the file will be created in that directory; otherwise, a default directory is used. The default directory is chosen from a platform-dependent list, but the user of the application can control the directory location by setting the *TMPDIR*, *TEMP* or *TMP* environment variables. There is thus no guarantee that the generated filename will have any nice properties, such as not requiring quoting when passed to external commands via ``os.popen()``.
pt_pt: Se *dir* não for ``None``, o ficheiro será criado nesse diretório; caso contrário, é usado um diretório predefinido. O diretório predefinido é escolhido a partir de uma lista dependente da plataforma, mas o utilizador da aplicação pode controlar a localização do diretório definindo as variáveis de ambiente *TMPDIR*, *TEMP* ou *TMP*. Não há, portanto, garantia de que o nome de ficheiro gerado tenha quaisquer propriedades desejáveis, como não necessitar de aspas ao ser passado para comandos externos através de ``os.popen()``.
ru: Если *dir* не ``None``, файл будет создан в этом каталоге; в противном случае используется каталог по умолчанию. Каталог по умолчанию выбирается из списка, зависящего от платформы, но пользователь приложения может управлять расположением каталога, устанавливая переменные среды *TMPDIR*, *TEMP* или *TMP*. Таким образом, нет никакой гарантии, что сгенерированное имя файла будет иметь какие-либо приятные свойства, например, не будет требовать заключения в кавычки при передаче внешним командам через ``os.popen()``.
sv: Om *dir* inte är ``None`` kommer filen att skapas i den katalogen, annars används en standardkatalog. Standardkatalogen väljs från en plattformsberoende lista, men användaren av programmet kan styra katalogplatsen genom att ange miljövariablerna *TMPDIR*, *TEMP* eller *TMP*. Det finns därför ingen garanti för att det genererade filnamnet kommer att ha några bra egenskaper, som t.ex. att inte kräva citattecken när det skickas till externa kommandon via ``os.popen()``.

source: If any of *suffix*, *prefix*, and *dir* are not ``None``, they must be the same type. If they are bytes, the returned name will be bytes instead of str. If you want to force a bytes return value with otherwise default behavior, pass ``suffix=b''``.
pt_pt: Se algum de *suffix*, *prefix* ou *dir* não for ``None``, devem ser do mesmo tipo. Se forem *bytes*, o nome devolvido será *bytes* em vez de *str*. Se quiser forçar um valor de retorno em *bytes* com comportamento predefinido, passe ``suffix=b''``.
ru: Если какой-либо из *suffix*, *prefix* и *dir* не равен None, они должны быть одного типа. Если они байтовые, возвращаемое имя будет байтовым, а не str. Если вы хотите принудительно возвращать значение в байтах с поведением по умолчанию, передайте ``suffix=b''``.
sv: Om något av *suffix*, *prefix* och *dir* inte är ``None`` måste de vara av samma typ. Om de är bytes kommer det returnerade namnet att vara bytes istället för str. Om du vill tvinga fram ett bytes-returvärde med annat standardbeteende, skicka ``uffix=b''``.

source: If *text* is specified and true, the file is opened in text mode. Otherwise, (the default) the file is opened in binary mode.
pt_pt: Se *text* for especificado e verdadeiro, o ficheiro é aberto em modo de texto. Caso contrário (predefinição), o ficheiro é aberto em modo binário.
ru: Если указано *text* и оно истинно, файл открывается в текстовом режиме. В противном случае (по умолчанию) файл открывается в двоичном режиме.
sv: Om *text* anges och true, öppnas filen i textläge. I annat fall (standard) öppnas filen i binärt läge.

source: :func:`mkstemp` returns a tuple containing an OS-level handle to an open file (as would be returned by :func:`os.open`) and the absolute pathname of that file, in that order.
pt_pt: :func:`mkstemp` devolve um tuplo contendo um *handle* a nível de SO para um ficheiro aberto (como seria devolvido por :func:`os.open`) e o caminho absoluto desse ficheiro, por essa ordem.
ru: :func:`mkstemp` возвращает кортеж, содержащий дескриптор уровня ОС открытого файла (который был бы возвращен :func:`os.open`) и абсолютный путь к этому файлу в указанном порядке.
sv: :func:`mkstemp` returnerar en tupel som innehåller ett OS-nivåhandtag till en öppen fil (som skulle returneras av :func:`os.open`) och det absoluta sökvägsnamnet för den filen, i den ordningen.

source: *suffix*, *prefix*, and *dir* may now be supplied in bytes in order to obtain a bytes return value. Prior to this, only str was allowed. *suffix* and *prefix* now accept and default to ``None`` to cause an appropriate default value to be used.
pt_pt: *suffix*, *prefix* e *dir* podem agora ser fornecidos em *bytes* para obter um valor de retorno em *bytes*. Anteriormente, apenas *str* era permitido. *suffix* e *prefix* agora aceitam e têm como predefinição ``None`` para causar a utilização de um valor predefinido apropriado.
ru: *suffix*, *prefix* и *dir* теперь можно указывать в байтах, чтобы получить возвращаемое значение в байтах. До этого разрешалось использовать только str. *suffix* и *prefix* теперь принимаются и по умолчанию имеют значение ``None``, чтобы использовать подходящее значение по умолчанию.
sv: *suffix*, *prefix* och *dir* kan nu anges i bytes för att få ett bytes-returvärde. Tidigare var endast str tillåtet. *suffix* och *prefix* accepterar nu och är standard för ``None`` för att ett lämpligt standardvärde ska användas.

source: The *dir* parameter now accepts a :term:`path-like object`.
pt_pt: O parâmetro *dir* agora aceita um objeto :term:`semelhante a um caminho`.
ru: Параметр *dir* теперь принимает объект, похожий на путь.
sv: Parametern *dir* accepterar nu en :term:`path-like object`.

source: Creates a temporary directory in the most secure manner possible. There are no race conditions in the directory's creation. The directory is readable, writable, and searchable only by the creating user ID.
pt_pt: Cria um diretório temporário da forma mais segura possível. Não existem condições de corrida na criação do diretório. O diretório é legível, gravável e pesquisável apenas pelo ID do utilizador que o criou.
ru: Создает временный каталог наиболее безопасным способом. При создании каталога нет условий гонки. Каталог доступен для чтения, записи и поиска только по идентификатору создающего пользователя.
sv: Skapar en tillfällig katalog på säkrast möjliga sätt. Det finns inga tävlingsvillkor i skapandet av katalogen. Katalogen är läsbar, skrivbar och sökbar endast av det skapande användar-ID:t.

source: The user of :func:`mkdtemp` is responsible for deleting the temporary directory and its contents when done with it.
pt_pt: O utilizador de :func:`mkdtemp` é responsável por eliminar o diretório temporário e o seu conteúdo quando terminar de o usar.
ru: Пользователь :func:`mkdtemp` несет ответственность за удаление временного каталога и его содержимого после завершения работы с ним.
sv: Användaren av :func:`mkdtemp` är ansvarig för att radera den temporära katalogen och dess innehåll när den är klar.

source: The *prefix*, *suffix*, and *dir* arguments are the same as for :func:`mkstemp`.
pt_pt: Os argumentos *prefix*, *suffix* e *dir* são os mesmos que para :func:`mkstemp`.
ru: Аргументы *prefix*, *suffix* и *dir* такие же, как и для :func:`mkstemp`.
sv: Argumenten *prefix*, *suffix* och *dir* är desamma som för :func:`mkstemp`.

source: :func:`mkdtemp` returns the absolute pathname of the new directory.
pt_pt: :func:`mkdtemp` devolve o caminho absoluto do novo diretório.
ru: :func:`mkdtemp` возвращает абсолютный путь к новому каталогу.

source: :func:`mkdtemp` now always returns an absolute path, even if *dir* is relative.
pt_pt: :func:`mkdtemp` agora devolve sempre um caminho absoluto, mesmo que *dir* seja relativo.
ru: :func:`mkdtemp` теперь всегда возвращает абсолютный путь, даже если *dir* является относительным.

source: Return the name of the directory used for temporary files. This defines the default value for the *dir* argument to all functions in this module.
pt_pt: Devolve o nome do diretório usado para ficheiros temporários. Isto define o valor predefinido para o argumento *dir* de todas as funções neste módulo.
ru: Возвращает имя каталога, используемого для временных файлов. Это определяет значение по умолчанию для аргумента *dir* для всех функций в этом модуле.
sv: Returnerar namnet på den katalog som används för temporära filer. Detta definierar standardvärdet för argumentet *dir* för alla funktioner i denna modul.

source: Python searches a standard list of directories to find one which the calling user can create files in. The list is:
pt_pt: O Python pesquisa uma lista padrão de diretórios para encontrar um no qual o utilizador que chama pode criar ficheiros. A lista é:
ru: Python выполняет поиск в стандартном списке каталогов, чтобы найти тот, в котором вызывающий пользователь может создавать файлы. Список следующий:
sv: Python söker igenom en standardlista med kataloger för att hitta en katalog som den anropande användaren kan skapa filer i. Listan är följande:

source: The directory named by the :envvar:`TMPDIR` environment variable.
pt_pt: O diretório nomeado pela variável de ambiente :envvar:`TMPDIR`.
ru: Каталог, указанный в переменной среды :envvar:`TMPDIR`.
sv: Den katalog som anges av miljövariabeln :envvar:`TMPDIR`.

source: The directory named by the :envvar:`TEMP` environment variable.
pt_pt: O diretório nomeado pela variável de ambiente :envvar:`TEMP`.
ru: Каталог, указанный в переменной среды :envvar:`TEMP`.
sv: Den katalog som anges av miljövariabeln :envvar:`TEMP`.

source: The directory named by the :envvar:`TMP` environment variable.
pt_pt: O diretório nomeado pela variável de ambiente :envvar:`TMP`.
ru: Каталог, указанный в переменной среды :envvar:`TMP`.
sv: Den katalog som anges av miljövariabeln :envvar:`TMP`.

source: A platform-specific location:
pt_pt: Uma localização específica da plataforma:
ru: Местоположение, зависящее от платформы:
sv: En plattformsspecifik plats:
