Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tempfile.po
Languages: pt_pt, ru, sv

source: On Windows, the directories :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP`, and :file:`\\TMP`, in that order.
pt_pt: No Windows, os diretórios :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP` e :file:`\\TMP`, por essa ordem.
ru: В Windows это каталоги :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP` и :file:`\\TMP` в указанном порядке.
sv: I Windows, katalogerna :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP` och :file:`\\TMP`, i den ordningen.

source: On all other platforms, the directories :file:`/tmp`, :file:`/var/tmp`, and :file:`/usr/tmp`, in that order.
pt_pt: Em todas as outras plataformas, os diretórios :file:`/tmp`, :file:`/var/tmp` e :file:`/usr/tmp`, por essa ordem.
ru: На всех других платформах каталоги :file:`/tmp`, :file:`/var/tmp` и :file:`/usr/tmp` в указанном порядке.
sv: På alla andra plattformar, katalogerna :file:`/tmp`, :file:`/var/tmp` och :file:`/usr/tmp`, i nämnd ordning.

source: As a last resort, the current working directory.
pt_pt: Como último recurso, o diretório de trabalho atual.
ru: В крайнем случае текущий рабочий каталог.
sv: Som en sista utväg, den aktuella arbetskatalogen.

source: The result of this search is cached, see the description of :data:`tempdir` below.
pt_pt: O resultado desta pesquisa é guardado em *cache*; consulte a descrição de :data:`tempdir` abaixo.
ru: Результат этого поиска кэшируется, см. описание :data:`tempdir` ниже.
sv: Resultatet av denna sökning cachelagras, se beskrivningen av :data:`tempdir` nedan.

source: Always returns a str. Previously it would return any :data:`tempdir` value regardless of type so long as it was not ``None``.
pt_pt: Devolve sempre uma *str*. Anteriormente, devolvia qualquer valor :data:`tempdir`, independentemente do tipo, desde que não fosse ``None``.
ru: Всегда возвращает ул. Раньше он возвращал любое значение :data:`tempdir` независимо от типа, если оно не было ``None``.
sv: Returnerar alltid en str. Tidigare returnerade den alla :data:`tempdir`-värden oavsett typ så länge det inte var ``None``.

source: Same as :func:`gettempdir` but the return value is in bytes.
pt_pt: Igual a :func:`gettempdir`, mas o valor devolvido está em *bytes*.
ru: То же, что и :func:`gettempdir`, но возвращаемое значение находится в байтах.
sv: Samma som :func:`gettempdir` men returvärdet är i bytes.

source: Return the filename prefix used to create temporary files. This does not contain the directory component.
pt_pt: Devolve o prefixo do nome de ficheiro usado para criar ficheiros temporários. Isto não contém o componente do diretório.
ru: Возвращает префикс имени файла, используемый для создания временных файлов. Он не содержит компонента каталога.
sv: Returnerar det filnamnsprefix som används för att skapa temporära filer. Detta innehåller inte katalogkomponenten.

source: Same as :func:`gettempprefix` but the return value is in bytes.
pt_pt: Igual a :func:`gettempprefix`, mas o valor devolvido está em *bytes*.
ru: То же, что и :func:`gettempprefix`, но возвращаемое значение находится в байтах.
sv: Samma som :func:`gettempprefix` men returvärdet är i bytes.

source: The module uses a global variable to store the name of the directory used for temporary files returned by :func:`gettempdir`. It can be set directly to override the selection process, but this is discouraged. All functions in this module take a *dir* argument which can be used to specify the directory. This is the recommended approach that does not surprise other unsuspecting code by changing global API behavior.
pt_pt: O módulo usa uma variável global para armazenar o nome do diretório usado para ficheiros temporários devolvidos por :func:`gettempdir`. Pode ser definida diretamente para substituir o processo de seleção, mas isto é desencorajado. Todas as funções neste módulo aceitam um argumento *dir* que pode ser usado para especificar o diretório. Esta é a abordagem recomendada que não surpreende outro código inesperado ao alterar o comportamento global da API.
ru: Модуль использует глобальную переменную для хранения имени каталога, используемого для временных файлов, возвращаемых :func:`gettempdir`. Его можно настроить непосредственно для отмены процесса выбора, но это не рекомендуется. Все функции в этом модуле принимают аргумент *dir*, который можно использовать для указания каталога. Это рекомендуемый подход, который не удивляет ничего не подозревающий код изменением глобального поведения API.
sv: Modulen använder en global variabel för att lagra namnet på den katalog som används för temporära filer som returneras av :func:`gettempdir`. Den kan ställas in direkt för att åsidosätta urvalsprocessen, men detta avråds. Alla funktioner i den här modulen tar ett *dir*-argument som kan användas för att ange katalogen. Detta är det rekommenderade tillvägagångssättet som inte överraskar annan intet ont anande kod genom att ändra det globala API-beteendet.

source: When set to a value other than ``None``, this variable defines the default value for the *dir* argument to the functions defined in this module, including its type, bytes or str. It cannot be a :term:`path-like object`.
pt_pt: Quando definida para um valor diferente de ``None``, esta variável define o valor predefinido para o argumento *dir* das funções definidas neste módulo, incluindo o seu tipo, *bytes* ou *str*. Não pode ser um objeto :term:`semelhante a um caminho`.
ru: Если для этой переменной установлено значение, отличное от ``None``, эта переменная определяет значение по умолчанию для аргумента *dir* для функций, определенных в этом модуле, включая его тип, байты или строку. Это не может быть :term:`объект, похожий на путь`.
sv: När den här variabeln anges till ett annat värde än ``None`` definierar den standardvärdet för *dir*-argumentet till de funktioner som definieras i den här modulen, inklusive dess typ, bytes eller str. Det kan inte vara ett :term:`path-liknande objekt`.

source: If ``tempdir`` is ``None`` (the default) at any call to any of the above functions except :func:`gettempprefix` it is initialized following the algorithm described in :func:`gettempdir`.
pt_pt: Se ``tempdir`` for ``None`` (predefinição) em qualquer chamada a qualquer uma das funções acima, exceto :func:`gettempprefix`, é inicializada seguindo o algoritmo descrito em :func:`gettempdir`.
ru: Если tempdir имеет значение None (по умолчанию) при любом вызове любой из вышеперечисленных функций, кроме :func:`gettempprefix`, она инициализируется в соответствии с алгоритмом, описанным в :func:`gettempdir`.
sv: Om ``tempdir`` är ``None`` (standard) vid något anrop till någon av ovanstående funktioner utom :func:`gettempprefix` initialiseras den enligt algoritmen som beskrivs i :func:`gettempdir`.

source: Beware that if you set ``tempdir`` to a bytes value, there is a nasty side effect: The global default return type of :func:`mkstemp` and :func:`mkdtemp` changes to bytes when no explicit ``prefix``, ``suffix``, or ``dir`` arguments of type str are supplied. Please do not write code expecting or depending on this. This awkward behavior is maintained for compatibility with the historical implementation.
pt_pt: Tenha cuidado que, se definir ``tempdir`` para um valor em *bytes*, existe um efeito secundário desagradável: o tipo de retorno global predefinido de :func:`mkstemp` e :func:`mkdtemp` muda para *bytes* quando não são fornecidos argumentos explícitos ``prefix``, ``suffix`` ou ``dir`` do tipo *str*. Por favor, não escreva código que espere ou dependa disto. Este comportamento incómodo é mantido por compatibilidade com a implementação histórica.
ru: Помните, что если вы установите для ``tempdir`` значение в байтах, возникнет неприятный побочный эффект: глобальный тип возвращаемого значения по умолчанию для :func:`mkstemp` и :func:`mkdtemp` изменится на байты, если нет явного ``префикса. Предоставляются аргументы ``, ``suffix`` или ``dir`` типа str. Пожалуйста, не пишите код, ожидая или завися от этого. Это неловкое поведение сохраняется для совместимости с исторической реализацией.
sv: Tänk på att om du sätter ``tempdir`` till ett bytes-värde, så finns det en otäck bieffekt: Den globala standardreturtypen för :func:`mkstemp` och :func:`mkdtemp` ändras till bytes när inga explicita ``prefix``, ``uffix`` eller ``dir``-argument av typen str anges. Vänligen skriv inte kod som förväntar sig eller är beroende av detta. Detta besvärliga beteende bibehålls för kompatibilitet med den historiska implementationen.

source: Examples
pt_pt: Exemplos
ru: Примеры
sv: Exempel

source: Here are some examples of typical usage of the :mod:`tempfile` module::
pt_pt: Seguem-se alguns exemplos de utilização típica do módulo :mod:`tempfile`::
ru: Вот несколько примеров типичного использования модуля :mod:`tempfile`::
sv: Här följer några exempel på typisk användning av modulen :mod:`tempfile`::

source: >>> import tempfile # create a temporary file and write some data to it >>> fp = tempfile.TemporaryFile() >>> fp.write(b'Hello world!') # read data from file >>> fp.seek(0) >>> fp.read() b'Hello world!' # close the file, it will be removed >>> fp.close() # create a temporary file using a context manager >>> with tempfile.TemporaryFile() as fp: ... fp.write(b'Hello world!') ... fp.seek(0) ... fp.read() b'Hello world!' >>> # file is now closed and removed # create a temporary file using a context manager # close the file, use the name to open the file again >>> with tempfile.NamedTemporaryFile(delete_on_close=False) as fp: ... fp.write(b'Hello world!') ... fp.close() ... # the file is closed, but not removed ... # open the file again by using its name ... with open(fp.name, mode='rb') as f: ... f.read() b'Hello world!' >>> # file is now removed # create a temporary directory using the context manager >>> with tempfile.TemporaryDirectory() as tmpdirname: ... print('created temporary directory', tmpdirname) >>> # directory and contents have been removed
pt_pt: >>> import tempfile # criar um ficheiro temporário e escrever alguns dados >>> fp = tempfile.TemporaryFile() >>> fp.write(b'Hello world!') # ler dados do ficheiro >>> fp.seek(0) >>> fp.read() b'Hello world!' # fechar o ficheiro, será removido >>> fp.close() # criar um ficheiro temporário usando um gestor de contexto >>> with tempfile.TemporaryFile() as fp: ... fp.write(b'Hello world!') ... fp.seek(0) ... fp.read() b'Hello world!' >>> # o ficheiro está agora fechado e removido # criar um ficheiro temporário usando um gestor de contexto # fechar o ficheiro, usar o nome para reabrir o ficheiro >>> with tempfile.NamedTemporaryFile(delete_on_close=False) as fp: ... fp.write(b'Hello world!') ... fp.close() ... # o ficheiro está fechado, mas não removido ... # reabrir o ficheiro usando o seu nome ... with open(fp.name, mode='rb') as f: ... f.read() b'Hello world!' >>> # o ficheiro está agora removido # criar um diretório temporário usando o gestor de contexto >>> with tempfile.TemporaryDirectory() as tmpdirname: ... print('criado diretório temporário', tmpdirname) >>> # diretório e conteúdo foram removidos

source: Deprecated functions and variables
pt_pt: Funções e variáveis descontinuadas
ru: Устаревшие функции и переменные
sv: Föråldrade funktioner och variabler

source: A historical way to create temporary files was to first generate a file name with the :func:`mktemp` function and then create a file using this name. Unfortunately this is not secure, because a different process may create a file with this name in the time between the call to :func:`mktemp` and the subsequent attempt to create the file by the first process. The solution is to combine the two steps and create the file immediately. This approach is used by :func:`mkstemp` and the other functions described above.
pt_pt: Uma forma histórica de criar ficheiros temporários era primeiro gerar um nome de ficheiro com a função :func:`mktemp` e depois criar um ficheiro usando esse nome. Infelizmente, isto não é seguro, porque um processo diferente pode criar um ficheiro com esse nome no intervalo entre a chamada a :func:`mktemp` e a tentativa subsequente de criar o ficheiro pelo primeiro processo. A solução é combinar os dois passos e criar o ficheiro imediatamente. Esta abordagem é usada por :func:`mkstemp` e pelas outras funções descritas acima.
ru: Исторический способ создания временных файлов заключался в том, чтобы сначала сгенерировать имя файла с помощью функции :func:`mktemp`, а затем создать файл, используя это имя. К сожалению, это небезопасно, поскольку другой процесс может создать файл с этим именем в период между вызовом :func:`mktemp` и последующей попыткой создать файл первым процессом. Решение состоит в том, чтобы объединить эти два шага и немедленно создать файл. Этот подход используется :func:`mkstemp` и другими функциями, описанными выше.
sv: Ett historiskt sätt att skapa temporära filer var att först generera ett filnamn med funktionen :func:`mktemp` och sedan skapa en fil med detta namn. Tyvärr är detta inte säkert, eftersom en annan process kan skapa en fil med detta namn under tiden mellan anropet till :func:`mktemp` och det efterföljande försöket att skapa filen av den första processen. Lösningen är att kombinera de två stegen och skapa filen omedelbart. Detta tillvägagångssätt används av :func:`mkstemp` och de andra funktionerna som beskrivs ovan.

source: Use :func:`mkstemp` instead.
pt_pt: Utilize :func:`mkstemp` em vez disso.
ru: Вместо этого используйте :func:`mkstemp`.
sv: Använd :func:`mkstemp` istället.

source: Return an absolute pathname of a file that did not exist at the time the call is made. The *prefix*, *suffix*, and *dir* arguments are similar to those of :func:`mkstemp`, except that bytes file names, ``suffix=None`` and ``prefix=None`` are not supported.
pt_pt: Devolve um caminho absoluto de um ficheiro que não existia no momento em que a chamada foi feita. Os argumentos *prefix*, *suffix* e *dir* são semelhantes aos de :func:`mkstemp`, exceto que nomes de ficheiros em *bytes*, ``suffix=None`` e ``prefix=None`` não são suportados.
ru: Возвращает абсолютный путь к файлу, который не существовал на момент выполнения вызова. Аргументы *prefix*, *suffix* и *dir* аналогичны аргументам :func:`mkstemp`, за исключением того, что байтовые имена файлов, ``suffix=None`` и ``prefix=None`` не поддерживаются. .
sv: Returnerar ett absolut sökvägsnamn för en fil som inte fanns när anropet gjordes. Argumenten *prefix*, *suffix* och *dir* liknar argumenten i :func:`mkstemp`, förutom att filnamn för byte, ``suffix=None`` och ``prefix=None`` inte stöds.

source: Use of this function may introduce a security hole in your program. By the time you get around to doing anything with the file name it returns, someone else may have beaten you to the punch. :func:`mktemp` usage can be replaced easily with :func:`NamedTemporaryFile`, passing it the ``delete=False`` parameter::
pt_pt: A utilização desta função pode introduzir uma falha de segurança no seu programa. Até ao momento em que faz algo com o nome do ficheiro que devolve, outra pessoa pode já ter agido antes. A utilização de :func:`mktemp` pode ser facilmente substituída por :func:`NamedTemporaryFile`, passando-lhe o parâmetro ``delete=False``::
ru: Использование этой функции может создать дыру в безопасности вашей программы. К тому времени, как вы что-нибудь сделаете с возвращаемым именем файла, кто-то другой, возможно, опередит вас. Использование :func:`mktemp` можно легко заменить на :func:`NamedTemporaryFile`, передав ему параметр ``delete=False``::
sv: Om du använder den här funktionen kan du få ett säkerhetshål i ditt program. När du väl hinner göra något med filnamnet som returneras, kan någon annan ha hunnit före dig. :func:`mktemp` kan enkelt ersättas med :func:`NamedTemporaryFile`, med parametern ``delete=False``::

source: temporary
pt_pt: temporário
ru: временный
sv: tillfällig

source: file name
pt_pt: nome do ficheiro
ru: имя файла
sv: filnamn

source: file
pt_pt: ficheiro
ru: файл
sv: fil
