Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tempfile.po
Languages: pt_pt, ru, sv

source: :mod:`!tempfile` --- Generate temporary files and directories
pt_pt: :mod:`!tempfile` — Geração de ficheiros e diretórios temporários
ru: :mod:`!tempfile` --- Создавать временные файлы и каталоги

source: **Source code:** :source:`Lib/tempfile.py`
pt_pt: **Código-fonte:** :source:`Lib/tempfile.py`
ru: **Исходный код:** :source:`Lib/tempfile.py`
sv: **Källkod:** :source:`Lib/tempfile.py`

source: This module creates temporary files and directories. It works on all supported platforms. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory`, and :class:`SpooledTemporaryFile` are high-level interfaces which provide automatic cleanup and can be used as :term:`context managers <context manager>`. :func:`mkstemp` and :func:`mkdtemp` are lower-level functions which require manual cleanup.
pt_pt: Este módulo cria ficheiros e diretórios temporários. Funciona em todas as plataformas suportadas. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory` e :class:`SpooledTemporaryFile` são interfaces de alto nível que fornecem limpeza automática e podem ser usadas como :term:`gestores de contexto <context manager>`. :func:`mkstemp` e :func:`mkdtemp` são funções de baixo nível que requerem limpeza manual.
ru: Этот модуль создает временные файлы и каталоги. Он работает на всех поддерживаемых платформах. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory` и :class:`SpooledTemporaryFile` — это интерфейсы высокого уровня, которые обеспечивают автоматическую очистку и могут использоваться как :term:`менеджеры контекста <context менеджер>`. :func:`mkstemp` и :func:`mkdtemp` — это функции нижнего уровня, требующие очистки вручную.
sv: Den här modulen skapar temporära filer och kataloger. Den fungerar på alla plattformar som stöds. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory` och :class:`SpooledTemporaryFile` är högnivågränssnitt som ger automatisk rensning och kan användas som :term:`kontexthanterare <context manager>`. :func:`mkstemp` och :func:`mkdtemp` är funktioner på lägre nivå som kräver manuell rensning.

source: All the user-callable functions and constructors take additional arguments which allow direct control over the location and name of temporary files and directories. Files names used by this module include a string of random characters which allows those files to be securely created in shared temporary directories. To maintain backward compatibility, the argument order is somewhat odd; it is recommended to use keyword arguments for clarity.
pt_pt: Todas as funções e construtores chamáveis pelo utilizador aceitam argumentos adicionais que permitem controlar diretamente a localização e o nome dos ficheiros e diretórios temporários. Os nomes de ficheiros usados por este módulo incluem uma *string* de caracteres aleatórios, o que permite que esses ficheiros sejam criados de forma segura em diretórios temporários partilhados. Para manter a compatibilidade retroativa, a ordem dos argumentos é um pouco estranha; recomenda-se o uso de argumentos nomeados para maior clareza.
ru: Все вызываемые пользователем функции и конструкторы принимают дополнительные аргументы, которые позволяют напрямую контролировать расположение и имена временных файлов и каталогов. Имена файлов, используемые этим модулем, включают строку случайных символов, что позволяет безопасно создавать эти файлы в общих временных каталогах. Для обеспечения обратной совместимости порядок аргументов несколько странный; для ясности рекомендуется использовать аргументы ключевых слов.
sv: Alla funktioner och konstruktörer som kan anropas av användaren tar ytterligare argument som ger direkt kontroll över platsen för och namnet på temporära filer och kataloger. Filnamn som används av denna modul innehåller en sträng med slumpmässiga tecken som gör att dessa filer kan skapas på ett säkert sätt i delade temporära kataloger. För att upprätthålla bakåtkompatibilitet är argumentordningen något udda; det rekommenderas att använda nyckelordsargument för tydlighetens skull.

source: The module defines the following user-callable items:
pt_pt: O módulo define os seguintes itens chamáveis pelo utilizador:
ru: Модуль определяет следующие вызываемые пользователем элементы:
sv: Modulen definierar följande användaranropsbara objekt:

source: Return a :term:`file-like object` that can be used as a temporary storage area. The file is created securely, using the same rules as :func:`mkstemp`. It will be destroyed as soon as it is closed (including an implicit close when the object is garbage collected). Under Unix, the directory entry for the file is either not created at all or is removed immediately after the file is created. Other platforms do not support this; your code should not rely on a temporary file created using this function having or not having a visible name in the file system.
pt_pt: Devolve um objeto :term:`semelhante a um ficheiro` que pode ser usado como uma área de armazenamento temporário. O ficheiro é criado de forma segura, usando as mesmas regras que :func:`mkstemp`. Será destruído assim que for fechado (incluindo um fecho implícito quando o objeto é recolhido pelo *garbage collector*). Em Unix, a entrada do diretório para o ficheiro não é criada ou é removida imediatamente após a criação do ficheiro. Outras plataformas não suportam isto; o seu código não deve depender de um ficheiro temporário criado usando esta função ter ou não um nome visível no sistema de ficheiros.
ru: Возвращает :term:`файлоподобный объект`, который можно использовать в качестве области временного хранения. Файл создается безопасно с использованием тех же правил, что и :func:`mkstemp`. Он будет уничтожен, как только будет закрыт (включая неявное закрытие при сборке мусора). В Unix запись каталога для файла либо не создается вообще, либо удаляется сразу после создания файла. Другие платформы это не поддерживают; ваш код не должен полагаться на временный файл, созданный с помощью этой функции, имеющий или не имеющий видимого имени в файловой системе.
sv: Returnerar ett :term:`filliknande objekt` som kan användas som ett tillfälligt lagringsutrymme. Filen skapas på ett säkert sätt med samma regler som :func:`mkstemp`. Den kommer att förstöras så snart den stängs (inklusive en implicit stängning när objektet garbage collected). Under Unix skapas antingen inte katalogposten för filen alls eller så tas den bort omedelbart efter att filen har skapats. Andra plattformar stöder inte detta; din kod bör inte förlita sig på att en temporär fil som skapats med denna funktion har eller inte har ett synligt namn i filsystemet.

source: The resulting object can be used as a :term:`context manager` (see :ref:`tempfile-examples`). On completion of the context or destruction of the file object the temporary file will be removed from the filesystem.
pt_pt: O objeto resultante pode ser usado como um :term:`gestor de contexto` (consulte :ref:`tempfile-examples`). Após a conclusão do contexto ou destruição do objeto de ficheiro, o ficheiro temporário será removido do sistema de ficheiros.
ru: Полученный объект можно использовать в качестве контекстного менеджера (см. :ref:`tempfile-examples`). По завершении контекста или уничтожения файлового объекта временный файл будет удален из файловой системы.
sv: Det resulterande objektet kan användas som en :term:`kontexthanterare` (se :ref:`tempfile-exempel`). När kontexten är klar eller filobjektet förstörs kommer den temporära filen att tas bort från filsystemet.

source: The *mode* parameter defaults to ``'w+b'`` so that the file created can be read and written without being closed. Binary mode is used so that it behaves consistently on all platforms without regard for the data that is stored. *buffering*, *encoding*, *errors* and *newline* are interpreted as for :func:`open`.
pt_pt: O parâmetro *mode* tem como predefinição ``'w+b'``, de forma a que o ficheiro criado possa ser lido e escrito sem ser fechado. O modo binário é usado para que se comporte de forma consistente em todas as plataformas, independentemente dos dados armazenados. *buffering*, *encoding*, *errors* e *newline* são interpretados como em :func:`open`.
ru: Параметр *mode* по умолчанию имеет значение ``'w+b'``, так что созданный файл можно читать и записывать без закрытия. Двоичный режим используется для обеспечения единообразного поведения на всех платформах независимо от хранящихся данных. *буферизация*, *кодирование*, *ошибки* и *новая строка* интерпретируются как :func:`open`.
sv: Parametern *mode* är som standard inställd på ``'w+b'`` så att den fil som skapas kan läsas och skrivas utan att stängas. Binary mode används så att den beter sig konsekvent på alla plattformar utan hänsyn till vilka data som lagras. *buffring*, *kodning*, *fel* och *ny linje* tolkas som för :func:`open`.

source: The *dir*, *prefix* and *suffix* parameters have the same meaning and defaults as with :func:`mkstemp`.
pt_pt: Os parâmetros *dir*, *prefix* e *suffix* têm o mesmo significado e valores predefinidos que em :func:`mkstemp`.
ru: Параметры *dir*, *prefix* и *suffix* имеют то же значение и значения по умолчанию, что и для :func:`mkstemp`.
sv: Parametrarna *dir*, *prefix* och *suffix* har samma betydelse och standardvärden som i :func:`mkstemp`.

source: The returned object is a true file object on POSIX platforms. On other platforms, it is a file-like object whose :attr:`!file` attribute is the underlying true file object.
pt_pt: O objeto devolvido é um objeto de ficheiro real em plataformas POSIX. Noutras plataformas, é um objeto semelhante a um ficheiro cujo atributo :attr:`!file` é o objeto de ficheiro real subjacente.
ru: Возвращенный объект является настоящим файловым объектом на платформах POSIX. На других платформах это файлоподобный объект, атрибут которого :attr:`!file` является базовым истинным файловым объектом.
sv: Det returnerade objektet är ett äkta filobjekt på POSIX-plattformar. På andra plattformar är det ett filliknande objekt vars :attr:`!file`-attribut är det underliggande äkta filobjektet.

source: The :py:const:`os.O_TMPFILE` flag is used if it is available and works (Linux-specific, requires Linux kernel 3.11 or later).
pt_pt: A *flag* :py:const:`os.O_TMPFILE` é usada se estiver disponível e funcionar (específico do Linux, requer *kernel* Linux 3.11 ou posterior).
ru: Флаг :py:const:`os.O_TMPFILE` используется, если он доступен и работает (зависит от Linux, требуется ядро ​​Linux 3.11 или новее).
sv: Flaggan :py:const:`os.O_TMPFILE` används om den är tillgänglig och fungerar (Linux-specifik, kräver Linux-kärnan 3.11 eller senare).

source: On platforms that are neither Posix nor Cygwin, TemporaryFile is an alias for NamedTemporaryFile.
pt_pt: Em plataformas que não são POSIX nem Cygwin, TemporaryFile é um *alias* para NamedTemporaryFile.
ru: На платформах, которые не являются ни Posix, ни Cygwin, TemporaryFile является псевдонимом NamedTemporaryFile.
sv: På plattformar som varken är Posix eller Cygwin är TemporaryFile ett alias för NamedTemporaryFile.

source: Raises an :ref:`auditing event <auditing>` ``tempfile.mkstemp`` with argument ``fullpath``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``tempfile.mkstemp`` com o argumento ``fullpath``.
ru: Вызывает :ref:`событие аудита <auditing>``tempfile.mkstemp`` с аргументом ``fullpath``.
sv: Utlöser en :ref:`auditing event <auditing>` ``tempfile.mkstemp`` med argumentet ``fullpath``.

source: The :py:const:`os.O_TMPFILE` flag is now used if available.
pt_pt: A *flag* :py:const:`os.O_TMPFILE` é agora usada se estiver disponível.
ru: Флаг :py:const:`os.O_TMPFILE` теперь используется, если он доступен.
sv: Flaggan :py:const:`os.O_TMPFILE` används nu om den är tillgänglig.

source: Added *errors* parameter.
pt_pt: Adicionado o parâmetro *errors*.
ru: Добавлен параметр *errors*.
sv: Lagt till parametern *errors*.

source: This function operates exactly as :func:`TemporaryFile` does, except the following differences:
pt_pt: Esta função opera exatamente como :func:`TemporaryFile`, exceto pelas seguintes diferenças:
ru: Эта функция работает точно так же, как :func:`TemporaryFile`, за исключением следующих отличий:

source: This function returns a file that is guaranteed to have a visible name in the file system.
pt_pt: Esta função devolve um ficheiro que tem garantidamente um nome visível no sistema de ficheiros.
ru: Эта функция возвращает файл, который гарантированно имеет видимое имя в файловой системе.

source: To manage the named file, it extends the parameters of :func:`TemporaryFile` with *delete* and *delete_on_close* parameters that determine whether and how the named file should be automatically deleted.
pt_pt: Para gerir o ficheiro nomeado, estende os parâmetros de :func:`TemporaryFile` com os parâmetros *delete* e *delete_on_close*, que determinam se e como o ficheiro nomeado deve ser automaticamente eliminado.
ru: Для управления именованным файлом он расширяет параметры :func:`TemporaryFile` параметрами *delete* и *delete_on_close*, которые определяют, должен ли и каким образом указанный файл быть автоматически удален.

source: The returned object is always a :term:`file-like object` whose :attr:`!file` attribute is the underlying true file object. This file-like object can be used in a :keyword:`with` statement, just like a normal file. The name of the temporary file can be retrieved from the :attr:`!name` attribute of the returned file-like object. On Unix, unlike with the :func:`TemporaryFile`, the directory entry does not get unlinked immediately after the file creation.
pt_pt: O objeto devolvido é sempre um objeto :term:`semelhante a um ficheiro` cujo atributo :attr:`!file` é o objeto de ficheiro real subjacente. Este objeto semelhante a um ficheiro pode ser usado numa instrução :keyword:`with`, tal como um ficheiro normal. O nome do ficheiro temporário pode ser obtido a partir do atributo :attr:`!name` do objeto semelhante a um ficheiro devolvido. Em Unix, ao contrário do que acontece com :func:`TemporaryFile`, a entrada do diretório não é desligada imediatamente após a criação do ficheiro.
ru: Возвращаемый объект всегда является объектом, подобным файлу, атрибут которого :attr:`!file` является базовым истинным файловым объектом. Этот файлоподобный объект можно использовать в операторе :keyword:`with`, как обычный файл. Имя временного файла можно получить из атрибута :attr:`!name` возвращаемого файлового объекта. В Unix, в отличие от :func:`TemporaryFile`, запись каталога не отключается сразу после создания файла.

source: If *delete* is true (the default) and *delete_on_close* is true (the default), the file is deleted as soon as it is closed. If *delete* is true and *delete_on_close* is false, the file is deleted on context manager exit only, or else when the :term:`file-like object` is finalized. Deletion is not always guaranteed in this case (see :meth:`object.__del__`). If *delete* is false, the value of *delete_on_close* is ignored.
pt_pt: Se *delete* for verdadeiro (predefinição) e *delete_on_close* for verdadeiro (predefinição), o ficheiro é eliminado assim que for fechado. Se *delete* for verdadeiro e *delete_on_close* for falso, o ficheiro é eliminado apenas na saída do gestor de contexto, ou quando o objeto :term:`semelhante a um ficheiro` é finalizado. A eliminação não é sempre garantida neste caso (consulte :meth:`object.__del__`). Se *delete* for falso, o valor de *delete_on_close* é ignorado.
ru: Если *delete* имеет значение true (по умолчанию) и *delete_on_close* имеет значение true (по умолчанию), файл удаляется, как только он закрывается. Если *delete* имеет значение true, а *delete_on_close* имеет значение false, файл удаляется только при выходе из контекстного менеджера или в противном случае, когда завершается :term:`файлоподобный объект`. В этом случае удаление не всегда гарантируется (см. :meth:`object.__del__`). Если *delete* имеет значение false, значение *delete_on_close* игнорируется.

source: Therefore to use the name of the temporary file to reopen the file after closing it, either make sure not to delete the file upon closure (set the *delete* parameter to be false) or, in case the temporary file is created in a :keyword:`with` statement, set the *delete_on_close* parameter to be false. The latter approach is recommended as it provides assistance in automatic cleaning of the temporary file upon the context manager exit.
pt_pt: Portanto, para usar o nome do ficheiro temporário para reabrir o ficheiro após fechá-lo, certifique-se de não eliminar o ficheiro ao fechá-lo (defina o parâmetro *delete* como falso) ou, caso o ficheiro temporário seja criado numa instrução :keyword:`with`, defina o parâmetro *delete_on_close* como falso. A última abordagem é recomendada, pois fornece assistência na limpeza automática do ficheiro temporário na saída do gestor de contexto.
ru: Поэтому, чтобы использовать имя временного файла для повторного открытия файла после его закрытия, либо убедитесь, что файл не удален при закрытии (установите для параметра *delete* значение false), либо, в случае, если временный файл создается в файле : ключевое слово:`with` установите для параметра *delete_on_close* значение false. Последний подход рекомендуется, поскольку он обеспечивает автоматическую очистку временного файла при выходе из контекстного менеджера.

source: Opening the temporary file again by its name while it is still open works as follows:
pt_pt: A reabertura do ficheiro temporário pelo seu nome enquanto ainda está aberto funciona da seguinte forma:
ru: Повторное открытие временного файла по его имени, пока он еще открыт, работает следующим образом:

source: On POSIX the file can always be opened again.
pt_pt: Em POSIX, o ficheiro pode sempre ser reaberto.
ru: В POSIX файл всегда можно открыть снова.

source: On Windows, make sure that at least one of the following conditions are fulfilled:
pt_pt: No Windows, certifique-se de que pelo menos uma das seguintes condições é cumprida:
ru: В Windows убедитесь, что выполнено хотя бы одно из следующих условий:

source: *delete* is false
pt_pt: *delete* é falso

source: additional open shares delete access (e.g. by calling :func:`os.open` with the flag ``O_TEMPORARY``)
pt_pt: aberturas adicionais partilham acesso de eliminação (por exemplo, chamando :func:`os.open` com a *flag* ``O_TEMPORARY``)
ru: дополнительные открытые общие ресурсы удаляют доступ (например, путем вызова :func:`os.open` с флагом ``O_TEMPORARY``)

source: *delete* is true but *delete_on_close* is false. Note, that in this case the additional opens that do not share delete access (e.g. created via builtin :func:`open`) must be closed before exiting the context manager, else the :func:`os.unlink` call on context manager exit will fail with a :exc:`PermissionError`.
pt_pt: *delete* é verdadeiro, mas *delete_on_close* é falso. Note que, neste caso, as aberturas adicionais que não partilham acesso de eliminação (por exemplo, criadas através de :func:`open` integrado) devem ser fechadas antes de sair do gestor de contexto, caso contrário, a chamada :func:`os.unlink` na saída do gestor de contexto falhará com um :exc:`PermissionError`.
ru: *delete* — это правда, но *delete_on_close* — это ложь. Обратите внимание, что в этом случае дополнительные открытия, которые не имеют общего доступа к удалению (например, созданные с помощью встроенного :func:`open`), должны быть закрыты перед выходом из контекстного менеджера, в противном случае вызов :func:`os.unlink` в контекстном менеджере выход завершится неудачно с ошибкой :exc:`PermissionError`.

source: On Windows, if *delete_on_close* is false, and the file is created in a directory for which the user lacks delete access, then the :func:`os.unlink` call on exit of the context manager will fail with a :exc:`PermissionError`. This cannot happen when *delete_on_close* is true because delete access is requested by the open, which fails immediately if the requested access is not granted.
pt_pt: No Windows, se *delete_on_close* for falso e o ficheiro for criado num diretório para o qual o utilizador não tem permissão de eliminação, então a chamada :func:`os.unlink` na saída do gestor de contexto falhará com um :exc:`PermissionError`. Isto não pode acontecer quando *delete_on_close* é verdadeiro, porque o acesso de eliminação é solicitado pela abertura, que falha imediatamente se o acesso solicitado não for concedido.
ru: В Windows, если *delete_on_close* имеет значение false и файл создан в каталоге, для которого у пользователя нет доступа к удалению, то вызов :func:`os.unlink` при выходе из контекстного менеджера завершится с ошибкой :exc: `Ошибка разрешения`. Этого не может произойти, если *delete_on_close* истинно, поскольку доступ на удаление запрашивается при открытии, которое немедленно завершается неудачно, если запрошенный доступ не предоставлен.

source: On POSIX (only), a process that is terminated abruptly with SIGKILL cannot automatically delete any NamedTemporaryFiles it created.
pt_pt: Em POSIX (apenas), um processo que é terminado abruptamente com SIGKILL não pode eliminar automaticamente quaisquer ficheiros NamedTemporaryFiles que tenha criado.
ru: Только в POSIX процесс, который внезапно завершается с помощью SIGKILL, не может автоматически удалить любые созданные им NamedTemporaryFiles.
sv: På POSIX (endast) kan en process som avslutas abrupt med SIGKILL inte automatiskt ta bort NamedTemporaryFiles som den har skapat.

source: Added *delete_on_close* parameter.
pt_pt: Adicionado o parâmetro *delete_on_close*.
ru: Добавлен параметр *delete_on_close*.

source: This class operates exactly as :func:`TemporaryFile` does, except that data is spooled in memory until the file size exceeds *max_size*, or until the file's :func:`~io.IOBase.fileno` method is called, at which point the contents are written to disk and operation proceeds as with :func:`TemporaryFile`.
pt_pt: Esta classe opera exatamente como :func:`TemporaryFile`, exceto que os dados são armazenados em memória até que o tamanho do ficheiro exceda *max_size*, ou até que o método :func:`~io.IOBase.fileno` do ficheiro seja chamado, momento em que o conteúdo é escrito no disco e a operação prossegue como em :func:`TemporaryFile`.
ru: Этот класс работает точно так же, как :func:`TemporaryFile`, за исключением того, что данные помещаются в память до тех пор, пока размер файла не превысит *max_size*, или пока не будет вызван метод :func:`~io.IOBase.fileno`, при котором В этот момент содержимое записывается на диск, и операция продолжается как с :func:`TemporaryFile`.
sv: Den här klassen fungerar precis som :func:`TemporaryFile`, förutom att data spolas i minnet tills filstorleken överstiger *max_size*, eller tills filens :func:`~io.IOBase.fileno`-metod anropas, varvid innehållet skrivs till disken och operationen fortsätter som med :func:`TemporaryFile`.

source: The resulting file has one additional method, :meth:`!rollover`, which causes the file to roll over to an on-disk file regardless of its size.
pt_pt: O ficheiro resultante tem um método adicional, :meth:`!rollover`, que faz com que o ficheiro seja transferido para um ficheiro em disco, independentemente do seu tamanho.
ru: Результирующий файл имеет один дополнительный метод :meth:`!rollover`, который заставляет файл перевернуться на файл на диске независимо от его размера.
sv: Den resulterande filen har ytterligare en metod, :meth:`!rollover`, som gör att filen rullas över till en fil på disken oavsett dess storlek.
