Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/termios.po
Languages: ru, sv

source: This module provides an interface to the POSIX calls for tty I/O control. For a complete description of these calls, see :manpage:`termios(3)` Unix manual page. It is only available for those Unix versions that support POSIX *termios* style tty I/O control configured during installation.
ru: Этот модуль предоставляет интерфейс для вызовов POSIX для управления tty вводом/выводом. Полное описание этих вызовов можно найти на странице руководства Unix :manpage:`termios(3)`. Он доступен только для тех версий Unix, которые поддерживают управление tty ввода-вывода в стиле POSIX *termios*, настроенное во время установки.
sv: Denna modul tillhandahåller ett gränssnitt till POSIX-anropen för tty I/O-kontroll. För en fullständig beskrivning av dessa anrop, se :manpage:`termios(3)` Unix-manualsida. Den är endast tillgänglig för de Unix-versioner som stöder POSIX *termios*-stil tty I/O-kontroll som konfigureras under installationen.

source: All functions in this module take a file descriptor *fd* as their first argument. This can be an integer file descriptor, such as returned by ``sys.stdin.fileno()``, or a :term:`file object`, such as ``sys.stdin`` itself.
ru: Все функции в этом модуле принимают файловый дескриптор *fd* в качестве первого аргумента. Это может быть целочисленный файловый дескриптор, например, возвращаемый ``sys.stdin.fileno()``, или :term:`файловый объект`, например, сам ``sys.stdin``.
sv: Alla funktioner i denna modul tar en filbeskrivare *fd* som sitt första argument. Detta kan vara en heltalsfilbeskrivning, som den som returneras av ``sys.stdin.fileno()``, eller ett :term:`filobjekt`, som ``sys.stdin`` själv.

source: This module also defines all the constants needed to work with the functions provided here; these have the same name as their counterparts in C. Please refer to your system documentation for more information on using these terminal control interfaces.
ru: Этот модуль также определяет все константы, необходимые для работы с представленными здесь функциями; они имеют те же имена, что и их аналоги в C. Пожалуйста, обратитесь к документации вашей системы для получения дополнительной информации об использовании этих интерфейсов управления терминалом.
sv: Denna modul definierar också alla konstanter som behövs för att arbeta med de funktioner som tillhandahålls här; dessa har samma namn som sina motsvarigheter i C. Se din systemdokumentation för mer information om hur du använder dessa gränssnitt för terminalstyrning.

source: The module defines the following functions:
ru: Модуль определяет следующие функции:
sv: Modulen definierar följande funktioner:

source: Return a list containing the tty attributes for file descriptor *fd*, as follows: ``[iflag, oflag, cflag, lflag, ispeed, ospeed, cc]`` where *cc* is a list of the tty special characters (each a string of length 1, except the items with indices :const:`VMIN` and :const:`VTIME`, which are integers when these fields are defined). The interpretation of the flags and the speeds as well as the indexing in the *cc* array must be done using the symbolic constants defined in the :mod:`termios` module.
ru: Возвращает список, содержащий атрибуты tty для файлового дескриптора *fd*, следующим образом: ``[iflag, oflag, cflag, lflag, ispeed, ospeed, cc]`` где *cc* — список специальных символов tty (каждый строка длиной 1, за исключением элементов с индексами :const:`VMIN` и :const:`VTIME`, которые являются целыми числами, когда эти поля определены). Интерпретация флагов и скоростей, а также индексация в массиве *cc* должны выполняться с использованием символических констант, определенных в модуле :mod:`termios`.
sv: Returnerar en lista som innehåller tty-attributen för filbeskrivaren *fd*, enligt följande: ``[iflag, oflag, cflag, lflag, ispeed, ospeed, cc]`` där *cc* är en lista med tty-specialtecken (var och en en sträng med längden 1, utom objekten med index :const:`VMIN` och :const:`VTIME`, som är heltal när dessa fält definieras). Tolkningen av flaggorna och hastigheterna samt indexeringen i *cc*-arrayen måste göras med hjälp av de symboliska konstanter som definieras i modulen :mod:`termios`.

source: Set the tty attributes for file descriptor *fd* from the *attributes*, which is a list like the one returned by :func:`tcgetattr`. The *when* argument determines when the attributes are changed:
ru: Установите атрибуты tty для файлового дескриптора *fd* из *attributes*, который представляет собой список, подобный тому, который возвращает :func:`tcgetattr`. Аргумент *when* определяет, когда изменяются атрибуты:

source: Change attributes immediately.
ru: Немедленно измените атрибуты.

source: Change attributes after transmitting all queued output.
ru: Измените атрибуты после передачи всех выходных данных в очереди.

source: Change attributes after transmitting all queued output and discarding all queued input.
ru: Измените атрибуты после передачи всего вывода в очереди и отмены всех входных данных в очереди.

source: Send a break on file descriptor *fd*. A zero *duration* sends a break for 0.25--0.5 seconds; a nonzero *duration* has a system dependent meaning.
ru: Отправить разрыв файлового дескриптора *fd*. Нулевая *длительность* означает паузу на 0,25–0,5 секунды; ненулевая *длительность* имеет значение, зависящее от системы.
sv: Skicka en paus på filbeskrivaren *fd*. En noll *duration* skickar en paus i 0,25--0,5 sekunder; en icke-noll *duration* har en systemberoende betydelse.

source: Wait until all output written to file descriptor *fd* has been transmitted.
ru: Подождите, пока не будут переданы все выходные данные, записанные в файловый дескриптор *fd*.
sv: Vänta tills alla utdata som skrivits till filbeskrivaren *fd* har överförts.

source: Discard queued data on file descriptor *fd*. The *queue* selector specifies which queue: :const:`TCIFLUSH` for the input queue, :const:`TCOFLUSH` for the output queue, or :const:`TCIOFLUSH` for both queues.
ru: Отбросить данные из очереди в файловом дескрипторе *fd*. Селектор *queue* указывает, какая очередь: :const:`TCIFLUSH` для входной очереди, :const:`TCOFLUSH` для выходной очереди или :const:`TCIOFLUSH` для обеих очередей.
sv: Kassera köade data på filbeskrivaren *fd*. Väljaren *queue* anger vilken kö: :const:`TCIFLUSH` för ingångskön, :const:`TCOFLUSH` för utgångskön eller :const:`TCIOFLUSH` för båda köerna.

source: Suspend or resume input or output on file descriptor *fd*. The *action* argument can be :const:`TCOOFF` to suspend output, :const:`TCOON` to restart output, :const:`TCIOFF` to suspend input, or :const:`TCION` to restart input.
ru: Приостановить или возобновить ввод или вывод файлового дескриптора *fd*. Аргументом *action* может быть :const:`TCOOFF` для приостановки вывода, :const:`TCOON` для перезапуска вывода, :const:`TCIOFF` для приостановки ввода или :const:`TCION` для перезапуска ввода.
sv: Avbryt eller återuppta inmatning eller utmatning på filbeskrivaren *fd*. Argumentet *action* kan vara :const:`TCOOFF` för att avbryta utdata, :const:`TCOON` för att starta om utdata, :const:`TCIOFF` för att avbryta inmatning eller :const:`TCION` för att starta om inmatning.

source: Return a tuple ``(ws_row, ws_col)`` containing the tty window size for file descriptor *fd*. Requires :const:`termios.TIOCGWINSZ` or :const:`termios.TIOCGSIZE`.
ru: Возвращает кортеж ``(ws_row, ws_col)``, содержащий размер окна tty для файлового дескриптора *fd*. Требуется :const:`termios.TIOCGWINSZ` или :const:`termios.TIOCGSIZE`.

source: Set the tty window size for file descriptor *fd* from *winsize*, which is a two-item tuple ``(ws_row, ws_col)`` like the one returned by :func:`tcgetwinsize`. Requires at least one of the pairs (:const:`termios.TIOCGWINSZ`, :const:`termios.TIOCSWINSZ`); (:const:`termios.TIOCGSIZE`, :const:`termios.TIOCSSIZE`) to be defined.
ru: Установите размер окна tty для файлового дескриптора *fd* из *winsize*, который представляет собой кортеж из двух элементов ``(ws_row, ws_col)``, подобный тому, который возвращается :func:`tcgetwinsize`. Требуется хотя бы одна из пар (:const:`termios.TIOCGWINSZ`, :const:`termios.TIOCSWINSZ`); (:const:`termios.TIOCGSIZE`, :const:`termios.TIOCSSIZE`), который необходимо определить.

source: Module :mod:`tty`
ru: Модуль :mod:`tty`
sv: Modul :mod:`tty`

source: Convenience functions for common terminal control operations.
ru: Удобные функции для обычных операций управления терминалом.
sv: Praktiska funktioner för vanliga terminalstyrningsoperationer.

source: Example
ru: Пример
sv: Exempel

source: Here's a function that prompts for a password with echoing turned off. Note the technique using a separate :func:`tcgetattr` call and a :keyword:`try` ... :keyword:`finally` statement to ensure that the old tty attributes are restored exactly no matter what happens::
ru: Вот функция, которая запрашивает пароль с отключенным эхом. Обратите внимание на технику использования отдельного вызова :func:`tcgetattr` и оператора :keyword:`try` ... :keyword:`finally`, чтобы гарантировать, что старые атрибуты tty будут восстановлены точно, что бы ни случилось::
sv: Här är en funktion som frågar efter ett lösenord med ekot avstängt. Notera tekniken med ett separat :func:`tcgetattr`-anrop och en :keyword:`try` ... :keyword:`finally`-sats för att säkerställa att de gamla tty-attributen återställs exakt oavsett vad som händer::

source: I/O control
ru: управление ввода/вывода
