Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/test.po
Languages: pt_pt, ru

source: The timeout is short enough to prevent a test to wait for too long if the internet request is blocked for whatever reason.
pt_pt: O tempo limite é curto o suficiente para evitar que um teste espere demasiado tempo se o pedido à Internet estiver bloqueado por qualquer motivo.
ru: Тайм-аут достаточно короткий, чтобы предотвратить слишком долгое ожидание теста, если интернет-запрос заблокирован по какой-либо причине.

source: Usually, a timeout using :data:`INTERNET_TIMEOUT` should not mark a test as failed, but skip the test instead: see :func:`~test.support.socket_helper.transient_internet`.
pt_pt: Normalmente, um tempo limite usando :data:`INTERNET_TIMEOUT` não deve marcar um teste como falhado, mas deve ignorar o teste: veja :func:`~test.support.socket_helper.transient_internet`.
ru: Обычно тайм-аут с использованием :data:`INTERNET_TIMEOUT` не должен отмечать тест как неудавшийся, а вместо этого пропускать тест: см. :func:`~test.support.socket_helper.transient_internet`.

source: Its default value is 1 minute.
pt_pt: O seu valor predefinido é 1 minuto.
ru: Его значение по умолчанию — 1 минута.

source: See also :data:`LOOPBACK_TIMEOUT`.
pt_pt: Veja também :data:`LOOPBACK_TIMEOUT`.
ru: См. также :data:`LOOPBACK_TIMEOUT`.

source: Timeout in seconds to mark a test as failed if the test takes "too long".
pt_pt: Tempo limite em segundos para marcar um teste como falhado se o teste demorar "demasiado tempo".
ru: Тайм-аут в секундах для отметки теста как неудавшегося, если тест занимает «слишком много времени».

source: The timeout value depends on the regrtest ``--timeout`` command line option.
pt_pt: O valor do tempo limite depende da opção de linha de comandos ``--timeout`` do regrtest.
ru: Значение таймаута зависит от опции командной строки ``--timeout`` regrtest.

source: If a test using :data:`SHORT_TIMEOUT` starts to fail randomly on slow buildbots, use :data:`LONG_TIMEOUT` instead.
pt_pt: Se um teste que usa :data:`SHORT_TIMEOUT` começar a falhar aleatoriamente em buildbots lentos, use :data:`LONG_TIMEOUT` em vez disso.
ru: Если тест с использованием :data:`SHORT_TIMEOUT` начинает случайным образом завершаться неудачей на медленных сборочных роботах, используйте вместо этого :data:`LONG_TIMEOUT`.

source: Its default value is 30 seconds.
pt_pt: O seu valor predefinido é 30 segundos.
ru: Его значение по умолчанию — 30 секунд.

source: Timeout in seconds to detect when a test hangs.
pt_pt: Tempo limite em segundos para detetar quando um teste fica bloqueado.
ru: Тайм-аут в секундах для обнаружения зависания теста.

source: It is long enough to reduce the risk of test failure on the slowest Python buildbots. It should not be used to mark a test as failed if the test takes "too long". The timeout value depends on the regrtest ``--timeout`` command line option.
pt_pt: É longo o suficiente para reduzir o risco de falha do teste nos buildbots mais lentos do Python. Não deve ser usado para marcar um teste como falhado se o teste demorar "demasiado tempo". O valor do tempo limite depende da opção de linha de comandos ``--timeout`` do regrtest.
ru: Этого достаточно, чтобы снизить риск провала теста на самых медленных сборочных роботах Python. Его не следует использовать для обозначения теста как неудавшегося, если тест занимает «слишком много времени». Значение таймаута зависит от опции командной строки ``--timeout`` regrtest.

source: Its default value is 5 minutes.
pt_pt: O seu valor predefinido é 5 minutos.
ru: Его значение по умолчанию — 5 минут.

source: See also :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` and :data:`SHORT_TIMEOUT`.
pt_pt: Veja também :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` e :data:`SHORT_TIMEOUT`.
ru: См. также :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` и :data:`SHORT_TIMEOUT`.

source: Set when tests can be skipped when they are not useful for PGO.
pt_pt: Definido quando os testes podem ser ignorados se não forem úteis para PGO.
ru: Установите, когда тесты можно пропустить, если они бесполезны для PGO.

source: A constant that is likely larger than the underlying OS pipe buffer size, to make writes blocking.
pt_pt: Uma constante que é provavelmente maior do que o tamanho do buffer de pipe do SO subjacente, para tornar as escritas bloqueantes.
ru: Константа, которая, вероятно, больше, чем размер буфера основного канала ОС, чтобы обеспечить блокировку записи.

source: A constant that is likely larger than the underlying OS socket buffer size, to make writes blocking.
pt_pt: Uma constante que é provavelmente maior do que o tamanho do buffer de socket do SO subjacente, para tornar as escritas bloqueantes.
ru: Константа, которая, вероятно, больше, чем размер буфера сокета базовой ОС, чтобы обеспечить блокировку записи.

source: Set to the top level directory that contains :mod:`test.support`.
pt_pt: Definido para o diretório de nível superior que contém :mod:`test.support`.
ru: Установите каталог верхнего уровня, содержащий :mod:`test.support`.

source: Set to the top level directory for the test package.
pt_pt: Definido para o diretório de nível superior do pacote de testes.
ru: Установите каталог верхнего уровня для тестового пакета.

source: Set to the ``data`` directory within the test package.
pt_pt: Definido para o diretório ``data`` dentro do pacote de testes.
ru: Установите каталог ``data`` в тестовом пакете.

source: Set to :data:`sys.maxsize` for big memory tests.
pt_pt: Definido para :data:`sys.maxsize` para testes de memória grande.
ru: Установите значение :data:`sys.maxsize` для больших тестов памяти.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Limited by :data:`MAX_Py_ssize_t`.
pt_pt: Definido por :func:`set_memlimit` como o limite de memória para testes de memória grande. Limitado por :data:`MAX_Py_ssize_t`.
ru: Устанавливается :func:`set_memlimit` как ограничение памяти для больших тестов памяти. Ограничено :data:`MAX_Py_ssize_t`.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Not limited by :data:`MAX_Py_ssize_t`.
pt_pt: Definido por :func:`set_memlimit` como o limite de memória para testes de memória grande. Não limitado por :data:`MAX_Py_ssize_t`.
ru: Устанавливается :func:`set_memlimit` как ограничение памяти для больших тестов памяти. Не ограничено :data:`MAX_Py_ssize_t`.

source: Set to ``True`` if Python is built without docstrings (the :c:macro:`WITH_DOC_STRINGS` macro is not defined). See the :option:`configure --without-doc-strings <--without-doc-strings>` option.
pt_pt: Definido para ``True`` se o Python for construído sem docstrings (a macro :c:macro:`WITH_DOC_STRINGS` não está definida). Veja a opção :option:`configure --without-doc-strings <--without-doc-strings>`.
ru: Установите значение True, если Python собран без строк документации (макрос :c:macro:`WITH_DOC_STRINGS` не определен). См. параметр :option:`configure --without-doc-strings <--without-doc-strings>`.

source: See also the :data:`HAVE_DOCSTRINGS` variable.
pt_pt: Veja também a variável :data:`HAVE_DOCSTRINGS`.
ru: См. также переменная :data:`HAVE_DOCSTRINGS`.

source: Set to ``True`` if function docstrings are available. See the :option:`python -OO <-O>` option, which strips docstrings of functions implemented in Python.
pt_pt: Definido para ``True`` se as docstrings das funções estiverem disponíveis. Veja a opção :option:`python -OO <-O>`, que remove as docstrings das funções implementadas em Python.
ru: Установите значение True, если доступны строки документации по функциям. См. параметр :option:`python -OO <-O>`, который удаляет строки документации функций, реализованных в Python.

source: See also the :data:`MISSING_C_DOCSTRINGS` variable.
pt_pt: Veja também a variável :data:`MISSING_C_DOCSTRINGS`.
ru: См. также переменная :data:`MISSING_C_DOCSTRINGS`.

source: Define the URL of a dedicated HTTP server for the network tests.
pt_pt: Define a URL de um servidor HTTP dedicado para os testes de rede.
ru: Определите URL-адрес выделенного HTTP-сервера для сетевых тестов.

source: Object that is equal to anything. Used to test mixed type comparison.
pt_pt: Objeto que é igual a qualquer coisa. Usado para testar comparação de tipos mistos.
ru: Объект, равный чему-либо. Используется для проверки сравнения смешанных типов.

source: Object that is not equal to anything (even to :data:`ALWAYS_EQ`). Used to test mixed type comparison.
pt_pt: Objeto que não é igual a nada (mesmo a :data:`ALWAYS_EQ`). Usado para testar comparações de tipos mistos.
ru: Объект, который ничему не равен (даже :data:`ALWAYS_EQ`). Используется для проверки сравнения смешанных типов.

source: Object that is greater than anything (except itself). Used to test mixed type comparison.
pt_pt: Objeto que é maior do que qualquer coisa (exceto a si mesmo). Usado para testar comparações de tipos mistos.
ru: Объект, который больше всего (кроме самого себя). Используется для проверки сравнения смешанных типов.

source: Object that is less than anything (except itself). Used to test mixed type comparison.
pt_pt: Objeto que é menor do que qualquer coisa (exceto a si mesmo). Usado para testar comparações de tipos mistos.
ru: Объект, который меньше всего (кроме самого себя). Используется для проверки сравнения смешанных типов.

source: The :mod:`test.support` module defines the following functions:
pt_pt: O módulo :mod:`test.support` define as seguintes funções:
ru: Модуль :mod:`test.support` определяет следующие функции:

source: Run the loop body until ``break`` stops the loop.
ru: Выполняйте тело цикла до тех пор, пока ``break`` не остановит цикл.

source: After *timeout* seconds, raise an :exc:`AssertionError` if *error* is true, or just stop the loop if *error* is false.
ru: По истечении *таймаута* секунд выдайте :exc:`AssertionError`, если *error* истинно, или просто остановите цикл, если *error* ложно.

source: Example::
ru: Пример::

source: Example of error=False usage::
ru: Пример использования error=False::

source: Wait strategy that applies exponential backoff.
ru: Стратегия ожидания, которая применяет экспоненциальную отсрочку.

source: Run the loop body until ``break`` stops the loop. Sleep at each loop iteration, but not at the first iteration. The sleep delay is doubled at each iteration (up to *max_delay* seconds).
ru: Выполняйте тело цикла до тех пор, пока ``break`` не остановит цикл. Sleep на каждой итерации цикла, но не на первой итерации. Задержка сна удваивается на каждой итерации (до *max_delay* секунд).

source: See :func:`busy_retry` documentation for the parameters usage.
ru: См. документацию :func:`busy_retry` для использования параметров.

source: Example raising an exception after SHORT_TIMEOUT seconds::
ru: Пример создания исключения через несколько секунд SHORT_TIMEOUT::

source: Return ``True`` if *resource* is enabled and available. The list of available resources is only set when :mod:`test.regrtest` is executing the tests.
pt_pt: Devolve ``True`` se *resource* estiver ativado e disponível. A lista de recursos disponíveis só é definida quando :mod:`test.regrtest` está a executar os testes.
ru: Возвращает ``True``, если параметр *resource* включен и доступен. Список доступных ресурсов задается только при выполнении тестов :mod:`test.regrtest`.

source: Return ``True`` if Python was not built with ``-O0`` or ``-Og``.
pt_pt: Devolve ``True`` se o Python não foi construído com ``-O0`` ou ``-Og``.
ru: Верните ``True``, если Python не был собран с ``-O0`` или ``-Og``.

source: Return :const:`_testcapi.WITH_PYMALLOC`.
ru: Верните :const:`_testcapi.WITH_PYMALLOC`.

source: Raise :exc:`ResourceDenied` if *resource* is not available. *msg* is the argument to :exc:`ResourceDenied` if it is raised. Always returns ``True`` if called by a function whose ``__name__`` is ``'__main__'``. Used when tests are executed by :mod:`test.regrtest`.
pt_pt: Levanta :exc:`ResourceDenied` se *resource* não estiver disponível. *msg* é o argumento para :exc:`ResourceDenied` se for levantado. Sempre devolve ``True`` se chamado por uma função cujo ``__name__`` é ``'__main__'``. Usado quando os testes são executados por :mod:`test.regrtest`.
ru: Поднимите :exc:`ResourceDenied`, если *ресурс* недоступен. *msg* является аргументом для :exc:`ResourceDenied`, если он поднят. Всегда возвращает True, если вызывается функцией, чье ``__name__`` равно ``'__main__'``. Используется, когда тесты выполняются с помощью :mod:`test.regrtest`.

source: Return a repr of *dict* with keys sorted.
pt_pt: Devolve um repr de *dict* com as chaves ordenadas.
ru: Вернуть копию *dict* с отсортированными ключами.

source: Return the path to the file named *filename*. If no match is found *filename* is returned. This does not equal a failure since it could be the path to the file.
pt_pt: Devolve o caminho para o ficheiro chamado *filename*. Se nenhuma correspondência for encontrada, *filename* é devolvido. Isto não equivale a uma falha, uma vez que pode ser o caminho para o ficheiro.
ru: Вернуть копию *dict* с отсортированными ключами.

source: Setting *subdir* indicates a relative path to use to find the file rather than looking directly in the path directories.
pt_pt: Definir *subdir* indica um caminho relativo a usar para encontrar o ficheiro, em vez de procurar diretamente nos diretórios do caminho.
ru: Параметр *subdir* указывает относительный путь, который следует использовать для поиска файла, а не искать непосредственно в каталогах путей.

source: Set the :func:`sys.setswitchinterval` to the given *interval*. Defines a minimum interval for Android systems to prevent the system from hanging.
pt_pt: Define :func:`sys.setswitchinterval` para o *interval* dado. Define um intervalo mínimo para sistemas Android para evitar que o sistema fique bloqueado.
ru: Установите для :func:`sys.setswitchinterval` заданный *интервал*. Определяет минимальный интервал для систем Android, чтобы предотвратить зависание системы.

source: Use this check to guard CPython's implementation-specific tests or to run them only on the implementations guarded by the arguments. This function returns ``True`` or ``False`` depending on the host platform. Example usage::
pt_pt: Use esta verificação para proteger testes específicos da implementação do CPython ou para os executar apenas nas implementações protegidas pelos argumentos. Esta função devolve ``True`` ou ``False`` dependendo da plataforma do host. Exemplo de uso::
ru: Используйте эту проверку, чтобы защитить тесты CPython, специфичные для реализации, или запускать их только в реализациях, защищенных аргументами. Эта функция возвращает ``True`` или ``False`` в зависимости от хост-платформы. Пример использования::

source: Set the values for :data:`max_memuse` and :data:`real_max_memuse` for big memory tests.
pt_pt: Define os valores para :data:`max_memuse` e :data:`real_max_memuse` para testes de memória grande.
ru: Установите значения для :data:`max_memuse` и :data:`real_max_memuse` для больших тестов памяти.

source: Store the value from *stdout*. It is meant to hold the stdout at the time the regrtest began.
pt_pt: Armazena o valor de *stdout*. Destina-se a conter o stdout no momento em que o regrtest começou.
ru: Сохраните значение из *stdout*. Он предназначен для хранения стандартного вывода в момент начала повторного тестирования.

source: Return the original stdout set by :func:`record_original_stdout` or ``sys.stdout`` if it's not set.
pt_pt: Devolve o stdout original definido por :func:`record_original_stdout` ou ``sys.stdout`` se não estiver definido.
ru: Возвращает исходный стандартный вывод, установленный с помощью :func:`record_original_stdout` или ``sys.stdout``, если он не установлен.

source: Return a list of command line arguments reproducing the current settings in ``sys.flags`` and ``sys.warnoptions``.
pt_pt: Devolve uma lista de argumentos de linha de comandos que reproduzem as configurações atuais em ``sys.flags`` e ``sys.warnoptions``.
ru: Возвращает список аргументов командной строки, воспроизводящих текущие настройки в ``sys.flags`` и ``sys.warnoptions``.

source: Return a list of command line arguments reproducing the current optimization settings in ``sys.flags``.
pt_pt: Devolve uma lista de argumentos de linha de comandos que reproduzem as configurações de otimização atuais em ``sys.flags``.
ru: Возвращает список аргументов командной строки, воспроизводящих текущие настройки оптимизации в ``sys.flags``.

source: A context managers that temporarily replaces the named stream with :class:`io.StringIO` object.
pt_pt: Um gestor de contexto que substitui temporariamente o fluxo nomeado por um objeto :class:`io.StringIO`.
ru: Менеджеры контекста, которые временно заменяют именованный поток объектом :class:`io.StringIO`.

source: Example use with output streams::
pt_pt: Exemplo de uso com fluxos de saída::
ru: Пример использования с выходными потоками::

source: Example use with input stream::
pt_pt: Exemplo de uso com fluxo de entrada::
ru: Пример использования с входным потоком::

source: A context manager that temporary disables :mod:`faulthandler`.
pt_pt: Um gestor de contexto que desativa temporariamente :mod:`faulthandler`.
ru: Контекстный менеджер, который временно отключает :mod:`faulthandler`.

source: Force as many objects as possible to be collected. This is needed because timely deallocation is not guaranteed by the garbage collector. This means that ``__del__`` methods may be called later than expected and weakrefs may remain alive for longer than expected.
pt_pt: Força a coleta do maior número possível de objetos. Isto é necessário porque a desalocação atempada não é garantida pelo coletor de lixo. Isto significa que os métodos ``__del__`` podem ser chamados mais tarde do que o esperado e as referências fracas podem permanecer vivas por mais tempo do que o esperado.
ru: Соберите как можно больше объектов. Это необходимо, поскольку сборщик мусора не гарантирует своевременное освобождение. Это означает, что методы __del__ могут быть вызваны позже, чем ожидалось, а слабые ссылки могут оставаться активными дольше, чем ожидалось.

source: A context manager that disables the garbage collector on entry. On exit, the garbage collector is restored to its prior state.
pt_pt: Um gestor de contexto que desativa o coletor de lixo na entrada. Na saída, o coletor de lixo é restaurado para o seu estado anterior.
ru: Контекстный менеджер, который отключает сборщик мусора при входе. При выходе сборщик мусора возвращается в прежнее состояние.

source: Context manager to swap out an attribute with a new object.
pt_pt: Gestor de contexto para substituir um atributo por um novo objeto.
ru: Менеджер контекста для замены атрибута новым объектом.

source: Usage::
pt_pt: Utilização::
ru: Использование::

source: This will set ``obj.attr`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``attr`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
pt_pt: Isto definirá ``obj.attr`` para 5 durante a duração do bloco ``with``, restaurando o valor antigo no final do bloco. Se ``attr`` não existir em ``obj``, será criado e depois eliminado no final do bloco.
ru: Это установит для obj.attr значение 5 на время действия блока with, восстановив старое значение в конце блока. Если ``attr`` не существует в ``obj``, он будет создан, а затем удален в конце блока.

source: The old value (or ``None`` if it doesn't exist) will be assigned to the target of the "as" clause, if there is one.
pt_pt: O valor antigo (ou ``None`` se não existir) será atribuído ao alvo da cláusula "as", se houver um.
ru: Старое значение (или None, если оно не существует) будет присвоено цели предложения as, если оно существует.

source: Context manager to swap out an item with a new object.
pt_pt: Gestor de contexto para substituir um item por um novo objeto.
ru: Менеджер контекста для замены элемента новым объектом.

source: This will set ``obj["item"]`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``item`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
pt_pt: Isto definirá ``obj["item"]`` para 5 durante a duração do bloco ``with``, restaurando o valor antigo no final do bloco. Se ``item`` não existir em ``obj``, será criado e depois eliminado no final do bloco.
ru: Это установит для ``obj["item"]`` значение 5 на время действия блока ``with``, восстанавливая старое значение в конце блока. Если ``item`` не существует в ``obj``, он будет создан, а затем удален в конце блока.

source: Call the ``flush()`` method on :data:`sys.stdout` and then on :data:`sys.stderr`. It can be used to make sure that the logs order is consistent before writing into stderr.
ru: Вызовите метод ``flush()`` на :data:`sys.stdout`, а затем на :data:`sys.stderr`. Его можно использовать, чтобы убедиться в единообразии порядка журналов перед записью в stderr.

source: Print a warning into :data:`sys.__stderr__`. Format the message as: ``f"Warning -- {msg}"``. If *msg* is made of multiple lines, add ``"Warning -- "`` prefix to each line.
pt_pt: Imprime um aviso em :data:`sys.__stderr__`. Formata a mensagem como: ``f"Warning -- {msg}"``. Se *msg* for composto por várias linhas, adiciona o prefixo ``"Warning -- "`` a cada linha.
ru: Напечатайте предупреждение в :data:`sys.__stderr__`. Отформатируйте сообщение следующим образом: ``f"Предупреждение -- {msg}"``. Если *msg* состоит из нескольких строк, добавьте префикс ``"Warning -- "`` к каждой строке.

source: Wait until process *pid* completes and check that the process exit code is *exitcode*.
pt_pt: Espera até que o processo *pid* termine e verifica se o código de saída do processo é *exitcode*.
ru: Подождите, пока процесс *pid* завершится, и убедитесь, что код завершения процесса — *exitcode*.

source: Raise an :exc:`AssertionError` if the process exit code is not equal to *exitcode*.
pt_pt: Levanta um :exc:`AssertionError` se o código de saída do processo não for igual a *exitcode*.
ru: Вызовите :exc:`AssertionError`, если код завершения процесса не равен *exitcode*.

source: If the process runs longer than *timeout* seconds (:data:`SHORT_TIMEOUT` by default), kill the process and raise an :exc:`AssertionError`. The timeout feature is not available on Windows.
pt_pt: Se o processo demorar mais do que *timeout* segundos (por predefinição, :data:`SHORT_TIMEOUT`), mata o processo e levanta um :exc:`AssertionError`. A funcionalidade de tempo limite não está disponível no Windows.
ru: Если процесс выполняется дольше, чем *timeout* секунд (:data:`SHORT_TIMEOUT` по умолчанию), завершите процесс и вызовите :exc:`AssertionError`. Функция тайм-аута недоступна в Windows.

source: Return the size of the :c:type:`PyObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
pt_pt: Devolve o tamanho do :c:type:`PyObject` cujos membros da estrutura são definidos por *fmt*. O valor devolvido inclui o tamanho do cabeçalho do objeto Python e o alinhamento.
ru: Возвращает размер :c:type:`PyObject`, члены структуры которого определяются *fmt*. Возвращаемое значение включает размер заголовка объекта Python и выравнивание.

source: Return the size of the :c:type:`PyVarObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
pt_pt: Devolve o tamanho do :c:type:`PyVarObject` cujos membros da estrutura são definidos por *fmt*. O valor devolvido inclui o tamanho do cabeçalho do objeto Python e o alinhamento.
ru: Возвращает размер :c:type:`PyVarObject`, члены структуры которого определены *fmt*. Возвращаемое значение включает размер заголовка объекта Python и выравнивание.
