Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/test.po
Languages: pt_pt, ru

source: The :mod:`test.support.socket_helper` module provides support for socket tests.
pt_pt: O módulo :mod:`test.support.socket_helper` fornece suporte para testes de socket.
ru: Модуль :mod:`test.support.socket_helper` обеспечивает поддержку тестов сокетов.

source: Set to ``True`` if IPv6 is enabled on this host, ``False`` otherwise.
pt_pt: Definido para ``True`` se IPv6 estiver ativado neste host, ``False`` caso contrário.
ru: Установите значение «True», если на этом хосте включен IPv6, в противном случае — «False».

source: Returns an unused port that should be suitable for binding. This is achieved by creating a temporary socket with the same family and type as the ``sock`` parameter (default is :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`), and binding it to the specified host address (defaults to ``0.0.0.0``) with the port set to 0, eliciting an unused ephemeral port from the OS. The temporary socket is then closed and deleted, and the ephemeral port is returned.
pt_pt: Devolve uma porta não utilizada que deve ser adequada para ligação. Isto é conseguido criando um socket temporário com a mesma família e tipo que o parâmetro ``sock`` (o predefinido é :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`), e ligando-o ao endereço do host especificado (por predefinição ``0.0.0.0``) com a porta definida para 0, obtendo uma porta efémera não utilizada do SO. O socket temporário é então fechado e eliminado, e a porta efémera é devolvida.
ru: Возвращает неиспользуемый порт, который должен быть пригоден для привязки. Это достигается путем создания временного сокета того же семейства и типа, что и параметр ``sock`` (по умолчанию: :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`), и привязки его к указанный адрес хоста (по умолчанию «0.0.0.0») с портом, установленным на 0, что позволяет получить неиспользуемый временный порт из ОС. Затем временный сокет закрывается и удаляется, а эфемерный порт возвращается.

source: Either this method or :func:`bind_port` should be used for any tests where a server socket needs to be bound to a particular port for the duration of the test. Which one to use depends on whether the calling code is creating a Python socket, or if an unused port needs to be provided in a constructor or passed to an external program (i.e. the ``-accept`` argument to openssl's s_server mode). Always prefer :func:`bind_port` over :func:`find_unused_port` where possible. Using a hard coded port is discouraged since it can make multiple instances of the test impossible to run simultaneously, which is a problem for buildbots.
pt_pt: Ou este método ou :func:`bind_port` deve ser usado para quaisquer testes onde um socket de servidor precise de ser ligado a uma porta específica durante a duração do teste. Qual usar depende se o código de chamada está a criar um socket Python, ou se uma porta não utilizada precisa de ser fornecida num construtor ou passada a um programa externo (por exemplo, o argumento ``-accept`` para o modo s_server do openssl). Sempre prefira :func:`bind_port` em relação a :func:`find_unused_port` sempre que possível. Usar uma porta codificada é desencorajado, uma vez que pode tornar impossível executar múltiplas instâncias do teste simultaneamente, o que é um problema para os buildbots.
ru: Либо этот метод, либо :func:`bind_port` следует использовать для любых тестов, в которых сокет сервера должен быть привязан к определенному порту на время теста. Какой из них использовать, зависит от того, создает ли вызывающий код сокет Python или неиспользуемый порт необходимо предоставить в конструкторе или передать во внешнюю программу (например, аргумент ``-accept`` для режима s_server openssl). Всегда отдавайте предпочтение :func:`bind_port` :func:`find_unused_port`, где это возможно. Использование жестко запрограммированного порта не рекомендуется, так как это может сделать невозможным одновременный запуск нескольких экземпляров теста, что является проблемой для ботов-сборщиков.

source: Bind the socket to a free port and return the port number. Relies on ephemeral ports in order to ensure we are using an unbound port. This is important as many tests may be running simultaneously, especially in a buildbot environment. This method raises an exception if the ``sock.family`` is :const:`~socket.AF_INET` and ``sock.type`` is :const:`~socket.SOCK_STREAM`, and the socket has :const:`~socket.SO_REUSEADDR` or :const:`~socket.SO_REUSEPORT` set on it. Tests should never set these socket options for TCP/IP sockets. The only case for setting these options is testing multicasting via multiple UDP sockets.
pt_pt: Liga o socket a uma porta livre e devolve o número da porta. Depende de portas efémeras para garantir que estamos a usar uma porta não ligada. Isto é importante, uma vez que muitos testes podem estar a ser executados simultaneamente, especialmente num ambiente de buildbot. Este método levanta uma exceção se ``sock.family`` for :const:`~socket.AF_INET` e ``sock.type`` for :const:`~socket.SOCK_STREAM`, e o socket tiver :const:`~socket.SO_REUSEADDR` ou :const:`~socket.SO_REUSEPORT` definido. Os testes nunca devem definir estas opções de socket para sockets TCP/IP. O único caso para definir estas opções é testar multicast através de múltiplos sockets UDP.
ru: Привяжите сокет к свободному порту и верните номер порта. Полагается на эфемерные порты, чтобы гарантировать, что мы используем несвязанный порт. Это важно, поскольку одновременно может выполняться множество тестов, особенно в среде buildbot. Этот метод вызывает исключение, если ``sock.family`` имеет значение :const:`~socket.AF_INET`, а ``sock.type`` имеет значение :const:`~socket.SOCK_STREAM`, а сокет имеет :const: `~socket.SO_REUSEADDR` или :const:`~socket.SO_REUSEPORT` установлен на нем. Тесты никогда не должны устанавливать эти параметры сокета для сокетов TCP/IP. Единственный случай установки этих параметров — тестирование многоадресной рассылки через несколько сокетов UDP.

source: Additionally, if the :const:`~socket.SO_EXCLUSIVEADDRUSE` socket option is available (i.e. on Windows), it will be set on the socket. This will prevent anyone else from binding to our host/port for the duration of the test.
pt_pt: Além disso, se a opção de socket :const:`~socket.SO_EXCLUSIVEADDRUSE` estiver disponível (por exemplo, no Windows), será definida no socket. Isto impedirá que qualquer outra pessoa se ligue ao nosso host/porta durante a duração do teste.
ru: Кроме того, если доступна опция сокета :const:`~socket.SO_EXCLUSIVEADDRUSE` (т. е. в Windows), она будет установлена ​​в сокете. Это предотвратит привязку кого-либо еще к нашему хосту/порту на время теста.

source: Bind a Unix socket, raising :exc:`unittest.SkipTest` if :exc:`PermissionError` is raised.
pt_pt: Liga um socket Unix, levantando :exc:`unittest.SkipTest` se :exc:`PermissionError` for levantado.
ru: Привяжите сокет Unix, вызывая :exc:`unittest.SkipTest`, если :exc:`PermissionError` поднят.

source: A decorator for running tests that require a functional ``bind()`` for Unix sockets.
pt_pt: Um decorador para executar testes que requerem um ``bind()`` funcional para sockets Unix.
ru: Декоратор для запуска тестов, требующих функционального ``bind()`` для сокетов Unix.

source: A context manager that raises :exc:`~test.support.ResourceDenied` when various issues with the internet connection manifest themselves as exceptions.
pt_pt: Um gestor de contexto que levanta :exc:`~test.support.ResourceDenied` quando vários problemas com a ligação à Internet se manifestam como exceções.
ru: Менеджер контекста, который вызывает :exc:`~test.support.ResourceDenied`, когда различные проблемы с подключением к Интернету проявляются в виде исключений.

source: :mod:`test.support.script_helper` --- Utilities for the Python execution tests
pt_pt: :mod:`test.support.script_helper` --- Utilitários para os testes de execução do Python
ru: :mod:`test.support.script_helper` --- Утилиты для тестов выполнения Python

source: The :mod:`test.support.script_helper` module provides support for Python's script execution tests.
pt_pt: O módulo :mod:`test.support.script_helper` fornece suporte para os testes de execução de scripts do Python.
ru: Модуль :mod:`test.support.script_helper` обеспечивает поддержку тестов выполнения скриптов Python.

source: Return ``True`` if ``sys.executable interpreter`` requires environment variables in order to be able to run at all.
pt_pt: Devolve ``True`` se ``sys.executable interpreter`` necessitar de variáveis de ambiente para poder ser executado.
ru: Верните True, если интерпретатору sys.executable требуются переменные среды, чтобы он вообще мог работать.

source: This is designed to be used with ``@unittest.skipIf()`` to annotate tests that need to use an ``assert_python*()`` function to launch an isolated mode (``-I``) or no environment mode (``-E``) sub-interpreter process.
pt_pt: Isto é concebido para ser usado com ``@unittest.skipIf()`` para anotar testes que precisam de usar uma função ``assert_python*()`` para lançar um processo de subinterpretador em modo isolado (``-I``) ou sem ambiente (``-E``).
ru: Это предназначено для использования с ``@unittest.skipIf()`` для аннотирования тестов, которым необходимо использовать функцию ``assert_python*()`` для запуска изолированного режима (``-I``) или без среды. режим (``-E``) процесс субинтерпретатора.

source: A normal build & test does not run into this situation but it can happen when trying to run the standard library test suite from an interpreter that doesn't have an obvious home with Python's current home finding logic.
pt_pt: Uma construção e teste normais não encontram esta situação, mas pode acontecer ao tentar executar a suíte de testes da biblioteca padrão a partir de um interpretador que não tem um local óbvio com a lógica atual de localização do diretório do Python.
ru: При обычной сборке и тестировании такая ситуация не возникает, но это может произойти при попытке запустить набор тестов стандартной библиотеки из интерпретатора, который не имеет очевидного исходного кода с текущей логикой поиска исходного кода Python.

source: Setting :envvar:`PYTHONHOME` is one way to get most of the testsuite to run in that situation. :envvar:`PYTHONPATH` or :envvar:`PYTHONUSERSITE` are other common environment variables that might impact whether or not the interpreter can start.
pt_pt: Definir :envvar:`PYTHONHOME` é uma forma de fazer com que a maioria da suíte de testes seja executada nessa situação. :envvar:`PYTHONPATH` ou :envvar:`PYTHONUSERSITE` são outras variáveis de ambiente comuns que podem afetar se o interpretador pode ou não iniciar.
ru: Установка :envvar:`PYTHONHOME` — это один из способов заставить большую часть набора тестов работать в такой ситуации. :envvar:`PYTHONPATH` или :envvar:`PYTHONUSERSITE` — это другие распространенные переменные среды, которые могут повлиять на возможность запуска интерпретатора.

source: Set up the environment based on *env_vars* for running the interpreter in a subprocess. The values can include ``__isolated``, ``__cleanenv``, ``__cwd``, and ``TERM``.
pt_pt: Configura o ambiente com base em *env_vars* para executar o interpretador num subprocesso. Os valores podem incluir ``__isolated``, ``__cleanenv``, ``__cwd`` e ``TERM``.
ru: Настройте среду на основе *env_vars* для запуска интерпретатора в подпроцессе. Значения могут включать __isolated, __cleanenv, __cwd и TERM.

source: The function no longer strips whitespaces from *stderr*.
pt_pt: A função já não remove espaços em branco de *stderr*.
ru: Функция больше не удаляет пробелы из *stderr*.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* succeeds (``rc == 0``) and return a ``(return code, stdout, stderr)`` tuple.
pt_pt: Afirma que executar o interpretador com *args* e variáveis de ambiente opcionais *env_vars* tem sucesso (``rc == 0``) e devolve um tuplo ``(return code, stdout, stderr)``.
ru: Подтвердите, что запуск интерпретатора с *args* и необязательными переменными среды *env_vars* завершился успешно (``rc == 0``) и верните кортеж ``(return code, stdout, stderr)``.

source: If the *__cleanenv* keyword-only parameter is set, *env_vars* is used as a fresh environment.
pt_pt: Se o parâmetro apenas de palavra-chave *__cleanenv* estiver definido, *env_vars* é usado como um ambiente novo.
ru: Если установлен параметр *__cleanenv*, доступный только по ключевому слову, *env_vars* используется как новая среда.

source: Python is started in isolated mode (command line option ``-I``), except if the *__isolated* keyword-only parameter is set to ``False``.
pt_pt: O Python é iniciado em modo isolado (opção de linha de comandos ``-I``), exceto se o parâmetro apenas de palavra-chave *__isolated* estiver definido como ``False``.
ru: Python запускается в изолированном режиме (опция командной строки ``-I``), за исключением случаев, когда для параметра только ключевого слова *__isolated* установлено значение ``False``.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* fails (``rc != 0``) and return a ``(return code, stdout, stderr)`` tuple.
pt_pt: Afirma que executar o interpretador com *args* e variáveis de ambiente opcionais *env_vars* falha (``rc != 0``) e devolve um tuplo ``(return code, stdout, stderr)``.
ru: Подтвердите, что запуск интерпретатора с *args* и дополнительными переменными среды *env_vars* завершился неудачно (``rc != 0``) и верните кортеж ``(return code, stdout, stderr)``.

source: See :func:`assert_python_ok` for more options.
pt_pt: Veja :func:`assert_python_ok` para mais opções.
ru: См. дополнительные параметры в :func:`assert_python_ok`.

source: Run a Python subprocess with the given arguments.
pt_pt: Executa um subprocesso Python com os argumentos dados.
ru: Запустите подпроцесс Python с заданными аргументами.

source: *kw* is extra keyword args to pass to :func:`subprocess.Popen`. Returns a :class:`subprocess.Popen` object.
pt_pt: *kw* são argumentos de palavra-chave extra para passar a :func:`subprocess.Popen`. Devolve um objeto :class:`subprocess.Popen`.
ru: *kw* — это дополнительные аргументы ключевого слова, которые нужно передать в :func:`subprocess.Popen`. Возвращает объект :class:`subprocess.Popen`.

source: Run the given :class:`subprocess.Popen` process until completion and return stdout.
pt_pt: Executa o processo :class:`subprocess.Popen` dado até à conclusão e devolve stdout.
ru: Запустите данный процесс :class:`subprocess.Popen` до завершения и верните стандартный вывод.

source: Create script containing *source* in path *script_dir* and *script_basename*. If *omit_suffix* is ``False``, append ``.py`` to the name. Return the full script path.
pt_pt: Cria um script contendo *source* no caminho *script_dir* e *script_basename*. Se *omit_suffix* for ``False``, anexa ``.py`` ao nome. Devolve o caminho completo do script.
ru: Создайте скрипт, содержащий *source* в пути *script_dir* и *script_basename*. Если *omit_suffix* имеет значение False, добавьте к имени .py. Верните полный путь к скрипту.

source: Create zip file at *zip_dir* and *zip_basename* with extension ``zip`` which contains the files in *script_name*. *name_in_zip* is the archive name. Return a tuple containing ``(full path, full path of archive name)``.
pt_pt: Cria um ficheiro zip em *zip_dir* e *zip_basename* com a extensão ``zip`` que contém os ficheiros em *script_name*. *name_in_zip* é o nome do arquivo. Devolve um tuplo contendo ``(full path, full path of archive name)``.
ru: Создайте zip-файл в *zip_dir* и *zip_basename* с расширением ``zip``, который содержит файлы в *script_name*. *name_in_zip* — имя архива. Возвращает кортеж, содержащий ``(полный путь, полный путь к имени архива)``.

source: Create a directory named *pkg_dir* containing an ``__init__`` file with *init_source* as its contents.
pt_pt: Cria um diretório chamado *pkg_dir* contendo um ficheiro ``__init__`` com *init_source* como o seu conteúdo.
ru: Создайте каталог с именем *pkg_dir*, содержащий файл ``__init__`` с содержимым *init_source*.

source: Create a zip package directory with a path of *zip_dir* and *zip_basename* containing an empty ``__init__`` file and a file *script_basename* containing the *source*. If *compiled* is ``True``, both source files will be compiled and added to the zip package. Return a tuple of the full zip path and the archive name for the zip file.
pt_pt: Cria um diretório de pacote zip com um caminho de *zip_dir* e *zip_basename* contendo um ficheiro ``__init__`` vazio e um ficheiro *script_basename* contendo o *source*. Se *compiled* for ``True``, ambos os ficheiros de origem serão compilados e adicionados ao pacote zip. Devolve um tuplo do caminho completo do zip e do nome do arquivo para o ficheiro zip.
ru: Создайте каталог zip-пакета с путем *zip_dir* и *zip_basename*, содержащий пустой файл ``__init__`` и файл *script_basename*, содержащий *source*. Если *compiled* имеет значение True, оба исходных файла будут скомпилированы и добавлены в zip-пакет. Возвращает кортеж полного пути к zip-архиву и имени архива для zip-файла.

source: :mod:`test.support.bytecode_helper` --- Support tools for testing correct bytecode generation
pt_pt: :mod:`test.support.bytecode_helper` --- Ferramentas de suporte para testar a geração correta de bytecode
ru: :mod:`test.support.bytecode_helper` --- Инструменты поддержки для проверки правильной генерации байт-кода.

source: The :mod:`test.support.bytecode_helper` module provides support for testing and inspecting bytecode generation.
pt_pt: O módulo :mod:`test.support.bytecode_helper` fornece suporte para testar e inspecionar a geração de bytecode.
ru: Модуль :mod:`test.support.bytecode_helper` обеспечивает поддержку тестирования и проверки генерации байт-кода.

source: The module defines the following class:
pt_pt: O módulo define a seguinte classe:
ru: Модуль определяет следующий класс:

source: This class has custom assertion methods for inspecting bytecode.
pt_pt: Esta classe tem métodos de afirmação personalizados para inspecionar bytecode.
ru: Этот класс имеет собственные методы проверки для проверки байт-кода.

source: Return the disassembly of *co* as string.
pt_pt: Devolve a desmontagem de *co* como string.
ru: Верните дизассемблированный код *co* в виде строки.

source: Return instr if *opname* is found, otherwise throws :exc:`AssertionError`.
pt_pt: Devolve instr se *opname* for encontrado, caso contrário levanta :exc:`AssertionError`.
ru: Возвращает instr, если найдено *opname*, в противном случае выдается :exc:`AssertionError`.

source: Throws :exc:`AssertionError` if *opname* is found.
pt_pt: Levanta :exc:`AssertionError` se *opname* for encontrado.
ru: Выдает :exc:`AssertionError`, если найдено *opname*.

source: :mod:`test.support.threading_helper` --- Utilities for threading tests
pt_pt: :mod:`test.support.threading_helper` --- Utilitários para testes de threading
ru: :mod:`test.support.threading_helper` --- Утилиты для многопоточных тестов

source: The :mod:`test.support.threading_helper` module provides support for threading tests.
pt_pt: O módulo :mod:`test.support.threading_helper` fornece suporte para testes de threading.
ru: Модуль :mod:`test.support.threading_helper` обеспечивает поддержку потоковых тестов.

source: Join a *thread* within *timeout*. Raise an :exc:`AssertionError` if thread is still alive after *timeout* seconds.
pt_pt: Une uma *thread* dentro de *timeout*. Levanta um :exc:`AssertionError` se a thread ainda estiver viva após *timeout* segundos.
ru: Присоединяйтесь к *теме* в течение *таймаута*. Вызовите :exc:`AssertionError`, если поток все еще активен после *timeout* секунд.

source: Decorator to ensure the threads are cleaned up even if the test fails.
pt_pt: Decorador para garantir que as threads são limpas mesmo se o teste falhar.
ru: Декоратор, обеспечивающий очистку потоков, даже если тест не пройден.

source: Context manager to start *threads*, which is a sequence of threads. *unlock* is a function called after the threads are started, even if an exception was raised; an example would be :meth:`threading.Event.set`. ``start_threads`` will attempt to join the started threads upon exit.
pt_pt: Gestor de contexto para iniciar *threads*, que é uma sequência de threads. *unlock* é uma função chamada após as threads serem iniciadas, mesmo que uma exceção tenha sido levantada; um exemplo seria :meth:`threading.Event.set`. ``start_threads`` tentará unir as threads iniciadas na saída.
ru: Контекстный менеджер для запуска *threads*, который представляет собой последовательность потоков. *unlock* — функция, вызываемая после запуска потоков, даже если возникло исключение; примером может быть :meth:`threading.Event.set`. ``start_threads`` попытается присоединиться к запущенным потокам после выхода.

source: Cleanup up threads not specified in *original_values*. Designed to emit a warning if a test leaves running threads in the background.
pt_pt: Limpa threads não especificadas em *original_values*. Concebido para emitir um aviso se um teste deixar threads em execução em segundo plano.
ru: Очистка потоков, не указанных в *original_values*. Предназначен для выдачи предупреждения, если тест оставляет работающие потоки в фоновом режиме.

source: Return current thread count and copy of dangling threads.
pt_pt: Devolve a contagem atual de threads e uma cópia das threads pendentes.
ru: Возвращает текущее количество потоков и копию висящих потоков.

source: Context manager to wait until all threads created in the ``with`` statement exit.
pt_pt: Gestor de contexto para esperar até que todas as threads criadas na instrução ``with`` terminem.
ru: Менеджер контекста будет ждать, пока все потоки, созданные в операторе ``with``, завершатся.

source: Context manager catching :class:`threading.Thread` exception using :func:`threading.excepthook`.
pt_pt: Gestor de contexto que captura exceções de :class:`threading.Thread` usando :func:`threading.excepthook`.
ru: Менеджер контекста перехватывает исключение :class:`threading.Thread` с помощью :func:`threading.excepthook`.

source: Attributes set when an exception is caught:
pt_pt: Atributos definidos quando uma exceção é capturada:
ru: Атрибуты, устанавливаемые при перехвате исключения:

source: See :func:`threading.excepthook` documentation.
pt_pt: Veja a documentação de :func:`threading.excepthook`.
ru: См. документацию :func:`threading.excepthook`.

source: These attributes are deleted at the context manager exit.
pt_pt: Estes atributos são eliminados na saída do gestor de contexto.
ru: Эти атрибуты удаляются при выходе из контекстного менеджера.

source: :mod:`test.support.os_helper` --- Utilities for os tests
pt_pt: :mod:`test.support.os_helper` --- Utilitários para testes de os
ru: :mod:`test.support.os_helper` --- Утилиты для os тестов

source: The :mod:`test.support.os_helper` module provides support for os tests.
pt_pt: O módulo :mod:`test.support.os_helper` fornece suporte para testes de os.
ru: Модуль :mod:`test.support.os_helper` обеспечивает поддержку os тестов.

source: A non-ASCII character encodable by :func:`os.fsencode`.
pt_pt: Um carácter não-ASCII codificável por :func:`os.fsencode`.
ru: Символ, отличный от ASCII, который можно закодировать с помощью :func:`os.fsencode`.

source: Set to :func:`os.getcwd`.
pt_pt: Definido para :func:`os.getcwd`.
ru: Устанавливает значение :func:`os.getcwd`.
