Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/test.po
Languages: pt_pt, ru

source: Test for syntax warning in *statement* by attempting to compile *statement*. Test also that the :exc:`SyntaxWarning` is emitted only once, and that it will be converted to a :exc:`SyntaxError` when turned into error. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the emitted :exc:`SyntaxWarning` and raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the warning and exception. If *offset* is not ``None``, compares to the offset of the exception.
pt_pt: Testa aviso de sintaxe em *statement* tentando compilar *statement*. Testa também se o :exc:`SyntaxWarning` é emitido apenas uma vez e se será convertido num :exc:`SyntaxError` quando transformado em erro. *testcase* é a instância :mod:`unittest` para o teste. *errtext* é a expressão regular que deve corresponder à representação em string do :exc:`SyntaxWarning` emitido e do :exc:`SyntaxError` levantado. Se *lineno* não for ``None``, compara com a linha do aviso e da exceção. Se *offset* não for ``None``, compara com o deslocamento da exceção.
ru: Проверьте синтаксическое предупреждение в *операторе*, попытавшись скомпилировать *оператор*. Проверьте также, что :exc:`SyntaxWarning` генерируется только один раз и что он будет преобразован в :exc:`SyntaxError`, когда он превратится в ошибку. *testcase* — это экземпляр :mod:`unittest` для теста. *errtext* — это регулярное выражение, которое должно соответствовать строковому представлению выданного :exc:`SyntaxWarning` и вызванного :exc:`SyntaxError`. Если *lineno* не ``None``, выполняется сравнение со строкой предупреждения и исключения. Если *offset* не ``None``, сравнивается со смещением исключения.

source: ``check_warnings`` accepts 2-tuples of the form ``("message regexp", WarningCategory)`` as positional arguments. If one or more *filters* are provided, or if the optional keyword argument *quiet* is ``False``, it checks to make sure the warnings are as expected: each specified filter must match at least one of the warnings raised by the enclosed code or the test fails, and if any warnings are raised that do not match any of the specified filters the test fails. To disable the first of these checks, set *quiet* to ``True``.
pt_pt: ``check_warnings`` aceita 2-tuplos da forma ``("message regexp", WarningCategory)`` como argumentos posicionais. Se um ou mais *filters* forem fornecidos, ou se o argumento nomeado opcional *quiet* for ``False``, verifica se os avisos são os esperados: cada filtro especificado deve corresponder a pelo menos um dos avisos levantados pelo código incluído ou o teste falha, e se forem levantados avisos que não correspondem a nenhum dos filtros especificados, o teste falha. Para desativar a primeira destas verificações, defina *quiet* como ``True``.
ru: ``check_warnings`` принимает 2 кортежа формы ``("регулярное выражение сообщения", WarningCategory)`` в качестве позиционных аргументов. Если предоставлен один или несколько *фильтров* или если необязательный аргумент ключевого слова *quiet* имеет значение «False», он проверяет, соответствуют ли предупреждения ожидаемому: каждый указанный фильтр должен соответствовать хотя бы одному из предупреждений, выдаваемых прилагаемый код или тест завершаются неудачно, и если выдаются какие-либо предупреждения, не соответствующие ни одному из указанных фильтров, тест завершается неудачей. Чтобы отключить первую из этих проверок, установите для *quiet* значение ``True``.

source: If no arguments are specified, it defaults to::
pt_pt: Se não forem especificados argumentos, o predefinido é::
ru: Если аргументы не указаны, по умолчанию используется::

source: In this case all warnings are caught and no errors are raised.
pt_pt: Neste caso, todos os avisos são capturados e não são levantados erros.
ru: В этом случае все предупреждения перехватываются и ошибок не возникает.

source: On entry to the context manager, a :class:`WarningRecorder` instance is returned. The underlying warnings list from :func:`~warnings.catch_warnings` is available via the recorder object's :attr:`warnings` attribute. As a convenience, the attributes of the object representing the most recent warning can also be accessed directly through the recorder object (see example below). If no warning has been raised, then any of the attributes that would otherwise be expected on an object representing a warning will return ``None``.
pt_pt: Na entrada do gestor de contexto, é devolvida uma instância de :class:`WarningRecorder`. A lista de avisos subjacente de :func:`~warnings.catch_warnings` está disponível através do atributo :attr:`warnings` do objeto gravador. Por conveniência, os atributos do objeto que representa o aviso mais recente também podem ser acedidos diretamente através do objeto gravador (veja o exemplo abaixo). Se nenhum aviso tiver sido levantado, então quaisquer dos atributos que seriam esperados num objeto que representa um aviso devolverão ``None``.
ru: При входе в контекстный менеджер возвращается экземпляр :class:`WarningRecorder`. Базовый список предупреждений из :func:`~warnings.catch_warnings` доступен через атрибут :attr:`warnings` объекта рекордера. Для удобства к атрибутам объекта, представляющего самое последнее предупреждение, также можно получить доступ непосредственно через объект рекордера (см. пример ниже). Если предупреждение не было выдано, то любой из атрибутов, которые в противном случае можно было бы ожидать от объекта, представляющего предупреждение, вернет None.

source: The recorder object also has a :meth:`reset` method, which clears the warnings list.
pt_pt: O objeto gravador também tem um método :meth:`reset`, que limpa a lista de avisos.
ru: Объект рекордера также имеет метод :meth:`reset`, который очищает список предупреждений.

source: The context manager is designed to be used like this::
pt_pt: O gestor de contexto é concebido para ser usado assim::
ru: Контекстный менеджер предназначен для использования следующим образом:

source: In this case if either warning was not raised, or some other warning was raised, :func:`check_warnings` would raise an error.
pt_pt: Neste caso, se algum dos avisos não for levantado, ou se algum outro aviso for levantado, :func:`check_warnings` levantaria um erro.
ru: В этом случае, если какое-либо предупреждение не было выдано, или было выдано какое-то другое предупреждение, :func:`check_warnings` выдаст ошибку.

source: When a test needs to look more deeply into the warnings, rather than just checking whether or not they occurred, code like this can be used::
pt_pt: Quando um teste precisa de examinar mais profundamente os avisos, em vez de apenas verificar se ocorreram ou não, pode ser usado código como este::
ru: Когда тесту необходимо более глубоко изучить предупреждения, а не просто проверить, возникли ли они или нет, можно использовать такой код:

source: Here all warnings will be caught, and the test code tests the captured warnings directly.
pt_pt: Aqui, todos os avisos serão capturados, e o código de teste testa os avisos capturados diretamente.
ru: Здесь будут перехвачены все предупреждения, и тестовый код напрямую проверяет захваченные предупреждения.

source: New optional arguments *filters* and *quiet*.
pt_pt: Novos argumentos opcionais *filters* e *quiet*.
ru: Новые необязательные аргументы *filters* и *quiet*.

source: Class used to record warnings for unit tests. See documentation of :func:`check_warnings` above for more details.
ru: Класс, используемый для записи предупреждений для модульных тестов. Дополнительную информацию см. в документации по :func:`check_warnings` выше.

source: If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, it issues only a warning and keeps the current working directory the same.
pt_pt: Se *quiet* for ``False``, o gestor de contexto levanta uma exceção em caso de erro. Caso contrário, emite apenas um aviso e mantém o diretório de trabalho atual inalterado.
