Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/test.po
Languages: pt_pt, ru

source: For testcase *test*, assert that the ``sys.getsizeof`` for *o* plus the GC header size equals *size*.
pt_pt: Para o caso de teste *test*, afirma que o ``sys.getsizeof`` para *o* mais o tamanho do cabeçalho do GC é igual a *size*.
ru: Для тестового примера *test* убедитесь, что ``sys.getsizeof`` для *o* плюс размер заголовка GC равен *size*.

source: A decorator to conditionally mark tests with :func:`unittest.expectedFailure`. Any use of this decorator should have an associated comment identifying the relevant tracker issue.
pt_pt: Um decorador para marcar condicionalmente testes com :func:`unittest.expectedFailure`. Qualquer uso deste decorador deve ter um comentário associado que identifique a questão relevante no rastreador.
ru: Декоратор для условной маркировки тестов с помощью :func:`unittest.expectedFailure`. Любое использование этого декоратора должно сопровождаться соответствующим комментарием, указывающим соответствующую проблему трекера.

source: A decorator that skips the decorated test on TLS certification validation failures.
pt_pt: Um decorador que ignora o teste decorado em falhas de validação de certificação TLS.
ru: Декоратор, который пропускает оформленный тест при неудачной проверке сертификации TLS.

source: A decorator for running a function in a different locale, correctly resetting it after it has finished. *catstr* is the locale category as a string (for example ``"LC_ALL"``). The *locales* passed will be tried sequentially, and the first valid locale will be used.
pt_pt: Um decorador para executar uma função numa localidade diferente, redefinindo-a corretamente após a sua conclusão. *catstr* é a categoria de localidade como uma string (por exemplo, ``"LC_ALL"``). As *locales* passadas serão tentadas sequencialmente, e a primeira localidade válida será usada.
ru: Декоратор для запуска функции в другой локали, корректно сбрасывающий ее после завершения. *catstr* — это категория локали в виде строки (например, ``"LC_ALL"``). Передаваемые *локали* будут проверены последовательно, и будет использована первая допустимая локаль.

source: A decorator for running a function in a specific timezone, correctly resetting it after it has finished.
pt_pt: Um decorador para executar uma função num fuso horário específico, redefinindo-o corretamente após a sua conclusão.
ru: Декоратор для запуска функции в определенном часовом поясе, корректно сбрасывающий ее после завершения.

source: Decorator for the minimum version when running test on FreeBSD. If the FreeBSD version is less than the minimum, the test is skipped.
pt_pt: Decorador para a versão mínima ao executar testes no FreeBSD. Se a versão do FreeBSD for inferior à mínima, o teste é ignorado.
ru: Декоратор минимальной версии при запуске теста на FreeBSD. Если версия FreeBSD меньше минимальной, тест пропускается.

source: Decorator for the minimum version when running test on Linux. If the Linux version is less than the minimum, the test is skipped.
pt_pt: Decorador para a versão mínima ao executar testes no Linux. Se a versão do Linux for inferior à mínima, o teste é ignorado.
ru: Декоратор для минимальной версии при запуске теста в Linux. Если версия Linux меньше минимальной, тест пропускается.

source: Decorator for the minimum version when running test on macOS. If the macOS version is less than the minimum, the test is skipped.
pt_pt: Decorador para a versão mínima ao executar testes no macOS. Se a versão do macOS for inferior à mínima, o teste é ignorado.
ru: Декоратор для минимальной версии при запуске теста на macOS. Если версия macOS меньше минимальной, тест пропускается.

source: Decorator for skipping tests on non-IEEE 754 platforms.
pt_pt: Decorador para ignorar testes em plataformas não-IEEE 754.
ru: Декоратор для пропуска тестов на платформах, отличных от IEEE 754.

source: Decorator for skipping tests if :mod:`zlib` doesn't exist.
pt_pt: Decorador para ignorar testes se :mod:`zlib` não existir.
ru: Декоратор для пропуска тестов, если :mod:`zlib` не существует.

source: Decorator for skipping tests if :mod:`gzip` doesn't exist.
pt_pt: Decorador para ignorar testes se :mod:`gzip` não existir.
ru: Декоратор для пропуска тестов, если :mod:`gzip` не существует.

source: Decorator for skipping tests if :mod:`bz2` doesn't exist.
pt_pt: Decorador para ignorar testes se :mod:`bz2` não existir.
ru: Декоратор для пропуска тестов, если :mod:`bz2` не существует.

source: Decorator for skipping tests if :mod:`lzma` doesn't exist.
pt_pt: Decorador para ignorar testes se :mod:`lzma` não existir.
ru: Декоратор для пропуска тестов, если :mod:`lzma` не существует.

source: Decorator for skipping tests if *resource* is not available.
pt_pt: Decorador para ignorar testes se *resource* não estiver disponível.
ru: Декоратор для пропуска тестов, если *ресурс* недоступен.

source: Decorator for only running the test if :data:`HAVE_DOCSTRINGS`.
pt_pt: Decorador para executar o teste apenas se :data:`HAVE_DOCSTRINGS`.
ru: Декоратор для запуска теста только в том случае, если :data:`HAVE_DOCSTRINGS`.

source: Decorator for tests only applicable to CPython.
pt_pt: Decorador para testes aplicáveis apenas ao CPython.
ru: Декоратор для тестов, применимый только к CPython.

source: Decorator for invoking :func:`check_impl_detail` on *guards*. If that returns ``False``, then uses *msg* as the reason for skipping the test.
pt_pt: Decorador para invocar :func:`check_impl_detail` em *guards*. Se isso devolver ``False``, então usa *msg* como a razão para ignorar o teste.
ru: Декоратор для вызова :func:`check_impl_detail` на *guards*. Если возвращается значение «False», то в качестве причины пропуска теста используется *msg*.

source: Decorator to temporarily turn off tracing for the duration of the test.
pt_pt: Decorador para desativar temporariamente a rastreabilidade durante a duração do teste.
ru: Декоратор для временного отключения трассировки на время теста.

source: Decorator for tests which involve reference counting. The decorator does not run the test if it is not run by CPython. Any trace function is unset for the duration of the test to prevent unexpected refcounts caused by the trace function.
pt_pt: Decorador para testes que envolvem contagem de referências. O decorador não executa o teste se não for executado pelo CPython. Qualquer função de rastreio é desativada durante a duração do teste para evitar contagens de referência inesperadas causadas pela função de rastreio.
ru: Декоратор для тестов, включающих подсчет ссылок. Декоратор не запускает тест, если он не запущен CPython. Любая функция трассировки отключается на время теста, чтобы предотвратить неожиданные подсчеты ссылок, вызванные функцией трассировки.

source: Decorator for bigmem tests.
pt_pt: Decorador para testes de bigmem.
ru: Декоратор для тестов bigmem.

source: *size* is a requested size for the test (in arbitrary, test-interpreted units.) *memuse* is the number of bytes per unit for the test, or a good estimate of it. For example, a test that needs two byte buffers, of 4 GiB each, could be decorated with ``@bigmemtest(size=_4G, memuse=2)``.
pt_pt: *size* é um tamanho solicitado para o teste (em unidades arbitrárias, interpretadas pelo teste). *memuse* é o número de bytes por unidade para o teste, ou uma boa estimativa disso. Por exemplo, um teste que necessita de dois buffers de bytes, de 4 GiB cada, poderia ser decorado com ``@bigmemtest(size=_4G, memuse=2)``.
ru: *size* — запрошенный размер теста (в произвольных единицах, интерпретируемых тестом). *memuse* — количество байтов на единицу теста или его приблизительная оценка. Например, тест, которому требуются два байтовых буфера по 4 ГиБ каждый, может быть украшен @bigmemtest(size=_4G, memuse=2)``.

source: The *size* argument is normally passed to the decorated test method as an extra argument. If *dry_run* is ``True``, the value passed to the test method may be less than the requested value. If *dry_run* is ``False``, it means the test doesn't support dummy runs when ``-M`` is not specified.
pt_pt: O argumento *size* é normalmente passado para o método de teste decorado como um argumento extra. Se *dry_run* for ``True``, o valor passado para o método de teste pode ser menor do que o valor solicitado. Se *dry_run* for ``False``, significa que o teste não suporta execuções fictícias quando ``-M`` não for especificado.
ru: Аргумент *size* обычно передается декорированному тестовому методу в качестве дополнительного аргумента. Если *dry_run* имеет значение True, значение, передаваемое тестовому методу, может быть меньше запрошенного значения. Если *dry_run* имеет значение «False», это означает, что тест не поддерживает фиктивные прогоны, если не указан «-M».

source: Decorator for tests that fill the address space.
pt_pt: Decorador para testes que preenchem o espaço de endereçamento.
ru: Декоратор для тестов, заполняющих адресное пространство.

source: Test for syntax errors in *statement* by attempting to compile *statement*. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the exception. If *offset* is not ``None``, compares to the offset of the exception.
pt_pt: Testa erros de sintaxe em *statement* tentando compilar *statement*. *testcase* é a instância :mod:`unittest` para o teste. *errtext* é a expressão regular que deve corresponder à representação em string do :exc:`SyntaxError` levantado. Se *lineno* não for ``None``, compara com a linha da exceção. Se *offset* não for ``None``, compara com o deslocamento da exceção.
ru: Проверьте наличие синтаксических ошибок в *операторе*, попытавшись скомпилировать *оператор*. *testcase* — это экземпляр :mod:`unittest` для теста. *errtext* — это регулярное выражение, которое должно соответствовать строковому представлению возникшей :exc:`SyntaxError`. Если *lineno* не ``None``, выполняется сравнение со строкой исключения. Если *offset* не ``None``, сравнивается со смещением исключения.

source: Open *url*. If open fails, raises :exc:`TestFailed`.
pt_pt: Abre *url*. Se a abertura falhar, levanta :exc:`TestFailed`.
ru: Откройте *URL*. Если открытие не удалось, вызывает :exc:`TestFailed`.

source: Use this at the end of ``test_main`` whenever sub-processes are started. This will help ensure that no extra children (zombies) stick around to hog resources and create problems when looking for refleaks.
pt_pt: Use isto no final de ``test_main`` sempre que subprocessos sejam iniciados. Isto ajudará a garantir que não fiquem processos filhos extra (zombies) a ocupar recursos e a criar problemas ao procurar por refleaks.
ru: Используйте это в конце test_main всякий раз, когда запускаются подпроцессы. Это поможет гарантировать, что никакие дополнительные дети (зомби) не будут занимать ресурсы и создавать проблемы при поиске утечек.

source: Get an attribute, raising :exc:`unittest.SkipTest` if :exc:`AttributeError` is raised.
pt_pt: Obtém um atributo, levantando :exc:`unittest.SkipTest` se :exc:`AttributeError` for levantado.
ru: Получите атрибут, вызвав :exc:`unittest.SkipTest`, если :exc:`AttributeError` поднят.

source: Context manager catching unraisable exception using :func:`sys.unraisablehook`.
pt_pt: Gestor de contexto que captura exceções não levantáveis usando :func:`sys.unraisablehook`.
ru: Менеджер контекста перехватывает невозможные исключения с помощью :func:`sys.unraisablehook`.

source: Storing the exception value (``cm.unraisable.exc_value``) creates a reference cycle. The reference cycle is broken explicitly when the context manager exits.
pt_pt: Armazenar o valor da exceção (``cm.unraisable.exc_value``) cria um ciclo de referência. O ciclo de referência é quebrado explicitamente quando o gestor de contexto sai.
ru: Сохранение значения исключения (``cm.unraisable.exc_value``) создает ссылочный цикл. Ссылочный цикл явно прерывается при выходе из контекстного менеджера.

source: Storing the object (``cm.unraisable.object``) can resurrect it if it is set to an object which is being finalized. Exiting the context manager clears the stored object.
pt_pt: Armazenar o objeto (``cm.unraisable.object``) pode ressuscitá-lo se for definido para um objeto que está a ser finalizado. Sair do gestor de contexto limpa o objeto armazenado.
ru: Сохранение объекта (``cm.unraisable.object``) может воскресить его, если ему присвоен объект, который находится в стадии финализации. Выход из контекстного менеджера очищает сохраненный объект.

source: Generic implementation of the :mod:`unittest` ``load_tests`` protocol for use in test packages. *pkg_dir* is the root directory of the package; *loader*, *standard_tests*, and *pattern* are the arguments expected by ``load_tests``. In simple cases, the test package's ``__init__.py`` can be the following::
pt_pt: Implementação genérica do protocolo ``load_tests`` do :mod:`unittest` para uso em pacotes de teste. *pkg_dir* é o diretório raiz do pacote; *loader*, *standard_tests* e *pattern* são os argumentos esperados por ``load_tests``. Em casos simples, o ``__init__.py`` do pacote de teste pode ser o seguinte::
ru: Общая реализация протокола :mod:`unittest` ``load_tests`` для использования в тестовых пакетах. *pkg_dir* — корневой каталог пакета; *loader*, *standard_tests* и *pattern* — это аргументы, ожидаемые ``load_tests``. В простых случаях ``__init__.py`` тестового пакета может быть следующим:

source: Returns the set of attributes, functions or methods of *ref_api* not found on *other_api*, except for a defined list of items to be ignored in this check specified in *ignore*.
pt_pt: Devolve o conjunto de atributos, funções ou métodos de *ref_api* não encontrados em *other_api*, exceto para uma lista definida de itens a serem ignorados nesta verificação, especificada em *ignore*.
ru: Возвращает набор атрибутов, функций или методов *ref_api*, не найденных в *other_api*, за исключением определенного списка элементов, которые следует игнорировать в этой проверке, указанного в *ignore*.

source: By default this skips private attributes beginning with '_' but includes all magic methods, i.e. those starting and ending in '__'.
pt_pt: Por predefinição, isto ignora atributos privados que começam com '_', mas inclui todos os métodos mágicos, ou seja, aqueles que começam e terminam com '__'.
ru: По умолчанию это пропускает частные атрибуты, начинающиеся с «_», но включает все магические методы, то есть те, которые начинаются и заканчиваются на «__».

source: Override *object_to_patch.attr_name* with *new_value*. Also add cleanup procedure to *test_instance* to restore *object_to_patch* for *attr_name*. The *attr_name* should be a valid attribute for *object_to_patch*.
pt_pt: Substitui *object_to_patch.attr_name* por *new_value*. Também adiciona um procedimento de limpeza a *test_instance* para restaurar *object_to_patch* para *attr_name*. O *attr_name* deve ser um atributo válido para *object_to_patch*.
ru: Переопределить *object_to_patch.attr_name* с помощью *new_value*. Также добавьте процедуру очистки в *test_instance*, чтобы восстановить *object_to_patch* для *attr_name*. *attr_name* должен быть допустимым атрибутом для *object_to_patch*.

source: Run *code* in subinterpreter. Raise :exc:`unittest.SkipTest` if :mod:`tracemalloc` is enabled.
pt_pt: Executa *code* num subinterpretador. Levanta :exc:`unittest.SkipTest` se :mod:`tracemalloc` estiver ativado.
ru: Запустите *код* в субинтерпретаторе. Поднимите :exc:`unittest.SkipTest`, если :mod:`tracemalloc` включен.

source: Assert instances of *cls* are deallocated after iterating.
pt_pt: Afirma que as instâncias de *cls* são desalocadas após a iteração.
ru: Экземпляры утверждений *cls* освобождаются после итерации.

source: Check for the existence of the compiler executables whose names are listed in *cmd_names* or all the compiler executables when *cmd_names* is empty and return the first missing executable or ``None`` when none is found missing.
pt_pt: Verifica a existência dos executáveis do compilador cujos nomes estão listados em *cmd_names* ou todos os executáveis do compilador quando *cmd_names* está vazio e devolve o primeiro executável em falta ou ``None`` quando nenhum for encontrado em falta.
ru: Проверьте наличие исполняемых файлов компилятора, имена которых указаны в *cmd_names*, или всех исполняемых файлов компилятора, если *cmd_names* пусто, и верните первый отсутствующий исполняемый файл или ``None``, если ни один из них не найден.

source: Assert that the ``__all__`` variable of *module* contains all public names.
pt_pt: Afirma que a variável ``__all__`` de *module* contém todos os nomes públicos.
ru: Убедитесь, что переменная ``__all__`` *module* содержит все общедоступные имена.

source: The module's public names (its API) are detected automatically based on whether they match the public name convention and were defined in *module*.
pt_pt: Os nomes públicos do módulo (a sua API) são detetados automaticamente com base em se correspondem à convenção de nomes públicos e foram definidos em *module*.
ru: Публичные имена модуля (его API) определяются автоматически на основе того, соответствуют ли они соглашению об общедоступных именах и определены в *module*.

source: The *name_of_module* argument can specify (as a string or tuple thereof) what module(s) an API could be defined in order to be detected as a public API. One case for this is when *module* imports part of its public API from other modules, possibly a C backend (like ``csv`` and its ``_csv``).
pt_pt: O argumento *name_of_module* pode especificar (como uma string ou tuplo) quais módulos uma API pode ser definida para ser detetada como uma API pública. Um caso para isto é quando *module* importa parte da sua API pública de outros módulos, possivelmente um backend C (como ``csv`` e o seu ``_csv``).
ru: Аргумент *name_of_module* может указывать (в виде строки или кортежа), какой модуль(ы) API может быть определен, чтобы его можно было определить как общедоступный API. Одним из случаев этого является то, что *module* импортирует часть своего общедоступного API из других модулей, возможно, из бэкэнда C (например, «csv» и его «_csv»).

source: The *not_exported* argument can be a set of names that must not be treated as part of the public API even though their names indicate otherwise.
pt_pt: O argumento *not_exported* pode ser um conjunto de nomes que não devem ser tratados como parte da API pública, mesmo que os seus nomes indiquem o contrário.
ru: Аргумент *not_exported* может представлять собой набор имен, которые не следует рассматривать как часть общедоступного API, даже если их имена указывают на иное.

source: Example use::
pt_pt: Exemplo de uso::
ru: Пример использования::

source: Skip tests if the :mod:`multiprocessing.synchronize` module is missing, if there is no available semaphore implementation, or if creating a lock raises an :exc:`OSError`.
pt_pt: Ignora testes se o módulo :mod:`multiprocessing.synchronize` estiver em falta, se não houver implementação de semáforo disponível, ou se a criação de um bloqueio levantar um :exc:`OSError`.
ru: Пропускать тесты, если модуль :mod:`multiprocessing.synchronize` отсутствует, если нет доступной реализации семафора или если создание блокировки вызывает :exc:`OSError`.

source: Assert that type *tp* cannot be instantiated using *args* and *kwds*.
pt_pt: Afirma que o tipo *tp* não pode ser instanciado usando *args* e *kwds*.
ru: Утвердите, что тип *tp* не может быть создан с помощью *args* и *kwds*.

source: This function returns a context manager that will change the global :func:`sys.set_int_max_str_digits` setting for the duration of the context to allow execution of test code that needs a different limit on the number of digits when converting between an integer and string.
pt_pt: Esta função devolve um gestor de contexto que alterará a configuração global :func:`sys.set_int_max_str_digits` durante a duração do contexto para permitir a execução de código de teste que necessita de um limite diferente no número de dígitos ao converter entre um inteiro e uma string.
ru: Эта функция возвращает диспетчер контекста, который изменит глобальную настройку :func:`sys.set_int_max_str_digits` на время контекста, чтобы разрешить выполнение тестового кода, которому требуется другой предел количества цифр при преобразовании между целым числом и строкой.

source: The :mod:`test.support` module defines the following classes:
pt_pt: O módulo :mod:`test.support` define as seguintes classes:
ru: Модуль :mod:`test.support` определяет следующие классы:

source: A context manager used to try to prevent crash dialog popups on tests that are expected to crash a subprocess.
pt_pt: Um gestor de contexto usado para tentar prevenir a abertura de diálogos de falha em testes que se espera que façam falhar um subprocesso.
ru: Менеджер контекста, используемый для предотвращения всплывающих окон с диалогами о сбое в тестах, которые, как ожидается, приведут к сбою подпроцесса.

source: On Windows, it disables Windows Error Reporting dialogs using `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.
pt_pt: No Windows, desativa os diálogos de Relatório de Erros do Windows usando `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.
ru: В Windows он отключает диалоговые окна отчетов об ошибках Windows с помощью `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.

source: On UNIX, :func:`resource.setrlimit` is used to set :const:`resource.RLIMIT_CORE`'s soft limit to 0 to prevent coredump file creation.
ru: В UNIX :func:`resource.setrlimit` используется для установки мягкого ограничения :const:`resource.RLIMIT_CORE` на 0, чтобы предотвратить создание файла дампа памяти.

source: On both platforms, the old value is restored by :meth:`~object.__exit__`.
ru: На обеих платформах старое значение восстанавливается с помощью :meth:`~object.__exit__`.

source: Class to save and restore signal handlers registered by the Python signal handler.
pt_pt: Classe para guardar e restaurar os manipuladores de sinal registados pelo manipulador de sinal do Python.
ru: Класс для сохранения и восстановления обработчиков сигналов, зарегистрированных обработчиком сигналов Python.

source: Save the signal handlers to a dictionary mapping signal numbers to the current signal handler.
pt_pt: Guarda os manipuladores de sinal num dicionário que mapeia números de sinal para o manipulador de sinal atual.
ru: Сохраните обработчики сигналов в словарь, сопоставляющий номера сигналов с текущим обработчиком сигналов.

source: Set the signal numbers from the :meth:`save` dictionary to the saved handler.
pt_pt: Define os números de sinal do dicionário :meth:`save` para o manipulador guardado.
ru: Установите номера сигналов из словаря :meth:`save` для сохраненного обработчика.

source: Try to match a single dict with the supplied arguments.
pt_pt: Tenta corresponder um único dicionário com os argumentos fornecidos.
ru: Попробуйте сопоставить один словарь с предоставленными аргументами.

source: Try to match a single stored value (*dv*) with a supplied value (*v*).
pt_pt: Tenta corresponder um único valor armazenado (*dv*) com um valor fornecido (*v*).
ru: Попробуйте сопоставить одно сохраненное значение (*dv*) с предоставленным значением (*v*).

source: :mod:`test.support.socket_helper` --- Utilities for socket tests
pt_pt: :mod:`test.support.socket_helper` --- Utilitários para testes de socket
ru: :mod:`test.support.socket_helper` --- Утилиты для тестов сокетов
