Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/test.po
Languages: pt_pt, ru

source: Set to a name that is safe to use as the name of a temporary file. Any temporary file that is created should be closed and unlinked (removed).
pt_pt: Definido para um nome que é seguro usar como nome de um ficheiro temporário. Qualquer ficheiro temporário que seja criado deve ser fechado e desligado (removido).
ru: Установите имя, которое можно безопасно использовать в качестве имени временного файла. Любой созданный временный файл следует закрыть и отсоединить (удалить).

source: Set to a filename containing the :data:`FS_NONASCII` character, if it exists. This guarantees that if the filename exists, it can be encoded and decoded with the default filesystem encoding. This allows tests that require a non-ASCII filename to be easily skipped on platforms where they can't work.
pt_pt: Definido para um nome de ficheiro contendo o carácter :data:`FS_NONASCII`, se existir. Isto garante que, se o nome do ficheiro existir, pode ser codificado e decodificado com a codificação de sistema de ficheiros predefinida. Isto permite que os testes que requerem um nome de ficheiro não-ASCII sejam facilmente ignorados em plataformas onde não podem funcionar.
ru: Установите имя файла, содержащее символ :data:`FS_NONASCII`, если он существует. Это гарантирует, что если имя файла существует, его можно закодировать и декодировать с использованием кодировки файловой системы по умолчанию. Это позволяет легко пропускать тесты, требующие имени файла, отличного от ASCII, на платформах, где они не могут работать.

source: Set to a filename (str type) that should not be able to be encoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
pt_pt: Definido para um nome de ficheiro (tipo str) que não deve ser capaz de ser codificado pela codificação do sistema de ficheiros em modo estrito. Pode ser ``None`` se não for possível gerar tal nome de ficheiro.
ru: Установите имя файла (тип str), которое не должно быть закодировано с помощью кодирования файловой системы в строгом режиме. Это может быть ``None``, если невозможно сгенерировать такое имя файла.

source: Set to a filename (bytes type) that should not be able to be decoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
pt_pt: Definido para um nome de ficheiro (tipo bytes) que não deve ser capaz de ser decodificado pela codificação do sistema de ficheiros em modo estrito. Pode ser ``None`` se não for possível gerar tal nome de ficheiro.
ru: Установите имя файла (тип байтов), которое не должно быть декодировано с помощью кодирования файловой системы в строгом режиме. Это может быть ``None``, если невозможно сгенерировать такое имя файла.

source: Set to a non-ASCII name for a temporary file.
pt_pt: Definido para um nome não-ASCII para um ficheiro temporário.
ru: Установите имя, отличное от ASCII, для временного файла.

source: Class used to temporarily set or unset environment variables. Instances can be used as a context manager and have a complete dictionary interface for querying/modifying the underlying ``os.environ``. After exit from the context manager all changes to environment variables done through this instance will be rolled back.
pt_pt: Classe usada para definir ou desdefinir temporariamente variáveis de ambiente. As instâncias podem ser usadas como um gestor de contexto e têm uma interface de dicionário completa para consultar/modificar o ``os.environ`` subjacente. Após a saída do gestor de contexto, todas as alterações às variáveis de ambiente feitas através desta instância serão revertidas.
ru: Класс, используемый для временной установки или отключения переменных среды. Экземпляры могут использоваться в качестве менеджера контекста и иметь полный словарный интерфейс для запроса/изменения базового ``os.environ``. После выхода из контекстного менеджера все изменения переменных среды, выполненные через этот экземпляр, будут отменены.

source: Added dictionary interface.
pt_pt: Adicionada interface de dicionário.
ru: Добавлен интерфейс словаря.

source: Simple :term:`path-like object`. It implements the :meth:`~os.PathLike.__fspath__` method which just returns the *path* argument. If *path* is an exception, it will be raised in :meth:`!__fspath__`.
ru: Простой :term:`объект, похожий на путь`. Он реализует метод :meth:`~os.PathLike.__fspath__`, который просто возвращает аргумент *path*. Если *path* является исключением, оно будет создано в :meth:`!__fspath__`.

source: Temporarily set the environment variable ``envvar`` to the value of ``value``.
pt_pt: Define temporariamente a variável de ambiente ``envvar`` para o valor de ``value``.
ru: Временно установите для переменной среды envvar значение value.

source: Temporarily unset the environment variable ``envvar``.
ru: Временно отключите переменную среды envvar.

source: Return ``True`` if the OS supports symbolic links, ``False`` otherwise.
pt_pt: Devolve ``True`` se o SO suportar ligações simbólicas, ``False`` caso contrário.
ru: Возвращайте True, если ОС поддерживает символические ссылки, в противном случае — False.

source: Return ``True`` if the OS supports xattr, ``False`` otherwise.
pt_pt: Devolve ``True`` se o SO suportar xattr, ``False`` caso contrário.
ru: Верните True, если ОС поддерживает xattr, в противном случае — False.

source: A context manager that temporarily changes the current working directory to *path* and yields the directory.
pt_pt: Um gestor de contexto que altera temporariamente o diretório de trabalho atual para *path* e devolve o diretório.
ru: Менеджер контекста, который временно изменяет текущий рабочий каталог на *path* и возвращает этот каталог.

source: Create an empty file with *filename*. If it already exists, truncate it.
pt_pt: Cria um ficheiro vazio com *filename*. Se já existir, trunca-o.
ru: Создайте пустой файл с именем *имя_файла*. Если он уже существует, обрежьте его.

source: Count the number of open file descriptors.
pt_pt: Conta o número de descritores de ficheiros abertos.
ru: Подсчитайте количество открытых файловых дескрипторов.

source: Return ``True`` if the file system for *directory* is case-insensitive.
pt_pt: Devolve ``True`` se o sistema de ficheiros para *directory* for insensível a maiúsculas e minúsculas.
ru: Верните ``True``, если файловая система для *directory* нечувствительна к регистру.

source: Create an invalid file descriptor by opening and closing a temporary file, and returning its descriptor.
pt_pt: Cria um descritor de ficheiro inválido abrindo e fechando um ficheiro temporário e devolvendo o seu descritor.
ru: Создайте недопустимый дескриптор файла, открыв и закрыв временный файл и вернув его дескриптор.

source: Call :func:`os.rmdir` on *filename*. On Windows platforms, this is wrapped with a wait loop that checks for the existence of the file, which is needed due to antivirus programs that can hold files open and prevent deletion.
pt_pt: Chama :func:`os.rmdir` em *filename*. Nas plataformas Windows, isto é encapsulado num ciclo de espera que verifica a existência do ficheiro, o que é necessário devido a programas antivírus que podem manter ficheiros abertos e impedir a eliminação.
ru: Вызовите :func:`os.rmdir` в *имя_файла*. На платформах Windows это сопровождается циклом ожидания, проверяющим существование файла, что необходимо для антивирусных программ, которые могут удерживать файлы открытыми и предотвращать удаление.

source: Call :func:`shutil.rmtree` on *path* or call :func:`os.lstat` and :func:`os.rmdir` to remove a path and its contents. As with :func:`rmdir`, on Windows platforms this is wrapped with a wait loop that checks for the existence of the files.
pt_pt: Chama :func:`shutil.rmtree` em *path* ou chama :func:`os.lstat` e :func:`os.rmdir` para remover um caminho e o seu conteúdo. Tal como com :func:`rmdir`, nas plataformas Windows isto é encapsulado num ciclo de espera que verifica a existência dos ficheiros.
ru: Вызовите :func:`shutil.rmtree` для *path* или вызовите :func:`os.lstat` и :func:`os.rmdir`, чтобы удалить путь и его содержимое. Как и в случае с :func:`rmdir`, на платформах Windows это завершается циклом ожидания, проверяющим существование файлов.

source: A decorator for running tests that require support for symbolic links.
pt_pt: Um decorador para executar testes que requerem suporte para ligações simbólicas.
ru: Декоратор для запуска тестов, требующих поддержки символических ссылок.

source: A decorator for running tests that require support for xattr.
pt_pt: Um decorador para executar testes que requerem suporte para xattr.
ru: Декоратор для запуска тестов, требующих поддержки xattr.

source: A context manager that temporarily creates a new directory and changes the current working directory (CWD).
pt_pt: Um gestor de contexto que cria temporariamente um novo diretório e altera o diretório de trabalho atual (CWD).
ru: Менеджер контекста, который временно создает новый каталог и изменяет текущий рабочий каталог (CWD).

source: The context manager creates a temporary directory in the current directory with name *name* before temporarily changing the current working directory. If *name* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`.
pt_pt: O gestor de contexto cria um diretório temporário no diretório atual com o nome *name* antes de alterar temporariamente o diretório de trabalho atual. Se *name* for ``None``, o diretório temporário é criado usando :func:`tempfile.mkdtemp`.
ru: Контекстный менеджер создает временный каталог в текущем каталоге с именем *name* перед временным изменением текущего рабочего каталога. Если *name* имеет значение ``None``, временный каталог создается с использованием :func:`tempfile.mkdtemp`.

source: If *quiet* is ``False`` and it is not possible to create or change the CWD, an error is raised. Otherwise, only a warning is raised and the original CWD is used.
pt_pt: Se *quiet* for ``False`` e não for possível criar ou alterar o CWD, é levantado um erro. Caso contrário, é emitido apenas um aviso e é usado o CWD original.
ru: Если *quiet* имеет значение «False» и невозможно создать или изменить CWD, выдается ошибка. В противном случае выдается только предупреждение и используется исходный CWD.

source: A context manager that creates a temporary directory at *path* and yields the directory.
pt_pt: Um gestor de contexto que cria um diretório temporário em *path* e devolve o diretório.
ru: Менеджер контекста, который создает временный каталог по адресу *path* и возвращает этот каталог.

source: If *path* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`. If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, if *path* is specified and cannot be created, only a warning is issued.
pt_pt: Se *path* for ``None``, o diretório temporário é criado usando :func:`tempfile.mkdtemp`. Se *quiet* for ``False``, o gestor de contexto levanta uma exceção em caso de erro. Caso contrário, se *path* for especificado e não puder ser criado, é emitido apenas um aviso.
ru: Если *path* имеет значение «None», временный каталог создается с использованием :func:`tempfile.mkdtemp`. Если *quiet* имеет значение «False», менеджер контекста генерирует исключение в случае ошибки. В противном случае, если указан *path* и его невозможно создать, выдается только предупреждение.

source: A context manager that temporarily sets the process umask.
pt_pt: Um gestor de contexto que define temporariamente a máscara umask do processo.
ru: Менеджер контекста, который временно устанавливает маску процесса.

source: Call :func:`os.unlink` on *filename*. As with :func:`rmdir`, on Windows platforms, this is wrapped with a wait loop that checks for the existence of the file.
pt_pt: Chama :func:`os.unlink` em *filename*. Tal como com :func:`rmdir`, nas plataformas Windows, isto é encapsulado num ciclo de espera que verifica a existência do ficheiro.
ru: Вызовите :func:`os.unlink` в *имя_файла*. Как и в случае с :func:`rmdir`, на платформах Windows это завершается циклом ожидания, проверяющим существование файла.

source: :mod:`test.support.import_helper` --- Utilities for import tests
pt_pt: :mod:`test.support.import_helper` --- Utilitários para testes de importação
ru: :mod:`test.support.import_helper` --- Утилиты для импорта тестов

source: The :mod:`test.support.import_helper` module provides support for import tests.
pt_pt: O módulo :mod:`test.support.import_helper` fornece suporte para testes de importação.
ru: Модуль :mod:`test.support.import_helper` обеспечивает поддержку тестов импорта.

source: Remove the module named *module_name* from ``sys.modules`` and delete any byte-compiled files of the module.
pt_pt: Remove o módulo chamado *module_name* de ``sys.modules`` e elimina quaisquer ficheiros byte-compilados do módulo.
ru: Удалите модуль с именем *module_name* из ``sys.modules`` и удалите все скомпилированные побайтно файлы модуля.

source: This function imports and returns a fresh copy of the named Python module by removing the named module from ``sys.modules`` before doing the import. Note that unlike :func:`reload`, the original module is not affected by this operation.
pt_pt: Esta função importa e devolve uma cópia nova do módulo Python nomeado, removendo o módulo nomeado de ``sys.modules`` antes de fazer a importação. Note que, ao contrário de :func:`reload`, o módulo original não é afetado por esta operação.
ru: Эта функция импортирует и возвращает новую копию именованного модуля Python, удаляя именованный модуль из ``sys.modules`` перед выполнением импорта. Обратите внимание, что в отличие от :func:`reload`, эта операция не затрагивает исходный модуль.

source: *fresh* is an iterable of additional module names that are also removed from the ``sys.modules`` cache before doing the import.
pt_pt: *fresh* é um iterável de nomes de módulos adicionais que também são removidos da cache ``sys.modules`` antes de fazer a importação.
ru: *fresh* — это итерация имен дополнительных модулей, которые также удаляются из кэша ``sys.modules`` перед выполнением импорта.

source: *blocked* is an iterable of module names that are replaced with ``None`` in the module cache during the import to ensure that attempts to import them raise :exc:`ImportError`.
pt_pt: *blocked* é um iterável de nomes de módulos que são substituídos por ``None`` na cache do módulo durante a importação para garantir que as tentativas de os importar levantem :exc:`ImportError`.
ru: *blocked* — это итерация имен модулей, которые заменяются на «None» в кэше модулей во время импорта, чтобы гарантировать, что попытки импортировать их вызовут :exc:`ImportError`.

source: The named module and any modules named in the *fresh* and *blocked* parameters are saved before starting the import and then reinserted into ``sys.modules`` when the fresh import is complete.
pt_pt: O módulo nomeado e quaisquer módulos nomeados nos parâmetros *fresh* e *blocked* são guardados antes de iniciar a importação e depois reinseridos em ``sys.modules`` quando a importação nova estiver completa.
ru: Именованный модуль и любые модули, указанные в параметрах *fresh* и *blocked*, сохраняются перед началом импорта, а затем повторно вставляются в ``sys.modules``, когда новый импорт завершен.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``.
pt_pt: As mensagens de obsolescência de módulos e pacotes são suprimidas durante esta importação se *deprecated* for ``True``.
ru: Сообщения об устаревании модулей и пакетов подавляются во время этого импорта, если *deprecated* имеет значение ``True``.

source: This function will raise :exc:`ImportError` if the named module cannot be imported.
pt_pt: Esta função levantará :exc:`ImportError` se o módulo nomeado não puder ser importado.
ru: Эта функция вызовет :exc:`ImportError`, если указанный модуль не может быть импортирован.

source: This function imports and returns the named module. Unlike a normal import, this function raises :exc:`unittest.SkipTest` if the module cannot be imported.
pt_pt: Esta função importa e devolve o módulo nomeado. Ao contrário de uma importação normal, esta função levanta :exc:`unittest.SkipTest` se o módulo não puder ser importado.
ru: Эта функция импортирует и возвращает указанный модуль. В отличие от обычного импорта, эта функция вызывает :exc:`unittest.SkipTest`, если модуль не может быть импортирован.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``. If a module is required on a platform but optional for others, set *required_on* to an iterable of platform prefixes which will be compared against :data:`sys.platform`.
pt_pt: As mensagens de obsolescência de módulos e pacotes são suprimidas durante esta importação se *deprecated* for ``True``. Se um módulo for necessário numa plataforma, mas opcional para outras, defina *required_on* para um iterável de prefixos de plataforma que serão comparados com :data:`sys.platform`.
ru: Сообщения об устаревании модулей и пакетов подавляются во время этого импорта, если *deprecated* имеет значение ``True``. Если модуль необходим на платформе, но необязателен для других, установите *required_on* в итерацию префиксов платформы, которая будет сравниваться с :data:`sys.platform`.

source: Return a copy of :data:`sys.modules`.
pt_pt: Devolve uma cópia de :data:`sys.modules`.
ru: Верните копию :data:`sys.modules`.

source: Remove modules except for *oldmodules* and ``encodings`` in order to preserve internal cache.
pt_pt: Remove módulos exceto *oldmodules* e ``encodings`` para preservar a cache interna.
ru: Удалите модули, кроме *oldmodules* и ``encodings``, чтобы сохранить внутренний кеш.

source: Delete *name* from ``sys.modules``.
pt_pt: Elimina *name* de ``sys.modules``.
ru: Удалите *name* из ``sys.modules``.

source: Move a :pep:`3147`/:pep:`488` pyc file to its legacy pyc location and return the file system path to the legacy pyc file. The *source* value is the file system path to the source file. It does not need to exist, however the PEP 3147/488 pyc file must exist.
pt_pt: Move um ficheiro pyc :pep:`3147`/:pep:`488` para a sua localização pyc legada e devolve o caminho do sistema de ficheiros para o ficheiro pyc legado. O valor *source* é o caminho do sistema de ficheiros para o ficheiro de origem. Não precisa de existir, no entanto, o ficheiro pyc PEP 3147/488 deve existir.
ru: Переместите файл :pep:`3147`/:pep:`488` pyc в его устаревшее местоположение pyc и верните путь файловой системы к устаревшему файлу pyc. Значение *source* — это путь файловой системы к исходному файлу. Его существование не обязательно, однако файл PEP 3147/488 pyc должен существовать.

source: A context manager to force import to return a new module reference. This is useful for testing module-level behaviors, such as the emission of a :exc:`DeprecationWarning` on import. Example usage::
pt_pt: Um gestor de contexto para forçar a importação a devolver uma nova referência de módulo. Isto é útil para testar comportamentos a nível de módulo, como a emissão de um :exc:`DeprecationWarning` na importação. Exemplo de uso::
ru: Менеджер контекста, заставляющий импорт возвращать ссылку на новый модуль. Это полезно для тестирования поведения на уровне модуля, например выдачи :exc:`DeprecationWarning` при импорте. Пример использования::c должен существовать.

source: A context manager to temporarily add directories to :data:`sys.path`.
pt_pt: Um gestor de contexto para adicionar temporariamente diretórios a :data:`sys.path`.
ru: Менеджер контекста для временного добавления каталогов в :data:`sys.path`.

source: This makes a copy of :data:`sys.path`, appends any directories given as positional arguments, then reverts :data:`sys.path` to the copied settings when the context ends.
pt_pt: Isto faz uma cópia de :data:`sys.path`, anexa quaisquer diretórios dados como argumentos posicionais e, em seguida, reverte :data:`sys.path` para as configurações copiadas quando o contexto termina.
ru: Это создает копию :data:`sys.path`, добавляет все каталоги, заданные в качестве позиционных аргументов, а затем возвращает :data:`sys.path` к скопированным настройкам, когда контекст заканчивается.

source: Note that *all* :data:`sys.path` modifications in the body of the context manager, including replacement of the object, will be reverted at the end of the block.
pt_pt: Note que *todas* as modificações de :data:`sys.path` no corpo do gestor de contexto, incluindo a substituição do objeto, serão revertidas no final do bloco.
ru: Обратите внимание, что *все* изменения :data:`sys.path` в теле контекстного менеджера, включая замену объекта, будут отменены в конце блока.

source: :mod:`test.support.warnings_helper` --- Utilities for warnings tests
pt_pt: :mod:`test.support.warnings_helper` --- Utilitários para testes de avisos
ru: :mod:`test.support.warnings_helper` --- Утилиты для проверки предупреждений

source: The :mod:`test.support.warnings_helper` module provides support for warnings tests.
pt_pt: O módulo :mod:`test.support.warnings_helper` fornece suporte para testes de avisos.
ru: Модуль :mod:`test.support.warnings_helper` обеспечивает поддержку тестов предупреждений.

source: Suppress warnings that are instances of *category*, which must be :exc:`Warning` or a subclass. Roughly equivalent to :func:`warnings.catch_warnings` with :meth:`warnings.simplefilter('ignore', category=category) <warnings.simplefilter>`. For example::
pt_pt: Suprime avisos que são instâncias de *category*, que deve ser :exc:`Warning` ou uma subclasse. Aproximadamente equivalente a :func:`warnings.catch_warnings` com :meth:`warnings.simplefilter('ignore', category=category) <warnings.simplefilter>`. Por exemplo::
ru: Подавлять предупреждения, являющиеся экземплярами *category*, которые должны быть :exc:`Warning` или подклассом. Примерно эквивалентно :func:`warnings.catch_warnings` с :meth:`warnings.simplefilter('ignore', Category=category) <warnings.simplefilter>`. Например::

source: Context manager to check that no :exc:`ResourceWarning` was raised. You must remove the object which may emit :exc:`ResourceWarning` before the end of the context manager.
pt_pt: Gestor de contexto para verificar que nenhum :exc:`ResourceWarning` foi levantado. Deve remover o objeto que pode emitir :exc:`ResourceWarning` antes do final do gestor de contexto.
ru: Менеджер контекста, чтобы проверить, что :exc:`ResourceWarning` не было вызвано. Вы должны удалить объект, который может выдать :exc:`ResourceWarning`, до завершения работы контекстного менеджера.
