Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/test.po
Languages: pt_pt, ru

source: The :mod:`test` package is meant for internal use by Python only. It is documented for the benefit of the core developers of Python. Any use of this package outside of Python's standard library is discouraged as code mentioned here can change or be removed without notice between releases of Python.
pt_pt: O pacote :mod:`test` destina-se apenas a uso interno do Python. Está documentado para benefício dos programadores principais do Python. Qualquer uso deste pacote fora da biblioteca padrão do Python é desencorajado, uma vez que o código aqui mencionado pode mudar ou ser removido sem aviso prévio entre versões do Python.
ru: Пакет :mod:`test` предназначен только для внутреннего использования Python. Это документировано для основных разработчиков Python. Любое использование этого пакета за пределами стандартной библиотеки Python не рекомендуется, поскольку упомянутый здесь код может быть изменен или удален без предварительного уведомления между выпусками Python.

source: The :mod:`test` package contains all regression tests for Python as well as the modules :mod:`test.support` and :mod:`test.regrtest`. :mod:`test.support` is used to enhance your tests while :mod:`test.regrtest` drives the testing suite.
pt_pt: O pacote :mod:`test` contém todos os testes de regressão para Python, bem como os módulos :mod:`test.support` e :mod:`test.regrtest`. :mod:`test.support` é usado para melhorar os seus testes, enquanto :mod:`test.regrtest` conduz a suíte de testes.
ru: Пакет :mod:`test` содержит все регрессионные тесты для Python, а также модули :mod:`test.support` и :mod:`test.regrtest`. :mod:`test.support` используется для улучшения ваших тестов, а :mod:`test.regrtest` управляет набором тестов.

source: Each module in the :mod:`test` package whose name starts with ``test_`` is a testing suite for a specific module or feature. All new tests should be written using the :mod:`unittest` or :mod:`doctest` module. Some older tests are written using a "traditional" testing style that compares output printed to ``sys.stdout``; this style of test is considered deprecated.
pt_pt: Cada módulo no pacote :mod:`test` cujo nome começa com ``test_`` é uma suíte de testes para um módulo ou funcionalidade específica. Todos os novos testes devem ser escritos usando o módulo :mod:`unittest` ou :mod:`doctest`. Alguns testes mais antigos são escritos usando um estilo de teste "tradicional" que compara a saída impressa em ``sys.stdout``; este estilo de teste é considerado obsoleto.
ru: Каждый модуль в пакете :mod:`test`, имя которого начинается с ``test_``, представляет собой набор тестов для определенного модуля или функции. Все новые тесты следует писать с использованием модуля :mod:`unittest` или :mod:`doctest`. Некоторые старые тесты написаны с использованием «традиционного» стиля тестирования, который сравнивает выводимые данные с ``sys.stdout``; этот стиль тестирования считается устаревшим.

source: Module :mod:`unittest`
pt_pt: Módulo :mod:`unittest`
ru: Модуль :mod:`unittest`

source: Writing PyUnit regression tests.
pt_pt: Escrever testes de regressão PyUnit.
ru: Написание регрессионных тестов PyUnit.

source: Module :mod:`doctest`
pt_pt: Módulo :mod:`doctest`
ru: Модуль :mod:`doctest`

source: Tests embedded in documentation strings.
pt_pt: Testes incorporados em strings de documentação.
ru: Тесты, встроенные в строки документации.

source: Writing Unit Tests for the :mod:`test` package
pt_pt: Escrever testes unitários para o pacote :mod:`test`
ru: Написание модульных тестов для пакета :mod:`test`

source: It is preferred that tests that use the :mod:`unittest` module follow a few guidelines. One is to name the test module by starting it with ``test_`` and end it with the name of the module being tested. The test methods in the test module should start with ``test_`` and end with a description of what the method is testing. This is needed so that the methods are recognized by the test driver as test methods. Also, no documentation string for the method should be included. A comment (such as ``# Tests function returns only True or False``) should be used to provide documentation for test methods. This is done because documentation strings get printed out if they exist and thus what test is being run is not stated.
ru: Предпочтительно, чтобы тесты, использующие модуль :mod:`unittest`, следовали нескольким рекомендациям. Один из них — назвать тестовый модуль, начав его с ``test_`` и закончив именем тестируемого модуля. Методы тестирования в тестовом модуле должны начинаться с ``test_`` и заканчиваться описанием того, что тестирует этот метод. Это нужно для того, чтобы методы распознавались тест-драйвером как методы тестирования. Кроме того, не следует включать строку документации для этого метода. Комментарий (например, ``Функция # Tests возвращает только True или False``) следует использовать для предоставления документации по методам тестирования. Это сделано потому, что строки документации распечатываются, если они существуют, и поэтому не указывается, какой тест выполняется.

source: A basic boilerplate is often used::
pt_pt: Um modelo básico é frequentemente usado::
ru: Часто используется базовый шаблон:

source: This code pattern allows the testing suite to be run by :mod:`test.regrtest`, on its own as a script that supports the :mod:`unittest` CLI, or via the ``python -m unittest`` CLI.
pt_pt: Este padrão de código permite que a suíte de testes seja executada por :mod:`test.regrtest`, como um script autónomo que suporta a CLI :mod:`unittest`, ou através da CLI ``python -m unittest``.
ru: Этот шаблон кода позволяет запускать комплект тестирования с помощью :mod:`test.regrtest`, отдельно как скрипт, поддерживающий CLI :mod:`unittest`, или через CLI ``python -m unittest``.

source: The goal for regression testing is to try to break code. This leads to a few guidelines to be followed:
pt_pt: O objetivo dos testes de regressão é tentar quebrar o código. Isto leva a algumas diretrizes a seguir:
ru: Цель регрессионного тестирования — попытаться взломать код. Это приводит к соблюдению нескольких рекомендаций:

source: The testing suite should exercise all classes, functions, and constants. This includes not just the external API that is to be presented to the outside world but also "private" code.
pt_pt: A suíte de testes deve exercitar todas as classes, funções e constantes. Isto inclui não apenas a API externa a ser apresentada ao mundo exterior, mas também o código "privado".
ru: Пакет тестирования должен проверять все классы, функции и константы. Сюда входит не только внешний API, который должен быть представлен внешнему миру, но и «частный» код.

source: Whitebox testing (examining the code being tested when the tests are being written) is preferred. Blackbox testing (testing only the published user interface) is not complete enough to make sure all boundary and edge cases are tested.
pt_pt: O teste de caixa branca (examinar o código a ser testado ao escrever os testes) é preferível. O teste de caixa preta (testar apenas a interface de utilizador publicada) não é completo o suficiente para garantir que todos os casos de fronteira e extremos sejam testados.
ru: Предпочтительно тестирование «белого ящика» (проверка тестируемого кода во время написания тестов). Тестирование «черного ящика» (тестирование только опубликованного пользовательского интерфейса) недостаточно полное, чтобы гарантировать проверку всех граничных и крайних случаев.

source: Make sure all possible values are tested including invalid ones. This makes sure that not only all valid values are acceptable but also that improper values are handled correctly.
pt_pt: Certifique-se de que todos os valores possíveis são testados, incluindo os inválidos. Isto garante que não apenas todos os valores válidos são aceitáveis, mas também que os valores impróprios são tratados corretamente.
ru: Убедитесь, что проверены все возможные значения, включая недопустимые. Это гарантирует, что не только все допустимые значения приемлемы, но и правильная обработка неправильных значений.

source: Exhaust as many code paths as possible. Test where branching occurs and thus tailor input to make sure as many different paths through the code are taken.
pt_pt: Esgote o maior número possível de caminhos de código. Teste onde ocorre ramificação e adapte a entrada para garantir que são percorridos tantos caminhos diferentes através do código quanto possível.
ru: Убедитесь, что проверены все возможные значения, включая недопустимые. Это гарантирует, что не только все допустимые значения приемлемы, но и правильная обработка неправильных значений.

source: Add an explicit test for any bugs discovered for the tested code. This will make sure that the error does not crop up again if the code is changed in the future.
pt_pt: Adicione um teste explícito para quaisquer erros descobertos no código testado. Isto garantirá que o erro não volte a aparecer se o código for alterado no futuro.
ru: Добавьте явный тест для любых ошибок, обнаруженных в тестируемом коде. Это гарантирует, что ошибка не возникнет снова, если код будет изменен в будущем.

source: Make sure to clean up after your tests (such as close and remove all temporary files).
pt_pt: Certifique-se de limpar após os seus testes (como fechar e remover todos os ficheiros temporários).
ru: Обязательно выполните очистку после тестов (например, закройте и удалите все временные файлы).

source: If a test is dependent on a specific condition of the operating system then verify the condition already exists before attempting the test.
pt_pt: Se um teste depender de uma condição específica do sistema operativo, verifique se a condição já existe antes de tentar executar o teste.
ru: Если тест зависит от определенного состояния операционной системы, перед попыткой теста убедитесь, что это условие уже существует.

source: Import as few modules as possible and do it as soon as possible. This minimizes external dependencies of tests and also minimizes possible anomalous behavior from side-effects of importing a module.
pt_pt: Importe o menor número possível de módulos e faça-o o mais cedo possível. Isto minimiza as dependências externas dos testes e também minimiza possíveis comportamentos anómalos devido a efeitos secundários da importação de um módulo.
ru: Импортируйте как можно меньше модулей и делайте это как можно скорее. Это сводит к минимуму внешние зависимости тестов, а также сводит к минимуму возможное аномальное поведение из-за побочных эффектов импорта модуля.

source: Try to maximize code reuse. On occasion, tests will vary by something as small as what type of input is used. Minimize code duplication by subclassing a basic test class with a class that specifies the input::
pt_pt: Tente maximizar a reutilização de código. Por vezes, os testes variam em algo tão pequeno como o tipo de entrada usado. Minimize a duplicação de código subclassificando uma classe de teste básica com uma classe que especifica a entrada::
ru: Постарайтесь максимизировать повторное использование кода. Иногда тесты будут различаться в зависимости от того, какой тип входных данных используется. Сведите к минимуму дублирование кода, создав подкласс базового тестового класса на класс, определяющий входные данные:

source: When using this pattern, remember that all classes that inherit from :class:`unittest.TestCase` are run as tests. The :class:`!TestFuncAcceptsSequencesMixin` class in the example above does not have any data and so can't be run by itself, thus it does not inherit from :class:`unittest.TestCase`.
ru: При использовании этого шаблона помните, что все классы, наследуемые от :class:`unittest.TestCase`, запускаются как тесты. Класс :class:`!TestFuncAcceptsSequencesMixin` в приведенном выше примере не имеет никаких данных и поэтому не может быть запущен сам по себе, поэтому он не наследуется от :class:`unittest.TestCase`.

source: Test Driven Development
pt_pt: Desenvolvimento Orientado por Testes
ru: Разработка на основе тестирования

source: A book by Kent Beck on writing tests before code.
pt_pt: Um livro de Kent Beck sobre escrever testes antes do código.
ru: Книга Кента Бека о написании тестов перед написанием кода.

source: Running tests using the command-line interface
pt_pt: Executar testes usando a interface de linha de comandos
ru: Запуск тестов с использованием интерфейса командной строки

source: The :mod:`test` package can be run as a script to drive Python's regression test suite, thanks to the :option:`-m` option: :program:`python -m test`. Under the hood, it uses :mod:`test.regrtest`; the call :program:`python -m test.regrtest` used in previous Python versions still works. Running the script by itself automatically starts running all regression tests in the :mod:`test` package. It does this by finding all modules in the package whose name starts with ``test_``, importing them, and executing the function :func:`test_main` if present or loading the tests via unittest.TestLoader.loadTestsFromModule if ``test_main`` does not exist. The names of tests to execute may also be passed to the script. Specifying a single regression test (:program:`python -m test test_spam`) will minimize output and only print whether the test passed or failed.
pt_pt: O pacote :mod:`test` pode ser executado como um script para conduzir a suíte de testes de regressão do Python, graças à opção :option:`-m`: :program:`python -m test`. Internamente, usa :mod:`test.regrtest`; a chamada :program:`python -m test.regrtest`, usada em versões anteriores do Python, ainda funciona. Executar o script por si só inicia automaticamente todos os testes de regressão no pacote :mod:`test`. Faz isto encontrando todos os módulos no pacote cujos nomes começam com ``test_``, importando-os e executando a função :func:`test_main`, se presente, ou carregando os testes através de unittest.TestLoader.loadTestsFromModule se ``test_main`` não existir. Os nomes dos testes a executar também podem ser passados ao script. Especificar um único teste de regressão (:program:`python -m test test_spam`) minimizará a saída e imprimirá apenas se o teste passou ou falhou.
ru: Пакет :mod:`test` можно запустить как скрипт для управления набором регрессионных тестов Python благодаря опции :option:`-m`: :program:`python -m test`. Под капотом он использует :mod:`test.regrtest`; вызов :program:`python -m test.regrtest`, использовавшийся в предыдущих версиях Python, по-прежнему работает. Запуск скрипта автоматически запускает все регрессионные тесты в пакете :mod:`test`. Он делает это, находя в пакете все модули, имена которых начинаются с ``test_``, импортируя их и выполняя функцию :func:`test_main`, если она присутствует, или загружая тесты через unittest.TestLoader.loadTestsFromModule, если ``test_main` ` не существует. Имена тестов, которые необходимо выполнить, также могут быть переданы в сценарий. Указание одного регрессионного теста (:program:`python -m test test_spam`) сведет к минимуму выходные данные и выведет только информацию о том, пройден тест или нет.

source: Running :mod:`test` directly allows what resources are available for tests to use to be set. You do this by using the ``-u`` command-line option. Specifying ``all`` as the value for the ``-u`` option enables all possible resources: :program:`python -m test -uall`. If all but one resource is desired (a more common case), a comma-separated list of resources that are not desired may be listed after ``all``. The command :program:`python -m test -uall,-audio,-largefile` will run :mod:`test` with all resources except the ``audio`` and ``largefile`` resources. For a list of all resources and more command-line options, run :program:`python -m test -h`.
pt_pt: Executar :mod:`test` diretamente permite definir quais recursos estão disponíveis para os testes usarem. Faz-se isto usando a opção de linha de comandos ``-u``. Especificar ``all`` como o valor para a opção ``-u`` ativa todos os recursos possíveis: :program:`python -m test -uall`. Se todos menos um recurso forem desejados (um caso mais comum), uma lista separada por vírgulas de recursos não desejados pode ser listada após ``all``. O comando :program:`python -m test -uall,-audio,-largefile` executará :mod:`test` com todos os recursos exceto os recursos ``audio`` e ``largefile``. Para uma lista de todos os recursos e mais opções de linha de comandos, execute :program:`python -m test -h`.
ru: Запуск :mod:`test` напрямую позволяет установить, какие ресурсы доступны для использования тестами. Вы делаете это, используя параметр командной строки ``-u``. Указание ``all`` в качестве значения опции ``-u`` включает все возможные ресурсы: :program:`python -m test -uall`. Если желательны все ресурсы, кроме одного (более распространенный случай), после слова «все» может быть указан список нежелательных ресурсов, разделенный запятыми. Команда :program:`python -m test -uall,-audio,-largefile` запустит :mod:`test` со всеми ресурсами, кроме ресурсов ``audio`` и ``largefile``. Чтобы получить список всех ресурсов и дополнительные параметры командной строки, запустите :program:`python -m test -h`.

source: Some other ways to execute the regression tests depend on what platform the tests are being executed on. On Unix, you can run :program:`make test` at the top-level directory where Python was built. On Windows, executing :program:`rt.bat` from your :file:`PCbuild` directory will run all regression tests.
pt_pt: Outras formas de executar os testes de regressão dependem da plataforma em que os testes estão a ser executados. No Unix, pode executar :program:`make test` no diretório de nível superior onde o Python foi construído. No Windows, executar :program:`rt.bat` a partir do seu diretório :file:`PCbuild` executará todos os testes de regressão.
ru: Некоторые другие способы выполнения регрессионных тестов зависят от того, на какой платформе выполняются тесты. В Unix вы можете запустить :program:`make test` в каталоге верхнего уровня, где был собран Python. В Windows запуск :program:`rt.bat` из вашего каталога :file:`PCbuild` запустит все регрессионные тесты.

source: :mod:`test.support` --- Utilities for the Python test suite
pt_pt: :mod:`test.support` --- Utilitários para a suíte de testes do Python
ru: :mod:`test.support` --- Утилиты для набора тестов Python

source: The :mod:`test.support` module provides support for Python's regression test suite.
pt_pt: O módulo :mod:`test.support` fornece suporte para a suíte de testes de regressão do Python.
ru: Модуль :mod:`test.support` обеспечивает поддержку набора регрессионных тестов Python.

source: :mod:`test.support` is not a public module. It is documented here to help Python developers write tests. The API of this module is subject to change without backwards compatibility concerns between releases.
pt_pt: :mod:`test.support` não é um módulo público. Está documentado aqui para ajudar os programadores do Python a escrever testes. A API deste módulo está sujeita a alterações sem preocupações de compatibilidade retroativa entre versões.
ru: :mod:`test.support` не является общедоступным модулем. Здесь описано, как помочь разработчикам Python писать тесты. API этого модуля может быть изменен без проблем обратной совместимости между выпусками.

source: This module defines the following exceptions:
pt_pt: Este módulo define as seguintes exceções:
ru: Этот модуль определяет следующие исключения:

source: Exception to be raised when a test fails. This is deprecated in favor of :mod:`unittest`\ -based tests and :class:`unittest.TestCase`'s assertion methods.
pt_pt: Exceção a ser levantada quando um teste falha. Isto está obsoleto em favor de testes baseados em :mod:`unittest` e métodos de afirmação de :class:`unittest.TestCase`.
ru: Исключение, которое будет вызвано в случае сбоя теста. Это устарело в пользу тестов на основе :mod:`unittest`\ и методов утверждения :class:`unittest.TestCase`.

source: Subclass of :exc:`unittest.SkipTest`. Raised when a resource (such as a network connection) is not available. Raised by the :func:`requires` function.
pt_pt: Subclasse de :exc:`unittest.SkipTest`. Levantada quando um recurso (como uma ligação de rede) não está disponível. Levantada pela função :func:`requires`.
ru: Подкласс :exc:`unittest.SkipTest`. Возникает, когда ресурс (например, сетевое соединение) недоступен. Вызывается функцией :func:`requires`.

source: The :mod:`test.support` module defines the following constants:
pt_pt: O módulo :mod:`test.support` define as seguintes constantes:
ru: Модуль :mod:`test.support` определяет следующие константы:

source: ``True`` when verbose output is enabled. Should be checked when more detailed information is desired about a running test. *verbose* is set by :mod:`test.regrtest`.
pt_pt: ``True`` quando a saída detalhada está ativada. Deve ser verificado quando informações mais detalhadas são desejadas sobre um teste em execução. *verbose* é definido por :mod:`test.regrtest`.
ru: ``True``, когда включен подробный вывод. Следует проверять, когда требуется более подробная информация о выполняемом тесте. *verbose* устанавливается :mod:`test.regrtest`.

source: ``True`` if the running interpreter is Jython.
pt_pt: ``True`` se o interpretador em execução for Jython.
ru: ``True``, если работающим интерпретатором является Jython.

source: ``True`` if the system is Android.
ru: ``True``, если используется система Android.

source: Path for shell if not on Windows; otherwise ``None``.
pt_pt: Caminho para a shell se não estiver no Windows; caso contrário, ``None``.
ru: Путь к оболочке, если не в Windows; в противном случае ``Нет``.

source: Timeout in seconds for tests using a network server listening on the network local loopback interface like ``127.0.0.1``.
pt_pt: Tempo limite em segundos para testes que usam um servidor de rede a escutar na interface de loopback local da rede, como ``127.0.0.1``.
ru: Тайм-аут в секундах для тестов с использованием сетевого сервера, прослушивающего локальный сетевой интерфейс обратной связи, например «127.0.0.1».

source: The timeout is long enough to prevent test failure: it takes into account that the client and the server can run in different threads or even different processes.
pt_pt: O tempo limite é longo o suficiente para evitar falhas nos testes: leva em conta que o cliente e o servidor podem ser executados em threads diferentes ou até em processos diferentes.
ru: Таймаут достаточно велик, чтобы предотвратить сбой теста: он учитывает, что клиент и сервер могут работать в разных потоках или даже в разных процессах.

source: The timeout should be long enough for :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` methods of :class:`socket.socket`.
pt_pt: O tempo limite deve ser longo o suficiente para os métodos :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` e :meth:`~socket.socket.send` de :class:`socket.socket`.
ru: Тайм-аут должен быть достаточно длинным для методов :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` и :meth:`~socket.socket.send` класса :class:`socket. розетка`.

source: Its default value is 5 seconds.
pt_pt: O seu valor predefinido é 5 segundos.
ru: Его значение по умолчанию — 5 секунд.

source: See also :data:`INTERNET_TIMEOUT`.
pt_pt: Veja também :data:`INTERNET_TIMEOUT`.
ru: См. также :data:`INTERNET_TIMEOUT`.

source: Timeout in seconds for network requests going to the internet.
pt_pt: Tempo limite em segundos para pedidos de rede que vão para a Internet.
ru: Таймаут в секундах для сетевых запросов, идущих в Интернет.
