Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/textwrap.po
Languages: ru

source: :mod:`!textwrap` --- Text wrapping and filling
ru: :mod:`!textwrap` --- Перенос и заполнение текста

source: **Source code:** :source:`Lib/textwrap.py`
ru: **Исходный код:** :source:`Lib/textwrap.py`

source: The :mod:`textwrap` module provides some convenience functions, as well as :class:`TextWrapper`, the class that does all the work. If you're just wrapping or filling one or two text strings, the convenience functions should be good enough; otherwise, you should use an instance of :class:`TextWrapper` for efficiency.
ru: Модуль :mod:`textwrap` предоставляет некоторые удобные функции, а также :class:`TextWrapper`, класс, который выполняет всю работу. Если вы просто переносите или заполняете одну или две текстовые строки, удобных функций должно быть достаточно; в противном случае для повышения эффективности вам следует использовать экземпляр :class:`TextWrapper`.

source: Wraps the single paragraph in *text* (a string) so every line is at most *width* characters long. Returns a list of output lines, without final newlines.
ru: Обертывает один абзац в *текст* (строку), поэтому длина каждой строки не превышает *ширину* символов. Возвращает список выходных строк без последних символов новой строки.

source: Optional keyword arguments correspond to the instance attributes of :class:`TextWrapper`, documented below.
ru: Необязательные аргументы ключевого слова соответствуют атрибутам экземпляра :class:`TextWrapper`, описанным ниже.

source: See the :meth:`TextWrapper.wrap` method for additional details on how :func:`wrap` behaves.
ru: Дополнительную информацию о том, как ведет себя :func:`wrap`, смотрите в методе :meth:`TextWrapper.wrap`.

source: Wraps the single paragraph in *text*, and returns a single string containing the wrapped paragraph. :func:`fill` is shorthand for ::
ru: Обертывает один абзац в *текст* и возвращает одну строку, содержащую заключенный абзац. :func:`fill` — это сокращение от ::

source: In particular, :func:`fill` accepts exactly the same keyword arguments as :func:`wrap`.
ru: В частности, :func:`fill` принимает точно такие же ключевые аргументы, что и :func:`wrap`.

source: Collapse and truncate the given *text* to fit in the given *width*.
ru: Свернуть и обрезать заданный *текст*, чтобы он соответствовал заданной *ширине*.

source: First the whitespace in *text* is collapsed (all whitespace is replaced by single spaces). If the result fits in the *width*, it is returned. Otherwise, enough words are dropped from the end so that the remaining words plus the *placeholder* fit within *width*::
ru: Сначала пробелы в *text* сворачиваются (все пробелы заменяются одиночными пробелами). Если результат соответствует *ширине*, он возвращается. В противном случае с конца удаляется достаточно слов, чтобы оставшиеся слова плюс *заполнитель* поместились в пределах *ширины*::

source: Optional keyword arguments correspond to the instance attributes of :class:`TextWrapper`, documented below. Note that the whitespace is collapsed before the text is passed to the :class:`TextWrapper` :meth:`fill` function, so changing the value of :attr:`.tabsize`, :attr:`.expand_tabs`, :attr:`.drop_whitespace`, and :attr:`.replace_whitespace` will have no effect.
ru: Необязательные аргументы ключевого слова соответствуют атрибутам экземпляра :class:`TextWrapper`, описанным ниже. Обратите внимание, что пробелы сворачиваются перед передачей текста в функцию :class:`TextWrapper` :meth:`fill`, поэтому изменяется значение :attr:`.tabsize`, :attr:`.expand_tabs`, :attr. :`.drop_whitespace` и :attr:`.replace_whitespace` не будут иметь никакого эффекта.

source: Remove any common leading whitespace from every line in *text*.
ru: Удалите все общие начальные пробелы из каждой строки *text*.

source: This can be used to make triple-quoted strings line up with the left edge of the display, while still presenting them in the source code in indented form.
ru: Это можно использовать для выравнивания строк в тройных кавычках по левому краю экрана, при этом они по-прежнему будут представлены в исходном коде в форме с отступом.

source: Note that tabs and spaces are both treated as whitespace, but they are not equal: the lines ``" hello"`` and ``"\thello"`` are considered to have no common leading whitespace.
ru: Обратите внимание, что табуляция и пробелы рассматриваются как пробелы, но они не равны: строки ``" hello"`` и ``"\thello"`` считаются не имеющими общего начального пробела.

source: Lines containing only whitespace are ignored in the input and normalized to a single newline character in the output.
ru: Строки, содержащие только пробелы, игнорируются на входе и нормализуются до одного символа новой строки на выходе.

source: For example::
ru: Например::

source: Add *prefix* to the beginning of selected lines in *text*.
ru: Добавьте *префикс* в начало выбранных строк в *тексте*.

source: Lines are separated by calling ``text.splitlines(True)``.
ru: Строки разделяются вызовом ``text.splitlines(True)``.

source: By default, *prefix* is added to all lines that do not consist solely of whitespace (including any line endings).
ru: По умолчанию *префикс* добавляется ко всем строкам, которые не состоят исключительно из пробелов (включая окончания строк).

source: The optional *predicate* argument can be used to control which lines are indented. For example, it is easy to add *prefix* to even empty and whitespace-only lines::
ru: Необязательный аргумент *predicate* можно использовать для управления отступом строк. Например, легко добавить *префикс* даже к пустым строкам, содержащим только пробелы::

source: :func:`wrap`, :func:`fill` and :func:`shorten` work by creating a :class:`TextWrapper` instance and calling a single method on it. That instance is not reused, so for applications that process many text strings using :func:`wrap` and/or :func:`fill`, it may be more efficient to create your own :class:`TextWrapper` object.
ru: :func:`wrap`, :func:`fill` и :func:`shorten` работают, создавая экземпляр :class:`TextWrapper` и вызывая для него один метод. Этот экземпляр не используется повторно, поэтому для приложений, которые обрабатывают множество текстовых строк с помощью :func:`wrap` и/или :func:`fill`, может оказаться более эффективным создать собственный объект :class:`TextWrapper`.

source: Text is preferably wrapped on whitespaces and right after the hyphens in hyphenated words; only then will long words be broken if necessary, unless :attr:`TextWrapper.break_long_words` is set to false.
ru: Текст желательно заключать в пробелы и сразу после дефисов в словах, написанных через дефис; только тогда длинные слова будут разбиваться при необходимости, если только для :attr:`TextWrapper.break_long_words` не установлено значение false.

source: The :class:`TextWrapper` constructor accepts a number of optional keyword arguments. Each keyword argument corresponds to an instance attribute, so for example ::
ru: Конструктор :class:`TextWrapper` принимает ряд необязательных аргументов-ключевых слов. Каждый аргумент ключевого слова соответствует атрибуту экземпляра, например:::

source: is the same as ::
ru: то же самое, что:::

source: You can reuse the same :class:`TextWrapper` object many times, and you can change any of its options through direct assignment to instance attributes between uses.
ru: Вы можете повторно использовать один и тот же объект :class:`TextWrapper` много раз и можете изменять любые его параметры путем прямого присвоения атрибутам экземпляра между использованиями.

source: The :class:`TextWrapper` instance attributes (and keyword arguments to the constructor) are as follows:
ru: Атрибуты экземпляра :class:`TextWrapper` (и ключевые аргументы конструктора) следующие:

source: (default: ``70``) The maximum length of wrapped lines. As long as there are no individual words in the input text longer than :attr:`width`, :class:`TextWrapper` guarantees that no output line will be longer than :attr:`width` characters.
ru: (по умолчанию: ``70``) Максимальная длина переносимых строк. Пока во входном тексте нет отдельных слов длиной более :attr:`width`, :class:`TextWrapper` гарантирует, что ни одна выходная строка не будет длиннее символов :attr:`width`.

source: (default: ``True``) If true, then all tab characters in *text* will be expanded to spaces using the :meth:`~str.expandtabs` method of *text*.
ru: (по умолчанию: ``True``) Если true, то все символы табуляции в *text* будут расширены до пробелов с использованием метода :meth:`~str.expandtabs` *text*.

source: (default: ``8``) If :attr:`expand_tabs` is true, then all tab characters in *text* will be expanded to zero or more spaces, depending on the current column and the given tab size.
ru: (по умолчанию: ``8``) Если :attr:`expand_tabs` имеет значение true, то все символы табуляции в *text* будут расширены до нуля или более пробелов, в зависимости от текущего столбца и заданного размера табуляции.

source: (default: ``True``) If true, after tab expansion but before wrapping, the :meth:`wrap` method will replace each whitespace character with a single space. The whitespace characters replaced are as follows: tab, newline, vertical tab, formfeed, and carriage return (``'\t\n\v\f\r'``).
ru: (по умолчанию: ``True``) Если true, после раскрытия табуляции, но перед переносом, метод :meth:`wrap` заменит каждый пробельный символ одним пробелом. Заменены следующие пробельные символы: табуляция, новая строка, вертикальная табуляция, перевод страницы и возврат каретки (``'\t\n\v\f\r'``).

source: If :attr:`expand_tabs` is false and :attr:`replace_whitespace` is true, each tab character will be replaced by a single space, which is *not* the same as tab expansion.
ru: Если :attr:`expand_tabs` имеет значение false, а :attr:`replace_whitespace` имеет значение true, каждый символ табуляции будет заменен одним пробелом, что *не* совпадает с раскрытием табуляции.

source: If :attr:`replace_whitespace` is false, newlines may appear in the middle of a line and cause strange output. For this reason, text should be split into paragraphs (using :meth:`str.splitlines` or similar) which are wrapped separately.
ru: Если :attr:`replace_whitespace` имеет значение false, символы новой строки могут появиться в середине строки и привести к странному выводу. По этой причине текст следует разбивать на абзацы (используя :meth:`str.splitlines` или аналогичный), которые переносятся отдельно.

source: (default: ``True``) If true, whitespace at the beginning and ending of every line (after wrapping but before indenting) is dropped. Whitespace at the beginning of the paragraph, however, is not dropped if non-whitespace follows it. If whitespace being dropped takes up an entire line, the whole line is dropped.
ru: (по умолчанию: ``True``) Если true, пробелы в начале и конце каждой строки (после переноса, но перед отступом) удаляются. Однако пробелы в начале абзаца не удаляются, если за ними следуют непробельные символы. Если удаляемые пробелы занимают целую строку, удаляется вся строка.

source: (default: ``''``) String that will be prepended to the first line of wrapped output. Counts towards the length of the first line. The empty string is not indented.
ru: (по умолчанию: ``''``) Строка, которая будет добавлена ​​к первой строке обернутого вывода. Учитывается длина первой строки. Пустая строка не имеет отступа.

source: (default: ``''``) String that will be prepended to all lines of wrapped output except the first. Counts towards the length of each line except the first.
ru: (по умолчанию: ``''``) Строка, которая будет добавляться ко всем строкам обернутого вывода, кроме первой. Учитывается длина каждой строки, кроме первой.

source: (default: ``False``) If true, :class:`TextWrapper` attempts to detect sentence endings and ensure that sentences are always separated by exactly two spaces. This is generally desired for text in a monospaced font. However, the sentence detection algorithm is imperfect: it assumes that a sentence ending consists of a lowercase letter followed by one of ``'.'``, ``'!'``, or ``'?'``, possibly followed by one of ``'"'`` or ``"'"``, followed by a space. One problem with this algorithm is that it is unable to detect the difference between "Dr." in ::
ru: (по умолчанию: ``False``) Если true, :class:`TextWrapper` пытается обнаружить окончания предложений и гарантировать, что предложения всегда разделены ровно двумя пробелами. Обычно это желательно для текста, написанного моноширинным шрифтом. Однако алгоритм обнаружения предложений несовершенен: он предполагает, что окончание предложения состоит из строчной буквы, за которой следует одно из символов ``'.'``, ``'!'`` или ``'?'``, возможно за которым следует одно из ``'"'`` или ``"'"``, за которым следует пробел. Одна из проблем этого алгоритма заключается в том, что он не может обнаружить разницу между "Доктор." в ::

source: [...] Dr. Frankenstein's monster [...]
ru: [...] Монстр доктора Франкенштейна [...]

source: [...] See Spot. See Spot run [...]
ru: [...] См. Спот. См. спотовый забег [...]

source: :attr:`fix_sentence_endings` is false by default.
ru: :attr:`fix_sentence_endings` по умолчанию имеет значение false.

source: Since the sentence detection algorithm relies on ``string.lowercase`` for the definition of "lowercase letter", and a convention of using two spaces after a period to separate sentences on the same line, it is specific to English-language texts.
ru: Поскольку алгоритм обнаружения предложений использует ``string.lowercase`` для определения «строчной буквы» и соглашение об использовании двух пробелов после точки для разделения предложений в одной строке, он специфичен для англоязычных текстов.

source: (default: ``True``) If true, then words longer than :attr:`width` will be broken in order to ensure that no lines are longer than :attr:`width`. If it is false, long words will not be broken, and some lines may be longer than :attr:`width`. (Long words will be put on a line by themselves, in order to minimize the amount by which :attr:`width` is exceeded.)
ru: (по умолчанию: ``True``) Если true, то слова длиннее :attr:`width` будут разбиваться, чтобы гарантировать, что ни одна строка не будет длиннее :attr:`width`. Если оно ложно, длинные слова не будут разбиваться, а некоторые строки могут быть длиннее, чем :attr:`width`. (Длинные слова будут помещаться в одну строку, чтобы минимизировать превышение :attr:`width`.)

source: (default: ``True``) If true, wrapping will occur preferably on whitespaces and right after hyphens in compound words, as it is customary in English. If false, only whitespaces will be considered as potentially good places for line breaks, but you need to set :attr:`break_long_words` to false if you want truly insecable words. Default behaviour in previous versions was to always allow breaking hyphenated words.
ru: (по умолчанию: ``True``) Если true, перенос будет происходить предпочтительно по пробелам и сразу после дефисов в составных словах, как это принято в английском языке. Если значение false, только пробелы будут считаться потенциально хорошими местами для разрывов строк, но вам нужно установить для :attr:`break_long_words` значение false, если вы хотите, чтобы слова действительно были неразрывными. Поведение по умолчанию в предыдущих версиях всегда позволяло разбивать слова, написанные через дефис.

source: (default: ``None``) If not ``None``, then the output will contain at most *max_lines* lines, with *placeholder* appearing at the end of the output.
ru: (по умолчанию: ``None``) Если не ``None``, то выходные данные будут содержать не более *max_lines* строк, а в конце вывода появится *placeholder*.

source: (default: ``' [...]'``) String that will appear at the end of the output text if it has been truncated.
ru: (по умолчанию: ``' [...]'``) Строка, которая появится в конце выходного текста, если он был усечен.

source: :class:`TextWrapper` also provides some public methods, analogous to the module-level convenience functions:
ru: :class:`TextWrapper` также предоставляет некоторые общедоступные методы, аналогичные удобным функциям уровня модуля:

source: Wraps the single paragraph in *text* (a string) so every line is at most :attr:`width` characters long. All wrapping options are taken from instance attributes of the :class:`TextWrapper` instance. Returns a list of output lines, without final newlines. If the wrapped output has no content, the returned list is empty.
ru: Обертывает один абзац в *текст* (строку), поэтому длина каждой строки не превышает :attr:`width` символов. Все параметры переноса берутся из атрибутов экземпляра :class:`TextWrapper`. Возвращает список выходных строк без последних символов новой строки. Если обернутый вывод не имеет содержимого, возвращаемый список пуст.

source: Wraps the single paragraph in *text*, and returns a single string containing the wrapped paragraph.
ru: Обертывает один абзац в *текст* и возвращает одну строку, содержащую заключенный абзац.
