Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: pt_pt, sv

source: Each item should have the same number of values as the widget option columns. If there are fewer values than columns, the remaining values are assumed empty. If there are more values than columns, the extra values are ignored.
pt_pt: Cada item deve ter o mesmo número de valores que a opção de widget columns. Se houver menos valores do que colunas, os valores restantes são assumidos como vazios. Se houver mais valores do que colunas, os valores extra são ignorados.
sv: Varje objekt ska ha samma antal värden som widgetalternativets kolumner. Om det finns färre värden än kolumner antas de återstående värdena vara tomma. Om det finns fler värden än kolumner ignoreras de extra värdena.

source: open
pt_pt: abrir
sv: öppen

source: ``True``/``False`` value indicating whether the item's children should be displayed or hidden.
pt_pt: Valor ``True``/``False`` indicando se os filhos do item devem ser exibidos ou ocultos.
sv: ``True``/``False`` värde som anger om objektets barn ska visas eller döljas.

source: tags
pt_pt: etiquetas

source: A list of tags associated with this item.
pt_pt: Uma lista de etiquetas associadas a este item.
sv: En lista över taggar som är associerade med detta objekt.

source: Tag Options
pt_pt: Opções de Etiqueta
sv: Alternativ för taggar

source: The following options may be specified on tags:
pt_pt: As seguintes opções podem ser especificadas em etiquetas:
sv: Följande alternativ kan anges för taggar:

source: foreground
pt_pt: primeiro plano

source: Specifies the text foreground color.
pt_pt: Especifica a cor do primeiro plano do texto.
sv: Anger textens förgrundsfärg.

source: Specifies the cell or item background color.
pt_pt: Especifica a cor de fundo da célula ou item.
sv: Anger bakgrundsfärgen för cellen eller objektet.

source: font
pt_pt: fonte

source: Specifies the font to use when drawing text.
pt_pt: Especifica a fonte a usar ao desenhar texto.
sv: Anger vilket teckensnitt som ska användas när du ritar text.

source: Specifies the item image, in case the item's image option is empty.
pt_pt: Especifica a imagem do item, caso a opção de imagem do item esteja vazia.
sv: Anger artikelns bild, om artikelns bildalternativ är tomt.

source: Column Identifiers
pt_pt: Identificadores de Coluna
sv: Kolumnidentifierare

source: Column identifiers take any of the following forms:
pt_pt: Os identificadores de coluna podem assumir qualquer uma das seguintes formas:
sv: Kolumnidentifierare kan ha någon av följande former:

source: A symbolic name from the list of columns option.
pt_pt: Um nome simbólico da lista de opções de colunas.
sv: Ett symboliskt namn från listan över kolumnalternativ.

source: An integer n, specifying the nth data column.
pt_pt: Um inteiro n, especificando a n-ésima coluna de dados.
sv: Ett heltal n, som anger den n:te datakolumnen.

source: A string of the form #n, where n is an integer, specifying the nth display column.
pt_pt: Uma string da forma #n, onde n é um inteiro, especificando a n-ésima coluna de exibição.
sv: En sträng av formen #n, där n är ett heltal, som anger den n:te visningskolumnen.

source: Notes:
pt_pt: Notas:
sv: Anteckningar:

source: Item's option values may be displayed in a different order than the order in which they are stored.
pt_pt: Os valores das opções do item podem ser exibidos numa ordem diferente da ordem em que são armazenados.
sv: Objektets optionsvärden kan visas i en annan ordning än den ordning i vilken de lagras.

source: Column #0 always refers to the tree column, even if show="tree" is not specified.
pt_pt: A coluna #0 refere-se sempre à coluna da árvore, mesmo que show="árvore" não seja especificado.
sv: Kolumn #0 hänvisar alltid till trädkolumnen, även om show="tree" inte har angetts.

source: A data column number is an index into an item's option values list; a display column number is the column number in the tree where the values are displayed. Tree labels are displayed in column #0. If option displaycolumns is not set, then data column n is displayed in column #n+1. Again, **column #0 always refers to the tree column**.
pt_pt: Um número de coluna de dados é um índice na lista de valores de opções de um item; um número de coluna de exibição é o número da coluna na árvore onde os valores são exibidos. As etiquetas da árvore são exibidas na coluna #0. Se a opção displaycolumns não estiver definida, então a coluna de dados n é exibida na coluna #n+1. Novamente, **a coluna #0 refere-se sempre à coluna da árvore**.
sv: Ett kolumnnummer för data är ett index i listan med alternativvärden för ett objekt; ett kolumnnummer för visning är kolumnnumret i trädet där värdena visas. Trädets etiketter visas i kolumn #0. Om alternativet displaycolumns inte är inställt visas datakolumn n i kolumn #n+1. Återigen, **kolumn #0 hänvisar alltid till trädkolumnen**.

source: The Treeview widget generates the following virtual events.
pt_pt: O widget Treeview gera os seguintes eventos virtuais.
sv: Widgeten Treeview genererar följande virtuella händelser.

source: Generated whenever the selection changes.
pt_pt: Gerado sempre que a seleção muda.
sv: Genereras när urvalet ändras.

source: Generated just before settings the focus item to open=True.
pt_pt: Gerado imediatamente antes de definir o item de foco para open=True.
sv: Genereras precis innan fokusobjektet ställs in på open=True.

source: Generated just after setting the focus item to open=False.
pt_pt: Gerado imediatamente após definir o item de foco para open=False.
sv: Genereras precis efter att fokusobjektet har ställts in på open=False.

source: The :meth:`Treeview.focus` and :meth:`Treeview.selection` methods can be used to determine the affected item or items.
pt_pt: Os métodos :meth:`Treeview.focus` e :meth:`Treeview.selection` podem ser usados para determinar o item ou itens afetados.
sv: Metoderna :meth:`Treeview.focus` och :meth:`Treeview.selection` kan användas för att bestämma det eller de objekt som påverkas.

source: Returns the bounding box (relative to the treeview widget's window) of the specified *item* in the form (x, y, width, height).
pt_pt: Retorna a caixa delimitadora (relativa à janela do widget treeview) do *item* especificado na forma (x, y, largura, altura).
sv: Returnerar avgränsningsrutan (i förhållande till treeview-widgetens fönster) för det angivna *objektet* i formen (x, y, bredd, höjd).

source: If *column* is specified, returns the bounding box of that cell. If the *item* is not visible (i.e., if it is a descendant of a closed item or is scrolled offscreen), returns an empty string.
pt_pt: Se *coluna* for especificada, retorna a caixa delimitadora dessa célula. Se o *item* não estiver visível (ou seja, se for um descendente de um item fechado ou estiver fora do ecrã devido à rolagem), retorna uma string vazia.
sv: Om *column* anges returneras cellens avgränsande box. Om *objektet* inte är synligt (dvs. om det är en ättling till ett stängt objekt eller om det rullas utanför skärmen), returneras en tom sträng.

source: Returns the list of children belonging to *item*.
pt_pt: Retorna a lista de filhos pertencentes ao *item*.
sv: Returnerar listan över barn som hör till *item*.

source: If *item* is not specified, returns root children.
pt_pt: Se *item* não for especificado, retorna os filhos da raiz.
sv: Om *item* inte anges returneras rotbarn.

source: Replaces *item*'s child with *newchildren*.
pt_pt: Substitui os filhos de *item* por *newchildren*.
sv: Ersätter *item*:s barn med *newchildren*.

source: Children present in *item* that are not present in *newchildren* are detached from the tree. No items in *newchildren* may be an ancestor of *item*. Note that not specifying *newchildren* results in detaching *item*'s children.
pt_pt: Os filhos presentes em *item* que não estão presentes em *newchildren* são separados da árvore. Nenhum item em *newchildren* pode ser um ancestral de *item*. Note que não especificar *newchildren* resulta na separação dos filhos de *item*.
sv: Barn som finns i *item* och som inte finns i *newchildren* tas bort från trädet. Inga objekt i *newchildren* får vara förfäder till *item*. Observera att om du inte anger *newchildren* kommer *item*:s barn att tas bort.

source: Query or modify the options for the specified *column*.
pt_pt: Consultar ou modificar as opções para a *coluna* especificada.
sv: Fråga efter eller ändra alternativen för den angivna *kolumnen*.

source: If *kw* is not given, returns a dict of the column option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
pt_pt: Se *kw* não for fornecido, retorna um dicionário dos valores das opções da coluna. Se *opção* for especificada, então o valor para essa *opção* é retornado. Caso contrário, define as opções para os valores correspondentes.
sv: Om *kw* inte anges, returneras en dict med värden för kolumnens alternativ. Om *option* anges returneras värdet för det *option*. Annars sätts alternativen till motsvarande värden.

source: The valid options/values are:
pt_pt: As opções/valores válidos são:
sv: De giltiga alternativen/värdena är:

source: Returns the column name. This is a read-only option.
pt_pt: Retorna o nome da coluna. Esta é uma opção apenas de leitura.
sv: Returnerar kolumnnamnet. Detta är ett skrivskyddat alternativ.

source: *anchor*: One of the standard Tk anchor values.
pt_pt: *ancora*: Um dos valores de ancora padrão do Tk.
sv: *anchor*: Ett av Tk:s standardvärden för ankare.

source: Specifies how the text in this column should be aligned with respect to the cell.
pt_pt: Especifica como o texto nesta coluna deve ser alinhado em relação à célula.
sv: Anger hur texten i den här kolumnen ska justeras i förhållande till cellen.

source: *minwidth*: width
pt_pt: *minwidth*: largura
sv: *minwidth*: bredd

source: The minimum width of the column in pixels. The treeview widget will not make the column any smaller than specified by this option when the widget is resized or the user drags a column.
pt_pt: A largura mínima da coluna em píxeis. O widget treeview não tornará a coluna mais pequena do que o especificado por esta opção quando o widget for redimensionado ou o utilizador arrastar uma coluna.
sv: Kolumnens minsta bredd i pixlar. Treeview-widgeten kommer inte att göra kolumnen mindre än vad som anges av detta alternativ när widgeten ändras i storlek eller användaren drar en kolumn.

source: Specifies whether the column's width should be adjusted when the widget is resized.
pt_pt: Especifica se a largura da coluna deve ser ajustada quando o widget for redimensionado.
sv: Anger om kolumnens bredd ska justeras när widgetens storlek ändras.

source: *width*: width
pt_pt: *width*: largura
sv: *width*: bredd

source: The width of the column in pixels.
pt_pt: A largura da coluna em píxeis.
sv: Kolumnens bredd i pixlar.

source: To configure the tree column, call this with column = "#0"
pt_pt: Para configurar a coluna da árvore, chame isto com column = "#0"
sv: För att konfigurera trädkolumnen, kalla detta med column = "#0"

source: Delete all specified *items* and all their descendants.
pt_pt: Apaga todos os *itens* especificados e todos os seus descendentes.
sv: Ta bort alla angivna *objekt* och alla deras efterföljande objekt.

source: The root item may not be deleted.
pt_pt: O item raiz não pode ser apagado.
sv: Rotobjektet får inte raderas.

source: Unlinks all of the specified *items* from the tree.
pt_pt: Desliga todos os *itens* especificados da árvore.
sv: Avlänk alla angivna *objekt* från trädet.

source: The items and all of their descendants are still present, and may be reinserted at another point in the tree, but will not be displayed.
pt_pt: Os itens e todos os seus descendentes ainda estão presentes e podem ser reinseridos noutro ponto da árvore, mas não serão exibidos.
sv: Objekten och alla deras ättlingar finns fortfarande kvar och kan återinföras på en annan plats i trädet, men de visas inte.

source: The root item may not be detached.
pt_pt: O item raiz não pode ser desligado.
sv: Rotposten får inte lossas.

source: Returns ``True`` if the specified *item* is present in the tree.
pt_pt: Retorna ``True`` se o *item* especificado estiver presente na árvore.
sv: Returnerar ``True`` om det angivna *objektet* finns i trädet.

source: If *item* is specified, sets the focus item to *item*. Otherwise, returns the current focus item, or '' if there is none.
pt_pt: Se *item* for especificado, define o item de foco para *item*. Caso contrário, retorna o item de foco atual, ou '' se não houver nenhum.
sv: Om *item* anges, sätts fokusobjektet till *item*. I annat fall returneras det aktuella fokusobjektet, eller '' om det inte finns något.

source: Query or modify the heading options for the specified *column*.
pt_pt: Consultar ou modificar as opções de cabeçalho para a *coluna* especificada.
sv: Fråga efter eller ändra rubrikalternativen för den angivna *kolumnen*.

source: If *kw* is not given, returns a dict of the heading option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
pt_pt: Se *kw* não for fornecido, retorna um dicionário dos valores das opções de cabeçalho. Se *opção* for especificada, então o valor para essa *opção* é retornado. Caso contrário, define as opções para os valores correspondentes.
sv: Om *kw* inte anges, returneras en dict med rubrikens alternativvärden. Om *option* anges returneras värdet för det *option*. Annars sätts alternativen till motsvarande värden.

source: *text*: text
pt_pt: *texto*: texto

source: The text to display in the column heading.
pt_pt: O texto a exibir no cabeçalho da coluna.
sv: Den text som ska visas i kolumnrubriken.

source: *image*: imageName
pt_pt: *imagem*: nomeImagem

source: Specifies an image to display to the right of the column heading.
pt_pt: Especifica uma imagem a exibir à direita do cabeçalho da coluna.
sv: Anger en bild som ska visas till höger om kolumnrubriken.

source: *anchor*: anchor
pt_pt: *ancora*: ancora
sv: *anchor*: ankare

source: Specifies how the heading text should be aligned. One of the standard Tk anchor values.
pt_pt: Especifica como o texto do cabeçalho deve ser alinhado. Um dos valores de ancora padrão do Tk.
sv: Anger hur rubriktexten ska justeras. Ett av Tk:s standardvärden för ankare.

source: *command*: callback
pt_pt: *comando*: retorno
sv: *kommando*: återuppringning

source: A callback to be invoked when the heading label is pressed.
pt_pt: Um retorno a ser invocado quando a etiqueta do cabeçalho for pressionada.
sv: En återuppringning som aktiveras när rubriketiketten trycks in.

source: To configure the tree column heading, call this with column = "#0".
pt_pt: Para configurar o cabeçalho da coluna da árvore, chame isto com column = "#0".
sv: För att konfigurera trädets kolumnrubrik, kalla detta med column = "#0".

source: Returns a description of the specified *component* under the point given by *x* and *y*, or the empty string if no such *component* is present at that position.
pt_pt: Retorna uma descrição do *componente* especificado sob o ponto dado por *x* e *y*, ou a string vazia se nenhum *componente* estiver presente nessa posição.
sv: Returnerar en beskrivning av den angivna *komponenten* under den punkt som anges av *x* och *y*, eller den tomma strängen om ingen sådan *komponent* finns vid den positionen.

source: Returns the item ID of the item at position *y*.
pt_pt: Retorna o ID do item do item na posição *y*.
sv: Returnerar artikel-ID för artikeln på position *y*.

source: Returns the data column identifier of the cell at position *x*.
pt_pt: Retorna o identificador da coluna de dados da célula na posição *x*.
sv: Returnerar datakolumnidentifieraren för cellen vid position *x*.

source: The tree column has ID #0.
pt_pt: A coluna da árvore tem o ID #0.
sv: Trädkolonnen har ID #0.

source: Returns one of:
pt_pt: Retorna um de:
sv: Returnerar en av:

source: region
pt_pt: região

source: meaning
pt_pt: significado
sv: betydelse

source: heading
pt_pt: cabeçalho
sv: rubriknivå

source: Tree heading area.
pt_pt: Área de cabeçalho da árvore.
sv: Trädhuvudområde.

source: separator
pt_pt: separador
sv: avdelare

source: Space between two columns headings.
pt_pt: Espaço entre dois cabeçalhos de colunas.
sv: Mellanslag mellan två kolumners rubriker.

source: tree
pt_pt: árvore
sv: träd

source: The tree area.
pt_pt: A área da árvore.
sv: Trädområdet.

source: cell
pt_pt: célula

source: A data cell.
pt_pt: Uma célula de dados.
sv: En datacell.

source: Availability: Tk 8.6.
pt_pt: Disponibilidade: Tk 8.6.
sv: Tillgänglighet: Tk 8.6.

source: Returns the element at position *x*, *y*.
pt_pt: Retorna o elemento na posição *x*, *y*.
sv: Returnerar elementet på position *x*, *y*.

source: Returns the integer index of *item* within its parent's list of children.
pt_pt: Retorna o índice inteiro de *item* dentro da lista de filhos do seu pai.
sv: Returnerar heltalsindexet för *item* i dess förälders lista över barn.

source: Creates a new item and returns the item identifier of the newly created item.
pt_pt: Cria um novo item e retorna o identificador do item recém-criado.
sv: Skapar en ny artikel och returnerar artikelidentifieraren för den nyskapade artikeln.

source: *parent* is the item ID of the parent item, or the empty string to create a new top-level item. *index* is an integer, or the value "end", specifying where in the list of parent's children to insert the new item. If *index* is less than or equal to zero, the new node is inserted at the beginning; if *index* is greater than or equal to the current number of children, it is inserted at the end. If *iid* is specified, it is used as the item identifier; *iid* must not already exist in the tree. Otherwise, a new unique identifier is generated.
pt_pt: *parent* é o ID do item pai, ou a string vazia para criar um novo item de nível superior. *index* é um inteiro, ou o valor "end", especificando onde na lista de filhos do pai inserir o novo item. Se *index* for menor ou igual a zero, o novo nó é inserido no início; se *index* for maior ou igual ao número atual de filhos, é inserido no final. Se *iid* for especificado, é usado como o identificador do item; *iid* não deve já existir na árvore. Caso contrário, um novo identificador único é gerado.
sv: *parent* är artikel-ID för den överordnade artikeln, eller den tomma strängen för att skapa en ny artikel på högsta nivån. *index* är ett heltal, eller värdet "end", som anger var i listan över förälderns barn som det nya objektet ska infogas. Om *index* är mindre än eller lika med noll infogas den nya noden i början; om *index* är större än eller lika med det aktuella antalet barn infogas den i slutet. Om *iid* anges används det som objektets identifierare; *iid* får inte redan finnas i trädet. Annars genereras en ny unik identifierare.

source: See `Item Options`_ for the list of available options.
pt_pt: Veja `Opções de Item`_ para a lista de opções disponíveis.
sv: Se `Item Options`_ för en lista över tillgängliga alternativ.

source: Query or modify the options for the specified *item*.
pt_pt: Consultar ou modificar as opções para o *item* especificado.
sv: Fråga efter eller ändra alternativen för den angivna *artikeln*.

source: If no options are given, a dict with options/values for the item is returned. If *option* is specified then the value for that option is returned. Otherwise, sets the options to the corresponding values as given by *kw*.
pt_pt: Se nenhuma opção for dada, um dicionário com opções/valores para o item é retornado. Se *opção* for especificada, então o valor para essa opção é retornado. Caso contrário, define as opções para os valores correspondentes conforme dado por *kw*.
sv: Om inga alternativ anges returneras en dikt med alternativ/värden för objektet. Om *option* anges returneras värdet för det alternativet. I annat fall sätts alternativen till motsvarande värden som anges av *kw*.

source: Moves *item* to position *index* in *parent*'s list of children.
pt_pt: Move *item* para a posição *index* na lista de filhos de *parent*.
sv: Flyttar *item* till position *index* i *parent*:s lista över barn.

source: It is illegal to move an item under one of its descendants. If *index* is less than or equal to zero, *item* is moved to the beginning; if greater than or equal to the number of children, it is moved to the end. If *item* was detached it is reattached.
pt_pt: É ilegal mover um item sob um dos seus descendentes. Se *index* for menor ou igual a zero, *item* é movido para o início; se for maior ou igual ao número de filhos, é movido para o final. Se *item* estava desligado, é religado.
sv: Det är olagligt att flytta ett objekt under en av dess ättlingar. Om *index* är mindre än eller lika med noll flyttas *objektet* till början; om det är större än eller lika med antalet barn flyttas det till slutet. Om *item* var fristående fästs det på nytt.

source: Returns the identifier of *item*'s next sibling, or '' if *item* is the last child of its parent.
pt_pt: Retorna o identificador do próximo irmão de *item*, ou '' se *item* for o último filho do seu pai.
sv: Returnerar identifieraren för *item*:s nästa syskon, eller '' om *item* är det sista barnet till sin förälder.

source: Returns the ID of the parent of *item*, or '' if *item* is at the top level of the hierarchy.
pt_pt: Retorna o ID do pai de *item*, ou '' se *item* estiver no nível superior da hierarquia.
sv: Returnerar ID för föräldern till *item*, eller '' om *item* är på den översta nivån i hierarkin.

source: Returns the identifier of *item*'s previous sibling, or '' if *item* is the first child of its parent.
pt_pt: Retorna o identificador do irmão anterior de *item*, ou '' se *item* for o primeiro filho do seu pai.
sv: Returnerar identifieraren för *item*:s föregående syskon, eller '' om *item* är det första barnet till sin förälder.

source: An alias for :meth:`Treeview.move`.
pt_pt: Um alias para :meth:`Treeview.move`.
sv: Ett alias för :meth:`Treeview.move`.

source: Ensure that *item* is visible.
pt_pt: Garantir que *item* está visível.
sv: Se till att *item* är synligt.

source: Sets all of *item*'s ancestors open option to ``True``, and scrolls the widget if necessary so that *item* is within the visible portion of the tree.
pt_pt: Define a opção open de todos os ancestrais de *item* para ``True`` e rola o widget, se necessário, para que *item* esteja dentro da porção visível da árvore.
sv: Ställer in alla *item*s förfäders öppna alternativ till ``True``, och scrollar widgeten om det behövs så att *item* är inom den synliga delen av trädet.

source: Returns a tuple of selected items.
pt_pt: Retorna um tuplo de itens selecionados.
sv: Returnerar en tupel av valda objekt.

source: ``selection()`` no longer takes arguments. For changing the selection state use the following selection methods.
pt_pt: ``selection()`` já não aceita argumentos. Para alterar o estado de seleção, use os seguintes métodos de seleção.
sv: ``selection()`` tar inte längre emot argument. Använd följande urvalsmetoder för att ändra urvalstillståndet.

source: *items* becomes the new selection.
pt_pt: *itens* torna-se a nova seleção.
sv: *items* blir det nya urvalet.

source: *items* can be passed as separate arguments, not just as a single tuple.
pt_pt: *itens* podem ser passados como argumentos separados, não apenas como um único tuplo.
sv: *items* kan skickas som separata argument, inte bara som en enda tupel.

source: Add *items* to the selection.
pt_pt: Adicionar *itens* à seleção.
sv: Lägg till *artiklar* i urvalet.

source: Remove *items* from the selection.
pt_pt: Remover *itens* da seleção.
sv: Ta bort *objekt* från urvalet.
