Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: pt_pt, sv

source: Create a new element in the current theme, of the given *etype* which is expected to be either "image", "from" or "vsapi". The latter is only available in Tk 8.6 on Windows.
sv: Skapar ett nytt element i det aktuella temat, av den angivna *etypen* som förväntas vara antingen "image", "from" eller "vsapi". Den senare är endast tillgänglig i Tk 8.6 på Windows.

source: If "vsapi" is used as the value of *etype*, :meth:`element_create` will create a new element in the current theme whose visual appearance is drawn using the Microsoft Visual Styles API which is responsible for the themed styles on Windows XP and Vista. *args* is expected to contain the Visual Styles class and part as given in the Microsoft documentation followed by an optional sequence of tuples of ttk states and the corresponding Visual Styles API state value. *kw* may have the following options:
sv: Om "vsapi" används som värde för *etype* kommer :meth:`element_create` att skapa ett nytt element i det aktuella temat vars visuella utseende ritas med hjälp av Microsoft Visual Styles API som ansvarar för temastilarna i Windows XP och Vista. *args* förväntas innehålla Visual Styles-klassen och -delen som anges i Microsoft-dokumentationen följt av en valfri sekvens av tuples av ttk-tillstånd och motsvarande Visual Styles API-tillståndsvärde. *kw* kan ha följande alternativ:

source: Specify the element's interior padding. *padding* is a list of up to four integers specifying the left, top, right and bottom padding quantities respectively. If fewer than four elements are specified, bottom defaults to top, right defaults to left, and top defaults to left. In other words, a list of three numbers specify the left, vertical, and right padding; a list of two numbers specify the horizontal and the vertical padding; a single number specifies the same padding all the way around the widget. This option may not be mixed with any other options.
sv: Ange elementets inre utfyllnad. *padding* är en lista med upp till fyra heltal som anger vänster-, topp-, höger- respektive bottenfyllnadsmängderna. Om färre än fyra element anges är botten standardvärdet för topp, höger standardvärdet för vänster och topp standardvärdet för vänster. Med andra ord anger en lista med tre tal vänster, vertikal och höger utfyllnad; en lista med två tal anger horisontell och vertikal utfyllnad; ett enda tal anger samma utfyllnad hela vägen runt widgeten. Detta alternativ får inte blandas med några andra alternativ.

source: margins=padding
sv: marginaler=utfyllnad

source: Specifies the elements exterior padding. *padding* is a list of up to four integers specifying the left, top, right and bottom padding quantities respectively. This option may not be mixed with any other options.
sv: Anger elementens yttre utfyllnad. *padding* är en lista med upp till fyra heltal som anger vänster-, topp-, höger- respektive bottenfyllnadsmängderna. Detta alternativ får inte blandas med några andra alternativ.

source: Specifies the width for the element. If this option is set then the Visual Styles API will not be queried for the recommended size or the part. If this option is set then *height* should also be set. The *width* and *height* options cannot be mixed with the *padding* or *margins* options.
sv: Anger bredden för elementet. Om det här alternativet anges kommer Visual Styles API inte att tillfrågas om rekommenderad storlek eller del. Om detta alternativ anges bör även *height* anges. Alternativen *width* och *height* kan inte blandas med alternativen *padding* eller *margins*.

source: Specifies the height of the element. See the comments for *width*.
sv: Anger elementets höjd. Se kommentarerna för *width*.

source: Added support of the "vsapi" element factory.
sv: Lagt till stöd för elementfabriken "vsapi".

source: Layouts
sv: Layouter

source: *children*: [sublayout... ]
sv: *children*: [underlayout... ]
