Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: pt_pt, sv

source: :mod:`!tkinter.ttk` --- Tk themed widgets
pt_pt: :mod:`!tkinter.ttk` — Widgets temáticos Tk
sv: :mod:`!tkinter.ttk` --- Widgets med Tk-tema

source: **Source code:** :source:`Lib/tkinter/ttk.py`
pt_pt: **Código-fonte:** :source:`Lib/tkinter/ttk.py`
sv: **Källkod:** :source:`Lib/tkinter/ttk.py`

source: The :mod:`tkinter.ttk` module provides access to the Tk themed widget set, introduced in Tk 8.5. It provides additional benefits including anti-aliased font rendering under X11 and window transparency (requiring a composition window manager on X11).
pt_pt: O módulo :mod:`tkinter.ttk` fornece acesso ao conjunto de widgets temáticos do Tk, introduzido no Tk 8.5. Oferece benefícios adicionais, incluindo renderização de fontes com anti-serrilhado no X11 e transparência de janelas (requer um gestor de composição de janelas no X11).
sv: Modulen :mod:`tkinter.ttk` ger tillgång till Tk:s tematiska widgetuppsättning, som introducerades i Tk 8.5. Den ger ytterligare fördelar, bland annat anti-alias rendering av teckensnitt under X11 och fönstertransparens (kräver en composition window manager på X11).

source: The basic idea for :mod:`tkinter.ttk` is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
pt_pt: A ideia básica do :mod:`tkinter.ttk` é separar, na medida do possível, o código que implementa o comportamento de um widget do código que implementa a sua aparência.
sv: Grundtanken med :mod:`tkinter.ttk` är att i möjligaste mån separera den kod som implementerar en widgets beteende från den kod som implementerar dess utseende.

source: `Tk Widget Styling Support <https://core.tcl.tk/tips/doc/trunk/tip/48.md>`_
pt_pt: `Suporte de Estilização de Widgets Tk <https://core.tcl.tk/tips/doc/trunk/tip/48.md>`_

source: A document introducing theming support for Tk
pt_pt: Um documento que introduz o suporte de temas para Tk
sv: Ett dokument som introducerar temastöd för Tk

source: Using Ttk
pt_pt: A Utilizar Ttk
sv: Använda Ttk

source: To start using Ttk, import its module::
pt_pt: Para começar a usar Ttk, importe o seu módulo:
sv: För att börja använda Ttk importerar du dess modul::

source: To override the basic Tk widgets, the import should follow the Tk import::
pt_pt: Para substituir os widgets básicos do Tk, a importação deve seguir a importação do Tk:
sv: För att åsidosätta de grundläggande Tk-widgetarna bör importen följa Tk-importen::

source: That code causes several :mod:`tkinter.ttk` widgets (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` and :class:`Scrollbar`) to automatically replace the Tk widgets.
pt_pt: Esse código faz com que vários widgets :mod:`tkinter.ttk` (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` e :class:`Scrollbar`) substituam automaticamente os widgets Tk.
sv: Den koden orsakar att flera :mod:`tkinter.ttk` widgetar (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` och :class:`Scrollbar`) att automatiskt ersätta Tk widgetarna.

source: This has the direct benefit of using the new widgets which gives a better look and feel across platforms; however, the replacement widgets are not completely compatible. The main difference is that widget options such as "fg", "bg" and others related to widget styling are no longer present in Ttk widgets. Instead, use the :class:`ttk.Style` class for improved styling effects.
pt_pt: Isto tem o benefício direto de usar os novos widgets que proporcionam uma melhor aparência e sensação em todas as plataformas; no entanto, os widgets de substituição não são completamente compatíveis. A principal diferença é que opções de widgets como "fg", "bg" e outras relacionadas ao estilo do widget não estão mais presentes nos widgets Ttk. Em vez disso, use a classe :class:`ttk.Style` para efeitos de estilo melhorados.
sv: Detta har den direkta fördelen att de nya widgetarna används, vilket ger ett bättre utseende och en bättre känsla på alla plattformar; ersättningswidgetarna är dock inte helt kompatibla. Den största skillnaden är att widgetalternativ som "fg", "bg" och andra relaterade till widgetstyling inte längre finns i Ttk-widgetar. Använd istället :class:`ttk.Style`-klassen för förbättrade stylingeffekter.

source: `Converting existing applications to use Tile widgets <https://tktable.sourceforge.net/tile/doc/converting.txt>`_
pt_pt: `Convertendo aplicações existentes para usar widgets Tile <https://tktable.sourceforge.net/tile/doc/converting.txt>`_
sv: `Konvertera befintliga applikationer till att använda Tile-widgets <https://tktable.sourceforge.net/tile/doc/converting.txt>`_

source: A monograph (using Tcl terminology) about differences typically encountered when moving applications to use the new widgets.
pt_pt: Uma monografia (usando a terminologia Tcl) sobre as diferenças tipicamente encontradas ao mover aplicações para usar os novos widgets.
sv: En monografi (med Tcl-terminologi) om skillnader som vanligtvis uppstår när applikationer flyttas för att använda de nya widgetarna.

source: Ttk Widgets
pt_pt: Widgets Ttk
sv: Ttk-widgetar

source: Ttk comes with 18 widgets, twelve of which already existed in tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar`, and :class:`Spinbox`. The other six are new: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` and :class:`Treeview`. And all them are subclasses of :class:`Widget`.
pt_pt: O Ttk vem com 18 widgets, doze dos quais já existiam no tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar` e :class:`Spinbox`. Os outros seis são novos: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` e :class:`Treeview`. Todos eles são subclasses de :class:`Widget`.
sv: Ttk kommer med 18 widgetar, varav tolv redan fanns i tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar`, och :class:`Spinbox`. De övriga sex är nya: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` och :class:`Treeview`. Och alla dessa är underklasser till :class:`Widget`.

source: Using the Ttk widgets gives the application an improved look and feel. As discussed above, there are differences in how the styling is coded.
pt_pt: A utilização dos widgets Ttk dá à aplicação uma aparência e sensação melhoradas. Como discutido acima, existem diferenças na forma como o estilo é codificado.
sv: Genom att använda Ttk-widgetar får programmet ett bättre utseende och en bättre känsla. Som diskuterats ovan finns det skillnader i hur stylingen kodas.

source: Tk code::
pt_pt: Código Tk:
sv: Tk-kod::

source: l1 = tkinter.Label(text="Test", fg="black", bg="white") l2 = tkinter.Label(text="Test", fg="black", bg="white")
pt_pt: l1 = tkinter.Label(text="Teste", fg="black", bg="white") l2 = tkinter.Label(text="Teste", fg="black", bg="white")

source: Ttk code::
pt_pt: Código Ttk:
sv: Ttk-kod::

source: style = ttk.Style() style.configure("BW.TLabel", foreground="black", background="white") l1 = ttk.Label(text="Test", style="BW.TLabel") l2 = ttk.Label(text="Test", style="BW.TLabel")
pt_pt: style = ttk.Style() style.configure("BW.TLabel", foreground="black", background="white") l1 = ttk.Label(text="Teste", style="BW.TLabel") l2 = ttk.Label(text="Teste", style="BW.TLabel")

source: For more information about TtkStyling_, see the :class:`Style` class documentation.
pt_pt: Para mais informações sobre TtkStyling_, veja a documentação da classe :class:`Style`.
sv: För mer information om TtkStyling_, se :class:`Style`-klassdokumentation.

source: :class:`ttk.Widget` defines standard options and methods supported by Tk themed widgets and is not supposed to be directly instantiated.
pt_pt: :class:`ttk.Widget` define opções e métodos padrão suportados por widgets temáticos Tk e não deve ser instanciado diretamente.
sv: :class:`ttk.Widget` definierar standardalternativ och metoder som stöds av widgets med Tk-tema och är inte avsedda att instansieras direkt.

source: Standard Options
pt_pt: Opções Padrão
sv: Standardalternativ

source: All the :mod:`ttk` Widgets accept the following options:
pt_pt: Todos os Widgets :mod:`ttk` aceitam as seguintes opções:
sv: Alla :mod:`ttk` Widgets accepterar följande alternativ:

source: Option
pt_pt: Opção
sv: Alternativ

source: Description
pt_pt: Descrição
sv: Beskrivning

source: class
pt_pt: classe

source: Specifies the window class. The class is used when querying the option database for the window's other options, to determine the default bindtags for the window, and to select the widget's default layout and style. This option is read-only, and may only be specified when the window is created.
pt_pt: Especifica a classe da janela. A classe é usada ao consultar a base de dados de opções para outras opções da janela, para determinar as etiquetas de ligação predefinidas para a janela e para selecionar o layout e estilo predefinidos do widget. Esta opção é somente de leitura e só pode ser especificada quando a janela é criada.
sv: Anger fönstrets klass. Klassen används när man frågar efter fönstrets andra alternativ i alternativdatabasen, för att bestämma standardbindtaggar för fönstret och för att välja widgetens standardlayout och -stil. Detta alternativ är skrivskyddat och kan endast anges när fönstret skapas.

source: Specifies the mouse cursor to be used for the widget. If set to the empty string (the default), the cursor is inherited for the parent widget.
pt_pt: Especifica o cursor do rato a ser usado para o widget. Se definido como uma string vazia (o predefinido), o cursor é herdado do widget pai.
sv: Anger vilken muspekare som ska användas för widgeten. Om den är inställd på en tom sträng (standard) ärvs muspekaren för den överordnade widgeten.

source: Determines whether the window accepts the focus during keyboard traversal. 0, 1 or an empty string is returned. If 0 is returned, it means that the window should be skipped entirely during keyboard traversal. If 1, it means that the window should receive the input focus as long as it is viewable. And an empty string means that the traversal scripts make the decision about whether or not to focus on the window.
pt_pt: Determina se a janela aceita o foco durante a travessia do teclado. 0, 1 ou uma string vazia é retornado. Se 0 for retornado, significa que a janela deve ser completamente ignorada durante a travessia do teclado. Se 1, significa que a janela deve receber o foco de entrada enquanto estiver visível. E uma string vazia significa que os scripts de travessia decidem se devem ou não focar na janela.
sv: Avgör om fönstret accepterar fokus under tangentbordstraversering. 0, 1 eller en tom sträng returneras. Om 0 returneras betyder det att fönstret ska hoppas över helt och hållet under tangentbordstraversering. Om 1 returneras betyder det att fönstret ska ta emot inmatningsfokus så länge det är synligt. Och en tom sträng innebär att traverseringsskriptet fattar beslut om huruvida fönstret ska fokuseras eller inte.

source: style
pt_pt: estilo

source: May be used to specify a custom widget style.
pt_pt: Pode ser usado para especificar um estilo de widget personalizado.
sv: Kan användas för att ange en anpassad widgetstil.

source: Scrollable Widget Options
pt_pt: Opções de Widgets com Barra de Rolagem
sv: Alternativ för rullbar widget

source: The following options are supported by widgets that are controlled by a scrollbar.
pt_pt: As seguintes opções são suportadas por widgets que são controlados por uma barra de rolagem.
sv: Följande alternativ stöds av widgetar som styrs av en rullningslist.

source: Used to communicate with horizontal scrollbars.
pt_pt: Usado para comunicar com barras de rolagem horizontais.
sv: Används för att kommunicera med horisontella scrollbars.

source: When the view in the widget's window change, the widget will generate a Tcl command based on the scrollcommand.
pt_pt: Quando a vista na janela do widget muda, o widget irá gerar um comando Tcl baseado no scrollcommand.
sv: När vyn i widgetens fönster ändras kommer widgeten att generera ett Tcl-kommando baserat på scrollcommand.

source: Usually this option consists of the method :meth:`Scrollbar.set` of some scrollbar. This will cause the scrollbar to be updated whenever the view in the window changes.
pt_pt: Normalmente, esta opção consiste no método :meth:`Scrollbar.set` de alguma barra de rolagem. Isto fará com que a barra de rolagem seja atualizada sempre que a vista na janela mudar.
sv: Vanligtvis består detta alternativ av metoden :meth:`Scrollbar.set` för en scrollbar. Detta gör att rullningslisten uppdateras varje gång vyn i fönstret ändras.

source: Used to communicate with vertical scrollbars. For some more information, see above.
pt_pt: Usado para comunicar com barras de rolagem verticais. Para mais informações, veja acima.
sv: Används för att kommunicera med vertikala rullningslister. För mer information, se ovan.

source: Label Options
pt_pt: Opções de Etiqueta
sv: Etikettalternativ

source: The following options are supported by labels, buttons and other button-like widgets.
pt_pt: As seguintes opções são suportadas por etiquetas, botões e outros widgets semelhantes a botões.
sv: Följande alternativ stöds av etiketter, knappar och andra knappliknande widgetar.

source: text
pt_pt: texto

source: Specifies a text string to be displayed inside the widget.
pt_pt: Especifica uma string de texto a ser exibida dentro do widget.
sv: Anger en textsträng som ska visas inuti widgeten.

source: Specifies a name whose value will be used in place of the text option resource.
pt_pt: Especifica um nome cujo valor será usado no lugar da opção de recurso de texto.
sv: Anger ett namn vars värde kommer att användas i stället för textalternativresursen.

source: underline
pt_pt: sublinhado

source: If set, specifies the index (0-based) of a character to underline in the text string. The underline character is used for mnemonic activation.
pt_pt: Se definido, especifica o índice (baseado em 0) de um carácter a sublinhar na string de texto. O carácter sublinhado é usado para ativação mnémonica.
sv: Om inställd, anger indexet (0-baserat) för ett tecken som ska understrykas i textsträngen. Det understrukna tecknet används för mnemonisk aktivering.

source: image
pt_pt: imagem

source: Specifies an image to display. This is a list of 1 or more elements. The first element is the default image name. The rest of the list if a sequence of statespec/value pairs as defined by :meth:`Style.map`, specifying different images to use when the widget is in a particular state or a combination of states. All images in the list should have the same size.
pt_pt: Especifica uma imagem para exibir. Isto é uma lista de 1 ou mais elementos. O primeiro elemento é o nome da imagem predefinida. O resto da lista é uma sequência de pares statespec/valor como definido por :meth:`Style.map`, especificando diferentes imagens para usar quando o widget está num estado particular ou numa combinação de estados. Todas as imagens na lista devem ter o mesmo tamanho.
sv: Specificerar en bild som ska visas. Detta är en lista med 1 eller flera element. Det första elementet är standardbildnamnet. Resten av listan är en sekvens av statespec/värdepar enligt definitionen i :meth:`Style.map`, som anger olika bilder som ska användas när widgeten befinner sig i ett visst tillstånd eller en kombination av tillstånd. Alla bilder i listan bör ha samma storlek.

source: compound
pt_pt: composto
sv: förening

source: Specifies how to display the image relative to the text, in the case both text and images options are present. Valid values are:
pt_pt: Especifica como exibir a imagem em relação ao texto, no caso de ambas as opções de texto e imagem estarem presentes. Valores válidos são:
sv: Anger hur bilden ska visas i förhållande till texten, om både text- och bildalternativet finns med. Giltiga värden är:

source: text: display text only
pt_pt: texto: exibir apenas texto
sv: text: endast visa text

source: image: display image only
pt_pt: imagem: exibir apenas imagem
sv: image: endast visa bild

source: top, bottom, left, right: display image above, below, left of, or right of the text, respectively.
pt_pt: topo, fundo, esquerda, direita: exibir imagem acima, abaixo, à esquerda ou à direita do texto, respetivamente.
sv: top, bottom, left, right: visa bilden ovanför, under, till vänster om eller till höger om texten.

source: none: the default. display the image if present, otherwise the text.
pt_pt: nenhum: o predefinido. exibir a imagem se presente, caso contrário o texto.
sv: none: standard. visar bilden om den finns, annars texten.

source: width
pt_pt: largura

source: If greater than zero, specifies how much space, in character widths, to allocate for the text label, if less than zero, specifies a minimum width. If zero or unspecified, the natural width of the text label is used.
pt_pt: Se maior que zero, especifica quanto espaço, em larguras de carácter, alocar para a etiqueta de texto; se menor que zero, especifica uma largura mínima. Se zero ou não especificado, a largura natural da etiqueta de texto é usada.
sv: Om större än noll, anger hur mycket utrymme, i teckenbredd, som ska tilldelas för textetiketten, om mindre än noll, anger en minsta bredd. Om noll eller ospecificerat används den naturliga bredden på textetiketten.

source: Compatibility Options
pt_pt: Opções de Compatibilidade
sv: Kompatibilitetsalternativ

source: state
pt_pt: estado

source: May be set to "normal" or "disabled" to control the "disabled" state bit. This is a write-only option: setting it changes the widget state, but the :meth:`Widget.state` method does not affect this option.
pt_pt: Pode ser definido como "normal" ou "desativado" para controlar o bit de estado "desativado". Esta é uma opção apenas de escrita: defini-la altera o estado do widget, mas o método :meth:`Widget.state` não afeta esta opção.
sv: Kan sättas till "normal" eller "disabled" för att styra "disabled"-tillståndsbiten. Det här är ett skrivskyddat alternativ: om du ställer in det ändras widgetens tillstånd, men metoden :meth:`Widget.state` påverkar inte det här alternativet.

source: Widget States
pt_pt: Estados do Widget
sv: Widget-tillstånd

source: The widget state is a bitmap of independent state flags.
pt_pt: O estado do widget é um mapa de bits de sinalizadores de estado independentes.
sv: Widgetens tillstånd är en bitmapp med oberoende tillståndsflaggor.

source: active
pt_pt: ativo

source: The mouse cursor is over the widget and pressing a mouse button will cause some action to occur
pt_pt: O cursor do rato está sobre o widget e pressionar um botão do rato causará alguma ação
sv: Muspekaren är över widgeten och om du trycker på en musknapp kommer någon åtgärd att utföras

source: disabled
pt_pt: desativado

source: Widget is disabled under program control
pt_pt: O widget está desativado sob controlo do programa
sv: Widget är inaktiverad under programkontroll

source: focus
pt_pt: foco

source: Widget has keyboard focus
pt_pt: O widget tem o foco do teclado
sv: Widget har fokus på tangentbordet

source: pressed
pt_pt: pressionado

source: Widget is being pressed
pt_pt: O widget está a ser pressionado
sv: Widget trycks in

source: selected
pt_pt: selecionado

source: "On", "true", or "current" for things like Checkbuttons and radiobuttons
pt_pt: "Ligado", "verdadeiro", ou "atual" para coisas como Checkbuttons e radiobuttons
sv: "On", "true" eller "current" för t.ex. checkbuttons och radiobuttons

source: background
pt_pt: fundo

source: Windows and Mac have a notion of an "active" or foreground window. The *background* state is set for widgets in a background window, and cleared for those in the foreground window
pt_pt: Windows e Mac têm a noção de uma janela "ativa" ou em primeiro plano. O estado *fundo* é definido para widgets numa janela de fundo e limpo para aqueles numa janela em primeiro plano.
sv: Windows och Mac har en uppfattning om ett "aktivt" eller förgrundsfönster. Tillståndet *bakgrund* sätts för widgetar i ett bakgrundsfönster och rensas för dem i förgrundsfönstret

source: readonly
pt_pt: somente leitura
sv: skrivskyddad

source: Widget should not allow user modification
pt_pt: O widget não deve permitir modificação pelo utilizador
sv: Widget ska inte tillåta användarändring

source: alternate
pt_pt: alternado

source: A widget-specific alternate display format
pt_pt: Um formato de exibição alternativo específico do widget
sv: Ett widgetspecifikt alternativt visningsformat

source: invalid
pt_pt: inválido

source: The widget's value is invalid
pt_pt: O valor do widget é inválido
sv: Widgetens värde är ogiltigt

source: A state specification is a sequence of state names, optionally prefixed with an exclamation point indicating that the bit is off.
pt_pt: Uma especificação de estado é uma sequência de nomes de estado, opcionalmente prefixados com um ponto de exclamação indicando que o bit está desligado.
sv: En tillståndsspecifikation är en sekvens av tillståndsnamn, eventuellt föregångna av ett utropstecken som anger att biten är av.

source: Besides the methods described below, the :class:`ttk.Widget` supports the methods :meth:`tkinter.Widget.cget` and :meth:`tkinter.Widget.configure`.
pt_pt: Além dos métodos descritos abaixo, o :class:`ttk.Widget` suporta os métodos :meth:`tkinter.Widget.cget` e :meth:`tkinter.Widget.configure`.
sv: Förutom de metoder som beskrivs nedan stöder :class:`ttk.Widget` metoderna :meth:`tkinter.Widget.cget` och :meth:`tkinter.Widget.configure`.

source: Returns the name of the element at position *x* *y*, or the empty string if the point does not lie within any element.
pt_pt: Retorna o nome do elemento na posição *x* *y*, ou a string vazia se o ponto não estiver dentro de nenhum elemento.
sv: Returnerar namnet på elementet vid position *x* *y*, eller den tomma strängen om punkten inte ligger inom något element.

source: *x* and *y* are pixel coordinates relative to the widget.
pt_pt: *x* e *y* são coordenadas de píxeis relativas ao widget.
sv: *x* och *y* är pixelkoordinater i förhållande till widgeten.

source: Test the widget's state. If a callback is not specified, returns ``True`` if the widget state matches *statespec* and ``False`` otherwise. If callback is specified then it is called with args if widget state matches *statespec*.
pt_pt: Testa o estado do widget. Se uma função de retorno não for especificada, retorna ``True`` se o estado do widget corresponder a *statespec* e ``False`` caso contrário. Se a função de retorno for especificada, então é chamada com args se o estado do widget corresponder a *statespec*.
sv: Testar widgetens tillstånd. Om inget callback anges returneras ``True`` om widgetens tillstånd matchar *statespec* och ``False`` annars. Om callback anges anropas den med args om widgetens tillstånd matchar *statespec*.
