Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: pt_pt, sv

source: Modify or inquire widget state. If *statespec* is specified, sets the widget state according to it and return a new *statespec* indicating which flags were changed. If *statespec* is not specified, returns the currently enabled state flags.
pt_pt: Modifica ou consulta o estado do widget. Se *statespec* for especificado, define o estado do widget de acordo com ele e retorna um novo *statespec* indicando quais sinalizadores foram alterados. Se *statespec* não for especificado, retorna os sinalizadores de estado atualmente ativados.
sv: Modifiera eller fråga om widgetens tillstånd. Om *statespec* anges, ändras widgetens tillstånd enligt specifikationen och en ny *statespec* returneras som anger vilka flaggor som ändrats. Om *statespec* inte specificeras returneras de för närvarande aktiverade tillståndsflaggorna.

source: *statespec* will usually be a list or a tuple.
pt_pt: *statespec* geralmente será uma lista ou um tuplo.
sv: *statespec* är vanligtvis en lista eller en tupel.

source: The :class:`ttk.Combobox` widget combines a text field with a pop-down list of values. This widget is a subclass of :class:`Entry`.
pt_pt: O widget :class:`ttk.Combobox` combina um campo de texto com uma lista suspensa de valores. Este widget é uma subclasse de :class:`Entry`.
sv: Widgeten :class:`ttk.Combobox` kombinerar ett textfält med en popup-lista med värden. Denna widget är en underklass till :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Combobox`.
pt_pt: Além dos métodos herdados de :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` e :meth:`Widget.state`, e os seguintes herdados de :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, tem alguns outros métodos, descritos em :class:`ttk.Combobox`.
sv: Förutom de metoder som ärvts från :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` och :meth:`Widget.state`, och följande som ärvts från :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, den har några andra metoder, beskrivs i :class:`ttk.Combobox`.

source: Options
pt_pt: Opções
sv: Alternativ

source: This widget accepts the following specific options:
pt_pt: Este widget aceita as seguintes opções específicas:
sv: Denna widget accepterar följande specifika alternativ:

source: Boolean value. If set, the widget selection is linked to the Window Manager selection (which can be returned by invoking Misc.selection_get, for example).
pt_pt: Valor booleano. Se definido, a seleção do widget está ligada à seleção do Gestor de Janelas (que pode ser retornada invocando Misc.selection_get, por exemplo).
sv: Boolean värde. Om värdet är inställt är widgetvalet kopplat till Window Manager-valet (som kan returneras genom att till exempel anropa Misc.selection_get).

source: justify
pt_pt: justificar

source: Specifies how the text is aligned within the widget. One of "left", "center", or "right".
pt_pt: Especifica como o texto é alinhado dentro do widget. Um de "esquerda", "centro" ou "direita".
sv: Anger hur texten ska riktas in i widgeten. Ett av alternativen "left", "center" eller "right".

source: height
pt_pt: altura

source: Specifies the height of the pop-down listbox, in rows.
pt_pt: Especifica a altura da lista suspensa, em linhas.
sv: Anger höjden på popup-listboxen, i rader.

source: A script (possibly registered with Misc.register) that is called immediately before displaying the values. It may specify which values to display.
pt_pt: Um script (possivelmente registado com Misc.register) que é chamado imediatamente antes de exibir os valores. Pode especificar quais valores exibir.
sv: Ett skript (eventuellt registrerat med Misc.register) som anropas omedelbart innan värdena visas. Det kan ange vilka värden som ska visas.

source: One of "normal", "readonly", or "disabled". In the "readonly" state, the value may not be edited directly, and the user can only selection of the values from the dropdown list. In the "normal" state, the text field is directly editable. In the "disabled" state, no interaction is possible.
pt_pt: Um de "normal", "somente leitura" ou "desativado". No estado "somente leitura", o valor não pode ser editado diretamente, e o utilizador só pode selecionar os valores da lista suspensa. No estado "normal", o campo de texto é diretamente editável. No estado "desativado", nenhuma interação é possível.
sv: Ett av alternativen "normal", "readonly" eller "disabled". I läget "readonly" kan värdet inte redigeras direkt, och användaren kan bara välja värden från rullgardinslistan. I "normal"-läget är textfältet direkt redigerbart. I det "inaktiverade" läget är ingen interaktion möjlig.

source: Specifies a name whose value is linked to the widget value. Whenever the value associated with that name changes, the widget value is updated, and vice versa. See :class:`tkinter.StringVar`.
pt_pt: Especifica um nome cujo valor está ligado ao valor do widget. Sempre que o valor associado a esse nome mudar, o valor do widget é atualizado, e vice-versa. Veja :class:`tkinter.StringVar`.
sv: Anger ett namn vars värde är kopplat till widgetens värde. När värdet som associeras med namnet ändras, uppdateras widgetens värde och vice versa. Se :klass:`tkinter.StringVar`.

source: values
pt_pt: valores
sv: värden

source: Specifies the list of values to display in the drop-down listbox.
pt_pt: Especifica a lista de valores a exibir na lista suspensa.
sv: Anger listan med värden som ska visas i listrutan.

source: Specifies an integer value indicating the desired width of the entry window, in average-size characters of the widget's font.
pt_pt: Especifica um valor inteiro indicando a largura desejada da janela de entrada, em caracteres de tamanho médio da fonte do widget.
sv: Anger ett heltal som anger den önskade bredden på inmatningsfönstret, i tecken av genomsnittlig storlek i widgetens typsnitt.

source: Virtual events
pt_pt: Eventos virtuais
sv: Virtuella händelser

source: The combobox widgets generates a **<<ComboboxSelected>>** virtual event when the user selects an element from the list of values.
pt_pt: Os widgets combobox geram um evento virtual **<<ComboboxSelected>>** quando o utilizador seleciona um elemento da lista de valores.
sv: Combobox-widgetarna genererar en **&lt;<ComboboxSelected>&gt;** virtuell händelse när användaren väljer ett element från listan med värden.

source: If *newindex* is specified, sets the combobox value to the element position *newindex*. Otherwise, returns the index of the current value or -1 if the current value is not in the values list.
pt_pt: Se *newindex* for especificado, define o valor do combobox para a posição do elemento *newindex*. Caso contrário, retorna o índice do valor atual ou -1 se o valor atual não estiver na lista de valores.
sv: Om *newindex* anges sätts combobox-värdet till elementpositionen *newindex*. I annat fall returneras indexet för det aktuella värdet eller -1 om det aktuella värdet inte finns i värdelistan.

source: Returns the current value of the combobox.
pt_pt: Retorna o valor atual do combobox.
sv: Returnerar det aktuella värdet för kombinationsrutan.

source: Sets the value of the combobox to *value*.
pt_pt: Define o valor do combobox para *value*.
sv: Ställer in värdet på kombinationsrutan till *värde*.

source: The :class:`ttk.Spinbox` widget is a :class:`ttk.Entry` enhanced with increment and decrement arrows. It can be used for numbers or lists of string values. This widget is a subclass of :class:`Entry`.
pt_pt: O widget :class:`ttk.Spinbox` é um :class:`ttk.Entry` melhorado com setas de incremento e decremento. Pode ser usado para números ou listas de valores de string. Este widget é uma subclasse de :class:`Entry`.
sv: Widgeten :class:`ttk.Spinbox` är en :class:`ttk.Entry` som har utökats med pilar för ökning och minskning. Den kan användas för siffror eller listor med strängvärden. Denna widget är en underklass till :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Spinbox`.
pt_pt: Além dos métodos herdados de :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` e :meth:`Widget.state`, e os seguintes herdados de :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, tem alguns outros métodos, descritos em :class:`ttk.Spinbox`.
sv: Förutom de metoder som ärvts från :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` och :meth:`Widget.state`, och följande som ärvts från :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, den har några andra metoder, som beskrivs i :class:`ttk.Spinbox`.

source: from
pt_pt: de

source: Float value. If set, this is the minimum value to which the decrement button will decrement. Must be spelled as ``from_`` when used as an argument, since ``from`` is a Python keyword.
pt_pt: Valor flutuante. Se definido, este é o valor mínimo para o qual o botão de decremento irá decrementar. Deve ser escrito como ``from_`` quando usado como argumento, uma vez que ``from`` é uma palavra-chave do Python.
sv: Flytande värde. Om värdet är inställt är detta det lägsta värde som decrement-knappen kommer att decremera till. Måste stavas som ``from_`` när det används som argument, eftersom ``from`` är ett Python-nyckelord.

source: to
pt_pt: para
sv: till

source: Float value. If set, this is the maximum value to which the increment button will increment.
pt_pt: Valor flutuante. Se definido, este é o valor máximo para o qual o botão de incremento irá incrementar.
sv: Flytande värde. Om det är inställt är detta det maximala värde som inkrementeringsknappen kommer att inkrementera till.

source: increment
pt_pt: incremento

source: Float value. Specifies the amount which the increment/decrement buttons change the value. Defaults to 1.0.
pt_pt: Valor flutuante. Especifica a quantidade que os botões de incremento/decremento alteram o valor. O predefinido é 1.0.
sv: Flytande värde. Anger det belopp som knapparna för ökning/minskning ändrar värdet med. Standardvärdet är 1,0.

source: Sequence of string or float values. If specified, the increment/decrement buttons will cycle through the items in this sequence rather than incrementing or decrementing numbers.
pt_pt: Sequência de valores de string ou flutuantes. Se especificado, os botões de incremento/decremento irão percorrer os itens nesta sequência em vez de incrementar ou decrementar números.
sv: Sekvens av sträng- eller floatvärden. Om detta anges kommer knapparna för inkrementering/dekrementering att bläddra igenom objekten i sekvensen i stället för att inkrementera eller dekrementera siffror.

source: wrap
pt_pt: enrolar

source: Boolean value. If ``True``, increment and decrement buttons will cycle from the ``to`` value to the ``from`` value or the ``from`` value to the ``to`` value, respectively.
pt_pt: Valor booleano. Se ``True``, os botões de incremento e decremento irão percorrer do valor ``to`` para o valor ``from`` ou do valor ``from`` para o valor ``to``, respetivamente.
sv: Booleanskt värde. Om ``True``, kommer knapparna för ökning och minskning att cykla från ``to``-värdet till ``from``-värdet respektive ``from``-värdet till ``to``-värdet.

source: format
pt_pt: formato

source: String value. This specifies the format of numbers set by the increment/decrement buttons. It must be in the form "%W.Pf", where W is the padded width of the value, P is the precision, and '%' and 'f' are literal.
pt_pt: Valor de string. Isto especifica o formato dos números definidos pelos botões de incremento/decremento. Deve estar na forma "%W.Pf", onde W é a largura preenchida do valor, P é a precisão, e '%' e 'f' são literais.
sv: Strängvärde. Detta anger formatet för de tal som anges med knapparna för ökning/minskning. Det måste vara i formen "%W.Pf", där W är den utfyllda bredden på värdet, P är precisionen och "%" och "f" är bokstavliga.

source: command
pt_pt: comando

source: Python callable. Will be called with no arguments whenever either of the increment or decrement buttons are pressed.
pt_pt: Chamável Python. Será chamado sem argumentos sempre que qualquer um dos botões de incremento ou decremento for pressionado.
sv: Python-kallbar. Anropas utan argument när någon av knapparna för ökning eller minskning trycks in.

source: The spinbox widget generates an **<<Increment>>** virtual event when the user presses <Up>, and a **<<Decrement>>** virtual event when the user presses <Down>.
pt_pt: O widget spinbox gera um evento virtual **<<Increment>>** quando o utilizador pressiona <Up>, e um evento virtual **<<Decrement>>** quando o utilizador pressiona <Down>.
sv: Spinbox-widgeten genererar en **&lt;<Increment>&gt;** virtuell händelse när användaren trycker på <Up>, och en **&lt;<Decrement>&gt;** virtuell händelse när användaren trycker på <Down>.

source: Returns the current value of the spinbox.
pt_pt: Retorna o valor atual do spinbox.
sv: Returnerar det aktuella värdet för spinboxen.

source: Sets the value of the spinbox to *value*.
pt_pt: Define o valor do spinbox para *value*.
sv: Ställer in värdet på spinboxen till *värde*.

source: Notebook
pt_pt: Caderno
sv: Laptop

source: Ttk Notebook widget manages a collection of windows and displays a single one at a time. Each child window is associated with a tab, which the user may select to change the currently displayed window.
pt_pt: O widget Ttk Notebook gere uma coleção de janelas e exibe uma de cada vez. Cada janela filha está associada a um separador, que o utilizador pode selecionar para alterar a janela atualmente exibida.
sv: Ttk Notebook widget hanterar en samling fönster och visar ett enda åt gången. Varje underordnat fönster är associerat med en flik som användaren kan välja för att ändra det fönster som visas.

source: If present and greater than zero, specifies the desired height of the pane area (not including internal padding or tabs). Otherwise, the maximum height of all panes is used.
pt_pt: Se presente e maior que zero, especifica a altura desejada da área do painel (não incluindo preenchimento interno ou separadores). Caso contrário, a altura máxima de todos os painéis é usada.
sv: Om den finns och är större än noll, anger den önskade höjden på rutområdet (exklusive intern utfyllnad eller flikar). I annat fall används den maximala höjden för alla rutor.

source: padding
pt_pt: preenchimento

source: Specifies the amount of extra space to add around the outside of the notebook. The padding is a list up to four length specifications left top right bottom. If fewer than four elements are specified, bottom defaults to top, right defaults to left, and top defaults to left.
pt_pt: Especifica a quantidade de espaço extra a adicionar em torno do exterior do caderno. O preenchimento é uma lista de até quatro especificações de comprimento: esquerda, topo, direita, fundo. Se forem especificados menos de quatro elementos, o fundo assume o valor do topo, a direita assume o valor da esquerda e o topo assume o valor da esquerda.
sv: Anger hur mycket extra utrymme som ska läggas till runt utsidan av den bärbara datorn. Utfyllnaden är en lista med upp till fyra längdangivelser left top right bottom. Om färre än fyra element anges är bottom standardvärde för top, right standardvärde för left och top standardvärde för left.

source: If present and greater than zero, specified the desired width of the pane area (not including internal padding). Otherwise, the maximum width of all panes is used.
pt_pt: Se presente e maior que zero, especifica a largura desejada da área do painel (não incluindo preenchimento interno). Caso contrário, a largura máxima de todos os painéis é usada.
sv: Om den finns och är större än noll, anges den önskade bredden på rutans område (exklusive intern utfyllnad). I annat fall används den maximala bredden för alla rutor.

source: Tab Options
pt_pt: Opções do Separador
sv: Flikalternativ

source: There are also specific options for tabs:
pt_pt: Existem também opções específicas para separadores:
sv: Det finns också specifika alternativ för flikar:

source: Either "normal", "disabled" or "hidden". If "disabled", then the tab is not selectable. If "hidden", then the tab is not shown.
pt_pt: Ou "normal", "desativado" ou "oculto". Se "desativado", então o separador não é selecionável. Se "oculto", então o separador não é mostrado.
sv: Antingen "normal", "disabled" eller "hidden". Om "disabled", är fliken inte valbar. Om den är "hidden" visas inte fliken.

source: sticky
pt_pt: fixo

source: Specifies how the child window is positioned within the pane area. Value is a string containing zero or more of the characters "n", "s", "e" or "w". Each letter refers to a side (north, south, east or west) that the child window will stick to, as per the :meth:`grid` geometry manager.
pt_pt: Especifica como a janela filha é posicionada dentro da área do painel. O valor é uma string contendo zero ou mais dos caracteres "n", "s", "e" ou "w". Cada letra refere-se a um lado (norte, sul, leste ou oeste) ao qual a janela filha ficará fixa, conforme o gestor de geometria :meth:`grid`.
sv: Anger hur det underordnade fönstret ska placeras inom fönsterområdet. Värdet är en sträng som innehåller noll eller fler av tecknen "n", "s", "e" eller "w". Varje bokstav hänvisar till en sida (norr, söder, öster eller väster) som det underordnade fönstret kommer att hålla sig till, enligt geometrihanteraren :meth:`grid`.

source: Specifies the amount of extra space to add between the notebook and this pane. Syntax is the same as for the option padding used by this widget.
pt_pt: Especifica a quantidade de espaço extra a adicionar entre o caderno e este painel. A sintaxe é a mesma que a opção de preenchimento usada por este widget.
sv: Anger hur mycket extra utrymme som ska läggas till mellan anteckningsboken och den här rutan. Syntaxen är densamma som för alternativet padding som används av denna widget.

source: Specifies a text to be displayed in the tab.
pt_pt: Especifica um texto a ser exibido no separador.
sv: Anger en text som ska visas i fliken.

source: Specifies an image to display in the tab. See the option image described in :class:`Widget`.
pt_pt: Especifica uma imagem a exibir no separador. Veja a opção de imagem descrita em :class:`Widget`.
sv: Anger en bild som ska visas i fliken. Se alternativet bild som beskrivs i :class:`Widget`.

source: Specifies how to display the image relative to the text, in the case both options text and image are present. See `Label Options`_ for legal values.
pt_pt: Especifica como exibir a imagem em relação ao texto, no caso de ambas as opções de texto e imagem estarem presentes. Veja `Opções de Etiqueta`_ para valores legais.
sv: Anger hur bilden ska visas i förhållande till texten, om både alternativen text och bild finns med. Se `Label Options`_ för lagliga värden.

source: Specifies the index (0-based) of a character to underline in the text string. The underlined character is used for mnemonic activation if :meth:`Notebook.enable_traversal` is called.
pt_pt: Especifica o índice (baseado em 0) de um carácter a sublinhar na string de texto. O carácter sublinhado é usado para ativação mnémonica se :meth:`Notebook.enable_traversal` for chamado.
sv: Anger index (0-baserat) för ett tecken som ska understrykas i textsträngen. Det understrukna tecknet används för mnemonisk aktivering om :meth:`Notebook.enable_traversal` anropas.

source: Tab Identifiers
pt_pt: Identificadores de Separador
sv: Flikidentifierare

source: The tab_id present in several methods of :class:`ttk.Notebook` may take any of the following forms:
pt_pt: O tab_id presente em vários métodos de :class:`ttk.Notebook` pode assumir qualquer uma das seguintes formas:
sv: Tab_id som finns i flera metoder i :class:`ttk.Notebook` kan ha någon av följande former:

source: An integer between zero and the number of tabs
pt_pt: Um inteiro entre zero e o número de separadores
sv: Ett heltal mellan noll och antalet flikar

source: The name of a child window
pt_pt: O nome de uma janela filha
sv: Namnet på ett underordnat fönster

source: A positional specification of the form "@x,y", which identifies the tab
pt_pt: Uma especificação posicional da forma "@x,y", que identifica o separador
sv: En positionsangivelse av formen "@x,y", som identifierar fliken

source: The literal string "current", which identifies the currently selected tab
pt_pt: A string literal "current", que identifica o separador atualmente selecionado
sv: Den bokstavliga strängen "current", som identifierar den flik som är markerad för tillfället

source: The literal string "end", which returns the number of tabs (only valid for :meth:`Notebook.index`)
pt_pt: A string literal "end", que retorna o número de separadores (válido apenas para :meth:`Notebook.index`)
sv: Den bokstavliga strängen "end", som returnerar antalet flikar (endast giltig för :meth:`Notebook.index`)

source: Virtual Events
pt_pt: Eventos Virtuais
sv: Virtuella evenemang

source: This widget generates a **<<NotebookTabChanged>>** virtual event after a new tab is selected.
pt_pt: Este widget gera um evento virtual **<<NotebookTabChanged>>** após um novo separador ser selecionado.
sv: Denna widget genererar en **&lt;<NotebookTabChanged>&gt;** virtuell händelse efter att en ny flik har valts.

source: Adds a new tab to the notebook.
pt_pt: Adiciona um novo separador ao caderno.
sv: Lägger till en ny flik i anteckningsboken.

source: If window is currently managed by the notebook but hidden, it is restored to its previous position.
pt_pt: Se a janela estiver atualmente gerida pelo caderno, mas oculta, é restaurada para a sua posição anterior.
sv: Om fönstret för närvarande hanteras av den bärbara datorn men är dolt, återställs det till sin tidigare position.

source: See `Tab Options`_ for the list of available options.
pt_pt: Veja `Opções do Separador`_ para a lista de opções disponíveis.
sv: Se `Tab Options`_ för en lista över tillgängliga alternativ.

source: Removes the tab specified by *tab_id*, unmaps and unmanages the associated window.
pt_pt: Remove o separador especificado por *tab_id*, desmapeia e deixa de gerir a janela associada.
sv: Tar bort den flik som anges av *tab_id*, avmapsar och avhanterar det associerade fönstret.

source: Hides the tab specified by *tab_id*.
pt_pt: Oculta o separador especificado por *tab_id*.
sv: Döljer den flik som anges av *tab_id*.
