Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: pt_pt, sv

source: The tab will not be displayed, but the associated window remains managed by the notebook and its configuration remembered. Hidden tabs may be restored with the :meth:`add` command.
pt_pt: O separador não será exibido, mas a janela associada permanece gerida pelo caderno e a sua configuração é lembrada. Separadores ocultos podem ser restaurados com o comando :meth:`add`.
sv: Fliken kommer inte att visas, men det associerade fönstret kommer att hanteras av notebook och dess konfiguration kommer att sparas. Dolda flikar kan återställas med kommandot :meth:`add`.

source: Returns the name of the tab element at position *x*, *y*, or the empty string if none.
pt_pt: Retorna o nome do elemento do separador na posição *x*, *y*, ou a string vazia se não houver nenhum.
sv: Returnerar namnet på tabb-elementet på position *x*, *y*, eller den tomma strängen om det inte finns något.

source: Returns the numeric index of the tab specified by *tab_id*, or the total number of tabs if *tab_id* is the string "end".
pt_pt: Retorna o índice numérico do separador especificado por *tab_id*, ou o número total de separadores se *tab_id* for a string "end".
sv: Returnerar det numeriska indexet för den flik som anges av *tab_id*, eller det totala antalet flikar om *tab_id* är strängen "end".

source: Inserts a pane at the specified position.
pt_pt: Insere um painel na posição especificada.
sv: Infogar en ruta på den angivna positionen.

source: *pos* is either the string "end", an integer index, or the name of a managed child. If *child* is already managed by the notebook, moves it to the specified position.
pt_pt: *pos* é ou a string "end", um índice inteiro, ou o nome de uma filha gerida. Se *child* já estiver gerido pelo caderno, move-o para a posição especificada.
sv: *pos* är antingen strängen "end", ett heltalsindex eller namnet på ett hanterat barn. Om *child* redan hanteras av notebook flyttas det till den angivna positionen.

source: Selects the specified *tab_id*.
pt_pt: Selecciona o *tab_id* especificado.
sv: Väljer den angivna *tab_id*.

source: The associated child window will be displayed, and the previously selected window (if different) is unmapped. If *tab_id* is omitted, returns the widget name of the currently selected pane.
pt_pt: A janela filha associada será exibida, e a janela selecionada anteriormente (se diferente) é desmapeada. Se *tab_id* for omitido, retorna o nome do widget do painel atualmente selecionado.
sv: Det associerade underordnade fönstret visas och det tidigare valda fönstret (om det är ett annat) avmappas. Om *tab_id* inte anges returneras widgetnamnet för den aktuella valda rutan.

source: Query or modify the options of the specific *tab_id*.
pt_pt: Consulta ou modifica as opções do *tab_id* específico.
sv: Fråga efter eller ändra alternativen för den specifika *tab_id*.

source: If *kw* is not given, returns a dictionary of the tab option values. If *option* is specified, returns the value of that *option*. Otherwise, sets the options to the corresponding values.
pt_pt: Se *kw* não for fornecido, retorna um dicionário dos valores das opções do separador. Se *option* for especificado, retorna o valor dessa *option*. Caso contrário, define as opções para os valores correspondentes.
sv: Om *kw* inte anges, returneras en ordbok med värden för flikalternativ. Om *option* anges, returneras värdet för det *option*. I annat fall sätts alternativen till motsvarande värden.

source: Returns a list of windows managed by the notebook.
pt_pt: Retorna uma lista de janelas geridas pelo caderno.
sv: Returnerar en lista över fönster som hanteras av den bärbara datorn.

source: Enable keyboard traversal for a toplevel window containing this notebook.
pt_pt: Ativar a travessia do teclado para uma janela de nível superior contendo este caderno.
sv: Aktivera tangentbordstraversering för ett toplevel-fönster som innehåller denna anteckningsbok.

source: This will extend the bindings for the toplevel window containing the notebook as follows:
pt_pt: Isto irá estender as ligações para a janela de nível superior que contém o caderno da seguinte forma:
sv: Detta kommer att utöka bindningarna för fönstret på översta nivån som innehåller anteckningsboken enligt följande:

source: :kbd:`Control-Tab`: selects the tab following the currently selected one.
pt_pt: :kbd:`Control-Tab`: seleciona o separador seguinte ao atualmente selecionado.
sv: :kbd:`Control-Tab`: väljer fliken efter den flik som för närvarande är vald.

source: :kbd:`Shift-Control-Tab`: selects the tab preceding the currently selected one.
pt_pt: :kbd:`Shift-Control-Tab`: seleciona o separador anterior ao atualmente selecionado.
sv: :kbd:`Shift-Control-Tab`: väljer den flik som föregår den flik som för närvarande är vald.

source: :kbd:`Alt-K`: where *K* is the mnemonic (underlined) character of any tab, will select that tab.
pt_pt: :kbd:`Alt-K`: onde *K* é o carácter mnemonico (sublinhado) de qualquer separador, irá selecionar esse separador.
sv: :kbd:`Alt-K`: där *K* är det mnemoniska (understrukna) tecknet för en flik, kommer att välja den fliken.

source: Multiple notebooks in a single toplevel may be enabled for traversal, including nested notebooks. However, notebook traversal only works properly if all panes have the notebook they are in as master.
pt_pt: Vários cadernos numa única janela de nível superior podem ser ativados para travessia, incluindo cadernos aninhados. No entanto, a travessia de cadernos só funciona corretamente se todos os painéis tiverem o caderno em que estão como mestre.
sv: Flera anteckningsböcker i en och samma toppnivå kan aktiveras för genomgång, inklusive nästlade anteckningsböcker. Traversering av anteckningsböcker fungerar dock bara korrekt om alla rutor har den anteckningsbok de befinner sig i som master.

source: Progressbar
pt_pt: Barra de Progresso

source: The :class:`ttk.Progressbar` widget shows the status of a long-running operation. It can operate in two modes: 1) the determinate mode which shows the amount completed relative to the total amount of work to be done and 2) the indeterminate mode which provides an animated display to let the user know that work is progressing.
pt_pt: O widget :class:`ttk.Progressbar` mostra o estado de uma operação de longa duração. Pode operar em dois modos: 1) o modo determinístico que mostra a quantidade concluída em relação à quantidade total de trabalho a ser feito e 2) o modo indeterminado que fornece uma exibição animada para informar o utilizador que o trabalho está a progredir.
sv: Widgeten :class:`ttk.Progressbar` visar status för en långvarig operation. Den kan fungera i två lägen: 1) det bestämda läget som visar hur mycket som är klart i förhållande till den totala mängden arbete som ska göras och 2) det obestämda läget som ger en animerad visning för att låta användaren veta att arbetet fortskrider.

source: orient
pt_pt: orientação

source: One of "horizontal" or "vertical". Specifies the orientation of the progress bar.
pt_pt: Um de "horizontal" ou "vertical". Especifica a orientação da barra de progresso.
sv: Ett av alternativen "horisontell" eller "vertikal". Anger förloppsindikatorns orientering.

source: length
pt_pt: comprimento

source: Specifies the length of the long axis of the progress bar (width if horizontal, height if vertical).
pt_pt: Especifica o comprimento do eixo longo da barra de progresso (largura se horizontal, altura se vertical).
sv: Anger längden på förloppsindikatorns långa axel (bredd om den är horisontell, höjd om den är vertikal).

source: mode
pt_pt: modo
sv: läge

source: One of "determinate" or "indeterminate".
pt_pt: Um de "determinado" ou "indeterminado".
sv: En av "determinate" eller "indeterminate".

source: maximum
pt_pt: máximo

source: A number specifying the maximum value. Defaults to 100.
pt_pt: Um número que especifica o valor máximo. O predefinido é 100.
sv: Ett tal som anger det maximala värdet. Standardvärdet är 100.

source: value
pt_pt: valor
sv: värde

source: The current value of the progress bar. In "determinate" mode, this represents the amount of work completed. In "indeterminate" mode, it is interpreted as modulo *maximum*; that is, the progress bar completes one "cycle" when its value increases by *maximum*.
pt_pt: O valor atual da barra de progresso. No modo "determinado", isto representa a quantidade de trabalho concluído. No modo "indeterminado", é interpretado como módulo *máximo*; ou seja, a barra de progresso completa um "ciclo" quando o seu valor aumenta em *máximo*.
sv: Det aktuella värdet på förloppsindikatorn. I "determinate"-läget representerar detta hur mycket arbete som har slutförts. I läget "Indeterminate" tolkas det som modulo *maximum*, dvs. förloppsindikatorn fullbordar en "cykel" när dess värde ökar med *maximum*.

source: variable
pt_pt: variável

source: A name which is linked to the option value. If specified, the value of the progress bar is automatically set to the value of this name whenever the latter is modified.
pt_pt: Um nome que está ligado ao valor da opção. Se especificado, o valor da barra de progresso é automaticamente definido para o valor deste nome sempre que o último for modificado.
sv: Ett namn som är kopplat till optionens värde. Om det anges kommer värdet på förloppsindikatorn automatiskt att ställas in på värdet för detta namn när det senare ändras.

source: phase
pt_pt: fase

source: Read-only option. The widget periodically increments the value of this option whenever its value is greater than 0 and, in determinate mode, less than maximum. This option may be used by the current theme to provide additional animation effects.
pt_pt: Opção apenas de leitura. O widget incrementa periodicamente o valor desta opção sempre que o seu valor é maior que 0 e, no modo determinado, menor que o máximo. Esta opção pode ser usada pelo tema atual para fornecer efeitos de animação adicionais.
sv: Skrivskyddat alternativ. Widgeten ökar periodiskt värdet på detta alternativ när dess värde är större än 0 och, i determinate-läge, mindre än maximum. Detta alternativ kan användas av det aktuella temat för att ge ytterligare animationseffekter.

source: Begin autoincrement mode: schedules a recurring timer event that calls :meth:`Progressbar.step` every *interval* milliseconds. If omitted, *interval* defaults to 50 milliseconds.
pt_pt: Iniciar modo de autoincremento: agenda um evento de temporizador recorrente que chama :meth:`Progressbar.step` a cada *intervalo* milissegundos. Se omitido, *intervalo* assume o valor predefinido de 50 milissegundos.
sv: Starta autoincrement-läge: schemalägger en återkommande timerhändelse som anropar :meth:`Progressbar.step` varje *intervall* millisekunder. Om *interval* utelämnas är standardvärdet 50 millisekunder.

source: Increments the progress bar's value by *amount*.
pt_pt: Incrementa o valor da barra de progresso por *quantidade*.
sv: Ökar förloppsindikatorns värde med *belopp*.

source: *amount* defaults to 1.0 if omitted.
pt_pt: *quantidade* assume o valor predefinido de 1.0 se omitido.
sv: *amount* är standardvärdet 1.0 om det utelämnas.

source: Stop autoincrement mode: cancels any recurring timer event initiated by :meth:`Progressbar.start` for this progress bar.
pt_pt: Parar modo de autoincremento: cancela qualquer evento de temporizador recorrente iniciado por :meth:`Progressbar.start` para esta barra de progresso.
sv: Stop autoincrement mode: avbryter alla återkommande timerhändelser som initierats av :meth:`Progressbar.start` för denna progressbar.

source: Separator
pt_pt: Separador

source: The :class:`ttk.Separator` widget displays a horizontal or vertical separator bar.
pt_pt: O widget :class:`ttk.Separator` exibe uma barra separadora horizontal ou vertical.
sv: Widgeten :class:`ttk.Separator` visar en horisontell eller vertikal separeringslinje.

source: It has no other methods besides the ones inherited from :class:`ttk.Widget`.
pt_pt: Não tem outros métodos além dos herdados de :class:`ttk.Widget`.
sv: Den har inga andra metoder än de som ärvs från :class:`ttk.Widget`.

source: This widget accepts the following specific option:
pt_pt: Este widget aceita a seguinte opção específica:
sv: Denna widget accepterar följande specifika alternativ:

source: One of "horizontal" or "vertical". Specifies the orientation of the separator.
pt_pt: Um de "horizontal" ou "vertical". Especifica a orientação do separador.
sv: Ett av alternativen "horisontell" eller "vertikal". Anger separatorns orientering.

source: Sizegrip
pt_pt: Redimensionador

source: The :class:`ttk.Sizegrip` widget (also known as a grow box) allows the user to resize the containing toplevel window by pressing and dragging the grip.
pt_pt: O widget :class:`ttk.Sizegrip` (também conhecido como caixa de redimensionamento) permite ao utilizador redimensionar a janela de nível superior que o contém, pressionando e arrastando a pega.
sv: Widgeten :class:`ttk.Sizegrip` (även kallad grow box) gör det möjligt för användaren att ändra storlek på det innehållande toplevel-fönstret genom att trycka på och dra i greppet.

source: This widget has neither specific options nor specific methods, besides the ones inherited from :class:`ttk.Widget`.
pt_pt: Este widget não tem opções específicas nem métodos específicos, além dos herdados de :class:`ttk.Widget`.
sv: Denna widget har varken specifika alternativ eller specifika metoder, förutom de som ärvs från :class:`ttk.Widget`.

source: Platform-specific notes
pt_pt: Notas específicas da plataforma
sv: Plattformsspecifika anmärkningar

source: On macOS, toplevel windows automatically include a built-in size grip by default. Adding a :class:`Sizegrip` is harmless, since the built-in grip will just mask the widget.
pt_pt: No macOS, as janelas de nível superior incluem automaticamente uma pega de redimensionamento integrada por predefinição. Adicionar um :class:`Sizegrip` é inofensivo, uma vez que a pega integrada simplesmente mascarará o widget.
sv: På macOS inkluderar toplevel-fönster automatiskt ett inbyggt storleksgrepp som standard. Att lägga till en :class:`Sizegrip` är ofarligt, eftersom det inbyggda greppet bara kommer att maskera widgeten.

source: Bugs
pt_pt: Problemas
sv: Vi checkar av WordPress.org forumet under hela veckan, och tittar efter buggar. Om du rapporterar en legitim bugg som vi kan reproducera, kommer vi loggar det och patcha för en kommande uppdatering. Men vi kan tyvärr inte ge anpassningstips eller hjälpa till att integrera med 3: e parts plugins eller teman

source: If the containing toplevel's position was specified relative to the right or bottom of the screen (e.g. ....), the :class:`Sizegrip` widget will not resize the window.
pt_pt: Se a posição da janela de nível superior que contém for especificada em relação ao lado direito ou inferior do ecrã (por exemplo, ....), o widget :class:`Sizegrip` não redimensionará a janela.
sv: Om den innehållande toplevelns position angavs i förhållande till skärmens högra eller nedre del (t.ex. ....), kommer widgeten :class:`Sizegrip` inte att ändra storlek på fönstret.

source: This widget supports only "southeast" resizing.
pt_pt: Este widget suporta apenas redimensionamento "sudeste".
sv: Denna widget stöder endast "southeast"-storleksändring.

source: Treeview
pt_pt: Visualizador de Árvore

source: The :class:`ttk.Treeview` widget displays a hierarchical collection of items. Each item has a textual label, an optional image, and an optional list of data values. The data values are displayed in successive columns after the tree label.
pt_pt: O widget :class:`ttk.Treeview` exibe uma coleção hierárquica de itens. Cada item tem uma etiqueta textual, uma imagem opcional e uma lista opcional de valores de dados. Os valores de dados são exibidos em colunas sucessivas após a etiqueta da árvore.
sv: Widgeten :class:`ttk.Treeview` visar en hierarkisk samling av objekt. Varje objekt har en textetikett, en valfri bild och en valfri lista med datavärden. Datavärdena visas i kolumner efter trädets etikett.

source: The order in which data values are displayed may be controlled by setting the widget option ``displaycolumns``. The tree widget can also display column headings. Columns may be accessed by number or symbolic names listed in the widget option columns. See `Column Identifiers`_.
pt_pt: A ordem pela qual os valores de dados são exibidos pode ser controlada definindo a opção do widget ``displaycolumns``. O widget de árvore também pode exibir cabeçalhos de coluna. As colunas podem ser acessadas por número ou nomes simbólicos listados na opção de widget columns. Veja `Identificadores de Coluna`_.
sv: Den ordning i vilken datavärdena visas kan styras genom att ställa in widgetalternativet ``displaycolumns``. Trädwidgeten kan också visa kolumnrubriker. Kolumnerna kan nås med nummer eller symboliska namn som anges i widgetalternativet columns. Se `Kolumnidentifierare`_.

source: Each item is identified by a unique name. The widget will generate item IDs if they are not supplied by the caller. There is a distinguished root item, named ``{}``. The root item itself is not displayed; its children appear at the top level of the hierarchy.
pt_pt: Cada item é identificado por um nome único. O widget irá gerar IDs de item se não forem fornecidos pelo chamador. Existe um item raiz distinto, chamado ``{}``. O item raiz em si não é exibido; os seus filhos aparecem no nível superior da hierarquia.
sv: Varje objekt identifieras med ett unikt namn. Widgeten genererar objekt-ID:n om de inte tillhandahålls av den som anropar. Det finns ett unikt rotobjekt som heter ``{}``. Själva rotobjektet visas inte, utan dess barn visas högst upp i hierarkin.

source: Each item also has a list of tags, which can be used to associate event bindings with individual items and control the appearance of the item.
pt_pt: Cada item também tem uma lista de etiquetas, que podem ser usadas para associar ligações de eventos a itens individuais e controlar a aparência do item.
sv: Varje objekt har också en lista med taggar, som kan användas för att associera händelsebindningar med enskilda objekt och styra utseendet på objektet.

source: The Treeview widget supports horizontal and vertical scrolling, according to the options described in `Scrollable Widget Options`_ and the methods :meth:`Treeview.xview` and :meth:`Treeview.yview`.
pt_pt: O widget Treeview suporta rolagem horizontal e vertical, de acordo com as opções descritas em `Opções de Widgets com Rolagem`_ e os métodos :meth:`Treeview.xview` e :meth:`Treeview.yview`.
sv: Treeview-widgeten stöder horisontell och vertikal rullning, enligt de alternativ som beskrivs i `Scrollable Widget Options`_ och metoderna :meth:`Treeview.xview` och :meth:`Treeview.yview`.

source: columns
pt_pt: colunas

source: A list of column identifiers, specifying the number of columns and their names.
pt_pt: Uma lista de identificadores de coluna, especificando o número de colunas e os seus nomes.
sv: En lista med kolumnidentifierare som anger antalet kolumner och deras namn.

source: displaycolumns
pt_pt: colunas de exibição
sv: displaykolumner

source: A list of column identifiers (either symbolic or integer indices) specifying which data columns are displayed and the order in which they appear, or the string "#all".
pt_pt: Uma lista de identificadores de coluna (simbólicos ou índices inteiros) especificando quais colunas de dados são exibidas e a ordem pela qual aparecem, ou a string "#all".
sv: En lista med kolumnidentifierare (antingen symboliska index eller heltalsindex) som anger vilka datakolumner som ska visas och i vilken ordning de ska visas, eller strängen "#all".

source: Specifies the number of rows which should be visible. Note: the requested width is determined from the sum of the column widths.
pt_pt: Especifica o número de linhas que devem ser visíveis. Nota: a largura solicitada é determinada pela soma das larguras das colunas.
sv: Anger antalet rader som ska vara synliga. Observera: den begärda bredden bestäms av summan av kolumnbredderna.

source: Specifies the internal padding for the widget. The padding is a list of up to four length specifications.
pt_pt: Especifica o preenchimento interno para o widget. O preenchimento é uma lista de até quatro especificações de comprimento.
sv: Anger den interna utfyllnaden för widgeten. Utfyllnaden är en lista med upp till fyra längdspecifikationer.

source: selectmode
pt_pt: modo de seleção
sv: välj läge

source: Controls how the built-in class bindings manage the selection. One of "extended", "browse" or "none". If set to "extended" (the default), multiple items may be selected. If "browse", only a single item will be selected at a time. If "none", the selection will not be changed.
pt_pt: Controla como as ligações de classe integradas gerem a seleção. Um de "estendido", "navegar" ou "nenhum". Se definido como "estendido" (o predefinido), vários itens podem ser selecionados. Se "navegar", apenas um único item será selecionado de cada vez. Se "nenhum", a seleção não será alterada.
sv: Styr hur de inbyggda klassbindningarna hanterar urvalet. Ett av alternativen "extended", "browse" eller "none". Om inställningen är "extended" (standard) kan flera objekt väljas. Om "browse" används kommer endast ett objekt att väljas åt gången. Om "none" används kommer valet inte att ändras.

source: Note that the application code and tag bindings can set the selection however they wish, regardless of the value of this option.
pt_pt: Note que o código da aplicação e as ligações de etiqueta podem definir a seleção como desejarem, independentemente do valor desta opção.
sv: Observera att programkoden och taggbindningarna kan ställa in urvalet hur de vill, oavsett värdet på detta alternativ.

source: show
pt_pt: mostrar
sv: visa

source: A list containing zero or more of the following values, specifying which elements of the tree to display.
pt_pt: Uma lista contendo zero ou mais dos seguintes valores, especificando quais elementos da árvore exibir.
sv: En lista som innehåller noll eller flera av följande värden och som anger vilka element i trädet som ska visas.

source: tree: display tree labels in column #0.
pt_pt: árvore: exibir etiquetas de árvore na coluna #0.
sv: tree: visa trädetiketter i kolumn #0.

source: headings: display the heading row.
pt_pt: cabeçalhos: exibir a linha de cabeçalho.
sv: headings: visa rubrikraden.

source: The default is "tree headings", i.e., show all elements.
pt_pt: O predefinido é "árvore cabeçalhos", ou seja, mostrar todos os elementos.
sv: Standardinställningen är "tree headings", dvs. visa alla element.

source: **Note**: Column #0 always refers to the tree column, even if show="tree" is not specified.
pt_pt: **Nota**: A coluna #0 refere-se sempre à coluna da árvore, mesmo que show="árvore" não seja especificado.
sv: **Notera**: Kolumn #0 hänvisar alltid till trädkolumnen, även om show="tree" inte har angetts.

source: Item Options
pt_pt: Opções de Item
sv: Objektalternativ

source: The following item options may be specified for items in the insert and item widget commands.
pt_pt: As seguintes opções de item podem ser especificadas para itens nos comandos de inserção e item do widget.
sv: Följande objektalternativ kan anges för objekt i kommandona insert och item widget.

source: The textual label to display for the item.
pt_pt: A etiqueta textual a exibir para o item.
sv: Den textetikett som ska visas för objektet.

source: A Tk Image, displayed to the left of the label.
pt_pt: Uma imagem Tk, exibida à esquerda da etiqueta.
sv: En Tk-bild som visas till vänster om etiketten.

source: The list of values associated with the item.
pt_pt: A lista de valores associados ao item.
sv: Listan över värden som är kopplade till objektet.
