Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: pt_pt, sv

source: Toggle the selection state of each item in *items*.
pt_pt: Alternar o estado de seleção de cada item em *itens*.
sv: Växla valstatus för varje objekt i *items*.

source: With one argument, returns a dictionary of column/value pairs for the specified *item*. With two arguments, returns the current value of the specified *column*. With three arguments, sets the value of given *column* in given *item* to the specified *value*.
pt_pt: Com um argumento, retorna um dicionário de pares coluna/valor para o *item* especificado. Com dois argumentos, retorna o valor atual da *coluna* especificada. Com três argumentos, define o valor da *coluna* dada no *item* dado para o *valor* especificado.
sv: Med ett argument returneras en ordbok med kolumn/värde-par för den angivna *artikeln*. Med två argument returneras det aktuella värdet för den angivna *kolumnen*. Med tre argument, anger värdet för angiven *kolumn* i angiven *artikel* till angivet *värde*.

source: Bind a callback for the given event *sequence* to the tag *tagname*. When an event is delivered to an item, the callbacks for each of the item's tags option are called.
pt_pt: Ligar um retorno para a sequência de eventos *sequence* à etiqueta *tagname*. Quando um evento é entregue a um item, os retornos para cada uma das opções de etiqueta do item são chamados.
sv: Binder ett callback för den angivna händelsen *sequence* till taggen *tagname*. När en händelse levereras till ett objekt anropas återuppringningarna för vart och ett av objektets taggalternativ.

source: Query or modify the options for the specified *tagname*.
pt_pt: Consultar ou modificar as opções para o *tagname* especificado.
sv: Fråga efter eller ändra alternativen för det angivna *tagnamnet*.

source: If *kw* is not given, returns a dict of the option settings for *tagname*. If *option* is specified, returns the value for that *option* for the specified *tagname*. Otherwise, sets the options to the corresponding values for the given *tagname*.
pt_pt: Se *kw* não for fornecido, retorna um dicionário das definições de opção para *tagname*. Se *opção* for especificada, retorna o valor para essa *opção* para o *tagname* especificado. Caso contrário, define as opções para os valores correspondentes para o *tagname* dado.
sv: Om *kw* inte anges, returneras en dict med alternativinställningarna för *tagname*. Om *option* anges, returneras värdet för det *option* för det angivna *tagname*. I annat fall sätts alternativen till motsvarande värden för det angivna *tagname*.

source: If *item* is specified, returns 1 or 0 depending on whether the specified *item* has the given *tagname*. Otherwise, returns a list of all items that have the specified tag.
pt_pt: Se *item* for especificado, retorna 1 ou 0 dependendo se o *item* especificado tem o *tagname* dado. Caso contrário, retorna uma lista de todos os itens que têm a etiqueta especificada.
sv: Om *item* anges, returneras 1 eller 0 beroende på om det angivna *item* har det angivna *tagnamnet*. I annat fall returneras en lista över alla objekt som har den angivna taggen.

source: Availability: Tk 8.6
pt_pt: Disponibilidade: Tk 8.6
sv: Tillgänglighet: Tk 8,6

source: Query or modify horizontal position of the treeview.
pt_pt: Consultar ou modificar a posição horizontal do treeview.
sv: Fråga efter eller ändra trädvyens horisontella position.

source: Query or modify vertical position of the treeview.
pt_pt: Consultar ou modificar a posição vertical do treeview.
sv: Fråga efter eller ändra trädvyns vertikala position.

source: Ttk Styling
pt_pt: Estilização Ttk

source: Each widget in :mod:`ttk` is assigned a style, which specifies the set of elements making up the widget and how they are arranged, along with dynamic and default settings for element options. By default the style name is the same as the widget's class name, but it may be overridden by the widget's style option. If you don't know the class name of a widget, use the method :meth:`Misc.winfo_class` (somewidget.winfo_class()).
pt_pt: Cada widget em :mod:`ttk` é atribuído a um estilo, que especifica o conjunto de elementos que compõem o widget e como estão organizados, juntamente com configurações dinâmicas e predefinidas para opções de elementos. Por predefinição, o nome do estilo é o mesmo que o nome da classe do widget, mas pode ser substituído pela opção de estilo do widget. Se não souber o nome da classe de um widget, use o método :meth:`Misc.winfo_class` (somewidget.winfo_class()).
sv: Varje widget i :mod:`ttk` tilldelas en stil, som anger den uppsättning element som utgör widgeten och hur de är arrangerade, tillsammans med dynamiska inställningar och standardinställningar för elementalternativ. Som standard är stilnamnet detsamma som widgetens klassnamn, men det kan åsidosättas av widgetens stilalternativ. Om du inte känner till klassnamnet på en widget kan du använda metoden :meth:`Misc.winfo_class` (somewidget.winfo_class()).

source: `Tcl'2004 conference presentation <https://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_
pt_pt: `Apresentação da conferência Tcl'2004 <https://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_

source: This document explains how the theme engine works
pt_pt: Este documento explica como o motor de temas funciona
sv: Detta dokument förklarar hur temamotorn fungerar

source: This class is used to manipulate the style database.
pt_pt: Esta classe é usada para manipular a base de dados de estilos.
sv: Denna klass används för att manipulera stildatabasen.

source: Query or set the default value of the specified option(s) in *style*.
pt_pt: Consultar ou definir o valor predefinido da(s) opção(ões) especificada(s) em *style*.
sv: Fråga efter eller ange standardvärdet för det eller de angivna alternativen i *style*.

source: Each key in *kw* is an option and each value is a string identifying the value for that option.
pt_pt: Cada chave em *kw* é uma opção e cada valor é uma string que identifica o valor para essa opção.
sv: Varje nyckel i *kw* är ett alternativ och varje värde är en sträng som identifierar värdet för det alternativet.

source: For example, to change every default button to be a flat button with some padding and a different background color::
pt_pt: Por exemplo, para alterar cada botão predefinido para ser um botão plano com algum preenchimento e uma cor de fundo diferente:
sv: Om du t.ex. vill ändra alla standardknappar till en platt knapp med lite utfyllnad och en annan bakgrundsfärg::

source: from tkinter import ttk import tkinter root = tkinter.Tk() ttk.Style().configure("TButton", padding=6, relief="flat", background="#ccc") btn = ttk.Button(text="Sample") btn.pack() root.mainloop()
pt_pt: from tkinter import ttk import tkinter root = tkinter.Tk() ttk.Style().configure("TButton", padding=6, relief="flat", background="#ccc") btn = ttk.Button(text="Amostra") btn.pack() root.mainloop()
sv: från tkinter importera ttk importera tkinter root = tkinter.Tk() ttk.Style().configure("TButton", padding=6, relief="flat", bakgrund="#ccc") btn = ttk.Button(text="Prov") btn.pack() root.mainloop()

source: Query or sets dynamic values of the specified option(s) in *style*.
pt_pt: Consultar ou definir valores dinâmicos da(s) opção(ões) especificada(s) em *style*.
sv: Frågar efter eller anger dynamiska värden för det eller de angivna alternativen i *style*.

source: Each key in *kw* is an option and each value should be a list or a tuple (usually) containing statespecs grouped in tuples, lists, or some other preference. A statespec is a compound of one or more states and then a value.
pt_pt: Cada chave em *kw* é uma opção e cada valor deve ser uma lista ou um tuplo (geralmente) contendo statespecs agrupados em tuplos, listas ou alguma outra preferência. Um statespec é um composto de um ou mais estados e depois um valor.
sv: Varje nyckel i *kw* är ett alternativ och varje värde ska vara en lista eller en tupel (vanligtvis) som innehåller statespecs grupperade i tuplar, listor eller någon annan preferens. En statespec är en sammansättning av ett eller flera tillstånd och sedan ett värde.

source: An example may make it more understandable::
pt_pt: Um exemplo pode tornar isto mais compreensível:
sv: Ett exempel kan göra det mer begripligt::

source: import tkinter from tkinter import ttk root = tkinter.Tk() style = ttk.Style() style.map("C.TButton", foreground=[('pressed', 'red'), ('active', 'blue')], background=[('pressed', '!disabled', 'black'), ('active', 'white')] ) colored_btn = ttk.Button(text="Test", style="C.TButton").pack() root.mainloop()
pt_pt: import tkinter from tkinter import ttk root = tkinter.Tk() style = ttk.Style() style.map("C.TButton", foreground=[('pressed', 'red'), ('active', 'blue')], background=[('pressed', '!disabled', 'black'), ('active', 'white')] ) colored_btn = ttk.Button(text="Teste", style="C.TButton").pack() root.mainloop()
sv: importera tkinter från tkinter importera ttk root = tkinter.Tk() style = ttk.Style() style.map("C.TButton", foreground=[('pressed', 'red'), ('active', 'blue')], background=[('pressed', '!disabled', 'black'), ('active', 'white')] ) colored_btn = ttk.Button(text="Test", style="C.TButton").pack() root.mainloop()

source: Note that the order of the (states, value) sequences for an option does matter, if the order is changed to ``[('active', 'blue'), ('pressed', 'red')]`` in the foreground option, for example, the result would be a blue foreground when the widget were in active or pressed states.
pt_pt: Note que a ordem das sequências (estados, valor) para uma opção é importante; se a ordem for alterada para ``[('active', 'blue'), ('pressed', 'red')]`` na opção de primeiro plano, por exemplo, o resultado seria um primeiro plano azul quando o widget estivesse nos estados ativo ou pressionado.
sv: Observera att ordningen på sekvenserna (tillstånd, värde) för ett alternativ har betydelse. Om ordningen ändras till ``[('active', 'blue'), ('pressed', 'red')]`` i alternativet för förgrund, till exempel, skulle resultatet bli en blå förgrund när widgeten var i aktivt eller pressat tillstånd.

source: Returns the value specified for *option* in *style*.
pt_pt: Retorna o valor especificado para *opção* em *estilo*.
sv: Returnerar det värde som anges för *option* i *style*.

source: If *state* is specified, it is expected to be a sequence of one or more states. If the *default* argument is set, it is used as a fallback value in case no specification for option is found.
pt_pt: Se *estado* for especificado, espera-se que seja uma sequência de um ou mais estados. Se o argumento *predefinição* for definido, é usado como valor de reserva caso nenhuma especificação para a opção seja encontrada.
sv: Om *state* anges förväntas det vara en sekvens av ett eller flera tillstånd. Om argumentet *default* anges används det som ett reservvärde om ingen specifikation för optionen hittas.

source: To check what font a Button uses by default::
pt_pt: Para verificar qual a fonte que um Botão usa por predefinição:
sv: Så här kontrollerar du vilket teckensnitt en knapp använder som standard::

source: Define the widget layout for given *style*. If *layoutspec* is omitted, return the layout specification for given style.
pt_pt: Define o layout do widget para o *estilo* dado. Se *layoutspec* for omitido, retorna a especificação de layout para o estilo dado.
sv: Definiera widgetlayouten för given *style*. Om *layoutspec* utelämnas returneras layoutspecifikationen för den givna stilen.

source: *layoutspec*, if specified, is expected to be a list or some other sequence type (excluding strings), where each item should be a tuple and the first item is the layout name and the second item should have the format described in `Layouts`_.
pt_pt: *layoutspec*, se especificado, espera-se que seja uma lista ou algum outro tipo de sequência (excluindo strings), onde cada item deve ser um tuplo e o primeiro item é o nome do layout e o segundo item deve ter o formato descrito em `Layouts`_.
sv: *layoutspec*, om den anges, förväntas vara en lista eller någon annan sekvenstyp (exklusive strängar), där varje objekt ska vara en tupel och det första objektet är layoutnamnet och det andra objektet ska ha det format som beskrivs i `Layouts`_.

source: To understand the format, see the following example (it is not intended to do anything useful)::
pt_pt: Para entender o formato, veja o seguinte exemplo (não é destinado a fazer algo útil):
sv: För att förstå formatet, se följande exempel (det är inte meningen att det ska göra något användbart)::

source: from tkinter import ttk import tkinter root = tkinter.Tk() style = ttk.Style() style.layout("TMenubutton", [ ("Menubutton.background", None), ("Menubutton.button", {"children": [("Menubutton.focus", {"children": [("Menubutton.padding", {"children": [("Menubutton.label", {"side": "left", "expand": 1})] })] })] }), ]) mbtn = ttk.Menubutton(text='Text') mbtn.pack() root.mainloop()
pt_pt: from tkinter import ttk import tkinter root = tkinter.Tk() style = ttk.Style() style.layout("TMenubutton", [ ("Menubutton.background", None), ("Menubutton.button", {"children": [("Menubutton.focus", {"children": [("Menubutton.padding", {"children": [("Menubutton.label", {"side": "left", "expand": 1})] })] })] }), ]) mbtn = ttk.Menubutton(text='Texto') mbtn.pack() root.mainloop()

source: If "image" is used, *args* should contain the default image name followed by statespec/value pairs (this is the imagespec), and *kw* may have the following options:
pt_pt: Se "image" for usado, *args* deve conter o nome da imagem predefinida seguido de pares statespec/valor (isto é o imagespec), e *kw* pode ter as seguintes opções:
sv: Om "image" används ska *args* innehålla standardbildnamnet följt av paren statespec/värde (detta är imagespec), och *kw* kan ha följande alternativ:

source: border=padding
pt_pt: border=preenchimento
sv: border=fyllnad

source: padding is a list of up to four integers, specifying the left, top, right, and bottom borders, respectively.
pt_pt: preenchimento é uma lista de até quatro inteiros, especificando as bordas esquerda, superior, direita e inferior, respetivamente.
sv: padding är en lista med upp till fyra heltal som anger vänster-, topp-, höger- respektive bottenkanter.

source: height=height
pt_pt: height=altura
sv: höjd=höjd

source: Specifies a minimum height for the element. If less than zero, the base image's height is used as a default.
pt_pt: Especifica uma altura mínima para o elemento. Se for menor que zero, a altura da imagem base é usada como predefinição.
sv: Anger en minsta höjd för elementet. Om den är mindre än noll används basbildens höjd som standard.

source: padding=padding
pt_pt: padding=preenchimento
sv: utfyllnad=utfyllnad

source: Specifies the element's interior padding. Defaults to border's value if not specified.
pt_pt: Especifica o preenchimento interior do elemento. Assume o valor da borda como predefinição se não for especificado.
sv: Anger elementets invändiga utfyllnad. Standardvärdet är border-värdet om det inte anges.

source: sticky=spec
pt_pt: sticky=espec

source: Specifies how the image is placed within the final parcel. spec contains zero or more characters "n", "s", "w", or "e".
pt_pt: Especifica como a imagem é colocada dentro do espaço final. spec contém zero ou mais caracteres "n", "s", "w", ou "e".
sv: Anger hur bilden ska placeras i det slutliga paketet. spec innehåller noll eller flera tecken "n", "s", "w" eller "e".

source: width=width
pt_pt: width=largura
sv: width=bredd

source: Specifies a minimum width for the element. If less than zero, the base image's width is used as a default.
pt_pt: Especifica uma largura mínima para o elemento. Se for menor que zero, a largura da imagem base é usada como predefinição.
sv: Anger en minsta bredd för elementet. Om den är mindre än noll används basbildens bredd som standard.

source: Example::
pt_pt: Exemplo::
sv: Exempel::

source: img1 = tkinter.PhotoImage(master=root, file='button.png') img1 = tkinter.PhotoImage(master=root, file='button-pressed.png') img1 = tkinter.PhotoImage(master=root, file='button-active.png') style = ttk.Style(root) style.element_create('Button.button', 'image', img1, ('pressed', img2), ('active', img3), border=(2, 4), sticky='we')
pt_pt: img1 = tkinter.PhotoImage(master=root, file='button.png') img2 = tkinter.PhotoImage(master=root, file='button-pressed.png') img3 = tkinter.PhotoImage(master=root, file='button-active.png') style = ttk.Style(root) style.element_create('Button.button', 'image', img1, ('pressed', img2), ('active', img3), border=(2, 4), sticky='we')

source: If "from" is used as the value of *etype*, :meth:`element_create` will clone an existing element. *args* is expected to contain a themename, from which the element will be cloned, and optionally an element to clone from. If this element to clone from is not specified, an empty element will be used. *kw* is discarded.
pt_pt: Se "from" for usado como o valor de *etype*, :meth:`element_create` irá clonar um elemento existente. *args* deve conter um nome de tema, do qual o elemento será clonado, e opcionalmente um elemento a clonar. Se este elemento a clonar não for especificado, um elemento vazio será usado. *kw* é descartado.
sv: Om "from" används som värde för *etype*, kommer :meth:`element_create` att klona ett befintligt element. *args* förväntas innehålla ett temanamn, från vilket elementet ska klonas, och eventuellt ett element att klona från. Om elementet att klona från inte anges, kommer ett tomt element att användas. *kw* kastas bort.

source: Returns the list of elements defined in the current theme.
pt_pt: Retorna a lista de elementos definidos no tema atual.
sv: Returnerar listan över element som definieras i det aktuella temat.

source: Returns the list of *elementname*'s options.
pt_pt: Retorna a lista de opções de *nomeElemento*.
sv: Returnerar listan över *elementnamn*:s alternativ.

source: Create a new theme.
pt_pt: Criar um novo tema.
sv: Skapa ett nytt tema.

source: It is an error if *themename* already exists. If *parent* is specified, the new theme will inherit styles, elements and layouts from the parent theme. If *settings* are present they are expected to have the same syntax used for :meth:`theme_settings`.
pt_pt: É um erro se *nomeTema* já existir. Se *pai* for especificado, o novo tema herdará estilos, elementos e layouts do tema pai. Se *configurações* estiverem presentes, espera-se que tenham a mesma sintaxe usada para :meth:`theme_settings`.
sv: Det är ett fel om *themename* redan finns. Om *parent* anges kommer det nya temat att ärva stilar, element och layouter från föräldratemat. Om *settings* finns med förväntas de ha samma syntax som används för :meth:`theme_settings`.

source: Temporarily sets the current theme to *themename*, apply specified *settings* and then restore the previous theme.
pt_pt: Define temporariamente o tema atual para *nomeTema*, aplica as *configurações* especificadas e depois restaura o tema anterior.
sv: Ställer tillfälligt in det aktuella temat på *themename*, tillämpar angivna *settings* och återställer sedan det tidigare temat.

source: Each key in *settings* is a style and each value may contain the keys 'configure', 'map', 'layout' and 'element create' and they are expected to have the same format as specified by the methods :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` and :meth:`Style.element_create` respectively.
pt_pt: Cada chave em *configurações* é um estilo e cada valor pode conter as chaves 'configure', 'map', 'layout' e 'element create' e espera-se que tenham o mesmo formato como especificado pelos métodos :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` e :meth:`Style.element_create`, respetivamente.
sv: Varje nyckel i *settings* är en stil och varje värde kan innehålla nycklarna 'configure', 'map', 'layout' och 'element create' och de förväntas ha samma format som anges av metoderna :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` respektive :meth:`Style.element_create`.

source: As an example, let's change the Combobox for the default theme a bit::
pt_pt: Como exemplo, vamos alterar um pouco o Combobox para o tema predefinido:
sv: Som ett exempel, låt oss ändra Combobox för standardtemat lite::

source: Returns a list of all known themes.
pt_pt: Retorna uma lista de todos os temas conhecidos.
sv: Returnerar en lista över alla kända teman.

source: If *themename* is not given, returns the theme in use. Otherwise, sets the current theme to *themename*, refreshes all widgets and emits a <<ThemeChanged>> event.
pt_pt: Se *nomeTema* não for fornecido, retorna o tema em uso. Caso contrário, define o tema atual para *nomeTema*, atualiza todos os widgets e emite um evento <<ThemeChanged>>.
sv: Om *themename* inte anges returneras det tema som används. I annat fall ställs det aktuella temat in på *themename*, alla widgetar uppdateras och en &lt;<ThemeChanged>&gt;-händelse skickas ut.

source: A layout can be just ``None``, if it takes no options, or a dict of options specifying how to arrange the element. The layout mechanism uses a simplified version of the pack geometry manager: given an initial cavity, each element is allocated a parcel.
pt_pt: Um layout pode ser apenas ``None``, se não tiver opções, ou um dicionário de opções que especifica como organizar o elemento. O mecanismo de layout usa uma versão simplificada do gestor de geometria pack: dado uma cavidade inicial, cada elemento é alocado a uma parcela.
sv: En layout kan vara bara ``None``, om den inte tar några alternativ, eller en dikt av alternativ som anger hur elementet ska arrangeras. Layoutmekanismen använder en förenklad version av packgeometrihanteraren: givet en initial hålighet tilldelas varje element ett paket.

source: *side*: whichside
pt_pt: *side*: qualLado
sv: *sida*: vilken sida

source: Specifies which side of the cavity to place the element; one of top, right, bottom or left. If omitted, the element occupies the entire cavity.
pt_pt: Especifica em que lado da cavidade colocar o elemento; um de topo, direita, fundo ou esquerda. Se omitido, o elemento ocupa toda a cavidade.
sv: Anger vilken sida av hålrummet som elementet ska placeras på; en av topp, höger, botten eller vänster. Om detta utelämnas upptar elementet hela hålrummet.

source: Specifies where the element is placed inside its allocated parcel.
pt_pt: Especifica onde o elemento é colocado dentro da sua parcela alocada.
sv: Anger var elementet placeras inom det tilldelade paketet.

source: *unit*: 0 or 1
pt_pt: *unit*: 0 ou 1
sv: *unit*: 0 eller 1

source: If set to 1, causes the element and all of its descendants to be treated as a single element for the purposes of :meth:`Widget.identify` et al. It's used for things like scrollbar thumbs with grips.
pt_pt: Se definido para 1, faz com que o elemento e todos os seus descendentes sejam tratados como um único elemento para os fins de :meth:`Widget.identify` e outros. É usado para coisas como polegares de barras de rolagem com pegas.
sv: Om inställningen är 1, behandlas elementet och alla dess ättlingar som ett enda element i :meth:`Widget.identify` och liknande. Det används för saker som rullningslister med tummar och grepp.

source: Specifies a list of elements to place inside the element. Each element is a tuple (or other sequence type) where the first item is the layout name, and the other is a `Layout`_.
pt_pt: Especifica uma lista de elementos para colocar dentro do elemento. Cada elemento é um tuplo (ou outro tipo de sequência) onde o primeiro item é o nome do layout e o outro é um `Layout`_.
sv: Anger en lista med element som ska placeras inuti elementet. Varje element är en tupel (eller annan sekvenstyp) där det första objektet är layoutnamnet och det andra är en `Layout`_.

source: cursor
sv: markör

source: Flag
sv: Flagga
