Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/traceback.po
Languages: pt_pt

source: This simple example implements a basic read-eval-print loop, similar to (but less useful than) the standard Python interactive interpreter loop. For a more complete implementation of the interpreter loop, refer to the :mod:`code` module. ::
pt_pt: Este exemplo simples implementa um ciclo básico de leitura-avaliação-impressão, semelhante (mas menos útil) ao ciclo interativo padrão do interpretador Python. Para uma implementação mais completa do ciclo do interpretador, consulte o módulo :mod:`code`.

source: The following example demonstrates the different ways to print and format the exception and traceback:
pt_pt: O exemplo seguinte demonstra as diferentes formas de imprimir e formatar a exceção e o traceback:

source: The output for the example would look similar to this:
pt_pt: A saída para o exemplo seria semelhante a esta:

source: The following example shows the different ways to print and format the stack::
pt_pt: O exemplo seguinte mostra as diferentes formas de imprimir e formatar a pilha:

source: This last example demonstrates the final few formatting functions:
pt_pt: Este último exemplo demonstra as últimas funções de formatação:

source: object
pt_pt: objeto

source: ^ (caret)
pt_pt: ^ (acento circunflexo)

source: marker
pt_pt: marcador
