Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tracemalloc.po
Languages: pt_pt

source: Get the memory usage in bytes of the :mod:`tracemalloc` module used to store traces of memory blocks. Return an :class:`int`.
pt_pt: Obter o uso de memória em bytes do módulo :mod:`tracemalloc` usado para armazenar rastos de blocos de memória. Retorna um :class:`int`.

source: ``True`` if the :mod:`tracemalloc` module is tracing Python memory allocations, ``False`` otherwise.
pt_pt: ``True`` se o módulo :mod:`tracemalloc` estiver a rastrear alocações de memória do Python, ``False`` caso contrário.

source: See also :func:`start` and :func:`stop` functions.
pt_pt: Veja também as funções :func:`start` e :func:`stop`.

source: Start tracing Python memory allocations: install hooks on Python memory allocators. Collected tracebacks of traces will be limited to *nframe* frames. By default, a trace of a memory block only stores the most recent frame: the limit is ``1``. *nframe* must be greater or equal to ``1``.
pt_pt: Iniciar o rastreio de alocações de memória do Python: instalar ganchos nos alocadores de memória do Python. Os tracebacks recolhidos dos rastos serão limitados a *nframe* quadros. Por predefinição, um rastro de um bloco de memória armazena apenas o quadro mais recente: o limite é ``1``. *nframe* deve ser maior ou igual a ``1``.

source: You can still read the original number of total frames that composed the traceback by looking at the :attr:`Traceback.total_nframe` attribute.
pt_pt: Ainda pode ler o número original de quadros totais que compuseram o traceback olhando para o atributo :attr:`Traceback.total_nframe`.

source: Storing more than ``1`` frame is only useful to compute statistics grouped by ``'traceback'`` or to compute cumulative statistics: see the :meth:`Snapshot.compare_to` and :meth:`Snapshot.statistics` methods.
pt_pt: Armazenar mais do que ``1`` quadro é útil apenas para calcular estatísticas agrupadas por ``'traceback'`` ou para calcular estatísticas cumulativas: veja os métodos :meth:`Snapshot.compare_to` e :meth:`Snapshot.statistics`.

source: Storing more frames increases the memory and CPU overhead of the :mod:`tracemalloc` module. Use the :func:`get_tracemalloc_memory` function to measure how much memory is used by the :mod:`tracemalloc` module.
pt_pt: Armazenar mais quadros aumenta a sobrecarga de memória e CPU do módulo :mod:`tracemalloc`. Use a função :func:`get_tracemalloc_memory` para medir quanta memória é usada pelo módulo :mod:`tracemalloc`.

source: The :envvar:`PYTHONTRACEMALLOC` environment variable (``PYTHONTRACEMALLOC=NFRAME``) and the :option:`-X` ``tracemalloc=NFRAME`` command line option can be used to start tracing at startup.
pt_pt: A variável de ambiente :envvar:`PYTHONTRACEMALLOC` (``PYTHONTRACEMALLOC=NFRAME``) e a opção de linha de comando :option:`-X` ``tracemalloc=NFRAME`` podem ser usadas para iniciar o rastreio na inicialização.

source: See also :func:`stop`, :func:`is_tracing` and :func:`get_traceback_limit` functions.
pt_pt: Veja também as funções :func:`stop`, :func:`is_tracing` e :func:`get_traceback_limit`.

source: Stop tracing Python memory allocations: uninstall hooks on Python memory allocators. Also clears all previously collected traces of memory blocks allocated by Python.
pt_pt: Parar de rastrear alocações de memória do Python: desinstalar ganchos nos alocadores de memória do Python. Também limpa todos os rastos recolhidos anteriormente de blocos de memória alocados pelo Python.

source: Call :func:`take_snapshot` function to take a snapshot of traces before clearing them.
pt_pt: Chame a função :func:`take_snapshot` para tirar um *snapshot* dos rastos antes de os limpar.

source: See also :func:`start`, :func:`is_tracing` and :func:`clear_traces` functions.
pt_pt: Veja também as funções :func:`start`, :func:`is_tracing` e :func:`clear_traces`.

source: Take a snapshot of traces of memory blocks allocated by Python. Return a new :class:`Snapshot` instance.
pt_pt: Tirar um *snapshot* dos rastos de blocos de memória alocados pelo Python. Retorna uma nova instância :class:`Snapshot`.

source: The snapshot does not include memory blocks allocated before the :mod:`tracemalloc` module started to trace memory allocations.
pt_pt: O *snapshot* não inclui blocos de memória alocados antes do módulo :mod:`tracemalloc` começar a rastrear alocações de memória.

source: Tracebacks of traces are limited to :func:`get_traceback_limit` frames. Use the *nframe* parameter of the :func:`start` function to store more frames.
pt_pt: Os tracebacks dos rastos são limitados a :func:`get_traceback_limit` quadros. Use o parâmetro *nframe* da função :func:`start` para armazenar mais quadros.

source: The :mod:`tracemalloc` module must be tracing memory allocations to take a snapshot, see the :func:`start` function.
pt_pt: O módulo :mod:`tracemalloc` deve estar a rastrear alocações de memória para tirar um *snapshot*, veja a função :func:`start`.

source: See also the :func:`get_object_traceback` function.
pt_pt: Veja também a função :func:`get_object_traceback`.

source: Filter traces of memory blocks by their address space (domain).
pt_pt: Filtrar rastos de blocos de memória pelo seu espaço de endereço (domínio).

source: If *inclusive* is ``True`` (include), match memory blocks allocated in the address space :attr:`domain`.
pt_pt: Se *inclusive* for ``True`` (incluir), corresponder a blocos de memória alocados no espaço de endereçamento :attr:`domain`.

source: If *inclusive* is ``False`` (exclude), match memory blocks not allocated in the address space :attr:`domain`.
pt_pt: Se *inclusive* for ``False`` (excluir), corresponder a blocos de memória não alocados no espaço de endereçamento :attr:`domain`.

source: Address space of a memory block (``int``). Read-only property.
pt_pt: Espaço de endereçamento de um bloco de memória (``int``). Propriedade apenas de leitura.

source: Filter
pt_pt: Filtro

source: Filter on traces of memory blocks.
pt_pt: Filtrar rastos de blocos de memória.

source: See the :func:`fnmatch.fnmatch` function for the syntax of *filename_pattern*. The ``'.pyc'`` file extension is replaced with ``'.py'``.
pt_pt: Veja a função :func:`fnmatch.fnmatch` para a sintaxe de *filename_pattern*. A extensão de ficheiro ``'.pyc'`` é substituída por ``'.py'``.

source: Examples:
pt_pt: Exemplos:

source: ``Filter(True, subprocess.__file__)`` only includes traces of the :mod:`subprocess` module
pt_pt: ``Filter(True, subprocess.__file__)`` inclui apenas rastos do módulo :mod:`subprocess`

source: ``Filter(False, tracemalloc.__file__)`` excludes traces of the :mod:`tracemalloc` module
pt_pt: ``Filter(False, tracemalloc.__file__)`` exclui rastos do módulo :mod:`tracemalloc`

source: ``Filter(False, "<unknown>")`` excludes empty tracebacks
pt_pt: ``Filter(False, "<unknown>")`` exclui tracebacks vazios

source: The ``'.pyo'`` file extension is no longer replaced with ``'.py'``.
pt_pt: A extensão de ficheiro ``'.pyo'`` já não é substituída por ``'.py'``.

source: Added the :attr:`domain` attribute.
pt_pt: Adicionado o atributo :attr:`domain`.

source: Address space of a memory block (``int`` or ``None``).
pt_pt: Espaço de endereçamento de um bloco de memória (``int`` ou ``None``).

source: tracemalloc uses the domain ``0`` to trace memory allocations made by Python. C extensions can use other domains to trace other resources.
pt_pt: O tracemalloc usa o domínio ``0`` para rastrear alocações de memória feitas pelo Python. Extensões em C podem usar outros domínios para rastrear outros recursos.

source: If *inclusive* is ``True`` (include), only match memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
pt_pt: Se *inclusive* for ``True`` (incluir), corresponder apenas a blocos de memória alocados num ficheiro com um nome que corresponda a :attr:`filename_pattern` no número de linha :attr:`lineno`.

source: If *inclusive* is ``False`` (exclude), ignore memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
pt_pt: Se *inclusive* for ``False`` (excluir), ignorar blocos de memória alocados num ficheiro com um nome que corresponda a :attr:`filename_pattern` no número de linha :attr:`lineno`.

source: Line number (``int``) of the filter. If *lineno* is ``None``, the filter matches any line number.
pt_pt: Número de linha (``int``) do filtro. Se *lineno* for ``None``, o filtro corresponde a qualquer número de linha.

source: Filename pattern of the filter (``str``). Read-only property.
pt_pt: Padrão de nome de ficheiro do filtro (``str``). Propriedade apenas de leitura.

source: If *all_frames* is ``True``, all frames of the traceback are checked. If *all_frames* is ``False``, only the most recent frame is checked.
pt_pt: Se *all_frames* for ``True``, todos os quadros do traceback são verificados. Se *all_frames* for ``False``, apenas o quadro mais recente é verificado.

source: This attribute has no effect if the traceback limit is ``1``. See the :func:`get_traceback_limit` function and :attr:`Snapshot.traceback_limit` attribute.
pt_pt: Este atributo não tem efeito se o limite do traceback for ``1``. Veja a função :func:`get_traceback_limit` e o atributo :attr:`Snapshot.traceback_limit`.

source: Frame
pt_pt: Quadro

source: Frame of a traceback.
pt_pt: Quadro de um traceback.

source: The :class:`Traceback` class is a sequence of :class:`Frame` instances.
pt_pt: A classe :class:`Traceback` é uma sequência de instâncias :class:`Frame`.

source: Filename (``str``).
pt_pt: Nome do ficheiro (``str``).

source: Line number (``int``).
pt_pt: Número de linha (``int``).

source: Snapshot of traces of memory blocks allocated by Python.
pt_pt: Snapshot de rastos de blocos de memória alocados pelo Python.

source: The :func:`take_snapshot` function creates a snapshot instance.
pt_pt: A função :func:`take_snapshot` cria uma instância de snapshot.

source: Compute the differences with an old snapshot. Get statistics as a sorted list of :class:`StatisticDiff` instances grouped by *key_type*.
pt_pt: Calcular as diferenças com um snapshot antigo. Obter estatísticas como uma lista ordenada de instâncias :class:`StatisticDiff` agrupadas por *key_type*.

source: See the :meth:`Snapshot.statistics` method for *key_type* and *cumulative* parameters.
pt_pt: Veja o método :meth:`Snapshot.statistics` para os parâmetros *key_type* e *cumulative*.

source: The result is sorted from the biggest to the smallest by: absolute value of :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, absolute value of :attr:`StatisticDiff.count_diff`, :attr:`Statistic.count` and then by :attr:`StatisticDiff.traceback`.
pt_pt: O resultado é ordenado do maior para o menor por: valor absoluto de :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, valor absoluto de :attr:`StatisticDiff.count_diff`, :attr:`Statistic.count` e depois por :attr:`StatisticDiff.traceback`.

source: Write the snapshot into a file.
pt_pt: Escrever o snapshot num ficheiro.

source: Use :meth:`load` to reload the snapshot.
pt_pt: Use :meth:`load` para recarregar o snapshot.

source: Create a new :class:`Snapshot` instance with a filtered :attr:`traces` sequence, *filters* is a list of :class:`DomainFilter` and :class:`Filter` instances. If *filters* is an empty list, return a new :class:`Snapshot` instance with a copy of the traces.
pt_pt: Criar uma nova instância :class:`Snapshot` com uma sequência :attr:`traces` filtrada, *filters* é uma lista de instâncias :class:`DomainFilter` e :class:`Filter`. Se *filters* for uma lista vazia, retorna uma nova instância :class:`Snapshot` com uma cópia dos rastos.

source: All inclusive filters are applied at once, a trace is ignored if no inclusive filters match it. A trace is ignored if at least one exclusive filter matches it.
pt_pt: Todos os filtros inclusivos são aplicados de uma vez, um rastro é ignorado se nenhum filtro inclusivo corresponder. Um rastro é ignorado se pelo menos um filtro exclusivo corresponder.

source: :class:`DomainFilter` instances are now also accepted in *filters*.
pt_pt: Instâncias :class:`DomainFilter` são agora também aceites em *filters*.

source: Load a snapshot from a file.
pt_pt: Carregar um snapshot de um ficheiro.

source: See also :meth:`dump`.
pt_pt: Veja também :meth:`dump`.

source: Get statistics as a sorted list of :class:`Statistic` instances grouped by *key_type*:
pt_pt: Obter estatísticas como uma lista ordenada de instâncias :class:`Statistic` agrupadas por *key_type*:

source: key_type
pt_pt: tipo de chave

source: description
pt_pt: descrição

source: filename
pt_pt: nome do ficheiro

source: filename and line number
pt_pt: nome do ficheiro e número de linha

source: If *cumulative* is ``True``, cumulate size and count of memory blocks of all frames of the traceback of a trace, not only the most recent frame. The cumulative mode can only be used with *key_type* equals to ``'filename'`` and ``'lineno'``.
pt_pt: Se *cumulative* for ``True``, acumular o tamanho e a contagem de blocos de memória de todos os quadros do traceback de um rastro, não apenas o quadro mais recente. O modo cumulativo só pode ser usado com *key_type* igual a ``'filename'`` e ``'lineno'``.

source: The result is sorted from the biggest to the smallest by: :attr:`Statistic.size`, :attr:`Statistic.count` and then by :attr:`Statistic.traceback`.
pt_pt: O resultado é ordenado do maior para o menor por: :attr:`Statistic.size`, :attr:`Statistic.count` e depois por :attr:`Statistic.traceback`.

source: Maximum number of frames stored in the traceback of :attr:`traces`: result of the :func:`get_traceback_limit` when the snapshot was taken.
pt_pt: Número máximo de quadros armazenados no traceback de :attr:`traces`: resultado de :func:`get_traceback_limit` quando o snapshot foi tirado.

source: Traces of all memory blocks allocated by Python: sequence of :class:`Trace` instances.
pt_pt: Rastos de todos os blocos de memória alocados pelo Python: sequência de instâncias :class:`Trace`.

source: The sequence has an undefined order. Use the :meth:`Snapshot.statistics` method to get a sorted list of statistics.
pt_pt: A sequência tem uma ordem indefinida. Use o método :meth:`Snapshot.statistics` para obter uma lista ordenada de estatísticas.

source: Statistic
pt_pt: Estatística

source: Statistic on memory allocations.
pt_pt: Estatística sobre alocações de memória.

source: :func:`Snapshot.statistics` returns a list of :class:`Statistic` instances.
pt_pt: :func:`Snapshot.statistics` retorna uma lista de instâncias :class:`Statistic`.

source: See also the :class:`StatisticDiff` class.
pt_pt: Veja também a classe :class:`StatisticDiff`.

source: Number of memory blocks (``int``).
pt_pt: Número de blocos de memória (``int``).

source: Total size of memory blocks in bytes (``int``).
pt_pt: Tamanho total dos blocos de memória em bytes (``int``).

source: Traceback where the memory block was allocated, :class:`Traceback` instance.
pt_pt: Traceback onde o bloco de memória foi alocado, instância :class:`Traceback`.

source: Statistic difference on memory allocations between an old and a new :class:`Snapshot` instance.
pt_pt: Diferença estatística nas alocações de memória entre uma instância antiga e nova :class:`Snapshot`.

source: :func:`Snapshot.compare_to` returns a list of :class:`StatisticDiff` instances. See also the :class:`Statistic` class.
pt_pt: :func:`Snapshot.compare_to` retorna uma lista de instâncias :class:`StatisticDiff`. Veja também a classe :class:`Statistic`.

source: Number of memory blocks in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
pt_pt: Número de blocos de memória no novo snapshot (``int``): ``0`` se os blocos de memória tiverem sido libertados no novo snapshot.

source: Difference of number of memory blocks between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
pt_pt: Diferença no número de blocos de memória entre os snapshots antigo e novo (``int``): ``0`` se os blocos de memória tiverem sido alocados no novo snapshot.

source: Total size of memory blocks in bytes in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
pt_pt: Tamanho total dos blocos de memória em bytes no novo snapshot (``int``): ``0`` se os blocos de memória tiverem sido libertados no novo snapshot.

source: Difference of total size of memory blocks in bytes between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
pt_pt: Diferença no tamanho total dos blocos de memória em bytes entre os snapshots antigo e novo (``int``): ``0`` se os blocos de memória tiverem sido alocados no novo snapshot.

source: Traceback where the memory blocks were allocated, :class:`Traceback` instance.
pt_pt: Traceback onde os blocos de memória foram alocados, instância :class:`Traceback`.

source: Trace
pt_pt: Rasto

source: Trace of a memory block.
pt_pt: Rasto de um bloco de memória.

source: The :attr:`Snapshot.traces` attribute is a sequence of :class:`Trace` instances.
pt_pt: O atributo :attr:`Snapshot.traces` é uma sequência de instâncias :class:`Trace`.

source: Size of the memory block in bytes (``int``).
pt_pt: Tamanho do bloco de memória em bytes (``int``).

source: Sequence of :class:`Frame` instances sorted from the oldest frame to the most recent frame.
pt_pt: Sequência de instâncias :class:`Frame` ordenadas do quadro mais antigo para o mais recente.

source: A traceback contains at least ``1`` frame. If the ``tracemalloc`` module failed to get a frame, the filename ``"<unknown>"`` at line number ``0`` is used.
pt_pt: Um traceback contém pelo menos ``1`` quadro. Se o módulo ``tracemalloc`` falhar ao obter um quadro, é usado o nome de ficheiro ``"<unknown>"`` no número de linha ``0``.

source: When a snapshot is taken, tracebacks of traces are limited to :func:`get_traceback_limit` frames. See the :func:`take_snapshot` function. The original number of frames of the traceback is stored in the :attr:`Traceback.total_nframe` attribute. That allows to know if a traceback has been truncated by the traceback limit.
pt_pt: Quando um snapshot é tirado, os tracebacks dos rastos são limitados a :func:`get_traceback_limit` quadros. Veja a função :func:`take_snapshot`. O número original de quadros do traceback é armazenado no atributo :attr:`Traceback.total_nframe`. Isso permite saber se um traceback foi truncado pelo limite do traceback.

source: The :attr:`Trace.traceback` attribute is an instance of :class:`Traceback` instance.
pt_pt: O atributo :attr:`Trace.traceback` é uma instância de instância :class:`Traceback`.

source: Frames are now sorted from the oldest to the most recent, instead of most recent to oldest.
pt_pt: Os quadros são agora ordenados do mais antigo para o mais recente, em vez de do mais recente para o mais antigo.

source: Total number of frames that composed the traceback before truncation. This attribute can be set to ``None`` if the information is not available.
pt_pt: Número total de quadros que compuseram o traceback antes da truncagem. Este atributo pode ser definido como ``None`` se a informação não estiver disponível.

source: The :attr:`Traceback.total_nframe` attribute was added.
pt_pt: O atributo :attr:`Traceback.total_nframe` foi adicionado.

source: Format the traceback as a list of lines. Use the :mod:`linecache` module to retrieve lines from the source code. If *limit* is set, format the *limit* most recent frames if *limit* is positive. Otherwise, format the ``abs(limit)`` oldest frames. If *most_recent_first* is ``True``, the order of the formatted frames is reversed, returning the most recent frame first instead of last.
pt_pt: Formatar o traceback como uma lista de linhas. Use o módulo :mod:`linecache` para recuperar linhas do código-fonte. Se *limit* estiver definido, formate os *limit* quadros mais recentes se *limit* for positivo. Caso contrário, formate os ``abs(limit)`` quadros mais antigos. Se *most_recent_first* for ``True``, a ordem dos quadros formatados é invertida, retornando o quadro mais recente primeiro em vez de último.

source: Example::
pt_pt: Exemplo::
