Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/traceback.po
Languages: pt_pt

source: **Source code:** :source:`Lib/traceback.py`
pt_pt: **Código-fonte:** :source:`Lib/traceback.py`

source: The module uses :ref:`traceback objects <traceback-objects>` --- these are objects of type :class:`types.TracebackType`, which are assigned to the :attr:`~BaseException.__traceback__` field of :class:`BaseException` instances.
pt_pt: O módulo usa :ref:`objetos traceback <traceback-objects>` — estes são objetos do tipo :class:`types.TracebackType`, que são atribuídos ao campo :attr:`~BaseException.__traceback__` de instâncias de :class:`BaseException`.

source: Module :mod:`faulthandler`
pt_pt: Módulo :mod:`faulthandler`

source: Used to dump Python tracebacks explicitly, on a fault, after a timeout, or on a user signal.
pt_pt: Usado para descarregar tracebacks de Python explicitamente, em caso de falha, após um tempo limite ou em resposta a um sinal do utilizador.

source: Module :mod:`pdb`
pt_pt: Módulo :mod:`pdb`

source: Interactive source code debugger for Python programs.
pt_pt: Depurador interativo de código-fonte para programas Python.

source: Print up to *limit* stack trace entries from :ref:`traceback object <traceback-objects>` *tb* (starting from the caller's frame) if *limit* is positive. Otherwise, print the last ``abs(limit)`` entries. If *limit* is omitted or ``None``, all entries are printed. If *file* is omitted or ``None``, the output goes to :data:`sys.stderr`; otherwise it should be an open :term:`file <file object>` or :term:`file-like object` to receive the output.
pt_pt: Imprime até *limit* entradas de traceback da pilha a partir do :ref:`objeto traceback <traceback-objects>` *tb* (a partir do quadro do chamador) se *limit* for positivo. Caso contrário, imprime as últimas ``abs(limit)`` entradas. Se *limit* for omitido ou ``None``, todas as entradas são impressas. Se *file* for omitido ou ``None``, a saída vai para :data:`sys.stderr`; caso contrário, deve ser um :term:`ficheiro <file object>` ou :term:`objeto tipo ficheiro` aberto para receber a saída.

source: Added negative *limit* support.
pt_pt: Adicionado suporte para *limit* negativo.

source: Print exception information and stack trace entries from :ref:`traceback object <traceback-objects>` *tb* to *file*. This differs from :func:`print_tb` in the following ways:
pt_pt: Imprime informações da exceção e entradas de traceback da pilha a partir do :ref:`objeto traceback <traceback-objects>` *tb* para *file*. Isto difere de :func:`print_tb` nas seguintes formas:

source: if *tb* is not ``None``, it prints a header ``Traceback (most recent call last):``
pt_pt: se *tb* não for ``None``, imprime um cabeçalho ``Traceback (most recent call last):``

source: it prints the exception type and *value* after the stack trace
pt_pt: imprime o tipo de exceção e *value* após o traceback da pilha

source: if *type(value)* is :exc:`SyntaxError` and *value* has the appropriate format, it prints the line where the syntax error occurred with a caret indicating the approximate position of the error.
pt_pt: se *type(value)* for :exc:`SyntaxError` e *value* tiver o formato apropriado, imprime a linha onde ocorreu o erro de sintaxe com um acento circunflexo a indicar a posição aproximada do erro.

source: Since Python 3.10, instead of passing *value* and *tb*, an exception object can be passed as the first argument. If *value* and *tb* are provided, the first argument is ignored in order to provide backwards compatibility.
pt_pt: A partir do Python 3.10, em vez de passar *value* e *tb*, um objeto de exceção pode ser passado como o primeiro argumento. Se *value* e *tb* forem fornecidos, o primeiro argumento é ignorado para garantir compatibilidade retroativa.

source: The optional *limit* argument has the same meaning as for :func:`print_tb`. If *chain* is true (the default), then chained exceptions (the :attr:`~BaseException.__cause__` or :attr:`~BaseException.__context__` attributes of the exception) will be printed as well, like the interpreter itself does when printing an unhandled exception.
pt_pt: O argumento opcional *limit* tem o mesmo significado que em :func:`print_tb`. Se *chain* for verdadeiro (predefinição), então exceções encadeadas (os atributos :attr:`~BaseException.__cause__` ou :attr:`~BaseException.__context__` da exceção) também serão impressas, como o próprio interpretador faz ao imprimir uma exceção não tratada.

source: The *etype* argument is ignored and inferred from the type of *value*.
pt_pt: O argumento *etype* é ignorado e inferido a partir do tipo de *value*.

source: The *etype* parameter has been renamed to *exc* and is now positional-only.
pt_pt: O parâmetro *etype* foi renomeado para *exc* e agora é apenas posicional.

source: Print up to *limit* stack trace entries (starting from the invocation point) if *limit* is positive. Otherwise, print the last ``abs(limit)`` entries. If *limit* is omitted or ``None``, all entries are printed. The optional *f* argument can be used to specify an alternate :ref:`stack frame <frame-objects>` to start. The optional *file* argument has the same meaning as for :func:`print_tb`.
pt_pt: Imprime até *limit* entradas de traceback da pilha (a partir do ponto de invocação) se *limit* for positivo. Caso contrário, imprime as últimas ``abs(limit)`` entradas. Se *limit* for omitido ou ``None``, todas as entradas são impressas. O argumento opcional *f* pode ser usado para especificar um :ref:`quadro de pilha <frame-objects>` alternativo para iniciar. O argumento opcional *file* tem o mesmo significado que em :func:`print_tb`.

source: Return a :class:`StackSummary` object representing a list of "pre-processed" stack trace entries extracted from the :ref:`traceback object <traceback-objects>` *tb*. It is useful for alternate formatting of stack traces. The optional *limit* argument has the same meaning as for :func:`print_tb`. A "pre-processed" stack trace entry is a :class:`FrameSummary` object containing attributes :attr:`~FrameSummary.filename`, :attr:`~FrameSummary.lineno`, :attr:`~FrameSummary.name`, and :attr:`~FrameSummary.line` representing the information that is usually printed for a stack trace.
pt_pt: Devolve um objeto :class:`StackSummary` que representa uma lista de entradas de traceback da pilha "pré-processadas" extraídas do :ref:`objeto traceback <traceback-objects>` *tb*. É útil para formatação alternativa de tracebacks da pilha. O argumento opcional *limit* tem o mesmo significado que em :func:`print_tb`. Uma entrada de traceback da pilha "pré-processada" é um objeto :class:`FrameSummary` contendo atributos :attr:`~FrameSummary.filename`, :attr:`~FrameSummary.lineno`, :attr:`~FrameSummary.name` e :attr:`~FrameSummary.line` que representam a informação que é normalmente impressa para um traceback da pilha.

source: Extract the raw traceback from the current :ref:`stack frame <frame-objects>`. The return value has the same format as for :func:`extract_tb`. The optional *f* and *limit* arguments have the same meaning as for :func:`print_stack`.
pt_pt: Extrai o traceback bruto do :ref:`quadro de pilha <frame-objects>` atual. O valor de retorno tem o mesmo formato que em :func:`extract_tb`. Os argumentos opcionais *f* e *limit* têm o mesmo significado que em :func:`print_stack`.

source: Given a list of tuples or :class:`FrameSummary` objects as returned by :func:`extract_tb` or :func:`extract_stack`, return a list of strings ready for printing. Each string in the resulting list corresponds to the item with the same index in the argument list. Each string ends in a newline; the strings may contain internal newlines as well, for those items whose source text line is not ``None``.
pt_pt: Dada uma lista de tuplos ou objetos :class:`FrameSummary` devolvida por :func:`extract_tb` ou :func:`extract_stack`, devolve uma lista de strings prontas para impressão. Cada string na lista resultante corresponde ao item com o mesmo índice na lista de argumentos. Cada string termina com uma nova linha; as strings podem conter novas linhas internas também, para os itens cuja linha de texto-fonte não é ``None``.

source: Format the exception part of a traceback using an exception value such as given by :data:`sys.last_value`. The return value is a list of strings, each ending in a newline. The list contains the exception's message, which is normally a single string; however, for :exc:`SyntaxError` exceptions, it contains several lines that (when printed) display detailed information about where the syntax error occurred. Following the message, the list contains the exception's :attr:`notes <BaseException.__notes__>`.
pt_pt: Formata a parte da exceção de um traceback usando um valor de exceção, como o fornecido por :data:`sys.last_value`. O valor de retorno é uma lista de strings, cada uma terminando com uma nova linha. A lista contém a mensagem da exceção, que normalmente é uma única string; no entanto, para exceções :exc:`SyntaxError`, contém várias linhas que (quando impressas) mostram informações detalhadas sobre onde ocorreu o erro de sintaxe. Após a mensagem, a lista contém as :attr:`notas <BaseException.__notes__>` da exceção.

source: Since Python 3.10, instead of passing *value*, an exception object can be passed as the first argument. If *value* is provided, the first argument is ignored in order to provide backwards compatibility.
pt_pt: A partir do Python 3.10, em vez de passar *value*, um objeto de exceção pode ser passado como o primeiro argumento. Se *value* for fornecido, o primeiro argumento é ignorado para garantir compatibilidade retroativa.

source: The returned list now includes any :attr:`notes <BaseException.__notes__>` attached to the exception.
pt_pt: A lista devolvida agora inclui quaisquer :attr:`notas <BaseException.__notes__>` anexadas à exceção.

source: Format a stack trace and the exception information. The arguments have the same meaning as the corresponding arguments to :func:`print_exception`. The return value is a list of strings, each ending in a newline and some containing internal newlines. When these lines are concatenated and printed, exactly the same text is printed as does :func:`print_exception`.
pt_pt: Formata um traceback da pilha e as informações da exceção. Os argumentos têm o mesmo significado que os argumentos correspondentes em :func:`print_exception`. O valor de retorno é uma lista de strings, cada uma terminando com uma nova linha e algumas contendo novas linhas internas. Quando estas linhas são concatenadas e impressas, o texto impresso é exatamente o mesmo que :func:`print_exception`.

source: This function's behavior and signature were modified to match :func:`print_exception`.
pt_pt: O comportamento e a assinatura desta função foram modificados para corresponder a :func:`print_exception`.

source: This is like ``print_exc(limit)`` but returns a string instead of printing to a file.
pt_pt: Isto é semelhante a ``print_exc(limit)``, mas devolve uma string em vez de imprimir para um ficheiro.

source: A shorthand for ``format_list(extract_tb(tb, limit))``.
pt_pt: Um atalho para ``format_list(extract_tb(tb, limit))``.

source: A shorthand for ``format_list(extract_stack(f, limit))``.
pt_pt: Um atalho para ``format_list(extract_stack(f, limit))``.

source: Clears the local variables of all the stack frames in a :ref:`traceback <traceback-objects>` *tb* by calling the :meth:`~frame.clear` method of each :ref:`frame object <frame-objects>`.
pt_pt: Limpa as variáveis locais de todos os quadros de pilha num :ref:`traceback <traceback-objects>` *tb* chamando o método :meth:`~frame.clear` de cada :ref:`objeto quadro <frame-objects>`.

source: Walk a stack following :attr:`f.f_back <frame.f_back>` from the given frame, yielding the frame and line number for each frame. If *f* is ``None``, the current stack is used. This helper is used with :meth:`StackSummary.extract`.
pt_pt: Percorre uma pilha seguindo :attr:`f.f_back <frame.f_back>` a partir do quadro dado, produzindo o quadro e o número da linha para cada quadro. Se *f* for ``None``, a pilha atual é usada. Este auxiliar é usado com :meth:`StackSummary.extract`.

source: Walk a traceback following :attr:`~traceback.tb_next` yielding the frame and line number for each frame. This helper is used with :meth:`StackSummary.extract`.
pt_pt: Percorre um traceback seguindo :attr:`~traceback.tb_next`, produzindo o quadro e o número da linha para cada quadro. Este auxiliar é usado com :meth:`StackSummary.extract`.

source: :class:`!TracebackException` Objects
pt_pt: Objetos :class:`!TracebackException`

source: Capture an exception for later rendering. *limit*, *lookup_lines* and *capture_locals* are as for the :class:`StackSummary` class.
pt_pt: Captura uma exceção para renderização posterior. *limit*, *lookup_lines* e *capture_locals* são como na classe :class:`StackSummary`.

source: If *compact* is true, only data that is required by :class:`!TracebackException`'s :meth:`format` method is saved in the class attributes. In particular, the :attr:`__context__` field is calculated only if :attr:`__cause__` is ``None`` and :attr:`__suppress_context__` is false.
pt_pt: Se *compact* for verdadeiro, apenas os dados necessários para o método :meth:`format` de :class:`!TracebackException` são guardados nos atributos da classe. Em particular, o campo :attr:`__context__` é calculado apenas se :attr:`__cause__` for ``None`` e :attr:`__suppress_context__` for falso.

source: Note that when locals are captured, they are also shown in the traceback.
pt_pt: Note que quando as variáveis locais são capturadas, também são mostradas no traceback.

source: *max_group_width* and *max_group_depth* control the formatting of exception groups (see :exc:`BaseExceptionGroup`). The depth refers to the nesting level of the group, and the width refers to the size of a single exception group's exceptions array. The formatted output is truncated when either limit is exceeded.
pt_pt: *max_group_width* e *max_group_depth* controlam a formatação de grupos de exceções (veja :exc:`BaseExceptionGroup`). A profundidade refere-se ao nível de aninhamento do grupo, e a largura refere-se ao tamanho do array de exceções de um único grupo de exceções. A saída formatada é truncada quando qualquer um dos limites é excedido.

source: Added the *compact* parameter.
pt_pt: Adicionado o parâmetro *compact*.

source: Added the *max_group_width* and *max_group_depth* parameters.
pt_pt: Adicionados os parâmetros *max_group_width* e *max_group_depth*.

source: A :class:`!TracebackException` of the original :attr:`~BaseException.__cause__`.
pt_pt: Uma :class:`!TracebackException` da :attr:`~BaseException.__cause__` original.

source: A :class:`!TracebackException` of the original :attr:`~BaseException.__context__`.
pt_pt: Uma :class:`!TracebackException` do :attr:`~BaseException.__context__` original.

source: If ``self`` represents an :exc:`ExceptionGroup`, this field holds a list of :class:`!TracebackException` instances representing the nested exceptions. Otherwise it is ``None``.
pt_pt: Se ``self`` representar um :exc:`ExceptionGroup`, este campo contém uma lista de instâncias :class:`!TracebackException` que representam as exceções aninhadas. Caso contrário, é ``None``.

source: The :attr:`~BaseException.__suppress_context__` value from the original exception.
pt_pt: O valor :attr:`~BaseException.__suppress_context__` da exceção original.

source: The :attr:`~BaseException.__notes__` value from the original exception, or ``None`` if the exception does not have any notes. If it is not ``None`` is it formatted in the traceback after the exception string.
pt_pt: O valor :attr:`~BaseException.__notes__` da exceção original, ou ``None`` se a exceção não tiver notas. Se não for ``None``, é formatado no traceback após a string da exceção.

source: A :class:`StackSummary` representing the traceback.
pt_pt: Um :class:`StackSummary` que representa o traceback.

source: The class of the original traceback.
pt_pt: A classe do traceback original.

source: For syntax errors - the file name where the error occurred.
pt_pt: Para erros de sintaxe — o nome do ficheiro onde o erro ocorreu.

source: For syntax errors - the line number where the error occurred.
pt_pt: Para erros de sintaxe — o número da linha onde o erro ocorreu.

source: For syntax errors - the end line number where the error occurred. Can be ``None`` if not present.
pt_pt: Para erros de sintaxe — o número da linha final onde o erro ocorreu. Pode ser ``None`` se não estiver presente.

source: For syntax errors - the text where the error occurred.
pt_pt: Para erros de sintaxe — o texto onde o erro ocorreu.

source: For syntax errors - the offset into the text where the error occurred.
pt_pt: Para erros de sintaxe — o deslocamento no texto onde o erro ocorreu.

source: For syntax errors - the end offset into the text where the error occurred. Can be ``None`` if not present.
pt_pt: Para erros de sintaxe — o deslocamento final no texto onde o erro ocorreu. Pode ser ``None`` se não estiver presente.

source: For syntax errors - the compiler error message.
pt_pt: Para erros de sintaxe — a mensagem de erro do compilador.

source: Print to *file* (default ``sys.stderr``) the exception information returned by :meth:`format`.
pt_pt: Imprime em *file* (predefinido ``sys.stderr``) as informações da exceção devolvidas por :meth:`format`.

source: Format the exception.
pt_pt: Formata a exceção.

source: If *chain* is not ``True``, :attr:`__cause__` and :attr:`__context__` will not be formatted.
pt_pt: Se *chain* não for ``True``, :attr:`__cause__` e :attr:`__context__` não serão formatados.

source: The return value is a generator of strings, each ending in a newline and some containing internal newlines. :func:`~traceback.print_exception` is a wrapper around this method which just prints the lines to a file.
pt_pt: O valor de retorno é um gerador de strings, cada uma terminando com uma nova linha e algumas contendo novas linhas internas. :func:`~traceback.print_exception` é um invólucro em torno deste método que simplesmente imprime as linhas para um ficheiro.

source: Format the exception part of the traceback.
pt_pt: Formata a parte da exceção do traceback.

source: The return value is a generator of strings, each ending in a newline.
pt_pt: O valor de retorno é um gerador de strings, cada uma terminando com uma nova linha.

source: The exception's :attr:`notes <BaseException.__notes__>` are now included in the output.
pt_pt: As :attr:`notas <BaseException.__notes__>` da exceção agora estão incluídas na saída.

source: :class:`!StackSummary` Objects
pt_pt: Objetos :class:`!StackSummary`

source: :class:`!StackSummary` objects represent a call stack ready for formatting.
pt_pt: Os objetos :class:`!StackSummary` representam uma pilha de chamadas pronta para formatação.

source: Construct a :class:`!StackSummary` object from a frame generator (such as is returned by :func:`~traceback.walk_stack` or :func:`~traceback.walk_tb`).
pt_pt: Constrói um objeto :class:`!StackSummary` a partir de um gerador de quadros (como o devolvido por :func:`~traceback.walk_stack` ou :func:`~traceback.walk_tb`).

source: If *limit* is supplied, only this many frames are taken from *frame_gen*. If *lookup_lines* is ``False``, the returned :class:`FrameSummary` objects will not have read their lines in yet, making the cost of creating the :class:`!StackSummary` cheaper (which may be valuable if it may not actually get formatted). If *capture_locals* is ``True`` the local variables in each :class:`!FrameSummary` are captured as object representations.
pt_pt: Se *limit* for fornecido, apenas este número de quadros é obtido de *frame_gen*. Se *lookup_lines* for ``False``, os objetos :class:`FrameSummary` devolvidos ainda não terão lido as suas linhas, tornando mais barato a criação do :class:`!StackSummary` (o que pode ser valioso se não for realmente formatado). Se *capture_locals* for ``True``, as variáveis locais em cada :class:`!FrameSummary` são capturadas como representações de objetos.

source: Construct a :class:`!StackSummary` object from a supplied list of :class:`FrameSummary` objects or old-style list of tuples. Each tuple should be a 4-tuple with *filename*, *lineno*, *name*, *line* as the elements.
pt_pt: Constrói um objeto :class:`!StackSummary` a partir de uma lista fornecida de objetos :class:`FrameSummary` ou de uma lista antiga de tuplos. Cada tuplo deve ser um 4-tuplo com *filename*, *lineno*, *name*, *line* como elementos.

source: Returns a list of strings ready for printing. Each string in the resulting list corresponds to a single :ref:`frame <frame-objects>` from the stack. Each string ends in a newline; the strings may contain internal newlines as well, for those items with source text lines.
pt_pt: Devolve uma lista de strings prontas para impressão. Cada string na lista resultante corresponde a um único :ref:`quadro <frame-objects>` da pilha. Cada string termina com uma nova linha; as strings podem conter novas linhas internas também, para os itens com linhas de texto-fonte.

source: For long sequences of the same frame and line, the first few repetitions are shown, followed by a summary line stating the exact number of further repetitions.
pt_pt: Para sequências longas do mesmo quadro e linha, as primeiras repetições são mostradas, seguidas por uma linha de resumo indicando o número exato de repetições adicionais.

source: Long sequences of repeated frames are now abbreviated.
pt_pt: Sequências longas de quadros repetidos agora são abreviadas.

source: Returns a string for printing one of the :ref:`frames <frame-objects>` involved in the stack. This method is called for each :class:`FrameSummary` object to be printed by :meth:`StackSummary.format`. If it returns ``None``, the frame is omitted from the output.
pt_pt: Devolve uma string para imprimir um dos :ref:`quadros <frame-objects>` envolvidos na pilha. Este método é chamado para cada objeto :class:`FrameSummary` a ser impresso por :meth:`StackSummary.format`. Se devolver ``None``, o quadro é omitido da saída.

source: :class:`!FrameSummary` Objects
pt_pt: Objetos :class:`!FrameSummary`

source: A :class:`!FrameSummary` object represents a single :ref:`frame <frame-objects>` in a :ref:`traceback <traceback-objects>`.
pt_pt: Um objeto :class:`!FrameSummary` representa um único :ref:`quadro <frame-objects>` num :ref:`traceback <traceback-objects>`.

source: :class:`!FrameSummary` instances have the following attributes:
pt_pt: As instâncias de :class:`!FrameSummary` têm os seguintes atributos:

source: The filename of the source code for this frame. Equivalent to accessing :attr:`f.f_code.co_filename <codeobject.co_filename>` on a :ref:`frame object <frame-objects>` *f*.
pt_pt: O nome do ficheiro do código-fonte para este quadro. Equivalente a aceder a :attr:`f.f_code.co_filename <codeobject.co_filename>` num :ref:`objeto quadro <frame-objects>` *f*.

source: The line number of the source code for this frame.
pt_pt: O número da linha do código-fonte para este quadro.

source: Equivalent to accessing :attr:`f.f_code.co_name <codeobject.co_name>` on a :ref:`frame object <frame-objects>` *f*.
pt_pt: Equivalente a aceder a :attr:`f.f_code.co_name <codeobject.co_name>` num :ref:`objeto quadro <frame-objects>` *f*.

source: A string representing the source code for this frame, with leading and trailing whitespace stripped. If the source is not available, it is ``None``.
pt_pt: Uma string que representa o código-fonte para este quadro, com espaços em branco iniciais e finais removidos. Se o código-fonte não estiver disponível, é ``None``.
