Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tracemalloc.po
Languages: pt_pt

source: :mod:`!tracemalloc` --- Trace memory allocations
pt_pt: :mod:`!tracemalloc` --- Rastrear alocações de memória

source: **Source code:** :source:`Lib/tracemalloc.py`
pt_pt: **Código-fonte:** :source:`Lib/tracemalloc.py`

source: The tracemalloc module is a debug tool to trace memory blocks allocated by Python. It provides the following information:
pt_pt: O módulo tracemalloc é uma ferramenta de depuração para rastrear blocos de memória alocados pelo Python. Fornece as seguintes informações:

source: Traceback where an object was allocated
pt_pt: Traceback onde um objeto foi alocado

source: Statistics on allocated memory blocks per filename and per line number: total size, number and average size of allocated memory blocks
pt_pt: Estatísticas sobre blocos de memória alocados por nome de ficheiro e número de linha: tamanho total, número e tamanho médio dos blocos de memória alocados

source: Compute the differences between two snapshots to detect memory leaks
pt_pt: Calcular as diferenças entre dois *snapshots* para detetar fugas de memória

source: To trace most memory blocks allocated by Python, the module should be started as early as possible by setting the :envvar:`PYTHONTRACEMALLOC` environment variable to ``1``, or by using :option:`-X` ``tracemalloc`` command line option. The :func:`tracemalloc.start` function can be called at runtime to start tracing Python memory allocations.
pt_pt: Para rastrear a maioria dos blocos de memória alocados pelo Python, o módulo deve ser iniciado o mais cedo possível, definindo a variável de ambiente :envvar:`PYTHONTRACEMALLOC` para ``1``, ou usando a opção de linha de comando :option:`-X` ``tracemalloc``. A função :func:`tracemalloc.start` pode ser chamada em tempo de execução para iniciar o rastreio de alocações de memória do Python.

source: By default, a trace of an allocated memory block only stores the most recent frame (1 frame). To store 25 frames at startup: set the :envvar:`PYTHONTRACEMALLOC` environment variable to ``25``, or use the :option:`-X` ``tracemalloc=25`` command line option.
pt_pt: Por predefinição, um rastreio de um bloco de memória alocado armazena apenas o quadro mais recente (1 quadro). Para armazenar 25 quadros na inicialização: defina a variável de ambiente :envvar:`PYTHONTRACEMALLOC` para ``25``, ou use a opção de linha de comando :option:`-X` ``tracemalloc=25``.

source: Examples
pt_pt: Exemplos

source: Display the top 10
pt_pt: Mostrar os 10 principais

source: Display the 10 files allocating the most memory::
pt_pt: Mostrar os 10 ficheiros que alocam mais memória:

source: import tracemalloc tracemalloc.start() # ... run your application ... snapshot = tracemalloc.take_snapshot() top_stats = snapshot.statistics('lineno') print("[ Top 10 ]") for stat in top_stats[:10]: print(stat)
pt_pt: import tracemalloc tracemalloc.start() # ... execute a sua aplicação ... snapshot = tracemalloc.take_snapshot() top_stats = snapshot.statistics('lineno') print("[ Top 10 ]") for stat in top_stats[:10]: print(stat)

source: Example of output of the Python test suite::
pt_pt: Exemplo de saída da suíte de teste do Python:

source: [ Top 10 ] <frozen importlib._bootstrap>:716: size=4855 KiB, count=39328, average=126 B <frozen importlib._bootstrap>:284: size=521 KiB, count=3199, average=167 B /usr/lib/python3.4/collections/__init__.py:368: size=244 KiB, count=2315, average=108 B /usr/lib/python3.4/unittest/case.py:381: size=185 KiB, count=779, average=243 B /usr/lib/python3.4/unittest/case.py:402: size=154 KiB, count=378, average=416 B /usr/lib/python3.4/abc.py:133: size=88.7 KiB, count=347, average=262 B <frozen importlib._bootstrap>:1446: size=70.4 KiB, count=911, average=79 B <frozen importlib._bootstrap>:1454: size=52.0 KiB, count=25, average=2131 B <string>:5: size=49.7 KiB, count=148, average=344 B /usr/lib/python3.4/sysconfig.py:411: size=48.0 KiB, count=1, average=48.0 KiB
pt_pt: [ Top 10 ] <frozen importlib._bootstrap>:716: tamanho=4855 KiB, contagem=39328, média=126 B <frozen importlib._bootstrap>:284: tamanho=521 KiB, contagem=3199, média=167 B /usr/lib/python3.4/collections/__init__.py:368: tamanho=244 KiB, contagem=2315, média=108 B /usr/lib/python3.4/unittest/case.py:381: tamanho=185 KiB, contagem=779, média=243 B /usr/lib/python3.4/unittest/case.py:402: tamanho=154 KiB, contagem=378, média=416 B /usr/lib/python3.4/abc.py:133: tamanho=88.7 KiB, contagem=347, média=262 B <frozen importlib._bootstrap>:1446: tamanho=70.4 KiB, contagem=911, média=79 B <frozen importlib._bootstrap>:1454: tamanho=52.0 KiB, contagem=25, média=2131 B <string>:5: tamanho=49.7 KiB, contagem=148, média=344 B /usr/lib/python3.4/sysconfig.py:411: tamanho=48.0 KiB, contagem=1, média=48.0 KiB

source: We can see that Python loaded ``4855 KiB`` data (bytecode and constants) from modules and that the :mod:`collections` module allocated ``244 KiB`` to build :class:`~collections.namedtuple` types.
pt_pt: Podemos ver que o Python carregou ``4855 KiB`` de dados (bytecode e constantes) de módulos e que o módulo :mod:`collections` alocou ``244 KiB`` para construir tipos :class:`~collections.namedtuple`.

source: See :meth:`Snapshot.statistics` for more options.
pt_pt: Consulte :meth:`Snapshot.statistics` para mais opções.

source: Compute differences
pt_pt: Calcular diferenças

source: Take two snapshots and display the differences::
pt_pt: Tire dois *snapshots* e mostre as diferenças:

source: import tracemalloc tracemalloc.start() # ... start your application ... snapshot1 = tracemalloc.take_snapshot() # ... call the function leaking memory ... snapshot2 = tracemalloc.take_snapshot() top_stats = snapshot2.compare_to(snapshot1, 'lineno') print("[ Top 10 differences ]") for stat in top_stats[:10]: print(stat)
pt_pt: import tracemalloc tracemalloc.start() # ... inicie a sua aplicação ... snapshot1 = tracemalloc.take_snapshot() # ... chame a função com fuga de memória ... snapshot2 = tracemalloc.take_snapshot() top_stats = snapshot2.compare_to(snapshot1, 'lineno') print("[ Top 10 diferenças ]") for stat in top_stats[:10]: print(stat)

source: Example of output before/after running some tests of the Python test suite::
pt_pt: Exemplo de saída antes/depois de executar alguns testes da suíte de teste do Python:

source: [ Top 10 differences ] <frozen importlib._bootstrap>:716: size=8173 KiB (+4428 KiB), count=71332 (+39369), average=117 B /usr/lib/python3.4/linecache.py:127: size=940 KiB (+940 KiB), count=8106 (+8106), average=119 B /usr/lib/python3.4/unittest/case.py:571: size=298 KiB (+298 KiB), count=589 (+589), average=519 B <frozen importlib._bootstrap>:284: size=1005 KiB (+166 KiB), count=7423 (+1526), average=139 B /usr/lib/python3.4/mimetypes.py:217: size=112 KiB (+112 KiB), count=1334 (+1334), average=86 B /usr/lib/python3.4/http/server.py:848: size=96.0 KiB (+96.0 KiB), count=1 (+1), average=96.0 KiB /usr/lib/python3.4/inspect.py:1465: size=83.5 KiB (+83.5 KiB), count=109 (+109), average=784 B /usr/lib/python3.4/unittest/mock.py:491: size=77.7 KiB (+77.7 KiB), count=143 (+143), average=557 B /usr/lib/python3.4/urllib/parse.py:476: size=71.8 KiB (+71.8 KiB), count=969 (+969), average=76 B /usr/lib/python3.4/contextlib.py:38: size=67.2 KiB (+67.2 KiB), count=126 (+126), average=546 B
pt_pt: [ Top 10 diferenças ] <frozen importlib._bootstrap>:716: tamanho=8173 KiB (+4428 KiB), contagem=71332 (+39369), média=117 B /usr/lib/python3.4/linecache.py:127: tamanho=940 KiB (+940 KiB), contagem=8106 (+8106), média=119 B /usr/lib/python3.4/unittest/case.py:571: tamanho=298 KiB (+298 KiB), contagem=589 (+589), média=519 B <frozen importlib._bootstrap>:284: tamanho=1005 KiB (+166 KiB), contagem=7423 (+1526), média=139 B /usr/lib/python3.4/mimetypes.py:217: tamanho=112 KiB (+112 KiB), contagem=1334 (+1334), média=86 B /usr/lib/python3.4/http/server.py:848: tamanho=96.0 KiB (+96.0 KiB), contagem=1 (+1), média=96.0 KiB /usr/lib/python3.4/inspect.py:1465: tamanho=83.5 KiB (+83.5 KiB), contagem=109 (+109), média=784 B /usr/lib/python3.4/unittest/mock.py:491: tamanho=77.7 KiB (+77.7 KiB), contagem=143 (+143), média=557 B /usr/lib/python3.4/urllib/parse.py:476: tamanho=71.8 KiB (+71.8 KiB), contagem=969 (+969), média=76 B /usr/lib/python3.4/contextlib.py:38: tamanho=67.2 KiB (+67.2 KiB), contagem=126 (+126), média=546 B

source: We can see that Python has loaded ``8173 KiB`` of module data (bytecode and constants), and that this is ``4428 KiB`` more than had been loaded before the tests, when the previous snapshot was taken. Similarly, the :mod:`linecache` module has cached ``940 KiB`` of Python source code to format tracebacks, all of it since the previous snapshot.
pt_pt: Podemos ver que o Python carregou ``8173 KiB`` de dados de módulo (bytecode e constantes), e que isto é ``4428 KiB`` a mais do que tinha sido carregado antes dos testes, quando o *snapshot* anterior foi tirado. Da mesma forma, o módulo :mod:`linecache` armazenou em cache ``940 KiB`` de código-fonte Python para formatar tracebacks, tudo isso desde o *snapshot* anterior.

source: If the system has little free memory, snapshots can be written on disk using the :meth:`Snapshot.dump` method to analyze the snapshot offline. Then use the :meth:`Snapshot.load` method reload the snapshot.
pt_pt: Se o sistema tiver pouca memória livre, os *snapshots* podem ser escritos em disco usando o método :meth:`Snapshot.dump` para analisar o *snapshot* offline. Em seguida, use o método :meth:`Snapshot.load` para recarregar o *snapshot*.

source: Get the traceback of a memory block
pt_pt: Obter o traceback de um bloco de memória

source: Code to display the traceback of the biggest memory block::
pt_pt: Código para mostrar o traceback do maior bloco de memória:

source: import tracemalloc # Store 25 frames tracemalloc.start(25) # ... run your application ... snapshot = tracemalloc.take_snapshot() top_stats = snapshot.statistics('traceback') # pick the biggest memory block stat = top_stats[0] print("%s memory blocks: %.1f KiB" % (stat.count, stat.size / 1024)) for line in stat.traceback.format(): print(line)
pt_pt: import tracemalloc # Armazenar 25 quadros tracemalloc.start(25) # ... execute a sua aplicação ... snapshot = tracemalloc.take_snapshot() top_stats = snapshot.statistics('traceback') # escolher o maior bloco de memória stat = top_stats[0] print("%s blocos de memória: %.1f KiB" % (stat.count, stat.size / 1024)) for line in stat.traceback.format(): print(line)

source: Example of output of the Python test suite (traceback limited to 25 frames)::
pt_pt: Exemplo de saída da suíte de teste do Python (traceback limitado a 25 quadros):

source: 903 memory blocks: 870.1 KiB File "<frozen importlib._bootstrap>", line 716 File "<frozen importlib._bootstrap>", line 1036 File "<frozen importlib._bootstrap>", line 934 File "<frozen importlib._bootstrap>", line 1068 File "<frozen importlib._bootstrap>", line 619 File "<frozen importlib._bootstrap>", line 1581 File "<frozen importlib._bootstrap>", line 1614 File "/usr/lib/python3.4/doctest.py", line 101 import pdb File "<frozen importlib._bootstrap>", line 284 File "<frozen importlib._bootstrap>", line 938 File "<frozen importlib._bootstrap>", line 1068 File "<frozen importlib._bootstrap>", line 619 File "<frozen importlib._bootstrap>", line 1581 File "<frozen importlib._bootstrap>", line 1614 File "/usr/lib/python3.4/test/support/__init__.py", line 1728 import doctest File "/usr/lib/python3.4/test/test_pickletools.py", line 21 support.run_doctest(pickletools) File "/usr/lib/python3.4/test/regrtest.py", line 1276 test_runner() File "/usr/lib/python3.4/test/regrtest.py", line 976 display_failure=not verbose) File "/usr/lib/python3.4/test/regrtest.py", line 761 match_tests=ns.match_tests) File "/usr/lib/python3.4/test/regrtest.py", line 1563 main() File "/usr/lib/python3.4/test/__main__.py", line 3 regrtest.main_in_temp_cwd() File "/usr/lib/python3.4/runpy.py", line 73 exec(code, run_globals) File "/usr/lib/python3.4/runpy.py", line 160 "__main__", fname, loader, pkg_name)
pt_pt: 903 blocos de memória: 870.1 KiB Ficheiro "<frozen importlib._bootstrap>", linha 716 Ficheiro "<frozen importlib._bootstrap>", linha 1036 Ficheiro "<frozen importlib._bootstrap>", linha 934 Ficheiro "<frozen importlib._bootstrap>", linha 1068 Ficheiro "<frozen importlib._bootstrap>", linha 619 Ficheiro "<frozen importlib._bootstrap>", linha 1581 Ficheiro "<frozen importlib._bootstrap>", linha 1614 Ficheiro "/usr/lib/python3.4/doctest.py", linha 101 import pdb Ficheiro "<frozen importlib._bootstrap>", linha 284 Ficheiro "<frozen importlib._bootstrap>", linha 938 Ficheiro "<frozen importlib._bootstrap>", linha 1068 Ficheiro "<frozen importlib._bootstrap>", linha 619 Ficheiro "<frozen importlib._bootstrap>", linha 1581 Ficheiro "<frozen importlib._bootstrap>", linha 1614 Ficheiro "/usr/lib/python3.4/test/support/__init__.py", linha 1728 import doctest Ficheiro "/usr/lib/python3.4/test/test_pickletools.py", linha 21 support.run_doctest(pickletools) Ficheiro "/usr/lib/python3.4/test/regrtest.py", linha 1276 test_runner() Ficheiro "/usr/lib/python3.4/test/regrtest.py", linha 976 display_failure=not verbose) Ficheiro "/usr/lib/python3.4/test/regrtest.py", linha 761 match_tests=ns.match_tests) Ficheiro "/usr/lib/python3.4/test/regrtest.py", linha 1563 main() Ficheiro "/usr/lib/python3.4/test/__main__.py", linha 3 regrtest.main_in_temp_cwd() Ficheiro "/usr/lib/python3.4/runpy.py", linha 73 exec(code, run_globals) Ficheiro "/usr/lib/python3.4/runpy.py", linha 160 "__main__", fname, loader, pkg_name)

source: We can see that the most memory was allocated in the :mod:`importlib` module to load data (bytecode and constants) from modules: ``870.1 KiB``. The traceback is where the :mod:`importlib` loaded data most recently: on the ``import pdb`` line of the :mod:`doctest` module. The traceback may change if a new module is loaded.
pt_pt: Podemos ver que a maior parte da memória foi alocada no módulo :mod:`importlib` para carregar dados (bytecode e constantes) de módulos: ``870.1 KiB``. O traceback é onde o :mod:`importlib` carregou dados mais recentemente: na linha ``import pdb`` do módulo :mod:`doctest`. O traceback pode mudar se um novo módulo for carregado.

source: Pretty top
pt_pt: Top bonito

source: Code to display the 10 lines allocating the most memory with a pretty output, ignoring ``<frozen importlib._bootstrap>`` and ``<unknown>`` files::
pt_pt: Código para mostrar as 10 linhas que alocam mais memória com uma saída bonita, ignorando os ficheiros ``<frozen importlib._bootstrap>`` e ``<unknown>``:

source: import linecache import os import tracemalloc def display_top(snapshot, key_type='lineno', limit=10): snapshot = snapshot.filter_traces(( tracemalloc.Filter(False, "<frozen importlib._bootstrap>"), tracemalloc.Filter(False, "<unknown>"), )) top_stats = snapshot.statistics(key_type) print("Top %s lines" % limit) for index, stat in enumerate(top_stats[:limit], 1): frame = stat.traceback[0] print("#%s: %s:%s: %.1f KiB" % (index, frame.filename, frame.lineno, stat.size / 1024)) line = linecache.getline(frame.filename, frame.lineno).strip() if line: print(' %s' % line) other = top_stats[limit:] if other: size = sum(stat.size for stat in other) print("%s other: %.1f KiB" % (len(other), size / 1024)) total = sum(stat.size for stat in top_stats) print("Total allocated size: %.1f KiB" % (total / 1024)) tracemalloc.start() # ... run your application ... snapshot = tracemalloc.take_snapshot() display_top(snapshot)
pt_pt: import linecache import os import tracemalloc def mostrar_top(snapshot, key_type='lineno', limit=10): snapshot = snapshot.filter_traces(( tracemalloc.Filter(False, "<frozen importlib._bootstrap>"), tracemalloc.Filter(False, "<unknown>"), )) top_stats = snapshot.statistics(key_type) print("Top %s linhas" % limit) for index, stat in enumerate(top_stats[:limit], 1): frame = stat.traceback[0] print("#%s: %s:%s: %.1f KiB" % (index, frame.filename, frame.lineno, stat.size / 1024)) line = linecache.getline(frame.filename, frame.lineno).strip() if line: print(' %s' % line) other = top_stats[limit:] if other: size = sum(stat.size for stat in other) print("%s outras: %.1f KiB" % (len(other), size / 1024)) total = sum(stat.size for stat in top_stats) print("Tamanho total alocado: %.1f KiB" % (total / 1024)) tracemalloc.start() # ... execute a sua aplicação ... snapshot = tracemalloc.take_snapshot() mostrar_top(snapshot)

source: Top 10 lines #1: Lib/base64.py:414: 419.8 KiB _b85chars2 = [(a + b) for a in _b85chars for b in _b85chars] #2: Lib/base64.py:306: 419.8 KiB _a85chars2 = [(a + b) for a in _a85chars for b in _a85chars] #3: collections/__init__.py:368: 293.6 KiB exec(class_definition, namespace) #4: Lib/abc.py:133: 115.2 KiB cls = super().__new__(mcls, name, bases, namespace) #5: unittest/case.py:574: 103.1 KiB testMethod() #6: Lib/linecache.py:127: 95.4 KiB lines = fp.readlines() #7: urllib/parse.py:476: 71.8 KiB for a in _hexdig for b in _hexdig} #8: <string>:5: 62.0 KiB #9: Lib/_weakrefset.py:37: 60.0 KiB self.data = set() #10: Lib/base64.py:142: 59.8 KiB _b32tab2 = [a + b for a in _b32tab for b in _b32tab] 6220 other: 3602.8 KiB Total allocated size: 5303.1 KiB
pt_pt: Top 10 linhas #1: Lib/base64.py:414: 419.8 KiB _b85chars2 = [(a + b) for a in _b85chars for b in _b85chars] #2: Lib/base64.py:306: 419.8 KiB _a85chars2 = [(a + b) for a in _a85chars for b in _a85chars] #3: collections/__init__.py:368: 293.6 KiB exec(class_definition, namespace) #4: Lib/abc.py:133: 115.2 KiB cls = super().__new__(mcls, name, bases, namespace) #5: unittest/case.py:574: 103.1 KiB testMethod() #6: Lib/linecache.py:127: 95.4 KiB lines = fp.readlines() #7: urllib/parse.py:476: 71.8 KiB for a in _hexdig for b in _hexdig} #8: <string>:5: 62.0 KiB #9: Lib/_weakrefset.py:37: 60.0 KiB self.data = set() #10: Lib/base64.py:142: 59.8 KiB _b32tab2 = [a + b for a in _b32tab for b in _b32tab] 6220 outras: 3602.8 KiB Tamanho total alocado: 5303.1 KiB

source: Record the current and peak size of all traced memory blocks
pt_pt: Registar o tamanho atual e máximo de todos os blocos de memória rastreados

source: The following code computes two sums like ``0 + 1 + 2 + ...`` inefficiently, by creating a list of those numbers. This list consumes a lot of memory temporarily. We can use :func:`get_traced_memory` and :func:`reset_peak` to observe the small memory usage after the sum is computed as well as the peak memory usage during the computations::
pt_pt: O seguinte código calcula duas somas como ``0 + 1 + 2 + ...`` de forma ineficiente, criando uma lista daqueles números. Esta lista consome muita memória temporariamente. Podemos usar :func:`get_traced_memory` e :func:`reset_peak` para observar o pequeno uso de memória após a soma ser calculada, bem como o uso máximo de memória durante os cálculos:

source: import tracemalloc tracemalloc.start() # Example code: compute a sum with a large temporary list large_sum = sum(list(range(100000))) first_size, first_peak = tracemalloc.get_traced_memory() tracemalloc.reset_peak() # Example code: compute a sum with a small temporary list small_sum = sum(list(range(1000))) second_size, second_peak = tracemalloc.get_traced_memory() print(f"{first_size=}, {first_peak=}") print(f"{second_size=}, {second_peak=}")
pt_pt: import tracemalloc tracemalloc.start() # Código de exemplo: calcular uma soma com uma grande lista temporária large_sum = sum(list(range(100000))) first_size, first_peak = tracemalloc.get_traced_memory() tracemalloc.reset_peak() # Código de exemplo: calcular uma soma com uma pequena lista temporária small_sum = sum(list(range(1000))) second_size, second_peak = tracemalloc.get_traced_memory() print(f"{first_size=}, {first_peak=}") print(f"{second_size=}, {second_peak=}")

source: Output::
pt_pt: Saída:

source: Using :func:`reset_peak` ensured we could accurately record the peak during the computation of ``small_sum``, even though it is much smaller than the overall peak size of memory blocks since the :func:`start` call. Without the call to :func:`reset_peak`, ``second_peak`` would still be the peak from the computation ``large_sum`` (that is, equal to ``first_peak``). In this case, both peaks are much higher than the final memory usage, and which suggests we could optimise (by removing the unnecessary call to :class:`list`, and writing ``sum(range(...))``).
pt_pt: Usar :func:`reset_peak` garantiu que pudéssemos registar com precisão o pico durante o cálculo de ``small_sum``, embora seja muito menor do que o tamanho de pico geral dos blocos de memória desde a chamada :func:`start`. Sem a chamada a :func:`reset_peak`, ``second_peak`` ainda seria o pico do cálculo ``large_sum`` (ou seja, igual a ``first_peak``). Neste caso, ambos os picos são muito maiores do que o uso final de memória, o que sugere que poderíamos otimizar (removendo a chamada desnecessária a :class:`list` e escrevendo ``sum(range(...))``).

source: Functions
pt_pt: Funções

source: Clear traces of memory blocks allocated by Python.
pt_pt: Limpar rastos de blocos de memória alocados pelo Python.

source: See also :func:`stop`.
pt_pt: Veja também :func:`stop`.

source: Get the traceback where the Python object *obj* was allocated. Return a :class:`Traceback` instance, or ``None`` if the :mod:`tracemalloc` module is not tracing memory allocations or did not trace the allocation of the object.
pt_pt: Obter o traceback onde o objeto Python *obj* foi alocado. Retorna uma instância :class:`Traceback`, ou ``None`` se o módulo :mod:`tracemalloc` não estiver a rastrear alocações de memória ou não rastreou a alocação do objeto.

source: See also :func:`gc.get_referrers` and :func:`sys.getsizeof` functions.
pt_pt: Veja também as funções :func:`gc.get_referrers` e :func:`sys.getsizeof`.

source: Get the maximum number of frames stored in the traceback of a trace.
pt_pt: Obter o número máximo de quadros armazenados no traceback de um rastreio.

source: The :mod:`tracemalloc` module must be tracing memory allocations to get the limit, otherwise an exception is raised.
pt_pt: O módulo :mod:`tracemalloc` deve estar a rastrear alocações de memória para obter o limite, caso contrário, uma exceção é levantada.

source: The limit is set by the :func:`start` function.
pt_pt: O limite é definido pela função :func:`start`.

source: Get the current size and peak size of memory blocks traced by the :mod:`tracemalloc` module as a tuple: ``(current: int, peak: int)``.
pt_pt: Obter o tamanho atual e o tamanho máximo dos blocos de memória rastreados pelo módulo :mod:`tracemalloc` como um tuplo: ``(current: int, peak: int)``.

source: Set the peak size of memory blocks traced by the :mod:`tracemalloc` module to the current size.
pt_pt: Definir o tamanho máximo dos blocos de memória rastreados pelo módulo :mod:`tracemalloc` para o tamanho atual.

source: Do nothing if the :mod:`tracemalloc` module is not tracing memory allocations.
pt_pt: Não fazer nada se o módulo :mod:`tracemalloc` não estiver a rastrear alocações de memória.

source: This function only modifies the recorded peak size, and does not modify or clear any traces, unlike :func:`clear_traces`. Snapshots taken with :func:`take_snapshot` before a call to :func:`reset_peak` can be meaningfully compared to snapshots taken after the call.
pt_pt: Esta função modifica apenas o tamanho de pico registrado e não modifica ou limpa quaisquer rastos, ao contrário de :func:`clear_traces`. *Snapshots* tirados com :func:`take_snapshot` antes de uma chamada a :func:`reset_peak` podem ser comparados de forma significativa com *snapshots* tirados após a chamada.

source: See also :func:`get_traced_memory`.
pt_pt: Veja também :func:`get_traced_memory`.
