Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/tty.po
Languages: ja, ru, sv

source: :mod:`!tty` --- Terminal control functions
ru: :mod:`!tty` --- Функции управления терминалом
sv: :mod:`!tty` --- Terminalens kontrollfunktioner

source: **Source code:** :source:`Lib/tty.py`
ja: **ソースコード:** :source:`Lib/tty.py`
ru: **Исходный код:** :source:`Lib/tty.py`
sv: **Källkod:** :source:`Lib/tty.py`

source: The :mod:`tty` module defines functions for putting the tty into cbreak and raw modes.
ja: :mod:`tty` モジュールは端末を cbreak および raw モードにするための関数を定義しています。
ru: Модуль :mod:`tty` определяет функции для перевода tty в режимы cbreak и raw.
sv: Modulen :mod:`tty` definierar funktioner för att sätta tty i cbreak- och raw-läge.

source: Availability
ru: Доступность
sv: Tillgänglighet

source: Because it requires the :mod:`termios` module, it will work only on Unix.
ja: このモジュールは :mod:`termios` モジュールを必要とするため、 Unix でしか動作しません。
ru: Поскольку для этого требуется модуль :mod:`termios`, он будет работать только в Unix.
sv: Eftersom den kräver modulen :mod:`termios` fungerar den endast på Unix.

source: The :mod:`tty` module defines the following functions:
ja: :mod:`tty` モジュールでは、以下の関数を定義しています:
ru: Модуль :mod:`tty` определяет следующие функции:
sv: Modulen :mod:`tty` definierar följande funktioner:

source: Convert the tty attribute list *mode*, which is a list like the one returned by :func:`termios.tcgetattr`, to that of a tty in raw mode.
ru: Преобразуйте список атрибутов tty *mode*, который представляет собой список, подобный тому, который возвращается :func:`termios.tcgetattr`, в список tty в необработанном режиме.
sv: Konverterar tty-attributlistan *mode*, som är en lista liknande den som returneras av :func:`termios.tcgetattr`, till en tty i raw-läge.

source: Convert the tty attribute list *mode*, which is a list like the one returned by :func:`termios.tcgetattr`, to that of a tty in cbreak mode.
ru: Преобразуйте список атрибутов tty *mode*, который представляет собой список, подобный тому, который возвращается :func:`termios.tcgetattr`, в список tty в режиме cbreak.
sv: Konverterar tty-attributlistan *mode*, som är en lista liknande den som returneras av :func:`termios.tcgetattr`, till en tty i cbreak-läge.

source: This clears the ``ECHO`` and ``ICANON`` local mode flags in *mode* as well as setting the minimum input to 1 byte with no delay.
ru: Это очищает флаги локального режима ``ECHO`` и ``ICANON`` в *mode*, а также устанавливает минимальный входной размер в 1 байт без задержки.
sv: Detta rensar de lokala lägesflaggorna ``ECHO`` och ``ICANON`` i *mode* samt ställer in minsta inmatning till 1 byte utan fördröjning.

source: The ``ICRNL`` flag is no longer cleared. This matches Linux and macOS ``stty cbreak`` behavior and what :func:`setcbreak` historically did.
ru: Флаг ICRNL больше не сбрасывается. Это соответствует поведению ``stty cbreak`` в Linux и macOS и тому, что исторически делал :func:`setcbreak`.
sv: Flaggan ``ICRNL`` rensas inte längre. Detta matchar Linux och macOS ``stty cbreak`` beteende och vad :func:`setcbreak` historiskt gjorde.

source: Change the mode of the file descriptor *fd* to raw. If *when* is omitted, it defaults to :const:`termios.TCSAFLUSH`, and is passed to :func:`termios.tcsetattr`. The return value of :func:`termios.tcgetattr` is saved before setting *fd* to raw mode; this value is returned.
ru: Измените режим файлового дескриптора *fd* на raw. Если *when* опущено, по умолчанию используется :const:`termios.TCSAFLUSH` и передается в :func:`termios.tcsetattr`. Возвращаемое значение :func:`termios.tcgetattr` сохраняется перед установкой *fd* в необработанный режим; это значение возвращается.
sv: Ändrar läget för filbeskrivaren *fd* till raw. Om *when* utelämnas, är standardvärdet :const:`termios.TCSAFLUSH`, och skickas till :func:`termios.tcsetattr`. Returvärdet för :func:`termios.tcgetattr` sparas innan *fd* sätts till raw-läge; detta värde returneras.

source: The return value is now the original tty attributes, instead of ``None``.
ru: Возвращаемым значением теперь являются исходные атрибуты tty, а не None.
sv: Returvärdet är nu de ursprungliga tty-attributen, istället för ``None``.

source: Change the mode of file descriptor *fd* to cbreak. If *when* is omitted, it defaults to :const:`termios.TCSAFLUSH`, and is passed to :func:`termios.tcsetattr`. The return value of :func:`termios.tcgetattr` is saved before setting *fd* to cbreak mode; this value is returned.
ru: Измените режим файлового дескриптора *fd* на cbreak. Если *when* опущено, по умолчанию используется :const:`termios.TCSAFLUSH` и передается в :func:`termios.tcsetattr`. Возвращаемое значение :func:`termios.tcgetattr` сохраняется перед установкой *fd* в режим cbreak; это значение возвращается.
sv: Ändrar läget för filbeskrivaren *fd* till cbreak. Om *when* utelämnas, är standardvärdet :const:`termios.TCSAFLUSH`, och skickas till :func:`termios.tcsetattr`. Returvärdet för :func:`termios.tcgetattr` sparas innan *fd* sätts till cbreak-läge; detta värde returneras.

source: This clears the ``ECHO`` and ``ICANON`` local mode flags as well as setting the minimum input to 1 byte with no delay.
ru: Это очищает флаги локального режима ``ECHO`` и ``ICANON``, а также устанавливает минимальный входной размер в 1 байт без задержки.
sv: Detta rensar flaggorna för lokalt läge ``ECHO`` och ``ICANON`` samt ställer in minsta inmatning till 1 byte utan fördröjning.

source: The ``ICRNL`` flag is no longer cleared. This restores the behavior of Python 3.11 and earlier as well as matching what Linux, macOS, & BSDs describe in their ``stty(1)`` man pages regarding cbreak mode.
ru: Флаг ICRNL больше не сбрасывается. Это восстанавливает поведение Python 3.11 и более ранних версий, а также соответствует тому, что Linux, macOS и BSD описывают на своих страницах руководства ``stty(1)`` относительно режима cbreak.
sv: Flaggan ``ICRNL`` rensas inte längre. Detta återställer beteendet i Python 3.11 och tidigare samt matchar vad Linux, macOS och BSD beskriver i sina ``stty(1)`` man pages angående cbreak-läge.

source: Module :mod:`termios`
ja: モジュール :mod:`termios`
ru: Модуль :mod:`termios`
sv: Modul :mod:`termios`

source: Low-level terminal control interface.
ja: 低水準端末制御インターフェース。
ru: Низкоуровневый интерфейс управления терминалом.
sv: Gränssnitt för terminalstyrning på låg nivå.

source: :mod:`tty` --- Terminal control functions
ja: :mod:`tty` --- 端末制御のための関数群

source: :ref:`Availability <availability>`: Unix.
ja: :ref:`利用可能な環境 <availability>`: Unix。

source: Change the mode of the file descriptor *fd* to raw. If *when* is omitted, it defaults to :const:`termios.TCSAFLUSH`, and is passed to :func:`termios.tcsetattr`.
ja: ファイル記述子 *fd* のモードを raw モードに変えます。 *when* を省略すると標準の値は :const:`termios.TCSAFLUSH` になり、 :func:`termios.tcsetattr` に渡されます。

source: Change the mode of file descriptor *fd* to cbreak. If *when* is omitted, it defaults to :const:`termios.TCSAFLUSH`, and is passed to :func:`termios.tcsetattr`.
ja: ファイル記述子 *fd* のモードを cbreakモードに変えます。 *when* を省略すると標準の値は :const:`termios.TCSAFLUSH` になり、 :func:`termios.tcsetattr` に渡されます。
