Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: pt_pt, sv

source: Create and return a clone of the turtle with same position, heading and turtle properties.
pt_pt: Cria e retorna um clone da tartaruga com a mesma posição, orientação e propriedades da tartaruga.
sv: Skapa och returnera en klon av sköldpaddan med samma position, kurs och sköldpaddsegenskaper.

source: Return the Turtle object itself. Only reasonable use: as a function to return the "anonymous turtle":
pt_pt: Retorna o próprio objeto Turtle. Único uso razoável: como uma função para retornar a "tartaruga anónima":
sv: Returnerar själva Turtle-objektet. Enda rimliga användning: som en funktion för att returnera den "anonyma sköldpaddan":

source: Return the :class:`TurtleScreen` object the turtle is drawing on. TurtleScreen methods can then be called for that object.
pt_pt: Retorna o objeto :class:`TurtleScreen` no qual a tartaruga está a desenhar. Os métodos TurtleScreen podem então ser chamados para esse objeto.
sv: Returnerar :class:`TurtleScreen`\-objektet som sköldpaddan ritar på. TurtleScreen-metoder kan sedan anropas för det objektet.

source: an integer or ``None``
pt_pt: um inteiro ou ``None``
sv: ett heltal eller ``None``

source: Set or disable undobuffer. If *size* is an integer, an empty undobuffer of given size is installed. *size* gives the maximum number of turtle actions that can be undone by the :func:`undo` method/function. If *size* is ``None``, the undobuffer is disabled.
pt_pt: Define ou desativa o undobuffer. Se *size* for um inteiro, um undobuffer vazio do tamanho dado é instalado. *size* dá o número máximo de ações da tartaruga que podem ser desfeitas pelo método/função :func:`undo`. Se *size* for ``None``, o undobuffer é desativado.
sv: Ställ in eller inaktivera undobuffer. Om *size* är ett heltal installeras en tom undobuffer av given storlek. *size* anger det maximala antalet sköldpaddsaktioner som kan ångras med metoden/funktionen :func:`undo`. Om *size* är ``None`` inaktiveras undobufferten.

source: Return number of entries in the undobuffer.
pt_pt: Retorna o número de entradas no undobuffer.
sv: Returnerar antal poster i undobufferten.

source: Compound shapes
pt_pt: Formas compostas
sv: Sammansatta former

source: To use compound turtle shapes, which consist of several polygons of different color, you must use the helper class :class:`Shape` explicitly as described below:
pt_pt: Para usar formas compostas de tartaruga, que consistem em vários polígonos de cores diferentes, deve usar explicitamente a classe auxiliar :class:`Shape` como descrita abaixo:
sv: För att använda sammansatta sköldpaddsformer, som består av flera polygoner med olika färg, måste du använda hjälpklassen :class:`Shape` explicit enligt beskrivningen nedan:

source: Create an empty Shape object of type "compound".
pt_pt: Cria um objeto Shape vazio do tipo "compound".
sv: Skapa ett tomt Shape-objekt av typen "compound".

source: Add as many components to this object as desired, using the :meth:`~Shape.addcomponent` method.
pt_pt: Adicione tantos componentes a este objeto quantos desejar, usando o método :meth:`~Shape.addcomponent`.
sv: Lägg till så många komponenter som önskas till detta objekt med hjälp av metoden :meth:`~Shape.addcomponent`.

source: For example:
pt_pt: Por exemplo:
sv: Till exempel:

source: Now add the Shape to the Screen's shapelist and use it:
pt_pt: Agora adicione a Shape à lista de formas do Ecrã e use-a:
sv: Lägg nu till Shape i skärmens shapelist och använd den:

source: The :class:`Shape` class is used internally by the :func:`register_shape` method in different ways. The application programmer has to deal with the Shape class *only* when using compound shapes like shown above!
pt_pt: A classe :class:`Shape` é usada internamente pelo método :func:`register_shape` de diferentes maneiras. O programador de aplicações só precisa lidar com a classe Shape quando usar formas compostas como mostrado acima!
sv: Klassen :class:`Shape` används internt av metoden :func:`register_shape` på olika sätt. Applikationsprogrammeraren måste hantera Shape-klassen *endast* när han använder sammansatta former som visas ovan!

source: Methods of TurtleScreen/Screen and corresponding functions
pt_pt: Métodos de TurtleScreen/Ecrã e funções correspondentes
sv: Metoder för TurtleScreen/Screen och motsvarande funktioner

source: Most of the examples in this section refer to a TurtleScreen instance called ``screen``.
pt_pt: A maioria dos exemplos nesta secção referem-se a uma instância de TurtleScreen chamada ``screen``.
sv: De flesta av exemplen i detta avsnitt hänvisar till en TurtleScreen-instans som heter ``screen``.

source: Set background image or return name of current backgroundimage. If *picname* is a filename, set the corresponding image as background. If *picname* is ``"nopic"``, delete background image, if present. If *picname* is ``None``, return the filename of the current backgroundimage. ::
pt_pt: Define a imagem de fundo ou retorna o nome da imagem de fundo atual. Se *picname* for um nome de ficheiro, define a imagem correspondente como fundo. Se *picname* for ``"nopic"``, apaga a imagem de fundo, se presente. Se *picname* for ``None``, retorna o nome do ficheiro da imagem de fundo atual. ::
sv: Ange bakgrundsbild eller returnera namnet på den aktuella bakgrundsbilden. Om *picname* är ett filnamn, anges motsvarande bild som bakgrund. Om *picname* är ``"nopic"``, radera bakgrundsbilden, om den finns. Om *picname* är ``None``, returneras filnamnet för den aktuella bakgrundsbilden. ::

source: This TurtleScreen method is available as a global function only under the name ``clearscreen``. The global function ``clear`` is a different one derived from the Turtle method ``clear``.
pt_pt: Este método TurtleScreen está disponível como uma função global apenas sob o nome ``clearscreen``. A função global ``clear`` é outra derivada do método ``clear`` da Turtle.
sv: Denna TurtleScreen-metod är tillgänglig som en global funktion endast under namnet ``clearscreen``. Den globala funktionen ``clear`` är en annan funktion som härrör från Turtle-metoden ``clear``.

source: Delete all drawings and all turtles from the TurtleScreen. Reset the now empty TurtleScreen to its initial state: white background, no background image, no event bindings and tracing on.
pt_pt: Apaga todos os desenhos e todas as tartarugas do TurtleScreen. Redefine o TurtleScreen agora vazio para o seu estado inicial: fundo branco, sem imagem de fundo, sem ligações de eventos e rastreio ligado.
sv: Ta bort alla ritningar och alla sköldpaddor från TurtleScreen. Återställ den nu tomma TurtleScreen till dess ursprungliga tillstånd: vit bakgrund, ingen bakgrundsbild, inga händelsebindningar och spårning på.

source: This TurtleScreen method is available as a global function only under the name ``resetscreen``. The global function ``reset`` is another one derived from the Turtle method ``reset``.
pt_pt: Este método TurtleScreen está disponível como uma função global apenas sob o nome ``resetscreen``. A função global ``reset`` é outra derivada do método ``reset`` da Turtle.
sv: Denna TurtleScreen-metod är tillgänglig som en global funktion endast under namnet ``resetscreen``. Den globala funktionen ``reset`` är en annan funktion som härrör från Turtle-metoden ``reset``.

source: Reset all Turtles on the Screen to their initial state.
pt_pt: Reinicia todas as tartarugas no Ecrã para o seu estado inicial.
sv: Återställ alla sköldpaddor på skärmen till deras ursprungliga tillstånd.

source: positive integer, new width of canvas in pixels
pt_pt: inteiro positivo, nova largura do canvas em píxeis
sv: positivt heltal, ny bredd på duken i pixlar

source: positive integer, new height of canvas in pixels
pt_pt: inteiro positivo, nova altura do canvas em píxeis
sv: positivt heltal, ny höjd på duken i pixlar

source: colorstring or color-tuple, new background color
pt_pt: *string* de cor ou tuplo de cor, nova cor de fundo
sv: colorstring eller color-tuple, ny bakgrundsfärg

source: If no arguments are given, return current (canvaswidth, canvasheight). Else resize the canvas the turtles are drawing on. Do not alter the drawing window. To observe hidden parts of the canvas, use the scrollbars. With this method, one can make visible those parts of a drawing which were outside the canvas before.
pt_pt: Se não forem dados argumentos, retorna o (largura_canvas, altura_canvas) atual. Caso contrário, redimensiona o canvas no qual as tartarugas estão a desenhar. Não altera a janela de desenho. Para observar partes escondidas do canvas, use as barras de deslocamento. Com este método, pode-se tornar visíveis aquelas partes de um desenho que estavam fora do canvas anteriormente.
sv: Om inga argument anges, returneras current (canvaswidth, canvasheight). Ändra annars storleken på den duk som sköldpaddorna ritar på. Ändra inte ritfönstret. För att observera dolda delar av duken, använd rullningslisterna. Med denna metod kan man göra de delar av en ritning synliga som tidigare låg utanför duken.

source: e.g. to search for an erroneously escaped turtle ;-)
pt_pt: por exemplo, para procurar uma tartaruga que escapou erroneamente ;-)
sv: t.ex. för att söka efter en sköldpadda som har rymt ;-)

source: a number, x-coordinate of lower left corner of canvas
pt_pt: um número, coordenada x do canto inferior esquerdo do canvas
sv: ett tal, x-koordinat för det nedre vänstra hörnet på duken

source: a number, y-coordinate of lower left corner of canvas
pt_pt: um número, coordenada y do canto inferior esquerdo do canvas
sv: ett tal, y-koordinat för det nedre vänstra hörnet av duken

source: a number, x-coordinate of upper right corner of canvas
pt_pt: um número, coordenada x do canto superior direito do canvas
sv: ett tal, x-koordinat för övre högra hörnet av duken

source: a number, y-coordinate of upper right corner of canvas
pt_pt: um número, coordenada y do canto superior direito do canvas
sv: ett tal, y-koordinat för övre högra hörnet av duken

source: Set up user-defined coordinate system and switch to mode "world" if necessary. This performs a ``screen.reset()``. If mode "world" is already active, all drawings are redrawn according to the new coordinates.
pt_pt: Configura um sistema de coordenadas definido pelo utilizador e muda para o modo "world" se necessário. Isto executa um ``screen.reset()``. Se o modo "world" já estiver ativo, todos os desenhos são redesenhados de acordo com as novas coordenadas.
sv: Ställ in det användardefinierade koordinatsystemet och växla till läget "world" om det behövs. Detta utför en ``screen.reset()``. Om läget "world" redan är aktivt ritas alla ritningar om enligt de nya koordinaterna.

source: **ATTENTION**: in user-defined coordinate systems angles may appear distorted.
pt_pt: **ATENÇÃO**: em sistemas de coordenadas definidos pelo utilizador, os ângulos podem parecer distorcidos.
sv: **OBSERVERA**: I användardefinierade koordinatsystem kan vinklar se förvrängda ut.

source: positive integer
pt_pt: inteiro positivo
sv: positivt heltal

source: Set or return the drawing *delay* in milliseconds. (This is approximately the time interval between two consecutive canvas updates.) The longer the drawing delay, the slower the animation.
pt_pt: Define ou retorna o *delay* de desenho em milissegundos. (Este é aproximadamente o intervalo de tempo entre duas atualizações consecutivas do canvas.) Quanto maior o delay de desenho, mais lenta a animação.
sv: Ställ in eller returnera ritningens *fördröjning* i millisekunder. (Detta är ungefär tidsintervallet mellan två på varandra följande canvasuppdateringar) Ju längre fördröjning, desto långsammare animation.

source: Optional argument:
pt_pt: Argumento opcional:
sv: Valfritt argument:

source: nonnegative integer
pt_pt: inteiro não negativo
sv: icke-negativt heltal

source: Turn turtle animation on/off and set delay for update drawings. If *n* is given, only each n-th regular screen update is really performed. (Can be used to accelerate the drawing of complex graphics.) When called without arguments, returns the currently stored value of n. Second argument sets delay value (see :func:`delay`).
pt_pt: Liga/desliga a animação da tartaruga e define o delay para atualizações de desenho. Se *n* for dado, apenas cada n-ésima atualização regular do ecrã é realmente executada. (Pode ser usado para acelerar o desenho de gráficos complexos.) Quando chamado sem argumentos, retorna o valor atual de n. O segundo argumento define o valor do delay (consulte :func:`delay`).
sv: Slå på/av sköldpaddsanimering och ställ in fördröjning för uppdatering av ritningar. Om *n* anges, utförs endast varje n:te reguljära skärmuppdatering. (Kan användas för att påskynda ritningen av komplex grafik.) När den anropas utan argument returneras det aktuella lagrade värdet av n. Det andra argumentet anger fördröjningsvärdet (se :func:`delay`).

source: Perform a TurtleScreen update. To be used when tracer is turned off.
pt_pt: Executa uma atualização do TurtleScreen. A ser usado quando o tracer está desligado.
sv: Utför en uppdatering av TurtleScreen. Används när spåraren är avstängd.

source: See also the RawTurtle/Turtle method :func:`speed`.
pt_pt: Consulte também o método RawTurtle/Turtle :func:`speed`.
sv: Se även RawTurtle/Turtle-metoden :func:`speed`.

source: Set focus on TurtleScreen (in order to collect key-events). Dummy arguments are provided in order to be able to pass :func:`listen` to the onclick method.
pt_pt: Define o foco no TurtleScreen (para recolher eventos de teclado). Argumentos fictícios são fornecidos para que seja possível passar :func:`listen` para o método onclick.
sv: Sätter fokus på TurtleScreen (för att samla in tangenthändelser). Dummy-argument tillhandahålls för att kunna skicka :func:`listen` till onclick-metoden.

source: a function with no arguments or ``None``
pt_pt: uma função sem argumentos ou ``None``
sv: en funktion utan argument eller ``None``

source: a string: key (e.g. "a") or key-symbol (e.g. "space")
pt_pt: uma *string*: tecla (por exemplo, "a") ou símbolo de tecla (por exemplo, "espaço")
sv: en sträng: nyckel (t.ex. "a") eller nyckelsymbol (t.ex. "mellanslag")

source: Bind *fun* to key-release event of key. If *fun* is ``None``, event bindings are removed. Remark: in order to be able to register key-events, TurtleScreen must have the focus. (See method :func:`listen`.)
pt_pt: Liga *fun* ao evento de libertação da tecla. Se *fun* for ``None``, as ligações de eventos são removidas. Nota: para ser possível registar eventos de teclado, o TurtleScreen deve ter o foco. (Consulte o método :func:`listen`.)
sv: Bind *fun* till key-release-händelse för nyckel. Om *fun* är ``None`` tas händelsebindningarna bort. Anmärkning: För att kunna registrera tangenthändelser måste TurtleScreen ha fokus. (Se metod :func:`listen`.)

source: Bind *fun* to key-press event of key if key is given, or to any key-press-event if no key is given. Remark: in order to be able to register key-events, TurtleScreen must have focus. (See method :func:`listen`.)
pt_pt: Liga *fun* ao evento de pressionar a tecla se a tecla for dada, ou a qualquer evento de pressionar tecla se nenhuma tecla for dada. Nota: para ser possível registar eventos de teclado, o TurtleScreen deve ter o foco. (Consulte o método :func:`listen`.)
sv: Bind *fun* till tangenttryckningshändelsen för tangenten om tangenten är angiven, eller till valfri tangenttryckningshändelse om ingen tangent är angiven. Anmärkning: För att kunna registrera tangenthändelser måste TurtleScreen ha fokus. (Se metod :func:`listen`.)

source: Bind *fun* to mouse-click events on this screen. If *fun* is ``None``, existing bindings are removed.
pt_pt: Liga *fun* a eventos de clique do rato neste ecrã. Se *fun* for ``None``, as ligações existentes são removidas.
sv: Bind *fun* till musklickhändelser på den här skärmen. Om *fun* är ``None`` tas befintliga bindningar bort.

source: Example for a TurtleScreen instance named ``screen`` and a Turtle instance named ``turtle``:
pt_pt: Exemplo para uma instância de TurtleScreen chamada ``screen`` e uma instância de Turtle chamada ``turtle``:
sv: Exempel för en TurtleScreen-instans med namnet ``screen`` och en Turtle-instans med namnet ``turtle``:

source: This TurtleScreen method is available as a global function only under the name ``onscreenclick``. The global function ``onclick`` is another one derived from the Turtle method ``onclick``.
pt_pt: Este método TurtleScreen está disponível como uma função global apenas sob o nome ``onscreenclick``. A função global ``onclick`` é outra derivada do método ``onclick`` da Turtle.
sv: Denna TurtleScreen-metod är tillgänglig som en global funktion endast under namnet ``onscreenclick``. Den globala funktionen ``onclick`` är en annan funktion som härrör från Turtle-metoden ``onclick``.

source: a function with no arguments
pt_pt: uma função sem argumentos
sv: en funktion utan argument

source: a number >= 0
pt_pt: um número >= 0
sv: ett tal >= 0

source: Install a timer that calls *fun* after *t* milliseconds.
pt_pt: Instala um temporizador que chama *fun* após *t* milissegundos.
sv: Installera en timer som anropar *fun* efter *t* millisekunder.

source: Starts event loop - calling Tkinter's mainloop function. Must be the last statement in a turtle graphics program. Must *not* be used if a script is run from within IDLE in -n mode (No subprocess) - for interactive use of turtle graphics. ::
pt_pt: Inicia o ciclo de eventos - chamando a função mainloop do Tkinter. Deve ser a última instrução num programa de gráficos de tartaruga. Não deve ser usado se um script for executado a partir do IDLE no modo -n (sem subprocesso) - para uso interativo de gráficos de tartaruga. ::
sv: Startar händelseslinga - anropar Tkinters mainloop-funktion. Måste vara den sista satsen i ett turtle graphics-program. Får *inte* användas om ett skript körs från IDLE i -n-läge (ingen subprocess) - för interaktiv användning av turtle graphics. ::

source: string
sv: sträng

source: Pop up a dialog window for input of a string. Parameter title is the title of the dialog window, prompt is a text mostly describing what information to input. Return the string input. If the dialog is canceled, return ``None``. ::
pt_pt: Abre uma janela de diálogo para entrada de uma *string*. O parâmetro title é o título da janela de diálogo, prompt é um texto que descreve maioritariamente que informação deve ser inserida. Retorna a *string* inserida. Se o diálogo for cancelado, retorna ``None``. ::
sv: Öppnar ett dialogfönster för inmatning av en sträng. Parameter title är titeln på dialogfönstret, prompt är en text som mestadels beskriver vilken information som ska matas in. Returnerar den inmatade strängen. Om dialogrutan avbryts returneras ``None``. ::

source: Pop up a dialog window for input of a number. title is the title of the dialog window, prompt is a text mostly describing what numerical information to input. default: default value, minval: minimum value for input, maxval: maximum value for input. The number input must be in the range minval .. maxval if these are given. If not, a hint is issued and the dialog remains open for correction. Return the number input. If the dialog is canceled, return ``None``. ::
pt_pt: Abre uma janela de diálogo para entrada de um número. title é o título da janela de diálogo, prompt é um texto que descreve maioritariamente que informação numérica deve ser inserida. default: valor predefinido, minval: valor mínimo para entrada, maxval: valor máximo para entrada. A entrada numérica deve estar no intervalo minval .. maxval se estes forem dados. Se não, é emitida uma dica e o diálogo permanece aberto para correção. Retorna o número inserido. Se o diálogo for cancelado, retorna ``None``. ::
sv: Popa upp ett dialogfönster för inmatning av ett tal. title är titeln på dialogfönstret, prompt är en text som mestadels beskriver vilken numerisk information som ska matas in. default: standardvärde, minval: lägsta värde för inmatning, maxval: högsta värde för inmatning. Det inmatade talet måste ligga inom intervallet minval .. maxval om dessa anges. Om så inte är fallet ges en hint och dialogen förblir öppen för korrigering. Returnera det inmatade talet. Om dialogen avbryts, returneras ``None``. ::

source: one of the strings "standard", "logo" or "world"
pt_pt: uma das *strings* "standard", "logo" ou "world"
sv: en av strängarna "standard", "logo" eller "world"

source: Set turtle mode ("standard", "logo" or "world") and perform reset. If mode is not given, current mode is returned.
pt_pt: Define o modo da tartaruga ("standard", "logo" ou "world") e executa um reset. Se o modo não for dado, o modo atual é retornado.
sv: Ställ in turtle mode ("standard", "logo" eller "world") och utför reset. Om mode inte anges returneras aktuellt läge.

source: Mode "standard" is compatible with old :mod:`turtle`. Mode "logo" is compatible with most Logo turtle graphics. Mode "world" uses user-defined "world coordinates". **Attention**: in this mode angles appear distorted if ``x/y`` unit-ratio doesn't equal 1.
pt_pt: O modo "standard" é compatível com o antigo :mod:`turtle`. O modo "logo" é compatível com a maioria dos gráficos de tartaruga Logo. O modo "world" usa coordenadas "world" definidas pelo utilizador. **Atenção**: neste modo, os ângulos parecem distorcidos se a relação de unidades ``x/y`` não for igual a 1.
sv: Läget "standard" är kompatibelt med gamla :mod:`turtle`. Läget "logo" är kompatibelt med de flesta Logo sköldpaddsgrafiker. Läge "world" använder användardefinierade "världskoordinater". **Attention**: i detta läge ser vinklar förvrängda ut om enhetsförhållandet ``x/y`` inte är lika med 1.

source: Mode
pt_pt: Modo
sv: Läge

source: Initial turtle heading
pt_pt: Orientação inicial da tartaruga
sv: Sköldpaddans initiala kurs

source: positive angles
pt_pt: ângulos positivos
sv: positiva vinklar

source: to the right (east)
pt_pt: para a direita (este)
sv: till höger (öster)

source: counterclockwise
pt_pt: sentido anti-horário
sv: moturs

source: "logo"
sv: "logotyp"

source: upward (north)
pt_pt: para cima (norte)
sv: uppåt (norr)

source: clockwise
pt_pt: sentido horário
sv: medurs

source: one of the values 1.0 or 255
pt_pt: um dos valores 1.0 ou 255
sv: ett av värdena 1.0 eller 255

source: Return the colormode or set it to 1.0 or 255. Subsequently *r*, *g*, *b* values of color triples have to be in the range 0..*cmode*.
pt_pt: Retorna o colormode ou define-o para 1.0 ou 255. Posteriormente, os valores *r*, *g*, *b* dos triplos de cor devem estar no intervalo 0..*cmode*.
sv: Returnerar färgmodet eller sätter det till 1.0 eller 255. Därefter måste *r*-, *g*-, *b*-värdena för färgtripplar ligga i intervallet 0..*cmode*.

source: Return the Canvas of this TurtleScreen. Useful for insiders who know what to do with a Tkinter Canvas.
pt_pt: Retorna o Canvas deste TurtleScreen. Útil para utilizadores avançados que saibam o que fazer com um Canvas do Tkinter.
sv: Returnerar Canvas för denna TurtleScreen. Användbart för insiders som vet vad de ska göra med en Tkinter Canvas.

source: Return a list of names of all currently available turtle shapes.
pt_pt: Retorna uma lista de nomes de todas as formas de tartaruga atualmente disponíveis.
sv: Returnerar en lista med namn på alla tillgängliga sköldpaddsformer.

source: Image shapes *do not* rotate when turning the turtle, so they do not display the heading of the turtle!
pt_pt: As formas de imagem *não* rodam quando a tartaruga roda, por isso não mostram a orientação da tartaruga!
sv: Bildformerna *roterar* inte när sköldpaddan vrids, så de visar inte sköldpaddans riktning!
