Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: pt_pt, sv

source: *shape* can be any of the built-in shapes, e.g: arrow, turtle, etc. For more info try ``help(shape)``.
pt_pt: *shape* pode ser qualquer uma das formas incorporadas, por exemplo: arrow, turtle, etc. Para mais informações, experimente ``help(shape)``.
sv: *shape* kan vara vilken som helst av de inbyggda formerna, t.ex. pil, sköldpadda osv. För mer information, se ``help(shape)``.

source: If you want to use no fill color (i.e. make the turtle transparent), you have to write ``fillcolor = ""`` (but all nonempty strings must not have quotes in the cfg file).
pt_pt: Se quiser usar sem cor de preenchimento (ou seja, tornar a tartaruga transparente), tem de escrever ``fillcolor = ""`` (mas todas as *strings* não vazias não devem ter aspas no ficheiro cfg).
sv: Om du inte vill använda någon fyllnadsfärg (t.ex. göra sköldpaddan genomskinlig) måste du skriva ``fillcolor = ""`` (men alla icke-tomma strängar får inte ha citattecken i cfg-filen).

source: If you want to reflect the turtle its state, you have to use ``resizemode = auto``.
pt_pt: Se quiser refletir o estado da tartaruga, tem de usar ``resizemode = auto``.
sv: Om du vill återspegla sköldpaddans tillstånd måste du använda ``resizemode = auto``.

source: If you set e.g. ``language = italian`` the docstringdict :file:`turtle_docstringdict_italian.py` will be loaded at import time (if present on the import path, e.g. in the same directory as :mod:`turtle`).
pt_pt: Se definir, por exemplo, ``language = italian``, o docstringdict :file:`turtle_docstringdict_italian.py` será carregado no momento da importação (se estiver presente no caminho de importação, por exemplo, no mesmo diretório que :mod:`turtle`).
sv: Om du t.ex. anger ``language = italian`` kommer docstringdict :file:`turtle_docstringdict_italian.py` att laddas vid importtillfället (om den finns på importsökvägen, t.ex. i samma katalog som :mod:`turtle`).

source: The entries *exampleturtle* and *examplescreen* define the names of these objects as they occur in the docstrings. The transformation of method-docstrings to function-docstrings will delete these names from the docstrings.
pt_pt: As entradas *exampleturtle* e *examplescreen* definem os nomes destes objetos tal como aparecem nas docstrings. A transformação de docstrings de métodos em docstrings de funções apagará estes nomes das docstrings.
sv: Posterna *exampleturtle* och *examplescreen* definierar namnen på dessa objekt så som de förekommer i dokumentsträngarna. När metoddokumentationer omvandlas till funktionsdokumentationer kommer dessa namn att tas bort från dokumentationerna.

source: *using_IDLE*: Set this to ``True`` if you regularly work with IDLE and its ``-n`` switch ("no subprocess"). This will prevent :func:`exitonclick` to enter the mainloop.
pt_pt: *using_IDLE*: Defina isto como ``True`` se trabalhar regularmente com o IDLE e a sua opção ``-n`` ("sem subprocesso"). Isto impedirá que :func:`exitonclick` entre no mainloop.
sv: *använder_IDLE*: Sätt detta till ``True`` om du regelbundet arbetar med IDLE och dess ``\-n`` switch ("no subprocess"). Detta kommer att förhindra :func:`exitonclick` att gå in i huvudslingan.

source: There can be a :file:`turtle.cfg` file in the directory where :mod:`turtle` is stored and an additional one in the current working directory. The latter will override the settings of the first one.
pt_pt: Pode existir um ficheiro :file:`turtle.cfg` no diretório onde :mod:`turtle` está armazenado e outro adicional no diretório de trabalho atual. Este último substituirá as definições do primeiro.
sv: Det kan finnas en :file:`turtle.cfg`\-fil i den katalog där :mod:`turtle` lagras och ytterligare en i den aktuella arbetskatalogen. Den senare kommer att åsidosätta inställningarna i den första.

source: The :file:`Lib/turtledemo` directory contains a :file:`turtle.cfg` file. You can study it as an example and see its effects when running the demos (preferably not from within the demo-viewer).
pt_pt: O diretório :file:`Lib/turtledemo` contém um ficheiro :file:`turtle.cfg`. Pode estudá-lo como exemplo e ver os seus efeitos ao executar as demonstrações (preferencialmente não a partir do visualizador de demonstrações).
sv: I katalogen :file:`Lib/turtledemo` finns en fil :file:`turtle.cfg`. Du kan studera den som ett exempel och se dess effekter när du kör demona (helst inte från demovisaren).

source: :mod:`turtledemo` --- Demo scripts
pt_pt: :mod:`turtledemo` --- Scripts de demonstração
sv: :mod:`turtledemo` --- Demoskript

source: The :mod:`turtledemo` package includes a set of demo scripts. These scripts can be run and viewed using the supplied demo viewer as follows::
pt_pt: O pacote :mod:`turtledemo` inclui um conjunto de scripts de demonstração. Estes scripts podem ser executados e visualizados usando o visualizador de demonstrações fornecido da seguinte forma:
sv: Paketet :mod:`turtledemo` innehåller en uppsättning demoskript. Dessa skript kan köras och visas med hjälp av den medföljande demovisaren enligt följande::

source: Alternatively, you can run the demo scripts individually. For example, ::
pt_pt: Alternativamente, pode executar os scripts de demonstração individualmente. Por exemplo:
sv: Alternativt kan du köra demoskripten var för sig. Till exempel ::

source: The :mod:`turtledemo` package directory contains:
pt_pt: O diretório do pacote :mod:`turtledemo` contém:
sv: Paketkatalogen :mod:`turtledemo` innehåller:

source: A demo viewer :file:`__main__.py` which can be used to view the sourcecode of the scripts and run them at the same time.
pt_pt: Um visualizador de demonstrações :file:`__main__.py` que pode ser usado para visualizar o código-fonte dos scripts e executá-los ao mesmo tempo.
sv: En demovisare :file:`__main__.py` som kan användas för att visa källkoden för skripten och köra dem samtidigt.

source: Multiple scripts demonstrating different features of the :mod:`turtle` module. Examples can be accessed via the Examples menu. They can also be run standalone.
pt_pt: Múltiplos scripts que demonstram diferentes funcionalidades do módulo :mod:`turtle`. Os exemplos podem ser acedidos através do menu Exemplos. Também podem ser executados autonomamente.
sv: Flera skript som demonstrerar olika funktioner i modulen :mod:`turtle`. Du kan komma åt exemplen via menyn Examples. De kan också köras fristående.

source: A :file:`turtle.cfg` file which serves as an example of how to write and use such files.
pt_pt: Um ficheiro :file:`turtle.cfg` que serve como exemplo de como escrever e usar tais ficheiros.
sv: En :file:`turtle.cfg`\-fil som fungerar som ett exempel på hur man skriver och använder sådana filer.

source: The demo scripts are:
pt_pt: Os scripts de demonstração são:
sv: Demoskriptet är:

source: Name
pt_pt: Nome
sv: Namn

source: Description
pt_pt: Descrição
sv: Beskrivning

source: Features
pt_pt: Funcionalidades
sv: Funktioner

source: complex classical turtle graphics pattern
pt_pt: padrão complexo de gráficos clássicos de tartaruga
sv: komplext klassiskt sköldpaddsgrafiskt mönster

source: :func:`tracer`, delay, :func:`update`
sv: :func:`tracer`, fördröjning, :func:`update`

source: chaos
sv: kaos

source: graphs Verhulst dynamics, shows that computer's computations can generate results sometimes against the common sense expectations
pt_pt: grafica a dinâmica de Verhulst, mostra que os cálculos do computador podem gerar resultados por vezes contra as expectativas do senso comum
sv: graf Verhulst dynamik, visar att datorns beräkningar kan generera resultat som ibland strider mot sunt förnufts förväntningar

source: world coordinates
pt_pt: coordenadas mundiais
sv: världskoordinater

source: clock
sv: klocka

source: analog clock showing time of your computer
pt_pt: relógio analógico que mostra a hora do seu computador
sv: analog klocka som visar tiden för din dator

source: turtles as clock's hands, ontimer
sv: sköldpaddor som klockvisare, ontimer

source: colormixer
sv: färgblandare

source: experiment with r, g, b
pt_pt: experimentar com r, g, b
sv: experimentera med r, g, b

source: forest
sv: skog

source: 3 breadth-first trees
pt_pt: 3 árvores em largura-primeiro
sv: 3 Bredd-först-träd

source: randomization
pt_pt: aleatoriedade
sv: randomisering

source: Hilbert & Koch curves
pt_pt: curvas de Hilbert e Koch
sv: Hilbert- och Koch-kurvor

source: recursion
pt_pt: recursão
sv: rekursion

source: ethnomathematics (indian kolams)
pt_pt: etnomatemática (kolams indianos)
sv: etnomatematik (indiska kolamer)

source: Towers of Hanoi
pt_pt: Torres de Hanói
sv: Tornen i Hanoi

source: Rectangular Turtles as Hanoi discs (shape, shapesize)
sv: Rektangulära sköldpaddor som Hanoi-skivor (form, shapesize)

source: play the classical nim game with three heaps of sticks against the computer.
pt_pt: jogar o jogo clássico nim com três montes de paus contra o computador.
sv: spela det klassiska nim-spelet med tre högar av pinnar mot datorn.

source: turtles as nimsticks, event driven (mouse, keyboard)
pt_pt: tartarugas como paus de nim, orientado a eventos (rato, teclado)
sv: sköldpaddor som nimsticks, händelsestyrd (mus, tangentbord)

source: paint
sv: färg

source: super minimalistic drawing program
pt_pt: programa de desenho super minimalista
sv: super minimalistiskt ritprogram

source: peace
sv: fred

source: elementary
pt_pt: elementar
sv: elementär

source: turtle: appearance and animation
pt_pt: tartaruga: aparência e animação
sv: sköldpadda: utseende och animation

source: penrose
sv: penros

source: aperiodic tiling with kites and darts
pt_pt: pavimentação aperiódica com pipas e dardos
sv: aperiodiska plattor med drakar och pilar

source: planet_and_moon
sv: planet_och_måne

source: simulation of gravitational system
pt_pt: simulação de um sistema gravitacional
sv: simulering av gravitationssystem

source: compound shapes, :class:`Vec2D`
pt_pt: formas compostas, :class:`Vec2D`
sv: sammansatta former, :class:`Vec2D`

source: rosette
sv: rosett

source: a pattern from the wikipedia article on turtle graphics
pt_pt: um padrão do artigo da Wikipedia sobre gráficos de tartaruga
sv: ett mönster från wikipediaartikeln om sköldpaddsgrafik

source: round_dance
sv: runddans

source: dancing turtles rotating pairwise in opposite direction
pt_pt: tartarugas dançantes a rodar aos pares em direções opostas
sv: dansande sköldpaddor som roterar parvis i motsatt riktning

source: compound shapes, clone shapesize, tilt, get_shapepoly, update
sv: sammansatta former, klona former storlek, lutning, get_shapepoly, uppdatering

source: sorting_animate
sv: sortering_animerad

source: visual demonstration of different sorting methods
pt_pt: demonstração visual de diferentes métodos de ordenação
sv: visuell demonstration av olika sorteringsmetoder

source: simple alignment, randomization
pt_pt: alinhamento simples, aleatoriedade
sv: enkel justering, randomisering

source: tree
sv: träd

source: a (graphical) breadth first tree (using generators)
pt_pt: uma árvore (gráfica) em largura-primeiro (usando geradores)
sv: ett (grafiskt) träd med första bredden (med hjälp av generatorer)

source: two_canvases
sv: två_kanvaser

source: simple design
pt_pt: desenho simples
sv: enkel design

source: turtles on two canvases
pt_pt: tartarugas em dois canvas
sv: sköldpaddor på två dukar

source: another elementary example
pt_pt: outro exemplo elementar
sv: ett annat elementärt exempel

source: Have fun!
pt_pt: Divirta-se!
sv: Ha kul!

source: Changes since Python 2.6
pt_pt: Alterações desde o Python 2.6
sv: Ändringar sedan Python 2.6

source: The methods :func:`Turtle.tracer <tracer>`, :func:`Turtle.window_width <window_width>` and :func:`Turtle.window_height <window_height>` have been eliminated. Methods with these names and functionality are now available only as methods of :class:`Screen`. The functions derived from these remain available. (In fact already in Python 2.6 these methods were merely duplications of the corresponding :class:`TurtleScreen`/:class:`Screen` methods.)
pt_pt: Os métodos :func:`Turtle.tracer <tracer>`, :func:`Turtle.window_width <window_width>` e :func:`Turtle.window_height <window_height>` foram eliminados. Métodos com estes nomes e funcionalidades estão agora disponíveis apenas como métodos de :class:`Screen`. As funções derivadas destes permanecem disponíveis. (De facto, já no Python 2.6, estes métodos eram meras duplicações dos métodos correspondentes de :class:`TurtleScreen`/:class:`Screen`.)
sv: Metoderna :func:`Turtle.tracer <tracer>`, :func:`Turtle.window_width <window_width>` och :func:`Turtle.window_height <window_height>` har tagits bort. Metoder med dessa namn och funktioner är nu endast tillgängliga som metoder i :class:`Screen`. De funktioner som härrör från dessa är fortfarande tillgängliga. (Faktum är att redan i Python 2.6 var dessa metoder bara dupliceringar av motsvarande :class:`TurtleScreen`/:class:`Screen`\-metoder)

source: The method :func:`!Turtle.fill` has been eliminated. The behaviour of :func:`begin_fill` and :func:`end_fill` have changed slightly: now every filling process must be completed with an ``end_fill()`` call.
pt_pt: O método :func:`!Turtle.fill` foi eliminado. O comportamento de :func:`begin_fill` e :func:`end_fill` mudou ligeiramente: agora, cada processo de preenchimento deve ser concluído com uma chamada ``end_fill()``.
sv: Metoden :func:`!Turtle.fill` har tagits bort. Beteendet för :func:`begin_fill` och :func:`end_fill` har ändrats något: nu måste varje fyllningsprocess avslutas med ett ``end_fill()``\-anrop.

source: A method :func:`Turtle.filling <filling>` has been added. It returns a boolean value: ``True`` if a filling process is under way, ``False`` otherwise. This behaviour corresponds to a ``fill()`` call without arguments in Python 2.6.
pt_pt: Foi adicionado um método :func:`Turtle.filling <filling>`. Retorna um valor booleano: ``True`` se um processo de preenchimento estiver em curso, ``False`` caso contrário. Este comportamento corresponde a uma chamada ``fill()`` sem argumentos no Python 2.6.
sv: En metod :func:`Turtle.filling <filling>` har lagts till. Den returnerar ett booleanskt värde: ``True`` om en fyllningsprocess pågår, ``False`` annars. Detta beteende motsvarar ett ``fill()``\-anrop utan argument i Python 2.6.

source: Changes since Python 3.0
pt_pt: Alterações desde o Python 3.0
sv: Ändringar sedan Python 3.0

source: The :class:`Turtle` methods :func:`shearfactor`, :func:`shapetransform` and :func:`get_shapepoly` have been added. Thus the full range of regular linear transforms is now available for transforming turtle shapes. :func:`tiltangle` has been enhanced in functionality: it now can be used to get or set the tilt angle.
pt_pt: Os métodos :class:`Turtle` :func:`shearfactor`, :func:`shapetransform` e :func:`get_shapepoly` foram adicionados. Assim, toda a gama de transformações lineares regulares está agora disponível para transformar formas de tartaruga. :func:`tiltangle` foi melhorado em funcionalidade: agora pode ser usado para obter ou definir o ângulo de inclinação.
sv: Metoderna :class:`Turtle` :func:`shearfactor`, :func:`shapetransform` och :func:`get_shapepoly` har lagts till. Därmed finns nu hela utbudet av vanliga linjära transformationer tillgängliga för att transformera sköldpaddsformer. :func:`tiltangle` har fått utökad funktionalitet: den kan nu användas för att få eller ställa in lutningsvinkeln.

source: The :class:`Screen` method :func:`onkeypress` has been added as a complement to :func:`onkey`. As the latter binds actions to the key release event, an alias: :func:`onkeyrelease` was also added for it.
pt_pt: O método :class:`Screen` :func:`onkeypress` foi adicionado como complemento a :func:`onkey`. Como este último liga ações ao evento de libertação da tecla, um alias: :func:`onkeyrelease` também foi adicionado para ele.
sv: Metoden :class:`Screen` :func:`onkeypress` har lagts till som ett komplement till :func:`onkey`. Eftersom den senare binder åtgärder till nyckelutlösningshändelsen, har ett alias: :func:`onkeyrelease` också lagts till för den.

source: The method :func:`Screen.mainloop <mainloop>` has been added, so there is no longer a need to use the standalone :func:`mainloop` function when working with :class:`Screen` and :class:`Turtle` objects.
pt_pt: O método :func:`Screen.mainloop <mainloop>` foi adicionado, por isso já não é necessário usar a função autónoma :func:`mainloop` ao trabalhar com objetos :class:`Screen` e :class:`Turtle`.
sv: Metoden :func:`Screen.mainloop <mainloop>` har lagts till, så det finns inte längre något behov av att använda den fristående funktionen :func:`mainloop` när man arbetar med objekten :class:`Screen` och :class:`Turtle`.

source: Two input methods have been added: :func:`Screen.textinput <textinput>` and :func:`Screen.numinput <numinput>`. These pop up input dialogs and return strings and numbers respectively.
pt_pt: Foram adicionados dois métodos de entrada: :func:`Screen.textinput <textinput>` e :func:`Screen.numinput <numinput>`. Estes abrem diálogos de entrada e retornam *strings* e números, respetivamente.
sv: Två inmatningsmetoder har lagts till: :func:`Screen.textinput <textinput>` och :func:`Screen.numinput <numinput>`. Dessa öppnar inmatningsdialoger och returnerar strängar respektive siffror.

source: :mod:`!turtle` --- Turtle graphics
pt_pt: :mod:`!turtle` --- Gráficos de tartaruga

source: This is an :term:`optional module`. If it is missing from your copy of CPython, look for documentation from your distributor (that is, whoever provided Python to you). If you are the distributor, see :ref:`optional-module-requirements`.
pt_pt: Este é um :term:`módulo opcional`. Se estiver em falta na sua cópia do CPython, procure documentação junto do seu distribuidor (ou seja, quem lhe forneceu o Python). Se for o distribuidor, veja :ref:`optional-module-requirements`.

source: Automatically begin and end filling
pt_pt: Iniciar e terminar o preenchimento automaticamente

source: Starting with Python 3.14, you can use the :func:`fill` :term:`context manager` instead of :func:`begin_fill` and :func:`end_fill` to automatically begin and end fill. Here is an example::
pt_pt: A partir do Python 3.14, pode usar o :func:`fill` :term:`gestor de contexto` em vez de :func:`begin_fill` e :func:`end_fill` para iniciar e terminar o preenchimento automaticamente. Aqui está um exemplo:

source: The code above is equivalent to::
pt_pt: O código acima é equivalente a:

source: >>> turtle.home() >>> turtle.position() (0.00,0.00) >>> turtle.heading() 0.0 >>> turtle.circle(50) >>> turtle.position() (-0.00,0.00) >>> turtle.heading() 0.0 >>> turtle.circle(120, 180) # draw a semicircle >>> turtle.position() (0.00,240.00) >>> turtle.heading() 180.0
pt_pt: >>> turtle.home() >>> turtle.position() (0.00,0.00) >>> turtle.heading() 0.0 >>> turtle.circle(50) >>> turtle.position() (-0.00,0.00) >>> turtle.heading() 0.0 >>> turtle.circle(120, 180) # desenhar um semicírculo >>> turtle.position() (0.00,240.00) >>> turtle.heading() 180.0

source: Draw a circular dot with diameter *size*, using *color*. If *size* is not given, the maximum of ``pensize+4`` and ``2*pensize`` is used.
pt_pt: Desenha um ponto circular com diâmetro *size*, usando *color*. Se *size* não for dado, é usado o máximo de ``pensize+4`` e ``2*pensize``.

source: >>> turtle.home() >>> turtle.left(90) >>> turtle.heading() 90.0 >>> # Change angle measurement unit to grad (also known as gon, >>> # grade, or gradian and equals 1/100-th of the right angle.) >>> turtle.degrees(400.0) >>> turtle.heading() 100.0 >>> turtle.degrees(360) >>> turtle.heading() 90.0
pt_pt: >>> turtle.home() >>> turtle.left(90) >>> turtle.heading() 90.0 >>> # Muda a unidade de medição de ângulo para grad (também conhecido como gon, >>> # grau, ou gradiano e equivale a 1/100 do ângulo reto.) >>> turtle.degrees(400.0) >>> turtle.heading() 100.0 >>> turtle.degrees(360) >>> turtle.heading() 90.0

source: >>> turtle.pensize() 1 >>> turtle.pensize(10) # from here on lines of width 10 are drawn
pt_pt: >>> turtle.pensize() 1 >>> turtle.pensize(10) # a partir daqui, linhas com espessura 10 são desenhadas

source: >>> turtle.pen(fillcolor="black", pencolor="red", pensize=10) >>> sorted(turtle.pen().items()) [('fillcolor', 'black'), ('outline', 1), ('pencolor', 'red'), ('pendown', True), ('pensize', 10), ('resizemode', 'noresize'), ('shearfactor', 0.0), ('shown', True), ('speed', 9), ('stretchfactor', (1.0, 1.0)), ('tilt', 0.0)] >>> penstate=turtle.pen() >>> turtle.color("yellow", "") >>> turtle.penup() >>> sorted(turtle.pen().items())[:3] [('fillcolor', ''), ('outline', 1), ('pencolor', 'yellow')] >>> turtle.pen(penstate, fillcolor="green") >>> sorted(turtle.pen().items())[:3] [('fillcolor', 'green'), ('outline', 1), ('pencolor', 'red')]
pt_pt: >>> turtle.pen(cor_preenchimento="black", cor_caneta="red", tamanho_caneta=10) >>> sorted(turtle.pen().items()) [('cor_preenchimento', 'black'), ('contorno', 1), ('cor_caneta', 'red'), ('caneta_baixada', True), ('tamanho_caneta', 10), ('modo_redimensionamento', 'sem_redimensionar'), ('fator_cisalhamento', 0.0), ('mostrada', True), ('velocidade', 9), ('fator_estiramento', (1.0, 1.0)), ('inclinação', 0.0)] >>> estado_caneta=turtle.pen() >>> turtle.color("yellow", "") >>> turtle.penup() >>> sorted(turtle.pen().items())[:3] [('cor_preenchimento', ''), ('contorno', 1), ('cor_caneta', 'yellow')] >>> turtle.pen(estado_caneta, cor_preenchimento="green") >>> sorted(turtle.pen().items())[:3] [('cor_preenchimento', 'green'), ('contorno', 1), ('cor_caneta', 'red')]

source: Return the current pencolor as color specification string or as a tuple (see example). May be used as input to another color/pencolor/fillcolor/bgcolor call.
pt_pt: Retorna a cor atual da caneta como uma *string* de especificação de cor ou como um tuplo (ver exemplo). Pode ser usada como entrada para outra chamada de cor/pencolor/fillcolor/bgcolor.

source: Return the current fillcolor as color specification string, possibly in tuple format (see example). May be used as input to another color/pencolor/fillcolor/bgcolor call.
pt_pt: Retorna a cor de preenchimento atual como uma *string* de especificação de cor, possivelmente em formato de tuplo (ver exemplo). Pode ser usada como entrada para outra chamada de cor/pencolor/fillcolor/bgcolor.

source: >>> turtle.fillcolor("violet") >>> turtle.fillcolor() 'violet' >>> turtle.pencolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor((50, 193, 143)) # Integers, not floats >>> turtle.fillcolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor('#ffffff') >>> turtle.fillcolor() (255.0, 255.0, 255.0)
pt_pt: >>> turtle.fillcolor("violet") >>> turtle.fillcolor() 'violet' >>> turtle.pencolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor((50, 193, 143)) # Inteiros, não floats >>> turtle.fillcolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor('#ffffff') >>> turtle.fillcolor() (255.0, 255.0, 255.0)

source: Fill the shape drawn in the ``with turtle.fill():`` block.
pt_pt: Preenche a forma desenhada no bloco ``with turtle.fill():``.

source: Using :func:`!fill` is equivalent to adding the :func:`begin_fill` before the fill-block and :func:`end_fill` after the fill-block:
pt_pt: Usar :func:`!fill` é equivalente a adicionar :func:`begin_fill` antes do bloco de preenchimento e :func:`end_fill` após o bloco de preenchimento:

source: >>> turtle.resizemode() 'noresize' >>> turtle.resizemode("auto") >>> turtle.resizemode() 'auto'
pt_pt: >>> turtle.resizemode() 'sem_redimensionar' >>> turtle.resizemode("auto") >>> turtle.resizemode() 'auto'
