Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: pt_pt, sv

source: >>> turtle.shapesize() (1.0, 1.0, 1) >>> turtle.resizemode("user") >>> turtle.shapesize(5, 5, 12) >>> turtle.shapesize() (5, 5, 12) >>> turtle.shapesize(outline=8) >>> turtle.shapesize() (5, 5, 8)
pt_pt: >>> turtle.shapesize() (1.0, 1.0, 1) >>> turtle.resizemode("utilizador") >>> turtle.shapesize(5, 5, 12) >>> turtle.shapesize() (5, 5, 12) >>> turtle.shapesize(outline=8) >>> turtle.shapesize() (5, 5, 8)

source: >>> def turn(x, y): ... left(180) ... >>> onclick(turn) # Now clicking into the turtle will turn it. >>> onclick(None) # event-binding will be removed
pt_pt: >>> def turn(x, y): ... left(180) ... >>> onclick(turn) # Agora clicar na tartaruga fará com que ela rode. >>> onclick(None) # a ligação do evento será removida

source: >>> class MyTurtle(Turtle): ... def glow(self,x,y): ... self.fillcolor("red") ... def unglow(self,x,y): ... self.fillcolor("") ... >>> turtle = MyTurtle() >>> turtle.onclick(turtle.glow) # clicking on turtle turns fillcolor red, >>> turtle.onrelease(turtle.unglow) # releasing turns it to transparent.
pt_pt: >>> class MyTurtle(Turtle): ... def glow(self,x,y): ... self.fillcolor("red") ... def unglow(self,x,y): ... self.fillcolor("") ... >>> turtle = MyTurtle() >>> turtle.onclick(turtle.glow) # clicar na tartaruga torna a cor de preenchimento vermelha, >>> turtle.onrelease(turtle.unglow) # libertar torna-a transparente.

source: Record the vertices of a polygon drawn in the ``with turtle.poly():`` block. The first and last vertices will be connected.
pt_pt: Regista os vértices de um polígono desenhado no bloco ``with turtle.poly():``. O primeiro e o último vértices serão conectados.

source: Return or set the background color of the TurtleScreen.
pt_pt: Retorna ou define a cor de fundo do TurtleScreen.

source: Return the current background color as color specification string or as a tuple (see example). May be used as input to another color/pencolor/fillcolor/bgcolor call.
pt_pt: Retorna a cor de fundo atual como uma *string* de especificação de cor ou como um tuplo (ver exemplo). Pode ser usada como entrada para outra chamada de cor/pencolor/fillcolor/bgcolor.

source: Set the background color to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
pt_pt: Define a cor de fundo para *colorstring*, que é uma *string* de especificação de cor Tk, como ``"red"``, ``"yellow"``, ou ``"#33cc8c"``.

source: Set the background color to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
pt_pt: Define a cor de fundo para a cor RGB representada pelo tuplo de *r*, *g*, e *b*. Cada um de *r*, *g*, e *b* deve estar no intervalo 0..colormode, onde colormode é 1.0 ou 255 (consulte :func:`colormode`).

source: Set the background color to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
pt_pt: Define a cor de fundo para a cor RGB representada por *r*, *g*, e *b*. Cada um de *r*, *g*, e *b* deve estar no intervalo 0..colormode.

source: a string, name of an image file (PNG, GIF, PGM, and PPM) or ``"nopic"``, or ``None``
pt_pt: uma *string*, nome de um ficheiro de imagem (PNG, GIF, PGM e PPM) ou ``"nopic"``, ou ``None``

source: >>> screen.reset() >>> screen.setworldcoordinates(-50,-7.5,50,7.5) >>> for _ in range(72): ... left(10) ... >>> for _ in range(8): ... left(45); fd(2) # a regular octagon
pt_pt: >>> screen.reset() >>> screen.setworldcoordinates(-50,-7.5,50,7.5) >>> for _ in range(72): ... left(10) ... >>> for _ in range(8): ... left(45); fd(2) # um octógono regular

source: Temporarily disable turtle animation. The code written inside the ``no_animation`` block will not be animated; once the code block is exited, the drawing will appear.
pt_pt: Desativa temporariamente a animação da tartaruga. O código escrito dentro do bloco ``no_animation`` não será animado; uma vez que o bloco de código seja saído, o desenho aparecerá.

source: >>> screen.onclick(turtle.goto) # Subsequently clicking into the TurtleScreen will >>> # make the turtle move to the clicked point. >>> screen.onclick(None) # remove event binding again
pt_pt: >>> screen.onclick(turtle.goto) # Posteriormente, clicar no TurtleScreen fará >>> # com que a tartaruga se mova para o ponto clicado. >>> screen.onclick(None) # remove a ligação do evento novamente

source: >>> running = True >>> def f(): ... if running: ... fd(50) ... lt(60) ... screen.ontimer(f, 250) >>> f() ### makes the turtle march around >>> running = False
pt_pt: >>> running = True >>> def f(): ... if running: ... fd(50) ... lt(60) ... screen.ontimer(f, 250) >>> f() ### faz a tartaruga marchar à volta >>> running = False

source: >>> screen.textinput("NIM", "Name of first player:")
pt_pt: >>> screen.textinput("NIM", "Nome do primeiro jogador:")

source: >>> screen.numinput("Poker", "Your stakes:", 1000, minval=10, maxval=10000)
pt_pt: >>> screen.numinput("Poker", "As suas apostas:", 1000, minval=10, maxval=10000)

source: >>> mode("logo") # resets turtle heading to north >>> mode() 'logo'
pt_pt: >>> mode("logo") # reinicia a orientação da tartaruga para norte >>> mode() 'logo'

source: >>> screen.colormode(1) >>> turtle.pencolor(240, 160, 80) Traceback (most recent call last): ... TurtleGraphicsError: bad color sequence: (240, 160, 80) >>> screen.colormode() 1.0 >>> screen.colormode(255) >>> screen.colormode() 255 >>> turtle.pencolor(240,160,80)
pt_pt: >>> screen.colormode(1) >>> turtle.pencolor(240, 160, 80) Traceback (most recent call last): ... TurtleGraphicsError: sequência de cor inválida: (240, 160, 80) >>> screen.colormode() 1.0 >>> screen.colormode(255) >>> screen.colormode() 255 >>> turtle.pencolor(240,160,80)

source: There are four different ways to call this function:
pt_pt: Existem quatro maneiras diferentes de chamar esta função:

source: *name* is the name of an image file (PNG, GIF, PGM, and PPM) and *shape* is ``None``: Install the corresponding image shape. ::
pt_pt: *name* é o nome de um ficheiro de imagem (PNG, GIF, PGM e PPM) e *shape* é ``None``: Instala a forma de imagem correspondente. ::

source: *name* is an arbitrary string and *shape* is the name of an image file (PNG, GIF, PGM, and PPM): Install the corresponding image shape. ::
pt_pt: *name* é uma *string* arbitrária e *shape* é o nome de um ficheiro de imagem (PNG, GIF, PGM e PPM): Instala a forma de imagem correspondente. ::

source: Added support for PNG, PGM, and PPM image formats. Both a shape name and an image file name can be specified.
pt_pt: Adicionado suporte para os formatos de imagem PNG, PGM e PPM. Tanto um nome de forma como um nome de ficheiro de imagem podem ser especificados.

source: Save the current turtle drawing (and turtles) as a PostScript file.
pt_pt: Guarda o desenho atual da tartaruga (e tartarugas) como um ficheiro PostScript.

source: the path of the saved PostScript file
pt_pt: o caminho do ficheiro PostScript guardado

source: if ``False`` and there already exists a file with the given filename, then the function will raise a ``FileExistsError``. If it is ``True``, the file will be overwritten.
pt_pt: se ``False`` e já existir um ficheiro com o nome dado, a função gerará um ``FileExistsError``. Se for ``True``, o ficheiro será sobrescrito.

source: >>> screen.setup (width=200, height=200, startx=0, starty=0) >>> # sets window to 200x200 pixels, in upper left of screen >>> screen.setup(width=.75, height=0.5, startx=None, starty=None) >>> # sets window to 75% of screen by 50% of screen and centers
pt_pt: >>> screen.setup(width=200, height=200, startx=0, starty=0) >>> # define a janela para 200x200 píxeis, no canto superior esquerdo do ecrã >>> screen.setup(width=.75, height=0.5, startx=None, starty=None) >>> # define a janela para 75% da largura do ecrã e 50% da altura e centra

source: >>> screen.title("Welcome to the turtle zoo!")
pt_pt: >>> screen.title("Bem-vindo ao zoo da tartaruga!")

source: *data*
pt_pt: *dados*

source: "polygon"
pt_pt: "polígono"

source: >>> poly = ((0,0),(10,-5),(0,10),(-10,-5)) >>> s = Shape("compound") >>> s.addcomponent(poly, "red", "blue") >>> # ... add more components and then use register_shape()
pt_pt: >>> poly = ((0,0),(10,-5),(0,10),(-10,-5)) >>> s = Shape("compound") >>> s.addcomponent(poly, "red", "blue") >>> # ... adicionar mais componentes e depois usar register_shape()

source: >>> help(Screen.bgcolor) Help on method bgcolor in module turtle: bgcolor(self, *args) unbound turtle.Screen method Set or return backgroundcolor of the TurtleScreen. Arguments (if given): a color string or three numbers in the range 0..colormode or a 3-tuple of such numbers. >>> screen.bgcolor("orange") >>> screen.bgcolor() "orange" >>> screen.bgcolor(0.5,0,0.5) >>> screen.bgcolor() "#800080" >>> help(Turtle.penup) Help on method penup in module turtle: penup(self) unbound turtle.Turtle method Pull the pen up -- no drawing when moving. Aliases: penup | pu | up No argument >>> turtle.penup()
pt_pt: >>> help(Screen.bgcolor) Ajuda sobre o método bgcolor no módulo turtle: bgcolor(self, *args) método não ligado turtle.Screen Define ou retorna a cor de fundo do TurtleScreen. Argumentos (se dados): uma *string* de cor ou três números no intervalo 0..colormode ou um tuplo de 3 números. >>> screen.bgcolor("orange") >>> screen.bgcolor() "orange" >>> screen.bgcolor(0.5,0,0.5) >>> screen.bgcolor() "#800080" >>> help(Turtle.penup) Ajuda sobre o método penup no módulo turtle: penup(self) método não ligado turtle.Turtle Levanta a caneta -- não desenha ao mover. Alias: penup | pu | up Sem argumentos >>> turtle.penup()

source: >>> help(bgcolor) Help on function bgcolor in module turtle: bgcolor(*args) Set or return backgroundcolor of the TurtleScreen. Arguments (if given): a color string or three numbers in the range 0..colormode or a 3-tuple of such numbers. Example:: >>> bgcolor("orange") >>> bgcolor() "orange" >>> bgcolor(0.5,0,0.5) >>> bgcolor() "#800080" >>> help(penup) Help on function penup in module turtle: penup() Pull the pen up -- no drawing when moving. Aliases: penup | pu | up No argument Example: >>> penup()
pt_pt: >>> help(bgcolor) Ajuda sobre a função bgcolor no módulo turtle: bgcolor(*args) Define ou retorna a cor de fundo do TurtleScreen. Argumentos (se dados): uma *string* de cor ou três números no intervalo 0..colormode ou um tuplo de 3 números. Exemplo:: >>> bgcolor("orange") >>> bgcolor() "orange" >>> bgcolor(0.5,0,0.5) >>> bgcolor() "#800080" >>> help(penup) Ajuda sobre a função penup no módulo turtle: penup() Levanta a caneta -- não desenha ao mover. Alias: penup | pu | up Sem argumentos Exemplo: >>> penup()

source: width = 0.5 height = 0.75 leftright = None topbottom = None canvwidth = 400 canvheight = 300 mode = standard colormode = 1.0 delay = 10 undobuffersize = 1000 shape = classic pencolor = black fillcolor = black resizemode = noresize visible = True language = english exampleturtle = turtle examplescreen = screen title = Python Turtle Graphics using_IDLE = False
pt_pt: width = 0.5 height = 0.75 leftright = None topbottom = None canvwidth = 400 canvheight = 300 mode = standard colormode = 1.0 delay = 10 undobuffersize = 1000 shape = classic pencolor = black fillcolor = black resizemode = noresize visible = True language = portuguese exampleturtle = turtle examplescreen = screen title = Gráficos de Tartaruga Python using_IDLE = False

source: L-System
pt_pt: Sistema-L
