Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: pt_pt, sv

source: **Source code:** :source:`Lib/turtle.py`
pt_pt: **Código-fonte:** :source:`Lib/turtle.py`
sv: **Källkod:** :source:`Lib/turtle.py`

source: Introduction
pt_pt: Introdução
sv: Introduktion

source: Turtle graphics is an implementation of `the popular geometric drawing tools introduced in Logo <https://en.wikipedia.org/wiki/Turtle_ (robot)>`_, developed by Wally Feurzeig, Seymour Papert and Cynthia Solomon in 1967.
pt_pt: Os gráficos de tartaruga são uma implementação das `ferramentas populares de desenho geométrico introduzidas no Logo <https://en.wikipedia.org/wiki/Turtle_ (robot)>`_, desenvolvidas por Wally Feurzeig, Seymour Papert e Cynthia Solomon em 1967.
sv: Turtle graphics är en implementation av `de populära geometriska ritverktyg som introducerades i Logo <https://en.wikipedia.org/wiki/Turtle_ (robot)>`_, utvecklad av Wally Feurzeig, Seymour Papert och Cynthia Solomon 1967.

source: Get started
pt_pt: Começar
sv: Kom igång

source: Imagine a robotic turtle starting at (0, 0) in the x-y plane. After an ``import turtle``, give it the command ``turtle.forward(15)``, and it moves (on-screen!) 15 pixels in the direction it is facing, drawing a line as it moves. Give it the command ``turtle.right(25)``, and it rotates in-place 25 degrees clockwise.
pt_pt: Imagine uma tartaruga robótica a começar em (0, 0) no plano x-y. Após um ``import turtle``, dê-lhe o comando ``turtle.forward(15)``, e ela move-se (no ecrã!) 15 píxeis na direção para a qual está virada, desenhando uma linha à medida que se move. Dê-lhe o comando ``turtle.right(25)``, e ela roda no lugar 25 graus no sentido dos ponteiros do relógio.
sv: Föreställ dig en robotsköldpadda som startar vid (0, 0) i x-y-planet. Efter en ``import turtle``, ge den kommandot ``turtle.forward(15)``, och den rör sig (på skärmen!) 15 pixlar i den riktning den är vänd, och ritar en linje medan den rör sig. Ge den kommandot ``turtle.right(25)``, och den roterar på plats 25 grader medurs.

source: Turtle can draw intricate shapes using programs that repeat simple moves.
pt_pt: A tartaruga pode desenhar formas intrincadas usando programas que repetem movimentos simples.
sv: Turtle kan rita komplicerade former med hjälp av program som upprepar enkla rörelser.

source: In Python, turtle graphics provides a representation of a physical "turtle" (a little robot with a pen) that draws on a sheet of paper on the floor.
pt_pt: Em Python, os gráficos de tartaruga fornecem uma representação de uma "tartaruga" física (um pequeno robô com uma caneta) que desenha numa folha de papel no chão.
sv: I Python ger turtle graphics en representation av en fysisk "sköldpadda" (en liten robot med en penna) som ritar på ett pappersark på golvet.

source: It's an effective and well-proven way for learners to encounter programming concepts and interaction with software, as it provides instant, visible feedback. It also provides convenient access to graphical output in general.
pt_pt: É uma forma eficaz e bem comprovada para os aprendizes encontrarem conceitos de programação e interação com software, uma vez que fornece feedback imediato e visível. Também fornece acesso conveniente a saída gráfica em geral.
sv: Det är ett effektivt och väl beprövat sätt för elever att möta programmeringskoncept och interaktion med programvara, eftersom det ger omedelbar och synlig feedback. Det ger också bekväm tillgång till grafiska utdata i allmänhet.

source: Turtle drawing was originally created as an educational tool, to be used by teachers in the classroom. For the programmer who needs to produce some graphical output it can be a way to do that without the overhead of introducing more complex or external libraries into their work.
pt_pt: O desenho de tartaruga foi originalmente criado como uma ferramenta educativa, para ser usada por professores na sala de aula. Para o programador que precisa produzir alguma saída gráfica, pode ser uma forma de o fazer sem a sobrecarga de introduzir bibliotecas mais complexas ou externas no seu trabalho.
sv: Turtle drawing skapades ursprungligen som ett pedagogiskt verktyg, för att användas av lärare i klassrummet. För programmerare som behöver producera grafiska utdata kan det vara ett sätt att göra det utan att behöva introducera mer komplexa eller externa bibliotek i sitt arbete.

source: Tutorial
sv: Handledning

source: New users should start here. In this tutorial we'll explore some of the basics of turtle drawing.
pt_pt: Os novos utilizadores devem começar aqui. Neste tutorial, exploraremos alguns dos conceitos básicos do desenho com tartaruga.
sv: Nya användare bör börja här. I den här handledningen kommer vi att utforska några av grunderna i turtle-ritning.

source: Starting a turtle environment
pt_pt: Iniciar um ambiente de tartaruga
sv: Starta en turtle-miljö

source: In a Python shell, import all the objects of the ``turtle`` module::
pt_pt: Num shell Python, importe todos os objetos do módulo ``turtle``:
sv: I ett Python-skal importerar du alla objekt i modulen ``turtle``::

source: from turtle import *
sv: från turtle import *

source: If you run into a ``No module named '_tkinter'`` error, you'll have to install the :mod:`Tk interface package <tkinter>` on your system.
pt_pt: Se encontrar um erro ``No module named '_tkinter'``, terá de instalar o pacote de interface :mod:`Tk <tkinter>` no seu sistema.
sv: Om du stöter på felet ``No module named '_tkinter'`` måste du installera :mod:`Tk interface package <tkinter>` på ditt system.

source: Basic drawing
pt_pt: Desenho básico
sv: Grundläggande ritning

source: Send the turtle forward 100 steps::
pt_pt: Envie a tartaruga 100 passos em frente:
sv: Skicka sköldpaddan framåt 100 steg::

source: forward(100)
sv: framåt(100)

source: You should see (most likely, in a new window on your display) a line drawn by the turtle, heading East. Change the direction of the turtle, so that it turns 120 degrees left (anti-clockwise)::
pt_pt: Deve ver (provavelmente, numa nova janela no seu ecrã) uma linha desenhada pela tartaruga, apontando para Este. Mude a direção da tartaruga, para que vire 120 graus para a esquerda (sentido anti-horário):
sv: Du bör se (troligen i ett nytt fönster på din skärm) en linje dragen av sköldpaddan, som går österut. Ändra sköldpaddans riktning så att den vrider sig 120 grader åt vänster (moturs)::

source: left(120)
sv: vänster(120)

source: Let's continue by drawing a triangle::
pt_pt: Vamos continuar desenhando um triângulo:
sv: Låt oss fortsätta med att rita en triangel::

source: forward(100) left(120) forward(100)
sv: framåt(100) vänster(120) framåt(100)

source: Notice how the turtle, represented by an arrow, points in different directions as you steer it.
pt_pt: Repare como a tartaruga, representada por uma seta, aponta em diferentes direções à medida que a dirige.
sv: Lägg märke till hur sköldpaddan, som representeras av en pil, pekar i olika riktningar när du styr den.

source: Experiment with those commands, and also with ``backward()`` and ``right()``.
pt_pt: Experimente esses comandos, e também com ``backward()`` e ``right()``.
sv: Experimentera med dessa kommandon, och även med ``backward()`` och ``right()``.

source: Pen control
pt_pt: Controlo da caneta
sv: Kontroll av pennan

source: Try changing the color - for example, ``color('blue')`` - and width of the line - for example, ``width(3)`` - and then drawing again.
pt_pt: Experimente mudar a cor - por exemplo, ``color('blue')`` - e a largura da linha - por exemplo, ``width(3)`` - e depois desenhe novamente.
sv: Prova att ändra färg - till exempel ``color('blue')`` - och bredd på linjen - till exempel ``width(3)`` - och rita sedan igen.

source: You can also move the turtle around without drawing, by lifting up the pen: ``up()`` before moving. To start drawing again, use ``down()``.
pt_pt: Também pode mover a tartaruga sem desenhar, levantando a caneta: ``up()`` antes de se mover. Para começar a desenhar novamente, use ``down()``.
sv: Du kan också flytta runt sköldpaddan utan att rita, genom att lyfta upp pennan: ``up()`` innan du flyttar. För att börja rita igen, använd ``down()``.

source: The turtle's position
pt_pt: A posição da tartaruga
sv: Sköldpaddans position

source: Send your turtle back to its starting-point (useful if it has disappeared off-screen)::
pt_pt: Envie a sua tartaruga de volta ao seu ponto de partida (útil se ela desapareceu do ecrã):
sv: Skicka tillbaka din sköldpadda till startpunkten (användbart om den har försvunnit utanför skärmen)::

source: home()
sv: hem()

source: The home position is at the center of the turtle's screen. If you ever need to know them, get the turtle's x-y coordinates with::
pt_pt: A posição inicial está no centro do ecrã da tartaruga. Se alguma vez precisar de as saber, obtenha as coordenadas x-y da tartaruga com:
sv: Hemmapositionen är i mitten av sköldpaddans skärm. Om du någonsin behöver veta dem, kan du få sköldpaddans x-y-koordinater med::

source: Home is at ``(0, 0)``.
pt_pt: A posição inicial está em ``(0, 0)``.
sv: Hemmet ligger vid ``(0, 0)``.

source: And after a while, it will probably help to clear the window so we can start anew::
pt_pt: E depois de algum tempo, provavelmente será útil limpar a janela para podermos começar de novo:
sv: Och efter ett tag kommer det nog att hjälpa att rensa fönstret så att vi kan börja om på nytt::

source: clearscreen()
sv: rensa skärmen()

source: Making algorithmic patterns
pt_pt: Criar padrões algorítmicos
sv: Skapa algoritmiska mönster

source: Using loops, it's possible to build up geometric patterns::
pt_pt: Usando ciclos, é possível construir padrões geométricos:
sv: Med hjälp av slingor kan man bygga upp geometriska mönster::

source: for steps in range(100): for c in ('blue', 'red', 'green'): color(c) forward(steps) right(30)
sv: för steg i intervall(100): for c in ('blå', 'röd', 'grön'): färg(c) framåt(steg) höger(30)

source: \ - which of course, are limited only by the imagination!
pt_pt: \ - que, claro, são limitados apenas pela imaginação!
sv: \ - som naturligtvis bara begränsas av fantasin!

source: Let's draw the star shape at the top of this page. We want red lines, filled in with yellow::
pt_pt: Vamos desenhar a forma de estrela no topo desta página. Queremos linhas vermelhas, preenchidas com amarelo:
sv: Låt oss rita stjärnformen högst upp på den här sidan. Vi vill ha röda linjer, fyllda med gult::

source: color('red') fillcolor('yellow')
sv: färg('röd') fyllnadsfärg('gul')

source: Just as ``up()`` and ``down()`` determine whether lines will be drawn, filling can be turned on and off::
pt_pt: Tal como ``up()`` e ``down()`` determinam se as linhas serão desenhadas, o preenchimento pode ser ligado e desligado:
sv: Precis som ``up()`` och ``down()`` avgör om linjer ska ritas, kan fyllning slås på och av::

source: begin_fill()
sv: börja_fyllning()

source: Next we'll create a loop::
pt_pt: A seguir, criaremos um ciclo:
sv: Nu ska vi skapa en slinga::

source: while True: forward(200) left(170) if abs(pos()) < 1: break
sv: medan True: framåt(200) vänster(170) om abs(pos()) < 1: bryt

source: ``abs(pos()) < 1`` is a good way to know when the turtle is back at its home position.
pt_pt: ``abs(pos()) < 1`` é uma boa forma de saber quando a tartaruga está de volta à sua posição inicial.
sv: ``abs(pos()) < 1`` är ett bra sätt att veta när sköldpaddan är tillbaka på sin hemmaposition.

source: Finally, complete the filling::
pt_pt: Finalmente, complete o preenchimento:
sv: Avsluta med att fylla i::

source: (Note that filling only actually takes place when you give the ``end_fill()`` command.)
pt_pt: (Note que o preenchimento só ocorre realmente quando dá o comando ``end_fill()``.)
sv: (Observera att fyllning faktiskt bara sker när du ger kommandot ``end_fill()``)

source: How to...
pt_pt: Como...
sv: Hur man...

source: This section covers some typical turtle use-cases and approaches.
pt_pt: Esta secção abrange alguns casos de uso típicos da tartaruga e abordagens.
sv: I detta avsnitt beskrivs några typiska användningsområden och tillvägagångssätt för Turtle.

source: Get started as quickly as possible
pt_pt: Começar o mais rapidamente possível
sv: Kom igång så snabbt som möjligt

source: One of the joys of turtle graphics is the immediate, visual feedback that's available from simple commands - it's an excellent way to introduce children to programming ideas, with a minimum of overhead (not just children, of course).
pt_pt: Uma das alegrias dos gráficos de tartaruga é o feedback imediato e visual que está disponível a partir de comandos simples - é uma excelente forma de introduzir crianças a conceitos de programação, com um mínimo de sobrecarga (não só crianças, claro).
sv: Ett av glädjeämnena med sköldpaddsgrafik är den omedelbara, visuella återkopplingen som är tillgänglig från enkla kommandon - det är ett utmärkt sätt att introducera barn till programmeringsidéer, med ett minimum av overhead (inte bara barn, naturligtvis).

source: The turtle module makes this possible by exposing all its basic functionality as functions, available with ``from turtle import *``. The :ref:`turtle graphics tutorial <turtle-tutorial>` covers this approach.
pt_pt: O módulo turtle torna isto possível ao expor toda a sua funcionalidade básica como funções, disponíveis com ``from turtle import *``. O :ref:`tutorial de gráficos de tartaruga <turtle-tutorial>` aborda esta abordagem.
sv: Modulen turtle gör detta möjligt genom att exponera alla dess grundläggande funktioner som funktioner, tillgängliga med ``from turtle import *``. I :ref:`turtle graphics tutorial <turtle-tutorial>` beskrivs detta tillvägagångssätt.

source: It's worth noting that many of the turtle commands also have even more terse equivalents, such as ``fd()`` for :func:`forward`. These are especially useful when working with learners for whom typing is not a skill.
pt_pt: Vale a pena notar que muitos dos comandos da tartaruga também têm equivalentes ainda mais concisos, como ``fd()`` para :func:`forward`. Estes são especialmente úteis ao trabalhar com aprendizes para quem digitar não é uma competência.
sv: Det är värt att notera att många av turtle-kommandona också har ännu mer kortfattade motsvarigheter, t.ex. ``fd()`` för :func:`forward`. Dessa är särskilt användbara när man arbetar med elever som inte är vana att skriva.

source: You'll need to have the :mod:`Tk interface package <tkinter>` installed on your system for turtle graphics to work. Be warned that this is not always straightforward, so check this in advance if you're planning to use turtle graphics with a learner.
pt_pt: Precisará de ter o pacote de interface :mod:`Tk <tkinter>` instalado no seu sistema para que os gráficos de tartaruga funcionem. Tenha em atenção que isto nem sempre é simples, por isso verifique isto antecipadamente se planeia usar gráficos de tartaruga com um aprendiz.
sv: Du måste ha :mod:`Tk-gränssnittspaketet <tkinter>` installerat på ditt system för att turtle graphics ska fungera. Observera att detta inte alltid är helt enkelt, så kontrollera detta i förväg om du planerar att använda turtle graphics med en elev.

source: Use the ``turtle`` module namespace
pt_pt: Usar o espaço de nomes do módulo ``turtle``
sv: Använd namnrymden för modulen ``turtle``

source: Using ``from turtle import *`` is convenient - but be warned that it imports a rather large collection of objects, and if you're doing anything but turtle graphics you run the risk of a name conflict (this becomes even more an issue if you're using turtle graphics in a script where other modules might be imported).
pt_pt: Usar ``from turtle import *`` é conveniente - mas tenha em atenção que importa uma coleção bastante grande de objetos, e se estiver a fazer algo que não seja gráficos de tartaruga, corre o risco de um conflito de nomes (isto torna-se ainda mais um problema se estiver a usar gráficos de tartaruga num script onde outros módulos possam ser importados).
sv: Att använda ``from turtle import *`` är bekvämt - men varning för att det importerar en ganska stor samling objekt, och om du gör något annat än turtle graphics riskerar du en namnkonflikt (detta blir ett ännu större problem om du använder turtle graphics i ett skript där andra moduler kan importeras).

source: The solution is to use ``import turtle`` - ``fd()`` becomes ``turtle.fd()``, ``width()`` becomes ``turtle.width()`` and so on. (If typing "turtle" over and over again becomes tedious, use for example ``import turtle as t`` instead.)
pt_pt: A solução é usar ``import turtle`` - ``fd()`` torna-se ``turtle.fd()``, ``width()`` torna-se ``turtle.width()`` e assim por diante. (Se escrever "turtle" repetidamente se tornar tedioso, use, por exemplo, ``import turtle as t``.)
sv: Lösningen är att använda ``import turtle`` - ``fd()`` blir ``turtle.fd()``, ``width()`` blir ``turtle.width()`` och så vidare. (Om det blir tråkigt att skriva "turtle" om och om igen, använd till exempel ``import turtle as t`` istället)

source: Use turtle graphics in a script
pt_pt: Usar gráficos de tartaruga num script
sv: Använda turtle graphics i ett manus

source: It's recommended to use the ``turtle`` module namespace as described immediately above, for example::
pt_pt: É recomendado usar o espaço de nomes do módulo ``turtle`` como descrito acima, por exemplo:
sv: Vi rekommenderar att du använder modulen ``turtle`` namespace enligt beskrivningen ovan, till exempel::

source: Another step is also required though - as soon as the script ends, Python will also close the turtle's window. Add::
pt_pt: Outro passo também é necessário - assim que o script termina, o Python também fecha a janela da tartaruga. Adicione:
sv: Ett annat steg krävs dock också - så snart skriptet avslutas kommer Python också att stänga sköldpaddans fönster. Lägg till::

source: to the end of the script. The script will now wait to be dismissed and will not exit until it is terminated, for example by closing the turtle graphics window.
pt_pt: no final do script. O script agora aguardará para ser encerrado e não terminará até ser finalizado, por exemplo, fechando a janela de gráficos da tartaruga.
sv: till slutet av skriptet. Skriptet väntar nu på att bli avfärdat och avslutas inte förrän det avslutas, t.ex. genom att stänga sköldpaddans grafikfönster.

source: Use object-oriented turtle graphics
pt_pt: Usar gráficos de tartaruga orientados a objetos
sv: Använd objektorienterad grafik för sköldpaddor

source: :ref:`Explanation of the object-oriented interface <turtle-explanation>`
pt_pt: :ref:`Explicação da interface orientada a objetos <turtle-explanation>`
sv: :ref:`Förklaring av det objektorienterade gränssnittet <turtle-explanation>`

source: Other than for very basic introductory purposes, or for trying things out as quickly as possible, it's more usual and much more powerful to use the object-oriented approach to turtle graphics. For example, this allows multiple turtles on screen at once.
pt_pt: Além de propósitos introdutórios muito básicos, ou para experimentar coisas o mais rapidamente possível, é mais usual e muito mais poderoso usar a abordagem orientada a objetos para gráficos de tartaruga. Por exemplo, isto permite várias tartarugas no ecrã ao mesmo tempo.
sv: Förutom för mycket grundläggande introduktionsändamål, eller för att prova saker så snabbt som möjligt, är det vanligare och mycket mer kraftfullt att använda den objektorienterade metoden för sköldpaddsgrafik. Till exempel tillåter detta flera sköldpaddor på skärmen samtidigt.

source: In this approach, the various turtle commands are methods of objects (mostly of ``Turtle`` objects). You *can* use the object-oriented approach in the shell, but it would be more typical in a Python script.
pt_pt: Nesta abordagem, os vários comandos da tartaruga são métodos de objetos (principalmente de objetos ``Turtle``). *Pode* usar a abordagem orientada a objetos no shell, mas seria mais típico num script Python.
sv: I detta tillvägagångssätt är de olika turtle-kommandona metoder för objekt (oftast för ``Turtle``\ -objekt). Du *kan* använda det objektorienterade tillvägagångssättet i skalet, men det skulle vara mer typiskt i ett Python-skript.

source: The example above then becomes::
pt_pt: O exemplo acima torna-se:
sv: Exemplet ovan blir då::

source: from turtle import Turtle from random import random t = Turtle() for i in range(100): steps = int(random() * 100) angle = int(random() * 360) t.right(angle) t.fd(steps) t.screen.mainloop()
sv: from turtle import Sköldpadda from random import slumpmässigt t = Sköldpadda() för i i intervallet(100): steg = int(slumpmässig() * 100) vinkel = int(slumpmässig() * 360) t.höger(vinkel) t.fd(steg) t.screen.mainloop()

source: Note the last line. ``t.screen`` is an instance of the :class:`Screen` that a Turtle instance exists on; it's created automatically along with the turtle.
pt_pt: Note a última linha. ``t.screen`` é uma instância de :class:`Screen` na qual uma instância de Turtle existe; é criada automaticamente juntamente com a tartaruga.
sv: Notera den sista raden. ``t.screen`` är en instans av :class:`Screen` som en sköldpaddsinstans finns på; den skapas automatiskt tillsammans med sköldpaddan.

source: The turtle's screen can be customised, for example::
pt_pt: O ecrã da tartaruga pode ser personalizado, por exemplo:
sv: Sköldpaddans skärm kan skräddarsys, till exempel::

source: t.screen.title('Object-oriented turtle demo') t.screen.bgcolor("orange")
pt_pt: t.screen.title('Demonstração de tartaruga orientada a objetos') t.screen.bgcolor("orange")
sv: t.screen.title("Objektorienterad sköldpaddsdemo") t.screen.bgcolor("orange")

source: Turtle graphics reference
pt_pt: Referência de gráficos de tartaruga
sv: Sköldpaddans grafikreferens

source: In the following documentation the argument list for functions is given. Methods, of course, have the additional first argument *self* which is omitted here.
pt_pt: Na documentação seguinte, é dada a lista de argumentos para funções. Os métodos, claro, têm o argumento adicional *self* que é omitido aqui.
sv: I den följande dokumentationen anges argumentlistan för funktioner. Metoder har naturligtvis det ytterligare första argumentet *self* som utelämnas här.

source: Turtle methods
pt_pt: Métodos de Turtle
sv: Sköldpaddans metoder

source: Turtle motion
pt_pt: Movimento da tartaruga
sv: Sköldpaddans rörelse

source: Move and draw
pt_pt: Mover e desenhar
sv: Flytta och rita

source: :func:`left` | :func:`lt`
sv: :func:`vänster` | :func:`lt`

source: :func:`home`
sv: :func:`hem`

source: :func:`circle`
sv: :func:`cirkel`

source: :func:`stamp`
sv: :func:`stämpel`

source: :func:`clearstamps`
sv: :func:`klara stämplar`

source: :func:`speed`
sv: :func:`hastighet`

source: Tell Turtle's state
pt_pt: Indicar o estado da tartaruga
sv: Berätta Turtle's tillstånd

source: :func:`heading`
sv: :func:`rubrik`

source: :func:`distance`
sv: :func:`avstånd`

source: Setting and measurement
pt_pt: Definição e medição
sv: Inställning och mätning

source: :func:`degrees`
sv: :func:`grader`

source: :func:`radians`
sv: :func:`radianer`

source: Drawing state
pt_pt: Estado de desenho
sv: Ritningstillstånd

source: :func:`pensize` | :func:`width`
sv: :func:`penstorlek` | :func:`bredd`

source: Color control
pt_pt: Controlo de cor
sv: Färgkontroll

source: :func:`color`
sv: :func:`färg`

source: :func:`pencolor`
sv: :func:`pennafärg`

source: Filling
pt_pt: Preenchimento
sv: Fyllning

source: :func:`filling`
sv: :func:`fyllning`

source: :func:`end_fill`
sv: :func:`sluta_fyllning`

source: More drawing control
pt_pt: Mais controlo de desenho
sv: Mer ritningskontroll

source: :func:`reset`
sv: :func:`återställ`

source: :func:`write`
sv: :func:`skriva`

source: Turtle state
pt_pt: Estado da tartaruga
sv: Sköldpaddans tillstånd

source: Visibility
pt_pt: Visibilidade
sv: Synlighet
