Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: pt_pt, sv

source: Set pencolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
pt_pt: Define a cor da caneta para a cor RGB representada pelo tuplo de *r*, *g*, e *b*. Cada um de *r*, *g*, e *b* deve estar no intervalo 0..colormode, onde colormode é 1.0 ou 255 (consulte :func:`colormode`).
sv: Ställ in pencolor till RGB-färgen som representeras av tupeln *r*, *g* och *b*. Var och en av *r*, *g* och *b* måste ligga i intervallet 0..colormode, där colormode är antingen 1.0 eller 255 (se :func:`colormode`).

source: ``pencolor(r, g, b)``
sv: ``pennafärg(r, g, b)``

source: Set pencolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
pt_pt: Define a cor da caneta para a cor RGB representada por *r*, *g*, e *b*. Cada um de *r*, *g*, e *b* deve estar no intervalo 0..colormode.
sv: Ställ in pencolor till den RGB-färg som representeras av *r*, *g* och *b*. Var och en av *r*, *g* och *b* måste ligga i intervallet 0..colormode.

source: If turtleshape is a polygon, the outline of that polygon is drawn with the newly set pencolor.
pt_pt: Se a forma da tartaruga for um polígono, o contorno desse polígono é desenhado com a nova cor da caneta definida.
sv: Om turtleshape är en polygon ritas polygonens kontur med den nyinställda pennfärgen.

source: Return or set the fillcolor.
pt_pt: Retorna ou define a cor de preenchimento.
sv: Returnera eller ställ in fyllnadsfärgen.

source: ``fillcolor(colorstring)``
sv: ``fillcolor(färgsträng)``

source: Set fillcolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
pt_pt: Define a cor de preenchimento para *colorstring*, que é uma *string* de especificação de cor Tk, como ``"red"``, ``"yellow"``, ou ``"#33cc8c"``.
sv: Ställ in fillcolor till *colorstring*, som är en Tk-färgspecifikationssträng, till exempel ``"red"``, ``"yellow"`` eller ``"#33cc8c"``.

source: Set fillcolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
pt_pt: Define a cor de preenchimento para a cor RGB representada pelo tuplo de *r*, *g*, e *b*. Cada um de *r*, *g*, e *b* deve estar no intervalo 0..colormode, onde colormode é 1.0 ou 255 (consulte :func:`colormode`).
sv: Ställ in fillcolor på den RGB-färg som representeras av tupeln *r*, *g* och *b*. Var och en av *r*, *g* och *b* måste ligga i intervallet 0..colormode, där colormode är antingen 1,0 eller 255 (se :func:`colormode`).

source: Set fillcolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
pt_pt: Define a cor de preenchimento para a cor RGB representada por *r*, *g*, e *b*. Cada um de *r*, *g*, e *b* deve estar no intervalo 0..colormode.
sv: Ställ in fillcolor till den RGB-färg som representeras av *r*, *g* och *b*. Var och en av *r*, *g* och *b* måste ligga i intervallet 0..colormode.

source: If turtleshape is a polygon, the interior of that polygon is drawn with the newly set fillcolor.
pt_pt: Se a forma da tartaruga for um polígono, o interior desse polígono é desenhado com a nova cor de preenchimento definida.
sv: Om turtleshape är en polygon ritas polygonens inre med den nyinställda fillcolor.

source: Return or set pencolor and fillcolor.
pt_pt: Retorna ou define a cor da caneta e a cor de preenchimento.
sv: Returnera eller ställ in pencolor och fillcolor.

source: Several input formats are allowed. They use 0 to 3 arguments as follows:
pt_pt: Vários formatos de entrada são permitidos. Usam 0 a 3 argumentos da seguinte forma:
sv: Flera inmatningsformat är tillåtna. De använder 0 till 3 argument enligt följande:

source: Return the current pencolor and the current fillcolor as a pair of color specification strings or tuples as returned by :func:`pencolor` and :func:`fillcolor`.
pt_pt: Retorna a cor atual da caneta e a cor atual de preenchimento como um par de *strings* ou tuplos de especificação de cor, como retornado por :func:`pencolor` e :func:`fillcolor`.
sv: Returnerar aktuell pencolor och aktuell fillcolor som ett par färgspecifikationssträngar eller -tupler som returneras av :func:`pencolor` och :func:`fillcolor`.

source: ``color(colorstring)``, ``color((r,g,b))``, ``color(r,g,b)``
sv: ``färg(färgsträng)``, ``färg((r,g,b)))``, ``färg(r,g,b)``

source: Inputs as in :func:`pencolor`, set both, fillcolor and pencolor, to the given value.
pt_pt: Entradas como em :func:`pencolor`, define ambas, fillcolor e pencolor, para o valor dado.
sv: Ingångar som i :func:`pencolor`, sätter båda, fillcolor och pencolor, till det angivna värdet.

source: ``color(colorstring1, colorstring2)``, ``color((r1,g1,b1), (r2,g2,b2))``
sv: ``färg(färgsträng1, färgsträng2)``, ``färg((r1,g1,b1), (r2,g2,b2))``

source: Equivalent to ``pencolor(colorstring1)`` and ``fillcolor(colorstring2)`` and analogously if the other input format is used.
pt_pt: Equivalente a ``pencolor(colorstring1)`` e ``fillcolor(colorstring2)`` e analogamente se o outro formato de entrada for usado.
sv: Motsvarar ``pencolor(colorstring1)`` och ``fillcolor(colorstring2)`` och analogt om det andra inmatningsformatet används.

source: If turtleshape is a polygon, outline and interior of that polygon is drawn with the newly set colors.
pt_pt: Se a forma da tartaruga for um polígono, o contorno e o interior desse polígono são desenhados com as novas cores definidas.
sv: Om turtleshape är en polygon ritas polygonens kontur och insida med de nyinställda färgerna.

source: See also: Screen method :func:`colormode`.
pt_pt: Consulte também: Método de Ecrã :func:`colormode`.
sv: Se även följande: Skärmmetod :func:`colormode`.

source: Return fillstate (``True`` if filling, ``False`` else).
pt_pt: Retorna o estado de preenchimento (``True`` se estiver a preencher, ``False`` caso contrário).
sv: Returnerar fyllningsstatus (``True`` om fyllning, ``False`` annars).

source: To be called just before drawing a shape to be filled.
pt_pt: Deve ser chamado imediatamente antes de desenhar uma forma a ser preenchida.
sv: Anropas precis innan du ritar en form som ska fyllas.

source: Fill the shape drawn after the last call to :func:`begin_fill`.
pt_pt: Preenche a forma desenhada após a última chamada a :func:`begin_fill`.
sv: Fyller den form som ritades efter det senaste anropet till :func:`begin_fill`.

source: Whether or not overlap regions for self-intersecting polygons or multiple shapes are filled depends on the operating system graphics, type of overlap, and number of overlaps. For example, the Turtle star above may be either all yellow or have some white regions.
pt_pt: Se as regiões de sobreposição para polígonos auto-intersetantes ou múltiplas formas são preenchidas ou não depende da gráfica do sistema operativo, tipo de sobreposição e número de sobreposições. Por exemplo, a estrela da Turtle acima pode ser toda amarela ou ter algumas regiões brancas.
sv: Huruvida överlappningsregioner för självskärande polygoner eller flera former fylls beror på operativsystemets grafik, typ av överlappning och antal överlappningar. Sköldpaddsstjärnan ovan kan till exempel antingen vara helt gul eller ha några vita områden.

source: Delete the turtle's drawings from the screen, re-center the turtle and set variables to the default values.
sv: Ta bort sköldpaddans teckningar från skärmen, centrera om sköldpaddan och sätt variablerna till standardvärdena.

source: Delete the turtle's drawings from the screen. Do not move turtle. State and position of the turtle as well as drawings of other turtles are not affected.
pt_pt: Apaga os desenhos da tartaruga do ecrã. Não move a tartaruga. O estado e a posição da tartaruga, bem como os desenhos de outras tartarugas, não são afetados.
sv: Ta bort sköldpaddans teckningar från skärmen. Flytta inte sköldpaddan. Sköldpaddans tillstånd och position samt andra sköldpaddors teckningar påverkas inte.

source: object to be written to the TurtleScreen
pt_pt: objeto a ser escrito no TurtleScreen
sv: objekt som ska skrivas till TurtleScreen

source: True/False
pt_pt: Verdadeiro/Falso
sv: Sant/falskt

source: one of the strings "left", "center" or right"
pt_pt: uma das *strings* "esquerda", "centro" ou "direita"
sv: en av strängarna "left", "center" eller right"

source: a triple (fontname, fontsize, fonttype)
pt_pt: um triplo (nome_fonte, tamanho_fonte, tipo_fonte)
sv: en trippel (fontnamn, fontstorlek, fonttyp)

source: Write text - the string representation of *arg* - at the current turtle position according to *align* ("left", "center" or "right") and with the given font. If *move* is true, the pen is moved to the bottom-right corner of the text. By default, *move* is ``False``.
pt_pt: Escreve texto - a representação em *string* de *arg* - na posição atual da tartaruga de acordo com *align* ("esquerda", "centro" ou "direita") e com a fonte dada. Se *move* for verdadeiro, a caneta é movida para o canto inferior direito do texto. Por predefinição, *move* é ``False``.
sv: Skriv text - strängrepresentationen av *arg* - vid den aktuella sköldpaddspositionen enligt *align* ("left", "center" eller "right") och med det angivna teckensnittet. Om *move* är true flyttas pennan till det nedre högra hörnet av texten. Som standard är *move* ``False``.

source: Make the turtle invisible. It's a good idea to do this while you're in the middle of doing some complex drawing, because hiding the turtle speeds up the drawing observably.
pt_pt: Torna a tartaruga invisível. É uma boa ideia fazê-lo enquanto estiver a fazer algum desenho complexo, porque esconder a tartaruga acelera visivelmente o desenho.
sv: Gör sköldpaddan osynlig. Det är en bra idé att göra detta medan du är mitt uppe i en komplicerad ritning, eftersom det går betydligt snabbare att rita om du döljer sköldpaddan.

source: Make the turtle visible.
pt_pt: Torna a tartaruga visível.
sv: Gör sköldpaddan synlig.

source: Return ``True`` if the Turtle is shown, ``False`` if it's hidden.
pt_pt: Retorna ``True`` se a tartaruga estiver visível, ``False`` se estiver escondida.
sv: Returnerar ``True`` om sköldpaddan visas, ``False`` om den är dold.

source: a string which is a valid shapename
pt_pt: uma *string* que é um nome de forma válido
sv: en sträng som är ett giltigt shapenamn

source: Set turtle shape to shape with given *name* or, if name is not given, return name of current shape. Shape with *name* must exist in the TurtleScreen's shape dictionary. Initially there are the following polygon shapes: "arrow", "turtle", "circle", "square", "triangle", "classic". To learn about how to deal with shapes see Screen method :func:`register_shape`.
pt_pt: Define a forma da tartaruga para a forma com o *nome* dado ou, se o nome não for dado, retorna o nome da forma atual. A forma com *nome* deve existir no dicionário de formas do TurtleScreen. Inicialmente, existem as seguintes formas poligonais: "arrow", "turtle", "circle", "square", "triangle", "classic". Para aprender como lidar com formas, consulte o método de Ecrã :func:`register_shape`.
sv: Ställ in sköldpaddans form till formen med angivet *namn* eller, om namn inte anges, returnera namnet på aktuell form. Formen med *namn* måste finnas i TurtleScreens formordbok. Initialt finns följande polygonformer: "arrow", "turtle", "circle", "square", "triangle", "classic". För att lära dig mer om hur man hanterar former, se skärmmetoden :func:`register_shape`.

source: one of the strings "auto", "user", "noresize"
pt_pt: uma das *strings* "auto", "utilizador", "sem_redimensionar"
sv: en av strängarna "auto", "user", "noresize"

source: Set resizemode to one of the values: "auto", "user", "noresize". If *rmode* is not given, return current resizemode. Different resizemodes have the following effects:
pt_pt: Define o modo de redimensionamento para um dos valores: "auto", "utilizador", "sem_redimensionar". Se *rmode* não for dado, retorna o modo de redimensionamento atual. Diferentes modos de redimensionamento têm os seguintes efeitos:
sv: Ställ in resizemode till ett av värdena: "auto", "user", "noresize". Om *rmode* inte anges returneras aktuellt resizemode. Olika resizemodes har följande effekter:

source: "auto": adapts the appearance of the turtle corresponding to the value of pensize.
pt_pt: "auto": adapta a aparência da tartaruga de acordo com o valor de pensize.
sv: "auto": anpassar sköldpaddans utseende motsvarande värdet för pennstorlek.

source: "user": adapts the appearance of the turtle according to the values of stretchfactor and outlinewidth (outline), which are set by :func:`shapesize`.
pt_pt: "utilizador": adapta a aparência da tartaruga de acordo com os valores de stretchfactor e outlinewidth (contorno), que são definidos por :func:`shapesize`.
sv: "user": anpassar sköldpaddans utseende enligt värdena för stretchfactor och outlinewidth (outline), som ställs in av :func:`shapesize`.

source: "noresize": no adaption of the turtle's appearance takes place.
pt_pt: "sem_redimensionar": não ocorre nenhuma adaptação da aparência da tartaruga.
sv: "noresize": ingen anpassning av sköldpaddans utseende sker.

source: ``resizemode("user")`` is called by :func:`shapesize` when used with arguments.
pt_pt: ``resizemode("user")`` é chamado por :func:`shapesize` quando usado com argumentos.
sv: ``resizemode("user")`` anropas av :func:`shapesize` när den används med argument.

source: positive number
pt_pt: número positivo
sv: positivt tal

source: Return or set the pen's attributes x/y-stretchfactors and/or outline. Set resizemode to "user". If and only if resizemode is set to "user", the turtle will be displayed stretched according to its stretchfactors: *stretch_wid* is stretchfactor perpendicular to its orientation, *stretch_len* is stretchfactor in direction of its orientation, *outline* determines the width of the shape's outline.
pt_pt: Retorna ou define os atributos da caneta x/y-stretchfactors e/ou outline. Define resizemode para "utilizador". Se e somente se resizemode estiver definido para "utilizador", a tartaruga será exibida esticada de acordo com os seus stretchfactors: *stretch_wid* é o stretchfactor perpendicular à sua orientação, *stretch_len* é o stretchfactor na direção da sua orientação, *outline* determina a largura do contorno da forma.
sv: Returnera eller ställ in pennans attribut x/y-stretchfactors och/eller outline. Ställ in resizemode till "user". Om och endast om resizemode är satt till "user", kommer sköldpaddan att visas utsträckt enligt dess stretchfaktorer: *stretch_wid* är stretchfaktorn vinkelrätt mot dess orientering, *stretch_len* är stretchfaktorn i riktning mot dess orientering, *outline* bestämmer bredden på formens kontur.

source: number (optional)
pt_pt: número (opcional)
sv: nummer (valfritt)

source: Set or return the current shearfactor. Shear the turtleshape according to the given shearfactor shear, which is the tangent of the shear angle. Do *not* change the turtle's heading (direction of movement). If shear is not given: return the current shearfactor, i. e. the tangent of the shear angle, by which lines parallel to the heading of the turtle are sheared.
pt_pt: Define ou retorna o fator de cisalhamento atual. Cisalha a forma da tartaruga de acordo com o shearfactor dado, que é a tangente do ângulo de cisalhamento. Não altera a orientação da tartaruga (direção de movimento). Se shear não for dado: retorna o shearfactor atual, ou seja, a tangente do ângulo de cisalhamento, pelo qual as linhas paralelas à orientação da tartaruga são cisalhadas.
sv: Ställ in eller returnera aktuell shearfaktor. Skjuter sköldpaddsformen enligt den angivna skjuvfaktorn shear, som är tangenten till skjuvvinkeln. Ändra *inte* sköldpaddans kurs (rörelseriktning). Om shear inte anges: returnerar den aktuella shearfaktorn, dvs. tangenten till shearvinkeln, med vilken linjer parallella med sköldpaddans riktning klipps.

source: Rotate the turtleshape by *angle* from its current tilt-angle, but do *not* change the turtle's heading (direction of movement).
pt_pt: Rodar a forma da tartaruga por *angle* a partir do seu ângulo de inclinação atual, mas não alterar a orientação da tartaruga (direção de movimento).
sv: Rotera sköldpaddsfiguren med *vinkel* från dess aktuella lutningsvinkel, men ändra *inte* sköldpaddans riktning (rörelseriktning).

source: a number (optional)
pt_pt: um número (opcional)
sv: ett nummer (valfritt)

source: Set or return the current tilt-angle. If angle is given, rotate the turtleshape to point in the direction specified by angle, regardless of its current tilt-angle. Do *not* change the turtle's heading (direction of movement). If angle is not given: return the current tilt-angle, i. e. the angle between the orientation of the turtleshape and the heading of the turtle (its direction of movement).
pt_pt: Define ou retorna o ângulo de inclinação atual. Se o ângulo for dado, roda a forma da tartaruga para apontar na direção especificada pelo ângulo, independentemente do seu ângulo de inclinação atual. Não altere a orientação da tartaruga (direção de movimento). Se o ângulo não for dado: retorna o ângulo de inclinação atual, ou seja, o ângulo entre a orientação da forma da tartaruga e a orientação da tartaruga (sua direção de movimento).
sv: Ställ in eller returnera den aktuella tilt-vinkeln. Om vinkel anges, roterar sköldpaddsformen så att den pekar i den riktning som anges av vinkel, oavsett dess aktuella tilt-vinkel. Ändra *inte* sköldpaddans kurs (rörelseriktning). Om angle inte anges: returnera den aktuella tilt-vinkeln, dvs. vinkeln mellan sköldpaddsformens orientering och sköldpaddans riktning (dess rörelseriktning).

source: Set or return the current transformation matrix of the turtle shape.
pt_pt: Define ou retorna a matriz de transformação atual da forma da tartaruga.
sv: Ställ in eller returnera den aktuella transformationsmatrisen för sköldpaddsformen.

source: If none of the matrix elements are given, return the transformation matrix as a tuple of 4 elements. Otherwise set the given elements and transform the turtleshape according to the matrix consisting of first row t11, t12 and second row t21, t22. The determinant t11 * t22 - t12 * t21 must not be zero, otherwise an error is raised. Modify stretchfactor, shearfactor and tiltangle according to the given matrix.
pt_pt: Se nenhum dos elementos da matriz for dado, retorna a matriz de transformação como um tuplo de 4 elementos. Caso contrário, define os elementos dados e transforma a forma da tartaruga de acordo com a matriz composta pela primeira linha t11, t12 e segunda linha t21, t22. O determinante t11 * t22 - t12 * t21 não deve ser zero, caso contrário é gerado um erro. Modifica stretchfactor, shearfactor e tiltangle de acordo com a matriz dada.
sv: Om inget av matriselementen anges, returneras transformationsmatrisen som en tupel med 4 element. I annat fall anges de angivna elementen och sköldpaddsformen transformeras enligt matrisen som består av första raden t11, t12 och andra raden t21, t22. Determinanten t11 * t22 - t12 * t21 får inte vara noll, annars uppstår ett fel. Modifiera stretchfactor, shearfactor och tiltangle enligt den givna matrisen.

source: Return the current shape polygon as tuple of coordinate pairs. This can be used to define a new shape or components of a compound shape.
pt_pt: Retorna o polígono da forma atual como um tuplo de pares de coordenadas. Isto pode ser usado para definir uma nova forma ou componentes de uma forma composta.
sv: Returnerar den aktuella formpolygonen som en tupel av koordinatpar. Detta kan användas för att definiera en ny form eller komponenter i en sammansatt form.

source: a function with two arguments which will be called with the coordinates of the clicked point on the canvas
pt_pt: uma função com dois argumentos que será chamada com as coordenadas do ponto clicado no canvas
sv: en funktion med två argument som kommer att anropas med koordinaterna för den klickade punkten på duken

source: number of the mouse-button, defaults to 1 (left mouse button)
pt_pt: número do botão do rato, por predefinição 1 (botão esquerdo do rato)
sv: musknappens nummer, standardvärde 1 (vänster musknapp)

source: ``True`` or ``False`` -- if ``True``, a new binding will be added, otherwise it will replace a former binding
pt_pt: ``True`` ou ``False`` -- se ``True``, uma nova ligação será adicionada, caso contrário substituirá uma ligação anterior
sv: ``True`` eller ``False`` -- om ``True``, läggs en ny bindning till, annars ersätter den en tidigare bindning

source: Bind *fun* to mouse-click events on this turtle. If *fun* is ``None``, existing bindings are removed. Example for the anonymous turtle, i.e. the procedural way:
pt_pt: Liga *fun* a eventos de clique do rato nesta tartaruga. Se *fun* for ``None``, as ligações existentes são removidas. Exemplo para a tartaruga anónima, ou seja, de forma processual:
sv: Bind *fun* till musklickhändelser på denna sköldpadda. Om *fun* är ``None`` tas befintliga bindningar bort. Exempel för den anonyma sköldpaddan, dvs. det procedurmässiga sättet:

source: Bind *fun* to mouse-button-release events on this turtle. If *fun* is ``None``, existing bindings are removed.
pt_pt: Liga *fun* a eventos de libertação do botão do rato nesta tartaruga. Se *fun* for ``None``, as ligações existentes são removidas.
sv: Bind *fun* till händelser där musknappen släpps på den här sköldpaddan. Om *fun* är ``None`` tas befintliga bindningar bort.

source: Bind *fun* to mouse-move events on this turtle. If *fun* is ``None``, existing bindings are removed.
pt_pt: Liga *fun* a eventos de movimento do rato nesta tartaruga. Se *fun* for ``None``, as ligações existentes são removidas.
sv: Bind *fun* till musförflyttningshändelser på denna sköldpadda. Om *fun* är ``None`` tas befintliga bindningar bort.

source: Remark: Every sequence of mouse-move-events on a turtle is preceded by a mouse-click event on that turtle.
pt_pt: Nota: Cada sequência de eventos de movimento do rato numa tartaruga é precedida por um evento de clique do rato nessa tartaruga.
sv: Anmärkning: Varje sekvens av musrörelsehändelser på en sköldpadda föregås av en musklickhändelse på samma sköldpadda.

source: Subsequently, clicking and dragging the Turtle will move it across the screen thereby producing handdrawings (if pen is down).
pt_pt: Posteriormente, clicar e arrastar a tartaruga moverá a tartaruga pelo ecrã, produzindo assim desenhos à mão (se a caneta estiver baixa).
sv: Om du sedan klickar och drar sköldpaddan flyttas den över skärmen, vilket ger handritningar (om pennan är nedtryckt).

source: Start recording the vertices of a polygon. Current turtle position is first vertex of polygon.
pt_pt: Inicia o registo dos vértices de um polígono. A posição atual da tartaruga é o primeiro vértice do polígono.
sv: Börja registrera hörnen i en polygon. Sköldpaddans nuvarande position är polygonens första toppunkt.

source: Stop recording the vertices of a polygon. Current turtle position is last vertex of polygon. This will be connected with the first vertex.
pt_pt: Para o registo dos vértices de um polígono. A posição atual da tartaruga é o último vértice do polígono. Este será conectado com o primeiro vértice.
sv: Sluta registrera hörnen i en polygon. Sköldpaddans nuvarande position är polygonens sista toppunkt. Detta kommer att anslutas till det första toppunktet.

source: Return the last recorded polygon.
pt_pt: Retorna o último polígono registado.
sv: Returnerar den senast registrerade polygonen.
