Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: pt_pt, sv

source: Appearance
pt_pt: Aparência
sv: Utseende

source: :func:`shape`
sv: :func:`form`

source: :func:`tiltangle`
sv: :func:`tiltangel`

source: Using events
pt_pt: Usar eventos
sv: Använda händelser

source: Special Turtle methods
pt_pt: Métodos especiais de Turtle
sv: Särskilda Turtle-metoder

source: :func:`end_poly`
sv: :func:`sluta_poly`

source: :func:`clone`
sv: :func:`klon`

source: :func:`getscreen`
sv: :func:`getskärm`

source: Methods of TurtleScreen/Screen
pt_pt: Métodos de TurtleScreen/Ecrã
sv: Metoder för TurtleScreen/Screen

source: Window control
pt_pt: Controlo de janela
sv: Kontroll av fönster

source: :func:`resetscreen`
sv: :func:`återställ skärm`

source: :func:`screensize`
sv: :func:`skärmstorlek`

source: Animation control
pt_pt: Controlo de animação
sv: Kontroll av animering

source: :func:`delay`
sv: :func:`fördröjning`

source: :func:`tracer`
sv: :func:`spårare`

source: :func:`update`
sv: :func:`uppdatera`

source: Using screen events
pt_pt: Usar eventos de ecrã
sv: Använda skärmhändelser

source: :func:`listen`
sv: :func:`lyssna`

source: Settings and special methods
pt_pt: Definições e métodos especiais
sv: Inställningar och specialmetoder

source: :func:`colormode`
sv: :func:`kolorläge`

source: :func:`turtles`
sv: :func:`sköldpaddor`

source: :func:`window_height`
sv: :func:`fönster_höjd`

source: :func:`window_width`
sv: :func:`fönsterbredd`

source: Input methods
pt_pt: Métodos de entrada
sv: Inmatningsmetoder

source: :func:`textinput`
sv: :func:`textinmatning`

source: Methods specific to Screen
pt_pt: Métodos específicos de Ecrã
sv: Metoder som är specifika för Screen

source: :func:`bye`
sv: :func:`hejdå`

source: :func:`title`
sv: :func:`titel`

source: Methods of RawTurtle/Turtle and corresponding functions
pt_pt: Métodos de RawTurtle/Turtle e funções correspondentes
sv: Metoder för RawTurtle/Turtle och motsvarande funktioner

source: Most of the examples in this section refer to a Turtle instance called ``turtle``.
pt_pt: A maioria dos exemplos nesta secção referem-se a uma instância de Turtle chamada ``turtle``.
sv: De flesta av exemplen i detta avsnitt hänvisar till en Turtle-instans som heter ``turtle``.

source: Parameters
pt_pt: Parâmetros
sv: Parametrar

source: a number (integer or float)
pt_pt: um número (inteiro ou float)
sv: ett tal (heltal eller float)

source: Move the turtle forward by the specified *distance*, in the direction the turtle is headed.
pt_pt: Move a tartaruga em frente pela *distância* especificada, na direção para a qual a tartaruga está virada.
sv: Flytta sköldpaddan framåt med det angivna *avståndet*, i den riktning som sköldpaddan är på väg.

source: a number
pt_pt: um número
sv: ett antal

source: Move the turtle backward by *distance*, opposite to the direction the turtle is headed. Do not change the turtle's heading.
pt_pt: Move a tartaruga para trás pela *distância* especificada, na direção oposta à para a qual a tartaruga está virada. Não altera a orientação da tartaruga.
sv: Flytta sköldpaddan bakåt med *avstånd*, i motsatt riktning mot den riktning som sköldpaddan är på väg mot. Ändra inte sköldpaddans kurs.

source: Turn turtle right by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
pt_pt: Rodar a tartaruga para a direita por *angle* unidades. (As unidades são, por predefinição, graus, mas podem ser definidas através das funções :func:`degrees` e :func:`radians`.) A orientação do ângulo depende do modo da tartaruga, consulte :func:`mode`.
sv: Vrid sköldpaddan åt höger med *vinkel* enheter. (Enheterna är som standard grader, men kan ställas in via funktionerna :func:`degrees` och :func:`radians`) Vinkelorienteringen beror på sköldpaddans läge, se :func:`mode`.

source: Turn turtle left by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
pt_pt: Rodar a tartaruga para a esquerda por *angle* unidades. (As unidades são, por predefinição, graus, mas podem ser definidas através das funções :func:`degrees` e :func:`radians`.) A orientação do ângulo depende do modo da tartaruga, consulte :func:`mode`.
sv: Vrid sköldpaddan åt vänster med *vinkel* enheter. (Enheterna är som standard grader, men kan ställas in via funktionerna :func:`degrees` och :func:`radians`) Vinkelorienteringen beror på sköldpaddans läge, se :func:`mode`.

source: a number or a pair/vector of numbers
pt_pt: um número ou um par/vetor de números
sv: ett tal eller ett par/vektor av tal

source: a number or ``None``
pt_pt: um número ou ``None``
sv: ett tal eller ``None``

source: If *y* is ``None``, *x* must be a pair of coordinates or a :class:`Vec2D` (e.g. as returned by :func:`pos`).
pt_pt: Se *y* for ``None``, *x* deve ser um par de coordenadas ou um :class:`Vec2D` (por exemplo, como retornado por :func:`pos`).
sv: Om *y* är ``None`` måste *x* vara ett koordinatpar eller en :class:`Vec2D` (t.ex. som returneras av :func:`pos`).

source: Move turtle to an absolute position. If the pen is down, draw line. Do not change the turtle's orientation.
pt_pt: Move a tartaruga para uma posição absoluta. Se a caneta estiver baixa, desenha uma linha. Não altera a orientação da tartaruga.
sv: Flytta sköldpaddan till en absolut position. Om pennan är nere, dra en linje. Ändra inte sköldpaddans orientering.

source: a boolean
pt_pt: um booleano
sv: en boolean

source: Move turtle to an absolute position. Unlike goto(x, y), a line will not be drawn. The turtle's orientation does not change. If currently filling, the polygon(s) teleported from will be filled after leaving, and filling will begin again after teleporting. This can be disabled with fill_gap=True, which makes the imaginary line traveled during teleporting act as a fill barrier like in goto(x, y).
pt_pt: Move a tartaruga para uma posição absoluta. Ao contrário de goto(x, y), não será desenhada uma linha. A orientação da tartaruga não muda. Se estiver atualmente a preencher, o(s) polígono(s) dos quais a tartaruga foi teletransportada serão preenchidos após sair, e o preenchimento começará novamente após o teletransporte. Isto pode ser desativado com fill_gap=True, que faz com que a linha imaginária percorrida durante o teletransporte aja como uma barreira de preenchimento, como em goto(x, y).
sv: Flytta sköldpaddan till en absolut position. Till skillnad från goto(x, y) kommer inte en linje att ritas. Sköldpaddans orientering ändras inte. Om polygonen fylls för närvarande kommer polygonen/polygonerna som sköldpaddan teleporteras från att fyllas efter att den lämnat platsen, och fyllningen kommer att börja igen efter teleporteringen. Detta kan inaktiveras med fill_gap=True, vilket gör att den imaginära linje som förflyttas under teleporteringen fungerar som en fyllningsbarriär som i goto(x, y).

source: Set the turtle's first coordinate to *x*, leave second coordinate unchanged.
pt_pt: Define a primeira coordenada da tartaruga para *x*, mantendo a segunda coordenada inalterada.
sv: Sätt sköldpaddans första koordinat till *x*, lämna den andra koordinaten oförändrad.

source: Set the turtle's second coordinate to *y*, leave first coordinate unchanged.
pt_pt: Define a segunda coordenada da tartaruga para *y*, mantendo a primeira coordenada inalterada.
sv: Ställ in sköldpaddans andra koordinat till *y*, lämna den första koordinaten oförändrad.

source: Set the orientation of the turtle to *to_angle*. Here are some common directions in degrees:
pt_pt: Define a orientação da tartaruga para *to_angle*. Aqui estão algumas direções comuns em graus:
sv: Ställ in sköldpaddans orientering till *to_angle*. Här är några vanliga riktningar i grader:

source: standard mode
pt_pt: modo padrão
sv: standardläge

source: logo mode
pt_pt: modo logo
sv: logotypläge

source: 0 - east
pt_pt: 0 - este
sv: 0 - öster

source: 0 - north
pt_pt: 0 - norte
sv: 0 - norr

source: 90 - north
pt_pt: 90 - norte
sv: 90 - norr

source: 90 - east
pt_pt: 90 - este
sv: 90 - öster

source: 180 - west
pt_pt: 180 - oeste
sv: 180 - väster

source: 180 - south
pt_pt: 180 - sul
sv: 180 - söderut

source: 270 - south
pt_pt: 270 - sul
sv: 270 - söderut

source: 270 - west
pt_pt: 270 - oeste
sv: 270 - västerut

source: Move turtle to the origin -- coordinates (0,0) -- and set its heading to its start-orientation (which depends on the mode, see :func:`mode`).
pt_pt: Move a tartaruga para a origem -- coordenadas (0,0) -- e define a sua orientação para a sua orientação inicial (que depende do modo, consulte :func:`mode`).
sv: Flytta sköldpaddan till origo -- koordinater (0,0) -- och sätt dess kurs till dess startorientering (som beror på läget, se :func:`mode`).

source: a number (or ``None``)
pt_pt: um número (ou ``None``)
sv: ett tal (eller ``None``)

source: an integer (or ``None``)
pt_pt: um inteiro (ou ``None``)
sv: ett heltal (eller ``None``)

source: Draw a circle with given *radius*. The center is *radius* units left of the turtle; *extent* -- an angle -- determines which part of the circle is drawn. If *extent* is not given, draw the entire circle. If *extent* is not a full circle, one endpoint of the arc is the current pen position. Draw the arc in counterclockwise direction if *radius* is positive, otherwise in clockwise direction. Finally the direction of the turtle is changed by the amount of *extent*.
pt_pt: Desenha um círculo com o *raio* dado. O centro está a *raio* unidades à esquerda da tartaruga; *extent* -- um ângulo -- determina qual parte do círculo é desenhada. Se *extent* não for dado, desenha todo o círculo. Se *extent* não for um círculo completo, um dos extremos do arco é a posição atual da caneta. Desenha o arco no sentido anti-horário se *radius* for positivo, caso contrário, no sentido horário. Finalmente, a direção da tartaruga é alterada pelo valor de *extent*.
sv: Rita en cirkel med given *radius*. Centrum är *radius* enheter till vänster om sköldpaddan; *extent* -- en vinkel -- bestämmer vilken del av cirkeln som ritas. Om *extent* inte anges ritas hela cirkeln. Om *extent* inte är en hel cirkel, är en av bågens ändpunkter den aktuella pennpositionen. Rita bågen moturs om *radius* är positiv, annars medurs. Slutligen ändras sköldpaddans riktning med beloppet för *extent*.

source: As the circle is approximated by an inscribed regular polygon, *steps* determines the number of steps to use. If not given, it will be calculated automatically. May be used to draw regular polygons.
pt_pt: Como o círculo é aproximado por um polígono regular inscrito, *steps* determina o número de passos a usar. Se não for dado, será calculado automaticamente. Pode ser usado para desenhar polígonos regulares.
sv: Eftersom cirkeln approximeras av en inskriven reguljär polygon, bestämmer *steps* antalet steg som ska användas. Om det inte anges beräknas det automatiskt. Kan användas för att rita reguljära polygoner.

source: an integer >= 1 (if given)
pt_pt: um inteiro >= 1 (se dado)
sv: ett heltal >= 1 (om det anges)

source: a colorstring or a numeric color tuple
pt_pt: uma *string* de cor ou um tuplo de cor numérico
sv: en färgsträng eller en numerisk färgtupel

source: Stamp a copy of the turtle shape onto the canvas at the current turtle position. Return a stamp_id for that stamp, which can be used to delete it by calling ``clearstamp(stamp_id)``.
pt_pt: Carimba uma cópia da forma da tartaruga no canvas na posição atual da tartaruga. Retorna um stamp_id para esse carimbo, que pode ser usado para o apagar chamando ``clearstamp(stamp_id)``.
sv: Stämplar en kopia av sköldpaddsformen på duken vid den aktuella sköldpaddspositionen. Returnerar ett stamp_id för stämpeln, som kan användas för att ta bort den genom att anropa ``clearstamp(stamp_id)``.

source: an integer, must be return value of previous :func:`stamp` call
pt_pt: um inteiro, deve ser o valor de retorno da chamada anterior a :func:`stamp`
sv: ett heltal, måste vara returvärdet av föregående :func:`stamp`\-anrop

source: Delete stamp with given *stampid*.
pt_pt: Apaga o carimbo com o *stampid* dado.
sv: Ta bort stämpel med angiven *stämpelid*.

source: Delete all or first/last *n* of turtle's stamps. If *n* is ``None``, delete all stamps, if *n* > 0 delete first *n* stamps, else if *n* < 0 delete last *n* stamps.
pt_pt: Apaga todos ou os primeiros/últimos *n* carimbos da tartaruga. Se *n* for ``None``, apaga todos os carimbos; se *n* > 0, apaga os primeiros *n* carimbos; se *n* < 0, apaga os últimos *n* carimbos.
sv: Ta bort alla eller de första/sista *n* av sköldpaddans stämplar. Om *n* är ``None``, radera alla stämplar, om *n* > 0 radera första *n* stämplar, annars om *n* < 0 radera sista *n* stämplar.

source: Undo (repeatedly) the last turtle action(s). Number of available undo actions is determined by the size of the undobuffer.
pt_pt: Desfazer (repetidamente) a(s) última(s) ação(ões) da tartaruga. O número de ações de desfazer disponíveis é determinado pelo tamanho do undobuffer.
sv: Ångra (upprepade gånger) den/de senaste sköldpaddsaktionen/erna. Antalet tillgängliga åtgärder för ångra bestäms av storleken på ångra-bufferten.

source: an integer in the range 0..10 or a speedstring (see below)
pt_pt: um inteiro no intervalo 0..10 ou uma *string* de velocidade (ver abaixo)
sv: ett heltal i intervallet 0..10 eller en speedstring (se nedan)

source: Set the turtle's speed to an integer value in the range 0..10. If no argument is given, return current speed.
pt_pt: Define a velocidade da tartaruga para um valor inteiro no intervalo 0..10. Se nenhum argumento for dado, retorna a velocidade atual.
sv: Ställer in sköldpaddans hastighet till ett heltalsvärde i intervallet 0..10. Om inget argument anges returneras aktuell hastighet.

source: If input is a number greater than 10 or smaller than 0.5, speed is set to 0. Speedstrings are mapped to speedvalues as follows:
pt_pt: Se a entrada for um número maior que 10 ou menor que 0.5, a velocidade é definida para 0. As *strings* de velocidade são mapeadas para valores de velocidade da seguinte forma:
sv: Om indata är ett tal som är större än 10 eller mindre än 0,5 sätts hastigheten till 0. Speedstrings mappas till hastighetsvärden enligt följande:

source: "fastest": 0
pt_pt: "mais rápido": 0
sv: "snabbast": 0

source: "fast": 10
pt_pt: "rápido": 10
sv: "snabb": 10

source: "slow": 3
pt_pt: "devagar": 3
sv: "långsam": 3

source: "slowest": 1
pt_pt: "mais devagar": 1
sv: "långsammast": 1

source: Speeds from 1 to 10 enforce increasingly faster animation of line drawing and turtle turning.
pt_pt: Velocidades de 1 a 10 impõem uma animação cada vez mais rápida do desenho de linhas e da rotação da tartaruga.
sv: Hastigheter från 1 till 10 ger allt snabbare animering av linjeteckning och sköldpaddsvändning.

source: Attention: *speed* = 0 means that *no* animation takes place. forward/back makes turtle jump and likewise left/right make the turtle turn instantly.
pt_pt: Atenção: *speed* = 0 significa que *nenhuma* animação ocorre. forward/back faz a tartaruga saltar e, da mesma forma, left/right fazem a tartaruga rodar instantaneamente.
sv: OBS! *speed* = 0 innebär att *ingen* animation sker. framåt/bakåt får sköldpaddan att hoppa och likaså vänster/höger får sköldpaddan att svänga direkt.

source: Return the turtle's current location (x,y) (as a :class:`Vec2D` vector).
pt_pt: Retorna a localização atual da tartaruga (x,y) (como um vetor :class:`Vec2D`).
sv: Returnerar sköldpaddans aktuella position (x,y) (som en :class:`Vec2D` vektor).

source: a number or a pair/vector of numbers or a turtle instance
pt_pt: um número ou um par/vetor de números ou uma instância de tartaruga
sv: ett tal eller ett par/vektor av tal eller en sköldpaddsinstans

source: a number if *x* is a number, else ``None``
pt_pt: um número se *x* for um número, caso contrário ``None``
sv: ett tal om *x* är ett tal, annars ``None``

source: Return the angle between the line from turtle position to position specified by (x,y), the vector or the other turtle. This depends on the turtle's start orientation which depends on the mode - "standard"/"world" or "logo".
pt_pt: Retorna o ângulo entre a linha da posição da tartaruga para a posição especificada por (x,y), o vetor ou a outra tartaruga. Isto depende da orientação inicial da tartaruga, que depende do modo - "standard"/"world" ou "logo".
sv: Returnerar vinkeln mellan linjen från sköldpaddans position till positionen specificerad av (x,y), vektorn eller den andra sköldpaddan. Detta beror på sköldpaddans startorientering som beror på läget - "standard"/"world" eller "logo".

source: Return the turtle's x coordinate.
pt_pt: Retorna a coordenada x da tartaruga.
sv: Returnerar sköldpaddans x-koordinat.

source: Return the turtle's y coordinate.
pt_pt: Retorna a coordenada y da tartaruga.
sv: Returnerar sköldpaddans y-koordinat.

source: Return the turtle's current heading (value depends on the turtle mode, see :func:`mode`).
pt_pt: Retorna a orientação atual da tartaruga (o valor depende do modo da tartaruga, consulte :func:`mode`).
sv: Returnerar sköldpaddans aktuella kurs (värdet beror på sköldpaddans läge, se :func:`mode`).

source: Return the distance from the turtle to (x,y), the given vector, or the given other turtle, in turtle step units.
pt_pt: Retorna a distância da tartaruga a (x,y), o vetor dado, ou a outra tartaruga dada, em unidades de passo da tartaruga.
sv: Returnerar avståndet från sköldpaddan till (x,y), den givna vektorn eller den givna andra sköldpaddan, i sköldpaddsstegsenheter.

source: Settings for measurement
pt_pt: Definições para medição
sv: Inställningar för mätning

source: Set angle measurement units, i.e. set number of "degrees" for a full circle. Default value is 360 degrees.
pt_pt: Define as unidades de medição de ângulo, ou seja, define o número de "graus" para um círculo completo. O valor predefinido é 360 graus.
sv: Ange enheter för vinkelmätning, dvs. ange antal "grader" för en hel cirkel. Standardvärdet är 360 grader.

source: Set the angle measurement units to radians. Equivalent to ``degrees(2*math.pi)``.
pt_pt: Define as unidades de medição de ângulo para radianos. Equivalente a ``degrees(2*math.pi)``.
sv: Ställ in vinkelmätningsenheterna till radianer. Motsvarar ``grader(2*math.pi)``.

source: Pull the pen down -- drawing when moving.
pt_pt: Baixar a caneta -- desenha ao mover.
sv: Dra ner pennan - rita när du rör dig.

source: Pull the pen up -- no drawing when moving.
pt_pt: Levantar a caneta -- não desenha ao mover.
sv: Dra upp pennan - ingen ritning när du rör dig.

source: a positive number
pt_pt: um número positivo
sv: ett positivt tal

source: Set the line thickness to *width* or return it. If resizemode is set to "auto" and turtleshape is a polygon, that polygon is drawn with the same line thickness. If no argument is given, the current pensize is returned.
pt_pt: Define a espessura da linha para *width* ou retorna-a. Se o resizemode estiver definido para "auto" e a forma da tartaruga for um polígono, esse polígono é desenhado com a mesma espessura de linha. Se nenhum argumento for dado, a espessura atual da caneta é retornada.
sv: Ställ in linjetjockleken till *width* eller returnera den. Om resizemode är inställt på "auto" och turtleshape är en polygon, ritas polygonen med samma linjetjocklek. Om inget argument anges returneras den aktuella pennstorleken.

source: a dictionary with some or all of the below listed keys
pt_pt: um dicionário com algumas ou todas as chaves listadas abaixo
sv: en ordbok med några eller alla av nedanstående nycklar

source: one or more keyword-arguments with the below listed keys as keywords
pt_pt: um ou mais argumentos nomeados com as chaves listadas abaixo como palavras-chave
sv: ett eller flera keyword-argument med nedanstående nycklar som nyckelord

source: Return or set the pen's attributes in a "pen-dictionary" with the following key/value pairs:
pt_pt: Retorna ou define os atributos da caneta num "dicionário de caneta" com os seguintes pares chave/valor:
sv: Returnera eller ställ in pennans attribut i en "pen-dictionary" med följande nyckel/värde-par:

source: "shown": True/False
pt_pt: "mostrada": Verdadeiro/Falso
sv: "visad": Sant/Falskt

source: "pendown": True/False
pt_pt: "caneta_baixada": Verdadeiro/Falso
sv: "Pendown": Sant/Falskt

source: "pencolor": color-string or color-tuple
pt_pt: "cor_caneta": *string* de cor ou tuplo de cor
sv: "pencolor": färgsträng eller färg-tupel

source: "fillcolor": color-string or color-tuple
pt_pt: "cor_preenchimento": *string* de cor ou tuplo de cor
sv: "fillcolor": färgsträng eller färg-tupel

source: "pensize": positive number
pt_pt: "tamanho_caneta": número positivo
sv: "pensize": positivt tal

source: "speed": number in range 0..10
pt_pt: "velocidade": número no intervalo 0..10
sv: "speed": tal inom intervallet 0..10

source: "resizemode": "auto" or "user" or "noresize"
pt_pt: "modo_redimensionamento": "auto" ou "utilizador" ou "sem_redimensionar"
sv: "resizemode": "auto" eller "user" eller "noresize"

source: "stretchfactor": (positive number, positive number)
pt_pt: "fator_estiramento": (número positivo, número positivo)
sv: "stretchfactor": (positivt tal, positivt tal)

source: "outline": positive number
pt_pt: "contorno": número positivo
sv: "outline": positivt tal

source: "tilt": number
pt_pt: "inclinação": número
sv: "tilt": antal

source: This dictionary can be used as argument for a subsequent call to :func:`pen` to restore the former pen-state. Moreover one or more of these attributes can be provided as keyword-arguments. This can be used to set several pen attributes in one statement.
pt_pt: Este dicionário pode ser usado como argumento para uma chamada subsequente a :func:`pen` para restaurar o estado anterior da caneta. Além disso, um ou mais desses atributos podem ser fornecidos como argumentos nomeados. Isto pode ser usado para definir vários atributos da caneta numa única instrução.
sv: Denna ordbok kan användas som argument för ett efterföljande anrop till :func:`pen` för att återställa det tidigare pen-läget. Dessutom kan ett eller flera av dessa attribut anges som nyckelordsargument. Detta kan användas för att ställa in flera pennattribut i ett och samma meddelande.

source: Return ``True`` if pen is down, ``False`` if it's up.
pt_pt: Retorna ``True`` se a caneta estiver baixa, ``False`` se estiver levantada.
sv: Returnerar ``True`` om pennan är nere, ``False`` om den är uppe.

source: Return or set the pencolor.
pt_pt: Retorna ou define a cor da caneta.
sv: Återställ eller ställ in pennfärgen.

source: Four input formats are allowed:
pt_pt: Quatro formatos de entrada são permitidos:
sv: Fyra inmatningsformat är tillåtna:

source: ``pencolor(colorstring)``
sv: ``penfärg(färgsträng)``

source: Set pencolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
pt_pt: Define a cor da caneta para *colorstring*, que é uma *string* de especificação de cor Tk, como ``"red"``, ``"yellow"``, ou ``"#33cc8c"``.
sv: Ställ in pencolor på *colorstring*, som är en Tk-sträng för färgspecifikationer, till exempel ``"red"``, ``"yellow"`` eller ``"#33cc8c"``.

source: ``pencolor((r, g, b))``
sv: ``pennafärg((r, g, b))``
