Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: pt_pt, sv

source: *name* is an arbitrary string and *shape* is a tuple of pairs of coordinates: Install the corresponding polygon shape.
pt_pt: *name* é uma *string* arbitrária e *shape* é um tuplo de pares de coordenadas: Instala a forma de polígono correspondente.
sv: *name* är en godtycklig sträng och *shape* är en tupel av koordinatpar: Installera motsvarande polygonform.

source: *name* is an arbitrary string and *shape* is a (compound) :class:`Shape` object: Install the corresponding compound shape.
pt_pt: *name* é uma *string* arbitrária e *shape* é um objeto :class:`Shape` (composto): Instala a forma composta correspondente.
sv: *name* är en godtycklig sträng och *shape* är ett (sammansatt) :class:`Shape`\-objekt: Installera motsvarande sammansatta form.

source: Add a turtle shape to TurtleScreen's shapelist. Only thusly registered shapes can be used by issuing the command ``shape(shapename)``.
pt_pt: Adiciona uma forma de tartaruga à lista de formas do TurtleScreen. Apenas as formas registadas desta forma podem ser usadas emitindo o comando ``shape(shapename)``.
sv: Lägg till en sköldpaddsform i TurtleScreens formlista. Endast sålunda registrerade former kan användas genom att ge kommandot ``form(formnamn)``.

source: Return the list of turtles on the screen.
sv: Returnera listan över sköldpaddor på skärmen.

source: Return the height of the turtle window. ::
pt_pt: Retorna a altura da janela da tartaruga. ::
sv: Returnera höjden på sköldpaddans fönster. ::

source: Return the width of the turtle window. ::
pt_pt: Retorna a largura da janela da tartaruga. ::
sv: Returnera bredden på sköldpaddans fönster. ::

source: Methods specific to Screen, not inherited from TurtleScreen
pt_pt: Métodos específicos de Ecrã, não herdados de TurtleScreen
sv: Metoder som är specifika för Screen och som inte ärvs från TurtleScreen

source: Shut the turtlegraphics window.
pt_pt: Fecha a janela de gráficos de tartaruga.
sv: Stäng fönstret turtlegraphics.

source: Bind ``bye()`` method to mouse clicks on the Screen.
pt_pt: Liga o método ``bye()`` a cliques do rato no Ecrã.
sv: Binda metoden ``bye()`` till musklick på skärmen.

source: If the value "using_IDLE" in the configuration dictionary is ``False`` (default value), also enter mainloop. Remark: If IDLE with the ``-n`` switch (no subprocess) is used, this value should be set to ``True`` in :file:`turtle.cfg`. In this case IDLE's own mainloop is active also for the client script.
pt_pt: Se o valor "using_IDLE" no dicionário de configuração for ``False`` (valor predefinido), também entra no mainloop. Nota: Se o IDLE for usado com a opção ``-n`` (sem subprocesso), este valor deve ser definido como ``True`` em :file:`turtle.cfg`. Neste caso, o mainloop do IDLE também está ativo para o script cliente.
sv: Om värdet "using_IDLE" i konfigurationsordlistan är ``False`` (standardvärde), ska även mainloop startas. Anmärkning: Om IDLE med ``\-n`` switch (ingen subprocess) används, bör detta värde sättas till ``True`` i :file:`turtle.cfg`. I detta fall är IDLE:s egen huvudslinga aktiv även för klientskriptet.

source: Set the size and position of the main window. Default values of arguments are stored in the configuration dictionary and can be changed via a :file:`turtle.cfg` file.
pt_pt: Define o tamanho e a posição da janela principal. Os valores predefinidos dos argumentos são armazenados no dicionário de configuração e podem ser alterados através de um ficheiro :file:`turtle.cfg`.
sv: Ställer in storlek och position för huvudfönstret. Standardvärden för argument lagras i konfigurationsordlistan och kan ändras via en :file:`turtle.cfg`\-fil.

source: if an integer, a size in pixels, if a float, a fraction of the screen; default is 50% of screen
pt_pt: se for um inteiro, um tamanho em píxeis; se for um float, uma fração do ecrã; o predefinido é 50% do ecrã
sv: om ett heltal, en storlek i pixlar, om en float, en bråkdel av skärmen; standard är 50% of screen

source: if an integer, the height in pixels, if a float, a fraction of the screen; default is 75% of screen
pt_pt: se for um inteiro, a altura em píxeis; se for um float, uma fração do ecrã; o predefinido é 75% do ecrã
sv: om ett heltal, höjden i pixlar, om en float, en bråkdel av skärmen; standard är 75% of screen

source: if positive, starting position in pixels from the left edge of the screen, if negative from the right edge, if ``None``, center window horizontally
pt_pt: se positivo, posição inicial em píxeis a partir da borda esquerda do ecrã; se negativo, a partir da borda direita; se ``None``, centra a janela horizontalmente
sv: om positiv, startposition i pixlar från skärmens vänstra kant, om negativ från höger kant, om ``None``, centrera fönstret horisontellt

source: if positive, starting position in pixels from the top edge of the screen, if negative from the bottom edge, if ``None``, center window vertically
pt_pt: se positivo, posição inicial em píxeis a partir da borda superior do ecrã; se negativo, a partir da borda inferior; se ``None``, centra a janela verticalmente
sv: om positiv, startposition i pixlar från skärmens övre kant, om negativ från den nedre kanten, om ``None``, centrera fönstret vertikalt

source: a string that is shown in the titlebar of the turtle graphics window
pt_pt: uma *string* que é mostrada na barra de título da janela de gráficos de tartaruga
sv: en sträng som visas i titelfältet i sköldpaddans grafikfönster

source: Set title of turtle window to *titlestring*.
pt_pt: Define o título da janela da tartaruga para *titlestring*.
sv: Ställ in titeln på sköldpaddsfönstret till *titlestring*.

source: Public classes
pt_pt: Classes públicas
sv: Offentliga klasser

source: a :class:`!tkinter.Canvas`, a :class:`ScrolledCanvas` or a :class:`TurtleScreen`
pt_pt: um :class:`!tkinter.Canvas`, um :class:`ScrolledCanvas` ou um :class:`TurtleScreen`
sv: en :class:`!tkinter.Canvas`, en :class:`ScrolledCanvas` eller en :class:`TurtleScreen`

source: Create a turtle. The turtle has all methods described above as "methods of Turtle/RawTurtle".
pt_pt: Cria uma tartaruga. A tartaruga tem todos os métodos descritos acima como "métodos de Turtle/RawTurtle".
sv: Skapa en sköldpadda. Sköldpaddan har alla metoder som beskrivs ovan som "metoder för Turtle/RawTurtle".

source: Subclass of RawTurtle, has the same interface but draws on a default :class:`Screen` object created automatically when needed for the first time.
pt_pt: Subclasse de RawTurtle, tem a mesma interface, mas desenha num objeto :class:`Screen` predefinido criado automaticamente quando necessário pela primeira vez.
sv: Underklass till RawTurtle, har samma gränssnitt men ritar på ett standardobjekt :class:`Screen` som skapas automatiskt när det behövs för första gången.

source: a :class:`!tkinter.Canvas`
pt_pt: um :class:`!tkinter.Canvas`
sv: en :class:`!tkinter.Canvas`

source: Provides screen oriented methods like :func:`bgcolor` etc. that are described above.
pt_pt: Fornece métodos orientados ao ecrã como :func:`bgcolor`, etc., que são descritos acima.
sv: Tillhandahåller skärmorienterade metoder som :func:`bgcolor` etc. som beskrivs ovan.

source: Subclass of TurtleScreen, with :ref:`four methods added <screenspecific>`.
pt_pt: Subclasse de TurtleScreen, com :ref:`quatro métodos adicionados <screenspecific>`.
sv: Underklass av TurtleScreen, med :ref:`fyra metoder tillagda <screenspecific>`.

source: some Tkinter widget to contain the ScrolledCanvas, i.e. a Tkinter-canvas with scrollbars added
pt_pt: algum widget Tkinter para conter o ScrolledCanvas, ou seja, um canvas Tkinter com barras de deslocamento adicionadas
sv: en Tkinter-widget som innehåller ScrolledCanvas, dvs. en Tkinter-canvas med tillägg av rullningslister

source: Used by class Screen, which thus automatically provides a ScrolledCanvas as playground for the turtles.
pt_pt: Usado pela classe Screen, que assim fornece automaticamente um ScrolledCanvas como área de desenho para as tartarugas.
sv: Används av klassen Screen, som därmed automatiskt tillhandahåller en ScrolledCanvas som lekplats för sköldpaddorna.

source: one of the strings "polygon", "image", "compound"
pt_pt: uma das *strings* "polígono", "imagem", "composto"
sv: en av strängarna "polygon", "image", "compound"

source: Data structure modeling shapes. The pair ``(type_, data)`` must follow this specification:
pt_pt: Estrutura de dados que modela formas. O par ``(type_, data)`` deve seguir esta especificação:
sv: Former för modellering av datastrukturer. Paret ``(typ_, data)`` måste följa denna specifikation:

source: *type_*
pt_pt: *tipo*
sv: *typ_*

source: a polygon-tuple, i.e. a tuple of pairs of coordinates
pt_pt: um tuplo de polígono, ou seja, um tuplo de pares de coordenadas
sv: en polygon-tupel, dvs. en tupel av koordinatpar

source: "image"
pt_pt: "imagem"
sv: "bild"

source: an image (in this form only used internally!)
pt_pt: uma imagem (nesta forma, usada apenas internamente!)
sv: en bild (i denna form används den endast internt!)

source: "compound"
pt_pt: "composto"
sv: "sammansatt"

source: ``None`` (a compound shape has to be constructed using the :meth:`addcomponent` method)
pt_pt: ``None`` (uma forma composta tem de ser construída usando o método :meth:`addcomponent`)
sv: ``None`` (en sammansatt form måste konstrueras med hjälp av metoden :meth:`addcomponent`)

source: a polygon, i.e. a tuple of pairs of numbers
pt_pt: um polígono, ou seja, um tuplo de pares de números
sv: en polygon, d.v.s. en tupel av talpar

source: a color the *poly* will be filled with
pt_pt: uma cor com que o *poly* será preenchido
sv: en färg som *poly* kommer att fyllas med

source: a color for the poly's outline (if given)
pt_pt: uma cor para o contorno do polígono (se dada)
sv: en färg för polygonens kontur (om den anges)

source: Example:
pt_pt: Exemplo:
sv: Exempel:

source: See :ref:`compoundshapes`.
pt_pt: Consulte :ref:`compoundshapes`.
sv: Se :ref:`compoundshapes`.

source: A two-dimensional vector class, used as a helper class for implementing turtle graphics. May be useful for turtle graphics programs too. Derived from tuple, so a vector is a tuple!
pt_pt: Uma classe de vetor bidimensional, usada como classe auxiliar para implementar gráficos de tartaruga. Também pode ser útil para programas de gráficos de tartaruga. Derivada de tuplo, por isso um vetor é um tuplo!
sv: En tvådimensionell vektorklass som används som en hjälpklass för att implementera sköldpaddsgrafik. Kan vara användbar för sköldpaddsgrafikprogram också. Härledd från tuple, så en vektor är en tuple!

source: Provides (for *a*, *b* vectors, *k* number):
pt_pt: Fornece (para vetores *a*, *b*, número *k*):
sv: Ger (för *a*, *b* vektorer, *k* nummer):

source: ``a + b`` vector addition
pt_pt: ``a + b`` adição de vetores
sv: ``a + b`` vektor addition

source: ``a - b`` vector subtraction
pt_pt: ``a - b`` subtração de vetores
sv: ``a - b`` vektorns subtraktion

source: ``a * b`` inner product
pt_pt: ``a * b`` produto interno
sv: ``a * b`` inre produkt

source: ``k * a`` and ``a * k`` multiplication with scalar
pt_pt: ``k * a`` e ``a * k`` multiplicação por escalar
sv: multiplikation av ``k * a`` och ``a * k`` med skalär

source: ``abs(a)`` absolute value of a
pt_pt: ``abs(a)`` valor absoluto de a
sv: ``abs(a)`` absolut värde av a

source: ``a.rotate(angle)`` rotation
pt_pt: ``a.rotate(angle)`` rotação
sv: ``a.rotera(vinkel)`` rotation

source: Explanation
pt_pt: Explicação
sv: Förklaring

source: A turtle object draws on a screen object, and there a number of key classes in the turtle object-oriented interface that can be used to create them and relate them to each other.
pt_pt: Um objeto tartaruga desenha num objeto ecrã, e existem várias classes-chave na interface orientada a objetos da tartaruga que podem ser usadas para os criar e relacioná-los entre si.
sv: Ett turtle-objekt ritar på ett screen-objekt och det finns ett antal nyckelklasser i det objektorienterade gränssnittet turtle som kan användas för att skapa dem och relatera dem till varandra.

source: A :class:`Turtle` instance will automatically create a :class:`Screen` instance if one is not already present.
pt_pt: Uma instância de :class:`Turtle` criará automaticamente uma instância de :class:`Screen` se uma não estiver já presente.
sv: En :class:`Turtle`\-instans skapar automatiskt en :class:`Screen`\-instans om en sådan inte redan finns.

source: ``Turtle`` is a subclass of :class:`RawTurtle`, which *doesn't* automatically create a drawing surface - a *canvas* will need to be provided or created for it. The *canvas* can be a :class:`!tkinter.Canvas`, :class:`ScrolledCanvas` or :class:`TurtleScreen`.
pt_pt: ``Turtle`` é uma subclasse de :class:`RawTurtle`, que *não* cria automaticamente uma superfície de desenho - um *canvas* terá de ser fornecido ou criado para ela. O *canvas* pode ser um :class:`!tkinter.Canvas`, :class:`ScrolledCanvas` ou :class:`TurtleScreen`.
sv: ``Turtle`` är en underklass av :class:`RawTurtle`, som *inte* automatiskt skapar en rityta - en *canvas* måste tillhandahållas eller skapas för den. *Canvas* kan vara en :class:`!tkinter.Canvas`, :class:`ScrolledCanvas` eller :class:`TurtleScreen`.

source: :class:`TurtleScreen` is the basic drawing surface for a turtle. :class:`Screen` is a subclass of ``TurtleScreen``, and includes :ref:`some additional methods <screenspecific>` for managing its appearance (including size and title) and behaviour. ``TurtleScreen``'s constructor needs a :class:`!tkinter.Canvas` or a :class:`ScrolledCanvas` as an argument.
pt_pt: :class:`TurtleScreen` é a superfície de desenho básica para uma tartaruga. :class:`Screen` é uma subclasse de ``TurtleScreen`` e inclui :ref:`alguns métodos adicionais <screenspecific>` para gerir a sua aparência (incluindo tamanho e título) e comportamento. O construtor de ``TurtleScreen`` necessita de um :class:`!tkinter.Canvas` ou um :class:`ScrolledCanvas` como argumento.
sv: :class:`TurtleScreen` är den grundläggande ritytan för en sköldpadda. :class:`Screen` är en underklass av ``TurtleScreen``, och innehåller :ref:`vissa ytterligare metoder <screenspecific>` för att hantera dess utseende (inklusive storlek och titel) och beteende. ``TurtleScreen``'s konstruktor behöver en :class:`!tkinter.Canvas` eller en :class:`ScrolledCanvas` som argument.

source: The functional interface for turtle graphics uses the various methods of ``Turtle`` and ``TurtleScreen``/``Screen``. Behind the scenes, a screen object is automatically created whenever a function derived from a ``Screen`` method is called. Similarly, a turtle object is automatically created whenever any of the functions derived from a Turtle method is called.
pt_pt: A interface funcional para gráficos de tartaruga usa os vários métodos de ``Turtle`` e ``TurtleScreen``/``Screen``. Nos bastidores, um objeto ecrã é criado automaticamente sempre que uma função derivada de um método ``Screen`` é chamada. Da mesma forma, um objeto tartaruga é criado automaticamente sempre que qualquer uma das funções derivadas de um método Turtle é chamada.
sv: Det funktionella gränssnittet för sköldpaddsgrafik använder de olika metoderna i ``Turtle`` och ``TurtleScreen``/``Screen``. Bakom kulisserna skapas automatiskt ett screen-objekt när en funktion som härrör från en ``Screen``\ -metod anropas. På samma sätt skapas ett turtle-objekt automatiskt när någon av de funktioner som härrör från en turtle-metod anropas.

source: To use multiple turtles on a screen, the object-oriented interface must be used.
pt_pt: Para usar várias tartarugas num ecrã, a interface orientada a objetos deve ser usada.
sv: För att använda flera sköldpaddor på en skärm måste det objektorienterade gränssnittet användas.

source: Help and configuration
pt_pt: Ajuda e configuração
sv: Hjälp och konfiguration

source: How to use help
pt_pt: Como usar a ajuda
sv: Hur man använder hjälp

source: The public methods of the Screen and Turtle classes are documented extensively via docstrings. So these can be used as online-help via the Python help facilities:
pt_pt: Os métodos públicos das classes Screen e Turtle estão extensivamente documentados através de docstrings. Assim, estas podem ser usadas como ajuda online através das facilidades de ajuda do Python:
sv: De publika metoderna i klasserna Screen och Turtle är utförligt dokumenterade via docstrings. Så dessa kan användas som online-hjälp via Pythons hjälpfunktioner:

source: When using IDLE, tooltips show the signatures and first lines of the docstrings of typed in function-/method calls.
pt_pt: Ao usar o IDLE, as dicas mostram as assinaturas e as primeiras linhas das docstrings das chamadas de função/método digitadas.
sv: När IDLE används visar verktygstipsen signaturerna och de första raderna i dokumentsträngarna för de funktions-/metodanrop som skrivits in.

source: Calling :func:`help` on methods or functions displays the docstrings::
pt_pt: Chamar :func:`help` em métodos ou funções mostra as docstrings:
sv: Om du anropar :func:`help` på metoder eller funktioner visas dokumentationen::

source: The docstrings of the functions which are derived from methods have a modified form::
pt_pt: As docstrings das funções que são derivadas de métodos têm uma forma modificada:
sv: Dokumentationen av de funktioner som härrör från metoder har en modifierad form::

source: These modified docstrings are created automatically together with the function definitions that are derived from the methods at import time.
pt_pt: Estas docstrings modificadas são criadas automaticamente juntamente com as definições de função que são derivadas dos métodos no momento da importação.
sv: Dessa modifierade docstrings skapas automatiskt tillsammans med de funktionsdefinitioner som härleds från metoderna vid importtillfället.

source: Translation of docstrings into different languages
pt_pt: Tradução de docstrings para diferentes idiomas
sv: Översättning av docstrings till olika språk

source: There is a utility to create a dictionary the keys of which are the method names and the values of which are the docstrings of the public methods of the classes Screen and Turtle.
pt_pt: Existe uma utilidade para criar um dicionário cujas chaves são os nomes dos métodos e cujos valores são as docstrings dos métodos públicos das classes Screen e Turtle.
sv: Det finns ett verktyg för att skapa en ordbok vars nycklar är metodnamnen och vars värden är dokumentsträngarna för de offentliga metoderna i klasserna Screen och Turtle.

source: a string, used as filename
pt_pt: uma *string*, usada como nome de ficheiro
sv: en sträng, används som filnamn

source: Create and write docstring-dictionary to a Python script with the given filename. This function has to be called explicitly (it is not used by the turtle graphics classes). The docstring dictionary will be written to the Python script :file:`{filename}.py`. It is intended to serve as a template for translation of the docstrings into different languages.
pt_pt: Cria e escreve o dicionário de docstrings para um script Python com o nome de ficheiro dado. Esta função tem de ser chamada explicitamente (não é usada pelas classes de gráficos de tartaruga). O dicionário de docstrings será escrito para o script Python :file:`{filename}.py`. Destina-se a servir como modelo para a tradução das docstrings para diferentes idiomas.
sv: Skapa och skriv docstring-dictionary till ett Python-skript med det angivna filnamnet. Denna funktion måste anropas explicit (den används inte av turtle graphics-klasserna). Docstring-ordboken kommer att skrivas till Python-skriptet :file:`{filename}.py`. Den är avsedd att fungera som en mall för översättning av docstrings till olika språk.

source: If you (or your students) want to use :mod:`turtle` with online help in your native language, you have to translate the docstrings and save the resulting file as e.g. :file:`turtle_docstringdict_german.py`.
pt_pt: Se você (ou os seus alunos) quiser usar :mod:`turtle` com ajuda online na sua língua nativa, terá de traduzir as docstrings e guardar o ficheiro resultante como, por exemplo, :file:`turtle_docstringdict_german.py`.
sv: Om du (eller dina studenter) vill använda :mod:`turtle` med onlinehjälp på ditt modersmål, måste du översätta dokumentationen och spara den resulterande filen som t.ex. :file:`turtle_docstringdict_german.py`.

source: If you have an appropriate entry in your :file:`turtle.cfg` file this dictionary will be read in at import time and will replace the original English docstrings.
pt_pt: Se tiver uma entrada apropriada no seu ficheiro :file:`turtle.cfg`, este dicionário será lido no momento da importação e substituirá as docstrings originais em inglês.
sv: Om du har en lämplig post i din :file:`turtle.cfg`\-fil kommer denna ordbok att läsas in vid importtillfället och ersätta de engelska originaldokumenten.

source: At the time of this writing there are docstring dictionaries in German and in Italian. (Requests please to glingl@aon.at.)
pt_pt: Na altura da escrita deste texto, existem dicionários de docstrings em alemão e em italiano. (Pedidos, por favor, para glingl@aon.at.)
sv: När detta skrivs finns det docstring-ordböcker på tyska och italienska. (Förfrågningar till glingl@aon.at.)

source: How to configure Screen and Turtles
pt_pt: Como configurar o Ecrã e as Tartarugas
sv: Så här konfigurerar du Screen and Turtles

source: The built-in default configuration mimics the appearance and behaviour of the old turtle module in order to retain best possible compatibility with it.
pt_pt: A configuração predefinida incorporada imita a aparência e o comportamento do antigo módulo turtle para reter a melhor compatibilidade possível com ele.
sv: Den inbyggda standardkonfigurationen efterliknar utseendet och beteendet hos den gamla turtle-modulen för att bibehålla bästa möjliga kompatibilitet med den.

source: If you want to use a different configuration which better reflects the features of this module or which better fits to your needs, e.g. for use in a classroom, you can prepare a configuration file ``turtle.cfg`` which will be read at import time and modify the configuration according to its settings.
pt_pt: Se quiser usar uma configuração diferente que reflita melhor as funcionalidades deste módulo ou que se adapte melhor às suas necessidades, por exemplo, para uso em sala de aula, pode preparar um ficheiro de configuração ``turtle.cfg`` que será lido no momento da importação e modificará a configuração de acordo com as suas definições.
sv: Om du vill använda en annan konfiguration som bättre återspeglar funktionerna i denna modul eller som bättre passar dina behov, t.ex. för användning i ett klassrum, kan du förbereda en konfigurationsfil ``turtle.cfg`` som kommer att läsas vid importtillfället och ändra konfigurationen enligt dess inställningar.

source: The built in configuration would correspond to the following ``turtle.cfg``:
pt_pt: A configuração incorporada corresponderia ao seguinte ``turtle.cfg``:
sv: Den inbyggda konfigurationen skulle motsvara följande ``turtle.cfg``:

source: Short explanation of selected entries:
pt_pt: Breve explicação de entradas selecionadas:
sv: Kort förklaring av utvalda poster:

source: The first four lines correspond to the arguments of the :func:`Screen.setup <setup>` method.
pt_pt: As quatro primeiras linhas correspondem aos argumentos do método :func:`Screen.setup <setup>`.
sv: De fyra första raderna motsvarar argumenten i metoden :func:`Screen.setup <setup>`.

source: Line 5 and 6 correspond to the arguments of the method :func:`Screen.screensize <screensize>`.
pt_pt: As linhas 5 e 6 correspondem aos argumentos do método :func:`Screen.screensize <screensize>`.
sv: Rad 5 och 6 motsvarar argumenten i metoden :func:`Screen.screensize <screensize>`.
