Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: For example, using the unpack operator ``*`` on a :ref:`type variable tuple <typevartuple>` is equivalent to using ``Unpack`` to mark the type variable tuple as having been unpacked::
pt_pt: Por exemplo, usar o operador de descompactação ``*`` num :ref:`tuplo de variável de tipo <typevartuple>` é equivalente a usar ``Unpack`` para marcar o tuplo de variável de tipo como tendo sido descompactado::

source: Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Effectively does: tup: tuple[Unpack[Ts]]
pt_pt: Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Efetivamente faz: tup: tuple[Unpack[Ts]]

source: In fact, ``Unpack`` can be used interchangeably with ``*`` in the context of :class:`typing.TypeVarTuple <TypeVarTuple>` and :class:`builtins.tuple <tuple>` types. You might see ``Unpack`` being used explicitly in older versions of Python, where ``*`` couldn't be used in certain places::
pt_pt: De facto, ``Unpack`` pode ser usado alternadamente com ``*`` no contexto de :class:`typing.TypeVarTuple <TypeVarTuple>` e tipos :class:`builtins.tuple <tuple>`. Pode ver ``Unpack`` a ser usado explicitamente em versões mais antigas do Python, onde ``*`` não podia ser usado em certos lugares::

source: # In older versions of Python, TypeVarTuple and Unpack # are located in the `typing_extensions` backports package. from typing_extensions import TypeVarTuple, Unpack Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Syntax error on Python <= 3.10! tup: tuple[Unpack[Ts]] # Semantically equivalent, and backwards-compatible
pt_pt: # Em versões mais antigas do Python, TypeVarTuple e Unpack # estão localizados no pacote de retroportagem `typing_extensions`. from typing_extensions import TypeVarTuple, Unpack Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Erro de sintaxe no Python <= 3.10! tup: tuple[Unpack[Ts]] # Semanticamente equivalente, e retrocompatível

source: ``Unpack`` can also be used along with :class:`typing.TypedDict` for typing ``**kwargs`` in a function signature::
pt_pt: ``Unpack`` também pode ser usado juntamente com :class:`typing.TypedDict` para tipar ``**kwargs`` numa assinatura de função::

source: from typing import TypedDict, Unpack class Movie(TypedDict): name: str year: int # This function expects two keyword arguments - `name` of type `str` # and `year` of type `int`. def foo(**kwargs: Unpack[Movie]): ...
pt_pt: from typing import TypedDict, Unpack class Movie(TypedDict): name: str year: int # Esta função espera dois argumentos nomeados - `name` do tipo `str` # e `year` do tipo `int`. def foo(**kwargs: Unpack[Movie]): ...

source: See :pep:`692` for more details on using ``Unpack`` for ``**kwargs`` typing.
pt_pt: Veja :pep:`692` para mais detalhes sobre o uso de ``Unpack`` para tipagem de ``**kwargs``.

source: Building generic types and type aliases
pt_pt: Construção de tipos genéricos e aliases de tipo

source: The following classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating generic types and type aliases.
pt_pt: As seguintes classes não devem ser usadas diretamente como anotações. O seu propósito é serem blocos de construção para criar tipos genéricos e aliases de tipo.

source: These objects can be created through special syntax (:ref:`type parameter lists <type-params>` and the :keyword:`type` statement). For compatibility with Python 3.11 and earlier, they can also be created without the dedicated syntax, as documented below.
pt_pt: Estes objetos podem ser criados através de sintaxe especial (:ref:`listas de parâmetros de tipo <type-params>` e a instrução :keyword:`type`). Para compatibilidade com o Python 3.11 e anteriores, também podem ser criados sem a sintaxe dedicada, como documentado abaixo.

source: Abstract base class for generic types.
pt_pt: Classe base abstrata para tipos genéricos.

source: A generic type is typically declared by adding a list of type parameters after the class name::
pt_pt: Um tipo genérico é tipicamente declarado adicionando uma lista de parâmetros de tipo depois do nome da classe::

source: Such a class implicitly inherits from ``Generic``. The runtime semantics of this syntax are discussed in the :ref:`Language Reference <generic-classes>`.
pt_pt: Tal classe herda implicitamente de ``Generic``. A semântica de tempo de execução desta sintaxe é discutida na :ref:`Referência da Linguagem <generic-classes>`.

source: This class can then be used as follows::
pt_pt: Esta classe pode então ser usada da seguinte forma::

source: Here the brackets after the function name indicate a :ref:`generic function <generic-functions>`.
pt_pt: Aqui, os parênteses retos após o nome da função indicam uma :ref:`função genérica <generic-functions>`.

source: For backwards compatibility, generic classes can also be declared by explicitly inheriting from ``Generic``. In this case, the type parameters must be declared separately::
pt_pt: Para compatibilidade retroativa, as classes genéricas também podem ser declaradas herdando explicitamente de ``Generic``. Neste caso, os parâmetros de tipo devem ser declarados separadamente::

source: Type variable.
pt_pt: Variável de tipo.

source: The preferred way to construct a type variable is via the dedicated syntax for :ref:`generic functions <generic-functions>`, :ref:`generic classes <generic-classes>`, and :ref:`generic type aliases <generic-type-aliases>`::
pt_pt: A forma preferida de construir uma variável de tipo é através da sintaxe dedicada para :ref:`funções genéricas <generic-functions>`, :ref:`classes genéricas <generic-classes>`, e :ref:`aliases de tipo genéricos <generic-type-aliases>`::

source: class Sequence[T]: # T is a TypeVar ...
pt_pt: class Sequence[T]: # T é um TypeVar ...

source: This syntax can also be used to create bounded and constrained type variables::
pt_pt: Esta sintaxe também pode ser usada para criar variáveis de tipo limitadas e restritas::

source: class StrSequence[S: str]: # S is a TypeVar with a `str` upper bound; ... # we can say that S is "bounded by `str`" class StrOrBytesSequence[A: (str, bytes)]: # A is a TypeVar constrained to str or bytes ...
pt_pt: class StrSequence[S: str]: # S é um TypeVar com um limite superior `str`; ... # podemos dizer que S é "limitado por `str`" class StrOrBytesSequence[A: (str, bytes)]: # A é um TypeVar restrito a str ou bytes ...

source: However, if desired, reusable type variables can also be constructed manually, like so::
pt_pt: No entanto, se desejado, variáveis de tipo reutilizáveis também podem ser construídas manualmente, como a seguir::

source: T = TypeVar('T') # Can be anything S = TypeVar('S', bound=str) # Can be any subtype of str A = TypeVar('A', str, bytes) # Must be exactly str or bytes
pt_pt: T = TypeVar('T') # Pode ser qualquer coisa S = TypeVar('S', bound=str) # Pode ser qualquer subtipo de str A = TypeVar('A', str, bytes) # Deve ser exatamente str ou bytes

source: Type variables exist primarily for the benefit of static type checkers. They serve as the parameters for generic types as well as for generic function and type alias definitions. See :class:`Generic` for more information on generic types. Generic functions work as follows::
pt_pt: As variáveis de tipo existem principalmente para o benefício dos verificadores de tipo estáticos. Elas servem como os parâmetros para tipos genéricos, bem como para definições de funções genéricas e aliases de tipo. Veja :class:`Generic` para mais informações sobre tipos genéricos. As funções genéricas funcionam da seguinte forma::

source: def repeat[T](x: T, n: int) -> Sequence[T]: """Return a list containing n references to x.""" return [x]*n def print_capitalized[S: str](x: S) -> S: """Print x capitalized, and return x.""" print(x.capitalize()) return x def concatenate[A: (str, bytes)](x: A, y: A) -> A: """Add two strings or bytes objects together.""" return x + y
pt_pt: def repeat[T](x: T, n: int) -> Sequence[T]: """Retorna uma lista contendo n referências a x.""" return [x]*n def print_capitalized[S: str](x: S) -> S: """Imprime x com a primeira letra maiúscula e retorna x.""" print(x.capitalize()) return x def concatenate[A: (str, bytes)](x: A, y: A) -> A: """Adiciona duas strings ou objetos bytes.""" return x + y

source: Note that type variables can be *bounded*, *constrained*, or neither, but cannot be both bounded *and* constrained.
pt_pt: Note que as variáveis de tipo podem ser *limitadas*, *restritas*, ou nenhuma das duas, mas não podem ser ambas limitadas *e* restritas.

source: The variance of type variables is inferred by type checkers when they are created through the :ref:`type parameter syntax <type-params>` or when ``infer_variance=True`` is passed. Manually created type variables may be explicitly marked covariant or contravariant by passing ``covariant=True`` or ``contravariant=True``. By default, manually created type variables are invariant. See :pep:`484` and :pep:`695` for more details.
pt_pt: A variância das variáveis de tipo é inferida pelos verificadores de tipo quando são criadas através da :ref:`sintaxe de parâmetros de tipo <type-params>` ou quando ``infer_variance=True`` é passado. Variáveis de tipo criadas manualmente podem ser explicitamente marcadas como covariantes ou contravariantes passando ``covariant=True`` ou ``contravariant=True``. Por predefinição, variáveis de tipo criadas manualmente são invariantes. Veja :pep:`484` e :pep:`695` para mais detalhes.

source: Bounded type variables and constrained type variables have different semantics in several important ways. Using a *bounded* type variable means that the ``TypeVar`` will be solved using the most specific type possible::
pt_pt: Variáveis de tipo limitadas e variáveis de tipo restritas têm semânticas diferentes de várias formas importantes. Usar uma variável de tipo *limitada* significa que o ``TypeVar`` será resolvido usando o tipo mais específico possível::

source: x = print_capitalized('a string') reveal_type(x) # revealed type is str class StringSubclass(str): pass y = print_capitalized(StringSubclass('another string')) reveal_type(y) # revealed type is StringSubclass z = print_capitalized(45) # error: int is not a subtype of str
pt_pt: x = print_capitalized('a string') reveal_type(x) # tipo revelado é str class StringSubclass(str): pass y = print_capitalized(StringSubclass('another string')) reveal_type(y) # tipo revelado é StringSubclass z = print_capitalized(45) # erro: int não é um subtipo de str

source: The upper bound of a type variable can be a concrete type, abstract type (ABC or Protocol), or even a union of types::
pt_pt: O limite superior de uma variável de tipo pode ser um tipo concreto, tipo abstrato (ABC ou Protocol), ou até mesmo uma união de tipos::

source: # Can be anything with an __abs__ method def print_abs[T: SupportsAbs](arg: T) -> None: print("Absolute value:", abs(arg)) U = TypeVar('U', bound=str|bytes) # Can be any subtype of the union str|bytes V = TypeVar('V', bound=SupportsAbs) # Can be anything with an __abs__ method
pt_pt: # Pode ser qualquer coisa com um método __abs__ def print_abs[T: SupportsAbs](arg: T) -> None: print("Valor absoluto:", abs(arg)) U = TypeVar('U', bound=str|bytes) # Pode ser qualquer subtipo da união str|bytes V = TypeVar('V', bound=SupportsAbs) # Pode ser qualquer coisa com um método __abs__

source: Using a *constrained* type variable, however, means that the ``TypeVar`` can only ever be solved as being exactly one of the constraints given::
pt_pt: Usar uma variável de tipo *restrita*, no entanto, significa que o ``TypeVar`` só pode ser resolvido como sendo exatamente uma das restrições dadas::

source: a = concatenate('one', 'two') reveal_type(a) # revealed type is str b = concatenate(StringSubclass('one'), StringSubclass('two')) reveal_type(b) # revealed type is str, despite StringSubclass being passed in c = concatenate('one', b'two') # error: type variable 'A' can be either str or bytes in a function call, but not both
pt_pt: a = concatenate('one', 'two') reveal_type(a) # tipo revelado é str b = concatenate(StringSubclass('one'), StringSubclass('two')) reveal_type(b) # tipo revelado é str, apesar de StringSubclass ter sido passado c = concatenate('one', b'two') # erro: variável de tipo 'A' pode ser str ou bytes numa chamada de função, mas não ambos

source: At runtime, ``isinstance(x, T)`` will raise :exc:`TypeError`.
pt_pt: Em tempo de execução, ``isinstance(x, T)`` levantará :exc:`TypeError`.

source: The name of the type variable.
pt_pt: O nome da variável de tipo.

source: Whether the type var has been explicitly marked as covariant.
pt_pt: Se a variável de tipo foi explicitamente marcada como covariante.

source: Whether the type var has been explicitly marked as contravariant.
pt_pt: Se a variável de tipo foi explicitamente marcada como contravariante.

source: Whether the type variable's variance should be inferred by type checkers.
pt_pt: Se a variância da variável de tipo deve ser inferida pelos verificadores de tipo.

source: The upper bound of the type variable, if any.
pt_pt: O limite superior da variável de tipo, se houver.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the bound is evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
pt_pt: Para variáveis de tipo criadas através da :ref:`sintaxe de parâmetros de tipo <type-params>`, o limite é avaliado apenas quando o atributo é acedido, não quando a variável de tipo é criada (veja :ref:`lazy-evaluation`).

source: A tuple containing the constraints of the type variable, if any.
pt_pt: Um tuplo contendo as restrições da variável de tipo, se houver.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the constraints are evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
pt_pt: Para variáveis de tipo criadas através da :ref:`sintaxe de parâmetros de tipo <type-params>`, as restrições são avaliadas apenas quando o atributo é acedido, não quando a variável de tipo é criada (veja :ref:`lazy-evaluation`).

source: The default value of the type variable, or :data:`typing.NoDefault` if it has no default.
pt_pt: O valor predefinido da variável de tipo, ou :data:`typing.NoDefault` se não tiver um valor predefinido.

source: Return whether or not the type variable has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
pt_pt: Retorna se a variável de tipo tem ou não um valor predefinido. Isto é equivalente a verificar se :attr:`__default__` não é o singleton :data:`typing.NoDefault`, exceto que não força a avaliação do valor predefinido :ref:`avaliado preguiçosamente <lazy-evaluation>`.

source: Type variables can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`. The ``infer_variance`` parameter was added.
pt_pt: As variáveis de tipo podem agora ser declaradas usando a :ref:`sintaxe de parâmetros de tipo <type-params>` introduzida pela :pep:`695`. O parâmetro ``infer_variance`` foi adicionado.

source: Support for default values was added.
pt_pt: Suporte para valores predefinidos foi adicionado.

source: Type variable tuple. A specialized form of :ref:`type variable <typevar>` that enables *variadic* generics.
pt_pt: Tuplo de variáveis de tipo. Uma forma especializada de :ref:`variável de tipo <typevar>` que permite *genéricos variádicos*.

source: Type variable tuples can be declared in :ref:`type parameter lists <type-params>` using a single asterisk (``*``) before the name::
pt_pt: Tuplos de variáveis de tipo podem ser declarados em :ref:`listas de parâmetros de tipo <type-params>` usando um único asterisco (``*``) antes do nome::

source: Or by explicitly invoking the ``TypeVarTuple`` constructor::
pt_pt: Ou invocando explicitamente o construtor ``TypeVarTuple``::

source: A normal type variable enables parameterization with a single type. A type variable tuple, in contrast, allows parameterization with an *arbitrary* number of types by acting like an *arbitrary* number of type variables wrapped in a tuple. For example::
pt_pt: Uma variável de tipo normal permite a parametrização com um único tipo. Um tuplo de variáveis de tipo, em contraste, permite a parametrização com um número *arbitrário* de tipos, atuando como um número *arbitrário* de variáveis de tipo envolvidas num tuplo. Por exemplo::

source: # T is bound to int, Ts is bound to () # Return value is (1,), which has type tuple[int] move_first_element_to_last(tup=(1,)) # T is bound to int, Ts is bound to (str,) # Return value is ('spam', 1), which has type tuple[str, int] move_first_element_to_last(tup=(1, 'spam')) # T is bound to int, Ts is bound to (str, float) # Return value is ('spam', 3.0, 1), which has type tuple[str, float, int] move_first_element_to_last(tup=(1, 'spam', 3.0)) # This fails to type check (and fails at runtime) # because tuple[()] is not compatible with tuple[T, *Ts] # (at least one element is required) move_first_element_to_last(tup=())
pt_pt: # T é ligado a int, Ts é ligado a () # Valor de retorno é (1,), que tem tipo tuple[int] move_first_element_to_last(tup=(1,)) # T é ligado a int, Ts é ligado a (str,) # Valor de retorno é ('spam', 1), que tem tipo tuple[str, int] move_first_element_to_last(tup=(1, 'spam')) # T é ligado a int, Ts é ligado a (str, float) # Valor de retorno é ('spam', 3.0, 1), que tem tipo tuple[str, float, int] move_first_element_to_last(tup=(1, 'spam', 3.0)) # Isto falha na verificação de tipo (e falha em tempo de execução) # porque tuple[()] não é compatível com tuple[T, *Ts] # (pelo menos um elemento é necessário) move_first_element_to_last(tup=())

source: Note the use of the unpacking operator ``*`` in ``tuple[T, *Ts]``. Conceptually, you can think of ``Ts`` as a tuple of type variables ``(T1, T2, ...)``. ``tuple[T, *Ts]`` would then become ``tuple[T, *(T1, T2, ...)]``, which is equivalent to ``tuple[T, T1, T2, ...]``. (Note that in older versions of Python, you might see this written using :data:`Unpack <Unpack>` instead, as ``Unpack[Ts]``.)
pt_pt: Note o uso do operador de descompactação ``*`` em ``tuple[T, *Ts]``. Conceitualmente, pode pensar em ``Ts`` como um tuplo de variáveis de tipo ``(T1, T2, ...)``. ``tuple[T, *Ts]`` tornaria-se então ``tuple[T, *(T1, T2, ...)]``, que é equivalente a ``tuple[T, T1, T2, ...]``. (Note que em versões mais antigas do Python, pode ver isto escrito usando :data:`Unpack <Unpack>` em vez disso, como ``Unpack[Ts]``.)

source: Type variable tuples must *always* be unpacked. This helps distinguish type variable tuples from normal type variables::
pt_pt: Tuplos de variáveis de tipo *devem sempre* ser descompactados. Isto ajuda a distinguir tuplos de variáveis de tipo de variáveis de tipo normais::

source: x: Ts # Not valid x: tuple[Ts] # Not valid x: tuple[*Ts] # The correct way to do it
pt_pt: x: Ts # Não válido x: tuple[Ts] # Não válido x: tuple[*Ts] # A forma correta de fazer

source: Type variable tuples can be used in the same contexts as normal type variables. For example, in class definitions, arguments, and return types::
pt_pt: Tuplos de variáveis de tipo podem ser usados nos mesmos contextos que variáveis de tipo normais. Por exemplo, em definições de classe, argumentos e tipos de retorno::

source: Type variable tuples can be happily combined with normal type variables:
pt_pt: Tuplos de variáveis de tipo podem ser combinados felizmente com variáveis de tipo normais:

source: class Array[DType, *Shape]: # This is fine pass class Array2[*Shape, DType]: # This would also be fine pass class Height: ... class Width: ... float_array_1d: Array[float, Height] = Array() # Totally fine int_array_2d: Array[int, Height, Width] = Array() # Yup, fine too
pt_pt: class Array[DType, *Shape]: # Isto está bem pass class Array2[*Shape, DType]: # Isto também estaria bem pass class Height: ... class Width: ... float_array_1d: Array[float, Height] = Array() # Totalmente bem int_array_2d: Array[int, Height, Width] = Array() # Sim, também está bem

source: However, note that at most one type variable tuple may appear in a single list of type arguments or type parameters::
pt_pt: No entanto, note que no máximo um tuplo de variáveis de tipo pode aparecer numa única lista de argumentos de tipo ou parâmetros de tipo::

source: x: tuple[*Ts, *Ts] # Not valid class Array[*Shape, *Shape]: # Not valid pass
pt_pt: x: tuple[*Ts, *Ts] # Não válido class Array[*Shape, *Shape]: # Não válido pass

source: Finally, an unpacked type variable tuple can be used as the type annotation of ``*args``::
pt_pt: Finalmente, um tuplo de variáveis de tipo descompactado pode ser usado como a anotação de tipo de ``*args``::

source: In contrast to non-unpacked annotations of ``*args`` - e.g. ``*args: int``, which would specify that *all* arguments are ``int`` - ``*args: *Ts`` enables reference to the types of the *individual* arguments in ``*args``. Here, this allows us to ensure the types of the ``*args`` passed to ``call_soon`` match the types of the (positional) arguments of ``callback``.
pt_pt: Em contraste com anotações não descompactadas de ``*args`` - por exemplo, ``*args: int``, que especificaria que *todos* os argumentos são ``int`` - ``*args: *Ts`` permite referenciar os tipos dos argumentos *individuais* em ``*args``. Aqui, isto permite-nos garantir que os tipos dos ``*args`` passados para ``call_soon`` correspondem aos tipos dos argumentos (posicionais) de ``callback``.

source: See :pep:`646` for more details on type variable tuples.
pt_pt: Veja :pep:`646` para mais detalhes sobre tuplos de variáveis de tipo.

source: The name of the type variable tuple.
pt_pt: O nome do tuplo de variáveis de tipo.

source: The default value of the type variable tuple, or :data:`typing.NoDefault` if it has no default.
pt_pt: O valor predefinido do tuplo de variáveis de tipo, ou :data:`typing.NoDefault` se não tiver um valor predefinido.

source: Return whether or not the type variable tuple has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
pt_pt: Retorna se o tuplo de variáveis de tipo tem ou não um valor predefinido. Isto é equivalente a verificar se :attr:`__default__` não é o singleton :data:`typing.NoDefault`, exceto que não força a avaliação do valor predefinido :ref:`avaliado preguiçosamente <lazy-evaluation>`.

source: Type variable tuples can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
pt_pt: Tuplos de variáveis de tipo podem agora ser declarados usando a :ref:`sintaxe de parâmetros de tipo <type-params>` introduzida pela :pep:`695`.

source: Parameter specification variable. A specialized version of :ref:`type variables <typevar>`.
pt_pt: Variável de especificação de parâmetros. Uma versão especializada de :ref:`variáveis de tipo <typevar>`.

source: In :ref:`type parameter lists <type-params>`, parameter specifications can be declared with two asterisks (``**``)::
pt_pt: Em :ref:`listas de parâmetros de tipo <type-params>`, as especificações de parâmetros podem ser declaradas com dois asteriscos (``**``)::

source: For compatibility with Python 3.11 and earlier, ``ParamSpec`` objects can also be created as follows::
pt_pt: Para compatibilidade com o Python 3.11 e versões anteriores, os objetos ``ParamSpec`` também podem ser criados da seguinte forma::
