Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: To denote a tuple which could be of *any* length, and in which all elements are of the same type ``T``, use the literal ellipsis ``...``: ``tuple[T, ...]``. To denote an empty tuple, use ``tuple[()]``. Using plain ``tuple`` as an annotation is equivalent to using ``tuple[Any, ...]``::
pt_pt: Para denotar um tuplo que pode ser de *qualquer* comprimento, e no qual todos os elementos são do mesmo tipo ``T``, use a reticência literal ``...``: ``tuple[T, ...]``. Para denotar um tuplo vazio, use ``tuple[()]``. Usar simplesmente ``tuple`` como uma anotação é equivalente a usar ``tuple[Any, ...]``::

source: x: tuple[int, ...] = (1, 2) # These reassignments are OK: ``tuple[int, ...]`` indicates x can be of any length x = (1, 2, 3) x = () # This reassignment is an error: all elements in ``x`` must be ints x = ("foo", "bar") # ``y`` can only ever be assigned to an empty tuple y: tuple[()] = () z: tuple = ("foo", "bar") # These reassignments are OK: plain ``tuple`` is equivalent to ``tuple[Any, ...]`` z = (1, 2, 3) z = ()
pt_pt: x: tuple[int, ...] = (1, 2) # Estas reatribuições estão OK: ``tuple[int, ...]`` indica que x pode ser de qualquer comprimento x = (1, 2, 3) x = () # Esta reatribuição é um erro: todos os elementos em ``x`` devem ser ints x = ("foo", "bar") # ``y`` só pode ser atribuído a um tuplo vazio y: tuple[()] = () z: tuple = ("foo", "bar") # Estas reatribuições estão OK: ``tuple`` simples é equivalente a ``tuple[Any, ...]`` z = (1, 2, 3) z = ()

source: The type of class objects
pt_pt: O tipo de objetos de classe

source: A variable annotated with ``C`` may accept a value of type ``C``. In contrast, a variable annotated with ``type[C]`` (or deprecated :class:`typing.Type[C] <Type>`) may accept values that are classes themselves -- specifically, it will accept the *class object* of ``C``. For example::
pt_pt: Uma variável anotada com ``C`` pode aceitar um valor do tipo ``C``. Em contraste, uma variável anotada com ``type[C]`` (ou o obsoleto :class:`typing.Type[C] <Type>`) pode aceitar valores que são classes elas próprias -- especificamente, aceitará o *objeto de classe* de ``C``. Por exemplo::

source: a = 3 # Has type ``int`` b = int # Has type ``type[int]`` c = type(a) # Also has type ``type[int]``
pt_pt: a = 3 # Tem tipo ``int`` b = int # Tem tipo ``type[int]`` c = type(a) # Também tem tipo ``type[int]``

source: Note that ``type[C]`` is covariant::
pt_pt: Note que ``type[C]`` é covariante::

source: class User: ... class ProUser(User): ... class TeamUser(User): ... def make_new_user(user_class: type[User]) -> User: # ... return user_class() make_new_user(User) # OK make_new_user(ProUser) # Also OK: ``type[ProUser]`` is a subtype of ``type[User]`` make_new_user(TeamUser) # Still fine make_new_user(User()) # Error: expected ``type[User]`` but got ``User`` make_new_user(int) # Error: ``type[int]`` is not a subtype of ``type[User]``
pt_pt: class User: ... class ProUser(User): ... class TeamUser(User): ... def make_new_user(user_class: type[User]) -> User: # ... return user_class() make_new_user(User) # OK make_new_user(ProUser) # Também OK: ``type[ProUser]`` é um subtipo de ``type[User]`` make_new_user(TeamUser) # Ainda bem make_new_user(User()) # Erro: esperado ``type[User]`` mas obtido ``User`` make_new_user(int) # Erro: ``type[int]`` não é um subtipo de ``type[User]``

source: The only legal parameters for :class:`type` are classes, :data:`Any`, :ref:`type variables <generics>`, and unions of any of these types. For example::
pt_pt: Os únicos parâmetros legais para :class:`type` são classes, :data:`Any`, :ref:`variáveis de tipo <generics>`, e uniões de qualquer um destes tipos. Por exemplo::

source: def new_non_team_user(user_class: type[BasicUser | ProUser]): ... new_non_team_user(BasicUser) # OK new_non_team_user(ProUser) # OK new_non_team_user(TeamUser) # Error: ``type[TeamUser]`` is not a subtype # of ``type[BasicUser | ProUser]`` new_non_team_user(User) # Also an error
pt_pt: def new_non_team_user(user_class: type[BasicUser | ProUser]): ... new_non_team_user(BasicUser) # OK new_non_team_user(ProUser) # OK new_non_team_user(TeamUser) # Erro: ``type[TeamUser]`` não é um subtipo # de ``type[BasicUser | ProUser]`` new_non_team_user(User) # Também um erro

source: ``type[Any]`` is equivalent to :class:`type`, which is the root of Python's :ref:`metaclass hierarchy <metaclasses>`.
pt_pt: ``type[Any]`` é equivalente a :class:`type`, que é a raiz da hierarquia de :ref:`metaclasses <metaclasses>` do Python.

source: Annotating generators and coroutines
pt_pt: Anotar geradores e corrotinas

source: A generator can be annotated using the generic type :class:`Generator[YieldType, SendType, ReturnType] <collections.abc.Generator>`. For example::
pt_pt: Um gerador pode ser anotado usando o tipo genérico :class:`Generator[YieldType, SendType, ReturnType] <collections.abc.Generator>`. Por exemplo::

source: Note that unlike many other generic classes in the standard library, the ``SendType`` of :class:`~collections.abc.Generator` behaves contravariantly, not covariantly or invariantly.
pt_pt: Note que, ao contrário de muitas outras classes genéricas na biblioteca padrão, o ``SendType`` de :class:`~collections.abc.Generator` comporta-se de forma contravariante, não covariante ou invariante.

source: The ``SendType`` and ``ReturnType`` parameters default to :const:`!None`::
pt_pt: Os parâmetros ``SendType`` e ``ReturnType`` têm como predefinição :const:`!None`::

source: It is also possible to set these types explicitly::
pt_pt: Também é possível definir estes tipos explicitamente::

source: Simple generators that only ever yield values can also be annotated as having a return type of either :class:`Iterable[YieldType] <collections.abc.Iterable>` or :class:`Iterator[YieldType] <collections.abc.Iterator>`::
pt_pt: Geradores simples que apenas produzem valores também podem ser anotados como tendo um tipo de retorno de :class:`Iterable[YieldType] <collections.abc.Iterable>` ou :class:`Iterator[YieldType] <collections.abc.Iterator>`::

source: Async generators are handled in a similar fashion, but don't expect a ``ReturnType`` type argument (:class:`AsyncGenerator[YieldType, SendType] <collections.abc.AsyncGenerator>`). The ``SendType`` argument defaults to :const:`!None`, so the following definitions are equivalent::
pt_pt: Os geradores assíncronos são tratados de forma semelhante, mas não esperam um argumento de tipo ``ReturnType`` (:class:`AsyncGenerator[YieldType, SendType] <collections.abc.AsyncGenerator>`). O argumento ``SendType`` tem como predefinição :const:`!None`, pelo que as seguintes definições são equivalentes::

source: As in the synchronous case, :class:`AsyncIterable[YieldType] <collections.abc.AsyncIterable>` and :class:`AsyncIterator[YieldType] <collections.abc.AsyncIterator>` are available as well::
pt_pt: Como no caso síncrono, :class:`AsyncIterable[YieldType] <collections.abc.AsyncIterable>` e :class:`AsyncIterator[YieldType] <collections.abc.AsyncIterator>` também estão disponíveis::

source: Coroutines can be annotated using :class:`Coroutine[YieldType, SendType, ReturnType] <collections.abc.Coroutine>`. Generic arguments correspond to those of :class:`~collections.abc.Generator`, for example::
pt_pt: As corrotinas podem ser anotadas usando :class:`Coroutine[YieldType, SendType, ReturnType] <collections.abc.Coroutine>`. Os argumentos genéricos correspondem aos de :class:`~collections.abc.Generator`, por exemplo::

source: from collections.abc import Coroutine c: Coroutine[list[str], str, int] # Some coroutine defined elsewhere x = c.send('hi') # Inferred type of 'x' is list[str] async def bar() -> None: y = await c # Inferred type of 'y' is int
pt_pt: from collections.abc import Coroutine c: Coroutine[list[str], str, int] # Alguma corrotina definida noutro local x = c.send('hi') # Tipo inferido de 'x' é list[str] async def bar() -> None: y = await c # Tipo inferido de 'y' é int

source: User-defined generic types
pt_pt: Tipos genéricos definidos pelo utilizador

source: A user-defined class can be defined as a generic class.
pt_pt: Uma classe definida pelo utilizador pode ser definida como uma classe genérica.

source: This syntax indicates that the class ``LoggedVar`` is parameterised around a single :ref:`type variable <typevar>` ``T`` . This also makes ``T`` valid as a type within the class body.
pt_pt: Esta sintaxe indica que a classe ``LoggedVar`` é parametrizada em torno de uma única :ref:`variável de tipo <typevar>` ``T``. Isto também torna ``T`` válido como um tipo dentro do corpo da classe.

source: Generic classes implicitly inherit from :class:`Generic`. For compatibility with Python 3.11 and lower, it is also possible to inherit explicitly from :class:`Generic` to indicate a generic class::
pt_pt: As classes genéricas herdam implicitamente de :class:`Generic`. Para compatibilidade com o Python 3.11 e versões anteriores, também é possível herdar explicitamente de :class:`Generic` para indicar uma classe genérica::

source: Generic classes have :meth:`~object.__class_getitem__` methods, meaning they can be parameterised at runtime (e.g. ``LoggedVar[int]`` below)::
pt_pt: As classes genéricas têm métodos :meth:`~object.__class_getitem__`, o que significa que podem ser parametrizadas em tempo de execução (por exemplo, ``LoggedVar[int]`` abaixo)::

source: A generic type can have any number of type variables. All varieties of :class:`TypeVar` are permissible as parameters for a generic type::
pt_pt: Um tipo genérico pode ter qualquer número de variáveis de tipo. Todas as variedades de :class:`TypeVar` são permissíveis como parâmetros para um tipo genérico::

source: Each type variable argument to :class:`Generic` must be distinct. This is thus invalid::
pt_pt: Cada argumento de variável de tipo para :class:`Generic` deve ser distinto. Isto é, portanto, inválido::

source: from typing import TypeVar, Generic ... class Pair[M, M]: # SyntaxError ... T = TypeVar('T') class Pair(Generic[T, T]): # INVALID ...
pt_pt: from typing import TypeVar, Generic ... class Pair[M, M]: # SyntaxError ... T = TypeVar('T') class Pair(Generic[T, T]): # INVÁLIDO ...

source: Generic classes can also inherit from other classes::
pt_pt: As classes genéricas também podem herdar de outras classes::

source: When inheriting from generic classes, some type parameters could be fixed::
pt_pt: Ao herdar de classes genéricas, alguns parâmetros de tipo podem ser fixos::

source: In this case ``MyDict`` has a single parameter, ``T``.
pt_pt: Neste caso, ``MyDict`` tem um único parâmetro, ``T``.

source: Using a generic class without specifying type parameters assumes :data:`Any` for each position. In the following example, ``MyIterable`` is not generic but implicitly inherits from ``Iterable[Any]``:
pt_pt: Usar uma classe genérica sem especificar parâmetros de tipo assume :data:`Any` para cada posição. No exemplo seguinte, ``MyIterable`` não é genérica, mas herda implicitamente de ``Iterable[Any]``:

source: from collections.abc import Iterable class MyIterable(Iterable): # Same as Iterable[Any] ...
pt_pt: from collections.abc import Iterable class MyIterable(Iterable): # O mesmo que Iterable[Any] ...

source: User-defined generic type aliases are also supported. Examples::
pt_pt: Os aliases de tipo genéricos definidos pelo utilizador também são suportados. Exemplos::

source: from collections.abc import Iterable type Response[S] = Iterable[S] | int # Return type here is same as Iterable[str] | int def response(query: str) -> Response[str]: ... type Vec[T] = Iterable[tuple[T, T]] def inproduct[T: (int, float, complex)](v: Vec[T]) -> T: # Same as Iterable[tuple[T, T]] return sum(x*y for x, y in v)
pt_pt: from collections.abc import Iterable type Response[S] = Iterable[S] | int # O tipo de retorno aqui é o mesmo que Iterable[str] | int def response(query: str) -> Response[str]: ... type Vec[T] = Iterable[tuple[T, T]] def inproduct[T: (int, float, complex)](v: Vec[T]) -> T: # O mesmo que Iterable[tuple[T, T]] return sum(x*y for x, y in v)

source: For backward compatibility, generic type aliases can also be created through a simple assignment::
pt_pt: Para compatibilidade retroativa, os aliases de tipo genéricos também podem ser criados através de uma atribuição simples::

source: :class:`Generic` no longer has a custom metaclass.
pt_pt: :class:`Generic` já não tem uma metaclasse personalizada.

source: Syntactic support for generics and type aliases is new in version 3.12. Previously, generic classes had to explicitly inherit from :class:`Generic` or contain a type variable in one of their bases.
pt_pt: O suporte sintático para genéricos e aliases de tipo é novo na versão 3.12. Anteriormente, as classes genéricas tinham de herdar explicitamente de :class:`Generic` ou conter uma variável de tipo em uma das suas bases.

source: User-defined generics for parameter expressions are also supported via parameter specification variables in the form ``[**P]``. The behavior is consistent with type variables' described above as parameter specification variables are treated by the :mod:`!typing` module as a specialized type variable. The one exception to this is that a list of types can be used to substitute a :class:`ParamSpec`::
pt_pt: Os genéricos definidos pelo utilizador para expressões de parâmetros também são suportados através de variáveis de especificação de parâmetros na forma ``[**P]``. O comportamento é consistente com o das variáveis de tipo descritas acima, uma vez que as variáveis de especificação de parâmetros são tratadas pelo módulo :mod:`!typing` como uma variável de tipo especializada. A única exceção é que uma lista de tipos pode ser usada para substituir um :class:`ParamSpec`::

source: >>> class Z[T, **P]: ... # T is a TypeVar; P is a ParamSpec ... >>> Z[int, [dict, float]] __main__.Z[int, [dict, float]]
pt_pt: >>> class Z[T, **P]: ... # T é um TypeVar; P é um ParamSpec ... >>> Z[int, [dict, float]] __main__.Z[int, [dict, float]]

source: Classes generic over a :class:`ParamSpec` can also be created using explicit inheritance from :class:`Generic`. In this case, ``**`` is not used::
pt_pt: Classes genéricas sobre um :class:`ParamSpec` também podem ser criadas usando herança explícita de :class:`Generic`. Neste caso, ``**`` não é usado::

source: Another difference between :class:`TypeVar` and :class:`ParamSpec` is that a generic with only one parameter specification variable will accept parameter lists in the forms ``X[[Type1, Type2, ...]]`` and also ``X[Type1, Type2, ...]`` for aesthetic reasons. Internally, the latter is converted to the former, so the following are equivalent::
pt_pt: Outra diferença entre :class:`TypeVar` e :class:`ParamSpec` é que um genérico com apenas uma variável de especificação de parâmetros aceitará listas de parâmetros nas formas ``X[[Type1, Type2, ...]]`` e também ``X[Type1, Type2, ...]`` por razões estéticas. Internamente, esta última é convertida na primeira, pelo que as seguintes são equivalentes::

source: Note that generics with :class:`ParamSpec` may not have correct ``__parameters__`` after substitution in some cases because they are intended primarily for static type checking.
pt_pt: Note que os genéricos com :class:`ParamSpec` podem não ter ``__parameters__`` corretos após a substituição em alguns casos, uma vez que são destinados principalmente para verificação de tipo estática.

source: :class:`Generic` can now be parameterized over parameter expressions. See :class:`ParamSpec` and :pep:`612` for more details.
pt_pt: :class:`Generic` pode agora ser parametrizado sobre expressões de parâmetros. Veja :class:`ParamSpec` e :pep:`612` para mais detalhes.

source: A user-defined generic class can have ABCs as base classes without a metaclass conflict. Generic metaclasses are not supported. The outcome of parameterizing generics is cached, and most types in the :mod:`!typing` module are :term:`hashable` and comparable for equality.
pt_pt: Uma classe genérica definida pelo utilizador pode ter ABCs como classes base sem conflito de metaclasse. Metaclasses genéricas não são suportadas. O resultado da parametrização de genéricos é armazenado em cache, e a maioria dos tipos no módulo :mod:`!typing` são :term:`hashable` e comparáveis para igualdade.

source: The :data:`Any` type
pt_pt: O tipo :data:`Any`

source: A special kind of type is :data:`Any`. A static type checker will treat every type as being compatible with :data:`Any` and :data:`Any` as being compatible with every type.
pt_pt: Um tipo especial é :data:`Any`. Um verificador de tipo estático tratará todos os tipos como sendo compatíveis com :data:`Any` e :data:`Any` como sendo compatível com todos os tipos.

source: This means that it is possible to perform any operation or method call on a value of type :data:`Any` and assign it to any variable::
pt_pt: Isto significa que é possível realizar qualquer operação ou chamada de método num valor do tipo :data:`Any` e atribuí-lo a qualquer variável::

source: from typing import Any a: Any = None a = [] # OK a = 2 # OK s: str = '' s = a # OK def foo(item: Any) -> int: # Passes type checking; 'item' could be any type, # and that type might have a 'bar' method item.bar() ...
pt_pt: from typing import Any a: Any = None a = [] # OK a = 2 # OK s: str = '' s = a # OK def foo(item: Any) -> int: # Passa verificação de tipo; 'item' pode ser de qualquer tipo, # e esse tipo pode ter um método 'bar' item.bar() ...

source: Notice that no type checking is performed when assigning a value of type :data:`Any` to a more precise type. For example, the static type checker did not report an error when assigning ``a`` to ``s`` even though ``s`` was declared to be of type :class:`str` and receives an :class:`int` value at runtime!
pt_pt: Note que nenhuma verificação de tipo é realizada ao atribuir um valor do tipo :data:`Any` a um tipo mais preciso. Por exemplo, o verificador de tipo estático não reportou um erro ao atribuir ``a`` a ``s``, mesmo que ``s`` tenha sido declarado como sendo do tipo :class:`str` e receba um valor :class:`int` em tempo de execução!

source: Furthermore, all functions without a return type or parameter types will implicitly default to using :data:`Any`::
pt_pt: Além disso, todas as funções sem um tipo de retorno ou tipos de parâmetros usarão implicitamente :data:`Any` como predefinição::

source: def legacy_parser(text): ... return data # A static type checker will treat the above # as having the same signature as: def legacy_parser(text: Any) -> Any: ... return data
pt_pt: def legacy_parser(text): ... return data # Um verificador de tipo estático tratará o acima # como tendo a mesma assinatura que: def legacy_parser(text: Any) -> Any: ... return data

source: This behavior allows :data:`Any` to be used as an *escape hatch* when you need to mix dynamically and statically typed code.
pt_pt: Este comportamento permite que :data:`Any` seja usado como uma *válvula de escape* quando precisa misturar código tipado dinamicamente e estaticamente.

source: Contrast the behavior of :data:`Any` with the behavior of :class:`object`. Similar to :data:`Any`, every type is a subtype of :class:`object`. However, unlike :data:`Any`, the reverse is not true: :class:`object` is *not* a subtype of every other type.
pt_pt: Contraste o comportamento de :data:`Any` com o comportamento de :class:`object`. Semelhante a :data:`Any`, todos os tipos são subtipos de :class:`object`. No entanto, ao contrário de :data:`Any`, o inverso não é verdadeiro: :class:`object` não é um subtipo de todos os outros tipos.

source: That means when the type of a value is :class:`object`, a type checker will reject almost all operations on it, and assigning it to a variable (or using it as a return value) of a more specialized type is a type error. For example::
pt_pt: Isto significa que quando o tipo de um valor é :class:`object`, um verificador de tipo rejeitará quase todas as operações sobre ele, e atribuí-lo a uma variável (ou usá-lo como um valor de retorno) de um tipo mais especializado é um erro de tipo. Por exemplo::

source: def hash_a(item: object) -> int: # Fails type checking; an object does not have a 'magic' method. item.magic() ... def hash_b(item: Any) -> int: # Passes type checking item.magic() ... # Passes type checking, since ints and strs are subclasses of object hash_a(42) hash_a("foo") # Passes type checking, since Any is compatible with all types hash_b(42) hash_b("foo")
pt_pt: def hash_a(item: object) -> int: # Falha verificação de tipo; um object não tem um método 'magic'. item.magic() ... def hash_b(item: Any) -> int: # Passa verificação de tipo item.magic() ... # Passa verificação de tipo, uma vez que ints e strs são subclasses de object hash_a(42) hash_a("foo") # Passa verificação de tipo, uma vez que Any é compatível com todos os tipos hash_b(42) hash_b("foo")

source: Use :class:`object` to indicate that a value could be any type in a typesafe manner. Use :data:`Any` to indicate that a value is dynamically typed.
pt_pt: Use :class:`object` para indicar que um valor pode ser de qualquer tipo de uma forma segura em termos de tipo. Use :data:`Any` para indicar que um valor é tipado dinamicamente.

source: Nominal vs structural subtyping
pt_pt: Subtipagem nominal vs subtipagem estrutural

source: Initially :pep:`484` defined the Python static type system as using *nominal subtyping*. This means that a class ``A`` is allowed where a class ``B`` is expected if and only if ``A`` is a subclass of ``B``.
pt_pt: Inicialmente, :pep:`484` definiu o sistema de tipos estáticos do Python como usando *subtipagem nominal*. Isto significa que uma classe ``A`` é permitida onde uma classe ``B`` é esperada se e somente se ``A`` é uma subclasse de ``B``.

source: This requirement previously also applied to abstract base classes, such as :class:`~collections.abc.Iterable`. The problem with this approach is that a class had to be explicitly marked to support them, which is unpythonic and unlike what one would normally do in idiomatic dynamically typed Python code. For example, this conforms to :pep:`484`::
pt_pt: Este requisito aplicava-se anteriormente também a classes base abstratas, como :class:`~collections.abc.Iterable`. O problema com esta abordagem é que uma classe tinha de ser explicitamente marcada para as suportar, o que é não é pythónico e diferente do que normalmente se faz em código Python tipado dinamicamente idiomático. Por exemplo, isto está em conformidade com :pep:`484`::

source: :pep:`544` allows to solve this problem by allowing users to write the above code without explicit base classes in the class definition, allowing ``Bucket`` to be implicitly considered a subtype of both ``Sized`` and ``Iterable[int]`` by static type checkers. This is known as *structural subtyping* (or static duck-typing)::
pt_pt: :pep:`544` permite resolver este problema ao permitir que os utilizadores escrevam o código acima sem classes base explícitas na definição da classe, permitindo que ``Bucket`` seja implicitamente considerado um subtipo de ``Sized`` e ``Iterable[int]`` pelos verificadores de tipo estáticos. Isto é conhecido como *subtipagem estrutural* (ou duck-typing estático)::

source: from collections.abc import Iterator, Iterable class Bucket: # Note: no base classes ... def __len__(self) -> int: ... def __iter__(self) -> Iterator[int]: ... def collect(items: Iterable[int]) -> int: ... result = collect(Bucket()) # Passes type check
pt_pt: from collections.abc import Iterator, Iterable class Bucket: # Note: sem classes base ... def __len__(self) -> int: ... def __iter__(self) -> Iterator[int]: ... def collect(items: Iterable[int]) -> int: ... result = collect(Bucket()) # Passa verificação de tipo
