Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: class Point2D(TypedDict): x: int y: int label: NotRequired[str] # Alternative syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int, 'label': NotRequired[str]})
pt_pt: class Point2D(TypedDict): x: int y: int label: NotRequired[str] # Sintaxe alternativa Point2D = TypedDict('Point2D', {'x': int, 'y': int, 'label': NotRequired[str]})

source: This means that a ``Point2D`` ``TypedDict`` can have the ``label`` key omitted.
pt_pt: Isto significa que um ``Point2D`` ``TypedDict`` pode omitir a chave ``label``.

source: It is also possible to mark all keys as non-required by default by specifying a totality of ``False``::
pt_pt: Também é possível marcar todas as chaves como não obrigatórias por predefinição, especificando um total de ``False``::

source: class Point2D(TypedDict, total=False): x: int y: int # Alternative syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int}, total=False)
pt_pt: class Point2D(TypedDict, total=False): x: int y: int # Sintaxe alternativa Point2D = TypedDict('Point2D', {'x': int, 'y': int}, total=False)

source: This means that a ``Point2D`` ``TypedDict`` can have any of the keys omitted. A type checker is only expected to support a literal ``False`` or ``True`` as the value of the ``total`` argument. ``True`` is the default, and makes all items defined in the class body required.
pt_pt: Isto significa que um ``Point2D`` ``TypedDict`` pode omitir qualquer uma das chaves. Espera-se que um verificador de tipo suporte apenas ``False`` ou ``True`` literais como valor do argumento ``total``. ``True`` é o valor predefinido e torna todos os itens definidos no corpo da classe obrigatórios.

source: Individual keys of a ``total=False`` ``TypedDict`` can be marked as required using :data:`Required`::
pt_pt: Chaves individuais de um ``TypedDict`` com ``total=False`` podem ser marcadas como obrigatórias usando :data:`Required`::

source: class Point2D(TypedDict, total=False): x: Required[int] y: Required[int] label: str # Alternative syntax Point2D = TypedDict('Point2D', { 'x': Required[int], 'y': Required[int], 'label': str }, total=False)
pt_pt: class Point2D(TypedDict, total=False): x: Required[int] y: Required[int] label: str # Sintaxe alternativa Point2D = TypedDict('Point2D', { 'x': Required[int], 'y': Required[int], 'label': str }, total=False)

source: It is possible for a ``TypedDict`` type to inherit from one or more other ``TypedDict`` types using the class-based syntax. Usage::
pt_pt: É possível que um tipo ``TypedDict`` herde de um ou mais outros tipos ``TypedDict`` usando a sintaxe baseada em classes. Utilização::

source: ``Point3D`` has three items: ``x``, ``y`` and ``z``. It is equivalent to this definition::
pt_pt: ``Point3D`` tem três itens: ``x``, ``y`` e ``z``. É equivalente a esta definição::

source: A ``TypedDict`` cannot inherit from a non-\ ``TypedDict`` class, except for :class:`Generic`. For example::
pt_pt: Um ``TypedDict`` não pode herdar de uma classe que não seja ``TypedDict``, exceto de :class:`Generic`. Por exemplo::

source: class X(TypedDict): x: int class Y(TypedDict): y: int class Z(object): pass # A non-TypedDict class class XY(X, Y): pass # OK class XZ(X, Z): pass # raises TypeError
pt_pt: class X(TypedDict): x: int class Y(TypedDict): y: int class Z(object): pass # Uma classe não-TypedDict class XY(X, Y): pass # OK class XZ(X, Z): pass # levanta TypeError

source: A ``TypedDict`` can be generic::
pt_pt: Um ``TypedDict`` pode ser genérico::

source: To create a generic ``TypedDict`` that is compatible with Python 3.11 or lower, inherit from :class:`Generic` explicitly:
pt_pt: Para criar um ``TypedDict`` genérico compatível com Python 3.11 ou inferior, herde explicitamente de :class:`Generic`:

source: A ``TypedDict`` can be introspected via annotations dicts (see :ref:`annotations-howto` for more information on annotations best practices), :attr:`__total__`, :attr:`__required_keys__`, and :attr:`__optional_keys__`.
pt_pt: Um ``TypedDict`` pode ser introspecionado através de dicionários de anotações (veja :ref:`annotations-howto` para mais informações sobre as melhores práticas de anotações), :attr:`__total__`, :attr:`__required_keys__`, e :attr:`__optional_keys__`.

source: ``Point2D.__total__`` gives the value of the ``total`` argument. Example:
pt_pt: ``Point2D.__total__`` devolve o valor do argumento ``total``. Exemplo:

source: This attribute reflects *only* the value of the ``total`` argument to the current ``TypedDict`` class, not whether the class is semantically total. For example, a ``TypedDict`` with ``__total__`` set to ``True`` may have keys marked with :data:`NotRequired`, or it may inherit from another ``TypedDict`` with ``total=False``. Therefore, it is generally better to use :attr:`__required_keys__` and :attr:`__optional_keys__` for introspection.
pt_pt: Este atributo reflete *apenas* o valor do argumento ``total`` para a classe ``TypedDict`` atual, não se a classe é semanticamente total. Por exemplo, um ``TypedDict`` com ``__total__`` definido como ``True`` pode ter chaves marcadas com :data:`NotRequired`, ou pode herdar de outro ``TypedDict`` com ``total=False``. Portanto, é geralmente melhor usar :attr:`__required_keys__` e :attr:`__optional_keys__` para introspeção.

source: ``Point2D.__required_keys__`` and ``Point2D.__optional_keys__`` return :class:`frozenset` objects containing required and non-required keys, respectively.
pt_pt: ``Point2D.__required_keys__`` e ``Point2D.__optional_keys__`` devolvem objetos :class:`frozenset` contendo as chaves obrigatórias e não obrigatórias, respetivamente.

source: Keys marked with :data:`Required` will always appear in ``__required_keys__`` and keys marked with :data:`NotRequired` will always appear in ``__optional_keys__``.
pt_pt: Chaves marcadas com :data:`Required` aparecerão sempre em ``__required_keys__`` e chaves marcadas com :data:`NotRequired` aparecerão sempre em ``__optional_keys__``.

source: For backwards compatibility with Python 3.10 and below, it is also possible to use inheritance to declare both required and non-required keys in the same ``TypedDict`` . This is done by declaring a ``TypedDict`` with one value for the ``total`` argument and then inheriting from it in another ``TypedDict`` with a different value for ``total``:
pt_pt: Para compatibilidade com o Python 3.10 e versões anteriores, também é possível usar herança para declarar chaves obrigatórias e não obrigatórias no mesmo ``TypedDict``. Isto é feito declarando um ``TypedDict`` com um valor para o argumento ``total`` e depois herdando dele noutro ``TypedDict`` com um valor diferente para ``total``:

source: If ``from __future__ import annotations`` is used or if annotations are given as strings, annotations are not evaluated when the ``TypedDict`` is defined. Therefore, the runtime introspection that ``__required_keys__`` and ``__optional_keys__`` rely on may not work properly, and the values of the attributes may be incorrect.
pt_pt: Se ``from __future__ import annotations`` for usado ou se as anotações forem fornecidas como strings, as anotações não são avaliadas quando o ``TypedDict`` é definido. Portanto, a introspeção em tempo de execução em que ``__required_keys__`` e ``__optional_keys__`` dependem pode não funcionar corretamente, e os valores dos atributos podem estar incorretos.

source: Support for :data:`ReadOnly` is reflected in the following attributes:
pt_pt: O suporte para :data:`ReadOnly` é refletido nos seguintes atributos:

source: A :class:`frozenset` containing the names of all read-only keys. Keys are read-only if they carry the :data:`ReadOnly` qualifier.
pt_pt: Um :class:`frozenset` contendo os nomes de todas as chaves de apenas leitura. As chaves são de apenas leitura se tiverem o qualificador :data:`ReadOnly`.

source: A :class:`frozenset` containing the names of all mutable keys. Keys are mutable if they do not carry the :data:`ReadOnly` qualifier.
pt_pt: Um :class:`frozenset` contendo os nomes de todas as chaves mutáveis. As chaves são mutáveis se não tiverem o qualificador :data:`ReadOnly`.

source: Added support for marking individual keys as :data:`Required` or :data:`NotRequired`. See :pep:`655`.
pt_pt: Adicionado suporte para marcar chaves individuais como :data:`Required` ou :data:`NotRequired`. Veja :pep:`655`.

source: Added support for generic ``TypedDict``\ s.
pt_pt: Adicionado suporte para ``TypedDict`` genéricos.

source: Removed support for the keyword-argument method of creating ``TypedDict``\ s.
pt_pt: Removido suporte para o método de argumento nomeado de criação de ``TypedDict``.

source: Support for the :data:`ReadOnly` qualifier was added.
pt_pt: Adicionado suporte para o qualificador :data:`ReadOnly`.

source: When using the functional syntax to create a TypedDict class, failing to pass a value to the 'fields' parameter (``TD = TypedDict("TD")``) is deprecated. Passing ``None`` to the 'fields' parameter (``TD = TypedDict("TD", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a TypedDict class with 0 fields, use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})``.
pt_pt: Ao usar a sintaxe funcional para criar uma classe TypedDict, falhar ao passar um valor para o parâmetro 'fields' (``TD = TypedDict("TD")``) está obsoleto. Passar ``None`` para o parâmetro 'fields' (``TD = TypedDict("TD", None)``) também está obsoleto. Ambos serão proibidos no Python 3.15. Para criar uma classe TypedDict com 0 campos, use ``class TD(TypedDict): pass`` ou ``TD = TypedDict("TD", {})``.

source: Protocols
pt_pt: Protocolos

source: The following protocols are provided by the :mod:`!typing` module. All are decorated with :deco:`runtime_checkable`.
pt_pt: Os seguintes protocolos são fornecidos pelo módulo :mod:`!typing`. Todos estão decorados com :deco:`runtime_checkable`.

source: An ABC with one abstract method ``__abs__`` that is covariant in its return type.
pt_pt: Uma ABC com um método abstrato ``__abs__`` que é covariante no seu tipo de retorno.

source: An ABC with one abstract method ``__bytes__``.
pt_pt: Uma ABC com um método abstrato ``__bytes__``.

source: An ABC with one abstract method ``__complex__``.
pt_pt: Uma ABC com um método abstrato ``__complex__``.

source: An ABC with one abstract method ``__float__``.
pt_pt: Uma ABC com um método abstrato ``__float__``.

source: An ABC with one abstract method ``__index__``.
pt_pt: Uma ABC com um método abstrato ``__index__``.

source: An ABC with one abstract method ``__int__``.
pt_pt: Uma ABC com um método abstrato ``__int__``.

source: An ABC with one abstract method ``__round__`` that is covariant in its return type.
pt_pt: Uma ABC com um método abstrato ``__round__`` que é covariante no seu tipo de retorno.

source: Functions and decorators
pt_pt: Funções e decoradores

source: Cast a value to a type.
pt_pt: Converter um valor para um tipo.

source: This returns the value unchanged. To the type checker this signals that the return value has the designated type, but at runtime we intentionally don't check anything (we want this to be as fast as possible).
pt_pt: Isto devolve o valor inalterado. Para o verificador de tipo, isto sinaliza que o valor de retorno tem o tipo designado, mas em tempo de execução não verificamos nada intencionalmente (queremos que isto seja o mais rápido possível).

source: Ask a static type checker to confirm that *val* has an inferred type of *typ*.
pt_pt: Pedir a um verificador de tipo estático para confirmar que *val* tem um tipo inferido de *typ*.

source: At runtime this does nothing: it returns the first argument unchanged with no checks or side effects, no matter the actual type of the argument.
pt_pt: Em tempo de execução, isto não faz nada: devolve o primeiro argumento inalterado, sem verificações ou efeitos secundários, independentemente do tipo real do argumento.

source: When a static type checker encounters a call to ``assert_type()``, it emits an error if the value is not of the specified type::
pt_pt: Quando um verificador de tipo estático encontra uma chamada a ``assert_type()``, emite um erro se o valor não for do tipo especificado::

source: def greet(name: str) -> None: assert_type(name, str) # OK, inferred type of `name` is `str` assert_type(name, int) # type checker error
pt_pt: def greet(name: str) -> None: assert_type(name, str) # OK, o tipo inferido de `name` é `str` assert_type(name, int) # erro do verificador de tipo

source: This function is useful for ensuring the type checker's understanding of a script is in line with the developer's intentions::
pt_pt: Esta função é útil para garantir que a compreensão do verificador de tipo de um script está alinhada com as intenções do programador::

source: def complex_function(arg: object): # Do some complex type-narrowing logic, # after which we hope the inferred type will be `int` ... # Test whether the type checker correctly understands our function assert_type(arg, int)
pt_pt: def complex_function(arg: object): # Fazer alguma lógica complexa de redução de tipo, # após a qual esperamos que o tipo inferido seja `int` ... # Testar se o verificador de tipo compreende corretamente a nossa função assert_type(arg, int)

source: Ask a static type checker to confirm that a line of code is unreachable.
pt_pt: Pedir a um verificador de tipo estático para confirmar que uma linha de código é inalcançável.

source: Example::
pt_pt: Exemplo::

source: def int_or_str(arg: int | str) -> None: match arg: case int(): print("It's an int") case str(): print("It's a str") case _ as unreachable: assert_never(unreachable)
pt_pt: def int_or_str(arg: int | str) -> None: match arg: case int(): print("É um int") case str(): print("É uma str") case _ as unreachable: assert_never(unreachable)

source: Here, the annotations allow the type checker to infer that the last case can never execute, because ``arg`` is either an :class:`int` or a :class:`str`, and both options are covered by earlier cases.
pt_pt: Aqui, as anotações permitem que o verificador de tipo infira que o último caso nunca pode ser executado, porque ``arg`` é ou um :class:`int` ou uma :class:`str`, e ambas as opções estão cobertas por casos anteriores.

source: If a type checker finds that a call to ``assert_never()`` is reachable, it will emit an error. For example, if the type annotation for ``arg`` was instead ``int | str | float``, the type checker would emit an error pointing out that ``unreachable`` is of type :class:`float`. For a call to ``assert_never`` to pass type checking, the inferred type of the argument passed in must be the bottom type, :data:`Never`, and nothing else.
pt_pt: Se um verificador de tipo encontrar que uma chamada a ``assert_never()`` é alcançável, emitirá um erro. Por exemplo, se a anotação de tipo para ``arg`` fosse em vez disso ``int | str | float``, o verificador de tipo emitiria um erro indicando que ``unreachable`` é do tipo :class:`float`. Para que uma chamada a ``assert_never`` passe na verificação de tipo, o tipo inferido do argumento passado deve ser o tipo bottom, :data:`Never`, e nada mais.

source: At runtime, this throws an exception when called.
pt_pt: Em tempo de execução, isto lança uma exceção quando chamado.

source: `Unreachable Code and Exhaustiveness Checking <https://typing.python.org/en/latest/guides/unreachable.html>`__ has more information about exhaustiveness checking with static typing.
pt_pt: `Código Inalcançável e Verificação de Exaustividade <https://typing.python.org/en/latest/guides/unreachable.html>`__ tem mais informações sobre verificação de exaustividade com tipagem estática.

source: Ask a static type checker to reveal the inferred type of an expression.
pt_pt: Pedir a um verificador de tipo estático para revelar o tipo inferido de uma expressão.

source: When a static type checker encounters a call to this function, it emits a diagnostic with the inferred type of the argument. For example::
pt_pt: Quando um verificador de tipo estático encontra uma chamada a esta função, emite um diagnóstico com o tipo inferido do argumento. Por exemplo::

source: x: int = 1 reveal_type(x) # Revealed type is "builtins.int"
pt_pt: x: int = 1 reveal_type(x) # Tipo revelado é "builtins.int"

source: This can be useful when you want to debug how your type checker handles a particular piece of code.
pt_pt: Isto pode ser útil quando quer depurar como o seu verificador de tipo manipula um determinado trecho de código.

source: At runtime, this function prints the runtime type of its argument to :data:`sys.stderr` and returns the argument unchanged (allowing the call to be used within an expression)::
pt_pt: Em tempo de execução, esta função imprime o tipo de execução do seu argumento para :data:`sys.stderr` e devolve o argumento inalterado (permitindo que a chamada seja usada dentro de uma expressão)::

source: x = reveal_type(1) # prints "Runtime type is int" print(x) # prints "1"
pt_pt: x = reveal_type(1) # imprime "Runtime type is int" print(x) # imprime "1"

source: Note that the runtime type may be different from (more or less specific than) the type statically inferred by a type checker.
pt_pt: Note que o tipo de execução pode ser diferente (mais ou menos específico) do tipo inferido estaticamente por um verificador de tipo.

source: Most type checkers support ``reveal_type()`` anywhere, even if the name is not imported from ``typing``. Importing the name from ``typing``, however, allows your code to run without runtime errors and communicates intent more clearly.
pt_pt: A maioria dos verificadores de tipo suporta ``reveal_type()`` em qualquer lugar, mesmo que o nome não seja importado de ``typing``. No entanto, importar o nome de ``typing`` permite que o seu código seja executado sem erros de execução e comunica a intenção de forma mais clara.

source: Decorator to mark an object as providing :func:`dataclass <dataclasses.dataclass>`-like behavior.
pt_pt: Decorador para marcar um objeto como fornecendo comportamento semelhante a :func:`dataclass <dataclasses.dataclass>`.

source: ``dataclass_transform`` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class in a similar way to :deco:`dataclasses.dataclass`.
pt_pt: ``dataclass_transform`` pode ser usado para decorar uma classe, metaclasse, ou uma função que é ela própria um decorador. A presença de ``@dataclass_transform()`` indica a um verificador de tipo estático que o objeto decorado realiza "magia" em tempo de execução que transforma uma classe de forma semelhante a :deco:`dataclasses.dataclass`.

source: Example usage with a decorator function:
pt_pt: Exemplo de utilização com uma função decoradora:

source: On a base class::
pt_pt: Numa classe base::

source: On a metaclass::
pt_pt: Numa metaclasse::

source: The ``CustomerModel`` classes defined above will be treated by type checkers similarly to classes created with :deco:`dataclasses.dataclass`. For example, type checkers will assume these classes have ``__init__`` methods that accept ``id`` and ``name``.
pt_pt: As classes ``CustomerModel`` definidas acima serão tratadas pelos verificadores de tipo de forma semelhante às classes criadas com :deco:`dataclasses.dataclass`. Por exemplo, os verificadores de tipo assumirão que estas classes têm métodos ``__init__`` que aceitam ``id`` e ``name``.

source: The decorated class, metaclass, or function may accept the following bool arguments which type checkers will assume have the same effect as they would have on the :deco:`dataclasses.dataclass` decorator: ``init``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only``, and ``slots``. It must be possible for the value of these arguments (``True`` or ``False``) to be statically evaluated.
pt_pt: A classe, metaclasse ou função decorada pode aceitar os seguintes argumentos booleanos, que os verificadores de tipo assumirão ter o mesmo efeito que teriam no decorador :deco:`dataclasses.dataclass`: ``init``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only``, e ``slots``. Deve ser possível avaliar estaticamente o valor destes argumentos (``True`` ou ``False``).

source: The arguments to the ``dataclass_transform`` decorator can be used to customize the default behaviors of the decorated class, metaclass, or function:
pt_pt: Os argumentos do decorador ``dataclass_transform`` podem ser usados para personalizar os comportamentos predefinidos da classe, metaclasse ou função decorada:

source: Parameters
pt_pt: Parâmetros

source: Indicates whether the ``eq`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``True``.
pt_pt: Indica se o parâmetro ``eq`` é assumido como ``True`` ou ``False`` se for omitido pelo chamador. O valor predefinido é ``True``.

source: Indicates whether the ``order`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
pt_pt: Indica se o parâmetro ``order`` é assumido como ``True`` ou ``False`` se for omitido pelo chamador. O valor predefinido é ``False``.

source: Indicates whether the ``kw_only`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
pt_pt: Indica se o parâmetro ``kw_only`` é assumido como ``True`` ou ``False`` se for omitido pelo chamador. O valor predefinido é ``False``.

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``. .. versionadded:: 3.12
pt_pt: Indica se o parâmetro ``frozen`` é assumido como ``True`` ou ``False`` se for omitido pelo chamador. O valor predefinido é ``False``. .. versionadded:: 3.12

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
pt_pt: Indica se o parâmetro ``frozen`` é assumido como ``True`` ou ``False`` se for omitido pelo chamador. O valor predefinido é ``False``.

source: Specifies a static list of supported classes or functions that describe fields, similar to :func:`dataclasses.field`. Defaults to ``()``.
pt_pt: Especifica uma lista estática de classes ou funções suportadas que descrevem campos, semelhante a :func:`dataclasses.field`. O valor predefinido é ``()``.

source: Arbitrary other keyword arguments are accepted in order to allow for possible future extensions.
pt_pt: Outros argumentos nomeados arbitrários são aceites para permitir extensões futuras.

source: Type checkers recognize the following optional parameters on field specifiers:
pt_pt: Os verificadores de tipo reconhecem os seguintes parâmetros opcionais em especificadores de campo:

source: Parameter name
pt_pt: Nome do parâmetro

source: Description
pt_pt: Descrição

source: Indicates whether the field should be included in the synthesized ``__init__`` method. If unspecified, ``init`` defaults to ``True``.
pt_pt: Indica se o campo deve ser incluído no método ``__init__`` sintetizado. Se não especificado, ``init`` tem o valor predefinido ``True``.

source: Provides the default value for the field.
pt_pt: Fornece o valor predefinido para o campo.

source: Provides a runtime callback that returns the default value for the field. If neither ``default`` nor ``default_factory`` are specified, the field is assumed to have no default value and must be provided a value when the class is instantiated.
pt_pt: Fornece uma função de retorno em tempo de execução que devolve o valor predefinido para o campo. Se nem ``default`` nem ``default_factory`` forem especificados, assume-se que o campo não tem valor predefinido e deve ser fornecido um valor quando a classe é instanciada.
