Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: Moreover, by subclassing a special class :class:`Protocol`, a user can define new custom protocols to fully enjoy structural subtyping (see examples below).
pt_pt: Além disso, ao criar uma subclasse da classe especial :class:`Protocol`, um utilizador pode definir novos protocolos personalizados para usufruir plenamente da subtipagem estrutural (veja os exemplos abaixo).

source: Module contents
pt_pt: Conteúdos do módulo

source: The ``typing`` module defines the following classes, functions and decorators.
pt_pt: O módulo ``typing`` define as seguintes classes, funções e decoradores.

source: Special typing primitives
pt_pt: Primitivas especiais de tipagem

source: Special types
pt_pt: Tipos especiais

source: These can be used as types in annotations. They do not support subscription using ``[]``.
pt_pt: Estes podem ser usados como tipos em anotações. Não suportam subíndices usando ``[]``.

source: Special type indicating an unconstrained type.
pt_pt: Tipo especial que indica um tipo não restrito.

source: Every type is compatible with :data:`Any`.
pt_pt: Todos os tipos são compatíveis com :data:`Any`.

source: :data:`Any` is compatible with every type.
pt_pt: :data:`Any` é compatível com todos os tipos.

source: :data:`Any` can now be used as a base class. This can be useful for avoiding type checker errors with classes that can duck type anywhere or are highly dynamic.
pt_pt: :data:`Any` pode agora ser usado como uma classe base. Isto pode ser útil para evitar erros do verificador de tipo com classes que podem fazer duck typing em qualquer lugar ou são altamente dinâmicas.

source: A :ref:`constrained type variable <typing-constrained-typevar>`.
pt_pt: Uma :ref:`variável de tipo restrita <typing-constrained-typevar>`.

source: Definition::
pt_pt: Definição::

source: ``AnyStr`` is meant to be used for functions that may accept :class:`str` or :class:`bytes` arguments but cannot allow the two to mix.
pt_pt: ``AnyStr`` destina-se a ser usado para funções que podem aceitar argumentos :class:`str` ou :class:`bytes`, mas não podem permitir que os dois sejam misturados.

source: For example::
pt_pt: Por exemplo::

source: def concat(a: AnyStr, b: AnyStr) -> AnyStr: return a + b concat("foo", "bar") # OK, output has type 'str' concat(b"foo", b"bar") # OK, output has type 'bytes' concat("foo", b"bar") # Error, cannot mix str and bytes
pt_pt: def concat(a: AnyStr, b: AnyStr) -> AnyStr: return a + b concat("foo", "bar") # OK, saída tem tipo 'str' concat(b"foo", b"bar") # OK, saída tem tipo 'bytes' concat("foo", b"bar") # Erro, não pode misturar str e bytes

source: Note that, despite its name, ``AnyStr`` has nothing to do with the :class:`Any` type, nor does it mean "any string". In particular, ``AnyStr`` and ``str | bytes`` are different from each other and have different use cases::
pt_pt: Note que, apesar do seu nome, ``AnyStr`` não tem nada a ver com o tipo :class:`Any`, nem significa "qualquer string". Em particular, ``AnyStr`` e ``str | bytes`` são diferentes um do outro e têm casos de uso diferentes::

source: # Invalid use of AnyStr: # The type variable is used only once in the function signature, # so cannot be "solved" by the type checker def greet_bad(cond: bool) -> AnyStr: return "hi there!" if cond else b"greetings!" # The better way of annotating this function: def greet_proper(cond: bool) -> str | bytes: return "hi there!" if cond else b"greetings!"
pt_pt: # Uso inválido de AnyStr: # A variável de tipo é usada apenas uma vez na assinatura da função, # pelo que não pode ser "resolvida" pelo verificador de tipo def greet_bad(cond: bool) -> AnyStr: return "hi there!" if cond else b"greetings!" # A melhor forma de anotar esta função: def greet_proper(cond: bool) -> str | bytes: return "hi there!" if cond else b"greetings!"

source: Deprecated in favor of the new :ref:`type parameter syntax <type-params>`. Use ``class A[T: (str, bytes)]: ...`` instead of importing ``AnyStr``. See :pep:`695` for more details.
pt_pt: Obsoleto em favor da nova :ref:`sintaxe de parâmetros de tipo <type-params>`. Use ``class A[T: (str, bytes)]: ...`` em vez de importar ``AnyStr``. Veja :pep:`695` para mais detalhes.

source: In Python 3.16, ``AnyStr`` will be removed from ``typing.__all__``, and deprecation warnings will be emitted at runtime when it is accessed or imported from ``typing``. ``AnyStr`` will be removed from ``typing`` in Python 3.18.
pt_pt: No Python 3.16, ``AnyStr`` será removido de ``typing.__all__``, e avisos de obsolescência serão emitidos em tempo de execução quando for acedido ou importado de ``typing``. ``AnyStr`` será removido de ``typing`` no Python 3.18.

source: Special type that includes only literal strings.
pt_pt: Tipo especial que inclui apenas strings literais.

source: Any string literal is compatible with ``LiteralString``, as is another ``LiteralString``. However, an object typed as just ``str`` is not. A string created by composing ``LiteralString``-typed objects is also acceptable as a ``LiteralString``.
pt_pt: Qualquer literal de string é compatível com ``LiteralString``, assim como outro ``LiteralString``. No entanto, um objeto tipado apenas como ``str`` não é. Uma string criada pela composição ``LiteralString``-typed objects is also acceptable as a ``LiteralString``

source: Example:
pt_pt: Exemplo:

source: def run_query(sql: LiteralString) -> None: ... def caller(arbitrary_string: str, literal_string: LiteralString) -> None: run_query("SELECT * FROM students") # OK run_query(literal_string) # OK run_query("SELECT * FROM " + literal_string) # OK run_query(arbitrary_string) # type checker error run_query( # type checker error f"SELECT * FROM students WHERE name = {arbitrary_string}" )
pt_pt: def run_query(sql: LiteralString) -> None: ... def caller(arbitrary_string: str, literal_string: LiteralString) -> None: run_query("SELECT * FROM students") # OK run_query(literal_string) # OK run_query("SELECT * FROM " + literal_string) # OK run_query(arbitrary_string) # erro do verificador de tipo run_query( # erro do verificador de tipo f"SELECT * FROM students WHERE name = {arbitrary_string}" )

source: ``LiteralString`` is useful for sensitive APIs where arbitrary user-generated strings could generate problems. For example, the two cases above that generate type checker errors could be vulnerable to an SQL injection attack.
pt_pt: ``LiteralString`` é útil para APIs sensíveis onde strings geradas arbitrariamente pelo utilizador poderiam gerar problemas. Por exemplo, os dois casos acima que geram erros do verificador de tipo poderiam ser vulneráveis a um ataque de injeção SQL.

source: See :pep:`675` for more details.
pt_pt: Veja :pep:`675` para mais detalhes.

source: :data:`!Never` and :data:`!NoReturn` represent the `bottom type <https://en.wikipedia.org/wiki/Bottom_type>`_, a type that has no members.
pt_pt: :data:`!Never` e :data:`!NoReturn` representam o `tipo inferior <https://en.wikipedia.org/wiki/Bottom_type>`_, um tipo que não tem membros.

source: They can be used to indicate that a function never returns, such as :func:`sys.exit`::
pt_pt: Podem ser usados para indicar que uma função nunca retorna, como :func:`sys.exit`::

source: from typing import Never # or NoReturn def stop() -> Never: raise RuntimeError('no way')
pt_pt: from typing import Never # ou NoReturn def stop() -> Never: raise RuntimeError('no way')

source: Or to define a function that should never be called, as there are no valid arguments, such as :func:`assert_never`::
pt_pt: Ou para definir uma função que nunca deve ser chamada, uma vez que não há argumentos válidos, como :func:`assert_never`::

source: from typing import Never # or NoReturn def never_call_me(arg: Never) -> None: pass def int_or_str(arg: int | str) -> None: never_call_me(arg) # type checker error match arg: case int(): print("It's an int") case str(): print("It's a str") case _: never_call_me(arg) # OK, arg is of type Never (or NoReturn)
pt_pt: from typing import Never # ou NoReturn def never_call_me(arg: Never) -> None: pass def int_or_str(arg: int | str) -> None: never_call_me(arg) # erro do verificador de tipo match arg: case int(): print("It's an int") case str(): print("It's a str") case _: never_call_me(arg) # OK, arg é do tipo Never (ou NoReturn)

source: :data:`!Never` and :data:`!NoReturn` have the same meaning in the type system and static type checkers treat both equivalently.
pt_pt: :data:`!Never` e :data:`!NoReturn` têm o mesmo significado no sistema de tipos e os verificadores de tipo estáticos tratam ambos de forma equivalente.

source: Added :data:`NoReturn`.
pt_pt: Adicionado :data:`NoReturn`.

source: Added :data:`Never`.
pt_pt: Adicionado :data:`Never`.

source: Special type to represent the current enclosed class.
pt_pt: Tipo especial para representar a classe atual envolvente.

source: from typing import Self, reveal_type class Foo: def return_self(self) -> Self: ... return self class SubclassOfFoo(Foo): pass reveal_type(Foo().return_self()) # Revealed type is "Foo" reveal_type(SubclassOfFoo().return_self()) # Revealed type is "SubclassOfFoo"
pt_pt: from typing import Self, reveal_type class Foo: def return_self(self) -> Self: ... return self class SubclassOfFoo(Foo): pass reveal_type(Foo().return_self()) # Tipo revelado é "Foo" reveal_type(SubclassOfFoo().return_self()) # Tipo revelado é "SubclassOfFoo"

source: This annotation is semantically equivalent to the following, albeit in a more succinct fashion::
pt_pt: Esta anotação é semanticamente equivalente ao seguinte, embora de forma mais sucinta::

source: In general, if something returns ``self``, as in the above examples, you should use ``Self`` as the return annotation. If ``Foo.return_self`` was annotated as returning ``"Foo"``, then the type checker would infer the object returned from ``SubclassOfFoo.return_self`` as being of type ``Foo`` rather than ``SubclassOfFoo``.
pt_pt: Em geral, se algo retorna ``self``, como nos exemplos acima, deve usar ``Self`` como a anotação de retorno. Se ``Foo.return_self`` fosse anotado como retornando ``"Foo"``, então o verificador de tipo inferiria o objeto retornado de ``SubclassOfFoo.return_self`` como sendo do tipo ``Foo`` em vez de ``SubclassOfFoo``.

source: Other common use cases include:
pt_pt: Outros casos de uso comuns incluem:

source: :class:`classmethod`\s that are used as alternative constructors and return instances of the ``cls`` parameter.
pt_pt: :class:`classmethod`\s que são usados como construtores alternativos e retornam instâncias do parâmetro ``cls``.

source: Annotating an :meth:`~object.__enter__` method which returns self.
pt_pt: Anotar um método :meth:`~object.__enter__` que retorna self.

source: You should not use ``Self`` as the return annotation if the method is not guaranteed to return an instance of a subclass when the class is subclassed::
pt_pt: Não deve usar ``Self`` como a anotação de retorno se o método não estiver garantido a retornar uma instância de uma subclasse quando a classe é subclassificada::

source: class Eggs: # Self would be an incorrect return annotation here, # as the object returned is always an instance of Eggs, # even in subclasses def returns_eggs(self) -> "Eggs": return Eggs()
pt_pt: class Eggs: # Self seria uma anotação de retorno incorreta aqui, # uma vez que o objeto retornado é sempre uma instância de Eggs, # mesmo em subclasses def returns_eggs(self) -> "Eggs": return Eggs()

source: See :pep:`673` for more details.
pt_pt: Veja :pep:`673` para mais detalhes.

source: Special annotation for explicitly declaring a :ref:`type alias <type-aliases>`.
pt_pt: Anotação especial para declarar explicitamente um :ref:`alias de tipo <type-aliases>`.

source: ``TypeAlias`` is particularly useful on older Python versions for annotating aliases that make use of forward references, as it can be hard for type checkers to distinguish these from normal variable assignments:
pt_pt: ``TypeAlias`` é particularmente útil em versões mais antigas do Python para anotar aliases que usam referências antecipadas, uma vez que pode ser difícil para os verificadores de tipo distinguir estas de atribuições normais de variáveis:

source: from typing import Generic, TypeAlias, TypeVar T = TypeVar("T") # "Box" does not exist yet, # so we have to use quotes for the forward reference on Python <3.12. # Using ``TypeAlias`` tells the type checker that this is a type alias declaration, # not a variable assignment to a string. BoxOfStrings: TypeAlias = "Box[str]" class Box(Generic[T]): @classmethod def make_box_of_strings(cls) -> BoxOfStrings: ...
pt_pt: from typing import Generic, TypeAlias, TypeVar T = TypeVar("T") # "Box" ainda não existe, # pelo que temos de usar aspas para a referência antecipada no Python <3.12. # Usar ``TypeAlias`` diz ao verificador de tipo que isto é uma declaração de alias de tipo, # não uma atribuição de variável a uma string. BoxOfStrings: TypeAlias = "Box[str]" class Box(Generic[T]): @classmethod def make_box_of_strings(cls) -> BoxOfStrings: ...

source: See :pep:`613` for more details.
pt_pt: Veja :pep:`613` para mais detalhes.

source: :data:`TypeAlias` is deprecated in favor of the :keyword:`type` statement, which creates instances of :class:`TypeAliasType` and which natively supports forward references. Note that while :data:`TypeAlias` and :class:`TypeAliasType` serve similar purposes and have similar names, they are distinct and the latter is not the type of the former. Removal of :data:`TypeAlias` is not currently planned, but users are encouraged to migrate to :keyword:`type` statements.
pt_pt: :data:`TypeAlias` está obsoleto em favor da instrução :keyword:`type`, que cria instâncias de :class:`TypeAliasType` e que suporta nativamente referências antecipadas. Note que, embora :data:`TypeAlias` e :class:`TypeAliasType` sirvam propósitos semelhantes e tenham nomes semelhantes, são distintos e este último não é o tipo do primeiro. A remoção de :data:`TypeAlias` não está atualmente planeada, mas os utilizadores são incentivados a migrar para instruções :keyword:`type`.

source: Special forms
pt_pt: Formas especiais

source: These can be used as types in annotations. They all support subscription using ``[]``, but each has a unique syntax.
pt_pt: Estes podem ser usados como tipos em anotações. Todos suportam subíndices usando ``[]``, mas cada um tem uma sintaxe única.

source: Union type; ``Union[X, Y]`` is equivalent to ``X | Y`` and means either X or Y.
pt_pt: Tipo união; ``Union[X, Y]`` é equivalente a ``X | Y`` e significa X ou Y.

source: To define a union, use e.g. ``Union[int, str]`` or the shorthand ``int | str``. Using that shorthand is recommended. Details:
pt_pt: Para definir uma união, use por exemplo ``Union[int, str]`` ou a forma abreviada ``int | str``. É recomendado usar essa forma abreviada. Detalhes:

source: The arguments must be types and there must be at least one.
pt_pt: Os argumentos devem ser tipos e deve haver pelo menos um.

source: Unions of unions are flattened, e.g.::
pt_pt: Uniões de uniões são achatadas, por exemplo::

source: However, this does not apply to unions referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
pt_pt: No entanto, isto não se aplica a uniões referenciadas através de um alias de tipo, para evitar forçar a avaliação do :class:`TypeAliasType` subjacente::

source: Unions of a single argument vanish, e.g.::
pt_pt: Uniões de um único argumento desaparecem, por exemplo::

source: Union[int] == int # The constructor actually returns int
pt_pt: Union[int] == int # O construtor na verdade retorna int

source: Redundant arguments are skipped, e.g.::
pt_pt: Argumentos redundantes são ignorados, por exemplo::

source: When comparing unions, the argument order is ignored, e.g.::
pt_pt: Ao comparar uniões, a ordem dos argumentos é ignorada, por exemplo::

source: You cannot subclass or instantiate a ``Union``.
pt_pt: Não pode criar uma subclasse ou instanciar um ``Union``.

source: You cannot write ``Union[X][Y]``.
pt_pt: Não pode escrever ``Union[X][Y]``.

source: Don't remove explicit subclasses from unions at runtime.
pt_pt: Não remova subclasses explícitas de uniões em tempo de execução.

source: Unions can now be written as ``X | Y``. See :ref:`union type expressions<types-union>`.
pt_pt: As uniões podem agora ser escritas como ``X | Y``. Veja :ref:`expressões de tipo união<types-union>`.

source: ``Optional[X]`` is equivalent to ``X | None`` (or ``Union[X, None]``).
pt_pt: ``Optional[X]`` é equivalente a ``X | None`` (ou ``Union[X, None]``).

source: Note that this is not the same concept as an optional argument, which is one that has a default. An optional argument with a default does not require the ``Optional`` qualifier on its type annotation just because it is optional. For example::
pt_pt: Note que isto não é o mesmo conceito que um argumento opcional, que é aquele que tem um valor predefinido. Um argumento opcional com um valor predefinido não requer o qualificador ``Optional`` na sua anotação de tipo apenas porque é opcional. Por exemplo::

source: On the other hand, if an explicit value of ``None`` is allowed, the use of ``Optional`` is appropriate, whether the argument is optional or not. For example::
pt_pt: Por outro lado, se um valor explícito de ``None`` for permitido, o uso de ``Optional`` é apropriado, quer o argumento seja opcional ou não. Por exemplo::

source: Optional can now be written as ``X | None``. See :ref:`union type expressions<types-union>`.
pt_pt: Optional pode agora ser escrito como ``X | None``. Veja :ref:`expressões de tipo união<types-union>`.

source: Special form for annotating higher-order functions.
pt_pt: Forma especial para anotar funções de ordem superior.

source: ``Concatenate`` can be used in conjunction with :ref:`Callable <annotating-callables>` and :class:`ParamSpec` to annotate a higher-order callable which adds, removes, or transforms parameters of another callable. Usage is in the form ``Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable]``. ``Concatenate`` is currently only valid when used as the first argument to a :ref:`Callable <annotating-callables>`. The last parameter to ``Concatenate`` must be a :class:`ParamSpec` or ellipsis (``...``).
pt_pt: ``Concatenate`` pode ser usado em conjunto com :ref:`Callable <annotating-callables>` e :class:`ParamSpec` para anotar um objeto chamável de ordem superior que adiciona, remove ou transforma parâmetros de outro objeto chamável. O uso é na forma ``Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable]``. ``Concatenate`` é atualmente válido apenas quando usado como o primeiro argumento para um :ref:`Callable <annotating-callables>`. O último parâmetro para ``Concatenate`` deve ser um :class:`ParamSpec` ou uma reticência (``...``).

source: For example, to annotate a decorator ``with_lock`` which provides a :class:`threading.Lock` to the decorated function, ``Concatenate`` can be used to indicate that ``with_lock`` expects a callable which takes in a ``Lock`` as the first argument, and returns a callable with a different type signature. In this case, the :class:`ParamSpec` indicates that the returned callable's parameter types are dependent on the parameter types of the callable being passed in::
pt_pt: Por exemplo, para anotar um decorador ``with_lock`` que fornece um :class:`threading.Lock` à função decorada, ``Concatenate`` pode ser usado para indicar que ``with_lock`` espera um objeto chamável que recebe um ``Lock`` como o primeiro argumento e retorna um objeto chamável com uma assinatura de tipo diferente. Neste caso, o :class:`ParamSpec` indica que os tipos de parâmetros do objeto chamável retornado são dependentes dos tipos de parâmetros do objeto chamável que está a ser passado::

source: from collections.abc import Callable from threading import Lock from typing import Concatenate # Use this lock to ensure that only one thread is executing a function # at any time. my_lock = Lock() def with_lock[**P, R](f: Callable[Concatenate[Lock, P], R]) -> Callable[P, R]: '''A type-safe decorator which provides a lock.''' def inner(*args: P.args, **kwargs: P.kwargs) -> R: # Provide the lock as the first argument. return f(my_lock, *args, **kwargs) return inner @with_lock def sum_threadsafe(lock: Lock, numbers: list[float]) -> float: '''Add a list of numbers together in a thread-safe manner.''' with lock: return sum(numbers) # We don't need to pass in the lock ourselves thanks to the decorator. sum_threadsafe([1.1, 2.2, 3.3])
pt_pt: from collections.abc import Callable from threading import Lock from typing import Concatenate # Use este bloqueio para garantir que apenas uma thread está a executar uma função # em qualquer momento. my_lock = Lock() def with_lock[**P, R](f: Callable[Concatenate[Lock, P], R]) -> Callable[P, R]: '''Um decorador seguro em termos de tipo que fornece um bloqueio.''' def inner(*args: P.args, **kwargs: P.kwargs) -> R: # Fornecer o bloqueio como o primeiro argumento. return f(my_lock, *args, **kwargs) return inner @with_lock def sum_threadsafe(lock: Lock, numbers: list[float]) -> float: '''Adicionar uma lista de números de forma segura em termos de thread.''' with lock: return sum(numbers) # Não precisamos de passar o bloqueio nós mesmos graças ao decorador. sum_threadsafe([1.1, 2.2, 3.3])

source: :pep:`612` -- Parameter Specification Variables (the PEP which introduced ``ParamSpec`` and ``Concatenate``)
pt_pt: :pep:`612` -- Variáveis de Especificação de Parâmetros (a PEP que introduziu ``ParamSpec`` e ``Concatenate``)

source: Special typing form to define "literal types".
pt_pt: Forma especial de tipagem para definir "tipos literais".

source: ``Literal`` can be used to indicate to type checkers that the annotated object has a value equivalent to one of the provided literals.
pt_pt: ``Literal`` pode ser usado para indicar aos verificadores de tipo que o objeto anotado tem um valor equivalente a um dos literais fornecidos.

source: def validate_simple(data: Any) -> Literal[True]: # always returns True ... type Mode = Literal['r', 'rb', 'w', 'wb'] def open_helper(file: str, mode: Mode) -> str: ... open_helper('/some/path', 'r') # Passes type check open_helper('/other/path', 'typo') # Error in type checker
pt_pt: def validate_simple(data: Any) -> Literal[True]: # sempre retorna True ... type Mode = Literal['r', 'rb', 'w', 'wb'] def open_helper(file: str, mode: Mode) -> str: ... open_helper('/some/path', 'r') # Passa verificação de tipo open_helper('/other/path', 'typo') # Erro no verificador de tipo

source: ``Literal[...]`` cannot be subclassed. At runtime, an arbitrary value is allowed as type argument to ``Literal[...]``, but type checkers may impose restrictions. See :pep:`586` for more details about literal types.
pt_pt: ``Literal[...]`` não pode ser subclassificado. Em tempo de execução, um valor arbitrário é permitido como argumento de tipo para ``Literal[...]``, mas os verificadores de tipo podem impor restrições. Veja :pep:`586` para mais detalhes sobre tipos literais.

source: Additional details:
pt_pt: Detalhes adicionais:

source: The arguments must be literal values and there must be at least one.
pt_pt: Os argumentos devem ser valores literais e deve haver pelo menos um.

source: Nested ``Literal`` types are flattened, e.g.::
pt_pt: Tipos ``Literal`` aninhados são achatados, por exemplo::

source: However, this does not apply to ``Literal`` types referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
pt_pt: No entanto, isto não se aplica a tipos ``Literal`` referenciados através de um alias de tipo, para evitar forçar a avaliação do :class:`TypeAliasType` subjacente::

source: When comparing literals, the argument order is ignored, e.g.::
pt_pt: Ao comparar literais, a ordem dos argumentos é ignorada, por exemplo::
