Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: :mod:`!typing` --- Support for type hints
pt_pt: :mod:`!typing` --- Suporte para dicas de tipo

source: **Source code:** :source:`Lib/typing.py`
pt_pt: **Código-fonte:** :source:`Lib/typing.py`

source: The Python runtime does not enforce function and variable type annotations. They can be used by third party tools such as :term:`type checkers <static type checker>`, IDEs, linters, etc.
pt_pt: O tempo de execução do Python não impõe anotações de tipo de funções e variáveis. Podem ser usadas por ferramentas de terceiros como :term:`verificadores de tipo <static type checker>`, IDEs, linters, etc.

source: This module provides runtime support for type hints.
pt_pt: Este módulo fornece suporte em tempo de execução para dicas de tipo.

source: Consider the function below::
pt_pt: Considere a função abaixo::

source: def surface_area_of_cube(edge_length: float) -> str: return f"The surface area of the cube is {6 * edge_length ** 2}."
pt_pt: def surface_area_of_cube(edge_length: float) -> str: return f"A área de superfície do cubo é {6 * edge_length ** 2}."

source: The function ``surface_area_of_cube`` takes an argument expected to be an instance of :class:`float`, as indicated by the :term:`type hint` ``edge_length: float``. The function is expected to return an instance of :class:`str`, as indicated by the ``-> str`` hint.
pt_pt: A função ``surface_area_of_cube`` recebe um argumento esperado ser uma instância de :class:`float`, como indicado pela :term:`dica de tipo` ``edge_length: float``. A função é esperada devolver uma instância de :class:`str`, como indicado pela dica ``-> str``.

source: While type hints can be simple classes like :class:`float` or :class:`str`, they can also be more complex. The :mod:`typing` module provides a vocabulary of more advanced type hints.
pt_pt: Embora as dicas de tipo possam ser classes simples como :class:`float` ou :class:`str`, também podem ser mais complexas. O módulo :mod:`typing` fornece um vocabulário de dicas de tipo mais avançadas.

source: New features are frequently added to the ``typing`` module. The :pypi:`typing_extensions` package provides backports of these new features to older versions of Python.
pt_pt: Novas funcionalidades são frequentemente adicionadas ao módulo ``typing``. O pacote :pypi:`typing_extensions` fornece retroportagens destas novas funcionalidades para versões mais antigas do Python.

source: `Typing cheat sheet <https://mypy.readthedocs.io/en/stable/cheat_sheet_py3.html>`_
pt_pt: `Folha de referência de dicas de tipo <https://mypy.readthedocs.io/en/stable/cheat_sheet_py3.html>`_

source: A quick overview of type hints (hosted at the mypy docs)
pt_pt: Uma visão geral rápida de dicas de tipo (alojado na documentação do mypy)

source: Type System Reference section of `the mypy docs <https://mypy.readthedocs.io/en/stable/index.html>`_
pt_pt: Secção de Referência do Sistema de Tipos da `documentação do mypy <https://mypy.readthedocs.io/en/stable/index.html>`_

source: The Python typing system is standardised via PEPs, so this reference should broadly apply to most Python type checkers. (Some parts may still be specific to mypy.)
pt_pt: O sistema de tipos do Python é padronizado através de PEPs, pelo que esta referência deve aplicar-se amplamente à maioria dos verificadores de tipo do Python. (Algumas partes ainda podem ser específicas do mypy.)

source: Type-checker-agnostic documentation written by the community detailing type system features, useful typing related tools and typing best practices.
pt_pt: Documentação agnóstica de verificadores de tipo escrita pela comunidade, detalhando funcionalidades do sistema de tipos, ferramentas relacionadas úteis e melhores práticas de dicas de tipo.

source: Specification for the Python Type System
pt_pt: Especificação para o Sistema de Tipos do Python

source: The canonical, up-to-date specification of the Python type system can be found at `Specification for the Python type system <https://typing.python.org/en/latest/spec/index.html>`_.
pt_pt: A especificação canónica e atualizada do sistema de tipos do Python pode ser encontrada em `Especificação para o sistema de tipos do Python <https://typing.python.org/en/latest/spec/index.html>`_.

source: Type aliases
pt_pt: Aliases de tipo

source: A type alias is defined using the :keyword:`type` statement, which creates an instance of :class:`TypeAliasType`. In this example, ``Vector`` and ``list[float]`` will be treated equivalently by static type checkers::
pt_pt: Um alias de tipo é definido usando a instrução :keyword:`type`, que cria uma instância de :class:`TypeAliasType`. Neste exemplo, ``Vector`` e ``list[float]`` serão tratados de forma equivalente pelos verificadores de tipo estáticos::

source: type Vector = list[float] def scale(scalar: float, vector: Vector) -> Vector: return [scalar * num for num in vector] # passes type checking; a list of floats qualifies as a Vector. new_vector = scale(2.0, [1.0, -4.2, 5.4])
pt_pt: type Vector = list[float] def scale(scalar: float, vector: Vector) -> Vector: return [scalar * num for num in vector] # passa verificação de tipo; uma lista de floats qualifica como um Vector. new_vector = scale(2.0, [1.0, -4.2, 5.4])

source: Type aliases are useful for simplifying complex type signatures. For example::
pt_pt: Os aliases de tipo são úteis para simplificar assinaturas de tipo complexas. Por exemplo::

source: from collections.abc import Sequence type ConnectionOptions = dict[str, str] type Address = tuple[str, int] type Server = tuple[Address, ConnectionOptions] def broadcast_message(message: str, servers: Sequence[Server]) -> None: ... # The static type checker will treat the previous type signature as # being exactly equivalent to this one. def broadcast_message( message: str, servers: Sequence[tuple[tuple[str, int], dict[str, str]]] ) -> None: ...
pt_pt: from collections.abc import Sequence type ConnectionOptions = dict[str, str] type Address = tuple[str, int] type Server = tuple[Address, ConnectionOptions] def broadcast_message(message: str, servers: Sequence[Server]) -> None: ... # O verificador de tipo estático tratará a assinatura de tipo anterior como # sendo exatamente equivalente a esta. def broadcast_message( message: str, servers: Sequence[tuple[tuple[str, int], dict[str, str]]] ) -> None: ...

source: The :keyword:`type` statement is new in Python 3.12. For backwards compatibility, type aliases can also be created through simple assignment::
pt_pt: A instrução :keyword:`type` é nova no Python 3.12. Para compatibilidade retroativa, os aliases de tipo também podem ser criados através de uma atribuição simples::

source: Or marked with :data:`TypeAlias` to make it explicit that this is a type alias, not a normal variable assignment::
pt_pt: Ou marcado com :data:`TypeAlias` para tornar explícito que isto é um alias de tipo, não uma atribuição de variável normal::

source: Use the :class:`NewType` helper to create distinct types::
pt_pt: Use o auxiliar :class:`NewType` para criar tipos distintos::

source: The static type checker will treat the new type as if it were a subclass of the original type. This is useful in helping catch logical errors::
pt_pt: O verificador de tipo estático tratará o novo tipo como se fosse uma subclasse do tipo original. Isto é útil para ajudar a detetar erros lógicos::

source: def get_user_name(user_id: UserId) -> str: ... # passes type checking user_a = get_user_name(UserId(42351)) # fails type checking; an int is not a UserId user_b = get_user_name(-1)
pt_pt: def get_user_name(user_id: UserId) -> str: ... # passa verificação de tipo user_a = get_user_name(UserId(42351)) # falha verificação de tipo; um int não é um UserId user_b = get_user_name(-1)

source: You may still perform all ``int`` operations on a variable of type ``UserId``, but the result will always be of type ``int``. This lets you pass in a ``UserId`` wherever an ``int`` might be expected, but will prevent you from accidentally creating a ``UserId`` in an invalid way::
pt_pt: Ainda pode realizar todas as operações ``int`` numa variável do tipo ``UserId``, mas o resultado será sempre do tipo ``int``. Isto permite-lhe passar um ``UserId`` onde um ``int`` possa ser esperado, mas evitará que crie um ``UserId`` de forma inválida::

source: # 'output' is of type 'int', not 'UserId' output = UserId(23413) + UserId(54341)
pt_pt: # 'output' é do tipo 'int', não 'UserId' output = UserId(23413) + UserId(54341)

source: Note that these checks are enforced only by the static type checker. At runtime, the statement ``Derived = NewType('Derived', Base)`` will make ``Derived`` a callable that immediately returns whatever parameter you pass it. That means the expression ``Derived(some_value)`` does not create a new class or introduce much overhead beyond that of a regular function call.
pt_pt: Note que estas verificações são impostas apenas pelo verificador de tipo estático. Em tempo de execução, a instrução ``Derived = NewType('Derived', Base)`` tornará ``Derived`` um objeto chamável que imediatamente devolve qualquer parâmetro que lhe seja passado. Isto significa que a expressão ``Derived(some_value)`` não cria uma nova classe nem introduz muito overhead para além de uma chamada de função regular.

source: More precisely, the expression ``some_value is Derived(some_value)`` is always true at runtime.
pt_pt: Mais precisamente, a expressão ``some_value is Derived(some_value)`` é sempre verdadeira em tempo de execução.

source: It is invalid to create a subtype of ``Derived``::
pt_pt: É inválido criar um subtipo de ``Derived``::

source: from typing import NewType UserId = NewType('UserId', int) # Fails at runtime and does not pass type checking class AdminUserId(UserId): pass
pt_pt: from typing import NewType UserId = NewType('UserId', int) # Falha em tempo de execução e não passa verificação de tipo class AdminUserId(UserId): pass

source: However, it is possible to create a :class:`NewType` based on a 'derived' ``NewType``::
pt_pt: No entanto, é possível criar um :class:`NewType` baseado num ``NewType`` 'derivado'::

source: and typechecking for ``ProUserId`` will work as expected.
pt_pt: e a verificação de tipo para ``ProUserId`` funcionará como esperado.

source: See :pep:`484` for more details.
pt_pt: Veja :pep:`484` para mais detalhes.

source: Recall that the use of a type alias declares two types to be *equivalent* to one another. Doing ``type Alias = Original`` will make the static type checker treat ``Alias`` as being *exactly equivalent* to ``Original`` in all cases. This is useful when you want to simplify complex type signatures.
pt_pt: Lembre-se que o uso de um alias de tipo declara dois tipos como sendo *equivalentes* um ao outro. Fazer ``type Alias = Original`` fará com que o verificador de tipo estático trate ``Alias`` como sendo *exatamente equivalente* a ``Original`` em todos os casos. Isto é útil quando se quer simplificar assinaturas de tipo complexas.

source: In contrast, ``NewType`` declares one type to be a *subtype* of another. Doing ``Derived = NewType('Derived', Original)`` will make the static type checker treat ``Derived`` as a *subclass* of ``Original``, which means a value of type ``Original`` cannot be used in places where a value of type ``Derived`` is expected. This is useful when you want to prevent logic errors with minimal runtime cost.
pt_pt: Em contraste, ``NewType`` declara um tipo como sendo um *subtipo* de outro. Fazer ``Derived = NewType('Derived', Original)`` fará com que o verificador de tipo estático trate ``Derived`` como uma *subclasse* de ``Original``, o que significa que um valor do tipo ``Original`` não pode ser usado em locais onde um valor do tipo ``Derived`` é esperado. Isto é útil quando se quer prevenir erros lógicos com um custo mínimo em tempo de execução.

source: ``NewType`` is now a class rather than a function. As a result, there is some additional runtime cost when calling ``NewType`` over a regular function.
pt_pt: ``NewType`` é agora uma classe em vez de uma função. Como resultado, há algum custo adicional em tempo de execução ao chamar ``NewType`` em comparação com uma função regular.

source: The performance of calling ``NewType`` has been restored to its level in Python 3.9.
pt_pt: O desempenho da chamada de ``NewType`` foi restaurado ao seu nível no Python 3.9.

source: Annotating callable objects
pt_pt: Anotar objetos chamáveis

source: Functions -- or other :term:`callable` objects -- can be annotated using :class:`collections.abc.Callable` or deprecated :data:`typing.Callable`. ``Callable[[int], str]`` signifies a function that takes a single parameter of type :class:`int` and returns a :class:`str`.
pt_pt: Funções -- ou outros objetos :term:`chamáveis` -- podem ser anotadas usando :class:`collections.abc.Callable` ou o obsoleto :data:`typing.Callable`. ``Callable[[int], str]`` significa uma função que recebe um único parâmetro do tipo :class:`int` e devolve uma :class:`str`.

source: For example:
pt_pt: Por exemplo:

source: from collections.abc import Callable, Awaitable def feeder(get_next_item: Callable[[], str]) -> None: ... # Body def async_query(on_success: Callable[[int], None], on_error: Callable[[int, Exception], None]) -> None: ... # Body async def on_update(value: str) -> None: ... # Body callback: Callable[[str], Awaitable[None]] = on_update
pt_pt: from collections.abc import Callable, Awaitable def feeder(get_next_item: Callable[[], str]) -> None: ... # Corpo def async_query(on_success: Callable[[int], None], on_error: Callable[[int, Exception], None]) -> None: ... # Corpo async def on_update(value: str) -> None: ... # Corpo callback: Callable[[str], Awaitable[None]] = on_update

source: The subscription syntax must always be used with exactly two values: the argument list and the return type. The argument list must be a list of types, a :class:`ParamSpec`, :data:`Concatenate`, or an ellipsis (``...``). The return type must be a single type.
pt_pt: A sintaxe de subíndice deve ser sempre usada com exatamente dois valores: a lista de argumentos e o tipo de retorno. A lista de argumentos deve ser uma lista de tipos, um :class:`ParamSpec`, :data:`Concatenate`, ou uma reticência (``...``). O tipo de retorno deve ser um único tipo.

source: If a literal ellipsis ``...`` is given as the argument list, it indicates that a callable with any arbitrary parameter list would be acceptable:
pt_pt: Se uma reticência literal ``...`` for dada como a lista de argumentos, indica que um objeto chamável com qualquer lista arbitrária de parâmetros seria aceitável:

source: def concat(x: str, y: str) -> str: return x + y x: Callable[..., str] x = str # OK x = concat # Also OK
pt_pt: def concat(x: str, y: str) -> str: return x + y x: Callable[..., str] x = str # OK x = concat # Também OK

source: ``Callable`` cannot express complex signatures such as functions that take a variadic number of arguments, :ref:`overloaded functions <overload>`, or functions that have keyword-only parameters. However, these signatures can be expressed by defining a :class:`Protocol` class with a :meth:`~object.__call__` method:
pt_pt: ``Callable`` não pode expressar assinaturas complexas como funções que recebem um número variável de argumentos, :ref:`funções sobrecarregadas <overload>`, ou funções que têm parâmetros apenas nomeados. No entanto, estas assinaturas podem ser expressas definindo uma classe :class:`Protocol` com um método :meth:`~object.__call__`:

source: from collections.abc import Iterable from typing import Protocol class Combiner(Protocol): def __call__(self, *vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def batch_proc(data: Iterable[bytes], cb_results: Combiner) -> bytes: for item in data: ... def good_cb(*vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def bad_cb(*vals: bytes, maxitems: int | None) -> list[bytes]: ... batch_proc([], good_cb) # OK batch_proc([], bad_cb) # Error! Argument 2 has incompatible type because of # different name and kind in the callback
pt_pt: from collections.abc import Iterable from typing import Protocol class Combiner(Protocol): def __call__(self, *vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def batch_proc(data: Iterable[bytes], cb_results: Combiner) -> bytes: for item in data: ... def good_cb(*vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def bad_cb(*vals: bytes, maxitems: int | None) -> list[bytes]: ... batch_proc([], good_cb) # OK batch_proc([], bad_cb) # Erro! O argumento 2 tem tipo incompatível devido a # nome e tipo diferentes na função de retorno

source: Callables which take other callables as arguments may indicate that their parameter types are dependent on each other using :class:`ParamSpec`. Additionally, if that callable adds or removes arguments from other callables, the :data:`Concatenate` operator may be used. They take the form ``Callable[ParamSpecVariable, ReturnType]`` and ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]`` respectively.
pt_pt: Objetos chamáveis que recebem outros objetos chamáveis como argumentos podem indicar que os seus tipos de parâmetros são dependentes uns dos outros usando :class:`ParamSpec`. Além disso, se esse objeto chamável adiciona ou remove argumentos de outros objetos chamáveis, o operador :data:`Concatenate` pode ser usado. Eles assumem a forma ``Callable[ParamSpecVariable, ReturnType]`` e ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]`` respetivamente.

source: ``Callable`` now supports :class:`ParamSpec` and :data:`Concatenate`. See :pep:`612` for more details.
pt_pt: ``Callable`` agora suporta :class:`ParamSpec` e :data:`Concatenate`. Veja :pep:`612` para mais detalhes.

source: The documentation for :class:`ParamSpec` and :class:`Concatenate` provides examples of usage in ``Callable``.
pt_pt: A documentação para :class:`ParamSpec` e :class:`Concatenate` fornece exemplos de utilização em ``Callable``.

source: Generics
pt_pt: Genéricos

source: Since type information about objects kept in containers cannot be statically inferred in a generic way, many container classes in the standard library support subscription to denote the expected types of container elements.
pt_pt: Como a informação de tipo sobre objetos guardados em contentores não pode ser inferida estaticamente de uma forma genérica, muitas classes de contentores na biblioteca padrão suportam subíndices para denotar os tipos esperados dos elementos do contentor.

source: from collections.abc import Mapping, Sequence class Employee: ... # Sequence[Employee] indicates that all elements in the sequence # must be instances of "Employee". # Mapping[str, str] indicates that all keys and all values in the mapping # must be strings. def notify_by_email(employees: Sequence[Employee], overrides: Mapping[str, str]) -> None: ...
pt_pt: from collections.abc import Mapping, Sequence class Employee: ... # Sequence[Employee] indica que todos os elementos na sequência # devem ser instâncias de "Employee". # Mapping[str, str] indica que todas as chaves e todos os valores no mapeamento # devem ser strings. def notify_by_email(employees: Sequence[Employee], overrides: Mapping[str, str]) -> None: ...

source: Generic functions and classes can be parameterized by using :ref:`type parameter syntax <type-params>`::
pt_pt: Funções e classes genéricas podem ser parametrizadas usando :ref:`sintaxe de parâmetros de tipo <type-params>`::

source: from collections.abc import Sequence def first[T](l: Sequence[T]) -> T: # Function is generic over the TypeVar "T" return l[0]
pt_pt: from collections.abc import Sequence def first[T](l: Sequence[T]) -> T: # Função é genérica sobre o TypeVar "T" return l[0]

source: Or by using the :class:`TypeVar` factory directly::
pt_pt: Ou usando diretamente a fábrica :class:`TypeVar`::

source: from collections.abc import Sequence from typing import TypeVar U = TypeVar('U') # Declare type variable "U" def second(l: Sequence[U]) -> U: # Function is generic over the TypeVar "U" return l[1]
pt_pt: from collections.abc import Sequence from typing import TypeVar U = TypeVar('U') # Declarar variável de tipo "U" def second(l: Sequence[U]) -> U: # Função é genérica sobre a variável de tipo "U" return l[1]

source: Syntactic support for generics is new in Python 3.12.
pt_pt: O suporte sintático para genéricos é novo no Python 3.12.

source: Annotating tuples
pt_pt: Anotar tuplos

source: For most containers in Python, the typing system assumes that all elements in the container will be of the same type. For example::
pt_pt: Para a maioria dos contentores em Python, o sistema de tipos assume que todos os elementos no contentor serão do mesmo tipo. Por exemplo::

source: from collections.abc import Mapping # Type checker will infer that all elements in ``x`` are meant to be ints x: list[int] = [] # Type checker error: ``list`` only accepts a single type argument: y: list[int, str] = [1, 'foo'] # Type checker will infer that all keys in ``z`` are meant to be strings, # and that all values in ``z`` are meant to be either strings or ints z: Mapping[str, str | int] = {}
pt_pt: from collections.abc import Mapping # O verificador de tipo inferirá que todos os elementos em ``x`` são ints x: list[int] = [] # Erro do verificador de tipo: ``list`` aceita apenas um argumento de tipo: y: list[int, str] = [1, 'foo'] # O verificador de tipo inferirá que todas as chaves em ``z`` são strings, # e que todos os valores em ``z`` são strings ou ints z: Mapping[str, str | int] = {}

source: :class:`list` only accepts one type argument, so a type checker would emit an error on the ``y`` assignment above. Similarly, :class:`~collections.abc.Mapping` only accepts two type arguments: the first indicates the type of the keys, and the second indicates the type of the values.
pt_pt: :class:`list` aceita apenas um argumento de tipo, pelo que um verificador de tipo emitiria um erro na atribuição ``y`` acima. Da mesma forma, :class:`~collections.abc.Mapping` aceita apenas dois argumentos de tipo: o primeiro indica o tipo das chaves e o segundo indica o tipo dos valores.

source: Unlike most other Python containers, however, it is common in idiomatic Python code for tuples to have elements which are not all of the same type. For this reason, tuples are special-cased in Python's typing system. :class:`tuple` accepts *any number* of type arguments::
pt_pt: Ao contrário da maioria dos outros contentores em Python, no entanto, é comum em código Python idiomático que os tuplos tenham elementos que não são todos do mesmo tipo. Por esta razão, os tuplos são um caso especial no sistema de tipos do Python. :class:`tuple` aceita *qualquer número* de argumentos de tipo::

source: # OK: ``x`` is assigned to a tuple of length 1 where the sole element is an int x: tuple[int] = (5,) # OK: ``y`` is assigned to a tuple of length 2; # element 1 is an int, element 2 is a str y: tuple[int, str] = (5, "foo") # Error: the type annotation indicates a tuple of length 1, # but ``z`` has been assigned to a tuple of length 3 z: tuple[int] = (1, 2, 3)
pt_pt: # OK: ``x`` é atribuído a um tuplo de comprimento 1 onde o único elemento é um int x: tuple[int] = (5,) # OK: ``y`` é atribuído a um tuplo de comprimento 2; # o elemento 1 é um int, o elemento 2 é uma str y: tuple[int, str] = (5, "foo") # Erro: a anotação de tipo indica um tuplo de comprimento 1, # mas ``z`` foi atribuído a um tuplo de comprimento 3 z: tuple[int] = (1, 2, 3)
