Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: You cannot subclass or instantiate a ``Literal``.
pt_pt: Não pode criar uma subclasse ou instanciar um ``Literal``.

source: You cannot write ``Literal[X][Y]``.
pt_pt: Não pode escrever ``Literal[X][Y]``.

source: ``Literal`` now de-duplicates parameters. Equality comparisons of ``Literal`` objects are no longer order dependent. ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if one of their parameters are not :term:`hashable`.
pt_pt: ``Literal`` agora remove parâmetros duplicados. Comparações de igualdade de objetos ``Literal`` já não dependem da ordem. Objetos ``Literal`` agora levantarão uma exceção :exc:`TypeError` durante comparações de igualdade se um dos seus parâmetros não for :term:`hashable`.

source: Special type construct to mark class variables.
pt_pt: Construção especial de tipo para marcar variáveis de classe.

source: As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. Usage::
pt_pt: Como introduzido em :pep:`526`, uma anotação de variável envolvida em ClassVar indica que um determinado atributo é destinado a ser usado como uma variável de classe e não deve ser definido em instâncias dessa classe. Utilização::

source: class Starship: stats: ClassVar[dict[str, int]] = {} # class variable damage: int = 10 # instance variable
pt_pt: class Starship: stats: ClassVar[dict[str, int]] = {} # variável de classe damage: int = 10 # variável de instância

source: :data:`ClassVar` accepts only types and cannot be further subscribed.
pt_pt: :data:`ClassVar` aceita apenas tipos e não pode ser mais subscrevido.

source: :data:`ClassVar` is not a class itself, and should not be used with :func:`isinstance` or :func:`issubclass`. :data:`ClassVar` does not change Python runtime behavior, but it can be used by third-party type checkers. For example, a type checker might flag the following code as an error::
pt_pt: :data:`ClassVar` não é uma classe em si, e não deve ser usado com :func:`isinstance` ou :func:`issubclass`. :data:`ClassVar` não altera o comportamento em tempo de execução do Python, mas pode ser usado por verificadores de tipo de terceiros. Por exemplo, um verificador de tipo pode marcar o seguinte código como um erro::

source: enterprise_d = Starship(3000) enterprise_d.stats = {} # Error, setting class variable on instance Starship.stats = {} # This is OK
pt_pt: enterprise_d = Starship(3000) enterprise_d.stats = {} # Erro, a definir variável de classe em instância Starship.stats = {} # Isto está OK

source: :data:`ClassVar` can now be nested in :data:`Final` and vice versa.
pt_pt: :data:`ClassVar` pode agora ser aninhado em :data:`Final` e vice-versa.

source: Special typing construct to indicate final names to type checkers.
pt_pt: Construção especial de tipagem para indicar nomes finais aos verificadores de tipo.

source: Final names cannot be reassigned in any scope. Final names declared in class scopes cannot be overridden in subclasses.
pt_pt: Nomes finais não podem ser reatribuídos em nenhum escopo. Nomes finais declarados em escopos de classe não podem ser substituídos em subclasses.

source: MAX_SIZE: Final = 9000 MAX_SIZE += 1 # Error reported by type checker class Connection: TIMEOUT: Final[int] = 10 class FastConnector(Connection): TIMEOUT = 1 # Error reported by type checker
pt_pt: MAX_SIZE: Final = 9000 MAX_SIZE += 1 # Erro reportado pelo verificador de tipo class Connection: TIMEOUT: Final[int] = 10 class FastConnector(Connection): TIMEOUT = 1 # Erro reportado pelo verificador de tipo

source: There is no runtime checking of these properties. See :pep:`591` for more details.
pt_pt: Não há verificação em tempo de execução destas propriedades. Veja :pep:`591` para mais detalhes.

source: :data:`Final` can now be nested in :data:`ClassVar` and vice versa.
pt_pt: :data:`Final` pode agora ser aninhado em :data:`ClassVar` e vice-versa.

source: Special typing construct to mark a :class:`TypedDict` key as required.
pt_pt: Construção especial de tipagem para marcar uma chave :class:`TypedDict` como obrigatória.

source: This is mainly useful for ``total=False`` TypedDicts. See :class:`TypedDict` and :pep:`655` for more details.
pt_pt: Isto é principalmente útil para ``total=False`` TypedDicts. Veja :class:`TypedDict` e :pep:`655` para mais detalhes.

source: Special typing construct to mark a :class:`TypedDict` key as potentially missing.
pt_pt: Construção especial de tipagem para marcar uma chave :class:`TypedDict` como potencialmente em falta.

source: See :class:`TypedDict` and :pep:`655` for more details.
pt_pt: Veja :class:`TypedDict` e :pep:`655` para mais detalhes.

source: A special typing construct to mark an item of a :class:`TypedDict` as read-only.
pt_pt: Uma construção especial de tipagem para marcar um item de um :class:`TypedDict` como apenas de leitura.

source: class Movie(TypedDict): title: ReadOnly[str] year: int def mutate_movie(m: Movie) -> None: m["year"] = 1999 # allowed m["title"] = "The Matrix" # typechecker error
pt_pt: class Movie(TypedDict): title: ReadOnly[str] year: int def mutate_movie(m: Movie) -> None: m["year"] = 1999 # permitido m["title"] = "The Matrix" # erro do verificador de tipo

source: There is no runtime checking for this property.
pt_pt: Não há verificação em tempo de execução para esta propriedade.

source: See :class:`TypedDict` and :pep:`705` for more details.
pt_pt: Veja :class:`TypedDict` e :pep:`705` para mais detalhes.

source: Special typing form to add context-specific metadata to an annotation.
pt_pt: Forma especial de tipagem para adicionar metadados específicos de contexto a uma anotação.

source: Add metadata ``x`` to a given type ``T`` by using the annotation ``Annotated[T, x]``. Metadata added using ``Annotated`` can be used by static analysis tools or at runtime. At runtime, the metadata is stored in a :attr:`!__metadata__` attribute.
pt_pt: Adicione metadados ``x`` a um tipo dado ``T`` usando a anotação ``Annotated[T, x]``. Metadados adicionados usando ``Annotated`` podem ser usados por ferramentas de análise estática ou em tempo de execução. Em tempo de execução, os metadados são armazenados num atributo :attr:`!__metadata__`.

source: If a library or tool encounters an annotation ``Annotated[T, x]`` and has no special logic for the metadata, it should ignore the metadata and simply treat the annotation as ``T``. As such, ``Annotated`` can be useful for code that wants to use annotations for purposes outside Python's static typing system.
pt_pt: Se uma biblioteca ou ferramenta encontrar uma anotação ``Annotated[T, x]`` e não tiver lógica especial para os metadados, deve ignorar os metadados e tratar simplesmente a anotação como ``T``. Como tal, ``Annotated`` pode ser útil para código que queira usar anotações para fins fora do sistema de tipagem estática do Python.

source: Using ``Annotated[T, x]`` as an annotation still allows for static typechecking of ``T``, as type checkers will simply ignore the metadata ``x``. In this way, ``Annotated`` differs from the :deco:`no_type_check` decorator, which can also be used for adding annotations outside the scope of the typing system, but completely disables typechecking for a function or class.
pt_pt: Usar ``Annotated[T, x]`` como uma anotação ainda permite a verificação estática de tipo de ``T``, uma vez que os verificadores de tipo simplesmente ignorarão os metadados ``x``. Desta forma, ``Annotated`` difere do decorador :deco:`no_type_check`, que também pode ser usado para adicionar anotações fora do âmbito do sistema de tipagem, mas desativa completamente a verificação de tipo para uma função ou classe.

source: The responsibility of how to interpret the metadata lies with the tool or library encountering an ``Annotated`` annotation. A tool or library encountering an ``Annotated`` type can scan through the metadata elements to determine if they are of interest (e.g., using :func:`isinstance`).
pt_pt: A responsabilidade de como interpretar os metadados cabe à ferramenta ou biblioteca que encontrar uma anotação ``Annotated``. Uma ferramenta ou biblioteca que encontrar um tipo ``Annotated`` pode examinar os elementos de metadados para determinar se são de interesse (por exemplo, usando :func:`isinstance`).

source: Here is an example of how you might use ``Annotated`` to add metadata to type annotations if you were doing range analysis:
pt_pt: Aqui está um exemplo de como pode usar ``Annotated`` para adicionar metadados a anotações de tipo se estivesse a fazer análise de intervalos:

source: The first argument to ``Annotated`` must be a valid type. Multiple metadata elements can be supplied as ``Annotated`` supports variadic arguments. The order of the metadata elements is preserved and matters for equality checks::
pt_pt: O primeiro argumento para ``Annotated`` deve ser um tipo válido. Múltiplos elementos de metadados podem ser fornecidos, uma vez que ``Annotated`` suporta argumentos variádicos. A ordem dos elementos de metadados é preservada e importa para verificações de igualdade::

source: @dataclass class ctype: kind: str a1 = Annotated[int, ValueRange(3, 10), ctype("char")] a2 = Annotated[int, ctype("char"), ValueRange(3, 10)] assert a1 != a2 # Order matters
pt_pt: @dataclass class ctype: kind: str a1 = Annotated[int, ValueRange(3, 10), ctype("char")] a2 = Annotated[int, ctype("char"), ValueRange(3, 10)] assert a1 != a2 # A ordem importa

source: It is up to the tool consuming the annotations to decide whether the client is allowed to add multiple metadata elements to one annotation and how to merge those annotations.
pt_pt: Cabe à ferramenta que consome as anotações decidir se o cliente tem permissão para adicionar múltiplos elementos de metadados a uma anotação e como fundir essas anotações.

source: Nested ``Annotated`` types are flattened. The order of the metadata elements starts with the innermost annotation::
pt_pt: Tipos ``Annotated`` aninhados são achatados. A ordem dos elementos de metadados começa com a anotação mais interna::

source: However, this does not apply to ``Annotated`` types referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
pt_pt: No entanto, isto não se aplica a tipos ``Annotated`` referenciados através de um alias de tipo, para evitar forçar a avaliação do :class:`TypeAliasType` subjacente::

source: Duplicated metadata elements are not removed::
pt_pt: Elementos de metadados duplicados não são removidos::

source: ``Annotated`` can be used with nested and generic aliases:
pt_pt: ``Annotated`` pode ser usado com aliases aninhados e genéricos:

source: @dataclass class MaxLen: value: int type Vec[T] = Annotated[list[tuple[T, T]], MaxLen(10)] # When used in a type annotation, a type checker will treat "V" the same as # ``Annotated[list[tuple[int, int]], MaxLen(10)]``: type V = Vec[int]
pt_pt: @dataclass class MaxLen: value: int type Vec[T] = Annotated[list[tuple[T, T]], MaxLen(10)] # Quando usado numa anotação de tipo, um verificador de tipo tratará "V" da mesma forma que # ``Annotated[list[tuple[int, int]], MaxLen(10)]``: type V = Vec[int]

source: ``Annotated`` cannot be used with an unpacked :class:`TypeVarTuple`::
pt_pt: ``Annotated`` não pode ser usado com um :class:`TypeVarTuple` descompactado::

source: type Variadic[*Ts] = Annotated[*Ts, Ann1] = Annotated[T1, T2, T3, ..., Ann1] # NOT valid
pt_pt: type Variadic[*Ts] = Annotated[*Ts, Ann1] = Annotated[T1, T2, T3, ..., Ann1] # NÃO válido

source: where ``T1``, ``T2``, ... are :class:`TypeVars <TypeVar>`. This is invalid as only one type should be passed to Annotated.
pt_pt: onde ``T1``, ``T2``, ... são :class:`TypeVars <TypeVar>`. Isto é inválido, uma vez que apenas um tipo deve ser passado para Annotated.

source: By default, :func:`get_type_hints` strips the metadata from annotations. Pass ``include_extras=True`` to have the metadata preserved:
pt_pt: Por predefinição, :func:`get_type_hints` remove os metadados das anotações. Passe ``include_extras=True`` para preservar os metadados:

source: At runtime, the metadata associated with an ``Annotated`` type can be retrieved via the :attr:`!__metadata__` attribute:
pt_pt: Em tempo de execução, os metadados associados a um tipo ``Annotated`` podem ser recuperados através do atributo :attr:`!__metadata__`:

source: If you want to retrieve the original type wrapped by ``Annotated``, use the :attr:`!__origin__` attribute:
pt_pt: Se quiser recuperar o tipo original envolvido por ``Annotated``, use o atributo :attr:`!__origin__`:

source: Note that using :func:`get_origin` will return ``Annotated`` itself:
pt_pt: Note que usar :func:`get_origin` retornará ``Annotated`` em si:

source: :pep:`593` - Flexible function and variable annotations
pt_pt: :pep:`593` - Anotações flexíveis de funções e variáveis

source: The PEP introducing ``Annotated`` to the standard library.
pt_pt: A PEP que introduz ``Annotated`` na biblioteca padrão.

source: Special typing construct for marking user-defined type predicate functions.
pt_pt: Construção especial de tipagem para marcar funções de predicado de tipo definidas pelo utilizador.

source: ``TypeIs`` can be used to annotate the return type of a user-defined type predicate function. ``TypeIs`` only accepts a single type argument. At runtime, functions marked this way should return a boolean and take at least one positional argument.
pt_pt: ``TypeIs`` pode ser usado para anotar o tipo de retorno de uma função de predicado de tipo definida pelo utilizador. ``TypeIs`` aceita apenas um único argumento de tipo. Em tempo de execução, funções marcadas desta forma devem retornar um booleano e aceitar pelo menos um argumento posicional.

source: ``TypeIs`` aims to benefit *type narrowing* -- a technique used by static type checkers to determine a more precise type of an expression within a program's code flow. Usually type narrowing is done by analyzing conditional code flow and applying the narrowing to a block of code. The conditional expression here is sometimes referred to as a "type predicate"::
pt_pt: ``TypeIs`` visa beneficiar o *estreitamento de tipo* -- uma técnica usada por verificadores de tipo estáticos para determinar um tipo mais preciso de uma expressão dentro do fluxo de código de um programa. Normalmente, o estreitamento de tipo é feito analisando o fluxo de código condicional e aplicando o estreitamento a um bloco de código. A expressão condicional aqui é às vezes referida como um "predicado de tipo"::

source: def is_str(val: str | float): # "isinstance" type predicate if isinstance(val, str): # Type of ``val`` is narrowed to ``str`` ... else: # Else, type of ``val`` is narrowed to ``float``. ...
pt_pt: def is_str(val: str | float): # predicado de tipo "isinstance" if isinstance(val, str): # Tipo de ``val`` é estreitado para ``str`` ... else: # Caso contrário, tipo de ``val`` é estreitado para ``float``. ...

source: Sometimes it would be convenient to use a user-defined boolean function as a type predicate. Such a function should use ``TypeIs[...]`` or :data:`TypeGuard` as its return type to alert static type checkers to this intention. ``TypeIs`` usually has more intuitive behavior than ``TypeGuard``, but it cannot be used when the input and output types are incompatible (e.g., ``list[object]`` to ``list[int]``) or when the function does not return ``True`` for all instances of the narrowed type.
pt_pt: Às vezes seria conveniente usar uma função booleana definida pelo utilizador como um predicado de tipo. Essa função deve usar ``TypeIs[...]`` ou :data:`TypeGuard` como seu tipo de retorno para alertar os verificadores de tipo estáticos sobre essa intenção. ``TypeIs`` geralmente tem um comportamento mais intuitivo do que ``TypeGuard``, mas não pode ser usado quando os tipos de entrada e saída são incompatíveis (por exemplo, ``list[object]`` para ``list[int]``) ou quando a função não retorna ``True`` para todas as instâncias do tipo estreitado.

source: Using ``-> TypeIs[NarrowedType]`` tells the static type checker that for a given function:
pt_pt: Usar ``-> TypeIs[NarrowedType]`` diz ao verificador de tipo estático que para uma determinada função:

source: The return value is a boolean.
pt_pt: O valor de retorno é um booleano.

source: If the return value is ``True``, the type of its argument is the intersection of the argument's original type and ``NarrowedType``.
pt_pt: Se o valor de retorno for ``True``, o tipo do seu argumento é a interseção do tipo original do argumento e ``NarrowedType``.

source: If the return value is ``False``, the type of its argument is narrowed to exclude ``NarrowedType``.
pt_pt: Se o valor de retorno for ``False``, o tipo do seu argumento é estreitado para excluir ``NarrowedType``.

source: from typing import assert_type, final, TypeIs class Parent: pass class Child(Parent): pass @final class Unrelated: pass def is_parent(val: object) -> TypeIs[Parent]: return isinstance(val, Parent) def run(arg: Child | Unrelated): if is_parent(arg): # Type of ``arg`` is narrowed to the intersection # of ``Parent`` and ``Child``, which is equivalent to # ``Child``. assert_type(arg, Child) else: # Type of ``arg`` is narrowed to exclude ``Parent``, # so only ``Unrelated`` is left. assert_type(arg, Unrelated)
pt_pt: from typing import assert_type, final, TypeIs class Parent: pass class Child(Parent): pass @final class Unrelated: pass def is_parent(val: object) -> TypeIs[Parent]: return isinstance(val, Parent) def run(arg: Child | Unrelated): if is_parent(arg): # Tipo de ``arg`` é estreitado para a interseção # de ``Parent`` e ``Child``, que é equivalente a # ``Child``. assert_type(arg, Child) else: # Tipo de ``arg`` é estreitado para excluir ``Parent``, # então só ``Unrelated`` resta. assert_type(arg, Unrelated)

source: The type inside ``TypeIs`` must be consistent with the type of the function's argument; if it is not, static type checkers will raise an error. An incorrectly written ``TypeIs`` function can lead to unsound behavior in the type system; it is the user's responsibility to write such functions in a type-safe manner.
pt_pt: O tipo dentro de ``TypeIs`` deve ser consistente com o tipo do argumento da função; se não for, os verificadores de tipo estáticos levantarão um erro. Uma função ``TypeIs`` escrita incorretamente pode levar a um comportamento não sólido no sistema de tipos; é responsabilidade do utilizador escrever essas funções de uma forma segura em termos de tipo.

source: If a ``TypeIs`` function is a class or instance method, then the type in ``TypeIs`` maps to the type of the second parameter (after ``cls`` or ``self``).
pt_pt: Se uma função ``TypeIs`` for um método de classe ou instância, então o tipo em ``TypeIs`` mapeia para o tipo do segundo parâmetro (depois de ``cls`` ou ``self``).

source: In short, the form ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...``, means that if ``foo(arg)`` returns ``True``, then ``arg`` is an instance of ``TypeB``, and if it returns ``False``, it is not an instance of ``TypeB``.
pt_pt: Em resumo, a forma ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...``, significa que se ``foo(arg)`` retornar ``True``, então ``arg`` é uma instância de ``TypeB``, e se retornar ``False``, não é uma instância de ``TypeB``.

source: ``TypeIs`` also works with type variables. For more information, see :pep:`742` (Narrowing types with ``TypeIs``).
pt_pt: ``TypeIs`` também funciona com variáveis de tipo. Para mais informações, veja :pep:`742` (Estreitamento de tipos com ``TypeIs``).

source: Type predicate functions are user-defined functions that return whether their argument is an instance of a particular type. ``TypeGuard`` works similarly to :data:`TypeIs`, but has subtly different effects on type checking behavior (see below).
pt_pt: Funções de predicado de tipo são funções definidas pelo utilizador que retornam se o seu argumento é uma instância de um tipo particular. ``TypeGuard`` funciona de forma semelhante a :data:`TypeIs`, mas tem efeitos subtis diferentes no comportamento de verificação de tipo (veja abaixo).

source: Using ``-> TypeGuard`` tells the static type checker that for a given function:
pt_pt: Usar ``-> TypeGuard`` diz ao verificador de tipo estático que para uma determinada função:

source: If the return value is ``True``, the type of its argument is the type inside ``TypeGuard``.
pt_pt: Se o valor de retorno for ``True``, o tipo do seu argumento é o tipo dentro de ``TypeGuard``.

source: ``TypeGuard`` also works with type variables. See :pep:`647` for more details.
pt_pt: ``TypeGuard`` também funciona com variáveis de tipo. Veja :pep:`647` para mais detalhes.

source: def is_str_list(val: list[object]) -> TypeGuard[list[str]]: '''Determines whether all objects in the list are strings''' return all(isinstance(x, str) for x in val) def func1(val: list[object]): if is_str_list(val): # Type of ``val`` is narrowed to ``list[str]``. print(" ".join(val)) else: # Type of ``val`` remains as ``list[object]``. print("Not a list of strings!")
pt_pt: def is_str_list(val: list[object]) -> TypeGuard[list[str]]: '''Determina se todos os objetos na lista são strings''' return all(isinstance(x, str) for x in val) def func1(val: list[object]): if is_str_list(val): # Tipo de ``val`` é estreitado para ``list[str]``. print(" ".join(val)) else: # Tipo de ``val`` permanece como ``list[object]``. print("Not a list of strings!")

source: ``TypeIs`` and ``TypeGuard`` differ in the following ways:
pt_pt: ``TypeIs`` e ``TypeGuard`` diferem nas seguintes formas:

source: ``TypeIs`` requires the narrowed type to be a subtype of the input type, while ``TypeGuard`` does not. The main reason is to allow for things like narrowing ``list[object]`` to ``list[str]`` even though the latter is not a subtype of the former, since ``list`` is invariant.
pt_pt: ``TypeIs`` requer que o tipo estreitado seja um subtipo do tipo de entrada, enquanto ``TypeGuard`` não. A principal razão é permitir coisas como estreitar ``list[object]`` para ``list[str]`` mesmo que este último não seja um subtipo do primeiro, uma vez que ``list`` é invariante.

source: When a ``TypeGuard`` function returns ``True``, type checkers narrow the type of the variable to exactly the ``TypeGuard`` type. When a ``TypeIs`` function returns ``True``, type checkers can infer a more precise type combining the previously known type of the variable with the ``TypeIs`` type. (Technically, this is known as an intersection type.)
pt_pt: Quando uma função ``TypeGuard`` retorna ``True``, os verificadores de tipo estreitam o tipo da variável para exatamente o tipo ``TypeGuard``. Quando uma função ``TypeIs`` retorna ``True``, os verificadores de tipo podem inferir um tipo mais preciso combinando o tipo conhecido anteriormente da variável com o tipo ``TypeIs``. (Tecnicamente, isto é conhecido como um tipo de interseção.)

source: When a ``TypeGuard`` function returns ``False``, type checkers cannot narrow the type of the variable at all. When a ``TypeIs`` function returns ``False``, type checkers can narrow the type of the variable to exclude the ``TypeIs`` type.
pt_pt: Quando uma função ``TypeGuard`` retorna ``False``, os verificadores de tipo não podem estreitar o tipo da variável de todo. Quando uma função ``TypeIs`` retorna ``False``, os verificadores de tipo podem estreitar o tipo da variável para excluir o tipo ``TypeIs``.

source: Typing operator to conceptually mark an object as having been unpacked.
pt_pt: Operador de tipagem para marcar conceitualmente um objeto como tendo sido descompactado.
