Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: Parameter specification variables exist primarily for the benefit of static type checkers. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. They are only valid when used in ``Concatenate``, or as the first argument to ``Callable``, or as parameters for user-defined Generics. See :class:`Generic` for more information on generic types.
pt_pt: As variáveis de especificação de parâmetros existem principalmente para o benefício dos verificadores de tipo estáticos. Elas são usadas para encaminhar os tipos de parâmetros de um objeto chamável para outro objeto chamável - um padrão comumente encontrado em funções de ordem superior e decoradores. Elas são válidas apenas quando usadas em ``Concatenate``, ou como o primeiro argumento para ``Callable``, ou como parâmetros para Genéricos definidos pelo utilizador. Veja :class:`Generic` para mais informações sobre tipos genéricos.

source: For example, to add basic logging to a function, one can create a decorator ``add_logging`` to log function calls. The parameter specification variable tells the type checker that the callable passed into the decorator and the new callable returned by it have inter-dependent type parameters::
pt_pt: Por exemplo, para adicionar registo básico a uma função, pode-se criar um decorador ``add_logging`` para registar chamadas de função. A variável de especificação de parâmetros diz ao verificador de tipo que o objeto chamável passado para o decorador e o novo objeto chamável retornado por ele têm parâmetros de tipo interdependentes::

source: from collections.abc import Callable import logging def add_logging[T, **P](f: Callable[P, T]) -> Callable[P, T]: '''A type-safe decorator to add logging to a function.''' def inner(*args: P.args, **kwargs: P.kwargs) -> T: logging.info(f'{f.__name__} was called') return f(*args, **kwargs) return inner @add_logging def add_two(x: float, y: float) -> float: '''Add two numbers together.''' return x + y
pt_pt: from collections.abc import Callable import logging def add_logging[T, **P](f: Callable[P, T]) -> Callable[P, T]: '''Um decorador seguro em termos de tipo para adicionar registo a uma função.''' def inner(*args: P.args, **kwargs: P.kwargs) -> T: logging.info(f'{f.__name__} foi chamado') return f(*args, **kwargs) return inner @add_logging def add_two(x: float, y: float) -> float: '''Adicionar dois números.''' return x + y

source: Without ``ParamSpec``, the simplest way to annotate this previously was to use a :class:`TypeVar` with upper bound ``Callable[..., Any]``. However this causes two problems:
pt_pt: Sem ``ParamSpec``, a forma mais simples de anotar isto anteriormente era usar um :class:`TypeVar` com limite superior ``Callable[..., Any]``. No entanto, isto causa dois problemas:

source: The type checker can't type check the ``inner`` function because ``*args`` and ``**kwargs`` have to be typed :data:`Any`.
pt_pt: O verificador de tipo não pode verificar o tipo da função ``inner`` porque ``*args`` e ``**kwargs`` têm de ser tipados como :data:`Any`.

source: :func:`~cast` may be required in the body of the ``add_logging`` decorator when returning the ``inner`` function, or the static type checker must be told to ignore the ``return inner``.
pt_pt: :func:`~cast` pode ser necessário no corpo do decorador ``add_logging`` ao retornar a função ``inner``, ou o verificador de tipo estático deve ser instruído a ignorar o ``return inner``.

source: Since ``ParamSpec`` captures both positional and keyword parameters, ``P.args`` and ``P.kwargs`` can be used to split a ``ParamSpec`` into its components. ``P.args`` represents the tuple of positional parameters in a given call and should only be used to annotate ``*args``. ``P.kwargs`` represents the mapping of keyword parameters to their values in a given call, and should be only be used to annotate ``**kwargs``. Both attributes require the annotated parameter to be in scope. At runtime, ``P.args`` and ``P.kwargs`` are instances respectively of :class:`ParamSpecArgs` and :class:`ParamSpecKwargs`.
pt_pt: Como ``ParamSpec`` captura tanto parâmetros nomeados como posicionais , ``P.args`` e ``P.kwargs`` podem ser usados para dividir um ``ParamSpec`` nos seus componentes. ``P.args`` representa o tuplo de parâmetros posicionais numa chamada dada e deve ser usado apenas para anotar ``*args``. ``P.kwargs`` representa o mapeamento de parâmetros nomeados para os seus valores numa chamada dada, e deve ser usado apenas para anotar ``**kwargs``. Ambos os atributos requerem que o parâmetro anotado esteja no escopo. Em tempo de execução, ``P.args`` e ``P.kwargs`` são instâncias respetivamente de :class:`ParamSpecArgs` e :class:`ParamSpecKwargs`.

source: The name of the parameter specification.
pt_pt: O nome da especificação de parâmetros.

source: The default value of the parameter specification, or :data:`typing.NoDefault` if it has no default.
pt_pt: O valor predefinido da especificação de parâmetros, ou :data:`typing.NoDefault` se não tiver um valor predefinido.

source: Return whether or not the parameter specification has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
pt_pt: Retorna se a especificação de parâmetros tem ou não um valor predefinido. Isto é equivalente a verificar se :attr:`__default__` não é o singleton :data:`typing.NoDefault`, exceto que não força a avaliação do valor predefinido :ref:`avaliado preguiçosamente <lazy-evaluation>`.

source: Parameter specification variables created with ``covariant=True`` or ``contravariant=True`` can be used to declare covariant or contravariant generic types. The ``bound`` argument is also accepted, similar to :class:`TypeVar`. However the actual semantics of these keywords are yet to be decided.
pt_pt: Variáveis de especificação de parâmetros criadas com ``covariant=True`` ou ``contravariant=True`` podem ser usadas para declarar tipos genéricos covariantes ou contravariantes. O argumento ``bound`` também é aceite, semelhante a :class:`TypeVar`. No entanto, a semântica real destas palavras-chave ainda está por decidir.

source: Parameter specifications can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
pt_pt: As especificações de parâmetros podem agora ser declaradas usando a :ref:`sintaxe de parâmetros de tipo <type-params>` introduzida pela :pep:`695`.

source: Only parameter specification variables defined in global scope can be pickled.
pt_pt: Apenas variáveis de especificação de parâmetros definidas no escopo global podem ser serializadas.

source: Arguments and keyword arguments attributes of a :class:`ParamSpec`. The ``P.args`` attribute of a ``ParamSpec`` is an instance of ``ParamSpecArgs``, and ``P.kwargs`` is an instance of ``ParamSpecKwargs``. They are intended for runtime introspection and have no special meaning to static type checkers.
pt_pt: Atributos de argumentos e argumentos nomeados de um :class:`ParamSpec`. O atributo ``P.args`` de um ``ParamSpec`` é uma instância de ``ParamSpecArgs``, e ``P.kwargs`` é uma instância de ``ParamSpecKwargs``. Eles são destinados à introspeção em tempo de execução e não têm significado especial para verificadores de tipo estáticos.

source: Calling :func:`get_origin` on either of these objects will return the original ``ParamSpec``:
pt_pt: Chamar :func:`get_origin` em qualquer um destes objetos retornará o ``ParamSpec`` original:

source: The type of type aliases created through the :keyword:`type` statement.
pt_pt: O tipo de aliases de tipo criados através da instrução :keyword:`type`.

source: The name of the type alias:
pt_pt: O nome do alias de tipo:

source: The name of the module in which the type alias was defined::
pt_pt: O nome do módulo no qual o alias de tipo foi definido::

source: The type parameters of the type alias, or an empty tuple if the alias is not generic:
pt_pt: Os parâmetros de tipo do alias de tipo, ou um tuplo vazio se o alias não for genérico:

source: The type alias's value. This is :ref:`lazily evaluated <lazy-evaluation>`, so names used in the definition of the alias are not resolved until the ``__value__`` attribute is accessed:
pt_pt: O valor do alias de tipo. Isto é :ref:`avaliado preguiçosamente <lazy-evaluation>`, pelo que os nomes usados na definição do alias não são resolvidos até que o atributo ``__value__`` seja acedido:

source: Other special directives
pt_pt: Outras diretivas especiais

source: These functions and classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating and declaring types.
pt_pt: Estas funções e classes não devem ser usadas diretamente como anotações. O seu propósito é serem blocos de construção para criar e declarar tipos.

source: Typed version of :func:`collections.namedtuple`.
pt_pt: Versão tipada de :func:`collections.namedtuple`.

source: Usage::
pt_pt: Utilização::

source: This is equivalent to::
pt_pt: Isto é equivalente a::

source: To give a field a default value, you can assign to it in the class body::
pt_pt: Para dar um valor predefinido a um campo, pode atribuir-lhe um valor no corpo da classe::

source: Fields with a default value must come after any fields without a default.
pt_pt: Os campos com um valor predefinido devem vir depois de quaisquer campos sem um valor predefinido.

source: The resulting class has an extra attribute ``__annotations__`` giving a dict that maps the field names to the field types. (The field names are in the ``_fields`` attribute and the default values are in the ``_field_defaults`` attribute, both of which are part of the :func:`~collections.namedtuple` API.)
pt_pt: A classe resultante tem um atributo extra ``__annotations__`` que fornece um dicionário que mapeia os nomes dos campos para os tipos dos campos. (Os nomes dos campos estão no atributo ``_fields`` e os valores predefinidos estão no atributo ``_field_defaults``, ambos fazem parte da API :func:`~collections.namedtuple`.)

source: ``NamedTuple`` subclasses can also have docstrings and methods::
pt_pt: As subclasses ``NamedTuple`` também podem ter docstrings e métodos::

source: class Employee(NamedTuple): """Represents an employee.""" name: str id: int = 3 def __repr__(self) -> str: return f'<Employee {self.name}, id={self.id}>'
pt_pt: class Employee(NamedTuple): """Representa um empregado.""" name: str id: int = 3 def __repr__(self) -> str: return f'<Employee {self.name}, id={self.id}>'

source: ``NamedTuple`` subclasses can be generic::
pt_pt: As subclasses ``NamedTuple`` podem ser genéricas::

source: Backward-compatible usage::
pt_pt: Utilização retrocompatível::

source: # For creating a generic NamedTuple on Python 3.11 T = TypeVar("T") class Group(NamedTuple, Generic[T]): key: T group: list[T] # A functional syntax is also supported Employee = NamedTuple('Employee', [('name', str), ('id', int)])
pt_pt: # Para criar um NamedTuple genérico no Python 3.11 T = TypeVar("T") class Group(NamedTuple, Generic[T]): key: T group: list[T] # Uma sintaxe funcional também é suportada Employee = NamedTuple('Employee', [('name', str), ('id', int)])

source: Added support for :pep:`526` variable annotation syntax.
pt_pt: Adicionado suporte para a sintaxe de anotação de variáveis :pep:`526`.

source: Added support for default values, methods, and docstrings.
pt_pt: Adicionado suporte para valores predefinidos, métodos e docstrings.

source: The ``_field_types`` and ``__annotations__`` attributes are now regular dictionaries instead of instances of ``OrderedDict``.
pt_pt: Os atributos ``_field_types`` e ``__annotations__`` são agora dicionários regulares em vez de instâncias de ``OrderedDict``.

source: Removed the ``_field_types`` attribute in favor of the more standard ``__annotations__`` attribute which has the same information.
pt_pt: Removido o atributo ``_field_types`` em favor do atributo mais padrão ``__annotations__`` que tem a mesma informação.

source: Added support for generic namedtuples.
pt_pt: Adicionado suporte para namedtuples genéricos.

source: The undocumented keyword argument syntax for creating NamedTuple classes (``NT = NamedTuple("NT", x=int)``) is deprecated, and will be disallowed in 3.15. Use the class-based syntax or the functional syntax instead.
pt_pt: A sintaxe de argumento nomeado não documentada para criar classes NamedTuple (``NT = NamedTuple("NT", x=int)``) está obsoleta e será proibida na versão 3.15. Use a sintaxe baseada em classes ou a sintaxe funcional em vez disso.

source: When using the functional syntax to create a NamedTuple class, failing to pass a value to the 'fields' parameter (``NT = NamedTuple("NT")``) is deprecated. Passing ``None`` to the 'fields' parameter (``NT = NamedTuple("NT", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a NamedTuple class with 0 fields, use ``class NT(NamedTuple): pass`` or ``NT = NamedTuple("NT", [])``.
pt_pt: Ao usar a sintaxe funcional para criar uma classe NamedTuple, falhar ao passar um valor para o parâmetro 'fields' (``NT = NamedTuple("NT")``) está obsoleto. Passar ``None`` para o parâmetro 'fields' (``NT = NamedTuple("NT", None)``) também está obsoleto. Ambos serão proibidos no Python 3.15. Para criar uma classe NamedTuple com 0 campos, use ``class NT(NamedTuple): pass`` ou ``NT = NamedTuple("NT", [])``.

source: Helper class to create low-overhead :ref:`distinct types <distinct>`.
pt_pt: Classe auxiliar para criar :ref:`tipos distintos <distinct>` com baixo overhead.

source: A ``NewType`` is considered a distinct type by a typechecker. At runtime, however, calling a ``NewType`` returns its argument unchanged.
pt_pt: Um ``NewType`` é considerado um tipo distinto por um verificador de tipo. Em tempo de execução, no entanto, chamar um ``NewType`` retorna o seu argumento inalterado.

source: UserId = NewType('UserId', int) # Declare the NewType "UserId" first_user = UserId(1) # "UserId" returns the argument unchanged at runtime
pt_pt: UserId = NewType('UserId', int) # Declarar o NewType "UserId" first_user = UserId(1) # "UserId" retorna o argumento inalterado em tempo de execução

source: The name of the module in which the new type is defined.
pt_pt: O nome do módulo no qual o novo tipo é definido.

source: The name of the new type.
pt_pt: O nome do novo tipo.

source: The type that the new type is based on.
pt_pt: O tipo no qual o novo tipo é baseado.

source: ``NewType`` is now a class rather than a function.
pt_pt: ``NewType`` é agora uma classe em vez de uma função.

source: Base class for protocol classes.
pt_pt: Classe base para classes de protocolo.

source: Protocol classes are defined like this::
pt_pt: As classes de protocolo são definidas assim::

source: Such classes are primarily used with static type checkers that recognize structural subtyping (static duck-typing), for example::
pt_pt: Tais classes são usadas principalmente com verificadores de tipo estáticos que reconhecem subtipagem estrutural (duck-typing estático), por exemplo::

source: class C: def meth(self) -> int: return 0 def func(x: Proto) -> int: return x.meth() func(C()) # Passes static type check
pt_pt: class C: def meth(self) -> int: return 0 def func(x: Proto) -> int: return x.meth() func(C()) # Passa verificação de tipo estático

source: See :pep:`544` for more details. Protocol classes decorated with :func:`runtime_checkable` (described later) act as simple-minded runtime protocols that check only the presence of given attributes, ignoring their type signatures. Protocol classes without this decorator cannot be used as the second argument to :func:`isinstance` or :func:`issubclass`.
pt_pt: Veja :pep:`544` para mais detalhes. Classes de protocolo decoradas com :func:`runtime_checkable` (descritas mais adiante) atuam como protocolos de tempo de execução simplistas que verificam apenas a presença de atributos dados, ignorando as suas assinaturas de tipo. Classes de protocolo sem este decorador não podem ser usadas como segundo argumento para :func:`isinstance` ou :func:`issubclass`.

source: Protocol classes can be generic, for example::
pt_pt: As classes de protocolo podem ser genéricas, por exemplo::

source: In code that needs to be compatible with Python 3.11 or older, generic Protocols can be written as follows::
pt_pt: Em código que precisa ser compatível com o Python 3.11 ou versões anteriores, os Protocolos genéricos podem ser escritos da seguinte forma::

source: Mark a protocol class as a runtime protocol.
pt_pt: Marcar uma classe de protocolo como um protocolo de tempo de execução.

source: Such a protocol can be used with :func:`isinstance` and :func:`issubclass`. This allows a simple-minded structural check, very similar to "one trick ponies" in :mod:`collections.abc` such as :class:`~collections.abc.Iterable`. For example::
pt_pt: Tal protocolo pode ser usado com :func:`isinstance` e :func:`issubclass`. Isto permite uma verificação estrutural simplista, muito semelhante aos "one trick ponies" em :mod:`collections.abc` como :class:`~collections.abc.Iterable`. Por exemplo::

source: This decorator raises :exc:`TypeError` when applied to a non-protocol class.
pt_pt: Este decorador levanta :exc:`TypeError` quando aplicado a uma classe não-protocolo.

source: :func:`!runtime_checkable` will check only the presence of the required methods or attributes, not their type signatures or types. For example, :class:`ssl.SSLObject` is a class, therefore it passes an :func:`issubclass` check against :ref:`Callable <annotating-callables>`. However, the ``ssl.SSLObject.__init__`` method exists only to raise a :exc:`TypeError` with a more informative message, therefore making it impossible to call (instantiate) :class:`ssl.SSLObject`.
pt_pt: :func:`!runtime_checkable` verificará apenas a presença dos métodos ou atributos necessários, não as suas assinaturas de tipo ou tipos. Por exemplo, :class:`ssl.SSLObject` é uma classe, portanto passa numa verificação :func:`issubclass` contra :ref:`Callable <annotating-callables>`. No entanto, o método ``ssl.SSLObject.__init__`` existe apenas para levantar um :exc:`TypeError` com uma mensagem mais informativa, tornando assim impossível chamar (instanciar) :class:`ssl.SSLObject`.

source: An :func:`isinstance` check against a runtime-checkable protocol can be surprisingly slow compared to an ``isinstance()`` check against a non-protocol class. Consider using alternative idioms such as :func:`hasattr` calls for structural checks in performance-sensitive code.
pt_pt: Uma verificação :func:`isinstance` contra um protocolo verificável em tempo de execução pode ser surpreendentemente lenta em comparação com uma verificação ``isinstance()`` contra uma classe não-protocolo. Considere usar idiomas alternativos como chamadas :func:`hasattr` para verificações estruturais em código sensível ao desempenho.

source: The internal implementation of :func:`isinstance` checks against runtime-checkable protocols now uses :func:`inspect.getattr_static` to look up attributes (previously, :func:`hasattr` was used). As a result, some objects which used to be considered instances of a runtime-checkable protocol may no longer be considered instances of that protocol on Python 3.12+, and vice versa. Most users are unlikely to be affected by this change.
pt_pt: A implementação interna de :func:`isinstance` para verificações contra protocolos verificáveis em tempo de execução agora usa :func:`inspect.getattr_static` para procurar atributos (anteriormente, :func:`hasattr` era usado). Como resultado, alguns objetos que costumavam ser considerados instâncias de um protocolo verificável em tempo de execução podem não ser mais considerados instâncias desse protocolo no Python 3.12+, e vice-versa. A maioria dos utilizadores provavelmente não será afetada por esta alteração.

source: The members of a runtime-checkable protocol are now considered "frozen" at runtime as soon as the class has been created. Monkey-patching attributes onto a runtime-checkable protocol will still work, but will have no impact on :func:`isinstance` checks comparing objects to the protocol. See :ref:`What's new in Python 3.12 <whatsnew-typing-py312>` for more details.
pt_pt: Os membros de um protocolo verificável em tempo de execução são agora considerados "congelados" em tempo de execução assim que a classe é criada. Fazer monkey-patching de atributos num protocolo verificável em tempo de execução ainda funcionará, mas não terá impacto nas verificações :func:`isinstance` que comparam objetos com o protocolo. Veja :ref:`O que há de novo no Python 3.12 <whatsnew-typing-py312>` para mais detalhes.

source: ``TypedDict`` declares a dictionary type that expects all of its instances to have a certain set of keys, where each key is associated with a value of a consistent type. This expectation is not checked at runtime but is only enforced by type checkers. Usage::
pt_pt: ``TypedDict`` declara um tipo de dicionário que espera que todas as suas instâncias tenham um certo conjunto de chaves, onde cada chave está associada a um valor de um tipo consistente. Esta expectativa não é verificada em tempo de execução, mas é apenas aplicada pelos verificadores de tipo. Utilização::

source: class Point2D(TypedDict): x: int y: int label: str a: Point2D = {'x': 1, 'y': 2, 'label': 'good'} # OK b: Point2D = {'z': 3, 'label': 'bad'} # Fails type check assert Point2D(x=1, y=2, label='first') == dict(x=1, y=2, label='first')
pt_pt: class Point2D(TypedDict): x: int y: int label: str a: Point2D = {'x': 1, 'y': 2, 'label': 'good'} # OK b: Point2D = {'z': 3, 'label': 'bad'} # Falha na verificação de tipo assert Point2D(x=1, y=2, label='first') == dict(x=1, y=2, label='first')

source: An alternative way to create a ``TypedDict`` is by using function-call syntax. The second argument must be a literal :class:`dict`::
pt_pt: Uma forma alternativa de criar um ``TypedDict`` é usando a sintaxe de chamada de função. O segundo argumento deve ser um :class:`dict` literal::

source: This functional syntax allows defining keys which are not valid :ref:`identifiers <identifiers>`, for example because they are keywords or contain hyphens, or when key names must not be :ref:`mangled <private-name-mangling>` like regular private names::
pt_pt: Esta sintaxe funcional permite definir chaves que não são identificadores válidos :ref:`identifiers <identifiers>`, por exemplo, porque são palavras reservadas ou contêm hífenes, ou quando os nomes das chaves não devem ser :ref:`mangados <private-name-mangling>` como nomes privados normais::

source: # raises SyntaxError class Point2D(TypedDict): in: int # 'in' is a keyword x-y: int # name with hyphens class Definition(TypedDict): __schema: str # mangled to `_Definition__schema` # OK, functional syntax Point2D = TypedDict('Point2D', {'in': int, 'x-y': int}) Definition = TypedDict('Definition', {'__schema': str}) # not mangled
pt_pt: # levanta SyntaxError class Point2D(TypedDict): in: int # 'in' é uma palavra reservada x-y: int # nome com hífenes class Definition(TypedDict): __schema: str # mangado para `_Definition__schema` # OK, sintaxe funcional Point2D = TypedDict('Point2D', {'in': int, 'x-y': int}) Definition = TypedDict('Definition', {'__schema': str}) # não mangado

source: By default, all keys must be present in a ``TypedDict``. It is possible to mark individual keys as non-required using :data:`NotRequired`::
pt_pt: Por predefinição, todas as chaves devem estar presentes num ``TypedDict``. É possível marcar chaves individuais como não obrigatórias usando :data:`NotRequired`::
