Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: An alias for the ``default_factory`` parameter on field specifiers.
pt_pt: Um alias para o parâmetro ``default_factory`` em especificadores de campo.

source: Indicates whether the field should be marked as keyword-only. If ``True``, the field will be keyword-only. If ``False``, it will not be keyword-only. If unspecified, the value of the ``kw_only`` parameter on the object decorated with ``dataclass_transform`` will be used, or if that is unspecified, the value of ``kw_only_default`` on ``dataclass_transform`` will be used.
pt_pt: Indica se o campo deve ser marcado como apenas palavra-chave. Se ``True``, o campo será apenas palavra-chave. Se ``False``, não será apenas palavra-chave. Se não especificado, será usado o valor do parâmetro ``kw_only`` no objeto decorado com ``dataclass_transform``, ou, se esse não estiver especificado, será usado o valor de ``kw_only_default`` em ``dataclass_transform``.

source: Provides an alternative name for the field. This alternative name is used in the synthesized ``__init__`` method.
pt_pt: Fornece um nome alternativo para o campo. Este nome alternativo é usado no método ``__init__`` sintetizado.

source: At runtime, this decorator records its arguments in the ``__dataclass_transform__`` attribute on the decorated object. It has no other runtime effect.
pt_pt: Em tempo de execução, este decorador regista os seus argumentos no atributo ``__dataclass_transform__`` no objeto decorado. Não tem nenhum outro efeito em tempo de execução.

source: See :pep:`681` for more details.
pt_pt: Veja :pep:`681` para mais detalhes.

source: Decorator for creating overloaded functions and methods.
pt_pt: Decorador para criar funções e métodos sobrecarregados.

source: The ``@overload`` decorator allows describing functions and methods that support multiple different combinations of argument types. A series of ``@overload``-decorated definitions must be followed by exactly one non-``@overload``-decorated definition (for the same function/method).
pt_pt: O decorador ``@overload`` permite descrever funções e métodos que suportam múltiplas combinações diferentes de tipos de argumentos. Uma série de ``@overload``-decorated definitions must be followed by exactly one non-``@overload`` (para a mesma função/método).

source: ``@overload``-decorated definitions are for the benefit of the type checker only, since they will be overwritten by the non-``@overload``-decorated definition. The non-``@overload``-decorated definition, meanwhile, will be used at runtime but should be ignored by a type checker. At runtime, calling an ``@overload``-decorated function directly will raise :exc:`NotImplementedError`.
pt_pt: As definições decoradas com ``@overload`` são apenas para benefício do verificador de tipo, uma vez que serão sobrescritas pela definição não decorada com ``@overload``. A definição não decorada com ``@overload``, por sua vez, será usada em tempo de execução, mas deve ser ignorada pelo verificador de tipo. Em tempo de execução, chamar diretamente uma função decorada com ``@overload`` levantará :exc:`NotImplementedError`.

source: An example of overload that gives a more precise type than can be expressed using a union or a type variable:
pt_pt: Um exemplo de sobrecarga que fornece um tipo mais preciso do que pode ser expresso usando uma união ou uma variável de tipo:

source: @overload def process(response: None) -> None: ... @overload def process(response: int) -> tuple[int, str]: ... @overload def process(response: bytes) -> str: ... def process(response): ... # actual implementation goes here
pt_pt: @overload def process(response: None) -> None: ... @overload def process(response: int) -> tuple[int, str]: ... @overload def process(response: bytes) -> str: ... def process(response): ... # a implementação real vai aqui

source: See :pep:`484` for more details and comparison with other typing semantics.
pt_pt: Veja :pep:`484` para mais detalhes e comparação com outras semânticas de tipagem.

source: Overloaded functions can now be introspected at runtime using :func:`get_overloads`.
pt_pt: Funções sobrecarregadas podem agora ser introspecionadas em tempo de execução usando :func:`get_overloads`.

source: Return a sequence of :deco:`overload`-decorated definitions for *func*.
pt_pt: Devolve uma sequência de definições decoradas com :deco:`overload` para *func*.

source: *func* is the function object for the implementation of the overloaded function. For example, given the definition of ``process`` in the documentation for :deco:`overload`, ``get_overloads(process)`` will return a sequence of three function objects for the three defined overloads. If called on a function with no overloads, ``get_overloads()`` returns an empty sequence.
pt_pt: *func* é o objeto função para a implementação da função sobrecarregada. Por exemplo, dada a definição de ``process`` na documentação de :deco:`overload`, ``get_overloads(process)`` devolverá uma sequência de três objetos função para as três sobrecargas definidas. Se chamado numa função sem sobrecargas, ``get_overloads()`` devolve uma sequência vazia.

source: ``get_overloads()`` can be used for introspecting an overloaded function at runtime.
pt_pt: ``get_overloads()`` pode ser usado para introspeção de uma função sobrecarregada em tempo de execução.

source: Clear all registered overloads in the internal registry.
pt_pt: Limpar todas as sobrecargas registadas no registo interno.

source: This can be used to reclaim the memory used by the registry.
pt_pt: Isto pode ser usado para libertar a memória usada pelo registo.

source: Decorator to indicate final methods and final classes.
pt_pt: Decorador para indicar métodos finais e classes finais.

source: Decorating a method with ``@final`` indicates to a type checker that the method cannot be overridden in a subclass. Decorating a class with ``@final`` indicates that it cannot be subclassed.
pt_pt: Decorar um método com ``@final`` indica ao verificador de tipo que o método não pode ser sobrescrito numa subclasse. Decorar uma classe com ``@final`` indica que esta não pode ser subclassificada.

source: class Base: @final def done(self) -> None: ... class Sub(Base): def done(self) -> None: # Error reported by type checker ... @final class Leaf: ... class Other(Leaf): # Error reported by type checker ...
pt_pt: class Base: @final def done(self) -> None: ... class Sub(Base): def done(self) -> None: # Erro reportado pelo verificador de tipo ... @final class Leaf: ... class Other(Leaf): # Erro reportado pelo verificador de tipo ...

source: The decorator will now attempt to set a ``__final__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__final__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as final. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
pt_pt: O decorador tentará agora definir um atributo ``__final__`` para ``True`` no objeto decorado. Assim, uma verificação como ``if getattr(obj, "__final__", False)`` pode ser usada em tempo de execução para determinar se um objeto ``obj`` foi marcado como final. Se o objeto decorado não suportar a definição de atributos, o decorador devolve o objeto inalterado sem levantar uma exceção.

source: Decorator to indicate that annotations are not type hints.
pt_pt: Decorador para indicar que as anotações não são dicas de tipo.

source: This works as a class or function :term:`decorator`. With a class, it applies recursively to all methods and classes defined in that class (but not to methods defined in its superclasses or subclasses). Type checkers will ignore all annotations in a function or class with this decorator.
pt_pt: Funciona como um decorador de classe ou função. Com uma classe, aplica-se recursivamente a todos os métodos e classes definidos nessa classe (mas não aos métodos definidos nas suas superclasses ou subclasses). Os verificadores de tipo ignorarão todas as anotações numa função ou classe com este decorador.

source: ``@no_type_check`` mutates the decorated object in place.
pt_pt: ``@no_type_check`` modifica o objeto decorado no local.

source: Decorator to give another decorator the :func:`no_type_check` effect.
pt_pt: Decorador para dar a outro decorador o efeito de :func:`no_type_check`.

source: This wraps the decorator with something that wraps the decorated function in :func:`no_type_check`.
pt_pt: Isto envolve o decorador com algo que envolve a função decorada em :func:`no_type_check`.

source: No type checker ever added support for ``@no_type_check_decorator``. It is therefore deprecated, and will be removed in Python 3.15.
pt_pt: Nenhum verificador de tipo adicionou suporte para ``@no_type_check_decorator``. Está, portanto, obsoleto e será removido no Python 3.15.

source: Decorator to indicate that a method in a subclass is intended to override a method or attribute in a superclass.
pt_pt: Decorador para indicar que um método numa subclasse destina-se a sobrescrever um método ou atributo numa superclasse.

source: Type checkers should emit an error if a method decorated with ``@override`` does not, in fact, override anything. This helps prevent bugs that may occur when a base class is changed without an equivalent change to a child class.
pt_pt: Os verificadores de tipo devem emitir um erro se um método decorado com ``@override`` não sobrescrever, de facto, nada. Isto ajuda a prevenir erros que podem ocorrer quando uma classe base é alterada sem uma alteração equivalente na classe filha.

source: class Base: def log_status(self) -> None: ... class Sub(Base): @override def log_status(self) -> None: # Okay: overrides Base.log_status ... @override def done(self) -> None: # Error reported by type checker ...
pt_pt: class Base: def log_status(self) -> None: ... class Sub(Base): @override def log_status(self) -> None: # OK: sobrescreve Base.log_status ... @override def done(self) -> None: # Erro reportado pelo verificador de tipo ...

source: There is no runtime checking of this property.
pt_pt: Não há verificação em tempo de execução desta propriedade.

source: The decorator will attempt to set an ``__override__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__override__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as an override. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
pt_pt: O decorador tentará definir um atributo ``__override__`` para ``True`` no objeto decorado. Assim, uma verificação como ``if getattr(obj, "__override__", False)`` pode ser usada em tempo de execução para determinar se um objeto ``obj`` foi marcado como uma sobrescrita. Se o objeto decorado não suportar a definição de atributos, o decorador devolve o objeto inalterado sem levantar uma exceção.

source: See :pep:`698` for more details.
pt_pt: Consulte :pep:`698` para mais detalhes.

source: Decorator to mark a class or function as unavailable at runtime.
pt_pt: Decorador para marcar uma classe ou função como indisponível em tempo de execução.

source: This decorator is itself not available at runtime. It is mainly intended to mark classes that are defined in type stub files if an implementation returns an instance of a private class::
pt_pt: Este decorador não está disponível em tempo de execução. Destina-se principalmente a marcar classes definidas em ficheiros de stub de tipo se uma implementação devolver uma instância de uma classe privada::

source: @type_check_only class Response: # private or not available at runtime code: int def get_header(self, name: str) -> str: ... def fetch_response() -> Response: ...
pt_pt: @type_check_only class Response: # privada ou não disponível em tempo de execução code: int def get_header(self, name: str) -> str: ... def fetch_response() -> Response: ...

source: Note that returning instances of private classes is not recommended. It is usually preferable to make such classes public.
pt_pt: Note que devolver instâncias de classes privadas não é recomendado. Geralmente, é preferível tornar essas classes públicas.

source: Introspection helpers
pt_pt: Auxiliares de introspeção

source: Return a dictionary containing type hints for a function, method, module or class object.
pt_pt: Devolve um dicionário contendo dicas de tipo para uma função, método, módulo ou objeto de classe.

source: This is often the same as ``obj.__annotations__``, but this function makes the following changes to the annotations dictionary:
pt_pt: Isto é frequentemente o mesmo que ``obj.__annotations__``, mas esta função faz as seguintes alterações ao dicionário de anotações:

source: Forward references encoded as string literals or :class:`ForwardRef` objects are handled by evaluating them in *globalns*, *localns*, and (where applicable) *obj*'s :ref:`type parameter <type-params>` namespace. If *globalns* or *localns* is not given, appropriate namespace dictionaries are inferred from *obj*.
pt_pt: Referências antecipadas codificadas como literais de string ou objetos :class:`ForwardRef` são tratadas avaliando-as em *globalns*, *localns* e (onde aplicável) no espaço de nomes do :ref:`parâmetro de tipo <type-params>` de *obj*. Se *globalns* ou *localns* não forem fornecidos, os dicionários de espaço de nomes apropriados são inferidos de *obj*.

source: ``None`` is replaced with :class:`types.NoneType`.
pt_pt: ``None`` é substituído por :class:`types.NoneType`.

source: If :deco:`no_type_check` has been applied to *obj*, an empty dictionary is returned.
pt_pt: Se :deco:`no_type_check` tiver sido aplicado a *obj*, é devolvido um dicionário vazio.

source: If *obj* is a class ``C``, the function returns a dictionary that merges annotations from ``C``'s base classes with those on ``C`` directly. This is done by traversing :attr:`C.__mro__ <type.__mro__>` and iteratively combining ``__annotations__`` dictionaries. Annotations on classes appearing earlier in the :term:`method resolution order` always take precedence over annotations on classes appearing later in the method resolution order.
pt_pt: Se *obj* for uma classe ``C``, a função devolve um dicionário que combina anotações das classes base de ``C`` com as de ``C`` diretamente. Isto é feito percorrendo :attr:`C.__mro__ <type.__mro__>` e combinando iterativamente os dicionários ``__annotations__``. As anotações em classes que aparecem mais cedo na :term:`ordem de resolução de métodos` têm sempre precedência sobre anotações em classes que aparecem mais tarde na ordem de resolução de métodos.

source: The function recursively replaces all occurrences of ``Annotated[T, ...]``, ``Required[T]``, ``NotRequired[T]``, and ``ReadOnly[T]`` with ``T``, unless *include_extras* is set to ``True`` (see :class:`Annotated` for more information).
pt_pt: A função substitui recursivamente todas as ocorrências de ``Annotated[T, ...]``, ``Required[T]``, ``NotRequired[T]`` e ``ReadOnly[T]`` por ``T``, a menos que *include_extras* esteja definido como ``True`` (consulte :class:`Annotated` para mais informações).

source: If any forward references in the annotations of *obj* are not resolvable or are not valid Python code, this function will raise an exception such as :exc:`NameError`. For example, this can happen with imported :ref:`type aliases <type-aliases>` that include forward references, or with names imported under :data:`if TYPE_CHECKING <TYPE_CHECKING>`.
pt_pt: Se quaisquer referências antecipadas nas anotações de *obj* não forem resolúveis ou não forem código Python válido, esta função levantará uma exceção como :exc:`NameError`. Por exemplo, isto pode acontecer com :ref:`aliases de tipo <type-aliases>` importados que incluem referências antecipadas, ou com nomes importados sob :data:`if TYPE_CHECKING <TYPE_CHECKING>`.

source: Added ``include_extras`` parameter as part of :pep:`593`. See the documentation on :data:`Annotated` for more information.
pt_pt: Adicionado o parâmetro ``include_extras`` como parte de :pep:`593`. Consulte a documentação sobre :data:`Annotated` para mais informações.

source: Previously, ``Optional[t]`` was added for function and method annotations if a default value equal to ``None`` was set. Now the annotation is returned unchanged.
pt_pt: Anteriormente, ``Optional[t]`` era adicionado para anotações de função e método se um valor predefinido igual a ``None`` fosse definido. Agora, a anotação é devolvida inalterada.

source: Get the unsubscripted version of a type: for a typing object of the form ``X[Y, Z, ...]`` return ``X``.
pt_pt: Obter a versão não subscrita de um tipo: para um objeto de tipagem da forma ``X[Y, Z, ...]``, devolve ``X``.

source: If ``X`` is a typing-module alias for a builtin or :mod:`collections` class, it will be normalized to the original class. If ``X`` is an instance of :class:`ParamSpecArgs` or :class:`ParamSpecKwargs`, return the underlying :class:`ParamSpec`. Return ``None`` for unsupported objects.
pt_pt: Se ``X`` for um alias de módulo de tipagem para uma classe built-in ou :mod:`collections`, será normalizado para a classe original. Se ``X`` for uma instância de :class:`ParamSpecArgs` ou :class:`ParamSpecKwargs`, devolve o :class:`ParamSpec` subjacente. Devolve ``None`` para objetos não suportados.

source: Examples:
pt_pt: Exemplos:

source: Get type arguments with all substitutions performed: for a typing object of the form ``X[Y, Z, ...]`` return ``(Y, Z, ...)``.
pt_pt: Obter argumentos de tipo com todas as substituições efetuadas: para um objeto de tipagem da forma ``X[Y, Z, ...]``, devolve ``(Y, Z, ...)``.

source: If ``X`` is a union or :class:`Literal` contained in another generic type, the order of ``(Y, Z, ...)`` may be different from the order of the original arguments ``[Y, Z, ...]`` due to type caching. Return ``()`` for unsupported objects.
pt_pt: Se ``X`` for uma união ou :class:`Literal` contida noutro tipo genérico, a ordem de ``(Y, Z, ...)`` pode ser diferente da ordem dos argumentos originais ``[Y, Z, ...]`` devido ao cache de tipos. Devolve ``()`` para objetos não suportados.

source: Return the set of members defined in a :class:`Protocol`.
pt_pt: Devolve o conjunto de membros definidos num :class:`Protocol`.

source: Raise :exc:`TypeError` for arguments that are not Protocols.
pt_pt: Levanta :exc:`TypeError` para argumentos que não sejam Protocolos.

source: Determine if a type is a :class:`Protocol`.
pt_pt: Determinar se um tipo é um :class:`Protocol`.

source: Check if a type is a :class:`TypedDict`.
pt_pt: Verificar se um tipo é um :class:`TypedDict`.

source: class Film(TypedDict): title: str year: int assert is_typeddict(Film) assert not is_typeddict(list | str) # TypedDict is a factory for creating typed dicts, # not a typed dict itself assert not is_typeddict(TypedDict)
pt_pt: class Film(TypedDict): title: str year: int assert is_typeddict(Film) assert not is_typeddict(list | str) # TypedDict é uma fábrica para criar dicionários tipados, # não é um dicionário tipado em si assert not is_typeddict(TypedDict)

source: Class used for internal typing representation of string forward references.
pt_pt: Classe usada para representação interna de tipagem de referências antecipadas de string.

source: :pep:`585` generic types such as ``list["SomeClass"]`` will not be implicitly transformed into ``list[ForwardRef("SomeClass")]`` and thus will not automatically resolve to ``list[SomeClass]``.
pt_pt: Tipos genéricos :pep:`585`, como ``list["SomeClass"]``, não serão implicitamente transformados em ``list[ForwardRef("SomeClass")]`` e, assim, não serão automaticamente resolvidos para ``list[SomeClass]``.

source: A sentinel object used to indicate that a type parameter has no default value. For example:
pt_pt: Um objeto sentinela usado para indicar que um parâmetro de tipo não tem um valor predefinido. Por exemplo:

source: Constant
pt_pt: Constante

source: Deprecated aliases
pt_pt: Aliases obsoletos

source: This module defines several deprecated aliases to pre-existing standard library classes. These were originally included in the :mod:`!typing` module in order to support parameterizing these generic classes using ``[]``. However, the aliases became redundant in Python 3.9 when the corresponding pre-existing classes were enhanced to support ``[]`` (see :pep:`585`).
pt_pt: Este módulo define vários aliases obsoletos para classes existentes na biblioteca padrão. Estes foram originalmente incluídos no módulo :mod:`!typing` para suportar a parametrização destas classes genéricas usando ``[]``. No entanto, os aliases tornaram-se redundantes no Python 3.9, quando as classes pré-existentes correspondentes foram melhoradas para suportar ``[]`` (veja :pep:`585`).

source: The redundant types are deprecated as of Python 3.9. However, while the aliases may be removed at some point, removal of these aliases is not currently planned. As such, no deprecation warnings are currently issued by the interpreter for these aliases.
pt_pt: Os tipos redundantes estão obsoletos desde o Python 3.9. No entanto, embora os aliases possam ser removidos em algum momento, a remoção destes aliases não está atualmente planeada. Como tal, não são emitidos avisos de obsolescência pelo interpretador para estes aliases.

source: If at some point it is decided to remove these deprecated aliases, a deprecation warning will be issued by the interpreter for at least two releases prior to removal. The aliases are guaranteed to remain in the :mod:`!typing` module without deprecation warnings until at least Python 3.14.
pt_pt: Se em algum momento for decidido remover estes aliases obsoletos, um aviso de obsolescência será emitido pelo interpretador durante pelo menos duas versões antes da remoção. Os aliases estão garantidos de permanecer no módulo :mod:`!typing` sem avisos de obsolescência até pelo menos o Python 3.14.

source: Type checkers are encouraged to flag uses of the deprecated types if the program they are checking targets a minimum Python version of 3.9 or newer.
pt_pt: Os verificadores de tipo são incentivados a sinalizar o uso dos tipos obsoletos se o programa que estão a verificar tiver como alvo uma versão mínima do Python de 3.9 ou superior.

source: Aliases to built-in types
pt_pt: Aliases para tipos built-in

source: Deprecated alias to :class:`dict`.
pt_pt: Alias obsoleto para :class:`dict`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Mapping` rather than to use :class:`dict` or :class:`!typing.Dict`.
pt_pt: Note que, para anotar argumentos, é preferível usar um tipo de coleção abstrato, como :class:`~collections.abc.Mapping`, em vez de usar :class:`dict` ou :class:`!typing.Dict`.

source: :class:`builtins.dict <dict>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`builtins.dict <dict>` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`list`.
pt_pt: Alias obsoleto para :class:`list`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Sequence` or :class:`~collections.abc.Iterable` rather than to use :class:`list` or :class:`!typing.List`.
pt_pt: Note que, para anotar argumentos, é preferível usar um tipo de coleção abstrato, como :class:`~collections.abc.Sequence` ou :class:`~collections.abc.Iterable`, em vez de usar :class:`list` ou :class:`!typing.List`.
