Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/typing.po
Languages: pt_pt

source: :class:`builtins.list <list>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`builtins.list <list>` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.set <set>`.
pt_pt: Alias obsoleto para :class:`builtins.set <set>`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`collections.abc.Set` rather than to use :class:`set` or :class:`typing.Set`.
pt_pt: Note que, para anotar argumentos, é preferível usar um tipo de coleção abstrato, como :class:`collections.abc.Set`, em vez de usar :class:`set` ou :class:`typing.Set`.

source: :class:`builtins.set <set>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`builtins.set <set>` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.frozenset <frozenset>`.
pt_pt: Alias obsoleto para :class:`builtins.frozenset <frozenset>`.

source: :class:`builtins.frozenset <frozenset>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`builtins.frozenset <frozenset>` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias for :class:`tuple`.
pt_pt: Alias obsoleto para :class:`tuple`.

source: :class:`tuple` and ``Tuple`` are special-cased in the type system; see :ref:`annotating-tuples` for more details.
pt_pt: :class:`tuple` e ``Tuple`` são casos especiais no sistema de tipos; veja :ref:`annotating-tuples` para mais detalhes.

source: :class:`builtins.tuple <tuple>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`builtins.tuple <tuple>` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`type`.
pt_pt: Alias obsoleto para :class:`type`.

source: See :ref:`type-of-class-objects` for details on using :class:`type` or ``typing.Type`` in type annotations.
pt_pt: Veja :ref:`type-of-class-objects` para detalhes sobre o uso de :class:`type` ou ``typing.Type`` em anotações de tipo.

source: :class:`builtins.type <type>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`builtins.type <type>` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Aliases to types in :mod:`collections`
pt_pt: Aliases para tipos em :mod:`collections`

source: Deprecated alias to :class:`collections.defaultdict`.
pt_pt: Alias obsoleto para :class:`collections.defaultdict`.

source: :class:`collections.defaultdict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.defaultdict` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.OrderedDict`.
pt_pt: Alias obsoleto para :class:`collections.OrderedDict`.

source: :class:`collections.OrderedDict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.OrderedDict` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.ChainMap`.
pt_pt: Alias obsoleto para :class:`collections.ChainMap`.

source: :class:`collections.ChainMap` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.ChainMap` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.Counter`.
pt_pt: Alias obsoleto para :class:`collections.Counter`.

source: :class:`collections.Counter` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.Counter` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.deque`.
pt_pt: Alias obsoleto para :class:`collections.deque`.

source: :class:`collections.deque` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.deque` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Aliases to other concrete types
pt_pt: Aliases para outros tipos concretos

source: Deprecated aliases corresponding to the return types from :func:`re.compile` and :func:`re.match`.
pt_pt: Aliases obsoletos correspondentes aos tipos de retorno de :func:`re.compile` e :func:`re.match`.

source: These types (and the corresponding functions) are generic over :data:`AnyStr`. ``Pattern`` can be specialised as ``Pattern[str]`` or ``Pattern[bytes]``; ``Match`` can be specialised as ``Match[str]`` or ``Match[bytes]``.
pt_pt: Estes tipos (e as funções correspondentes) são genéricos sobre :data:`AnyStr`. ``Pattern`` pode ser especializado como ``Pattern[str]`` ou ``Pattern[bytes]``; ``Match`` pode ser especializado como ``Match[str]`` ou ``Match[bytes]``.

source: Classes ``Pattern`` and ``Match`` from :mod:`re` now support ``[]``. See :pep:`585` and :ref:`types-genericalias`.
pt_pt: As classes ``Pattern`` e ``Match`` de :mod:`re` agora suportam ``[]``. Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias for :class:`str`.
pt_pt: Alias obsoleto para :class:`str`.

source: ``Text`` is provided to supply a forward compatible path for Python 2 code: in Python 2, ``Text`` is an alias for ``unicode``.
pt_pt: ``Text`` é fornecido para oferecer um caminho compatível com versões futuras para código Python 2: no Python 2, ``Text`` é um alias para ``unicode``.

source: Use ``Text`` to indicate that a value must contain a unicode string in a manner that is compatible with both Python 2 and Python 3::
pt_pt: Use ``Text`` para indicar que um valor deve conter uma string unicode de uma forma compatível com Python 2 e Python 3::

source: Python 2 is no longer supported, and most type checkers also no longer support type checking Python 2 code. Removal of the alias is not currently planned, but users are encouraged to use :class:`str` instead of ``Text``.
pt_pt: O Python 2 já não é suportado, e a maioria dos verificadores de tipo também já não suporta a verificação de tipo de código Python 2. A remoção do alias não está atualmente planeada, mas os utilizadores são incentivados a usar :class:`str` em vez de ``Text``.

source: Aliases to container ABCs in :mod:`collections.abc`
pt_pt: Aliases para ABCs de contentores em :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Set`.
pt_pt: Alias obsoleto para :class:`collections.abc.Set`.

source: :class:`collections.abc.Set` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Set` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ByteString`.
pt_pt: Alias obsoleto para :class:`collections.abc.ByteString`.

source: Use ``isinstance(obj, collections.abc.Buffer)`` to test if ``obj`` implements the :ref:`buffer protocol <bufferobjects>` at runtime. For use in type annotations, either use :class:`~collections.abc.Buffer` or a union that explicitly specifies the types your code supports (e.g., ``bytes | bytearray | memoryview``).
pt_pt: Use ``isinstance(obj, collections.abc.Buffer)`` para testar se ``obj`` implementa o :ref:`protocolo de buffer <bufferobjects>` em tempo de execução. Para uso em anotações de tipo, use :class:`~collections.abc.Buffer` ou uma união que especifique explicitamente os tipos que o seu código suporta (por exemplo, ``bytes | bytearray | memoryview``).

source: :class:`!ByteString` was originally intended to be an abstract class that would serve as a supertype of both :class:`bytes` and :class:`bytearray`. However, since the ABC never had any methods, knowing that an object was an instance of :class:`!ByteString` never actually told you anything useful about the object. Other common buffer types such as :class:`memoryview` were also never understood as subtypes of :class:`!ByteString` (either at runtime or by static type checkers).
pt_pt: :class:`!ByteString` foi originalmente concebida para ser uma classe abstrata que serviria como supertipo de :class:`bytes` e :class:`bytearray`. No entanto, uma vez que a ABC nunca teve quaisquer métodos, saber que um objeto era uma instância de :class:`!ByteString` nunca lhe dizia nada de útil sobre o objeto. Outros tipos comuns de buffer, como :class:`memoryview`, também nunca foram compreendidos como subtipos de :class:`!ByteString` (nem em tempo de execução nem por verificadores de tipo estáticos).

source: See :pep:`PEP 688 <688#current-options>` for more details.
pt_pt: Veja :pep:`PEP 688 <688#current-options>` para mais detalhes.

source: Deprecated alias to :class:`collections.abc.Collection`.
pt_pt: Alias obsoleto para :class:`collections.abc.Collection`.

source: :class:`collections.abc.Collection` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Collection` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Container`.
pt_pt: Alias obsoleto para :class:`collections.abc.Container`.

source: :class:`collections.abc.Container` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Container` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ItemsView`.
pt_pt: Alias obsoleto para :class:`collections.abc.ItemsView`.

source: :class:`collections.abc.ItemsView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.ItemsView` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.KeysView`.
pt_pt: Alias obsoleto para :class:`collections.abc.KeysView`.

source: :class:`collections.abc.KeysView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.KeysView` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Mapping`.
pt_pt: Alias obsoleto para :class:`collections.abc.Mapping`.

source: :class:`collections.abc.Mapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Mapping` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MappingView`.
pt_pt: Alias obsoleto para :class:`collections.abc.MappingView`.

source: :class:`collections.abc.MappingView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.MappingView` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableMapping`.
pt_pt: Alias obsoleto para :class:`collections.abc.MutableMapping`.

source: :class:`collections.abc.MutableMapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.MutableMapping` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSequence`.
pt_pt: Alias obsoleto para :class:`collections.abc.MutableSequence`.

source: :class:`collections.abc.MutableSequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.MutableSequence` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSet`.
pt_pt: Alias obsoleto para :class:`collections.abc.MutableSet`.

source: :class:`collections.abc.MutableSet` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.MutableSet` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sequence`.
pt_pt: Alias obsoleto para :class:`collections.abc.Sequence`.

source: :class:`collections.abc.Sequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Sequence` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ValuesView`.
pt_pt: Alias obsoleto para :class:`collections.abc.ValuesView`.

source: :class:`collections.abc.ValuesView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.ValuesView` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Aliases to asynchronous ABCs in :mod:`collections.abc`
pt_pt: Aliases para ABCs assíncronos em :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Coroutine`.
pt_pt: Alias obsoleto para :class:`collections.abc.Coroutine`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Coroutine` and ``typing.Coroutine`` in type annotations.
pt_pt: Veja :ref:`annotating-generators-and-coroutines` para detalhes sobre o uso de :class:`collections.abc.Coroutine` e ``typing.Coroutine`` em anotações de tipo.

source: :class:`collections.abc.Coroutine` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Coroutine` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncGenerator`.
pt_pt: Alias obsoleto para :class:`collections.abc.AsyncGenerator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.AsyncGenerator` and ``typing.AsyncGenerator`` in type annotations.
pt_pt: Veja :ref:`annotating-generators-and-coroutines` para detalhes sobre o uso de :class:`collections.abc.AsyncGenerator` e ``typing.AsyncGenerator`` em anotações de tipo.

source: :class:`collections.abc.AsyncGenerator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.AsyncGenerator` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: The ``SendType`` parameter now has a default.
pt_pt: O parâmetro ``SendType`` agora tem um valor predefinido.

source: Deprecated alias to :class:`collections.abc.AsyncIterable`.
pt_pt: Alias obsoleto para :class:`collections.abc.AsyncIterable`.

source: :class:`collections.abc.AsyncIterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.AsyncIterable` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncIterator`.
pt_pt: Alias obsoleto para :class:`collections.abc.AsyncIterator`.

source: :class:`collections.abc.AsyncIterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.AsyncIterator` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Awaitable`.
pt_pt: Alias obsoleto para :class:`collections.abc.Awaitable`.

source: :class:`collections.abc.Awaitable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Awaitable` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Aliases to other ABCs in :mod:`collections.abc`
pt_pt: Aliases para outras ABCs em :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Iterable`.
pt_pt: Alias obsoleto para :class:`collections.abc.Iterable`.

source: :class:`collections.abc.Iterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Iterable` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Iterator`.
pt_pt: Alias obsoleto para :class:`collections.abc.Iterator`.

source: :class:`collections.abc.Iterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Iterator` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Callable`.
pt_pt: Alias obsoleto para :class:`collections.abc.Callable`.

source: See :ref:`annotating-callables` for details on how to use :class:`collections.abc.Callable` and ``typing.Callable`` in type annotations.
pt_pt: Veja :ref:`annotating-callables` para detalhes sobre como usar :class:`collections.abc.Callable` e ``typing.Callable`` em anotações de tipo.

source: :class:`collections.abc.Callable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Callable` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Generator`.
pt_pt: Alias obsoleto para :class:`collections.abc.Generator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Generator` and ``typing.Generator`` in type annotations.
pt_pt: Veja :ref:`annotating-generators-and-coroutines` para detalhes sobre o uso de :class:`collections.abc.Generator` e ``typing.Generator`` em anotações de tipo.

source: :class:`collections.abc.Generator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Generator` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Default values for the send and return types were added.
pt_pt: Valores predefinidos para os tipos de envio e retorno foram adicionados.

source: Deprecated alias to :class:`collections.abc.Hashable`.
pt_pt: Alias obsoleto para :class:`collections.abc.Hashable`.

source: Use :class:`collections.abc.Hashable` directly instead.
pt_pt: Use :class:`collections.abc.Hashable` diretamente em vez disso.

source: Deprecated alias to :class:`collections.abc.Reversible`.
pt_pt: Alias obsoleto para :class:`collections.abc.Reversible`.

source: :class:`collections.abc.Reversible` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`collections.abc.Reversible` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sized`.
pt_pt: Alias obsoleto para :class:`collections.abc.Sized`.

source: Use :class:`collections.abc.Sized` directly instead.
pt_pt: Use :class:`collections.abc.Sized` diretamente em vez disso.

source: Aliases to :mod:`contextlib` ABCs
pt_pt: Aliases para ABCs de :mod:`contextlib`

source: Deprecated alias to :class:`contextlib.AbstractContextManager`.
pt_pt: Alias obsoleto para :class:`contextlib.AbstractContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__enter__` method. The optional second type parameter, ``ExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__exit__` method.
pt_pt: O primeiro parâmetro de tipo, ``T_co``, representa o tipo devolvido pelo método :meth:`~object.__enter__`. O segundo parâmetro de tipo opcional, ``ExitT_co``, que tem como valor predefinido ``bool | None``, representa o tipo devolvido pelo método :meth:`~object.__exit__`.

source: :class:`contextlib.AbstractContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`contextlib.AbstractContextManager` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Added the optional second type parameter, ``ExitT_co``.
pt_pt: Adicionado o segundo parâmetro de tipo opcional, ``ExitT_co``.

source: Deprecated alias to :class:`contextlib.AbstractAsyncContextManager`.
pt_pt: Alias obsoleto para :class:`contextlib.AbstractAsyncContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__aenter__` method. The optional second type parameter, ``AExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__aexit__` method.
pt_pt: O primeiro parâmetro de tipo, ``T_co``, representa o tipo devolvido pelo método :meth:`~object.__aenter__`. O segundo parâmetro de tipo opcional, ``AExitT_co``, que tem como valor predefinido ``bool | None``, representa o tipo devolvido pelo método :meth:`~object.__aexit__`.

source: :class:`contextlib.AbstractAsyncContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_pt: :class:`contextlib.AbstractAsyncContextManager` agora suporta subscripting (``[]``). Veja :pep:`585` e :ref:`types-genericalias`.

source: Added the optional second type parameter, ``AExitT_co``.
pt_pt: Adicionado o segundo parâmetro de tipo opcional, ``AExitT_co``.

source: Deprecation Timeline of Major Features
pt_pt: Cronologia de Obsolescência de Funcionalidades Principais

source: Certain features in ``typing`` are deprecated and may be removed in a future version of Python. The following table summarizes major deprecations for your convenience. This is subject to change, and not all deprecations are listed.
pt_pt: Certas funcionalidades em ``typing`` estão obsoletas e podem ser removidas numa versão futura do Python. A tabela seguinte resume as principais obsolescências para sua conveniência. Isto está sujeito a alterações, e nem todas as obsolescências estão listadas.

source: Feature
pt_pt: Funcionalidade

source: Deprecated in
pt_pt: Obsoleto em

source: Projected removal
pt_pt: Remoção projetada

source: ``typing`` versions of standard collections
pt_pt: Versões ``typing`` de coleções padrão

source: Undecided (see :ref:`deprecated-aliases` for more information)
pt_pt: Indeciso (veja :ref:`deprecated-aliases` para mais informações)

source: Undecided
pt_pt: Indeciso

source: :class:`typing.Hashable` and :class:`typing.Sized`
pt_pt: :class:`typing.Hashable` e :class:`typing.Sized`

source: ellipsis literal
pt_pt: literal de reticências
