Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: By default, attempting to patch a function in a module (or a method or an attribute in a class) that does not exist will fail with :exc:`AttributeError`::
pt_pt: Por predefinição, tentar substituir uma função num módulo (ou um método ou atributo numa classe) que não existe falhará com :exc:`AttributeError`::
ru: По умолчанию попытка исправить несуществующую функцию в модуле (или метод или атрибут в классе) завершится неудачно с ошибкой :exc:`AttributeError`::

source: >>> @patch('sys.non_existing_attribute', 42) ... def test(): ... assert sys.non_existing_attribute == 42 ... >>> test() Traceback (most recent call last): ... AttributeError: <module 'sys' (built-in)> does not have the attribute 'non_existing_attribute'
pt_pt: >>> @patch('sys.atributo_inexistente', 42) ... def test(): ... assert sys.atributo_inexistente == 42 ... >>> test() Traceback (most recent call last): ... AttributeError: <module 'sys' (built-in)> não tem o atributo 'atributo_inexistente'

source: but adding ``create=True`` in the call to :func:`patch` will make the previous example work as expected::
pt_pt: mas adicionar ``create=True`` na chamada a :func:`patch` fará com que o exemplo anterior funcione como esperado::
ru: но добавление ``create=True`` в вызов :func:`patch` заставит предыдущий пример работать так, как ожидалось::

source: >>> @patch('sys.non_existing_attribute', 42, create=True) ... def test(mock_stdout): ... assert sys.non_existing_attribute == 42 ... >>> test()
pt_pt: >>> @patch('sys.atributo_inexistente', 42, create=True) ... def test(mock_stdout): ... assert sys.atributo_inexistente == 42 ... >>> test()

source: :func:`patch` now returns an :class:`AsyncMock` if the target is an async function.
pt_pt: :func:`patch` agora devolve um :class:`AsyncMock` se o alvo for uma função assíncrona.
ru: :func:`patch` теперь возвращает :class:`AsyncMock`, если целью является асинхронная функция.

source: patch the named member (*attribute*) on an object (*target*) with a mock object.
pt_pt: substitui o membro nomeado (*atributo*) num objeto (*target*) com um objeto mock.
ru: исправьте именованный элемент (*атрибут*) на объекте (*цель*) с помощью фиктивного объекта.

source: :func:`patch.object` can be used as a decorator, class decorator or a context manager. Arguments *new*, *spec*, *create*, *spec_set*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. Like :func:`patch`, :func:`patch.object` takes arbitrary keyword arguments for configuring the mock object it creates.
pt_pt: :func:`patch.object` pode ser usado como um decorador, decorador de classe ou um gestor de contexto. Os argumentos *new*, *spec*, *create*, *spec_set*, *autospec* e *new_callable* têm o mesmo significado que para :func:`patch`. Tal como :func:`patch`, :func:`patch.object` aceita argumentos de palavra-chave arbitrários para configurar o objeto mock que cria.
ru: :func:`patch.object` может использоваться как декоратор, декоратор класса или менеджер контекста. Аргументы *new*, *spec*, *create*, *spec_set*, *autospec* и *new_callable* имеют то же значение, что и для :func:`patch`. Подобно :func:`patch`, :func:`patch.object` принимает произвольные аргументы ключевого слова для настройки создаваемого им фиктивного объекта.

source: When used as a class decorator :func:`patch.object` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
pt_pt: Quando usado como um decorador de classe, :func:`patch.object` respeita ``patch.TEST_PREFIX`` para escolher quais métodos envolver.
ru: При использовании в качестве декоратора класса :func:`patch.object` использует ``patch.TEST_PREFIX`` для выбора методов для переноса.

source: You can either call :func:`patch.object` with three arguments or two arguments. The three argument form takes the object to be patched, the attribute name and the object to replace the attribute with.
pt_pt: Pode chamar :func:`patch.object` com três argumentos ou dois argumentos. A forma com três argumentos recebe o objeto a ser substituído, o nome do atributo e o objeto para substituir o atributo.
ru: Вы можете вызвать :func:`patch.object` с тремя или двумя аргументами. Форма с тремя аргументами принимает объект, который нужно исправить, имя атрибута и объект, которым атрибут заменяется.

source: When calling with the two argument form you omit the replacement object, and a mock is created for you and passed in as an extra argument to the decorated function:
pt_pt: Ao chamar com a forma de dois argumentos, omite o objeto de substituição e um mock é criado para si e passado como um argumento extra para a função decorada:
ru: При вызове с формой с двумя аргументами вы опускаете заменяющий объект, и для вас создается макет, который передается в качестве дополнительного аргумента декорированной функции:

source: *spec*, *create* and the other arguments to :func:`patch.object` have the same meaning as they do for :func:`patch`.
pt_pt: *spec*, *create* e os outros argumentos para :func:`patch.object` têm o mesmo significado que para :func:`patch`.
ru: *spec*, *create* и другие аргументы :func:`patch.object` имеют то же значение, что и для :func:`patch`.

source: *in_dict* can be a dictionary or a mapping like container. If it is a mapping then it must at least support getting, setting and deleting items plus iterating over keys.
pt_pt: *in_dict* pode ser um dicionário ou um contentor semelhante a um mapeamento. Se for um mapeamento, então deve pelo menos suportar obter, definir e eliminar itens, além de iterar sobre chaves.
ru: *in_dict* может быть словарем или контейнером, подобным отображению. Если это сопоставление, то оно должно как минимум поддерживать получение, установку и удаление элементов, а также перебор ключей.

source: *in_dict* can also be a string specifying the name of the dictionary, which will then be fetched by importing it.
pt_pt: *in_dict* também pode ser uma string que especifica o nome do dicionário, que será então obtido importando-o.
ru: *in_dict* также может быть строкой, определяющей имя словаря, которое затем будет получено путем его импорта.

source: *values* can be a dictionary of values to set in the dictionary. *values* can also be an iterable of ``(key, value)`` pairs.
pt_pt: *values* pode ser um dicionário de valores a definir no dicionário. *values* também pode ser um iterável de pares ``(key, value)``.
ru: *values* может быть словарем значений, которые можно установить в словаре. *значения* также могут быть итерацией пар ``(ключ, значение)``.

source: If *clear* is true then the dictionary will be cleared before the new values are set.
pt_pt: Se *clear* for verdadeiro, então o dicionário será limpo antes de os novos valores serem definidos.
ru: Если *clear* имеет значение true, словарь будет очищен перед установкой новых значений.

source: :func:`patch.dict` can also be called with arbitrary keyword arguments to set values in the dictionary.
pt_pt: :func:`patch.dict` também pode ser chamado com argumentos de palavra-chave arbitrários para definir valores no dicionário.
ru: :func:`patch.dict` также может быть вызван с произвольными ключевыми аргументами для установки значений в словаре.

source: :func:`patch.dict` now returns the patched dictionary when used as a context manager.
pt_pt: :func:`patch.dict` agora devolve o dicionário substituído quando usado como um gestor de contexto.
ru: :func:`patch.dict` теперь возвращает исправленный словарь при использовании в качестве менеджера контекста.

source: :func:`patch.dict` can be used as a context manager, decorator or class decorator:
pt_pt: :func:`patch.dict` pode ser usado como um gestor de contexto, decorador ou decorador de classe:
ru: :func:`patch.dict` можно использовать как менеджер контекста, декоратор или декоратор класса:

source: When used as a class decorator :func:`patch.dict` honours ``patch.TEST_PREFIX`` (default to ``'test'``) for choosing which methods to wrap:
pt_pt: Quando usado como um decorador de classe, :func:`patch.dict` respeita ``patch.TEST_PREFIX`` (predefinido para ``'test'``) para escolher quais métodos envolver:
ru: При использовании в качестве декоратора класса :func:`patch.dict` учитывает ``patch.TEST_PREFIX`` (по умолчанию ``'test'``) для выбора методов для переноса:

source: If you want to use a different prefix for your test, you can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``. For more details about how to change the value of see :ref:`test-prefix`.
pt_pt: Se quiser usar um prefixo diferente para o seu teste, pode informar os patchers do prefixo diferente definindo ``patch.TEST_PREFIX``. Para mais detalhes sobre como alterar o valor, veja :ref:`test-prefix`.
ru: Если вы хотите использовать другой префикс для своего теста, вы можете сообщить патчерам о другом префиксе, установив ``patch.TEST_PREFIX``. Для получения более подробной информации о том, как изменить значение, см. :ref:`test-prefix`.

source: :func:`patch.dict` can be used to add members to a dictionary, or simply let a test change a dictionary, and ensure the dictionary is restored when the test ends.
pt_pt: :func:`patch.dict` pode ser usado para adicionar membros a um dicionário, ou simplesmente permitir que um teste altere um dicionário, e garantir que o dicionário é restaurado quando o teste termina.
ru: :func:`patch.dict` можно использовать для добавления элементов в словарь или просто позволить тесту изменить словарь и гарантировать, что словарь будет восстановлен после завершения теста.

source: Keywords can be used in the :func:`patch.dict` call to set values in the dictionary:
pt_pt: Palavras-chave podem ser usadas na chamada :func:`patch.dict` para definir valores no dicionário:
ru: Ключевые слова можно использовать в вызове :func:`patch.dict` для установки значений в словаре:

source: :func:`patch.dict` can be used with dictionary like objects that aren't actually dictionaries. At the very minimum they must support item getting, setting, deleting and either iteration or membership test. This corresponds to the magic methods :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` and either :meth:`~container.__iter__` or :meth:`~object.__contains__`.
pt_pt: :func:`patch.dict` pode ser usado com objetos semelhantes a dicionários que não são realmente dicionários. No mínimo, devem suportar obtenção, definição e eliminação de itens, e iteração ou teste de pertinência. Isto corresponde aos métodos mágicos :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` e :meth:`~container.__iter__` ou :meth:`~object.__contains__`.
ru: :func:`patch.dict` можно использовать со словарными объектами, которые на самом деле словарями не являются. Как минимум, они должны поддерживать получение, установку, удаление элементов, а также итерацию или проверку членства. Это соответствует магическим методам :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` и либо :meth:`~container.__iter__`, либо :meth: `~object.__contains__`.

source: Perform multiple patches in a single call. It takes the object to be patched (either as an object or a string to fetch the object by importing) and keyword arguments for the patches::
pt_pt: Realiza várias substituições numa única chamada. Recebe o objeto a ser substituído (seja como um objeto ou uma string para obter o objeto por importação) e argumentos de palavra-chave para as substituições::
ru: Выполните несколько исправлений за один вызов. Он принимает объект для исправления (либо в виде объекта, либо в виде строки для извлечения объекта путем импорта) и аргументы ключевого слова для исправлений::

source: with patch.multiple(settings, FIRST_PATCH='one', SECOND_PATCH='two'): ...
pt_pt: with patch.multiple(definicoes, PRIMEIRA_SUBSTITUICAO='um', SEGUNDA_SUBSTITUICAO='dois'): ...

source: Use :data:`DEFAULT` as the value if you want :func:`patch.multiple` to create mocks for you. In this case the created mocks are passed into a decorated function by keyword, and a dictionary is returned when :func:`patch.multiple` is used as a context manager.
pt_pt: Use :data:`DEFAULT` como o valor se quiser que :func:`patch.multiple` crie mocks para si. Neste caso, os mocks criados são passados para uma função decorada por palavra-chave, e um dicionário é devolvido quando :func:`patch.multiple` é usado como um gestor de contexto.
ru: Используйте :data:`DEFAULT` в качестве значения, если вы хотите, чтобы :func:`patch.multiple` создавал для вас макеты. В этом случае созданные макеты передаются в декорированную функцию по ключевому слову, а словарь возвращается, когда :func:`patch.multiple` используется в качестве контекстного менеджера.

source: :func:`patch.multiple` can be used as a decorator, class decorator or a context manager. The arguments *spec*, *spec_set*, *create*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. These arguments will be applied to *all* patches done by :func:`patch.multiple`.
pt_pt: :func:`patch.multiple` pode ser usado como um decorador, decorador de classe ou um gestor de contexto. Os argumentos *spec*, *spec_set*, *create*, *autospec* e *new_callable* têm o mesmo significado que para :func:`patch`. Estes argumentos serão aplicados a *todas* as substituições feitas por :func:`patch.multiple`.
ru: :func:`patch.multiple` может использоваться как декоратор, декоратор класса или менеджер контекста. Аргументы *spec*, *spec_set*, *create*, *autospec* и *new_callable* имеют то же значение, что и для :func:`patch`. Эти аргументы будут применяться ко *всем* патчам, созданным :func:`patch.multiple`.

source: When used as a class decorator :func:`patch.multiple` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
pt_pt: Quando usado como um decorador de classe, :func:`patch.multiple` respeita ``patch.TEST_PREFIX`` para escolher quais métodos envolver.
ru: При использовании в качестве декоратора класса :func:`patch.multiple` использует ``patch.TEST_PREFIX`` для выбора методов для переноса.

source: If you want :func:`patch.multiple` to create mocks for you, then you can use :data:`DEFAULT` as the value. If you use :func:`patch.multiple` as a decorator then the created mocks are passed into the decorated function by keyword. ::
pt_pt: Se quiser que :func:`patch.multiple` crie mocks para si, então pode usar :data:`DEFAULT` como o valor. Se usar :func:`patch.multiple` como um decorador, então os mocks criados são passados para a função decorada por palavra-chave. ::
ru: Если вы хотите, чтобы :func:`patch.multiple` создавал для вас макеты, вы можете использовать :data:`DEFAULT` в качестве значения. Если вы используете :func:`patch.multiple` в качестве декоратора, то созданные макеты передаются в декорированную функцию по ключевому слову. ::

source: >>> thing = object() >>> other = object() >>> @patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) ... def test_function(thing, other): ... assert isinstance(thing, MagicMock) ... assert isinstance(other, MagicMock) ... >>> test_function()
pt_pt: >>> coisa = object() >>> outro = object() >>> @patch.multiple('__main__', coisa=DEFAULT, outro=DEFAULT) ... def funcao_teste(coisa, outro): ... assert isinstance(coisa, MagicMock) ... assert isinstance(outro, MagicMock) ... >>> funcao_teste()

source: :func:`patch.multiple` can be nested with other ``patch`` decorators, but put arguments passed by keyword *after* any of the standard arguments created by :func:`patch`::
pt_pt: :func:`patch.multiple` pode ser aninhado com outros decoradores ``patch``, mas coloque argumentos passados por palavra-chave *depois* de quaisquer argumentos padrão criados por :func:`patch`::
ru: :func:`patch.multiple` может быть вложен в другие декораторы ``patch``, но аргументы, передаваемые по ключевому слову, *после* любого из стандартных аргументов, созданных :func:`patch`::

source: >>> @patch('sys.exit') ... @patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) ... def test_function(mock_exit, other, thing): ... assert 'other' in repr(other) ... assert 'thing' in repr(thing) ... assert 'exit' in repr(mock_exit) ... >>> test_function()
pt_pt: >>> @patch('sys.exit') ... @patch.multiple('__main__', coisa=DEFAULT, outro=DEFAULT) ... def funcao_teste(mock_exit, outro, coisa): ... assert 'outro' in repr(outro) ... assert 'coisa' in repr(coisa) ... assert 'exit' in repr(mock_exit) ... >>> funcao_teste()

source: If :func:`patch.multiple` is used as a context manager, the value returned by the context manager is a dictionary where created mocks are keyed by name::
pt_pt: Se :func:`patch.multiple` for usado como um gestor de contexto, o valor devolvido pelo gestor de contexto é um dicionário onde os mocks criados são indexados por nome::
ru: Если :func:`patch.multiple` используется в качестве менеджера контекста, значение, возвращаемое менеджером контекста, представляет собой словарь, в котором созданные макеты кодируются по имени::

source: >>> with patch.multiple('__main__', thing=DEFAULT, other=DEFAULT) as values: ... assert 'other' in repr(values['other']) ... assert 'thing' in repr(values['thing']) ... assert values['thing'] is thing ... assert values['other'] is other ...
pt_pt: >>> with patch.multiple('__main__', coisa=DEFAULT, outro=DEFAULT) as valores: ... assert 'outro' in repr(valores['outro']) ... assert 'coisa' in repr(valores['coisa']) ... assert valores['coisa'] is coisa ... assert valores['outro'] is outro ...

source: patch methods: start and stop
pt_pt: métodos patch: start e stop
ru: методы исправления: запуск и остановка

source: All the patchers have :meth:`!start` and :meth:`!stop` methods. These make it simpler to do patching in ``setUp`` methods or where you want to do multiple patches without nesting decorators or with statements.
pt_pt: Todos os patchers têm métodos :meth:`!start` e :meth:`!stop`. Estes tornam mais simples fazer substituições em métodos ``setUp`` ou onde quer fazer várias substituições sem aninhar decoradores ou declarações with.

source: To use them call :func:`patch`, :func:`patch.object` or :func:`patch.dict` as normal and keep a reference to the returned ``patcher`` object. You can then call :meth:`!start` to put the patch in place and :meth:`!stop` to undo it.
pt_pt: Para os usar, chame :func:`patch`, :func:`patch.object` ou :func:`patch.dict` normalmente e mantenha uma referência ao objeto ``patcher`` devolvido. Pode então chamar :meth:`!start` para colocar a substituição em vigor e :meth:`!stop` para desfazê-la.

source: If you are using :func:`patch` to create a mock for you then it will be returned by the call to ``patcher.start``. ::
pt_pt: Se estiver a usar :func:`patch` para criar um mock para si, então este será devolvido pela chamada a ``patcher.start``. ::
ru: Если вы используете :func:`patch` для создания макета, он будет возвращен вызовом ``patcher.start``. ::

source: A typical use case for this might be for doing multiple patches in the ``setUp`` method of a :class:`~unittest.TestCase`::
pt_pt: Um caso de uso típico para isto pode ser fazer várias substituições no método ``setUp`` de um :class:`~unittest.TestCase`::

source: >>> class MyTest(unittest.TestCase): ... def setUp(self): ... self.patcher1 = patch('package.module.Class1') ... self.patcher2 = patch('package.module.Class2') ... self.MockClass1 = self.patcher1.start() ... self.MockClass2 = self.patcher2.start() ... ... def tearDown(self): ... self.patcher1.stop() ... self.patcher2.stop() ... ... def test_something(self): ... assert package.module.Class1 is self.MockClass1 ... assert package.module.Class2 is self.MockClass2 ... >>> MyTest('test_something').run()
pt_pt: >>> class MeuTeste(unittest.TestCase): ... def setUp(self): ... self.patcher1 = patch('package.module.Classe1') ... self.patcher2 = patch('package.module.Classe2') ... self.MockClasse1 = self.patcher1.start() ... self.MockClasse2 = self.patcher2.start() ... ... def tearDown(self): ... self.patcher1.stop() ... self.patcher2.stop() ... ... def test_algo(self): ... assert package.module.Classe1 is self.MockClasse1 ... assert package.module.Classe2 is self.MockClasse2 ... >>> MeuTeste('test_algo').run()

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the ``setUp`` then ``tearDown`` is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
pt_pt: Se usar esta técnica, deve garantir que a substituição é "desfeita" chamando ``stop``. Isto pode ser mais complicado do que parece, porque se uma exceção for lançada no ``setUp`` então ``tearDown`` não é chamado. :meth:`unittest.TestCase.addCleanup` torna isto mais fácil::
ru: Если вы используете этот метод, вы должны убедиться, что исправление «отменено», вызвав ``stop``. Это может быть сложнее, чем вы думаете, потому что если в setUp возникает исключение, то tearDown не вызывается. :meth:`unittest.TestCase.addCleanup` делает это проще::

source: >>> class MyTest(unittest.TestCase): ... def setUp(self): ... patcher = patch('package.module.Class') ... self.MockClass = patcher.start() ... self.addCleanup(patcher.stop) ... ... def test_something(self): ... assert package.module.Class is self.MockClass ...
pt_pt: >>> class MeuTeste(unittest.TestCase): ... def setUp(self): ... patcher = patch('package.module.Classe') ... self.MockClasse = patcher.start() ... self.addCleanup(patcher.stop) ... ... def test_algo(self): ... assert package.module.Classe is self.MockClasse ...

source: As an added bonus you no longer need to keep a reference to the ``patcher`` object.
pt_pt: Como um bónus adicional, já não precisa de manter uma referência ao objeto ``patcher``.
ru: В качестве дополнительного бонуса вам больше не нужно хранить ссылку на объект «patcher».

source: It is also possible to stop all patches which have been started by using :func:`patch.stopall`.
pt_pt: Também é possível parar todas as substituições que foram iniciadas usando :func:`patch.stopall`.
ru: Также возможно остановить все запущенные патчи с помощью :func:`patch.stopall`.

source: Stop all active patches. Only stops patches started with ``start``.
pt_pt: Para todas as substituições ativas. Apenas para substituições iniciadas com ``start``.
ru: Остановите все активные патчи. Останавливает только патчи, запущенные с помощью ``start``.

source: patch builtins
pt_pt: substituir builtins
ru: патчить встроенные функции

source: You can patch any builtins within a module. The following example patches builtin :func:`ord`::
pt_pt: Pode substituir quaisquer builtins dentro de um módulo. O exemplo seguinte substitui a builtin :func:`ord`::
ru: Вы можете исправить любые встроенные функции внутри модуля. Следующий пример исправляет встроенную :func:`ord`::

source: All of the patchers can be used as class decorators. When used in this way they wrap every test method on the class. The patchers recognise methods that start with ``'test'`` as being test methods. This is the same way that the :class:`unittest.TestLoader` finds test methods by default.
pt_pt: Todos os patchers podem ser usados como decoradores de classe. Quando usados desta forma, envolvem cada método de teste na classe. Os patchers reconhecem métodos que começam com ``'test'`` como sendo métodos de teste. Esta é a mesma forma como o :class:`unittest.TestLoader` encontra métodos de teste por predefinição.
ru: Все патчеры можно использовать в качестве декораторов классов. При таком использовании они оборачивают каждый тестовый метод класса. Патчеры распознают методы, начинающиеся с «test», как тестовые. Точно так же :class:`unittest.TestLoader` по умолчанию находит тестовые методы.
