Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: It is possible that you want to use a different prefix for your tests. You can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``::
pt_pt: É possível que queira usar um prefixo diferente para os seus testes. Pode informar os patchers do prefixo diferente definindo ``patch.TEST_PREFIX``::
ru: Возможно, вы захотите использовать для своих тестов другой префикс. Вы можете сообщить патчерам другой префикс, установив ``patch.TEST_PREFIX``::

source: >>> patch.TEST_PREFIX = 'foo' >>> value = 3 >>> >>> @patch('__main__.value', 'not three') ... class Thing: ... def foo_one(self): ... print(value) ... def foo_two(self): ... print(value) ... >>> >>> Thing().foo_one() not three >>> Thing().foo_two() not three >>> value 3
pt_pt: >>> patch.TEST_PREFIX = 'foo' >>> valor = 3 >>> >>> @patch('__main__.valor', 'não três') ... class Coisa: ... def foo_um(self): ... print(valor) ... def foo_dois(self): ... print(valor) ... >>> >>> Coisa().foo_um() não três >>> Coisa().foo_dois() não três >>> valor 3

source: Nesting Patch Decorators
pt_pt: Aninhar Decoradores Patch
ru: Вложенные декораторы патчей

source: If you want to perform multiple patches then you can simply stack up the decorators.
pt_pt: Se quiser realizar várias substituições, pode simplesmente empilhar os decoradores.
ru: Если вы хотите выполнить несколько патчей, вы можете просто сложить декораторы.

source: You can stack up multiple patch decorators using this pattern:
pt_pt: Pode empilhar vários decoradores patch usando este padrão:
ru: Вы можете объединить несколько декораторов патчей, используя этот шаблон:

source: Note that the decorators are applied from the bottom upwards. This is the standard way that Python applies decorators. The order of the created mocks passed into your test function matches this order.
pt_pt: Note que os decoradores são aplicados de baixo para cima. Esta é a forma padrão como o Python aplica decoradores. A ordem dos mocks criados passados para a sua função de teste corresponde a esta ordem.
ru: Обратите внимание, что декораторы применяются снизу вверх. Это стандартный способ применения декораторов в Python. Порядок созданных макетов, передаваемых в вашу тестовую функцию, соответствует этому порядку.

source: Where to patch
pt_pt: Onde substituir
ru: Где патчить

source: :func:`patch` works by (temporarily) changing the object that a *name* points to with another one. There can be many names pointing to any individual object, so for patching to work you must ensure that you patch the name used by the system under test.
pt_pt: :func:`patch` funciona (temporariamente) alterando o objeto para o qual um *nome* aponta por outro. Pode haver muitos nomes a apontar para qualquer objeto individual, por isso, para que a substituição funcione, deve garantir que substitui o nome usado pelo sistema em teste.
ru: :func:`patch` работает путем (временного) изменения объекта, на который указывает *имя*, на другой. Может быть много имен, указывающих на любой отдельный объект, поэтому для того, чтобы исправление работало, вы должны убедиться, что вы исправили имя, используемое тестируемой системой.

source: The basic principle is that you patch where an object is *looked up*, which is not necessarily the same place as where it is defined. A couple of examples will help to clarify this.
pt_pt: O princípio básico é que substitui onde um objeto é *procurado*, o que não é necessariamente o mesmo local onde é definido. Alguns exemplos ajudarão a esclarecer isto.
ru: Основной принцип заключается в том, что вы исправляете место, где *просматривается* объект, и это не обязательно то же самое место, где он определен. Несколько примеров помогут прояснить это.

source: Imagine we have a project that we want to test with the following structure::
pt_pt: Imagine que temos um projeto que queremos testar com a seguinte estrutura::
ru: Представьте, что у нас есть проект, который мы хотим протестировать, со следующей структурой:

source: a.py -> Defines SomeClass b.py -> from a import SomeClass -> some_function instantiates SomeClass
pt_pt: a.py -> Define AlgumaClasse b.py -> from a import AlgumaClasse -> alguma_funcao instancia AlgumaClasse

source: Now we want to test ``some_function`` but we want to mock out ``SomeClass`` using :func:`patch`. The problem is that when we import module b, which we will have to do when it imports ``SomeClass`` from module a. If we use :func:`patch` to mock out ``a.SomeClass`` then it will have no effect on our test; module b already has a reference to the *real* ``SomeClass`` and it looks like our patching had no effect.
pt_pt: Agora queremos testar ``some_function``, mas queremos simular ``SomeClass`` usando :func:`patch`. O problema é que quando importamos o módulo b, que teremos de fazer quando este importa ``SomeClass`` do módulo a. Se usarmos :func:`patch` para simular ``a.SomeClass``, não terá efeito no nosso teste; o módulo b já tem uma referência à *verdadeira* ``SomeClass`` e parece que a nossa substituição não teve efeito.

source: The key is to patch out ``SomeClass`` where it is used (or where it is looked up). In this case ``some_function`` will actually look up ``SomeClass`` in module b, where we have imported it. The patching should look like::
pt_pt: A chave é substituir ``SomeClass`` onde é usada (ou onde é procurada). Neste caso, ``some_function`` procurará realmente ``SomeClass`` no módulo b, onde a importámos. A substituição deve ser feita assim::
ru: Ключевым моментом является исправление ``SomeClass`` там, где он используется (или где его ищут). В этом случае some_function на самом деле будет искать SomeClass в модуле b, куда мы его импортировали. Патч должен выглядеть так:

source: @patch('b.SomeClass')
pt_pt: @patch('b.AlgumaClasse')

source: However, consider the alternative scenario where instead of ``from a import SomeClass`` module b does ``import a`` and ``some_function`` uses ``a.SomeClass``. Both of these import forms are common. In this case the class we want to patch is being looked up in the module and so we have to patch ``a.SomeClass`` instead::
pt_pt: No entanto, considere o cenário alternativo em que, em vez de ``from a import SomeClass``, o módulo b faz ``import a`` e ``some_function`` usa ``a.SomeClass``. Ambas as formas de importação são comuns. Neste caso, a classe que queremos substituir está a ser procurada no módulo e, portanto, temos de substituir ``a.SomeClass`` em vez disso::
ru: Однако рассмотрим альтернативный сценарий, где вместо ``из импорта SomeClass`` модуль b ``импортирует a``, а ``some_function`` использует ``a.SomeClass``. Обе эти формы импорта распространены. В этом случае класс, который мы хотим исправить, ищется в модуле, и поэтому вместо этого нам нужно исправить ``a.SomeClass``::

source: @patch('a.SomeClass')
pt_pt: @patch('a.AlgumaClasse')

source: Patching Descriptors and Proxy Objects
pt_pt: Substituir Descritores e Objetos Proxy
ru: Исправление дескрипторов и прокси-объектов

source: Both patch_ and patch.object_ correctly patch and restore descriptors: class methods, static methods and properties. You should patch these on the *class* rather than an instance. They also work with *some* objects that proxy attribute access, like the `django settings object <https://web.archive.org/web/20200603181648/http://www.voidspace.org.uk/python/weblog/arch_d7_2010_12_04.shtml#e1198>`_.
pt_pt: Tanto patch_ como patch.object_ substituem e restauram corretamente descritores: métodos de classe, métodos estáticos e propriedades. Deve substituir estes na *classe* em vez de numa instância. Também funcionam com *alguns* objetos que fazem proxy de acesso a atributos, como o `objeto de configurações do django <https://web.archive.org/web/20200603181648/http://www.voidspace.org.uk/python/weblog/arch_d7_2010_12_04.shtml#e1198>`_.
ru: И patch_, и patch.object_ корректно исправляют и восстанавливают дескрипторы: методы класса, статические методы и свойства. Вам следует исправлять их в *классе*, а не в экземпляре. Они также работают с *некоторыми* объектами, которые имеют доступ к атрибутам прокси, например, с объектом настроек django <https://web.archive.org/web/20200603181648/http://www.voidspace.org.uk/python/weblog/ Arch_d7_2010_12_04.shtml#e1198>`_.

source: MagicMock and magic method support
pt_pt: MagicMock e suporte a métodos mágicos
ru: Поддержка MagicMock и магических методов.

source: Mocking Magic Methods
pt_pt: Simular Métodos Mágicos

source: :class:`Mock` supports mocking the Python protocol methods, also known as :term:`"magic methods" <magic method>`. This allows mock objects to replace containers or other objects that implement Python protocols.
pt_pt: :class:`Mock` suporta a simulação dos métodos de protocolo do Python, também conhecidos como :term:`"métodos mágicos" <magic method>`. Isto permite que objetos mock substituam contentores ou outros objetos que implementam protocolos Python.
ru: :class:`Mock` поддерживает имитацию методов протокола Python, также известных как :term:`"магические методы" <магический метод>`. Это позволяет макетным объектам заменять контейнеры или другие объекты, реализующие протоколы Python.

source: Because magic methods are looked up differently from normal methods [#]_, this support has been specially implemented. This means that only specific magic methods are supported. The supported list includes *almost* all of them. If there are any missing that you need please let us know.
pt_pt: Como os métodos mágicos são procurados de forma diferente dos métodos normais [#]_, este suporte foi implementado especialmente. Isto significa que apenas métodos mágicos específicos são suportados. A lista suportada inclui *quase* todos eles. Se faltar algum que precise, por favor informe-nos.
ru: Потому что магические методы ищутся иначе, чем обычные методы. [#]_ , эта поддержка была специально реализована. Это означает, что поддерживаются только определенные магические методы. Список поддерживаемых включает *почти* все из них. Если вам что-то не хватает, пожалуйста, сообщите нам об этом.

source: You mock magic methods by setting the method you are interested in to a function or a mock instance. If you are using a function then it *must* take ``self`` as the first argument [#]_.
pt_pt: Simula métodos mágicos definindo o método em que está interessado para uma função ou uma instância mock. Se estiver a usar uma função, esta *deve* aceitar ``self`` como o primeiro argumento [#]_.
ru: Вы имитируете магические методы, устанавливая интересующий вас метод в функцию или фиктивный экземпляр. Если вы используете функцию, то она *должна* принимать ``self`` в качестве первого аргумента. [#]_ .

source: One use case for this is for mocking objects used as context managers in a :keyword:`with` statement:
pt_pt: Um caso de uso para isto é simular objetos usados como gestores de contexto numa declaração :keyword:`with`:
ru: Одним из вариантов использования этого является имитация объектов, используемых в качестве менеджеров контекста в операторе :keyword:`with`:

source: Calls to magic methods do not appear in :attr:`~Mock.method_calls`, but they are recorded in :attr:`~Mock.mock_calls`.
pt_pt: Chamadas a métodos mágicos não aparecem em :attr:`~Mock.method_calls`, mas são registadas em :attr:`~Mock.mock_calls`.
ru: Вызовы магических методов не отображаются в :attr:`~Mock.method_calls`, но они записываются в :attr:`~Mock.mock_calls`.

source: If you use the *spec* keyword argument to create a mock then attempting to set a magic method that isn't in the spec will raise an :exc:`AttributeError`.
pt_pt: Se usar o argumento de palavra-chave *spec* para criar um mock, então tentar definir um método mágico que não esteja no spec lançará um :exc:`AttributeError`.
ru: Если вы используете аргумент ключевого слова *spec* для создания макета, то попытка установить магический метод, которого нет в спецификации, приведет к возникновению ошибки :exc:`AttributeError`.

source: The full list of supported magic methods is:
pt_pt: A lista completa de métodos mágicos suportados é:
ru: Полный список поддерживаемых магических методов:

source: ``__hash__``, ``__sizeof__``, ``__repr__`` and ``__str__``
pt_pt: ``__hash__``, ``__sizeof__``, ``__repr__`` e ``__str__``

source: ``__dir__``, ``__format__`` and ``__subclasses__``
pt_pt: ``__dir__``, ``__format__`` e ``__subclasses__``

source: ``__round__``, ``__floor__``, ``__trunc__`` and ``__ceil__``
pt_pt: ``__round__``, ``__floor__``, ``__trunc__`` e ``__ceil__``

source: Comparisons: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` and ``__ne__``
pt_pt: Comparações: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` e ``__ne__``
ru: Сравнения: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` и ``__ne__``

source: Container methods: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` and ``__missing__``
pt_pt: Métodos de contentor: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` e ``__missing__``
ru: контейнер методы: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` и ``__missing__``

source: Context manager: ``__enter__``, ``__exit__``, ``__aenter__`` and ``__aexit__``
pt_pt: Gestor de contexto: ``__enter__``, ``__exit__``, ``__aenter__`` e ``__aexit__``
ru: контекстный менеджер: ``__enter__``, ``__exit__``, ``__aenter__`` и ``__aexit__``

source: Unary numeric methods: ``__neg__``, ``__pos__`` and ``__invert__``
pt_pt: Métodos numéricos unários: ``__neg__``, ``__pos__`` e ``__invert__``
ru: Унарные числовые методы: ``__neg__``, ``__pos__`` и ``__invert__``

source: The numeric methods (including right hand and in-place variants): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__``, and ``__pow__``
pt_pt: Os métodos numéricos (incluindo variantes à direita e in-place): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__`` e ``__pow__``
ru: Числовые методы (включая правосторонние и локальные варианты): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__`` и ``__pow__``

source: Numeric conversion methods: ``__complex__``, ``__int__``, ``__float__`` and ``__index__``
pt_pt: Métodos de conversão numérica: ``__complex__``, ``__int__``, ``__float__`` e ``__index__``
ru: Методы числового преобразования: ``__complex__``, ``__int__``, ``__float__`` и ``__index__``

source: Descriptor methods: ``__get__``, ``__set__`` and ``__delete__``
pt_pt: Métodos de descritor: ``__get__``, ``__set__`` e ``__delete__``
ru: Методы дескриптора: ``__get__``, ``__set__`` и ``__delete__``

source: Pickling: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
pt_pt: Pickling: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` e ``__setstate__``
ru: Маринование: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` и ``__setstate__``

source: File system path representation: ``__fspath__``
pt_pt: Representação de caminho do sistema de ficheiros: ``__fspath__``
ru: Представление пути файловой системы: ``__fspath__``

source: Asynchronous iteration methods: ``__aiter__`` and ``__anext__``
pt_pt: Métodos de iteração assíncrona: ``__aiter__`` e ``__anext__``
ru: Асинхронные методы итерации: ``__aiter__`` и ``__anext__``

source: Added support for :func:`os.PathLike.__fspath__`.
pt_pt: Adicionado suporte para :func:`os.PathLike.__fspath__`.
ru: Добавлена ​​поддержка :func:`os.PathLike.__fspath__`.

source: Added support for ``__aenter__``, ``__aexit__``, ``__aiter__`` and ``__anext__``.
pt_pt: Adicionado suporte para ``__aenter__``, ``__aexit__``, ``__aiter__`` e ``__anext__``.
ru: Добавлена ​​поддержка ``__aenter__``, ``__aexit__``, ``__aiter__`` и ``__anext__``.

source: The following methods exist but are *not* supported as they are either in use by mock, can't be set dynamically, or can cause problems:
pt_pt: Os seguintes métodos existem, mas *não* são suportados, pois estão em uso pelo mock, não podem ser definidos dinamicamente ou podem causar problemas:
ru: Следующие методы существуют, но *не* поддерживаются, поскольку они либо используются макетом, не могут быть установлены динамически или могут вызывать проблемы:

source: ``__getattr__``, ``__setattr__``, ``__init__`` and ``__new__``
pt_pt: ``__getattr__``, ``__setattr__``, ``__init__`` e ``__new__``

source: There are two ``MagicMock`` variants: :class:`MagicMock` and :class:`NonCallableMagicMock`.
pt_pt: Existem duas variantes de ``MagicMock``: :class:`MagicMock` e :class:`NonCallableMagicMock`.
ru: Существует два варианта MagicMock: :class:`MagicMock` и :class:`NonCallableMagicMock`.

source: ``MagicMock`` is a subclass of :class:`Mock` with default implementations of most of the :term:`magic methods <magic method>`. You can use ``MagicMock`` without having to configure the magic methods yourself.
pt_pt: ``MagicMock`` é uma subclasse de :class:`Mock` com implementações predefinidas da maioria dos :term:`métodos mágicos <magic method>`. Pode usar ``MagicMock`` sem ter de configurar os métodos mágicos manualmente.
ru: ``MagicMock`` является подклассом :class:`Mock` с реализациями по умолчанию большинства :term:`magic методов <magic Method>`. Вы можете использовать MagicMock без необходимости самостоятельно настраивать магические методы.

source: The constructor parameters have the same meaning as for :class:`Mock`.
pt_pt: Os parâmetros do construtor têm o mesmo significado que para :class:`Mock`.
ru: Параметры конструктора имеют то же значение, что и для :class:`Mock`.

source: If you use the *spec* or *spec_set* arguments then *only* magic methods that exist in the spec will be created.
pt_pt: Se usar os argumentos *spec* ou *spec_set*, então *apenas* os métodos mágicos que existam no spec serão criados.
ru: Если вы используете аргументы *spec* или *spec_set*, будут созданы *только* магические методы, существующие в спецификации.

source: A non-callable version of :class:`MagicMock`.
pt_pt: Uma versão não chamável de :class:`MagicMock`.
ru: Невызываемая версия :class:`MagicMock`.

source: The constructor parameters have the same meaning as for :class:`MagicMock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
pt_pt: Os parâmetros do construtor têm o mesmo significado que para :class:`MagicMock`, com exceção de *return_value* e *side_effect*, que não têm significado num mock não chamável.
ru: Параметры конструктора имеют то же значение, что и для :class:`MagicMock`, за исключением *return_value* и *side_effect*, которые не имеют значения для невызываемого макета.

source: The magic methods are setup with :class:`MagicMock` objects, so you can configure them and use them in the usual way:
pt_pt: Os métodos mágicos são configurados com objetos :class:`MagicMock`, por isso pode configurá-los e usá-los da forma habitual:
ru: Магические методы настраиваются с помощью объектов :class:`MagicMock`, поэтому вы можете настроить их и использовать обычным способом:

source: By default many of the protocol methods are required to return objects of a specific type. These methods are preconfigured with a default return value, so that they can be used without you having to do anything if you aren't interested in the return value. You can still *set* the return value manually if you want to change the default.
pt_pt: Por predefinição, muitos dos métodos de protocolo são obrigados a devolver objetos de um tipo específico. Estes métodos são pré-configurados com um valor de retorno predefinido, para que possam ser usados sem que tenha de fazer nada se não estiver interessado no valor de retorno. Ainda pode *definir* o valor de retorno manualmente se quiser alterar o predefinido.
ru: По умолчанию многие методы протокола должны возвращать объекты определенного типа. Эти методы предварительно настроены с возвращаемым значением по умолчанию, поэтому их можно использовать без необходимости делать что-либо, если возвращаемое значение вас не интересует. Вы по-прежнему можете *установить* возвращаемое значение вручную, если хотите изменить значение по умолчанию.

source: Methods and their defaults:
pt_pt: Métodos e os seus valores predefinidos:
ru: Методы и их значения по умолчанию:

source: ``__hash__``: default hash for the mock
pt_pt: ``__hash__``: hash predefinido para o mock
ru: ``__hash__``: хеш по умолчанию для макета

source: ``__str__``: default str for the mock
pt_pt: ``__str__``: str predefinido para o mock
ru: ``__str__``: строка по умолчанию для макета

source: ``__sizeof__``: default sizeof for the mock
pt_pt: ``__sizeof__``: sizeof predefinido para o mock
ru: ``__sizeof__``: размер по умолчанию для макета

source: For example:
pt_pt: Por exemplo:
ru: Например:

source: The two equality methods, :meth:`!__eq__` and :meth:`!__ne__`, are special. They do the default equality comparison on identity, using the :attr:`~Mock.side_effect` attribute, unless you change their return value to return something else::
pt_pt: Os dois métodos de igualdade, :meth:`!__eq__` e :meth:`!__ne__`, são especiais. Eles fazem a comparação de igualdade predefinida com base na identidade, usando o atributo :attr:`~Mock.side_effect`, a menos que altere o seu valor de retorno para devolver outra coisa::
ru: Два метода равенства, :meth:`!__eq__` и :meth:`!__ne__`, являются особенными. Они выполняют сравнение на равенство по умолчанию, используя атрибут :attr:`~Mock.side_effect`, если вы не измените их возвращаемое значение, чтобы оно возвращало что-то другое::

source: The return value of :meth:`MagicMock.__iter__` can be any iterable object and isn't required to be an iterator:
pt_pt: O valor de retorno de :meth:`MagicMock.__iter__` pode ser qualquer objeto iterável e não é obrigatório ser um iterador:
ru: Возвращаемое значение :meth:`MagicMock.__iter__` может быть любым итерируемым объектом и не обязательно должно быть итератором:

source: If the return value *is* an iterator, then iterating over it once will consume it and subsequent iterations will result in an empty list:
pt_pt: Se o valor de retorno *for* um iterador, então iterar sobre ele uma vez irá consumi-lo e iterações subsequentes resultarão numa lista vazia:
ru: Если возвращаемое значение *является* итератором, то однократная итерация по нему будет использовать его, а последующие итерации приведут к пустому списку:

source: ``MagicMock`` has all of the supported magic methods configured except for some of the obscure and obsolete ones. You can still set these up if you want.
pt_pt: ``MagicMock`` tem todos os métodos mágicos suportados configurados, exceto alguns dos mais obscuros e obsoletos. Ainda pode configurar estes se quiser.
ru: В ``MagicMock`` настроены все поддерживаемые магические методы, за исключением некоторых непонятных и устаревших. Вы все равно можете настроить их, если хотите.

source: Magic methods that are supported but not setup by default in ``MagicMock`` are:
pt_pt: Métodos mágicos que são suportados, mas não configurados por predefinição em ``MagicMock`` são:
ru: Волшебные методы, которые поддерживаются, но не настраиваются по умолчанию в MagicMock:

source: ``__get__``, ``__set__`` and ``__delete__``
pt_pt: ``__get__``, ``__set__`` e ``__delete__``
ru: ``__get__``, ``__set__`` и ``__delete__``
