Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: >>> mock = Mock() >>> mock.submock.attribute1 = 2 >>> mock.not_submock = mock.Mock(name="sample_name") >>> seal(mock) >>> mock.new_attribute # This will raise AttributeError. >>> mock.submock.attribute2 # This will raise AttributeError. >>> mock.not_submock.attribute2 # This won't raise.
pt_pt: >>> mock = Mock() >>> mock.submock.atributo1 = 2 >>> mock.nao_submock = mock.Mock(name="nome_exemplo") >>> seal(mock) >>> mock.novo_atributo # Isto lançará AttributeError. >>> mock.submock.atributo2 # Isto lançará AttributeError. >>> mock.nao_submock.atributo2 # Isto não lançará.

source: Order of precedence of :attr:`!side_effect`, :attr:`!return_value` and *wraps*
pt_pt: Ordem de precedência de :attr:`!side_effect`, :attr:`!return_value` e *wraps*

source: The order of their precedence is:
pt_pt: A ordem de precedência é:
ru: Порядок их старшинства следующий:

source: If all three are set, mock will return the value from :attr:`~Mock.side_effect`, ignoring :attr:`~Mock.return_value` and the wrapped object altogether. If any two are set, the one with the higher precedence will return the value. Regardless of the order of which was set first, the order of precedence remains unchanged.
pt_pt: Se todos os três estiverem definidos, o mock devolverá o valor de :attr:`~Mock.side_effect`, ignorando :attr:`~Mock.return_value` e o objeto envolvido. Se quaisquer dois estiverem definidos, o que tiver maior precedência devolverá o valor. Independentemente da ordem em que foram definidos, a ordem de precedência permanece inalterada.
ru: Если все три установлены, макет вернет значение из :attr:`~Mock.side_effect`, полностью игнорируя :attr:`~Mock.return_value` и обернутый объект. Если установлены любые два, значение будет возвращено значение с более высоким приоритетом. Независимо от того, какой порядок был установлен первым, порядок приоритета остается неизменным.

source: As ``None`` is the default value of :attr:`~Mock.side_effect`, if you reassign its value back to ``None``, the order of precedence will be checked between :attr:`~Mock.return_value` and the wrapped object, ignoring :attr:`~Mock.side_effect`.
pt_pt: Como ``None`` é o valor predefinido de :attr:`~Mock.side_effect`, se reatribuir o seu valor de volta para ``None``, a ordem de precedência será verificada entre :attr:`~Mock.return_value` e o objeto envolvido, ignorando :attr:`~Mock.side_effect`.
ru: Поскольку ``None`` является значением по умолчанию для :attr:`~Mock.side_effect`, если вы переназначите его значение обратно на ``None``, порядок приоритета будет проверен между :attr:`~Mock.return_value ` и обернутый объект, игнорируя :attr:`~Mock.side_effect`.

source: If the value being returned by :attr:`~Mock.side_effect` is :data:`DEFAULT`, it is ignored and the order of precedence moves to the successor to obtain the value to return.
pt_pt: Se o valor a ser devolvido por :attr:`~Mock.side_effect` for :data:`DEFAULT`, este é ignorado e a ordem de precedência passa para o sucessor para obter o valor a devolver.
ru: Если значение, возвращаемое :attr:`~Mock.side_effect`, равно :data:`DEFAULT`, оно игнорируется, и порядок приоритета перемещается к преемнику, чтобы получить возвращаемое значение.

source: When :class:`Mock` wraps an object, the default value of :attr:`~Mock.return_value` will be :data:`DEFAULT`.
pt_pt: Quando :class:`Mock` envolve um objeto, o valor predefinido de :attr:`~Mock.return_value` será :data:`DEFAULT`.
ru: Когда :class:`Mock` оборачивает объект, значением по умолчанию :attr:`~Mock.return_value` будет :data:`DEFAULT`.

source: The order of precedence will ignore this value and it will move to the last successor which is the wrapped object.
pt_pt: A ordem de precedência ignorará este valor e passará para o último sucessor, que é o objeto envolvido.
ru: Порядок приоритета будет игнорировать это значение и переместится к последнему преемнику, который является обернутым объектом.

source: As the real call is being made to the wrapped object, creating an instance of this mock will return the real instance of the class. The positional arguments, if any, required by the wrapped object must be passed.
pt_pt: Como a chamada real está a ser feita ao objeto envolvido, criar uma instância deste mock devolverá a instância real da classe. Os argumentos posicionais, se houver, exigidos pelo objeto envolvido devem ser passados.
ru: Поскольку реальный вызов выполняется к обернутому объекту, создание экземпляра этого макета вернет реальный экземпляр класса. Должны быть переданы позиционные аргументы, если таковые имеются, необходимые для обернутого объекта.

source: But if you assign ``None`` to it, this will not be ignored as it is an explicit assignment. So, the order of precedence will not move to the wrapped object.
pt_pt: Mas se atribuir ``None`` a ele, isto não será ignorado, pois é uma atribuição explícita. Portanto, a ordem de precedência não passará para o objeto envolvido.
ru: Но если вы присвоите ему None, это не будет проигнорировано, поскольку это явное присвоение. Таким образом, порядок приоритета не будет перенесен на обернутый объект.

source: Even if you set all three at once when initializing the mock, the order of precedence remains the same:
pt_pt: Mesmo que defina os três de uma vez ao inicializar o mock, a ordem de precedência permanece a mesma:
ru: Даже если вы установите все три одновременно при инициализации макета, порядок приоритета останется прежним:

source: If :attr:`~Mock.side_effect` is exhausted, the order of precedence will not cause a value to be obtained from the successors. Instead, ``StopIteration`` exception is raised.
pt_pt: Se :attr:`~Mock.side_effect` estiver esgotado, a ordem de precedência não fará com que um valor seja obtido dos sucessores. Em vez disso, será lançada uma exceção ``StopIteration``.
ru: Если :attr:`~Mock.side_effect` исчерпан, порядок приоритета не приведет к получению значения от наследников. Вместо этого возникает исключение StopIteration.

source: :attr:`side_effect` allows you to perform side effects, including raising an exception when a mock is called:
ru: :attr:`side_effect` позволяет вам выполнять побочные эффекты, включая создание исключения при вызове макета:

source: This is either ``None`` (if the mock hasn't been called), or the arguments that the mock was last called with. This will be in the form of a tuple: the first member, which can also be accessed through the ``args`` property, is any ordered arguments the mock was called with (or an empty tuple) and the second member, which can also be accessed through the ``kwargs`` property, is any keyword arguments (or an empty dictionary).
ru: Это либо None (если макет не вызывался), либо аргументы, с которыми макет вызывался в последний раз. Это будет кортеж: первый член, к которому также можно получить доступ через свойство args, — это любые упорядоченные аргументы, с которыми был вызван макет (или пустой кортеж), а второй член, который может также доступен через свойство kwargs, любые аргументы ключевого слова (или пустой словарь).

source: Normally the :attr:`__class__` attribute of an object will return its type. For a mock object with a :attr:`spec`, ``__class__`` returns the spec class instead. This allows mock objects to pass :func:`isinstance` tests for the object they are replacing / masquerading as:
ru: Обычно атрибут :attr:`__class__` объекта возвращает его тип. Для макетного объекта со спецификацией :attr:```__class__`` вместо этого возвращает класс спецификации. Это позволяет макетным объектам проходить тесты :func:`isinstance` для объекта, который они заменяют/маскируют под:

source: :attr:`__class__` is assignable to, this allows a mock to pass an :func:`isinstance` check without forcing you to use a spec:
ru: :attr:`__class__` можно назначить, это позволяет макету пройти проверку :func:`isinstance`, не заставляя вас использовать спецификацию:

source: Mock objects that use a class or an instance as a :attr:`spec` or :attr:`spec_set` are able to pass :func:`isinstance` tests:
ru: Мок-объекты, использующие класс или экземпляр в качестве :attr:`spec` или :attr:`spec_set`, могут проходить тесты :func:`isinstance`:

source: If :attr:`~Mock.side_effect` is set then it will be called after the call has been recorded, so if :attr:`side_effect` raises an exception the call is still recorded.
ru: Если :attr:`~Mock.side_effect` установлен, то он будет вызываться после записи вызова, поэтому, если :attr:`side_effect` вызывает исключение, вызов все равно записывается.

source: If :attr:`side_effect` is a function then whatever that function returns is what calls to the mock return. The :attr:`side_effect` function is called with the same arguments as the mock. This allows you to vary the return value of the call dynamically, based on the input:
ru: Если :attr:`side_effect` — это функция, то все, что возвращает эта функция, является тем, что вызывает фиктивный возврат. Функция :attr:`side_effect` вызывается с теми же аргументами, что и макет. Это позволяет вам динамически изменять возвращаемое значение вызова в зависимости от входных данных:

source: If you want the mock to still return the default return value (a new mock), or any set return value, then there are two ways of doing this. Either return :attr:`mock.return_value` from inside :attr:`side_effect`, or return :data:`DEFAULT`:
ru: Если вы хотите, чтобы макет по-прежнему возвращал возвращаемое значение по умолчанию (новый макет) или любое установленное возвращаемое значение, есть два способа сделать это. Либо верните :attr:`mock.return_value` изнутри :attr:`side_effect`, либо верните :data:`DEFAULT`:

source: To remove a :attr:`side_effect`, and return to the default behaviour, set the :attr:`side_effect` to ``None``:
ru: Чтобы удалить :attr:`side_effect` и вернуться к поведению по умолчанию, установите для :attr:`side_effect` значение ``None``:

source: The :attr:`side_effect` can also be any iterable object. Repeated calls to the mock will return values from the iterable (until the iterable is exhausted and a :exc:`StopIteration` is raised):
ru: :attr:`side_effect` также может быть любым итерируемым объектом. Повторные вызовы макета будут возвращать значения из итерации (пока итерация не будет исчерпана и не будет вызвано :exc:`StopIteration`):

source: You may want a mock object to return ``False`` to a :func:`hasattr` call, or raise an :exc:`AttributeError` when an attribute is fetched. You can do this by providing an object as a :attr:`spec` for a mock, but that isn't always convenient.
ru: Мок-объекты создают атрибуты по требованию. Это позволяет им притворяться объектами любого типа.

source: Patch can be used as a :class:`TestCase` class decorator. It works by decorating each test method in the class. This reduces the boilerplate code when your test methods share a common patchings set. :func:`patch` finds tests by looking for method names that start with ``patch.TEST_PREFIX``. By default this is ``'test'``, which matches the way :mod:`unittest` finds tests. You can specify an alternative prefix by setting ``patch.TEST_PREFIX``.
ru: Patch можно использовать как декоратор класса :class:`TestCase`. Он работает путем украшения каждого тестового метода в классе. Это уменьшает количество шаблонного кода, когда ваши методы тестирования используют общий набор исправлений. :func:`patch` находит тесты, ища имена методов, начинающиеся с ``patch.TEST_PREFIX``. По умолчанию это ``'test'``, который соответствует тому, как :mod:`unittest` находит тесты. Вы можете указать альтернативный префикс, установив ``patch.TEST_PREFIX``.

source: To configure return values on methods of *instances* on the patched class you must do this on the :attr:`return_value`. For example::
ru: Чтобы настроить возвращаемые значения для методов *экземпляров* исправленного класса, вы должны сделать это в :attr:`return_value`. Например::

source: Patch a dictionary, or dictionary like object, and restore the dictionary to its original state after the test.
ru: Исправьте словарь или словареподобный объект и восстановите словарь в исходное состояние после теста.

source: All the patchers have :meth:`start` and :meth:`stop` methods. These make it simpler to do patching in ``setUp`` methods or where you want to do multiple patches without nesting decorators or with statements.
ru: Все патчеры имеют методы :meth:`start` и :meth:`stop`. Это упрощает внесение исправлений в методах ``setUp`` или там, где вы хотите выполнить несколько исправлений без вложенных декораторов или с помощью операторов.

source: To use them call :func:`patch`, :func:`patch.object` or :func:`patch.dict` as normal and keep a reference to the returned ``patcher`` object. You can then call :meth:`start` to put the patch in place and :meth:`stop` to undo it.
ru: Чтобы использовать их, вызовите :func:`patch`, :func:`patch.object` или :func:`patch.dict` как обычно и сохраните ссылку на возвращенный объект ``patcher``. Затем вы можете вызвать :meth:`start`, чтобы установить патч, и :meth:`stop`, чтобы отменить его.

source: A typical use case for this might be for doing multiple patches in the ``setUp`` method of a :class:`TestCase`::
ru: Типичным примером использования этого может быть выполнение нескольких исправлений в методе ``setUp`` :class:`TestCase`::

source: Now we want to test ``some_function`` but we want to mock out ``SomeClass`` using :func:`patch`. The problem is that when we import module b, which we will have to do then it imports ``SomeClass`` from module a. If we use :func:`patch` to mock out ``a.SomeClass`` then it will have no effect on our test; module b already has a reference to the *real* ``SomeClass`` and it looks like our patching had no effect.
ru: Теперь мы хотим протестировать ``some_function``, но мы хотим смоделировать ``SomeClass``, используя :func:`patch`. Проблема в том, что когда мы импортируем модуль b, что нам придется сделать, он импортирует ``SomeClass`` из модуля a. Если мы используем :func:`patch` для макетирования ``a.SomeClass``, то это не окажет никакого влияния на наш тест; модуль b уже имеет ссылку на *реальный* ``SomeClass``, и похоже, что наши исправления не оказали никакого эффекта.

source: Magic Mock
ru: Волшебный макет

source: Alternatively you can just use ``vars(my_mock)`` (instance members) and ``dir(type(my_mock))`` (type members) to bypass the filtering irrespective of :const:`mock.FILTER_DIR`.
ru: В качестве альтернативы вы можете просто использовать ``vars(my_mock)`` (члены экземпляра) и ``dir(type(my_mock))`` (члены типа), чтобы обойти фильтрацию независимо от :const:`mock.FILTER_DIR`.

source: *read_data* is a string for the :meth:`~io.IOBase.read`, :meth:`~io.IOBase.readline`, and :meth:`~io.IOBase.readlines` methods of the file handle to return. Calls to those methods will take data from *read_data* until it is depleted. The mock of these methods is pretty simplistic: every time the *mock* is called, the *read_data* is rewound to the start. If you need more control over the data that you are feeding to the tested code you will need to customize this mock for yourself. When that is insufficient, one of the in-memory filesystem packages on `PyPI <https://pypi.org>`_ can offer a realistic filesystem for testing.
ru: *read_data* — это строка для методов :meth:`~io.IOBase.read`, :meth:`~io.IOBase.readline` и :meth:`~io.IOBase.readlines` дескриптора файла. возвращаться. Вызовы этих методов будут брать данные из *read_data*, пока они не будут исчерпаны. Имитация этих методов довольно упрощена: каждый раз, когда вызывается *mock*, *read_data* перематывается на начало. Если вам нужен больший контроль над данными, которые вы передаете в тестируемый код, вам нужно будет настроить этот макет под себя. Если этого недостаточно, один из пакетов файловой системы в памяти PyPI <https://pypi.org>_ может предложить реалистичную файловую систему для тестирования.

source: Added :meth:`~io.IOBase.readline` and :meth:`~io.IOBase.readlines` support. The mock of :meth:`~io.IOBase.read` changed to consume *read_data* rather than returning it on each call.
ru: Добавлена ​​поддержка :meth:`~io.IOBase.readline` и :meth:`~io.IOBase.readlines`. Макет :meth:`~io.IOBase.read` изменен на использование *read_data* вместо того, чтобы возвращать его при каждом вызове.

source: Autospeccing
ru: Автоматическая настройка

source: Autospeccing is based on the existing :attr:`spec` feature of mock. It limits the api of mocks to the api of an original object (the spec), but it is recursive (implemented lazily) so that attributes of mocks only have the same api as the attributes of the spec. In addition mocked functions / methods have the same call signature as the original so they raise a :exc:`TypeError` if they are called incorrectly.
ru: Автоспецификация основана на существующей функции макета :attr:`spec`. Он ограничивает API-интерфейсы макетов API исходного объекта (спецификации), но он рекурсивен (реализуется лениво), так что атрибуты макетов имеют только тот же API, что и атрибуты спецификации. Кроме того, имитируемые функции/методы имеют ту же сигнатуру вызова, что и исходные, поэтому они вызывают ошибку :exc:`TypeError`, если они вызваны неправильно.

source: :mod:`mock` already provides a feature to help with this, called speccing. If you use a class or instance as the :attr:`spec` for a mock then you can only access attributes on the mock that exist on the real class:
ru: :mod:`mock` уже предоставляет функцию, которая поможет в этом, называемую спецификацией. Если вы используете класс или экземпляр в качестве :attr:`spec` для макета, вы можете получить доступ только к атрибутам макета, которые существуют в реальном классе:

source: You can see that :class:`request.Request` has a spec. :class:`request.Request` takes two arguments in the constructor (one of which is *self*). Here's what happens if we try to call it incorrectly::
ru: Вы можете видеть, что :class:`request.Request` имеет спецификацию. :class:`request.Request` принимает в конструкторе два аргумента (один из которых *self*). Вот что произойдет, если мы попытаемся вызвать его неправильно:

source: :class:`Request` objects are not callable, so the return value of instantiating our mocked out :class:`request.Request` is a non-callable mock. With the spec in place any typos in our asserts will raise the correct error::
ru: Объекты :class:`Request` не подлежат вызову, поэтому возвращаемое значение создания экземпляра нашего макета :class:`request.Request` является невызываемым макетом. При наличии спецификации любые опечатки в наших утверждениях вызовут правильную ошибку::

source: Order of precedence of :attr:`side_effect`, :attr:`return_value` and *wraps*
ru: Порядок приоритета :attr:`side_effect`, :attr:`return_value` и *wraps*
