Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: ``__reversed__`` and ``__missing__``
pt_pt: ``__reversed__`` e ``__missing__``
ru: ``__reversed__`` и ``__missing__``

source: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
pt_pt: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` e ``__setstate__``
ru: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` и ``__setstate__``

source: Magic methods *should* be looked up on the class rather than the instance. Different versions of Python are inconsistent about applying this rule. The supported protocol methods should work with all supported versions of Python.
pt_pt: Os métodos mágicos *devem* ser procurados na classe em vez da instância. Diferentes versões do Python são inconsistentes na aplicação desta regra. Os métodos de protocolo suportados devem funcionar com todas as versões suportadas do Python.
ru: Волшебные методы *следует* искать в классе, а не в экземпляре. Различные версии Python по-разному применяют это правило. Поддерживаемые методы протокола должны работать со всеми поддерживаемыми версиями Python.

source: The function is basically hooked up to the class, but each ``Mock`` instance is kept isolated from the others.
pt_pt: A função está basicamente ligada à classe, mas cada instância ``Mock`` é mantida isolada das outras.
ru: Функция в основном привязана к классу, но каждый экземпляр Mock изолирован от других.

source: Helpers
pt_pt: Auxiliares
ru: Помощники

source: sentinel
pt_pt: sentinela
ru: дозорный

source: The ``sentinel`` object provides a convenient way of providing unique objects for your tests.
pt_pt: O objeto ``sentinel`` fornece uma forma conveniente de fornecer objetos únicos para os seus testes.
ru: Объект Sentinel предоставляет удобный способ предоставления уникальных объектов для ваших тестов.

source: Attributes are created on demand when you access them by name. Accessing the same attribute will always return the same object. The objects returned have a sensible repr so that test failure messages are readable.
pt_pt: Os atributos são criados conforme necessário quando os acede pelo nome. Aceder ao mesmo atributo sempre devolverá o mesmo objeto. Os objetos devolvidos têm uma representação legível para que as mensagens de falha de teste sejam compreensíveis.
ru: Атрибуты создаются по требованию, когда вы обращаетесь к ним по имени. Доступ к одному и тому же атрибуту всегда будет возвращать один и тот же объект. Возвращенные объекты имеют разумное представление, поэтому сообщения об ошибках теста можно прочитать.

source: The ``sentinel`` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`.
pt_pt: Os atributos ``sentinel`` agora preservam a sua identidade quando são :mod:`copiados <copy>` ou :mod:`serializados <pickle>`.
ru: Атрибуты ``sentinel`` теперь сохраняют свою идентичность, когда они :mod:`копируются <copy>` или :mod:`маринуются <pickle>`.

source: Sometimes when testing you need to test that a specific object is passed as an argument to another method, or returned. It can be common to create named sentinel objects to test this. :data:`sentinel` provides a convenient way of creating and testing the identity of objects like this.
pt_pt: Às vezes, ao testar, precisa de verificar se um objeto específico é passado como argumento para outro método ou devolvido. Pode ser comum criar objetos sentinela nomeados para testar isto. :data:`sentinel` fornece uma forma conveniente de criar e testar a identidade de objetos como este.
ru: Иногда при тестировании вам необходимо проверить, что конкретный объект передается в качестве аргумента другому методу или возвращается. Для проверки этого может быть обычным создание именованных сторожевых объектов. :data:`sentinel` предоставляет удобный способ создания и проверки подлинности подобных объектов.

source: In this example we monkey patch ``method`` to return ``sentinel.some_object``:
pt_pt: Neste exemplo, fazemos um monkey patch do ``method`` para devolver ``sentinel.some_object``:
ru: В этом примере мы обрабатываем ``method``, чтобы вернуть ``sentinel.some_object``:

source: DEFAULT
pt_pt: PADRÃO

source: The :data:`DEFAULT` object is a pre-created sentinel (actually ``sentinel.DEFAULT``). It can be used by :attr:`~Mock.side_effect` functions to indicate that the normal return value should be used.
pt_pt: O objeto :data:`DEFAULT` é uma sentinela pré-criada (na verdade ``sentinel.DEFAULT``). Pode ser usado por funções :attr:`~Mock.side_effect` para indicar que o valor de retorno normal deve ser usado.
ru: Объект :data:`DEFAULT` — это заранее созданный дозорный (на самом деле ``sentinel.DEFAULT``). Его можно использовать функциями :attr:`~Mock.side_effect`, чтобы указать, что следует использовать обычное возвращаемое значение.

source: call
pt_pt: chamada

source: :func:`call` is a helper object for making simpler assertions, for comparing with :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` and :attr:`~Mock.method_calls`. :func:`call` can also be used with :meth:`~Mock.assert_has_calls`.
pt_pt: :func:`call` é um objeto auxiliar para fazer afirmações mais simples, para comparar com :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` e :attr:`~Mock.method_calls`. :func:`call` também pode ser usado com :meth:`~Mock.assert_has_calls`.
ru: :func:`call` — вспомогательный объект для создания более простых утверждений, для сравнения с :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` и :attr :`~Mock.method_calls`. :func:`call` также можно использовать с :meth:`~Mock.assert_has_calls`.

source: For a call object that represents multiple calls, :meth:`call_list` returns a list of all the intermediate calls as well as the final call.
pt_pt: Para um objeto de chamada que representa várias chamadas, :meth:`call_list` devolve uma lista de todas as chamadas intermédias, bem como a chamada final.
ru: Для объекта вызова, который представляет несколько вызовов, :meth:`call_list` возвращает список всех промежуточных вызовов, а также финальный вызов.

source: ``call_list`` is particularly useful for making assertions on "chained calls". A chained call is multiple calls on a single line of code. This results in multiple entries in :attr:`~Mock.mock_calls` on a mock. Manually constructing the sequence of calls can be tedious.
pt_pt: ``call_list`` é particularmente útil para fazer afirmações sobre "chamadas encadeadas". Uma chamada encadeada são várias chamadas numa única linha de código. Isto resulta em várias entradas em :attr:`~Mock.mock_calls` num mock. Construir manualmente a sequência de chamadas pode ser tedioso.
ru: ``call_list`` особенно полезен для создания утверждений о "связанных вызовах". Связанный вызов — это несколько вызовов в одной строке кода. Это приводит к появлению нескольких записей в :attr:`~Mock.mock_calls` для макета. Создание последовательности вызовов вручную может быть утомительным.

source: :meth:`~call.call_list` can construct the sequence of calls from the same chained call:
pt_pt: :meth:`~call.call_list` pode construir a sequência de chamadas a partir da mesma chamada encadeada:
ru: :meth:`~call.call_list` может создать последовательность вызовов из одного и того же связанного вызова:

source: A ``call`` object is either a tuple of (positional args, keyword args) or (name, positional args, keyword args) depending on how it was constructed. When you construct them yourself this isn't particularly interesting, but the ``call`` objects that are in the :attr:`Mock.call_args`, :attr:`Mock.call_args_list` and :attr:`Mock.mock_calls` attributes can be introspected to get at the individual arguments they contain.
pt_pt: Um objeto ``call`` é ou um tuplo de (argumentos posicionais, argumentos de palavra-chave) ou (nome, argumentos posicionais, argumentos de palavra-chave), dependendo de como foi construído. Quando os constrói manualmente, isto não é particularmente interessante, mas os objetos ``call`` que estão nos atributos :attr:`Mock.call_args`, :attr:`Mock.call_args_list` e :attr:`Mock.mock_calls` podem ser introspecionados para obter os argumentos individuais que contêm.
ru: Объект ``call`` представляет собой кортеж из (позиционных аргументов, аргументов ключевого слова) или (имя, позиционных аргументов, аргументов ключевого слова) в зависимости от того, как он был создан. Когда вы создаете их самостоятельно, это не представляет особого интереса, но объекты ``call``, находящиеся в :attr:`Mock.call_args`, :attr:`Mock.call_args_list` и :attr:`Mock.mock_calls` Атрибуты можно проанализировать, чтобы получить отдельные аргументы, которые они содержат.

source: The ``call`` objects in :attr:`Mock.call_args` and :attr:`Mock.call_args_list` are two-tuples of (positional args, keyword args) whereas the ``call`` objects in :attr:`Mock.mock_calls`, along with ones you construct yourself, are three-tuples of (name, positional args, keyword args).
pt_pt: Os objetos ``call`` em :attr:`Mock.call_args` e :attr:`Mock.call_args_list` são duplos de (argumentos posicionais, argumentos de palavra-chave), enquanto os objetos ``call`` em :attr:`Mock.mock_calls`, juntamente com os que constrói, são triplos de (nome, argumentos posicionais, argumentos de palavra-chave).
ru: Объекты ``call`` в :attr:`Mock.call_args` и :attr:`Mock.call_args_list` представляют собой два кортежа (позиционные аргументы, ключевые слова args), тогда как объекты ``call`` в :attr:` Mock.mock_calls`, а также те, которые вы создаете самостоятельно, представляют собой три кортежа (имя, позиционные аргументы, аргументы ключевого слова).

source: You can use their "tupleness" to pull out the individual arguments for more complex introspection and assertions. The positional arguments are a tuple (an empty tuple if there are no positional arguments) and the keyword arguments are a dictionary:
pt_pt: Pode usar a sua natureza de "tuplo" para extrair os argumentos individuais para introspeção e afirmações mais complexas. Os argumentos posicionais são um tuplo (um tuplo vazio se não houver argumentos posicionais) e os argumentos de palavra-chave são um dicionário:
ru: Вы можете использовать их «кортежность», чтобы извлечь отдельные аргументы для более сложного самоанализа и утверждений. Позиционные аргументы представляют собой кортеж (пустой кортеж, если позиционных аргументов нет), а аргументы ключевого слова представляют собой словарь:

source: Create a mock object using another object as a spec. Attributes on the mock will use the corresponding attribute on the *spec* object as their spec.
pt_pt: Cria um objeto mock usando outro objeto como especificação. Os atributos no mock usarão o atributo correspondente no objeto *spec* como sua especificação.
ru: Создайте макет объекта, используя другой объект в качестве спецификации. Атрибуты макета будут использовать соответствующий атрибут объекта *spec* в качестве своей спецификации.

source: Functions or methods being mocked will have their arguments checked to ensure that they are called with the correct signature.
pt_pt: Funções ou métodos a serem simulados terão os seus argumentos verificados para garantir que são chamados com a assinatura correta.
ru: Аргументы имитируемых функций или методов будут проверены, чтобы убедиться, что они вызываются с правильной сигнатурой.

source: If *spec_set* is ``True`` then attempting to set attributes that don't exist on the spec object will raise an :exc:`AttributeError`.
pt_pt: Se *spec_set* for ``True``, então tentar definir atributos que não existam no objeto spec lançará um :exc:`AttributeError`.
ru: Если *spec_set* имеет значение ``True``, то попытка установить атрибуты, которых нет в объекте спецификации, приведет к возникновению ошибки :exc:`AttributeError`.

source: If a class is used as a spec then the return value of the mock (the instance of the class) will have the same spec. You can use a class as the spec for an instance object by passing ``instance=True``. The returned mock will only be callable if instances of the mock are callable.
pt_pt: Se uma classe for usada como especificação, então o valor de retorno do mock (a instância da classe) terá a mesma especificação. Pode usar uma classe como especificação para um objeto de instância passando ``instance=True``. O mock devolvido só será chamável se as instâncias do mock forem chamáveis.
ru: Если класс используется в качестве спецификации, то возвращаемое значение макета (экземпляр класса) будет иметь ту же спецификацию. Вы можете использовать класс в качестве спецификации объекта экземпляра, передав ``instance=True``. Возвращенный макет будет доступен для вызова только в том случае, если можно вызвать экземпляры макета.

source: :func:`create_autospec` also takes arbitrary keyword arguments that are passed to the constructor of the created mock.
pt_pt: :func:`create_autospec` também aceita argumentos de palavra-chave arbitrários que são passados para o construtor do mock criado.
ru: :func:`create_autospec` также принимает произвольные аргументы ключевого слова, которые передаются конструктору созданного макета.

source: See :ref:`auto-speccing` for examples of how to use auto-speccing with :func:`create_autospec` and the *autospec* argument to :func:`patch`.
pt_pt: Veja :ref:`auto-speccing` para exemplos de como usar auto-speccing com :func:`create_autospec` e o argumento *autospec* para :func:`patch`.
ru: См. :ref:`auto-speccing` для примеров того, как использовать автоматическую спецификацию с :func:`create_autospec` и аргументом *autospec* для :func:`patch`.

source: :func:`create_autospec` now returns an :class:`AsyncMock` if the target is an async function.
pt_pt: :func:`create_autospec` agora devolve um :class:`AsyncMock` se o alvo for uma função assíncrona.
ru: :func:`create_autospec` теперь возвращает :class:`AsyncMock`, если целью является асинхронная функция.

source: ANY
pt_pt: QUALQUER

source: Sometimes you may need to make assertions about *some* of the arguments in a call to mock, but either not care about some of the arguments or want to pull them individually out of :attr:`~Mock.call_args` and make more complex assertions on them.
pt_pt: Às vezes, pode precisar de fazer afirmações sobre *alguns* dos argumentos numa chamada a um mock, mas ou não se importa com alguns dos argumentos ou quer extraí-los individualmente de :attr:`~Mock.call_args` e fazer afirmações mais complexas sobre eles.
ru: Иногда вам может потребоваться сделать утверждения о *некоторых* аргументах в вызове макета, но вы либо не заботитесь о некоторых аргументах, либо хотите вытащить их по отдельности из :attr:`~Mock.call_args` и сделать более сложным. утверждения о них.

source: To ignore certain arguments you can pass in objects that compare equal to *everything*. Calls to :meth:`~Mock.assert_called_with` and :meth:`~Mock.assert_called_once_with` will then succeed no matter what was passed in.
pt_pt: Para ignorar certos argumentos, pode passar objetos que comparam igual a *tudo*. Chamadas a :meth:`~Mock.assert_called_with` e :meth:`~Mock.assert_called_once_with` terão sucesso independentemente do que foi passado.
ru: Чтобы игнорировать определенные аргументы, вы можете передать объекты, которые при сравнении равны *всем*. Вызовы :meth:`~Mock.assert_called_with` и :meth:`~Mock.assert_known_once_with` будут успешными независимо от того, что было передано.

source: :data:`ANY` can also be used in comparisons with call lists like :attr:`~Mock.mock_calls`:
pt_pt: :data:`ANY` também pode ser usado em comparações com listas de chamadas como :attr:`~Mock.mock_calls`:
ru: :data:`ANY` также можно использовать в сравнении со списками вызовов, например :attr:`~Mock.mock_calls`:

source: :data:`ANY` is not limited to comparisons with call objects and so can also be used in test assertions::
pt_pt: :data:`ANY` não está limitado a comparações com objetos de chamada e, portanto, também pode ser usado em afirmações de teste::
ru: :data:`ANY` не ограничивается сравнением с объектами вызова и поэтому может также использоваться в тестовых утверждениях::

source: class TestStringMethods(unittest.TestCase): def test_split(self): s = 'hello world' self.assertEqual(s.split(), ['hello', ANY])
pt_pt: class TestarMetodosString(unittest.TestCase): def testar_dividir(self): s = 'olá mundo' self.assertEqual(s.split(), ['olá', QUALQUER])

source: FILTER_DIR
pt_pt: FILTRAR_DIR

source: :data:`FILTER_DIR` is a module level variable that controls the way mock objects respond to :func:`dir`. The default is ``True``, which uses the filtering described below, to only show useful members. If you dislike this filtering, or need to switch it off for diagnostic purposes, then set ``mock.FILTER_DIR = False``.
pt_pt: :data:`FILTER_DIR` é uma variável a nível de módulo que controla a forma como os objetos mock respondem a :func:`dir`. O predefinido é ``True``, que usa a filtragem descrita abaixo, para mostrar apenas membros úteis. Se não gostar desta filtragem ou precisar de a desativar para fins de diagnóstico, defina ``mock.FILTER_DIR = False``.
ru: :data:`FILTER_DIR` — это переменная уровня модуля, которая управляет тем, как макетные объекты реагируют на :func:`dir`. По умолчанию установлено значение True, при котором используется фильтрация, описанная ниже, для отображения только полезных элементов. Если вам не нравится эта фильтрация или вам нужно отключить ее в диагностических целях, установите ``mock.FILTER_DIR = False``.

source: With filtering on, ``dir(some_mock)`` shows only useful attributes and will include any dynamically created attributes that wouldn't normally be shown. If the mock was created with a *spec* (or *autospec* of course) then all the attributes from the original are shown, even if they haven't been accessed yet:
pt_pt: Com a filtragem ativada, ``dir(some_mock)`` mostra apenas atributos úteis e incluirá quaisquer atributos criados dinamicamente que normalmente não seriam mostrados. Se o mock foi criado com um *spec* (ou *autospec*, claro), então todos os atributos do original são mostrados, mesmo que ainda não tenham sido acedidos:
ru: При включенной фильтрации ``dir(some_mock)`` показывает только полезные атрибуты и включает любые динамически созданные атрибуты, которые обычно не отображаются. Если макет был создан с использованием *spec* (или, конечно, *autospec*), то отображаются все атрибуты оригинала, даже если к ним еще не обращались:

source: Many of the not-very-useful (private to :class:`Mock` rather than the thing being mocked) underscore and double underscore prefixed attributes have been filtered from the result of calling :func:`dir` on a :class:`Mock`. If you dislike this behaviour you can switch it off by setting the module level switch :data:`FILTER_DIR`:
pt_pt: Muitos dos atributos não muito úteis (privados a :class:`Mock` em vez da coisa a ser simulada) com prefixo de sublinhado e duplo sublinhado foram filtrados do resultado da chamada a :func:`dir` num :class:`Mock`. Se não gostar deste comportamento, pode desativá-lo definindo o interruptor a nível de módulo :data:`FILTER_DIR`:
ru: Многие из не очень полезных (приватных для :class:`Mock`, а не для того, над чем высмеивают) атрибутов подчеркивания и двойного подчеркивания с префиксом были отфильтрованы из результата вызова :func:`dir` в :class:` Мок`. Если вам не нравится такое поведение, вы можете отключить его, установив переключатель уровня модуля :data:`FILTER_DIR`:

source: Alternatively you can just use ``vars(my_mock)`` (instance members) and ``dir(type(my_mock))`` (type members) to bypass the filtering irrespective of :const:`FILTER_DIR`.
pt_pt: Alternativamente, pode simplesmente usar ``vars(my_mock)`` (membros da instância) e ``dir(type(my_mock))`` (membros do tipo) para contornar a filtragem independentemente de :const:`FILTER_DIR`.

source: A helper function to create a mock to replace the use of :func:`open`. It works for :func:`open` called directly or used as a context manager.
pt_pt: Uma função auxiliar para criar um mock para substituir o uso de :func:`open`. Funciona para :func:`open` chamado diretamente ou usado como um gestor de contexto.
ru: Вспомогательная функция для создания макета вместо использования :func:`open`. Это работает для :func:`open`, вызываемого напрямую или используемого в качестве менеджера контекста.

source: The *mock* argument is the mock object to configure. If ``None`` (the default) then a :class:`MagicMock` will be created for you, with the API limited to methods or attributes available on standard file handles.
pt_pt: O argumento *mock* é o objeto mock a configurar. Se for ``None`` (o predefinido), então um :class:`MagicMock` será criado para si, com a API limitada a métodos ou atributos disponíveis em manipuladores de ficheiros padrão.
ru: Аргумент *mock* — это фиктивный объект для настройки. Если «Нет» (по умолчанию), то для вас будет создан :class:`MagicMock`, а API ограничен методами или атрибутами, доступными в стандартных дескрипторах файлов.

source: *read_data* is a string for the :meth:`~io.RawIOBase.read`, :meth:`~io.IOBase.readline`, and :meth:`~io.IOBase.readlines` methods of the file handle to return. Calls to those methods will take data from *read_data* until it is depleted. The mock of these methods is pretty simplistic: every time the *mock* is called, the *read_data* is rewound to the start. If you need more control over the data that you are feeding to the tested code you will need to customize this mock for yourself. When that is insufficient, one of the in-memory filesystem packages on `PyPI <https://pypi.org>`_ can offer a realistic filesystem for testing.
pt_pt: *read_data* é uma string para os métodos :meth:`~io.RawIOBase.read`, :meth:`~io.IOBase.readline` e :meth:`~io.IOBase.readlines` do manipulador de ficheiros devolverem. As chamadas a esses métodos irão obter dados de *read_data* até que este esteja esgotado. O mock destes métodos é bastante simplista: todas as vezes que o *mock* é chamado, o *read_data* é rebobinado para o início. Se precisar de mais controlo sobre os dados que está a fornecer ao código testado, terá de personalizar este mock. Quando isso não for suficiente, um dos pacotes de sistema de ficheiros em memória no `PyPI <https://pypi.org>`_ pode oferecer um sistema de ficheiros realista para testes.

source: Added :meth:`~io.IOBase.readline` and :meth:`~io.IOBase.readlines` support. The mock of :meth:`~io.RawIOBase.read` changed to consume *read_data* rather than returning it on each call.
pt_pt: Adicionado suporte para :meth:`~io.IOBase.readline` e :meth:`~io.IOBase.readlines`. O mock de :meth:`~io.RawIOBase.read` foi alterado para consumir *read_data* em vez de o devolver em cada chamada.

source: *read_data* is now reset on each call to the *mock*.
pt_pt: *read_data* é agora redefinido em cada chamada ao *mock*.
ru: *read_data* теперь сбрасывается при каждом вызове *mock*.

source: Added :meth:`~container.__iter__` to implementation so that iteration (such as in for loops) correctly consumes *read_data*.
pt_pt: Adicionado :meth:`~container.__iter__` à implementação para que a iteração (como em ciclos for) consuma corretamente *read_data*.
ru: В реализацию добавлен :meth:`~container.__iter__`, чтобы итерация (например, в циклах for) правильно использовала *read_data*.
