Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: :mod:`!unittest.mock` --- mock object library
pt_pt: :mod:`!unittest.mock` --- biblioteca de objetos mock

source: **Source code:** :source:`Lib/unittest/mock.py`
pt_pt: **Código-fonte:** :source:`Lib/unittest/mock.py`
ru: **Исходный код:** :source:`Lib/unittest/mock.py`

source: :mod:`unittest.mock` is a library for testing in Python. It allows you to replace parts of your system under test with mock objects and make assertions about how they have been used.
pt_pt: :mod:`unittest.mock` é uma biblioteca para testes em Python. Permite-lhe substituir partes do seu sistema em teste por objetos mock e fazer afirmações sobre como foram usados.
ru: :mod:`unittest.mock` — это библиотека для тестирования на Python. Это позволяет вам заменять части тестируемой системы макетными объектами и делать утверждения о том, как они использовались.

source: :mod:`unittest.mock` provides a core :class:`Mock` class removing the need to create a host of stubs throughout your test suite. After performing an action, you can make assertions about which methods / attributes were used and arguments they were called with. You can also specify return values and set needed attributes in the normal way.
pt_pt: :mod:`unittest.mock` fornece uma classe principal :class:`Mock` que elimina a necessidade de criar vários stubs em toda a sua suite de testes. Após realizar uma ação, pode fazer afirmações sobre quais métodos/atributos foram usados e os argumentos com que foram chamados. Também pode especificar valores de retorno e definir atributos necessários da forma habitual.
ru: :mod:`unittest.mock` предоставляет базовый класс :class:`Mock`, устраняющий необходимость создания множества заглушек в вашем наборе тестов. После выполнения действия вы можете делать утверждения о том, какие методы/атрибуты были использованы и с какими аргументами они были вызваны. Вы также можете указать возвращаемые значения и установить необходимые атрибуты обычным способом.

source: Additionally, mock provides a :func:`patch` decorator that handles patching module and class level attributes within the scope of a test, along with :const:`sentinel` for creating unique objects. See the `quick guide`_ for some examples of how to use :class:`Mock`, :class:`MagicMock` and :func:`patch`.
pt_pt: Além disso, mock fornece um decorador :func:`patch` que trata da substituição de atributos a nível de módulo e classe dentro do âmbito de um teste, juntamente com :const:`sentinel` para criar objetos únicos. Veja o `guia rápido`_ para alguns exemplos de como usar :class:`Mock`, :class:`MagicMock` e :func:`patch`.
ru: Кроме того, макет предоставляет декоратор :func:`patch`, который обрабатывает исправления атрибутов уровня модуля и класса в рамках теста, а также :const:`sentinel` для создания уникальных объектов. См. `краткое руководство`_ для некоторых примеров использования :class:`Mock`, :class:`MagicMock` и :func:`patch`.

source: Mock is designed for use with :mod:`unittest` and is based on the 'action -> assertion' pattern instead of 'record -> replay' used by many mocking frameworks.
pt_pt: Mock é concebido para ser usado com :mod:`unittest` e é baseado no padrão 'ação -> afirmação' em vez do 'gravar -> reproduzir' usado por muitos frameworks de mock.
ru: Mock предназначен для использования с :mod:`unittest` и основан на шаблоне «действие -> утверждение» вместо «запись -> воспроизведение», используемом многими фреймворками для создания макетов.

source: There is a backport of :mod:`unittest.mock` for earlier versions of Python, available as :pypi:`mock` on PyPI.
pt_pt: Existe uma retroportagem de :mod:`unittest.mock` para versões anteriores do Python, disponível como :pypi:`mock` no PyPI.

source: Quick Guide
pt_pt: Guia Rápido
ru: Краткое руководство

source: :class:`Mock` and :class:`MagicMock` objects create all attributes and methods as you access them and store details of how they have been used. You can configure them, to specify return values or limit what attributes are available, and then make assertions about how they have been used:
pt_pt: Os objetos :class:`Mock` e :class:`MagicMock` criam todos os atributos e métodos à medida que os acede e armazenam detalhes sobre como foram usados. Pode configurá-los para especificar valores de retorno ou limitar quais atributos estão disponíveis e, em seguida, fazer afirmações sobre como foram usados:
ru: Объекты :class:`Mock` и :class:`MagicMock` создают все атрибуты и методы по мере доступа к ним и сохраняют сведения о том, как они использовались. Вы можете настроить их, чтобы указать возвращаемые значения или ограничить доступные атрибуты, а затем сделать утверждения о том, как они использовались:

source: :attr:`~Mock.side_effect` allows you to perform side effects, including raising an exception when a mock is called:
pt_pt: :attr:`~Mock.side_effect` permite-lhe realizar efeitos secundários, incluindo lançar uma exceção quando um mock é chamado:

source: Mock has many other ways you can configure it and control its behaviour. For example the *spec* argument configures the mock to take its specification from another object. Attempting to access attributes or methods on the mock that don't exist on the spec will fail with an :exc:`AttributeError`.
pt_pt: Mock tem muitas outras formas de o configurar e controlar o seu comportamento. Por exemplo, o argumento *spec* configura o mock para obter a sua especificação de outro objeto. Tentar aceder a atributos ou métodos no mock que não existam no spec falhará com um :exc:`AttributeError`.
ru: У Mock есть много других способов настроить его и контролировать его поведение. Например, аргумент *spec* настраивает макет на получение спецификации из другого объекта. Попытка получить доступ к атрибутам или методам макета, которых нет в спецификации, завершится неудачно с ошибкой :exc:`AttributeError`.

source: The :func:`patch` decorator / context manager makes it easy to mock classes or objects in a module under test. The object you specify will be replaced with a mock (or other object) during the test and restored when the test ends::
pt_pt: O decorador/gestor de contexto :func:`patch` facilita a simulação de classes ou objetos num módulo em teste. O objeto que especificar será substituído por um mock (ou outro objeto) durante o teste e restaurado quando o teste terminar::
ru: Декоратор/менеджер контекста :func:`patch` позволяет легко имитировать классы или объекты в тестируемом модуле. Указанный вами объект будет заменен макетом (или другим объектом) во время теста и восстановлен по завершении теста:

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``module.ClassName1`` is passed in first.
pt_pt: Quando aninha decoradores patch, os mocks são passados para a função decorada na mesma ordem em que foram aplicados (a ordem normal *Python* em que os decoradores são aplicados). Isto significa de baixo para cima, por isso no exemplo acima o mock para ``module.ClassName1`` é passado primeiro.
ru: Когда вы вкладываете декораторы патчей, макеты передаются декорируемой функции в том же порядке, в котором они были применены (обычный порядок *Python*, в котором применяются декораторы). Это означает, что снизу вверх, поэтому в приведенном выше примере сначала передается макет для ``module.ClassName1``.

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
pt_pt: Com :func:`patch`, é importante substituir objetos no espaço de nomes onde são procurados. Isto é normalmente simples, mas para um guia rápido leia :ref:`onde substituir <where-to-patch>`.
ru: При использовании :func:`patch` важно исправлять объекты в пространстве имен, в котором они просматриваются. Обычно это просто, но для краткого руководства прочтите :ref:`where to patch <where-to-patch>`.

source: As well as a decorator :func:`patch` can be used as a context manager in a with statement:
pt_pt: Além de um decorador, :func:`patch` pode ser usado como um gestor de contexto numa declaração with:
ru: Помимо декоратора :func:`patch` можно использовать в качестве менеджера контекста в операторе with:

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
pt_pt: Também existe :func:`patch.dict` para definir valores num dicionário apenas durante um âmbito e restaurar o dicionário para o seu estado original quando o teste termina:
ru: Существует также :func:`patch.dict` для установки значений в словаре только во время проверки и восстановления словаря в исходное состояние после завершения теста:

source: Mock supports the mocking of Python :ref:`magic methods <magic-methods>`. The easiest way of using magic methods is with the :class:`MagicMock` class. It allows you to do things like:
pt_pt: Mock suporta a simulação de :ref:`métodos mágicos <magic-methods>` do Python. A forma mais fácil de usar métodos mágicos é com a classe :class:`MagicMock`. Permite-lhe fazer coisas como:
ru: Mock поддерживает издевательство над Python :ref:`магическими методами <magic-methods>`. Самый простой способ использовать магические методы — использовать класс :class:`MagicMock`. Это позволяет вам делать такие вещи, как:

source: Mock allows you to assign functions (or other Mock instances) to magic methods and they will be called appropriately. The :class:`MagicMock` class is just a Mock variant that has all of the magic methods pre-created for you (well, all the useful ones anyway).
pt_pt: Mock permite-lhe atribuir funções (ou outras instâncias Mock) a métodos mágicos e elas serão chamadas apropriadamente. A classe :class:`MagicMock` é apenas uma variante de Mock que tem todos os métodos mágicos pré-criados para si (bem, todos os úteis, de qualquer forma).
ru: Mock позволяет вам назначать функции (или другие экземпляры Mock) магическим методам, и они будут вызываться соответствующим образом. Класс :class:`MagicMock` — это просто вариант Mock, в котором заранее созданы все магические методы (ну, во всяком случае, все полезные).

source: The following is an example of using magic methods with the ordinary Mock class:
pt_pt: O seguinte é um exemplo de uso de métodos mágicos com a classe Mock normal:
ru: Ниже приведен пример использования магических методов с обычным классом Mock:

source: For ensuring that the mock objects in your tests have the same api as the objects they are replacing, you can use :ref:`auto-speccing <auto-speccing>`. Auto-speccing can be done through the *autospec* argument to patch, or the :func:`create_autospec` function. Auto-speccing creates mock objects that have the same attributes and methods as the objects they are replacing, and any functions and methods (including constructors) have the same call signature as the real object.
pt_pt: Para garantir que os objetos mock nos seus testes têm a mesma API que os objetos que estão a substituir, pode usar :ref:`auto-speccing <auto-speccing>`. Auto-speccing pode ser feito através do argumento *autospec* para patch, ou da função :func:`create_autospec`. Auto-speccing cria objetos mock que têm os mesmos atributos e métodos que os objetos que estão a substituir, e quaisquer funções e métodos (incluindo construtores) têm a mesma assinatura de chamada que o objeto real.
ru: Чтобы убедиться, что фиктивные объекты в ваших тестах имеют тот же API, что и объекты, которые они заменяют, вы можете использовать :ref:`auto-speccing <auto-speccing>`. Автоспецификацию можно выполнить с помощью аргумента *autospec* команды patch или функции :func:`create_autospec`. Автоматическая спецификация создает макеты объектов, которые имеют те же атрибуты и методы, что и объекты, которые они заменяют, а любые функции и методы (включая конструкторы) имеют ту же сигнатуру вызова, что и реальный объект.

source: This ensures that your mocks will fail in the same way as your production code if they are used incorrectly:
pt_pt: Isto garante que os seus mocks falharão da mesma forma que o seu código de produção se forem usados incorretamente:
ru: Это гарантирует, что ваши макеты потерпят неудачу так же, как и ваш производственный код, если они используются неправильно:

source: :func:`create_autospec` can also be used on classes, where it copies the signature of the ``__init__`` method, and on callable objects where it copies the signature of the ``__call__`` method.
pt_pt: :func:`create_autospec` também pode ser usado em classes, onde copia a assinatura do método ``__init__``, e em objetos chamáveis onde copia a assinatura do método ``__call__``.
ru: :func:`create_autospec` также можно использовать в классах, где он копирует подпись метода ``__init__``, и на вызываемых объектах, где он копирует подпись метода ``__call__``.

source: The Mock Class
pt_pt: A Classe Mock
ru: Мок-класс

source: :class:`Mock` is a flexible mock object intended to replace the use of stubs and test doubles throughout your code. Mocks are callable and create attributes as new mocks when you access them [#]_. Accessing the same attribute will always return the same mock. Mocks record how you use them, allowing you to make assertions about what your code has done to them.
pt_pt: :class:`Mock` é um objeto mock flexível destinado a substituir o uso de stubs e dobles de teste em todo o seu código. Os mocks são chamáveis e criam atributos como novos mocks quando os acede [#]_. Aceder ao mesmo atributo sempre devolverá o mesmo mock. Os mocks registam como os usa, permitindo-lhe fazer afirmações sobre o que o seu código fez a eles.
ru: :class:`Mock` — это гибкий макетный объект, предназначенный для замены использования заглушек и тестовых двойников в вашем коде. Моки можно вызывать и создавать атрибуты как новые макеты при доступе к ним. [#]_ . Доступ к одному и тому же атрибуту всегда будет возвращать один и тот же макет. Моки записывают, как вы их используете, позволяя вам делать утверждения о том, что ваш код с ними сделал.

source: :class:`MagicMock` is a subclass of :class:`Mock` with all the magic methods pre-created and ready to use. There are also non-callable variants, useful when you are mocking out objects that aren't callable: :class:`NonCallableMock` and :class:`NonCallableMagicMock`
pt_pt: :class:`MagicMock` é uma subclasse de :class:`Mock` com todos os métodos mágicos pré-criados e prontos a usar. Também existem variantes não chamáveis, úteis quando está a simular objetos que não são chamáveis: :class:`NonCallableMock` e :class:`NonCallableMagicMock`.
ru: :class:`MagicMock` — это подкласс :class:`Mock` со всеми заранее созданными и готовыми к использованию магическими методами. Существуют также невызываемые варианты, полезные при создании макетов объектов, которые не могут быть вызваны: :class:`NonCallableMock` и :class:`NonCallableMagicMock`

source: The :func:`patch` decorators makes it easy to temporarily replace classes in a particular module with a :class:`Mock` object. By default :func:`patch` will create a :class:`MagicMock` for you. You can specify an alternative class of :class:`Mock` using the *new_callable* argument to :func:`patch`.
pt_pt: Os decoradores :func:`patch` facilitam a substituição temporária de classes num módulo específico por um objeto :class:`Mock`. Por predefinição, :func:`patch` criará um :class:`MagicMock` para si. Pode especificar uma classe alternativa de :class:`Mock` usando o argumento *new_callable* para :func:`patch`.
ru: Декораторы :func:`patch` позволяют легко временно заменить классы в конкретном модуле объектом :class:`Mock`. По умолчанию :func:`patch` создаст для вас :class:`MagicMock`. Вы можете указать альтернативный класс :class:`Mock`, используя аргумент *new_callable* для :func:`patch`.

source: Create a new :class:`Mock` object. :class:`Mock` takes several optional arguments that specify the behaviour of the Mock object:
pt_pt: Cria um novo objeto :class:`Mock`. :class:`Mock` aceita vários argumentos opcionais que especificam o comportamento do objeto Mock:
ru: Создайте новый объект :class:`Mock`. :class:`Mock` принимает несколько дополнительных аргументов, определяющих поведение объекта Mock:

source: *spec*: This can be either a list of strings or an existing object (a class or instance) that acts as the specification for the mock object. If you pass in an object then a list of strings is formed by calling dir on the object (excluding unsupported magic attributes and methods). Accessing any attribute not in this list will raise an :exc:`AttributeError`.
pt_pt: *spec*: Isto pode ser uma lista de strings ou um objeto existente (uma classe ou instância) que atua como especificação para o objeto mock. Se passar um objeto, uma lista de strings é formada chamando dir no objeto (excluindo atributos e métodos mágicos não suportados). Aceder a qualquer atributo não nesta lista lançará um :exc:`AttributeError`.
ru: *спец*: это может быть либо список строк, либо существующий объект (класс или экземпляр), который действует как спецификация для макетного объекта. Если вы передаете объект, то список строк формируется путем вызова dir для объекта (исключая неподдерживаемые магические атрибуты и методы). Доступ к любому атрибуту, не указанному в этом списке, вызовет ошибку :exc:`AttributeError`.

source: If *spec* is an object (rather than a list of strings) then :attr:`~object.__class__` returns the class of the spec object. This allows mocks to pass :func:`isinstance` tests.
pt_pt: Se *spec* for um objeto (em vez de uma lista de strings), então :attr:`~object.__class__` devolve a classe do objeto spec. Isto permite que os mocks passem nos testes :func:`isinstance`.

source: *spec_set*: A stricter variant of *spec*. If used, attempting to *set* or get an attribute on the mock that isn't on the object passed as *spec_set* will raise an :exc:`AttributeError`.
pt_pt: *spec_set*: Uma variante mais rigorosa de *spec*. Se usado, tentar *definir* ou obter um atributo no mock que não exista no objeto passado como *spec_set* lançará um :exc:`AttributeError`.
ru: *spec_set*: более строгий вариант *spec*. Если он используется, попытка *установить* или получить атрибут макета, которого нет в объекте, переданном как *spec_set*, приведет к возникновению ошибки :exc:`AttributeError`.

source: *side_effect*: A function to be called whenever the Mock is called. See the :attr:`~Mock.side_effect` attribute. Useful for raising exceptions or dynamically changing return values. The function is called with the same arguments as the mock, and unless it returns :data:`DEFAULT`, the return value of this function is used as the return value.
pt_pt: *side_effect*: Uma função a ser chamada sempre que o Mock for chamado. Veja o atributo :attr:`~Mock.side_effect`. Útil para lançar exceções ou alterar dinamicamente valores de retorno. A função é chamada com os mesmos argumentos que o mock, e a menos que retorne :data:`DEFAULT`, o valor de retorno desta função é usado como o valor de retorno.
ru: *side_effect*: функция, вызываемая при каждом вызове Mock. См. атрибут :attr:`~Mock.side_effect`. Полезно для создания исключений или динамического изменения возвращаемых значений. Функция вызывается с теми же аргументами, что и макет, и если она не возвращает :data:`DEFAULT`, в качестве возвращаемого значения используется возвращаемое значение этой функции.

source: Alternatively *side_effect* can be an exception class or instance. In this case the exception will be raised when the mock is called.
pt_pt: Alternativamente, *side_effect* pode ser uma classe de exceção ou instância. Neste caso, a exceção será lançada quando o mock for chamado.
ru: Альтернативно *side_effect* может быть классом или экземпляром исключения. В этом случае исключение будет вызвано при вызове макета.

source: If *side_effect* is an iterable then each call to the mock will return the next value from the iterable.
pt_pt: Se *side_effect* for um iterável, então cada chamada ao mock devolverá o próximo valor do iterável.
ru: Если *side_effect* является итерируемым, то каждый вызов макета будет возвращать следующее значение из итерируемого объекта.

source: A *side_effect* can be cleared by setting it to ``None``.
pt_pt: Um *side_effect* pode ser limpo definindo-o como ``None``.
ru: *side_effect* можно удалить, установив для него значение None.

source: *return_value*: The value returned when the mock is called. By default this is a new Mock (created on first access). See the :attr:`return_value` attribute.
pt_pt: *return_value*: O valor devolvido quando o mock é chamado. Por predefinição, é um novo Mock (criado no primeiro acesso). Veja o atributo :attr:`return_value`.
ru: *return_value*: значение, возвращаемое при вызове макета. По умолчанию это новый Mock (созданный при первом доступе). См. атрибут :attr:`return_value`.

source: *unsafe*: By default, accessing any attribute whose name starts with *assert*, *assret*, *asert*, *aseert* or *assrt* will raise an :exc:`AttributeError`. Passing ``unsafe=True`` will allow access to these attributes.
pt_pt: *unsafe*: Por predefinição, aceder a qualquer atributo cujo nome comece com *assert*, *assret*, *asert*, *aseert* ou *assrt* lançará um :exc:`AttributeError`. Passar ``unsafe=True`` permitirá o acesso a estes atributos.
ru: *unsafe*: по умолчанию доступ к любому атрибуту, имя которого начинается с *assert*, *assret*, *asert*, *aseert* или *assrt*, вызовет ошибку :exc:`AttributeError`. Передача unsafe=True позволит получить доступ к этим атрибутам.

source: *wraps*: Item for the mock object to wrap. If *wraps* is not ``None`` then calling the Mock will pass the call through to the wrapped object (returning the real result). Attribute access on the mock will return a Mock object that wraps the corresponding attribute of the wrapped object (so attempting to access an attribute that doesn't exist will raise an :exc:`AttributeError`).
pt_pt: *wraps*: Item para o objeto mock envolver. Se *wraps* não for ``None``, então chamar o Mock passará a chamada para o objeto envolvido (devolvendo o resultado real). O acesso a atributos no mock devolverá um objeto Mock que envolve o atributo correspondente do objeto envolvido (portanto, tentar aceder a um atributo que não exista lançará um :exc:`AttributeError`).
ru: *wraps*: элемент для обертывания фиктивного объекта. Если *wraps* не имеет значения None, то вызов Mock передаст вызов обернутому объекту (возвращая реальный результат). Доступ к атрибуту в макете вернет объект Mock, который обертывает соответствующий атрибут обернутого объекта (поэтому попытка доступа к несуществующему атрибуту вызовет ошибку :exc:`AttributeError`).

source: If the mock has an explicit *return_value* set then calls are not passed to the wrapped object and the *return_value* is returned instead.
pt_pt: Se o mock tiver um *return_value* explícito definido, então as chamadas não são passadas para o objeto envolvido e o *return_value* é devolvido em vez disso.
ru: Если в макете явно установлено *return_value*, вызовы не передаются в обернутый объект, а вместо этого возвращается *return_value*.

source: *name*: If the mock has a name then it will be used in the repr of the mock. This can be useful for debugging. The name is propagated to child mocks.
pt_pt: *name*: Se o mock tiver um nome, então ele será usado na representação do mock. Isto pode ser útil para depuração. O nome é propagado para os mocks filhos.
ru: *имя*: если у макета есть имя, оно будет использоваться при его воспроизведении. Это может быть полезно для отладки. Имя распространяется на детские насмешки.
