Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: Using :func:`open` as a context manager is a great way to ensure your file handles are closed properly and is becoming common::
pt_pt: Usar :func:`open` como um gestor de contexto é uma ótima maneira de garantir que os seus manipuladores de ficheiros são fechados corretamente e está a tornar-se comum::
ru: Использование :func:`open` в качестве менеджера контекста — отличный способ обеспечить правильное закрытие дескрипторов файлов, и это становится обычным явлением:

source: with open('/some/path', 'w') as f: f.write('something')
pt_pt: with open('/algum/caminho', 'w') as f: f.write('algo')

source: The issue is that even if you mock out the call to :func:`open` it is the *returned object* that is used as a context manager (and has :meth:`~object.__enter__` and :meth:`~object.__exit__` called).
pt_pt: O problema é que, mesmo que simule a chamada a :func:`open`, é o *objeto devolvido* que é usado como um gestor de contexto (e tem :meth:`~object.__enter__` e :meth:`~object.__exit__` chamados).
ru: Проблема в том, что даже если вы имитируете вызов :func:`open`, это *возвращенный объект*, который используется в качестве контекстного менеджера (и имеет :meth:`~object.__enter__` и :meth:`~ вызывается object.__exit__`).

source: Mocking context managers with a :class:`MagicMock` is common enough and fiddly enough that a helper function is useful. ::
pt_pt: Simular gestores de contexto com um :class:`MagicMock` é suficientemente comum e complicado para que uma função auxiliar seja útil. ::
ru: Имитация менеджеров контекста с помощью :class:`MagicMock` достаточно распространена и достаточно сложна, поэтому вспомогательная функция может оказаться полезной. ::

source: >>> m = mock_open() >>> with patch('__main__.open', m): ... with open('foo', 'w') as h: ... h.write('some stuff') ... >>> m.mock_calls [call('foo', 'w'), call().__enter__(), call().write('some stuff'), call().__exit__(None, None, None)] >>> m.assert_called_once_with('foo', 'w') >>> handle = m() >>> handle.write.assert_called_once_with('some stuff')
pt_pt: >>> m = mock_open() >>> with patch('__main__.open', m): ... with open('foo', 'w') as h: ... h.write('alguma coisa') ... >>> m.mock_calls [call('foo', 'w'), call().__enter__(), call().write('alguma coisa'), call().__exit__(None, None, None)] >>> m.assert_called_once_with('foo', 'w') >>> handle = m() >>> handle.write.assert_called_once_with('alguma coisa')

source: And for reading files::
pt_pt: E para ler ficheiros::
ru: И для чтения файлов::

source: >>> with patch('__main__.open', mock_open(read_data='bibble')) as m: ... with open('foo') as h: ... result = h.read() ... >>> m.assert_called_once_with('foo') >>> assert result == 'bibble'
pt_pt: >>> with patch('__main__.open', mock_open(read_data='bibble')) as m: ... with open('foo') as h: ... resultado = h.read() ... >>> m.assert_called_once_with('foo') >>> assert resultado == 'bibble'

source: Autospeccing is based on the existing :attr:`!spec` feature of mock. It limits the api of mocks to the api of an original object (the spec), but it is recursive (implemented lazily) so that attributes of mocks only have the same api as the attributes of the spec. In addition mocked functions / methods have the same call signature as the original so they raise a :exc:`TypeError` if they are called incorrectly.
pt_pt: Autospeccing é baseado na funcionalidade existente :attr:`!spec` do mock. Limita a API dos mocks à API de um objeto original (o spec), mas é recursivo (implementado de forma preguiçosa) de modo que os atributos dos mocks têm apenas a mesma API que os atributos do spec. Além disso, funções/métodos simulados têm a mesma assinatura de chamada que o original, por isso lançam um :exc:`TypeError` se forem chamados incorretamente.

source: Before I explain how auto-speccing works, here's why it is needed.
pt_pt: Antes de explicar como o autospeccing funciona, aqui está o porquê de ser necessário.
ru: Прежде чем я объясню, как работает автоопределение, расскажу, почему оно необходимо.

source: :class:`Mock` is a very powerful and flexible object, but it suffers from a flaw which is general to mocking. If you refactor some of your code, rename members and so on, any tests for code that is still using the *old api* but uses mocks instead of the real objects will still pass. This means your tests can all pass even though your code is broken.
pt_pt: :class:`Mock` é um objeto muito poderoso e flexível, mas sofre de uma falha que é geral na simulação. Se refatorar algum do seu código, renomear membros, etc., quaisquer testes para código que ainda esteja a usar a *API antiga*, mas que use mocks em vez dos objetos reais, ainda passarão. Isto significa que os seus testes podem todos passar mesmo que o seu código esteja quebrado.

source: Before 3.5, tests with a typo in the word assert would silently pass when they should raise an error. You can still achieve this behavior by passing ``unsafe=True`` to Mock.
pt_pt: Antes da versão 3.5, testes com um erro ortográfico na palavra assert passavam silenciosamente quando deviam lançar um erro. Ainda pode obter este comportamento passando ``unsafe=True`` para Mock.

source: Note that this is another reason why you need integration tests as well as unit tests. Testing everything in isolation is all fine and dandy, but if you don't test how your units are "wired together" there is still lots of room for bugs that tests might have caught.
pt_pt: Note que esta é outra razão pela qual precisa de testes de integração, bem como de testes unitários. Testar tudo isoladamente é bom, mas se não testar como as suas unidades estão "ligadas" ainda há muito espaço para bugs que os testes poderiam ter apanhado.
ru: Обратите внимание, что это еще одна причина, по которой вам нужны интеграционные тесты, а также модульные тесты. Тестировать все по отдельности — это прекрасно, но если вы не проверяете, как ваши устройства «соединены вместе», остается много места для ошибок, которые могли быть обнаружены тестами.

source: :mod:`unittest.mock` already provides a feature to help with this, called speccing. If you use a class or instance as the :attr:`!spec` for a mock then you can only access attributes on the mock that exist on the real class:
pt_pt: :mod:`unittest.mock` já fornece uma funcionalidade para ajudar com isto, chamada speccing. Se usar uma classe ou instância como o :attr:`!spec` para um mock, então só pode aceder a atributos no mock que existam na classe real:

source: The spec only applies to the mock itself, so we still have the same issue with any methods on the mock:
pt_pt: O spec aplica-se apenas ao mock em si, por isso ainda temos o mesmo problema com quaisquer métodos no mock:
ru: Спецификация применима только к самому макету, поэтому у нас все еще есть та же проблема с любыми методами макета:

source: Auto-speccing solves this problem. You can either pass ``autospec=True`` to :func:`patch` / :func:`patch.object` or use the :func:`create_autospec` function to create a mock with a spec. If you use the ``autospec=True`` argument to :func:`patch` then the object that is being replaced will be used as the spec object. Because the speccing is done "lazily" (the spec is created as attributes on the mock are accessed) you can use it with very complex or deeply nested objects (like modules that import modules that import modules) without a big performance hit.
pt_pt: O autospeccing resolve este problema. Pode passar ``autospec=True`` para :func:`patch` / :func:`patch.object` ou usar a função :func:`create_autospec` para criar um mock com um spec. Se usar o argumento ``autospec=True`` para :func:`patch`, então o objeto que está a ser substituído será usado como o objeto spec. Como o speccing é feito "de forma preguiçosa" (o spec é criado à medida que os atributos no mock são acedidos), pode usá-lo com objetos muito complexos ou profundamente aninhados (como módulos que importam módulos que importam módulos) sem um grande impacto no desempenho.
ru: Автоопределение решает эту проблему. Вы можете либо передать ``autospec=True`` в :func:`patch` / :func:`patch.object`, либо использовать функцию :func:`create_autospec` для создания макета со спецификацией. Если вы используете аргумент ``autospec=True`` для :func:`patch`, то заменяемый объект будет использоваться как объект спецификации. Поскольку спецификация выполняется «лениво» (спецификация создается при доступе к атрибутам макета), вы можете использовать ее с очень сложными или глубоко вложенными объектами (например, с модулями, которые импортируют модули, которые импортируют модули) без большого снижения производительности.

source: Here's an example of it in use::
pt_pt: Aqui está um exemplo do seu uso::
ru: Вот пример его использования::

source: You can see that :class:`!request.Request` has a spec. :class:`!request.Request` takes two arguments in the constructor (one of which is *self*). Here's what happens if we try to call it incorrectly::
pt_pt: Pode ver que :class:`!request.Request` tem um spec. :class:`!request.Request` recebe dois argumentos no construtor (um dos quais é *self*). Aqui está o que acontece se tentarmos chamá-lo incorretamente::

source: >>> req = request.Request() Traceback (most recent call last): ... TypeError: <lambda>() takes at least 2 arguments (1 given)
pt_pt: >>> req = request.Request() Traceback (most recent call last): ... TypeError: <lambda>() recebe pelo menos 2 argumentos (1 dado)

source: The spec also applies to instantiated classes (i.e. the return value of specced mocks)::
pt_pt: O spec também se aplica a classes instanciadas (ou seja, o valor de retorno de mocks com spec)::
ru: Спецификация также применима к созданным классам (т.е. возвращаемому значению указанных макетов)::

source: :class:`!Request` objects are not callable, so the return value of instantiating our mocked out :class:`!request.Request` is a non-callable mock. With the spec in place any typos in our asserts will raise the correct error::
pt_pt: Os objetos :class:`!Request` não são chamáveis, por isso o valor de retorno da instanciação do nosso :class:`!request.Request` simulado é um mock não chamável. Com o spec no lugar, quaisquer erros ortográficos nas nossas afirmações lançarão o erro correto::

source: >>> req.add_header('spam', 'eggs') <MagicMock name='request.Request().add_header()' id='...'> >>> req.add_header.assret_called_with # Intentional typo! Traceback (most recent call last): ... AttributeError: Mock object has no attribute 'assret_called_with' >>> req.add_header.assert_called_with('spam', 'eggs')
pt_pt: >>> req.add_header('spam', 'ovos') <MagicMock name='request.Request().add_header()' id='...'> >>> req.add_header.assret_chamado_com # Erro ortográfico intencional! Traceback (most recent call last): ... AttributeError: O objeto Mock não tem o atributo 'assret_chamado_com' >>> req.add_header.assert_called_with('spam', 'ovos')

source: In many cases you will just be able to add ``autospec=True`` to your existing :func:`patch` calls and then be protected against bugs due to typos and api changes.
pt_pt: Em muitos casos, poderá simplesmente adicionar ``autospec=True`` às suas chamadas existentes de :func:`patch` e, em seguida, estará protegido contra bugs devido a erros ortográficos e alterações na API.
ru: Во многих случаях вы сможете просто добавить autospec=True к существующим вызовам :func:`patch` и затем быть защищены от ошибок из-за опечаток и изменений API.

source: As well as using *autospec* through :func:`patch` there is a :func:`create_autospec` for creating autospecced mocks directly:
pt_pt: Além de usar *autospec* através de :func:`patch`, existe um :func:`create_autospec` para criar mocks com autospeccing diretamente:
ru: Помимо использования *autospec* через :func:`patch`, существует :func:`create_autospec` для непосредственного создания автоспецифицированных макетов:

source: This isn't without caveats and limitations however, which is why it is not the default behaviour. In order to know what attributes are available on the spec object, autospec has to introspect (access attributes) the spec. As you traverse attributes on the mock a corresponding traversal of the original object is happening under the hood. If any of your specced objects have properties or descriptors that can trigger code execution then you may not be able to use autospec. On the other hand it is much better to design your objects so that introspection is safe [#]_.
pt_pt: Isto não está isento de advertências e limitações, no entanto, o que explica por que não é o comportamento predefinido. Para saber quais atributos estão disponíveis no objeto spec, o autospeccing tem de introspecionar (aceder a atributos) o spec. À medida que percorre atributos no mock, uma travessia correspondente do objeto original está a acontecer por baixo. Se algum dos seus objetos com spec tiver propriedades ou descritores que possam desencadear a execução de código, pode não ser capaz de usar autospeccing. Por outro lado, é muito melhor projetar os seus objetos de forma a que a introspeção seja segura [#]_.
ru: Однако здесь есть оговорки и ограничения, поэтому это не поведение по умолчанию. Чтобы узнать, какие атрибуты доступны в объекте спецификации, autospec должен проанализировать (получить доступ к атрибутам) спецификацию. Когда вы перемещаетесь по атрибутам в макете, под капотом происходит соответствующий обход исходного объекта. Если какой-либо из ваших указанных объектов имеет свойства или дескрипторы, которые могут инициировать выполнение кода, возможно, вы не сможете использовать автоспецификацию. С другой стороны, гораздо лучше проектировать объекты так, чтобы самоанализ был безопасен. [#]_ .

source: A more serious problem is that it is common for instance attributes to be created in the :meth:`~object.__init__` method and not to exist on the class at all. *autospec* can't know about any dynamically created attributes and restricts the api to visible attributes. ::
pt_pt: Um problema mais sério é que é comum que atributos de instância sejam criados no método :meth:`~object.__init__` e não existam na classe. *autospec* não pode saber sobre quaisquer atributos criados dinamicamente e restringe a API a atributos visíveis. ::
ru: Более серьезная проблема заключается в том, что атрибуты экземпляра обычно создаются в методе :meth:`~object.__init__` и вообще не существуют в классе. *autospec* не может знать ни о каких динамически создаваемых атрибутах и ​​ограничивает API видимыми атрибутами. ::

source: >>> class Something: ... def __init__(self): ... self.a = 33 ... >>> with patch('__main__.Something', autospec=True): ... thing = Something() ... thing.a ... Traceback (most recent call last): ... AttributeError: Mock object has no attribute 'a'
pt_pt: >>> class Algo: ... def __init__(self): ... self.a = 33 ... >>> with patch('__main__.Algo', autospec=True): ... coisa = Algo() ... coisa.a ... Traceback (most recent call last): ... AttributeError: O objeto Mock não tem o atributo 'a'

source: There are a few different ways of resolving this problem. The easiest, but not necessarily the least annoying, way is to simply set the required attributes on the mock after creation. Just because *autospec* doesn't allow you to fetch attributes that don't exist on the spec it doesn't prevent you setting them::
pt_pt: Existem algumas formas diferentes de resolver este problema. A mais fácil, mas não necessariamente a menos irritante, é simplesmente definir os atributos necessários no mock após a criação. Só porque *autospeccing* não permite obter atributos que não existam no spec, não o impede de os definir::
ru: Есть несколько различных способов решения этой проблемы. Самый простой, но не обязательно наименее раздражающий способ — просто установить необходимые атрибуты макета после создания. Тот факт, что *autospec* не позволяет вам получать атрибуты, которых нет в спецификации, не мешает вам их устанавливать::

source: There is a more aggressive version of both *spec* and *autospec* that *does* prevent you setting non-existent attributes. This is useful if you want to ensure your code only *sets* valid attributes too, but obviously it prevents this particular scenario:
pt_pt: Existe uma versão mais agressiva de *spec* e *autospec* que *impedem* a definição de atributos não existentes. Isto é útil se quiser garantir que o seu código apenas *define* atributos válidos, mas obviamente impede este cenário específico:
ru: Существует более агрессивная версия *spec* и *autospec*, которая *не* предотвращает установку несуществующих атрибутов. Это полезно, если вы хотите, чтобы ваш код также *устанавливал* действительные атрибуты, но, очевидно, это предотвращает этот конкретный сценарий:

source: Probably the best way of solving the problem is to add class attributes as default values for instance members initialised in :meth:`~object.__init__`. Note that if you are only setting default attributes in :meth:`!__init__` then providing them via class attributes (shared between instances of course) is faster too. e.g.
pt_pt: Provavelmente, a melhor forma de resolver o problema é adicionar atributos de classe como valores predefinidos para membros de instância inicializados em :meth:`~object.__init__`. Note que, se estiver apenas a definir atributos predefinidos em :meth:`!__init__`, fornecê-los através de atributos de classe (partilhados entre instâncias, claro) também é mais rápido. Por exemplo:
ru: Вероятно, лучший способ решить проблему — добавить атрибуты класса в качестве значений по умолчанию для членов экземпляра, инициализированных в :meth:`~object.__init__`. Обратите внимание: если вы устанавливаете только атрибуты по умолчанию в :meth:`!__init__`, то предоставление их через атрибуты класса (конечно, общие для всех экземпляров) также происходит быстрее. например

source: class Something: a = 33
pt_pt: class Algo: a = 33

source: This brings up another issue. It is relatively common to provide a default value of ``None`` for members that will later be an object of a different type. ``None`` would be useless as a spec because it wouldn't let you access *any* attributes or methods on it. As ``None`` is *never* going to be useful as a spec, and probably indicates a member that will normally of some other type, autospec doesn't use a spec for members that are set to ``None``. These will just be ordinary mocks (well - MagicMocks):
pt_pt: Isto levanta outra questão. É relativamente comum fornecer um valor predefinido de ``None`` para membros que mais tarde serão um objeto de um tipo diferente. ``None`` seria inútil como um spec porque não permitiria aceder a *nenhum* atributo ou método. Como ``None`` *nunca* será útil como um spec e provavelmente indica um membro que normalmente será de outro tipo, autospec não usa um spec para membros definidos como ``None``. Estes serão apenas mocks normais (bem, MagicMocks):
ru: Это поднимает еще одну проблему. Относительно распространено предоставление значения по умолчанию «Нет» для членов, которые позже станут объектами другого типа. ``None`` был бы бесполезен в качестве спецификации, потому что он не позволял бы вам получить доступ к *любым* атрибутам или методам. Поскольку ``None`` *никогда* не будет полезен в качестве спецификации и, вероятно, указывает на элемент, который обычно имеет какой-то другой тип, autospec не использует спецификацию для членов, для которых установлено значение ``None``. Это будут просто обычные моки (ну — MagicMocks):

source: If modifying your production classes to add defaults isn't to your liking then there are more options. One of these is simply to use an instance as the spec rather than the class. The other is to create a subclass of the production class and add the defaults to the subclass without affecting the production class. Both of these require you to use an alternative object as the spec. Thankfully :func:`patch` supports this - you can simply pass the alternative object as the *autospec* argument::
pt_pt: Se modificar as suas classes de produção para adicionar valores predefinidos não for do seu agrado, então existem mais opções. Uma delas é simplesmente usar uma instância como o spec em vez da classe. A outra é criar uma subclasse da classe de produção e adicionar os valores predefinidos à subclasse sem afetar a classe de produção. Ambas as opções exigem que use um objeto alternativo como o spec. Felizmente, :func:`patch` suporta isto - pode simplesmente passar o objeto alternativo como o argumento *autospec*::
ru: Если вам не нравится изменение ваших производственных классов для добавления значений по умолчанию, есть больше вариантов. Один из них — просто использовать экземпляр в качестве спецификации, а не класса. Другой вариант — создать подкласс производственного класса и добавить в него значения по умолчанию, не затрагивая производственный класс. Оба из них требуют использования альтернативного объекта в качестве спецификации. К счастью, :func:`patch` поддерживает это - вы можете просто передать альтернативный объект в качестве аргумента *autospec*::

source: >>> class Something: ... def __init__(self): ... self.a = 33 ... >>> class SomethingForTest(Something): ... a = 33 ... >>> p = patch('__main__.Something', autospec=SomethingForTest) >>> mock = p.start() >>> mock.a <NonCallableMagicMock name='Something.a' spec='int' id='...'>
pt_pt: >>> class Algo: ... def __init__(self): ... self.a = 33 ... >>> class AlgoParaTeste(Algo): ... a = 33 ... >>> p = patch('__main__.Algo', autospec=AlgoParaTeste) >>> mock = p.start() >>> mock.a <NonCallableMagicMock name='Algo.a' spec='int' id='...'>

source: This only applies to classes or already instantiated objects. Calling a mocked class to create a mock instance *does not* create a real instance. It is only attribute lookups - along with calls to :func:`dir` - that are done.
pt_pt: Isto aplica-se apenas a classes ou objetos já instanciados. Chamar uma classe simulada para criar uma instância mock *não* cria uma instância real. Apenas são feitas pesquisas de atributos - juntamente com chamadas a :func:`dir`.
ru: Это применимо только к классам или уже созданным объектам. Вызов фиктивного класса для создания фиктивного экземпляра *не* создает реальный экземпляр. Выполняется только поиск атрибутов вместе с вызовами :func:`dir`.

source: Sealing mocks
pt_pt: Selar mocks
ru: Уплотнительные макеты

source: Seal will disable the automatic creation of mocks when accessing an attribute of the mock being sealed or any of its attributes that are already mocks recursively.
pt_pt: Seal desativará a criação automática de mocks ao aceder a um atributo do mock que está a ser selado ou a qualquer dos seus atributos que já sejam mocks de forma recursiva.
ru: Seal отключит автоматическое создание макетов при доступе к атрибуту запечатываемого макета или к любому из его атрибутов, которые уже являются макетами рекурсивно.

source: If a mock instance with a name or a spec is assigned to an attribute it won't be considered in the sealing chain. This allows one to prevent seal from fixing part of the mock object. ::
pt_pt: Se uma instância mock com um nome ou um spec for atribuída a um atributo, não será considerada na cadeia de selagem. Isto permite evitar que a selagem afete parte do objeto mock. ::
ru: Если атрибуту присвоен фиктивный экземпляр с именем или спецификацией, он не будет учитываться в цепочке запечатывания. Это позволяет предотвратить фиксацию пломбой части макета объекта. ::
