Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: The return value and side effect of child mocks can be set in the same way, using dotted notation. As you can't use dotted names directly in a call you have to create a dictionary and unpack it using ``**``:
pt_pt: O valor de retorno e o efeito secundário de mocks filhos podem ser definidos da mesma forma, usando notação com pontos. Como não pode usar nomes com pontos diretamente numa chamada, tem de criar um dicionário e desempacotá-lo usando ``**``:
ru: Возвращаемое значение и побочный эффект дочерних макетов можно задать таким же образом, используя точечную запись. Поскольку вы не можете использовать имена с точками непосредственно в вызове, вам придется создать словарь и распаковать его с помощью ``**``:

source: A callable mock which was created with a *spec* (or a *spec_set*) will introspect the specification object's signature when matching calls to the mock. Therefore, it can match the actual call's arguments regardless of whether they were passed positionally or by name::
pt_pt: Um mock chamável que foi criado com um *spec* (ou um *spec_set*) irá introspecionar a assinatura do objeto de especificação ao corresponder chamadas para o mock. Portanto, pode corresponder aos argumentos da chamada real independentemente de terem sido passados posicionalmente ou por nome::
ru: Вызываемый макет, созданный с помощью *spec* (или *spec_set*), будет анализировать сигнатуру объекта спецификации при сопоставлении вызовов с макетом. Следовательно, он может соответствовать фактическим аргументам вызова независимо от того, были ли они переданы позиционно или по имени::

source: This applies to :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_called_once_with`, :meth:`~Mock.assert_has_calls` and :meth:`~Mock.assert_any_call`. When :ref:`auto-speccing`, it will also apply to method calls on the mock object.
pt_pt: Isto aplica-se a :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_called_once_with`, :meth:`~Mock.assert_has_calls` e :meth:`~Mock.assert_any_call`. Quando :ref:`auto-speccing`, também se aplicará a chamadas de métodos no objeto mock.
ru: Это относится к :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_known_once_with`, :meth:`~Mock.assert_has_calls` и :meth:`~Mock.assert_any_call`. При использовании :ref:`auto-speccing` оно также будет применяться к вызовам методов фиктивного объекта.

source: Added signature introspection on specced and autospecced mock objects.
pt_pt: Adicionada introspeção de assinatura em objetos mock com spec e autospecced.
ru: Добавлен самоанализ сигнатур для заданных и автоматически заданных макетов объектов.

source: A mock intended to be used as a :class:`property`, or other :term:`descriptor`, on a class. :class:`PropertyMock` provides :meth:`~object.__get__` and :meth:`~object.__set__` methods so you can specify a return value when it is fetched.
pt_pt: Um mock destinado a ser usado como uma :class:`property`, ou outro :term:`descritor`, numa classe. :class:`PropertyMock` fornece métodos :meth:`~object.__get__` e :meth:`~object.__set__` para que possa especificar um valor de retorno quando é obtido.
ru: Макет, предназначенный для использования в качестве свойства :class:`или другого :term:`дескриптора` в классе. :class:`PropertyMock` предоставляет методы :meth:`~object.__get__` и :meth:`~object.__set__`, чтобы вы могли указать возвращаемое значение при его получении.

source: Fetching a :class:`PropertyMock` instance from an object calls the mock, with no args. Setting it calls the mock with the value being set. ::
pt_pt: Obter uma instância :class:`PropertyMock` de um objeto chama o mock, sem argumentos. Defini-la chama o mock com o valor a ser definido. ::
ru: Получение экземпляра :class:`PropertyMock` из объекта вызывает макет без аргументов. Установка этого параметра вызывает макет с установленным значением. ::

source: >>> class Foo: ... @property ... def foo(self): ... return 'something' ... @foo.setter ... def foo(self, value): ... pass ... >>> with patch('__main__.Foo.foo', new_callable=PropertyMock) as mock_foo: ... mock_foo.return_value = 'mockity-mock' ... this_foo = Foo() ... print(this_foo.foo) ... this_foo.foo = 6 ... mockity-mock >>> mock_foo.mock_calls [call(), call(6)]
pt_pt: >>> class Foo: ... @property ... def foo(self): ... return 'algo' ... @foo.setter ... def foo(self, value): ... pass ... >>> with patch('__main__.Foo.foo', new_callable=PropertyMock) as mock_foo: ... mock_foo.return_value = 'mockity-mock' ... this_foo = Foo() ... print(this_foo.foo) ... this_foo.foo = 6 ... mockity-mock >>> mock_foo.mock_calls [call(), call(6)]

source: Because of the way mock attributes are stored you can't directly attach a :class:`PropertyMock` to a mock object. Instead you can attach it to the mock type object::
pt_pt: Devido à forma como os atributos mock são armazenados, não pode anexar diretamente um :class:`PropertyMock` a um objeto mock. Em vez disso, pode anexá-lo ao objeto tipo mock::
ru: Из-за способа хранения фиктивных атрибутов вы не можете напрямую прикрепить :class:`PropertyMock` к фиктивному объекту. Вместо этого вы можете прикрепить его к объекту фиктивного типа::

source: If an :exc:`AttributeError` is raised by :class:`PropertyMock`, it will be interpreted as a missing descriptor and :meth:`~object.__getattr__` will be called on the parent mock::
pt_pt: Se um :exc:`AttributeError` for lançado por :class:`PropertyMock`, será interpretado como um descritor em falta e :meth:`~object.__getattr__` será chamado no mock pai::

source: See :meth:`~object.__getattr__` for details.
pt_pt: Veja :meth:`~object.__getattr__` para mais detalhes.

source: An asynchronous version of :class:`MagicMock`. The :class:`AsyncMock` object will behave so the object is recognized as an async function, and the result of a call is an awaitable.
pt_pt: Uma versão assíncrona de :class:`MagicMock`. O objeto :class:`AsyncMock` comportar-se-á de forma a que o objeto seja reconhecido como uma função assíncrona, e o resultado de uma chamada é um objeto aguardável.
ru: Асинхронная версия :class:`MagicMock`. Объект :class:`AsyncMock` будет вести себя так, что объект распознается как асинхронная функция, а результат вызова является ожидаемым.

source: The result of ``mock()`` is an async function which will have the outcome of ``side_effect`` or ``return_value`` after it has been awaited:
pt_pt: O resultado de ``mock()`` é uma função assíncrona que terá o resultado de ``side_effect`` ou ``return_value`` depois de aguardada:
ru: Результатом ``mock()`` является асинхронная функция, которая будет иметь результат ``side_effect`` или ``return_value`` после ее ожидания:

source: if ``side_effect`` is a function, the async function will return the result of that function,
pt_pt: se ``side_effect`` for uma função, a função assíncrona devolverá o resultado dessa função,
ru: если ``side_effect`` является функцией, асинхронная функция вернет результат этой функции,

source: if ``side_effect`` is an exception, the async function will raise the exception,
pt_pt: se ``side_effect`` for uma exceção, a função assíncrona lançará a exceção,
ru: если ``side_effect`` является исключением, асинхронная функция вызовет исключение,

source: if ``side_effect`` is an iterable, the async function will return the next value of the iterable, however, if the sequence of result is exhausted, ``StopAsyncIteration`` is raised immediately,
pt_pt: se ``side_effect`` for um iterável, a função assíncrona devolverá o próximo valor do iterável, no entanto, se a sequência de resultados estiver esgotada, ``StopAsyncIteration`` é lançado imediatamente,
ru: если ``side_effect`` является итерируемым, асинхронная функция вернет следующее значение итерируемого объекта, однако, если последовательность результатов исчерпана, ``StopAsyncIteration`` вызывается немедленно,

source: if ``side_effect`` is not defined, the async function will return the value defined by ``return_value``, hence, by default, the async function returns a new :class:`AsyncMock` object.
pt_pt: se ``side_effect`` não estiver definido, a função assíncrona devolverá o valor definido por ``return_value``, portanto, por predefinição, a função assíncrona devolve um novo objeto :class:`AsyncMock`.
ru: если ``side_effect`` не определен, функция async вернет значение, определенное ``return_value``, следовательно, по умолчанию функция async возвращает новый объект :class:`AsyncMock``.

source: Setting the *spec* of a :class:`Mock` or :class:`MagicMock` to an async function will result in a coroutine object being returned after calling.
pt_pt: Definir o *spec* de um :class:`Mock` ou :class:`MagicMock` para uma função assíncrona resultará num objeto corrotina a ser devolvido após a chamada.
ru: Установка *spec* :class:`Mock` или :class:`MagicMock` для асинхронной функции приведет к возврату объекта сопрограммы после вызова.

source: Setting the *spec* of a :class:`Mock`, :class:`MagicMock`, or :class:`AsyncMock` to a class with asynchronous and synchronous functions will automatically detect the synchronous functions and set them as :class:`MagicMock` (if the parent mock is :class:`AsyncMock` or :class:`MagicMock`) or :class:`Mock` (if the parent mock is :class:`Mock`). All asynchronous functions will be :class:`AsyncMock`.
pt_pt: Definir o *spec* de um :class:`Mock`, :class:`MagicMock` ou :class:`AsyncMock` para uma classe com funções assíncronas e síncronas detetará automaticamente as funções síncronas e definirá-as como :class:`MagicMock` (se o mock pai for :class:`AsyncMock` ou :class:`MagicMock`) ou :class:`Mock` (se o mock pai for :class:`Mock`). Todas as funções assíncronas serão :class:`AsyncMock`.
ru: Установка *spec* :class:`Mock`, :class:`MagicMock` или :class:`AsyncMock` для класса с асинхронными и синхронными функциями автоматически обнаружит синхронные функции и установит их как :class:` MagicMock` (если родительским макетом является :class:`AsyncMock` или :class:`MagicMock`) или :class:`Mock` (если родительским макетом является :class:`Mock`). Все асинхронные функции будут :class:`AsyncMock`.

source: Assert that the mock was awaited at least once. Note that this is separate from the object having been called, the ``await`` keyword must be used:
pt_pt: Afirma que o mock foi aguardado pelo menos uma vez. Note que isto é separado do objeto ter sido chamado, a palavra-chave ``await`` deve ser usada:
ru: Утвердите, что макет ожидался хотя бы один раз. Обратите внимание, что это отдельно от вызываемого объекта, необходимо использовать ключевое слово await:

source: Assert that the mock was awaited exactly once.
pt_pt: Afirma que o mock foi aguardado exatamente uma vez.
ru: Утвердите, что макет ожидался ровно один раз.

source: Assert that the last await was with the specified arguments.
pt_pt: Afirma que a última espera foi com os argumentos especificados.
ru: Утвердите, что последнее ожидание было с указанными аргументами.

source: Assert that the mock was awaited exactly once and with the specified arguments.
pt_pt: Afirma que o mock foi aguardado exatamente uma vez e com os argumentos especificados.
ru: Утвердите, что макет ожидался ровно один раз и с указанными аргументами.

source: Assert the mock has ever been awaited with the specified arguments.
pt_pt: Afirma que o mock já foi aguardado com os argumentos especificados.
ru: Утвердите, что макет когда-либо ожидался с указанными аргументами.

source: Assert the mock has been awaited with the specified calls. The :attr:`await_args_list` list is checked for the awaits.
pt_pt: Afirma que o mock foi aguardado com as chamadas especificadas. A lista :attr:`await_args_list` é verificada para as esperas.
ru: Утвердите, что макет ожидался с указанными вызовами. Список :attr:`await_args_list` проверяется на наличие ожиданий.

source: If *any_order* is false then the awaits must be sequential. There can be extra calls before or after the specified awaits.
pt_pt: Se *any_order* for falso, então as esperas devem ser sequenciais. Pode haver chamadas extra antes ou depois das esperas especificadas.
ru: Если *any_order* имеет значение false, то ожидания должны быть последовательными. До или после указанного ожидания могут быть дополнительные вызовы.

source: If *any_order* is true then the awaits can be in any order, but they must all appear in :attr:`await_args_list`.
pt_pt: Se *any_order* for verdadeiro, então as esperas podem estar em qualquer ordem, mas devem todas aparecer em :attr:`await_args_list`.
ru: Если *any_order* имеет значение true, то ожидания могут быть в любом порядке, но все они должны присутствовать в :attr:`await_args_list`.

source: Assert that the mock was never awaited.
pt_pt: Afirma que o mock nunca foi aguardado.
ru: Утверждайте, что макета никогда не ждали.

source: See :func:`Mock.reset_mock`. Also sets :attr:`await_count` to 0, :attr:`await_args` to None, and clears the :attr:`await_args_list`.
pt_pt: Veja :func:`Mock.reset_mock`. Também define :attr:`await_count` para 0, :attr:`await_args` para None e limpa :attr:`await_args_list`.
ru: См. :func:`Mock.reset_mock`. Также устанавливает для :attr:`await_count` значение 0, для :attr:`await_args` значение None и очищает :attr:`await_args_list`.

source: An integer keeping track of how many times the mock object has been awaited.
pt_pt: Um inteiro que regista quantas vezes o objeto mock foi aguardado.
ru: Целое число, отслеживающее, сколько раз ожидался фиктивный объект.

source: This is either ``None`` (if the mock hasn’t been awaited), or the arguments that the mock was last awaited with. Functions the same as :attr:`Mock.call_args`.
pt_pt: Isto é ``None`` (se o mock não foi aguardado), ou os argumentos com que o mock foi aguardado pela última vez. Funciona da mesma forma que :attr:`Mock.call_args`.
ru: Это либо «Нет» (если макет не ожидался), либо аргументы, с которыми макет ожидался в последний раз. Функционирует так же, как :attr:`Mock.call_args`.

source: This is a list of all the awaits made to the mock object in sequence (so the length of the list is the number of times it has been awaited). Before any awaits have been made it is an empty list.
pt_pt: Esta é uma lista de todas as esperas feitas ao objeto mock em sequência (por isso o comprimento da lista é o número de vezes que foi aguardado). Antes de quaisquer esperas terem sido feitas, é uma lista vazia.
ru: Это список всех ожиданий, выполненных в последовательности для фиктивного объекта (поэтому длина списка равна количеству раз, когда он ожидался). До того, как были сделаны какие-либо ожидания, это пустой список.

source: Calling
pt_pt: Chamada
ru: Вызов

source: Mock objects are callable. The call will return the value set as the :attr:`~Mock.return_value` attribute. The default return value is a new Mock object; it is created the first time the return value is accessed (either explicitly or by calling the Mock) - but it is stored and the same one returned each time.
pt_pt: Os objetos Mock são chamáveis. A chamada devolverá o valor definido como o atributo :attr:`~Mock.return_value`. O valor de retorno predefinido é um novo objeto Mock; é criado na primeira vez que o valor de retorno é acedido (seja explicitamente ou chamando o Mock) - mas é armazenado e o mesmo é devolvido cada vez.
ru: Мок-объекты являются вызываемыми. Вызов вернет значение, установленное в качестве атрибута :attr:`~Mock.return_value`. Возвращаемое значение по умолчанию — новый Mock-объект; он создается при первом доступе к возвращаемому значению (либо явно, либо путем вызова Mock), но он сохраняется и каждый раз возвращается одно и то же.

source: Calls made to the object will be recorded in the attributes like :attr:`~Mock.call_args` and :attr:`~Mock.call_args_list`.
pt_pt: As chamadas feitas ao objeto serão registadas nos atributos como :attr:`~Mock.call_args` e :attr:`~Mock.call_args_list`.
ru: Вызовы объекта будут записаны в таких атрибутах, как :attr:`~Mock.call_args` и :attr:`~Mock.call_args_list`.

source: If :attr:`~Mock.side_effect` is set then it will be called after the call has been recorded, so if :attr:`!side_effect` raises an exception the call is still recorded.
pt_pt: Se :attr:`~Mock.side_effect` estiver definido, será chamado após a chamada ter sido registada, por isso, se :attr:`!side_effect` lançar uma exceção, a chamada ainda é registada.

source: The simplest way to make a mock raise an exception when called is to make :attr:`~Mock.side_effect` an exception class or instance:
pt_pt: A forma mais simples de fazer com que um mock lance uma exceção quando chamado é tornar :attr:`~Mock.side_effect` uma classe de exceção ou instância:
ru: Самый простой способ заставить макет вызывать исключение при вызове — это сделать :attr:`~Mock.side_effect` классом или экземпляром исключения:

source: If :attr:`~Mock.side_effect` is a function then whatever that function returns is what calls to the mock return. The :attr:`!side_effect` function is called with the same arguments as the mock. This allows you to vary the return value of the call dynamically, based on the input:
pt_pt: Se :attr:`~Mock.side_effect` for uma função, então o que essa função devolver será o que as chamadas ao mock devolvem. A função :attr:`!side_effect` é chamada com os mesmos argumentos que o mock. Isto permite-lhe variar o valor de retorno da chamada dinamicamente, com base na entrada:

source: If you want the mock to still return the default return value (a new mock), or any set return value, then there are two ways of doing this. Either return :attr:`~Mock.return_value` from inside :attr:`~Mock.side_effect`, or return :data:`DEFAULT`:
pt_pt: Se quiser que o mock ainda devolva o valor de retorno predefinido (um novo mock), ou qualquer valor de retorno definido, então há duas formas de o fazer. Ou devolve :attr:`~Mock.return_value` a partir de dentro de :attr:`~Mock.side_effect`, ou devolve :data:`DEFAULT`:

source: To remove a :attr:`~Mock.side_effect`, and return to the default behaviour, set the :attr:`!side_effect` to ``None``:
pt_pt: Para remover um :attr:`~Mock.side_effect` e voltar ao comportamento predefinido, defina o :attr:`!side_effect` para ``None``:

source: The :attr:`~Mock.side_effect` can also be any iterable object. Repeated calls to the mock will return values from the iterable (until the iterable is exhausted and a :exc:`StopIteration` is raised):
pt_pt: O :attr:`~Mock.side_effect` também pode ser qualquer objeto iterável. Chamadas repetidas ao mock devolverão valores do iterável (até que o iterável esteja esgotado e seja lançada uma :exc:`StopIteration`):

source: If any members of the iterable are exceptions they will be raised instead of returned::
pt_pt: Se algum dos membros do iterável forem exceções, serão lançadas em vez de devolvidas::
ru: Если какие-либо члены итерируемого объекта являются исключениями, они будут вызваны, а не возвращены::

source: >>> iterable = (33, ValueError, 66) >>> m = MagicMock(side_effect=iterable) >>> m() 33 >>> m() Traceback (most recent call last): ... ValueError >>> m() 66
pt_pt: >>> iteravel = (33, ValueError, 66) >>> m = MagicMock(side_effect=iteravel) >>> m() 33 >>> m() Traceback (most recent call last): ... ValueError >>> m() 66

source: Deleting Attributes
pt_pt: Eliminar Atributos
ru: Удаление атрибутов

source: Mock objects create attributes on demand. This allows them to pretend to be objects of any type.
pt_pt: Os objetos Mock criam atributos conforme necessário. Isto permite-lhes fingir ser objetos de qualquer tipo.
ru: Мок-объекты создают атрибуты по требованию. Это позволяет им притворяться объектами любого типа.

source: You may want a mock object to return ``False`` to a :func:`hasattr` call, or raise an :exc:`AttributeError` when an attribute is fetched. You can do this by providing an object as a :attr:`!spec` for a mock, but that isn't always convenient.
pt_pt: Pode querer que um objeto mock devolva ``False`` a uma chamada :func:`hasattr`, ou lance um :exc:`AttributeError` quando um atributo é obtido. Pode fazer isto fornecendo um objeto como um :attr:`!spec` para um mock, mas isso nem sempre é conveniente.

source: You "block" attributes by deleting them. Once deleted, accessing an attribute will raise an :exc:`AttributeError`.
pt_pt: Pode "bloquear" atributos eliminando-os. Uma vez eliminados, aceder a um atributo lançará um :exc:`AttributeError`.
ru: Вы «блокируете» атрибуты, удаляя их. После удаления доступ к атрибуту вызовет ошибку :exc:`AttributeError`.

source: Mock names and the name attribute
pt_pt: Nomes de Mock e o atributo name
ru: Фокальные имена и атрибут имени

source: Since "name" is an argument to the :class:`Mock` constructor, if you want your mock object to have a "name" attribute you can't just pass it in at creation time. There are two alternatives. One option is to use :meth:`~Mock.configure_mock`::
pt_pt: Como "name" é um argumento para o construtor :class:`Mock`, se quiser que o seu objeto mock tenha um atributo "name", não pode simplesmente passá-lo no momento da criação. Há duas alternativas. Uma opção é usar :meth:`~Mock.configure_mock`::
ru: Поскольку «имя» является аргументом конструктора :class:`Mock`, если вы хотите, чтобы ваш макетный объект имел атрибут «имя», вы не можете просто передать его во время создания. Есть две альтернативы. Один из вариантов — использовать :meth:`~Mock.configure_mock`::

source: >>> mock = MagicMock() >>> mock.configure_mock(name='my_name') >>> mock.name 'my_name'
pt_pt: >>> mock = MagicMock() >>> mock.configure_mock(name='meu_nome') >>> mock.name 'meu_nome'

source: A simpler option is to simply set the "name" attribute after mock creation::
pt_pt: Uma opção mais simples é simplesmente definir o atributo "name" após a criação do mock::
ru: Более простой вариант — просто установить атрибут «name» после создания макета:

source: Attaching Mocks as Attributes
pt_pt: Anexar Mocks como Atributos
ru: Прикрепление макетов в качестве атрибутов

source: When you attach a mock as an attribute of another mock (or as the return value) it becomes a "child" of that mock. Calls to the child are recorded in the :attr:`~Mock.method_calls` and :attr:`~Mock.mock_calls` attributes of the parent. This is useful for configuring child mocks and then attaching them to the parent, or for attaching mocks to a parent that records all calls to the children and allows you to make assertions about the order of calls between mocks:
pt_pt: Quando anexa um mock como um atributo de outro mock (ou como o valor de retorno), este torna-se um "filho" desse mock. As chamadas ao filho são registadas nos atributos :attr:`~Mock.method_calls` e :attr:`~Mock.mock_calls` do pai. Isto é útil para configurar mocks filhos e depois anexá-los ao pai, ou para anexar mocks a um pai que regista todas as chamadas aos filhos e permite fazer afirmações sobre a ordem das chamadas entre mocks:
ru: Когда вы присоединяете макет как атрибут другого макета (или как возвращаемое значение), он становится «дочерним» объектом этого макета. Вызовы дочернего элемента записываются в атрибутах :attr:`~Mock.method_calls` и :attr:`~Mock.mock_calls` родителя. Это полезно для настройки дочерних макетов и последующего прикрепления их к родительскому элементу или для прикрепления макетов к родительскому элементу, который записывает все вызовы дочерних элементов и позволяет вам делать утверждения о порядке вызовов между макетами:

source: The exception to this is if the mock has a name. This allows you to prevent the "parenting" if for some reason you don't want it to happen.
pt_pt: A exceção a isto é se o mock tiver um nome. Isto permite-lhe evitar o "parenting" se, por alguma razão, não quiser que isso aconteça.
ru: Исключением является случай, когда у макета есть имя. Это позволяет вам предотвратить «воспитание», если по какой-то причине вы не хотите, чтобы это произошло.
