Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: Mocks can also be called with arbitrary keyword arguments. These will be used to set attributes on the mock after it is created. See the :meth:`configure_mock` method for details.
pt_pt: Os mocks também podem ser chamados com argumentos de palavra-chave arbitrários. Estes serão usados para definir atributos no mock após a sua criação. Veja o método :meth:`configure_mock` para detalhes.
ru: Mocks также можно вызывать с произвольными аргументами ключевого слова. Они будут использоваться для установки атрибутов макета после его создания. Подробности смотрите в методе :meth:`configure_mock`.

source: Assert that the mock was called at least once.
pt_pt: Afirma que o mock foi chamado pelo menos uma vez.
ru: Утвердите, что макет был вызван хотя бы один раз.

source: Assert that the mock was called exactly once.
pt_pt: Afirma que o mock foi chamado exatamente uma vez.
ru: Утвердите, что макет был вызван ровно один раз.

source: This method is a convenient way of asserting that the last call has been made in a particular way:
pt_pt: Este método é uma forma conveniente de afirmar que a última chamada foi feita de uma determinada forma:
ru: Этот метод представляет собой удобный способ подтвердить, что последний вызов был выполнен определенным образом:

source: Assert that the mock was called exactly once and that call was with the specified arguments.
pt_pt: Afirma que o mock foi chamado exatamente uma vez e que essa chamada foi feita com os argumentos especificados.
ru: Утвердите, что макет был вызван ровно один раз и этот вызов был с указанными аргументами.

source: assert the mock has been called with the specified arguments.
pt_pt: afirma que o mock foi chamado com os argumentos especificados.
ru: утверждайте, что макет был вызван с указанными аргументами.

source: The assert passes if the mock has *ever* been called, unlike :meth:`assert_called_with` and :meth:`assert_called_once_with` that only pass if the call is the most recent one, and in the case of :meth:`assert_called_once_with` it must also be the only call.
pt_pt: A afirmação passa se o mock já *alguma vez* foi chamado, ao contrário de :meth:`assert_called_with` e :meth:`assert_called_once_with` que só passam se a chamada for a mais recente, e no caso de :meth:`assert_called_once_with` também deve ser a única chamada.
ru: Утверждение проходит, если макет *когда-либо* вызывался, в отличие от :meth:`assert_called_with` и :meth:`assert_called_once_with`, которые проходят только в том случае, если вызов является самым последним, и в случае :meth:`assert_known_once_with` это также должен быть единственный звонок.

source: assert the mock has been called with the specified calls. The :attr:`mock_calls` list is checked for the calls.
pt_pt: afirma que o mock foi chamado com as chamadas especificadas. A lista :attr:`mock_calls` é verificada para as chamadas.
ru: утверждать, что макет был вызван с указанными вызовами. Список :attr:`mock_calls` проверяется на наличие вызовов.

source: If *any_order* is false then the calls must be sequential. There can be extra calls before or after the specified calls.
pt_pt: Se *any_order* for falso, então as chamadas devem ser sequenciais. Pode haver chamadas extra antes ou depois das chamadas especificadas.
ru: Если *any_order* имеет значение false, вызовы должны быть последовательными. До или после указанных вызовов могут быть дополнительные вызовы.

source: If *any_order* is true then the calls can be in any order, but they must all appear in :attr:`mock_calls`.
pt_pt: Se *any_order* for verdadeiro, então as chamadas podem estar em qualquer ordem, mas devem todas aparecer em :attr:`mock_calls`.
ru: Если *any_order* имеет значение true, то вызовы могут быть в любом порядке, но все они должны появляться в :attr:`mock_calls`.

source: Assert the mock was never called.
pt_pt: Afirma que o mock nunca foi chamado.
ru: Если *any_order* имеет значение true, то вызовы могут быть в любом порядке, но все они должны появляться в :attr:`mock_calls`.

source: The reset_mock method resets all the call attributes on a mock object:
pt_pt: O método reset_mock redefine todos os atributos de chamada num objeto mock:
ru: Метод reset_mock сбрасывает все атрибуты вызова фиктивного объекта:

source: >>> mock = Mock(return_value=None) >>> mock('hello') >>> mock.called True >>> mock.reset_mock() >>> mock.called False
pt_pt: >>> mock = Mock(return_value=None) >>> mock('olá') >>> mock.called True >>> mock.reset_mock() >>> mock.called False

source: This can be useful where you want to make a series of assertions that reuse the same object.
pt_pt: Isto pode ser útil quando quer fazer uma série de afirmações que reutilizam o mesmo objeto.

source: *return_value* parameter when set to ``True`` resets :attr:`return_value`:
pt_pt: O parâmetro *return_value* quando definido como ``True`` redefine :attr:`return_value`:

source: >>> mock = Mock(return_value=5) >>> mock('hello') 5 >>> mock.reset_mock(return_value=True) >>> mock('hello') <Mock name='mock()' id='...'>
pt_pt: >>> mock = Mock(return_value=5) >>> mock('olá') 5 >>> mock.reset_mock(return_value=True) >>> mock('olá') <Mock name='mock()' id='...'>

source: *side_effect* parameter when set to ``True`` resets :attr:`side_effect`:
pt_pt: O parâmetro *side_effect* quando definido como ``True`` redefine :attr:`side_effect`:

source: >>> mock = Mock(side_effect=ValueError) >>> mock('hello') Traceback (most recent call last): ... ValueError >>> mock.reset_mock(side_effect=True) >>> mock('hello') <Mock name='mock()' id='...'>
pt_pt: >>> mock = Mock(side_effect=ValueError) >>> mock('olá') Traceback (most recent call last): ... ValueError >>> mock.reset_mock(side_effect=True) >>> mock('olá') <Mock name='mock()' id='...'>

source: Note that :meth:`reset_mock` *doesn't* clear the :attr:`return_value`, :attr:`side_effect` or any child attributes you have set using normal assignment by default.
pt_pt: Note que :meth:`reset_mock` *não* limpa o :attr:`return_value`, :attr:`side_effect` ou quaisquer atributos filhos que tenha definido usando atribuição normal por predefinição.

source: Child mocks are reset as well.
pt_pt: Os mocks filhos também são redefinidos.

source: Added two keyword-only arguments to the reset_mock function.
pt_pt: Adicionados dois argumentos apenas de palavra-chave à função reset_mock.
ru: В функцию reset_mock добавлены два аргумента, состоящие только из ключевых слов.

source: Add a spec to a mock. *spec* can either be an object or a list of strings. Only attributes on the *spec* can be fetched as attributes from the mock.
pt_pt: Adiciona uma especificação a um mock. *spec* pode ser um objeto ou uma lista de strings. Apenas atributos em *spec* podem ser obtidos como atributos do mock.
ru: Добавьте спецификацию в макет. *spec* может быть либо объектом, либо списком строк. Только атрибуты *spec* могут быть извлечены как атрибуты из макета.

source: If *spec_set* is true then only attributes on the spec can be set.
pt_pt: Se *spec_set* for verdadeiro, então apenas atributos no spec podem ser definidos.
ru: Если *spec_set* имеет значение true, то можно установить только атрибуты спецификации.

source: Attach a mock as an attribute of this one, replacing its name and parent. Calls to the attached mock will be recorded in the :attr:`method_calls` and :attr:`mock_calls` attributes of this one.
pt_pt: Anexa um mock como um atributo deste, substituindo o seu nome e pai. Chamadas para o mock anexado serão registadas nos atributos :attr:`method_calls` e :attr:`mock_calls` deste.
ru: Прикрепите макет в качестве атрибута этого объекта, заменив его имя и родителя. Вызовы прикрепленного макета будут записаны в атрибутах :attr:`method_calls` и :attr:`mock_calls` этого.

source: Set attributes on the mock through keyword arguments.
pt_pt: Define atributos no mock através de argumentos de palavra-chave.
ru: Установите атрибуты макета с помощью аргументов ключевого слова.

source: Attributes plus return values and side effects can be set on child mocks using standard dot notation and unpacking a dictionary in the method call:
pt_pt: Atributos, valores de retorno e efeitos secundários podem ser definidos em mocks filhos usando notação de ponto padrão e desempacotando um dicionário na chamada do método:
ru: Атрибуты, возвращаемые значения и побочные эффекты могут быть установлены в дочерних макетах с использованием стандартной записи через точку и распаковки словаря при вызове метода:

source: The same thing can be achieved in the constructor call to mocks:
pt_pt: A mesma coisa pode ser alcançada na chamada do construtor para mocks:
ru: Того же самого можно добиться при вызове конструктора для макетов:

source: :meth:`configure_mock` exists to make it easier to do configuration after the mock has been created.
pt_pt: :meth:`configure_mock` existe para facilitar a configuração após a criação do mock.
ru: :meth:`configure_mock` существует для того, чтобы упростить настройку после создания макета.

source: :class:`Mock` objects limit the results of ``dir(some_mock)`` to useful results. For mocks with a *spec* this includes all the permitted attributes for the mock.
pt_pt: Os objetos :class:`Mock` limitam os resultados de ``dir(some_mock)`` a resultados úteis. Para mocks com um *spec*, isto inclui todos os atributos permitidos para o mock.
ru: Объекты :class:`Mock` ограничивают результаты ``dir(some_mock)`` полезными результатами. Для макетов со спецификацией *spec* сюда входят все разрешенные атрибуты макета.

source: See :data:`FILTER_DIR` for what this filtering does, and how to switch it off.
pt_pt: Veja :data:`FILTER_DIR` para saber o que esta filtragem faz e como desativá-la.
ru: См. :data:`FILTER_DIR`, чтобы узнать, что делает эта фильтрация и как ее отключить.

source: Create the child mocks for attributes and return value. By default child mocks will be the same type as the parent. Subclasses of Mock may want to override this to customize the way child mocks are made.
pt_pt: Cria os mocks filhos para atributos e valor de retorno. Por predefinição, os mocks filhos serão do mesmo tipo que o pai. Subclasses de Mock podem querer substituir isto para personalizar a forma como os mocks filhos são criados.
ru: Создайте дочерние макеты для атрибутов и возвращаемого значения. По умолчанию дочерние макеты будут того же типа, что и родительские. Подклассы Mock могут захотеть переопределить это, чтобы настроить способ создания дочерних макетов.

source: For non-callable mocks the callable variant will be used (rather than any custom subclass).
pt_pt: Para mocks não chamáveis, a variante chamável será usada (em vez de qualquer subclasse personalizada).
ru: Для невызываемых макетов будет использоваться вызываемый вариант (а не любой пользовательский подкласс).

source: A boolean representing whether or not the mock object has been called:
pt_pt: Um booleano que representa se o objeto mock foi chamado ou não:
ru: Логическое значение, указывающее, был ли вызван фиктивный объект:

source: An integer telling you how many times the mock object has been called:
pt_pt: Um inteiro que indica quantas vezes o objeto mock foi chamado:
ru: Целое число, сообщающее, сколько раз вызывался фиктивный объект:

source: Set this to configure the value returned by calling the mock:
pt_pt: Defina isto para configurar o valor devolvido ao chamar o mock:
ru: Установите это, чтобы настроить значение, возвращаемое при вызове макета:

source: The default return value is a mock object and you can configure it in the normal way:
pt_pt: O valor de retorno predefinido é um objeto mock e pode configurá-lo da forma habitual:
ru: Возвращаемое значение по умолчанию — это фиктивный объект, и вы можете настроить его обычным способом:

source: :attr:`return_value` can also be set in the constructor:
pt_pt: :attr:`return_value` também pode ser definido no construtor:
ru: :attr:`return_value` также можно установить в конструкторе:

source: This can either be a function to be called when the mock is called, an iterable or an exception (class or instance) to be raised.
pt_pt: Isto pode ser uma função a ser chamada quando o mock é chamado, um iterável ou uma exceção (classe ou instância) a ser lançada.
ru: Это может быть либо функция, вызываемая при вызове макета, либо итерация, либо вызываемое исключение (класс или экземпляр).

source: If you pass in a function it will be called with same arguments as the mock and unless the function returns the :data:`DEFAULT` singleton the call to the mock will then return whatever the function returns. If the function returns :data:`DEFAULT` then the mock will return its normal value (from the :attr:`return_value`).
pt_pt: Se passar uma função, esta será chamada com os mesmos argumentos que o mock e, a menos que a função retorne o singleton :data:`DEFAULT`, a chamada ao mock retornará o que a função retornar. Se a função retornar :data:`DEFAULT`, então o mock retornará o seu valor normal (de :attr:`return_value`).
ru: Если вы передадите функцию, она будет вызвана с теми же аргументами, что и макет, и если функция не вернет синглтон :data:`DEFAULT`, вызов макета затем вернет все, что возвращает функция. Если функция возвращает :data:`DEFAULT`, то макет вернет своё нормальное значение (из :attr:`return_value`).

source: If you pass in an iterable, it is used to retrieve an iterator which must yield a value on every call. This value can either be an exception instance to be raised, or a value to be returned from the call to the mock (:data:`DEFAULT` handling is identical to the function case).
pt_pt: Se passar um iterável, este é usado para obter um iterador que deve produzir um valor em cada chamada. Este valor pode ser uma instância de exceção a ser lançada ou um valor a ser devolvido da chamada ao mock (o tratamento de :data:`DEFAULT` é idêntico ao caso da função).
ru: Если вы передаете итерируемый объект, он используется для получения итератора, который должен возвращать значение при каждом вызове. Это значение может быть либо экземпляром исключения, которое должно быть вызвано, либо значением, которое должно быть возвращено из вызова макета (обработка :data:`DEFAULT` идентична случаю функции).

source: An example of a mock that raises an exception (to test exception handling of an API):
pt_pt: Um exemplo de um mock que lança uma exceção (para testar o tratamento de exceções de uma API):
ru: Пример макета, вызывающего исключение (для проверки обработки исключений API):

source: Using :attr:`side_effect` to return a sequence of values:
pt_pt: Usar :attr:`side_effect` para devolver uma sequência de valores:
ru: Использование :attr:`side_effect` для возврата последовательности значений:

source: Using a callable:
pt_pt: Usar um chamável:
ru: Использование вызываемого объекта:

source: :attr:`side_effect` can be set in the constructor. Here's an example that adds one to the value the mock is called with and returns it:
pt_pt: :attr:`side_effect` pode ser definido no construtor. Aqui está um exemplo que adiciona um ao valor com que o mock é chamado e o devolve:
ru: :attr:`side_effect` можно установить в конструкторе. Вот пример, который добавляет единицу к значению, с которым вызывается макет, и возвращает его:

source: Setting :attr:`side_effect` to ``None`` clears it:
pt_pt: Definir :attr:`side_effect` para ``None`` limpa-o:
ru: Установка :attr:`side_effect` в ``None`` очищает его:

source: :attr:`call_args`, along with members of the lists :attr:`call_args_list`, :attr:`method_calls` and :attr:`mock_calls` are :data:`call` objects. These are tuples, so they can be unpacked to get at the individual arguments and make more complex assertions. See :ref:`calls as tuples <calls-as-tuples>`.
pt_pt: :attr:`call_args`, juntamente com membros das listas :attr:`call_args_list`, :attr:`method_calls` e :attr:`mock_calls` são objetos :data:`call`. Estes são tuplos, por isso podem ser desempacotados para obter os argumentos individuais e fazer afirmações mais complexas. Veja :ref:`chamadas como tuplos <calls-as-tuples>`.
ru: :attr:`call_args` вместе с членами списков :attr:`call_args_list`, :attr:`method_calls` и :attr:`mock_calls` являются объектами :data:`call`. Это кортежи, поэтому их можно распаковать, чтобы получить отдельные аргументы и сделать более сложные утверждения. См. :ref:`вызовы как кортежи <calls-as-tuples>`.

source: Added ``args`` and ``kwargs`` properties.
pt_pt: Adicionadas propriedades ``args`` e ``kwargs``.
ru: Добавлены свойства args и kwargs.

source: This is a list of all the calls made to the mock object in sequence (so the length of the list is the number of times it has been called). Before any calls have been made it is an empty list. The :data:`call` object can be used for conveniently constructing lists of calls to compare with :attr:`call_args_list`.
pt_pt: Esta é uma lista de todas as chamadas feitas ao objeto mock em sequência (por isso o comprimento da lista é o número de vezes que foi chamado). Antes de quaisquer chamadas terem sido feitas, é uma lista vazia. O objeto :data:`call` pode ser usado para construir convenientemente listas de chamadas para comparar com :attr:`call_args_list`.
ru: Это список всех последовательных вызовов макетного объекта (поэтому длина списка равна количеству раз, когда он вызывался). До того, как были сделаны какие-либо вызовы, это пустой список. Объект :data:`call` можно использовать для удобного создания списков вызовов для сравнения с :attr:`call_args_list`.

source: Members of :attr:`call_args_list` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
pt_pt: Os membros de :attr:`call_args_list` são objetos :data:`call`. Estes podem ser desempacotados como tuplos para obter os argumentos individuais. Veja :ref:`chamadas como tuplos <calls-as-tuples>`.
ru: Членами :attr:`call_args_list` являются объекты :data:`call`. Их можно распаковать как кортежи, чтобы получить отдельные аргументы. См. :ref:`вызовы как кортежи <calls-as-tuples>`.

source: As well as tracking calls to themselves, mocks also track calls to methods and attributes, and *their* methods and attributes:
pt_pt: Além de rastrear chamadas para si mesmos, os mocks também rastreiam chamadas para métodos e atributos, e *seus* métodos e atributos:
ru: Помимо отслеживания вызовов самих себя, макеты также отслеживают вызовы методов и атрибутов, а также *их* методов и атрибутов:

source: Members of :attr:`method_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
pt_pt: Os membros de :attr:`method_calls` são objetos :data:`call`. Estes podem ser desempacotados como tuplos para obter os argumentos individuais. Veja :ref:`chamadas como tuplos <calls-as-tuples>`.
ru: Членами :attr:`method_calls` являются объекты :data:`call`. Их можно распаковать как кортежи, чтобы получить отдельные аргументы. См. :ref:`вызовы как кортежи <calls-as-tuples>`.

source: :attr:`mock_calls` records *all* calls to the mock object, its methods, magic methods *and* return value mocks.
pt_pt: :attr:`mock_calls` regista *todas* as chamadas para o objeto mock, os seus métodos, métodos mágicos *e* mocks de valor de retorno.
ru: :attr:`mock_calls` записывает *все* вызовы макетного объекта, его методов, магических методов *и* возвращаемых значений.

source: Members of :attr:`mock_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
pt_pt: Os membros de :attr:`mock_calls` são objetos :data:`call`. Estes podem ser desempacotados como tuplos para obter os argumentos individuais. Veja :ref:`chamadas como tuplos <calls-as-tuples>`.
ru: Членами :attr:`mock_calls` являются объекты :data:`call`. Их можно распаковать как кортежи, чтобы получить отдельные аргументы. См. :ref:`вызовы как кортежи <calls-as-tuples>`.

source: The way :attr:`mock_calls` are recorded means that where nested calls are made, the parameters of ancestor calls are not recorded and so will always compare equal:
pt_pt: A forma como :attr:`mock_calls` são registados significa que, onde são feitas chamadas aninhadas, os parâmetros das chamadas ancestrais não são registados e, por isso, sempre compararão como iguais:
ru: Способ записи :attr:`mock_calls` означает, что при выполнении вложенных вызовов параметры вызовов предков не записываются и поэтому всегда будут сравниваться равными:

source: Normally the :attr:`!__class__` attribute of an object will return its type. For a mock object with a :attr:`!spec`, :attr:`!__class__` returns the spec class instead. This allows mock objects to pass :func:`isinstance` tests for the object they are replacing / masquerading as:
pt_pt: Normalmente, o atributo :attr:`!__class__` de um objeto devolve o seu tipo. Para um objeto mock com um :attr:`!spec`, :attr:`!__class__` devolve a classe spec em vez disso. Isto permite que os objetos mock passem nos testes :func:`isinstance` para o objeto que estão a substituir/encobrir:

source: :attr:`!__class__` is assignable to, this allows a mock to pass an :func:`isinstance` check without forcing you to use a spec:
pt_pt: :attr:`!__class__` pode ser atribuído, isto permite que um mock passe numa verificação :func:`isinstance` sem o forçar a usar um spec:

source: A non-callable version of :class:`Mock`. The constructor parameters have the same meaning of :class:`Mock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
pt_pt: Uma versão não chamável de :class:`Mock`. Os parâmetros do construtor têm o mesmo significado de :class:`Mock`, com exceção de *return_value* e *side_effect* que não têm significado num mock não chamável.
ru: Невызываемая версия :class:`Mock`. Параметры конструктора имеют то же значение, что и :class:`Mock`, за исключением *return_value* и *side_effect*, которые не имеют значения для невызываемого макета.

source: Mock objects that use a class or an instance as a :attr:`!spec` or :attr:`!spec_set` are able to pass :func:`isinstance` tests:
pt_pt: Objetos mock que usam uma classe ou uma instância como :attr:`!spec` ou :attr:`!spec_set` são capazes de passar testes :func:`isinstance`:

source: The :class:`Mock` classes have support for mocking magic methods. See :ref:`magic methods <magic-methods>` for the full details.
pt_pt: As classes :class:`Mock` têm suporte para simular métodos mágicos. Veja :ref:`métodos mágicos <magic-methods>` para mais detalhes.
ru: Классы :class:`Mock` поддерживают имитацию магических методов. См. :ref:`magic методы <magic-methods>` для получения полной информации.

source: The mock classes and the :func:`patch` decorators all take arbitrary keyword arguments for configuration. For the :func:`patch` decorators the keywords are passed to the constructor of the mock being created. The keyword arguments are for configuring attributes of the mock:
pt_pt: As classes mock e os decoradores :func:`patch` aceitam todos argumentos de palavra-chave arbitrários para configuração. Para os decoradores :func:`patch`, as palavras-chave são passadas para o construtor do mock que está a ser criado. Os argumentos de palavra-chave são para configurar atributos do mock:
ru: Мок-классы и декораторы :func:`patch` принимают произвольные ключевые слова для настройки. Для декораторов :func:`patch` ключевые слова передаются конструктору создаваемого макета. Аргументы ключевого слова предназначены для настройки атрибутов макета:
