Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/unittest.mock.po
Languages: pt_pt, ru

source: Mocks created for you by :func:`patch` are automatically given names. To attach mocks that have names to a parent you use the :meth:`~Mock.attach_mock` method::
pt_pt: Os mocks criados para si por :func:`patch` recebem automaticamente nomes. Para anexar mocks que têm nomes a um pai, usa o método :meth:`~Mock.attach_mock`::
ru: Мокам, созданным для вас с помощью :func:`patch`, автоматически присваиваются имена. Чтобы прикрепить макеты, имеющие имена, к родителю, вы используете метод :meth:`~Mock.attach_mock`::

source: >>> thing1 = object() >>> thing2 = object() >>> parent = MagicMock() >>> with patch('__main__.thing1', return_value=None) as child1: ... with patch('__main__.thing2', return_value=None) as child2: ... parent.attach_mock(child1, 'child1') ... parent.attach_mock(child2, 'child2') ... child1('one') ... child2('two') ... >>> parent.mock_calls [call.child1('one'), call.child2('two')]
pt_pt: >>> coisa1 = object() >>> coisa2 = object() >>> pai = MagicMock() >>> with patch('__main__.coisa1', return_value=None) as filho1: ... with patch('__main__.coisa2', return_value=None) as filho2: ... pai.attach_mock(filho1, 'filho1') ... pai.attach_mock(filho2, 'filho2') ... filho1('um') ... filho2('dois') ... >>> pai.mock_calls [call.filho1('um'), call.filho2('dois')]

source: The only exceptions are magic methods and attributes (those that have leading and trailing double underscores). Mock doesn't create these but instead raises an :exc:`AttributeError`. This is because the interpreter will often implicitly request these methods, and gets *very* confused to get a new Mock object when it expects a magic method. If you need magic method support see :ref:`magic methods <magic-methods>`.
pt_pt: As únicas exceções são os métodos mágicos e atributos (aqueles que têm duplos sublinhados no início e no fim). Mock não cria estes, mas em vez disso lança um :exc:`AttributeError`. Isto porque o interpretador muitas vezes solicita implicitamente estes métodos e fica *muito* confuso ao receber um novo objeto Mock quando espera um método mágico. Se precisar de suporte para métodos mágicos, veja :ref:`métodos mágicos <magic-methods>`.
ru: Единственным исключением являются магические методы и атрибуты (те, которые имеют двойное подчеркивание в начале и в конце). Mock не создает их, а вместо этого вызывает :exc:`AttributeError`. Это связано с тем, что интерпретатор часто неявно запрашивает эти методы и *очень* запутывается, пытаясь получить новый Mock-объект, когда он ожидает магический метод. Если вам нужна поддержка магических методов, см. :ref:`magic методы <magic-methods>`.

source: The patchers
pt_pt: Os patchers

source: The patch decorators are used for patching objects only within the scope of the function they decorate. They automatically handle the unpatching for you, even if exceptions are raised. All of these functions can also be used in with statements or as class decorators.
pt_pt: Os decoradores patch são usados para substituir objetos apenas dentro do âmbito da função que decoram. Eles tratam automaticamente da remoção da substituição para si, mesmo que sejam lançadas exceções. Todas estas funções também podem ser usadas em declarações with ou como decoradores de classe.
ru: Декораторы патчей используются для исправления объектов только в рамках функции, которую они декорируют. Они автоматически выполняют удаление исправлений за вас, даже если возникают исключения. Все эти функции также можно использовать с операторами или в качестве декораторов классов.

source: The key is to do the patching in the right namespace. See the section `where to patch`_.
pt_pt: A chave é fazer a substituição no espaço de nomes correto. Veja a secção `onde substituir`_.
ru: Ключевым моментом является внесение исправлений в правильное пространство имен. См. раздел `где пропатчить`_.

source: :func:`patch` acts as a function decorator, class decorator or a context manager. Inside the body of the function or with statement, the *target* is patched with a *new* object. When the function/with statement exits the patch is undone.
pt_pt: :func:`patch` atua como um decorador de função, decorador de classe ou um gestor de contexto. Dentro do corpo da função ou da declaração with, o *target* é substituído com um objeto *new*. Quando a função/declaração with termina, a substituição é desfeita.
ru: :func:`patch` действует как декоратор функции, декоратор класса или менеджер контекста. Внутри тела функции или оператора with *target* добавляется *new* объект. Когда оператор function/with завершает работу, исправление отменяется.

source: If *new* is omitted, then the target is replaced with an :class:`AsyncMock` if the patched object is an async function or a :class:`MagicMock` otherwise. If :func:`patch` is used as a decorator and *new* is omitted, the created mock is passed in as an extra argument to the decorated function. If :func:`patch` is used as a context manager the created mock is returned by the context manager.
pt_pt: Se *new* for omitido, então o alvo é substituído por um :class:`AsyncMock` se o objeto substituído for uma função assíncrona ou um :class:`MagicMock` caso contrário. Se :func:`patch` for usado como um decorador e *new* for omitido, o mock criado é passado como um argumento extra para a função decorada. Se :func:`patch` for usado como um gestor de contexto, o mock criado é devolvido pelo gestor de contexto.
ru: Если *new* опущено, то цель заменяется на :class:`AsyncMock`, если исправленный объект является асинхронной функцией, или :class:`MagicMock` в противном случае. Если :func:`patch` используется в качестве декоратора и *new* опущено, созданный макет передается в качестве дополнительного аргумента декорируемой функции. Если :func:`patch` используется в качестве менеджера контекста, созданный макет возвращается менеджером контекста.

source: *target* should be a string in the form ``'package.module.ClassName'``. The *target* is imported and the specified object replaced with the *new* object, so the *target* must be importable from the environment you are calling :func:`patch` from. The target is imported when the decorated function is executed, not at decoration time.
pt_pt: *target* deve ser uma string na forma ``'package.module.ClassName'``. O *target* é importado e o objeto especificado é substituído pelo objeto *new*, por isso o *target* deve ser importável a partir do ambiente de onde está a chamar :func:`patch`. O alvo é importado quando a função decorada é executada, não no momento da decoração.
ru: *target* должна быть строкой в ​​формате ``'package.module.ClassName'``. *Цель* импортируется, а указанный объект заменяется *новым* объектом, поэтому *цель* должна быть доступна для импорта из среды, из которой вы вызываете :func:`patch`. Цель импортируется при выполнении декорированной функции, а не во время декорирования.

source: The *spec* and *spec_set* keyword arguments are passed to the :class:`MagicMock` if patch is creating one for you.
pt_pt: Os argumentos de palavra-chave *spec* e *spec_set* são passados para o :class:`MagicMock` se o patch estiver a criar um para si.
ru: Аргументы ключевых слов *spec* и *spec_set* передаются в :class:`MagicMock`, если патч создает его для вас.

source: In addition you can pass ``spec=True`` or ``spec_set=True``, which causes patch to pass in the object being mocked as the spec/spec_set object.
pt_pt: Além disso, pode passar ``spec=True`` ou ``spec_set=True``, o que faz com que o patch passe o objeto a ser simulado como o objeto spec/spec_set.
ru: Кроме того, вы можете передать ``spec=True`` или ``spec_set=True``, что приведет к тому, что patch передаст издеваемый объект как объект spec/spec_set.

source: *new_callable* allows you to specify a different class, or callable object, that will be called to create the *new* object. By default :class:`AsyncMock` is used for async functions and :class:`MagicMock` for the rest.
pt_pt: *new_callable* permite-lhe especificar uma classe diferente, ou um objeto chamável, que será chamado para criar o objeto *new*. Por predefinição, :class:`AsyncMock` é usado para funções assíncronas e :class:`MagicMock` para o resto.
ru: *new_callable* позволяет вам указать другой класс или вызываемый объект, который будет вызываться для создания *нового* объекта. По умолчанию :class:`AsyncMock` используется для асинхронных функций, а :class:`MagicMock` — для остальных.

source: A more powerful form of *spec* is *autospec*. If you set ``autospec=True`` then the mock will be created with a spec from the object being replaced. All attributes of the mock will also have the spec of the corresponding attribute of the object being replaced. Methods and functions being mocked will have their arguments checked and will raise a :exc:`TypeError` if they are called with the wrong signature. For mocks replacing a class, their return value (the 'instance') will have the same spec as the class. See the :func:`create_autospec` function and :ref:`auto-speccing`.
pt_pt: Uma forma mais poderosa de *spec* é *autospec*. Se definir ``autospec=True``, então o mock será criado com um spec do objeto a ser substituído. Todos os atributos do mock também terão o spec do atributo correspondente do objeto a ser substituído. Métodos e funções a serem simulados terão os seus argumentos verificados e lançarão um :exc:`TypeError` se forem chamados com a assinatura errada. Para mocks que substituem uma classe, o seu valor de retorno (a 'instância') terá o mesmo spec que a classe. Veja a função :func:`create_autospec` e :ref:`auto-speccing`.
ru: Более мощная форма *spec* — *autospec*. Если вы установите ``autospec=True``, то макет будет создан со спецификацией заменяемого объекта. Все атрибуты макета также будут иметь спецификацию соответствующего атрибута заменяемого объекта. Аргументы имитируемых методов и функций будут проверены, и они вызовут ошибку :exc:`TypeError`, если они вызваны с неправильной сигнатурой. Для макетов, заменяющих класс, их возвращаемое значение («экземпляр») будет иметь ту же спецификацию, что и класс. См. функцию :func:`create_autospec` и :ref:`auto-speccing`.

source: Instead of ``autospec=True`` you can pass ``autospec=some_object`` to use an arbitrary object as the spec instead of the one being replaced.
pt_pt: Em vez de ``autospec=True``, pode passar ``autospec=some_object`` para usar um objeto arbitrário como o spec em vez do que está a ser substituído.
ru: Вместо autospec=True вы можете передать autospec=some_object, чтобы использовать в качестве спецификации произвольный объект вместо заменяемого.

source: By default :func:`patch` will fail to replace attributes that don't exist. If you pass in ``create=True``, and the attribute doesn't exist, patch will create the attribute for you when the patched function is called, and delete it again after the patched function has exited. This is useful for writing tests against attributes that your production code creates at runtime. It is off by default because it can be dangerous. With it switched on you can write passing tests against APIs that don't actually exist!
pt_pt: Por predefinição, :func:`patch` falhará ao substituir atributos que não existem. Se passar ``create=True`` e o atributo não existir, o patch criará o atributo para si quando a função substituída for chamada e eliminá-lo-á novamente após a função substituída ter terminado. Isto é útil para escrever testes contra atributos que o seu código de produção cria em tempo de execução. Está desativado por predefinição porque pode ser perigoso. Com isto ativado, pode escrever testes que passam contra APIs que não existem realmente!
ru: По умолчанию :func:`patch` не сможет заменить несуществующие атрибуты. Если вы передадите ``create=True``, а атрибут не существует, patch создаст атрибут для вас при вызове исправленной функции и удалит его снова после выхода из исправленной функции. Это полезно для написания тестов для атрибутов, которые ваш производственный код создает во время выполнения. По умолчанию он отключен, поскольку может быть опасным. Включив его, вы можете писать проходящие тесты для API, которых на самом деле не существует!

source: If you are patching builtins in a module then you don't need to pass ``create=True``, it will be added by default.
pt_pt: Se estiver a substituir builtins num módulo, não precisa de passar ``create=True``, será adicionado por predefinição.
ru: Если вы исправляете встроенные функции в модуле, вам не нужно передавать create=True, он будет добавлен по умолчанию.

source: Patch can be used as a :class:`~unittest.TestCase` class decorator. It works by decorating each test method in the class. This reduces the boilerplate code when your test methods share a common patchings set. :func:`patch` finds tests by looking for method names that start with ``patch.TEST_PREFIX``. By default this is ``'test'``, which matches the way :mod:`unittest` finds tests. You can specify an alternative prefix by setting ``patch.TEST_PREFIX``.
pt_pt: Patch pode ser usado como um decorador de classe :class:`~unittest.TestCase`. Funciona decorando cada método de teste na classe. Isto reduz o código repetitivo quando os seus métodos de teste partilham um conjunto comum de substituições. :func:`patch` encontra testes procurando nomes de métodos que comecem com ``patch.TEST_PREFIX``. Por predefinição, isto é ``'test'``, o que corresponde à forma como :mod:`unittest` encontra testes. Pode especificar um prefixo alternativo definindo ``patch.TEST_PREFIX``.

source: Patch can be used as a context manager, with the with statement. Here the patching applies to the indented block after the with statement. If you use "as" then the patched object will be bound to the name after the "as"; very useful if :func:`patch` is creating a mock object for you.
pt_pt: Patch pode ser usado como um gestor de contexto, com a declaração with. Aqui, a substituição aplica-se ao bloco indentado após a declaração with. Se usar "as", então o objeto substituído será ligado ao nome após o "as"; muito útil se :func:`patch` estiver a criar um objeto mock para si.
ru: Patch можно использовать в качестве менеджера контекста с помощью оператора with. Здесь исправление применяется к блоку с отступом после оператора with. Если вы используете «as», то исправленный объект будет привязан к имени после «as»; очень полезно, если :func:`patch` создает для вас фиктивный объект.

source: :func:`patch` takes arbitrary keyword arguments. These will be passed to :class:`AsyncMock` if the patched object is asynchronous, to :class:`MagicMock` otherwise or to *new_callable* if specified.
pt_pt: :func:`patch` aceita argumentos de palavra-chave arbitrários. Estes serão passados para :class:`AsyncMock` se o objeto substituído for assíncrono, para :class:`MagicMock` caso contrário, ou para *new_callable* se especificado.
ru: :func:`patch` принимает произвольные аргументы ключевого слова. Они будут переданы в :class:`AsyncMock`, если исправленный объект является асинхронным, в :class:`MagicMock` в противном случае или в *new_callable*, если указано.

source: ``patch.dict(...)``, ``patch.multiple(...)`` and ``patch.object(...)`` are available for alternate use-cases.
pt_pt: ``patch.dict(...)``, ``patch.multiple(...)`` e ``patch.object(...)`` estão disponíveis para casos de uso alternativos.
ru: ``patch.dict(...)``, ``patch.multiple(...)`` и ``patch.object(...)`` доступны для альтернативных вариантов использования.

source: :func:`patch` as function decorator, creating the mock for you and passing it into the decorated function::
pt_pt: :func:`patch` como decorador de função, criando o mock para si e passando-o para a função decorada::
ru: :func:`patch` в качестве декоратора функции, создающий для вас макет и передающий его декорируемой функции::

source: >>> @patch('__main__.SomeClass') ... def function(normal_argument, mock_class): ... print(mock_class is SomeClass) ... >>> function(None) True
pt_pt: >>> @patch('__main__.AlgumaClasse') ... def funcao(argumento_normal, mock_classe): ... print(mock_classe is AlgumaClasse) ... >>> funcao(None) True

source: Patching a class replaces the class with a :class:`MagicMock` *instance*. If the class is instantiated in the code under test then it will be the :attr:`~Mock.return_value` of the mock that will be used.
pt_pt: Substituir uma classe substitui a classe por uma *instância* :class:`MagicMock`. Se a classe for instanciada no código em teste, então será o :attr:`~Mock.return_value` do mock que será usado.
ru: Исправление класса заменяет класс на *экземпляр* :class:`MagicMock`. Если экземпляр класса создается в тестируемом коде, то будет использоваться :attr:`~Mock.return_value` макета.

source: If the class is instantiated multiple times you could use :attr:`~Mock.side_effect` to return a new mock each time. Alternatively you can set the *return_value* to be anything you want.
pt_pt: Se a classe for instanciada várias vezes, pode usar :attr:`~Mock.side_effect` para devolver um novo mock cada vez. Alternativamente, pode definir o *return_value* para ser qualquer coisa que quiser.
ru: Если экземпляр класса создается несколько раз, вы можете использовать :attr:`~Mock.side_effect`, чтобы каждый раз возвращать новый макет. В качестве альтернативы вы можете установить для *return_value* любое желаемое значение.

source: To configure return values on methods of *instances* on the patched class you must do this on the :attr:`~Mock.return_value`. For example::
pt_pt: Para configurar valores de retorno em métodos de *instâncias* na classe substituída, deve fazê-lo no :attr:`~Mock.return_value`. Por exemplo::

source: >>> class Class: ... def method(self): ... pass ... >>> with patch('__main__.Class') as MockClass: ... instance = MockClass.return_value ... instance.method.return_value = 'foo' ... assert Class() is instance ... assert Class().method() == 'foo' ...
pt_pt: >>> class Classe: ... def metodo(self): ... pass ... >>> with patch('__main__.Classe') as MockClasse: ... instancia = MockClasse.return_value ... instancia.metodo.return_value = 'foo' ... assert Classe() is instancia ... assert Classe().metodo() == 'foo' ...

source: If you use *spec* or *spec_set* and :func:`patch` is replacing a *class*, then the return value of the created mock will have the same spec. ::
pt_pt: Se usar *spec* ou *spec_set* e :func:`patch` estiver a substituir uma *classe*, então o valor de retorno do mock criado terá o mesmo spec. ::
ru: Если вы используете *spec* или *spec_set* и :func:`patch` заменяет *class*, то возвращаемое значение созданного макета будет иметь ту же спецификацию. ::

source: >>> Original = Class >>> patcher = patch('__main__.Class', spec=True) >>> MockClass = patcher.start() >>> instance = MockClass() >>> assert isinstance(instance, Original) >>> patcher.stop()
pt_pt: >>> Original = Classe >>> patcher = patch('__main__.Classe', spec=True) >>> MockClasse = patcher.start() >>> instancia = MockClasse() >>> assert isinstance(instancia, Original) >>> patcher.stop()

source: The *new_callable* argument is useful where you want to use an alternative class to the default :class:`MagicMock` for the created mock. For example, if you wanted a :class:`NonCallableMock` to be used::
pt_pt: O argumento *new_callable* é útil quando quer usar uma classe alternativa à :class:`MagicMock` predefinida para o mock criado. Por exemplo, se quiser que seja usado um :class:`NonCallableMock`::
ru: Аргумент *new_callable* полезен, если вы хотите использовать класс, альтернативный классу по умолчанию :class:`MagicMock` для созданного макета. Например, если вы хотите использовать :class:`NonCallableMock`::

source: >>> thing = object() >>> with patch('__main__.thing', new_callable=NonCallableMock) as mock_thing: ... assert thing is mock_thing ... thing() ... Traceback (most recent call last): ... TypeError: 'NonCallableMock' object is not callable
pt_pt: >>> coisa = object() >>> with patch('__main__.coisa', new_callable=NonCallableMock) as mock_coisa: ... assert coisa is mock_coisa ... coisa() ... Traceback (most recent call last): ... TypeError: o objeto 'NonCallableMock' não é chamável

source: Another use case might be to replace an object with an :class:`io.StringIO` instance::
pt_pt: Outro caso de uso pode ser substituir um objeto por uma instância :class:`io.StringIO`::
ru: Другим вариантом использования может быть замена объекта экземпляром :class:`io.StringIO`::

source: >>> from io import StringIO >>> def foo(): ... print('Something') ... >>> @patch('sys.stdout', new_callable=StringIO) ... def test(mock_stdout): ... foo() ... assert mock_stdout.getvalue() == 'Something\n' ... >>> test()
pt_pt: >>> from io import StringIO >>> def foo(): ... print('Algo') ... >>> @patch('sys.stdout', new_callable=StringIO) ... def test(mock_stdout): ... foo() ... assert mock_stdout.getvalue() == 'Algo\n' ... >>> test()

source: When :func:`patch` is creating a mock for you, it is common that the first thing you need to do is to configure the mock. Some of that configuration can be done in the call to patch. Any arbitrary keywords you pass into the call will be used to set attributes on the created mock::
pt_pt: Quando :func:`patch` está a criar um mock para si, é comum que a primeira coisa que precise de fazer seja configurar o mock. Alguma dessa configuração pode ser feita na chamada ao patch. Quaisquer palavras-chave arbitrárias que passar na chamada serão usadas para definir atributos no mock criado::
ru: Когда :func:`patch` создает для вас макет, обычно первое, что вам нужно сделать, — это настроить макет. Некоторые из этих настроек можно выполнить при вызове patch. Любые произвольные ключевые слова, которые вы передаете в вызов, будут использоваться для установки атрибутов созданного макета::

source: >>> patcher = patch('__main__.thing', first='one', second='two') >>> mock_thing = patcher.start() >>> mock_thing.first 'one' >>> mock_thing.second 'two'
pt_pt: >>> patcher = patch('__main__.coisa', primeiro='um', segundo='dois') >>> mock_coisa = patcher.start() >>> mock_coisa.primeiro 'um' >>> mock_coisa.segundo 'dois'

source: As well as attributes on the created mock attributes, like the :attr:`~Mock.return_value` and :attr:`~Mock.side_effect`, of child mocks can also be configured. These aren't syntactically valid to pass in directly as keyword arguments, but a dictionary with these as keys can still be expanded into a :func:`patch` call using ``**``::
pt_pt: Além de atributos nos atributos do mock criado, como :attr:`~Mock.return_value` e :attr:`~Mock.side_effect`, os atributos de mocks filhos também podem ser configurados. Estes não são sintaticamente válidos para passar diretamente como argumentos de palavra-chave, mas um dicionário com estas chaves ainda pode ser expandido numa chamada :func:`patch` usando ``**``::
ru: Помимо атрибутов созданных макетов, таких как :attr:`~Mock.return_value` и :attr:`~Mock.side_effect`, также можно настроить дочерние макеты. Они синтаксически недопустимы для прямой передачи в качестве аргументов ключевого слова, но словарь с ними в качестве ключей все равно можно расширить до вызова :func:`patch`, используя ``**``::

source: >>> config = {'method.return_value': 3, 'other.side_effect': KeyError} >>> patcher = patch('__main__.thing', **config) >>> mock_thing = patcher.start() >>> mock_thing.method() 3 >>> mock_thing.other() Traceback (most recent call last): ... KeyError
pt_pt: >>> config = {'metodo.return_value': 3, 'outro.side_effect': KeyError} >>> patcher = patch('__main__.coisa', **config) >>> mock_coisa = patcher.start() >>> mock_coisa.metodo() 3 >>> mock_coisa.outro() Traceback (most recent call last): ... KeyError
