Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/urllib.request.po
Languages: pt_pt, ru

source: :mod:`!urllib.request` --- Extensible library for opening URLs
pt_pt: :mod:`!urllib.request` --- Biblioteca extensível para abrir URLs

source: **Source code:** :source:`Lib/urllib/request.py`
pt_pt: **Código-fonte:** :source:`Lib/urllib/request.py`
ru: **Исходный код:** :source:`Lib/urllib/request.py`

source: The :mod:`urllib.request` module defines functions and classes which help in opening URLs (mostly HTTP) in a complex world --- basic and digest authentication, redirections, cookies and more.
pt_pt: O módulo :mod:`urllib.request` define funções e classes que ajudam a abrir URLs (principalmente HTTP) num ambiente complexo — autenticação básica e digest, redirecionamentos, cookies e mais.
ru: Модуль :mod:`urllib.request` определяет функции и классы, которые помогают открывать URL-адреса (в основном HTTP) в сложном мире — базовую и дайджест-аутентификацию, перенаправление, файлы cookie и многое другое.

source: The `Requests package <https://requests.readthedocs.io/en/master/>`_ is recommended for a higher-level HTTP client interface.
pt_pt: O pacote `Requests <https://requests.readthedocs.io/en/master/>`_ é recomendado para uma interface de cliente HTTP de nível superior.
ru: `Пакет Requests <https://requests.readthedocs.io/en/master/>`_ рекомендуется для клиентского интерфейса HTTP более высокого уровня.

source: On macOS it is unsafe to use this module in programs using :func:`os.fork` because the :func:`getproxies` implementation for macOS uses a higher-level system API. Set the environment variable ``no_proxy`` to ``*`` to avoid this problem (e.g. ``os.environ["no_proxy"] = "*"``).
pt_pt: No macOS, não é seguro usar este módulo em programas que usam :func:`os.fork` porque a implementação de :func:`getproxies` para macOS usa uma API de sistema de nível superior. Defina a variável de ambiente ``no_proxy`` para ``*`` para evitar este problema (por exemplo, ``os.environ["no_proxy"] = "*"``).

source: Availability
pt_pt: Disponibilidade

source: The :mod:`urllib.request` module defines the following functions:
pt_pt: O módulo :mod:`urllib.request` define as seguintes funções:
ru: Модуль :mod:`urllib.request` определяет следующие функции:

source: Open *url*, which can be either a string containing a valid, properly encoded URL, or a :class:`Request` object.
pt_pt: Abre *url*, que pode ser uma string contendo uma URL válida e corretamente codificada, ou um objeto :class:`Request`.

source: *data* must be an object specifying additional data to be sent to the server, or ``None`` if no such data is needed. See :class:`Request` for details.
pt_pt: *data* deve ser um objeto que especifica dados adicionais a serem enviados para o servidor, ou ``None`` se não forem necessários tais dados. Veja :class:`Request` para detalhes.
ru: *data* должен быть объектом, определяющим дополнительные данные, которые будут отправлены на сервер, или ``None``, если такие данные не требуются. Подробности смотрите в :class:`Request`.

source: urllib.request module uses HTTP/1.1 and includes ``Connection:close`` header in its HTTP requests.
pt_pt: O módulo urllib.request usa HTTP/1.1 e inclui o cabeçalho ``Connection:close`` nas suas requisições HTTP.
ru: Модуль urllib.request использует HTTP/1.1 и включает заголовок Connection: close в свои HTTP-запросы.

source: The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). This actually only works for HTTP, HTTPS and FTP connections.
pt_pt: O parâmetro opcional *timeout* especifica um tempo limite em segundos para operações de bloqueio como a tentativa de conexão (se não for especificado, a configuração de tempo limite global padrão será usada). Isto na verdade só funciona para conexões HTTP, HTTPS e FTP.
ru: Необязательный параметр *timeout* указывает тайм-аут в секундах для блокировки таких операций, как попытка подключения (если он не указан, будет использоваться глобальная настройка тайм-аута по умолчанию). На самом деле это работает только для соединений HTTP, HTTPS и FTP.

source: If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options. See :class:`~http.client.HTTPSConnection` for more details.
pt_pt: Se *context* for especificado, deve ser uma instância :class:`ssl.SSLContext` que descreve as várias opções SSL. Veja :class:`~http.client.HTTPSConnection` para mais detalhes.
ru: Если указан *context*, это должен быть экземпляр :class:`ssl.SSLContext`, описывающий различные параметры SSL. См. :class:`~http.client.HTTPSConnection` для более подробной информации.

source: This function always returns an object which can work as a :term:`context manager` and has the properties *url*, *headers*, and *status*. See :class:`urllib.response.addinfourl` for more detail on these properties.
pt_pt: Esta função sempre retorna um objeto que pode funcionar como um :term:`gestor de contexto` e tem as propriedades *url*, *headers* e *status*. Veja :class:`urllib.response.addinfourl` para mais detalhes sobre estas propriedades.
ru: Эта функция всегда возвращает объект, который может работать как контекстный менеджер и имеет свойства *url*, *headers* и *status*. См. :class:`urllib.response.addinourl` для получения более подробной информации об этих свойствах.

source: For HTTP and HTTPS URLs, this function returns a :class:`http.client.HTTPResponse` object slightly modified. In addition to the three new methods above, the msg attribute contains the same information as the :attr:`~http.client.HTTPResponse.reason` attribute --- the reason phrase returned by server --- instead of the response headers as it is specified in the documentation for :class:`~http.client.HTTPResponse`.
pt_pt: Para URLs HTTP e HTTPS, esta função retorna um objeto :class:`http.client.HTTPResponse` ligeiramente modificado. Além dos três novos métodos acima, o atributo msg contém a mesma informação que o atributo :attr:`~http.client.HTTPResponse.reason` — a frase de razão retornada pelo servidor — em vez dos cabeçalhos de resposta como está especificado na documentação para :class:`~http.client.HTTPResponse`.
ru: Для URL-адресов HTTP и HTTPS эта функция возвращает слегка измененный объект :class:`http.client.HTTPResponse`. В дополнение к трем новым методам, описанным выше, атрибут msg содержит ту же информацию, что и атрибут :attr:`~http.client.HTTPResponse.reason` --- фразу причины, возвращаемую сервером --- вместо заголовков ответа, как это указано в документации для :class:`~http.client.HTTPResponse`.

source: Raises :exc:`~urllib.error.URLError` on protocol errors.
pt_pt: Levanta :exc:`~urllib.error.URLError` em erros de protocolo.
ru: Вызывает :exc:`~urllib.error.URLError` при ошибках протокола.

source: Note that ``None`` may be returned if no handler handles the request (though the default installed global :class:`OpenerDirector` uses :class:`UnknownHandler` to ensure this never happens).
pt_pt: Note que ``None`` pode ser retornado se nenhum manipulador tratar a requisição (embora o :class:`OpenerDirector` global instalado por padrão use :class:`UnknownHandler` para garantir que isto nunca aconteça).
ru: Обратите внимание, что ``None`` может быть возвращено, если ни один обработчик не обрабатывает запрос (хотя установленный по умолчанию глобальный :class:`OpenerDirector` использует :class:`UnknownHandler`, чтобы гарантировать, что этого никогда не произойдет).

source: In addition, if proxy settings are detected (for example, when a ``*_proxy`` environment variable like :envvar:`!http_proxy` is set), :class:`ProxyHandler` is default installed and makes sure the requests are handled through the proxy.
pt_pt: Além disso, se as configurações de proxy forem detetadas (por exemplo, quando uma variável de ambiente ``*_proxy`` como :envvar:`!http_proxy` está definida), :class:`ProxyHandler` é instalado por padrão e garante que as requisições sejam tratadas através do proxy.

source: The legacy ``urllib.urlopen`` function from Python 2.6 and earlier has been discontinued; :func:`urllib.request.urlopen` corresponds to the old ``urllib2.urlopen``. Proxy handling, which was done by passing a dictionary parameter to ``urllib.urlopen``, can be obtained by using :class:`ProxyHandler` objects.
pt_pt: A função legada ``urllib.urlopen`` do Python 2.6 e anteriores foi descontinuada; :func:`urllib.request.urlopen` corresponde ao antigo ``urllib2.urlopen``. O tratamento de proxy, que era feito passando um parâmetro de dicionário para ``urllib.urlopen``, pode ser obtido usando objetos :class:`ProxyHandler`.
ru: Устаревшая функция urllib.urlopen из Python 2.6 и более ранних версий прекращена; :func:`urllib.request.urlopen` соответствует старому ``urllib2.urlopen``. Обработку прокси, которая выполнялась путем передачи параметра словаря в ``urllib.urlopen``, можно получить с помощью объектов :class:`ProxyHandler`.

source: The default opener raises an :ref:`auditing event <auditing>` ``urllib.Request`` with arguments ``fullurl``, ``data``, ``headers``, ``method`` taken from the request object.
pt_pt: O opener padrão levanta um :ref:`evento de auditoria <auditing>` ``urllib.Request`` com argumentos ``fullurl``, ``data``, ``headers``, ``method`` obtidos do objeto de requisição.
ru: Средство открытия по умолчанию вызывает событие аудита <auditing>` urllib.Request`` с аргументами ``fullurl``, ``data``, ``headers``, ``method``, взятыми из объект запроса.

source: *cafile* and *capath* were added.
pt_pt: Os parâmetros *cafile* e *capath* foram adicionados.
ru: Были добавлены *cafile* и *capath*.

source: HTTPS virtual hosts are now supported if possible (that is, if :const:`ssl.HAS_SNI` is true).
pt_pt: Os hosts virtuais HTTPS agora são suportados, se possível (ou seja, se :const:`ssl.HAS_SNI` for verdadeiro).

source: *data* can be an iterable object.
pt_pt: *data* pode ser um objeto iterável.
ru: *data* может быть итерируемым объектом.

source: *cadefault* was added.
pt_pt: O parâmetro *cadefault* foi adicionado.
ru: *cadedefault* был добавлен.

source: *context* was added.
pt_pt: O parâmetro *context* foi adicionado.
ru: *context* был добавлен.

source: HTTPS connection now send an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocols`.
pt_pt: A conexão HTTPS agora envia uma extensão ALPN com o indicador de protocolo ``http/1.1`` quando nenhum *context* é fornecido. O *context* personalizado deve definir protocolos ALPN com :meth:`~ssl.SSLContext.set_alpn_protocols`.

source: Install an :class:`OpenerDirector` instance as the default global opener. Installing an opener is only necessary if you want urlopen to use that opener; otherwise, simply call :meth:`OpenerDirector.open` instead of :func:`~urllib.request.urlopen`. The code does not check for a real :class:`OpenerDirector`, and any class with the appropriate interface will work.
pt_pt: Instala uma instância :class:`OpenerDirector` como o opener global padrão. A instalação de um opener só é necessária se quiser que o urlopen use esse opener; caso contrário, basta chamar :meth:`OpenerDirector.open` em vez de :func:`~urllib.request.urlopen`. O código não verifica se é um :class:`OpenerDirector` real, e qualquer classe com a interface apropriada funcionará.
ru: Установите экземпляр :class:`OpenerDirector` в качестве глобального средства открытия по умолчанию. Установка открывателя необходима только в том случае, если вы хотите, чтобы urlopen использовал этот открыватель; в противном случае просто вызовите :meth:`OpenerDirector.open` вместо :func:`~urllib.request.urlopen`. Код не проверяет настоящий :class:`OpenerDirector`, и любой класс с соответствующим интерфейсом будет работать.

source: Return an :class:`OpenerDirector` instance, which chains the handlers in the order given. *handler*\s can be either instances of :class:`BaseHandler`, or subclasses of :class:`BaseHandler` (in which case it must be possible to call the constructor without any parameters). Instances of the following classes will be in front of the *handler*\s, unless the *handler*\s contain them, instances of them or subclasses of them: :class:`ProxyHandler` (if proxy settings are detected), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.
pt_pt: Retorna uma instância :class:`OpenerDirector`, que encadeia os manipuladores na ordem dada. *handler*\s podem ser instâncias de :class:`BaseHandler`, ou subclasses de :class:`BaseHandler` (caso em que deve ser possível chamar o construtor sem quaisquer parâmetros). Instâncias das seguintes classes estarão à frente dos *handler*\s, a menos que os *handler*\s as contenham, instâncias delas ou subclasses delas: :class:`ProxyHandler` (se as configurações de proxy forem detetadas), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.
ru: Возвращает экземпляр :class:`OpenerDirector`, который связывает обработчики в указанном порядке. *handler*\s могут быть либо экземплярами :class:`BaseHandler`, либо подклассами :class:`BaseHandler` (в этом случае должна быть возможность вызвать конструктор без каких-либо параметров). Экземпляры следующих классов будут находиться перед *handler*\s, если *handler*\s не содержит их, их экземпляров или их подклассов: :class:`ProxyHandler` (если обнаружены настройки прокси), : class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.

source: If the Python installation has SSL support (i.e., if the :mod:`ssl` module can be imported), :class:`HTTPSHandler` will also be added.
pt_pt: Se a instalação do Python tiver suporte SSL (ou seja, se o módulo :mod:`ssl` puder ser importado), :class:`HTTPSHandler` também será adicionado.
ru: Если установка Python имеет поддержку SSL (т. е. если модуль :mod:`ssl` можно импортировать), :class:`HTTPSHandler` также будет добавлен.

source: A :class:`BaseHandler` subclass may also change its :attr:`handler_order` attribute to modify its position in the handlers list.
pt_pt: Uma subclasse :class:`BaseHandler` também pode alterar o seu atributo :attr:`handler_order` para modificar a sua posição na lista de manipuladores.
ru: Подкласс :class:`BaseHandler` также может изменить свой атрибут :attr:`handler_order`, чтобы изменить свою позицию в списке обработчиков.

source: This helper function returns a dictionary of scheme to proxy server URL mappings. It scans the environment for variables named ``<scheme>_proxy``, in a case insensitive approach, for all operating systems first, and when it cannot find it, looks for proxy information from System Configuration for macOS and Windows Systems Registry for Windows. If both lowercase and uppercase environment variables exist (and disagree), lowercase is preferred.
pt_pt: Esta função auxiliar retorna um dicionário de mapeamentos de esquema para URL do servidor proxy. Ela verifica o ambiente para variáveis nomeadas ``<scheme>_proxy``, de forma insensível a maiúsculas e minúsculas, primeiro para todos os sistemas operativos e, quando não a encontra, procura informações de proxy na Configuração do Sistema para macOS e no Registo do Sistema para Windows. Se existirem variáveis de ambiente em minúsculas e maiúsculas (e discordarem), as minúsculas são preferidas.
ru: Эта вспомогательная функция возвращает словарь схем для сопоставлений URL-адресов прокси-сервера. Он сканирует среду на наличие переменных с именем ``<scheme>_proxy``, используя подход без учета регистра, сначала для всех операционных систем, а когда не может их найти, ищет информацию о прокси-сервере в конфигурации системы для macOS и системном реестре Windows для Windows. . Если существуют переменные среды как в нижнем, так и в верхнем регистре (и не совпадают), предпочтительнее использовать строчные буквы.

source: If the environment variable ``REQUEST_METHOD`` is set, which usually indicates your script is running in a CGI environment, the environment variable ``HTTP_PROXY`` (uppercase ``_PROXY``) will be ignored. This is because that variable can be injected by a client using the "Proxy:" HTTP header. If you need to use an HTTP proxy in a CGI environment, either use ``ProxyHandler`` explicitly, or make sure the variable name is in lowercase (or at least the ``_proxy`` suffix).
pt_pt: Se a variável de ambiente ``REQUEST_METHOD`` estiver definida, o que geralmente indica que o seu script está a ser executado num ambiente CGI, a variável de ambiente ``HTTP_PROXY`` (maiúsculas ``_PROXY``) será ignorada. Isto porque essa variável pode ser injetada por um cliente usando o cabeçalho HTTP "Proxy:". Se precisar de usar um proxy HTTP num ambiente CGI, use explicitamente ``ProxyHandler``, ou certifique-se de que o nome da variável está em minúsculas (ou pelo menos o sufixo ``_proxy``).
ru: Если установлена ​​переменная среды REQUEST_METHOD, что обычно указывает на то, что ваш скрипт работает в среде CGI, переменная среды HTTP_PROXY (заглавные буквы _PROXY) будет игнорироваться. Это связано с тем, что эта переменная может быть введена клиентом с помощью HTTP-заголовка «Proxy:». Если вам нужно использовать HTTP-прокси в среде CGI, либо используйте ProxyHandler явно, либо убедитесь, что имя переменной написано строчными буквами (или, по крайней мере, суффиксом _proxy).

source: The following classes are provided:
pt_pt: As seguintes classes são fornecidas:
ru: Предусмотрены следующие занятия:

source: This class is an abstraction of a URL request.
pt_pt: Esta classe é uma abstração de um pedido de URL.
ru: Этот класс представляет собой абстракцию URL-запроса.

source: *url* should be a string containing a valid, properly encoded URL.
pt_pt: *url* deve ser uma string contendo uma URL válida e corretamente codificada.

source: *data* must be an object specifying additional data to send to the server, or ``None`` if no such data is needed. Currently HTTP requests are the only ones that use *data*. The supported object types include bytes, file-like objects, and iterables of bytes-like objects. If no ``Content-Length`` nor ``Transfer-Encoding`` header field has been provided, :class:`HTTPHandler` will set these headers according to the type of *data*. ``Content-Length`` will be used to send bytes objects, while ``Transfer-Encoding: chunked`` as specified in :rfc:`7230`, Section 3.3.1 will be used to send files and other iterables.
pt_pt: *data* deve ser um objeto que especifica dados adicionais a enviar para o servidor, ou ``None`` se não forem necessários tais dados. Atualmente, apenas os pedidos HTTP usam *data*. Os tipos de objetos suportados incluem bytes, objetos semelhantes a ficheiros e iteráveis de objetos semelhantes a bytes. Se nenhum campo de cabeçalho ``Content-Length`` ou ``Transfer-Encoding`` tiver sido fornecido, :class:`HTTPHandler` definirá estes cabeçalhos de acordo com o tipo de *data*. ``Content-Length`` será usado para enviar objetos de bytes, enquanto ``Transfer-Encoding: chunked``, conforme especificado em :rfc:`7230`, Secção 3.3.1, será usado para enviar ficheiros e outros iteráveis.
ru: *data* должен быть объектом, определяющим дополнительные данные для отправки на сервер, или ``None``, если такие данные не нужны. В настоящее время HTTP-запросы — единственные, которые используют *данные*. Поддерживаемые типы объектов включают байты, файловоподобные объекты и итерации байтоподобных объектов. Если поле заголовка Content-Length или Transfer-Encoding не указано, :class:HTTPHandler установит эти заголовки в соответствии с типом *данных*. ``Content-Length`` будет использоваться для отправки байтовых объектов, а ``Transfer-Encoding: chunked``, как указано в :rfc:`7230`, раздел 3.3.1, будет использоваться для отправки файлов и других итераций.

source: For an HTTP POST request method, *data* should be a buffer in the standard :mimetype:`application/x-www-form-urlencoded` format. The :func:`urllib.parse.urlencode` function takes a mapping or sequence of 2-tuples and returns an ASCII string in this format. It should be encoded to bytes before being used as the *data* parameter.
pt_pt: Para um método de pedido HTTP POST, *data* deve ser um buffer no formato padrão :mimetype:`application/x-www-form-urlencoded`. A função :func:`urllib.parse.urlencode` recebe um mapeamento ou sequência de 2-tuplos e retorna uma string ASCII neste formato. Deve ser codificada para bytes antes de ser usada como o parâmetro *data*.
ru: Для метода запроса HTTP POST *data* должен быть буфером в стандартном формате :mimetype:`application/x-www-form-urlencoded`. Функция :func:`urllib.parse.urlencode` принимает отображение или последовательность двух кортежей и возвращает строку ASCII в этом формате. Прежде чем использовать его в качестве параметра *data*, его следует закодировать в байтах.

source: *headers* should be a dictionary, and will be treated as if :meth:`add_header` was called with each key and value as arguments. This is often used to "spoof" the ``User-Agent`` header value, which is used by a browser to identify itself -- some HTTP servers only allow requests coming from common browsers as opposed to scripts. For example, Mozilla Firefox may identify itself as ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, while :mod:`urllib`'s default user agent string is ``"Python-urllib/2.6"`` (on Python 2.6). All header keys are sent in camel case.
pt_pt: *headers* deve ser um dicionário e será tratado como se :meth:`add_header` fosse chamado com cada chave e valor como argumentos. Isto é frequentemente usado para "falsificar" o valor do cabeçalho ``User-Agent``, que é usado por um navegador para se identificar — alguns servidores HTTP só permitem pedidos provenientes de navegadores comuns em oposição a scripts. Por exemplo, o Mozilla Firefox pode identificar-se como ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, enquanto a string de agente de utilizador predefinida do :mod:`urllib` é ``"Python-urllib/2.6"`` (no Python 2.6). Todas as chaves de cabeçalho são enviadas em camel case.
ru: *headers* должен быть словарем и будет обрабатываться так, как если бы :meth:`add_header` был вызван с каждым ключом и значением в качестве аргументов. Это часто используется для «подмены» значения заголовка «User-Agent», которое используется браузером для идентификации — некоторые HTTP-серверы разрешают запросы, поступающие только от обычных браузеров, а не от сценариев. Например, Mozilla Firefox может идентифицировать себя как ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, в то время как строка пользовательского агента по умолчанию для :mod:`urllib` равна `` `"Python-urllib/2.6"`` (на Python 2.6). Все ключи заголовков отправляются в верблюжьем футляре.

source: An appropriate ``Content-Type`` header should be included if the *data* argument is present. If this header has not been provided and *data* is not ``None``, ``Content-Type: application/x-www-form-urlencoded`` will be added as a default.
pt_pt: Um cabeçalho ``Content-Type`` apropriado deve ser incluído se o argumento *data* estiver presente. Se este cabeçalho não tiver sido fornecido e *data* não for ``None``, ``Content-Type: application/x-www-form-urlencoded`` será adicionado como padrão.
