Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/urllib.request.po
Languages: pt_pt, ru

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should override it if they intend to provide a catch-all for otherwise unhandled HTTP errors. It will be called automatically by the :class:`OpenerDirector` getting the error, and should not normally be called in other circumstances.
pt_pt: Este método *não* está definido em :class:`BaseHandler`, mas as subclasses devem substituí-lo se pretenderem fornecer um mecanismo abrangente para erros HTTP não tratados. Será chamado automaticamente pelo :class:`OpenerDirector` ao obter o erro e não deve ser chamado normalmente noutras circunstâncias.
ru: Этот метод *не* определен в :class:`BaseHandler`, но подклассы должны переопределять его, если они намерены обеспечить комплексный подход к необработанным в противном случае ошибкам HTTP. Он будет вызван автоматически :class:`OpenerDirector`, получившим ошибку, и обычно его не следует вызывать в других обстоятельствах.

source: Return values and exceptions raised should be the same as those of :func:`urlopen`.
pt_pt: Os valores de retorno e exceções levantadas devem ser os mesmos que os de :func:`urlopen`.
ru: Возвращаемые значения и возникающие исключения должны быть такими же, как у :func:`urlopen`.

source: *nnn* should be a three-digit HTTP error code. This method is also not defined in :class:`BaseHandler`, but will be called, if it exists, on an instance of a subclass, when an HTTP error with code *nnn* occurs.
pt_pt: *nnn* deve ser um código de erro HTTP de três dígitos. Este método também não está definido em :class:`BaseHandler`, mas será chamado, se existir, numa instância de uma subclasse, quando ocorrer um erro HTTP com o código *nnn*.
ru: *nnn* должен быть трехзначным кодом ошибки HTTP. Этот метод также не определен в :class:`BaseHandler`, но будет вызываться, если он существует, в экземпляре подкласса, когда возникает ошибка HTTP с кодом *nnn*.

source: Subclasses should override this method to handle specific HTTP errors.
pt_pt: As subclasses devem substituir este método para tratar erros HTTP específicos.
ru: Подклассы должны переопределять этот метод для обработки определенных ошибок HTTP.

source: Arguments, return values and exceptions raised should be the same as for :meth:`~BaseHandler.http_error_default`.
pt_pt: Os argumentos, valores de retorno e exceções levantadas devem ser os mesmos que para :meth:`~BaseHandler.http_error_default`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to pre-process requests of the given protocol.
pt_pt: Este método *não* está definido em :class:`BaseHandler`, mas as subclasses devem defini-lo se quiserem pré-processar pedidos do protocolo dado.
ru: Этот метод *не* определен в :class:`BaseHandler`, но подклассы должны определять его, если они хотят предварительно обрабатывать запросы данного протокола.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. The return value should be a :class:`Request` object.
pt_pt: Este método, se definido, será chamado pelo :class:`OpenerDirector` pai. *req* será um objeto :class:`Request`. O valor de retorno deve ser um objeto :class:`Request`.
ru: Этот метод, если он определен, будет вызываться родительским :class:`OpenerDirector`. *req* будет объектом :class:`Request`. Возвращаемое значение должно быть объектом :class:`Request`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to post-process responses of the given protocol.
pt_pt: Este método *não* está definido em :class:`BaseHandler`, mas as subclasses devem defini-lo se quiserem pós-processar respostas do protocolo dado.
ru: Этот метод *не* определен в :class:`BaseHandler`, но подклассы должны определять его, если они хотят постобрабатывать ответы данного протокола.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. *response* will be an object implementing the same interface as the return value of :func:`urlopen`. The return value should implement the same interface as the return value of :func:`urlopen`.
pt_pt: Este método, se definido, será chamado pelo :class:`OpenerDirector` pai. *req* será um objeto :class:`Request`. *response* será um objeto que implementa a mesma interface que o valor de retorno de :func:`urlopen`. O valor de retorno deve implementar a mesma interface que o valor de retorno de :func:`urlopen`.
ru: Этот метод, если он определен, будет вызываться родительским :class:`OpenerDirector`. *req* будет объектом :class:`Request`. *response* будет объектом, реализующим тот же интерфейс, что и возвращаемое значение :func:`urlopen`. Возвращаемое значение должно реализовывать тот же интерфейс, что и возвращаемое значение :func:`urlopen`.

source: HTTPRedirectHandler Objects
pt_pt: Objetos HTTPRedirectHandler
ru: Объекты HTTPRedirectHandler

source: Some HTTP redirections require action from this module's client code. If this is the case, :exc:`~urllib.error.HTTPError` is raised. See :rfc:`2616` for details of the precise meanings of the various redirection codes.
pt_pt: Alguns redirecionamentos HTTP requerem ação do código cliente deste módulo. Se este for o caso, :exc:`~urllib.error.HTTPError` é levantado. Veja :rfc:`2616` para detalhes sobre os significados precisos dos vários códigos de redirecionamento.
ru: Некоторые перенаправления HTTP требуют действий со стороны клиентского кода этого модуля. В этом случае возникает :exc:`~urllib.error.HTTPError`. См. :rfc:`2616` для получения подробной информации о точном значении различных кодов перенаправления.

source: An :exc:`~urllib.error.HTTPError` exception raised as a security consideration if the HTTPRedirectHandler is presented with a redirected URL which is not an HTTP, HTTPS or FTP URL.
pt_pt: Uma exceção :exc:`~urllib.error.HTTPError` levantada como uma consideração de segurança se o HTTPRedirectHandler for apresentado com uma URL redirecionada que não seja uma URL HTTP, HTTPS ou FTP.

source: Return a :class:`Request` or ``None`` in response to a redirect. This is called by the default implementations of the :meth:`!http_error_30\*` methods when a redirection is received from the server. If a redirection should take place, return a new :class:`Request` to allow :meth:`!http_error_30\*` to perform the redirect to *newurl*. Otherwise, raise :exc:`~urllib.error.HTTPError` if no other handler should try to handle this URL, or return ``None`` if you can't but another handler might.
pt_pt: Retorna um :class:`Request` ou ``None`` em resposta a um redirecionamento. Isto é chamado pelas implementações predefinidas dos métodos :meth:`!http_error_30\*` quando um redirecionamento é recebido do servidor. Se um redirecionamento deve ocorrer, retorna um novo :class:`Request` para permitir que :meth:`!http_error_30\*` execute o redirecionamento para *newurl*. Caso contrário, levanta :exc:`~urllib.error.HTTPError` se nenhum outro manipulador deve tentar tratar esta URL, ou retorna ``None`` se não puder, mas outro manipulador possa.

source: The default implementation of this method does not strictly follow :rfc:`2616`, which says that 301 and 302 responses to ``POST`` requests must not be automatically redirected without confirmation by the user. In reality, browsers do allow automatic redirection of these responses, changing the POST to a ``GET``, and the default implementation reproduces this behavior.
pt_pt: A implementação predefinida deste método não segue estritamente :rfc:`2616`, que diz que as respostas 301 e 302 a pedidos ``POST`` não devem ser redirecionadas automaticamente sem confirmação do utilizador. Na realidade, os navegadores permitem o redirecionamento automático destas respostas, alterando o POST para um ``GET``, e a implementação predefinida reproduz este comportamento.
ru: Реализация этого метода по умолчанию не строго соответствует :rfc:`2616`, в котором говорится, что ответы 301 и 302 на запросы POST не должны автоматически перенаправляться без подтверждения пользователя. На самом деле браузеры допускают автоматическое перенаправление этих ответов, заменяя POST на GET, и реализация по умолчанию воспроизводит это поведение.

source: Redirect to the ``Location:`` or ``URI:`` URL. This method is called by the parent :class:`OpenerDirector` when getting an HTTP 'moved permanently' response.
pt_pt: Redireciona para a URL ``Location:`` ou ``URI:``. Este método é chamado pelo :class:`OpenerDirector` pai ao receber uma resposta HTTP 'moved permanently'.
ru: Перенаправление на URL-адрес ``Location:`` или ``URI:``. Этот метод вызывается родительским классом OpenerDirector при получении HTTP-ответа «перемещено навсегда».

source: The same as :meth:`http_error_301`, but called for the 'found' response.
pt_pt: O mesmo que :meth:`http_error_301`, mas chamado para a resposta 'found'.
ru: То же, что и :meth:`http_error_301`, но вызывает ответ «найден».

source: The same as :meth:`http_error_301`, but called for the 'see other' response.
pt_pt: O mesmo que :meth:`http_error_301`, mas chamado para a resposta 'see other'.
ru: То же, что и :meth:`http_error_301`, но требует ответа «посмотреть другое».

source: The same as :meth:`http_error_301`, but called for the 'temporary redirect' response. It does not allow changing the request method from ``POST`` to ``GET``.
pt_pt: O mesmo que :meth:`http_error_301`, mas chamado para a resposta 'temporary redirect'. Não permite alterar o método de pedido de ``POST`` para ``GET``.

source: The same as :meth:`http_error_301`, but called for the 'permanent redirect' response. It does not allow changing the request method from ``POST`` to ``GET``.
pt_pt: O mesmo que :meth:`http_error_301`, mas chamado para a resposta 'permanent redirect'. Não permite alterar o método de pedido de ``POST`` para ``GET``.

source: HTTPCookieProcessor Objects
pt_pt: Objetos HTTPCookieProcessor
ru: Объекты HTTPCookieProcessor

source: :class:`HTTPCookieProcessor` instances have one attribute:
pt_pt: As instâncias :class:`HTTPCookieProcessor` têm um atributo:
ru: Экземпляры :class:`HTTPCookieProcessor` имеют один атрибут:

source: The :class:`http.cookiejar.CookieJar` in which cookies are stored.
pt_pt: O :class:`http.cookiejar.CookieJar` onde os cookies são armazenados.
ru: :class:`http.cookiejar.CookieJar`, в котором хранятся файлы cookie.

source: ProxyHandler Objects
pt_pt: Objetos ProxyHandler
ru: Объекты ProxyHandler

source: The :class:`ProxyHandler` will have a method :meth:`!<protocol>_open` for every *protocol* which has a proxy in the *proxies* dictionary given in the constructor. The method will modify requests to go through the proxy, by calling ``request.set_proxy()``, and call the next handler in the chain to actually execute the protocol.
pt_pt: O :class:`ProxyHandler` terá um método :meth:`!<protocol>_open` para cada *protocol* que tenha um proxy no dicionário *proxies* fornecido no construtor. O método modificará os pedidos para passar pelo proxy, chamando ``request.set_proxy()``, e chamará o próximo manipulador na cadeia para executar efetivamente o protocolo.

source: HTTPPasswordMgr Objects
pt_pt: Objetos HTTPPasswordMgr
ru: Объекты HTTPPasswordMgr

source: These methods are available on :class:`HTTPPasswordMgr` and :class:`HTTPPasswordMgrWithDefaultRealm` objects.
pt_pt: Estes métodos estão disponíveis em objetos :class:`HTTPPasswordMgr` e :class:`HTTPPasswordMgrWithDefaultRealm`.
ru: Эти методы доступны для объектов :class:`HTTPPasswordMgr` и :class:`HTTPPasswordMgrWithDefaultRealm`.

source: *uri* can be either a single URI, or a sequence of URIs. *realm*, *user* and *passwd* must be strings. This causes ``(user, passwd)`` to be used as authentication tokens when authentication for *realm* and a super-URI of any of the given URIs is given.
pt_pt: *uri* pode ser um único URI ou uma sequência de URIs. *realm*, *user* e *passwd* devem ser strings. Isto faz com que ``(user, passwd)`` seja usado como tokens de autenticação quando a autenticação para *realm* e um super-URI de qualquer um dos URIs dados for fornecida.
ru: *uri* может быть либо одним URI, либо последовательностью URI. *realm*, *user* и *passwd* должны быть строками. Это приводит к использованию ``(user, passwd)`` в качестве токенов аутентификации при аутентификации для *realm* и супер-URI любого из заданных URI.

source: Get user/password for given realm and URI, if any. This method will return ``(None, None)`` if there is no matching user/password.
pt_pt: Obtém utilizador/senha para o realm e URI dados, se existir. Este método retornará ``(None, None)`` se não houver um utilizador/senha correspondente.
ru: Получите пользователя/пароль для данной области и URI, если таковой имеется. Этот метод вернет ``(None, None)``, если нет подходящего пользователя/пароля.

source: For :class:`HTTPPasswordMgrWithDefaultRealm` objects, the realm ``None`` will be searched if the given *realm* has no matching user/password.
pt_pt: Para objetos :class:`HTTPPasswordMgrWithDefaultRealm`, o realm ``None`` será procurado se o *realm* dado não tiver um utilizador/senha correspondente.
ru: Для объектов :class:`HTTPPasswordMgrWithDefaultRealm` будет выполняться поиск в области ``None``, если в данной *области* нет соответствующего пользователя/пароля.

source: HTTPPasswordMgrWithPriorAuth Objects
pt_pt: Objetos HTTPPasswordMgrWithPriorAuth
ru: Объекты HTTPPasswordMgrWithPriorAuth

source: This password manager extends :class:`HTTPPasswordMgrWithDefaultRealm` to support tracking URIs for which authentication credentials should always be sent.
pt_pt: Este gestor de senhas estende :class:`HTTPPasswordMgrWithDefaultRealm` para suportar o rastreamento de URIs para os quais as credenciais de autenticação devem sempre ser enviadas.
ru: Этот менеджер паролей расширяет :class:`HTTPPasswordMgrWithDefaultRealm` для поддержки отслеживания URI, для которых всегда должны отправляться учетные данные аутентификации.

source: *realm*, *uri*, *user*, *passwd* are as for :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* sets the initial value of the ``is_authenticated`` flag for the given URI or list of URIs. If *is_authenticated* is specified as ``True``, *realm* is ignored.
pt_pt: *realm*, *uri*, *user*, *passwd* são como em :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* define o valor inicial da flag ``is_authenticated`` para o URI ou lista de URIs dados. Se *is_authenticated* for especificado como ``True``, *realm* é ignorado.
ru: *realm*, *uri*, *user*, *passwd* аналогичны :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* устанавливает начальное значение флага is_authenticated для данного URI или списка URI. Если для *is_authenticated* указано ``True``, *realm* игнорируется.

source: Same as for :class:`HTTPPasswordMgrWithDefaultRealm` objects
pt_pt: Igual aos objetos :class:`HTTPPasswordMgrWithDefaultRealm`
ru: То же, что и для объектов :class:`HTTPPasswordMgrWithDefaultRealm`

source: Update the ``is_authenticated`` flag for the given *uri* or list of URIs.
pt_pt: Atualiza a flag ``is_authenticated`` para o *uri* dado ou lista de URIs.
ru: Обновите флаг is_authenticated для данного *uri* или списка URI.

source: Returns the current state of the ``is_authenticated`` flag for the given URI.
pt_pt: Retorna o estado atual da flag ``is_authenticated`` para o URI dado.
ru: Возвращает текущее состояние флага is_authenticated для данного URI.

source: AbstractBasicAuthHandler Objects
pt_pt: Objetos AbstractBasicAuthHandler
ru: Объекты AbstractBasicAuthHandler

source: Handle an authentication request by getting a user/password pair, and re-trying the request. *authreq* should be the name of the header where the information about the realm is included in the request, *host* specifies the URL and path to authenticate for, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
pt_pt: Trata um pedido de autenticação obtendo um par utilizador/senha e re-tentando o pedido. *authreq* deve ser o nome do cabeçalho onde a informação sobre o realm está incluída no pedido, *host* especifica a URL e o caminho para autenticar, *req* deve ser o objeto :class:`Request` (falhado), e *headers* deve ser os cabeçalhos de erro.
ru: Обработайте запрос аутентификации, получив пару пользователь/пароль и повторив запрос. *authreq* должно быть именем заголовка, в котором в запрос включена информация о области, *host* указывает URL-адрес и путь для аутентификации, *req* должен быть (неудачным) объектом :class:`Request` , а *headers* должны быть заголовками ошибок.

source: *host* is either an authority (e.g. ``"python.org"``) or a URL containing an authority component (e.g. ``"http://python.org/"``). In either case, the authority must not contain a userinfo component (so, ``"python.org"`` and ``"python.org:80"`` are fine, ``"joe:password@python.org"`` is not).
pt_pt: *host* é uma autoridade (por exemplo, ``"python.org"``) ou uma URL contendo um componente de autoridade (por exemplo, ``"http://python.org/"``). Em qualquer caso, a autoridade não deve conter um componente userinfo (portanto, ``"python.org"`` e ``"python.org:80"`` estão corretos, mas ``"joe:password@python.org"`` não está).
ru: *host* — это либо авторитет (например, ``"python.org"``), либо URL-адрес, содержащий компонент авторитета (например, ``"http://python.org/"``). В любом случае полномочия не должны содержать компонент userinfo (поэтому ``"python.org"`` и ``"python.org:80"`` подходят, ``"joe:password@python.org" `` нет).

source: HTTPBasicAuthHandler Objects
pt_pt: Objetos HTTPBasicAuthHandler
ru: Объекты HTTPBasicAuthHandler

source: Retry the request with authentication information, if available.
pt_pt: Repete o pedido com informações de autenticação, se disponíveis.
ru: Повторите запрос, указав данные аутентификации, если они доступны.

source: ProxyBasicAuthHandler Objects
pt_pt: Objetos ProxyBasicAuthHandler
ru: Объекты ProxyBasicAuthHandler

source: AbstractDigestAuthHandler Objects
pt_pt: Objetos AbstractDigestAuthHandler
ru: Объекты AbstractDigestAuthHandler

source: *authreq* should be the name of the header where the information about the realm is included in the request, *host* should be the host to authenticate to, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
pt_pt: *authreq* deve ser o nome do cabeçalho onde a informação sobre o realm está incluída no pedido, *host* deve ser o host para autenticar, *req* deve ser o objeto :class:`Request` (falhado), e *headers* deve ser os cabeçalhos de erro.
ru: *authreq* должно быть именем заголовка, в который в запрос включена информация о области, *host* должен быть хостом для аутентификации, *req* должен быть (неудачным) объектом :class:`Request`, и *headers* должны быть заголовками ошибок.

source: HTTPDigestAuthHandler Objects
pt_pt: Objetos HTTPDigestAuthHandler
ru: Объекты HTTPDigestAuthHandler

source: ProxyDigestAuthHandler Objects
pt_pt: Objetos ProxyDigestAuthHandler
ru: Объекты ProxyDigestAuthHandler

source: HTTPHandler Objects
pt_pt: Objetos HTTPHandler
ru: Объекты HTTPHandler

source: HTTPSHandler Objects
pt_pt: Objetos HTTPSHandler
ru: Объекты HTTPSHandler

source: FileHandler Objects
pt_pt: Objetos FileHandler
ru: Объекты FileHandler

source: Open the file locally, if there is no host name, or the host name is ``'localhost'``.
pt_pt: Abre o ficheiro localmente, se não houver nome de host ou se o nome de host for ``'localhost'``.
ru: Откройте файл локально, если имя хоста отсутствует или имя хоста ``'localhost'``.

source: This method is applicable only for local hostnames. When a remote hostname is given, a :exc:`~urllib.error.URLError` is raised.
pt_pt: Este método é aplicável apenas para nomes de host locais. Quando um nome de host remoto é fornecido, uma exceção :exc:`~urllib.error.URLError` é levantada.

source: DataHandler Objects
pt_pt: Objetos DataHandler
ru: Объекты DataHandler

source: Read a data URL. This kind of URL contains the content encoded in the URL itself. The data URL syntax is specified in :rfc:`2397`. This implementation ignores white spaces in base64 encoded data URLs so the URL may be wrapped in whatever source file it comes from. But even though some browsers don't mind about a missing padding at the end of a base64 encoded data URL, this implementation will raise a :exc:`ValueError` in that case.
pt_pt: Lê uma URL de dados. Este tipo de URL contém o conteúdo codificado na própria URL. A sintaxe da URL de dados é especificada em :rfc:`2397`. Esta implementação ignora espaços em branco em URLs de dados codificados em base64, de modo que a URL pode ser quebrada no ficheiro de origem de onde provém. Embora alguns navegadores não se importem com a falta de preenchimento no final de uma URL de dados codificada em base64, esta implementação levantará uma :exc:`ValueError` nesse caso.

source: FTPHandler Objects
pt_pt: Objetos FTPHandler
ru: Объекты FTPHandler

source: Open the FTP file indicated by *req*. The login is always done with empty username and password.
pt_pt: Abre o ficheiro FTP indicado por *req*. O login é sempre feito com nome de utilizador e senha vazios.
ru: Откройте FTP-файл, указанный *req*. Вход всегда осуществляется с пустым именем пользователя и паролем.

source: CacheFTPHandler Objects
pt_pt: Objetos CacheFTPHandler
ru: Объекты CacheFTPHandler

source: :class:`CacheFTPHandler` objects are :class:`FTPHandler` objects with the following additional methods:
pt_pt: Os objetos :class:`CacheFTPHandler` são objetos :class:`FTPHandler` com os seguintes métodos adicionais:
ru: Объекты :class:`CacheFTPHandler` — это объекты :class:`FTPHandler` со следующими дополнительными методами:

source: Set timeout of connections to *t* seconds.
pt_pt: Define o tempo limite das conexões para *t* segundos.
ru: Установите таймаут соединений на *t* секунд.

source: Set maximum number of cached connections to *m*.
pt_pt: Define o número máximo de conexões em cache para *m*.
ru: Установите максимальное количество кэшированных соединений на *m*.

source: UnknownHandler Objects
pt_pt: Objetos UnknownHandler
ru: Объекты UnknownHandler

source: Raise a :exc:`~urllib.error.URLError` exception.
pt_pt: Levanta uma exceção :exc:`~urllib.error.URLError`.
ru: Вызовите исключение :exc:`~urllib.error.URLError`.

source: HTTPErrorProcessor Objects
pt_pt: Objetos HTTPErrorProcessor
ru: Объекты HTTPErrorProcessor

source: For 200 error codes, the response object is returned immediately.
pt_pt: Para códigos de erro 200, o objeto de resposta é retornado imediatamente.
ru: Для 200 кодов ошибок объект ответа возвращается немедленно.

source: For non-200 error codes, this simply passes the job on to the :meth:`!http_error_\<type\>` handler methods, via :meth:`OpenerDirector.error`. Eventually, :class:`HTTPDefaultErrorHandler` will raise an :exc:`~urllib.error.HTTPError` if no other handler handles the error.
pt_pt: Para códigos de erro não-200, isto simplesmente passa a tarefa para os métodos de manipulador :meth:`!http_error_\<type\>`, através de :meth:`OpenerDirector.error`. Eventualmente, :class:`HTTPDefaultErrorHandler` levantará uma exceção :exc:`~urllib.error.HTTPError` se nenhum outro manipulador tratar o erro.

source: Process HTTPS error responses.
pt_pt: Processa respostas de erro HTTPS.
ru: Обработка ответов об ошибках HTTPS.

source: The behavior is same as :meth:`http_response`.
pt_pt: O comportamento é o mesmo que :meth:`http_response`.
ru: Поведение такое же, как у :meth:`http_response`.

source: Examples
pt_pt: Exemplos
ru: Примеры
