Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/urllib.request.po
Languages: pt_pt, ru

source: The next two arguments are only of interest for correct handling of third-party HTTP cookies:
pt_pt: Os próximos dois argumentos são apenas de interesse para o tratamento correto de cookies HTTP de terceiros:
ru: Следующие два аргумента интересны только для правильной обработки сторонних файлов cookie HTTP:

source: *origin_req_host* should be the request-host of the origin transaction, as defined by :rfc:`2965`. It defaults to ``http.cookiejar.request_host(self)``. This is the host name or IP address of the original request that was initiated by the user. For example, if the request is for an image in an HTML document, this should be the request-host of the request for the page containing the image.
pt_pt: *origin_req_host* deve ser o request-host da transação de origem, conforme definido por :rfc:`2965`. O valor predefinido é ``http.cookiejar.request_host(self)``. Este é o nome do host ou endereço IP do pedido original que foi iniciado pelo utilizador. Por exemplo, se o pedido for para uma imagem num documento HTML, este deve ser o request-host do pedido para a página que contém a imagem.
ru: *origin_req_host* должен быть хостом запроса исходной транзакции, как определено в :rfc:`2965`. По умолчанию используется ``http.cookiejar.request_host(self)``. Это имя хоста или IP-адрес исходного запроса, инициированного пользователем. Например, если запрос касается изображения в HTML-документе, это должен быть хост запроса страницы, содержащей изображение.

source: *unverifiable* should indicate whether the request is unverifiable, as defined by :rfc:`2965`. It defaults to ``False``. An unverifiable request is one whose URL the user did not have the option to approve. For example, if the request is for an image in an HTML document, and the user had no option to approve the automatic fetching of the image, this should be true.
pt_pt: *unverifiable* deve indicar se o pedido é não verificável, conforme definido por :rfc:`2965`. O valor predefinido é ``False``. Um pedido não verificável é aquele cuja URL o utilizador não teve a opção de aprovar. Por exemplo, se o pedido for para uma imagem num documento HTML, e o utilizador não teve a opção de aprovar a obtenção automática da imagem, isto deve ser verdadeiro.
ru: *unverifying* должен указывать, является ли запрос непроверяемым, как определено в :rfc:`2965`. По умолчанию установлено значение «False». Непроверяемый запрос — это запрос, URL-адрес которого пользователь не смог одобрить. Например, если запрос касается изображения в HTML-документе, и у пользователя не было возможности одобрить автоматическое получение изображения, это должно быть правдой.

source: *method* should be a string that indicates the HTTP request method that will be used (e.g. ``'HEAD'``). If provided, its value is stored in the :attr:`~Request.method` attribute and is used by :meth:`get_method`. The default is ``'GET'`` if *data* is ``None`` or ``'POST'`` otherwise. Subclasses may indicate a different default method by setting the :attr:`~Request.method` attribute in the class itself.
pt_pt: *method* deve ser uma string que indica o método de pedido HTTP que será usado (por exemplo, ``'HEAD'``). Se fornecido, o seu valor é armazenado no atributo :attr:`~Request.method` e é usado por :meth:`get_method`. O valor predefinido é ``'GET'`` se *data* for ``None`` ou ``'POST'`` caso contrário. Subclasses podem indicar um método predefinido diferente definindo o atributo :attr:`~Request.method` na própria classe.

source: The request will not work as expected if the data object is unable to deliver its content more than once (e.g. a file or an iterable that can produce the content only once) and the request is retried for HTTP redirects or authentication. The *data* is sent to the HTTP server right away after the headers. There is no support for a 100-continue expectation in the library.
pt_pt: O pedido não funcionará como esperado se o objeto de dados não puder fornecer o seu conteúdo mais do que uma vez (por exemplo, um ficheiro ou um iterável que só pode produzir o conteúdo uma vez) e o pedido for repetido para redirecionamentos HTTP ou autenticação. Os *data* são enviados para o servidor HTTP imediatamente após os cabeçalhos. Não há suporte para uma expectativa de 100-continue na biblioteca.
ru: Запрос не будет работать должным образом, если объект данных не может доставить свое содержимое более одного раза (например, файл или итерируемый объект, который может создать содержимое только один раз), и запрос повторяется для перенаправления HTTP или аутентификации. *Данные* отправляются на HTTP-сервер сразу после заголовков. В библиотеке нет поддержки ожидания 100 продолжений.

source: :attr:`Request.method` argument is added to the Request class.
pt_pt: O argumento :attr:`Request.method` foi adicionado à classe Request.
ru: :attr:`Аргумент Request.method` добавляется в класс Request.

source: Default :attr:`Request.method` may be indicated at the class level.
pt_pt: O :attr:`Request.method` predefinido pode ser indicado ao nível da classe.
ru: По умолчанию :attr:`Request.method` может быть указан на уровне класса.

source: Do not raise an error if the ``Content-Length`` has not been provided and *data* is neither ``None`` nor a bytes object. Fall back to use chunked transfer encoding instead.
pt_pt: Não levante um erro se o ``Content-Length`` não tiver sido fornecido e *data* não for ``None`` nem um objeto de bytes. Em vez disso, recorra à codificação de transferência em blocos.
ru: Не выдавайте ошибку, если ``Content-Length`` не был предоставлен и *data* не является ни ``None``, ни байтовым объектом. Вместо этого вернитесь к использованию фрагментированного кодирования передачи.

source: The :class:`OpenerDirector` class opens URLs via :class:`BaseHandler`\ s chained together. It manages the chaining of handlers, and recovery from errors.
pt_pt: A classe :class:`OpenerDirector` abre URLs através de :class:`BaseHandler`\s encadeados. Ela gere o encadeamento dos manipuladores e a recuperação de erros.
ru: Класс :class:`OpenerDirector` открывает URL-адреса через :class:`BaseHandler`\, связанные вместе. Он управляет цепочкой обработчиков и восстановлением после ошибок.

source: This is the base class for all registered handlers --- and handles only the simple mechanics of registration.
pt_pt: Esta é a classe base para todos os manipuladores registados — e trata apenas da mecânica simples de registo.
ru: Это базовый класс для всех зарегистрированных обработчиков, который обрабатывает только простой механизм регистрации.

source: A class which defines a default handler for HTTP error responses; all responses are turned into :exc:`~urllib.error.HTTPError` exceptions.
pt_pt: Uma classe que define um manipulador predefinido para respostas de erro HTTP; todas as respostas são convertidas em exceções :exc:`~urllib.error.HTTPError`.
ru: Класс, который определяет обработчик по умолчанию для ответов об ошибках HTTP; все ответы преобразуются в исключения :exc:`~urllib.error.HTTPError`.

source: A class to handle redirections.
pt_pt: Uma classe para tratar redirecionamentos.
ru: Класс для обработки перенаправлений.

source: A class to handle HTTP Cookies.
pt_pt: Uma classe para tratar cookies HTTP.
ru: Класс для обработки файлов cookie HTTP.

source: Cause requests to go through a proxy. If *proxies* is given, it must be a dictionary mapping protocol names to URLs of proxies. The default is to read the list of proxies from the environment variables ``<protocol>_proxy``. If no proxy environment variables are set, then in a Windows environment proxy settings are obtained from the registry's Internet Settings section, and in a macOS environment proxy information is retrieved from the System Configuration Framework.
pt_pt: Faz com que os pedidos passem por um proxy. Se *proxies* for fornecido, deve ser um dicionário que mapeia nomes de protocolos para URLs de proxies. O valor predefinido é ler a lista de proxies das variáveis de ambiente ``<protocol>_proxy``. Se nenhuma variável de ambiente de proxy estiver definida, então, num ambiente Windows, as configurações de proxy são obtidas da secção Internet Settings do registo, e num ambiente macOS, as informações de proxy são recuperadas do System Configuration Framework.
ru: Заставить запросы проходить через прокси. Если указано *proxies*, это должен быть словарь, сопоставляющий имена протоколов с URL-адресами прокси. По умолчанию список прокси считывается из переменных среды ``<protocol>_proxy``. Если переменные среды прокси-сервера не заданы, то в среде Windows настройки прокси-сервера получаются из раздела «Настройки Интернета» реестра, а в среде macOS информация о прокси-сервере извлекается из платформы конфигурации системы.

source: To disable autodetected proxy pass an empty dictionary.
pt_pt: Para desativar o proxy autodetetado, passe um dicionário vazio.
ru: Чтобы отключить автоматически определяемый прокси-сервер, передайте пустой словарь.

source: The :envvar:`no_proxy` environment variable can be used to specify hosts which shouldn't be reached via proxy; if set, it should be a comma-separated list of hostname suffixes, optionally with ``:port`` appended, for example ``cern.ch,ncsa.uiuc.edu,some.host:8080``.
pt_pt: A variável de ambiente :envvar:`no_proxy` pode ser usada para especificar hosts que não devem ser alcançados via proxy; se definida, deve ser uma lista separada por vírgulas de sufixos de nomes de host, opcionalmente com ``:port`` anexado, por exemplo, ``cern.ch,ncsa.uiuc.edu,some.host:8080``.
ru: Переменная среды :envvar:`no_proxy` может использоваться для указания хостов, к которым не следует обращаться через прокси; если установлено, это должен быть список суффиксов имен хостов, разделенных запятыми, возможно с добавлением ``:port``, например ``cern.ch,ncsa.uiuc.edu,some.host:8080``.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
pt_pt: ``HTTP_PROXY`` será ignorado se uma variável ``REQUEST_METHOD`` estiver definida; veja a documentação em :func:`~urllib.request.getproxies`.
ru: ``HTTP_PROXY`` будет игнорироваться, если установлена ​​переменная ``REQUEST_METHOD``; см. документацию по :func:`~urllib.request.getproxies`.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings.
pt_pt: Mantém uma base de dados de mapeamentos ``(realm, uri) -> (user, password)``.
ru: Сохраните базу данных сопоставлений ``(область, uri) -> (пользователь, пароль)``.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings. A realm of ``None`` is considered a catch-all realm, which is searched if no other realm fits.
pt_pt: Mantém uma base de dados de mapeamentos ``(realm, uri) -> (user, password)``. Um realm de ``None`` é considerado um realm abrangente, que é pesquisado se nenhum outro realm for adequado.
ru: Сохраните базу данных сопоставлений ``(область, uri) -> (пользователь, пароль)``. Область «Нет» считается универсальной областью, в которой выполняется поиск, если ни одна другая область не подходит.

source: A variant of :class:`HTTPPasswordMgrWithDefaultRealm` that also has a database of ``uri -> is_authenticated`` mappings. Can be used by a BasicAuth handler to determine when to send authentication credentials immediately instead of waiting for a ``401`` response first.
pt_pt: Uma variante de :class:`HTTPPasswordMgrWithDefaultRealm` que também tem uma base de dados de mapeamentos ``uri -> is_authenticated``. Pode ser usada por um manipulador BasicAuth para determinar quando enviar credenciais de autenticação imediatamente em vez de esperar por uma resposta ``401`` primeiro.
ru: Вариант :class:`HTTPPasswordMgrWithDefaultRealm`, который также имеет базу данных сопоставлений ``uri -> is_authenticated``. Может использоваться обработчиком BasicAuth, чтобы определить, когда отправлять учетные данные для аутентификации немедленно, вместо того, чтобы сначала ждать ответа 401.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. If *passwd_mgr* also provides ``is_authenticated`` and ``update_authenticated`` methods (see :ref:`http-password-mgr-with-prior-auth`), then the handler will use the ``is_authenticated`` result for a given URI to determine whether or not to send authentication credentials with the request. If ``is_authenticated`` returns ``True`` for the URI, credentials are sent. If ``is_authenticated`` is ``False``, credentials are not sent, and then if a ``401`` response is received the request is re-sent with the authentication credentials. If authentication succeeds, ``update_authenticated`` is called to set ``is_authenticated`` ``True`` for the URI, so that subsequent requests to the URI or any of its super-URIs will automatically include the authentication credentials.
pt_pt: Esta é uma classe mixin que ajuda com a autenticação HTTP, tanto para o host remoto como para um proxy. *password_mgr*, se fornecido, deve ser algo que seja compatível com :class:`HTTPPasswordMgr`; consulte a secção :ref:`http-password-mgr` para informações sobre a interface que deve ser suportada. Se *passwd_mgr* também fornecer métodos ``is_authenticated`` e ``update_authenticated`` (veja :ref:`http-password-mgr-with-prior-auth`), então o manipulador usará o resultado ``is_authenticated`` para um URI dado para determinar se deve ou não enviar credenciais de autenticação com o pedido. Se ``is_authenticated`` retornar ``True`` para o URI, as credenciais são enviadas. Se ``is_authenticated`` for ``False``, as credenciais não são enviadas, e então, se uma resposta ``401`` for recebida, o pedido é reenviado com as credenciais de autenticação. Se a autenticação for bem-sucedida, ``update_authenticated`` é chamado para definir ``is_authenticated`` como ``True`` para o URI, de modo que pedidos subsequentes ao URI ou a quaisquer dos seus super-URIs incluirão automaticamente as credenciais de autenticação.
ru: Это класс-примесь, который помогает с аутентификацией HTTP как на удаленном хосте, так и на прокси-сервере. *password_mgr*, если он указан, должен быть совместимым с :class:`HTTPPasswordMgr`; обратитесь к разделу :ref:`http-password-mgr` для получения информации об интерфейсе, который должен поддерживаться. Если *passwd_mgr* также предоставляет методы is_authenticated и update_authenticated (см. :ref:`http-password-mgr-with-prior-auth`), то обработчик будет использовать результат is_authenticated``. для данного URI, чтобы определить, отправлять ли учетные данные аутентификации вместе с запросом. Если is_authenticated возвращает True для URI, учетные данные отправляются. Если is_authenticated имеет значение False, учетные данные не отправляются, а затем, если получен ответ 401, запрос отправляется повторно с учетными данными аутентификации. Если аутентификация прошла успешно, вызывается update_authenticated, чтобы установить is_authenticated ``True`` для URI, чтобы последующие запросы к URI или любому из его супер-URI автоматически включали учетные данные аутентификации.

source: Added ``is_authenticated`` support.
pt_pt: Adicionado suporte para ``is_authenticated``.
ru: Добавлена поддержка ``is_authenticated``.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. HTTPBasicAuthHandler will raise a :exc:`ValueError` when presented with a wrong Authentication scheme.
pt_pt: Trata a autenticação com o host remoto. *password_mgr*, se fornecido, deve ser algo que seja compatível com :class:`HTTPPasswordMgr`; consulte a secção :ref:`http-password-mgr` para informações sobre a interface que deve ser suportada. HTTPBasicAuthHandler levantará uma exceção :exc:`ValueError` quando apresentado com um esquema de Autenticação errado.
ru: Обработка аутентификации на удаленном хосте. *password_mgr*, если он указан, должен быть совместимым с :class:`HTTPPasswordMgr`; обратитесь к разделу :ref:`http-password-mgr` для получения информации об интерфейсе, который должен поддерживаться. HTTPBasicAuthHandler выдаст ошибку :exc:`ValueError` при представлении неправильной схемы аутентификации.

source: Handle authentication with the proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
pt_pt: Trata a autenticação com o proxy. *password_mgr*, se fornecido, deve ser algo que seja compatível com :class:`HTTPPasswordMgr`; consulte a secção :ref:`http-password-mgr` para informações sobre a interface que deve ser suportada.
ru: Обработка аутентификации с помощью прокси. *password_mgr*, если он указан, должен быть совместимым с :class:`HTTPPasswordMgr`; обратитесь к разделу :ref:`http-password-mgr` для получения информации об интерфейсе, который должен поддерживаться.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
pt_pt: Esta é uma classe mixin que ajuda com a autenticação HTTP, tanto para o host remoto como para um proxy. *password_mgr*, se fornecido, deve ser algo que seja compatível com :class:`HTTPPasswordMgr`; consulte a secção :ref:`http-password-mgr` para informações sobre a interface que deve ser suportada.
ru: Это класс-примесь, который помогает с аутентификацией HTTP как на удаленном хосте, так и на прокси-сервере. *password_mgr*, если он указан, должен быть совместимым с :class:`HTTPPasswordMgr`; обратитесь к разделу :ref:`http-password-mgr` для получения информации об интерфейсе, который должен поддерживаться.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. When both Digest Authentication Handler and Basic Authentication Handler are both added, Digest Authentication is always tried first. If the Digest Authentication returns a 40x response again, it is sent to Basic Authentication handler to Handle. This Handler method will raise a :exc:`ValueError` when presented with an authentication scheme other than Digest or Basic.
pt_pt: Trata a autenticação com o host remoto. *password_mgr*, se fornecido, deve ser algo que seja compatível com :class:`HTTPPasswordMgr`; consulte a secção :ref:`http-password-mgr` para informações sobre a interface que deve ser suportada. Quando tanto o Manipulador de Autenticação Digest como o Manipulador de Autenticação Básica são adicionados, a Autenticação Digest é sempre tentada primeiro. Se a Autenticação Digest retornar uma resposta 40x novamente, ela é enviada para o manipulador de Autenticação Básica para tratar. Este método do Manipulador levantará uma exceção :exc:`ValueError` quando apresentado com um esquema de autenticação diferente de Digest ou Básico.
ru: Обработка аутентификации на удаленном хосте. *password_mgr*, если он указан, должен быть совместимым с :class:`HTTPPasswordMgr`; обратитесь к разделу :ref:`http-password-mgr` для получения информации об интерфейсе, который должен поддерживаться. Если добавлены и обработчик дайджест-аутентификации, и базовый обработчик аутентификации, сначала всегда пробуется дайджест-аутентификация. Если дайджест-аутентификация снова возвращает ответ 40x, он отправляется обработчику базовой аутентификации для обработки. Этот метод Handler вызовет :exc:`ValueError` при использовании схемы аутентификации, отличной от Digest или Basic.

source: Raise :exc:`ValueError` on unsupported Authentication Scheme.
pt_pt: Levanta :exc:`ValueError` em esquema de Autenticação não suportado.
ru: Вызовите :exc:`ValueError` для неподдерживаемой схемы аутентификации.

source: A class to handle opening of HTTP URLs.
pt_pt: Uma classe para tratar a abertura de URLs HTTP.
ru: Класс для обработки открытия URL-адресов HTTP.

source: A class to handle opening of HTTPS URLs. *context* and *check_hostname* have the same meaning as in :class:`http.client.HTTPSConnection`.
pt_pt: Uma classe para tratar a abertura de URLs HTTPS. *context* e *check_hostname* têm o mesmo significado que em :class:`http.client.HTTPSConnection`.
ru: Класс для открытия URL-адресов HTTPS. *context* и *check_hostname* имеют то же значение, что и в :class:`http.client.HTTPSConnection`.

source: *context* and *check_hostname* were added.
pt_pt: Os parâmetros *context* e *check_hostname* foram adicionados.
ru: Были добавлены *context* и *check_hostname*.

source: Open local files.
pt_pt: Abre ficheiros locais.
ru: Откройте локальные файлы.

source: Open data URLs.
pt_pt: Abre URLs de dados.
ru: URL-адреса открытых данных.

source: Open FTP URLs.
pt_pt: Abre URLs FTP.
ru: Открыть URL-адреса FTP.

source: Open FTP URLs, keeping a cache of open FTP connections to minimize delays.
pt_pt: Abre URLs FTP, mantendo uma cache de conexões FTP abertas para minimizar atrasos.
ru: Открытые URL-адреса FTP, сохраняя кеш открытых FTP-соединений для минимизации задержек.

source: A catch-all class to handle unknown URLs.
pt_pt: Uma classe abrangente para tratar URLs desconhecidas.
ru: Универсальный класс для обработки неизвестных URL-адресов.

source: Process HTTP error responses.
pt_pt: Processa respostas de erro HTTP.
ru: Обработка ответов об ошибках HTTP.

source: Request Objects
pt_pt: Objetos Request
ru: Объекты запроса

source: The following methods describe :class:`Request`'s public interface, and so all may be overridden in subclasses. It also defines several public attributes that can be used by clients to inspect the parsed request.
pt_pt: Os seguintes métodos descrevem a interface pública de :class:`Request`, e portanto todos podem ser substituídos em subclasses. Também define vários atributos públicos que podem ser usados pelos clientes para inspecionar o pedido analisado.
ru: Следующие методы описывают общедоступный интерфейс :class:`Request`, поэтому все они могут быть переопределены в подклассах. Он также определяет несколько общедоступных атрибутов, которые могут использоваться клиентами для проверки проанализированного запроса.

source: The original URL passed to the constructor.
pt_pt: A URL original passada ao construtor.
ru: Исходный URL-адрес передается конструктору.

source: Request.full_url is a property with setter, getter and a deleter. Getting :attr:`~Request.full_url` returns the original request URL with the fragment, if it was present.
pt_pt: Request.full_url é uma propriedade com setter, getter e um deleter. Obter :attr:`~Request.full_url` retorna a URL original do pedido com o fragmento, se estiver presente.
ru: Request.full_url — это свойство с установщиком, геттером и удалением. Получение :attr:`~Request.full_url` возвращает исходный URL-адрес запроса с фрагментом, если он присутствовал.

source: The URI scheme.
pt_pt: O esquema do URI.
ru: Схема URI.

source: The URI authority, typically a host, but may also contain a port separated by a colon.
pt_pt: A autoridade do URI, tipicamente um host, mas também pode conter uma porta separada por dois pontos.
ru: Центр URI, обычно хост, но может также содержать порт, разделенный двоеточием.

source: The original host for the request, without port.
pt_pt: O host original do pedido, sem porta.
ru: Исходный хост запроса без порта.
