Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/urllib.request.po
Languages: pt_pt, ru

source: The URI path. If the :class:`Request` uses a proxy, then selector will be the full URL that is passed to the proxy.
pt_pt: O caminho do URI. Se o :class:`Request` usar um proxy, então o seletor será a URL completa que é passada ao proxy.
ru: Путь URI. Если :class:`Request` использует прокси, то селектором будет полный URL-адрес, передаваемый прокси.

source: The entity body for the request, or ``None`` if not specified.
pt_pt: O corpo da entidade para o pedido, ou ``None`` se não for especificado.
ru: Тело объекта запроса или None, если не указано.

source: Changing value of :attr:`Request.data` now deletes "Content-Length" header if it was previously set or calculated.
pt_pt: Alterar o valor de :attr:`Request.data` agora apaga o cabeçalho "Content-Length" se este tiver sido definido ou calculado anteriormente.
ru: Изменение значения :attr:`Request.data` теперь удаляет заголовок «Content-Length», если он был ранее установлен или рассчитан.

source: boolean, indicates whether the request is unverifiable as defined by :rfc:`2965`.
pt_pt: booleano, indica se o pedido é não verificável conforme definido por :rfc:`2965`.
ru: логическое значение, указывает, является ли запрос непроверяемым, как определено в :rfc:`2965`.

source: The HTTP request method to use. By default its value is :const:`None`, which means that :meth:`~Request.get_method` will do its normal computation of the method to be used. Its value can be set (thus overriding the default computation in :meth:`~Request.get_method`) either by providing a default value by setting it at the class level in a :class:`Request` subclass, or by passing a value in to the :class:`Request` constructor via the *method* argument.
pt_pt: O método de pedido HTTP a usar. Por padrão, o seu valor é :const:`None`, o que significa que :meth:`~Request.get_method` fará o seu cálculo normal do método a ser usado. O seu valor pode ser definido (assim substituindo o cálculo predefinido em :meth:`~Request.get_method`) fornecendo um valor predefinido ao defini-lo ao nível da classe numa subclasse :class:`Request`, ou passando um valor para o construtor :class:`Request` através do argumento *method*.
ru: Используемый метод HTTP-запроса. По умолчанию его значение — :const:`None`, что означает, что :meth:`~Request.get_method` будет выполнять обычные вычисления метода, который будет использоваться. Его значение может быть установлено (таким образом, переопределяя вычисления по умолчанию в :meth:`~Request.get_method`) либо путем предоставления значения по умолчанию, установив его на уровне класса в подклассе :class:`Request`, либо путем передачи значения в конструктор :class:`Request` через аргумент *method*.

source: A default value can now be set in subclasses; previously it could only be set via the constructor argument.
pt_pt: Um valor predefinido pode agora ser definido em subclasses; anteriormente só podia ser definido através do argumento do construtor.
ru: Значение по умолчанию теперь можно установить в подклассах; раньше его можно было установить только через аргумент конструктора.

source: Return a string indicating the HTTP request method. If :attr:`Request.method` is not ``None``, return its value, otherwise return ``'GET'`` if :attr:`Request.data` is ``None``, or ``'POST'`` if it's not. This is only meaningful for HTTP requests.
pt_pt: Retorna uma string indicando o método de pedido HTTP. Se :attr:`Request.method` não for ``None``, retorna o seu valor, caso contrário retorna ``'GET'`` se :attr:`Request.data` for ``None``, ou ``'POST'`` se não for. Isto só é significativo para pedidos HTTP.
ru: Возвращает строку, указывающую метод HTTP-запроса. Если :attr:`Request.method` не ``None``, верните его значение, в противном случае верните ``'GET'``, если :attr:`Request.data` имеет значение ``None`` или ``' POST'``, если это не так. Это имеет смысл только для HTTP-запросов.

source: get_method now looks at the value of :attr:`Request.method`.
pt_pt: get_method agora verifica o valor de :attr:`Request.method`.
ru: get_method теперь смотрит на значение :attr:`Request.method`.

source: Add another header to the request. Headers are currently ignored by all handlers except HTTP handlers, where they are added to the list of headers sent to the server. Note that there cannot be more than one header with the same name, and later calls will overwrite previous calls in case the *key* collides. Currently, this is no loss of HTTP functionality, since all headers which have meaning when used more than once have a (header-specific) way of gaining the same functionality using only one header. Note that headers added using this method are also added to redirected requests.
pt_pt: Adiciona outro cabeçalho ao pedido. Os cabeçalhos são atualmente ignorados por todos os manipuladores exceto os manipuladores HTTP, onde são adicionados à lista de cabeçalhos enviados para o servidor. Note que não pode haver mais do que um cabeçalho com o mesmo nome, e chamadas posteriores substituirão chamadas anteriores no caso de colisão da *key*. Atualmente, isto não representa perda de funcionalidade HTTP, uma vez que todos os cabeçalhos que têm significado quando usados mais do que uma vez têm uma forma (específica do cabeçalho) de obter a mesma funcionalidade usando apenas um cabeçalho. Note que os cabeçalhos adicionados usando este método também são adicionados a pedidos redirecionados.
ru: Добавьте в запрос еще один заголовок. Заголовки в настоящее время игнорируются всеми обработчиками, кроме обработчиков HTTP, где они добавляются в список заголовков, отправляемых на сервер. Обратите внимание, что не может быть более одного заголовка с одним и тем же именем, и последующие вызовы перезапишут предыдущие вызовы в случае конфликта *key*. В настоящее время это не является потерей функциональности HTTP, поскольку все заголовки, которые имеют значение при многократном использовании, имеют (специфичный для заголовка) способ получить ту же функциональность, используя только один заголовок. Обратите внимание, что заголовки, добавленные с помощью этого метода, также добавляются к перенаправленным запросам.

source: Add a header that will not be added to a redirected request.
pt_pt: Adiciona um cabeçalho que não será adicionado a um pedido redirecionado.
ru: Добавьте заголовок, который не будет добавлен в перенаправленный запрос.

source: Return whether the instance has the named header (checks both regular and unredirected).
pt_pt: Retorna se a instância tem o cabeçalho nomeado (verifica tanto os cabeçalhos regulares como os não redirecionados).
ru: Возвращает информацию о том, имеет ли экземпляр именованный заголовок (проверяется как обычный, так и неперенаправленный).

source: Remove named header from the request instance (both from regular and unredirected headers).
pt_pt: Remove o cabeçalho nomeado da instância do pedido (tanto dos cabeçalhos regulares como dos não redirecionados).
ru: Удалить именованный заголовок из экземпляра запроса (как из обычных, так и из неперенаправленных заголовков).

source: Return the URL given in the constructor.
pt_pt: Retorna a URL fornecida no construtor.
ru: Верните URL-адрес, указанный в конструкторе.

source: Returns :attr:`Request.full_url`
pt_pt: Retorna :attr:`Request.full_url`
ru: Возвращает :attr:`Request.full_url`

source: Prepare the request by connecting to a proxy server. The *host* and *type* will replace those of the instance, and the instance's selector will be the original URL given in the constructor.
pt_pt: Prepara o pedido conectando-se a um servidor proxy. O *host* e *type* substituirão os da instância, e o seletor da instância será a URL original fornecida no construtor.
ru: Подготовьте запрос, подключившись к прокси-серверу. *host* и *type* заменят значения экземпляра, а селектором экземпляра будет исходный URL-адрес, указанный в конструкторе.

source: Return the value of the given header. If the header is not present, return the default value.
pt_pt: Retorna o valor do cabeçalho dado. Se o cabeçalho não estiver presente, retorna o valor predefinido.
ru: Вернуть значение данного заголовка. Если заголовок отсутствует, верните значение по умолчанию.

source: Return a list of tuples (header_name, header_value) of the Request headers.
pt_pt: Retorna uma lista de tuplos (header_name, header_value) dos cabeçalhos do Pedido.
ru: Возвращает список кортежей (имя_заголовка, значение_заголовка) заголовков запроса.

source: The request methods add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host and is_unverifiable that were deprecated since 3.3 have been removed.
pt_pt: Os métodos de pedido add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host e is_unverifiable, que estavam obsoletos desde a versão 3.3, foram removidos.
ru: Методы запроса add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host и is_unverifying, которые устарели с версии 3.3, были удалены.

source: OpenerDirector Objects
pt_pt: Objetos OpenerDirector
ru: Объекты OpenerDirector

source: :class:`OpenerDirector` instances have the following methods:
pt_pt: As instâncias :class:`OpenerDirector` têm os seguintes métodos:
ru: Экземпляры :class:`OpenerDirector` имеют следующие методы:

source: *handler* should be an instance of :class:`BaseHandler`. The following methods are searched, and added to the possible chains (note that HTTP errors are a special case). Note that, in the following, *protocol* should be replaced with the actual protocol to handle, for example :meth:`http_response` would be the HTTP protocol response handler. Also *type* should be replaced with the actual HTTP code, for example :meth:`http_error_404` would handle HTTP 404 errors.
pt_pt: *handler* deve ser uma instância de :class:`BaseHandler`. Os seguintes métodos são procurados e adicionados às possíveis cadeias (note que os erros HTTP são um caso especial). Note que, no seguinte, *protocol* deve ser substituído pelo protocolo real a ser tratado, por exemplo, :meth:`http_response` seria o manipulador de resposta do protocolo HTTP. Também *type* deve ser substituído pelo código HTTP real, por exemplo, :meth:`http_error_404` trataria erros HTTP 404.
ru: *handler* должен быть экземпляром :class:`BaseHandler`. Следующие методы ищутся и добавляются к возможным цепочкам (обратите внимание, что ошибки HTTP — это особый случай). Обратите внимание, что в дальнейшем *protocol* следует заменить фактическим обрабатываемым протоколом, например :meth:`http_response` будет обработчиком ответа протокола HTTP. Также *type* следует заменить фактическим кодом HTTP, например :meth:`http_error_404` будет обрабатывать ошибки HTTP 404.

source: :meth:`!<protocol>_open` --- signal that the handler knows how to open *protocol* URLs.
pt_pt: :meth:`!<protocol>_open` --- sinaliza que o manipulador sabe como abrir URLs *protocol*.

source: See |protocol_open|_ for more information.
pt_pt: Veja |protocol_open|_ para mais informações.
ru: Видеть |протокол_открытый|_ для получения дополнительной информации.

source: :meth:`!http_error_\<type\>` --- signal that the handler knows how to handle HTTP errors with HTTP error code *type*.
pt_pt: :meth:`!http_error_\<type\>` --- sinaliza que o manipulador sabe como tratar erros HTTP com o código de erro HTTP *type*.

source: See |http_error_nnn|_ for more information.
pt_pt: Veja |http_error_nnn|_ para mais informações.
ru: Видеть |http_error_nnn|_ для получения дополнительной информации.

source: :meth:`!<protocol>_error` --- signal that the handler knows how to handle errors from (non-\ ``http``) *protocol*.
pt_pt: :meth:`!<protocol>_error` --- sinaliza que o manipulador sabe como tratar erros do protocolo (não-\ ``http``) *protocol*.

source: :meth:`!<protocol>_request` --- signal that the handler knows how to pre-process *protocol* requests.
pt_pt: :meth:`!<protocol>_request` --- sinaliza que o manipulador sabe como pré-processar pedidos *protocol*.

source: See |protocol_request|_ for more information.
pt_pt: Veja |protocol_request|_ para mais informações.
ru: Видеть |запрос_протокола|_ для получения дополнительной информации.

source: :meth:`!<protocol>_response` --- signal that the handler knows how to post-process *protocol* responses.
pt_pt: :meth:`!<protocol>_response` --- sinaliza que o manipulador sabe como pós-processar respostas *protocol*.

source: See |protocol_response|_ for more information.
pt_pt: Veja |protocol_response|_ para mais informações.
ru: Видеть |ответ_протокола|_ для получения дополнительной информации.

source: Open the given *url* (which can be a request object or a string), optionally passing the given *data*. Arguments, return values and exceptions raised are the same as those of :func:`urlopen` (which simply calls the :meth:`open` method on the currently installed global :class:`OpenerDirector`). The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). The timeout feature actually works only for HTTP, HTTPS and FTP connections.
pt_pt: Abre a *url* dada (que pode ser um objeto de pedido ou uma string), opcionalmente passando os *data* dados. Argumentos, valores de retorno e exceções levantadas são os mesmos que os de :func:`urlopen` (que simplesmente chama o método :meth:`open` no :class:`OpenerDirector` global atualmente instalado). O parâmetro opcional *timeout* especifica um tempo limite em segundos para operações de bloqueio como a tentativa de conexão (se não for especificado, a configuração de tempo limite global padrão será usada). A funcionalidade de tempo limite na verdade só funciona para conexões HTTP, HTTPS e FTP.
ru: Откройте данный *url* (который может быть объектом запроса или строкой), при необходимости передав указанные *данные*. Аргументы, возвращаемые значения и возникающие исключения такие же, как у :func:`urlopen` (который просто вызывает метод :meth:`open` для текущего установленного глобального :class:`OpenerDirector`). Необязательный параметр *timeout* указывает тайм-аут в секундах для блокировки таких операций, как попытка подключения (если он не указан, будет использоваться глобальная настройка тайм-аута по умолчанию). Функция тайм-аута фактически работает только для соединений HTTP, HTTPS и FTP.

source: Handle an error of the given protocol. This will call the registered error handlers for the given protocol with the given arguments (which are protocol specific). The HTTP protocol is a special case which uses the HTTP response code to determine the specific error handler; refer to the :meth:`!http_error_\<type\>` methods of the handler classes.
pt_pt: Trata um erro do protocolo dado. Isto chamará os manipuladores de erro registados para o protocolo dado com os argumentos dados (que são específicos do protocolo). O protocolo HTTP é um caso especial que usa o código de resposta HTTP para determinar o manipulador de erro específico; consulte os métodos :meth:`!http_error_\<type\>` das classes de manipuladores.

source: Return values and exceptions raised are the same as those of :func:`urlopen`.
pt_pt: Os valores de retorno e exceções levantadas são os mesmos que os de :func:`urlopen`.
ru: Возвращаемые значения и возникающие исключения такие же, как у :func:`urlopen`.

source: OpenerDirector objects open URLs in three stages:
pt_pt: Os objetos OpenerDirector abrem URLs em três etapas:
ru: Объекты OpenerDirector открывают URL-адреса в три этапа:

source: The order in which these methods are called within each stage is determined by sorting the handler instances.
pt_pt: A ordem pela qual estes métodos são chamados dentro de cada etapa é determinada pela ordenação das instâncias de manipuladores.
ru: Порядок вызова этих методов на каждом этапе определяется путем сортировки экземпляров обработчика.

source: Every handler with a method named like :meth:`!<protocol>_request` has that method called to pre-process the request.
pt_pt: Cada manipulador com um método nomeado como :meth:`!<protocol>_request` tem esse método chamado para pré-processar o pedido.

source: Handlers with a method named like :meth:`!<protocol>_open` are called to handle the request. This stage ends when a handler either returns a non-\ :const:`None` value (ie. a response), or raises an exception (usually :exc:`~urllib.error.URLError`). Exceptions are allowed to propagate.
pt_pt: Manipuladores com um método nomeado como :meth:`!<protocol>_open` são chamados para tratar o pedido. Esta etapa termina quando um manipulador retorna um valor não-\ :const:`None` (ou seja, uma resposta), ou levanta uma exceção (geralmente :exc:`~urllib.error.URLError`). As exceções são permitidas propagar-se.

source: In fact, the above algorithm is first tried for methods named :meth:`~BaseHandler.default_open`. If all such methods return :const:`None`, the algorithm is repeated for methods named like :meth:`!<protocol>_open`. If all such methods return :const:`None`, the algorithm is repeated for methods named :meth:`~BaseHandler.unknown_open`.
pt_pt: Na verdade, o algoritmo acima é primeiro tentado para métodos nomeados :meth:`~BaseHandler.default_open`. Se todos esses métodos retornarem :const:`None`, o algoritmo é repetido para métodos nomeados como :meth:`!<protocol>_open`. Se todos esses métodos retornarem :const:`None`, o algoritmo é repetido para métodos nomeados :meth:`~BaseHandler.unknown_open`.

source: Note that the implementation of these methods may involve calls of the parent :class:`OpenerDirector` instance's :meth:`~OpenerDirector.open` and :meth:`~OpenerDirector.error` methods.
pt_pt: Note que a implementação destes métodos pode envolver chamadas dos métodos :meth:`~OpenerDirector.open` e :meth:`~OpenerDirector.error` da instância pai :class:`OpenerDirector`.
ru: Обратите внимание, что реализация этих методов может включать вызовы методов :meth:`~OpenerDirector.open` и :meth:`~OpenerDirector.error` родительского экземпляра :class:`OpenerDirector`.

source: Every handler with a method named like :meth:`!<protocol>_response` has that method called to post-process the response.
pt_pt: Cada manipulador com um método nomeado como :meth:`!<protocol>_response` tem esse método chamado para pós-processar a resposta.

source: BaseHandler Objects
pt_pt: Objetos BaseHandler
ru: Объекты BaseHandler

source: :class:`BaseHandler` objects provide a couple of methods that are directly useful, and others that are meant to be used by derived classes. These are intended for direct use:
pt_pt: Os objetos :class:`BaseHandler` fornecem alguns métodos que são diretamente úteis, e outros que são destinados a serem usados por classes derivadas. Estes são destinados a uso direto:
ru: Объекты :class:`BaseHandler` предоставляют несколько методов, которые непосредственно полезны, а также другие, предназначенные для использования производными классами. Они предназначены для прямого использования:

source: Add a director as parent.
pt_pt: Adiciona um diretor como pai.
ru: Добавьте директора в качестве родителя.

source: Remove any parents.
pt_pt: Remove quaisquer pais.
ru: Удалите всех родителей.

source: The following attribute and methods should only be used by classes derived from :class:`BaseHandler`.
pt_pt: O seguinte atributo e métodos devem ser usados apenas por classes derivadas de :class:`BaseHandler`.
ru: Следующий атрибут и методы должны использоваться только классами, производными от :class:`BaseHandler`.

source: The convention has been adopted that subclasses defining :meth:`!<protocol>_request` or :meth:`!<protocol>_response` methods are named :class:`!\*Processor`; all others are named :class:`!\*Handler`.
pt_pt: A convenção adotada é que as subclasses que definem métodos :meth:`!<protocol>_request` ou :meth:`!<protocol>_response` são chamadas :class:`!\*Processor`; todas as outras são chamadas :class:`!\*Handler`.

source: A valid :class:`OpenerDirector`, which can be used to open using a different protocol, or handle errors.
pt_pt: Um :class:`OpenerDirector` válido, que pode ser usado para abrir usando um protocolo diferente, ou tratar erros.
ru: Действительный :class:`OpenerDirector`, который можно использовать для открытия с использованием другого протокола или обработки ошибок.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs.
pt_pt: Este método *não* está definido em :class:`BaseHandler`, mas as subclasses devem defini-lo se quiserem capturar todas as URLs.
ru: Этот метод *не* определен в :class:`BaseHandler`, но подклассы должны определять его, если они хотят перехватывать все URL-адреса.

source: This method, if implemented, will be called by the parent :class:`OpenerDirector`. It should return a file-like object as described in the return value of the :meth:`~OpenerDirector.open` method of :class:`OpenerDirector`, or ``None``. It should raise :exc:`~urllib.error.URLError`, unless a truly exceptional thing happens (for example, :exc:`MemoryError` should not be mapped to :exc:`~urllib.error.URLError`).
pt_pt: Este método, se implementado, será chamado pelo :class:`OpenerDirector` pai. Deve retornar um objeto semelhante a um ficheiro como descrito no valor de retorno do método :meth:`~OpenerDirector.open` de :class:`OpenerDirector`, ou ``None``. Deve levantar :exc:`~urllib.error.URLError`, a menos que ocorra algo realmente excepcional (por exemplo, :exc:`MemoryError` não deve ser mapeado para :exc:`~urllib.error.URLError`).

source: This method will be called before any protocol-specific open method.
pt_pt: Este método será chamado antes de qualquer método de abertura específico do protocolo.
ru: Этот метод будет вызываться перед любым открытым методом, специфичным для протокола.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to handle URLs with the given protocol.
pt_pt: Este método *não* está definido em :class:`BaseHandler`, mas as subclasses devem defini-lo se quiserem tratar URLs com o protocolo dado.
ru: Этот метод *не* определен в :class:`BaseHandler`, но подклассы должны определять его, если они хотят обрабатывать URL-адреса с помощью данного протокола.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. Return values should be the same as for :meth:`~BaseHandler.default_open`.
pt_pt: Este método, se definido, será chamado pelo :class:`OpenerDirector` pai. Os valores de retorno devem ser os mesmos que para :meth:`~BaseHandler.default_open`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs with no specific registered handler to open it.
pt_pt: Este método *não* está definido em :class:`BaseHandler`, mas as subclasses devem defini-lo se quiserem capturar todas as URLs sem um manipulador registado específico para as abrir.
ru: Этот метод *не* определен в :class:`BaseHandler`, но подклассы должны определять его, если они хотят перехватывать все URL-адреса без определенного зарегистрированного обработчика для его открытия.

source: This method, if implemented, will be called by the :attr:`parent` :class:`OpenerDirector`. Return values should be the same as for :meth:`default_open`.
pt_pt: Este método, se implementado, será chamado pelo :attr:`parent` :class:`OpenerDirector`. Os valores de retorno devem ser os mesmos que para :meth:`default_open`.
ru: Этот метод, если он реализован, будет вызываться :attr:`parent` :class:`OpenerDirector`. Возвращаемые значения должны быть такими же, как для :meth:`default_open`.
