Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/urllib.request.po
Languages: pt_pt, ru

source: The optional *cafile* and *capath* parameters specify a set of trusted CA certificates for HTTPS requests. *cafile* should point to a single file containing a bundle of CA certificates, whereas *capath* should point to a directory of hashed certificate files. More information can be found in :meth:`ssl.SSLContext.load_verify_locations`.
ru: Необязательные параметры *cafile* и *capath* указывают набор доверенных сертификатов CA для запросов HTTPS. *cafile* должен указывать на один файл, содержащий пакет сертификатов CA, тогда как *capath* должен указывать на каталог хешированных файлов сертификатов. Дополнительную информацию можно найти в :meth:`ssl.SSLContext.load_verify_locations`.

source: The *cadefault* parameter is ignored.
ru: Параметр *cadefault* игнорируется.

source: For FTP, file, and data URLs and requests explicitly handled by legacy :class:`URLopener` and :class:`FancyURLopener` classes, this function returns a :class:`urllib.response.addinfourl` object.
ru: Для URL-адресов FTP, файлов и данных, а также запросов, явно обрабатываемых устаревшими классами :class:`URLopener` и :class:`FancyURLopener`, эта функция возвращает объект :class:`urllib.response.addinourl`.

source: *cafile*, *capath* and *cadefault* are deprecated in favor of *context*. Please use :meth:`ssl.SSLContext.load_cert_chain` instead, or let :func:`ssl.create_default_context` select the system's trusted CA certificates for you.
ru: *cafile*, *capath* и *cadefault* устарели в пользу *context*. Вместо этого используйте :meth:`ssl.SSLContext.load_cert_chain` или позвольте :func:`ssl.create_default_context` выбрать за вас доверенные сертификаты CA системы.

source: Convert the pathname *path* from the local syntax for a path to the form used in the path component of a URL. This does not produce a complete URL. The return value will already be quoted using the :func:`~urllib.parse.quote` function.
ru: Преобразуйте имя пути *path* из локального синтаксиса пути в форму, используемую в компоненте пути URL-адреса. Это не создает полный URL-адрес. Возвращаемое значение уже будет заключено в кавычки с помощью функции :func:`~urllib.parse.quote`.

source: Convert the path component *path* from a percent-encoded URL to the local syntax for a path. This does not accept a complete URL. This function uses :func:`~urllib.parse.unquote` to decode *path*.
ru: Преобразуйте компонент пути *path* из URL-адреса в процентном кодировании в локальный синтаксис пути. Это не принимает полный URL-адрес. Эта функция использует :func:`~urllib.parse.unquote` для декодирования *path*.

source: *req* will be a :class:`Request` object, *fp* will be a file-like object with the HTTP error body, *code* will be the three-digit code of the error, *msg* will be the user-visible explanation of the code and *hdrs* will be a mapping object with the headers of the error.
ru: *req* будет объектом :class:`Request`, *fp* будет файловым объектом с телом ошибки HTTP, *code* будет трехзначным кодом ошибки, *msg* будет видимое пользователю объяснение кода, а *hdrs* будет объектом сопоставления с заголовками ошибки.

source: Send an HTTP request, which can be either GET or POST, depending on ``req.has_data()``.
ru: Отправьте HTTP-запрос, который может быть GET или POST, в зависимости от ``req.has_data()``.

source: Send an HTTPS request, which can be either GET or POST, depending on ``req.has_data()``.
ru: Отправьте HTTPS-запрос, который может быть GET или POST, в зависимости от ``req.has_data()``.

source: This example gets the python.org main page and displays the first 300 bytes of it. ::
ru: В этом примере получается главная страница python.org и отображаются первые 300 ее байтов. ::

source: The following W3C document, https://www.w3.org/International/O-charset\ , lists the various ways in which an (X)HTML or an XML document could have specified its encoding information.
ru: В следующем документе W3C, https://www.w3.org/International/O-charset\, перечислены различные способы, которыми документ (X)HTML или XML мог бы указать информацию о своей кодировке.

source: As the python.org website uses *utf-8* encoding as specified in its meta tag, we will use the same for decoding the bytes object. ::
ru: Поскольку веб-сайт python.org использует кодировку *utf-8*, указанную в его метатеге, мы будем использовать ее для декодирования объекта bytes. ::

source: It is also possible to achieve the same result without using the :term:`context manager` approach. ::
ru: Того же результата можно добиться и без использования подхода :term:`контекстного менеджера`. ::

source: Base class for opening and reading URLs. Unless you need to support opening objects using schemes other than :file:`http:`, :file:`ftp:`, or :file:`file:`, you probably want to use :class:`FancyURLopener`.
ru: Базовый класс для открытия и чтения URL-адресов. Если вам не требуется поддержка открытия объектов с использованием схем, отличных от :file:`http:`, :file:`ftp:` или :file:`file:`, вы, вероятно, захотите использовать :class:`FancyURLopener`.

source: By default, the :class:`URLopener` class sends a :mailheader:`User-Agent` header of ``urllib/VVV``, where *VVV* is the :mod:`urllib` version number. Applications can define their own :mailheader:`User-Agent` header by subclassing :class:`URLopener` or :class:`FancyURLopener` and setting the class attribute :attr:`version` to an appropriate string value in the subclass definition.
ru: По умолчанию класс :class:`URLopener` отправляет заголовок :mailheader:`User-Agent` ``urllib/VVV``, где *VVV* — номер версии :mod:`urllib`. Приложения могут определить свой собственный заголовок :mailheader:`User-Agent`, создав подкласс :class:`URLopener` или :class:`FancyURLopener` и установив для атрибута класса :attr:`version` соответствующее строковое значение в определении подкласса.

source: The optional *proxies* parameter should be a dictionary mapping scheme names to proxy URLs, where an empty dictionary turns proxies off completely. Its default value is ``None``, in which case environmental proxy settings will be used if present, as discussed in the definition of :func:`urlopen`, above.
ru: Необязательный параметр *proxies* должен представлять собой имена схем сопоставления словаря с URL-адресами прокси-серверов, где пустой словарь полностью отключает прокси-серверы. Его значение по умолчанию — None, и в этом случае будут использоваться настройки прокси-сервера среды, если они присутствуют, как описано в определении :func:`urlopen` выше.

source: Additional keyword parameters, collected in *x509*, may be used for authentication of the client when using the :file:`https:` scheme. The keywords *key_file* and *cert_file* are supported to provide an SSL key and certificate; both are needed to support client authentication.
ru: Дополнительные параметры ключевого слова, собранные в *x509*, могут использоваться для аутентификации клиента при использовании схемы :file:`https:`. Ключевые слова *key_file* и *cert_file* поддерживаются для предоставления ключа и сертификата SSL; оба необходимы для поддержки аутентификации клиента.

source: :class:`URLopener` objects will raise an :exc:`OSError` exception if the server returns an error code.
ru: Объекты :class:`URLopener` вызовут исключение :exc:`OSError`, если сервер вернет код ошибки.

source: Open *fullurl* using the appropriate protocol. This method sets up cache and proxy information, then calls the appropriate open method with its input arguments. If the scheme is not recognized, :meth:`open_unknown` is called. The *data* argument has the same meaning as the *data* argument of :func:`urlopen`.
ru: Откройте *fullurl*, используя соответствующий протокол. Этот метод устанавливает информацию о кеше и прокси, а затем вызывает соответствующий открытый метод с его входными аргументами. Если схема не распознана, вызывается :meth:`open_unknown`. Аргумент *data* имеет то же значение, что и аргумент *data* функции :func:`urlopen`.

source: This method always quotes *fullurl* using :func:`~urllib.parse.quote`.
ru: Этот метод всегда цитирует *fullurl*, используя :func:`~urllib.parse.quote`.

source: Overridable interface to open unknown URL types.
ru: Переопределяемый интерфейс для открытия неизвестных типов URL.

source: Retrieves the contents of *url* and places it in *filename*. The return value is a tuple consisting of a local filename and either an :class:`email.message.Message` object containing the response headers (for remote URLs) or ``None`` (for local URLs). The caller must then open and read the contents of *filename*. If *filename* is not given and the URL refers to a local file, the input filename is returned. If the URL is non-local and *filename* is not given, the filename is the output of :func:`tempfile.mktemp` with a suffix that matches the suffix of the last path component of the input URL. If *reporthook* is given, it must be a function accepting three numeric parameters: A chunk number, the maximum size chunks are read in and the total size of the download (-1 if unknown). It will be called once at the start and after each chunk of data is read from the network. *reporthook* is ignored for local URLs.
ru: Извлекает содержимое *url* и ​​помещает его в *имя_файла*. Возвращаемое значение представляет собой кортеж, состоящий из имени локального файла и либо объекта :class:`email.message.Message`, содержащего заголовки ответа (для удаленных URL-адресов), либо объекта ``None`` (для локальных URL-адресов). Затем вызывающая сторона должна открыть и прочитать содержимое *filename*. Если *filename* не указано и URL-адрес ссылается на локальный файл, возвращается входное имя файла. Если URL-адрес нелокальный и *имя_файла* не указано, имя файла является результатом :func:`tempfile.mktemp` с суффиксом, который соответствует суффиксу последнего компонента пути входного URL-адреса. Если указан *reporthook*, это должна быть функция, принимающая три числовых параметра: номер фрагмента, максимальный размер считываемых фрагментов и общий размер загрузки (-1, если неизвестно). Он будет вызываться один раз в начале и после чтения каждого фрагмента данных из сети. *reporthook* игнорируется для локальных URL-адресов.

source: If the *url* uses the :file:`http:` scheme identifier, the optional *data* argument may be given to specify a ``POST`` request (normally the request type is ``GET``). The *data* argument must in standard :mimetype:`application/x-www-form-urlencoded` format; see the :func:`urllib.parse.urlencode` function.
ru: Если *url* использует идентификатор схемы :file:`http:`, можно указать необязательный аргумент *data* для указания запроса ``POST`` (обычно тип запроса - ``GET``). Аргумент *data* должен быть в стандартном формате :mimetype:`application/x-www-form-urlencoded`; см. функцию :func:`urllib.parse.urlencode`.

source: Variable that specifies the user agent of the opener object. To get :mod:`urllib` to tell servers that it is a particular user agent, set this in a subclass as a class variable or in the constructor before calling the base constructor.
ru: Переменная, указывающая пользовательский агент открывающего объекта. Чтобы заставить :mod:`urllib` сообщать серверам, что это конкретный пользовательский агент, установите это в подклассе как переменную класса или в конструкторе перед вызовом базового конструктора.

source: :class:`FancyURLopener` subclasses :class:`URLopener` providing default handling for the following HTTP response codes: 301, 302, 303, 307 and 401. For the 30x response codes listed above, the :mailheader:`Location` header is used to fetch the actual URL. For 401 response codes (authentication required), basic HTTP authentication is performed. For the 30x response codes, recursion is bounded by the value of the *maxtries* attribute, which defaults to 10.
ru: Подклассы :class:`FancyURLopener` :class:`URLopener` обеспечивают обработку по умолчанию для следующих кодов ответа HTTP: 301, 302, 303, 307 и 401. Для кодов ответа 30x, перечисленных выше, заголовок :mailheader:`Location` имеет вид используется для получения фактического URL-адреса. Для кодов ответа 401 (требуется аутентификация) выполняется базовая HTTP-аутентификация. Для кодов ответа 30x рекурсия ограничена значением атрибута *maxtries*, который по умолчанию равен 10.

source: According to the letter of :rfc:`2616`, 301 and 302 responses to POST requests must not be automatically redirected without confirmation by the user. In reality, browsers do allow automatic redirection of these responses, changing the POST to a GET, and :mod:`urllib` reproduces this behaviour.
ru: Согласно письму :rfc:`2616`, ответы 301 и 302 на POST-запросы не должны автоматически перенаправляться без подтверждения пользователя. На самом деле браузеры допускают автоматическое перенаправление этих ответов, заменяя POST на GET, и :mod:`urllib` воспроизводит это поведение.

source: The parameters to the constructor are the same as those for :class:`URLopener`.
ru: Параметры конструктора такие же, как и у :class:`URLopener`.

source: When performing basic authentication, a :class:`FancyURLopener` instance calls its :meth:`prompt_user_passwd` method. The default implementation asks the users for the required information on the controlling terminal. A subclass may override this method to support more appropriate behavior if needed.
ru: При выполнении базовой аутентификации экземпляр :class:`FancyURLopener` вызывает свой метод :meth:`prompt_user_passwd`. Реализация по умолчанию запрашивает у пользователей необходимую информацию на управляющем терминале. При необходимости подкласс может переопределить этот метод для поддержки более подходящего поведения.

source: The :class:`FancyURLopener` class offers one additional method that should be overloaded to provide the appropriate behavior:
ru: Класс :class:`FancyURLopener` предлагает один дополнительный метод, который следует перегрузить, чтобы обеспечить соответствующее поведение:

source: Return information needed to authenticate the user at the given host in the specified security realm. The return value should be a tuple, ``(user, password)``, which can be used for basic authentication.
ru: Возвращает информацию, необходимую для аутентификации пользователя на данном хосте в указанной области безопасности. Возвращаемое значение должно быть кортежем ``(пользователь, пароль)``, который можно использовать для базовой аутентификации.

source: The implementation prompts for this information on the terminal; an application should override this method to use an appropriate interaction model in the local environment.
ru: Реализация запрашивает эту информацию на терминале; приложение должно переопределить этот метод, чтобы использовать соответствующую модель взаимодействия в локальной среде.

source: The code handling the FTP protocol cannot differentiate between a file and a directory. This can lead to unexpected behavior when attempting to read a URL that points to a file that is not accessible. If the URL ends in a ``/``, it is assumed to refer to a directory and will be handled accordingly. But if an attempt to read a file leads to a 550 error (meaning the URL cannot be found or is not accessible, often for permission reasons), then the path is treated as a directory in order to handle the case when a directory is specified by a URL but the trailing ``/`` has been left off. This can cause misleading results when you try to fetch a file whose read permissions make it inaccessible; the FTP code will try to read it, fail with a 550 error, and then perform a directory listing for the unreadable file. If fine-grained control is needed, consider using the :mod:`ftplib` module, subclassing :class:`FancyURLopener`, or changing *_urlopener* to meet your needs.
ru: Код, обрабатывающий протокол FTP, не может различать файл и каталог. Это может привести к неожиданному поведению при попытке прочитать URL-адрес, указывающий на недоступный файл. Если URL-адрес заканчивается на ``/``, предполагается, что он относится к каталогу и будет обрабатываться соответствующим образом. Но если попытка прочитать файл приводит к ошибке 550 (это означает, что URL-адрес не может быть найден или недоступен, часто по причинам разрешения), тогда путь рассматривается как каталог, чтобы обработать случай, когда каталог указан. по URL-адресу, но завершающий ``/`` опущен. Это может привести к ошибочным результатам при попытке получить файл, права на чтение которого делают его недоступным; код FTP попытается прочитать его, но выдаст ошибку 550, а затем выполнит просмотр каталога для нечитаемого файла. Если необходим детальный контроль, рассмотрите возможность использования модуля :mod:`ftplib`, создания подкласса :class:`FancyURLopener` или изменения *_urlopener* в соответствии с вашими потребностями.
