Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/urllib.request.po
Languages: pt_pt, ru

source: In addition to the examples below, more examples are given in :ref:`urllib-howto`.
pt_pt: Além dos exemplos abaixo, mais exemplos são dados em :ref:`urllib-howto`.
ru: В дополнение к примерам ниже, дополнительные примеры приведены в :ref:`urllib-howto`.

source: This example gets the python.org main page and displays the first 300 bytes of it::
pt_pt: Este exemplo obtém a página principal do python.org e mostra os primeiros 300 bytes dela::

source: Note that urlopen returns a bytes object. This is because there is no way for urlopen to automatically determine the encoding of the byte stream it receives from the HTTP server. In general, a program will decode the returned bytes object to string once it determines or guesses the appropriate encoding.
pt_pt: Note que urlopen retorna um objeto bytes. Isto porque não há maneira de o urlopen determinar automaticamente a codificação do fluxo de bytes que recebe do servidor HTTP. Em geral, um programa decodificará o objeto bytes retornado para uma string assim que determinar ou adivinhar a codificação apropriada.
ru: Обратите внимание, что urlopen возвращает объект bytes. Это связано с тем, что urlopen не может автоматически определять кодировку потока байтов, который он получает от HTTP-сервера. В общем, программа декодирует возвращенный объект байтов в строку, как только определит или угадает соответствующую кодировку.

source: The following HTML spec document, https://html.spec.whatwg.org/#charset, lists the various ways in which an HTML or an XML document could have specified its encoding information.
pt_pt: O seguinte documento de especificação HTML, https://html.spec.whatwg.org/#charset, lista as várias maneiras pelas quais um documento HTML ou XML pode ter especificado as suas informações de codificação.

source: For additional information, see the W3C document: https://www.w3.org/International/questions/qa-html-encoding-declarations.
pt_pt: Para informações adicionais, consulte o documento W3C: https://www.w3.org/International/questions/qa-html-encoding-declarations.

source: As the python.org website uses *utf-8* encoding as specified in its meta tag, we will use the same for decoding the bytes object::
pt_pt: Como o site python.org usa a codificação *utf-8* conforme especificado na sua meta tag, usaremos a mesma para decodificar o objeto bytes::

source: It is also possible to achieve the same result without using the :term:`context manager` approach::
pt_pt: Também é possível alcançar o mesmo resultado sem usar a abordagem de :term:`gestor de contexto`::

source: In the following example, we are sending a data-stream to the stdin of a CGI and reading the data it returns to us. Note that this example will only work when the Python installation supports SSL. ::
pt_pt: No exemplo seguinte, estamos a enviar um fluxo de dados para o stdin de um CGI e a ler os dados que nos retorna. Note que este exemplo só funcionará quando a instalação do Python suportar SSL. ::
ru: В следующем примере мы отправляем поток данных на стандартный ввод CGI и читаем данные, которые он нам возвращает. Обратите внимание, что этот пример будет работать только в том случае, если установка Python поддерживает SSL. ::

source: The code for the sample CGI used in the above example is::
pt_pt: O código para o CGI de exemplo usado no exemplo acima é::
ru: Код примера CGI, использованного в приведенном выше примере:

source: Here is an example of doing a ``PUT`` request using :class:`Request`::
pt_pt: Aqui está um exemplo de como fazer um pedido ``PUT`` usando :class:`Request`::
ru: Вот пример выполнения запроса PUT с использованием :class:`Request`::

source: Use of Basic HTTP Authentication::
pt_pt: Uso de Autenticação HTTP Básica::
ru: Использование базовой HTTP-аутентификации::

source: import urllib.request # Create an OpenerDirector with support for Basic HTTP Authentication... auth_handler = urllib.request.HTTPBasicAuthHandler() auth_handler.add_password(realm='PDQ Application', uri='https://mahler:8092/site-updates.py', user='klem', passwd='kadidd!ehopper') opener = urllib.request.build_opener(auth_handler) # ...and install it globally so it can be used with urlopen. urllib.request.install_opener(opener) with urllib.request.urlopen('http://www.example.com/login.html') as f: print(f.read().decode('utf-8'))
pt_pt: import urllib.request # Criar um OpenerDirector com suporte para Autenticação HTTP Básica... auth_handler = urllib.request.HTTPBasicAuthHandler() auth_handler.add_password(realm='PDQ Application', uri='https://mahler:8092/site-updates.py', user='klem', passwd='kadidd!ehopper') opener = urllib.request.build_opener(auth_handler) # ...e instalá-lo globalmente para que possa ser usado com urlopen. urllib.request.install_opener(opener) with urllib.request.urlopen('http://www.example.com/login.html') as f: print(f.read().decode('utf-8'))

source: :func:`build_opener` provides many handlers by default, including a :class:`ProxyHandler`. By default, :class:`ProxyHandler` uses the environment variables named ``<scheme>_proxy``, where ``<scheme>`` is the URL scheme involved. For example, the :envvar:`!http_proxy` environment variable is read to obtain the HTTP proxy's URL.
pt_pt: :func:`build_opener` fornece muitos manipuladores por padrão, incluindo um :class:`ProxyHandler`. Por padrão, :class:`ProxyHandler` usa as variáveis de ambiente nomeadas ``<scheme>_proxy``, onde ``<scheme>`` é o esquema de URL envolvido. Por exemplo, a variável de ambiente :envvar:`!http_proxy` é lida para obter a URL do proxy HTTP.

source: This example replaces the default :class:`ProxyHandler` with one that uses programmatically supplied proxy URLs, and adds proxy authorization support with :class:`ProxyBasicAuthHandler`. ::
pt_pt: Este exemplo substitui o :class:`ProxyHandler` predefinido por um que usa URLs de proxy fornecidas programaticamente e adiciona suporte de autorização de proxy com :class:`ProxyBasicAuthHandler`. ::
ru: В этом примере стандартный :class:`ProxyHandler` заменяется на тот, который использует программно предоставленные URL-адреса прокси-сервера, и добавляется поддержка авторизации прокси-сервера с помощью :class:`ProxyBasicAuthHandler`. ::

source: Adding HTTP headers:
pt_pt: Adicionando cabeçalhos HTTP:
ru: Добавление HTTP-заголовков:

source: Use the *headers* argument to the :class:`Request` constructor, or::
pt_pt: Use o argumento *headers* no construtor :class:`Request`, ou::
ru: Используйте аргумент *headers* для конструктора :class:`Request` или::

source: import urllib.request req = urllib.request.Request('http://www.example.com/') req.add_header('Referer', 'http://www.python.org/') # Customize the default User-Agent header value: req.add_header('User-Agent', 'urllib-example/0.1 (Contact: . . .)') with urllib.request.urlopen(req) as f: print(f.read().decode('utf-8'))
pt_pt: import urllib.request req = urllib.request.Request('http://www.example.com/') req.add_header('Referer', 'http://www.python.org/') # Personalizar o valor do cabeçalho User-Agent predefinido: req.add_header('User-Agent', 'urllib-example/0.1 (Contact: . . .)') with urllib.request.urlopen(req) as f: print(f.read().decode('utf-8'))

source: :class:`OpenerDirector` automatically adds a :mailheader:`User-Agent` header to every :class:`Request`. To change this::
pt_pt: :class:`OpenerDirector` adiciona automaticamente um cabeçalho :mailheader:`User-Agent` a cada :class:`Request`. Para alterar isto::
ru: :class:`OpenerDirector` автоматически добавляет заголовок :mailheader:`User-Agent` к каждому :class:`Request`. Чтобы изменить это:

source: Also, remember that a few standard headers (:mailheader:`Content-Length`, :mailheader:`Content-Type` and :mailheader:`Host`) are added when the :class:`Request` is passed to :func:`urlopen` (or :meth:`OpenerDirector.open`).
pt_pt: Além disso, lembre-se de que alguns cabeçalhos padrão (:mailheader:`Content-Length`, :mailheader:`Content-Type` e :mailheader:`Host`) são adicionados quando o :class:`Request` é passado para :func:`urlopen` (ou :meth:`OpenerDirector.open`).
ru: Также помните, что несколько стандартных заголовков (:mailheader:`Content-Length`, :mailheader:`Content-Type` и :mailheader:`Host`) добавляются, когда :class:`Request` передается :func: `urlopen` (или :meth:`OpenerDirector.open`).

source: Here is an example session that uses the ``GET`` method to retrieve a URL containing parameters::
pt_pt: Aqui está uma sessão de exemplo que usa o método ``GET`` para recuperar uma URL contendo parâmetros::
ru: Вот пример сеанса, в котором используется метод GET для получения URL-адреса, содержащего параметры:

source: The following example uses the ``POST`` method instead. Note that params output from urlencode is encoded to bytes before it is sent to urlopen as data::
pt_pt: O exemplo seguinte usa o método ``POST`` em vez disso. Note que a saída de params de urlencode é codificada para bytes antes de ser enviada para urlopen como dados::
ru: В следующем примере вместо этого используется метод POST. Обратите внимание, что выходные данные params из urlencode кодируются в байтах перед отправкой в ​​urlopen как данные::

source: The following example uses an explicitly specified HTTP proxy, overriding environment settings::
pt_pt: O exemplo seguinte usa um proxy HTTP explicitamente especificado, substituindo as configurações de ambiente::
ru: В следующем примере используется явно указанный HTTP-прокси, переопределяющий настройки среды:

source: The following example uses no proxies at all, overriding environment settings::
pt_pt: O exemplo seguinte não usa proxies, substituindo as configurações de ambiente::
ru: В следующем примере вообще не используются прокси-серверы, переопределяя настройки среды::

source: Legacy interface
pt_pt: Interface legada
ru: Устаревший интерфейс

source: The following functions and classes are ported from the Python 2 module ``urllib`` (as opposed to ``urllib2``). They might become deprecated at some point in the future.
pt_pt: As seguintes funções e classes são portadas do módulo Python 2 ``urllib`` (em oposição a ``urllib2``). Podem tornar-se obsoletas em algum momento no futuro.
ru: Следующие функции и классы перенесены из модуля Python 2 urllib (в отличие от urllib2). В какой-то момент в будущем они могут стать устаревшими.

source: Copy a network object denoted by a URL to a local file. If the URL points to a local file, the object will not be copied unless filename is supplied. Return a tuple ``(filename, headers)`` where *filename* is the local file name under which the object can be found, and *headers* is whatever the :meth:`!info` method of the object returned by :func:`urlopen` returned (for a remote object). Exceptions are the same as for :func:`urlopen`.
pt_pt: Copiar um objeto de rede denotado por uma URL para um ficheiro local. Se a URL apontar para um ficheiro local, o objeto não será copiado a menos que o nome do ficheiro seja fornecido. Retorna um tuplo ``(filename, headers)`` onde *filename* é o nome do ficheiro local sob o qual o objeto pode ser encontrado, e *headers* é o que o método :meth:`!info` do objeto retornado por :func:`urlopen` retornou (para um objeto remoto). As exceções são as mesmas que para :func:`urlopen`.

source: The second argument, if present, specifies the file location to copy to (if absent, the location will be a tempfile with a generated name). The third argument, if present, is a callable that will be called once on establishment of the network connection and once after each block read thereafter. The callable will be passed three arguments; a count of blocks transferred so far, a block size in bytes, and the total size of the file. The third argument may be ``-1`` on older FTP servers which do not return a file size in response to a retrieval request.
pt_pt: O segundo argumento, se presente, especifica a localização do ficheiro para copiar (se ausente, a localização será um ficheiro temporário com um nome gerado). O terceiro argumento, se presente, é um objeto chamável que será chamado uma vez no estabelecimento da conexão de rede e uma vez após cada bloco lido posteriormente. O objeto chamável receberá três argumentos: uma contagem dos blocos transferidos até agora, um tamanho de bloco em bytes e o tamanho total do ficheiro. O terceiro argumento pode ser ``-1`` em servidores FTP mais antigos que não retornam um tamanho de ficheiro em resposta a um pedido de recuperação.
ru: Второй аргумент, если он присутствует, указывает расположение файла для копирования (если он отсутствует, это будет временный файл со сгенерированным именем). Третий аргумент, если он присутствует, является вызываемым объектом, который будет вызываться один раз при установлении сетевого соединения и один раз после каждого последующего чтения блока. Вызываемому объекту будут переданы три аргумента; количество переданных блоков, размер блока в байтах и ​​общий размер файла. Третий аргумент может быть ``-1`` на старых FTP-серверах, которые не возвращают размер файла в ответ на запрос на получение.

source: The following example illustrates the most common usage scenario::
pt_pt: O exemplo seguinte ilustra o cenário de uso mais comum::
ru: Следующий пример иллюстрирует наиболее распространенный сценарий использования:

source: If the *url* uses the :file:`http:` scheme identifier, the optional *data* argument may be given to specify a ``POST`` request (normally the request type is ``GET``). The *data* argument must be a bytes object in standard :mimetype:`application/x-www-form-urlencoded` format; see the :func:`urllib.parse.urlencode` function.
pt_pt: Se a *url* usar o identificador de esquema :file:`http:`, o argumento opcional *data* pode ser fornecido para especificar um pedido ``POST`` (normalmente o tipo de pedido é ``GET``). O argumento *data* deve ser um objeto bytes no formato padrão :mimetype:`application/x-www-form-urlencoded`; veja a função :func:`urllib.parse.urlencode`.
ru: Если *url* использует идентификатор схемы :file:`http:`, можно указать необязательный аргумент *data* для указания запроса ``POST`` (обычно тип запроса - ``GET``). Аргумент *data* должен быть байтовым объектом в стандартном формате :mimetype:`application/x-www-form-urlencoded`; см. функцию :func:`urllib.parse.urlencode`.

source: :func:`urlretrieve` will raise :exc:`~urllib.error.ContentTooShortError` when it detects that the amount of data available was less than the expected amount (which is the size reported by a *Content-Length* header). This can occur, for example, when the download is interrupted.
pt_pt: :func:`urlretrieve` levantará :exc:`~urllib.error.ContentTooShortError` quando detetar que a quantidade de dados disponível foi menor do que a quantidade esperada (que é o tamanho reportado pelo cabeçalho *Content-Length*). Isto pode ocorrer, por exemplo, quando o download é interrompido.

source: The *Content-Length* is treated as a lower bound: if there's more data to read, urlretrieve reads more data, but if less data is available, it raises the exception.
pt_pt: O *Content-Length* é tratado como um limite inferior: se houver mais dados para ler, urlretrieve lê mais dados, mas se houver menos dados disponíveis, levanta a exceção.
ru: *Content-Length* рассматривается как нижняя граница: если нужно прочитать больше данных, urlretrive считывает больше данных, но если доступно меньше данных, возникает исключение.

source: You can still retrieve the downloaded data in this case, it is stored in the :attr:`!content` attribute of the exception instance.
pt_pt: Neste caso, ainda pode recuperar os dados descarregados, que estão armazenados no atributo :attr:`!content` da instância da exceção.

source: If no *Content-Length* header was supplied, urlretrieve can not check the size of the data it has downloaded, and just returns it. In this case you just have to assume that the download was successful.
pt_pt: Se nenhum cabeçalho *Content-Length* for fornecido, urlretrieve não pode verificar o tamanho dos dados que descarregou e simplesmente os retorna. Neste caso, tem de assumir que o download foi bem-sucedido.
ru: Если заголовок *Content-Length* не был указан, urlretrieve не может проверить размер загруженных данных и просто возвращает их. В этом случае вам остается лишь предположить, что загрузка прошла успешно.

source: Cleans up temporary files that may have been left behind by previous calls to :func:`urlretrieve`.
pt_pt: Limpa ficheiros temporários que podem ter sido deixados por chamadas anteriores a :func:`urlretrieve`.
ru: Очищает временные файлы, которые могли остаться после предыдущих вызовов :func:`urlretrieve`.

source: :mod:`urllib.request` Restrictions
pt_pt: Restrições do :mod:`urllib.request`
ru: Ограничения :mod:`urllib.request`

source: Currently, only the following protocols are supported: HTTP (versions 0.9 and 1.0), FTP, local files, and data URLs.
pt_pt: Atualmente, apenas os seguintes protocolos são suportados: HTTP (versões 0.9 e 1.0), FTP, ficheiros locais e URLs de dados.
ru: В настоящее время поддерживаются только следующие протоколы: HTTP (версии 0.9 и 1.0), FTP, локальные файлы и URL-адреса данных.

source: Added support for data URLs.
pt_pt: Adicionado suporte para URLs de dados.
ru: Добавлена ​​поддержка URL-адресов данных.

source: The caching feature of :func:`urlretrieve` has been disabled until someone finds the time to hack proper processing of Expiration time headers.
pt_pt: A funcionalidade de cache de :func:`urlretrieve` foi desativada até que alguém tenha tempo para implementar corretamente o processamento dos cabeçalhos de tempo de expiração.
ru: Функция кэширования :func:`urlretrieve` была отключена до тех пор, пока кто-нибудь не найдет время взломать правильную обработку заголовков времени истечения срока действия.

source: There should be a function to query whether a particular URL is in the cache.
pt_pt: Deve existir uma função para consultar se uma URL específica está na cache.
ru: Должна быть функция для запроса, находится ли конкретный URL-адрес в кеше.

source: For backward compatibility, if a URL appears to point to a local file but the file can't be opened, the URL is re-interpreted using the FTP protocol. This can sometimes cause confusing error messages.
pt_pt: Por compatibilidade retroativa, se uma URL parecer apontar para um ficheiro local mas o ficheiro não puder ser aberto, a URL é re-interpretada usando o protocolo FTP. Isto pode, por vezes, causar mensagens de erro confusas.
ru: В целях обратной совместимости, если URL-адрес указывает на локальный файл, но его невозможно открыть, URL-адрес интерпретируется заново с использованием протокола FTP. Иногда это может привести к появлению запутанных сообщений об ошибках.

source: The :func:`urlopen` and :func:`urlretrieve` functions can cause arbitrarily long delays while waiting for a network connection to be set up. This means that it is difficult to build an interactive web client using these functions without using threads.
pt_pt: As funções :func:`urlopen` e :func:`urlretrieve` podem causar atrasos arbitrariamente longos enquanto aguardam que uma ligação de rede seja estabelecida. Isto significa que é difícil construir um cliente web interativo usando estas funções sem recorrer a threads.
ru: Функции :func:`urlopen` и :func:`urlretrieve` могут вызывать сколь угодно длительные задержки при ожидании установки сетевого подключения. Это означает, что сложно создать интерактивный веб-клиент с использованием этих функций без использования потоков.

source: The data returned by :func:`urlopen` or :func:`urlretrieve` is the raw data returned by the server. This may be binary data (such as an image), plain text or (for example) HTML. The HTTP protocol provides type information in the reply header, which can be inspected by looking at the :mailheader:`Content-Type` header. If the returned data is HTML, you can use the module :mod:`html.parser` to parse it.
pt_pt: Os dados retornados por :func:`urlopen` ou :func:`urlretrieve` são os dados brutos retornados pelo servidor. Estes podem ser dados binários (como uma imagem), texto simples ou (por exemplo) HTML. O protocolo HTTP fornece informações de tipo no cabeçalho da resposta, que podem ser inspecionadas olhando para o cabeçalho :mailheader:`Content-Type`. Se os dados retornados forem HTML, pode usar o módulo :mod:`html.parser` para os analisar.
ru: Данные, возвращаемые :func:`urlopen` или :func:`urlretrive`, являются необработанными данными, возвращаемыми сервером. Это могут быть двоичные данные (например, изображение), обычный текст или (например) HTML. Протокол HTTP предоставляет информацию о типе в заголовке ответа, которую можно проверить, просмотрев заголовок :mailheader:`Content-Type`. Если возвращаемые данные представляют собой HTML, вы можете использовать модуль :mod:`html.parser` для их анализа.

source: :mod:`urllib.response` --- Response classes used by urllib
pt_pt: :mod:`urllib.response` --- Classes de resposta usadas pelo urllib
ru: :mod:`urllib.response` --- Классы ответов, используемые urllib

source: The :mod:`urllib.response` module defines functions and classes which define a minimal file-like interface, including ``read()`` and ``readline()``. Functions defined by this module are used internally by the :mod:`urllib.request` module. The typical response object is a :class:`urllib.response.addinfourl` instance:
pt_pt: O módulo :mod:`urllib.response` define funções e classes que definem uma interface mínima semelhante a um ficheiro, incluindo ``read()`` e ``readline()``. As funções definidas por este módulo são usadas internamente pelo módulo :mod:`urllib.request`. O objeto de resposta típico é uma instância :class:`urllib.response.addinfourl`:
ru: Модуль :mod:`urllib.response` определяет функции и классы, которые определяют минимальный файловый интерфейс, включая ``read()`` и ``readline()``. Функции, определенные этим модулем, используются внутри модуля :mod:`urllib.request`. Типичным объектом ответа является экземпляр :class:`urllib.response.addinourl`:

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
pt_pt: URL do recurso recuperado, comumente usada para determinar se um redirecionamento foi seguido.
ru: URL-адрес полученного ресурса, обычно используемый для определения того, было ли выполнено перенаправление.

source: Returns the headers of the response in the form of an :class:`~email.message.EmailMessage` instance.
pt_pt: Retorna os cabeçalhos da resposta na forma de uma instância :class:`~email.message.EmailMessage`.
ru: Возвращает заголовки ответа в форме экземпляра :class:`~email.message.EmailMessage`.

source: Status code returned by server.
pt_pt: Código de estado retornado pelo servidor.
ru: Код состояния, возвращенный сервером.

source: Deprecated in favor of :attr:`~addinfourl.url`.
pt_pt: Obsoleto em favor de :attr:`~addinfourl.url`.
ru: Устарело в пользу :attr:`~addinourl.url`.

source: Deprecated in favor of :attr:`~addinfourl.headers`.
pt_pt: Obsoleto em favor de :attr:`~addinfourl.headers`.
ru: Устарело в пользу :attr:`~addinourl.headers`.

source: Deprecated in favor of :attr:`~addinfourl.status`.
pt_pt: Obsoleto em favor de :attr:`~addinfourl.status`.
ru: Устарело в пользу :attr:`~addinourl.status`.

source: protocol
pt_pt: protocolo
