Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/venv.po
Languages: ru, sv

source: *prompt* -- a string to be used after virtual environment is activated (defaults to ``None`` which means directory name of the environment would be used). If the special string ``"."`` is provided, the basename of the current directory is used as the prompt.
ru: *prompt* — строка, которая будет использоваться после активации виртуальной среды (по умолчанию «Нет», что означает, что будет использоваться имя каталога среды). Если указана специальная строка ``"."``, в качестве подсказки используется базовое имя текущего каталога.

source: *upgrade_deps* -- Update the base venv modules to the latest on PyPI
ru: *upgrade_deps* — Обновите базовые модули venv до последней версии PyPI.

source: Added the ``with_pip`` parameter
ru: Добавлен параметр ``with_pip``.
sv: Lagt till parametern ``with_pip``

source: Added the ``prompt`` parameter
ru: Добавлен параметр ``prompt``.
sv: Lagt till parametern ``prompt``

source: Added the ``upgrade_deps`` parameter
ru: Добавлен параметр ``upgrade_deps``.
sv: Lagt till parametern ``upgrade_deps``

source: :class:`EnvBuilder` may be used as a base class.
ru: :class:`EnvBuilder` можно использовать в качестве базового класса.

source: Create a virtual environment by specifying the target directory (absolute or relative to the current directory) which is to contain the virtual environment. The ``create`` method will either create the environment in the specified directory, or raise an appropriate exception.
ru: Создайте виртуальную среду, указав целевой каталог (абсолютный или относительный к текущему каталогу), в котором должна находиться виртуальная среда. Метод create либо создаст среду в указанном каталоге, либо вызовет соответствующее исключение.
sv: Skapa en virtuell miljö genom att ange den målkatalog (absolut eller relativt den aktuella katalogen) som ska innehålla den virtuella miljön. Metoden ``create`` kommer antingen att skapa miljön i den angivna katalogen eller ge upphov till ett lämpligt undantag.

source: The ``create`` method of the :class:`EnvBuilder` class illustrates the hooks available for subclass customization::
ru: Метод ``create`` класса :class:`EnvBuilder` иллюстрирует перехватчики, доступные для настройки подкласса:
sv: Metoden ``create`` i klassen :class:`EnvBuilder` illustrerar de hooks som finns tillgängliga för anpassning av underklasser::

source: Each of the methods :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` and :meth:`post_setup` can be overridden.
ru: Каждый из методов :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` и :meth:`post_setup` может быть переопределен.
sv: Var och en av metoderna :meth:`ensure_directories`, :meth:`create_configuration`, :meth:`setup_python`, :meth:`setup_scripts` och :meth:`post_setup` kan åsidosättas.

source: Creates the environment directory and all necessary subdirectories that don't already exist, and returns a context object. This context object is just a holder for attributes (such as paths) for use by the other methods. If the :class:`EnvBuilder` is created with the arg ``clear=True``, contents of the environment directory will be cleared and then all necessary subdirectories will be recreated.
ru: Создает каталог среды и все необходимые подкаталоги, которые еще не существуют, и возвращает объект контекста. Этот объект контекста является просто хранилищем атрибутов (например, путей) для использования другими методами. Если :class:`EnvBuilder` создается с аргументом ``clear=True``, содержимое каталога среды будет очищено, а затем все необходимые подкаталоги будут созданы заново.
sv: Skapar miljökatalogen och alla nödvändiga underkataloger som inte redan finns, och returnerar ett kontextobjekt. Detta kontextobjekt är bara en hållare för attribut (t.ex. sökvägar) som kan användas av de andra metoderna. Om :class:`EnvBuilder` skapas med argumentet ``clear=True``, kommer innehållet i miljökatalogen att rensas och sedan kommer alla nödvändiga underkataloger att återskapas.

source: The returned context object is a :class:`types.SimpleNamespace` with the following attributes:
ru: Возвращаемый объект контекста представляет собой :class:`types.SimpleNamespace` со следующими атрибутами:
sv: Det returnerade kontextobjektet är en :class:`types.SimpleNamespace` med följande attribut:

source: ``env_dir`` - The location of the virtual environment. Used for ``__VENV_DIR__`` in activation scripts (see :meth:`install_scripts`).
ru: ``env_dir`` — расположение виртуальной среды. Используется для ``__VENV_DIR__`` в сценариях активации (см. :meth:`install_scripts`).
sv: ``env_dir`` - Platsen för den virtuella miljön. Används för ``__VENV_DIR__`` i aktiveringsskript (se :meth:`install_scripts`).

source: ``env_name`` - The name of the virtual environment. Used for ``__VENV_NAME__`` in activation scripts (see :meth:`install_scripts`).
ru: ``env_name`` — имя виртуальной среды. Используется для ``__VENV_NAME__`` в сценариях активации (см. :meth:`install_scripts`).
sv: ``env_name`` - Namnet på den virtuella miljön. Används för ``__VENV_NAME__`` i aktiveringsskript (se :meth:`install_scripts`).

source: ``prompt`` - The prompt to be used by the activation scripts. Used for ``__VENV_PROMPT__`` in activation scripts (see :meth:`install_scripts`).
ru: ``prompt`` — приглашение, которое будет использоваться сценариями активации. Используется для ``__VENV_PROMPT__`` в сценариях активации (см. :meth:`install_scripts`).
sv: ``prompt`` - Prompten som ska användas av aktiveringsskripten. Används för ``__VENV_PROMPT__`` i aktiveringsskript (se :meth:`install_scripts`).

source: ``executable`` - The underlying Python executable used by the virtual environment. This takes into account the case where a virtual environment is created from another virtual environment.
ru: ``исполняемый файл`` — базовый исполняемый файл Python, используемый виртуальной средой. При этом учитывается случай, когда виртуальная среда создается из другой виртуальной среды.
sv: ``executable`` - Den underliggande Python-körbara filen som används av den virtuella miljön. Detta tar hänsyn till det fall då en virtuell miljö skapas från en annan virtuell miljö.

source: ``inc_path`` - The include path for the virtual environment.
ru: ``inc_path`` — путь включения для виртуальной среды.
sv: ``inc_path`` - Inkluderingssökvägen för den virtuella miljön.

source: ``lib_path`` - The purelib path for the virtual environment.
ru: ``lib_path`` — путь к чистой библиотеке виртуальной среды.
sv: ``lib_path`` - Sökvägen till purelib för den virtuella miljön.

source: ``bin_path`` - The script path for the virtual environment.
ru: ``bin_path`` — путь к сценарию для виртуальной среды.
sv: ``bin_path`` - Skriptsökvägen för den virtuella miljön.

source: ``bin_name`` - The name of the script path relative to the virtual environment location. Used for ``__VENV_BIN_NAME__`` in activation scripts (see :meth:`install_scripts`).
ru: ``bin_name`` — имя пути сценария относительно местоположения виртуальной среды. Используется для ``__VENV_BIN_NAME__`` в сценариях активации (см. :meth:`install_scripts`).
sv: ``bin_name`` - Namnet på skriptsökvägen i förhållande till den virtuella miljöns plats. Används för ``__VENV_BIN_NAME__`` i aktiveringsskript (se :meth:`install_scripts`).

source: ``env_exe`` - The name of the Python interpreter in the virtual environment. Used for ``__VENV_PYTHON__`` in activation scripts (see :meth:`install_scripts`).
ru: ``env_exe`` — имя интерпретатора Python в виртуальной среде. Используется для ``__VENV_PYTHON__`` в сценариях активации (см. :meth:`install_scripts`).
sv: ``env_exe`` - Namnet på Python-tolken i den virtuella miljön. Används för ``__VENV_PYTHON__`` i aktiveringsskript (se :meth:`install_scripts`).

source: ``env_exec_cmd`` - The name of the Python interpreter, taking into account filesystem redirections. This can be used to run Python in the virtual environment.
ru: ``env_exec_cmd`` — имя интерпретатора Python с учетом перенаправления файловой системы. Это можно использовать для запуска Python в виртуальной среде.
sv: ``env_exec_cmd`` - Namnet på Python-tolken, med hänsyn tagen till omdirigeringar i filsystemet. Detta kan användas för att köra Python i den virtuella miljön.

source: The *venv* :ref:`sysconfig installation scheme <installation_paths>` is used to construct the paths of the created directories.
ru: Схема установки *venv* :ref:`sysconfig <installation_paths>` используется для построения путей к создаваемым каталогам.
sv: *venv* :ref:`sysconfig-installationsschemat <installation_paths>` används för att konstruera sökvägarna till de skapade katalogerna.

source: The attribute ``lib_path`` was added to the context, and the context object was documented.
ru: Атрибут lib_path был добавлен в контекст, и объект контекста был задокументирован.

source: Creates the ``pyvenv.cfg`` configuration file in the environment.
ru: Создает файл конфигурации pyvenv.cfg в среде.
sv: Skapar konfigurationsfilen ``pyvenv.cfg`` i miljön.

source: Creates a copy or symlink to the Python executable in the environment. On POSIX systems, if a specific executable ``python3.x`` was used, symlinks to ``python`` and ``python3`` will be created pointing to that executable, unless files with those names already exist.
ru: Создает копию или символическую ссылку на исполняемый файл Python в среде. В системах POSIX, если использовался определенный исполняемый файл ``python3.x``, будут созданы символические ссылки на ``python`` и ``python3``, указывающие на этот исполняемый файл, если файлы с такими именами уже не существуют.
sv: Skapar en kopia eller en symbolisk länk till den körbara Python-filen i miljön. På POSIX-system, om en specifik körbar ``python3.x`` användes, kommer symlänkar till ``python`` och ``python3`` att skapas som pekar på den körbara filen, såvida inte filer med dessa namn redan finns.

source: Installs activation scripts appropriate to the platform into the virtual environment.
ru: Устанавливает в виртуальную среду сценарии активации, соответствующие платформе.
sv: Installerar aktiveringsskript som är lämpliga för plattformen i den virtuella miljön.

source: Upgrades the core venv dependency packages (currently :pypi:`pip`) in the environment. This is done by shelling out to the ``pip`` executable in the environment.
ru: Обновляет основные пакеты зависимостей venv (в настоящее время :pypi:`pip`) в среде. Это делается путем вызова исполняемого файла ``pip`` в среде.

source: :pypi:`setuptools` is no longer a core venv dependency.
ru: :pypi:`setuptools` больше не является основной зависимостью venv.

source: A placeholder method which can be overridden in third party implementations to pre-install packages in the virtual environment or perform other post-creation steps.
ru: Метод-заполнитель, который можно переопределить в сторонних реализациях для предварительной установки пакетов в виртуальной среде или выполнения других шагов после создания.
sv: En platshållande metod som kan åsidosättas i tredjepartsimplementeringar för att förinstallera paket i den virtuella miljön eller utföra andra steg efter skapandet.

source: This method can be called from :meth:`setup_scripts` or :meth:`post_setup` in subclasses to assist in installing custom scripts into the virtual environment.
ru: Этот метод можно вызвать из :meth:`setup_scripts` или :meth:`post_setup` в подклассах, чтобы помочь в установке пользовательских сценариев в виртуальную среду.

source: *path* is the path to a directory that should contain subdirectories ``common``, ``posix``, ``nt``; each containing scripts destined for the ``bin`` directory in the environment. The contents of ``common`` and the directory corresponding to :data:`os.name` are copied after some text replacement of placeholders:
ru: *path* — путь к каталогу, который должен содержать подкаталоги ``common``, ``posix``, ``nt``; каждый из которых содержит сценарии, предназначенные для каталога ``bin`` в среде. Содержимое ``common`` и каталог, соответствующий :data:`os.name`, копируются после некоторой текстовой замены заполнителей:

source: ``__VENV_DIR__`` is replaced with the absolute path of the environment directory.
ru: ``__VENV_DIR__`` заменяется абсолютным путем к каталогу среды.
sv: ``__VENV_DIR__`` ersätts med den absoluta sökvägen till miljökatalogen.

source: ``__VENV_NAME__`` is replaced with the environment name (final path segment of environment directory).
ru: ``__VENV_NAME__`` заменяется именем среды (конечный сегмент пути к каталогу среды).
sv: ``__VENV_NAME__`` ersätts med miljönamnet (sista sökvägssegmentet i miljökatalogen).

source: ``__VENV_PROMPT__`` is replaced with the prompt (the environment name surrounded by parentheses and with a following space)
ru: ``__VENV_PROMPT__`` заменяется приглашением (имя среды, заключенное в круглые скобки и следующий за ним пробел)
sv: ``__VENV_PROMPT__`` ersätts med prompt (miljöns namn omgivet av parenteser och med ett efterföljande mellanslag)

source: ``__VENV_BIN_NAME__`` is replaced with the name of the bin directory (either ``bin`` or ``Scripts``).
ru: ``__VENV_BIN_NAME__`` заменяется именем каталога bin (либо ``bin``, либо ``Scripts``).
sv: ``__VENV_BIN_NAME__`` ersätts med namnet på bin-katalogen (antingen ``bin`` eller ``Scripts``).

source: ``__VENV_PYTHON__`` is replaced with the absolute path of the environment's executable.
ru: ``__VENV_PYTHON__`` заменяется абсолютным путем к исполняемому файлу среды.
sv: ``__VENV_PYTHON__`` ersätts med den absoluta sökvägen till miljöns körbara fil.

source: The directories are allowed to exist (for when an existing environment is being upgraded).
ru: Каталогам разрешено существование (при обновлении существующей среды).
sv: Katalogerna får existera (för när en befintlig miljö uppgraderas).

source: Windows now uses redirector scripts for ``python[w].exe`` instead of copying the actual binaries. In 3.7.2 only :meth:`setup_python` does nothing unless running from a build in the source tree.
ru: Windows теперь использует сценарии перенаправления для ``python[w].exe`` вместо копирования реальных двоичных файлов. Только в версии 3.7.2 :meth:`setup_python` ничего не делает, если не запускается из сборки в дереве исходного кода.
sv: Windows använder nu omdirigeringsskript för ``python[w].exe`` istället för att kopiera de faktiska binärerna. I 3.7.2 gör endast :meth:`setup_python` ingenting om den inte körs från en build i källträdet.

source: Windows copies the redirector scripts as part of :meth:`setup_python` instead of :meth:`setup_scripts`. This was not the case in 3.7.2. When using symlinks, the original executables will be linked.
ru: Windows копирует сценарии перенаправления как часть :meth:`setup_python` вместо :meth:`setup_scripts`. В 3.7.2 этого не было. При использовании символических ссылок будут связаны исходные исполняемые файлы.
sv: Windows kopierar redirector-skript som en del av :meth:`setup_python` istället för :meth:`setup_scripts`. Detta var inte fallet i 3.7.2. Vid användning av symlänkar länkas de ursprungliga körbara filerna.

source: There is also a module-level convenience function:
ru: Также имеется удобная функция на уровне модуля:
sv: Det finns också en bekvämlighetsfunktion på modulnivå:

source: Create an :class:`EnvBuilder` with the given keyword arguments, and call its :meth:`~EnvBuilder.create` method with the *env_dir* argument.
ru: Создайте :class:`EnvBuilder` с заданными аргументами ключевого слова и вызовите его метод :meth:`~EnvBuilder.create` с аргументом *env_dir*.
sv: Skapa en :class:`EnvBuilder` med de angivna nyckelordsargumenten, och anropa dess :meth:`~EnvBuilder.create`\-metod med argumentet *env_dir*.

source: Added the *with_pip* parameter
ru: Добавлен параметр *with_pip*.

source: Added the *prompt* parameter
ru: Добавлен параметр *prompt*

source: Added the *upgrade_deps* parameter
ru: Добавлен параметр *upgrade_deps*.

source: An example of extending ``EnvBuilder``
ru: Пример расширения EnvBuilder
sv: Ett exempel på utökning av ``EnvBuilder``

source: The following script shows how to extend :class:`EnvBuilder` by implementing a subclass which installs setuptools and pip into a created virtual environment::
ru: Следующий скрипт показывает, как расширить :class:`EnvBuilder` путем реализации подкласса, который устанавливает инструменты настройки и pip в созданную виртуальную среду:
sv: Följande skript visar hur man utökar :class:`EnvBuilder` genom att implementera en underklass som installerar setuptools och pip i en skapad virtuell miljö::

source: This script is also available for download `online <https://gist.github.com/vsajip/4673395>`_.
ru: Этот сценарий также доступен для загрузки онлайн <https://gist.github.com/vsajip/4673395>_.
sv: Detta skript finns också tillgängligt för nedladdning `online <https://gist.github.com/vsajip/4673395>`_.

source: Environments
ru: Окружающая среда
sv: Miljöer

source: virtual
ru: виртуальный
sv: virtuell

source: :samp:`$ source {<venv>}/bin/activate`
sv: :samp:`$ källa {<venv>}/bin/activate`

source: :samp:`$ source {<venv>}/bin/activate.fish`
sv: :samp:`$ källa {<venv>}/bin/activate.fish`

source: :samp:`$ source {<venv>}/bin/activate.csh`
sv: :samp:`$ källa {<venv>}/bin/activate.csh`
