Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/venv.po
Languages: ru, sv

source: :mod:`!venv` --- Creation of virtual environments
ru: Дополнительную информацию об ABC см. в модулях :mod:`abc` и :pep:`3119`.

source: **Source code:** :source:`Lib/venv/`
ru: **Исходный код:** :source:`Lib/venv/`
sv: **Källkod:** :source:`Lib/venv/`

source: The :mod:`!venv` module supports creating lightweight "virtual environments", each with their own independent set of Python packages installed in their :mod:`site` directories. A virtual environment is created on top of an existing Python installation, known as the virtual environment's "base" Python, and may optionally be isolated from the packages in the base environment, so only those explicitly installed in the virtual environment are available.
ru: Модуль :mod:`!venv` поддерживает создание облегченных «виртуальных сред», каждая из которых имеет свой собственный независимый набор пакетов Python, установленных в их каталогах :mod:`site`. Виртуальная среда создается поверх существующей установки Python, известная как «базовый» Python виртуальной среды, и при необходимости может быть изолирована от пакетов в базовой среде, поэтому доступны только те пакеты, которые явно установлены в виртуальной среде.

source: When used from within a virtual environment, common installation tools such as :pypi:`pip` will install Python packages into a virtual environment without needing to be told to do so explicitly.
ru: При использовании в виртуальной среде обычные инструменты установки, такие как :pypi:`pip`, установят пакеты Python в виртуальную среду без необходимости явного указания сделать это.

source: A virtual environment is (amongst other things):
ru: Виртуальная среда – это (помимо прочего):
sv: En virtuell miljö är (bland annat):

source: Used to contain a specific Python interpreter and software libraries and binaries which are needed to support a project (library or application). These are by default isolated from software in other virtual environments and Python interpreters and libraries installed in the operating system.
ru: Используется для хранения определенного интерпретатора Python, а также программных библиотек и двоичных файлов, необходимых для поддержки проекта (библиотеки или приложения). По умолчанию они изолированы от программного обеспечения в других виртуальных средах, а также от интерпретаторов и библиотек Python, установленных в операционной системе.
sv: Används för att innehålla en specifik Python-tolk och programvarubibliotek och binärfiler som behövs för att stödja ett projekt (bibliotek eller applikation). Dessa är som standard isolerade från programvara i andra virtuella miljöer och Python-tolkar och -bibliotek som är installerade i operativsystemet.

source: Contained in a directory, conventionally named ``.venv`` or ``venv`` in the project directory, or under a container directory for lots of virtual environments, such as ``~/.virtualenvs``.
ru: Содержится в каталоге с традиционным именем ``.venv`` или ``venv`` в каталоге проекта или в каталоге контейнера для множества виртуальных сред, например ``~/.virtualenvs``.

source: Not checked into source control systems such as Git.
ru: Не проверено в системах контроля версий, таких как Git.
sv: Inte checkat in i källkontrollsystem som Git.

source: Considered as disposable -- it should be simple to delete and recreate it from scratch. You don't place any project code in the environment.
ru: Считается одноразовым — его должно быть легко удалить и воссоздать с нуля. Вы не размещаете код проекта в среде.

source: Not considered as movable or copyable -- you just recreate the same environment in the target location.
ru: Не считается переносимым или копируемым — вы просто воссоздаете ту же среду в целевом месте.
sv: Betraktas inte som flyttbar eller kopierbar - man återskapar bara samma miljö på målplatsen.

source: See :pep:`405` for more background on Python virtual environments.
ru: См. :pep:`405` для получения дополнительной информации о виртуальных средах Python.
sv: Se :pep:`405` för mer bakgrund om virtuella Python-miljöer.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/guides/installing-using-pip-and-virtual-environments/#create-and-use-virtual-environments>`__
ru: `Руководство пользователя по упаковке Python: Создание и использование виртуальных сред <https://packaging.python.org/guides/installing-using-pip-and-virtual-environments/#create-and-use-virtual-environments>`__
sv: `Användarhandbok för Python Packaging: Skapa och använda virtuella miljöer <https://packaging.python.org/guides/installing-using-pip-and-virtual-environments/#create-and-use-virtual-environments>`__

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.

source: Creating virtual environments
ru: Создание виртуальных сред
sv: Skapa virtuella miljöer

source: :ref:`Virtual environments <venv-def>` are created by executing the ``venv`` module:
ru: :ref:`Виртуальные среды <venv-def>` создаются путем выполнения модуля ``venv``:

source: This creates the target directory (including parent directories as needed) and places a :file:`pyvenv.cfg` file in it with a ``home`` key pointing to the Python installation from which the command was run. It also creates a :file:`bin` (or :file:`Scripts` on Windows) subdirectory containing a copy or symlink of the Python executable (as appropriate for the platform or arguments used at environment creation time). It also creates a :file:`lib/pythonX.Y/site-packages` subdirectory (on Windows, this is :file:`Lib\site-packages`). If an existing directory is specified, it will be re-used.
ru: При этом создается целевой каталог (включая родительские каталоги, если необходимо) и помещается в него файл :file:`pyvenv.cfg` с ключом ``home``, указывающим на установку Python, из которой была запущена команда. Он также создает подкаталог :file:`bin` (или :file:`Scripts` в Windows), содержащий копию или символическую ссылку исполняемого файла Python (в зависимости от платформы или аргументов, используемых во время создания среды). Он также создает подкаталог :file:`lib/pythonX.Y/site-packages` (в Windows это :file:`Lib\site-packages`). Если указан существующий каталог, он будет использован повторно.

source: The use of ``venv`` is now recommended for creating virtual environments.
ru: Теперь для создания виртуальных сред рекомендуется использовать venv.
sv: Användningen av ``venv`` rekommenderas nu för att skapa virtuella miljöer.

source: :program:`pyvenv` was the recommended tool for creating virtual environments for Python 3.3 and 3.4, and replaced in 3.5 by executing ``venv`` directly.
ru: :program:`pyvenv` был рекомендуемым инструментом для создания виртуальных сред для Python 3.3 и 3.4 и заменен в версии 3.5 прямым запуском ``venv``.

source: On Windows, invoke the ``venv`` command as follows:
ru: В Windows вызовите команду venv следующим образом:

source: The command, if run with ``-h``, will show the available options::
ru: Команда, если ее запустить с ``-h``, покажет доступные параметры:
sv: Kommandot, om det körs med ``\-h``, kommer att visa de tillgängliga alternativen::

source: Installs pip by default, added the ``--without-pip`` and ``--copies`` options.
ru: Устанавливает pip по умолчанию, добавлены опции ``--without-pip`` и ``--copies``.

source: In earlier versions, if the target directory already existed, an error was raised, unless the ``--clear`` or ``--upgrade`` option was provided.
ru: В более ранних версиях, если целевой каталог уже существовал, возникала ошибка, если не была предоставлена ​​опция ``--clear`` или ``--upgrade``.
sv: I tidigare versioner gavs ett felmeddelande ut om målkatalogen redan fanns, såvida inte alternativet ``\--clear`` eller ``\--upgrade`` hade angetts.

source: Add ``--upgrade-deps`` option to upgrade pip + setuptools to the latest on PyPI.
ru: Добавьте опцию --upgrade-deps для обновления pip + setuptools до последней версии PyPI.

source: ``setuptools`` is no longer a core venv dependency.
ru: ``setuptools`` больше не является основной зависимостью venv.

source: While symlinks are supported on Windows, they are not recommended. Of particular note is that double-clicking ``python.exe`` in File Explorer will resolve the symlink eagerly and ignore the virtual environment.
ru: Хотя символические ссылки поддерживаются в Windows, использовать их не рекомендуется. Особо следует отметить, что двойной щелчок по ``python.exe`` в проводнике быстро разрешает символическую ссылку и игнорирует виртуальную среду.
sv: Även om symlinks stöds i Windows rekommenderas de inte. Särskilt värt att notera är att om du dubbelklickar på ``python.exe`` i File Explorer kommer symbollänken att lösas ivrigt och ignorera den virtuella miljön.

source: On Microsoft Windows, it may be required to enable the ``Activate.ps1`` script by setting the execution policy for the user. You can do this by issuing the following PowerShell command:
ru: В Microsoft Windows может потребоваться включить сценарий «Activate.ps1», установив политику выполнения для пользователя. Вы можете сделать это, введя следующую команду PowerShell:
sv: I Microsoft Windows kan det vara nödvändigt att aktivera skriptet ``Activate.ps1`` genom att ange exekveringsprincipen för användaren. Du kan göra detta genom att utfärda följande PowerShell-kommando:

source: See `About Execution Policies <https://go.microsoft.com/fwlink/?LinkID=135170>`_ for more information.
ru: Дополнительную информацию см. в разделе `О политиках выполнения <https://go.microsoft.com/fwlink/?LinkID=135170>`_.
sv: Se `Om exekveringsprinciper <https://go.microsoft.com/fwlink/?LinkID=135170>`_" för mer information.

source: The created :file:`pyvenv.cfg` file also includes the ``include-system-site-packages`` key, set to ``true`` if ``venv`` is run with the ``--system-site-packages`` option, ``false`` otherwise.
ru: Созданный файл :file:`pyvenv.cfg` также включает ключ ``include-system-site-packages``, установленный в ``true``, если ``venv`` запускается с ``--system- site-packages``, в противном случае ``false``.

source: Unless the ``--without-pip`` option is given, :mod:`ensurepip` will be invoked to bootstrap ``pip`` into the virtual environment.
ru: Если не указана опция ``--without-pip``, :mod:`ensurepip` будет вызываться для загрузки ``pip`` в виртуальную среду.
sv: Om inte alternativet ``\--without-pip`` anges, kommer :mod:`ensurepip`` att anropas för att starta upp ``pip`` i den virtuella miljön.

source: Multiple paths can be given to ``venv``, in which case an identical virtual environment will be created, according to the given options, at each provided path.
ru: Для ``venv`` может быть задано несколько путей, и в этом случае на каждом предоставленном пути будет создана идентичная виртуальная среда в соответствии с заданными параметрами.
sv: Flera sökvägar kan anges för ``venv``, i vilket fall en identisk virtuell miljö kommer att skapas, i enlighet med de angivna alternativen, på varje angiven sökväg.

source: How venvs work
ru: Как работают венвсы
sv: Hur venv fungerar

source: When a Python interpreter is running from a virtual environment, :data:`sys.prefix` and :data:`sys.exec_prefix` point to the directories of the virtual environment, whereas :data:`sys.base_prefix` and :data:`sys.base_exec_prefix` point to those of the base Python used to create the environment. It is sufficient to check ``sys.prefix != sys.base_prefix`` to determine if the current interpreter is running from a virtual environment.
ru: Когда интерпретатор Python запускается из виртуальной среды, :data:`sys.prefix` и :data:`sys.exec_prefix` указывают на каталоги виртуальной среды, тогда как :data:`sys.base_prefix` и :data: `sys.base_exec_prefix` указывает на базовый Python, используемый для создания среды. Достаточно проверить ``sys.prefix != sys.base_prefix``, чтобы определить, запущен ли текущий интерпретатор из виртуальной среды.
sv: När en Python-tolk körs från en virtuell miljö pekar :data:`sys.prefix` och :data:`sys.exec_prefix` på katalogerna i den virtuella miljön, medan :data:`sys.base_prefix` och :data:`sys.base_exec_prefix` pekar på katalogerna i den bas-Python som användes för att skapa miljön. Det räcker att kontrollera ``sys.prefix != sys.base_prefix`` för att avgöra om den aktuella tolken körs från en virtuell miljö.

source: A virtual environment may be "activated" using a script in its binary directory (``bin`` on POSIX; ``Scripts`` on Windows). This will prepend that directory to your :envvar:`PATH`, so that running :program:`python` will invoke the environment's Python interpreter and you can run installed scripts without having to use their full path. The invocation of the activation script is platform-specific (:samp:`{<venv>}` must be replaced by the path to the directory containing the virtual environment):
ru: Виртуальную среду можно «активировать» с помощью сценария в ее двоичном каталоге («bin» в POSIX; «Scripts» в Windows). Это добавит этот каталог к ​​вашему :envvar:`PATH`, так что запуск :program:`python` вызовет интерпретатор Python среды, и вы сможете запускать установленные сценарии без необходимости использовать их полный путь. Вызов сценария активации зависит от платформы (:samp:`{<venv>}` необходимо заменить путем к каталогу, содержащему виртуальную среду):
sv: En virtuell miljö kan "aktiveras" med hjälp av ett skript i dess binärkatalog (``bin`` på POSIX; ``Scripts`` på Windows). Då läggs katalogen till i :envvar:`PATH`, så att om du kör :program:`python` kommer miljöns Python-tolk att anropas och du kan köra installerade skript utan att behöva använda hela sökvägen. Aktiveringsskriptets anrop är plattformsspecifikt (:samp:`{<venv>}` måste ersättas med sökvägen till den katalog som innehåller den virtuella miljön):

source: Platform
ru: Платформа
sv: Plattform

source: Shell
ru: Командная оболочка
sv: Skal

source: Command to activate virtual environment
ru: Команда активации виртуальной среды
sv: Kommando för att aktivera virtuell miljö

source: fish
ru: рыба
sv: fisk

source: :program:`fish` and :program:`csh` activation scripts.
ru: Скрипты активации :program:`fish` и :program:`csh`.
sv: :program:`fish` och :program:`csh` aktiveringsskript.

source: PowerShell activation scripts installed under POSIX for PowerShell Core support.
ru: Сценарии активации PowerShell, установленные в соответствии с POSIX, для поддержки PowerShell Core.
sv: PowerShell-aktiveringsskript installerade under POSIX för PowerShell Core-stöd.

source: You don't specifically *need* to activate a virtual environment, as you can just specify the full path to that environment's Python interpreter when invoking Python. Furthermore, all scripts installed in the environment should be runnable without activating it.
ru: Вам не *нужно* специально активировать виртуальную среду, поскольку вы можете просто указать полный путь к интерпретатору Python этой среды при вызове Python. Более того, все скрипты, установленные в среде, должны запускаться без ее активации.
sv: Du behöver inte specifikt *aktivera* en virtuell miljö, eftersom du bara kan ange den fullständiga sökvägen till den miljöns Python-tolk när du anropar Python. Dessutom bör alla skript som är installerade i miljön kunna köras utan att den aktiveras.

source: In order to achieve this, scripts installed into virtual environments have a "shebang" line which points to the environment's Python interpreter, :samp:`#!/{<path-to-venv>}/bin/python`. This means that the script will run with that interpreter regardless of the value of :envvar:`PATH`. On Windows, "shebang" line processing is supported if you have the :ref:`launcher` installed. Thus, double-clicking an installed script in a Windows Explorer window should run it with the correct interpreter without the environment needing to be activated or on the :envvar:`PATH`.
ru: Для этого в сценариях, установленных в виртуальных средах, есть строка «шебанг», указывающая на интерпретатор Python среды: :samp:`#!/{<path-to-venv>}/bin/python`. Это означает, что сценарий будет работать с этим интерпретатором независимо от значения :envvar:`PATH`. В Windows обработка строк «shebang» поддерживается, если у вас установлен :ref:`launcher`. Таким образом, двойной щелчок установленного сценария в окне проводника Windows должен запустить его с правильным интерпретатором без необходимости активации среды или по :envvar:`PATH`.

source: When a virtual environment has been activated, the :envvar:`!VIRTUAL_ENV` environment variable is set to the path of the environment. Since explicitly activating a virtual environment is not required to use it, :envvar:`!VIRTUAL_ENV` cannot be relied upon to determine whether a virtual environment is being used.
ru: Когда виртуальная среда активирована, переменной среды :envvar:`!VIRTUAL_ENV` присваивается путь к среде. Поскольку для ее использования не требуется явная активация виртуальной среды, на :envvar:`!VIRTUAL_ENV` нельзя полагаться при определении того, используется ли виртуальная среда.
sv: När en virtuell miljö har aktiverats sätts miljövariabeln :envvar:`!VIRTUAL_ENV` till sökvägen för miljön. Eftersom det inte krävs någon explicit aktivering av en virtuell miljö för att använda den, kan man inte förlita sig på :envvar:`!VIRTUAL_ENV` för att avgöra om en virtuell miljö används.

source: Because scripts installed in environments should not expect the environment to be activated, their shebang lines contain the absolute paths to their environment's interpreters. Because of this, environments are inherently non-portable, in the general case. You should always have a simple means of recreating an environment (for example, if you have a requirements file ``requirements.txt``, you can invoke ``pip install -r requirements.txt`` using the environment's ``pip`` to install all of the packages needed by the environment). If for any reason you need to move the environment to a new location, you should recreate it at the desired location and delete the one at the old location. If you move an environment because you moved a parent directory of it, you should recreate the environment in its new location. Otherwise, software installed into the environment may not work as expected.
ru: Поскольку сценарии, установленные в средах, не должны ожидать активации среды, их строки shebang содержат абсолютные пути к интерпретаторам их среды. Из-за этого среды в общем случае по своей сути непереносимы. У вас всегда должны быть простые средства воссоздания среды (например, если у вас есть файл требований ``requirements.txt``, вы можете вызвать ``pip install -r require.txt``, используя ``pip` среды. `чтобы установить все пакеты, необходимые для среды). Если по какой-либо причине вам необходимо переместить среду в новое место, вам следует воссоздать ее в нужном месте и удалить среду в старом месте. Если вы перемещаете среду из-за перемещения ее родительского каталога, вам следует воссоздать среду в новом месте. В противном случае программное обеспечение, установленное в среде, может работать не так, как ожидалось.
sv: Eftersom skript som installeras i miljöer inte bör förvänta sig att miljön ska aktiveras innehåller deras shebang-rader de absoluta sökvägarna till miljöns tolkar. På grund av detta är miljöer i sig inte portabla, i det allmänna fallet. Du bör alltid ha ett enkelt sätt att återskapa en miljö (om du till exempel har en kravfil ``requirements.txt`` kan du anropa ``pip install -r requirements.txt`` med hjälp av miljöns ``pip`` för att installera alla paket som behövs i miljön). Om du av någon anledning behöver flytta miljön till en ny plats, bör du återskapa den på den önskade platsen och ta bort den på den gamla platsen. Om du flyttar en miljö för att du har flyttat en överordnad katalog till den, bör du återskapa miljön på dess nya plats. Annars kan det hända att programvara som installerats i miljön inte fungerar som förväntat.

source: You can deactivate a virtual environment by typing ``deactivate`` in your shell. The exact mechanism is platform-specific and is an internal implementation detail (typically, a script or shell function will be used).
ru: Вы можете деактивировать виртуальную среду, набрав в своей оболочке ``deactivate``. Точный механизм зависит от платформы и является деталью внутренней реализации (обычно используется сценарий или функция оболочки).
sv: Du kan inaktivera en virtuell miljö genom att skriva ``deactivate`` i ditt skal. Den exakta mekanismen är plattformsspecifik och är en intern implementeringsdetalj (vanligtvis används ett skript eller en skalfunktion).

source: The high-level method described above makes use of a simple API which provides mechanisms for third-party virtual environment creators to customize environment creation according to their needs, the :class:`EnvBuilder` class.
ru: Описанный выше высокоуровневый метод использует простой API, который предоставляет сторонним создателям виртуальной среды механизмы для настройки создания среды в соответствии со своими потребностями, класс :class:`EnvBuilder`.
sv: Den högnivåmetod som beskrivs ovan använder sig av ett enkelt API som tillhandahåller mekanismer för tredjepartsskapare av virtuella miljöer för att anpassa skapandet av miljöer efter deras behov, :class:`EnvBuilder`\-klassen.

source: The :class:`EnvBuilder` class accepts the following keyword arguments on instantiation:
ru: Класс :class:`EnvBuilder` принимает следующие ключевые слова при создании экземпляра:
sv: Klassen :class:`EnvBuilder` accepterar följande nyckelordsargument vid instansiering:

source: *system_site_packages* -- a boolean value indicating that the system Python site-packages should be available to the environment (defaults to ``False``).
ru: *system_site_packages* — логическое значение, указывающее, что системные пакеты сайта Python должны быть доступны для среды (по умолчанию — «False»).

source: *clear* -- a boolean value which, if true, will delete the contents of any existing target directory, before creating the environment.
ru: *clear* — логическое значение, которое, если оно истинно, удалит содержимое любого существующего целевого каталога перед созданием среды.

source: *symlinks* -- a boolean value indicating whether to attempt to symlink the Python binary rather than copying.
ru: *symlinks* — логическое значение, указывающее, следует ли пытаться создать символическую ссылку на двоичный файл Python вместо копирования.

source: *upgrade* -- a boolean value which, if true, will upgrade an existing environment with the running Python - for use when that Python has been upgraded in-place (defaults to ``False``).
ru: *upgrade* — логическое значение, которое, если оно истинно, обновит существующую среду с работающим Python — для использования, когда этот Python был обновлен на месте (по умолчанию — «False»).

source: *with_pip* -- a boolean value which, if true, ensures pip is installed in the virtual environment. This uses :mod:`ensurepip` with the ``--default-pip`` option.
ru: *with_pip* — логическое значение, которое, если оно истинно, гарантирует, что pip установлен в виртуальной среде. При этом используется :mod:`ensurepip` с опцией ``--default-pip``.
