Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/wave.po
Languages: ru

source: :mod:`!wave` --- Read and write WAV files
ru: :mod:`!wave` --- Чтение и запись WAV-файлов.

source: **Source code:** :source:`Lib/wave.py`
ru: **Исходный код:** :source:`Lib/wave.py`

source: The :mod:`wave` module provides a convenient interface to the Waveform Audio "WAVE" (or "WAV") file format. Only uncompressed PCM encoded wave files are supported.
ru: Модуль :mod:`wave` обеспечивает удобный интерфейс для файлов формата Waveform Audio «WAVE» (или «WAV»). Поддерживаются только несжатые волновые файлы в формате PCM.

source: Support for ``WAVE_FORMAT_EXTENSIBLE`` headers was added, provided that the extended format is ``KSDATAFORMAT_SUBTYPE_PCM``.
ru: Добавлена ​​поддержка заголовков WAVE_FORMAT_EXTENSIBLE при условии, что расширенный формат — KSDATAFORMAT_SUBTYPE_PCM.

source: The :mod:`wave` module defines the following function and exception:
ru: Модуль :mod:`wave` определяет следующую функцию и исключение:

source: If *file* is a string, open the file by that name, otherwise treat it as a file-like object. *mode* can be:
ru: Если *file* — это строка, откройте файл с этим именем, в противном случае рассматривайте его как файлоподобный объект. *режим* может быть:

source: Read only mode.
ru: Режим "только для чтения".

source: Write only mode.
ru: Режим "только запись".

source: Note that it does not allow read/write WAV files.
ru: Обратите внимание, что он не позволяет читать/записывать файлы WAV.

source: A *mode* of ``'rb'`` returns a :class:`Wave_read` object, while a *mode* of ``'wb'`` returns a :class:`Wave_write` object. If *mode* is omitted and a file-like object is passed as *file*, ``file.mode`` is used as the default value for *mode*.
ru: *mode* ``'rb'`` возвращает объект :class:`Wave_read`, а *mode* ``'wb'`` возвращает объект :class:`Wave_write`. Если *mode* опущен и файлоподобный объект передается как *file*, ``file.mode`` используется как значение по умолчанию для *mode*.

source: If you pass in a file-like object, the wave object will not close it when its ``close()`` method is called; it is the caller's responsibility to close the file object.
ru: Если вы передадите файлоподобный объект, волновой объект не закроет его при вызове метода close(); ответственность за закрытие файлового объекта лежит на вызывающей стороне.

source: The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`Wave_read.close` or :meth:`Wave_write.close` method is called.
ru: Функцию :func:`.open` можно использовать в операторе :keyword:`with`. Когда блок :keyword:`!with` завершается, вызывается метод :meth:`Wave_read.close` или :meth:`Wave_write.close`.

source: Added support for unseekable files.
ru: Добавлена ​​поддержка недоступных для поиска файлов.

source: An error raised when something is impossible because it violates the WAV specification or hits an implementation deficiency.
ru: Ошибка, возникающая, когда что-то невозможно из-за нарушения спецификации WAV или недостатка реализации.

source: Wave_read Objects
ru: Объекты Wave_read

source: Read a WAV file.
ru: Чтение WAV-файла.

source: Wave_read objects, as returned by :func:`.open`, have the following methods:
ru: Объекты Wave_read, возвращаемые :func:`.open`, имеют следующие методы:

source: Close the stream if it was opened by :mod:`wave`, and make the instance unusable. This is called automatically on object collection.
ru: Закройте поток, если он был открыт :mod:`wave`, и сделайте экземпляр непригодным для использования. Это вызывается автоматически при сборе объектов.

source: Returns number of audio channels (``1`` for mono, ``2`` for stereo).
ru: Возвращает количество аудиоканалов («1» для моно, «2» для стерео).

source: Returns sample width in bytes.
ru: Возвращает ширину выборки в байтах.

source: Returns sampling frequency.
ru: Возвращает частоту дискретизации.

source: Returns number of audio frames.
ru: Возвращает количество аудиокадров.

source: Returns compression type (``'NONE'`` is the only supported type).
ru: Возвращает тип сжатия (NONE — единственный поддерживаемый тип).

source: Human-readable version of :meth:`getcomptype`. Usually ``'not compressed'`` parallels ``'NONE'``.
ru: Удобочитаемая версия :meth:`getcomptype`. Обычно ``'не сжато'`` соответствует ``'NONE'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the ``get*()`` methods.
ru: Возвращает :func:`~collections.namedtuple``(nchannels, sampwidth,framerate, nframes,comptype,compname)``, что эквивалентно выводу методов ``get*()``.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object.
ru: Считывает и возвращает не более *n* кадров аудио в виде объекта :class:`bytes`.

source: Rewind the file pointer to the beginning of the audio stream.
ru: Перемотайте указатель файла назад к началу аудиопотока.

source: The following two methods are defined for compatibility with the :mod:`aifc` module, and don't do anything interesting.
ru: Следующие два метода определены для совместимости с модулем :mod:`aifc` и не делают ничего интересного.

source: Returns ``None``.
ru: Возвращает ``Нет``.

source: Raise an error.
ru: Выдать ошибку.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
ru: Следующие два метода определяют термин «позиция», который совместим между ними и в остальном зависит от реализации.

source: Set the file pointer to the specified position.
ru: Установите указатель файла в указанную позицию.

source: Return current file pointer position.
ru: Возвращает текущую позицию указателя файла.

source: Wave_write Objects
ru: Объекты Wave_write

source: Write a WAV file.
ru: Напишите WAV-файл.

source: Wave_write objects, as returned by :func:`.open`.
ru: Объекты Wave_write, возвращаемые :func:`.open`.

source: For seekable output streams, the ``wave`` header will automatically be updated to reflect the number of frames actually written. For unseekable streams, the *nframes* value must be accurate when the first frame data is written. An accurate *nframes* value can be achieved either by calling :meth:`setnframes` or :meth:`setparams` with the number of frames that will be written before :meth:`close` is called and then using :meth:`writeframesraw` to write the frame data, or by calling :meth:`writeframes` with all of the frame data to be written. In the latter case :meth:`writeframes` will calculate the number of frames in the data and set *nframes* accordingly before writing the frame data.
ru: Для доступных для поиска выходных потоков заголовок wave будет автоматически обновляться, чтобы отразить количество фактически записанных кадров. Для потоков, недоступных для поиска, значение *nframes* должно быть точным при записи данных первого кадра. Точное значение *nframes* можно получить, вызвав :meth:`setnframes` или :meth:`setparams` с количеством кадров, которые будут записаны до вызова :meth:`close`, а затем используя :meth:` writeframesraw` для записи данных кадра или вызовом :meth:`writeframes` со всеми данными кадра, которые необходимо записать. В последнем случае :meth:`writeframes` рассчитает количество кадров в данных и соответственно установит *nframes* перед записью данных кадра.

source: Wave_write objects have the following methods:
ru: Объекты Wave_write имеют следующие методы:

source: Make sure *nframes* is correct, and close the file if it was opened by :mod:`wave`. This method is called upon object collection. It will raise an exception if the output stream is not seekable and *nframes* does not match the number of frames actually written.
ru: Убедитесь, что *nframes* указан правильно, и закройте файл, если он был открыт :mod:`wave`. Этот метод вызывается при сборе объектов. Это вызовет исключение, если выходной поток не доступен для поиска и *nframes* не соответствует количеству фактически записанных кадров.

source: Set the number of channels.
ru: Установите количество каналов.

source: Set the sample width to *n* bytes.
ru: Установите ширину выборки в *n* байт.

source: Set the frame rate to *n*.
ru: Установите частоту кадров *n*.

source: A non-integral input to this method is rounded to the nearest integer.
ru: Нецелые входные данные этого метода округляются до ближайшего целого числа.

source: Set the number of frames to *n*. This will be changed later if the number of frames actually written is different (this update attempt will raise an error if the output stream is not seekable).
ru: Установите количество кадров *n*. Это будет изменено позже, если количество фактически записанных кадров будет другим (эта попытка обновления вызовет ошибку, если выходной поток не доступен для поиска).

source: Set the compression type and description. At the moment, only compression type ``NONE`` is supported, meaning no compression.
ru: Установите тип сжатия и описание. На данный момент поддерживается только тип сжатия NONE, что означает отсутствие сжатия.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the ``set*()`` methods. Sets all parameters.
ru: *Кортеж* должен быть ``(nchannels, sampwidth, Framerate, nframes, comptype, compname)`` со значениями, допустимыми для методов ``set*()``. Устанавливает все параметры.

source: Return current position in the file, with the same disclaimer for the :meth:`Wave_read.tell` and :meth:`Wave_read.setpos` methods.
ru: Возвращает текущую позицию в файле с тем же отказом от ответственности для методов :meth:`Wave_read.tell` и :meth:`Wave_read.setpos`.

source: Write audio frames, without correcting *nframes*.
ru: Записывайте аудиокадры, не исправляя *nframes*.

source: Any :term:`bytes-like object` is now accepted.
ru: Теперь принимается любой :term:`байтовый объект`.

source: Write audio frames and make sure *nframes* is correct. It will raise an error if the output stream is not seekable and the total number of frames that have been written after *data* has been written does not match the previously set value for *nframes*.
ru: Запишите аудиокадры и убедитесь, что *nframes* верен. Это вызовет ошибку, если выходной поток не доступен для поиска и общее количество кадров, записанных после записи *данных*, не соответствует ранее установленному значению для *nframes*.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`, and any attempt to do so will raise :exc:`wave.Error`.
ru: Обратите внимание, что недопустимо устанавливать какие-либо параметры после вызова :meth:`writeframes` или :meth:`writeframesraw`, и любая попытка сделать это вызовет :exc:`wave.Error`.
