Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/wsgiref.po
Languages: pt_pt, ru

source: :class:`Headers` objects also support :meth:`keys`, :meth:`values`, and :meth:`items` methods. The lists returned by :meth:`keys` and :meth:`items` can include the same key more than once if there is a multi-valued header. The ``len()`` of a :class:`Headers` object is the same as the length of its :meth:`items`, which is the same as the length of the wrapped header list. In fact, the :meth:`items` method just returns a copy of the wrapped header list.
pt_pt: Os objetos :class:`Headers` também suportam os métodos :meth:`keys`, :meth:`values` e :meth:`items`. As listas devolvidas por :meth:`keys` e :meth:`items` podem incluir a mesma chave mais do que uma vez se existir um cabeçalho com vários valores. O ``len()`` de um objeto :class:`Headers` é o mesmo que o comprimento do seu :meth:`items`, que é o mesmo que o comprimento da lista de cabeçalhos wrapped. De facto, o método :meth:`items` devolve simplesmente uma cópia da lista de cabeçalhos wrapped.
ru: Объекты :class:`Headers` также поддерживают методы :meth:`keys`, :meth:`values` и :meth:`items`. Списки, возвращаемые :meth:`keys` и :meth:`items`, могут включать один и тот же ключ более одного раза, если имеется многозначный заголовок. ``len()`` объекта :class:`Headers` совпадает с длиной его :meth:`items`, которая равна длине обернутого списка заголовков. Фактически, метод :meth:`items` просто возвращает копию завернутого списка заголовков.

source: Calling ``bytes()`` on a :class:`Headers` object returns a formatted bytestring suitable for transmission as HTTP response headers. Each header is placed on a line with its value, separated by a colon and a space. Each line is terminated by a carriage return and line feed, and the bytestring is terminated with a blank line.
pt_pt: Chamar ``bytes()`` num objeto :class:`Headers` devolve uma *bytestring* formatada adequada para transmissão como cabeçalhos de resposta HTTP. Cada cabeçalho é colocado numa linha com o seu valor, separado por dois pontos e um espaço. Cada linha termina com um retorno de carro e uma mudança de linha, e a *bytestring* termina com uma linha em branco.
ru: Вызов ``bytes()`` для объекта :class:`Headers` возвращает отформатированную байтовую строку, подходящую для передачи в виде заголовков ответа HTTP. Каждый заголовок помещается в строку со своим значением, разделенным двоеточием и пробелом. Каждая строка завершается возвратом каретки и переводом строки, а строка байтов завершается пустой строкой.

source: In addition to their mapping interface and formatting features, :class:`Headers` objects also have the following methods for querying and adding multi-valued headers, and for adding headers with MIME parameters:
pt_pt: Para além da interface de mapeamento e das funcionalidades de formatação, os objetos :class:`Headers` também possuem os seguintes métodos para consultar e adicionar cabeçalhos com vários valores e para adicionar cabeçalhos com parâmetros MIME:
ru: В дополнение к интерфейсу отображения и функциям форматирования, объекты :class:`Headers` также имеют следующие методы для запроса и добавления многозначных заголовков, а также для добавления заголовков с параметрами MIME:

source: Return a list of all the values for the named header.
pt_pt: Devolve uma lista de todos os valores para o cabeçalho nomeado.
ru: Возвращает список всех значений именованного заголовка.

source: The returned list will be sorted in the order they appeared in the original header list or were added to this instance, and may contain duplicates. Any fields deleted and re-inserted are always appended to the header list. If no fields exist with the given name, returns an empty list.
pt_pt: A lista devolvida será ordenada pela ordem em que apareceram na lista de cabeçalhos original ou foram adicionados a esta instância, e pode conter duplicados. Quaisquer campos apagados e reinseridos são sempre adicionados ao final da lista de cabeçalhos. Se não existirem campos com o nome dado, devolve uma lista vazia.
ru: Возвращенный список будет отсортирован в том порядке, в котором они появились в исходном списке заголовков или были добавлены в этот экземпляр, и могут содержать дубликаты. Любые удаленные и повторно вставленные поля всегда добавляются в список заголовков. Если полей с данным именем не существует, возвращается пустой список.

source: Add a (possibly multi-valued) header, with optional MIME parameters specified via keyword arguments.
pt_pt: Adiciona um cabeçalho (possivelmente com vários valores), com parâmetros MIME opcionais especificados através de argumentos nomeados.
ru: Добавьте заголовок (возможно, многозначный) с дополнительными параметрами MIME, указанными через аргументы ключевого слова.

source: *name* is the header field to add. Keyword arguments can be used to set MIME parameters for the header field. Each parameter must be a string or ``None``. Underscores in parameter names are converted to dashes, since dashes are illegal in Python identifiers, but many MIME parameter names include dashes. If the parameter value is a string, it is added to the header value parameters in the form ``name="value"``. If it is ``None``, only the parameter name is added. (This is used for MIME parameters without a value.) Example usage::
pt_pt: *name* é o campo de cabeçalho a adicionar. Os argumentos nomeados podem ser utilizados para definir parâmetros MIME para o campo de cabeçalho. Cada parâmetro deve ser uma string ou ``None``. Os sublinhados nos nomes dos parâmetros são convertidos em traços, uma vez que os traços são ilegais em identificadores Python, mas muitos nomes de parâmetros MIME incluem traços. Se o valor do parâmetro for uma string, é adicionado aos parâmetros do valor do cabeçalho na forma ``name="value"``. Se for ``None``, apenas o nome do parâmetro é adicionado. (Isto é utilizado para parâmetros MIME sem valor.) Exemplo de utilização::
ru: *имя* — это добавляемое поле заголовка. Аргументы ключевого слова можно использовать для установки параметров MIME для поля заголовка. Каждый параметр должен быть строкой или «Нет». Подчеркивания в именах параметров преобразуются в тире, поскольку тире недопустимы в идентификаторах Python, но многие имена параметров MIME включают тире. Если значение параметра является строкой, оно добавляется к параметрам значения заголовка в форме ``name="value"``. Если указано значение «Нет», добавляется только имя параметра. (Это используется для параметров MIME без значения.) Пример использования::

source: The above will add a header that looks like this::
pt_pt: O código acima adicionará um cabeçalho que ficará assim::
ru: Вышеупомянутое добавит заголовок, который выглядит следующим образом:

source: *headers* parameter is optional.
pt_pt: O parâmetro *headers* é opcional.
ru: Параметр *headers* является необязательным.

source: :mod:`wsgiref.simple_server` -- a simple WSGI HTTP server
pt_pt: :mod:`wsgiref.simple_server` -- um servidor HTTP WSGI simples
ru: :mod:`wsgiref.simple_server` — простой HTTP-сервер WSGI.

source: This module implements a simple HTTP server (based on :mod:`http.server`) that serves WSGI applications. Each server instance serves a single WSGI application on a given host and port. If you want to serve multiple applications on a single host and port, you should create a WSGI application that parses ``PATH_INFO`` to select which application to invoke for each request. (E.g., using the :func:`shift_path_info` function from :mod:`wsgiref.util`.)
pt_pt: Este módulo implementa um servidor HTTP simples (baseado em :mod:`http.server`) que serve aplicações WSGI. Cada instância do servidor serve uma única aplicação WSGI num determinado *host* e porta. Se pretender servir várias aplicações num único *host* e porta, deve criar uma aplicação WSGI que analise ``PATH_INFO`` para selecionar qual a aplicação a invocar para cada pedido. (Por exemplo, utilizando a função :func:`shift_path_info` do módulo :mod:`wsgiref.util`.)
ru: Этот модуль реализует простой HTTP-сервер (на основе :mod:`http.server`), который обслуживает приложения WSGI. Каждый экземпляр сервера обслуживает одно приложение WSGI на определенном хосте и порту. Если вы хотите обслуживать несколько приложений на одном хосте и порту, вам следует создать приложение WSGI, которое анализирует PATH_INFO, чтобы выбрать, какое приложение вызывать для каждого запроса. (Например, используя функцию :func:`shift_path_info` из :mod:`wsgiref.util`.)

source: Create a new WSGI server listening on *host* and *port*, accepting connections for *app*. The return value is an instance of the supplied *server_class*, and will process requests using the specified *handler_class*. *app* must be a WSGI application object, as defined by :pep:`3333`.
pt_pt: Cria um novo servidor WSGI à escuta em *host* e *port*, aceitando ligações para *app*. O valor devolvido é uma instância da *server_class* fornecida e processará pedidos utilizando a *handler_class* especificada. *app* deve ser um objeto de aplicação WSGI, tal como definido em :pep:`3333`.
ru: Создайте новый сервер WSGI, прослушивающий *хост* и *порт* и принимающий соединения для *приложения*. Возвращаемое значение является экземпляром предоставленного *server_class* и будет обрабатывать запросы с использованием указанного *handler_class*. *app* должно быть объектом приложения WSGI, как определено в :pep:`3333`.

source: from wsgiref.simple_server import make_server, demo_app with make_server('', 8000, demo_app) as httpd: print("Serving HTTP on port 8000...") # Respond to requests until process is killed httpd.serve_forever() # Alternative: serve one request, then exit httpd.handle_request()
pt_pt: from wsgiref.simple_server import make_server, demo_app with make_server('', 8000, demo_app) as httpd: print("A servir HTTP na porta 8000...") # Responde a pedidos até o processo ser terminado httpd.serve_forever() # Alternativa: serve um pedido e depois termina httpd.handle_request()

source: This function is a small but complete WSGI application that returns a text page containing the message "Hello world!" and a list of the key/value pairs provided in the *environ* parameter. It's useful for verifying that a WSGI server (such as :mod:`wsgiref.simple_server`) is able to run a simple WSGI application correctly.
pt_pt: Esta função é uma aplicação WSGI pequena, mas completa, que devolve uma página de texto contendo a mensagem "Hello world!" e uma lista dos pares chave/valor fornecidos no parâmetro *environ*. É útil para verificar se um servidor WSGI (como :mod:`wsgiref.simple_server`) é capaz de executar uma aplicação WSGI simples corretamente.
ru: Эта функция представляет собой небольшое, но полноценное WSGI-приложение, которое возвращает текстовую страницу, содержащую сообщение «Hello world!» и список пар ключ/значение, указанный в параметре *environ*. Это полезно для проверки того, что сервер WSGI (например, :mod:`wsgiref.simple_server`) может правильно запускать простое приложение WSGI.

source: The *start_response* callable should follow the :class:`.StartResponse` protocol.
pt_pt: O objeto chamável *start_response* deve seguir o protocolo :class:`.StartResponse`.

source: Create a :class:`WSGIServer` instance. *server_address* should be a ``(host,port)`` tuple, and *RequestHandlerClass* should be the subclass of :class:`http.server.BaseHTTPRequestHandler` that will be used to process requests.
pt_pt: Cria uma instância de :class:`WSGIServer`. *server_address* deve ser um tuplo ``(host,port)``, e *RequestHandlerClass* deve ser a subclasse de :class:`http.server.BaseHTTPRequestHandler` que será utilizada para processar pedidos.
ru: Создайте экземпляр :class:`WSGIServer`. *server_address* должен быть кортежем ``(host,port)``, а *RequestHandlerClass* должен быть подклассом :class:`http.server.BaseHTTPRequestHandler`, который будет использоваться для обработки запросов.

source: You do not normally need to call this constructor, as the :func:`make_server` function can handle all the details for you.
pt_pt: Normalmente, não precisa de chamar este construtor, uma vez que a função :func:`make_server` pode tratar de todos os detalhes por si.
ru: Обычно вам не нужно вызывать этот конструктор, поскольку функция :func:`make_server` может обработать всю информацию за вас.

source: :class:`WSGIServer` is a subclass of :class:`http.server.HTTPServer`, so all of its methods (such as :meth:`serve_forever` and :meth:`handle_request`) are available. :class:`WSGIServer` also provides these WSGI-specific methods:
pt_pt: :class:`WSGIServer` é uma subclasse de :class:`http.server.HTTPServer`, pelo que todos os seus métodos (como :meth:`serve_forever` e :meth:`handle_request`) estão disponíveis. :class:`WSGIServer` também fornece os seguintes métodos específicos de WSGI:
ru: :class:`WSGIServer` является подклассом :class:`http.server.HTTPServer`, поэтому доступны все его методы (такие как :meth:`serve_forever` и :meth:`handle_request`). :class:`WSGIServer` также предоставляет следующие WSGI-методы:

source: Sets the callable *application* as the WSGI application that will receive requests.
pt_pt: Define a aplicação chamável *application* como a aplicação WSGI que receberá os pedidos.
ru: Устанавливает вызываемое *приложение* в качестве приложения WSGI, которое будет получать запросы.

source: Returns the currently set application callable.
pt_pt: Devolve a aplicação chamável atualmente definida.
ru: Возвращает текущее установленное вызываемое приложение.

source: Normally, however, you do not need to use these additional methods, as :meth:`set_app` is normally called by :func:`make_server`, and the :meth:`get_app` exists mainly for the benefit of request handler instances.
pt_pt: No entanto, normalmente não precisa de utilizar estes métodos adicionais, uma vez que :meth:`set_app` é normalmente chamado por :func:`make_server`, e o :meth:`get_app` existe principalmente para benefício das instâncias de manipuladores de pedidos.
ru: Однако обычно вам не нужно использовать эти дополнительные методы, поскольку :meth:`set_app` обычно вызывается :func:`make_server`, а :meth:`get_app` существует главным образом для использования экземпляров обработчика запросов.

source: Create an HTTP handler for the given *request* (i.e. a socket), *client_address* (a ``(host,port)`` tuple), and *server* (:class:`WSGIServer` instance).
pt_pt: Cria um manipulador HTTP para o *request* dado (ou seja, um *socket*), *client_address* (um tuplo ``(host,port)``), e *server* (uma instância de :class:`WSGIServer`).
ru: Создайте обработчик HTTP для данного *запроса* (т.е. сокета), *client_address* (кортежа ``(host,port)``) и *server* (экземпляр:class:`WSGIServer`).

source: You do not need to create instances of this class directly; they are automatically created as needed by :class:`WSGIServer` objects. You can, however, subclass this class and supply it as a *handler_class* to the :func:`make_server` function. Some possibly relevant methods for overriding in subclasses:
pt_pt: Não precisa de criar instâncias desta classe diretamente; são criadas automaticamente conforme necessário por objetos :class:`WSGIServer`. Pode, no entanto, criar uma subclasse desta classe e fornecê-la como uma *handler_class* à função :func:`make_server`. Alguns métodos possivelmente relevantes para substituir em subclasses:
ru: Вам не нужно создавать экземпляры этого класса напрямую; они автоматически создаются по мере необходимости объектами :class:`WSGIServer`. Однако вы можете создать подкласс этого класса и передать его как *handler_class* функции :func:`make_server`. Некоторые возможные методы переопределения в подклассах:

source: Return a :data:`~wsgiref.types.WSGIEnvironment` dictionary for a request. The default implementation copies the contents of the :class:`WSGIServer` object's :attr:`base_environ` dictionary attribute and then adds various headers derived from the HTTP request. Each call to this method should return a new dictionary containing all of the relevant CGI environment variables as specified in :pep:`3333`.
pt_pt: Devolve um dicionário :data:`~wsgiref.types.WSGIEnvironment` para um pedido. A implementação predefinida copia o conteúdo do atributo de dicionário :attr:`base_environ` do objeto :class:`WSGIServer` e, em seguida, adiciona vários cabeçalhos derivados do pedido HTTP. Cada chamada a este método deve devolver um novo dicionário contendo todas as variáveis de ambiente CGI relevantes, tal como especificado em :pep:`3333`.
ru: Возвращает словарь :data:`~wsgiref.types.WSGIEnvironment` для запроса. Реализация по умолчанию копирует содержимое атрибута словаря :attr:`base_environ` объекта :class:`WSGIServer`, а затем добавляет различные заголовки, полученные из HTTP-запроса. Каждый вызов этого метода должен возвращать новый словарь, содержащий все соответствующие переменные среды CGI, как указано в :pep:`3333`.

source: Return the object that should be used as the ``wsgi.errors`` stream. The default implementation just returns ``sys.stderr``.
pt_pt: Devolve o objeto que deve ser utilizado como o fluxo ``wsgi.errors``. A implementação predefinida devolve simplesmente ``sys.stderr``.
ru: Верните объект, который следует использовать в качестве потока wsgi.errors. Реализация по умолчанию просто возвращает ``sys.stderr``.

source: Process the HTTP request. The default implementation creates a handler instance using a :mod:`wsgiref.handlers` class to implement the actual WSGI application interface.
pt_pt: Processa o pedido HTTP. A implementação predefinida cria uma instância de manipulador utilizando uma classe :mod:`wsgiref.handlers` para implementar a interface da aplicação WSGI real.
ru: Обработайте HTTP-запрос. Реализация по умолчанию создает экземпляр обработчика с использованием класса :mod:`wsgiref.handlers` для реализации фактического интерфейса приложения WSGI.

source: :mod:`wsgiref.validate` --- WSGI conformance checker
pt_pt: :mod:`wsgiref.validate` --- Verificador de conformidade WSGI
ru: :mod:`wsgiref.validate` --- Проверка соответствия WSGI

source: When creating new WSGI application objects, frameworks, servers, or middleware, it can be useful to validate the new code's conformance using :mod:`wsgiref.validate`. This module provides a function that creates WSGI application objects that validate communications between a WSGI server or gateway and a WSGI application object, to check both sides for protocol conformance.
pt_pt: Ao criar novos objetos de aplicação WSGI, estruturas, servidores ou *middleware*, pode ser útil validar a conformidade do novo código utilizando :mod:`wsgiref.validate`. Este módulo fornece uma função que cria objetos de aplicação WSGI que validam as comunicações entre um servidor ou portal WSGI e um objeto de aplicação WSGI, para verificar a conformidade do protocolo em ambos os lados.
ru: При создании новых объектов приложения WSGI, платформ, серверов или промежуточного программного обеспечения может быть полезно проверить соответствие нового кода с помощью :mod:`wsgiref.validate`. Этот модуль предоставляет функцию, которая создает объекты приложения WSGI, которые проверяют связь между сервером или шлюзом WSGI и объектом приложения WSGI, чтобы проверить обе стороны на соответствие протоколу.

source: Note that this utility does not guarantee complete :pep:`3333` compliance; an absence of errors from this module does not necessarily mean that errors do not exist. However, if this module does produce an error, then it is virtually certain that either the server or application is not 100% compliant.
pt_pt: Note que esta utilidade não garante conformidade total com :pep:`3333`; a ausência de erros deste módulo não significa necessariamente que não existam erros. No entanto, se este módulo produzir um erro, é praticamente certo que ou o servidor ou a aplicação não estão 100% conformes.
ru: Обратите внимание, что эта утилита не гарантирует полного соответствия :pep:`3333`; отсутствие ошибок в этом модуле не обязательно означает, что ошибок не существует. Однако если этот модуль выдает ошибку, то практически наверняка сервер или приложение не соответствуют требованиям на 100%.

source: This module is based on the :mod:`paste.lint` module from Ian Bicking's "Python Paste" library.
pt_pt: Este módulo é baseado no módulo :mod:`paste.lint` da biblioteca "Python Paste" de Ian Bicking.
ru: Этот модуль основан на модуле :mod:`paste.lint` из библиотеки Яна Бикинга «Python Paste».

source: Wrap *application* and return a new WSGI application object. The returned application will forward all requests to the original *application*, and will check that both the *application* and the server invoking it are conforming to the WSGI specification and to :rfc:`2616`.
pt_pt: Encapsula *application* e devolve um novo objeto de aplicação WSGI. A aplicação devolvida reencaminhará todos os pedidos para a *application* original e verificará se tanto a *application* como o servidor que a invoca estão conformes com a especificação WSGI e com :rfc:`2616`.
ru: Оберните *application* и верните новый объект приложения WSGI. Возвращенное приложение перенаправит все запросы исходному *приложению* и проверит, что *приложение* и вызывающий его сервер соответствуют спецификации WSGI и :rfc:`2616`.

source: Any detected nonconformance results in an :exc:`AssertionError` being raised; note, however, that how these errors are handled is server-dependent. For example, :mod:`wsgiref.simple_server` and other servers based on :mod:`wsgiref.handlers` (that don't override the error handling methods to do something else) will simply output a message that an error has occurred, and dump the traceback to ``sys.stderr`` or some other error stream.
pt_pt: Qualquer não conformidade detetada resulta na geração de um :exc:`AssertionError`; no entanto, note que a forma como estes erros são tratados depende do servidor. Por exemplo, :mod:`wsgiref.simple_server` e outros servidores baseados em :mod:`wsgiref.handlers` (que não substituem os métodos de tratamento de erros para fazer outra coisa) simplesmente apresentarão uma mensagem de que ocorreu um erro e descarregarão o *traceback* para ``sys.stderr`` ou outro fluxo de erro.
ru: Любое обнаруженное несоответствие приводит к возникновению ошибки :exc:`AssertionError`; Однако обратите внимание, что способ обработки этих ошибок зависит от сервера. Например, :mod:`wsgiref.simple_server` и другие серверы, основанные на :mod:`wsgiref.handlers` (которые не переопределяют методы обработки ошибок для выполнения чего-то другого), просто выведут сообщение о том, что произошла ошибка, и сбросьте обратную трассировку в ``sys.stderr`` или какой-либо другой поток ошибок.

source: This wrapper may also generate output using the :mod:`warnings` module to indicate behaviors that are questionable but which may not actually be prohibited by :pep:`3333`. Unless they are suppressed using Python command-line options or the :mod:`warnings` API, any such warnings will be written to ``sys.stderr`` (*not* ``wsgi.errors``, unless they happen to be the same object).
pt_pt: Este encapsulador também pode gerar saída utilizando o módulo :mod:`warnings` para indicar comportamentos questionáveis, mas que podem não estar expressamente proibidos por :pep:`3333`. A menos que sejam suprimidos através de opções de linha de comandos do Python ou da API :mod:`warnings`, quaisquer avisos serão escritos para ``sys.stderr`` (*não* para ``wsgi.errors``, a menos que sejam o mesmo objeto).
ru: Эта оболочка также может генерировать выходные данные с использованием модуля :mod:`warnings` для указания сомнительного поведения, которое на самом деле не может быть запрещено :pep:`3333`. Если они не подавлены с помощью параметров командной строки Python или API :mod:`warnings`, любые такие предупреждения будут записаны в ``sys.stderr`` (*не* ``wsgi.errors``, если только они не быть одним и тем же объектом).
