Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/wsgiref.po
Languages: pt_pt, ru

source: Set the :attr:`environ` attribute to a fully populated WSGI environment. The default implementation uses all of the above methods and attributes, plus the :meth:`get_stdin`, :meth:`get_stderr`, and :meth:`add_cgi_vars` methods and the :attr:`wsgi_file_wrapper` attribute. It also inserts a ``SERVER_SOFTWARE`` key if not present, as long as the :attr:`origin_server` attribute is a true value and the :attr:`server_software` attribute is set.
pt_pt: Define o atributo :attr:`environ` para um ambiente WSGI completamente preenchido. A implementação predefinida utiliza todos os métodos e atributos acima, além dos métodos :meth:`get_stdin`, :meth:`get_stderr`, e :meth:`add_cgi_vars` e do atributo :attr:`wsgi_file_wrapper`. Também insere uma chave ``SERVER_SOFTWARE`` se não estiver presente, desde que o atributo :attr:`origin_server` tenha um valor verdadeiro e o atributo :attr:`server_software` esteja definido.
ru: Установите атрибут :attr:`environ` для полностью заполненной среды WSGI. Реализация по умолчанию использует все вышеперечисленные методы и атрибуты, а также методы :meth:`get_stdin`, :meth:`get_stderr` и :meth:`add_cgi_vars` и атрибут :attr:`wsgi_file_wrapper`. Он также вставляет ключ ``SERVER_SOFTWARE``, если он отсутствует, если атрибут :attr:`origin_server` имеет истинное значение и установлен атрибут :attr:`server_software`.

source: Methods and attributes for customizing exception handling:
pt_pt: Métodos e atributos para personalizar o tratamento de exceções:
ru: Методы и атрибуты для настройки обработки исключений:

source: Log the *exc_info* tuple in the server log. *exc_info* is a ``(type, value, traceback)`` tuple. The default implementation simply writes the traceback to the request's ``wsgi.errors`` stream and flushes it. Subclasses can override this method to change the format or retarget the output, mail the traceback to an administrator, or whatever other action may be deemed suitable.
pt_pt: Regista o tuplo *exc_info* no registo do servidor. *exc_info* é um tuplo ``(type, value, traceback)``. A implementação predefinida escreve simplesmente o *traceback* no fluxo ``wsgi.errors`` do pedido e faz a sua descarga. As subclasses podem substituir este método para alterar o formato ou redirecionar a saída, enviar o *traceback* por email a um administrador, ou qualquer outra ação considerada adequada.
ru: Запишите кортеж *exc_info* в журнал сервера. *exc_info* — это кортеж ``(тип, значение, обратная трассировка)``. Реализация по умолчанию просто записывает обратную трассировку в поток запроса wsgi.errors и сбрасывает его. Подклассы могут переопределить этот метод, чтобы изменить формат или перенаправить выходные данные, отправить обратную связь по почте администратору или выполнить любое другое действие, которое может быть сочтено подходящим.

source: The maximum number of frames to include in tracebacks output by the default :meth:`log_exception` method. If ``None``, all frames are included.
pt_pt: O número máximo de *frames* a incluir nos *tracebacks* produzidos pelo método predefinido :meth:`log_exception`. Se for ``None``, todos os *frames* são incluídos.
ru: Максимальное количество кадров, включаемых в выходные данные трассировки методом :meth:`log_Exception` по умолчанию. Если «Нет», включаются все кадры.

source: This method is a WSGI application to generate an error page for the user. It is only invoked if an error occurs before headers are sent to the client.
pt_pt: Este método é uma aplicação WSGI para gerar uma página de erro para o utilizador. É invocado apenas se ocorrer um erro antes de os cabeçalhos serem enviados para o cliente.
ru: Этот метод представляет собой приложение WSGI, создающее для пользователя страницу ошибки. Он вызывается только в том случае, если возникает ошибка до отправки заголовков клиенту.

source: This method can access the current error using ``sys.exception()``, and should pass that information to *start_response* when calling it (as described in the "Error Handling" section of :pep:`3333`). In particular, the *start_response* callable should follow the :class:`.StartResponse` protocol.
pt_pt: Este método pode aceder ao erro atual utilizando ``sys.exception()`` e deve passar essa informação para *start_response* ao chamá-lo (tal como descrito na secção "Tratamento de Erros" do :pep:`3333`). Em particular, o objeto chamável *start_response* deve seguir o protocolo :class:`.StartResponse`.

source: The default implementation just uses the :attr:`error_status`, :attr:`error_headers`, and :attr:`error_body` attributes to generate an output page. Subclasses can override this to produce more dynamic error output.
pt_pt: A implementação predefinida utiliza simplesmente os atributos :attr:`error_status`, :attr:`error_headers` e :attr:`error_body` para gerar uma página de saída. As subclasses podem substituir isto para produzir uma saída de erro mais dinâmica.
ru: Реализация по умолчанию просто использует атрибуты :attr:`error_status`, :attr:`error_headers` и :attr:`error_body` для создания выходной страницы. Подклассы могут переопределить это, чтобы обеспечить более динамичный вывод ошибок.

source: Note, however, that it's not recommended from a security perspective to spit out diagnostics to any old user; ideally, you should have to do something special to enable diagnostic output, which is why the default implementation doesn't include any.
pt_pt: Note, no entanto, que não é recomendado, do ponto de vista de segurança, apresentar diagnósticos a qualquer utilizador; idealmente, deve ser necessário fazer algo de especial para ativar a saída de diagnóstico, razão pela qual a implementação predefinida não inclui nenhuma.
ru: Однако обратите внимание, что с точки зрения безопасности не рекомендуется выдавать диагностику любому старому пользователю; в идеале вам придется сделать что-то особенное, чтобы включить диагностический вывод, поэтому реализация по умолчанию его не включает.

source: The HTTP status used for error responses. This should be a status string as defined in :pep:`3333`; it defaults to a 500 code and message.
pt_pt: O estado HTTP utilizado para respostas de erro. Deve ser uma string de estado tal como definida em :pep:`3333`; por predefinição, é um código e mensagem 500.
ru: Статус HTTP, используемый для ответов об ошибках. Это должна быть строка состояния, как определено в :pep:`3333`; по умолчанию это код 500 и сообщение.

source: The HTTP headers used for error responses. This should be a list of WSGI response headers (``(name, value)`` tuples), as described in :pep:`3333`. The default list just sets the content type to ``text/plain``.
pt_pt: Os cabeçalhos HTTP utilizados para respostas de erro. Deve ser uma lista de cabeçalhos de resposta WSGI (tuplos ``(name, value)``), tal como descrito em :pep:`3333`. A lista predefinida define simplesmente o tipo de conteúdo para ``text/plain``.
ru: Заголовки HTTP, используемые для ответов об ошибках. Это должен быть список заголовков ответов WSGI (кортежи ``(name, value)``), как описано в :pep:`3333`. Список по умолчанию просто устанавливает тип контента «text/plain».

source: The error response body. This should be an HTTP response body bytestring. It defaults to the plain text, "A server error occurred. Please contact the administrator."
pt_pt: O corpo da resposta de erro. Deve ser uma *bytestring* de corpo de resposta HTTP. Por predefinição, é o texto simples "Ocorreu um erro no servidor. Contacte o administrador."
ru: Тело ответа об ошибке. Это должна быть байтовая строка тела ответа HTTP. По умолчанию отображается обычный текст: «Произошла ошибка сервера. Обратитесь к администратору».

source: Methods and attributes for :pep:`3333`'s "Optional Platform-Specific File Handling" feature:
pt_pt: Métodos e atributos para a funcionalidade "Tratamento de Ficheiros Específico da Plataforma" do :pep:`3333`:
ru: Методы и атрибуты функции «Дополнительная обработка файлов для конкретной платформы» :pep:`3333`:

source: A ``wsgi.file_wrapper`` factory, compatible with :class:`wsgiref.types.FileWrapper`, or ``None``. The default value of this attribute is the :class:`wsgiref.util.FileWrapper` class.
pt_pt: Uma fábrica ``wsgi.file_wrapper``, compatível com :class:`wsgiref.types.FileWrapper`, ou ``None``. O valor predefinido deste atributo é a classe :class:`wsgiref.util.FileWrapper`.
ru: Фабрика ``wsgi.file_wrapper``, совместимая с ``wsgiref.types.FileWrapper`` или ``None``. Значением по умолчанию для этого атрибута является класс :class:`wsgiref.util.FileWrapper`.

source: Override to implement platform-specific file transmission. This method is called only if the application's return value is an instance of the class specified by the :attr:`wsgi_file_wrapper` attribute. It should return a true value if it was able to successfully transmit the file, so that the default transmission code will not be executed. The default implementation of this method just returns a false value.
pt_pt: Substitua para implementar a transmissão de ficheiros específica da plataforma. Este método é chamado apenas se o valor de retorno da aplicação for uma instância da classe especificada pelo atributo :attr:`wsgi_file_wrapper`. Deve devolver um valor verdadeiro se conseguir transmitir o ficheiro com sucesso, para que o código de transmissão predefinido não seja executado. A implementação predefinida deste método devolve simplesmente um valor falso.
ru: Переопределить для реализации передачи файлов для конкретной платформы. Этот метод вызывается только в том случае, если возвращаемое значение приложения является экземпляром класса, указанного атрибутом :attr:`wsgi_file_wrapper`. Он должен возвращать истинное значение, если ему удалось успешно передать файл, чтобы код передачи по умолчанию не выполнялся. Реализация этого метода по умолчанию просто возвращает ложное значение.

source: Miscellaneous methods and attributes:
pt_pt: Métodos e atributos diversos:
ru: Разные методы и атрибуты:

source: This attribute should be set to a true value if the handler's :meth:`_write` and :meth:`_flush` are being used to communicate directly to the client, rather than via a CGI-like gateway protocol that wants the HTTP status in a special ``Status:`` header.
pt_pt: Este atributo deve ser definido como verdadeiro se os métodos :meth:`_write` e :meth:`_flush` do manipulador estiverem a ser utilizados para comunicar diretamente com o cliente, em vez de através de um protocolo de portal semelhante a CGI que pretende o estado HTTP num cabeçalho especial ``Status:``.
ru: Этому атрибуту должно быть присвоено истинное значение, если :meth:`_write` и :meth:`_flush` обработчика используются для связи непосредственно с клиентом, а не через CGI-подобный протокол шлюза, который требует статуса HTTP в специальный заголовок ``Status:``.

source: This attribute's default value is true in :class:`BaseHandler`, but false in :class:`BaseCGIHandler` and :class:`CGIHandler`.
pt_pt: O valor predefinido deste atributo é verdadeiro em :class:`BaseHandler`, mas falso em :class:`BaseCGIHandler` e :class:`CGIHandler`.
ru: Значение по умолчанию для этого атрибута истинно в :class:`BaseHandler`, но ложно в :class:`BaseCGIHandler` и :class:`CGIHandler`.

source: If :attr:`origin_server` is true, this string attribute is used to set the HTTP version of the response set to the client. It defaults to ``"1.0"``.
pt_pt: Se :attr:`origin_server` for verdadeiro, este atributo de string é utilizado para definir a versão HTTP da resposta enviada ao cliente. Por predefinição, é ``"1.0"``.
ru: Если :attr:`origin_server` имеет значение true, этот строковый атрибут используется для установки HTTP-версии ответа, заданного клиенту. По умолчанию установлено значение ``"1.0"``.

source: Transcode CGI variables from ``os.environ`` to :pep:`3333` "bytes in unicode" strings, returning a new dictionary. This function is used by :class:`CGIHandler` and :class:`IISCGIHandler` in place of directly using ``os.environ``, which is not necessarily WSGI-compliant on all platforms and web servers using Python 3 -- specifically, ones where the OS's actual environment is Unicode (i.e. Windows), or ones where the environment is bytes, but the system encoding used by Python to decode it is anything other than ISO-8859-1 (e.g. Unix systems using UTF-8).
pt_pt: Transcodifica variáveis CGI de ``os.environ`` para strings "bytes em unicode" do :pep:`3333`, devolvendo um novo dicionário. Esta função é utilizada por :class:`CGIHandler` e :class:`IISCGIHandler` em vez de utilizar diretamente ``os.environ``, que não é necessariamente compatível com WSGI em todas as plataformas e servidores web que utilizam Python 3 — especificamente, aqueles em que o ambiente real do sistema operativo é Unicode (por exemplo, Windows), ou aqueles em que o ambiente é em bytes, mas a codificação do sistema utilizada pelo Python para o descodificar é diferente de ISO-8859-1 (por exemplo, sistemas Unix que utilizam UTF-8).
ru: Перекодируйте переменные CGI из ``os.environ`` в строки :pep:`3333` "байты в Юникоде", возвращая новый словарь. Эта функция используется :class:`CGIHandler` и :class:`IISCGIHandler` вместо прямого использования os.environ``, который не обязательно совместим с WSGI на всех платформах и веб-серверах, использующих Python 3, в частности , те, где фактическая среда ОС — Unicode (т. е. Windows), или те, где среда — это байты, но системная кодировка, используемая Python для ее декодирования, отличается от ISO-8859-1 (например, системы Unix, использующие UTF-8) .

source: If you are implementing a CGI-based handler of your own, you probably want to use this routine instead of just copying values out of ``os.environ`` directly.
pt_pt: Se estiver a implementar um manipulador baseado em CGI, provavelmente pretende utilizar esta rotina em vez de copiar simplesmente valores de ``os.environ`` diretamente.
ru: Если вы реализуете собственный обработчик на основе CGI, вы, вероятно, захотите использовать эту процедуру вместо того, чтобы просто копировать значения напрямую из ``os.environ``.

source: :mod:`wsgiref.types` -- WSGI types for static type checking
pt_pt: :mod:`wsgiref.types` -- Tipos WSGI para verificação estática de tipos
ru: :mod:`wsgiref.types` -- типы WSGI для статической проверки типов

source: This module provides various types for static type checking as described in :pep:`3333`.
pt_pt: Este módulo fornece vários tipos para verificação estática de tipos, tal como descrito em :pep:`3333`.
ru: Этот модуль предоставляет различные типы для статической проверки типов, как описано в :pep:`3333`.

source: A :class:`typing.Protocol` describing :pep:`start_response() <3333#the-start-response-callable>` callables (:pep:`3333`).
pt_pt: Um :class:`typing.Protocol` que descreve os objetos chamáveis :pep:`start_response() <3333#the-start-response-callable>` (:pep:`3333`).

source: A type alias describing a WSGI environment dictionary.
pt_pt: Um alias de tipo que descreve um dicionário de ambiente WSGI.
ru: Псевдоним типа, описывающий словарь среды WSGI.

source: A type alias describing a WSGI application callable.
pt_pt: Um alias de tipo que descreve um objeto chamável de aplicação WSGI.
ru: Псевдоним типа, описывающий вызываемое приложение WSGI.

source: A :class:`typing.Protocol` describing a :pep:`WSGI Input Stream <3333#input-and-error-streams>`.
pt_pt: Um :class:`typing.Protocol` que descreve um :pep:`Fluxo de Entrada WSGI <3333#input-and-error-streams>`.

source: A :class:`typing.Protocol` describing a :pep:`WSGI Error Stream <3333#input-and-error-streams>`.
pt_pt: Um :class:`typing.Protocol` que descreve um :pep:`Fluxo de Erro WSGI <3333#input-and-error-streams>`.

source: A :class:`typing.Protocol` describing a :pep:`file wrapper <3333#optional-platform-specific-file-handling>`. See :class:`wsgiref.util.FileWrapper` for a concrete implementation of this protocol.
pt_pt: Um :class:`typing.Protocol` que descreve um :pep:`encapsulador de ficheiros <3333#optional-platform-specific-file-handling>`. Consulte :class:`wsgiref.util.FileWrapper` para obter uma implementação concreta deste protocolo.

source: Examples
pt_pt: Exemplos
ru: Примеры

source: This is a working "Hello World" WSGI application, where the *start_response* callable should follow the :class:`.StartResponse` protocol::
pt_pt: Esta é uma aplicação WSGI funcional "Hello World", onde o objeto chamável *start_response* deve seguir o protocolo :class:`.StartResponse`::

source: """ Every WSGI application must have an application object - a callable object that accepts two arguments. For that purpose, we're going to use a function (note that you're not limited to a function, you can use a class for example). The first argument passed to the function is a dictionary containing CGI-style environment variables and the second variable is the callable object. """ from wsgiref.simple_server import make_server def hello_world_app(environ, start_response): status = "200 OK" # HTTP Status headers = [("Content-type", "text/plain; charset=utf-8")] # HTTP Headers start_response(status, headers) # The returned object is going to be printed return [b"Hello World"] with make_server("", 8000, hello_world_app) as httpd: print("Serving on port 8000...") # Serve until process is killed httpd.serve_forever()
pt_pt: """ Toda a aplicação WSGI deve ter um objeto de aplicação — um objeto chamável que aceita dois argumentos. Para esse efeito, vamos utilizar uma função (note que não está limitado a uma função, pode utilizar uma classe, por exemplo). O primeiro argumento passado à função é um dicionário que contém variáveis de ambiente no estilo CGI e o segundo argumento é o objeto chamável. """ from wsgiref.simple_server import make_server def hello_world_app(environ, start_response): status = "200 OK" # Estado HTTP headers = [("Content-type", "text/plain; charset=utf-8")] # Cabeçalhos HTTP start_response(status, headers) # O objeto devolvido será impresso return [b"Hello World"] with make_server("", 8000, hello_world_app) as httpd: print("A servir na porta 8000...") # Serve até o processo ser terminado httpd.serve_forever()

source: Example of a WSGI application serving the current directory, accept optional directory and port number (default: 8000) on the command line::
pt_pt: Exemplo de uma aplicação WSGI que serve o diretório atual, aceitando um diretório e número de porta opcionais (predefinição: 8000) na linha de comandos::
ru: Пример приложения WSGI, обслуживающего текущий каталог: примите необязательный каталог и номер порта (по умолчанию: 8000) в командной строке::

source: This method can access the current error using ``sys.exception()``, and should pass that information to *start_response* when calling it (as described in the "Error Handling" section of :pep:`3333`).
ru: Этот метод может получить доступ к текущей ошибке с помощью ``sys.Exception()`` и должен передать эту информацию в *start_response* при его вызове (как описано в разделе «Обработка ошибок» в :pep:`3333`).

source: This is a working "Hello World" WSGI application::
ru: Это рабочее приложение WSGI «Hello World»::
