Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/wsgiref.po
Languages: pt_pt, ru

source: :mod:`!wsgiref` --- WSGI Utilities and Reference Implementation
pt_pt: :mod:`!wsgiref` --- Utilitários e Implementação de Referência WSGI

source: **Source code:** :source:`Lib/wsgiref`
pt_pt: **Código-fonte:** :source:`Lib/wsgiref`
ru: **Исходный код:** :source:`Lib/wsgiref`

source: The Web Server Gateway Interface (WSGI) is a standard interface between web server software and web applications written in Python. Having a standard interface makes it easy to use an application that supports WSGI with a number of different web servers.
pt_pt: A Interface de Portal de Servidor Web (WSGI) é uma interface padrão entre software de servidor web e aplicações web escritas em Python. Ter uma interface padrão facilita a utilização de uma aplicação que suporta WSGI com vários servidores web diferentes.
ru: Интерфейс шлюза веб-сервера (WSGI) — это стандартный интерфейс между программным обеспечением веб-сервера и веб-приложениями, написанными на Python. Наличие стандартного интерфейса упрощает использование приложения, поддерживающего WSGI, с различными веб-серверами.

source: Only authors of web servers and programming frameworks need to know every detail and corner case of the WSGI design. You don't need to understand every detail of WSGI just to install a WSGI application or to write a web application using an existing framework.
pt_pt: Apenas os autores de servidores web e estruturas (*frameworks*) de programação precisam de conhecer todos os detalhes e casos específicos do desenho da WSGI. Não é necessário compreender todos os detalhes da WSGI apenas para instalar uma aplicação WSGI ou para escrever uma aplicação web utilizando uma estrutura existente.
ru: Только авторам веб-серверов и сред программирования необходимо знать каждую деталь и особенности конструкции WSGI. Вам не нужно понимать каждую деталь WSGI только для того, чтобы установить приложение WSGI или написать веб-приложение с использованием существующей платформы.

source: :mod:`wsgiref` is a reference implementation of the WSGI specification that can be used to add WSGI support to a web server or framework. It provides utilities for manipulating WSGI environment variables and response headers, base classes for implementing WSGI servers, a demo HTTP server that serves WSGI applications, types for static type checking, and a validation tool that checks WSGI servers and applications for conformance to the WSGI specification (:pep:`3333`).
pt_pt: O módulo :mod:`wsgiref` é uma implementação de referência da especificação WSGI que pode ser utilizada para adicionar suporte WSGI a um servidor web ou estrutura. Fornece utilitários para manipular variáveis de ambiente WSGI e cabeçalhos de resposta, classes base para implementar servidores WSGI, um servidor HTTP de demonstração que serve aplicações WSGI, tipos para verificação estática de tipos, e uma ferramenta de validação que verifica a conformidade de servidores e aplicações WSGI com a especificação WSGI (:pep:`3333`).
ru: :mod:`wsgiref` — это эталонная реализация спецификации WSGI, которую можно использовать для добавления поддержки WSGI на веб-сервер или платформу. Он предоставляет утилиты для управления переменными среды WSGI и заголовками ответов, базовые классы для реализации серверов WSGI, демонстрационный HTTP-сервер, обслуживающий приложения WSGI, типы для статической проверки типов и инструмент проверки, который проверяет серверы и приложения WSGI на соответствие спецификации WSGI. (:pep:`3333`).

source: See `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ for more information about WSGI, and links to tutorials and other resources.
pt_pt: Consulte `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ para obter mais informações sobre WSGI, e ligações para tutoriais e outros recursos.
ru: См. `wsgi.readthedocs.io <https://wsgi.readthedocs.io/>`_ для получения дополнительной информации о WSGI, а также ссылок на учебные пособия и другие ресурсы.

source: :mod:`wsgiref.util` -- WSGI environment utilities
pt_pt: :mod:`wsgiref.util` -- Utilitários de ambiente WSGI
ru: :mod:`wsgiref.util` -- утилиты среды WSGI.

source: This module provides a variety of utility functions for working with WSGI environments. A WSGI environment is a dictionary containing HTTP request variables as described in :pep:`3333`. All of the functions taking an *environ* parameter expect a WSGI-compliant dictionary to be supplied; please see :pep:`3333` for a detailed specification and :data:`~wsgiref.types.WSGIEnvironment` for a type alias that can be used in type annotations.
pt_pt: Este módulo fornece várias funções utilitárias para trabalhar com ambientes WSGI. Um ambiente WSGI é um dicionário que contém variáveis de pedido HTTP, tal como descrito em :pep:`3333`. Todas as funções que recebem um parâmetro *environ* esperam que seja fornecido um dicionário compatível com WSGI; consulte :pep:`3333` para obter uma especificação detalhada e :data:`~wsgiref.types.WSGIEnvironment` para um alias de tipo que pode ser utilizado em anotações de tipo.
ru: Этот модуль предоставляет множество служебных функций для работы со средами WSGI. Среда WSGI — это словарь, содержащий переменные HTTP-запроса, как описано в :pep:`3333`. Все функции, принимающие параметр *environ*, ожидают предоставления WSGI-совместимого словаря; пожалуйста, смотрите :pep:`3333` для подробной спецификации и :data:`~wsgiref.types.WSGIEnvironment` для получения псевдонима типа, который можно использовать в аннотациях типа.

source: Return a guess for whether ``wsgi.url_scheme`` should be "http" or "https", by checking for a ``HTTPS`` environment variable in the *environ* dictionary. The return value is a string.
pt_pt: Devolve uma estimativa se ``wsgi.url_scheme`` deve ser "http" ou "https", verificando a variável de ambiente ``HTTPS`` no dicionário *environ*. O valor devolvido é uma string.
ru: Возвращает предположение о том, должен ли ``wsgi.url_scheme`` быть "http" или "https", проверив переменную среды ``HTTPS`` в словаре *environ*. Возвращаемое значение представляет собой строку.

source: This function is useful when creating a gateway that wraps CGI or a CGI-like protocol such as FastCGI. Typically, servers providing such protocols will include a ``HTTPS`` variable with a value of "1", "yes", or "on" when a request is received via SSL. So, this function returns "https" if such a value is found, and "http" otherwise.
pt_pt: Esta função é útil ao criar um portal que encapsula CGI ou um protocolo semelhante ao CGI, como FastCGI. Normalmente, os servidores que fornecem tais protocolos incluem uma variável ``HTTPS`` com o valor "1", "yes" ou "on" quando um pedido é recebido via SSL. Assim, esta função devolve "https" se tal valor for encontrado, e "http" caso contrário.
ru: Эта функция полезна при создании шлюза, который использует CGI или CGI-подобный протокол, например FastCGI. Обычно серверы, предоставляющие такие протоколы, включают переменную HTTPS со значением «1», «да» или «включено», когда запрос получен через SSL. Итак, эта функция возвращает «https», если такое значение найдено, и «http» в противном случае.

source: Return the full request URI, optionally including the query string, using the algorithm found in the "URL Reconstruction" section of :pep:`3333`. If *include_query* is false, the query string is not included in the resulting URI.
pt_pt: Devolve o URI completo do pedido, opcionalmente incluindo a string de consulta, utilizando o algoritmo descrito na secção "Reconstrução de URI" do :pep:`3333`. Se *include_query* for falso, a string de consulta não é incluída no URI resultante.
ru: Верните полный URI запроса, включая, при необходимости, строку запроса, используя алгоритм, описанный в разделе «Реконструкция URL-адреса» документа :pep:`3333`. Если *include_query* имеет значение false, строка запроса не включается в результирующий URI.

source: Similar to :func:`request_uri`, except that the ``PATH_INFO`` and ``QUERY_STRING`` variables are ignored. The result is the base URI of the application object addressed by the request.
pt_pt: Semelhante a :func:`request_uri`, exceto que as variáveis ``PATH_INFO`` e ``QUERY_STRING`` são ignoradas. O resultado é o URI base do objeto de aplicação endereçado pelo pedido.
ru: Аналогично :func:`request_uri`, за исключением того, что переменные ``PATH_INFO`` и ``QUERY_STRING`` игнорируются. Результатом является базовый URI объекта приложения, к которому обращается запрос.

source: Shift a single name from ``PATH_INFO`` to ``SCRIPT_NAME`` and return the name. The *environ* dictionary is *modified* in-place; use a copy if you need to keep the original ``PATH_INFO`` or ``SCRIPT_NAME`` intact.
pt_pt: Move um único nome de ``PATH_INFO`` para ``SCRIPT_NAME`` e devolve o nome. O dicionário *environ* é *modificado* no local; utilize uma cópia se precisar de manter o ``PATH_INFO`` ou ``SCRIPT_NAME`` originais intactos.
ru: Измените одно имя с ``PATH_INFO`` на ``SCRIPT_NAME`` и верните имя. Словарь *environ* *модифицируется* на месте; используйте копию, если вам нужно сохранить исходный ``PATH_INFO`` или ``SCRIPT_NAME`` нетронутым.

source: If there are no remaining path segments in ``PATH_INFO``, ``None`` is returned.
pt_pt: Se não existirem segmentos de caminho restantes em ``PATH_INFO``, é devolvido ``None``.
ru: Если в PATH_INFO не осталось сегментов пути, возвращается None.

source: Typically, this routine is used to process each portion of a request URI path, for example to treat the path as a series of dictionary keys. This routine modifies the passed-in environment to make it suitable for invoking another WSGI application that is located at the target URI. For example, if there is a WSGI application at ``/foo``, and the request URI path is ``/foo/bar/baz``, and the WSGI application at ``/foo`` calls :func:`shift_path_info`, it will receive the string "bar", and the environment will be updated to be suitable for passing to a WSGI application at ``/foo/bar``. That is, ``SCRIPT_NAME`` will change from ``/foo`` to ``/foo/bar``, and ``PATH_INFO`` will change from ``/bar/baz`` to ``/baz``.
pt_pt: Normalmente, esta rotina é utilizada para processar cada parte de um caminho de URI de pedido, por exemplo, para tratar o caminho como uma série de chaves de dicionário. Esta rotina modifica o ambiente fornecido para o tornar adequado para invocar outra aplicação WSGI que se encontra no URI de destino. Por exemplo, se existir uma aplicação WSGI em ``/foo`` e o caminho do URI do pedido for ``/foo/bar/baz``, e a aplicação WSGI em ``/foo`` chamar :func:`shift_path_info`, receberá a string "bar", e o ambiente será atualizado para ser adequado para passar a uma aplicação WSGI em ``/foo/bar``. Ou seja, ``SCRIPT_NAME`` mudará de ``/foo`` para ``/foo/bar``, e ``PATH_INFO`` mudará de ``/bar/baz`` para ``/baz``.
ru: Обычно эта процедура используется для обработки каждой части пути URI запроса, например, для обработки пути как серии ключей словаря. Эта процедура изменяет переданную среду, чтобы сделать ее пригодной для вызова другого приложения WSGI, расположенного по целевому URI. Например, если в ``/foo`` есть приложение WSGI, а путь URI запроса – ``/foo/bar/baz``, а приложение WSGI в ``/foo`` вызывает :func:` shift_path_info`, он получит строку "bar", и среда будет обновлена, чтобы быть подходящей для передачи в приложение WSGI по адресу ``/foo/bar``. То есть ``SCRIPT_NAME`` изменится с ``/foo`` на ``/foo/bar``, а ``PATH_INFO`` изменится с ``/bar/baz`` на ``/baz` `.

source: When ``PATH_INFO`` is just a "/", this routine returns an empty string and appends a trailing slash to ``SCRIPT_NAME``, even though empty path segments are normally ignored, and ``SCRIPT_NAME`` doesn't normally end in a slash. This is intentional behavior, to ensure that an application can tell the difference between URIs ending in ``/x`` from ones ending in ``/x/`` when using this routine to do object traversal.
pt_pt: Quando ``PATH_INFO`` é apenas "/", esta rotina devolve uma string vazia e acrescenta uma barra final a ``SCRIPT_NAME``, apesar de os segmentos de caminho vazios serem normalmente ignorados e ``SCRIPT_NAME`` não terminar normalmente com uma barra. Este comportamento é intencional, para garantir que uma aplicação possa distinguir entre URIs que terminam em ``/x`` e URIs que terminam em ``/x/`` ao utilizar esta rotina para navegação de objetos.
ru: Когда ``PATH_INFO`` представляет собой просто "/", эта процедура возвращает пустую строку и добавляет косую черту к ``SCRIPT_NAME``, хотя пустые сегменты пути обычно игнорируются, а ``SCRIPT_NAME`` обычно не игнорируется. заканчиваться косой чертой. Это намеренное поведение, призванное гарантировать, что приложение может отличить URI, оканчивающиеся на ``/x``, от URI, заканчивающихся на ``/x/``, при использовании этой процедуры для обхода объекта.

source: Update *environ* with trivial defaults for testing purposes.
pt_pt: Atualiza *environ* com valores predefinidos simples para fins de teste.
ru: Обновите *environ*, указав тривиальные настройки по умолчанию для целей тестирования.

source: This routine adds various parameters required for WSGI, including ``HTTP_HOST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO``, and all of the :pep:`3333`\ -defined ``wsgi.*`` variables. It only supplies default values, and does not replace any existing settings for these variables.
pt_pt: Esta rotina adiciona vários parâmetros necessários para WSGI, incluindo ``HTTP_HOST``, ``SERVER_NAME``, ``SERVER_PORT``, ``REQUEST_METHOD``, ``SCRIPT_NAME``, ``PATH_INFO``, e todas as variáveis ``wsgi.*`` definidas em :pep:`3333`. Fornece apenas valores predefinidos e não substitui quaisquer definições existentes para estas variáveis.
ru: Эта процедура добавляет различные параметры, необходимые для WSGI, включая HTTP_HOST, SERVER_NAME, SERVER_PORT, REQUEST_METHOD, SCRIPT_NAME, PATH_INFO и все :pep:`3333`\ -определенные переменные ``wsgi.*``. Он предоставляет только значения по умолчанию и не заменяет существующие настройки этих переменных.

source: This routine is intended to make it easier for unit tests of WSGI servers and applications to set up dummy environments. It should NOT be used by actual WSGI servers or applications, since the data is fake!
pt_pt: Esta rotina destina-se a facilitar a configuração de ambientes fictícios para testes unitários de servidores e aplicações WSGI. Não deve ser utilizada por servidores ou aplicações WSGI reais, uma vez que os dados são falsos!
ru: Эта процедура предназначена для упрощения модульных тестов серверов и приложений WSGI для настройки фиктивных сред. Его НЕ следует использовать реальными серверами или приложениями WSGI, поскольку данные являются поддельными!

source: Example usage (see also :func:`~wsgiref.simple_server.demo_app` for another example)::
pt_pt: Exemplo de utilização (consulte também :func:`~wsgiref.simple_server.demo_app` para outro exemplo)::

source: from wsgiref.util import setup_testing_defaults from wsgiref.simple_server import make_server # A relatively simple WSGI application. It's going to print out the # environment dictionary after being updated by setup_testing_defaults def simple_app(environ, start_response): setup_testing_defaults(environ) status = '200 OK' headers = [('Content-type', 'text/plain; charset=utf-8')] start_response(status, headers) ret = [("%s: %s\n" % (key, value)).encode("utf-8") for key, value in environ.items()] return ret with make_server('', 8000, simple_app) as httpd: print("Serving on port 8000...") httpd.serve_forever()
pt_pt: from wsgiref.util import setup_testing_defaults from wsgiref.simple_server import make_server # Uma aplicação WSGI relativamente simples. Vai imprimir o # dicionário de ambiente após ser atualizado por setup_testing_defaults def simple_app(environ, start_response): setup_testing_defaults(environ) status = '200 OK' headers = [('Content-type', 'text/plain; charset=utf-8')] start_response(status, headers) ret = [("%s: %s\n" % (key, value)).encode("utf-8") for key, value in environ.items()] return ret with make_server('', 8000, simple_app) as httpd: print("A servir na porta 8000...") httpd.serve_forever()

source: In addition to the environment functions above, the :mod:`wsgiref.util` module also provides these miscellaneous utilities:
pt_pt: Para além das funções de ambiente acima, o módulo :mod:`wsgiref.util` fornece também estas utilidades diversas:
ru: В дополнение к вышеперечисленным функциям среды модуль :mod:`wsgiref.util` также предоставляет следующие разные утилиты:

source: Return ``True`` if 'header_name' is an HTTP/1.1 "Hop-by-Hop" header, as defined by :rfc:`2616`.
pt_pt: Devolve ``True`` se 'header_name' for um cabeçalho HTTP/1.1 "Hop-by-Hop", tal como definido em :rfc:`2616`.
ru: Возвращает ``True``, если 'header_name' представляет собой заголовок HTTP/1.1 "Hop-by-Hop", как определено в :rfc:`2616`.

source: A concrete implementation of the :class:`wsgiref.types.FileWrapper` protocol used to convert a file-like object to an :term:`iterator`. The resulting objects are :term:`iterable`\ s. As the object is iterated over, the optional *blksize* parameter will be repeatedly passed to the *filelike* object's :meth:`read` method to obtain bytestrings to yield. When :meth:`read` returns an empty bytestring, iteration is ended and is not resumable.
pt_pt: Uma implementação concreta do protocolo :class:`wsgiref.types.FileWrapper` utilizada para converter um objeto semelhante a um ficheiro num :term:`iterador`. Os objetos resultantes são :term:`iteráveis`. À medida que o objeto é iterado, o parâmetro opcional *blksize* será passado repetidamente ao método :meth:`read` do objeto *filelike* para obter *bytestrings* a devolver. Quando :meth:`read` devolve uma *bytestring* vazia, a iteração termina e não pode ser retomada.
ru: Конкретная реализация протокола :class:`wsgiref.types.FileWrapper`, используемого для преобразования файлового объекта в :term:`итератор`. Результирующими объектами являются :term:`iterable`\ s. По мере итерации объекта необязательный параметр *blksize* будет неоднократно передаваться в метод :meth:`read` объекта *filelike* для получения байтовых строк для вывода. Когда :meth:`read` возвращает пустую строку байтов, итерация завершается и не может быть возобновлена.

source: If *filelike* has a :meth:`close` method, the returned object will also have a :meth:`close` method, and it will invoke the *filelike* object's :meth:`close` method when called.
pt_pt: Se *filelike* tiver um método :meth:`close`, o objeto devolvido também terá um método :meth:`close`, e invocará o método :meth:`close` do objeto *filelike* quando chamado.
ru: Если *filelike* имеет метод :meth:`close`, возвращаемый объект также будет иметь метод :meth:`close` и при вызове будет вызывать метод :meth:`close` объекта *filelike*.

source: Example usage::
pt_pt: Exemplo de utilização::
ru: Пример использования::

source: from io import StringIO from wsgiref.util import FileWrapper # We're using a StringIO-buffer for as the file-like object filelike = StringIO("This is an example file-like object"*10) wrapper = FileWrapper(filelike, blksize=5) for chunk in wrapper: print(chunk)
pt_pt: from io import StringIO from wsgiref.util import FileWrapper # Estamos a utilizar um buffer StringIO como objeto semelhante a um ficheiro filelike = StringIO("This is an example file-like object"*10) wrapper = FileWrapper(filelike, blksize=5) for chunk in wrapper: print(chunk)

source: Support for :meth:`~object.__getitem__` method has been removed.
pt_pt: O suporte para o método :meth:`~object.__getitem__` foi removido.
ru: Поддержка метода :meth:`~object.__getitem__` удалена.

source: :mod:`wsgiref.headers` -- WSGI response header tools
pt_pt: :mod:`wsgiref.headers` -- Ferramentas de cabeçalhos de resposta WSGI
ru: :mod:`wsgiref.headers` -- инструменты заголовка ответа WSGI

source: This module provides a single class, :class:`Headers`, for convenient manipulation of WSGI response headers using a mapping-like interface.
pt_pt: Este módulo fornece uma única classe, :class:`Headers`, para manipulação conveniente de cabeçalhos de resposta WSGI utilizando uma interface semelhante a um mapeamento.
ru: Этот модуль предоставляет единственный класс :class:`Headers` для удобного манипулирования заголовками ответов WSGI с использованием интерфейса, похожего на сопоставление.

source: Create a mapping-like object wrapping *headers*, which must be a list of header name/value tuples as described in :pep:`3333`. The default value of *headers* is an empty list.
pt_pt: Cria um objeto semelhante a um mapeamento que encapsula *headers*, que deve ser uma lista de tuplos nome/valor de cabeçalho, tal como descrito em :pep:`3333`. O valor predefinido de *headers* é uma lista vazia.
ru: Создайте подобную сопоставлению оболочку объекта *headers*, которая должна представлять собой список кортежей имени/значения заголовка, как описано в :pep:`3333`. Значением по умолчанию *headers* является пустой список.

source: :class:`Headers` objects support typical mapping operations including :meth:`~object.__getitem__`, :meth:`~dict.get`, :meth:`~object.__setitem__`, :meth:`~dict.setdefault`, :meth:`~object.__delitem__` and :meth:`~object.__contains__`. For each of these methods, the key is the header name (treated case-insensitively), and the value is the first value associated with that header name. Setting a header deletes any existing values for that header, then adds a new value at the end of the wrapped header list. Headers' existing order is generally maintained, with new headers added to the end of the wrapped list.
pt_pt: Os objetos :class:`Headers` suportam operações típicas de mapeamento, incluindo :meth:`~object.__getitem__`, :meth:`~dict.get`, :meth:`~object.__setitem__`, :meth:`~dict.setdefault`, :meth:`~object.__delitem__` e :meth:`~object.__contains__`. Para cada um destes métodos, a chave é o nome do cabeçalho (tratado de forma insensível a maiúsculas/minúsculas), e o valor é o primeiro valor associado a esse nome de cabeçalho. Definir um cabeçalho apaga quaisquer valores existentes para esse cabeçalho e, em seguida, adiciona um novo valor no final da lista de cabeçalhos encapsulada. A ordem existente dos cabeçalhos é geralmente mantida, com novos cabeçalhos adicionados ao final da lista encapsulada.
ru: Объекты :class:`Headers` поддерживают типичные операции сопоставления, включая :meth:`~object.__getitem__`, :meth:`~dict.get`, :meth:`~object.__setitem__`, :meth:`~dict.setdefault `, :meth:`~object.__delitem__` и :meth:`~object.__contains__`. Для каждого из этих методов ключом является имя заголовка (обрабатывается без учета регистра), а значением является первое значение, связанное с этим именем заголовка. Установка заголовка удаляет все существующие значения для этого заголовка, а затем добавляет новое значение в конец списка упакованных заголовков. Существующий порядок заголовков обычно сохраняется, а новые заголовки добавляются в конец обернутого списка.

source: Unlike a dictionary, :class:`Headers` objects do not raise an error when you try to get or delete a key that isn't in the wrapped header list. Getting a nonexistent header just returns ``None``, and deleting a nonexistent header does nothing.
pt_pt: Ao contrário de um dicionário, os objetos :class:`Headers` não geram um erro quando tenta obter ou apagar uma chave que não existe na lista de cabeçalhos encapsulada. Obter um cabeçalho inexistente devolve simplesmente ``None``, e apagar um cabeçalho inexistente não faz nada.
ru: В отличие от словаря, объекты :class:`Headers` не вызывают ошибку, когда вы пытаетесь получить или удалить ключ, которого нет в обернутом списке заголовков. Получение несуществующего заголовка просто возвращает None, а удаление несуществующего заголовка ничего не делает.
