Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/wsgiref.po
Languages: pt_pt, ru

source: from wsgiref.validate import validator from wsgiref.simple_server import make_server # Our callable object which is intentionally not compliant to the # standard, so the validator is going to break def simple_app(environ, start_response): status = '200 OK' # HTTP Status headers = [('Content-type', 'text/plain')] # HTTP Headers start_response(status, headers) # This is going to break because we need to return a list, and # the validator is going to inform us return b"Hello World" # This is the application wrapped in a validator validator_app = validator(simple_app) with make_server('', 8000, validator_app) as httpd: print("Listening on port 8000....") httpd.serve_forever()
pt_pt: from wsgiref.validate import validator from wsgiref.simple_server import make_server # O nosso objeto chamável que intencionalmente não está conforme com o # padrão, pelo que o validador irá falhar def simple_app(environ, start_response): status = '200 OK' # Estado HTTP headers = [('Content-type', 'text/plain')] # Cabeçalhos HTTP start_response(status, headers) # Isto vai falhar porque precisamos de devolver uma lista, e # o validador vai informar-nos return b"Hello World" # Esta é a aplicação encapsulada num validador validator_app = validator(simple_app) with make_server('', 8000, validator_app) as httpd: print("À escuta na porta 8000....") httpd.serve_forever()

source: :mod:`wsgiref.handlers` -- server/gateway base classes
pt_pt: :mod:`wsgiref.handlers` -- classes base de servidor/portal
ru: :mod:`wsgiref.handlers` -- базовые классы сервера/шлюза

source: This module provides base handler classes for implementing WSGI servers and gateways. These base classes handle most of the work of communicating with a WSGI application, as long as they are given a CGI-like environment, along with input, output, and error streams.
pt_pt: Este módulo fornece classes base de manipuladores para implementar servidores e portais WSGI. Estas classes base tratam da maior parte do trabalho de comunicação com uma aplicação WSGI, desde que lhes seja fornecido um ambiente semelhante a CGI, juntamente com fluxos de entrada, saída e erro.
ru: Этот модуль предоставляет базовые классы обработчиков для реализации серверов и шлюзов WSGI. Эти базовые классы выполняют большую часть работы по взаимодействию с приложением WSGI, если им предоставляется среда, подобная CGI, а также потоки ввода, вывода и ошибок.

source: CGI-based invocation via ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` and ``os.environ``. This is useful when you have a WSGI application and want to run it as a CGI script. Simply invoke ``CGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
pt_pt: Invocação baseada em CGI através de ``sys.stdin``, ``sys.stdout``, ``sys.stderr`` e ``os.environ``. Isto é útil quando tem uma aplicação WSGI e pretende executá-la como um script CGI. Basta invocar ``CGIHandler().run(app)``, onde ``app`` é o objeto de aplicação WSGI que pretende invocar.
ru: Вызов на основе CGI через sys.stdin, sys.stdout, sys.stderr и os.environ. Это полезно, если у вас есть приложение WSGI и вы хотите запустить его как сценарий CGI. Просто вызовите ``CGIHandler().run(app)``, где ``app`` — это объект приложения WSGI, который вы хотите вызвать.

source: This class is a subclass of :class:`BaseCGIHandler` that sets ``wsgi.run_once`` to true, ``wsgi.multithread`` to false, and ``wsgi.multiprocess`` to true, and always uses :mod:`sys` and :mod:`os` to obtain the necessary CGI streams and environment.
pt_pt: Esta classe é uma subclasse de :class:`BaseCGIHandler` que define ``wsgi.run_once`` como verdadeiro, ``wsgi.multithread`` como falso, e ``wsgi.multiprocess`` como verdadeiro, e utiliza sempre :mod:`sys` e :mod:`os` para obter os fluxos e o ambiente CGI necessários.
ru: Этот класс является подклассом :class:`BaseCGIHandler`, который устанавливает для ``wsgi.run_once`` значение true, для ``wsgi.multithread`` значение false и для ``wsgi.multiprocess`` значение true, и всегда использует :mod :`sys` и :mod:`os` для получения необходимых потоков CGI и среды.

source: A specialized alternative to :class:`CGIHandler`, for use when deploying on Microsoft's IIS web server, without having set the config allowPathInfo option (IIS>=7) or metabase allowPathInfoForScriptMappings (IIS<7).
pt_pt: Uma alternativa especializada a :class:`CGIHandler`, para utilização ao implementar no servidor web IIS da Microsoft, sem ter definido a opção de configuração allowPathInfo (IIS>=7) ou allowPathInfoForScriptMappings na metabase (IIS<7).
ru: Специализированная альтернатива :class:`CGIHandler` для использования при развертывании на веб-сервере Microsoft IIS без установки параметра конфигурацииallowPathInfo (IIS>=7) или метабазыallowPathInfoForScriptMappings (IIS<7).

source: By default, IIS gives a ``PATH_INFO`` that duplicates the ``SCRIPT_NAME`` at the front, causing problems for WSGI applications that wish to implement routing. This handler strips any such duplicated path.
pt_pt: Por predefinição, o IIS fornece um ``PATH_INFO`` que duplica o ``SCRIPT_NAME`` no início, causando problemas para aplicações WSGI que pretendem implementar encaminhamento. Este manipulador remove qualquer caminho duplicado.
ru: По умолчанию IIS предоставляет PATH_INFO, который дублирует SCRIPT_NAME в начале, вызывая проблемы для приложений WSGI, которые хотят реализовать маршрутизацию. Этот обработчик удаляет любой такой дублированный путь.

source: IIS can be configured to pass the correct ``PATH_INFO``, but this causes another bug where ``PATH_TRANSLATED`` is wrong. Luckily this variable is rarely used and is not guaranteed by WSGI. On IIS<7, though, the setting can only be made on a vhost level, affecting all other script mappings, many of which break when exposed to the ``PATH_TRANSLATED`` bug. For this reason IIS<7 is almost never deployed with the fix (Even IIS7 rarely uses it because there is still no UI for it.).
pt_pt: O IIS pode ser configurado para passar o ``PATH_INFO`` correto, mas isto causa outro erro em que ``PATH_TRANSLATED`` está incorreto. Felizmente, esta variável é raramente utilizada e não é garantida pela WSGI. No IIS<7, no entanto, a definição só pode ser feita ao nível do *vhost*, afetando todos os outros mapeamentos de *scripts*, muitos dos quais falham quando expostos ao erro ``PATH_TRANSLATED``. Por esta razão, o IIS<7 é quase nunca implementado com a correção (até o IIS7 raramente a utiliza porque ainda não existe uma interface de utilizador para isso).
ru: IIS можно настроить на передачу правильного PATH_INFO, но это вызывает еще одну ошибку, когда PATH_TRANSLATED неверен. К счастью, эта переменная используется редко и не гарантируется WSGI. Однако в IIS<7 эту настройку можно выполнить только на уровне виртуального хоста, что затрагивает все остальные сопоставления сценариев, многие из которых нарушаются при обнаружении ошибки ``PATH_TRANSLATED``. По этой причине IIS<7 почти никогда не развертывается с исправлением (даже IIS7 редко использует его, поскольку для него до сих пор нет пользовательского интерфейса).

source: There is no way for CGI code to tell whether the option was set, so a separate handler class is provided. It is used in the same way as :class:`CGIHandler`, i.e., by calling ``IISCGIHandler().run(app)``, where ``app`` is the WSGI application object you wish to invoke.
pt_pt: Não existe forma de o código CGI saber se a opção foi definida, pelo que é fornecida uma classe de manipulador separada. É utilizada da mesma forma que :class:`CGIHandler`, ou seja, chamando ``IISCGIHandler().run(app)``, onde ``app`` é o objeto de aplicação WSGI que pretende invocar.
ru: Код CGI не может определить, установлена ​​ли опция, поэтому предоставляется отдельный класс-обработчик. Он используется так же, как :class:`CGIHandler`, т.е. путем вызова ``IISCGIHandler().run(app)``, где ``app`` — это объект приложения WSGI, который вы хотите вызвать.

source: Similar to :class:`CGIHandler`, but instead of using the :mod:`sys` and :mod:`os` modules, the CGI environment and I/O streams are specified explicitly. The *multithread* and *multiprocess* values are used to set the ``wsgi.multithread`` and ``wsgi.multiprocess`` flags for any applications run by the handler instance.
pt_pt: Semelhante a :class:`CGIHandler`, mas em vez de utilizar os módulos :mod:`sys` e :mod:`os`, o ambiente CGI e os fluxos de I/O são especificados explicitamente. Os valores *multithread* e *multiprocess* são utilizados para definir as *flags* ``wsgi.multithread`` e ``wsgi.multiprocess`` para quaisquer aplicações executadas pela instância do manipulador.
ru: Аналогично :class:`CGIHandler`, но вместо использования модулей :mod:`sys` и :mod:`os` среда CGI и потоки ввода-вывода указываются явно. Значения *multithread* и *multiprocess* используются для установки флагов wsgi.multithread и wsgi.multiprocess для любых приложений, запускаемых экземпляром обработчика.

source: This class is a subclass of :class:`SimpleHandler` intended for use with software other than HTTP "origin servers". If you are writing a gateway protocol implementation (such as CGI, FastCGI, SCGI, etc.) that uses a ``Status:`` header to send an HTTP status, you probably want to subclass this instead of :class:`SimpleHandler`.
pt_pt: Esta classe é uma subclasse de :class:`SimpleHandler` destinada a ser utilizada com software que não seja servidores de origem HTTP. Se estiver a escrever uma implementação de protocolo de portal (como CGI, FastCGI, SCGI, etc.) que utiliza um cabeçalho ``Status:`` para enviar um estado HTTP, provavelmente irá querer criar uma subclasse desta em vez de :class:`SimpleHandler`.
ru: Этот класс является подклассом :class:`SimpleHandler`, предназначенным для использования с программным обеспечением, отличным от «исходных серверов» HTTP. Если вы пишете реализацию протокола шлюза (например, CGI, FastCGI, SCGI и т. д.), которая использует заголовок ``Status:`` для отправки статуса HTTP, вы, вероятно, захотите создать его подкласс вместо :class:`SimpleHandler` .

source: Similar to :class:`BaseCGIHandler`, but designed for use with HTTP origin servers. If you are writing an HTTP server implementation, you will probably want to subclass this instead of :class:`BaseCGIHandler`.
pt_pt: Semelhante a :class:`BaseCGIHandler`, mas desenhada para ser utilizada com servidores de origem HTTP. Se estiver a escrever uma implementação de servidor HTTP, provavelmente irá querer criar uma subclasse desta em vez de :class:`BaseCGIHandler`.
ru: Похож на :class:`BaseCGIHandler`, но предназначен для использования с исходными серверами HTTP. Если вы пишете реализацию HTTP-сервера, вы, вероятно, захотите создать подкласс вместо :class:`BaseCGIHandler`.

source: This class is a subclass of :class:`BaseHandler`. It overrides the :meth:`!__init__`, :meth:`~BaseHandler.get_stdin`, :meth:`~BaseHandler.get_stderr`, :meth:`~BaseHandler.add_cgi_vars`, :meth:`~BaseHandler._write`, and :meth:`~BaseHandler._flush` methods to support explicitly setting the environment and streams via the constructor. The supplied environment and streams are stored in the :attr:`stdin`, :attr:`stdout`, :attr:`stderr`, and :attr:`environ` attributes.
pt_pt: Esta classe é uma subclasse de :class:`BaseHandler`. Substitui os métodos :meth:`!__init__`, :meth:`~BaseHandler.get_stdin`, :meth:`~BaseHandler.get_stderr`, :meth:`~BaseHandler.add_cgi_vars`, :meth:`~BaseHandler._write` e :meth:`~BaseHandler._flush` para suportar a definição explícita do ambiente e dos fluxos através do construtor. O ambiente e os fluxos fornecidos são armazenados nos atributos :attr:`stdin`, :attr:`stdout`, :attr:`stderr` e :attr:`environ`.
ru: Этот класс является подклассом :class:`BaseHandler`. Он переопределяет :meth:`!__init__`, :meth:`~BaseHandler.get_stdin`, :meth:`~BaseHandler.get_stderr`, :meth:`~BaseHandler.add_cgi_vars`, :meth:`~BaseHandler._write` и :meth:`~BaseHandler._flush` для поддержки явной настройки среды и потоков через конструктор. Предоставленная среда и потоки хранятся в атрибутах :attr:`stdin`, :attr:`stdout`, :attr:`stderr` и :attr:`environ`.

source: The :meth:`~io.BufferedIOBase.write` method of *stdout* should write each chunk in full, like :class:`io.BufferedIOBase`.
pt_pt: O método :meth:`~io.BufferedIOBase.write` de *stdout* deve escrever cada bloco na íntegra, tal como :class:`io.BufferedIOBase`.
ru: Метод :meth:`~io.BufferedIOBase.write` *stdout* должен записывать каждый фрагмент полностью, например :class:`io.BufferedIOBase`.

source: This is an abstract base class for running WSGI applications. Each instance will handle a single HTTP request, although in principle you could create a subclass that was reusable for multiple requests.
pt_pt: Esta é uma classe base abstrata para executar aplicações WSGI. Cada instância tratará de um único pedido HTTP, embora, em princípio, possa criar uma subclasse reutilizável para vários pedidos.
ru: Это абстрактный базовый класс для запуска приложений WSGI. Каждый экземпляр будет обрабатывать один HTTP-запрос, хотя в принципе вы можете создать подкласс, который можно будет повторно использовать для нескольких запросов.

source: :class:`BaseHandler` instances have only one method intended for external use:
pt_pt: As instâncias de :class:`BaseHandler` têm apenas um método destinado a utilização externa:
ru: Экземпляры :class:`BaseHandler` имеют только один метод, предназначенный для внешнего использования:

source: Run the specified WSGI application, *app*.
pt_pt: Executa a aplicação WSGI especificada, *app*.
ru: Запустите указанное приложение WSGI *app*.

source: All of the other :class:`BaseHandler` methods are invoked by this method in the process of running the application, and thus exist primarily to allow customizing the process.
pt_pt: Todos os outros métodos de :class:`BaseHandler` são invocados por este método durante o processo de execução da aplicação e, como tal, existem principalmente para permitir a personalização do processo.
ru: Все остальные методы :class:`BaseHandler` вызываются этим методом в процессе запуска приложения и, таким образом, существуют в первую очередь для обеспечения возможности настройки процесса.

source: The following methods MUST be overridden in a subclass:
pt_pt: Os seguintes métodos DEVEM ser substituídos numa subclasse:
ru: Следующие методы ДОЛЖНЫ быть переопределены в подклассе:

source: Buffer the bytes *data* for transmission to the client. It's okay if this method actually transmits the data; :class:`BaseHandler` just separates write and flush operations for greater efficiency when the underlying system actually has such a distinction.
pt_pt: Armazena em buffer os bytes *data* para transmissão ao cliente. Não há problema se este método transmitir efetivamente os dados; :class:`BaseHandler` apenas separa as operações de escrita e descarga para maior eficiência quando o sistema subjacente tem efetivamente essa distinção.
ru: Буферизируйте байты *данных* для передачи клиенту. Ничего страшного, если этот метод действительно передает данные; :class:`BaseHandler` просто разделяет операции записи и очистки для большей эффективности, когда базовая система действительно имеет такое различие.

source: Force buffered data to be transmitted to the client. It's okay if this method is a no-op (i.e., if :meth:`_write` actually sends the data).
pt_pt: Força a transmissão dos dados em buffer para o cliente. Não há problema se este método não fizer nada (ou seja, se :meth:`_write` enviar efetivamente os dados).
ru: Принудительно передавать буферизованные данные клиенту. Ничего страшного, если этот метод является пустым (т.е. если :meth:`_write` действительно отправляет данные).

source: Return an object compatible with :class:`~wsgiref.types.InputStream` suitable for use as the ``wsgi.input`` of the request currently being processed.
pt_pt: Devolve um objeto compatível com :class:`~wsgiref.types.InputStream` adequado para ser utilizado como ``wsgi.input`` do pedido atualmente a ser processado.
ru: Возвращает объект, совместимый с :class:`~wsgiref.types.InputStream`, подходящий для использования в качестве ``wsgi.input`` обрабатываемого в данный момент запроса.

source: Return an object compatible with :class:`~wsgiref.types.ErrorStream` suitable for use as the ``wsgi.errors`` of the request currently being processed.
pt_pt: Devolve um objeto compatível com :class:`~wsgiref.types.ErrorStream` adequado para ser utilizado como ``wsgi.errors`` do pedido atualmente a ser processado.
ru: Возвращает объект, совместимый с :class:`~wsgiref.types.ErrorStream`, подходящий для использования в качестве ``wsgi.errors`` запроса, обрабатываемого в данный момент.

source: Insert CGI variables for the current request into the :attr:`environ` attribute.
pt_pt: Insere variáveis CGI para o pedido atual no atributo :attr:`environ`.
ru: Вставьте переменные CGI для текущего запроса в атрибут :attr:`environ`.

source: Here are some other methods and attributes you may wish to override. This list is only a summary, however, and does not include every method that can be overridden. You should consult the docstrings and source code for additional information before attempting to create a customized :class:`BaseHandler` subclass.
pt_pt: Aqui estão alguns outros métodos e atributos que pode desejar substituir. Esta lista é apenas um resumo e não inclui todos os métodos que podem ser substituídos. Deve consultar as *docstrings* e o código-fonte para obter informações adicionais antes de tentar criar uma subclasse personalizada de :class:`BaseHandler`.
ru: Вот некоторые другие методы и атрибуты, которые вы, возможно, захотите переопределить. Однако этот список является лишь кратким и не включает в себя все методы, которые можно переопределить. Вам следует обратиться к строкам документации и исходному коду для получения дополнительной информации, прежде чем пытаться создать собственный подкласс :class:`BaseHandler`.

source: Attributes and methods for customizing the WSGI environment:
pt_pt: Atributos e métodos para personalizar o ambiente WSGI:
ru: Атрибуты и методы настройки среды WSGI:

source: The value to be used for the ``wsgi.multithread`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
pt_pt: O valor a ser utilizado para a variável de ambiente ``wsgi.multithread``. Por predefinição, é verdadeiro em :class:`BaseHandler`, mas pode ter um valor predefinido diferente (ou ser definido pelo construtor) nas outras subclasses.
ru: Значение, которое будет использоваться для переменной среды wsgi.multithread. По умолчанию в :class:`BaseHandler` оно имеет значение true, но может иметь другое значение по умолчанию (или быть установлено конструктором) в других подклассах.

source: The value to be used for the ``wsgi.multiprocess`` environment variable. It defaults to true in :class:`BaseHandler`, but may have a different default (or be set by the constructor) in the other subclasses.
pt_pt: O valor a ser utilizado para a variável de ambiente ``wsgi.multiprocess``. Por predefinição, é verdadeiro em :class:`BaseHandler`, mas pode ter um valor predefinido diferente (ou ser definido pelo construtor) nas outras subclasses.
ru: Значение, которое будет использоваться для переменной среды wsgi.multiprocess. По умолчанию в :class:`BaseHandler` оно имеет значение true, но может иметь другое значение по умолчанию (или быть установлено конструктором) в других подклассах.

source: The value to be used for the ``wsgi.run_once`` environment variable. It defaults to false in :class:`BaseHandler`, but :class:`CGIHandler` sets it to true by default.
pt_pt: O valor a ser utilizado para a variável de ambiente ``wsgi.run_once``. Por predefinição, é falso em :class:`BaseHandler`, mas :class:`CGIHandler` define-o como verdadeiro por predefinição.
ru: Значение, которое будет использоваться для переменной среды wsgi.run_once. По умолчанию в :class:`BaseHandler` оно имеет значение false, но :class:`CGIHandler` по умолчанию устанавливает для него значение true.

source: The default environment variables to be included in every request's WSGI environment. By default, this is a copy of ``os.environ`` at the time that :mod:`wsgiref.handlers` was imported, but subclasses can either create their own at the class or instance level. Note that the dictionary should be considered read-only, since the default value is shared between multiple classes and instances.
pt_pt: As variáveis de ambiente predefinidas a serem incluídas no ambiente WSGI de cada pedido. Por predefinição, trata-se de uma cópia de ``os.environ`` no momento em que :mod:`wsgiref.handlers` foi importado, mas as subclasses podem criar as suas próprias ao nível da classe ou da instância. Note que o dicionário deve ser considerado apenas de leitura, uma vez que o valor predefinido é partilhado entre várias classes e instâncias.
ru: Переменные среды по умолчанию, которые будут включены в среду WSGI каждого запроса. По умолчанию это копия os.environ на момент импорта :mod:wsgiref.handlers, но подклассы могут создавать свои собственные на уровне класса или экземпляра. Обратите внимание, что словарь следует рассматривать как доступный только для чтения, поскольку значение по умолчанию используется несколькими классами и экземплярами.

source: If the :attr:`origin_server` attribute is set, this attribute's value is used to set the default ``SERVER_SOFTWARE`` WSGI environment variable, and also to set a default ``Server:`` header in HTTP responses. It is ignored for handlers (such as :class:`BaseCGIHandler` and :class:`CGIHandler`) that are not HTTP origin servers.
pt_pt: Se o atributo :attr:`origin_server` estiver definido, o valor deste atributo é utilizado para definir a variável de ambiente WSGI ``SERVER_SOFTWARE`` por predefinição e também para definir um cabeçalho ``Server:`` por predefinição nas respostas HTTP. É ignorado para manipuladores (como :class:`BaseCGIHandler` e :class:`CGIHandler`) que não são servidores de origem HTTP.
ru: Если установлен атрибут :attr:`origin_server`, значение этого атрибута используется для установки переменной среды WSGI ``SERVER_SOFTWARE`` по умолчанию, а также для установки заголовка ``Server:`` по умолчанию в ответах HTTP. Он игнорируется для обработчиков (таких как :class:`BaseCGIHandler` и :class:`CGIHandler`), которые не являются исходными серверами HTTP.

source: The term "Python" is replaced with implementation specific term like "CPython", "Jython" etc.
pt_pt: O termo "Python" é substituído por um termo específico da implementação, como "CPython", "Jython", etc.
ru: Термин «Python» заменяется термином, специфичным для реализации, например «CPython», «Jython» и т. д.

source: Return the URL scheme being used for the current request. The default implementation uses the :func:`guess_scheme` function from :mod:`wsgiref.util` to guess whether the scheme should be "http" or "https", based on the current request's :attr:`environ` variables.
pt_pt: Devolve o esquema de URI a ser utilizado para o pedido atual. A implementação predefinida utiliza a função :func:`guess_scheme` do módulo :mod:`wsgiref.util` para estimar se o esquema deve ser "http" ou "https", com base nas variáveis :attr:`environ` do pedido atual.
ru: Возвращает схему URL-адреса, используемую для текущего запроса. Реализация по умолчанию использует функцию :func:`guess_scheme` из :mod:`wsgiref.util`, чтобы угадать, должна ли схема быть «http» или «https», на основе переменных :attr:`environ` текущего запроса.
