Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.sax.reader.po
Languages: ru, sv

source: :mod:`!xml.sax.xmlreader` --- Interface for XML parsers
sv: :mod:`!xml.sax.xmlreader` --- Gränssnitt för XML-parser

source: **Source code:** :source:`Lib/xml/sax/xmlreader.py`
ru: **Исходный код:** :source:`Lib/xml/sax/xmlreader.py`
sv: **Källkod:** :source:`Lib/xml/sax/xmlreader.py`

source: SAX parsers implement the :class:`XMLReader` interface. They are implemented in a Python module, which must provide a function :func:`create_parser`. This function is invoked by :func:`xml.sax.make_parser` with no arguments to create a new parser object.
ru: Парсеры SAX реализуют интерфейс :class:`XMLReader`. Они реализованы в модуле Python, который должен предоставлять функцию :func:`create_parser`. Эта функция вызывается :func:`xml.sax.make_parser` без аргументов для создания нового объекта синтаксического анализатора.
sv: SAX-parsers implementerar gränssnittet :class:`XMLReader`. De implementeras i en Python-modul, som måste tillhandahålla en funktion :func:`create_parser`. Denna funktion anropas av :func:`xml.sax.make_parser` utan argument för att skapa ett nytt parser-objekt.

source: Base class which can be inherited by SAX parsers.
ru: Базовый класс, который может быть унаследован парсерами SAX.
sv: Basklass som kan ärvas av SAX-parsers.

source: In some cases, it is desirable not to parse an input source at once, but to feed chunks of the document as they get available. Note that the reader will normally not read the entire file, but read it in chunks as well; still :meth:`parse` won't return until the entire document is processed. So these interfaces should be used if the blocking behaviour of :meth:`parse` is not desirable.
ru: В некоторых случаях желательно не анализировать входной источник сразу, а передавать фрагменты документа по мере их поступления. Обратите внимание, что программа чтения обычно не читает весь файл, а читает его частями; тем не менее :meth:`parse` не вернет результат, пока весь документ не будет обработан. Таким образом, эти интерфейсы следует использовать, если блокирующее поведение :meth:`parse` нежелательно.
sv: I vissa fall är det önskvärt att inte analysera en inmatningskälla på en gång, utan att mata in delar av dokumentet allteftersom de blir tillgängliga. Observera att läsaren normalt inte kommer att läsa hela filen, utan även läsa den i bitar; ändå kommer :meth:`parse` inte att returnera förrän hela dokumentet har bearbetats. Så dessa gränssnitt bör användas om det blockerande beteendet hos :meth:`parse` inte är önskvärt.

source: When the parser is instantiated it is ready to begin accepting data from the feed method immediately. After parsing has been finished with a call to close the reset method must be called to make the parser ready to accept new data, either from feed or using the parse method.
ru: Когда экземпляр синтаксического анализатора создан, он готов немедленно начать принимать данные из метода подачи. После завершения синтаксического анализа вызовом закрытия необходимо вызвать метод сброса, чтобы подготовить синтаксический анализатор к приему новых данных либо из канала, либо с использованием метода синтаксического анализа.
sv: När parsern instansieras är den redo att omedelbart börja ta emot data från feed-metoden. Efter att parsningen har avslutats med ett anrop till close måste reset-metoden anropas för att göra parsaren redo att ta emot nya data, antingen från feed eller med parse-metoden.

source: Note that these methods must *not* be called during parsing, that is, after parse has been called and before it returns.
ru: Обратите внимание, что эти методы *не* должны вызываться во время синтаксического анализа, то есть после вызова синтаксического анализа и до его возврата.
sv: Observera att dessa metoder *inte* får anropas under parsningen, dvs. efter att parse har anropats och innan den returneras.

source: By default, the class also implements the parse method of the XMLReader interface using the feed, close and reset methods of the IncrementalParser interface as a convenience to SAX 2.0 driver writers.
ru: По умолчанию класс также реализует метод синтаксического анализа интерфейса XMLReader, используя методы подачи, закрытия и сброса интерфейса IncrementalParser для удобства разработчиков драйверов SAX 2.0.
sv: Som standard implementerar klassen också parse-metoden i XMLReader-gränssnittet med hjälp av feed-, close- och reset-metoderna i IncrementalParser-gränssnittet för att underlätta för skrivare av SAX 2.0-drivrutiner.

source: Interface for associating a SAX event with a document location. A locator object will return valid results only during calls to DocumentHandler methods; at any other time, the results are unpredictable. If information is not available, methods may return ``None``.
ru: Интерфейс для связи события SAX с местоположением документа. Объект локатора будет возвращать действительные результаты только во время вызовов методов DocumentHandler; в любое другое время результаты непредсказуемы. Если информация недоступна, методы могут возвращать None.
sv: Gränssnitt för att associera en SAX-händelse med en dokumentplats. Ett locator-objekt returnerar giltiga resultat endast under anrop till DocumentHandler-metoder; vid varje annan tidpunkt är resultaten oförutsägbara. Om information inte är tillgänglig kan metoderna returnera ``None``.

source: Encapsulation of the information needed by the :class:`XMLReader` to read entities.
ru: Инкапсуляция информации, необходимой :class:`XMLReader` для чтения сущностей.
sv: Inkapsling av den information som behövs av :class:`XMLReader` för att läsa entiteter.

source: This class may include information about the public identifier, system identifier, byte stream (possibly with character encoding information) and/or the character stream of an entity.
ru: Этот класс может включать в себя информацию об общедоступном идентификаторе, системном идентификаторе, потоке байтов (возможно, с информацией о кодировке символов) и/или потоке символов объекта.
sv: Denna klass kan innehålla information om den offentliga identifieraren, systemidentifieraren, byteströmmen (eventuellt med information om teckenkodning) och/eller teckenströmmen för en enhet.

source: Applications will create objects of this class for use in the :meth:`XMLReader.parse` method and for returning from EntityResolver.resolveEntity.
ru: Приложения будут создавать объекты этого класса для использования в методе :meth:`XMLReader.parse` и для возврата из EntityResolver.resolveEntity.
sv: Applikationer kommer att skapa objekt av denna klass för användning i :meth:`XMLReader.parse`\-metoden och för returnering från EntityResolver.resolveEntity.

source: An :class:`InputSource` belongs to the application, the :class:`XMLReader` is not allowed to modify :class:`InputSource` objects passed to it from the application, although it may make copies and modify those.
ru: :class:`InputSource` принадлежит приложению, :class:`XMLReader` не может изменять объекты :class:`InputSource`, переданные ему из приложения, хотя он может создавать копии и изменять их.
sv: En :class:`InputSource` tillhör applikationen, :class:`XMLReader` får inte modifiera :class:`InputSource`\-objekt som skickas till den från applikationen, även om den får göra kopior och modifiera dessa.

source: This is an implementation of the :class:`Attributes` interface (see section :ref:`attributes-objects`). This is a dictionary-like object which represents the element attributes in a :meth:`startElement` call. In addition to the most useful dictionary operations, it supports a number of other methods as described by the interface. Objects of this class should be instantiated by readers; *attrs* must be a dictionary-like object containing a mapping from attribute names to attribute values.
ru: Это реализация интерфейса :class:`Attributes` (см. раздел :ref:`attributes-objects`). Это объект, похожий на словарь, который представляет атрибуты элемента в вызове :meth:`startElement`. Помимо наиболее полезных словарных операций, он поддерживает ряд других методов, описанных в интерфейсе. Читатели должны создавать экземпляры объектов этого класса; *attrs* должен быть объектом, подобным словарю, содержащим сопоставление имен атрибутов со значениями атрибутов.
sv: Detta är en implementation av gränssnittet :class:`Attributes` (se avsnitt :ref:`attributes-objects`). Detta är ett ordboksliknande objekt som representerar elementattributen i ett :meth:`startElement`\-anrop. Förutom de mest användbara ordboksoperationerna stöder det ett antal andra metoder som beskrivs av gränssnittet. Objekt av denna klass bör instansieras av läsare; *attrs* måste vara ett ordboksliknande objekt som innehåller en mappning från attributnamn till attributvärden.

source: Namespace-aware variant of :class:`AttributesImpl`, which will be passed to :meth:`startElementNS`. It is derived from :class:`AttributesImpl`, but understands attribute names as two-tuples of *namespaceURI* and *localname*. In addition, it provides a number of methods expecting qualified names as they appear in the original document. This class implements the :class:`AttributesNS` interface (see section :ref:`attributes-ns-objects`).
ru: Вариант :class:`AttributesImpl`, учитывающий пространство имен, который будет передан в :meth:`startElementNS`. Он является производным от :class:`AttributesImpl`, но понимает имена атрибутов как два кортежа *namespaceURI* и *localname*. Кроме того, он предоставляет ряд методов, ожидающих полных имен в том виде, в котором они указаны в исходном документе. Этот класс реализует интерфейс :class:`AttributesNS` (см. раздел :ref:`attributes-ns-objects`).
sv: Namnrymdsmedveten variant av :class:`AttributesImpl`, som kommer att skickas till :meth:`startElementNS`. Den härstammar från :class:`AttributesImpl`, men förstår attributnamn som två dupletter av *namespaceURI* och *localname*. Dessutom innehåller den ett antal metoder som förväntar sig kvalificerade namn så som de förekommer i originaldokumentet. Denna klass implementerar gränssnittet :class:`AttributesNS` (se avsnitt :ref:`attributes-ns-objects`).

source: XMLReader Objects
ru: Объекты XMLReader
sv: XMLReader-objekt

source: The :class:`XMLReader` interface supports the following methods:
ru: Интерфейс :class:`XMLReader` поддерживает следующие методы:
sv: Gränssnittet :class:`XMLReader` har stöd för följande metoder:

source: Process an input source, producing SAX events. The *source* object can be a system identifier (a string identifying the input source -- typically a file name or a URL), a :class:`pathlib.Path` or :term:`path-like <path-like object>` object, or an :class:`InputSource` object. When :meth:`parse` returns, the input is completely processed, and the parser object can be discarded or reset.
ru: Обработка источника входных данных, создание событий SAX. Объект *source* может быть системным идентификатором (строка, идентифицирующая источник входных данных — обычно имя файла или URL-адрес), :class:`pathlib.Path` или :term:`path-like <path-like object >` или объект :class:`InputSource`. Когда :meth:`parse` возвращается, входные данные полностью обрабатываются, и объект синтаксического анализатора может быть удален или сброшен.
sv: Bearbetar en indatakälla och producerar SAX-händelser. Objektet *source* kan vara en systemidentifierare (en sträng som identifierar indatakällan - vanligtvis ett filnamn eller en URL), ett :class:`pathlib.Path`\- eller :term:`path-like <path-like object>`\-objekt, eller ett :class:`InputSource`\-objekt. När :meth:`parse` returneras har indata bearbetats fullständigt och parser-objektet kan kasseras eller återställas.

source: Added support of character streams.
ru: Добавлена ​​поддержка потоков символов.
sv: Stöd för teckenströmmar har lagts till.

source: Added support of path-like objects.
ru: Добавлена ​​поддержка объектов, похожих на пути.
sv: Stöd för vägliknande objekt har lagts till.

source: Return the current :class:`~xml.sax.handler.ContentHandler`.
ru: Верните текущий :class:`~xml.sax.handler.ContentHandler`.
sv: Returnerar den aktuella :class:`~xml.sax.handler.ContentHandler`.

source: Set the current :class:`~xml.sax.handler.ContentHandler`. If no :class:`~xml.sax.handler.ContentHandler` is set, content events will be discarded.
ru: Установите текущий :class:`~xml.sax.handler.ContentHandler`. Если :class:`~xml.sax.handler.ContentHandler` не установлен, события контента будут отброшены.
sv: Ställ in den aktuella :class:`~xml.sax.handler.ContentHandler`. Om ingen :class:`~xml.sax.handler.ContentHandler` är inställd kommer innehållshändelser att kasseras.

source: Return the current :class:`~xml.sax.handler.DTDHandler`.
ru: Верните текущий :class:`~xml.sax.handler.DTDHandler`.
sv: Returnerar den aktuella :class:`~xml.sax.handler.DTDHandler`.

source: Set the current :class:`~xml.sax.handler.DTDHandler`. If no :class:`~xml.sax.handler.DTDHandler` is set, DTD events will be discarded.
ru: Установите текущий :class:`~xml.sax.handler.DTDHandler`. Если :class:`~xml.sax.handler.DTDHandler` не установлен, события DTD будут отброшены.
sv: Ställ in den aktuella :class:`~xml.sax.handler.DTDHandler`. Om ingen :class:`~xml.sax.handler.DTDHandler` anges kommer DTD-händelser att kasseras.

source: Return the current :class:`~xml.sax.handler.EntityResolver`.
ru: Верните текущий :class:`~xml.sax.handler.EntityResolver`.
sv: Returnerar den aktuella :class:`~xml.sax.handler.EntityResolver`.

source: Set the current :class:`~xml.sax.handler.EntityResolver`. If no :class:`~xml.sax.handler.EntityResolver` is set, attempts to resolve an external entity will result in opening the system identifier for the entity, and fail if it is not available.
ru: Установите текущий :class:`~xml.sax.handler.EntityResolver`. Если :class:`~xml.sax.handler.EntityResolver` не установлен, попытки разрешить внешний объект приведут к открытию системного идентификатора объекта и завершится неудачей, если он недоступен.
sv: Ange den aktuella :class:`~xml.sax.handler.EntityResolver`. Om ingen :class:`~xml.sax.handler.EntityResolver` har angetts kommer försök att lösa en extern entitet att resultera i att systemidentifieraren för entiteten öppnas och misslyckas om den inte är tillgänglig.

source: Return the current :class:`~xml.sax.handler.ErrorHandler`.
ru: Верните текущий :class:`~xml.sax.handler.ErrorHandler`.
sv: Returnerar den aktuella :class:`~xml.sax.handler.ErrorHandler`.

source: Set the current error handler. If no :class:`~xml.sax.handler.ErrorHandler` is set, errors will be raised as exceptions, and warnings will be printed.
ru: Установите текущий обработчик ошибок. Если :class:`~xml.sax.handler.ErrorHandler` не установлен, ошибки будут выдаваться как исключения и будут выводиться предупреждения.
sv: Ställer in den aktuella felhanteraren. Om ingen :class:`~xml.sax.handler.ErrorHandler` anges, kommer fel att tas upp som undantag och varningar kommer att skrivas ut.

source: Allow an application to set the locale for errors and warnings.
ru: Разрешить приложению устанавливать локаль для ошибок и предупреждений.
sv: Tillåt en applikation att ange språk för fel och varningar.

source: SAX parsers are not required to provide localization for errors and warnings; if they cannot support the requested locale, however, they must raise a SAX exception. Applications may request a locale change in the middle of a parse.
ru: Парсеры SAX не обязаны обеспечивать локализацию ошибок и предупреждений; однако, если они не могут поддерживать запрошенную локаль, они должны вызвать исключение SAX. Приложения могут запросить изменение локали в середине анализа.
sv: SAX-parsers behöver inte tillhandahålla lokalisering för fel och varningar, men om de inte kan stödja den begärda språkdräkten måste de ge upphov till ett SAX-undantag. Applikationer kan begära en lokaländring mitt under en parsning.

source: Return the current setting for feature *featurename*. If the feature is not recognized, :exc:`SAXNotRecognizedException` is raised. The well-known featurenames are listed in the module :mod:`xml.sax.handler`.
ru: Верните текущие настройки для функции *featurename*. Если функция не распознана, возникает исключение :exc:`SAXNotRecouncedException`. Известные имена функций перечислены в модуле :mod:`xml.sax.handler`.
sv: Returnerar den aktuella inställningen för funktionen *featurename*. Om funktionen inte känns igen, :exc:`SAXNotRecognizedException`. De välkända funktionsnamnen finns listade i modulen :mod:`xml.sax.handler`.

source: Set the *featurename* to *value*. If the feature is not recognized, :exc:`SAXNotRecognizedException` is raised. If the feature or its setting is not supported by the parser, *SAXNotSupportedException* is raised.
ru: Установите для *featurename* значение *value*. Если функция не распознана, возникает исключение :exc:`SAXNotRecouncedException`. Если функция или ее настройка не поддерживаются анализатором, возникает исключение *SAXNotSupportedException*.
sv: Ställ in *featurename* till *value*. Om egenskapen inte känns igen, :exc:`SAXNotRecognizedException` utlöses. Om funktionen eller dess inställning inte stöds av parsern, genereras *SAXNotSupportedException*.

source: Return the current setting for property *propertyname*. If the property is not recognized, a :exc:`SAXNotRecognizedException` is raised. The well-known propertynames are listed in the module :mod:`xml.sax.handler`.
ru: Верните текущие настройки для свойства *propertyname*. Если свойство не распознано, возникает исключение :exc:`SAXNotRecouncedException`. Известные имена свойств перечислены в модуле :mod:`xml.sax.handler`.
sv: Returnerar den aktuella inställningen för egenskapen *propertyname*. Om egenskapen inte känns igen kommer ett :exc:`SAXNotRecognizedException` att uppstå. De välkända egenskapsnamnen finns listade i modulen :mod:`xml.sax.handler`.

source: Set the *propertyname* to *value*. If the property is not recognized, :exc:`SAXNotRecognizedException` is raised. If the property or its setting is not supported by the parser, *SAXNotSupportedException* is raised.
ru: Установите для *propertyname* значение *value*. Если свойство не распознано, возникает исключение :exc:`SAXNotRecouncedException`. Если свойство или его параметр не поддерживаются анализатором, возникает исключение *SAXNotSupportedException*.
sv: Ställ in *propertyname* till *value*. Om egenskapen inte känns igen, :exc:`SAXNotRecognizedException` utlöses. Om egenskapen eller dess inställning inte stöds av parsern, genereras *SAXNotSupportedException*.

source: IncrementalParser Objects
ru: Объекты IncrementalParser
sv: IncrementalParser-objekt

source: Instances of :class:`IncrementalParser` offer the following additional methods:
ru: Экземпляры :class:`IncrementalParser` предлагают следующие дополнительные методы:
sv: Instanser av :class:`IncrementalParser` erbjuder följande ytterligare metoder:

source: Process a chunk of *data*.
ru: Обработать фрагмент *данных*.
sv: Behandla en bit av *data*.

source: Assume the end of the document. That will check well-formedness conditions that can be checked only at the end, invoke handlers, and may clean up resources allocated during parsing.
ru: Предположим, что документ закончился. Это проверит условия корректности, которые можно проверить только в конце, вызовет обработчики и может очистить ресурсы, выделенные во время синтаксического анализа.
sv: Anta att dokumentet är slut. Det kommer att kontrollera villkor för välformadhet som bara kan kontrolleras i slutet, anropa hanterare och kan rensa upp resurser som tilldelats under parsning.

source: This method is called after close has been called to reset the parser so that it is ready to parse new documents. The results of calling parse or feed after close without calling reset are undefined.
ru: Этот метод вызывается после вызова close, чтобы сбросить анализатор и подготовить его к анализу новых документов. Результаты вызова синтаксического анализа или подачи после закрытия без вызова сброса не определены.
sv: Denna metod anropas efter att close har anropats för att återställa parsern så att den är redo att parsa nya dokument. Resultatet av att anropa parse eller feed efter close utan att anropa reset är odefinierat.

source: Locator Objects
ru: Объекты локатора
sv: Lokaliseringsobjekt

source: Instances of :class:`Locator` provide these methods:
ru: Экземпляры :class:`Locator` предоставляют следующие методы:
sv: Instanser av :class:`Locator` tillhandahåller dessa metoder:

source: Return the column number where the current event begins.
ru: Возвращает номер столбца, с которого начинается текущее событие.
sv: Returnerar kolumnnumret där den aktuella händelsen börjar.

source: Return the line number where the current event begins.
ru: Возвращает номер строки, с которой начинается текущее событие.
sv: Returnerar radnumret där den aktuella händelsen börjar.

source: Return the public identifier for the current event.
ru: Верните общедоступный идентификатор текущего события.
sv: Returnerar den offentliga identifieraren för den aktuella händelsen.

source: Return the system identifier for the current event.
ru: Возвращает системный идентификатор текущего события.
sv: Returnerar systemidentifieraren för den aktuella händelsen.

source: InputSource Objects
ru: Объекты InputSource
sv: InputSource-objekt

source: Sets the public identifier of this :class:`InputSource`.
ru: Устанавливает общедоступный идентификатор этого :class:`InputSource`.
sv: Anger den offentliga identifieraren för denna :class:`InputSource`.

source: Returns the public identifier of this :class:`InputSource`.
ru: Возвращает общедоступный идентификатор этого :class:`InputSource`.
sv: Returnerar den offentliga identifieraren för denna :class:`InputSource`.

source: Sets the system identifier of this :class:`InputSource`.
ru: Устанавливает системный идентификатор этого :class:`InputSource`.
sv: Ställer in systemidentifieraren för denna :class:`InputSource`.

source: Returns the system identifier of this :class:`InputSource`.
ru: Возвращает системный идентификатор этого :class:`InputSource`.
sv: Returnerar systemidentifieraren för denna :class:`InputSource`.

source: Sets the character encoding of this :class:`InputSource`.
ru: Устанавливает кодировку символов этого :class:`InputSource`.
sv: Ställer in teckenkodningen för denna :class:`InputSource`.

source: The encoding must be a string acceptable for an XML encoding declaration (see section 4.3.3 of the XML recommendation).
ru: Кодировка должна быть строкой, приемлемой для объявления кодировки XML (см. раздел 4.3.3 рекомендаций по XML).
sv: Kodningen måste vara en sträng som är godtagbar för en XML-kodningsdeklaration (se avsnitt 4.3.3 i XML-rekommendationen).

source: The encoding attribute of the :class:`InputSource` is ignored if the :class:`InputSource` also contains a character stream.
ru: Атрибут кодирования :class:`InputSource` игнорируется, если :class:`InputSource` также содержит поток символов.
sv: Encoding-attributet för :class:`InputSource` ignoreras om :class:`InputSource` också innehåller en teckenström.

source: Get the character encoding of this InputSource.
ru: Получите кодировку символов этого источника ввода.
sv: Hämta teckenkodningen för denna InputSource.

source: Set the byte stream (a :term:`binary file`) for this input source.
ru: Установите поток байтов (двоичный файл) для этого источника входного сигнала.
sv: Ange byteströmmen (en :term:`binary file`) för denna inmatningskälla.
