Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.etree.elementtree.po
Languages: pt_pt, ru

source: :mod:`!xml.etree.ElementTree` --- The ElementTree XML API
pt_pt: :mod:`!xml.etree.ElementTree` — A API XML ElementTree

source: **Source code:** :source:`Lib/xml/etree/ElementTree.py`
pt_pt: **Código-fonte:** :source:`Lib/xml/etree/ElementTree.py`
ru: **Исходный код:** :source:`Lib/xml/etree/ElementTree.py`

source: The :mod:`xml.etree.ElementTree` module implements a simple and efficient API for parsing and creating XML data.
pt_pt: O módulo :mod:`xml.etree.ElementTree` implementa uma API simples e eficiente para analisar e criar dados XML.
ru: Модуль :mod:`xml.etree.ElementTree` реализует простой и эффективный API для анализа и создания XML-данных.

source: This module will use a fast implementation whenever available.
pt_pt: Este módulo usará uma implementação rápida sempre que disponível.
ru: Этот модуль будет использовать быструю реализацию, когда она доступна.

source: The :mod:`!xml.etree.cElementTree` module is deprecated.
pt_pt: O módulo :mod:`!xml.etree.cElementTree` está obsoleto.
ru: Модуль :mod:`!xml.etree.cElementTree` устарел.

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
pt_pt: Se precisar de analisar dados não confiáveis ou não autenticados, consulte :ref:`xml-security`.

source: This is a short tutorial for using :mod:`xml.etree.ElementTree` (``ET`` in short). The goal is to demonstrate some of the building blocks and basic concepts of the module.
pt_pt: Este é um breve tutorial sobre a utilização de :mod:`xml.etree.ElementTree` (``ET`` em resumo). O objetivo é demonstrar alguns dos blocos de construção e conceitos básicos do módulo.
ru: Это краткое руководство по использованию :mod:`xml.etree.ElementTree` (сокращенно ``ET``). Цель состоит в том, чтобы продемонстрировать некоторые строительные блоки и основные концепции модуля.

source: XML tree and elements
pt_pt: Árvore XML e elementos
ru: XML-дерево и элементы

source: XML is an inherently hierarchical data format, and the most natural way to represent it is with a tree. ``ET`` has two classes for this purpose - :class:`ElementTree` represents the whole XML document as a tree, and :class:`Element` represents a single node in this tree. Interactions with the whole document (reading and writing to/from files) are usually done on the :class:`ElementTree` level. Interactions with a single XML element and its sub-elements are done on the :class:`Element` level.
pt_pt: O XML é um formato de dados inerentemente hierárquico, e a forma mais natural de o representar é com uma árvore. ``ET`` tem duas classes para este propósito — :class:`ElementTree` representa todo o documento XML como uma árvore, e :class:`Element` representa um único nó nesta árvore. As interações com todo o documento (leitura e escrita para/de ficheiros) são normalmente feitas ao nível de :class:`ElementTree`. As interações com um único elemento XML e os seus sub-elementos são feitas ao nível de :class:`Element`.
ru: XML — это по своей сути иерархический формат данных, и наиболее естественным способом его представления является дерево. Для этой цели в ``ET`` есть два класса: :class:`ElementTree` представляет весь XML-документ в виде дерева, а :class:`Element` представляет один узел в этом дереве. Взаимодействия со всем документом (чтение и запись в/из файлов) обычно выполняются на уровне :class:`ElementTree`. Взаимодействие с одним элементом XML и его подэлементами осуществляется на уровне :class:`Element`.

source: Parsing XML
pt_pt: Analisar XML
ru: Анализ XML

source: We'll be using the fictive :file:`country_data.xml` XML document as the sample data for this section:
pt_pt: Vamos usar o documento XML fictício :file:`country_data.xml` como dados de exemplo para esta secção:
ru: Мы будем использовать вымышленный XML-документ :file:`country_data.xml` в качестве образца данных для этого раздела:

source: <?xml version="1.0"?> <data> <country name="Liechtenstein"> <rank>1</rank> <year>2008</year> <gdppc>141100</gdppc> <neighbor name="Austria" direction="E"/> <neighbor name="Switzerland" direction="W"/> </country> <country name="Singapore"> <rank>4</rank> <year>2011</year> <gdppc>59900</gdppc> <neighbor name="Malaysia" direction="N"/> </country> <country name="Panama"> <rank>68</rank> <year>2011</year> <gdppc>13600</gdppc> <neighbor name="Costa Rica" direction="W"/> <neighbor name="Colombia" direction="E"/> </country> </data>
pt_pt: <?xml version="1.0"?> <data> <country name="Liechtenstein"> <rank>1</rank> <year>2008</year> <gdppc>141100</gdppc> <neighbor name="Áustria" direction="E"/> <neighbor name="Suíça" direction="W"/> </country> <country name="Singapura"> <rank>4</rank> <year>2011</year> <gdppc>59900</gdppc> <neighbor name="Malásia" direction="N"/> </country> <country name="Panamá"> <rank>68</rank> <year>2011</year> <gdppc>13600</gdppc> <neighbor name="Costa Rica" direction="W"/> <neighbor name="Colômbia" direction="E"/> </country> </data>

source: We can import this data by reading from a file::
pt_pt: Podemos importar estes dados lendo de um ficheiro:
ru: Мы можем импортировать эти данные, прочитав из файла::

source: Or directly from a string::
pt_pt: Ou diretamente de uma string:
ru: Или напрямую из строки::

source: :func:`fromstring` parses XML from a string directly into an :class:`Element`, which is the root element of the parsed tree. Other parsing functions may create an :class:`ElementTree`. Check the documentation to be sure.
pt_pt: :func:`fromstring` analisa XML de uma string diretamente para um :class:`Element`, que é o elemento raiz da árvore analisada. Outras funções de análise podem criar um :class:`ElementTree`. Consulte a documentação para ter a certeza.
ru: :func:`fromstring` анализирует XML из строки непосредственно в :class:`Element`, который является корневым элементом анализируемого дерева. Другие функции синтаксического анализа могут создавать :class:`ElementTree`. Чтобы быть уверенным, проверьте документацию.

source: As an :class:`Element`, ``root`` has a tag and a dictionary of attributes::
pt_pt: Como um :class:`Element`, ``root`` tem uma etiqueta e um dicionário de atributos:
ru: Как :class:`Element`, ``root`` имеет тег и словарь атрибутов:

source: It also has children nodes over which we can iterate::
pt_pt: Também tem nós filhos sobre os quais podemos iterar:
ru: У него также есть дочерние узлы, по которым мы можем перебирать::

source: >>> for child in root: ... print(child.tag, child.attrib) ... country {'name': 'Liechtenstein'} country {'name': 'Singapore'} country {'name': 'Panama'}
pt_pt: >>> for child in root: ... print(child.tag, child.attrib) ... country {'name': 'Liechtenstein'} country {'name': 'Singapura'} country {'name': 'Panamá'}

source: Not all elements of the XML input will end up as elements of the parsed tree. Currently, this module skips over any XML comments, processing instructions, and document type declarations in the input. Nevertheless, trees built using this module's API rather than parsing from XML text can have comments and processing instructions in them; they will be included when generating XML output. A document type declaration may be accessed by passing a custom :class:`TreeBuilder` instance to the :class:`XMLParser` constructor.
pt_pt: Nem todos os elementos da entrada XML acabarão como elementos da árvore analisada. Atualmente, este módulo ignora quaisquer comentários XML, instruções de processamento e declarações de tipo de documento na entrada. No entanto, árvores construídas usando a API deste módulo em vez de analisar texto XML podem ter comentários e instruções de processamento; estes serão incluídos ao gerar saída XML. Uma declaração de tipo de documento pode ser acedida passando uma instância personalizada de :class:`TreeBuilder` para o construtor de :class:`XMLParser`.
ru: Не все элементы входных данных XML станут элементами анализируемого дерева. В настоящее время этот модуль пропускает любые комментарии XML, инструкции по обработке и объявления типов документов во входных данных. Тем не менее, деревья, построенные с использованием API этого модуля, а не путем анализа текста XML, могут содержать комментарии и инструкции по обработке; они будут включены при генерации вывода XML. Доступ к объявлению типа документа можно получить, передав пользовательский экземпляр :class:`TreeBuilder` в конструктор :class:`XMLParser`.

source: Pull API for non-blocking parsing
pt_pt: API Pull para análise não bloqueante
ru: Pull API для неблокирующего анализа

source: Most parsing functions provided by this module require the whole document to be read at once before returning any result. It is possible to use an :class:`XMLParser` and feed data into it incrementally, but it is a push API that calls methods on a callback target, which is too low-level and inconvenient for most needs. Sometimes what the user really wants is to be able to parse XML incrementally, without blocking operations, while enjoying the convenience of fully constructed :class:`Element` objects.
pt_pt: A maioria das funções de análise fornecidas por este módulo requer que todo o documento seja lido de uma vez antes de devolver qualquer resultado. É possível usar um :class:`XMLParser` e alimentá-lo com dados de forma incremental, mas é uma API push que chama métodos num alvo de callback, o que é demasiado de baixo nível e inconveniente para a maioria das necessidades. Às vezes, o que o utilizador realmente quer é ser capaz de analisar XML de forma incremental, sem operações bloqueantes, enquanto desfruta da conveniência de objetos :class:`Element` totalmente construídos.
ru: Большинство функций синтаксического анализа, предоставляемых этим модулем, требуют, чтобы весь документ был прочитан сразу, прежде чем возвращать какой-либо результат. Можно использовать :class:`XMLParser` и постепенно вводить в него данные, но это push-API, который вызывает методы для цели обратного вызова, что является слишком низкоуровневым и неудобным для большинства нужд. Иногда пользователю действительно хочется иметь возможность анализировать XML постепенно, без блокировки операций, наслаждаясь при этом удобством полностью сконструированных объектов :class:`Element`.

source: The most powerful tool for doing this is :class:`XMLPullParser`. It does not require a blocking read to obtain the XML data, and is instead fed with data incrementally with :meth:`XMLPullParser.feed` calls. To get the parsed XML elements, call :meth:`XMLPullParser.read_events`. Here is an example::
pt_pt: A ferramenta mais poderosa para fazer isto é :class:`XMLPullParser`. Não requer uma leitura bloqueante para obter os dados XML, e é alimentado com dados de forma incremental com chamadas a :meth:`XMLPullParser.feed`. Para obter os elementos XML analisados, chame :meth:`XMLPullParser.read_events`. Aqui está um exemplo:
ru: Самый мощный инструмент для этого — :class:`XMLPullParser`. Для получения данных XML не требуется блокирующее чтение, вместо этого данные передаются постепенно с помощью вызовов :meth:`XMLPullParser.feed`. Чтобы получить проанализированные элементы XML, вызовите :meth:`XMLPullParser.read_events`. Вот пример::

source: The obvious use case is applications that operate in a non-blocking fashion where the XML data is being received from a socket or read incrementally from some storage device. In such cases, blocking reads are unacceptable.
pt_pt: O caso de uso óbvio são aplicações que operam de forma não bloqueante, onde os dados XML estão a ser recebidos de um socket ou lidos de forma incremental de algum dispositivo de armazenamento. Nestes casos, leituras bloqueantes são inaceitáveis.
ru: Очевидный вариант использования — это приложения, которые работают неблокирующим образом, когда данные XML принимаются из сокета или поэтапно считываются с какого-либо устройства хранения. В таких случаях блокировка чтения недопустима.

source: Because it's so flexible, :class:`XMLPullParser` can be inconvenient to use for simpler use-cases. If you don't mind your application blocking on reading XML data but would still like to have incremental parsing capabilities, take a look at :func:`iterparse`. It can be useful when you're reading a large XML document and don't want to hold it wholly in memory.
pt_pt: Por ser tão flexível, :class:`XMLPullParser` pode ser inconveniente de usar para casos de uso mais simples. Se não se importar que a sua aplicação bloqueie ao ler dados XML, mas ainda assim gostaria de ter capacidades de análise incremental, dê uma vista de olhos a :func:`iterparse`. Pode ser útil quando está a ler um grande documento XML e não quer mantê-lo inteiramente na memória.
ru: Из-за своей гибкости :class:`XMLPullParser` может быть неудобно использовать в более простых случаях. Если вы не возражаете против блокировки вашего приложения при чтении XML-данных, но все же хотели бы иметь возможности поэтапного анализа, взгляните на :func:`iterparse`. Это может быть полезно, когда вы читаете большой XML-документ и не хотите хранить его целиком в памяти.

source: Where *immediate* feedback through events is wanted, calling method :meth:`XMLPullParser.flush` can help reduce delay; please make sure to study the related security notes.
pt_pt: Quando se deseja feedback *imediato* através de eventos, chamar o método :meth:`XMLPullParser.flush` pode ajudar a reduzir o atraso; certifique-se de estudar as notas de segurança relacionadas.
ru: Там, где требуется *немедленная* обратная связь через события, вызов метода :meth:`XMLPullParser.flush` может помочь уменьшить задержку; обязательно ознакомьтесь с соответствующими примечаниями по безопасности.

source: Finding interesting elements
pt_pt: Encontrar elementos interessantes
ru: Поиск интересных элементов

source: :class:`Element` has some useful methods that help iterate recursively over all the sub-tree below it (its children, their children, and so on). For example, :meth:`Element.iter`::
pt_pt: :class:`Element` tem alguns métodos úteis que ajudam a iterar recursivamente sobre toda a sub-árvore abaixo dele (os seus filhos, os filhos deles, e assim por diante). Por exemplo, :meth:`Element.iter`:
ru: :class:`Element` имеет несколько полезных методов, которые помогают рекурсивно перебирать все поддерево ниже него (его дочерние элементы, их дочерние элементы и т. д.). Например, :meth:`Element.iter`::

source: >>> for neighbor in root.iter('neighbor'): ... print(neighbor.attrib) ... {'name': 'Austria', 'direction': 'E'} {'name': 'Switzerland', 'direction': 'W'} {'name': 'Malaysia', 'direction': 'N'} {'name': 'Costa Rica', 'direction': 'W'} {'name': 'Colombia', 'direction': 'E'}
pt_pt: >>> for neighbor in root.iter('neighbor'): ... print(neighbor.attrib) ... {'name': 'Áustria', 'direction': 'E'} {'name': 'Suíça', 'direction': 'W'} {'name': 'Malásia', 'direction': 'N'} {'name': 'Costa Rica', 'direction': 'W'} {'name': 'Colômbia', 'direction': 'E'}

source: :meth:`Element.findall` finds only elements with a tag which are direct children of the current element. :meth:`Element.find` finds the *first* child with a particular tag, and :attr:`Element.text` accesses the element's text content. :meth:`Element.get` accesses the element's attributes::
pt_pt: :meth:`Element.findall` encontra apenas elementos com uma etiqueta que são filhos diretos do elemento atual. :meth:`Element.find` encontra o *primeiro* filho com uma etiqueta particular, e :attr:`Element.text` acede ao conteúdo de texto do elemento. :meth:`Element.get` acede aos atributos do elemento:
ru: :meth:`Element.findall` находит только элементы с тегом, которые являются прямыми дочерними элементами текущего элемента. :meth:`Element.find` находит *первый* дочерний элемент с определенным тегом, а :attr:`Element.text` получает доступ к текстовому содержимому элемента. :meth:`Element.get` получает доступ к атрибутам элемента::

source: >>> for country in root.findall('country'): ... rank = country.find('rank').text ... name = country.get('name') ... print(name, rank) ... Liechtenstein 1 Singapore 4 Panama 68
pt_pt: >>> for country in root.findall('country'): ... rank = country.find('rank').text ... name = country.get('name') ... print(name, rank) ... Liechtenstein 1 Singapura 4 Panamá 68

source: More sophisticated specification of which elements to look for is possible by using :ref:`XPath <elementtree-xpath>`.
pt_pt: Uma especificação mais sofisticada de quais elementos procurar é possível usando :ref:`XPath <elementtree-xpath>`.
ru: Более сложная спецификация того, какие элементы искать, возможна с помощью :ref:`XPath <elementtree-xpath>`.

source: Modifying an XML File
pt_pt: Modificar um ficheiro XML
ru: Изменение XML-файла

source: :class:`ElementTree` provides a simple way to build XML documents and write them to files. The :meth:`ElementTree.write` method serves this purpose.
pt_pt: :class:`ElementTree` fornece uma forma simples de construir documentos XML e escrevê-los em ficheiros. O método :meth:`ElementTree.write` serve este propósito.
ru: :class:`ElementTree` предоставляет простой способ создания XML-документов и записи их в файлы. Этой цели служит метод :meth:`ElementTree.write`.

source: Once created, an :class:`Element` object may be manipulated by directly changing its fields (such as :attr:`Element.text`), adding and modifying attributes (:meth:`Element.set` method), as well as adding new children (for example with :meth:`Element.append`).
pt_pt: Uma vez criado, um objeto :class:`Element` pode ser manipulado alterando diretamente os seus campos (como :attr:`Element.text`), adicionando e modificando atributos (método :meth:`Element.set`), bem como adicionando novos filhos (por exemplo, com :meth:`Element.append`).
ru: После создания объектом :class:`Element` можно манипулировать, напрямую изменяя его поля (например, :attr:`Element.text`), добавляя и изменяя атрибуты (метод :meth:`Element.set`), а также как добавление новых дочерних элементов (например, с помощью :meth:`Element.append`).

source: Let's say we want to add one to each country's rank, and add an ``updated`` attribute to the rank element::
pt_pt: Suponhamos que queremos adicionar um a cada classificação de país e adicionar um atributo ``updated`` ao elemento de classificação:
ru: Допустим, мы хотим добавить по одному к рейтингу каждой страны и добавить атрибут «обновлено» к элементу ранга:

source: Our XML now looks like this:
pt_pt: O nosso XML agora parece isto:
ru: Наш XML теперь выглядит так:

source: <?xml version="1.0"?> <data> <country name="Liechtenstein"> <rank updated="yes">2</rank> <year>2008</year> <gdppc>141100</gdppc> <neighbor name="Austria" direction="E"/> <neighbor name="Switzerland" direction="W"/> </country> <country name="Singapore"> <rank updated="yes">5</rank> <year>2011</year> <gdppc>59900</gdppc> <neighbor name="Malaysia" direction="N"/> </country> <country name="Panama"> <rank updated="yes">69</rank> <year>2011</year> <gdppc>13600</gdppc> <neighbor name="Costa Rica" direction="W"/> <neighbor name="Colombia" direction="E"/> </country> </data>
pt_pt: <?xml version="1.0"?> <data> <country name="Liechtenstein"> <rank updated="yes">2</rank> <year>2008</year> <gdppc>141100</gdppc> <neighbor name="Áustria" direction="E"/> <neighbor name="Suíça" direction="W"/> </country> <country name="Singapura"> <rank updated="yes">5</rank> <year>2011</year> <gdppc>59900</gdppc> <neighbor name="Malásia" direction="N"/> </country> <country name="Panamá"> <rank updated="yes">69</rank> <year>2011</year> <gdppc>13600</gdppc> <neighbor name="Costa Rica" direction="W"/> <neighbor name="Colômbia" direction="E"/> </country> </data>

source: We can remove elements using :meth:`Element.remove`. Let's say we want to remove all countries with a rank higher than 50::
pt_pt: Podemos remover elementos usando :meth:`Element.remove`. Suponhamos que queremos remover todos os países com uma classificação superior a 50:
ru: Мы можем удалять элементы, используя :meth:`Element.remove`. Допустим, мы хотим удалить все страны с рейтингом выше 50::

source: >>> for country in root.findall('country'): ... # using root.findall() to avoid removal during traversal ... rank = int(country.find('rank').text) ... if rank > 50: ... root.remove(country) ... >>> tree.write('output.xml')
pt_pt: >>> for country in root.findall('country'): ... # usando root.findall() para evitar remoção durante a travessia ... rank = int(country.find('rank').text) ... if rank > 50: ... root.remove(country) ... >>> tree.write('output.xml')

source: Note that concurrent modification while iterating can lead to problems, just like when iterating and modifying Python lists or dicts. Therefore, the example first collects all matching elements with ``root.findall()``, and only then iterates over the list of matches.
pt_pt: Note que a modificação concorrente durante a iteração pode levar a problemas, tal como ao iterar e modificar listas ou dicionários Python. Por isso, o exemplo primeiro recolhe todos os elementos correspondentes com ``root.findall()``, e só depois itera sobre a lista de correspondências.
ru: Обратите внимание, что одновременная модификация во время итерации может привести к проблемам, как и при итерации и изменении списков или диктов Python. Поэтому пример сначала собирает все совпадающие элементы с помощью root.findall() и только затем перебирает список совпадений.

source: <?xml version="1.0"?> <data> <country name="Liechtenstein"> <rank updated="yes">2</rank> <year>2008</year> <gdppc>141100</gdppc> <neighbor name="Austria" direction="E"/> <neighbor name="Switzerland" direction="W"/> </country> <country name="Singapore"> <rank updated="yes">5</rank> <year>2011</year> <gdppc>59900</gdppc> <neighbor name="Malaysia" direction="N"/> </country> </data>
pt_pt: <?xml version="1.0"?> <data> <country name="Liechtenstein"> <rank updated="yes">2</rank> <year>2008</year> <gdppc>141100</gdppc> <neighbor name="Áustria" direction="E"/> <neighbor name="Suíça" direction="W"/> </country> <country name="Singapura"> <rank updated="yes">5</rank> <year>2011</year> <gdppc>59900</gdppc> <neighbor name="Malásia" direction="N"/> </country> </data>

source: Building XML documents
pt_pt: Construir documentos XML
ru: Создание XML-документов

source: The :func:`SubElement` function also provides a convenient way to create new sub-elements for a given element::
pt_pt: A função :func:`SubElement` também fornece uma forma conveniente de criar novos sub-elementos para um elemento dado:
ru: Функция :func:`SubElement` также предоставляет удобный способ создания новых подэлементов для данного элемента:

source: Parsing XML with Namespaces
pt_pt: Analisar XML com Namespaces
ru: Анализ XML с помощью пространств имен

source: If the XML input has `namespaces <https://en.wikipedia.org/wiki/XML_namespace>`__, tags and attributes with prefixes in the form ``prefix:sometag`` get expanded to ``{uri}sometag`` where the *prefix* is replaced by the full *URI*. Also, if there is a `default namespace <https://www.w3.org/TR/xml-names/#defaulting>`__, that full URI gets prepended to all of the non-prefixed tags.
pt_pt: Se a entrada XML tiver `namespaces <https://en.wikipedia.org/wiki/XML_namespace>`__, etiquetas e atributos com prefixos na forma ``prefix:sometag`` são expandidos para ``{uri}sometag`` onde o *prefixo* é substituído pela *URI* completa. Além disso, se houver um `namespace predefinido <https://www.w3.org/TR/xml-names/#defaulting>`__, essa URI completa é pré-adicionada a todas as etiquetas não prefixadas.
ru: Если ввод XML имеет ``пространства имен <https://en.wikipedia.org/wiki/XML_namespace>`__, теги и атрибуты с префиксами в форме ``prefix:sometag`` расширяются до ``{uri}sometag` ` где *префикс* заменяется полным *URI*. Кроме того, если существует `пространство имен по умолчанию <https://www.w3.org/TR/xml-names/#defaulting>`__, этот полный URI добавляется ко всем тегам без префиксов.
