Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.etree.elementtree.po
Languages: pt_pt, ru

source: Parses an XML section into an element tree incrementally, and reports what's going on to the user. *source* is a filename or :term:`file object` containing XML data. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. *parser* must be a subclass of :class:`XMLParser` and can only use the default :class:`TreeBuilder` as a target. Returns an :term:`iterator` providing ``(event, elem)`` pairs; it has a ``root`` attribute that references the root element of the resulting XML tree once *source* is fully read. The iterator has the :meth:`!close` method that closes the internal file object if *source* is a filename.
pt_pt: Analisa uma secção XML numa árvore de elementos de forma incremental e relata o que está a acontecer ao utilizador. *source* é um nome de ficheiro ou um :term:`objeto de ficheiro` contendo dados XML. *events* é uma sequência de eventos a relatar. Os eventos suportados são as strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` e ``"end-ns"`` (os eventos "ns" são usados para obter informações detalhadas de namespace). Se *events* for omitido, apenas os eventos ``"end"`` são relatados. *parser* é uma instância de analisador opcional. Se não for fornecida, é usado o analisador padrão :class:`XMLParser`. *parser* deve ser uma subclasse de :class:`XMLParser` e só pode usar o :class:`TreeBuilder` predefinido como alvo. Devolve um :term:`iterador` que fornece pares ``(event, elem)``; tem um atributo ``root`` que referencia o elemento raiz da árvore XML resultante assim que *source* for completamente lido. O iterador tem o método :meth:`!close` que fecha o objeto de ficheiro interno se *source* for um nome de ficheiro.

source: Note that while :func:`iterparse` builds the tree incrementally, it issues blocking reads on *source* (or the file it names). As such, it's unsuitable for applications where blocking reads can't be made. For fully non-blocking parsing, see :class:`XMLPullParser`.
pt_pt: Note que, embora :func:`iterparse` construa a árvore de forma incremental, emite leituras bloqueantes em *source* (ou no ficheiro que nomeia). Como tal, não é adequado para aplicações onde não podem ser feitas leituras bloqueantes. Para análise completamente não bloqueante, consulte :class:`XMLPullParser`.
ru: Обратите внимание, что хотя :func:`iterparse` строит дерево постепенно, он блокирует чтение *source* (или файла, который он называет). Таким образом, он не подходит для приложений, в которых невозможно выполнить блокирующее чтение. Для полного неблокирующего анализа см. :class:`XMLPullParser`.

source: :func:`iterparse` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
pt_pt: :func:`iterparse` garante apenas que viu o carácter ">" de uma etiqueta de início quando emite um evento "start", por isso os atributos estão definidos, mas o conteúdo dos atributos de texto e cauda estão indefinidos nesse ponto. O mesmo se aplica aos filhos do elemento; podem ou não estar presentes.
ru: :func:`iterparse` гарантирует, что он увидел символ ">" начального тега только тогда, когда генерирует событие "start", поэтому атрибуты определены, но содержимое атрибутов text и Tail в этот момент не определено. . То же самое относится и к дочерним элементам; они могут присутствовать, а могут и не присутствовать.

source: If you need a fully populated element, look for "end" events instead.
pt_pt: Se precisar de um elemento completamente preenchido, procure eventos "end" em vez disso.
ru: Если вам нужен полностью заполненный элемент, вместо этого ищите «конечные» события.

source: The *parser* argument.
pt_pt: O argumento *parser*.
ru: Аргумент *parser*.

source: The ``comment`` and ``pi`` events were added.
pt_pt: Os eventos ``comment`` e ``pi`` foram adicionados.
ru: Были добавлены события ``comment`` и ``pi``.

source: Added the :meth:`!close` method.
pt_pt: Adicionado o método :meth:`!close`.

source: PI element factory. This factory function creates a special element that will be serialized as an XML processing instruction. *target* is a string containing the PI target. *text* is a string containing the PI contents, if given. Returns an element instance, representing a processing instruction.
pt_pt: Fábrica de elementos PI. Esta função de fábrica cria um elemento especial que será serializado como uma instrução de processamento XML. *target* é uma string contendo o alvo da PI. *text* é uma string contendo o conteúdo da PI, se fornecido. Devolve uma instância de elemento, representando uma instrução de processamento.
ru: Фабрика элементов ПИ. Эта фабричная функция создает специальный элемент, который будет сериализован как инструкция обработки XML. *target* — строка, содержащая цель PI. *текст* — это строка, содержащая содержимое PI, если оно указано. Возвращает экземпляр элемента, представляющий инструкцию обработки.

source: Note that :class:`XMLParser` skips over processing instructions in the input instead of creating PI objects for them. An :class:`ElementTree` will only contain processing instruction nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
pt_pt: Note que :class:`XMLParser` ignora instruções de processamento na entrada em vez de criar objetos PI para elas. Uma :class:`ElementTree` só conterá nós de instruções de processamento se estes tiverem sido inseridos na árvore usando um dos métodos de :class:`Element`.
ru: Обратите внимание, что :class:`XMLParser` пропускает инструкции обработки во входных данных вместо создания для них объектов PI. :class:`ElementTree` будет содержать узлы инструкций обработки только в том случае, если они были вставлены в дерево с помощью одного из :class:`Element` методов.

source: Registers a namespace prefix. The registry is global, and any existing mapping for either the given prefix or the namespace URI will be removed. *prefix* is a namespace prefix. *uri* is a namespace uri. Tags and attributes in this namespace will be serialized with the given prefix, if at all possible.
pt_pt: Regista um prefixo de namespace. O registo é global, e qualquer mapeamento existente para o prefixo dado ou o URI do namespace será removido. *prefix* é um prefixo de namespace. *uri* é um URI de namespace. Etiquetas e atributos neste namespace serão serializados com o prefixo dado, se possível.
ru: Регистрирует префикс пространства имен. Реестр является глобальным, и все существующие сопоставления для данного префикса или URI пространства имен будут удалены. *prefix* — префикс пространства имен. *uri* — это пространство имен uri. Теги и атрибуты в этом пространстве имен будут сериализованы с заданным префиксом, если это вообще возможно.

source: Subelement factory. This function creates an element instance, and appends it to an existing element.
pt_pt: Fábrica de sub-elementos. Esta função cria uma instância de elemento e adiciona-a a um elemento existente.
ru: Завод субэлементов. Эта функция создает экземпляр элемента и добавляет его к существующему элементу.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *parent* is the parent element. *tag* is the subelement name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments. Returns an element instance.
pt_pt: O nome do elemento, os nomes dos atributos e os valores dos atributos podem ser strings de bytes ou strings Unicode. *parent* é o elemento pai. *tag* é o nome do sub-elemento. *attrib* é um dicionário opcional, contendo atributos do elemento. *extra* contém atributos adicionais, dados como argumentos de palavra-chave. Devolve uma instância de elemento.
ru: Имя элемента, имена атрибутов и значения атрибутов могут быть либо байтовыми строками, либо строками Юникода. *parent* — родительский элемент. *tag* — имя подэлемента. *attrib* — необязательный словарь, содержащий атрибуты элементов. *extra* содержит дополнительные атрибуты, заданные в качестве аргументов ключевого слова. Возвращает экземпляр элемента.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns an (optionally) encoded string containing the XML data.
pt_pt: Gera uma representação em string de um elemento XML, incluindo todos os sub-elementos. *element* é uma instância de :class:`Element`. *encoding* [1]_ é a codificação de saída (predefinição é US-ASCII). Use ``encoding="unicode"`` para gerar uma string Unicode (caso contrário, é gerada uma string de bytes). *method* é ``"xml"``, ``"html"`` ou ``"text"`` (predefinição é ``"xml"``). *xml_declaration*, *default_namespace* e *short_empty_elements* têm o mesmo significado que em :meth:`ElementTree.write`. Devolve uma string (opcionalmente) codificada contendo os dados XML.
ru: Создает строковое представление элемента XML, включая все подэлементы. *element* — это экземпляр :class:`Element`. *кодировка* [1]_ — выходная кодировка (по умолчанию — US-ASCII). Используйте ``encoding="unicode"`` для генерации строки Unicode (в противном случае генерируется байтовая строка). *метод* — это ``"xml"``, ``"html"`` или ``"text"`` (по умолчанию ``"xml"``). *xml_declaration*, *default_namespace* и *short_empty_elements* имеют то же значение, что и в :meth:`ElementTree.write`. Возвращает (необязательно) закодированную строку, содержащую данные XML.

source: Added the *short_empty_elements* parameter.
pt_pt: Adicionado o parâmetro *short_empty_elements*.
ru: Добавлен параметр *short_empty_elements*.

source: Added the *xml_declaration* and *default_namespace* parameters.
pt_pt: Adicionados os parâmetros *xml_declaration* e *default_namespace*.
ru: Добавлены параметры *xml_declaration* и *default_namespace*.

source: The :func:`tostring` function now preserves the attribute order specified by the user.
pt_pt: A função :func:`tostring` agora preserva a ordem dos atributos especificada pelo utilizador.
ru: Функция :func:`tostring` теперь сохраняет порядок атрибутов, указанный пользователем.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns a list of (optionally) encoded strings containing the XML data. It does not guarantee any specific sequence, except that ``b"".join(tostringlist(element)) == tostring(element)``.
pt_pt: Gera uma representação em string de um elemento XML, incluindo todos os sub-elementos. *element* é uma instância de :class:`Element`. *encoding* [1]_ é a codificação de saída (predefinição é US-ASCII). Use ``encoding="unicode"`` para gerar uma string Unicode (caso contrário, é gerada uma string de bytes). *method* é ``"xml"``, ``"html"`` ou ``"text"`` (predefinição é ``"xml"``). *xml_declaration*, *default_namespace* e *short_empty_elements* têm o mesmo significado que em :meth:`ElementTree.write`. Devolve uma lista de strings (opcionalmente) codificadas contendo os dados XML. Não garante nenhuma sequência específica, exceto que ``b"".join(tostringlist(element)) == tostring(element)``.
ru: Создает строковое представление элемента XML, включая все подэлементы. *element* — это экземпляр :class:`Element`. *кодировка* [1]_ — выходная кодировка (по умолчанию — US-ASCII). Используйте ``encoding="unicode"`` для генерации строки Unicode (в противном случае генерируется байтовая строка). *метод* — это ``"xml"``, ``"html"`` или ``"text"`` (по умолчанию ``"xml"``). *xml_declaration*, *default_namespace* и *short_empty_elements* имеют то же значение, что и в :meth:`ElementTree.write`. Возвращает список (необязательно) закодированных строк, содержащих данные XML. Он не гарантирует какой-либо конкретной последовательности, за исключением того, что ``b"".join(tostringlist(element)) == tostring(element)``.

source: The :func:`tostringlist` function now preserves the attribute order specified by the user.
pt_pt: A função :func:`tostringlist` agora preserva a ordem dos atributos especificada pelo utilizador.
ru: Функция :func:`tostringlist` теперь сохраняет порядок атрибутов, указанный пользователем.

source: Parses an XML section from a string constant. This function can be used to embed "XML literals" in Python code. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
pt_pt: Analisa uma secção XML a partir de uma constante de string. Esta função pode ser usada para incorporar "literais XML" em código Python. *text* é uma string contendo dados XML. *parser* é uma instância de analisador opcional. Se não for fornecida, é usado o analisador padrão :class:`XMLParser`. Devolve uma instância de :class:`Element`.
ru: Анализирует раздел XML из строковой константы. Эту функцию можно использовать для встраивания «литералов XML» в код Python. *текст* — это строка, содержащая данные XML. *parser* — необязательный экземпляр синтаксического анализатора. Если не указано, используется стандартный парсер :class:`XMLParser`. Возвращает экземпляр :class:`Element`.

source: Parses an XML section from a string constant, and also returns a dictionary which maps from element id:s to elements. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns a tuple containing an :class:`Element` instance and a dictionary.
pt_pt: Analisa uma secção XML a partir de uma constante de string e também devolve um dicionário que mapeia IDs de elementos para elementos. *text* é uma string contendo dados XML. *parser* é uma instância de analisador opcional. Se não for fornecida, é usado o analisador padrão :class:`XMLParser`. Devolve um tuplo contendo uma instância de :class:`Element` e um dicionário.
ru: Анализирует раздел XML из строковой константы, а также возвращает словарь, который сопоставляет идентификаторы элементов с элементами. *текст* — это строка, содержащая данные XML. *parser* — необязательный экземпляр синтаксического анализатора. Если не указано, используется стандартный парсер :class:`XMLParser`. Возвращает кортеж, содержащий экземпляр :class:`Element` и словарь.

source: XInclude support
pt_pt: Suporte XInclude
ru: Поддержка XInclude

source: This module provides limited support for `XInclude directives <https://www.w3.org/TR/xinclude/>`_, via the :mod:`xml.etree.ElementInclude` helper module. This module can be used to insert subtrees and text strings into element trees, based on information in the tree.
pt_pt: Este módulo fornece suporte limitado para `diretivas XInclude <https://www.w3.org/TR/xinclude/>`_, através do módulo auxiliar :mod:`xml.etree.ElementInclude`. Este módulo pode ser usado para inserir sub-árvores e strings de texto em árvores de elementos, com base em informações na árvore.
ru: Этот модуль обеспечивает ограниченную поддержку директив XInclude <https://www.w3.org/TR/xinclude/>`_ через вспомогательный модуль :mod:`xml.etree.ElementInclude`. Этот модуль можно использовать для вставки поддеревьев и текстовых строк в деревья элементов на основе информации в дереве.

source: Here's an example that demonstrates use of the XInclude module. To include an XML document in the current document, use the ``{http://www.w3.org/2001/XInclude}include`` element and set the **parse** attribute to ``"xml"``, and use the **href** attribute to specify the document to include.
pt_pt: Aqui está um exemplo que demonstra o uso do módulo XInclude. Para incluir um documento XML no documento atual, use o elemento ``{http://www.w3.org/2001/XInclude}include`` e defina o atributo **parse** para ``"xml"``, e use o atributo **href** para especificar o documento a incluir.
ru: Вот пример, демонстрирующий использование модуля XInclude. Чтобы включить XML-документ в текущий документ, используйте элемент ``{http://www.w3.org/2001/XInclude}include`` и установите для атрибута **parse** значение ``"xml"``. и используйте атрибут **href**, чтобы указать включаемый документ.

source: By default, the **href** attribute is treated as a file name. You can use custom loaders to override this behaviour. Also note that the standard helper does not support XPointer syntax.
pt_pt: Por predefinição, o atributo **href** é tratado como um nome de ficheiro. Pode usar carregadores personalizados para substituir este comportamento. Note também que o auxiliar padrão não suporta a sintaxe XPointer.
ru: По умолчанию атрибут **href** рассматривается как имя файла. Вы можете использовать специальные загрузчики, чтобы переопределить это поведение. Также обратите внимание, что стандартный помощник не поддерживает синтаксис XPointer.

source: To process this file, load it as usual, and pass the root element to the :mod:`xml.etree.ElementTree` module:
pt_pt: Para processar este ficheiro, carregue-o como habitual e passe o elemento raiz para o módulo :mod:`xml.etree.ElementTree`:
ru: Чтобы обработать этот файл, загрузите его как обычно и передайте корневой элемент модулю :mod:`xml.etree.ElementTree`:

source: The ElementInclude module replaces the ``{http://www.w3.org/2001/XInclude}include`` element with the root element from the **source.xml** document. The result might look something like this:
pt_pt: O módulo ElementInclude substitui o elemento ``{http://www.w3.org/2001/XInclude}include`` pelo elemento raiz do documento **source.xml**. O resultado pode parecer algo como isto:
ru: Модуль ElementInclude заменяет элемент ``{http://www.w3.org/2001/XInclude}include`` корневым элементом из документа **source.xml**. Результат может выглядеть примерно так:

source: <document xmlns:xi="http://www.w3.org/2001/XInclude"> <para>This is a paragraph.</para> </document>
pt_pt: <document xmlns:xi="http://www.w3.org/2001/XInclude"> <para>Este é um parágrafo.</para> </document>

source: If the **parse** attribute is omitted, it defaults to "xml". The href attribute is required.
pt_pt: Se o atributo **parse** for omitido, o valor predefinido é "xml". O atributo href é obrigatório.
ru: Если атрибут **parse** опущен, по умолчанию используется значение «xml». Атрибут href является обязательным.

source: To include a text document, use the ``{http://www.w3.org/2001/XInclude}include`` element, and set the **parse** attribute to "text":
pt_pt: Para incluir um documento de texto, use o elemento ``{http://www.w3.org/2001/XInclude}include`` e defina o atributo **parse** para "text":
ru: Чтобы включить текстовый документ, используйте элемент ``{http://www.w3.org/2001/XInclude}include`` и установите для атрибута **parse** значение "text":

source: The result might look something like:
pt_pt: O resultado pode parecer algo como:
ru: Результат может выглядеть примерно так:

source: Default loader. This default loader reads an included resource from disk. *href* is a URL. *parse* is for parse mode either "xml" or "text". *encoding* is an optional text encoding. If not given, encoding is ``utf-8``. Returns the expanded resource. If the parse mode is ``"xml"``, this is an :class:`~xml.etree.ElementTree.Element` instance. If the parse mode is ``"text"``, this is a string. If the loader fails, it can return ``None`` or raise an exception.
pt_pt: Carregador predefinido. Este carregador predefinido lê um recurso incluído a partir do disco. *href* é um URL. *parse* é para o modo de análise, "xml" ou "text". *encoding* é uma codificação de texto opcional. Se não for fornecida, a codificação é ``utf-8``. Devolve o recurso expandido. Se o modo de análise for ``"xml"``, isto é uma instância de :class:`~xml.etree.ElementTree.Element`. Se o modo de análise for ``"text"``, isto é uma string. Se o carregador falhar, pode devolver ``None`` ou levantar uma exceção.

source: This function expands XInclude directives in-place in tree pointed by *elem*. *elem* is either the root :class:`~xml.etree.ElementTree.Element` or an :class:`~xml.etree.ElementTree.ElementTree` instance to find such element. *loader* is an optional resource loader. If omitted, it defaults to :func:`default_loader`. If given, it should be a callable that implements the same interface as :func:`default_loader`. *base_url* is base URL of the original file, to resolve relative include file references. *max_depth* is the maximum number of recursive inclusions. Limited to reduce the risk of malicious content explosion. Pass ``None`` to disable the limitation.
pt_pt: Esta função expande diretivas XInclude no local na árvore apontada por *elem*. *elem* é ou o elemento raiz :class:`~xml.etree.ElementTree.Element` ou uma instância de :class:`~xml.etree.ElementTree.ElementTree` para encontrar tal elemento. *loader* é um carregador de recursos opcional. Se omitido, o predefinido é :func:`default_loader`. Se fornecido, deve ser um objeto chamável que implementa a mesma interface que :func:`default_loader`. *base_url* é o URL base do ficheiro original, para resolver referências de ficheiros incluídos relativos. *max_depth* é o número máximo de inclusões recursivas. Limitado para reduzir o risco de explosão de conteúdo malicioso. Passe ``None`` para desativar a limitação.

source: Added the *base_url* and *max_depth* parameters.
pt_pt: Adicionados os parâmetros *base_url* e *max_depth*.
ru: Добавлены параметры *base_url* и ​​*max_length*.

source: Element Objects
pt_pt: Objetos Element
ru: Объекты элементов

source: Element class. This class defines the Element interface, and provides a reference implementation of this interface.
pt_pt: Classe Element. Esta classe define a interface Element e fornece uma implementação de referência desta interface.
ru: Класс элемента. Этот класс определяет интерфейс Element и предоставляет эталонную реализацию этого интерфейса.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *tag* is the element name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments.
pt_pt: O nome do elemento, os nomes dos atributos e os valores dos atributos podem ser strings de bytes ou strings Unicode. *tag* é o nome do elemento. *attrib* é um dicionário opcional, contendo atributos do elemento. *extra* contém atributos adicionais, dados como argumentos de palavra-chave.
ru: Имя элемента, имена атрибутов и значения атрибутов могут быть либо байтовыми строками, либо строками Юникода. *tag* — имя элемента. *attrib* — необязательный словарь, содержащий атрибуты элементов. *extra* содержит дополнительные атрибуты, заданные в качестве аргументов ключевого слова.
