Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.etree.elementtree.po
Languages: pt_pt, ru

source: Here is an XML example that incorporates two namespaces, one with the prefix "fictional" and the other serving as the default namespace:
pt_pt: Aqui está um exemplo XML que incorpora dois namespaces, um com o prefixo "fictional" e o outro servindo como o namespace predefinido:
ru: Вот пример XML, который включает в себя два пространства имен: одно с префиксом «вымышленный», а другое служит пространством имен по умолчанию:

source: One way to search and explore this XML example is to manually add the URI to every tag or attribute in the xpath of a :meth:`~Element.find` or :meth:`~Element.findall`::
pt_pt: Uma forma de procurar e explorar este exemplo XML é adicionar manualmente a URI a cada etiqueta ou atributo no xpath de um :meth:`~Element.find` ou :meth:`~Element.findall`:
ru: Один из способов поиска и изучения этого примера XML — вручную добавить URI к каждому тегу или атрибуту в xpath :meth:`~Element.find` или :meth:`~Element.findall`::

source: A better way to search the namespaced XML example is to create a dictionary with your own prefixes and use those in the search functions::
pt_pt: Uma melhor forma de procurar no exemplo XML com namespaces é criar um dicionário com os seus próprios prefixos e usá-los nas funções de pesquisa:
ru: Лучший способ поиска в примере XML с пространством имен — создать словарь с собственными префиксами и использовать их в функциях поиска:

source: These two approaches both output::
pt_pt: Estas duas abordagens produzem a seguinte saída:
ru: Эти два подхода оба выводят::

source: XPath support
pt_pt: Suporte XPath
ru: Поддержка XPath

source: This module provides limited support for `XPath expressions <https://www.w3.org/TR/xpath>`_ for locating elements in a tree. The goal is to support a small subset of the abbreviated syntax; a full XPath engine is outside the scope of the module.
pt_pt: Este módulo fornece suporte limitado para `expressões XPath <https://www.w3.org/TR/xpath>`_ para localizar elementos numa árvore. O objetivo é suportar um pequeno subconjunto da sintaxe abreviada; um motor XPath completo está fora do âmbito deste módulo.
ru: Этот модуль обеспечивает ограниченную поддержку `выражений XPath <https://www.w3.org/TR/xpath>`_ для поиска элементов в дереве. Целью является поддержка небольшого подмножества сокращенного синтаксиса; полный механизм XPath выходит за рамки модуля.

source: Example
pt_pt: Exemplo
ru: Пример

source: Here's an example that demonstrates some of the XPath capabilities of the module. We'll be using the ``countrydata`` XML document from the :ref:`Parsing XML <elementtree-parsing-xml>` section::
pt_pt: Aqui está um exemplo que demonstra algumas das capacidades XPath do módulo. Vamos usar o documento XML ``countrydata`` da secção :ref:`Analisar XML <elementtree-parsing-xml>`:
ru: Вот пример, демонстрирующий некоторые возможности XPath модуля. Мы будем использовать XML-документ ``countrydata`` из раздела :ref:`Разбор XML <elementtree-parsing-xml>`::

source: import xml.etree.ElementTree as ET root = ET.fromstring(countrydata) # Top-level elements root.findall(".") # All 'neighbor' grand-children of 'country' children of the top-level # elements root.findall("./country/neighbor") # Nodes with name='Singapore' that have a 'year' child root.findall(".//year/..[@name='Singapore']") # 'year' nodes that are children of nodes with name='Singapore' root.findall(".//*[@name='Singapore']/year") # All 'neighbor' nodes that are the second child of their parent root.findall(".//neighbor[2]")
pt_pt: import xml.etree.ElementTree as ET root = ET.fromstring(countrydata) # Elementos de nível superior root.findall(".") # Todos os 'neighbor' netos de 'country' filhos dos elementos de nível superior root.findall("./country/neighbor") # Nós com name='Singapore' que têm um filho 'year' root.findall(".//year/..[@name='Singapore']") # Nós 'year' que são filhos de nós com name='Singapore' root.findall(".//*[@name='Singapore']/year") # Todos os nós 'neighbor' que são o segundo filho do seu pai root.findall(".//neighbor[2]")

source: For XML with namespaces, use the usual qualified ``{namespace}tag`` notation::
pt_pt: Para XML com namespaces, use a notação qualificada habitual ``{namespace}tag``:
ru: Для XML с пространствами имен используйте обычную квалифицированную нотацию ``{namespace}tag``::

source: # All dublin-core "title" tags in the document root.findall(".//{http://purl.org/dc/elements/1.1/}title")
pt_pt: # Todas as etiquetas "title" dublin-core no documento root.findall(".//{http://purl.org/dc/elements/1.1/}title")

source: Supported XPath syntax
pt_pt: Sintaxe XPath suportada
ru: Поддерживаемый синтаксис XPath

source: Syntax
pt_pt: Sintaxe
ru: Синтаксис

source: Meaning
pt_pt: Significado
ru: Значение

source: Selects all child elements with the given tag. For example, ``spam`` selects all child elements named ``spam``, and ``spam/egg`` selects all grandchildren named ``egg`` in all children named ``spam``. ``{namespace}*`` selects all tags in the given namespace, ``{*}spam`` selects tags named ``spam`` in any (or no) namespace, and ``{}*`` only selects tags that are not in a namespace.
pt_pt: Selecciona todos os elementos filhos com a etiqueta dada. Por exemplo, ``spam`` selecciona todos os elementos filhos chamados ``spam``, e ``spam/egg`` selecciona todos os netos chamados ``egg`` em todos os filhos chamados ``spam``. ``{namespace}*`` selecciona todas as etiquetas no namespace dado, ``{*}spam`` selecciona etiquetas chamadas ``spam`` em qualquer (ou nenhum) namespace, e ``{}*`` selecciona apenas etiquetas que não estão num namespace.
ru: Выбирает все дочерние элементы с данным тегом. Например, ``spam`` выбирает все дочерние элементы с именем ``spam``, а ``spam/egg`` выбирает всех дочерних элементов с именем ``egg`` во всех дочерних элементах с именем ``spam``. ``{namespace}*`` выбирает все теги в заданном пространстве имен, ``{*}spam`` выбирает теги с именем ``spam`` в любом пространстве имен (или без него), а ``{}*`` выбирает только теги, которые не находятся в пространстве имен.

source: Support for star-wildcards was added.
pt_pt: Foi adicionado suporte para curingas de asterisco.
ru: Была добавлена ​​поддержка звездочек.

source: Selects all child elements, including comments and processing instructions. For example, ``*/egg`` selects all grandchildren named ``egg``.
pt_pt: Selecciona todos os elementos filhos, incluindo comentários e instruções de processamento. Por exemplo, ``*/egg`` selecciona todos os netos chamados ``egg``.
ru: Выбирает все дочерние элементы, включая комментарии и инструкции по обработке. Например, ``*/egg`` выбирает всех внуков с именем ``egg``.

source: Selects the current node. This is mostly useful at the beginning of the path, to indicate that it's a relative path.
pt_pt: Selecciona o nó atual. Isto é maioritariamente útil no início do caminho, para indicar que é um caminho relativo.
ru: Выбирает текущий узел. Чаще всего это полезно в начале пути, чтобы указать, что это относительный путь.

source: Selects all subelements, on all levels beneath the current element. For example, ``.//egg`` selects all ``egg`` elements in the entire tree.
pt_pt: Selecciona todos os sub-elementos, em todos os níveis abaixo do elemento atual. Por exemplo, ``.//egg`` selecciona todos os elementos ``egg`` em toda a árvore.
ru: Выбирает все подэлементы на всех уровнях ниже текущего элемента. Например, ``.//egg`` выбирает все элементы ``egg`` во всем дереве.

source: Selects the parent element. Returns ``None`` if the path attempts to reach the ancestors of the start element (the element ``find`` was called on).
pt_pt: Selecciona o elemento pai. Devolve ``None`` se o caminho tentar atingir os antepassados do elemento inicial (o elemento em que ``find`` foi chamado).
ru: Выбирает родительский элемент. Возвращает None, если путь пытается достичь предков начального элемента (был вызван элемент find).

source: Selects all elements that have the given attribute.
pt_pt: Selecciona todos os elementos que têm o atributo dado.
ru: Выбирает все элементы, имеющие данный атрибут.

source: Selects all elements for which the given attribute has the given value. The value cannot contain quotes.
pt_pt: Selecciona todos os elementos para os quais o atributo dado tem o valor dado. O valor não pode conter aspas.
ru: Выбирает все элементы, для которых данный атрибут имеет заданное значение. Значение не может содержать кавычки.

source: Selects all elements for which the given attribute does not have the given value. The value cannot contain quotes.
pt_pt: Selecciona todos os elementos para os quais o atributo dado não tem o valor dado. O valor não pode conter aspas.
ru: Выбирает все элементы, для которых данный атрибут не имеет заданного значения. Значение не может содержать кавычки.

source: Selects all elements that have a child named ``tag``. Only immediate children are supported.
pt_pt: Selecciona todos os elementos que têm um filho chamado ``tag``. Apenas filhos imediatos são suportados.
ru: Выбирает все элементы, у которых есть дочерний элемент с именем «tag». Поддерживаются только непосредственные дети.

source: Selects all elements whose complete text content, including descendants, equals the given ``text``.
pt_pt: Selecciona todos os elementos cujo conteúdo de texto completo, incluindo descendentes, é igual ao ``text`` dado.
ru: Выбирает все элементы, полное текстовое содержимое которых, включая потомков, равно заданному ``тексту``.

source: Selects all elements whose complete text content, including descendants, does not equal the given ``text``.
pt_pt: Selecciona todos os elementos cujo conteúdo de texto completo, incluindo descendentes, não é igual ao ``text`` dado.
ru: Выбирает все элементы, полное текстовое содержимое которых, включая потомков, не соответствует заданному ``тексту``.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, equals the given ``text``.
pt_pt: Selecciona todos os elementos que têm um filho chamado ``tag`` cujo conteúdo de texto completo, incluindo descendentes, é igual ao ``text`` dado.
ru: Выбирает все элементы, у которых есть дочерний элемент с именем «tag», полное текстовое содержимое которого, включая потомков, равно заданному «тексту».

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, does not equal the given ``text``.
pt_pt: Selecciona todos os elementos que têm um filho chamado ``tag`` cujo conteúdo de texto completo, incluindo descendentes, não é igual ao ``text`` dado.
ru: Выбирает все элементы, у которых есть дочерний элемент с именем «tag», полное текстовое содержимое которого, включая потомков, не соответствует заданному «тексту».

source: Selects all elements that are located at the given position. The position can be either an integer (1 is the first position), the expression ``last()`` (for the last position), or a position relative to the last position (e.g. ``last()-1``).
pt_pt: Selecciona todos os elementos que estão localizados na posição dada. A posição pode ser um inteiro (1 é a primeira posição), a expressão ``last()`` (para a última posição), ou uma posição relativa à última posição (por exemplo, ``last()-1``).
ru: Выбирает все элементы, расположенные в заданной позиции. Позиция может быть либо целым числом (1 – первая позиция), выражением ``last()`` (для последней позиции) или позицией относительно последней позиции (например, ``last()-1``. ).

source: Predicates (expressions within square brackets) must be preceded by a tag name, an asterisk, or another predicate. ``position`` predicates must be preceded by a tag name.
pt_pt: Os predicados (expressões dentro de parênteses retos) devem ser precedidos por um nome de etiqueta, um asterisco, ou outro predicado. Os predicados de ``position`` devem ser precedidos por um nome de etiqueta.
ru: Предикатам (выражениям в квадратных скобках) должно предшествовать имя тега, звездочка или другой предикат. Предикату ``position`` должно предшествовать имя тега.

source: Reference
pt_pt: Referência
ru: Ссылка

source: Functions
pt_pt: Funções
ru: Функции

source: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ transformation function.
pt_pt: Função de transformação `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_.
ru: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ функция преобразования.

source: Canonicalization is a way to normalise XML output in a way that allows byte-by-byte comparisons and digital signatures. It reduces the freedom that XML serializers have and instead generates a more constrained XML representation. The main restrictions regard the placement of namespace declarations, the ordering of attributes, and ignorable whitespace.
pt_pt: A canonização é uma forma de normalizar a saída XML de uma forma que permite comparações byte-a-byte e assinaturas digitais. Reduz a liberdade que os serializadores XML têm e, em vez disso, gera uma representação XML mais restrita. As principais restrições dizem respeito ao posicionamento das declarações de namespace, à ordenação dos atributos e aos espaços em branco ignoráveis.

source: This function takes an XML data string (*xml_data*) or a file path or file-like object (*from_file*) as input, converts it to the canonical form, and writes it out using the *out* file(-like) object, if provided, or returns it as a text string if not. The output file receives text, not bytes. It should therefore be opened in text mode with ``utf-8`` encoding.
pt_pt: Esta função recebe uma string de dados XML (*xml_data*) ou um caminho de ficheiro ou objeto tipo ficheiro (*from_file*) como entrada, converte-o para a forma canónica, e escreve-o usando o objeto *out* tipo ficheiro, se fornecido, ou devolve-o como uma string de texto se não. O ficheiro de saída recebe texto, não bytes. Deve, portanto, ser aberto em modo de texto com codificação ``utf-8``.
ru: Эта функция принимает строку данных XML (*xml_data*) или путь к файлу или файлоподобный объект (*from_file*) в качестве входных данных, преобразует ее в каноническую форму и записывает ее с использованием *out* file(-like) объект, если он предоставлен, или возвращает его в виде текстовой строки, если нет. Выходной файл получает текст, а не байты. Поэтому его следует открывать в текстовом режиме с кодировкой «utf-8».

source: Typical uses::
pt_pt: Usos típicos:
ru: Типичное применение::

source: The configuration *options* are as follows:
pt_pt: As opções de configuração são as seguintes:
ru: *options* конфигурации следующие:

source: *with_comments*: set to true to include comments (default: false)
pt_pt: *with_comments*: defina como verdadeiro para incluir comentários (predefinição: falso)
ru: *with_comments*: установите значение true, чтобы включать комментарии (по умолчанию: false)

source: *strip_text*: set to true to strip whitespace before and after text content
pt_pt: *strip_text*: defina como verdadeiro para remover espaços em branco antes e depois do conteúdo de texto
ru: *strip_text*: установите значение true, чтобы удалить пробелы до и после текстового содержимого.

source: (default: false)
pt_pt: (predefinição: falso)
ru: (по умолчанию: ложь)

source: *rewrite_prefixes*: set to true to replace namespace prefixes by "n{number}"
pt_pt: *rewrite_prefixes*: defina como verdadeiro para substituir prefixos de namespace por "n{number}"
ru: *rewrite_prefixes*: установите значение true, чтобы заменить префиксы пространства имен на «n{number}».

source: *qname_aware_tags*: a set of qname aware tag names in which prefixes
pt_pt: *qname_aware_tags*: um conjunto de nomes de etiquetas conscientes de qname em que os prefixos
ru: *qname_aware_tags*: набор имен тегов, поддерживающих qname, в которых префиксы

source: should be replaced in text content (default: empty)
pt_pt: devem ser substituídos no conteúdo de texto (predefinição: vazio)
ru: следует заменить в текстовом содержимом (по умолчанию: пусто)

source: *qname_aware_attrs*: a set of qname aware attribute names in which prefixes
pt_pt: *qname_aware_attrs*: um conjunto de nomes de atributos conscientes de qname em que os prefixos
ru: *qname_aware_attrs*: набор имен атрибутов, учитывающих qname, в которых префиксы

source: *exclude_attrs*: a set of attribute names that should not be serialised
pt_pt: *exclude_attrs*: um conjunto de nomes de atributos que não devem ser serializados
ru: *exclude_attrs*: набор имен атрибутов, которые не следует сериализовать.

source: *exclude_tags*: a set of tag names that should not be serialised
pt_pt: *exclude_tags*: um conjunto de nomes de etiquetas que não devem ser serializados
ru: *exclude_tags*: набор имен тегов, которые не следует сериализовать.

source: In the option list above, "a set" refers to any collection or iterable of strings, no ordering is expected.
pt_pt: Na lista de opções acima, "um conjunto" refere-se a qualquer coleção ou iterável de strings, não é esperada nenhuma ordenação.
ru: В приведенном выше списке параметров «набор» относится к любой коллекции или итерации строк, упорядочение не предполагается.

source: Comment element factory. This factory function creates a special element that will be serialized as an XML comment by the standard serializer. The comment string can be either a bytestring or a Unicode string. *text* is a string containing the comment string. Returns an element instance representing a comment.
pt_pt: Fábrica de elementos de comentário. Esta função de fábrica cria um elemento especial que será serializado como um comentário XML pelo serializador padrão. A string de comentário pode ser uma string de bytes ou uma string Unicode. *text* é uma string contendo a string de comentário. Devolve uma instância de elemento que representa um comentário.
ru: Фабрика элементов комментариев. Эта фабричная функция создает специальный элемент, который будет сериализован в виде комментария XML стандартным сериализатором. Строка комментария может быть либо байтовой строкой, либо строкой Юникода. *текст* — это строка, содержащая строку комментария. Возвращает экземпляр элемента, представляющий комментарий.

source: Note that :class:`XMLParser` skips over comments in the input instead of creating comment objects for them. An :class:`ElementTree` will only contain comment nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
pt_pt: Note que :class:`XMLParser` ignora comentários na entrada em vez de criar objetos de comentário para eles. Uma :class:`ElementTree` só conterá nós de comentário se estes tiverem sido inseridos na árvore usando um dos métodos de :class:`Element`.
ru: Обратите внимание, что :class:`XMLParser` пропускает комментарии во входных данных вместо того, чтобы создавать для них объекты комментариев. :class:`ElementTree` будет содержать узлы комментариев только в том случае, если они были вставлены в дерево с помощью одного из методов :class:`Element`.

source: Writes an element tree or element structure to sys.stdout. This function should be used for debugging only.
pt_pt: Escreve uma árvore de elementos ou estrutura de elementos para sys.stdout. Esta função deve ser usada apenas para depuração.
ru: Записывает дерево элементов или структуру элементов в sys.stdout. Эту функцию следует использовать только для отладки.

source: The exact output format is implementation dependent. In this version, it's written as an ordinary XML file.
pt_pt: O formato exato da saída depende da implementação. Nesta versão, é escrito como um ficheiro XML comum.
ru: Точный формат вывода зависит от реализации. В этой версии он записан как обычный XML-файл.

source: *elem* is an element tree or an individual element.
pt_pt: *elem* é uma árvore de elementos ou um elemento individual.
ru: *elem* — дерево элементов или отдельный элемент.

source: The :func:`dump` function now preserves the attribute order specified by the user.
pt_pt: A função :func:`dump` agora preserva a ordem dos atributos especificada pelo utilizador.
ru: Функция :func:`dump` теперь сохраняет порядок атрибутов, указанный пользователем.

source: Parses an XML section from a string constant. Same as :func:`XML`. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
pt_pt: Analisa uma secção XML a partir de uma constante de string. Igual a :func:`XML`. *text* é uma string contendo dados XML. *parser* é uma instância de analisador opcional. Se não for fornecida, é usado o analisador padrão :class:`XMLParser`. Devolve uma instância de :class:`Element`.
ru: Анализирует раздел XML из строковой константы. То же, что :func:`XML`. *текст* — это строка, содержащая данные XML. *parser* — необязательный экземпляр синтаксического анализатора. Если не указано, используется стандартный парсер :class:`XMLParser`. Возвращает экземпляр :class:`Element`.

source: Parses an XML document from a sequence of string fragments. *sequence* is a list or other sequence containing XML data fragments. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
pt_pt: Analisa um documento XML a partir de uma sequência de fragmentos de string. *sequence* é uma lista ou outra sequência contendo fragmentos de dados XML. *parser* é uma instância de analisador opcional. Se não for fornecida, é usado o analisador padrão :class:`XMLParser`. Devolve uma instância de :class:`Element`.
ru: Анализирует XML-документ из последовательности фрагментов строк. *последовательность* — список или другая последовательность, содержащая фрагменты данных XML. *parser* — необязательный экземпляр синтаксического анализатора. Если не указано, используется стандартный парсер :class:`XMLParser`. Возвращает экземпляр :class:`Element`.

source: Appends whitespace to the subtree to indent the tree visually. This can be used to generate pretty-printed XML output. *tree* can be an Element or ElementTree. *space* is the whitespace string that will be inserted for each indentation level, two space characters by default. For indenting partial subtrees inside of an already indented tree, pass the initial indentation level as *level*.
pt_pt: Adiciona espaços em branco à sub-árvore para indentar a árvore visualmente. Isto pode ser usado para gerar saída XML com formatação bonita. *tree* pode ser um Element ou ElementTree. *space* é a string de espaços em branco que será inserida para cada nível de indentação, dois caracteres de espaço por predefinição. Para indentar sub-árvores parciais dentro de uma árvore já indentada, passe o nível de indentação inicial como *level*.
ru: Добавляет пробелы к поддереву для визуального отступа дерева. Это можно использовать для создания красивого вывода XML. *tree* может быть элементом или ElementTree. *пробел* — это строка пробелов, которая будет вставлена ​​для каждого уровня отступа, по умолчанию два символа пробела. Для отступа частичных поддеревьев внутри уже имеющегося дерева передайте начальный уровень отступа как *level*.

source: Check if an object appears to be a valid element object. *element* is an element instance. Return ``True`` if this is an element object.
pt_pt: Verifica se um objeto parece ser um objeto de elemento válido. *element* é uma instância de elemento. Devolve ``True`` se isto for um objeto de elemento.
ru: Проверьте, является ли объект допустимым объектом-элементом. *element* — экземпляр элемента. Верните ``True``, если это объект-элемент.
