Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.dom.minidom.po
Languages: ru, sv

source: The type ``DOMString`` maps to Python strings. :mod:`xml.dom.minidom` supports either bytes or strings, but will normally produce strings. Values of type ``DOMString`` may also be ``None`` where allowed to have the IDL ``null`` value by the DOM specification from the W3C.
ru: Тип DOMString соответствует строкам Python. :mod:`xml.dom.minidom` поддерживает как байты, так и строки, но обычно создает строки. Значения типа DOMString также могут иметь значение None, если спецификация DOM из W3C позволяет иметь значение IDL null.
sv: Typen ``DOMString`` mappar till Python-strängar. :mod:`xml.dom.minidom` stöder antingen bytes eller strängar, men kommer normalt att producera strängar. Värden av typen ``DOMString`` kan också vara ``None`` om det är tillåtet att ha IDL-värdet ``null`` enligt DOM-specifikationen från W3C.

source: ``const`` declarations map to variables in their respective scope (e.g. ``xml.dom.minidom.Node.PROCESSING_INSTRUCTION_NODE``); they must not be changed.
ru: Объявления ``const`` сопоставляются с переменными в соответствующей области (например, ``xml.dom.minidom.Node.PROCESSING_INSTRUCTION_NODE``); их нельзя менять.
sv: ``const``\-deklarationer mappar till variabler i deras respektive omfattning (t.ex. ``xml.dom.minidom.Node.PROCESSING_INSTRUCTION_NODE``); de får inte ändras.

source: ``DOMException`` is currently not supported in :mod:`xml.dom.minidom`. Instead, :mod:`xml.dom.minidom` uses standard Python exceptions such as :exc:`TypeError` and :exc:`AttributeError`.
ru: ``DOMException`` в настоящее время не поддерживается в :mod:`xml.dom.minidom`. Вместо этого :mod:`xml.dom.minidom` использует стандартные исключения Python, такие как :exc:`TypeError` и :exc:`AttributeError`.
sv: ``DOMException`` stöds för närvarande inte i :mod:`xml.dom.minidom`. Istället använder :mod:`xml.dom.minidom` standard Python-undantag som :exc:`TypeError` och :exc:`AttributeError`.

source: :class:`NodeList` objects are implemented using Python's built-in list type. These objects provide the interface defined in the DOM specification, but with earlier versions of Python they do not support the official API. They are, however, much more "Pythonic" than the interface defined in the W3C recommendations.
ru: Объекты :class:`NodeList` реализованы с использованием встроенного в Python типа списка. Эти объекты предоставляют интерфейс, определенный в спецификации DOM, но в более ранних версиях Python они не поддерживают официальный API. Однако они гораздо более «питонические», чем интерфейс, определенный в рекомендациях W3C.
sv: :class:`NodeList`\-objekt implementeras med hjälp av Pythons inbyggda listtyp. Dessa objekt tillhandahåller det gränssnitt som definieras i DOM-specifikationen, men med tidigare versioner av Python stöder de inte det officiella API:et. De är dock mycket mer "Pythonic" än det gränssnitt som definieras i W3C:s rekommendationer.

source: The following interfaces have no implementation in :mod:`xml.dom.minidom`:
ru: Следующие интерфейсы не имеют реализации в :mod:`xml.dom.minidom`:
sv: Följande gränssnitt har ingen implementation i :mod:`xml.dom.minidom`:

source: Most of these reflect information in the XML document that is not of general utility to most DOM users.
ru: Большинство из них отражают информацию в XML-документе, которая не представляет общей пользы для большинства пользователей DOM.
sv: De flesta av dessa återspeglar information i XML-dokumentet som inte är till allmän nytta för de flesta DOM-användare.

source: Footnotes
ru: Сноски
sv: Fotnoter

source: The encoding name included in the XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not valid in an XML document's declaration, even though Python accepts it as an encoding name. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
ru: Имя кодировки, включенное в выходные данные XML, должно соответствовать соответствующим стандартам. Например, «UTF-8» допустим, но «UTF8» недопустим в объявлении XML-документа, хотя Python принимает его как имя кодировки. См. https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl и https://www.iana.org/assignments/character-sets/character-sets.xhtml.
sv: Kodningsnamnet som ingår i XML-utdata bör överensstämma med lämpliga standarder. Till exempel är "UTF-8" giltigt, men "UTF8" är inte giltigt i ett XML-dokuments deklaration, även om Python accepterar det som ett kodningsnamn. Se https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl och https://www.iana.org/assignments/character-sets/character-sets.xhtml.

source: The :mod:`xml.dom.minidom` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
ru: Модуль :mod:`xml.dom.minidom` не защищен от вредоносно созданных данных. Если вам нужно проанализировать ненадежные или неаутентифицированные данные, см. :ref:`xml-vulnerabilities`.
