Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.etree.elementtree.po
Languages: pt_pt, ru

source: Loads an external XML section into this element tree. *source* is a file name or :term:`file object`. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns the section root element.
pt_pt: Carrega uma secção XML externa nesta árvore de elementos. *source* é um nome de ficheiro ou :term:`objeto de ficheiro`. *parser* é uma instância de analisador opcional. Se não for fornecida, é usado o analisador padrão :class:`XMLParser`. Devolve o elemento raiz da secção.
ru: Загружает внешний раздел XML в это дерево элементов. *source* — это имя файла или :term:`файловый объект`. *parser* — необязательный экземпляр синтаксического анализатора. Если не указано, используется стандартный парсер :class:`XMLParser`. Возвращает корневой элемент раздела.

source: Writes the element tree to a file, as XML. *file* is a file name, or a :term:`file object` opened for writing. *encoding* [1]_ is the output encoding (default is US-ASCII). *xml_declaration* controls if an XML declaration should be added to the file. Use ``False`` for never, ``True`` for always, ``None`` for only if not US-ASCII or UTF-8 or Unicode (default is ``None``). *default_namespace* sets the default XML namespace (for "xmlns"). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). The keyword-only *short_empty_elements* parameter controls the formatting of elements that contain no content. If ``True`` (the default), they are emitted as a single self-closed tag, otherwise they are emitted as a pair of start/end tags.
pt_pt: Escreve a árvore de elementos num ficheiro, como XML. *file* é um nome de ficheiro ou um :term:`objeto de ficheiro` aberto para escrita. *encoding* [1]_ é a codificação de saída (predefinição é US-ASCII). *xml_declaration* controla se uma declaração XML deve ser adicionada ao ficheiro. Use ``False`` para nunca, ``True`` para sempre, ``None`` apenas se não for US-ASCII ou UTF-8 ou Unicode (predefinição é ``None``). *default_namespace* define o namespace XML predefinido (para "xmlns"). *method* é ``"xml"``, ``"html"`` ou ``"text"`` (predefinição é ``"xml"``). O parâmetro *short_empty_elements* apenas de palavra-chave controla a formatação de elementos que não contêm conteúdo. Se ``True`` (predefinição), são emitidos como uma única etiqueta auto-fechada, caso contrário são emitidos como um par de etiquetas de início/fim.
ru: Записывает дерево элементов в файл в формате XML. *file* — имя файла или файловый объект, открытый для записи. *кодировка* [1]_ — выходная кодировка (по умолчанию — US-ASCII). *xml_declaration* определяет, следует ли добавлять в файл XML-объявление. Используйте ``False`` для никогда, ``True`` для всегда, ``None``, только если не используется US-ASCII, UTF-8 или Unicode (по умолчанию — ``None``). *default_namespace* устанавливает пространство имен XML по умолчанию (для «xmlns»). *метод* — это ``"xml"``, ``"html"`` или ``"text"`` (по умолчанию ``"xml"``). Параметр *short_empty_elements*, содержащий только ключевые слова*, управляет форматированием элементов, не содержащих содержимого. Если «True» (по умолчанию), они создаются как один самозакрывающийся тег, в противном случае они создаются как пара начальных/конечных тегов.

source: The output is either a string (:class:`str`) or binary (:class:`bytes`). This is controlled by the *encoding* argument. If *encoding* is ``"unicode"``, the output is a string; otherwise, it's binary. Note that this may conflict with the type of *file* if it's an open :term:`file object`; make sure you do not try to write a string to a binary stream and vice versa.
pt_pt: A saída é uma string (:class:`str`) ou binária (:class:`bytes`). Isto é controlado pelo argumento *encoding*. Se *encoding* for ``"unicode"``, a saída é uma string; caso contrário, é binária. Note que isto pode entrar em conflito com o tipo de *file* se for um :term:`objeto de ficheiro` aberto; certifique-se de que não tenta escrever uma string num fluxo binário e vice-versa.
ru: Выходные данные представляют собой либо строку (:class:`str`), либо двоичный файл (:class:`bytes`). Это контролируется аргументом *encoding*. Если *кодировка* равна ``"unicode"``, вывод представляет собой строку; в противном случае это двоичный код. Обратите внимание, что это может конфликтовать с типом *файла*, если это открытый :term:`файловый объект`; убедитесь, что вы не пытаетесь записать строку в двоичный поток и наоборот.

source: The :meth:`write` method now preserves the attribute order specified by the user.
pt_pt: O método :meth:`write` agora preserva a ordem dos atributos especificada pelo utilizador.
ru: Метод :meth:`write` теперь сохраняет порядок атрибутов, указанный пользователем.

source: This is the XML file that is going to be manipulated::
pt_pt: Este é o ficheiro XML que vai ser manipulado:
ru: Это XML-файл, которым будут манипулировать:

source: <html> <head> <title>Example page</title> </head> <body> <p>Moved to <a href="http://example.org/">example.org</a> or <a href="http://example.com/">example.com</a>.</p> </body> </html>
pt_pt: <html> <head> <title>Página de exemplo</title> </head> <body> <p>Movido para <a href="http://example.org/">example.org</a> ou <a href="http://example.com/">example.com</a>.</p> </body> </html>

source: Example of changing the attribute "target" of every link in first paragraph::
pt_pt: Exemplo de alteração do atributo "target" de todas as ligações no primeiro parágrafo:
ru: Пример изменения атрибута «цель» каждой ссылки в первом абзаце:

source: >>> from xml.etree.ElementTree import ElementTree >>> tree = ElementTree() >>> tree.parse("index.xhtml") <Element 'html' at 0xb77e6fac> >>> p = tree.find("body/p") # Finds first occurrence of tag p in body >>> p <Element 'p' at 0xb77ec26c> >>> links = list(p.iter("a")) # Returns list of all links >>> links [<Element 'a' at 0xb77ec2ac>, <Element 'a' at 0xb77ec1cc>] >>> for i in links: # Iterates through all found links ... i.attrib["target"] = "blank" ... >>> tree.write("output.xhtml")
pt_pt: >>> from xml.etree.ElementTree import ElementTree >>> tree = ElementTree() >>> tree.parse("index.xhtml") <Element 'html' at 0xb77e6fac> >>> p = tree.find("body/p") # Encontra a primeira ocorrência da etiqueta p em body >>> p <Element 'p' at 0xb77ec26c> >>> links = list(p.iter("a")) # Devolve uma lista de todas as ligações >>> links [<Element 'a' at 0xb77ec2ac>, <Element 'a' at 0xb77ec1cc>] >>> for i in links: # Itera através de todas as ligações encontradas ... i.attrib["target"] = "blank" ... >>> tree.write("output.xhtml")

source: QName Objects
pt_pt: Objetos QName
ru: Объекты QName

source: QName wrapper. This can be used to wrap a QName attribute value, in order to get proper namespace handling on output. *text_or_uri* is a string containing the QName value, in the form {uri}local, or, if the tag argument is given, the URI part of a QName. If *tag* is given, the first argument is interpreted as a URI, and this argument is interpreted as a local name. :class:`QName` instances are opaque.
pt_pt: Invólucro QName. Isto pode ser usado para envolver um valor de atributo QName, a fim de obter um tratamento adequado de namespace na saída. *text_or_uri* é uma string contendo o valor QName, na forma {uri}local, ou, se o argumento tag for fornecido, a parte URI de um QName. Se *tag* for fornecido, o primeiro argumento é interpretado como um URI, e este argumento é interpretado como um nome local. As instâncias de :class:`QName` são opacas.
ru: Обертка QName. Это можно использовать для переноса значения атрибута QName, чтобы обеспечить правильную обработку пространства имен на выходе. *text_or_uri* — это строка, содержащая значение QName в форме {uri}local или, если указан аргумент тега, часть URI QName. Если указан *tag*, первый аргумент интерпретируется как URI, а этот аргумент интерпретируется как локальное имя. Экземпляры :class:`QName` непрозрачны.

source: TreeBuilder Objects
pt_pt: Objetos TreeBuilder
ru: Объекты TreeBuilder

source: Generic element structure builder. This builder converts a sequence of start, data, end, comment and pi method calls to a well-formed element structure. You can use this class to build an element structure using a custom XML parser, or a parser for some other XML-like format.
pt_pt: Construtor genérico de estrutura de elementos. Este construtor converte uma sequência de chamadas de métodos start, data, end, comment e pi numa estrutura de elementos bem formada. Pode usar esta classe para construir uma estrutura de elementos usando um analisador XML personalizado, ou um analisador para algum outro formato semelhante a XML.
ru: Универсальный конструктор структур элементов. Этот конструктор преобразует последовательность вызовов методов start, data, end, comment и pi в правильно сформированную структуру элементов. Вы можете использовать этот класс для построения структуры элементов с помощью специального анализатора XML или анализатора какого-либо другого XML-подобного формата.

source: *element_factory*, when given, must be a callable accepting two positional arguments: a tag and a dict of attributes. It is expected to return a new element instance.
pt_pt: *element_factory*, quando fornecido, deve ser um objeto chamável que aceite dois argumentos posicionais: uma etiqueta e um dicionário de atributos. Espera-se que devolva uma nova instância de elemento.
ru: *element_factory*, если он задан, должен быть вызываемым объектом, принимающим два позиционных аргумента: тег и набор атрибутов. Ожидается, что он вернет новый экземпляр элемента.

source: The *comment_factory* and *pi_factory* functions, when given, should behave like the :func:`Comment` and :func:`ProcessingInstruction` functions to create comments and processing instructions. When not given, the default factories will be used. When *insert_comments* and/or *insert_pis* is true, comments/pis will be inserted into the tree if they appear within the root element (but not outside of it).
pt_pt: As funções *comment_factory* e *pi_factory*, quando fornecidas, devem comportar-se como as funções :func:`Comment` e :func:`ProcessingInstruction` para criar comentários e instruções de processamento. Quando não fornecidas, serão usadas as fábricas predefinidas. Quando *insert_comments* e/ou *insert_pis* for verdadeiro, comentários/instruções de processamento serão inseridos na árvore se aparecerem dentro do elemento raiz (mas não fora dele).
ru: Функции *comment_factory* и *pi_factory*, если они заданы, должны вести себя как функции :func:`Comment` и :func:`ProcessingInstruction` для создания комментариев и инструкций обработки. Если этот параметр не указан, будут использоваться фабрики по умолчанию. Когда *insert_comments* и/или *insert_pis* имеет значение true, комментарии/pis будут вставлены в дерево, если они появляются внутри корневого элемента (но не за его пределами).

source: Flushes the builder buffers, and returns the toplevel document element. Returns an :class:`Element` instance.
pt_pt: Limpa os buffers do construtor e devolve o elemento de documento de nível superior. Devolve uma instância de :class:`Element`.
ru: Очищает буферы компоновщика и возвращает элемент документа верхнего уровня. Возвращает экземпляр :class:`Element`.

source: Adds text to the current element. *data* is a string. This should be either a bytestring, or a Unicode string.
pt_pt: Adiciona texto ao elemento atual. *data* é uma string. Isto deve ser uma string de bytes ou uma string Unicode.
ru: Добавляет текст к текущему элементу. *данные* — это строка. Это должна быть либо байтовая строка, либо строка Юникода.

source: Closes the current element. *tag* is the element name. Returns the closed element.
pt_pt: Fecha o elemento atual. *tag* é o nome do elemento. Devolve o elemento fechado.
ru: Закрывает текущий элемент. *tag* — имя элемента. Возвращает закрытый элемент.

source: Opens a new element. *tag* is the element name. *attrs* is a dictionary containing element attributes. Returns the opened element.
pt_pt: Abre um novo elemento. *tag* é o nome do elemento. *attrs* é um dicionário contendo atributos do elemento. Devolve o elemento aberto.
ru: Открывает новый элемент. *tag* — имя элемента. *attrs* — словарь, содержащий атрибуты элементов. Возвращает открытый элемент.

source: Creates a comment with the given *text*. If ``insert_comments`` is true, this will also add it to the tree.
pt_pt: Cria um comentário com o *text* dado. Se ``insert_comments`` for verdadeiro, isto também o adicionará à árvore.
ru: Создает комментарий с заданным *текстом*. Если ``insert_comments`` имеет значение true, это также добавит его в дерево.

source: Creates a process instruction with the given *target* name and *text*. If ``insert_pis`` is true, this will also add it to the tree.
pt_pt: Cria uma instrução de processamento com o nome *target* e *text* dados. Se ``insert_pis`` for verdadeiro, isto também a adicionará à árvore.
ru: Создает инструкцию процесса с заданным *целевым* именем и *текстом*. Если ``insert_pis`` имеет значение true, это также добавит его в дерево.

source: In addition, a custom :class:`TreeBuilder` object can provide the following methods:
pt_pt: Além disso, um objeto :class:`TreeBuilder` personalizado pode fornecer os seguintes métodos:
ru: Кроме того, пользовательский объект :class:`TreeBuilder` может предоставлять следующие методы:

source: Handles a doctype declaration. *name* is the doctype name. *pubid* is the public identifier. *system* is the system identifier. This method does not exist on the default :class:`TreeBuilder` class.
pt_pt: Trata uma declaração de doctype. *name* é o nome do doctype. *pubid* é o identificador público. *system* é o identificador do sistema. Este método não existe na classe :class:`TreeBuilder` predefinida.
ru: Обрабатывает объявление типа документа. *name* — имя типа документа. *pubid* — общедоступный идентификатор. *system* — идентификатор системы. Этот метод не существует в классе по умолчанию :class:`TreeBuilder`.

source: Is called whenever the parser encounters a new namespace declaration, before the ``start()`` callback for the opening element that defines it. *prefix* is ``''`` for the default namespace and the declared namespace prefix name otherwise. *uri* is the namespace URI.
pt_pt: É chamado sempre que o analisador encontrar uma nova declaração de namespace, antes do callback ``start()`` para o elemento de abertura que o define. *prefix* é ``''`` para o namespace predefinido e o nome do prefixo do namespace declarado, caso contrário. *uri* é o URI do namespace.
ru: Вызывается всякий раз, когда анализатор встречает новое объявление пространства имен, перед обратным вызовом start() для открывающего элемента, который его определяет. *prefix* — это ``''`` для пространства имен по умолчанию и объявленное имя префикса пространства имен в противном случае. *uri* — это URI пространства имен.

source: Is called after the ``end()`` callback of an element that declared a namespace prefix mapping, with the name of the *prefix* that went out of scope.
pt_pt: É chamado após o callback ``end()`` de um elemento que declarou um mapeamento de prefixo de namespace, com o nome do *prefix* que saiu do âmbito.
ru: Вызывается после обратного вызова ``end()`` элемента, который объявил сопоставление префикса пространства имен, с именем *префикса*, выходящим за пределы области видимости.

source: A `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ writer. Arguments are the same as for the :func:`canonicalize` function. This class does not build a tree but translates the callback events directly into a serialised form using the *write* function.
pt_pt: Um escritor `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_. Os argumentos são os mesmos que para a função :func:`canonicalize`. Esta classe não constrói uma árvore, mas traduz os eventos de callback diretamente numa forma serializada usando a função *write*.
ru: Автор `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_. Аргументы те же, что и для функции :func:`canonicalize`. Этот класс не строит дерево, а переводит события обратного вызова непосредственно в сериализованную форму с помощью функции *write*.

source: XMLParser Objects
pt_pt: Objetos XMLParser
ru: Объекты XMLParser

source: This class is the low-level building block of the module. It uses :mod:`xml.parsers.expat` for efficient, event-based parsing of XML. It can be fed XML data incrementally with the :meth:`feed` method, and parsing events are translated to a push API - by invoking callbacks on the *target* object. If *target* is omitted, the standard :class:`TreeBuilder` is used. If *encoding* [1]_ is given, the value overrides the encoding specified in the XML file.
pt_pt: Esta classe é o bloco de construção de baixo nível do módulo. Usa :mod:`xml.parsers.expat` para análise eficiente e baseada em eventos de XML. Pode ser alimentada com dados XML de forma incremental com o método :meth:`feed`, e os eventos de análise são traduzidos para uma API push - invocando callbacks no objeto *target*. Se *target* for omitido, é usado o :class:`TreeBuilder` padrão. Se *encoding* [1]_ for fornecido, o valor substitui a codificação especificada no ficheiro XML.
ru: Этот класс является низкоуровневым строительным блоком модуля. Он использует :mod:`xml.parsers.expat` для эффективного анализа XML на основе событий. XML-данные могут передаваться постепенно с помощью метода :meth:`feed`, а события синтаксического анализа преобразуются в push-API, вызывая обратные вызовы для *целевого* объекта. Если *target* опущен, используется стандартный :class:`TreeBuilder`. Если *кодировка* [1]_ задано, значение переопределяет кодировку, указанную в файле XML.

source: Parameters are now :ref:`keyword-only <keyword-only_parameter>`. The *html* argument is no longer supported.
pt_pt: Os parâmetros são agora :ref:`apenas de palavra-chave <keyword-only_parameter>`. O argumento *html* já não é suportado.

source: Finishes feeding data to the parser. Returns the result of calling the ``close()`` method of the *target* passed during construction; by default, this is the toplevel document element.
pt_pt: Termina a alimentação de dados para o analisador. Devolve o resultado de chamar o método ``close()`` do *target* passado durante a construção; por predefinição, este é o elemento de documento de nível superior.
ru: Завершает подачу данных в анализатор. Возвращает результат вызова метода close() объекта *target*, переданного во время построения; по умолчанию это элемент документа верхнего уровня.

source: Feeds data to the parser. *data* is encoded data.
pt_pt: Alimenta dados para o analisador. *data* são dados codificados.
ru: Передает данные в парсер. *данные* — это закодированные данные.

source: Triggers parsing of any previously fed unparsed data, which can be used to ensure more immediate feedback, in particular with Expat >=2.6.0. The implementation of :meth:`flush` temporarily disables reparse deferral with Expat (if currently enabled) and triggers a reparse. Disabling reparse deferral has security consequences; please see :meth:`xml.parsers.expat.xmlparser.SetReparseDeferralEnabled` for details.
pt_pt: Dispara a análise de quaisquer dados não analisados alimentados anteriormente, o que pode ser usado para garantir feedback mais imediato, em particular com Expat >=2.6.0. A implementação de :meth:`flush` desativa temporariamente o adiamento de reanálise com Expat (se atualmente ativado) e dispara uma reanálise. Desativar o adiamento de reanálise tem consequências de segurança; consulte :meth:`xml.parsers.expat.xmlparser.SetReparseDeferralEnabled` para detalhes.
ru: Запускает анализ любых ранее переданных неразобранных данных, которые можно использовать для обеспечения более немедленной обратной связи, в частности, с Expat >=2.6.0. Реализация :meth:`flush` временно отключает отсрочку повторной обработки с помощью Expat (если она включена в данный момент) и запускает повторную обработку. Отключение отсрочки повторной обработки имеет последствия для безопасности; подробности см. в :meth:`xml.parsers.expat.xmlparser.SetReparseDeferralEnabled`.

source: Note that :meth:`flush` has been backported to some prior releases of CPython as a security fix. Check for availability of :meth:`flush` using :func:`hasattr` if used in code running across a variety of Python versions.
pt_pt: Note que :meth:`flush` foi retroportado para algumas versões anteriores do CPython como uma correção de segurança. Verifique a disponibilidade de :meth:`flush` usando :func:`hasattr` se usado em código que é executado em várias versões do Python.
ru: Обратите внимание, что :meth:`flush` был перенесен в некоторые предыдущие выпуски CPython в качестве исправления безопасности. Проверьте доступность :meth:`flush` с помощью :func:`hasattr`, если он используется в коде, работающем в различных версиях Python.

source: :meth:`XMLParser.feed` calls *target*\'s ``start(tag, attrs_dict)`` method for each opening tag, its ``end(tag)`` method for each closing tag, and data is processed by method ``data(data)``. For further supported callback methods, see the :class:`TreeBuilder` class. :meth:`XMLParser.close` calls *target*\'s method ``close()``. :class:`XMLParser` can be used not only for building a tree structure. This is an example of counting the maximum depth of an XML file::
pt_pt: :meth:`XMLParser.feed` chama o método ``start(tag, attrs_dict)`` do *target* para cada etiqueta de abertura, o seu método ``end(tag)`` para cada etiqueta de fecho, e os dados são processados pelo método ``data(data)``. Para métodos de callback adicionais suportados, consulte a classe :class:`TreeBuilder`. :meth:`XMLParser.close` chama o método ``close()`` do *target*. :class:`XMLParser` pode ser usado não apenas para construir uma estrutura de árvore. Este é um exemplo de contagem da profundidade máxima de um ficheiro XML:
ru: :meth:`XMLParser.feed` вызывает метод ``start(tag, attrs_dict)`` *target* для каждого открывающего тега, его метод ``end(tag)`` для каждого закрывающего тега, и данные обрабатываются методом ``данные(данные)``. Дополнительные поддерживаемые методы обратного вызова см. в классе :class:`TreeBuilder`. :meth:`XMLParser.close` вызывает метод *target*\``close()``. :class:`XMLParser` можно использовать не только для построения древовидной структуры. Это пример подсчета максимальной глубины XML-файла:
