Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.etree.elementtree.po
Languages: pt_pt, ru

source: A string identifying what kind of data this element represents (the element type, in other words).
pt_pt: Uma string que identifica que tipo de dados este elemento representa (o tipo de elemento, em outras palavras).
ru: Строка, определяющая, какие данные представляет этот элемент (другими словами, тип элемента).

source: These attributes can be used to hold additional data associated with the element. Their values are usually strings but may be any application-specific object. If the element is created from an XML file, the *text* attribute holds either the text between the element's start tag and its first child or end tag, or ``None``, and the *tail* attribute holds either the text between the element's end tag and the next tag, or ``None``. For the XML data
pt_pt: Estes atributos podem ser usados para armazenar dados adicionais associados ao elemento. Os seus valores são geralmente strings, mas podem ser qualquer objeto específico da aplicação. Se o elemento for criado a partir de um ficheiro XML, o atributo *text* contém ou o texto entre a etiqueta de início do elemento e o seu primeiro filho ou etiqueta de fim, ou ``None``, e o atributo *tail* contém ou o texto entre a etiqueta de fim do elemento e a próxima etiqueta, ou ``None``. Para os dados XML
ru: Эти атрибуты можно использовать для хранения дополнительных данных, связанных с элементом. Их значения обычно представляют собой строки, но могут быть любым объектом, специфичным для приложения. Если элемент создан из XML-файла, атрибут *text* содержит либо текст между начальным тегом элемента и его первым дочерним или конечным тегом, либо «Нет», а атрибут *tail* содержит либо текст между конечный тег элемента и следующий тег или ``None``. Для XML-данных

source: the *a* element has ``None`` for both *text* and *tail* attributes, the *b* element has *text* ``"1"`` and *tail* ``"4"``, the *c* element has *text* ``"2"`` and *tail* ``None``, and the *d* element has *text* ``None`` and *tail* ``"3"``.
pt_pt: o elemento *a* tem ``None`` para os atributos *text* e *tail*, o elemento *b* tem *text* ``"1"`` e *tail* ``"4"``, o elemento *c* tem *text* ``"2"`` e *tail* ``None``, e o elemento *d* tem *text* ``None`` e *tail* ``"3"``.
ru: элемент *a* имеет атрибут None для атрибутов *text* и *tail*, элемент *b* имеет *text* ``"1"`` и *tail* ``"4"``, элемент *c* имеет *text* ``"2"`` и *tail* ``None``, а элемент *d* имеет *text* ``None`` и *tail* ``"3" ``.

source: To collect the inner text of an element, see :meth:`itertext`, for example ``"".join(element.itertext())``.
pt_pt: Para recolher o texto interno de um elemento, consulte :meth:`itertext`, por exemplo, ``"".join(element.itertext())``.
ru: Чтобы собрать внутренний текст элемента, см. :meth:`itertext`, например ``"".join(element.itertext())``.

source: Applications may store arbitrary objects in these attributes.
pt_pt: As aplicações podem armazenar objetos arbitrários nestes atributos.
ru: Приложения могут хранить в этих атрибутах произвольные объекты.

source: A dictionary containing the element's attributes. Note that while the *attrib* value is always a real mutable Python dictionary, an ElementTree implementation may choose to use another internal representation, and create the dictionary only if someone asks for it. To take advantage of such implementations, use the dictionary methods below whenever possible.
pt_pt: Um dicionário contendo os atributos do elemento. Note que, embora o valor de *attrib* seja sempre um dicionário Python mutável real, uma implementação de ElementTree pode optar por usar outra representação interna e criar o dicionário apenas se alguém o solicitar. Para tirar partido de tais implementações, use os métodos de dicionário abaixo sempre que possível.
ru: Словарь, содержащий атрибуты элемента. Обратите внимание: хотя значение *attrib* всегда является реальным изменяемым словарем Python, реализация ElementTree может использовать другое внутреннее представление и создавать словарь только в том случае, если кто-то об этом попросит. Чтобы воспользоваться преимуществами таких реализаций, по возможности используйте приведенные ниже методы словаря.

source: The following dictionary-like methods work on the element attributes.
pt_pt: Os seguintes métodos semelhantes a dicionários funcionam nos atributos do elemento.
ru: Следующие словарные методы работают с атрибутами элементов.

source: Resets an element. This function removes all subelements, clears all attributes, and sets the text and tail attributes to ``None``.
pt_pt: Reinicia um elemento. Esta função remove todos os sub-elementos, limpa todos os atributos e define os atributos de texto e cauda para ``None``.
ru: Сбрасывает элемент. Эта функция удаляет все подэлементы, очищает все атрибуты и устанавливает для атрибутов текста и хвоста значение «Нет».

source: Gets the element attribute named *key*.
pt_pt: Obtém o atributo do elemento chamado *key*.
ru: Получает атрибут элемента с именем *key*.

source: Returns the attribute value, or *default* if the attribute was not found.
pt_pt: Devolve o valor do atributo, ou *default* se o atributo não for encontrado.
ru: Возвращает значение атрибута или *по умолчанию*, если атрибут не найден.

source: Returns the element attributes as a sequence of (name, value) pairs. The attributes are returned in an arbitrary order.
pt_pt: Devolve os atributos do elemento como uma sequência de pares (nome, valor). Os atributos são devolvidos numa ordem arbitrária.
ru: Возвращает атрибуты элемента в виде последовательности пар (имя, значение). Атрибуты возвращаются в произвольном порядке.

source: Returns the elements attribute names as a list. The names are returned in an arbitrary order.
pt_pt: Devolve os nomes dos atributos do elemento como uma lista. Os nomes são devolvidos numa ordem arbitrária.
ru: Возвращает имена атрибутов элементов в виде списка. Имена возвращаются в произвольном порядке.

source: Set the attribute *key* on the element to *value*.
pt_pt: Define o atributo *key* no elemento para *value*.
ru: Установите для атрибута *key* элемента значение *value*.

source: The following methods work on the element's children (subelements).
pt_pt: Os seguintes métodos funcionam nos filhos do elemento (sub-elementos).
ru: Следующие методы работают с дочерними элементами (подэлементами).

source: Adds the element *subelement* to the end of this element's internal list of subelements. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
pt_pt: Adiciona o elemento *subelement* ao fim da lista interna de sub-elementos deste elemento. Levanta :exc:`TypeError` se *subelement* não for um :class:`Element`.
ru: Добавляет элемент *подэлемент* в конец внутреннего списка подэлементов этого элемента. Вызывает :exc:`TypeError`, если *подэлемент* не является :class:`Element`.

source: Appends *subelements* from an iterable of elements. Raises :exc:`TypeError` if a subelement is not an :class:`Element`.
pt_pt: Adiciona *subelementos* de um iterável de elementos. Levanta :exc:`TypeError` se um sub-elemento não for um :class:`Element`.

source: Finds the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns an element instance or ``None``. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
pt_pt: Encontra o primeiro sub-elemento correspondente a *match*. *match* pode ser um nome de etiqueta ou um :ref:`caminho <elementtree-xpath>`. Devolve uma instância de elemento ou ``None``. *namespaces* é um mapeamento opcional de prefixo de namespace para nome completo. Passe ``''`` como prefixo para mover todos os nomes de etiqueta não prefixados na expressão para o namespace dado.
ru: Находит первый подэлемент, соответствующий *match*. *match* может быть именем тега или :ref:`path <elementtree-xpath>`. Возвращает экземпляр элемента или ``None``. *namespaces* — это необязательное сопоставление префикса пространства имен с полным именем. Передайте ``''`` в качестве префикса, чтобы переместить все имена тегов без префикса в выражении в заданное пространство имен.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns a list containing all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
pt_pt: Encontra todos os sub-elementos correspondentes, por nome de etiqueta ou :ref:`caminho <elementtree-xpath>`. Devolve uma lista contendo todos os elementos correspondentes na ordem do documento. *namespaces* é um mapeamento opcional de prefixo de namespace para nome completo. Passe ``''`` como prefixo para mover todos os nomes de etiqueta não prefixados na expressão para o namespace dado.
ru: Находит все соответствующие подэлементы по имени тега или :ref:`path <elementtree-xpath>`. Возвращает список, содержащий все соответствующие элементы в порядке документа. *namespaces* — это необязательное сопоставление префикса пространства имен с полным именем. Передайте ``''`` в качестве префикса, чтобы переместить все имена тегов без префикса в выражении в заданное пространство имен.

source: Finds text for the first subelement matching *match*. *match* may be a tag name or a :ref:`path <elementtree-xpath>`. Returns the text content of the first matching element, or *default* if no element was found. Note that if the matching element has no text content an empty string is returned. *namespaces* is an optional mapping from namespace prefix to full name. Pass ``''`` as prefix to move all unprefixed tag names in the expression into the given namespace.
pt_pt: Encontra texto para o primeiro sub-elemento correspondente a *match*. *match* pode ser um nome de etiqueta ou um :ref:`caminho <elementtree-xpath>`. Devolve o conteúdo de texto do primeiro elemento correspondente, ou *default* se nenhum elemento for encontrado. Note que se o elemento correspondente não tiver conteúdo de texto, uma string vazia é devolvida. *namespaces* é um mapeamento opcional de prefixo de namespace para nome completo. Passe ``''`` como prefixo para mover todos os nomes de etiqueta não prefixados na expressão para o namespace dado.
ru: Находит текст для первого подэлемента, соответствующего *match*. *match* может быть именем тега или :ref:`path <elementtree-xpath>`. Возвращает текстовое содержимое первого совпадающего элемента или *по умолчанию*, если элемент не найден. Обратите внимание: если соответствующий элемент не имеет текстового содержимого, возвращается пустая строка. *namespaces* — это необязательное сопоставление префикса пространства имен с полным именем. Передайте ``''`` в качестве префикса, чтобы переместить все имена тегов без префикса в выражении в заданное пространство имен.

source: Inserts *subelement* at the given position in this element. Raises :exc:`TypeError` if *subelement* is not an :class:`Element`.
pt_pt: Insere *subelement* na posição dada neste elemento. Levanta :exc:`TypeError` se *subelement* não for um :class:`Element`.
ru: Вставляет *подэлемент* в заданную позицию в этом элементе. Вызывает :exc:`TypeError`, если *подэлемент* не является :class:`Element`.

source: Creates a tree :term:`iterator` with the current element as the root. The iterator iterates over this element and all elements below it, in document (depth first) order. If *tag* is not ``None`` or ``'*'``, only elements whose tag equals *tag* are returned from the iterator. If the tree structure is modified during iteration, the result is undefined.
pt_pt: Cria um :term:`iterador` de árvore com o elemento atual como raiz. O iterador itera sobre este elemento e todos os elementos abaixo dele, na ordem do documento (profundidade primeiro). Se *tag* não for ``None`` ou ``'*'``, apenas elementos cuja etiqueta seja igual a *tag* são devolvidos pelo iterador. Se a estrutura da árvore for modificada durante a iteração, o resultado é indefinido.
ru: Создает дерево :term:`iterator` с текущим элементом в качестве корня. Итератор перебирает этот элемент и все элементы ниже него в порядке документа (сначала в глубину). Если *tag* не равен ``None`` или ``'*'``, из итератора возвращаются только элементы, тег которых равен *tag*. Если древовидная структура изменяется во время итерации, результат не определен.

source: Finds all matching subelements, by tag name or :ref:`path <elementtree-xpath>`. Returns an iterable yielding all matching elements in document order. *namespaces* is an optional mapping from namespace prefix to full name.
pt_pt: Encontra todos os sub-elementos correspondentes, por nome de etiqueta ou :ref:`caminho <elementtree-xpath>`. Devolve um iterável que produz todos os elementos correspondentes na ordem do documento. *namespaces* é um mapeamento opcional de prefixo de namespace para nome completo.
ru: Находит все соответствующие подэлементы по имени тега или :ref:`path <elementtree-xpath>`. Возвращает итерацию, возвращающую все соответствующие элементы в порядке документа. *namespaces* — это необязательное сопоставление префикса пространства имен с полным именем.

source: Creates a text iterator. The iterator loops over this element and all subelements, in document order, and returns all inner text.
pt_pt: Cria um iterador de texto. O iterador percorre este elemento e todos os sub-elementos, na ordem do documento, e devolve todo o texto interno.
ru: Создает текстовый итератор. Итератор проходит по этому элементу и всем подэлементам в порядке документа и возвращает весь внутренний текст.

source: Creates a new element object of the same type as this element. Do not call this method, use the :func:`SubElement` factory function instead.
pt_pt: Cria um novo objeto de elemento do mesmo tipo que este elemento. Não chame este método, use a função de fábrica :func:`SubElement` em vez disso.
ru: Создает новый объект элемента того же типа, что и этот элемент. Не вызывайте этот метод, используйте вместо него фабричную функцию :func:`SubElement`.

source: Removes *subelement* from the element. Unlike the find\* methods this method compares elements based on the instance identity, not on tag value or contents.
pt_pt: Remove *subelement* do elemento. Ao contrário dos métodos find\*, este método compara elementos com base na identidade da instância, não no valor da etiqueta ou conteúdo.
ru: Удаляет *подэлемент* из элемента. В отличие от методов find\* этот метод сравнивает элементы на основе идентификатора экземпляра, а не значения тега или содержимого.

source: :class:`Element` objects also support the following sequence type methods for working with subelements: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.
pt_pt: Os objetos :class:`Element` também suportam os seguintes métodos de tipo de sequência para trabalhar com sub-elementos: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__len__`.
ru: Объекты :class:`Element` также поддерживают следующие методы типа последовательности для работы с подэлементами: :meth:`~object.__delitem__`, :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, : meth:`~object.__len__`.

source: Caution: Elements with no subelements will test as ``False``. In a future release of Python, all elements will test as ``True`` regardless of whether subelements exist. Instead, prefer explicit ``len(elem)`` or ``elem is not None`` tests.::
pt_pt: Cuidado: Elementos sem sub-elementos serão avaliados como ``False``. Numa futura versão do Python, todos os elementos serão avaliados como ``True`` independentemente de existirem sub-elementos. Em vez disso, prefira testes explícitos ``len(elem)`` ou ``elem is not None``.

source: element = root.find('foo') if not element: # careful! print("element not found, or element has no subelements") if element is None: print("element not found")
pt_pt: element = root.find('foo') if not element: # cuidado! print("elemento não encontrado, ou elemento não tem sub-elementos") if element is None: print("elemento não encontrado")

source: Testing the truth value of an Element emits :exc:`DeprecationWarning`.
pt_pt: Testar o valor de verdade de um Element emite :exc:`DeprecationWarning`.

source: Prior to Python 3.8, the serialisation order of the XML attributes of elements was artificially made predictable by sorting the attributes by their name. Based on the now guaranteed ordering of dicts, this arbitrary reordering was removed in Python 3.8 to preserve the order in which attributes were originally parsed or created by user code.
pt_pt: Antes do Python 3.8, a ordem de serialização dos atributos XML dos elementos era artificialmente tornada previsível ordenando os atributos pelo seu nome. Com base na ordenação agora garantida dos dicionários, esta reordenação arbitrária foi removida no Python 3.8 para preservar a ordem em que os atributos foram originalmente analisados ou criados pelo código do utilizador.
ru: До Python 3.8 порядок сериализации атрибутов XML элементов искусственно делался предсказуемым путем сортировки атрибутов по их именам. Основываясь на теперь гарантированном порядке диктовок, это произвольное переупорядочение было удалено в Python 3.8, чтобы сохранить порядок, в котором атрибуты изначально анализировались или создавались пользовательским кодом.

source: In general, user code should try not to depend on a specific ordering of attributes, given that the `XML Information Set <https://www.w3.org/TR/xml-infoset/>`_ explicitly excludes the attribute order from conveying information. Code should be prepared to deal with any ordering on input. In cases where deterministic XML output is required, e.g. for cryptographic signing or test data sets, canonical serialisation is available with the :func:`canonicalize` function.
pt_pt: Em geral, o código do utilizador não deve depender de uma ordem específica de atributos, dado que o `XML Information Set <https://www.w3.org/TR/xml-infoset/>`_ exclui explicitamente a ordem dos atributos de transmitir informação. O código deve estar preparado para lidar com qualquer ordem na entrada. Em casos em que é necessária saída XML determinística, por exemplo, para assinaturas criptográficas ou conjuntos de dados de teste, a serialização canónica está disponível com a função :func:`canonicalize`.
ru: В общем, пользовательский код должен стараться не зависеть от определенного порядка атрибутов, учитывая, что `Набор информации XML <https://www.w3.org/TR/xml-infoset/>`_ явно исключает порядок атрибутов из передающая информацию. Код должен быть готов справиться с любым упорядочиванием входных данных. В случаях, когда требуется детерминированный вывод XML, например, для криптографической подписи или наборов тестовых данных, каноническая сериализация доступна с помощью функции :func:`canonicalize`.

source: In cases where canonical output is not applicable but a specific attribute order is still desirable on output, code should aim for creating the attributes directly in the desired order, to avoid perceptual mismatches for readers of the code. In cases where this is difficult to achieve, a recipe like the following can be applied prior to serialisation to enforce an order independently from the Element creation::
pt_pt: Em casos em que a saída canónica não é aplicável, mas uma ordem específica de atributos ainda é desejável na saída, o código deve visar criar os atributos diretamente na ordem desejada, para evitar discrepâncias percetuais para os leitores do código. Em casos em que isto é difícil de alcançar, uma receita como a seguinte pode ser aplicada antes da serialização para impor uma ordem independentemente da criação do Elemento:
ru: В случаях, когда канонический вывод неприменим, но определенный порядок атрибутов по-прежнему желателен, код должен стремиться создавать атрибуты непосредственно в желаемом порядке, чтобы избежать несоответствий восприятия для читателей кода. В случаях, когда этого трудно достичь, перед сериализацией можно применить рецепт, подобный следующему, чтобы обеспечить соблюдение порядка независимо от создания Элемента:

source: def reorder_attributes(root): for el in root.iter(): attrib = el.attrib if len(attrib) > 1: # adjust attribute order, e.g. by sorting attribs = sorted(attrib.items()) attrib.clear() attrib.update(attribs)
pt_pt: def reorder_attributes(root): for el in root.iter(): attrib = el.attrib if len(attrib) > 1: # ajustar a ordem dos atributos, por exemplo, ordenando attribs = sorted(attrib.items()) attrib.clear() attrib.update(attribs)

source: ElementTree Objects
pt_pt: Objetos ElementTree
ru: Объекты ElementTree

source: ElementTree wrapper class. This class represents an entire element hierarchy, and adds some extra support for serialization to and from standard XML.
pt_pt: Classe de invólucro ElementTree. Esta classe representa uma hierarquia de elementos completa e adiciona algum suporte extra para serialização para e a partir de XML padrão.
ru: Класс-оболочка ElementTree. Этот класс представляет всю иерархию элементов и добавляет дополнительную поддержку сериализации в стандартный XML и из него.

source: *element* is the root element. The tree is initialized with the contents of the XML *file* if given.
pt_pt: *element* é o elemento raiz. A árvore é inicializada com o conteúdo do ficheiro XML *file*, se fornecido.
ru: *element* — корневой элемент. Дерево инициализируется содержимым *файла* XML, если он указан.

source: Replaces the root element for this tree. This discards the current contents of the tree, and replaces it with the given element. Use with care. *element* is an element instance.
pt_pt: Substitui o elemento raiz desta árvore. Isto descarta o conteúdo atual da árvore e substitui-o pelo elemento dado. Use com cuidado. *element* é uma instância de elemento.
ru: Заменяет корневой элемент этого дерева. При этом текущее содержимое дерева отбрасывается и заменяется данным элементом. Используйте с осторожностью. *element* — экземпляр элемента.

source: Same as :meth:`Element.find`, starting at the root of the tree.
pt_pt: Igual a :meth:`Element.find`, começando na raiz da árvore.
ru: То же, что и :meth:`Element.find`, начиная с корня дерева.

source: Same as :meth:`Element.findall`, starting at the root of the tree.
pt_pt: Igual a :meth:`Element.findall`, começando na raiz da árvore.
ru: То же, что и :meth:`Element.findall`, начиная с корня дерева.

source: Same as :meth:`Element.findtext`, starting at the root of the tree.
pt_pt: Igual a :meth:`Element.findtext`, começando na raiz da árvore.
ru: То же, что и :meth:`Element.findtext`, начиная с корня дерева.

source: Returns the root element for this tree.
pt_pt: Devolve o elemento raiz desta árvore.
ru: Возвращает корневой элемент этого дерева.

source: Creates and returns a tree iterator for the root element. The iterator loops over all elements in this tree, in section order. *tag* is the tag to look for (default is to return all elements).
pt_pt: Cria e devolve um iterador de árvore para o elemento raiz. O iterador percorre todos os elementos nesta árvore, na ordem da secção. *tag* é a etiqueta a procurar (predefinição é devolver todos os elementos).
ru: Создает и возвращает итератор дерева для корневого элемента. Итератор перебирает все элементы в этом дереве в порядке разделов. *tag* — это тег, который нужно искать (по умолчанию возвращаются все элементы).

source: Same as :meth:`Element.iterfind`, starting at the root of the tree.
pt_pt: Igual a :meth:`Element.iterfind`, começando na raiz da árvore.
ru: То же, что и :meth:`Element.iterfind`, начиная с корня дерева.
