Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.dom.minidom.po
Languages: ru, sv

source: :mod:`!xml.dom.minidom` --- Minimal DOM implementation
sv: :mod:`!xml.dom.minidom` --- Minimal DOM-implementering

source: **Source code:** :source:`Lib/xml/dom/minidom.py`
ru: **Исходный код:** :source:`Lib/xml/dom/minidom.py`
sv: **Källkod:** :source:`Lib/xml/dom/minidom.py`

source: :mod:`xml.dom.minidom` is a minimal implementation of the Document Object Model interface, with an API similar to that in other languages. It is intended to be simpler than the full DOM and also significantly smaller. Users who are not already proficient with the DOM should consider using the :mod:`xml.etree.ElementTree` module for their XML processing instead.
ru: :mod:`xml.dom.minidom` — это минимальная реализация интерфейса объектной модели документа с API, аналогичным API в других языках. Он должен быть проще, чем полный DOM, но при этом значительно меньше. Пользователям, которые еще не владеют DOM, следует вместо этого рассмотреть возможность использования модуля :mod:`xml.etree.ElementTree` для обработки XML.
sv: :mod:`xml.dom.minidom` är en minimal implementation av Document Object Model-gränssnittet, med ett API som liknar det i andra språk. Den är avsedd att vara enklare än den fullständiga DOM och också betydligt mindre. Användare som inte redan är bekanta med DOM bör överväga att använda modulen :mod:`xml.etree.ElementTree` för sin XML-bearbetning istället.

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
sv: Om du behöver analysera otillförlitliga eller oautentiserade data, se :ref:`xml-security`.

source: DOM applications typically start by parsing some XML into a DOM. With :mod:`xml.dom.minidom`, this is done through the parse functions::
ru: Приложения DOM обычно начинаются с анализа некоторого XML в DOM. В :mod:`xml.dom.minidom` это делается с помощью функций синтаксического анализа::
sv: DOM-applikationer börjar vanligtvis med att parsa XML till en DOM. Med :mod:`xml.dom.minidom` görs detta genom parse-funktionerna::

source: The :func:`parse` function can take either a filename or an open file object.
ru: Функция :func:`parse` может принимать либо имя файла, либо открытый файловый объект.
sv: Funktionen :func:`parse` kan ta emot antingen ett filnamn eller ett objekt med en öppen fil.

source: Return a :class:`Document` from the given input. *filename_or_file* may be either a file name, or a file-like object. *parser*, if given, must be a SAX2 parser object. This function will change the document handler of the parser and activate namespace support; other parser configuration (like setting an entity resolver) must have been done in advance.
ru: Вернуть :class:`Document` из заданных входных данных. *имя_файла_или_файл* может быть либо именем файла, либо объектом, подобным файлу. *parser*, если он указан, должен быть объектом анализатора SAX2. Эта функция изменит обработчик документа парсера и активирует поддержку пространства имен; другая конфигурация синтаксического анализатора (например, установка преобразователя сущностей) должна быть выполнена заранее.
sv: Returnerar ett :class:`Document` från den angivna indata. *filename_or_file* kan vara antingen ett filnamn eller ett filliknande objekt. *parser*, om det anges, måste vara ett SAX2-parserobjekt. Denna funktion kommer att ändra dokumenthanteraren i parsern och aktivera namnrymdsstöd; annan parserkonfiguration (som att ställa in en entitetsresolver) måste ha gjorts i förväg.

source: If you have XML in a string, you can use the :func:`parseString` function instead:
ru: Если у вас есть XML в строке, вы можете вместо этого использовать функцию :func:`parseString`:
sv: Om du har XML i en sträng kan du använda funktionen :func:`parseString` istället:

source: Return a :class:`Document` that represents the *string*. This method creates an :class:`io.StringIO` object for the string and passes that on to :func:`parse`.
ru: Возвращает :class:`Document`, который представляет *строку*. Этот метод создает объект :class:`io.StringIO` для строки и передает его :func:`parse`.
sv: Returnerar ett :class:`Document` som representerar *strängen*. Den här metoden skapar ett :class:`io.StringIO`\-objekt för strängen och skickar det vidare till :func:`parse`.

source: Both functions return a :class:`Document` object representing the content of the document.
ru: Обе функции возвращают объект :class:`Document`, представляющий содержимое документа.
sv: Båda funktionerna returnerar ett :class:`Document`\-objekt som representerar innehållet i dokumentet.

source: What the :func:`parse` and :func:`parseString` functions do is connect an XML parser with a "DOM builder" that can accept parse events from any SAX parser and convert them into a DOM tree. The name of the functions are perhaps misleading, but are easy to grasp when learning the interfaces. The parsing of the document will be completed before these functions return; it's simply that these functions do not provide a parser implementation themselves.
ru: Функции :func:`parse` и :func:`parseString` соединяют анализатор XML с «построителем DOM», который может принимать события анализа от любого анализатора SAX и преобразовывать их в дерево DOM. Названия функций, возможно, вводят в заблуждение, но их легко понять при изучении интерфейсов. Анализ документа будет завершен до того, как эти функции вернутся; просто эти функции сами по себе не обеспечивают реализацию синтаксического анализатора.
sv: Funktionerna :func:`parse` och :func:`parseString` kopplar samman en XML-parser med en "DOM-byggare" som kan ta emot parse-händelser från vilken SAX-parser som helst och konvertera dem till ett DOM-träd. Namnet på funktionerna är kanske missvisande, men är lätta att förstå när man lär sig gränssnitten. Parsningen av dokumentet kommer att vara klar innan dessa funktioner returneras; det är helt enkelt så att dessa funktioner inte själva tillhandahåller en parserimplementation.

source: You can also create a :class:`Document` by calling a method on a "DOM Implementation" object. You can get this object either by calling the :func:`getDOMImplementation` function in the :mod:`xml.dom` package or the :mod:`xml.dom.minidom` module. Once you have a :class:`Document`, you can add child nodes to it to populate the DOM::
ru: Вы также можете создать :class:`Document`, вызвав метод объекта «Реализация DOM». Вы можете получить этот объект, вызвав функцию :func:`getDOMImplementation` в пакете :mod:`xml.dom` или модуль :mod:`xml.dom.minidom`. Если у вас есть :class:`Document`, вы можете добавить к нему дочерние узлы для заполнения DOM::
sv: Du kan också skapa en :class:`Document` genom att anropa en metod på ett "DOM Implementation"-objekt. Du kan få detta objekt antingen genom att anropa funktionen :func:`getDOMImplementation` i paketet :mod:`xml.dom` eller modulen :mod:`xml.dom.minidom`. När du har en :class:`Document`, kan du lägga till underordnade noder till den för att fylla DOM::

source: from xml.dom.minidom import getDOMImplementation impl = getDOMImplementation() newdoc = impl.createDocument(None, "some_tag", None) top_element = newdoc.documentElement text = newdoc.createTextNode('Some textual content.') top_element.appendChild(text)
sv: från xml.dom.minidom import getDOMImplementation impl = getDOMImplementation() newdoc = impl.createDocument(None, "some_tag", None) top_element = newdoc.documentElement text = newdoc.createTextNode("Något textinnehåll.") top_element.appendChild(text)

source: Once you have a DOM document object, you can access the parts of your XML document through its properties and methods. These properties are defined in the DOM specification. The main property of the document object is the :attr:`documentElement` property. It gives you the main element in the XML document: the one that holds all others. Here is an example program::
ru: Если у вас есть объект документа DOM, вы можете получить доступ к частям вашего XML-документа через его свойства и методы. Эти свойства определены в спецификации DOM. Основным свойством объекта документа является свойство :attr:`documentElement`. Он дает вам основной элемент XML-документа: тот, который содержит все остальные. Вот пример программы::
sv: När du har ett DOM-dokumentobjekt kan du komma åt delarna av ditt XML-dokument genom dess egenskaper och metoder. Dessa egenskaper definieras i DOM-specifikationen. Den viktigaste egenskapen hos dokumentobjektet är egenskapen :attr:`documentElement`. Den ger dig huvudelementet i XML-dokumentet: det som innehåller alla andra. Här är ett exempel på ett program::

source: dom3 = parseString("<myxml>Some data</myxml>") assert dom3.documentElement.tagName == "myxml"
sv: dom3 = parseString(<myxml>"Några data</myxml>") assert dom3.documentElement.tagName == "myxml"

source: When you are finished with a DOM tree, you may optionally call the :meth:`unlink` method to encourage early cleanup of the now-unneeded objects. :meth:`unlink` is an :mod:`xml.dom.minidom`\ -specific extension to the DOM API that renders the node and its descendants essentially useless. Otherwise, Python's garbage collector will eventually take care of the objects in the tree.
ru: Когда вы закончите работу с деревом DOM, вы можете при желании вызвать метод :meth:`unlink`, чтобы стимулировать раннюю очистку теперь ненужных объектов. :meth:`unlink` — это :mod:`xml.dom.minidom`\ расширение DOM API, которое делает узел и его потомков практически бесполезными. В противном случае сборщик мусора Python в конечном итоге позаботится об объектах в дереве.
sv: När du är klar med ett DOM-träd kan du eventuellt anropa metoden :meth:`unlink` för att uppmuntra tidig upprensning av de nu obehövliga objekten. :meth:`unlink` är ett :mod:`xml.dom.minidom`\-specifikt tillägg till DOM API som gör noden och dess ättlingar i huvudsak värdelösa. Annars kommer Pythons skräpsamlare så småningom att ta hand om objekten i trädet.

source: `Document Object Model (DOM) Level 1 Specification <https://www.w3.org/TR/REC-DOM-Level-1/>`_
ru: `Спецификация объектной модели документа (DOM) уровня 1 <https://www.w3.org/TR/REC-DOM-Level-1/>`_
sv: `Dokumentobjektmodell (DOM) Nivå 1-specifikation <https://www.w3.org/TR/REC-DOM-Level-1/>`_

source: The W3C recommendation for the DOM supported by :mod:`xml.dom.minidom`.
ru: Рекомендация W3C для DOM, поддерживаемая :mod:`xml.dom.minidom`.
sv: W3C:s rekommendation för DOM som stöds av :mod:`xml.dom.minidom`.

source: DOM Objects
ru: Объекты DOM
sv: DOM-objekt

source: The definition of the DOM API for Python is given as part of the :mod:`xml.dom` module documentation. This section lists the differences between the API and :mod:`xml.dom.minidom`.
ru: Определение DOM API для Python приведено в документации модуля :mod:`xml.dom`. В этом разделе перечислены различия между API и :mod:`xml.dom.minidom`.
sv: Definitionen av DOM API för Python ges som en del av moduldokumentationen för :mod:`xml.dom`. I detta avsnitt listas skillnaderna mellan API:et och :mod:`xml.dom.minidom`.

source: Break internal references within the DOM so that it will be garbage collected on versions of Python without cyclic GC. Even when cyclic GC is available, using this can make large amounts of memory available sooner, so calling this on DOM objects as soon as they are no longer needed is good practice. This only needs to be called on the :class:`Document` object, but may be called on child nodes to discard children of that node.
ru: Разрушьте внутренние ссылки внутри DOM, чтобы в версиях Python без циклического сбора мусора выполнялась сборка мусора. Даже когда циклический сборщик мусора доступен, его использование может сделать большие объемы памяти доступными раньше, поэтому хорошей практикой является вызов этого метода для объектов DOM, как только они больше не нужны. Это необходимо вызывать только для объекта :class:`Document`, но можно вызывать и для дочерних узлов, чтобы отбросить дочерние элементы этого узла.
sv: Bryter interna referenser inom DOM så att det kommer att samlas in på versioner av Python utan cyklisk GC. Även när cyklisk GC är tillgänglig kan användningen av detta göra stora mängder minne tillgängligt tidigare, så att anropa detta på DOM-objekt så snart de inte längre behövs är god praxis. Detta behöver bara anropas på :class:`Document`\-objektet, men kan anropas på underordnade noder för att kasta bort barn till den noden.

source: You can avoid calling this method explicitly by using the :keyword:`with` statement. The following code will automatically unlink *dom* when the :keyword:`!with` block is exited::
ru: Вы можете избежать явного вызова этого метода, используя оператор :keyword:`with`. Следующий код автоматически отключит *dom* при выходе из блока :keyword:`!with`::
sv: Du kan undvika att anropa denna metod explicit genom att använda :keyword:`with`\-satsen. Följande kod kommer automatiskt att avlänka *dom* när :keyword:`!with`\-blocket avslutas::

source: with xml.dom.minidom.parse(datasource) as dom: ... # Work with dom.
sv: med xml.dom.minidom.parse(datasource) som dom: ... # Arbeta med dom.

source: Write XML to the writer object. The writer receives texts but not bytes as input, it should have a :meth:`write` method which matches that of the file object interface. The *indent* parameter is the indentation of the current node. The *addindent* parameter is the incremental indentation to use for subnodes of the current one. The *newl* parameter specifies the string to use to terminate newlines.
ru: Запишите XML в объект записи. Модуль записи получает на вход тексты, а не байты, он должен иметь метод :meth:`write`, соответствующий методу интерфейса файлового объекта. Параметр *indent* определяет отступ текущего узла. Параметр *addindent* — это добавочный отступ, используемый для подузлов текущего. Параметр *newl* указывает строку, которая будет использоваться для завершения новой строки.
sv: Skriv XML till writer-objektet. Skrivaren tar emot texter men inte bytes som indata, den bör ha en :meth:`write`\-metod som matchar den för filobjektets gränssnitt. Parametern *indent* är indenteringen för den aktuella noden. Parametern *addindent* är den inkrementella indragning som ska användas för undernoder till den aktuella noden. Parametern *newl* anger den sträng som ska användas för att avsluta nya linjer.

source: For the :class:`Document` node, an additional keyword argument *encoding* can be used to specify the encoding field of the XML header.
ru: Для узла :class:`Document` дополнительный аргумент ключевого слова *encoding* может использоваться для указания поля кодировки заголовка XML.
sv: För :class:`Document`\-noden kan ett ytterligare nyckelordsargument *encoding* användas för att ange kodningsfältet i XML-huvudet.

source: Similarly, explicitly stating the *standalone* argument causes the standalone document declarations to be added to the prologue of the XML document. If the value is set to ``True``, ``standalone="yes"`` is added, otherwise it is set to ``"no"``. Not stating the argument will omit the declaration from the document.
ru: Аналогично, явное указание аргумента *standalone* приводит к добавлению объявлений автономного документа в пролог XML-документа. Если для значения установлено ``True``, добавляется ``standalone="yes"``, в противном случае ему присваивается ``"no"``. Если не указать аргумент, декларация будет исключена из документа.
sv: På samma sätt leder en explicit angivelse av argumentet *standalone* till att deklarationerna för det fristående dokumentet läggs till i XML-dokumentets prolog. Om värdet är satt till ``True``, läggs ``standalone="yes"`` till, annars sätts det till ``"no"``. Om argumentet inte anges kommer deklarationen att utelämnas från dokumentet.

source: The :meth:`writexml` method now preserves the attribute order specified by the user.
ru: Метод :meth:`writexml` теперь сохраняет порядок атрибутов, указанный пользователем.
sv: Metoden :meth:`writexml` bevarar nu den attributordning som anges av användaren.

source: The *standalone* parameter was added.
ru: Добавлен параметр *standalone*.
sv: Parametern *standalone* har lagts till.

source: Return a string or byte string containing the XML represented by the DOM node.
ru: Возвращает строку или строку байтов, содержащую XML, представленный узлом DOM.
sv: Returnerar en sträng eller byte-sträng som innehåller den XML som representeras av DOM-noden.

source: With an explicit *encoding* [1]_ argument, the result is a byte string in the specified encoding. With no *encoding* argument, the result is a Unicode string, and the XML declaration in the resulting string does not specify an encoding. Encoding this string in an encoding other than UTF-8 is likely incorrect, since UTF-8 is the default encoding of XML.
ru: С явной *кодировкой* [1]_ аргумент, результатом является байтовая строка в указанной кодировке. Без аргумента *encoding* результатом является строка в Юникоде, а объявление XML в результирующей строке не указывает кодировку. Кодирование этой строки в кодировке, отличной от UTF-8, скорее всего, неверно, поскольку UTF-8 является кодировкой XML по умолчанию.
sv: Med ett explicit *encoding* [1]_-argument blir resultatet en byte-sträng i den angivna kodningen. Utan argumentet *encoding* blir resultatet en Unicode-sträng och XML-deklarationen i den resulterande strängen anger inte någon kodning. Att koda denna sträng i en annan kodning än UTF-8 är troligen felaktigt, eftersom UTF-8 är standardkodningen för XML.

source: The *standalone* argument behaves exactly as in :meth:`writexml`.
ru: Аргумент *standalone* ведет себя точно так же, как в :meth:`writexml`.
sv: Argumentet *standalone* beter sig exakt som i :meth:`writexml`.

source: The :meth:`toxml` method now preserves the attribute order specified by the user.
ru: Метод :meth:`toxml` теперь сохраняет порядок атрибутов, указанный пользователем.
sv: Metoden :meth:`toxml` bevarar nu den attributordning som anges av användaren.

source: Return a pretty-printed version of the document. *indent* specifies the indentation string and defaults to a tabulator; *newl* specifies the string emitted at the end of each line and defaults to ``\n``.
ru: Верните красиво напечатанную версию документа. *indent* определяет строку отступа и по умолчанию представляет собой табулятор; *newl* определяет строку, выдаваемую в конце каждой строки, и по умолчанию имеет значение ``\n``.
sv: Returnerar en vackert utskriven version av dokumentet. *indent* anger indragningssträngen och standardvärdet är en tabulator; *newl* anger strängen som visas i slutet av varje rad och standardvärdet är ``n``.

source: The *encoding* argument behaves like the corresponding argument of :meth:`toxml`.
ru: Аргумент *encoding* ведет себя как соответствующий аргумент :meth:`toxml`.
sv: Argumentet *encoding* beter sig som motsvarande argument i :meth:`toxml`.

source: The :meth:`toprettyxml` method now preserves the attribute order specified by the user.
ru: Метод :meth:`toprettyxml` теперь сохраняет порядок атрибутов, указанный пользователем.
sv: Metoden :meth:`toprettyxml` bevarar nu den attributordning som anges av användaren.

source: DOM Example
ru: Пример DOM
sv: DOM-exempel

source: This example program is a fairly realistic example of a simple program. In this particular case, we do not take much advantage of the flexibility of the DOM.
ru: Этот пример программы представляет собой довольно реалистичный пример простой программы. В данном конкретном случае мы не особо пользуемся гибкостью DOM.
sv: Detta exempelprogram är ett ganska realistiskt exempel på ett enkelt program. I det här fallet utnyttjar vi inte DOM:s flexibilitet särskilt mycket.

source: minidom and the DOM standard
ru: minidom и стандарт DOM
sv: minidom och DOM-standarden

source: The :mod:`xml.dom.minidom` module is essentially a DOM 1.0-compatible DOM with some DOM 2 features (primarily namespace features).
ru: Модуль :mod:`xml.dom.minidom` по сути представляет собой DOM, совместимый с DOM 1.0, с некоторыми функциями DOM 2 (в основном функциями пространства имен).
sv: Modulen :mod:`xml.dom.minidom` är i huvudsak en DOM 1.0-kompatibel DOM med vissa DOM 2-egenskaper (främst namnrymdsfunktioner).

source: Usage of the DOM interface in Python is straight-forward. The following mapping rules apply:
ru: Использование интерфейса DOM в Python очень просто. Применяются следующие правила сопоставления:
sv: Användningen av DOM-gränssnittet i Python är enkel. Följande mappningsregler gäller:

source: Interfaces are accessed through instance objects. Applications should not instantiate the classes themselves; they should use the creator functions available on the :class:`Document` object. Derived interfaces support all operations (and attributes) from the base interfaces, plus any new operations.
ru: Доступ к интерфейсам осуществляется через объекты экземпляра. Приложения не должны создавать экземпляры самих классов; им следует использовать функции создателя, доступные в объекте :class:`Document`. Производные интерфейсы поддерживают все операции (и атрибуты) базовых интерфейсов, а также любые новые операции.
sv: Gränssnitt nås via instansobjekt. Program bör inte instansiera klasserna själva, utan använda de skapande funktioner som finns tillgängliga på :class:`Document`\-objektet. Härledda gränssnitt stöder alla operationer (och attribut) från basgränssnitten, plus eventuella nya operationer.

source: Operations are used as methods. Since the DOM uses only :keyword:`in` parameters, the arguments are passed in normal order (from left to right). There are no optional arguments. ``void`` operations return ``None``.
ru: В качестве методов используются операции. Поскольку DOM использует только параметры :keyword:`in`, аргументы передаются в обычном порядке (слева направо). Необязательных аргументов нет. Операции ``void`` возвращают ``None``.
sv: Operationer används som metoder. Eftersom DOM endast använder :keyword:`in`\-parametrar, skickas argumenten i normal ordning (från vänster till höger). Det finns inga valfria argument. ``void`` operationer returnerar ``None``.

source: IDL attributes map to instance attributes. For compatibility with the OMG IDL language mapping for Python, an attribute ``foo`` can also be accessed through accessor methods :meth:`_get_foo` and :meth:`_set_foo`. ``readonly`` attributes must not be changed; this is not enforced at runtime.
ru: Атрибуты IDL сопоставляются с атрибутами экземпляра. Для совместимости с отображением языка IDL OMG для Python к атрибуту ``foo`` также можно получить доступ через методы доступа :meth:`_get_foo` и :meth:`_set_foo`. Атрибуты ``readonly`` не должны быть изменены; это не применяется во время выполнения.
sv: IDL-attribut mappas till instansattribut. För kompatibilitet med OMG IDL-språkmappningen för Python kan ett attribut ``foo`` också nås via accessormetoderna :meth:`_get_foo` och :meth:`_set_foo`. ``Readonly``\-attribut får inte ändras; detta verkställs inte vid körning.

source: The types ``short int``, ``unsigned int``, ``unsigned long long``, and ``boolean`` all map to Python integer objects.
ru: Типы short int, unsigned int, unsigned long long и boolean соответствуют целочисленным объектам Python.
sv: Typerna ``short int``, ``unsigned int``, ``unsigned long long`` och ``boolean`` mappar alla till Python integer-objekt.
