Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.sax.reader.po
Languages: ru, sv

source: The SAX parser will ignore this if there is also a character stream specified, but it will use a byte stream in preference to opening a URI connection itself.
ru: Анализатор SAX проигнорирует это, если также указан поток символов, но он будет использовать поток байтов вместо открытия самого соединения URI.
sv: SAX-parsern ignorerar detta om det också finns en teckenström angiven, men den kommer att använda en byte-ström i stället för att öppna en URI-anslutning själv.

source: If the application knows the character encoding of the byte stream, it should set it with the setEncoding method.
ru: Если приложению известна кодировка символов потока байтов, оно должно установить ее с помощью метода setEncoding.
sv: Om applikationen känner till teckenkodningen för byteströmmen bör den ange den med metoden setEncoding.

source: Get the byte stream for this input source.
ru: Получите поток байтов для этого источника входных данных.
sv: Hämta byte-strömmen för denna inmatningskälla.

source: The getEncoding method will return the character encoding for this byte stream, or ``None`` if unknown.
ru: Метод getEncoding вернет кодировку символов для этого потока байтов или None, если она неизвестна.
sv: Metoden getEncoding returnerar teckenkodningen för denna byte-ström, eller ``None`` om den är okänd.

source: Set the character stream (a :term:`text file`) for this input source.
ru: Установите поток символов (текстовый файл) для этого источника ввода.
sv: Ange teckenflödet (en :term:`textfil`) för denna inmatningskälla.

source: If there is a character stream specified, the SAX parser will ignore any byte stream and will not attempt to open a URI connection to the system identifier.
ru: Если указан поток символов, анализатор SAX будет игнорировать любой поток байтов и не будет пытаться открыть соединение URI с системным идентификатором.
sv: Om en teckenström anges kommer SAX-parsern att ignorera eventuella byteflöden och inte försöka öppna en URI-anslutning till systemidentifieraren.

source: Get the character stream for this input source.
ru: Получите поток символов для этого источника ввода.
sv: Hämta teckenströmmen för denna inmatningskälla.

source: The :class:`Attributes` Interface
ru: Интерфейс :class:`Attributes`
sv: Gränssnittet :class:`Attributes`

source: :class:`Attributes` objects implement a portion of the :term:`mapping protocol <mapping>`, including the methods :meth:`~collections.abc.Mapping.copy`, :meth:`~collections.abc.Mapping.get`, :meth:`~object.__contains__`, :meth:`~collections.abc.Mapping.items`, :meth:`~collections.abc.Mapping.keys`, and :meth:`~collections.abc.Mapping.values`. The following methods are also provided:
ru: Объекты :class:`Attributes` реализуют часть :term:`протокола сопоставления <mapping>`, включая методы :meth:`~collections.abc.Mapping.copy`, :meth:`~collections.abc.Mapping` .get`, :meth:`~object.__contains__`, :meth:`~collections.abc.Mapping.items`, :meth:`~collections.abc.Mapping.keys` и :meth:`~collections. abc.Mapping.values`. Также предусмотрены следующие методы:
sv: :class:`Attributes`\-objekt implementerar en del av :term:`mapping-protokollet <mapping>`, inklusive metoderna :meth:`~collections.abc.Mapping.copy`, :meth:`~collections.abc.Mapping.get`, :meth:`~object.__contains__`, :meth:`~collections.abc.Mapping.items`, :meth:`~collections.abc.Mapping.keys`, och :meth:`~collections.abc.Mapping.values`. Följande metoder tillhandahålls också:

source: Return the number of attributes.
ru: Возвращает количество атрибутов.
sv: Returnera antalet attribut.

source: Return the names of the attributes.
ru: Верните имена атрибутов.
sv: Returnerar namnen på attributen.

source: Returns the type of the attribute *name*, which is normally ``'CDATA'``.
ru: Возвращает тип атрибута *name*, обычно ``'CDATA'``.
sv: Returnerar typen av attributet *name*, som normalt är ``'CDATA'``.

source: Return the value of attribute *name*.
ru: Верните значение атрибута *name*.
sv: Returnera värdet för attributet *name*.

source: The :class:`AttributesNS` Interface
ru: Интерфейс :class:`AttributesNS`
sv: Gränssnittet :class:`AttributesNS`

source: This interface is a subtype of the :class:`Attributes` interface (see section :ref:`attributes-objects`). All methods supported by that interface are also available on :class:`AttributesNS` objects.
ru: Этот интерфейс является подтипом интерфейса :class:`Attributes` (см. раздел :ref:`attributes-objects`). Все методы, поддерживаемые этим интерфейсом, также доступны в объектах :class:`AttributesNS`.
sv: Detta gränssnitt är en subtyp av gränssnittet :class:`Attributes` (se avsnitt :ref:`attributes-objects`). Alla metoder som stöds av det gränssnittet är också tillgängliga på :class:`AttributesNS`\-objekt.

source: The following methods are also available:
ru: Также доступны следующие методы:
sv: Följande metoder är också tillgängliga:

source: Return the value for a qualified name.
ru: Верните значение для уточненного имени.
sv: Returnera värdet för ett kvalificerat namn.

source: Return the ``(namespace, localname)`` pair for a qualified *name*.
ru: Верните пару ``(namespace, localname)`` для квалифицированного *name*.
sv: Returnerar paret ``(namespace, localname)`` för ett kvalificerat *namn*.

source: Return the qualified name for a ``(namespace, localname)`` pair.
ru: Возвращает полное имя для пары ``(namespace, localname)``.
sv: Returnerar det kvalificerade namnet för ett par ``(namespace, localname)``.

source: Return the qualified names of all attributes.
ru: Верните полные имена всех атрибутов.
sv: Returnerar de kvalificerade namnen på alla attribut.
