Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.etree.elementtree.po
Languages: pt_pt, ru

source: >>> from xml.etree.ElementTree import XMLParser >>> class MaxDepth: # The target object of the parser ... maxDepth = 0 ... depth = 0 ... def start(self, tag, attrib): # Called for each opening tag. ... self.depth += 1 ... if self.depth > self.maxDepth: ... self.maxDepth = self.depth ... def end(self, tag): # Called for each closing tag. ... self.depth -= 1 ... def data(self, data): ... pass # We do not need to do anything with data. ... def close(self): # Called when all data has been parsed. ... return self.maxDepth ... >>> target = MaxDepth() >>> parser = XMLParser(target=target) >>> exampleXml = """ ... <a> ... <b> ... </b> ... <b> ... <c> ... <d> ... </d> ... </c> ... </b> ... </a>""" >>> parser.feed(exampleXml) >>> parser.close() 4
pt_pt: >>> from xml.etree.ElementTree import XMLParser >>> class MaxDepth: # O objeto alvo do analisador ... maxDepth = 0 ... depth = 0 ... def start(self, tag, attrib): # Chamado para cada etiqueta de abertura. ... self.depth += 1 ... if self.depth > self.maxDepth: ... self.maxDepth = self.depth ... def end(self, tag): # Chamado para cada etiqueta de fecho. ... self.depth -= 1 ... def data(self, data): ... pass # Não precisamos de fazer nada com os dados. ... def close(self): # Chamado quando todos os dados foram analisados. ... return self.maxDepth ... >>> target = MaxDepth() >>> parser = XMLParser(target=target) >>> exampleXml = """ ... <a> ... <b> ... </b> ... <b> ... <c> ... <d> ... </d> ... </c> ... </b> ... </a>""" >>> parser.feed(exampleXml) >>> parser.close() 4

source: XMLPullParser Objects
pt_pt: Objetos XMLPullParser
ru: Объекты XMLPullParser

source: A pull parser suitable for non-blocking applications. Its input-side API is similar to that of :class:`XMLParser`, but instead of pushing calls to a callback target, :class:`XMLPullParser` collects an internal list of parsing events and lets the user read from it. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported.
pt_pt: Um analisador pull adequado para aplicações não bloqueantes. A sua API de entrada é semelhante à de :class:`XMLParser`, mas em vez de enviar chamadas para um alvo de callback, :class:`XMLPullParser` recolhe uma lista interna de eventos de análise e permite que o utilizador leia a partir dela. *events* é uma sequência de eventos a relatar. Os eventos suportados são as strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` e ``"end-ns"`` (os eventos "ns" são usados para obter informações detalhadas de namespace). Se *events* for omitido, apenas os eventos ``"end"`` são relatados.
ru: Анализатор pull, подходящий для неблокирующих приложений. Его API на стороне ввода аналогичен API :class:`XMLParser`, но вместо отправки вызовов к цели обратного вызова :class:`XMLPullParser` собирает внутренний список событий синтаксического анализа и позволяет пользователю читать его. *events* — это последовательность событий, о которых необходимо сообщить. Поддерживаемые события — это строки ``"start", ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` и `` "end-ns"`` (события "ns" используются для получения подробной информации о пространстве имен). Если *events* опущено, сообщается только о ``конечных'` событиях.

source: Feed the given bytes data to the parser.
pt_pt: Alimenta os dados de bytes dados para o analisador.
ru: Передайте данные в байтах синтаксическому анализатору.

source: Signal the parser that the data stream is terminated. Unlike :meth:`XMLParser.close`, this method always returns :const:`None`. Any events not yet retrieved when the parser is closed can still be read with :meth:`read_events`.
pt_pt: Sinaliza ao analisador que o fluxo de dados foi terminado. Ao contrário de :meth:`XMLParser.close`, este método devolve sempre :const:`None`. Quaisquer eventos ainda não recuperados quando o analisador é fechado ainda podem ser lidos com :meth:`read_events`.
ru: Сообщите синтаксическому анализатору, что поток данных прекращен. В отличие от :meth:`XMLParser.close`, этот метод всегда возвращает :const:`None`. Любые события, которые еще не получены при закрытии парсера, все равно можно прочитать с помощью :meth:`read_events`.

source: Return an iterator over the events which have been encountered in the data fed to the parser. The iterator yields ``(event, elem)`` pairs, where *event* is a string representing the type of event (e.g. ``"end"``) and *elem* is the encountered :class:`Element` object, or other context value as follows.
pt_pt: Devolve um iterador sobre os eventos que foram encontrados nos dados alimentados para o analisador. O iterador produz pares ``(event, elem)``, onde *event* é uma string representando o tipo de evento (por exemplo, ``"end"``) e *elem* é o objeto :class:`Element` encontrado, ou outro valor de contexto como se segue.
ru: Возвращает итератор для событий, которые были обнаружены в данных, переданных в анализатор. Итератор выдает пары ``(event, elem)``, где *event* — это строка, представляющая тип события (например, ``"end"``), а *elem* — обнаруженный объект :class:`Element`. или другое значение контекста следующим образом.

source: ``start``, ``end``: the current Element.
pt_pt: ``start``, ``end``: o Element atual.
ru: ``start``, ``end``: текущий элемент.

source: ``comment``, ``pi``: the current comment / processing instruction
pt_pt: ``comment``, ``pi``: o comentário / instrução de processamento atual
ru: ``комментарий``, ``pi``: текущий комментарий/инструкция обработки.

source: ``start-ns``: a tuple ``(prefix, uri)`` naming the declared namespace mapping.
pt_pt: ``start-ns``: um tuplo ``(prefix, uri)`` que nomeia o mapeamento de namespace declarado.
ru: ``start-ns``: кортеж ``(prefix, uri)``, называющий объявленное отображение пространства имен.

source: ``end-ns``: :const:`None` (this may change in a future version)
pt_pt: ``end-ns``: :const:`None` (isto pode mudar numa versão futura)
ru: ``end-ns``: :const:`None` (это может измениться в будущей версии)

source: Events provided in a previous call to :meth:`read_events` will not be yielded again. Events are consumed from the internal queue only when they are retrieved from the iterator, so multiple readers iterating in parallel over iterators obtained from :meth:`read_events` will have unpredictable results.
pt_pt: Os eventos fornecidos numa chamada anterior a :meth:`read_events` não serão produzidos novamente. Os eventos são consumidos da fila interna apenas quando são recuperados do iterador, por isso vários leitores a iterar em paralelo sobre iteradores obtidos de :meth:`read_events` terão resultados imprevisíveis.
ru: События, предоставленные при предыдущем вызове :meth:`read_events`, больше не будут выдаваться. События потребляются из внутренней очереди только тогда, когда они извлекаются из итератора, поэтому несколько читателей, параллельно перебирающих итераторы, полученные из :meth:`read_events`, будут иметь непредсказуемые результаты.

source: :class:`XMLPullParser` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
pt_pt: :class:`XMLPullParser` garante apenas que viu o carácter ">" de uma etiqueta de início quando emite um evento "start", por isso os atributos estão definidos, mas o conteúdo dos atributos de texto e cauda estão indefinidos nesse ponto. O mesmo se aplica aos filhos do elemento; podem ou não estar presentes.
ru: :class:`XMLPullParser` гарантирует, что он увидел символ ">" начального тега только тогда, когда генерирует событие "start", поэтому атрибуты определены, но содержимое атрибутов text и Tail в этот момент не определено. . То же самое относится и к дочерним элементам; они могут присутствовать, а могут и не присутствовать.

source: Exceptions
pt_pt: Exceções
ru: Исключения

source: XML parse error, raised by the various parsing methods in this module when parsing fails. The string representation of an instance of this exception will contain a user-friendly error message. In addition, it will have the following attributes available:
pt_pt: Erro de análise XML, levantado pelos vários métodos de análise neste módulo quando a análise falha. A representação em string de uma instância desta exceção conterá uma mensagem de erro amigável. Além disso, terá os seguintes atributos disponíveis:
ru: Ошибка синтаксического анализа XML, вызываемая различными методами синтаксического анализа в этом модуле при сбое синтаксического анализа. Строковое представление экземпляра этого исключения будет содержать понятное пользователю сообщение об ошибке. Кроме того, ему будут доступны следующие атрибуты:

source: A numeric error code from the expat parser. See the documentation of :mod:`xml.parsers.expat` for the list of error codes and their meanings.
pt_pt: Um código de erro numérico do analisador expat. Consulte a documentação de :mod:`xml.parsers.expat` para a lista de códigos de erro e os seus significados.
ru: Числовой код ошибки из парсера экспатов. См. документацию :mod:`xml.parsers.expat` для получения списка кодов ошибок и их значений.

source: A tuple of *line*, *column* numbers, specifying where the error occurred.
pt_pt: Um tuplo de números de *linha* e *coluna*, especificando onde ocorreu o erro.
ru: Кортеж номеров *строки* и *столбца*, указывающий, где произошла ошибка.

source: Footnotes
pt_pt: Notas de rodapé
ru: Сноски

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
pt_pt: A string de codificação incluída na saída XML deve estar em conformidade com os padrões apropriados. Por exemplo, "UTF-8" é válido, mas "UTF8" não é. Consulte https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl e https://www.iana.org/assignments/character-sets/character-sets.xhtml.
ru: Строка кодирования, включенная в выходные данные XML, должна соответствовать соответствующим стандартам. Например, «UTF-8» допустим, а «UTF8» — нет. См. https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl и https://www.iana.org/assignments/character-sets/character-sets.xhtml.

source: The :mod:`xml.etree.ElementTree` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
ru: Модуль :mod:`xml.etree.ElementTree` не защищен от вредоносно созданных данных. Если вам нужно проанализировать ненадежные или неаутентифицированные данные, см. :ref:`xml-vulnerabilities`.

source: Tutorial
ru: Руководство

source: Children are nested, and we can access specific child nodes by index::
ru: Дочерние узлы вложены, и мы можем получить доступ к определенным дочерним узлам по индексу::

source: Parses an XML section into an element tree incrementally, and reports what's going on to the user. *source* is a filename or :term:`file object` containing XML data. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. *parser* must be a subclass of :class:`XMLParser` and can only use the default :class:`TreeBuilder` as a target. Returns an :term:`iterator` providing ``(event, elem)`` pairs; it has a ``root`` attribute that references the root element of the resulting XML tree once *source* is fully read.
ru: Постепенно анализирует раздел XML в дереве элементов и сообщает пользователю, что происходит. *source* — это имя файла или :term:`файловый объект`, содержащий данные XML. *events* — это последовательность событий, о которых необходимо сообщить. Поддерживаемые события — это строки ``"start", ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` и `` "end-ns"`` (события "ns" используются для получения подробной информации о пространстве имен). Если *events* опущено, сообщается только о ``конечных'` событиях. *parser* — необязательный экземпляр синтаксического анализатора. Если не указано, используется стандартный парсер :class:`XMLParser`. *parser* должен быть подклассом :class:`XMLParser` и может использовать в качестве цели только :class:`TreeBuilder` по умолчанию. Возвращает :term:`итератор`, предоставляющий пары ``(event, elem)``; у него есть атрибут root, который ссылается на корневой элемент результирующего XML-дерева после полного чтения *source*.

source: Parses an XML section into an element tree. *source* is a filename or file object containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`ElementTree` instance.
ru: Анализирует раздел XML в дереве элементов. *source* — это имя файла или файловый объект, содержащий данные XML. *parser* — необязательный экземпляр синтаксического анализатора. Если не указано, используется стандартный парсер :class:`XMLParser`. Возвращает экземпляр :class:`ElementTree`.
