Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xml.dom.pulldom.po
Languages: ru

source: **Source code:** :source:`Lib/xml/dom/pulldom.py`
ru: **Исходный код:** :source:`Lib/xml/dom/pulldom.py`

source: The :mod:`xml.dom.pulldom` module provides a "pull parser" which can also be asked to produce DOM-accessible fragments of the document where necessary. The basic concept involves pulling "events" from a stream of incoming XML and processing them. In contrast to SAX which also employs an event-driven processing model together with callbacks, the user of a pull parser is responsible for explicitly pulling events from the stream, looping over those events until either processing is finished or an error condition occurs.
ru: Модуль :mod:`xml.dom.pulldom` предоставляет «анализатор извлечения», который также может быть запрошен для создания доступных для DOM фрагментов документа, где это необходимо. Основная концепция предполагает извлечение «событий» из потока входящего XML и их обработку. В отличие от SAX, который также использует модель обработки, управляемую событиями, вместе с обратными вызовами, пользователь анализатора pull несет ответственность за явное извлечение событий из потока, циклически обрабатывая эти события до тех пор, пока обработка не завершится или не возникнет ошибка.

source: The :mod:`xml.dom.pulldom` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
ru: Модуль :mod:`xml.dom.pulldom` не защищен от вредоносно созданных данных. Если вам нужно проанализировать ненадежные или неаутентифицированные данные, см. :ref:`xml-vulnerabilities`.

source: The SAX parser no longer processes general external entities by default to increase security by default. To enable processing of external entities, pass a custom parser instance in::
ru: Парсер SAX больше не обрабатывает общие внешние объекты по умолчанию для повышения безопасности по умолчанию. Чтобы включить обработку внешних объектов, передайте собственный экземпляр синтаксического анализатора в::

source: Example::
ru: Пример::

source: ``event`` is a constant and can be one of:
ru: ``event`` является константой и может быть одним из:

source: ``node`` is an object of type :class:`xml.dom.minidom.Document`, :class:`xml.dom.minidom.Element` or :class:`xml.dom.minidom.Text`.
ru: ``node`` — это объект типа :class:`xml.dom.minidom.Document`, :class:`xml.dom.minidom.Element` или :class:`xml.dom.minidom.Text`.

source: Since the document is treated as a "flat" stream of events, the document "tree" is implicitly traversed and the desired elements are found regardless of their depth in the tree. In other words, one does not need to consider hierarchical issues such as recursive searching of the document nodes, although if the context of elements were important, one would either need to maintain some context-related state (i.e. remembering where one is in the document at any given point) or to make use of the :func:`DOMEventStream.expandNode` method and switch to DOM-related processing.
ru: Поскольку документ рассматривается как «плоский» поток событий, «дерево» документа просматривается неявно и нужные элементы находятся независимо от их глубины в дереве. Другими словами, не нужно учитывать иерархические проблемы, такие как рекурсивный поиск узлов документа, хотя, если бы контекст элементов был важен, нужно было бы либо поддерживать некоторое состояние, связанное с контекстом (т. е. помнить, где вы находитесь в документе). в любой момент) или использовать метод :func:`DOMEventStream.expandNode` и переключиться на обработку, связанную с DOM.

source: Subclass of :class:`xml.sax.handler.ContentHandler`.
ru: Подкласс :class:`xml.sax.обработчик.ContentHandler`.

source: Return a :class:`DOMEventStream` from the given input. *stream_or_string* may be either a file name, or a file-like object. *parser*, if given, must be an :class:`~xml.sax.xmlreader.XMLReader` object. This function will change the document handler of the parser and activate namespace support; other parser configuration (like setting an entity resolver) must have been done in advance.
ru: Верните :class:`DOMEventStream` из заданного ввода. *stream_or_string* может быть либо именем файла, либо объектом, подобным файлу. *parser*, если он указан, должен быть объектом :class:`~xml.sax.xmlreader.XMLReader`. Эта функция изменит обработчик документа парсера и активирует поддержку пространства имен; другая конфигурация синтаксического анализатора (например, установка преобразователя сущностей) должна быть выполнена заранее.

source: If you have XML in a string, you can use the :func:`parseString` function instead:
ru: Если у вас есть XML в строке, вы можете вместо этого использовать функцию :func:`parseString`:

source: Return a :class:`DOMEventStream` that represents the (Unicode) *string*.
ru: Возвращает :class:`DOMEventStream`, который представляет *строку* (Unicode).

source: Default value for the *bufsize* parameter to :func:`parse`.
ru: Значение по умолчанию для параметра *bufsize*: :func:`parse`.

source: The value of this variable can be changed before calling :func:`parse` and the new value will take effect.
ru: Значение этой переменной можно изменить перед вызовом :func:`parse`, и новое значение вступит в силу.

source: DOMEventStream Objects
ru: Объекты DOMEventStream

source: Return a tuple containing *event* and the current *node* as :class:`xml.dom.minidom.Document` if event equals :data:`START_DOCUMENT`, :class:`xml.dom.minidom.Element` if event equals :data:`START_ELEMENT` or :data:`END_ELEMENT` or :class:`xml.dom.minidom.Text` if event equals :data:`CHARACTERS`. The current node does not contain information about its children, unless :func:`expandNode` is called.
ru: Возвращает кортеж, содержащий *event* и текущий *node* как :class:`xml.dom.minidom.Document`, если событие равно :data:`START_DOCUMENT`, :class:`xml.dom.minidom.Element`, если событие равно :data:`START_ELEMENT` или :data:`END_ELEMENT` или :class:`xml.dom.minidom.Text`, если событие равно :data:`CHARACTERS`. Текущий узел не содержит информации о своих дочерних элементах, если не вызывается :func:`expandNode`.

source: Expands all children of *node* into *node*. Example::
ru: Расширяет всех дочерних элементов *node* в *node*. Пример::
