Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xmlrpc.client.po
Languages: ru

source: Create an object used to boxcar method calls. *server* is the eventual target of the call. Calls can be made to the result object, but they will immediately return ``None``, and only store the call name and parameters in the :class:`MultiCall` object. Calling the object itself causes all stored calls to be transmitted as a single ``system.multicall`` request. The result of this call is a :term:`generator`; iterating over this generator yields the individual results.
ru: Создайте объект, используемый для вызовов методов boxcar. *сервер* — конечная цель вызова. Вызовы могут быть сделаны к объекту результата, но они немедленно вернут ``None`` и сохранят только имя вызова и параметры в объекте :class:`MultiCall`. Вызов самого объекта приводит к тому, что все сохраненные вызовы передаются как один запрос system.multicall. Результатом этого вызова является :term:`generator`; итерация по этому генератору дает отдельные результаты.

source: A usage example of this class follows. The server code::
ru: Ниже приведен пример использования этого класса. Код сервера::

source: Convenience Functions
ru: Удобные функции

source: Convert *params* into an XML-RPC request. or into a response if *methodresponse* is true. *params* can be either a tuple of arguments or an instance of the :exc:`Fault` exception class. If *methodresponse* is true, only a single value can be returned, meaning that *params* must be of length 1. *encoding*, if supplied, is the encoding to use in the generated XML; the default is UTF-8. Python's :const:`None` value cannot be used in standard XML-RPC; to allow using it via an extension, provide a true value for *allow_none*.
ru: Преобразуйте *params* в запрос XML-RPC. или в ответ, если *methodresponse* истинно. *params* может быть либо кортежем аргументов, либо экземпляром класса исключений :exc:`Fault`. Если *methodresponse* имеет значение true, может быть возвращено только одно значение, а это означает, что *params* должно иметь длину 1. *encoding*, если оно указано, — это кодировка, которая будет использоваться в сгенерированном XML; по умолчанию — UTF-8. Значение Python :const:`None` не может использоваться в стандартном XML-RPC; чтобы разрешить его использование через расширение, укажите истинное значение для *allow_none*.

source: Convert an XML-RPC request or response into Python objects, a ``(params, methodname)``. *params* is a tuple of argument; *methodname* is a string, or ``None`` if no method name is present in the packet. If the XML-RPC packet represents a fault condition, this function will raise a :exc:`Fault` exception. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default.
ru: Преобразуйте запрос или ответ XML-RPC в объекты Python, ``(params, имя метода)``. *params* — кортеж аргументов; *имя_метода* — это строка или ``Нет``, если в пакете нет имени метода. Если пакет XML-RPC представляет состояние ошибки, эта функция вызовет исключение :exc:`Fault`. Флаг *use_builtin_types* может использоваться для представления значений даты/времени как объектов :class:`datetime.datetime`, а двоичных данных - как объектов :class:`bytes`; по умолчанию этот флаг имеет значение false.

source: The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
ru: Устаревший флаг *use_datetime* аналогичен флагу *use_builtin_types*, но применяется только к значениям даты и времени.

source: Example of Client Usage
ru: Пример использования клиента

source: To access an XML-RPC server through a HTTP proxy, you need to define a custom transport. The following example shows how::
ru: Чтобы получить доступ к серверу XML-RPC через HTTP-прокси, вам необходимо определить собственный транспорт. В следующем примере показано, как:

source: Example of Client and Server Usage
ru: Пример использования клиента и сервера

source: See :ref:`simplexmlrpcserver-example`.
ru: См. :ref:`simplexmlrpcserver-example`.

source: Footnotes
ru: Сноски
