Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/library/xmlrpc.client.po
Languages: ru

source: :mod:`!xmlrpc.client` --- XML-RPC client access
ru: :mod:`!xmlrpc.client` --- Клиентский доступ XML-RPC

source: **Source code:** :source:`Lib/xmlrpc/client.py`
ru: **Исходный код:** :source:`Lib/xmlrpc/client.py`

source: XML-RPC is a Remote Procedure Call method that uses XML passed via HTTP(S) as a transport. With it, a client can call methods with parameters on a remote server (the server is named by a URI) and get back structured data. This module supports writing XML-RPC client code; it handles all the details of translating between conformable Python objects and XML on the wire.
ru: XML-RPC — это метод удаленного вызова процедур, который использует XML, передаваемый через HTTP(S), в качестве транспорта. С его помощью клиент может вызывать методы с параметрами на удаленном сервере (сервер именуется по URI) и получать обратно структурированные данные. Этот модуль поддерживает написание клиентского кода XML-RPC; он обрабатывает все детали трансляции между совместимыми объектами Python и XML в сети.

source: The :mod:`xmlrpc.client` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
ru: Модуль :mod:`xmlrpc.client` не защищен от вредоносно созданных данных. Если вам нужно проанализировать ненадежные или неаутентифицированные данные, см. :ref:`xml-vulnerabilities`.

source: For HTTPS URIs, :mod:`xmlrpc.client` now performs all the necessary certificate and hostname checks by default.
ru: Для HTTPS URI :mod:`xmlrpc.client` теперь по умолчанию выполняет все необходимые проверки сертификатов и имен хостов.

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.

source: A :class:`ServerProxy` instance is an object that manages communication with a remote XML-RPC server. The required first argument is a URI (Uniform Resource Indicator), and will normally be the URL of the server. The optional second argument is a transport factory instance; by default it is an internal :class:`SafeTransport` instance for https: URLs and an internal HTTP :class:`Transport` instance otherwise. The optional third argument is an encoding, by default UTF-8. The optional fourth argument is a debugging flag.
ru: Экземпляр :class:`ServerProxy` — это объект, который управляет связью с удаленным сервером XML-RPC. Обязательным первым аргументом является URI (унифицированный индикатор ресурса), обычно это URL-адрес сервера. Необязательный второй аргумент — это экземпляр транспортной фабрики; по умолчанию это внутренний экземпляр :class:`SafeTransport` для URL-адресов https: и внутренний экземпляр HTTP :class:`Transport` в противном случае. Необязательный третий аргумент — это кодировка, по умолчанию UTF-8. Необязательный четвертый аргумент — это флаг отладки.

source: The following parameters govern the use of the returned proxy instance. If *allow_none* is true, the Python constant ``None`` will be translated into XML; the default behaviour is for ``None`` to raise a :exc:`TypeError`. This is a commonly used extension to the XML-RPC specification, but isn't supported by all clients and servers; see `http://ontosys.com/xml-rpc/extensions.php <https://web.archive.org/web/20130120074804/http://ontosys.com/xml-rpc/extensions.php>`_ for a description. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default. :class:`datetime.datetime`, :class:`bytes` and :class:`bytearray` objects may be passed to calls. The *headers* parameter is an optional sequence of HTTP headers to send with each request, expressed as a sequence of 2-tuples representing the header name and value. (e.g. ``[('Header-Name', 'value')]``). If an HTTPS URL is provided, *context* may be :class:`ssl.SSLContext` and configures the SSL settings of the underlying HTTPS connection. The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
ru: Следующие параметры регулируют использование возвращаемого экземпляра прокси. Если * allow_none * это правда, константа питона `` none`` будет переведен в XML; Поведение по умолчанию предназначено для `` none``, чтобы поднять: exc: `typeerror Это обычно используемое расширение для спецификации XML-RPC, но не поддерживается всеми клиентами и серверами; См. Флаг * use_builtin_types * может использоваться, чтобы привести к представлению значений даты/времени как: класс: `datetime.datetime` Объекты и двоичные данные, которые будут представлены как: класс:` bytes` объекты; Этот флаг ложный по умолчанию. : class: `datetime.datetime`,: class:` bytes` и: class: `Объекты Bytearray` могут быть переданы на вызовы. Параметр * Заголовки * представляет собой необязательную последовательность заголовков HTTP для отправки с каждым запросом, выраженной в виде последовательности из 2-х верхов, представляющих имя заголовка и значение. (например, `[('header-name', 'value')]` `). Если предоставлен URL -адрес HTTPS, * контекст * может быть: класс: `ssl.sslcontext` и настраивает настройки SSL базового подключения HTTPS. Устаревший * use_datetime * флаг похож на * use_builtin_types *, но он применяется только к дате/значениям времени.

source: The *use_builtin_types* flag was added.
ru: Был добавлен флаг *use_builtin_types*.

source: The *headers* parameter was added.
ru: Добавлен параметр *headers*.

source: Both the HTTP and HTTPS transports support the URL syntax extension for HTTP Basic Authentication: ``http://user:pass@host:port/path``. The ``user:pass`` portion will be base64-encoded as an HTTP 'Authorization' header, and sent to the remote server as part of the connection process when invoking an XML-RPC method. You only need to use this if the remote server requires a Basic Authentication user and password.
ru: Как транспорты HTTP, так и HTTPS поддерживают расширение синтаксиса URL для базовой аутентификации HTTP: `http: // user: pass@host: port/path`. Часть `` user: pass` `` `` будет основан на заголовке авторизации http 'и отправлена ​​на удаленный сервер как часть процесса соединения при вызове метода XML-RPC. Вам нужно использовать это только в том случае, если удаленный сервер требует базового пользователя аутентификации и пароля.

source: The returned instance is a proxy object with methods that can be used to invoke corresponding RPC calls on the remote server. If the remote server supports the introspection API, the proxy can also be used to query the remote server for the methods it supports (service discovery) and fetch other server-associated metadata.
ru: Возвращенный экземпляр представляет собой прокси-объект с методами, которые можно использовать для вызова соответствующих вызовов RPC на удаленном сервере. Если удаленный сервер поддерживает API интроспекции, прокси-сервер также можно использовать для запроса удаленного сервера о поддерживаемых им методах (обнаружение служб) и получения других метаданных, связанных с сервером.

source: Types that are conformable (e.g. that can be marshalled through XML), include the following (and except where noted, they are unmarshalled as the same Python type):
ru: Типы, которые являются совместимыми (например, которые могут быть маршализованы через XML), включают следующее (и, если не указано иное, они не маршализуются как один и тот же тип Python):

source: XML-RPC type
ru: Тип XML-RPC

source: Python type
ru: Тип Python

source: :class:`int` in range from -2147483648 to 2147483647. Values get the ``<int>`` tag.
ru: :class:`int` в диапазоне от -2147483648 до 2147483647. Значениям присваивается тег ``<int>``.

source: ``double`` or ``float``
ru: ``double`` или ``float``

source: :class:`float`. Values get the ``<double>`` tag.
ru: :class:`плавать`. Значения получают тег ``<double>``.

source: :class:`list` or :class:`tuple` containing conformable elements. Arrays are returned as :class:`lists <list>`.
ru: :class:`list` или :class:`tuple`, содержащий соответствующие элементы. Массивы возвращаются как :class:`lists <list>`.

source: :class:`dict`. Keys must be strings, values may be any conformable type. Objects of user-defined classes can be passed in; only their :attr:`~object.__dict__` attribute is transmitted.
ru: :class:`dict`. Ключи должны быть строками, значения могут быть любого соответствующего типа. Можно передавать объекты пользовательских классов; передается только их атрибут :attr:`~object.__dict__`.

source: :class:`DateTime` or :class:`datetime.datetime`. Returned type depends on values of *use_builtin_types* and *use_datetime* flags.
ru: :class:`DateTime` или :class:`datetime.datetime`. Возвращаемый тип зависит от значений флагов *use_builtin_types* и *use_datetime*.

source: :class:`Binary`, :class:`bytes` or :class:`bytearray`. Returned type depends on the value of the *use_builtin_types* flag.
ru: :class:`Binary`, :class:`bytes` или :class:`bytearray`. Возвращаемый тип зависит от значения флага *use_builtin_types*.

source: The ``None`` constant. Passing is allowed only if *allow_none* is true.
ru: Константа ``None``. Передача разрешена, только если *allow_none* имеет значение true.

source: :class:`decimal.Decimal`. Returned type only.
ru: :class:`decimal.Decimal`. Только возвращаемый тип.

source: This is the full set of data types supported by XML-RPC. Method calls may also raise a special :exc:`Fault` instance, used to signal XML-RPC server errors, or :exc:`ProtocolError` used to signal an error in the HTTP/HTTPS transport layer. Both :exc:`Fault` and :exc:`ProtocolError` derive from a base class called :exc:`Error`. Note that the xmlrpc client module currently does not marshal instances of subclasses of built-in types.
ru: Это полный набор типов данных, поддерживаемых XML-RPC. Вызовы методов также могут вызывать специальный экземпляр :exc:`Fault`, используемый для сигнализации об ошибках сервера XML-RPC, или :exc:`ProtocolError`, используемый для сигнализации об ошибке на транспортном уровне HTTP/HTTPS. Оба :exc:`Fault` и :exc:`ProtocolError` являются производными от базового класса :exc:`Error`. Обратите внимание, что клиентский модуль xmlrpc в настоящее время не маршалирует экземпляры подклассов встроенных типов.

source: When passing strings, characters special to XML such as ``<``, ``>``, and ``&`` will be automatically escaped. However, it's the caller's responsibility to ensure that the string is free of characters that aren't allowed in XML, such as the control characters with ASCII values between 0 and 31 (except, of course, tab, newline and carriage return); failing to do this will result in an XML-RPC request that isn't well-formed XML. If you have to pass arbitrary bytes via XML-RPC, use :class:`bytes` or :class:`bytearray` classes or the :class:`Binary` wrapper class described below.
ru: При передаче строк символы, специальные для XML, такие как ``<``, ``>`` и ``&``, будут автоматически экранироваться. Однако вызывающая сторона несет ответственность за то, чтобы строка не содержала символов, которые не разрешены в XML, таких как управляющие символы со значениями ASCII от 0 до 31 (кроме, конечно, табуляции, новой строки и возврата каретки); Если этого не сделать, запрос XML-RPC будет неправильно сформированным XML. Если вам нужно передать произвольные байты через XML-RPC, используйте классы :class:`bytes` или :class:`bytearray` или класс-оболочку :class:`Binary`, описанный ниже.

source: :class:`Server` is retained as an alias for :class:`ServerProxy` for backwards compatibility. New code should use :class:`ServerProxy`.
ru: :class:`Server` сохраняется как псевдоним для :class:`ServerProxy` для обеспечения обратной совместимости. В новом коде следует использовать :class:`ServerProxy`.

source: Added the *context* argument.
ru: Добавлен аргумент *context*.

source: Added support of type tags with prefixes (e.g. ``ex:nil``). Added support of unmarshalling additional types used by Apache XML-RPC implementation for numerics: ``i1``, ``i2``, ``i8``, ``biginteger``, ``float`` and ``bigdecimal``. See https://ws.apache.org/xmlrpc/types.html for a description.
ru: Добавлена ​​поддержка тегов типов с префиксами (например, ex:nil). Добавлена ​​поддержка демаршаллинга дополнительных типов, используемых реализацией Apache XML-RPC для числовых значений: i1, i2, i8, biginteger, float и bigdecimal. `. Описание см. на https://ws.apache.org/xmlrpc/types.html.

source: A good description of XML-RPC operation and client software in several languages. Contains pretty much everything an XML-RPC client developer needs to know.
ru: Хорошее описание работы XML-RPC и клиентского программного обеспечения на нескольких языках. Содержит практически все, что необходимо знать разработчику клиента XML-RPC.

source: `XML-RPC Introspection <https://xmlrpc-c.sourceforge.io/introspection.html>`_
ru: `Интроспекция XML-RPC <https://xmlrpc-c.sourceforge.io/introspection.html>`_

source: Describes the XML-RPC protocol extension for introspection.
ru: Описывает расширение протокола XML-RPC для самоанализа.

source: `XML-RPC Specification <http://xmlrpc.scripting.com/spec.html>`_
ru: `Спецификация XML-RPC <http://xmlrpc.scripting.com/spec.html>`_

source: The official specification.
ru: Официальная спецификация.

source: ServerProxy Objects
ru: Объекты ServerProxy

source: A :class:`ServerProxy` instance has a method corresponding to each remote procedure call accepted by the XML-RPC server. Calling the method performs an RPC, dispatched by both name and argument signature (e.g. the same method name can be overloaded with multiple argument signatures). The RPC finishes by returning a value, which may be either returned data in a conformant type or a :class:`Fault` or :class:`ProtocolError` object indicating an error.
ru: Экземпляр :class:`ServerProxy` имеет метод, соответствующий каждому удаленному вызову процедуры, принимаемому сервером XML-RPC. При вызове метода выполняется RPC, отправляемый как по имени, так и по сигнатуре аргумента (например, одно и то же имя метода может быть перегружено несколькими сигнатурами аргументов). RPC завершается возвратом значения, которое может быть либо возвращенными данными соответствующего типа, либо объектом :class:`Fault` или :class:`ProtocolError`, указывающим на ошибку.

source: Servers that support the XML introspection API support some common methods grouped under the reserved :attr:`~ServerProxy.system` attribute:
ru: Серверы, поддерживающие API-интерфейс интроспекции XML, поддерживают некоторые общие методы, сгруппированные по зарезервированному атрибуту :attr:`~ServerProxy.system`:

source: This method returns a list of strings, one for each (non-system) method supported by the XML-RPC server.
ru: Этот метод возвращает список строк, по одной для каждого (несистемного) метода, поддерживаемого сервером XML-RPC.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns an array of possible signatures for this method. A signature is an array of types. The first of these types is the return type of the method, the rest are parameters.
ru: Этот метод принимает один параметр — имя метода, реализованного сервером XML-RPC. Он возвращает массив возможных сигнатур для этого метода. Сигнатура представляет собой массив типов. Первый из этих типов — это возвращаемый тип метода, остальные — параметры.

source: Because multiple signatures (ie. overloading) is permitted, this method returns a list of signatures rather than a singleton.
ru: Поскольку разрешено несколько подписей (т. е. перегрузка), этот метод возвращает список подписей, а не один элемент.

source: Signatures themselves are restricted to the top level parameters expected by a method. For instance if a method expects one array of structs as a parameter, and it returns a string, its signature is simply "string, array". If it expects three integers and returns a string, its signature is "string, int, int, int".
ru: Сами сигнатуры ограничены параметрами верхнего уровня, ожидаемыми методом. Например, если метод ожидает в качестве параметра один массив структур и возвращает строку, его сигнатура — это просто «строка, массив». Если он ожидает три целых числа и возвращает строку, его сигнатура — «строка, int, int, int».

source: If no signature is defined for the method, a non-array value is returned. In Python this means that the type of the returned value will be something other than list.
ru: Если для метода не определена подпись, возвращается значение, не являющееся массивом. В Python это означает, что тип возвращаемого значения будет отличным от списка.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns a documentation string describing the use of that method. If no such string is available, an empty string is returned. The documentation string may contain HTML markup.
ru: Этот метод принимает один параметр — имя метода, реализованного сервером XML-RPC. Он возвращает строку документации, описывающую использование этого метода. Если такой строки нет, возвращается пустая строка. Строка документации может содержать HTML-разметку.

source: Instances of :class:`ServerProxy` support the :term:`context manager` protocol for closing the underlying transport.
ru: Экземпляры :class:`ServerProxy` поддерживают протокол :term:`контекстного менеджера` для закрытия базового транспорта.

source: A working example follows. The server code::
ru: Далее следует рабочий пример. Код сервера::

source: The client code for the preceding server::
ru: Клиентский код предыдущего сервера::

source: DateTime Objects
ru: Объекты даты и времени

source: This class may be initialized with seconds since the epoch, a time tuple, an ISO 8601 time/date string, or a :class:`datetime.datetime` instance. It has the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
ru: Этот класс может быть инициализирован секундами с начала эпохи, кортежем времени, строкой времени/даты ISO 8601 или экземпляром :class:`datetime.datetime`. Он имеет следующие методы, поддерживаемые в основном для внутреннего использования кодом маршаллинга/демаршаллинга:

source: Accept a string as the instance's new time value.
ru: Примите строку в качестве нового значения времени экземпляра.

source: Write the XML-RPC encoding of this :class:`DateTime` item to the *out* stream object.
ru: Запишите кодировку XML-RPC этого элемента :class:`DateTime` в объект потока *out*.

source: It also supports certain of Python's built-in operators through :meth:`rich comparison <object.__lt__>` and :meth:`~object.__repr__` methods.
ru: Он также поддерживает некоторые встроенные операторы Python с помощью методов :meth:`rich сравнение <object.__lt__>` и :meth:`~object.__repr__`.

source: Binary Objects
ru: Бинарные объекты

source: This class may be initialized from bytes data (which may include NULs). The primary access to the content of a :class:`Binary` object is provided by an attribute:
ru: Этот класс может быть инициализирован из байтовых данных (которые могут включать NUL). Первичный доступ к содержимому объекта :class:`Binary` обеспечивается атрибутом:

source: The binary data encapsulated by the :class:`Binary` instance. The data is provided as a :class:`bytes` object.
ru: Двоичные данные, инкапсулированные экземпляром :class:`Binary`. Данные предоставляются в виде объекта :class:`bytes`.

source: :class:`Binary` objects have the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
ru: Объекты :class:`Binary` имеют следующие методы, поддерживаемые в основном для внутреннего использования кодом маршаллинга/демаршаллинга:

source: Accept a base64 :class:`bytes` object and decode it as the instance's new data.
ru: Примите объект base64 :class:`bytes` и декодируйте его как новые данные экземпляра.

source: Write the XML-RPC base 64 encoding of this binary item to the *out* stream object.
ru: Запишите кодировку XML-RPC base 64 этого двоичного элемента в объект потока *out*.

source: The encoded data will have newlines every 76 characters as per :rfc:`RFC 2045 section 6.8 <2045#section-6.8>`, which was the de facto standard base64 specification when the XML-RPC spec was written.
ru: Закодированные данные будут иметь символы новой строки через каждые 76 символов в соответствии с :rfc:`RFC 2045, раздел 6.8 <2045#section-6.8>`, который де-факто был стандартной спецификацией base64 на момент написания спецификации XML-RPC.

source: It also supports certain of Python's built-in operators through :meth:`~object.__eq__` and :meth:`~object.__ne__` methods.
ru: Он также поддерживает некоторые встроенные операторы Python посредством методов :meth:`~object.__eq__` и :meth:`~object.__ne__`.

source: Example usage of the binary objects. We're going to transfer an image over XMLRPC::
ru: Пример использования бинарных объектов. Мы собираемся передать изображение через XMLRPC::

source: The client gets the image and saves it to a file::
ru: Клиент получает изображение и сохраняет его в файл::

source: Fault Objects
ru: Объекты неисправностей

source: A :class:`Fault` object encapsulates the content of an XML-RPC fault tag. Fault objects have the following attributes:
ru: Объект :class:`Fault` инкапсулирует содержимое тега ошибки XML-RPC. Объекты неисправностей имеют следующие атрибуты:

source: An int indicating the fault type.
ru: Целое число, указывающее тип ошибки.

source: A string containing a diagnostic message associated with the fault.
ru: Строка, содержащая диагностическое сообщение, связанное с неисправностью.

source: In the following example we're going to intentionally cause a :exc:`Fault` by returning a complex type object. The server code::
ru: В следующем примере мы собираемся намеренно вызвать :exc:`Fault`, возвращая объект сложного типа. Код сервера::

source: ProtocolError Objects
ru: Объекты ProtocolError

source: The URI or URL that triggered the error.
ru: URI или URL-адрес, вызвавший ошибку.

source: The error code.
ru: Код ошибки.

source: The error message or diagnostic string.
ru: Сообщение об ошибке или диагностическая строка.

source: A dict containing the headers of the HTTP/HTTPS request that triggered the error.
ru: Словарь, содержащий заголовки запроса HTTP/HTTPS, вызвавшего ошибку.

source: In the following example we're going to intentionally cause a :exc:`ProtocolError` by providing an invalid URI::
ru: В следующем примере мы собираемся намеренно вызвать ошибку :exc:`ProtocolError`, указав неверный URI::

source: MultiCall Objects
ru: Объекты мультивызова

source: The :class:`MultiCall` object provides a way to encapsulate multiple calls to a remote server into a single request [#]_.
ru: Объект :class:`MultiCall` позволяет инкапсулировать несколько вызовов к удаленному серверу в один запрос. [#]_ .
