Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/distributing/index.po
Languages: es_es

source: Distributing Python Modules
es_es: Distribución de módulos Python

source: Email
es_es: Correo electrónico

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
es_es: Como un proyecto de desarrollo de código abierto popular, Python cuenta con una comunidad activa de colaboradores y usuarios que también ponen su software a disposición de otros desarrolladores de Python bajo los términos de una licencia de código abierto.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
es_es: Esto permite a los usuarios de Python compartir y colaborar de manera efectiva, beneficiándose de las soluciones que otros ya han creado para problemas comunes (¡y a veces incluso raros!), así como potencialmente contribuir con sus propias soluciones al conjunto común.

source: This guide covers the distribution part of the process. For a guide to installing other Python projects, refer to the :ref:`installation guide <installing-index>`.
es_es: Esta guía cubre la parte de distribución del proceso. Para obtener una guía de instalación de otros proyectos de Python, consulta la :ref:`installation guide <installing-index>`.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
es_es: Para usuarios corporativos y otras instituciones, tenga en cuenta que muchas organizaciones tienen sus propias políticas sobre el uso y contribución de software de código abierto. Por favor, tenga en cuenta estas políticas al utilizar las herramientas de distribución e instalación proporcionadas con Python.

source: Key terms
es_es: Términos clave

source: the `Python Package Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users
es_es: El `Python Package Index <https://pypi.org>`__ es un repositorio público de paquetes con licencia de código abierto disponibles para su uso por otros usuarios de Python.

source: the `Python Packaging Authority <https://www.pypa.io/>`__ are the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation and issue trackers on both `GitHub <https://github.com/pypa>`__ and `Bitbucket <https://bitbucket.org/pypa/>`__.
es_es: la `Python Packaging Authority <https://www.pypa.io/>`__ es el grupo de desarrolladores y autores de documentación responsables del mantenimiento y evolución de las herramientas de empaquetado estándar y los estándares asociados de metadatos y formato de archivos. Mantienen una variedad de herramientas, documentación y rastreadores de problemas tanto en `GitHub <https://github.com/pypa>`__ como en `Bitbucket <https://bitbucket.org/pypa/>`__.

source: :mod:`distutils` is the original build and distribution system first added to the Python standard library in 1998. While direct use of :mod:`distutils` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
es_es: :mod:`distutils` es el sistema original de construcción y distribución que se agregó por primera vez a la biblioteca estándar de Python en 1998. Si bien el uso directo de :mod:`distutils` se está eliminando gradualmente, aún sentó las bases para la infraestructura actual de empaquetado y distribución, y no solo sigue siendo parte de la biblioteca estándar, sino que su nombre perdura de otras formas (como el nombre de la lista de correo utilizada para coordinar el desarrollo de estándares de empaquetado de Python).

source: `setuptools`_ is a (largely) drop-in replacement for :mod:`distutils` first published in 2004. Its most notable addition over the unmodified :mod:`distutils` tools was the ability to declare dependencies on other packages. It is currently recommended as a more regularly updated alternative to :mod:`distutils` that offers consistent support for more recent packaging standards across a wide range of Python versions.
es_es: `setuptools`_ es un reemplazo (en gran medida) compatible con :mod:`distutils` publicado por primera vez en 2004. Su adición más notable sobre las herramientas no modificadas de :mod:`distutils` fue la capacidad de declarar dependencias en otros paquetes. Actualmente se recomienda como una alternativa más actualizada a :mod:`distutils` que ofrece un soporte consistente para estándares de empaquetado más recientes en una amplia gama de versiones de Python.

source: `wheel`_ (in this context) is a project that adds the ``bdist_wheel`` command to :mod:`distutils`/`setuptools`_. This produces a cross platform binary packaging format (called "wheels" or "wheel files" and defined in :pep:`427`) that allows Python libraries, even those including binary extensions, to be installed on a system without needing to be built locally.
es_es: `wheel`_ (en este contexto) es un proyecto que agrega el comando ``bdist_wheel`` a :mod:`distutils`/`setuptools`_. Esto produce un formato de empaquetado binario multiplataforma (llamado "wheels" o "wheel files" y definido en :pep:`427`) que permite instalar bibliotecas de Python, incluso aquellas que incluyen extensiones binarias, en un sistema sin necesidad de compilarlas localmente.

source: Open source licensing and collaboration
es_es: Licencias y colaboración de código abierto

source: In most parts of the world, software is automatically covered by copyright. This means that other developers require explicit permission to copy, use, modify and redistribute the software.
es_es: En la mayoría de las partes del mundo, el software está automáticamente protegido por derechos de autor. Esto significa que otros desarrolladores requieren permiso explícito para copiar, usar, modificar y redistribuir el software.

source: Open source licensing is a way of explicitly granting such permission in a relatively consistent way, allowing developers to share and collaborate efficiently by making common solutions to various problems freely available. This leaves many developers free to spend more time focusing on the problems that are relatively unique to their specific situation.
es_es: La licencia de código abierto es una forma de otorgar explícitamente dicho permiso de manera relativamente consistente, permitiendo a los desarrolladores compartir y colaborar de manera eficiente al hacer soluciones comunes para diversos problemas disponibles de forma libre. Esto permite que muchos desarrolladores dediquen más tiempo a enfocarse en los problemas que son relativamente únicos para su situación específica.

source: The distribution tools provided with Python are designed to make it reasonably straightforward for developers to make their own contributions back to that common pool of software if they choose to do so.
es_es: Las herramientas de distribución proporcionadas con Python están diseñadas para que los desarrolladores puedan hacer sus propias contribuciones a ese conjunto común de software si así lo desean.

source: The same distribution tools can also be used to distribute software within an organisation, regardless of whether that software is published as open source software or not.
es_es: Las mismas herramientas de distribución también se pueden utilizar para distribuir software dentro de una organización, independientemente de si ese software se publica como software de código abierto o no.

source: Installing the tools
es_es: Instalando las herramientas

source: The standard library does not include build tools that support modern Python packaging standards, as the core development team has found that it is important to have standard tools that work consistently, even on older versions of Python.
es_es: La biblioteca estándar no incluye herramientas de compilación que admitan los estándares modernos de empaquetado de Python, ya que el equipo de desarrollo principal ha encontrado que es importante tener herramientas estándar que funcionen de manera consistente, incluso en versiones antiguas de Python.

source: The currently recommended build and distribution tools can be installed by invoking the ``pip`` module at the command line::
es_es: Las herramientas de compilación y distribución recomendadas actualmente pueden instalarse invocando el módulo ``pip`` en la línea de comandos::

source: For POSIX users (including macOS and Linux users), these instructions assume the use of a :term:`virtual environment`.
es_es: Para usuarios POSIX (incluidos los usuarios de macOS y Linux), estas instrucciones asumen el uso de un :term:`virtual environment`.

source: For Windows users, these instructions assume that the option to adjust the system PATH environment variable was selected when installing Python.
es_es: Para los usuarios de Windows, estas instrucciones asumen que se seleccionó la opción de ajustar la variable de entorno PATH del sistema al instalar Python.

source: The Python Packaging User Guide includes more details on the `currently recommended tools`_.
es_es: La Guía del Usuario de Empaquetado de Python incluye más detalles sobre las `herramientas actualmente recomendadas`_.

source: Reading the Python Packaging User Guide
es_es: Leyendo la Guía del Usuario de Empaquetado de Python

source: The Python Packaging User Guide covers the various key steps and elements involved in creating and publishing a project:
es_es: La Guía del Usuario de Empaquetado de Python cubre los diversos pasos clave y elementos involucrados en la creación y publicación de un proyecto:

source: `Project structure`_
es_es: `Estructura del proyecto`_

source: `Building and packaging the project`_
es_es: `Construir y empaquetar el proyecto`_

source: `Uploading the project to the Python Package Index`_
es_es: `Subir el proyecto al índice de paquetes de Python`_

source: `The .pypirc file`_
es_es: `El archivo .pypirc`_

source: How do I...?
es_es: ¿Cómo lo hago...?

source: These are quick answers or links for some common tasks.
es_es: Estas son respuestas rápidas o enlaces para algunas tareas comunes.

source: ... choose a name for my project?
es_es: ... elegir un nombre para mi proyecto?

source: This isn't an easy topic, but here are a few tips:
es_es: Este no es un tema fácil, pero aquí tienes algunos consejos:

source: check the Python Package Index to see if the name is already in use
es_es: comprueba el Índice de Paquetes de Python para ver si el nombre ya está en uso

source: check popular hosting sites like GitHub, Bitbucket, etc to see if there is already a project with that name
es_es: comprueba sitios de alojamiento populares como GitHub, Bitbucket, etc. para ver si ya existe un proyecto con ese nombre

source: check what comes up in a web search for the name you're considering
es_es: comprueba lo que aparece en una búsqueda web para el nombre que estás considerando

source: avoid particularly common words, especially ones with multiple meanings, as they can make it difficult for users to find your software when searching for it
es_es: evitar palabras especialmente comunes, especialmente aquellas con múltiples significados, ya que pueden dificultar que los usuarios encuentren su software al buscarlo

source: ... create and distribute binary extensions?
es_es: ... ¿crear y distribuir extensiones binarias?

source: This is actually quite a complex topic, with a variety of alternatives available depending on exactly what you're aiming to achieve. See the Python Packaging User Guide for more information and recommendations.
es_es: Este es en realidad un tema bastante complejo, con una variedad de alternativas disponibles dependiendo de lo que estés buscando lograr exactamente. Consulta la Guía del Usuario de Empaquetado de Python para obtener más información y recomendaciones.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`__
es_es: Python Packaging User Guide: Extensiones Binarias <https://packaging.python.org/guides/packaging-binary-extensions/>__
