Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/installing/index.po
Languages: ru

source: Installing Python Modules
ru: Установка модулей Python

source: Email
ru: Электронная почта

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
ru: Будучи популярным проектом разработки с открытым исходным кодом, Python имеет активное поддерживающее сообщество участников и пользователей, которые также предоставляют свое программное обеспечение другим разработчикам Python для использования на условиях лицензии с открытым исходным кодом.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
ru: Это позволяет пользователям Python эффективно обмениваться информацией и сотрудничать, получая выгоду от решений, уже созданных другими для решения распространенных (а иногда даже редких!) проблем, а также потенциально внося свои собственные решения в общий пул.

source: This guide covers the installation part of the process. For a guide to creating and sharing your own Python projects, refer to the `Python packaging user guide`_.
ru: В этом руководстве рассматривается часть процесса установки. Руководство по созданию и совместному использованию собственных проектов Python можно найти в `Руководстве пользователя по упаковке Python`_.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
ru: Корпоративным и другим институциональным пользователям следует иметь в виду, что многие организации имеют свою собственную политику использования и содействия программному обеспечению с открытым исходным кодом. Пожалуйста, примите во внимание такие правила при использовании инструментов распространения и установки, поставляемых с Python.

source: Key terms
ru: Ключевые термины

source: ``pip`` is the preferred installer program. Starting with Python 3.4, it is included by default with the Python binary installers.
ru: ``pip`` — предпочтительная программа установки. Начиная с Python 3.4, он по умолчанию включен в двоичные установщики Python.

source: A *virtual environment* is a semi-isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide.
ru: *Виртуальная среда* — это полуизолированная среда Python, которая позволяет устанавливать пакеты для использования конкретным приложением, а не для всей системы.

source: ``venv`` is the standard tool for creating virtual environments, and has been part of Python since Python 3.3. Starting with Python 3.4, it defaults to installing ``pip`` into all created virtual environments.
ru: ``venv`` — это стандартный инструмент для создания виртуальных сред, который является частью Python, начиная с Python 3.3. Начиная с Python 3.4, по умолчанию pip устанавливается во все созданные виртуальные среды.

source: ``virtualenv`` is a third party alternative (and predecessor) to ``venv``. It allows virtual environments to be used on versions of Python prior to 3.4, which either don't provide ``venv`` at all, or aren't able to automatically install ``pip`` into created environments.
ru: «virtualenv» — это сторонняя альтернатива (и предшественник) «venv». Он позволяет использовать виртуальные среды в версиях Python до 3.4, которые либо вообще не поддерживают venv, либо не могут автоматически устанавливать pip в созданные среды.

source: The `Python Package Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users.
ru: «Индекс пакетов Python <https://pypi.org>»__ — это общедоступный репозиторий лицензионных пакетов с открытым исходным кодом, доступных для использования другими пользователями Python.

source: the `Python Packaging Authority <https://www.pypa.io/>`__ is the group of developers and documentation authors responsible for the maintenance and evolution of the standard packaging tools and the associated metadata and file format standards. They maintain a variety of tools, documentation, and issue trackers on `GitHub <https://github.com/pypa>`__.
ru: `Python Packaging Authority <https://www.pypa.io/>`__ — это группа разработчиков и авторов документации, ответственная за поддержку и развитие стандартных инструментов упаковки и связанных с ними стандартов метаданных и форматов файлов. Они поддерживают различные инструменты, документацию и средства отслеживания проблем на GitHub <https://github.com/pypa>`__.

source: ``distutils`` is the original build and distribution system first added to the Python standard library in 1998. While direct use of ``distutils`` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
ru: Distutils — это оригинальная система сборки и распространения, впервые добавленная в стандартную библиотеку Python в 1998 году. Хотя прямое использование distutils постепенно прекращается, она по-прежнему закладывает основу для текущей инфраструктуры упаковки и распространения, и он не только остается частью стандартной библиотеки, но и его имя продолжает существовать в других отношениях (например, в названии списка рассылки, используемого для координации разработки стандартов упаковки Python).

source: The use of ``venv`` is now recommended for creating virtual environments.
ru: Теперь для создания виртуальных сред рекомендуется использовать venv.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/installing/#creating-virtual-environments>`__
ru: `Руководство пользователя Python Packaging: Создание и использование виртуальных сред <https://packaging.python.org/installing/#creating-virtual-environments>`__

source: Basic usage
ru: Основное использование

source: The standard packaging tools are all designed to be used from the command line.
ru: Все стандартные инструменты упаковки предназначены для использования из командной строки.

source: The following command will install the latest version of a module and its dependencies from the Python Package Index::
ru: Следующая команда установит последнюю версию модуля и его зависимости из индекса пакетов Python:

source: For POSIX users (including macOS and Linux users), the examples in this guide assume the use of a :term:`virtual environment`.
ru: Для пользователей POSIX (включая пользователей macOS и Linux) примеры в этом руководстве предполагают использование :term:`виртуальной среды`.

source: For Windows users, the examples in this guide assume that the option to adjust the system PATH environment variable was selected when installing Python.
ru: Для пользователей Windows в примерах в этом руководстве предполагается, что при установке Python была выбрана опция настройки системной переменной среды PATH.

source: It's also possible to specify an exact or minimum version directly on the command line. When using comparator operators such as ``>``, ``<`` or some other special character which get interpreted by shell, the package name and the version should be enclosed within double quotes::
ru: Также можно указать точную или минимальную версию непосредственно в командной строке. При использовании операторов сравнения, таких как ``>``, ``<`` или других специальных символов, которые интерпретируются оболочкой, имя пакета и версия должны быть заключены в двойные кавычки::

source: Normally, if a suitable module is already installed, attempting to install it again will have no effect. Upgrading existing modules must be requested explicitly::
ru: Обычно, если подходящий модуль уже установлен, попытка установить его снова не даст никакого эффекта. Обновление существующих модулей должно быть запрошено явно:

source: More information and resources regarding ``pip`` and its capabilities can be found in the `Python Packaging User Guide <https://packaging.python.org>`__.
ru: Дополнительную информацию и ресурсы, касающиеся ``pip`` и его возможностей, можно найти в ``Руководстве пользователя упаковки Python'' <https://packaging.python.org>`__.

source: Creation of virtual environments is done through the :mod:`venv` module. Installing packages into an active virtual environment uses the commands shown above.
ru: Создание виртуальных сред осуществляется с помощью модуля :mod:`venv`. Для установки пакетов в активную виртуальную среду используются команды, показанные выше.

source: `Python Packaging User Guide: Installing Python Distribution Packages <https://packaging.python.org/installing/>`__
ru: `Руководство пользователя по упаковке Python: Установка пакетов распространения Python <https://packaging.python.org/installing/>`__

source: How do I ...?
ru: Как мне...?

source: These are quick answers or links for some common tasks.
ru: Это быстрые ответы или ссылки для некоторых распространенных задач.

source: ... install ``pip`` in versions of Python prior to Python 3.4?
ru: ... установить pip в версиях Python до Python 3.4?

source: Python only started bundling ``pip`` with Python 3.4. For earlier versions, ``pip`` needs to be "bootstrapped" as described in the Python Packaging User Guide.
ru: Python начал объединять pip только с Python 3.4. Для более ранних версий pip необходимо «загрузить», как описано в Руководстве пользователя по упаковке Python.

source: `Python Packaging User Guide: Requirements for Installing Packages <https://packaging.python.org/installing/#requirements-for-installing-packages>`__
ru: `Руководство пользователя по упаковке Python: Требования для установки пакетов <https://packaging.python.org/installing/#requirements-for-installing-packages>`__

source: ... install packages just for the current user?
ru: ... установить пакеты только для текущего пользователя?

source: Passing the ``--user`` option to ``python -m pip install`` will install a package just for the current user, rather than for all users of the system.
ru: Передача опции ``--user`` в ``python -m pip install`` установит пакет только для текущего пользователя, а не для всех пользователей системы.

source: ... install scientific Python packages?
ru: ... установить научные пакеты Python?

source: A number of scientific Python packages have complex binary dependencies, and aren't currently easy to install using ``pip`` directly. At this point in time, it will often be easier for users to install these packages by `other means <https://packaging.python.org/science/>`__ rather than attempting to install them with ``pip``.
ru: Ряд научных пакетов Python имеют сложные двоичные зависимости, и в настоящее время их нелегко установить напрямую с помощью pip. На данный момент пользователям зачастую будет проще установить эти пакеты ``другими способами <https://packaging.python.org/science/>`__", а не пытаться установить их с помощью ``pip``.

source: `Python Packaging User Guide: Installing Scientific Packages <https://packaging.python.org/science/>`__
ru: `Руководство пользователя Python Packaging: Установка научных пакетов <https://packaging.python.org/science/>`__

source: ... work with multiple versions of Python installed in parallel?
ru: ... работать с несколькими версиями Python, установленными параллельно?

source: On Linux, macOS, and other POSIX systems, use the versioned Python commands in combination with the ``-m`` switch to run the appropriate copy of ``pip``::
ru: В Linux, macOS и других системах POSIX используйте команды Python с поддержкой версий в сочетании с переключателем ``-m`` для запуска соответствующей копии ``pip``::

source: Appropriately versioned ``pip`` commands may also be available.
ru: Также могут быть доступны команды pip с соответствующей версией.

source: On Windows, use the ``py`` Python launcher in combination with the ``-m`` switch::
ru: В Windows используйте программу запуска Python ``py`` в сочетании с переключателем ``-m``::

source: Common installation issues
ru: Общие проблемы при установке

source: Installing into the system Python on Linux
ru: Установка в систему Python в Linux

source: On Linux systems, a Python installation will typically be included as part of the distribution. Installing into this Python installation requires root access to the system, and may interfere with the operation of the system package manager and other components of the system if a component is unexpectedly upgraded using ``pip``.
ru: В системах Linux установка Python обычно входит в состав дистрибутива. Установка в эту установку Python требует root-доступа к системе и может мешать работе системного менеджера пакетов и других компонентов системы, если компонент неожиданно обновляется с помощью ``pip``.

source: On such systems, it is often better to use a virtual environment or a per-user installation when installing packages with ``pip``.
ru: В таких системах часто лучше использовать виртуальную среду или установку для каждого пользователя при установке пакетов с помощью pip.

source: Pip not installed
ru: Pip не установлен

source: It is possible that ``pip`` does not get installed by default. One potential fix is::
ru: Возможно, pip не устанавливается по умолчанию. Одно из возможных исправлений:

source: There are also additional resources for `installing pip. <https://packaging.python.org/en/latest/tutorials/installing-packages/#ensure-pip-setuptools-and-wheel-are-up-to-date>`__
ru: Существуют также дополнительные ресурсы для установки pip. <https://packaging.python.org/en/latest/tutorials/installing-packages/#ensure-pip-setuptools-and-wheel-are-up-to-date>`__

source: Installing binary extensions
ru: Установка двоичных расширений

source: Python has typically relied heavily on source based distribution, with end users being expected to compile extension modules from source as part of the installation process.
ru: Python обычно в значительной степени полагался на распространение на основе исходного кода, при этом конечные пользователи должны были скомпилировать модули расширения из исходного кода в рамках процесса установки.

source: With the introduction of support for the binary ``wheel`` format, and the ability to publish wheels for at least Windows and macOS through the Python Package Index, this problem is expected to diminish over time, as users are more regularly able to install pre-built extensions rather than needing to build them themselves.
ru: С введением поддержки двоичного формата «wheel» и возможностью публикации колес по крайней мере для Windows и macOS через индекс пакетов Python ожидается, что эта проблема со временем уменьшится, поскольку пользователи смогут чаще устанавливать готовые расширения, а не создавать их самостоятельно.

source: Some of the solutions for installing `scientific software <https://packaging.python.org/science/>`__ that are not yet available as pre-built ``wheel`` files may also help with obtaining other binary extensions without needing to build them locally.
ru: Некоторые из решений по установке ``научного программного обеспечения <https://packaging.python.org/science/>`__", которые еще не доступны в виде предварительно созданных файлов ``wheel``, также могут помочь в получении других двоичных расширений без необходимости чтобы построить их локально.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/extensions/>`__
ru: `Руководство пользователя по упаковке Python: Бинарные расширения<https://packaging.python.org/extensions/>`__
