Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/about.po
Languages: ar, bn, de, es_419, es_co, es_es, fa, ja, ms, pt, ro, sv, zh_hans

source: About this documentation
ar: حول هذا التوثيق
es_es: Sobre esta documentación
fa: دربارهٔ این مستندات
ms: Perihal dokumentasi ini
pt: Sobre esta documentação
ro: Despre această documentație
sv: Om denna dokumentationen

source: Python's documentation is generated from `reStructuredText`_ sources using `Sphinx`_, a documentation generator originally created for Python and now maintained as an independent project.
ar: يتم إنشاء توثيق بايثون من `reStructuredText`_ مصادر ‎ باستخدام ‎`Sphinx`_، وهو مولّد توثيق تم إنشاؤه في الأصل من أجل بايثون ويُدار الآن كمشروع مستقل.
es_es: La documentación de Python se genera a partir de fuentes de `reStructuredText`_ utilizando `Sphinx`_, un generador de documentación creado originalmente para Python y que ahora se mantiene como proyecto independiente.
fa: مستندات پایتون از طریق منابع `reStructuredText`_ با استفاده از `Sphinx`_ تولید می‌شوند، که یک تولیدکننده مستندات است که در ابتدا برای پایتون ساخته شد و اکنون به‌عنوان یک پروژه مستقل نگهداری می‌شود.
ms: Dokumentasi Python dijana daripada sumber `reStructuredText`_ menggunakan `Sphinx`_, penjana dokumentasi yang pada asalnya dicipta untuk Python dan kini diselenggara sebagai projek bebas.
pt: A documentação do Python é gerada a partir de fontes `reStructuredText`_ utilizando `Sphinx`_, um gerador de documentação criado originalmente para o Python e agora mantido como um projeto independente.
ro: Documentația Python este generată din surse _„reStructuredText” folosind „Sphinx”_, un generator de documentație creat inițial pentru Python și întreținut acum ca proiect independent.
sv: Pythons dokumentation genereras från `reStructuredText`_-källor med hjälp av `Sphinx`_, en dokumentationsgenerator som ursprungligen skapades för Python och nu underhålls som ett oberoende projekt.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
ar: تطوير التوثيق وسلسلة أدواته هو جهد تطوعي بالكامل، تمامًا مثل بايثون نفسه. إذا كنت ترغب في المساهمة، يُرجى الاطلاع على :ref:`reporting-bugs` صفحة ‎ للحصول على معلومات حول كيفية القيام بذلك. المتطوعون الجدد مرحّب بهم دائمًا!
bn: ডকুমেন্টেশন এবং এর টুলচেইনের সৃষ্টি এবং বিকাশ একটি সম্পূর্ণ স্বেচ্ছাসেবী প্রচেষ্টা, ঠিক পাইথনের মতোই। আপনি যদি অবদান রাখতে চান, তাহলে অনুগ্রহ করে :ref:`reporting-bugs` পৃষ্ঠাটি দেখুন সেখানে কীভাবে তা করতে হয় তার ব্যাখা দেয়া আছে। নতুন স্বেচ্ছাসেবকদের সবসময় স্বাগত জানাই!
de: Die Entwicklung der Dokumentation und ihrer Toolchain erfolgt vollständig ehrenamtlich, genauso wie Python selbst. Wenn Sie dazu beitragen möchten, werfen Sie bitte einen Blick auf die Seite :ref:`reporting-bugs` für Informationen dazu. Neue Freiwillige sind jederzeit willkommen!
es_419: El desarrollo de la documentación y su cadena de herramientas es completamente un esfuerzo voluntario, al igual que Python. Si quieres contribuir, por favor revisa la pagina :ref:`reporting-bugs` para obtener información de como hacerlo. ¡Nuevos voluntarios son siempre bienvenidos!
es_co: El desarrollo de la documentación y su cadena de herramientas es completamente un esfuerzo voluntario, al igual que Python. Si quiere contribuir, por favor revise la página :ref:`reporting-bugs` para obtener información sobre cómo hacerlo. ¡Los nuevos voluntarios son siembre bienvenidos!
es_es: El desarrollo de la documentación así como el de sus diversas herramientas ha sido posible gracias a un esfuerzo de voluntarios, así como el propio lenguaje Python. Si quiere contribuir eche un vistazo a la página con la referencia `reporting-bugs' donde encontrará información de cómo hacerlo. ¡Los nuevos voluntarios son siempre bienvenidos!
fa: توسعهٔ مستندات و زنجیرهٔ ابزارهایش، همانند خود پایتون تلاشی کاملاً داوطلبانه است. اگر می‌خواهید مشارکت کنید برای اطّلاعات در مورد چگونگی آن نگاهی به صفحهٔ :ref:`reporting-bugs` بیندازید. همیشه از داوطلبان جدید استقبال می‌شود!
ja: ドキュメントとそのツールチェーンの開発は、Python自体と同様に、完全にボランティアによる取り組みです。ご協力いただける場合は、以下のリンクをご確認ください :ref:`reporting-bugs` 詳細な手順については、こちらのページをご確認ください。 新しいボランティアはいつでも歓迎です！
ms: Pembangunan dokumentasi dan rantaian alat dokumentasi adalah atas usaha sukarelawan sepenuhnya, sama seperti Python. Jika anda mahu memberikan sumbangan, sila lihat halaman :ref:`reporting-bugs` untuk mendapatkan maklumat lanjut tentang cara berbuat demikian. Sukarelawan baharu sentiasa dialu-alukan!
pt: O desenvolvimento da documentação e das suas ferramentas é um esforço totalmente voluntário, como o Python em si. Se quer contribuir, por favor, dê uma vista de olhos na página :ref:`reporting-bugs` para informação sobre como o fazer. Novos voluntários são sempre bem-vindos!
ro: Elaborarea documentației și a setului de instrumente aferent este o activitate realizată în întregime de voluntari, la fel ca și Python în sine. Dacă doriți să contribuiți, vă rugăm să consultați pagina :ref:`reporting-bugs` pentru informații despre cum puteți face acest lucru. Voluntarii noi sunt întotdeauna bineveniți!
sv: Utvecklingen av dokumentationen och dess verktygskedja är en helt frivillig insats, precis som Python självt. Om du vill bidra, ta en titt på sidan :ref:`reporting-bugs` för information om hur du gör det. Nya volontärer är alltid välkomna!
zh_hans: 如同Python 自身一样，文档及其工具链的发展完全是志愿者的努力。 如果您想做出贡献，请查看该页面:ref:`reporting-bugs`以获取有关如何进行贡献的信息。 随时欢迎新志愿者！

source: Many thanks go to:
ar: جزيل الشكر إلى:
bn: অসংখ্য ধন্যবাদ যাচ্ছেঃ
de: Ein großes Dankeschön geht an:
es_419: Agradezco a:
es_co: Muchas gracias a:
es_es: Nuesto agradecimiento a :
fa: سپاس بسیار از:
ja: 心より感謝申し上げます：
ms: Sekalung penghargaan kepada:
pt: Agradecimentos para:
ro: Multe mulțumiri adresate către:
sv: Stort tack till..:
zh_hans: 致谢：

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and author of much of the content;
ar: فريد إل. دريك الابن، مبتكر مجموعة أدوات التوثيق الأصلية لبايثون ومؤلف جزء كبير من المحتوى؛
es_es: Fred L. Drake, Jr. creador del conjunto original de herramientas de documentación de Python y autor de gran parte de su contenido;
fa: فرد ال. درک جونیور خالق مجموعه ابزارهای اصلی مستندات پایتون و نویسنده بسیاری از محتواها:
ms: Fred L. Drake, Jr., pencipta set alat dokumentasi Python yang asal dan pengarang untuk kebanyakan kandungan dokumentasi;
pt: Fred L. Drake, Jr., o criador do primeiro conjunto de ferramentas para documentar o Python e autor de boa parte do conteúdo;
ro: Fred L. Drake, Jr., creatorul setului original de instrumente de documentare Python și autorul unei mari părți din conținut;
sv: Fred L. Drake, Jr, skaparen av det ursprungliga Python-dokumentationsverktyget och författare till mycket av innehållet;

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
ar: مشروع ‎Docutils‎ <https://docutils.sourceforge.io/>`_ لإنشاءنص مُعاد هيكلته ومجموعة ‎Docutils‎؛
bn: reStructuredText এবং Docutils suite তৈরি করার জন্যে `Docutils <https://docutils.sourceforge.io/>`_ প্রজেক্ট;
de: Das `Docutils <https://docutils.sourceforge.io/>`_ Projekt für die Erstellung von reStructuredText und der Docutils-Suite;
es_419: el proyecto `Docutils &lt;https://docutils.sourceforge.io/&gt;`_ para crear reStructuredText y la suite Docutils;
es_co: el proyecto `Docutils <https://docutils.sourceforge.io/>`_para crear reStructuredText y la suite Docutils;
es_es: el proyecto `Docutils <https://docutils.sourceforge.io/>`_ para crear reStructuredText y la suite Docutils;
fa: پروژه `Docutils <https://docutils.sourceforge.io/>`_ برای ایجاد reStructuredText و مجموعهٔ Docutils؛
ja: その `Docutils <https://docutils.sourceforge.io/>`_ reStructuredText および Docutils スイートの作成プロジェクト；
ms: Projek `Docutils <https://docutils.sourceforge.io/>`_ kerana menghasilkan reStructuredText dan suit Docutils;
pt: o projeto `Docutils <https://docutils.sourceforge.io/>`_ por criar reStructuredText e o pacote Docutils;
ro: proiectul „Docutils <https://docutils.sourceforge.io/>”_ pentru crearea reStructuredText și suita Docutils;
sv: projektet `Docutils <https://docutils.sourceforge.io/>`_ för att skapa reStructuredText och Docutils-sviten;
zh_hans: 用于创建 reStructuredText 的 `Docutils <https://docutils.sourceforge.io/>`_ 项目和 Docutils 软件集；

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
ar: فريدريك لونده عن مشروع مرجع بايثون البديل الذي حصل منه سفنكس على العديد من الأفكار الجيدة.
bn: ফ্রেডরিক লুন্ড তার বিকল্প পাইথন রেফারেন্স প্রকল্পের জন্য যেখান থেকে স্ফিঙ্কস অনেক ভাল ধারণা পেয়েছিল।
de: Fredrik Lundh für sein Alternative Python Reference-Projekt, von dem Sphinx viele gute Ideen übernommen hat.
es_419: Fredrik Lundh por su proyecto Alternative Python Reference del que Sphinx obtuvo muchas buenas ideas.
es_co: Fredrik Lundh por su proyecto Alternative Python Reference del cual Sphinx obtuvo muchas buenas ideas.
es_es: Fredrik Lundh por su proyecto de referencia de Python alternativo del que Sphinx obtuvo bastantes buenas ideas.
fa: فردریک لوند (Fredrik Lundh) برای پروژه‌ی "Alternative Python Reference" (مرجع جایگزین پایتون) که از آن بسیاری از ایده‌های خوب برای Sphinx (اسفینکس) گرفته شد.
ja: フレドリック・ルンドフの代替案 Python参照 スフィンクスが多くの良いアイデアを得たプロジェクト。
ms: Fredrik Lundh untuk projek Rujukan Python Alternatif miliknya yang Sphinx gunakan untuk mengilhamkan banyak idea baik.
pt: Fredrik Lundh, pelo seu projeto de 'Referência Alternativa' em Python, do qual Sphinx obteve muitas boas ideias.
ro: Fredrik Lundh pentru proiectul său Alternative Python Reference, din care Sphinx a preluat multe idei bune.
sv: Fredrik Lundh för hans Alternative Python Reference-projekt från vilket Sphinx fick många bra idéer.
zh_hans: Fredrik Lundh 的 Alternative Python Reference 项目， Sphinx 从中得到了许多好的想法。

source: Contributors to the Python documentation
ar: المساهمون في توثيق بايثون
es_es: Colaboradores en la documentación de Python
fa: مشارکت کنندگان مستندات پایتون
ms: Penyumbang dokumentasi Python
pt: Colaboradores para a documentação do Python
ro: Contribuitorii la documentația Python
sv: Bidragsgivare till Python-dokumentationen

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
ar: لقد ساهم العديد من الأشخاص في لغة بايثون، ومكتبتها القياسية، وتوثيقها. راجع ‎ :source:`Misc/ACKS`في توزيعة مصدر بايثون للحصول على قائمة جزئية بالمساهمين.
bn: পাইথন ভাষা, পাইথন স্ট্যান্ডার্ড লাইব্রেরি এবং পাইথন ডকুমেন্টেশনে অনেক মানুষ অবদান রেখেছেন। অবদানকারীদের একটি আংশিক তালিকার জন্য পাইথন উৎস বিতরণে :source:`Misc/ACKS` দেখুন।
de: Viele Menschen haben zur Python-Sprache, zur Python-Standardbibliothek und zur Python-Dokumentation beigetragen. Eine teilweise Liste der Mitwirkenden finden Sie in der Python-Quellverteilung unter :source:`Misc/ACKS`.
es_419: Muchas personas han contribuido al lenguaje Python, la libreria estandar dePython, y la documentacion de Python. Ver :fuente:`Misc/ACKS` en la distribucion fuente de python para una lista parcual de contribuyentes.
es_co: Muchas personas han contribuído al lenguaje Python, la librería estándar de Python, y la documentación de Python. Ver:source:`Misc/ACKS` en la distribución fuente de Python para una lista parcial de colaboradores.
es_es: Muchas personas han contribuido al lenguaje Python, a la librería standard de Python y a la documentación de Python. Ver:source:`Misc/ACKS` en la distribución del código fuente de Python si se desea obtener una lista parcial de colaboradores
fa: افراد زیادی در توسعه زبان پایتون، کتابخانه استاندارد پایتون، و مستندات پایتون مشارکت داشته‌اند. برای مشاهده فهرستی از برخی از این مشارکت‌کنندگان، به :source:`Misc/ACKS` در توزیع سورس پایتون مراجعه کنید.
ja: 多くの人がPython言語、Python標準ライブラリ、およびPythonのドキュメントの開発に貢献してきました。見る :source:`Misc/ACKS` Pythonのソースコード配布物において、貢献者の一部の一覧が掲載されています。
ms: Ramai orang yang telah menyumbang kepada bahasa Python, pustaka standard Python dan dokumentasi Python. Lihat :source:`Misc/ACKS` dalam pengedaran sumber Python untuk sebahagian daripada senarai penyumbang.
pt: Muitas pessoas tem contribuído para a linguagem Python, a sua biblioteca padrão e a sua documentação. Consulte :source:`Misc/ACKS` na distribuição do código do Python para ver uma lista parcial dos colaboradores.
ro: Multe persoane au contribuit la limbajul Python, la biblioteca standard Python și la documentația Python. Consultați :source:`Misc/ACKS` din distribuția sursă Python pentru o listă parțială a contribuitorilor.
sv: Många människor har bidragit till Python-språket, Pythons standardbibliotek och Pythons dokumentation. Se :source:`Misc/ACKS` i Pythons källdistribution för en partiell lista över bidragsgivare.
zh_hans: 有很多对 Python 语言，Python 标准库和 Python 文档有贡献的人，随 Python 源代码分发的 :source:`Misc/ACKS` 文件列出了部分贡献者。

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
ar: فقط من خلال مدخلات ومساهمات مجتمع بايثون، تمتلك بايثون مثل هذه الوثائق التعليمية الرائعة -- شكرًا لكم!
bn: শুধুমাত্র পাইথন কমিউনিটির যোগদান এবং অবদানের জন্যই পাইথনের এমন চমৎকার ডকুমেন্টেশন রয়েছে -- ধন্যবাদ!
de: Nur durch die Beiträge der Python-Gemeinschaft ist es möglich, dass Python eine so wunderbare Dokumentation hat - Danke!
es_419: La increible documentacion de python ha sido posible gracias al aporte y contribucion de la comunidad de Python, Gracias!
es_co: Es sólo con la entrada y contribuciones de la comunidad de Python que Python tiene esta increíble documentación - ¡Gracias!
es_es: Es tan sólo debido a las entradas y contribuciones de la comunidad de Python que Python tenga tan extensa y maravillosa documentación. ¡Gracias!
fa: فقط با مشارکت‌ها و کمک‌های جامعه پایتون است که پایتون چنین مستندات فوق‌العاده‌ای دارد -- سپاس از شما!
ja: Pythonの素晴らしいドキュメントは、Pythonコミュニティの皆さんのご意見とご協力があってこそ実現したものです。本当にありがとうございます！
ms: Input dan sumbangan daripada komuniti Python membolehkan Python mempunyai dokumentasi yang mengagumkan -- Terima Kasih!
pt: É apenas com a entrada e contribuições da comunidade Python que o Python tem uma documentação tão maravilhosa - Obrigado!
ro: Doar datorită contribuțiilor comunității Python, Python dispune de o documentație atât de minunată — Vă mulțumim!
sv: Det är bara tack vare Python-gruppens insatser och bidrag som Python har en så underbar dokumentation -- Tack!
zh_hans: 正是由于Python社区所有贡献者们的努力付出，Python才有了如此精彩的文档。-- 感谢你们！

source: About these documents
bn: এই ডকুমেন্ট সম্পর্কে
de: Über diese Dokumente
es_419: Acerca de estos documentos
es_co: Acerca de estos documentos
ja: これらについて ドキュメント
zh_hans: 关于这些文档

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
bn: এই ডকুমেন্টগুলো `Sphinx`_ , যা একটি ডকুমেন্ট প্রসেসর যা বিশেষভাবে পাইথন ডকুমেন্টেশনের জন্য লেখা হয়েছে, সেটা দ্বারা `restructuredText`_ উৎস থেকে তৈরি করা হয়েছে।
de: Diese Dokumente werden aus `reStructuredText`_-Quellen von `Sphinx`_ generiert, einem Dokumentenprozessor, der speziell für die Python-Dokumentation geschrieben wurde.
es_419: Estos documentos estan generados por 'reStructuredText'_fuentes por 'Sphinx'_, un procesador de documentos escrito especificamento para la documentacion de Pyhton.
es_co: Estos documentos se generan usando`reStructuredText`_ de `Sphinx`_, un procesador de documentos específicamente escrito para la documentación de Python.
ja: これらの文書は `reStructuredText`_ 出典 `Sphinx`_, Pythonのドキュメント専用に開発されたドキュメント処理ツール。
zh_hans: 这些文档是用 `Sphinx`_ 从 `reStructuredText`_ 源生成的，`Sphinx` 是一个专为处理 Python 文档而编写的文档生成器。

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
bn: ফ্রেড এল. ড্রেক, জুনিয়র, মূল পাইথন ডকুমেন্টেশন টুলসেটের স্রষ্টা এবং বেশিরভাগ বিষয়বস্তুর লেখক;
de: Fred L. Drake, Jr. ist der Ersteller des ursprünglichen Python-Dokumentations-Toolsets und Verfasser eines Großteils des Inhalts;
es_419: Fred L. Drake,Jr., el creador de las herramientas de documentacion de Python y escritor de mucho del contenido.
es_co: Fred L. Drake, Jr., el creador del conjunto original de documentación de Python y escritor de gran parte del contenido;
ja: フレッド・L・ドレイク・ジュニアは、オリジナルのPythonドキュメントツールセットの創作者であり、その内容の大部分を執筆した人物です。
zh_hans: Fred L. Drake, Jr.，原始 Python 文件工具集的創造者以及一大部份內容的作者；

source: Contributors to the Python Documentation
bn: পাইথন ডকুমেন্টেশনে অবদানকারীরা
de: Mitwirkende an der Python-Dokumentation
es_419: Contribuidores a la documentación de Python
es_co: Colaboradores a la documentación de Python
ja: Python ドキュメントの寄稿者
zh_hans: Python 文档的贡献者
