Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/bugs.po
Languages: cs, de, es_es, fa, hu, id_id, ja, ko, ko_kr, ru

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
de: Wenn das von Ihnen gemeldete Problem noch nicht in der Liste enthalten ist, melden Sie sich bei GitHub an. Falls Sie noch kein GitHub-Konto haben, erstellen Sie ein neues Konto mit dem Link "Registrieren". Es ist nicht möglich, einen Fehlerbericht anonym zu erstellen.
es_es: Si el problema que estás enviando no está en la lista, inicia sesión en GitHub. Si aún no tienes una cuenta de GitHub, crea una cuenta nueva usando el enlace "Registrarse". No es posible enviar un informe de error de forma anónima.
fa: اگر مشکلی که گزارش می دهید در لیست موجود نباشد، وارد GitHub شوید. اگر قبلاً حساب GitHub ندارید، با استفاده از لینک "Sign up" یک حساب جدید ایجاد کنید. ارسال گزارش باگ به صورت ناشناس امکان پذیر نیست.
hu: Jeśli problemu, który zgłaszasz, nie ma jeszcze na liście, zaloguj się do GitHuba. Jeśli nie masz jeszcze konta GitHub, stwórz nowe konto używając linku „Sign up”. Nie da się stworzyć zgłoszenia anonimowo.
id_id: Jika masalah yang Anda laporkan belum ada dalam daftar, masuk ke GitHub. Jika Anda belum memiliki akun GitHub, buat akun baru menggunakan tautan "Daftar". Anda tidak dapat mengirimkan laporan bug secara anonim.
ja: 報告している問題がリストにない場合は、GitHubにログインしてください。GitHubアカウントをお持ちでない場合は、「Sign up」リンクから新しいアカウントを作成してください。匿名でのバグ報告の提出はできません。
ko: Jeśli problemu, który zgłaszasz, nie ma jeszcze na liście, zaloguj się do GitHuba. Jeśli nie masz jeszcze konta GitHub, stwórz nowe konto używając linku „Sign up”. Nie da się stworzyć zgłoszenia anonimowo.
ko_kr: 보고하려는 문제가 목록에 없는 경우 깃헙에 로그인하세요. 깃헙 계정이 없는 경우 "가입" 링크를 사용하여 새 계정을 만드세요. 익명으로 버그 리포트를 제출하는 것은 지원되지 않습니다.
ru: Если вашей проблемы нет в списке, войдите в GitHub. Если у вас ещё нет учетной записи GitHub, создайте её, перейдя по ссылке "Sign up". Невозможно отправить отчёт об ошибке анонимно.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
de: Da Sie jetzt angemeldet sind, können Sie ein Problem melden. Klicke auf die Schaltfläche "Neues Problem" in der oberen Leiste, um ein neues Problem zu melden.
es_es: Ahora que has iniciado sesión, puedes enviar un problema. Haz clic en el botón "Nuevo problema" en la barra superior para informar de un nuevo problema.
fa: اکنون که وارد سیستم شده اید، می توانید یک مشکل ثبت کنید. برای گزارش یک مشکل جدید، روی دکمه "New issue" در نوار بالا کلیک کنید.
hu: Będąc zalogowanym możesz wysłać zgłoszenie. Kliknij przycisk "Nowe zgłoszenie" w górnym pasku, aby wysłać nowe zgłoszenie.
id_id: Setelah masuk, Anda dapat mengirimkan masalah. Klik tombol "Masalah baru" di bilah atas untuk melaporkan masalah baru.
ja: 現在ログイン中です。問題報告を送信できます。新しい問題報告を行うには、上部バーの「新しい問題報告」ボタンをクリックしてください。
ko: Będąc zalogowanym możesz wysłać zgłoszenie. Kliknij przycisk "Nowe zgłoszenie" w górnym pasku, aby wysłać nowe zgłoszenie.
ko_kr: 로그인하신 뒤에, 이슈를 제출하실 수 있습니다. 상단 바의 "새 이슈" 버튼을 클릭하여 새로운 이슈를 보고하세요.
ru: После входа в систему вы можете отправить отчёт об ошибке. Нажмите на кнопку "New issue" в верхней панели, чтобы сообщить о новой проблеме.

source: The submission form has two fields, "Title" and "Comment".
de: Das Einreichungsformular hat zwei Felder: "Titel" und "Kommentar".
es_es: El formulario de envío tiene dos campos, "Título" y "Comentario".
fa: فرم ارسال شامل دو فیلد است، "Title" و "Comment".
hu: Formularz zgłoszenia ma dwa pola: „Tytuł” oraz „Komentarz”.
id_id: Formulir pengajuan memiliki dua kolom, "Judul" dan "Komentar".
ja: 提出フォームには「タイトル」と「コメント」の2つのフィールドがあります。
ko: Formularz zgłoszenia ma dwa pola: „Tytuł” oraz „Komentarz”.
ko_kr: 제출 양식에는 '제목'과 '내용'라는 두 개의 필드가 있습니다.
ru: Форма отправки содержит два поля: "Title" и "Comment".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
de: Geben Sie für das Feld "Titel" eine *sehr* kurze Beschreibung des Problems ein; weniger als zehn Wörter sind gut.
es_es: Para el campo "Título", ingrese una descripción *muy* breve del problema; menos de diez palabras es bueno.
fa: برای بخش "Title", یک توضیح کوتاه از مشکل وارد کنید؛ کمتر از ده کلمه مناسب است.
id_id: Untuk kolom "Judul", masukkan deskripsi yang *sangat* singkat tentang masalah; kurang dari sepuluh kata sudah cukup.
ja: 「タイトル」欄には、問題の*非常に*短い説明を入力してください。10語未満が望ましいです。
ko_kr: "제목" 필드에는 문제에 대한 *매우* 짧은 설명을 입력하세요. 10단어 이하가 좋습니다.
ru: В поле "Title" введите *очень* краткое описание проблемы; меньше десяти слов — это хорошо.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
cs: V poli „Komentář“ podrobně popište problém. Zejména uveďte, co jste udělali, co jste očekávali, že nastane, a co se skutečně stalo. Nezapomeňte uvést všechny zúčastněné rozšiřující moduly a hardwarovou a softwarovou platformu, kterou jste používali (včetně informace o verzích).
de: Beschreiben Sie im Feld "Kommentar" das Problem im Detail und geben Sie an, was Sie erwartet haben und was tatsächlich passiert ist. Geben Sie unbedingt an, ob Erweiterungsmodule betroffen waren und welche Hardware- und Softwareplattform Sie verwendet haben (ggf. mit Versionsangaben).
es_es: En el campo "Comentario", describe el problema en detalle, incluyendo qué es lo que esperabas que sucediera y que es lo que ha sucedido. Recuerda incluir cualquier módulo de extensión envuelto en el problema, y que hardware y plataforma de software estabas utilizando (incluyendo información de versión apropiadamente).
fa: در قسمت "Comment", مشکل را با جزئیات بیان کنید، از جمله اینکه انتظار داشتید چه اتفاقی بیفتد و چه چیزی واقعاً اتفاق افتاد. حتماً اشاره کنید که آیا ماژول های افزونه ای درگیر بودند یا خیر و از چه سخت افزار و پلتفرم نرم افزاری استفاده می کردید (شامل اطلاعات نسخه در صورت لزوم).
hu: A "Comment" mezőben írd le részletesen a problémádat, beleértve azt is, aminek szerinted történnie kellett volna és ehelyett mi történt. Feltéltlenül tüntesd fel, hogy bármlyen kiterjesztés modul jelen volt-e és milyen hardwares és szoftveres környezetet használtál (verziószámmal együtt, ha lehetséges).
id_id: Pada kolom "Komentar", jelaskan masalah secara rinci, termasuk apa yang Anda harapkan terjadi dan apa yang terjadi. Pastikan untuk menyertakan apakah ada modul ekstensi yang terlibat, dan platform perangkat keras dan perangkat lunak apa yang Anda gunakan (termasuk informasi versi yang sesuai).
ja: 「コメント」欄に、問題の詳細を説明してください。具体的には、期待していた結果と実際に起こったことを含めて記載してください。必ず、以下のいずれかが含まれているかどうかを明記してください 拡張 モジュール 関与した内容、および使用していたハードウェアとソフトウェアのプラットフォーム（適切な場合、バージョン情報を含む）を明記してください。
ko: "내용(Comment)" 필드에는, 실행시 예상되는 결과와 실제의 실행결과를 포함한, 문제의 상세내용을 적어주세요. 내용에는 어떤 외부 모듈이 포함되어 있는지, 그리고 사용했던 하드웨어 및 소프트웨어 플랫폼을 버전 정보가 포함되어 있는지 확인해주시기 바랍니다.
ko_kr: "내용" 필드에는, 실행시 예상되는 결과와 실제의 실행결과를 포함한, 문제의 상세내용을 적어주세요. 내용에는 관련된 외부 모듈들에 대한 정보가 포함되어 있는지 (그리고 사용했던 하드웨어 및 소프트웨어 플랫폼을 버전 정보가 포함되어 있는지) 확인해주시기 바랍니다.
ru: В поле "Comment" подробно опишите проблему, включая то, что вы ожидали и что произошло на самом деле. Обязательно укажите, были ли задействованы какие-либо модули расширений, а также информацию о используемом аппаратном и программном обеспечении (включая соответствующую версию).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
de: Jeder Fehlerbericht wird von einem Entwickler überprüft, der bestimmt, was getan werden muss, um das Problem zu beheben. Sie erhalten eine Aktualisierung jedes Mal, wenn eine Aktion zum Fehler durchgeführt wird.
es_es: Cada informe de problema se revisará por un desarrollador quien determinará qué se necesita hacer para corregir el problema. Recibirás una actualización cada vez que se tome alguna acción sobre el problema.
fa: هر گزارش مشکل توسط یک توسعه دهنده بررسی می شود تا تعیین کند چه اقداماتی برای رفع مشکل لازم است. هر بار که اقدامی روی مشکل انجام شود، به روزرسانی دریافت خواهید کرد.
hu: Każde zgłoszenie będzie zweryfikowane przez twórcę oprogramowania, który oceni, co musi być zrobione, aby naprawić problem. Otrzymasz aktualizację za każdym razem, gdy wobec zgłoszenia zostanie podjęte działanie.
id_id: Setiap laporan masalah akan ditinjau oleh pengembang yang akan menentukan apa yang perlu dilakukan untuk memperbaiki masalah tersebut. Anda akan menerima pembaruan setiap kali ada tindakan yang diambil untuk mengatasi masalah tersebut.
ja: 各問題報告は、開発者が確認し、問題を解決するために必要な対応を判断します。問題に対して対応が実施されるたびに、その都度更新情報が提供されます。
ko: Każde zgłoszenie będzie zweryfikowane przez twórcę oprogramowania, który oceni, co musi być zrobione, aby naprawić problem. Otrzymasz aktualizację za każdym razem, gdy wobec zgłoszenia zostanie podjęte działanie.
ko_kr: 각 이슈 리포트는 개발자가 검토하여 문제 해결을 위해 필요한 조치를 결정합니다. 문제에 대한 조치가 취해질 때마다 업데이트를 받게 됩니다.
ru: Каждый отчет о проблеме будет рассмотрен разработчиком, который определит, что нужно сделать для устранения проблемы. Вы будете получать уведомления о каждом действии по вашему отчёту.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
cs: `Jak správně hlásit chyby <https://www.chiark.greenend.org.uk/~sgtatham/bugs-cz.html>`_
de: `Effektiv Fehler melden <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
es_es: Cómo Informar Bugs de Forma Efectiva <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>
fa: `نحوه گزارش اشکالات به طور موثر '<https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_'
id_id: `Bagaimana Cara Melaporkan Bug Secara Efektif <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
ja: バグを効果的に報告する方法 <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
ko: `효과적으로 버그를 리포트 하는 방법 <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
ko_kr: `효과적으로 버그를 리포트 하는 방법 <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
ru: `Как эффективно сообщать об ошибках <https://www.chiark.greenend.org.uk/~sgtatham/bugs-ru.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
cs: Článek podrobně popisuje, jak vytvořit užitečné hlášení o chybě. Vysvětluje, jaké informace jsou užitečné a proč jsou užitečné.
de: Artikel, der detailliert beschreibt, wie man einen nützlichen Fehlerbericht erstellt. Dieser beschreibt, welche Art von Informationen nützlich sind und warum sie nützlich sind.
es_es: Artículo que trata en detalle sobre cómo crear un reporte de bug útil. Describe qué clase de información es útil y por qué es útil.
fa: مقاله‌ای که به‌طور مفصل به چگونگی ایجاد یک گزارش باگ مفید می‌پردازد. این مقاله بیان می کند که چه نوع اطلاعاتی مفید هستند و چرا این اطلاعات مفید می باشند.
hu: Egy cikk, ami részletesen belemegy, hogyan kell hasznos hibajelentést írni. Leírja milyen fajta információ és az miért hasznos.
id_id: Artikel yang menjelaskan secara detail tentang cara membuat laporan bug yang berguna. Artikel ini menjelaskan jenis informasi apa yang berguna dan mengapa informasi tersebut berguna.
ja: バグ報告を作成する方法について詳細に説明した記事です。この記事では、どのような情報が有用であり、なぜ有用なのかを説明しています。
ko: 본문은 유용한 버그 리포트를 작성하는 방법에 대해 자세히 다룹니다. 본문은 어떤 정보가 유용하고 왜 그것이 유용한지를 설명합니다.
ko_kr: 본문은 유용한 버그 리포트를 작성하는 방법에 대해 자세히 다룹니다. 본문은 어떤 정보가 유용하고 왜 유용한지를 설명합니다.
ru: Статья, которая подробно описывает, как создать полезный отчет об ошибке. В ней описывается, какая информация является полезной и почему.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
de: `Richtlinien zum Schreiben eines Fehlerberichts <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
es_es: Directrices para escribir errores <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
fa: `دستورالعمل های نوشتن اشکال<https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
id_id: 'Pedoman Penulisan Bug' <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
ja: バグ報告ガイドライン <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
ko_kr: `버그 작성 가이드라인 <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
ru: `Руководство по написанию отчетов об ошибках <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
cs: Tipy pro psaní dobré zprávy o chybě. Některé jsou specifické pro projekt Mozilla, ale představují obecné osvědčené postupy.
de: Informationen zum Schreiben eines guten Fehlerberichts. Einige davon sind spezifisch für das Mozilla-Projekt, beschreiben aber allgemeine bewährte Praktiken.
es_es: Información sobre cómo escribir un buen informe de error. Algo de esto es específico del proyecto Mozilla, pero describe en general buenas prácticas.
fa: اطلاعاتی درباره نوشتن گزارش های خوب اشکالات (باگ ها). برخی از این موارد مختص پروژه موزیلا است، اما اصول کلی خوبی را توصیف می کند.
hu: Információ, hogy hogyan kell jó hibajelentése írni. Néhány része a Mozilla projekthez kapcsolódik, de leírja az általánosan helyes gyakorlatot.
id_id: Informasi tentang menulis laporan bug yang baik. Beberapa di antaranya khusus untuk proyek Mozilla, tetapi menjelaskan praktik-praktik umum yang baik.
ja: バグ報告を書く際の注意点。 このうちの一部はMozillaプロジェクトに特有のものですが、一般的な良い実践方法を説明しています。
ko: 좋은 버그 리포트를 작성하는 방법에 관한 정보입니다. 일부 정보는 모질라 프로젝트에 한정되지만, 폭넓게 사용할 수 있는 좋은 예시들을 기술하고 있습니다.
ko_kr: 좋은 버그 리포트를 작성하는 방법에 관한 정보입니다. 일부 정보는 모질라 프로젝트에 한정되지만, 폭넓게 사용할 수 있는 좋은 예시들을 기술하고 있습니다.
ru: Информация о том, как написать хороший отчет об ошибке. Некоторые рекомендации относятся к проекту Mozilla, но описывают общие принципы.

source: Getting started contributing to Python yourself
cs: Úvod do přispívání do Pythonu vlastními silami
de: Starte selbst etwas zu Python beizutragen
es_es: Comenzando tú mismo a contribuir a Python
fa: خودتان شروع به مشارکت در پایتون کنید.
hu: Első lépések a Pythonhoz való hozzájárulás elkezdéséhez
id_id: Mulai berkontribusi untuk Python sendiri
ja: Pythonへの貢献を始めてみましょう
ko: 직접 Python에 기여하는 첫걸음 (Getting started contributing to Python yourself)
ko_kr: 직접 Python에 기여하는 첫걸음
ru: Как начать вносить свой вклад в Python

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
cs: Po nahlášení chyb na které narazíte můžete sami udělat další krok, opravit je a zaslat záplaty (patche). Další informace o tom, jak začít chyby opravovat naleznete v `Python Developer's Guide`_. Pokud máte dotazy, anglicky psaný `core-mentorship mailing list`_ je přívětivé místo kde se vám dostane odpovědí na všechny vaše otázky ohledně opravy chyb v Pythonu, co vás jen napadnou.
de: Neben dem Melden von Fehlern, die Sie finden, können Sie auch Patches einreichen, um sie zu beheben. Weitere Informationen dazu, wie Sie mit dem Patchen von Python beginnen können, finden Sie im `Python Entwicklerleitfaden`_. Wenn Sie Fragen haben, ist die `Kern-Mentorenschaft Mailingliste`_ ein freundlicher Ort, um Antworten auf alle Fragen zum Prozess der Behebung von Problemen in Python zu erhalten.
es_es: Yendo más allá de informar sobre los errores que encuentres, eres bienvenido a enviar parches para arreglarlos. Puedes encontrar más información sobre cómo comenzar a parchear Python en la `Python Developer's Guide`_. Si tienes preguntas, `core-mentorship mailing list`_ es un gran lugar donde tener respuestas para cualquier y toda pregunta pertinente al proceso de reparación de problemas en Python.
fa: علاوه بر گزارش اشکالاتی که پیدا می کنید، می توانید وصله هایی برای رفع آن ها ارسال کنید. می توانید اطلاعات بیشتری درباره ی نحوه ی شروع به وصله زدن Python را در "`Python Developer's Guide`_" پیدا کنید. اگر سوالی دارید، "`core-mentorship mailing list`_" جای دوستانه ای برای دریافت پاسخ به هر سوال مربوط به فرآیند رفع اشکالات در Python است.
hu: A hibajelentések bejelentése mellett, szívesen vesszük az azokhoz való javítások beadását is. Ehhez szükséges további információt a `Python Developer's Guide`_-ban találsz. Ha bármi kérdésed van, a `core-mentorship mailing list`_ egy barátságos hely, hogy válaszokat szerezz minden kérdésedre, ami a Python hibák javításával kapcsolatos.
ja: バグを発見した際の報告だけでなく、その修正パッチの提出も歓迎しています。Pythonのパッチ適用に関する詳細な情報は、Python 開発者ガイド`_. をご参照ください。質問がある場合は、`core-mentorship メーリングリスト`_ Pythonでの問題解決プロセスに関するあらゆる質問に答えてくれる、親切な場所です。
ko: 발견한 버그를 보고하는것을 넘어서, 직접 그 버그를 수정하는 패치를 제출할 수도 있습니다. `Python Developer's Guide`_에서 Python 패치를 시작하는 방법에 관한 정보를 찾을 수 있습니다. 궁금한 것이 있다면, `core-mentorship mailing list`_에서 Python의 버그수정에 관한 어떤 종류의 질문이라도 그 답을 찾을 수 있을 것입니다.
ko_kr: 발견한 버그를 보고하는것을 넘어서, 직접 그 버그를 수정하는 패치를 제출할 수도 있습니다. `Python Developer's Guide`_에서 Python 패치를 시작하는 방법에 관한 정보를 찾을 수 있습니다. 궁금한 것이 있다면, `core-mentorship mailing list`_에서 Python의 버그수정에 관한 어떤 종류의 질문이라도 그 답을 찾을 수 있을 것입니다.
ru: Помимо отправки сообщений об обнаруженных вами ошибках, вы также можете предложить исправления для них. Более подробную информацию о том, как начать исправлять ошибки в Python, вы можете найти в `Руководстве разработчика Python`_. Если у вас возникнут вопросы, `список рассылки core-mentorship`_ — дружелюбное место, где можно получить ответы на любые вопросы, касающиеся процесса исправления ошибок в Python.

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`issue tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
id_id: Jika Anda menemukan bug dalam dokumentasi ini atau ingin mengusulkan perbaikan, silakan kirimkan laporan bug di :ref:`issue tracker <using-the-tracker>`. Jika Anda memiliki saran tentang cara memperbaikinya, sertakan juga.
ru: Если вы нашли ошибку в этой документации или хотели бы предложить улучшение, пожалуйста, отправьте отчёт об ошибке в :ref:`систему отслеживания ошибок <using-the-tracker>`. Если у вас есть предложение по её исправлению, включите его также.

source: If the bug or suggested improvement concerns the translation of this documentation, submit the report to the `translation’s repository <TRANSLATION_REPO_>`_ instead.
ru: Если ошибка или предложение по улучшению касается перевода этой документации, отправьте отчёт в `репозиторий перевода <TRANSLATION_REPO_>`_.

source: If you find a bug in the theme (HTML / CSS / JavaScript) of the documentation, please submit a bug report on the `python-doc-theme issue tracker <https://github.com/python/python-docs-theme>`_.
id_id: Jika Anda menemukan bug pada tema (HTML / CSS / JavaScript) dari dokumentasi, silakan kirimkan laporan bug pada `python-doc-theme issue tracker <https://github.com/python/python-docs-theme>`_.
ru: Если вы обнаружили ошибку в теме (HTML / CSS / JavaScript) документации, отправьте отчёт об ошибке в `систему отслеживания ошибок python-doc-theme <https://github.com/python/python-docs-theme>`_.
