Repository: python-docs-translations/transifex-automations
Catalog: */LC_MESSAGES/bugs.po
Languages: cs, de, es_es, fa, hu, id_id, ja, ko, ko_kr, ru

source: Dealing with Bugs
cs: Řešení chyb
de: Umgang mit Fehlern
es_es: Lidiando con los bugs.
fa: مقابله با باگ‌ها
hu: Hibák kezelése
id_id: Berurusan dengan Bug
ja: バグの対応
ko: 버그를 처리하는 방법
ko_kr: 버그를 처리하는 방법
ru: Работа с ошибками

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
cs: Python je robustní programovací jazyk známý svou stabilitou. Aby si tuto pověst udržel, vývojáři rádi uslyší o všech problémech, na které jste při používání Pythonu narazili.
de: Python ist eine ausgereifte Programmiersprache, die einen Ruf für Stabilität erworben hat. Um diesen Ruf aufrechtzuerhalten, möchten die Entwickler über alle Mängel informiert werden, die Sie in Python finden.
es_es: Python es un lenguaje de programación maduro que tiene establecida una reputación por su estabilidad. Para mantener esta reputación, los desarrolladores les gustaría escuchar cualquier deficiencia que puedas encontrar en Python.
fa: پایتون یک زبان برنامه نویسی بالغ است که به خاطر پایداری اش شهرت یافته است. برای حفظ این شهرت، توسعه دهندگان مایلند از هرگونه نواقصی که شما در پایتون پیدا می کنید، مطلع شوند.
hu: Python egy kiforrott programozási nyelv, amely megalapozottan híres a stabilításáról. Annak érdekében, hogy ez a hírnév megmaradjon, a fejlesztők szeretnének tudni bármilyen hiányosságról, amit találsz a Python nyelvben
id_id: Python adalah bahasa pemrograman yang sudah matang dan memiliki reputasi yang baik dalam hal stabilitas. Untuk mempertahankan reputasi ini, para pengembang ingin mengetahui kekurangan yang Anda temukan di Python.
ja: Pythonは成熟したプログラミング言語であり、安定性において高い評価を得ています。 この評価を維持するため、開発者はPythonにおいて発見した不具合や改善点についてお知らせいただきたいと考えています。
ko: Python은 안정성으로 명성을 얻은 성숙한 프로그래밍 언어입니다. 이 명성을 유지하기 위해, 개발자들은 여러분이 Python 안에서 찾은 결함을 알고 싶어합니다.
ko_kr: Python은 성숙한 프로그래밍 언어이며, 안정성에 대하여 명성을 확보하고 있습니다. 이러한 명성을 지키기 위하여, 개발자들은 여러분이 Python에서 발견한 문제점들을 알고 싶어합니다.
ru: Python - это зрелый язык программирования, завоевавший репутацию благодаря своей стабильности. Для поддержания такой репутации разработчики хотели бы знать о любых найденных вами в Python недочётах.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
cs: Mnohdy je rychlejší svoje nalezené chyby hned opravit a zaslat záplaty (patche), neboť se tím celý proces zjednodušuje a nemusí se do něj zapojit tolik lidí. Naučte se jak sami :ref:`přispívat <contributing-to-python>`.
de: Manchmal kann es schneller sein, Fehler selbst zu beheben und Patches zu Python beizutragen, da dies den Prozess beschleunigt und weniger Menschen involviert. Erfahren Sie, wie Sie :ref:`beitragen <contributing-to-python>` können.
es_es: Aveces puede ser mas rápido que uno mismo repite los bugs y contribuya con parches para Python, así como optimizar este proceso además de involucrar menos personas. Aprende como :ref:`contribute <contributing-to-python>`.
fa: برخی مواقع، درست کردن باگ ها به دست خودتان و اضافه کردن پچ ها به پایتون می تواند فرآیند را موثر تر کند، زیرا این کار تعداد افراد دخیل را کاهش می دهد و فرآیند را ساده تر می کند. یاد بگیرید چگونه انجام دهید در :ref:`contribute <contributing-to-python>`.
hu: Néha gyorsabb lehet, ha magadtól javítod ki a hibákat és javításokkal hozzájárulsz a Pythonhoz, mivel ez egyszerűbbé teszi a folyamatot és kevesebb embert érint. Tanuld meg hogyan :ref:`járulhatsz hozzá<contributing-to-python>`.
id_id: Kadang-kadang bisa lebih cepat untuk memperbaiki bug sendiri dan menyumbangkan patch ke Python karena menyederhanakan proses dan melibatkan lebih sedikit orang. Pelajari bagaimana caranya :ref:`contribute <contributing-to-python>`.
ja: バグを自分で修正し、パッチを貢献する方が、場合によってはより迅速な解決策となることがあります Python プロセスを効率化し、関与する人数を削減するためです。学び方 :ref:`貢献 <contributing-to-python>`.
ko: 여러분 스스로 버그를 고치고 파이썬의 패치에 기여하시면, 절차를 간소화하고 더 적은 사람이 일에 엮이므로, 때때로 일이 더 빨라질 수 있습니다. 어떻게 :ref:`기여 <contributing-to-python>`.할 수 있는지 알아봅시다.
ko_kr: 여러분 스스로 버그를 고치고 파이썬의 패치에 기여하시면, 절차를 간소화하고 더 적은 사람이 일에 엮이므로, 때때로 일이 더 빨라질 수 있습니다. 어떻게 :ref:`기여 <contributing-to-python>`.할 수 있는지 알아봅시다.
ru: Иногда бывает быстрее самостоятельно исправить ошибки и внести патчи в Python, так как это упрощает процесс и вовлекает меньше людей. Узнайте, как :ref:`внести свой вклад<contributing-to-python>`.

source: Documentation bugs
cs: Chyby v dokumentaci
de: Dokumentationsfehler
es_es: Errores de documentación
fa: ایرادات مستندات
hu: Dokumentációs hibák
id_id: Bug dokumentasi
ja: ドキュメントのバグ
ko: 문서 오류
ko_kr: 버그 문서화
ru: Ошибки в документации

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
cs: Pokud v této dokumentaci najdete chybu nebo pokud chcete navrhnout zlepšení, další postup záleží na tom, zda se chyba týká jen českého překladu, nebo i anglického originálu. Pokud se jedná o chybu v českém překladu, otevřete prosím ticket na adrese https://github.com/python/python-docs-cs/issues. Pokud máte navrženou opravu, uveďte ji také. Chyby v anglickém originále reportujte v anglickém jazyce do projektového trackeru chyb. Opět uveďte návrh opravy, pokud jej máte.
de: Wenn Sie einen Fehler in dieser Dokumentation finden oder eine Verbesserung vorschlagen möchten, geben Sie bitte einen Fehlerbericht auf dem :ref:`Fehler-Erfasser <using-the-tracker>` ab. Wenn Sie einen Vorschlag zur Behebung haben, fügen Sie diesen ebenfalls hinzu.
es_es: Si encuentra algún bug en esta documentación o quisiera proponer alguna mejora, por favor, envía un informe de fallo a :ref:`tracker <using-the-tracker>`. Si tiene alguna sugerencia sobre como solucionar dicho bug, inclúyela también.
fa: اگر در این مستندات باگ پیدا کردید یا می خواهید بهبودی پیشنهاد دهید، لطفاً یک گزارش باگ در :ref:`tracker <using-the-tracker>` ثبت کنید. اگر پیشنهادی برای رفع آن دارید، آن را نیز ضمیمه کنید.
ja: このドキュメントにバグを発見した場合、または改善案を提案したい場合は、以下のリンクからバグ報告を提出してください :ref:`トラッカー <using-the-tracker>`. 改善方法に関するご提案がある場合は、併せてご記入ください。
ko_kr: 이 문서에서 버그를 발견하거나 개선방안을 제안하고자 하는 경우 이 문서 :ref:`tracker <using-the-tracker>`에 버그를 보고해주세요. 버그 수정방법이 있다면 같이 보고해주세요.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
de: Sie können auch einen Diskussionsbeitrag in unserem `Dokumentation Discourse-Forum <https://discuss.python.org/c/documentation/26>`_ erstellen.
es_es: También puedes abrir un tema de discusión en nuestro foro de `Documentación Discourse <https://discuss.python.org/c/documentation/26>`_.
fa: شما همچنین می توانید یک مورد بحث را در `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_ باز کنید.
id_id: Anda juga dapat membuka item diskusi di forum `Documentation Discourse kami <https://discuss.python.org/c/documentation/26>`_.
ja: また、ディスカッションを開始することもできます要素 当社の「ドキュメント・ディスカッション・フォーラム」において <https://discuss.python.org/c/documentation/26>`_.
ko_kr: 또한 `문서 토론 포럼 <https://discuss.python.org/c/documentation/26>`_에서 새로운 토의를 새롭게 시작할 수 있습니다.
ru: Вы также можете начать обсуждение на нашем `форуме Documentation Discourse <https://discuss.python.org/c/documentation/26>`_.

source: If you find a bug in the theme (HTML / CSS / JavaScript) of the documentation, please submit a bug report on the `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_.
es_es: Si encuentra un error en el tema (HTML / CSS / JavaScript) de la documentación, por favor envíe un informe de error en el `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_.
fa: اگر در پوسته (HTML / CSS / JavaScript) مستندات مشکلی پیدا کردید، لطفاً گزارش یک مشکل را در `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_ ثبت کنید.
ko_kr: 문서의 테마(HTML/CSS/JavaScript)에서 버그를 발견한 경우 `python-doc-theme 버그 추적기 <https://github.com/python/python-docs-theme>`_에 버그 리포트를 제출해 주세요.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
cs: Nemáte-li čas na to vyplňovat issue v trackeru, můžete chyby v anglické dokumentaci hlásit na adresu docs@python.org (chyby ve fungování pythonu lze oznámit na python-list@python.org). Mailing list 'docs@' spravují dobrovolníci; může to chvíli trvat, než dostanete odpověď.
de: Wenn Sie wenig Zeit haben, können Sie Dokumentationsfehlerberichte auch per E-Mail an docs@python.org senden (Verhaltensfehler können an python-list@python.org gesendet werden). 'docs@' ist eine Mailingliste, die von Freiwilligen betrieben wird; Ihre Anfrage wird zur Kenntnis genommen, es kann jedoch eine Weile dauern, bis sie bearbeitet wird.
es_es: Si estás justo de tiempo, puedes también enviar informes de fallos por email a docs@python.org (los bugs de comportamiento se enviarán a python-list@python.org). 'docs@' es una lista de correo mantenida por voluntarios; se notificará tu petición, y es posible que tome cierto tiempo procesarla.
fa: اگر زمان کمی دارید، می توانید گزارش های اشکالات مستندات را به آدرس ایمیل docs@python.org ارسال کنید (اشکالات رفتاری را می توانید به python-list@python.org بفرستید). «docs@» یک لیست ایمیل است که توسط داوطلبان اداره می شود؛ درخواست شما مورد توجه قرار خواهد گرفت، هرچند ممکن است مدتی طول بکشد تا پردازش شود.
ja: 時間が足りない場合は、以下の方法もご利用いただけます 電子メール ドキュメントのバグ報告を docs@python.org (行動に関するバグは、以下の宛先に送信できます python-list@python.org). 'docs@' ボランティアによって運営されているメーリングリストです; ご要望は承りますが、処理に時間がかかる場合がございます。
ko_kr: 만약 시간이 부족하실 경우, docs@python.org에 이메일을 통해 오류를 보고하실 수도 있습니다. (행동적 오류는 python-list@python.org로 보내실 수도 있습니다.) 'docs@'은 자원봉사로 운영되는 메일링 리스트입니다. 보내신 보고가 메일링 리스트를 통해 고시되더라도 처리에 시간이 걸릴 수 있습니다.

source: `Documentation bugs`_
cs: `Chyby v dokumentaci`_
de: `Dokumentationsfehler`_
es_es: Errores de documentación
fa: مستند سازی اشکالات
id_id: `Bug dokumentasi`_
ja: 「ドキュメントのバグ」_
ko: '문서 오류'_
ko_kr: `버그 문서화`_
ru: `Ошибки в документации`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
cs: Seznam chyb v dokumentaci zaslaných do systému pro sledování hlášení o chybách v Pythonu.
de: Eine Liste von Dokumentationsfehlern, welche im Python Problem-Erfassers eingereicht wurden.
es_es: Una lista de errores de documentación que se han enviado al rastreador de problemas de Python.
fa: فهرستی از اشکالات مستندات که در ردیاب اشکال پایتون ثبت شده اند.
hu: Egy lista a beküldött dokumentációs hibákról a Python hibakövető rendszerébe.
id_id: Daftar dokumentasi bug yang telah dikirimkan ke Python issue tracker.
ja: 提出されたドキュメントのバグの一覧 Python issue tracker.
ko: 파이썬 이슈 트래커에 보고된 버그(Documentation bugs) 리스트.
ko_kr: 파이썬 이슈 트래커에 보고된 문서화 버그 리스트.
ru: Список ошибок в документации, которые были отправлены в систему отслеживания ошибок Python.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
cs: `Systém pro sledování hlášení o chybách<https://devguide.python.org/tracker/>`_
de: `Fehlerverfolgung <https://devguide.python.org/tracker/>`_
es_es: `Seguimiento de incidencias <https://devguide.python.org/tracker/>`_
fa: `پیگیری مشکل <https://devguide.python.org/tracker/>`_
id_id: `Pelacakan Masalah <https://devguide.python.org/tracker/>`_
ja: `課題追跡 <https://devguide.python.org/tracker/>`_
ko: `이슈 트래킹 <https://devguide.python.org/tracker/>`_
ko_kr: `이슈 트래킹 <https://devguide.python.org/tracker/>`_
ru: `Система отслеживания ошибок <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
cs: Přehled procesu navrhování vylepšení pomocí systému pro sledování hlášení o chybách.
de: Überblick über den Prozess der Meldung einer Verbesserung im Fehler-Erfasser.
es_es: Descripción general del proceso involucrado en informar una mejora en el rastreador.
fa: نمای کلی از فرآیند مربوط به گزارش یک بهبود در پیگیری.
hu: Egy javítás bejelentéséhez szükséges folyamat átnézése.
id_id: Gambaran umum tentang proses yang terlibat dalam melaporkan peningkatan pada pelacak.
ja: トラッカーでの改善報告プロセスに関する概要。
ko: 트래커 개선 리포트 관련 프로세스 개요
ko_kr: 트래커 개선 리포트 관련 프로세스 개요
ru: Обзор процесса отправки улучшений через трекер.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
cs: `Jak pomoci s dokumentací<https://devguide.python.org/docquality/#helping-with-documentation>`_
de: `Mithilfe bei der Dokumentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
es_es: Ayudando con la Documentación <https://devguide.python.org/docquality/#helping-with-documentation>`_
fa: `کمک به مستندسازی <https://devguide.python.org/docquality/#helping-with-documentation>`_
id_id: `Membantu dengan Dokumentasi <https://devguide.python.org/docquality/#helping-with-documentation>`_
ja: ドキュメント作成の支援 <https://devguide.python.org/docquality/#helping-with-documentation>`_
ko: `문서 관련 도움 <https://devguide.python.org/docquality/#helping-with-documentation>`_
ko_kr: `문서 관련 도움 <https://devguide.python.org/docquality/#helping-with-documentation>`_
ru: `Помощь с документацией <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
cs: Kompletní průvodce pro všechny, kdo chtějí přispět do anglické dokumentace Pythonu.
de: Umfassender Leitfaden für Personen, die an der Mitarbeit an der Python-Dokumentation interessiert sind.
es_es: Guía completa para personas interesadas en contribuir a la documentación de Python.
fa: راهنمای جامع برای افرادی که علاقه مند به مشارکت در مستندات Python هستند.
hu: Átfogó útmutató azoknak, akik szeretnének hozzájárulni a Python dokumentációhóz.
id_id: Panduan komprehensif bagi individu yang tertarik untuk berkontribusi pada dokumentasi Python.
ja: Pythonのドキュメント作成に貢献したい個人向けの総合ガイド。
ko: 파이썬 문서에 기여하고 싶은 사람들을 위한 자세한 가이드
ko_kr: 파이썬 문서에 기여하고 싶은 사람들을 위한 자세한 가이드
ru: Подробное руководство для тех, кто хочет внести свой вклад в документацию Python.

source: `Documentation Translations <https://devguide.python.org/documentation/translating/>`_
de: Dokumentationsübersetzungen <https://devguide.python.org/documentation/translating/>`_
es_es: `Traducciones de documentación <https://devguide.python.org/documentation/translating/>`_
fa: `ترجمه های مستندات '<https://devguide.python.org/documentation/translating/>`_'
id_id: `Penerjemahan Dokumentasi <https://devguide.python.org/documentation/translating/>`_
ja: `ドキュメントの翻訳` <https://devguide.python.org/documentation/translating/>`_
ko_kr: `문서 번역 <https://devguide.python.org/documentation/translating/>`_
ru: `Переводы документации <https://devguide.python.org/documentation/translating/>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
de: Eine Liste von GitHub-Seiten für die Übersetzung von Dokumentationen und deren Hauptkontakte.
es_es: Una lista de páginas de GitHub para la traducción de documentación y sus contactos principales.
fa: فهرستی از صفحات GitHub برای ترجمه مستندات و اطلاعات تماس اصلی آن ها.
hu: Lista stron GitHub do tłumaczenia dokumentacji i ich główne kontakty.
id_id: Daftar halaman GitHub untuk penerjemahan dokumentasi dan kontak utamanya.
ja: GitHubのドキュメント翻訳用ページの一覧とその主要な連絡先。
ko: Lista stron GitHub do tłumaczenia dokumentacji i ich główne kontakty.
ko_kr: 문서 번역을 위한 깃헙 페이지와 주요 연락처 목록.
ru: Список страниц GitHub для перевода документации и их основные контакты.

source: Using the Python issue tracker
cs: Jak používat systém pro správu chybových hlášení v Pythonu
de: Nutzen des Python Fehler-Erfassers
es_es: Usando el rastreador de problemas de Python
fa: با استفاده از ردیاب مشکل پایتون
hu: A Python hibakövető rendszerének használata.
id_id: Menggunakan pelacak masalah Python
ja: 使用する Python issue tracker
ko: Python 이슈트래커 사용하기
ko_kr: Python 이슈 트래커의 활용
ru: Использование системы отслеживания ошибок Python

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
de: Fehlerberichte für Python selbst sollten über den GitHub Fehler-Erfasser (https://github.com/python/cpython/issues) eingereicht werden. Der GitHub Fehler-Erfasser bietet ein Webformular, in das sachdienliche Informationen eingegeben und an die Entwickler übermittelt werden können.
es_es: Los informes de problemas para Python en sí deben enviarse a través del rastreador de problemas de GitHub (https://github.com/python/cpython/issues). El rastreador de problemas de GitHub ofrece un formulario web que permite ingresar y enviar información pertinente a los desarrolladores.
fa: گزارش اشکالات مربوط به خود پایتون باید از طریق ردیاب اشکال GitHub (https://github.com/python/cpython/issues) ارسال شوند. ردیاب اشکالات GitHub یک فرم وب ارائه می دهد که به شما امکان می دهد اطلاعات مربوطه را وارد کرده و برای توسعه دهندگان ارسال کنید.
hu: Zgłoszenia błędów w Pythonie powinny być zgłaszane przez system zgłoszeń GitHub (https://github.com/python/cpython/issues). System zgłoszeń GitHub posiada formularz, który pozwala wprowadzić stosowne informacje i wysłać je deweloperom.
id_id: Laporan masalah untuk Python sendiri harus dikirimkan melalui pelacak masalah GitHub (https://github.com/python/cpython/issues). Pelacak masalah GitHub menawarkan formulir web yang memungkinkan informasi terkait untuk dimasukkan dan diserahkan kepada pengembang.
ja: Python自体に関する問題報告は、GitHubのイシュートラッカー経由で提出してください (https://github.com/python/cpython/issues). GitHubのイシュートラッカーには、関連する情報を入力して開発者に送信できるウェブフォームが用意されています。
ko: Zgłoszenia błędów w Pythonie powinny być zgłaszane przez system zgłoszeń GitHub (https://github.com/python/cpython/issues). System zgłoszeń GitHub posiada formularz, który pozwala wprowadzić stosowne informacje i wysłać je deweloperom.
ko_kr: 파이썬 자체에 대한 이슈 보고서는 깃헙 이슈 트래커(https://github.com/python/cpython/issues)를 통해 제출해야 합니다. 깃헙 이슈 트래커는 관련 정보를 입력하고 개발자에게 제출할 수 있는 웹 양식을 제공합니다.
ru: Отчеты об ошибках для самого Python следует отправлять через трекер ошибок GitHub (https://github.com/python/cpython/issues). Трекер GitHub предлагает веб-форму, которая позволяет заполнить соответствующую информацию и отправить её разработчикам.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
de: Der erste Schritt beim Einreichen eines Berichts besteht darin, festzustellen, ob der Fehler bereits gemeldet wurde. Abgesehen davon, dass Sie den Entwicklern Zeit ersparen, haben Sie den Vorteil, dass Sie erfahren, was getan wurde, um das Problem zu beheben. Möglicherweise wurde das Problem bereits für die nächste Version behoben, oder es werden zusätzliche Informationen benötigt (in diesem Fall können Sie diese gerne zur Verfügung stellen, wenn Sie können!). Durchsuchen Sie dazu den Tracker über das Suchfeld oben auf der Seite.
es_es: El primer paso rellenando un informe es determinar si el problema ya ha sido enviado anteriormente. La ventaja de hacerlo, además de ahorrarles tiempo a los desarrolladores, es que tú aprendes como se ha arreglado el problema; Puede ser que el problema ya se haya resuelto para la siguiente versión, o quizás se necesite información adicional (¡en cuyo caso eres bienvenido a aportar si puedes!). Para hacer esto, busca la base de datos de bugs utilizando la caja de búsqueda en el borde superior de la página.
fa: اولین گام در ارائه یک گزارش این است که مشخص کنید آیا مشکل قبلاً گزارش شده است یا خیر. مزیت انجام این کار، علاوه بر صرفه جویی در وقت توسعه دهندگان، این است که می توانید بفهمید چه اقداماتی برای رفع آن انجام شده است؛ ممکن است مشکل برای نسخه بعدی قبلاً رفع شده باشد، یا اطلاعات بیشتری مورد نیاز باشد (در این صورت، اگر می‌توانید، خوشحال می‌شویم آن را ارائه دهید!). برای انجام این کار، در نوار جستجو بالای صفحه "tracker" را جستجو کنید.
hu: Pierwszym krokiem przy wypełnianiu zgłoszenia jest ustalenie, czy problem został już zgłoszony. Zaletą tego ustalenia, oprócz oszczędzenia czasu deweloperów, jest to, że dowiesz się, co zostało zrobione, aby go naprawić; być może problem został już naprawiony na następne wydanie lub potrzebne są dodatkowe informacje (w tym przypadku zapraszamy cię, żebyś je podał, jeśli możesz!). Aby to zrobić, przeszukaj istniejące zgłoszenia używając pola wyszukiwania na górze strony.
id_id: Langkah pertama dalam mengajukan laporan adalah menentukan apakah masalah tersebut sudah pernah dilaporkan. Keuntungannya, selain menghemat waktu pengembang, Anda juga dapat mengetahui apa yang telah dilakukan untuk memperbaikinya; mungkin saja masalahnya sudah diperbaiki untuk rilis berikutnya, atau informasi tambahan diperlukan (dalam hal ini Anda dipersilakan untuk memberikannya jika bisa!). Untuk melakukan hal ini, cari pelacak menggunakan kotak pencarian di bagian atas halaman.
ja: 報告を提出する最初のステップは、問題が既に報告されているかどうかを確認することです。 この手順の利点は、開発者の時間を節約できるだけでなく、問題の解決のために既に実施された措置を把握できる点にあります。場合によっては、その問題は既に次回のバージョンで修正されている可能性がありますリリース, 追加の情報が必要な場合（その場合は、ご提供いただける場合はどうぞお寄せください！）。これを行うには、ページの最上部に表示されている検索ボックスを使用してトラッカーを検索してください。
ko: Pierwszym krokiem przy wypełnianiu zgłoszenia jest ustalenie, czy problem został już zgłoszony. Zaletą tego ustalenia, oprócz oszczędzenia czasu deweloperów, jest to, że dowiesz się, co zostało zrobione, aby go naprawić; być może problem został już naprawiony na następne wydanie lub potrzebne są dodatkowe informacje (w tym przypadku zapraszamy cię, żebyś je podał, jeśli możesz!). Aby to zrobić, przeszukaj istniejące zgłoszenia używając pola wyszukiwania na górze strony.
ko_kr: 리포트를 제출하는 첫 번째 단계는 문제가 이미 보고되었는지 확인하는 것입니다. 이렇게 하면 개발자의 시간을 절약할 수 있을 뿐만 아니라, 문제 해결을 위해 어떤 조치가 취해졌는지 확인할 수 있다는 장점이 있습니다. 다음 릴리스에서 문제가 이미 해결되었거나 추가 정보가 필요할 수 있습니다(이 경우, 가능하면 제공해 주시면 됩니다!). 이를 위해 페이지 상단의 검색창을 사용하여 추적기를 검색할 수 있습니다.
ru: Первый шаг при подаче отчета — проверить, было ли уже сообщено об этой проблеме. Этот шаг не только помогает сэкономить время разработчикам, но и позволяет понять, какие усилия были приложены для устранения проблемы; возможно, проблема уже была исправлена в следующем релизе, или требуется дополнительная информация (в этом случае, если у вас есть возможность, пожалуйста, предоставьте её!). Для этого воспользуйтесь поиском в трекере, используя поле поиска в верхней части страницы.
